#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПроверитьНаличиеДополнительныхСоглашенийПоОбъекту(Объект) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ПриложенияКДоговорам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ПриложенияКДоговорам КАК CW_ПриложенияКДоговорам
	               |ГДЕ
				   |   \\УсловиеОбъкта";
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "\\УсловиеОбъкта","CW_ПриложенияКДоговорам.Договор = &Договор");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "\\УсловиеОбъкта","CW_ПриложенияКДоговорам.Родитель = &Договор");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор", Объект);
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Процедура - Дополнить массив ссылок  
//	Дополняет массив ссылок приложениями по договорам
//
// Параметры:
//  МассивОбъектовАрхива - 	 тип "Массив" 
//
Процедура ДополнитьМассивСсылок(МассивОбъектовАрхива) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПриложенияКДоговорам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ПриложенияКДоговорам КАК CW_ПриложенияКДоговорам
	               |ГДЕ
	               |	CW_ПриложенияКДоговорам.Договор В(&МассивОбъектовАрхива)";  
	
	Запрос.УстановитьПараметр("МассивОбъектовАрхива", МассивОбъектовАрхива);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если МассивОбъектовАрхива.Найти(Выборка.Ссылка) = Неопределено Тогда
			МассивОбъектовАрхива.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


//Служебные процедуры
Процедура ОбработатьФлагБухгалтерскийУчет() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Договора
	               |ИЗ
	               |	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоговорыПоГрузоперевозкам.БухгалтерскийУчет = ИСТИНА
	               |	И CW_ДоговорыПоГрузоперевозкам.ИспользуютсяПриложения = ИСТИНА
	               |	И CW_ДоговорыПоГрузоперевозкам.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ПриложенияКДоговорам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ПриложенияКДоговорам КАК CW_ПриложенияКДоговорам
	               |ГДЕ
	               |	CW_ПриложенияКДоговорам.Договор В
	               |			(ВЫБРАТЬ
	               |				ВТ_Договора.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_Договора КАК ВТ_Договора)
	               |	И CW_ПриложенияКДоговорам.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		спрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		спрОбъект.БухгалтерскийУчет = Истина;
		
		спрОбъект.ОбменДанными.Загрузка  = Истина;
		спрОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

//Служебные процедуры
#КонецЕсли
