
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыборИзДокументаОтчетЭкспедитора = Ложь;
	Если Параметры.Свойство("ВыборИзДокументаОтчетЭкспедитора") Тогда
		ВыборИзДокументаОтчетЭкспедитора = Параметры.ВыборИзДокументаОтчетЭкспедитора;
	КонецЕсли;
	
	Если не ВыборИзДокументаОтчетЭкспедитора Тогда
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	ИспользуютсяЗаказы 			= ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов");
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для версии КОРП
	
	
	ВыборПоЗаказам              = Параметры.ВыборПоЗаказам;
	ВыборПоДокументам 			= Параметры.ВыборПоДокументам;
	ВыборПоГрузоперевозкам 		= Параметры.ВыборПоГрузоперевозкам;
	
	ДатаОстатка 				= Параметры.ДатаОстатка;
	Контрагент    				= Параметры.Контрагент;
	Договор 					= Параметры.Договор;
	
	//Подсистема.УчетПриложенийДоговоров
	ПриложениеКДоговору 		= Параметры.ПриложениеКДоговору;
	//Подсистема.УчетПриложенийДоговоров

	ПодразделениеОрганизации 	= Параметры.ПодразделениеОрганизации;
	
	ЗаполнитьОстатки();
	ЗаполнитьИтоги();
	
	Если ВыборПоЗаказам Тогда
		Элементы.ОстаткиКПеревыставлениюПредставлениеОбъекта.Заголовок = "Заказ";
	КонецЕсли;
	Если ВыборПоГрузоперевозкам Тогда
		Элементы.ОстаткиКПеревыставлениюПредставлениеОбъекта.Заголовок = "Грузоперевозка";
	КонецЕсли;
	Если ВыборПоДокументам Тогда
		Элементы.ОстаткиКПеревыставлениюПредставлениеОбъекта.Заголовок = "Документ расходов";
	КонецЕсли;
	
	Элементы.ОстаткиКПеревыставлению.МножественныйВыбор = Параметры.ЕстьМножественныйВыбор;
	
КонецПроцедуры

#Область Обработчики_Команд_Формы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбранныеСтроки =  Элементы.ОстаткиКПеревыставлению.ВыделенныеСтроки;
	ЭтаФорма.Закрыть(ВыполнитьВыборнаСервере(ВыбранныеСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗначениеСтроки(Команда)
	
	ТекущиеДанные = Элементы.ОстаткиКПеревыставлению.ТекущиеДанные;
	ПоказатьЗначение(,ТекущиеДанные.ОбъектОстатков);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	
	ЗаполнитьОстатки();
	ЗаполнитьИтоги();
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ОстаткиКПеревыставлениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранныеСтроки =  Элементы.ОстаткиКПеревыставлению.ВыделенныеСтроки;
	ЭтаФорма.Закрыть(ВыполнитьВыборнаСервере(ВыбранныеСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиКПеревыставлениюПриАктивизацииСтроки(Элемент)
	ЗаполнитьИтогиВыделенного();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_Событий_формы_наСервере

&НаСервере
Процедура ЗаполнитьИтоги()
	
	Итог_Сумма 	= ОстаткиКПеревыставлению.Итог("Сумма")	;
	Итого_НДС 	= ОстаткиКПеревыставлению.Итог("НДС")	;
	Итого_Всего = ОстаткиКПеревыставлению.Итог("Всего")	;
	
	ЗаполнитьИтогиВыделенного();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтогиВыделенного()
	
	МассивВыделенныхСтрок = Элементы.ОстаткиКПеревыставлению.ВыделенныеСтроки;
	
	Итого_Всего_Выделено = 0;	Итого_НДС_Выделено = 0;	Итог_СуммаВыделено = 0;
	
	Для Каждого Идентификатор из МассивВыделенныхСтрок Цикл
		
		СтрокаТаблицы = ОстаткиКПеревыставлению.НайтиПоИдентификатору(Идентификатор);
		
		Итог_СуммаВыделено		= Итог_СуммаВыделено 	+ СтрокаТаблицы.Сумма;
		Итого_НДС_Выделено  	= Итого_НДС_Выделено 	+ СтрокаТаблицы.НДС;
		Итого_Всего_Выделено 	= Итого_Всего_Выделено 	+ СтрокаТаблицы.Всего;
		
	КонецЦикла;
	
КонецПроцедуры

&наСервере
Процедура ЗаполнитьОстатки()
	
	Запрос = новый Запрос;
	
	Если ВыборПоЗаказам Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка.Заказ КАК ОбъектОстатков,
		|	ПРЕДСТАВЛЕНИЕ(РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка.Заказ) КАК ПредставлениеОбъекта,";
	КонецЕсли;
	
	Если ВыборПоДокументам Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.ДокументРасходов КАК ОбъектОстатков,
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.ДокументРасходов.ПредставлениеДокумента КАК ПредставлениеОбъекта,";
	КонецЕсли;
	
	Если ВыборПоГрузоперевозкам Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка КАК ОбъектОстатков,
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка.CW_Представление КАК ПредставлениеОбъекта,";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "	
	|	СУММА(РегистрНакопленияCW_ПеревыставлениеОстатки.СуммаОстаток) КАК Сумма,
	|	СУММА(РегистрНакопленияCW_ПеревыставлениеОстатки.НДСОстаток) КАК НДС,
	|	СУММА(РегистрНакопленияCW_ПеревыставлениеОстатки.ВсегоОстаток) КАК Всего
	|ИЗ
	|	РегистрНакопления.CW_Перевыставление.Остатки(
	|			&ДатаОстатка,
	|			Контрагент = &Контрагент
	|				И Договор = &Договор
	
	//Подсистема.УчетПриложенийДоговоров
	|				И ПриложениеКДоговору = &ПриложениеКДоговору
	//Подсистема.УчетПриложенийДоговоров
	
	|				И ВЫБОР
	|					КОГДА &ВестиУчетПоПодразделениям
	|						ТОГДА ДокументРасходов.ПодразделениеОрганизации = &ПодразделениеОрганизации
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ	
	
	|) КАК РегистрНакопленияCW_ПеревыставлениеОстатки
	|
	|СГРУППИРОВАТЬ ПО";
	
	

	
	Если ВыборПоГрузоперевозкам Тогда
		Запрос.Текст = Запрос.Текст + "	
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка";
	КонецЕсли;
	
	Если ВыборПоЗаказам Тогда
		Запрос.Текст = Запрос.Текст + "	
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.Грузоперевозка.Заказ";
	КонецЕсли;
	
	Если ВыборПоДокументам Тогда
		Запрос.Текст = Запрос.Текст + "	
		|	РегистрНакопленияCW_ПеревыставлениеОстатки.ДокументРасходов";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаОстатка"				, ДатаОстатка);
	Запрос.УстановитьПараметр("Контрагент"				, Контрагент);
	Запрос.УстановитьПараметр("Договор"					, Договор);
	
	//Подсистема.УчетПриложенийДоговоров
	Запрос.УстановитьПараметр("ПриложениеКДоговору"		, ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	Запрос.УстановитьПараметр("ПодразделениеОрганизации"	, ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("ВестиУчетПоПодразделениям"	, ВестиУчетПоПодразделениям);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОстаткиКПеревыставлению.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьВыборНаСервере(МассивИдентификаторов)
	
	МассивОбъектов = Новый Массив;
	
	Для Каждого  Идентификатор из МассивИдентификаторов Цикл
		
		СтрокаДанных = ОстаткиКПеревыставлению.НайтиПоИдентификатору(Идентификатор);
		МассивОбъектов.Добавить(СтрокаДанных.ОбъектОстатков);
		
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(МассивОбъектов);	
	
КонецФункции

#КонецОбласти


