// Переопределяемые клиентские процедуры ВЕТИС

#Область ПрограммныйИнтерфейс

#Область ФормыДокументовОснований

// Устарело. Следует использовать СобытияФормИСКлиентПереопределяемый.ОбработкаОповещенияВФормеДокументаОснования.
// Вызывается при возникновении события ОбработкаОповещения в форме документа-основания.
// В данной процедуре можно переопределить стандартную обработку этого события механизмом ВЕТИС.
// Если процедура переопределена, то необходимо установить параметр СобытиеОбработано в значение Истина.
Процедура ОбработкаОповещенияВФормеДокументаОснования(Форма, Объект, ИмяСобытия,
			Параметр, Источник, СобытиеОбработано) Экспорт
	Возврат;
КонецПроцедуры

// Вызывается при возникновении события ОбработкаНавигационнойСсылки поля гиперссылки ВЕТИС в форме документа-основания.
// В данной процедуре можно переопределить стандартную обработку этого события механизмом ВЕТИС.
// Если процедура переопределена, то необходимо установить параметр СобытиеОбработано в значение Истина.
Процедура ОбработкаНавигационнойСсылкиВФормеДокументаОснования(Форма, Объект,
			Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, СобытиеОбработано) Экспорт
			
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ДополнительныеПараметры = Новый Структура("Основание", Объект.Ссылка);
		ОткрытьФорму("Документ.ИсходящаяТранспортнаяОперацияВЕТИС.ФормаОбъекта", ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочие

// Обработчик команды "Разбить строку".
//
// Параметры:
//  ТЧ - ДанныеФормыКоллекция - Табличная часть.
//  ЭлементФормы - ТаблицаФормы - Элемент формы.
//  ОповещениеПослеРазбиения - ОписаниеОповещения - Оповещение после разбиения строки ТЧ.
//  ПараметрыРазбиенияСтроки - (См. ОбщегоНазначенияУТКлиент.ПараметрыРазбиенияСтроки).
Процедура РазбитьСтрокуТабличнойЧасти(ТЧ, ЭлементФормы, ОповещениеПослеРазбиения = Неопределено, ПараметрыРазбиенияСтроки = Неопределено) Экспорт
	
	Возврат;
	
КонецПроцедуры

//Обработчик события НачалоВыбора
//Параметры:
//			- Форма Тип("Форма")
//			- Элемент Тип("ЭлементыФормы")
//			- Отбор Тип("Структура")
//			- СтрандартнаяОбработка Тип("Булево")
//
//Возвращаемое значение: нет
//
Процедура НачалоВыбора(Форма, Элемент, Отбор, СтандартнаяОбработка) Экспорт
	
	СобытияФормВЕТИСБПКлиент.ВыбратьТразакцию_НачалоВыбора(Форма, Элемент, Отбор, СтандартнаяОбработка);
	
КонецПроцедуры

//Обработчик события ОбработкаВыбора
//Параметры:
//			- Форма Тип("Форма")
//			- Элемент Тип("ЭлементыФормы")
//			- ВыбранноеЗначение Тип("Любой")
//			- СтандартнаяОбработка Тип("Булево")
//
//Возвращаемое значение: нет
//
Процедура ОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	СобытияФормВЕТИСБПКлиент.ПриВыбореДействия_ОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

//Обработчик события создание
//Параметры:
//			- Форма Тип("Форма")
//			- Элемент Тип("ЭлементыФормы")
//			- СтандартнаяОбработка Тип("Булево")
//
//Возвращаемое значение: нет
//
Процедура Создание(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СобытияФормВЕТИСБПКлиент.ПроизводственнаяТранзакция_ПриСоздании(Форма, Элемент, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
