
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуРеквизитовНаСервере(Параметры.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедкатирование(Команда)  
	
	ПараметрыЗакрытия = ЗавершитьРедкатированиеНаСервере(); 
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаСервере
Функция ЗавершитьРедкатированиеНаСервере()
	
	Структура = Новый Структура;
	
	Для Каждого СтрокаТаблицы из ТаблицаРеквизитов Цикл
		
		Если Не СтрокаТаблицы.Выбор Тогда
			Продолжить;
		КонецЕсли;

		Структура.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Значение);	
	КонецЦикла;   
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаРеквизитов.ТекущаяСтрока;
	ТаблицаРеквизитовЗначениеПриИзмененииНаСервере(ТекущаяСтрока); 

КонецПроцедуры

&НаСервере
Процедура ТаблицаРеквизитовЗначениеПриИзмененииНаСервере(Знач ТекущаяСтрока)   
	
	СтрокаТекущая = ТаблицаРеквизитов.НайтиПоИдентификатору(ТекущаяСтрока);
	Если ЗначениеЗаполнено(СтрокаТекущая.Значение) Тогда
		СтрокаТекущая.Выбор = Истина; 
	КонецЕсли;
	                                   
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитовНаСервере(Ссылка) 
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка); 
	
	Попытка   
		ДоступныеРеквизиты = МенеджерОбъекта.ПолучитьДоступныеРеквизиты(ТаблицаРеквизитов.Выгрузить());
	Исключение   
		ВызватьИсключение "Функция ""ПолучитьДоступныеРеквизиты"" не найдена!";
	КонецПопытки;
	
	ТаблицаРеквизитов.Загрузить(ДоступныеРеквизиты);
	
КонецПроцедуры
