#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);	
	// --- 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок",ВРег(МетаданныеОтчета.Синоним));
	
	// Установим параметры
	//НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Дата1",Настройки["Дата1"]);
	//НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Дата2",Настройки["Дата2"]);
	
	// Добавим поле "Расчет ДТ" в выбранные поля, так как по нему формируется расшифровка
	ПолеРасчетДТ = НастройкиСКД.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("РасчетДТ")); 
	
	Если НЕ ПолеРасчетДТ = Неопределено Тогда
		
		ДобавитьПоле = Истина;
		ВыбранноеПолеРасчетДТ = Неопределено;
		Для Каждого Стр из НастройкиСКД.Выбор.Элементы Цикл
			Если Стр.Поле = ПолеРасчетДТ.Поле Тогда
				Стр.Использование     = Истина;
				ДобавитьПоле          = Ложь;
				ВыбранноеПолеРасчетДТ = Стр;
				Прервать;
			КонецЕсли; 
		КонецЦикла;	
		
		Если ДобавитьПоле Тогда
			НовПоле = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			НовПоле.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
			НовПоле.Использование    = Истина;
			НовПоле.Поле             = ПолеРасчетДТ.Поле;
			НастройкиСКД.Выбор.Элементы.Сдвинуть(НовПоле,-НастройкиСКД.Выбор.Элементы.Количество()); // Переместим данное поле на первую позицию
		Иначе
			НастройкиСКД.Выбор.Элементы.Сдвинуть(ВыбранноеПолеРасчетДТ,-НастройкиСКД.Выбор.Элементы.Количество());	
		КонецЕсли; 
	
	КонецЕсли; 
					
КонецПроцедуры
#КонецЕсли