#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СтатусыОбъектаМетаданных(ИмяОбъектаМетаданных) Экспорт
	
	НазначениеСтатуса = Справочники.CW_НазначенияСтатусов.ПолучитьНазначениеСтатусовПоТипуОбъекрта(ИмяОбъектаМетаданных);
	
	Результат = Новый Массив;
	
	Если НазначениеСтатуса = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СтатусыДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_СтатусыДокументов КАК CW_СтатусыДокументов
	|ГДЕ
	|	CW_СтатусыДокументов.ПометкаУдаления = ЛОЖЬ
	|	И CW_СтатусыДокументов.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	CW_СтатусыДокументов.Код
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Владелец", НазначениеСтатуса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтатусНовогоОбъекта(ИмяОбъектаМетаданных) Экспорт
	
	НазначениеСтатуса = Справочники.CW_НазначенияСтатусов.ПолучитьНазначениеСтатусовПоТипуОбъекрта(ИмяОбъектаМетаданных);
	
	Если НазначениеСтатуса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_СтатусыДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_СтатусыДокументов КАК CW_СтатусыДокументов
	|ГДЕ
	|	CW_СтатусыДокументов.ПометкаУдаления = ЛОЖЬ
	|	И CW_СтатусыДокументов.Владелец = &Владелец
	|	И CW_СтатусыДокументов.НазначатьДляНовыхОбъектов = ИСТИНА";
	
	Запрос.УстановитьПараметр("Владелец", НазначениеСтатуса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура СоздатьСтатусНовогоОбъекта(Владелец, ПроводитьПоБухгалтерскомуУчету) Экспорт
	
	НовыйСтатус = Справочники.CW_СтатусыДокументов.СоздатьЭлемент();
	НовыйСтатус.Владелец 						= Владелец;
	НовыйСтатус.Наименование 					= "Новый";
	НовыйСтатус.ПроводитьПоБухгалтерскомуУчету 	= ПроводитьПоБухгалтерскомуУчету;
	НовыйСтатус.НазначатьДляНовыхОбъектов 		= Истина;
	НовыйСтатус.Комментарий 					= "Статус нового объекта";
	НовыйСтатус.Записать();
	
КонецПроцедуры

#КонецЕсли
