#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НазначатьДляНовыхОбъектов Тогда
		ПроверитьДублированиеФлага(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДублированиеФлага(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_СтатусыДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_СтатусыДокументов КАК CW_СтатусыДокументов
	               |ГДЕ
	               |	CW_СтатусыДокументов.НазначатьДляНовыхОбъектов = ИСТИНА
	               |	И CW_СтатусыДокументов.Ссылка <> &Ссылка
	               |	И CW_СтатусыДокументов.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
	Запрос.УстановитьПараметр("Владелец",	Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Отказ = Истина;
		ШаблонСообщения = "Для новых объектов уже назначен статус %1";
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.Ссылка);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"НазначатьДляНовыхОбъектов","Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли