
&НаКлиенте
Процедура ЗаполнитьСтрокуСоединенияИБ(Команда)
	НаборКонстант.CW_DT_СтрокаСоединенияИнформационнойБазы = ВРег(СтрокаСоединенияИнформационнойБазы());ПриИзмененииРеквизитаНаКлиенте(Элементы.CW_DT_СтрокаСоединенияИнформационнойБазы, Ложь)
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуСоединения(Команда)
	СоздатьНастройкуСоединенияНаСервере();ПриИзмененииРеквизитаНаКлиенте(Элементы.CW_DT_ОсновнаяНастройкаСоединения, Ложь);
КонецПроцедуры

&НаСервере
Процедура СоздатьНастройкуСоединенияНаСервере()
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_НастройкиСоединения.Наименование КАК Наименование
		|ИЗ
		|	Справочник.CW_DT_НастройкиСоединения КАК CW_DT_НастройкиСоединения
		|ГДЕ
		|	CW_DT_НастройкиСоединения.Наименование = ""Основная""";
	Если Запрос.Выполнить().Пустой() Тогда
		Настройка				= Справочники.CW_DT_НастройкиСоединения.СоздатьЭлемент();
		Настройка.Наименование	= "Основная";
		Настройка.АдресСервера	= "81.95.26.46";
		Настройка.Порт			= 32145;
		Настройка.АдресРесурса	= "/datatransfer/hs/api";
		Настройка.Записать();
		НаборКонстант.CW_DT_ОсновнаяНастройкаСоединения = Настройка.Ссылка;	
	Иначе
		Сообщить("Основная настройка уже создана!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеВвода(Пароль,Организация) Экспорт
	Если НЕ Пароль = Неопределено Тогда
		УстановитьПароль(Организация,Пароль);
		Элементы.ДСПароли.Обновить();
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ДСПаролиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ПроверитьИдентификаторУчастника(Элементы.ДСПароли.ТекущиеДанные.Ссылка) Тогда
		ПоказатьВводСтроки(Новый ОписаниеОповещения("ПослеВвода",ЭтотОбъект,Элементы.ДСПароли.ТекущиеДанные.Ссылка),"");	
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПароль(Организация,Пароль)
	CW_DT.УстановитьПароль(Организация,Пароль);	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьИдентификаторУчастника(Участник)
	Возврат CW_DT.ПроверитьИдентификаторУчастника(Участник)
КонецФункции

&НаКлиенте
Процедура ТранспортныеСообщенияВходящие(Команда)
	ОткрытьФорму("Документ.CW_DT_ТранспортноеСообщениеВходящее.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСообщенияИсходящие(Команда)
	ОткрытьФорму("Документ.CW_DT_ТранспортноеСообщениеИсходящее.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияОбъектов(Команда)
	ОткрытьФорму("РегистрСведений.CW_DT_Синхронизация.ФормаСписка");
КонецПроцедуры
 


///////

&НаКлиенте
Процедура ПриИзмененииРеквизитаФормы(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции


&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	//Для констант заданных через реквизиты формы
	//Если РеквизитПутьКДанным = "{ИмяКонстанты}" Тогда
	//	НовоеЗначение = {ИмяКонстанты};
	//	Константы.{ИмяКонстанты.Установить(НовоеЗначение);
	//	Возврат "";
	//КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции
