#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления Тогда
		
		Использование = Ложь;
		
	КонецЕсли; 
	
	ОбменДанными.Загрузка = Истина;
	
КонецПроцедуры

// --- 

Процедура ПриЗаписи(Отказ)
	
	ОбработкаОбъект = Неопределено;
	
	Если (НЕ Обработка.Пустая()) Тогда
		
		Если ОбработкаОбъект = Неопределено Тогда
			
			ОбработкаОбъект = _ПО.ПолучитьОбработку(Обработка);
			// --- 
			Попытка
				
				// если есть событие ПриЗаписиОбмена
				ОбработкаОбъект.ПриЗаписиОбмена(Ссылка);
				
			Исключение
			    //ОписаниеОшибки()
			КонецПопытки; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	// РЕГИСТРАЦИЯ МЕТАДАННЫХ
	// ---------------------------------------------------------------------------- 
	
	// очищаем привязки метаданных
	НЗ = РегистрыСведений.CW_МетаданныеДляРегистрации.СоздатьНаборЗаписей();
	НЗ.Отбор.Обмен.Значение = Ссылка;
	НЗ.Отбор.Обмен.Использование = Истина;
	НЗ.Записать(Истина);
	// --- 
	
	// получаем список метаданных для регистрации
	// и записываем их в регистр "CW_РегистрацияМетаданныхДляВыгрузки"
	
	Если НЕ Обработка.Пустая() И Использование И Выгрузка Тогда
		
		Если ОбработкаОбъект = Неопределено Тогда
			
			ОбработкаОбъект = _ПО.ПолучитьОбработку(Обработка);
			
		КонецЕсли; 
		// получаем список регистрируемых метаданных
		МассивМетаданных = ОбработкаОбъект.РегистрируемыеМетаданные();
		Для каждого СМ Из МассивМетаданных Цикл
			
			Запись = НЗ.Добавить();
			
			Запись.Метаданное = CW_Обмены_ПИ.МетаданноеКонфигурации(СМ.Имя);
			Запись.ПроверкаПередЗаписью = СМ.ПередЗаписью;
			Запись.ПроверкаПриЗаписи = СМ.ПриЗаписи;
			Запись.ПроверкаПередУдалением = СМ.ПередУдалением;
			Запись.Обмен = Ссылка;
			
		КонецЦикла; 
		НЗ.Записать(Истина);
		
		Если CW_Настройки.Отладка() Тогда
			
			МассивСсылок = Новый Массив;
			МассивСсылок.Добавить(Ссылка);
			CW_Журнал.ОтладочноеСообщение("Обмен.Общие","Для настройки обмена """+Строка(Ссылка)+""" обновлены данные по регистрируемым объенктам:"+Символы.ПС+_сф.м_Представление(МассивМетаданных,Символы.ПС,"Имя"),МассивСсылок);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// РЕГИСТРАЦИЯ РЕГЛАМЕНТНЫХ ЗАДАНИЙ
	// ---------------------------------------------------------------------------- 
	
	Если НЕ Обработка.Пустая() И Использование И Выгрузка И РегламентнаяВыгрузка Тогда
		
		// удаляем существующие
		Ответ = _ПО.УдалитьСвязанныеРегламентныеЗадания(Ссылка);
		
		// вызываем функцию формирования регламентных заданий
		Если ОбработкаОбъект = Неопределено Тогда
			
			ОбработкаОбъект = _ПО.ПолучитьОбработку(Обработка);
			
		КонецЕсли;
		// вызываем функцию регистрации
		Ответ = ОбработкаОбъект.РегистрацияРегламентныхЗаданий(Ссылка);
		Если Ответ.Код = 0 Тогда
			
			МассивРЗ = Ответ.МассивИдентификаторовРегламентныхЗаданий;
			// --- 
			
			// записываем привязку регламентных заданий
			Для каждого Идентификатор Из МассивРЗ Цикл
				
				_ПО.ДобавитьСвязанноеРегламентноеЗадание(Ссылка,Идентификатор);
				
			КонецЦикла; 
			
		Иначе
			
			// ошибка
			// ... (делаем что-нибудь)
			
		КонецЕсли; 
		
	Иначе
		
		// получаем связанные регламентные задания и удаляем их
		Ответ = _ПО.УдалитьСвязанныеРегламентныеЗадания(Ссылка);
		
	КонецЕсли; 
	
	// --- 
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

	



#КонецЕсли
