
Процедура ЗаписатьИнициациюСогласования(ГруппаПользователей, мОбъекты) Экспорт
	
	Набор = РегистрыСведений.CW_ДоступноИнициацияСогласования.СоздатьНаборЗаписей();
	Набор.Отбор.ГруппаПользователей.Установить(ГруппаПользователей);
	Набор.Прочитать();
	Набор.Очистить();
	
	Для Каждого ЭлементМассива из мОбъекты Цикл
		СтрокаНабора = Набор.Добавить();
		СтрокаНабора.ГруппаПользователей 			= ГруппаПользователей;
		СтрокаНабора.ИдентификаторОбъектаМетаданных = ЭлементМассива;
		СтрокаНабора.Доступно 						= Истина;
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

Функция ПолучитьДоступныеОбъектыСогласования(ГруппаПользователей) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоступноИнициацияСогласования.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных
	               |ИЗ
	               |	РегистрСведений.CW_ДоступноИнициацияСогласования КАК CW_ДоступноИнициацияСогласования
	               |ГДЕ
	               |	CW_ДоступноИнициацияСогласования.ГруппаПользователей = &ГруппаПользователей
	               |	И CW_ДоступноИнициацияСогласования.Доступно = Истина";     
	
	Запрос.УстановитьПараметр("ГруппаПользователей", ГруппаПользователей);
	
	Массив = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.ИдентификаторОбъектаМетаданных);
	КонецЦикла; 
	
	Возврат Массив;
	
КонецФункции