&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Адрес", АдресЭлектроннойПочты);
	
	Параметры.Свойство("ТипДокумента", ТипДокумента);
	
	ШаблонТекста 	= "%1 будет направлен на указанный в поле адрес, при необходимости вы можете его заменить или дополнить другими адресами разделяя их символом "";"" (точка с запятой).";
	ШаблонЗаголовка = "Отправить %1 на адрес электронной почты";
	
	ШрифтЗаголовка = Новый Шрифт(, 12, Истина);
	
	Элементы.НадписьТекст.Заголовок  = СтрШаблон(ШаблонТекста, ТипДокумента);
	Элементы.ЗаголовокФормы.Заголовок = Новый ФорматированнаяСтрока(СтрШаблон(ШаблонЗаголовка, НРег(ТипДокумента)), ШрифтЗаголовка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	Если Не ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан адрес!",,"АдресЭлектроннойПочты");
		Возврат;
	КонецЕсли;
	
	Если Не КорректныйАдрес() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указан некорректный адрес!",,"АдресЭлектроннойПочты");
		Возврат;
	КонецЕсли;
	
	
	ЭтаФорма.Закрыть(АдресЭлектроннойПочты);
	
КонецПроцедуры

&НаКлиенте
Функция КорректныйАдрес()
	
	мАдреса = СтрРазделить(АдресЭлектроннойПочты, ";");
	
	Для Каждого Адрес из мАдреса Цикл 
		
		ПозицияСимвола = СтрНайти(Адрес,"@");
		Если ПозицияСимвола = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ПозицияВторогоСимвола = СтрНайти(Адрес,"@",,,2);
		Если ПозицияВторогоСимвола > 0 Тогда
			Возврат ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
