#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметры = ПростойИнтерфейсКлиент.НовыеПараметрыОткрытияФормы1СОтчетность(
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Окно,
		ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.ЕГРЮЛ"));
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.ОбработчикОткрытияФормы = Новый ОписаниеОповещения("ОбработчикОткрытияФормы1СОтчетность",
		ПростойИнтерфейсКлиент,
		ДополнительныеПараметры);
	
	ПараметрыОткрытия.Заголовок = НСтр("ru = 'ЕГРЮЛ'");
	ПараметрыОткрытия.ЗамерПроизводительности = "СозданиеФормыРегламентированнаяОтчетность";
	
	ПараметрыФормы = ПростойИнтерфейсКлиент.ПараметрыОткрытияЗависимыхФорм(ПараметрыВыполненияКоманды.Источник);

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти