
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте                  
Процедура Выбрать(Команда)    
	
	ТекущиеДанные = Элементы.СписокФорматовФайлаМакета.ТекущиеДанные;  
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуШаблона(ТекущиеДанные.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФорматовФайлаМакетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЭлементСписка = СписокФорматовФайлаМакета.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ОткрытьФормуШаблона(ЭлементСписка.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуШаблона(ИмяФормата)
	
	ЗначенияЗаполнения.Вставить("ИмяФормата", 	ИмяФормата);
	ЗначенияЗаполнения.Вставить("Владелец",  	Объект.Владелец);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ",                Параметры.Ключ);
	СтруктураПараметров.Вставить("Ключ",                Параметры.Ключ);
	СтруктураПараметров.Вставить("ЗначениеКопирования", ЗначениеКопирования);
	СтруктураПараметров.Вставить("ЗначенияЗаполнения",  ЗначенияЗаполнения);
	
	Модифицированность = Ложь;
	Закрыть(); 
	
	ИмяФормыШаблона = "ФормаРедактированияШаблона"+ИмяФормата;
	ОткрытьФорму("Справочник.CW_ШаблоныДокументов.Форма."+ИмяФормыШаблона, СтруктураПараметров);

КонецПроцедуры

  &НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	ЗначенияЗаполнения  = Параметры.ЗначенияЗаполнения;
	
   	СписокФорматовФайлаМакета.Добавить("HTML", 	"Форматированный документ (html)");
	СписокФорматовФайлаМакета.Добавить("MXL", 	"Табличный документ (mxl)");

КонецПроцедуры
