
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НоваяСтрока = ТаблицаОформления.Добавить();      
	НоваяСтрока.Заголовок 	= "Шрифт";
	НоваяСтрока.Имя 		= "Шрифт";
	НоваяСтрока.Оформление	= Параметры.Шрифт;
	
	НоваяСтрока = ТаблицаОформления.Добавить(); 
	НоваяСтрока.Заголовок 	= "Цвет текста";
	НоваяСтрока.Имя 		= "ЦветТекста";
	НоваяСтрока.Оформление	= Параметры.ЦветТекста;
	
	НоваяСтрока = ТаблицаОформления.Добавить(); 
	НоваяСтрока.Заголовок 	= "Цвет фона";
	НоваяСтрока.Имя 		= "ЦветФона";
	НоваяСтрока.Оформление	= Параметры.ЦветФона;    

	НоваяСтрока = ТаблицаОформления.Добавить(); 
	НоваяСтрока.Заголовок 	= "Отображать заголовок";
	НоваяСтрока.Имя 		= "ОтображатьЗаголовок";
	НоваяСтрока.Оформление	= Параметры.ОтображатьЗаголовок;    
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ДанныеОформления = Новый Структура;
	
	Для Каждого СтрокаТаблицы из ТаблицаОформления Цикл
		ДанныеОформления.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Оформление);	
	КонецЦикла;
	
	ЭтаФорма.Закрыть(ДанныеОформления);
	
КонецПроцедуры
