
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь 		  = ПараметрыСеанса.ТекущийПользователь;
	ПользовательИсходящие = ПараметрыСеанса.ТекущийПользователь;  

	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь();
	Элементы.ПользовательИсходящие.ТолькоПросмотр = НЕ ЭтоПолноправныйПользователь;
	
	Если НЕ ЭтоПолноправныйПользователь Тогда
		ЗаполнитьСписокВыбораИсходящиеПользователи();   
		Если Элементы.ПользовательИсходящие.СписокВыбора.Количество() > 0  Тогда
			Элементы.ПользовательИсходящие.РежимВыбораИзСписка = Истина;   
			Элементы.ПользовательИсходящие.ТолькоПросмотр = Ложь;
		КонецЕсли;                                                              
	КонецЕсли;
	
	ЗаполнитьСписокДоступныхГруппИПользователей();
	
	УстановитьСписокВыбораГруппПользователя();
	УстановитьСписокПользователейГруппы();
	
	УстановитьОтборСпискаВходящие();
	УстановитьОтборСпискаИсходящие();
	
	УстановитьУсловноеОформление();
	
	УстановитьСписокВыбораВходящиеИсходящие();
	
	УстановитьТекущуюСтраницу();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокВыбораИсходящиеПользователи()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ЛицаЗамещающиеИнициаторовСогласования.ИнициаторСогласования КАК ИнициаторСогласования
	               |ИЗ
	               |	РегистрСведений.CW_ЛицаЗамещающиеИнициаторовСогласования КАК CW_ЛицаЗамещающиеИнициаторовСогласования
	               |ГДЕ
	               |	CW_ЛицаЗамещающиеИнициаторовСогласования.ЛицоЗамещающееИнициатораСогласования = &ТекущийПользователь
	               |	И CW_ЛицаЗамещающиеИнициаторовСогласования.ИнициаторСогласования <> &ТекущийПользователь";
	
	Запрос.УстановитьПараметр("ТекущийПользователь", ПользовательИсходящие);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() > 0 Тогда
      Элементы.ПользовательИсходящие.СписокВыбора.Добавить(ПользовательИсходящие);
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		Элементы.ПользовательИсходящие.СписокВыбора.Добавить(Выборка.ИнициаторСогласования);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура  УстановитьСписокВыбораВходящиеИсходящие()
	
	Элементы.ВходящиеИсходящиеВторая.СписокВыбора.Очистить();
	Элементы.ВходящиеИсходящиеВторая.СписокВыбора.Добавить(0, "Входящие",,БиблиотекаКартинок.CW_ВходящиеДокументы);
	Элементы.ВходящиеИсходящиеВторая.СписокВыбора.Добавить(1, "Исходящие",,БиблиотекаКартинок.CW_БумажныйСамолетик);
	
	Элементы.ВходящиеИсходящие.СписокВыбора.Очистить();
	Элементы.ВходящиеИсходящие.СписокВыбора.Добавить(0, "Входящие",,БиблиотекаКартинок.CW_ВходящиеДокументы);
	Элементы.ВходящиеИсходящие.СписокВыбора.Добавить(1, "Исходящие",,БиблиотекаКартинок.CW_БумажныйСамолетик);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//Входящие объекты
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "ВходящиеОбъекты");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементОформления.Отбор,
		"ВходящиеОбъекты.Срок", ВидСравненияКомпоновкиДанных.Меньше, ТекущаяДата());
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "ВходящиеОбъекты");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементОформления.Отбор,
		"ВходящиеОбъекты.Срок", ВидСравненияКомпоновкиДанных.Меньше, ТекущаяДата());
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
	
	Если Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "ВходящиеОбъекты");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементОформления.Отбор,
		"ВходящиеОбъекты.Пользователь", ВидСравненияКомпоновкиДанных.Равно, ПараметрыСеанса.ТекущийПользователь);
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,8,Истина));
	КонецЕсли;
	
	//Исходящие объекты
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "ИсходящиеОбъекты");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементОформления.Отбор,
		"ИсходящиеОбъекты.План", ВидСравненияКомпоновкиДанных.Меньше, ТекущаяДата());
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
	
	Если ПользовательИсходящие = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "ИсходящиеОбъекты");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементОформления.Отбор,
		"ИсходящиеОбъекты.Пользователь", ВидСравненияКомпоновкиДанных.Равно, ПараметрыСеанса.ТекущийПользователь);
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,8,Истина));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхГруппИПользователей()
	
	мГруппыСогласования = Справочники.CW_ГруппыСогласования.ПолучитьГруппыСогласованияПользователя(Пользователь);
	
	мДоступныеПользователи = Новый Массив;
	Для Каждого ЭлементМассива из мГруппыСогласования Цикл
		мПользователи = Справочники.CW_ГруппыСогласования.ПолучитьСписокПользователейГруппыСогласования(ЭлементМассива);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мДоступныеПользователи, мПользователи, Истина); 
	КонецЦикла;
	
	СписокДоступныхГрупп.ЗагрузитьЗначения(мГруппыСогласования);
	СписокДоступныхПользователей.ЗагрузитьЗначения(мДоступныеПользователи);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораГруппПользователя()
	
	Элементы.ГруппаСогласования.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхГрупп.ВыгрузитьЗначения());
	
	Если СписокДоступныхГрупп.Количество() > 1 Тогда
		Элементы.ГруппаСогласования.СписокВыбора.Вставить(0, ПредопределенноеЗначение("Справочник.CW_ГруппыСогласования.ПустаяСсылка"), "<Все группы>");
	КонецЕсли;
	
	Если СписокДоступныхГрупп.Количество() = 1 Тогда
		ГруппаСогласования = СписокДоступныхГрупп.Получить(0).Значение;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьСписокПользователейГруппы()
	
	Если ГруппаСогласования.Пустая() Тогда
		мПользователиГруппы 		= СписокДоступныхПользователей.ВыгрузитьЗначения();
		ПредставлениеПустойСсылки 	= "<Все пользователи>";
	Иначе
		мПользователиГруппы = Справочники.CW_ГруппыСогласования.ПолучитьСписокПользователейГруппыСогласования(ГруппаСогласования);
		ПредставлениеПустойСсылки 	= "<Все пользователи группы>";
	КонецЕсли;
	
	Элементы.ПользовательВходящие.СписокВыбора.ЗагрузитьЗначения(мПользователиГруппы);
	
	Если мПользователиГруппы.Количество() > 1 Тогда
		Элементы.ПользовательВходящие.СписокВыбора.Вставить(0, ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"), ПредставлениеПустойСсылки);
	КонецЕсли;
	
	Если мПользователиГруппы.Количество() = 1 Тогда
		Пользователь = мПользователиГруппы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаВходящие()
	
	ВходящиеОбъекты.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = ВходящиеОбъекты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ГруппаСогласования");
	
	Если ГруппаСогласования = ПредопределенноеЗначение("Справочник.CW_ГруппыСогласования.ПустаяСсылка") Тогда
		ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение  	= СписокДоступныхГрупп;
	Иначе
		ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение  	= ГруппаСогласования;
	КонецЕсли;
	
	ЭлементОтбора = ВходящиеОбъекты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Пользователь");
	
	Если Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
		ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение  	= СписокДоступныхПользователей;
	Иначе
		ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение  	= Пользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаИсходящие()
	
	ИсходящиеОбъекты.Отбор.Элементы.Очистить();
	
	Если ПользовательИсходящие <> ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
		ЭлементОтбора = ИсходящиеОбъекты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Пользователь");
		ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение  	= ПользовательИсходящие;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСогласованияПриИзменении(Элемент)
	
	УстановитьСписокПользователейГруппы();
	УстановитьОтборСпискаВходящие();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательВходящиеПриИзменении(Элемент)
	
	УстановитьСписокВыбораГруппПользователя();
	УстановитьОтборСпискаВходящие();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательИсходящиеПриИзменении(Элемент)
	
	УстановитьОтборСпискаИсходящие();
	УстановитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ВходящиеИсходящиеПриИзменении(Элемент)
	
	УстановитьТекущуюСтраницу();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтраницу()
	
	ТекущаяСтраница = ?(ВходящиеИсходящие=0, Элементы.СтраницаВходящие, Элементы.СтраницаИсходящие);
	Элементы.СтраницыФормы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходящиеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФормуСогласованияОбъекта(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФормуСогласованияОбъекта(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСогласованияВходящие(Команда)
	
	КлючЗаписи = Элементы.ВходящиеОбъекты.ТекущаяСтрока;
	ОткрытьФормуСогласованияОбъекта(КлючЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСогласованияИсходящие(Команда)
	
	КлючЗаписи = Элементы.ИсходящиеОбъекты.ТекущаяСтрока;
	ОткрытьФормуСогласованияОбъекта(КлючЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСогласованияОбъекта(КлючЗаписи);
	
	ОписаниеОпвещения = Новый ОписаниеОповещения("ОбновитьСписок", ЭтотОбъект, КлючЗаписи);
	
	ПараметрыОбъекта = Новый Структура("ОбъектСогласования", ПолучитьОбъектЗаписи(КлючЗаписи));
	ОткрытьФорму("ОбщаяФорма.CW_ФормаСогласования", ПараметрыОбъекта, ЭтаФорма,,,,ОписаниеОпвещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбъектЗаписи(КлючЗаписи)
	
	 Возврат КлючЗаписи.ОбъектСогласования;
	 
КонецФункции

&НаКлиенте
Процедура ОбновитьСписок(Результат, КлючЗаписи) Экспорт
	
	ОповеститьОбИзменении(КлючЗаписи);
	
КонецПроцедуры

