
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	_ВосстановитьСтандартныеНастройки();
	_ВосстановитьСеансовуюНастройку();
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
КонецПроцедуры

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Об = РеквизитФормыВЗначение("Отчет");
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Об.ПолучитьМакет("Схема").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть = Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка    = Ложь;
	Иначе
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка    = Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка    = Истина;
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			// Отбор
			НастройкиКД = "";
			СеансоваяНастройка.Свойство("Отбор", НастройкиКД);
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			Для Каждого СтрОтбор из НастройкиКД.Отбор.Элементы Цикл
				НовОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовОтбор, СтрОтбор);
			КонецЦикла;	
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	//Если Группировки.Количество() = 0 Тогда
	//	Предупреждение("Не выбрано ни одной группировки!");
	//	Возврат;				
	//КонецЕсли;	
	
	_Настройка(Истина);
	СформироватьОтчет();
	ОбработатьОтчет();
		
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	
	Настройки = _сф.ст_Создать("Дата1,Дата2,пвхПараметр_Грузоотправитель,пвхПараметр_КоличествоСуток,ЕдиницаИзмеренияСутки,Группировки,Отбор");
	Настройки.Отбор       = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор));
	
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "0:00:00", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "23:59:59", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
    СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	// ---------------------------------------------------------------------------- 
	
	Значение = ПолучитьДанныеРасшифровкинаСервере(Расшифровка);
	ПоказатьЗначение(,Значение); 
	
	
	//ДоступныеДействия = Новый Массив();
	//ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	//ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
	//
	//// Осуществим выбор действия расшифровки пользователем
	//ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	//ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеРасшифровкинаСервере(Расшифровка)
	
	_ДанныеРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ПолеРасшифровки    =_ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0]; 
	
	Пока Не ПолеРасшифровки.Поле = "РасчетДТ" Цикл
		 Расшифровка     = Расшифровка - 1;
		 ПолеРасшифровки =_ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0];
	КонецЦикла;	
	
	Возврат ПолеРасшифровки.Значение;
		
	//СтруктураПолей = Новый Структура;
	//Для каждого Элемент Из _ДанныеРасшифровки.Элементы Цикл
	//	Попытка
	//		СтруктураПолей.Вставить(Элемент.ПолучитьПоля()[0].Поле, Элемент.ПолучитьПоля()[0].Значение);
	//	Исключение
	//	КонецПопытки;
	//КонецЦикла; 
	
	//Возврат СтруктураПолей.РасчетДТ;
	
КонецФункции
 
&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);

КонецПроцедуры

&НаСервере
Функция ПолучитьДР()
	
    Возврат ПолучитьИзВременногоХранилища(Отчет.АдресРасшифровки);
	
КонецФункции

