
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма);
	CW_Документы.ОтображениеКнопокКоманднойПанелиФормыСписка(ЭтаФорма);
	// ---------------------------------------------------------------------------- 
	
	Параметры.Свойство("РежимВыбора",Элементы.Список.РежимВыбора);
	Если (Элементы.Список.РежимВыбора) Тогда
		
		Элементы.Список.МножественныйВыбор=Ложь;
		
	КонецЕсли; 

	_ЗагрузитьСеансовуюНастройку();

	_ПраваДоступа();  
	
	УтверждениеБюджетов 		= CW_ПраваДоступа.ПравоДоступно("УтверждениеБюджетов");  
 	ОтменаУтвержденияБюджетов 	= CW_ПраваДоступа.ПравоДоступно("ОтменаУтвержденияБюджетов");  

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);


КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ПраваДоступа()
	// --- 
	
	ПравоРедактирования = Истина; //(CW_ПраваДоступа.ПравоДоступно("???")
	Если НЕ ПравоРедактирования Тогда

		Элементы.Список.ИзменятьСоставСтрок = Ложь;
		Элементы.Список.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Элементы.ФормаОтборСортировка.Видимость = CW_Настройки.ПолучитьНастройкуПользователя(, "РежимОтладкиВключен");
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _СохранитьСеансовуюНастройку()
	// --- 
	
	_УФС.СохранитьСеансовыеНастройки(ЭтаФорма,,_ПФ_НастройкаСписка().СписокКолонок);
	
	// --- 
КонецФункции

&НаСервере
Функция _ЗагрузитьСеансовуюНастройку()
	// --- 
	
	Настройка = _УФС.ЗагрузитьСеансовыеНастройки(ЭтаФорма);
	_ОбработатьНастройкуСписка(Настройка);
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура НастройкаСписка(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияНастройкиСписка",ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаНастройкиСписка",_ПФ_НастройкаСписка(),,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияНастройкиСписка(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		_ОбработатьНастройкуСписка(Ответ); 
	КонецЕсли;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _ПФ_НастройкаСписка()
	// --- 
	
	ПФ = Новый Структура("Источник,СписокКолонок",ЭтаФорма.Заголовок,Новый Массив);
	// --- 
	_СформироватьСтруктуруКолонок(Элементы.Список,ПФ.СписокКолонок);
	СписокКолонок.ЗагрузитьЗначения(ПФ.СписокКолонок);
	// --- 
	Возврат(ПФ);
	
	// --- 
КонецФункции
 
&НаСервере
Процедура _СформироватьСтруктуруКолонок(Элемент,МассивСК)
	// --- 
	
	// обходим подчинённые элементы
	Для каждого ПЭ Из Элемент.ПодчиненныеЭлементы Цикл
		
		Узел = _ШаблонУзла();
		_сф.ст_ЗаполнитьСвойства(Узел,"Имя,Заголовок,Видимость",ПЭ);
		Узел.ЭтоГруппа = (ТипЗнч(ПЭ) <> Тип("ПолеФормы"));
		МассивСК.Добавить(Узел);
		// --- 
		Если Узел.ЭтоГруппа Тогда
			
			_СформироватьСтруктуруКолонок(ПЭ,Узел.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция _ШаблонУзла()
	// --- 
	
	Возврат(Новый Структура("Имя,Заголовок,Видимость,ИзменениеВидимости,ЭтоГруппа,Элементы","","",Ложь,Истина,Ложь,Новый Массив));
	
	// --- 
КонецФункции

// --- 

&НаСервере
Процедура _ОбработатьНастройкуСписка(Настройка)
	// --- 
	
	Если (Настройка = Неопределено) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Попытка
		
		// необходимо проверить порядок и видимость, 
		// сначала видимость
		Для каждого СК Из Настройка Цикл
			
			_ОбновитьВидимость(СК);
			
		КонецЦикла; 
		// потом порядок
		Если (СписокКолонок.Количество()=0) Тогда
			_СформироватьСтруктуруКолонок(Элементы.Список,СписокКолонок);
			_ОбновитьПорядок(Настройка);
		Иначе
			_ОбновитьПорядок(Настройка);
		КонецЕсли; 
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки; 
	
	_СохранитьСеансовуюНастройку();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьВидимость(СК)
	// --- 
	
	ЭлементФормы = Элементы.Найти(СК.Имя);
	Если ЭлементФормы <> Неопределено Тогда
		
		ЭлементФормы.Видимость = СК.Видимость;
		Если СК.Видимость И СК.ЭтоГруппа Тогда
			
			Для каждого Элемент Из СК.Элементы Цикл
				
				_ОбновитьВидимость(Элемент);
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьПорядок(Настройка)
	// --- 
	
	ТекущийИндекс = 1;
	Для каждого СК Из Настройка Цикл
		
		ПередвигаемыйЭлемент = Элементы[СК.Имя];
		Элементы.Переместить(ПередвигаемыйЭлемент, ПередвигаемыйЭлемент.Родитель);
		
		Если СК.ЭтоГруппа Тогда
			
			_ОбновитьПорядок(СК.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
	СписокКолонок.ЗагрузитьЗначения(Настройка);
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура КомандаСкопироватьБюджет(Команда)
	
	Если (Элементы.Список.ТекущиеДанные = Неопределено) Тогда
		
		ПоказатьПредупреждение(,"Вариант бюджета не выбран");
		
	Иначе
		
		// показываем форму выбора
		ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВариантаНазначения",ЭтотОбъект, Новый Структура()); 
		ОткрытьФорму("Справочник.CW_ВариантыБюджетовПоЗаявкам.ФормаВыбора",_ПараметрыФормыВыбораВариантаБюджета(Элементы.Список.ТекущаяСтрока),ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПараметрыФормыВыбораВариантаБюджета(ТекущийВариант)
	// --- 
	
	ПФ = Новый Структура("Отбор,РежимВыбора",Новый Структура("Владелец",ТекущийВариант.Владелец),Истина);
	Возврат(ПФ);
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура ОбработкаВыбораВариантаНазначения(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> Элементы.Список.ТекущаяСтрока) Тогда
			
			Результат = _ВыполнитьКопированиеВариантаБюджета(Элементы.Список.ТекущаяСтрока, Ответ);
			Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
				
				ПоказатьПредупреждение(,"Копирование выполнено успешно.");
				
			Иначе
				
				ПоказатьПредупреждение(,"Ошибка копирования: "+_УФКС.ПредставлениеОшибки(Результат));
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ВыполнитьКопированиеВариантаБюджета(ВариантИсточник,ВариантПриемник)
	// --- 
	
	// проверяем, что вариант приёмник пустой
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", ВариантПриемник);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если (ТЗ.Количество() <> 0) Тогда
		
		_УФКС.Ответ(1,"Выбранный вариант бюджета уже заполнен.");
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Владелец", ВариантИсточник);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если (ТЗ.Количество() = 0) Тогда
		
		_УФКС.Ответ(1,"Отсутствуют данные для копирования");
		
	КонецЕсли; 
	
	Попытка
		
		Для каждого Стр Из ТЗ Цикл
			
			НоваяСтатья = Стр.Ссылка.Скопировать();
			НоваяСтатья.Владелец = ВариантПриемник;
			НоваяСтатья.Записать();
			
		КонецЦикла; 
		// --- 
		Возврат(_УФКС.Ответ());
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		_УФКС.Ответ(1,"Ошибка копирования");
		
	КонецПопытки; 
	
	// --- 
КонецФункции

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент) 
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;  
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;     
	
	Элементы.ФормаБюджетБлокировать.Доступность 	= Не ТекущиеДанные.Заблокирован и УтверждениеБюджетов;
	Элементы.ФормаБюджетРазблокировать.Доступность 	= ТекущиеДанные.Заблокирован и ОтменаУтвержденияБюджетов;
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетБлокировать(Команда) 
	
 	ТекущиеДанные = Элементы.Список.ТекущиеДанные;  
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаБюджетБлокировать", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Версия бюджета "+СокрЛП(ТекущиеДанные.Наименование) +" будет заблокирована. Продолжить?", Режим, 0);
		
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопросаБюджетБлокировать(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	БюджетБлокироватьНаСервере(); 
	
	Оповестить("Запись_ВариантыБюджетов");

КонецПроцедуры 

&НаКлиенте
Процедура БюджетРазблокировать(Команда) 
	
 	ТекущиеДанные = Элементы.Список.ТекущиеДанные;  
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаБюджетРазблокировать", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Версия бюджета "+СокрЛП(ТекущиеДанные.Наименование) +" будет разаблокирована. Продолжить?", Режим, 0);
	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеЗакрытияВопросаБюджетРазблокировать(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	БюджетРазблокироватьнаСервере();
	
	Оповестить("Запись_ВариантыБюджетов");

КонецПроцедуры 


&НаСервере
Процедура БюджетБлокироватьНаСервере() 
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока; 
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Запись = РегистрыСведений.CW_УтверждениеБюджетов.СоздатьМенеджерЗаписи();
	Запись.ВерсияБюджета = ТекущаяСтрока.Ссылка;
	Запись.Объект 		 = ТекущаяСтрока.Владелец;
	Запись.Записать();       
	
	Заблокирован = истина;
	Элементы.ФормаБюджетБлокировать.Доступность 	= Не Заблокирован и УтверждениеБюджетов;
	Элементы.ФормаБюджетРазблокировать.Доступность 	= Заблокирован и ОтменаУтвержденияБюджетов;

	ЗаписатьИсториюУтвержденияБюджета(ТекущаяСтрока, Истина); 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура БюджетРазблокироватьнаСервере()
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока; 
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Запись = РегистрыСведений.CW_УтверждениеБюджетов.СоздатьМенеджерЗаписи();
	Запись.ВерсияБюджета = ТекущаяСтрока.Ссылка;
	Запись.Объект 		 = ТекущаяСтрока.Владелец;  
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Запись.Удалить();
		ЗаписатьИсториюУтвержденияБюджета(ТекущаяСтрока);
	КонецЕсли;
	
	Заблокирован = Ложь;
	Элементы.ФормаБюджетБлокировать.Доступность 	= Не Заблокирован и УтверждениеБюджетов;
	Элементы.ФормаБюджетРазблокировать.Доступность 	= Заблокирован и ОтменаУтвержденияБюджетов;

	Элементы.Список.Обновить();

КонецПроцедуры


&НаСервере
Процедура ЗаписатьИсториюУтвержденияБюджета(ТекущаяСтрока, Заблокирован = Ложь)
	
	УстановитьПривилегированныйРежим(Истина); 
	
	Запись = РегистрыСведений.CW_ИсторияУтверждениеБюджетов.СоздатьМенеджерЗаписи();
	Запись.Период 		 = ТекущаяДата();
	Запись.ВерсияБюджета = ТекущаяСтрока.Ссылка;
	Запись.Объект 		 = ТекущаяСтрока.Владелец;  
	Запись.Пользователь  = CW_Настройки.Пользователь();
	Запись.ПризнакУтверждения = Заблокирован;

	Запись.Записать(Истина);

КонецПроцедуры

