
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресСхемы", 	АдресСхемы);
	Параметры.Свойство("АдресОтбора", 	АдресОтбора);

	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	Настройки = ПолучитьИзВременногоХранилища(АдресОтбора);
	Если Настройки <> Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ПоместитьВоВременноеХранилище(КомпоновщикНастроек.Настройки, АдресОтбора);
	ЭтаФорма.Закрыть(Истина);

КонецПроцедуры
