
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сообщение = "";
	Параметры.Свойство("Сообщение", Сообщение);   
	Параметры.Свойство("РегистрационныйНомер", РегистрационныйНомер);   
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить("На электронный адрес ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Сообщение,Новый Шрифт(,,Истина)));
	МассивСтрок.Добавить(" отправлен пин-код для получения лицензии.");
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить( Новый ФорматированнаяСтрока("Введите полученный пин-код в поле ввода и нажмите ""Продолжить""",Новый Шрифт(,,Истина)));
	МассивСтрок.Добавить(Символы.ПС);
	                      
	Элементы.Информация.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПродолжить(Команда) 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РегистрационныйНомер", РегистрационныйНомер);
	СтруктураПараметров.Вставить("ПинКод", 				 ПинКод);
  	СтруктураПараметров.Вставить("Событие", 			 1);

	Успешно =  CW_РегистрацияПрограммыСервер.ПроверитьВведенныйПинКод(СтруктураПараметров);   
	Если Не Успешно Тогда
		ПоказатьПредупреждение(, "Введен некорректный пин-код");
		Возврат;
	КонецЕсли;  
	
	CW_РегистрацияПрограммыСервер.ЗаблокироватьПинКод(СтруктураПараметров);
	
	Ответ = CW_РегистрацияПрограммыСервер.ПолучитьФайлКлючаЧерезИнтернетНаСервере(СтруктураПараметров); 
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры

