#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ТекущийПользовательВГруппеСогласования(ГруппаСогласования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Пользователь КАК Пользователь
	               |ИЗ
	               |	Справочник.CW_ГруппыСогласования.СписокСотрудников КАК CW_ГруппыСогласованияДоговоровСписокСотрудников
	               |ГДЕ
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Ссылка = &ГруппаСогласования
	               |	И CW_ГруппыСогласованияДоговоровСписокСотрудников.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("ГруппаСогласования", ГруппаСогласования);
	Запрос.УстановитьПараметр("Пользователь", 		ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьПервогоПользователяГруппыСогласования(ГруппаСогласования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Пользователь КАК Пользователь
	               |ИЗ
	               |	Справочник.CW_ГруппыСогласования.СписокСотрудников КАК CW_ГруппыСогласованияДоговоровСписокСотрудников
	               |ГДЕ
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Ссылка = &ГруппаСогласования
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.НомерСтроки";
	
	Запрос.УстановитьПараметр("ГруппаСогласования", ГруппаСогласования);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Пользователь;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
КонецФункции

Функция ПолучитьГруппыСогласованияПользователя(Пользователь = Неопределено) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Ссылка КАК ГруппаСогласования
	               |ИЗ
	               |	Справочник.CW_ГруппыСогласования.СписокСотрудников КАК CW_ГруппыСогласованияДоговоровСписокСотрудников
	               |ГДЕ
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Пользователь = &Пользователь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ГруппыСогласованияДоговоровСписокСотрудников.Ссылка";
	
	Запрос.УстановитьПараметр("Пользователь", ?(Пользователь=Неопределено, ПараметрыСеанса.ТекущийПользователь, Пользователь));
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ГруппаСогласования);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокПользователейГруппыСогласования(ГруппаСогласования) Экспорт
	
	Возврат ГруппаСогласования.СписокСотрудников.ВыгрузитьКолонку("Пользователь");
	
КонецФункции

#КонецЕсли
