#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте();
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиОбработкаОтправляемыхПисем();
	
	СтруктураОписания.Наименование 				= "Обработка отправляемых писем (пример)";
	СтруктураОписания.Описание 					= "Пример работы с отправляемымми письмами";
	СтруктураОписания.Версия 					= "3.2.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	СтруктураОписания.Настройка 				= Истина;

	//Методы обработчика
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "ОбработатьПараметрыФормыОтправкиПисьма");
	
	//Формы обработчика
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыНастроекОбъекта(СтруктураОписания, 	"ФормаНастройки");
	
	Возврат СтруктураОписания;

	
КонецФункции

// Пример функции доработки параметров
Функция ОбработатьПараметрыФормыОтправкиПисьма(струПараметрыФормыОтправкиПисьма) Экспорт 
	
	СтруктураОтвета = Новый Структура("Код, ОписаниеОшибки", 0, "");
	
	//струПараметрыФормыОтправкиПисьма = Новый Структура("СтруктураПисьма, Событие");
	//.Событие         = Новый Структура("Контрагент, ОбъектСобытия", Док.Контрагент, Док);
	//.СтруктураПисьма = _ЭП.СтруктураПисьма();
	//СП = Новый Структура;
	//СП.Вставить("Кодировка","UTF-8");
	//СП.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Обычная);
	//СП.Вставить("Категории", "");
	//// --- 
	//СП.Вставить("Отправитель",Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка()); // учетная запись ЭП (!!!)
	//// адреса - массив из структур адреса (Адрес-ОтображаемоеИмя)
	//СП.Вставить("ОбратныеАдреса",Новый Массив); // необязательный
	//СП.Вставить("Получатели",Новый Массив);
	//СП.Вставить("Получатели_Копии",Новый Массив);
	//СП.Вставить("Получатели_СкрытыеКопии",Новый Массив);
	//// --- 
	//СП.Вставить("Тема","");
	//СП.Вставить("Тексты",Новый Массив); // значение - структура Текст-ТипТекста-Кодировка
	//СП.Вставить("Вложения",Новый Массив); // значение - структура ИмяФайла-ТипАдреса-Адрес
	
	стру = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъект);
	Если ТипЗнч(стру) = Тип("Структура") Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, стру);
	КонецЕсли;
	
	док = струПараметрыФормыОтправкиПисьма.Событие.ОбъектСобытия;
	Если ТипЗнч(док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")
		и ЗначениеЗаполнено(док)
		и док.ФормируетсяСчет
	Тогда 
		// только для счетов
		
		Если ЗначениеЗаполнено(ХарактеристикаАдресДляОтправкиПисьма) Тогда 
			з = Новый Запрос(
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	влож.АдресДляОтправкиПисьма
				|ИЗ
				|	(ВЫБРАТЬ
				|		ВЫРАЗИТЬ(CW_ХарактеристикиГрузоперевозок.Значение КАК СТРОКА(256)) КАК АдресДляОтправкиПисьма
				|	ИЗ
				|		Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
				|			ПО CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка = CW_ХарактеристикиГрузоперевозок.Грузоперевозка
				|				И (CW_ХарактеристикиГрузоперевозок.Параметр = &ХарактеристикаАдресДляОтправкиПисьма)
				|	ГДЕ
				|		CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ДоходыСсылка
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		CW_УчетныеЗаписиЭлектроннойПочты.ПочтовыйАдрес
				|	ИЗ
				|		Справочник.CW_УчетныеЗаписиЭлектроннойПочты КАК CW_УчетныеЗаписиЭлектроннойПочты
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_НастройкиПользователей КАК CW_НастройкиПользователей
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
				|				ПО CW_НастройкиПользователей.Пользователь.ФизическоеЛицо = CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.ОперативныйМенеджер
				|					И (CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ДоходыСсылка)
				|			ПО CW_УчетныеЗаписиЭлектроннойПочты.Ссылка = CW_НастройкиПользователей.УчетнаяЗаписьЭлектроннойПочты) КАК влож"
			);
			з.УстановитьПараметр("ДоходыСсылка", док);
			з.УстановитьПараметр("ХарактеристикаАдресДляОтправкиПисьма", ХарактеристикаАдресДляОтправкиПисьма);
			рз = з.Выполнить();
			выб = рз.Выбрать();
			Пока выб.Следующий() Цикл
				// если есть адрес и его ещё нет в письме, то добавим
				Если ЗначениеЗаполнено(выб.АдресДляОтправкиПисьма) 
					И Неопределено=струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Получатели.Найти(выб.АдресДляОтправкиПисьма)
					И Неопределено=струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Получатели_Копии.Найти(выб.АдресДляОтправкиПисьма)
				Тогда 
					// в копию
					_ЭП.ДобавитьПолучателейИзСтроки(струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Получатели_Копии, выб.АдресДляОтправкиПисьма);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	//// пример упрощённый, не для подражания
	//
	//// можно делать некие общие действия для всех отправляемых писем
	//_ЭП.ДобавитьПолучателейИзСтроки(струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Получатели_СкрытыеКопии, "s.anton@coralway.ru");
	//
	//Если "Сатурн"=СокрЛП(струПараметрыФормыОтправкиПисьма.Событие.Контрагент) Тогда 
	//	// для некоторых условий можно доработать письмо немного иначе, чем обычно
	//	струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Тексты[0].Текст = 
	//		струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Тексты[0].Текст
	//		+ Символы.ПС 
	//		+ Символы.ПС 
	//		+ "PS Просьба не забывать возвращать оригиналы документов! Иначе получится как в тот раз!"
	//	;
	//КонецЕсли;
	
	// можно по некоторому условию (например, выполнив отправку прямо отсюда) отказаться от вызова стандартной интерактивной формы отправки
	//СтруктураОтвета.Вставить("ОткрыватьСтандартнуюФормуОтправкиПочты", Ложь);
	
	Возврат СтруктураОтвета;

КонецФункции
#КонецЕсли