//ПиктограммыОтчетов 0 - удален, 1 - действующий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КодСостояния = 1;    
	РаботаСВнешнимиРесурсамиЗаблокирована = РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована(); 
	
	ПрограммныйПродукт = "ESD";
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	ДатаНачалаПериода 		= НачалоГода(ТекущаяДата());
	ДатаОкончанияПериода 	= КонецГода(ТекущаяДата());
	
	Заголовок = "Сервис ""Обменс С ГИСЭПД"". Документы за период: "+ ПредставлениеПериода(ДатаНачалаПериода, ДатаОкончанияПериода);
	
	Элементы.ОбщаяКомандаCW_ОбменГИСЭПДПродлитьПодписку.Видимость = Не РаботаСВнешнимиРесурсамиЗаблокирована;
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	ПолучитьДанныеПоСчетам();
	УстановитьОтборСтрокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КодСостоянияПриИзменении(Элемент)
	
	УстановитьОтборСтрокНаСервере();

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСтрокНаСервере()
	
	ФиксированнаяСтруктура = Неопределено;
	
	Если КодСостояния > 0 Тогда
		ОтборСтрок = Новый Структура("КодСостояния", КодСостояния);
		ФиксированнаяСтруктура = Новый ФиксированнаяСтруктура(ОтборСтрок);
	КонецЕсли;
	
	Элементы.ТаблицаСчетов.ОтборСтрок = ФиксированнаяСтруктура;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоСчетам() 
	
	ТаблицаСчетов.Очистить();  
	
	Если РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеСостояний = ПолучитьСоответствиеСостоянийСчета();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("software", 	XMLСтрока(ПрограммныйПродукт));
	СтруктураJSON.Вставить("start",		XMLСтрока(ДатаНачалаПериода));
	СтруктураJSON.Вставить("end", 		XMLСтрока(ДатаОкончанияПериода));
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_getinvoices", СтруктураJSON);
	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");    
	
	Если Ответ <> Неопределено Тогда
		Если Ответ.КодСостояния = 200 Тогда 
			
			СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);
			АдресЭлектроннойПочты = XMLЗначение(Тип("Строка"), СтруктураJSON.email);			
			
			Для каждого Invoice из СтруктураJSON.Invoices Цикл  
				
				НоваяСтрока = 	ТаблицаСчетов.Добавить();
				НоваяСтрока.ДатаЗаписи		= XMLЗначение(Тип("Дата"), 		Invoice.request);
				
				НоваяСтрока.КодСостояния	= XMLЗначение(Тип("Число"), 	Invoice.status);    
				НоваяСтрока.ИндексКартинки  = ПолучитьИндексКартинки(НоваяСтрока.КодСостояния); 
				НоваяСтрока.Состояние		= СоответствиеСостояний.Получить(НоваяСтрока.КодСостояния);    
				
				НоваяСтрока.ПредставлениеСчета	= XMLЗначение(Тип("Строка"), 	Invoice.inv);    
				НоваяСтрока.ПредставлениеАкта	= XMLЗначение(Тип("Строка"), 	Invoice.act);    
			
				НоваяСтрока.ЕстьСчет	= XMLЗначение(Тип("Булево"), 	Invoice.invflg);    
				НоваяСтрока.ЕстьАкт		= XMLЗначение(Тип("Булево"), 	Invoice.actflg);    
				
				Если Invoice.Свойство("rate") тогда
					rate = Invoice.rate;
					НоваяСтрока.ТарифID = XMLЗначение(Тип("УникальныйИдентификатор"), 	rate.id);  
					НоваяСтрока.ПредставлениеТарифа =	СокрЛП(XMLЗначение(Тип("Строка"),	rate.name)) +
														" с "	+ Формат(XMLЗначение(Тип("Дата"), rate.start), 	"ДФ=dd.MM.yyyy")+
														" по "	+ Формат(XMLЗначение(Тип("Дата"), rate.end), 	"ДФ=dd.MM.yyyy");
				КонецЕсли;
			
				НоваяСтрока.СуммаСчета  		= XMLЗначение(Тип("Число"), 	Invoice.amount);
				НоваяСтрока.ИдентифкаторСчета   = XMLЗначение(Тип("Строка"), 	Invoice.id);
				НоваяСтрока.СрокДействия       	= XMLЗначение(Тип("Дата"), 	 	Invoice.valid);
				НоваяСтрока.Оплачен            	= XMLЗначение(Тип("Булево"), 	Invoice.paid);
				НоваяСтрока.ДатаОплаты       	= XMLЗначение(Тип("Дата"), 	 	Invoice.paiddate);
				        
				НоваяСтрока.Корзина 			= Истина;      
				НоваяСтрока.ДействиеОтменить    = "Отменить";
				
				НоваяСтрока.ПисьмоСчет 				= Истина;      
				НоваяСтрока.ДействиеОтправитьСчет 	= "Получить счет";      
				
				НоваяСтрока.ПисьмоАкт 				= Истина;      
				НоваяСтрока.ДействиеОтправитьАкт 	= "Получить акт";      
			
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИндексКартинки(Состояние)
	
	Если Состояние = 3 Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеСостоянийСчета()
	
	Результат = Новый Соответствие;
	Результат.Вставить(1, "Не оплачен");
	Результат.Вставить(2, "Оплачен");
	Результат.Вставить(3, "Отменен");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаСчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.ГиперссылкаЯчейки Тогда
		
		Если Поле.Имя = "ДействиеОтправитьСчет" Тогда
			
			НачатьПолучениеПечатнойФормыСчета(ВыбраннаяСтрока);
			
		ИначеЕсли Поле.Имя = "ДействиеОтправитьАкт" Тогда
			
			НачатьПолучениеПечатнойФормыАкта(ВыбраннаяСтрока);
			
		ИначеЕсли Поле.Имя = "ДействиеОтменить" Тогда
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ВыбраннаяСтрока);
			ПоказатьВопрос(Оповещение, "Счет будет отменен. Продолжить?", Режим, 0);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ВыбраннаяСтрока) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	мВыделенныеСтроки = Новый Массив;
	мВыделенныеСтроки.Добавить(ВыбраннаяСтрока);
	
	РезультатВыполнения =  ПродолжитьОтменуСчетовНаСервереВФоне(мВыделенныеСтроки);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатОтменыСчетов", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ОформитьПодпискуБЭ(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьСписокСчетов", ЭтотОбъект);
		
	ПараметрыФормы = Новый Структура("ПрограммныйПродукт", ПрограммныйПродукт);
	ОткрытьФорму("ОбщаяФорма.CW_ОбменГИСЭПДПродлениеПодписки", ПараметрыФормы, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокСчетов(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьНаСервере();
	
КонецПроцедуры

//Отмена счета
&НаКлиенте
Процедура ПродолжитьОтменуСчетов(Результат, ВыделенныеСтроки) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьОтменуСчетовНаСервереВФоне(ВыделенныеСтроки);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатОтменыСчетов", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьОтменуСчетовНаСервереВФоне(ВыделенныеСтроки)
	
	тТаблицаСчетов = РеквизитФормыВЗначение("ТаблицаСчетов");
	тТаблицаСчетов.Очистить();
	тТаблицаСчетов.Свернуть("ДатаЗаписи,ИдентифкаторСчета,ТарифID");
	
	Для Каждого ВыбраннаяСтрока из ВыделенныеСтроки Цикл
		СтрокаТекущая = ТаблицаСчетов.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если СтрокаТекущая.КодСостояния = 3 Тогда
			//Пропускаем счета которые нельзя отменять
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока =  тТаблицаСчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТекущая);
	КонецЦикла;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Отмена счетов на оплату ЛКК";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("РегистрационныйНомер", 	РегистрационныйНомер);
	ПараметрыПроцедуры.Вставить("ПрограммныйПродукт", 		ПрограммныйПродукт);
	ПараметрыПроцедуры.Вставить("ТаблицаСчетов", 			тТаблицаСчетов);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ОбменГИСЭПДДополнительный.ВыполнитьОтменуСчетов",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатОтменыСчетов(РезультатВыполнения, Дополнительныепараметры) Экспорт

	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		СтруктураОтвета = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		Если СтруктураОтвета.КодСостояния = 200 Тогда
			ПоказатьОповещениеПользователя("Отмена счета",,"Выбранные счета на оплату отменены"); 
		Иначе
			ПоказатьПредупреждение(,"Не удалсь отменить счета по причине "+ СтруктураОтвета.ТекстСостояния+"
			|Повторите попытку позднее.",,"Доходы нерезидентов");
		КонецЕсли;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка отмены счетов!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьОповещениеПользователя("Отмена счета",,"Не удалось отменить счета на оплату");
	КонецЕсли;
	
	ПолучитьДанныеПоСчетам();

	
КонецПроцедуры
//Отмена счета


//Получение печатной формы
&наКлиенте
Процедура НачатьПолучениеПечатнойФормыСчета(ВыбраннаяСтрока)
	
	СтрокаТекущая = ТаблицаСчетов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаТекущая.КодСостояния = 3 Тогда
		ПоказатьПредупреждение(, "Отправка счета в состоянии "+СокрЛП(СтрокаТекущая.Состояние)+ " недоступна");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентифкаторСчета",	СтрокаТекущая.ИдентифкаторСчета);
	ДополнительныеПараметры.Вставить("ТипДокумента",		"Счет");
	ДополнительныеПараметры.Вставить("ФоноваяПроцедура",	"CW_ОбменГИСЭПДДополнительный.ПолучитьПечатнуюФормуСчета"); 
	ДополнительныеПараметры.Вставить("ТекстОповещения",		"Отправка счета");
	ДополнительныеПараметры.Вставить("ОписаниеОповещения",	"Счет отправен успешно");

	Оповещение = Новый ОписаниеОповещения("ПродолжитьПолучениеПечатнойФормыСчета",ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФормуВводаАдреса(СтрокаТекущая, "Счет", Оповещение);
		
КонецПроцедуры


&наКлиенте
Процедура НачатьПолучениеПечатнойФормыАкта(ВыбраннаяСтрока)
	
	СтрокаТекущая = ТаблицаСчетов.НайтиПоИдентификатору(ВыбраннаяСтрока);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентифкаторСчета", 	СтрокаТекущая.ИдентифкаторСчета);
	ДополнительныеПараметры.Вставить("ТипДокумента", 		"Акт");
	ДополнительныеПараметры.Вставить("ФоноваяПроцедура", 	"CW_ОбменГИСЭПДДополнительный.ПолучитьПечатнуюФормуАкта"); 
	ДополнительныеПараметры.Вставить("ТекстОповещения",		"Отправка акта");
	ДополнительныеПараметры.Вставить("ОписаниеОповещения",	"Акт отправен успешно");
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьПолучениеПечатнойФормыАкта",ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФормуВводаАдреса(СтрокаТекущая, "Акт", Оповещение);

КонецПроцедуры

&наКлиенте
Процедура ОткрытьФормуВводаАдреса(Знач СтрокаТекущая, ТипДокумента, Оповещение )
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес", 			АдресЭлектроннойПочты);
	СтруктураПараметров.Вставить("ТипДокумента", 	ТипДокумента);
	
	ОткрытьФорму("ОбщаяФорма.CW_ОбменГИСЭПДФормаВводаАдреса", СтруктураПараметров, ЭтаФорма,,,,Оповещение);

КонецПроцедуры


&НаКлиенте
Процедура ПродолжитьПолучениеПечатнойФормыСчета(Адрес, ДополнительныеПараметры) Экспорт
	
	Если Адрес = Неопределено 
		или Адрес = КодВозвратаДиалога.Отмена  Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьПолучениеПечатнойФормыСчетаАктаНаСервереВФоне(ДополнительныеПараметры.ИдентифкаторСчета, Адрес, ДополнительныеПараметры.ФоноваяПроцедура);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПолученияПечатнойФормы", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПолучениеПечатнойФормыАкта(Адрес, ДополнительныеПараметры) Экспорт
	
	Если Адрес = Неопределено 
		или Адрес = КодВозвратаДиалога.Отмена  Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьПолучениеПечатнойФормыСчетаАктаНаСервереВФоне(ДополнительныеПараметры.ИдентифкаторСчета, Адрес, ДополнительныеПараметры.ФоноваяПроцедура);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПолученияПечатнойФормы", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПродолжитьПолучениеПечатнойФормыСчетаАктаНаСервереВФоне(ИдентифкаторСчета, Адрес, ФоноваяПроцедура)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Получение печатной формы счета/акта ЛКК";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("РегистрационныйНомер", 	РегистрационныйНомер);
	ПараметрыПроцедуры.Вставить("ИдентифкаторСчета", 		ИдентифкаторСчета);
	ПараметрыПроцедуры.Вставить("Адрес", 					Адрес);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ФоноваяПроцедура,ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатПолученияПечатнойФормы(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		СтруктураОтвета = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		Если СтруктураОтвета.КодСостояния = 200 Тогда
			ПоказатьОповещениеПользователя(Дополнительныепараметры.ТекстОповещения,,Дополнительныепараметры.ОписаниеОповещения);
		Иначе
			ПоказатьПредупреждение(,СтруктураОтвета.ТекстСостояния+"
			|Повторите попытку позднее.",,"Личный кабинет клиента");
		КонецЕсли;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка отправки!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьОповещениеПользователя("Отмена счета",,"Не удалось отправить счет на оплату");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПериоду(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборПериода", ЭтотОбъект);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала 	= ДатаНачалаПериода;
	Диалог.Период.ДатаОкончания = ДатаОкончанияПериода;
	
 	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&наКлиенте
Процедура ЗавершитьВыборПериода(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаПериода 		= РезультатВыбора.ДатаНачала;
	ДатаОкончанияПериода 	= РезультатВыбора.ДатаОкончания;
	
	Заголовок = "Доходы нерезидентов. Документы за период: "+ ПредставлениеПериода(ДатаНачалаПериода, ДатаОкончанияПериода);
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СчетОбменГИСЭПД" Тогда
		ОбновитьНаСервере();                        
	Конецесли;
	
КонецПроцедуры
//Получение печатной формы

