&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТОтчет = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(ТОтчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"), УникальныйИдентификатор);
	Отчет.ДатаОтчета = ТекущаяДата();
	Отчет.ВыводитьСуммыВРублях = Истина;
	
	
	ПоказатьСкрытьНастройкиНаСервере();
	
	Элементы.ГруппаИнтревалы.Видимость = Отчет.ДетализироватьПоПериодам;
	
	ЗаполнитьПериодыПоУмолчанию();
	ЗаполнитьГруппировкиПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодыПоУмолчанию()

	Отчет.Интервалы.Очистить(); 
	
	мЗначения = Новый Массив;
	мЗначения.Добавить(7);
	мЗначения.Добавить(15);
	мЗначения.Добавить(30);
	мЗначения.Добавить(60);
	мЗначения.Добавить(90);
	
	ПерваяСтрока = Истина;
	ПредыдущееЗначение = 0;
	Для Каждого ЗначениеМассива Из мЗначения Цикл
		Интервал = Отчет.Интервалы.Добавить();
		Интервал.Значение = ЗначениеМассива;
		
		Если ПерваяСтрока Тогда
			Интервал.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'До %1 дней'"), Формат(ЗначениеМассива,"ЧГ=0"));
			ПредыдущееЗначение = ЗначениеМассива;
			ПерваяСтрока = Ложь;
		Иначе
			Интервал.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'От %1 до %2 дней'"), Формат(ПредыдущееЗначение + 1,"ЧГ=0"), Формат(ЗначениеМассива,"ЧГ=0"));
			ПредыдущееЗначение = ЗначениеМассива;
		КонецЕсли;	
	КонецЦикла;
	
	Отчет.Интервалы.Сортировать("Значение Возр");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппировкиПоУмолчанию()
	
	Отчет.Группировка.Очистить();
	
	НоваяСтрока = Отчет.Группировка.Добавить();
	НоваяСтрока.Использование = истина;
	НоваяСтрока.Поле = "Организация";
	НоваяСтрока.Представление = "Организация";
	
	НоваяСтрока = Отчет.Группировка.Добавить();
	НоваяСтрока.Использование = истина;
	НоваяСтрока.Поле = "Контрагент";
	НоваяСтрока.Представление = "Контрагент";
	
	НоваяСтрока = Отчет.Группировка.Добавить();
	НоваяСтрока.Использование = истина;
	НоваяСтрока.Поле = "Договор";
	НоваяСтрока.Представление = "Договор";

	НоваяСтрока = Отчет.Группировка.Добавить();
	НоваяСтрока.Использование = истина;
	НоваяСтрока.Поле = "ДокументВзаиморасчетов";
	НоваяСтрока.Представление = "Документ взаиморасчетов";
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьНастройки(Команда)
	ПоказатьСкрытьНастройкиНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПоказатьСкрытьНастройкиНаСервере()
	
	ПоказатьНастройки = Не ПоказатьНастройки;
	
	Элементы.ГруппаНастройки.Видимость 				= ПоказатьНастройки;
	Элементы.ФормаПоказатьСкрытьНастройки.Пометка   = ПоказатьНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалыПриИзменении(Элемент)
	
	Отчет.Интервалы.Сортировать("Значение Возр");
	
	ПерваяСтрока = Истина;
	ПредыдущееЗначение = 0;
	Для Каждого Интервал Из Отчет.Интервалы Цикл
		Если ПерваяСтрока Тогда
			Интервал.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'До %1 дней'"), Формат(Интервал.Значение,"ЧГ=0"));
			ПредыдущееЗначение = Интервал.Значение;
			ПерваяСтрока = Ложь;
		Иначе
			Интервал.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'От %1 до %2 дней'"), Формат(ПредыдущееЗначение + 1,"ЧГ=0"), Формат(Интервал.Значение,"ЧГ=0"));
			ПредыдущееЗначение = Интервал.Значение;
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	
	ЭтаФорма.СкомпоноватьРезультат();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	БухгалтерскиеОтчетыКлиент.ГруппировкаПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);  
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
	
	Если Режим = "Выбор" Тогда
		Для Каждого ДоступноеПоле Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если ДоступноеПоле.Ресурс Тогда
				СписокПолей.Добавить(Строка(ДоступноеПоле.Поле));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Режим = "Группировка" ИЛИ Режим = "Выбор" Тогда		
		БухгалтерскиеОтчетыКлиент.ДобавитьПоляРесурсовВЗапрещенныеПоля(ЭтаФорма, СписокПолей);
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаКлиенте
Процедура ИспользуютсяИнтервалыЗадолженностиПриИзменении(Элемент)
	Элементы.ГруппаИнтревалы.Видимость = Отчет.ДетализироватьПоПериодам;
КонецПроцедуры
