#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

#Область ПрограммныйИнтерфейс


#Область ИнтеграцияСОблачнойОтчетностью

// Функция определяет отображение кнопки "Заполнить" в облачной отчетности
// 
// Параметры:
//  ИДРедакцииОтчета - Строка
// 
// Возвращаемое значение:
//  Булево - Релизована поддержка заполнения в облачной отчетности
Функция РелизованаПоддержкаЗаполненияВОблачнойОтчетности(ИДРедакцииОтчета) Экспорт
	
	МассивПоддерживаемых = Новый Массив(); // Массив Из Строка
	МассивПоддерживаемых.Добавить("ФормаОтчета2015Кв2");
	
	Возврат МассивПоддерживаемых.Найти(ИДРедакцииОтчета) <> Неопределено;
	
КонецФункции

// Функция определяет отображение кнопки "Расшифровать" в облачной отчетности
//
// Параметры:
//  ИДРедакцииОтчета - Строка
//  
// Возвращаемое значение:
//   Булево 
Функция РелизованаПоддержкаРасшифровкиВОблачнойОтчетности(ИДРедакцииОтчета) Экспорт

	МассивПоддерживаемых = Новый Массив(); // Массив Из Строка
	
	Возврат МассивПоддерживаемых.Найти(ИДРедакцииОтчета) <> Неопределено;

КонецФункции

#КонецОбласти


Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат Перечисления.ВерсииФорматовВыгрузки.Версия500;
	
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2015Кв2";
	НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу ФНС России от 06.04.2015 № ММВ-7-15/139@ (в редакции приказа ФНС России от 25.09.2018 № ММВ-7-15/546@).";
	НоваяФорма.РедакцияФормы      = "от 25.09.2018 № ММВ-7-15/546@.";
	НоваяФорма.ДатаНачалоДействия = '2010-01-01';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

Функция ДанныеРеглОтчета(ЭкземплярРеглОтчета) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли