

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТекстОшибки",			ТекстОшибки);
	Параметры.Свойство("ТекстОписанияОшибки",	ТекстОписанияОшибки); 
	
	Элементы.ФормаПодробно.Видимость = Не ПустаяСтрока(ТекстОписанияОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура Подробно(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстОписанияОшибки", ТекстОписанияОшибки);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаОписанияОшики", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры
