
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаДокумента"
		И ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ЗначенияЗаполнения");
	
	ВидОперации = Неопределено; 

	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "ВидОперации");
	КонецЕсли;

	// Если документ копируется, то вид формы получаем из копируемого документа.
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		Если Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Параметры.ЗначениеКопирования, "ВидОперации");
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначенияЗаполнения, "ВидОперации");
	КонецЕсли; 

	СтандартнаяОбработка = Ложь;
	
	ФормыКорректировкиОперативнойЗадолженност = ПолучитьСоответствиеВидовОперацийФормам();
	ВыбраннаяФорма = ФормыКорректировкиОперативнойЗадолженност[ВидОперации];
	Если ВыбраннаяФорма = Неопределено Тогда
		ВыбраннаяФорма = "ФормаДокумента";
	КонецЕсли;
	
КонецПроцедуры 

Функция ПолучитьСоответствиеВидовОперацийФормам() Экспорт	
	
	ВсеВидыОпераций = Перечисления.CW_ВидыОперацийДДС;
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ВсеВидыОпераций.ВозвратПокупателю, 	"ФормаВозвратКонтрагенту");
	Соответствие.Вставить(ВсеВидыОпераций.ВозвратОтПоставщика, 	"ФормаВозвратКонтрагенту");  
	
	Соответствие.Вставить(ВсеВидыОпераций.ПоступлениеОтПокупателя, 			"ФормаПрочиеВидыОпераций");
	Соответствие.Вставить(ВсеВидыОпераций.ОплатаПоставщику, 				"ФормаПрочиеВидыОпераций");
	Соответствие.Вставить(ВсеВидыОпераций.ПрочиеПоступления, 				"ФормаПрочиеВидыОпераций");
	Соответствие.Вставить(ВсеВидыОпераций.ПрочиеСписания, 					"ФормаПрочиеВидыОпераций");
	Соответствие.Вставить(ВсеВидыОпераций.ПеремещениеВДругуюКассу, 			"ФормаПрочиеВидыОпераций");
	Соответствие.Вставить(ВсеВидыОпераций.ОплатаПоставщикуПоПриобретениям, 	"ФормаПрочиеВидыОпераций");

	Возврат Соответствие;
	
КонецФункции 

Процедура ОбработкаПолученияПолейПредставления(Данные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Данные.Добавить("ПредставлениеДокумента");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) 
	
	Если Не ПустаяСтрока(Данные.ПредставлениеДокумента) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.ПредставлениеДокумента;	          
	КонецЕсли;
	
КонецПроцедуры

