#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// контроль загрузки
	Если ОбменДанными.Загрузка или РучнаяКорректировка Тогда 
		Возврат; 
	КонецЕсли;
	
	БазоваяВалюта 	= CW_Настройки.ВалютаРегламентированногоУчета();
	ВалютаКассы 	= Касса.Валюта;
	КурсВД 			= CW_Финансы.ПолучитьКурсВалюты(Валюта,Дата);
	КурсВаютыКассы 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаКассы,Дата);
	Курсовые 		= Ложь;
	ИмяРегистраОперативнойЗадолженности = "";

	ВидыОперацийДДС = Перечисления.CW_ВидыОперацийДДС;
	
	Коэффициент = 1;
	Если ВидОперации = ВидыОперацийДДС.ВозвратОтПоставщика 
		ИЛИ ВидОперации = ВидыОперацийДДС.ВозвратПокупателю Тогда 
		Коэффициент = -1;
	КонецЕсли;
	
	ДвиженияПоРасшифровке = Ложь;
	Если ВидОперации = ВидыОперацийДДС.ПоступлениеОтПокупателя  Тогда

		ДвиженияПоРасшифровке 		= Истина;
		ВидДвиженияКассы 			= ВидДвиженияНакопления.Приход;
		ВидДвиженияЗадолженности	= ВидДвиженияНакопления.Расход;
		РегистрЗадолженность		= Движения.CW_ОперативнаяДебиторскаяЗадолженность;
		РегистрОплаты 				= Движения.CW_ОплатаИсходящихДокументов;
		ИмяРегистраОперативнойЗадолженности = "CW_ОперативнаяДебиторскаяЗадолженность";
		
	ИначеЕсли ВидОперации = ВидыОперацийДДС.ВозвратПокупателю Тогда
		
		ДвиженияПоРасшифровке 		= Истина;
		ВидДвиженияКассы 			= ВидДвиженияНакопления.Расход;
		ВидДвиженияЗадолженности	= ВидДвиженияНакопления.Расход;
		РегистрЗадолженность		= Движения.CW_ОперативнаяДебиторскаяЗадолженность;
		РегистрОплаты 				= Движения.CW_ОплатаИсходящихДокументов;
		ИмяРегистраОперативнойЗадолженности = "CW_ОперативнаяДебиторскаяЗадолженность";
		
	ИначеЕсли ВидОперации = ВидыОперацийДДС.ОплатаПоставщику Тогда
		ДвиженияПоРасшифровке 		= Истина;
		ВидДвиженияКассы 			= ВидДвиженияНакопления.Расход;
		ВидДвиженияЗадолженности	= ВидДвиженияНакопления.Расход;
		РегистрЗадолженность		= Движения.CW_ОперативнаяКредиторскаяЗадолженность;
		РегистрОплаты 				= Движения.CW_ОплатаВходящихДокументов;
		ИмяРегистраОперативнойЗадолженности = "CW_ОперативнаяКредиторскаяЗадолженность";

	ИначеЕсли ВидОперации = ВидыОперацийДДС.ВозвратОтПоставщика Тогда 
		
		ДвиженияПоРасшифровке 		= Истина;
		ВидДвиженияКассы 			= ВидДвиженияНакопления.Приход;
		ВидДвиженияЗадолженности	= ВидДвиженияНакопления.Расход;
		РегистрЗадолженность		= Движения.CW_ОперативнаяКредиторскаяЗадолженность;
		РегистрОплаты 				= Движения.CW_ОплатаВходящихДокументов;
		ИмяРегистраОперативнойЗадолженности = "CW_ОперативнаяКредиторскаяЗадолженность";

	ИначеЕсли ВидОперации = ВидыОперацийДДС.ОплатаПоставщикуПоПриобретениям Тогда 
		
		ДвиженияПоРасшифровке 		= Истина;
		ВидДвиженияКассы 			= ВидДвиженияНакопления.Расход;
		ВидДвиженияЗадолженности	= ВидДвиженияНакопления.Расход;
		РегистрЗадолженность		= Движения.CW_ОперативнаяКредиторскаяЗадолженность;
		РегистрОплаты 				= Движения.CW_ОплатаВходящихДокументов;
		ИмяРегистраОперативнойЗадолженности = "CW_ОперативнаяКредиторскаяЗадолженность";
		
	ИначеЕсли ВидОперации = ВидыОперацийДДС.ПрочиеПоступления Тогда 
		
		 ДвиженияПоРасшифровке 	= Ложь;
		 ВидДвиженияКассы 		= ВидДвиженияНакопления.Приход;
		 
	ИначеЕсли ВидОперации = ВидыОперацийДДС.ПрочиеСписания Тогда 
		 
		ДвиженияПоРасшифровке 	= Ложь;
		ВидДвиженияКассы 		= ВидДвиженияНакопления.Расход;
		
	ИначеЕсли ВидОперации = ВидыОперацийДДС.ПеремещениеВДругуюКассу Тогда 
		
		ДвиженияПоРасшифровке 	= Ложь;
		ВидДвиженияКассы 		= ВидДвиженияНакопления.Расход; 
		
	КонецЕсли; 
	
	Движение = Движения.CW_ДенежныеСредства.Добавить();
	Движение.ВидДвижения 	= ВидДвиженияКассы;
	Движение.Период 		= Дата;
	Движение.Касса 			= Касса;
	Движение.Валюта 		= ВалютаКассы;
	Движение.СтатьяДДС 		= СтатьяДДС;  
	
	Если Не ДвиженияПоРасшифровке Тогда
		Движение.Сумма = СуммаВК;
	КонецЕсли;
	
	Если ДвиженияПоРасшифровке Тогда
		
		Курсовые = Валюта <> БазоваяВалюта;

		Движение.Сумма = Расшифровка.Итог("СуммаВК");
		
		Для каждого СтрокаРсшифровки Из Расшифровка Цикл
			
			СуммаВсегоВалюта 	= СтрокаРсшифровки.СуммаВД;
			СуммаВсего			= CW_Финансы.ПересчитатьИзВалютыВВалюту(СуммаВсегоВалюта,Валюта,БазоваяВалюта,КурсВД.Курс,1,КурсВД.Кратность,1);
			
			Движение = РегистрЗадолженность.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияЗадолженности;
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Валюта 		= Валюта;
			Движение.Контрагент 	= Контрагент;
			Движение.Договор 		= Договор;
			Движение.СчетУчета 		= СтрокаРсшифровки.Счет;
			Движение.Всего_Валюта 	= СуммаВсегоВалюта * Коэффициент;
			Движение.Всего 			= СуммаВсего * Коэффициент;
			
			Движение.ВидОперации = Перечисления.CW_ВидыДвиженийПоОперативнойЗадолженности.Оплата;
		
			//Подсистема.УчетПриложенийДоговоров
			Если ЗначениеЗаполнено(СтрокаРсшифровки.Документ) Тогда
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПриложениеКДоговору", СтрокаРсшифровки.Документ.Метаданные()) Тогда
					Движение.ПриложениеКДоговору = СтрокаРсшифровки.Документ.ПриложениеКДоговору;
				Иначе
					Движение.ПриложениеКДоговору = ПриложениеКДоговору;
				КонецЕсли;
			Иначе
				Движение.ПриложениеКДоговору = ПриложениеКДоговору;
			КонецЕсли;
			//Подсистема.УчетПриложенийДоговоров
			
			Если ЗначениеЗаполнено(СтрокаРсшифровки.Документ) Тогда
				Движение.Счет = СтрокаРсшифровки.Документ;
			Иначе
				Движение.Счет = Ссылка;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаРсшифровки.Документ) Тогда
				
				Если (ТипЗнч(СтрокаРсшифровки.Документ)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")
					ИЛИ ТипЗнч(СтрокаРсшифровки.Документ)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")
					ИЛИ ТипЗнч(СтрокаРсшифровки.Документ)=Тип("ДокументСсылка.CW_РасходыПоПриобретениям")) Тогда
					
					Движение = РегистрОплаты.Добавить();
					Движение.Период 			= Дата;
					
					Движение.Документ 			= СтрокаРсшифровки.Документ;
					Движение.ДокументОплаты 	= Ссылка;
					Движение.СчетЗадолженности 	= СтрокаРсшифровки.Счет;
					Движение.Всего 				= СтрокаРсшифровки.СуммаВД * Коэффициент ;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	
	Если ОтразитьВСоставеРасходовПоПриобретениям Тогда
		
		СуммаБезНДСВВалюте = СуммаВК - СуммаНДС;
		
		Если ТипЗнч(Субконто1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			СтатьяЗатрат = Субконто1;
		ИначеЕсли ТипЗнч(Субконто2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			СтатьяЗатрат = Субконто2;
		ИначеЕсли ТипЗнч(Субконто3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			СтатьяЗатрат = Субконто3;
		Иначе
			СтатьяЗатрат = Справочники.СтатьиЗатрат.ПустаяСсылка()
		КонецЕсли;
		
		// регистр "CW_РасходыПоПриобретениям"
		Движение	= Движения.CW_РасходыПоПриобретениям.Добавить();
		Движение.Период         	= Дата;
		Движение.ДокументЗатрат  	= Ссылка;
		Движение.Организация     	= Организация;
		Движение.Валюта         	= ВалютаКассы;
		Движение.СтатьяЗатрат   	= СтатьяЗатрат;
		Движение.СтавкаНДС			= СтавкаНДС;
		Движение.СчетЗатрат         = Счет;
		
		Движение.Субконто1         	= Субконто1;
		Движение.Субконто2         	= Субконто2;
		Движение.Субконто3         	= Субконто3; 
		
		Движение.УчетНДС         	= УчитыватьНДС;
		Движение.СчетНДС         	= СчетНДС;

		Движение.Количество 		= Количество ;
		Движение.ВалютнаяСумма 		= СуммаБезНДСВВалюте ;
		Движение.ВалютнаяСуммаНДС 	= СуммаНДС;
		Движение.ВалютнаяСуммаВсего = СуммаВК;
		
		Движение.Сумма		       	= CW_Финансы.ПересчитатьИзВалютыВВалюту(Движение.ВалютнаяСумма	   , ВалютаКассы, БазоваяВалюта, КурсВаютыКассы.Курс, 1, КурсВаютыКассы.Кратность, 1);
		Движение.СуммаНДС		    = CW_Финансы.ПересчитатьИзВалютыВВалюту(Движение.ВалютнаяСуммаНДС  , ВалютаКассы, БазоваяВалюта, КурсВаютыКассы.Курс, 1, КурсВаютыКассы.Кратность, 1);
		Движение.СуммаВсего		    = CW_Финансы.ПересчитатьИзВалютыВВалюту(Движение.ВалютнаяСуммаВсего, ВалютаКассы, БазоваяВалюта, КурсВаютыКассы.Курс, 1, КурсВаютыКассы.Кратность, 1);
		
		Движение.Примечание		    = НазначениеПлатежа;
		
		//Пустые
		Движение.Контрагент     	= Справочники.Контрагенты.ПустаяСсылка();
		Движение.Договор        	= Справочники.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка();
		
		//Подсистема.УчетПриложенийДоговоров
		Движение.ПриложениеКДоговору = Справочники.CW_ПриложенияКДоговорам.ПустаяСсылка();
		//Подсистема.УчетПриложенийДоговоров
		
		Движение.Номенклатура   	= Справочники.Номенклатура.ПустаяСсылка();

	КонецЕсли;
	
	Если ВидОперации=Перечисления.CW_ВидыОперацийДДС.ПеремещениеВДругуюКассу Тогда
		
		Движение = Движения.CW_ДенежныеСредства.Добавить();
		
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Касса 			= КассаПоступления;
		Движение.Валюта 		= КассаПоступления.Валюта;
		Движение.СтатьяДДС 		= ПоступлениеСтатьяДДС;
		
		Если (Движение.Валюта = ВалютаКассы) Тогда
			Движение.Сумма = СуммаВК;
		Иначе
			Движение.Сумма = СуммаВД;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Курсовые Тогда
		СтруктураПарамтеров = Новый Структура;
		СтруктураПарамтеров.Вставить("Дата", 			Дата);
		СтруктураПарамтеров.Вставить("ВалютаОбъекта", 	Валюта);
		СтруктураПарамтеров.Вставить("Организация",		Организация);
		СтруктураПарамтеров.Вставить("Контрагент",		Контрагент);
		СтруктураПарамтеров.Вставить("Договор",			Договор);
		
		//Подсистема.УчетПриложенийДоговоров
		СтруктураПарамтеров.Вставить("ПриложениеКДоговору",			ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров
		
		СтруктураПарамтеров.Вставить("ДатаСреза", 		МоментВремени());
		СтруктураПарамтеров.Вставить("Набор",			РегистрЗадолженность);
		СтруктураПарамтеров.Вставить("ИмяРегистраОперативнойЗадолженности",	ИмяРегистраОперативнойЗадолженности );
		
		CW_Финансы.СписаниеКурсовыеПоОперативнойЗадолженности(СтруктураПарамтеров);
	КонецЕсли; 
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = CW_Настройки.Пользователь();
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПеремещениеВДругуюКассу Тогда
		КонтрагентДляЖурнала = КассаПоступления;
	Иначе
		КонтрагентДляЖурнала = Контрагент;
	КонецЕсли; 
	
	Если ПустаяСтрока(ПредставлениеДокумента) Тогда
		ПредставлениеДокумента = "Движение денежных средств "+СокрЛП(Номер)+" от "+Формат(Дата, "ДЛФ=DT");
	КонецЕсли;
	
КонецПроцедуры


#КонецЕсли





