#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	CW_УчетСобственногоТранспортаСервер.ПодготовитьДвженияКПроведению(ЭтотОбъект);
	
	МассивИменРегистров = CW_УчетСобственногоТранспортаСервер.ПолучитьИспользуемыеРегистры(ЭтотОбъект);
	
	ДанныеДляПроведения = ПодготовитьДанныеДляПроведения(МассивИменРегистров);
	
	CW_УчетСобственногоТранспортаСервер.ЗарегистрироватьДвиженияДокумента(Движения,ДанныеДляПроведения,МассивИменРегистров);	
	
КонецПроцедуры

Функция ПодготовитьДанныеДляПроведения(МассивИменРегистров)
	
	ВедетсяУчетШинТранспортногоСредства 	= ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетШинТранспортногоСредства");
	
	ДанныеДляПроведения 		= CW_УчетСобственногоТранспортаСервер.ПодготовитьТаблицыДанныхДляПроведения(МассивИменРегистров);
	СтркутрураПараметров		= CW_УчетСобственногоТранспортаСервер.ПолучитьУстанавливаемыеПараметры();
	
	Состояние = ПредопределенноеЗначение("Справочник.CW_СостоянияТС.Выбыло");
	
	//----
	//СостояниеТС
	СтрокаСостояния = ДанныеДляПроведения.CW_СостоянияТС.Добавить();
	СтрокаСостояния.Период 					= Дата;
	СтрокаСостояния.ТранспортноеСредство 	=  ТранспортноеСредство;
	СтрокаСостояния.Состояние 				=  Состояние;
	
	//----
	//ПараметрыТС
	
	Для Каждого ЭлементСтркутуры из СтркутрураПараметров Цикл
		СтрокаПараметрыТС = ДанныеДляПроведения.CW_ПараметрыТС.Добавить();
		СтрокаПараметрыТС.Период 						= Дата;
		СтрокаПараметрыТС.ТранспортноеСредство 			= ТранспортноеСредство;
		СтрокаПараметрыТС.ПараметрТранпортногоСредства 	= ЭлементСтркутуры.Значение;
	КонецЦикла;
	
	//ТопливоТС
	Для Каждого СтрокаТоплива из ТопливоТранспортногоСредства Цикл
		СтрокаТопливоТС = ДанныеДляПроведения.CW_ТопливоТС.Добавить();
		СтрокаТопливоТС.Период 					= Дата;
		СтрокаТопливоТС.ВидДвижения 			= ВидДвиженияНакопления.Расход;
		СтрокаТопливоТС.ТранспортноеСредство 	= ТранспортноеСредство;
		СтрокаТопливоТС.Топливо 				= СтрокаТоплива.Топливо;
		СтрокаТопливоТС.Количество 				= СтрокаТоплива.Количество;
	КонецЦикла;
	
	// ---
	Если ВедетсяУчетШинТранспортногоСредства Тогда
		
		Для каждого СтрокаШин из ШиныТранспортногоСредства Цикл
			СтрокаШины = ДанныеДляПроведения.CW_ШиныТС.Добавить();
			СтрокаШины.Период 					= Дата;
			СтрокаШины.ТранспортноеСредство 	= ТранспортноеСредство;
			СтрокаШины.МестоУстановкиШины 		= СтрокаШин.МестоУстановкиШины;
		КонецЦикла;
		
	КонецЕсли;
	// ---	
 	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
	
КонецПроцедуры
#КонецЕсли
