&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма,"РедактированиеНастроекМониторинга");
	CW_Документы.ОтображениеКнопокКоманднойПанелиФормыСписка(ЭтаФорма);
	// ---------------------------------------------------------------------------- 
	
	Параметры.Свойство("РежимВыбора",Элементы.Список.РежимВыбора);
	Если (Элементы.Список.РежимВыбора) Тогда
		
		Элементы.Список.МножественныйВыбор=Ложь;
	КонецЕсли; 
	// --- 
	_ЗагрузитьСеансовуюНастройку();
	// --- 
	_ПраваДоступа();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ПраваДоступа()
	// --- 
	
	Элементы.ФормаОтборСортировка.Видимость = CW_Настройки.ПолучитьНастройкуПользователя(, "РежимОтладкиВключен");
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _СохранитьСеансовуюНастройку()
	// --- 
	
	_УФС.СохранитьСеансовыеНастройки(ЭтаФорма,,_ПФ_НастройкаСписка().СписокКолонок);
	
	// --- 
КонецФункции

&НаСервере
Функция _ЗагрузитьСеансовуюНастройку()
	// --- 
	
	Настройка = _УФС.ЗагрузитьСеансовыеНастройки(ЭтаФорма);
	_ОбработатьНастройкуСписка(Настройка);
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура НастройкаСписка(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияНастройкиСписка",ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаНастройкиСписка",_ПФ_НастройкаСписка(),,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияНастройкиСписка(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		_ОбработатьНастройкуСписка(Ответ); 
	КонецЕсли;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _ПФ_НастройкаСписка()
	// --- 
	
	ПФ = Новый Структура("Источник,СписокКолонок",ЭтаФорма.Заголовок,Новый Массив);
	// --- 
	_СформироватьСтруктуруКолонок(Элементы.Список,ПФ.СписокКолонок);
	СписокКолонок.ЗагрузитьЗначения(ПФ.СписокКолонок);
	// --- 
	Возврат(ПФ);
	
	// --- 
КонецФункции
 
&НаСервере
Процедура _СформироватьСтруктуруКолонок(Элемент,МассивСК)
	// --- 
	
	// обходим подчинённые элементы
	Для каждого ПЭ Из Элемент.ПодчиненныеЭлементы Цикл
		
		Узел = _ШаблонУзла();
		_сф.ст_ЗаполнитьСвойства(Узел,"Имя,Заголовок,Видимость",ПЭ);
		Узел.ЭтоГруппа = (ТипЗнч(ПЭ) <> Тип("ПолеФормы"));
		МассивСК.Добавить(Узел);
		// --- 
		Если Узел.ЭтоГруппа Тогда
			
			_СформироватьСтруктуруКолонок(ПЭ,Узел.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция _ШаблонУзла()
	// --- 
	
	Возврат(Новый Структура("Имя,Заголовок,Видимость,ИзменениеВидимости,ЭтоГруппа,Элементы","","",Ложь,Истина,Ложь,Новый Массив));
	
	// --- 
КонецФункции

// --- 

&НаСервере
Процедура _ОбработатьНастройкуСписка(Настройка)
	// --- 
	
	Если (Настройка = Неопределено) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Попытка
		
		// необходимо проверить порядок и видимость, 
		// сначала видимость
		Для каждого СК Из Настройка Цикл
			
			_ОбновитьВидимость(СК);
			
		КонецЦикла; 
		// потом порядок
		Если (СписокКолонок.Количество()=0) Тогда
			_СформироватьСтруктуруКолонок(Элементы.Список,СписокКолонок);
			_ОбновитьПорядок(Настройка);
		Иначе
			_ОбновитьПорядок(Настройка);
		КонецЕсли; 
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки; 
	
	_СохранитьСеансовуюНастройку();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьВидимость(СК)
	// --- 
	
	ЭлементФормы = Элементы.Найти(СК.Имя);
	Если ЭлементФормы <> Неопределено Тогда
		
		ЭлементФормы.Видимость = СК.Видимость;
		Если СК.Видимость И СК.ЭтоГруппа Тогда
			
			Для каждого Элемент Из СК.Элементы Цикл
				
				_ОбновитьВидимость(Элемент);
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьПорядок(Настройка)
	// --- 
	
	ТекущийИндекс = 1;
	Для каждого СК Из Настройка Цикл
		
		ПередвигаемыйЭлемент = Элементы[СК.Имя];
		Элементы.Переместить(ПередвигаемыйЭлемент, ПередвигаемыйЭлемент.Родитель);
		
		Если СК.ЭтоГруппа Тогда
			
			_ОбновитьПорядок(СК.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
	СписокКолонок.ЗагрузитьЗначения(Настройка);
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Элементы.Список.Обновить();	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти

