
Процедура ЗаписатьСрокОплатыДокумента(СтруктураПараметров) Экспорт
	
	
	Если Не ЗначениеЗаполнено(СтруктураПараметров.Счет) Тогда
		Возврат;
	КонецЕсли;
	
	Описание = ""; РучноеРедактирование = ложь;     
	
	СтруктураПараметров.Свойство("Описание", Описание);
	СтруктураПараметров.Свойство("РучноеРедактирование", РучноеРедактирование);
	
	ЗаписьРегистра = РегистрыСведений.CW_СрокиОплатыСчетов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Счет = СтруктураПараметров.Счет;
	ЗаписьРегистра.Прочитать();
	
	ЗаписьРегистра.Счет 				= СтруктураПараметров.Счет;
	ЗаписьРегистра.ДатаОплаты 			= СтруктураПараметров.ДатаОплаты;
	ЗаписьРегистра.Описание 			= Описание;
	ЗаписьРегистра.РучноеРедактирование = РучноеРедактирование;
	
	ЗаписьРегистра.Записать(Истина);           
	
	ИспользоватьПланирование = Ложь;
	Если ТипЗнч(СтруктураПараметров.Счет) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")
		ИЛИ  ТипЗнч(СтруктураПараметров.Счет) = Тип("ДокументСсылка.CW_РеализацияПрочихТоваровУслуг") Тогда
		
		ИспользоватьПланирование = ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейОтПокупателей");

	ИначеЕсли ТипЗнч(СтруктураПараметров.Счет) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")
		ИЛИ  ТипЗнч(СтруктураПараметров.Счет) = Тип("ДокументСсылка.CW_РасходыПоПриобретениям") Тогда 
		
		ИспользоватьПланирование = ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейПоставщикам");
		
	КонецЕсли;
	
	// дублируем срок оплаты через стандартный механизм БП,
	// если в настройках типовой БП включена соответствующая функциональность планирования
	Если ИспользоватьПланирование Тогда
		Если ТипЗнч(СтруктураПараметров.Счет) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") или
			ТипЗнч(СтруктураПараметров.Счет) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")
		Тогда
			Если СтруктураПараметров.Счет.Корректировка Тогда
				ВедомыйДокумент = СтруктураПараметров.Счет.ВедомыйСчетКорректировочный;	
			Иначе
				ВедомыйДокумент = СтруктураПараметров.Счет.ВедомыйСчет;	
			КонецЕсли;
			СрокиОплатыДокументов.ЗаписатьСрокОплатыДокумента(ВедомыйДокумент, СтруктураПараметров.ДатаОплаты);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
