

Функция ИмяДокументаПоТипу(ТипДокумента) Экспорт
	
	Возврат ОбменСГИСЭПД.ИмяДокументаПоТипу(ТипДокумента); 
	
КонецФункции

Функция ПрефиксТитулаПоЭлементуРегламентаЭДО(Титул) Экспорт
	
	Возврат ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Титул);
	
КонецФункции            

Функция ТипДокументаЗаказЗаявка() Экспорт
	
	Возврат ОбменСГИСЭПДКлиентСервер.ТипДокументаЗаказЗаявка();
	
КонецФункции  

Функция МакетСоответствийИменРеквизитов(ТипДокумента) Экспорт
	
	Возврат ОбменСГИСЭПД.МакетСоответствийИменРеквизитов(ТипДокумента);
	
КонецФункции

Функция ПолучитьРеквизитыУчастника(Участник, ДобавитьПлатежныеРеквизиты) Экспорт
	
	Возврат ОбменСГИСЭПД.ПолучитьРеквизитыУчастника(Участник, ДобавитьПлатежныеРеквизиты);
	
КонецФункции   

Функция ВидФактическийАдресКонтрагента() Экспорт
	
	Возврат ОбменСГИСЭПДПереопределяемый.ВидФактическийАдресКонтрагента();
	
КонецФункции   
