#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьПустуюТаблицуДляЗаписиДанныхВРегистр() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
	               |	CW_ХарактеристикиГрузоперевозок.Значение КАК Значение,
	               |	CW_ХарактеристикиГрузоперевозок.ЗначениеПлан КАК ЗначениеПлан,
	               |	CW_ХарактеристикиГрузоперевозок.ЗначениеФакт КАК ЗначениеФакт,
	               |	CW_ХарактеристикиГрузоперевозок.ХранилищеДанных КАК ХранилищеДанных,
	               |	CW_ХарактеристикиГрузоперевозок.ИдентификаторВладельца КАК ИдентификаторВладельца,
	               |	CW_ХарактеристикиГрузоперевозок.Служебный КАК Служебный,
	               |	CW_ХарактеристикиГрузоперевозок.Порядок КАК Порядок,
	               |	CW_ХарактеристикиГрузоперевозок.Примечание КАК Примечание
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура ЗаписатьДанныеВРегистр(Грузоперевозка, ТаблицаПараметров) Экспорт
	
	Набор = РегистрыСведений.CW_ХарактеристикиГрузоперевозок.СоздатьНаборЗаписей();
	Набор.Отбор.Грузоперевозка.Установить(Грузоперевозка);
	Набор.Прочитать();
	
	Набор.Загрузить(ТаблицаПараметров);
	
	Набор.Записать(Истина);
	
	
КонецПроцедуры

Функция ПолучитьЗначениеПараметра(Грузоперевозка, Параметр) Экспорт
	
	СтруктураЗначения = Новый Структура("Значение,ЗначениеПлан,ЗначениеФакт", Неопределено, Неопределено, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
	               |	CW_ХарактеристикиГрузоперевозок.Значение КАК Значение,
	               |	CW_ХарактеристикиГрузоперевозок.ЗначениеПлан КАК ЗначениеПлан,
	               |	CW_ХарактеристикиГрузоперевозок.ЗначениеФакт КАК ЗначениеФакт
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	               |ГДЕ
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка = &Грузоперевозка
	               |	И CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр"; 
	
	Запрос.УстановитьПараметр("Грузоперевозка", 	Грузоперевозка);
	Запрос.УстановитьПараметр("Параметр", 			Параметр); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураЗначения,Выборка);
	КонецЕсли;
	
	Возврат СтруктураЗначения;
	
КонецФункции  

Функция ПолучитьЗначенияПараметраОбъектов(МассивОбъектов, Параметр) Экспорт
	
	СоответствиеЗначений = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
	               |	CW_ХарактеристикиГрузоперевозок.Значение КАК Значение,
	               |	CW_ХарактеристикиГрузоперевозок.ЗначениеПлан КАК ЗначениеПлан,
	               |	CW_ХарактеристикиГрузоперевозок.ЗначениеФакт КАК ЗначениеФакт,
	               |	CW_ХарактеристикиГрузоперевозок.ХранилищеДанных КАК ХранилищеДанных
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	               |ГДЕ
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка В(&МассивОбъектов)
	               |	И CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр"; 
	
	Запрос.УстановитьПараметр("МассивОбъектов", 	МассивОбъектов);
	Запрос.УстановитьПараметр("Параметр", 			Параметр); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл    
		
		СтруктураОтвета = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
		СтруктураОтвета.Параметр 		= Параметр;
		СтруктураОтвета.Значение 		= Выборка.Значение;  
		СтруктураОтвета.ЗначениеПлан 	= Выборка.ЗначениеПлан;  
		СтруктураОтвета.ЗначениеФакт 	= Выборка.ЗначениеФакт;  
		
		СоответствиеЗначений.Вставить(Выборка.Грузоперевозка, СтруктураОтвета); 
	КонецЦикла;
	
	Возврат СоответствиеЗначений;
	
КонецФункции

Функция ПолучитьТаблицуПараметровОбъекта(МассивГрузоперевозок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
	               |	CW_ХарактеристикиГрузоперевозок.Значение КАК Значение,
	               |	CW_ХарактеристикиГрузоперевозок.ЗначениеПлан КАК ЗначениеПлан,
	               |	CW_ХарактеристикиГрузоперевозок.ЗначениеФакт КАК ЗначениеФакт,
	               |	CW_ХарактеристикиГрузоперевозок.ХранилищеДанных КАК ХранилищеДанных
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	               |ГДЕ
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка В(&МассивГрузоперевозок)";
	
	Запрос.УстановитьПараметр("МассивГрузоперевозок", МассивГрузоперевозок);

	РезультатЗапроса = Запрос.Выполнить();  

	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции
	
	
#КонецЕсли 
