&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Приказ =  CW_ДоходыНерезидентовДополнительный.ПолучитьАктуальныйПриказ(ТекущаяДата());  
	
	ПредставлениеПериода 			= "<Не выбран>";
	ПредставлениеПериодаВыгрузки 	= "<Не выбран>";
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)  
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Организация", 				Организация);
	Ответ.Вставить("Приказ",					Приказ);
	Ответ.Вставить("ДатаНачала",				ПериодВыгрузки.ДатаНачала);
	Ответ.Вставить("ДатаОкончания",				ПериодВыгрузки.ДатаОкончания);
	Ответ.Вставить("РегламентированныйОтчет",	РегламентированныйОтчет);
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры


&НаКлиенте
Процедура РегламентированныйОтчетНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;  
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация",		Организация);  
	СтруктураОтбора.Вставить("ИсточникОтчета",	"РегламентированныйОтчетДоходыИностраннымОрганизациям");  
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимВыбора", 		Истина);
	СтруктураПараметров.Вставить("ЗакрыватьприВыборе", 	Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", 	Ложь);  
	СтруктураПараметров.Вставить("ТекущаяСтрока", 		РегламентированныйОтчет);  
	СтруктураПараметров.Вставить("Отбор", 				СтруктураОтбора);  
	
	ОткрытьФорму("ОбщаяФорма.CW_ВыборРегламентированногоОтчета", СтруктураПараметров, Элемент);
	
КонецПроцедуры 

&НаКлиенте
Процедура РегламентированныйОтчетПриИзменении(Элемент)
	РегламентированныйОтчетПриИзмененииНаСервере();
КонецПроцедуры  

&НаСервере
Процедура РегламентированныйОтчетПриИзмененииНаСервере() 
	
	ПериодВыгрузки.ДатаНачала 		= НачалоКвартала(РегламентированныйОтчет.ДатаОкончания);
	ПериодВыгрузки.ДатаОкончания 	= КонецДня(РегламентированныйОтчет.ДатаОкончания); 
	
	ПредставлениеПериода			= ПредставлениеПериода(РегламентированныйОтчет.ДатаНачала, ПериодВыгрузки.ДатаОкончания, "ФП = Истина"); 
	ПредставлениеПериодаВыгрузки 	= ПредставлениеПериода(ПериодВыгрузки.ДатаНачала, ПериодВыгрузки.ДатаОкончания, "ФП = Истина");

КонецПроцедуры    




