&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокПараметровНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнятьПоискОборудованиПриИзменении(Элемент) 
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);

	ВыполнятьПоискОборудованиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнятьПоискОборудованиПриИзмененииНаСервере()
	
	НаборКонстант.CW_АвтоматическиПодставлятьОборудованиеНаСлеженииВГрузоперевозку = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьПараметр(Команда)
	
	ТекущаяСтрока = Элементы.СписокПараметров.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ОткрытьФормуПараметра(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПараметровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФормуПараметра(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПараметра(ВыбраннаяСтрока)
	
	ТекущиеДанные = СписокПараметров.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеРедактированияПараметра", ЭтотОбъект, ВыбраннаяСтрока);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ", ТекущиеДанные.КонтрольнаяДата);
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаОбъекта", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияПараметра(Результат, ВыбраннаяСтрока) Экспорт
	
	ОбновитьСтрокуНаСервере(ВыбраннаяСтрока);
	
	Элементы.СписокПараметров.ТекущаяСтрока = ВыбраннаяСтрока;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокуНаСервере(ВыбраннаяСтрока)
	
	 ТекущиеДанные = СписокПараметров.НайтиПоИдентификатору(ВыбраннаяСтрока);
	 
	 ТекущиеДанные.ИспользуетсяВремя = ТекущиеДанные.КонтрольнаяДата.КонтрольнаяДатаИспользуетВремя;
	 ТекущиеДанные.ИндексКартинки    = ?(ТекущиеДанные.КонтрольнаяДата.КонтрольнаяДатаИспользуетВремя, 1, 2);
	 
 КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСписокПараметров(Команда)
	ОбновитьСписокПараметровНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПараметровНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ТипыСлеженияСтатусы.КонтрольнаяДата КАК КонтрольнаяДата,
	               |	CW_ТипыСлеженияСтатусы.КонтрольнаяДата.КонтрольнаяДатаИспользуетВремя КАК ИспользуетсяВремя,
	               |	ВЫБОР
	               |		КОГДА CW_ТипыСлеженияСтатусы.КонтрольнаяДата.КонтрольнаяДатаИспользуетВремя
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК ИндексКартинки
	               |ИЗ
	               |	Справочник.CW_ТипыСлежения.Статусы КАК CW_ТипыСлеженияСтатусы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КонтрольнаяДата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокПараметров.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры





#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииРеквизитаФормы(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли; 
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОБласти
