

&НаКлиенте
Процедура Просмотр(Команда) 
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПросмотра = ПолучитьПараметрыПросмотраШаблона(ТекущаяСтрока);
	
	Если ПараметрыПросмотра.ИмяФормата = "HTML" Тогда
		ОткрытьФорму("ОбщаяФорма.CW_ФормаПросмотраТекстаДокументаHTML", ПараметрыПросмотра, ЭтаФорма);
	ИначеЕсли ПараметрыПросмотра.ИмяФормата = "MXL" Тогда
		ОткрытьФорму("ОбщаяФорма.CW_ФормаПросмотраТекстаДокументаMXL", ПараметрыПросмотра, ЭтаФорма);  
	Иначе
		ПоказатьПредупреждение(, "Неизвестный формат шаблона!");
	Конецесли;
	
	
КонецПроцедуры    

&НаСервереБезКонтекста
Функция ПолучитьПараметрыПросмотраШаблона(ТекущаяСтрока)

	ПараметрыПросмотра = Новый Структура;
	ПараметрыПросмотра.Вставить("ОбъектПечати", 	ТекущаяСтрока.Владелец);
	ПараметрыПросмотра.Вставить("ШаблонДокумента", 	ТекущаяСтрока.Ссылка);   
	ПараметрыПросмотра.Вставить("ИмяФормата", 		ТекущаяСтрока.ИмяФормата); 
	
	Возврат ПараметрыПросмотра;
	
КонецФункции


