
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("РежимФормы", РежимФормы);  
	
	Если РежимФормы = "КОНТРАГЕНТЫ" ТОГДА	
		КонтактнаяИнформаия.ТекстЗапроса = СтрЗаменить(КонтактнаяИнформаия.ТекстЗапроса, 
		"//УСЛОВИЕ_ТИПВЛАДЕЛЬЦА", 
		"И СправочникCW_КонтактнаяИнформация.Владелец ССЫЛКА Справочник.Контрагенты");
	КонецЕсли;
	
	Если РежимФормы = "ФИЗЛИЦА" ТОГДА	
		КонтактнаяИнформаия.ТекстЗапроса = СтрЗаменить(КонтактнаяИнформаия.ТекстЗапроса, 
		"//УСЛОВИЕ_ТИПВЛАДЕЛЬЦА", 
		"И СправочникCW_КонтактнаяИнформация.Владелец ССЫЛКА Справочник.ФизическиеЛица");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформаияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Элементы.КонтактнаяИнформаия.ТекущаяСтрока);
	
КонецПроцедуры
