#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМассивГруппПользователей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ГруппыПользователей.Ссылка КАК Ссылка,
	               |	CW_ГруппыПользователей.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.CW_ГруппыПользователей КАК CW_ГруппыПользователей
	               |ГДЕ
	               |	НЕ CW_ГруппыПользователей.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокГрупп = новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокГрупп.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;
	
	Возврат СписокГрупп;
	
КонецФункции

Функция ПолучитьСвязанныеВнешниеПодписки(Обработка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВнешниеПодписки.Ссылка КАК Подписка,
	               |	CW_ВнешниеПодписки.Обработка КАК Обработка
	               |ИЗ
	               |	Справочник.CW_ВнешниеПодписки КАК CW_ВнешниеПодписки
	               |ГДЕ
	               |	CW_ВнешниеПодписки.Обработка = &Обработка
	               |	И CW_ВнешниеПодписки.НеИспользуется = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Обработка"			, Обработка);
	
	РезультатЗапроса =  Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		
		ТаблицаРезультата = РезультатЗапроса.Выгрузить();
		
		Возврат  ТаблицаРезультата.ВыгрузитьКолонку("Подписка");
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПодключитьОбъектИПолучитьФорму(ПодключаемыйОбъект, ТипФормы = "ФормаОбъекта", АдресОбъекта="") Экспорт
	
	//СтруктурВозврата - тип "Структура"
	//- "РежимОткрытия" тип число:
	//		0 - Открыть форму внешней обработки;
	//		1 - Открыть форму редактирования параметра;
	//		3 - Отказ от открытия;
	//- "ТолькоПросмотр" 	- тип "булево";
	//- "ИмяФормы"			- тип "Строка";	
	СтруктураВозврата = новый Структура("РежимОткрытия,ТолькоПросмотр,ИмяФормы,ПодключаемыйОбъект, НеИспользуется",0,Ложь,Неопределено,ПодключаемыйОбъект,ПодключаемыйОбъект.НеИспользуется);
	
	_ПО.ПодключитьОбработку(ПодключаемыйОбъект);
	
	ВнешняяОбработка = _ПО.ПолучитьОбработку(ПодключаемыйОбъект);

	Попытка 
		ВнешняяОбработка.ПодключаемыйОбъект = ПодключаемыйОбъект;
	Исключение
	КонецПопытки;
	
	Попытка
		СтруктураИспользования = ВнешняяОбработка.Использование(АдресОбъекта);
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, СтруктураИспользования);
	Исключение
	КонецПопытки;
	
	Если СтруктураВозврата.РежимОткрытия = 0 Тогда
		ИмяФормы = _ПО.ПолучитьПолноеИмяФормыПоТипу(ПодключаемыйОбъект,ТипФормы);
	КонецЕсли;
	
	Если СтруктураВозврата.Свойство("ИмяФормы") Тогда
		СтруктураВозврата.ИмяФормы = ИмяФормы;
	Иначе
		СтруктураВозврата.Вставить("ИмяФормы", ИмяФормы);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ЗарегистрироватьВнешниеКоманды(СсылкаНаВнешнийОбъект) Экспорт
	
	Набор = РегистрыСведений.CW_ВнешниеКоманды.СоздатьНаборЗаписей();
	Набор.Отбор.Обработка.Установить(СсылкаНаВнешнийОбъект);
	Набор.Прочитать();
	Набор.Очистить();
	
	Если Не СсылкаНаВнешнийОбъект.НеИспользуется и не СсылкаНаВнешнийОбъект.ПометкаУдаления тогда
	
		УИД_команды = Новый УникальныйИдентификатор;
		ИмяКоманды = "Команда_"+СтрЗаменить(УИД_команды,"-","_");
		
		Для Каждого СтрокаВнешнихКоманд из СсылкаНаВнешнийОбъект.ПараметрыВнешнейКоманды Цикл
			
			СтрокаНабора = Набор.Добавить();
			
			СтрокаНабора.Обработка 			= СсылкаНаВнешнийОбъект;
			СтрокаНабора.Метаданное			= СтрокаВнешнихКоманд.МетаданныеКонфигурации;
			СтрокаНабора.ИмяФормыОбъкта 	= СтрокаВнешнихКоманд.ИмяФормыОбъкта;
			СтрокаНабора.ИмяТабличнойЧасти 	= СтрокаВнешнихКоманд.ИмяТабличнойЧасти;
			
			СтрокаНабора.Наименование 		= СтрокаВнешнихКоманд.ПредставлениеКоманды;
			СтрокаНабора.ИмяКартинки 		= СтрокаВнешнихКоманд.ИмяКартинки;
			СтрокаНабора.ИмяКоманды 		= ИмяКоманды;
			
			СтрокаНабора.Индекс 			= СтрокаВнешнихКоманд.Индекс;
			СтрокаНабора.ГруппыДоступа 		= СтрокаВнешнихКоманд.ГруппыДоступаКоманды;
			
			СтрокаНабора.РасположениеГруппы = СтрокаВнешнихКоманд.РасположениеГруппы;
			СтрокаНабора.ПередЭлементом 	= СтрокаВнешнихКоманд.ПередЭлементом;
		
		КонецЦикла;
		
		Набор.Отбор.Обработка.Установить(СсылкаНаВнешнийОбъект);
		
	КонецЕсли;
	
	Набор.Записать(истина);
	
КонецПроцедуры

Процедура ПроверитьАктуальностьВстроенныхОбработок() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъекты.Ссылка КАК Ссылка,
	               |	CW_ПодключаемыеОбъекты.ИмяВстроеннойОбработки КАК ИмяВстроеннойОбработки,
	               |	CW_ПодключаемыеОбъекты.ТипВнешнегоОбъекта КАК ТипВнешнегоОбъекта
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	               |ГДЕ
	               |	CW_ПодключаемыеОбъекты.Встроенная = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ПроверитьВстроеннуюОбработку(Выборка.ИмяВстроеннойОбработки, Выборка.ТипВнешнегоОбъекта) Тогда
			ТОбъект =Выборка.Ссылка.ПолучитьОбъект();
			ТОбъект.НеИспользуется = истина;
			ТОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьВстроеннуюОбработку(ИмяВстроеннойОбработки, ТипВнешнегоОбъекта)
	
	Если ТипВнешнегоОбъекта = Перечисления.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет Тогда
		Метаданное = Метаданные.Отчеты.Найти(ИмяВстроеннойОбработки);
	КонецЕсли; 
	
	Если ТипВнешнегоОбъекта = Перечисления.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка Тогда
		Метаданное =  Метаданные.Обработки.Найти(ИмяВстроеннойОбработки);
	КонецЕсли;  
	
	Возврат Метаданное <> Неопределено;
	
КонецФункции



//Служебные процедуры
Функция ПолучитьСоответствиеТипов() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("Обработка",			ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка"));
	Результат.Вставить("ВнешняяОбработка",	ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка"));
	
	Результат.Вставить("Отчет",				ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет"));
	Результат.Вставить("ВнешнийОтчет", 		ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет"));	
	
	Возврат Результат;
	
КонецФункции       

Процедура ОбновитьПредставлениеВидаОбработки() Экспорт
	
	СоответствиеПредсталенийВида = CW_ПодключаемыеКомандыСервер.ПолучитьСоответствиеПредставленияВида();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПодключаемыеОбъекты.Ссылка КАК Ссылка,
	|	CW_ПодключаемыеОбъекты.Вид КАК Вид
	|ИЗ
	|	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	|ГДЕ
	|	CW_ПодключаемыеОбъекты.ЭтоГруппа = ЛОЖЬ";   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбработкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ОбработкаОбъект.ПредставлениеВида = СоответствиеПредсталенийВида.Получить(Выборка.Вид);;
		ОбработкаОбъект.ОбменДанными.Загрузка = Истина;
		ОбработкаОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры
//Служебные процедуры

#КонецЕсли
