#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ВыполнитьРегистрацию = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("ВыполнитьРегистрацию", ВыполнитьРегистрацию);
	ВыполнитьРегистрацию = ?(ВыполнитьРегистрацию = Неопределено, Ложь, ВыполнитьРегистрацию);
	
	Если ВыполнитьРегистрацию Тогда
		
		Если ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет") Тогда
			ВнешняяОбработка = Отчеты[ИмяВстроеннойОбработки].Создать();
		Иначе 
			ВнешняяОбработка = Обработки[ИмяВстроеннойОбработки].Создать();
		КонецЕсли;
		
		Попытка
			
			ИмяФайла				= Неопределено;
			ПредставлениеОбработки 	= ВнешняяОбработка.Метаданные().Синоним;
			
			СтруктураОписания 	= ВнешняяОбработка.Информация(); 
			_ПО.ЗаполнитьИнформациюПоОбработке(ЭтотОбъект,СтруктураОписания);
			
		Исключение
			
			СобытияДляЖурналаРегистрации = Новый СписокЗначений;
		
			СобытиеДляЖурналаРегистрации = Новый Структура;
			СобытиеДляЖурналаРегистрации.Вставить("ИмяСобытия"			, 	"Подключение внешней обработки "+ОтладкаИмяОбработки);
			СобытиеДляЖурналаРегистрации.Вставить("ПредставлениеУровня"	, 	"Информация");
			СобытиеДляЖурналаРегистрации.Вставить("Комментарий"			, 	"Не удалось подключить внешний объект "+Символы.ПС+
																			"по причине: "+ОписаниеОшибки());
			СобытиеДляЖурналаРегистрации.Вставить("ДатаСобытия"			, 	ТекущаяДата());
			
			СобытияДляЖурналаРегистрации.Добавить(СобытиеДляЖурналаРегистрации);
			
			ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);	
			
		КонецПопытки;
		
		ВнешняяОбработка = Неопределено;
		
	КонецЕсли; 

	СоответствиеПредсталенийВида = CW_ПодключаемыеКомандыСервер.ПолучитьСоответствиеПредставленияВида();
	ПредставлениеВида = СоответствиеПредсталенийВида.Получить(Вид);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа или НеИспользуется Тогда
		Возврат;
	КонецЕсли;
	
	Успешно = _ПО.ПодключитьОбработку(Ссылка);
	
	Если Успешно Тогда
		// --- 
		Отбор = Новый Структура("Метод","Регистрация");
		Если (_сф.к_НайтиСтроку(МетодыОбъекта,Отбор) <> Неопределено) Тогда
			
			Попытка
				Обработка = _ПО.ПолучитьОбработку(Ссылка);
				Обработка.Регистрация(Ссылка);
			Исключение
				Успешно = Ложь;
				ОписаниеОшибки = ОписаниеОшибки();
			КонецПопытки; 
		КонецЕсли; 
		
	КонецЕсли;
	
	НеПоказыватьСообщения = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("НеПоказыватьСообщения", НеПоказыватьСообщения);
	НеПоказыватьСообщения = ?(НеПоказыватьСообщения = Неопределено, Ложь, НеПоказыватьСообщения);
	
	Если Не НеПоказыватьСообщения и Не Успешно Тогда
		
		ИмяПоля = ?(Отладка,"ОтладкаИмяОбработки", "");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось подключить или зарегистрировать внешний объект",, ИмяПоля, "Объект", Отказ);
		
	КонецЕсли;

КонецПроцедуры

#КонецЕсли