
Процедура ДобавитьФайлВПакетЭлектронногоДокумента(ПараметрКоманды, ОбъектУчета) Экспорт
	
	ЭлектронныйДокумент = ПолучитьЭлектронныйДокумент(ОбъектУчета);
	Если Не ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		Возврат;
	КонецЕсли;         
	
	ПараметрыДобавленияВПакет = ПакетыДокументовЭДОКлиент.НовыеПараметрыДобавленияВПакет();
	ПараметрыДобавленияВПакет.ЭлектронныйДокумент = ЭлектронныйДокумент;
	ПараметрыДобавленияВПакет.ИдентификаторПакета = CW_ЭДОВызовСервера.ИдентификаторПакетаДокумента(ЭлектронныйДокумент);
	
	CW_ЭДОВызовСервера.ЗаполнитьПараметрыДобавленияВПакет(ПараметрыДобавленияВПакет);
	
	ДоступноИзменениеПакета = CW_ЭДОВызовСервера.ДоступноИзменениеПакетаЭДО(ПараметрыДобавленияВПакет.ЭлектронныйДокумент, ПараметрыДобавленияВПакет.ИдентификаторПакета);
	Если Не ДоступноИзменениеПакета Тогда 
		ПоказатьПредупреждение(,"Добавление произвольных файлов не доступно для текущего электронного документа!");
		Возврат;
	КонецЕсли;
	
	СписокПрикрепленныхФайлов = CW_ЭДОВызовСервера.ПолучитьСписокПрикрепленныхФайлов(ПараметрКоманды);  
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыбораФайла", ЭтотОбъект, ПараметрыДобавленияВПакет);
	
	СписокПрикрепленныхФайлов.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите прикрепленный файл");
	
КонецПроцедуры  

Процедура ЗавершитьВыбораФайла(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда  
		Возврат;
	КонецЕсли;   
	
	ОграниченияИОбъемПакета = ПакетыДокументовЭДОВызовСервера.ОграниченияИОбъемПакета(ДополнительныеПараметры);
	ДополнительныеПараметры.ОграниченияОбъемаПакетаДокументов 	= ОграниченияИОбъемПакета.ОграниченияОбъемаПакетаДокументов;
	ДополнительныеПараметры.ОбъемПакетаДокументов 				= ОграниченияИОбъемПакета.ОбъемПакетаДокументов;
	
	РезультатПроверкиПревышения = ПакетыДокументовЭДОКлиентСервер.ПроверкаПревышенияМаксимальногоКоличестваДокументовВПакете(
		ОграниченияИОбъемПакета.ОграниченияОбъемаПакетаДокументов, ОграниченияИОбъемПакета.ОбъемПакетаДокументов, 1);
	
	МаксимальноеКоличествоЭДВПакете = Мин(ДополнительныеПараметры.ОграниченияОбъемаПакетаДокументов.ПоКонтрагенту.МаксимальноеКоличествоЭДВПакете, 
		ДополнительныеПараметры.ОграниченияОбъемаПакетаДокументов.ПоОрганизации.МаксимальноеКоличествоЭДВПакете);
	
	Если РезультатПроверкиПревышения.Превышено Тогда 
		ПоказатьПредупреждение(, "Превышено максимальное количество документов в пакете "+Формат(МаксимальноеКоличествоЭДВПакете, "ЧГ=0"));
		Возврат;
	КонецЕсли;
	
	ДанныеФайла 	= CW_РаботаСФайламиСервер.ДанныеФайла(ВыбранноеЗначение.Значение);
	АдресХранилища 	= CW_РаботаСФайламиСервер.ПолучитьСсылкуНаДвоичныеДанные(ВыбранноеЗначение.Значение);
	
	ДополнительныеПараметры.Вставить("АдресХранилища", АдресХранилища);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодготовитьДокументДляДобавленияВПакетЗавершение", ПакетыДокументовЭДОКлиент, ДополнительныеПараметры);
	РаботаСФайламиБЭДКлиент.СкорректироватьИмяФайлаСУчетомКодировки(ОповещениеОЗавершении, ДанныеФайла.ИмяФайла);
	
КонецПроцедуры 

Функция ПолучитьЭлектронныйДокумент(СсылкаНаДокумент) Экспорт
	
	ПараметрыОткрытия  = ИнтерфейсДокументовЭДОКлиент.НовыеПараметрыОткрытияЭлектронногоДокумента();
	
	ПараметрыПросмотра = ИнтерфейсДокументовЭДОВызовСервера.ПараметрыПросмотраЭлектронногоДокументаПоОбъектуУчета(
		СсылкаНаДокумент, ПараметрыОткрытия);  
	
	Возврат ПараметрыПросмотра.ЭлектронныйДокумент;
	
КонецФункции  

