&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Документ = ПараметрКоманды;
	// --- 
	МассивГруппировок = _ПолучитьГруппировкиПоДокументу(Документ);
	Отбор = _ПолучитьОтборПоДокументу(Документ);
	Параметры = _ПолучитьПараметрыОтчета(Документ);
	Показатели = _ПолучитьПоказателиОтчета(Документ);
	ПФ = Новый Структура("ВнешнийВызов,Отбор,Группировки,Параметры,Показатели", Истина, Отбор, МассивГруппировок,Параметры,Показатели);
	ОткрытьФорму(_ПолучитьИмяФормы(Документ), ПФ,,Истина);
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьИмяФормы(Документ)
	// --- 
	
	Если (ТипЗнч(Документ)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
		
		Возврат("Отчет.CW_ВедомостьАктированияИсходящихСчетов.Форма.ФормаОтчета");
		
	ИначеЕсли (ТипЗнч(Документ)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда 
		
		Возврат("Отчет.CW_ВедомостьАктированияВходящихСчетов.Форма.ФормаОтчета");
		
	ИначеЕсли (ТипЗнч(Документ)=Тип("ДокументСсылка.CW_КорректировкаАктированияСчетов")) Тогда 
		
		Если (Документ.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) Тогда
			
			Возврат("Отчет.CW_ВедомостьАктированияИсходящихСчетов.Форма.ФормаОтчета");
			
		Иначе
			
			Возврат("Отчет.CW_ВедомостьАктированияВходящихСчетов.Форма.ФормаОтчета");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция _ПолучитьПоказателиОтчета(Документ)
	
	Показатели = Новый Структура("Всего,Сумма,НДС",Истина,Ложь,Ложь);

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.CW_КорректировкаАктированияСчетов") Тогда
		
		Если (Документ.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) Тогда
			РеквизитСчета = "ИсходящийСчет";
			ВидОперативнойЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская;
		Иначе
			РеквизитСчета = "ВходящийСчет";
			ВидОперативнойЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская;
		КонецЕсли;

		СтруктураНастроек  = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Документ.Организация,ВидОперативнойЗадолженности, Документ.Дата);

		НастройкиОперативногоУчета = СтруктураНастроек["НастройкиОперативногоУчета"]; 
		Если НастройкиОперативногоУчета["КонтрольНДС"] Тогда
			Показатели.НДС = Истина;
			Показатели.Сумма = Истина;
		КонецЕсли; 
		
	КонецЕсли; 

	Возврат Показатели;
	
КонецФункции
 

&НаСервере
Функция _ПолучитьПараметрыОтчета(Документ)
	// --- 
	
	Параметры = Новый Структура;
	
	Если (ТипЗнч(Документ) <> Тип("ДокументСсылка.CW_КорректировкаАктированияСчетов")) Тогда
		Параметры.Вставить("НачалоПериода",Документ.ДатаСчета);
		Параметры.Вставить("КонецПериода",ТекущаяДата());
	Иначе
		
		НачальнаяДата = Документ.Дата;
		Для каждого Стр Из Документ.КорректировкаАктирования Цикл
			
			Если (Документ.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) Тогда
				РеквизитСчета = "ИсходящийСчет";
			Иначе
				РеквизитСчета = "ВходящийСчет";
			КонецЕсли; 
			Если (Стр[РеквизитСчета].ДатаСчета < НачальнаяДата) Тогда
				НачальнаяДата = Стр[РеквизитСчета].ДатаСчета;
			КонецЕсли; 
			
		КонецЦикла; 
		
		Параметры.Вставить("НачалоПериода",НачалоДня(НачальнаяДата));
		Параметры.Вставить("КонецПериода",ТекущаяДата());
		
	КонецЕсли;
	
	Возврат(Параметры);
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ПолучитьГруппировкиПоДокументу(Документ)

	Если Документ.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		РеквизитСчета = "ИсходящийСчет";
		ВидОперативнойЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская;
	Иначе
		РеквизитСчета = "ВходящийСчет";
		ВидОперативнойЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская;
	КонецЕсли;
	
	СтруктураНастроек = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Документ.Организация,ВидОперативнойЗадолженности, Документ.Дата);
	НастройкиОперативногоУчета = СтруктураНастроек["НастройкиОперативногоУчета"];  
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("Контрагент", "Контрагент", Ложь);
	СписокЗначений.Добавить("Договор", "Договор", Ложь);
	СписокЗначений.Добавить("ДокументВзаиморасчетов", "Документ взаиморасчетов", Ложь);
	СписокЗначений.Добавить("Грузоперевозка", "Грузоперевозка", Ложь);
	
	Если НастройкиОперативногоУчета["КонтрольНоменклатуры"] Тогда
		СписокЗначений.Добавить("Номенклатура", "Номенклатура", Ложь);
	КонецЕсли; 
	
	Возврат СписокЗначений;
	
КонецФункции
 

&НаСервере
Функция _ПолучитьОтборПоДокументу(Документ)
	
	Отбор = Новый Структура;
	
	Если ТипЗнч(Документ) <> Тип("ДокументСсылка.CW_КорректировкаАктированияСчетов") Тогда 
		
		//AFR-250353				  
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
			Если Документ.ПредъявленСчет Тогда
				Отбор.Вставить("ДокументВзаиморасчетов", Документ);  
			ИначеЕсли  Документ.ПредъявленАкт и Не Документ.СписокСчетов Тогда
				Отбор.Вставить("ДокументВзаиморасчетов",Документ.Счет); 
			ИначеЕсли  Документ.ПредъявленАкт и Документ. СписокСчетов Тогда 
				Счета = Документ.Услуги.ВыгрузитьКолонку("Счет");
				Отбор.Вставить("ДокументыВзаиморасчетов", Счета); 
			КонецЕсли;
		Иначе
		//AFR-250353				  
			
			Отбор.Вставить("ДокументВзаиморасчетов",Документ);  
		КонецЕсли;
		
	Иначе
		Отбор.Вставить("Договор",Документ.Договор);

		// получаем грузоперевозки
		ТЗГП = Документ.КорректировкаАктирования.Выгрузить(,"Грузоперевозка");
		ТЗГП.Свернуть("Грузоперевозка");
		Грузоперевозки = ТЗГП.ВыгрузитьКолонку("Грузоперевозка");
		Отбор.Вставить("Грузоперевозки",Грузоперевозки);

		Если Документ.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			РеквизитСчета = "ИсходящийСчет";
			ВидОперативнойЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская;
		Иначе
			РеквизитСчета = "ВходящийСчет";
			ВидОперативнойЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская;
		КонецЕсли; 
		ТЗД = Документ.КорректировкаАктирования.Выгрузить(,РеквизитСчета);
		ТЗД.Свернуть(РеквизитСчета);
		Счета = ТЗД.ВыгрузитьКолонку(РеквизитСчета);
		Отбор.Вставить("ДокументыВзаиморасчетов",Счета);
		
		СтруктураНастроек = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Документ.Организация, ВидОперативнойЗадолженности, Документ.Дата);

		НастройкиОперативногоУчета = СтруктураНастроек["НастройкиОперативногоУчета"];  
		Если НастройкиОперативногоУчета["КонтрольНоменклатуры"] Тогда
			ТЗН = Документ.КорректировкаАктирования.Выгрузить(,"Номенклатура");
			ТЗН.Свернуть("Номенклатура");
			Номенклатура = ТЗН.ВыгрузитьКолонку("Номенклатура");
			Отбор.Вставить("Номенклатуры",Номенклатура);
		КонецЕсли;

		
	КонецЕсли; 
	
	Возврат Отбор;
	
КонецФункции
 