
Функция ПодключитьсяКFTPРесурсу(НастройкиПодключения) Экспорт
	
	Если НЕ ПроверитьЗаполнениеПараметровFTP(НастройкиПодключения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		FTPСоединение = Новый FTPСоединение(НастройкиПодключения.Сервер, 
											НастройкиПодключения.Порт, 
											НастройкиПодключения.Логин, 
											НастройкиПодключения.Пароль,
											,
											,
											НастройкиПодключения.Таймаут); 
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат FTPСоединение;
	
КонецФункции   

Процедура ЗаполнитьНастройкиFTPРесурса(ПараметрыПодключения, FTPНастройки = Неопределено) Экспорт
	
	Если FTPНастройки = Неопределено Тогда
		FTPНастройки = FTPРесурсТехническойПоддержки();
	КонецЕсли; 
	
	Если FTPНастройки = Неопределено Тогда 
		Возврат;
	КонецЕсли;    
	
	ПараметрыПодключения.Сервер 	= FTPНастройки.Сервер;
	ПараметрыПодключения.Порт 		= FTPНастройки.Порт;
	ПараметрыПодключения.Таймаут 	= FTPНастройки.Таймаут;
	
КонецПроцедуры   

Функция ПроверитьЗаполнениеПараметровFTP(FTPНастройки = Неопределено) Экспорт
	
	Если FTPНастройки = Неопределено Тогда
		FTPНастройки = FTPРесурсТехническойПоддержки();
	КонецЕсли;  
	
	Если FTPНастройки = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;  
	
	Возврат ЗначениеЗаполнено(FTPНастройки.Сервер) и ЗначениеЗаполнено(FTPНастройки.Порт);
	
КонецФункции


Функция FTPРесурсТехническойПоддержки() Экспорт
	
	FTPНастройки = ПредопределенноеЗначение("Справочник.CW_НастройкиFTPРесурсов.СерверОбновленийAF");
	Если FTPНастройки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;    
	
	Возврат FTPНастройки;
	
КонецФункции

Функция ПолучитьПустуюСтруктуруНастроекFTP() Экспорт
	
	Возврат Новый Структура("Сервер,Порт,Таймаут,Логин,Пароль",,,,"","");  
	
КонецФункции

