#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура УдалитьЗаписьРегистра(КлючЗаписи) Экспорт
	
	Запись = РегистрыСведений.CW_ХарактеристикиГруппУслуг.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура СкопироватьДатыОказанияГруппУслуг(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияКопирования.ГруппаУслуг КАК ГруппаУслуг,
	               |	ЗначенияКопирования.СрокОплаты КАК СрокОплаты,
	               |	ЗначенияКопирования.ДатаАктаОказанияУслуг КАК ДатаАктаОказанияУслуг,
	               |	ЗначенияКопирования.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы,
	               |	ЗначенияКопирования.ПодробноеОписание КАК ПодробноеОписание,
	               |	ЗначенияКопирования.ВариантПредставления КАК ВариантПредставления,
	               |	ЗначенияКопирования.Доход КАК Доход,
	               |	ЗначенияКопирования.СтавкаНДС КАК СтавкаНДС,
	               |	ВЫБОР
	               |		КОГДА ЗначенияОбъекта.ГруппаУслуг ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Копировать
	               |ПОМЕСТИТЬ ВТ_ЗначенияКопирования
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиГруппУслуг КАК ЗначенияКопирования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГруппУслуг КАК ЗначенияОбъекта
	               |		ПО ЗначенияКопирования.ГруппаУслуг = ЗначенияОбъекта.ГруппаУслуг
	               |			И (ЗначенияКопирования.Владелец = &ЗначениеКопирования)
	               |			И (ЗначенияОбъекта.Владелец = &Владелец)
	               |ГДЕ
	               |	ЗначенияКопирования.Владелец = &ЗначениеКопирования
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Владелец КАК Владелец,
	               |	ВТ_ЗначенияКопирования.ГруппаУслуг КАК ГруппаУслуг,
	               |	ВТ_ЗначенияКопирования.СрокОплаты КАК СрокОплаты,
	               |	ВТ_ЗначенияКопирования.ДатаАктаОказанияУслуг КАК ДатаАктаОказанияУслуг,
	               |	ВТ_ЗначенияКопирования.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы,
	               |	ВТ_ЗначенияКопирования.ПодробноеОписание КАК Описание,
	               |	ВТ_ЗначенияКопирования.ВариантПредставления КАК ВариантПредставления,
	               |	ВТ_ЗначенияКопирования.Доход КАК Доход,
	               |	ВТ_ЗначенияКопирования.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_ЗначенияКопирования.Копировать КАК Копировать
	               |ИЗ
	               |	ВТ_ЗначенияКопирования КАК ВТ_ЗначенияКопирования
	               |ГДЕ
	               |	ВТ_ЗначенияКопирования.Копировать = ИСТИНА";

	Запрос.УстановитьПараметр("ЗначениеКопирования", 	ПараметрыПроцедуры.ЗначениеКопирования);
	Запрос.УстановитьПараметр("Владелец", 				ПараметрыПроцедуры.ТекущийОбъект);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	НаборРегистра = РегистрыСведений.CW_ХарактеристикиГруппУслуг.СоздатьНаборЗаписей();
	НаборРегистра.Отбор.Владелец.Установить(ПараметрыПроцедуры.ТекущийОбъект);
	НаборРегистра.Прочитать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаНабора = НаборРегистра.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Выборка);
	КонецЦикла;
	
	НаборРегистра.Записать();
	
	РегистрыСведений.CW_СоставГруппУслуг.СкопироватьСоставГруппУслуг(ПараметрыПроцедуры.ЗначениеКопирования, ПараметрыПроцедуры.ТекущийОбъект);
	
	ПоместитьВоВременноеХранилище(Неопределено ,АдресРезультата); 

КонецПроцедуры

#КонецЕсли