   
Процедура СписокПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр) Экспорт
	
	Отказ = Истина;  
	
	СписокПриложений = CW_РеестрыНДС0СерверВызовСервера.ПолучитьСписокПриложений(Форма.ДокументРеализации);   
	Если СписокПриложений = Неопределено Тогда
		ПоказатьПредупреждение(,"Не удалось получить список приложений по грузоперевозкам!");
		Возврат;
	КонецЕсли;
	
	Если СписокПриложений.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Нет данных для формирования приложений Реестра по НДС 0%");
		Возврат;
	КонецЕсли;   

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", 				Форма);
	ДополнительныеПараметры.Вставить("ДокументРеализации",	Форма.ДокументРеализации);
	ДополнительныеПараметры.Вставить("ВедущийДокумент",	Неопределено);
	ДополнительныеПараметры.Вставить("ВедомыйДокумент",	Неопределено);
	
	Если ЗначениеЗаполнено(Форма.ДокументРеализации) Тогда
		СтруктураДокументов = CW_РеестрыНДС0СерверВызовСервера.ПолучитьВедомыйВедущийДокумент(Форма.ДокументРеализации);  
		
		ДополнительныеПараметры.Вставить("ВедущийДокумент",	СтруктураДокументов.ВедущийДокумент);
		ДополнительныеПараметры.Вставить("ВедомыйДокумент",	СтруктураДокументов.ВедомыйДокумент);
	КонецЕсли;
	
	ОписаниеОповещения = новый ОписаниеОповещения("ВыборЭлементаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если СписокПриложений.Количество() = 1 Тогда
		ЭлементСписка = СписокПриложений.Получить(0);	
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, ЭлементСписка);
	Иначе
		СписокПриложений.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите приложения реестра по НДС 0%");     
	КонецЕсли;
	
КонецПроцедуры 

Процедура ВыборЭлементаЗавершение(ЭлементСписка, ДополнительныеПараметры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДокументов = Новый Структура;
	СтруктураДокументов.Вставить("ДокументРеализации", 	ДополнительныеПараметры.ДокументРеализации);
	СтруктураДокументов.Вставить("ВедущийДокумент", 	ДополнительныеПараметры.ВедущийДокумент);
	СтруктураДокументов.Вставить("ВедомыйДокумент", 	ДополнительныеПараметры.ВедомыйДокумент);
	СтруктураДокументов.Вставить("ПриложениеРеестра",	ЭлементСписка.Значение);
	
	СтруктураПарамтеров = CW_РеестрыНДС0СерверВызовСервера.ПолучитьСтруктуруПараметров(СтруктураДокументов);
	
	ОткрытьФорму("Справочник.CW_РеестрыНДС0ЗаписиРеестра.ФормаОбъекта", СтруктураПарамтеров, ДополнительныеПараметры.Форма);
	
КонецПроцедуры    




Процедура ПодготовитьДанныеЗаписиРеестраНДС(ПараметрКоманды, Источник) Экспорт  
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник", 		Источник);
	ДополнительныеПараметры.Вставить("ПараметрКоманды", ПараметрКоманды); 

	СписокРеестровНДС = CW_РеестрыНДС0СерверВызовСервера.ПодготовитьДанныеЗаписиРеестраНДСНаСервере(ПараметрКоманды);  
	Если СписокРеестровНДС.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Отсутствуют актуальные данные	реестров НДС 0%");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СписокРеестров", 	СписокРеестровНДС);
	СтруктураПараметров.Вставить("ПараметрКоманды",	ПараметрКоманды);
	
	ОткрытьФорму("ОбщаяФорма.CW_РеестрыНДС0КонтрольЗаполнения", СтруктураПараметров, Источник, Новый УникальныйИдентификатор);  
	
КонецПроцедуры     
