&НаКлиенте
Перем АвтоНаименование;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = 
		?(ЗначениеЗаполнено(Объект.Ссылка.Метаданные().ПредставлениеОбъекта), 
			Объект.Ссылка.Метаданные().ПредставлениеОбъекта, 
			Объект.Ссылка.Метаданные().Синоним
		)
		+ " (" + Строка(Объект.Владелец) + ")"
	;
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.ВидСчета.СписокВыбора.Добавить("Расчетный");
	//Элементы.ВидСчета.СписокВыбора.Добавить("Депозитный");
	//Элементы.ВидСчета.СписокВыбора.Добавить("Ссудный");
	//Элементы.ВидСчета.СписокВыбора.Добавить("Иной");
	Если ЗначениеЗаполнено(Объект.Владелец) И Объект.Ссылка.Пустая() Тогда
		Элементы.Владелец.КнопкаВыбора = Ложь;	
	КонецЕсли; 
	
	АвтоНаименование = СформироватьАвтоНаименование();
КонецПроцедуры

&НаСервере
Функция СформироватьАвтоНаименование()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = Лев(""
	                   + Объект.ВалютаДенежныхСредств
	                   + ?(НЕ Объект.Банк.Пустая(), " в " + Объект.Банк, ""), 
					   100);
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	СтрокаНаименования = Лев(Объект.НомерСчета 
	                   + ?(НЕ Объект.Банк.Пустая(), ", " + Объект.Банк, ""), 
					   100);
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	СтрокаНаименования = Лев(
	                     ?(НЕ Объект.Банк.Пустая(),""+ Объект.Банк, "")
					   +" (" 
	                   + Объект.ВалютаДенежныхСредств
					   +")", 
					   100);
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	Возврат СтрокаНаименования;

КонецФункции

&НаКлиенте
Процедура УстановитьНаименованиеСчета()
	Если Объект.Наименование = АвтоНаименование Тогда
		Объект.Наименование = СформироватьАвтоНаименование();
	КонецЕсли;
	АвтоНаименование = СформироватьАвтоНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДенежныхСредствПриИзменении(Элемент)
	УстановитьНаименованиеСчета()
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	УстановитьНаименованиеСчета()
КонецПроцедуры

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	УстановитьНаименованиеСчета()
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
