// Загрузка исходящего ЭПЭ из XML титула заказчика (вызов сервера с клиента).

#Область ПрограммныйИнтерфейс

// Возвращает данные заполнения исходящего ЭПЭ по XML, помещенному во временное хранилище.
//
// Параметры:
//  АдресФайла - Строка - адрес двоичных данных XML во временном хранилище.
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево
//   * ТекстОшибки - Строка
//   * ДанныеДляЗаполнения - Структура
//
Функция ДанныеЗаполненияЭПЭИзФайла(АдресФайла) Экспорт
	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	Возврат ОбменСГИСЭПД.саб_ДанныеЗаполненияЭПЭИзДвоичныхДанных(ДвоичныеДанныеФайла);
	
КонецФункции

#КонецОбласти
