
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОжидание;
	
	Параметры.Свойство("ВладелецФайлов", ВладелецФайлов);
	
	Если Не ЗначениеЗаполнено(ВладелецФайлов) Тогда
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачатьЗаполнениеДереваФайлов();
	
КонецПроцедуры 

&НаКлиенте
Процедура НачатьЗаполнениеДереваФайлов()
	
	РезультатВыполнения = ПродолжитьЗаполнениеДереваФайловНаСервереВФоне();
	ПараметрыОжидания 	= ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПолученияДереваФайлов", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры

&НаСервере 
Функция ПродолжитьЗаполнениеДереваФайловНаСервереВФоне()  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне    = ложь; 
	
	ПараметрыПроцедуры = Новый Структура;  
	ПараметрыПроцедуры.Вставить("ВладелецФайлов", 	ВладелецФайлов);  
	ПараметрыПроцедуры.Вставить("ДеревоЗначений", 	РеквизитФормыВЗначение("ДеревоФайлов"));  
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ОбъектыАрхива.ПолучитьДеревоФайлов", ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции   

&НаКлиенте 
Процедура ПослеПолученияДереваФайлов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		ПослеПолученияДереваФайловНаСервере(РезультатВыполнения.АдресРезультата);
		
		РазвернутьВсеСтрокиДерева();
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДанные;
	
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования дерева файлов");  
		
	КонецЕсли;  

КонецПроцедуры  

&НаСервере
Процедура ПослеПолученияДереваФайловНаСервере(АдресРезультата)  
	
	ДеревоЗначений = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоФайлов");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФайловПриАктивизацииСтроки(Элемент)
	
	Элементы.ГруппаPDF.Видимость 	= Ложь;
	Элементы.АдресФайла.Видимость  	=Ложь;   
	
	ТекущиеДанные = Элементы.ДеревоФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
		или ТекущиеДанные.ЭтоГруппа  Тогда
		Возврат;
	КонецЕсли;   
	
	ДвоичныеДанные	= ПолучитьДвоичныеДанныеФайла(ТекущиеДанные.Объект);
	Если ДвоичныеДанные <> Неопределено Тогда
		Если СтрНайти(ВРЕГ(ТекущиеДанные.Расширение), "PDF") > 0  Тогда
			ПотокВПамяти   = ДвоичныеДанные.ОткрытьПотокДляЧтения();
			ДокументPDF.Прочитать(ПотокВПамяти);     
			Элементы.ГруппаPDF.Видимость 	= Истина;
			Элементы.АдресФайла.Видимость  	= Ложь;   
		Иначе   
			АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
			Элементы.ГруппаPDF.Видимость 	= Ложь;
			Элементы.АдресФайла.Видимость  	= Истина;   
		КонецЕсли;  
	Иначе
		Элементы.ГруппаPDF.Видимость 	= Ложь;
		Элементы.АдресФайла.Видимость  	= Ложь;   
	КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеФайла(СсылкаНаФайл) 
	
	Возврат CW_РаботаСФайламиСервер.ДвоичныеДанныеФайла(СсылкаНаФайл);
	
КонецФункции   

&НаКлиенте
Процедура ДеревоФайловФлагПриИзменении(Элемент)

	ТекущийРодитель = Элементы.ДеревоФайлов.ТекущийРодитель;
	ТекущаяСтрока   = Элементы.ДеревоФайлов.ТекущаяСтрока;   
	ТекущиеДанные   = Элементы.ДеревоФайлов.ТекущиеДанные;  
	
	ТекущиеДанные.Флаг = ?(ТекущиеДанные.Флаг = 2, 0, ТекущиеДанные.Флаг);
	
	Если ТекущиеДанные.ЭтоГруппа Тогда 
		ОбработатьПодчиненныеЭлементы(ТекущаяСтрока);
		Если ТекущийРодитель <> Неопределено Тогда
			УстановитьФлагРодителя(ТекущаяСтрока);
		КонецЕсли;
	Иначе
		УстановитьФлагРодителя(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПодчиненныеЭлементы(ИдентификаторСтроки)
	
	ГруппаДерева = ДеревоФайлов.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ЭлементыСтроки = ГруппаДерева.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из ЭлементыСтроки Цикл
		СтрокаДерева.Флаг = ГруппаДерева.Флаг;  
		Если СтрокаДерева.ЭтоГруппа Тогда
			ОбработатьПодчиненныеЭлементы(СтрокаДерева.ПолучитьИдентификатор())
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагРодителя(ИдентификаторСтроки)
	
	СтрокаДерева = ДеревоФайлов.НайтиПоИдентификатору(ИдентификаторСтроки);
	ГруппаДерева = СтрокаДерева.ПолучитьРодителя();
	
	ГруппаДерева.Флаг = ПолучитьПометкуРодителяНаКлиенте(ГруппаДерева.ПолучитьЭлементы());
	
	РодительВерхнегоУровня = ГруппаДерева.ПолучитьРодителя(); 
	Если РодительВерхнегоУровня <> Неопределено Тогда
		РодительВерхнегоУровня.Флаг = ПолучитьПометкуРодителяНаКлиенте(РодительВерхнегоУровня.ПолучитьЭлементы());
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Функция ПолучитьПометкуРодителяНаКлиенте(ЭлементыДерева)
	
	Пометка = Неопределено;
	Для Каждого ЭлементДерева из ЭлементыДерева Цикл 
		Если Пометка = Неопределено Тогда
			Пометка = ЭлементДерева.Флаг;
		Иначе
			Если Пометка <> ЭлементДерева.Флаг Тогда
				Пометка = 2;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Пометка = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Пометка; 
	
КонецФункции

&НаКлиенте
Процедура СнятьФлажки(Команда)    
	
	УстановитьСнятьФлажкиНаСервере(0); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьСнятьФлажкиНаСервере(1); 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажкиНаСервере(Флаг)
	
	СтрокиДерева = ДеревоФайлов.ПолучитьЭлементы();  
	Для Каждого СтрокаДерева из СтрокиДерева Цикл
		СтрокаДерева.Флаг = Флаг;
		ОбработатьПодчиненныеЭлементы(СтрокаДерева.ПолучитьИдентификатор());  
	КонецЦикла;                                    
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФайлДляПросмотра(Команда)

	ТекущиеДанные = Элементы.ДеревоФайлов.ТекущиеДанные;
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = CW_РаботаСФайламиКлиент.ДанныеФайла(ТекущиеДанные.Объект, УникальныйИдентификатор);	
	CW_РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбранныеФайлы = ПолучитьМассивВыбранныхФайлов();
	
	ЭтаФорма.Закрыть(ВыбранныеФайлы);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьМассивВыбранныхФайлов()
	
	ВыбранныеФайлы = Новый Массив;
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоФайлов");
	
	Отбор = Новый Структура;
	Отбор.Вставить("Флаг", 		1);
	Отбор.Вставить("ЭтоГруппа", Ложь);
	
	ВыбранныеСтроки = ДеревоЗначений.Строки.НайтиСтроки(Отбор, Истина);
	Для Каждого ВыбраннаяСтрока из ВыбранныеСтроки Цикл  
		Если ТипЗнч(ВыбраннаяСтрока.Объект) = Тип("СправочникСсылка.CW_ОбъектыАрхива")
			И ВыбранныеФайлы.Найти(ВыбраннаяСтрока.Объект) = Неопределено Тогда
			ВыбранныеФайлы.Добавить(ВыбраннаяСтрока.Объект);                      
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыбранныеФайлы;
	
КонецФункции

&НаКлиенте
Процедура РазвернутьВсе(Команда) 
	
	РазвернутьВсеСтрокиДерева();
	
КонецПроцедуры  

&НаКлиенте
Процедура РазвернутьВсеСтрокиДерева()  
	
	ЭлементыДерева = ДеревоФайлов.ПолучитьЭлементы();
	Для Каждого ЭлементДерева из ЭлементыДерева Цикл
		ИдентификаторСтроки = ЭлементДерева.ПолучитьИдентификатор();
		Элементы.ДеревоФайлов.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда) 
	
	СвернутьВсеСтрокиДерева();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсеСтрокиДерева()

	ЭлементыДерева = ДеревоФайлов.ПолучитьЭлементы();
	Для Каждого ЭлементДерева из ЭлементыДерева Цикл
		ИдентификаторСтроки = ЭлементДерева.ПолучитьИдентификатор();
		Элементы.ДеревоФайлов.Свернуть(ИдентификаторСтроки);
	КонецЦикла;

КонецПроцедуры 		


	
