
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("СформироватьПриОткрыти",СформироватьПриОткрыти);
	
	ПоказатьСкрытьНастрйоки = Ложь;
	ПоказатьСкыртьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПереформирвоатьГруппы();
	ОбработатьЭлементыОтбора(Элементы.КомпоновщикНастроекПользовательскиеНастройки.ПодчиненныеЭлементы);
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Если СформироватьПриОткрыти Тогда
		ЭтаФорма.СкомпоноватьРезультат();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПереформирвоатьГруппы()
	
	Группа1 = Элементы.КомпоновщикНастроекПользовательскиеНастройки.ПодчиненныеЭлементы[0];
	Группа2 = Элементы.КомпоновщикНастроекПользовательскиеНастройки.ПодчиненныеЭлементы[1];
	
	ЭлементИспользование 		= Неопределено;
	ОбработчикПередЗаписью 		= Неопределено;	
	ОбработчикПриЗаписи  		= Неопределено;
	ОбработчикПриПроведении   	= Неопределено;
	ОбработчикПередУдалением  	= Неопределено;


	Для каждого Элемент из Группа1.ПодчиненныеЭлементы Цикл
		Если Элемент.Заголовок = "только используемые" Тогда
			ЭлементИспользование =  Элемент;
		ИначеЕсли Элемент.Заголовок = "перед записью" Тогда
			  ОбработчикПередЗаписью = Элемент;
		ИначеЕсли Элемент.Заголовок = "при записи" Тогда
			  ОбработчикПриЗаписи = Элемент;
		ИначеЕсли Элемент.Заголовок = "при проведении" Тогда
			  ОбработчикПриПроведении = Элемент;
		ИначеЕсли Элемент.Заголовок = "перед удалением" Тогда
			  ОбработчикПередУдалением = Элемент;
		КонецЕсли;
	КонецЦикла;
	Для каждого Элемент из Группа2.ПодчиненныеЭлементы Цикл
		Если Элемент.Заголовок = "только используемые" Тогда
			ЭлементИспользование =  Элемент;
		ИначеЕсли Элемент.Заголовок = "перед записью" Тогда
			  ОбработчикПередЗаписью = Элемент;
		ИначеЕсли Элемент.Заголовок = "при записи" Тогда
			  ОбработчикПриЗаписи = Элемент;
		ИначеЕсли Элемент.Заголовок = "при проведении" Тогда
			  ОбработчикПриПроведении = Элемент;
		ИначеЕсли Элемент.Заголовок = "перед удалением" Тогда
			  ОбработчикПередУдалением = Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Переместить(ЭлементИспользование, Группа1);
	
	Элементы.Переместить(ОбработчикПередУдалением	, Группа2);
	Элементы.Переместить(ОбработчикПриПроведении	, Группа2	, ОбработчикПередУдалением);
	Элементы.Переместить(ОбработчикПриЗаписи		, Группа2	, ОбработчикПриПроведении);
	Элементы.Переместить(ОбработчикПередЗаписью		, Группа2	, ОбработчикПриЗаписи);
	
	Группа1.Заголовок 			= "Использование:";
	Группа1.ОтображатьЗаголовок = Истина;
	Группа1.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
//	Группа1.ШрифтЗаголовка      = новый Шрифт(Группа1.ШрифтЗаголовка,,,Истина);
	
	Группа2.Заголовок 			= "События:";
	Группа2.ОтображатьЗаголовок = Истина;
	Группа2.Группировка 		= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
//	Группа2.ШрифтЗаголовка      = новый Шрифт(Группа2.ШрифтЗаголовка,,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЭлементыОтбора(ПодчиненныеЭлементы)
	
	Для каждого Элемент из ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(Элемент )= Тип("ГруппаФормы") Тогда
			Элемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
			ОбработатьЭлементыОтбора(Элемент.ПодчиненныеЭлементы);
			
		ИначеЕсли ТипЗнч(Элемент )= Тип("ПолеФормы") Тогда
			Если Элемент.Вид  = ВидПоляФормы.ПолеФлажка Тогда
				Элемент.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Право;
				Элемент.Заголовок 			= НРег(Элемент.Заголовок);
			Иначе
				Элемент.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Верх;
			Конецесли;
		Конецесли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьНастройки(Команда)
	
	ПоказатьСкрытьНастрйоки = не ПоказатьСкрытьНастрйоки;
	ПоказатьСкыртьНастройки();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкыртьНастройки()
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = ПоказатьСкрытьНастрйоки;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	// отключаем стандартный механизм
	СтандартнаяОбработка = Ложь;
	// готовим объект обрабатывающий расшифровку
	// в первый параметр указываем адрес хранилища данных расшифровки (который мы подготовили при формировании отчета)
	// во второй параметр настройки нашего отчета
	ОбработкаРасшифровки =  Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет));
	
	// подготавливаем доступные действия
	// их может быть больше чем один
	// но если указать одной действие, то при обработки расшифровки будет выполнено именно оно
	// без возможности выбора других
	МассивДоступныхДействий = Новый Массив();
	МассивДоступныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	
	ДополонитеьныеПункты = Новый СписокЗначений;
	
	// в режим запрета модальности используется метод "ПоказатьВыборДействия", иначе можно использовать метод  "ВыбратьДействие"
	ОбработкаРасшифровки.ПоказатьВыборДействия(Новый ОписаниеОповещения("ОбработатьРасшифровку",ЭтаФорма),Расшифровка,МассивДоступныхДействий,ДополонитеьныеПункты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРасшифровку(ВыбранноеДействие,ВыбранноеЗначение,Параметр3) Экспорт

	// поле выбора действия, обрабаытваем нужные нам манипуляции
	// в нашем случае можно этого не делать, так как у нас доступно только действие "ОткрытьЗначение"
	Если ВыбранноеДействие <> ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
		Если ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
			// в режиме запрета модальности используем "ПоказатьЗначение"
			ПоказатьЗначение(,ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


