#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ПолучитьФамилиюИмяАнгл(ФизЛицо) Экспорт 
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	CW_ПараметрыСотрудников.ФамилияИмяАнгл
		|ИЗ
		|	РегистрСведений.CW_ПараметрыСотрудников КАК CW_ПараметрыСотрудников
		|ГДЕ
		|	CW_ПараметрыСотрудников.Сотрудник = &ФизЛицо"
	);
	з.УстановитьПараметр("ФизЛицо", ФизЛицо);
	рз = з.Выполнить();
	выб = рз.Выбрать();
	Если выб.Следующий() Тогда 
		Возврат выб.ФамилияИмяАнгл;
	Иначе 
		Возврат "";
	КонецЕсли;
КонецФункции

Процедура УстановитьФамилиюИмяАнгл(ФизЛицо, ФИОАнгл) Экспорт 
	Если ЗначениеЗаполнено(ФизЛицо) Тогда 
		рсНЗ = РегистрыСведений.CW_ПараметрыСотрудников.СоздатьНаборЗаписей();
		рсНЗ.Отбор.Сотрудник.Значение = ФизЛицо;
		рсНЗ.Отбор.Сотрудник.Использование = Истина;
		рсНЗ.Прочитать();
		рсмз = РегистрыСведений.CW_ПараметрыСотрудников.СоздатьМенеджерЗаписи();
		Если рсНЗ.Количество()=0 Тогда 
			рсмз.Сотрудник = ФизЛицо;
		Иначе 
			рсмз.Сотрудник = ФизЛицо;
			рсмз.Период = рснз[0].Период;
			рсмз.Прочитать();
		КонецЕсли;
		рсмз.ФамилияИмяАнгл = ФИОАнгл;
		рсмз.Записать();
	КонецЕсли;
КонецПроцедуры
#КонецЕсли