&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Массив = Новый Массив;
	Массив.Добавить("СтраницаВыборДействия");         //0
	
	МассивСтраниц = Новый ФиксированныйМассив(Массив);  
	
	ТекущиеДанныеАктивации = CW_РегистрацияПрограммыСервер.ПолучитьТекущиеПараметрыАктивацииПрограмногоПродукта();   
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ТекущиеДанныеАктивации);
	
	Элементы.ДекорацияПорядокАктивации.Заголовок = ?(ПорядокАктивации = 0, "Активация программного продукта","Повторное получение кода активации");
	
	УстановитьТекущуюСтарницу(НомерШага);
	СтруктураВидимостьКнопок = Новый Структура("ФормаКомандаНазад,ФормаКомандаДалее,КомандаЗакрыть,Закрыть",Ложь,Ложь,Ложь,Ложь);
	УстановитьВидиостьКнопок(СтруктураВидимостьКнопок);                                             
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	CW_РегистрацияПрограммыКлиент.ПолучитьРегистрационныйНомер(ЭтаФорма);

КонецПроцедуры    

&НаКлиенте
Процедура ВвестиКодАктивации(Команда)  

	УстановитьМассивСтраницРучнойРегистрации();
	
	СпособАктивации = 1;    
	ОбработатьШагДалее();

КонецПроцедуры
  
&НаКлиенте
Процедура ПолучитьКодАктивацииОнлайн(Команда)  

	УстановитьМассивСтраницОнлайнРегистрации();
	
	СпособАктивации = 0; 
	ОбработатьШагДалее();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьМассивСтраницОнлайнРегистрации()
	
	Массив = Новый Массив;
	Массив.Добавить("СтраницаВыборДействия");         //0
	Массив.Добавить("СтраницаПараметрыРегистрации");  //1  
	Массив.Добавить("СтраницаПинКод");  			  //2  
	Массив.Добавить("СтраницаЗавершено");             //3
	Массив.Добавить("СтраницаОшибка");                //4

	МассивСтраниц = Новый ФиксированныйМассив(Массив);  

КонецПроцедуры  

  &НаСервере
Процедура УстановитьМассивСтраницРучнойРегистрации()
	
	Массив = Новый Массив;
	Массив.Добавить("СтраницаВыборДействия");         //0
	Массив.Добавить("СтраницаПараметрыРегистрации");  //1
	Массив.Добавить("СтраницаРучнаяРегистарция");     //2
	Массив.Добавить("СтраницаЗавершено");             //3
	Массив.Добавить("СтраницаОшибка");                //4

	МассивСтраниц = Новый ФиксированныйМассив(Массив);  

КонецПроцедуры

&НаКлиенте
Процедура КомандаДалее(Команда)
	
	ОбработатьШагДалее();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШагДалее()  
	
	СледующийШаг = Истина;
	
	СтруктураВидимостьКнопок = Новый Структура("ФормаКомандаНазад,ФормаКомандаДалее,КомандаЗакрыть,Закрыть",Истина,Истина,Ложь,Истина);
	
	Если НомерШага = 1 Тогда  
		
		Если СпособАктивации = 0 Тогда
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить( Новый ФорматированнаяСтрока("Введите ранее полученный пин-код в поле ввода и нажмите ""Продолжить""",Новый Шрифт(,,Истина)));
			
			Элементы.Информация.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
		Иначе  
			СтруктураВидимостьКнопок.ФормаКомандаДалее = Ложь;
		КонецЕсли;
		
	ИначеЕсли НомерШага = 2 Тогда
		
		Если СпособАктивации = 0 Тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("РегистрационныйНомер", 	РегистрационныйНомер);
			СтруктураПараметров.Вставить("ПинКод", 					ПинКод);
			СтруктураПараметров.Вставить("Событие", 				1);
			
			Успешно = CW_РегистрацияПрограммыСервер.ПроверитьВведенныйПинКод(СтруктураПараметров);   
			Если Успешно Тогда      
				
				CW_РегистрацияПрограммыСервер.ЗаблокироватьПинКод(СтруктураПараметров);
				
				ПараметрыРегистрации = Новый Структура;
				ПараметрыРегистрации.Вставить("РегистрационныйНомер", 			 РегистрационныйНомер);
				ПараметрыРегистрации.Вставить("СпособАктивации", 				 СпособАктивации);
				ПараметрыРегистрации.Вставить("ПорядокАктивации", 				 ПорядокАктивации);
				ПараметрыРегистрации.Вставить("ИспользованиеИнформационнойБазы", РабочаяИнформационнаяБаза);
				
				CW_РегистрацияПрограммыСервер.ВыполнитьОнлайнАктивацию(ПараметрыРегистрации);
				
				СтруктураВидимостьКнопок.ФормаКомандаДалее 	= Ложь;
				СтруктураВидимостьКнопок.ФормаКомандаНазад 	= Ложь;
				СтруктураВидимостьКнопок.КомандаЗакрыть 	= Истина;
				СтруктураВидимостьКнопок.Закрыть 			= Ложь;
				
			Иначе
				ПоказатьПредупреждение(, "Введен некорректный пин-код");
				СледующийШаг = Ложь;  
			КонецЕсли;  
			
		Иначе      
			ВведенныйКод = СтрЗаменить(КодАктивации,"-","");
			Успешно = ПроверитьВведенныйКодАктивации(ВведенныйКод);
			Если Успешно Тогда
				СтруктураВидимостьКнопок.ФормаКомандаДалее 	= Ложь;
				СтруктураВидимостьКнопок.ФормаКомандаНазад 	= Ложь;  
				СтруктураВидимостьКнопок.КомандаЗакрыть 	= Истина;
				СтруктураВидимостьКнопок.Закрыть 			= Ложь;
			Иначе
				ПоказатьПредупреждение(, "Введен некорректный код активации!");
				СледующийШаг = Ложь;  
			КонецЕсли; 
		КонецЕсли;
		
	ИначеЕсли НомерШага = 3 Тогда 
		
		СтруктураВидимостьКнопок.ФормаКомандаНазад  = Ложь;
		СтруктураВидимостьКнопок.ФормаКомандаДалее  = Ложь; 
		СтруктураВидимостьКнопок.КомандаЗакрыть 	= Истина;
		СтруктураВидимостьКнопок.Закрыть 			= Ложь;
		
	ИначеЕсли	НомерШага = 4 Тогда 
		
		СтруктураВидимостьКнопок.ФормаКомандаНазад  = Ложь;
		СтруктураВидимостьКнопок.ФормаКомандаДалее  = Ложь; 
		СтруктураВидимостьКнопок.КомандаЗакрыть 	= Ложь;
		СтруктураВидимостьКнопок.Закрыть 			= Истина;
		
	КонецЕсли;  
	
	Если СледующийШаг Тогда
		НомерШага = НомерШага + 1;
	КонецЕсли;

	УстановитьВидиостьКнопок(СтруктураВидимостьКнопок); 
	
	УстановитьТекущуюСтарницу(НомерШага); 

КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда) 

	СтруктураВидимостьКнопок = Новый Структура("ФормаКомандаНазад,ФормаКомандаДалее,КомандаЗакрыть,Закрыть",Истина,Истина,Ложь,Истина);
	
	Если НомерШага = 0 Тогда   
		
		СтруктураВидимостьКнопок.ФормаКомандаНазад = Ложь;
		
	ИначеЕсли НомерШага = 3 или НомерШага = 4 Тогда  
		
		 СтруктураВидимостьКнопок.ФормаКомандаНазад = Ложь;
		 СтруктураВидимостьКнопок.ФормаКомандаДалее = Ложь;
		
	КонецЕсли;

	НомерШага = НомерШага - 1;
	
	УстановитьВидиостьКнопок(СтруктураВидимостьКнопок);  
	УстановитьТекущуюСтарницу(НомерШага); 
	
КонецПроцедуры


&НаСервере
Процедура УстановитьТекущуюСтарницу(ИндексСтраницы) 
	
	ИмяСтраницы = МассивСтраниц.Получить(ИндексСтраницы);
	Элементы.Страницы.ТекущаяСтраница = Элементы[ИмяСтраницы];
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьВидиостьКнопок(ВидимостьКнопок) 
	
	Для Каждого КлючЗначение из ВидимостьКнопок Цикл
		Элементы[КлючЗначение.Ключ].Видимость = КлючЗначение.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьРегистрационныеДанные(Команда)    
	
	ПараметрыРегистарции = Новый Структура;
	ПараметрыРегистарции.Вставить("РегистрационныйНомер", 				РегистрационныйНомер);
	ПараметрыРегистарции.Вставить("ИспользованиеИнформационнойБазы", 	РабочаяИнформационнаяБаза);
	ПараметрыРегистарции.Вставить("СпособАктивации", 					СпособАктивации);
	ПараметрыРегистарции.Вставить("ПорядокАктивации", 					ПорядокАктивации);
	
	CW_РегистрацияПрограммыКлиент.ПодготовитьРегистрационныеДанные(ПараметрыРегистарции);

КонецПроцедуры  

&НаКлиенте
Процедура ОбработатьРезультатОнлайнАктивации(РезультатВыполнения) 
	
	Если РезультатВыполнения = Истина Тогда 
		НомерШага = 3;
	Иначе
		НомерШага = 4;
	КонецЕсли;
	
	ОбработатьШагДалее();
	
КонецПроцедуры

&НаКлиенте
Процедура КодАктивацииПриИзменении(Элемент) 
	
	УстановитьВидимостьКнопкиЗавершить(); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопкиЗавершить()
	
	Элементы.ФормаКомандаДалее.Видимость = (СтрДлина(СтрЗаменить(КодАктивации," ","")) = 44);

КонецПроцедуры 

&НаСервере
Функция ПроверитьВведенныйКодАктивации(ВведенныйКод)
	
	Ответ = CW_РегистрацияПрограммыСервер.ПроверитьВведенныйКодАктивации(ВведенныйКод); 
	Если Ответ.Успещно Тогда
		CW_РегистрацияПрограммыСервер.ЗаписатьРезультатАктивации(Ответ);	
	КонецЕсли;
	
	Возврат Ответ.Успешно;
	
КонецФункции 

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	
	 ЭтаФорма.Закрыть(Успешно);
	
КонецПроцедуры

 



