&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	НачатьПолучениеДанныхСервиса();
	
КонецПроцедуры  

&НаКлиенте
Процедура СписокСчетов(Команда)
	
	ОткрытьФорму("ОбщаяФорма.CW_ДоходыНерезидентовСписокСчетов", , ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура НачатьПолучениеДанныхСервиса()
	
	РезультатВыполнения =  ОбновитьДанныеОСервисеНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПолученияДанных", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеОСервисеНаСервереВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "МониторПорталаТехническойПоддержки.ПолучениеИнформации";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ДоходыНерезидентовСервер.МониторПоддержкиПолучитьИнформацию", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции 

&НаКлиенте
Процедура ОбработатьРезультатПолученияДанных(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	 
	Если РезультатВыполнения = Неопределено Тогда   
		Элементы.Картинка_ОшибкаПолученияДанных.Видимость 	= Истина;
		Элементы.Картинка_НеПодключен.Видимость				= Ложь;
		Элементы.Картинка_Подключен.Видимость				= Ложь;   
		
		ДанныеМонитора = Новый Структура;
		ДанныеМонитора.Вставить("Ошибка", Истина);
		
		ОбновитьНаФормеРаздел(ДанныеМонитора);
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ДанныеМонитора = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		ОбновитьНаФормеРаздел(ДанныеМонитора);
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСодержание;  
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
        ДанныеМонитора = Новый Структура;
		ДанныеМонитора.Вставить("Ошибка", Истина);
		
		ОбновитьНаФормеРаздел(ДанныеМонитора);
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьНаФормеРаздел(ДанныеСервиса)

	Элементы.Картинка_ОшибкаПолученияДанных.Видимость	= ДанныеСервиса.Ошибка;
	
	Элементы.Страницы.ТекущаяСтраница		= Элементы.СтраницаСодержание; 
	Элементы.ОшибкаАвторизации.Видимость	= ДанныеСервиса.Ошибка;  
	Элементы.ИнформацияОПодписке.Видимость	= Не ДанныеСервиса.Ошибка;

	Если ДанныеСервиса.Ошибка Тогда
		Возврат;	
	КонецЕсли;     
	
	ТарифУказан = ЗначениеЗаполнено(ДанныеСервиса.Тариф);

	Элементы.Картинка_Подключен.Видимость				= ДанныеСервиса.Используется;   
	Элементы.Картинка_НеПодключен.Видимость				= Не ДанныеСервиса.Используется;

	Элементы.АвтоматическиВыписыватьСчета.Видимость	= ДанныеСервиса.Используется;
	Элементы.СписокСчетов.Видимость					= ДанныеСервиса.Используется; 
	
	Элементы.Команда_ИнформацияОПодпискеПодключить.Видимость 	= НЕ ДанныеСервиса.Используется;
	Элементы.Надпись_ИнформацияОПодпискеНаСервис.Заголовок		= ТекстИнформацияОПодписке(ДанныеСервиса, ДанныеСервиса.Используется);
	
	Элементы.Картинка_ИнформацияОПодпискеКартинкаКрасный.Видимость = Не ДанныеСервиса.Используется;
	Элементы.Картинка_ИнформацияОПодпискеКартинкаЖелтый.Видимость  = Ложь;
	Элементы.Картинка_ИнформацияОПодпискеКартинкаЗеленый.Видимость = ДанныеСервиса.Используется;
	
	Если ДанныеСервиса.Используется Тогда
		
		АвтоматическиВыписыватьСчета	= ДанныеСервиса.АвтоматическиВыписыватьСчета;
		
		Элементы.Картинка_ИнформацияОПодпискеКартинкаКрасный.Видимость = Не ТарифУказан;
		Элементы.Картинка_ИнформацияОПодпискеКартинкаЖелтый.Видимость  = ТарифУказан И КонецМесяца(ДанныеСервиса.ДатаОкончания) = КонецМесяца(ТекущаяДата());
		Элементы.Картинка_ИнформацияОПодпискеКартинкаЗеленый.Видимость = ДанныеСервиса.Используется И ТарифУказан И КонецМесяца(ДанныеСервиса.ДатаОкончания) > КонецМесяца(ТекущаяДата());
		
		Элементы.МинимальнаяВерсия.Видимость 	= ДанныеСервиса.Используется И ТарифУказан и НЕ ДанныеСервиса.ИгнорироватьМинимальнуюВерсию;
		Элементы.РекомендуемаяВерсия.Видимость 	= ДанныеСервиса.Используется и НЕ ДанныеСервиса.ИгнорироватьМинимальнуюВерсию;
		
		Элементы.Картинка_МинимальнаяКартинкаЗеленый.Видимость	= ДанныеСервиса.Используется и ДанныеСервиса.СоответствуетМинимальной;
		Элементы.Картинка_МинимальнаяКартинкаКрасный.Видимость	= ДанныеСервиса.Используется и НЕ ДанныеСервиса.СоответствуетМинимальной;
		
		Элементы.Надпись_МинимальнаяОписание.Заголовок		= ТекстИнформацияСовместимостьМинимальная(ДанныеСервиса);
		Элементы.Надпись_РекомендуемаяОписание.Заголовок	= ТекстИнформацияСовместимостьРекомендуемая(ДанныеСервиса);
	КонецЕсли;
	
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ТекстИнформацияОПодписке(ДанныеМонитора, СервисИспользуется)
	мСтроки = Новый Массив;
	
	Если СервисИспользуется Тогда
		Если ДанныеМонитора.Тариф = "" Тогда
			мСтроки.Добавить(Новый ФорматированнаяСтрока("Нет данных о действующей подписке на сервис"));
		Иначе
			мСтроки.Добавить(Новый ФорматированнаяСтрока("Тариф: "));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(ДанныеМонитора.Тариф, Новый Шрифт(,,Истина)));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(" действует до: "));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(Формат(ДанныеМонитора.ДатаОкончания,"ДФ=dd.MM.yyyy"), Новый Шрифт(,,Истина)));
		КонецЕсли;
	Иначе
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Сервис не подключен"));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(мСтроки);	

КонецФункции  

&НаСервереБезКонтекста
Функция ТекстИнформацияСовместимостьМинимальная(ДанныеМонитора)

	Если ДанныеМонитора.Тариф = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Минимальная версия модуля ""Бухгалтерия экспедитора 8"": "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ДанныеМонитора.МинимальнаяВерсия, Новый Шрифт(,,Истина)));

	Возврат Новый ФорматированнаяСтрока(мСтроки);	
	
КонецФункции  

&НаСервереБезКонтекста
Функция ТекстИнформацияСовместимостьРекомендуемая(ДанныеМонитора)

	Если ДанныеМонитора.Тариф = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Рекомендуемая версия модуля ""Бухгалтерия экспедитора 8"": "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ДанныеМонитора.РекомендуемаяВерсия, Новый Шрифт(,,Истина)));

	Возврат Новый ФорматированнаяСтрока(мСтроки);	
	
КонецФункции

&НаКлиенте
Процедура АвтоматическиВыписыватьСчетаПриИзменении(Элемент)
	
	РезультатВыполнения =  ОбновитьДанныеАвтоматическойВыпискиСчетовНаСервереВФоне();   
	
	ДополнительныеПарамтеры = Новый Структура;  
	ДополнительныеПарамтеры.Вставить("УстанавливаемоеЗначение", АвтоматическиВыписыватьСчета); 
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатИзмененияАвтоматическойВыпискиСчетов", ЭтотОбъект, ДополнительныеПарамтеры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеАвтоматическойВыпискиСчетовНаСервереВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "ОбработатьРезультатИзмененияАвтоматическойВыпискиСчетов";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура; 
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ДоходыНерезидентовСервер.ОбновитьДанныеАвтоматическойВыпискиСчетов", ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции	
	
&НаКлиенте
Процедура ОбработатьРезультатИзмененияАвтоматическойВыпискиСчетов(РезультатВыполнения, ДополнительныеПарамтеры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда   
		Возврат; 
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ДанныеРезультата = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);  
		Если ДанныеРезультата = Неопределено Тогда 
			
			АвтоматическиВыписыватьСчета = Не ДополнительныеПарамтеры.УстанавливаемоеЗначение;
			
			ПоказатьПредупреждение(,	"Не удалось изменить автоматическую выписку счетов.
										|Попробуйте позже.");
			
		Иначе   
			Если ДанныеРезультата.КодСостояния <> 200 Тогда
				АвтоматическиВыписыватьСчета = Не ДополнительныеПарамтеры.УстанавливаемоеЗначение;
			КонецЕсли
		КонецЕсли
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		АвтоматическиВыписыватьСчета = Не ДополнительныеПарамтеры.УстанавливаемоеЗначение;
		
		ПоказатьПредупреждение(, 	"Не удалось изменить автоматическую выписку счетов.
									|Попробуйте позже.");
		
	КонецЕсли;
	
КонецПроцедуры  




