
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидыЦен") Тогда 
		
		ИспользоватьВидыЦен = Истина;
		
		Для Каждого ВидЦены Из Параметры.ВидыЦен Цикл 
			СтрокаЦены = ВидыЦен.Добавить();
			СтрокаЦены.Значение = ВидЦены.УникальноеИмя;
			СтрокаЦены.Представление = ВидЦены.Наименование;
			СтрокаЦены.Пометка = ВидЦены.Отображать;
		КонецЦикла;
		
	КонецЕсли;
	
	СформироватьЗаголовокВидовЦен(ЭтотОбъект);
	УстановитьЗаголовокПроцента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидыЦенНажатие(Элемент)
	
	Описание = Новый ОписаниеОповещения("ВидыЦенНажатиеЗавершение", ЭтотОбъект);
	
	ВидыЦен.ПоказатьОтметкуЭлементов(Описание, НСтр("ru = 'Выберите виды цен для изменения'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентПриИзменении(Элемент)
	
	УстановитьЗаголовокПроцента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Ответ = Новый Структура();
	Ответ.Вставить("Процент"  , Процент);
	Ответ.Вставить("ВидыЦен"  , ВидыЦен);
	Ответ.Вставить("Уменьшить", Уменьшить);
	
	Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПлюс(Команда)
	
	Уменьшить = Ложь;
	УстановитьЗаголовокПроцента(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаМинус(Команда)
	
	Уменьшить = Истина;
	УстановитьЗаголовокПроцента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьЗаголовокВидовЦен(Форма)
	
	СтрокаЗаголовок = "";
	Если НЕ Форма.ИспользоватьВидыЦен Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ВидыЦен.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВидЦены Из Форма.ВидыЦен Цикл
		
		Если ВидЦены.Пометка Тогда 
			
			Если СтрокаЗаголовок <> "" Тогда
				СтрокаЗаголовок = СтрокаЗаголовок + " • ";
			КонецЕсли;
			
		СтрокаЗаголовок = СтрокаЗаголовок + ВидЦены.Представление;
		КонецЕсли;
	
	КонецЦикла;
	
	Если СтрокаЗаголовок = "" Тогда
		СтрокаЗаголовок =  НСтр("ru = 'Выберите виды цен'");
	КонецЕсли;
	
	Форма.Элементы.ВидыЦен.Заголовок = СтрокаЗаголовок;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыЦенНажатиеЗавершение(Список, ДополнительныеПараметры) Экспорт
	
	СформироватьЗаголовокВидовЦен(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокПроцента(Форма)

	Шаблон = НСтр("ru = 'Цена будет %1 на %2%%'");
	
	Если Форма.Процент = 0 Тогда
		Форма.Элементы.ДекорацияПояснение.Заголовок  = НСтр("ru = 'Сумма изменена не будет'");
		Форма.Элементы.ДекорацияПояснение.ЦветТекста = WebЦвета.Черный;
	ИначеЕсли Форма.Уменьшить Тогда
		Форма.Элементы.ДекорацияПояснение.Заголовок  = СтрШаблон(Шаблон, "уменьшена",Форма.Процент);
		Форма.Элементы.ДекорацияПояснение.ЦветТекста = WebЦвета.Красный;
	Иначе
		Форма.Элементы.ДекорацияПояснение.Заголовок  = СтрШаблон(Шаблон, "увеличена",Форма.Процент);
		Форма.Элементы.ДекорацияПояснение.ЦветТекста = WebЦвета.Зеленый;
	КонецЕсли;
	
	Форма.Элементы.КомандаПлюс.Пометка  = Не Форма.Уменьшить;
	Форма.Элементы.КомандаМинус.Пометка = Форма.Уменьшить;

КонецПроцедуры

#КонецОбласти