&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСВнешнимиРесурсамиЗаблокирована = РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована();
	
	УстановитьПараметрыСписка();

КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)   
	
	Если Копирование Тогда
		Отказ = истина;
		ПоказатьПредупреждение(,"Копирование элементов недоступно");
		Возврат;
	КонецЕсли;
	
	CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПроверитьВозможностьДобавленияЭлемента(Отказ);
	
	Если Не Отказ Тогда
		
		Результат = ПолучитьИнформациюЛичногоКабинета();
		
		Если НЕ Результат.Разрешено Тогда
			Отказ = истина;
			ПоказатьПредупреждение(, "Превышено ограничение количества пользователей текущего тарифа",,"Личный кабинет клиента");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюЛичногоКабинета()
	
	Возврат CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьИнформациюЛичногоКабинета();
	
КонецФункции


&НаКлиенте
Процедура ОбновитьАктивных(Команда)
	
	ВыводитьОкноОжидания = истина;
	ОбновитьАктивностьПользователей();
	ВыводитьОкноОжидания = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАктивностьПользователей()
	
	Если РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ОбновитьАктивностьВФоне();
	
	Дополнительныепараметры = Новый Структура;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = ВыводитьОкноОжидания;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьАктивностьПользователей", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры


&НаСервере
Функция ОбновитьАктивностьВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Получение активность пользователей личного кабинета";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ВебПользователиЛКК.ПолучитьИдентификаторыАктивныхПользователей",ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции 

&НаКлиенте
Процедура ОбработатьАктивностьПользователей(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		МассивИдентификаторов = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		Список.Параметры.УстановитьЗначениеПараметра("МассивИдентификаторов", МассивИдентификаторов);
	
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка получения данных из личного кабинета!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка получения данных из личного кабинета");
		
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура УстановитьПараметрыСписка()
	
	МассивИдентификаторов = Новый Массив;
	Список.Параметры.УстановитьЗначениеПараметра("МассивИдентификаторов", МассивИдентификаторов);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьАктивностьПользователей", 0.1, Истина); 
	
КонецПроцедуры



