// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Метод-конструктор сведении о сообщении ЭДО.
// 
// Возвращаемое значение:
//  Структура - Новые сведения о сообщении:
// * ИмяФайла - Строка - Имя файла сообщения ЭДО
// * ИдентификаторДокументооборота - Строка - Идентификатор документооборота сообщения ЭДО
// * ФайлСообщенияЭДО - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы - Ссылка на сообщение ЭДО
Функция НовыеСведенияОСообщении() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяФайла"                      , "");
	Результат.Вставить("ИдентификаторДокументооборота" , "");
	Результат.Вставить("ФайлСообщенияЭДО"              , Справочники.СообщениеЭДОПрисоединенныеФайлы.ПустаяСсылка());

	Возврат Результат;
	
КонецФункции

// Фиксирует сведения о сообщении ЭДО для дальнейшего поиска.
// 
// Параметры:
//  Сведения - См. НовыеСведенияОСообщении
Процедура Зафиксировать(Знач Сведения) Экспорт
	
	// Проверка входных параметров	
	КонтекстПроверки = "РегистрСведений.СведенияОФайлахСообщенийЭДО.Зафиксировать";
	
	ПроверитьНеПустаяСтрока(
		КонтекстПроверки, 
		"Сведения.ИмяФайла",
		Сведения.ИмяФайла); 
	ПроверитьНеПустаяСтрока(
		КонтекстПроверки, 
		"Сведения.ИдентификаторДокументооборота",
		Сведения.ИдентификаторДокументооборота); 
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		КонтекстПроверки, 
		"Сведения.ФайлСообщенияЭДО",
		Сведения.ФайлСообщенияЭДО, 
		Тип("СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы"));
	
	Хеш = Хеш(Сведения.ИмяФайла);
	
	НачатьТранзакцию();
	Попытка
		УстановитьБлокировку(Хеш);
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Хеш.Установить(Хеш);
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Хеш                           = Хеш;
		Запись.ИдентификаторДокументооборота = Сведения.ИдентификаторДокументооборота;
		Запись.ИмяФайла                      = Сведения.ИмяФайла;
		Запись.ФайлСообщенияЭДО              = Сведения.ФайлСообщенияЭДО;
		
		// Записываем данные
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать(Истина);
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Получает сведения о сообщении ЭДО по имени файла
// 
// Параметры:
//  ИмяФайла - Строка - Имя файла сообщения ЭДО
// 
// Возвращаемое значение:
//  Неопределено
//  См. НовыеСведенияОСообщении
Функция СведенияОСообщении(Знач ИмяФайла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Хеш", Хеш(ИмяФайла));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сведения.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота,
		|	Сведения.ФайлСообщенияЭДО КАК ФайлСообщенияЭДО
		|ИЗ
		|	РегистрСведений.СведенияОФайлахСообщенийЭДО КАК Сведения
		|ГДЕ
		|	Сведения.Хеш = &Хеш";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Результат = НовыеСведенияОСообщении();
		
		ИдентификаторДокументооборота = Выборка.ИдентификаторДокументооборота; // Строка
		ФайлСообщенияЭДО              = Выборка.ФайлСообщенияЭДО; // СправочникиСсылка.СообщениеЭДОПрисоединенныеФайлы
		
		Результат.ИдентификаторДокументооборота = ИдентификаторДокументооборота;
		Результат.ИмяФайла                      = ИмяФайла;
		Результат.ФайлСообщенияЭДО              = ФайлСообщенияЭДО;
		
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вычисляет Хеш имени файла
// 
// Параметры:
//  ИмяФайла - Строка - Имя файла
// 
// Возвращаемое значение:
//  Строка - Хеш имени файла
Функция Хеш(Знач ИмяФайла)
	Возврат ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ИмяФайла);
КонецФункции

// Параметры:
//  Контекст          - Строка
//  ИмяПараметра      - Строка
//  ЗначениеПараметра - Строка
Процедура ПроверитьНеПустаяСтрока(Знач Контекст, Знач ИмяПараметра, Знач ЗначениеПараметра)
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		Контекст,
		ИмяПараметра,
		ЗначениеПараметра,
		Тип("Строка"));
	ОбщегоНазначенияКлиентСервер.Проверить(
		Не ПустаяСтрока(ЗначениеПараметра),
		СтрШаблон(
			НСтр(
				"ru = 'Значение параметра %1 не может содержать пустую строку'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			ИмяПараметра),
		Контекст);
	
КонецПроцедуры

// Параметры:
//  Хеш - Строка
Процедура УстановитьБлокировку(Знач Хеш)
	
	ИмяПространстваБлокировки = Метаданные.РегистрыСведений.СведенияОФайлахСообщенийЭДО.ПолноеИмя();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить(ИмяПространстваБлокировки);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Хеш", Хеш);

	//@skip-check lock-out-of-try - особенность реализации метода
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
