#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;     
	
	Поля.Добавить("Дата");
	Поля.Добавить("Организация");
	Поля.Добавить("Контрагент");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;  
	Представление = СокрЛП(Данные.Организация)+" / " +СокрЛП(Данные.Контрагент)  + " от " + Формат(Данные.Дата,"ДФ=dd.MM.yyyy");

КонецПроцедуры


Процедура НумерацияСправочникаСведенияОДоходах() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыНерезидентовСведенияОДоходах.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ДоходыНерезидентовСведенияОДоходах КАК CW_ДоходыНерезидентовСведенияОДоходах";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СведенияОДоходахОбъекти = Выборка.Ссылка.ПолучитьОбъект();
		СведенияОДоходахОбъекти.записать();
	КонецЦикла;
	
КонецПроцедуры      

Процедура ОбновитьСтруктуруСведенийОДоходах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыНерезидентовСведенияОДоходах.Ссылка КАК Ссылка,
	               |	CW_ДоходыНерезидентовСведенияОДоходах.ХранилищеРаздел42 КАК ХранилищеРаздел42,
	               |	CW_ДоходыНерезидентовСведенияОДоходах.ХранилищеТабличногоДокумента КАК ХранилищеТабличногоДокумента,
	               |	CW_ДоходыНерезидентовСведенияОДоходах.Приказ КАК Приказ
	               |ИЗ
	               |	Справочник.CW_ДоходыНерезидентовСведенияОДоходах КАК CW_ДоходыНерезидентовСведенияОДоходах";   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл  
		
		СтруктураРаздела 	= CW_ДоходыНерезидентовДополнительный.ПолучитьСтруктуруРаздела(Выборка.Приказ);  
		Если СтруктураРаздела = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТабличныйДокумент	= Выборка.ХранилищеТабличногоДокумента.Получить();
		Раздел42 			= CW_ДоходыНерезидентовДополнительный.ДанныеТабличногоДокумента(ТабличныйДокумент, СтруктураРаздела["Раздел42"]);
		
		СведенияОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СведенияОбъект.ХранилищеРаздел42	= Новый ХранилищеЗначения(Раздел42, Новый СжатиеДанных(9));
		СведенияОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
