
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПредставлениеДокумента = СокрЛП(ТекущийДокумент.ПредставлениеДокумента);    
	
	мДокументыОплаты = Новый Массив;
	мДокументыОплаты.Добавить(тип("ДокументСсылка.CW_ДвижениеДенежныхСредств"));
	мДокументыОплаты.Добавить(тип("ДокументСсылка.CW_Оплата"));

	ЭтоДокументОплаты = (мДокументыОплаты.Найти(ТипЗнч(ТекущийДокумент)) <> Неопределено);     
	
	НастройкиКомпоновщика = КомпоновщикНастроек.Настройки;
	НастройкиКомпоновщика.ПараметрыДанных.УстановитьЗначениеПараметра("ДебиторскаяЗадолженность", 	(ВидЗадолженности = "ДЕБИТОРСКАЯ"));    
	НастройкиКомпоновщика.ПараметрыДанных.УстановитьЗначениеПараметра("КредиторскаяЗадолженность", 	(ВидЗадолженности = "КРЕДИТОРСКАЯ"));  
	НастройкиКомпоновщика.ПараметрыДанных.УстановитьЗначениеПараметра("ЭтоДокументОплата", 	 		ЭтоДокументОплаты);  
	
	НастройкиКомпоновщика.ПараметрыДанных.УстановитьЗначениеПараметра("ТекущийДокумент", 			ТекущийДокумент);  
	НастройкиКомпоновщика.ПараметрыДанных.УстановитьЗначениеПараметра("ПредставлениеДокумента", 	ПредставлениеДокумента);  
	
КонецПроцедуры
