
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеШаблона = Неопределено;
	Параметры.Свойство("Шаблон", ДанныеШаблона);   
	
	РазрешеноПрикреплятьФайлы =  XMLЗначение(Тип("Булево"), ДанныеШаблона["attachfiles"]);
	
	//Заполним доступные значения полей
	Если ДанныеШаблона = Неопределено Тогда
		Отказ = Истина;	
		Возврат;
	КонецЕсли; 
	           
	СоответствиеЗначений = Новый Соответствие;  
	
	Для Каждого КлючЗначение Из ДанныеШаблона["values"] Цикл
		ТаблицаЗначений = ПустаяТаблицаДоступныхЗначений();  
		Для Каждого СтруктураЗначения из КлючЗначение.Значение Цикл
			НоваяСтрока = ТаблицаЗначений.Добавить();  
			НоваяСтрока.id	 = СтруктураЗначения["id"];
			НоваяСтрока.name = СтруктураЗначения["name"];
		КонецЦикла;    
		
		АдресТаблицы = ПоместитьВоВременноеХранилище(ТаблицаЗначений, Новый УникальныйИдентификатор);
		СоответствиеЗначений.Вставить(КлючЗначение.Ключ, АдресТаблицы);  
	КонецЦикла;
	
	ДоступныеЗначения 	= Новый ФиксированноеСоответствие(СоответствиеЗначений); 
	
	Если XMLЗначение(Тип("Число"), ДанныеШаблона["type"]) = 0 Тогда
		ПодготовитьСтандартныйТабличныйДокумент(ДанныеШаблона["fields"], ДанныеШаблона["title"]);
	КонецЕсли;
	
	Если XMLЗначение(Тип("Число"), ДанныеШаблона["type"]) = 1 Тогда
		//Тут будет формирвоание индивидуального макета
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПустаяТаблицаДоступныхЗначений()
	
    ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("id", 		Новый ОписаниеТипов("Строка"));
	ТаблицаЗначений.Колонки.Добавить("name", 	Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаЗначений;
	
КонецФункции   

&НаСервере
Процедура ПодготовитьСтандартныйТабличныйДокумент(ДанныеМакета, ЗаголовокЗаявки)
	
	Если ПустаяСтрока(ЗаголовокЗаявки) Тогда
		ЗаголовокЗаявки = Нстр("ru='Заявка';en='Request'");     
	КонецЕсли;
	
	СтрПараметрыОбластей			= Новый Структура;
	
	ТабличныйДокумент.Очистить();
	
	Макет = Справочники.CW_ВебШаблоныЗаявок.ПолучитьМакет("МакетНовойЗаявки");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок"); 
	Область = ОбластьЗаголовок.Область("title");
	Область.Значение = ЗаголовокЗаявки; 
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);        
	
	ОбластьЗаголовокГруппы = Макет.ПолучитьОбласть("ЗаголовокГруппы");

	НомерГруппы = 1;
	
	Для Каждого ГруппаМакета из ДанныеМакета Цикл
		
		ПоказыватьГруппу = XMLЗначение(Тип("Булево"), ГруппаМакета["show"]); 
		Если ПоказыватьГруппу тогда
			
			ИсходнаяОбластьГруппы = Макет.ПолучитьОбласть("ЗаголовокГруппы"); 
			
			Область = ИсходнаяОбластьГруппы.Область("ГРУППА_1");
			Область.Имя 		= "ГРУППА_"+Формат(НомерГруппы,"ЧГ=0"); 
			
			ОформлениеГруппы 	= ГруппаМакета["decoration"];
			Область.Шрифт 		= ПолучитьОбъектИзJSON(ОформлениеГруппы["font"], Новый Шрифт);
			Область.ЦветФона 	= ПолучитьОбъектИзJSON(ОформлениеГруппы["backgroundcolor"], Новый Цвет);
			Область.ЦветТекста  = ПолучитьОбъектИзJSON(ОформлениеГруппы["textcolor"], Новый Цвет);
			
			Область.Значение 	= ГруппаМакета["name"];  
			
			ТабличныйДокумент.Вывести(ИсходнаяОбластьГруппы); 
			
			НомерГруппы = НомерГруппы + 1;    
			
		Иначе  
			
			ОбластьЗаголовокБезГруппы = Макет.ПолучитьОбласть("ЗаголовокБезГруппы"); 
			ТабличныйДокумент.Вывести(ОбластьЗаголовокБезГруппы); 
			
		КонецЕсли;   
		
		Для Каждого СтруктураПоля из ГруппаМакета["fields"] Цикл
			
			ИсходнаяОбласть = Макет.ПолучитьОбласть("Строка"); 
			
			Если ПустаяСтрока(СтруктураПоля["help"]) Тогда
				ОбластьПодсказка = ИсходнаяОбласть.Область("Подсказка");  
				ИсходнаяОбласть.УдалитьОбласть(ОбластьПодсказка, ТипСмещенияТабличногоДокумента.ПоВертикали); 
			Иначе
				ИсходнаяОбласть.Параметры.ТекстПодсказки = СтруктураПоля["help"];
			КонецЕсли;  
			
			Для Каждого Область из ИсходнаяОбласть.Области Цикл
				Если Область.Имя = "Подсказка" Тогда
					Продолжить;
				КонецЕсли;  
				
				Если  СтрНачинаетсяС(Область.Имя,"title") Тогда
					//Это заголвок
					Область.Имя 		= СтруктураПоля["titlename"];
					Область.Значение 	= СтруктураПоля["title"];   
					Если XMLЗначение(Тип("Булево"), СтруктураПоля["required"]) = Истина Тогда
						Область.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
					КонецЕсли;
				КонецЕсли;
				
				Если  СтрНачинаетсяС(Область.Имя,"П") Тогда
					//Это значение
					Область.Имя 		= СтруктураПоля["name"];   
					Область.Значение 	= СтруктураПоля["default"]["name"];
					Область.АвтоОтметкаНезаполненного = XMLЗначение(Тип("Булево"), СтруктураПоля["required"]);   
					
					ТипСтрока = Новый ОписаниеТипов("Строка");
					Область.ТипЗначения = ПолучитьОбъектИзJSON(СтруктураПоля["type"], ТипСтрока);     
					
					//Параметры области 
					ПараметрыОбласти = Новый Структура;
					ПараметрыОбласти.Вставить("Обязательно", 	XMLЗначение(Тип("Булево"), СтруктураПоля["required"]));
					ПараметрыОбласти.Вставить("ДоступенСписок", XMLЗначение(Тип("Булево"), СтруктураПоля["list"]));
					
					СтрПараметрыОбластей.Вставить(Область.Имя, ПараметрыОбласти);	
					
				КонецЕсли;  
				
			КонецЦикла;  
			
			ТабличныйДокумент.Вывести(ИсходнаяОбласть);
			
		КонецЦикла; 
		
		ОбластьПодвалГруппы = Макет.ПолучитьОбласть("ПодвалГруппы"); 
		ТабличныйДокумент.Вывести(ОбластьПодвалГруппы);
		
	КонецЦикла;  
	
	Если РазрешеноПрикреплятьФайлы Тогда
		ОбластьШапкаФайлы = Макет.ПолучитьОбласть("ШапкаФайлы"); 
		ТабличныйДокумент.Вывести(ОбластьШапкаФайлы);  
		
		ОбластьОбластьДобавитьФайл = Макет.ПолучитьОбласть("ДобавлениеФайла"); 
		ТабличныйДокумент.Вывести(ОбластьОбластьДобавитьФайл); 
	КонецЕсли;
	
	ПараметрыОбластей = Новый ФиксированнаяСтруктура(СтрПараметрыОбластей);
	
	Для Каждого ОбластьТД из ТабличныйДокумент.Области Цикл
		Если ОбластьТД.Защита <> Неопределено и Не ОбластьТД.Защита Тогда
			УстановитьЦветТекстаДляОбязательныхЯчеек(ОбластьТД.Имя);	
		КонецЕсли;  
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьОбъектИзJSON(СтрокаJSON, ПустоеЗначение)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		ОбъектСтиля = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	Исключение       
		Возврат ПустоеЗначение;	
	КонецПопытки;
	
	ЧтениеJSON.Закрыть();
	
	Возврат ОбъектСтиля;
	
КонецФункции

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Область.Имя = "ДобавитьФайл"  
		ИЛИ Область.Имя = "ДобавитьФайлКартинка" Тогда
		СтандартнаяОбработка = Ложь; 
		ПоказатьПредупреждение(,"В режиме предварительного просмотра добавление файлов недоступно!");
		Возврат;
	КонецЕсли;   
	
	Если Область.Защита Тогда
		Возврат;
	КонецЕсли;   
	
	Если НЕ ПараметрыОбластей.Свойство(Область.Имя) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОбластей[Область.Имя]["ДоступенСписок"] = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;  
	
	АдресТаблицы = ДоступныеЗначения[Область.Имя];
	Если АдресТаблицы <> Неопределено Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("АдресТаблицы", АдресТаблицы);    
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяОбласти", Область.Имя);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборЗначения", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("Справочник.CW_ВебШаблоныЗаявок.Форма.ФормаВыбораЗначения", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;    
	
	
КонецПроцедуры   

&НаКлиенте
Процедура ЗавершитьВыборЗначения(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Область = ТабличныйДокумент.Область(ДополнительныеПараметры.ИмяОбласти);
	Область.Значение = РезультатВыбора["name"];	

	Если Область.Защита <> Неопределено и  Не Область.Защита Тогда
		УстановитьЦветТекстаДляОбязательныхЯчеек(Область.Имя);	
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	
	Если Область.Защита <> Неопределено и  Не Область.Защита Тогда
		УстановитьЦветТекстаДляОбязательныхЯчеек(Область.Имя);	
	КонецЕсли;
	
КонецПроцедуры     

&НаСервере
Процедура УстановитьЦветТекстаДляОбязательныхЯчеек(ИмяОбласти)
	
	Обязательно = ПараметрыОбластей[ИмяОбласти]["Обязательно"];  
	Если Не Обязательно Тогда
		Возврат;
	КонецЕсли;
		
	ОбластьТекущая = ТабличныйДокумент.Область(ИмяОбласти);
	ОбластьИмяПоля = ТабличныйДокумент.Область("title_"+ИмяОбласти);
	
	Если ЗначениеЗаполнено(ОбластьТекущая.Значение) Тогда
		ОбластьИмяПоля.ЦветТекста = новый Цвет;    
	Иначе
		ОбластьИмяПоля.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
	КонецЕсли;
	
 КонецПроцедуры
 
 &НаСервере
Функция  ПроверитьОбязательныеПоля()
	
	Для Каждого КлючЗначение из ПараметрыОбластей Цикл
		Если НЕ КлючЗначение.Значение["Обязательно"] Тогда
			Продолжить;	
		КонецЕсли;  
		
		ОбластьТекущая = ТабличныйДокумент.Область(КлючЗначение.Ключ);
		
		Если Не ЗначениеЗаполнено(ОбластьТекущая.Значение) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
		
КонецФункции

 

