&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокВнешнийОтчетовИОбработок();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВнешнихОтчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокВнешнихОтчетов.ТекущиеДанные;
	ПродолжитьВыбор(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВнешнихОбработокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокВнешнихОбработок.ТекущиеДанные;
	ПродолжитьВыбор(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.ДеревоОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыбор(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоОбъектов.ТекущиеДанные;
	ПродолжитьВыбор(ТекущиеДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура ПродолжитьВыбор(СтрокаДерева)
	
	Если СтрокаДерева.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Если РодительСтроки.Ссылка = ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОбработки") Тогда
		
		ТестПредупреждения = "Обработка уже подключена.";
		ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка");
		
	ИначеЕсли РодительСтроки.Ссылка = ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОтчеты") Тогда
		
		ТестПредупреждения = "Отчет уже подключен.";
		ТипВнешнегоОбъекта = ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешнийОтчет");
		
	Иначе
		
		//Неизвестный тип объекта
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Имя", 				СтрокаДерева.Имя);
	ДополнительныеПараметры.Вставить("Наименование", 		СтрокаДерева.Наименование);
	ДополнительныеПараметры.Вставить("ТипВнешнегоОбъекта", 	ТипВнешнегоОбъекта);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьВыборОбъкта", ЭтотОбъект,ДополнительныеПараметры);
	Если СтрокаДерева.Подключена Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, ТестПредупреждения +" Продолжить?" , Режим, 0);	
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыборОбъкта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Ответ = Новый Структура;
	Ответ.Вставить("Имя", 					ДополнительныеПараметры.Имя);
	Ответ.Вставить("Представление", 		ДополнительныеПараметры.Наименование);
	Ответ.Вставить("ТипВнешнегоОбъекта", 	ДополнительныеПараметры.ТипВнешнегоОбъекта);
	
	ЭтаФорма.Закрыть(Ответ);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	РезультатВыполнения = НачатьФормирвоаниеСпискаДоступныхОтчетовИОбработок();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания	= Истина;
	ПараметрыОжидания.ТекстСообщения		= "Формируется список доступных отчетов и обработок...";
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьФормирвоаниеСпискаДоступныхОтчетовИОбработок()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Формирование списка доступных отчтов и обработок";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ИдентификаторыПодключаемыхОбъектов.ОбновитьСписокПодключаемыхОтчетовОбработок",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ЗаполнитьСписокВнешнийОтчетовИОбработок();                     
		
		ЭлементыДерева = ДеревоОбъектов.ПолучитьЭлементы();
		Для Каждого ЭлементДерева из ЭлементыДерева Цикл
			Элементы.ДеревоОбъектов.Развернуть(ЭлементДерева.получитьИдентификатор(), истина);
		КонецЦикла;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось получить список отчетов и обработок!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка получения списка отчетов и обработок");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВнешнийОтчетовИОбработок()
	
	тДерево = РеквизитФормыВЗначение("ДеревоОбъектов");
	тДерево.Строки.Очистить();
	
	мПодклчюенныеОбъекты = ПолучитьМассивПодключенныхОбъектов();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ИдентификаторыПодключаемыхОбъектов.Родитель КАК Родитель,
	               |	CW_ИдентификаторыПодключаемыхОбъектов.Имя КАК Имя,
	               |	CW_ИдентификаторыПодключаемыхОбъектов.Наименование КАК Наименование,
	               |	CW_ИдентификаторыПодключаемыхОбъектов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ИдентификаторыПодключаемыхОбъектов КАК CW_ИдентификаторыПодключаемыхОбъектов
	               |ГДЕ
	               |	CW_ИдентификаторыПодключаемыхОбъектов.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ИдентификаторыПодключаемыхОбъектов.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Родитель УБЫВ,
	               |	Имя
	               |ИТОГИ ПО
	               |	Родитель
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГруппы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппы.Следующий() Цикл
		
		Если ВыборкаГруппы.Родитель = ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОтчеты") Тогда
			ИндексКартинки = 1;
		ИначеЕсли ВыборкаГруппы.Родитель = ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОбработки") Тогда
			ИндексКартинки = 2;
		КонецЕсли;
		
		СтрокаГруппа = тДерево.Строки.Добавить();
		СтрокаГруппа.Наименование  	= Строка(ВыборкаГруппы.Родитель);
		СтрокаГруппа.Ссылка 		= ВыборкаГруппы.Родитель;
		СтрокаГруппа.ЭтоГруппа 		= Истина;
		
		ВыборкаДетали = ВыборкаГруппы.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			
			Подключена = мПодклчюенныеОбъекты.Найти(ВыборкаДетали.Имя) <> Неопределено;
			
			//Не подключенные(0), Подключенные(1), Все(2)    	     
			Если (ВариантОтбора = 0 и Подключена) 
				ИЛИ (ВариантОтбора = 1  и Не Подключена) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДерева = СтрокаГруппа.Строки.Добавить();
			СтрокаДерева.Наименование  	= ВыборкаДетали.Наименование;
			СтрокаДерева.Имя  			= ВыборкаДетали.Имя;
			СтрокаДерева.ЭтоГруппа 		= Ложь;
			СтрокаДерева.Подключена 	= Подключена;
			СтрокаДерева.Ссылка 		= ВыборкаДетали.Ссылка;
			СтрокаДерева.ИндексКартинки = ИндексКартинки;
			
		КонецЦикла;
		
	КонецЦикла;

	ЗначениеВРеквизитФормы(тДерево, "ДеревоОбъектов");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивПодключенныхОбъектов()
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ПодключаемыеОбъекты.ИмяВстроеннойОбработки КАК ИмяВстроеннойОбработки
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	               |ГДЕ
	               |	CW_ПодключаемыеОбъекты.Встроенная = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ИмяВстроеннойОбработки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВариантОтбораПриИзменении(Элемент)
	
	ТекущаяСсылка =ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.ПустаяСсылка");
	
	ТекущиеДанные = Элементы.ДеревоОбъектов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущаяСсылка = ТекущиеДанные.Ссылка;
	КонецЕсли;
	ЗаполнитьСписокВнешнийОтчетовИОбработок();
	
	Если НЕ ТекущаяСсылка.Пустая() Тогда
		ИдентифкаторСтроки = ПолучитьИдентифкаторТекущейСтроки(ТекущаяСсылка);
		Если ИдентифкаторСтроки <> Неопределено Тогда
			Элементы.ДеревоОбъектов.ТекущаяСтрока = ИдентифкаторСтроки;
		КонецЕсли;
	КонецЕсли;
	
	СтрокиГруппы = ДеревоОбъектов.ПолучитьЭлементы();
	Для Каждого СтрокаГруппа из СтрокиГруппы Цикл
		Идентификатор = СтрокаГруппа.ПолучитьИдентификатор();
		Элементы.ДеревоОбъектов.Развернуть(Идентификатор);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдентифкаторТекущейСтроки(ТекущаяСсылка)
	
	СтрокиДерева = ДеревоОбъектов.ПолучитьЭлементы();
	Для Каждого ГруппаТекущая из СтрокиДерева Цикл
		
		Если ГруппаТекущая.Ссылка = ТекущаяСсылка Тогда
			Возврат ГруппаТекущая.ПолучитьИдентификатор();
		КонецЕсли;
		
		СтрокиГруппы = ГруппаТекущая.ПолучитьЭлементы();
		Для Каждого СтрокаТекущая из СтрокиГруппы Цикл
			Если СтрокаТекущая.Ссылка = ТекущаяСсылка Тогда
				Возврат СтрокаТекущая.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции




	
