
&После("ОбработкаПроведения")
Процедура VMS_ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого Строка Из ЭтотОбъект.РасшифровкаПлатежа Цикл
		СчетПоиска = Строка.СчетНаОплату;
		КурсУстановки = Строка.КурсВзаиморасчетов;
		КратностьУстановки = Строка.КратностьВзаиморасчетов;
		
		Если НЕ ЗначениеЗаполнено(СчетПоиска) Тогда
			Продолжить;
		КонецЕсли;
		
		РасходПоГрПеревозке = НайтиДокументПоСчету(СчетПоиска);
		Если РасходПоГрПеревозке <> Неопределено Тогда
			РасходПоГрПеревозкеОбъект = РасходПоГрПеревозке.ПолучитьОбъект();
			РасходПоГрПеревозкеОбъект.УЕ_Курс = КурсУстановки;
			РасходПоГрПеревозкеОбъект.УЕ_Кратность = КратностьУстановки;
			РасходПоГрПеревозкеОбъект.УЕ_ПользовательскийКурс = Истина;
			РасходПоГрПеревозкеОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиДокументПоСчету(Счет)
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;

	//Установка значений параметров
	Запрос.УстановитьПараметр("Счет", Счет);
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_РасходыПоГрузоперевозке.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.CW_РасходыПоГрузоперевозке КАК CW_РасходыПоГрузоперевозке
	|ГДЕ
	|	CW_РасходыПоГрузоперевозке.ВедомыйСчет = &Счет";

	Результат = Запрос.Выполнить(); 
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

