#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьСостояниеОбъекта(ОбъектСогласования, Состояние) Экспорт
	
	Запись = РегистрыСведений.CW_СостояниеСогласованияОбъекта.СоздатьМенеджерЗаписи();
	Запись.ОбъектСогласования = ОбъектСогласования;
	Запись.Прочитать();
	
	Запись.ОбъектСогласования = ОбъектСогласования;
	Запись.Состояние = Состояние;
	Запись.Записать();

КонецПроцедуры

Функция ПолучитьСостояниеОбъекта(ОбъектСогласования) Экспорт

	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СостояниеСогласованияОбъекта.ОбъектСогласования КАК ОбъектСогласования,
	               |	CW_СостояниеСогласованияОбъекта.Состояние КАК Состояние
	               |ИЗ
	               |	РегистрСведений.CW_СостояниеСогласованияОбъекта КАК CW_СостояниеСогласованияОбъекта
	               |ГДЕ
	               |	CW_СостояниеСогласованияОбъекта.ОбъектСогласования = &ОбъектСогласования";
	
	Запрос.УстановитьПараметр("ОбъектСогласования",ОбъектСогласования);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Состояние;
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции

#КонецЕсли