
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДатаПроверки") Тогда
		ДатаПроверки = Параметры.ДатаПроверки;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаПроверки) Тогда
		ДатаПроверки = ТекущаяДата();
	КонецЕсли;
	
	УстановитьОтборДинамическогоСписка();

КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборДинамическогоСписка()
	
	ДатаСреза = ?(ЗначениеЗаполнено(ДатаПроверки), ДатаПроверки, ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("ДатаСреза", КонецДня(ДатаСреза));
	
	Список.Отбор.Элементы.Очистить();
	
	//Актуальные(0), Не актуальные(1), Все(2)
	ГруппаИ = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИ.ТипГруппы		= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаИ.Использование 	= Истина;
	
	НовыйЭлементОтбора = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НачалоСлежения");
	НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	НовыйЭлементОтбора.ПравоеЗначение 	= ДатаПроверки;
	НовыйЭлементОтбора.Использование	= Истина;
	
	ГруппаИЛИ = ГруппаИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИЛИ.ТипГруппы		= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
	ГруппаИЛИ.Использование = Истина;
	
	НовыйЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОкончаниеСлежения");
	НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	НовыйЭлементОтбора.ПравоеЗначение 	= ДатаПроверки;
	НовыйЭлементОтбора.Использование 	= Истина;
	
	НовыйЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОкончаниеСлежения");
	НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение 	= Дата(1,1,1);
	НовыйЭлементОтбора.Использование 	= Истина;
	
	

КонецПроцедуры

