#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ВРег(МетаданныеОтчета.Синоним));
	
	// Установим параметры
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Период", КонецДня(Настройки.НаДату));
	
	// формируем по показателям
	Для Каждого Поле Из НастройкиСКД.Выбор.Элементы Цикл
		Если Найти(Строка(Поле.Поле), "Сумма") <> 0 Тогда
			Поле.Использование = Настройки.ПокСумма;
		ИначеЕсли Найти(Строка(Поле.Поле), "НДС") <> 0 Тогда
			Поле.Использование = Настройки.ПокНДС;
		ИначеЕсли Найти(Строка(Поле.Поле), "Всего") <> 0 Тогда
			Поле.Использование = Настройки.ПокВсего;
		КонецЕсли;					
	КонецЦикла;	
	
	// формируем структуру отчета по группировкам
	НастройкиСКД.Структура.Очистить();
	ТекущийРодитель = НастройкиСКД.Структура;
	Для каждого Группировка Из Настройки.Группировки Цикл
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		ПолеГруппировки.Использование = Истина;
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование=Истина;
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		НС = ?(Группировка.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию, НаправлениеСортировкиКомпоновкиДанных.Возр, НаправлениеСортировкиКомпоновкиДанных.Убыв);
		ЭлементПорядка.ТипУпорядочивания = НС;
		ЭлементПорядка.Использование = Истина;
		НоваяГруппировка.Имя = Группировка.Представление;
		НоваяГруппировка.Использование = Истина;
		ТекущийРодитель = НоваяГруппировка.Структура;
	КонецЦикла; 
	//НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	//ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	//ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ДокументВзаиморасчетов");
	//ПолеГруппировки.Использование = Истина;
	//НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	//НовоеАвтоПолеВыбора.Использование=Истина;
	//ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	//ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ДокументВзаиморасчетов");
	//ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	//ЭлементПорядка.Использование = Истина;
	//НоваяГруппировка.Имя = "Документ взаиморасчетов";
	//НоваяГруппировка.Использование = Истина;
	//ТекущийРодитель = НоваяГруппировка.Структура;
		
КонецПроцедуры

#КонецЕсли