Функция ПолучитьСписокКартинок() Экспорт
	
	Список = Новый СписокЗначений;
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_СтандартныеПодсистемы.CW_БиблиотекаКартинок") Тогда   
		Для каждого МетаданныеКартинка Из Метаданные.ОбщиеКартинки Цикл   
			Если Метаданные.Подсистемы.CW_СтандартныеПодсистемы.Подсистемы.CW_БиблиотекаКартинок.Состав.Содержит(МетаданныеКартинка) Тогда   
				Картинка =  БиблиотекаКартинок[МетаданныеКартинка.Имя];
				Список.Добавить(МетаданныеКартинка.Имя, МетаданныеКартинка.Синоним, Ложь, Картинка);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;

	Возврат Список;
	
КонецФункции