#Область ПрограммныйИнтерфейс

// Открывает печатную форму Уведомления о переходе на УСН с НПД
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//
Процедура УведомлениеОПереходенНаУСН(Форма) Экспорт
	
	УведомлениеОПереходеНаУСН = Форма.УведомлениеОПереходеНаУСН;
	
	Если Не ЗначениеЗаполнено(УведомлениеОПереходеНаУСН) Тогда
		// Не требуется
		Возврат;
	КонецЕсли;
	
	РегистрацияОрганизацииКлиент.ОткрытьПечатнуюФормуУведомленияОПереходеНаУСН(Форма, УведомлениеОПереходеНаУСН);
	
КонецПроцедуры

// Вызывает исключение при возникновении ошибки при формировании заявления о переходе на УСН с НПД
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//
Процедура ПоказатьОшибкуФормированияЗаявления(КраткоеПредставлениеОшибки) Экспорт
	
	СтрокиОшибки = Новый Массив;
	СтрокиОшибки.Добавить(НСтр("ru = 'Ошибка при формировании заявления о переходе на УСН с НПД:'"));
	СтрокиОшибки.Добавить(КраткоеПредставлениеОшибки);
	
	ВызватьИсключение СтрСоединить(СтрокиОшибки, Символы.ПС);
	
КонецПроцедуры

#КонецОбласти