&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_ЗагрузитьСеансовыеНастройки();
	_НастройкаСписка();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	_СохранитьСеансовыеНастройки();
	
КонецПроцедуры

&НаСервере
Функция _СохранитьСеансовыеНастройки()
	// --- 
	
	СтруктураНастроекФормы = Новый Структура;
	СтруктураНастроекФормы.Вставить("ТолькоНовые",ТолькоНовые);
	
	ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы,"ПоследняяНастройка",СтруктураНастроекФормы,,ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);	
	
	// --- 
КонецФункции

&НаСервере
Функция _ЗагрузитьСеансовыеНастройки()
	// --- 
	
	ПоследняяНастройка = ХранилищеСистемныхНастроек.Загрузить(ЭтаФорма.ИмяФормы,"ПоследняяНастройка",,ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);	
	Если ПоследняяНастройка <> Неопределено Тогда
		
		ТолькоНовые = ПоследняяНастройка.ТолькоНовые;
		
	КонецЕсли; 
	
	
	// --- 
КонецФункции
 
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТолькоНовые(Команда)
	
	ТолькоНовые = НЕ ТолькоНовые;
	_НастройкаСписка();
	
КонецПроцедуры

&НаСервере
Процедура _НастройкаСписка()
	// --- 
	
	Элементы.ФормаТолькоНовые.Пометка = ТолькоНовые;
		
	Если ТолькоНовые Тогда
		
		ОДС = _УФС.ДобавитьОтбор(Список.Отбор,"СтатусОбработки",,Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.ОшибкаОбработки);
		ИдентификаторОтбора = ПоместитьВоВременноеХранилище(Список.Отбор.ПолучитьИдентификаторПоОбъекту(ОДС),УникальныйИдентификатор);
		
	Иначе
		
		Если ИдентификаторОтбора <> "" Тогда
			
			Список.Отбор.Элементы.Удалить(Список.Отбор.ПолучитьОбъектПоИдентификатору(ПолучитьИзВременногоХранилища(ИдентификаторОтбора)));
			
		КонецЕсли; 
				
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура УстановитьСтатус(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораСтатуса",ЭтотОбъект); 
	ПолучитьСписокСтатусов().ПоказатьВыборЭлемента(ПОВ,"Новый статус");;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСтатуса(Результат, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Результат <> Неопределено Тогда
		
		МассивЭлементов = Новый Массив;
		Для каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл
			
			МассивЭлементов.Добавить(Стр);
			
		КонецЦикла; 
		
		_УстановитьСтатус(МассивЭлементов,Результат.Значение);
		Элементы.Список.Обновить();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервереБезКонтекста
Функция ПолучитьСписокСтатусов()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.ПустаяСсылка(),"<без статуса>");
	СписокВыбора.Добавить(Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.ОшибкаОбработки,"Ошибка обработки");
	СписокВыбора.Добавить(Перечисления.CW_СтатусыОбработкиПочтовыхСообщений.Завершено,"Завершено");
	
	Возврат(СписокВыбора);
	
КонецФункции
 

&НаСервере
Процедура _УстановитьСтатус(МассивЭлементов,Статус)
	// --- 
	
	Для каждого Стр Из МассивЭлементов Цикл
		
		Письмо = Стр.ПолучитьОбъект();
		Письмо.СтатусОбработки = Статус;
		Письмо.Записать();
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти 
 
 