
&НаКлиенте
Функция сбисСоздатьМенеджерКриптографии(Кэш) Экспорт
	
	ОписанияПрограмм = сбисОписанияПрограмм(Кэш);
	
	Менеджер = Неопределено;
	Для Каждого СвойстваПрограммы Из ОписанияПрограмм Цикл
		
		Попытка
			ИнформацияМодуля = СредстваКриптографии.ПолучитьИнформациюМодуляКриптографии(
				СвойстваПрограммы.ИмяПрограммы,
				СвойстваПрограммы.ПутьКПрограмме,
				СвойстваПрограммы.ТипПрограммы);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если ИнформацияМодуля = Неопределено Тогда
			Менеджер = Неопределено;
			Продолжить;
		КонецЕсли;
		
		Попытка
			Если Кэш.ОбщиеФункции.ЭтоНоваяВерсия(Кэш.ПараметрыСистемы.Клиент.ВерсияПриложения, "8.3.13.0") Тогда
				Менеджер = Вычислить("Новый МенеджерКриптографии(СвойстваПрограммы.ИмяПрограммы, СвойстваПрограммы.ПутьКПрограмме, СвойстваПрограммы.ТипПрограммы,ИспользованиеИнтерактивногоРежимаКриптографииИспользовать())");
			Иначе
				Менеджер = Вычислить("Новый МенеджерКриптографии(СвойстваПрограммы.ИмяПрограммы, СвойстваПрограммы.ПутьКПрограмме, СвойстваПрограммы.ТипПрограммы)");
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;

		
		Прервать; // Требуемый менеджер криптографии получен.
	КонецЦикла;
	Если Менеджер = Неопределено Тогда
		ВызватьИсключение("Не удалось создать менеджер криптографии. Возможно неверно указаны настройки криптографии.");		
	КонецЕсли;
	Кэш.Вставить("МенеджерКриптографии", Менеджер);
	Возврат Менеджер;
	
КонецФункции
&НаКлиенте
Функция сбисОписанияПрограмм(Кэш) Экспорт
	
	Если Кэш.Ини.Свойство("Конфигурация") и Не ЗначениеЗаполнено(Кэш.Парам.НастройкиКриптографии.ИмяПрограммы) Тогда
		ОписанияПрограмм = сбисПолучитьНастройкиКриптографии(Кэш);
	Иначе
		ОписанияПрограмм = Новый Массив;
		СвойстваПрограммы = Новый Структура("ИмяПрограммы,ПутьКПрограмме,ТипПрограммы", Кэш.Парам.НастройкиКриптографии.ИмяПрограммы,Кэш.Парам.НастройкиКриптографии.ПутьКПрограмме,Кэш.Парам.НастройкиКриптографии.ТипПрограммы);
		ОписанияПрограмм.Добавить(СвойстваПрограммы);
	КонецЕсли;
	Возврат ОписанияПрограмм;
КонецФункции

&НаКлиенте
Функция сбисПолучитьНастройкиКриптографии(Кэш) Экспорт
	Контекст = Новый Структура("Документ, СтрТабл, Ини",,);
	Контекст.Ини = Новый Структура;
	Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.Ини, Кэш.Ини.Конфигурация.мПрограммыЭП);
	
	СписокДопустимыхТипов = Кэш.ОбщиеФункции.СписокДопустимыхТипов();
	НастройкиЭП = Кэш.ОбщиеФункции.ПолучитьДанныеДокумента1С(Кэш.Ини.Конфигурация.мПрограммыЭП, Неопределено, Новый Структура, Кэш.Парам);
    Возврат НастройкиЭП.ПрограммыЭП;
КонецФункции
&НаКлиенте
Функция ИспользованиеИнтерактивногоРежимаКриптографииИспользовать()
	
	Возврат Вычислить("ИспользованиеИнтерактивногоРежимаКриптографии.Использовать");
	
КонецФункции  
     
&НаКлиенте
Функция сбисСписокСертификатовДляАвторизации(Кэш, ТекстОшибки) Экспорт
	СертификатыДляАвторизации = Новый Массив();
	Если Не Кэш.Свойство("МенеджерКриптографии") Тогда
		Попытка
			сбисСоздатьМенеджерКриптографии(Кэш);
		Исключение    
			ТекстОшибки = ИнформацияОбОшибке().Описание;
			Возврат СертификатыДляАвторизации;
		КонецПопытки;
	КонецЕсли;
	Попытка
		ХранилищеСертификатовКриптографии = Кэш.МенеджерКриптографии.ПолучитьХранилищеСертификатов();
		Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе(); 
		Для Каждого Серт из Сертификаты Цикл
			Попытка
				СертДвоичныеДанные = СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()),Символы.ПС,""),Символы.ВК,"");
				СертОтпечаток = СтрЗаменить(Строка(Серт.Отпечаток), " ", "");
				СертификатыДляАвторизации.Добавить(Новый Структура("ДвоичныеДанные,Отпечаток,Название,ФИО,Должность,ДействителенПо",СертДвоичныеДанные, СертОтпечаток,Серт.Субъект.CN, Серт.Субъект.SN+" "+Серт.Субъект.GN,Серт.Субъект.T,Серт.ДатаОкончания));
			Исключение
			КонецПопытки;
		КонецЦикла;
	Исключение
		ТекстОшибки = ИнформацияОбОшибке().Описание;
		Возврат СертификатыДляАвторизации;
	КонецПопытки;
	Возврат СертификатыДляАвторизации;

КонецФункции

&НаКлиенте
Функция сбисДвоичныеДанныеСертификатаПоОтпечатку(Кэш, Отпечаток) Экспорт
	Если Не Кэш.Свойство("МенеджерКриптографии") Тогда
		Попытка
			сбисСоздатьМенеджерКриптографии(Кэш);
		Исключение    
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	Попытка
		ХранилищеСертификатовКриптографии = Кэш.МенеджерКриптографии.ПолучитьХранилищеСертификатов();
		Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе(); 
		Для Каждого Серт из Сертификаты Цикл
			Если СтрЗаменить(Строка(Серт.Отпечаток), " ", "") = Отпечаток Тогда
				Возврат СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()),Символы.ПС,""),Символы.ВК,"");
			КонецЕсли;
		КонецЦикла;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Ложь;
КонецФункции  
&НаКлиенте
Функция сбисВыбратьПодходящийСертификат(Кэш, СертификатыДок, ТекстОшибки) Экспорт
	Результат = Новый Структура();
	Если Не Кэш.Свойство("МенеджерКриптографии") Тогда
		Попытка
			сбисСоздатьМенеджерКриптографии(Кэш);
		Исключение    
			ТекстОшибки = ИнформацияОбОшибке().Описание;
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	Попытка
		ХранилищеСертификатовКриптографии = Кэш.МенеджерКриптографии.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
		Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе();
	Исключение
		ТекстОшибки = ИнформацияОбОшибке().Описание;
	КонецПопытки;
	Для Каждого СертДок Из СертификатыДок Цикл
		Если СертДок.Ключ.Тип = "Отложенный" Тогда
			Результат.Вставить("СертификатДляПодписания", Неопределено);
			Результат.Вставить("СертификатДок", СертДок);
			Возврат Результат;
		ИначеЕсли СертДок.Ключ.Тип = "Клиентский" Тогда
			Для Каждого Серт из Сертификаты Цикл
				СертОтпечаток = СтрЗаменить(Строка(Серт.Отпечаток), " ", "");
				Если  СертОтпечаток = СертДок.Отпечаток Тогда
                    Результат.Вставить("СертификатДляПодписания", Base64Строка(Серт.Выгрузить()));
					Результат.Вставить("СертификатДок", СертДок);
					Возврат Результат;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции

&НаКлиенте
Функция сбисПодписатьФайл(Кэш, ПолноеИмяФайла, Сертификат, ТекстОшибки) Экспорт
	Если Не Кэш.Свойство("МенеджерКриптографии") Тогда
		Попытка
			сбисСоздатьМенеджерКриптографии(Кэш);
		Исключение    
			ТекстОшибки = ИнформацияОбОшибке().Описание;
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	Попытка
		Серт = Новый СертификатКриптографии(Base64Значение(Сертификат));
		Подпись = Кэш.МенеджерКриптографии.Подписать(ПолноеИмяФайла, Серт);
	Исключение
		ТекстОшибки = ИнформацияОбОшибке().Описание;
		Возврат Ложь;
	КонецПопытки;
	Возврат СтрЗаменить(СтрЗаменить(Base64Строка(Подпись),Символы.ПС,""),Символы.ВК,"");
КонецФункции

&НаКлиенте
Функция сбисПодписатьДвоичныеДанные(Кэш, ДвоичныеДанные, Сертификат, ТекстОшибки) Экспорт
	Если Не Кэш.Свойство("МенеджерКриптографии") Тогда
		Попытка
			сбисСоздатьМенеджерКриптографии(Кэш);
		Исключение    
			ТекстОшибки = ИнформацияОбОшибке().Описание;
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	Попытка
		Серт = Новый СертификатКриптографии(Base64Значение(Сертификат));
		Подпись = Кэш.МенеджерКриптографии.Подписать(Base64Значение(ДвоичныеДанные), Серт);
	Исключение
		ТекстОшибки = ИнформацияОбОшибке().Описание;
		Возврат Ложь;
	КонецПопытки;
	Возврат СтрЗаменить(СтрЗаменить(Base64Строка(Подпись),Символы.ПС,""),Символы.ВК,"");
КонецФункции

&НаКлиенте
Функция сбисРасшифровать(Кэш, ДвоичныеДанные, ПолноеИмяФайла) Экспорт
	Если Не Кэш.Свойство("МенеджерКриптографии") Тогда
		Менеджер = сбисСоздатьМенеджерКриптографии(Кэш);
	КонецЕсли;
	Кэш.МенеджерКриптографии.Расшифровать(ДвоичныеДанные, ПолноеИмяФайла);
КонецФункции 
