
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ПредставлениеДокумента");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.ПредставлениеДокумента) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.ПредставлениеДокумента;             
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаДокумента"
		И ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ЗначенияЗаполнения");
	
	ВидОперации = Неопределено; 

	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "ВидОперации");
	КонецЕсли;

	// Если документ копируется, то вид формы получаем из копируемого документа.
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		Если Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Параметры.ЗначениеКопирования, "ВидОперации");
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначенияЗаполнения, "ВидОперации");
	КонецЕсли; 

	СтандартнаяОбработка = Ложь;
	
	ФормыКорректировкиОперативнойЗадолженност = ПолучитьСоответствиеВидовОперацийФормам();
	ВыбраннаяФорма = ФормыКорректировкиОперативнойЗадолженност[ВидОперации];
	Если ВыбраннаяФорма = Неопределено Тогда
		ВыбраннаяФорма = "ФормаДокумента";
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСоответствиеВидовОперацийФормам() Экспорт	
	
	ВсеВидыОпераций = Перечисления.CW_ВидыОперацийКорректировкиОперативнойЗадолженности;
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ВсеВидыОпераций.ЗачетЗадолженности, 		"ФормаЗачетЗадолженности");
	Соответствие.Вставить(ВсеВидыОпераций.СписаниеЗадолженности, 	"ФормаСписаниеЗадолженности");
	Соответствие.Вставить(ВсеВидыОпераций.ПереносЗадолженности, 	"ФормаПереносЗадолженности");

	Возврат Соответствие;
	
КонецФункции

Процедура ОбработатьДокументы() Экспорт

	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_КорректировкаОперативнойЗадолженности.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Документы
	               |ИЗ
	               |	Документ.CW_КорректировкаОперативнойЗадолженности КАК CW_КорректировкаОперативнойЗадолженности
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Регистратор КАК Регистратор,
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Счет КАК Счет,
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Валюта КАК Валюта,
	               |	CW_ОперативнаяДебиторскаяЗадолженность.СчетУчета КАК СчетУчета,
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Всего_Валюта КАК СуммаВал,
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Всего КАК Сумма
	               |ПОМЕСТИТЬ ВТ_Двдижения
	               |ИЗ
	               |	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность КАК CW_ОперативнаяДебиторскаяЗадолженность
	               |ГДЕ
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Регистратор В
	               |			(ВЫБРАТЬ
	               |				ВТ_Документы.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_Документы КАК ВТ_Документы)
	               |	И CW_ОперативнаяДебиторскаяЗадолженность.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.КурсоваяРазница)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Регистратор,
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Счет,
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Валюта,
	               |	CW_ОперативнаяКредиторскаяЗадолженность.СчетУчета,
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Всего_Валюта,
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Всего
	               |ИЗ
	               |	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность КАК CW_ОперативнаяКредиторскаяЗадолженность
	               |ГДЕ
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Регистратор В
	               |			(ВЫБРАТЬ
	               |				ВТ_Документы.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_Документы КАК ВТ_Документы)
	               |	И CW_ОперативнаяКредиторскаяЗадолженность.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.КурсоваяРазница)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Двдижения.Регистратор КАК Регистратор,
	               |	ВТ_Двдижения.Счет КАК Счет,
	               |	ВТ_Двдижения.Счет.Дата КАК СчетДата,
	               |	ВТ_Двдижения.Валюта КАК Валюта,
	               |	ВТ_Двдижения.СчетУчета КАК СчетУчета,
	               |	ВТ_Двдижения.СуммаВал КАК СуммаВал,
	               |	ВТ_Двдижения.Сумма КАК Сумма
	               |ИЗ
	               |	ВТ_Двдижения КАК ВТ_Двдижения
	               |ИТОГИ ПО
	               |	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРегистратор.Следующий() Цикл
		
		РегистраторОбъект = ВыборкаРегистратор.Регистратор.ПолучитьОбъект(); 
		
		// пропускаем битые ссылки
		Если РегистраторОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаДвижения = ВыборкаРегистратор.Выбрать();
		Пока ВыборкаДвижения.Следующий() Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ДокументСчет", 		ВыборкаДвижения.Счет);
			Отбор.Вставить("СчетЗадолженности", ВыборкаДвижения.СчетУчета);
			
			мСтрокиТаблицы = РегистраторОбъект.СписаниеОперативнойЗадолженности.НайтиСтроки(Отбор);   
			ЗаполнитьДанныеСтрок(мСтрокиТаблицы, РегистраторОбъект, ВыборкаДвижения, ВалютаРегламентированногоУчета);
			
			мСтрокиТаблицы = РегистраторОбъект.ДебиторскаяЗадолженность.НайтиСтроки(Отбор);
			ЗаполнитьДанныеСтрок(мСтрокиТаблицы, РегистраторОбъект, ВыборкаДвижения, ВалютаРегламентированногоУчета);
			
			мСтрокиТаблицы = РегистраторОбъект.КредиторскаяЗадолженность.НайтиСтроки(Отбор);
			ЗаполнитьДанныеСтрок(мСтрокиТаблицы, РегистраторОбъект, ВыборкаДвижения, ВалютаРегламентированногоУчета);
			
		КонецЦикла;
		
		РегистраторОбъект.ОбменДанными.Загрузка = Истина;
		РегистраторОбъект.ДополнительныеСвойства.Вставить("ОтключитьЛогикуПроведения", Истина);
		РегистраторОбъект.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьДанныеСтрок(мСтрокиТаблицы, Знач РегистраторОбъект, Знач ВыборкаДвижения, Знач ВалютаРегламентированногоУчета)
	
	Для Каждого СтрокаТаблицы из мСтрокиТаблицы Цикл 
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Валюта) Тогда
			Продолжить;
		КонецЕсли;
		
		КурсПоСтроке 		= 1; 
		КратностьПоСтроке 	= 1;   
		
		Если ВыборкаДвижения.Валюта <> ВалютаРегламентированногоУчета Тогда
			
			КурсПоСтроке = ?(ВыборкаДвижения.СуммаВал = 0, 1, Окр(ВыборкаДвижения.Сумма / ВыборкаДвижения.СуммаВал, 4));
			
			ДатаКурса = РегистраторОбъект.Дата;
			Если ЗначениеЗаполнено(ВыборкаДвижения.Счет) тогда
				ДатаКурса = ВыборкаДвижения.СчетДата;
			КонецЕсли;   
			ДанныеКурса = CW_Финансы.ПолучитьКурсВалюты(ВыборкаДвижения.Валюта, ДатаКурса);
			
			КратностьПоСтроке 	= ?(ДанныеКурса.Кратность=0, 1, ДанныеКурса.Кратность);  
			КурсПоСтроке		= Окр(КурсПоСтроке * КратностьПоСтроке, 4);   
			
		КонецЕсли;
		
		СтрокаТаблицы.Валюта	= ВыборкаДвижения.Валюта; 
		СтрокаТаблицы.Курс 		= КурсПоСтроке;
		СтрокаТаблицы.Кратность	= КратностьПоСтроке;
		СтрокаТаблицы.Сумма		= ВыборкаДвижения.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

