&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)       
	
	ИспользуетсяПрогнозированиеДДСПоБюджету = ПолучитьФункциональнуюОпцию("CW_ИспользуетсяПрогнозированиеДДСПоБюджету");
	
	ПолныеПрава = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь, Истина);
	Если НЕ ПолныеПрава Тогда
		ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
		Если ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы ИЛИ 
			ГруппаПользователя.ПолныеПрава 
			Тогда
			ПолныеПрава = Истина;
		КонецЕсли;
	КонецЕсли;
	
	РольФинансовогоКонтролера 	= CW_ПраваДоступа.ПравоДоступно("РольФинансовогоКонтролера");
	
	Элементы.ВидОперацииПлатежногоПоручения.Видимость  	= Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход");
	Элементы.СтавкаНДС.Видимость  						= Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход");
	Элементы.СуммаНДС.Видимость  						= Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход");

	Элементы.ГруппаПланОплатыБлокировка.ТолькоПросмотр = НЕ РольФинансовогоКонтролера;
	
	Если ПолныеПрава Тогда
		мДоступныеСтатьиПланирования = CW_ПланированиеДДС.ПолучитьвсеСтатьиДДС(Объект.ВидДвижения);
	Иначе
		мДоступныеСтатьиПланирования = CW_ПланированиеДДС.ИспользованиеСтатейДДС(ГруппаПользователя,Объект.ВидДвижения);
	КонецЕсли;
	
	СписокДоступныхСтатей.ЗагрузитьЗначения(мДоступныеСтатьиПланирования);
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата		= ТекущаяДата();	
		Объект.Автор	= ПараметрыСеанса.ТекущийПользователь;	
		Если Не ЗначениеЗаполнено(Объект.Офис) Тогда
			Объект.Офис	= CW_ПланированиеДДС.ПолучитьОфис(ПараметрыСеанса.ТекущийПользователь);	
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступныеТипыДокументаОснования();

	ПолучитьСтатусОбъекта();
	
	РеестрПлатежей = КритерииОтбора.CW_СтатьиПланированияПоРеестрам.ПолучитьРеестрПлатежей(Объект.Ссылка);
	
	Если НЕ РеестрПлатежей.Пустая() Тогда
		ТолькоПросмотр = Истина;
		Элементы.ЗаполнитьОснованиеОплаты.Доступность	= Ложь;
		Элементы.ЗаполнитьСрокОплаты.Доступность		= Ложь;
	КонецЕсли; 
	
	Элементы.НадписьРеестрПлатежей.Заголовок = Строка(РеестрПлатежей); 
	Элементы.НадписьРеестрПлатежей.Видимость = Не РольФинансовогоКонтролера и НЕ РеестрПлатежей.Пустая();
	Элементы.РеестрПлатежей.Видимость 		 = РольФинансовогоКонтролера и НЕ РеестрПлатежей.Пустая();
	Элементы.РасчетныйСчетКонтрагента.Видимость = ?(Объект.ВидДвижения = Перечисления.CW_ВидыДвиженияДДС.Расход, Истина,Ложь);
	
	ДанныеДоговора = CW_ПланированиеДДССервер.ПолучитьДанныеДоговора(Объект.Договор);
	ВалютаДоговора				= ДанныеДоговора.ВалютаДоговора;
	СтрВалютаДоговора 			= Строка(ДанныеДоговора.ВалютаДоговора)+ ?(ДанныеДоговора.РасчетыВУсловныхЕдиницах, " (у.е.)", ""); 
	
	ТекущаяДатаДокумента = Объект.Дата;
	ТекущаяОрганизация = Объект.Организация;
	
	Если ЗначениеЗаполнено(Объект.Организация) 
		И ЗначениеЗаполнено(Объект.ДокументОснование) 
		И (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") 
		ИЛИ ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
		
		ЗаполнитьПараметрыПланированияНаСервере();
		
	КонецЕсли;    
	
	ВидОперацииПлатежногоПорученияПриИзмененииНаСервере();

	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП
	
	УстановитьВидимостьКнопкиЗаполнитьСодержание();
	ВариантЗаполненияРасшифровкиПриИзмененииНаСервере();
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	//Подсистема.СтатусыДокументов

	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров   
	
	//Подсистема.ДополнительныеРеквизиты
	ИспользоватьДопРеквизиты = CW_ДополнительныеРеквизитыСлужебный.ИспользуютсяДополниительныеРеквизиты();
	//Подсистема.ДополнительныеРеквизиты
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ПроизвольныйОбъект", НЕ ИспользоватьДопРеквизиты); 
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопкиЗаполнитьСодержание()
	
	Если ПараметрыПланирования <> Неопределено Тогда
		Элементы.ЗаполнитьСодержание.Видимость = Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход") 
				И ПараметрыПланирования.ИспользоватьАвтоматическоеПланирование 
				И ЗначениеЗаполнено(Объект.ДокументОснование)
				И (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") 
				ИЛИ ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПланированияНаСервере()
	
	Если Объект.ДокументОснование <> Неопределено Тогда
		
		ИмяРеквизита = "Дата";
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаСчета", Объект.ДокументОснование.Метаданные()) Тогда
			ИмяРеквизита = "ДатаСчета";
		КонецЕсли;
		
		ПараметрыПланирования = РегистрыСведений.CW_ПараметрыПланированияДДС.ПолучитьПараметрыПланирования(Объект.Организация, Объект.ДокументОснование[ИмяРеквизита]);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокФормы();

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	Если Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Приход") Тогда
		Элементы.ГруппаКонтрагент.Заголовок = "Плательщик средств";
		Элементы.ГруппаШапка.Заголовок = "План поступления";
		Заголовок = "План поступления" + ?(Объект.Ссылка.Пустая(), " (Создание)","");
	Иначе
		Элементы.ГруппаКонтрагент.Заголовок = "Получатель средств";
		Элементы.ГруппаШапка.Заголовок = "Заявка на расход";
		Заголовок = "Заявка на расход"+ ?(Объект.Ссылка.Пустая(), " (Создание)","");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДанныеДоговора = ПолучитьДанныеДоговора(Объект.Договор);
	
	ВалютаДоговора				= ДанныеДоговора.ВалютаДоговора;
	СтрВалютаДоговора 			= Строка(ДанныеДоговора.ВалютаДоговора)+ ?(ДанныеДоговора.РасчетыВУсловныхЕдиницах, " (у.е.)", ""); 
	
	Объект.Валюта = ДанныеДоговора.Валюта;
	
	ПриИзмененииДоговораНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеДоговора(Договор)
	
	Возврат CW_ПланированиеДДССервер.ПолучитьДанныеДоговора(Договор);

КонецФункции

&НаСервере
Процедура ПриИзмененииДоговораНаСервере()
	
	УстановитьДоступныеТипыДокументаОснования();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииДоговораНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступныеТипыДокументаОснования()
	
	ОграничениеТипа = ПолучитьДоступныеТипыДокументаОснования();
	Элементы.ДокументОснование.ОграничениеТипа  = Новый ОписаниеТипов(ОграничениеТипа);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныеТипыДокументаОснования()
	
	ЭтоДОговорПоГрузоперевозке = ТипЗнч(Объект.Договор) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам");
	
	мТипы = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		Возврат мТипы;
	КонецЕсли;
	
	Если Объект.ВидДвижения =  ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Приход") Тогда
		Если ЭтоДОговорПоГрузоперевозке Тогда
			мТипы.Добавить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"));
			
			//Подсистема.УчетПриложенийДоговоров
			Если Объект.Договор.ИспользуютсяПриложения Тогда
				Массив	= Новый Массив;
				Массив.Добавить(Новый ПараметрВыбора("Отбор.Организация", 			Объект.Организация));
				Массив.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", 			Объект.Контрагент));
				Массив.Добавить(Новый ПараметрВыбора("Отбор.Договор", 				Объект.Договор));
				Массив.Добавить(Новый ПараметрВыбора("Отбор.ПриложениеКДоговору", 	Объект.ПриложениеКДоговору));
				
				Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
			КонецЕсли;
			//Подсистема.УчетПриложенийДоговоров
			
		Иначе
			мТипы.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
			мТипы.Добавить(Тип("ДокументСсылка.СчетНаОплатуПокупателю"));
		КонецЕсли;
	Иначе
		Если ЭтоДОговорПоГрузоперевозке Тогда
			мТипы.Добавить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")); 
			
			Если Объект.ВидОперацииПлатежногоПоручения = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю") Тогда 
				мТипы.Добавить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"));
				мТипы.Добавить(Тип("ДокументСсылка.CW_Оплата"));
				мТипы.Добавить(Тип("ДокументСсылка.CW_ДвижениеДенежныхСредств"));  
			КонецЕсли;
			
			//Подсистема.УчетПриложенийДоговоров
			Если Объект.Договор.ИспользуютсяПриложения Тогда
				Массив	= Новый Массив;
				Массив.Добавить(Новый ПараметрВыбора("Отбор.Организация", 			Объект.Организация));
				Массив.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", 			Объект.Контрагент));
				Массив.Добавить(Новый ПараметрВыбора("Отбор.Договор", 				Объект.Договор));
				Массив.Добавить(Новый ПараметрВыбора("Отбор.ПриложениеКДоговору", 	Объект.ПриложениеКДоговору));
				
				Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
			КонецЕсли;
			//Подсистема.УчетПриложенийДоговоров
			
		Иначе
			мТипы.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
			мТипы.Добавить(Тип("ДокументСсылка.СчетНаОплатуПоставщика"));
			Если Объект.ВидОперацииПлатежногоПоручения = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю") Тогда 
				мТипы.Добавить(Тип("ДокументСсылка.СписаниеСРасчетногоСчета"));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат мТипы; 
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСтатьюПоОснованию(Команда)
	ЗаполнитьСтатьюПоОснованиюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьюПоОснованиюНаСервере()
	Если НЕ Объект.ДокументОснование = Неопределено И НЕ Объект.ДокументОснование.Пустая() Тогда  
		ЗаполнитьЗначенияСвойств(Объект,Объект.ДокументОснование,"Организация,Контрагент,Договор,Валюта");
		Объект.СрокОплаты 		= CW_Документы.ПолучитьСрокОплаты(Объект.ДокументОснование);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОснованиеОплаты(Команда)
	ЗаполнитьОснованиеОплатыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОснованиеОплатыНаСервере()
	
	Объект.ОснованиеОплаты 	= ПолучитьТекстОснованияОплаты(Объект.ДокументОснование);
	Модифицированность 		= Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстОснованияОплаты(ДокументОснование)
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") 
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		Возврат ДокументОснование.ПредставлениеДокумента;
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		СтрокаАкт = "Акт №"+ДокументОснование.Номер+" от "+Формат(ДокументОснование.Дата,"ДФ='dd.MM.yyyy ""г.""'");
		СтрокаСЧФ = "";
		
		НайденнаяСчетФактура = ПолучитьДанныеСчетФактуры(ДокументОснование);	
		
		Если НайденнаяСчетФактура <> Неопределено Тогда
			СтрокаСЧФ = "Сч-ф №"+НайденнаяСчетФактура.Номер+" от "+Формат(НайденнаяСчетФактура.Дата,"ДФ='dd.MM.yyyy ""г.""'");
		КонецЕсли;
		
		Возврат СтрокаАкт + ?(ПустаяСтрока(СтрокаСЧФ), "", "; "+СтрокаСЧФ);
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
		
		СтрокаАкт = "Акт №"+ДокументОснование.НомерВходящегоДокумента+" от "+Формат(ДокументОснование.ДатаВходящегоДокумента,"ДФ='dd.MM.yyyy ""г.""'");
		СтрокаСЧФ = "";
		
		НайденнаяСчетФактура = ПолучитьДанныеСчетФактуры(ДокументОснование);	
		
		Если НайденнаяСчетФактура <> Неопределено Тогда
			СтрокаСЧФ = "Сч-ф №"+НайденнаяСчетФактура.НомерВходящегоДокумента+" от "+Формат(НайденнаяСчетФактура.ДатаВходящегоДокумента,"ДФ='dd.MM.yyyy ""г.""'");
		КонецЕсли;
		
		Возврат СтрокаАкт + ?(ПустаяСтрока(СтрокаСЧФ), "", "; "+СтрокаСЧФ);
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") 
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		
		Возврат "Счет №"+ДокументОснование.Номер+" от "+Формат(ДокументОснование.Дата,"ДФ='dd.MM.yyyy ""г.""'");
		
	КонецЕсли;
	
	Возврат Строка(ДокументОснование);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеСчетФактуры(ДокументОснование)
	
	ВидСчетаФактуры = ?(ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг"), "СчетФактураВыданный","СчетФактураПолученный"); 
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СчетФактура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ."+ВидСчетаФактуры+" КАК СчетФактура
	               |ГДЕ
	               |	СчетФактура.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПланОплатыПриИзменении(Элемент) 
	
	Объект.Состояние = ?(ЗначениеЗаполнено(Объект.ПланОплаты),1,0); 
	Если Объект.Состояние = 1 Тогда
		Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Согласована");  
	Иначе
		Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.План");  
	КонецЕсли;

	КонтролерДата();
	
КонецПроцедуры  

&НаКлиенте
Процедура ОчиститьСогласованиеОтмену(Команда)
	
	Объект.Состояние = 0;
	Объект.ПланОплаты = Неопределено;
	Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.План");  
	
	КонтролерДата();
	
КонецПроцедуры


&НаСервере
Процедура КонтролерДата()
	
	Если Объект.Состояние = 1 
		И 		ЗначениеЗаполнено(Объект.ПланОплаты) 
		И 		(ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") 
		ИЛИ 	ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
		
		ДанныеДоговора = CW_ПланированиеДДССервер.ПолучитьДанныеДоговора(Объект.Договор);
		
		Если ДанныеДоговора.РасчетыВУсловныхЕдиницах Тогда
			
			Если НЕ ПараметрыПланирования = Неопределено 
				И ПараметрыПланирования.ПересчитыватьСуммуПриСогласовании  Тогда
				
				ДанныеКурса = CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора, Объект.ПланОплаты);
				Объект.Сумма = Объект.ДокументОснование.СуммаДокумента * ДанныеКурса.Курс / ДанныеКурса.Кратность;
				ПриИзмененииСуммыНаСервере();
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли; 
	
	Объект.Контролер 		= ПараметрыСеанса.ТекущийПользователь;
	Объект.ДатаПланирования = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	
	Если Объект.Состояние = 1 И НЕ ЗначениеЗаполнено(Объект.ПланОплаты) Тогда
		Объект.ПланОплаты = ТекущаяДата();
		Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Согласована");
	ИначеЕсли Объект.Состояние = 2 Тогда
		Объект.ПланОплаты = Неопределено;	
		Статус =  ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Отклонена");
	КонецЕсли; 
	
	КонтролерДата();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСрокОплатыНаСервере()
	
	СрокОплаты = Неопределено;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_Оплата") 
		ИЛИ ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_ДвижениеДенежныхСредств") Тогда
		Возврат;	
	КонецЕсли;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") ИЛИ
		ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		СтруктураСрокОплаты = CW_Документы.ПолучитьСрокОплаты(Объект.ДокументОснование);
		СрокОплаты = СтруктураСрокОплаты.ДатаОплаты;
		
	Иначе 
		СтруктураСрокОплаты = СрокиОплатыДокументов.СрокОплатыДокументаРасчетов(
					Объект.ДокументОснование.Организация, 
					Объект.ДокументОснование,
					Объект.ДокументОснование.Дата, 
					Объект.ДокументОснование.ДоговорКонтрагента);
		
		СрокОплаты = СтруктураСрокОплаты.СрокОплаты;	
	КонецЕсли;
	
	Объект.СрокОплаты  = СрокОплаты;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланОплатыНаСервере()
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") ИЛИ
		ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		ДанныеПланаОплаты   = CW_Документы.ПолучитьПланОплаты(Объект.ДокументОснование);
		Объект.ПланОплаты	= ДанныеПланаОплаты.Дата;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСрокОплаты(Команда)
	ЗаполнитьСрокОплатыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РегистрыСведений.CW_СтатусыПланированиеДДС.ЗаписатьСтатусВРегистр(ТекущийОбъект.Ссылка, Статус);

	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрПлатежейНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыРеестра", ЭтотОбъект);
	
	СтруктураПараметров = Новый Структура("Ключ", РеестрПлатежей);
	ОткрытьФорму("Документ.CW_РеестрПлатежей.ФормаОбъекта",СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыРеестра(Результат, Дополнительныепараметры) Экспорт
	
	ПолучитьСтатусОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатус(Команда)
	ПолучитьСтатусОбъекта();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтатусОбъекта()
	Статус = РегистрыСведений.CW_СтатусыПланированиеДДС.ПолучитьСтатусПланированияДДС(Объект.Ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ТекущаяОрганизация <> Объект.Организация Тогда
		Объект.Код = "";
		ТекущаяОрганизация = Объект.Организация;
	КонецЕсли;
	
	ЗаполнитьПараметрыПланированияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДатаДокумента) Тогда
		// Изменение времени не влияет на поведение документа.
		ТекущаяДатаДокумента = Объект.Дата;
		Возврат;
	КонецЕсли;
	
	Если Год(Объект.Дата) <> Год(ТекущаяДатаДокумента) Тогда
		//Изменился год документа
		Объект.Код = "";
		ТекущаяДатаДокумента = Объект.Дата;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСумму(Команда)  
	
	Если Объект.ВариантЗаполненияРасшифровки = 0 Тогда
		ПараметрыПолученияСуммы = Новый Структура;
		ПараметрыПолученияСуммы.Вставить("ДатаСреза", Объект.Дата);
		ПараметрыПолученияСуммы.Вставить("ДокументОснование", Объект.ДокументОснование);
		ПараметрыПолученияСуммы.Вставить("Валюта", Объект.Валюта);
		
		Объект.Сумма = ПолучитьСуммуЗаявкиНаСервере(ПараметрыПолученияСуммы); 
	Иначе
		РассчитатьСуммаЗаявки();   
		
	КонецЕсли;                    
	
	ЗаполнитьСуммуВсегоНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуЗаявкиНаСервере(ПараметрыПолученияСуммы)
	
	Если Не ЗначениеЗаполнено(ПараметрыПолученияСуммы.ДокументОснование) Тогда
		Возврат 0;
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если ТипЗнч(ПараметрыПолученияСуммы.ДокументОснование) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет КАК Счет,
		               |	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК Всего_ВалютаОстаток,
		               |	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.ВсегоОстаток КАК ВсегоОстаток
		               |ИЗ
		               |	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Остатки(&ДатаСреза, Счет = &ДокументОснование) КАК CW_ОперативнаяКредиторскаяЗадолженностьОстатки";
		
		Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(КонецДня(ПараметрыПолученияСуммы.ДатаСреза), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ДокументОснование", ПараметрыПолученияСуммы.ДокументОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если ПараметрыПолученияСуммы.Валюта = ВалютаРегламентированногоУчета Тогда
				Возврат Выборка.ВсегоОстаток;
			Иначе
				Возврат Выборка.Всего_ВалютаОстаток;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура СтатьяДДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПолныеПрава Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = СписокДоступныхСтатей;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДДСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ПолныеПрава Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = СписокДоступныхСтатей;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДДСОткрытие(Элемент, СтандартнаяОбработка)
	
	Если НЕ ПолныеПрава Тогда
		СтандартнаяОбработка = Ложь;
		СтандартнаяОбработка = СписокДоступныхСтатей.НайтиПоЗначению(Объект.СтатьяДДС) <> Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()
	
	ЗаполнитьОснованиеОплатыНаСервере();
	ЗаполнитьСрокОплатыНаСервере();
	ЗаполнитьПланОплатыНаСервере();
	ЗаполнитьПараметрыПланированияНаСервере(); 
	ЗаполнитьСуммуВсегоНаСервере();
	
КонецПроцедуры     

&НаСервере
Процедура ЗаполнитьСуммуВсегоНаСервере()
	
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Валюты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Валюты КАК Валюты
	               |ГДЕ
	               |	Валюты.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", "643");

	РезультатаЗапроса = Запрос.Выполнить();
	Выборка = РезультатаЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ВалютаРубль = Выборка.Ссылка;
	КонецЕсли;
	
	Если ВалютаРубль = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюты ""Российский рубль"" (код 643) в справочнике ""Валюты"" не найдена!"); 
		Возврат;
	КонецЕсли;
	
	ДоговорвВРублях = Ложь;	
	Если ТипЗнч(Объект.Договор) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		 ДоговорвВРублях = (Объект.Договор.ВалютаДоговора = ВалютаРубль) ИЛИ Объект.Договор.ВзаиморасчетыВУЕ;
	КонецЕсли;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		СтруктураДоходы = Новый Структура;
		СтруктураДоходы.Вставить("Всего", 0);
		СтруктураДоходы.Вставить("Всего_Валюта", 0);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ДоходыПоГрузоперевозкамОбороты.Всего_ВалютаОборот КАК Всего_Валюта,
		               |	CW_ДоходыПоГрузоперевозкамОбороты.ВсегоОборот КАК Всего
		               |ИЗ
		               |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам.Обороты(, , Период, ДокументДоходов = &ДокументДоходов) КАК CW_ДоходыПоГрузоперевозкамОбороты";
		
		Запрос.УстановитьПараметр("ДокументДоходов", Объект.ДокументОснование);  
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка =  РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДоходы, Выборка);	
		КонецЕсли;
		
		
		СтруктураОплата = Новый Структура;
		СтруктураОплата.Вставить("Всего", 0);
		СтруктураОплата.Вставить("Всего_Валюта", 0);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОбороты.Всего_ВалютаОборот КАК Всего_Валюта,
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОбороты.ВсегоОборот КАК Всего
		               |ИЗ
		               |	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность.Обороты(, , Период, Счет = &Счет) КАК CW_ОперативнаяДебиторскаяЗадолженностьОбороты";
		
		Запрос.УстановитьПараметр("Счет", Объект.ДокументОснование);  
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка =  РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураОплата, Выборка);	
		КонецЕсли;    
		
		Если ДоговорвВРублях Тогда
			Объект.Сумма = СтруктураДоходы["Всего"] - СтруктураОплата["Всего"];
		Иначе
			Объект.Сумма = СтруктураДоходы["Всего_Валюта"] - СтруктураОплата["Всего_Валюта"];
		КонецЕсли;
		
	КонецЕсли;  
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_Оплата")
		Или ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.CW_ДвижениеДенежныхСредств") Тогда
		
		СтруктураЗадолженность = Новый Структура;
		СтруктураЗадолженность.Вставить("Всего", 0);
		СтруктураЗадолженность.Вставить("Всего_Валюта", 0);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(CW_ОперативнаяДебиторскаяЗадолженность.Всего_Валюта) КАК Всего_Валюта,
		               |	СУММА(CW_ОперативнаяДебиторскаяЗадолженность.Всего) КАК Всего
		               |ИЗ
		               |	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность КАК CW_ОперативнаяДебиторскаяЗадолженность
		               |ГДЕ
		               |	CW_ОперативнаяДебиторскаяЗадолженность.Регистратор = &Регистратор
		               |	И CW_ОперативнаяДебиторскаяЗадолженность.ВидДвижения = &ВидДвижения
		               |	И CW_ОперативнаяДебиторскаяЗадолженность.ВидОперации = &ВидОперации";
		
		Запрос.УстановитьПараметр("Регистратор", Объект.ДокументОснование);  
		Запрос.УстановитьПараметр("ВидОперации", ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.Оплата"));  
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);  
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка =  РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураЗадолженность, Выборка);	
		КонецЕсли;
		
		Если ДоговорвВРублях Тогда
			Объект.Сумма = СтруктураЗадолженность["Всего"];
		Иначе
			Объект.Сумма = СтруктураЗадолженность["Всего_Валюта"];
		КонецЕсли;
		
	КонецЕсли;  
	
	ПриИзмененииСуммыНаСервере();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ДокументОснованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатьяДДСПриИзмененииНаСервере(СтатьяДДС)
	
	Возврат СтатьяДДС.ОсновнойВидОперацииПлатежногоПоручения;
	
КонецФункции

&НаКлиенте
Процедура СтатьяДДСПриИзменении(Элемент)
	Объект.ВидОперацииПлатежногоПоручения = СтатьяДДСПриИзмененииНаСервере(Объект.СтатьяДДС);
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ПриИзмененииСуммыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ПриИзмененииСуммыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСуммыНаСервере()
	
	Ставка 			= CW_Финансы.ПолучитьСтавкуНДС(Объект.СтавкаНДС);
	Объект.СуммаНДС = CW_Финансы.РассчитатьСуммуНДС(Объект.Сумма, Истина, Истина, Ставка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормы();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСодержание(Команда)
	
	ЗаполнитьСодержаниеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСодержаниеНаСервере()
	
	Объект.Содержание = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыПланирования.ШаблонЗаполненияСодержания, Объект.ДокументОснование, Неопределено, Объект.ДокументОснование.Услуги);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗаполненияРасшифровкиПриИзменении(Элемент)  

	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Объект.ДокументОснование  = Неопределено;             
	КонецЕсли;
	Если Объект.ВариантЗаполненияРасшифровки = 0 Тогда
		Объект.Расшифровка.Очистить();
	КонецЕсли;    
	
	ВариантЗаполненияРасшифровкиПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаСервере
Процедура ВариантЗаполненияРасшифровкиПриИзмененииНаСервере()

	Элементы.ДокументОснование.Видимость = Объект.ВариантЗаполненияРасшифровки = 0;
	Элементы.ГруппаРасшифровка.Видимость = Объект.ВариантЗаполненияРасшифровки = 1;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;    
	
	ОткрытьФормуПодбораСтатейБюджета(Ложь, Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПодборСтатейБюджета(Команда)    
	
	ОткрытьФормуПодбораСтатейБюджета(Истина, Ложь);   
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСтатейБюджета(МножественныйВыбор, ЗакрыватьПриВыборое)
	
	ПериодПрогноза = Новый СтандартныйПериод;
	ПериодПрогноза.ДатаНачала = Объект.Дата;
	ПериодПрогноза.ДатаОкончания = Объект.СрокОплаты;  
	
	Если Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход") Тогда
		ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы");	
	Иначе 
		ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы");	
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ВидСтатьиПланирования", ВидСтатьиПланирования);
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("ПериодПрогноза", 		ПериодПрогноза);  
	ПараметрыФормы.Вставить("Контрагент", 			Объект.Контрагент);
	ПараметрыФормы.Вставить("Валюта", 				Объект.Валюта);
	ПараметрыФормы.Вставить("Отбор", 				СтруктураОтбора);
	ПараметрыФормы.Вставить("МножественныйВыбор", 	МножественныйВыбор);  
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборое", 	ЗакрыватьПриВыборое);  
	
	ОткрытьФорму("Справочник.CW_ПланированиеДДС.Форма.ФормаПодбораСтатейВЗаявку", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры    

&НаКлиенте
Процедура РасшифровкаПослеУдаления(Элемент)
	РасшифровкаПослеУдаленияНаСервере();
КонецПроцедуры  

&НаСервере
Процедура РасшифровкаПослеУдаленияНаСервере()
	РассчитатьСуммаЗаявки();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;	
	КонецЕсли;   
	
	ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры  

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого СтатьяБюджета из ВыбранноеЗначение Цикл
			ДобавитьСтатьюБюджета(СтатьяБюджета);
		КонецЦикла;
	Иначе
		ДобавитьСтатьюБюджета(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтатьюБюджета(СтатьяБюджета)
	
	Если ТипЗнч(СтатьяБюджета) <> Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов") Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СтатьяБюджета", СтатьяБюджета); 
	
	мСтроки = Объект.Расшифровка.НайтиСтроки(Отбор);
	Если мСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;       
	
	Прогноз = РегистрыСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета.ПолучитьПрогнозОплаты(СтатьяБюджета);
	
	НоваяСтрока = Объект.Расшифровка.Добавить();
	НоваяСтрока.СтатьяБюджета 	= СтатьяБюджета;
 	НоваяСтрока.Грузоперевозка 	= СтатьяБюджета.Владелец;
	НоваяСтрока.Прогноз 		= Прогноз;
 	НоваяСтрока.Сумма 			= СтатьяБюджета.СуммаВсего;
 	НоваяСтрока.СуммаНДС 		= СтатьяБюджета.СуммаНДС;
	НоваяСтрока.Валюта 			= СтатьяБюджета.Валюта; 
	НоваяСтрока.СтавкаНДС 		= СтатьяБюджета.СтавкаНДС; 
	
	КурсСтатьи = CW_Финансы.ПолучитьКурсВалюты(НоваяСтрока.Валюта, Объект.Дата);
	КурсЗаявки = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта, Объект.Дата);
	
	НоваяСтрока.СуммаВВалютеЗаявки = CW_Финансы.ПересчитатьИзВалютыВВалюту(НоваяСтрока.Сумма, 
														НоваяСтрока.Валюта, 
														Объект.Валюта, 
														КурсСтатьи.Курс, 
														КурсЗаявки.Курс, 
														КурсСтатьи.Кратность, 
														КурсЗаявки.Кратность);

	НоваяСтрока.СуммаНДСВВалютеЗаявки = CW_Финансы.ПересчитатьИзВалютыВВалюту(НоваяСтрока.СуммаНДС, 
														НоваяСтрока.Валюта, 
														Объект.Валюта, 
														КурсСтатьи.Курс, 
														КурсЗаявки.Курс, 
														КурсСтатьи.Кратность, 
														КурсЗаявки.Кратность);
	
	РассчитатьСуммаЗаявки();

КонецПроцедуры      

&НаСервере
Процедура РассчитатьСуммаЗаявки()
	
	Объект.Сумма 	= Объект.Расшифровка.Итог("СуммаВВалютеЗаявки");
	Объект.СуммаНДС = Объект.Расшифровка.Итог("СуммаНДСВВалютеЗаявки");    
	
	ТаблицаРасшифровка = Объект.Расшифровка.Выгрузить();
	ТаблицаРасшифровка.Свернуть("СтавкаНДС", "СуммаНДС"); 
	ТаблицаРасшифровка.Сортировать("СуммаНДС УБЫВ");
	
	Если ТаблицаРасшифровка.Количество() > 0 Тогда
		Объект.СтавкаНДС = ТаблицаРасшифровка[0].СтавкаНДС;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтатью(Команда)
	
	ТекущиеДанные = Элементы.Расшифровка.ТекущиеДанные;
	ОткрытьСтатьюБюджета(ТекущиеДанные);
	
КонецПроцедуры 

&НаКлиенте
Процедура РасшифровкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.Расшифровка.ТекущиеДанные;
	ОткрытьСтатьюБюджета(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтатьюБюджета(ТекущиеДанные)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.СтатьяБюджета);
	
	ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИспользуетсяПрогнозированиеДДСПоБюджету Тогда
		ПроверитьДублированиеСтатей(Отказ);               
	КонецЕсли;

	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	
КонецПроцедуры

&наСервере
Процедура ПроверитьДублированиеСтатей(Отказ)  
	
	Расшифровка = Объект.Расшифровка.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	 "ВЫБРАТЬ
	               	 |	CW_ПланированиеДДСРасшифровка.НомерСтроки КАК НомерСтроки,
	               	 |	CW_ПланированиеДДСРасшифровка.СтатьяБюджета КАК СтатьяБюджета
	               	 |ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	               	 |ИЗ
	               	 |	&Расшифровка КАК CW_ПланированиеДДСРасшифровка
	               	 |;
	               	 |
	               	 |////////////////////////////////////////////////////////////////////////////////
	               	 |ВЫБРАТЬ
	               	 |	ВТ_ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	               	 |	ВТ_ТаблицаДокумента.СтатьяБюджета КАК СтатьяБюджета,
	               	 |	CW_ПланированиеДДСРасшифровка.Ссылка КАК Ссылка
	               	 |ИЗ
	               	 |	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	               	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CW_ПланированиеДДС.Расшифровка КАК CW_ПланированиеДДСРасшифровка
	               	 |		ПО ВТ_ТаблицаДокумента.СтатьяБюджета = CW_ПланированиеДДСРасшифровка.СтатьяБюджета
	               	 |ГДЕ
	               	 |	CW_ПланированиеДДСРасшифровка.Ссылка <> &Ссылка"; 
	 
	 Запрос.УстановитьПараметр("Ссылка",		Объект.Ссылка);
	 Запрос.УстановитьПараметр("Расшифровка", 	Расшифровка); 
	 
	 РезультатЗапроса = Запрос.Выполнить();  
	 Выборка = РезультатЗапроса.Выбрать();
	 Пока Выборка.Следующий() Цикл 
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке "+Формат(Выборка.НомерСтроки, "ЧГ=0")+" статья бюджета """+СокрЛП(Выборка.СтатьяБюджета)+""" уже используется в заявке: "+ СокрЛП(Выборка.Ссылка)
				 ,,,,Отказ);
	 КонецЦикла;
	 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		// СтандартныеПодсистемы.Свойства
		
		//Наличие прикрепленных файлов
	ИначеЕсли ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
		
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
		//Наличие прикрепленных файлов

		//Подсистема.СтатусыДокументов
	ИначеЕсли ИмяСобытия = "Изменение_СтатусДокумента" Тогда
		
		ОбработатьОповещениеИзменениеСтатусДокументаНаСервере();
		//Подсистема.СтатусыДокументов
	КонецЕсли;
	
КонецПроцедуры  

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства  
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти   

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ИспользоватьДопРеквизиты Тогда
		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
		// Конец СтандартныеПодсистемы.Свойства
	КонецЕсли;

КонецПроцедуры   

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры




//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()
	
	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
//Наличие прикрепленных файлов
 //Подсистема.СтатусыДокументов
&НаКлиенте
Процедура СтатусДокументаИзменить(Команда)
	
	CW_СтатусыДокументовКлиент.ОткрытьФормуРедактированияСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДанныхСтатуса(Результат, ДополнительныеПараметры) Экспорт
	
	CW_СтатусыДокументовКлиент.ОбработатьИзменениеДанныхСтатуса(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаИстория(Команда)
	
	CW_СтатусыДокументовКлиент.ПоказатьИсториюСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.ОткрытьСтатусДокумента(ЭтаФорма,Элемент, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаАвтоПодбор(ЭтаФорма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	CW_СтатусыДокументовКлиент.ПриИзмененииСтатусаДокумента(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеИзменениеСтатусДокументаНаСервере()
	
	CW_СтатусыДокументовСервер.ПолучитьТекущийСтатусДокумента(Объект, ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ВидОперацииПлатежногоПорученияПриИзменении(Элемент)
	ВидОперацииПлатежногоПорученияПриИзмененииНаСервере();
КонецПроцедуры    

&НаСервере
Процедура ВидОперацииПлатежногоПорученияПриИзмененииНаСервере()

	Если Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Приход")
		ИЛИ (Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход") 
		и Объект.ВидОперацииПлатежногоПоручения = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю") ) Тогда 
		
		Массив	= Новый Массив;
		Массив.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем")));
		Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);

	ИначеЕсли Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход") Тогда  
		
		Массив	= Новый Массив();
		Массив.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком")));
		Элементы.Договор.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);

	КонецЕсли;

КонецПроцедуры


//Подсистема.СтатусыДокументов



