
&НаКлиенте
Процедура СписокПараметровПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСсылокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметры(Команда)

	ЗаполнитьПараметрыНаСервере();
	ВыполнитьПоискСсылок(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаСервере()
	
	СписокПараметров.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	|ГДЕ
	|	CW_ПараметрыГрузоперевозок.ПометкаУдаления = ИСТИНА";   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокПараметров.Добавить(Выборка.Ссылка,, Истина, БиблиотекаКартинок.ПометитьНаУдаление);
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокПараметровПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокПараметров.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		ТекущийПараметр = Неопределено;
		ОбработатьАктивизациюСтрокиПараметров(ТекущиеДанные);
	КонецЕсли;   
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиПараметров(Знач ТекущиеДанные)
	
	Если ТекущийПараметр <> ТекущиеДанные.Значение Тогда 
		ТекущийПараметр = ТекущиеДанные.Значение;
		ПодключитьОбработчикОжидания("ЗаполнитьТаблицуСсылок",0.1, Истина);
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте
Процедура ЗаполнитьТаблицуСсылок()  
	
	ТекущаяСтрока = Элементы.СписокПараметров.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ЗаполнитьТаблицуСсылокНаСервере(ТекущаяСтрока);	
	КонецЕсли;
	
КонецПроцедуры 


&НаСервере
Процедура ЗаполнитьТаблицуСсылокНаСервере(ТекущаяСтрока)
	
	СтрокаТекущая = СписокПараметров.НайтиПоИдентификатору(ТекущаяСтрока);

	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", СтрокаТекущая.Значение);
	
	ВремТаблица = ВсеСсылки.Выгрузить().Скопировать(Отбор);
   	ТаблицаСсылок.Загрузить(ВремТаблица);
	
	Элементы.Декорация1.Заголовок = "Всего ссылок: "+СокрЛП(ТаблицаСсылок.Количество());
	
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаСсылокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;

	ПоказатьЗначение(,Элементы.ТаблицаСсылок.ТекущиеДанные.Данные);

КонецПроцедуры



//Поиск ссылок
&НаКлиенте
Процедура ВыполнитьПоискСсылок()
	
	РезультатВыполнения =  ЗаполнитьСписокСсылокНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПолученияСпискаСсылок", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокСсылокНаСервереВФоне()

	МассивСсылок = новый Массив;
	Для каждого ЭлементСписка из СписокПараметров Цикл
		Если ЭлементСписка.Пометка Тогда
			МассивСсылок.Добавить(ЭлементСписка.Значение);	
		КонецЕсли;
	КонецЦикла;

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Поиск ссылок на параметры";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("МассивСсылок", МассивСсылок);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_УдалениеСсылокНаПараметры.НайтиСсылкиПоМассиву",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатПолученияСпискаСсылок(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда  
		
		ОбработатьРезультатПолученияСпискаСсылокнаСервере(РезультатВыполнения.АдресРезультата);
		
		ТекущиеДанные = Элементы.СписокПараметров.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ОбработатьАктивизациюСтрокиПараметров(ТекущиеДанные);
		КонецЕсли;   
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка выполнения!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка получения списка ссылок"); 
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьРезультатПолученияСпискаСсылокнаСервере(АдресРезультата) 
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(Результат) = Тип("ТаблицаЗначений") Тогда
		ВсеСсылки.Загрузить(Результат);
	КонецЕсли;
	
КонецПроцедуры  
//---Поиск ссылок 

//Очистка ссылок
&НаКлиенте
Процедура ОчиститьСсылки(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Режим", "ВСЕ");
	
	ЗадатьВопросОбОчисткеСсылок(ДополнительныеПараметры);

КонецПроцедуры   

&НаКлиенте
Процедура ОчиститьТекущиеСсылки(Команда)         
	
	ТекущаяСтрока = Элементы.СписокПараметров.ТекущаяСтрока;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Режим", 			"ТЕКУЩИЕ");
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", 	ТекущаяСтрока);

	ЗадатьВопросОбОчисткеСсылок(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОбОчисткеСсылок(ДополнительныеПараметры)   
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОчисткеСсылок", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Найденные ссылки на выбранные параметры будут очищены. Продожить?", Режим, 0);

КонецПроцедуры 



&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОчисткеСсылок(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	РезультатВыполнения =  ПродолжитьУдалениеСсылокНаСервереВФоне(ДополнительныеПараметры);
	Если РезультатВыполнения = Неопределено Тогда
		ПоказатьПредупреждение(, "Нет ссылок для очистки!");
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатУдаленияСсылок", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьУдалениеСсылокНаСервереВФоне(ДополнительныеПараметры)

	МассивСсылок = новый Массив;   
	
	Если ДополнительныеПараметры.Режим = "ВСЕ" Тогда
		Для каждого ЭлементСписка из СписокПараметров Цикл
			Если ЭлементСписка.Пометка Тогда
				МассивСсылок.Добавить(ЭлементСписка.Значение);	
			КонецЕсли;
		КонецЦикла;
	Иначе    
		ЭлементСписка = СписокПараметров.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);  
		Если ЭлементСписка.Пометка Тогда
			МассивСсылок.Добавить(ЭлементСписка.Значение);	
		КонецЕсли;
	КонецЕсли;   
	
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "удаление ссылок на параметры";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("МассивСсылок", МассивСсылок);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_УдалениеСсылокНаПараметры.ОчиститьСсылки", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции  

&НаКлиенте
Процедура ОбработатьРезультатУдаленияСсылок(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда  
		
		ВыполнитьПоискСсылок();
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка выполнения!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования документов"); 
		
	КонецЕсли;
	
КонецПроцедуры 
//---Очистка ссылок
