
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПереданноеЗначениеРеквизита = Неопределено;
	
	Параметры.Свойство("ДляГрузоперевозки",	 	ДляГрузоперевозки);
	Параметры.Свойство("ДляЗаказа", 			ДляЗаказа);
	Параметры.Свойство("ДляЗаявки", 			ДляЗаявки);
	Параметры.Свойство("ЗначениеРеквизита", 	ПереданноеЗначениеРеквизита);
	Параметры.Свойство("ИмяРеквизита", 			ИмяРеквизита);
	Параметры.Свойство("СинонимРеквизита", 		СинонимРеквизита);   
	Параметры.Свойство("ПерезаполнятьЗначение", ПерезаполнятьЗначение);   
	
	ИмяРеквизитаФормы = "ЗначениеРеквизита";
	Если ИмяРеквизита = "Содержание" 
		ИЛИ ИмяРеквизита = "Примечание" Тогда  
		ИмяРеквизитаФормы = "ЗначениеРеквизитаСтрока";
	КонецЕсли;  
	
	ЭтаФорма[ИмяРеквизитаФормы] = ПереданноеЗначениеРеквизита;
	
	Элементы.ДляГрузоперевозки.Доступность 	= (ИмяРеквизита <> "Содержание");  
	Элементы.ДляЗаказа.Доступность 			= (ИмяРеквизита <> "Содержание") и (ИмяРеквизита <> "Примечание");  
	Элементы.ДляЗаявки.Доступность 			= (ИмяРеквизита <> "ОперативныйМенеджер") и (ИмяРеквизита <> "Примечание"); 
	
	Элементы.ЗначениеРеквизита.Видимость 		= (ИмяРеквизита <> "Содержание")  и (ИмяРеквизита <> "Примечание");
	Элементы.ЗначениеРеквизитаСтрока.Видимость 	= (ИмяРеквизита = "Содержание") или (ИмяРеквизита = "Примечание");

	Элементы.ЗначениеРеквизита.Заголовок 		= СинонимРеквизита;
	Элементы.ЗначениеРеквизитаСтрока.Заголовок	= СинонимРеквизита;

	ОрганичитьТипЗначенияРеквизита();
	
КонецПроцедуры

&НаСервере
Процедура ОрганичитьТипЗначенияРеквизита()
	
	СоответствиеТипов = ПолучитьСоответствиеТиповЗначений(); 
	ОписаниеТипа = СоответствиеТипов.Получить(ИмяРеквизита);   
	
	Если ИмяРеквизита <> "Содержание" и ИмяРеквизита <> "Примечание" Тогда  
		Элементы.ЗначениеРеквизита.ОграничениеТипа = СоответствиеТипов.Получить(ИмяРеквизита);
		Элементы.ЗначениеРеквизита.ОграничениеТипа.ПривестиЗначение(ЗначениеРеквизита);
		Элементы.ЗначениеРеквизита.ВыбиратьТип = Ложь;   
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеТиповЗначений()
	
	Результат = Новый Соответствие;
	
	Результат.Вставить("Клиент", 				Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Результат.Вставить("МенеджерПродаж", 		Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Результат.Вставить("ОперативныйМенеджер", 	Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Результат.Вставить("Груз", 					Новый ОписаниеТипов("СправочникСсылка.CW_Грузы"));
	Результат.Вставить("Маршрут", 				Новый ОписаниеТипов("СправочникСсылка.CW_МаршрутыГрузоперевозок"));
	Результат.Вставить("Содержание", 			Новый ОписаниеТипов("Строка"));
 	Результат.Вставить("Примечание", 			Новый ОписаниеТипов("Строка"));

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Записать(Команда)  
	
	Отказ = Ложь;   
	
	ВведенноеЗначение = ЭтаФорма[ИмяРеквизитаФормы];
	
	Если ЗначениеЗаполнено(ВведенноеЗначение) 
		И Не ДляГрузоперевозки и Не ДляЗаказа и Не ДляЗаявки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определено назначение для предопределенного значения!",, "ДляГрузоперевозки",, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВведенноеЗначение) 
		И (ДляГрузоперевозки ИЛИ ДляЗаказа ИЛИ ДляЗаявки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрано значение для реквизита!",, ИмяРеквизитаФормы,, Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		СтруктураПараметров = новый Структура;
		СтруктураПараметров.Вставить("ЗначениеРеквизита", 		ВведенноеЗначение);
		СтруктураПараметров.Вставить("ДляГрузоперевозки", 		ДляГрузоперевозки);
		СтруктураПараметров.Вставить("ДляЗаказа", 				ДляЗаказа);
		СтруктураПараметров.Вставить("ДляЗаявки", 				ДляЗаявки);     
		СтруктураПараметров.Вставить("ПерезаполнятьЗначение",	ПерезаполнятьЗначение);     
		
		ЭтаФорма.Закрыть(СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры
