Функция ПроверитьНаличиеПодписки(Знач РегистрационныйНомер, Знач ИмяПрограммногоПродукта) Экспорт
	
	СервисДоступен = Истина;
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("service",	ИмяПрограммногоПродукта);    
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("af_subscriptionissued", СтруктураJSON);

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");  
	Если Ответ = Неопределено Тогда
		КодСостояния = 404; 
	Иначе
		КодСостояния = Ответ.КодСостояния;
	КонецЕсли;   
	
	Структура = Новый Структура;
	Структура.Вставить("КодСостояния", 	 КодСостояния);
	
	Возврат Структура;
	
КонецФункции