
&НаКлиенте
Процедура саб_ЗаполнитьАвансовымиСчетФактурамиПосле(Команда)
	саб_ЗаполнитьАвансовымиСчетФактурамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура саб_ЗаполнитьАвансовымиСчетФактурамиНаСервере()
	    
	    ДокументыРеализации = Новый Массив;
		Для Каждого Стр Из Объект.ДокументыОснования Цикл
			Если ТИПЗнч(Стр.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ДокументыРеализации.Добавить(Стр.ДокументОснование);
			КонецЕсли;
		КонецЦикла;
		
		Если ДокументыРеализации.Количество() > 0 Тогда 
			
			Реализация = ДокументыРеализации[0]; 		
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,
			|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка КАК Ссылка,
			|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйДокумент КАК ВедомыйДокумент
			|ИЗ
			|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
			|ГДЕ
			|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйДокумент = &Реализация";
			
			Запрос.УстановитьПараметр("Реализация", Реализация);			
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Грузоперевозки = Новый Массив;
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.Грузоперевозка) Тогда
					Грузоперевозки.Добавить(Выборка.Грузоперевозка);
				КонецЕсли;		
			КонецЦикла;
			
			Если Грузоперевозки.Количество() > 0 Тогда			
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,				
				|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйСчет КАК ВедомыйСчет
				|ИЗ
				|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
				|ГДЕ
				|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка В(&Грузоперевозки)
				|	И CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйСчет <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка)";
				
				Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозки);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Выборка = РезультатЗапроса.Выбрать();
				Счета = Новый Массив;
				Пока Выборка.Следующий() Цикл
					Счета.Добавить(Выборка.ВедомыйСчет);
				КонецЦикла;
				
				Если Счета.Количество() > 0 Тогда
					//поступления ДС до реализации					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа
					|ГДЕ
					|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СчетНаОплату В(&Счета)
					|	И ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Ссылка.Дата < &Дата";
					
					Запрос.УстановитьПараметр("Счета", Счета);					
					Запрос.УстановитьПараметр("Дата", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реализация,"Дата"));
					
					РезультатЗапроса = Запрос.Выполнить();
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Поступления = Новый Массив;
					Пока Выборка.Следующий() Цикл
						Поступления.Добавить(Выборка.Ссылка);
					КонецЦикла; 					
					
					Если Поступления.Количество() > 0 Тогда
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	СчетФактураВыданный.Ссылка КАК Ссылка,
						|	СчетФактураВыданный.Номер КАК Номер,
						|	СчетФактураВыданный.Дата КАК Дата
						|ИЗ
						|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
						|ГДЕ
						|	СчетФактураВыданный.ВидСчетаФактуры = &ВидСчетаФактуры
						|	И СчетФактураВыданный.ДокументОснование В(&ДокументОснование)
						|
						|УПОРЯДОЧИТЬ ПО
						|	Дата";
					
					    Запрос.УстановитьПараметр("ДокументОснование", Поступления);
						Запрос.УстановитьПараметр("ВидСчетаФактуры", Перечисления.ВидСчетаФактурыВыставленного.НаАванс);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						Таблица = РезультатЗапроса.Выгрузить();
						
						Если Таблица.Количество() > 0 Тогда
							Для Каждого Стр Из Таблица Цикл
								УжеДобавлено = Ложь;
								Для Каждого СтрокаТабличнойЧасти Из Объект.ПлатежноРасчетныеДокументы Цикл
									Если Стр.Номер = СтрокаТабличнойЧасти.НомерСчетаФактурыНаАванс И Стр.Дата = СтрокаТабличнойЧасти.ДатаСчетаФактурыНаАванс Тогда
										УжеДобавлено = Истина;
										Прервать;
									КонецЕсли;	
								КонецЦикла;
								ДобавленоВТЧ = Ложь;
								Если Не УжеДобавлено Тогда
									Для Каждого СтрокаТабличнойЧасти Из Объект.ПлатежноРасчетныеДокументы Цикл
										Если ПустаяСтрока(СтрокаТабличнойЧасти.НомерСчетаФактурыНаАванс) Тогда
											 СтрокаТабличнойЧасти.НомерСчетаФактурыНаАванс = Стр.Номер;
											 СтрокаТабличнойЧасти.ДатаСчетаФактурыНаАванс = Стр.Дата;
											 ДобавленоВТЧ = Истина;
											 Модифицированность = Истина;
											 Прервать;
										 КонецЕсли;
									 КонецЦикла;
								 КонецЕсли;
								 Если Не ДобавленоВТЧ Тогда 
									 НовСтр = Объект.ПлатежноРасчетныеДокументы.Добавить();								
									 НовСтр.НомерСчетаФактурыНаАванс = Стр.Номер;
									 НовСтр.ДатаСчетаФактурыНаАванс = Стр.Дата;
									 Модифицированность = Истина;
								 КонецЕсли;
							КонецЦикла;	
						КонецЕсли;						
					КонецЕсли;					
				КонецЕсли;				
			КонецЕсли;	
		КонецЕсли;

КонецПроцедуры
