
Функция ИдентификаторПакетаДокумента(ЭлектронныйДокумент) Экспорт
	
	Возврат ПакетыДокументовЭДО.ИдентификаторПакетаДокумента(ЭлектронныйДокумент);
	
КонецФункции

Процедура ЗаполнитьПараметрыДобавленияВПакет(ПараметрыДобавленияВПакет) Экспорт
	
	ИдентификаторПакета = ПакетыДокументовЭДО.ИдентификаторПакетаДокумента(ПараметрыДобавленияВПакет.ЭлектронныйДокумент);

	ПараметрыДобавленияВПакет.ИдентификаторПакета 		= ИдентификаторПакета;
	ПараметрыДобавленияВПакет.Отправитель 				= ПараметрыДобавленияВПакет.ЭлектронныйДокумент.Организация;
	ПараметрыДобавленияВПакет.Получатель 				= ПараметрыДобавленияВПакет.ЭлектронныйДокумент.Контрагент;
	ПараметрыДобавленияВПакет.Договор 					= ПараметрыДобавленияВПакет.ЭлектронныйДокумент.ДоговорКонтрагента;
	ПараметрыДобавленияВПакет.ОтключитьТранслитерацию 	= Ложь;
	
КонецПроцедуры

Функция ДоступноИзменениеПакетаЭДО(ЭлектронныйДокумент, ИдентификаторПакета) Экспорт
	
	ДанныеЭлектронногоДокумента = ИнтерфейсДокументовЭДО.ДанныеФормыПросмотраЭлектронногоДокумента(ЭлектронныйДокумент, Ложь);
	
	ВыборкаСостоянияЭДО = ДанныеЭлектронногоДокумента.ВыборкаСостоянияЭДО;
	Если ВыборкаСостоянияЭДО.Следующий() Тогда
		СостояниеЭДО = ВыборкаСостоянияЭДО.Состояние;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторПакета) Тогда
		СостоянияДокументовПоЭДО = ПакетыДокументовЭДО.СостоянияДокументовПакета(ИдентификаторПакета);
		СостояниеПакета = ПакетыДокументовЭДО.СостояниеПакета(СостоянияДокументовПоЭДО);
	КонецЕсли; 
	
	ДоступноИзменениеПакета = Истина;
	
	Если ЗначениеЗаполнено(СостоянияДокументовПоЭДО) Тогда
		ДоступноИзменениеПакета = ПакетыДокументовЭДО.ДоступноИзменениеПакета(СостоянияДокументовПоЭДО);
	Иначе
		СостоянияДокументовПоЭДО = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СостояниеЭДО);
		ДоступноИзменениеПакета = ПакетыДокументовЭДО.ДоступноИзменениеПакета(СостоянияДокументовПоЭДО);
	КонецЕсли;
	
	Возврат ДоступноИзменениеПакета;
	
КонецФункции  

Функция ПолучитьСписокПрикрепленныхФайлов(ПараметрКоманды) Экспорт
	
	СписокФайлов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыАрхива.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	               |ГДЕ
	               |	CW_ОбъектыАрхива.Объект = &ПараметрКоманды
	               |	И CW_ОбъектыАрхива.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ОбъектыАрхива.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ПараметрКоманды", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокФайлов.Добавить(Выборка.Ссылка);	
	КонецЦикла;  
	
	Возврат СписокФайлов;
	
КонецФункции

Процедура ЗаполнитьВидимостьДобавленияФайловЭДО(Объект, СтруктураВидимости) ЭКспорт
	
	ЕстьФайлы 	= Справочники.CW_ОбъектыАрхива.ЕстьПрикрикрепленныеФайлыОбъекта(Объект.Ссылка);
	Если Не ЕстьФайлы Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Корректировка Тогда
		Если Объект.ФормируетсяАкт и ЗначениеЗаполнено(Объект.ВедомыйДокументКорректировки) Тогда  
			ДобавитьФайлАктКорр = ПолучитьДоступностьИзмененияПакета(Объект.ВедомыйДокументКорректировки);
			СтруктураВидимости.Вставить("ДобавитьФайлАктКорр", ДобавитьФайлАктКорр);
		КонецЕсли;
		Если Объект.ФормируетсяСчетФактура и ЗначениеЗаполнено(Объект.ВедомыйСчетФактураКорректировочный) Тогда
			ДобавитьФайлСчетФактураКорр = ПолучитьДоступностьИзмененияПакета(Объект.ВедомыйСчетФактураКорректировочный);
			СтруктураВидимости.Вставить("ДобавитьФайлСчетФактураКорр", ДобавитьФайлСчетФактураКорр);
		КонецЕсли;
	Иначе
		Если Объект.ФормируетсяСчет и ЗначениеЗаполнено(Объект.ВедомыйСчет) Тогда
			ДобавитьФайлСчет = ПолучитьДоступностьИзмененияПакета(Объект.ВедомыйСчет);
			СтруктураВидимости.Вставить("ДобавитьФайлСчет", ДобавитьФайлСчет);
		КонецЕсли;
		Если Объект.ФормируетсяАкт и ЗначениеЗаполнено(Объект.ВедомыйДокумент) Тогда
			ДобавитьФайлАкт = ПолучитьДоступностьИзмененияПакета(Объект.ВедомыйДокумент);
			СтруктураВидимости.Вставить("ДобавитьФайлАкт", ДобавитьФайлАкт);
		КонецЕсли;
		Если Объект.ФормируетсяСчетФактура и ЗначениеЗаполнено(Объект.ВедомыйСчетФактура) Тогда
			ДобавитьФайлСчетФактура = ПолучитьДоступностьИзмененияПакета(Объект.ВедомыйСчетФактура);
			СтруктураВидимости.Вставить("ДобавитьФайлСчетФактура", ДобавитьФайлСчетФактура);
		КонецЕсли;
	КонецЕсли;     
	
КонецПроцедуры

Функция ПолучитьДоступностьИзмененияПакета(СсылкаНаДокумент)
	
	ПараметрыОткрытия = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыОткрытияЭлектронногоДокумента();
	
	ПараметрыПросмотра = ИнтерфейсДокументовЭДОВызовСервера.ПараметрыПросмотраЭлектронногоДокументаПоОбъектуУчета(
		СсылкаНаДокумент, ПараметрыОткрытия); 
	
	Если Не ЗначениеЗаполнено(ПараметрыПросмотра.ЭлектронныйДокумент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторПакета = CW_ЭДОВызовСервера.ИдентификаторПакетаДокумента(ПараметрыПросмотра.ЭлектронныйДокумент);
	
	Возврат ДоступноИзменениеПакетаЭДО(ПараметрыПросмотра.ЭлектронныйДокумент, ИдентификаторПакета);
	
КонецФункции


	
