
#Область include_core_vo2_Файл_ПодтверждениеЗаказа_301_ГенераторФЭД

&НаКлиенте
Перем Файл_Шаблон_Модуль;

&НаКлиенте
Функция ИсточникДанных_ПолучитьДанныеСтороныПоИмени(Кэш, Вложение, ИмяСтороны) Экспорт
	
	Попытка
		КлючСтороны = ИмяСтороны;
		Если		ИмяСтороны = "Получатель" Тогда
			КлючСтороны = "Поставщик";
		ИначеЕсли	ИмяСтороны = "Отправитель" Тогда
			КлючСтороны = "Покупатель";
		КонецЕсли;
		Возврат Вложение.СтруктураДокумента.Файл.Документ[КлючСтороны];	
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция СформироватьДокументДляГенератора(Кэш, Док, Контекст, Вложение) Экспорт
	Возврат Док;
КонецФункции

//Генератор ФЭД для формирования вложений {
&НаКлиенте
Функция СформироватьРасхождениеДляГенератора(Кэш, Док, Контекст, Вложение) Экспорт
	
	Файл_Шаблон_Модуль = Кэш.ГлавноеОкно.СбисПолучитьФорму("Файл_Шаблон");
	
	ТекДокумент = Док.Файл.Документ;
	ТекДокумент.Вставить("ДефНомИспрСФ",  "-");
	ТекДокумент.Вставить("ДефДатаИспрСФ", "-");
	ТекДокумент.Вставить("ПоФактХЖ", 	Вложение.Название);
	ТекДокумент.Вставить("НаимДокОпр", 	ТекДокумент.Название);
	
	Файл_Шаблон_Модуль.ЗаполнитьПоДокументПараметр(Кэш,  ТекДокумент);
	Файл_Шаблон_Модуль.ЗаполнитьПоДокументОснование(Кэш, ТекДокумент);
	//Файл_Шаблон_Модуль.СформироватьТабличнуюЧастьТабличнаяЧастьДокументаИзменений(Кэш, ТекДокумент);
	
	Файл_Шаблон_Модуль.СформироватьОснование(Кэш, ТекДокумент);
	Файл_Шаблон_Модуль.СформироватьПараметры(Кэш, ТекДокумент);
	
	ТекДокумент.Вставить("Подписант", Новый Структура("ОблПолн, Статус, ОснПолн",
		6,
		1,
		"Должностные обязанности"));
	
	Возврат Док;
	
КонецФункции

//Штатный обработчик строки подстановки
&НаКлиенте
Процедура ОбработчикДанных_ПолучитьТабличнуюЧастьДокумента(Кэш, Генератор, Вложение, ТекСтрока) Экспорт
	Генератор["ТабличныеДанные"].Добавить(СгенерироватьСтрокуТЧ(Кэш, Генератор, Вложение, ТекСтрока));
КонецПроцедуры

&НаКлиенте
Функция СгенерироватьСтрокуТЧ(Кэш, Генератор, Вложение, ТекСтрока)
	Файл_Шаблон_Модуль = Кэш.ГлавноеОкно.СбисПолучитьФорму("Файл_Шаблон");
	
	ТекДанные = Новый Соответствие();
	
	Файл_Шаблон_Модуль.ЗаполнитьТабличныеДанныеЕдИзм(Кэш, ТекСтрока, ТекДанные);
	Файл_Шаблон_Модуль.ЗаполнитьТабличныеДанныеУпаковка(Кэш, ТекСтрока, ТекДанные);
	ЗаполнитьТабличныеДанныеНДСЗначениеНДСТип(Кэш, ТекСтрока, ТекДанные);
	ЗаполнитьТабличныеДанныеАкциз(Кэш, ТекСтрока, ТекДанные);
	
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "GTIN", 			ТекСтрока);
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "Количество", 		ТекСтрока, "Кол_во");		
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "Наименование", 	ТекСтрока, "Название");
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "ПорНомер", 		ТекСтрока);
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "НомНомер", 		ТекСтрока);
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "НомНомерСтор", 	ТекСтрока);
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "Примечание", 		ТекСтрока);
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "СуммаЦен", 		ТекСтрока, "Сумма");
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "СуммаЦенБезНДС",	ТекСтрока, "СуммаБезНал");
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "Цена", 			ТекСтрока);
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "ЦенаБезНДС", 		ТекСтрока);
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "Артикул",	 		ТекСтрока);
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "ВремяДоставки",	ТекСтрока);
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "ДатаДоставки",		ТекСтрока);
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "Идентификатор",	ТекСтрока);
	
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "НомНомерСтор",		ТекСтрока, "КодПоставщика");
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "НомНомер",			ТекСтрока, "КодПокупателя");
	
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "Характеристика", 	ТекСтрока);
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(ТекДанные, "Параметр",			ТекСтрока);
	Если ТекСтрока.Свойство("ПредСтрТабл") Тогда
		ТекДанные.Вставить("ПредСтрТабл", Новый Массив);
		ТекДанные["ПредСтрТабл"].Добавить(СгенерироватьСтрокуТЧ(Кэш, Генератор, Вложение, ТекСтрока.ПредСтрТабл));
	КонецЕсли;
	Возврат ТекДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТабличныеДанныеНДСЗначениеНДСТип(Кэш, Источник, Приемник, Суффикс="")
	
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(Приемник, "НДСТип", "");
	Процент = "";
	
	Если Не Источник.Свойство("НДС") Тогда
		Возврат;
	ИначеЕсли Источник.НДС.Свойство("ТипСтавки") Тогда
		Если Источник.НДС.ТипСтавки = "процент" Тогда
			Процент = "%";
		ИначеЕсли Источник.НДС.ТипСтавки = "текст" Тогда
			Если Источник.НДС.Ставка = "без НДС" Тогда
				Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(Приемник, "НДСТип", Источник.НДС.Ставка);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Источник.НДС.Свойство("Ставка") Тогда
		Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(Приемник, "НДСЗначение", Источник.НДС.Ставка + Процент);
	КонецЕсли;
	Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(Приемник, "СумНДС", Источник.НДС, "Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличныеДанныеАкциз(Кэш, Источник, Приемник) Экспорт
	
	Если Источник.Свойство("Акциз") Тогда
		Если Источник.Акциз.Сумма = "без акциза" Тогда
			Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(Приемник, "Акциз.Название",	Источник.Акциз, "Сумма");
		Иначе
			Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(Приемник, "Акциз.Название",	Источник.Акциз,	"Название");
			Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(Приемник, "Акциз.Ставка",		Источник.Акциз,	"Ставка");
			Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(Приемник, "Акциз.Сумма",		Источник.Акциз,	"Сумма");
			Файл_Шаблон_Модуль.УстановитьЗначениеПоКлючу(Приемник, "Акциз.ТипСтавки",	Источник.Акциз,	"ТипСтавки");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти