#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;	
	КонецЕсли; 
	
	Если РучнаяКорректировка Тогда 
		Возврат; 
	КонецЕсли; 
	
	//Контроль зависимого проведения.
	//Проведение может выполняться только при проведении ведущего документа
	ЗависимоеПроведение = Неопределено;
	ДополнительныеСвойства.Свойство("ЗависимоеПроведение", ЗависимоеПроведение);
	ЗависимоеПроведение = ?(ЗависимоеПроведение=Неопределено, Ложь, ЗависимоеПроведение);
	Если Не ЗависимоеПроведение Тогда
		Возврат; 
	КонецЕсли;  
	
	ПодготовитьДвиженияДокумента();
			
	БазоваяВалюта = CW_Настройки.ВалютаРегламентированногоУчета(); 
	
	СтруктураНастроек  = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Организация, ВидЗадолженности, Дата); 
	
	Если Не СтруктураНастроек["ВедетсяОперативныйУчет"] Тогда
		Возврат;
	КонецЕсли; 

	ВводОстатков = СтруктураНастроек["ВводОстатков"];
	
	Коэффициент = ?(ЭтоВозврат, -1, 1);
	
	//подготовим шапку документа
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = "ВЫБРАТЬ
	                    |	CW_Оплата.Дата КАК Дата,
	                    |	CW_Оплата.Организация КАК Организация,
	                    |	CW_Оплата.Контрагент КАК Контрагент,
	                    |	CW_Оплата.Валюта КАК Валюта,
	                    |	CW_Оплата.Основание КАК Основание,
	                    |	CW_Оплата.ВидЗадолженности КАК ВидЗадолженности,
	                    |	CW_Оплата.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	                    |	CW_Оплата.ПриложениеКДоговору КАК ПриложениеКДоговору,
	                    |	CW_Оплата.Договор КАК Договор
	                    |ИЗ
	                    |	Документ.CW_Оплата КАК CW_Оплата
	                    |ГДЕ
	                    |	CW_Оплата.Ссылка = &Ссылка";
	
	ЗапросШапка.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросШапка.Выполнить();
	
	РезультатШапка = ЗапросШапка.Выполнить();
	ВыборкаШапка = РезультатШапка.Выбрать();
	ВыборкаШапка.Следующий();
	//подготовим шапку документа


	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОплатаОплата.Счет КАК Счет,
	               |	CW_ОплатаОплата.Счет.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_ОплатаОплата.Акт КАК Акт,
	               |	CW_ОплатаОплата.СчетЗадолженности КАК СчетЗадолженности,
	               |	CW_ОплатаОплата.СчетАванса КАК СчетАванса,
	               |	СУММА(CW_ОплатаОплата.Оплата) КАК Оплата,
	               |	СУММА(CW_ОплатаОплата.Оплата_БВ) КАК Оплата_БВ
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.CW_Оплата.Оплата КАК CW_ОплатаОплата
	               |ГДЕ
	               |	CW_ОплатаОплата.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ОплатаОплата.СчетАванса,
	               |	CW_ОплатаОплата.СчетЗадолженности,
	               |	CW_ОплатаОплата.Счет,
	               |	CW_ОплатаОплата.Акт,
	               |	CW_ОплатаОплата.Счет.ПриложениеКДоговору";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Счет КАК Счет,
	               |	ВТ_ДанныеДокумента.СчетЗадолженности КАК СчетЗадолженности,
	               |	ВТ_ДанныеДокумента.СчетАванса КАК СчетАванса,
	               |	СУММА(ВТ_ДанныеДокумента.Оплата) КАК Оплата
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеДокумента.СчетЗадолженности,
	               |	ВТ_ДанныеДокумента.Счет,
	               |	ВТ_ДанныеДокумента.СчетАванса";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.Счет) или ТипЗнч(Выборка.Счет) = тип("ДокументСсылка.CW_Оплата") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская") Тогда
			Движение = Движения.CW_ОплатаИсходящихДокументов.Добавить();
		ИначеЕсли ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская") Тогда
			Движение = Движения.CW_ОплатаВходящихДокументов.Добавить();
		КонецЕсли;
		
		Движение.Период 			= ВыборкаШапка.Дата;
		Движение.Документ 			= Выборка.Счет;
		Движение.СчетЗадолженности 	= Выборка.СчетЗадолженности;
		Движение.ДокументОплаты 	= Ссылка;
		Движение.Всего 				= Выборка.Оплата * Коэффициент;
		Движение.ПризнакАкта 		= Ложь;
		
	КонецЦикла;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Счет КАК Счет,
	               |	ВТ_ДанныеДокумента.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	ВТ_ДанныеДокумента.Акт КАК Акт,
	               |	ВТ_ДанныеДокумента.СчетЗадолженности КАК СчетЗадолженности,
	               |	ВТ_ДанныеДокумента.СчетАванса КАК СчетАванса,
	               |	СУММА(ВТ_ДанныеДокумента.Оплата) КАК Оплата,
	               |	СУММА(ВТ_ДанныеДокумента.Оплата_БВ) КАК Оплата_БВ
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеДокумента.ПриложениеКДоговору,
	               |	ВТ_ДанныеДокумента.Акт,
	               |	ВТ_ДанныеДокумента.Счет,
	               |	ВТ_ДанныеДокумента.СчетЗадолженности,
	               |	ВТ_ДанныеДокумента.СчетАванса";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		

		Если ТипЗнч(Выборка.Счет) <> тип("ДокументСсылка.CW_Оплата")
			И ЗначениеЗаполнено(Выборка.Счет) И ЗначениеЗаполнено(Выборка.Акт) Тогда
			
			Если ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская") Тогда
				Движение = Движения.CW_ОплатаИсходящихДокументов.Добавить();
			ИначеЕсли ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская") Тогда
				Движение = Движения.CW_ОплатаВходящихДокументов.Добавить();
			КонецЕсли;

			Движение.Период 			= ВыборкаШапка.Дата;
			Движение.Документ 			= Выборка.Счет;
			Движение.ДокументБУ 		= Выборка.Акт;
			Движение.СчетЗадолженности 	= Выборка.СчетЗадолженности;
			Движение.ДокументОплаты 	= Ссылка;
			Движение.Всего 				= Выборка.Оплата * Коэффициент;
			Движение.ПризнакАкта 		= Истина;
		КонецЕсли;
		
		Если ВводОстатков Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская") Тогда
			Движение = Движения.CW_ОперативнаяДебиторскаяЗадолженность.ДобавитьРасход();
		ИначеЕсли ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская") Тогда
			Движение = Движения.CW_ОперативнаяКредиторскаяЗадолженность.ДобавитьРасход();
		КонецЕсли;
		
		Движение.Период			= ВыборкаШапка.Дата;
		Движение.Организация	= ВыборкаШапка.Организация; 
		Движение.Валюта			= ВыборкаШапка.Валюта;
		Движение.Контрагент		= ВыборкаШапка.Контрагент;
		Движение.Договор		= ВыборкаШапка.Договор;
		
		//Подсистема.УчетПриложенийДоговоров
		Движение.ПриложениеКДоговору = Выборка.ПриложениеКДоговору;
		//Подсистема.УчетПриложенийДоговоров
		
		Если Не ЗначениеЗаполнено(Выборка.Счет) Тогда
			Движение.Счет = Ссылка; 
			
			//Подсистема.УчетПриложенийДоговоров
			Движение.ПриложениеКДоговору = ПриложениеКДоговору;
			//Подсистема.УчетПриложенийДоговоров
		Иначе
			Движение.Счет = Выборка.Счет;
		КонецЕсли;
		
		Движение.СчетУчета = Выборка.СчетЗадолженности;
		Движение.Всего_Валюта 	= Выборка.Оплата * Коэффициент;
		Движение.Всего 			= Выборка.Оплата_БВ * Коэффициент;
		Движение.ВидОперации	= ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.Оплата");;
		                    	
	КонецЦикла;
		
	// списание курсовых (суммовых) разниц для целей учета оперативной задолженности
	Если ВыборкаШапка.Валюта <> БазоваяВалюта Тогда
		
		Если ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская") Тогда
			РегистрОперативнойЗадолженности = "CW_ОперативнаяДебиторскаяЗадолженность";
		ИначеЕсли ВидЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская") Тогда
			РегистрОперативнойЗадолженности = "CW_ОперативнаяКредиторскаяЗадолженность";
		КонецЕсли;
		
		СтруктураПарамтеров = Новый Структура;
		СтруктураПарамтеров.Вставить("ДатаСреза", 							МоментВремени());
		СтруктураПарамтеров.Вставить("Дата",								ВыборкаШапка.Дата );
		СтруктураПарамтеров.Вставить("Набор",								Движения[РегистрОперативнойЗадолженности]);
		СтруктураПарамтеров.Вставить("ИмяРегистраОперативнойЗадолженности",	РегистрОперативнойЗадолженности );
		
		CW_Финансы.СписаниеКурсовыеПоОперативнойЗадолженности(СтруктураПарамтеров);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
 ПодготовитьДвиженияДокумента();
 
КонецПроцедуры 

Процедура ПодготовитьДвиженияДокумента()
	
	Для Каждого Набор из Движения Цикл
		Набор.Очистить();  
		Набор.Записывать = истина;
	КонецЦикла;   
	
	Движения.Записать();

КонецПроцедуры

 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;	
	КонецЕсли; 

	Если (НЕ Договор.Пустая()) Тогда
		Если (Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) Тогда
			ВидЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская;
		Иначе
			ВидЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская;
		КонецЕсли; 	
	КонецЕсли; 
	// --- 
	
	Если  ЗначениеЗаполнено(Основание) Тогда
		ПредставлениеДокумента = "П/п №" + ?(ЗначениеЗаполнено(Основание.НомерВходящегоДокумента), СокрЛП(Основание.НомерВходящегоДокумента), "<?>") + 
		                         " от " +  ?(ЗначениеЗаполнено(Основание.ДатаВходящегоДокумента), Формат(Основание.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy"), "<?>");
	КонецЕсли;
							 
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);

КонецПроцедуры
	
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = CW_Документы.ПрефиксОрганизации(Организация);
	
КонецПроцедуры

#КонецЕсли
