#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);

КонецПроцедуры
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если РаспределениеЗатрат.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Таблица распределения затрат не заполнена!",,,,Отказ);	
	КонецЕсли;
	
	CW_УчетСобственногоТранспортаСервер.ПодготовитьДвженияКПроведению(ЭтотОбъект);
	
	МассивИменРегистров = CW_УчетСобственногоТранспортаСервер.ПолучитьИспользуемыеРегистры(ЭтотОбъект);
	
	ДанныеДляПроведения = ПодготовитьДанныеДляПроведения(МассивИменРегистров);
	
	CW_УчетСобственногоТранспортаСервер.ЗарегистрироватьДвиженияДокумента(Движения,ДанныеДляПроведения,МассивИменРегистров);	
	
КонецПроцедуры

Функция ПодготовитьДанныеДляПроведения(МассивИменРегистров)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Распределение.Ссылка.Организация КАК Организация,
	               |	Распределение.Ссылка.Дата КАК Период,
	               |	Распределение.ПутевойЛист КАК ПутевойЛист,
	               |	Распределение.Грузоперевозка КАК Грузоперевозка,
	               |	Распределение.ДокументРасходов КАК ДокументРасходов,
	               |	Распределение.Номенклатура КАК Номенклатура,
	               |	Распределение.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	Распределение.Валюта КАК Валюта,
	               |	Распределение.Всего КАК Всего,
	               |	Распределение.Сумма КАК Сумма,
	               |	Распределение.НДС КАК НДС,
	               |	Распределение.Всего_Валюта КАК Всего_Валюта
	               |ИЗ
	               |	Документ.CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.РаспределениеЗатрат КАК Распределение
	               |ГДЕ
	               |	Распределение.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ДанныеДляПроведения = CW_УчетСобственногоТранспортаСервер.ПодготовитьТаблицыДанныхДляПроведения(МассивИменРегистров);
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока 	= ДанныеДляПроведения.CW_РасходыПоГрузоперевозкамТранспортныхСредств.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ЭтоСчет   		= Ложь;
		НоваяСтрока.ЭтоАкт   		= Истина;
		
	КонецЦикла;
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = CW_Документы.ПрефиксОрганизации(Организация);
	
КонецПроцедуры

#КонецЕсли