#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьНазначениеМаршрутаСогласования(МаршрутСогласования, НазначенияМаршрута) Экспорт
	
	Набор = РегистрыСведений.CW_НазначениеМаршрутовСогласования.СоздатьНаборЗаписей();
	Набор.Отбор.МаршрутСогласования.Установить(МаршрутСогласования);
	Набор.Прочитать();
	Набор.Очистить();
	
	Если НазначенияМаршрута.Количество() > 0 Тогда
		Набор.Загрузить(НазначенияМаршрута);
	КонецЕсли;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьПустуюТаблицу() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	               |	CW_НазначениеМаршрутовСогласования.МаршрутСогласования КАК МаршрутСогласования,
	               |	CW_НазначениеМаршрутовСогласования.НазначениеМаршрута КАК НазначениеМаршрута
	               |ИЗ
	               |	РегистрСведений.CW_НазначениеМаршрутовСогласования КАК CW_НазначениеМаршрутовСогласования";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьМаршрутыДоступныеОбъектуСогласования(Объект) Экспорт
	
	мИдентификаторыОбъекта = Новый Массив;
	
	ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект));
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НазначениеМаршрутовСогласования.МаршрутСогласования КАК МаршрутСогласования
	               |ИЗ
	               |	РегистрСведений.CW_НазначениеМаршрутовСогласования КАК CW_НазначениеМаршрутовСогласования
	               |ГДЕ
	               |	CW_НазначениеМаршрутовСогласования.НазначениеМаршрута = &ИдентификаторОбъекта
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_НазначениеМаршрутовСогласования.МаршрутСогласования";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		мИдентификаторыОбъекта.Добавить(Выборка.МаршрутСогласования);
	КонецЦикла;
	
	Возврат мИдентификаторыОбъекта;
	
КонецФункции

#КонецЕсли