
Процедура ОткрытьДиалогРедактированияоформления(Знач Параметр, Знач Значение="", Оповещение) Экспорт
	
	Если Параметр = "Формат" Тогда
		КонструкторФорматнойСтроки = Новый КонструкторФорматнойСтроки;
		КонструкторФорматнойСтроки.Текст = Значение;
		КонструкторФорматнойСтроки.ДоступныеТипы = Новый ОписаниеТипов("Число");
		КонструкторФорматнойСтроки.Показать(Оповещение);   
	КонецЕсли;
	
	Если Параметр = "ЦветФона"
		или Параметр = "ЦветТекста" Тогда
		ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
		ДиалогВыбораЦвета.Цвет = Значение;
		ДиалогВыбораЦвета.Показать(Оповещение);
	КонецЕсли;
	
	Если Параметр = "Шрифт" Тогда
		ДиалогВыбораШрифта = Новый ДиалогВыбораШрифта;
		ДиалогВыбораШрифта.Шрифт = Значение;
		ДиалогВыбораШрифта.Показать(Оповещение);
	КонецЕсли;

КонецПроцедуры 


Функция НуженДиалогРедактированияОформления(Параметр) Экспорт
	
	 МассивПараметров = ПолучитьМассивПарамтеровСДиалогомРедактирования();  
	 Возврат МассивПараметров.Найти(Параметр) <> Неопределено;
	
КонецФункции

Функция ПолучитьМассивПарамтеровСДиалогомРедактирования()
	
	Массив = Новый Массив;
	Массив.Добавить("Формат");
	Массив.Добавить("ЦветФона");
	Массив.Добавить("ЦветТекста");
	Массив.Добавить("Шрифт");
	
	Возврат Массив;   
	
КонецФункции

Процедура СвернутьГруппыПоказателей(Форма) Экспорт

	Элементы = Форма.Элементы; 
	
	ГруппыПараметров = CW_КлючевыеПоказателиСервер.ПолучитьГруппыСправочника();
	Для Каждого Группа из ГруппыПараметров ЦИкл
		Элементы.Список.Свернуть(Группа); 
	КонецЦикла;

КонецПроцедуры

Процедура РазвернутьГруппыПоказателей(Форма) Экспорт

	Элементы = Форма.Элементы; 
	
	ГруппыПараметров = CW_КлючевыеПоказателиСервер.ПолучитьГруппыСправочника();
	Для Каждого Группа из ГруппыПараметров ЦИкл
		Элементы.Список.Развернуть(Группа); 
	КонецЦикла;
	
КонецПроцедуры  
