
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Объект.Обязательное или Не Объект.РасширениеДоступно; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяПриИзменении(Элемент) 
	
	Если Не Объект.Используется 
		И РасширениеУстановлено() Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеФлага", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Обязательное расширение "+СокрЛП(Объект.Ссылка)+" будет удалено. 
		|Функциональность, связанная с обязательным расширением будет недоступна. Продолжить?", Режим, 0); 
		
	Иначе
		ЭтотОбъект.Записать();
	КонецЕсли;   
	
КонецПроцедуры 

&НаКлиенте
Процедура ПродолжитьИзменениеФлага(Результат, Параметры) Экспорт  
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.Используется = Истина;
		Модифицированность = ложь;   
		ЭтотОбъект.Записать();
		Возврат;
	КонецЕсли;
	
	ТребуетсяПерезапуск = Ложь;
	ТекстОшибки = УдалитьРасширениеНаСервере(ТребуетсяПерезапуск);
	Если ПустаяСтрока(ТекстОшибки) и ТребуетсяПерезапуск Тогда
		ЭтотОбъект.Записать();  
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеУдаленияРасширения", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Изменения вступят в силу при следующем входе в программу! Перезагрузить программу?", Режим, 0);
		
	Иначе
		Объект.Используется = Истина;
		Модифицированность = ложь;
		ЭтотОбъект.Записать();
		ПоказатьПредупреждение(, ТекстОшибки);
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Процедура ПослеУдаленияРасширения(Результат, Параметры) Экспорт  
	
	ЭтаФорма.Закрыть();
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		// Попробуем перезапустить
		ЗавершитьРаботуСистемы(Истина,Истина); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УдалитьРасширениеНаСервере(ТребуетсяПерезапуск)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Имя", Объект.ИмяПредопределенныхДанных); 
	
	УстановитьПривилегированныйРежим(Истина);
	НайденныеРасширения = РасширенияКонфигурации.Получить(Отбор); 
	Если НайденныеРасширения.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ИдентификаторыРасширений = Новый Массив;
	ИдентификаторыРасширений.Добавить(НайденныеРасширения[0].УникальныйИдентификатор);
	
   	ТекстОшибки = "";
	Справочники.ВерсииРасширений.УдалитьРасширения(ИдентификаторыРасширений, ТекстОшибки); 
	ТребуетсяПерезапуск = истина;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТекстОшибки;

КонецФункции

&НаСервере
Функция РасширениеУстановлено()
	
	Возврат Справочники.CW_ОбязательныеРасширения.РасширениеУстановлено(Объект.ИмяПредопределенныхДанных);
	
КонецФункции


