
Процедура ЗаписатьВРегистрСтатусыОбработкиПисем() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЭлектронныеПисьмаДляОтправки.Ссылка КАК Ссылка,
	               |	CW_ЭлектронныеПисьмаДляОтправки.УдалитьСтатусОбработки КАК УдалитьСтатусОбработки
	               |ИЗ
	               |	Справочник.CW_ЭлектронныеПисьмаДляОтправки КАК CW_ЭлектронныеПисьмаДляОтправки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РегистрыСведений.CW_СтатусОбработкиЭлектронныхПисем.ЗаписатьСтатусОбработки(Выборка.Ссылка, Выборка.УдалитьСтатусОбработки);
	КонецЦикла;
	
КонецПроцедуры