
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	МассивГруппировок 	= _ПолучитьГруппировкиПоДокументу(ПараметрКоманды);
	Отбор 				= _ПолучитьОтборПоДокументу(ПараметрКоманды);
	Параметры 			= _ПолучитьПараметрыОтчета(ПараметрКоманды);
	
	СтруктураПараметров = Новый Структура("ВнешнийВызов,Отбор,Группировки,Параметры", Истина, Отбор, МассивГруппировок,Параметры);
	ОткрытьФорму("Отчет.CW_ВедомостьПеревыставленияПоСтавкам.Форма.ФормаОтчетаУправляемая", СтруктураПараметров,,Истина);
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьПараметрыОтчета(ПараметрКоманды)
	
	МинимальнаяДата		= НачалоДня(ТекущаяДата());
	МаксимальнаяДата	= КонецДня(ТекущаяДата());
	
	Если (ТипЗнч(ПараметрКоманды)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
		
		МинимальнаяДатаПоГрузоперевозкам	= НачалоДня(ТекущаяДата());
		МинимальнаяДатаПоРасходам 			= НачалоДня(ТекущаяДата());
		
		мГрузопереовзки = CW_Финансы.ГрузоперевозкиДокумента(ПараметрКоманды);
		
		//Получение минимальной даты грузопереовозок
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	МИНИМУМ(CW_Грузоперевозки.ДатаСделкиФ) КАК Дата
		               |ПОМЕСТИТЬ ВТ_ДатаГрузоперевозок
		               |ИЗ
		               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
		               |ГДЕ
		               |	CW_Грузоперевозки.Ссылка В(&мГрузопереовзки)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МИНИМУМ(CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов.Дата) КАК Дата
		               |ПОМЕСТИТЬ ВТ_ДатаРасходов
		               |ИЗ
		               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
		               |ГДЕ
		               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
		               |	И НЕ CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов = ЗНАЧЕНИЕ(Документ.CW_РасходыПоГрузоперевозке.ПустаяСсылка)
		               |	И CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.Проведен
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ВТ_ДатаГрузоперевозок.Дата, &МинимальнаяДата) КАК Дата
		               |ПОМЕСТИТЬ ВТ_ДАТЫ
		               |ИЗ
		               |	ВТ_ДатаГрузоперевозок КАК ВТ_ДатаГрузоперевозок
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ВТ_ДатаРасходов.Дата, &МинимальнаяДата)
		               |ИЗ
		               |	ВТ_ДатаРасходов КАК ВТ_ДатаРасходов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ВТ_ДАТЫ.Дата КАК Дата
		               |ИЗ
		               |	ВТ_ДАТЫ КАК ВТ_ДАТЫ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата
		               |АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("мГрузопереовзки"	, мГрузопереовзки);
		Запрос.УстановитьПараметр("Ссылка"			, ПараметрКоманды);
		
		Запрос.УстановитьПараметр("МинимальнаяДата"	, МинимальнаяДата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() тогда
			Если Выборка.Дата <> null Тогда
				МинимальнаяДатаПоГрузоперевозкам = Выборка.Дата;
			Конецесли;		
		КонецЕсли;

		МинимальнаяДата 	= Мин(МинимальнаяДата,МинимальнаяДатаПоГрузоперевозкам);
		МаксимальнаяДата	= МАКС(ПараметрКоманды.ДатаАкта, ПараметрКоманды.ДатаСчета, ПараметрКоманды.Дата);
		
	ИначеЕсли (ТипЗнч(ПараметрКоманды)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда 
		
		//получение минимальной даты
		ДатаДокумента 	= ПараметрКоманды.Дата; 
		ДатаСчета 		= ПараметрКоманды.Дата;
		ДатаАкта 		= ПараметрКоманды.Дата;
		ДатаСФ 			= ПараметрКоманды.Дата;
		
		Если ПараметрКоманды.ПредъявленСчет И ПараметрКоманды.ДатаСчета <> Дата(1,1,1)  Тогда
			ДатаСчета = ПараметрКоманды.ДатаСчета;
		КонецЕсли; 
		Если ПараметрКоманды.ПредъявленАкт И ПараметрКоманды.ДатаАкта <> Дата(1,1,1)  Тогда
			ДатаАкта = ПараметрКоманды.ДатаАкта;
		КонецЕсли; 
		Если ПараметрКоманды.ПредъявленСФ И ПараметрКоманды.ДатаСФ <> Дата(1,1,1) Тогда
			ДатаСФ	= ПараметрКоманды.ДатаСФ;
		КонецЕсли; 
		
		МинимальнаяДата = Мин(ДатаДокумента,ДатаСчета,ДатаАкта,ДатаСФ);
		
		//получение максимальной даты
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.Дата КАК Дата
		               |ИЗ
		               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
		               |ГДЕ
		               |	CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов = &Ссылка
		               |	И CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.Проведен
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ
		               |АВТОУПОРЯДОЧИВАНИЕ";

		
		Запрос.УстановитьПараметр("Ссылка"			, ПараметрКоманды);
		Запрос.УстановитьПараметр("МаксимальнаяДата", МаксимальнаяДата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() тогда
			Если Выборка.Дата <> null Тогда
				МаксимальнаяДата = Выборка.Дата;
			Конецесли;		
		КонецЕсли;
		
	ИначеЕсли (ТипЗнч(ПараметрКоманды)=Тип("ДокументСсылка.CW_ЗакрытиеГрузоперевозки")) Тогда 
		
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ЗакрытиеГрузоперевозкиРасходы.РасходыПоГрузоперевозке.Дата КАК Дата,
		               |	CW_ЗакрытиеГрузоперевозкиРасходы.РасходыПоГрузоперевозке КАК Документ
		               |ПОМЕСТИТЬ ВТ_ДатыДокументов
		               |ИЗ
		               |	Документ.CW_ЗакрытиеГрузоперевозки.Расходы КАК CW_ЗакрытиеГрузоперевозкиРасходы
		               |ГДЕ
		               |	CW_ЗакрытиеГрузоперевозкиРасходы.Ссылка = &ПараметрКоманды
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	CW_ЗакрытиеГрузоперевозкиДоходы.ДоходыПоГрузоперевозке.Дата,
		               |	CW_ЗакрытиеГрузоперевозкиДоходы.ДоходыПоГрузоперевозке
		               |ИЗ
		               |	Документ.CW_ЗакрытиеГрузоперевозки.Доходы КАК CW_ЗакрытиеГрузоперевозкиДоходы
		               |ГДЕ
		               |	CW_ЗакрытиеГрузоперевозкиДоходы.Ссылка = &ПараметрКоманды
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	CW_ЗакрытиеГрузоперевозки.Дата,
		               |	CW_ЗакрытиеГрузоперевозки.Ссылка
		               |ИЗ
		               |	Документ.CW_ЗакрытиеГрузоперевозки КАК CW_ЗакрытиеГрузоперевозки
		               |ГДЕ
		               |	CW_ЗакрытиеГрузоперевозки.Ссылка = &ПараметрКоманды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МИНИМУМ(ВТ_ДатыДокументов.Дата) КАК Дата
		               |ИЗ
		               |	ВТ_ДатыДокументов КАК ВТ_ДатыДокументов";
		
		Запрос.УстановитьПараметр("ПараметрКоманды" ,ПараметрКоманды);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		МинимальнаяДата = ПараметрКоманды.Дата; 
		Если Выборка.Следующий() Тогда
			Если Выборка.Дата <> null Тогда
				МинимальнаяДата = Выборка.Дата;
			Конецесли;
		КонецЕсли;
		
	КонецЕсли; 
	
	НачалоПериода = МинимальнаяДата;
	КонецПериода  = ?(МаксимальнаяДата<МинимальнаяДата, КонецДня(МинимальнаяДата), МаксимальнаяДата);
	
	Параметры = Новый Структура;
	Параметры.Вставить("НачалоПериода"	, НачалоДня(НачалоПериода));
	Параметры.Вставить("КонецПериода"	, КонецДня(КонецПериода));
	
	Возврат(Параметры);
	
	// --- 
КонецФункции

&НаСервере
Функция _ПолучитьГруппировкиПоДокументу(ПараметрКоманды)
	
	МассивГруппировок = Новый Массив;
	
	МассивГруппировок.Добавить("Контрагент");
	МассивГруппировок.Добавить("Договор");
	МассивГруппировок.Добавить("Грузоперевозка");
	МассивГруппировок.Добавить("Номенклатура");
	
	Возврат(МассивГруппировок);
	
КонецФункции

&НаСервере
Функция _ПолучитьОтборПоДокументу(ПараметрКоманды)
	
	Отбор = Новый Структура;
	
	
	Если (ТипЗнч(ПараметрКоманды)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
		Отбор.Вставить("Грузоперевозки"	, CW_Финансы.ГрузоперевозкиДокумента(ПараметрКоманды));
		Отбор.Вставить("Номенклатура"	, CW_Финансы.НоменклатураДокумента(ПараметрКоманды));
		
		Отбор.Вставить("Контрагент"		, ПараметрКоманды.Контрагент);
		Отбор.Вставить("Договор"		, ПараметрКоманды.Договор);
		
	ИначеЕсли (ТипЗнч(ПараметрКоманды)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда
		
		Отбор.Вставить("Грузоперевозки"	, CW_Финансы.ГрузоперевозкиДокумента(ПараметрКоманды));
		Отбор.Вставить("Номенклатура"	, CW_Финансы.НоменклатураДокумента(ПараметрКоманды));
		
		ТабПокупателей = ПараметрКоманды.Услуги.Выгрузить(,"Покупатель");
		ТабПокупателей.Свернуть("Покупатель");
		
		Отбор.Вставить("Контрагенты"	, ТабПокупателей.ВыгрузитьКолонку("Покупатель"));
		
		ТабДоговоров = ПараметрКоманды.Услуги.Выгрузить(,"ДоговорПокупателя");
		ТабДоговоров.Свернуть("ДоговорПокупателя");
		Отбор.Вставить("Договоры"	, ТабДоговоров.ВыгрузитьКолонку("ДоговорПокупателя"));
		
	ИначеЕсли (ТипЗнч(ПараметрКоманды)=Тип("ДокументСсылка.CW_ЗакрытиеГрузоперевозки")) Тогда
		
		Запрос = Новый Запрос;
		запрос.Текст = "ВЫБРАТЬ
		               |	CW_ЗакрытиеГрузоперевозкиРасходы.Грузоперевозка КАК Грузоперевозка,
		               |	CW_ЗакрытиеГрузоперевозкиРасходы.Номенклатура КАК Номенклатура
		               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
		               |ИЗ
		               |	Документ.CW_ЗакрытиеГрузоперевозки.Расходы КАК CW_ЗакрытиеГрузоперевозкиРасходы
		               |ГДЕ
		               |	CW_ЗакрытиеГрузоперевозкиРасходы.Ссылка = &ПараметрКоманды
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	CW_ЗакрытиеГрузоперевозкиДоходы.Грузоперевозка,
		               |	CW_ЗакрытиеГрузоперевозкиДоходы.Номенклатура
		               |ИЗ
		               |	Документ.CW_ЗакрытиеГрузоперевозки.Доходы КАК CW_ЗакрытиеГрузоперевозкиДоходы
		               |ГДЕ
		               |	CW_ЗакрытиеГрузоперевозкиДоходы.Ссылка = &ПараметрКоманды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ДанныеДокумента.Грузоперевозка КАК Грузоперевозка
		               |ИЗ
		               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_ДанныеДокумента.Грузоперевозка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура
		               |ИЗ
		               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_ДанныеДокумента.Номенклатура";
		
		Запрос.УстановитьПараметр("ПараметрКоманды" ,ПараметрКоманды);
		
		ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
		
		РезультатЗапросаГрузоперевозка 	= ПакетРезультатовЗапроса[1];
		РезультатЗапросаНоменклатура 	= ПакетРезультатовЗапроса[2];
	
		Если НЕ РезультатЗапросаГрузоперевозка.Пустой() Тогда
			мГрузоперевозки = РезультатЗапросаГрузоперевозка.Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
			Отбор.Вставить("Грузоперевозки"	, мГрузоперевозки);
		КонецЕсли;
		
		
		Если НЕ РезультатЗапросаНоменклатура.Пустой() Тогда
			мНоменклатура = РезультатЗапросаНоменклатура.Выгрузить().ВыгрузитьКолонку("Номенклатура");
			Отбор.Вставить("Номенклатура"	, мНоменклатура);
		КонецЕсли;

		Отбор.Вставить("Контрагент"		, ПараметрКоманды.Контрагент);
		Отбор.Вставить("Договор"		, ПараметрКоманды.Договор);
		
	КонецЕсли;

	
	Возврат(Отбор);
	
КонецФункции
