
&НаСервере
Процедура саб_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.Услуги.Количество() > 0 Тогда
		Для Каждого Стр Из Объект.Услуги Цикл
			Если Не ЗначениеЗаполнено(Стр.ПорядокОтражения) Тогда
			 	Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
				Стр.Количество = 1;
			 КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура саб_ПриОткрытииПосле(Отказ)
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.Услуги.Количество() > 0 Тогда		
	//	Для Каждого Стр Из Объект.Услуги Цикл
	//		Если Не ЗначениеЗаполнено(Стр.ПорядокОтражения) Тогда
	//			Стр.Количество = 1;
	//		 	Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты");
	//			ПриИзмененииУслугиПорядокОтражения();
	//		 КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;	
КонецПроцедуры
