//Устарела. Слеудет использовать CW_ПереводыСервер.ПолучитьПеревод()
Функция Перевести(ОбъектПеревода, Язык, ОсновнойЯзык = Неопределено, ВозвращатьПредставлениеОбъектаПриОтсутствииПеревода = Истина) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_Переводы.ОбъектПеревода КАК ОбъектПеревода,
	|	CW_Переводы.Перевод КАК Перевод
	|ИЗ
	|	РегистрСведений.CW_Переводы КАК CW_Переводы
	|ГДЕ
	|	CW_Переводы.ОбъектПеревода = &ОбъектПеревода
	|	И CW_Переводы.Язык = &Язык";
	
	Запрос.УстановитьПараметр("ОбъектПеревода"	, ОбъектПеревода);
	Запрос.УстановитьПараметр("Язык"			, Язык); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Перевод; 
	Иначе
		Если ВозвращатьПредставлениеОбъектаПриОтсутствииПеревода Тогда
			Возврат Строка(ОбъектПеревода);
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции
  