&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// список доступных группировок
	СписокГруппировок.Очистить();
	СписокГруппировок.Добавить("Организация", "Организация", Ложь);
	СписокГруппировок.Добавить("Контрагент", "Контрагент", Ложь);
	СписокГруппировок.Добавить("Договор", "Договор", Ложь);
	СписокГруппировок.Добавить("Валюта", "Валюта", Ложь);
	СписокГруппировок.Добавить("Грузоперевозка", "Грузоперевозка", Ложь);
	//СписокГруппировок.Добавить("ДокументВзаиморасчетов", "Документ взаиморасчетов", Ложь);
	СписокГруппировок.Добавить("ПорядокОтражения", "Порядок отражения", Ложь);
	СписокГруппировок.Добавить("Номенклатура", "Номенклатура", Ложь);
	СписокГруппировок.Добавить("СтавкаНДС", "Ставка НДС", Ложь);
	
	// --- 
	
	ЭтаФорма.КлючТекущихПользовательскихНастроек = "";
	// --- 
	Если (Параметры.Свойство("Грузоперевозка")) Тогда
		
		Отчет.ВнешнийВызов = Истина;
		ПФ = Новый Структура("Отбор,Группировки");
		ПФ.Отбор = Новый Структура("Грузоперевозка", Параметры.Грузоперевозка);
		ПФ.Группировки = Новый Массив;
		ПФ.Группировки.Добавить("Грузоперевозка");
		ПФ.Группировки.Добавить("Контрагент");
		ПФ.Группировки.Добавить("ДокументВзаиморасчетов");
		Отчет.АдресВнешнихНастроек = ПоместитьВоВременноеХранилище(ПФ, ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли; 
	Если (Параметры.Свойство("Заказ")) Тогда
		
		Отчет.ВнешнийВызов = Истина;
		ПФ = Новый Структура("Отбор,Группировки");
		ПФ.Отбор = Новый Структура("Заказ", Параметры.Заказ);
		ПФ.Группировки = Новый Массив;
		ПФ.Группировки.Добавить("Грузоперевозка");
		ПФ.Группировки.Добавить("Контрагент");
		ПФ.Группировки.Добавить("ДокументВзаиморасчетов");
		Отчет.АдресВнешнихНастроек = ПоместитьВоВременноеХранилище(ПФ, ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли; 

	//Работа с буфером обмена
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена());
	//Работа с буфером обмена
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НаДату = ТекущаяДата();
	
	_ВосстановитьСтандартныеНастройки();
	
	_ВосстановитьСеансовуюНастройку();
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если Отчет.ВнешнийВызов Тогда
		_ОбработатьВнешниеПараметры();
		Сформировать(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_НеАктированыеИсходящиеСчета.ПолучитьМакет("Схема").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаСервере
Процедура _ОбработатьВнешниеПараметры()
	
	СП = ПолучитьИзВременногоХранилища(Отчет.АдресВнешнихНастроек);
	
	_Группировки = _сф.ст_ПолучитьСвойство(СП,"Группировки");
	Если (_Группировки <> Неопределено) Тогда
		Группировки.Очистить();
		Для каждого _Группировка Из _Группировки Цикл
			Нстр = Группировки.Добавить();
			Нстр.ИмяПоля = _Группировка;
			Нстр.Представление = _Группировка;
			Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		КонецЦикла; 
	КонецЕсли; 
	// --- 
	_Отбор = _сф.ст_ПолучитьСвойство(СП,"Отбор");
	Если (_Отбор <> Неопределено) Тогда
		
		Отчет.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		Для каждого КЗ Из _Отбор Цикл
			
			Если (КЗ.Ключ = "Заказ") Тогда
				МассивГрузоперевозок = CW_Мониторинг.ГрузоперевозкиЗаказа(_Отбор[КЗ.Ключ]); 
				СписокГрузоперевозок = Новый СписокЗначений;
				СписокГрузоперевозок.ЗагрузитьЗначения(МассивГрузоперевозок);
				_УФС.ДобавитьОтбор(Отчет.КомпоновщикНастроек.Настройки.Отбор,"Грузоперевозка",ВидСравненияКомпоновкиДанных.ВСписке,СписокГрузоперевозок);				
			Иначе
				_УФС.ДобавитьОтбор(Отчет.КомпоновщикНастроек.Настройки.Отбор,КЗ.Ключ,,_Отбор[КЗ.Ключ]);				
			КонецЕсли; 
			
		КонецЦикла;	
		
	КонецЕсли; 
	
	Если (ПокВсего = Ложь И ПокСумма = Ложь И ПокНДС = Ложь) Тогда
		
		ПокВсего = Истина;
		
	КонецЕсли; 
	
	//_ВосстановитьСеансовуюНастройку();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть = Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка    = Ложь;
	Иначе
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка    = Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка    = Истина;
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Если НЕ Отчет.ВнешнийВызов Тогда
		ИмяНастройки = "Сеансовая";
	Иначе
		ИмяНастройки = "Сеансовая_ВнешнийВызов";
	КонецЕсли;
	// --- 
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя + "_" + ИмяНастройки;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("ПокСумма", ПокСумма);
			СеансоваяНастройка.Свойство("ПокНДС", ПокНДС);
			СеансоваяНастройка.Свойство("ПокВсего", ПокВсего);			
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			// Отбор
			НастройкиКД = "";
			СеансоваяНастройка.Свойство("Отбор", НастройкиКД);
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			Для Каждого СтрОтбор из НастройкиКД.Отбор.Элементы Цикл
				НовОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовОтбор, СтрОтбор);
			КонецЦикла;	
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("ПокСумма", ПокСумма);
	СтруктураНастройки.Вставить("ПокНДС", ПокНДС);
	СтруктураНастройки.Вставить("ПокВсего", ПокВсего);
	СтруктураНастройки.Вставить("Группировки", Группировки.Выгрузить());
	СтруктураНастройки.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Если НЕ Отчет.ВнешнийВызов Тогда
		ИмяНастройки = "Сеансовая";
	Иначе
		ИмяНастройки = "Сеансовая_ВнешнийВызов";
	КонецЕсли;
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя + "_" + ИмяНастройки;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда
		СписокПолей.Добавить("Сумма");
		СписокПолей.Добавить("НДС");
		СписокПолей.Добавить("Всего");
		//СписокПолей.Добавить("ДокументВзаиморасчетов");		
		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
		      
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ПокСумма И НЕ ПокНДС И НЕ ПокВсего Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного показателя!");
		Возврат;		
	КонецЕсли;
	
	Если Группировки.Количество() = 0 Тогда
		_УФК.ВывестиПредупреждение("Не выбрано ни одной группировки!");
		Возврат;				
	КонецЕсли;	
	
	_Настройка(Истина);
	СформироватьОтчет();
	ОбработатьОтчет();
		
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
		
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	
	// --- 
	_СохранитьСеансовуюНастройку();
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	
	Настройки = _сф.ст_Создать("НаДату,ПокСумма,ПокНДС,ПокВсего,Группировки");
	Настройки.НаДату = НаДату;
	Настройки.ПокСумма = ПокСумма;
	Настройки.ПокНДС = ПокНДС;
	Настройки.ПокВсего = ПокВсего;
	Настройки.Группировки = Группировки.Выгрузить();
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор));
	
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "0:00:00", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "23:59:59", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сумма", "Сумма", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "НДС", "НДС", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Всего", "Всего", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(Результат,"Неактированые исходящие счета");
	//УправлениеКолонтитулами
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
	СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	
	ДоступныеДействия = Новый Массив();
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
	
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("ПокСумма", ПокСумма);
	Настройки.ДополнительныеСвойства.Вставить("ПокНДС", ПокНДС);
	Настройки.ДополнительныеСвойства.Вставить("ПокВсего", ПокВсего);
	//Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки.Выгрузить());
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); // ДанныеФормыКоллекция
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.КомандаБуфераОбменаВставить.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуфераОбменаВставить(Команда)
	КоличествоСтрок = БуфераОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БуфераОбменаВставитьНаСервере()
	
	Возврат CW_РаботаСБуферомОбмена.УстановитьОтборКомпановщикаПоБуферуОбмена(Отчет.КомпоновщикНастроек);

КонецФункции
//Работа с буфером обмена