
#Область ПрограммныйИнтерфейс

// Возвращает параметры для открытия формы, из которой вызывается команда формы-источника.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма-источник
// 
// Возвращаемое значение:
//  Структура - Параметры открытия зависимых форм:
// * Организация - СправочникСсылка.Организации
// * Период - Дата
// * СформироватьПриОткрытии - Булево
// * НачалоПериода - Дата
// * КонецПериода - Дата
//
Функция ПараметрыОткрытияЗависимыхФорм(Форма) Экспорт
	
	Результат = НовыеПараметрыОткрытияФорм();
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Организация") Тогда
		Результат.Организация = Форма.Организация;
	Иначе
		Результат.СформироватьПриОткрытии = Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ТекущийДень") Тогда
		Результат.Период = Форма.ТекущийДень;
		Результат.НачалоПериода = НачалоГода(Результат.Период);
		Результат.КонецПериода = КонецКвартала(Результат.Период);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Период") Тогда
		Результат.Период = Форма.Период;
		Результат.НачалоПериода = НачалоГода(Форма.Период);
		Результат.КонецПериода = КонецКвартала(Форма.Период);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчик открытия формы 1С-Отчетность.
// 
// Параметры:
//  ПараметрыФормы - Структура - Параметры формы
//  ПараметрыВыполненияКоманды - Структура - см. НовыеПараметрыОткрытияФормы1СОтчетность
//  Раздел - ПеречислениеСсылка.СтраницыЖурналаОтчетность - Раздел в форме 1С-Отчетность
//
Процедура ОбработчикОткрытияФормы1СОтчетность(ПараметрыФормы, ПараметрыВыполненияКоманды) Экспорт
	
	ПараметрыФормы.Вставить("Раздел", ПараметрыВыполненияКоманды.Раздел);
	
	ОткрытьФорму("ОбщаяФорма.РегламентированнаяОтчетность",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		"1С-Отчетность",
		ПараметрыВыполненияКоманды.Окно);
	
	Оповестить("Открытие формы 1С-Отчетность", ПараметрыФормы);
	
КонецПроцедуры

// Возвращает параметры открытия формы 1С-Отчетность.
// 
// Параметры:
//  Источник - ФормаКлиентскогоПриложения - Форма, из которой выполняется команда
//  Окно - ОкноКлиентскогоПриложения - Окно, в котором открывается форма
//  Раздел - ПеречислениеСсылка.СтраницыЖурналаОтчетность, Неопределено - Раздел, на котором нужно открыть форму 1С-Отчетность
// 
// Возвращаемое значение:
//  Структура - Новые параметры открытия формы 1С-Отчетность:
// * Источник - ФормаКлиентскогоПриложения - Форма, из которой выполняется команда
// * Окно - ОкноКлиентскогоПриложения - Окно, в котором открывается форма
// * Раздел - ПеречислениеСсылка.СтраницыЖурналаОтчетность - Раздел, на котором нужно открыть форму 1С-Отчетность
//
Функция НовыеПараметрыОткрытияФормы1СОтчетность(Источник, Окно, Раздел = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Источник", Источник); // ФормаКлиентскогоПриложения
	Результат.Вставить("Окно", Окно); // ОкноКлиентскогоПриложения
	Результат.Вставить("Раздел", ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Отчеты"));
	Если Раздел <> Неопределено Тогда
		Результат.Раздел = Раздел;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Открывает подчиненную форму в уже открытом окне.
//  Предварительно ищет уже открытую форму по переданному имени и ключу уникальности в кэше
//  и если такая есть, то активизирует ее.
//
// Параметры:
//  ИмяОткрываемойФормы - Строка - полное имя открываемой формы 
//  Форма - ФормаКлиентскогоПриложения - форма, в окне которой требуется открыть подчиненную форму
//  ПараметрыФормы - Структура - параметры формы
//  КлючУникальности - Строка - ключ уникальности открываемой формы.
//                              Требуется для открытия нескольких форм с одинаковым именем
//  ОткрытыеФормы - Соответствие, Неопределено - кэш открытых форм, ускоряет поиск ранее открытых форм
//
Процедура ОткрытьФормуВОкнеФормы(ИмяОткрываемойФормы, Форма, ПараметрыФормы = Неопределено, КлючУникальности = "", ОткрытыеФормы = Неопределено) Экспорт
	
	//В мобильном клиенте все формы открываются в одном окне-экране.
	//Вернуться в родительскую форму из подчиненной невозможно.
	Если МобильныйКлиентБПКлиент.ЭтоМобильныйКлиент() Тогда
		ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, Форма);
		Возврат;
	КонецЕсли;
	
	Если ОткрытыеФормы = Неопределено Тогда
		ОткрытыеФормы = Новый Соответствие;
	КонецЕсли;
	
	// При открытии форм внутри существующего окна ключ уникальности не используется для поиска уже открытой
	// подчиненной формы, поэтому перед открытием проверяем наличие открытой ранее формы через кэш ОткрытыеФормы
	ОткрываемаяФорма = ОткрытыеФормы.Получить(ИмяОткрываемойФормы + КлючУникальности);
	
	Если ОткрываемаяФорма = Неопределено Тогда
		
		ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
		ПараметрыОткрытия.ИмяФормы = ИмяОткрываемойФормы;
		ПараметрыОткрытия.Владелец = Форма;
		ПараметрыОткрытия.Уникальность = КлючУникальности;
		ПараметрыОткрытия.Окно = Форма.Окно;
		ПараметрыОткрытия.Вставить("ОткрытыеФормы", ОткрытыеФормы);
		
		ПараметрыОткрытия.ОбработчикОткрытияФормы = Новый ОписаниеОповещения(
			"ПослеПоказаФормыОжидания", ЭтотОбъект, ПараметрыОткрытия);
		ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
		
	Иначе
		
		ОткрытьФорму(ОткрываемаяФорма, Форма.Окно);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПослеПоказаФормыОжидания(ПараметрыФормы, ПараметрыОткрытия) Экспорт
	
	ОткрываемаяФорма = ПолучитьФорму(ПараметрыОткрытия.ИмяФормы,
		ПараметрыФормы,
		ПараметрыОткрытия.Владелец,
		ПараметрыОткрытия.Уникальность,
		ПараметрыОткрытия.Окно,
		ПараметрыОткрытия.НавигационнаяСсылка);
	
	ОткрытьФорму(ОткрываемаяФорма, ПараметрыОткрытия.Окно);
	
	ПараметрыОткрытия.ОткрытыеФормы.Вставить(ПараметрыОткрытия.ИмяФормы + ПараметрыОткрытия.Уникальность,
		ОткрываемаяФорма);
	
КонецПроцедуры

Функция НовыеПараметрыОткрытияФорм()
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	Результат.Вставить("Период", '00010101');
	Результат.Вставить("НачалоПериода", '00010101');
	Результат.Вставить("КонецПериода", '00010101');
	Результат.Вставить("СформироватьПриОткрытии", Истина);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти