&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("РежимСозданиеЗаказа", 					РежимСозданиеЗаказа);
	Параметры.Свойство("РежимСозданияГрузоперевозок", 			РежимСозданияГрузоперевозок);
	Параметры.Свойство("РежимЗаполненияБюджетов", 				РежимЗаполненияБюджетов); 
	
	Параметры.Свойство("ДоступенРежимНеСоздаватьГрузоперевозки",ДоступенРежимНеСоздаватьГрузоперевозки);
	
	Параметры.Свойство("Заказ",							Заказ);
	Параметры.Свойство("Заявка",						Заявка);
	
	Параметры.Свойство("Количество",					Количество);
	Параметры.Свойство("ТипПеревозки",					ТипПеревозки);
	
	ИспользованиеБюджетирования = ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования") ;
	
	ДоступностьБюджета = ЗначениеЗаполнено(Заявка);
	
	ВидимостьБюджета = Истина;
	Если РежимСозданиеЗаказа Тогда
		Заголовок = "Создать заказ";  
//		ВидимостьБюджета = Ложь;
	КонецЕсли;
	Если РежимЗаполненияБюджетов Тогда
		Заголовок = "Заполнить бюджеты";  
	КонецЕсли;
	Если РежимСозданияГрузоперевозок Тогда
		Заголовок = "Создать грузоперевозки";
	КонецЕсли;
	
	Если ДоступенРежимНеСоздаватьГрузоперевозки Тогда
		Элементы.РежимВводаКоличества.СписокВыбора.Вставить(0, 2, "Не создавать");
	КонецЕсли;
	
	Элементы.Количество.Доступность 					= РежимСозданиеЗаказа или РежимСозданияГрузоперевозок;
	Элементы.РежимВводаКоличества.Видимость 			= РежимСозданиеЗаказа или РежимСозданияГрузоперевозок;
	
	Элементы.НадписьЗаполненияБюджета.Видимость 		= РежимЗаполненияБюджетов и ДоступностьБюджета;
	
	Элементы.ГруппаБюджет.Видимость 					= ИспользованиеБюджетирования и ДоступностьБюджета и ВидимостьБюджета;
	//Элементы.ВерсияБюджетаГрузоперевозки.Доступность 	= (РежимСозданиеЗаказа или РежимСозданияГрузоперевозок) И ИспользованиеБюджетирования;
	
	Элементы.ГруппаРежимКопированияБюджета.Видимость   =  РежимЗаполненияБюджетов;
	
	Если ИспользованиеБюджетирования и ДоступностьБюджета Тогда
		
		ТолькоАктуальные = Истина;
		ТолькоАктуальныеНаСервере();  
		
		Параметры.Свойство("КопироватьБюджет",				КопироватьБюджет);
		
		СписокВариантовБюджетаЗаполнитьНаСервере();
		
		ВерсияБюджетаГрузоперевозки = ПредопределенноеЗначение("Справочник.CW_ВерсииБюджетов.Основная");
		Элементы.ГруппаПараметрыКопированияБюджета.Видимость = КопироватьБюджет;  
	КонецЕсли;
	
	ПроверятьНомерКонтейнера = CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь, "ПроверятьНомерКонтейнера");

	Элементы.КоманднаяПанельПроверкаНомеров.Видимость = ПроверятьНомерКонтейнера;

	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьБюджетПриИзменении(Элемент)
	
	Элементы.ГруппаПараметрыКопированияБюджета.Видимость = КопироватьБюджет;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОК(Команда)  
	
	КопируемыеБюджеты = Новый Массив;
	Если КопироватьБюджет Тогда 
		Для Каждого ЭлементСписка из СписокВариантовБюджета Цикл
			Если ЭлементСписка.Пометка Тогда
				КопируемыеБюджеты.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
	Если КопироватьБюджет и  КопируемыеБюджеты.Количество() = 0  Тогда
		ПоказатьПредупреждение(, "Не выбрано ни одного варианта бюджета заявки!");
		Возврат;
	КонецЕсли; 
	
	МассивПредставлений = ПолучитьМассивИменПредставлений();
	
	Если РежимВводаКоличества = 1 и МассивПредставлений.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Не введено ни одного представления грузоперевозки", 60, "Ошибка");
		Возврат;
	КонецЕсли;
	Если РежимВводаКоличества = 0 и Количество = 0 Тогда
		ПоказатьПредупреждение(,"Не указано количество грузоперевозок", 60, "Ошибка");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивПредставлений", МассивПредставлений);   
	ДополнительныеПараметры.Вставить("КопируемыеБюджеты", 	КопируемыеБюджеты);   
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗаполнениеКонтейнеров", ЭтотОбъект, ДополнительныеПараметры);
	
	Если РежимВводаКоличества = 1 Тогда
		
		ЕстьОшибки = ПроверитьНомераКонтейнеровНаСервере();
		Если ЕстьОшибки Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			ПоказатьВопрос(Оповещение, "Есть ошибки номеров контейнеров. Продолжить?", Режим, 0);	
		Иначе
			ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
		КонецЕсли;
		
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеКонтейнеров(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;     
	
	мБюджеты = Новый Массив;
	
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Заказ", 			Заказ);
	СтруктураПараметров.Вставить("Заявка", 			Заявка);
	СтруктураПараметров.Вставить("ТипПеревозки", 	ТипПеревозки);
	
	СтруктураПараметров.Вставить("СоздатьЗаказ", 			РежимСозданиеЗаказа);
	СтруктураПараметров.Вставить("ЗаполненияБюджетов", 		РежимЗаполненияБюджетов);   
	
	СтруктураПараметров.Вставить("СозданиеГрузоперевозок", 	РежимСозданияГрузоперевозок);
	
	СтруктураПараметров.Вставить("РежимВводаКоличества", 		РежимВводаКоличества);
	
	СтруктураПараметров.Вставить("ВводПоПредставлениям", 		РежимВводаКоличества = 1);
	СтруктураПараметров.Вставить("ПредставленияГрузоперевозок", ДополнительныеПараметры.МассивПредставлений);
	СтруктураПараметров.Вставить("Количество", 					?(РежимВводаКоличества = 1,ДополнительныеПараметры.МассивПредставлений.Количество(), Количество));
	
	СтруктураПараметров.Вставить("КопироватьБюджет",				КопироватьБюджет);
	СтруктураПараметров.Вставить("РежимКопированияБюджета",			РежимКопированияБюджета); 
	СтруктураПараметров.Вставить("АдресВариантовБюжетаЗаявки",		ПолучитьАдресВариантовБюджетаЗаявки());
	СтруктураПараметров.Вставить("ВерсияБюджетаГрузоперевозки",		ВерсияБюджетаГрузоперевозки);
	
	ЭтаФорма.Закрыть(СтруктураПараметров);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьАдресВариантовБюджетаЗаявки()
	
	СписокЗначений = новый СписокЗначений;

	Для Каждого ЭлементСписка из СписокВариантовБюджета Цикл
		Если ЭлементСписка.Пометка Тогда
			СписокЗначений.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(СписокЗначений, Новый УникальныйИдентификатор); 
	
КонецФункции



&НаКлиенте
Функция ПолучитьМассивИменПредставлений()
	
	МассивПредсталений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПредсталений, Символы.ПС, Истина);
	
	Массив = Новый Массив;
	Для Каждого Текст из МассивПредсталений Цикл
		Текст = УбратьСимволПС(Текст);
		Массив.Добавить(Текст);
	КонецЦикла; 
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура РежимВводаКоличестваПриИзменении(Элемент)

	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()

	Элементы.Количество.Видимость				= РежимВводаКоличества = 0;
	Элементы.ТекстПредсталений.Видимость 		= РежимВводаКоличества = 1;
	Элементы.КомандаВведеноКоличество.Видимость	= РежимВводаКоличества = 1;
	Элементы.РазделитьПоСловам.Видимость		= РежимВводаКоличества = 1;
	Элементы.КомандаПроверитьНомера.Видимость   = РежимВводаКоличества = 1;
	
	Элементы.НадписьЗаполненияБюджета.Видимость = РежимКопированияБюджета = 0;
	Элементы.НадписьЗаполненияБюджетаДополнение.Видимость = РежимКопированияБюджета = 1;

	//Элементы.ГруппаБюджет.Видимость = РежимВводаКоличества<>2;

	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьКоличество(Команда)
	
	МассивИмен =  ПолучитьМассивИменПредставлений();
	
	ПоказатьПредупреждение(,"Введено представлений грузоперевозок: "+Формат(МассивИмен.Количество(), "ЧДЦ=0; ЧН='<Отсутствует>'"));
	
КонецПроцедуры

&НаКлиенте
Процедура РазделитьПоСловам(Команда)

	РазделитьПоСловамНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РазделитьПоСловамНаСервере()
	
	ТекстПредсталений = СтрЗаменить(ТекстПредсталений, ";", Символы.ПС);
	ТекстПредсталений = СтрЗаменить(ТекстПредсталений, " ", Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗаполненияБюджетаПриИзменении(Элемент)
	
	Элементы.НадписьЗаполненияБюджета.Видимость = РежимКопированияБюджета = 0;
	Элементы.НадписьЗаполненияБюджетаДополнение.Видимость = РежимКопированияБюджета = 1;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаПроверитьНомера(Команда)
	
	ЕстьОшибки = ПроверитьНомераКонтейнеровНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНомераКонтейнеровНаСервере()
	
	ЕстьОшибки = Ложь;
	Если Не ПроверятьНомерКонтейнера Тогда
		Возврат ЕстьОшибки;
	КонецЕсли;

	РазделитьПоСловамНаСервере(); 
	
	МассивОшибок = Новый Массив;   
	
	МассивЭлементов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПредсталений, Символы.ПС, Истина);
	Для Каждого ПроверяемаяСтрока из МассивЭлементов Цикл
		Успешно = CW_Мониторинг.НомерКонтейнераКорректный(ПроверяемаяСтрока);
		Если Не Успешно Тогда 
			МассивОшибок.Добавить(ПроверяемаяСтрока);
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла; 
	
	Если МассивОшибок.Количество() > 0 Тогда    
		СписокСлов = СтрСоединить(МассивОшибок, ", ");
		СписокСлов = УбратьСимволПС(СписокСлов);
		Сообщить("Некорректные номера контейнеров: "+СписокСлов);
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	
КонецФункции 

&НаСервере
Функция УбратьСимволПС(Знач Текст)
	
	Возврат СтрЗаменить(Текст, Символы.ПС, "");
	
КонецФункции

&НаКлиенте
Процедура ТолькоАктуальные(Команда) 
	
	ТолькоАктуальные = Не ТолькоАктуальные;
	ТолькоАктуальныеНаСервере();     
	СписокВариантовБюджетаЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТолькоАктуальныеНаСервере()
	
	Элементы.ТолькоАктуальные.Пометка = ТолькоАктуальные;
	
КонецПроцедуры


&НаСервере
Процедура СписокВариантовБюджетаЗаполнитьНаСервере()

	СписокВариантовБюджета.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВариантыБюджетовПоЗаявкам.Ссылка КАК ВариантБюджета,
	               |	ЛОЖЬ КАК Пометка,
	               |	CW_ВариантыБюджетовПоЗаявкам.СрокДействия КАК СрокДействия
	               |ИЗ
	               |	Справочник.CW_ВариантыБюджетовПоЗаявкам КАК CW_ВариантыБюджетовПоЗаявкам
	               |ГДЕ
	               |	CW_ВариантыБюджетовПоЗаявкам.Владелец = &Владелец
	               |	//ТолькоАктульные";
	
	Если ТолькоАктуальные Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ТолькоАктульные","И (CW_ВариантыБюджетовПоЗаявкам.СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
	              											 |			ИЛИ CW_ВариантыБюджетовПоЗаявкам.СрокДействия >= &СрокДействия)");
		
		Запрос.УстановитьПараметр("СрокДействия", НачалоДня(ТекущаяДата()));
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("Владелец", Заявка);  
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		ПредставлениеЭлемента 	= СокрЛП(Выборка.ВариантБюджета) + " (действует до: "+ Формат(Выборка.ВариантБюджета.СрокДействия, "ДЛФ=D; ДП=бессрочно")+")";
		НоваяСтрока 			= СписокВариантовБюджета.Добавить(Выборка.ВариантБюджета, ПредставлениеЭлемента);
	КонецЦикла;
	
КонецПроцедуры






