#Область СобытияФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр = (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеНастроекМониторинга"));
	Если (ЭтаФорма.ТолькоПросмотр) Тогда
		
		Элементы.ДПГ.ТолькоПросмотр = Истина;
		Элементы.ДПГ.ИзменятьСоставСтрок=Ложь;
		Элементы.ДПГ.ПоложениеКоманднойПанели=ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		
	КонецЕсли; 
	
	// --- 
	
	Если (Объект.ГруппыПараметровГрузоперевозки.Количество()=0) Тогда
		
		НастоящийОбъект = РеквизитФормыВЗначение("Объект");
		НастоящийОбъект.ПроверитьИерархиюПараметров();
		ЗначениеВРеквизитФормы(НастоящийОбъект,"Объект");
		
	КонецЕсли; 
	
	СвойстваПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
	АдресСвойствПараметров = ПоместитьВоВременноеХранилище(СвойстваПараметров,УникальныйИдентификатор);
	// --- 
	
	ДПГ_ПоказыватьКоличествоПараметров = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ПоказыватьКоличествоПараметровВГруппах");
	// --- 
	
	ИспользуютсяЗаявки =  ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаявок");
	ИспользуютсяЗаказы =  ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов") и ПолучитьФункциональнуюОпцию("CW_ИспользуютсяПараметрыВЗаказах");
	
	Элементы.ЗаказПеренестиВСоставПараметровЗаявки.Видимость 			= ИспользуютсяЗаявки;
	Элементы.ГрузоперевозкаПеренестиВСоставПараметровЗаявки.Видимость 	= ИспользуютсяЗаявки;

	Элементы.ЗаявкиПеренестиВСоставПараметровЗаказа.Видимость 			= ИспользуютсяЗаказы;
	Элементы.ГрузоперевозкиПеренестиВСоставПараметровЗаказа.Видимость 	= ИспользуютсяЗаказы;
	
	ТекущийИндексСтраницы = Неопределено;
	Если ИспользуютсяЗаявки Тогда
		Элементы.ИндексСтраницыПараметров.СписокВыбора.Добавить(1,"Заявки");
		ТекущийИндексСтраницы = 1;
	КонецЕсли;
	
	Если ИспользуютсяЗаказы Тогда
		Элементы.ИндексСтраницыПараметров.СписокВыбора.Добавить(2,"Заказы");
		Если ТекущийИндексСтраницы = Неопределено Тогда
			ТекущийИндексСтраницы = 2;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ИндексСтраницыПараметров.СписокВыбора.Добавить(0,"Грузоперевозки");
		Если ТекущийИндексСтраницы = Неопределено Тогда
			ТекущийИндексСтраницы = 0;
		КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокаСобственногоТранспорта") Тогда
		Элементы.ИндексСтраницыПараметров.СписокВыбора.Добавить(3, "Путевые листы");
	КонецЕсли;
	
	ИндексСтраницыПараметров = ТекущийИндексСтраницы;
	
	Элементы.СтраницаПараметровЗаявок.Видимость = ИспользуютсяЗаявки;
	Элементы.ИндексСтраницыПараметров.Видимость = Элементы.ИндексСтраницыПараметров.СписокВыбора.Количество() > 1;
	
	// Предопределенные значения параметров
	ВидСубъекта = Перечисления.CW_ВидыСубъектовСвязанныхПараметров.ТипПеревозки;
	CW_Отчеты.ДобавитьОтборКомпоновкиДанных("ВидСубъекта", ВидСравненияКомпоновкиДанных.Равно, ВидСубъекта, Истина, ПредопределенныеЗначенияПараметров.Отбор);
	// --- 
	_УправлениеЭлементамиФормы_КонтрольЗаполнения();
	_УправлениеЭлементамиФормы_ПредопределенныеЗначенияПараметров();
	_УправлениеЭлементамиФормы_Бюджет();
	
	ОбработатьВыборСтраницы();
	
	Если Параметры.Ключ.Пустая() Тогда
		//Времено на переходный период
		//Для новых объектов уже используется новый механизм хранения данных
		СлужебныйВыполненПереход = Истина;
		//Времено на переходный период
		
		//Предопределенные значения реквизитов шапки заказа и грузоперевозки
		ЗаполнитьСписокРеквизитовШапкиНаСервере();
		//Предопределенные значения реквизитов шапки заказа и грузоперевозки
	КонецЕсли;
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	УстановитьДоступностьСтраницПараметров();
	
	ЗаполнитьРеквизитыПутевыхЛистов();
	
	УстановитьВидимостьПараметра();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьПредопределенныеЗначенияРеквизитов(ТекущийОбъект);
	
КонецПроцедуры   


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаТаблицы из Объект.ПредопределенныеЗначенияРеквизитов Цикл
		ИндексСтроки = Объект.ПредопределенныеЗначенияРеквизитов.Индекс(СтрокаТаблицы); 
		
		СтрокаОбъекта = ТекущийОбъект.ПредопределенныеЗначенияРеквизитов.Получить(ИндексСтроки); 
		
		ХранимоеЗначение = СтрокаТаблицы.ЗначениеРеквизита;
		Если ТипЗнч(СтрокаТаблицы.ЗначениеРеквизита) = тип("Строка") Тогда
			ХранимоеЗначение = СтрокаТаблицы.ЗначениеСтроковогоТипа;	
		КонецЕсли;
		
		СтрокаОбъекта.ХранилищеЗначения = Новый ХранилищеЗначения(ХранимоеЗначение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПредопределенныеЗначенияРеквизитов(ТекущийОбъект);
	
	_УправлениеЭлементамиФормы_ПредопределенныеЗначенияПараметров();
	
	УстановитьДоступностьСтраницПараметров();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если (Элементы.СтраницаПараметровГрузоперевозок.Видимость) Тогда
		ДПГ_Обновить();	
		КонтрольЗаполненияРеквизитов = ЛОЖЬ;
		ПоказатьКонтрольЗаполненияГП();
	КонецЕсли; 
	// --- 
	Если (Элементы.СтраницаПараметровЗаявок.Видимость) Тогда
		ДПЗ_Обновить();	
		КонтрольЗаполненияЗаявки = ЛОЖЬ;
		ПоказатьКонтрольЗаполненияЗаявки();
	КонецЕсли;
	
	Если (Элементы.СтраницаПараметровЗаказа.Видимость) Тогда
		ДПЗаказ_Обновить();	
		КонтрольЗаполненияЗаказа = ЛОЖЬ;
		ПоказатьКонтрольЗаполненияЗаказа();;
	КонецЕсли;

	ДПГ_ВосстановитьСостояниеСвертки();
	ДПЗ_ВосстановитьСостояниеСвертки();
	ДПЗаказ_ВосстановитьСостояниеСвертки();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры

#КонецОбласти  


&наСервере
Процедура ЗаполнитьРеквизитыПутевыхЛистов()
	
	СписокРеквизитовПутевогоЛиста.Очистить();
	
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.Номер"),,,БиблиотекаКартинок.CW_ЭлементСписка);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.Дата"),,,БиблиотекаКартинок.CW_ЭлементСписка);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.Прицеп"),,,БиблиотекаКартинок.CW_ЭлементСписка);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ВыездФакт"),,,БиблиотекаКартинок.CW_ЭлементСписка);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ВозвращениеФакт"),,,БиблиотекаКартинок.CW_ЭлементСписка);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ТранспортноеСредство"),,,БиблиотекаКартинок.CW_ЭлементСписка);
	
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_Водитель"),,,БиблиотекаКартинок.CW_КолонкиВставить);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_АдресПогрузки"),,,БиблиотекаКартинок.CW_КолонкиВставить);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_АдресРазгрузки"),,,БиблиотекаКартинок.CW_КолонкиВставить);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_Груз"),,,БиблиотекаКартинок.CW_КолонкиВставить);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ВесГруза"),,,БиблиотекаКартинок.CW_КолонкиВставить);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаПогрузки"),,,БиблиотекаКартинок.CW_КолонкиВставить);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаРазгрузки"),,,БиблиотекаКартинок.CW_КолонкиВставить);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаВыезда"),,,БиблиотекаКартинок.CW_КолонкиВставить);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаВозвращения"),,,БиблиотекаКартинок.CW_КолонкиВставить);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_Пробег"),,,БиблиотекаКартинок.CW_КолонкиВставить);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ПробегСГрузом"),,,БиблиотекаКартинок.CW_КолонкиВставить);
	СписокРеквизитовПутевогоЛиста.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ПробегПорожний"),,,БиблиотекаКартинок.CW_КолонкиВставить);

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьСтраницПараметров()
	
	Элементы.СтраницыПараметров.ТолькоПросмотр = Объект.Ссылка.Пустая();
	
	//Страница параметры ГП
	Элементы.ДПГ_ДобавитьГруппу.Доступность 					= Не Объект.Ссылка.Пустая();
	Элементы.ДПГ_ПереместитьНаУровеньВверх.Доступность   		= Не Объект.Ссылка.Пустая();
	Элементы.ДПГ_ПереместитьВверх.Доступность           		= Не Объект.Ссылка.Пустая();
	Элементы.ДПГ_ПереместитьВниз.Доступность             		= Не Объект.Ссылка.Пустая();
	Элементы.ДПГ_ПоказатьКонтрольЗаполнения.Доступность    		= Не Объект.Ссылка.Пустая();
	Элементы.ДПГДПГ_ВосстановитьСверткуДерево.Доступность    	= Не Объект.Ссылка.Пустая(); 
	Элементы.ДПГ_СвернутьВсе.Доступность    					= Не Объект.Ссылка.Пустая();
	Элементы.ДПГ_РазвернутьВсе.Доступность    					= Не Объект.Ссылка.Пустая();
	
	Элементы.МенюГрузоперевозкаПеренестиПараметры.Доступность    		= Не Объект.Ссылка.Пустая();
	Элементы.ГрузоперевозкаПеренестиВСоставПараметровЗаявки.Доступность = Не Объект.Ссылка.Пустая();
	Элементы.ГрузоперевозкиПеренестиВСоставПараметровЗаказа.Доступность = Не Объект.Ссылка.Пустая();
	
	
	//Страница Параметры заявок
	Элементы.ДПЗ_ПоказатьКонтрольЗаполнения.Доступность		= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗДПЗ_ПереместитьВниз.Доступность				= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗДПЗ_ПереместитьВверх.Доступность			= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗДПЗ_ПереместитьНаУровеньВверх.Доступность	= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗДПЗ_ВосстановитьСверткуДерево.Доступность	= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗ_СвернутьВсе.Доступность		= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗ_РазвернутьВсе.Доступность		= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗ_ДобавитьГруппу.Доступность		= Не Объект.Ссылка.Пустая();
	
	Элементы.МенюЗаявкаПеренестиПараметры.Доступность					= Не Объект.Ссылка.Пустая();
	Элементы.ЗаявкиПеренестиВСоставПараметровЗаказа.Доступность			= Не Объект.Ссылка.Пустая();
	Элементы.ЗаявкиПеренестиВСоставПараметровГрузопереовзки.Доступность	= Не Объект.Ссылка.Пустая();
	
	
	//Страница параметров заказа
	Элементы.ДПЗаказ_ДобавитьГруппу.Доступность	= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗаказ_РазвернутьВсе.Доступность		= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗаказ_СвернутьВсе.Доступность		= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗаказ_ВосстановитьСверткуДерево.Доступность	= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗаказ_ПереместитьНаУровеньВверх.Доступность	= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗаказ_ПереместитьВверх.Доступность	= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗаказ_ПереместитьВниз.Доступность	= Не Объект.Ссылка.Пустая();
	Элементы.ДПЗаказ_ПоказатьКонтрольЗаполнения.Доступность = Не Объект.Ссылка.Пустая();
	
	Элементы.МенюЗаказПеренестиПараметры.Доступность   					= Не Объект.Ссылка.Пустая();
	Элементы.ЗаказПеренестиВСоставПараметровЗаявки.Доступность   		= Не Объект.Ссылка.Пустая();
	Элементы.ЗаказПеренестиВСоставПараметровГрузопереовзки.Доступность  = Не Объект.Ссылка.Пустая();
	
КонецПроцедуры

// --- 


// ---------------------------------------------------------------------------- 

#Область ФормированиеДерева_Грузоперевозка 

&НаКлиенте
Процедура ДПГ_Обновить()
	// --- 
	
	_ДПГ_Обновить();
	ДПГ_ВосстановитьСостояниеСвертки();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПГ_Обновить()
	// --- 
	
	// получаем текущие группы 		
	Элементы.ДПГ.НачальноеОтображениеДерева=НачальноеОтображениеДерева.НеРаскрывать;
	ДПГ.ПолучитьЭлементы().Очистить();
	// ---------------------------------------------------------------------------- 
	Если (Объект.ГруппыПараметровГрузоперевозки.Количество()=0) Тогда
		Корень = Объект.ГруппыПараметровГрузоперевозки.Добавить();
		Корень.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(Новый Массив);
	Иначе
		Корень = Объект.ГруппыПараметровГрузоперевозки[0];	
	КонецЕсли; 
	Если (НЕ Корень.Раскрывать) Тогда
		Корень.Раскрывать = Истина;
	КонецЕсли; 
	// --- 
	НаборПравДляПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресСвойствПараметров);
	// --- 
	ТаблицаКонтроляГрупп = _ДПГ_ТаблицаКонтроляГрупп();
	ТаблицаКонтроляПараметров = _ДПГ_ТаблицаКонтроляПараметров(НаборПравДляПараметров);
	// --- 
	_ДПГ_СформироватьЭлементыДерева(Корень,Неопределено,НаборПравДляПараметров,СвойстваПараметров, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
	
	// после формирования проверяем, нет ли потерянных групп, 
	// если есть, то засовываем их в корень и переформировываем дерево
	// сообщаем о потерянных группах
	
	МассивНеучтенныхГрупп = _сф.к_НайтиСтроки(ТаблицаКонтроляГрупп,Новый Структура("Видимость",Ложь));
	Если (МассивНеучтенныхГрупп.Количество() <> 0) Тогда
		
		// переносим каждую в корень
		Для каждого КонтрольнаяСтрокаГруппы Из МассивНеучтенныхГрупп Цикл
			
			_ДПГ_ДобавитьЭлементГруппы(КонтрольнаяСтрокаГруппы.Идентификатор, Корень);
			
		КонецЦикла; 
		// --- 
		// переформировываем дерево
		ТаблицаКонтроляГрупп = _ДПГ_ТаблицаКонтроляГрупп();
		ТаблицаКонтроляПараметров = _ДПГ_ТаблицаКонтроляПараметров(НаборПравДляПараметров);
		_ДПГ_СформироватьЭлементыДерева(Корень,Неопределено,НаборПравДляПараметров,СвойстваПараметров, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
		// --- 
		ДПГ_ТекущаяГруппа=0;
		ДПГ_ТекущийПараметр = Неопределено;
		
	КонецЕсли; 
	
	// далее проверяем, нет ли потерянных/новых параметров, если есть
	// то добавляем их в корень и снова переформировываем дерево
	
	МассивНеучтенныхПараметров = _сф.к_НайтиСтроки(ТаблицаКонтроляПараметров,Новый Структура("Видимость",Ложь));
	Если (МассивНеучтенныхПараметров.Количество() <> 0) Тогда
		
		// переносим каждую в корень
		Для каждого КонтрольнаяСтрокаПараметра Из МассивНеучтенныхПараметров Цикл
			_ДПГ_ДобавитьЭлементГруппы(КонтрольнаяСтрокаПараметра.Параметр, Корень);
		КонецЦикла; 
		// переформировываем дерево
		ТаблицаКонтроляГрупп = _ДПГ_ТаблицаКонтроляГрупп();
		ТаблицаКонтроляПараметров = _ДПГ_ТаблицаКонтроляПараметров(НаборПравДляПараметров);
		_ДПГ_СформироватьЭлементыДерева(Корень,Неопределено,НаборПравДляПараметров,СвойстваПараметров, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
		// --- 
		ДПГ_ТекущаяГруппа=0;
		ДПГ_ТекущийПараметр = Неопределено;
		
	КонецЕсли; 
	
	//КонтрольЗаполнения
	
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДПГ_ТаблицаКонтроляГрупп()
	// --- 
	
	ТаблицаКонтроляГрупп = Объект.ГруппыПараметровГрузоперевозки.Выгрузить();
	ТаблицаКонтроляГрупп.Колонки.Добавить("Видимость");
	ТаблицаКонтроляГрупп.ЗаполнитьЗначения(Ложь,"Видимость");
	СтрокаКорня = _сф.к_ПервыйЭлемент(ТаблицаКонтроляГрупп);
	СтрокаКорня.Видимость = Истина;
	// --- 
	Возврат(ТаблицаКонтроляГрупп);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПГ_ТаблицаКонтроляПараметров(НаборПрав)
	// --- 
	
	ТаблицаКонтроляПараметров = Объект.ПараметрыГрузоперевозки.Выгрузить();
	// --- 
	ТаблицаКонтроляПараметров.Колонки.Добавить("Видимость");
	ТаблицаКонтроляПараметров.ЗаполнитьЗначения(Ложь,"Видимость");
	// --- 
	МассивУдаляемыхСтрок = Новый Массив;
	Для каждого СтрокаКонтроля Из ТаблицаКонтроляПараметров Цикл
		
		СтруктураПрав = НаборПрав["п_"+_сф.КлючПоСсылке(СтрокаКонтроля.Параметр)];
		Если (НЕ СтруктураПрав.Просмотр) Тогда
			
			МассивУдаляемыхСтрок.Добавить(СтрокаКонтроля);
			
		КонецЕсли;
		
	КонецЦикла; 
	_сф.к_УдалитьЭлементыПоМассиву(ТаблицаКонтроляПараметров, МассивУдаляемыхСтрок);
	// --- 
	Возврат(ТаблицаКонтроляПараметров);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПГ_СформироватьЭлементыДерева(Группа,СтрокаДерева = Неопределено, НаборПрав, Свойства, ТаблицаКонтроляГрупп=Неопределено, ТаблицаКонтроляПараметров=Неопределено)
	// --- 
	
	Если (СтрокаДерева <> Неопределено) Тогда
		КоллекцияЭлементовДерева = СтрокаДерева.ПолучитьЭлементы();
	Иначе
		КоллекцияЭлементовДерева = ДПГ.ПолучитьЭлементы();		
	КонецЕсли; 
	КоллекцияЭлементовДерева.Очистить();
	// --- 
	
	МассивПодчиненныхЭлементов = ЗначениеИзСтрокиВнутр(Группа.ИдентификаторыВедомых);
	МассивИдентификаторовДляУдаления = Новый Массив;
	Для каждого ПодчиненныйЭлемент Из МассивПодчиненныхЭлементов Цикл
		
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда  
			ПодчиненныйЭлементОбъект = ПодчиненныйЭлемент.ПолучитьОбъект();
			Если ПодчиненныйЭлементОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;                                                                                            
		Конецесли;

		ЭтоГруппа = (ТипЗнч(ПодчиненныйЭлемент)=Тип("Число"));
		// --- 	
		Если (ЭтоГруппа) Тогда
			
			ОтборПоИдентификаторуГруппы = Новый Структура("Идентификатор",ПодчиненныйЭлемент);
			СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,ОтборПоИдентификаторуГруппы);
			// проверяем, что еще не выведена и записываем признак формирования
			Если (ТаблицаКонтроляГрупп <> Неопределено) Тогда
				
				КонтрольнаяСтрокаГруппы = _сф.к_НайтиСтроку(ТаблицаКонтроляГрупп, ОтборПоИдентификаторуГруппы);
				Если (КонтрольнаяСтрокаГруппы.Видимость) Тогда
					
					// ахтунг, зацикливание
					МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
					Продолжить;
					
				Иначе
					
					КонтрольнаяСтрокаГруппы.Видимость = Истина;
					
				КонецЕсли; 
				
			КонецЕсли; 
			// --- 
			Нстр = КоллекцияЭлементовДерева.Добавить();
			_ДПГ_ЗаполнитьСтрокуДереваПоГруппе(Нстр, СтрокаГруппы);
			
			// --- 
			ДПГ_УстановитьСостояниеСверткиСтроки(Нстр.ПолучитьИдентификатор(), Нстр.ИдентификаторГруппы, СтрокаГруппы.Раскрывать);
		
			_ДПГ_СформироватьЭлементыДерева(СтрокаГруппы, Нстр, НаборПрав, Свойства, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
			// --- 
			// устанавливаем признак разрешения удаления для группы
			УдалениеРазрешено = Истина;
			
			КоллекцияПодчиненных = Нстр.ПолучитьЭлементы();
			КоличествоСформированныхПодчиненных = КоллекцияПодчиненных.Количество();
			КоличествоПодчиненных = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых).Количество();
			Если (КоличествоСформированныхПодчиненных <> КоличествоПодчиненных) Тогда
				УдалениеРазрешено = Ложь;
			Иначе
				Для каждого ПодчиненнаяСтрока Из КоллекцияПодчиненных Цикл
					Если (НЕ ПодчиненнаяСтрока.УдалениеРазрешено) Тогда
						УдалениеРазрешено = Ложь;
						Прервать;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
			Нстр.УдалениеРазрешено = УдалениеРазрешено;
			
		КонецЕсли; 
		// --- 
		Если (НЕ ЭтоГруппа) Тогда
			
			// проверим права
			СтруктураПрав = НаборПрав["п_"+_сф.КлючПоСсылке(ПодчиненныйЭлемент)];
			Если (НЕ СтруктураПрав.Просмотр) Тогда
				
				Продолжить;
				
			КонецЕсли;
			// --- 
			Если (ТаблицаКонтроляПараметров <> Неопределено) Тогда
				
				ОтборПоПараметру = Новый Структура("Параметр",ПодчиненныйЭлемент);
				КонтрольнаяСтрокаПараметра = _сф.к_НайтиСтроку(ТаблицаКонтроляПараметров, ОтборПоПараметру);
				Если (КонтрольнаяСтрокаПараметра = Неопределено) Тогда
					
					МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
					Продолжить;
					
				Иначе
					Если (КонтрольнаяСтрокаПараметра.Видимость) Тогда
						
						// ахтунг, параметр уже в какой-то группе, удаляем из текущей
						МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
						Продолжить;
						
					Иначе
						
						КонтрольнаяСтрокаПараметра.Видимость = Истина;
						
					КонецЕсли;
				КонецЕсли; 
				
			КонецЕсли; 
			// --- 
			Нстр = КоллекцияЭлементовДерева.Добавить();
			СП = Свойства.Получить(ПодчиненныйЭлемент);
			_ДПГ_ЗаполнитьСтрокуДереваПоПараметру(Нстр, ПодчиненныйЭлемент, СП, СтруктураПрав);
			
		КонецЕсли; 
		
		
	КонецЦикла; 
	// --- 
	Если (МассивИдентификаторовДляУдаления.Количество() <> 0) Тогда
		
		Для каждого ИдентификаторДляУдаления Из МассивИдентификаторовДляУдаления Цикл
			
			МассивПодчиненныхЭлементов.Удалить(МассивПодчиненныхЭлементов.Найти(ИдентификаторДляУдаления));
			
		КонецЦикла; 
		Группа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивПодчиненныхЭлементов);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Процедура _ДПГ_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева,Параметр,СвойстваПараметра=Неопределено, СтруктураПрав=Неопределено)
	// --- 
	
	Если (СвойстваПараметра = Неопределено) Тогда
		СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресСвойствПараметров);
		СвойстваПараметра = СвойстваПараметров.Получить(Параметр);
		Если (СвойстваПараметра = Неопределено) Тогда
			СвойстваПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
			СвойстваПараметра = СвойстваПараметров.Получить(Параметр);
		КонецЕсли; 
	КонецЕсли; 
	
	Если (СтруктураПрав <> Неопределено) Тогда
		
		СтрокаДерева.УдалениеРазрешено = СтруктураПрав.Редактирование;
		
	КонецЕсли; 
	
	СтрокаДерева.Параметр = Параметр;	
	СтрокаДерева.Параметр_Представление = СвойстваПараметра.Наименование;	
	Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
		СтрокаДерева.ИндексКартинки = 2;				
	ИначеЕсли (СвойстваПараметра.ДинамическийПараметр) Тогда 
		СтрокаДерева.ИндексКартинки = 3;
	Иначе
		СтрокаДерева.ИндексКартинки = 1;
	КонецЕсли; 
	// --- 
	СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,Новый Структура("Параметр", Параметр));
	СтрокаДерева.КонтрольЗаполнения        = СтрокаПараметра.КонтрольЗаполнения;
	СтрокаДерева.КонтрольЗаполненияРасходы = СтрокаПараметра.КонтрольЗаполненияРасходы;
	СтрокаДерева.КонтрольЗаполненияДоходы  = СтрокаПараметра.КонтрольЗаполненияДоходы;
	
	//Новый механизм
	СтрокаДерева.ИдентификаторВладельца = СтрокаПараметра.ИдентификаторВладельца;
	//Новый механизм

	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПГ_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы)
	// --- 
	
	СтрокаДерева.ЭтоГруппа = Истина;
	СтрокаДерева.НаименованиеГруппы = СтрокаГруппы.Наименование;
	СтрокаДерева.Параметр_Представление = СтрокаГруппы.Наименование;
	СтрокаДерева.ИдентификаторГруппы = СтрокаГруппы.Идентификатор;
	СтрокаДерева.УдалениеРазрешено = Истина;
	// --- 
	СтрокаДерева.ИндексКартинки = 0;
	
	//Новый механизм
	СтрокаДерева.ИдентификаторВладельца = СтрокаГруппы.ИдентификаторВладельца;
	//Новый механизм
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ВыполнитьПодгрузкуСтрок(ИдентификаторСтрокиРодителя)
	// --- 
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
	СтрокаДерева.ПолучитьЭлементы().Очистить();
	_ДПГ_ВыполнитьПодгрузку(ИдентификаторСтрокиРодителя);
	// --- 
	
	ДПГ_ВосстановитьСостояниеСверткиСтроки(ИдентификаторСтрокиРодителя);
	// --- 
	Элементы.ДПГ.Развернуть(ИдентификаторСтрокиРодителя);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПГ_ВыполнитьПодгрузку(ИдентификаторСтрокиРодителя)
	// --- 
	
	СтрокаРодителя = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
	СтрокаГруппа = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор",СтрокаРодителя.ИдентификаторГруппы));
	// --- 
	НаборПравДляПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресСвойствПараметров);
	_ДПГ_СформироватьЭлементыДерева(СтрокаГруппа,СтрокаРодителя, НаборПравДляПараметров, СвойстваПараметров);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область СобытияДерева_Грузоперевозка

&НаКлиенте
Процедура ДПГ_ПриАктивизацииСтроки(Элемент)
	
	// --- 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ПередНачаломИзменения(Элемент, Отказ)
	
	Если НЕ (Элемент.ТекущийЭлемент = Элементы.ДПГ_КонтрольЗаполнения 
		ИЛИ Элемент.ТекущийЭлемент = Элементы.ДПГ_КонтрольЗаполненияРасходы 
		ИЛИ Элемент.ТекущийЭлемент = Элементы.ДПГ_КонтрольЗаполненияДоходы) 
		Тогда
		
		Отказ = Истина;
		Идентификатор = Элементы.ДПГ.ТекущаяСтрока;
		СтрокаДПГ = ДПГ.НайтиПоИдентификатору(Идентификатор);
		Если (СтрокаДПГ.ЭтоГруппа) Тогда
			
			ДоступнаСменаРежимаСвертки 	= ДПГ_ПроверитьСостояниеВедомых(СтрокаДПГ);
			СостояниеГруппы  			= ПолучитьНастройкуРаскрытияГруппы("ГруппыПараметровГрузоперевозки", СтрокаДПГ.ИдентификаторГруппы);
			
			ПараметрыФормы		= Новый Структура("НаименованиеГруппы,ГруппаРазвернута,РежимГрузоперевозки,ДоступнаСменаРежимаСвертки", СтрокаДПГ.НаименованиеГруппы,СостояниеГруппы, Истина,ДоступнаСменаРежимаСвертки);
			оо 					= Новый ОписаниеОповещения("ДПГ_ОбработатьВводНаименованияГруппы",ЭтотОбъект, Новый Структура("Редактирование",Истина)); 
			
			ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВиртуальнойГруппы", ПараметрыФормы, ,,,,оо, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе 
			ПараметрыФормы = Новый Структура("Ключ", СтрокаДПГ.Параметр);
			оо = Новый ОписаниеОповещения("ОбработатьИзменениеПараметра",ЭтотОбъект,Новый Структура());
			ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаЭлемента", ПараметрыФормы, ,,,,оо, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры     

&наКлиенте
Функция ДПГ_ПроверитьСостояниеВедомых(СтрокаДерева)
	
	ДоступностьСменыРежима = Истина;
	
	тЭлеметы = СтрокаДерева.ПолучитьЭлементы();
	ДПГ_ПроверитьСостояниеВедомыхРекурсивно(тЭлеметы, ДоступностьСменыРежима);
	
	Возврат ДоступностьСменыРежима;
	
КонецФункции

&наКлиенте
Процедура ДПГ_ПроверитьСостояниеВедомыхРекурсивно(тЭлеметы, ДоступностьСменыРежима)
	
	Если Не ДоступностьСменыРежима Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого стрЭлемент из тЭлеметы Цикл
		Если  стрЭлемент.ЭтоГруппа Тогда
			ЭлементСостояния = ДПГ_СостояниеСвертки.НайтиПоЗначению(стрЭлемент.ИдентификаторГруппы);
			Если ЭлементСостояния <> Неопределено Тогда
				Если ЭлементСостояния.Пометка Тогда
					ДоступностьСменыРежима = Ложь;
				КонецЕсли;
			КонецЕсли;
			Подчиненные = стрЭлемент.получитьЭлементы();
			ДПГ_ПроверитьСостояниеВедомыхРекурсивно(подчиненные, ДоступностьСменыРежима);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкуРаскрытияГруппы(ИмяТаблицы, Идентификатор)
	
	мНайденныеСтроки = Объект[ИмяТаблицы].НайтиСтроки(Новый Структура("Идентификатор",Идентификатор));
	
	Если мНайденныеСтроки.Количество() = 0 Тогда
		//Странно... группа есть, а строки нет
		//получим настройку из параметров
		Если ИмяТаблицы = "ГруппыПараметровГрузоперевозки" Тогда
			CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"РазворачиватьДеревоПараметровГрузоперевозок");		
		Иначе  //ГруппыПараметровЗаявки
			CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"РазворачиватьДеревоПараметровЗаявок");		
		КонецЕсли;
	Иначе
		Возврат мНайденныеСтроки[0].Раскрывать;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеПараметра(Ответ,ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		// на изменение параметра - сработает обработка оповещения
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область СостояниеСвертки_Грузоперевозка 

&НаСервере
Функция ДПГ_УстановитьСостояниеСверткиСтроки(ИдентификаторСтроки, ИдентификаторГруппы, Развернута=Истина)
	
	ЭлементСостояния = ДПГ_СостояниеСвертки.НайтиПоЗначению(ИдентификаторГруппы);
	Если (ЭлементСостояния = Неопределено) Тогда
		ЭлементСостояния = ДПГ_СостояниеСвертки.Добавить(ИдентификаторГруппы);
	КонецЕсли; 
	ЭлементСостояния.Представление 	= Формат(ИдентификаторСтроки,"ЧДЦ=; ЧН=; ЧГ=");
	ЭлементСостояния.Пометка 		= Развернута;
	
КонецФункции

&НаКлиенте
Процедура ДПГ_ВосстановитьСверткуДерево(Команда)
	
	ДПГ_ВосстановитьСостояниеСвертки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ВосстановитьСостояниеСвертки()
	
	тЭлементы = ДПГ.ПолучитьЭлементы();
	ДПГ_ВосстановитьСостояниеСверткиРекунсивно(тЭлементы);
		
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ВосстановитьСостояниеСверткиРекунсивно(тЭлементы)
	
	Для каждого тЭлемент Из тЭлементы Цикл
		
		тПодчиненные = тЭлемент.ПолучитьЭлементы();
		ДПГ_ВосстановитьСостояниеСверткиРекунсивно(тПодчиненные);
		
		ДПГ_ВосстановитьСостояниеСверткиСтроки(тЭлемент.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ВосстановитьСостояниеСверткиСтроки(Идентификатор)
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(Идентификатор);
	
	ЭлементСостояния = ДПГ_СостояниеСвертки.НайтиПоЗначению(СтрокаДерева.ИдентификаторГруппы);
	
	Если ЭлементСостояния <> Неопределено Тогда
		
		Если ЭлементСостояния.Пометка Тогда
			Элементы.ДПГ.Развернуть(СтрокаДерева.ПолучитьИдентификатор());
		Иначе
			Элементы.ДПГ.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
		конецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДПГ_СвернутьВсе(Команда)
	
	тЭлементы = ДПГ.ПолучитьЭлементы();
	ДПГ_СвернутьРекурсивно(тЭлементы); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_СвернутьРекурсивно(тЭлементы)
	
	Для Каждого тСтр Из тЭлементы Цикл
		тСтрЭлементы = тСтр.ПолучитьЭлементы();
		ДПГ_СвернутьРекурсивно(тСтрЭлементы);
		
		Элементы.ДПГ.Свернуть(тСтр.ПолучитьИдентификатор());
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_РазвернутьВсе(Команда)
	
	тЭлементы = ДПГ.ПолучитьЭлементы();
	Для Каждого тСтр Из тЭлементы Цикл
		Элементы.ДПГ.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область ДобавлениеЭлементов_Грузоперевозка 

&НаКлиенте
Процедура ДПГ_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ДПГ_ОбработкаВыбораПараметра",ЭтотОбъект); 
	
	ПарамерыФормыВыбора = Новый Структура;
	ПарамерыФормыВыбора.Вставить("Множественныйвыбор", Истина);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПарамерыФормыВыбора,Элемент,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ОбработкаВыбораПараметра(Ответ, ДополнительныеПараметры) Экспорт
	
	Если (Ответ <> Неопределено) Тогда
		
		Модифицированность = истина;
	
		Если ТипЗнч(Ответ) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
			Ответ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответ);
		КонецЕсли;
		
		
		Для Каждого Параметр из Ответ Цикл
			
			Если ЭтоГруппа(Параметр) Тогда
				Продолжить;
			КонецЕсли;
			
			// проверяем, что параметр новый
			Если (ДПГ_ДобавляемыйПараметрНовый(Параметр)) Тогда
				
				ИдентификаторДобавленнойСтроки = _ДПГ_ДобавитьПараметр(Параметр);
				
				// ракрываем строку родителя, если свернута
				ДобавленнаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторДобавленнойСтроки);
				РодительДобавленнойСтроки = ДобавленнаяСтрока.ПолучитьРодителя();
				Если (РодительДобавленнойСтроки <> Неопределено) Тогда
					
					ИдентификаторРодителяДобавленнойСтроки = РодительДобавленнойСтроки.ПолучитьИдентификатор();
					Если (НЕ Элементы.ДПГ.Развернут(ИдентификаторРодителяДобавленнойСтроки)) Тогда
						Элементы.ДПГ.Развернуть(ИдентификаторРодителяДобавленнойСтроки);
					КонецЕсли; 
					// --- 
					ДПГ_ТекущаяГруппа = РодительДобавленнойСтроки.ИдентификаторГруппы;
					
				Иначе
					
					ДПГ_ТекущаяГруппа = 0;
					
				КонецЕсли; 
				
				// позиционируемся на добавленный элемент
				Элементы.ДПГ.ТекущаяСтрока = ИдентификаторДобавленнойСтроки;
				// --- 
				ДПГ_ТекущийПараметр = ДобавленнаяСтрока.Параметр;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		// --- 
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция ЭтоГруппа(ЗначениеВыбора)
	
	Возврат ЗначениеВыбора.ЭтоГруппа;
	
КонецФункции

&НаКлиенте
Функция ДПГ_ДобавляемыйПараметрНовый(Параметр)
	// --- 
	
	Отбор = Новый Структура("Параметр",Параметр);
	СтрокиПараметра = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
	Возврат(СтрокиПараметра.Количество()=0);
	
	// --- 
КонецФункции
  
&НаСервере
Функция ДПГ_ТекущийРодитель()
	// --- 
	
	Если (Элементы.ДПГ.ТекущаяСтрока <> Неопределено) Тогда
		
		ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
		ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		РодительТекущейСтроки = ТекущаяСтрока.ПолучитьРодителя();
		Если (РодительТекущейСтроки <> Неопределено) Тогда
			Возврат(РодительТекущейСтроки);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат(ДПГ);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПГ_ДобавитьПараметр(Параметр,ПереносПараметров=Ложь,ИдентификаторСтрокиРодителя=Неопределено)
	// --- 
	//Новый механизм
	ИдентификаторГруппыВладельца = Неопределено;
	//Новый механизм
	
	// добавляем в ТЧ параметров
	СтрокаТЧ = Объект.ПараметрыГрузоперевозки.Добавить();
	СтрокаТЧ.Параметр = Параметр;
	Если ПереносПараметров Тогда
		
		Если ИдентификаторСтрокиРодителя <> Неопределено Тогда
			ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
			//Новый механизм
			ИдентификаторГруппыВладельца = ТекущаяСтрока.ИдентификаторГруппы;
			//Новый механизм
		Иначе
			ТекущаяСтрока = ДПГ;
		Конецесли;
		
		ТР =  ТекущаяСтрока;
	Иначе
		// добавляем в дерево
		Если (Элементы.ДПГ.ТекущаяСтрока <> Неопределено) Тогда
			ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
			ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
			Если (ТекущаяСтрока.ЭтоГруппа) Тогда
				ТР = ТекущаяСтрока;
			Иначе
				ТР = ДПГ_ТекущийРодитель();	
			КонецЕсли;
			
			//Новый механизм
			Если ТР <> ДПГ Тогда
				ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
			КонецЕсли;
			//Новый механизм
			
		Иначе
			ТР = ДПГ_ТекущийРодитель();	
		КонецЕсли; 
	КонецЕсли;
	
	//Новый механизм
	Если ИдентификаторГруппыВладельца <>  Неопределено Тогда
		ОтборСтрок = Новый Структура("Идентификатор",ТР.ИдентификаторГруппы);
		мСтрокиГрупп = Объект.ГруппыПараметровГрузоперевозки.НайтиСтроки(ОтборСтрок);
		Если мСтрокиГрупп.Количество() > 0 Тогда
			СтрокаГруппы = мСтрокиГрупп[0];
			СтрокаТЧ.ИдентификаторВладельца = СтрокаГруппы.ИдентификаторГруппы; 	
		КонецЕсли;
	КонецЕсли; 
	//Новый механизм
	
	СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
	// заполняем строку дерева
	НаборПравДляПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	СтруктураПрав = НаборПравДляПараметров["п_"+_сф.КлючПоСсылке(Параметр)];
	_ДПГ_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева,Параметр,,СтруктураПрав);
	// записываем принадлежность параметра группе
	_ДПГ_ДобавитьЭлементГруппы(Параметр, _ДПГ_ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева));
	// --- 
	
	Возврат(СтрокаДерева.ПолучитьИдентификатор());
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПГ_ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева)
	// --- 
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтроки = Неопределено) Тогда
		СтрокаГруппы = Объект.ГруппыПараметровГрузоперевозки[0];
	Иначе
		Отбор = Новый Структура("Идентификатор", РодительСтроки.ИдентификаторГруппы);
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки, Отбор);
	КонецЕсли; 
	
	Возврат(СтрокаГруппы);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ДПГ_ДобавитьЭлементГруппы(Элемент, СтрокаГруппы, НовыйПредыдущий=Неопределено)
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	Если (НовыйПредыдущий =  Неопределено) Тогда
		МассивВедомых.Добавить(Элемент);
	Иначе
		
		ИндексПредыдущего = МассивВедомых.Найти(НовыйПредыдущий);
		Если (ИндексПредыдущего <> Неопределено) Тогда
			МассивВедомых.Вставить(ИндексПредыдущего,Элемент);
		Иначе
			МассивВедомых.Добавить(Элемент);
		КонецЕсли; 
		
	КонецЕсли; 
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	Если (ТипЗнч(Элемент)=Тип("Число")) Тогда
		
		ДПГ_ТекущаяГруппа = Элемент;
		ДПГ_ТекущийПараметр = Неопределено;
		
	Иначе
		
		ДПГ_ТекущаяГруппа = СтрокаГруппы.Идентификатор;
		ДПГ_ТекущийПараметр = Элемент;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПГ_ПереместитьЭлементГруппы(Элемент, СтрокаГруппы, НовыйПредыдущий);
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	// --- 
	Если (НовыйПредыдущий = Неопределено ) Тогда
		
		ИндексЭлемента = МассивВедомых.Найти(Элемент);
		МассивВедомых.Удалить(ИндексЭлемента);
		МассивВедомых.Добавить(Элемент);
		
	Иначе
		
		ИндесНовогоПредыдущего = МассивВедомых.Найти(НовыйПредыдущий);
		ИндексЭлемента = МассивВедомых.Найти(Элемент);
		МассивВедомых.Удалить(ИндексЭлемента);
		МассивВедомых.Вставить(ИндесНовогоПредыдущего,Элемент);
		
	КонецЕсли; 
	// --- 
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПГ_УдалитьЭлементГруппы(Элемент, СтрокаГруппы)
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	МассивВедомых.Удалить(МассивВедомых.Найти(Элемент));
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	
	// --- 
КонецПроцедуры
 
#КонецОбласти 

#Область ДобавлениеГруппЭлементов_Грузоперевозка

&НаКлиенте
Процедура ДПГ_ДобавитьГруппу(Команда)
	
	// спрашиваем название группы
	ПараметрыФормы = Новый Структура("НоваяГруппа,РежимГрузоперевозки,ДоступнаСменаРежимаСвертки", Истина,Истина, Истина);
	ПОВ = Новый ОписаниеОповещения("ДПГ_ОбработатьВводНаименованияГруппы",ЭтотОбъект, Новый Структура()); 
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВиртуальнойГруппы",ПараметрыФормы,ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ОбработатьВводНаименованияГруппы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Модифицированность = истина;
		РедактированиеГруппы = Ложь;
		ДополнительныеПараметры.Свойство("Редактирование",РедактированиеГруппы);
		Если (РедактированиеГруппы = Неопределено ) Тогда
			РедактированиеГруппы = Ложь;
		КонецЕсли; 
		Если (РедактированиеГруппы) Тогда
			
			ИдентификаторСтроки = _ДПГ_ОбновитьГруппу(Элементы.ДПГ.ТекущаяСтрока,Ответ);
			
		Иначе
			
			ИдентификаторСтроки = _ДПГ_ДобавитьГруппу(Ответ);	
			
		КонецЕсли;
		
		//Обнолвение пометок вышестоящий групп
		ОбновитьРаскрытиеВышеСтоящихГрупп(ИдентификаторСтроки, Ответ.ГруппаРазвернута);
		
		ИдентификаторГруппы = ДПГ.НайтипоИдентификатору(ИдентификаторСтроки).ИдентификаторГруппы;
		ДПГ_УстановитьСостояниеСверткиСтроки(ИдентификаторСтроки, ИдентификаторГруппы, Ответ.ГруппаРазвернута);
		//ДПГ_ВосстановитьСостояниеСверткиСтроки(ИдентификаторСтроки);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРаскрытиеВышеСтоящихГрупп(ИдентификаторСтроки,ГруппаРазвернута)
	
	Если Не ГруппаРазвернута Тогда
		//ничего делать не нужно, свертка вышестоящией группы от этого не зависит;
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = ДПГ.НайтипоИдентификатору(ИдентификаторСтроки);

	ОбработатьСверткуРодителяРекурсивно(СтрокаДерева,ГруппаРазвернута);
	
КонецПроцедуры

&наКлиенте
Процедура ОбработатьСверткуРодителяРекурсивно(СтрокаДерева, ГруппаРазвернута)
	
	РодительГруппы = СтрокаДерева.ПолучитьРодителя();
	
	Если РодительГруппы <> Неопределено Тогда
		СтруктураПараметров = новый Структура("НаименованиеГруппы,ГруппаРазвернута",РодительГруппы.НаименованиеГруппы,ГруппаРазвернута);
		
		_ДПГ_ОбновитьГруппу(РодительГруппы.ПолучитьИдентификатор(),СтруктураПараметров);
		
		ДПГ_УстановитьСостояниеСверткиСтроки(РодительГруппы.ПолучитьИдентификатор(), РодительГруппы.ИдентификаторГруппы, ГруппаРазвернута);

		ОбработатьСверткуРодителяРекурсивно(РодительГруппы, ГруппаРазвернута)
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция _ДПГ_ОбновитьГруппу(ИдентификаторСтрокиДерева,СтруктураПараметров)
	// --- 
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
	СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
	
	СтрокаГруппы.Наименование 			= СтруктураПараметров.НаименованиеГруппы;
	СтрокаГруппы.Раскрывать 			= СтруктураПараметров.ГруппаРазвернута;

	
	_ДПГ_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы);
	
	Возврат(ИдентификаторСтрокиДерева);
	
	// --- 
КонецФункции
 
&НаСервере
Функция _ДПГ_ДобавитьГруппу(СтруктураПараметров, ИдентификаторГруппыРодителя=Неопределено)
	
	//Новый механизм
	ИдентификаторГруппыВладельца = Неопределено;
	//Новый механизм
	
	// создаем строку ТЧ
	СтрокаГруппы 						= Объект.ГруппыПараметровГрузоперевозки.Добавить();
	СтрокаГруппы.Идентификатор 			= _ДПГ_ИдентификаторНовойГруппы();
	СтрокаГруппы.Наименование 			= СтруктураПараметров.НаименованиеГруппы;
	СтрокаГруппы.Раскрывать 			= СтруктураПараметров.ГруппаРазвернута;
	СтрокаГруппы.ИдентификаторыВедомых 	= ЗначениеВСтрокуВнутр(Новый Массив);
	
	// создаем строку дерева
	Если ИдентификаторГруппыРодителя = Неопределено Тогда
		Если (Элементы.ДПГ.ТекущаяСтрока <> Неопределено) Тогда
			ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
			ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
			Если (ТекущаяСтрока.ЭтоГруппа) Тогда
				ТР = ТекущаяСтрока;
			Иначе
				ТР = ДПГ_ТекущийРодитель();	
			КонецЕсли; 
			//Новый механизм
			Если ТР <> ДПГ Тогда
				ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
			КонецЕсли;
			//Новый механизм
		Иначе
			ТР = ДПГ_ТекущийРодитель();	
		КонецЕсли; 
	Иначе
		ТР = ДПГ.НайтиПоИдентификатору(ИдентификаторГруппыРодителя);
		//Новый механизм
		Если ТР <> Неопределено Тогда
			ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
		КонецЕсли;
		//Новый механизм
	КонецЕсли;
	
	//Новый механизм
	СтрокаГруппы.ИдентификаторГруппы = Новый УникальныйИдентификатор;
	Если ИдентификаторГруппыВладельца <>  Неопределено Тогда
		ОтборСтрок = Новый Структура("Идентификатор",ИдентификаторГруппыВладельца);
		мСтрокиГрупп = Объект.ГруппыПараметровГрузоперевозки.НайтиСтроки(ОтборСтрок);
		Если мСтрокиГрупп.Количество() > 0 Тогда
			СтрокаГруппыВладельца = мСтрокиГрупп[0];
			СтрокаГруппы.ИдентификаторВладельца = СтрокаГруппыВладельца.ИдентификаторГруппы; 	
		КонецЕсли;
	КонецЕсли;
	//Новый механизм

	// --- 
	СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
	// заполняем
	_ДПГ_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы);
	// добавляем в массив элементов родителя
	_ДПГ_ДобавитьЭлементГруппы(СтрокаГруппы.Идентификатор, _ДПГ_ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева));
	// --- 
	
	
	Возврат(СтрокаДерева.ПолучитьИдентификатор());
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПГ_ИдентификаторНовойГруппы()
	// --- 
	
	ТЗИ = Объект.ГруппыПараметровГрузоперевозки.Выгрузить(,"Идентификатор");
	ТЗИ.Сортировать("Идентификатор Возр");
	ПоследнийИдентификатор = _сф.к_ПоследнийЭлемент(ТЗИ).Идентификатор;
	НовыйИдентификатор = ПоследнийИдентификатор+1;
	Возврат(НовыйИдентификатор);
	
	// --- 
КонецФункции
 
#КонецОбласти 

#Область УдалениеЭлементов_Грузоперевозка 

&НаКлиенте
Процедура ДПГ_ПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	Идентификатор = Элементы.ДПГ.ТекущаяСтрока;
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(Идентификатор);
	// --- 
	Если (СтрокаДерева.УдалениеРазрешено) Тогда
		Модифицированность = истина;
	
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			
			Если (СтрокаДерева.ПолучитьЭлементы().Количество() <> 0) Тогда
				
				ПОВ = Новый ОписаниеОповещения("ДПГ_ОбработкаПодтвержденияУдаленияГруппы",ЭтотОбъект, Новый Структура()); 
				ПоказатьВопрос(ПОВ,"Группа будет удалена вместе с параметрами. Продолжить?", РежимДиалогаВопрос.ДаНет);
				
			Иначе
				
				ДПГ_УдалитьСтрокуДерева(Идентификатор);
				
			КонецЕсли; 
			
		Иначе
			
			ДПГ_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЕсли; 
		
	Иначе
		
		_УФК.ВывестиПредупреждение("Недостаточно прав для данного действия");
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ОбработкаПодтвержденияУдаленияГруппы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			ДПГ_УдалитьСтрокуДерева(Элементы.ДПГ.ТекущаяСтрока);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ДПГ_УдалитьСтрокуДерева(Идентификатор)
	// --- 
	
	НоваяТекущаяСтрока = Неопределено;
	// --- 
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(Идентификатор);
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		КоллекцияСтрок = ДПГ.ПолучитьЭлементы();
	Иначе
		КоллекцияСтрок = РодительСтрокиДерева.ПолучитьЭлементы();
	КонецЕсли; 
	КоличествоЭлементовКоллекции = КоллекцияСтрок.Количество();
	Если (КоличествоЭлементовКоллекции > 1) Тогда
		
		// получаем индекс
		ИндексУдаляемойСтроки = КоллекцияСтрок.Индекс(СтрокаДерева);
		Если (ИндексУдаляемойСтроки <> КоличествоЭлементовКоллекции-1) Тогда
			НоваяТекущаяСтрока = КоллекцияСтрок[ИндексУдаляемойСтроки+1].ПолучитьИдентификатор();
		Иначе 
			НоваяТекущаяСтрока = КоллекцияСтрок[ИндексУдаляемойСтроки-1].ПолучитьИдентификатор();
		КонецЕсли; 
		
	Иначе
		
		Если (РодительСтрокиДерева <> Неопределено) Тогда
			
			НоваяТекущаяСтрока = РодительСтрокиДерева.ПолучитьИдентификатор();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// удаляем рекурсивно группы/параметры
	Результат = _ДПГ_УдалитьПараметрыРекурсивно(Идентификатор);
	Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
		
		// удаляем строку дерева
		_ДПГ_УдалитьСтрокуДерева(Идентификатор);
		
		Если (НоваяТекущаяСтрока <> Неопределено ) Тогда
			
			Элементы.ДПГ.ТекущаяСтрока = НоваяТекущаяСтрока;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДПГ_УдалитьПараметрыРекурсивно(ИдентификаторСтроки)
	// --- 
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		ЭлементДПГ = СтрокаДерева.ИдентификаторГруппы;
	Иначе
		ЭлементДПГ = СтрокаДерева.Параметр;
	КонецЕсли; 
	
	// удаляем из родителя
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		СтрокаГруппы = Объект.ГруппыПараметровГрузоперевозки[0];
	Иначе
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор", РодительСтрокиДерева.ИдентификаторГруппы));
	КонецЕсли; 
	_ДПГ_УдалитьЭлементГруппы(ЭлементДПГ, СтрокаГруппы);
	
	// физически удаляем
	_ДПГ_УдалитьЭлементДПГ(ЭлементДПГ);
	// --- 
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Процедура _ДПГ_УдалитьЭлементДПГ(ЭлементДПГ)
	// --- 
	
	Если (ТипЗнч(ЭлементДПГ)=Тип("Число")) Тогда
		
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор", ЭлементДПГ));
		МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
		Для каждого Ведомый Из МассивВедомых Цикл
			
			_ДПГ_УдалитьЭлементДПГ(Ведомый);
			
		КонецЦикла; 
		// --- 
		Объект.ГруппыПараметровГрузоперевозки.Удалить(Объект.ГруппыПараметровГрузоперевозки.Индекс(СтрокаГруппы));
		
	Иначе
		
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,Новый Структура("Параметр",ЭлементДПГ));
		Объект.ПараметрыГрузоперевозки.Удалить(Объект.ПараметрыГрузоперевозки.Индекс(СтрокаПараметра));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

#КонецОбласти 

#Область ПеремещениеЭлементов_Грузоперевозка

&НаКлиенте
Процедура ДПГ_ПереместитьВверх(Команда)
	
	ДПГ_СдвинутьСтроку(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ПереместитьВниз(Команда)
	
	ДПГ_СдвинутьСтроку(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_СдвинутьСтроку(Направление)
	// --- 
	
	ТекущаяСтрока = Элементы.ДПГ.ТекущаяСтрока;
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ТекущаяСтрока);
	РодительТекущейСтроки = СтрокаДерева.ПолучитьРодителя();
	Если (РодительТекущейСтроки = Неопределено) Тогда
		РодительТекущейСтроки = ДПГ;
		ГруппаРодитель = 0;
	Иначе
		ГруппаРодитель = РодительТекущейСтроки.ИдентификаторГруппы;	
	КонецЕсли; 
	// --- 
	КоллекцияСтрок = РодительТекущейСтроки.ПолучитьЭлементы();
	КоличествоСтрок = КоллекцияСтрок.Количество();
	Если (КоличествоСтрок = 1) Тогда
		Возврат;
	КонецЕсли; 
	ИндексТекущейСтроки = КоллекцияСтрок.Индекс(СтрокаДерева);
	// --- 
	// проверяем крайние положения
	// если уперлись - переносим в конец/начало
	Сдвиг = 0;
	ПредыдущееДействие = Неопределено;
	СледующееДействие = Неопределено;
	// --- 
	Если (ИндексТекущейСтроки = 0 И Направление=-1) Тогда
		
		Сдвиг = КоличествоСтрок-1; // с плюсом;
		ПредыдущаяСтрока = КоллекцияСтрок.Получить(КоличествоСтрок-1);
		Если (ПредыдущаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.Параметр;
		КонецЕсли; 
		
	ИначеЕсли (ИндексТекущейСтроки <> 0 И Направление=-1) Тогда 
		
		Сдвиг = -1;
		СледующаяСтрока = КоллекцияСтрок.Получить(ИндексТекущейСтроки+Сдвиг);
		Если (СледующаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторСледующейСтроки = СледующаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторСледующейСтроки = СледующаяСтрока.Параметр;
		КонецЕсли;
		
	ИначеЕсли (ИндексТекущейСтроки = КоличествоСтрок-1 И Направление=1) Тогда 
		
		 Сдвиг = -(КоличествоСтрок-1);
		 СледующаяСтрока = КоллекцияСтрок.Получить(0);
		 Если (СледующаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторСледующейСтроки = СледующаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторСледующейСтроки = СледующаяСтрока.Параметр;
		КонецЕсли;
		 
	ИначеЕсли (ИндексТекущейСтроки <> КоличествоСтрок-1 И Направление=1) Тогда 
		
		 Сдвиг = 1;
		 ПредыдущаяСтрока = КоллекцияСтрок.Получить(ИндексТекущейСтроки+Сдвиг);
		 Если (ПредыдущаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.Параметр;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Ответ = _ДПГ_ИзменитьПорядокСтроки(ГруппаРодитель, ТекущаяСтрока, ИдентификаторПредыдущейСтроки, ИдентификаторСледующейСтроки);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		КоллекцияСтрок.Сдвинуть(КоллекцияСтрок.Индекс(СтрокаДерева),Сдвиг);
		
	Иначе
		
		Сообщить(_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДПГ_ИзменитьПорядокСтроки(ИдентификаторГруппыРодителя, ИдентификаторТекущейСтроки, ИдентификаторПредыдущейСтроки, ИдентификаторСледующейСтроки)
	// --- 
	
	Попытка
		
		Группа = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор",ИдентификаторГруппыРодителя));
		МассивЭлементов = ЗначениеИзСтрокиВнутр(Группа.ИдентификаторыВедомых);
		ТаблицаЭлементов = Новый ТаблицаЗначений;
		ТаблицаЭлементов.Колонки.Добавить("Идентификатор");
		Для каждого Элемент Из МассивЭлементов Цикл
			Нстр = ТаблицаЭлементов.Добавить();
			Нстр.Идентификатор = Элемент;
		КонецЦикла; 
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			СдвигаемоеЗначение = СтрокаДерева.ИдентификаторГруппы;
		Иначе
			СдвигаемоеЗначение = СтрокаДерева.Параметр;
		КонецЕсли; 
		СтрокаСдвигаемогоЗначения = _сф.к_НайтиСтроку(ТаблицаЭлементов, Новый Структура("Идентификатор",СдвигаемоеЗначение));
		// --- 
		Если (ИдентификаторПредыдущейСтроки <> Неопределено) Тогда
			
			ОтносительноеЗначение = ИдентификаторПредыдущейСтроки;
			//СтрокаДействия = _сф.к_НайтиСтроку(ТЧ, Новый Структура("Действие",ПредыдущееДействие));
			
		ИначеЕсли (ИдентификаторСледующейСтроки <> Неопределено) Тогда 
			
			ОтносительноеЗначение = ИдентификаторСледующейСтроки;
			
		КонецЕсли; 
		СтрокаОтносительногоЗначения = _сф.к_НайтиСтроку(ТаблицаЭлементов, Новый Структура("Идентификатор",ОтносительноеЗначение));
		Сдвиг = (ТаблицаЭлементов.Индекс(СтрокаОтносительногоЗначения)-ТаблицаЭлементов.Индекс(СтрокаСдвигаемогоЗначения));
		ТаблицаЭлементов.Сдвинуть(СтрокаСдвигаемогоЗначения,Сдвиг);
		// --- 
		МассивЭлементов=ТаблицаЭлементов.ВыгрузитьКолонку("Идентификатор");
		Группа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивЭлементов);
		
		
	Исключение
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции
 
#КонецОбласти 

#Область ДрагЭндДроп_Грузоперевозка

&НаКлиенте
Процедура ДПГ_НачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если (Элементы.ДПГ.ВыделенныеСтроки.Количество() > 1) Тогда
		
		Выполнение = Ложь;
		ПоказатьПредупреждение(,"Множественное перетаскивание недоступно.");
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_Перетаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка=Ложь;
	// --- 
	
	// проверим, что действие, в которое мы вставляем не находится ниже по иерархии вставляемого действия
	// сформируем массив действий по иерархии от текущего вверх
	МассивСтрок = Новый Массив;
	ИдентификаторТекущейСтроки = Строка;
	МассивИдентификаторов = ПараметрыПеретаскивания.Значение;
	Если (ИдентификаторТекущейСтроки = Неопределено) Тогда
		
		НовыйРодитель = 0;
		НовыйПредыдущий = Неопределено;
		ВставкаРазрешена = Истина;
		
	Иначе
		
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			МассивСтрок.Добавить(СтрокаДерева.ИдентификаторГруппы);	
			НовыйРодитель = СтрокаДерева.ИдентификаторГруппы;
			НовыйПредыдущий = Неопределено;
		Иначе
			НовыйПредыдущий = СтрокаДерева.Параметр;
			НовыйРодительСтрока = СтрокаДерева.ПолучитьРодителя();
			Если (НовыйРодительСтрока <>  Неопределено) Тогда
				НовыйРодитель = НовыйРодительСтрока.ИдентификаторГруппы;
			Иначе
				НовыйРодитель = 0;
			КонецЕсли; 
		КонецЕсли; 
		
		РодительСтроки = СтрокаДерева.ПолучитьРодителя();
		Пока (РодительСтроки <> Неопределено) Цикл
			
			// всегда группа
			МассивСтрок.Добавить(РодительСтроки.ИдентификаторГруппы);
			РодительСтроки = РодительСтроки.ПолучитьРодителя();
			
		КонецЦикла; 
		// ---
		МассивПеремещаемыхСтрок = Новый Массив;
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			ПеремещаемаяСтрокаДерева = ДПГ.НайтиПоИдентификатору(Идентификатор);
			Если (ПеремещаемаяСтрокаДерева.ЭтоГруппа) Тогда
				МассивПеремещаемыхСтрок.Добавить(ПеремещаемаяСтрокаДерева.ИдентификаторГруппы);
			Иначе
				МассивПеремещаемыхСтрок.Добавить(ПеремещаемаяСтрокаДерева.Параметр);	
			КонецЕсли; 
		КонецЦикла; 
		// --- 
		ВставкаРазрешена = Истина;
		Для каждого ПеремещаемаяСтрока Из МассивПеремещаемыхСтрок Цикл
			
			Если (МассивСтрок.Найти(ПеремещаемаяСтрока) <> Неопределено) Тогда
				
				ВставкаРазрешена = Ложь;
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	Если (НЕ ВставкаРазрешена) Тогда
		
		ПоказатьПредупреждение(,"Вставка в иерархию с нарушением логической целостности.");
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	Ответ = _ДПГ_ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель,НовыйПредыдущий);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		Модифицированность = истина;

		// удаляем вставляемые действия
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			
			_ДПГ_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЦикла; 
		
		Если (ИдентификаторТекущейСтроки = Неопределено) Тогда
			
			ПолноеОбновление = Истина;
			_ДПГ_Обновить();
			ДПГ_ВосстановитьСостояниеСвертки();
			
		Иначе
			
			// переформировываем элементы текущего действия
			ПолноеОбновление = Ложь;
			СтрокаДерева = ДПГ.НайтиПоИдентификатору(Строка);
			Если (СтрокаДерева.ЭтоГруппа) Тогда
				
				ТекущаяСтрока = Строка;
				ДПГ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
				
			Иначе
				
				СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
				Если (СтрокаРодителя = Неопределено) Тогда
					
					// обновить все
					// тут бы процедуру анализа новых ... TODO
					ПолноеОбновление = Истина;
					_ДПГ_Обновить();
					ДПГ_ВосстановитьСостояниеСвертки();
					
				Иначе
					
					ТекущаяСтрока = СтрокаРодителя.ПолучитьИдентификатор();
					ДПГ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			
		КонецЕсли; 
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ДПГ_ВыполнитьПеремещениеСтрок(МассивИдентификаторовСтрок, НовыйРодитель, НовыйПредыдущий=Неопределено)
	// --- 
	
	Попытка
		
		Для каждого ИдентификаторСтроки Из МассивИдентификаторовСтрок Цикл
			
			Результат = _ДПГ_УстановитьРодителяСтроки(ИдентификаторСтроки, НовыйРодитель, НовыйПредыдущий);
			Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
				
				Возврат(_УФКС.Ответ(1,_УФКС.ПредставлениеОшибки(Результат)));
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПГ_УстановитьРодителяСтроки(ИдентификаторСтроки, НовыйРодитель, НовыйПредыдущий=Неопределено)
	// --- 
	
	Строка = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (Строка.ЭтоГруппа) Тогда
		ПеремещаемоеЗначение = Строка.ИдентификаторГруппы;
	Иначе
		ПеремещаемоеЗначение = Строка.Параметр;
	КонецЕсли; 
	
	// --- 
	
	ГруппаСтарыйРодитель = _ДПГ_ОпределитьСтрокуГруппуСтрокиДерева(Строка);
	ГруппаНовыйРодитель = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор",НовыйРодитель));
	
	Если (ГруппаСтарыйРодитель.Идентификатор <> НовыйРодитель) Тогда
		
		Попытка
			
			// удаляем из старого родителя
			_ДПГ_УдалитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаСтарыйРодитель);
			
			// добавляем в новый
			_ДПГ_ДобавитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаНовыйРодитель, НовыйПредыдущий);
			
			//Новый механизм
			_ДПГ_УстановитьНовогоВладельца(ИдентификаторСтроки,ГруппаНовыйРодитель.ИдентификаторГруппы);
			//Новый механизм
	
		Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			Сообщить(ТекстОшибки);
			// --- 
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецПопытки; 
		
	Иначе
		
		// перемещение в пределах родителя
		_ДПГ_ПереместитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаНовыйРодитель, НовыйПредыдущий);
		
	КонецЕсли; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

//Новый механизм
&наСервере
Процедура _ДПГ_УстановитьНовогоВладельца(ИдентификаторСтроки, ИдентификаторГруппы)
	
	ИдентификаторВладельца = ИдентификаторГруппы;
	
	Строка = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Строка.ЭтоГруппа Тогда
		мСтроки = Объект.ГруппыПараметровГрузоперевозки.НайтиСтроки(Новый Структура("Идентификатор",Строка.ИдентификаторГруппы));
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0];	
		КонецЕсли;
		Если СтрокаДанных.ИдентификаторГруппы = ИдентификаторГруппы Тогда
			ИдентификаторВладельца = Неопределено;
		КонецЕсли;
	Иначе
		мСтроки = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Новый Структура("Параметр",Строка.Параметр));
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0];	
		КонецЕсли;
	КонецЕсли; 
	
	СтрокаДанных.ИдентификаторВладельца = ИдентификаторВладельца;
	
КонецПроцедуры
//Новый механизм

&НаСервере
Процедура _ДПГ_УдалитьСтрокуДерева(ИдентификаторСтроки)
	// --- 
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		РодительСтрокиДерева = ДПГ;
	КонецЕсли; 
	РодительСтрокиДерева.ПолучитьЭлементы().Удалить(СтрокаДерева);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область Копипаста_Грузоперевозка

&НаКлиенте
Процедура ДПГ_ПереместитьНаУровеньВверх(Команда)
	
	ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
	ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
	Если (РодительСтроки <> Неопределено) Тогда
		
		РодительРодителя = РодительСтроки.ПолучитьРодителя();
		НовыйРодитель = ТекущаяСтрока.ИдентификаторГруппы;
		
		// --- 
		МассивИдентификаторов = Новый Массив;
		МассивИдентификаторов.Добавить(ИдентификаторТекущейСтроки);
		Ответ = _ДПГ_ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель);
		Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
			
			// удаляем вставляемые действия
			Для каждого Идентификатор Из МассивИдентификаторов Цикл
				
				_ДПГ_УдалитьСтрокуДерева(Идентификатор);
				
			КонецЦикла; 
			
			// переформировываем элементы текущего действия
			ПолноеОбновление = Ложь;
			Если (РодительРодителя = Неопределено) Тогда
				
				ПолноеОбновление = Истина;
				_ДПГ_Обновить();
				ДПГ_ВосстановитьСостояниеСвертки();
				
			Иначе
				
				ДПГ_ВыполнитьПодгрузкуСтрок(РодительРодителя);
				
			КонецЕсли; 
						
		Иначе
			
			ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		// --- 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_Строка_Вырезать(Команда)
	
	// снимаем признак нахождения в буфере
	Для каждого Стр Из ДПГ_БуферОбмена Цикл
		ИдентификаторСтроки = Число(Стр.Представление);
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если (СтрокаДерева <> Неопределено) Тогда
			СтрокаДерева.Буфер = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	ДПГ_БуферОбмена.Очистить();
	// --- 
	Для каждого Стр Из Элементы.ДПГ.ВыделенныеСтроки Цикл
		
		ВыделеннаяСтрока = ДПГ.НайтиПоИдентификатору(Стр);
		ВыделеннаяСтрока.Буфер = Истина;
		Если (ВыделеннаяСтрока.ЭтоГруппа) Тогда
			ДПГ_БуферОбмена.Добавить(ВыделеннаяСтрока.ИдентификаторГруппы, Формат(Стр,"ЧДЦ=; ЧН=; ЧГ="));
		Иначе
			ДПГ_БуферОбмена.Добавить(ВыделеннаяСтрока.Параметр, Формат(Стр,"ЧДЦ=; ЧН=; ЧГ="));	
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_Строка_Вставить(Команда)
	
	МассивСтрок = Новый Массив;
	ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
	// --- 
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		МассивСтрок.Добавить(СтрокаДерева.ИдентификаторГруппы);	
		НовыйРодитель = СтрокаДерева.ИдентификаторГруппы;
		НовыйПредыдущий = Неопределено;
	Иначе
		НовыйПредыдущий = СтрокаДерева.Параметр;
		НовыйРодительСтрока = СтрокаДерева.ПолучитьРодителя();
		Если (НовыйРодительСтрока <>  Неопределено) Тогда
			НовыйРодитель = НовыйРодительСтрока.ИдентификаторГруппы;
		Иначе
			НовыйРодитель = 0;
		КонецЕсли; 
	КонецЕсли; 
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Пока (РодительСтроки <> Неопределено) Цикл
		
		// всегда группа
		МассивСтрок.Добавить(РодительСтроки.ИдентификаторГруппы);
		РодительСтроки = РодительСтроки.ПолучитьРодителя();
		
	КонецЦикла; 
	// ---
	МассивПеремещаемыхСтрок = ДПГ_БуферОбмена.ВыгрузитьЗначения();
	// --- 
	ВставкаРазрешена = Истина;
	Для каждого ПеремещаемаяСтрока Из МассивПеремещаемыхСтрок Цикл
		
		Если (МассивСтрок.Найти(ПеремещаемаяСтрока) <> Неопределено) Тогда
			
			ВставкаРазрешена = Ложь;
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	Если (НЕ ВставкаРазрешена) Тогда
		
		ПоказатьПредупреждение(,"Вставка в иерархию с нарушением логической целостности.");
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	МассивИдентификаторов = Новый Массив;
	Для каждого ЭлементБуфера Из ДПГ_БуферОбмена Цикл
		
		МассивИдентификаторов.Добавить(Число(ЭлементБуфера.Представление));
		
	КонецЦикла; 
	// --- 
	Ответ = _ДПГ_ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель,НовыйПредыдущий);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		// удаляем вставляемые действия
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			
			_ДПГ_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЦикла; 
		
		// очищаем буфер
		ДПГ_БуферОбмена.Очистить();
		
		// переформировываем элементы текущего действия
		ПолноеОбновление = Ложь;
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			
			ТекущаяСтрока = ИдентификаторТекущейСтроки;
			ДПГ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
			
		Иначе
			
			СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
			Если (СтрокаРодителя = Неопределено) Тогда
				
				// обновить все
				// тут бы процедуру анализа новых ... TODO
				ПолноеОбновление = Истина;
				_ДПГ_Обновить();
				ДПГ_ВосстановитьСостояниеСвертки();
				
			Иначе
				
				ТекущаяСтрока = СтрокаРодителя.ПолучитьИдентификатор();
				ДПГ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ФормированиеДерева_Заявка 

&НаКлиенте
Процедура ДПЗ_Обновить()
	// --- 
	
	_ДПЗ_Обновить();
	ДПЗ_ВосстановитьСостояниеСвертки();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПЗ_Обновить()
	// --- 
	
	// получаем текущие группы 		
	Элементы.ДПЗ.НачальноеОтображениеДерева=НачальноеОтображениеДерева.НеРаскрывать;
	ДПЗ.ПолучитьЭлементы().Очистить();
	// ---------------------------------------------------------------------------- 
	Если (Объект.ГруппыПараметровЗаявки.Количество()=0) Тогда
		Корень = Объект.ГруппыПараметровЗаявки.Добавить();
		Корень.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(Новый Массив);
	Иначе
		Корень = Объект.ГруппыПараметровЗаявки[0];	
	КонецЕсли; 
	Если (НЕ Корень.Раскрывать) Тогда
		Корень.Раскрывать = Истина;
	КонецЕсли; 
	// --- 
	НаборПравДляПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресСвойствПараметров);
	// --- 
	ТаблицаКонтроляГрупп = _ДПЗ_ТаблицаКонтроляГрупп();
	ТаблицаКонтроляПараметров = _ДПЗ_ТаблицаКонтроляПараметров(НаборПравДляПараметров);
	// --- 
	_ДПЗ_СформироватьЭлементыДерева(Корень,Неопределено,НаборПравДляПараметров,СвойстваПараметров, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
	
	// после формирования проверяем, нет ли потерянных групп, 
	// если есть, то засовываем их в корень и переформировываем дерево
	// сообщаем о потерянных группах
	
	МассивНеучтенныхГрупп = _сф.к_НайтиСтроки(ТаблицаКонтроляГрупп,Новый Структура("Видимость",Ложь));
	Если (МассивНеучтенныхГрупп.Количество() <> 0) Тогда
		
		// переносим каждую в корень
		Для каждого КонтрольнаяСтрокаГруппы Из МассивНеучтенныхГрупп Цикл
			
			_ДПЗ_ДобавитьЭлементГруппы(КонтрольнаяСтрокаГруппы.Идентификатор, Корень);
			
		КонецЦикла; 
		// --- 
		// переформировываем дерево
		ТаблицаКонтроляГрупп = _ДПЗ_ТаблицаКонтроляГрупп();
		ТаблицаКонтроляПараметров = _ДПЗ_ТаблицаКонтроляПараметров(НаборПравДляПараметров);
		_ДПЗ_СформироватьЭлементыДерева(Корень,Неопределено,НаборПравДляПараметров,СвойстваПараметров, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
		// --- 
		ДПЗ_ТекущаяГруппа=0;
		ДПЗ_ТекущийПараметр = Неопределено;
		
	КонецЕсли; 
	
	// далее проверяем, нет ли потерянных/новых параметров, если есть
	// то добавляем их в корень и снова переформировываем дерево
	
	МассивНеучтенныхПараметров = _сф.к_НайтиСтроки(ТаблицаКонтроляПараметров,Новый Структура("Видимость",Ложь));
	Если (МассивНеучтенныхПараметров.Количество() <> 0) Тогда
		
		// переносим каждую в корень
		Для каждого КонтрольнаяСтрокаПараметра Из МассивНеучтенныхПараметров Цикл
			
			_ДПЗ_ДобавитьЭлементГруппы(КонтрольнаяСтрокаПараметра.Параметр, Корень);
			
		КонецЦикла; 
		// переформировываем дерево
		ТаблицаКонтроляГрупп = _ДПЗ_ТаблицаКонтроляГрупп();
		ТаблицаКонтроляПараметров = _ДПЗ_ТаблицаКонтроляПараметров(НаборПравДляПараметров);
		_ДПЗ_СформироватьЭлементыДерева(Корень,Неопределено,НаборПравДляПараметров,СвойстваПараметров, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
		// --- 
		ДПЗ_ТекущаяГруппа=0;
		ДПЗ_ТекущийПараметр = Неопределено;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДПЗ_ТаблицаКонтроляГрупп()
	// --- 
	
	ТаблицаКонтроляГрупп = Объект.ГруппыПараметровЗаявки.Выгрузить();
	ТаблицаКонтроляГрупп.Колонки.Добавить("Видимость");
	ТаблицаКонтроляГрупп.ЗаполнитьЗначения(Ложь,"Видимость");
	СтрокаКорня = _сф.к_ПервыйЭлемент(ТаблицаКонтроляГрупп);
	СтрокаКорня.Видимость = Истина;
	// --- 
	Возврат(ТаблицаКонтроляГрупп);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗ_ТаблицаКонтроляПараметров(НаборПрав)
	// --- 
	
	ТаблицаКонтроляПараметров = Объект.ПараметрыЗаявки.Выгрузить();
	// --- 
	ТаблицаКонтроляПараметров.Колонки.Добавить("Видимость");
	ТаблицаКонтроляПараметров.ЗаполнитьЗначения(Ложь,"Видимость");
	// --- 
	МассивУдаляемыхСтрок = Новый Массив;
	Для каждого СтрокаКонтроля Из ТаблицаКонтроляПараметров Цикл
		
		СтруктураПрав = НаборПрав["п_"+_сф.КлючПоСсылке(СтрокаКонтроля.Параметр)];
		Если (НЕ СтруктураПрав.Просмотр) Тогда
			
			МассивУдаляемыхСтрок.Добавить(СтрокаКонтроля);
			
		КонецЕсли;
		
	КонецЦикла; 
	_сф.к_УдалитьЭлементыПоМассиву(ТаблицаКонтроляПараметров, МассивУдаляемыхСтрок);
	// --- 
	Возврат(ТаблицаКонтроляПараметров);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗ_СформироватьЭлементыДерева(Группа,СтрокаДерева = Неопределено, НаборПрав, Свойства, ТаблицаКонтроляГрупп=Неопределено, ТаблицаКонтроляПараметров=Неопределено)
	// --- 
	
	Если (СтрокаДерева <> Неопределено) Тогда
		КоллекцияЭлементовДерева = СтрокаДерева.ПолучитьЭлементы();
	Иначе
		КоллекцияЭлементовДерева = ДПЗ.ПолучитьЭлементы();		
	КонецЕсли; 
	КоллекцияЭлементовДерева.Очистить();
	// --- 
	
	МассивПодчиненныхЭлементов = ЗначениеИзСтрокиВнутр(Группа.ИдентификаторыВедомых);
	МассивИдентификаторовДляУдаления = Новый Массив;
	Для каждого ПодчиненныйЭлемент Из МассивПодчиненныхЭлементов Цикл
		
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда  
			ПодчиненныйЭлементОбъект = ПодчиненныйЭлемент.ПолучитьОбъект();
			Если ПодчиненныйЭлементОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;                                                                                            
		Конецесли;

		ЭтоГруппа = (ТипЗнч(ПодчиненныйЭлемент)=Тип("Число"));
		// --- 	
		Если (ЭтоГруппа) Тогда
			
			ОтборПоИдентификаторуГруппы = Новый Структура("Идентификатор",ПодчиненныйЭлемент);
			СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,ОтборПоИдентификаторуГруппы);
			// проверяем, что еще не выведена и записываем признак формирования
			Если (ТаблицаКонтроляГрупп <> Неопределено) Тогда
				
				КонтрольнаяСтрокаГруппы = _сф.к_НайтиСтроку(ТаблицаКонтроляГрупп, ОтборПоИдентификаторуГруппы);
				Если (КонтрольнаяСтрокаГруппы.Видимость) Тогда
					
					// ахтунг, зацикливание
					МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
					Продолжить;
					
				Иначе
					
					КонтрольнаяСтрокаГруппы.Видимость = Истина;
					
				КонецЕсли; 
				
			КонецЕсли; 
			// --- 
			Нстр = КоллекцияЭлементовДерева.Добавить();
			_ДПЗ_ЗаполнитьСтрокуДереваПоГруппе(Нстр, СтрокаГруппы);
			// --- 
			ДПЗ_УстановитьСостояниеСверткиСтроки(Нстр.ПолучитьИдентификатор(), Нстр.ИдентификаторГруппы, СтрокаГруппы.Раскрывать);

			_ДПЗ_СформироватьЭлементыДерева(СтрокаГруппы, Нстр, НаборПрав, Свойства, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
			// --- 
			// устанавливаем признак разрешения удаления для группы
			УдалениеРазрешено = Истина;
			
			КоллекцияПодчиненных = Нстр.ПолучитьЭлементы();
			КоличествоСформированныхПодчиненных = КоллекцияПодчиненных.Количество();
			КоличествоПодчиненных = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых).Количество();
			Если (КоличествоСформированныхПодчиненных <> КоличествоПодчиненных) Тогда
				
				УдалениеРазрешено = Ложь;
				
			Иначе
				
				Для каждого ПодчиненнаяСтрока Из КоллекцияПодчиненных Цикл
					
					Если (НЕ ПодчиненнаяСтрока.УдалениеРазрешено) Тогда
						УдалениеРазрешено = Ложь;
						Прервать;
					КонецЕсли; 
					
				КонецЦикла; 
			КонецЕсли; 
			Нстр.УдалениеРазрешено = УдалениеРазрешено;
			
		КонецЕсли; 
		// --- 
		Если (НЕ ЭтоГруппа) Тогда
			
			// проверим права
			СтруктураПрав = НаборПрав["п_"+_сф.КлючПоСсылке(ПодчиненныйЭлемент)];
			Если (НЕ СтруктураПрав.Просмотр) Тогда
				
				Продолжить;
				
			КонецЕсли;
			// --- 
			Если (ТаблицаКонтроляПараметров <> Неопределено) Тогда
				
				ОтборПоПараметру = Новый Структура("Параметр",ПодчиненныйЭлемент);
				КонтрольнаяСтрокаПараметра = _сф.к_НайтиСтроку(ТаблицаКонтроляПараметров, ОтборПоПараметру);
				Если (КонтрольнаяСтрокаПараметра.Видимость) Тогда
					
					// ахтунг, параметр уже в какой-то группе, удаляем из текущей
					МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
					Продолжить;
					
				Иначе
					
					КонтрольнаяСтрокаПараметра.Видимость = Истина;
					
				КонецЕсли; 
				
			КонецЕсли; 
			// --- 
			Нстр = КоллекцияЭлементовДерева.Добавить();
			СП = Свойства.Получить(ПодчиненныйЭлемент);
			_ДПЗ_ЗаполнитьСтрокуДереваПоПараметру(Нстр, ПодчиненныйЭлемент, СП, СтруктураПрав);
			
		КонецЕсли; 
		
		
	КонецЦикла; 
	// --- 
	Если (МассивИдентификаторовДляУдаления.Количество() <> 0) Тогда
		
		Для каждого ИдентификаторДляУдаления Из МассивИдентификаторовДляУдаления Цикл
			
			МассивПодчиненныхЭлементов.Удалить(МассивПодчиненныхЭлементов.Найти(ИдентификаторДляУдаления));
			
		КонецЦикла; 
		Группа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивПодчиненныхЭлементов);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Процедура _ДПЗ_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева,Параметр,СвойстваПараметра=Неопределено, СтруктураПрав=Неопределено)
	// --- 
	
	Если (СвойстваПараметра = Неопределено) Тогда
		СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресСвойствПараметров);
		СвойстваПараметра = СвойстваПараметров.Получить(Параметр);
		Если (СвойстваПараметра = Неопределено) Тогда
			СвойстваПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
			СвойстваПараметра = СвойстваПараметров.Получить(Параметр);
		КонецЕсли; 
	КонецЕсли; 
	
	Если (СтруктураПрав <> Неопределено) Тогда
		
		СтрокаДерева.УдалениеРазрешено = СтруктураПрав.Редактирование;
		
	КонецЕсли; 
	
	СтрокаДерева.Параметр = Параметр;	
	СтрокаДерева.Параметр_Представление = СвойстваПараметра.Наименование;	
	Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
		СтрокаДерева.ИндексКартинки = 2;				
	ИначеЕсли (СвойстваПараметра.ДинамическийПараметр) Тогда 
		СтрокаДерева.ИндексКартинки = 3;
	Иначе
		СтрокаДерева.ИндексКартинки = 1;
	КонецЕсли; 
	// --- 
	СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыЗаявки,Новый Структура("Параметр", Параметр));
	СтрокаДерева.КонтрольЗаполнения = СтрокаПараметра.КонтрольЗаполнения;
	
	//Новый механизм
	СтрокаДерева.ИдентификаторВладельца = СтрокаПараметра.ИдентификаторВладельца;
	//Новый механизм
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПЗ_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы)
	// --- 
	
	СтрокаДерева.ЭтоГруппа = Истина;
	СтрокаДерева.НаименованиеГруппы = СтрокаГруппы.Наименование;
	СтрокаДерева.Параметр_Представление = СтрокаГруппы.Наименование;
	СтрокаДерева.ИдентификаторГруппы = СтрокаГруппы.Идентификатор;
	СтрокаДерева.УдалениеРазрешено = Истина;
	// --- 
	СтрокаДерева.ИндексКартинки = 0;
	
	//Новый механизм
	СтрокаДерева.ИдентификаторВладельца = СтрокаГруппы.ИдентификаторВладельца;
	//Новый механизм
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ДПЗ_ВыполнитьПодгрузкуСтрок(ИдентификаторСтрокиРодителя)
	// --- 
	
	СтрокаДерева = ДПЗ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
	СтрокаДерева.ПолучитьЭлементы().Очистить();
	_ДПЗ_ВыполнитьПодгрузку(ИдентификаторСтрокиРодителя);
	// --- 
	
	ДПЗ_ВосстановитьСостояниеСверткиСтроки(ИдентификаторСтрокиРодителя);
	// --- 
	Элементы.ДПЗ.Развернуть(ИдентификаторСтрокиРодителя);
	ДПЗ_СохранитьСостояниеСверткиСтроки(ИдентификаторСтрокиРодителя, Истина);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПЗ_ВыполнитьПодгрузку(ИдентификаторСтрокиРодителя)
	// --- 
	
	СтрокаРодителя = ДПЗ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
	СтрокаГруппа = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор",СтрокаРодителя.ИдентификаторГруппы));
	// --- 
	НаборПравДляПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресСвойствПараметров);
	_ДПЗ_СформироватьЭлементыДерева(СтрокаГруппа,СтрокаРодителя, НаборПравДляПараметров, СвойстваПараметров);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область СобытияДерева_Заявка

&НаКлиенте
Процедура ДПЗ_ПриАктивизацииСтроки(Элемент)
	
	// ---
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_ВосстановитьСверткуДерево(Команда)
	
	ДПЗ_ВосстановитьСостояниеСвертки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_ПередНачаломИзменения(Элемент, Отказ)
	
	Если  НЕ (Элемент.ТекущийЭлемент = Элементы.ДПЗ_КонтрольЗаполнения) Тогда
		
		Отказ = Истина;
		Идентификатор = Элементы.ДПЗ.ТекущаяСтрока;
		СтрокаДПЗ = ДПЗ.НайтиПоИдентификатору(Идентификатор);
		Если (СтрокаДПЗ.ЭтоГруппа) Тогда
			
			ДоступнаСменаРежимаСвертки 	= ДПЗ_ПроверитьСостояниеВедомых(СтрокаДПЗ);
			СостояниеГруппы  			= ПолучитьНастройкуРаскрытияГруппы("ГруппыПараметровЗаявки", СтрокаДПЗ.ИдентификаторГруппы);
			
			ПараметрыФормы 	= Новый Структура("НаименованиеГруппы,ГруппаРазвернута,РежимГрузоперевозки,ДоступнаСменаРежимаСвертки", СтрокаДПЗ.НаименованиеГруппы,СостояниеГруппы, Ложь,ДоступнаСменаРежимаСвертки);
			оо 				= Новый ОписаниеОповещения("ДПЗ_ОбработатьВводНаименованияГруппы",ЭтотОбъект, Новый Структура("Редактирование",Истина)); 
			
			ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВиртуальнойГруппы", ПараметрыФормы, ,,,, оо, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе 
			ПараметрыФормы = Новый Структура("Ключ", СтрокаДПЗ.Параметр);
			оо = Новый ОписаниеОповещения("ОбработатьИзменениеПараметра",ЭтотОбъект,Новый Структура());
			ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаЭлемента", ПараметрыФормы, ,,,,оо, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецПроцедуры

&наКлиенте
Функция ДПЗ_ПроверитьСостояниеВедомых(СтрокаДерева)
	
	ДоступностьСменыРежима = Истина;
	
	тЭлеметы = СтрокаДерева.ПолучитьЭлементы();
	ДПЗ_ПроверитьСостояниеВедомыхРекурсивно(тЭлеметы, ДоступностьСменыРежима);
	
	Возврат ДоступностьСменыРежима;
	
КонецФункции

&наКлиенте
Процедура ДПЗ_ПроверитьСостояниеВедомыхРекурсивно(тЭлеметы, ДоступностьСменыРежима)
	
	Если Не ДоступностьСменыРежима Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого стрЭлемент из тЭлеметы Цикл
		Если  стрЭлемент.ЭтоГруппа Тогда
			ЭлементСостояния = ДПЗ_СостояниеСвертки.НайтиПоЗначению(стрЭлемент.ИдентификаторГруппы);
			Если ЭлементСостояния <> Неопределено Тогда
				Если ЭлементСостояния.Пометка Тогда
					ДоступностьСменыРежима = Ложь;
				КонецЕсли;
			КонецЕсли;
			Подчиненные = стрЭлемент.получитьЭлементы();
			ДПЗ_ПроверитьСостояниеВедомыхРекурсивно(подчиненные, ДоступностьСменыРежима);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры


#КонецОбласти 

#Область СостояниеСвертки_Заявка 

&НаСервере
Функция ДПЗ_УстановитьСостояниеСверткиСтроки(ИдентификаторСтроки, ИдентификаторГруппы, Развернута=Истина)
	
	ЭлементСостояния = ДПЗ_СостояниеСвертки.НайтиПоЗначению(ИдентификаторГруппы);
	Если (ЭлементСостояния = Неопределено) Тогда
		ЭлементСостояния = ДПЗ_СостояниеСвертки.Добавить(ИдентификаторГруппы);
	КонецЕсли; 
	ЭлементСостояния.Представление 	= Формат(ИдентификаторСтроки,"ЧДЦ=; ЧН=; ЧГ=");
	ЭлементСостояния.Пометка 		= Развернута;

КонецФункции

&НаКлиенте
Процедура ДПЗ_ВосстановитьСостояниеСвертки()
	// --- 
	
	тЭлементы = ДПЗ.ПолучитьЭлементы();
	ДПЗ_ВосстановитьСостояниеСверткиРекунсивно(тЭлементы);

	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_ВосстановитьСостояниеСверткиРекунсивно(тЭлементы)
	
	Для каждого тЭлемент Из тЭлементы Цикл
		
		тПодчиненные = тЭлемент.ПолучитьЭлементы();
		ДПЗ_ВосстановитьСостояниеСверткиРекунсивно(тПодчиненные);
		
		ДПЗ_ВосстановитьСостояниеСверткиСтроки(тЭлемент.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура ДПЗ_ВосстановитьСостояниеСверткиСтроки(Идентификатор)
	
	СтрокаДерева = ДПЗ.НайтиПоИдентификатору(Идентификатор);
	
	ЭлементСостояния = ДПЗ_СостояниеСвертки.НайтиПоЗначению(СтрокаДерева.ИдентификаторГруппы);
	
	Если ЭлементСостояния <> Неопределено Тогда
		
		Если ЭлементСостояния.Пометка Тогда
			Элементы.ДПЗ.Развернуть(СтрокаДерева.ПолучитьИдентификатор());
		Иначе
			Элементы.ДПЗ.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
		конецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ДПЗ_СохранитьСостояниеСверткиСтроки(ИдентификаторСтроки,Признак)
	// --- 
	
	СтрокаДерева = ДПЗ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (СтрокаДерева = Неопределено) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	// --- 
	СтрокиГрупп = Объект.ГруппыПараметровЗаявки.НайтиСтроки(Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
	Если (СтрокиГрупп.Количество() <> 0) Тогда
		СтрокаГруппы = СтрокиГрупп[0];
		СтрокаГруппы.Раскрывать = Признак;
	КонецЕсли; 
	// --- 
	ЭлементСостояния = ДПЗ_СостояниеСвертки.НайтиПоЗначению(СтрокаДерева.ИдентификаторГруппы);
	Если (ЭлементСостояния = Неопределено) Тогда
		ЭлементСостояния = ДПЗ_СостояниеСвертки.Добавить(СтрокаДерева.ИдентификаторГруппы);
	КонецЕсли; 
	ЭлементСостояния.Представление = Формат(ИдентификаторСтроки,"ЧДЦ=; ЧН=; ЧГ=");
	ЭлементСостояния.Пометка = Признак;
	
	// --- 
КонецФункции

// --- 

&НаКлиенте
Процедура ДПЗ_СвернутьВсе(Команда)
	
	тЭлементы = ДПЗ.ПолучитьЭлементы();
	ДПЗ_СвернутьРекурсивно(тЭлементы); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_СвернутьРекурсивно(тЭлементы)
	
	Для Каждого тСтр Из тЭлементы Цикл
		тСтрЭлементы = тСтр.ПолучитьЭлементы();
		ДПЗ_СвернутьРекурсивно(тСтрЭлементы);
		
		Элементы.ДПЗ.Свернуть(тСтр.ПолучитьИдентификатор());
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_РазвернутьВсе(Команда)
	
	тЭлементы = ДПЗ.ПолучитьЭлементы();
	Для Каждого тСтр Из тЭлементы Цикл
		Элементы.ДПЗ.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область ДобавлениеЭлементов_Заявка 

&НаКлиенте
Процедура ДПЗ_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ДПЗ_ОбработкаВыбораПараметра",ЭтотОбъект); 
	
	ПарамерыФормыВыбора = Новый Структура;
	ПарамерыФормыВыбора.Вставить("Множественныйвыбор"	,Истина);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПарамерыФормыВыбора,Элемент,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_ОбработкаВыбораПараметра(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если ТипЗнч(Ответ) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
		Ответ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответ);
	КонецЕсли;
	
	
	Если (Ответ <> Неопределено) Тогда
		Модифицированность = Истина;
		// --- 
		Для Каждого Параметр из Ответ Цикл
			
			Если ЭтоГруппа(Параметр) Тогда
				Продолжить;
			КонецЕсли;
			
			// проверяем, что параметр новый
			Если (ДПЗ_ДобавляемыйПараметрНовый(Параметр)) Тогда
				
				ИдентификаторДобавленнойСтроки = _ДПЗ_ДобавитьПараметр(Параметр);
				
				// ракрываем строку родителя, если свернута
				ДобавленнаяСтрока = ДПЗ.НайтиПоИдентификатору(ИдентификаторДобавленнойСтроки);
				РодительДобавленнойСтроки = ДобавленнаяСтрока.ПолучитьРодителя();
				Если (РодительДобавленнойСтроки <> Неопределено) Тогда
					
					ИдентификаторРодителяДобавленнойСтроки = РодительДобавленнойСтроки.ПолучитьИдентификатор();
					Если (НЕ Элементы.ДПЗ.Развернут(ИдентификаторРодителяДобавленнойСтроки)) Тогда
						Элементы.ДПЗ.Развернуть(ИдентификаторРодителяДобавленнойСтроки);
						ДПЗ_СохранитьСостояниеСверткиСтроки(ИдентификаторРодителяДобавленнойСтроки,Истина);
					КонецЕсли; 
					// --- 
					ДПЗ_ТекущаяГруппа = РодительДобавленнойСтроки.ИдентификаторГруппы;
					
				Иначе
					
					ДПЗ_ТекущаяГруппа = 0;
					
				КонецЕсли; 
				
				// позиционируемся на добавленный элемент
				Элементы.ДПЗ.ТекущаяСтрока = ИдентификаторДобавленнойСтроки;
				// --- 
				ДПЗ_ТекущийПараметр = ДобавленнаяСтрока.Параметр;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// --- 
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ДПЗ_ДобавляемыйПараметрНовый(Параметр)
	// --- 
	
	Отбор = Новый Структура("Параметр",Параметр);
	СтрокиПараметра = Объект.ПараметрыЗаявки.НайтиСтроки(Отбор);
	Возврат(СтрокиПараметра.Количество()=0);
	
	// --- 
КонецФункции
  
&НаСервере
Функция ДПЗ_ТекущийРодитель()
	// --- 
	
	Если (Элементы.ДПЗ.ТекущаяСтрока <> Неопределено) Тогда
		
		ИдентификаторТекущейСтроки = Элементы.ДПЗ.ТекущаяСтрока;
		ТекущаяСтрока = ДПЗ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		РодительТекущейСтроки = ТекущаяСтрока.ПолучитьРодителя();
		Если (РодительТекущейСтроки <> Неопределено) Тогда
			Возврат(РодительТекущейСтроки);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат(ДПЗ);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗ_ДобавитьПараметр(Параметр,ПереносПараметров = ложь, ИдентификаторСтрокиРодителя=Неопределено)
	// --- 
	//Новый механизм
	ИдентификаторГруппыВладельца = Неопределено;
	//Новый механизм

	// добавляем в ТЧ параметров
	СтрокаТЧ = Объект.ПараметрыЗаявки.Добавить();
	СтрокаТЧ.Параметр = Параметр;
	
	Если ПереносПараметров Тогда
		
		Если ИдентификаторСтрокиРодителя <> Неопределено Тогда
			ТекущаяСтрока = ДПЗ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
			//Новый механизм
			ИдентификаторГруппыВладельца = ТекущаяСтрока.ИдентификаторГруппы;
			//Новый механизм
		Иначе
			ТекущаяСтрока = ДПЗ;
		Конецесли;
		
		ТР =  ТекущаяСтрока;
	Иначе
		// добавляем в дерево
		Если (Элементы.ДПЗ.ТекущаяСтрока <> Неопределено) Тогда
			ИдентификаторТекущейСтроки = Элементы.ДПЗ.ТекущаяСтрока;
			ТекущаяСтрока = ДПЗ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
			Если (ТекущаяСтрока.ЭтоГруппа) Тогда
				ТР = ТекущаяСтрока;
			Иначе
				ТР = ДПЗ_ТекущийРодитель();	
			КонецЕсли; 
			
			//Новый механизм
			Если ТР <> ДПЗ Тогда
				ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
			КонецЕсли;
			//Новый механизм
		Иначе
			ТР = ДПЗ_ТекущийРодитель();	
		КонецЕсли; 
	КонецЕсли;
	
	//Новый механизм
	Если ИдентификаторГруппыВладельца <>  Неопределено Тогда
		ОтборСтрок = Новый Структура("Идентификатор",ТР.ИдентификаторГруппы);
		мСтрокиГрупп = Объект.ГруппыПараметровЗаявки.НайтиСтроки(ОтборСтрок);
		Если мСтрокиГрупп.Количество() > 0 Тогда
			СтрокаГруппы = мСтрокиГрупп[0];
			СтрокаТЧ.ИдентификаторВладельца = СтрокаГруппы.ИдентификаторГруппы; 	
		КонецЕсли;
	КонецЕсли; 
	//Новый механизм
	
	СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
	// заполняем строку дерева
	НаборПравДляПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	СтруктураПрав = НаборПравДляПараметров["п_"+_сф.КлючПоСсылке(Параметр)];
	_ДПЗ_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева,Параметр,,СтруктураПрав);
	// записываем принадлежность параметра группе
	_ДПЗ_ДобавитьЭлементГруппы(Параметр, _ДПЗ_ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева));
	// --- 
	Возврат(СтрокаДерева.ПолучитьИдентификатор());
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗ_ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева)
	// --- 
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтроки = Неопределено) Тогда
		СтрокаГруппы = Объект.ГруппыПараметровЗаявки[0];
	Иначе
		Отбор = Новый Структура("Идентификатор", РодительСтроки.ИдентификаторГруппы);
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки, Отбор);
	КонецЕсли; 
	
	Возврат(СтрокаГруппы);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ДПЗ_ДобавитьЭлементГруппы(Элемент, СтрокаГруппы, НовыйПредыдущий=Неопределено)
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	Если (НовыйПредыдущий =  Неопределено) Тогда
		МассивВедомых.Добавить(Элемент);
	Иначе
		
		ИндексПредыдущего = МассивВедомых.Найти(НовыйПредыдущий);
		Если (ИндексПредыдущего <> Неопределено) Тогда
			МассивВедомых.Вставить(ИндексПредыдущего,Элемент);
		Иначе
			МассивВедомых.Добавить(Элемент);
		КонецЕсли; 
		
	КонецЕсли; 
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	Если (ТипЗнч(Элемент)=Тип("Число")) Тогда
		
		ДПЗ_ТекущаяГруппа = Элемент;
		ДПЗ_ТекущийПараметр = Неопределено;
		
	Иначе
		
		ДПЗ_ТекущаяГруппа = СтрокаГруппы.Идентификатор;
		ДПЗ_ТекущийПараметр = Элемент;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПЗ_ПереместитьЭлементГруппы(Элемент, СтрокаГруппы, НовыйПредыдущий);
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	// --- 
	Если (НовыйПредыдущий = Неопределено ) Тогда
		
		ИндексЭлемента = МассивВедомых.Найти(Элемент);
		МассивВедомых.Удалить(ИндексЭлемента);
		МассивВедомых.Добавить(Элемент);
		
	Иначе
		
		ИндесНовогоПредыдущего = МассивВедомых.Найти(НовыйПредыдущий);
		ИндексЭлемента = МассивВедомых.Найти(Элемент);
		МассивВедомых.Удалить(ИндексЭлемента);
		МассивВедомых.Вставить(ИндесНовогоПредыдущего,Элемент);
		
	КонецЕсли; 
	// --- 
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПЗ_УдалитьЭлементГруппы(Элемент, СтрокаГруппы)
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	МассивВедомых.Удалить(МассивВедомых.Найти(Элемент));
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	
	// --- 
КонецПроцедуры
 
#КонецОбласти 

#Область ДобавлениеГруппЭлементов_Заявка

&НаКлиенте
Процедура ДПЗ_ДобавитьГруппу(Команда)
	
	// спрашиваем название группы
	ПараметрыФормы = Новый Структура("НоваяГруппа,РежимГрузоперевозки,ДоступнаСменаРежимаСвертки", Истина,Ложь,Истина);

	ПОВ = Новый ОписаниеОповещения("ДПЗ_ОбработатьВводНаименованияГруппы",ЭтотОбъект, Новый Структура()); 
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВиртуальнойГруппы",ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_ОбработатьВводНаименованияГруппы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		Модифицированность = истина;
		РедактированиеГруппы = Ложь;
		ДополнительныеПараметры.Свойство("Редактирование",РедактированиеГруппы);
		Если (РедактированиеГруппы = Неопределено ) Тогда
			РедактированиеГруппы = Ложь;
		КонецЕсли; 
		Если (РедактированиеГруппы) Тогда
			
			ИдентификаторСтроки = _ДПЗ_ОбновитьГруппу(Элементы.ДПЗ.ТекущаяСтрока,Ответ);
			
		Иначе
			
			ИдентификаторСтроки = _ДПЗ_ДобавитьГруппу(Ответ);	
			
		КонецЕсли; 
		
		ИдентификаторГруппы = ДПЗ.НайтипоИдентификатору(ИдентификаторСтроки).ИдентификаторГруппы;
		ДПЗ_УстановитьСостояниеСверткиСтроки(ИдентификаторСтроки, ИдентификаторГруппы, Ответ.ГруппаРазвернута);
	//	ДПЗ_ВосстановитьСостояниеСверткиСтроки(ИдентификаторСтроки);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДПЗ_ОбновитьГруппу(ИдентификаторСтрокиДерева,СтруктураПараметров)
	// --- 
	
	СтрокаДерева = ДПЗ.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
	СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
	
	СтрокаГруппы.Наименование 			= СтруктураПараметров.НаименованиеГруппы;
	СтрокаГруппы.Раскрывать 			= СтруктураПараметров.ГруппаРазвернута;
	// --- 
	_ДПЗ_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы);
	
	Возврат(ИдентификаторСтрокиДерева);
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ДПЗ_ДобавитьГруппу(СтруктураПараметров, ИдентификаторГруппыРодителя= Неопределено)
	// --- 
	//Новый механизм
	ИдентификаторГруппыВладельца = Неопределено;
	//Новый механизм

	// создаем строку ТЧ
	СтрокаГруппы = Объект.ГруппыПараметровЗаявки.Добавить();
	СтрокаГруппы.Идентификатор 			= _ДПЗ_ИдентификаторНовойГруппы();
	
	СтрокаГруппы.Наименование 			= СтруктураПараметров.НаименованиеГруппы;
	СтрокаГруппы.Раскрывать 			= СтруктураПараметров.ГруппаРазвернута;
	
	СтрокаГруппы.ИдентификаторыВедомых 	= ЗначениеВСтрокуВнутр(Новый Массив);
	// --- 
	// создаем строку дерева
	Если ИдентификаторГруппыРодителя = Неопределено Тогда
		Если (Элементы.ДПЗ.ТекущаяСтрока <> Неопределено) Тогда
			ИдентификаторТекущейСтроки = Элементы.ДПЗ.ТекущаяСтрока;
			ТекущаяСтрока = ДПЗ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
			Если (ТекущаяСтрока.ЭтоГруппа) Тогда
				ТР = ТекущаяСтрока;
			Иначе
				ТР = ДПЗ_ТекущийРодитель();	
			КонецЕсли; 
			
			//Новый механизм
			Если ТР <> ДПЗ Тогда
				ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
			КонецЕсли;
			//Новый механизм
			
		Иначе
			ТР = ДПЗ_ТекущийРодитель();	
		КонецЕсли; 
	Иначе
		ТР = ДПЗ.НайтиПоИдентификатору(ИдентификаторГруппыРодителя);
		
		//Новый механизм
		Если ТР <> Неопределено Тогда
			ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
		КонецЕсли;
		//Новый механизм
		
	КонецЕсли;
	
	//Новый механизм
	СтрокаГруппы.ИдентификаторГруппы = Новый УникальныйИдентификатор;
	Если ИдентификаторГруппыВладельца <>  Неопределено Тогда
		ОтборСтрок = Новый Структура("Идентификатор",ИдентификаторГруппыВладельца);
		мСтрокиГрупп = Объект.ГруппыПараметровЗаявки.НайтиСтроки(ОтборСтрок);
		Если мСтрокиГрупп.Количество() > 0 Тогда
			СтрокаГруппыВладельца = мСтрокиГрупп[0];
			СтрокаГруппы.ИдентификаторВладельца = СтрокаГруппыВладельца.ИдентификаторГруппы; 	
		КонецЕсли;
	КонецЕсли;
	//Новый механизм
	
	// --- 
	СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
	// заполняем
	_ДПЗ_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы);
	// добавляем в массив элементов родителя
	_ДПЗ_ДобавитьЭлементГруппы(СтрокаГруппы.Идентификатор, _ДПЗ_ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева));
	// --- 
	Возврат(СтрокаДерева.ПолучитьИдентификатор());
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗ_ИдентификаторНовойГруппы()
	// --- 
	
	ТЗИ = Объект.ГруппыПараметровЗаявки.Выгрузить(,"Идентификатор");
	ТЗИ.Сортировать("Идентификатор Возр");
	ПоследнийИдентификатор = _сф.к_ПоследнийЭлемент(ТЗИ).Идентификатор;
	НовыйИдентификатор = ПоследнийИдентификатор+1;
	Возврат(НовыйИдентификатор);
	
	// --- 
КонецФункции
 

#КонецОбласти 

#Область УдалениеЭлементов_Заявка 

&НаКлиенте
Процедура ДПЗ_ПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	Идентификатор = Элементы.ДПЗ.ТекущаяСтрока;
	СтрокаДерева = ДПЗ.НайтиПоИдентификатору(Идентификатор);
	// --- 
	Если (СтрокаДерева.УдалениеРазрешено) Тогда
		
		Модифицированность = истина;
		
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			
			Если (СтрокаДерева.ПолучитьЭлементы().Количество() <> 0) Тогда
				
				ПОВ = Новый ОписаниеОповещения("ДПЗ_ОбработкаПодтвержденияУдаленияГруппы",ЭтотОбъект, Новый Структура()); 
				ПоказатьВопрос(ПОВ,"Группа будет удалена вместе с параметрами. Продолжить?", РежимДиалогаВопрос.ДаНет);
				
			Иначе
				
				ДПЗ_УдалитьСтрокуДерева(Идентификатор);
				
			КонецЕсли; 
			
		Иначе
			
			ДПЗ_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЕсли; 
		
	Иначе
		
		_УФК.ВывестиПредупреждение("Недостаточно прав для данного действия");
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_ОбработкаПодтвержденияУдаленияГруппы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			ДПЗ_УдалитьСтрокуДерева(Элементы.ДПЗ.ТекущаяСтрока);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ДПЗ_УдалитьСтрокуДерева(Идентификатор)
	// --- 
	
	НоваяТекущаяСтрока = Неопределено;
	// --- 
	СтрокаДерева = ДПЗ.НайтиПоИдентификатору(Идентификатор);
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		КоллекцияСтрок = ДПЗ.ПолучитьЭлементы();
	Иначе
		КоллекцияСтрок = РодительСтрокиДерева.ПолучитьЭлементы();
	КонецЕсли; 
	КоличествоЭлементовКоллекции = КоллекцияСтрок.Количество();
	Если (КоличествоЭлементовКоллекции > 1) Тогда
		
		// получаем индекс
		ИндексУдаляемойСтроки = КоллекцияСтрок.Индекс(СтрокаДерева);
		Если (ИндексУдаляемойСтроки <> КоличествоЭлементовКоллекции-1) Тогда
			НоваяТекущаяСтрока = КоллекцияСтрок[ИндексУдаляемойСтроки+1].ПолучитьИдентификатор();
		Иначе 
			НоваяТекущаяСтрока = КоллекцияСтрок[ИндексУдаляемойСтроки-1].ПолучитьИдентификатор();
		КонецЕсли; 
		
	Иначе
		
		Если (РодительСтрокиДерева <> Неопределено) Тогда
			
			НоваяТекущаяСтрока = РодительСтрокиДерева.ПолучитьИдентификатор();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// удаляем рекурсивно группы/параметры
	Результат = _ДПЗ_УдалитьПараметрыРекурсивно(Идентификатор);
	Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
		
		// удаляем строку дерева
		_ДПЗ_УдалитьСтрокуДерева(Идентификатор);
		
		Если (НоваяТекущаяСтрока <> Неопределено ) Тогда
			
			Элементы.ДПЗ.ТекущаяСтрока = НоваяТекущаяСтрока;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДПЗ_УдалитьПараметрыРекурсивно(ИдентификаторСтроки)
	// --- 
	
	СтрокаДерева = ДПЗ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		ЭлементДПЗ = СтрокаДерева.ИдентификаторГруппы;
	Иначе
		ЭлементДПЗ = СтрокаДерева.Параметр;
	КонецЕсли; 
	
	// удаляем из родителя
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		СтрокаГруппы = Объект.ГруппыПараметровЗаявки[0];
	Иначе
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор", РодительСтрокиДерева.ИдентификаторГруппы));
	КонецЕсли; 
	_ДПЗ_УдалитьЭлементГруппы(ЭлементДПЗ, СтрокаГруппы);
	
	// физически удаляем
	_ДПЗ_УдалитьЭлементДПЗ(ЭлементДПЗ);
	// --- 
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Процедура _ДПЗ_УдалитьЭлементДПЗ(ЭлементДПЗ)
	// --- 
	
	Если (ТипЗнч(ЭлементДПЗ)=Тип("Число")) Тогда
		
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор", ЭлементДПЗ));
		МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
		Для каждого Ведомый Из МассивВедомых Цикл
			
			_ДПЗ_УдалитьЭлементДПЗ(Ведомый);
			
		КонецЦикла; 
		// --- 
		Объект.ГруппыПараметровЗаявки.Удалить(Объект.ГруппыПараметровЗаявки.Индекс(СтрокаГруппы));
		
	Иначе
		
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыЗаявки,Новый Структура("Параметр",ЭлементДПЗ));
		Объект.ПараметрыЗаявки.Удалить(Объект.ПараметрыЗаявки.Индекс(СтрокаПараметра));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

#КонецОбласти 

#Область ПеремещениеЭлементов_Заявка

&НаКлиенте
Процедура ДПЗ_ПереместитьВверх(Команда)
	
	ДПЗ_СдвинутьСтроку(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_ПереместитьВниз(Команда)
	
	ДПЗ_СдвинутьСтроку(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_СдвинутьСтроку(Направление)
	// --- 
	
	ТекущаяСтрока = Элементы.ДПЗ.ТекущаяСтрока;
	СтрокаДерева = ДПЗ.НайтиПоИдентификатору(ТекущаяСтрока);
	РодительТекущейСтроки = СтрокаДерева.ПолучитьРодителя();
	Если (РодительТекущейСтроки = Неопределено) Тогда
		РодительТекущейСтроки = ДПЗ;
		ГруппаРодитель = 0;
	Иначе
		ГруппаРодитель = РодительТекущейСтроки.ИдентификаторГруппы;	
	КонецЕсли; 
	// --- 
	КоллекцияСтрок = РодительТекущейСтроки.ПолучитьЭлементы();
	КоличествоСтрок = КоллекцияСтрок.Количество();
	Если (КоличествоСтрок = 1) Тогда
		Возврат;
	КонецЕсли; 
	ИндексТекущейСтроки = КоллекцияСтрок.Индекс(СтрокаДерева);
	// --- 
	// проверяем крайние положения
	// если уперлись - переносим в конец/начало
	Сдвиг = 0;
	ПредыдущееДействие = Неопределено;
	СледующееДействие = Неопределено;
	// --- 
	Если (ИндексТекущейСтроки = 0 И Направление=-1) Тогда
		
		Сдвиг = КоличествоСтрок-1; // с плюсом;
		ПредыдущаяСтрока = КоллекцияСтрок.Получить(КоличествоСтрок-1);
		Если (ПредыдущаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.Параметр;
		КонецЕсли; 
		
	ИначеЕсли (ИндексТекущейСтроки <> 0 И Направление=-1) Тогда 
		
		Сдвиг = -1;
		СледующаяСтрока = КоллекцияСтрок.Получить(ИндексТекущейСтроки+Сдвиг);
		Если (СледующаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторСледующейСтроки = СледующаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторСледующейСтроки = СледующаяСтрока.Параметр;
		КонецЕсли;
		
	ИначеЕсли (ИндексТекущейСтроки = КоличествоСтрок-1 И Направление=1) Тогда 
		
		 Сдвиг = -(КоличествоСтрок-1);
		 СледующаяСтрока = КоллекцияСтрок.Получить(0);
		 Если (СледующаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторСледующейСтроки = СледующаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторСледующейСтроки = СледующаяСтрока.Параметр;
		КонецЕсли;
		 
	ИначеЕсли (ИндексТекущейСтроки <> КоличествоСтрок-1 И Направление=1) Тогда 
		
		 Сдвиг = 1;
		 ПредыдущаяСтрока = КоллекцияСтрок.Получить(ИндексТекущейСтроки+Сдвиг);
		 Если (ПредыдущаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.Параметр;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Ответ = _ДПЗ_ИзменитьПорядокСтроки(ГруппаРодитель, ТекущаяСтрока, ИдентификаторПредыдущейСтроки, ИдентификаторСледующейСтроки);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		КоллекцияСтрок.Сдвинуть(КоллекцияСтрок.Индекс(СтрокаДерева),Сдвиг);
		
	Иначе
		
		Сообщить(_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДПЗ_ИзменитьПорядокСтроки(ИдентификаторГруппыРодителя, ИдентификаторТекущейСтроки, ИдентификаторПредыдущейСтроки, ИдентификаторСледующейСтроки)
	// --- 
	
	Попытка
		
		Группа = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор",ИдентификаторГруппыРодителя));
		МассивЭлементов = ЗначениеИзСтрокиВнутр(Группа.ИдентификаторыВедомых);
		ТаблицаЭлементов = Новый ТаблицаЗначений;
		ТаблицаЭлементов.Колонки.Добавить("Идентификатор");
		Для каждого Элемент Из МассивЭлементов Цикл
			Нстр = ТаблицаЭлементов.Добавить();
			Нстр.Идентификатор = Элемент;
		КонецЦикла; 
		СтрокаДерева = ДПЗ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			СдвигаемоеЗначение = СтрокаДерева.ИдентификаторГруппы;
		Иначе
			СдвигаемоеЗначение = СтрокаДерева.Параметр;
		КонецЕсли; 
		СтрокаСдвигаемогоЗначения = _сф.к_НайтиСтроку(ТаблицаЭлементов, Новый Структура("Идентификатор",СдвигаемоеЗначение));
		// --- 
		Если (ИдентификаторПредыдущейСтроки <> Неопределено) Тогда
			
			ОтносительноеЗначение = ИдентификаторПредыдущейСтроки;
			//СтрокаДействия = _сф.к_НайтиСтроку(ТЧ, Новый Структура("Действие",ПредыдущееДействие));
			
		ИначеЕсли (ИдентификаторСледующейСтроки <> Неопределено) Тогда 
			
			ОтносительноеЗначение = ИдентификаторСледующейСтроки;
			
		КонецЕсли; 
		СтрокаОтносительногоЗначения = _сф.к_НайтиСтроку(ТаблицаЭлементов, Новый Структура("Идентификатор",ОтносительноеЗначение));
		Сдвиг = (ТаблицаЭлементов.Индекс(СтрокаОтносительногоЗначения)-ТаблицаЭлементов.Индекс(СтрокаСдвигаемогоЗначения));
		ТаблицаЭлементов.Сдвинуть(СтрокаСдвигаемогоЗначения,Сдвиг);
		// --- 
		МассивЭлементов=ТаблицаЭлементов.ВыгрузитьКолонку("Идентификатор");
		Группа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивЭлементов);
		
		
	Исключение
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции
 
#КонецОбласти 

#Область ДрагЭндДроп_Заявка

&НаКлиенте
Процедура ДПЗ_НачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если (Элементы.ДПЗ.ВыделенныеСтроки.Количество() > 1) Тогда
		
		Выполнение = Ложь;
		ПоказатьПредупреждение(,"Множественное перетаскивание недоступно.");
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_Перетаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка=Ложь;
	// --- 
	
	// проверим, что действие, в которое мы вставляем не находится ниже по иерархии вставляемого действия
	// сформируем массив действий по иерархии от текущего вверх
	МассивСтрок = Новый Массив;
	ИдентификаторТекущейСтроки = Строка;
	МассивИдентификаторов = ПараметрыПеретаскивания.Значение;
	Если (ИдентификаторТекущейСтроки = Неопределено) Тогда
		
		НовыйРодитель = 0;
		НовыйПредыдущий = Неопределено;
		ВставкаРазрешена = Истина;
		
	Иначе
		
		СтрокаДерева = ДПЗ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			МассивСтрок.Добавить(СтрокаДерева.ИдентификаторГруппы);	
			НовыйРодитель = СтрокаДерева.ИдентификаторГруппы;
			НовыйПредыдущий = Неопределено;
		Иначе
			НовыйПредыдущий = СтрокаДерева.Параметр;
			НовыйРодительСтрока = СтрокаДерева.ПолучитьРодителя();
			Если (НовыйРодительСтрока <>  Неопределено) Тогда
				НовыйРодитель = НовыйРодительСтрока.ИдентификаторГруппы;
			Иначе
				НовыйРодитель = 0;
			КонецЕсли; 
		КонецЕсли; 
		
		РодительСтроки = СтрокаДерева.ПолучитьРодителя();
		Пока (РодительСтроки <> Неопределено) Цикл
			
			// всегда группа
			МассивСтрок.Добавить(РодительСтроки.ИдентификаторГруппы);
			РодительСтроки = РодительСтроки.ПолучитьРодителя();
			
		КонецЦикла; 
		// ---
		МассивПеремещаемыхСтрок = Новый Массив;
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			ПеремещаемаяСтрокаДерева = ДПЗ.НайтиПоИдентификатору(Идентификатор);
			Если (ПеремещаемаяСтрокаДерева.ЭтоГруппа) Тогда
				МассивПеремещаемыхСтрок.Добавить(ПеремещаемаяСтрокаДерева.ИдентификаторГруппы);
			Иначе
				МассивПеремещаемыхСтрок.Добавить(ПеремещаемаяСтрокаДерева.Параметр);	
			КонецЕсли; 
		КонецЦикла; 
		// --- 
		ВставкаРазрешена = Истина;
		Для каждого ПеремещаемаяСтрока Из МассивПеремещаемыхСтрок Цикл
			
			Если (МассивСтрок.Найти(ПеремещаемаяСтрока) <> Неопределено) Тогда
				
				ВставкаРазрешена = Ложь;
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	Если (НЕ ВставкаРазрешена) Тогда
		
		ПоказатьПредупреждение(,"Вставка в иерархию с нарушением логической целостности.");
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	Ответ = _ДПЗ_ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель,НовыйПредыдущий);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		Модифицированность = Истина;
		
		// удаляем вставляемые действия
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			
			_ДПЗ_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЦикла; 
		
		Если (ИдентификаторТекущейСтроки = Неопределено) Тогда
			
			ПолноеОбновление = Истина;
			_ДПЗ_Обновить();
			ДПЗ_ВосстановитьСостояниеСвертки();
			
		Иначе
			
			// переформировываем элементы текущего действия
			ПолноеОбновление = Ложь;
			СтрокаДерева = ДПЗ.НайтиПоИдентификатору(Строка);
			Если (СтрокаДерева.ЭтоГруппа) Тогда
				
				ТекущаяСтрока = Строка;
				ДПЗ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
				
			Иначе
				
				СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
				Если (СтрокаРодителя = Неопределено) Тогда
					
					// обновить все
					// тут бы процедуру анализа новых ... TODO
					ПолноеОбновление = Истина;
					_ДПЗ_Обновить();
					ДПЗ_ВосстановитьСостояниеСвертки();
					
				Иначе
					
					ТекущаяСтрока = СтрокаРодителя.ПолучитьИдентификатор();
					ДПЗ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			
		КонецЕсли; 
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ДПЗ_ВыполнитьПеремещениеСтрок(МассивИдентификаторовСтрок, НовыйРодитель, НовыйПредыдущий=Неопределено)
	// --- 
	
	Попытка
		
		Для каждого ИдентификаторСтроки Из МассивИдентификаторовСтрок Цикл
			
			Результат = _ДПЗ_УстановитьРодителяСтроки(ИдентификаторСтроки, НовыйРодитель, НовыйПредыдущий);
			Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
				
				Возврат(_УФКС.Ответ(1,_УФКС.ПредставлениеОшибки(Результат)));
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗ_УстановитьРодителяСтроки(ИдентификаторСтроки, НовыйРодитель, НовыйПредыдущий=Неопределено)
	// --- 
	
	Строка = ДПЗ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (Строка.ЭтоГруппа) Тогда
		ПеремещаемоеЗначение = Строка.ИдентификаторГруппы;
	Иначе
		ПеремещаемоеЗначение = Строка.Параметр;
	КонецЕсли; 
	
	// --- 
	
	ГруппаСтарыйРодитель = _ДПЗ_ОпределитьСтрокуГруппуСтрокиДерева(Строка);
	ГруппаНовыйРодитель = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор",НовыйРодитель));
	
	Если (ГруппаСтарыйРодитель.Идентификатор <> НовыйРодитель) Тогда
		
		Попытка
			
			// удаляем из старого родителя
			_ДПЗ_УдалитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаСтарыйРодитель);
			
			// добавляем в новый
			_ДПЗ_ДобавитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаНовыйРодитель, НовыйПредыдущий);
			
			//Новый механизм
			_ДПЗ_УстановитьНовогоВладельца(ИдентификаторСтроки,ГруппаНовыйРодитель.ИдентификаторГруппы);
			//Новый механизм
	Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			Сообщить(ТекстОшибки);
			// --- 
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецПопытки; 
		
	Иначе
		
		// перемещение в пределах родителя
		_ДПЗ_ПереместитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаНовыйРодитель, НовыйПредыдущий);
		
	КонецЕсли; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

//Новый механизм
&наСервере
Процедура _ДПЗ_УстановитьНовогоВладельца(ИдентификаторСтроки, ИдентификаторГруппы)
	
	ИдентификаторВладельца = ИдентификаторГруппы;
	
	Строка = ДПЗ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Строка.ЭтоГруппа Тогда
		мСтроки = Объект.ГруппыПараметровЗаявки.НайтиСтроки(Новый Структура("Идентификатор",Строка.ИдентификаторГруппы));
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0];	
		КонецЕсли;
		Если СтрокаДанных.ИдентификаторГруппы = ИдентификаторГруппы Тогда
			ИдентификаторВладельца = Неопределено;
		КонецЕсли;
	Иначе
		мСтроки = Объект.ПараметрыЗаявки.НайтиСтроки(Новый Структура("Параметр",Строка.Параметр));
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0];	
		КонецЕсли;
	КонецЕсли; 
	
	СтрокаДанных.ИдентификаторВладельца = ИдентификаторВладельца;
	
КонецПроцедуры
//Новый механизм


&НаСервере
Процедура _ДПЗ_УдалитьСтрокуДерева(ИдентификаторСтроки)
	// --- 
	
	СтрокаДерева = ДПЗ.НайтиПоИдентификатору(ИдентификаторСтроки);
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		РодительСтрокиДерева = ДПЗ;
	КонецЕсли; 
	РодительСтрокиДерева.ПолучитьЭлементы().Удалить(СтрокаДерева);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область Копипаста_Заявка

&НаКлиенте
Процедура ДПЗ_ПереместитьНаУровеньВверх(Команда)
	
	ИдентификаторТекущейСтроки = Элементы.ДПЗ.ТекущаяСтрока;
	ТекущаяСтрока = ДПЗ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
	Если (РодительСтроки <> Неопределено) Тогда
		
		РодительРодителя = РодительСтроки.ПолучитьРодителя();
		НовыйРодитель = ТекущаяСтрока.ИдентификаторГруппы;
		
		// --- 
		МассивИдентификаторов = Новый Массив;
		МассивИдентификаторов.Добавить(ИдентификаторТекущейСтроки);
		Ответ = _ДПЗ_ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель);
		Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
			
			// удаляем вставляемые действия
			Для каждого Идентификатор Из МассивИдентификаторов Цикл
				
				_ДПЗ_УдалитьСтрокуДерева(Идентификатор);
				
			КонецЦикла; 
			
			// переформировываем элементы текущего действия
			ПолноеОбновление = Ложь;
			Если (РодительРодителя = Неопределено) Тогда
				
				ПолноеОбновление = Истина;
				_ДПЗ_Обновить();
				ДПЗ_ВосстановитьСостояниеСвертки();
				
			Иначе
				
				ДПЗ_ВыполнитьПодгрузкуСтрок(РодительРодителя);
				
			КонецЕсли; 
						
		Иначе
			
			ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		// --- 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_Строка_Вырезать(Команда)
	
	// снимаем признак нахождения в буфере
	Для каждого Стр Из ДПЗ_БуферОбмена Цикл
		ИдентификаторСтроки = Число(Стр.Представление);
		СтрокаДерева = ДПЗ.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если (СтрокаДерева <> Неопределено) Тогда
			СтрокаДерева.Буфер = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	ДПЗ_БуферОбмена.Очистить();
	// --- 
	Для каждого Стр Из Элементы.ДПЗ.ВыделенныеСтроки Цикл
		
		ВыделеннаяСтрока = ДПЗ.НайтиПоИдентификатору(Стр);
		ВыделеннаяСтрока.Буфер = Истина;
		Если (ВыделеннаяСтрока.ЭтоГруппа) Тогда
			ДПЗ_БуферОбмена.Добавить(ВыделеннаяСтрока.ИдентификаторГруппы, Формат(Стр,"ЧДЦ=; ЧН=; ЧГ="));
		Иначе
			ДПЗ_БуферОбмена.Добавить(ВыделеннаяСтрока.Параметр, Формат(Стр,"ЧДЦ=; ЧН=; ЧГ="));	
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_Строка_Вставить(Команда)
	
	МассивСтрок = Новый Массив;
	ИдентификаторТекущейСтроки = Элементы.ДПЗ.ТекущаяСтрока;
	// --- 
	СтрокаДерева = ДПЗ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		МассивСтрок.Добавить(СтрокаДерева.ИдентификаторГруппы);	
		НовыйРодитель = СтрокаДерева.ИдентификаторГруппы;
		НовыйПредыдущий = Неопределено;
	Иначе
		НовыйПредыдущий = СтрокаДерева.Параметр;
		НовыйРодительСтрока = СтрокаДерева.ПолучитьРодителя();
		Если (НовыйРодительСтрока <>  Неопределено) Тогда
			НовыйРодитель = НовыйРодительСтрока.ИдентификаторГруппы;
		Иначе
			НовыйРодитель = 0;
		КонецЕсли; 
	КонецЕсли; 
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Пока (РодительСтроки <> Неопределено) Цикл
		
		// всегда группа
		МассивСтрок.Добавить(РодительСтроки.ИдентификаторГруппы);
		РодительСтроки = РодительСтроки.ПолучитьРодителя();
		
	КонецЦикла; 
	// ---
	МассивПеремещаемыхСтрок = ДПЗ_БуферОбмена.ВыгрузитьЗначения();
	// --- 
	ВставкаРазрешена = Истина;
	Для каждого ПеремещаемаяСтрока Из МассивПеремещаемыхСтрок Цикл
		
		Если (МассивСтрок.Найти(ПеремещаемаяСтрока) <> Неопределено) Тогда
			
			ВставкаРазрешена = Ложь;
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	Если (НЕ ВставкаРазрешена) Тогда
		
		ПоказатьПредупреждение(,"Вставка в иерархию с нарушением логической целостности.");
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	МассивИдентификаторов = Новый Массив;
	Для каждого ЭлементБуфера Из ДПЗ_БуферОбмена Цикл
		
		МассивИдентификаторов.Добавить(Число(ЭлементБуфера.Представление));
		
	КонецЦикла; 
	// --- 
	Ответ = _ДПЗ_ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель,НовыйПредыдущий);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		// удаляем вставляемые действия
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			
			_ДПЗ_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЦикла; 
		
		// очищаем буфер
		ДПЗ_БуферОбмена.Очистить();
		
		// переформировываем элементы текущего действия
		ПолноеОбновление = Ложь;
		СтрокаДерева = ДПЗ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			
			ТекущаяСтрока = ИдентификаторТекущейСтроки;
			ДПЗ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
			
		Иначе
			
			СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
			Если (СтрокаРодителя = Неопределено) Тогда
				
				// обновить все
				// тут бы процедуру анализа новых ... TODO
				ПолноеОбновление = Истина;
				_ДПЗ_Обновить();
				ДПЗ_ВосстановитьСостояниеСвертки();
				
			Иначе
				
				ТекущаяСтрока = СтрокаРодителя.ПолучитьИдентификатор();
				ДПЗ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ФормированиеДерева_Заказ

&НаКлиенте
Процедура ДПЗаказ_Обновить()
	// --- 
	
	_ДПЗаказ_Обновить();
	ДПЗаказ_ВосстановитьСостояниеСвертки();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПЗаказ_Обновить()
	// --- 
	
	// получаем текущие группы 		
	Элементы.ДПЗаказ.НачальноеОтображениеДерева=НачальноеОтображениеДерева.НеРаскрывать;
	ДПЗаказ.ПолучитьЭлементы().Очистить();
	// ---------------------------------------------------------------------------- 
	Если (Объект.ГруппыПараметровЗаказа.Количество()=0) Тогда
		Корень = Объект.ГруппыПараметровЗаказа.Добавить();
		Корень.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(Новый Массив);
	Иначе
		Корень = Объект.ГруппыПараметровЗаказа[0];	
	КонецЕсли; 
	Если (НЕ Корень.Раскрывать) Тогда
		Корень.Раскрывать = Истина;
	КонецЕсли; 
	// --- 
	НаборПравДляПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресСвойствПараметров);
	// --- 
	ТаблицаКонтроляГрупп = _ДПЗаказ_ТаблицаКонтроляГрупп();
	ТаблицаКонтроляПараметров = _ДПЗаказ_ТаблицаКонтроляПараметров(НаборПравДляПараметров);
	// --- 
	_ДПЗаказ_СформироватьЭлементыДерева(Корень,Неопределено,НаборПравДляПараметров,СвойстваПараметров, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
	
	// после формирования проверяем, нет ли потерянных групп, 
	// если есть, то засовываем их в корень и переформировываем дерево
	// сообщаем о потерянных группах
	
	МассивНеучтенныхГрупп = _сф.к_НайтиСтроки(ТаблицаКонтроляГрупп,Новый Структура("Видимость",Ложь));
	Если (МассивНеучтенныхГрупп.Количество() <> 0) Тогда
		
		// переносим каждую в корень
		Для каждого КонтрольнаяСтрокаГруппы Из МассивНеучтенныхГрупп Цикл
			
			_ДПЗаказ_ДобавитьЭлементГруппы(КонтрольнаяСтрокаГруппы.Идентификатор, Корень);
			
		КонецЦикла; 
		// --- 
		// переформировываем дерево
		ТаблицаКонтроляГрупп = _ДПЗаказ_ТаблицаКонтроляГрупп();
		ТаблицаКонтроляПараметров = _ДПЗаказ_ТаблицаКонтроляПараметров(НаборПравДляПараметров);
		_ДПЗаказ_СформироватьЭлементыДерева(Корень,Неопределено,НаборПравДляПараметров,СвойстваПараметров, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
		// --- 
		ДПЗаказ_ТекущаяГруппа=0;
		ДПЗаказ_ТекущийПараметр = Неопределено;
		
	КонецЕсли; 
	
	// далее проверяем, нет ли потерянных/новых параметров, если есть
	// то добавляем их в корень и снова переформировываем дерево
	
	МассивНеучтенныхПараметров = _сф.к_НайтиСтроки(ТаблицаКонтроляПараметров,Новый Структура("Видимость",Ложь));
	Если (МассивНеучтенныхПараметров.Количество() <> 0) Тогда
		
		// переносим каждую в корень
		Для каждого КонтрольнаяСтрокаПараметра Из МассивНеучтенныхПараметров Цикл
			
			_ДПЗаказ_ДобавитьЭлементГруппы(КонтрольнаяСтрокаПараметра.Параметр, Корень);
			
		КонецЦикла; 
		// переформировываем дерево
		ТаблицаКонтроляГрупп = _ДПЗаказ_ТаблицаКонтроляГрупп();
		ТаблицаКонтроляПараметров = _ДПЗаказ_ТаблицаКонтроляПараметров(НаборПравДляПараметров);
		_ДПЗаказ_СформироватьЭлементыДерева(Корень,Неопределено,НаборПравДляПараметров,СвойстваПараметров, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
		// --- 
		ДПЗаказ_ТекущаяГруппа=0;
		ДПЗаказ_ТекущийПараметр = Неопределено;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДПЗаказ_ТаблицаКонтроляГрупп()
	// --- 
	
	ТаблицаКонтроляГрупп = Объект.ГруппыПараметровЗаказа.Выгрузить();
	ТаблицаКонтроляГрупп.Колонки.Добавить("Видимость");
	ТаблицаКонтроляГрупп.ЗаполнитьЗначения(Ложь,"Видимость");
	СтрокаКорня = _сф.к_ПервыйЭлемент(ТаблицаКонтроляГрупп);
	СтрокаКорня.Видимость = Истина;
	// --- 
	Возврат(ТаблицаКонтроляГрупп);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗаказ_ТаблицаКонтроляПараметров(НаборПрав)
	// --- 
	
	ТаблицаКонтроляПараметров = Объект.ПараметрыЗаказа.Выгрузить();
	// --- 
	ТаблицаКонтроляПараметров.Колонки.Добавить("Видимость");
	ТаблицаКонтроляПараметров.ЗаполнитьЗначения(Ложь,"Видимость");
	// --- 
	МассивУдаляемыхСтрок = Новый Массив;
	Для каждого СтрокаКонтроля Из ТаблицаКонтроляПараметров Цикл
		
		СтруктураПрав = НаборПрав["п_"+_сф.КлючПоСсылке(СтрокаКонтроля.Параметр)];
		Если (НЕ СтруктураПрав.Просмотр) Тогда
			
			МассивУдаляемыхСтрок.Добавить(СтрокаКонтроля);
			
		КонецЕсли;
		
	КонецЦикла; 
	_сф.к_УдалитьЭлементыПоМассиву(ТаблицаКонтроляПараметров, МассивУдаляемыхСтрок);
	// --- 
	Возврат(ТаблицаКонтроляПараметров);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗаказ_СформироватьЭлементыДерева(Группа,СтрокаДерева = Неопределено, НаборПрав, Свойства, ТаблицаКонтроляГрупп=Неопределено, ТаблицаКонтроляПараметров=Неопределено)
	// --- 
	
	Если (СтрокаДерева <> Неопределено) Тогда
		КоллекцияЭлементовДерева = СтрокаДерева.ПолучитьЭлементы();
	Иначе
		КоллекцияЭлементовДерева = ДПЗаказ.ПолучитьЭлементы();		
	КонецЕсли; 
	КоллекцияЭлементовДерева.Очистить();
	// --- 
	
	МассивПодчиненныхЭлементов = ЗначениеИзСтрокиВнутр(Группа.ИдентификаторыВедомых);
	МассивИдентификаторовДляУдаления = Новый Массив;
	Для каждого ПодчиненныйЭлемент Из МассивПодчиненныхЭлементов Цикл
		
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда  
			ПодчиненныйЭлементОбъект = ПодчиненныйЭлемент.ПолучитьОбъект();
			Если ПодчиненныйЭлементОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;                                                                                            
		Конецесли;

		ЭтоГруппа = (ТипЗнч(ПодчиненныйЭлемент)=Тип("Число"));
		// --- 	
		Если (ЭтоГруппа) Тогда
			
			ОтборПоИдентификаторуГруппы = Новый Структура("Идентификатор",ПодчиненныйЭлемент);
			СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаказа,ОтборПоИдентификаторуГруппы);
			// проверяем, что еще не выведена и записываем признак формирования
			Если (ТаблицаКонтроляГрупп <> Неопределено) Тогда
				
				КонтрольнаяСтрокаГруппы = _сф.к_НайтиСтроку(ТаблицаКонтроляГрупп, ОтборПоИдентификаторуГруппы);
				Если (КонтрольнаяСтрокаГруппы.Видимость) Тогда
					
					// ахтунг, зацикливание
					МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
					Продолжить;
					
				Иначе
					
					КонтрольнаяСтрокаГруппы.Видимость = Истина;
					
				КонецЕсли; 
				
			КонецЕсли; 
			// --- 
			Нстр = КоллекцияЭлементовДерева.Добавить();
			_ДПЗаказ_ЗаполнитьСтрокуДереваПоГруппе(Нстр, СтрокаГруппы);
			// --- 
			ДПЗаказ_УстановитьСостояниеСверткиСтроки(Нстр.ПолучитьИдентификатор(), Нстр.ИдентификаторГруппы, СтрокаГруппы.Раскрывать);

			_ДПЗаказ_СформироватьЭлементыДерева(СтрокаГруппы, Нстр, НаборПрав, Свойства, ТаблицаКонтроляГрупп, ТаблицаКонтроляПараметров);
			// --- 
			// устанавливаем признак разрешения удаления для группы
			УдалениеРазрешено = Истина;
			
			КоллекцияПодчиненных = Нстр.ПолучитьЭлементы();
			КоличествоСформированныхПодчиненных = КоллекцияПодчиненных.Количество();
			КоличествоПодчиненных = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых).Количество();
			Если (КоличествоСформированныхПодчиненных <> КоличествоПодчиненных) Тогда
				
				УдалениеРазрешено = Ложь;
				
			Иначе
				
				Для каждого ПодчиненнаяСтрока Из КоллекцияПодчиненных Цикл
					
					Если (НЕ ПодчиненнаяСтрока.УдалениеРазрешено) Тогда
						УдалениеРазрешено = Ложь;
						Прервать;
					КонецЕсли; 
					
				КонецЦикла; 
			КонецЕсли; 
			Нстр.УдалениеРазрешено = УдалениеРазрешено;
			
		КонецЕсли; 
		// --- 
		Если (НЕ ЭтоГруппа) Тогда
			
			// проверим права
			СтруктураПрав = НаборПрав["п_"+_сф.КлючПоСсылке(ПодчиненныйЭлемент)];
			Если (НЕ СтруктураПрав.Просмотр) Тогда
				
				Продолжить;
				
			КонецЕсли;
			// --- 
			Если (ТаблицаКонтроляПараметров <> Неопределено) Тогда
				
				ОтборПоПараметру = Новый Структура("Параметр",ПодчиненныйЭлемент);
				КонтрольнаяСтрокаПараметра = _сф.к_НайтиСтроку(ТаблицаКонтроляПараметров, ОтборПоПараметру);
				Если (КонтрольнаяСтрокаПараметра.Видимость) Тогда
					
					// ахтунг, параметр уже в какой-то группе, удаляем из текущей
					МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
					Продолжить;
					
				Иначе
					
					КонтрольнаяСтрокаПараметра.Видимость = Истина;
					
				КонецЕсли; 
				
			КонецЕсли; 
			// --- 
			Нстр = КоллекцияЭлементовДерева.Добавить();
			СП = Свойства.Получить(ПодчиненныйЭлемент);
			_ДПЗаказ_ЗаполнитьСтрокуДереваПоПараметру(Нстр, ПодчиненныйЭлемент, СП, СтруктураПрав);
			
		КонецЕсли; 
		
		
	КонецЦикла; 
	// --- 
	Если (МассивИдентификаторовДляУдаления.Количество() <> 0) Тогда
		
		Для каждого ИдентификаторДляУдаления Из МассивИдентификаторовДляУдаления Цикл
			
			МассивПодчиненныхЭлементов.Удалить(МассивПодчиненныхЭлементов.Найти(ИдентификаторДляУдаления));
			
		КонецЦикла; 
		Группа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивПодчиненныхЭлементов);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Процедура _ДПЗаказ_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева,Параметр,СвойстваПараметра=Неопределено, СтруктураПрав=Неопределено)
	// --- 
	
	Если (СвойстваПараметра = Неопределено) Тогда
		СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресСвойствПараметров);
		СвойстваПараметра = СвойстваПараметров.Получить(Параметр);
		Если (СвойстваПараметра = Неопределено) Тогда
			СвойстваПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
			СвойстваПараметра = СвойстваПараметров.Получить(Параметр);
		КонецЕсли; 
	КонецЕсли; 
	
	Если (СтруктураПрав <> Неопределено) Тогда
		
		СтрокаДерева.УдалениеРазрешено = СтруктураПрав.Редактирование;
		
	КонецЕсли; 
	
	СтрокаДерева.Параметр = Параметр;	
	СтрокаДерева.Параметр_Представление = СвойстваПараметра.Наименование;	
	Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
		СтрокаДерева.ИндексКартинки = 2;				
	ИначеЕсли (СвойстваПараметра.ДинамическийПараметр) Тогда 
		СтрокаДерева.ИндексКартинки = 3;
	Иначе
		СтрокаДерева.ИндексКартинки = 1;
	КонецЕсли; 
	// --- 
	СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыЗаказа,Новый Структура("Параметр", Параметр));
	СтрокаДерева.КонтрольЗаполнения = СтрокаПараметра.КонтрольЗаполнения;
	
	//Новый механизм
	СтрокаДерева.ИдентификаторВладельца = СтрокаПараметра.ИдентификаторВладельца;
	//Новый механизм

	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПЗаказ_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы)
	// --- 
	
	СтрокаДерева.ЭтоГруппа = Истина;
	СтрокаДерева.НаименованиеГруппы = СтрокаГруппы.Наименование;
	СтрокаДерева.Параметр_Представление = СтрокаГруппы.Наименование;
	СтрокаДерева.ИдентификаторГруппы = СтрокаГруппы.Идентификатор;
	СтрокаДерева.УдалениеРазрешено = Истина;
	// --- 
	СтрокаДерева.ИндексКартинки = 0;
	
	//Новый механизм
	СтрокаДерева.ИдентификаторВладельца = СтрокаГруппы.ИдентификаторВладельца;
	//Новый механизм
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ДПЗаказ_ВыполнитьПодгрузкуСтрок(ИдентификаторСтрокиРодителя)
	// --- 
	
	СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
	СтрокаДерева.ПолучитьЭлементы().Очистить();
	_ДПЗаказ_ВыполнитьПодгрузку(ИдентификаторСтрокиРодителя);
	// --- 
	
	ДПЗаказ_ВосстановитьСостояниеСверткиСтроки(ИдентификаторСтрокиРодителя);
	// --- 
	Элементы.ДПЗаказ.Развернуть(ИдентификаторСтрокиРодителя);
	ДПЗаказ_СохранитьСостояниеСверткиСтроки(ИдентификаторСтрокиРодителя, Истина);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПЗаказ_ВыполнитьПодгрузку(ИдентификаторСтрокиРодителя)
	// --- 
	
	СтрокаРодителя = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
	СтрокаГруппа = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаказа,Новый Структура("Идентификатор",СтрокаРодителя.ИдентификаторГруппы));
	// --- 
	НаборПравДляПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресСвойствПараметров);
	_ДПЗаказ_СформироватьЭлементыДерева(СтрокаГруппа,СтрокаРодителя, НаборПравДляПараметров, СвойстваПараметров);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область СобытияДерева_Заказ

&НаКлиенте
Процедура ДПЗаказ_ПриАктивизацииСтроки(Элемент)
	
	// ---
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_ВосстановитьСверткуДерево(Команда)
	
	ДПЗаказ_ВосстановитьСостояниеСвертки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_ПередНачаломИзменения(Элемент, Отказ)
	
	Если  НЕ (Элемент.ТекущийЭлемент = Элементы.ДПЗаказ_КонтрольЗаполнения) Тогда
		
		Отказ = Истина;
		Идентификатор = Элементы.ДПЗаказ.ТекущаяСтрока;
		СтрокаДПЗаказ = ДПЗаказ.НайтиПоИдентификатору(Идентификатор);
		Если (СтрокаДПЗаказ.ЭтоГруппа) Тогда
			
			ДоступнаСменаРежимаСвертки 	= ДПЗаказ_ПроверитьСостояниеВедомых(СтрокаДПЗаказ);
			СостояниеГруппы  			= ПолучитьНастройкуРаскрытияГруппы("ГруппыПараметровЗаказа", СтрокаДПЗаказ.ИдентификаторГруппы);
			
			ПараметрыФормы 	= Новый Структура("НаименованиеГруппы,ГруппаРазвернута,РежимГрузоперевозки,ДоступнаСменаРежимаСвертки", СтрокаДПЗаказ.НаименованиеГруппы,СостояниеГруппы, Ложь,ДоступнаСменаРежимаСвертки);
			оо 				= Новый ОписаниеОповещения("ДПЗаказ_ОбработатьВводНаименованияГруппы",ЭтотОбъект, Новый Структура("Редактирование",Истина)); 
			
			ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВиртуальнойГруппы", ПараметрыФормы, ,,,, оо, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе 
			ПараметрыФормы = Новый Структура("Ключ", СтрокаДПЗаказ.Параметр);
			оо = Новый ОписаниеОповещения("ОбработатьИзменениеПараметра",ЭтотОбъект,Новый Структура());
			ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаЭлемента", ПараметрыФормы, ,,,,оо, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецПроцедуры

&наКлиенте
Функция ДПЗаказ_ПроверитьСостояниеВедомых(СтрокаДерева)
	
	ДоступностьСменыРежима = Истина;
	
	тЭлеметы = СтрокаДерева.ПолучитьЭлементы();
	ДПЗаказ_ПроверитьСостояниеВедомыхРекурсивно(тЭлеметы, ДоступностьСменыРежима);
	
	Возврат ДоступностьСменыРежима;
	
КонецФункции

&наКлиенте
Процедура ДПЗаказ_ПроверитьСостояниеВедомыхРекурсивно(тЭлеметы, ДоступностьСменыРежима)
	
	Если Не ДоступностьСменыРежима Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого стрЭлемент из тЭлеметы Цикл
		Если  стрЭлемент.ЭтоГруппа Тогда
			ЭлементСостояния = ДПЗаказ_СостояниеСвертки.НайтиПоЗначению(стрЭлемент.ИдентификаторГруппы);
			Если ЭлементСостояния <> Неопределено Тогда
				Если ЭлементСостояния.Пометка Тогда
					ДоступностьСменыРежима = Ложь;
				КонецЕсли;
			КонецЕсли;
			Подчиненные = стрЭлемент.получитьЭлементы();
			ДПЗаказ_ПроверитьСостояниеВедомыхРекурсивно(подчиненные, ДоступностьСменыРежима);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры


#КонецОбласти 

#Область СостояниеСвертки_Заказ 

&НаСервере
Функция ДПЗаказ_УстановитьСостояниеСверткиСтроки(ИдентификаторСтроки, ИдентификаторГруппы, Развернута=Истина)
	
	ЭлементСостояния = ДПЗаказ_СостояниеСвертки.НайтиПоЗначению(ИдентификаторГруппы);
	Если (ЭлементСостояния = Неопределено) Тогда
		ЭлементСостояния = ДПЗаказ_СостояниеСвертки.Добавить(ИдентификаторГруппы);
	КонецЕсли; 
	ЭлементСостояния.Представление 	= Формат(ИдентификаторСтроки,"ЧДЦ=; ЧН=; ЧГ=");
	ЭлементСостояния.Пометка 		= Развернута;

КонецФункции

&НаКлиенте
Процедура ДПЗаказ_ВосстановитьСостояниеСвертки()
	// --- 
	
	тЭлементы = ДПЗаказ.ПолучитьЭлементы();
	ДПЗаказ_ВосстановитьСостояниеСверткиРекунсивно(тЭлементы);

	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_ВосстановитьСостояниеСверткиРекунсивно(тЭлементы)
	
	Для каждого тЭлемент Из тЭлементы Цикл
		
		тПодчиненные = тЭлемент.ПолучитьЭлементы();
		ДПЗаказ_ВосстановитьСостояниеСверткиРекунсивно(тПодчиненные);
		
		ДПЗаказ_ВосстановитьСостояниеСверткиСтроки(тЭлемент.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура ДПЗаказ_ВосстановитьСостояниеСверткиСтроки(Идентификатор)
	
	СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(Идентификатор);
	
	ЭлементСостояния = ДПЗаказ_СостояниеСвертки.НайтиПоЗначению(СтрокаДерева.ИдентификаторГруппы);
	
	Если ЭлементСостояния <> Неопределено Тогда
		
		Если ЭлементСостояния.Пометка Тогда
			Элементы.ДПЗаказ.Развернуть(СтрокаДерева.ПолучитьИдентификатор());
		Иначе
			Элементы.ДПЗаказ.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
		конецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ДПЗаказ_СохранитьСостояниеСверткиСтроки(ИдентификаторСтроки,Признак)
	// --- 
	
	СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (СтрокаДерева = Неопределено) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	// --- 
	СтрокиГрупп = Объект.ГруппыПараметровЗаказа.НайтиСтроки(Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
	Если (СтрокиГрупп.Количество() <> 0) Тогда
		СтрокаГруппы = СтрокиГрупп[0];
		СтрокаГруппы.Раскрывать = Признак;
	КонецЕсли; 
	// --- 
	ЭлементСостояния = ДПЗаказ_СостояниеСвертки.НайтиПоЗначению(СтрокаДерева.ИдентификаторГруппы);
	Если (ЭлементСостояния = Неопределено) Тогда
		ЭлементСостояния = ДПЗаказ_СостояниеСвертки.Добавить(СтрокаДерева.ИдентификаторГруппы);
	КонецЕсли; 
	ЭлементСостояния.Представление = Формат(ИдентификаторСтроки,"ЧДЦ=; ЧН=; ЧГ=");
	ЭлементСостояния.Пометка = Признак;
	
	// --- 
КонецФункции

// --- 

&НаКлиенте
Процедура ДПЗаказ_СвернутьВсе(Команда)
	
	тЭлементы = ДПЗаказ.ПолучитьЭлементы();
	ДПЗаказ_СвернутьРекурсивно(тЭлементы); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_СвернутьРекурсивно(тЭлементы)
	
	Для Каждого тСтр Из тЭлементы Цикл
		тСтрЭлементы = тСтр.ПолучитьЭлементы();
		ДПЗаказ_СвернутьРекурсивно(тСтрЭлементы);
		
		Элементы.ДПЗаказ.Свернуть(тСтр.ПолучитьИдентификатор());
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_РазвернутьВсе(Команда)
	
	тЭлементы = ДПЗаказ.ПолучитьЭлементы();
	Для Каждого тСтр Из тЭлементы Цикл
		Элементы.ДПЗаказ.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область ДобавлениеЭлементов_Заказ 

&НаКлиенте
Процедура ДПЗаказ_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ДПЗаказ_ОбработкаВыбораПараметра",ЭтотОбъект); 
	
	ПарамерыФормыВыбора = Новый Структура;
	ПарамерыФормыВыбора.Вставить("Множественныйвыбор"	,Истина);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПарамерыФормыВыбора,Элемент,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_ОбработкаВыбораПараметра(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если ТипЗнч(Ответ) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
		Ответ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответ);
	КонецЕсли;
	
	
	Если (Ответ <> Неопределено) Тогда
		Модифицированность = Истина;
		// --- 
		Для Каждого Параметр из Ответ Цикл
			
			Если ЭтоГруппа(Параметр) Тогда
				Продолжить;
			КонецЕсли;
			
			// проверяем, что параметр новый
			Если (ДПЗаказ_ДобавляемыйПараметрНовый(Параметр)) Тогда
				
				ИдентификаторДобавленнойСтроки = _ДПЗаказ_ДобавитьПараметр(Параметр);
				
				// ракрываем строку родителя, если свернута
				ДобавленнаяСтрока = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторДобавленнойСтроки);
				РодительДобавленнойСтроки = ДобавленнаяСтрока.ПолучитьРодителя();
				Если (РодительДобавленнойСтроки <> Неопределено) Тогда
					
					ИдентификаторРодителяДобавленнойСтроки = РодительДобавленнойСтроки.ПолучитьИдентификатор();
					Если (НЕ Элементы.ДПЗаказ.Развернут(ИдентификаторРодителяДобавленнойСтроки)) Тогда
						Элементы.ДПЗаказ.Развернуть(ИдентификаторРодителяДобавленнойСтроки);
						ДПЗаказ_СохранитьСостояниеСверткиСтроки(ИдентификаторРодителяДобавленнойСтроки,Истина);
					КонецЕсли; 
					// --- 
					ДПЗаказ_ТекущаяГруппа = РодительДобавленнойСтроки.ИдентификаторГруппы;
					
				Иначе
					
					ДПЗаказ_ТекущаяГруппа = 0;
					
				КонецЕсли; 
				
				// позиционируемся на добавленный элемент
				Элементы.ДПЗаказ.ТекущаяСтрока = ИдентификаторДобавленнойСтроки;
				// --- 
				ДПЗаказ_ТекущийПараметр = ДобавленнаяСтрока.Параметр;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// --- 
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ДПЗаказ_ДобавляемыйПараметрНовый(Параметр)
	// --- 
	
	Отбор = Новый Структура("Параметр",Параметр);
	СтрокиПараметра = Объект.ПараметрыЗаказа.НайтиСтроки(Отбор);
	Возврат(СтрокиПараметра.Количество()=0);
	
	// --- 
КонецФункции
  
&НаСервере
Функция ДПЗаказ_ТекущийРодитель()
	// --- 
	
	Если (Элементы.ДПЗаказ.ТекущаяСтрока <> Неопределено) Тогда
		
		ИдентификаторТекущейСтроки = Элементы.ДПЗаказ.ТекущаяСтрока;
		ТекущаяСтрока = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		РодительТекущейСтроки = ТекущаяСтрока.ПолучитьРодителя();
		Если (РодительТекущейСтроки <> Неопределено) Тогда
			Возврат(РодительТекущейСтроки);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат(ДПЗаказ);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗаказ_ДобавитьПараметр(Параметр,ПереносПараметров = ложь, ИдентификаторСтрокиРодителя=Неопределено)
	// --- 
	//Новый механизм
	ИдентификаторГруппыВладельца = Неопределено;
	//Новый механизм
	
	// добавляем в ТЧ параметров
	СтрокаТЧ = Объект.ПараметрыЗаказа.Добавить();
	СтрокаТЧ.Параметр = Параметр;
	
	Если ПереносПараметров Тогда
		
		Если ИдентификаторСтрокиРодителя <> Неопределено Тогда
			ТекущаяСтрока = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
			
			//Новый механизм
			ИдентификаторГруппыВладельца = ТекущаяСтрока.ИдентификаторГруппы;
			//Новый механизм
		Иначе
			ТекущаяСтрока = ДПЗаказ;
		Конецесли;
		
		ТР =  ТекущаяСтрока;
	Иначе
		// добавляем в дерево
		Если (Элементы.ДПЗаказ.ТекущаяСтрока <> Неопределено) Тогда
			ИдентификаторТекущейСтроки = Элементы.ДПЗаказ.ТекущаяСтрока;
			ТекущаяСтрока = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
			Если (ТекущаяСтрока.ЭтоГруппа) Тогда
				ТР = ТекущаяСтрока;
			Иначе
				ТР = ДПЗаказ_ТекущийРодитель();	
			КонецЕсли; 
			//Новый механизм
			Если ТР <> ДПЗаказ Тогда
				ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
			КонецЕсли;
			//Новый механизм
		Иначе
			ТР = ДПЗаказ_ТекущийРодитель();	
		КонецЕсли; 
	КонецЕсли;
	
	//Новый механизм
	Если ИдентификаторГруппыВладельца <>  Неопределено Тогда
		ОтборСтрок = Новый Структура("Идентификатор",ТР.ИдентификаторГруппы);
		мСтрокиГрупп = Объект.ГруппыПараметровЗаказа.НайтиСтроки(ОтборСтрок);
		Если мСтрокиГрупп.Количество() > 0 Тогда
			СтрокаГруппы = мСтрокиГрупп[0];
			СтрокаТЧ.ИдентификаторВладельца = СтрокаГруппы.ИдентификаторГруппы; 	
		КонецЕсли;
	КонецЕсли; 
	//Новый механизм
	
	СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
	// заполняем строку дерева
	НаборПравДляПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	СтруктураПрав = НаборПравДляПараметров["п_"+_сф.КлючПоСсылке(Параметр)];
	_ДПЗаказ_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева,Параметр,,СтруктураПрав);
	// записываем принадлежность параметра группе
	_ДПЗаказ_ДобавитьЭлементГруппы(Параметр, _ДПЗаказ_ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева));
	// --- 
	Возврат(СтрокаДерева.ПолучитьИдентификатор());
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗаказ_ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева)
	// --- 
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтроки = Неопределено) Тогда
		СтрокаГруппы = Объект.ГруппыПараметровЗаказа[0];
	Иначе
		Отбор = Новый Структура("Идентификатор", РодительСтроки.ИдентификаторГруппы);
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаказа, Отбор);
	КонецЕсли; 
	
	Возврат(СтрокаГруппы);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ДПЗаказ_ДобавитьЭлементГруппы(Элемент, СтрокаГруппы, НовыйПредыдущий=Неопределено)
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	Если (НовыйПредыдущий =  Неопределено) Тогда
		МассивВедомых.Добавить(Элемент);
	Иначе
		
		ИндексПредыдущего = МассивВедомых.Найти(НовыйПредыдущий);
		Если (ИндексПредыдущего <> Неопределено) Тогда
			МассивВедомых.Вставить(ИндексПредыдущего,Элемент);
		Иначе
			МассивВедомых.Добавить(Элемент);
		КонецЕсли; 
		
	КонецЕсли; 
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	Если (ТипЗнч(Элемент)=Тип("Число")) Тогда
		
		ДПЗаказ_ТекущаяГруппа = Элемент;
		ДПЗаказ_ТекущийПараметр = Неопределено;
		
	Иначе
		
		ДПЗаказ_ТекущаяГруппа = СтрокаГруппы.Идентификатор;
		ДПЗаказ_ТекущийПараметр = Элемент;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПЗаказ_ПереместитьЭлементГруппы(Элемент, СтрокаГруппы, НовыйПредыдущий);
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	// --- 
	Если (НовыйПредыдущий = Неопределено ) Тогда
		
		ИндексЭлемента = МассивВедомых.Найти(Элемент);
		МассивВедомых.Удалить(ИндексЭлемента);
		МассивВедомых.Добавить(Элемент);
		
	Иначе
		
		ИндесНовогоПредыдущего = МассивВедомых.Найти(НовыйПредыдущий);
		ИндексЭлемента = МассивВедомых.Найти(Элемент);
		МассивВедомых.Удалить(ИндексЭлемента);
		МассивВедомых.Вставить(ИндесНовогоПредыдущего,Элемент);
		
	КонецЕсли; 
	// --- 
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДПЗаказ_УдалитьЭлементГруппы(Элемент, СтрокаГруппы)
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	МассивВедомых.Удалить(МассивВедомых.Найти(Элемент));
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	
	// --- 
КонецПроцедуры
 
#КонецОбласти 

#Область ДобавлениеГруппЭлементов_Заказ

&НаКлиенте
Процедура ДПЗаказ_ДобавитьГруппу(Команда)
	
	// спрашиваем название группы
	ПараметрыФормы = Новый Структура("НоваяГруппа,РежимГрузоперевозки,ДоступнаСменаРежимаСвертки", Истина,Ложь,Истина);

	ПОВ = Новый ОписаниеОповещения("ДПЗаказ_ОбработатьВводНаименованияГруппы",ЭтотОбъект, Новый Структура()); 
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВиртуальнойГруппы",ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_ОбработатьВводНаименованияГруппы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		Модифицированность = истина;
		РедактированиеГруппы = Ложь;
		ДополнительныеПараметры.Свойство("Редактирование",РедактированиеГруппы);
		Если (РедактированиеГруппы = Неопределено ) Тогда
			РедактированиеГруппы = Ложь;
		КонецЕсли; 
		Если (РедактированиеГруппы) Тогда
			
			ИдентификаторСтроки = _ДПЗаказ_ОбновитьГруппу(Элементы.ДПЗаказ.ТекущаяСтрока,Ответ);
			
		Иначе
			
			ИдентификаторСтроки = _ДПЗаказ_ДобавитьГруппу(Ответ);	
			
		КонецЕсли; 
		
		ИдентификаторГруппы = ДПЗаказ.НайтипоИдентификатору(ИдентификаторСтроки).ИдентификаторГруппы;
		ДПЗаказ_УстановитьСостояниеСверткиСтроки(ИдентификаторСтроки, ИдентификаторГруппы, Ответ.ГруппаРазвернута);
	//	ДПЗаказ_ВосстановитьСостояниеСверткиСтроки(ИдентификаторСтроки);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДПЗаказ_ОбновитьГруппу(ИдентификаторСтрокиДерева,СтруктураПараметров)
	// --- 
	
	СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
	СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаказа,Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
	
	СтрокаГруппы.Наименование 			= СтруктураПараметров.НаименованиеГруппы;
	СтрокаГруппы.Раскрывать 			= СтруктураПараметров.ГруппаРазвернута;
	// --- 
	_ДПЗаказ_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы);
	
	Возврат(ИдентификаторСтрокиДерева);
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ДПЗаказ_ДобавитьГруппу(СтруктураПараметров, ИдентификаторГруппыРодителя= Неопределено)
	// --- 
	//Новый механизм
	ИдентификаторГруппыВладельца = Неопределено;
	//Новый механизм

	// создаем строку ТЧ
	СтрокаГруппы = Объект.ГруппыПараметровЗаказа.Добавить();
	СтрокаГруппы.Идентификатор 			= _ДПЗаказ_ИдентификаторНовойГруппы();
	
	СтрокаГруппы.Наименование 			= СтруктураПараметров.НаименованиеГруппы;
	СтрокаГруппы.Раскрывать 			= СтруктураПараметров.ГруппаРазвернута;
	
	СтрокаГруппы.ИдентификаторыВедомых 	= ЗначениеВСтрокуВнутр(Новый Массив);
	// --- 
	// создаем строку дерева
	Если ИдентификаторГруппыРодителя = Неопределено Тогда
		Если (Элементы.ДПЗаказ.ТекущаяСтрока <> Неопределено) Тогда
			ИдентификаторТекущейСтроки = Элементы.ДПЗаказ.ТекущаяСтрока;
			ТекущаяСтрока = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
			Если (ТекущаяСтрока.ЭтоГруппа) Тогда
				ТР = ТекущаяСтрока;
			Иначе
				ТР = ДПЗаказ_ТекущийРодитель();	
			КонецЕсли; 
			
			//Новый механизм
			Если ТР <> ДПЗаказ Тогда
				ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
			КонецЕсли;
			//Новый механизм
			
		Иначе
			ТР = ДПЗаказ_ТекущийРодитель();	
		КонецЕсли; 
	Иначе
		ТР = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторГруппыРодителя);
		
		//Новый механизм
		Если ТР <> Неопределено Тогда
			ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
		КонецЕсли;
		//Новый механизм
		
	КонецЕсли;
	
	//Новый механизм
	СтрокаГруппы.ИдентификаторГруппы = Новый УникальныйИдентификатор;
	Если ИдентификаторГруппыВладельца <>  Неопределено Тогда
		ОтборСтрок = Новый Структура("Идентификатор",ИдентификаторГруппыВладельца);
		мСтрокиГрупп = Объект.ГруппыПараметровЗаказа.НайтиСтроки(ОтборСтрок);
		Если мСтрокиГрупп.Количество() > 0 Тогда
			СтрокаГруппыВладельца = мСтрокиГрупп[0];
			СтрокаГруппы.ИдентификаторВладельца = СтрокаГруппыВладельца.ИдентификаторГруппы; 	
		КонецЕсли;
	КонецЕсли;
	//Новый механизм
	
	
	// --- 
	СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
	// заполняем
	_ДПЗаказ_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы);
	// добавляем в массив элементов родителя
	_ДПЗаказ_ДобавитьЭлементГруппы(СтрокаГруппы.Идентификатор, _ДПЗаказ_ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева));
	// --- 
	Возврат(СтрокаДерева.ПолучитьИдентификатор());
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗаказ_ИдентификаторНовойГруппы()
	// --- 
	
	ТЗИ = Объект.ГруппыПараметровЗаказа.Выгрузить(,"Идентификатор");
	ТЗИ.Сортировать("Идентификатор Возр");
	ПоследнийИдентификатор = _сф.к_ПоследнийЭлемент(ТЗИ).Идентификатор;
	НовыйИдентификатор = ПоследнийИдентификатор+1;
	Возврат(НовыйИдентификатор);
	
	// --- 
КонецФункции
 

#КонецОбласти 

#Область УдалениеЭлементов_Заказ 

&НаКлиенте
Процедура ДПЗаказ_ПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	Идентификатор = Элементы.ДПЗаказ.ТекущаяСтрока;
	СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(Идентификатор);
	// --- 
	Если (СтрокаДерева.УдалениеРазрешено) Тогда
		
		Модифицированность = истина;
		
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			
			Если (СтрокаДерева.ПолучитьЭлементы().Количество() <> 0) Тогда
				
				ПОВ = Новый ОписаниеОповещения("ДПЗаказ_ОбработкаПодтвержденияУдаленияГруппы",ЭтотОбъект, Новый Структура()); 
				ПоказатьВопрос(ПОВ,"Группа будет удалена вместе с параметрами. Продолжить?", РежимДиалогаВопрос.ДаНет);
				
			Иначе
				
				ДПЗаказ_УдалитьСтрокуДерева(Идентификатор);
				
			КонецЕсли; 
			
		Иначе
			
			ДПЗаказ_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЕсли; 
		
	Иначе
		
		_УФК.ВывестиПредупреждение("Недостаточно прав для данного действия");
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_ОбработкаПодтвержденияУдаленияГруппы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			ДПЗаказ_УдалитьСтрокуДерева(Элементы.ДПЗаказ.ТекущаяСтрока);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ДПЗаказ_УдалитьСтрокуДерева(Идентификатор)
	// --- 
	
	НоваяТекущаяСтрока = Неопределено;
	// --- 
	СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(Идентификатор);
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		КоллекцияСтрок = ДПЗаказ.ПолучитьЭлементы();
	Иначе
		КоллекцияСтрок = РодительСтрокиДерева.ПолучитьЭлементы();
	КонецЕсли; 
	КоличествоЭлементовКоллекции = КоллекцияСтрок.Количество();
	Если (КоличествоЭлементовКоллекции > 1) Тогда
		
		// получаем индекс
		ИндексУдаляемойСтроки = КоллекцияСтрок.Индекс(СтрокаДерева);
		Если (ИндексУдаляемойСтроки <> КоличествоЭлементовКоллекции-1) Тогда
			НоваяТекущаяСтрока = КоллекцияСтрок[ИндексУдаляемойСтроки+1].ПолучитьИдентификатор();
		Иначе 
			НоваяТекущаяСтрока = КоллекцияСтрок[ИндексУдаляемойСтроки-1].ПолучитьИдентификатор();
		КонецЕсли; 
		
	Иначе
		
		Если (РодительСтрокиДерева <> Неопределено) Тогда
			
			НоваяТекущаяСтрока = РодительСтрокиДерева.ПолучитьИдентификатор();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// удаляем рекурсивно группы/параметры
	Результат = _ДПЗаказ_УдалитьПараметрыРекурсивно(Идентификатор);
	Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
		
		// удаляем строку дерева
		_ДПЗаказ_УдалитьСтрокуДерева(Идентификатор);
		
		Если (НоваяТекущаяСтрока <> Неопределено ) Тогда
			
			Элементы.ДПЗаказ.ТекущаяСтрока = НоваяТекущаяСтрока;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДПЗаказ_УдалитьПараметрыРекурсивно(ИдентификаторСтроки)
	// --- 
	
	СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		ЭлементДПЗаказ = СтрокаДерева.ИдентификаторГруппы;
	Иначе
		ЭлементДПЗаказ = СтрокаДерева.Параметр;
	КонецЕсли; 
	
	// удаляем из родителя
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		СтрокаГруппы = Объект.ГруппыПараметровЗаказа[0];
	Иначе
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаказа,Новый Структура("Идентификатор", РодительСтрокиДерева.ИдентификаторГруппы));
	КонецЕсли; 
	_ДПЗаказ_УдалитьЭлементГруппы(ЭлементДПЗаказ, СтрокаГруппы);
	
	// физически удаляем
	_ДПЗаказ_УдалитьЭлементДПЗаказ(ЭлементДПЗаказ);
	// --- 
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Процедура _ДПЗаказ_УдалитьЭлементДПЗаказ(ЭлементДПЗаказ)
	// --- 
	
	Если (ТипЗнч(ЭлементДПЗаказ)=Тип("Число")) Тогда
		
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаказа,Новый Структура("Идентификатор", ЭлементДПЗаказ));
		МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
		Для каждого Ведомый Из МассивВедомых Цикл
			
			_ДПЗаказ_УдалитьЭлементДПЗаказ(Ведомый);
			
		КонецЦикла; 
		// --- 
		Объект.ГруппыПараметровЗаказа.Удалить(Объект.ГруппыПараметровЗаказа.Индекс(СтрокаГруппы));
		
	Иначе
		
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыЗаказа,Новый Структура("Параметр",ЭлементДПЗаказ));
		Объект.ПараметрыЗаказа.Удалить(Объект.ПараметрыЗаказа.Индекс(СтрокаПараметра));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

#КонецОбласти 

#Область ПеремещениеЭлементов_Заказ

&НаКлиенте
Процедура ДПЗаказ_ПереместитьВверх(Команда)
	
	ДПЗаказ_СдвинутьСтроку(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_ПереместитьВниз(Команда)
	
	ДПЗаказ_СдвинутьСтроку(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_СдвинутьСтроку(Направление)
	// --- 
	
	ТекущаяСтрока = Элементы.ДПЗаказ.ТекущаяСтрока;
	СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(ТекущаяСтрока);
	РодительТекущейСтроки = СтрокаДерева.ПолучитьРодителя();
	Если (РодительТекущейСтроки = Неопределено) Тогда
		РодительТекущейСтроки = ДПЗаказ;
		ГруппаРодитель = 0;
	Иначе
		ГруппаРодитель = РодительТекущейСтроки.ИдентификаторГруппы;	
	КонецЕсли; 
	// --- 
	КоллекцияСтрок = РодительТекущейСтроки.ПолучитьЭлементы();
	КоличествоСтрок = КоллекцияСтрок.Количество();
	Если (КоличествоСтрок = 1) Тогда
		Возврат;
	КонецЕсли; 
	ИндексТекущейСтроки = КоллекцияСтрок.Индекс(СтрокаДерева);
	// --- 
	// проверяем крайние положения
	// если уперлись - переносим в конец/начало
	Сдвиг = 0;
	ПредыдущееДействие = Неопределено;
	СледующееДействие = Неопределено;
	// --- 
	Если (ИндексТекущейСтроки = 0 И Направление=-1) Тогда
		
		Сдвиг = КоличествоСтрок-1; // с плюсом;
		ПредыдущаяСтрока = КоллекцияСтрок.Получить(КоличествоСтрок-1);
		Если (ПредыдущаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.Параметр;
		КонецЕсли; 
		
	ИначеЕсли (ИндексТекущейСтроки <> 0 И Направление=-1) Тогда 
		
		Сдвиг = -1;
		СледующаяСтрока = КоллекцияСтрок.Получить(ИндексТекущейСтроки+Сдвиг);
		Если (СледующаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторСледующейСтроки = СледующаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторСледующейСтроки = СледующаяСтрока.Параметр;
		КонецЕсли;
		
	ИначеЕсли (ИндексТекущейСтроки = КоличествоСтрок-1 И Направление=1) Тогда 
		
		 Сдвиг = -(КоличествоСтрок-1);
		 СледующаяСтрока = КоллекцияСтрок.Получить(0);
		 Если (СледующаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторСледующейСтроки = СледующаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторСледующейСтроки = СледующаяСтрока.Параметр;
		КонецЕсли;
		 
	ИначеЕсли (ИндексТекущейСтроки <> КоличествоСтрок-1 И Направление=1) Тогда 
		
		 Сдвиг = 1;
		 ПредыдущаяСтрока = КоллекцияСтрок.Получить(ИндексТекущейСтроки+Сдвиг);
		 Если (ПредыдущаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.Параметр;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Ответ = _ДПЗаказ_ИзменитьПорядокСтроки(ГруппаРодитель, ТекущаяСтрока, ИдентификаторПредыдущейСтроки, ИдентификаторСледующейСтроки);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		КоллекцияСтрок.Сдвинуть(КоллекцияСтрок.Индекс(СтрокаДерева),Сдвиг);
		
	Иначе
		
		Сообщить(_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДПЗаказ_ИзменитьПорядокСтроки(ИдентификаторГруппыРодителя, ИдентификаторТекущейСтроки, ИдентификаторПредыдущейСтроки, ИдентификаторСледующейСтроки)
	// --- 
	
	Попытка
		
		Группа = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаказа,Новый Структура("Идентификатор",ИдентификаторГруппыРодителя));
		МассивЭлементов = ЗначениеИзСтрокиВнутр(Группа.ИдентификаторыВедомых);
		ТаблицаЭлементов = Новый ТаблицаЗначений;
		ТаблицаЭлементов.Колонки.Добавить("Идентификатор");
		Для каждого Элемент Из МассивЭлементов Цикл
			Нстр = ТаблицаЭлементов.Добавить();
			Нстр.Идентификатор = Элемент;
		КонецЦикла; 
		СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			СдвигаемоеЗначение = СтрокаДерева.ИдентификаторГруппы;
		Иначе
			СдвигаемоеЗначение = СтрокаДерева.Параметр;
		КонецЕсли; 
		СтрокаСдвигаемогоЗначения = _сф.к_НайтиСтроку(ТаблицаЭлементов, Новый Структура("Идентификатор",СдвигаемоеЗначение));
		// --- 
		Если (ИдентификаторПредыдущейСтроки <> Неопределено) Тогда
			
			ОтносительноеЗначение = ИдентификаторПредыдущейСтроки;
			//СтрокаДействия = _сф.к_НайтиСтроку(ТЧ, Новый Структура("Действие",ПредыдущееДействие));
			
		ИначеЕсли (ИдентификаторСледующейСтроки <> Неопределено) Тогда 
			
			ОтносительноеЗначение = ИдентификаторСледующейСтроки;
			
		КонецЕсли; 
		СтрокаОтносительногоЗначения = _сф.к_НайтиСтроку(ТаблицаЭлементов, Новый Структура("Идентификатор",ОтносительноеЗначение));
		Сдвиг = (ТаблицаЭлементов.Индекс(СтрокаОтносительногоЗначения)-ТаблицаЭлементов.Индекс(СтрокаСдвигаемогоЗначения));
		ТаблицаЭлементов.Сдвинуть(СтрокаСдвигаемогоЗначения,Сдвиг);
		// --- 
		МассивЭлементов=ТаблицаЭлементов.ВыгрузитьКолонку("Идентификатор");
		Группа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивЭлементов);
		
		
	Исключение
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции
 
#КонецОбласти 

#Область ДрагЭндДроп_Заказ

&НаКлиенте
Процедура ДПЗаказ_НачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если (Элементы.ДПЗаказ.ВыделенныеСтроки.Количество() > 1) Тогда
		
		Выполнение = Ложь;
		ПоказатьПредупреждение(,"Множественное перетаскивание недоступно.");
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_Перетаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка=Ложь;
	// --- 
	
	// проверим, что действие, в которое мы вставляем не находится ниже по иерархии вставляемого действия
	// сформируем массив действий по иерархии от текущего вверх
	МассивСтрок = Новый Массив;
	ИдентификаторТекущейСтроки = Строка;
	МассивИдентификаторов = ПараметрыПеретаскивания.Значение;
	Если (ИдентификаторТекущейСтроки = Неопределено) Тогда
		
		НовыйРодитель = 0;
		НовыйПредыдущий = Неопределено;
		ВставкаРазрешена = Истина;
		
	Иначе
		
		СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			МассивСтрок.Добавить(СтрокаДерева.ИдентификаторГруппы);	
			НовыйРодитель = СтрокаДерева.ИдентификаторГруппы;
			НовыйПредыдущий = Неопределено;
		Иначе
			НовыйПредыдущий = СтрокаДерева.Параметр;
			НовыйРодительСтрока = СтрокаДерева.ПолучитьРодителя();
			Если (НовыйРодительСтрока <>  Неопределено) Тогда
				НовыйРодитель = НовыйРодительСтрока.ИдентификаторГруппы;
			Иначе
				НовыйРодитель = 0;
			КонецЕсли; 
		КонецЕсли; 
		
		РодительСтроки = СтрокаДерева.ПолучитьРодителя();
		Пока (РодительСтроки <> Неопределено) Цикл
			
			// всегда группа
			МассивСтрок.Добавить(РодительСтроки.ИдентификаторГруппы);
			РодительСтроки = РодительСтроки.ПолучитьРодителя();
			
		КонецЦикла; 
		// ---
		МассивПеремещаемыхСтрок = Новый Массив;
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			ПеремещаемаяСтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(Идентификатор);
			Если (ПеремещаемаяСтрокаДерева.ЭтоГруппа) Тогда
				МассивПеремещаемыхСтрок.Добавить(ПеремещаемаяСтрокаДерева.ИдентификаторГруппы);
			Иначе
				МассивПеремещаемыхСтрок.Добавить(ПеремещаемаяСтрокаДерева.Параметр);	
			КонецЕсли; 
		КонецЦикла; 
		// --- 
		ВставкаРазрешена = Истина;
		Для каждого ПеремещаемаяСтрока Из МассивПеремещаемыхСтрок Цикл
			
			Если (МассивСтрок.Найти(ПеремещаемаяСтрока) <> Неопределено) Тогда
				
				ВставкаРазрешена = Ложь;
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	Если (НЕ ВставкаРазрешена) Тогда
		
		ПоказатьПредупреждение(,"Вставка в иерархию с нарушением логической целостности.");
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	Ответ = _ДПЗаказ_ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель,НовыйПредыдущий);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		Модифицированность = Истина;
		
		// удаляем вставляемые действия
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			
			_ДПЗаказ_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЦикла; 
		
		Если (ИдентификаторТекущейСтроки = Неопределено) Тогда
			
			ПолноеОбновление = Истина;
			_ДПЗаказ_Обновить();
			ДПЗаказ_ВосстановитьСостояниеСвертки();
			
		Иначе
			
			// переформировываем элементы текущего действия
			ПолноеОбновление = Ложь;
			СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(Строка);
			Если (СтрокаДерева.ЭтоГруппа) Тогда
				
				ТекущаяСтрока = Строка;
				ДПЗаказ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
				
			Иначе
				
				СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
				Если (СтрокаРодителя = Неопределено) Тогда
					
					// обновить все
					// тут бы процедуру анализа новых ... TODO
					ПолноеОбновление = Истина;
					_ДПЗаказ_Обновить();
					ДПЗаказ_ВосстановитьСостояниеСвертки();
					
				Иначе
					
					ТекущаяСтрока = СтрокаРодителя.ПолучитьИдентификатор();
					ДПЗаказ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			
		КонецЕсли; 
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ДПЗаказ_ВыполнитьПеремещениеСтрок(МассивИдентификаторовСтрок, НовыйРодитель, НовыйПредыдущий=Неопределено)
	// --- 
	
	Попытка
		
		Для каждого ИдентификаторСтроки Из МассивИдентификаторовСтрок Цикл
			
			Результат = _ДПЗаказ_УстановитьРодителяСтроки(ИдентификаторСтроки, НовыйРодитель, НовыйПредыдущий);
			Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
				
				Возврат(_УФКС.Ответ(1,_УФКС.ПредставлениеОшибки(Результат)));
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Функция _ДПЗаказ_УстановитьРодителяСтроки(ИдентификаторСтроки, НовыйРодитель, НовыйПредыдущий=Неопределено)
	// --- 
	
	Строка = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (Строка.ЭтоГруппа) Тогда
		ПеремещаемоеЗначение = Строка.ИдентификаторГруппы;
	Иначе
		ПеремещаемоеЗначение = Строка.Параметр;
	КонецЕсли; 
	
	// --- 
	
	ГруппаСтарыйРодитель = _ДПЗаказ_ОпределитьСтрокуГруппуСтрокиДерева(Строка);
	ГруппаНовыйРодитель = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаказа,Новый Структура("Идентификатор",НовыйРодитель));
	
	Если (ГруппаСтарыйРодитель.Идентификатор <> НовыйРодитель) Тогда
		
		Попытка
			
			// удаляем из старого родителя
			_ДПЗаказ_УдалитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаСтарыйРодитель);
			
			// добавляем в новый
			_ДПЗаказ_ДобавитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаНовыйРодитель, НовыйПредыдущий);
				
			//Новый механизм
			_ДПЗаказ_УстановитьНовогоВладельца(ИдентификаторСтроки,ГруппаНовыйРодитель.ИдентификаторГруппы);
			//Новый механизм
		
		Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			Сообщить(ТекстОшибки);
			// --- 
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецПопытки; 
		
	Иначе
		
		// перемещение в пределах родителя
		_ДПЗаказ_ПереместитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаНовыйРодитель, НовыйПредыдущий);
		
	КонецЕсли; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

//Новый механизм
&наСервере
Процедура _ДПЗаказ_УстановитьНовогоВладельца(ИдентификаторСтроки, ИдентификаторГруппы)
	
	ИдентификаторВладельца = ИдентификаторГруппы;
	
	Строка = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Строка.ЭтоГруппа Тогда
		мСтроки = Объект.ГруппыПараметровЗаказа.НайтиСтроки(Новый Структура("Идентификатор",Строка.ИдентификаторГруппы));
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0];	
		КонецЕсли;
		Если СтрокаДанных.ИдентификаторГруппы = ИдентификаторГруппы Тогда
			ИдентификаторВладельца = Неопределено;
		КонецЕсли;
	Иначе
		мСтроки = Объект.ПараметрыЗаказа.НайтиСтроки(Новый Структура("Параметр",Строка.Параметр));
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0];	
		КонецЕсли;
	КонецЕсли; 
	
	СтрокаДанных.ИдентификаторВладельца = ИдентификаторВладельца;
	
КонецПроцедуры
//Новый механизм

&НаСервере
Процедура _ДПЗаказ_УдалитьСтрокуДерева(ИдентификаторСтроки)
	// --- 
	
	СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторСтроки);
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		РодительСтрокиДерева = ДПЗаказ;
	КонецЕсли; 
	РодительСтрокиДерева.ПолучитьЭлементы().Удалить(СтрокаДерева);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область Копипаста_Заказ

&НаКлиенте
Процедура ДПЗаказ_ПереместитьНаУровеньВверх(Команда)
	
	ИдентификаторТекущейСтроки = Элементы.ДПЗаказ.ТекущаяСтрока;
	ТекущаяСтрока = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
	Если (РодительСтроки <> Неопределено) Тогда
		
		РодительРодителя = РодительСтроки.ПолучитьРодителя();
		НовыйРодитель = ТекущаяСтрока.ИдентификаторГруппы;
		
		// --- 
		МассивИдентификаторов = Новый Массив;
		МассивИдентификаторов.Добавить(ИдентификаторТекущейСтроки);
		Ответ = _ДПЗаказ_ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель);
		Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
			
			// удаляем вставляемые действия
			Для каждого Идентификатор Из МассивИдентификаторов Цикл
				
				_ДПЗаказ_УдалитьСтрокуДерева(Идентификатор);
				
			КонецЦикла; 
			
			// переформировываем элементы текущего действия
			ПолноеОбновление = Ложь;
			Если (РодительРодителя = Неопределено) Тогда
				
				ПолноеОбновление = Истина;
				_ДПЗаказ_Обновить();
				ДПЗаказ_ВосстановитьСостояниеСвертки();
				
			Иначе
				
				ДПЗаказ_ВыполнитьПодгрузкуСтрок(РодительРодителя);
				
			КонецЕсли; 
						
		Иначе
			
			ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		// --- 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_Строка_Вырезать(Команда)
	
	// снимаем признак нахождения в буфере
	Для каждого Стр Из ДПЗаказ_БуферОбмена Цикл
		ИдентификаторСтроки = Число(Стр.Представление);
		СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если (СтрокаДерева <> Неопределено) Тогда
			СтрокаДерева.Буфер = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	ДПЗаказ_БуферОбмена.Очистить();
	// --- 
	Для каждого Стр Из Элементы.ДПЗаказ.ВыделенныеСтроки Цикл
		
		ВыделеннаяСтрока = ДПЗаказ.НайтиПоИдентификатору(Стр);
		ВыделеннаяСтрока.Буфер = Истина;
		Если (ВыделеннаяСтрока.ЭтоГруппа) Тогда
			ДПЗаказ_БуферОбмена.Добавить(ВыделеннаяСтрока.ИдентификаторГруппы, Формат(Стр,"ЧДЦ=; ЧН=; ЧГ="));
		Иначе
			ДПЗаказ_БуферОбмена.Добавить(ВыделеннаяСтрока.Параметр, Формат(Стр,"ЧДЦ=; ЧН=; ЧГ="));	
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_Строка_Вставить(Команда)
	
	МассивСтрок = Новый Массив;
	ИдентификаторТекущейСтроки = Элементы.ДПЗаказ.ТекущаяСтрока;
	// --- 
	СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		МассивСтрок.Добавить(СтрокаДерева.ИдентификаторГруппы);	
		НовыйРодитель = СтрокаДерева.ИдентификаторГруппы;
		НовыйПредыдущий = Неопределено;
	Иначе
		НовыйПредыдущий = СтрокаДерева.Параметр;
		НовыйРодительСтрока = СтрокаДерева.ПолучитьРодителя();
		Если (НовыйРодительСтрока <>  Неопределено) Тогда
			НовыйРодитель = НовыйРодительСтрока.ИдентификаторГруппы;
		Иначе
			НовыйРодитель = 0;
		КонецЕсли; 
	КонецЕсли; 
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Пока (РодительСтроки <> Неопределено) Цикл
		
		// всегда группа
		МассивСтрок.Добавить(РодительСтроки.ИдентификаторГруппы);
		РодительСтроки = РодительСтроки.ПолучитьРодителя();
		
	КонецЦикла; 
	// ---
	МассивПеремещаемыхСтрок = ДПЗаказ_БуферОбмена.ВыгрузитьЗначения();
	// --- 
	ВставкаРазрешена = Истина;
	Для каждого ПеремещаемаяСтрока Из МассивПеремещаемыхСтрок Цикл
		
		Если (МассивСтрок.Найти(ПеремещаемаяСтрока) <> Неопределено) Тогда
			
			ВставкаРазрешена = Ложь;
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	Если (НЕ ВставкаРазрешена) Тогда
		
		ПоказатьПредупреждение(,"Вставка в иерархию с нарушением логической целостности.");
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	МассивИдентификаторов = Новый Массив;
	Для каждого ЭлементБуфера Из ДПЗаказ_БуферОбмена Цикл
		
		МассивИдентификаторов.Добавить(Число(ЭлементБуфера.Представление));
		
	КонецЦикла; 
	// --- 
	Ответ = _ДПЗаказ_ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель,НовыйПредыдущий);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		// удаляем вставляемые действия
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			
			_ДПЗаказ_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЦикла; 
		
		// очищаем буфер
		ДПЗаказ_БуферОбмена.Очистить();
		
		// переформировываем элементы текущего действия
		ПолноеОбновление = Ложь;
		СтрокаДерева = ДПЗаказ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			
			ТекущаяСтрока = ИдентификаторТекущейСтроки;
			ДПЗаказ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
			
		Иначе
			
			СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
			Если (СтрокаРодителя = Неопределено) Тогда
				
				// обновить все
				// тут бы процедуру анализа новых ... TODO
				ПолноеОбновление = Истина;
				_ДПЗаказ_Обновить();
				ДПЗаказ_ВосстановитьСостояниеСвертки();
				
			Иначе
				
				ТекущаяСтрока = СтрокаРодителя.ПолучитьИдентификатор();
				ДПЗаказ_ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

// ---

#Область ПодборПараметров 

&НаКлиенте
Процедура ПодборПараметров(Команда)
	
	ПараметрыФормыПодбора = Новый Структура;
	ПараметрыФормыПодбора.Вставить("МножественныйВыбор"	, Истина);
	ПараметрыФормыПодбора.Вставить("РежимВыбора"		, Истина);
	ПараметрыФормыПодбора.Вставить("ЗакрыватьПриВыборе"	, Истина);
	
	ДополнительныеПараметры = Новый Структура("ИмяСтраницы", Элементы.СтраницыПараметров.ТекущаяСтраница.Имя);
	
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ПослеЗакрытияФормыПодбораПараметра", ЭтаФорма, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ПодборПараметровГрузоперевозок",ПараметрыФормыПодбора, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПодбораПараметра(ВыбранныеЗначения, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.ИмяСтраницы = "СтраницаПараметровГрузоперевозок" Тогда
		ДПГ_ОбработкаВыбораПараметра(ВыбранныеЗначения, Неопределено);
	ИначеЕсли ДополнительныеПараметры.ИмяСтраницы = "СтраницаПараметровЗаявок" Тогда 
		ДПЗ_ОбработкаВыбораПараметра(ВыбранныеЗначения, Неопределено);
	ИначеЕсли ДополнительныеПараметры.ИмяСтраницы = "СтраницаПараметровЗаказа" Тогда 
		ДПЗаказ_ОбработкаВыбораПараметра(ВыбранныеЗначения, Неопределено);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	
	Если ИмяСобытия = "ПараметрИзменен" Тогда
		
		Если ДПГ.ПолучитьЭлементы().Количество() > 0 Тогда
			
			//AFR-240198
			ТекущиеДанные = Элементы.ДПГ.ТекущиеДанные;  
			Если ТекущиеДанные <> Неопределено Тогда
				НаименованиеГруппы = ТекущиеДанные.НаименованиеГруппы;
			//AFR-240198
				
				ДПГ_Обновить();	
				
			//AFR-240198
				ИдентификаторСтроки = ПолучитьСтрокуДерева(ДПГ, НаименованиеГруппы);
				Элементы.ДПГ.ТекущаяСтрока = ИдентификаторСтроки;   
			КонецЕсли;
			//AFR-240198
		КонецЕсли;
		Если ДПЗ.ПолучитьЭлементы().Количество() > 0 Тогда
			//AFR-240198
			ТекущиеДанные = Элементы.ДПЗ.ТекущиеДанные;  
			Если ТекущиеДанные <> Неопределено Тогда
				НаименованиеГруппы = ТекущиеДанные.НаименованиеГруппы;
			//AFR-240198
				
				ДПЗ_Обновить();	
				
			//AFR-240198
				ИдентификаторСтроки = ПолучитьСтрокуДерева(ДПЗ, НаименованиеГруппы);
				Элементы.ДПЗ.ТекущаяСтрока = ИдентификаторСтроки; 
			КонецЕсли;
			//AFR-240198
		КонецЕсли;
		Если ДПЗаказ.ПолучитьЭлементы().Количество() > 0 Тогда
			//AFR-240198
			ТекущиеДанные = Элементы.ДПЗаказ.ТекущиеДанные;  
			Если ТекущиеДанные <> Неопределено Тогда
				НаименованиеГруппы = ТекущиеДанные.НаименованиеГруппы;
			//AFR-240198
				
				ДПЗаказ_Обновить();	
				
			//AFR-240198
				ИдентификаторСтроки = ПолучитьСтрокуДерева(ДПЗаказ, НаименованиеГруппы);
				Элементы.ДПЗаказ.ТекущаяСтрока = ИдентификаторСтроки; 
			КонецЕсли;
			//AFR-240198
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуДерева(Дерево, НаименованиеГруппы)
	
	ЭлементыДерева = Дерево.ПолучитьЭлементы(); 
	Для Каждого ЭлементДерева  из ЭлементыДерева Цикл
		Если ЭлементДерева.НаименованиеГруппы = НаименованиеГруппы Тогда
			Возврат ЭлементДерева.ПолучитьИдентификатор();
		КонецЕсли;
		Если ЭлементДерева.ЭтоГруппа Тогда
			ИдентификаторСтроки = ПолучитьСтрокуДерева(ЭлементДерева, НаименованиеГруппы);	
			Если ИдентификаторСтроки <> Неопределено Тогда
				Возврат ИдентификаторСтроки;
			КонецЕсли;
		КонецЕсли;                                                                        
	КонецЦикла;
	
КонецФункции

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область КонтрольЗаполненияПараметров_Грузоперевозка

&НаСервере
Процедура _УправлениеЭлементамиФормы_КонтрольЗаполнения()
	// --- 
	
	Элементы.КонтрольЗаполненияТипоразмера.Видимость         = (Объект.ВидПеревозки=Перечисления.CW_ВидыПеревозок.Контейнер);
	Элементы.КонтрольЗаполненияГруза.Видимость               = ПолучитьФункциональнуюОпцию("CW_ИспользованиеГрузов");
	Элементы.КонтрольЗаполненияМаршрута.Видимость            = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМаршрутов");
	Элементы.КонтрольЗаполненияОперативныйМенеджер.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеОперативныхМенеджеров");
	Элементы.КонтрольЗаполненияМенеджераПродаж.Видимость     = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМенеджеровПродаж");
	
	Элементы.КонтрольЗаполненияТипоразмераЗаявка.Видимость           = (Объект.ВидПеревозки=Перечисления.CW_ВидыПеревозок.Контейнер);
	Элементы.КонтрольЗаполненияГрузаЗаявка.Видимость                 = ПолучитьФункциональнуюОпцию("CW_ИспользованиеГрузов");
	Элементы.КонтрольЗаполненияМаршрутаЗаявка.Видимость              = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМаршрутов");
	Элементы.КонтрольЗаполненияОперативногоМенеджераЗаявка.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеОперативныхМенеджеров");
	Элементы.КонтрольЗаполненияМенеджераПродажЗаявка.Видимость       = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМенеджеровПродаж");	
	
	Элементы.КонтрольЗаполненияТипоразмераРасходы.Видимость         = (Объект.ВидПеревозки=Перечисления.CW_ВидыПеревозок.Контейнер);
	Элементы.КонтрольЗаполненияГрузаРасходы.Видимость               = ПолучитьФункциональнуюОпцию("CW_ИспользованиеГрузов");
	Элементы.КонтрольЗаполненияМаршрутаРасходы.Видимость            = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМаршрутов");
	Элементы.КонтрольЗаполненияОперативногоМенеджераРасходы.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеОперативныхМенеджеров");
	Элементы.КонтрольЗаполненияМенеджераПродажРасходы.Видимость     = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМенеджеровПродаж");
	
	Элементы.КонтрольЗаполненияТипоразмераДоходы.Видимость         = (Объект.ВидПеревозки=Перечисления.CW_ВидыПеревозок.Контейнер);
	Элементы.КонтрольЗаполненияГрузаДоходы.Видимость               = ПолучитьФункциональнуюОпцию("CW_ИспользованиеГрузов");
	Элементы.КонтрольЗаполненияМаршрутаДоходы.Видимость            = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМаршрутов");
	Элементы.КонтрольЗаполненияОперативногоМенеджераДоходы.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеОперативныхМенеджеров");
	Элементы.КонтрольЗаполненияМенеджераПродажДоходы.Видимость     = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМенеджеровПродаж");
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ПоказатьКонтрольЗаполнения(Команда)
	
	КонтрольЗаполненияРеквизитов = не КонтрольЗаполненияРеквизитов;
	ПоказатьКонтрольЗаполненияГП();
	Элементы.ДПГ_ПоказатьКонтрольЗаполнения.Пометка = КонтрольЗаполненияРеквизитов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКонтрольЗаполненияГП()
	
	Элементы.КонтрольЗаполненияРеквизитов.Видимость     = КонтрольЗаполненияРеквизитов;
	Элементы.ДПГ_КонтрольЗаполнения.Видимость           = КонтрольЗаполненияРеквизитов;
	Элементы.ДПГ_КонтрольЗаполненияРасходы.Видимость    = КонтрольЗаполненияРеквизитов;
	Элементы.ДПГ_КонтрольЗаполненияДоходы.Видимость     = КонтрольЗаполненияРеквизитов;
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_КонтрольЗаполненияПриИзменении(Элемент)
	
	Параметр = Элементы.ДПГ.ТекущиеДанные.Параметр;
	// --- 
	Мстр = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Новый Структура("Параметр", Параметр));
	Если (Мстр.Количество() <> 0) Тогда
		Мстр[0].КонтрольЗаполнения = Элементы.ДПГ.ТекущиеДанные.КонтрольЗаполнения;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_КонтрольЗаполненияРасходыПриИзменении(Элемент)
	
	Параметр = Элементы.ДПГ.ТекущиеДанные.Параметр;
	// --- 
	Мстр = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Новый Структура("Параметр", Параметр));
	Если (Мстр.Количество() <> 0) Тогда
		Мстр[0].КонтрольЗаполненияРасходы = Элементы.ДПГ.ТекущиеДанные.КонтрольЗаполненияРасходы;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_КонтрольЗаполненияДоходыПриИзменении(Элемент)
	
	Параметр = Элементы.ДПГ.ТекущиеДанные.Параметр;
	// --- 
	Мстр = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Новый Структура("Параметр", Параметр));
	Если (Мстр.Количество() <> 0) Тогда
		Мстр[0].КонтрольЗаполненияДоходы = Элементы.ДПГ.ТекущиеДанные.КонтрольЗаполненияДоходы;
	КонецЕсли; 
	
КонецПроцедуры

// --- 

#КонецОбласти 

#Область КонтрольЗаполненияПараметров_Заявка

&НаКлиенте
Процедура ДПЗ_ПоказатьКонтрольЗаполнения(Команда)
	
	КонтрольЗаполненияЗаявки = не КонтрольЗаполненияЗаявки;
	ПоказатьКонтрольЗаполненияЗаявки();
	Элементы.ДПЗ_ПоказатьКонтрольЗаполнения.Пометка = КонтрольЗаполненияЗаявки;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКонтрольЗаполненияЗаявки()
	
	Элементы.КонтрольЗаполненияЗаявки.Видимость = КонтрольЗаполненияЗаявки;
	Элементы.ДПЗ_КонтрольЗаполнения.Видимость   = КонтрольЗаполненияЗаявки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗ_КонтрольЗаполненияПриИзменении(Элемент)
	
	Параметр = Элементы.ДПЗ.ТекущиеДанные.Параметр;
	// --- 
	Мстр = Объект.ПараметрыЗаявки.НайтиСтроки(Новый Структура("Параметр", Параметр));
	Если (Мстр.Количество() <> 0) Тогда
		Мстр[0].КонтрольЗаполнения = Элементы.ДПЗ.ТекущиеДанные.КонтрольЗаполнения;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область КонтрольЗаполненияПараметров_Заказ

&НаКлиенте
Процедура ДПЗаказ_ПоказатьКонтрольЗаполнения(Команда)
	
	КонтрольЗаполненияЗаказа = не КонтрольЗаполненияЗаказа;
	ПоказатьКонтрольЗаполненияЗаказа();
	Элементы.ДПЗаказ_ПоказатьКонтрольЗаполнения.Пометка = КонтрольЗаполненияЗаказа;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКонтрольЗаполненияЗаказа()
	
	Элементы.КонтрольЗаполненияЗаказа.Видимость		= КонтрольЗаполненияЗаказа;
	Элементы.ДПЗаказ_КонтрольЗаполнения.Видимость   	= КонтрольЗаполненияЗаказа;
	
КонецПроцедуры

&НаКлиенте
Процедура ДПЗаказ_КонтрольЗаполненияПриИзменении(Элемент)
	
	Параметр = Элементы.ДПЗаказ.ТекущиеДанные.Параметр;
	// --- 
	Мстр = Объект.ПараметрыЗаказа.НайтиСтроки(Новый Структура("Параметр", Параметр));
	Если (Мстр.Количество() <> 0) Тогда
		Мстр[0].КонтрольЗаполнения = Элементы.ДПЗаказ.ТекущиеДанные.КонтрольЗаполнения;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 
// ---------------------------------------------------------------------------- 

#Область ПредопределенныеЗначения

Процедура _УправлениеЭлементамиФормы_ПредопределенныеЗначенияПараметров()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Элементы.СтраницаПредопределенныеЗначения.Видимость = Истина;
		CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Субъект", ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, ПредопределенныеЗначенияПараметров.Отбор);
		
	Иначе 
		Элементы.СтраницаПредопределенныеЗначения.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы_КонтрольЗаполнения();
	
КонецПроцедуры

#КонецОбласти 

#Область Бюджет

Процедура _УправлениеЭлементамиФормы_Бюджет()
	
	Элементы.СтраницаБюджет.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования");
	
КонецПроцедуры	

#КонецОбласти 

#Область Параметры_ПутевыхЛистов

&НаКлиенте
Процедура ПараметрыПутевыхЛистовРеквизитПутевогоЛистаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение =  Новый ОписаниеОповещения("ОбработатьВыборРеквизита", ЭтотОбъект, Элементы.ПараметрыПутевыхЛистов.ТекущаяСтрока);
	
	ПоказатьВыборИзСписка(Оповещение,СписокРеквизитовПутевогоЛиста, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборРеквизита(ВыбранноеЗначение, ИдентифкаторСтроки) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыборРекизитаНаСервере(ВыбранноеЗначение.Значение, ИдентифкаторСтроки);	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборРекизитаНаСервере(ВыбранноеЗначение, ИдентифкаторСтроки)
	
	СтрокаТекущая = Объект.ПараметрыПутевыхЛистов.НайтиПоИдентификатору(ИдентифкаторСтроки);
	СтрокаТекущая.РеквизитПутевогоЛиста = ВыбранноеЗначение; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПутевыхЛистовРеквизитПутевогоЛистаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыПутевыхЛистов.ТекущиеДанные;
	
	ДанныеДляПроверки = Новый Структура;
	ДанныеДляПроверки.Вставить("Реквизит"					, ТекущиеДанные.РеквизитПутевогоЛиста);
	ДанныеДляПроверки.Вставить("Параметр"					, ТекущиеДанные.Параметр);
	ДанныеДляПроверки.Вставить("ЧитатьИзГрузоперевозки"		, ТекущиеДанные.ЧитатьИзГрузоперевозки);
	ДанныеДляПроверки.Вставить("ЗаполнитьИзПутевогоЛиста"	, ТекущиеДанные.ЗаполнитьИзПутевогоЛиста);
	
	ТекущиеДанные.ТипыСоответствуют = ПроверитьСоответствиеТипаПараметра(ДанныеДляПроверки);
	
	Если ТекущиеДанные.РеквизитПутевогоЛиста = ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.Дата") или
		ТекущиеДанные.РеквизитПутевогоЛиста = ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.Номер") Тогда
		ТекущиеДанные.ЧитатьИзГрузоперевозки = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПутевыхЛистовПараметрПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыПутевыхЛистов.ТекущиеДанные;
	
	ДанныеДляПроверки = Новый Структура;
	ДанныеДляПроверки.Вставить("Реквизит"					, ТекущиеДанные.РеквизитПутевогоЛиста);
	ДанныеДляПроверки.Вставить("Параметр"					, ТекущиеДанные.Параметр);
	ДанныеДляПроверки.Вставить("ЧитатьИзГрузоперевозки"		, ТекущиеДанные.ЧитатьИзГрузоперевозки);
	ДанныеДляПроверки.Вставить("ЗаполнитьИзПутевогоЛиста"	, ТекущиеДанные.ЗаполнитьИзПутевогоЛиста);
	
	ТекущиеДанные.ТипыСоответствуют = ПроверитьСоответствиеТипаПараметра(ДанныеДляПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПутевыхЛистовЧитатьИзГрузоперевозкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыПутевыхЛистов.ТекущиеДанные;
	
	ДанныеДляПроверки = Новый Структура;
	ДанныеДляПроверки.Вставить("Реквизит"					, ТекущиеДанные.РеквизитПутевогоЛиста);
	ДанныеДляПроверки.Вставить("Параметр"					, ТекущиеДанные.Параметр);
	ДанныеДляПроверки.Вставить("ЧитатьИзГрузоперевозки"		, ТекущиеДанные.ЧитатьИзГрузоперевозки);
	ДанныеДляПроверки.Вставить("ЗаполнитьИзПутевогоЛиста"	, ТекущиеДанные.ЗаполнитьИзПутевогоЛиста);
	
	ТекущиеДанные.ТипыСоответствуют = ПроверитьСоответствиеТипаПараметра(ДанныеДляПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПутевыхЛистовЗаполнитьИзПутевогоЛистаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыПутевыхЛистов.ТекущиеДанные;
	
	ДанныеДляПроверки = Новый Структура;
	ДанныеДляПроверки.Вставить("Реквизит"					, ТекущиеДанные.РеквизитПутевогоЛиста);
	ДанныеДляПроверки.Вставить("Параметр"					, ТекущиеДанные.Параметр);
	ДанныеДляПроверки.Вставить("ЧитатьИзГрузоперевозки"		, ТекущиеДанные.ЧитатьИзГрузоперевозки);
	ДанныеДляПроверки.Вставить("ЗаполнитьИзПутевогоЛиста"	, ТекущиеДанные.ЗаполнитьИзПутевогоЛиста);
	
	ТекущиеДанные.ТипыСоответствуют = ПроверитьСоответствиеТипаПараметра(ДанныеДляПроверки);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьСоответствиеТипаПараметра(ТекущиеДанные)
	
	Если Не ТекущиеДанные.ЧитатьИзГрузоперевозки и НЕ ТекущиеДанные.ЗаполнитьИзПутевогоЛиста Тогда
		Возврат истина;
	КонецЕсли;
	
	СоответствияТиповРеквизитов = Перечисления.CW_РеквизитыПутевыхЛистов.ПолучитьТипыЗначенийРеквизитовПутевогоЛиста();
	
	ТипЗначенияПараметра 	= ТекущиеДанные.Параметр.ТипЗначения;
	РеквизитПутевогоЛиста 	= ТекущиеДанные.Реквизит;
	
	Если Не ЗначениеЗаполнено(ТипЗначенияПараметра) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПроверяемыйТип = СоответствияТиповРеквизитов.Получить(РеквизитПутевогоЛиста);
	
	Если  ТипЗначенияПараметра.СодержитТип(ПроверяемыйТип) Тогда
		//Если типы совпадают, значит все хорошо 
		Возврат истина;
	КонецЕсли;
	
	ПодходитТипПараметра = Истина;
	
	Если ТекущиеДанные.ЗаполнитьИзПутевогоЛиста Тогда
		//Путевой лист -> Гузоперевозка
		Если Не Строка(ТипЗначенияПараметра) = Строка(Новый ОписаниеТипов("Строка")) Тогда
			//если ТипЗначенияПараметра "Строка", значит в него можно грузить
			ПодходитТипПараметра = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодходитТипРеквизита = Истина;
	Если ТекущиеДанные.ЧитатьИзГрузоперевозки Тогда
		//Гузоперевозка -> Путевой лист 
		Если Не ПроверяемыйТип = Тип("Строка") Тогда
			//если ПроверяемыйТип "Строка", значит в него можно грузить
			ПодходитТипРеквизита = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПодходитТипПараметра и ПодходитТипРеквизита;
	
КонецФункции

#КонецОбласти 

#Область Смена_Листов_Параметров

&НаКлиенте
Процедура ИндексСтраницыПараметровПриИзменении(Элемент)
	
	ОбработатьВыборСтраницы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборСтраницы()
	
	Элементы.СтраницыПараметров.ТекущаяСтраница = Элементы.СтраницыПараметров.ПодчиненныеЭлементы[ИндексСтраницыПараметров];
		
КонецПроцедуры

#КонецОбласти

#Область ПереносПараметров

&НаКлиенте
Процедура ПеренестиВСоставПараметровЗаявки(Команда)
	
	
	Если ИндексСтраницыПараметров = 0 Тогда //Страница грузоперевозки
		
		ДеревоПараметров = ДПГ;
		ВыделенныеСтроки = Элементы.ДПГ.ВыделенныеСтроки;
		ИмяРеквизитаГруппыПараметров = "ГруппыПараметровГрузоперевозки";
		
	ИначеЕсли ИндексСтраницыПараметров = 2 Тогда //Страница Заказы
		
		ДеревоПараметров = ДПЗаказ;
		ВыделенныеСтроки = Элементы.ДПЗаказ.ВыделенныеСтроки;
		ИмяРеквизитаГруппыПараметров = "ГруппыПараметровЗаказа";
		
	КонецЕсли;	
	
	УдалитьСтрокиВходящиеВВыбранныеГруппы(ВыделенныеСтроки, ДеревоПараметров);
	
	Для Каждого ИдентифкаторСтроки Из ВыделенныеСтроки Цикл
		СтрокаДерева =  ДеревоПараметров.НайтиПоИдентификатору(ИдентифкаторСтроки);
		ПеренестиЭлементыВЗаявки(СтрокаДерева, ИмяРеквизитаГруппыПараметров);
	КонецЦикла;
	
	_ДПЗ_Обновить();
	ДПЗ_ВосстановитьСостояниеСвертки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВСоставПараметровЗаказа(Команда)
	
	Если ИндексСтраницыПараметров = 0 Тогда //Страница грузоперевозки
		
		ДеревоПараметров = ДПГ;
		ВыделенныеСтроки = Элементы.ДПГ.ВыделенныеСтроки;
		ИмяРеквизитаГруппыПараметров = "ГруппыПараметровГрузоперевозки";
		
	ИначеЕсли ИндексСтраницыПараметров = 1 Тогда //Страница заявки
		
		ДеревоПараметров = ДПЗ;
		ВыделенныеСтроки = Элементы.ДПЗ.ВыделенныеСтроки;
		ИмяРеквизитаГруппыПараметров = "ГруппыПараметровЗаявки";
		
	КонецЕсли;	
	
	УдалитьСтрокиВходящиеВВыбранныеГруппы(ВыделенныеСтроки, ДеревоПараметров);
	
	Для Каждого ИдентифкаторСтроки Из ВыделенныеСтроки Цикл
		СтрокаДерева =  ДеревоПараметров.НайтиПоИдентификатору(ИдентифкаторСтроки);
		ПеренестиЭлементыВЗаказы(СтрокаДерева, ИмяРеквизитаГруппыПараметров);
	КонецЦикла;
	
	_ДПЗаказ_Обновить();
	ДПЗаказ_ВосстановитьСостояниеСвертки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВСоставПараметровГрузопереовзки(Команда)
	
	Если ИндексСтраницыПараметров = 1 Тогда //Страница заявки
		
		ДеревоПараметров = ДПЗ;
		ВыделенныеСтроки = Элементы.ДПЗ.ВыделенныеСтроки;
		ИмяРеквизитаГруппыПараметров = "ГруппыПараметровЗаявки";
		
	ИначеЕсли ИндексСтраницыПараметров = 2 Тогда //Страница Заказы
		
		ДеревоПараметров = ДПЗаказ;
		ВыделенныеСтроки = Элементы.ДПЗаказ.ВыделенныеСтроки;
		ИмяРеквизитаГруппыПараметров = "ГруппыПараметровЗаказа";
		
	КонецЕсли;	
	
	УдалитьСтрокиВходящиеВВыбранныеГруппы(ВыделенныеСтроки, ДеревоПараметров);
	
	Для Каждого ИдентифкаторСтроки Из ВыделенныеСтроки Цикл
		СтрокаДерева =  ДеревоПараметров.НайтиПоИдентификатору(ИдентифкаторСтроки);
		ПеренестиЭлементыВГрузоперевозки(СтрокаДерева, ИмяРеквизитаГруппыПараметров);
	КонецЦикла;
	
	_ДПГ_Обновить();
	ДПГ_ВосстановитьСостояниеСвертки();
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьСтрокиВходящиеВВыбранныеГруппы(ВыделенныеСтроки, ДеревоПараметров)
	
	мГруппы = Новый Массив;
	мСтроки = Новый Массив;
	
	//Заполниим группы
	Для Каждого ИдентифкаторСтроки Из ВыделенныеСтроки Цикл
		СтрокаДерева =  ДеревоПараметров.НайтиПоИдентификатору(ИдентифкаторСтроки);
		Если СтрокаДерева.ЭтоГруппа Тогда
			мГруппы.Добавить(СтрокаДерева);
		Иначе
			мСтроки.Добавить(ИдентифкаторСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ИдентифкаторСтроки Из мСтроки Цикл
		СтрокаДерева 	=  ДеревоПараметров.НайтиПоИдентификатору(ИдентифкаторСтроки); 
		СтрокаРодитель 	= СтрокаДерева.ПолучитьРодителя();
		
		Если мГруппы.Найти(СтрокаРодитель) <> Неопределено Тогда
			ВыделенныеСтроки.Удалить( ВыделенныеСтроки.Найти(ИдентифкаторСтроки));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиЭлементыВЗаявки(СтрокаДерева, ИмяРеквизитаГруппыПараметров, ИдентификаторГруппыРодителя = Неопределено)
	
	Если СтрокаДерева.ЭтоГруппа Тогда
		
		мСтрокиГруппы_ДПЗ = Объект.ГруппыПараметровЗаявки.НайтиСтроки(Новый Структура("Наименование", СтрокаДерева.НаименованиеГруппы));
		Если мСтрокиГруппы_ДПЗ.Количество() = 0 Тогда
			
			мНайденныеСтроки = Объект[ИмяРеквизитаГруппыПараметров].НайтиСтроки(Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
			Если мНайденныеСтроки.Количество() > 0 Тогда
				ТекущаяСтрокаГруппы = мНайденныеСтроки[0];
				СтруктураГруппы = Новый Структура("НаименованиеГруппы,ГруппаРазвернута", СтрокаДерева.НаименованиеГруппы,ТекущаяСтрокаГруппы.Раскрывать);
				ИдентификаторГруппы = _ДПЗ_ДобавитьГруппу(СтруктураГруппы, ИдентификаторГруппыРодителя);
			КонецЕсли;
			
		Иначе
			ИдентификаторГруппы =  мСтрокиГруппы_ДПЗ[0].Идентификатор;
		КонецЕсли;
		
		ЭлементыДерева = СтрокаДерева.ПолучитьЭлементы();
		
		Для Каждого СтрокаГруппы из ЭлементыДерева цикл
			
			Если СтрокаГруппы.ЭтоГруппа Тогда
				ПеренестиЭлементыВЗаявки(СтрокаГруппы,ИдентификаторГруппы);
			Иначе
				Если ДПЗ_ДобавляемыйПараметрНовый(СтрокаГруппы.Параметр) Тогда
					ИдентификаторДобавленнойСтроки = _ДПЗ_ДобавитьПараметр(СтрокаГруппы.Параметр,Истина,ИдентификаторГруппы);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Если ДПЗ_ДобавляемыйПараметрНовый(СтрокаДерева.Параметр) Тогда
			ИдентификаторДобавленнойСтроки = _ДПЗ_ДобавитьПараметр(СтрокаДерева.Параметр,истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЭлементыВЗаказы(СтрокаДерева, ИмяРеквизитаГруппыПараметров, ИдентификаторГруппыРодителя = Неопределено)
	
	Если СтрокаДерева.ЭтоГруппа Тогда
		
		мСтрокиГруппы_ДПЗаказ = Объект.ГруппыПараметровЗаказа.НайтиСтроки(Новый Структура("Наименование", СтрокаДерева.НаименованиеГруппы));
		Если мСтрокиГруппы_ДПЗаказ.Количество() = 0 Тогда
			
			мНайденныеСтроки = Объект[ИмяРеквизитаГруппыПараметров].НайтиСтроки(Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
			Если мНайденныеСтроки.Количество() > 0 Тогда
				ТекущаяСтрокаГруппы = мНайденныеСтроки[0];
				СтруктураГруппы = Новый Структура("НаименованиеГруппы,ГруппаРазвернута", СтрокаДерева.НаименованиеГруппы,ТекущаяСтрокаГруппы.Раскрывать);
				ИдентификаторГруппы = _ДПЗаказ_ДобавитьГруппу(СтруктураГруппы, ИдентификаторГруппыРодителя);
			КонецЕсли;
			
		Иначе
			ИдентификаторГруппы =  мСтрокиГруппы_ДПЗаказ[0].Идентификатор;
		КонецЕсли;
		
		ЭлементыДерева = СтрокаДерева.ПолучитьЭлементы();
		
		Для Каждого СтрокаГруппы из ЭлементыДерева цикл
			
			Если СтрокаГруппы.ЭтоГруппа Тогда
				ПеренестиЭлементыВЗаявки(СтрокаГруппы,ИдентификаторГруппы);
			Иначе
				Если ДПЗаказ_ДобавляемыйПараметрНовый(СтрокаГруппы.Параметр) Тогда
					ИдентификаторДобавленнойСтроки = _ДПЗаказ_ДобавитьПараметр(СтрокаГруппы.Параметр,Истина,ИдентификаторГруппы);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Если ДПЗаказ_ДобавляемыйПараметрНовый(СтрокаДерева.Параметр) Тогда
			ИдентификаторДобавленнойСтроки = _ДПЗаказ_ДобавитьПараметр(СтрокаДерева.Параметр,истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЭлементыВГрузоперевозки(СтрокаДерева, ИмяРеквизитаГруппыПараметров, ИдентификаторГруппыРодителя = Неопределено)
	
	Если СтрокаДерева.ЭтоГруппа Тогда
		
		мСтрокиГруппы_ДПГ = Объект.ГруппыПараметровГрузоперевозки.НайтиСтроки(Новый Структура("Наименование", СтрокаДерева.НаименованиеГруппы));
		Если мСтрокиГруппы_ДПГ.Количество() = 0 Тогда
			
			мНайденныеСтроки = Объект[ИмяРеквизитаГруппыПараметров].НайтиСтроки(Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
			Если мНайденныеСтроки.Количество() > 0 Тогда
				ТекущаяСтрокаГруппы = мНайденныеСтроки[0];
				СтруктураГруппы = Новый Структура("НаименованиеГруппы,ГруппаРазвернута", СтрокаДерева.НаименованиеГруппы,ТекущаяСтрокаГруппы.Раскрывать);
				ИдентификаторГруппы = _ДПГ_ДобавитьГруппу(СтруктураГруппы, ИдентификаторГруппыРодителя);
			КонецЕсли;
			
		Иначе
			ИдентификаторГруппы =  мСтрокиГруппы_ДПГ[0].Идентификатор;
		КонецЕсли;
		
		ЭлементыДерева = СтрокаДерева.ПолучитьЭлементы();
		
		Для Каждого СтрокаГруппы из ЭлементыДерева цикл
			
			Если СтрокаГруппы.ЭтоГруппа Тогда
				ПеренестиЭлементыВГрузоперевозки(СтрокаГруппы, ИдентификаторГруппы);
			Иначе
				Если ДПГ_ДобавляемыйПараметрНовый(СтрокаГруппы.Параметр) Тогда
					ИдентификаторДобавленнойСтроки = _ДПГ_ДобавитьПараметр(СтрокаГруппы.Параметр,Истина,ИдентификаторГруппы);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Если ДПГ_ДобавляемыйПараметрНовый(СтрокаДерева.Параметр) Тогда
			ИдентификаторДобавленнойСтроки = _ДПГ_ДобавитьПараметр(СтрокаДерева.Параметр,истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти

#Область Предопределенные_значения_реквизитов_шапки_заказа_и_грузоперевозки

&НаКлиенте
Процедура ЗаполнитьСписокРеквизитов(Команда)
	ЗаполнитьСписокРеквизитовШапкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРеквизитовШапкиНаСервере()
	
	мРеквизиты = Справочники.CW_ТипыПеревозок.ПолучитьМассивДоступныхРеквизитовШапки();
	
	Для Каждого ЗначениеМассива из  мРеквизиты Цикл
		
		Отбор 	= Новый Структура("ИмяРеквизита",ЗначениеМассива.Имя);
		мСтроки = Объект.ПредопределенныеЗначенияРеквизитов.НайтиСтроки(Отбор); 

		Если мСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.ПредопределенныеЗначенияРеквизитов.Добавить();
			НоваяСтрока.ИмяРеквизита 		= ЗначениеМассива.Имя;
			НоваяСтрока.СинонимРеквизита 	= ЗначениеМассива.Синоним;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПредопределенныеЗначенияРеквизитовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьФормуРедактированияЗначения(Элементы.ПредопределенныеЗначенияРеквизитов.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредопределенныеЗначенияРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	ОткрытьФормуРедактированияЗначения(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияЗначения(ВыбраннаяСтрока)
	
	Если ВыбраннаяСтрока <> Неопределено Тогда
		
		ТекущиеДанные = Объект.ПредопределенныеЗначенияРеквизитов.НайтиПоИдентификатору(ВыбраннаяСтрока);
		
		ОписаниеОпвещения = Новый ОписаниеОповещения("ЗавершитьРедактированияЗначенияРеквизитаШапки", ЭтотОбъект, ВыбраннаяСтрока);
		
		ЗначениеРеквизита = ТекущиеДанные.ЗначениеРеквизита;
		Если ТекущиеДанные.ИмяРеквизита = "Содержание"
			Или ТекущиеДанные.ИмяРеквизита = "Примечание" Тогда
			ЗначениеРеквизита = ТекущиеДанные.ЗначениеСтроковогоТипа;
		КонецЕсли;
		
		СтруктураПараметров = новый Структура;
		СтруктураПараметров.Вставить("ДляГрузоперевозки", 		ТекущиеДанные.ДляГрузоперевозки);
		СтруктураПараметров.Вставить("ДляЗаказа", 				ТекущиеДанные.ДляЗаказа);
		СтруктураПараметров.Вставить("ДляЗаявки", 				ТекущиеДанные.ДляЗаявки);
		СтруктураПараметров.Вставить("ЗначениеРеквизита", 		ЗначениеРеквизита);
		СтруктураПараметров.Вставить("ИмяРеквизита", 			ТекущиеДанные.ИмяРеквизита);
		СтруктураПараметров.Вставить("СинонимРеквизита", 		ТекущиеДанные.СинонимРеквизита);
		СтруктураПараметров.Вставить("ПерезаполнятьЗначение", 	ТекущиеДанные.ПерезаполнятьЗначение);
	
		ОткрытьФорму("Справочник.CW_ТипыПеревозок.Форма.ФормаРедактированияСтрокиЗначенийРеквизитов", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОпвещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьРедактированияЗначенияРеквизитаШапки(Результат, ИдентификаторСтроки) Экспорт
	
	Если Результат <> Неопределено Тогда
		СтрокаТаблицы = Объект.ПредопределенныеЗначенияРеквизитов.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Результат);  
		
		Если СтрокаТаблицы.ИмяРеквизита = "Содержание" 
			ИЛИ СтрокаТаблицы.ИмяРеквизита = "Примечание" Тогда
			СтрокаТаблицы.ЗначениеСтроковогоТипа = Результат.ЗначениеРеквизита;
		КонецЕсли;   
		
		Модифицированность = Истина;
	КонецЕсли;
	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПредопределенныеЗначенияРеквизитовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПриДобавлении", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Нельзя добавлить строки табличной части. Обновить список доступных реквизитов?", Режим, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПриДобавлении(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокРеквизитовШапкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредопределенныеЗначенияРеквизитовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПриУдалении", ЭтотОбъект, Элементы.ПредопределенныеЗначенияРеквизитов.ТекущаяСтрока);
	ПоказатьВопрос(Оповещение, "Нельзя удалать строки табличной части. Очистить значение в текущей строке?", Режим, 0);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияВопросаПриУдалении(Результат, ИдентификаторСтроки) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторСтроки <> Неопределено Тогда
		НайденнаяСтрока  = Объект.ПредопределенныеЗначенияРеквизитов.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если НайденнаяСтрока <> Неопределено Тогда
			НайденнаяСтрока.ЗначениеРеквизита 	= Неопределено;
			НайденнаяСтрока.ДляГрузоперевозки 	= Ложь;
			НайденнаяСтрока.ДляЗаказа 			= Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   

&НаКлиенте
Процедура ТипКурсаВалютыРасходаПриИзменении(Элемент)
	УстановитьВидимостьПараметра();
КонецПроцедуры

&НаКлиенте
Процедура ТипКурсаВалютыДоходаПриИзменении(Элемент)
	УстановитьВидимостьПараметра();
КонецПроцедуры  

&НаСервере
Процедура УстановитьВидимостьПараметра()
	
	Элементы.БюджетДатаКурсаДохода.Видимость 	= Объект.ТипКурсаВалютыДохода = 2;
	Элементы.БюджетДатаКурсаРасхода.Видимость 	= Объект.ТипКурсаВалютыРасхода = 2;
	
КонецПроцедуры

  

&НаСервере
Процедура ЗаполнитьПредопределенныеЗначенияРеквизитов(ТекущийОбъект)
	
	Для Каждого СтрокаТаблицы из ТекущийОбъект.ПредопределенныеЗначенияРеквизитов Цикл
		ИндексСтроки = ТекущийОбъект.ПредопределенныеЗначенияРеквизитов.Индекс(СтрокаТаблицы); 
		
		СтрокаОбъекта = Объект.ПредопределенныеЗначенияРеквизитов.Получить(ИндексСтроки);  
		СтрокаОбъекта.ЗначениеСтроковогоТипа =  СокрЛП(СтрокаТаблицы.ХранилищеЗначения.Получить());
	КонецЦикла;

КонецПроцедуры 



