
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбъектУчета = ПолучитьОбъектУчетаЭДО(ПараметрКоманды);
	Если Не ЗначениеЗаполнено(ОбъектУчета) Тогда
		Возврат;
	КонецЕсли;

	ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокументОбъектаУчетаКоманда(ОбъектУчета);  

КонецПроцедуры      

&НаСервере
Функция ПолучитьОбъектУчетаЭДО(ПараметрКоманды)

	Если ПараметрКоманды.Корректировка Тогда
		Возврат ПараметрКоманды.ВедомыйСчетФактураКорректировочный;
	Иначе
		Возврат ПараметрКоманды.ВедомыйСчетФактура;
	КонецЕсли;

КонецФункции
