
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор = ПолучитьСтруктуруОтбора(ПараметрКоманды);
	
	мГруппировки 	= ПолучитьГруппировкиОтчета(ТипЗнч(ПараметрКоманды));
	мПоказатели		= ПолучитьПоказателиОтчета(ТипЗнч(ПараметрКоманды));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВнешнийВызов", 	Истина);
	
	Если Отбор.Количество() > 0 Тогда
		ПараметрыФормы.Вставить("ДанныеОтбора", 	Отбор);
	КонецЕсли;

	ПараметрыФормы.Вставить("Группировки", 		мГруппировки);
	ПараметрыФормы.Вставить("Показатели", 		мПоказатели);
	ПараметрыФормы.Вставить("НаДату", 			ТекущаяДата());
	
	ОткрытьФорму("Отчет.CW_ОстаткиНезавершенногоПроизводства.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОтбора(ПараметрКоманды)

	Отбор = новый Структура;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		
		Отбор.Вставить("Грузоперевозка",				ПараметрКоманды);

	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Заказы") Тогда
		
		МассивГрузоперевозок = Справочники.CW_Заказы.ПолучитьМассивГрузоперевозокЗаказа(ПараметрКоманды);
		
		СписокЗначений = новый СписокЗначений;
		СписокЗначений.ЗагрузитьЗначения(МассивГрузоперевозок);

		Отбор.Вставить("Грузоперевозка", СписокЗначений);
		
	КонецЕсли;
	
	Возврат Отбор;
	
КонецФункции

&НаСервере
Функция ПолучитьГруппировкиОтчета(ТипПараметра)
	
	МассивГруппировок = Новый Массив;
	МассивГруппировок.Добавить("Грузоперевозка");
	
	Возврат МассивГруппировок;
	
КонецФункции

&НаСервере
Функция ПолучитьПоказателиОтчета(ТипПараметра)
	
	мПоказатели = новый Массив;
	
	мПоказатели.Добавить("КоличествоОстаток"); 
	мПоказатели.Добавить("СуммаОстаток"); 
	мПоказатели.Добавить("НДСОстаток"); 
	мПоказатели.Добавить("ВсегоОстаток"); 
	мПоказатели.Добавить("Сумма_ВалютаОстаток"); 
	мПоказатели.Добавить("НДС_ВалютаОстаток"); 
	мПоказатели.Добавить("Всего_ВалютаОстаток"); 
	
	
	Возврат мПоказатели;
	
КонецФункции