#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	Если ВнешнийВызов Тогда
		СП = ПолучитьИзВременногоХранилища(АдресВнешнихНастроек);
		_Отбор = _сф.ст_ПолучитьСвойство(СП, "Отбор");
		НастройкиСКД.Отбор.Элементы.Очистить();
		КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
		
		Если _Отбор <> Неопределено Тогда
			Для каждого КЗ Из _Отбор Цикл
				Ключ = КЗ.Ключ;
				Значение = _Отбор[Ключ];
				Если (Ключ = "Грузоперевозка") Тогда
					CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Грузоперевозка", ВидСравненияКомпоновкиДанных.Равно, Значение, Истина, НастройкиСКД.Отбор);	
				ИначеЕсли (Ключ = "ДокументыРасходов") Тогда 
					СписокДР = Новый СписокЗначений;
					СписокДР.ЗагрузитьЗначения(Значение);
					CW_Отчеты.ДобавитьОтборКомпоновкиДанных("ДокументЗатрат", ВидСравненияКомпоновкиДанных.ВСписке, СписокДР, Истина, НастройкиСКД.Отбор);
				ИначеЕсли (Ключ = "Грузоперевозки") Тогда 
					СписокГП = Новый СписокЗначений;
					СписокГП.ЗагрузитьЗначения(Значение);
					CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Грузоперевозка", ВидСравненияКомпоновкиДанных.ВСписке, СписокГП, Истина, НастройкиСКД.Отбор);
				ИначеЕсли (Ключ = "Номенклатура") Тогда 
					СписокНМ = Новый СписокЗначений;
					СписокНМ.ЗагрузитьЗначения(Значение);
					CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Номенклатура", ВидСравненияКомпоновкиДанных.ВСписке, СписокНМ, Истина, НастройкиСКД.Отбор);
				Иначе
					//CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Ключ", ВидСравненияКомпоновкиДанных.Равно, Значение, Истина, НастройкиСКД.Отбор);
					CW_Отчеты.ДобавитьОтборКомпоновкиДанных(Ключ, ВидСравненияКомпоновкиДанных.Равно, Значение, Истина, НастройкиСКД.Отбор);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		
		ВнешнийВызов = Ложь;
		
	КонецЕсли;		
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ВРег(МетаданныеОтчета.Синоним));
	
	// Установим параметры
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(Настройки.НачалоПериода));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(Настройки.КонецПериода));
	
	// формируем по показателям
	Для Каждого Поле Из НастройкиСКД.Выбор.Элементы Цикл
		Если ТипЗнч(Поле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			Для Каждого ПодРаздел из Поле.Элементы Цикл
				Если Найти(Строка(ПодРаздел.Поле), "Сумма") <> 0 Тогда
					ПодРаздел.Использование = Настройки.ПокСумма;
				ИначеЕсли Найти(Строка(ПодРаздел.Поле), "НДС") <> 0 Тогда
					ПодРаздел.Использование = Настройки.ПокНДС;
				ИначеЕсли Найти(Строка(ПодРаздел.Поле), "Всего") <> 0 Тогда
					ПодРаздел.Использование = Настройки.ПокВсего;
				ИначеЕсли Найти(Строка(ПодРаздел.Поле), "Кол") <> 0 Тогда
					ПодРаздел.Использование = Настройки.ПокКол;
				КонецЕсли;					
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;	
	
	// формируем структуру отчета по группировкам
	НастройкиСКД.Структура.Очистить();
	ТекущийРодитель = НастройкиСКД.Структура;
	Для Каждого Группировка Из Настройки.Группировки Цикл
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		// --- 
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		ПолеГруппировки.Использование = Истина;
		// --- 
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование=Истина;
		// --- 
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		НС = ?(Группировка.Сортировка=Перечисления.CW_НаправлениеСортировки.ПоВозрастанию,НаправлениеСортировкиКомпоновкиДанных.Возр,НаправлениеСортировкиКомпоновкиДанных.Убыв);
		ЭлементПорядка.ТипУпорядочивания = НС;
		ЭлементПорядка.Использование = Истина;
		// --- 
		НоваяГруппировка.Имя = Группировка.Представление;
		НоваяГруппировка.Использование = Истина;
		// --- 
		ТекущийРодитель = НоваяГруппировка.Структура;
		
		Если Настройки.ВыводитьДокументыДвижения Тогда
			Для Каждого СтрОтбора из НастройкиСКД.Отбор.Элементы Цикл
				СтрОтбораГр = НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(СтрОтбораГр, СтрОтбора);          
				НоваяГруппировка.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить); 
				СтрОтбора.Использование = Ложь;
			КонецЦикла;	
		КонецЕсли;	
		
	КонецЦикла; 
	
	ЭлементУсловногоОформления = НоваяГруппировка.УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.КолНач");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.СуммаНач");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.НДСНач");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.ВсегоНач");
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Приход.КолПриход");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Приход.СуммаПриход");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Приход.НДСПриход");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Приход.ВсегоПриход");
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Расход.КолРасход");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Расход.СуммаРасход");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Расход.НДСРасход");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Расход.ВсегоРасход");
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.КолКон");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.СуммаКон");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.НДСКон");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.ВсегоКон");		
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ВертикальноеПоложение", ВертикальноеПоложение.Центр);
	
	ЭлементУсловногоОформления.ИспользоватьВГруппировке = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;		
		
	Если Настройки.ВыводитьДокументыДвижения Тогда
		элГруппировкаПоРегистратору = CW_Отчеты.ДобавитьГруппировкуКомпоновкиДанных("Регистратор", НастройкиСКД.Структура);
		CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Регистратор",ВидСравненияКомпоновкиДанных.Заполнено, , Истина, элГруппировкаПоРегистратору.Отбор);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить, элГруппировкаПоРегистратору.ПараметрыВывода);
		
		ЭлементУсловногоОформления = элГруппировкаПоРегистратору.УсловноеОформление.Элементы.Добавить();
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.КолНач");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.СуммаНач");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.НДСНач");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.ВсегоНач");
				
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.КолКон");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.СуммаКон");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.НДСКон");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.ВсегоКон");
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "-");
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Право);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
		
		ЭлементУсловногоОформления.ИспользоватьВЗаголовкеПолей = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		
		//----------------------------------------------------------------------------------------------------------------------------------
		
		ЭлементУсловногоОформления = элГруппировкаПоРегистратору.УсловноеОформление.Элементы.Добавить();
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Приход.КолПриход");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Приход.СуммаПриход");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Приход.НДСПриход");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Приход.ВсегоПриход");
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Расход.КолРасход");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Расход.СуммаРасход");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Расход.НДСРасход");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Расход.ВсегоРасход");
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Регистратор");
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,"Arial",7,,Истина));
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
		
		ЭлементУсловногоОформления.ИспользоватьВЗаголовкеПолей = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		
		//----------------------------------------------------------------------------------------------------------------------------------
		
		//Для Каждого СтрОтбора из НастройкиСКД.Отбор.Элементы Цикл
		//	СтрОтбораГр = элГруппировкаПоРегистратору.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//	ЗаполнитьЗначенияСвойств(СтрОтбораГр, СтрОтбора);
		//	СтрОтбора.Использование = Ложь;
		//КонецЦикла;	
			
	КонецЕсли;	
		
КонецПроцедуры
#КонецЕсли