
&НаКлиенте
Процедура ВидДокументаТСПриИзменении(Элемент)
	
	_СформироватьПредставлениеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура СерияПриИзменении(Элемент)
	
	_СформироватьПредставлениеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	_СформироватьПредставлениеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиПриИзменении(Элемент)
	
	_СформироватьПредставлениеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура _СформироватьПредставлениеДокумента()
	// --- 
	
	Объект.Наименование = Объект.ВидДокументаТС.КраткоеНаименование + " " +СокрЛП(Объект.Серия)+"№"+СокрЛП(Объект.Номер)+" от "+Формат(Объект.ДатаВыдачи,"ДФ=dd.MM.yyyy"); 
	
	// --- 
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_ДоступностьПредставленияЭлемента();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьПредставлениеПриИзменении(Элемент)
	
	_ДоступностьПредставленияЭлемента();
	
КонецПроцедуры

&наСервере
Процедура _ДоступностьПредставленияЭлемента()
	
	Элементы.Представление.ТолькоПросмотр = Не Объект.РедактироватьПредставление;
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти