#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ВернутьПодчиненныеПрофили(ОсновнойПрофиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_ВебПрофили.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ВебПрофили КАК CW_ВебПрофили
	|ГДЕ
	|	CW_ВебПрофили.ОсновнойПрофиль = &ОсновнойПрофиль";
	
	Запрос.УстановитьПараметр("ОсновнойПрофиль", ОсновнойПрофиль);  
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

Функция ВернутьПодчиненныеПрофилиДляСписка(мОсновнойПрофиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_ВебПрофили.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ВебПрофили КАК CW_ВебПрофили
	|ГДЕ
	|	CW_ВебПрофили.ОсновнойПрофиль в (&мОсновнойПрофиль)";
	
	Запрос.УстановитьПараметр("мОсновнойПрофиль", мОсновнойПрофиль);  
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции


Функция ПолучитьКоличествоПодчиненныхПрофилей(ОсновнойПрофиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_ВебПрофили.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ВебПрофили КАК CW_ВебПрофили
	|ГДЕ
	|	CW_ВебПрофили.ОсновнойПрофиль = &ОсновнойПрофиль";
	
	Запрос.УстановитьПараметр("ОсновнойПрофиль", ОсновнойПрофиль);  
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество();
	
КонецФункции

Функция ЕстьПодчиненныеПрофили(ОсновнойПрофиль)	Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	CW_ВебПрофили.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.CW_ВебПрофили КАК CW_ВебПрофили
		|ГДЕ
		|	CW_ВебПрофили.ОсновнойПрофиль = &ОсновнойПрофиль";
	
	Запрос.УстановитьПараметр("ОсновнойПрофиль", ОсновнойПрофиль);
	
	Возврат НЕ Запрос.Выполнить().Пустой();	
	
КонецФункции

Процедура ВыполнитьПереводГрузоперевозокПрофиляВАрхив(ПараметрыПроцедуры, РезультатВыполнения) Экспорт
	
	CW_ОбщийМодульЛичныйКабинетСервер.ПеревестиГрузоперевозокиВАрхив(ПараметрыПроцедуры.ВыделенныеСтроки);

КонецПроцедуры  

Процедура ВыполнитьПереводЗаявокПрофиляВАрхив(ПараметрыПроцедуры, РезультатВыполнения) Экспорт
	
	CW_ОбщийМодульЛичныйКабинетСервер.ПеревестиЗаявкиВАрхив(ПараметрыПроцедуры.ВыделенныеСтроки);

КонецПроцедуры 

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		
		Если Параметры.Свойство("Ключ") Тогда
			Если ЗначениеЗаполнено(Параметры.Ключ.ОсновнойПрофиль) Тогда
				ВыбраннаяФорма = "ФормаПодчиненногоПрофиля";
			Иначе
				ВыбраннаяФорма = "ФормаОсновногоПрофиля";
			КонецЕсли;
		Иначе
			ВыбраннаяФорма = "ФормаОсновногоПрофиля";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОтключенииКонтстантыЗапрашиватьТипФайлаПриДобавленииВАрхив() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВебПрофили.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ВебПрофили КАК CW_ВебПрофили
	               |ГДЕ
	               |	CW_ВебПрофили.ОсновнойПрофиль <> Значение(Справочник.CW_ВебПрофили.ПустаяСсылка)
	               |	И CW_ВебПрофили.ЭтоГруппа = ЛОЖЬ"; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПрофильОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПрофильОбъект.ВыгружатьФайлы = Ложь;
		ПрофильОбъект.ВыводитьТипФайла = Ложь;
		ПрофильОбъект.РазрешеноПрикреплятьФайлы = Ложь;
		
		ПрофильОбъект.ТипыФайлов.Очистить(); 
		
		ПрофильОбъект.ОбменДанными.Загрузка = Истина; 
		ПрофильОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьКонвертациюОсновныхВебПрофилей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВебПрофили.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ВебПрофили КАК CW_ВебПрофили
	               |ГДЕ
	               |	CW_ВебПрофили.ОсновнойПрофиль = ЗНАЧЕНИЕ(Справочник.CW_ВебПрофили.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектПрофиль = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектПрофиль.ДоступенРазделПеревозки 	= Истина; 
		ОбъектПрофиль.ДоступенРазделОтчеты 		= ОбъектПрофиль.ВыводитьЗадолженность;  
		ОбъектПрофиль.ПредставлениеRU 			= СокрЛП(Выборка.Ссылка);  
		ОбъектПрофиль.ПредставлениеEN 			= СокрЛП(Выборка.Ссылка);
		
		ОбъектПрофиль.НастройкиОтбораОтчетЗадоженность = Новый ХранилищеЗначения(ОбъектПрофиль.НастройкиОтбораДокументов.Получить()); 
		
		Для Каждого СтрокаШаблонов из ОбъектПрофиль.ШаблоныЗаявок Цикл
			СтрокаШаблонов.Используется = истина;
		КонецЦикла;   
		
		ОбъектПрофиль.ОбменДанными.Загрузка = ИСТИНА;
		ОбъектПрофиль.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
 #КонецЕсли
