#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Активный = Ложь;
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ПредставлениеНаРусском, "'") > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимо использование символа ' (одинарная кавычка) ",,"ПредставлениеНаРусском","Объект", Отказ);
	КонецЕсли;
	
	Если СтрНайти(ПредставлениеНаАнглийском, "'") > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимо использование символа ' (одинарная кавычка) ",,"ПредставлениеНаАнглийском","Объект", Отказ);
	КонецЕсли;
	
	Если ВыгружатьФайлы и ТипыФайлов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен список типов выгружаемых файлов",,"ВыгружатьФайлы","Объект", Отказ);
	КонецЕсли;
	
	Если АвтоматическиПереводитьВАрхив Тогда
		ПараметрыОтбора = новый Структура("ОбъектХарактеристики",ПараметрПереводаВАрхив);
		мСтроки = СтруктураПрофиля.НайтиСтроки(ПараметрыОтбора);
		
		Если мСтроки.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Параметр перевода в архив отсутсвует в структуре профиля!",,"ПараметрПереводаВАрхив","Объект", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Если НЕ ЭтоГруппа
		И ЗначениеЗаполнено(ОсновнойПрофиль) Тогда
		Если Не ВыгружатьФайлы тогда
			Индекс = ПроверяемыеРеквизиты.Найти("ТипыФайлов.Тип");
			Если Индекс <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(Индекс);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры
#КонецЕсли