
Процедура ПередНачаломЗаполненияДокумента(ПараметрыЗаполнения) Экспорт
	
	Если ПараметрыЗаполнения.КонтрольЗаполненияРеквизитовФормы Тогда
		Если Не ПараметрыЗаполнения.Форма.ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗаполнениеДокумента", ЭтотОбъект, ПараметрыЗаполнения);    
	
	ОчищатьТабличнуюЧасть = Истина;
	Если ПараметрыЗаполнения.Свойство("ОчищатьТабличнуюЧасть") Тогда
		ОчищатьТабличнуюЧасть = ПараметрыЗаполнения.ОчищатьТабличнуюЧасть;	
	КонецЕсли;  
	
	Если Не ОчищатьТабличнуюЧасть Тогда
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;
	
	ОбъектФормы = ПараметрыЗаполнения.Форма.Объект;
	
	Если ОчищатьТабличнуюЧасть 
		и ОбъектФормы[ПараметрыЗаполнения.ИмяТабличнойЧасти].Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Табличная часть будет очищена. Продолжить?", Режим, 0); 
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры  

Процедура ПродолжитьЗаполнениеДокумента(Результат, ДопоплнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли; 

	ОчищатьТабличнуюЧасть = Истина;
	Если ДопоплнительныеПараметры.Свойство("ОчищатьТабличнуюЧасть") Тогда 
		ОчищатьТабличнуюЧасть = ДопоплнительныеПараметры.ОчищатьТабличнуюЧасть;	
	КонецЕсли;
	
	Если ОчищатьТабличнуюЧасть Тогда
		ОбъектФормы = ДопоплнительныеПараметры.Форма.Объект;   
		ОбъектФормы[ДопоплнительныеПараметры.ИмяТабличнойЧасти].Очистить();
	КонецЕсли;
	
	ПараметрыПолученияАдерсаСхемы = Новый Структура;
	ПараметрыПолученияАдерсаСхемы.Вставить("ПустаяСсылка",		ДопоплнительныеПараметры.ПустаяСсылка);	
	ПараметрыПолученияАдерсаСхемы.Вставить("ИмяМакета",			ДопоплнительныеПараметры.ИмяМакета);	
	ПараметрыПолученияАдерсаСхемы.Вставить("Отбор",				ДопоплнительныеПараметры.Отбор);	
	ПараметрыПолученияАдерсаСхемы.Вставить("ПараметрыДанных",	ДопоплнительныеПараметры.ПараметрыДанных);	
	
	ПараметрыОтбора = CW_ЗаполнениеДокументовВызовСервера.ПолучитьНастройкиСхемыОтбора(ПараметрыПолученияАдерсаСхемы);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПараметрыОтбора", ПараметрыОтбора);                    
	СтруктураПараметров.Вставить("Коллекция", 		ДопоплнительныеПараметры.Коллекция);                    
	СтруктураПараметров.Вставить("Оповещение", 		ДопоплнительныеПараметры.Оповещение);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьПолучениеДанных", ЭтотОбъект, СтруктураПараметров);
	
	Если ДопоплнительныеПараметры.ПоказатьФормуОтбора Тогда 
		ОткрытьФорму("ОбщаяФорма.CW_ФормаНастроекОтбораСхемыКомпановкиДанных", ПараметрыОтбора, ДопоплнительныеПараметры.Форма,,,,Оповещение);
	Иначе  
		ВыполнитьОбработкуОповещения(Оповещение, истина);
	КонецЕсли;

КонецПроцедуры   

Процедура ПродолжитьПолучениеДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресТаблицы = CW_ЗаполнениеДокументовВызовСервера.ПолучитьАдресТаблицыРезультата(ДополнительныеПараметры.ПараметрыОтбора, ДополнительныеПараметры.Коллекция);   
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Оповещение, АдресТаблицы);
	
КонецПроцедуры 

Процедура ОчиститьТабличнуюЧасть(Источник, ТабличнаяЧасть) Экспорт
	
	ДопоплнительныеПараметры = Новый Структура;
	ДопоплнительныеПараметры.Вставить("Источник",		Источник); 
	ДопоплнительныеПараметры.Вставить("ТабличнаяЧасть",	ТабличнаяЧасть); 

	ОбъектФормы = ДопоплнительныеПараметры.Источник.Объект;
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьОчисткуТабличнойЧастиДокумента", ЭтотОбъект, ДопоплнительныеПараметры);    
	
	Если ОбъектФормы[ДопоплнительныеПараметры.ТабличнаяЧасть].Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Табличная часть будет очищена. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры   

Процедура ПродолжитьОчисткуТабличнойЧастиДокумента(Результат, ДопоплнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;  
	
	ОбъектФормы = ДопоплнительныеПараметры.Источник.Объект;
	
	ОбъектФормы[ДопоплнительныеПараметры.ТабличнаяЧасть].Очистить();
	
КонецПроцедуры

Функция НоваяСтруктураПараметровЗаполнения() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("ПустаяСсылка", 			Неопределено); 
	Структура.Вставить("Форма",					Неопределено);
	Структура.Вставить("ИмяТабличнойЧасти", 	"");
	Структура.Вставить("ИмяМакета", 			""); 
	Структура.Вставить("ПоказатьФормуОтбора",	Истина); 
	Структура.Вставить("Отбор",					Новый Соответствие); 
	Структура.Вставить("ПараметрыДанных",		Новый Структура); 
	Структура.Вставить("Оповещение",			Неопределено);     
	Структура.Вставить("Коллекция",				"ТаблицаЗначений");  
	Структура.Вставить("КонтрольЗаполненияРеквизитовФормы", Ложь);   
	Структура.Вставить("ОчищатьТабличнуюЧасть", Истина);   
	
	
	
	Возврат Структура;
	
КонецФункции
