#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)   
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = СокрЛП(Наименование);
	// ---------------------------------------------------------------------------- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СтатусыОтслеживаемогоОборудования.Ссылка
	|ИЗ
	|	Справочник.CW_СтатусыОтслеживаемогоОборудования КАК CW_СтатусыОтслеживаемогоОборудования
	|ГДЕ
	|	CW_СтатусыОтслеживаемогоОборудования.Ссылка <> &Ссылка
	|	И CW_СтатусыОтслеживаемогоОборудования.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование)); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если (ТЗ.Количество() <> 0) Тогда
		
		Отказ = Истина;
		Сообщить("Наименование не уникально.");
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры
#КонецЕсли