
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимЗагрузкиДокументов", Истина);
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЗаказТовара"));
	ПараметрыОткрытия.Вставить("ОтборВидДокумента", ТипыДокументов);
	
	ПараметрыОткрытия.Вставить("ПоказыватьЗагруженные", Ложь);
	
	ОткрытьФорму("Обработка.БизнесСеть.Форма.ДокументыОбмена", ПараметрыОткрытия, ЭтотОбъект);
КонецПроцедуры
