#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьДосупныеОбъектыРедактирования() Экспорт
	
	СоответствиеИмяВладельца 	= ПолучитьСоответствиеИмениВладельцаОбъекаДоступа();
	
	СоответствиеВладельцев = Новый Соответствие;
	
	МакетПоУмолчанию = РегистрыСведений.CW_ОбъектыОграниченийДоступа.ПолучитьМакет("ДоступныеОбъекты");	
	//1 - Имя типа объекта; 2 - Принадлежность объекта;
	Для Стр = 2 по МакетПоУмолчанию.ВысотаТаблицы Цикл
		ИмяТипаОбъекта 	= СокрЛП(МакетПоУмолчанию.Область("R"+Формат(Стр,"ЧГ=0")+"C1").Текст);
		ИмяВладельца 	= СокрЛП(МакетПоУмолчанию.Область("R"+Формат(Стр,"ЧГ=0")+"C2").Текст);
		
		МетаданныеОбъекта = Метаданные.Справочники.Найти(ИмяТипаОбъекта);	
		Если МетаданныеОбъекта= Неопределено ТОгда
			МетаданныеОбъекта = Метаданные.Документы.Найти(ИмяТипаОбъекта);	
		КонецЕсли;;
		Если МетаданныеОбъекта= Неопределено ТОгда
			МетаданныеОбъекта = Метаданные.РегистрыСведений.Найти(ИмяТипаОбъекта);	
		КонецЕсли;
		
		Если МетаданныеОбъекта = Неопределено Тогда
			//Нет такого типа объекта
			Продолжить;
		КонецЕсли;
		
		ВладелецОбъекта = СоответствиеИмяВладельца.Получить(ИмяВладельца);
		Если ВладелецОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаданныеОбъекта.ПолноеИмя(), Ложь);
		Если ИдентификаторОбъектаМетаданных = Null Тогда
			Продолжить;
		КонецЕсли;
		
		СоответствиеВладельцев.Вставить(ИдентификаторОбъектаМетаданных, ВладелецОбъекта); 
		
	КонецЦикла;
	
	Возврат СоответствиеВладельцев;
	
КонецФункции

Функция ПолучитьСоответствиеИмениВладельцаОбъекаДоступа()
	
	Результат = Новый Соответствие;
	Результат.Вставить("1С", 		ПредопределенноеЗначение("Перечисление.CW_ВладелецОбъектаДоступа.ЗначениеБухгалтерияПредприятия"));
	Результат.Вставить("КоралВэй", 	ПредопределенноеЗначение("Перечисление.CW_ВладелецОбъектаДоступа.ЗначениеКоралВэй"));
	
	Возврат Результат;
	
КонецФункции


Процедура ДобавитьОбъектОграниченийДоступа(МетаданныеОбъекта, ВладелецОбъекта) Экспорт
	
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаданныеОбъекта.ПолноеИмя(), Ложь);
	
	Если ИдентификаторОбъектаМетаданных <> Null Тогда
		ЗаписьРегистра = РегистрыСведений.CW_ОбъектыОграниченийДоступа.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.ИдентификаторОбъектаМетаданных	= ИдентификаторОбъектаМетаданных;
		ЗаписьРегистра.ВладелецОбъекта 					= ВладелецОбъекта;
		ЗаписьРегистра.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

//Служебные процедуры
Процедура ЗаполнитьРегистрОбъектыОграниченийДоступа() Экспорт
	
	МассивИменРеквизитов = ПолучитьМассивИменРеквизитовГруппыПользователй();
	
	Для Каждого ИмяРеквизита из МассивИменРеквизитов Цикл
		
		ИмяОбъекта = СтрЗаменить(ИмяРеквизита,"УДАЛИТЬРедактирование_","");
		
		МетаданныеОбъекта = Метаданные.Справочники.Найти(ИмяОбъекта);	
		Если МетаданныеОбъекта= Неопределено ТОгда
			МетаданныеОбъекта = Метаданные.Документы.Найти(ИмяОбъекта);	
		КонецЕсли;;
		Если МетаданныеОбъекта= Неопределено ТОгда
			МетаданныеОбъекта = Метаданные.РегистрыСведений.Найти(ИмяОбъекта);	
		КонецЕсли;
		
		Если МетаданныеОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если СтрНачинаетсяС(ИмяОбъекта,"CW_") Тогда
			ВладелецОбъекта = ПредопределенноеЗначение("Перечисление.CW_ВладелецОбъектаДоступа.ЗначениеКоралВэй");
		Иначе
			ВладелецОбъекта = ПредопределенноеЗначение("Перечисление.CW_ВладелецОбъектаДоступа.ЗначениеБухгалтерияПредприятия");
		КонецЕсли;
	
		ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаданныеОбъекта.ПолноеИмя(), Ложь);
		
		Если ИдентификаторОбъектаМетаданных <> Null Тогда
			ЗаписьРегистра = РегистрыСведений.CW_ОбъектыОграниченийДоступа.СоздатьМенеджерЗаписи();
			ЗаписьРегистра.ИдентификаторОбъектаМетаданных	= ИдентификаторОбъектаМетаданных;
			ЗаписьРегистра.ВладелецОбъекта 					= ВладелецОбъекта;
			ЗаписьРегистра.Записать(Истина);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМассивИменРеквизитовГруппыПользователй()
	
	Результат = Новый Массив;
	
	Для Каждого Реквизит из Метаданные.Справочники.CW_ГруппыПользователей.Реквизиты Цикл
		Если СтрНачинаетсяС(Реквизит.Имя, "УДАЛИТЬРедактирование_") Тогда
			Результат.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
//Служебные процедуры

#КонецЕсли