#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМассивОповещенийКОтправке() Экспорт
	
	МассивОповещений = Новый Массив;

	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОповещенияКОтправке.Объект КАК Объект,
	               |	CW_ОповещенияКОтправке.ЗаголовокОповещения КАК ЗаголовокОповещения,
	               |	CW_ОповещенияКОтправке.ТекстОповещения КАК ТекстОповещения
	               |ИЗ
	               |	РегистрСведений.CW_ОповещенияКОтправке КАК CW_ОповещенияКОтправке
	               |ГДЕ
	               |	CW_ОповещенияКОтправке.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивОповещений;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивОповещений.Добавить(Новый Структура("Объект,ЗаголовокОповещения,ТекстОповещения", Выборка.Объект, Выборка.ЗаголовокОповещения, Выборка.ТекстОповещения));
	КонецЦикла;
	
	//Очистим полученные записи
	Набор = РегистрыСведений.CW_ОповещенияКОтправке.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(ТекущийПользователь);
	Набор.Очистить();;
	Набор.Записать();
	
	Возврат МассивОповещений;
	
КонецФункции

Процедура ЗарегистрироватьОповещениеКОтправке(МассивОповещений) Экспорт
	
	Для Каждого ДанныеОпвещения из МассивОповещений Цикл
		
		Запись = РегистрыСведений.CW_ОповещенияКОтправке.СоздатьМенеджерЗаписи();
		Запись.Пользователь 			=  ДанныеОпвещения.Пользователь;
		Запись.Объект 					=  ДанныеОпвещения.Объект;
		Запись.ЗаголовокОповещения 		=  ДанныеОпвещения.ЗаголовокОповещения;
		Запись.ТекстОповещения 			=  ДанныеОпвещения.ТекстОповещения;
		Запись.ИдентификаторОповещения 	=  Новый УникальныйИдентификатор;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли