&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПросмотрРасходов = CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Расходы");
	ПросмотрДоходов  = CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Доходы");
	// --- 
	Если (НЕ ПросмотрРасходов И НЕ ПросмотрДоходов) Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	// --- 
	_ПраваДоступа();
	
	// ---------------------------------------------------------------------------- 
	
	Параметры.Свойство("ВнешнийВызов", Отчет.ВнешнийВызов);
	Если Отчет.ВнешнийВызов Тогда
		
		ПФ = Новый Структура("Отбор,Группировки,Параметры");
		ЗаполнитьЗначенияСвойств(ПФ, Параметры);
		Отчет.АдресВнешнихНастроек = ПоместитьВоВременноеХранилище(ПФ, ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПраваДоступа()
	
	Если ПросмотрРасходов Тогда
		Элементы.ВидДоговора.СписокВыбора.Добавить(1, "входящие документы");
		ВидДоговора = 1;
	КонецЕсли;
	
	Если ПросмотрДоходов Тогда
		Элементы.ВидДоговора.СписокВыбора.Добавить(2, "исходящие документы");
		ВидДоговора = ?(ВидДоговора = 0, 2, ВидДоговора);;
	КонецЕсли;
	
	Если ПросмотрРасходов и ПросмотрДоходов Тогда
		Элементы.ВидДоговора.СписокВыбора.Вставить(0, 0, "все");
		ВидДоговора = 1;
	КонецЕсли;
	
	ЗаголовокПереключателя = "договоры";
	Если Константы.CW_ВедетсяУчетПриложенийПоДоговорам.Получить() Тогда
		ЗаголовокПереключателя = "договоры и приложения"
	КонецЕсли;
	
	Элементы.ВидДокумента.СписокВыбора.Добавить(2, ЗаголовокПереключателя);

		
КонецФункции
 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	_ВосстановитьСтандартныеНастройки();
	
	_ВосстановитьСеансовуюНастройку();
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	НаДату = ТекущаяДата();
	
	Если Отчет.ВнешнийВызов Тогда
		_ОбработатьВнешниеПараметры();
		Сформировать(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ОбработатьВнешниеПараметры()
	
	СП = ПолучитьИзВременногоХранилища(Отчет.АдресВнешнихНастроек);
	
	ПараметрыОтчета = _сф.ст_ПолучитьСвойство(СП,"Параметры");
	НаДату 			= ПараметрыОтчета.НаДату;
	
	Если ПараметрыОтчета.Входящие  и ПараметрыОтчета.Исходящие Тогда
		ВидДоговора = 0;
	ИначеЕсли ПараметрыОтчета.Входящие Тогда 
		ВидДоговора = 1;
	ИначеЕсли ПараметрыОтчета.Исходящие Тогда 
		ВидДоговора = 2;
	КонецЕсли;
	
	_Группировки = _сф.ст_ПолучитьСвойство(СП,"Группировки");
	Если (_Группировки <> Неопределено) Тогда
		Группировки.Очистить();
		Для каждого _Группировка Из _Группировки Цикл
			Нстр = Группировки.Добавить();
			Нстр.ИмяПоля = _Группировка;
			Нстр.Представление = _Группировка;
			Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		КонецЦикла; 
	КонецЕсли; 
	
	_Отбор = _сф.ст_ПолучитьСвойство(СП,"Отбор");
	Если (_Отбор <> Неопределено) Тогда
		
		Отчет.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		Для каждого КЗ Из _Отбор Цикл
			
			_УФС.ДобавитьОтбор(Отчет.КомпоновщикНастроек.Настройки.Отбор,КЗ.Ключ,,_Отбор[КЗ.Ключ]);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_ОтсутствующиеОригиналыДокументов.ПолучитьМакет("Схема").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Отказ = ЗавершениеРаботы;
	
	ТекстПредупреждения = "Закрыть отчет без сохранения настроек?";
	
	Если Не ЗавершениеРаботы Тогда
		_СохранитьСеансовуюНастройку();
		ВариантМодифицирован = Ложь;
	КонецЕсли;
	
КонецПроцедуры



// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть = Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка    = Ложь;
	Иначе
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка    = Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка    = Истина;
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("ВидДоговора", ВидДоговора);
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			// Отбор
			НастройкиКД = "";
			СеансоваяНастройка.Свойство("Отбор", НастройкиКД);
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			Для Каждого СтрОтбор из НастройкиКД.Отбор.Элементы Цикл
				НовОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовОтбор, СтрОтбор);
			КонецЦикла;	
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("ВидДоговора", ВидДоговора);
	СтруктураНастройки.Вставить("Группировки", Группировки.Выгрузить());
	СтруктураНастройки.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
		      
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Группировки.Количество() = 0 Тогда
		_УФК.ВывестиПредупреждение("Не выбрано ни одной группировки!");
		Возврат;				
	КонецЕсли;	
	
	_Настройка(Истина);
	СформироватьОтчет();
	ОбработатьОтчет();
	
	Отчет.ВнешнийВызов = Ложь;
		
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
		
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ВидДоговора", 	ВидДоговора);
	Настройки.Вставить("ВидДокумента", 	ВидДокумента);
	Настройки.Вставить("Группировки", 	Группировки.Выгрузить());
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор));
	
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Количество документов", "Количество документов", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
	СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	
	ДоступныеДействия = Новый Массив();
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
	
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("ВидДоговора", ВидДоговора);
	//Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки.Выгрузить());
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); // ДанныеФормыКоллекция
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);

КонецПроцедуры

