
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеПользователями = CW_ПраваДоступа.ПравоДоступно("УправлениеПользователями");	
	
	ЭтаФорма.ТолькоПросмотр = Не УправлениеПользователями;
	Элементы.НастройкаФильтраГрузоперевозок.Доступность = УправлениеПользователями;
	Элементы.ДеревоРедактированияСправочников.ТолькоПросмотр = Не УправлениеПользователями;
	
	Элементы.ДеревоРедактированияСправочников.ТолькоПросмотр = Не УправлениеПользователями;
	Элементы.ДеревоРедактированияСправочниковГруппа2.Доступность = УправлениеПользователями;
	
	Элементы.КонтекстноеМенюУстановитьФлажкиДляВыделенныхСтрок.Доступность = УправлениеПользователями;
	Элементы.КонтекстноеМенюСнятьФлажкиДляВыделенныхСтрок.Доступность = УправлениеПользователями;
	
	Элементы.ГруппаОтборОбъектов.Доступность = УправлениеПользователями;
	
	Если Параметры.Ключ.Пустая() Тогда  
		ЗаполнитьДеревоНастроекСтатейДДС(Параметры.ЗначениеКопирования);
		ЗаполнитьДеревоНастроекРедактированияСправочников(Параметры.ЗначениеКопирования);
		ЗаполнитьДеревоПравПараметров(Параметры.ЗначениеКопирования);
		ЗаполнитьНастройкуПравШаблонов(Параметры.ЗначениеКопирования);
		ЗаполнитьСписокИнициацииСогласования(Параметры.ЗначениеКопирования);
		ЗаполнитьСписокДоступныхОрганизаций(Параметры.ЗначениеКопирования);
		
		Если ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов") Тогда
			ЗаполнитьДеревоСтатусов(Параметры.ЗначениеКопирования);
		КонецЕсли;
		
	КонецЕсли;
	
	ПравоРедактироватьНастройкиМониторинга 				= CW_ПраваДоступа.ПравоДоступно("РедактированиеНастроекМониторинга");
	Элементы.ДеревоПравПараметров.Доступность 			= ПравоРедактироватьНастройкиМониторинга;	
	Элементы.ГруппаСправочникиКИ.Видимость 				= ПолучитьФункциональнуюОпцию("CW_ИспользованиеCRM");
	Элементы.СтраницаБюджетирование.Видимость			= ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования");
	
	Если Объект.Ссылка = Справочники.CW_ГруппыПользователей.Администраторы Тогда
		Объект.ПолныеПрава = Истина;
		Элементы.ПолныеПрава.Доступность = Ложь;
		Элементы.Наименование.Доступность = Ложь;
	КонецЕсли; 
	
	
	Если Параметры.Ключ.Пустая() Тогда
		_УправлениеЭлементамиФормы();     
	КонецЕсли;
	
	УстановитьДоступностьРедактируемыхРеквизитовШапки();
 	УстановитьДоступностьЭлементовБюджета();   
	
	
	_УстановитьОтборСостава();
	
	// добавлено CW (КС)..
	//--------------------
	РедактированиеСроковОплаты 		= Объект.РедактированиеСроковОплатыВходящихСчетов Или Объект.РедактированиеСроковОплатыИсходящихСчетов;
	
	УстановитьВидимостьПодчиненных_Номерасчетов();
	УстановитьВидимостьПодчиненных_Номера();
	
	
	ТекстЗаказы = "";
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов") Тогда
		ТекстЗаказы = " и заказов";
	КонецЕсли;
	
	Элементы.СтраницаПланированиеДДС.Видимость = Объект.ДоступенБлокПланированияДДС;    
	
	
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьДеревоНастроекСтатейДДС(ТекущийОбъект.Ссылка);
	ЗаполнитьДеревоНастроекРедактированияСправочников(ТекущийОбъект.Ссылка);
	ЗаполнитьДеревоПравПараметров(ТекущийОбъект.Ссылка);
	ЗаполнитьНастройкуПравШаблонов(ТекущийОбъект.Ссылка);
	ЗаполнитьСписокИнициацииСогласования(ТекущийОбъект.Ссылка);
	ЗаполнитьСписокДоступныхОрганизаций(ТекущийОбъект.Ссылка);
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов") Тогда
		ЗаполнитьДеревоСтатусов(ТекущийОбъект.Ссылка);
	КонецЕсли;
	
	ФильтрГрузоперевозок = ТекущийОбъект.ХранилищеФильтраГрузоперевозок.Получить();
	Если ФильтрГрузоперевозок <> Неопределено Тогда
		АдресФильтра = ПоместитьВоВременноеХранилище(ФильтрГрузоперевозок,ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли; 
	
	ФильтрЗаявок = ТекущийОбъект.ХранилищеФильтраЗаявок.Получить();
	Если ФильтрЗаявок <> Неопределено Тогда
		АдресФильтраЗаявок = ПоместитьВоВременноеХранилище(ФильтрЗаявок,ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли; 
	
	ФильтрЗаказов = ТекущийОбъект.ХранилищеФильтраЗаказов.Получить();
	Если ФильтрЗаказов <> Неопределено Тогда
		АдресФильтраЗаказов = ПоместитьВоВременноеХранилище(ФильтрЗаказов,ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли; 

	_УправлениеЭлементамиФормы();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНастройкуПравШаблонов(ГруппаПользователя)  
	
	ТаблицаПрав = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьТаблицаПравДоступа(ГруппаПользователя);
	ПраваРедактирвоанияШаблонов.Загрузить(ТаблицаПрав);
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаписатьИнициациюСогласования();
	ЗаписатьДанныеПравНаПараметры();
	
	ЗаписатьДоступныеСтатьиДДСВРегистр();
	ЗаписатьДоступныеСтатусыВРегистр();
	ЗаписатьРазрешенныеСправочникиВРегистр();  
	
	ЗаписатьПраваРедактированияШаблонов();   
	
	ЗаписатьРодиДляГруппыПользователей();
	
	_УправлениеЭлементамиФормы();
	_УстановитьОтборСостава();
	
	ЗаписатьСписокДоступныхОрганизаций();
	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьСписокДоступныхОрганизаций()
	
	ТаблицаНабора = РегистрыСведений.CW_ОрганизацииДоступныеПоГруппамПользователей.ПолучитьПустуюТаблицуНабора();
	
	Для Каждого СтрокаТаблицы из ДоступныеОрганизации Цикл
		СтрокаНабора = ТаблицаНабора.Добавить();
		СтрокаНабора.ГруппаПользователей 	= Объект.Ссылка;
		СтрокаНабора.Организация 			= СтрокаТаблицы.Организация;
	КонецЦикла;
	
	РегистрыСведений.CW_ОрганизацииДоступныеПоГруппамПользователей.ЗаписатьСписокДоступныхОрганизаций(Объект.Ссылка, ТаблицаНабора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРодиДляГруппыПользователей()   
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ГруппаПользователей", 	Объект.Ссылка);
	ПараметрыПроцедуры.Вставить("РеестрыНДС0",			Объект.РеестрыНДС0);
	ПараметрыПроцедуры.Вставить("ДоходыНерезидентов",	Объект.ДоходыНерезидентов);
	ПараметрыПроцедуры.Вставить("ОбменС1СЭПД", 			Объект.ОбменС1СЭПД);
	
	Справочники.CW_ГруппыПользователей.ОбновитьПрофилиПользователей(ПараметрыПроцедуры);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхОрганизаций(ГруппаПользователя)    
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ТаблицаОрганизаций = РегистрыСведений.CW_ОрганизацииДоступныеПоГруппамПользователей.ПолучитьСписокДоступныхОрганизаций(ГруппаПользователя);
		ДоступныеОрганизации.Загрузить(ТаблицаОрганизаций);
	КонецЕсли;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	Элементы.СтраницаСостав.Видимость = (НЕ Объект.Ссылка.Пустая());
	Элементы.СтраницыПрав.Видимость = (НЕ Объект.ПолныеПрава);
	
	// Раздел "ФИНАНСЫ"
	// ----------------
	
	// Закладка "Расходы и доходы"
	//-------------------------------
	
	// Просмотр документов
	Элементы.ГруппаПросмотрФинансовСоставДокументов.Доступность = (Объект.ПросмотрФинансов);
	Элементы.ГруппаРедактированиеРасходов.Доступность = (Объект.РедактированиеФинансов и Объект.ПросмотрФинансов_Расходы);
	
	// редактирование документов
	Элементы.ГруппаОпцииРедактированияДокументов.Доступность = Объект.РедактированиеФинансов;
	
	Элементы.ГруппаРедактированиеДоходов.Доступность = (Объект.РедактированиеФинансов и Объект.ПросмотрФинансов_Доходы);
	Элементы.РедактированиеФинансов.Доступность = (Объект.ПросмотрФинансов);
	Элементы.РедактированиеОперативныхОплат.Доступность = (Объект.ПросмотрФинансов_ОперативныйУчет);
	
	// опции редактирования документов
	Элементы.РазрешитьПроведениеДокументовБезГрузоперевозок.Доступность = (Объект.РедактированиеФинансов);
	Элементы.РедактированиеСтавкиНДС.Доступность = (Объект.РедактированиеФинансов);
	Элементы.РедактированиеСпособаУчетаНДС.Доступность = (Объект.РедактированиеФинансов_Расходы_Акты или Объект.РедактированиеФинансов_Расходы_Счета);
	Элементы.РедактированиеНомеровПервичныхДокументов.Доступность = (Объект.РедактированиеФинансов_Доходы_Акты ИЛИ Объект.РедактированиеФинансов_Доходы_Счета);
	//		Элементы.РедактированиеСроковОплаты.Доступность = Объект.РедактированиеФинансов;
	Элементы.РедактированиеСроковОплатыВходящихСчетов.Доступность = Объект.РедактированиеФинансов_Расходы_Счета;
	Элементы.РедактированиеСроковОплатыИсходящихСчетов.Доступность = Объект.РедактированиеФинансов_Доходы_Счета;
	
	Элементы.ГруппаДополнениеРазрешенийРедактированияИсходящихСчетов.Доступность   = Объект.РедактированиеФинансов_Доходы_Счета;
	Элементы.ГруппаДополнениеРазрешенийРедактироватьВходящиеСчета.Доступность    = Объект.РедактированиеФинансов_Расходы_Счета;
	
	// Закладка "Оплаты"                                   
	Элементы.ПросмотрОперативныхОплат.Доступность = (Объект.ПросмотрФинансов);
	Элементы.ПросмотрФинансов_Оплаты.Доступность = (Объект.ПросмотрФинансов);
	
	// Закладка "Наличие оригиналов"
	Элементы.РедактированиеВозвратаОригиналовОтПоставщика.Доступность = (Объект.ПросмотрФинансов_Расходы);
	Элементы.РедактированиеВозвратаОригиналовОтКлиента.Доступность = (Объект.ПросмотрФинансов_Доходы);
	
	// Закладка "Блокировка"
	Элементы.ЗакрытиеГрузоперевозок.Доступность = (Объект.РедактированиеФинансов_Доходы_Акты И Объект.РедактированиеФинансов_Расходы_Акты);
	Элементы.ОтменаЗакрытияГрузоперевозок.Доступность = (Объект.РедактированиеФинансов_Доходы_Акты И Объект.РедактированиеФинансов_Расходы_Акты);

	// статусы документов	
	Элементы.ДоступныеСтатусыДокументов.Видимость = Объект.РедактированиеСтатусовДокументов;
	
	
	// Раздел "МОНИТОРИНГ"
	
	Элементы.ДоступныеТипыГрузоперевозок.Видимость 		= Объект.ОграничениеПоТипамГрузоперевозок;
	Элементы.НастройкаФильтраГрузоперевозок.Видимость 	= Объект.ФильтрГрузоперевозок и НЕ ЭтаФорма.ТолькоПросмотр;
	Элементы.КомандаНастройкаФильтаЗаявок.Видимость 	= Объект.ФильтрЗаявок и НЕ ЭтаФорма.ТолькоПросмотр;
	Элементы.КомандаНастройкаОтбораЗаказов.Видимость 	= Объект.ФильтрЗаказов и НЕ ЭтаФорма.ТолькоПросмотр;
	Элементы.ГруппаСправочникиCRM.Видимость 			= Объект.РедактированиеCRM; 
	
	УстановитьЦветНадлписиФильтров();
	
КонецПроцедуры    

&НаСервере
Процедура УстановитьЦветНадлписиФильтров() 
	
	Если ЭтоАдресВременногоХранилища(АдресФильтра) Тогда 
		ЦветТекста = Новый Цвет;
	Иначе
		ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;   
	КонецЕсли;  
	Элементы.НастройкаФильтраГрузоперевозок.ЦветТекста  = ЦветТекста;
	
	Если ЭтоАдресВременногоХранилища(АдресФильтраЗаказов) Тогда 
		ЦветТекста = Новый Цвет;
	Иначе
		ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;   
	КонецЕсли;  
	Элементы.КомандаНастройкаОтбораЗаказов.ЦветТекста   = ЦветТекста;
	
	Если ЭтоАдресВременногоХранилища(АдресФильтраЗаявок) Тогда
		ЦветТекста = Новый Цвет;
	Иначе
		ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;   
	КонецЕсли;
	
	Элементы.КомандаНастройкаФильтаЗаявок.ЦветТекста    = ЦветТекста;
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьОтборСостава()
	// --- 
	
	Состав.Параметры.УстановитьЗначениеПараметра("Группа",Объект.Ссылка);
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура ПолныеПраваПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
	ОбновитьДанныеРегистраПравДДС = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПолныеПраваПриИзмененииНаСервере()
	
	ОбновитьИнтерфейс = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеФинансов_Расходы_АктыПриИзменении(Элемент)
	
	Если НЕ Объект.РедактированиеФинансов_Расходы_Акты Тогда
		// если акт то же не доступен для редактирования, 
		// то снимаем флаг редактирования способа НДС
		Если Объект.РедактированиеФинансов_Доходы_Счета = Ложь Тогда
			Объект.РедактированиеСпособаУчетаНДС = Ложь;
			Объект.РедактированиеВозвратаОригиналовОтПоставщика = Ложь;
		КонецЕсли;
		
		Объект.РедактированиеВозвратаОригиналовОтПоставщика = Ложь;
	КонецЕсли;
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеФинансов_Доходы_АктыПриИзменении(Элемент)
	
	Если НЕ Объект.РедактированиеФинансов_Доходы_Акты Тогда
		Объект.РедактированиеВозвратаОригиналовОтКлиента=Ложь;
	КонецЕсли;
	Если (НЕ Объект.РедактированиеФинансов_Доходы_Акты И НЕ Объект.РедактированиеФинансов_Доходы_Счета) Тогда
		Объект.РедактированиеНомеровПервичныхДокументов = Ложь;
	КонецЕсли; 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеФинансовПриИзменении(Элемент)
	
	Если Объект.РедактированиеФинансов = Ложь Тогда
		
		// сбросим возможность редактирования документов
		Объект.РедактированиеФинансов_Расходы_Счета = Ложь;
		Объект.РедактированиеФинансов_Расходы_Акты 	= Ложь;
		Объект.РедактированиеФинансов_Доходы_Счета 	= Ложь;
		Объект.РедактированиеФинансов_Доходы_Акты 	= Ложь;
		
		// сбросим все опции редактирования
		Объект.РазрешитьПроведениеДокументовБезГрузоперевозок = Ложь;
		Объект.РедактированиеСтавкиНДС	 		= Ложь;
		Объект.РедактированиеСпособаУчетаНДС 	= Ложь;
		Объект.РедактированиеНомеровПервичныхДокументов = Ложь;
		РедактированиеСроковОплаты = Ложь;
		
		РедактированиеСроковОплатыПриИзменении(Элемент);
		
		Объект.РазрешитьРедактированиеИсходящихОплаченныхСчетов    = Ложь;
		Объект.РазрешитьРедактированиеИсходящихАктированныхСчетов  = Ложь;
		Объект.РазрешитьРедактированиеВходящихОплаченныхСчетов     = Ложь;
		Объект.РазрешитьРедактированиеВходящихАктированныхСчетов   = Ложь;
		Объект.РедактированиеФинансов_Корректировки 			   = Ложь;
		
		Объект.РедактированиеНомераДокументаДоходыПоГрузоперевозкам    = Ложь;
		Объект.РедактированиеНомераДокументаРасходыПоГрузоперевозкам    = Ложь;
	КонецЕсли; 
	
	УстановитьВидимостьПодчиненных_Номера();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрФинансовПриИзменении(Элемент)
	
	Если (НЕ Объект.ПросмотрФинансов) Тогда
		
		// виды документов для просмотра
		Объект.ПросмотрФинансов_Расходы = Ложь;
		Объект.ПросмотрФинансов_Доходы = Ложь;
		
		// сбросим возможность редактирования
		Объект.РедактированиеФинансов = Ложь;
		РедактированиеФинансовПриИзменении(Элемент);
		
		// опции редактирования документов
		Объект.РазрешитьПроведениеДокументовБезГрузоперевозок = Ложь;
		Объект.РедактированиеСтавкиНДС = Ложь;
		Объект.РедактированиеСпособаУчетаНДС = Ложь;
		Объект.РедактированиеНомеровПервичныхДокументов = Ложь;
		РедактированиеСроковОплаты = Ложь;
		РедактированиеСроковОплатыПриИзменении(Элемент);
		
		// управление блокировкой 
		Объект.ЗакрытиеГрузоперевозок=Ложь;
		Объект.ОтменаЗакрытияГрузоперевозок=Ложь;
		
		// контроль наличия оригиналов документов 
		Объект.РедактированиеВозвратаОригиналовОтКлиента=Ложь;
		Объект.РедактированиеВозвратаОригиналовОтПоставщика=Ложь;
		
		// управление оплатами 
		Объект.ПросмотрФинансов_ОперативныйУчет=Ложь;
		Объект.РедактированиеФинансов_ОперативныйУчет=Ложь;
		Объект.ПросмотрФинансов_Оплаты = Ложь;
		
		// установим признак модифицированности
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Декорация6Нажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияПредопределенногоОтбора",ЭтотОбъект, "АдресФильтра"); 
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресОтбора",	 	АдресФильтра);
	СтруктураПараметров.Вставить("ИмяСхемыЖурнала", "CW_СхемаЖурналаГрузоперевозок");
	
	ОткрытьФорму("Справочник.CW_ГруппыПользователей.Форма.ФормаПредопределенногоОтбора",СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройкаФильтаЗаявок(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияПредопределенногоОтбора",ЭтотОбъект, "АдресФильтраЗаявок"); 
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресОтбора",	 	АдресФильтраЗаявок);
	СтруктураПараметров.Вставить("ИмяСхемыЖурнала", "CW_СхемаЖурналаЗаявок");
	
	ОткрытьФорму("Справочник.CW_ГруппыПользователей.Форма.ФормаПредопределенногоОтбора",СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройкаОтбораЗаказов(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияПредопределенногоОтбора",ЭтотОбъект, "АдресФильтраЗаказов"); 
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресОтбора",	 	АдресФильтраЗаказов);
	СтруктураПараметров.Вставить("ИмяСхемыЖурнала", "CW_СхемаЖурналаЗаказов");
	
	ОткрытьФорму("Справочник.CW_ГруппыПользователей.Форма.ФормаПредопределенногоОтбора",СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПредопределенногоОтбора(Ответ, ИмяРеквизита) Экспорт
	
	Если Ответ <> Неопределено Тогда
		ЭтаФорма[ИмяРеквизита] = Ответ;
	КонецЕсли; 

	УстановитьЦветНадлписиФильтров();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресФильтра) Тогда
		ДанныеОтбораГрузоперевозок = ПолучитьИзВременногоХранилища(АдресФильтра);
	Иначе
		ТекущийОбъект.ФильтрГрузоперевозок = Ложь;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресФильтраЗаявок) Тогда
		ДанныеОтбораЗаявок = ПолучитьИзВременногоХранилища(АдресФильтраЗаявок);
	Иначе
		ТекущийОбъект.ФильтрЗаявок = Ложь;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресФильтраЗаказов) Тогда
		ДанныеОтбораЗаказов = ПолучитьИзВременногоХранилища(АдресФильтраЗаказов);
	Иначе
		ТекущийОбъект.ФильтрЗаказов = Ложь;
	КонецЕсли;
	
	ТекущийОбъект.ХранилищеФильтраЗаказов 			= Новый ХранилищеЗначения(ДанныеОтбораЗаказов);
	ТекущийОбъект.ХранилищеФильтраЗаявок	 		= Новый ХранилищеЗначения(ДанныеОтбораЗаявок);
	ТекущийОбъект.ХранилищеФильтраГрузоперевозок 	= Новый ХранилищеЗначения(ДанныеОтбораГрузоперевозок);   
	
	Если Объект.ПолныеПрава Тогда
		мИменаРеквизитов = Справочники.CW_ГруппыПользователей.ПолучитьМассивИменРеквизитовДляПолныхПрав();
		Для Каждого ИмяРеквизита из мИменаРеквизитов Цикл
			ТекущийОбъект[ИмяРеквизита] = Объект.ПолныеПрава;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрГрузоперевозокПриИзменении(Элемент)
	
	Если Не Объект.ФильтрГрузоперевозок Тогда
		АдресФильтра = "";
	КонецЕсли;
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЗаявокПриИзменении(Элемент)
	
	Если Не Объект.ФильтрЗаявок Тогда
		АдресФильтраЗаявок = "";
	КонецЕсли;
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЗаказовПриИзменении(Элемент)
	Если Не Объект.ФильтрЗаказов Тогда
		АдресФильтраЗаказов = "";
	КонецЕсли;
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры


// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПросмотрОперативныхОплатПриИзменении(Элемент)
	Если (НЕ Объект.ПросмотрФинансов_ОперативныйУчет) Тогда
		
		Объект.РедактированиеФинансов_ОперативныйУчет = Ложь;
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПросмотрФинансов_РасходыПриИзменении(Элемент)
	
	Если (НЕ Объект.ПросмотрФинансов_Расходы) Тогда
		
		Объект.РедактированиеФинансов_Расходы_Счета = Ложь;
		Объект.РедактированиеФинансов_Расходы_Акты = Ложь;
		
	КонецЕсли; 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрФинансов_ДоходыПриИзменении(Элемент)
	
	Если (НЕ Объект.ПросмотрФинансов_Доходы) Тогда
		
		Объект.РедактированиеФинансов_Доходы_Счета = Ложь;
		Объект.РедактированиеФинансов_Доходы_Акты = Ложь;
		
	КонецЕсли; 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СоставПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора"			, Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор"	, истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаДобавленияПользователя",ЭтотОбъект); 
	
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора",ПараметрыФормыВыбора,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияПользователя(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Результат = _ДобавитьПользователя(Ответ);
		Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Результат));
		Иначе
			Элементы.Состав.Обновить();
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДобавитьПользователя(мПользователей)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Пользователь
	               |ПОМЕСТИТЬ ВТ_ВыбранныеПользователи
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Ссылка В(&мПользователей)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Пользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ПараметрыПользователей.Пользователь КАК Пользователь
	               |ПОМЕСТИТЬ ВТ_ПользователиВГруппе
	               |ИЗ
	               |	РегистрСведений.CW_ПараметрыПользователей КАК CW_ПараметрыПользователей
	               |ГДЕ
	               |	CW_ПараметрыПользователей.Группа = &Группа
	               |	И CW_ПараметрыПользователей.Пользователь В(&мПользователей)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Пользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВыбранныеПользователи.Пользователь КАК Пользователь,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПользователиВГруппе.Пользователь ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК МожноДобавить
	               |ПОМЕСТИТЬ ВТ_Итоговая
	               |ИЗ
	               |	ВТ_ВыбранныеПользователи КАК ВТ_ВыбранныеПользователи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПользователиВГруппе КАК ВТ_ПользователиВГруппе
	               |		ПО ВТ_ВыбранныеПользователи.Пользователь = ВТ_ПользователиВГруппе.Пользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Итоговая.Пользователь КАК Пользователь
	               |ИЗ
	               |	ВТ_Итоговая КАК ВТ_Итоговая
	               |ГДЕ
	               |	НЕ ВТ_Итоговая.МожноДобавить";
	
	Запрос.УстановитьПараметр("мПользователей"	, мПользователей);
	Запрос.УстановитьПараметр("Группа"			, Объект.Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат(_УФКС.Ответ(1,"Пользователь(и) уже принадлежат группе"));
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.CW_ПараметрыПользователей.СоздатьМенеджерЗаписи();
		Запись.Пользователь = Выборка.Пользователь;
		Запись.Группа = Объект.Ссылка;
		Запись.Записать(Истина);
		
	КонецЦикла; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаКлиенте
Процедура РедактированиеФинансов_Расходы_СчетаПриИзменении(Элемент)
	
	// если сняли флаг
	Если Объект.РедактированиеФинансов_Расходы_Счета = Ложь Тогда
		Объект.РедактированиеСроковОплатыВходящихСчетов = Ложь;
		
		// если акт то же не доступен для редактирования, 
		// то снимаем флаг редактирования способа НДС
		Если Объект.РедактированиеФинансов_Расходы_Акты = Ложь Тогда
			Объект.РедактированиеСпособаУчетаНДС = Ложь;
			Объект.РедактированиеВозвратаОригиналовОтПоставщика = Ложь;
		КонецЕсли;
		
		Объект.РазрешитьРедактированиеВходящихОплаченныхСчетов		= Ложь;
		Объект.РазрешитьРедактированиеВходящихАктированныхСчетов 	= Ложь;
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеФинансов_Доходы_СчетаПриИзменении(Элемент)
	
	// сняли флаг
	Если Объект.РедактированиеФинансов_Доходы_Счета = Ложь Тогда
		Объект.РедактированиеВозвратаОригиналовОтКлиента = Ложь;
		Объект.РедактированиеСроковОплатыИсходящихСчетов = Ложь;
		
		// если акт то же не доступен для редактирования, то снимаем флаг изменения номеров
		Если Объект.РедактированиеФинансов_Доходы_Акты = Ложь Тогда
			Объект.РедактированиеНомеровПервичныхДокументов = Ложь;
		КонецЕсли;
		
		Объект.РазрешитьРедактированиеИсходящихАктированныхСчетов	= Ложь;
		Объект.РазрешитьРедактированиеИсходящихОплаченныхСчетов 	= Ложь;
		 
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничениеПоТипамГрузоперевозокНеИспользуетсяПриИзменении(Элемент)
	
	Если (НЕ Объект.ОграничениеПоТипамГрузоперевозок) Тогда
		
		Объект.ДоступныеТипыГрузоперевозок.Очистить();
		
	КонецЕсли; 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеТипыГрузоперевозокТипГрузоперевозкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	МассивНайденных = Объект.ДоступныеТипыГрузоперевозок.НайтиСтроки(Новый Структура("ТипГрузоперевозки", ВыбранноеЗначение));
	Если (МассивНайденных.Количество() <> 0) Тогда
		СтандартнаяОбработка=Ложь;
		_УФК.ВывестиПредупреждение("Данный тип перевозки уже добавлен.");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСроковОплатыПриИзменении(Элемент)
	
	// сбрасываем флаги если не установлен запрет
	Объект.РедактированиеСроковОплатыВходящихСчетов		= РедактированиеСроковОплаты;
	Объект.РедактированиеСроковОплатыИсходящихСчетов 	= РедактированиеСроковОплаты;
	ЭтаФорма.Модифицированность = Истина;
	
	УстановитьВидимостьПодчиненных_Номерасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСроковОплатыВходящихСчетовПриИзменении(Элемент)
	
	РедактированиеСроковОплаты = (Объект.РедактированиеСроковОплатыВходящихСчетов Или Объект.РедактированиеСроковОплатыИсходящихСчетов);
	УстановитьВидимостьПодчиненных_НомераСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеCRMПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеОсновныхСвойствГрузоперевозокПриИзменении(Элемент)
	
	РедактированиеОсновныхСвойствГрузоперевозокПриИзмененииНаСервере();

КонецПроцедуры
 
&НаСервере
Процедура  РедактированиеОсновныхСвойствГрузоперевозокПриИзмененииНаСервере(ТолькоЗаказ = Ложь)
	
	Объект.РедактированиеОсновныхСвойствГрузоперевозок_Заказ 				= Объект.РедактированиеОсновныхСвойствГрузоперевозок;
	
	Если Не ТолькоЗаказ Тогда
		Объект.РедактированиеОсновныхСвойствГрузоперевозок_Код 					= Объект.РедактированиеОсновныхСвойствГрузоперевозок;	
		Объект.РедактированиеОсновныхСвойствГрузоперевозок_ДатаСделкиФ 			= Объект.РедактированиеОсновныхСвойствГрузоперевозок;	
		Объект.РедактированиеОсновныхСвойствГрузоперевозок_ТипПеревозки 		= Объект.РедактированиеОсновныхСвойствГрузоперевозок;	
		Объект.РедактированиеОсновныхСвойствГрузоперевозок_Представление 		= Объект.РедактированиеОсновныхСвойствГрузоперевозок;	
		Объект.РедактированиеОсновныхСвойствГрузоперевозок_Типоразмер 			= Объект.РедактированиеОсновныхСвойствГрузоперевозок;	
		Объект.РедактированиеОсновныхСвойствГрузоперевозок_МенеджерПродаж 		= Объект.РедактированиеОсновныхСвойствГрузоперевозок;	
		Объект.РедактированиеОсновныхСвойствГрузоперевозок_ОперативныйМенеджер 	= Объект.РедактированиеОсновныхСвойствГрузоперевозок;	
		Объект.РедактированиеОсновныхСвойствГрузоперевозок_Клиент 				= Объект.РедактированиеОсновныхСвойствГрузоперевозок;	
		Объект.РедактированиеОсновныхСвойствГрузоперевозок_Маршрут 				= Объект.РедактированиеОсновныхСвойствГрузоперевозок;	
		Объект.РедактированиеОсновныхСвойствГрузоперевозок_Груз 				= Объект.РедактированиеОсновныхСвойствГрузоперевозок;	
		Объект.РедактированиеОсновныхСвойствГрузоперевозок_Заявка 				= Объект.РедактированиеОсновныхСвойствГрузоперевозок;	
	КонецЕсли;

	УстановитьДоступностьРедактируемыхРеквизитовШапки();
	
КонецПроцедуры


&НаСервере
Процедура УстановитьДоступностьРедактируемыхРеквизитовШапки()
	
	Элементы.ГруппаРеквизитыШапки.Видимость = Объект.РедактированиеОсновныхСвойствГрузоперевозок;
	Элементы.РедактированиеОсновныхСвойствГрузоперевозок_Заказ.Доступность = Не Объект.ДобавлениеГрузоперевозок;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеГрузоперевозокПриИзменении(Элемент)
	
	Если Объект.ДобавлениеГрузоперевозок Тогда
		Объект.РедактированиеОсновныхСвойствГрузоперевозок = истина;
		РедактированиеОсновныхСвойствГрузоперевозокПриИзмененииНаСервере(Истина);
	КонецЕсли;
	
	УстановитьДоступностьРедактируемыхРеквизитовШапки();
	
	
КонецПроцедуры


&наСервере
Процедура УстановитьВидимостьПодчиненных_Номера()
	
	Элементы.РедактированиеНомераДокументаРасходыПоГрузоперевозкам.Доступность	= Объект.РедактированиеФинансов;
	Элементы.РедактированиеНомераДокументаДоходыПоГрузоперевозкам.Доступность 	= Объект.РедактированиеФинансов;
	
КонецПроцедуры

&наСервере
Процедура УстановитьВидимостьПодчиненных_НомераСчетов()
	
	Элементы.РедактированиеСроковОплатыВходящихСчетов.Доступность	= РедактированиеСроковОплаты;
	Элементы.РедактированиеСроковОплатыИсходящихСчетов.Доступность 	= РедактированиеСроковОплаты;
	
КонецПроцедуры


// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ДеревоСтатейДДСИспользованиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоСтатейДДС.ТекущиеДанные;
	
	УстановитьДанныеСтрокиПриИзмененииФлага(ТекущиеДанные, "Использование");
	Если ТекущиеДанные.ЭтоГруппа Тогда
		УстановитьФлагиДляПодчиненных(ТекущиеДанные, "Использование");
		УстановитьФлагиДляРодителей(ТекущиеДанные, "Использование");
	Иначе
		УстановитьФлагиДляРодителей(ТекущиеДанные, "Использование");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиДДДСИспользованиеСнятьВсе(Команда)
	
	ЭлементыДерева = ДеревоСтатейДДС.ПолучитьЭлементы();
	ОбработатьФлажкиДереваСтатейДДС(ЭлементыДерева, "Использование", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиДДСРазвернутьВсе(Команда)
	
	ЭлементыДерерва = ДеревоСтатейДДС.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева из ЭлементыДерерва Цикл
		
		Если Не СтрокаДерева.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор();
		Элементы.ДеревоСтатейДДС.Развернуть(ИдентификаторСтроки, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиДДССвернутьВсе(Команда)
	
	ЭлементыДерерва = ДеревоСтатейДДС.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева из ЭлементыДерерва Цикл
		
		Если Не СтрокаДерева.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторСтроки = СтрокаДерева.ПолучитьИдентификатор();
		Элементы.ДеревоСтатейДДС.Свернуть(ИдентификаторСтроки);
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СтатьиДДДСИспользованиеУстановитьВсе(Команда)
	
	ЭлементыДерева = ДеревоСтатейДДС.ПолучитьЭлементы();
	ОбработатьФлажкиДереваСтатейДДС(ЭлементыДерева, "Использование", Истина);

	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиДДДСПросмотрСнятьВсе(Команда)
	
	ЭлементыДерева = ДеревоСтатейДДС.ПолучитьЭлементы();
	ОбработатьФлажкиДереваСтатейДДС(ЭлементыДерева, "Просмотр", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиДДДСПросмотрУстановитьВсе(Команда)
	
	ЭлементыДерева = ДеревоСтатейДДС.ПолучитьЭлементы();
	ОбработатьФлажкиДереваСтатейДДС(ЭлементыДерева, "Просмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлажкиДереваСтатейДДС(ЭлементыДерева, ИмяПоля, Флаг)
	
	Для Каждого СтрокаДерева из ЭлементыДерева Цикл
		СтрокаДерева[ИмяПоля] = Флаг;
		УстановитьДанныеСтрокиПриИзмененииФлага(СтрокаДерева, ИмяПоля);
		
		УстановитьФлагиДляПодчиненных(СтрокаДерева, ИмяПоля);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСтатейДДСПросмотрПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоСтатейДДС.ТекущиеДанные;
	
	УстановитьДанныеСтрокиПриИзмененииФлага(ТекущиеДанные, "Просмотр");
	Если ТекущиеДанные.ЭтоГруппа Тогда
		УстановитьФлагиДляПодчиненных(ТекущиеДанные, "Просмотр");
		УстановитьФлагиДляРодителей(ТекущиеДанные, "Просмотр");
	Иначе
		УстановитьФлагиДляРодителей(ТекущиеДанные, "Просмотр");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагиДляПодчиненных(ТекущиеДанные, ИмяПоля)
	
	СтрокиДерева = ТекущиеДанные.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева из  СтрокиДерева Цикл
		
		СтрокаДерева[ИмяПоля] = ТекущиеДанные[ИмяПоля];
		УстановитьДанныеСтрокиПриИзмененииФлага(СтрокаДерева, ИмяПоля);
		Если СтрокаДерева.ЭтоГруппа Тогда
			УстановитьФлагиДляПодчиненных(СтрокаДерева, ИмяПоля);
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагиДляРодителей(ТекущиеДанные, ИмяПоля)
	
	СтрокаРодитель 	 = ТекущиеДанные.ПолучитьРодителя();
	
	Если СтрокаРодитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыРодителя = СтрокаРодитель.ПолучитьЭлементы();
	
	мЗначенияПометок = Новый Массив;
	Для Каждого СтрокаДерева из ЭлементыРодителя ЦИкл
		Пометка = СтрокаДерева[ИмяПоля];
		Если мЗначенияПометок.Найти(Пометка) = Неопределено Тогда
			мЗначенияПометок.Добавить(Пометка);
		КонецЕсли;
	КонецЦикла;
	
	Если мЗначенияПометок.Количество() = 1 Тогда
		СтрокаРодитель[ИмяПоля] = мЗначенияПометок[0];
	Иначе
		СтрокаРодитель[ИмяПоля] = 2;
	КонецЕсли;
	
	//Переходим на верхний уровень
	Если СтрокаРодитель.ПолучитьРодителя() <> Неопределено Тогда
		УстановитьФлагиДляРодителей(СтрокаРодитель, ИмяПоля);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДанныеСтрокиПриИзмененииФлага(СрокаДерева, ИмяПоля)
	
	Если ИмяПоля = "Использование" Тогда
		Если СрокаДерева.Использование > 1 Тогда
			СрокаДерева.Использование = 0;
		КонецЕсли;
		Если СрокаДерева.Использование = 1 Тогда
			СрокаДерева.Просмотр = 1;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля = "Просмотр" Тогда
		Если СрокаДерева.Просмотр > 1 Тогда
			СрокаДерева.Просмотр = 0;
		КонецЕсли;
		Если СрокаДерева.Просмотр = 0 Тогда
			СрокаДерева.Использование = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоНастроекСтатейДДС(ГруппаПользователя)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_СтатьиДДС.Ссылка КАК СтатьяДДС,
	|	ВЫБОР
	|		КОГДА CW_ПраваДоступаДляСтатейДДС.СтатьяДДС ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Просмотр,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(CW_ПраваДоступаДляСтатейДДС.Использование, ЛОЖЬ)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Использование,
	|	ВЫБОР
	|		КОГДА CW_СтатьиДДС.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженияДДС.Приход)
	|			ТОГДА 1
	|		КОГДА CW_СтатьиДДС.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженияДДС.Расход)
	|			ТОГДА 2
	|	КОНЕЦ КАК ИндексКартинки,
	|	CW_СтатьиДДС.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Справочник.CW_СтатьиДДС КАК CW_СтатьиДДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПраваДоступаДляСтатейДДС КАК CW_ПраваДоступаДляСтатейДДС
	|		ПО (CW_ПраваДоступаДляСтатейДДС.СтатьяДДС = CW_СтатьиДДС.Ссылка)
	|			И (CW_ПраваДоступаДляСтатейДДС.ГруппаПользователя = &ГруппаПользователя)
	|ГДЕ
	|	НЕ CW_СтатьиДДС.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа УБЫВ,
	|	СтатьяДДС
	|ИТОГИ ПО
	|	СтатьяДДС ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.Параметры.Вставить("ГруппаПользователя",ГруппаПользователя);
	РезультатЗапроса = Запрос.Выполнить();
	
	ДеревоСтатей = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ОбработатьДеревоСтатей(ДеревоСтатей.Строки);
	
	ЗаполнитьФлагиГруппДерева(ДеревоСтатей.Строки);
	
	ЗначениеВРеквизитФормы(ДеревоСтатей, "ДеревоСтатейДДС");
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьФлагГруппыНаСервере(ГруппаДерева, ИмяПоля)
	
	СтрокиГруппы = ГруппаДерева.Строки;
	
	мЗначенияПометок = Новый Массив;
	Для Каждого СтрокаДерева из СтрокиГруппы ЦИкл
		
		Если СтрокаДерева.ЭтоГруппа Тогда
			ПолучитьФлагГруппыНаСервере(СтрокаДерева, "Просмотр");
			ПолучитьФлагГруппыНаСервере(СтрокаДерева, "Использование");
		КонецЕсли;
		
		Пометка = СтрокаДерева[ИмяПоля];
		Если мЗначенияПометок.Найти(Пометка) = Неопределено Тогда
			мЗначенияПометок.Добавить(Пометка);
		КонецЕсли;
	КонецЦикла;
	
	Если мЗначенияПометок.Количество() = 1 Тогда
		ГруппаДерева[ИмяПоля] = мЗначенияПометок[0];
	Иначе
		ГруппаДерева[ИмяПоля] = 2;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФлагиГруппДерева(СтрокиДерева)
	
	Для Каждого СтрокаДерева из СтрокиДерева Цикл
		Если СтрокаДерева.ЭтоГруппа Тогда
			ПолучитьФлагГруппыНаСервере(СтрокаДерева, "Просмотр");
			ПолучитьФлагГруппыНаСервере(СтрокаДерева, "Использование");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьДеревоСтатей(СтрокиДерева)
	
	Для Каждого СтрокаДерева из СтрокиДерева Цикл
		Если СтрокаДерева.ЭтоГруппа Тогда
			ОбработатьДеревоСтатей(СтрокаДерева.Строки);
		Иначе
			СтрокаВИерархии = СтрокаДерева.Строки[0];
			ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаВИерархии,"Просмотр,Использование");
			
			СтрокаДерева.Строки.Удалить(СтрокаВИерархии);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДоступныеСтатьиДДСВРегистр()
		
	Набор = РегистрыСведений.CW_ПраваДоступаДляСтатейДДС.СоздатьНаборЗаписей();
	Набор.Отбор.ГруппаПользователя.Установить(Объект.Ссылка);
	Набор.Очистить();
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользуетсяБлокПланированиеДДС") Тогда
		
		ЭлементыДерева = ДеревоСтатейДДС.ПолучитьЭлементы();
		ДобавитьДанныеВНаборПравДДС(ЭлементыДерева, Набор);
		
	КонецЕсли;
	
	Набор.Отбор.ГруппаПользователя.Установить(Объект.Ссылка);
	Набор.Записать(Истина);

КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеВНаборПравДДС(ЭлементыДерева, Набор)
	
	Для Каждого СтрокаДерева из ЭлементыДерева Цикл
		Если СтрокаДерева.Просмотр = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаДерева.ЭтоГруппа Тогда
			ДобавитьДанныеВНаборПравДДС(СтрокаДерева.ПолучитьЭлементы(), Набор);
			Продолжить;
		КонецЕсли;
		
		СтрокаНабора = Набор.Добавить();
		СтрокаНабора.ГруппаПользователя = Объект.Ссылка;
		СтрокаНабора.СтатьяДДС 			= СтрокаДерева.СтатьяДДС;
		СтрокаНабора.Использование 		= СтрокаДерева.Использование;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.CW_ПланированиеДДС"));
	ОбновитьИнтерфейсПрограммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РольФинансовогоКонтролераПриИзменении(Элемент)
	
	ОбновитьИнтерфейс = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РольКазначеяПриИзменении(Элемент)
	
	ОбновитьИнтерфейс = истина;

КонецПроцедуры


&НаКлиенте
Процедура ДоступенБлокПланированияДДСПриИзменении(Элемент)
	
	ОбновитьИнтерфейс = истина;

	Элементы.СтраницаПланированиеДДС.Видимость 	= Объект.ДоступенБлокПланированияДДС;
	
	Если Объект.ДоступенБлокПланированияДДС = ЛОЖЬ Тогда
		Объект.ВводПлановыхПоступленийБДДС 	= Ложь;
		Объект.ВводЗаявокНаРасходБДДС  		= Ложь;
		Объект.РольФинансовогоКонтролера 	= Ложь;
		Объект.РольКазначея 				= Ложь;
		
		ЭлементыДерева = ДеревоСтатейДДС.ПолучитьЭлементы();
		ОбработатьФлажкиДереваСтатейДДС(ЭлементыДерева, "Просмотр", Ложь);
		
	//Иначе
	//	ЗаполнитьДеревоНастроекСтатейДДС();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЛичныйКабинетУправлениеПрофилямиПриИзменении(Элемент)
	ОбновитьИнтерфейс = истина;
КонецПроцедуры


//Статусы документов
&НаСервере
Процедура ЗаполнитьДеревоСтатусов(ГруппаПользователя)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатусыДокументов.Владелец КАК Владелец,
	               |	CW_СтатусыДокументов.Ссылка КАК Статус,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.СтатусДокумента ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Доступен
	               |ИЗ
	               |	Справочник.CW_СтатусыДокументов КАК CW_СтатусыДокументов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			CW_ДоступностьСтатусовПоГруппамПользователей.СтатусДокумента КАК СтатусДокумента
	               |		ИЗ
	               |			РегистрСведений.CW_ДоступностьСтатусовПоГруппамПользователей КАК CW_ДоступностьСтатусовПоГруппамПользователей
	               |		ГДЕ
	               |			CW_ДоступностьСтатусовПоГруппамПользователей.ГруппаПользователя = &ГруппаПользователя) КАК ВложенныйЗапрос
	               |		ПО CW_СтатусыДокументов.Ссылка = ВложенныйЗапрос.СтатусДокумента
	               |//ГДЕ
	               |//	НЕ CW_СтатусыДокументов.НазначатьДляНовыхОбъектов 
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Владелец
	               |ИТОГИ ПО
	               |	Владелец
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ГруппаПользователя", ГруппаПользователя);
	
	ВыборкаВладелец = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЭлементыДерева = ДоступныеСтатусыДокументов.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	
	Пока ВыборкаВладелец.Следующий() Цикл
		
		СтрокаДереваГруппа = ЭлементыДерева.Добавить();
		СтрокаДереваГруппа.Статус  		= Неопределено;
		СтрокаДереваГруппа.Наименование = ВыборкаВладелец.Владелец;
		СтрокаДереваГруппа.ЭтоГруппа  	= Истина;
		
		ВыборкаДетали = ВыборкаВладелец.Выбрать();
		
		ЭлементыГруппы = СтрокаДереваГруппа.ПолучитьЭлементы();
		
		ВсегоПометокВГруппе = 0;
		Пока ВыборкаДетали.Следующий() Цикл
			
			СтрокаДерева 				= ЭлементыГруппы.Добавить();
			СтрокаДерева.Статус  		= ВыборкаДетали.Статус;
			СтрокаДерева.Доступен  		= ВыборкаДетали.Доступен;
			СтрокаДерева.Наименование 	= ВыборкаДетали.Статус;
			СтрокаДерева.ЭтоГруппа  	= Ложь;
			СтрокаДерева.ИндексКартинки = 1;
			
			ВсегоПометокВГруппе = ВсегоПометокВГруппе + ВыборкаДетали.Доступен;
		КонецЦикла;	
		
		Если ВсегоПометокВГруппе = 0 Тогда
			СтрокаДереваГруппа.Доступен = 0;
		ИначеЕсли ВсегоПометокВГруппе = ЭлементыГруппы.Количество() Тогда
			СтрокаДереваГруппа.Доступен = 1;
		Иначе
			СтрокаДереваГруппа.Доступен = 2;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеСтатусыДокументовДоступенПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоступныеСтатусыДокументов.ТекущиеДанные;
	
	Если ТекущиеДанные.Доступен > 1 Тогда
		ТекущиеДанные.Доступен = 0;
	КонецЕсли;
	
	УстановитьСопутствующиеФлаги(Элементы.ДоступныеСтатусыДокументов.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСопутствующиеФлаги(ИдентификаторСтроки)
	
	СтрокаТекущая = ДоступныеСтатусыДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если СтрокаТекущая.ЭтоГруппа Тогда
		ЭлементыСтроки = СтрокаТекущая.ПолучитьЭлементы();
		Для Каждого СтрокаДерева из ЭлементыСтроки ЦИкл
			СтрокаДерева.Доступен = СтрокаТекущая.Доступен;
		КонецЦикла;
	Иначе
		СтрокаРодитель 		= СтрокаТекущая.ПолучитьРодителя();
		ЭлементыРодителя 	= СтрокаРодитель.ПолучитьЭлементы();
		ВсегоПометокВГруппе = 0;
		Для Каждого СтрокаДерева из ЭлементыРодителя ЦИкл
			ВсегоПометокВГруппе = ВсегоПометокВГруппе + СтрокаДерева.Доступен;
		КонецЦикла;
		
		Если ВсегоПометокВГруппе = 0 Тогда
			СтрокаРодитель.Доступен = 0;
		ИначеЕсли ВсегоПометокВГруппе = ЭлементыРодителя.Количество() Тогда
			СтрокаРодитель.Доступен = 1;
		Иначе
			СтрокаРодитель.Доступен = 2;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДоступныеСтатусыВРегистр()
	
	Набор = РегистрыСведений.CW_ДоступностьСтатусовПоГруппамПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.ГруппаПользователя.Установить(Объект.Ссылка);
	Набор.Очистить();
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов") Тогда
		
		ЭлементыДерева = ДоступныеСтатусыДокументов.ПолучитьЭлементы();
		
		Для Каждого СтрокаДерева из ЭлементыДерева Цикл
			ДобавитьДанныеВНабор(СтрокаДерева, Набор);
		КонецЦикла;
		
	КонецЕсли;
	
	Набор.Отбор.ГруппаПользователя.Установить(Объект.Ссылка);
	Набор.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДанныеВНабор(СтрокаГруппа, Набор)
	
	ЭлементыГруппы = СтрокаГруппа.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева из ЭлементыГруппы Цикл
		Если СтрокаДерева.Доступен = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНабора = Набор.Добавить();
		СтрокаНабора.ГруппаПользователя = 	Объект.Ссылка;
		СтрокаНабора.СтатусДокумента =		СтрокаДерева.Статус;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыИсходящихДокументовСнятьФлажки(Команда)

	ЭлементыДерева = ДоступныеСтатусыДокументов.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева из ЭлементыДерева Цикл
		СтрокаДерева.Доступен = 0;
		Идентификатор = СтрокаДерева.ПолучитьИдентификатор();
		УстановитьСопутствующиеФлаги(Идентификатор);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыИсходящихДокументовУстановитьФлажки(Команда)
	
	ЭлементыДерева = ДоступныеСтатусыДокументов.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева из ЭлементыДерева Цикл
		СтрокаДерева.Доступен = 1;
		Идентификатор = СтрокаДерева.ПолучитьИдентификатор();
		УстановитьСопутствующиеФлаги(Идентификатор);
	КонецЦикла;
	
КонецПроцедуры
//Статусы документов

//Права параметров
&НаСервере
Процедура ЗаполнитьДеревоПравПараметров(ГруппаПользователя)   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПараметрыГрузоперевозок.Ссылка КАК Параметр,
	|	0 КАК ИндексКартинки,
	|	CW_ПараметрыГрузоперевозок.ЭтоГруппа КАК ЭтоГруппа,
	|	ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Просмотр, ЛОЖЬ) КАК ПравоПросмотр,
	|	ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Редактирование, ЛОЖЬ) КАК ПравоРедактирование
	|ИЗ
	|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
	|		ПО CW_ПараметрыГрузоперевозок.Ссылка = CW_ПраваДоступаДляПараметровМониторинга.Параметр
	|			И (CW_ПраваДоступаДляПараметровМониторинга.Группа = &ГруппаПользователя)
	|ГДЕ
	|	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа УБЫВ,
	|	Параметр
	|ИТОГИ ПО
	|	Параметр ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";    
	
	Запрос.УстановитьПараметр("ГруппаПользователя", ГруппаПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДеревоПрав = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ОбработатьДеревоПравПараметров(ДеревоПрав.Строки);
	
	ЗначениеВРеквизитФормы(ДеревоПрав, "ДеревоПравПараметров");

КонецПроцедуры    

&НаСервере
Процедура ОбработатьДеревоПравПараметров(СтрокиДерева)
	
	Для Каждого СтрокаДерева из СтрокиДерева Цикл 
		СтрокаДерева.ИндексКартинки = CW_МониторинговыеПараметрыСервер.ПолучитьИндексПиктограммыПараметраОбъекта(СтрокаДерева.Параметр);
		Если СтрокаДерева.ЭтоГруппа  Тогда
			ОбработатьДеревоПравПараметров(СтрокаДерева.Строки);
		Иначе
			Если СтрокаДерева.Строки.Количество() > 0 Тогда 
				СтрокаВИерархии = СтрокаДерева.Строки[0];
				ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаВИерархии,"ПравоПросмотр,ПравоРедактирование");
				СтрокаДерева.Строки.Очистить();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеПравНаПараметры()
	
	Набор = РегистрыСведений.CW_ПраваДоступаДляПараметровМониторинга.СоздатьНаборЗаписей();
	Набор.Отбор.Группа.Установить(Объект.Ссылка);
	Набор.Прочитать();
	Набор.Очистить();
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоПравПараметров"); 
	
	СтруктураПараметровОтбора = Новый Структура;
	СтруктураПараметровОтбора.Вставить("ЭтоГруппа", Ложь);
	
	СтрокиПараметров = ДеревоЗначений.Строки.НайтиСтроки(СтруктураПараметровОтбора, Истина);  
	Для Каждого СтрокаПараметра из СтрокиПараметров Цикл
		Если НЕ СтрокаПараметра.ПравоПросмотр
			И НЕ СтрокаПараметра.ПравоРедактирование Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьНабора = Набор.Добавить();
		ЗаписьНабора.Группа = Объект.Ссылка;
		ЗаписьНабора.Параметр = СтрокаПараметра.Параметр;
		ЗаписьНабора.Просмотр = СтрокаПараметра.ПравоПросмотр;
		ЗаписьНабора.Редактирование = СтрокаПараметра.ПравоРедактирование;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры
//---Права параметров

//Редактирование справочников
&НаСервере
Процедура ЗаполнитьДеревоНастроекРедактированияСправочников(ГруппаПользователя)
	
	СоответствиеВладельцев = РегистрыСведений.CW_ОбъектыОграниченийДоступа.ПолучитьДосупныеОбъектыРедактирования();
	
	мИдентифкаторы = Новый Массив;
	Для каждого ЭлементСоответствия из СоответствиеВладельцев Цикл
		мИдентифкаторы.Добавить(ЭлементСоответствия.Ключ);
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыОграниченийДоступа.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъекта,
	               |	CW_ОбъектыОграниченийДоступа.ВладелецОбъекта КАК ВладелецОбъекта
	               |ИЗ
	               |	РегистрСведений.CW_ОбъектыОграниченийДоступа КАК CW_ОбъектыОграниченийДоступа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВладелецОбъекта = СоответствиеВладельцев.Получить(Выборка.ИдентификаторОбъекта);
		Если ВладелецОбъекта = Неопределено Тогда
			СоответствиеВладельцев.Вставить(Выборка.ИдентификаторОбъекта, Выборка.ВладелецОбъекта);
		КонецЕсли;
	КонецЦикла;
	
	ЭлементыДерева = ДеревоРедактированияСправочников.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	
	МассивВладельцев = Новый Массив;
	МассивВладельцев.Добавить(ПредопределенноеЗначение("Перечисление.CW_ВладелецОбъектаДоступа.ЗначениеБухгалтерияПредприятия"));
	МассивВладельцев.Добавить(ПредопределенноеЗначение("Перечисление.CW_ВладелецОбъектаДоступа.ЗначениеКоралВэй"));
	
	//Создаем группы дерева
	СоответстивеГруппДерева = Новый Соответствие;
	Для каждого ЭлементМассива из МассивВладельцев Цикл
		СтрокаДереваГруппа = ЭлементыДерева.Добавить();
		СтрокаДереваГруппа.Наименование 		= СокрЛП(ЭлементМассива);
		СтрокаДереваГруппа.ИдентификаторОбъекта	= ЭлементМассива;
		СтрокаДереваГруппа.ИндексКартинки 		= 2;
		СтрокаДереваГруппа.ЭтоГруппа  			= Истина;
		
		СоответстивеГруппДерева.Вставить(ЭлементМассива, СтрокаДереваГруппа); 
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИдентификаторыОбъектовМетаданных.Ссылка КАК ИдентификаторОбъекта,
	               |	ИдентификаторыОбъектовМетаданных.Синоним КАК Синоним,
	               |	ИдентификаторыОбъектовМетаданных.ПолноеИмя КАК ПолноеИмя,
	               |	ИСТИНА КАК Предопределенный
	               |ПОМЕСТИТЬ ВТ_Предопределенные
	               |ИЗ
	               |	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	               |ГДЕ
	               |	ИдентификаторыОбъектовМетаданных.Ссылка В(&мИдентифкаторы)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ОбъектыОграниченийДоступа.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъекта,
	               |	CW_ОбъектыОграниченийДоступа.ИдентификаторОбъектаМетаданных.Синоним КАК Синоним,
	               |	CW_ОбъектыОграниченийДоступа.ИдентификаторОбъектаМетаданных.ПолноеИмя КАК ПолноеИмя,
	               |	ЛОЖЬ КАК Предопределенный
	               |ПОМЕСТИТЬ ВТ_Пользовательские
	               |ИЗ
	               |	РегистрСведений.CW_ОбъектыОграниченийДоступа КАК CW_ОбъектыОграниченийДоступа
	               |ГДЕ
	               |	НЕ CW_ОбъектыОграниченийДоступа.ИдентификаторОбъектаМетаданных В
	               |				(ВЫБРАТЬ
	               |					ВТ_Предопределенные.ИдентификаторОбъекта КАК ИдентификаторОбъекта
	               |				ИЗ
	               |					ВТ_Предопределенные КАК ВТ_Предопределенные)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Предопределенные.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
	               |	ВТ_Предопределенные.Синоним КАК Синоним,
	               |	ВТ_Предопределенные.ПолноеИмя КАК ПолноеИмя,
	               |	ВТ_Предопределенные.Предопределенный КАК Предопределенный
	               |ПОМЕСТИТЬ ВТ_Идентифкаторы
	               |ИЗ
	               |	ВТ_Предопределенные КАК ВТ_Предопределенные
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Пользовательские.ИдентификаторОбъекта,
	               |	ВТ_Пользовательские.Синоним,
	               |	ВТ_Пользовательские.ПолноеИмя,
	               |	ВТ_Пользовательские.Предопределенный
	               |ИЗ
	               |	ВТ_Пользовательские КАК ВТ_Пользовательские
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Идентифкаторы.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
	               |	ВТ_Идентифкаторы.Синоним КАК Синоним,
	               |	ВТ_Идентифкаторы.ПолноеИмя КАК ПолноеИмя,
	               |	ВТ_Идентифкаторы.Предопределенный КАК Предопределенный,
	               |	ВЫБОР
	               |		КОГДА CW_ДоступныеСправочникиПоГруппамПользователей.ИдентификаторОбъектаМетаданных ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Флаг
	               |ИЗ
	               |	ВТ_Идентифкаторы КАК ВТ_Идентифкаторы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ДоступныеСправочникиПоГруппамПользователей КАК CW_ДоступныеСправочникиПоГруппамПользователей
	               |		ПО ВТ_Идентифкаторы.ИдентификаторОбъекта = CW_ДоступныеСправочникиПоГруппамПользователей.ИдентификаторОбъектаМетаданных
	               |			И (CW_ДоступныеСправочникиПоГруппамПользователей.ГруппаПользователя = &ГруппаПользователя)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Предопределенный УБЫВ,
	               |	Синоним
	               |АВТОУПОРЯДОЧИВАНИЕ";
	 	
	Запрос.УстановитьПараметр("ГруппаПользователя",	ГруппаПользователя);
	Запрос.УстановитьПараметр("мИдентифкаторы",		мИдентифкаторы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(Выборка.ПолноеИмя) Тогда
			Продолжить;
		КонецЕсли;
		
		ВладелецОбъекта 	= СоответствиеВладельцев.Получить(Выборка.ИдентификаторОбъекта);
	
		СтрокаДереваГруппа 	= СоответстивеГруппДерева.Получить(ВладелецОбъекта);
		ЭлементыГруппы 		= СтрокаДереваГруппа.ПолучитьЭлементы();
		
		СтрокаДерева = ЭлементыГруппы.Добавить();
		СтрокаДерева.Наименование  			= Выборка.Синоним;
		СтрокаДерева.ИдентификаторОбъекта	= Выборка.ИдентификаторОбъекта;
		СтрокаДерева.Флаг 					= Выборка.Флаг;
		СтрокаДерева.ИндексКартинки 		= ?(Выборка.Предопределенный, 5, 3);
		СтрокаДерева.ЭтоГруппа  			= Ложь;
		
	КонецЦикла;
	
	//Флажки групп
	ЭлементыДерева =  ДеревоРедактированияСправочников.ПолучитьЭлементы();
	Для Каждого СтрокаГруппа Из  ЭлементыДерева  Цикл
		
		СтрокиДерева =  СтрокаГруппа.ПолучитьЭлементы();
		ПометкиСтрок 	= 0;
		Для Каждого СтрокаДерева Из  СтрокиДерева  Цикл
			ПометкиСтрок = ПометкиСтрок + СтрокаДерева.Флаг;
		КонецЦикла;
		
		Если ПометкиСтрок = 0 Тогда
			СтрокаГруппа.Флаг = 0;
		ИначеЕсли ПометкиСтрок = СтрокиДерева.Количество() Тогда
			СтрокаГруппа.Флаг = 1;
		Иначе
			СтрокаГруппа.Флаг = 2;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРедактированияСправочниковФлагПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРедактированияСправочников.ТекущиеДанные;
	
	Если ТекущиеДанные.Флаг > 1 Тогда
		ТекущиеДанные.Флаг = 0;
	КонецЕсли;
	
	УстановитьСопутствующиеФлагиДеревоРедактированияСправочников(Элементы.ДеревоРедактированияСправочников.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСопутствующиеФлагиДеревоРедактированияСправочников(ИдентификаторСтроки)
	
	СтрокаТекущая = ДеревоРедактированияСправочников.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если СтрокаТекущая.ЭтоГруппа Тогда
		ЭлементыСтроки = СтрокаТекущая.ПолучитьЭлементы();
		Для Каждого СтрокаДерева из ЭлементыСтроки ЦИкл
			СтрокаДерева.Флаг = СтрокаТекущая.Флаг;
		КонецЦикла;
	Иначе
		СтрокаРодитель 		= СтрокаТекущая.ПолучитьРодителя();
		ЭлементыРодителя 	= СтрокаРодитель.ПолучитьЭлементы();
		
		ВсегоПометокВГруппе = 0;
		Для Каждого СтрокаДерева из ЭлементыРодителя ЦИкл
			ВсегоПометокВГруппе = ВсегоПометокВГруппе + СтрокаДерева.Флаг;
		КонецЦикла;
		
		Если ВсегоПометокВГруппе = 0 Тогда
			СтрокаРодитель.Флаг = 0;
		ИначеЕсли ВсегоПометокВГруппе = ЭлементыРодителя.Количество() Тогда
			СтрокаРодитель.Флаг = 1;
		Иначе
			СтрокаРодитель.Флаг = 2;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСправочниковСнятьФлажки(Команда)
	
	ОбработатьФлажкиДереваСправочников(0);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСправочниковУстановитьФлажки(Команда)
	
	ОбработатьФлажкиДереваСправочников(1);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлажкиДереваСправочников(Флаг)
	
	ЭлементыДерева = ДеревоРедактированияСправочников.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева из ЭлементыДерева Цикл
		СтрокаДерева.Флаг = Флаг;
		Идентификатор = СтрокаДерева.ПолучитьИдентификатор();
		УстановитьСопутствующиеФлагиДеревоРедактированияСправочников(Идентификатор);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСправочниковУстановитьФлажкиДляВыделенныхСтрок(Команда)
	
	ОбрабоатьФлажкиВыделенныхСтрок(1);

КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСправочниковСнятьФлажкиДляВыделенныхСтрок(Команда)
	
	ОбрабоатьФлажкиВыделенныхСтрок(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбрабоатьФлажкиВыделенныхСтрок(Флаг)
	
	
	ВыделенныеСтроки = Элементы.ДеревоРедактированияСправочников.ВыделенныеСтроки;
	
	Для Каждого Идентификатор из ВыделенныеСтроки Цикл
		СтрокаДерева = ДеревоРедактированияСправочников.НайтиПоИдентификатору(Идентификатор);
		СтрокаДерева.Флаг = Флаг;
		УстановитьСопутствующиеФлагиДеревоРедактированияСправочников(Идентификатор);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьРазрешенныеСправочникиВРегистр()
	
	НаборОбъектыОграничений = РегистрыСведений.CW_ОбъектыОграниченийДоступа.СоздатьНаборЗаписей();
	
	НаборДоступныеСправочники = РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.СоздатьНаборЗаписей();
	НаборДоступныеСправочники.Отбор.ГруппаПользователя.Установить(Объект.Ссылка);
	
	ЭлементыДерева = ДеревоРедактированияСправочников.ПолучитьЭлементы();
	Для Каждого СтрокаДереваГруппа из ЭлементыДерева Цикл
		
		ЭлементыГруппы = СтрокаДереваГруппа.ПолучитьЭлементы();
		Для Каждого СтрокаДерева из ЭлементыГруппы Цикл
			
			Если СтрокаДерева.Флаг = 1 Тогда
				СтрокаНабора = НаборДоступныеСправочники.Добавить();
				СтрокаНабора.ГруппаПользователя 			= Объект.Ссылка;
				СтрокаНабора.ИдентификаторОбъектаМетаданных = СтрокаДерева.ИдентификаторОбъекта;
			КонецЕсли;
			
			СтрокаНабора = НаборОбъектыОграничений.Добавить();
			СтрокаНабора.ВладелецОбъекта 				= СтрокаДереваГруппа.ИдентификаторОбъекта;
			СтрокаНабора.ИдентификаторОбъектаМетаданных = СтрокаДерева.ИдентификаторОбъекта;
			
		КонецЦикла;
		
	КонецЦикла;
	
	НаборОбъектыОграничений.Записать(Истина);
	НаборДоступныеСправочники.Записать(Истина);

КонецПроцедуры
//Редактирование справочников

&НаСервере
Процедура ЗаписатьПраваРедактированияШаблонов()
	
	НаборЗаписей = РегистрыСведений.CW_ШаблоныДокументовПраваДоступа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ГруппаПользователя.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.Очистить();
	
	Для Каждого СтрокаТаблицы из ПраваРедактирвоанияШаблонов Цикл
		 НоваяСтрока = НаборЗаписей.Добавить();
		 НоваяСтрока.ГруппаПользователя = Объект.Ссылка;
		 
		 НоваяСтрока.ИдентификаторОбъектаМетаданных 	= СтрокаТаблицы.ИдентификаторОбъектаМетаданных;
		 НоваяСтрока.РедактированиеШаблонаДокумента 	= СтрокаТаблицы.РедактированиеШаблонаДокумента;
		 НоваяСтрока.РедактированиеОбщегоШаблона 		= СтрокаТаблицы.РедактированиеОбщегоШаблона;
		 НоваяСтрока.РедактированиеМакросовШаблона		= СтрокаТаблицы.РедактированиеМакросовШаблона;
		 
	 КонецЦикла;      
	 
	 НаборЗаписей.Записать(Истина);
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСписокИнициацииСогласования(ГруппаПользователя)  
	
	ГруппаПользователей = ?(ГруппаПользователя.Пустая(), Неопределено, ГруппаПользователя);
	
	мИдентифкаторыОбъектов = Новый Массив;
	мТипы = Метаданные.ОпределяемыеТипы.CW_ОбъектыСогласования.Тип.Типы();
	Для Каждого ТипОбъекта из мТипы Цикл
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
		мИдентифкаторыОбъектов.Добавить(ИдентификаторОбъекта);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИдентификаторыОбъектовМетаданных.Ссылка КАК ОбъектМетаданных,
	               |	ЕСТЬNULL(CW_ДоступноИнициацияСогласования.Доступно, ЛОЖЬ) КАК Доступно
	               |ИЗ
	               |	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ДоступноИнициацияСогласования КАК CW_ДоступноИнициацияСогласования
	               |		ПО ИдентификаторыОбъектовМетаданных.Ссылка = CW_ДоступноИнициацияСогласования.ИдентификаторОбъектаМетаданных
	               |			И (CW_ДоступноИнициацияСогласования.ГруппаПользователей = &ГруппаПользователей)
	               |ГДЕ
	               |	ИдентификаторыОбъектовМетаданных.Ссылка В(&мИдентифкаторыОбъектов)";
	
	Запрос.УстановитьПараметр("мИдентифкаторыОбъектов", мИдентифкаторыОбъектов);
	Запрос.УстановитьПараметр("ГруппаПользователей", 	ГруппаПользователей);
	
	РезультатЗапроса = Запрос.Выполнить();
	ИнициацияСогласования.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИнициациюСогласования()
	
	мОбъекты = Новый Массив; 
	
	Если Объект.ПолныеПрава Тогда
		мСтроки = ИнициацияСогласования.Выгрузить();
	Иначе
		мСтроки = ИнициацияСогласования.НайтиСтроки(Новый Структура("Доступно", Истина));
	КонецЕсли;
	
	Для Каждого СтрокаМассива из мСтроки Цикл
		мОбъекты.Добавить(СтрокаМассива.ОбъектМетаданных);
	КонецЦикла;
	
	РегистрыСведений.CW_ДоступноИнициацияСогласования.ЗаписатьИнициациюСогласования(Объект.Ссылка, мОбъекты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрБюджетовПриИзменении(Элемент)
	
	Если НЕ Объект.ПросмотрБюджетов Тогда
		Объект.РедактированиеНастроекБюджетов = Ложь;
		Объект.РедактированиеБюджетов = Ложь;
		Объект.ИзменениеКурсаПланирования = Ложь;
		Объект.БюджетированиеРедактированиеСтавкиНДС = Ложь;
	КонецЕсли;
	
	УстановитьДоступностьЭлементовБюджета();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовБюджета()
	
	Элементы.РедактированиеНастроекБюджетов.Доступность = Объект.ПросмотрБюджетов;
	Элементы.РедактированиеБюджетов.Доступность = Объект.ПросмотрБюджетов;
	Элементы.ИзменениеКурсаПланирования.Доступность = Объект.ПросмотрБюджетов;
	Элементы.БюджетированиеРедактированиеСтавкиНДС.Доступность = Объект.ПросмотрБюджетов;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КопированиеНастроек" 
		и Параметр = Объект.Ссылка Тогда 
		ЭтаФорма.Прочитать();
	КонецЕсли;     
	
	Если ИмяСобытия = "Запись_CW_ОбъектыОграниченийДоступа" Тогда
		ЗаполнитьДеревоНастроекРедактированияСправочников(Объект.Ссылка);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьОрганизацийВсеПриИзменении(Элемент)
	ДоступностьОрганизацийВсеПриИзмененииНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ДоступностьОрганизацийВсеПриИзмененииНаСервере()
	               
	Если Не Объект.ИспользуютсяОграниченияПоОрганизациям Тогда
		ДоступныеОрганизации.Очистить();
	КонецЕсли; 
	
	Элементы.ДоступныеОрганизации.Доступность = Объект.ИспользуютсяОграниченияПоОрганизациям;

КонецПроцедуры

&НаСервере
Процедура ПравоРедактированияСтатусовДокументовПриИзмененииНаСервере()
	_УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПравоРедактированияСтатусовДокументовПриИзменении(Элемент)
	ПравоРедактированияСтатусовДокументовПриИзмененииНаСервере();
КонецПроцедуры





