#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	// ---
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	
	// --- 
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// ---
	НастройкиСКД.Выбор.Элементы.Очистить();
	НастройкиСКД.Структура.Очистить();

	
	//Параметры вывода
	СтркутураПараметров = Новый Структура;
	СтркутураПараметров.Вставить("Заголовок"					, ВРег(МетаданныеОтчета.Синоним));
	СтркутураПараметров.Вставить("РасположениеРеквизитов"		, ?(Настройки.ОбъединитьГруппировки,РасположениеРеквизитовКомпоновкиДанных.Отдельно			, РасположениеРеквизитовКомпоновкиДанных.ВСпециальнойПозиции));
	СтркутураПараметров.Вставить("РасположениеГруппировки"		, ?(Настройки.ОбъединитьГруппировки,РасположениеГруппировкиКомпоновкиДанных.Конец			, Неопределено));
	СтркутураПараметров.Вставить("РасположениеПолейГруппировки"	, ?(Настройки.ОбъединитьГруппировки,РасположениеПолейГруппировкиКомпоновкиДанных.Отдельно	, Неопределено));
	СтркутураПараметров.Вставить("ТипЗаголовкаПолей"			, ?(Настройки.ОбъединитьГруппировки,ТипЗаголовкаПолейКомпоновкиДанных.Краткий				, Неопределено));
	
	CW_Отчеты.УстановитьПараметрыВыводаКомпоновкиДанных(НастройкиСКД, СтркутураПараметров);

	//Параметры данных
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоПериода"				, НачалоДня(Настройки.НачалоПериода), НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецПериода"				, КонецДня(Настройки.КонецПериода)	, НастройкиСКД.ПараметрыДанных);
	
	//----
	//Выбранные поля
	мПоляОтчета = Настройки.Группировки.ВыгрузитьКолонку("ИмяПоля");
	CW_Отчеты.УстановитьВыбранныеПоляКомпоновкиДанных(НастройкиСКД 	, мПоляОтчета);	
	
	//----
	//Дополним выбранные поля выбранными показателями
	CW_Отчеты.УстановитьПоказателиКомпоновкиДанных(НастройкиСКД 		, Настройки.Показатели);	
	
	//----
	// формируем структуру отчета по группировкам
	CW_Отчеты.УстановитьГруппировкиОтчетаКомпановкиДанных(НастройкиСКД.Структура, Настройки.Группировки, Настройки.ОбъединитьГруппировки);

	
	// ---------------------------------------------------------------------------- 
	
	
КонецПроцедуры

#КонецЕсли
