
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КлючОбъекта = _УФК.ПолучитьКлючьОбъектаПоИмениИсточника(ПараметрыВыполненияКоманды.Источник);
	
	ПараметрыФормы = Новый Структура("КлючОбъекта,РежимОткрытия,РежимВыбора,ИмяФормыВладельца,СкрытьВозможностьОтбора",КлючОбъекта,"Сохранение",Истина,ПараметрыВыполненияКоманды.Источник.ИмяФормы, истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаписатьНастройкуОтчета", ПараметрыВыполненияКоманды.Источник, ПараметрыФормы);
	ОткрытьФорму("Справочник.CW_НастройкиПользователей.Форма.ФормаУправленияНастройками", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
