
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.АдресПодписи.РазмерКартинки=РазмерКартинки.АвтоРазмер;
	// --- 
	к = РеквизитФормыВЗначение("Запись").Подпись.Получить();
	Если (к <> Неопределено) Тогда
		АдресПодписи = ПоместитьВоВременноеХранилище(к,ЭтаФорма.УникальныйИдентификатор);
	Иначе
		АдресПодписи = "";
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если (АдресПодписи = "") Тогда
		ТекущийОбъект.Подпись = Новый ХранилищеЗначения(Неопределено);
	Иначе
		ТекущийОбъект.Подпись = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресПодписи));	
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыбратьПодпись(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = 	"Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
	+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
	+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
	+ "Формат TIFF (*.tif)|*.tif|"
	+ "Формат GIF (*.gif)|*.gif|"
	+ "Формат PNG (*.png)|*.png|"
	+ "Формат icon (*.ico)|*.ico|"
	+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|"; // картинки
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Файл = МассивФайлов[0];
		
		АдресФайла = "";
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаЗагрузкиФайла",ЭтотОбъект, Новый Структура()); 
		НачатьПомещениеФайла(ПОВ,АдресФайла,Файл,Ложь,УникальныйИдентификатор);
		
	Иначе
		Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
		_УФК.ВывестиПредупреждение(НСтр(Текст));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗагрузкиФайла(Результат, АдресВременногоХранилищаФайла, ВыбранноеИмя, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Результат) Тогда
		
		Ответ = _ОбработатьЗагрузкуФайла(АдресВременногоХранилищаФайла);
		Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ОбработатьЗагрузкуФайла(Адрес)
	// --- 
	
	Попытка
		ДД = ПолучитьИзВременногоХранилища(Адрес);
		АдресПодписи = ПоместитьВоВременноеХранилище(ДД,ЭтаФорма.УникальныйИдентификатор);
		Возврат(_УФКС.Ответ());
	Исключение
	    Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОчиститьПодпись(Команда)
	
	АдресПодписи = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПодписи(Команда)
	
	Таблица = _ПолучитьШаблон();
	Таблица.Показать("Шаблон образца подписи");
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьШаблон()
	// --- 
	
	Таблица = Новый ТабличныйДокумент;
	Макет = РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьМакет("ШаблонПодписи");
	Обл = Макет.ПолучитьОбласть("ОбразцыПодписей");
	Таблица.Вывести(Обл);			
	Таблица.ОтображатьЗаголовки = Ложь;
	Таблица.ОтображатьСетку = Ложь;
	Таблица.СохранятьСвойстваОтображения = Истина;
	Таблица.ТолькоПросмотр = Истина;
	
	Возврат(Таблица);
	
	// --- 
КонецФункции


