Процедура ОбработатьСобытияГрузопереовзок() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СобытияГрузоперевозок.Ссылка КАК Ссылка,
	               |	CW_СобытияГрузоперевозок.УДАЛТЬСообщение КАК Сообщение
	               |ИЗ
	               |	Справочник.CW_СобытияГрузоперевозок КАК CW_СобытияГрузоперевозок";    
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ФорматированныйДокумент = Новый ФорматированныйДокумент; 
		ФорматированныйДокумент.УстановитьHTML(Выборка.Сообщение, Новый Структура);
		
		СобытиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СобытиеОбъект.ХранилищеСообщения = Новый ХранилищеЗначения(ФорматированныйДокумент);
	    СобытиеОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры