&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	УстановитьДоступностьЭлементовФормыДляПолныхПрав(ЭтаФорма);

	ВалютаРубль = CW_БухгалтерияЭкспедитораСервер.ПолучитьЗначениеНациональнойВалюты();
	
	ПроверитьПараметрыУчета();
	
	
	// --- 
	Если НаборКонстант.CW_ПорядокРасчетаНормативаТоплива.Пустая() Тогда
		НаборКонстант.CW_ПорядокРасчетаНормативаТоплива = Перечисления.CW_ПорядокРасчетаНормативаТоплива.НаДатуОкончанияПеревозки;
	КонецЕсли;
	
	ИнициализацияРегламеногоЗадания();

	//Подсистема.ЛичныйКабинет
	Элементы.ЛичныйКабинетПодключить.Видимость	= Не НаборКонстант.CW_ЛичныйКабинетИспользуется;
	Элементы.НастройкиЛичногоКабинета.Видимость = НаборКонстант.CW_ЛичныйКабинетИспользуется;
	Элементы.ЛичныйКабинетОтключить.Видимость	= НаборКонстант.CW_ЛичныйКабинетИспользуется;
	//Подсистема.ЛичныйКабинет  
	
	//Подсистема.CW_БухгалтерскийУчетМСФО
	Элементы.ГруппаМСФО.Видимость = CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитора.CW_БухгалтерскийУчетМСФО");
	//Подсистема.CW_БухгалтерскийУчетМСФО  
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	УправлениеФормойНаСервере();
	
	УстановитьУсловноеОфрмлениеФормы();
	
	ПолучитьДанныеАктивацииНаСервере();

	УстановитьОтборНастроейОперативногоУчетаНаСервере(); 

	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);   
	
	ОтборПользователей = 1;
	УстановитьОтбрСпискаНастройкиПользователейНаСервере();
	
	ИспользуетсяНовыйМеханизм = CW_ПроверкаЛицензии.ИспользуетсяНовыйМеханизмЛицензирования();
	
	Элементы.ОбщаяКомандаCW_РегистрацияМодуля.Видимость =  НЕ ИспользуетсяНовыйМеханизм;
	Элементы.ГруппаЛицензияНаПрограмму.Видимость 		=  НЕ ИспользуетсяНовыйМеханизм; 
	
	Элементы.ОбщаяКомандаCW_АктивацияМодуля.Видимость 			=  ИспользуетсяНовыйМеханизм;
	Элементы.ОбщаяКомандаCW_ПолучитьКомплектПинКодов.Видимость 	=  ИспользуетсяНовыйМеханизм;
	Элементы.ГруппаАктивацияПрограммы.Видимость 				=  ИспользуетсяНовыйМеханизм;

	ПоказатьСкрытьСоставНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеАктивацииНаСервере()
	
	ДанныеЛицензии = CW_РегистрацияПрограммыСервер.ПолучитьДанныеСтраницыЛицензии(); 
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеЛицензии);  
	
	Если ДанныеЛицензии.Свойство("ЦветТекстаСтатуса") Тогда
		Элементы.Рег_СтатусПрограммы.ЦветТекста = ДанныеЛицензии.ЦветТекстаСтатуса;	
	КонецЕсли;
	Если ДанныеЛицензии.Свойство("ЦветТекстаБазы") Тогда
		Элементы.Рег_Использование.ЦветТекста = ДанныеЛицензии.ЦветТекстаБазы;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненаАктивацияПрограммы" Тогда
		
		ПолучитьДанныеАктивацииНаСервере();            
		
	ИначеЕсли ИмяСобытия = "Запись_Пользователи" Тогда  
		
		Элементы.НастройкиПользователей.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры


//Подсистема.РаботаСЭлектроннойПочтой
&НаКлиенте
Процедура ОтправкаПисемИспользуетсяПриИзменении(Элемент)
	ЗаписатьИзмененияРегламентногоЗадания();
	
	УправлениеФормойНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьРасписания()
	
	Если ОтправкаПисемРасписаниеРегламентногоЗадания = Неопределено Тогда
		ОтправкаПисемРасписаниеВыполнения = НСтр("ru='Настроить расписание выполнения'");
	Иначе
		ОтправкаПисемРасписаниеВыполнения = ОтправкаПисемРасписаниеРегламентногоЗадания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаПисемРасписаниеВыполненияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ОтправкаПисемРасписаниеРегламентногоЗадания = Неопределено Тогда
		ОтправкаПисемРасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправкаПисемЗавершитьИзменениеРасписания", ЭтотОбъект);
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ОтправкаПисемРасписаниеРегламентногоЗадания);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаПисемЗавершитьИзменениеРасписания(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтправкаПисемРасписаниеРегламентногоЗадания = РезультатВыбора;
	УстановитьНадписьРасписания();
	
	ЗаписатьИзмененияРегламентногоЗадания();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияРегламеногоЗадания()
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Подсистема.РаботаСЭлектроннойПочтой
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.CW_ОтправкаПисем);
	ОтправкаПисемРасписаниеРегламентногоЗадания	= РегламентноеЗадание.Расписание;
	ОтправкаПисемИспользуется					= РегламентноеЗадание.Использование;
	УстановитьНадписьРасписания();
	//Подсистема.РаботаСЭлектроннойПочтой

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияРегламентногоЗадания()
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.CW_ОтправкаПисем);
	
	РегламентноеЗадание.Использование 	= ОтправкаПисемИспользуется;
	РегламентноеЗадание.Расписание 		= ОтправкаПисемРасписаниеРегламентногоЗадания;
	РегламентноеЗадание.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаПисемВыполнитьВручную(Команда)
	
	РезультатВыполнения =  ОтправкаПисемВыполнитьВручнуюНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеВыполненияРегламентногоЗаданияОтправкаПисем", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ОтправкаПисемВыполнитьВручнуюНаСервереВФоне()
	
	ПараметрыПроцедуры = Новый Структура;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Отправка писем";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("_ЭП.ОтправитьПочту",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеВыполненияРегламентногоЗаданияОтправкаПисем(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		ПоказатьОповещениеПользователя("Отправка писем завершена",,"Регламентное задание");
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		ПоказатьОповещениеПользователя("Ошибка отправки писем",, "Регламентное задание");
	КонецЕсли;
	
КонецПроцедуры

//Подсистема.РаботаСЭлектроннойПочтой


&НаСервереБезКонтекста
Функция НаличиеПроведенныхДокументов()
	
	ТекстЗапроса	= "";
	ПерваяИнтерация = Истина;
	
	Для Каждого ОбъектМетаданных из Метаданные.Документы Цикл
		
		Если Не ПерваяИнтерация Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	"+ОбъектМетаданных.Имя+".Ссылка
		|ИЗ
		|	Документ."+ОбъектМетаданных.Имя+" КАК "+ОбъектМетаданных.Имя;
		
		ПерваяИнтерация = ложь;
		
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		
		Возврат Не РезультатЗапроса.Пустой();
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовФормыДляПолныхПрав(Форма)
	
	ЭтоПользовательСПолнымиПравами 	 = CW_ПраваДоступа.ПравоДоступно("ПолныеПрава");
	Форма.ТолькоПросмотр			 = Не ЭтоПользовательСПолнымиПравами;
	
	Для Каждого Элемент из Форма.Элементы Цикл
		Если ЕстьСвойство(Элемент, "ТолькоПросмотр") Тогда
			Элемент.ТолькоПросмотр = Не ЭтоПользовательСПолнымиПравами;
		ИначеЕсли  ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
			Элемент.Доступность = ЭтоПользовательСПолнымиПравами;
		КонецЕсли;
	КонецЦикла;

	Форма.Элементы.СсылкаНаПодключаемыеОбъекты.Доступность  			  = ЭтоПользовательСПолнымиПравами;
	Форма.Элементы.ИдентификаторыПодключаемыхОбъектов.Доступность  		  = ЭтоПользовательСПолнымиПравами;
	Форма.Элементы.ПроверитьИОбновитьНаборыПравПользователей.Доступность  = ЭтоПользовательСПолнымиПравами;
	Форма.Элементы.Группа8.Доступность  								  = ЭтоПользовательСПолнымиПравами;
	
	Форма.Элементы.CW_ЛичныйКабинетИспользуется.ТолькоПросмотр		= Истина;
	Форма.Элементы.CW_РеестрыНДС0Используется.ТолькоПросмотр		= Истина;
	Форма.Элементы.CW_ДоходыНерезидентовИспользуется.ТолькоПросмотр	= Истина;   
	Форма.Элементы.CW_ОбменГИСЭПДИспользуется.ТолькоПросмотр		= Истина;   

	                                                                 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьСвойство(Элемент, Свойство)
	
	Попытка 
		ЗначениеСвойства = Элемент[Свойство];
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОфрмлениеФормы()
	
	//При помощи условного оформления для полноправных 
	//ползователей устанвливаем текст группы пользователя "Администраторы"
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_НастройкиПользователей.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.CW_НастройкиПользователей КАК CW_НастройкиПользователей";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мПолноправныеПользователи = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если CW_ПраваДоступа.ЭтоПолноправныйПользователь(Выборка.Пользователь, Истина) Тогда
			мПолноправныеПользователи.Добавить(Выборка.Пользователь);
		КонецЕсли;
	КонецЦикла;
	
	Если мПолноправныеПользователи.Количество() > 0 Тогда
		
		СписокПолноправныхПользователей = Новый СписокЗначений;
		СписокПолноправныхПользователей.ЗагрузитьЗначения(мПолноправныеПользователи);
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НастройкиПользователейГруппаПользователей");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"НастройкиПользователей.Пользователь", ВидСравненияКомпоновкиДанных.ВСписке, СписокПолноправныхПользователей);
		
		ИмяГруппыАдминистраторы = Строка(Справочники.CW_ГруппыПользователей.Администраторы);
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", ИмяГруппыАдминистраторы);
		
	КонецЕсли;

КонецПроцедуры

#Область ЗаполнениеСчетовРасчетов 

&НаКлиенте
Процедура ЗаполнитьСчетаРасчетов_Поставщики(Команда)
	
	_ЗаполнитьСчетаРасчетов("Поставщики");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСчетаРасчетов_Покупатели(Команда)
	
	_ЗаполнитьСчетаРасчетов("Покупатели");	
	
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьСчетаРасчетов(Вариант)
	// --- 
	
	Поставщики = (Вариант = "Поставщики");
	Покупатели = (Вариант = "Покупатели");
	Счета = CW_Конфигурация.ПланСчетов();
	// --- 
	
	Если (Поставщики) Тогда
		
		НЗ = РегистрыСведений.CW_СчетаВзаиморасчетовСПоставщиками.СоздатьНаборЗаписей();
		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить(Счета.РасчетыСПоставщиками); // 60.01
		МассивСчетов.Добавить(Счета.РасчетыПоАвансамВыданным); // 60.02
		МассивСчетов.Добавить(Счета.РасчетыСПоставщикамиВал); // 60.21
		МассивСчетов.Добавить(Счета.РасчетыПоАвансамВыданнымВал); // 60.22
		МассивСчетов.Добавить(Счета.РасчетыСПоставщикамиУЕ); // 60.31
		МассивСчетов.Добавить(Счета.РасчетыПоАвансамВыданнымУЕ); // 60.32
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_УчетнаяПолитика.СчетРасчетов_Поставщики_Рубли КАК Рубли,
		               |	CW_УчетнаяПолитика.СчетРасчетов_Поставщики_Валюта КАК Валюта,
		               |	CW_УчетнаяПолитика.СчетРасчетов_Поставщики_УЕ КАК УЕ
		               |ИЗ
		               |	РегистрСведений.CW_УчетнаяПолитика КАК CW_УчетнаяПолитика";
		ТаблицаСчетовПоставщиков = Запрос.Выполнить().Выгрузить();
		Для каждого Стр Из ТаблицаСчетовПоставщиков Цикл
			_сф.м_ДобавитьУникально(МассивСчетов,Стр.Рубли);
			_сф.м_ДобавитьУникально(МассивСчетов,Стр.Валюта);
			_сф.м_ДобавитьУникально(МассивСчетов,Стр.УЕ);
		КонецЦикла; 
		
	ИначеЕсли (Покупатели) Тогда 
		
		НЗ = РегистрыСведений.CW_СчетаВзаиморасчетовСПокупателями.СоздатьНаборЗаписей();
		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить(Счета.РасчетыСПокупателями); // 62.01
		МассивСчетов.Добавить(Счета.РасчетыПоАвансамПолученным); // 62.02
		МассивСчетов.Добавить(Счета.РасчетыСПокупателямиВал); // 62.21
		МассивСчетов.Добавить(Счета.РасчетыПоАвансамПолученнымВал); // 62.22
		МассивСчетов.Добавить(Счета.РасчетыСПокупателямиУЕ); // 62.31
		МассивСчетов.Добавить(Счета.РасчетыПоАвансамПолученнымУЕ); // 62.32
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_УчетнаяПолитика.СчетРасчетов_Клиенты_Рубли КАК Рубли,
		               |	CW_УчетнаяПолитика.СчетРасчетов_Клиенты_Валюта КАК Валюта,
		               |	CW_УчетнаяПолитика.СчетРасчетов_Клиенты_УЕ КАК УЕ
		               |ИЗ
		               |	РегистрСведений.CW_УчетнаяПолитика КАК CW_УчетнаяПолитика";
		ТаблицаСчетовПоставщиков = Запрос.Выполнить().Выгрузить();
		Для каждого Стр Из ТаблицаСчетовПоставщиков Цикл
			_сф.м_ДобавитьУникально(МассивСчетов,Стр.Рубли);
			_сф.м_ДобавитьУникально(МассивСчетов,Стр.Валюта);
			_сф.м_ДобавитьУникально(МассивСчетов,Стр.УЕ);
		КонецЦикла; 
		
	КонецЕсли; 
	
	НЗ.Очистить();
	Для каждого Счет Из МассивСчетов Цикл
		
		Запись = НЗ.Добавить();
		Запись.Счет = Счет;
		
	КонецЦикла; 
	НЗ.Записать(Истина);
	
	// --- 
	
	Элементы.СчетаКлиентов.Обновить();
	Элементы.СчетаПоставщиков.Обновить();
	
	// --- 
КонецПроцедуры

#КонецОбласти

#Область Блок_учета_собственного_транспорта

&НаСервере
Процедура ПроверитьПараметрыУчета()
	
	ВедетсяСклдскойУчет = Истина;
	
	ПараметрыУчета = CW_БухгалтерияЭкспедитораСервер.ПолучитьПараметрыУчета();
	Если ПараметрыУчета <> Неопределено Тогда
		ВедетсяСклдскойУчет = ПараметрыУчета.СкладскойУчет;	
	КонецЕсли;
	
	СкладскойУчет  = ВедетсяСклдскойУчет;
	
КонецПроцедуры

&НаКлиенте
Процедура УчетЗапасов(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияУчетаЗапасов", ЭтаФорма, Параметры);
	ОткрытьФорму("ПланСчетов.Хозрасчетный.Форма.УчетЗапасов", Новый Структура,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияУчетаЗапасов(Резульата, Параметры) Экспорт
	
	ПроверитьПараметрыУчета();	
	
КонецПроцедуры	

&НаКлиенте
Процедура НастроитьПолучениеКоличестваИзПараметра(Команда)
	ОткрытьФорму("РегистрСведений.CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.ФормаСписка",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область Блок_DataTransfer

&НаКлиенте
Процедура ПоказатьНастройкиОбменаСообщеиями(Команда)
	
	ОткрытьФорму("ОбщаяФорма.CW_DT_ФормаНастройки",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область Блок_ЛичныйКабинет

&НаКлиенте
Процедура ПоказатьНастройкиЛичногоКабинета(Команда)
	
	ОткрытьФорму("ОбщаяФорма.CW_ЛичныйКабинетНастройки",,,,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти

#Область Формирование_допонительных_свойств_документов
//Создание дополнительных свойств документов

&НаКлиенте
Процедура НастройкиПользователейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	Если Не Копирование Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора"		, истина);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", истина);
		
		ОписаниеОповещенияПриВыборе = Новый ОписаниеОповещения("ОбработкаВыбораПользователя",ЭтаФорма);
		
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора",ПараметрыФормы , ЭтаФорма,,,,ОписаниеОповещенияПриВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПользователя(ЗначениеВыбора, ДополнительныйПараметр) Экспорт
	
	Если Не ЗначениеВыбора = Неопределено Тогда
		
		Отказ = ПроверитьВозможностьВыбораПользователя(ЗначениеВыбора);
		
		Если Отказ Тогда
			ПоказатьПредупреждение(,"Выбранный пользователь помечен на удаление или недействителен!");
		КонецЕсли;
				
		Если Не Отказ Тогда
			
			ДанныеЗаполнения = Новый Структура("Пользователь", ЗначениеВыбора);
			
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",ДанныеЗаполнения);
			ОткрытьФорму("РегистрСведений.CW_НастройкиПользователей.ФормаЗаписи", ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	Конецесли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьВыбораПользователя(ЗначениеВыбора)
	
	Если ЗначениеВыбора.ПометкаУдаления или ЗначениеВыбора.Недействителен  Тогда
		Возврат Истина
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьИОбновитьНаборыПравПользователейНажатие(Элемент)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОбновленииПравПользователей", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Произвести автоматическую настройку ролей пользователей модуля?", Режим, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОбновленииПравПользователей(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Неопределено);
	
	ПроверитьИУстановитьПраваПользователйНаСервере();
	
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ДлительнаяОперация);
	
	ТребуетсяПерезапускСистемы = ПроверитьНеобходимостьПерезапускаСистемы();
	
	Если ТребуетсяПерезапускСистемы Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПерезапуске", ЭтаФорма);
		ПоказатьВопрос(Оповещение, "Наборы прав пользователей изменены. Требуется перезапуск системы. Продолить?", Режим, 0);
		
	Иначе
		
		ПоказатьПредупреждение(,"Проверка наборов прав пользователей выполнена.");
		
	Конецесли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПерезапуске(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ПоказатьПредупреждение(,"Наборы прав пользователей изменены. Требуется перезапуск системы.");
        Возврат;
    КонецЕсли;

	ЗавершитьРаботуСистемы(Ложь,Истина);

КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьПерезапускаСистемы()

	НаборРолейИзменен = СтандартныеПодсистемыСервер.ПараметрРаботыПрограммы("БухгалтерияЭкспедитора.НаборРолейИзменен");
	
	СтандартныеПодсистемыСервер.УстановитьПараметрРаботыПрограммы("БухгалтерияЭкспедитора.НаборРолейИзменен",Ложь);
	
	Возврат ?(НаборРолейИзменен = Неопределено, Ложь, НаборРолейИзменен);
	
КонецФункции

&НаСервере
Процедура ПроверитьИУстановитьПраваПользователйНаСервере()
	
	НаборРолейИзменен = CW_ПраваДоступа.ПроверитьУстановитьРолиПользователейДляДоступаКПодсистемаБухгалтерияЭкспедитора();
	
	СтандартныеПодсистемыСервер.УстановитьПараметрРаботыПрограммы("БухгалтерияЭкспедитора.НаборРолейИзменен",НаборРолейИзменен);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОбновитьДанныеФормы(Результат, Параметры) Экспорт
	
	ОбработатьИзмененияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененияНаСервере()
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	УправлениеФормойНаСервере();
	
КонецПроцедуры




&НаКлиенте
Процедура CW_ИспользованиеБюджетированияПриИзменении(Элемент)
	
	ДополнительныеПараметры = новый Структура;
	ДополнительныеПараметры.Вставить("Имя", Элемент.Имя);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеОпцииИспользованиеБюджетирования", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = "Будет отключена функциональность ""Бюджетирование грузоперевозок"". Продолжить?";
	
	Если Не CW_ИспользованиеБюджетирования Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);	
	Иначе   
		ВыполнитьОбработкуОповещения(Оповещение,КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПродолжитьИзменениеОпцииИспользованиеБюджетирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		CW_ИспользованиеБюджетирования = Истина;	
		Возврат;
	КонецЕсли;   
	
	НаборКонстант.CW_ИспользованиеБюджетирования =  CW_ИспользованиеБюджетирования;
	ИзмененныеКонстанты = ИспользованиеБюджетированияНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура CW_ИспользованиеЗаказовПриИзменении(Элемент)
	
	ДополнительныеПараметры = новый Структура;
	ДополнительныеПараметры.Вставить("Имя", Элемент.Имя);

	Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеОпцииИспользованиеЗаказов", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = "Будет отключена функциональность ""Учет заказов"". Продолжить?";
	
	Если Не CW_ИспользованиеЗаказов Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);	
	Иначе   
		ВыполнитьОбработкуОповещения(Оповещение,КодВозвратаДиалога.Да); 
	КонецЕсли;
	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПродолжитьИзменениеОпцииИспользованиеЗаказов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		CW_ИспользованиеЗаказов = Истина;
		Возврат;
	КонецЕсли;   
	
	НаборКонстант.CW_ИспользованиеЗаказов =  CW_ИспользованиеЗаказов;
	ИзмененныеКонстанты = ИспользованиеЗаказовНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура CW_ИспользованиеЗаявокПриИзменении(Элемент)  
	
	ДополнительныеПараметры = новый Структура;
	ДополнительныеПараметры.Вставить("Имя", Элемент.Имя);

	Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеОпцииИспользованиеЗаявок", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = "Будет отключена функциональность ""Учет заявок"". Продолжить?";
	
	Если Не CW_ИспользованиеЗаявок Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);	
	Иначе   
		ВыполнитьОбработкуОповещения(Оповещение,КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПродолжитьИзменениеОпцииИспользованиеЗаявок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		CW_ИспользованиеЗаявок = Истина;
        Возврат;
	КонецЕсли; 
	
	НаборКонстант.CW_ИспользованиеЗаявок =  CW_ИспользованиеЗаявок;
	ИзмененныеКонстанты = ИспользованиеЗаявокНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры  


&НаКлиенте
Процедура CW_ИспользованиеCRMПриИзменении(Элемент)
	
	ДополнительныеПараметры = новый Структура;
	ДополнительныеПараметры.Вставить("Имя", Элемент.Имя);

	Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеОпцииИспользованиеCRM", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = "Будет отключена функциональность ""CRM"". Продолжить?";
	
	Если Не CW_ИспользованиеCRM Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);	
	Иначе   
		ВыполнитьОбработкуОповещения(Оповещение,КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьИзменениеОпцииИспользованиеCRM(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		CW_ИспользованиеCRM = Истина;
        Возврат;
	КонецЕсли;   

	НаборКонстант.CW_ИспользованиеCRM =  CW_ИспользованиеCRM;
	ИзмененныеКонстанты = ИспользованиеCRMНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура CW_ИспользованиеМониторингаОборудованияПриИзменении(Элемент)
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("Имя", 			Элемент.Имя);
	СтруктураПараметров.Вставить("ТекстВопроса", 	"Будет отключена функциональность ""Мониторинг оборудования"". Продолжить?");
	
	ОбработатьИзменениеОпции(СтруктураПараметров);
	
КонецПроцедуры 


&НаКлиенте
Процедура CW_ИспользованиеБлокаСобственногоТранспортаПриИзменении(Элемент)
	
	Если СкладскойУчет = 0 Тогда
		CW_ИспользованиеБлокаСобственногоТранспорта = Ложь;
		ПоказатьПредупреждение(,"Для включения опции необходим учет запасов в разрезе складов (Параметры учета)");
		Возврат;
	КонецЕсли;

	ОбработатьИзменениеОцииУчетаСобственногоТранспорт(Элемент);
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработатьИзменениеОцииУчетаСобственногоТранспорт(Элемент)
	
	ДополнительныеПараметры = новый Структура;
	ДополнительныеПараметры.Вставить("Имя", Элемент.Имя);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеОпцииУчетаСобственногоТранспорт", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = "Будет отключена функциональность ""Учет собственного автотранспорта"". Продолжить?";
	
	Если Не CW_ИспользованиеБлокаСобственногоТранспорта Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);	
	Иначе   
		ВыполнитьОбработкуОповещения(Оповещение,КодВозвратаДиалога.Да); 
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПродолжитьИзменениеОпцииУчетаСобственногоТранспорт(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		CW_ИспользованиеБлокаСобственногоТранспорта = Истина;
        Возврат;
	КонецЕсли;   
	
	НаборКонстант.CW_ИспользованиеБлокаСобственногоТранспорта =  CW_ИспользованиеБлокаСобственногоТранспорта;
	ИзмененныеКонстанты = ИспользованиеБлокаСобственногоТранспортаПриИзмененииНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура CW_ОграничиватьДоступНаУровнеЗаписейПриИзменении(Элемент)

	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("Имя", 			Элемент.Имя);
	СтруктураПараметров.Вставить("ТекстВопроса", 	"Будет отключена функциональность ""Ограничение доступа на уровне записей"". Продолжить?");
	
	ОбработатьИзменениеОпции(СтруктураПараметров);
	
КонецПроцедуры
 


&НаКлиенте
Процедура CW_ИспользуютсяСтатусыДокументовПриИзменении(Элемент)
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("Имя", 			Элемент.Имя);
	СтруктураПараметров.Вставить("ТекстВопроса", 	"Будет отключена функциональность ""Учет статусов документов"". Продолжить?");
	
	ОбработатьИзменениеОпции(СтруктураПараметров);

КонецПроцедуры


&НаКлиенте
Процедура CW_ИспользуетсяБлокПланированиеДДСПриИзменении(Элемент)
	
	ДополнительныеПараметры = новый Структура;
	ДополнительныеПараметры.Вставить("Имя", Элемент.Имя);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеОпцииИспользуетсяБлокПланированиеДДС", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = "Будет отключена функциональность ""Планирование движения денежных средств"". Продолжить?";
	
	Если Не CW_ИспользуетсяБлокПланированиеДДС Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);	
	Иначе   
		ВыполнитьОбработкуОповещения(Оповещение,КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПродолжитьИзменениеОпцииИспользуетсяБлокПланированиеДДС(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		CW_ИспользуетсяБлокПланированиеДДС = Истина;
        Возврат;
	КонецЕсли;   

	НаборКонстант.CW_ИспользуетсяБлокПланированиеДДС =  CW_ИспользуетсяБлокПланированиеДДС;
	ИзмененныеКонстанты = ИспользуетсяБлокПланированиеДДСИзмененииНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура CW_ВедетсяУчетПриложенийПоДоговорамПриИзменении(Элемент)

	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("Имя", 			Элемент.Имя);
	СтруктураПараметров.Вставить("ТекстВопроса", 	"Будет отключена функциональность ""Учет приложений к договорам"". Продолжить?");
	
	ОбработатьИзменениеОпции(СтруктураПараметров);

КонецПроцедуры 

&НаКлиенте
Процедура CW_ВедетсяУчетНЗППриИзменении(Элемент)
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("Имя", 			Элемент.Имя);
	СтруктураПараметров.Вставить("ТекстВопроса", 	"Будет отключена функциональность ""Учет НЗП"". Продолжить?");
	
	ОбработатьИзменениеОпции(СтруктураПараметров);

КонецПроцедуры 
 
&НаКлиенте
Процедура CW_ИспользуетсяСогласованиеОбъектовПриИзменении(Элемент)
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("Имя", 			Элемент.Имя);
	СтруктураПараметров.Вставить("ТекстВопроса", 	"Будет отключена функциональность ""Согласование объектов"". Продолжить?");
	
	ОбработатьИзменениеОпции(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура CW_ИспользуютсяШаблоныДокументовПриИзменении(Элемент)

	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("Имя", 			Элемент.Имя);
	СтруктураПараметров.Вставить("ТекстВопроса", 	"Будет отключена функциональность ""Шаблоны печатных форм документов"". Продолжить?");
	
	ОбработатьИзменениеОпции(СтруктураПараметров);

КонецПроцедуры


&НаКлиенте
Процедура ОбработатьИзменениеОпции(СтруктураПараметров)  
	
	КонстантаИмя = ПолучитьИмяКонстанты(СтруктураПараметров.Имя);
	Если КонстантаИмя = "" тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеОпции", ЭтотОбъект, СтруктураПараметров);
	
	ЗначениеОпции = НаборКонстант[КонстантаИмя];
	
	Если Не ЗначениеОпции Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, СтруктураПараметров.ТекстВопроса, Режим, 0);	
	Иначе   
		ВыполнитьОбработкуОповещения(Оповещение,КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьИзменениеОпции(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		КонстантаИмя = ПолучитьИмяКонстанты(ДополнительныеПараметры.Имя);
		Если КонстантаИмя <> "" Тогда
			НаборКонстант[КонстантаИмя] = Истина; //Всегда устанавливаем в "Истина", так как перед этим сняли
		КонецЕсли;
		
		Возврат;
	КонецЕсли;   

	КонстантаИмя = ПриИзмененииРеквизитаСервер(ДополнительныеПараметры.Имя);
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьИмяКонстанты(ИмяЭлемента)

	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли; 
	
	Возврат КонстантаИмя;
	
КонецФункции



&НаКлиенте
Процедура ВалютаРегламентированногоУчетаПриИзменении(Элемент)
	
	Если ПроверитьВозмоожностьИзмененияКонстанты() Тогда 
		НаборКонстант.ВалютаРегламентированногоУчета =  ВалютаРегламентированногоУчета;
		ИзмененныеКонстанты = ВалютаРегламентированногоУчетаНаСервере();
		
		УправлениеФормойНаСервере();
		
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
		ОбновитьИнтерфейс = Истина;
		
		Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
			Если КонстантаИмя <> "" Тогда
				Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ВалютаРегламентированногоУчета = НаборКонстант.ВалютаРегламентированногоУчета;
		ПоказатьПредупреждение(,"Невозможно изменить валюту регламентированного учета, в информационной базе есть проведенные документы!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозмоожностьИзмененияКонстанты()
	
	ВалютаДоИзменения = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если ВалютаДоИзменения <> ВалютаРегламентированногоУчета и ЗначениеЗаполнено(ВалютаДоИзменения) Тогда
		Возврат Не НаличиеПроведенныхДокументов();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


&НаКлиенте
Процедура CW_КонтролироватьПолучениеОригиналовОтКлиентовПриИзменении(Элемент)
		
	НаборКонстант.CW_КонтролироватьПолучениеОригиналовОтКлиентов =  CW_КонтролироватьПолучениеОригиналовОтКлиентов;
	ИзмененныеКонстанты = КонтролироватьПолучениеОригиналовОтКлиентовНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозкиПриИзменении(Элемент)
	
	НаборКонстант.CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки =  CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки;
	ИзмененныеКонстанты = РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозкиНаСервере();

	УправлениеФормойНаСервере();
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура CW_ОграничиватьУслугиПоДоговорамПриИзменении(Элемент)
	
	НаборКонстант.CW_ОграничиватьУслугиПоДоговорам =  CW_ОграничиватьУслугиПоДоговорам;
	ИзмененныеКонстанты = ОграничиватьУслугиПоДоговорамНаСервере();

	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура CW_ИспользуютсяЗависимыеУслугиПриИзменении(Элемент)
	
	НаборКонстант.CW_ИспользуютсяЗависимыеУслуги =  CW_ИспользуютсяЗависимыеУслуги;
	ИзмененныеКонстанты = ИспользуютсяЗависимыеУслугиНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура CW_ИспользуютсяЗависимыеУслугиПоВходяимДоговорамПриИзменении(Элемент)
	
	НаборКонстант.CW_ИспользуютсяЗависимыеУслугиПоВходяимДоговорам =  CW_ИспользуютсяЗависимыеУслугиПоВходяимДоговорам;
	ИзмененныеКонстанты = ИспользуютсяЗависимыеУслугиПоВходяимДоговорамПриИзмененииНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура CW_ИспользуютсяЗависимыеУслугиПоИсходящимДоговорамПриИзменении(Элемент)
	
	НаборКонстант.CW_ИспользуютсяЗависимыеУслугиПоИсходящимДоговорам =  CW_ИспользуютсяЗависимыеУслугиПоИсходящимДоговорам;
	ИзмененныеКонстанты = ИспользуютсяЗависимыеУслугиПоИсходящимДоговорамПриИзмененииНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура CW_СкрытаяКопияДляВсехПисемПриИзменении(Элемент)
	
	НаборКонстант.CW_СкрытаяКопияДляВсехПисем =  CW_СкрытаяКопияДляВсехПисем;
	ИзмененныеКонстанты = СкрытаяКопияДляВсехПисемПриИзмененииНаСервере();
	
	УправлениеФормойНаСервере();
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура CW_ИспользованиеФайловогоАрхиваПриИзменении(Элемент)
	
	НаборКонстант.CW_ИспользованиеФайловогоАрхива =  CW_ИспользованиеФайловогоАрхива;
	ИзмененныеКонстанты = ИспользованиеФайловогоАрхиваПриИзмененииНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура CW_ЗапрашиватьТипФайлаПриДобавленииВАрхивПриИзменении(Элемент)
	
	НаборКонстант.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив =  CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив;
	ИзмененныеКонстанты = ЗапрашиватьТипФайлаПриДобавленииВАрхивНаСервере();
	
	УправлениеФормойНаСервере();
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура CW_ИспользоватьЛогистическиеСтатусыГрузоперевозокПриИзменении(Элемент)
	
	НаборКонстант.CW_ИспользоватьЛогистическиеСтатусыГрузоперевозок =  CW_ИспользоватьЛогистическиеСтатусыГрузоперевозок;
	ИзмененныеКонстанты = ИспользоватьЛогистическиеСтатусыГрузоперевозокПриИзмененииНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура CW_ЗависимыеУслугиУчитыватьГрузПоВходящимПриИзменении(Элемент)
	
	Если Не CW_ЗависимыеУслугиУчитыватьГрузПоВходящим Тогда
		ЕстьЗаписиВРегистре = ПроверитьЗаписиВРегистре("Груз", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
		
		Если ЕстьЗаписиВРегистре Тогда
			СруктураПараметров = Новый Структура;
			СруктураПараметров.Вставить("ИмяПоля", 		"Груз");
			СруктураПараметров.Вставить("ВидДоговора",  ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
			СруктураПараметров.Вставить("Элемент", 		Элемент);
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗависимыеУслуги", ЭтаФорма, СруктураПараметров);
			ПоказатьВопрос(Оповещение, "В регистре ""Настройка зависимых услуг"" записи, в которых заполнено поле ""Груз"" (По входящим договорам) будут удалены! Продолжить?" , Режим, 0);
		Иначе
			ЗависимыеУслугиУчитыватьГрузПоВходящимПриИзменении();
		КонецЕсли;
	Иначе
		ЗависимыеУслугиУчитыватьГрузПоВходящимПриИзменении();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗависимыеУслугиУчитыватьГрузПоВходящимПриИзменении() 
	
	НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоВходящим =  CW_ЗависимыеУслугиУчитыватьГрузПоВходящим;
	
	ИзмененныеКонстанты = ЗависимыеУслугиУчитыватьГрузПоВходящимПриИзмененииНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Функция ЗависимыеУслугиУчитыватьГрузПоВходящимПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоВходящим");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции


&НаКлиенте
Процедура CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящимПриИзменении(Элемент)
	
	Если Не CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим Тогда
		ЕстьЗаписиВРегистре = ПроверитьЗаписиВРегистре("Клиент", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
		
		Если ЕстьЗаписиВРегистре Тогда
			СруктураПараметров = Новый Структура;
			СруктураПараметров.Вставить("ИмяПоля", 		"Клиент");
			СруктураПараметров.Вставить("ВидДоговора",  ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
			СруктураПараметров.Вставить("Элемент", 		Элемент);
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗависимыеУслуги", ЭтаФорма, СруктураПараметров);
			ПоказатьВопрос(Оповещение,"В регистре ""Настройка зависимых услуг"" записи, в которых заполнено поле ""Клиент"" (По входящим договорам) будут удалены! Продолжить?", Режим, 0);
		Иначе
			ЗависимыеУслугиУчитыватьКлиентаПоВходящимПриИзменении();
		КонецЕсли;
	Иначе
		ЗависимыеУслугиУчитыватьКлиентаПоВходящимПриИзменении();
	КонецЕсли;
	
КонецПроцедуры   


&НаКлиенте
Процедура ЗависимыеУслугиУчитыватьКлиентаПоВходящимПриИзменении()

	НаборКонстант.CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим =  CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим;
	ИзмененныеКонстанты = ЗависимыеУслугиУчитыватьКлиентаПоВходящимПриИзмененииНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Функция ЗависимыеУслугиУчитыватьКлиентаПоВходящимПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции


&НаКлиенте
Процедура CW_ЗависимыеУслугиУчитыватьГрузПоИсходящимПриИзменении(Элемент)
	
	Если Не CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим Тогда
		
		ЕстьЗаписиВРегистре = ПроверитьЗаписиВРегистре("Груз", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
		
		Если ЕстьЗаписиВРегистре Тогда
			СруктураПараметров = Новый Структура;
			СруктураПараметров.Вставить("ИмяПоля", 		"Груз");
			СруктураПараметров.Вставить("ВидДоговора",  ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
			СруктураПараметров.Вставить("Элемент", 		Элемент);
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗависимыеУслуги", ЭтаФорма, СруктураПараметров);
			ПоказатьВопрос(Оповещение,"В регистре ""Настройка зависимых услуг"" записи, в которых заполнено поле ""Груз"" (По исходящим договорам) будут удалены! Продолжить?", Режим, 0);
		Иначе
			ЗависимыеУслугиУчитыватьГрузПоИсходящимПриИзменении();
		КонецЕсли;
	Иначе
		ЗависимыеУслугиУчитыватьГрузПоИсходящимПриИзменении();
	КонецЕсли;
	
КонецПроцедуры  


&НаКлиенте
Процедура ЗависимыеУслугиУчитыватьГрузПоИсходящимПриИзменении() 
	
	НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим = CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим;
	ИзмененныеКонстанты = ЗависимыеУслугиУчитыватьГрузПоИсходящимПриИзмененииНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Функция ЗависимыеУслугиУчитыватьГрузПоИсходящимПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗависимыеУслуги(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьЗаписиРегистраНаСервере(Параметры.ВидДоговора, Параметры.ИмяПоля);
	
	ПриИзмененииРеквизитаНаКлиенте(Параметры.Элемент, Ложь);

КонецПроцедуры


&НаКлиенте
Процедура КомандаИсторияОбъектов(Команда)
	
	ОткрытьФорму("Справочник.CW_ИсторияОбъектов.ФормаСписка");

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСправочникВалюты(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Данные справочника ""Валюты"" будет загружен из классификатора. 
	|Потребуется повторная загрузка курсов валют. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ОбработатьСправочникВалюты(ВалютаРубль);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбменыДанными(Команда)
	
	ОткрытьФорму("Справочник.CW_Обмены.ФормаСписка");

КонецПроцедуры

&НаКлиенте
Процедура КомандаВнешниеПодписки(Команда)
	
	ОткрытьФорму("Справочник.CW_ВнешниеПодписки.ФормаСписка");	

КонецПроцедуры

&НаКлиенте
Процедура КомандаСтатистика(Команда)
	
	ОткрытьФорму("РегистрСведений.CW_СтатистикаЖурналаГрузоперевозок.ФормаСписка");

КонецПроцедуры


&НаКлиенте
Процедура КомандаПодключаемыеФормы(Команда)
	
	ОткрытьФорму("Справочник.CW_ПодключаемыеФормы.ФормаСписка");	

КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыеОбъектыНажатие(Элемент)
	
	ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторыПодключаемыхОбъектовНажатие(Элемент)
	ОткрытьФорму("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.ФормаСписка");
КонецПроцедуры


&НаКлиенте
Процедура КомандаНадписьТомаХранения(Команда)
	
	ОткрытьФорму("Справочник.CW_ТомаАрхива.ФормаСписка");

КонецПроцедуры
	
&НаСервереБезКонтекста
Процедура УдалитьЗаписиРегистраНаСервере(ВидДоговора, ИмяПоля)
	
	РегистрыСведений.CW_НастройкаЗависмыхУслуг.УдадитьЗаписиРегистра(ВидДоговора, ИмяПоля);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьЗаписиВРегистре(ИмяПоля, ВидДоговора)
	
	Возврат РегистрыСведений.CW_НастройкаЗависмыхУслуг.ЕстьЗаписиПоИзмерению(ВидДоговора, ИмяПоля);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьСправочникВалюты(ВалютаРубль)
	
	УстановитьПривилегированныйРежим(истина);
	
	ТекущаяВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если ТекущаяВалюта = ВалютаРубль Тогда
		КлассификаторXML = Обработки.ЗагрузкаКурсовВалют.ПолучитьМакет("ОбщероссийскийКлассификаторВалют").ПолучитьТекст();
	Иначе
		КлассификаторXML = Обработки.CW_ЗагрузкаКурсовВалют_ЕЦБ.ПолучитьМакет("ОбщероссийскийКлассификаторВалют").ПолучитьТекст();
	КонецЕсли;
	
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	Если ТекущаяВалюта = ВалютаРубль тогда
		ПолеПоиска 	= "Code";
		ПолеКод 	= "Code";
	Иначе
		ПолеПоиска  = "CodeSymbol";
		ПолеКод 	= "Code";
	КонецЕсли;
	
	//Обработкам справочник "Валюты"
	Запрос = Новый запрос;
	запрос.Текст = 	"ВЫБРАТЬ
	               	|	Валюты.Ссылка КАК Ссылка,
	               	|	Валюты.Код КАК Code,
	               	|	Валюты.Наименование КАК CodeSymbol
	               	|ИЗ
	               	|	Справочник.Валюты КАК Валюты";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВалютаОбъект = Выборка.Ссылка.ПолучитьОбъект();

		ЗаписьОКВ = КлассификаторТаблица.Найти(Выборка[ПолеПоиска],ПолеПоиска);
		
		Если Не ЗаписьОКВ = Неопределено Тогда
			
			ВалютаОбъект.Код					= ЗаписьОКВ[ПолеКод];
			ВалютаОбъект.Наименование			= ЗаписьОКВ.CodeSymbol;
			ВалютаОбъект.НаименованиеПолное		= ЗаписьОКВ.Name;
			
			Если ТекущаяВалюта = ВалютаРубль Тогда
				ВалютаОбъект.ЗагружаетсяИзИнтернета	= ЗаписьОКВ.RBCLoading;
				Загружается = Вычислить(ЗаписьОКВ.RBCLoading);
			Иначе
				ВалютаОбъект.ЗагружаетсяИзИнтернета	= ЗаписьОКВ.ECBLoading;
				Загружается = Вычислить(ЗаписьОКВ.ECBLoading);
			КонецЕсли;
			
			ВалютаОбъект.ПараметрыПрописи		= ЗаписьОКВ.NumerationItemOptions;
			
			Если Загружается Тогда
				ВалютаОбъект.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета;
			Иначе
				ВалютаОбъект.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
			КонецЕсли;
			
		Иначе
			
			ВалютаОбъект.СпособУстановкиКурса 	= Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
			ВалютаОбъект.ЗагружаетсяИзИнтернета = Ложь;
			
		КонецЕсли;
		
		ВалютаОбъект.Записать();
		
	КонецЦикла;
	
	Сообщение = новый СообщениеПользователю;   
	Сообщение.Текст = НСтр("ru = 'Модифицирован справочник валюты'; en = 'The currency directory has been modified'");
	Сообщение.Сообщить();	
	
	
	//Очистим курсы валют
	НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
	НаборЗаписей.Очистить();
	
	//Создадим запись для базовой валюты
	Запись = НаборЗаписей.Добавить();
	Запись.Период 		= Дата(1980,1,1);
	Запись.Валюта 		= ТекущаяВалюта;
	Запись.Курс 		= 1;
	Запись.Кратность 	= 1;
	
	НаборЗаписей.Записать(Истина);

	Сообщение = новый СообщениеПользователю;   
	Сообщение.Текст = НСтр("ru = 'Удалены курсы валют'; en = 'Deleted exchange rates'");
	Сообщение.Сообщить();	

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормойНаСервере()
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	//Видимость элементов
	Элементы.ГруппаУчетЗапасов.Видимость 					= Форма.СкладскойУчет = 0; 
	
	Элементы.СтраницаБУ.Видимость 							= Форма.CW_ВалютаРегламентированногоУчетаРубль;
	Элементы.ОбновитьСправочникВалюты.Видимость 			= ЗначениеЗаполнено(Форма.ВалютаРегламентированногоУчета);

	Элементы.CW_УстанавливатьПризнакНаличияОригиналовДляСчетов.Доступность =  Форма.CW_КонтролироватьПолучениеОригиналовОтКлиентов;
	
	Элементы.НастроитьПолучениеКоличестваИзПараметра.Видимость	= Форма.CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки;
	
	Элементы.ГруппаДполнителныеНастройкиОграничения.Видимость 	= Форма.CW_ОграничиватьУслугиПоДоговорам;

	Элементы.ГруппаЗависимыеУслуги.Видимость 					= Форма.CW_ИспользуютсяЗависимыеУслуги;
	Элементы.ГруппаДоппараметрыВходящих.Видимость 				= Форма.CW_ИспользуютсяЗависимыеУслугиПоВходяимДоговорам;
	Элементы.ГруппаДоппараметрыИсходящих.Видимость 				= Форма.CW_ИспользуютсяЗависимыеУслугиПоИсходящимДоговорам;
	
	Элементы.CW_АдресаСкрытыхКопийДляВсехПисем.Видимость 		= Форма.CW_СкрытаяКопияДляВсехПисем;
	
	Элементы.ГруппаЗапрашиватьТипДокумента.Видимость 				= Форма.CW_ИспользованиеФайловогоАрхива;
	Элементы.ТипыДокументовФайловогоАрхиваОткрытьСписок.Видимость 	= Форма.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив;
	
	Элементы.CW_УстановитьЗначениеНольЗначениеПараметраНеУстановлено.Доступность 		= Форма.CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки;
	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВосстановитьСтандартныеНастройки", "Видимость", ВедетсяУчетЗарплатыВЭтойПрограмме);		
	
	Элементы.ОтправкаПисемРасписаниеВыполнения.Видимость = Форма.ОтправкаПисемИспользуется;    

	//CW_РеестрыНДС0 
	Если РольДоступна("БухгалтерияЭкспедитораАдминистратор")
		или РольДоступна("ПолныеПрава") Тогда
		Элементы.ОбщаяКомандаCW_РеестрыНДС0Подключить.Видимость = Не Форма.CW_РеестрыНДС0Используется;
	КонецЕсли;
	//CW_РеестрыНДС0
	
	//CW_ДоходыНерезидентов  
	Если РольДоступна("БухгалтерияЭкспедитораАдминистратор") 
		или РольДоступна("ПолныеПрава") Тогда
		Элементы.ОбщаяКомандаCW_ДоходыНерезидентовПодключить.Видимость = Не Форма.CW_ДоходыНерезидентовИспользуется;
	КонецЕсли;
	//CW_ДоходыНерезидентов 
	
	//CW_ОбменГИСЭПД  
	Если РольДоступна("БухгалтерияЭкспедитораАдминистратор") 
		или РольДоступна("ПолныеПрава") Тогда
		Элементы.ОбщаяКомандаCW_ОбменГИСЭПДПодключить.Видимость = Не Форма.CW_ОбменГИСЭПДИспользуется;
	КонецЕсли;
	//CW_ОбменГИСЭПД	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначенияРеквизитовФормы(Форма)

	Форма.CW_ИспользованиеБлокаСобственногоТранспорта 		= Константы.CW_ИспользованиеБлокаСобственногоТранспорта.Получить();
	Форма.CW_ИспользуетсяБлокПланированиеДДС           		= Константы.CW_ИспользуетсяБлокПланированиеДДС.Получить();
	Форма.CW_ИспользованиеCRM 								= Константы.CW_ИспользованиеCRM.Получить();
	Форма.CW_ИспользованиеБюджетирования					= Константы.CW_ИспользованиеБюджетирования.Получить();

	ВалютаРегламентированногоУчета							= Константы.ВалютаРегламентированногоУчета.Получить();
	Форма.ВалютаРегламентированногоУчета					= ВалютаРегламентированногоУчета;
	Форма.CW_ВалютаРегламентированногоУчетаРубль 				= ВалютаРегламентированногоУчета = Форма.ВалютаРубль;
	
	Форма.CW_КонтролироватьПолучениеОригиналовОтКлиентов    = Константы.CW_КонтролироватьПолучениеОригиналовОтКлиентов.Получить();
	
	Форма.CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки = Константы.CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки.Получить();
	Форма.CW_ОграничиватьУслугиПоДоговорам 					= Константы.CW_ОграничиватьУслугиПоДоговорам.Получить();

	Форма.CW_ИспользуютсяЗависимыеУслуги 						= Константы.CW_ИспользуютсяЗависимыеУслуги.Получить();
	Форма.CW_ИспользуютсяЗависимыеУслугиПоВходяимДоговорам		= Константы.CW_ИспользуютсяЗависимыеУслугиПоВходяимДоговорам.Получить();
	Форма.CW_ИспользуютсяЗависимыеУслугиПоИсходящимДоговорам	= Константы.CW_ИспользуютсяЗависимыеУслугиПоИсходящимДоговорам.Получить();
	Форма.CW_ИспользованиеФайловогоАрхива						= Константы.CW_ИспользованиеФайловогоАрхива.Получить();     
	Форма.CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим			= Константы.CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим.Получить();     
	Форма.CW_ЗависимыеУслугиУчитыватьГрузПоВходящим				= Константы.CW_ЗависимыеУслугиУчитыватьГрузПоВходящим.Получить();     
	Форма.CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим			= Константы.CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим.Получить();     
	              
	Форма.CW_СкрытаяКопияДляВсехПисем	= Константы.CW_СкрытаяКопияДляВсехПисем.Получить();
	
	Форма.CW_ИспользованиеЗаказов	= Константы.CW_ИспользованиеЗаказов.Получить();
	Форма.CW_ИспользованиеЗаявок	= Константы.CW_ИспользованиеЗаявок.Получить();
	
	//Подсистема.CW_БухгалтерскийУчетМСФО
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитора.CW_БухгалтерскийУчетМСФО") Тогда
		Форма["CW_ВедениеБухгалтескогоУчетаМСФО"] = Константы["CW_ВедениеБухгалтескогоУчетаМСФО"].Получить();
	КонецЕсли;
	//Подсистема.CW_БухгалтерскийУчетМСФО    
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии") Тогда   
		//Подсистема.CW_РеестрыНДС0 
		Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда   
			Форма.Элементы.ГруппаРеестрыНДС0.Видимость = Истина;   
			CW_РеестрыНДС0Используется = Константы["CW_РеестрыНДС0Используется"];	
			Форма.CW_РеестрыНДС0Используется = CW_РеестрыНДС0Используется.Получить();
		КонецЕсли; 	 
		//Подсистема.CW_РеестрыНДС0
		
		//Подсистема.CW_ДоходыНерезидентов  
		Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_ДоходыНерезидентов") Тогда  
			Форма.Элементы.ГруппаДоходыНерезидента.Видимость = Истина; 
			CW_ДоходыНерезидентовИспользуется = Константы["CW_ДоходыНерезидентовИспользуется"];	
			Форма.CW_ДоходыНерезидентовИспользуется = CW_ДоходыНерезидентовИспользуется.Получить();
		КонецЕсли; 	 
		//Подсистема.CW_ДоходыНерезидентов
		
		//Подсистема.CW_ОбменГИСЭПД  
		Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_ОбменГИСЭПД") Тогда  
			Форма.Элементы.ГруппаОбменГИСЭПД.Видимость = Истина; 
			CW_ОбменГИСЭПДИспользуется = Константы["CW_ОбменГИСЭПДИспользуется"];	
			Форма.CW_ОбменГИСЭПДИспользуется = CW_ОбменГИСЭПДИспользуется.Получить();
		КонецЕсли; 	                      
		//Подсистема.CW_ОбменГИСЭПД 
	КонецЕсли;
	
	Форма.CW_ИспользоватьЛогистическиеСтатусыГрузоперевозок = Константы.CW_ИспользоватьЛогистическиеСтатусыГрузоперевозок.Получить(); 
	
	Форма.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив = Константы.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив.Получить(); 

КонецПроцедуры

&НаСервере
Функция ИспользованиеБюджетированияНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользованиеБюджетирования");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ОграничиватьВыборКонтрагентовПоБюджету = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ОграничиватьВыборКонтрагентовПоБюджету");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_УказыватьДоговорДляПлановыхСтатейБюджета = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УказыватьДоговорДляПлановыхСтатейБюджета");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ИспользованиеКоличестваДляПлановыхСтатей = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользованиеКоличестваДляПлановыхСтатей");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	НаборКонстант.CW_БазоваяВерсияБюджета = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_БазоваяВерсияБюджета");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции 



&НаСервере
Функция ВалютаРегламентированногоУчетаНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.ВалютаРегламентированногоУчета");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ВалютаУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	НаборКонстант.CW_ВалютаРегламентированногоУчетаРубль = ВалютаУчета = ВалютаРубль;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ВалютаРегламентированногоУчетаРубль");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	//Подсистема.CW_БухгалтерскийУчетМСФО
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитора.CW_БухгалтерскийУчетМСФО") Тогда
		НаборКонстант["CW_ВедениеБухгалтескогоУчетаМСФО"] = ВалютаУчета <> ВалютаРубль;
		КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ВедениеБухгалтескогоУчетаМСФО");
		ИзмененныеКонстанты.Добавить(КонстантаИмя);                                                
	Конецесли;
	//Подсистема.CW_БухгалтерскийУчетМСФО
	
	//Включить код после вывода блока МСФО из бета-тестирования
	//Элементы.CW_ВедениеБухгалтескогоУчетаМСФО.Доступность = ВалютаУчета <> ВалютаРубль;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции  

&НаСервере
Функция КонтролироватьПолучениеОригиналовОтКлиентовНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_КонтролироватьПолучениеОригиналовОтКлиентов");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_УстанавливатьПризнакНаличияОригиналовДляСчетов = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УстанавливатьПризнакНаличияОригиналовДляСчетов");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
	
КонецФункции   

&НаСервере
Функция РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозкиНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_УстановитьЗначениеНольЗначениеПараметраНеУстановлено = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УстановитьЗначениеНольЗначениеПараметраНеУстановлено");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

Функция ОграничиватьУслугиПоДоговорамНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ОграничиватьУслугиПоДоговорам");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_УстанавливатьЦенуВЗависимостиОтГруза = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УстанавливатьЦенуВЗависимостиОтГруза");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_УстановкаЦенНоменклатурыВЗависимостиОтКлиента = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УстановкаЦенНоменклатурыВЗависимостиОтКлиента");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ОсновнойВариантУстановкиЦенПоДоговорам = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ОсновнойВариантУстановкиЦенПоДоговорам");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	НаборКонстант.CW_НеОграничиватьСписокУслугПриПеревыставленииЗатрат = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_НеОграничиватьСписокУслугПриПеревыставленииЗатрат");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;

КонецФункции

&НаСервере
Функция ИспользуетсяБлокПланированиеДДСИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуетсяБлокПланированиеДДС");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ИспользованиеПодразделенийКомпании = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользованиеПодразделенийКомпании");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ИспользованиеОфисовКомпании = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользованиеОфисовКомпании");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ПараметрПодразделениеКомпании = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ПараметрПодразделениеКомпании");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция ИспользованиеЗаявокНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользованиеЗаявок");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_МеханизмРаскраскиСпискаЗаявок = "";
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_МеханизмРаскраскиСпискаЗаявок");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция ИспользованиеЗаказовНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользованиеЗаказов");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_НумераторЗаказов = "";
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_НумераторЗаказов");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ПрефиксЗаказов = "";
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ПрефиксЗаказов");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_АвтоматическаяНумерацияВПределахЗаказа = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_АвтоматическаяНумерацияВПределахЗаказа");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ИспользуютсяПараметрыВЗаказах = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуютсяПараметрыВЗаказах");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция ИспользованиеCRMНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользованиеCRM");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ИспользованиеЛоготипов = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользованиеЛоготипов");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_РегистрироватьСобытияОтправкиПисемКлиентам = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_РегистрироватьСобытияОтправкиПисемКлиентам");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция ИспользованиеБлокаСобственногоТранспортаПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользованиеБлокаСобственногоТранспорта");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ВедетсяУчетШинТранспортногоСредства = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ВедетсяУчетШинТранспортногоСредства");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_УчитыватьПробегТранспортногоСредстваСГрузом = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УчитыватьПробегТранспортногоСредстваСГрузом");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ВводитьДанныеОПорожнемПробегеВДокументах = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ВводитьДанныеОПорожнемПробегеВДокументах");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	                   
	НаборКонстант.CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ВариантОтраженияЗатратПоБУВПределахПогрешности = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ВариантОтраженияЗатратПоБУВПределахПогрешности");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ПрименяютсяНормативыРасходаТоплива = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ПрименяютсяНормативыРасходаТоплива");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ПорядокРасчетаНормативаТоплива = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ПорядокРасчетаНормативаТоплива");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ИспользуютсяПоказателиТранспортногоСредстваОтдельноОтМодели = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуютсяПоказателиТранспортногоСредстваОтдельноОтМодели");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	НаборКонстант.CW_РазрешеноСоздаватьПоказателиДляРасчетанормРасходаТоплива = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_РазрешеноСоздаватьПоказателиДляРасчетанормРасходаТоплива");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ПриПечатиПутевогоЛистаВыводитьИнформациюПоГрузоперевозкам = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ПриПечатиПутевогоЛистаВыводитьИнформациюПоГрузоперевозкам");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ДополнительноеСвойствоДокументаОперацияВведеннаяВручную = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ДополнительноеСвойствоДокументаОперацияВведеннаяВручную");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ДополнительноеСвойствоДокументаПеремещениеТоваров = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ДополнительноеСвойствоДокументаПеремещениеТоваров");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ДополнительноеСвойствоДокументаТребованиеНакладная = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ДополнительноеСвойствоДокументаТребованиеНакладная");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_СтатьяЗатратСписанияТопливаПоПутевымЛистам = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_СтатьяЗатратСписанияТопливаПоПутевымЛистам");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_НоменклатураУчетаЗарплатыВодителей = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_НоменклатураУчетаЗарплатыВодителей");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	ОбновитьПовторноИспользуемыеЗначения();
	
	 
	
	Возврат ИзмененныеКонстанты;
	
 КонецФункции
 
&НаСервере
Функция ИспользуютсяЗависимыеУслугиНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуютсяЗависимыеУслуги");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ИспользуютсяЗависимыеУслугиПоВходяимДоговорам = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуютсяЗависимыеУслугиПоВходяимДоговорам");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ИспользуютсяЗависимыеУслугиПоИсходящимДоговорам = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуютсяЗависимыеУслугиПоИсходящимДоговорам");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоВходящим = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоВходящим");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	 
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция ИспользуютсяЗависимыеУслугиПоВходяимДоговорамПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуютсяЗависимыеУслугиПоВходяимДоговорам");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоВходящим = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоВходящим");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	 
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция ИспользуютсяЗависимыеУслугиПоИсходящимДоговорамПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуютсяЗависимыеУслугиПоИсходящимДоговорам");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	 
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция СкрытаяКопияДляВсехПисемПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_СкрытаяКопияДляВсехПисем");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_АдресаСкрытыхКопийДляВсехПисем = "";
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_АдресаСкрытыхКопийДляВсехПисем");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	 
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция ИспользованиеФайловогоАрхиваПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользованиеФайловогоАрхива");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	 
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция ЗапрашиватьТипФайлаПриДобавленииВАрхивНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция ИспользоватьЛогистическиеСтатусыГрузоперевозокПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользоватьЛогистическиеСтатусыГрузоперевозок");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_РассчитыватьЛогистическийСтатусГрузоперевозкиПоНаиболшейКонтрольнойДате = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_РассчитыватьЛогистическийСтатусГрузоперевозкиПоНаиболшейКонтрольнойДате");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииРеквизитаФормы(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	//Для констант заданных через реквизиты формы
	//Если РеквизитПутьКДанным = "{ИмяКонстанты}" Тогда
	//	НовоеЗначение = {ИмяКонстанты};
	//	Константы.{ИмяКонстанты.Установить(НовоеЗначение);
	//	Возврат "";
	//КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура БюджетированиеНастройки(Команда)
	ОткрытьФорму("ОбщаяФорма.CW_Бюджетирование",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СРМНастройки(Команда)
	ОткрытьФорму("ОбщаяФорма.CW_НастройкиCRM",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеДДСНастройки(Команда)
	ОткрытьФорму("ОбщаяФорма.CW_ПланированиеДДС",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура АвтотранспортНастройки(Команда)
	ОткрытьФорму("ОбщаяФорма.CW_Автотранспорт",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура УчетЗаказовНастройка(Команда)
	ОткрытьФорму("ОбщаяФорма.CW_НастройкаУчетаЗаказов",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура УчетЗаявокНастройка(Команда)
	ОткрытьФорму("ОбщаяФорма.CW_НастройкаУчетаЗаявок",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры



//Исправления
&НаКлиенте
Процедура ИсправленияКонфигурацииАктивные(Команда)
	
	ОткрытьФорму("ОбщаяФорма.CW_УстановленныеИсправления",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
//Исправления

//Подсистема.УчетПриложенийДоговоров
&НаКлиенте
Процедура НастройкиУчетаПриложений(Команда)
	ОткрытьФорму("ОбщаяФорма.CW_НастройкиУчетаПриложений",,ЭтаФорма);
КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров

//Подсистема.СогласованиеОбъктов
&НаКлиенте
Процедура НастройкаСогласованияОбхектов(Команда)
	
	ОткрытьФорму("ОбщаяФорма.CW_НастройкиСогласованияОбъектов",,ЭтаФорма);
	
КонецПроцедуры
//Подсистема.СогласованиеОбъктов

//Подсистема.ЛичныйКабинет
&НаКлиенте
Процедура ЛичныйКабинетПодключить(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродложитьПодключениеКСервису", ЭтотОбъект, Параметры);
	
	ПоказатьВопрос(Оповещение, "Будет выполнено подключение к сервису 
								|""Личный кабинет клиента"". Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродложитьПодключениеКСервису(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ CW_РаботаСВнешнимиРесурсамиСервер.ПроверитьПараметрыАвторизацииНаСервереТехподдрежки() Тогда
		ПоказатьПредупреждение(,"Не указаны параметры авторизации на сервере техподдержки!",,"Авторизация");
	Иначе
		CW_РаботаСВнешнимиРесурсамиСервер.СоздатьПараметрыПодключенияСервиса();
		
		Оповещение = Новый ОписаниеОповещения("ОбработатьРезультатПодключенияКСервису", ЭтотОбъект, Параметры);
		ОткрытьФорму("ОбщаяФорма.CW_ЛичныйКабинетАктивацияДоступа",,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПодключенияКСервису(Результат, Параметры) Экспорт
	Если Результат = Неопределено Тогда
		//Отказ от подклчюения
		Возврат;
	КонецЕсли;
	
	НаборКонстант.CW_ЛичныйКабинетИспользуется = Истина;
	ПриИзмененииРеквизитаНаКлиенте(Элементы.CW_ЛичныйКабинетИспользуется, Истина);
	
	УстановитьВидимостьКнопокУправленияЛичнымКабинетов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКнопокУправленияЛичнымКабинетов()
	
	Элементы.ЛичныйКабинетПодключить.Видимость	= Не НаборКонстант.CW_ЛичныйКабинетИспользуется;
	Элементы.НастройкиЛичногоКабинета.Видимость = НаборКонстант.CW_ЛичныйКабинетИспользуется;
	Элементы.ЛичныйКабинетОтключить.Видимость	= НаборКонстант.CW_ЛичныйКабинетИспользуется;

КонецПроцедуры

&НаКлиенте
Процедура ЛичныйКабинетОтключить(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьОтключениеЛичногоКабинета", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Вы действительно хотите от подключения к сервису?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОтключениеЛичногоКабинета(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	КодСостояния = ВыполнитьОтключениеСервисаНаСервере();
	
	Если КодСостояния = 200 Тогда
		НаборКонстант.CW_ЛичныйКабинетИспользуется = Ложь;
		ПриИзмененииРеквизитаНаКлиенте(Элементы.CW_ЛичныйКабинетИспользуется, Истина);
		
		УстановитьВидимостьКнопокУправленияЛичнымКабинетов();
		ПоказатьПредупреждение(,"Сервис отключен",,"Личный кабинет клиента"); 
	Иначе
		ПоказатьПредупреждение(,"Ошибка отключения сервиса. Попробуйте позже.",,"Ошибка работы с сервисом"); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция  ВыполнитьОтключениеСервисаНаСервере() 
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("disabledate",	XMLСтрока(ТекущаяДата()));    
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_disableservice", СтруктураJSON);
 	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET"); 
	Если Ответ = Неопределено Тогда
		Возврат 533;
	КонецЕсли;
	
	Возврат Ответ.КодСостояния
	
КонецФункции

//Подсистема.ЛичныйКабинет

//Подсистема.CW_БухгалтерскийУчетМСФО
&НаКлиенте
Процедура НастройкиМСФО(Команда)
	ОткрытьФорму("ОбщаяФорма.CW_НастройкиБлокаМСФО");
КонецПроцедуры


&НаКлиенте
Процедура CW_ВедениеБухгалтескогоУчетаМСФОПриИзменении(Элемент)

	ДополнительныеПараметры = новый Структура;
	ДополнительныеПараметры.Вставить("Имя", Элемент.Имя);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеОпцииВедениеБухгалтескогоУчетаМСФО", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = "Будет отключена функциональность ""Учет по МСФО"". Продолжить?";
	
	Если Не CW_ВедениеБухгалтескогоУчетаМСФО Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);	
	Иначе   
		ВыполнитьОбработкуОповещения(Оповещение,КодВозвратаДиалога.Да); 
	КонецЕсли;
	
	
КонецПроцедуры   

&НаКлиенте
Процедура ПродолжитьИзменениеОпцииВедениеБухгалтескогоУчетаМСФО(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		CW_ВедениеБухгалтескогоУчетаМСФО = Истина;	
		Возврат;
	КонецЕсли;   
	
	НаборКонстант.CW_ВедениеБухгалтескогоУчетаМСФО =  CW_ВедениеБухгалтескогоУчетаМСФО;
	ИзмененныеКонстанты = ВедениеБухгалтескогоУчетаМСФОПриИзмененииНаСервере();
	
	УправлениеФормойНаСервере();
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВедениеБухгалтескогоУчетаМСФОПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ВедениеБухгалтескогоУчетаМСФО");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_МСФО_ВалютаУчета = ВалютаРегламентированногоУчета;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_МСФО_ВалютаУчета");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	Если CW_ВедениеБухгалтескогоУчетаМСФО и Не НаборКонстант.CW_ИспользованиеВнешнихПодписок Тогда
		///Включаем внешние подписки, если они не включены
		НаборКонстант.CW_ИспользованиеВнешнихПодписок = Истина;
		КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользованиеВнешнихПодписок");
		ИзмененныеКонстанты.Добавить(КонстантаИмя);
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции
//Подсистема.CW_БухгалтерскийУчетМСФО


&НаКлиенте
Процедура ОтборПользователейПриИзменении(Элемент) 
	
	УстановитьОтбрСпискаНастройкиПользователейНаСервере();

КонецПроцедуры     

&НаСервере
Процедура УстановитьОтбрСпискаНастройкиПользователейНаСервере()
	
	
	ЭлементыОтбора = НастройкиПользователей.Отбор.Элементы; 
	ЭлементыОтбора.Очистить();
	
	Если ОтборПользователей > 0 Тогда
		ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Действителен");
		ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = (ОтборПользователей = 1);
		ЭлементОтбора.Использование  = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьКлюч(Команда)  
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУдаленииКлюча", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Регистрационный ключ будет удален. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУдаленииКлюча(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьКлючНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКлючНаСервере()
	
	CW_РегистрацияПрограммыСервер.УстановитьКлюч("");
	ПолучитьДанныеАктивацииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура НачалоВеденияОперативногоУчетаПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборНастроейОперативногоУчета", 0.1, Истина);
	
КонецПроцедуры   

&НаКлиенте
Процедура УстановитьОтборНастроейОперативногоУчета()
	
	ТекущиеДанные = Элементы.НачалоВеденияОперативногоУчета.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборНастроейОперативногоУчетаНаСервере(ТекущиеДанные.Организация, ТекущиеДанные.ВидОперативнойЗадолженности); 
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборНастроейОперативногоУчетаНаСервере(Знач Организация=Неопределено, Знач ВидОперативнойЗадолженности=Неопределено)
	
	НастройкиОперативногоУчета.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = НастройкиОперативногоУчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Организация;
	ЭлементОтбора.Использование 	= Истина;
	
 	ЭлементОтбора = НастройкиОперативногоУчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперативнойЗадолженности");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ВидОперативнойЗадолженности;
	ЭлементОтбора.Использование 	= Истина;

КонецПроцедуры

&НаКлиенте
Процедура ГруппыПользователейПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ГруппыПользователейПриАктивизации",  0.1, Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура ГруппыПользователейПриАктивизации()
	
	ТекущаяСтрока = Элементы.ГруппыПользователей.ТекущаяСтрока;
	Если ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") тогда
		Возврат;
	КонецЕсли;
	
    ОстановитьОтборСоставаГруппыНаСервере();
	
КонецПроцедуры   

&НаСервере
Процедура ОстановитьОтборСоставаГруппыНаСервере()
	
	Состав.Отбор.Элементы.Очистить();    
	
	ГруппаПользователя = Элементы.ГруппыПользователей.ТекущаяСтрока;
	
	ЭлементОтбора = Состав.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Группа");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ГруппаПользователя;
	ЭлементОтбора.Использование 	= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьСостав(Команда)
	
	ПоказатьСкрытьСостав = Не ПоказатьСкрытьСостав;
	ПоказатьСкрытьСоставНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьСоставНаСервере() 
	
	Элементы.ГруппаСостав.Видимость = ПоказатьСкрытьСостав;
	Элементы.ГруппыПользователейПоказатьСкрытьСостав.Пометка = ПоказатьСкрытьСостав;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеИсправления(Команда)
	ОткрытьФорму("ОбщаяФорма.CW_УстановленныеИсправления",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИсправления(Команда)
	ОткрытьФорму("ОбщаяФорма.CW_ФормаПроверкиИсправлений",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры












