Функция УстановкаПараметровСеанса(ИменаПараметровСеанса) Экспорт
	
	УстановленныеПараметры = Новый Массив;
	
	Если ИменаПараметровСеанса = Неопределено Тогда
		
		ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
		
		ПараметрыСеанса.CW_ГруппаПользователя = ГруппаПользователя;                                        
		УстановленныеПараметры.Добавить("CW_ГруппаПользователя");
		
		CW_ИспользуютсяОграниченияПоОрганизациям = ГруппаПользователя.ИспользуютсяОграниченияПоОрганизациям;
		Если Не Константы.CW_ОграничиватьДоступНаУровнеЗаписей.Получить() Тогда  
			CW_ИспользуютсяОграниченияПоОрганизациям = ложь;
		КонецЕсли;
			
		ПараметрыСеанса.CW_ИспользуютсяОграниченияПоОрганизациям = CW_ИспользуютсяОграниченияПоОрганизациям;
		УстановленныеПараметры.Добавить("CW_ИспользуютсяОграниченияПоОрганизациям");
		
		Если ОбщегоНазначения.ПодсистемаСуществует("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда
			МодульCW_РеестрыНДС0Сервер = ОбщегоНазначения.ОбщийМодуль("CW_РеестрыНДС0Сервер");
			МодульCW_РеестрыНДС0Сервер.УстановкаПараметровСеанса(ИменаПараметровСеанса, УстановленныеПараметры);
		КонецЕсли;
		
		CW_ПроверкаЛицензии.УстановкаПараметровСеанса(ИменаПараметровСеанса, УстановленныеПараметры);
		
		Возврат УстановленныеПараметры;  
		
	КонецЕсли;
	
	Если ИменаПараметровСеанса.Найти("CW_ИдентификаторСеанса") <> Неопределено Тогда 
		CW_ПроверкаЛицензии.УстановкаПараметровСеанса(ИменаПараметровСеанса, УстановленныеПараметры);
	КонецЕсли;
	
	Возврат УстановленныеПараметры;
	
	
КонецФункции

// Заполняет основные сведения о библиотеке или основной конфигурации.
// 
// Параметры:
//  Описание - Структура:
//
//   * Имя                 - Строка - имя подсисетмы, например, "CW_БухгалтерияЭкспедитора".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
Процедура ПриДобавленииПодсистем(ОписаниеПодсистем) Экспорт

	ОписаниеПодсистем.Вставить("CW_БухгалтерияЭкспедитора", "8.3.18.2");

	CW_БухгалтерияЭкспедитораСерверПереопределяемый.ПриДобавленииПодсистем(ОписаниеПодсистем);
	
КонецПроцедуры    

Функция ПолучитьМассивИННОрганизаций() Экспорт
	Возврат CW_БухгалтерияЭкспедитораСерверПереопределяемый.ПолучитьМассивИННОрганизаций();
КонецФункции   

Функция ПолучитьИмяФормыБанковскиеВыписки() Экспорт
	Возврат CW_БухгалтерияЭкспедитораСерверПереопределяемый.ПолучитьИмяФормыБанковскиеВыписки();
КонецФункции   

Функция СведенияОЮрФизЛице(ЮрФизЛицо, ДатаСреза) Экспорт
	Возврат CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(ЮрФизЛицо, ДатаСреза);	
КонецФункции      

Функция ПолучитьЗначениеНациональнойВалюты() Экспорт
	Возврат CW_БухгалтерияЭкспедитораСерверПереопределяемый.ПолучитьЗначениеНациональнойВалюты();
КонецФункции
 
Функция ПолучитьУпрощенныеСистемыНалогообложения() Экспорт
	Возврат CW_БухгалтерияЭкспедитораСерверПереопределяемый.ПолучитьУпрощенныеСистемыНалогообложения();
КонецФункции

Функция ПолучитьСистемуНалогообложения(Знач Организация, Знач Период=Неопределено) Экспорт 
	Возврат CW_БухгалтерияЭкспедитораСерверПереопределяемый.ПолучитьСистемуНалогообложения(Организация, Период);
КонецФункции  

Функция ПолучитьНДСДляУСН(Знач Организация, Знач Период=Неопределено) Экспорт
	Возврат CW_БухгалтерияЭкспедитораСерверПереопределяемый.ПолучитьНДСДляУСН(Организация, Период);
КонецФункции

Функция ПолучитьПараметрыУчета() Экспорт
	Возврат CW_БухгалтерияЭкспедитораСерверПереопределяемый.ПолучитьПараметрыУчета();
КонецФункции

Функция ПолучитьДоступныеСервисы() Экспорт  
	
	ДоступныеСервисы = Новый Структура;
	ДоступныеСервисы.Вставить("ЛичныйКабинет", 		Ложь);
	ДоступныеСервисы.Вставить("РеестрыНДС0", 		Ложь);
	ДоступныеСервисы.Вставить("ДоходыНерезидентов", Ложь);
	
	CW_БухгалтерияЭкспедитораСерверПереопределяемый.ЗаполнитьДоступныеСервисы(ДоступныеСервисы); 
	
	Возврат ДоступныеСервисы;

КонецФункции

Процедура СоздатьДокументыСчетФактураВыданныйСВидомНалоговыйАгент(Объект) ЭКспорт
	
	CW_БухгалтерияЭкспедитораСерверПереопределяемый.СоздатьДокументыСчетФактураВыданныйСВидомНалоговыйАгент(Объект);
	
КонецПроцедуры



Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	CW_РегистрацияПрограммыСервер.УстановитьРасширенныеНастройкиМодуля();
	
	Форма.РекомендуемаяВерсияБП 	= CW_ВерсииПодсистемСервер.РекомендуемаяВерсияБухгалтерияПредприятия();
	Форма.ТекущаяВерсияБП			= CW_ВерсииПодсистемСервер.ТекущаяВерсияБухгалтерияПредприятия();
	
	Форма.АдресРезультатаПроверкиОбновлений 	= ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
	Форма.ВыполнитьПроверкуНаличияОбновлений 	= CW_ОбновлениеКонфигурацииСервер.ВыполнитьПроверкуНаличияОбновлений();
	Форма.СоответствуетТиповойБухгалтерии 		= CW_ВерсииПодсистемСервер.ПроверитьСоответствиеВерсийТиповойБухгалтерии();
	
	Форма.ЭтоПервыйЗапуск	= CW_ВерсииПодсистемСервер.ЭтоПервыйЗапуск(); 
	Если НЕ Форма.ЭтоПервыйЗапуск Тогда
		//Если не первый запуск, то проверяем необходимость обновления;	
		Форма.ТребуетсяОбновление	= CW_ВерсииПодсистемСервер.ТребуетсяОбновлениеПодсистем();
	КонецЕсли;  
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ПолучитьШаблоныТекстовHTTPЗапросов(Результат) Экспорт  
	
	//БЭ
	Результат.Вставить("af_emailaddress",		"/%1/hs/af/emailaddress"); 
	Результат.Вставить("af_subscriptionissued",	"/%1/hs/af/subscriptionissued");     
	Результат.Вставить("af_checkpartnerscode",	"/%1/hs/af/checkpartnerscode");
	Результат.Вставить("af_autoinvoice",		"/%1/hs/af/autoinvoice");   
	Результат.Вставить("af_checkcontractors",	"/%1/hs/af/checkcontractors");   
	
	//Обновление конфигуарции
	Результат.Вставить("af_subscription",		"/%1/hs/af/subscription"); 
	
	
КонецПроцедуры

Процедура ВключитьРабочийСтолБухгалтерияЭкспедитора() Экспорт
	
	Пользователь 		= ПользователиИнформационнойБазы.ТекущийПользователь();
	ХранилищеНастроек 	= ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы", "",, Пользователь.Имя);

	Если ХранилищеНастроек = Неопределено Тогда
		ХранилищеНастроек = Новый НастройкиНачальнойСтраницы;
		СоставФорм = Новый СоставФормНачальнойСтраницы;
	Иначе
		СоставФорм = ХранилищеНастроек.ПолучитьСоставФорм();
		СоставФорм.ЛеваяКолонка.Очистить();
	КонецЕсли; 
	
	ИмяФормыРабочегоСтола = ИмяФормыРабочийСтолБухгалтерияЭкспедитора();
	
	СоставФорм.ЛеваяКолонка.Добавить(ИмяФормыРабочегоСтола);

	ХранилищеНастроек.УстановитьСоставФорм(СоставФорм);
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", ХранилищеНастроек,, Пользователь.Имя);
	
КонецПроцедуры

Процедура ОтключитьРабочийСтолБухгалтерияЭкспедитора()Экспорт
	
	ИмяФормыРабочегоСтола = ИмяФормыРабочийСтолБухгалтерияЭкспедитора();
	
	ХранилищеНастроек = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы");
	Если ХранилищеНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СоставФорм = ХранилищеНастроек.ПолучитьСоставФорм();
	
	ИндексФормы = СоставФорм.ЛеваяКолонка.Найти(ИмяФормыРабочегоСтола);
	Если ИндексФормы <> Неопределено Тогда
		СоставФорм.ЛеваяКолонка.Удалить(ИндексФормы);
	КонецЕсли;
	ИндексФормы = СоставФорм.ПраваяКолонка.Найти(ИмяФормыРабочегоСтола);
	Если ИндексФормы <> Неопределено Тогда
		СоставФорм.ПраваяКолонка.Удалить(ИндексФормы);
	КонецЕсли;
	
	ХранилищеНастроек.УстановитьСоставФорм(СоставФорм);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", ХранилищеНастроек);
	
КонецПроцедуры

Процедура ВключитьНачальнуюСтраницуБухгалтерияПредприятия() Экспорт

	Пользователь 		= ПользователиИнформационнойБазы.ТекущийПользователь();
	ХранилищеНастроек 	= ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы", "",, Пользователь.Имя);

	Если ХранилищеНастроек = Неопределено Тогда
		ХранилищеНастроек = Новый НастройкиНачальнойСтраницы;
		СоставФорм = Новый СоставФормНачальнойСтраницы;
	Иначе
		СоставФорм = ХранилищеНастроек.ПолучитьСоставФорм();
		СоставФорм.ЛеваяКолонка.Очистить();
		СоставФорм.ПраваяКолонка.Очистить();
	КонецЕсли; 
	
	ИмяФормыЛеваяКолонка  = "ОбщаяФорма.ИнформационнаяПанель";
	ИмяФормыПраваяКолонка = "Обработка.ИнформационныйЦентр.Форма.ИнформационныйЦентр";
	
	СоставФорм.ЛеваяКолонка.Добавить(ИмяФормыЛеваяКолонка);
  	СоставФорм.ПраваяКолонка.Добавить(ИмяФормыПраваяКолонка);

	ХранилищеНастроек.УстановитьСоставФорм(СоставФорм);
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", ХранилищеНастроек,, Пользователь.Имя);
	
КонецПроцедуры

Функция ИмяФормыРабочийСтолБухгалтерияЭкспедитора() Экспорт

	Возврат "Обработка.CW_РабочийСтол_БЭ.Форма.ФормаУправляемая";
	
КонецФункции  

Функция ПроверитьНаличиеПодписки(Знач РегистрационныйНомер, Знач ИмяПрограммногоПродукта) Экспорт
	
	Возврат CW_БухгалтерияЭкспедитораСерверПовторноеИспользование.ПроверитьНаличиеПодписки(РегистрационныйНомер, ИмяПрограммногоПродукта);
	
КонецФункции


Процедура CW_ОпределитьВозможностьОткрытияФормыОбъектаОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);   
	
	МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипИсточника);  
	Если Не СтрНачинаетсяС(МетаданныеОбъекта.Имя, "CW_") Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипИсточника = Тип("СправочникМенеджер.CW_Грузоперевозки") Тогда
		Если  Параметры.Свойство("Ключ") и
			ЗначениеЗаполнено(Параметры.Ключ) Тогда
			
			Грузоперевозка = Параметры.Ключ;
		КонецЕсли;
	КонецЕсли;		
	
	Отказ = Ложь;
	CW_Документы.ОпределитьВозможностьОткрытияОбъектаМодуля(ТипИсточника, Грузоперевозка, Отказ);
	
КонецПроцедуры  

Процедура УстановитьОбщиеПараметрыПроведенияДокументов() Экспорт
	
	CW_ПроверкаЛицензии.УстановитьОбщиеПараметрыМодуля();  
	
КонецПроцедуры


