
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступенПереходКСостояниюПубликации = ТорговыеПредложения.ПравоНастройкиТорговыхПредложений(Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СостояниеПубликации", "Видимость", 
		ДоступенПереходКСостояниюПубликации);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КнопкаПереходБизнесСеть", "Видимость", 
		ДоступенПереходКСостояниюПубликации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСписокПубликаций(Команда)
	ТорговыеПредложенияКлиент.ОткрытьФормуСпискаПубликаций();
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПубликации(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ПрайсЛист", ТекущиеДанные.Ссылка);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОчиститьСообщения();
	
	ПараметрыОткрытияФормы = ТорговыеПредложенияКлиент.ПараметрыОткрытияФормы();
	
	ПараметрыОткрытияФормы.ПараметрыФормы = ПараметрыФормы;
	ПараметрыОткрытияФормы.ВладелецФормы  = ЭтотОбъект;
	
	ТорговыеПредложенияКлиент.ОткрытьФормуСостоянияПубликацииТоваров(ПараметрыОткрытияФормы);
	
КонецПроцедуры

#КонецОбласти