
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимВыбораИзБиблиотеки = Истина;
	
	ЗаполнитьСписокКартинок();
	
	УстановитьТекущуюСтраницу();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКартинок()
	
	времСписокБиблиотекаКартинок = CW_ЛогистическиеСтатусыСерверПовторноеИспользование.ПолучитьСписокКартинокКонфигурации();
	
	СписокБиблиотекаКартинок.Очистить();
	Для каждого ЭлементСписка Из времСписокБиблиотекаКартинок Цикл
		Если СтрНачинаетсяС(Строка(ЭлементСписка.Значение),"CW_") Тогда
			СписокБиблиотекаКартинок.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, Ложь, ЭлементСписка.Картинка);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокБиблиотекаКартинокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокБиблиотекаКартинок.ТекущиеДанные;
	АдресКартинкиИзБиблиотеки = СписокБиблиотекаКартинокПриАктивизацииСтрокиНаСервере(ТекущиеДанные.Значение, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокБиблиотекаКартинокПриАктивизацииСтрокиНаСервере(ИмяКартинки, УникальныйИдентификатор)

	ДвоичныеДанные = БиблиотекаКартинок[ИмяКартинки].ПолучитьДвоичныеДанные();
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогОткрытияФайла.ПолноеИмяФайла 		= "";
	Фильтр 									= "PNG|*.png|GIF|*.gif|BMP|*.bmp";
	ДиалогОткрытияФайла.Фильтр 				= Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор 	= Ложь;
	ДиалогОткрытияФайла.Заголовок 			= "Выберите файл";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ИмяФайла 		= ДиалогОткрытияФайла.ПолноеИмяФайла;
		
		ВыбранныйФайл 	= Новый Файл(ИмяФайла);
		Если Не ВыбранныйФайл.Существует() Тогда
			ПоказатьПредупреждение(,"Файл не найден!");
			Возврат;
		КонецЕсли;
		
		АдресФайла = "";
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикОкончанияПомещения",ЭтотОбъект); 
		
		НачатьПомещениеФайла(ОписаниеОповещения,АдресФайла,ИмяФайла,Ложь,УникальныйИдентификатор);
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Файл не выбран!'; en = 'File not selected!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОкончанияПомещения(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
        АдресКартинкиИзИзФайла = Адрес;
	Иначе
		Сообщить("Файл не был помещен.");
	КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ВыполнитьВыборКартинки();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимВыбораПриИзменении(Элемент)
	
	УстановитьТекущуюСтраницу();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтраницу()
	
	Если РежимВыбораИзБиблиотеки Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ВыборИзБиблиотекаКартинок;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ВыборИзФайла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокБиблиотекаКартинокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыполнитьВыборКартинки();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьВыборКартинки()
	
	Перем АдресКартинки;
	
	Если РежимВыбораИзБиблиотеки Тогда
		АдресКартинки = АдресКартинкиИзБиблиотеки;
	Иначе
		АдресКартинки = АдресКартинкиИзИзФайла; 
	КонецЕсли;
	
	ЭтаФорма.Закрыть(АдресКартинки);

КонецПроцедуры
