
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресИсточникаНастроек = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("CW_СхемаЖурналаГрузоперевозок"),ЭтаФорма.УникальныйИдентификатор);
	НастройкиУО = Неопределено;
	АдресУО = Параметры.АдресУО;
	Если (АдресУО <> "") Тогда
		НастройкиУО = ПолучитьИзВременногоХранилища(АдресУО);
	КонецЕсли; 
	Если (НастройкиУО = Неопределено) Тогда
		НастройкиУО = КомпоновщикНастроек.Настройки;
	КонецЕсли; 
	
	АдресНастроек = ПоместитьВоВременноеХранилище(НастройкиУО,ЭтаФорма.УникальныйИдентификатор);
	// --- 
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресИсточникаНастроек));
	КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(АдресНастроек));
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ЭтаФорма.Закрыть(ПоместитьВоВременноеХранилище(КомпоновщикНастроек.Настройки,АдресУО));
	
КонецПроцедуры
