#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМассиивДоступныхСтатусовГруппыПользователя(ГруппаПользователя, мСтатусыОбъектаМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоступностьСтатусовПоГруппамПользователей.СтатусДокумента.Код КАК Код,
	               |	CW_ДоступностьСтатусовПоГруппамПользователей.СтатусДокумента КАК СтатусДокумента
	               |ИЗ
	               |	РегистрСведений.CW_ДоступностьСтатусовПоГруппамПользователей КАК CW_ДоступностьСтатусовПоГруппамПользователей
	               |ГДЕ
	               |	CW_ДоступностьСтатусовПоГруппамПользователей.ГруппаПользователя = &ГруппаПользователя
	               |	И CW_ДоступностьСтатусовПоГруппамПользователей.СтатусДокумента В(&мСтатусыОбъектаМетаданных)
	               |УПОРЯДОЧИТЬ ПО
	               |	Код";
	
	Запрос.УстановитьПараметр("ГруппаПользователя", 		ГруппаПользователя);
	Запрос.УстановитьПараметр("мСтатусыОбъектаМетаданных", 	мСтатусыОбъектаМетаданных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.СтатусДокумента);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли