
Процедура ПриЗаписи(Отказ)
	
	Если ЭтоНовый() 
		и ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбновитьПовторноИспользуемыеЗначения")  Тогда
		ОбновитьПовторноИспользуемыеЗначения(); 	
	КонецЕсли; 
	
	Если ПометкаУдаления и ЗначениеЗаполнено(ПредопределеннаяФункция) Тогда
		ВызватьИсключение "Нельзя удалять предпоределенный элемент!";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)  
	
	Если ЗначениеЗаполнено(ПредопределеннаяФункция) Тогда
		ВызватьИсключение "Нельзя удалять предпоределенный элемент!";
	КонецЕсли;  
	
КонецПроцедуры


