
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПустойМакет = Ложь;
	Если Параметры.Ключ.Пустая() тогда    
		Если Не ЗначениеЗаполнено(Объект.ПериодОтчета) Тогда
			Объект.ПериодОтчета = НачалоКвартала(ТекущаяДата()); 
		Конецесли;
		УстановитьПустойМакет = Истина;
	Конецесли;   
	
	СтруктураРаскраски = Новый Структура;
	СтруктураРаскраски.Вставить("_0", Новый Цвет(255, 255, 192)); //Разрешено
	СтруктураРаскраски.Вставить("_1", Новый Цвет(255, 255, 255)); //Запрещено

	мСтруктураЦветовРаскраски = Новый ФиксированнаяСтруктура(СтруктураРаскраски); 
	
	ИсключитьПустоеЗначение = Новый Массив;
	ИсключитьПустоеЗначение.Добавить("");
	ТаблицаКодовОпераций0.Загрузить(УчетНДС.КлассификаторКодовОперацийПоСтавке0(Объект.ПериодОтчета,,ИсключитьПустоеЗначение));
	
	ЗаполнитьДанныеФормыПриложения();
	
	Если УстановитьПустойМакет тогда     
		Макет = CW_РеестрыНДС0Дополнительный.ПолучитьМакетПоИмени(ИмяМакета);
		ТабличныйДокумент = CW_РеестрыНДС0Дополнительный.ПолучитьНачальныйТабличныйДокумент(Макет, СтруктураПриложения);
	Конецесли;     
	
	Для Каждого Область из ТабличныйДокумент.Области Цикл
		УстановитьДоступностьОбласти(Область.Имя);
	КонецЦикла;
	
	УстановитьТребованиеЗаполнения();
		
	CW_РеестрыНДС0Дополнительный.ЗаполнитьТЗВыбора(ТЗВыбора, Объект.ПриложениеПриказа, ЗаголовокВыбора);
	
	ЗаполнитьДеревоФайлов();

	СоответствиеПриложенияИмениФормыОтчета = CW_РеестрыНДС0Дополнительный.ПолучитьСоответствиеПриложенияИмениФормыОтчета();
	ИмяФОрмыОтчета = СоответствиеПриложенияИмениФормыОтчета.Получить(Объект.ПриложениеПриказа);
	
	УстановитьНадписьПредупреждения();
	УстановитьПредставлениеПериода(); 
	УстановитьДоступностьКомандыЗаполнить();     
	
	ПредыдущийДокументРеализации 	= Объект.ДокументРеализации;
	ПредыдущийДокументДоходов 		= Объект.ДокументДоходов;
	
	ПоказатьСкрытьФайлыНаСервере();
	
	УстановитьЗаголовокФормы(Параметры.Ключ.Пустая());  
	
	УстановитьСостояниеОбъекта();
	
	ЗапретАвтоматическогоУдаленияПриИзмененииНаСервере();
	
КонецПроцедуры    

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ВремТабличныйДокумент = ТекущийОбъект.ДанныеПриложенияТабличныйДокумент.Получить();	

	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(ВремТабличныйДокумент);
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьСостояниеОбъекта()
	
	ИндексКартинкиРучноеРедактирование = ?(Объект.РучноеРедактирование, 9, 0);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьЗаголовокФормы();

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы(ЭтоНовый=Ложь)
	
	Заголовок = "Реестр по НДС: "+ СокрЛП(Объект.ПриложениеПриказа)+" ("+СокрЛП(Объект.ПриложениеРеестра)+")" + " за " + Формат(Объект.ПериодОтчета,"ДФ='к ""квартал"" гггг ""г.""'") + " (" + СокрЛП(Объект.Приказ) + ") " + ?(ЭтоНовый," - создание","");

КонецПроцедуры  

&НаСервере
Функция ЗаполнитьДанныеФормыПриложения()
	
	//Нужно перезаполнить данные прилдожения
	СоответствиеПриложенияИмениМакета = CW_РеестрыНДС0Дополнительный.ПолучитьСоответствиеПриложенияИмениМакета(Объект.Приказ);
	ИмяМакета = СоответствиеПриложенияИмениМакета.Получить(Объект.ПриложениеПриказа); 
	
	Если Не ПустаяСтрока(ИмяМакета) Тогда
		УстановитьСтруктуруПриложения();
	КонецЕсли;
	
	Возврат Не ПустаяСтрока(ИмяМакета);
		
КонецФункции    

&НаСервере
Функция ПолучитьПриложениеПриказа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений КАК CW_РеестрыНДС0ЯчейкиПриложений
	               |ГДЕ
	               |	CW_РеестрыНДС0ЯчейкиПриложений.ЭтоГруппа = ИСТИНА
	               |	И CW_РеестрыНДС0ЯчейкиПриложений.Родитель = &Приказ
	               |	И CW_РеестрыНДС0ЯчейкиПриложений.ПриложениеПоВидуТранспорта = &ВидТранспорта";
	
	Запрос.УстановитьПараметр("Приказ",  		Объект.Приказ);
	Запрос.УстановитьПараметр("ВидТранспорта",  Объект.ПриложениеРеестра);  
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции


&НаСервере
Процедура СформироватьМногострочныеЧастиТабличногоДокумента(Макет, ВремТабличныйДокумент, СтрокиДерева, ИмяГруппы,  Координаты = "")
	
	Если НЕ СтруктураПриложения.Свойство(ИмяГруппы) Тогда
		Возврат;
	КонецЕсли;   
	
	НачИндекс = "_1";
	
	мКоординаты = СтрРазделить(Координаты, "_"); 
	НачКоординаты = "";
	Для Индекст = 0 по мКоординаты.ВГраница() Цикл
		НачКоординаты = НачКоординаты +"_1";
	КонецЦикла;
	
	СтруктураОтбора = новый Структура;
	СтруктураОтбора.Вставить("МногострочнаяЧасть", ИмяГруппы);
	
	мСтрокиДерева = СтрокиДерева.НайтиСтроки(СтруктураОтбора); 
	Для Индекс = 0  по мСтрокиДерева.ВГраница() Цикл  
		
		СтрокаДерева 			= мСтрокиДерева.Получить(Индекс);
		НовИндекс 				= СтрокаСИндексомПоказателя(Индекс+1);
		ОбластьМногострочная 	= Макет.ПолучитьОбласть("МногострочнаяЧасть"+ИмяГруппы);   
		
		МассивИменГраф = СтруктураПриложения[ИмяГруппы]["Графы"];
		Для каждого ИмяГрафы Из МассивИменГраф Цикл 
			
			Для Каждого ОбластьЯчейки из ОбластьМногострочная.Области Цикл
				Если СтрНачинаетсяС(ОбластьЯчейки.Имя, ИмяГрафы) Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			НовИмяОбл = ИмяГрафы + Координаты + НовИндекс;
			ОбластьЯчейки.Имя 		= НовИмяОбл;
			ОбластьЯчейки.Значение  = СтрокаДерева.Данные[НовИмяОбл];
		КонецЦикла;
		
		//область "Удалить строку"  
		Для Каждого ВремОбласть из ОбластьМногострочная.Области Цикл
			Если СтрНачинаетсяС(ВремОбласть.Имя, "УдалитьСтроку" + ИмяГруппы) Тогда  
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		
		ВремОбласть.Имя = "УдалитьСтроку"+ ИмяГруппы + Координаты + НовИндекс;   
		Если Индекс = 0 Тогда
			ВремОбласть.Гиперссылка = Ложь;	
			ВремОбласть.Текст = "";	
		КонецЕсли;
		
		//область "Удалить строку"  
		
		ВремТабличныйДокумент.Вывести(ОбластьМногострочная);

		// Заполнение данными из строк многострочных частей, подчиненных текущей строке многострочной части.
		ДанныеМногострочныхЧастей = Новый Структура;
		ИменаПодчГрупп = СтруктураПриложения[ИмяГруппы]["ИменаПодчиненныхГрупп"];
		Для каждого ИмяПодчГруппы Из ИменаПодчГрупп Цикл 
			СформироватьМногострочныеЧастиТабличногоДокумента(Макет, ВремТабличныйДокумент,  СтрокаДерева.Строки, ИмяПодчГруппы,  Координаты + НовИндекс);
		КонецЦикла;
		
	КонецЦикла;    
	
	//Добавление строк
	НовПостфикс = ИмяГруппы + Координаты + НовИндекс;
	
	ОбластьДобавлениеСтроки = ПолучитьОбластьПоЧастиИмени("ДобавлениеСтроки" + ИмяГруппы, Макет, Истина);
	
	ВремОбласть = ПолучитьОбластьПоЧастиИмени("ДобавлениеСтроки" + ИмяГруппы, ОбластьДобавлениеСтроки);
	ВремОбласть.Имя = "ДобавлениеСтроки"+НовПостфикс;   
	
	
	ВремОбласть = ПолучитьОбластьПоЧастиИмени("ДобавитьСтрокуЗначок" + ИмяГруппы, ОбластьДобавлениеСтроки);
	ВремОбласть.Имя = "ДобавитьСтрокуЗначок" + НовПостфикс; 
	
	ВремОбласть = ПолучитьОбластьПоЧастиИмени("ДобавитьСтроку" + ИмяГруппы, ОбластьДобавлениеСтроки);
	ВремОбласть.Имя	= "ДобавитьСтроку" + НовПостфикс; 
	
	ВремТабличныйДокумент.Вывести(ОбластьДобавлениеСтроки);
	//Добавление строк
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбластьПоЧастиИмени(Знач ИмяОбласти, Знач Макет, НужноПолучитьОбласть = Ложь)
	
	Для Каждого ВремОбласть из Макет.Области Цикл
		Если СтрНачинаетсяС(ВремОбласть.Имя, ИмяОбласти) Тогда   
			Если НужноПолучитьОбласть Тогда
				Возврат  Макет.ПолучитьОбласть(ВремОбласть.Имя);
			КонецЕсли;	
			Прервать;
		КонецЕсли;
	КонецЦикла;   
	
	Возврат ВремОбласть;
		
КонецФункции



&НаКлиенте
Процедура ПоказатьФайлы(Команда)

	ПоказатьФайлы = не ПоказатьФайлы;
	ПоказатьСкрытьФайлыНаСервере();

КонецПроцедуры



&НаСервере
Процедура ПоказатьСкрытьФайлыНаСервере()
	
	Элементы.ФормаПоказатьФайлы.Пометка = ПоказатьФайлы;
	Элементы.ГруппаФайлы.Видимость 		= ПоказатьФайлы
	
КонецПроцедуры



&НаСервере
Процедура УстановитьНадписьПредупреждения()
	
	Элементы.ГруппаПредупреждение.Видимость = Объект.ТребуетсяЗаполнение
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеПериода()
	
	ПериодОтчетаСтрока = Формат(Объект.ПериодОтчета,"ДФ='к ""квартал"" гггг ""г.""'");
	
КонецПроцедуры

&НаКлиенте
Процедура КвраталНазад(Команда)   
	
	ПередИзменениемПериода("НАЗАД");
	
КонецПроцедуры

&НаКлиенте
Процедура КварталВперед(Команда)

	ПередИзменениемПериода("ВПЕРЕД");
	
КонецПроцедуры  

&НаКлиенте
Процедура ПередИзменениемПериода(Направление) 
	
	Если Направление = "НАЗАД" Тогда
		НовыйПериодОтчета = НачалоКвартала(Объект.ПериодОтчета) - 1;
	ИначеЕсли Направление = "ВПЕРЕД" Тогда
		НовыйПериодОтчета = КонецКвартала(Объект.ПериодОтчета) + 1;
	КонецЕсли;
	
	ДействующиеПриказы = CW_РеестрыНДС0СерверВызовСервера.ПолучитьДействующиеПриказы();  
	ТекущийПриказ = ДействующиеПриказы.Получить(Объект.ПриложениеРеестра);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПериодОтчета", 	НачалоКвартала(НовыйПериодОтчета));
	ДополнительныеПараметры.Вставить("ТекущийПриказ", 	ТекущийПриказ);
	ДополнительныеПараметры.Вставить("ИзменилсяПриказ", (ТекущийПриказ <> Объект.Приказ));
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеПериода", ЭтотОбъект, ДополнительныеПараметры);
	
	Если ТекущийПриказ <> Объект.Приказ Тогда   
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Внимание!
		|Изменился формат записей для предоставления сведений. 
		|Данные записи потребуют повторного перезаполнения.
		|Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПродолжитьИзменениеПериода(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

   ПродолжитьИзменениеПериодаНаСервере(ДополнительныеПараметры) 

КонецПроцедуры

&НаСервере
Процедура ПродолжитьИзменениеПериодаНаСервере(ДополнительныеПараметры) 
	
	Объект.ПериодОтчета = ДополнительныеПараметры.ПериодОтчета;
	УстановитьПредставлениеПериода(); 
	
	Если ДополнительныеПараметры.ИзменилсяПриказ Тогда
		ЗавершитьИзменениеПериодаНаСервере(ДополнительныеПараметры);
	КонецЕсли;
	
	УстановитьЗаголовокФормы();

КонецПроцедуры

&НаСервере
Процедура ЗавершитьИзменениеПериодаНаСервере(ДополнительныеПараметры)
	
	Объект.Приказ 				= ДополнительныеПараметры.ТекущийПриказ;
	Объект.ПриложениеПриказа 	= ПолучитьПриложениеПриказа();
	
	ФормированиеВозможно = CW_РеестрыНДС0Дополнительный.ПриказДоступенДляФормирования(Объект.Приказ);
	
	Если ФормированиеВозможно Тогда
		Результат = ЗаполнитьДанныеФормыПриложения();
		Если Результат Тогда
			ОбработатьИзменениеДокументов(); 
		Иначе   
			ТабличныйДокумент.Очистить();
			ВызватьИсключение "За указанынй период отсутствует редакция отчета!";
		КонецЕсли;  
	Иначе
		ВызватьИсключение "За указанынй период формирование записей реестров НДС 0% временно недоступно!";
	Конецесли;   
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтруктуруПриложения()
	
	Структура = CW_РеестрыНДС0Дополнительный.ПолучитьСтруктуруПриложения(Объект.ПриложениеПриказа);
	Если Структура = Неопределено Тогда
		ВызватьИсключение "Не удалось получить структуру приложения!";
	КонецЕсли;
	
	СтруктураПриложения = новый ФиксированнаяСтруктура(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	// ПроцессыОбработкиДокументов
	Если Элементы.ТабличныйДокумент.Защита Тогда
		Возврат;
	КонецЕсли;
	// ПроцессыОбработкиДокументов  
	
	мГрафыСтран 	= ПолучитьМассивГрафДляВыбораСтраны();
	мГрафыТЗВыбора 	= ПолучитьМассивГрафДляВыбораИзТЗВыбора();
    мГрафыАдрес		= ПолучитьМассивГрафДляВыбораАдреса(); 
    мГрафыФизЛицо	= ПолучитьМассивГрафДляВыбораФизЛица(); 
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") = 1 И Область.Текст <> "" Тогда
		ДобавитьСтроку();
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") = 1 И Область.Текст <> "" Тогда
		УдалитьСтроку();
	КонецЕсли;
	
	Если мГрафыСтран.Найти(Лев(Область.Имя, 8)) <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		ФормаВыбора = ПолучитьФорму("Справочник.СтраныМира.ФормаВыбора", Новый Структура("РежимВыбора", Истина), ЭтаФорма);
		ФормаВыбора.Заголовок = "Выбор кода страны";   
		
		Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение12")	Тогда
			Постфикс = Сред(Область.Имя, 9);
			Если Лев(Область.Имя, 7) = "П100004" Тогда 
				Область		= ТабличныйДокумент.Области["П1000041" + Постфикс];
				ОбластьНаим	= ТабличныйДокумент.Области["П1000042" + Постфикс];
			Иначе
				Область  	 = ТабличныйДокумент.Области["П1000051" + Постфикс];
				ОбластьНаим  = ТабличныйДокумент.Области["П1000052" + Постфикс];
			КонецЕсли;
		КонецЕсли;

		ДополнительныеПараметры = Новый Структура("Область,ОбластьНаим", Область, ОбластьНаим);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСтраны", ЭтотОбъект, ДополнительныеПараметры);
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.Открыть();
		
	ИначеЕсли мГрафыТЗВыбора.Найти(Лев(Область.Имя, 8)) <> Неопределено Тогда 
		
		КодПоказателя = Лев(Область.Имя, 8);     
		
		ВвестиПоказатель(Элемент, Область, КодПоказателя, Ложь, ЗаголовокВыбора, ТЗВыбора, СтандартнаяОбработка);   
		
	ИначеЕсли  мГрафыФизЛицо.Найти(Лев(Область.Имя, 8)) <> Неопределено Тогда 
		
		СтандартнаяОбработка = Ложь;
		Область.Значение = ?(ЗначениеЗаполнено(Область.Значение), "", "V");
		Модифицированность = Истина;
		
		
	ИначеЕсли мГрафыАдрес.Найти(Лев(Область.Имя, 8)) <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		РоссийскийАдрес = Новый Соответствие;
		
		РоссийскийАдрес.Вставить("Индекс",          "");
		РоссийскийАдрес.Вставить("Регион",          "");
		РоссийскийАдрес.Вставить("КодРегиона",      "");
		РоссийскийАдрес.Вставить("Район",           "");
		РоссийскийАдрес.Вставить("Город",           "");
		РоссийскийАдрес.Вставить("НаселенныйПункт", "");
		РоссийскийАдрес.Вставить("Улица",           "");
		РоссийскийАдрес.Вставить("Дом",             "");
		РоссийскийАдрес.Вставить("Корпус",          "");
		РоссийскийАдрес.Вставить("Квартира",        "");
		
		Если Регионы.Количество() = 0 Тогда
			ЗаполнитьРегионыНаСервере();
		КонецЕсли;
		
		Регион = Регионы.НайтиСтроки(Новый Структура("Код", СокрЛП(РоссийскийАдрес["Регион"])));
			
		Если Регион.Количество() > 0 Тогда
			
			РоссийскийАдрес["Регион"] = Регион[0].Наим;
			
		КонецЕсли;
		
		ЗначенияПолей = Новый СписокЗначений;
		
		ЗначенияПолей.Добавить(РоссийскийАдрес["Индекс"],          "Индекс");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Регион"],          "Регион");
		ЗначенияПолей.Добавить(РоссийскийАдрес["КодРегиона"],      "КодРегиона");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Район"],           "Район");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Город"],           "Город");
		ЗначенияПолей.Добавить(РоссийскийАдрес["НаселенныйПункт"], "НаселенныйПункт");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Улица"],           "Улица");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Дом"],             "Дом");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Корпус"],          "Корпус");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Квартира"],        "Квартира");
		
		ПредставлениеАдреса = РегламентированнаяОтчетностьКлиентСервер.ПредставлениеАдресаВФормате9Запятых("643," + РоссийскийАдрес["Индекс"] + ","
																												  + РоссийскийАдрес["Регион"] + ","
																												  + РоссийскийАдрес["Район"] + ","
																												  + РоссийскийАдрес["Город"] + ","
																												  + РоссийскийАдрес["НаселенныйПункт"] + ","
																												  + РоссийскийАдрес["Улица"] + ","
																												  + РоссийскийАдрес["Дом"] + ","
																												  + РоссийскийАдрес["Корпус"] + ","
																												  + РоссийскийАдрес["Квартира"]);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок",               "Ввод адреса");
		ПараметрыФормы.Вставить("ЗначенияПолей", 		   ЗначенияПолей);
		ПараметрыФормы.Вставить("Представление", 		   ПредставлениеАдреса);
		ПараметрыФормы.Вставить("ВидКонтактнойИнформации", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента"));

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("РоссийскийАдрес", РоссийскийАдрес);
		
		ТипЗначения = Тип("ОписаниеОповещения");
		ПараметрыКонструктора = Новый Массив(3);
		ПараметрыКонструктора[0] = "ОткрытьФормуКонтактнойИнформацииЗавершение";
		ПараметрыКонструктора[1] = ЭтаФорма;
		ПараметрыКонструктора[2] = ДополнительныеПараметры;
		
		Оповещение = Новый (ТипЗначения, ПараметрыКонструктора);
		
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент").ОткрытьФормуКонтактнойИнформации(ПараметрыФормы, , Оповещение);
		
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьОбласти(Знач ОбластьИмя)
	
	Область = ТабличныйДокумент.Области[ОбластьИмя];
		 
	ПриложенияРеестра = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений;
	
	Если Объект.ПриложениеПриказа = ПриложенияРеестра.РеестрНДС2024Кв2_Приложение07	
		ИЛИ Объект.ПриложениеПриказа = ПриложенияРеестра.РеестрНДС2021Кв2_Приложение08 Тогда	

		Если СтрНачинаетсяС(Область.Имя, "П1000004")  Тогда
			
			КодНаправления 	= СокрЛП(Область.Значение);
			ИндексСтр 		= Сред(Область.Имя, 9);  
			
			Обл_СтранПогр  = ТабличныйДокумент.Области["П1000018" + ИндексСтр];
			Обл_СтранРазгр = ТабличныйДокумент.Области["П1000019" + ИндексСтр];
			
			Если КодНаправления = "A" Тогда
				РазрешитьВводДанныхВОбласть(мСтруктураЦветовРаскраски, Обл_СтранПогр);
				ЗапретитьВводДанныхВОбласть(мСтруктураЦветовРаскраски, Обл_СтранРазгр);
			ИначеЕсли КодНаправления = "D" Тогда
				РазрешитьВводДанныхВОбласть(мСтруктураЦветовРаскраски, Обл_СтранРазгр);
				ЗапретитьВводДанныхВОбласть(мСтруктураЦветовРаскраски, Обл_СтранПогр);
			Иначе
				РазрешитьВводДанныхВОбласть(мСтруктураЦветовРаскраски, Обл_СтранПогр);
				РазрешитьВводДанныхВОбласть(мСтруктураЦветовРаскраски, Обл_СтранРазгр);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РазрешитьВводДанныхВОбласть(мСтруктураЦветовРаскраски, ОбрабОбласть)
	
	ЦветОбластиРучногоВвода = мСтруктураЦветовРаскраски["_0"];
	
	ОбрабОбласть.Защита = Ложь;
	ОбрабОбласть.ЦветФона = ЦветОбластиРучногоВвода;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ЗапретитьВводДанныхВОбласть(мСтруктураЦветовРаскраски, ОбрабОбласть)
	
	ЦветНедоступнойОбласти = мСтруктураЦветовРаскраски["_1"];
	
	ОбрабОбласть.Защита   = Истина;
	ОбрабОбласть.ЦветФона = ЦветНедоступнойОбласти;
	
	ТипЗначенияОбласти = ТипЗнч(ОбрабОбласть.Значение);
	Если ТипЗначенияОбласти = Тип("Число") Тогда
		ОбрабОбласть.Значение = 0;
	ИначеЕсли ТипЗначенияОбласти = Тип("Строка") Тогда
		ОбрабОбласть.Значение = "";
	Иначе
		ОбрабОбласть.Значение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьРегионыНаСервере()
	
	РегламентированнаяОтчетность.ЗаполнитьРегионы(Регионы);
	
КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьФормуКонтактнойИнформацииЗавершение(Результат, Параметры) Экспорт
	
	ОбновитьАдресВТабличномДокументе(Результат, Параметры.РоссийскийАдрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАдресВТабличномДокументе(Результат, РоссийскийАдрес)
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ТабличныйДокумент.ТекущаяОбласть.Значение = Результат.Представление;
		
	КонецЕсли; 
	
	УстановитьТребованиеЗаполнения();	
	
	Модифицированность = Истина;  
	
	
КонецПроцедуры


&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)

	// ПроцессыОбработкиДокументов
	Если Элементы.ТабличныйДокумент.Защита Тогда
		Возврат;
	КонецЕсли;
	// ПроцессыОбработкиДокументов
	
	Объект.РучноеРедактирование = Истина;

	РассчитатьНалоговуюБазу();   
	УстановитьДоступностьОбласти(Область.Имя);
	УстановитьТребованиеЗаполнения();
	УстановитьСостояниеОбъекта();
	
КонецПроцедуры

&НаКлиенте
Функция МногострочнаяЧастьТекущейОбласти(Знач ТекОбласть)
	
	Если ТекОбласть = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяОбласти = СтрЗаменить(ТекОбласть.Имя, "ДобавитьСтрокуЗначок", "");
	ИмяОбласти = СтрЗаменить(ИмяОбласти, "ДобавитьСтроку", "");
	ИмяОбласти = СтрЗаменить(ИмяОбласти, "УдалитьСтроку", "");
	
	ИмяГруппы = Лев(ИмяОбласти, 6);
	
	Для каждого ЭлемСтруктуры Из СтруктураПриложения Цикл
		Если ЭлемСтруктуры.Ключ = ИмяГруппы Тогда
			Возврат ИмяГруппы;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции


&НаКлиенте
Процедура ВвестиПоказатель(Элемент, Область, КодПоказателя, Знач ЭтоСумма, Знач ТекстВыбора, ТаблицаВыбора, СтандартнаяОбработка, КолонкаПоиска = "Код") Экспорт
	
	Если ТаблицаВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Область.Имя = КодПоказателя ИЛИ МногострочнаяЧастьТекущейОбласти(Область) <> Неопределено Тогда
		ИсходноеЗначение = ?(ТипЗнч(Область.Значение) = Тип("Строка"), СокрЛП(Область.Значение), Область.Значение);
	Иначе
		Разделитель = ?(Лев(Область.Имя, СтрДлина(КодПоказателя) + 1) = КодПоказателя + "_", "_", "");
		ИндексОбласти = 1;
		ИсходноеЗначение = "";
		Пока ЭтаФорма[ТекущийЭлемент.Имя].Области.Найти(КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")) <> Неопределено Цикл
			ИсходноеЗначение = ИсходноеЗначение + Строка(ЭтаФорма[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")].Значение);
			ИндексОбласти = ИндексОбласти + 1;
		КонецЦикла;
		ИсходноеЗначение = СокрЛП(ИсходноеЗначение);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          ТекстВыбора);
	ПараметрыФормы.Вставить("ТаблицаЗначений",    ТаблицаВыбора);
	ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура(КолонкаПоиска, ИсходноеЗначение));
	
	ДополнительныеПараметры = Новый Структура("ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель, Элемент", ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель, Элемент);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиПоказательЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказательЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ИндексОбласти 	= ДополнительныеПараметры.ИндексОбласти;
	КодПоказателя 	= ДополнительныеПараметры.КодПоказателя;
	КолонкаПоиска 	= ДополнительныеПараметры.КолонкаПоиска;
	Область 		= ДополнительныеПараметры.Область;
	Разделитель 	= ДополнительныеПараметры.Разделитель;
	Элемент 		= ДополнительныеПараметры.Элемент;
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Область.Имя = КодПоказателя ИЛИ МногострочнаяЧастьТекущейОбласти(Область) <> Неопределено Тогда
		Область.Значение = РезультатВыбора[КолонкаПоиска];
	Иначе
		СтрокаРезультатВыбора = Строка(РезультатВыбора[КолонкаПоиска]);
		Для Инд = СтрДлина(СтрокаРезультатВыбора) + 1 По ИндексОбласти - 1 Цикл
			СтрокаРезультатВыбора = " " + РезультатВыбора[КолонкаПоиска];
		КонецЦикла;
		Для Инд = 1 По ИндексОбласти - 1 Цикл
			ЭтаФорма[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(Инд, "ЧГ=")].Значение = СокрЛП(Сред(РезультатВыбора[КолонкаПоиска], Инд, 1));
		КонецЦикла;
	КонецЕсли;

	УстановитьДоступностьОбласти(Область.Имя);
	УстановитьТребованиеЗаполнения();	
	
	Модифицированность = Истина;  
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораСтраны(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда  
		
		РеквизитыЭлемента = РеквизитыЭлементаСправочника(Результат);
		
		Область = ДополнительныеПараметры.Область;
		Если Область.Значение = РеквизитыЭлемента.ДвузначныйБуквенныйКод Тогда
			Область.Очистить();
		Иначе
			Область.Значение = РеквизитыЭлемента.ДвузначныйБуквенныйКод;
		КонецЕсли;  
		
		Если ДополнительныеПараметры.Свойство("ОбластьНаим") 
			и ДополнительныеПараметры.ОбластьНаим <> Неопределено Тогда
			
			ОбластьНаим  = ДополнительныеПараметры.ОбластьНаим;
			Если ОбластьНаим.Значение = РеквизитыЭлемента.ДвузначныйБуквенныйКод Тогда
				ОбластьНаим.Очистить();
			Иначе
				ОбластьНаим.Значение = ?(ЗначениеЗаполнено(РеквизитыЭлемента.НаименованиеПолное),
				РеквизитыЭлемента.НаименованиеПолное, РеквизитыЭлемента.Наименование);
			КонецЕсли;
		КонецЕсли;
		
		Модифицированность = Истина;
	КонецЕсли; 
	

	УстановитьТребованиеЗаполнения();	
	
КонецПроцедуры   

&НаСервере
Функция РеквизитыЭлементаСправочника(Результат)
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение12")	Тогда
		
		КодАльфа2 = "";
		Если Результат.Метаданные().Реквизиты.Найти("КодАльфа2") <> Неопределено Тогда
			КодАльфа2 = Результат.КодАльфа2;
		КонецЕсли;
		НаименованиеПолное = "";
		Если Результат.Метаданные().Реквизиты.Найти("НаименованиеПолное") <> Неопределено Тогда
			НаименованиеПолное = Результат.НаименованиеПолное;
		КонецЕсли;
		
		Возврат Новый Структура("ДвузначныйБуквенныйКод, Наименование, НаименованиеПолное",
			КодАльфа2, Результат.Наименование, НаименованиеПолное);
		
	Иначе
		
		КодАльфа2 = "";
		Если Результат.Метаданные().Реквизиты.Найти("КодАльфа2") <> Неопределено Тогда
			КодАльфа2 = Результат.КодАльфа2;
		КонецЕсли;
		
		Возврат Новый Структура("ДвузначныйБуквенныйКод", КодАльфа2);
		
	Конецесли; 
	
КонецФункции

&НаСервере
Процедура ДобавитьСтроку()  
	
	ГрафаНумерации 		= СтруктураПриложения.ГрафаНумерации;
	ИмяТекОбласти 		= Элементы.ТабличныйДокумент.ТекущаяОбласть.Имя;    
	
	Если СтрНайти(ИмяТекОбласти, "ДобавитьСтроку") Тогда
		ИмяОбластиПреемника 	= СтрЗаменить(ИмяТекОбласти, "ДобавитьСтроку", "");
		ИмяОбластиПреемника 	= СтрЗаменить(ИмяОбластиПреемника, "Значок", "");
		ИмяГруппы 				= Лев(ИмяОбластиПреемника, 6);
		ИмяОбластиПреемника 	= "ДобавлениеСтроки" + ИмяОбластиПреемника;
	КонецЕсли;    
	
	Макет				= Справочники.CW_РеестрыНДС0ЗаписиРеестра.ПолучитьМакет(ИмяМакета);   
	ВремТаблДок 		= Макет.ПолучитьОбласть();
	ИскомаяОбластьМнЧ 	= ВремТаблДок.Области.Найти("МногострочнаяЧасть" + ИмяГруппы);
	
	ВремТаблДок 		= ВремТаблДок.ПолучитьОбласть(ИскомаяОбластьМнЧ.Верх, , 
	ИскомаяОбластьМнЧ.Верх + ВысотаМногострочнойЧасти(ИмяГруппы, Макет) - 1, );
	
	НачКоординаты 	= "";
	НачИндекс 		= "_1";
	
	НовКоординаты = СтрокаСКоординатамиПоказателя(ИмяОбластиПреемника);
	
	КолУровнейПодчиненности = СтрЧислоВхождений(НовКоординаты, "_");
	Для НомУр = 1 По КолУровнейПодчиненности Цикл
		НачКоординаты = НачКоординаты + НачИндекс;
	КонецЦикла;
	
	ПреИндекс_Число = ИндексПоказателя(ИмяОбластиПреемника);
	ПреИндекс = СтрокаСИндексомПоказателя(ПреИндекс_Число);
	
	НовИндекс_Число = ПреИндекс_Число + 1;
	НовИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число);
	
	НачПостфикс = ИмяГруппы + НачКоординаты + НачИндекс;
	ПреПостфикс = ИмяГруппы + НовКоординаты + ПреИндекс;
	НовПостфикс = ИмяГруппы + НовКоординаты + НовИндекс;
	
	МассивИменГраф = СтруктураПриложения[ИмяГруппы]["Графы"];
	Для каждого ИмяГрафы Из МассивИменГраф Цикл
		НачИмяОбл = ИмяГрафы + НачКоординаты + НачИндекс;
		НовИмяОбл = ИмяГрафы + НовКоординаты + НовИндекс;
		
		ОбластьЯчейки = ВремТаблДок.Области[НачИмяОбл];
		ОбластьЯчейки.Имя = НовИмяОбл;
		
		Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
			ОбластьЯчейки.Очистить();
		КонецЕсли;
		
		Если ИмяГрафы = ГрафаНумерации Тогда
			ОбластьЯчейки.Значение = НовИндекс_Число;	
		КонецЕсли;
	КонецЦикла;  
	
	Обл = ВремТаблДок.Область("УдалитьСтроку" + НачПостфикс);
	Обл.Имя = "УдалитьСтроку" + НовПостфикс;
	
	Обл = ВремТаблДок.Область("УдалитьСтроку" + НовПостфикс);
	Обл.Гиперссылка = Истина;
	Обл.Текст = "х";
	Если НовИндекс_Число = 2 Тогда
		Обл = ТабличныйДокумент.Области.Найти("УдалитьСтроку" + ПреПостфикс);
		Обл.Гиперссылка = Истина;
		Обл.Текст = "х";
	КонецЕсли;
	
	Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтроку" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтроку" + НовПостфикс;   
	
	Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтрокуЗначок" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтрокуЗначок" + НовПостфикс;
	
	ОблПреемник = ТабличныйДокумент.Области.Найти(ИмяОбластиПреемника);  
	ОблПреемник.Имя = "ДобавлениеСтроки" + НовПостфикс;
	
	// Обновление координат в именах областей подчиненных многострочных частей.
	ИменаПодчиненныхГрупп = СтруктураПриложения[ИмяГруппы]["ИменаПодчиненныхГрупп"];
	Для каждого ИмяПодчГруппы Из ИменаПодчиненныхГрупп Цикл    
		ПарамРеинд = Новый Структура("ИмяГруппы,ПреКоординаты,НовКоординаты",
		ИмяПодчГруппы, НачКоординаты + НачИндекс, НовКоординаты + НовИндекс);
		РеиндексироватьПодчиненныеДопСтрокиПриДобавлении(ВремТаблДок, ПарамРеинд, СтруктураПриложения);
	КонецЦикла;
	
	ВремТаблДок.Область("МногострочнаяЧасть" + ИмяГруппы).Имя = "";
	ВставляемаяОбласть = ВремТаблДок.Область(1, , ВремТаблДок.ВысотаТаблицы, ); 
	
	ТабличныйДокумент.ВставитьОбласть(ВставляемаяОбласть, ОблПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);

	УстановитьТребованиеЗаполнения();
	
	Модифицированность = Истина;
	
КонецПроцедуры 

&НаСервере
Процедура РеиндексироватьПодчиненныеДопСтрокиПриДобавлении(ТаблДок, ПараметрыРеиндексации, СтруктураПриложения)
	
	ИмяГруппы 		= ПараметрыРеиндексации["ИмяГруппы"];
	ПреКоординаты 	= ПараметрыРеиндексации["ПреКоординаты"];
	НовКоординаты 	= ПараметрыРеиндексации["НовКоординаты"];
	
	МассивИменГраф = СтруктураПриложения[ИмяГруппы]["Графы"];
	НачИндекс = "_1";
	
	Для каждого ИмяГрафы Из МассивИменГраф Цикл
		ПреИмяОбл = ИмяГрафы + ПреКоординаты + НачИндекс;
		НовИмяОбл = ИмяГрафы + НовКоординаты + НачИндекс;
		
		ОбластьЯчейки = ТаблДок.Области[ПреИмяОбл];
		ОбластьЯчейки.Имя = НовИмяОбл;
	КонецЦикла;
	
	ПреПостфикс = ИмяГруппы + ПреКоординаты + НачИндекс;
	НовПостфикс = ИмяГруппы + НовКоординаты + НачИндекс;
	
	Обл = ТаблДок.Области.Найти("УдалитьСтроку" + ПреПостфикс);
	Обл.Имя = "УдалитьСтроку" + НовПостфикс;
	
	Если СтрЗаканчиваетсяНа(НовПостфикс, НачИндекс) Тогда
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
	КонецЕсли;
	
	Обл = ТаблДок.Области.Найти("ДобавлениеСтроки" + ПреПостфикс);
	Обл.Имя = "ДобавлениеСтроки" + НовПостфикс;  
	
	Обл = ТаблДок.Области.Найти("ДобавитьСтроку" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтроку" + НовПостфикс;              
	
	Обл = ТаблДок.Области.Найти("ДобавитьСтрокуЗначок" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтрокуЗначок" + НовПостфикс;
	
	ТаблДок.Область("МногострочнаяЧасть" + ИмяГруппы).Имя = "";
	
	ИменаПодчиненныхГрупп = СтруктураПриложения[ИмяГруппы]["ИменаПодчиненныхГрупп"];
	Для каждого ИмяПодчГруппы Из ИменаПодчиненныхГрупп Цикл
		ПарамРеинд = Новый Структура("ИмяГруппы,ПреКоординаты,НовКоординаты",
		ИмяПодчГруппы, ПреКоординаты + НачИндекс, НовКоординаты + НачИндекс);
		РеиндексироватьПодчиненныеДопСтрокиПриДобавлении(ТаблДок, ПарамРеинд, СтруктураПриложения);
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ВысотаМногострочнойЧасти(ИмяГруппы, ТаблДок = Неопределено) Экспорт
	
	Если ТаблДок = Неопределено Тогда
		ТаблДок = Справочники.CW_РеестрыНДС0ЗаписиРеестра.ПолучитьМакет(ИмяМакета);   
	КонецЕсли;
	
	ИскомаяОбласть1 = ТаблДок.Области.Найти("МногострочнаяЧасть" + ИмяГруппы);
	Для каждого ИскомаяОбласть2 Из ТаблДок.Области Цикл
		Если Лев(ИскомаяОбласть2.Имя, 16 + СтрДлина(ИмяГруппы))
			= "ДобавлениеСтроки" + ИмяГруппы Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИскомаяОбласть2.Верх - ИскомаяОбласть1.Верх;
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция ИндексПоказателя(Знач ИмяОбласти) 
	
	МассивСтрок = СтрРазделить(ИмяОбласти, "_");
	
	КолСтрок = МассивСтрок.Количество();
	
	Если КолСтрок = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексСтрока = МассивСтрок[КолСтрок - 1];
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИндексСтрока) Тогда
		Возврат Число(ИндексСтрока);
	КонецЕсли;
	
КонецФункции   

&НаКлиентеНаСервереБезКонтекста
Функция КоординатыПоказателя(Знач ИмяОбласти) 
	
	МассивСтрок = СтрРазделить(ИмяОбласти, "_");
	
	КолСтрок = МассивСтрок.Количество();
	
	Если КолСтрок = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексСтрока = МассивСтрок[1];
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИндексСтрока) Тогда
		Возврат Число(ИндексСтрока);
	КонецЕсли;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаСИндексомПоказателя(Знач Индекс) 
	
	Если ТипЗнч(Индекс) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат "_" + Формат(Индекс, "ЧГ=");
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция СтрокаСКоординатамиПоказателя(Знач Координаты) 
	
	СтрокаСКоординатами = "";
	
	Если ТипЗнч(Координаты) = Тип("Массив") Тогда
		Для каждого КоординатаЧисло Из Координаты Цикл
			Если ТипЗнч(КоординатаЧисло) <> Тип("Число") Тогда
				Возврат Неопределено;
			КонецЕсли;
			СтрокаСКоординатами = СтрокаСКоординатами + "_" + Формат(КоординатаЧисло, "ЧГ=");
		КонецЦикла;
	ИначеЕсли ТипЗнч(Координаты) = Тип("Строка") Тогда
		МассивСтрок = СтрРазделить(Координаты, "_");
		КолСтрок = МассивСтрок.Количество();
		Если КолСтрок = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		МассивСтрок.Удалить(КолСтрок - 1);
		КолСтрок = МассивСтрок.Количество();
		МассивСтрок.Удалить(0);
		Для каждого КоординатаСтрока Из МассивСтрок Цикл
			Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(КоординатаСтрока) Тогда
				СтрокаСКоординатами = СтрокаСКоординатами + "_" + Формат(КоординатаСтрока, "ЧГ=");
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтрокаСКоординатами;
	
КонецФункции


&НаКлиенте
Процедура УдалитьСтроку()
	
	ИмяТекОбласти 	= Элементы.ТабличныйДокумент.ТекущаяОбласть.Имя;
	ИмяТекОбласти 	= СтрЗаменить(ИмяТекОбласти, "УдалитьСтроку", "");
	ИмяГруппы 		= Лев(ИмяТекОбласти, 6);   
	
	ДополнительныеПараметры = новый Структура;
	ДополнительныеПараметры.Вставить("ИмяОбласти",	ИмяТекОбласти); 
	ДополнительныеПараметры.Вставить("ИмяГруппы",	ИмяГруппы); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ДопТекст = ДополнительныйТекстПриДобавленииУдаленииСтрок(ИмяГруппы);
	Если ДопТекст <> Неопределено Тогда
		ТекстВопроса = ДопТекст.ТекстВопросаПередУдалениемСтроки;
	Иначе
		ТекстВопроса = НСтр("ru='Удалить выбранную строку?'");
	КонецЕсли; 
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры  

&НаКлиенте
Функция ДополнительныйТекстПриДобавленииУдаленииСтрок(Знач ИмяГруппы)
	
	Если ИмяГруппы = "П10000" Тогда
		Подстрока = "строку";
		ТекстВопроса = НСтр("ru='Удалить выбранную строку?'");
	ИначеЕсли ИмяГруппы = "П11000" Тогда
		Подстрока = "таможенную декларацию";
		ТекстВопроса = НСтр("ru='Удалить выбранную таможенную декларацию?'");
	ИначеЕсли ИмяГруппы = "П12000" Тогда
		Подстрока = "сведения об убытии товара морским транспортом";
		ТекстВопроса = НСтр("ru='Удалить выбранные сведения об убытии товара морским транспортом?'");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ДопТекст = Новый Структура;
	ДопТекст.Вставить("ЗаголовокКонтекстногоМенюДобавитьСтроку", "Добавить " + Подстрока);
	ДопТекст.Вставить("ЗаголовокКонтекстногоМенюДобавитьСтрокуКопированием", "Добавить " + Подстрока + " копированием");
	ДопТекст.Вставить("ЗаголовокКонтекстногоМенюУдалитьСтроку", "Удалить " + Подстрока);
	ДопТекст.Вставить("ТекстВопросаПередУдалениемСтроки", ТекстВопроса);
	
	Возврат ДопТекст;
	
КонецФункции

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьДопСтроку(ДополнительныеПараметры);  
	
	РассчитатьНалоговуюБазу();
	УстановитьТребованиеЗаполнения();
	
КонецПроцедуры  

&НаСервере
Процедура УдалитьДопСтроку(ДополнительныеПараметры)
	
	ГрафаНумерации 		= СтруктураПриложения.ГрафаНумерации;  
	
	ИмяГруппы = СтрЗаменить(ДополнительныеПараметры.ИмяОбласти, "УдалитьСтроку", "");
	ИмяГруппы = Лев(ИмяГруппы, 6);
	
	ТекКоординаты = СтрокаСКоординатамиПоказателя(ДополнительныеПараметры.ИмяОбласти);
	
	ТекИндекс_Число = ИндексПоказателя(ДополнительныеПараметры.ИмяОбласти);
	ТекИндекс = СтрокаСИндексомПоказателя(ТекИндекс_Число);
	ТекПостфикс = ИмяГруппы + ТекКоординаты + ТекИндекс;
	
	МассивИменГраф = СтруктураПриложения[ИмяГруппы]["Графы"];
	ИмяПервойГрафы = МассивИменГраф[0];
	
	ОблДобавлениеСтроки = ТабличныйДокумент.Области.Найти("ДобавлениеСтроки" + ТекПостфикс);  
	
	// Удаляется последняя строка.
	//
	Если ОблДобавлениеСтроки <> Неопределено Тогда
		
		ПреИндекс_Число = ТекИндекс_Число - 1;
		ПреИндекс = СтрокаСИндексомПоказателя(ПреИндекс_Число);
		ПреПостфикс = ИмяГруппы + ТекКоординаты + ПреИндекс;
		
		ОблУдаляемогоПоказателя = ТабличныйДокумент.Область(ИмяПервойГрафы + ТекКоординаты + ТекИндекс);
		
		ВерхУдОбласти = ОблУдаляемогоПоказателя.Верх;
		НизУдОбласти  = ОблДобавлениеСтроки.Верх - 1;
		
		УдаляемаяОбласть = ТабличныйДокумент.Область(ВерхУдОбласти, , НизУдОбласти, );
		ТабличныйДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали); 
		
		Обл = ТабличныйДокумент.Области.Найти("ДобавлениеСтроки" + ТекПостфикс);
		Обл.Имя = "ДобавлениеСтроки" + ПреПостфикс;
		Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтроку" + ТекПостфикс);
		Обл.Имя = "ДобавитьСтроку" + ПреПостфикс;
		Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтрокуЗначок" + ТекПостфикс);
		Обл.Имя = "ДобавитьСтрокуЗначок" + ПреПостфикс;
		
		Если ПреИндекс_Число = 1 Тогда
			Обл = ТабличныйДокумент.Область("УдалитьСтроку" + ПреПостфикс);
			Обл.Гиперссылка = Ложь;
			Обл.Текст = "";
		КонецЕсли;
		
		
	Иначе 
		
		НовИндекс_Число = ТекИндекс_Число + 1;
		НовИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число);
		
		ОблУдаляемогоПоказателя = ТабличныйДокумент.Область(ИмяПервойГрафы + ТекКоординаты + ТекИндекс);
		ОблСледующегоПоказателя = ТабличныйДокумент.Область(ИмяПервойГрафы + ТекКоординаты + НовИндекс);
		
		ВерхУдОбласти = ОблУдаляемогоПоказателя.Верх;
		НизУдОбласти  = ОблСледующегоПоказателя.Верх - 1;
		
		УдаляемаяОбласть = ТабличныйДокумент.Область(ВерхУдОбласти, , НизУдОбласти, );
		
		ТабличныйДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
		
		НовИндекс_Число = ТекИндекс_Число;
		
		// Реиндексация имен областей текущей многострочной части после удаления строки.
		Пока ТабличныйДокумент.Области.Найти(ИмяПервойГрафы + ТекКоординаты
			+ СтрокаСИндексомПоказателя(НовИндекс_Число + 1)) <> Неопределено Цикл
			
			ПреИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число + 1);
			НовИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число);
			
			Для каждого ИмяГрафы Из МассивИменГраф Цикл
				ПреИмяОбл = ИмяГрафы + ТекКоординаты + ПреИндекс;
				НовИмяОбл = ИмяГрафы + ТекКоординаты + НовИндекс;
				
				ОбластьЯчейки = ТабличныйДокумент.Области[ПреИмяОбл];
				ОбластьЯчейки.Имя = НовИмяОбл; 
				
				Если ИмяГрафы = ГрафаНумерации Тогда
					ОбластьЯчейки.Значение = НовИндекс_Число;	
				КонецЕсли;
			КонецЦикла;
			
			ПреПостфикс = ИмяГруппы + ТекКоординаты + ПреИндекс;
			НовПостфикс = ИмяГруппы + ТекКоординаты + НовИндекс;
			
			Обл = ТабличныйДокумент.Области.Найти("УдалитьСтроку" + ПреПостфикс);
			Обл.Имя = "УдалитьСтроку" + НовПостфикс;  
			
			Если НовИндекс_Число = 1 Тогда
				Обл.Гиперссылка = Ложь;
				Обл.Текст = "";
			КонецЕсли;
			
			// Обновление координат в именах областей подчиненных многострочных частей.
			ИменаПодчиненныхГрупп = СтруктураПриложения[ИмяГруппы]["ИменаПодчиненныхГрупп"];
			Для каждого ИмяПодчГруппы Из ИменаПодчиненныхГрупп Цикл
				ПарамРеинд = Новый Структура("ИмяГруппы,ПреКоординаты,НовКоординаты",
				ИмяПодчГруппы, ТекКоординаты + ПреИндекс, ТекКоординаты + НовИндекс);
				РеиндексироватьПодчиненныеДопСтрокиПриУдалении(ПарамРеинд, СтруктураПриложения, ТабличныйДокумент);
			КонецЦикла;
			
			НовИндекс_Число = НовИндекс_Число + 1;
			
		КонецЦикла;
		
		ПреИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число);
		НовИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число - 1);
		
		ПреПостфикс = ИмяГруппы + ТекКоординаты + ПреИндекс;
		НовПостфикс = ИмяГруппы + ТекКоординаты + НовИндекс;
		
		Обл = ТабличныйДокумент.Области.Найти("ДобавлениеСтроки" + ПреПостфикс);
		Обл.Имя = "ДобавлениеСтроки" + НовПостфикс;
		Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтроку" + ПреПостфикс);
		Обл.Имя = "ДобавитьСтроку" + НовПостфикс;
		Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтрокуЗначок" + ПреПостфикс);
		Обл.Имя = "ДобавитьСтрокуЗначок" + НовПостфикс;
		
		НовИмяТекОбл = ИмяПервойГрафы + ТекКоординаты + ТекИндекс;
		Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Области[НовИмяТекОбл];
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаСервере
Процедура РеиндексироватьПодчиненныеДопСтрокиПриУдалении(ПараметрыРеиндексации, СтруктураПриложения, Приложение)
	
	ИмяГруппы 	  = ПараметрыРеиндексации["ИмяГруппы"];
	ПреКоординаты = ПараметрыРеиндексации["ПреКоординаты"];
	НовКоординаты = ПараметрыРеиндексации["НовКоординаты"];
	
	МассивИменГраф = СтруктураПриложения[ИмяГруппы]["Графы"];
	ИмяПервойГрафы = МассивИменГраф[0];
	
	Инд_Число = 1;
	Пока Приложение.Области.Найти(ИмяПервойГрафы
		+ ПреКоординаты + СтрокаСИндексомПоказателя(Инд_Число)) <> Неопределено Цикл
		
		Инд = СтрокаСИндексомПоказателя(Инд_Число);
		
		Для каждого ИмяГрафы Из МассивИменГраф Цикл
			ПреИмяОбл = ИмяГрафы + ПреКоординаты + Инд;
			НовИмяОбл = ИмяГрафы + НовКоординаты + Инд;
			
			ОбластьЯчейки = Приложение.Области[ПреИмяОбл];
			ОбластьЯчейки.Имя = НовИмяОбл;
		КонецЦикла;
		
		ПреПостфикс = ИмяГруппы + ПреКоординаты + Инд;
		НовПостфикс = ИмяГруппы + НовКоординаты + Инд;
		
		Обл = Приложение.Области.Найти("УдалитьСтроку" + ПреПостфикс);
		Обл.Имя = "УдалитьСтроку" + НовПостфикс;
		
		ИменаПодчиненныхГрупп = СтруктураПриложения[ИмяГруппы]["ИменаПодчиненныхГрупп"];
		Для каждого ИмяПодчГруппы Из ИменаПодчиненныхГрупп Цикл
			ПарамРеинд = Новый Структура("ИмяГруппы,ПреКоординаты,НовКоординаты",
			ИмяПодчГруппы, ПреКоординаты + Инд, НовКоординаты + Инд);
			РеиндексироватьПодчиненныеДопСтрокиПриУдалении(ПарамРеинд, СтруктураПриложения, Приложение);
		КонецЦикла;
		
		Инд_Число = Инд_Число + 1;
		
	КонецЦикла;
	
	Инд = СтрокаСИндексомПоказателя(Инд_Число - 1);
	
	ПреПостфикс = ИмяГруппы + ПреКоординаты + Инд;
	НовПостфикс = ИмяГруппы + НовКоординаты + Инд;
	
	Обл = Приложение.Области.Найти("ДобавлениеСтроки" + ПреПостфикс);
	Обл.Имя = "ДобавлениеСтроки" + НовПостфикс;
	Обл = Приложение.Области.Найти("ДобавитьСтроку" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтроку" + НовПостфикс;
	Обл = Приложение.Области.Найти("ДобавитьСтрокуЗначок" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтрокуЗначок" + НовПостфикс;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  
	
	ДеревоРеестра = ПодготовитьДеревоРеестраНаСервере();
	ТекущийОбъект.ДанныеПриложения	= Новый ХранилищеЗначения(ДеревоРеестра, Новый СжатиеДанных(9));  
	
	ТекущийОбъект.ТребуетсяЗаполнение = ПолучитьТребваниеЗаполнения(); 
	
	//Храним табличный документ, чтобы не возиться с деревом при повтором открытии
	ТекущийОбъект.ДанныеПриложенияТабличныйДокумент = Новый ХранилищеЗначения(ТабличныйДокумент, Новый СжатиеДанных(9));	

КонецПроцедуры  

&НаСервере
Функция ПодготовитьДеревоРеестраНаСервере() 
	
	ДеревоРеестра = Новый ДеревоЗначений;
	ДеревоРеестра.Колонки.Добавить("КодВидаОперации"); 		//Строка
	ДеревоРеестра.Колонки.Добавить("НалоговаяБаза"); 		//Число
	ДеревоРеестра.Колонки.Добавить("МногострочнаяЧасть"); 	//Строка	
	ДеревоРеестра.Колонки.Добавить("Данные"); 				//структура	
	
	СтрокаРеестра = ДеревоРеестра.Строки.Добавить();		
	СтрокаРеестра.КодВидаОперации 	= Объект.КодВидаОперации;
	СтрокаРеестра.НалоговаяБаза 	= Объект.НалоговаяБаза;
	//КодВидаОперации
	
	Для каждого ЭлемСтруктуры Из СтруктураПриложения Цикл
		
		Если ТипЗнч(ЭлемСтруктуры.Значение) = Тип("Структура") Тогда
			Если ЭлемСтруктуры.Значение["УровеньПодчинения"] = 0 Тогда
				СформироватьДеревоМногострочнойЧастиПоДаннымТабличногоДокумента(ЭлемСтруктуры.Ключ, СтрокаРеестра);
			КонецЕсли;                                         
		КонецЕсли;
		
	КонецЦикла;         
	
	Возврат ДеревоРеестра;
	
КонецФункции

&НаСервере
Процедура СформироватьДеревоМногострочнойЧастиПоДаннымТабличногоДокумента(ИмяГруппы, ДеревоДанных, Координаты = "")
	
	Если НЕ СтруктураПриложения.Свойство(ИмяГруппы) Тогда
		Возврат;
	КонецЕсли;
	
	МассивИменГраф = СтруктураПриложения[ИмяГруппы]["Графы"];
	ИмяПервойГрафы = МассивИменГраф[0];
	
	Инд_Число = 1;
	Пока ТабличныйДокумент.Области.Найти(ИмяПервойГрафы + Координаты + СтрокаСИндексомПоказателя(Инд_Число)) <> Неопределено Цикл
		НовВетка = ДеревоДанных.Строки.Добавить();
		НовВетка.МногострочнаяЧасть = ИмяГруппы;  
		
		// Заполнение данными из текущей строки многострочной части.
		Данные = Новый Структура;
		Инд = СтрокаСИндексомПоказателя(Инд_Число);
		Для каждого ИмяГрафы Из МассивИменГраф Цикл
			Обл = ТабличныйДокумент.Области.Найти(ИмяГрафы + Координаты + Инд);
			Если Обл <> Неопределено Тогда
				Данные.Вставить(ИмяГрафы, Обл.Значение);
			КонецЕсли;
		КонецЦикла;
		НовВетка.Данные = Данные;
		
		// Заполнение данными из строк многострочных частей, подчиненных текущей строке многострочной части.
		ДанныеМногострочныхЧастей = Новый Структура;
		ИменаПодчГрупп = СтруктураПриложения[ИмяГруппы]["ИменаПодчиненныхГрупп"];
		Для каждого ИмяПодчГруппы Из ИменаПодчГрупп Цикл 
			ПодчКоординаты = Координаты + Инд;
			СформироватьДеревоМногострочнойЧастиПоДаннымТабличногоДокумента(ИмяПодчГруппы, НовВетка, ПодчКоординаты);
		КонецЦикла;
		
		Инд_Число = Инд_Число + 1;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура РассчитатьНалоговуюБазу()   
	
	ГрафаНалоговаяБаза  = СтруктураПриложения["ГрафаНалоговаяБаза"];
	
	НалоговаяБаза = 0;
	Для Каждого Область из ТабличныйДокумент.Области Цикл
		
		Если НЕ СтрНачинаетсяС(Область.Имя, ГрафаНалоговаяБаза) Тогда   
			Продолжить;
		КонецЕсли;
		
		НалоговаяБаза = НалоговаяБаза + Область.Значение;

	КонецЦикла; 
	
	Объект.НалоговаяБаза = НалоговаяБаза;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТребованиеЗаполнения()   
	
	Объект.ТребуетсяЗаполнение = ПолучитьТребваниеЗаполнения(); 
	УстановитьНадписьПредупреждения();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТребваниеЗаполнения()      
	
	ПараметрыПроверки = CW_РеестрыНДС0Дополнительный.ПолучитьСтруктуруРеквизитовРеестра(); 
	ПараметрыПроверки.ПриложениеПриказа	= Объект.ПриложениеПриказа;
	ПараметрыПроверки.КодВидаОперации 	= Объект.КодВидаОперации;
	ПараметрыПроверки.НалоговаяБаза		= Объект.НалоговаяБаза;
	
	Возврат CW_РеестрыНДС0Дополнительный.ТребуетсяЗаполнениеЯчеек(ТабличныйДокумент, ПараметрыПроверки);
	
КонецФункции

&НаКлиенте
Процедура ДокументДоходовПриИзменении(Элемент)   
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДокументРеализации", Ложь);
	ДополнительныеПараметры.Вставить("ДокументДоходов", Истина);


	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОчисткеДокументаПриИзмененииДокументРеализации", ЭтотОбъект, ДополнительныеПараметры);   
	
	Если ЗначениеЗаполнено(ПредыдущийДокументДоходов) и ПредыдущийДокументДоходов <> Объект.ДокументДоходов Тогда
		ПоказатьВопрос(Оповещение, "Данные приложения будут очищены. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;   

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОчисткеДокументаПриИзмененииДокументРеализации(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;      
	
	Если ДополнительныеПараметры.ДокументДоходов Тогда
		ДокументДоходовПриИзмененииНаСервере();	
	КонецЕсли; 
	
	ОбработатьИзменениеДокументов(); 
	УстановитьДоступностьКомандыЗаполнить();

КонецПроцедуры   

&НаСервере
Процедура ДокументДоходовПриИзмененииНаСервере()  
	
	ВедомыйВедущий = CW_РеестрыНДС0СерверВызовСервера.ПолучитьВедомыйВедущийДокумент(Объект.ДокументДоходов);
	
	Объект.ДокументРеализации = ВедомыйВедущий.ВедомыйДокумент;

	ПредыдущийДокументРеализации 	= Объект.ДокументРеализации;

КонецПроцедуры     

&НаСервере
Процедура ОбработатьИзменениеДокументов() 
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	Макет  	= ТОбъект.ПолучитьМакет(ИмяМакета);
	
	ТабличныйДокумент = CW_РеестрыНДС0Дополнительный.ПолучитьНачальныйТабличныйДокумент(Макет, СтруктураПриложения);   
	
	ЗаполнитьДеревоФайлов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКомандыЗаполнить()
	
	ВидимостьКомандыЗаполнить = CW_РеестрыНДС0СерверВызовСервера.ПолучитьВидимостьКомандыЗаполнить(Объект.ДокументРеализации);
	Элементы.ФормаЗаполнить.Видимость = ВидимостьКомандыЗаполнить;
	
КонецПроцедуры    

&НаКлиенте
Процедура Заполнить(Команда)  
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОчисткеДокумента", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Данные приложения будут очищены. Продолжить?", Режим, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОчисткеДокумента(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	ЗаполнитьТабличныйДокументНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументНаСервере()  
	
	ТабличныйДокумент.Очистить();  
	
	CW_РеестрыНДС0Дополнительный.ЗаполнитьТабличныйДокументИзФормы(ЭтаФорма);
	Объект.РучноеРедактирование = ложь;
	
	УстановитьТребованиеЗаполнения(); 	
	УстановитьСостояниеОбъекта();
	
КонецПроцедуры  


&НаКлиенте
Процедура ОбновитьФайлы(Команда)

	ЗаполнитьДеревоФайлов();   
	
	ЭлементыДерева = ДеревоФайлов.ПолучитьЭлементы();
	Для Каждого ЭлементДерева из ЭлементыДерева Цикл
		ИдентификаторСтроки = ЭлементДерева.ПолучитьИдентификатор();
		Элементы.ДеревоФайлов.Развернуть(ИдентификаторСтроки, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоФайлов()     
	
	ВедущийДокумент = CW_РеестрыНДС0СерверВызовСервера.ПолучитьВедущийДокумент(Объект.ДокументРеализации);   
	Если Не ЗначениеЗаполнено(ВедущийДокумент) Тогда
		Возврат;
	КонецЕсли;

	Модуль_РаботаСФайлами = CW_РаботаСФайламиСервер.ПолучитьОбщийМодульРаботыСфайлами();
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоФайлов");
	ДеревоЗначений.Строки.Очистить();
	
	Структура = ПолучитьОбъектыАрхива(ДеревоЗначений, ВедущийДокумент);   
	
	РезультатЗапросаВедущийДокумент = ПолучитьРезультатЗапросаФайлыОбъекта(ВедущийДокумент);
	
	СтрокаВедущийДокумент = ДеревоЗначений.Строки.Добавить();
	СтрокаВедущийДокумент.Объект 			= ВедущийДокумент;  
	СтрокаВедущийДокумент.Наименование		= СокрЛП(ВедущийДокумент.ПредставлениеДокумента); 
	СтрокаВедущийДокумент.ИндексКартинки	= 2;   
	СтрокаВедущийДокумент.ЭтоГруппа			= Истина;
	
	ВыборкаФайлы = РезультатЗапросаВедущийДокумент.Выбрать();  
	Пока ВыборкаФайлы.Следующий() Цикл
		СтрокаФайл = СтрокаВедущийДокумент.Строки.Добавить();
		СтрокаФайл.Наименование		= СокрЛП(ВыборкаФайлы.Ссылка); 
		СтрокаФайл.Объект 			= ВыборкаФайлы.Ссылка; 
		СтрокаФайл.ИндексКартинки	= Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(ВыборкаФайлы.Расширение);   
		СтрокаФайл.ТипДокумента 	= ВыборкаФайлы.ТипДокумента; 
		СтрокаФайл.Расширение 		= ВыборкаФайлы.Расширение; 
	КонецЦикла; 
	
	//Договор
	РезультатЗапросаДоговор = ПолучитьРезультатЗапросаФайлыОбъекта(Структура.Договор);
	
	НужноДобавитьГруппуДоговор = Истина;
	Если Не РезультатЗапросаДоговор.Пустой() Тогда 
		СтрокаДоговор = СтрокаВедущийДокумент.Строки.Добавить();
		СтрокаДоговор.Объект 			= Структура.Договор;  
		СтрокаДоговор.Наименование		= СокрЛП(Структура.Договор); 
		СтрокаДоговор.ИндексКартинки	= 2;   
		СтрокаДоговор.ЭтоГруппа 		= Истина;   
		
		НужноДобавитьГруппуДоговор = Ложь;
	
		ВыборкаФайлы = РезультатЗапросаДоговор.Выбрать();  
		Пока ВыборкаФайлы.Следующий() Цикл
			СтрокаФайл = СтрокаДоговор.Строки.Добавить();
			СтрокаФайл.Наименование		= СокрЛП(ВыборкаФайлы.Ссылка); 
			СтрокаФайл.Объект 			= ВыборкаФайлы.Ссылка; 
			СтрокаФайл.ИндексКартинки	= Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(ВыборкаФайлы.Расширение);   
			СтрокаФайл.ТипДокумента 	= ВыборкаФайлы.ТипДокумента; 
			СтрокаФайл.Расширение 		= ВыборкаФайлы.Расширение; 
		КонецЦикла;                                   
	Конецесли;
	
	//ПриложениеКДоговору
	Если Структура.Свойство("ПриложениеКДоговору") Тогда  
		
		РезультатЗапросаПриложение = ПолучитьРезультатЗапросаФайлыОбъекта(Структура.ПриложениеКДоговору);
		Если Не РезультатЗапросаПриложение.Пустой() Тогда 
			
			Если НужноДобавитьГруппуДоговор Тогда
				СтрокаДоговор = СтрокаВедущийДокумент.Строки.Добавить();
				СтрокаДоговор.Объект 			= Структура.Договор;  
				СтрокаДоговор.Наименование		= СокрЛП(Структура.Договор); 
				СтрокаДоговор.ИндексКартинки	= 2;   
				СтрокаДоговор.ЭтоГруппа 		= Истина;   
			КонецЕсли;
			
			СтрокаПриложение = СтрокаДоговор.Строки.Добавить();
			СтрокаПриложение.Объект 		= Структура.ПриложениеКДоговору;  
			СтрокаПриложение.Наименование	= СокрЛП(Структура.ПриложениеКДоговору); 
			СтрокаПриложение.ИндексКартинки	= 2;   
			СтрокаПриложение.ЭтоГруппа 		= Истина;   
			
			ВыборкаФайлы = РезультатЗапросаПриложение.Выбрать();  
			Пока ВыборкаФайлы.Следующий() Цикл
				СтрокаФайл = СтрокаПриложение.Строки.Добавить();
				СтрокаФайл.Наименование		= СокрЛП(ВыборкаФайлы.Ссылка); 
				СтрокаФайл.Объект 			= ВыборкаФайлы.Ссылка; 
				СтрокаФайл.ИндексКартинки	= Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(ВыборкаФайлы.Расширение);   
				СтрокаФайл.ТипДокумента 	= ВыборкаФайлы.ТипДокумента; 
				СтрокаФайл.Расширение 		= ВыборкаФайлы.Расширение; 
			КонецЦикла;  
		Конецесли;	
		
	Конецесли;	
	
	//Заявки
	Для Каждого Заявка из Структура.МассивЗаявок Цикл
		Если Не ЗначениеЗаполнено(Заявка) Тогда
			Продолжить;
		КонецЕсли; 
		
		РезультатЗапросаЗаявки = ПолучитьРезультатЗапросаФайлыОбъекта(Заявка); 
		Если Не РезультатЗапросаЗаявки.Пустой() Тогда
			СтрокаЗаявка = СтрокаВедущийДокумент.Строки.Добавить();
			СтрокаЗаявка.Объект 		= Заявка;  
			СтрокаЗаявка.Наименование	= СокрЛП(Заявка); 
			СтрокаЗаявка.ИндексКартинки	= 2;   
			СтрокаЗаявка.ЭтоГруппа 		= Истина;   
			
			ВыборкаФайлы = РезультатЗапросаЗаявки.Выбрать();  
			Пока ВыборкаФайлы.Следующий() Цикл
				СтрокаФайл = СтрокаЗаявка.Строки.Добавить();
				СтрокаФайл.Наименование		= СокрЛП(ВыборкаФайлы.Ссылка); 
				СтрокаФайл.Объект 			= ВыборкаФайлы.Ссылка; 
				СтрокаФайл.ИндексКартинки	= Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(ВыборкаФайлы.Расширение);   
				СтрокаФайл.ТипДокумента 	= ВыборкаФайлы.ТипДокумента; 
				СтрокаФайл.Расширение 		= ВыборкаФайлы.Расширение; 
			КонецЦикла;
		КонецЕсли;
	КонецЦикла; 
	
	//Заказы
	ВремТаблица = Структура.ТаблицаГрузоперевозкиЗаказы.Скопировать();
	ВремТаблица.Свернуть("Заказ",); 
	мЗаказы = ВремТаблица.ВыгрузитьКолонку("Заказ"); 
	Для Каждого Заказ из мЗаказы Цикл
		
		Если ЗначениеЗаполнено(Заказ) Тогда
			РезультатЗапросаЗаказ = ПолучитьРезультатЗапросаФайлыОбъекта(Заказ);
			Если Не РезультатЗапросаЗаказ.Пустой() Тогда
				
				СтрокаЗаказ = СтрокаВедущийДокумент.Строки.Добавить();
				СтрокаЗаказ.Объект 			= Заказ;  
				СтрокаЗаказ.Наименование	= СокрЛП(Заказ); 
				СтрокаЗаказ.ИндексКартинки	= 2;   
				СтрокаЗаказ.ЭтоГруппа 		= Истина;   
				
				ВыборкаФайлы = РезультатЗапросаЗаказ.Выбрать();  
				Пока ВыборкаФайлы.Следующий() Цикл
					СтрокаФайл = СтрокаЗаказ.Строки.Добавить();
					СтрокаФайл.Наименование		= СокрЛП(ВыборкаФайлы.Ссылка); 
					СтрокаФайл.Объект 			= ВыборкаФайлы.Ссылка; 
					СтрокаФайл.ИндексКартинки	= Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(ВыборкаФайлы.Расширение);   
					СтрокаФайл.ТипДокумента 	= ВыборкаФайлы.ТипДокумента; 
					СтрокаФайл.Расширение 		= ВыборкаФайлы.Расширение; 
				КонецЦикла;	  
			Иначе
				СтрокаЗаказ = СтрокаВедущийДокумент;
			КонецЕсли; 
		Иначе
			СтрокаЗаказ = СтрокаВедущийДокумент;
		Конецесли;
		
		//Грузоперевозки
		ВремТаблица = Структура.ТаблицаГрузоперевозкиЗаказы.Скопировать(Новый Структура("Заказ", Заказ));
		ВремТаблица.Свернуть("Грузоперевозка",); 
		мГрузоперевозки = ВремТаблица.ВыгрузитьКолонку("Грузоперевозка"); 
		Для Каждого Грузоперевозка из мГрузоперевозки Цикл
			
			РезультатЗапросаГрузоперевозка = ПолучитьРезультатЗапросаФайлыОбъекта(Грузоперевозка);
			Если Не РезультатЗапросаГрузоперевозка.Пустой() Тогда
				
				СтрокаГрузоперевозка = СтрокаЗаказ.Строки.Добавить();
				СтрокаГрузоперевозка.Объект 		= Грузоперевозка;  
				СтрокаГрузоперевозка.Наименование	= СокрЛП(Грузоперевозка); 
				СтрокаГрузоперевозка.ИндексКартинки	= 2;   
				СтрокаГрузоперевозка.ЭтоГруппа 		= Истина;   
				
				ВыборкаФайлы = РезультатЗапросаГрузоперевозка.Выбрать();  
				Пока ВыборкаФайлы.Следующий() Цикл
					СтрокаФайл = СтрокаГрузоперевозка.Строки.Добавить();
					СтрокаФайл.Наименование		= СокрЛП(ВыборкаФайлы.Ссылка); 
					СтрокаФайл.Объект 			= ВыборкаФайлы.Ссылка; 
					СтрокаФайл.ИндексКартинки	= Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(ВыборкаФайлы.Расширение);   
					СтрокаФайл.ТипДокумента 	= ВыборкаФайлы.ТипДокумента; 
					СтрокаФайл.Расширение 		= ВыборкаФайлы.Расширение; 
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоФайлов"); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультатЗапросаФайлыОбъекта(ВедущийДокумент)
	
	ВладелецАрхива = CW_РаботаСФайламиСервер.ПолучитьВладельцаАрхиваПоОбъекту(ВедущийДокумент, Ложь);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыАрхива.Объект КАК Объект,
	               |	CW_ОбъектыАрхива.Ссылка КАК Ссылка,
	               |	CW_ОбъектыАрхива.Расширение КАК Расширение,
	               |	CW_ОбъектыАрхива.ТипДокумента КАК ТипДокумента
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	               |ГДЕ
	               |	CW_ОбъектыАрхива.Владелец = &ВладелецАрхива
	               |АВТОУПОРЯДОЧИВАНИЕ"; 
	
	Запрос.УстановитьПараметр("ВладелецАрхива", ВладелецАрхива);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;

КонецФункции

&НаСервере
Функция ПолучитьОбъектыАрхива(ДеревоЗначений, ВедущийДокумент)
	
	СтрукутраПараметровЗапроса = Новый Структура; 
	СтрукутраПараметровЗапроса.Вставить("ВедущийДокумент", 		ВедущийДокумент);   
	СтрукутраПараметровЗапроса.Вставить("ВедомыйДокумент", 		Объект.ДокументРеализации);   
	СтрукутраПараметровЗапроса.Вставить("ПриложениеРеестра", 	Объект.ПриложениеРеестра);   
	
	ТаблицаЗапроса = CW_РеестрыНДС0Дополнительный.ПолучитьтаблицуЗапросаПриложения(СтрукутраПараметровЗапроса);  
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПериодОтчета",	Объект.ПериодОтчета);
	ПараметрыПроцедуры.Вставить("Организация", 	Объект.Организация);  
	КодОперации0ПоУмолчанию = CW_РеестрыНДС0Дополнительный.ПолучитьКодОперации0ПоУмолчанию(ПараметрыПроцедуры);
	
	Для Каждого СтрокаТаблицы из ТаблицаЗапроса Цикл
		СтрокаТаблицы.КодВидаОперации = КодОперации0ПоУмолчанию;   
		Если ЗначениеЗаполнено(СтрокаТаблицы.Операция0Код) Тогда  
			ТаблицаКодовВидовОпераций0 = УчетНДС.КлассификаторКодовОперацийПоСтавке0(Объект.ПериодОтчета,СтрокаТаблицы.Операция0Код);
			Если ТаблицаКодовВидовОпераций0.Количество() > 0 Тогда
				СтрокаТаблицыКодов = ТаблицаКодовВидовОпераций0[0];
				СтрокаТаблицы.КодВидаОперации = СтрокаТаблицыКодов.Код;  
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Структура = новый Структура;  
	Структура.Вставить("Договор", ВедущийДокумент.Договор);
	
	Если ЗначениеЗаполнено(ВедущийДокумент.ПриложениеКДоговору) Тогда
		Структура.Вставить("ПриложениеКДоговору", 	ВедущийДокумент.ПриложениеКДоговору);
	КонецЕсли;
	
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаЗапроса.Грузоперевозка КАК Грузоперевозка,
	               |	ТаблицаЗапроса.КодВидаОперации КАК КодВидаОперации
	               |ПОМЕСТИТЬ ВТ_ТаблицаЗапроса
	               |ИЗ
	               |	&ТаблицаЗапроса КАК ТаблицаЗапроса
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ТаблицаЗапроса.Грузоперевозка КАК Грузоперевозка,
	               |	ВТ_ТаблицаЗапроса.Грузоперевозка.Заказ КАК Заказ,
	               |	ВТ_ТаблицаЗапроса.Грузоперевозка.Заказ.Заявка КАК Заявка,
	               |	ВТ_ТаблицаЗапроса.Грузоперевозка.Заявка КАК ЗаявкаГрузоперевозки
	               |ПОМЕСТИТЬ ВТ_ВсеОбъекты
	               |ИЗ
	               |	ВТ_ТаблицаЗапроса КАК ВТ_ТаблицаЗапроса
	               |ГДЕ
	               |	ВТ_ТаблицаЗапроса.КодВидаОперации = &КодВидаОперации";
	
	Запрос.УстановитьПараметр("ТаблицаЗапроса",  ТаблицаЗапроса);  
	Запрос.УстановитьПараметр("КодВидаОперации", Объект.КодВидаОперации);  

	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ВсеОбъекты.Грузоперевозка КАК Грузоперевозка,
	               |	ВТ_ВсеОбъекты.Заказ КАК Заказ
	               |ИЗ
				   |	ВТ_ВсеОбъекты КАК ВТ_ВсеОбъекты";
				   
   РезультатЗапроса = Запрос.Выполнить();   
   ТаблицаГрузоперевозки = РезультатЗапроса.Выгрузить();
   
   ДополнитьПодменуГрузоперевозок(ТаблицаГрузоперевозки); 
   
   Структура.Вставить("ТаблицаГрузоперевозкиЗаказы", ТаблицаГрузоперевозки);
				   
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ВсеОбъекты.Заявка КАК Заявка
	               |ПОМЕСТИТЬ ВТ_Заявки
	               |ИЗ
	               |	ВТ_ВсеОбъекты КАК ВТ_ВсеОбъекты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ВсеОбъекты.ЗаявкаГрузоперевозки
	               |ИЗ
	               |	ВТ_ВсеОбъекты КАК ВТ_ВсеОбъекты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_Заявки.Заявка КАК Заявка
	               |ИЗ
	               |	ВТ_Заявки КАК ВТ_Заявки";   
	
	РезультатЗапроса = Запрос.Выполнить();   
	мЗаявки = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Заявка");
	Структура.Вставить("МассивЗаявок", мЗаявки);
	
	Возврат Структура;
	
КонецФункции   

&НаСервере
Процедура ДополнитьПодменуГрузоперевозок(ТаблицаГрузопереовзок)

	Если Не Константы.CW_РеестрыНДС0ИспользуетсяПодменаГрузоперевозок.Получить() Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрЗамены = Константы.CW_РеестрыНДС0ПараметрГрузоперевозкаДляЗамены.Получить();  
	Если Не ЗначениеЗаполнено(ПараметрЗамены) Тогда
		Возврат;
	КонецЕсли;
	
	МассивГрузоперевозок = ТаблицаГрузопереовзок.ВыгрузитьКолонку("Грузоперевозка");
	
	Запрос = Новый Запрос;   
	
	Запрос.Текст  = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	CW_ХарактеристикиПодмен.Значение КАК Грузоперевозка
	                |ИЗ
	                |	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиПодмен
	                |ГДЕ
	                |	CW_ХарактеристикиПодмен.Параметр = &ПараметрЗамены
	                |	И CW_ХарактеристикиПодмен.Грузоперевозка В(&МассивГрузоперевозок)"; 
	
	Запрос.УстановитьПараметр("ПараметрЗамены",			ПараметрЗамены);
	Запрос.УстановитьПараметр("МассивГрузоперевозок",	МассивГрузоперевозок);
	
	РезультатЗапроса 	= Запрос.Выполнить(); 
	
	ВыборкаГрузоперевозки = РезультатЗапроса.Выбрать();
	Пока ВыборкаГрузоперевозки.Следующий() Цикл
		НоваяСтрока = ТаблицаГрузопереовзок.Добавить();
	    НоваяСтрока.Грузоперевозка = ВыборкаГрузоперевозки.Грузоперевозка;
	КонецЦикла;  
	
КонецПроцедуры



&НаКлиенте
Процедура ДеревоФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаДерева  = ДеревоФайлов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПродолжитьОткрытиеФайла(СтрокаДерева);
	
КонецПроцедуры    

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	СтрокаДерева = Элементы.ДеревоФайлов.ТекущиеДанные;
	Если СтрокаДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ПродолжитьОткрытиеФайла(СтрокаДерева);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОткрытиеФайла(Знач СтрокаДерева)
	
	Если СтрокаДерева.ЭтоГруппа Тогда
		ПоказатьЗначение(, СтрокаДерева.Объект);
	Иначе   
		ОткрытьСохранитьФайл(СтрокаДерева.Объект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСохранитьФайл(СсылкаНаФайл)
	
	ДанныеФайла = CW_РаботаСФайламиКлиент.ДанныеФайла(СсылкаНаФайл, УникальныйИдентификатор);	
	CW_РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	
КонецПроцедуры  

&НаКлиенте
Процедура ДеревоФайловПриАктивизацииСтроки(Элемент)

	Элементы.ГруппаPDF.Видимость 	= Ложь;
	Элементы.АдресФайла.Видимость  	=Ложь;   
	
	ТекущиеДанные = Элементы.ДеревоФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено или ТекущиеДанные.ЭтоГруппа  Тогда
		Возврат;
	КонецЕсли;   
	
	ПоказатьPDF = Ложь;
	Если СтрНайти(ВРЕГ(ТекущиеДанные.Расширение), "PDF") > 0  Тогда
		ПоказатьPDF = Истина;  
		
		АдресФайлаPDF  = ПолучитьАдресФайлаPDF(ТекущиеДанные.Объект);	
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаPDF); 
		Если ДвоичныеДанные <> Неопределено Тогда
			ПотокВПамяти   = ДвоичныеДанные.ОткрытьПотокДляЧтения();
			ДокументPDF.Прочитать(ПотокВПамяти);     
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПоказатьPDF Тогда
		АдресФайла	= ПрикрепленныеФайлыПолучитьАдрес(ТекущиеДанные.Объект);
	КонецЕсли;           
	
	Элементы.ГруппаPDF.Видимость 	= ПоказатьPDF;
	Элементы.АдресФайла.Видимость  	= НЕ ПоказатьPDF;   
	
КонецПроцедуры     

&НаКлиенте
Процедура ОткрытьPDFДокументВОтдельномОкне(Команда) 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресФайла", АдресФайлаPDF);
	
	ОткрытьФорму("Справочник.CW_РеестрыНДС0ЗаписиРеестра.Форма.ФормаПросмотраPDFДокумента", СтруктураПараметров, ЭтаФорма);

КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьПустуюКартинку()   
	
	Возврат ПоместитьВоВременноеХранилище(Новый Картинка);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАдресФайлаPDF(СсылкаНаФайл)  

	ДвоичныеДанные = CW_РаботаСФайламиСервер.ДвоичныеДанныеФайла(СсылкаНаФайл);
	Если Не ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		Возврат Неопределено;
	КонецЕсли;     
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПрикрепленныеФайлыПолучитьАдрес(СсылкаНаФайл) 
	
	ДвоичныеДанные = CW_РаботаСФайламиСервер.ДвоичныеДанныеФайла(СсылкаНаФайл);
	
	Если Не ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		Возврат ПолучитьПустуюКартинку();
	КонецЕсли;     

	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции   


&НаКлиенте
Функция ПолучитьМассивГрафДляВыбораФизЛица()
	
	мГрафы = новый Массив;
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение08")   
		ИЛИ Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение09")
		ИЛИ Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение07")
		ИЛИ Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение08") 
		ИЛИ Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение08") Тогда
		мГрафы.Добавить("П1000091");
		мГрафы.Добавить("П1000092");
		мГрафы.Добавить("П1000093");
	КонецЕсли; 
	
	Возврат мГрафы;

КонецФункции 

&НаКлиенте
Функция ПолучитьМассивГрафДляВыбораАдреса()
	
	мГрафы = новый Массив;
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение08") Тогда
		мГрафы.Добавить("П1000009");
		мГрафы.Добавить("П1000012");
		мГрафы.Добавить("П1000015");
	КонецЕсли;  
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение07") Тогда
		мГрафы.Добавить("П1000009");
		мГрафы.Добавить("П1000012");
		мГрафы.Добавить("П1000015");
	КонецЕсли;   
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение07") Тогда
		мГрафы.Добавить("П1000009");
		мГрафы.Добавить("П1000012");
		мГрафы.Добавить("П1000015");
	КонецЕсли; 
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение09") Тогда
		мГрафы.Добавить("П1000005");
		мГрафы.Добавить("П1000008");
		мГрафы.Добавить("П1000011");
	КонецЕсли; 
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение08") Тогда
		мГрафы.Добавить("П1000005");
		мГрафы.Добавить("П1000008");
		мГрафы.Добавить("П1000011");
	КонецЕсли;  
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение08") Тогда
		мГрафы.Добавить("П1000005");
		мГрафы.Добавить("П1000008");
		мГрафы.Добавить("П1000011");
	КонецЕсли;

	Возврат мГрафы;

КонецФункции  

&НаКлиенте
Функция ПолучитьМассивГрафДляВыбораИзТЗВыбора()
	
	мГрафы = новый Массив;
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение07") Тогда
		мГрафы.Добавить("П1200009");
	КонецЕсли;
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение08") Тогда
		мГрафы.Добавить("П1000004");
	КонецЕсли; 
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение09") Тогда
		
	КонецЕсли;
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение10") Тогда
		мГрафы.Добавить("П1100002");
	КонецЕсли;  
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение11") Тогда
		мГрафы.Добавить("П1100002");
	КонецЕсли; 
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение06")	Тогда
		мГрафы.Добавить("П1200009"); 
	КонецЕсли; 
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение07")	Тогда
		мГрафы.Добавить("П1000004"); 
	КонецЕсли;
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение07")	Тогда
		мГрафы.Добавить("П1000004"); 
	КонецЕсли; 
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение06")	Тогда
		мГрафы.Добавить("П1300010"); 
	КонецЕсли; 

	Возврат мГрафы;
	
КонецФункции   

 &НаКлиенте
Функция ПолучитьМассивГрафДляВыбораСтраны()
	
	мГрафы = новый Массив;
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение07")
		ИЛИ Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение06") Тогда
		
		мГрафы.Добавить("П1000004");
		мГрафы.Добавить("П1000006");
		мГрафы.Добавить("П1200024");
	КонецЕсли;  
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение06") Тогда
		мГрафы.Добавить("П1000005");
		мГрафы.Добавить("П1000007");
		мГрафы.Добавить("П1300024");
	КонецЕсли;  
	
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение08")
		ИЛИ Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение07") 
		ИЛИ Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение07") Тогда
		
		мГрафы.Добавить("П1000018");
		мГрафы.Добавить("П1000019");
	КонецЕсли;  
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение09") 
		ИЛИ Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение08") 
		или Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение08") Тогда
		
		мГрафы.Добавить("П1000012");
		мГрафы.Добавить("П1000013");
	КонецЕсли;  
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение10") 
		ИЛИ Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение09") 
		ИЛИ Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение09") Тогда
		
		мГрафы.Добавить("П1100007");
		мГрафы.Добавить("П1100028");
		мГрафы.Добавить("П1100029");
	КонецЕсли; 

	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение10") Тогда
		мГрафы.Добавить("П1000031");
		мГрафы.Добавить("П1000051");
	КонецЕсли; 

	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение11") Тогда
		мГрафы.Добавить("П1100006");
		мГрафы.Добавить("П1100007");
		мГрафы.Добавить("П1100008");
	КонецЕсли; 
	
	Если Объект.ПриложениеПриказа = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение12") Тогда
		мГрафы.Добавить("П1000041");
		мГрафы.Добавить("П1000042");
		мГрафы.Добавить("П1000051");
		мГрафы.Добавить("П1000052");
	КонецЕсли; 
	
	Возврат мГрафы;

КонецФункции   

&НаКлиенте
Процедура КодВидаОперацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          "Выбор кода операции НДС 0%");
	ПараметрыФормы.Вставить("ТаблицаЗначений",    ТаблицаКодовОпераций0);
	ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура("Код", Объект.КодВидаОперации));
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиКодОперации0Завершение", ЭтотОбъект, Новый Структура);
		
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы",
	ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения,);

	
КонецПроцедуры 

&НаКлиенте
Процедура ВвестиКодОперации0Завершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.КодВидаОперации = РезультатВыбора.Код;
	Модифицированность = Истина;
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "АвтоматическийКонтрольЗаполнения" Тогда
		ЭтаФорма.Прочитать();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗапретАвтоматическогоУдаленияПриИзмененииНаСервере()
	
	Элементы.ФормаЗаполнить.Доступность = Не Объект.Заблокирован;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапретАвтоматическогоУдаленияПриИзменении(Элемент)
	ЗапретАвтоматическогоУдаленияПриИзмененииНаСервере();
КонецПроцедуры

	

	



