
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Параметры.Свойство("КоличествоЗначений",	КоличествоЗначений);
	Параметры.Свойство("МаксимальноеЗначение",	МаксимальноеЗначение);
	Параметры.Свойство("МинимальноеЗначение",	МинимальноеЗначение);
	Параметры.Свойство("СреднееЗначение", 		СреднееЗначение);
	Параметры.Свойство("СуммаЗначений", 		СуммаЗначений);

	флСуммаЗначенийПоказать = Неопределено;
	Параметры.Свойство("СуммаЗначенийПоказать", 		флСуммаЗначенийПоказать); 
	СуммаЗначенийПоказать = ?(флСуммаЗначенийПоказать = Неопределено, Истина, флСуммаЗначенийПоказать);
	
	флСреднееЗначениеПоказать = Неопределено;
	Параметры.Свойство("СреднееЗначениеПоказать", 		флСреднееЗначениеПоказать); 
	СреднееЗначениеПоказать = ?(флСреднееЗначениеПоказать = Неопределено, Истина, флСреднееЗначениеПоказать);
	
	флМинимальноеЗначениеПоказать = Неопределено;
	Параметры.Свойство("МинимальноеЗначениеПоказать", 	флМинимальноеЗначениеПоказать);
	МинимальноеЗначениеПоказать = ?(флМинимальноеЗначениеПоказать = Неопределено, Истина, флМинимальноеЗначениеПоказать);
	
	флМаксимальноеЗначениеПоказать = Неопределено;
	Параметры.Свойство("МаксимальноеЗначениеПоказать", 	флМаксимальноеЗначениеПоказать);  
	МаксимальноеЗначениеПоказать = ?(флМаксимальноеЗначениеПоказать = Неопределено, Истина, флМаксимальноеЗначениеПоказать);

	флКоличествоЗначенийПоказать = Неопределено;
	Параметры.Свойство("КоличествоЗначенийПоказать", 	флКоличествоЗначенийПоказать);   
	КоличествоЗначенийПоказать = ?(флКоличествоЗначенийПоказать = Неопределено, Истина, флКоличествоЗначенийПоказать);
	
	Элементы.СуммаЗначений.Видимость 		=  СуммаЗначенийПоказать;
	Элементы.МинимальноеЗначение.Видимость 	=  МинимальноеЗначениеПоказать;
	Элементы.МаксимальноеЗначение.Видимость =  МаксимальноеЗначениеПоказать;
	Элементы.СреднееЗначение.Видимость 		=  СреднееЗначениеПоказать;
	Элементы.КоличествоЗначений.Видимость 	=  КоличествоЗначенийПоказать;
	
КонецПроцедуры
