// Содержимое модуля отличается в версиях ПРОФ и КОРП.
// В версии ПРОФ отсутствует:
// - тело экспортных процедур (остаются только сигнатуры методов)
// - неэкспортные процедуры и все функции.
// Поэтому не допускается реализация в модуле экспортных функций: вместо них следует использовать процедуры с возвращаемым параметром.

#Область ПрограммныйИнтерфейс

// Возвращает параметры расчета акциза для вида подакцизного товара.
//
// Параметры:
// ВидПодакцизногоТовара - СправочникСсылка.КодВидаПодакцизногоТовара.
// 
// Возвращаемое значение:
// Структура:
// - ЕдиницаИзмеренияАкциза   - СправочникСсылка.КлассификаторЕдиницИзмерения
// - РасчетАкцизаЗаЛитрСпирта - Булево
// - ЭтоИмпортныйТовар        - Булево
//
Функция ПараметрыАкцизаПоВидуТовара(ВидПодакцизногоТовара) Экспорт
	
	Результат = Новый Структура(
		"ЕдиницаИзмеренияАкциза, РасчетАкцизаЗаЛитрСпирта, ЭтоИмпортныйТовар",
		Неопределено,
		Ложь,
		Ложь
	);
	
	ДатаДействия = '00010101';
	ТекДата = ТекущаяДата();
	Если ЗначениеЗаполнено(ВидПодакцизногоТовара) Тогда
		РеквизитыТовара =
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ВидПодакцизногоТовара, "ДействуетС, Код, ВидТовара");
		ДатаДействия = РеквизитыТовара.ДействуетС;
		КодВидаПодакцизногоТовара = РеквизитыТовара.Код;
		ВидТовара = РеквизитыТовара.ВидТовара;
	КонецЕсли;
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("КодТовара", КодВидаПодакцизногоТовара);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(ДатаДействия) И ДатаДействия > ТекДата, ДатаДействия, ТекДата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиАкцизаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СтавкиАкцизаСрезПоследних.РасчетАкцизаЗаЛитрСпиртаВПродукции КАК РасчетАкцизаЗаЛитрСпиртаВПродукции
	|ИЗ
	|	РегистрСведений.СтавкиАкцизаПоставляемый.СрезПоследних(&Дата, КодВидаПодакцизногоТовара = &КодТовара) КАК СтавкиАкцизаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПорядокУплатыАкцизов.Импорт КАК Импорт
	|ИЗ
	|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
	|ГДЕ
	|	ПорядокУплатыАкцизов.ВидТовара = &ВидТовара
	|	И ПорядокУплатыАкцизов.Импорт = &Импорт";
	Запрос.УстановитьПараметр("ВидТовара", ВидТовара);
	Запрос.УстановитьПараметр("Импорт", Истина);
	Результаты = Запрос.ВыполнитьПакет();
	РезультатАкциза = Результаты[0].Выбрать();
	РезультатИмпорт = Результаты[1].Выбрать();
	Если РезультатАкциза.Следующий() Тогда
		Результат.РасчетАкцизаЗаЛитрСпирта = РезультатАкциза.РасчетАкцизаЗаЛитрСпиртаВПродукции;
		Результат.ЕдиницаИзмеренияАкциза = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(РезультатАкциза.ЕдиницаИзмерения);
	КонецЕсли;
	Результат.ЭтоИмпортныйТовар = РезультатИмпорт.Следующий()
	И ВидТовара = ПредопределенноеЗначение("Перечисление.ВидыПодакцизныхТоваров.СпиртосодержащаяПродукция");
	Если НЕ Результат.ЭтоИмпортныйТовар Тогда
		Результат.РасчетАкцизаЗаЛитрСпирта = Ложь;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти
