#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Копирование") 
		И ЭтотОбъект.ДополнительныеСвойства.Свойство("СсылкаКопирования") Тогда
		Если ЭтотОбъект.ДополнительныеСвойства.Копирование Тогда
			ВыполнитьКопированиеСтатейВладельца(ЭтотОбъект.ДополнительныеСвойства.СсылкаКопирования);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Функция ВыполнитьКопированиеСтатейВладельца(СсылкаКопирования) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	|ГДЕ
	|	(ВЫРАЗИТЬ(CW_ПлановыеСтатьиЗатратИДоходов.Владелец КАК Справочник.CW_ВариантыБюджетовПоЗаявкам)) = &Владелец
	|	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец", СсылкаКопирования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтатья = Выборка.Ссылка.Скопировать();
		НоваяСтатья.Владелец = Ссылка;
		НоваяСтатья.Записать();
		
	КонецЦикла;
	
	
КонецФункции


#КонецЕсли