
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//читаем параметры, устанавливаем отбор
	// ---------------------------------------------------------------------------- 
	
	ЭтоРасходы = Ложь;
	ЭтоДоходы = Ложь;
	// --- 
	
	Документ = Параметры.Документ;
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		ЭтоРасходы = Истина;
		ЭтаФорма.Заголовок = "Выбор счёта поставщика";
		
	Иначе
		
		ЭтоДоходы = Истина;
		ЭтаФорма.Заголовок = "Выбор счёта покупателю";
		
	КонецЕсли; 
	// --- 
	Элементы.СтраницаВходящихСчетов.Видимость = ЭтоРасходы;
	Элементы.СтраницаИсходящихСчетов.Видимость = ЭтоДоходы;
	// --- 
	Элементы.Страницы.ОтображениеСтраниц=ОтображениеСтраницФормы.Нет;
	
	Отбор = _сф.ст_ПолучитьСвойство(Параметры,"Отбор");
	Если Отбор = Неопределено Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	// --- 
	Элементы.ТаблицаВходящихСчетовСальдо.Заголовок = "Всего, "+Строка(Отбор.Валюта);
	Элементы.ТаблицаИсходящихСчетовСальдо.Заголовок = "Всего, "+Строка(Отбор.Валюта);
	// --- 
	ТаблицаСчетов = ?(ЭтоРасходы,ТаблицаВходящихСчетов,ТаблицаИсходящихСчетов);
	// обязательные реквизиты: Организация, Контрагент, Договор, Валюта + Период
	ТаблицаСчетов.Параметры.УстановитьЗначениеПараметра("Период",Новый Граница(Параметры.Дата,ВидГраницы.Исключая));
	// --- 
	Для каждого КлючЗначение Из Отбор Цикл
		
		ТаблицаСчетов.Параметры.УстановитьЗначениеПараметра(КлючЗначение.Ключ,Отбор[КлючЗначение.Ключ]);
		
	КонецЦикла;
	// --- 
	Если ЭтоРасходы Тогда
		Префикс = "ОКЗ";
	Иначе
		Префикс = "ОДЗ";
	КонецЕсли; 
	
	Грузоперевозка = _сф.ст_ПолучитьСвойство(Отбор,"Грузоперевозка");
	Если НЕ ЗначениеЗаполнено(Грузоперевозка) Тогда
		Грузоперевозка = Неопределено;		
	КонецЕсли;
	Если Грузоперевозка = Неопределено Тогда
		_сф.ст_УдалитьСвойство(Отбор,"Грузоперевозка");
	КонецЕсли; 
	// ---  

	ВидЗадолженности = ?(ЭтоРасходы,Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская,Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская);	
	СтруктураНастроек = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Отбор.Организация, ВидЗадолженности, Параметры.Дата); 

	ОперативныйУчет 			= СтруктураНастроек["ВедетсяОперативныйУчет"]; 
	НастройкиОперативногоУчета	= СтруктураНастроек["НастройкиОперативногоУчета"]; 
	
	Если НастройкиОперативногоУчета["КонтрольПорядкаОтражения"] Тогда
		ПорядокОтражения = _сф.ст_ПолучитьСвойство(Отбор,"ПорядокОтражения");
		Если НЕ ЗначениеЗаполнено(ПорядокОтражения) Тогда
			ПорядокОтражения = Неопределено;
			_сф.ст_УдалитьСвойство(Отбор,"ПорядокОтражения");
		КонецЕсли;   
	Иначе
		ПорядокОтражения = Неопределено;
		_сф.ст_УдалитьСвойство(Отбор,"ПорядокОтражения");
	КонецЕсли;
	
	Если НастройкиОперативногоУчета["КонтрольНоменклатуры"] Тогда
		Номенклатура = _сф.ст_ПолучитьСвойство(Отбор,"Номенклатура");
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Номенклатура = Неопределено;
			_сф.ст_УдалитьСвойство(Отбор,"Номенклатура");
		КонецЕсли; 
	Иначе
		Номенклатура = Неопределено;
		_сф.ст_УдалитьСвойство(Отбор,"Номенклатура");
	КонецЕсли; 	
	
	Если НастройкиОперативногоУчета["КонтрольНДС"] Тогда
		СтавкаНДС = _сф.ст_ПолучитьСвойство(Отбор,"СтавкаНДС");
		Если НЕ ЗначениеЗаполнено(СтавкаНДС) Тогда
			СтавкаНДС = Неопределено;
			_сф.ст_УдалитьСвойство(Отбор,"СтавкаНДС");
		КонецЕсли; 
	Иначе
		СтавкаНДС = Неопределено;
		_сф.ст_УдалитьСвойство(Отбор,"СтавкаНДС");
	КонецЕсли; 
	
	//Подсистема.УчетПриложенийДоговоров  
	Если Отбор.Свойство("ПриложениеКДоговору") Тогда
		Если Не ЗначениеЗаполнено(Отбор.ПриложениеКДоговору) Тогда
			_сф.ст_УдалитьСвойство(Отбор,"ПриложениеКДоговору");
		КонецЕсли;                                      
	КонецЕсли;
	//Подсистема.УчетПриложенийДоговоров
	
	// --- 
	ТаблицаСчетов.Параметры.УстановитьЗначениеПараметра("Грузоперевозка",Грузоперевозка);
	ТаблицаСчетов.Параметры.УстановитьЗначениеПараметра("ПорядокОтражения",ПорядокОтражения);
	ТаблицаСчетов.Параметры.УстановитьЗначениеПараметра("Номенклатура",Номенклатура);
	ТаблицаСчетов.Параметры.УстановитьЗначениеПараметра("СтавкаНДС",СтавкаНДС);
	// --- 
	//Элементы.ТаблицаСчетов.Обновить();
	// --- 
	ЗакрыватьПриВыборе = Истина;
	
	// формируем текст представления
	ПредставлениеОтбора = _сф.ст_Представление(Отбор,Символы.ПС);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТаблицаВходящихСчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.ТаблицаВходящихСчетов.ТекущиеДанные;
	Значение = ?(ТД=Неопределено,Неопределено,ТД.Счет);
	ОповеститьОВыборе(Значение);
	//ЭтаФорма.Закрыть(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсходящихСчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элементы.ТаблицаИсходящихСчетов.ТекущиеДанные;
	Значение = ?(ТД=Неопределено,Неопределено,ТД.Счет);
	ОповеститьОВыборе(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ЭтоРасходы Тогда
		
		ТД = Элементы.ТаблицаВходящихСчетов.ТекущиеДанные;
		
	Иначе
		
		ТД = Элементы.ТаблицаИсходящихСчетов.ТекущиеДанные;
		
	КонецЕсли; 
	Значение = ?(ТД=Неопределено,Неопределено,ТД.Счет);
	Сообщить(Значение);
	ОповеститьОВыборе(Значение);
	//ЭтаФорма.Закрыть(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоРасходы Тогда
		
		ЭтаФорма.ТекущийЭлемент = Элементы.ТаблицаВходящихСчетов;
		
	Иначе
		
		ЭтаФорма.ТекущийЭлемент = Элементы.ТаблицаИсходящихСчетов;
		
	КонецЕсли; 
	
КонецПроцедуры


