&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Параметры.Свойство("АдресНастроек", АдресНастроек);
	
	НастройкиПоУмолчанию = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.АдресСхемы));	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)

	ЗаполнитьНаСервере(); 
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

	НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();
	ПоместитьВоВременноеХранилище(НастройкиКомпоновщика, АдресНастроек);
	
КонецПроцедуры

