
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма);

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры




&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	
	Если  Модифицированность 
		И ЗначениеЗаполнено(Объект.УчетныйКодСтанции) 
		и Не ЗавершитьЗапись Тогда
		Если Не ПроверитьУчетныйКодНаСервере() Тогда
			Отказ = истина;
			ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗаписьюПродолжение",ЭтотОбъект); 
			ПоказатьВопрос(ОписаниеОповещения,"Код станции не уникален. Продолжить?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюПродолжение(КодВозврата, ДополнительныеПараметры) Экспорт 
	
	Если КодВозврата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если КодВозврата = КодВозвратаДиалога.Да Тогда   
		ЗавершитьЗапись = Истина;
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьУчетныйКодНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ЖелезнодорожныеСтанции.Ссылка
	               |ИЗ
	               |	Справочник.CW_ЖелезнодорожныеСтанции КАК CW_ЖелезнодорожныеСтанции
	               |ГДЕ
	               |	CW_ЖелезнодорожныеСтанции.УчетныйКодСтанции = &УчетныйКодСтанции
	               |	И CW_ЖелезнодорожныеСтанции.Ссылка <> &Ссылка";  
	
	Запрос.УстановитьПараметр("Ссылка", 			Объект.Ссылка); 
	Запрос.УстановитьПараметр("УчетныйКодСтанции", 	Объект.УчетныйКодСтанции);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры


#КонецОбласти


 