Процедура ЗаполнитьСтатьиБюджета(Форма, ОповещениеОЗавершении, ТолькоПоВыделенным=Истина, ВыводитьОкноОжидания = Истина, ЗапуститьВФоне=Истина) Экспорт
	
	Если ТолькоПоВыделенным Тогда
		ВыделенныеСтроки = Форма.Элементы.Услуги.ВыделенныеСтроки;
	Иначе 
		ВыделенныеСтроки = Новый Массив;
		Для Каждого СтрокаТаблицы из Форма.Объект.Услуги Цикл
			ВыделенныеСтроки.Добавить(СтрокаТаблицы.ПолучитьИдентификатор());	
		КонецЦикла;
	КонецЕсли; 
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Необходимо выбрать строки для заполнения!");
		Возврат;
	КонецЕсли;                   
	
	РезультатВыполнения =  CW_Бюджетирование.ПолучитьСтатьиБюджетаВФоне(Форма.Объект, ВыделенныеСтроки, ЗапуститьВФоне);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = ВыводитьОкноОжидания; 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры      

Процедура ЗаполнитьСтатьиБюджетаПослеподбора(Форма, ОповещениеОЗавершении) ЭКспорт
	
	ЗаполнитьСтатьиБюджета(Форма, ОповещениеОЗавершении, Ложь, Ложь, Ложь);
	
КонецПроцедуры

Процедура СформироватьОтчетАнализИсполненияБюджетаГрузоперевозок(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ПараметрыФормы = CW_Бюджетирование.ПолучитьПараметрыФормыОтчетаАнализИсполненияБюджетаГрузоперевозок(ПараметрКоманды);
	ОткрытьФорму("Отчет.CW_АнализИсполненияБюджетаГрузоперевозок.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры   

Процедура СоздатьСтатьиБюжета(СтруктураПараметров) Экспорт  
	
	РезультатВыполнения =  CW_Бюджетирование.СоздатьСтатьиБюжетаВФоне(СтруктураПараметров.ПараметрыСтатейБюджета);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(СтруктураПараметров.Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 

	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, СтруктураПараметров.Оповещение, ПараметрыОжидания); 
	
КонецПроцедуры 

Процедура ОбновитьСтатьиБюджета(СтруктураПараметров) Экспорт
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПараметрыСтатейБюджета", СтруктураПараметров.ДанныеСтатейБюджета);

	РезультатВыполнения =  CW_Бюджетирование.ОбновитьСтатьиБюджетаВФоне(ПараметрыПроцедуры);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(СтруктураПараметров.Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 

	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, СтруктураПараметров.Оповещение, ПараметрыОжидания); 
	
КонецПроцедуры

Процедура ПередУдалениемБюджета(Форма, Оповещение) Экспорт
	
	ПоказатьВопрос(Оповещение, "Удалить выделеные строки?
	|Отменить удаление будет невозможно.",РежимДиалогаВопрос.ОКОтмена);

КонецПроцедуры


Процедура ПередНачаломПересчетаСтатейБюджета(Источник, МассивСтатейБюджета, ИмяПроцедуры) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяПроцедуры", ИмяПроцедуры);
	
	ОписаниеОповещения  = Новый ОписаниеОповещения("ОбновитьТаблицуБюджета", Источник, ДополнительныеПараметры);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("СтатьиБюджета",	МассивСтатейБюджета);
	ПараметрыПроцедуры.Вставить("Источник", 		Источник);  
	ПараметрыПроцедуры.Вставить("ОписаниеОповещенияПослеЗаврешения", ОписаниеОповещения);  
	
	ПоказатьПодтверждениеПересчетаКурсаСтатейБюджета(Источник, ПараметрыПроцедуры);

КонецПроцедуры


Процедура ПоказатьПодтверждениеПересчетаКурсаСтатейБюджета(Форма, ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораДатыКурса", ЭтотОбъект, ДополнительныеПараметры);

	Если Форма.БюджетУтвержден Тогда
		ПоказатьПредупреждение(, "Невозможно пересчитать статьи утвержденного бюджета!");
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Неопределено);
		Возврат;
	КонецЕсли;
	                                                                                  
	ДатаКурса = ТекущаяДата();
	ПоказатьВводДаты(ОписаниеОповещения, ДатаКурса, "Дата курса", ЧастиДаты.Дата);

КонецПроцедуры    

Процедура ПослеВыбораДатыКурса(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПересчетаБюджета = Новый Структура;
 	ПараметрыПересчетаБюджета.Вставить("СтатьиБюджета", 	ДополнительныеПараметры.СтатьиБюджета);

	РезультатВыполнения =  CW_Бюджетирование.ПриНачалеПересчетаСтатейБюджета(РезультатВыбора, ПараметрыПересчетаБюджета);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ДополнительныеПараметры.Источник);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;    
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПересчетаСтатейБюджета", ЭтотОбъект, ДополнительныеПараметры); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры

Процедура ПослеПересчетаСтатейБюджета(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда  
		
		ВыполнитьОбработкуОповещения(Дополнительныепараметры.ОписаниеОповещенияПослеЗаврешения, Истина);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка пересчета статей бюджета");  
		
	КонецЕсли;  
	
КонецПроцедуры


Процедура ПередНачаломГруповогоРедактированияРеквизитовСтатенйБюджета(ВыделенныеСтроки, Отказ) Экспорт
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Для группового изменения реквизтов необходимо выбрать статьи бюджета!",10,"Предупреждение");
		Отказ = истина;
	КонецЕсли;                                                                          
	
КонецПроцедуры


Процедура ГрупповоеРедактированиеРеквизитовСтатейБюджета(Форма, СтатьиБюджета, ИмяТаблицы) Экспорт
	
	РедактируемыеРеквизиты = CW_Бюджетирование.ПолучитьРедактиуемыеРеквизитыОбъекта(ИмяТаблицы);
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("РедактируемыеРеквизиты", РедактируемыеРеквизиты); 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник", 		Форма);
	ДополнительныеПараметры.Вставить("СтатьиБюджета", 	СтатьиБюджета);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьРедактированиеРеквизитов", ЭтотОбъект, ДополнительныеПараметры);	
	
	ОткрытьФорму("ОбщаяФорма.CW_ГрупповоеИзменениеРеквизитовОбъекта", СтруктураПараметров, Форма,,,,ОписаниеОповещения);

КонецПроцедуры   

Процедура ЗавершитьРедактированиеРеквизитов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Ссылки", 				ДополнительныеПараметры.СтатьиБюджета); 
	ПараметрыПроцедуры.Вставить("ЗначенияРеквизитов",	РезультатВыбора);
	
	РезультатВыполнения =  CW_Бюджетирование.НачатьИзменениеРеквизитовВФоне(ПараметрыПроцедуры);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ДополнительныеПараметры.Источник);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьФоновоеРедактированиеРеквизитов", ДополнительныеПараметры.Источник, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры   
