#Область ВызовВнешнихОбработокВКачествеКоманд

Функция ПодключитьОбработку(ПодключаемыйОбъект)  Экспорт	
	АдресОбработки = ПолучитьНавигационнуюСсылку(ПодключаемыйОбъект,"ХранилищеОбработки");
	ИмяВнешнейОбработки = ВнешниеОбработки.Подключить(АдресОбработки,ИдентификаторОбработки(ПодключаемыйОбъект),Ложь);
	Возврат(Истина);
КонецФункции

Функция ИдентификаторОбработки(ПодключаемыйОбъект)  
	// --- 	
	ИД = _сф.УИДСтрокой(ПодключаемыйОбъект.Ссылка);
	ИД = СтрЗаменить(ИД,"-","");
	ИД = "ПО_"+ИД;
	
	Возврат(ИД);	
	// --- 
КонецФункции

Функция ПолучитьОбработку(Обработка) Экспорт
	
	Если ТипЗнч(Обработка) = Тип("Строка") тогда 
		ПодключаемаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Обработка);	
	ИначеЕсли ТипЗнч(Обработка) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") Тогда
		ПодключаемаяОбработкаСсылка = Обработка;
	Иначе
		ВызватьИсключение "VMS_Сервер.ПолучитьОбработку(Обработка): неверный параметр ""Обработка""";	
	КонецЕсли;
	
	
	Если ПодключаемаяОбработкаСсылка <> Неопределено тогда	
		ПодключаемаяОбработка = ПодключаемаяОбработкаСсылка.ПолучитьОбъект();
		Если (ПодключитьОбработку(ПодключаемаяОбработка)) Тогда
			ВнешняяОбработка = ВнешниеОбработки.Создать(ИдентификаторОбработки(ПодключаемаяОбработка));		
			Возврат ВнешняяОбработка;
		КонецЕсли;
	КонецЕсли;
	Возврат "";
КонецФункции

Функция ВыполнитьПроцедуруФункциюИзВнешнейОБработки(НаименованиеОбработки, НаименованиеПроцедурыФункции, ДопПараметрыСтруктурой, ЭтоФункция = истина) Экспорт
	ПодключаемаяОбработкаСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(НаименованиеОбработки);	
	Если ПодключаемаяОбработкаСсылка <> Неопределено тогда	
		ПодключаемаяОбработка = ПодключаемаяОбработкаСсылка.ПолучитьОбъект();
		Если (ПодключитьОбработку(ПодключаемаяОбработка)) Тогда
			ВнешняяОбработка = ВнешниеОбработки.Создать(ИдентификаторОбработки(ПодключаемаяОбработка));
			СтрокаПараметров = "";
			Для каждого ЭлементДопПараметров Из ДопПараметрыСтруктурой цикл
				Если СтрокаПараметров <> "" тогда СтрокаПараметров = СтрокаПараметров + "," КонецЕсли;;
				СтрокаПараметров = СтрокаПараметров + "ДопПараметрыСтруктурой." + ЭлементДопПараметров.Ключ; 		
			КонецЦикла;	
			Ответ = Неопределено;
			Если ЭтоФункция тогда
				Выполнить("Ответ = ВнешняяОбработка." + НаименованиеПроцедурыФункции + "("+СтрокаПараметров+ ");"); 	
			Иначе
				Выполнить("ВнешняяОбработка." + НаименованиеПроцедурыФункции + "("+СтрокаПараметров+ ");");
			КонецЕсли;
			Возврат Ответ;
		КонецЕсли;
	КонецЕсли;	
КонецФункции

Функция ПодключитьВнешнююОбработкуОтчет(НазваниеОбработки,ОбработчикСтрокой) Экспорт 
	Обработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(НазваниеОбработки);
	
	Если Обработка.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка Тогда	
		МенежерНаУстановку = ВнешниеОбработки;
		ОбработчикСтрокой = "ВнешняяОбработка.";
	ИначеЕсли Обработка.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда	
		МенежерНаУстановку = ВнешниеОтчеты;
		ОбработчикСтрокой = "ВнешнийОтчет.";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
			
	Возврат Новый Структура("Обработка,ИмяОбработки",Обработка,МенежерНаУстановку.Подключить(ПоместитьВоВременноеХранилище(Обработка.ХранилищеОбработки.Получить()),,Ложь));
КонецФункции

Функция ПодключитьВнешнююОбработку(АдресХранилища) Экспорт 
	Возврат ВнешниеОбработки.Подключить(АдресХранилища,,Ложь);
КонецФункции

Функция ПолучитьНаСервере(Наименование) Экспорт
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование).ХранилищеОбработки.Получить();
КонецФункции // ПолучитьНаСервере()

#КонецОбласти

Функция ЗапуститьВыполнениеВФоне(Знач ИдентификаторФормы, Знач ИмяЭкспортнойПроцедуры, 
	Знач Параметры, Знач НаименованиеЗадания = "", ИспользоватьДополнительноеВременноеХранилище = Ложь) Экспорт
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторФормы);
	
	Результат = Новый Структура;
	Результат.Вставить("АдресХранилища",       АдресХранилища);
	Результат.Вставить("ЗаданиеВыполнено",     Ложь);
	Результат.Вставить("ИдентификаторЗадания", Неопределено);
	
	Если Не ЗначениеЗаполнено(НаименованиеЗадания) Тогда
		НаименованиеЗадания = ИмяЭкспортнойПроцедуры;
	КонецЕсли;
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(Параметры);
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);
	
	Если ИспользоватьДополнительноеВременноеХранилище Тогда
		АдресХранилищаДополнительный = ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторФормы);
		ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилищаДополнительный);
	КонецЕсли;
	
	РежимОтладки = ОбщегоНазначенияКлиентСервер.РежимОтладки();
	Если РежимОтладки Тогда
		
		РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(ИмяЭкспортнойПроцедуры, ПараметрыЭкспортнойПроцедуры);
		Результат.ЗаданиеВыполнено = Истина;
		
	Иначе
		
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(ИмяЭкспортнойПроцедуры);
		ПараметрыЗадания.Добавить(ПараметрыЭкспортнойПроцедуры);
		ВремяОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 4, 2);
		Задание = ФоновыеЗадания.Выполнить("ITSP_Сервер.ВыполнитьМетодКонфигурации", ПараметрыЗадания,, НаименованиеЗадания);
		Попытка
			Задание.ОжидатьЗавершения(ВремяОжидания);
		Исключение
			// Специальная обработка не требуется, возможно исключение вызвано истечением времени ожидания.
		КонецПопытки;
		
		Результат.ЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор);
		Результат.ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	КонецЕсли;
	
	Если ИспользоватьДополнительноеВременноеХранилище Тогда
		Результат.Вставить("АдресХранилищаДополнительный", АдресХранилищаДополнительный);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьНаПечатьИзОбработки(ПараметрКоманды,Адрес,НазваниеОбработки,СПечатью = Ложь) Экспорт
	
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	ДвоичныеДанные = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(НазваниеОбработки).ХранилищеОбработки.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДвоичныеДанные.Записать(ИмяФайла);
	ВнешниеОбработки.Создать(ИмяФайла,Ложь).СформироватьНаПечать(ПараметрКоманды,Адрес,СПечатью);
	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры // СформироватьСчетаНаСервере()



#Область ПочтоваяРассылка

Процедура ПодключитьсяКПочтовомуСерверу(Соединение,Профиль, Знач ПопытокПодключения) Экспорт

	Подключено = Ложь;
	Пока ПопытокПодключения<>0 Цикл 
		Попытка
			Соединение.Подключиться(Профиль);
			Подключено = Истина;
			Прервать;
		Исключение
			Причина = ОписаниеОшибки(); 
			ПопытокПодключения = ПопытокПодключения - 1;
		КонецПопытки;
	КонецЦикла;
	Если НЕ Подключено Тогда
		//ЗаписатьОшибкуВФайл(Формат(ТекущаяДата(),"")+" Ошибка отправки клиенту информации о плановой доставке на склад - невозможно соединиться с сервером");
	КонецЕсли;

КонецПроцедуры

Функция ВернутьЯщикФизическогоЛицаФарес(ФизЛицо,СЗапятой = Ложь) Экспорт
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛицаКонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
		|		ПО ФизическиеЛица.Фамилия = КонтактныеЛицаКонтактнаяИнформация.Ссылка.Фамилия
		|			И ФизическиеЛица.Имя = КонтактныеЛицаКонтактнаяИнформация.Ссылка.Имя
		|			И (КонтактныеЛицаКонтактнаяИнформация.Вид = &Вид)
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &Ссылка
		|	И ЕСТЬNULL(КонтактныеЛицаКонтактнаяИнформация.Представление, """") <> """"";
	
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.EmailКонтактныеЛица);
	Запрос.УстановитьПараметр("Ссылка", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ?(СЗапятой,",","")+ВыборкаДетальныеЗаписи.Представление;
КонецФункции // ВернутьЯщикФизическогоЛицаФарес()

Процедура ЗаписатьОшибкуВФайл(Строка) Экспорт
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	кодировка = "UTF8" ;
	ТекстовыйДокумент.Прочитать("D:\1C\log\mail.txt",кодировка);
	ТекстовыйДокумент.ДобавитьСтроку(Строка);
	ТекстовыйДокумент.Записать("D:\1C\log\mail.txt",кодировка);	
КонецПроцедуры // ЗаписатьОшибкуВФайл()

Процедура sleep(Сек) Экспорт
	scr = Новый COMОбъект("WScript.Shell");
	//scr.Run("sleep "+СокрЛП(Число(Сек)),0,1);
	scr.Run("ping 127.0.0.1 -n "+СокрЛП(Число(Сек)+1),0,1);
КонецПроцедуры

#КонецОбласти


