&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ПереданныйПериод = Неопределено;
	Параметры.Свойство("ПериодПрогноза", 	ПереданныйПериод); 
	Параметры.Свойство("Контрагент", 		Контрагент);
	Параметры.Свойство("Валюта", 			Валюта);
	Параметры.Свойство("ЗаявкаНаРасход", 	ЗаявкаНаРасход);

	Если ПереданныйПериод  <> Неопределено Тогда
		ПериодПрогноза.ДатаНачала 		= ПереданныйПериод.ДатаНачала;	
		ПериодПрогноза.ДатаОкончания	= ПереданныйПериод.ДатаОкончания;
	Иначе
		ПериодПрогноза.ДатаНачала		= НачалоДня(ТекущаяДата());	
		ПериодПрогноза.ДатаОкончания	= КонецМесяца(ТекущаяДата());
	КонецЕсли;  
	
	ОтборВалюта 		= ЗначениеЗаполнено(Валюта);
	ОтборКонтрагент 	= ЗначениеЗаполнено(Контрагент);
	ОтборНоменклатура 	= ЗначениеЗаполнено(Номенклатура);
	ОтборПериодПрогноза = Истина;
	
	ПолучитьМассивИспользуемыхСтатей();
	УстановитьОтборСписка();  
	
КонецПроцедуры    

&НаСервере
Процедура ПолучитьМассивИспользуемыхСтатей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПланированиеДДСРасшифровка.СтатьяБюджета КАК СтатьяБюджета
	               |ИЗ
	               |	Справочник.CW_ПланированиеДДС.Расшифровка КАК CW_ПланированиеДДСРасшифровка
	               |ГДЕ
	               |	CW_ПланированиеДДСРасшифровка.Ссылка <> &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ПланированиеДДСРасшифровка.СтатьяБюджета";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаНаРасход);
	
	РезультатЗапроса = запрос.Выполнить();
	
	МассивСтатей = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СтатьяБюджета");
	
	МассивИспользуемыхСтатей = Новый ФиксированныйМассив(МассивСтатей);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЭлементаОтбора(Элемент)   
	
	ОтборВалюта 		= ЗначениеЗаполнено(Валюта);
	ОтборКонтрагент 	= ЗначениеЗаполнено(Контрагент);
	ОтборНоменклатура 	= ЗначениеЗаполнено(Номенклатура);
	
	УстановитьОтборСписка();  
	
КонецПроцедуры  

 &НаКлиенте
Процедура ПриИзмененииФлага(Элемент)
	УстановитьОтборСписка();  
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборСписка() 
	
	мЭлементыОтбора = новый Массив;
	Для Каждого ЭлементОтбора из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПрогнозДата") 
			ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент")
			ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Валюта") 
			ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура")
			ИЛИ ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка")	Тогда
			мЭлементыОтбора.Добавить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого ЭлементОтбора из мЭлементыОтбора Цикл
		Список.Отбор.Элементы.Удалить(ЭлементОтбора);
	КонецЦикла;  
	
	Если ОтборПериодПрогноза Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПрогнозДата");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = ПериодПрогноза.ДатаНачала;
		ЭлементОтбора.Использование = Истина;	
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПрогнозДата");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = ПериодПрогноза.ДатаОкончания;
		ЭлементОтбора.Использование = Истина;  
	КонецЕсли;
	
	Если ОтборКонтрагент Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Контрагент");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Контрагент;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
	Если ОтборВалюта Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Валюта");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Валюта;
		ЭлементОтбора.Использование  = Истина;
	КонецЕсли;
	
	Если ОтборНоменклатура Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Номенклатура;
		ЭлементОтбора.Использование  = Истина;
	КонецЕсли; 
	
	Если ОтборВерсияБюджета Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВерсияБюджета");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ВерсияБюджета;
		ЭлементОтбора.Использование  = Истина;
	КонецЕсли;
	
	Если Не ПоказатьВсе Тогда    
		МассивСтатей = Новый Массив(МассивИспользуемыхСтатей);  
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.ЗагрузитьЗначения(МассивСтатей);
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
		ЭлементОтбора.ПравоеЗначение = СписокЗначений;
		ЭлементОтбора.Использование  = Истина;
	КонецЕсли;
	
КонецПроцедуры



