
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСтатусов 		 = ПолучитьИзВременногоХранилища(Параметры.АдресНастроекОтбора);
	мИспользуемыеСтатусы = СписокСтатусов.ВыгрузитьЗначения();
	
	ИмяФормыИсточника 	= Параметры.ИмяФормыИсточника;
	
	мДанныеФормы 	= СтрРазделить(ИмяФормыИсточника,".");
	ИмяФормыЖурнала	= мДанныеФормы[1];
	
	СоответствиеТипаобъекта = ПолучитьСоответствиеТипаОбъекта();
	ТипОбъекта 				= СоответствиеТипаобъекта.Получить(ИмяФормыЖурнала);		
	
	СкрыватьКартинкиСтатусов = CW_Настройки.ПолучитьНастройкуПользователя(,"СкрыватьКартинкиФинансовыхСтатусовВЖурналах");
	Элементы.ТаблицаОтбораКартинка.Видимость = Не СкрыватьКартинкиСтатусов;
	
	ВыборкаСтатусов = Справочники.CW_ФинансовыеСтатусы.ПолучитьФинансовыеСтатусыОбъекта(ТипОбъекта, мИспользуемыеСтатусы);
	
	Пока ВыборкаСтатусов.Следующий() Цикл
		
		НоваяСтрока = ТаблицаОтбора.Добавить();
		
		Если НЕ СкрыватьКартинкиСтатусов Тогда
			НоваяСтрока.Картинка 		= ВыборкаСтатусов.СсылкаКартинки;
		КонецЕсли;
		
		НоваяСтрока.Наименование 	= ВыборкаСтатусов.Наименование;
		НоваяСтрока.Ссылка 			= ВыборкаСтатусов.Ссылка;
		НоваяСтрока.Использование   = ВыборкаСтатусов.Использование;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеТипаОбъекта()
	
	Результат = Новый Соответствие;
	Результат.Вставить("CW_ЖурналЗаявок", 			Тип("СправочникСсылка.CW_Заявки"));
	Результат.Вставить("CW_ЖурналЗаказов", 			Тип("СправочникСсылка.CW_Заказы"));
	Результат.Вставить("CW_ЖурналГрузоперевозок", 	Тип("СправочникСсылка.CW_Грузоперевозки"));
	
	Возврат Результат;
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	УстановитьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	УстановитьФлажки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Флаг)
	// --- 
	
	Для каждого Стр Из ТаблицаОтбора Цикл
		
		Стр.Использование = Флаг;
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры


// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Установить(Команда)
	// формируем список из выбранных
	Список = Новый СписокЗначений;
	
	ОтборСтрок 		= Новый Структура("Использование", Истина);
	ВыбранныеСтроки = ТаблицаОтбора.НайтиСтроки(ОтборСтрок);
	
	Для каждого ВыбраннаяСтрока Из ВыбранныеСтроки Цикл
		Список.Добавить(ВыбраннаяСтрока.Ссылка);
	КонецЦикла; 
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Список", 			Список);
	
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры
  