#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешнийНумератор();
	
	СтруктураОписания.Наименование 				= "Пример внешнего нумератора";
	СтруктураОписания.Описание 					= "Пример внешнего нумератора";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	СтруктураОписания.Настройка 				= Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыНастроекОбъекта(СтруктураОписания, "ФормаНастроек");
	
	Возврат СтруктураОписания;
	
КонецФункции

// Процедура - Установить номер документа
//
// Процедура вызывается из стандартной обработки модуля объекта "ПриУстановкеНомера"
// При установке неомера документа, числовая часть номера (порядоковыяй номер) 
// присваивается платформой, меняем только префикс документа
//
// Параметры:
//  Объект				 - 	 Документ объект для которого устанавилвается номер 
//  СтандартнаяОбработка - 	 Признак выполнения стандартной обработки 
//  Префикс				 - 	 Устанавилваемый префикс документа 
//
Процедура УстановитьНомерДокумента(Объект, СтандартнаяОбработка, Префикс)  Экспорт
	
	//Код обработчика установки префикса документа
	
КонецПроцедуры

// Процедура - Установить номер счета
//
// Параметры:
//  Объект		 				- 	объект, для которого устанавивается новый номер счета 
//  ДополнительныйПараметр	 	- 	ссылка на ведомый счет
//
Процедура УстановитьНомерСчета(Объект, ДополнительныйПараметр = Неопределено)	Экспорт		
	
	//Код обработчика
	
КонецПроцедуры

// Процедура - Установить номер акта
//
// Параметры:
//  Объект		 				- 	объект, для которого устанавивается новый номер акта 
//  ДополнительныйПараметр	 	- 	ссылка на ведомый документ "Реализация товаров и услуг"
//
Процедура УстановитьНомерАкта(Объект, ДополнительныйПараметр = Неопределено) Экспорт
	
	//Код обработчика
	
КонецПроцедуры

// Процедура - Установить номер счета фактуры
//
// Параметры:
//  Объект		 				- 	объект, для которого устанавивается новый номер счет-фактуры 
//  ДополнительныйПараметр	 	- 	ссылка на ведомый документ "Счет-фактура выданный"
//
Процедура УстановитьНомерСчетаФактуры(Объект, ДополнительныйПараметр = Неопределено) Экспорт
	
	//Код обработчика

КонецПроцедуры

#КонецЕсли