
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПараметраДинамическогОСписка(Параметры);
	
	Если Параметры.Свойство("ФиксированныеНастройкиОтбора") Тогда
		УстановитьНастройкиОтбора(Параметры.ФиксированныеНастройкиОтбора, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	КонецЕсли;
	
	Если Параметры.Свойство("ПользовательскиеНастройкиОтбора") Тогда
		УстановитьНастройкиОтбора(Параметры.ПользовательскиеНастройкиОтбора, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);	
	КонецЕсли;
	
	ДополнениеЗаголовка = Новый Массив;
	Если Параметры.Свойство("Владелец") Тогда
		ДополнениеЗаголовка.Добавить("Грузоперевозка: "+СокрЛП(Параметры.Владелец));	
	КонецЕсли;
	Если Параметры.Свойство("ВидСтатьиПланироваия") Тогда
		ДополнениеЗаголовка.Добавить("Вид статьи: "+СокрЛП(Параметры.ВидСтатьиПланироваия));	
	КонецЕсли; 
	
	Если ДополнениеЗаголовка.Количество() > 0 Тогда
		Заголовок = Заголовок + СтрСоединить(ДополнениеЗаголовка, ", ");
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьНастройкиОтбора(НастройкиОтбора, РежимОтображенияЭлемента)   
	
	Для Каждого КлючЗначение из НастройкиОтбора Цикл
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, КлючЗначение.Ключ);	
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, 
			КлючЗначение.Ключ, 
			КлючЗначение.Значение,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			ЗначениеЗаполнено(КлючЗначение.Значение),
			РежимОтображенияЭлемента); 
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметраДинамическогОСписка(СтруктураПараметров) 
	
	ДокументРасходов = ПредопределенноеЗначение("Документ.CW_РасходыПоГрузоперевозке.ПустаяСсылка");
	ДокументДоходов  = ПредопределенноеЗначение("Документ.CW_ДоходыПоГрузоперевозке.ПустаяСсылка");
	
	Если СтруктураПараметров.Свойство("ДокументДоходов") Тогда
		ДокументДоходов = СтруктураПараметров.ДокументДоходов;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("ДокументРасходов") Тогда
		ДокументРасходов = СтруктураПараметров.ДокументРасходов;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДокументДоходов", ДокументДоходов, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДокументРасходов", ДокументРасходов, Истина);
	
КонецПроцедуры