
&НаКлиенте
Процедура ИдентификаторОбъектаМетаданныхПриИзменении(Элемент)
	
	Запись.ВладелецОбъекта  = ПолучитьВладельцаОбъекта(Запись.ИдентификаторОбъектаМетаданных);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВладельцаОбъекта(ИдентификаторОбъектаМетаданных)
	
	Если СтрНачинаетсяС(ИдентификаторОбъектаМетаданных.Имя , "CW_") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.CW_ВладелецОбъектаДоступа.ЗначениеКоралВэй");
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Перечисление.CW_ВладелецОбъектаДоступа.ЗначениеБухгалтерияПредприятия");
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_CW_ОбъектыОграниченийДоступа");
	
КонецПроцедуры
