&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	ВалютаРегламентированногоУчета 		= Константы.ВалютаРегламентированногоУчета.Получить();
		
	ИнициализацияФормы();
	
	ЗначениеПереключателя_ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат = ?(Запись.ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат, 1, 0);
	ЗначениеПереключателя_УчитыватьКурсыВалютАвансовДляБазыНДС = ?(Запись.УчитыватьКурсыВалютАвансовДляБазыНДС, 1, 0);
	
	Если (ЗначениеЗаполнено(Параметры.ЗначениеКопирования)) Тогда
		ЗаписьРегистра = РегистрыСведений.CW_УчетнаяПолитика.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Параметры.ЗначениеКопирования);
		ЗаписьРегистра.Прочитать();  
		
		ДвоичныеДанныеЛоготип 	= ЗаписьРегистра.Логотип.Получить();  
	Иначе
		ДвоичныеДанныеЛоготип 	= РеквизитФормыВЗначение("Запись").Логотип.Получить();  
	КонецЕсли;  
	
	Если ДвоичныеДанныеЛоготип <> Неопределено Тогда
		АдресЛоготипа = ПоместитьВоВременноеХранилище(ДвоичныеДанныеЛоготип, Новый УникальныйИдентификатор);
	Иначе
		АдресЛоготипа = "";
	КонецЕсли; 
		
	// отрабатываем действия, связанные с изменением даты (вступили в действие с 01.07.16 в соответствии с Приказом ФНС России от 14.03.2016 № ММВ-7-3/136@) 
	_ПериодПриИзменении();   
	
	ТолькоАктуальные = Истина;
	ТолькоАктуальныеНаСервере(); 
	УстановитьОтборДинамическогоСпискаДополнительныхПечатей();  
	
	УстановитьСистемуНалогообложения();

	ПорядокНумерацииПутевыхЛистовПриИзмененииНаСервере(); 
	
	СвояОрганизацияВКачествеПокупателяПриИзмененииНаСервере();
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма); 
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьСистемуНалогообложения()  
	
	МассивУпрощенная		= CW_БухгалтерияЭкспедитораСервер.ПолучитьУпрощенныеСистемыНалогообложения();
	СистемаНалогообложения	= CW_БухгалтерияЭкспедитораСервер.ПолучитьСистемуНалогообложения(Запись.Организация, Запись.Период);
	
	Элементы.НЗПОтражатьВНУ.Видимость = МассивУпрощенная.Найти(СистемаНалогообложения) <> Неопределено;	
	
КонецПроцедуры


 &НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьВидимостьПредупрежденийПланированияПлатежей();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоАктуальные(Команда)
	
	ТолькоАктуальные = Не ТолькоАктуальные;
	ТолькоАктуальныеНаСервере(); 
	УстановитьОтборДинамическогоСпискаДополнительныхПечатей();
	
КонецПроцедуры 

&НаСервере
Процедура ТолькоАктуальныеНаСервере()
	Элементы.ПечатиОрганизацииТолькоАктуальные.Пометка = ТолькоАктуальные;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСпискаДополнительныхПечатей()
	
	ПечатиОрганизации.Отбор.Элементы.Очистить(); 
	
	ПравоеЗначение = ?(ЗначениеЗаполнено(Запись.Организация), Запись.Организация, Неопределено);
	
	ЭлементОтбора = ПечатиОрганизации.Отбор.Элементы.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = новый ПолеКомпоновкиДанных("Организация");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ПравоеЗначение;
	ЭлементОтбора.Использование 	= истина;
	
	Если ТолькоАктуальные Тогда
		ЭлементОтбора = ПечатиОрганизации.Отбор.Элементы.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = новый ПолеКомпоновкиДанных("Актуальная");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Истина;
		ЭлементОтбора.Использование 	= истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ИнициализацияФормы()
	
	//Список выбора
	мСписокВыбора = Новый  Массив;
	мСписокВыбора.Добавить(Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация);
	мСписокВыбора.Добавить(Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты);
	
	Если ВалютаРегламентированногоУчетаРубль Тогда
		мСписокВыбора.Добавить(Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация);
	КонецЕсли;
	
	мСписокВыбора.Добавить(Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор);
	
	Элементы.ПорядокПрисвоенияНомеров.СписокВыбора.ЗагрузитьЗначения(мСписокВыбора);
	
	//////Видимость элементов 
	////Функциональная опция не отрабатывает, так как поля формы не связаны с реквизитыами
	Элементы.СпособыУчетаНДС.Видимость 		= ВалютаРегламентированногоУчетаРубль;
	Элементы.Декорация1.Видимость 			= ВалютаРегламентированногоУчетаРубль;
	
	//Подсистема УчетНЗП
	ВариантУчетаНЗППриИзмененииНаСервере();
	УстановитьВидимостьЭлементовНЗП();
	//---Подсистема УчетНЗП

	УстановитьПараметрыФункциональныхОпций();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыФункциональныхОпций()
	                                        
	УстанавливаемыеПараметры = новый Структура;
	УстанавливаемыеПараметры.Вставить("Организация", Запись.Организация);
	
	УстановитьПараметрыФункциональныхОпцийФормы(УстанавливаемыеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Запись.ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат = (1=ЗначениеПереключателя_ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат);
	Запись.УчитыватьКурсыВалютАвансовДляБазыНДС = (1=ЗначениеПереключателя_УчитыватьКурсыВалютАвансовДляБазыНДС);
	
	ПроверитьСчетаУчета(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСчетаУчета(Отказ)
	
	МассивКонтрольныхСчетов = новый Массив;
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляРоссииСервер");
		МассивКонтрольныхСчетов = Модуль_CW_БухгалтерияЭкспедитораДляРоссииСервер.МассивКонтрольныхСчетов();    
	КонецЕсли; 
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляБелоруси") Тогда  
		Модуль_CW_БухгалтерияЭкспедитораДляБелорусиСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_БухгалтерияЭкспедитораДляБелорусиСервер");
		МассивКонтрольныхСчетов = Модуль_CW_БухгалтерияЭкспедитораДляБелорусиСервер.МассивКонтрольныхСчетов();    
	КонецЕсли; 
	
	МассивИменПроверяемыхПолей = новый Массив;
	МассивИменПроверяемыхПолей.Добавить("СчетРасчетов_Поставщики_Рубли");
	МассивИменПроверяемыхПолей.Добавить("СчетРасчетов_Поставщики_Валюта");
	МассивИменПроверяемыхПолей.Добавить("СчетРасчетов_Поставщики_УЕ");
	МассивИменПроверяемыхПолей.Добавить("СчетРасчетов_Клиенты_Рубли");
	МассивИменПроверяемыхПолей.Добавить("СчетРасчетов_Клиенты_Валюта");
	МассивИменПроверяемыхПолей.Добавить("СчетРасчетов_Клиенты_УЕ");
	
	Для Каждого ИмяПоля Из МассивИменПроверяемыхПолей Цикл
		Если МассивКонтрольныхСчетов.Найти(Запись[ИмяПоля])<> Неопределено Тогда
			_УФКС.СообщитьПользователю("Выбран недопустимый счет учета! ("+СокрЛП(Запись[ИмяПоля])+")",,"Запись."+ИмяПоля,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресЛоготипа) Тогда
		ТекущийОбъект.Логотип = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресЛоготипа));	
	Иначе
		ТекущийОбъект.Логотип = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;	
	
	// безальтернотивное включение опций Постановления №1137 и 735
	Если Запись.Период >= Дата(2015,1,1) Тогда
		ТекущийОбъект.СчетаФактурыПоПостановлению1137 = Истина;
		ТекущийОбъект.ТребованияПостановления735 = Истина;
	КонецЕсли;  
	
	// новые коды видов операций для перевыставления
	Если Запись.Период >= Дата(2016,7,1) Тогда
		ТекущийОбъект.КодВидаОперацииДляВходящихСчетовФактур = "01";
		ТекущийОбъект.КодВидаОперацииДляИсходящихСчетовФактур = "01";
	КонецЕсли;
	
	// с начала действия Постановления Правительста РФ №981
	// в графу "Стоимость (всего)" должны выводиться исключительно
	// перевыставляемые услуги
	Если Запись.Период >= Дата(2017,10,1) Тогда
		ТекущийОбъект.ОбщаяСуммаСчетФактурыВСтрокахСводных = Ложь;
	КонецЕсли; 
	
	ТекущийОбъект.ВедетсяУчетНЗПДирективно = Запись.ВедетсяУчетНЗП и Запись.ВариантУчетаНЗП = ПредопределенноеЗначение("Перечисление.CW_ВариантУчетаНЗП.Директивно");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПодсказкуНумератора()
	
	мОписаниеНумератора = "Нумерация исходящих документов (счета, акта и счета-фактуры) по экспедиторской деятельности осуществляется " + Символы.ПС;
	Если Запись.ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация") Тогда
		мОписаниеНумератора =  мОписаниеНумератора + 
		                       "единым пакетом независимо от документов по остальным видам деятельности организации. 
							   |Номер документа формируется из префикса организации (если он задан) и порядкового номера 
							   |документа в пределах года. 
							   |Пример: Ф0000000003";

	ИначеЕсли Запись.ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты") Тогда
		мОписаниеНумератора = мОписаниеНумератора +
		                      "единым пакетом независимо от документов по остальным видам деятельности организации. 
							  |Номер документа формируется из префикса организации (если он задан), двух цифр месяца, 
							  |двух цифр даты и порядкового номера документа в пределах даты. 
					          |Пример: Ф0314-00003";

	ИначеЕсли Запись.ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация") Тогда
		мОписаниеНумератора = мОписаниеНумератора + 
		                      "в единой последовательности с документами, оформляемыми организацией по прочим видам деятельности. 
							  |Номер документа формируется из префикса организации (если он задан) и порядкового номера 
							  |соответствующего документа (""Счет на оплату покупателю"", ""Реализация товаров и услуг"" и ""Счет-фактура выданный"") 
							  |в пределах года. 
					          |Пример: Счет - Ф0000000003, Акт - Ф0000000021, Счет-фактура - Ф0000000017";

	ИначеЕсли Запись.ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор") Тогда
		мОписаниеНумератора = мОписаниеНумератора + 
		                      "в соответствии с алгоритмом внешнего нумератора, реализованным в виде подключаемой обработки:";
	КонецЕсли; 
	Элементы.ПорядокПрисвоенияНомеров.Подсказка = мОписаниеНумератора;

КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	// начиная с 2015 года применение постановления №1137 является обязательным,
	// поэтому вывод опций скрываем (их принудительная установка 
	// осуществляется при изменении периода)
	Ранее2015 = ?(Запись.Период >= Дата(2015,1,1),Ложь,Истина);
	Элементы.СчетаФактурыПоПостановлению1137.Видимость 			= Ранее2015;
	Элементы.СчетаФактурыПоПостановлению735.Видимость 			= Ранее2015;
	Элементы.ОтражатьСчетаФактурыНаПеревыставление.Видимость 	= Ранее2015;
	Элементы.ВыводитьСтрокуКомиссионераВСчетахФактурах.Видимость= Ранее2015;
	
	// начиная с 01.10.2017 года применение требований постановления 
	// Правительста РФ №981 является обязательным, поэтому вывод опций скрываем 
	// (их принудительная установка  осуществляется при изменении периода)
	Ранее2017_10_01= ?(Запись.Период >= Дата(2017,10,1),Ложь,Истина); 
	Элементы.ОбщаяСуммаСчетФактурыВСтрокахСводных.Видимость = Ранее2017_10_01;
	
	Элементы.ВыводитьСтрокуКомиссионераВСчетахФактурах.Доступность 	= Запись.СчетаФактурыПоПостановлению1137;

	// выводим дополнительную информацию к выбранному значению нумератора
	УстановитьПодсказкуНумератора();
	Элементы.ВнешнийНумератор.Видимость = (Запись.ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор"));
	
КонецПроцедуры

&НаСервере
Процедура _СформироватьСчета()
	// --- 
	
	ВидыСубконто = CW_Конфигурация.ВидыСубконто();
	СубконтоКонтрагент = ВидыСубконто.Контрагенты;
	СубконтоДоговор = ВидыСубконто.Договоры;
	СубконтоДокументВзаиморасчетов = ВидыСубконто.ДокументыРасчетовСКонтрагентами;
	// ---------------------------------------------------------------------------- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Хозрасчетный.Ссылка,
	               |	Хозрасчетный.Код КАК Код
	               |ИЗ
	               |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	               |ГДЕ
	               |	Хозрасчетный.ВидыСубконто.ВидСубконто.Ссылка = &СубконтоКонтрагент
	               |	И Хозрасчетный.ВидыСубконто.ВидСубконто.Ссылка = &СубконтоДоговор
	               |	И Хозрасчетный.ВидыСубконто.ВидСубконто.Ссылка = &СубконтоДокументВзаиморасчетов
	               |	И Хозрасчетный.Валютный = &Валютный
	               |	И Хозрасчетный.Забалансовый = &Забалансовый
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код";
	
	Запрос.УстановитьПараметр("СубконтоКонтрагент", СубконтоКонтрагент);
	Запрос.УстановитьПараметр("СубконтоДоговор", СубконтоДоговор);
	Запрос.УстановитьПараметр("СубконтоДокументВзаиморасчетов", СубконтоДокументВзаиморасчетов);
	// ----------------------------------------------------------------------------  
	Запрос.УстановитьПараметр("Валютный", Ложь); 
	Запрос.УстановитьПараметр("Забалансовый", Ложь); 
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	СписокЗнач = Новый СписокЗначений;
	Для Каждого Стр ИЗ ТЗ Цикл
		Если НЕ (Стр.Код = "76.05" ИЛИ Стр.Код = "76.06") Тогда
			Элементы.СчетРасчетов_Поставщики_Рубли.СписокВыбора.Добавить(Стр.Ссылка,Стр.Код);	
		КонецЕсли; 
	КонецЦикла;	
	// ---------------------------------------------------------------------------- 
	Запрос.УстановитьПараметр("Валютный", Истина); 
	Запрос.УстановитьПараметр("Забалансовый", Ложь); 
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	СписокЗнач = Новый СписокЗначений;
	Для Каждого Стр ИЗ ТЗ Цикл
		Если НЕ (Стр.Код = "76.05" ИЛИ Стр.Код = "76.06") Тогда
			Элементы.СчетРасчетов_Поставщики_Валюта.СписокВыбора.Добавить(Стр.Ссылка,Стр.Код);
			Элементы.СчетРасчетов_Поставщики_УЕ.СписокВыбора.Добавить(Стр.Ссылка,Стр.Код);
		КонецЕсли; 
	КонецЦикла;	
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ПорядокПрисвоенияНомеровПриИзменении(Элемент) 
	
	Если Запись.ПорядокПрисвоенияНомеров = ПредопределенноеЗначение("Перечисление.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты") Тогда
		ПоказатьПредупреждение(,"Внимание!
								|Использование нумерации документов ""В пределах даты"" 
								|может привести к некорректному отображению номеров 
								|документов в налоговой отчетности. Настоятельно 
								|рекомендуем использовать нумератор 
								|""В пределах даты"" исключительно для организации 
								|управленческого документооборота, не подлежащего 
								|отражению в бухгалтерском учете!");                                                                            
	КонецЕсли;

	_ПорядокПрисвоенияНомеровПриИзменении();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура _ПорядокПрисвоенияНомеровПриИзменении()
	
	// очистим внешний нумератор если он не используется
	Если Запись.ПорядокПрисвоенияНомеров <> Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор Тогда
		Запись.ВнешнийНумератор = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокПрисвоенияНомеровОчистка(Элемент, СтандартнаяОбработка)
	_ПорядокПрисвоенияНомеровПриИзменении();
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура СчетаФактурыПоПостановлению1137ПриИзменении(Элемент)
	
	Если (НЕ Запись.СчетаФактурыПоПостановлению1137) Тогда
		Запись.ВыводитьСтрокуКомиссионераВСчетахФактурах=Ложь;	
	КонецЕсли; 
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Функция _СписокСчетовДляВыбора(ПризнакВалюты)
	// --- 
	
	ВидыСубконто = CW_Конфигурация.ВидыСубконто();
	СубконтоКонтрагент = ВидыСубконто.Контрагенты;
	СубконтоДоговор = ВидыСубконто.Договоры;
	СубконтоДокументВзаиморасчетов = ВидыСубконто.ДокументыРасчетовСКонтрагентами;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Хозрасчетный.Код
	               |ИЗ
	               |	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	               |ГДЕ
	               |	Хозрасчетный.ВидыСубконто.ВидСубконто.Ссылка = &СубконтоКонтрагент
	               |	И Хозрасчетный.ВидыСубконто.ВидСубконто.Ссылка = &СубконтоДоговор
	               |	И Хозрасчетный.ВидыСубконто.ВидСубконто.Ссылка = &СубконтоДокументВзаиморасчетов
	               |	И Хозрасчетный.Валютный = &ПризнакВалюты
	               |	И Хозрасчетный.Забалансовый = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("СубконтоКонтрагент", СубконтоКонтрагент);
	Запрос.УстановитьПараметр("СубконтоДоговор", СубконтоДоговор);
	Запрос.УстановитьПараметр("СубконтоДокументВзаиморасчетов", СубконтоДокументВзаиморасчетов);
	// --- 
	Запрос.УстановитьПараметр("ПризнакВалюты", ПризнакВалюты); 
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	СписокЗнач = Новый СписокЗначений;
	Для Каждого Стр ИЗ ТЗ Цикл
		Если НЕ (Стр.Код = "76.05" ИЛИ Стр.Код = "76.06") Тогда
			СписокЗнач.Добавить(Стр.Код);	
		КонецЕсли; 
	КонецЦикла;	
			
	Возврат(СписокЗнач);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ВыборСчета(Реквизит,ПризнакВалюты)
	// --- 
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.ФормаВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыУчетаНДСНажатие(Элемент)
	
	ПФ = Новый Структура("Отбор",Новый Структура("Организация",Запись.Организация));
	ОткрытьФорму("РегистрСведений.CW_СоответствиеНоменклатурныхГруппСпособамУчетаНДС.ФормаСписка",ПФ,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация10Нажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.CW_СтатьиЗатратНоменклатуры.ФормаСписка",,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаФактурыПоПостановлению735ПриИзменении(Элемент)
	
	Если (НЕ Запись.ТребованияПостановления735) Тогда
		Запись.ОбщаяСуммаСчетФактурыВСтрокахСводных = Ложь;
	КонецЕсли; 
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	_ПериодПриИзменении();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура _ПериодПриИзменении()
	
	// начиная с 2015 года применение постановления №1137 и рекомендательных писем является является обязательным
	Если Запись.Период >= Дата(2015,1,1) Тогда
		Запись.СчетаФактурыПоПостановлению1137 = Истина;
		Запись.ТребованияПостановления735 = Истина;
		Запись.ОбщаяСуммаСчетФактурыВСтрокахСводных = Истина;
		Запись.ОтражатьСчетаФактурыНаПеревыставление = Истина;
	КонецЕсли;  
	
	// новые коды видов операций для перевыставления (вступили в действие с 01.07.16 в соответствии с Приказом ФНС России от 14.03.2016 № ММВ-7-3/136@)
	Если Запись.Период >= Дата(2016,7,1) Тогда
		Запись.КодВидаОперацииДляВходящихСчетовФактур = "01";
		Запись.КодВидаОперацииДляИсходящихСчетовФактур = "01";
	КонецЕсли;

	CW_БухгалтерияЭкспедитораСерверПереопределяемый.ЗаполнитьСписокКодовВидовОпераций(
		ПредопределенноеЗначение("Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры"), 
		Элементы.КодВидаОперацииДляВходящихСчетовФактур.СписокВыбора, 
		Запись.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеЭлементамиФормы();
КонецПроцедуры


&НаСервере
Процедура ПорядокНумерацииПутевыхЛистовПриИзмененииНаСервере()
	Элементы.ВнешнийНумераторПутевыхЛистов.Видимость = Запись.ПорядокНумерацииПутевыхЛистов = 1;
КонецПроцедуры


&НаКлиенте
Процедура ПорядокНумерацииПутевыхЛистовПриИзменении(Элемент)
	ПорядокНумерацииПутевыхЛистовПриИзмененииНаСервере();
КонецПроцедуры

//Подсистема УчетНЗП
&НаКлиенте
Процедура ПоОрганизацииВедетсяУчетНЗППриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовНЗП();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовНЗП()
	
	Элементы.ГруппаНастройкиЗП.Видимость = Запись.ВедетсяУчетНЗП;

	Элементы.НЗПОтражатьВНУ.Видимость = Запись.ВедетсяУчетНЗП;
	
	
	
	Элементы.НЗППараметрДатаРеализации.Видимость = 
	(Запись.ВариантУчетаНЗП = ПредопределенноеЗначение("Перечисление.CW_ВариантУчетаНЗП.Автоматически"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантУчетаНЗППриИзменении(Элемент) 
	
	УстановитьВидимостьЭлементовНЗП();  
	ВариантУчетаНЗППриИзмененииНаСервере();
	
КонецПроцедуры    


&НаСервере
Процедура ВариантУчетаНЗППриИзмененииНаСервере()
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии") Тогда 
		СчетЗатрат = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ОсновноеПроизводство");
		
		ВидОперацииУчетнойПолитики = Справочники.НастройкиУчетаЗатрат.ИспользованиеДокументаИнвентаризацияНезавершенногоПроизводства(
		Запись.Период,
		СчетЗатрат,
		Запись.Организация);  
		
		ЧастиЗаголовка = Новый Массив;
		Если Не ЗначениеЗаполнено(ВидОперацииУчетнойПолитики) 
			и Запись.ВариантУчетаНЗП = ПредопределенноеЗначение("Перечисление.CW_ВариантУчетаНЗП.Автоматически") Тогда
			ЧастиЗаголовка.Добавить(
			НСтр("ru = 'Автоматический учет незавершенного произовдства невозможен: для счета %1 учет незавершенного производства по результатам инвентаризации отключен в <a href = ""e1cib/list/РегистрСведений.УчетнаяПолитика"">учетной политике</a>.'"));
		КонецЕсли;
		
		Элементы.ОтключеноУчетнойПолитикой.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(СтрСоединить(ЧастиЗаголовка), ПланыСчетов.Хозрасчетный.ПолноеПредставлениеСчета(СчетЗатрат));
		Элементы.ОтключеноУчетнойПолитикой.Видимость = ЧастиЗаголовка.Количество() > 0;
	КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура НЗППараметрНеВключатьНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДоступныеПараметры = ПолучитьМассивДоступныхПараметров(Тип("Булево"));
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ДоступныеПараметры);
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", ПараметрыВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НЗППараметрДатаРеализацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ДоступныеПараметры = ПолучитьМассивДоступныхПараметров(Тип("Дата"));
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ДоступныеПараметры);
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", ПараметрыВыбора, Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивДоступныхПараметров(ТипЗначения)
	
	Возврат ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСписокПараметровПоТипуЗначения(ТипЗначения);
	
КонецФункции

//---Подсистема УчетНЗП


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьПараметрыФункциональныхОпций();
	
	УстановитьСистемуНалогообложения();
	
КонецПроцедуры  

&НаКлиенте
Процедура ФормироватьСчетаНаОплатуПокупателюПриИзменении(Элемент)
	УстановитьВидимостьПредупрежденийПланированияПлатежей();
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьСчетаНаОплатуПоставщикаПриИзменении(Элемент)
	УстановитьВидимостьПредупрежденийПланированияПлатежей();
КонецПроцедуры   

&НаСервере
Процедура УстановитьВидимостьПредупрежденийПланированияПлатежей()   
	
	Элементы.ГруппаПланированиеПлатежейПокупателей.Видимость = Запись.ФормироватьСчетаПокупателюНаОплату 
					И Не ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейОтПокупателей");
	
	
	Элементы.ГруппаПланированиеПлатежейПоставщиков.Видимость = Запись.ФормироватьСчетаПоставщикаНаОплату 
					И Не ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейПоставщикам");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеПланированиеПлатежейПокупателейОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)   

	СтандартнаяОбработка = Ложь;
	ВыполнитьОбщуюКомандуФункциональность(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры    

&НаКлиенте
Процедура ПредупреждениеПланированиеПлатежейПоставщиковОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ВыполнитьОбщуюКомандуФункциональность(НавигационнаяСсылкаФорматированнойСтроки);

КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьОбщуюКомандуФункциональность(Знач НавигационнаяСсылкаФорматированнойСтроки)
	
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("ТекущаяСтраница", "ГруппаПланированиеПлатежей");
	ОписаниеОповещения = новый ОписаниеОповещения("ФункциональностьПрограммыЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ФункциональностьПрограммы.Форма.ФормаФункциональностьПрограммы",ПараметрыФормы, ЭтаФорма,,,НавигационнаяСсылкаФорматированнойСтроки, ОписаниеОповещения);

КонецПроцедуры    

&НаКлиенте
Процедура ФункциональностьПрограммыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	УстановитьВидимостьПредупрежденийПланированияПлатежей();
КонецПроцедуры


//Логотип
&НаКлиенте
Процедура Логотип_Удалить(Команда)
	АдресЛоготипа = "";
КонецПроцедуры

&НаКлиенте
Процедура Логтип_Выбрать(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	//Текст = "ru = ""Текст""; en = ""Text""";
	Фильтр = 	"Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
	+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
	+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
	+ "Формат TIFF (*.tif)|*.tif|"
	+ "Формат GIF (*.gif)|*.gif|"
	+ "Формат PNG (*.png)|*.png|"
	+ "Формат icon (*.ico)|*.ico|"
	+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|"; // картинки
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Файл 		 = МассивФайлов[0];
		
		АдресФайла = "";
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗагрузкиФайлаЛоготипа",ЭтотОбъект, Новый Структура()); 
		НачатьПомещениеФайла(ОписаниеОповещения, АдресФайла, Файл, Ложь, УникальныйИдентификатор);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!"""));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗагрузкиФайлаЛоготипа(Результат, АдресВременногоХранилищаФайла, ВыбранноеИмя, ДополнительныеПараметры) Экспорт 
	
	Если Результат Тогда
		Успешно = ОбработатьЗагрузкуФайлаЛоготипаНаСервере(АдресВременногоХранилищаФайла);
		Если не Успешно Тогда
			ПоказатьПредупреждение(,"Не удалось загрузить файл!");
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ОбработатьЗагрузкуФайлаЛоготипаНаСервере(Адрес)
	
	Попытка
		ДвоичныеДаныне 	= ПолучитьИзВременногоХранилища(Адрес);
		АдресЛоготипа 	= ПоместитьВоВременноеХранилище(ДвоичныеДаныне, Новый УникальныйИдентификатор);
		Возврат Истина;
	Исключение
	    Возврат Ложь;
	КонецПопытки; 
	
КонецФункции
//Логотип 


&НаКлиенте
Процедура СвояОрганизацияВКачествеПокупателяПриИзменении(Элемент)
	СвояОрганизацияВКачествеПокупателяПриИзмененииНаСервере();
КонецПроцедуры    

&НаСервере
Процедура СвояОрганизацияВКачествеПокупателяПриИзмененииНаСервере()
	
    Элементы.СвояОрганизацияКонтрагент.Видимость = Запись.СвояОрганизацияВКачествеПокупателя;
    Элементы.СвояОрганизацияДоговорКонтрагента.Видимость = Запись.СвояОрганизацияВКачествеПокупателя;

КонецПроцедуры




