#Область ПрограммныйИнтерфейс
	
Процедура ОбработкаЗаполненияЭПД(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(ДанныеЗаполнения);
	Если ТипЗначения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументыОснования") И ЭтотОбъект <> Неопределено Тогда
			Для Каждого ДокументОснование Из ДанныеЗаполнения.ДокументыОснования Цикл
				ДобавитьДокументОснование(ЭтотОбъект, ДокументОснование.ДокументОснование);
			КонецЦикла;
			ДанныеЗаполнения.Удалить("ДокументыОснования");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

Процедура ДобавитьДокументОснование(ТранспортнаяНакладнаяОбъект, ДокументОснованиеСсылка) Экспорт 
	
	Если ДокументОснованиеСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйДокумент = ТранспортнаяНакладнаяОбъект.ДокументыОснования.Найти(ДокументОснованиеСсылка, "ДокументОснование");
	Если НайденныйДокумент = Неопределено Тогда
		НоваяСтрокаОснований = ТранспортнаяНакладнаяОбъект.ДокументыОснования.Добавить();
		НоваяСтрокаОснований.ДокументОснование = ДокументОснованиеСсылка;
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользуетсяОбменЭлектроннымиДокументами(Организация = Неопределено) Экспорт
	Если ЗначениеЗаполнено(Организация) Тогда
		СписокОрганизаций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
	Иначе
		СписокОрганизаций = ОбщегоНазначенияБПВызовСервераПовтИсп.ОрганизацииДанныеКоторыхДоступныПользователю();
	КонецЕсли;
	
	ИспользуетсяОбменЭлектроннымиДокументами = ОбменСКонтрагентами.ЕстьПравоЧтенияНастройкиОбмена() 
		И НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами()
		И СинхронизацияЭДО.ЕстьУчетныеЗаписи(СписокОрганизаций);
		
	Возврат ИспользуетсяОбменЭлектроннымиДокументами;
КонецФункции

Функция ДокументооборотНастроен(Организация, Контрагент) Экспорт
	Если НЕ ЗначениеЗаполнено(Организация) 
		ИЛИ НЕ ЗначениеЗаполнено(Контрагент)
		ИЛИ НЕ ИспользуетсяОбменЭлектроннымиДокументами(Организация)
		ИЛИ НЕ ЭлектронныеДокументыЭДО.ЕстьПравоЧтенияДокументов() Тогда
		
		Возврат Ложь;
	КонецЕсли; 
	
	ПараметрыЭД = Новый Структура;
	
	ПараметрыЭД.Вставить("Организация",  Организация);
	ПараметрыЭД.Вставить("Контрагент",   Контрагент);
	ПараметрыЭД.Вставить("ТипДокумента", ОбменСКонтрагентами.ТипыДокументов().ЭТрН);
	ПараметрыЭД.Вставить("Направление",  Перечисления.НаправленияЭДО.Исходящий);
	
	Возврат ОбменСКонтрагентами.ДокументооборотНастроен(ПараметрыЭД);
КонецФункции

Функция ЭлектронныеДокументыПоОснованию(ДокументыОснования, ТипСсылки = Неопределено) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = Обработки.ЭлектронныеПеревозочныеДокументы.ЗапросПоДокументуОснования();
	
	Обработки.ЭлектронныеПеревозочныеДокументы.ЗаполнитьОбязательныеПараметрыЗапроса(Запрос.Параметры);
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументыОснования);
	Запрос.УстановитьПараметр("НачалоПериода",     Дата(1,1,1));
	Запрос.УстановитьПараметр("КонецПериода",      Дата(1,1,1));
	
	УстановитьПривилегированныйРежим(Истина); 
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь); 
	
	Если ТипСсылки <> Неопределено Тогда
		ТаблицаРезультат = ТаблицаРезультат.Скопировать(Новый Структура("ТипСсылки", ТипСсылки));
	КонецЕсли;
	
	СписокДокументов = Новый СписокЗначений;
	Для каждого СтрокаДокумент Из ТаблицаРезультат Цикл
		ПредставлениеДокумента = СтрШаблон("%1 № %2 от %3 (%4)", 
			СтрокаДокумент.ТипСсылки, 
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаДокумент.НомерЭПД), 
			Формат(СтрокаДокумент.ДатаЭПД,"ДФ=dd.MM.yyyy"),
			СтрокаДокумент.ПредставлениеСостояния);
		
		СписокДокументов.Добавить(СтрокаДокумент.Ссылка, ПредставлениеДокумента, СтрокаДокумент.СостояниеЭДО = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен);
	КонецЦикла;
	
	Возврат СписокДокументов;
КонецФункции

Функция ХранимыеДанныеЭПД(ХранимыеДанныеСсылка) Экспорт
	Результат = Новый Соответствие;
	Если НЕ ЗначениеЗаполнено(ХранимыеДанныеСсылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ХранимыеДанныеСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранимыеДанныеЭПДДанные.Значение КАК Значение,
	|	ХранимыеДанныеЭПДДанные.Имя КАК Ключ
	|ИЗ
	|	Справочник.ХранимыеДанныеЭПД.Данные КАК ХранимыеДанныеЭПДДанные
	|ГДЕ
	|	ХранимыеДанныеЭПДДанные.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции 

Процедура ПолучитьРеквизитыДоговора(СсылкаНаДоговор, ДанныеЗаполнения) Экспорт
	Если НЕ ЗначениеЗаполнено(СсылкаНаДоговор) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДоговор, "Дата, Номер, Наименование");
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции
// Получает количество ЭПД по документу основания
//
// Параметры:
//  ДокументОснование - ДокументСсылка
// 
// Возвращаемое значение:
//  Число
//
Функция КоличествоЭлектронныхДокументов(ДокументОснование) Экспорт
	СписокДокументов = ЭлектронныеДокументыПоОснованию(ДокументОснование);
	
	Возврат СписокДокументов.Количество();
КонецФункции

#КонецОбласти