
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// создаем список выбора для метаданного 
	Для Каждого Метаданное из Метаданные.РегламентныеЗадания Цикл
		Элементы.МетаданныеРЗ.СписокВыбора.Добавить(Строка(Метаданное.Имя), Метаданное.Представление());
	КонецЦикла;

	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого Пользователь из ПользователиИБ Цикл
		
		Пользователь_Имя = _сф.стр_ПолучитьСтроку(Пользователь,";",1);
		Пользователь_ПолноеИмя = _сф.стр_ПолучитьСтроку(Пользователь,";",2);
		
		Элементы.Пользователь.СписокВыбора.Добавить(Пользователь_Имя, Пользователь_ПолноеИмя);
		
	КонецЦикла;
	
	// --- 
	
	ИД = _сф.ст_ПолучитьСвойство(Параметры,"ИдентификаторРЗ");
	
	Если ИД <> Неопределено Тогда
		
		Если ИД <> "" Тогда
			
			ИдентификаторРЗ = ИД;
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ИдентификаторРЗ));
			// --- 
			МетаданныеРЗ 	= РЗ.Метаданные;
			Наименование  	= РЗ.Наименование;
			Ключ 			= РЗ.Ключ;
			Использование	= РЗ.Использование;
			Пользователь	= РЗ.ИмяПользователя;
			
			// --- 
			
			ИнтервалПовтораПриАварийномЗавершении 		= РЗ.ИнтервалПовтораПриАварийномЗавершении;
			КоличествоПовторовПриАварийномЗавершении 	= РЗ.КоличествоПовторовПриАварийномЗавершении;
			
			Если РЗ.Предопределенное Тогда
				
				Элементы.МетаданныеРЗ.ТолькоПросмотр = Истина;
				
			КонецЕсли; 
			
		Иначе
			
			НовоеРЗ = Истина;
						
		КонецЕсли; 
				
	КонецЕсли;
			
	// --- 
	
КонецПроцедуры

&НаКлиенте
Процедура Расписание(Команда)
	// --- 
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(_ПолучитьРасписание(ИдентификаторРЗ));
	ПОВ = Новый ОписаниеОповещения("ОбработатьИзменениеРасписанияРЗ",ЭтотОбъект); 
	Диалог.Показать(ПОВ);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеРасписанияРЗ(РасписаниеОтвет, ДополнительныеПараметры) Экспорт 
	// --- 
	
	_УстановитьРасписание(ИдентификаторРЗ,РасписаниеОтвет);
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПолучитьРасписание(Идентификатор)
	// --- 
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Идентификатор));
	Возврат(РегламентноеЗадание.Расписание);	
	
	// --- 
КонецФункции

&НаСервере
Функция _УстановитьРасписание(Идентификатор,Знач Расписание)
	// --- 
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Идентификатор));
	РегламентноеЗадание.Расписание = Расписание;
	РегламентноеЗадание.Записать();
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		// записываем параметры РЗ
		ЭтаФорма.Закрыть(_ЗаписатьРЗ());
		
	КонецЕсли; 
		
КонецПроцедуры
 
&НаСервере
Функция _ЗаписатьРЗ()
	// --- 
	
	Попытка
			
		РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ИдентификаторРЗ));	
		
		// --- 
		РЗ.Наименование = Наименование;
		РЗ.Использование = Использование;
		РЗ.Ключ = Ключ;
		РЗ.ИмяПользователя = Пользователь;
		// --- 
		РЗ.КоличествоПовторовПриАварийномЗавершении = КоличествоПовторовПриАварийномЗавершении;
		РЗ.ИнтервалПовтораПриАварийномЗавершении = ИнтервалПовтораПриАварийномЗавершении;
		// --- 
		РЗ.Записать();
		
		Возврат(_УФКС.Ответ(0));
		
	Исключение
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура МетаданныеРЗОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НовоеРЗ Тогда
		
		Ответ = _СоздатьРЗ(ВыбранноеЗначение);
		Если Ответ.Код = 0 Тогда
			
			Элементы.МетаданныеРЗ.ТолькоПросмотр=Истина;
			
		Иначе
			
			Сообщить(Ответ.ОписаниеОшибки);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _СоздатьРЗ(Метаданные)
	// --- 
	
	Попытка
		
		РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные);
		РЗ.Использование = Ложь;
		РЗ.Записать();
		ИдентификаторРЗ = РЗ.УникальныйИдентификатор;

		Возврат(_УФКС.Ответ(0));
		
	Исключение
	    
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 
	
		
	// --- 
КонецФункции
 


