&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначенияРеквизитовФормы(Форма)
	
	Форма.CW_ПрименяютсяНормативыРасходаТоплива         	= Константы.CW_ПрименяютсяНормативыРасходаТоплива.Получить();
	Форма.CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива  	= Константы.CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива.Получить();
	Форма.CW_УчитыватьПробегТранспортногоСредстваСГрузом  	= Константы.CW_УчитыватьПробегТранспортногоСредстваСГрузом.Получить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	//Доступность элементов
	Элементы.CW_ВводитьДанныеОПорожнемПробегеВДокументах.Доступность 		= Форма.CW_УчитыватьПробегТранспортногоСредстваСГрузом; 
	Элементы.CW_ВариантОтраженияЗатратПоБУВПределахПогрешности.Доступность 	= Форма.CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива; 
	
	Элементы.CW_РазрешеноСоздаватьПоказателиДляРасчетанормРасходаТоплива.Доступность 	= Форма.CW_ПрименяютсяНормативыРасходаТоплива; 
	Элементы.CW_ИспользуютсяПоказателиТранспортногоСредстваОтдельноОтМодели.Доступность = Форма.CW_ПрименяютсяНормативыРасходаТоплива; 
	Элементы.CW_ПорядокРасчетаНормативаТоплива.Доступность 								= Форма.CW_ПрименяютсяНормативыРасходаТоплива;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаФормы(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры




#Область Формирование_допонительных_свойств_документов
//Создание дополнительных свойств документов

//Свойство "Операция Бух"
&НаКлиенте
Процедура СоздатьСвойствоОперацияВведенаяВручную(Команда)
	
	Если ЗначениеЗаполнено(НаборКонстант.CW_ДополнительноеСвойствоДокументаОперацияВведеннаяВручную) Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСозданияСвойстваРучнаяОперация", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Указанное свойство документа будет заменено новым. Продоложить?", Режим, 0); 
		
	Иначе
		
		ОбработатьФормированиеСвойстваРучнаяОперация();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаСозданияСвойстваРучнаяОперация(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьФормированиеСвойстваРучнаяОперация();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФормированиеСвойстваРучнаяОперация()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяНабораСвойств"	, "Документ_ОперацияБух");
	СтруктураДанных.Вставить("Наименование"		, "Сформирован обработкой учета ГСМ (Операция введенная вручную)");
	СтруктураДанных.Вставить("Заголовок"		, "Сформирован обработкой учета ГСМ");
	СтруктураДанных.Вставить("Имя"				, "СформированОбработкойУчетаГСМ_");
	СтруктураДанных.Вставить("ИмяКонстанты"		, "CW_ДополнительноеСвойствоДокументаОперацияВведеннаяВручную");
	
	Ответ = CW_УчетСобственногоТранспортаСервер.СоздатьИЗаписатьСвойствоДокумента(СтруктураДанных);
	
	Если Ответ.Успешно Тогда
		УстановитьЗначенияКонстнатНаСервере(Ответ);
	Иначе
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать свойство для документа Требование-накладная"+Символы.ПС+Ответ.ОписаниеОшибки;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

//Свойство "Перемещение товаров"
&НаКлиенте
Процедура СоздатьСвойствоСписаниетоваров(Команда)
	
	Если ЗначениеЗаполнено(НаборКонстант.CW_ДополнительноеСвойствоДокументаПеремещениеТоваров) Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСозданияСвойстваПеремещениеТоваров", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Указанное свойство документа будет заменено новым. Продоложить?", Режим, 0); 
		
	Иначе
		
		ОбработатьФОрмированиеСвойстваПеремещениеТоваров();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаСозданияСвойстваПеремещениеТоваров(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьФОрмированиеСвойстваПеремещениеТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФОрмированиеСвойстваПеремещениеТоваров()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяНабораСвойств"	, "Документ_ПеремещениеТоваров");
	СтруктураДанных.Вставить("Наименование"		, "Сформирован обработкой учета ГСМ (Перемещение товаров)");
	СтруктураДанных.Вставить("Заголовок"		, "Сформирован обработкой учета ГСМ");
	СтруктураДанных.Вставить("Имя"				, "СформированОбработкойУчетаГСМ_");
	СтруктураДанных.Вставить("ИмяКонстанты"		, "CW_ДополнительноеСвойствоДокументаПеремещениеТоваров");
	
	Ответ = CW_УчетСобственногоТранспортаСервер.СоздатьИЗаписатьСвойствоДокумента(СтруктураДанных);
	
	Если Ответ.Успешно Тогда
		УстановитьЗначенияКонстнатНаСервере(Ответ);
	Иначе
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать свойство для документа Требование-накладная"+Символы.ПС+Ответ.ОписаниеОшибки;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

//Свойство "Требование накладная"
&НаКлиенте
Процедура СоздатьСвойствоТребованиеНакладаня(Команда)
	
	Если ЗначениеЗаполнено(НаборКонстант.CW_ДополнительноеСвойствоДокументаТребованиеНакладная) Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСозданияСвойстваТребованиеНакладная", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Указанное свойство документа будет заменено новым. Продоложить?", Режим, 0); 
		
	Иначе
		
		ОбработатьФОрмированиеСвойстваТребованиеНакладная();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаСозданияСвойстваТребованиеНакладная(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьФОрмированиеСвойстваТребованиеНакладная();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФОрмированиеСвойстваТребованиеНакладная()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяНабораСвойств"	, "Документ_ТребованиеНакладная");
	СтруктураДанных.Вставить("Наименование"		, "Сформирован обработкой учета ГСМ (Требование-накладная)");
	СтруктураДанных.Вставить("Заголовок"		, "Сформирован обработкой учета ГСМ");
	СтруктураДанных.Вставить("Имя"				, "СформированОбработкойУчетаГСМ_");
	СтруктураДанных.Вставить("ИмяКонстанты"		, "CW_ДополнительноеСвойствоДокументаТребованиеНакладная");
	
	Ответ = CW_УчетСобственногоТранспортаСервер.СоздатьИЗаписатьСвойствоДокумента(СтруктураДанных);
	
	Если Ответ.Успешно Тогда
		УстановитьЗначенияКонстнатНаСервере(Ответ);
	Иначе
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать свойство для документа Требование-накладная"+Символы.ПС+Ответ.ОписаниеОшибки;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&наСервере
Процедура УстановитьЗначенияКонстнатНаСервере(Ответ)
	
	Если ЭтоАдресВременногоХранилища(Ответ.АдресЗначения) тогда
		
		СсылкаНаДополнительныйРеквизит = ПолучитьИзВременногоХранилища(Ответ.АдресЗначения);
		
		НаборКонстант[Ответ.ИмяКонстанты] = СсылкаНаДополнительныйРеквизит;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура CW_УчитыватьПробегТранспортногоСредстваСГрузомПриИзменении(Элемент)
	      
	НаборКонстант.CW_УчитыватьПробегТранспортногоСредстваСГрузом =  CW_УчитыватьПробегТранспортногоСредстваСГрузом;
	ИзмененныеКонстанты = УчитыватьПробегТраснпортногоСредстваСГрузомНаСервере();
	
	УправлениеФормой(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция УчитыватьПробегТраснпортногоСредстваСГрузомНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УчитыватьПробегТранспортногоСредстваСГрузом");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ВводитьДанныеОПорожнемПробегеВДокументах = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ВводитьДанныеОПорожнемПробегеВДокументах");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
		
	 
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаКлиенте
Процедура CW_УчитыватьПогрешностьИзмеренияОстаткаТопливаПриИзменении(Элемент)
	
	
	НаборКонстант.CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива =  CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива;
	ИзмененныеКонстанты = УчитыватьПогрешностьИзмеренияОстаткаТопливаНаСервере();
	                         
	УправлениеФормой(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция УчитыватьПогрешностьИзмеренияОстаткаТопливаНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ВариантОтраженияЗатратПоБУВПределахПогрешности = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ВариантОтраженияЗатратПоБУВПределахПогрешности");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	 
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаКлиенте
Процедура CW_ПрименяютсяНормативыРасходаТопливаПриИзменении(Элемент)
	
	НаборКонстант.CW_ПрименяютсяНормативыРасходаТоплива =  CW_ПрименяютсяНормативыРасходаТоплива;
	ИзмененныеКонстанты = ПрименяютсяНормативыРасходаТопливаНаСервере();
	
	УправлениеФормой(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПрименяютсяНормативыРасходаТопливаНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ПрименяютсяНормативыРасходаТоплива");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ИспользуютсяПоказателиТранспортногоСредстваОтдельноОтМодели = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуютсяПоказателиТранспортногоСредстваОтдельноОтМодели");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_РазрешеноСоздаватьПоказателиДляРасчетанормРасходаТоплива = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_РазрешеноСоздаватьПоказателиДляРасчетанормРасходаТоплива");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ПорядокРасчетаНормативаТоплива = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ПорядокРасчетаНормативаТоплива");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции
