
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ПравоПросмотраПаролей = CW_ПраваДоступа.ПравоДоступно("УправлениеОбменамиДанных");
	// --- 
	//Элементы.ОтобразитьПарольОтправки.Видимость = ПравоПросмотраПаролей;
	//Элементы.ОтобразитьПарольПолучения.Видимость = ПравоПросмотраПаролей;
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПочтовыйАдресПриИзменении(Элемент)
	
	_СформироватьПредставление();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяОтправителяПриИзменении(Элемент)
	
	_СформироватьПредставление();
	
КонецПроцедуры

&НаСервере
Процедура _СформироватьПредставление()
	// --- 
	
	Объект.Наименование = СокрЛП(Объект.ИмяОтправителя)+" <"+СокрЛП(Объект.ПочтовыйАдрес)+">";	
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура АутентификацияSMTPПриИзменении(Элемент)
	
	 _АутентификацияSMTPПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _АутентификацияSMTPПриИзменении()
	// --- 
	
	Элементы.ПользовательSMTP.Видимость = Объект.АутентификацияSMTP;
	Элементы.ПарольSMTP.Видимость = Объект.АутентификацияSMTP;

	
	Если НЕ Объект.АутентификацияSMTP Тогда
		
		Объект.ПользовательSMTP = "";
		Объект.ПарольSMTP = "";
				
	КонецЕсли;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПроверитьНастройки(Команда)
	
	Ответ = _ПроверитьНастройки();
	
	ТекстПредупреждения = "";
	ТекстПредупреждения = ТекстПредупреждения+"Проверка получения почты (pop3): "+?(Ответ.СтатусPOP3,"ОК","ошибка:"+Ответ.ОшибкаPOP3);
	ТекстПредупреждения = ТекстПредупреждения+Символы.ПС+"Проверка получения почты (imap): "+?(Ответ.СтатусIMAP,"ОК","ошибка:"+Ответ.ОшибкаIMAP);
	ТекстПредупреждения = ТекстПредупреждения+Символы.ПС+"Проверка отправки почты (smtp): "+?(Ответ.СтатусSMTP,"ОК","ошибка:"+Ответ.ОшибкаSMTP);
	
	_УФК.ВывестиПредупреждение(ТекстПредупреждения);
			
КонецПроцедуры

&НаСервере
Функция _ПроверитьНастройки()
	// --- 
	
	//Ответ = _УФКС.Ответ();
	Ответ = Новый Структура;
	Ответ.Вставить("Код", 0);
	Ответ.Вставить("ОписаниеОшибки", "");
	Ответ.Вставить("СтатусPOP3",Истина);
	Ответ.Вставить("СтатусSMTP",Истина);
	Ответ.Вставить("СтатусIMAP",Истина);
	Ответ.Вставить("ОшибкаPOP3","");
	Ответ.Вставить("ОшибкаIMAP","");
	Ответ.Вставить("ОшибкаSMTP","");
	
	// сначала проверяем получение почты
	
	Если СокрЛП(Объект.АдресСервераPOP3) <> "" Тогда
		
		Попытка
			
			Почта = Новый ИнтернетПочта;
			Почта.Подключиться(_ЭП.ПолучитьПрофильPOP3(Объект));
			Почта.Отключиться();
			
		Исключение
			
			Ответ.Код=1;
			Ответ.ОшибкаPOP3 = ОписаниеОшибки();
			Ответ.СтатусPOP3 = Ложь;
			
		КонецПопытки;
		
	Иначе
		
		Ответ.Код=1;
		Ответ.ОшибкаPOP3 = "<не указаны параметры>";
		Ответ.СтатусPOP3 = Ложь;
		
	КонецЕсли; 
	
	 
	
	// далее проверяем отправку
	
	Если СокрЛП(Объект.АдресСервераSMTP) <> "" Тогда
		
		Попытка
			
			Почта = Новый ИнтернетПочта;
			Почта.Подключиться(_ЭП.ПолучитьПрофильSMTP(Объект));
			Почта.Отключиться();
			
		Исключение
			
			Ответ.Код=1;
			Ответ.ОшибкаSMTP = ОписаниеОшибки();
			Ответ.СтатусSMTP = Ложь;
			
		КонецПопытки; 
		
	Иначе
		
		Ответ.Код=1;
		Ответ.ОшибкаSMTP = "<не указаны параметры>";
		Ответ.СтатусSMTP = Ложь;
		
	КонецЕсли; 
	
	
	Если СокрЛП(Объект.АдресСервераIMAP) <> "" Тогда
		
		Попытка
			
			Почта = Новый ИнтернетПочта;
			Почта.Подключиться(_ЭП.ПолучитьПрофильIMAP(Объект));
			Почта.Отключиться();
			
		Исключение
			
			Ответ.Код=1;
			Ответ.ОшибкаIMAP = ОписаниеОшибки();
			Ответ.СтатусIMAP = Ложь;
			
		КонецПопытки; 
		
	Иначе
		
		Ответ.Код=1;
		Ответ.ОшибкаIMAP = "<не указаны параметры>";
		Ответ.СтатусIMAP = Ложь;
		
	КонецЕсли; 
	
	
	Возврат(Ответ);
		
	// --- 
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	_АутентификацияSMTPПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПарольПолучения(Команда)
	
	Элементы.Пароль.РежимПароля = (НЕ Элементы.Пароль.РежимПароля);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПарольОтправки(Команда)
	
	Элементы.ПарольSMTP.РежимПароля = (НЕ Элементы.ПарольSMTP.РежимПароля);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.СохранятьОтправленныеПисьма 
		И Не ЗначениеЗаполнено(СокрЛП(Объект.АдресСервераIMAP)) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для сохранения писем в папке ""Отправленные"" необходимо задать настройки сервера IMAP!",,"АдресСервераIMAP","Объект", Отказ);
	КонецЕсли;

КонецПроцедуры



 #Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти
 