
&НаКлиенте
Процедура СписокНазначенийПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборСтатусов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСтатусов()
	
	СписокСтусов.Отбор.Элементы.Очистить();
	
	НазначениеСтатуса = Элементы.СписокНазначений.ТекущаяСтрока;
	
	ЭлементОтбора = СписокСтусов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения 	 = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = НазначениеСтатуса;
	ЭлементОтбора.Использование  = Истина;
	
	Если НазначениеСтатуса <> Неопределено Тогда
		Элементы.ПроводитьПоБухгалтерскомуУчету.Видимость = НазначениеСтатуса.ВлияетНаПроведениеДокументаВБухгалтерскомУчете;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокСтатусов" Тогда
	УстановитьОтборСтатусов();
	КонецЕсли;
	
КонецПроцедуры

