
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	// ---------------------------------------------------------------------------- 
	
	СтркутураОтбора = Параметры.ПараметрыОтбора;
	
	СтркутураОтбора.Свойство("Тягач"			, Тягач);
	СтркутураОтбора.Свойство("Прицеп"			, Прицеп);
	СтркутураОтбора.Свойство("Водитель"			, Водитель);
	
	ТолькоБезФактическихДат = Истина;
	
	мИспользуемыеСтатусы = Новый Массив;
	ВыборкаСтатусов = Справочники.CW_ЛогистическиеСтатусы.ПолучитьМониторинговыеСтатусыОбъекта(Тип("СправочникСсылка.CW_Грузоперевозки"), мИспользуемыеСтатусы);
	
	Пока ВыборкаСтатусов.Следующий() Цикл
		Статусы.Добавить(ВыборкаСтатусов.Ссылка,ВыборкаСтатусов.СсылкаКартинки,Истина);
	КонецЦикла; 
	
	СК = ПолучитьОбщийМакет("CW_СхемаЖурналаГрузоперевозок");
	Журнал_СхемаКомпоновки = ПоместитьВоВременноеХранилище(СК,ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	//_ПолучитьГрузоперевозки()
	ЭтаФорма.Закрыть(_ПолучитьГрузоперевозки());
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьГрузоперевозки()
	// --- 
	
	МассивСообщений = Новый Массив;
	
	// инициализируем схему компоновки данных
	СК = ПолучитьОбщийМакет("CW_СхемаЖурналаГрузоперевозок");
	// --- 
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Журнал_СхемаКомпоновки);
	Журнал_КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	Журнал_КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	Журнал_КомпоновщикНастроек.ЗагрузитьНастройки(СК.НастройкиПоУмолчанию);
	// --- 
	Журнал_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заказ"				, Справочники.CW_Заказы.ПустаяСсылка());
	Журнал_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заявка"				, Справочники.CW_Заявки.ПустаяСсылка());
	Журнал_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьАрхивные"		, Ложь);
	Журнал_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("УказанМассивСсылок"	, Ложь);
	Журнал_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МассивСсылок"			, Неопределено);
	
	// --- 
	// установим отбор по параметрам и статусам
	ОтборДетальных = Журнал_КомпоновщикНастроек.Настройки.Отбор;
	
	// проверяем, что если все статусы помечены или не помечено ни одного, то ничего не делаем
	СписокСтатусов = _сф.сп_ОтобратьПоПометке(Статусы,Истина);
	Если (СписокСтатусов.Количество() = 0 ИЛИ СписокСтатусов.Количество() = Статусы.Количество()) Тогда
		ИспользоватьОтборПоСтатусам = Ложь;
	Иначе
		ИспользоватьОтборПоСтатусам = Истина;	
	КонецЕсли; 
	
	Если (ИспользоватьОтборПоСтатусам) Тогда
		
		Если (СписокСтатусов.Количество() <> 0) Тогда
			
			// создаем группу
			ГруппаИЛИ = ОтборДетальных.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаИЛИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			ГруппаИЛИ.Использование = Истина;
			
			Для каждого Стр Из СписокСтатусов Цикл
				
				НовыйЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка.Статус");
				НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
				НовыйЭлементОтбора.ПравоеЗначение 	= Стр.Значение;
				НовыйЭлементОтбора.Использование 	= Истина;
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// формируем отбор по параметрам
	Если (ЗначениеЗаполнено(Тягач)) Тогда
		
		Запрос = Новый Запрос;
		запрос.Текст = "ВЫБРАТЬ
		               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр КАК Параметр,
		               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр.Идентификатор КАК ПараметрИдентификатор,
		               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста КАК РеквизитПутевогоЛиста
		               |ИЗ
		               |	Справочник.CW_ТипыПеревозок.ПараметрыПутевыхЛистов КАК CW_ТипыПеревозокПараметрыПутевыхЛистов
		               |ГДЕ
		               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста = &РеквизитПутевогоЛиста
		               |	И НЕ CW_ТипыПеревозокПараметрыПутевыхЛистов.Ссылка.ПометкаУдаления
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста,
		               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр,
		               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр.Идентификатор";
		
		Запрос.УстановитьПараметр("РеквизитПутевогоЛиста", Перечисления.CW_РеквизитыПутевыхЛистов.ТранспортноеСредство);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			ОбъектНастройки = ОтборДетальных;
	
			Если Выборка.Количество() > 1 Тогда
				
				ГруппаИЛИ = ОтборДетальных.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаИЛИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
				ГруппаИЛИ.Использование = Истина;
				
				ОбъектНастройки = ГруппаИЛИ;
				
			КонецЕсли;	
			
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.Параметр) Тогда
					
					ЗначениеОтбора = Тягач;
		
					мТипы = Выборка.Параметр.ТипЗначения.Типы();
					Если мТипы.Найти(ТипЗнч(Тягач)) = Неопределено Тогда
						Если мТипы.Найти(Тип("Строка"))<> Неопределено Тогда
							ЗначениеОтбора = Строка(Тягач); 
						КонецЕсли;
					КонецЕсли;
					
					НовыйЭлементОтбора = ОбъектНастройки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка.["+Выборка.ПараметрИдентификатор+"]");
					НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
					НовыйЭлементОтбора.ПравоеЗначение 	= ЗначениеОтбора; 
					НовыйЭлементОтбора.Использование 	= Истина;
					
				КонецЕсли;
				
			КонецЦикла;
				
		 КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
	
	Если (ЗначениеЗаполнено(Прицеп)) Тогда
		
		Запрос = Новый Запрос;
		запрос.Текст = "ВЫБРАТЬ
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр КАК Параметр,
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр.Идентификатор КАК ПараметрИдентификатор,
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста КАК РеквизитПутевогоЛиста
		|ИЗ
		|	Справочник.CW_ТипыПеревозок.ПараметрыПутевыхЛистов КАК CW_ТипыПеревозокПараметрыПутевыхЛистов
		|ГДЕ
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста = &РеквизитПутевогоЛиста
		|	И НЕ CW_ТипыПеревозокПараметрыПутевыхЛистов.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста,
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр,
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр.Идентификатор";
		
		Запрос.УстановитьПараметр("РеквизитПутевогоЛиста", Перечисления.CW_РеквизитыПутевыхЛистов.Прицеп);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			ОбъектНастройки = ОтборДетальных;
			
			Если Выборка.Количество() > 1 Тогда
				
				ГруппаИЛИ = ОтборДетальных.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаИЛИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
				ГруппаИЛИ.Использование = Истина;
				
				ОбъектНастройки = ГруппаИЛИ;
				
			КонецЕсли;
			
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.Параметр) Тогда
					
					ЗначениеОтбора = Прицеп;
					
					мТипы = Выборка.Параметр.ТипЗначения.Типы();
					Если мТипы.Найти(ТипЗнч(Прицеп)) = Неопределено Тогда
						Если мТипы.Найти(Тип("Строка"))<> Неопределено Тогда
							ЗначениеОтбора = Строка(Прицеп); 
						КонецЕсли;
					КонецЕсли;
					
					НовыйЭлементОтбора = ОбъектНастройки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка.["+Выборка.ПараметрИдентификатор+"]");
					НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
					НовыйЭлементОтбора.ПравоеЗначение 	= ЗначениеОтбора;
					НовыйЭлементОтбора.Использование 	= Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
	
	Если (ЗначениеЗаполнено(Водитель)) Тогда
		
		Запрос = Новый Запрос;
		запрос.Текст = "ВЫБРАТЬ
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр КАК Параметр,
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр.Идентификатор КАК ПараметрИдентификатор,
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста КАК РеквизитПутевогоЛиста
		|ИЗ
		|	Справочник.CW_ТипыПеревозок.ПараметрыПутевыхЛистов КАК CW_ТипыПеревозокПараметрыПутевыхЛистов
		|ГДЕ
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста = &РеквизитПутевогоЛиста
		|	И НЕ CW_ТипыПеревозокПараметрыПутевыхЛистов.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста,
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр,
		|	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр.Идентификатор";
		
		Запрос.УстановитьПараметр("РеквизитПутевогоЛиста", Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_Водитель);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			
			ОбъектНастройки = ОтборДетальных;
			
			Если Выборка.Количество() > 1 Тогда
				
				ГруппаИЛИ = ОтборДетальных.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаИЛИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
				ГруппаИЛИ.Использование = Истина;
				
				ОбъектНастройки = ГруппаИЛИ;
				
			КонецЕсли;
			
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.Параметр) Тогда
					
					ЗначениеОтбора = Водитель;
					
					мТипы = Выборка.Параметр.ТипЗначения.Типы();
					Если мТипы.Найти(ТипЗнч(Водитель)) = Неопределено Тогда
						Если мТипы.Найти(Тип("Строка"))<> Неопределено Тогда
							ЗначениеОтбора = Строка(Водитель); 
						КонецЕсли;
					КонецЕсли;
					
					НовыйЭлементОтбора = ОбъектНастройки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка.["+Выборка.ПараметрИдентификатор+"]");
					НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
					НовыйЭлементОтбора.ПравоеЗначение 	= ЗначениеОтбора;
					НовыйЭлементОтбора.Использование 	= Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;

	КонецЕсли;
	
	// --- 
	
	Если (ЗначениеЗаполнено(Контрагент)) Тогда
		
		НовыйЭлементОтбора = ОтборДетальных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка.Клиент");
		НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение 	= Контрагент;
		НовыйЭлементОтбора.Использование 	= Истина; 
		
	КонецЕсли;
	
	
	// ---------------------------------------------------------------------------- 
	ТаблицаРезультата 	= Новый ТаблицаЗначений;
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорВывода 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	// --- 
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	// --- 
	Попытка
		
		СхемаКомпоновки = ПолучитьИзВременногоХранилища(Журнал_СхемаКомпоновки);
		//СхемаКомпоновки = СК;
		НовыеНастройки = Журнал_КомпоновщикНастроек.ПолучитьНастройки();
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НовыеНастройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		// --- 
		// <фиксвоимялуны>
		Для каждого Ячейка Из МакетКомпоновкиДанных.Макеты[0].Макет.Ячейки Цикл
			Если (Найти(Ячейка.Имя,"[")<>0) Тогда
				Ячейка.Имя = CW_Журналы_Сервер.ИмяПоляКомпоновкиДанных(Ячейка.Имя);
			КонецЕсли; 
		КонецЦикла;
		Для каждого Ячейка Из МакетКомпоновкиДанных.Макеты[1].Макет.Ячейки Цикл
			Если (Найти(Ячейка.Колонка,"[")<>0) Тогда
				Ячейка.Колонка = CW_Журналы_Сервер.ИмяПоляКомпоновкиДанных(Ячейка.Колонка);
			КонецЕсли; 
		КонецЦикла;
		// </фиксвоимялуны>
		// --- 
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновкиДанных);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	Исключение
		
		//УФ.Журнал_Данные.Очистить();
		//Сообщить(ОписаниеОшибки());
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки;
	
	Если (ТолькоБезФактическихДат) Тогда
		
		Запрос = Новый Запрос;
		запрос.Текст = "ВЫБРАТЬ
		               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр КАК Параметр
		               |ИЗ
		               |	Справочник.CW_ТипыПеревозок.ПараметрыПутевыхЛистов КАК CW_ТипыПеревозокПараметрыПутевыхЛистов
		               |ГДЕ
		               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста В (&мРеквизитыПутевогоЛиста)
		               |	И НЕ CW_ТипыПеревозокПараметрыПутевыхЛистов.Ссылка.ПометкаУдаления
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр";
		
		
		мРеквизитыПутевогоЛиста = Новый Массив;
		мРеквизитыПутевогоЛиста.Добавить(Перечисления.CW_РеквизитыПутевыхЛистов.ВыездФакт);
		мРеквизитыПутевогоЛиста.Добавить(Перечисления.CW_РеквизитыПутевыхЛистов.ВозвращениеФакт);
		мРеквизитыПутевогоЛиста.Добавить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаВыезда);
		мРеквизитыПутевогоЛиста.Добавить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаВозвращения);
		
		Запрос.УстановитьПараметр("мРеквизитыПутевогоЛиста", мРеквизитыПутевогоЛиста);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		МассивУдаляемых = Новый Массив;
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();

			Пока Выборка.Следующий() Цикл
				
				ОтборПоПараметру 	= Новый Структура("Параметр", Выборка.Параметр);
				
				Для Каждого Стр из ТаблицаРезультата Цикл
					
					СтрокаПараметра = _сф.к_НайтиСтроку(Стр.Ссылка.ПараметрыГрузоперевозки,ОтборПоПараметру);
					Если (СтрокаПараметра <> Неопределено) Тогда
						
						Если (ЗначениеЗаполнено(СтрокаПараметра.ЗначениеФакт)) Тогда
							
							Если МассивУдаляемых.Найти(Стр) = Неопределено Тогда 
								
								МассивУдаляемых.Добавить(Стр);
								Продолжить;
							
							КонецЕсли;
							
						КонецЕсли; 
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// --- 
		_сф.к_УдалитьЭлементыПоМассиву(ТаблицаРезультата,МассивУдаляемых);
		
	КонецЕсли; 
	
	Ответ = _УФКС.Ответ();
	Ответ.Вставить("Грузоперевозки",ТаблицаРезультата.ВыгрузитьКолонку("Ссылка"));
	// --- 
	Возврат(Ответ);
	
	// --- 
КонецФункции
 
