
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресЗначений   			= Параметры.АдресЗначений;    
	АдресЗначенияПоУмолчанию	= Параметры.АдресЗначенияПоУмолчанию;    
	
	СписокЗначений.ТипЗначения	= Параметры.ОписаниеТипов;
	
	МассивЗначений = ПолучитьИзВременногоХранилища(АдресЗначений);
	СписокЗначений.ЗагрузитьЗначения(МассивЗначений);  
	
	ЗначениеПоУмолчанию = ПолучитьИзВременногоХранилища(АдресЗначенияПоУмолчанию);
	Если ЗначениеПоУмолчанию <> Неопределено Тогда
		ЭлементСписка = СписокЗначений.НайтиПоЗначению(ЗначениеПоУмолчанию);
		Если ЭлементСписка <> Неопределено Тогда
			 ЭлементСписка.Пометка = истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеСписка(Команда) 
	
	МассивЗначений = СписокЗначений.ВыгрузитьЗначения();     
	
	ЗначениеПоУмолчанию = Неопределено;
	Для Каждого ЭлементСписка из СписокЗначений Цикл
		Если ЭлементСписка.Пометка Тогда
			ЗначениеПоУмолчанию = ЭлементСписка.Значение;
			Прервать;
		Конецесли;
	КонецЦикла;    
	
	ПоместитьВоВременноеХранилище(МассивЗначений, 		АдресЗначений);   
	
	Если ЗначениеПоУмолчанию <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(ЗначениеПоУмолчанию, АдресЗначенияПоУмолчанию);
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПоУмолчанию(Команда) 
	
	ТекущаяСтрока = Элементы.СписокЗначений.ТекущаяСтрока;
	ИспользоватьПоУмолчаниюНаСервере(ТекущаяСтрока);  
	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьПоУмолчаниюНаСервере(ТекущаяСтрока)    
	
	Для Каждого СтрокаТаблицы из СписокЗначений Цикл
		СтрокаТаблицы.Пометка = (ТекущаяСтрока = СтрокаТаблицы.ПолучитьИдентификатор());	
	КонецЦикла;
	
КонецПроцедуры
