
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыОтчета  = ПолучитьПараметрыОткрытияОтчета(ПараметрКоманды);
	
	ОткрытьФорму("Отчет.CW_ОжидаемыеЗатраты.Форма",ПараметрыОтчета, ПараметрыВыполненияКоманды.Источник); 
	//ФормаОтчета = ПолучитьФорму("Отчет.CW_ОжидаемыеЗатраты.Форма",ПараметрыОтчета.СтруктураПараметров, ПараметрыВыполненияКоманды.Источник);
	//ФормаОтчета.Отчет.КомпоновщикНастроек 	= ПараметрыОтчета.КомпоновщикНастроек; 
	//
	//ФормаОтчета.Отчет.ПорядокРасчетаРублевогоЭквивалентаПлановыхСтатейЗатрат = 1;
	//ФормаОтчета.Отчет.ФактическиПолученныеЗатратыНаДату = ТекущаяДата(); 
	//ФормаОтчета.Отчет.ФактическиеДокументы 		= "АКТЫ";
	//ФормаОтчета.Отчет.УчитыватьПоставщика 		= Ложь;
	//ФормаОтчета.Отчет.УчитыватьПорядокОтражения	= Ложь;
	//ФормаОтчета.Отчет.ВерсияБюджета 			= ПредопределенноеЗначение("Справочник.CW_ВерсииБюджетов.Основная"); 
	//    
	//ФормаОтчета.СкомпоноватьРезультат();
	//ФормаОтчета.Открыть();
	
КонецПроцедуры  

 &НаСервере
Функция ПолучитьПараметрыОткрытияОтчета(ПараметрКоманды)
	
	ОтчетОбъект = Отчеты.CW_ОжидаемыеЗатраты.Создать();
	ОтчетОбъект.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	
	ИмяПоляКомпоновки = "Грузоперевозка";
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Заказы") Тогда
		ИмяПоляКомпоновки = "Заказ";
	КонецЕсли;
	
	ЗначениеОтбора = Новый СписокЗначений;         
	ЗначениеОтбора.ЗагрузитьЗначения(ПараметрКоманды);  
	
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
		ОтчетОбъект.КомпоновщикНастроек,
		ИмяПоляКомпоновки,
		ЗначениеОтбора,
		ВидСравненияКомпоновкиДанных.ВСписке,
		Истина,
		Истина);   
	
	СписокЗатраты = Новый СписокЗначений;         
	СписокЗатраты.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"));  

	БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
		ОтчетОбъект.КомпоновщикНастроек,
		"ПорядокОтражения",
		СписокЗатраты,
		ВидСравненияКомпоновкиДанных.ВСписке,
		Истина,
		Истина);  
		
	НастрокиКомпоновщика = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();

	ПараметрыОткрытия = Новый Структура(); 	
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыОткрытия.Вставить("КлючВарианта", 				"ОжидаемыеЗатраты"); 
	ПараметрыОткрытия.Вставить("ПоказатьСкрытьНастройки", 	Ложь);
	ПараметрыОткрытия.Вставить("НастрокиКомпоновщика", 		НастрокиКомпоновщика);
	
	Возврат ПараметрыОткрытия;

КонецФункции


