
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	// ---------------------------------------------------------------------------- 
	
	_ПраваДоступа();
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	_УправлениеЭлементамиФормы();
	
	_СформироватьЗаголовок();
	КонтрольСуммыСтрок();
	
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	////Подсистема.УчетПриложенийДоговоров
	//CW_УчетПриложенийДоговоровСервер.УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	////Подсистема.УчетПриложенийДоговоров

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

Функция _ПраваДоступа()
	// --- 
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов");
	Если (НЕ ПравоРедактирования ИЛИ ЭтаФорма.ТолькоПросмотр) Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	// --- 
КонецФункции
  

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	// --- 
	
	// --- 
КонецПроцедуры

// --- 

Процедура НомерПриИзменении(Элемент)
	_СформироватьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	_СформироватьЗаголовок();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	_СформироватьЗаголовок();
	КонтрольСуммыСтрок();
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	////Подсистема.УчетПриложенийДоговоров
	//CW_УчетПриложенийДоговоровСервер.УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	////Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаСервере
Функция КонтрольСуммыСтрок()
	// --- 
	
	Для каждого Стр Из Объект.ТаблицаКорректировки Цикл
		
		Стр.СуммаРаспределения = Стр.СуммаДУ + Стр.СуммаДК + Стр.СуммаДЕ;
		
	КонецЦикла; 
	
	// --- 
КонецФункции
 

&НаСервере
Функция _СформироватьЗаголовок()
	// --- 
	
	// --- 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТаблицаКорректировкиСуммаПриИзменении(Элемент)
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаКорректировкиСуммаДУПриИзменении(Элемент)
	
	СуммаРаспределения(Элемент);	
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаКорректировкиСуммаДКПриИзменении(Элемент)
	
	СуммаРаспределения(Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаКорректировкиСуммаДЕПриИзменении(Элемент)
	
	СуммаРаспределения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаРаспределения(Элемент)
	// --- 
	
	ТД = Элементы.ТаблицаКорректировки.ТекущиеДанные;
	Если (ТД <> Неопределено) Тогда
		
		ТД.СуммаРаспределения = ТД.СуммаДУ + ТД.СуммаДК + ТД.СуммаДЕ;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ЗаполнитьПоДаннымБУ(Команда)
	
	_ЗаполнитьПоДаннымБУ();
	
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьПоДаннымБУ()
	
	Счета = CW_Конфигурация.ПланСчетов();
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(Счета.РасчетыПоАвансамПолученным);
	МассивСчетов.Добавить(Счета.РасчетыПоАвансамПолученнымВал);
	МассивСчетов.Добавить(Счета.РасчетыПоАвансамПолученнымУЕ);
	
	_сф.м_ДобавитьУникально(МассивСчетов,CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "СчетРасчетов_Клиенты_Рубли"));
	_сф.м_ДобавитьУникально(МассивСчетов,CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "СчетРасчетов_Клиенты_Валюта"));
	_сф.м_ДобавитьУникально(МассивСчетов,CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "СчетРасчетов_Клиенты_УЕ"));

	Субконто = Новый Массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка,
	               |	CW_ДоговорыПоГрузоперевозкам.УчетныйДоговор КАК УчетныйДоговор
	               |ПОМЕСТИТЬ ВТ_ДоговорыПоГрузоперевозкам
	               |ИЗ
	               |	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоговорыПоГрузоперевозкам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ПриложенияКДоговорам.УчетныйДоговор КАК УчетныйДоговор
	               |ПОМЕСТИТЬ ВТ_УчетныеДоговораПриложений
	               |ИЗ
	               |	Справочник.CW_ПриложенияКДоговорам КАК CW_ПриложенияКДоговорам
	               |ГДЕ
	               |	CW_ПриложенияКДоговорам.Договор В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_ДоговорыПоГрузоперевозкам КАК ВТ_ДоговорыПоГрузоперевозкам)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДоговорыПоГрузоперевозкам.УчетныйДоговор КАК УчетныйДоговор
	               |ПОМЕСТИТЬ ВТ_УчетныеДоговора
	               |ИЗ
	               |	ВТ_ДоговорыПоГрузоперевозкам КАК ВТ_ДоговорыПоГрузоперевозкам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_УчетныеДоговораПриложений.УчетныйДоговор
	               |ИЗ
	               |	ВТ_УчетныеДоговораПриложений КАК ВТ_УчетныеДоговораПриложений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	               |	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	               |	ХозрасчетныйОстатки.Субконто3 КАК ДокументОплаты,
	               |	ХозрасчетныйОстатки.Субконто3.Дата КАК ДатаДокументаОплаты,
	               |	ХозрасчетныйОстатки.Счет КАК СчетАванса,
	               |	-ХозрасчетныйОстатки.СуммаОстаток КАК Сумма
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |			&Период,
	               |			Счет В (&Счета),
	               |			&Субконто,
	               |			Организация = &Организация
	               |				И Субконто2 В
	               |					(ВЫБРАТЬ
	               |						ВТ_УчетныеДоговора.УчетныйДоговор КАК УчетныйДоговор
	               |					ИЗ
	               |						ВТ_УчетныеДоговора КАК ВТ_УчетныеДоговора)) КАК ХозрасчетныйОстатки
	               |ГДЕ
	               |	-ХозрасчетныйОстатки.СуммаОстаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаДокументаОплаты
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Период", 		Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Счета", 			МассивСчетов);
	Запрос.УстановитьПараметр("Субконто", 		Субконто);
	
	РезультатЗпроса = Запрос.Выполнить();
	Выборка = РезультатЗпроса.Выбрать();
	
	Объект.ТаблицаКорректировки.Очистить();

	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ТаблицаКорректировки.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.СуммаДК 			= Выборка.Сумма;
		НоваяСтрока.СуммаРаспределения 	= Выборка.Сумма; 
		
	КонецЦикла;

	
КонецПроцедуры
 
// --- 

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	// --- 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорректировкиДоговорПриИзменении(Элемент)
	
	////Подсистема.УчетПриложенийДоговоров
	//CW_УчетПриложенийДоговоровКлиентСервер.ПриИзмененеииДоговораВСтрокеТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	////Подсистема.УчетПриложенийДоговоров

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорректировкиКонтрагентПриИзменении(Элемент)
	
	////Подсистема.УчетПриложенийДоговоров
	//CW_УчетПриложенийДоговоровКлиентСервер.ПриИзмененеииКонтрагентаВСтрокеТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	////Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

