
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ПроверитьВозможностьВыполненияКоманды(ПараметрКоманды);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	ПолучитьСтруктуруПараметраКоманды(ПараметрКоманды, СтруктураПараметров);
	
	СтруктураПараметров.Вставить("ВнешнийВызов"			, Истина);
	
	ОткрытьФорму("Отчет.CW_РеализацияЗаПериод.Форма",СтруктураПараметров,ПараметрыВыполненияКоманды);
	
КонецПроцедуры

&наКлиенте
Функция ПроверитьВозможностьВыполненияКоманды(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Грузоперевозки") 
		ИЛИ  ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Заказы") 
		ИЛИ  ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") 
		ИЛИ  ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
		Возврат Ложь
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


&НаСервере
Процедура  ПолучитьСтруктуруПараметраКоманды(ПараметрКоманды, СтруктураПараметров)
	
	Если  ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		мДокументы = Новый Массив;
		мДокументы.Добавить(ПараметрКоманды);
		
		ДатаПервичногоДокумента = ?(ПараметрКоманды.ФормируетсяАкт, ПараметрКоманды.ДатаАкта, ПараметрКоманды.ДатаСчета);
		
		НачалоПериода 			= Мин(ПараметрКоманды.Дата, ДатаПервичногоДокумента);
		КонецПериода  			= Макс(ПараметрКоманды.Дата, ДатаПервичногоДокумента);
		
		ВариантФормирования 	= ?(ПараметрКоманды.ФормируетсяАкт, 0, 1);
		
	Иначе	
		
		Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			
			мГрузоперевозки = новый Массив;
			мГрузоперевозки.Добавить(ПараметрКоманды);
			
			ЗапросДокументы = новый Запрос;
			ЗапросДокументы.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			ЗапросДокументы.Текст = "ВЫБРАТЬ
			                        |	CW_ДоходыПоГрузоперевозкамОбороты.ДокументДоходов КАК ДокументДоходов
			                        |ПОМЕСТИТЬ ВТ_ДокументыДоходов
			                        |ИЗ
			                        |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам.Обороты(, , Период, Грузоперевозка В (&мГрузоперевозки)) КАК CW_ДоходыПоГрузоперевозкамОбороты";
			
			ЗапросДокументы.УстановитьПараметр("мГрузоперевозки", мГрузоперевозки);
			
			ЗапросДокументы.Выполнить();
		
		ИначеЕсли  ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Заказы") Тогда
			
			Запрос = новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	CW_Грузоперевозки.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
			               |ГДЕ
			               |	CW_Грузоперевозки.Заказ = &Заказ";
			
			Запрос.УстановитьПараметр("Заказ", ПараметрКоманды);
			
			мГрузоперевозки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			ЗапросДокументы = новый Запрос;
			ЗапросДокументы.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			ЗапросДокументы.Текст = "ВЫБРАТЬ
			                        |	CW_ДоходыПоГрузоперевозкамОбороты.ДокументДоходов КАК ДокументДоходов
			                        |ПОМЕСТИТЬ ВТ_ДокументыДоходов
			                        |ИЗ
			                        |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам.Обороты(, , Период, Грузоперевозка В (&мГрузоперевозки)) КАК CW_ДоходыПоГрузоперевозкамОбороты";
			
			ЗапросДокументы.УстановитьПараметр("мГрузоперевозки", мГрузоперевозки);
			
			ЗапросДокументы.Выполнить();
			
			
		ИначеЕсли  ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
			
			СтруктураДокументов = Документы.CW_ОтчетЭкспедитора.ПолучитьСвязанныеДоходыПоГрузопереовзкам(ПараметрКоманды);
			
			мДокументы = СтруктураДокументов.Проведенные;
			
			ЗапросДокументы = новый Запрос;
			ЗапросДокументы.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			ЗапросДокументы.Текст = "ВЫБРАТЬ
			                        |	CW_ДоходыПоГрузоперевозкамОбороты.ДокументДоходов КАК ДокументДоходов
			                        |ПОМЕСТИТЬ ВТ_ДокументыДоходов
			                        |ИЗ
			                        |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам.Обороты(, , Период, ДокументДоходов В (&ДокументДоходов)) КАК CW_ДоходыПоГрузоперевозкамОбороты";
			
			ЗапросДокументы.УстановитьПараметр("ДокументДоходов", мДокументы);
			
			ЗапросДокументы.Выполнить();
			
		КонецЕсли;

		//Получение дат отчета
		ЗапросДокументы.Текст = "ВЫБРАТЬ
		                        |	МИНИМУМ(ВЫБОР
		                        |			КОГДА ВТ_ДокументыДоходов.ДокументДоходов.ФормируетсяАкт
		                        |				ТОГДА ВТ_ДокументыДоходов.ДокументДоходов.ДатаАкта
		                        |			ИНАЧЕ ВТ_ДокументыДоходов.ДокументДоходов.ДатаСчета
		                        |		КОНЕЦ) КАК МинДатаАктаСчета,
		                        |	МАКСИМУМ(ВЫБОР
		                        |			КОГДА ВТ_ДокументыДоходов.ДокументДоходов.ФормируетсяАкт
		                        |				ТОГДА ВТ_ДокументыДоходов.ДокументДоходов.ДатаАкта
		                        |			ИНАЧЕ ВТ_ДокументыДоходов.ДокументДоходов.ДатаСчета
		                        |		КОНЕЦ) КАК МаксДатаАктаСчета,
		                        |	МИНИМУМ(ВТ_ДокументыДоходов.ДокументДоходов.Дата) КАК МинДата,
		                        |	МАКСИМУМ(ВТ_ДокументыДоходов.ДокументДоходов.Дата) КАК МаксДата,
		                        |	МАКСИМУМ(ВТ_ДокументыДоходов.ДокументДоходов.ФормируетсяАкт) КАК ФормируетсяАкт,
		                        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДокументыДоходов.ДокументДоходов.ФормируетсяАкт) КАК ФормируетсяАктРазличные
		                        |ПОМЕСТИТЬ ВТ_Даты
		                        |ИЗ
		                        |	ВТ_ДокументыДоходов КАК ВТ_ДокументыДоходов
		                        |;
		                        |
		                        |////////////////////////////////////////////////////////////////////////////////
		                        |ВЫБРАТЬ
		                        |	ЕСТЬNULL(ВТ_Даты.МинДатаАктаСчета, НАЧАЛОПЕРИОДА(&ДатаПериода, МЕСЯЦ)) КАК МинДатаАктаСчета,
		                        |	ЕСТЬNULL(ВТ_Даты.МаксДатаАктаСчета, КОНЕЦПЕРИОДА(&ДатаПериода, МЕСЯЦ)) КАК МаксДатаАктаСчета,
		                        |	ЕСТЬNULL(ВТ_Даты.МинДата, НАЧАЛОПЕРИОДА(&ДатаПериода, МЕСЯЦ)) КАК МинДата,
		                        |	ЕСТЬNULL(ВТ_Даты.МаксДата, КОНЕЦПЕРИОДА(&ДатаПериода, МЕСЯЦ)) КАК МаксДата,
		                        |	ЕСТЬNULL(ВТ_Даты.ФормируетсяАкт,ЛОЖЬ) КАК ФормируетсяАкт,
		                        |	ЕСТЬNULL(ВТ_Даты.ФормируетсяАктРазличные,0) КАК ФормируетсяАктРазличные
		                        |ИЗ
		                        |	ВТ_Даты КАК ВТ_Даты";
		
		ЗапросДокументы.УстановитьПараметр("ДатаПериода", ТекущаяДата()); 
		
		РезультатЗапроса = ЗапросДокументы.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			НачалоПериода 			= НачалоМесяца(ТекущаяДата());
			КонецПериода 			= КонецМесяца(ТекущаяДата());
			ВариантФормирования 	= 0;
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			НачалоПериода 			= Мин(Выборка.МинДата				, Выборка.МинДатаАктаСчета);
			КонецПериода  			= Макс(Выборка.МаксДата				, Выборка.МаксДатаАктаСчета);
			ФормируетсяАкт 			= ?(Выборка.ФормируетсяАктРазличные=1, Выборка.ФормируетсяАкт , ложь);
			ВариантФормирования 	= ?(ФормируетсяАкт, 0, 1);
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	мГруппировки 	= Новый Структура;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Грузоперевозки") или 
		ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Заказы") Тогда
		
		СтруктураОтбора.Вставить("Грузоперевозка", мГрузоперевозки);
		
		мГруппировки.Вставить("Грузоперевозка"	, "Грузоперевозка");
		мГруппировки.Вставить("ДокументДоходов"	, "Документ доходов");
		мГруппировки.Вставить("Номенклатура"	, "Номенклатура");
		
	Иначе
		СтруктураОтбора.Вставить("ДокументДоходов", мДокументы);
		
		мГруппировки.Вставить("ДокументДоходов"	, "Документ доходов");
		мГруппировки.Вставить("Номенклатура"	, "Номенклатура");
		мГруппировки.Вставить("Грузоперевозка"	, "Грузоперевозка");
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода"		, НачалоДня(НачалоПериода));
	СтруктураПараметров.Вставить("КонецПериода"			, КонецДня(КонецПериода));
	СтруктураПараметров.Вставить("ВариантФормирования"	, ВариантФормирования);
	СтруктураПараметров.Вставить("Группировки"			, мГруппировки);
	СтруктураПараметров.Вставить("Отбор"				, СтруктураОтбора);
	
	
КонецПроцедуры



