#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// если владелец неопределен, то создаем его
	Если Владелец = Справочники.CW_ВладельцыАрхива.ПустаяСсылка() Тогда
		Владелец = CW_РаботаСФайламиСервер.ПолучитьВладельцаАрхиваПоОбъекту(Объект);	
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	РазмерСтрокой = _сф.ф_ПриведенныйРазмер(Размер);
	
	Если Константы.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив.Получить() Тогда
		Если Не ЗначениеЗаполнено(ТипДокумента) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран тип документа!",ЭтотОбъект,"ТипДокумента",,Отказ);
		КонецЕсли;
	КонецЕсли;  
	
	Если ЭтоНовый() Тогда
		Автор 			= ПараметрыСеанса.ТекущийПользователь;
		ДатаРегистрации = ТекущаяДатаСеанса();	
	Конецесли;
	
	Редактор		= ПараметрыСеанса.ТекущийПользователь;
	ДатаИзменения 	= ТекущаяДатаСеанса();
		
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли; 
	
	ОчиститьРегистрНаличияФайлов();  
	
	Если ВОблаке или ЗначениеЗаполнено(ОбъектАрхиваВладелец) Тогда   
		Возврат;
	КонецЕсли;
	
	//Удаляем файлы только для файлов, которые прикреплены и не в облаке
	ПолноеИмяФайла = CW_РаботаСФайламиСервер.ПолучитьПолноеИмяФайла(Ссылка);
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Файл.Существует() Тогда    
		УдалитьФайлы(ПолноеИмяФайла);
	КонецЕсли; 
	
	Справочники.CW_ОбъектыАрхива.УдалитьСвязанныеСсылки(Ссылка);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		ОчиститьРегистрНаличияФайлов();
	Иначе
		Запись = РегистрыСведений.CW_НаличиеФайловАрхиваПоОбъектам.СоздатьМенеджерЗаписи();
		Запись.Объект = Объект;
		Запись.Признак = Истина;
		Запись.Записать(Истина);
	КонецЕсли; 
		
КонецПроцедуры

Процедура ОчиститьРегистрНаличияФайлов()
	
	// проверяем, что больше по документу нет файлов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ОбъектыАрхива.Ссылка КАК Количество
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	               |ГДЕ
	               |	CW_ОбъектыАрхива.Объект = &Объект
	               |	И CW_ОбъектыАрхива.Ссылка <> &Ссылка
	               |	И CW_ОбъектыАрхива.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Набор = РегистрыСведений.CW_НаличиеФайловАрхиваПоОбъектам.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(Объект);
		Набор.Записать(Истина);
	КонецЕсли; 
	
КонецПроцедуры

#КонецЕсли
