
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  

	Организация = CW_Настройки.ОсновнаяОрганизация();  
	
	ПериодОбработки.ДатаНачала 		= НачалоМесяца(ТекущаяДата());
	ПериодОбработки.ДатаОкончания 	= КонецМесяца(ТекущаяДата());
    ПериодОбработки.Вариант 		= ВариантСтандартногоПериода.ЭтотКвартал;
	
	ПериодПриИзмененииНаСервере();
  	ВариантПериодаПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
   СнятьУстановитьФлажки(Ложь);  
   
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
   СнятьУстановитьФлажки(Истина); 
   
КонецПроцедуры 

&НаСервере
Процедура СнятьУстановитьФлажки(Флаг)
	
	Для каждого СтрокаТаблицы из ТаблицаДокументов Цикл  
		СтрокаТаблицы.Выбор = Флаг;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиАвтоматически(Команда)   
   
	УстановитьФлажкиАвтоматическиНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьФлажкиАвтоматическиНаСервере()
	
	Для каждого СтрокаТаблицы из ТаблицаДокументов Цикл  
		СтрокаТаблицы.Выбор = (СтрокаТаблицы.ТребуетсяЗаполнение или СтрокаТаблицы.Отклонение <> 0);
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьФлажкиОтклонениеНаСервере()  
	
	Для каждого СтрокаТаблицы из ТаблицаДокументов Цикл  
		СтрокаТаблицы.Выбор = СтрокаТаблицы.Отклонение <> 0;
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьФлажкиОтклонение(Команда)
	УстановитьФлажкиОтклонениеНаСервере();
КонецПроцедуры


&НаСервере
Процедура УстановитьФлажкиТребуетсяЗаполннеиеНаСервере()
	
	Для каждого СтрокаТаблицы из ТаблицаДокументов Цикл  
		СтрокаТаблицы.Выбор = СтрокаТаблицы.ТребуетсяЗаполнение;
	КонецЦикла;  
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьФлажкиТребуетсяЗаполннеие(Команда)
	УстановитьФлажкиТребуетсяЗаполннеиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)   
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗполнениеТаблицы", ЭтотОбъект);
	
	Если ТаблицаДокументов.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Таблица документов будет очищена. Продолжить? ", Режим, 0);	
		
	Иначе
		
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПродолжитьЗполнениеТаблицы(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	РезультатВыполнения =  НачатьЗаполнениеСпискавВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьЗаполнениеСписка", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры 

&НаСервере
Функция НачатьЗаполнениеСпискавВФоне()    
	
	ВремТаблицаДокументов = ТаблицаДокументов.Выгрузить(); 
	ВремТаблицаДокументов.Очистить();
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДатаНачала",			ПериодОбработки.ДатаНачала);
	ПараметрыПроцедуры.Вставить("ДатаОкончания",		ПериодОбработки.ДатаОкончания);
	ПараметрыПроцедуры.Вставить("ВариантПериода",		ВариантПериодаДокументов);
	ПараметрыПроцедуры.Вставить("Организация",			Организация);
	ПараметрыПроцедуры.Вставить("ТаблицаДокументов",	ВремТаблицаДокументов);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Заполнение списка документов";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_РеестрыНДС0ПакетноеФормированиеЗаписейРеестров.ПолучитьСписокДокументов",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьЗаполнениеСписка(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда   
		
		ЗавершитьЗаполнениеСпискаНаСевере(РезультатВыполнения.АдресРезультата);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось получить список документов!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка получения списка документов");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьЗаполнениеСпискаНаСевере(Знач АдресРезультата)
	
	времТаблицаДокументов = ПолучитьИзВременногоХранилища(АдресРезультата);
	ТаблицаДокументов.Загрузить(времТаблицаДокументов);   
	
	ИтогоНалоговаяБаза 		= ТаблицаДокументов.Итог("НалоговаяБаза");
	ИтогоОтклонение         = ТаблицаДокументов.Итог("Отклонение");
	ИтогоСуммаРеализации    = ТаблицаДокументов.Итог("СуммаРеализации");
	
	Элементы.Сформировать.Доступность = (ТаблицаДокументов.Количество() > 0);

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)  
	
	Отбор   = Новый Структура("Выбор", Истина);
	мСтроки = ТаблицаДокументов.НайтиСтроки(Отбор);
	Если мСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбрано ни одного документа для формирования записей реестров!");
		Возврат;
	КонецЕсли;

	РезультатВыполнения =  НачатьФормированиеРеестровВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьФормированиеРеестров", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры  

&НаСервере
Функция НачатьФормированиеРеестровВФоне()  
	
	ВремТаблицаДокументов = ТаблицаДокументов.Выгрузить(); 
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ТаблицаДокументов", 			ВремТаблицаДокументов);   
	ПараметрыПроцедуры.Вставить("ВариантПериодаПодтверждения", 	ВариантПериодаПодтверждения);   
	ПараметрыПроцедуры.Вставить("ПериодПодтверждения", 			ПериодПодтверждения);   

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Формирование реестра по НДС 0%";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_РеестрыНДС0ПакетноеФормированиеЗаписейРеестров.СформироватьЗаписиРеестровНДС",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьФормированиеРеестров(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		Оповещение = новый ОписаниеОповещения("ОбработаьЗавершениеФормированияРеестров", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Формирование записей реестров завершено!",,"");
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Записи реестров не сформированы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,""); 
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработаьЗавершениеФормированияРеестров(ДополнительныеПараметры) Экспорт 

	ПродолжитьЗполнениеТаблицы(КодВозвратаДиалога.Да, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = ТаблицаДокументов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПоказатьЗначение(, СтрокаТаблицы.ДокументДоходов);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере() 
	
	ПериодПодтверждения = НачалоКвартала(ПериодОбработки.ДатаОкончания);   
	
	//Этот бред по заявке AFR-240174
	Если ПериодПодтверждения <> НачалоГода(ТекущаяДата()) Тогда
		ПериодПодтверждения = НачалоГода(ТекущаяДата());	
	КонецЕсли;
	//AFR-240174
	
	УстановитьПредставлениеПериода(); 
	
КонецПроцедуры

&НаКлиенте
Процедура КвраталНазад(Команда)   
	
	ОбработатьИзменениеКварталаНаСервере("НАЗАД");  
	
КонецПроцедуры 

&НаКлиенте
Процедура КварталВперед(Команда)
	
	ОбработатьИзменениеКварталаНаСервере("ВПЕРЕД");
	
КонецПроцедуры 

  

&НаСервере
Процедура ОбработатьИзменениеКварталаНаСервере(Направление)  
	
	Если Направление = "НАЗАД" Тогда
		ПериодПодтверждения = НачалоКвартала(НачалоКвартала(ПериодПодтверждения) - 1);
	ИначеЕсли Направление = "ВПЕРЕД" Тогда
		ПериодПодтверждения = НачалоКвартала(КонецКвартала(ПериодПодтверждения) + 1);
	КонецЕсли;
	
	УстановитьПредставлениеПериода(); 
	
КонецПроцедуры   

&НаСервере
Процедура УстановитьПредставлениеПериода()
	
	ПериодОтчетаСтрока = Формат(ПериодПодтверждения,"ДФ='к ""квартал"" гггг ""г.""'");
	
КонецПроцедуры  

&НаКлиенте
Процедура ВариантПериодаПриИзменении(Элемент)
	ВариантПериодаПриИзмененииНаСервере();
КонецПроцедуры     

&НаКлиенте
Процедура ВариантПериодаПодтвержденияПриИзменении(Элемент)
	
	ВариантПериодаПриИзмененииНаСервере();

КонецПроцедуры


&НаСервере
Процедура ВариантПериодаПриИзмененииНаСервере()    
	
	Элементы.ГруппаПериод.Доступность = (ВариантПериодаПодтверждения = 1);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоВыделеннымСтрокам(Команда) 
	
	ВыделенныеСтроки = Элементы.ТаблицаДокументов.ВыделенныеСтроки;
	УстановитьПоВыделеннымСтрокамНаСервере(ВыделенныеСтроки);  
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПоВыделеннымСтрокамНаСервере(ВыделенныеСтроки)  
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТекущая = ТаблицаДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаТекущая.Выбор = Истина;	
	КонецЦикла;
	
КонецПроцедуры






