
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РедактированиеЗапрещено = РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.РедактированиеОбъектаЗапрещено("РегистрСведений.CW_ШаблоныУслуг");

	ЭтаФорма.ТолькоПросмотр 								= РедактированиеЗапрещено;
	Элементы.Список.КоманднаяПанель.Доступность 			= Не РедактированиеЗапрещено;
	Элементы.СписокПоДоговорам.КоманднаяПанель.Доступность 	= Не РедактированиеЗапрещено;
	
	_УФС.ДобавитьОтбор(Список.Отбор,"Договор",ВидСравненияКомпоновкиДанных.Равно,Справочники.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка());
	_УФС.ДобавитьОтбор(СписокПоДоговорам.Отбор,"Договор",ВидСравненияКомпоновкиДанных.НеРавно,Справочники.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка());
	
КонецПроцедуры
