&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Обмен",Обмен);
	Список.Параметры.УстановитьЗначениеПараметра("Обмен",?(Обмен.Пустая(),Неопределено,Обмен));
	_ОбновитьСтатистику();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОбменПриИзменении(Элемент)
	
	_ОтборОбменПриИзменении();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура _ОтборОбменПриИзменении()
	// --- 
	
	Если Обмен.Пустая() Тогда
		
		Значение = Неопределено;
		
	Иначе
		
		Значение = Обмен;
		
	КонецЕсли; 
	Список.Параметры.УстановитьЗначениеПараметра("Обмен",Значение);
	_ОбновитьСтатистику();
		
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьСтатистику()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_ТаблицаРегистрацииИзменений.Объект) КАК Всего
	               |ПОМЕСТИТЬ Т_Всего
	               |ИЗ
	               |	РегистрСведений.CW_ТаблицаРегистрацииИзменений КАК CW_ТаблицаРегистрацииИзменений
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &Обмен = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ CW_ТаблицаРегистрацииИзменений.Обмен = &Обмен
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_ТаблицаРегистрацииИзменений.Объект) КАК Зарегистрировано
	               |ПОМЕСТИТЬ Т_Зарегистрировано
	               |ИЗ
	               |	РегистрСведений.CW_ТаблицаРегистрацииИзменений КАК CW_ТаблицаРегистрацииИзменений
	               |ГДЕ
	               |	CW_ТаблицаРегистрацииИзменений.Статус = &СтатусВыгрузки
	               |	И ВЫБОР
	               |			КОГДА &Обмен = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ CW_ТаблицаРегистрацииИзменений.Обмен = &Обмен
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_ТаблицаРегистрацииИзменений.Объект) КАК Ошибки
	               |ПОМЕСТИТЬ Т_Ошибки
	               |ИЗ
	               |	РегистрСведений.CW_ТаблицаРегистрацииИзменений КАК CW_ТаблицаРегистрацииИзменений
	               |ГДЕ
	               |	CW_ТаблицаРегистрацииИзменений.ОшибкаВыгрузки = ИСТИНА
	               |	И ВЫБОР
	               |			КОГДА &Обмен = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ CW_ТаблицаРегистрацииИзменений.Обмен = &Обмен
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Т_Всего.Всего,
	               |	0 КАК Зарегистрировано,
	               |	0 КАК Ошибки
	               |ИЗ
	               |	Т_Всего КАК Т_Всего
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	Т_Зарегистрировано.Зарегистрировано,
	               |	0
	               |ИЗ
	               |	Т_Зарегистрировано КАК Т_Зарегистрировано
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	Т_Ошибки.Ошибки
	               |ИЗ
	               |	Т_Ошибки КАК Т_Ошибки";
				   
	// --- 				   
	Запрос.УстановитьПараметр("СтатусВыгрузки", Перечисления.CW_СтатусыВыгрузки.Зарегистрирован);
	Если (ЗначениеЗаполнено(Обмен)) Тогда
		Запрос.УстановитьПараметр("Обмен", Обмен);
	Иначе
		Запрос.УстановитьПараметр("Обмен", Неопределено); 
	КонецЕсли; 
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	// --- 
	Количество_Всего = ТЗ.Итог("Всего");
	Количество_Зарегистрировано = ТЗ.Итог("Зарегистрировано");
	Количество_Ошибки = ТЗ.Итог("Ошибки");
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ИзменитьСтатусВыделенных(Команда)
	
	МассивВыделенных = Новый Массив;
	Для каждого Элемент Из Элементы.Список.ВыделенныеСтроки Цикл
		
		МассивВыделенных.Добавить(Элемент);
		
	КонецЦикла; 
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораСтатусаВыгрузки",ЭтотОбъект, Новый Структура("МассивЗаписей",МассивВыделенных));
	ОткрытьФорму("Перечисление.CW_СтатусыВыгрузки.ФормаВыбора",Новый Структура("РежимВыбора",Истина),,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСтатусаВыгрузки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		_ИзменитьСтатусВыгрузки(ДополнительныеПараметры.МассивЗаписей,Ответ);
		Элементы.Список.Обновить();
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ИзменитьСтатусВыгрузки(МассивЗаписей,НовыйСтатус)
	// --- 
	
	РегистрыСведений.CW_ТаблицаРегистрацииИзменений.ИзменитьСтатусЗаписей(МассивЗаписей,НовыйСтатус); 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	Элементы.Список.Обновить();
	_ОбновитьСтатистику();
	
КонецПроцедуры
 
  


 