
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ОбъектАрхива");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;   
	Представление = СокрЛП(Данные.ОбъектАрхива);
	
КонецПроцедуры  


Процедура УдалитьВладельцаАрхива(ОбъектАрхива) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СсылкаВладелецАрхива = Справочники.CW_ВладельцыАрхива.НайтиПоРеквизиту("ОбъектАрхива", ОбъектАрхива);  
	Если Не ЗначениеЗаполнено(СсылкаВладелецАрхива) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЕстьФайлыПоВладельцу(СсылкаВладелецАрхива) Тогда
		ОбъектВладелецАрхива = СсылкаВладелецАрхива.ПолучитьОбъект();
		ОбъектВладелецАрхива.Удалить();  
	КонецЕсли;
	
КонецПроцедуры   

Функция ЕстьФайлыПоВладельцу(ВладелецАрхива)   
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ОбъектыАрхива.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	               |ГДЕ
	               |	CW_ОбъектыАрхива.Владелец = &ВладелецАрхива";    
	
	Запрос.УстановитьПараметр("ВладелецАрхива", ВладелецАрхива);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции
