	&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.СоздатьУчетныйДоговор.Доступность = Запись.УчетныйДоговор.Пустая();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьУчетныйДоговор(Команда)
	
	Отказ = Ложь;
	ПроверитьЗаполнениеРеквизтовОбъекта(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьУчетныйДоговорНаСервере();
	
КонецПроцедуры  

&НаСервере
Процедура ПроверитьЗаполнениеРеквизтовОбъекта(Отказ) 
	
	ПроверяемыеРеквизиты = Новый Структура;
	ПроверяемыеРеквизиты.Вставить("Организация", 	"Организация");	
	ПроверяемыеРеквизиты.Вставить("Владелец", 		"Контрагент");	
	ПроверяемыеРеквизиты.Вставить("НомерДоговора", 	"Номер договора");	
	ПроверяемыеРеквизиты.Вставить("ДатаДоговора", 	"Дата договора");	
	ПроверяемыеРеквизиты.Вставить("ВидДоговора", 	"Вид договора");	
	
	Для Каждого КлючЗначение из ПроверяемыеРеквизиты Цикл
		Если Не ЗначениеЗаполнено(Запись.Объект[КлючЗначение.Ключ]) Тогда   
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заподнен реквизит: """+КлючЗначение.Значение+" договора";
			Отказ = Истина; 
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьУчетныйДоговорНаСервере()
	
	Объект = Запись.Объект;
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ ПЕРВЫЕ 1
	              	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	              	|ИЗ
	              	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	              	|ГДЕ
	              	|	ДоговорыКонтрагентов.Организация = &Организация
	              	|	И ДоговорыКонтрагентов.Номер = &Номер
	              	|	И ДоговорыКонтрагентов.Дата = &Дата
	              	|	И ДоговорыКонтрагентов.Владелец = &Владелец
	              	|	И ДоговорыКонтрагентов.ВидДоговора = &Вид
	              	|	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов
	              	|	И ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах = &РасчетыВУсловныхЕдиницах"; 
	
	Запрос.УстановитьПараметр("Организация", 				Объект.Организация);  
	Запрос.УстановитьПараметр("Номер",						Объект.НомерДоговора); 
	Запрос.УстановитьПараметр("Дата",	  	 				Объект.ДатаДоговора); 
	Запрос.УстановитьПараметр("Владелец",	 				Объект.Владелец); 
	Запрос.УстановитьПараметр("Вид",		 				Объект.ВидДоговора); 
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", 		Объект.ВалютаДоговора);
	Запрос.УстановитьПараметр("РасчетыВУсловныхЕдиницах", 	Объект.ВзаиморасчетыВУЕ);
	
	//Для версии КОРП 
	ЭтоВерсияКОРП = ВариантыПриложений.ЭтоВерсияКОРП();
	Если ЭтоВерсияКОРП Тогда
		//Ищем по головной организации
		Запрос.УстановитьПараметр("Организация", Объект.Организация.ГоловнаяОрганизация); 
	КонецЕсли;
	//Для версии КОРП
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		УчетныйДоговор = Выборка.Ссылка; 	
	КонецЕсли;
	
	Если УчетныйДоговор = Неопределено Тогда
		
		ДоговорОбъект = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		ДоговорОбъект.Наименование	= Объект.Наименование;
		ДоговорОбъект.Владелец		= Объект.Владелец;
		ДоговорОбъект.Организация	= Объект.Организация;
		
		Если ТипЗнч(Объект) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
			ДоговорОбъект.Номер	= Объект.НомерДоговора;                                 
			ДоговорОбъект.Дата	= Объект.ДатаДоговора;                                  
		ИначеЕсли  ТипЗнч(Объект) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
			ДоговорОбъект.Номер	= Объект.НомерДокумента;                                 
			ДоговорОбъект.Дата	= Объект.ДатаДокумента;                                  
		КонецЕсли;
		
		ДоговорОбъект.ВидДоговора				= Объект.ВидДоговора;
		ДоговорОбъект.ВалютаВзаиморасчетов	 	= Объект.ВалютаДоговора;
		ДоговорОбъект.РасчетыВУсловныхЕдиницах 	= Объект.ВзаиморасчетыВУЕ;

		//Для версии КОРП 
		Если ЭтоВерсияКОРП Тогда
			ДоговорОбъект.Организация = Объект.Организация.ГоловнаяОрганизация;  
		КонецЕсли;
		//Для версии КОРП 
		
		ДоговорОбъект.СпособЗаполненияСтавкиНДС 	= ПредопределенноеЗначение("Перечисление.СпособыЗаполненияСтавкиНДС.Автоматически");
		ДоговорОбъект.СпособВыставленияДокументов 	= ПредопределенноеЗначение("Перечисление.СпособыВыставленияДокументов.Автоматически");
		
		ДоговорОбъект.Записать(); 
		
		УчетныйДоговор = ДоговорОбъект.Ссылка;
		
	КонецЕсли;   
	
	Запись.УчетныйДоговор = УчетныйДоговор;	

КонецПроцедуры


 
