
Процедура ВыполнитьВнешнююКоманду(ФормаОбъекта, ИдентификаторКоманды, МассивОбъектовНазначения=Неопределено) Экспорт
	
	ПараметрыВнешнейКоманды = новый Структура;
	ПараметрыВнешнейКоманды.Вставить("ИдентификаторКоманды"	, ИдентификаторКоманды);
	ПараметрыВнешнейКоманды.Вставить("ИмяФормыОбъекта"		, ФормаОбъекта.ИмяФормы);
	
	СтруктураПараметровВнешнейКоманды = CW_ПодключаемыеКомандыСервер.ПолучитьПараметрыВнешнейКоманды(ПараметрыВнешнейКоманды);
	
	Если СтруктураПараметровВнешнейКоманды <> Неопределено Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ПараметрыВнешнейКоманды"	, СтруктураПараметровВнешнейКоманды);
		
		Если СтруктураПараметровВнешнейКоманды.ИмяМетода = "ВыполнитьВнешнююКомандуНаКлиенте" Тогда
			
			Если МассивОбъектовНазначения = Неопределено Тогда
				//Если вызво из формы объекта, то во внешнюю обработку передаем объект формы, для изменения
				МассивОбъектовНазначения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФормаОбъекта.Объект);
			КонецЕсли;	
			СтруктураПараметров.Вставить("МассивОбъектовНазначения"	, МассивОбъектовНазначения);
			
			ФормаОбработки = ПолучитьФорму(СтруктураПараметровВнешнейКоманды.ИмяФормы, СтруктураПараметров, ФормаОбъекта);
			ФормаОбработки.ВыполнитьВнешнююКоманду(СтруктураПараметров);	
			
		Иначеесли СтруктураПараметровВнешнейКоманды.ИмяМетода = "ОткрытьФорму" Тогда
			
			Если МассивОбъектовНазначения = Неопределено Тогда
				МассивОбъектовНазначения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФормаОбъекта.Объект.Ссылка);
			КонецЕсли;	
			СтруктураПараметров.Вставить("МассивОбъектовНазначения"	, МассивОбъектовНазначения);

			ОткрытьФорму(СтруктураПараметровВнешнейКоманды.ИмяФормы, СтруктураПараметров, ФормаОбъекта);
			
		Конецесли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт

	ТипОбъекта 	= ТипЗнч(Форма.Объект.Ссылка);
	
	МассивПодключенныхОбъектов = CW_ПодключаемыеКомандыСервер.ПолучитьОбработчикиПослеЗаписи(ТипОбъекта);
	Если МассивПодключенныхОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПодключаемыйОбъект из  МассивПодключенныхОбъектов Цикл
		
		ПараметрыОбработчика = CW_ПодключаемыеКомандыСервер.ПолучитьПараметрыВнешнегоОбработчика(ПодключаемыйОбъект);
		
		
		Если ПараметрыОбработчика.Метод = "ПослеЗаписи" Тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ПодключаемыйОбъект", 	ПодключаемыйОбъект);
			СтруктураПараметров.Вставить("СсылкаНаОбъект", 		Форма.Объект.Ссылка);
			
			ФормаОбработки = ПолучитьФорму(ПараметрыОбработчика.ИмяФормы,, Форма);
			ФормаОбработки.ПослеЗаписи(СтруктураПараметров, ПараметрыЗаписи);	
			
		ИначеЕсли ПараметрыОбработчика.Метод = "ОткрытьФорму" Тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ПодключаемыйОбъект", 	ПодключаемыйОбъект);
			СтруктураПараметров.Вставить("СсылкаНаОбъект", 		Форма.Объект.Ссылка);
			
			ОткрытьФорму(ПараметрыОбработчика.ИмяФормы, СтруктураПараметров, Форма);
			
		Конецесли;
		
	КонецЦикла;
	
КонецПроцедуры