#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда



Функция ПолучитькурсВалютыПоМСФО(ДатаКурса, Валюта) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаКурса) Тогда
		ДатаКурса = ТекущаяДата();
	КонецЕсли;
	
	СтруктураКурса = Новый Структура("Валюта,Курс,Кратность",Валюта,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_МСФО_КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	CW_МСФО_КурсыВалютСрезПоследних.Курс КАК Курс,
	|	CW_МСФО_КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ИЗ
	|	РегистрСведений.CW_МСФО_КурсыВалют.СрезПоследних(&ДатаКурса, Валюта = &Валюта) КАК CW_МСФО_КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаКурса", ДатаКурса);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураКурса, Выборка);
	КонецЕсли;
	
	Возврат СтруктураКурса;
	
КонецФункции
	
	
#КонецЕсли	
