#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.Заголовок    = НСтр("ru = 'Записи книги доходов и расходов УСН'");
	ПараметрыОткрытия.ИмяФормы     = "Документ.ЗаписьКУДиР.ФормаСписка";
	ПараметрыОткрытия.Уникальность = "ФормаСписка_ЗаписьКУДиР";
	ПараметрыЗависимыхФорм = ПростойИнтерфейсКлиент.ПараметрыОткрытияЗависимыхФорм(ПараметрыВыполненияКоманды.Источник);
	
	ОтборСписка = Новый Структура;
	ОтборСписка.Вставить("ДеятельностьНаПатенте", Ложь);
	ОтборСписка.Вставить("Организация", ПараметрыЗависимыхФорм.Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ОтборСписка);
	ПараметрыФормы.Вставить("Заголовок", ПараметрыОткрытия.Заголовок);
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);

КонецПроцедуры

#КонецОбласти