
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВыгрузкуРеестра", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_РеестрыНДС0Выгрузка",, ПараметрыВыполненияКоманды.Источник,,,,ОписаниеОповещения); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПродолжитьВыгрузкуРеестра(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
    ДополнительныеПараметры.Вставить("РежимВыгрузки", 			РезультатВыбора.РежимВыгрузки);
    ДополнительныеПараметры.Вставить("РегламентированныйОтчет", РезультатВыбора.РегламентированныйОтчет);
    ДополнительныеПараметры.Вставить("ПоказатьОтчет", 			РезультатВыбора.ПоказатьОтчет);
	
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	
	РезультатВыполнения =  НачатьВыгрузкиРеестраВФоне(РезультатВыбора); 
	Если РезультатВыполнения = Неопределено Тогда  
		ПоказатьПредупреждение(, "Не удалось определить режим выгрузки реестров НДС 0%");
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ПараметрыВыполненияКоманды.Источник);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьВыгрузкуРеестров", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры  

&НаСервере
Функция НачатьВыгрузкиРеестраВФоне(ПараметрыПроцеудры)   
	
	ЗаписиРеестра = новый Массив;   
	
	Организации = Новый Массив;
	Организации.Добавить(ПараметрыПроцеудры.Организация);  
	
	Для Каждого ОбособленноеПодразделение из ПараметрыПроцеудры.ОбособленныеПодразделения Цикл
		Организации.Добавить(ОбособленноеПодразделение);	
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеестрыНДС0ЗаписиРеестра.Ссылка КАК Ссылка,
	               |	CW_РеестрыНДС0ЗаписиРеестра.НалоговаяБаза КАК НалоговаяБаза
	               |ИЗ
	               |	Справочник.CW_РеестрыНДС0ЗаписиРеестра КАК CW_РеестрыНДС0ЗаписиРеестра
	               |ГДЕ
	               |	CW_РеестрыНДС0ЗаписиРеестра.ПометкаУдаления = ЛОЖЬ
	               |	И CW_РеестрыНДС0ЗаписиРеестра.Организация В(&Организации)
	               |	И CW_РеестрыНДС0ЗаписиРеестра.ПериодОтчета МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И CW_РеестрыНДС0ЗаписиРеестра.ПриложениеПриказа = &ПриложениеПриказа
	               |	И CW_РеестрыНДС0ЗаписиРеестра.ПодтверждениеНДС = ЗНАЧЕНИЕ(Перечисление.CW_РеестрыНДС0СтатусыЗаписиРеестра.Подтвержден)
	               |ИТОГИ
	               |	СУММА(НалоговаяБаза)
	               |ПО
	               |	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ДатаНачала", 		НачалоКвартала(ПараметрыПроцеудры.ПериодОтчета));
	Запрос.УстановитьПараметр("ДатаОкончания", 		КонецКвартала(ПараметрыПроцеудры.ПериодОтчета));
	Запрос.УстановитьПараметр("Организации",		Организации);
	Запрос.УстановитьПараметр("ПриложениеПриказа", 	ПараметрыПроцеудры.Приложение);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНалоговаяБаза = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаНалоговаяБаза.Следующий() Тогда
		ВыборкаЗаписи = ВыборкаНалоговаяБаза.Выбрать();
		пока ВыборкаЗаписи.Следующий() Цикл
			ЗаписиРеестра.Добавить(ВыборкаЗаписи.Ссылка);
		КонецЦикла;  
		
		ПараметрыПроцеудры.Вставить("НалоговаяБаза", ВыборкаНалоговаяБаза.НалоговаяБаза); 
	КонецЕсли;
	
	ПараметрыПроцеудры.Вставить("ЗаписиРеестра", ЗаписиРеестра); 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Если ПараметрыПроцеудры.РежимВыгрузки = 0 Тогда  
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Формирование XML-файла Реестр НДС 0%";
		Возврат ДлительныеОперации.ВыполнитьВФоне("CW_РеестрыНДС0Дополнительный.УниверсальнаяВыгрузкаXML", ПараметрыПроцеудры, ПараметрыВыполнения);
	Иначе
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Заполнение регламентированного отчета "+СокрЛП(ПараметрыПроцеудры.Приложение);
		Возврат ДлительныеОперации.ВыполнитьВФоне("CW_РеестрыНДС0Дополнительный.ЗаполнитьРегламентированныйОтчет", ПараметрыПроцеудры, ПараметрыВыполнения);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыгрузкуРеестров(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда      
		
		РезультатВыгрузки = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		Если РезультатВыгрузки = Неопределено Тогда
			ПоказатьПредупреждение(, "Сервис ""Реестр НДС 0%"" не доступен!");
			Возврат;
		КонецЕсли;   
		
		
		Если Дополнительныепараметры.РежимВыгрузки = 0 Тогда
			//Получаем файл
			АдресФайлаВыгрузки = ПоместитьВоВременноеХранилище(РезультатВыгрузки.ДанныеФайла, новый УникальныйИдентификатор);
			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов("Выберите каталог...", Истина);
			НачатьПолучениеФайлаССервера(АдресФайлаВыгрузки, РезультатВыгрузки.ИмяФайлаВыгрузки, ПараметрыДиалогаПолученияФайлов);  
		Иначе  
			
			Если Дополнительныепараметры.ПоказатьОтчет Тогда
				ПоказатьЗначение(,Дополнительныепараметры.РегламентированныйОтчет);
			Иначе 
				ПоказатьПредупреждение(, "Заполнение регламентированного отчета завершено");
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось выгрузить файл реестра НДС 0%!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		Если Дополнительныепараметры.РежимВыгрузки = 0 Тогда
			ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования файла реестра по НДС 0%");
		Иначе
			ПоказатьПредупреждение(,ТекстПредупреждения,,"Не удалось заполнить регламентированный отчет Реестр по НДС 0%");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры



