
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
	ЗапрашиватьТипФайлаПриДобавленииВАрхив = Константы.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив.Получить();
	
	РедактированиеФизическиеЛицаРазрешено 	= НЕ РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.РедактированиеОбъектаЗапрещено(Тип("СправочникСсылка.ФизическиеЛица"));
	РедактированиеКонтрагентыРазрешено 		= НЕ РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.РедактированиеОбъектаЗапрещено(Тип("СправочникСсылка.Контрагенты"));
	
	Элементы.ГруппаЛоготип.Доступность = ПолучитьФункциональнуюОпцию("CW_ИспользованиеФайловогоАрхива") И ПолучитьФункциональнуюОпцию("CW_ИспользованиеЛоготипов");
	Элементы.ГруппаЛоготип.Видимость = Элементы.ГруппаЛоготип.Доступность;
	Если (Элементы.ГруппаЛоготип.Видимость) Тогда
		Элементы.ПолеЛоготипа.РазмерКартинки=РазмерКартинки.АвтоРазмер;
	КонецЕсли; 
	Элементы.Календарь.Видимость = Ложь;
	Календарь = ТекущаяДата();

	Элементы.ГруппаКонтрагент.Видимость = Ложь;
	Элементы.ГруппаФизическоеЛицо.Видимость = Ложь;
	Элементы.СтраницаДоговоры.Видимость = Ложь;
	Элементы.СтраницаЗаявки.Видимость = Ложь;
	Элементы.СтраницаРеквизитыКонтрагента.Видимость = Ложь;
	Элементы.СтраницаРеквизитыФизическогоЛица.Видимость = Ложь;
	
	Элементы.ФормаОбщаяКоманда_Контрагент_CW_ФайлыАрхива.Видимость = Ложь;  
	Элементы.ФормаОбщаяКоманда_ФизическоеЛицо_CW_ФайлыАрхива.Видимость = Ложь;  

	Ключ = Неопределено;
	ОбъектКопирования = Неопределено;
	Параметры.Свойство("ВидФормы",ВидФормы);
	Параметры.Свойство("Ссылка",НовыйОбъект);
	Параметры.Свойство("Ключ",Ключ);
	Параметры.Свойство("ОбъектКопирования",ОбъектКопирования);
	Параметры.Свойство("РежимВыбораКИ",РежимВыбораКИ);
	Если (Ключ <> Неопределено) Тогда
		
		Если (НЕ РежимВыбораКИ) Тогда
			Если (ТипЗнч(Ключ)=Тип("СправочникСсылка.Контрагенты")) Тогда
				ВидФормы = "ФормаКонтрагента";
			ИначеЕсли (ТипЗнч(Ключ)=Тип("СправочникСсылка.ФизическиеЛица")) Тогда 
				ВидФормы = "ФормаФизическогоЛица"
			КонецЕсли; 
		Иначе
			Если (ТипЗнч(Ключ)=Тип("СправочникСсылка.Контрагенты")) Тогда
				Элементы.СтраницыКонтрагентов.ТекущаяСтраница = Элементы.СтраницаКонтрагенты;
			ИначеЕсли (ТипЗнч(Ключ)=Тип("СправочникСсылка.ФизическиеЛица")) Тогда 
				Элементы.СтраницыКонтрагентов.ТекущаяСтраница = Элементы.СтраницаФизическиеЛица;
			КонецЕсли;
		КонецЕсли; 
		
		НовыйОбъект = Ключ;
		
	КонецЕсли; 

	Если (ВидФормы = "ФормаКонтрагента") Тогда
		
		Элементы.ГруппаПоиск.Видимость = Ложь;
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Элементы.СтраницаРеквизитыКонтрагента.Видимость = Истина;   
		
		Элементы.ФормаОбщаяКоманда_Контрагент_CW_ФайлыАрхива.Видимость = Истина;  
		Элементы.ФормаОбщаяКоманда_ФизическоеЛицо_CW_ФайлыАрхива.Видимость = Ложь;  
		
		Если (НЕ НовыйОбъект.Пустая()) Тогда
			КонтрагентОбъект = НовыйОбъект.ПолучитьОбъект();
			ОбъектЗаписан = Истина;
		Иначе
			Если РедактированиеКонтрагентыРазрешено Тогда
				Если (ОбъектКопирования = Неопределено) Тогда
					КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
					КонтрагентОбъект.СтранаРегистрации = Справочники.СтраныМира.Россия;
				Иначе
					КонтрагентОбъект = ОбъектКопирования.Скопировать();
				КонецЕсли; 
			Иначе
				Сообщение = новый СообщениеПользователю;
				Сообщение.Текст = "Недостаточно прав для данного действия.";
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли; 
		КонецЕсли; 
		ЗначениеВРеквизитФормы(КонтрагентОбъект,"ОбъектКонтрагент");
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Верх;
		
		_СформироватьЗаголовокКонтрагента();
		
	ИначеЕсли (ВидФормы = "ФормаФизическогоЛица") Тогда 
		
		Элементы.ФормаОбщаяКоманда_Контрагент_CW_ФайлыАрхива.Видимость = Ложь;  
		Элементы.ФормаОбщаяКоманда_ФизическоеЛицо_CW_ФайлыАрхива.Видимость = Истина;  
	
		Элементы.ГруппаПоиск.Видимость = Ложь;
		Элементы.ГруппаФизическоеЛицо.Видимость = Истина;
		Элементы.СтраницаРеквизитыФизическогоЛица.Видимость = Истина;
		Если (НЕ НовыйОбъект.Пустая()) Тогда
			ФизическоеЛицоОбъект = НовыйОбъект.ПолучитьОбъект();
			ОбъектЗаписан = Истина;
		Иначе
			
			Если РедактированиеФизическиеЛицаРазрешено Тогда
				Если (ОбъектКопирования = Неопределено) Тогда
					ФизическоеЛицоОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
				Иначе
					ФизическоеЛицоОбъект = ОбъектКопирования.Скопировать();
				КонецЕсли; 
			Иначе
				Сообщение = новый СообщениеПользователю;
				Сообщение.Текст = "Недостаточно прав для данного действия.";
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
			
			
		КонецЕсли; 
		
		ЗначениеВРеквизитФормы(ФизическоеЛицоОбъект,"ОбъектФизическоеЛицо");
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Верх;
		
		_СформироватьЗаголовокФизическогоЛица();
		
	КонецЕсли; 

	События.Параметры.УстановитьЗначениеПараметра("ДатаСобытия",Календарь);
	
	Элементы.ФизическиеЛица.ТолькоПросмотр 	= НЕ РедактированиеФизическиеЛицаРазрешено;
	Элементы.Контрагенты.ТолькоПросмотр 	= НЕ РедактированиеКонтрагентыРазрешено;
	ПолучитьДействующихМенеджеров();

	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФормироватьДеревоКонтактныхЛиц = (Элементы.СтраницыКонтрагентов.ТекущаяСтраница = Элементы.СтраницаКонтрагенты);
	// --- 
	Если (НЕ РежимВыбораКИ) Тогда
		Если (ВидФормы <> "") Тогда
			
			УстановитьТекущийОбъект(НовыйОбъект);
			
		КонецЕсли;	
		
	Иначе
		
		Если (Элементы.СтраницыКонтрагентов.ТекущаяСтраница = Элементы.СтраницаКонтрагенты) Тогда
			Элементы.Контрагенты.ТекущаяСтрока = НовыйОбъект;
		ИначеЕсли (Элементы.СтраницыКонтрагентов.ТекущаяСтраница = Элементы.СтраницаФизическиеЛица) Тогда 
			Элементы.ФизическиеЛица.ТекущаяСтрока = НовыйОбъект;
		КонецЕсли; 
		
	КонецЕсли; 
	// --- 
	ВидимостьРазделовФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Если (Элементы.СтраницаРеквизитыКонтрагента.Видимость) Тогда
		
		Элементы.ГруппаРезидент.Видимость = (ЗначениеЗаполнено(ОбъектКонтрагент.СтранаРегистрации) И ОбъектКонтрагент.СтранаРегистрации = Справочники.СтраныМира.Россия);
		Элементы.ГруппаНерезидент.Видимость = (ЗначениеЗаполнено(ОбъектКонтрагент.СтранаРегистрации) И ОбъектКонтрагент.СтранаРегистрации <> Справочники.СтраныМира.Россия);
		
	КонецЕсли; 
	
	Если (Элементы.ГруппаКонтрагент.Видимость) Тогда
		
		Элементы.ГруппаСтандартнаяФормаКонтрагента.Видимость = ЗначениеЗаполнено(ОбъектКонтрагент.Ссылка);
		
	КонецЕсли; 
	
	Если (Элементы.ГруппаФизическоеЛицо.Видимость) Тогда
		
		Элементы.ГруппаСтандартнаяФормаФизическогоЛица.Видимость = ЗначениеЗаполнено(ОбъектФизическоеЛицо.Ссылка);
		
	КонецЕсли; 
	
	Если (ВидФормы <> "") Тогда
		
		Элементы.СтраницыИнформации.Видимость = ОбъектЗаписан;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _СформироватьЗаголовокКонтрагента()
	// --- 
	
	Если (ЗначениеЗаполнено(ОбъектКонтрагент.Ссылка)) Тогда
		
		Заголовок = Строка(ОбъектКонтрагент.Наименование);
		
	Иначе
		
		Заголовок = "Создание контрагента";
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Процедура _СформироватьЗаголовокФизическогоЛица()
	// --- 
	
	Если (ЗначениеЗаполнено(ОбъектФизическоеЛицо.Ссылка)) Тогда
		
		Заголовок = Строка(ОбъектФизическоеЛицо.ФИО);
		
	Иначе
		
		Заголовок = "Создание физического лица";
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

#Область Списки 

&НаКлиенте
Процедура КонтрагентыПриАктивизацииСтроки(Элемент)
	
	Если (Элементы.СтраницыКонтрагентов.ТекущаяСтраница = Элементы.СтраницаКонтрагенты) Тогда
		
		Если (Элементы.Контрагенты.ТекущаяСтрока <> Неопределено) Тогда
			
			УстановитьТекущийОбъект(Элементы.Контрагенты.ТекущаяСтрока);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаПриАктивизацииСтроки(Элемент)
	
	Если (Элементы.СтраницыКонтрагентов.ТекущаяСтраница = Элементы.СтраницаФизическиеЛица) Тогда
		
		Если (Элементы.ФизическиеЛица.ТекущаяСтрока <> Неопределено) Тогда
			
			УстановитьТекущийОбъект(Элементы.ФизическиеЛица.ТекущаяСтрока);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущийОбъект(НовыйОбъект)
	
	Если (НовыйОбъект <> ТекущийОбъект) Тогда
		
		ТекущийОбъект = НовыйОбъект;

		Если (ТипЗнч(ТекущийОбъект)=Тип("СправочникСсылка.Контрагенты")) Тогда
			
			ФормироватьДеревоКонтактныхЛиц = Истина;
			Если (Элементы.ГруппаКонтактныеЛицаКонтрагента.Видимость <> ФормироватьДеревоКонтактныхЛиц) Тогда
				Элементы.ГруппаКонтактныеЛицаКонтрагента.Видимость = (ФормироватьДеревоКонтактныхЛиц);	
			КонецЕсли; 

			СформироватьДерево();
			СвернутьДеревоКонтактныхЛиц();
			ОбновитьЛоготип();

			_ОтборСобытий(ТекущийОбъект);
			
		ИначеЕсли (ТипЗнч(ТекущийОбъект)=Тип("СправочникСсылка.ФизическиеЛица")) Тогда
			
			ФормироватьДеревоКонтактныхЛиц = Ложь;
			Если (Элементы.ГруппаКонтактныеЛицаКонтрагента.Видимость <> ФормироватьДеревоКонтактныхЛиц) Тогда
				Элементы.ГруппаКонтактныеЛицаКонтрагента.Видимость = (ФормироватьДеревоКонтактныхЛиц);	
			КонецЕсли; 

			_СформироватьТаблицуКонтактныхЛиц();

			_ОтборСобытий(ТекущийОбъект);
			Элементы.СтраницаДоговоры.Видимость = Ложь;
			Элементы.СтраницаЗаявки.Видимость = Ложь;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЛоготип()
	
	Если Элементы.ГруппаЛоготип.Доступность Тогда
		ОбновитьЛоготипНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЛоготипНаСервере()
	
	АдресЛоготипа = "";

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ЛоготипыКонтрагентов.ОбъектАрхива КАК ОбъектАрхива
	               |ИЗ
	               |	РегистрСведений.CW_ЛоготипыКонтрагентов КАК CW_ЛоготипыКонтрагентов
	               |ГДЕ
	               |	CW_ЛоготипыКонтрагентов.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", ТекущийОбъект); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		 ОбъектАрхива = Выборка.ОбъектАрхива;
		 АдресЛоготипа = CW_РаботаСФайламиСервер.ПолучитьСсылкуНаДвоичныеДанные(Выборка.ОбъектАрхива, УникальныйИдентификатор)
	КонецЕсли;
	
КонецПроцедуры
 

#КонецОбласти 



#Область Действия

&НаКлиенте
Процедура ДоговорыКонтрагента(Команда)
	
	Если (Элементы.Контрагенты.ТекущаяСтрока <> Неопределено) Тогда
		ПФ = Новый Структура("Отбор,ЗаголовокОтбора",Новый Структура("Владелец",Элементы.Контрагенты.ТекущаяСтрока),Строка(Элементы.Контрагенты.ТекущаяСтрока));
		ОткрытьФорму("Справочник.CW_ДоговорыПоГрузоперевозкам.ФормаСписка",ПФ,,Истина);
	КонецЕсли; 
	
КонецПроцедуры



#КонецОбласти 

#Область ДеревоКонтактныхЛиц

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _СформироватьТаблицуКонтактныхЛиц()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_КонтактыеЛица.Ссылка,
	               |	CW_КонтактыеЛица.Владелец КАК Контрагент,
	               |	CW_КонтактыеЛица.Должность,
	               |	CW_КонтактыеЛица.ПометкаУдаления,
	               |	CW_КонтактыеЛица.Неактивный,
	               |	CW_КонтактыеЛица.Комментарий
	               |ИЗ
	               |	Справочник.CW_КонтактыеЛица КАК CW_КонтактыеЛица
	               |ГДЕ
	               |	CW_КонтактыеЛица.ФизическоеЛицо = &ФизическоеЛицо
	               |	И CW_КонтактыеЛица.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ТекущийОбъект);
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если (ТЗ.Количество() = 0) Тогда
		
		КонтактныеЛицаФизическогоЛица.Очистить();
		
	Иначе
		
		КонтактныеЛицаФизическогоЛица.Загрузить(ТЗ);
		
	КонецЕсли; 
	КартинкаПользователя = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.CW_Пользователь.ПолучитьДвоичныеДанные(),УникальныйИдентификатор);
	Для каждого Стр Из КонтактныеЛицаФизическогоЛица Цикл
		Стр.АдресКартинки = КартинкаПользователя;
	КонецЦикла; 
	
	_ОтборКонтактнойИнформации(ТекущийОбъект);
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СформироватьДерево()
	// --- 
	
	Если (ФормироватьДеревоКонтактныхЛиц) Тогда
		
		СохранитьВидДерева();
		// --- 
		_СформироватьДерево();
		// --- 
		ВосстановитьВидДерева();	
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВидДерева()
	// --- 
	
	СостояниеДерева.Очистить();
	// --- 
	КореньДерева = Неопределено;
	СтрокиДерева = КонтактныеЛица.ПолучитьЭлементы();
	Если (СтрокиДерева.Количество() <> 0) Тогда
		ОпределитьСтатусУзла(СтрокиДерева[0]);
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ОпределитьСтатусУзла(Узел)
	// --- 
	
	Если (Узел.ЭтоГруппа) Тогда
		
		Идентификатор = Узел.ПолучитьИдентификатор();
		Если (Идентификатор <> Неопределено) Тогда
			
			Развернут = Элементы.КонтактныеЛица.Развернут(Идентификатор);
			Если (Развернут <> Неопределено) Тогда
				СостояниеДерева.Добавить(Узел.Ссылка,,Развернут);
				// --- 
				Для каждого ПУ Из Узел.ПолучитьЭлементы() Цикл
					
					ОпределитьСтатусУзла(ПУ);
					
				КонецЦикла; 
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции
  

&НаКлиенте
Процедура ВосстановитьВидДерева()
	// --- 
	
	ИдентификаторТекущегоУзла = 0;
	
	Если (СостояниеДерева.Количество() <> 0) Тогда
		
		СтрокиДерева = КонтактныеЛица.ПолучитьЭлементы();
		Если (СтрокиДерева.Количество() <> 0) Тогда
			ВосстановитьСтатусУзла(СтрокиДерева[0]);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Элементы.КонтактныеЛица.ТекущаяСтрока = ИдентификаторТекущегоУзла;
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ВосстановитьСтатусУзла(Узел)
	// --- 
	
	Если (Узел.ЭтоГруппа) Тогда
		
		СсылкаУзла = Узел.Ссылка;
		ЗаписьСтатуса = СостояниеДерева.НайтиПоЗначению(СсылкаУзла);
		Если (ЗаписьСтатуса <> Неопределено) Тогда
			
			ТекущийИдентификатор = Узел.ПолучитьИдентификатор();
			Если (ЗаписьСтатуса.Пометка) Тогда
				
				Элементы.КонтактныеЛица.Развернуть(ТекущийИдентификатор);
				
			КонецЕсли; 
			
			Если (СсылкаУзла = ТекущийРодительУзла ИЛИ СсылкаУзла = ТекущийУзел) Тогда
				
				ИдентификаторТекущегоУзла = ТекущийИдентификатор;
				
			КонецЕсли; 
			
		Иначе
			
			Элементы.КонтактныеЛица.Развернуть(Узел.ПолучитьИдентификатор());
			
		КонецЕсли; 
		
		Для каждого ПУ Из Узел.ПолучитьЭлементы() Цикл
			
			ВосстановитьСтатусУзла(ПУ);
			
		КонецЦикла; 
		
	Иначе
		
		СсылкаУзла = Узел.Ссылка;
		Если (СсылкаУзла = ТекущийУзел) Тогда
			
			ТекущийИдентификатор = Узел.ПолучитьИдентификатор();
			ИдентификаторТекущегоУзла = ТекущийИдентификатор;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции
  

&НаСервере
Процедура _СформироватьДерево()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_КонтактыеЛица.Ссылка,
	               |	CW_КонтактыеЛица.Родитель,
	               |	CW_КонтактыеЛица.Наименование,
	               |	0 КАК Уровень,
	               |	CW_КонтактыеЛица.ЭтоГруппа,
	               |	CW_КонтактыеЛица.Должность,
	               |	CW_КонтактыеЛица.Неактивный,
	               |	CW_КонтактыеЛица.Комментарий
	               |ИЗ
	               |	Справочник.CW_КонтактыеЛица КАК CW_КонтактыеЛица
	               |ГДЕ
	               |	CW_КонтактыеЛица.Владелец = &Владелец
	               |	И CW_КонтактыеЛица.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Владелец", ТекущийОбъект);
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Колонки.Добавить("СтрокаСформирована",Новый ОписаниеТипов("Булево"));
	
	УровниГрупп = Новый Соответствие;
	Для каждого Стр Из ТЗ Цикл
		
		Если (Стр.ЭтоГруппа) Тогда
			
			УровниГрупп.Вставить(Стр.Ссылка,_ОпределитьУровеньГруппы(Стр.Ссылка,УровниГрупп));
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ТЗ.Сортировать("ЭтоГруппа Убыв,Уровень Убыв");
	
	// очищаем дерево
	КонтактныеЛица.ПолучитьЭлементы().Очистить();
	// ---------------------------------------------------------------------------- 
	
	Нстр = КонтактныеЛица.ПолучитьЭлементы().Добавить();
	Нстр.Ссылка = ТекущийОбъект;
	Нстр.ЭтоКорень = Истина;
	Нстр.ЭтоГруппа = Истина;
	Нстр.Представление = Строка(ТекущийОбъект);
	// --- 
	Для каждого Стр Из ТЗ Цикл
		
		_СформироватьВеткуДерева(Стр, ТЗ, Нстр);
		
	КонецЦикла; 
	// --- 
	КоличествоПодчиненных = 0;
	Для каждого ПС Из Нстр.ПолучитьЭлементы() Цикл
		_сф.Инкремент(КоличествоПодчиненных,ПС.КоличествоПодчиненных);
	КонецЦикла; 
	ПредставлениеКоличества = ?(КоличествоПодчиненных <> 0," ("+Формат(КоличествоПодчиненных)+")","");
	Нстр.Представление = Строка(ТекущийОбъект)+ПредставлениеКоличества;
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция _ОпределитьУровеньГруппы(Группа, СоответствиеУровней)
	// --- 
	
	Если (Группа.Родитель.Пустая()) Тогда
		
		УровеньРодителя = 0;
		
	Иначе
		
		УровеньРодителя = СоответствиеУровней.Получить(Группа.Родитель);
		Если (УровеньРодителя = Неопределено) Тогда
			УровеньРодителя = _ОпределитьУровеньГруппы(Группа.Родитель, СоответствиеУровней);
		КонецЕсли; 
		
	КонецЕсли; 
	// --- 
	Возврат(1+УровеньРодителя);
	
	// --- 
КонецФункции
 
&НаСервере
Процедура _СформироватьВеткуДерева(СтрокаТЗ, ТЗ, Родитель=Неопределено)
	// --- 
	
	Если (СтрокаТЗ.СтрокаСформирована) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если (Родитель = Неопределено) Тогда
		
		Нстр = КонтактныеЛица.ПолучитьЭлементы().Добавить();
		
	Иначе
		
		Нстр = Родитель.ПолучитьЭлементы().Добавить();
		
	КонецЕсли; 
	
	Нстр.Ссылка = СтрокаТЗ.Ссылка;
	Нстр.ЭтоГруппа = СтрокаТЗ.ЭтоГруппа;
	СтрокаТЗ.СтрокаСформирована = Истина;
	Если (СтрокаТЗ.ЭтоГруппа) Тогда
		
		Нстр.ИндексКартинки = 0;
		// --- 
		Отбор = Новый Структура("Родитель",Нстр.Ссылка);
		ТаблицаПодчиненных = _сф.к_НайтиСтроки(ТЗ,Отбор);
		Для каждого СтрокаПодчиненного Из ТаблицаПодчиненных Цикл
			_СформироватьВеткуДерева(СтрокаПодчиненного, ТЗ, Нстр);
		КонецЦикла; 
		// --- 
		КоличествоПодчиненных = 0;
		Для каждого ПС Из Нстр.ПолучитьЭлементы() Цикл
			_сф.Инкремент(КоличествоПодчиненных,ПС.КоличествоПодчиненных);
		КонецЦикла; 
		
		// --- 
		Нстр.КоличествоПодчиненных = КоличествоПодчиненных;
		ПредставлениеКоличества = ?(КоличествоПодчиненных <> 0," ("+Формат(КоличествоПодчиненных)+")",""); 
		Нстр.Представление = СтрокаТЗ.Наименование + ПредставлениеКоличества;
		
	Иначе
		
		Нстр.ИндексКартинки = 1;
		Нстр.КоличествоПодчиненных = 1;
		// --- 
		Нстр.Представление = Строка(СтрокаТЗ.Ссылка);
		Нстр.Должность = СтрокаТЗ.Должность;
		Нстр.Неактивный = СтрокаТЗ.Неактивный;
		Нстр.Комментарий = СтрокаТЗ.Комментарий;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура СтраницыКонтрагентовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ФормироватьДеревоКонтактныхЛиц = (ТекущаяСтраница = Элементы.СтраницаКонтрагенты);
	ВидимостьРазделовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьРазделовФормы()
	// --- 
	
	Элементы.ГруппаКонтактныеЛицаКонтрагента.Видимость = (ФормироватьДеревоКонтактныхЛиц);
	Элементы.ГруппаКонтактныеЛицаФизическогоЛица.Видимость = (НЕ ФормироватьДеревоКонтактныхЛиц);
	//Элементы.СтраницаСобытия.Видимость = (ФормироватьДеревоКонтактныхЛиц);
	//Элементы.СтраницаСобытия.Видимость = Истина;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КонтактныеЛицаПриАктивизацииСтроки(Элемент)
	
	Если (Элементы.КонтактныеЛица.ТекущиеДанные <> Неопределено) Тогда
		
		ТекущийУзел = Элементы.КонтактныеЛица.ТекущиеДанные.Ссылка;
		СтрокаРодителя = Элементы.КонтактныеЛица.ТекущиеДанные.ПолучитьРодителя();
		Если (СтрокаРодителя <> Неопределено) Тогда
			ТекущийРодительУзла = СтрокаРодителя.Ссылка;
		Иначе
			ТекущийРодительУзла = Неопределено;
		КонецЕсли; 
		Если (Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоГруппа И НЕ Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоКорень) Тогда
			Элементы.КонтактнаяИнформация.ТолькоПросмотр = Истина;
		Иначе
			Элементы.КонтактнаяИнформация.ТолькоПросмотр = Ложь;
		КонецЕсли; 
		// вызываем формирование отбора
		Если (ТекущийУзел <> ТекущийОбъектОтбора) Тогда
			
			ТекущийОбъектОтбора = ТекущийУзел;
			// --- 
			ОтборКонтактнойИнформации(ТекущийУзел);
			//ОтборСобытий(ТекущийУзел);	
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	СтрокаДерева = КонтактныеЛица.НайтиПоИдентификатору(ВыбраннаяСтрока);
	// --- 
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		
		Если (Элементы.КонтактныеЛица.Развернут(ВыбраннаяСтрока)) Тогда
			
			Элементы.КонтактныеЛица.Свернуть(ВыбраннаяСтрока);
			
		Иначе
			
			Элементы.КонтактныеЛица.Развернуть(ВыбраннаяСтрока);
			
		КонецЕсли; 
		
	Иначе
		
		ПФ = Новый Структура("Ключ",Элементы.КонтактныеЛица.ТекущиеДанные.Ссылка);
		Если (НЕ Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоГруппа) Тогда
			
			ОткрытьФорму("Справочник.CW_КонтактыеЛица.Форма.ФормаЭлемента",ПФ,Элемент);
			
		Иначе
			
			ОткрытьФорму("Справочник.CW_КонтактыеЛица.Форма.ФормаГруппы",ПФ,Элемент);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	// открываем форму редактирования
	Если (Элементы.КонтактныеЛица.ТекущиеДанные <> Неопределено) Тогда
		
		Если (Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоКорень) Тогда
			
			Возврат;
			
		КонецЕсли; 
		
		// --- 
		
		ПФ = Новый Структура("Ключ",Элементы.КонтактныеЛица.ТекущиеДанные.Ссылка);
		Если (НЕ Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоГруппа) Тогда
			
			ОткрытьФорму("Справочник.CW_КонтактыеЛица.Форма.ФормаЭлемента",ПФ,Элемент);
			
		Иначе
			
			ОткрытьФорму("Справочник.CW_КонтактыеЛица.Форма.ФормаГруппы",ПФ,Элемент);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	
	Если (Элементы.КонтактныеЛица.ТекущиеДанные <> Неопределено) Тогда
		
		Если (Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоГруппа) Тогда
			
			Родитель = Элементы.КонтактныеЛица.ТекущиеДанные.Ссылка;
			
		Иначе
			
			Родитель = Неопределено;
			
		КонецЕсли; 
		
	Иначе
		
		Родитель = Неопределено;
		
	КонецЕсли; 
	
	Если (Группа) Тогда
		
		ПФ = Новый Структура("ЗначенияЗаполнения,ЭтоГруппа,Родитель",Новый Структура("Владелец,Родитель",ТекущийОбъект,Родитель),Ложь,Родитель);
		ОткрытьФорму("Справочник.CW_КонтактыеЛица.ФормаГруппы",ПФ, Элемент);
		
	Иначе
		
		ПФ = Новый Структура("ЗначенияЗаполнения,ЭтоГруппа,Родитель",Новый Структура("Владелец,Родитель",ТекущийОбъект,Родитель),Ложь,Родитель);
		ОткрытьФорму("Справочник.CW_КонтактыеЛица.ФормаОбъекта",ПФ, Элемент);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуКонтактныхЛиц(Команда)
	
	Если (Элементы.КонтактныеЛица.ТекущиеДанные <> Неопределено) Тогда
		
		Если (Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоГруппа) Тогда
			
			Родитель = Элементы.КонтактныеЛица.ТекущиеДанные.Ссылка;
			
		Иначе
			
			Родитель = Неопределено;
			
		КонецЕсли; 
		
	Иначе
		
		Родитель = Неопределено;
		
	КонецЕсли; 
	
	ПФ = Новый Структура("ЗначенияЗаполнения,ЭтоГруппа,Родитель",Новый Структура("Владелец,Родитель",ТекущийОбъект,Родитель),Истина,Родитель);
	ОткрытьФорму("Справочник.CW_КонтактыеЛица.ФормаГруппы",ПФ,Элементы.КонтактныеЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКонтактныхЛиц(Команда)
	
	СформироватьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если (Элементы.КонтактныеЛица.ТекущиеДанные <> Неопределено) Тогда
		
		Если (Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоКорень) Тогда
			
			Возврат;
			
		Иначе
			
			УдалитьСтрокуКонтактныхЛиц();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуКонтактныхЛиц()
	// --- 
	
	Если (Элементы.КонтактныеЛица.ТекущиеДанные <> Неопределено) Тогда
		
		ТребуетсяПодтверждение = Ложь;
		Если (Элементы.КонтактныеЛица.ТекущиеДанные.ЭтоГруппа) Тогда
			
			Если (Элементы.КонтактныеЛица.ТекущиеДанные.ПолучитьЭлементы().Количество() <> 0) Тогда
				
				ТребуетсяПодтверждение = Истина;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (ТребуетсяПодтверждение) Тогда
			
			ПОВ = Новый ОписаниеОповещения("ВыполнитьУдалениеКонтактногоЛица",ЭтотОбъект, Новый Структура());
			ПоказатьВопрос(ПОВ,"Удалить группу контактных лиц?",РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			ВыполнитьУдалениеКонтактногоЛица(КодВозвратаДиалога.Да,Неопределено);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУдалениеКонтактногоЛица(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		
		РезультатУдаления = _ВыполнитьУдалениеКонтактногоЛица(Элементы.КонтактныеЛица.ТекущиеДанные.Ссылка);
		Если (_УФКС.ВыполненоУспешно(РезультатУдаления)) Тогда
			ТекущийУзел = Неопределено;
			СформироватьДерево();
			//ОповеститьОбИзменении(ОбъектАрхива);
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ВыполнитьУдалениеКонтактногоЛица(Ссылка)
	// --- 
	
	Попытка
		
		Если (Ссылка.ЭтоГруппа) Тогда
			
			// получаем подчиненные и удаляем
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	CW_КонтактыеЛица.Ссылка
			               |ИЗ
			               |	Справочник.CW_КонтактыеЛица КАК CW_КонтактыеЛица
			               |ГДЕ
			               |	CW_КонтактыеЛица.Родитель = &Родитель";
			Запрос.УстановитьПараметр("Родитель", Ссылка);
			ТЗ = Запрос.Выполнить().Выгрузить();
			// --- 
			Для каждого Стр Из ТЗ Цикл
				
				Ответ = _ВыполнитьУдалениеКонтактногоЛица(Стр.Ссылка);
				Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
					
					Сообщить(_УФКС.ПредставлениеОшибки(Ответ));
					Возврат(Ответ);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		
		УстановитьПривилегированныйРежим(Истина);
		Об = Ссылка.ПолучитьОбъект();
		Об.УстановитьПометкуУдаления(Истина);
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		Возврат(_УФКС.Ответ(1));
		
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаКлиенте
Процедура КонтактныеЛицаОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ТекущийУзел = НовыйОбъект;
	СформироватьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка=Ложь;
	ПараметрыПеретаскивания = Неопределено;
	// --- 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	ПараметрыПеретаскивания = Неопределено;
	// --- 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка=Ложь;
	
	Если (ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив")) Тогда
		
		ПеретаскиваемаяСтрока = ПараметрыПеретаскивания.Значение[0];
		Если (ТипЗнч(ПеретаскиваемаяСтрока) = Тип("Число")) Тогда
			
			_УстановитьРодителя(ПеретаскиваемаяСтрока,Строка);
			СформироватьДерево();
			
		ИначеЕсли (ТипЗнч(ПеретаскиваемаяСтрока)=Тип("ДанныеФормыЭлементКоллекции")) Тогда 
			
			Если (ТипЗнч(ПеретаскиваемаяСтрока.Ссылка)=Тип("СправочникСсылка.CW_КонтактнаяИнформация")) Тогда
				
				МассивКИ = Новый Массив;
				Для каждого Стр Из ПараметрыПеретаскивания.Значение Цикл
					МассивКИ.Добавить(Стр.Ссылка);	
				КонецЦикла; 
				Ответ = _ПереподчинитьКонтактнуюИнформацию(МассивКИ,Строка);
				Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
					
					_ОбновитьКонтактнуюИнформацию();
					СформироватьДерево();
					
				Иначе
					
					_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьРодителя(ИдентификаторЭлемента, ИдентификаторГруппы)
	// --- 
	
	СтрокаЭлемента = КонтактныеЛица.НайтиПоИдентификатору(ИдентификаторЭлемента);
	СтрокаГруппы = КонтактныеЛица.НайтиПоИдентификатору(ИдентификаторГруппы);
	
	ТекущийУзел = СтрокаЭлемента.Ссылка;
	ТекущийРодительУзла = СтрокаГруппы.Ссылка;
	
	Если (СтрокаГруппы.ЭтоГруппа) Тогда
		
		Элемент = СтрокаЭлемента.Ссылка.ПолучитьОбъект();
		Элемент.Родитель = СтрокаГруппы.Ссылка;
		Элемент.Записать();
		
		//_СформироватьДерево();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПереподчинитьКонтактнуюИнформацию(МассивКИ, ИдентификаторСтрокиКЛ)
	// --- 
	
	СтрокаКЛ= КонтактныеЛица.НайтиПоИдентификатору(ИдентификаторСтрокиКЛ);
	Если (СтрокаКЛ.ЭтоГруппа И ТипЗнч(СтрокаКЛ.Ссылка) <> Тип("СправочникСсылка.Контрагенты")) Тогда
		
		Возврат(_УФКС.Ответ(1,"Контактную информацию нельзя отнести к группе контактных лиц."));
		
	КонецЕсли; 
	
	Для каждого ЭлементКИ Из МассивКИ Цикл
		
		//Если (ЭлементКИ.ЛичнаяКИ) Тогда
		//	Продолжить;
		//КонецЕсли; 
		// --- 
		// если старый владелец или новый владелец контрагенты - тогда копируем
		СтарыйВладелец = ЭлементКИ.Владелец;
		НовыйВладелец = СтрокаКЛ.Ссылка;
		Если (ТипЗнч(СтарыйВладелец)=Тип("СправочникСсылка.Контрагенты") ИЛИ ТипЗнч(НовыйВладелец)=Тип("СправочникСсылка.Контрагенты")) Тогда
			
			// копируем
			ОбъектКИ = ЭлементКИ.Скопировать();
			ОбъектКИ.Владелец = СтрокаКЛ.Ссылка;
			ОбъектКИ.Записать();
			
		Иначе
			
			// копируем
			ОбъектКИ = ЭлементКИ.Скопировать();
			ОбъектКИ.Владелец = СтрокаКЛ.Ссылка;
			ОбъектКИ.Записать();
			//// переподчиняем
			//ОбъектКИ = ЭлементКИ.ПолучитьОбъект();
			//ОбъектКИ.Владелец = СтрокаКЛ.Ссылка;
			//ОбъектКИ.Записать();
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции
 

#КонецОбласти 

#Область ТаблицаКонтактныхЛицФизическогоЛица

&НаКлиенте
Процедура КонтактныеЛицаФизическогоЛицаПриАктивизацииСтроки(Элемент)
	
	Если (Элементы.КонтактныеЛицаФизическогоЛица.ТекущиеДанные <> Неопределено) Тогда
		
		ТекущийУзел = Элементы.КонтактныеЛицаФизическогоЛица.ТекущиеДанные.Ссылка;
		ТекущийРодительУзла = Неопределено;
		// вызываем формирование отбора
		ОтборКонтактнойИнформации(ТекущийУзел);
		//ОтборСобытий(ТекущийУзел);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаФизическогоЛицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// ---
	Родитель = Неопределено;
	ПФ = Новый Структура("ЗначенияЗаполнения,ЭтоГруппа,Родитель",Новый Структура("Родитель",Родитель),Ложь,Родитель);
	ОткрытьФорму("Справочник.CW_КонтактыеЛица.ФормаОбъекта",ПФ, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаФизическогоЛицаПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	Если (Элементы.КонтактныеЛицаФизическогоЛица.ТекущиеДанные <> Неопределено) Тогда
		
		ПФ = Новый Структура("Ключ",Элементы.КонтактныеЛицаФизическогоЛица.ТекущиеДанные.Ссылка);
		ОткрытьФорму("Справочник.CW_КонтактыеЛица.Форма.ФормаЭлемента",ПФ,Элемент);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаФизическогоЛицаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	РезультатУдаления = _ВыполнитьУдалениеКонтактногоЛица(Элементы.КонтактныеЛицаФизическогоЛица.ТекущиеДанные.Ссылка);
	Если (_УФКС.ВыполненоУспешно(РезультатУдаления)) Тогда
		ТекущийУзел = Неопределено;
		_СформироватьТаблицуКонтактныхЛиц();
	Иначе
		Сообщить(_УФКС.ПредставлениеОшибки(РезультатУдаления));
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКонтактныхЛицФизическогоЛица(Команда)
	
	_СформироватьТаблицуКонтактныхЛиц();
	
КонецПроцедуры

#КонецОбласти 

#Область Договоры

&НаСервере
Процедура _ОтборДоговоров(ОбъектОтбора)
	// --- 
	
	Договоры.Отбор.Элементы.Очистить();
	_УФС.ДобавитьОтбор(Договоры.Отбор,"Владелец",,ОбъектОтбора);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область Заявки

&НаСервере
Процедура _ОтборЗаявок(ОбъектОтбора)
	// --- 
	
	Заявки.Отбор.Элементы.Очистить();
	_УФС.ДобавитьОтбор(Заявки.Отбор,"Контрагент",,ОбъектОтбора);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область События

&НаКлиенте
Процедура ОтборСобытий(ОбъектОтбора)
	// --- 
	
	_ОтборСобытий(ОбъектОтбора);
	
	// --- 
КонецПроцедуры
  
&НаСервере
Процедура _ОтборСобытий(ОбъектОтбора)
	// --- 
	
	События.Параметры.УстановитьЗначениеПараметра("ДатаСобытия",Неопределено);
	
	// --- 
	
	Если (ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.Контрагенты")) Тогда
		
		События.Отбор.Элементы.Очистить();
		_УФС.ДобавитьОтбор(События.Отбор,"Владелец",,ОбъектОтбора);
		_ОбновитьДатыСобытий();
		
	ИначеЕсли (ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.CW_КонтактыеЛица")) Тогда 
		
		События.Отбор.Элементы.Очистить();
		_УФС.ДобавитьОтбор(События.Отбор,"КонтактноеЛицо",,ОбъектОтбора);
		_ОбновитьДатыСобытий();
		
	ИначеЕсли (ТипЗнч(ОбъектОтбора) = Тип("СправочникСсылка.ФизическиеЛица")) Тогда 
		
		События.Отбор.Элементы.Очистить();
		_УФС.ДобавитьОтбор(События.Отбор,"КонтактноеЛицо.ФизическоеЛицо",,ОбъектОтбора);
		_ОбновитьДатыСобытий();
		
	КонецЕсли; 
	
	
	Если (Элементы.Календарь.Видимость) Тогда
		
		События.Параметры.УстановитьЗначениеПараметра("ДатаСобытия",Календарь);
		
	Иначе
		
		События.Параметры.УстановитьЗначениеПараметра("ДатаСобытия",Неопределено);
		
	КонецЕсли; 

	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОтборПоДатеСобытия()
	// --- 
	
	Если (Элементы.Календарь.Видимость) Тогда
		
		События.Параметры.УстановитьЗначениеПараметра("ДатаСобытия",Календарь);
		Элементы.События.Обновить();
		// --- 
	Иначе
		
		События.Параметры.УстановитьЗначениеПараметра("ДатаСобытия",Неопределено);
		
	КонецЕсли;	
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _ОбновитьДатыСобытий()
	// --- 
	
	Если (Элементы.Календарь.Видимость) Тогда
		
		// получаем настройки компоновщика динамического списка
		_ОтключитьОтборПоДатеСобытия();
		ТаблицаСобытий = _УФС.ПолучитьДанныеДинамическогоСписка(События,"ДатаСобытия");
		_УстановитьОтборПоДатеСобытия();
		// ---------------------------------------------------------------------------- 
		ТаблицаСобытий.Колонки.Добавить("МесяцСобытия");
		Для каждого Стр Из ТаблицаСобытий Цикл
			Стр.ДатаСобытия = НачалоДня(Стр.ДатаСобытия);	
			Стр.МесяцСобытия = НачалоМесяца(Стр.ДатаСобытия);
		КонецЦикла; 
		ТаблицаМесяцев = ТаблицаСобытий.Скопировать();
		ТаблицаМесяцев.Свернуть("МесяцСобытия");
		// --- 
		СобытияПоМесяцам.Очистить();
		// --- 
		Для каждого Стр Из ТаблицаМесяцев Цикл
			
			Отбор = Новый Структура("МесяцСобытия",Стр.МесяцСобытия);
			СобытияМесяца = ТаблицаСобытий.Скопировать(Отбор);
			//_сф.к_НайтиСтроки(ТаблицаСобытий,Отбор);
			// --- 
			Нстр = СобытияПоМесяцам.Добавить();
			Нстр.Месяц = Стр.МесяцСобытия;
			Нстр.ДатыСобытий = Новый СписокЗначений;
			Нстр.ДатыСобытий.ЗагрузитьЗначения(_сф.м_СоздатьИзКолонкиТЗ(СобытияМесяца,"ДатаСобытия"));
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 


#КонецОбласти 

#Область КонтактнаяИнформация

&НаКлиенте
Процедура ОтборКонтактнойИнформации(ОбъектОтбора)
	// --- 
	
	_ОтборКонтактнойИнформации(ОбъектОтбора);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОтборКонтактнойИнформации(ОбъектОтбора)
	// --- 
	
	ТекущийОбъектОтбора = ОбъектОтбора;
	_ОбновитьКонтактнуюИнформацию();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПриАктивизацииСтроки(Элемент)
	
	Если (Элементы.КонтактнаяИнформация.ТекущиеДанные <> Неопределено) Тогда
		ТекущаяКонтактнаяИнформация = Элементы.КонтактнаяИнформация.ТекущиеДанные.Ссылка;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКонтактнуюИнформацию()
	// --- 
	
	_ОбновитьКонтактнуюИнформацию();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьКонтактнуюИнформацию()
	// --- 
	
	Если (ТекущийОбъектОтбора = Неопределено) Тогда
		Возврат;
	КонецЕсли; 
	
	// --- 
	Если (ТипЗнч(ТекущийОбъектОтбора) = Тип("СправочникСсылка.Контрагенты")) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_КонтактнаяИнформация.Ссылка,
		               |	CW_КонтактнаяИнформация.Наименование КАК ЗначениеКИ,
		               |	CW_КонтактнаяИнформация.ЛичнаяКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ.ТипКИ.СсылкаКартинки КАК АдресКартинки,
		               |	CW_КонтактнаяИнформация.Основной КАК ОсновнойВидКИ
		               |ИЗ
		               |	Справочник.CW_КонтактнаяИнформация КАК CW_КонтактнаяИнформация
		               |ГДЕ
		               |	CW_КонтактнаяИнформация.Владелец = &Владелец
		               |	И CW_КонтактнаяИнформация.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	CW_КонтактнаяИнформация.ВидКИ.Код
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Владелец", ТекущийОбъектОтбора);
		ТЗ = Запрос.Выполнить().Выгрузить(); 
		
	ИначеЕсли (ТипЗнч(ТекущийОбъектОтбора) = Тип("СправочникСсылка.ФизическиеЛица")) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_КонтактнаяИнформация.Ссылка,
		               |	CW_КонтактнаяИнформация.Наименование КАК ЗначениеКИ,
		               |	CW_КонтактнаяИнформация.ЛичнаяКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ.ТипКИ.СсылкаКартинки КАК АдресКартинки,
		               |	CW_КонтактнаяИнформация.Основной КАК ОсновнойВидКИ
		               |ИЗ
		               |	Справочник.CW_КонтактнаяИнформация КАК CW_КонтактнаяИнформация
		               |ГДЕ
		               |	CW_КонтактнаяИнформация.Владелец = &Владелец
		               |	И CW_КонтактнаяИнформация.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	CW_КонтактнаяИнформация.ВидКИ.Код
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Владелец", ТекущийОбъектОтбора);
		ТЗ = Запрос.Выполнить().Выгрузить(); 
 		
	ИначеЕсли (ТипЗнч(ТекущийОбъектОтбора) = Тип("СправочникСсылка.CW_КонтактыеЛица")) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_КонтактнаяИнформация.Ссылка,
		               |	CW_КонтактнаяИнформация.Наименование КАК ЗначениеКИ,
		               |	CW_КонтактнаяИнформация.ЛичнаяКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ,
		               |	CW_КонтактнаяИнформация.ВидКИ.ТипКИ.СсылкаКартинки КАК АдресКартинки,
		               |	CW_КонтактнаяИнформация.Основной КАК ОсновнойВидКИ
		               |ИЗ
		               |	Справочник.CW_КонтактнаяИнформация КАК CW_КонтактнаяИнформация
		               |ГДЕ
		               |	(CW_КонтактнаяИнформация.Владелец = &Владелец
		               |			ИЛИ CW_КонтактнаяИнформация.Владелец = &ФизическоеЛицо)
		               |	И CW_КонтактнаяИнформация.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	CW_КонтактнаяИнформация.ВидКИ.Код
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Владелец", ТекущийОбъектОтбора);
		Запрос.УстановитьПараметр("ФизическоеЛицо", ТекущийОбъектОтбора.ФизическоеЛицо); 
		ТЗ = Запрос.Выполнить().Выгрузить(); 
		
	КонецЕсли; 
	// --- 
	КартинкаЗвезда = БиблиотекаКартинок.CW_ПользовательМаленький;
	АдресКартинки = ПоместитьВоВременноеХранилище(КартинкаЗвезда.ПолучитьДвоичныеДанные(),УникальныйИдентификатор);
	// --- 
	КонтактнаяИнформация.Загрузить(ТЗ);
	// --- 
	Для каждого Стр Из КонтактнаяИнформация Цикл
		Если (Стр.ЛичнаяКИ) Тогда
			Стр.ПризнакЛичнойКИ = АдресКартинки;
		КонецЕсли; 
	КонецЦикла; 
	// --- 
	Если (ЗначениеЗаполнено(ТекущаяКонтактнаяИнформация)) Тогда
		ТекущаяСтрока = _сф.к_НайтиСтроку(КонтактнаяИнформация,Новый Структура("Ссылка",ТекущаяКонтактнаяИнформация));
		Если (ТекущаяСтрока <> Неопределено) Тогда
			Элементы.КонтактнаяИнформация.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
		КонецЕсли; 
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	ПФ = Новый Структура("ЗначенияЗаполнения",Новый Структура("Владелец",ТекущийОбъектОтбора));
	Если (Копирование) Тогда
		ПФ.Вставить("ЗначениеКопирования", Элементы.КонтактнаяИнформация.ТекущиеДанные.Ссылка);
	КонецЕсли; 
	ОткрытьФорму("Справочник.CW_КонтактнаяИнформация.ФормаОбъекта", ПФ, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	Если (Элементы.КонтактнаяИнформация.ТекущиеДанные <> Неопределено) Тогда
		
		Если (Элемент.ТекущийЭлемент.Имя = "КонтактнаяИнформацияАдресКартинки") Тогда
			
			// переходим к КИ
			_УФК.ОткрытьКонтактнуюИнформацию(Элементы.КонтактнаяИнформация.ТекущиеДанные.Ссылка);
			
		Иначе
			
			ПФ = Новый Структура("Ключ",Элементы.КонтактнаяИнформация.ТекущиеДанные.Ссылка);
			ОткрытьФорму("Справочник.CW_КонтактнаяИнформация.ФормаОбъекта",ПФ,Элемент);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ТекущаяКонтактнаяИнформация = НовыйОбъект;
	_ОбновитьКонтактнуюИнформацию();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУдаленияКИ",ЭтотОбъект, Новый Структура());
	ПоказатьВопрос(ПОВ,"Удалить контактную информацию?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУдаленияКИ(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ=КодВозвратаДиалога.Да) Тогда
			
			Результат = _ВыполнитьУдалениеКИ(Элементы.КонтактнаяИнформация.ТекущиеДанные.Ссылка);
			Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
				Стр = КонтактнаяИнформация.НайтиПоИдентификатору(Элементы.КонтактнаяИнформация.ТекущаяСтрока);
				КонтактнаяИнформация.Удалить(Стр);
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ВыполнитьУдалениеКИ(СсылкаКИ)
	// --- 
	
	Попытка
		КИ = СсылкаКИ.ПолучитьОбъект();
		КИ.УстановитьПометкуУдаления(Истина);	
	Исключение
	    Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ПоискПоКонтактнойИнформации(Команда)
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаПоискаКонтактнойИнформации",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "") Тогда
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если (ВыбранноеЗначение <> Неопределено) Тогда
		
		ВладелецКИ = _ВладелецКИ(ВыбранноеЗначение);
		Если (ТипЗнч(ВладелецКИ)=Тип("СправочникСсылка.ФизическиеЛица")) Тогда
			
			Если (Элементы.СтраницыКонтрагентов.ТекущаяСтраница <> Элементы.СтраницаФизическиеЛица) Тогда
				Элементы.СтраницыКонтрагентов.ТекущаяСтраница = Элементы.СтраницаФизическиеЛица;
				ФормироватьДеревоКонтактныхЛиц = Ложь;
				ВидимостьРазделовФормы();	
			КонецЕсли; 
			// --- 
			Элементы.ФизическиеЛица.ТекущаяСтрока = ВладелецКИ;
			// --- 
			СтрокиКИ = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Ссылка",ВыбранноеЗначение));
			Если (СтрокиКИ.Количество() <> 0) Тогда
				СтрокаКИ = СтрокиКИ[0];
				Элементы.КонтактнаяИнформация.ТекущаяСтрока = СтрокаКИ.ПолучитьИдентификатор();
			КонецЕсли; 
			
		Иначе
			
			Если (Элементы.СтраницыКонтрагентов.ТекущаяСтраница <> Элементы.СтраницаКонтрагенты) Тогда
				Элементы.СтраницыКонтрагентов.ТекущаяСтраница = Элементы.СтраницаКонтрагенты;	
				ФормироватьДеревоКонтактныхЛиц = Истина;
				ВидимостьРазделовФормы();
			КонецЕсли; 
			// --- 
			ТекущийОбъект = ВладелецКИ.Контрагент;
			Элементы.Контрагенты.ТекущаяСтрока = ТекущийОбъект;
			_СформироватьДерево();
			ОбновитьЛоготип();
			// --- 
			Если (ВладелецКИ.КонтактноеЛицо <> Неопределено) Тогда
				ТекущийОбъектОтбора = ВладелецКИ.КонтактноеЛицо;
			Иначе
				ТекущийОбъектОтбора = ТекущийОбъект;
			КонецЕсли; 
			_ОбновитьКонтактнуюИнформацию();
			// --- 
			// ищем строку контактного лица в дереве
			Если (ВладелецКИ.КонтактноеЛицо <> Неопределено) Тогда
				
				ИдентификаторСтрокиКЛ = _ИдентификаторСтрокиКЛ(ВладелецКИ.КонтактноеЛицо);
				Если (ИдентификаторСтрокиКЛ <> Неопределено ) Тогда
					Элементы.КонтактныеЛица.ТекущаяСтрока = ИдентификаторСтрокиКЛ;
					// --- 
					СтрокиКИ = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Ссылка",ВыбранноеЗначение));
					Если (СтрокиКИ.Количество() <> 0) Тогда
						СтрокаКИ = СтрокиКИ[0];
						Элементы.КонтактнаяИнформация.ТекущаяСтрока = СтрокаКИ.ПолучитьИдентификатор();
					КонецЕсли; 
					// --- 
				КонецЕсли; 	
				
			Иначе
				
				СтрокиКИ = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Ссылка",ВыбранноеЗначение));
				Если (СтрокиКИ.Количество() <> 0) Тогда
					СтрокаКИ = СтрокиКИ[0];
					Элементы.КонтактнаяИнформация.ТекущаяСтрока = СтрокаКИ.ПолучитьИдентификатор();
				КонецЕсли; 
				
			КонецЕсли; 
			
			
		КонецЕсли; 
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьКонтрагента(Контрагент)
	// --- 
	
	Элементы.Контрагенты.ТекущаяСтрока = Контрагент;
	
	// --- 
КонецПроцедуры
 

&НаСервере
Функция _ИдентификаторСтрокиКЛ(КЛ)
	// --- 
	
	Возврат(_НайтиСтрокуДерева(КЛ,КонтактныеЛица));
	
	// --- 
КонецФункции

&НаСервере
Функция _НайтиСтрокуДерева(СсылкаКЛ,ЭлементДерева)
	// --- 
	
	СтрокаКЛ = Неопределено;
	
	Для каждого СтрокаДерева Из ЭлементДерева.ПолучитьЭлементы() Цикл
		
		Если (СтрокаДерева.Ссылка = СсылкаКЛ) Тогда
			
			Возврат(СтрокаДерева.ПолучитьИдентификатор());
			
		Иначе
			
			СтрокаКЛ = _НайтиСтрокуДерева(СсылкаКЛ, СтрокаДерева);
			Если (СтрокаКЛ <> Неопределено) Тогда
				
				Возврат(СтрокаКЛ);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(СтрокаКЛ);
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ВладелецКИ(КИ)
	// --- 
	
	Если (ТипЗнч(КИ.Владелец)=Тип("СправочникСсылка.ФизическиеЛица")) Тогда
		
		Возврат(КИ.Владелец);
		
	Иначе
		
		Если (ТипЗнч(КИ.Владелец)=Тип("СправочникСсылка.Контрагенты")) Тогда
			Возврат(Новый Структура("Контрагент,КонтактноеЛицо",КИ.Владелец,Неопределено));
		Иначе
			Возврат(Новый Структура("Контрагент,КонтактноеЛицо",КИ.Владелец.Владелец,КИ.Владелец));
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КонтактныеЛицаРазвернуть(Команда)
	
	РазвернутьДеревоКонтактныхЛиц();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаСвернуть(Команда)
	
	СвернутьДеревоКонтактныхЛиц();
	
КонецПроцедуры
 
&НаКлиенте
Процедура РазвернутьДеревоКонтактныхЛиц()
	// --- 
	
	Элементы.КонтактныеЛица.Развернуть(КонтактныеЛица.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);
	СохранитьВидДерева();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоКонтактныхЛиц()
	// --- 
	
	КорневаяСтрока = КонтактныеЛица.ПолучитьЭлементы()[0];
	Для каждого СтрокаДерева Из КорневаяСтрока.ПолучитьЭлементы() Цикл
		
		Элементы.КонтактныеЛица.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
		
	КонецЦикла; 
	СохранитьВидДерева();
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ЗагрузитьЛоготип(Команда)
	
	// показываем диалог выбора файла
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	//Текст = "ru = ""Текст""; en = ""Text""";
	Фильтр = "PNG|*.png|GIF|*.gif|BMP|*.bmp";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Файл = МассивФайлов[0];
		
		АдресФайла = "";
		ПОВ = Новый ОписаниеОповещения("ОбработкаЗагрузкиФайла",ЭтотОбъект, Новый Структура()); 
		НачатьПомещениеФайла(ПОВ,АдресФайла,Файл,Ложь,УникальныйИдентификатор);
		
	Иначе
		Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
		_УФК.ВывестиПредупреждение(НСтр(Текст));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗагрузкиФайла(Результат, АдресВременногоХранилищаФайла, ВыбранноеИмя, ДополнительныеПараметры) Экспорт 
	
	Если Результат Тогда
		
		ПараметрыВыбора = новый Структура;
		ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);
		
		ДополнительныеПараметры.Вставить("АдресВременногоХранилищаФайла", АдресВременногоХранилищаФайла);
		ДополнительныеПараметры.Вставить("ВыбранноеИмя", ВыбранноеИмя);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПомещениеФалов", ЭтотОбъект, ДополнительныеПараметры);
		Если ЗапрашиватьТипФайлаПриДобавленииВАрхив Тогда
			ОткрытьФорму("Справочник.CW_ТипыДокументовФайловогоАрхива.ФормаВыбора",ПараметрыВыбора,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ВыполнитьОбработкуОповещения(ОписаниеОповещения,Неопределено);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПомещениеФалов(РезультатВыбора, ДополнительныеПараметры)Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыбора = Неопределено И ЗапрашиватьТипФайлаПриДобавленииВАрхив Тогда
		ПоказатьПредупреждение(,"Не выбран тип документа. Добавление файла отменено!");
		Возврат;
	КонецЕсли;	
	
	ОбработатьЗагрузкуФайлаНаСервере(ДополнительныеПараметры.АдресВременногоХранилищаФайла, 
					ДополнительныеПараметры.ВыбранноеИмя, 
					РезультатВыбора);
			
	ОбновитьЛоготип();   
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗагрузкуФайлаНаСервере(АдресФайла, ВыбранноеИмя, ТипДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ЛоготипыКонтрагентов.ОбъектАрхива
	|ИЗ
	|	РегистрСведений.CW_ЛоготипыКонтрагентов КАК CW_ЛоготипыКонтрагентов
	|ГДЕ
	|	CW_ЛоготипыКонтрагентов.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", ТекущийОбъект);  
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда    
		ОбъектАрхива = Выборка.ОбъектАрхива;
		CW_РаботаСФайламиСервер.ЗаписатьФайлВТомХранения(ОбъектАрхива, АдресФайла, ОбъектАрхива.Том);
	Иначе  
		
		ПозТочки 	= СтрНайти(ВыбранноеИмя,".", НаправлениеПоиска.СКонца);
		Расширение 	= Сред(ВыбранноеИмя, ПозТочки);  

		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("Имя",			ВыбранноеИмя);
		ДанныеФайла.Вставить("Расширение",	Расширение);
		ДанныеФайла.Вставить("Хранение",	АдресФайла);
		
		ПомещенныйФайл = CW_РаботаСФайламиСервер.ПрикрепитьФайл(ДанныеФайла, ТекущийОбъект, ТипДокумента);
		
		Если ПомещенныйФайл <> Неопределено Тогда
			Запись = РегистрыСведений.CW_ЛоготипыКонтрагентов.СоздатьМенеджерЗаписи();
			Запись.Контрагент = ТекущийОбъект;
			Запись.ОбъектАрхива = ПомещенныйФайл;
			Запись.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЛоготип(Команда)
	
	_УдалитьЛоготип();
	// --- 
	ОбновитьЛоготип();
	
КонецПроцедуры

&НаСервере
Процедура _УдалитьЛоготип()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ЛоготипыКонтрагентов.ОбъектАрхива
	|ИЗ
	|	РегистрСведений.CW_ЛоготипыКонтрагентов КАК CW_ЛоготипыКонтрагентов
	|ГДЕ
	|	CW_ЛоготипыКонтрагентов.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", ТекущийОбъект);
	ОбъектАрхива = _сф.ВыполнитьЗапрос(Запрос,,Истина,"ОбъектАрхива",Неопределено);
	Если (ОбъектАрхива <> Неопределено) Тогда
		
		ОбъектАрхиваОбъект = ОбъектАрхива.ПолучитьОбъект();
		ОбъектАрхиваОбъект.ФайлЗагружен = Ложь;
		ОбъектАрхиваОбъект.Записать();
		
	КонецЕсли; 
	
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКонтактнуюИнформацию1(Команда)
	
	ОбновитьКонтактнуюИнформацию();
	
КонецПроцедуры

&НаКлиенте
Процедура СобытияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если (ТипЗнч(ТекущийОбъект)=Тип("СправочникСсылка.ФизическиеЛица")) Тогда
		
		Отказ = Истина;
		ПФ = Новый Структура("ФизическоеЛицо",ТекущийОбъект);
		ОткрытьФорму("Справочник.CW_События.ФормаОбъекта",ПФ,Элемент,Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СобытияОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Элементы.События.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаФизическогоЛицаУдалить(Команда)
	
	Если (Элементы.КонтактныеЛицаФизическогоЛица.ТекущиеДанные <> Неопределено) Тогда
		
		РезультатУдаления = _ВыполнитьУдалениеКонтактногоЛица(Элементы.КонтактныеЛицаФизическогоЛица.ТекущиеДанные.Ссылка);
		Если (_УФКС.ВыполненоУспешно(РезультатУдаления)) Тогда
			ТекущийУзел = Неопределено;
			_СформироватьТаблицуКонтактныхЛиц();
		Иначе
			Сообщить(_УФКС.ПредставлениеОшибки(РезультатУдаления));
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

#КонецОбласти 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КалендарьПриВыводеПериода(Элемент, ОформлениеПериода)
	
	// тмп
	//Сообщить("ОК");
	СтрокиМесяца = СобытияПоМесяцам.НайтиСтроки(Новый Структура("Месяц",ОформлениеПериода.НачалоПериода));
	Если (СтрокиМесяца.Количество() <> 0) Тогда
		
		СтрокаМесяца = СтрокиМесяца[0];
		ДатыМесяца = СтрокаМесяца.ДатыСобытий;
		// --- 
		Для каждого ЭлементДаты Из ОформлениеПериода.Даты Цикл
			
			Если (ДатыМесяца.НайтиПоЗначению(ЭлементДаты.Дата) <> Неопределено) Тогда
				
				ЭлементДаты.Шрифт = Новый Шрифт(ЭлементДаты.Шрифт,,,Истина);
				ЭлементДаты.ЦветТекста = WebЦвета.Белый;
				ЭлементДаты.ЦветФона = WebЦвета.ЦветМорскойВолныТемный;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаКалендарь(Команда)
	
	Элементы.Календарь.Видимость = (НЕ Элементы.Календарь.Видимость);
	Элементы.КомандаКалендарь.Пометка = Элементы.Календарь.Видимость;
	// --- 
	Если (Элементы.Календарь.Видимость) Тогда
		
		Календарь = ТекущаяДата();
		_ОбновитьДатыСобытий();
		_УстановитьОтборПоДатеСобытия();
		
	Иначе
		
		_ОтключитьОтборПоДатеСобытия();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьОтборПоДатеСобытия()
	// --- 
	
	События.Параметры.УстановитьЗначениеПараметра("ДатаСобытия",Календарь);
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _ОтключитьОтборПоДатеСобытия()
	// --- 
	
	События.Параметры.УстановитьЗначениеПараметра("ДатаСобытия",Неопределено);	
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриАктивизацииДаты(Элемент)
	
	//Сообщить(Календарь);
	ПодключитьОбработчикОжидания("ОтборСобытийПоДате",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСобытийПоДате()
	// --- 
	
	_ОтборПоДатеСобытия();
	// --- 
	Элементы.Календарь.Обновить();
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОбъектКонтрагентСтранаРегистрацииПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаЗаписатьЗакрыть(Команда)
	
	_ЗаписатьОбъект();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	_ЗаписатьОбъект();
	Если (Элементы.ГруппаКонтрагент.Видимость) Тогда
		УстановитьТекущийОбъект(ОбъектКонтрагент.Ссылка);
	ИначеЕсли (Элементы.ГруппаФизическоеЛицо.Видимость) Тогда 
		УстановитьТекущийОбъект(ОбъектФизическоеЛицо.Ссылка);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _ЗаписатьОбъект()
	// --- 
	
	Если (Элементы.ГруппаКонтрагент.Видимость) Тогда
		
		КонтрагентОбъект = РеквизитФормыВЗначение("ОбъектКонтрагент");
		КонтрагентОбъект.Записать();
		ЗначениеВРеквизитФормы(КонтрагентОбъект,"ОбъектКонтрагент");
		
		_СформироватьЗаголовокКонтрагента();
		
	ИначеЕсли (Элементы.ГруппаФизическоеЛицо.Видимость) Тогда 
		
		ФизическоеЛицоОбъект = РеквизитФормыВЗначение("ОбъектФизическоеЛицо");
		ФизическоеЛицоОбъект.Записать();
		ЗначениеВРеквизитФормы(ФизическоеЛицоОбъект,"ОбъектФизическоеЛицо"); 
		
		_СформироватьЗаголовокФизическогоЛица();
		
	КонецЕсли; 
	
	// --- 
	ОбъектЗаписан = Истина;
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОткрытьСтандартнуюФормуКонтрагента(Команда)
	
	Если (НЕ ОбъектКонтрагент.Ссылка.Пустая()) Тогда
		
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта",Новый Структура("Ключ",ОбъектКонтрагент.Ссылка));
		
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаКонтрагентОбновить(Команда)
	
	// ...
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// получим настройку пользователя, какая форма должна 
	// использоваться при открытии карточки элемента справочника:
	// 0 - стандартная, 1 - CRM
	РежимОткрытияФормыЭлемента = CW_Настройки.ПолучитьНастройкуПользователя(,"ИспользуемаяФормаКонтрагента"); 
	
	// стандартный диалог элемента (диалог типовой конфигурации БП)
	Если РежимОткрытияФормыЭлемента = 0 Тогда
		
		Отказ = Ложь;
		
	// CRM-форма
	Иначе
		
		Отказ = Истина;
		Ключ = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		ПФ = Новый Структура("Ключ",Ключ);
		Если (Копирование) Тогда
			ПФ.Вставить("ОбъектКопирования",Элементы.Контрагенты.ТекущаяСтрока);
		КонецЕсли;
		ДополнительныеПараметры = Новый Структура("НовыйЭлемент","Ссылка на новый элемент");
		ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияКонтрагента",ЭтотОбъект, ДополнительныеПараметры); 
		ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина,,,ПОВ,РежимОткрытияОкнаФормы.Независимый);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияКонтрагента(Ответ,ДополнительныеПараметры) Экспорт 
	
	Элементы.Контрагенты.Обновить();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КонтрагентыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",Новый Структура("Ключ",Элементы.Контрагенты.ТекущаяСтрока),,Истина);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ФизическиеЛицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// получим настройку пользователя, какая форма должна 
	// использоваться при открытии карточки элемента справочника:
	// 0 - стандартная, 1 - CRM
	РежимОткрытияФормыЭлемента = CW_Настройки.ПолучитьНастройкуПользователя(,"ИспользуемаяФормаКонтрагента"); 
	
	// стандартный диалог элемента (диалог типовой конфигурации БП)
	Если РежимОткрытияФормыЭлемента = 0 Тогда
		
		Отказ = Ложь;
		
	// CRM-форма
	Иначе
		
		Отказ = Истина;
		Ключ = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		ПФ = Новый Структура("Ключ",Ключ);
		Если (Копирование) Тогда
			ПФ.Вставить("ОбъектКопирования",Элементы.ФизическиеЛица.ТекущаяСтрока);
		КонецЕсли; 
		ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияФизическогоЛица",ЭтотОбъект, Новый Структура()); 
		ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина,,,ПОВ,РежимОткрытияОкнаФормы.Независимый);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияФизическогоЛица(Ответ,ДополнительныеПараметры) Экспорт 
	
	Элементы.ФизическиеЛица.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",Новый Структура("Ключ",Элементы.ФизическиеЛица.ТекущаяСтрока),,Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектКонтрагентНаименованиеПриИзменении(Элемент)
	
	_СформироватьЗаголовокКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектФизическоеЛицоФИОПриИзменении(Элемент)
	
	_СформироватьЗаголовокФизическогоЛица();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСобытияОбновить(Команда)
	
	Элементы.События.Обновить();
	_ОбновитьДатыСобытий();
	Элементы.Календарь.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтандартнуюФормуФизическогоЛица(Команда)
	
	Если (НЕ ОбъектФизическоеЛицо.Ссылка.Пустая()) Тогда
		
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта",Новый Структура("Ключ",ОбъектФизическоеЛицо.Ссылка));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если (РежимВыбораКИ) Тогда
		
		СтандартнаяОбработка = Ложь;
		// формируем структуру адреса
		ОповеститьОВыборе(Элементы.КонтактнаяИнформация.ТекущиеДанные.Ссылка);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _СтруктураАдреса(ВыбраннаяСтрока)
	// --- 
	
	СтрокаКИ = КонтактнаяИнформация.НайтиПоИдентификатору(ВыбраннаяСтрока);
	// --- 
	Если (ТипЗнч(СтрокаКИ.Ссылка.Владелец) = Тип("СправочникСсылка.CW_КонтактыеЛица")) Тогда
		СА = _ЭП.СтруктураАдресаПоСтроке(Строка(СтрокаКИ.Ссылка.Владелец)+"<"+СтрокаКИ.Значение+">");
	Иначе
		СА = _ЭП.СтруктураАдресаПоСтроке(СтрокаКИ.Значение);
	КонецЕсли; 
	// --- 
	Возврат(СА);
	
	// --- 
КонецФункции


&НаКлиенте
Процедура МенедджерПродажНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ПолучитьИзВременногоХранилища(АдресСпискаМенеджеров);

	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", ДанныеВыбора);
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("Отбор", СтруктураОтбора);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыФормыВыбора, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры
 
&НаСервере
Процедура ПолучитьДействующихМенеджеров()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ДействующиеМенеджеры.Менеджер КАК Менеджер
	               |ИЗ
	               |	РегистрСведений.CW_ДействующиеМенеджеры КАК CW_ДействующиеМенеджеры
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивВыбора = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивВыбора.Добавить(Выборка.Менеджер);
	КонецЦикла;
	
	АдресСпискаМенеджеров = ПоместитьВоВременноеХранилище(МассивВыбора, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура МенедджерПродажПриИзменении(Элемент)
	
	МенедджерПродажПриИзмененииНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура МенедджерПродажПриИзмененииНаСервере()
	
	СписокКонтрагентов.Отбор.Элементы.Очистить();
	
	Если Не ЗначениеЗаполнено(МенеджерПродаж) Тогда
		Возврат;
	Конецесли;

	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_МенеджерыПродажКлиентовСрезПоследних.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.CW_МенеджерыПродажКлиентов.СрезПоследних(&ДатаСреза, МенеджерПродаж = &МенеджерПродаж) КАК CW_МенеджерыПродажКлиентовСрезПоследних
	               |ГДЕ
	               |	CW_МенеджерыПродажКлиентовСрезПоследних.МенеджерПродаж В(&МенеджерПродаж)";
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	Запрос.УстановитьПараметр("МенеджерПродаж", МенеджерПродаж);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПравоеЗначение = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		ПравоеЗначение.Добавить(Выборка.Контрагент);
	КонецЦикла;
	
	ЭлементОтбора = СписокКонтрагентов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение 	= ПравоеЗначение
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 



