#Область СлужебныйПрограммныйИнтерфейс

// В процедуре нужно реализовать возможность работы с видами продукции, с которыми предполагается работа объектов.
// 
// Параметры:
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования.
//  Контекст - Неопределено, ФормаКлиентскогоПриложения, ДокументСсылка - Описание
//  ВидПродукции - Массив Из СправочникСсылка.ВидыПродукцииИС - Вид продукции, по которому будут инициализированы параметры сканирования
//  Сценарий - Число - сценарий при наличии нескольких возможных сценариев.
//
Процедура ПриЗаполненииПараметровСканирования(ПараметрыСканирования, Контекст, ВидПродукции, Сценарий = 0) Экспорт
	
	Если ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЭтоФормаПроверкиИПодбора(Контекст) Тогда
		ПриЗаполненииПараметровСканирования(ПараметрыСканирования, Контекст.Контекст, ВидПродукции);
		Возврат;
	КонецЕсли;

	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.РозничнаяПродажа") Тогда
		
		ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "Товары";
		ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "АкцизнаяМарка";
	

		// В розничной продаже сканирование маркируемой продукции происходит из формы документа, 
		// поэтому там может быть как маркированная так и немаркированная продукция
		// Во всех остальных документах - из формы "Проверка и подбор" 
		// куда попадает только маркируемая продукция определенного вида
		ШтрихкодированиеИСКлиентСервер.ВключитьПоддержкуПрочейПродукции(ПараметрыСканирования);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.АктОРасхождениях") 
		ИЛИ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.АктОРасхожденияхПолученный") 
		ИЛИ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.КорректировкаПоступления") 
		ИЛИ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.КорректировкаРеализации") 
		ИЛИ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ПоступлениеТоваровУслуг")
		ИЛИ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.РеализацияТоваровУслуг")
		ИЛИ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.КорректировкаРеализации")
		ИЛИ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ВозвратТоваровОтПокупателя")
		ИЛИ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ПередачаТоваров") Тогда
		
		ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "ШтрихкодыУпаковок";
		ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "ШтрихкодУпаковки";
	КонецЕсли;
	
	ПараметрыСканирования.Вставить("КонтрольРасхожденийСДокументомОснованием", Ложь);
	
	ИнтеграцияИСБПКлиентСервер.ВключитьПоддержкуВидовПродукцииИС(Контекст, ПараметрыСканирования, ВидПродукции);
	
КонецПроцедуры

// БРМК. При экранировании кода маркировки.
// В методе полный код маркировки конвертировать в значение, которое срохраняется в см. ОпределяемыйТип.ШтрихкодУпаковкиИС
// Параметры:
//  КодМаркировки - Строка - полный код маркировки, содерщаний символ <GS>
Процедура ПриЭкранированнииПолногоКодаМаркировки(КодМаркировки) Экспорт
	
	Возврат;
	
КонецПроцедуры

// БРМК. При восстановлении экранированного кода маркировки.
// В методе необходим восстанавить исходной код маркировки, если он был изменен при первоначальной обработке.
// Параметры:
//  КодМаркировки - Строка - экранированный маркировки, который необхоидимо восстановить.
Процедура ПриВосстановленииЭкранированногоКодаМаркировки(КодМаркировки) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
