&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ИспользованиеБюджетирования 	= ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования");
	
	Параметры.Свойство("ОбъектКопирования", 	ОбъектКопирования);   
	Параметры.Свойство("УИД", 					УникальныйИдентификаторВладельца);   
 	Параметры.Свойство("КопированиеИзЗаказа", 	КопированиеИзЗаказа); 
 	Параметры.Свойство("ИзменятьТипПеревозки", 	ИзменятьТипПеревозки); 
	

	НастройкиПользователя = CW_Настройки.ПолучитьНастройкиПользователя(ПараметрыСеанса.ТекущийПользователь);
	УстановитьТекущуюДатуГрузоперевозки 					= НастройкиПользователя.УстанавливатьТекущуюДатуГрузоперевозкиПриКопировании;
	ОчищатьПредставление 									= НастройкиПользователя.ОчищатьПредставлениеГрузоперевозкиПриКопировании;
	СпособЗаполненияПараметровГрузоперевозкиПриКопировании 	= НастройкиПользователя.СпособЗаполненияПараметровГрузоперевозкиПриКопировании;

	Если CW_ИспользованиеБюджетирования тогда
		_СформироватьСписокВерсийБюджетов();
	КонецЕсли;
	
	_УправлениеЭлементамиФормы();
	
	Количество = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбработкаОтображения();
	
КонецПроцедуры


&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	Элементы.ГруппаКопированиеБюджета.Видимость 	=  CW_ИспользованиеБюджетирования;
	Элементы.ВерсииБюджетов.Видимость 				= КопироватьБюджет;   
	Элементы.ОчищатьСсылкуНаЗаказ.Видимость 		= Не КопированиеИзЗаказа;

	Элементы.НовыйТипПеревозки.Видимость			= (СпособУстановкиТипаПеревозки = 1) и ИзменятьТипПеревозки;   
	Элементы.ГруппаКопироватьТипПеревозки.Видимость	= ИзменятьТипПеревозки;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУстановкиТипаПеревозкиПриИзменении(Элемент)
	_УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура СпособУстанвокитипаПеревозки1ПриИзменении(Элемент)
	_УправлениеЭлементамиФормы();
КонецПроцедуры 

&НаКлиенте
Процедура КоличествоКопийПриИзменении(Элемент)
	
	ОбработкаОтображения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтображения()
	
	Элементы.Количество.Видимость 			= КоличествоКопий = 0;
	Элементы.ОчищатьПредставление.Видимость = КоличествоКопий = 0;
	Элементы.Список.Видимость     			= КоличествоКопий <> 0;
	
	Если КоличествоКопий = 1 Тогда
		ОчищатьПредставление	= Ложь;
	КонецЕсли;	
	
КонецПроцедуры	

//-----------------------------------------------------

&НаКлиенте
Процедура ЗакрытьОкно(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Копировать(Команда)
	
	Если КоличествоКопий = 0 Тогда
		ЭтаФорма.Закрыть(_АдресПараметров(Количество))
	ИначеЕсли КоличествоКопий = 1 Тогда
		Если НЕ ЗначениеЗаполнено(Список) Тогда
			Возврат;
		Иначе	
			ПолучитьСписок();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

//-----------------------------------------------------

&НаКлиенте
Процедура ПолучитьСписок()
	
	Разделители = ПолучитьРазделитили();
	спПредставлений = Новый СписокЗначений;
	ДлТекста = СтрДлина(Список);
	ВыхТекст = "";
	Для Инк = 1 по ДлТекста Цикл
		Если Разделители.Найти(Сред(Список, Инк, 1)) = Неопределено Тогда
			ВыхТекст = ВыхТекст + Сред(Список, Инк, 1);	
		Иначе
			Если ЗначениеЗаполнено(ВыхТекст) Тогда
				спПредставлений.Добавить(ВыхТекст);
				ВыхТекст = "";
			КонецЕсли;	
		КонецЕсли; 
	КонецЦикла;	
	Если ЗначениеЗаполнено(ВыхТекст) Тогда
		спПредставлений.Добавить(ВыхТекст);
		ВыхТекст = "";
	КонецЕсли;
	
	Если спПредставлений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПОВ = Новый ОписаниеОповещения("ОбработатьВопрос", ЭтаФорма, спПредставлений);
	ПоказатьВопрос(ПОВ, "Будет добавлено " + спПредставлений.Количество() + " копий грузоперевозки. Продолжить?", РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопрос(Ответ, спПредставлений) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		ЭтаФорма.Закрыть(_АдресПараметров(спПредставлений));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРазделитили();
	
	мас = Новый Массив;
	мас.Добавить(";");
	мас.Добавить(".");
	мас.Добавить(",");
	мас.Добавить(" ");	
	мас.Добавить(Символы.ВК);
	мас.Добавить(Символы.ВТаб);
	мас.Добавить(Символы.ПС);
	мас.Добавить(Символы.ПФ);
	мас.Добавить(Символы.Таб); 
	
	Возврат мас;
	
КонецФункции	

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _СформироватьСписокВерсийБюджетов()
	
	ВерсииБюджетов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_ВерсииБюджетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ВерсииБюджетов КАК CW_ВерсииБюджетов
	|ГДЕ
	|	CW_ВерсииБюджетов.ПометкаУдаления = ЛОЖЬ";  
	
	РезультатЗапрсоа = Запрос.Выполнить(); 
	Выборка = РезультатЗапрсоа.Выбрать();
	Пока  Выборка.Следующий() Цикл
		ВерсииБюджетов.Добавить(Выборка.Ссылка,,Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьБюджетПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Функция _АдресПараметров(спПредставлений=Неопределено)
	
	Ответ = Новый Структура("ОбъектКопирования,ОчищатьПредставление,УстановитьТекущуюДатуГрузоперевозки,ВерсииБюджетов,ОчищатьСсылкуНаЗаказ,Количество,КопииЗаданыСписком,СпособЗаполненияПараметровГрузоперевозкиПриКопировании,СпособУстановкиТипаПеревозки,НовыйТипПеревозки");
	Ответ.ОбъектКопирования 	= ОбъектКопирования;
	Ответ.Количество 			= спПредставлений;
	Ответ.ОчищатьСсылкуНаЗаказ 	= ОчищатьСсылкуНаЗаказ;
	
	Ответ.ОчищатьПредставление 					= ОчищатьПредставление;
	Ответ.УстановитьТекущуюДатуГрузоперевозки 	= УстановитьТекущуюДатуГрузоперевозки;
	Ответ.КопииЗаданыСписком 					= КоличествоКопий = 1;
	
	Ответ.СпособЗаполненияПараметровГрузоперевозкиПриКопировании = СпособЗаполненияПараметровГрузоперевозкиПриКопировании; 
	
	Ответ.СпособУстановкиТипаПеревозки	= СпособУстановкиТипаПеревозки;
	Ответ.НовыйТипПеревозки 			= НовыйТипПеревозки;
	
	ВыбранныеВерсии = Новый Массив;
	
	Если КопироватьБюджет Тогда  
		Для Каждого ЭлементСписка  из ВерсииБюджетов Цикл
			Если ЭлементСписка.Пометка Тогда
				ВыбранныеВерсии.Добавить(ЭлементСписка.Значение);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;                      
	
	Ответ.ВерсииБюджетов = ВыбранныеВерсии;
	
	Возврат ПоместитьВоВременноеХранилище(Ответ, УникальныйИдентификаторВладельца);
	
КонецФункции

