&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.КлючТекущихПользовательскихНастроек = "";
	Параметры.Свойство("ВнешнийВызов", Отчет.ВнешнийВызов);
	Если Отчет.ВнешнийВызов Тогда
		ПФ = Новый Структура("Отбор,Группировки");
		ЗаполнитьЗначенияСвойств(ПФ, Параметры);
		Отчет.АдресВнешнихНастроек = ПоместитьВоВременноеХранилище(ПФ, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли; 
	
	// вызов из формы параметров договора
	Если Параметры.Свойство("Договор") Тогда 
		//CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Договор", ВидСравненияКомпоновкиДанных.Равно, Параметры.Договор, Истина, об.КомпоновщикНастроек.Настройки.Отбор);
		//CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Контрагент", ВидСравненияКомпоновкиДанных.Равно, Параметры.Договор.Владелец, Истина, об.КомпоновщикНастроек.Настройки.Отбор);
		Отчет.ВнешнийВызов = Истина;
		ПФ = Новый Структура("Отбор,Группировки");
		пф.отбор = Новый Структура("Контрагент, Договор", Параметры.Договор.Владелец, Параметры.Договор);
		пф.Группировки = Новый Массив;
		пф.Группировки.Добавить("Договор");
		пф.Группировки.Добавить("Грузоперевозка");
		Отчет.АдресВнешнихНастроек = ПоместитьВоВременноеХранилище(ПФ, ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	_ВосстановитьСтандартныеНастройки();
	_ВосстановитьСеансовуюНастройку();	
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	НаДату = ТекущаяДата();
	
	Если Отчет.ВнешнийВызов Тогда
		_ОбработатьВнешниеПараметры();
		Сформировать(Неопределено);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	
	//БухгалтерскиеОтчетыКлиент
	БухгалтерскиеОтчетыКлиент.НачатьРасчетСуммыВыделенныхЯчеек(
		Элементы.Результат,
		ЭтотОбъект,
		"Подключаемый_РезультатПриАктивизацииПодключаемый");
	//---БухгалтерскиеОтчетыКлиент

КонецПроцедуры

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_НеперевыставленныеЗатраты.ПолучитьМакет("Схема").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаСервере
Процедура _ОбработатьВнешниеПараметры()
	
	ПокКол   = Ложь;
	ПокСумма = Ложь;
	ПокНДС   = Ложь;
	ПокВсего = Истина;
	
	СП = ПолучитьИзВременногоХранилища(Отчет.АдресВнешнихНастроек);
	
	_Группировки = _сф.ст_ПолучитьСвойство(СП,"Группировки");
	Если (_Группировки <> Неопределено) Тогда
		Группировки.Очистить();
		Для каждого _Группировка Из _Группировки Цикл
			Нстр = Группировки.Добавить();
			Нстр.ИмяПоля = _Группировка;
			Нстр.Представление = _Группировка;
			Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		КонецЦикла; 
	КонецЕсли; 
	
	_ВосстановитьСеансовуюНастройку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку(); 
	ВариантМодифицирован = Ложь;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть = Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка    = Ложь;
	Иначе
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка    = Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка    = Истина;
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	Если НЕ Отчет.ВнешнийВызов Тогда
		ИмяНастройки = "Сеансовая";
	Иначе
		ИмяНастройки = "Сеансовая_ВнешнийВызов";
	КонецЕсли;
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, ИмяНастройки);
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			
			СеансоваяНастройка.Свойство("ПокКол", ПокКол);
			СеансоваяНастройка.Свойство("ПокСумма", ПокСумма);
			СеансоваяНастройка.Свойство("ПокНДС", ПокНДС);
			СеансоваяНастройка.Свойство("ПокВсего", ПокВсего);			
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			// Отбор
			НастройкиКД = "";
			СеансоваяНастройка.Свойство("Отбор", НастройкиКД);
			Если (НЕ Отчет.ВнешнийВызов) Тогда
				Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			Для Каждого СтрОтбор из НастройкиКД.Отбор.Элементы Цикл
				НовОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовОтбор, СтрОтбор);
			КонецЦикла;		
			КонецЕсли; 
			
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	Если НЕ Отчет.ВнешнийВызов Тогда
		ИмяНастройки = "Сеансовая";
	Иначе
		ИмяНастройки = "Сеансовая_ВнешнийВызов";
	КонецЕсли;
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("ПокКол", ПокКол);
	СтруктураНастройки.Вставить("ПокСумма", ПокСумма);
	СтруктураНастройки.Вставить("ПокНДС", ПокНДС);
	СтруктураНастройки.Вставить("ПокВсего", ПокВсего);
	СтруктураНастройки.Вставить("Группировки", Группировки.Выгрузить());
	СтруктураНастройки.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, ИмяНастройки, СтруктураНастройки);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
		      
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ПокСумма И НЕ ПокНДС И НЕ ПокВсего И НЕ ПокКол Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного показателя!");
		Возврат;		
	КонецЕсли;
	
	Если Группировки.Количество() = 0 Тогда
		_УФК.ВывестиПредупреждение("Не выбрано ни одной группировки!");
		Возврат;				
	КонецЕсли;	
	
	_Настройка(Истина);
	СформироватьОтчет();
	ОбработатьОтчет();
		
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
		
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	
	_СохранитьСеансовуюНастройку(); 
	
	//После первого формирования сбрасываем внешний вызов,
	//чтобы была возможность сформировать отчет с другими настройкам
	Отчет.ВнешнийВызов 			= Ложь;
	Отчет.АдресВнешнихНастроек 	=  ""; 
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	
	Настройки = _сф.ст_Создать("НаДату,ПокСумма,ПокНДС,ПокВсего,ПокКол,Группировки");
	Настройки.НаДату = НаДату;
	Настройки.ПокКол = ПокКол;
	Настройки.ПокСумма = ПокСумма;
	Настройки.ПокНДС = ПокНДС;
	Настройки.ПокВсего = ПокВсего;
	Настройки.Группировки = Группировки.Выгрузить();
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор));
	
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "0:00:00", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "23:59:59", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "КолонкаКол", "Количество", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "КолонкаСумма", "Сумма", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "КолонкаНДС", "НДС", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "КолонкаВсего", "Всего", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
	СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	
	ДоступныеДействия = Новый Массив();
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
	
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("ПокКол", ПокКол);
	Настройки.ДополнительныеСвойства.Вставить("ПокСумма", ПокСумма);
	Настройки.ДополнительныеСвойства.Вставить("ПокНДС", ПокНДС);
	Настройки.ДополнительныеСвойства.Вставить("ПокВсего", ПокВсего);
	//Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки.Выгрузить());
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); // ДанныеФормыКоллекция
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если Отчет.ВнешнийВызов Тогда
		Возврат;
	КонецЕсли;
	
	CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);

КонецПроцедуры

//БухгалтерскиеОтчетыКлиент
&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Результат, Элементы.Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры
//---БухгалтерскиеОтчетыКлиент
