
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстанавиливаемыеПараметры = Новый Структура("CW_ГруппаПользователя", CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь));
	УстановитьПараметрыФункциональныхОпцийФормы(УстанавиливаемыеПараметры);

	Валюта  	= Константы.ВалютаРегламентированногоУчета.Получить();
	Сценарий 	= Справочники.CW_СценарииПланированияДДС.Недельный;
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	ТекущаяДата = ТекущаяДата();

	ЗаполнитьДоступныеСтатусы();
	
	ГруппаПользователя 			= CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь,Истина) или  ГруппаПользователя.ПолныеПрава;

	ВводЗаявокНаРасходБДДС 		= CW_ПраваДоступа.ПравоДоступно("ВводЗаявокНаРасходБДДС");
	ВводПлановыхПоступленийБДДС = CW_ПраваДоступа.ПравоДоступно("ВводПлановыхПоступленийБДДС");
	РольКазначея 				= CW_ПраваДоступа.ПравоДоступно("РольКазначея");
	РольФинансовогоКонтролера 	= CW_ПраваДоступа.ПравоДоступно("РольФинансовогоКонтролера");
	
	Элементы.ПоказатьВсе.Видимость 			= ВводЗаявокНаРасходБДДС и ВводПлановыхПоступленийБДДС;
	Элементы.ПоказатьПоступления.Видимость 	= ВводПлановыхПоступленийБДДС;
	Элементы.ПоказатьРасход.Видимость 		= ВводЗаявокНаРасходБДДС;

	Элементы.СписокСоздать.Видимость 		= ВводЗаявокНаРасходБДДС или ВводПлановыхПоступленийБДДС;
	Элементы.Скопировать.Видимость 			= ВводЗаявокНаРасходБДДС или ВводПлановыхПоступленийБДДС;
	
	//Определим права на просмотр статей ДДС
	Если НЕ ЭтоПолноправныйПользователь Тогда
		ПросмотрСтатейДДС.ЗагрузитьЗначения(CW_ПланированиеДДС.ПросмотрСтатейДДС(ГруппаПользователя));
	КонецЕсли; 
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеСтатусы()
	
	Для Каждого ЗначенияПеречисления из Метаданные.Перечисления.CW_СтатусыПланированияДДС.ЗначенияПеречисления Цикл
		 ДоступныеСтатусы.Добавить(Перечисления.CW_СтатусыПланированияДДС[ЗначенияПеречисления.Имя]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЭтоПолноправныйПользователь И НЕ CW_ПраваДоступа.ПравоДоступно("ДоступенБлокПланированияДДС") Тогда
		Отказ = Истина;	
		ПоказатьПредупреждение(,"Нет прав на работу с журналом!");
	КонецЕсли; 
	
	Период.Вариант = ВариантСтандартногоПериода.ДоКонцаЭтойНедели;

	Если (ВводЗаявокНаРасходБДДС и ВводПлановыхПоступленийБДДС) или ВводЗаявокНаРасходБДДС Тогда
		ИндексКнопки  = 0;
	ИначеЕсли ВводПлановыхПоступленийБДДС Тогда
		ИндексКнопки  = 1;
	Иначе
		ИндексКнопки  = 0;
	КонецЕсли;	
	ОтборВидДвижения = истина;
	
	ОбработатьНажатиеВидаДвижения(ИндексКнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр) 
	
	Если Не (ВводЗаявокНаРасходБДДС или ВводПлановыхПоступленийБДДС) Тогда
		Отказ = истина;
		Возврат;
	КонецЕсли;       
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;

	Отказ = истина;
	
	Если Элементы.ПоказатьПоступления.Пометка Тогда
		СоздатьСтатьюДДС(ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Приход"));	
	ИначеЕсли Элементы.ПоказатьРасход.Пометка Тогда
		СоздатьСтатьюДДС(ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход"));
	Иначе
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход"),"Заявка на расход");
		СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Приход"),"План поступления"); 
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборВидаСтатьи",ЭтаФорма);
		
		СписокЗначений.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите вид двжения");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаСтатьи(ВидДвижения, ДополнительныеПараметры) Экспорт
	
	Если ВидДвижения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СоздатьСтатьюДДС(ВидДвижения.Значение)			
	
КонецПроцедуры
  
&НаКлиенте
Процедура СоздатьСтатьюДДС(ВидДвижения)
	ЗначенияЗаполнения = Новый Структура("Сценарий,Организация,Валюта,Подразделение");ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения,ЭтаФорма);
	ЗначенияЗаполнения.Вставить("ВидДвижения",ВидДвижения);
	ОткрытьФорму("Справочник.CW_ПланированиеДДС.ФормаОбъекта",Новый Структура("ЗначенияЗаполнения",ЗначенияЗаполнения));
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьРеестрПлатежейНаСервере(Знач мВыбранныеСтатьи)

	//Для версии КОРП
	ВестиУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для версии КОРП
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПланированиеДДС.Ссылка КАК Ссылка,
	               |	CW_ПланированиеДДС.Сумма КАК Сумма,
	               |	CW_ПланированиеДДС.ПланОплаты КАК ПланОплатыКОЛИЧЕСТВО,
	               |	CW_ПланированиеДДС.Организация КАК ОрганизацияКОЛИЧЕСТВО,
	               |	CW_ПланированиеДДС.Валюта КАК ВалютаКОЛИЧЕСТВО,
	               |	CW_ПланированиеДДС.Офис КАК ОфисКОЛИЧЕСТВО,
	               |	CW_ПланированиеДДС.ПланОплаты КАК ПланОплаты,
	               |	CW_ПланированиеДДС.Организация КАК Организация,
	               |	CW_ПланированиеДДС.Валюта КАК Валюта,
	               |	CW_ПланированиеДДС.Офис КАК Офис,
	               |	CW_ПланированиеДДС.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |	CW_ПланированиеДДС.ПодразделениеОрганизации КАК ПодразделениеОрганизацииКОЛИЧЕСТВО
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		CW_СтатусыПланированиеДДССрезПоследних.ПланированиеДДС КАК ПланированиеДДС,
	               |		CW_СтатусыПланированиеДДССрезПоследних.Статус КАК Статус
	               |	ИЗ
	               |		РегистрСведений.CW_СтатусыПланированиеДДС.СрезПоследних(&ДатаСреза, ПланированиеДДС В (&мВыбранныеСтатьи)) КАК CW_СтатусыПланированиеДДССрезПоследних
	               |	ГДЕ
	               |		CW_СтатусыПланированиеДДССрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.CW_СтатусыПланированияДДС.Согласована)) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CW_ПланированиеДДС КАК CW_ПланированиеДДС
	               |		ПО ВложенныйЗапрос.ПланированиеДДС = CW_ПланированиеДДС.Ссылка
	               |ГДЕ
	               |	CW_ПланированиеДДС.Ссылка В(&мВыбранныеСтатьи)
	               |	И CW_ПланированиеДДС.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженияДДС.Расход)
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПланОплатыКОЛИЧЕСТВО),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОрганизацияКОЛИЧЕСТВО),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВалютаКОЛИЧЕСТВО),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОфисКОЛИЧЕСТВО),
	               |	МАКСИМУМ(ПланОплаты),
	               |	МАКСИМУМ(Организация),
	               |	МАКСИМУМ(Валюта),
	               |	МАКСИМУМ(Офис),
	               |	МАКСИМУМ(ПодразделениеОрганизации),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПодразделениеОрганизацииКОЛИЧЕСТВО)
	               |ПО
	               |	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("мВыбранныеСтатьи", 	мВыбранныеСтатьи);
	Запрос.УстановитьПараметр("ДатаСреза", 			ТекущаяДата());
	
	ВыборкаОбщие = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаОбщие.Следующий() Тогда
		Отказ = Ложь;
		Если ВыборкаОбщие.ПланОплатыКОЛИЧЕСТВО > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранных заявок указана разная плановая дата оплаты",,,,Отказ);			
		КонецЕсли;
		Если ВыборкаОбщие.ОрганизацияКОЛИЧЕСТВО > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранных заявок указана разная орагнизация",,,,Отказ);			
		КонецЕсли;
		Если ВыборкаОбщие.ВалютаКОЛИЧЕСТВО > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранных заявок указана разная валюта",,,,Отказ);			
		КонецЕсли;
		Если ВыборкаОбщие.ОфисКОЛИЧЕСТВО > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранных заявок указан разный офис",,,,Отказ);			
		КонецЕсли;
		
		//Для версии КОРП  
		Если ВестиУчетПоПодразделениям и ВыборкаОбщие.ПодразделениеОрганизацииКОЛИЧЕСТВО > 1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбранных заявок указано разное подразделение организации",,,,Отказ);			
		КонецЕсли;
		//Для версии КОРП
		
		Если Отказ тогда
			Возврат "Выделенные заявки не могут быть включены в один реестр платежей!"
		КонецЕсли;
		
		Результат = Новый Структура;
		Результат.Вставить("Дата",			ВыборкаОбщие.ПланОплаты);
		Результат.Вставить("Организация",	ВыборкаОбщие.Организация);
		Результат.Вставить("Офис",			ВыборкаОбщие.Офис);
		Результат.Вставить("Валюта",		ВыборкаОбщие.Валюта);
		
		//Для версии КОРП  
		Результат.Вставить("ПодразделениеОрганизации", ВыборкаОбщие.ПодразделениеОрганизации);
		//Для версии КОРП  
		
		ОбъектыПлатежа = Новый Массив;
		Выборка = ВыборкаОбщие.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтрокаДокумента = Новый Структура;
			СтрокаДокумента.Вставить("Статья", Выборка.Ссылка);
			СтрокаДокумента.Вставить("Сумма",  Выборка.Сумма);
			
			ОбъектыПлатежа.Добавить(СтрокаДокумента); 			
		КонецЦикла; 
			
		Результат.Вставить("ОбъектыПлатежа", ОбъектыПлатежа);
		
		Возврат  Результат;
		
	Иначе
		Возврат	"Выберите статьи на расход в статусе ""Согласована""!";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СформироватьРеестрПлатежей(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Ответ = СформироватьРеестрПлатежейНаСервере(ВыделенныеСтроки);
	
	Если ТипЗнч(Ответ) = Тип("Структура") Тогда
		ОписаниеОповещения 	= Новый ОписаниеОповещения("ОбновитьСписок",ЭтаФорма);
		
		ПраметрыФормы 		= Новый Структура("ЗначенияЗаполнения",Ответ);  
		ПраметрыФормы.Вставить("Организация", Ответ.Организация);
		ОткрытьФорму("Документ.CW_РеестрПлатежей.Форма.ФормаДокумента",ПраметрыФормы,,,,,ОписаниеОповещения); 
	Иначе 
		ПоказатьПредупреждение(,Ответ);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Рез,ДП) Экспорт
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьНаДату(Команда)
	ПоказатьВводДаты(Новый ОписаниеОповещения("ВводДатыОплаты",ЭтаФорма),ТекущаяДата(),,ЧастиДаты.Дата);
КонецПроцедуры
 
&НаКлиенте
Процедура ВводДатыОплаты(ПланОплаты,ДополнительныеПараметры) Экспорт
	Если НЕ ПланОплаты = Неопределено Тогда
		 ЗапланироватьНаДатуНаСервере(ПланОплаты);
		 Элементы.Список.Обновить();
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ЗапланироватьНаДатуНаСервере(ПланОплаты)
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		
		СтатусСтатьи = РегистрыСведений.CW_СтатусыПланированиеДДС.ПолучитьСтатусПланированияДДС(СтрокаСписка);
		
		Если СтатусСтатьи = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.ВОплате") или 
			СтатусСтатьи = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Оплачено") Тогда
			Продолжить;	
		КонецЕсли; 
		
		ДанныеДоговора = CW_ПланированиеДДССервер.ПолучитьДанныеДоговора(СтрокаСписка.Договор);
		
		ОбъектПланированиеДДС = СтрокаСписка.ПолучитьОбъект();
		
		ОбъектПланированиеДДС.ПланОплаты = ПланОплаты;
		
		Если ЗначениеЗаполнено(ПланОплаты) Тогда
			ОбъектПланированиеДДС.Контролер			= ПараметрыСеанса.ТекущийПользователь;
			ОбъектПланированиеДДС.ДатаПланирования 	= ТекущаяДата();
			ОбъектПланированиеДДС.Состояние			= 1;
			
			РегистрыСведений.CW_СтатусыПланированиеДДС.ЗаписатьСтатусВРегистр(СтрокаСписка, ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Согласована"));
			
			Если ДанныеДоговора.РасчетыВУсловныхЕдиницах Тогда
				Если ТипЗнч(ОбъектПланированиеДДС.ДокументОснование) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
					ДанныеДокументаОснования 	= ПолучитьДанныеДокументаОснования(ОбъектПланированиеДДС.ДокументОснование);
					ПараметрыПланирования = РегистрыСведений.CW_ПараметрыПланированияДДС.ПолучитьПараметрыПланирования(ОбъектПланированиеДДС.Организация, ДанныеДокументаОснования.ДатаСчета);
					Если НЕ ПараметрыПланирования = Неопределено И ПараметрыПланирования.ПересчитыватьСуммуПриСогласовании Тогда
						СтруктураКурса =  CW_Финансы.ПолучитьКурсВалюты(ДанныеДокументаОснования.Валюта,ОбъектПланированиеДДС.ПланОплаты);
						ОбъектПланированиеДДС.Сумма	= Окр(ДанныеДокументаОснования.СуммаДокумента *  СтруктураКурса.Курс/СтруктураКурса.Кратность, 2);
					КонецЕсли; 
					
				КонецЕсли; 
			КонецЕсли; 
			
		Иначе
			ОбъектПланированиеДДС.Контролер			= Неопределено;
			ОбъектПланированиеДДС.ДатаПланирования 	= Неопределено;
			ОбъектПланированиеДДС.Состояние			= 0;
			
			РегистрыСведений.CW_СтатусыПланированиеДДС.ЗаписатьСтатусВРегистр(СтрокаСписка, ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.План"));
		КонецЕсли; 
		
		ОбъектПланированиеДДС.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеДокументаОснования(ДокументОснование)
	
	Результат = Новый Структура("ДатаСчета,СуммаДокумента,Валюта",Неопределено,Неопределено,Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РасходыПоГрузоперевозке.Ссылка КАК Ссылка,
	               |	CW_РасходыПоГрузоперевозке.ДатаСчета КАК ДатаСчета,
	               |	CW_РасходыПоГрузоперевозке.СуммаДокумента КАК СуммаДокумента,
	               |	CW_РасходыПоГрузоперевозке.Валюта КАК Валюта
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке КАК CW_РасходыПоГрузоперевозке
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозке.Ссылка = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьРеестрПлатежей(Команда)
	ОткрытьФорму("Документ.CW_РеестрПлатежей.ФормаСписка",,,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсе(Команда)
	ОтборВидДвижения = Ложь;
	ОбработатьНажатиеВидаДвижения(2);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПоступления(Команда)
	ОтборВидДвижения = Истина;
	ОбработатьНажатиеВидаДвижения(1);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасходы(Команда)
	ОтборВидДвижения = Истина;
	ОбработатьНажатиеВидаДвижения(0);
КонецПроцедуры

&НаСервере
Процедура ОбработатьНажатиеВидаДвижения(ИндексКнопки)
	
	УстановитьПометкуКнопок(ИндексКнопки);
	УстановитьОтборСписка();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуКнопок(ИндексНажатойКнопки)
	
	ИменаКнопок = "ПоказатьРасход,ПоказатьПоступления,ПоказатьВсе";
	мИменаКнопок = СтрРазделить(ИменаКнопок,",", ложь);
	
	Для Индекс = 0 по 2 Цикл
		ИмяКнопки =  мИменаКнопок.Получить(Индекс);
		Элементы[ИмяКнопки].Пометка = Индекс = ИндексНажатойКнопки;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборПоСтатусам(Команда)
	ДоступныеСтатусы.ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения("ОбработатьОтметкуСтатусов",ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтметкуСтатусов(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ОтборПоСтатусам.Очистить();
		Для каждого Элемент из Результат Цикл
			Если Элемент.Пометка Тогда
				ОтборПоСтатусам.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
		УстановитьОтборСписка();
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьОтборСписка()
	
	Список.Отбор.Элементы.Очистить();
	
	//Отбор по статусам
	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Статус");
	Отбор.ПравоеЗначение	= ОтборПоСтатусам;
	Отбор.Использование		= Отбор.ПравоеЗначение.Количество();
	//Отбор по статусам
	
	Если НЕ ЭтоПолноправныйПользователь Тогда
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СтатьяДДС");
		Отбор.ПравоеЗначение	= ПросмотрСтатейДДС;
	КонецЕсли; 
	
	//Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Сценарий");
	//Отбор.ПравоеЗначение	= Сценарий;
	//Отбор.Использование		= ОтборСценарий;
	//
	//Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Организация");
	//Отбор.ПравоеЗначение	= Организация;
	//Отбор.Использование		= ОтборОрагнизация;
	//
	//Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Подразделение");
	//Отбор.ПравоеЗначение	= Подразделение;
	//Отбор.Использование		= ОтборПодразделение;
	//
	//Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Офис");
	//Отбор.ПравоеЗначение	= Офис;
	//Отбор.Использование		= ОтборОфис;
	//
	//Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Валюта");
	//Отбор.ПравоеЗначение	= Валюта;
	//Отбор.Использование		= ОтборВалюта;
	
	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ВидДвижения");
	
	Если Элементы.ПоказатьПоступления.Пометка Тогда
		Отбор.ПравоеЗначение	= ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Приход");
	ИначеЕсли Элементы.ПоказатьРасход.Пометка Тогда
		Отбор.ПравоеЗначение	= ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход");
	КонецЕсли;
	Отбор.Использование	= ОтборВидДвижения;
	
	
	////Период
	//ГруппаИЛИ = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//ГруппаИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	//
	//Отбор = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеЗаполнено;
	//Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ПланОплаты");
	//Отбор.Использование		= ОтборПериод;
	//
	//ГруппаИ = ГруппаИЛИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	//
	//Отбор = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ВидСравнения		= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	//Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ПланОплаты");
	//Отбор.ПравоеЗначение	= Период.ДатаОкончания;
	//Отбор.Использование		= ОтборПериод;
	//
	//Отбор = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.ВидСравнения		= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	//Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ПланОплаты");
	//Отбор.ПравоеЗначение	= Период.ДатаНачала;
	//Отбор.Использование		= ОтборПериод;
	
КонецПроцедуры



&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Убем и з массива группировки
	Для Каждого ЭлементМассива из ВыделенныеСтроки Цикл
		Если ТипЗнч(ЭлементМассива) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеСтрок = СписокПриАктивизацииСтрокиНаСервере(ВыделенныеСтроки);
	
	ИтогоКоличество = ДанныеСтрок.Количество;
	ИтогоСумма 		= ДанныеСтрок.Сумма;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокПриАктивизацииСтрокиНаСервере(ВыделенныеСтроки)
	
	Результат = новый Структура("Количество,Сумма",0,0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_ПланированиеДДС.Ссылка) КАК Количество,
	               |	СУММА(CW_ПланированиеДДС.Сумма) КАК Сумма
	               |ИЗ
	               |	Справочник.CW_ПланированиеДДС КАК CW_ПланированиеДДС
	               |ГДЕ
	               |	CW_ПланированиеДДС.Ссылка В(&ВыделенныеСтроки)";
	
	Запрос.УстановитьПараметр("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Конецесли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьРазрешенныеСтатусыПланирования()
	
	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.План"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Отклонена"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Согласована"));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СформироватьНазначенияПлатежа(Команда)
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	РезультатВыполнения =  СформироватьНазначениеПлатежаВФоне(МассивСтрок);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗадания", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция СформироватьНазначениеПлатежаВФоне(МассивСсылок)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Заполнение назначения платежа";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("МассивЗаявок", МассивСсылок);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ПланированиеДДС.ЗаполнитьСодежраниеЗаявкоНаРасход",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатЗадания(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		Ответ = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);   
		
		ТекстСообщения = "Сформировано назначение платежа для "+Формат(Ответ.ВсегоОбработано,"ЧГ=0")+" из "+Формат(Ответ.ВсегоПередано,"ЧГ=0")+" заявок на расход";
		
		Элементы.Список.Обновить();
		
		ПоказатьОповещениеПользователя("Формирование назначения платежа",,ТекстСообщения,,СтатусОповещенияПользователя.Информация);
	
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось сформировать назначение платежа!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования назначения платежа");
	КонецЕсли;
	
КонецПроцедуры  

//Групповое редактирование реквизитов
&НаКлиенте
Процедура ГрупповоеРедактированиеРеквизита(Команда)
	
	// если нет выделенных строк
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Для группового изменения реквизтов необходимо выделить строки!",10,"Предупреждение");
		Возврат;
	КонецЕсли;    
	
	РедактируемыеРеквизиты = ПолучитьРедактиуемыеРеквизитыОбъекта();
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("РедактируемыеРеквизиты", РедактируемыеРеквизиты); 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьРедактированиеРеквизитов", ЭтотОбъект, ДополнительныеПараметры);	
	
	ОткрытьФорму("ОбщаяФорма.CW_ГрупповоеИзменениеРеквизитовОбъекта", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения);

КонецПроцедуры   

&НаСервере
Функция ПолучитьРедактиуемыеРеквизитыОбъекта()
	
	Возврат Справочники.CW_ПланированиеДДС.ПолучитьРедактиуемыеРеквизитыОбъекта();
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьРедактированиеРеквизитов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Ссылки", 				ДополнительныеПараметры.ВыделенныеСтроки); 
	ПараметрыПроцедуры.Вставить("ЗначенияРеквизитов",	РезультатВыбора);
	
	РезультатВыполнения =  НачатьИзменениеРеквизитовВФоне(ПараметрыПроцедуры);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьФоновоеРедактированиеРеквизитов", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры    

&НаСервере
Функция НачатьИзменениеРеквизитовВФоне(ПараметрыПроцедуры)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Редактирование реквизитов";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ПланированиеДДС.ВыполнитьИзменениеРеквитовОбъектов", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции 

&НаКлиенте
Процедура ЗавершитьФоновоеРедактированиеРеквизитов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_ПланированиеДДС"));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось изменить реквизты!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка изменения реквизитов");
	КонецЕсли;
	
КонецПроцедуры
//Групповое редактирование реквизитов

// ---------------------------------------------------------------------------- 

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	МассивСсылок = Элементы.Список.ВыделенныеСтроки;
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, МассивСсылок);
	
КонецПроцедуры

#КонецОбласти

