#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//Служебные процедуры
Процедура ВыполнитьКонвертациюРеквизитаРасчетаЦены() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВариантыСверткиТабличныхЧастей.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ВариантыСверткиТабличныхЧастей КАК CW_ВариантыСверткиТабличныхЧастей
	               |ГДЕ
	               |	CW_ВариантыСверткиТабличныхЧастей.УДАЛИТЬРасчитыватьЦенуПослеСвертки = ИСТИНА";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаНоменклатуры из СпрОбъект.НоменклатураСвертки Цикл
			 СтрокаНоменклатуры.РасчитыватьЦенуПослеСвертки = Истина;
		 КонецЦикла;
		 СпрОбъект.Записать();
	КонецЦикла;
	
	
КонецПроцедуры


Процедура ОбновитьИдентификаторыСтрок() Экспорт
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	CW_ВариантыСверткиТабличныхЧастей.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.CW_ВариантыСверткиТабличныхЧастей КАК CW_ВариантыСверткиТабличныхЧастей";
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Выборка = РезультатЗапроса.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 
		 тОбъект = Выборка.Ссылка.ПолучитьОбъект();
		 
		 Для Каждого СтрокаСвертки из тОбъект.НоменклатураСвертки Цикл
			 
			 ИдентификаторСтрокиСвертки = Новый УникальныйИдентификатор;
			 
			 Отбор = Новый Структура("ИдентификаторСтрокиСвертки",СтрокаСвертки.ИдентификаторСтрокиСвертки);
			 
			 мСтроки = тОбъект.ШаблоныДополнительныхКолонок.НайтиСтроки(Отбор);
			 Для Каждого Строка из мСтроки Цикл
				 Строка.ИдентификаторСтрокиСвертки = ИдентификаторСтрокиСвертки; 
			 КонецЦикла;
			 
			 мСтроки = тОбъект.ПараметрыСвертки.НайтиСтроки(Отбор);
			 Для Каждого Строка из мСтроки Цикл
				 Строка.ИдентификаторСтрокиСвертки = ИдентификаторСтрокиСвертки; 
			 КонецЦикла;
			 
			 СтрокаСвертки.ИдентификаторСтрокиСвертки = ИдентификаторСтрокиСвертки;
			 
		 Конеццикла;
		 
		 тОбъект.Записать();
		 
	 КонецЦикла;
	 
	 
 КонецПроцедуры


//Служебные процедуры

#КонецЕсли
