
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Объект.Предопределенный;  
	
	Элементы.ГруппаИдентификаторФункции.Видимость 		= НЕ Объект.Предопределенный;
	Элементы.ГруппаСпособПолученияЗначения.Видимость 	= НЕ Объект.Предопределенный;
	Элементы.ГруппаФункция.Видимость 					= НЕ Объект.Предопределенный;	
	
	Если Параметры.Ключ.Пустая() И Не ПустаяСтрока(Объект.Наименование) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Идентификатор) Тогда  
			Объект.Идентификатор 	= ИдентификаторПоПредставлению();
		КонецЕсли;
	КонецЕсли;  
	
	ЗаполнитьСписокДоступныхПеременных();
	
	ТекстФормулы.УстановитьТекст(Объект.ТекстФормулы);
	
	СпособПолученияЗначенияПриИзмененииНаСервере();     
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокДоступныхПеременных()
	
	СписокДоступныхПеременных.Добавить("Организация",		"Организация");
	СписокДоступныхПеременных.Добавить("Контрагент",		"Контрагент");
	СписокДоступныхПеременных.Добавить("ДоговорКонтрагента","Договор контрагента");
	СписокДоступныхПеременных.Добавить("Документ",			"Документ движения");
	СписокДоступныхПеременных.Добавить("СуммаДоходаВал",	"Сумма дохода/проводки (Вал)");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)   
	
	ТекущийОбъект.ТекстФормулы = ТекстФормулы.ПолучитьТекст();
	
КонецПроцедуры    

&НаКлиенте
Процедура СпособПолученияЗначенияПриИзменении(Элемент)
	
	Объект.ДополнительныйРеквизит 	= Неопределено;
	Объект.Значение 				= Неопределено;    
	ТекстФормулы.Очистить();    
	
	СпособПолученияЗначенияПриИзмененииНаСервере();    
	
КонецПроцедуры

&НаСервере
Процедура СпособПолученияЗначенияПриИзмененииНаСервере()
	
	//Дополнительный реквизит договора(0), Фиксированное значение(2), Формула(3)
	Элементы.ДополнительныйРеквизит.Видимость		= (Объект.СпособПолученияЗначения = 0); 
	Элементы.Значение.Видимость 					= (Объект.СпособПолученияЗначения = 1); 
	Элементы.ГруппаФормула.Видимость 				= (Объект.СпособПолученияЗначения = 2) и Не Объект.Предопределенный;   
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииНаКлиенте();
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьИдентифкатор(Команда)
	
	Объект.Идентификатор 	= ИдентификаторПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзмененииНаКлиенте()
	
	Если НЕ ЗначениеЗаполнено(Объект.Идентификатор) Тогда  
		Объект.Идентификатор 	= ИдентификаторПоПредставлению();
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Функция ИдентификаторПоПредставлению()
	
	Идентификатор = ПолучитьИдентификаторПоТексту(СокрЛП(Объект.Наименование));
	
	ПолучитьУникальныйИдентификатор(Идентификатор, Идентификатор, Объект.Ссылка);

	Возврат СокрЛП(Идентификатор);
	
КонецФункции   

&НаСервере
Функция ПолучитьИдентификаторПоТексту(Знач Представление) Экспорт
	
	СтрокаЦифр 		= "0123456789";
	Идентификатор 	= "";
	БылРазделитель	 = Ложь; 
	
	Для НомСимвола = 1 По СтрДлина(Представление) Цикл
		Символ = Сред(Представление, НомСимвола, 1);
		Если СтрНайти(СтрокаЦифр,Символ) > 0 
			И ПустаяСтрока(Идентификатор) Тогда
			// цифры в начале пропускаем
			Продолжить;
		КонецЕсли;
		Если СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(Символ)) Тогда
			БылРазделитель = Истина;
		Иначе
			Если БылРазделитель Тогда
				БылРазделитель = Ложь;
				Символ = ВРег(Символ);
			КонецЕсли;
			Идентификатор = Идентификатор + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Идентификатор;

КонецФункции

&НаСервере
Процедура ПолучитьУникальныйИдентификатор(Идентификатор, Знач ИсходныйИдентификатор, ТекущаяСсылка)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета КАК CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета
	               |ГДЕ
	               |	CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.Ссылка <> &Ссылка
	               |	И CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.Идентификатор = &Идентификатор";   
	
	Запрос.УстановитьПараметр("Ссылка", 			ТекущаяСсылка);
	Запрос.УстановитьПараметр("Идентификатор", 		Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	
	ТекущийКлюч = СтрЗаменить(Идентификатор,ИсходныйИдентификатор,""); 
	ТекущийКлюч = ?(ПустаяСтрока(ТекущийКлюч), 0, Число(ТекущийКлюч));
	ТекущийКлюч = ТекущийКлюч 	+ 1;  
	
	Идентификатор 	= ИсходныйИдентификатор + Формат(ТекущийКлюч, "ЧГ=0");
	
	ПолучитьУникальныйИдентификатор(Идентификатор, ИсходныйИдентификатор, ТекущаяСсылка);
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаВыбратьФункцию(Команда)   
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборФункции", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.ФормаВыбора", ,ЭтотОбъект,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборФункции(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьВыборФункцииНаСервере(РезультатВыбора);	
	
КонецПроцедуры     

&НаСервере
Процедура ЗавершитьВыборФункцииНаСервере(РезультатВыбора)
	
	ДобавитьПеременную(РезультатВыбора.Идентификатор);
	
КонецПроцедуры     

&НаСервере
Процедура ДобавитьПеременную(ИмяПеременной)
	
	ФормулаТекст = ТекстФормулы.ПолучитьТекст();
	ФормулаТекст = ФормулаТекст + " "+ ИмяПеременной; 
	
	ТекстФормулы.УстановитьТекст(СокрЛП(ФормулаТекст));	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСправка(Команда)
	
	ОткрытьФорму("Справочник.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.Форма.ФормаСправкиПоФункции",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьПеременную(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборПеременной", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, СписокДоступныхПеременных, Элементы.КомандаДобавитьПеременную);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборПеременной(ЭлементСписка, ДополнительныеПарамтеры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьПеременную(ЭлементСписка.Значение);
	
КонецПроцедуры




