#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Очистить();
	Поля.Добавить("Код");
	Поля.Добавить("ОснованиеОплаты");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.ОснованиеОплаты) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.ОснованиеОплаты;	  
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКоличествоЗаявокПоОбъекту(Объект) Экспорт

	Если Объект = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	ИмяОбъекта = Объект.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_ПланированиеДДС.Ссылка) КАК Количество
	               |ИЗ
	               |	Справочник.CW_ПланированиеДДС КАК CW_ПланированиеДДС
	               |ГДЕ
	               |	CW_ПланированиеДДС.ПометкаУдаления = ЛОЖЬ
	               |	И (ВЫРАЗИТЬ(CW_ПланированиеДДС.ДокументОснование КАК Документ."+ИмяОбъекта+")) = &Объект";  
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	Возврат 0; 
	
КонецФункции

Процедура ЗаполнитьСодежраниеЗаявкоНаРасход(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ВсегоОбработано = 0;
	Для Каждого Заявка из ПараметрыПроцедуры.МассивЗаявок Цикл
		
		Если НЕ (Заявка.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход") 
				И ЗначениеЗаполнено(Заявка.ДокументОснование)
				И (ТипЗнч(Заявка.ДокументОснование) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") 
				ИЛИ ТипЗнч(Заявка.ДокументОснование) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"))) Тогда
			
			Продолжить;
		КонецЕсли;
		
		ПараметрыПланирования = РегистрыСведений.CW_ПараметрыПланированияДДС.ПолучитьПараметрыПланирования(Заявка.Организация, Заявка.ДокументОснование.ДатаСчета);
		Если ПараметрыПланирования = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыПланирования.ИспользоватьАвтоматическоеПланирование Тогда
			
			ЗаявкаОбъект = Заявка.ПолучитьОбъект();
			ЗаявкаОбъект.Содержание = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыПланирования.ШаблонЗаполненияСодержания, ЗаявкаОбъект.ДокументОснование, Неопределено, ЗаявкаОбъект.ДокументОснование.Услуги);
			ЗаявкаОбъект.Записать();
			
			ВсегоОбработано = ВсегоОбработано + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ = Новый Структура;
	Ответ.Вставить("ВсегоПередано", 	ПараметрыПроцедуры.МассивЗаявок.Количество());
	Ответ.Вставить("ВсегоОбработано", 	ВсегоОбработано);
	
	ПоместитьВоВременноеХранилище(Ответ, АдресРезультата);
	
КонецПроцедуры           

Функция ПолучитьРедактиуемыеРеквизитыОбъекта() Экспорт
	
	МассивРеквизитов = Новый Массив;
	
	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"Офис");
	ДанныеРеквизита.Вставить("Заголовок", 	"Офис");
	ДанныеРеквизита.Вставить("Значение", 	ПредопределенноеЗначение("Справочник.CW_ОфисыКомпании.ПустаяСсылка"));
	
	МассивРеквизитов.Добавить(ДанныеРеквизита);  
	
	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"СтатьяДДС");
	ДанныеРеквизита.Вставить("Заголовок", 	"Статья ДДС");
	ДанныеРеквизита.Вставить("Значение", 	ПредопределенноеЗначение("Справочник.CW_СтатьиДДС.ПустаяСсылка"));
	
	МассивРеквизитов.Добавить(ДанныеРеквизита);  
	
	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"Подразделение");
	ДанныеРеквизита.Вставить("Заголовок", 	"Подразделение");
	ДанныеРеквизита.Вставить("Значение", 	ПредопределенноеЗначение("Справочник.CW_ПодразделенияКомпании.ПустаяСсылка"));
	
	МассивРеквизитов.Добавить(ДанныеРеквизита);  
	

	// возможность редактирования "План оплаты" только полноправному пользователю и или пользоватею с правом "Финансовый контролер"
	ГруппаПользователя 			= CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь,Истина) или  ГруппаПользователя.ПолныеПрава;
	
	Если ЭтоПолноправныйПользователь ИЛИ ГруппаПользователя.РольФинансовогоКонтролера Тогда
		ДанныеРеквизита = Новый Структура;
		ДанныеРеквизита.Вставить("Имя", 		"СрокОплаты");
		ДанныеРеквизита.Вставить("Заголовок", 	"Срок оплаты");
		ДанныеРеквизита.Вставить("Значение", 	Дата(1,1,1));
		
		МассивРеквизитов.Добавить(ДанныеРеквизита);    
		
		ДанныеРеквизита = Новый Структура;
		ДанныеРеквизита.Вставить("Имя", 		"ПланОплаты");
		ДанныеРеквизита.Вставить("Заголовок", 	"План оплаты");
		ДанныеРеквизита.Вставить("Значение", 	Дата(1,1,1));
		
		МассивРеквизитов.Добавить(ДанныеРеквизита);    
		
	КонецЕсли;
	
	Возврат МассивРеквизитов;

КонецФункции 

Процедура ВыполнитьИзменениеРеквитовОбъектов(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	Для Каждого СправочникСсылка из ПараметрыПроцедуры.Ссылки Цикл
		
		СправочникОбъект =  СправочникСсылка.ПолучитьОбъект();
		
		Для Каждого КлючЗначение из ПараметрыПроцедуры.ЗначенияРеквизитов Цикл
			СправочникОбъект[КлючЗначение.Ключ] = КлючЗначение.Значение;  
			
			// в случае редактирования "План оплаты" заполним или очистим связанные реквизиты
			Если КлючЗначение.Ключ = "ПланОплаты" Тогда  
				Если КлючЗначение.Значение = Дата(1,1,1) Тогда 
					СправочникОбъект.Состояние = 0;
					СправочникОбъект.ДатаПланирования = Дата(1,1,1); 
					СправочникОбъект.Контролер = Справочники.Пользователи.ПустаяСсылка(); 
					Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.План");  
				Иначе
					СправочникОбъект.Состояние = 1;
					СправочникОбъект.ДатаПланирования = ТекущаяДата(); 
					СправочникОбъект.Контролер = ПараметрыСеанса.ТекущийПользователь; 
					Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Согласована");  
				КонецЕсли;
				
				РегистрыСведений.CW_СтатусыПланированиеДДС.ЗаписатьСтатусВРегистр(СправочникСсылка, Статус);
	
			КонецЕсли;	
			
		КонецЦикла;                                                         
		
		СправочникОбъект.Записать();     
		
	
	КонецЦикла;
	
КонецПроцедуры


#КонецЕсли
