#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Новый Структура("Автор,ДатаПланирования,Контролер,ПланОплаты,Состояние,РесстрПлатежей")); 
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	Если НЕ ГруппаПользователя.ПолныеПрава И НЕ CW_ПланированиеДДС.ИспользованиеСтатьиДДС(ГруппаПользователя,ЭтотОбъект.СтатьяДДС) Тогда
		ЭтотОбъект.СтатьяДДС = Неопределено;		
	КонецЕсли; 


КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СоответствиеВидаДвижения = ПолучитьСоответствиеВидаДвиженияТипуДокумента();
	СоответствиеВидаОперации = ПолучитьСоответствиеВидаОперацииТипуДокумента(); 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") 
		или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента - ДанныеЗаполнения.ЗачетАвансовОЗ.Итог("СуммаЗачета");
		
		Дата				= ТекущаяДата();
		Организация			= ДанныеЗаполнения.Организация;
		Контрагент			= ДанныеЗаполнения.Контрагент;
		Договор				= ДанныеЗаполнения.Договор;
		
		ДанныеПланаОплаты   = CW_Документы.ПолучитьПланОплаты(ДанныеЗаполнения);
		ПланОплаты			= ДанныеПланаОплаты.Дата;
		
		ДанныеСрокаОплаты 	= CW_Документы.ПолучитьСрокОплаты(ДанныеЗаполнения);
		СрокОплаты			= ДанныеСрокаОплаты.ДатаОплаты;   
		
		//Для версии КОРП
		ПодразделениеОрганизации	= ДанныеЗаполнения.ПодразделениеОрганизации;
		//Для версии КОРП

		//Подсистема.УчетПриложенийДоговоров	
		ПриложениеКДоговору = ДанныеЗаполнения.ПриложениеКДоговору;
		//Подсистема.УчетПриложенийДоговоров	
		
		//Параметры планирования
		ПараметрыПланирования = РегистрыСведений.CW_ПараметрыПланированияДДС.ПолучитьПараметрыПланирования(ДанныеЗаполнения.Организация,ДанныеЗаполнения.ДатаСчета);
		
		Если ПараметрыПланирования <> Неопределено Тогда 
			Если ДанныеЗаполнения.Услуги.Количество() > 0 Тогда 
				Грузоперевозка = ДанныеЗаполнения.Услуги[0].Грузоперевозка;
				Если ЗначениеЗаполнено(Грузоперевозка) Тогда
					ИмяРеквизитаИнициатор 	= ОбщегоНазначения.ИмяЗначенияПеречисления(ПараметрыПланирования.РасходыИнициаторПоЗаявке);	
					Инициатор				= Грузоперевозка[ИмяРеквизитаИнициатор];
					
					Офис				= CW_ПланированиеДДС.ПолучитьОфис(Инициатор);
					Подразделение		= CW_ПланированиеДДС.ПолучитьПодразделение(ДанныеЗаполнения, Инициатор);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
		Автор				= ДанныеЗаполнения.Ответственный;
		ВидДвижения			= СоответствиеВидаДвижения.Получить(ТипЗнч(ДанныеЗаполнения));
		ДокументОснование	= ДанныеЗаполнения;
		ОснованиеОплаты		= ДанныеЗаполнения.ПредставлениеДокумента;
		
		ВидОперацииПлатежногоПоручения  = СоответствиеВидаОперации.Получить(ТипЗнч(ДанныеЗаполнения));
	
		СуммаНДСДокумента = ДанныеЗаполнения.Услуги.Итог("НДС");
		
		Если ДанныеЗаполнения.Договор.ВзаиморасчетыВУЕ Тогда
			СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(ДанныеЗаполнения.Валюта,ДанныеЗаполнения.ДатаСчета);
			
			Валюта		= Константы.ВалютаРегламентированногоУчета.Получить();
			Сумма		= СуммаДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
			СуммаНДС 	= СуммаНДСДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
		Иначе
			Валюта	 = ДанныеЗаполнения.Валюта;
			Сумма	 = СуммаДокумента;
			СуммаНДС = СуммаНДСДокумента;
		КонецЕсли; 
		
		ТаблицаУслуг = ДанныеЗаполнения.Услуги.Выгрузить();
		ТаблицаУслуг.Свернуть("СтавкаНДС", "НДС"); 
		ТаблицаУслуг.Сортировать("НДС УБЫВ");
		
		Если ТаблицаУслуг.Количество() > 0 Тогда
			СтавкаНДС = ТаблицаУслуг[0].СтавкаНДС;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		
		//Параметры планирования
		ПараметрыПланирования = РегистрыСведений.CW_ПараметрыПланированияДДС.ПолучитьПараметрыПланирования(ДанныеЗаполнения.Организация,ДанныеЗаполнения.ДатаВходящегоДокумента);
		
		//Параметры планирования
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		
		Дата		= ТекущаяДата();
		Организация	= ДанныеЗаполнения.Организация;
		Контрагент	= ДанныеЗаполнения.Контрагент;
		Договор		= ДанныеЗаполнения.ДоговорКонтрагента;
		Инициатор	= ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;

		//Для версии КОРП
		ПодразделениеОрганизации	= ДанныеЗаполнения.ПодразделениеОрганизации;
		//Для версии КОРП
		
		Если ПараметрыПланирования <> Неопределено Тогда 
			Офис				= CW_ПланированиеДДС.ПолучитьОфис(Инициатор);
			Подразделение		= CW_ПланированиеДДС.ПолучитьПодразделение(ДанныеЗаполнения, Инициатор);
		КонецЕсли;
		
		СрокОплаты = СрокиОплатыДокументов.УстановленныйСрокОплаты(ДанныеЗаполнения.Ссылка, ДанныеЗаполнения.Организация);

		Автор				= ДанныеЗаполнения.Ответственный;
		ВидДвижения			= СоответствиеВидаДвижения.Получить(ТипЗнч(ДанныеЗаполнения));
		ДокументОснование	= ДанныеЗаполнения;
		
		ОснованиеОплаты		= "Счет №"+ДанныеЗаполнения.НомерВходящегоДокумента + " от "+Формат(ДанныеЗаполнения.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy");
		
		ВидОперацииПлатежногоПоручения  = СоответствиеВидаОперации.Получить(ТипЗнч(ДанныеЗаполнения));
	
		СуммаНДСДокумента = ДанныеЗаполнения.Товары.Итог("СуммаНДС");
		
		Если Договор.РасчетыВУсловныхЕдиницах Тогда
			СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(ДанныеЗаполнения.ВалютаДокумента,ДанныеЗаполнения.ДатаВходящегоДокумента);
			
			Валюта		= Константы.ВалютаРегламентированногоУчета.Получить();
			Сумма		= СуммаДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
			СуммаНДС 	= СуммаНДСДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
		Иначе
			Валюта	 = ДанныеЗаполнения.ВалютаДокумента;
			Сумма	 = СуммаДокумента;
			СуммаНДС = СуммаНДСДокумента;
		КонецЕсли; 
		
		ТаблицаТовары = ДанныеЗаполнения.Товары.Выгрузить();
		ТаблицаТовары.Свернуть("СтавкаНДС", "СуммаНДС"); 
		ТаблицаТовары.Сортировать("СуммаНДС УБЫВ");
		
		Если ТаблицаТовары.Количество() > 0 Тогда
			СтавкаНДС = ТаблицаТовары[0].СтавкаНДС;	
		КонецЕсли;
	
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		//Параметры планирования
		
		ПараметрыПланирования = РегистрыСведений.CW_ПараметрыПланированияДДС.ПолучитьПараметрыПланирования(ДанныеЗаполнения.Организация,ДанныеЗаполнения.ДатаВходящегоДокумента);
	
		//Параметры планирования
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента - ДанныеЗаполнения.ЗачетАвансов.Итог("СуммаЗачета");
		
		Дата		= ТекущаяДата();
		Организация	= ДанныеЗаполнения.Организация;
		Контрагент	= ДанныеЗаполнения.Контрагент;
		Договор		= ДанныеЗаполнения.ДоговорКонтрагента;
		Инициатор	= ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
		
		//Для версии КОРП
		ПодразделениеОрганизации	= ДанныеЗаполнения.ПодразделениеОрганизации;
		//Для версии КОРП

		Если ПараметрыПланирования <> Неопределено Тогда 
			Офис				= CW_ПланированиеДДС.ПолучитьОфис(Инициатор);
			Подразделение		= CW_ПланированиеДДС.ПолучитьПодразделение(ДанныеЗаполнения, Инициатор);
		КонецЕсли;

		Автор				= ДанныеЗаполнения.Ответственный;
		ВидДвижения			= СоответствиеВидаДвижения.Получить(ТипЗнч(ДанныеЗаполнения));
		ДокументОснование	= ДанныеЗаполнения;
		
		СтруктураСрокОплаты = СрокиОплатыДокументов.СрокОплатыДокументаРасчетов(
								ДанныеЗаполнения.Организация, ДанныеЗаполнения.Ссылка, ДанныеЗаполнения.Дата, ДанныеЗаполнения.ДоговорКонтрагента);

		СрокОплаты			=  СтруктураСрокОплаты.СрокОплаты;
		
		ОснованиеОплаты		= "Акт №"+ДанныеЗаполнения.НомерВходящегоДокумента + " от "+Формат(ДанныеЗаполнения.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy");
		
		ВидОперацииПлатежногоПоручения  = СоответствиеВидаОперации.Получить(ТипЗнч(ДанныеЗаполнения));
		
		СуммаНДСДокумента = ДанныеЗаполнения.Оборудование.Итог("СуммаНДС") 
							+ ДанныеЗаполнения.ОбъектыСтроительства.Итог("СуммаНДС") 
							+ ДанныеЗаполнения.Товары.Итог("СуммаНДС")
							+ ДанныеЗаполнения.Услуги.Итог("СуммаНДС")
							+ ДанныеЗаполнения.АгентскиеУслуги.Итог("СуммаНДС")
							+ ДанныеЗаполнения.ОсновныеСредства.Итог("СуммаНДС")
							+ ДанныеЗаполнения.Топливо.Итог("СуммаНДС");
		
		Если Договор.РасчетыВУсловныхЕдиницах Тогда
			СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(ДанныеЗаполнения.ВалютаДокумента,ДанныеЗаполнения.ДатаВходящегоДокумента);
			
			Валюта		= Константы.ВалютаРегламентированногоУчета.Получить();
			Сумма		= СуммаДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
			СуммаНДС 	= СуммаНДСДокумента * СтруктураКурса.Курс / СтруктураКурса.Кратность;
		Иначе
			Валюта	 = ДанныеЗаполнения.ВалютаДокумента;
			Сумма	 = СуммаДокумента;
			СуммаНДС = СуммаНДСДокумента;
		КонецЕсли;		
		
		ТаблицаСтавок = Новый ТаблицаЗначений;
		ТаблицаСтавок.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
		ТаблицаСтавок.Колонки.Добавить("СуммаНДС",  Новый ОписаниеТипов("Число"));
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.Оборудование.Выгрузить(),			ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.ОбъектыСтроительства.Выгрузить(),	ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.Товары.Выгрузить(),					ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.Услуги.Выгрузить(),					ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.АгентскиеУслуги.Выгрузить(),			ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.ОсновныеСредства.Выгрузить(),		ТаблицаСтавок); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.Топливо.Выгрузить(),					ТаблицаСтавок); 
		
		ТаблицаСтавок.Свернуть("СтавкаНДС", "СуммаНДС"); 
		ТаблицаСтавок.Сортировать("СуммаНДС УБЫВ");
		
		Если ТаблицаСтавок.Количество() > 0 Тогда
			СтавкаНДС = ТаблицаСтавок[0].СтавкаНДС;	
		КонецЕсли;

	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ВидДвижения") Тогда   
		ВидДвижения = ДанныеЗаполнения.ВидДвижения; 	
	КонецЕсли; 
	
	Если ВидДвижения =  Перечисления.CW_ВидыДвиженияДДС.Приход Тогда
		СтатьяДДС = Константы.CW_ОсновнаяСтатьяДДСДляПоступления.Получить();
	КонецЕсли;
	Если ВидДвижения =  Перечисления.CW_ВидыДвиженияДДС.Расход Тогда
		СтатьяДДС = Константы.CW_ОсновнаяСтатьяДДСДляСписания.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	ШаблонПрефикса = "[ОР][ГД]-";
	
	ПрефиксОргаиазции 	= ?(ЗначениеЗаполнено(Организация.Префикс), СокрЛП(Организация.Префикс),"ОО"); 
	ПрефиксГода 		= ?(ЗначениеЗаполнено(Дата), Формат(Дата,"ДФ=гг"),Формат(ТекущаяДата(),"ДФ=гг"));
	
	
	Префикс = СтрЗаменить(ШаблонПрефикса, 	"[ОР]", ПрефиксОргаиазции);
	Префикс = СтрЗаменить(Префикс, 			"[ГД]", ПрефиксГода);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_СтатьиПланированияПоРеестрам.Ссылка КАК Ссылка
		               |ИЗ
		               |	КритерийОтбора.CW_СтатьиПланированияПоРеестрам(&Статья) КАК CW_СтатьиПланированияПоРеестрам";
		Запрос.УстановитьПараметр("Статья", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Отказ = истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заявка включена в реестр. Пометка на удаление невозможна!");
			Возврат;
		КонецЕсли;
		
		ТекущийСтатус = РегистрыСведений.CW_СтатусыПланированиеДДС.ПолучитьСтатусПланированияДДС(Ссылка);
		
		Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.Согласована") Тогда
			Отказ = истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя пометить на удаление заявку в статусе 'Согласована'");
			Возврат;
		КонецЕсли;
		
		Набор = РегистрыСведений.CW_СтатусыПланированиеДДС.СоздатьНаборЗаписей();
		Набор.Отбор.ПланированиеДДС.Установить(Ссылка);
		Набор.Прочитать();
		Набор.Очистить();
		Набор.Записать(Истина);
		
	КонецЕсли;
	
	
	
КонецПроцедуры

Функция  ПолучитьСоответствиеВидаДвиженияТипуДокумента()
	
	Результат = Новый Соответствие;
	Результат.Вставить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")	,  ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход"));
	Результат.Вставить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг")	,  ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход"));
	Результат.Вставить(Тип("ДокументСсылка.СчетНаОплатуПоставщика")		,  ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход"));
	Результат.Вставить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")	,  ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Приход"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеВидаОперацииТипуДокумента()
	
	Результат = Новый Соответствие;
	Результат.Вставить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")	, ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику"));
	Результат.Вставить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг")	, ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику"));
	Результат.Вставить(Тип("ДокументСсылка.СчетНаОплатуПоставщика")		, ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику"));
	Результат.Вставить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")	, Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Приход") Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВидОперацииПлатежногоПоручения");
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли