&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПечати", 		ОбъектПечати); 
	Параметры.Свойство("ШаблонДокумента", 	ШаблонДокумента);   
	
	Заголовок = СокрЛП(ОбъектПечати);
	
	Если НЕ ЗначениеЗаполнено(ОбъектПечати) Тогда
		ВызватьИсключение НСтр("ru = 'Не определен документ, для которого необходимо распечатать текст.'");
	КонецЕсли;      
	Если НЕ ЗначениеЗаполнено(ШаблонДокумента) Тогда
		ВызватьИсключение НСтр("ru = 'Не определен шаблон документа.'");
	КонецЕсли;      
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматированныйДокументПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяФормата", "HTML");          
	
	ОткрытьФорму("ОбщаяФорма.CW_СохранениеДокумента", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры       

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) 
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.CW_СохранениеДокумента") Тогда
		
		Если ВыбранноеЗначение <> Неопределено 
			И ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
			
			ФорматыСохранения = ВыбранноеЗначение.ФорматыСохранения;
			Если ВыбранноеЗначение.ВариантСохранения = "СохранитьВПапку" Тогда
				СохранитьФайлыВКаталог(ВыбранноеЗначение);
			Иначе
				ЗаписатьФайлыНаСервере(ВыбранноеЗначение);
				Оповестить("ОбновитьНаличиеПрикрепленныхФайлов");
				Состояние(НСтр("ru = 'Сохранение успешно завершено.'"));
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры      

&НаСервере
Процедура ЗаписатьФайлыНаСервере(ВыбранноеЗначение)
	
	// подготовка временной папки
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);

	ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СокрЛП(ОбъектПечати));
	
	Для Каждого ФорматФайла Из ВыбранноеЗначение.ФорматыСохранения Цикл
		
		Если ФорматФайла = "RTF" Тогда
			// Подготовим RTF документ на основе форматированного документа
			ИмяФайла = ИмяФайлаБезРасширения+".rtf";
			Расширение 	= ".rtf";
			ПолноеИмяФайла = ПодготовитьRTFНаОсновеФорматированногоДокумента(ИмяВременнойПапки, ИмяФайла);
			
		ИначеЕсли ФорматФайла = "PDF" Тогда
			// Подготовим PDF документ на основе форматированного документа
			ИмяФайла = ИмяФайлаБезРасширения + ".pdf";
			Расширение 	= ".pdf";
			ПолноеИмяФайла = ПодготовитьPDFНаОсновеФорматированногоДокумента(ИмяВременнойПапки, ИмяФайла);
			
		ИначеЕсли ФорматФайла = "HTML" Тогда
			// Подготовим HTML документ на основе форматированного документа
			ИмяФайла 	= ИмяФайлаБезРасширения + ".htm";  
			Расширение 	= ".htm";
			// Подготовим HTML документ на основе форматированного документа
			ПолноеИмяФайла = ПодготовитьHTMLНаОсновеФорматированногоДокумента(ИмяВременнойПапки, ИмяФайла);
			
		КонецЕсли;                          
		
		ОбъектыАрхива = Новый Массив;
		ОбъектыАрхива.Вставить(ОбъектПечати);  
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
		Хранение = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);

		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("Имя",			ИмяФайла);
		ДанныеФайла.Вставить("Расширение",	Расширение);
		ДанныеФайла.Вставить("Хранение",	Хранение);
		
		ПомещенныеФайлы = Новый Массив;
		ПомещенныеФайлы.Добавить(ДанныеФайла);

		CW_РаботаСФайламиСервер.ПрикрепитьФайлы(ПомещенныеФайлы, ОбъектыАрхива, ВыбранноеЗначение.ТипДокумента); 
		
	КонецЦикла;
	
	// Удалим временный файл.
	УдалитьВременныйФайлНаСервер(ИмяВременнойПапки);
	
КонецПроцедуры     

&НаСервере
Функция ПодготовитьHTMLНаОсновеФорматированногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	
	ТекстHTML = "";
	Вложения = Новый Структура();
	
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	
	ТекстовыйДокументHTML = Новый ТекстовыйДокумент;
	ТекстовыйДокументHTML.УстановитьТекст(ТекстHTML);
	// записываем документ во временную папку
	ТекстовыйДокументHTML.Записать(ПолноеИмяФайла, КодировкаТекста.UTF8);
	
	// Подготовим картинки
	ИмяПапкиКартинок = "_files";
	ПутьКПапкеКартинок = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + "_files";
	СоздатьКаталог(ПутьКПапкеКартинок);
	Для Каждого Картинка Из Вложения Цикл
		
		Картинка.Значение.Записать(ПутьКПапкеКартинок+ "\" + Картинка.Ключ + ".jpg");
		
	КонецЦикла;
	
	ВставитьКартинкиВHTML(ПолноеИмяФайла);
	
	УдалитьВременныйФайлНаСервер(ПутьКПапкеКартинок);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции    

&НаСервере
Процедура ВставитьКартинкиВHTML(ИмяФайлаHTML)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	ТекстHTML = ТекстовыйДокумент.ПолучитьТекст();
	
	ФайлHTML = Новый Файл(ИмяФайлаHTML);
	
	ИмяПапкиКартинок = "_files";
	ПутьКПапкеКартинок = СтрЗаменить(ФайлHTML.ПолноеИмя, ФайлHTML.Имя, ИмяПапкиКартинок);
	
	// ожидается, что в папке будут только картинки
	ФайлыКартинок = НайтиФайлы(ПутьКПапкеКартинок, "*");
	
	Для Каждого ФайлКартинки Из ФайлыКартинок Цикл
		КартинкаТекстом = Base64Строка(Новый ДвоичныеДанные(ФайлКартинки.ПолноеИмя));
		КартинкаТекстом = "data:image/" + Сред(ФайлКартинки.Расширение,2) + ";base64," + Символы.ПС + КартинкаТекстом;
		
		ТекстHTML = СтрЗаменить(ТекстHTML, ФайлКартинки.ИмяБезРасширения, КартинкаТекстом);
	КонецЦикла;
		
	ТекстовыйДокумент.УстановитьТекст(ТекстHTML);
	ТекстовыйДокумент.Записать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьRTFНаОсновеФорматированногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	
	ЭлектронноеВзаимодействиеБП.КонвертироватьВФорматRTF(ФорматированныйДокумент, ПолноеИмяФайла);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

&НаСервере
Функция ПодготовитьPDFНаОсновеФорматированногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	
	ТекстHTML = "";
	Вложения = Новый Структура();
	
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	
	// Т.к. PDF является нередактируемым, то чтобы при печати не было избыточных выделений,
	// снимем желтый цвет с параметров шаблона, который раньше сами устанавливали.
	// Форматирование, сделанное пользователем, не меняем.
	// Выполняем это во вспомогательном форматированном документе.
	ВспомогательныйФорматированныйДокумент = Новый ФорматированныйДокумент();
	ВспомогательныйФорматированныйДокумент.УстановитьHTML(ТекстHTML, Вложения);
	
	ЦветФонаПоУмолчанию = ПечатьДоговоровКлиентСервер.ЦветФонаПоУмолчанию();
	
	Для каждого Параграф Из ВспомогательныйФорматированныйДокумент.Элементы Цикл
	
		Для каждого ЭлементДокумента Из Параграф.Элементы Цикл
		
			Если ТипЗнч(ЭлементДокумента) <> Тип("ТекстФорматированногоДокумента") Тогда
				Продолжить;
			КонецЕсли;
			
			//Если ЭлементДокумента.ЦветФона = ЦветФонаЗаменяемогоПараметра Тогда
			//	ЭлементДокумента.ЦветФона = ЦветФонаПоУмолчанию;
			//КонецЕсли;
		
		КонецЦикла;
	
	КонецЦикла;
	
	ВспомогательныйФорматированныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаФорматированногоДокумента.PDF);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

&НаКлиенте
Процедура СохранитьФайлыВКаталог(Знач ВыбранноеЗначение)
	
	МассивДанных = ПоместитьФайлыВоВременноеХранилищеНаСервере(ВыбранноеЗначение.ФорматыСохранения);
	
	#Если ВебКлиент Тогда
		Для Каждого Элемент Из МассивДанных Цикл
			
			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
			ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
			
			НачатьПолучениеФайлаССервера(Элемент.АдресВоВременномХранилище, Элемент.Представление, ПараметрыДиалогаПолученияФайлов);
			
		КонецЦикла;
	#Иначе 
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("КаталогДляСохранения", ВыбранноеЗначение.КаталогДляСохранения);
	
		ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьФайлыВКаталогЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		КаталогДляСохранения = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ВыбранноеЗначение.КаталогДляСохранения);
		
		ПолучаемыеФайлы = Новый Массив;
		Для Каждого Элемент Из МассивДанных Цикл
		
			ПолучаемыйФайл 			= Новый ОписаниеПередаваемогоФайла;
			ПолучаемыйФайл.Имя 		= Элемент.Представление;
			ПолучаемыйФайл.Хранение = Элемент.АдресВоВременномХранилище;
			
			ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
		
		КонецЦикла;
		
		НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, КаталогДляСохранения, Ложь);
		
	#КонецЕсли

КонецПроцедуры

&НаСервере
Функция ПоместитьФайлыВоВременноеХранилищеНаСервере(ФорматыСохранения)
	
	Папка = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(Папка);
	
	// Указываем имя файла вложения
	ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СокрЛП(ОбъектПечати));
	
	МассивДанных = Новый Массив;
	Для Каждого ФорматФайла Из ФорматыСохранения Цикл
		
		Если ФорматФайла = "RTF" Тогда
			ИмяФайла = ИмяФайлаБезРасширения + ".rtf";
			// Подготовим RTF документ на основе форматированного документа
			ПолноеИмяФайла = ПодготовитьRTFНаОсновеФорматированногоДокумента(Папка, ИмяФайла);
		ИначеЕсли ФорматФайла = "PDF" Тогда
			ИмяФайла = ИмяФайлаБезРасширения + ".pdf";
			// Подготовим PDF документ на основе форматированного документа
			ПолноеИмяФайла = ПодготовитьPDFНаОсновеФорматированногоДокумента(Папка, ИмяФайла);
		Иначе
			// Подготовим HTML документ на основе форматированного документа
			ИмяФайла = ИмяФайлаБезРасширения + ".htm";
			// Подготовим HTML документ на основе форматированного документа
			ПолноеИмяФайла = ПодготовитьHTMLНаОсновеФорматированногоДокумента(Папка, ИмяФайла);
		КонецЕсли;
		
		ДвоичныеДанные 				= Новый ДвоичныеДанные(ПолноеИмяФайла);
		ПутьВоВременномХранилище 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтотОбъект.УникальныйИдентификатор);   
		
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("Представление", ИмяФайла);
		ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
		
		МассивДанных.Добавить(ОписаниеФайла);
		
	КонецЦикла;  
	
	УдалитьВременныйФайлНаСервер(Папка);
	
	Возврат МассивДанных;

КонецФункции


&НаКлиенте
Процедура СохранитьФайлыВКаталогЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Если ПолученныеФайлы = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'При сохранении возникла ошибка'"));
	Иначе
		Состояние(НСтр("ru = 'Сохранение успешно завершено'"), , НСтр("ru = 'в папку:'") + " " + ДополнительныеПараметры.КаталогДляСохранения);
	КонецЕсли;

КонецПроцедуры

 &НаСервере
Процедура УдалитьВременныйФайлНаСервер(ИмяФайла)

	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;

	// Удалим временный файл.
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		СведенияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось удалить временный файл по причине: %1'"),
			ПодробноеПредставлениеОшибки(СведенияОбОшибке));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Сохранение текста документа.'", 
			ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ТекстСообщения);
	КонецПопытки;

КонецПроцедуры   

 &НаСервереБезКонтекста
Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения 	= Файл.ИмяБезРасширения;
	Расширение 			= Файл.Расширение;
	Папка 				= Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)     
	
	РезультатВыполнения =  ПродолжитьФормированиеДокументаНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатФормированияДокумента", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьФормированиеДокументаНаСервереВФоне()  
	
	ХранилищеШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонДокумента, "ХранилищеШаблона");  
	Если ТипЗнч(ХранилищеШаблона) = Тип("ХранилищеЗначения") Тогда
		ДанныеШаблона = ХранилищеШаблона.Получить();
	КонецЕсли; 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Формирование документа по шаблону";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ОбъектПечати",		ОбъектПечати);  
	ПараметрыПроцедуры.Вставить("ДанныеШаблона", 	ДанныеШаблона);     

	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ШаблоныДокументовСерверВызовСервера.ЗаполнитьФорматированныйДокументПоШаблону",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатФормированияДокумента(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда     
		
		ОбработатьРезультатФормированияДокументаНаСервере(РезультатВыполнения); 
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Документ не сформирован!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования документа по шаблону");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатФормированияДокументаНаСервере(Знач РезультатВыполнения)
	
	ВремФорматированныйДокумент = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата); 
	
	Вложения 	= Новый Структура;
	ТекстHTML 	= ""; 
	ВремФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	
	ФорматированныйДокумент.УстановитьHTML(ТекстHTML, Вложения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМасштаб(Команда)
	
	ИзменитьМасштабКартинкиHTML();

КонецПроцедуры 

&НаКлиенте
Процедура ИзменитьМасштабКартинкиHTML()
	
	ПозицияНачала  		= 0;
	ПозицияОкончания	= 0;
	
	Элементы.ФорматированныйДокумент.ПолучитьГраницыВыделения(ПозицияНачала,ПозицияОкончания);
	
	Начало 		= ФорматированныйДокумент.ПолучитьПозициюПоЗакладке(ПозицияНачала);
	Окончание 	= ФорматированныйДокумент.ПолучитьПозициюПоЗакладке(ПозицияОкончания);
	
	Если Начало = 0 и Окончание = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыДокумента = ФорматированныйДокумент.ПолучитьЭлементы(ПозицияНачала, ПозицияОкончания);
	Если ЭлементыДокумента.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не удалось получить границы веделения. Попробуете еще раз!");
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементДокумента из ЭлементыДокумента Цикл
		Если ТипЗнч(ЭлементДокумента) = Тип("КартинкаФорматированногоДокумента") тогда     
			
			ДанныеКартинки = ПолучитьИсходныеДанныеКартинки(Начало, Окончание); 
			ДанныеКартинки.Вставить("ЭлементДокумента", ЭлементДокумента);
			
			Оповещение = Новый ОписаниеОповещения("ОбработатьИзменениеМасштаба", ЭтотОбъект, ДанныеКартинки);
			ПоказатьВводЧисла(Оповещение, ДанныеКартинки.Масштаб, "Укажите массштаб картикни",3,0);    
			
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьИсходныеДанныеКартинки(Начало, Окончание)
	
	Структура = новый Структура("Масштаб, Ширина, Высота", 100, 50, 50);
	
	ЗакладкаНачало 		= ФорматированныйДокумент.ПолучитьЗакладкуПоПозиции(Начало);
	ЗакладкаОкончание 	= ФорматированныйДокумент.ПолучитьЗакладкуПоПозиции(Окончание);
	
	ЭлементыДокумента = ФорматированныйДокумент.ПолучитьЭлементы(ЗакладкаНачало, ЗакладкаОкончание);
	Для Каждого ЭлементДокумента из ЭлементыДокумента Цикл
		Если ТипЗнч(ЭлементДокумента) = Тип("КартинкаФорматированногоДокумента") Тогда  
			
			Масштаб = ЭлементДокумента.Ширина / ЭлементДокумента.Картинка.Ширина() * 100; 
			
			Структура.Вставить("Ширина", 	ЭлементДокумента.Картинка.Ширина());
			Структура.Вставить("Высота", 	ЭлементДокумента.Картинка.Высота()); 
			Структура.Вставить("Масштаб",   Масштаб); 
			
		КонецЕсли;		
	КонецЦикла;   
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеМасштаба(Масштаб, ДанныеКартинки) Экспорт
	 
	 Если Масштаб = Неопределено Тогда
		 Возврат;
	 КонецЕсли; 
	 
	 Масштаб = ?(Масштаб=0, 100, Масштаб);
	 
	 ДанныеКартинки.ЭлементДокумента.Ширина = ДанныеКартинки.Ширина / 100 * Масштаб;
	 ДанныеКартинки.ЭлементДокумента.Высота = ДанныеКартинки.Высота / 100 * Масштаб;
	 
 КонецПроцедуры
	




