
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Документ = ПараметрКоманды;
	// --- 
	МассивГруппировок = _ПолучитьГруппировкиПоДокументу(Документ);
	Отбор = _ПолучитьОтборПоДокументу(Документ);
	ПФ = Новый Структура("ВнешнийВызов,Отбор,Группировки", Истина, Отбор, МассивГруппировок);
	ОткрытьФорму("Отчет.CW_НеперевыставленныеЗатраты.Форма.ФормаОтчетаУправляемая", ПФ,,Истина);
	
КонецПроцедуры


&НаСервере
Функция _ПолучитьГруппировкиПоДокументу(Документ)
	// --- 
	
	МассивГруппировок = Новый Массив;
	Если (ТипЗнч(Документ)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
		
		МассивГруппировок.Добавить("Контрагент");
		МассивГруппировок.Добавить("Грузоперевозка");
		МассивГруппировок.Добавить("Номенклатура");
		
	ИначеЕсли (ТипЗнч(Документ)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда 
		
		МассивГруппировок.Добавить("ДокументЗатрат");
		МассивГруппировок.Добавить("Контрагент");
		МассивГруппировок.Добавить("Грузоперевозка");
		МассивГруппировок.Добавить("Номенклатура");
		
	КонецЕсли; 
	
	// --- 
	Возврат(МассивГруппировок);
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ПолучитьОтборПоДокументу(Документ)
	// --- 
	
	Отбор = Новый Структура;
	
	Если (ТипЗнч(Документ)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
		
		Отбор.Вставить("Грузоперевозки",CW_Финансы.ГрузоперевозкиДокумента(Документ));
		Отбор.Вставить("Номенклатура", CW_Финансы.НоменклатураДокумента(Документ));
		Отбор.Вставить("Контрагент",Документ.Контрагент);
		Отбор.Вставить("Договор",Документ.Договор);
		
	ИначеЕсли (ТипЗнч(Документ)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда 
		
		Отбор.Вставить("ДокументЗатрат",Документ);
		Отбор.Вставить("Грузоперевозки",CW_Финансы.ГрузоперевозкиДокумента(Документ));
		Отбор.Вставить("Номенклатура", CW_Финансы.НоменклатураДокумента(Документ));
		
	КонецЕсли;
	// --- 
	Возврат(Отбор);
	
	// --- 
КонецФункции
 