
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// исходная копируемая версия
	БюджетИсходнаяВерсия = Параметры.БюджетИсходнаяВерсия;
	ОбъектСсылка = Параметры.ОбъектСсылка;
	
	масс = CW_Бюджетирование._ПолучитьМассивНЕИспользуемыхВерсийБюджета(ОбъектСсылка);
	Если масс.Найти(БюджетИсходнаяВерсия)<>Неопределено Тогда 
		// по текущей версии не введено статей и она в массиве неиспользуемых
		масс.Удалить(масс.Найти(БюджетИсходнаяВерсия));
	КонецЕсли;
	
	// основа списка выбора
	Элементы.БюджетНоваяВерсия.СписокВыбора.ЗагрузитьЗначения(масс);
	
	Если флРазрешеноСоздаватьНовуюВерсию Тогда 
		// последний элемент списка выбора
		// наименование по умолчанию для создания новой версии
		стрНачало = "" + БюджетИсходнаяВерсия + " - копия";
		сч = 0;
		Пока Сч<100 Цикл
			стр = СокрЛП(стрНачало+" "+Формат(Сч, "ЧГ=0"));
			Если НЕ _СуществуетВерсияБюджетаСНаименованием(стр) Тогда 
				// ок
				Прервать;
			КонецЕсли;
			Сч=Сч+1;
		КонецЦикла;
		Элементы.БюджетНоваяВерсия.СписокВыбора.Добавить(стр, "(создать новую)");
	КонецЕсли;
	
	Если Элементы.БюджетНоваяВерсия.СписокВыбора.Количество()>0 Тогда 
		БюджетНоваяВерсия = Элементы.БюджетНоваяВерсия.СписокВыбора[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеНадписьюИнфо();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеНадписьюИнфо()
	
	Если ТипЗнч(БюджетНоваяВерсия) = Тип("Строка") Тогда
		Элементы.ДекорацияИнфо.Заголовок = "Отредактируйте название новой версии бюджета"
			+?(Элементы.БюджетНоваяВерсия.СписокВыбора.Количество()=1,""," или выберите из списка доступных версий");
	Иначе 
		Элементы.ДекорацияИнфо.Заголовок = "Выберите версию бюджета, в которой будет создана копия текущей версии бюджета";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ТипЗнч(БюджетНоваяВерсия) = Тип("Строка") Тогда 
		// создание новой
		Если НЕ ЗначениеЗаполнено(БюджетНоваяВерсия) Тогда 
			Сообщить("Введите название новой версии!");
			Возврат;
		КонецЕсли;
		
		Если _СуществуетВерсияБюджетаСНаименованием(БюджетНоваяВерсия) Тогда 
			Сообщить("Версия бюджета с наименованием """+БюджетНоваяВерсия+""" уже существует и используется!");
			Возврат;
		КонецЕсли;
		
		БюджетНоваяВерсия = _СоздатьВерсиюБюджета(БюджетНоваяВерсия);
		
		ЗакрытьФорму();
		
	Иначе 
		// ссылка
		Если НЕ ЗначениеЗаполнено(БюджетНоваяВерсия) Тогда 
			Сообщить("Не выбрана новая версия!");
			Возврат;
		КонецЕсли;
		
		Если Неопределено=Элементы.БюджетНоваяВерсия.СписокВыбора.НайтиПоЗначению(БюджетНоваяВерсия) Тогда 
			// выбрали не из предлагаемого списка -- значит, надо будет очистить этот бюджет перед копированием
			Если БюджетНоваяВерсия=БюджетИсходнаяВерсия Тогда 
				Сообщить("Нет смысла копировать версию бюджета саму в себя!");
				Возврат;
			КонецЕсли;
			//
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаПодтверждения",ЭтотОбъект); 
			ПоказатьВопрос(ПОВ,"Данные версии бюджета """+БюджетНоваяВерсия+""" будут заменены на копию """+БюджетИсходнаяВерсия+""" Продолжить?", РежимДиалогаВопрос.ОКОтмена);
			
		Иначе
			
			ЗакрытьФорму();
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаПодтверждения(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.ОК) Тогда
		
		ЗакрытьФорму();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ЗакрытьФорму()
	// --- 
	
	Если ЗначениеЗаполнено(БюджетНоваяВерсия) Тогда 
		Закрыть(БюджетНоваяВерсия);
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _СуществуетВерсияБюджетаСНаименованием(Наименование)
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	//Читаем в привелигированном режиме, так как
	//могут быть весри бюджета из а границе прав доступа
	УстановитьПривилегированныйРежим(истина);
	
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	CW_ВерсииБюджетов.Ссылка
		|ИЗ
		|	Справочник.CW_ВерсииБюджетов КАК CW_ВерсииБюджетов
		|ГДЕ
		|	CW_ВерсииБюджетов.Наименование = &Наименование"
	);
	з.УстановитьПараметр("Наименование", Наименование);
	рз = з.Выполнить();
	
	Возврат НЕ рз.Пустой();
	
КонецФункции

&НаСервере
Функция _СоздатьВерсиюБюджета(Наименование)
	
	об = Справочники.CW_ВерсииБюджетов.СоздатьЭлемент();
	об.Наименование = Наименование;
	об.Записать();
	Возврат об.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура БюджетНоваяВерсияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	сз = Элементы.БюджетНоваяВерсия.СписокВыбора;
	Если флРазрешеноСоздаватьНовуюВерсию Тогда 
		сз[сз.Количество()-1].Значение      = Текст;
		сз[сз.Количество()-1].Представление = Текст+" (создать новую)";
	КонецЕсли;
	ДанныеВыбора = сз;
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетНоваяВерсияПриИзменении(Элемент)
	Если ТипЗнч(БюджетНоваяВерсия) = Тип("Строка") Тогда
		Если _СуществуетВерсияБюджетаСНаименованием(БюджетНоваяВерсия) Тогда 
			Сообщить("Версия бюджета с наименованием """+БюджетНоваяВерсия+""" уже существует!");
		Иначе 
		КонецЕсли;
	Иначе 
		Если Неопределено=Элементы.БюджетНоваяВерсия.СписокВыбора.НайтиПоЗначению(БюджетНоваяВерсия) Тогда 
			// выбрали элемент не из списка
			//  не будем превращать в строку (чтобы можно было подредактировать и использовать как затравку наименования нового)
			//БюджетНоваяВерсия = СокрЛП(БюджетНоваяВерсия);
			//  значит, выбранная версия будет перезаписана
		КонецЕсли;
	КонецЕсли;
	
	УправлениеНадписьюИнфо();
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетНоваяВерсияАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	сз = Элементы.БюджетНоваяВерсия.СписокВыбора;
	Если флРазрешеноСоздаватьНовуюВерсию Тогда 
		сз[сз.Количество()-1].Значение      = Текст;
		сз[сз.Количество()-1].Представление = Текст+" (создать новую)";
	КонецЕсли;
	ДанныеВыбора = сз;
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетНоваяВерсияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура(
		"Заказ, Грузоперевозка, ВыбраннаяВерсия, флРежимВыбораДляКопирования, ВерсияЗапрещененаяКВыбору", 
		ОбъектСсылка, 
		ОбъектСсылка,
		БюджетНоваяВерсия,
		Истина,
		БюджетИсходнаяВерсия
	);
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораНовойВерсии",ЭтотОбъект); 
	ОткрытьФорму("Справочник.CW_ВерсииБюджетов.Форма.ФормаУправленияВерсиями", ПараметрыФормы,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораНовойВерсии(ВыбраннаяВерсия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если ЗначениеЗаполнено(ВыбраннаяВерсия) Тогда 
		БюджетНоваяВерсия = ВыбраннаяВерсия;
	КонецЕсли;	
	
	// --- 
КонецПроцедуры
  
