&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	Если НЕ ЗначениеЗаполнено(НаименованиеФайла) Тогда   
		Сообщить("Поле ""Представление"" не заполнено.");
		Возврат;	
	КонецЕсли;
		
	Ответ = Новый Структура;
	Ответ.Вставить("СсылкаНаФайл", СсылкаНаФайл);
	Ответ.Вставить("НаименованиеФайла", НаименованиеФайла);
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПомещенияФайла",ЭтотОбъект); 
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок  			= "Выберите файл";
	ПараметрыДиалога.Фильтр					= "(*.*)|*.*";
	ПараметрыДиалога.МножественныйВыбор	 	= Истина;  
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения,,,,ПараметрыДиалога, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПомещенияФайла(ПомещенныйФайл, ДополнительныеПараметры) Экспорт 
	
	Если ПомещенныйФайл = Неопределено  Тогда   
		Возврат;
	КонецЕсли;
	
	НаименованиеФайла 	= ПомещенныйФайл.СсылкаНаФайл.Имя;
	СсылкаНаФайл 		= ПомещенныйФайл.СсылкаНаФайл.Файл.ПолноеИмя;
	
КонецПроцедуры
