
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)   
	
	ДополнительныеПарамтеры = Новый Структура;
	ДополнительныеПарамтеры.Вставить("ПараметрКоманды", ПараметрКоманды);
	ДополнительныеПарамтеры.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборЯзыкаОтображения", ЭтотОбъект, ДополнительныеПарамтеры);
	
	СписокЯзыков = Новый СписокЗначений;
	СписокЯзыков.Добавить(ПредопределенноеЗначение("Справочник.CW_Языки.ru"), "RU - Русский язык");
	СписокЯзыков.Добавить(ПредопределенноеЗначение("Справочник.CW_Языки.en"), "EN - Английский язык"); 
	
	Если ДоступенИностранныйЯзык(ПараметрКоманды) Тогда
		СписокЯзыков.ПоказатьВыборЭлемента(Оповещение, "Выберите язык");
	Иначе
		ЭлементСписка = СписокЯзыков.Получить(0);
		ВыполнитьОбработкуОповещения(Оповещение, ЭлементСписка); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДоступенИностранныйЯзык(ПараметрКоманды)
	
	Возврат ПараметрКоманды.ДоступенВыводНаАнглийскомЯзыке;
	
КонецФункции   

&НаКлиенте
Процедура ЗавершитьВыборЯзыкаОтображения(РезультатВыбора, ДополнительныеПарамтеры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполненияКоманды = ДополнительныеПарамтеры.ПараметрыВыполненияКоманды;
	
	Шаблон = ПолучитьСтрукутруШаблонаНаСервере(ДополнительныеПарамтеры.ПараметрКоманды, РезультатВыбора.Значение);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Шаблон", Шаблон);  
	
	ОткрытьФорму("Справочник.CW_ВебШаблоныЗаявок.Форма.ФормаНовойЗаявки", СтруктураПараметров, ПараметрыВыполненияКоманды.Источник);  
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьСтрукутруШаблонаНаСервере(Знач ПараметрКоманды, Знач Язык)
	
	СтруктураШаблона = Справочники.CW_ВебШаблоныЗаявок.ПолучитьСтруктуруШаблонаЗаявки(ПараметрКоманды, Язык);
	
	МакетJSON = "";
	Если ПараметрКоманды.ТипМакетаНовойЗаявки = 1 Тогда 
		XMLМакет 	= ПараметрКоманды.ХранилищеМакета.Получить();
		МакетJSON 	= CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(XMLМакет);
	КонецЕсли;       
	
	СтруктураШаблона.Вставить("mxl", МакетJSON);   
	
	Возврат СтруктураШаблона;
	
КонецФункции