
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.ДатаНачалаВеденияУчета = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЭтотОбъект.Параметры.Ключ.Пустой() 
		и ОперативныйУчетВедется(Запись.Организация, Запись.ВидОперативнойЗадолженности) Тогда
		ПоказатьПредупреждение(,"По организации "+СокрЛП(Запись.Организация)+ ", дата начала ведения оперативного учета по виду задолженности "+СокрЛП(Запись.ВидОперативнойЗадолженности)+" уже уже установлена!");	
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезконтекста
Функция ОперативныйУчетВедется(Знач Организация, Знач ВидЗадолженности)
	
	//По каждой организации, по кажддому виду задолженности можетбыть только одна запись!
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_НачалоВеденияОперативногоУчета.Организация КАК Организация,
	               |	CW_НачалоВеденияОперативногоУчета.ВидОперативнойЗадолженности КАК ВидОперативнойЗадолженности
	               |ИЗ
	               |	РегистрСведений.CW_НачалоВеденияОперативногоУчета КАК CW_НачалоВеденияОперативногоУчета
	               |ГДЕ
	               |	CW_НачалоВеденияОперативногоУчета.Организация = &Организация
	               |	И CW_НачалоВеденияОперативногоУчета.ВидОперативнойЗадолженности = &ВидЗадолженности";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
