#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Инициализация_отчета
// информация об отчете
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОтчет();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешнийОтчет();
	
	СтруктураОписания.Наименование 				= "Анализ прибыли за период (Внешний)";
	СтруктураОписания.Описание 					= "Анализ прибыли за период (Внешний)";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.10.10";
	
	СтруктураОписания.РасполагатьНаРабочемСтоле =  Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "ОткрытьФорму");
	
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыОбъекта(СтруктураОписания, 		"ФормаОтчета");

	CW_ПодключаемыеКомандыСервер.УстановитьКомандыВнешнегоОбъекта(СтруктураОписания,
						"ВнешнийОтчет_CW_АнализПрибылиЗаПериод",
						"Анализ прибыли за период (Внешний)",
						"Отчет",
						Ложь);
	
	Возврат СтруктураОписания;
	
КонецФункции

#КонецОбласти

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;    
	
	// ---
	НастройкиСКД.Структура.Очистить();
	
	ЕстьСписокГрузоперевозокПоПутевымЛистам = Ложь;
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокаСобственногоТранспорта") Тогда
		ЕстьСписокГрузоперевозокПоПутевымЛистам = истина;
	КонецЕсли;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	
	//Параметры вывода
	СтркутураПараметров = Новый Структура;
	СтркутураПараметров.Вставить("Заголовок"					, ВРег(МетаданныеОтчета.Синоним));
	СтркутураПараметров.Вставить("РасположениеРеквизитов"		, ?(Настройки.ОбъединитьГруппировки,РасположениеРеквизитовКомпоновкиДанных.Отдельно			, РасположениеРеквизитовКомпоновкиДанных.ВСпециальнойПозиции));
	СтркутураПараметров.Вставить("РасположениеГруппировки"		, ?(Настройки.ОбъединитьГруппировки,РасположениеГруппировкиКомпоновкиДанных.Конец			, Неопределено));
	СтркутураПараметров.Вставить("РасположениеПолейГруппировки"	, ?(Настройки.ОбъединитьГруппировки,РасположениеПолейГруппировкиКомпоновкиДанных.Отдельно	, Неопределено));
	СтркутураПараметров.Вставить("ТипЗаголовкаПолей"			, ?(Настройки.ОбъединитьГруппировки,ТипЗаголовкаПолейКомпоновкиДанных.Краткий				, Неопределено));
	
	CW_Отчеты.УстановитьПараметрыВыводаКомпоновкиДанных(НастройкиСКД, СтркутураПараметров);
	
	//Параметры данных
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ВариантПериода"			, Настройки.ВариантПериодаОтчета		, НастройкиСКД.ПараметрыДанных);
	
	Если Настройки.ВариантПериодаОтчета = 1 Тогда //По первичным
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоПериода"				, Дата(1,1,1)	, НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецПериода"				, Дата(1,1,1)	, НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоПериодаПоДокументам"	, НачалоДня(Настройки.НачалоПериода), НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецПериодаПоДокументам"	, КонецДня(Настройки.КонецПериода)	, НастройкиСКД.ПараметрыДанных);
	Иначе
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоПериода"				, НачалоДня(Настройки.НачалоПериода), НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецПериода"				, КонецДня(Настройки.КонецПериода)	, НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоПериодаПоДокументам"	, Дата(1,1,1)	, НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецПериодаПоДокументам"	, Дата(1,1,1)	, НастройкиСКД.ПараметрыДанных);
		
	КонецЕсли;	
	
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПериодНачало"				, НачалоДня(Настройки.НачалоПериода), НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПериодКонец"				, КонецДня(Настройки.КонецПериода)	, НастройкиСКД.ПараметрыДанных);
	
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ФормированиеОтчета"				, Настройки.ВариантФормирования				, НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПорядокОтражения"					, Настройки.ПорядокОтражения				, НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПолучитьРасходыПоПутевымЛистам"	, Настройки.ПолучитьРасходыПоПутевымЛистам 	, НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПоАктам"							, Настройки.ВариантФормирования = 0 		, НастройкиСКД.ПараметрыДанных);
	
	Если (Настройки.ИсключатьВнутрихолдинговыеВзаиморасчеты) Тогда
		ЗначениеПараметра = CW_Финансы.ПолучитьКонтрагентовХолдинга();	
	Иначе
		ЗначениеПараметра = Новый Массив;
	КонецЕсли; 
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонтрагентыХолдинга", ЗначениеПараметра, НастройкиСКД.ПараметрыДанных);
	
	//----
	тГрупиировки = Настройки.Группировки;
	
	Если Настройки.ВыводитьДокументыДвижения Тогда
		//Добавим регистратор
		НоваяСтрока = тГрупиировки.Добавить();
		НоваяСтрока.ИмяПоля     	= "Регистратор";
		НоваяСтрока.Представление   = "Регистратор";
		НоваяСтрока.Сортировка  	= Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
	КонецЕсли;
	
	УдаляемыеПоля = новый Массив;
	Для каждого Поле Из НастройкиСКД.Выбор.Элементы Цикл
		Если Не ТипЗнч(Поле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда	
			УдаляемыеПоля.Добавить(Поле);
		КонецЕсли; 
	КонецЦикла;
	
	Для Каждого ПолеИзМассива из УдаляемыеПоля Цикл
		 НастройкиСКД.Выбор.Элементы.Удалить(ПолеИзМассива);
	КонецЦикла;

	Для каждого Поле Из НастройкиСКД.Выбор.Элементы Цикл
		
		Если ТипЗнч(Поле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда	
			
			Для каждого Элемент Из Поле.Элементы Цикл
				
				Если ТипЗнч(Элемент) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда		
					ИмяПоля = Строка(Элемент.Поле);	
					ИмяПоля = СтрЗаменить(Строка(Элемент.Поле),Строка(Поле.Поле)+"."+Строка(Поле.Поле),"");
					Элемент.Использование = Настройки.Показатели.НайтиПоЗначению(ИмяПоля).Пометка;
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Индекс = 0;
	Для каждого Поле Из тГрупиировки Цикл
		
		ПолеВыбора = НастройкиСКД.Выбор.Элементы.Вставить(Индекс, Тип("ВыбранноеПолеКомпоновкиДанных"));
		
		Если ПолеВыбора <> Неопределено Тогда
			ПолеВыбора.Поле		 		= Новый ПолеКомпоновкиДанных(Поле.ИмяПоля);
			ПолеВыбора.Использование 	= Истина;
			Индекс = Индекс + 1;
		КонецЕсли;
		
	КонецЦикла;

	//----
	// формируем структуру отчета по группировкам
	CW_Отчеты.УстановитьГруппировкиОтчетаКомпановкиДанных(НастройкиСКД.Структура, тГрупиировки, Настройки.ОбъединитьГруппировки);
	
	
	// ---------------------------------------------------------------------------- 
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());   
	Если ГруппаПользователя.ФильтрГрузоперевозок 
		ИЛИ ГруппаПользователя.ФильтрЗаказов Тогда
		КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	КонецЕсли;	
	
	Если ГруппаПользователя.ФильтрГрузоперевозок Тогда
		ФильтрГрузоперевозок = ГруппаПользователя.ХранилищеФильтраГрузоперевозок.Получить(); 
		CW_Отчеты.СкопироватьОтбор(ФильтрГрузоперевозок.Отбор, КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Грузоперевозка");
	КонецЕсли;
	
	//Если ГруппаПользователя.ФильтрЗаказов Тогда
	//	ФильтрЗаказов = ГруппаПользователя.ХранилищеФильтраЗаказов.Получить(); 
	//	КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	//	CW_Отчеты.СкопироватьОтбор(ФильтрГрузоперевозок.Отбор, КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Заказ");
	//КонецЕсли;
	
	
КонецПроцедуры

#КонецЕсли