
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для версии КОРП

	ДатаОстатка 				= Параметры.ДатаОстатка;
	ПодразделениеОрганизации 	= Параметры.ПодразделениеОрганизации;
	
	ЗаполнитьОстаткиПоРегистру();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначение(Команда)
	
	ДанныеВыбора = ОбработатьВыбранноеЗначениеНаСервере(Элементы.ТаблицаОстатков.ТекущаяСтрока);
	
	Если ДанныеВыбора.ВыбранКонтрагент Тогда
		ПоказатьПредупреждение(,"Необходимо выборать строку следующего уровня (договор)");
	Иначе
		Закрыть(ДанныеВыбора.АдресХранилища);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОстатковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеВыбора = ОбработатьВыбранноеЗначениеНаСервере(Элементы.ТаблицаОстатков.ТекущаяСтрока);
	
	Если ДанныеВыбора.ВыбранКонтрагент Тогда
		ПоказатьПредупреждение(,"Необходимо выборать строку следующего уровня (договор)");
	Иначе
		Закрыть(ДанныеВыбора.АдресХранилища);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ОбработатьВыбранноеЗначениеНаСервере(ТекущаяСтрока)
	
	СсылкаКонтрагент 	= ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	СсылкаДоговор 		= ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка");
	СсылкаПриложение 	= ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка");
	
	СтрокаТекущая 		= ТаблицаОстатков.НайтиПоИдентификатору(ТекущаяСтрока);  

	Если ТипЗнч(СтрокаТекущая.Значение) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		СтрокаКонтрагент	= СтрокаТекущая.ПолучитьРодителя();
		
		СсылкаКонтрагент 	= СтрокаКонтрагент.Значение;
		СсылкаДоговор 		= СтрокаТекущая.Значение;
	Иначеесли  ТипЗнч(СтрокаТекущая.Значение) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
		СтрокаДоговор		= СтрокаТекущая.ПолучитьРодителя();
		СтрокаКонтрагент	= СтрокаДоговор.ПолучитьРодителя();
		
		СсылкаДоговор 		= СтрокаДоговор.Значение;
		СсылкаКонтрагент 	= СтрокаКонтрагент.Значение;
		СсылкаПриложение 	= СтрокаТекущая.Значение;
	КонецЕсли;
	
	АдресХранилища = "";
	ВыбранКонтрагент = ложь;
	Если СтрокаКонтрагент <> Неопределено Тогда
		
		ДанныеВыбора	= Новый Структура("Контрагент, Договор, ПриложениеКДоговору",СсылкаКонтрагент, СсылкаДоговор, СсылкаПриложение);
		АдресХранилища = ПоместитьВоВременноеХранилище(ДанныеВыбора);
		
	КонецЕсли;
	
	Возврат Новый Структура("ВыбранКонтрагент,АдресХранилища", СтрокаКонтрагент = Неопределено, АдресХранилища);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОстаткиПоРегистру()
	
	
	Запрос = Новый запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ПеревыставлениеОстатки.Контрагент КАК Контрагент,
	               |	CW_ПеревыставлениеОстатки.Договор КАК Договор,
				   //Подсистема.УчетПриложенийДоговоров
				   |	CW_ПеревыставлениеОстатки.ПриложениеКДоговору КАК ПриложениеКДоговору,
				   //Подсистема.УчетПриложенийДоговоров
	               |	CW_ПеревыставлениеОстатки.Договор.ВалютаДоговора КАК ВалютаДоговора,
	               |	CW_ПеревыставлениеОстатки.ВсегоОстаток КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.CW_Перевыставление.Остатки(
	               |			&ДатаОстатка,
	               |			ВЫБОР
	               |				КОГДА &ВестиУчетПоПодразделениям
	               |					ТОГДА ДокументРасходов.ПодразделениеОрганизации = &ПодразделениеОрганизации
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ) КАК CW_ПеревыставлениеОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Контрагент,
	               |	Договор
	               |ИТОГИ
	               |	СУММА(Сумма)
	               |ПО
	               |	Контрагент
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаОстатка"				, ДатаОстатка);
	
	Запрос.УстановитьПараметр("ВестиУчетПоПодразделениям"	, ВестиУчетПоПодразделениям);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации"	, ПодразделениеОрганизации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДеревоЗначений = РеквизитФормыВЗначение("ТаблицаОстатков");
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
		СтрокаКонтрагент = ДеревоЗначений.строки.Добавить();
		СтрокаКонтрагент.Значение 	= ВыборкаКонтрагент.Контрагент;
		СтрокаКонтрагент.Сумма		= ВыборкаКонтрагент.Сумма;
		СтрокаКонтрагент.Уровень	= 0;
		
		ВыборкаДоговор = ВыборкаКонтрагент.Выбрать();
		
		Пока ВыборкаДоговор.Следующий() Цикл
			СтрокаДоговор = СтрокаКонтрагент.Строки.Добавить();
			СтрокаДоговор.Значение 	= ВыборкаДоговор.Договор;
			СтрокаДоговор.Сумма		= ВыборкаДоговор.Сумма;
			СтрокаДоговор.Валюта	= ВыборкаДоговор.ВалютаДоговора;
			СтрокаДоговор.Уровень	= 1;
			
			Если ВыборкаДоговор.Договор.ИспользуютсяПриложения Тогда
				ВыборкаПриложение = ВыборкаДоговор.Выбрать();
				СтрокаПриложение = СтрокаДоговор.Строки.Добавить();
				СтрокаПриложение.Значение 	= ВыборкаДоговор.ПриложениеКДоговору;
				СтрокаПриложение.Сумма		= ВыборкаДоговор.Сумма;
				СтрокаПриложение.Валюта		= ВыборкаДоговор.ВалютаДоговора;
				СтрокаПриложение.Уровень	= 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений,"ТаблицаОстатков");
	
КонецПроцедуры


