#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьТаблицуРасчетовПоПроектуДТ(ПроектДТСсылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектДТСсылка", ПроектДТСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_РасчетыДТ.Ссылка,
	|	CW_РасчетыДТ.Код,
	|	CW_РасчетыДТ.Наименование,
	|	CW_РасчетыДТ.ПроектДТ,
	|	CW_РасчетыДТ.Дата,
	|	CW_РасчетыДТ.Статус,
	|	CW_РасчетыДТ.Таможня,
	|	CW_РасчетыДТ.Курс,
	|	CW_РасчетыДТ.Сумма,
	|	CW_РасчетыДТ.ТаможеннаяСтоимость,
	|	CW_РасчетыДТ.ТаможенныйСборРуб,
	|	CW_РасчетыДТ.БрокерскиеУслугиРуб,
	|	CW_РасчетыДТ.Всего,
	|	CW_РасчетыДТ.ВсегоРуб,
	|	CW_РасчетыДТ.НетарифкаРуб,
	|	CW_РасчетыДТ.Автор,
	|	CW_РасчетыДТ.Комментарий
	|ИЗ
	|	Справочник.CW_РасчетыДТ КАК CW_РасчетыДТ
	|ГДЕ
	|	CW_РасчетыДТ.ПроектДТ = &ПроектДТСсылка
	|	И CW_РасчетыДТ.ПометкаУдаления = ЛОЖЬ";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
