&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	ЗапрещеноУдалениеНаСервере(ВыделенныеСтроки, Отказ);
	Если Отказ Тогда 
		ПоказатьПредупреждение(, "Нарушение прав доступа");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапрещеноУдалениеНаСервере(ВыделенныеСтроки, Отказ)   
	
	Если CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь, Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись из ВыделенныеСтроки Цикл
		Если Запись.ИнициаторСогласования <> ПараметрыСеанса.ТекущийПользователь Тогда
			Отказ = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

