Функция НашиРеквизиты_ПолноеНаименование(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации 	= CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьПолноеНаименованиеОрганизации(ОбъектПечати, СведенияОбОрганизации);        
	
КонецФункции   

Функция НашиРеквизиты_БанковскиеРеквизиты(ОбъектПечати) Экспорт 
	
	БанковскиеРеквизиты = ПолучитьРеквизитыИзПараметровДоговораМодуля(ОбъектПечати, Истина, "РасчетныйСчетОрганизации");
	Если БанковскиеРеквизиты <> Неопределено Тогда
		Возврат БанковскиеРеквизиты; 
	КонецЕсли;
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации  	= CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьБанковскиеРеквизитыОрганизации(ОбъектПечати, СведенияОбОрганизации);
	
КонецФункции

Функция НашиРеквизиты_ИННКПП(ОбъектПечати) Экспорт   

	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат	ПолучитьИННКППОрганизации(ОбъектПечати, СведенияОбОрганизации);
	
КонецФункции 

Функция НашиРеквизиты_ОГРН(ОбъектПечати) Экспорт 

	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьОГРНОрганизации(ОбъектПечати, СведенияОбОрганизации)

КонецФункции  

Функция НашиРеквизиты_НаОсновании(ОбъектПечати) Экспорт 
	
	Если ТипЗнч(ОбъектПечати) = Тип("СправочникСписок.CW_ДоговорыПоГрузоперевозкам") Тогда
		ДатаСведений =  ОбъектПечати.ДатаДоговора;
	КонецЕсли;
	Если ТипЗнч(ОбъектПечати) = Тип("СправочникСписок.CW_ПриложенияКДоговорам") Тогда
		ДатаСведений =  ОбъектПечати.ДатаДокумента;
	КонецЕсли;
	
	СтруктурПараметров = Новый Структура;
	СтруктурПараметров.Вставить("Дата", ДатаСведений);
	СтруктурПараметров.Вставить("Договор", ОбъектПечати);
	
	ПараметрыДоговора = CW_Настройки.ПолучитьПараметрыДоговора(СтруктурПараметров);
	
	Если ПараметрыДоговора.РежимПодписей = 0 Тогда
		ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
		СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
		Возврат ПолучитьОснованиеПолномочийРуководителяОрганизации(ОбъектПечати, СведенияОбОрганизации);
	Иначе  
		Если ПустаяСтрока(ПараметрыДоговора.РуководительОснование) Тогда
			Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 10);
		Иначе
			Возврат СокрЛП(ПараметрыДоговора.РуководительОснование);
		КонецЕсли;
	Конецесли;

КонецФункции 

Функция НашиРеквизиты_СвидетельствоОРегистрации(ОбъектПечати) Экспорт 

	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьСвидетельствоОРегистрацииОрганизации(ОбъектПечати, СведенияОбОрганизации)
	
КонецФункции  

Функция НашиРеквизиты_ПочтовыйАдрес(ОбъектПечати) Экспорт 
	
	Адрес = ПолучитьРеквизитыИзПараметровДоговораМодуля(ОбъектПечати, Истина, "АдресОрганизации");
	Если Адрес <> Неопределено Тогда
		  Возврат Адрес; 
	КонецЕсли;

	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьПочтовыйАдресОрганизации(ОбъектПечати, СведенияОбОрганизации)	
	
КонецФункции  

Функция НашиРеквизиты_ГородПоПочтовомуАдресу(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьГородПоПочтовомуАдресуОрганизации(ОбъектПечати, СведенияОбОрганизации);
	
КонецФункции   

Функция НашиРеквизиты_ФактическийАдрес(ОбъектПечати) Экспорт

	Адрес = ПолучитьРеквизитыИзПараметровДоговораМодуля(ОбъектПечати, Истина, "АдресОрганизации");
	Если Адрес <> Неопределено Тогда
		  Возврат Адрес; 
	КонецЕсли;
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьФактическийАдресОрганизации(ОбъектПечати, СведенияОбОрганизации);
	
КонецФункции 

Функция НашиРеквизиты_ГородПоФактическомуАдресу(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьГородПоФактическомуАдресуОрганизации(ОбъектПечати, СведенияОбОрганизации);
	
КонецФункции 

Функция НашиРеквизиты_ЮридическийАдрес(ОбъектПечати) Экспорт 
	
	Адрес = ПолучитьРеквизитыИзПараметровДоговораМодуля(ОбъектПечати, Истина, "АдресОрганизации");
	Если Адрес <> Неопределено Тогда
		  Возврат Адрес; 
	КонецЕсли;
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьЮридическийАдресОрганизации(ОбъектПечати, СведенияОбОрганизации);
	
КонецФункции 

Функция НашиРеквизиты_ГородПоЮридическомуАдресу(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьГородПоЮридическомуАдресуОрганизации(ОбъектПечати, СведенияОбОрганизации);
	
КонецФункции  

Функция НашиРеквизиты_Телефон(ОбъектПечати) Экспорт 

	ТелефонОрганизации = ПолучитьРеквизитыИзПараметровДоговораМодуля(ОбъектПечати, Истина, "ТелефонОрганизации");
	Если ТелефонОрганизации <> Неопределено Тогда
		  Возврат ТелефонОрганизации; 
	КонецЕсли;
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьТелефонОрганизации(ОбъектПечати, СведенияОбОрганизации);

КонецФункции  

Функция НашиРеквизиты_Факс(ОбъектПечати) Экспорт
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьФаксОрганизации(ОбъектПечати, СведенияОбОрганизации);   
	
КонецФункции   

Функция НашиРеквизиты_ЭлектронныйАдрес(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьЭлектроннуюПочтуОрганизации(ОбъектПечати, СведенияОбОрганизации);   
	
КонецФункции 

Функция НашиРеквизиты_СловоИменуемое(ОбъектПечати) Экспорт 

	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьСловоИменуемоеОрганизации(ОбъектПечати, СведенияОбОрганизации);
	
КонецФункции  

Функция НашиРеквизиты_РуководительПодпись(ОбъектПечати) Экспорт
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "РуководительОрганизации");
	Если СведенияОРуководителе <> Неопределено Тогда
		Возврат ПолучитьПодписьРуководителя(СведенияОРуководителе);
	КонецЕсли; 

	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьПодписьРуководителя(СведенияОбОрганизации.Руководитель);
	
КонецФункции   

Функция НашиРеквизиты_Представитель(ОбъектПечати) Экспорт     
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "РуководительОрганизации");
	Если СведенияОРуководителе = Неопределено Тогда
		ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
		СведенияОРуководителе   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);  
		Пол 					= СведенияОРуководителе.Руководитель.Пол;   
	Иначе
		Пол 					= СведенияОРуководителе.Пол;   
	КонецЕсли; 

	
	Руководитель 			= НашиРеквизиты_Руководитель(ОбъектПечати);
	РуководительРодительный = НашиРеквизиты_РуководительРодительныйПадеж(ОбъектПечати);
		
	Должность 				= НашиРеквизиты_ДолжностьРуководителя(ОбъектПечати);
	ДолжностьРодительный 	= НашиРеквизиты_ДолжностьРуководителяРодительныйПадеж(ОбъектПечати);
	
	Основание 				= ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "РуководительОснование");
	ОснованиеРодительный 	= ПолучитьДолжностьРуководителяКонтрагента(Основание, "РОДИТЕЛЬНЫЙ"); 
	
	СведенияОбОрганизации = Новый Структура;
	СведенияОбОрганизации.Вставить("Руководитель", 	Руководитель);
 	СведенияОбОрганизации.Вставить("Должность", 	Должность);
 	СведенияОбОрганизации.Вставить("Основание", 	Основание); 
	СведенияОбОрганизации.Вставить("Пол", 			Пол);
	
	СведенияОбОрганизации.Вставить("РуководительРодительный", 	РуководительРодительный);
 	СведенияОбОрганизации.Вставить("ДолжностьРодительный", 	 	ДолжностьРодительный);
  	СведенияОбОрганизации.Вставить("ОснованиеРодительный", 	 	ОснованиеРодительный);

	Возврат ПолучитьПредставлителяОрганизации(СведенияОбОрганизации);
	
КонецФункции  

Функция НашиРеквизиты_Руководитель(ОбъектПечати) Экспорт   
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "РуководительОрганизации");
	Если СведенияОРуководителе <> Неопределено Тогда
		Возврат ПолучитьРуководителяОрганизацииМодуля(СведенияОРуководителе);
	КонецЕсли; 

	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьРуководителяОрганизации(СведенияОбОрганизации);
	
КонецФункции     

Функция НашиРеквизиты_РуководительФИО(ОбъектПечати) Экспорт  
	
	мСоставФИО 		= СтрРазделить(НашиРеквизиты_Руководитель(ОбъектПечати), " ");  
	РуководительФИО = мСоставФИО[0];   
	Если мСоставФИО.Количество() > 1 Тогда 
		Для Индекс = 1 по мСоставФИО.ВГраница() Цикл
			РуководительФИО = РуководительФИО + " "+ Лев(мСоставФИО[Индекс],1)+".";	
		КонецЦикла;
	КонецЕсли;   
	
	Возврат РуководительФИО;

КонецФункции  



Функция НашиРеквизиты_ПечатьОрганизации(ОбъектПечати) Экспорт
	
	ПараметрыСведений = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	Возврат ПолучитьПечатьОрганизации(ПараметрыСведений.Организация, ОбъектПечати.ДатаДоговора);
	
КонецФункции 

Функция НашиРеквизиты_РуководительВинительныйПадеж(ОбъектПечати) Экспорт 
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "РуководительОрганизации");
	Если СведенияОРуководителе <> Неопределено Тогда
		Возврат ПолучитьРуководителяОрганизацииМодуля(СведенияОРуководителе, "ВИНИТЕЛЬНЫЙ");
	КонецЕсли; 

	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьРуководителяОрганизации(СведенияОбОрганизации, "ВИНИТЕЛЬНЫЙ");

КонецФункции  

Функция НашиРеквизиты_РуководительДательныйПадеж(ОбъектПечати) Экспорт 
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "РуководительОрганизации");
	Если СведенияОРуководителе <> Неопределено Тогда
		Возврат ПолучитьРуководителяОрганизацииМодуля(СведенияОРуководителе, "ДАТЕЛЬНЫЙ");
	КонецЕсли; 

	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьРуководителяОрганизации(СведенияОбОрганизации, "ДАТЕЛЬНЫЙ");
	
КонецФункции 

Функция НашиРеквизиты_РуководительПредложныйПадеж(ОбъектПечати) Экспорт 
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "РуководительОрганизации");
	Если СведенияОРуководителе <> Неопределено Тогда
		Возврат ПолучитьРуководителяОрганизацииМодуля(СведенияОРуководителе, "ПРЕДЛОЖНЫЙ");
	КонецЕсли; 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьРуководителяОрганизации(СведенияОбОрганизации, "ПРЕДЛОЖНЫЙ");
	
КонецФункции 

Функция НашиРеквизиты_РуководительРодительныйПадеж(ОбъектПечати) Экспорт 
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "РуководительОрганизации");
	Если СведенияОРуководителе <> Неопределено Тогда
		Возврат ПолучитьРуководителяОрганизацииМодуля(СведенияОРуководителе, "РОДИТЕЛЬНЫЙ");
	КонецЕсли; 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьРуководителяОрганизации(СведенияОбОрганизации, "РОДИТЕЛЬНЫЙ");

КонецФункции

Функция НашиРеквизиты_РуководительТворительныйПадеж(ОбъектПечати) Экспорт   
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "РуководительОрганизации");
	Если СведенияОРуководителе <> Неопределено Тогда
		Возврат ПолучитьРуководителяОрганизацииМодуля(СведенияОРуководителе, "ТВОРИТЕЛЬНЫЙ");
	КонецЕсли; 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьРуководителяОрганизации(СведенияОбОрганизации, "ТВОРИТЕЛЬНЫЙ");
	
КонецФункции 


Функция НашиРеквизиты_ДолжностьРуководителя(ОбъектПечати) Экспорт 
	
	ДолжностьРуководителя = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "ДолжностьРуководителяОрганизации");
	Если ДолжностьРуководителя <> Неопределено Тогда
		Возврат ПолучитьДолжностьРуководителяОрганизации(ДолжностьРуководителя);
	КонецЕсли; 

	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьДолжностьРуководителяОрганизации(СведенияОбОрганизации.ДолжностьРуководителяПредставление);
	
КонецФункции   

Функция НашиРеквизиты_ДолжностьРуководителяВинительныйПадеж(ОбъектПечати) Экспорт 

	ДолжностьРуководителя = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "ДолжностьРуководителяОрганизации");
	Если ДолжностьРуководителя <> Неопределено Тогда
		Возврат ПолучитьДолжностьРуководителяОрганизации(ДолжностьРуководителя, "ВИНИТЕЛЬНЫЙ");
	КонецЕсли; 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьДолжностьРуководителяОрганизации(СведенияОбОрганизации.ДолжностьРуководителяПредставление, "ВИНИТЕЛЬНЫЙ"); 
	
КонецФункции   

Функция НашиРеквизиты_ДолжностьРуководителяДательныйПадеж(ОбъектПечати) Экспорт 

	ДолжностьРуководителя = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "ДолжностьРуководителяОрганизации");
	Если ДолжностьРуководителя <> Неопределено Тогда
		Возврат ПолучитьДолжностьРуководителяОрганизации(ДолжностьРуководителя, "ДАТЕЛЬНЫЙ");
	КонецЕсли; 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьДолжностьРуководителяОрганизации(СведенияОбОрганизации.ДолжностьРуководителяПредставление, "ДАТЕЛЬНЫЙ");
	
КонецФункции  

Функция НашиРеквизиты_ДолжностьРуководителяПредложныйПадеж(ОбъектПечати) Экспорт      

	ДолжностьРуководителя = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "ДолжностьРуководителяОрганизации");
	Если ДолжностьРуководителя <> Неопределено Тогда
		Возврат ПолучитьДолжностьРуководителяОрганизации(ДолжностьРуководителя, "ПРЕДЛОЖНЫЙ");
	КонецЕсли; 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьДолжностьРуководителяОрганизации(СведенияОбОрганизации.ДолжностьРуководителяПредставление, "ПРЕДЛОЖНЫЙ");   
	
КонецФункции  

Функция НашиРеквизиты_ДолжностьРуководителяРодительныйПадеж(ОбъектПечати) Экспорт           

	ДолжностьРуководителя = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "ДолжностьРуководителяОрганизации");
	Если ДолжностьРуководителя <> Неопределено Тогда
		Возврат ПолучитьДолжностьРуководителяОрганизации(ДолжностьРуководителя, "РОДИТЕЛЬНЫЙ");
	КонецЕсли; 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьДолжностьРуководителяОрганизации(СведенияОбОрганизации.ДолжностьРуководителяПредставление, "РОДИТЕЛЬНЫЙ");   
	
КонецФункции  

Функция НашиРеквизиты_ДолжностьРуководителяТворительныйПадеж(ОбъектПечати) Экспорт          

	ДолжностьРуководителя = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Истина, "ДолжностьРуководителяОрганизации");
	Если ДолжностьРуководителя <> Неопределено Тогда
		Возврат ПолучитьДолжностьРуководителяОрганизации(ДолжностьРуководителя, "ТВОРИТЕЛЬНЫЙ");
	КонецЕсли; 
	
	ПараметрыСведений 		= ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОбОрганизации   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Организация, ПараметрыСведений.ДатаСреза);   
	Возврат ПолучитьДолжностьРуководителяОрганизации(СведенияОбОрганизации.ДолжностьРуководителяПредставление, "ТВОРИТЕЛЬНЫЙ");   
	
КонецФункции  


Функция РеквизитыКонтрагента_ПолноеНаименование(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьПолноеНаименованиеКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции 

Функция РеквизитыКонтрагента_БанковскиеРеквизиты(ОбъектПечати) Экспорт 
	
	БанковскиеРеквизиты = ПолучитьРеквизитыИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "РасчетныйСчет");
	Если БанковскиеРеквизиты <> Неопределено Тогда
		Возврат БанковскиеРеквизиты; 
	КонецЕсли;

	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьБанковскиеРеквизитыКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции   

Функция РеквизитыКонтрагента_ИННКПП(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьИННКППКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции  

Функция РеквизитыКонтрагента_ОГРН(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьОГРНКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции  

Функция РеквизитыКонтрагента_НаОсновании(ОбъектПечати) Экспорт  
	
	Если ТипЗнч(ОбъектПечати) = Тип("СправочникСписок.CW_ДоговорыПоГрузоперевозкам") Тогда
		 ДатаСведений =  ОбъектПечати.ДатаДоговора;
	КонецЕсли;
	Если ТипЗнч(ОбъектПечати) = Тип("СправочникСписок.CW_ПриложенияКДоговорам") Тогда
		 ДатаСведений =  ОбъектПечати.ДатаДокумента;
	КонецЕсли;
	
	СтруктурПараметров = Новый Структура;
	СтруктурПараметров.Вставить("Дата", ДатаСведений);
	СтруктурПараметров.Вставить("Договор", ОбъектПечати);
	
	ПараметрыДоговора = CW_Настройки.ПолучитьПараметрыДоговора(СтруктурПараметров);
	
	Возврат ПолучитьОснованиеПолномочийРуководителяКонтрагента(ОбъектПечати, ПараметрыДоговора);
	
КонецФункции 

Функция РеквизитыКонтрагента_ДокументУдостоверяющийЛичность(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьДокументУдостоверяющийЛичностьКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции 

Функция РеквизитыКонтрагента_СвидетельствоОРегистрации(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьСвидетельствоОРегистрацииКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции 

Функция РеквизитыКонтрагента_ПочтовыйАдрес(ОбъектПечати) Экспорт 

	Адрес = ПолучитьРеквизитыИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "Адрес");
	Если Адрес <> Неопределено Тогда
		  Возврат Адрес; 
	КонецЕсли;

	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьПочтовыйАдресКонтрагента(ОбъектПечати, СведенияОКонтрагенте);

КонецФункции  

Функция РеквизитыКонтрагента_ГородПоПочтовомуАдресу(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьГородПоПочтовомуАдресуКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции  

Функция РеквизитыКонтрагента_ФактическийАдрес(ОбъектПечати) Экспорт    
	
	Адрес = ПолучитьРеквизитыИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "Адрес");
	Если Адрес <> Неопределено Тогда
		  Возврат Адрес; 
	КонецЕсли;

	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьФактическийАдресКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции  

Функция РеквизитыКонтрагента_ГородПоФактическомуАдресу(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьГородПоФактическомуАдресуКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции  

Функция РеквизитыКонтрагента_ЮридическийАдрес(ОбъектПечати) Экспорт 
	
	Адрес = ПолучитьРеквизитыИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "Адрес");
	Если Адрес <> Неопределено Тогда
		  Возврат Адрес; 
	КонецЕсли;

	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);  
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьЮридическийАдресКонтрагента(ОбъектПечати, СведенияОКонтрагенте); 
	
КонецФункции

Функция РеквизитыКонтрагента_ГородПоЮридическомуАдресу(ОбъектПечати) Экспорт  
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьГородПоЮридическомуАдресуКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции  

Функция РеквизитыКонтрагента_Телефон(ОбъектПечати) Экспорт  

	Телефон = ПолучитьРеквизитыИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "Телефон");
	Если Телефон <> Неопределено Тогда
		  Возврат Телефон; 
	КонецЕсли;
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза);  
	Возврат ПолучитьТелефонКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции   

Функция РеквизитыКонтрагента_Факс(ОбъектПечати) Экспорт
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьФаксКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции 

Функция РеквизитыКонтрагента_ЭлектроннаяПочта(ОбъектПечати) Экспорт 
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьЭлектроннуюПочтуКонтрагента(ОбъектПечати, СведенияОКонтрагенте);  
	
КонецФункции     

Функция РеквизитыКонтрагента_СловоИменуемое(ОбъектПечати) Экспорт   
	
	ПараметрыСведений 	   = ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати);
	СведенияОКонтрагенте   = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(ПараметрыСведений.Контрагент,  ПараметрыСведений.ДатаСреза); 
	Возврат ПолучитьСловоИменуемоеКонтрагента(ОбъектПечати, СведенияОКонтрагенте);
	
КонецФункции  


Функция РеквизитыКонтрагента_Представитель(ОбъектПечати) Экспорт  
	
	СведенияОРуководителе   = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "Руководитель");

	Руководитель 			= РеквизитыКонтрагента_Руководитель(ОбъектПечати);
	РуководительРодительный = РеквизитыКонтрагента_РуководительРодительныйПадеж(ОбъектПечати); 
	
	Должность 	 			= РеквизитыКонтрагента_ДолжностьРуководителя(ОбъектПечати);   
	ДолжностьРодительный 	= РеквизитыКонтрагента_ДолжностьРуководителяРодительныйПадеж(ОбъектПечати);
		  
	СведенияОснование 		= ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "РуководительКонтрагентаОснование"); 
	Основание				= СведенияОснование.РуководительКонтрагентаОснование;
	ОснованиеРодительный 	= ПолучитьДолжностьРуководителяКонтрагента(Основание, "РОДИТЕЛЬНЫЙ"); 
	
	СведенияОКонтрагенте = Новый Структура;
	СведенияОКонтрагенте.Вставить("Руководитель", 	Руководитель);
 	СведенияОКонтрагенте.Вставить("Должность", 		Должность);
 	СведенияОКонтрагенте.Вставить("Основание", 		Основание); 
 	СведенияОКонтрагенте.Вставить("Пол", 			СведенияОРуководителе.ПолРуководителя); 
	
	СведенияОКонтрагенте.Вставить("РуководительРодительный", РуководительРодительный);
 	СведенияОКонтрагенте.Вставить("ДолжностьРодительный", 	 ДолжностьРодительный);
  	СведенияОКонтрагенте.Вставить("ОснованиеРодительный", 	 ОснованиеРодительный);

	Возврат ПолучитьПредставлителяКонтрагента(СведенияОКонтрагенте);
	
КонецФункции 

Функция РеквизитыКонтрагента_Руководитель(ОбъектПечати) Экспорт  

	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "Руководитель");
	Возврат ПолучитьРуководителяКонтрагента(СведенияОРуководителе);  
	
КонецФункции  

Функция РеквизитыКонтрагента_РуководительФИО(ОбъектПечати) Экспорт  
	
	мСоставФИО 		= СтрРазделить(РеквизитыКонтрагента_Руководитель(ОбъектПечати), " ");  
	РуководительФИО = мСоставФИО[0];   
	Если мСоставФИО.Количество() > 1 Тогда 
		Для Индекс = 1 по мСоставФИО.ВГраница() Цикл
			РуководительФИО = РуководительФИО + " "+ Лев(мСоставФИО[Индекс],1)+".";	
		КонецЦикла;
	КонецЕсли;   
	
	Возврат РуководительФИО;

КонецФункции  


Функция РеквизитыКонтрагента_РуководительВинительныйПадеж(ОбъектПечати) Экспорт         
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "Руководитель");
	Возврат ПолучитьРуководителяКонтрагента(СведенияОРуководителе, "ВИНИТЕЛЬНЫЙ");   
	
КонецФункции   

Функция РеквизитыКонтрагента_РуководительДательныйПадеж(ОбъектПечати) Экспорт        
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "Руководитель");
	Возврат ПолучитьРуководителяКонтрагента(СведенияОРуководителе, "ДАТЕЛЬНЫЙ"); 
	
КонецФункции  

Функция РеквизитыКонтрагента_РуководительПредложныйПадеж(ОбъектПечати) Экспорт                  
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "Руководитель");
	Возврат ПолучитьРуководителяКонтрагента(СведенияОРуководителе, "ПРЕДЛОЖНЫЙ");    
	
КонецФункции 

Функция РеквизитыКонтрагента_РуководительРодительныйПадеж(ОбъектПечати) Экспорт               
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "Руководитель");
	Возврат ПолучитьРуководителяКонтрагента(СведенияОРуководителе, "РОДИТЕЛЬНЫЙ");   
	
КонецФункции 

Функция РеквизитыКонтрагента_РуководительТворительныйПадеж(ОбъектПечати) Экспорт         
	
	СведенияОРуководителе = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "Руководитель");
	Возврат ПолучитьРуководителяКонтрагента(СведенияОРуководителе, "ТВОРИТЕЛЬНЫЙ"); 
	
КонецФункции 


Функция РеквизитыКонтрагента_ДолжностьРуководителя(ОбъектПечати) Экспорт  
	
	СведенияОКонтрагенте = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "ДолжностьРуководителя");
	Возврат ПолучитьДолжностьРуководителяКонтрагента(СведенияОКонтрагенте.ДолжностьРуководителя); 
	
КонецФункции 

Функция РеквизитыКонтрагента_ДолжностьРуководителяВинительныйПадеж(ОбъектПечати) Экспорт        
	
	СведенияОКонтрагенте = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "ДолжностьРуководителя");
	Возврат ПолучитьДолжностьРуководителяКонтрагента(СведенияОКонтрагенте.ДолжностьРуководителя, "ВИНИТЕЛЬНЫЙ");   
	
КонецФункции   

Функция РеквизитыКонтрагента_ДолжностьРуководителяДательныйПадеж(ОбъектПечати) Экспорт   
	
	СведенияОКонтрагенте = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "ДолжностьРуководителя");
	Возврат ПолучитьДолжностьРуководителяКонтрагента(СведенияОКонтрагенте.ДолжностьРуководителя, "ДАТЕЛЬНЫЙ"); 
	
КонецФункции  

Функция РеквизитыКонтрагента_ДолжностьРуководителяПредложныйПадеж(ОбъектПечати) Экспорт     
	
	СведенияОКонтрагенте = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "ДолжностьРуководителя");
	Возврат ПолучитьДолжностьРуководителяКонтрагента(СведенияОКонтрагенте.ДолжностьРуководителя, "ПРЕДЛОЖНЫЙ"); 
	
КонецФункции  

Функция РеквизитыКонтрагента_ДолжностьРуководителяРодительныйПадеж(ОбъектПечати) Экспорт   
	
	СведенияОКонтрагенте = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "ДолжностьРуководителя");
	Возврат ПолучитьДолжностьРуководителяКонтрагента(СведенияОКонтрагенте.ДолжностьРуководителя, "РОДИТЕЛЬНЫЙ"); 
	
КонецФункции 

Функция РеквизитыКонтрагента_ДолжностьРуководителяТворительныйПадеж(ОбъектПечати) Экспорт  
	
	СведенияОКонтрагенте = ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, Ложь, "ДолжностьРуководителя");
	Возврат ПолучитьДолжностьРуководителяКонтрагента(СведенияОКонтрагенте.ДолжностьРуководителя, "ТВОРИТЕЛЬНЫЙ");  
	
КонецФункции 


//Реквизиты организации
Функция ПолучитьПолноеНаименованиеОрганизации(Знач ОбъектПечати, Знач СведенияОбОрганизации)
	
	Если СведенияОбОрганизации = Неопределено Тогда 
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.ПолноеНаименование) Тогда
		Результат = СведенияОбОрганизации.ПолноеНаименование;
	ИначеЕсли ЗначениеЗаполнено(СведенияОбОрганизации.СокращенноеНаименование) Тогда
		Результат = СведенияОбОрганизации.СокращенноеНаименование;
	ИначеЕсли ЗначениеЗаполнено(СведенияОбОрганизации.Представление) Тогда
		Результат = СведенияОбОрганизации.Представление;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;   
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьБанковскиеРеквизитыОрганизации(Знач ОбъектПечати, Знач СведенияОбОрганизации)

	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	ПрефиксНомерСчета = НСтр("ru = 'р/с'");
	Если ЗначениеЗаполнено(СведенияОбОрганизации.НомерСчета) Тогда
		НомерСчета = СведенияОбОрганизации.НомерСчета;
		ОбщегоНазначенияБПВызовСервера.ПроверитьЗаменитьБанковскиеПрефиксы(ПрефиксНомерСчета, "НомерСчета", НомерСчета);
		ПрефиксНомерСчета = СокрЛП(ПрефиксНомерСчета);
	Иначе
		НомерСчета = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.Банк) Тогда
		Банк = СведенияОбОрганизации.Банк;
	Иначе
		Банк = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	ПрефиксБИК = НСтр("ru = 'БИК'");
	Если ЗначениеЗаполнено(СведенияОбОрганизации.БИК) Тогда
		БИК = СведенияОбОрганизации.БИК;
		ОбщегоНазначенияБПВызовСервера.ПроверитьЗаменитьБанковскиеПрефиксы(ПрефиксБИК, "БИК", БИК);
		ПрефиксБИК = СокрЛП(ПрефиксБИК);
	Иначе
		БИК = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 9);
	КонецЕсли;
	
	ПрефиксКоррСчет = НСтр("ru = 'к/с'");
	Если ЗначениеЗаполнено(СведенияОбОрганизации.КоррСчет) Тогда
		КоррСчет = СведенияОбОрганизации.КоррСчет;
		ОбщегоНазначенияБПВызовСервера.ПроверитьЗаменитьБанковскиеПрефиксы(ПрефиксКоррСчет, "КоррСчет", КоррСчет);
		ПрефиксКоррСчет = СокрЛП(ПрефиксКоррСчет);
	Иначе
		КоррСчет = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;
	
	// Формируем строку вида "р/с %1 в банке %2, БИК %3, к/с %4"
	Подстроки = Новый Массив;
	Подстроки.Добавить(ПрефиксНомерСчета); 
	Подстроки.Добавить(НомерСчета); 
	Подстроки.Добавить(НСтр("ru = 'в банке'")); 
	Подстроки.Добавить(Банк+","); 
	Подстроки.Добавить(ПрефиксБИК); 
	Подстроки.Добавить(БИК+","); 
	Подстроки.Добавить(ПрефиксКоррСчет); 
	Подстроки.Добавить(КоррСчет);

	Возврат СтрСоединить(Подстроки, " ");

КонецФункции   

Функция ПолучитьИННКППОрганизации(Знач ОбъектПечатиЗнач, Знач СведенияОбОрганизации)

	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 25);
	КонецЕсли;
  
	Если ЗначениеЗаполнено(СведенияОбОрганизации.ИНН) Тогда
		ИНН = СведенияОбОрганизации.ИНН;
	ИначеЕсли СведенияОбОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		ИНН = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 12);
	Иначе
		ИНН = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 10);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.КПП) Тогда
		КПП = СведенияОбОрганизации.КПП;
	ИначеЕсли СведенияОбОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		КПП = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 9);
	КонецЕсли;
	
	Если СведенияОбОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Результат = НСтр("ru = 'ИНН: %1'"); 
		Возврат СтрШаблон(Результат, ИНН);
	Иначе
		Результат = НСтр("ru = 'ИНН / КПП: %1 / %2'");   
		Возврат СтрШаблон(Результат, ИНН, КПП);
	КонецЕсли;

КонецФункции

Функция ПолучитьОГРНОрганизации(Знач ОбъектПечатиЗнач, Знач СведенияОбОрганизации)

	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 25);
	КонецЕсли;

	Если ЗначениеЗаполнено(СведенияОбОрганизации.ОГРН) Тогда
		ОГРН = СведенияОбОрганизации.ОГРН;
	ИначеЕсли СведенияОбОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		// Для физлиц ОГРНИП может отсутствовать, если это не ИП, поэтому если не заполнено, то не показываем ничего.
		Результат = "";
	Иначе
		ОГРН = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 15);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОГРН) Тогда
		
		Если СведенияОбОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			Результат = НСтр("ru = 'ОГРНИП: %1'");
			Возврат СтрШаблон(Результат, ОГРН);
		Иначе
			Результат = НСтр("ru = 'ОГРН: %1'");
			Возврат СтрШаблон(Результат, ОГРН);
		КонецЕсли;
		
	КонецЕсли;

	Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 25);
	
КонецФункции

Функция ПолучитьОснованиеПолномочийРуководителяОрганизации(Знач ОбъектПечати, Знач СведенияОбОрганизации) 
	
	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 10);
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(СведенияОДоговоре.ЗаРуководителяПоПриказу) Тогда
	//	Результат = СведенияОДоговоре.ЗаРуководителяПоПриказу;
	//Иначе
	
	Если СведенияОбОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		Результат = НСтр("ru = 'Устава'");
	ИначеЕсли СведенияОбОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Результат = "";
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 10);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьСвидетельствоОРегистрацииОрганизации(Знач ОбъектПечати, Знач СведенияОбОрганизации)  
	
	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 10);
	КонецЕсли;
	
	Если СведенияОбОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		// Реквизит в справочнике доступен только для ИП
		Результат = "";
	Иначе
		Если ЗначениеЗаполнено(СведенияОбОрганизации.СвидетельствоСерияНомер) Тогда
			СвидетельствоСерияНомер = СведенияОбОрганизации.СвидетельствоСерияНомер;
		Иначе
			СвидетельствоСерияНомер = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 12);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОбОрганизации.СвидетельствоДатаВыдачи) Тогда
			ДатаВыдачиСтрокой = Формат(СведенияОбОрганизации.СвидетельствоДатаВыдачи, "ДЛФ=DD");
		Иначе
			ДатаВыдачиСтрокой = НСтр("ru = '"" __ "" ______________ 20__ г.'");
		КонецЕсли;
		СтрокаШаблон = НСтр("ru = 'Свидетельство о государственной регистрации %1 от %2'");  
		Результат = СтрШаблон(СтрокаШаблон, СвидетельствоСерияНомер, ДатаВыдачиСтрокой);  
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСловоИменуемоеОрганизации(Знач ОбъектПечати, СведенияОбОрганизации)
	
	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 10);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.ИндивидуальныйПредприниматель) Тогда
		ПолФизическогоЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СведенияОбОрганизации.ИндивидуальныйПредприниматель, "Пол");
		Если ПолФизическогоЛица = Перечисления.ПолФизическогоЛица.Мужской Тогда
			ОкончаниеМорфемы = "ый";
		ИначеЕсли ПолФизическогоЛица = Перечисления.ПолФизическогоЛица.Женский Тогда
			ОкончаниеМорфемы = "ая";
		Иначе
			ОкончаниеМорфемы = "ое (-ый, -ая)";
		КонецЕсли;
	ИначеЕсли СведенияОбОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		ОкончаниеМорфемы = "ое";
	Иначе
		ОкончаниеМорфемы = "ое (-ый, -ая)";
	КонецЕсли;
	
	Возврат "именуем" + ОкончаниеМорфемы;
	
КонецФункции
//Реквизиты организации

//Контактная информация
Функция ПолучитьПочтовыйАдресОрганизации(Знач ОбъектПечати, Знач СведенияОбОрганизации)
	
	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.ПочтовыйАдрес) Тогда
		Результат = СведенияОбОрганизации.ПочтовыйАдрес;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьГородПоПочтовомуАдресуОрганизации(Знач ОбъектПечати, Знач СведенияОбОрганизации) 
	
	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	ГородПоПочтовомуАдресу = УправлениеКонтактнойИнформациейБП.НаселенныйПунктПоАдресу(
	СведенияОбОрганизации.ЗначениеJSONПочтовыйАдрес);
	
	Если ЗначениеЗаполнено(ГородПоПочтовомуАдресу) Тогда
		Результат = ГородПоПочтовомуАдресу;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьФактическийАдресОрганизации(Знач ОбъектПечати, Знач СведенияОбОрганизации) 
	
	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.ФактическийАдрес) Тогда
		Результат = СведенияОбОрганизации.ФактическийАдрес;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьГородПоФактическомуАдресуОрганизации(Знач ОбъектПечати, Знач СведенияОбОрганизации) 
	
	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	ГородПоФактическомуАдресу = УправлениеКонтактнойИнформациейБП.НаселенныйПунктПоАдресу(
	СведенияОбОрганизации.ЗначениеJSONФактическийАдрес);
	
	Если ЗначениеЗаполнено(ГородПоФактическомуАдресу) Тогда
		Результат = ГородПоФактическомуАдресу;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЮридическийАдресОрганизации(Знач ОбъектПечати, Знач СведенияОбОрганизации) 
	
	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.ЮридическийАдрес) Тогда
		Результат = СведенияОбОрганизации.ЮридическийАдрес;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьГородПоЮридическомуАдресуОрганизации(Знач ОбъектПечати, Знач СведенияОбОрганизации) 
	
	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	ГородПоЮридическомуАдресу = УправлениеКонтактнойИнформациейБП.НаселенныйПунктПоАдресу(
	СведенияОбОрганизации.ЗначениеJSONЮридическийАдрес);
	
	Если ЗначениеЗаполнено(ГородПоЮридическомуАдресу) Тогда
		Результат = ГородПоЮридическомуАдресу;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТелефонОрганизации(Знач ОбъектПечати, СведенияОбОрганизации)

	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.Телефоны) Тогда
		Результат = СведенияОбОрганизации.Телефоны;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьФаксОрганизации(Знач ОбъектПечати, СведенияОбОрганизации) 

	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.Факс) Тогда
		Результат = СведенияОбОрганизации.Факс;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьЭлектроннуюПочтуОрганизации(Знач ОбъектПечати, СведенияОбОрганизации)
	
	Если СведенияОбОрганизации = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.Email) Тогда
		Результат = СведенияОбОрганизации.Email;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Контактная информация   

//Контактные лица
Функция ПолучитьПредставлителяОрганизации(СведенияОбОрганизации)    
	
	ПорядковыйНомерПола = ПечатьДоговоровКлиентСервер.ПорядковыйНомерПола(СведенияОбОрганизации.Пол);
	ТекстСУчетомПола 	= СклонениеСловаДействующий(ПорядковыйНомерПола, 2); // родительный падеж
	ШаблонТекст 		= НСтр("ru = ', в лице %1 %2, %3 на основании %4'");   
	
	Результат = СтрШаблон(ШаблонТекст, СведенияОбОрганизации.ДолжностьРодительный, СведенияОбОрганизации.РуководительРодительный, ТекстСУчетомПола, СведенияОбОрганизации.ОснованиеРодительный);
	
	Возврат Результат;

КонецФункции
 
Функция ПолучитьРуководителяОрганизации(СведенияОРуководителе, ЗНАЧ ИмяПадежа="")
	
	Если НЕ ЗначениеЗаполнено(СведенияОРуководителе) Тогда  
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	РуководительФИО = 	СведенияОРуководителе.РуководительФИО.Фамилия 	+ " " +
						СведенияОРуководителе.РуководительФИО.Имя 		+ " " + 
						СведенияОРуководителе.РуководительФИО.Отчество;
	
	Падеж 			= CW_ШаблоныДокументовСерверВызовСервера.ПадежПоИмениПараметра(ИмяПадежа);
	РуководительПол = ПечатьДоговоровКлиентСервер.ПорядковыйНомерПола(СведенияОРуководителе.Руководитель.Пол);
	Результат 		= СклонениеПредставленийОбъектов.ПросклонятьФИО(
								РуководительФИО,
								Падеж,
								СведенияОРуководителе.Руководитель,
								РуководительПол);
	
	
	Возврат Результат
	
КонецФункции   

Функция ПолучитьРуководителяОрганизацииМодуля(СведенияОРуководителе, ЗНАЧ ИмяПадежа="")
	
	Если НЕ ЗначениеЗаполнено(СведенияОРуководителе) Тогда  
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	РуководительФИО = 	СведенияОРуководителе.Фамилия 	+ " " +
						СведенияОРуководителе.Имя 		+ " " + 
						СведенияОРуководителе.Отчество;
	
	Падеж 			= CW_ШаблоныДокументовСерверВызовСервера.ПадежПоИмениПараметра(ИмяПадежа);
	РуководительПол = ПечатьДоговоровКлиентСервер.ПорядковыйНомерПола(СведенияОРуководителе.Пол);
	Результат 		= СклонениеПредставленийОбъектов.ПросклонятьФИО(
								РуководительФИО,
								Падеж,
								СведенияОРуководителе,
								РуководительПол);
	
	
	Возврат Результат
	
КонецФункции  

Функция ПолучитьДолжностьРуководителяОрганизации(ДолжностьРуководителя, ЗНАЧ ИмяПадежа="")

	Если ЗначениеЗаполнено(ДолжностьРуководителя) Тогда
		
		Падеж 	= "";
		Если Не ПустаяСтрока(ИмяПадежа) Тогда
			Падеж = "ПД=" + ИмяПадежа;
		КонецЕсли;
		
		РезультатСклонения 	= ПолучитьСклоненияСтроки(ДолжностьРуководителя,, Падеж);
		
		Если РезультатСклонения.Количество() > 0 Тогда
			Возврат РезультатСклонения[0]; 
		Иначе
			Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
		КонецЕсли	

	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);  
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции 

//Реквизиты контрагента
Функция ПолучитьПолноеНаименованиеКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте)   
	
	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.ПолноеНаименование) Тогда
		Результат = СведенияОКонтрагенте.ПолноеНаименование;
	ИначеЕсли ЗначениеЗаполнено(СведенияОКонтрагенте.СокращенноеНаименование) Тогда
		Результат = СведенияОКонтрагенте.СокращенноеНаименование;
	ИначеЕсли ЗначениеЗаполнено(СведенияОКонтрагенте.Представление) Тогда
		Результат = СведенияОКонтрагенте.Представление;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;    
	
	Возврат Результат;
	
КонецФункции  

Функция ПолучитьБанковскиеРеквизитыКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте)   
	
	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;

	ПрефиксНомерСчета = НСтр("ru = 'р/с'");
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.НомерСчета) Тогда
		НомерСчета = СведенияОКонтрагенте.НомерСчета;
		ОбщегоНазначенияБПВызовСервера.ПроверитьЗаменитьБанковскиеПрефиксы(ПрефиксНомерСчета, "НомерСчета", НомерСчета);
		ПрефиксНомерСчета = СокрЛП(ПрефиксНомерСчета);
	Иначе
		НомерСчета = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.Банк) Тогда
		Банк = СведенияОКонтрагенте.Банк;
	Иначе
		Банк = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	ПрефиксБИК = НСтр("ru = 'БИК'");
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.БИК) Тогда
		БИК = СведенияОКонтрагенте.БИК;
		ОбщегоНазначенияБПВызовСервера.ПроверитьЗаменитьБанковскиеПрефиксы(ПрефиксБИК, "БИК", БИК);
		ПрефиксБИК = СокрЛП(ПрефиксБИК);
	Иначе
		БИК = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 9);
	КонецЕсли;
	
	ПрефиксКоррСчет = НСтр("ru = 'к/с'");
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.КоррСчет) Тогда
		КоррСчет = СведенияОКонтрагенте.КоррСчет;
		ОбщегоНазначенияБПВызовСервера.ПроверитьЗаменитьБанковскиеПрефиксы(ПрефиксКоррСчет, "КоррСчет", КоррСчет);
		ПрефиксКоррСчет = СокрЛП(ПрефиксКоррСчет);
	Иначе
		КоррСчет = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;
	
	// Формируем строку вида "р/с %1 в банке %2, БИК %3, к/с %4"
	Подстроки = Новый Массив;
	Подстроки.Добавить(ПрефиксНомерСчета); 
	Подстроки.Добавить(НомерСчета); 
	Подстроки.Добавить(НСтр("ru = 'в банке'")); 
	Подстроки.Добавить(Банк+", "); 
	Подстроки.Добавить(ПрефиксБИК); 
	Подстроки.Добавить(БИК+","); 
	Подстроки.Добавить(ПрефиксКоррСчет); 
	Подстроки.Добавить(КоррСчет);
	
	Возврат СтрСоединить(Подстроки, " ");

КонецФункции

Функция ПолучитьИННКППКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте)   
	
	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 25);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.ИНН) Тогда
		ИНН = СведенияОКонтрагенте.ИНН;
	ИначеЕсли СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		ИНН = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 12);
	Иначе
		ИНН = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 10);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.КПП) Тогда
		КПП = СведенияОКонтрагенте.КПП;
	ИначеЕсли СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		КПП = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 9);
	КонецЕсли;
	
	Если СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Результат = НСтр("ru = 'ИНН: %1'");
		Возврат СтрШаблон(Результат, ИНН);
	Иначе
		Результат = НСтр("ru = 'ИНН / КПП: %1 / %2'");
		Возврат СтрШаблон(Результат, ИНН, КПП);
	КонецЕсли;
	
КонецФункции    

Функция ПолучитьОГРНКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте)   
	
	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 15);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.ОГРН) Тогда
		ОГРН = СведенияОКонтрагенте.ОГРН;
	ИначеЕсли СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		// Для физлиц ОГРНИП может отсутствовать, если это не ИП, поэтому если не заполнено, то не показываем ничего.
		Результат = "";
	Иначе
		ОГРН = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 15);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОГРН) Тогда
		
		Если СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			Результат = НСтр("ru = 'ОГРНИП: %1'");
			Возврат СтрШаблон(Результат, ОГРН);
		Иначе
			Результат = НСтр("ru = 'ОГРН: %1'");
			Возврат СтрШаблон(Результат, ОГРН);
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 15);
	
КонецФункции   

Функция ПолучитьОснованиеПолномочийРуководителяКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте) 

	Если СведенияОКонтрагенте = Неопределено 
		ИЛИ ПустаяСтрока(СведенияОКонтрагенте.РуководительКонтрагентаОснование) Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 10);
	КонецЕсли;   
	
	Результат = СокрЛП(СведенияОКонтрагенте.РуководительКонтрагентаОснование);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДокументУдостоверяющийЛичностьКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте)

	СтрокаШаблон 	= НСтр("ru = 'Паспорт гражданина РФ, серия %1, № %2 выдан: %3, действует до: %4, %5, № подр. %6'");  
	ПустойРезультат	= СтрШаблон(СтрокаШаблон,"____","______","______________ 20__ г.","______________ 20__ г.","_________________________________","_______");
	
	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 10);
	КонецЕсли;
	
	Если СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		// Для юридических лиц параметр не применяется, может присутствовать в шаблоне
		// при использовании единого шаблона для юр.лиц и физ.лиц.
		Результат = "";
	ИначеЕсли ЗначениеЗаполнено(СведенияОКонтрагенте.ДокументУдостоверяющийЛичность) Тогда
		Результат = СведенияОКонтрагенте.ДокументУдостоверяющийЛичность;
	Иначе
		// Вставляем строку без переносов, чтобы сработало автоперенос в форматированном документе.
		Результат = ПустойРезультат;
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСвидетельствоОРегистрацииКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте) 
	
	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 10);
	КонецЕсли;
	
	Если СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		// Реквизит в справочнике доступен только для ИП
		Результат = "";
	ИначеЕсли НЕ ЗначениеЗаполнено(СведенияОКонтрагенте.ОГРН) Тогда
		// Физлицо может быть частным лицом (не ИП), в таком случае реквизиты свидетельства не выводим
		Результат = "";
	Иначе
		Если ЗначениеЗаполнено(СведенияОКонтрагенте.СвидетельствоСерияНомер) Тогда
			СвидетельствоСерияНомер = СведенияОКонтрагенте.СвидетельствоСерияНомер;
		Иначе
			СвидетельствоСерияНомер = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 12);
			Успешно = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОКонтрагенте.СвидетельствоДатаВыдачи) Тогда
			ДатаВыдачиСтрокой = Формат(СведенияОКонтрагенте.СвидетельствоДатаВыдачи, "ДЛФ=DD");
		Иначе
			ДатаВыдачиСтрокой = НСтр("ru = '"" __ "" ______________ 20__ г.'");
			Успешно = Ложь;
		КонецЕсли;
		СтрокаШаблон = НСтр("ru = 'Свидетельство о государственной регистрации %1 от %2'");
		Результат = СтрШаблон(СтрокаШаблон, СвидетельствоСерияНомер, ДатаВыдачиСтрокой);  
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСловоИменуемоеКонтрагента(Знач ОбъектПечати, СведенияОКонтрагенте)
	
	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 10);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.ИндивидуальныйПредприниматель) Тогда
		ПолФизическогоЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СведенияОКонтрагенте.ИндивидуальныйПредприниматель, "Пол");
		Если ПолФизическогоЛица = Перечисления.ПолФизическогоЛица.Мужской Тогда
			ОкончаниеМорфемы = "ый";
		ИначеЕсли ПолФизическогоЛица = Перечисления.ПолФизическогоЛица.Женский Тогда
			ОкончаниеМорфемы = "ай";
		Иначе
			ОкончаниеМорфемы = "ое (-ый, -ая)";
		КонецЕсли;
	ИначеЕсли СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		ПолФизическогоЛица = СотрудникиКлиентСервер.ОпределитьПолПоОтчеству(СокрП(СведенияОКонтрагенте.ПолноеНаименование));
		Если ПолФизическогоЛица = Перечисления.ПолФизическогоЛица.Мужской Тогда
			ОкончаниеМорфемы = "ый";
		ИначеЕсли ПолФизическогоЛица = Перечисления.ПолФизическогоЛица.Женский Тогда
			ОкончаниеМорфемы = "ая";
		Иначе
			ОкончаниеМорфемы = "ое (-ый, -ая)";
		КонецЕсли;
	ИначеЕсли СведенияОКонтрагенте.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		ОкончаниеМорфемы = "ое";
	Иначе
		ОкончаниеМорфемы = "ое (-ый, -ая)";
	КонецЕсли;
	
	Возврат "именуем" + ОкончаниеМорфемы;
	
КонецФункции  
//Реквизиты контрагента

//Контактная информация
Функция ПолучитьПочтовыйАдресКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте)  

	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.ПочтовыйАдрес) Тогда
		Результат = СведенияОКонтрагенте.ПочтовыйАдрес;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьГородПоПочтовомуАдресуКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте)  

	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	ГородПоПочтовомуАдресу = УправлениеКонтактнойИнформациейБП.НаселенныйПунктПоАдресу(
	СведенияОКонтрагенте.ЗначениеJSONПочтовыйАдрес);
	
	Если ЗначениеЗаполнено(ГородПоПочтовомуАдресу) Тогда
		Результат = ГородПоПочтовомуАдресу;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьФактическийАдресКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте) 

	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.ФактическийАдрес) Тогда
		Результат = СведенияОКонтрагенте.ФактическийАдрес;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьГородПоФактическомуАдресуКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте) 

	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	ГородПоФактическомуАдресу = УправлениеКонтактнойИнформациейБП.НаселенныйПунктПоАдресу(
	СведенияОКонтрагенте.ЗначениеJSONФактическийАдрес);
	
	Если ЗначениеЗаполнено(ГородПоФактическомуАдресу) Тогда
		Результат = ГородПоФактическомуАдресу;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЮридическийАдресКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте) 

	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.ЮридическийАдрес) Тогда
		Результат = СведенияОКонтрагенте.ЮридическийАдрес;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 50);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьГородПоЮридическомуАдресуКонтрагента(Знач ОбъектПечати, Знач СведенияОКонтрагенте) 

	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	ГородПоЮридическомуАдресу = УправлениеКонтактнойИнформациейБП.НаселенныйПунктПоАдресу(
	СведенияОКонтрагенте.ЗначениеJSONЮридическийАдрес);
	
	Если ЗначениеЗаполнено(ГородПоЮридическомуАдресу) Тогда
		Результат = ГородПоЮридическомуАдресу;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТелефонКонтрагента(Знач ОбъектПечати, СведенияОКонтрагенте)  

	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.Телефоны) Тогда
		Результат = СведенияОКонтрагенте.Телефоны;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ПолучитьФаксКонтрагента(Знач ОбъектПечати, СведенияОКонтрагенте)

	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.Факс) Тогда
		Результат = СведенияОКонтрагенте.Факс;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции     

Функция ПолучитьЭлектроннуюПочтуКонтрагента(Знач ОбъектПечати, СведенияОКонтрагенте)
	
	Если СведенияОКонтрагенте = Неопределено Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СведенияОКонтрагенте.Email) Тогда
		Результат = СведенияОКонтрагенте.Email;
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 20);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Контактная информация                         

//Контактные лица
Функция ПолучитьПредставлителяКонтрагента(СведенияОКонтрагенте)
	
	ПорядковыйНомерПола = ПечатьДоговоровКлиентСервер.ПорядковыйНомерПола(СведенияОКонтрагенте.Пол);
	ТекстСУчетомПола 	= СклонениеСловаДействующий(ПорядковыйНомерПола, 2); // родительный падеж
	ШаблонТекст 		= НСтр("ru = ', в лице %1 %2, %3 на основании %4'");   
	
	Результат = СтрШаблон(ШаблонТекст, СведенияОКонтрагенте.ДолжностьРодительный, СведенияОКонтрагенте.РуководительРодительный,ТекстСУчетомПола, СведенияОКонтрагенте.ОснованиеРодительный);
	
	Возврат Результат;

КонецФункции
 
Функция ПолучитьРуководителяКонтрагента(Знач СведенияОКонтрагенте, Знач ИмяПадежа="")
	
	Если Не ЗначениеЗаполнено(СведенияОКонтрагенте) Тогда
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	ИмяПола	= XMLСтрока(СведенияОКонтрагенте.ПолРуководителя);		
	Падеж 	= "";
	Если Не ПустаяСтрока(ИмяПадежа) Тогда
		Падеж = "ПД=" + ИмяПадежа;
	КонецЕсли;
	
	РезультатСклонения 	= ПолучитьСклоненияСтроки(СведенияОКонтрагенте.Руководитель, "ПЛ="+ИмяПола, Падеж);
	
	Если РезультатСклонения.Количество() > 0 Тогда
		Возврат РезультатСклонения[0]; 
	Иначе
		Возврат СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
																		
КонецФункции

Функция ПолучитьДолжностьРуководителяКонтрагента(Знач СклоняемаяСтрока, Знач ИмяПадежа="")
	
	Если ЗначениеЗаполнено(СклоняемаяСтрока) Тогда
		
		Падеж 	= "";
		Если Не ПустаяСтрока(ИмяПадежа) Тогда
			Падеж = "ПД=" + ИмяПадежа;
		КонецЕсли; 
		
		РезультатСклонения 	= ПолучитьСклоненияСтроки(СклоняемаяСтрока, , Падеж);
		
		Если РезультатСклонения.Количество() > 0 Тогда
			Результат = РезультатСклонения[0]; 
		Иначе
			Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
		КонецЕсли;
		
	Иначе
		Результат = СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", 30);
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции 

Функция ПолучитьЗначениеОтсутствует()
	Возврат "{Неизвестный параметр договора!}";
КонецФункции

// Возвращает слово "действующий" с правильным окончанием, учитывающим пол и падеж.
//
Функция СклонениеСловаДействующий(Пол, Падеж)
	
	Если Не ЗначениеЗаполнено(Пол) Тогда
		Если Падеж = 2 Тогда
			ТекстСУчетомПола = НСтр("ru = 'действующего (-ей)'");
		ИначеЕсли Падеж = 3 Тогда
			ТекстСУчетомПола = НСтр("ru = 'действующему (-ей)'");
		ИначеЕсли Падеж = 4 Тогда
			ТекстСУчетомПола = НСтр("ru = 'действующего (-ую)'");
		ИначеЕсли Падеж = 5 Тогда
			ТекстСУчетомПола = НСтр("ru = 'действующим (-ей)'");
		ИначеЕсли Падеж = 6 Тогда
			ТекстСУчетомПола = НСтр("ru = 'действующем (-ей)'");
		Иначе
			ТекстСУчетомПола = НСтр("ru = 'действующий (-ая)'");
		КонецЕсли;
	Иначе
		Если Падеж = 2 Тогда
			ТекстСУчетомПола = ?(Пол = 2, НСтр("ru = 'действующей'"), НСтр("ru = 'действующего'"));
		ИначеЕсли Падеж = 3 Тогда
			ТекстСУчетомПола = ?(Пол = 2, НСтр("ru = 'действующей'"), НСтр("ru = 'действующему'"));
		ИначеЕсли Падеж = 4 Тогда
			ТекстСУчетомПола = ?(Пол = 2, НСтр("ru = 'действующую'"), НСтр("ru = 'действующего'"));
		ИначеЕсли Падеж = 5 Тогда
			ТекстСУчетомПола = ?(Пол = 2, НСтр("ru = 'действующей'"), НСтр("ru = 'действующим'"));
		ИначеЕсли Падеж = 6 Тогда
			ТекстСУчетомПола = ?(Пол = 2, НСтр("ru = 'действующей'"), НСтр("ru = 'действующем'"));
		Иначе
			ТекстСУчетомПола = ?(Пол = 2, НСтр("ru = 'действующая'"), НСтр("ru = 'действующий'"));
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстСУчетомПола;
	
КонецФункции


Функция ПолучитьПараметрыПолученияСведенийОбОрганизацииКонтрагенте(ОбъектПечати)
	
	Структура = Новый Структура("ДатаСреза, Организация");
	
	Если ТипЗнч(ОбъектПечати) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда 
		Структура.Вставить("ДатаСреза",  	ОбъектПечати.ДатаДоговора);  
		Структура.Вставить("Организация",  	ОбъектПечати.Организация);  
		Структура.Вставить("Контрагент",  	ОбъектПечати.Владелец);  
	ИначеЕсли ТипЗнч(ОбъектПечати) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда 
		Структура.Вставить("ДатаСреза",  	ОбъектПечати.ДатаДокумента);  
		Структура.Вставить("Организация",  	ОбъектПечати.Договор.Организация);  
		Структура.Вставить("Контрагент",  	ОбъектПечати.Договор.Владелец);  
	Иначе    
		Возврат Неопределено;  
	КонецЕсли;              
	
	Возврат Структура;
	
КонецФункции  


Функция ПолучитьРеквизитыИзПараметровДоговораМодуля(ОбъектПечати, НашаОрганизация, ИмяРеквизита)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыДоговоровСрезПоследних.Договор КАК Договор,
	               |	CW_ПараметрыДоговоровСрезПоследних."+ИмяРеквизита+" КАК "+ИмяРеквизита+",
	               |	CW_ПараметрыДоговоровСрезПоследних.ИзКарточкиОрганизации КАК ИзКарточкиОрганизации,
	               |	CW_ПараметрыДоговоровСрезПоследних.РеквизитыИзКарточкиКонтрагента КАК РеквизитыИзКарточкиКонтрагента
	               |ИЗ
	               |	РегистрСведений.CW_ПараметрыДоговоров.СрезПоследних(&ДатаСреза, Договор = &ОбъектПечати) КАК CW_ПараметрыДоговоровСрезПоследних"; 
	
	Запрос.УстановитьПараметр("ДатаСреза", 		ТекущаяДата());
	Запрос.УстановитьПараметр("ОбъектПечати", 	ОбъектПечати);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		Если НашаОрганизация И Выборка.ИзКарточкиОрганизации Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если НЕ НашаОрганизация И Выборка.РеквизитыИзКарточкиКонтрагента Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат Выборка[ИмяРеквизита];   
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ПолучитьОтветственныхЛицИзПараметровДоговораМодуля(ОбъектПечати, НашаОрганизация, ИмяРеквизита)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыДоговоровСрезПоследних.Договор КАК Договор,
	               |	CW_ПараметрыДоговоровСрезПоследних."+ИмяРеквизита+" КАК "+ИмяРеквизита+",
	               |	CW_ПараметрыДоговоровСрезПоследних.РежимПодписей КАК РежимПодписей,
	               |	CW_ПараметрыДоговоровСрезПоследних.РуководительПол КАК РуководительПол,
	               |	CW_ПараметрыДоговоровСрезПоследних.ВариантПодписей КАК ВариантПодписей
	               |ИЗ
	               |	РегистрСведений.CW_ПараметрыДоговоров.СрезПоследних(&ДатаСреза, Договор = &ОбъектПечати) КАК CW_ПараметрыДоговоровСрезПоследних"; 

	
	Запрос.УстановитьПараметр("ДатаСреза",    ТекущаяДата());
	Запрос.УстановитьПараметр("ОбъектПечати", ОбъектПечати);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();               
	Если Выборка.Следующий() Тогда 
		Если НЕ НашаОрганизация Тогда 
			СведенияОРуководителе = Новый Структура;
			СведенияОРуководителе.Вставить(ИмяРеквизита, 		Выборка[ИмяРеквизита]);
			СведенияОРуководителе.Вставить("ПолРуководителя", 	Выборка.РуководительПол);
			
			Возврат СведенияОРуководителе;   
		КонецЕсли;
		
		Если  НашаОрганизация Тогда
			Если Выборка.РежимПодписей = 0 Тогда 
				Возврат Неопределено;
			КонецЕсли;
			
			Если Выборка.РежимПодписей = 1 Тогда 
				Возврат Выборка[ИмяРеквизита];   
			КонецЕсли;
			
			Если Выборка.РежимПодписей = 2 Тогда  
				Если ТипЗнч(ОбъектПечати) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
					Организация = Выборка.Договор.Организация;
				КонецЕсли;
				Если ТипЗнч(ОбъектПечати) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
					Организация = Выборка.Договор.Договор.Организация;
				КонецЕсли;
				Если Организация <> Неопределено Тогда
					Возврат ПолучитьЗначениеДинамическогоПараметра(Выборка.Договор.Организация, Выборка.ВариантПодписей, ИмяРеквизита);   
				КонецЕсли;
			КонецЕсли;  
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции  

Функция ПолучитьЗначениеДинамическогоПараметра(Организация, ВариантПодписей, ИмяРеквизита)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.Руководитель КАК Руководитель,
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительДолжность КАК РуководительДолжность,
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительОснование КАК РуководительОснование
	               |ИЗ
	               |	РегистрСведений.CW_ЛицаПодписывающиеДокументы.СрезПоследних(
	               |			&ДатаСреза,
	               |			Организация = &Организация
	               |				И Вариант = &ВариантПодписей) КАК CW_ЛицаПодписывающиеДокументыСрезПоследних";  
	
	Запрос.УстановитьПараметр("ДатаСреза", 			ТекущаяДата());
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ВариантПодписей", 	ВариантПодписей);      
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Если ИмяРеквизита = "РуководительОрганизации" Тогда
			Возврат Выборка.Руководитель;
		КонецЕсли;
		Если ИмяРеквизита = "ДолжностьРуководителяОрганизации" Тогда
			Возврат Выборка.РуководительДолжность;
		КонецЕсли;
		Если ИмяРеквизита = "РуководительОснование" Тогда
			Возврат Выборка.РуководительОснование;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции

Функция ПолучитьПечатьОрганизации(Знач Организация, Знач ДатаСреза) 
	
	Возврат CW_Печать.ПолучитьПечатьОрганизации(Организация,,ДатаСреза, Ложь);
	
КонецФункции    

Функция ПолучитьПодписьРуководителя(Руководитель)
	
	Возврат CW_Печать.ПолучитьПодписьСотрудника(Руководитель, Ложь);
	
КонецФункции


      
















