
Функция ПолучитьОписаниеКодовСостояний() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(100 , "Continue («продолжай»)");
	Результат.Вставить(101 , "Switching P410rotocols («переключение протоколов»)");
	Результат.Вставить(102 , "Processing («идёт обработка»)");
	Результат.Вставить(103 , "Early Hints («ранняя метаинформация»)");
	Результат.Вставить(200 , "OK («хорошо»)");
	Результат.Вставить(201 , "Created («создано»)");
	Результат.Вставить(202 , "Accepted («принято»)");
	Результат.Вставить(203 , "Non-Authoritative Information («информация не авторитетна»)");;
	Результат.Вставить(204 , "No Content («нет содержимого»)");
	Результат.Вставить(205 , "Reset Content («сбросить содержимое»)");
	Результат.Вставить(206 , "Partial Content («частичное содержимое»)");;
	Результат.Вставить(207 , "Multi-Status («многостатусный»)");
	Результат.Вставить(208 , "Already Reported («уже сообщалось»)");
	Результат.Вставить(226 , "IM Used («использовано IM»)");
	Результат.Вставить(300 , "Multiple Choices («множество выборов»)");
	Результат.Вставить(301 , "Moved Permanently («перемещено навсегда»)");
	Результат.Вставить(302 , "Moved Temporarily («перемещено временно»)");
	Результат.Вставить(302 , "Found («найдено»)");
	Результат.Вставить(303 , "See Other («смотреть другое»)");
	Результат.Вставить(304 , "Not Modified («не изменялось»)");
	Результат.Вставить(305 , "Use Proxy («использовать прокси»)");
	Результат.Вставить(307 , "Temporary Redirect («временное перенаправление»)");
	Результат.Вставить(308 , "Permanent Redirect («постоянное перенаправление»)");
	Результат.Вставить(400 , "Bad Request («плохой, неверный запрос»)");
	Результат.Вставить(401 , "Unauthorized («не авторизован (не представился)»)");
	Результат.Вставить(402 , "Payment Required («необходима оплата»)");
	Результат.Вставить(403 , "Forbidden («запрещено (не уполномочен)»)");
	Результат.Вставить(404 , "Not Found («не найдено»)");
	Результат.Вставить(405 , "Method Not Allowed («метод не поддерживается»)");
	Результат.Вставить(406 , "Not Acceptable («неприемлемо»)");
	Результат.Вставить(407 , "Proxy Authentication Required («необходима аутентификация прокси»)");
	Результат.Вставить(408 , "Request Timeout («истекло время ожидания»)");
	Результат.Вставить(409 , "Conflict («конфликт»)");
	Результат.Вставить(410 , "Gone («удалён»)");
	Результат.Вставить(411 , "Length Required («необходима длина»)");
	Результат.Вставить(412 , "Precondition Failed («условие ложно»)");
	Результат.Вставить(413 , "Payload Too Large («полезная нагрузка слишком велика»)");
	Результат.Вставить(414 , "URI Too Long («URI слишком длинный»)");
	Результат.Вставить(415 , "Unsupported Media Type («неподдерживаемый тип данных»)");
	Результат.Вставить(416 , "Range Not Satisfiable («диапазон не достижим»)");
	Результат.Вставить(417 , "Expectation Failed («ожидание не удалось»)");
	Результат.Вставить(419 , "Authentication Timeout (not in RFC 2616) («обычно ошибка проверки CSRF»)");
	Результат.Вставить(421 , "Misdirected Request");
	Результат.Вставить(422 , "Unprocessable Entity («необрабатываемый экземпляр»)");
	Результат.Вставить(423 , "Locked («заблокировано»)");
	Результат.Вставить(424 , "Failed Dependency («невыполненная зависимость»)");
	Результат.Вставить(425 , "Too Early («слишком рано»)");
	Результат.Вставить(426 , "Upgrade Required («необходимо обновление»)");
	Результат.Вставить(428 , "Precondition Required («необходимо предусловие»)");
	Результат.Вставить(429 , "Too Many Requests («слишком много запросов»)");
	Результат.Вставить(431 , "Request Header Fields Too Large («поля заголовка запроса слишком большие»)");
	Результат.Вставить(449 , "Retry With («повторить с»)");
	Результат.Вставить(451 , "Unavailable For Legal Reasons («недоступно по юридическим причинам»)");
	Результат.Вставить(499 , "Client Closed Request (клиент закрыл соединение)");
	Результат.Вставить(500 , "Internal Server Error («внутренняя ошибка сервера»)");
	Результат.Вставить(501 , "Not Implemented («не реализовано»)");
	Результат.Вставить(502 , "Bad Gateway («плохой, ошибочный шлюз»)");
	Результат.Вставить(503 , "Service Unavailable («сервис недоступен»)");
	Результат.Вставить(504 , "Gateway Timeout («шлюз не отвечает»)");
	Результат.Вставить(505 , "HTTP Version Not Supported («версия HTTP не поддерживается»)");
	Результат.Вставить(506 , "Variant Also Negotiates («вариант тоже проводит согласование»)");
	Результат.Вставить(507 , "Insufficient Storage («переполнение хранилища»)");
	Результат.Вставить(508 , "Loop Detected («обнаружено бесконечное перенаправление»)");
	Результат.Вставить(509 , "Bandwidth Limit Exceeded («исчерпана пропускная ширина канала»)");
	Результат.Вставить(510 , "Not Extended («не расширено»)");
	Результат.Вставить(511 , "Network Authentication Required («требуется сетевая аутентификация»)");
	Результат.Вставить(520 , "Unknown Error («неизвестная ошибка»)");
	Результат.Вставить(521 , "Web Server Is Down («веб-сервер не работает»)");
	Результат.Вставить(522 , "Connection Timed Out («соединение не отвечает»)");
	Результат.Вставить(523 , "Origin Is Unreachable («источник недоступен»)");
	Результат.Вставить(524 , "A Timeout Occurred («время ожидания истекло»)");
	Результат.Вставить(525 , "SSL Handshake Failed («квитирование SSL не удалось»)");
	Результат.Вставить(526 , "Invalid SSL Certificate («недействительный сертификат SSL»)");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВозможностьДобавленияЭлемента(Отказ) Экспорт
	
	Результат = CW_ОбщийМодульЛичныйКабинетСервер.ПроверитьВозможностьРаботыВСервисе();
	
	Если Результат.КодСостояния <> 200 Тогда
		 ПоказатьПредупреждение(, Результат.Описание,,"Ошибка доступа к сервису");
		 Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
