
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СогласованиеВариантЗаполнить = Истина;
	СогласованиеВариантДополнить = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнение(Команда)

	Ответ = Новый Структура;
	Ответ.Вставить("ВариантПерезаполнить", СогласованиеВариантЗаполнить);
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеВариантЗаполнитьПриИзменении(Элемент)
	
	Если СогласованиеВариантЗаполнить Тогда
		СогласованиеВариантДополнить = Ложь;
	Иначе
		СогласованиеВариантЗаполнить = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеВариантДополнитьПриИзменении(Элемент)
	
	Если СогласованиеВариантДополнить Тогда
		СогласованиеВариантЗаполнить = Ложь;
	Иначе
		СогласованиеВариантДополнить = истина;
	КонецЕсли;
	
КонецПроцедуры

