
// Функция - Получить последний номер
//
// Получает последний записанный номер для указанного префикса и договора
//
// Параметры:
//  Параметры	 - 	Структура("Договор,ПрефиксНомера",)  
// 
// Возвращаемое значение:
//   - Последний записанный номер 
//
Функция ПолучитьПоследнийНомер(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НумерацияПриложений.ПрефиксНомера КАК ПрефиксНомера,
	               |	CW_НумерацияПриложений.Номер КАК Номер
	               |ИЗ
	               |	РегистрСведений.CW_НумерацияПриложений КАК CW_НумерацияПриложений
	               |ГДЕ
	               |	CW_НумерацияПриложений.Договор = &Договор
	               |	И CW_НумерацияПриложений.ПрефиксНомера = &ПрефиксНомера";
	
	Запрос.УстановитьПараметр("Договор", 		Параметры.Договор);
	Запрос.УстановитьПараметр("ПрефиксНомера", 	Параметры.ПрефиксНомера);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		 Возврат Выборка.Номер;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Процедура - Записать последний номер
//
// Записывает установленный номер для указанного префикса и договора
//
// Параметры:
//  Параметры	 - 	Структура("Договор,ПрефиксНомера,Номер",)  
//
Процедура ЗаписатьПоследнийНомер(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запись = РегистрыСведений.CW_НумерацияПриложений.СоздатьМенеджерЗаписи();
	Запись.Договор 			= Параметры.Договор;
	Запись.ПрефиксНомера 	= Параметры.ПрефиксНомера;
	Запись.Номер			= Параметры.Номер;
	
	Запись.Записать(Истина);
	
КонецПроцедуры
