
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокументСсылка = ПараметрКоманды;
	УФ = ПараметрыВыполненияКоманды.Источник;
	
	
	Результат = _ЗаполнитьСФ(ДокументСсылка);
	Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
		
		УФ.Прочитать();
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Результат));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ЗаполнитьСФ(Ссылка)
	// --- 
	
	Если (Ссылка.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыВыставленного.НалоговыйАгент) Тогда
		
		Возврат(_УФКС.Ответ(1,"Неверный тип счёта-фактуры."));
		
	КонецЕсли; 
	
	Если (Ссылка.Пустая()) Тогда
		
		Возврат(_УФКС.Ответ(1,"Документ должен быть записан."));
		
	КонецЕсли; 
	
	ВРУ = CW_Настройки.ВалютаРегламентированногоУчета();
	
	Документ = Ссылка.ПолучитьОбъект();
	// --- 
	Документ.Авансы.Очистить();
	// --- 
	Основание = Ссылка.ДокументОснование;
	// --- 
	Для каждого СтрокаДокумента Из Основание.РасшифровкаПлатежа Цикл
		
		Если (НЕ ЗначениеЗаполнено(СтрокаДокумента.Сделка)) Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//|	ХозрасчетныйДвиженияССубконто.Сумма,
		//|	ХозрасчетныйДвиженияССубконто.ВалютнаяСуммаДт
		//|ИЗ
		//|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(, , , , ) КАК ХозрасчетныйДвиженияССубконто
		//|ГДЕ
		//|	ХозрасчетныйДвиженияССубконто.СчетДт = &СчетДт
		//|	И ХозрасчетныйДвиженияССубконто.СчетКт = &СчетКт
		//|	И ХозрасчетныйДвиженияССубконто.СубконтоДт3 = &СубконтоДт3
		//|	И ХозрасчетныйДвиженияССубконто.Организация = &Организация";
		Запрос.Текст = "ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК Сумма,
		|	ХозрасчетныйОборотыДтКт.ВалютнаяСуммаОборотДт КАК ВалютнаяСуммаДт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|			,
		|			,
		|			,
		|			СчетДт = &СчетДт,
		|			&Субконто,
		|			СчетКт = &СчетКт,
		|			&ПустойМассив,
		|			СубконтоДт1 = &СубконтоДт3
		|				И Организация = &Организация) КАК ХозрасчетныйОборотыДтКт";
		Запрос.УстановитьПараметр("Субконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами); 
		Запрос.УстановитьПараметр("ПустойМассив",Новый Массив);
		// --- 
		Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
		
		Запрос.УстановитьПараметр("СубконтоДт3", СтрокаДокумента.Сделка); 
		Запрос.УстановитьПараметр("СчетДт", СтрокаДокумента.СчетУчетаРасчетовСКонтрагентом);  // 60.21
		Запрос.УстановитьПараметр("СчетКт", CW_Конфигурация.ПланСчетов().РасчетыНДСНалоговогоАгента); // 76.НА
		ТЗ = Запрос.Выполнить().Выгрузить();
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	ХозрасчетныйДвиженияССубконто.Сумма,
		//               |	ХозрасчетныйДвиженияССубконто.ВалютнаяСуммаДт
		//               |ИЗ
		//               |	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
		//               |			,
		//               |			,
		//               |			СчетДт = &СчетДт
		//               |				И СчетКт = &СчетКт
		//               |				И СубконтоДт3 = &СубконтоДт3
		//               |				И Организация = &Организация,
		//               |			,
		//               |			) КАК ХозрасчетныйДвиженияССубконто";
		//Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
		//Запрос.УстановитьПараметр("СубконтоДт3", СтрокаДокумента.Сделка); 
		//Запрос.УстановитьПараметр("СчетДт", СтрокаДокумента.СчетУчетаРасчетовСКонтрагентом);
		//Запрос.УстановитьПараметр("СчетКт", CW_Конфигурация.ПланСчетов().РасчетыНДСНалоговогоАгента);
		//ТЗ = Запрос.Выполнить().Выгрузить();
		ВалютнаяСуммаНДС = ТЗ.Итог("ВалютнаяСуммаДт");
		СуммаНДС = ТЗ.Итог("Сумма");
		ВалютнаяСуммаВсего = СтрокаДокумента.СуммаПлатежа + ВалютнаяСуммаНДС;
		// --- 
		ВалютаДокумента = СтрокаДокумента.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		СК = CW_Финансы.ПолучитьКурсВалюты(СтрокаДокумента.ДоговорКонтрагента.ВалютаВзаиморасчетов,Ссылка.Дата);
		НоваяСуммаВсего = CW_Финансы.ПересчитатьИзВалютыВВалюту(ВалютнаяСуммаВсего,СтрокаДокумента.ДоговорКонтрагента.ВалютаВзаиморасчетов,ВРУ,СК.Курс,1,СК.Кратность,1);
		// --- 
		Нстр = Документ.Авансы.Добавить();
		Нстр.ДокументОснование = Основание;
		
		
		Нстр.СтавкаНДС = CW_БухгалтерияЭкспедитораДляРоссииСервер.СтавкаНДСПоВидуСтавки(Перечисления.ВидыСтавокНДС.ОбщаяРасчетная, Ссылка.Дата);
		//Если Ссылка.Дата < '20190101' Тогда
		//	Нстр.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118;
		//Иначе
		//	Нстр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120;
		//КонецЕсли;
	
		Нстр.Сумма = НоваяСуммаВсего;
		Нстр.СуммаНДС = СуммаНДС;
		
	КонецЦикла; 
	// --- 
	Документ.Записать();
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции
 