
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ТекущийПриоритет") Тогда 
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;

	МассивВсеОбъектыПриоритета = Новый Массив;
	МассивВсеОбъектыПриоритета.Добавить("Грузоперевозка");
	МассивВсеОбъектыПриоритета.Добавить("Заказ");
	МассивВсеОбъектыПриоритета.Добавить("Заявка");
	
	Для Каждого ОбъектПриоритета из Параметры.ТекущийПриоритет Цикл
		СписокЗначений.Добавить(ОбъектПриоритета,,Истина); 
		
		МассивВсеОбъектыПриоритета.Удалить(МассивВсеОбъектыПриоритета.Найти(ОбъектПриоритета));
	КонецЦикла; 
	
	Для Каждого ОбъектПриоритета из МассивВсеОбъектыПриоритета Цикл
		СписокЗначений.Добавить(ОбъектПриоритета,,Ложь); 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда) 
	
	Если Не ПроверитьВыбор() Тогда
		ПоказатьПредупреждение(, "Необходимо выбирать хотя бы одно значение!");
		Возврат;
	КонецЕсли;
	
	мОбъектыПриоритета = Новый Массив;
	
	Для Каждого ЭлементСписка из СписокЗначений Цикл
		Если ЭлементСписка.Пометка Тогда
			мОбъектыПриоритета.Добавить(ЭлементСписка.Значение);	
		Конецесли;
	КонецЦикла;
	
	ЭтаФорма.Закрыть(мОбъектыПриоритета);
	
КонецПроцедуры  

&НаКлиенте
Функция ПроверитьВыбор()
	
	Для Каждого ЭлементСписка из СписокЗначений Цикл
		Если ЭлементСписка.Пометка Тогда
			Возврат Истина;	
		Конецесли;
	КонецЦикла;
	
	Возврат Ложь;	
	
КонецФункции

