&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметр 			= Параметры.Параметр;
	ЭтаФорма.Заголовок 	= Строка(Параметр);
	
	Если Параметр.ДинамическийПараметр Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
	//-----------------------------------------------
	// обработчик создания формы на сервере
	
	ВыбраннаяДата = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормы()
	
	СтруктураОтвета = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
	СтруктураОтвета.Параметр 		= Параметр;
	СтруктураОтвета.ПараметрИзменен	= Истина;    
	СтруктураОтвета.Значение 		= ВыбраннаяДата;  
	СтруктураОтвета.ЗначениеПлан 	= ВыбраннаяДата;  
	
	ЭтаФорма.Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	//Структура ответа 
	ОбработатьЗакрытиеФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбраннаяДатаВыбор(Элемент, ВыбраннаяДата)
	ОбработатьЗакрытиеФормы();
КонецПроцедуры

