#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.ИмяФормы = "ОбщаяФорма.СписокЗадач";

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбновитьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("ОткрыватьВНовойЗакладке", Истина);
	
	ПараметрыЗависимыхФорм = ПростойИнтерфейсКлиент.ПараметрыОткрытияЗависимыхФорм(ПараметрыВыполненияКоманды.Источник);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыФормы, ПараметрыЗависимыхФорм);
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);

КонецПроцедуры

#КонецОбласти