
&НаКлиенте
Процедура ПорядокОтраженияПриИзменении(Элемент)
	ПорядокОтраженияИзм = Истина;
	//Если ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление") Тогда
	//	Элементы.ГруппаПокупательДоговор.Доступность = Истина;
	//Иначе
	//	Элементы.ГруппаПокупательДоговор.Доступность = Ложь;
	//	ЗаполнитьЗначенияСвойств(ЭтаФорма,Новый Структура("Покупатель,ПокупательИзм,ДоговорПокупателя,ДоговорПокупателяИзм")); 
	//КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	КоличествоИзм = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	ПокупательИзм = Истина;
	Если ПокупательИзм Тогда
		ДоговорПокупателяИзм = Истина;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПокупателяПриИзменении(Элемент)
	ДоговорПокупателяИзм = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	Ответ = Новый Структура("Количество,КоличествоИзм,ПорядокОтражения,ПорядокОтраженияИзм,Покупатель,ПокупательИзм,ДоговорПокупателя,ДоговорПокупателяИзм");
	ЗаполнитьЗначенияСвойств(Ответ,ЭтаФорма);
	Закрыть(Ответ);
КонецПроцедуры

&НаКлиенте
Процедура ПокупательИзмПриИзменении(Элемент)
	Если ПокупательИзм Тогда
		ДоговорПокупателяИзм = Истина;	
	КонецЕсли; 
КонецПроцедуры
