
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеКартинок = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьРазмерыКартинок();
	
	Если ТипЗнч(ДанныеКартинок) = Тип("Структура") Тогда 
		
		ПечатьОрганизации 	= Неопределено;
		ДанныеКартинок.Свойство("ПечатьОрганизации", 		ПечатьОрганизации);  
		Если ТипЗнч(ПечатьОрганизации) = Тип("Структура") Тогда
			ПечатьОрганизации.Свойство("Масштаб", XMLПечатьМасштаб);  
		КонецЕсли; 
		
		РуководительПодпись = Неопределено;
		ДанныеКартинок.Свойство("РуководительПодпись", 	РуководительПодпись);
		Если ТипЗнч(РуководительПодпись) = Тип("Структура") Тогда
			РуководительПодпись.Свойство("Масштаб", XMLПодписьМасштаб);  
		КонецЕсли;    
		
		ПечатьОрганизацииHTML 	= Неопределено;
		ДанныеКартинок.Свойство("ПечатьОрганизацииHTML", ПечатьОрганизацииHTML);  
		Если ТипЗнч(ПечатьОрганизацииHTML) = Тип("Структура") Тогда
			ПечатьОрганизацииHTML.Свойство("Масштаб", HTMLПечатьМасштаб);  
		КонецЕсли; 
		
		РуководительПодписьHTML 	= Неопределено;
		ДанныеКартинок.Свойство("РуководительПодписьHTML", РуководительПодписьHTML);  
		Если ТипЗнч(РуководительПодписьHTML) = Тип("Структура") Тогда
			РуководительПодписьHTML.Свойство("Масштаб", HTMLПодписьМасштаб);  
		КонецЕсли; 
		
	КонецЕсли; 
	
	XMLПечатьМасштаб 	= ?(XMLПечатьМасштаб  = 0, 100, XMLПечатьМасштаб);
	XMLПодписьМасштаб 	= ?(XMLПодписьМасштаб = 0, 100, XMLПодписьМасштаб);

	HTMLПечатьМасштаб 	= ?(HTMLПечатьМасштаб 	= 0, 100, HTMLПечатьМасштаб);
	HTMLПодписьМасштаб 	= ?(HTMLПодписьМасштаб 	= 0, 100, HTMLПодписьМасштаб);
	
	Параграф = ФорматированныйДокумент.Элементы.Добавить(,Тип("ПараграфФорматированногоДокумента"));

	КартинкаПечать	= Новый Картинка(БиблиотекаКартинок.CW_ПустаяКартинка.ПолучитьДвоичныеДанные());
	ДобавленныйЭлементПечать 	= Параграф.Элементы.Добавить(КартинкаПечать, Тип("КартинкаФорматированногоДокумента")); 

	Параграф.Элементы.Добавить("	", Тип("ТекстФорматированногоДокумента"));  

	КартинкаПодпись	= Новый Картинка(БиблиотекаКартинок.CW_ПустаяКартинка.ПолучитьДвоичныеДанные());
	ДобавленныйЭлементПодпись 	= Параграф.Элементы.Добавить(КартинкаПодпись, Тип("КартинкаФорматированногоДокумента"));  

	HTMLПечатьИндекс	= Параграф.Элементы.Индекс(ДобавленныйЭлементПечать);
	HTMLПодписьИндекс	= Параграф.Элементы.Индекс(ДобавленныйЭлементПодпись);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда) 
	
	ЗаписатьНаСервере();
	ЭтаФорма.Закрыть(); 
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()  

	Структура = Новый Структура;
	
	XMLШиринаПечати  = ИсходныеПечать.Ширина / 100 * XMLПечатьМасштаб;
	XMLВысотаПечати  = ИсходныеПечать.Высота / 100 * XMLПечатьМасштаб;
 	Структура.Вставить("ПечатьОрганизации", Новый Структура("Масштаб, Ширина, Высота", XMLПечатьМасштаб,   XMLШиринаПечати,  XMLВысотаПечати)); 

	XMLШиринаПодписи = ИсходныеПодпись.Ширина / 100 * XMLПодписьМасштаб;
	XMLВысотаПодписи = ИсходныеПодпись.Высота / 100 * XMLПодписьМасштаб;
	Структура.Вставить("РуководительПодпись", Новый Структура("Масштаб, Ширина, Высота", XMLПодписьМасштаб,  XMLШиринаПодписи, XMLВысотаПодписи)); 
	
	HTMLШиринаПечати  = ИсходныеПечать.Ширина  / 100 * HTMLПечатьМасштаб;
	HTMLВысотаПечати  = ИсходныеПечать.Высота  / 100 * HTMLПечатьМасштаб;
	Структура.Вставить("ПечатьОрганизацииHTML", Новый Структура("Масштаб, Ширина, Высота", HTMLПечатьМасштаб,  HTMLШиринаПечати,  HTMLВысотаПечати));
	
	HTMLШиринаПодписи = ИсходныеПодпись.Ширина / 100 * HTMLПодписьМасштаб;
	HTMLВысотаПодписи = ИсходныеПодпись.Высота / 100 * HTMLПодписьМасштаб;
	Структура.Вставить("РуководительПодписьHTML",Новый Структура("Масштаб, Ширина, Высота", HTMLПодписьМасштаб, HTMLШиринаПодписи, HTMLВысотаПодписи));

	Константы.CW_МасштабКартинокШаблонов.Установить(Новый ХранилищеЗначения(Структура));   
	
	Модифицированность = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)    
	
	ОрганизацияПриИзмененииНаСервере();
	СотрудникПриИзмененииНаСервере();  
	
	УстановитьДанныеКартинки(АдресПечать, Истина);
	УстановитьДанныеКартинки(АдресПодпись, Ложь); 
	
	УстановитьКартинкуТабличногоДокумента();
	УстановитьКартинкиФорматированногоДокумента();
	
КонецПроцедуры  

 &НаСервере
Процедура УстановитьДанныеКартинки(Адрес, ПечатьПодпись) 

	ДвоичныеДанные = БиблиотекаКартинок.CW_ПустаяКартинка.ПолучитьДвоичныеДанные();
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);	
	КонецЕсли;
	
	ДанныеКартинки = Новый Структура;
	ДанныеКартинки.Вставить("Картинка", Новый Картинка(ДвоичныеДанные));
	ДанныеКартинки.Вставить("Ширина", 	ДанныеКартинки.Картинка.Ширина());
	ДанныеКартинки.Вставить("Высота", 	ДанныеКартинки.Картинка.Высота());
	
	Если ПечатьПодпись Тогда
		ИсходныеПечать 	= Новый ФиксированнаяСтруктура(ДанныеКартинки);	
	Иначе
		ИсходныеПодпись	= Новый ФиксированнаяСтруктура(ДанныеКартинки);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкуТабличногоДокумента()
	
	ТекущаяОбластьПечатьОрганизации 	= ТабличныйДокумент.Область("R2C2");  
	ПечатьОрганизации = ПолучитьКартинкуТабличногоДокумента("ПечатьОрганизации");  
	
	ПечатьОрганизации.Картинка = ИсходныеПечать.Картинка;
	ПечатьОрганизации.Расположить(ТекущаяОбластьПечатьОрганизации);
	УстановитьРазмерыXMLКартинки(ИсходныеПечать, XMLПечатьМасштаб, "ПечатьОрганизации");
	
	ТекущаяОбластьРуководительПодпись 	= ТабличныйДокумент.Область("R2C6");
	РуководительПодпись = ПолучитьКартинкуТабличногоДокумента("РуководительПодпись");
	
	РуководительПодпись.Картинка = ИсходныеПодпись.Картинка;
	РуководительПодпись.Расположить(ТекущаяОбластьРуководительПодпись);
	УстановитьРазмерыXMLКартинки(ИсходныеПодпись, XMLПодписьМасштаб, "РуководительПодпись");

КонецПроцедуры 

&НаКлиенте
Функция ПолучитьКартинкуТабличногоДокумента(ИмяКартинки) Экспорт
	
	ИндексКартинки 	= 0;  
	Рисунок = СуществуетКартикаМакета(ИмяКартинки);
	Пока Рисунок = Неопределено Цикл          
		Рисунок = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
		Рисунок.Имя = Имякартинки; 
	КонецЦикла;
	
	Рисунок.РазмерКартинки 		= РазмерКартинки.Пропорционально; 
	
	Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Точечная,1);
	Рисунок.Линия = Линия; 

	Рисунок.ГраницаСверху = Истина;
	Рисунок.ГраницаСлева  = Истина;
	Рисунок.ГраницаСнизу  = Истина;
	Рисунок.ГраницаСправа = Истина;  
	
	Рисунок.ВыводитьНаПечать 	= Истина;  
	
	Рисунок.ЦветФона = новый Цвет;

	Возврат Рисунок;
	
КонецФункции 

&НаКлиенте
Функция СуществуетКартикаМакета(ИмяКартинки) Экспорт
	
	Попытка
		Возврат ТабличныйДокумент.Рисунки[ИмяКартинки];
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура УстановитьРазмерыXMLКартинки(ИсходныйРазмер, Масштаб, ИмяКартинки) 
	
	Рисунок = CW_ШаблоныДокументовКлиент.СуществуетКартикаМакета(ТабличныйДокумент,ИмяКартинки);
	Если Масштаб <> 0 Тогда
		Рисунок.Ширина  = ИсходныйРазмер.Ширина / 100 * Масштаб;
		Рисунок.Высота  = ИсходныйРазмер.Высота / 100 * Масштаб;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура XMLПечатьМасштабПриИзменении(Элемент)     
	
	УстановитьРазмерыXMLКартинки(ИсходныеПечать, XMLПечатьМасштаб, "ПечатьОрганизации");

КонецПроцедуры

&НаКлиенте
Процедура XMLПодписьМасштабПриИзменении(Элемент)
	
	УстановитьРазмерыXMLКартинки(ИсходныеПодпись, XMLПодписьМасштаб, "РуководительПодпись");   
	
КонецПроцедуры

&НаКлиенте
Процедура XMLПечатьМасштабОчистка(Элемент, СтандартнаяОбработка) 

	СтандартнаяОбработка 	= ложь;
	XMLПечатьМасштаб 		= 100;
	УстановитьРазмерыXMLКартинки(ИсходныеПечать, XMLПечатьМасштаб, "ПечатьОрганизации");
	
КонецПроцедуры

&НаКлиенте
Процедура XMLПодписьМасштабОчистка(Элемент, СтандартнаяОбработка) 
	
	СтандартнаяОбработка 	= ложь;
	XMLПодписьМасштаб 		= 100;
	УстановитьРазмерыXMLКартинки(ИсходныеПодпись, XMLПечатьМасштаб, "РуководительПодпись");  
	
КонецПроцедуры


&НаКлиенте
Процедура HTMLПечатьМасштабПриИзменении(Элемент)
	
	HTMLМасштабПриИзменении(HTMLПечатьИндекс, HTMLПечатьМасштаб, ИсходныеПечать);
	
КонецПроцедуры 

&НаКлиенте
Процедура HTMLПечатьМасштабОчистка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	HTMLПечатьМасштаб = 100;
	HTMLМасштабПриИзменении(HTMLПечатьИндекс, HTMLПечатьМасштаб, ИсходныеПечать);  
	
КонецПроцедуры

&НаКлиенте
Процедура HTMLПодписьМасштабПриИзменении(Элемент)   
	
	HTMLМасштабПриИзменении(HTMLПодписьИндекс, HTMLПодписьМасштаб, ИсходныеПодпись);

КонецПроцедуры

&НаКлиенте
Процедура HTMLПодписьМасштабОчистка(Элемент, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	HTMLПодписьМасштаб = 100;
	HTMLМасштабПриИзменении(HTMLПодписьИндекс, HTMLПодписьМасштаб, ИсходныеПодпись);  
	
КонецПроцедуры

&НаСервере
Процедура HTMLМасштабПриИзменении(ИндексЭлемента, Масштаб, ИсходныеЗначения)
	
	Если Масштаб <> 0 Тогда
		Параграф = ФорматированныйДокумент.Элементы.Получить(0);
		ЭлементДокумента =  Параграф.Элементы.Получить(ИндексЭлемента); 
		Если ЭлементДокумента <> Неопределено Тогда  
			УстановитьРазмерыHTMLКартинки(ЭлементДокумента, ИсходныеЗначения, Масштаб)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьКартинкиФорматированногоДокумента()
	
	Параграф = ФорматированныйДокумент.Элементы.Получить(0);
	ДобавленныйЭлементПечать =  Параграф.Элементы.Получить(HTMLПечатьИндекс); 
	Если ДобавленныйЭлементПечать <> Неопределено Тогда
		ДобавленныйЭлементПечать.Картинка = ИсходныеПечать.Картинка;          
		УстановитьРазмерыHTMLКартинки(ДобавленныйЭлементПечать, ИсходныеПечать, HTMLПечатьМасштаб)
	КонецЕсли;
	
	ДобавленныйЭлементПодпись =  Параграф.Элементы.Получить(HTMLПодписьИндекс); 
	Если ДобавленныйЭлементПодпись <> Неопределено Тогда
		ДобавленныйЭлементПодпись.Картинка = ИсходныеПодпись.Картинка; 
		УстановитьРазмерыHTMLКартинки(ДобавленныйЭлементПодпись, ИсходныеПодпись, HTMLПодписьМасштаб)
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРазмерыHTMLКартинки(ДобавленныйЭлемент, ИсходныйРазмер, Масштаб) 
	
	Если Масштаб <> 0 Тогда  
		ДобавленныйЭлемент.Ширина  = ИсходныйРазмер.Ширина / 100 * Масштаб;
		ДобавленныйЭлемент.Высота  = ИсходныйРазмер.Высота / 100 * Масштаб;
	КонецЕсли;  
	
КонецПроцедуры



&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ОрганизацияПриИзмененииНаСервере();  
	
	УстановитьДанныеКартинки(АдресПечать, Истина);
	
	УстановитьКартинкуТабличногоДокумента();
	УстановитьКартинкиФОрматированногоДокумента(); 
	
КонецПроцедуры  

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()  
	
	Если Организация.Пустая() Тогда
		АдресПечать = "";
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = CW_Печать.ПолучитьПечатьОрганизации(Организация,,ТекущаяДата(), Ложь);  
	Если ДвоичныеДанные <> Неопределено Тогда
		АдресПечать = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	КонецЕсли;
		
КонецПроцедуры  

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();   

	УстановитьДанныеКартинки(АдресПодпись, Ложь); 

	УстановитьКартинкуТабличногоДокумента();
	УстановитьКартинкиФОрматированногоДокумента();
КонецПроцедуры  

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	Если Сотрудник.Пустая() Тогда
		АдресПодпись = "";
		Возврат;
	КонецЕсли;   
	
	ПодписьДвоичныеДанные = CW_Печать.ПолучитьПодписьСотрудника(Сотрудник, Ложь);
	Если ТипЗнч(ПодписьДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
		АдресПодписи = ПоместитьВоВременноеХранилище(ПодписьДвоичныеДанные, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность и НЕ ЗавершениеРаботы Тогда 
		Отказ = истина;   
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗакрытииФормы", ЭтотОбъект);
		ПоказатьВопрос(Оповещение,"Изменения не сохранены. Закрыть?", Режим, 0); 
	КонецЕсли;
	
КонецПроцедуры       

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗакрытииФормы(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    Модифицированность = Ложь;
	ЭтаФорма.Закрыть();

КонецПроцедуры




	