#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ПростойИнтерфейсТоварыПокупки", , Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭтоТовары", Истина);

	ОткрытьФорму(
		"Обработка.ПанелиПростойИнтерфейс.Форма.ПанельПокупки",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти