#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешняяФормаПараметра();
	
	СтруктураОписания.Наименование		= "Внешняя форма множественного редактирования параметров";
	СтруктураОписания.Описание			= "Обработка используется для изменения нескольких, заранее определенных при настройке, параметров грузоперевозки.
										|При настройке необходимо указать в список значений перечень параметров, которые будут изменяться; параметр, отвечающий за необходимость использования данной формы; параметр для хранения ""шаблонов"" множественного заполнения.
										|Так же, следует указать в настройках параметра (в каждом, для которого подразумевается вызов данной обработки) использование данной обработки в ""обработке начала редактирования"".
										|При вызове данной обработки, проверяется параметр ""Параметр необходимости множественного выбора"", указанный при настройке обработки, после чего либо вызывается обычная форма редактирования параметра, либо форма обработки, для массового изменения.
										|Форма представляет из себя таблицу, которая сохраняется для данной грузоперевозки и при последующих вызовах подгружается из Хранилища Значений. В случае, если данные отсутствуют (например, первый вызов формы), таблица подхватит текущие данные параметров. При закрытии формы с помощью кнопки ""ОК"", первая строка таблицы параметров подставляется в соответствующие параметры грузоперевозки. Заполняются только существующие в данной грузоперевозке параметры.
										|Работает только для параметров произвольного типа.
										|ВАЖНО: для работы обработки необходимо в каждой грузоперевозке создать параметр, который указан как ""Параметр необходимости множественного выбора"", а так же ""Параметр хранения данных"". Без этих параметров в грузоперевозке: форма множественного заполнения не будет открываться (без параметра ""Параметр необходимости множественного выбора"" считается, что открытие множественного заполнения не нужно);  не будет сохранятся таблица шаблонов параметра заполнений, в случае отсутствия параметра для хранения таблицы заполнения.";
	
	СтруктураОписания.Версия					= "3.2.5.7";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	СтруктураОписания.Настройка					= Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыНастроекОбъекта(СтруктураОписания, 	"ФормаНастроек");
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыОбъекта(СтруктураОписания, 			"Форма");
	
	Возврат СтруктураОписания;
	
КонецФункции

Функция Использование(АдресОбъекта) Экспорт
	//СтруктурВозврата - тип "Структура"
	//- "РежимОткрытия" тип число:
	//		0 - Открыть форму внешней обработки;
	//		1 - Открыть форму редактирования параметра;
	//		3 - Отказ от открытия;
	//- "ТолькоПросмотр" 	- тип "булево";
	СтруктураНеобходимостиОткрытия = Новый Структура;
	РежимОткрытия 				= 0;
	РежимТолькоПросмотр 		= Ложь;
	
	
	//проверка флага
	Если ЭтоАдресВременногоХранилища(АдресОбъекта) тогда
		СтруктураОбъекта = ПолучитьИзВременногоХранилища(АдресОбъекта);
	КонецЕсли;
	Если  ЗначениеЗаполнено(ПодключаемыйОбъект) Тогда
		Настройки = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъект);
		Если (Настройки <> Неопределено) Тогда
			Если Настройки.Свойство("ФлагМножественногоВыбора") Тогда
				ФлагМножественногоВыбора = Настройки.ФлагМножественногоВыбора;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ФлагМножественногоВыбора <> Неопределено Тогда
		ИмяТабличнойЧасти 			= CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(СтруктураОбъекта);
		НайденнаяСтрока = СтруктураОбъекта[ИмяТабличнойЧасти].Найти(ФлагМножественногоВыбора, "Параметр"); 
		Если НайденнаяСтрока = Неопределено Тогда
			РежимОткрытия = Макс(РежимОткрытия,1);
		Иначе
			РежимОткрытия = Макс(РежимОткрытия,?(НайденнаяСтрока.Значение,0 , 1));	
		КонецЕсли;
	КонецЕсли;
	
	РежимОткрытия = Макс(РежимОткрытия,?(ЕстьНедоступныеПараметры(Настройки.МножествоПараметров), 1, 0));
	СтруктураНеобходимостиОткрытия.Вставить("РежимОткрытия", РежимОткрытия);
	СтруктураНеобходимостиОткрытия.Вставить("ТолькоПросмотр", Ложь);
	Возврат СтруктураНеобходимостиОткрытия;
	
КонецФункции

Функция ЕстьНедоступныеПараметры(ПереченьПрав)
	НаборПрав = CW_ПраваДоступа.НаборПравДляПараметров();
	Для Каждого ПараметрПроверки Из ПереченьПрав Цикл
		ПраваПараметра = НаборПрав["п_"+_сф.КлючПоСсылке(ПараметрПроверки.ПараметрМножественногоЗаполнения)];
		Если НЕ ПраваПараметра.Редактирование Тогда
			//Если недоступен хоть 1 параметр из перечня - открываем классическую форму редактирования
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

  

#КонецЕсли