// @strict-types

#Область СлужебныеПроцедурыИФункции

// Возвращает URL инструкции по подключению к облачной отчетности
// 
// Возвращаемое значение:
//  Строка
Функция АдресИнструкции() Экспорт
	
	Возврат "https://its.1c.ru/bmk/repdoc/nastroyki_podklyucheniya_v_uchetnoy_baze_obmena_s_prilozjeniem";
	
КонецФункции

Процедура ПоказатьФормуПодтвержденияПриНеобходимости(
	ЗапросыПодтверждения, ОбработатьСразу = Ложь) 
	
	Если ЗапросыПодтверждения <> Неопределено Тогда
		ТекущийПользователь = ПользователиКлиент.ТекущийПользователь();
		ЗапросыИнтеграцииДляПользователя = ЗапросыПодтверждения.Получить(ТекущийПользователь);
		Если ЗапросыИнтеграцииДляПользователя = Неопределено Тогда
			ЗапросыИнтеграцииДляПользователя = Новый Массив;	
		КонецЕсли;
		ЗапросыИнтеграцииДляПользователяДляВсех = ЗапросыПодтверждения.Получить("ВсеПользователи");
		Если ЗапросыИнтеграцииДляПользователяДляВсех <> Неопределено Тогда
			Для Каждого ЗапросИнтеграции Из ЗапросыИнтеграцииДляПользователяДляВсех Цикл
				ЗапросыИнтеграцииДляПользователя.Добавить(ЗапросИнтеграции);
			КонецЦикла;
		КонецЕсли;
		Если ЗапросыИнтеграцииДляПользователя.Количество() > 0 Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗапросыПодтверждения", ЗапросыИнтеграцииДляПользователя);
			ПараметрыФормы.Вставить("ОбработатьСразу", ОбработатьСразу);
			ОткрытьФорму("РегистрСведений.Отчетность24БРОЗапросы.Форма.ФормаПодтвержденияОтветаНаЗапрос", 
				ПараметрыФормы, , , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьСообщенияПоHttp(ОтображатьСообщения = Ложь, ВыполнитьЗапросНаШину = Ложь) Экспорт
	
	Если Не ИнтеграцияСОтчетность24ВызовСервера.ЕстьНастроенныеИнтеграции() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИнтеграцияСОтчетность24ВызовСервера.РазрешеноПодтверждениеОтправкиДанныхОтчетов() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	
	Если ВыполнитьЗапросНаШину Тогда
		ИнтеграцияСОтчетность24ВызовСервера.ПолучитьСообщенияПоHttp(ОписаниеОшибки, Ложь);
	КонецЕсли;
	
	ЕстьНовые = Ложь;
	
	ЗапросыПодтверждения = 
		ИнтеграцияСОтчетность24ВызовСервера.ПолучитьЗапросыИнтеграцииДляФормыПодтверждения();
		
	ЕстьПодтверждения = ЗначениеЗаполнено(ЗапросыПодтверждения)
		И ЗапросыПодтверждения.Получить(ПользователиКлиент.ТекущийПользователь()) <> Неопределено;
	
	Если ОтображатьСообщения 
		Или ЕстьНовые 
		Или ЕстьПодтверждения Тогда
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ПоказатьПредупреждение(, ОписаниеОшибки, , НСтр("ru='Ошибка'"));
		Иначе
			ПоказатьРезультатПолученияСообщений(ЕстьНовые, ЕстьПодтверждения);
		КонецЕсли; 
	КонецЕсли; 
		
	ПоказатьФормуПодтвержденияПриНеобходимости(ЗапросыПодтверждения, Истина);
	
КонецПроцедуры

Процедура ПоказатьРезультатПолученияСообщений(ЕстьНовые = Ложь, ЕстьПодтверждения = Ложь)
	
	ЗаголовокОповещения = НСтр("ru='Получение запросов от 1С:Отчетности'");
	
	Если ЕстьНовые Тогда
		ТекстОповещения = СтрШаблон(НСтр("ru='Получены %1новые запросы'"), 
			?(ЕстьПодтверждения, "", НСтр("ru='и обработаны'")+" "));
	Иначе
		Если ЕстьПодтверждения Тогда
			ТекстОповещения = НСтр("ru='Есть запросы для подтверждения'");
		Иначе
			ТекстОповещения = НСтр("ru='Нет новых запросов'");
		КонецЕсли;
	КонецЕсли;
	
	КартинкаОповещения = БиблиотекаКартинок.ЛоготипОбменСОтчетностью;
	
	#Если Не МобильноеПриложениеКлиент Тогда
		ПоказатьОповещениеПользователя(ЗаголовокОповещения, Неопределено, ТекстОповещения, КартинкаОповещения,
			СтатусОповещенияПользователя.Важное, "518b9434-10ec-483d-a9ab-cf8d8fd62ec0");
	#Иначе
		Сообщение = Новый СообщениеПользователю;
		//@skip-check property-return-type
		Сообщение.Текст = ТекстОповещения;
		//@skip-check dynamic-access-method-not-found
		Сообщение.Сообщить();
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти
