
Функция РасширениеПрименимо(ИмяРасширения) Экспорт

	УстановитьПривилегированныйРежим(Истина);  

	ПрименениеВозможно = Ложь;
	ОтборРасширений = новый Структура;
	ОтборРасширений.Вставить("Имя", ИмяРасширения);
	мРасширения = РасширенияКонфигурации.Получить(ОтборРасширений); 
	Если мРасширения.Количество() > 0 Тогда 
		Расширение 			= мРасширения[0];
		Активно 			= мРасширения[0].Активно;
		мПроблемыПрименения = Расширение.ПроверитьВозможностьПрименения();   
		
		ПрименениеВозможно = Активно и мПроблемыПрименения.Количество() = 0;
	КонецЕсли;  
	
	Возврат ПрименениеВозможно;	 
	
КонецФункции    

