
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИмяКонстанты",ИмяКонстанты); 
	Если ИмяКонстанты = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	МеханизмРаскраски = Константы[ИмяКонстанты].Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапистьНастройку(Команда)
	
	ЗапистьНастройкуНаСервере();
	ЭтаФорма.Закрыть();
	
	Оповестить("ЗаписьКонстаны_МеханизмРаскраски");
	
КонецПроцедуры

&НаСервере
Процедура ЗапистьНастройкуНаСервере()
	
	Константы[ИмяКонстанты].Установить(МеханизмРаскраски);
	
КонецПроцедуры
