#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ЗаполнитьНастройкиКолонок(ТипПеревозки=Неопределено) Экспорт
	
	Результат = Новый Массив;

	ОграниченияКолонок = ПолучитьОграниченияКолонок();
	
	Структура	= Новый Структура("Поле,Заголовок,ТипЗначения", "Ссылка", "Заказ", Новый ОписаниеТипов("Строка"));
	Результат.Добавить(Структура);
	
	Для Каждого Реквизит из Метаданные.Справочники.CW_Заказы.Реквизиты Цикл
		
		Если Реквизит.Тип.СодержитТип(тип("ХранилищеЗначения")) Тогда 
			//Пропускаем реквизиты с типм хранилище значния
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяС(ВРЕГ(Реквизит.Имя), "УДАЛИТЬ") Тогда 
			Продолжить;
		КонецЕсли;  
		
		Если ОграниченияКолонок.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Структура 	= Новый Структура("Поле,Заголовок,ТипЗначения", "Ссылка." + Реквизит.Имя, Реквизит.Синоним, Реквизит.Тип);
		Результат.Добавить(Структура);
	КонецЦикла;	
	
	ВыборкаПараметров = ПолучитьДоступныеПараметры(ТипПеревозки);
	Пока ВыборкаПараметров.Следующий() Цикл
		Структура = Новый Структура("Поле,Заголовок,ТипЗначения", "Ссылка.[" + ВыборкаПараметров.Идентификатор + "]", "Заказ." + ВыборкаПараметров.Идентификатор, ВыборкаПараметров.ТипЗначения);
		Результат.Добавить(Структура);
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьОграниченияКолонок()
	
	Массив = новый Массив;
	
	CW_Журналы_Сервер.ДополнитьОграниченияКолонок(Массив);
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьДоступныеПараметры(ТипПеревозки=Неопределено)
	
	МассивПараметров = Неопределено;
	Если ТипПеревозки <> Неопределено Тогда
		МассивПараметров = ТипПеревозки.ПараметрыЗаказа.Выгрузить().ВыгрузитьКолонку("Параметр");
	КонецЕсли;
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());			
	Если ГруппаПользователя.ПолныеПрава Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Параметр,
	               |	CW_ПараметрыГрузоперевозок.Идентификатор КАК Идентификатор,
	               |	ВЫБОР
	               |		КОГДА &Группа = ЗНАЧЕНИЕ(Справочник.CW_ГруппыПользователей.Администраторы)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Просмотр, ЛОЖЬ)
	               |	КОНЕЦ КАК Просмотр,
	               |	CW_ПараметрыГрузоперевозок.ТипЗначения КАК ТипЗначения
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
	               |		ПО (CW_ПраваДоступаДляПараметровМониторинга.Параметр = CW_ПараметрыГрузоперевозок.Ссылка)
	               |			И (CW_ПраваДоступаДляПараметровМониторинга.Группа = &Группа)
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.Предопределенный = ЛОЖЬ
	               |	И ВЫБОР
	               |			КОГДА &УказанТипПеревозки
	               |				ТОГДА CW_ПараметрыГрузоперевозок.Ссылка В (&МассивПараметров)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Параметр КАК Параметр,
	               |	ВТ.Идентификатор КАК Идентификатор,
	               |	ВТ.ТипЗначения КАК ТипЗначения
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	ВТ.Просмотр = ИСТИНА";
		
	Запрос.УстановитьПараметр("Группа"				, ГруппаПользователя);
	Запрос.УстановитьПараметр("УказанТипПеревозки"	, ТипПеревозки <> Неопределено);
	Запрос.УстановитьПараметр("МассивПараметров"	, МассивПараметров);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Возврат Выборка;

КонецФункции	

#КонецЕсли