//&Вместо("ПолучитьДанныеПодпискиНаОбновление")
//Функция САБ_ПолучитьДанныеПодпискиНаОбновление(Таймаут) Экспорт
//	
//	ДатаОкончания = КонецГода(ТекущаяДата());
//	
//	Результат = Новый Структура;
//	Результат.Вставить("КодСостояния", 		200);
//	Результат.Вставить("ДатаОкончания", 	ДатаОкончания);
//	Результат.Вставить("ПодпискаФормлена", 	Истина);
//	Результат.Вставить("СледующаяОформлена", Ложь);
//	Результат.Вставить("Состояние",
//		СтрШаблон("Подписка на получение обновлений действует до %1",
//			Формат(ДатаОкончания, "ДФ=dd.MM.yyyy")));
//	
//	Возврат Результат;
//	
//КонецФункции