
Процедура ЗаполнитьДействующиеПриказы() Экспорт
	
	ПриказФНС = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений;
	
	ЗаполнитьРегистрСооветствияПриложенияПоПриказу(ПриказФНС.РеестрНДС2021Кв2);
	ЗаполнитьРегистрСооветствияПриложенияПоПриказу(ПриказФНС.РеестрНДС2024Кв2);
	ЗаполнитьРегистрСооветствияПриложенияПоПриказу(ПриказФНС.РеестрНДС2025Кв2);
	ЗаполнитьРегистрСооветствияПриложенияПоПриказу(ПриказФНС.РеестрНДС2025Кв2_ЕД715_1035);
	
КонецПроцедуры

Процедура ЗаполнитьРегистрСооветствияПриложенияПоПриказу(ПриказФНС) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_РеестрыНДС0ЯчейкиПриложений.ПриложениеПоВидуТранспорта КАК ВидТранспорта
	|ИЗ
	|	ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений КАК CW_РеестрыНДС0ЯчейкиПриложений
	|ГДЕ
	|	CW_РеестрыНДС0ЯчейкиПриложений.Родитель = &ПриказФНС
	|	И CW_РеестрыНДС0ЯчейкиПриложений.ЭтоГруппа = ИСТИНА";
	
	Запрос.УстановитьПараметр("ПриказФНС", ПриказФНС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ЗаписьРегистра = РегистрыСведений.CW_РеестрыНДС0ДействующиеПриказыПоВидуТранспорта.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Период 			= ПриказФНС.ДатаНачала; 
		ЗаписьРегистра.ВидТранспорта 	= Выборка.ВидТранспорта; 
		ЗаписьРегистра.ПриказФНС 		= ПриказФНС; 
		
		ЗаписьРегистра.Прочитать();
		Если Не ЗаписьРегистра.Выбран() Тогда
			ЗаписьРегистра.Период 			= ПриказФНС.ДатаНачала; 
			ЗаписьРегистра.ВидТранспорта 	= Выборка.ВидТранспорта; 
			ЗаписьРегистра.ПриказФНС 		= ПриказФНС; 
			ЗаписьРегистра.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДействующиеПриказы(Знач НаДату=Неопределено) Экспорт   
	
	Соответствие = Новый Соответствие;
	
	Период = ?(НаДату= Неопределено, ТекущаяДата(), НаДату); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаРегистра.ВидТранспорта КАК ВидТранспорта,
	|	ТаблицаРегистра.ПриказФНС КАК ПриказФНС
	|ИЗ
	|	РегистрСведений.CW_РеестрыНДС0ДействующиеПриказыПоВидуТранспорта.СрезПоследних(&Период, ) КАК ТаблицаРегистра";
	
	Запрос.УстановитьПараметр("Период", 	Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.ВидТранспорта, Выборка.ПриказФНС);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции