&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// --- 
	
	Параметры.Свойство("ДокументСсылка", Объект.ДокументСсылка);
	_СформироватьСписокДоступных();
	_ПоказатьДвижения();
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// --- 

КонецПроцедуры

// --- 

&НаСервере
Процедура _СформироватьСписокДоступных()
	// --- 
	
	Элементы.ДокументСсылка.ВыбиратьТип = Ложь;
	Элементы.ДокументСсылка.СписокВыбора.Очистить();
	Элементы.ДокументСсылка.СписокВыбора.Добавить(Объект.ДокументСсылка);
	
	Если (CW_ПраваДоступа.ДоступныОбъектыБухгалтерии()) Тогда
		
		Если (ТипЗнч(Объект.ДокументСсылка)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
			
			// проверяем, что заполнены реквизиты
			Если (ЗначениеЗаполнено(Объект.ДокументСсылка.ВедомыйДокумент)) Тогда
				Элементы.ДокументСсылка.СписокВыбора.Добавить(Объект.ДокументСсылка.ВедомыйДокумент);
			КонецЕсли; 
			Если (ЗначениеЗаполнено(Объект.ДокументСсылка.ВедомыйСчетФактура)) Тогда
				Элементы.ДокументСсылка.СписокВыбора.Добавить(Объект.ДокументСсылка.ВедомыйСчетФактура);
			КонецЕсли; 
			
		ИначеЕсли (ТипЗнч(Объект.ДокументСсылка)=Тип("ДокументСсылка.CW_ЗакрытиеГрузоперевозки")) Тогда 
			
			// проверяем, что заполнены реквизиты
			Если (ЗначениеЗаполнено(Объект.ДокументСсылка.ВедомыйДокумент)) Тогда
				Элементы.ДокументСсылка.СписокВыбора.Добавить(Объект.ДокументСсылка.ВедомыйДокумент);
			КонецЕсли; 
			Если (ЗначениеЗаполнено(Объект.ДокументСсылка.ВедомыйСчетФактура)) Тогда
				Элементы.ДокументСсылка.СписокВыбора.Добавить(Объект.ДокументСсылка.ВедомыйСчетФактура);
			КонецЕсли; 
			
		ИначеЕсли (ТипЗнч(Объект.ДокументСсылка)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда 
			
			Если (ЗначениеЗаполнено(Объект.ДокументСсылка.ВедомыйДокумент)) Тогда
				Элементы.ДокументСсылка.СписокВыбора.Добавить(Объект.ДокументСсылка.ВедомыйДокумент);
			КонецЕсли;  
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если (Элементы.ДокументСсылка.СписокВыбора.Количество() = 1) Тогда
		Элементы.ДокументСсылка.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ДокументСсылка.КнопкаВыпадающегоСписка=Истина;
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ДокументСсылкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.ДокументСсылка = ВыбранноеЗначение;
	_ПоказатьДвижения();
	
КонецПроцедуры

&НаСервере
Процедура _ПоказатьДвижения()
	// --- 
	
	ЭтаФорма.Заголовок = "Движения документа: " + Объект.ДокументСсылка;
	Элементы.ГруппаДокумент.Заголовок = Объект.ДокументСсылка.Метаданные().Синоним;
	СформироватьСтатическиеСпискиСервер();
	
	// --- 
КонецПроцедуры
 

// --- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если (Объект.ДокументСсылка.Пустая()) Тогда Возврат; КонецЕсли;
	// ---------------------------------------------------------------------------- 
	СформироватьСтатическиеСпискиСервер();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтатическиеСпискиСервер()
	
	МассивРеквизитов = Новый Массив;
	МассивУдаляемыхРеквизитов = Новый Массив;
	ВремМассив = ЭтаФорма.ПолучитьРеквизиты();
	ВремМассив.Удалить(0);
	Для Каждого Рекв Из ВремМассив Цикл
		МассивУдаляемыхРеквизитов.Добавить(Рекв.Имя);
	КонецЦикла;
	ИзменитьРеквизиты(,МассивУдаляемыхРеквизитов);
	// --- 
	Для Каждого Движение Из Объект.ДокументСсылка.Метаданные().Движения Цикл
		
		ИмяРегистра = Движение.Имя;
		СинонимРегистра = Движение.Синоним;
		ИмяТЗ = "ТЗ_"+ИмяРегистра;
		// --- 
		Если (Метаданные.РегистрыНакопления.Индекс(Движение)>=0) Тогда 
			ВидРегистра = "Накопления"
		ИначеЕсли (Метаданные.РегистрыСведений.Индекс(Движение)>=0) Тогда 
			ВидРегистра = "Сведений"
		ИначеЕсли (Метаданные.РегистрыРасчета.Индекс(Движение)>=0) Тогда 
			ВидРегистра = "Расчета"
		ИначеЕсли (Метаданные.РегистрыБухгалтерии.Индекс(Движение)>=0) Тогда 
			ВидРегистра = "Бухгалтерии"
		КонецЕсли;
		// --- 
		РежимОстатки = Ложь; 
		Если ВидРегистра = "Накопления" Тогда
			Если Метаданные.РегистрыНакопления[имяРегистра].ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
				РежимОстатки = Истина;
			Иначе
				РежимОстатки = Ложь;
			КонецЕсли;	
		КонецЕсли;	
		Данные = ВыполнитьЗапросКРегистру(ИмяРегистра,ВидРегистра,РежимОстатки);
		// --- 
		Если Данные.Пустой() Тогда 
			Продолжить; //Если движений нет, то и выводить таблицу не будем
		КонецЕсли;	
		// --- 
		Если Элементы.Найти("Страница_"+ИмяРегистра) = Неопределено Тогда
			//Добавляем страницы
			Стр = Элементы.Добавить("Страница_"+ИмяРегистра,Тип("ГруппаФормы"),Элементы.ГруппаСтраницы);
			Стр.Заголовок = СинонимРегистра;
		КонецЕсли;
		МассивРеквизитов.Очистить();
		//Добавляем реквизиты Формы
		Тип = Новый ОписаниеТипов("ТаблицаЗначений");
		РеквизитФормы = Новый РеквизитФормы(ИмяТЗ,Тип);
		МассивРеквизитов.Добавить(РеквизитФормы);
		//Добавляем колонки таблицы
		Для Каждого ТекСтандРекв Из Движение.СтандартныеРеквизиты Цикл
			РеквизитФормы = Новый РеквизитФормы(ТекСтандРекв.Имя, ТекСтандРекв.Тип, ИмяТЗ, ТекСтандРекв.Имя);
			МассивРеквизитов.Добавить(РеквизитФормы);
		КонецЦикла;
		Для Каждого ТекИзмерение Из Движение.Измерения Цикл
			РеквизитФормы = Новый РеквизитФормы(ТекИзмерение.Имя, ТекИзмерение.Тип, ИмяТЗ, ТекИзмерение.Имя);
			МассивРеквизитов.Добавить(РеквизитФормы);
		КонецЦикла;
		Если ВидРегистра = "Бухгалтерии" Тогда
			
			// добавляем субконто
			КоличествоСубконто = Движение.ПланСчетов.МаксКоличествоСубконто;
			ТипСубконто = Движение.ПланСчетов.ВидыСубконто.Тип;
			Для Индекс=1 По КоличествоСубконто Цикл
				
				РеквизитФормы = Новый РеквизитФормы("СубконтоДт"+Строка(Индекс), ТипСубконто, ИмяТЗ, "Субконто №"+Строка(Индекс)+" (Дт)");
				МассивРеквизитов.Добавить(РеквизитФормы);
				
			КонецЦикла;
			Для Индекс=1 По КоличествоСубконто Цикл
				
				РеквизитФормы = Новый РеквизитФормы("СубконтоКт"+Строка(Индекс), ТипСубконто, ИмяТЗ, "Субконто №"+Строка(Индекс)+" (Кт)");
				МассивРеквизитов.Добавить(РеквизитФормы);
				
			КонецЦикла;
			
			РеквизитФормы = Новый РеквизитФормы(	"СчетДт", 
													Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"), 
													ИмяТЗ, 
													"Счет Дт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			
			// --- 
			
			РеквизитФормы = Новый РеквизитФормы(	"СчетКт", 
													Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"), 
													ИмяТЗ, 
													"Счет Кт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			
			// --- 
			
			РеквизитФормы = Новый РеквизитФормы(	"ВалютаДт", 
													Новый ОписаниеТипов("СправочникСсылка.Валюты"), 
													ИмяТЗ, 
													"Валюта Дт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			
			// --- 
			
			РеквизитФормы = Новый РеквизитФормы(	"ВалютаКт", 
													Новый ОписаниеТипов("СправочникСсылка.Валюты"), 
													ИмяТЗ, 
													"Валюта Кт");
			МассивРеквизитов.Добавить(РеквизитФормы);

			// --- 
			
			РеквизитФормы = Новый РеквизитФормы(	"ВалютнаяСуммаДт", 
													Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)), 
													ИмяТЗ, 
													"Валютная сумма Дт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			
			// --- 
			
			РеквизитФормы = Новый РеквизитФормы(	"ВалютнаяСуммаКт", 
													Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)), 
													ИмяТЗ, 
													"Валютная сумма Кт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			
			// --- 
			
			РеквизитФормы = Новый РеквизитФормы(	"КоличествоДт", 
													Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)), 
													ИмяТЗ, 
													"Количество Дт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			
			// --- 
			
			РеквизитФормы = Новый РеквизитФормы(	"КоличествоКт", 
													Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)), 
													ИмяТЗ, 
													"Количество Кт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			
			// ---------------------------------------------------------------------------- 
			
			РеквизитФормы = Новый РеквизитФормы(	"СуммаНУДт", 
													Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)), 
													ИмяТЗ, 
													"Сумма НУ Дт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			// --- 
			РеквизитФормы = Новый РеквизитФормы(	"СуммаНУКт", 
													Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)), 
													ИмяТЗ, 
													"Сумма НУ Кт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			// --- 
			РеквизитФормы = Новый РеквизитФормы(	"СуммаВРДт", 
													Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)), 
													ИмяТЗ, 
													"Сумма ВР Дт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			// --- 
			РеквизитФормы = Новый РеквизитФормы(	"СуммаВРКт", 
													Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)), 
													ИмяТЗ, 
													"Сумма ВР Кт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			// --- 
			РеквизитФормы = Новый РеквизитФормы(	"СуммаПРДт", 
													Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)), 
													ИмяТЗ, 
													"Сумма ПР Дт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			// --- 
			РеквизитФормы = Новый РеквизитФормы(	"СуммаПРКт", 
													Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)), 
													ИмяТЗ, 
													"Сумма ПР Кт");
			МассивРеквизитов.Добавить(РеквизитФормы);
			
			
		КонецЕсли;
		Для Каждого ТекРесурс Из Движение.Ресурсы Цикл
			РеквизитФормы = Новый РеквизитФормы(ТекРесурс.Имя, ТекРесурс.Тип, ИмяТЗ, ТекРесурс.Имя);
			МассивРеквизитов.Добавить(РеквизитФормы);
		КонецЦикла;
		Для Каждого ТекРеквизит Из Движение.Реквизиты Цикл
			РеквизитФормы = Новый РеквизитФормы(ТекРеквизит.Имя, ТекРеквизит.Тип, ИмяТЗ, ТекРеквизит.Имя);
			МассивРеквизитов.Добавить(РеквизитФормы);
		КонецЦикла;
		 
		ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(1,0));
		РеквизитФормы = Новый РеквизитФормы("КодКартинки", ОписаниеТиповЧисло, ИмяТЗ, "");
		МассивРеквизитов.Добавить(РеквизитФормы);
		
		ИзменитьРеквизиты(МассивРеквизитов);
		ТЗ = Данные.Выгрузить();
		Попытка
			ТЗ.Сортировать("НомерСтроки Возр");
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		ЭтаФорма[ИмяТЗ].Загрузить(ТЗ);
		
	КонецЦикла;
	
	Для Каждого Рекв Из МассивУдаляемыхРеквизитов Цикл
		Если (Элементы.Найти(Рекв) <> Неопределено) Тогда
			Элементы.Удалить(Элементы[Рекв]);
		КонецЕсли;	
	КонецЦикла;
	МассивТекущихРеквизитов = Новый Массив;
	ВремМассив = ЭтаФорма.ПолучитьРеквизиты();
	Для Каждого Рекв Из ВремМассив Цикл
		МассивТекущихРеквизитов.Добавить(Рекв.Имя);
	КонецЦикла;
	// --- 
	Для Каждого Движение Из Объект.ДокументСсылка.Метаданные().Движения Цикл
		
		ИмяРегистра = Движение.Имя;	
		СинонимРегистра = Движение.Синоним; 
		ИмяТЗ = "ТЗ_"+ИмяРегистра;
		// --- 
		Если (Метаданные.РегистрыНакопления.Индекс(Движение)>=0) Тогда 
			ВидРегистра = "Накопления"
		ИначеЕсли (Метаданные.РегистрыСведений.Индекс(Движение)>=0) Тогда 
			ВидРегистра = "Сведений"
		ИначеЕсли (Метаданные.РегистрыРасчета.Индекс(Движение)>=0) Тогда 
			ВидРегистра = "Расчета"
		ИначеЕсли (Метаданные.РегистрыБухгалтерии.Индекс(Движение)>=0) Тогда 
			ВидРегистра = "Бухгалтерии"
		КонецЕсли;
		// --- 
		Если (МассивТекущихРеквизитов.Найти(ИмяТЗ) = Неопределено) Тогда Продолжить; КонецЕсли;	
		// --- 
		ТекСтраница = Элементы.Найти("Страница_"+ИмяРегистра);
		ТекСтраница.Заголовок = СинонимРегистра + " (" + ЭтаФорма[ИмяТЗ].Количество()+")";
		// --- 
		КартинкаСтрок = Неопределено;
		Если (Метаданные.РегистрыНакопления.Индекс(Движение)>=0)	Тогда 
			Картинка = БиблиотекаКартинок.РегистрНакопления;
			КартинкаСтрок = БиблиотекаКартинок.CW_ДвиженияРегистров;
		ИначеЕсли (Метаданные.РегистрыСведений.Индекс(Движение)>=0) Тогда 
			Картинка = БиблиотекаКартинок.РегистрСведений;
			КартинкаСтрок = БиблиотекаКартинок.CW_ДвиженияРегистров;
		ИначеЕсли (Метаданные.РегистрыРасчета.Индекс(Движение)>=0) Тогда 
			Картинка = БиблиотекаКартинок.РегистрРасчета;
		ИначеЕсли (Метаданные.РегистрыБухгалтерии.Индекс(Движение)>=0) Тогда 
			Картинка = БиблиотекаКартинок.ПланСчетов;
		КонецЕсли;    
		ТекСтраница.Картинка = Картинка;
		// --- 
		ТаблицаФормы = Элементы.Добавить(ИмяТЗ,Тип("ТаблицаФормы"),ТекСтраница);
		ТаблицаФормы.ПутьКДанным = ИмяТЗ;
		ТаблицаФормы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ТаблицаФормы.ТолькоПросмотр = Истина;
		ТаблицаФормы.ЧередованиеЦветовСтрок = Истина;
		ТаблицаФормы.РежимВыделенияСтроки = РежимВыделенияСтрокиТаблицы.Строка;
		Если (КартинкаСтрок <> Неопределено) Тогда
			
			ТаблицаФормы.КартинкаСтрок = КартинкаСтрок;
			ТаблицаФормы.ПутьКДаннымКартинкиСтроки = ИмяТЗ+".КодКартинки";
		
		КонецЕсли; 
		
		// РЕГИСТР БУХГАЛТЕРИИ
		// ---------------------------------------------------------------------------- 
		Если (ВидРегистра = "Бухгалтерии" И ИмяРегистра = "Хозрасчетный") Тогда
			
			ГруппаПериод = Элементы.Добавить(ИмяТЗ+"ГруппаПериод",Тип("ГруппаФормы"),Элементы[ИмяТЗ]);
			ГруппаПериод.Вид=ВидГруппыФормы.ГруппаКолонок;
			
			//Период 
			Колонка = Элементы.Добавить(ИмяТЗ+"Период",Тип("ПолеФормы"),ГруппаПериод);
			Колонка.Заголовок = "Период";
			Колонка.ПутьКДанным = ИмяТЗ+".Период";
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			
			//НомерСтроки
			Колонка = Элементы.Добавить(ИмяТЗ+"НомерСтроки",Тип("ПолеФормы"),ГруппаПериод);
			Колонка.Заголовок = "№";
			Колонка.Вид = ВидПоляФормы.ПолеВвода; 
			Колонка.ПутьКДанным = ИмяТЗ+".НомерСтроки";
			
			// организация
			Колонка = Элементы.Добавить(ИмяТЗ+"Организация",Тип("ПолеФормы"),Элементы[ИмяТЗ]);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"Организация";
			
			// ---------------------------------------------------------------------------- 
			
			// СчетДт
			Колонка = Элементы.Добавить(ИмяТЗ+"СчетДт",Тип("ПолеФормы"),Элементы[ИмяТЗ]);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СчетДт";
			Колонка.Шрифт = Новый Шрифт(Колонка.Шрифт,,,Истина);
			Колонка.ШрифтЗаголовка = Новый Шрифт(Колонка.ШрифтЗаголовка,,,Истина);

			// группа "Аналитика ДТ"
			
			ГруппаАналитикаДт = Элементы.Добавить(ИмяТЗ+"ГруппаАналитикаДт",Тип("ГруппаФормы"),Элементы[ИмяТЗ]);
			ГруппаАналитикаДт.Вид=ВидГруппыФормы.ГруппаКолонок;
			
			// субконто Дт
			Колонка = Элементы.Добавить(ИмяТЗ+"СубконтоДт1",Тип("ПолеФормы"),ГруппаАналитикаДт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СубконтоДт1";
			Колонка = Элементы.Добавить(ИмяТЗ+"СубконтоДт2",Тип("ПолеФормы"),ГруппаАналитикаДт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СубконтоДт2";
			Колонка = Элементы.Добавить(ИмяТЗ+"СубконтоДт3",Тип("ПолеФормы"),ГруппаАналитикаДт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СубконтоДт3";

			ГруппаДт = Элементы.Добавить(ИмяТЗ+"ГруппаДт",Тип("ГруппаФормы"),Элементы[ИмяТЗ]);
			ГруппаДт.Вид=ВидГруппыФормы.ГруппаКолонок;

			// количество
			Колонка = Элементы.Добавить(ИмяТЗ+"КоличествоДт",Тип("ПолеФормы"),ГруппаДт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"КоличествоДт";
			// валюта
			Колонка = Элементы.Добавить(ИмяТЗ+"ВалютаДт",Тип("ПолеФормы"),ГруппаДт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"ВалютаДт";
			// валютная сумма
			Колонка = Элементы.Добавить(ИмяТЗ+"ВалютнаяСуммаДт",Тип("ПолеФормы"),ГруппаДт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"ВалютнаяСуммаДт";
			
			// ---------------------------------------------------------------------------- 
			
			// СчетКт
			Колонка = Элементы.Добавить(ИмяТЗ+"СчетКт",Тип("ПолеФормы"),Элементы[ИмяТЗ]);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СчетКт";
			Колонка.Шрифт = Новый Шрифт(Колонка.Шрифт,,,Истина);
			Колонка.ШрифтЗаголовка = Новый Шрифт(Колонка.ШрифтЗаголовка,,,Истина);

			// группа "Аналитика ДТ"
			
			ГруппаАналитикаКт = Элементы.Добавить(ИмяТЗ+"ГруппаАналитикаКт",Тип("ГруппаФормы"),Элементы[ИмяТЗ]);
			ГруппаАналитикаКт.Вид=ВидГруппыФормы.ГруппаКолонок;
			
			// субконто Кт
			Колонка = Элементы.Добавить(ИмяТЗ+"СубконтоКт1",Тип("ПолеФормы"),ГруппаАналитикаКт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СубконтоКт1";
			Колонка = Элементы.Добавить(ИмяТЗ+"СубконтоКт2",Тип("ПолеФормы"),ГруппаАналитикаКт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СубконтоКт2";
			Колонка = Элементы.Добавить(ИмяТЗ+"СубконтоКт3",Тип("ПолеФормы"),ГруппаАналитикаКт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СубконтоКт3";

			ГруппаКт = Элементы.Добавить(ИмяТЗ+"ГруппаКт",Тип("ГруппаФормы"),Элементы[ИмяТЗ]);
			ГруппаКт.Вид=ВидГруппыФормы.ГруппаКолонок;

			// количество
			Колонка = Элементы.Добавить(ИмяТЗ+"КоличествоКт",Тип("ПолеФормы"),ГруппаКт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"КоличествоКт";
			// валюта
			Колонка = Элементы.Добавить(ИмяТЗ+"ВалютаКт",Тип("ПолеФормы"),ГруппаКт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"ВалютаКт";
			// валютная сумма
			Колонка = Элементы.Добавить(ИмяТЗ+"ВалютнаяСуммаКт",Тип("ПолеФормы"),ГруппаКт);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"ВалютнаяСуммаКт";

			// ---------------------------------------------------------------------------- 
			
			ГруппаСумма = Элементы.Добавить(ИмяТЗ+"ГруппаСумма",Тип("ГруппаФормы"),Элементы[ИмяТЗ]);
			ГруппаСумма.Вид = ВидГруппыФормы.ГруппаКолонок;
			
			ГруппаПоказатели = Элементы.Добавить(ИмяТЗ+"ГруппаПоказатели",Тип("ГруппаФормы"),ГруппаСумма);
			ГруппаПоказатели.Вид = ВидГруппыФормы.ГруппаКолонок;
			ГруппаПоказатели.Группировка = ГруппировкаКолонок.Горизонтальная;
			
			// сумма
			Колонка = Элементы.Добавить(ИмяТЗ+"Сумма",Тип("ПолеФормы"),ГруппаПоказатели);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"Сумма";
			Колонка.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Лево;
			Колонка.Шрифт = Новый Шрифт(Колонка.Шрифт,,,Истина);
			Колонка.ШрифтЗаголовка = Новый Шрифт(Колонка.ШрифтЗаголовка,,,Истина);
			// --- 
			
			ГруппаПоказателиДт = Элементы.Добавить(ИмяТЗ+"ГруппаПоказателиДт",Тип("ГруппаФормы"),Элементы[ИмяТЗ]);
			ГруппаПоказателиДт.Вид = ВидГруппыФормы.ГруппаКолонок;
			// --- 
			ГруппаПоказателиКт = Элементы.Добавить(ИмяТЗ+"ГруппаПоказателиКт",Тип("ГруппаФормы"),Элементы[ИмяТЗ]);
			ГруппаПоказателиКт.Вид = ВидГруппыФормы.ГруппаКолонок;
			
			// СуммаНУ
			// ---------------------------------------------------------------------------- 
			Колонка = Элементы.Добавить(ИмяТЗ+"СуммаНУДт",Тип("ПолеФормы"),ГруппаПоказателиДт);
			Колонка.Заголовок = "НУ (Дт)";
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СуммаНУДт";
			Колонка.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Лево;
			// --- 
			Колонка = Элементы.Добавить(ИмяТЗ+"СуммаНУКт",Тип("ПолеФормы"),ГруппаПоказателиКт);
			Колонка.Заголовок = "НУ (Кт)";
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СуммаНУКт";
			Колонка.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Лево;
			
			// СуммаПР
			// ---------------------------------------------------------------------------- 
			Колонка = Элементы.Добавить(ИмяТЗ+"СуммаПРДт",Тип("ПолеФормы"),ГруппаПоказателиДт);
			Колонка.Заголовок = "ПР (Дт)";
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СуммаПРДт";
			Колонка.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Лево;
			// --- 
			Колонка = Элементы.Добавить(ИмяТЗ+"СуммаПРКт",Тип("ПолеФормы"),ГруппаПоказателиКт);
			Колонка.Заголовок = "ПР (Кт)";
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СуммаПРКт";
			Колонка.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Лево;
			
			// СуммаВР
			// ---------------------------------------------------------------------------- 
			Колонка = Элементы.Добавить(ИмяТЗ+"СуммаВРДт",Тип("ПолеФормы"),ГруппаПоказателиДт);
			Колонка.Заголовок = "ВР (Дт)";
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СуммаВРДт";
			Колонка.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Лево;
			// --- 
			Колонка = Элементы.Добавить(ИмяТЗ+"СуммаВРКт",Тип("ПолеФормы"),ГруппаПоказателиКт);
			Колонка.Заголовок = "ВР (Кт)";
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"СуммаВРКт";
			Колонка.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Лево;
			
			// содержание
			Колонка = Элементы.Добавить(ИмяТЗ+"Содержание",Тип("ПолеФормы"),ГруппаСумма);
			Колонка.Вид = ВидПоляФормы.ПолеВвода;
			Колонка.ПутьКДанным = ИмяТЗ+"."+"Содержание";
			
		КонецЕсли;
		
		// ОСТАЛЬНЫЕ
		// ---------------------------------------------------------------------------- 
		Если (ВидРегистра <> "Бухгалтерии") Тогда
			
			ПериодЕсть = Истина;
			Если (Метаданные.РегистрыСведений.Индекс(Движение)>=0) Тогда
				Если (Движение.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический) Тогда
					ПериодЕсть = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если (ПериодЕсть) Тогда
				//Период 
				Колонка = Элементы.Добавить(ИмяТЗ+"Период",Тип("ПолеФормы"),Элементы[ИмяТЗ]);
				Колонка.Заголовок = "Период";
				Колонка.ПутьКДанным = ИмяТЗ+".Период";
				Колонка.Вид = ВидПоляФормы.ПолеВвода;
			КонецЕсли;	
			//Регистратор
			Колонка = Элементы.Добавить(ИмяТЗ+"Регистратор",Тип("ПолеФормы"),Элементы[ИмяТЗ]);
			Колонка.Вид = ВидПоляФормы.ПолеВвода; 
			Колонка.ПутьКДанным = ИмяТЗ+".Регистратор";
			//НомерСтроки
			Колонка = Элементы.Добавить(ИмяТЗ+"НомерСтроки",Тип("ПолеФормы"),Элементы[ИмяТЗ]);
			Колонка.Вид = ВидПоляФормы.ПолеВвода; 
			Колонка.Заголовок = "№";
			Колонка.Ширина=1;
			Колонка.ПутьКДанным = ИмяТЗ+".НомерСтроки";
			// --- 
			Для Каждого ТекИзмерение Из Движение.Измерения Цикл
				Колонка = Элементы.Добавить(ИмяТЗ+ТекИзмерение.Имя,Тип("ПолеФормы"),Элементы[ИмяТЗ]);
				Колонка.Вид = ВидПоляФормы.ПолеВвода;
				Колонка.Заголовок = ТекИзмерение.Синоним;
				Колонка.ПутьКДанным = ИмяТЗ+"."+ТекИзмерение.Имя;
			КонецЦикла;
			Для Каждого ТекРесурс Из Движение.Ресурсы Цикл
				Эл = Элементы.Добавить(ИмяТЗ+ТекРесурс.Имя,Тип("ПолеФормы"),Элементы[ИмяТЗ]);
				Эл.Вид = ВидПоляФормы.ПолеВвода;
				Эл.Заголовок = ТекРесурс.Синоним;
				Эл.ПутьКДанным = ИмяТЗ+"."+ТекРесурс.Имя;
			КонецЦикла;
			Для Каждого ТекРеквизит Из Движение.Реквизиты Цикл
				Колонка = Элементы.Добавить(ИмяТЗ+ТекРеквизит.Имя,Тип("ПолеФормы"),Элементы[ИмяТЗ]);
				Колонка.Вид = ВидПоляФормы.ПолеВвода;
				Колонка.Заголовок = ТекРеквизит.Синоним;
				Колонка.ПутьКДанным = ИмяТЗ+"."+ТекРеквизит.Имя;
			КонецЦикла;
			// --- 
			Элементы[ИмяТЗ].ПодчиненныеЭлементы[ИмяТЗ+"Регистратор"].Видимость = Ложь;
			
		КонецЕсли; 
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ВыполнитьЗапросКРегистру(Знач ИмяРегистра,Знач ВидРегистра,Знач РежимОстатки)
	
	Запрос = Новый Запрос;
	Если (ВидРегистра = "Накопления") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	*,";
		Если (РежимОстатки) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	ВЫБОР
			|		Когда ВидДвижения = Значение(ВидДвиженияНакопления.Приход)
			|			Тогда 1
			|		Иначе 2
			|	Конец Как КодКартинки";
		Иначе
			Запрос.Текст = Запрос.Текст + "
			|	0 Как КодКартинки";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	Регистр"+ВидРегистра+"."+ИмяРегистра+"
		|ГДЕ
		|	Регистратор = &Регистратор"; 
		
	ИначеЕсли (ВидРегистра = "Сведений") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	Регистр"+ВидРегистра+"."+ИмяРегистра+"
		|ГДЕ
		|	Регистратор = &Регистратор";
		
	ИначеЕсли ВидРегистра = "Бухгалтерии" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	Регистр"+ВидРегистра+"."+ИмяРегистра+".ДвиженияССубконто(, , Регистратор = &Регистратор, , )";
        		
	КонецЕсли;	
	Запрос.УстановитьПараметр("Регистратор",Объект.ДокументСсылка);
	// --- 
	Возврат(Запрос.Выполнить());
	
КонецФункции	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОтображениеСтраниц(Команда)
	
	Если (Элементы.ГруппаСтраницы.ОтображениеСтраниц=ОтображениеСтраницФормы.ЗакладкиСверху) Тогда
		
		Элементы.ГруппаСтраницы.ОтображениеСтраниц=ОтображениеСтраницФормы.ЗакладкиСлеваГоризонтально;
		
	Иначе
		
		Элементы.ГруппаСтраницы.ОтображениеСтраниц=ОтображениеСтраницФормы.ЗакладкиСверху
		
	КонецЕсли; 
	
КонецПроцедуры


