
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// --- 
	Для каждого КлючЗначение Из Параметры.СтруктураНастройки Цикл
		
		ЭтаФорма[КлючЗначение.Ключ] = Параметры.СтруктураНастройки[КлючЗначение.Ключ];
		
	КонецЦикла; 
	// --- 
	
	Элементы.ГруппаОтбор.Видимость = Отбор;
	Элементы.ГруппаОтборПоСтатусам.Видимость = ОтборПоСтатусам;
	Элементы.ГруппаОтборПоФинансовымСтатусам.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок") И ОтборПоФинансовымСтатусам;
	Элементы.ГруппаИнформация.Видимость = ЕстьИнформация;
	
	// --- 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаВосстановитьТекущую(Команда)
	
	ЭтаФорма.Закрыть(Новый Структура("Действие","Восстановить"));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьНастройку(Команда)
	
	ЭтаФорма.Закрыть(Новый Структура("Действие","Выбрать"));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьНастройку(Команда)
	
	ЭтаФорма.Закрыть(Новый Структура("Действие","Создать"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ФормаКомандаВосстановитьТекущую;

КонецПроцедуры
