
&НаКлиенте
Процедура КомандаУстановить(Команда)
	
	Если КоличествоВыделенных > 1 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		
		ПоказатьВопрос(Оповещение, "Указанные значения будут установлены для всех выбранных документов. Продолжить?", Режим, 0);
		
	Иначе
		
		ПродолжитьВыполнениеКоманды();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыполнениеКоманды()
	
	СтруктураВозврата = Новый Структура("ОригиналыПредоставлены,ДатаВозврата,ПересчитатьСрокОплаты",ОригиналыПредоставлены,ДатаВозврата,ПересчитатьСрокОплаты);
	ЭтаФорма.Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЭтаФорма.Закрыть();
        Возврат;
	КонецЕсли;
	
	ПродолжитьВыполнениеКоманды();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПересчитатьСрокОплаты 	= Истина;
	
	Параметры.Свойство("ОригиналыПредоставлены"	, ОригиналыПредоставлены);
	Параметры.Свойство("ДатаВозврата"			, ДатаВозврата);
	Параметры.Свойство("КоличествоВыделенных"	, КоличествоВыделенных);
	
	КоличествоДокументовСтр = "Выбарно "+Формат(КоличествоВыделенных,"ЧГ=0") + " документа(ов)";
	Элементы.КоличествоДокументовСтр.Видимость = КоличествоВыделенных > 1;
	
	УстановитьВидимостьДаты();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОригиналыПредоставленыПриИзменении(Элемент)
	
	ДатаВозврата = ?(ОригиналыПредоставлены,ТекущаяДата(), Неопределено);
	УстановитьВидимостьДаты();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДаты()
	
	Элементы.ДатаВозврата.Видимость = ОригиналыПредоставлены;
	
КонецПроцедуры
