
Функция ПолучитьФИОИнициатора(Объект) Экспорт
	
	Возврат ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Объект.Инициатор.ФизическоеЛицо);
	
КонецФункции

Процедура УведомитьОСобытииСогласования(Знач Объект, Знач мПолучатели, Знач Инициатор, ОповеститьПользователей = Ложь, УведомитьИнициатора = Ложь, Знач УчетнаяЗапись, АдресРезультата) Экспорт
	
	мПисьма = Новый Массив;
	Ответ	= Неопределено;
	
	МодульРаботаСПочтовымиСообщениями = CW_ОбщегоНазначения.ОбщийМодуль("РаботаСПочтовымиСообщениями");
	
	Если МодульРаботаСПочтовымиСообщениями = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтправки = CW_РаботаСЭлектроннойПочтой.ПараметрыОтправкиПисьма();
	
	Если ОповеститьПользователей И мПолучатели.Количество() > 0 Тогда
		СоздатьНовоеПисьмоСогласования(Объект, мПолучатели, ПараметрыОтправки, мПисьма, УчетнаяЗапись, МодульРаботаСПочтовымиСообщениями);
	КонецЕсли;
	
	Если УведомитьИнициатора и ЗначениеЗаполнено(Инициатор) Тогда
		СоздатьНовоеПисьмоИнициатору(Объект, Инициатор, ПараметрыОтправки, мПисьма, УчетнаяЗапись, МодульРаботаСПочтовымиСообщениями);
	КонецЕсли;
	
	Если мПисьма.Количество() <> 0 Тогда
		Ответ = Новый Структура;
		Ответ.Вставить("КоличствоПисем", 			мПисьма.Количество());
		Ответ.Вставить("ЕстьОшибочныеПолучатели", 	Ложь);
		
		РезультатыОтправкиПисем = МодульРаботаСПочтовымиСообщениями.ОтправитьПисьма(УчетнаяЗапись, мПисьма);
		Для Каждого ЗначениеКлюч из РезультатыОтправкиПисем Цикл
			ОшибочныеПолучатели = ЗначениеКлюч.Значение.ОшибочныеПолучатели;
			Для Каждого ЗначениеКлюч из ОшибочныеПолучатели Цикл
				ЗаписьЖурналаРегистрации("СогласованиеДоговоров.УведомитьОСобытииСогласования",УровеньЖурналаРегистрации.Информация,,ЗначениеКлюч.Значение);
				Ответ.Вставить("ЕстьОшибочныеПолучатели", Истина);
			КонецЦикла;                                 
		КонецЦикла;
	КонецЕсли;
		
	ПоместитьВоВременноеХранилище(Ответ, АдресРезультата);
	
КонецПроцедуры

Процедура СоздатьНовоеПисьмоИнициатору(Знач Объект, ИсточникКонтактнойИнформации, ПараметрыПисьма, мПисьма, УчетнаяЗапись, МодульРаботаСПочтовымиСообщениями)

	Если ТипЗнч(ИсточникКонтактнойИнформации) = Тип("СправочникСсылка.Пользователи") Тогда
		Если ЗначениеЗаполнено(ИсточникКонтактнойИнформации.ФизическоеЛицо) Тогда
			ДанныеФизическогоЛица = ФизическиеЛицаКлиентСервер.ЧастиИмени(ИсточникКонтактнойИнформации.ФизическоеЛицо);
			
			Фамилия 		= ДанныеФизическогоЛица.Фамилия;
			Имя 			= ДанныеФизическогоЛица.Имя;
			Отчество 		= ДанныеФизическогоЛица.Отчество;
			СтрокаОбращение = Имя + " "+ Отчество;
		Иначе
			СтрокаОбращение = СокрЛП(ИсточникКонтактнойИнформации);
		КонецЕсли;
	Иначе 
		СтрокаОбращение = СокрЛП(ИсточникКонтактнойИнформации);
	КонецЕсли;
	
	АдресПочты 		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ИсточникКонтактнойИнформации, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailПользователя"),,Истина);		
	ДанныеПисьма 	= ПолучитьДанныеПисьмаИнициатору(Объект, СтрокаОбращение);
	
	Получатель = Новый Массив;
	Получатель.Добавить(Новый Структура("Адрес, Представление, ИсточникКонтактнойИнформации", АдресПочты, СтрЗаменить(Строка(ИсточникКонтактнойИнформации), ",", ""), ИсточникКонтактнойИнформации));
	
	ПараметрыПисьма.Вставить("Тема", ДанныеПисьма.Тема);
	ПараметрыПисьма.Вставить("Тело", ДанныеПисьма.Текст);
	ПараметрыПисьма.Вставить("Кому", Получатель);
	
	Письмо = МодульРаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыПисьма);
	мПисьма.Добавить(Письмо);
	
	
КонецПроцедуры

Процедура СоздатьНовоеПисьмоСогласования(Знач Объект, мФизическиеЛица, ПараметрыПисьма, мПисьма, УчетнаяЗапись, МодульРаботаСПочтовымиСообщениями)

	Для каждого ИсточникКонтактнойИнформации из мФизическиеЛица Цикл
		
		Если ТипЗнч(ИсточникКонтактнойИнформации) = Тип("СправочникСсылка.Пользователи") Тогда
			Если ЗначениеЗаполнено(ИсточникКонтактнойИнформации.ФизическоеЛицо) Тогда
				ДанныеФизическогоЛица = ФизическиеЛицаКлиентСервер.ЧастиИмени(ИсточникКонтактнойИнформации.ФизическоеЛицо);
				
				Фамилия 		= ДанныеФизическогоЛица.Фамилия;
				Имя 			= ДанныеФизическогоЛица.Имя;
				Отчество 		= ДанныеФизическогоЛица.Отчество;
				СтрокаОбращение = Имя + " "+ Отчество;
			Иначе
				СтрокаОбращение = СокрЛП(ИсточникКонтактнойИнформации);
			КонецЕсли;
		Иначе 
			СтрокаОбращение = СокрЛП(ИсточникКонтактнойИнформации);
		КонецЕсли;
		
		АдресПочты 		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ИсточникКонтактнойИнформации, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailПользователя"),,Истина);		
		ДанныеПисьма 	= ПолучитьДанныеПисьмаСогласования(Объект, СтрокаОбращение);
		
		Получатель = Новый Массив;
		Получатель.Добавить(Новый Структура("Адрес, Представление, ИсточникКонтактнойИнформации", АдресПочты, СтрЗаменить(Строка(ИсточникКонтактнойИнформации), ",", ""), ИсточникКонтактнойИнформации));
		
		ПараметрыПисьма.Вставить("Тема", ДанныеПисьма.Тема);
		ПараметрыПисьма.Вставить("Тело", ДанныеПисьма.Текст);
		ПараметрыПисьма.Вставить("Кому", Получатель);
		
		Письмо = МодульРаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыПисьма);
		мПисьма.Добавить(Письмо);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеПисьмаИнициатору(Знач ЭтапСогласования, СтрокаОбращение) Экспорт
	
	Результат 			= Новый Структура;
	ДобавитьДоговор 	= Ложь;
	ОбъектСогласования 	= ЭтапСогласования.ОбъектСогласования;
	Тема 				= "Согласование ";
	
	Если ТипЗнч(ОбъектСогласования) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		Тема = Тема + " договора "+ Строка(ОбъектСогласования);	
	ИначеЕсли  ТипЗнч(ОбъектСогласования) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
		Тема = Тема + " приложения "+Строка(ОбъектСогласования)+" к договору "+ Строка(ОбъектСогласования.Договор);	
		ДобавитьДоговор = Истина;
	Иначе
		Тема = Тема + " документа";	
	КонецЕсли;
	
	Результат.Вставить("Тема", Тема); ;
	
	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.Добавить("Добрый день"+ ?(ЗначениеЗаполнено(СтрокаОбращение), ", "+СтрокаОбращение, "") +".");
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить("Документ "+Строка(ОбъектСогласования.Ссылка));
	Если ДобавитьДоговор Тогда
		ФорматированныйДокумент.Добавить(" к договору "+Строка(ОбъектСогласования.Договор));
	КонецЕсли;
	
	ЭлементДокумента = ФорматированныйДокумент.Добавить("Переведен в состояние: "		+ ЭтапСогласования.СостояниеСогласования);
	ЭлементДокумента.Шрифт = Новый Шрифт(, , Истина);
	
	
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить("-");
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить("С уважением, "+ CW_Согласование.ПолучитьФИОИнициатора(ЭтапСогласования));

	Результат.Вставить("Текст", ФорматированныйДокумент);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеПисьмаСогласования(Знач ЭтапСогласования, СтрокаОбращение = "") Экспорт
	
	Результат 			= Новый Структура;
	ОбъектСогласования 	= ЭтапСогласования.ОбъектСогласования;
	
	Если ТипЗнч(ОбъектСогласования) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		Тема = "Согласование договора "+ОбъектСогласования;	
		
		Контрагент = ОбъектСогласования.Владелец;
		ВидДоговора = ОбъектСогласования.ВидДоговора;
		
	ИначеЕсли  ТипЗнч(ОбъектСогласования) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
		Тема = "Согласование приложения "+ОбъектСогласования+" к договору "+ОбъектСогласования.Договор;	
		
		Контрагент = ОбъектСогласования.Договор.Владелец;
		ВидДоговора = ОбъектСогласования.Договор.ВидДоговора;
		
	Иначе
		Тема = "Согласование документа";	
	КонецЕсли;
	
	Результат.Вставить("Тема", Тема); ;
	
	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.Добавить("Здравствуйте!");
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить("Вам назначена задача согласования документа: "+Строка(ОбъектСогласования.Ссылка));
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить("Контрагент: "+ Контрагент);
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить("Вид договора: "+ ВидДоговора);
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить("Управление инициатор документа: ");
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить("Инициатор: " + CW_Согласование.ПолучитьФИОИнициатора(ЭтапСогласования));
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить("Срок исполнения: " + Формат(ЭтапСогласования.ПлановаяДатаЗавершения,"ДЛФ=D"));
	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить("Примечания исполнителя: " + Строка(ЭтапСогласования.Комментарий));

	ФорматированныйДокумент.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Добавить("Пожалуйста, ознакомьтесь с задачей согласования, и завершите её.");
	
	Результат.Вставить("Текст", ФорматированныйДокумент);
	
	Возврат Результат;
	
КонецФункции

