
&НаСервере
Процедура VMS_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ЗаполнениеНовыхРеквизитов = новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МодификаторОбработкиЖурнала","VMS_CW_ЖурналГрузоперевозок.%");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработкиКоманды.Ссылка КАК Ссылка,
	|	ДополнительныеОтчетыИОбработкиКоманды.Представление КАК Представление,
	|	ДополнительныеОтчетыИОбработкиКоманды.Модификатор КАК Модификатор
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
	|ГДЕ
	|	ДополнительныеОтчетыИОбработкиКоманды.Модификатор ПОДОБНО &МодификаторОбработкиЖурнала
	|ИТОГИ ПО
	|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаОбработка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОбработка.Следующий() цикл			
		//УИД_Обработки = VMS_Сервер.ПодключитьВнешнююОбработку(ВыборкаОбработка.Ссылка);		
		//ИмяОбработки = ДополнительныеОтчетыИОбработки.ПодключитьВнешнююОбработку(Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ВыборкаОбработка.Ссылка));		
				
		ВнешняяОбработка = VMS_Сервер.ПолучитьОбработку(ВыборкаОбработка.Ссылка);
		ВДЗ = ВыборкаОбработка.Выбрать();
		Пока ВДЗ.Следующий() Цикл
			МассивПутиКоманды = СтрРазделить(ВДЗ.Модификатор,".",Ложь);
			Если МассивПутиКоманды.Количество() <> 3 тогда
				Сообщить(СтрШаблон("Не удалось подключить команду %1, обработки %2: неверный модификатор",ВДЗ.Представление,ВДЗ.Ссылка)) 	
			КонецЕсли;
			ЭлементРодитель = Элементы.Найти(МассивПутиКоманды[1]);
			Если ЭлементРодитель = Неопределено тогда 
				Сообщить(СтрШаблон("Не удалось подключить команду %1, обработки %2: не найдена группа команд на форме",ВДЗ.Представление,ВДЗ.Ссылка)) 	
			КонецЕсли;

			Попытка				
			
				ИмяНовойКоманды = МассивПутиКоманды[2];
							
				Реквизит_ТекущийОстаток = Новый РеквизитФормы("VMS_КодВыполнения_"+ИмяНовойКоманды, Новый ОписаниеТипов("Строка",,,,новый КвалификаторыСтроки));	
				ДобавляемыеРеквизиты.Добавить(Реквизит_ТекущийОстаток);			
				ЗаполнениеНовыхРеквизитов.Вставить("VMS_КодВыполнения_"+ИмяНовойКоманды,ВнешняяОбработка.ПолучитьКодВыполнения(ИмяНовойКоманды));
				
				Команда		= ЭтаФорма.Команды.Добавить(ИмяНовойКоманды);
				Команда.Действие	= "VMS_ДополнительнаяКоманада";
				Команда.Подсказка	= ВДЗ.Представление;

				Кнопка		= ЭтаФорма.Элементы.Добавить(ИмяНовойКоманды, Тип("КнопкаФормы"), ЭлементРодитель);
				Кнопка.Заголовок	= ВДЗ.Представление;
				Кнопка.ИмяКоманды	= ИмяНовойКоманды;	
				
				Попытка												
					Кнопка.Картинка = ВнешняяОбработка.ПолучитьКартинку(ИмяНовойКоманды);					
					Кнопка.Отображение = ОтображениеКнопки.Картинка;	
				Исключение
				
				КонецПопытки;  
			Исключение
			    Сообщить(СтрШаблон("Не удалось подключить команду %1, обработки %2: %3",ВДЗ.Представление,ВДЗ.Ссылка,ОписаниеОшибки()));
			КонецПопытки; 
			
			
		КонецЦикла;
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ЗаполнениеНовыхРеквизитов);
КонецПроцедуры


&НаКлиенте
Процедура VMS_ДополнительнаяКоманада(Команда)
	КодВыполненияКоманды = ЭтотОбъект["VMS_КодВыполнения_"+Команда.Имя];
	Выполнить КодВыполненияКоманды;			
КонецПроцедуры
