
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	Порт		= 80;
//	КодСостояния = СделатьШагНаСервере();
	УстановитьВидимостьЭлементов(200);
	
КонецПроцедуры

&НаКлиенте
Процедура ШагНазад(Команда)
	ТекущийШаг = ТекущийШаг - 1;
	УстановитьВидимостьЭлементов(200);
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьЭлементов(КодСостояния)

	//Кнопки
	Элементы.ФормаШагНазад.Видимость			= ТекущийШаг  	> 0;
	Элементы.ФормаПродолжить.Видимость			= ТекущийШаг  	< 5;
	Элементы.ФормаОтменаПодключения.Видимость	= ТекущийШаг 	< 6;
	Элементы.ФормаПодклчюить.Видимость 			= ТекущийШаг 	= 5;
	
	Если КодСостояния = 200 Тогда
		Если ТекущийШаг  = 0 или ТекущийШаг  = 1 Тогда
			ТекущаяСтраница = Элементы.СтраницаВводЭлектронногоАдреса;
		ИначеЕсли ТекущийШаг  = 2 Тогда
			ТекущаяСтраница = Элементы.СтраницаВводПинкода;
		ИначеЕсли ТекущийШаг  = 3 Тогда
			ТекущаяСтраница = Элементы.СтраницаПараметрыПодключения;
		ИначеЕсли ТекущийШаг  = 4 Тогда
			ТекущаяСтраница = Элементы.СтраницаИнформацияОКомпании;
		ИначеЕсли ТекущийШаг  = 5 Тогда
			ТекущаяСтраница = Элементы.СтраницаЗавершениеПодключения;
		КонецЕсли;
	Иначе
		ТекущаяСтраница = Элементы.СтраницаОшибка;
		
		Элементы.ФормаПродолжить.Видимость = Ложь;
		Элементы.ФормаПодклчюить.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ТекущаяСтраница;

КонецПроцедуры

&НаКлиенте
Процедура СделатьШагНаКлиенте(Команда)
	
	КодСостояния = СделатьШагНаСервере();
	УстановитьВидимостьЭлементов(КодСостояния);
	
	//На случай последующего закрытия фомры, не будем справшивать подтверждения
	ПродолжитьЗакрытиеФормы = КодСостояния <> 200;
	
	Если КодСостояния = Неопределено Тогда
		ПоказатьСтраницуОшибки("Ошибка работы с интертент!");
		Возврат;
	КонецЕсли;  
	
	Если ТекущийШаг = 0 и КодСостояния <> 200 Тогда
		Если КодСостояния = 404 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать адрес электронной почты",,"ЭлектроннаяПочтаДляРегистрации"); 
		ИначеЕсли КодСостояния = 415 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нужно указать только один адрес электронной почты",,"ЭлектроннаяПочтаДляРегистрации"); 
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ТекущийШаг = 2 и КодСостояния <> 200 Тогда
		ПоказатьПредупреждение(,"Введен неверный пин-код");
	КонецЕсли;
	
	ОписаниеКодовСостояний = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();
	Если ТекущийШаг = 3 Тогда  
		Если КодСостояния <> 200 Тогда
			ПоказатьПредупреждение(,"Код: "+Строка(КодСостояния)+" - " + ОписаниеКодовСостояний.Получить(КодСостояния));
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийШаг = 4 Тогда  
		Если КодСостояния <> 200 Тогда
			ПоказатьПредупреждение(,"Код: "+Строка(КодСостояния)+" - " + ОписаниеКодовСостояний.Получить(КодСостояния));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция СделатьШагНаСервере()
	
	Если ТекущийШаг = 0 Тогда
		Ответ = ОбработатьНулевойШаг();
	КонецЕсли;
	
	Если ТекущийШаг = 1 Тогда
		Ответ = ОбработатьПервыйШаг();
	КонецЕсли;
	
	Если ТекущийШаг = 2 Тогда
		Ответ =  ОбработатьВторойШаг();
	КонецЕсли;
	
	Если ТекущийШаг = 3 Тогда
		Ответ = ОбработатьТретийШаг();
	КонецЕсли;
	
	Если ТекущийШаг = 4 Тогда
		Ответ = ОбработатьЧетвертыйШаг();
	КонецЕсли;
	
	Если ТекущийШаг = 5 Тогда
		Ответ = ОбработатьПятыйШаг();
	КонецЕсли;
	
	Если Ответ = Неопределено Тогда
		ПродолжитьЗакрытиеФормы = истина;
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ответ.КодСостояния = 200 Тогда
		ТекущийШаг = ТекущийШаг + 1;
	Иначе
		
		ОшибкаHTML = Ответ.ПолучитьТелоКакСтроку();
		
		Если ПустаяСтрока(ОшибкаHTML) тогда
			ОписаниеКодовСостояний 	= CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();
			ОшибкаHTML 				= ОписаниеКодовСостояний.Получить(Ответ.КодСостояния);
		КонецЕсли;
		
		ПоказатьСтраницуОшибки(ОшибкаHTML);
	КонецЕсли;
	
	ПродолжитьЗакрытиеФормы = Ответ.КодСостояния <> 200;
	
	Возврат Ответ.КодСостояния;
	
КонецФункции     

&НаСервере
Функция ОбработатьНулевойШаг() 
	
	Ответ = Новый Структура("КодСостояния", 200);   
	
	Если Не ЗначениеЗаполнено(ЭлектроннаяПочтаДляРегистрации) Тогда
		Ответ.Вставить("КодСостояния", 404);	
	КонецЕсли;
	
	мАдреса = СтрРазделить(ЭлектроннаяПочтаДляРегистрации,"@"); 
	Если мАдреса.Количество() <> 2 Тогда
		Ответ.Вставить("КодСостояния", 415);	
	КонецЕсли;     
	
	Если Ответ.КодСостояния = 200 Тогда
		ТекущийШаг = ТекущийШаг + 1;       
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ОбработатьПервыйШаг()
	
	ТекстОшибки = 	"Не удалось получить адрес электронной почты, привязанный к регистрационному номеру программы. 
					|Для решения вопроса направьте обращение на адрес технической поддержки buhexp@coralway.ru или позвоните по телефону +7 (812) 600-91-77. 
					|Будьте готовы назвать регистрационный номер и наименование вашей компании.";
	
	//Проверка наличия клиента с указанным регистрационным номера в базе Сервиса
	
	ОписаниеКодовСостояний 	= CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber", XMLСтрока(РегистрационныйНомер));
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_checkreg", СтруктураJSON);
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ответ.КодСостояния = 200 Тогда
		
		СтруктураJSON = Новый Структура;
		СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
		СтруктураJSON.Вставить("eventpin", 	XMLСтрока(0));
		СтруктураJSON.Вставить("count", 	XMLСтрока(1));
		СтруктураJSON.Вставить("mail", 		XMLСтрока(ЭлектроннаяПочтаДляРегистрации));
		
		ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_sendpin", СтруктураJSON);
		
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");		
		Если Ответ = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Если  Ответ.КодСостояния = 200 Тогда
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(Символы.ПС);
			МассивСтрок.Добавить("На электронный адрес ");
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ЭлектроннаяПочтаДляРегистрации,Новый Шрифт(,,Истина)));
			
			МассивСтрок.Добавить(" ,указанный при приобретении программы ""Бухгалтерия экспедитора 8"",");
			
			МассивСтрок.Добавить(" отправлен пин-код для подключения к сервису.");
			МассивСтрок.Добавить(Символы.ПС);
			МассивСтрок.Добавить("Если у вас нет доступа к указанному электронному адресу, обратитесь в службу поддержки сервиса по телефону +7 812 600-91-77 доб. 232.");
			
			Элементы.Информация.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
			
		Иначе 
			Ответ = Новый HTTPСервисОтвет(Ответ.КодСостояния);
			Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ОбработатьВторойШаг()    
	
	Структура = Новый Структура;
	Структура.Вставить("РегистрационныйНомер",	XMLСтрока(РегистрационныйНомер));
	Структура.Вставить("ПинКод",	XMLСтрока(ПинКод));
	Структура.Вставить("Событие", 	XMLСтрока(0));
	
	Возврат CW_РегистрацияПрограммыСервер.ПроверитьВведенныйПинКод(Структура, Истина);
	
КонецФункции

&НаСервере
Функция ОбработатьТретийШаг()
	
	//Перед проверкой подклчюения нужно создать пользователя ИБ
	CW_ОбщийМодульЛичныйКабинетСервер.СоздатьОбновитьПользователяЛичногоКабинета();
	
	//Проверка подключения к текущей базе по переданным параметрам
	Ответ = ОтправитьДляОбработки("main_checkconnect");
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ОбработатьЧетвертыйШаг()
	
	//Просто переходим на следующий шаг
	Возврат Новый HTTPСервисОтвет(200);
	
КонецФункции

&НаСервере
Функция ОбработатьПятыйШаг()
	
	Ответ = ОтправитьДляОбработки("lkk_activationservice", Истина);
	
	Возврат Ответ;
	
КонецФункции


&НаКлиенте
Процедура Подклчюить(Команда)
	
	КодСостояния = СделатьШагНаСервере();
	Если КодСостояния = Неопределено Тогда
		ПоказатьПредупреждение(,"Ошибка работы с интертент!");
		Возврат;
	КонецЕсли;
	
	Если КодСостояния = 200 Тогда
		
		мСтроки = Новый Массив;
		мСтроки.Добавить("Сервис ""Личный кабинет клиента"" успешно подключен. Информацию о настройке сервиса направлена Вам на почту.");

		ТекстСообщения = Новый ФорматированнаяСтрока(мСтроки);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Заголовок",  "Продление подписки");
		СтруктураПараметров.Вставить("Текст",  		ТекстСообщения);
		
		Оповещение = Новый ОписаниеОповещения("ЗавершитьПодключениеСервис", ЭтаФорма);
		
		ОткрытьФорму("ОбщаяФорма.CW_ЛичныйКабинетУспешнаяОтправкаСчета", СтруктураПараметров, ЭтаФорма,,,,Оповещение); 
		
		
	Иначе
		
		Элементы.ФормаПродолжить.Видимость = Ложь;
		Элементы.ФормаПодклчюить.Видимость = Ложь;
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОшибка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПодключениеСервис(Результат, ДополнительныеПараметры) Экспорт 
	
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры



&НаСервере
Функция ОтправитьДляОбработки(ИмяЗапроса, ДобавитьЛоготип = Ложь)
	
	ПараметрыПодклчюения 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьСтруктуруПараметровПодключенияПользователя();
	HTTPСоединение				= CW_РаботаСВнешнимиРесурсамиСервер.СоздатьHTTPСоединение(ПараметрыПодклчюения);
	ШаблоныТекстаHTTPЗапроса 	= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьШаблоныТекстовHTTPЗапросов();
	
	ШаблонТекстаHTTPЗапроса 	= ШаблоныТекстаHTTPЗапроса.получить(ИмяЗапроса); 
	ТекстHTTPЗапроса 			= СтрШаблон(ШаблонТекстаHTTPЗапроса,ПараметрыПодклчюения.ИмяБазыДанных); 
	
	НовыйПуть = ПолучитьИмяВременногоФайла("xml");
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber", 	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("servername",	XMLСтрока(ИмяСервера));		
	СтруктураJSON.Вставить("port",			XMLСтрока(Порт));
	СтруктураJSON.Вставить("ssl",			XMLСтрока(ЗащищенноеСоединение));
	СтруктураJSON.Вставить("basename",		XMLСтрока(ИмяБазыДанных));
	
	СтруктураJSON.Вставить("name",			XMLСтрока(НазваниеКомпании));
	СтруктураJSON.Вставить("phone",			XMLСтрока(Телефоны));
	СтруктураJSON.Вставить("website",		XMLСтрока(Сайт));
	СтруктураJSON.Вставить("email",			XMLСтрока(ЭлектроннаяПочта));
	СтруктураJSON.Вставить("emailowner",	XMLСтрока(ЭлектроннаяПочтаДляРегистрации));

	Если ДобавитьЛоготип 
		И ЭтоАдресВременногоХранилища(АдресЛоготипа) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресЛоготипа);
		СодержимоеФайла = Base64Строка(ДвоичныеДанные);
		
		СтруктураJSON.Вставить("logo", СодержимоеФайла);
	КонецЕсли;
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос(ИмяЗапроса, СтруктураJSON);
	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST"); 
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПроверитьПодключениеНаСервере()
	
	ОшибкаHTML 		= "";
	Элементы.ОшибкаHTMLПроверка.Видимость = ЛОЖЬ;

	CW_ОбщийМодульЛичныйКабинетСервер.СоздатьОбновитьПользователяЛичногоКабинета();

	Ответ = ОтправитьДляОбработки("main_checkconnect");
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ответ.КодСостояния = 200 Тогда
		ТекстОшибки = "Успешное подключение.";	
	Иначе
		ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстОшибки) тогда
		ОписаниеКодовСостояний  = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();
		
		ТекстОшибки	= СокрЛП(Ответ.КодСостояния) + " - " + ОписаниеКодовСостояний.Получить(Ответ.КодСостояния); 
	КонецЕсли;
	
	Если СтрНайти(ВРЕГ(ТекстОшибки), "<HTML>") = 0 Тогда
		ТекстОшибки =  ПолучитьHTMLТекстСообщения(ТекстОшибки);
	КонецЕсли;

	ТекстОшибки = СтрЗаменить(ТекстОшибки, ВРЕГ("<BODY>"), "<BODY bgcolor=""#FFFAD9"">");
	
	ОшибкаHTML = ТекстОшибки;
	Элементы.ОшибкаHTMLПроверка.Видимость = истина;
	
	Возврат Ответ.КодСостояния;
	
КонецФункции

&НаСервере
Функция ПолучитьHTMLТекстСообщения(ТекстОшибки)
	
	ТекстHTML = "<HTML>
	|<HEAD>
	|</HEAD>
	|<BODY>";
	
	ТекстHTML = ТекстHTML + "
	|<p>" + ТекстОшибки + "</p>";
	
	ТекстHTML = ТекстHTML+	"
	|</BODY>
	|</HTML>";
	
	Возврат ТекстHTML;
	
КонецФункции



&НаСервере
Процедура ПоказатьСтраницуОшибки(ТекстОшибки)
	
	Если СтрНайти(ВРЕГ(ТекстОшибки), "<HTML>") = 0 Тогда
		ОшибкаHTML =  ПолучитьHTMLТекстСообщенияОшибки(ТекстОшибки);
	КонецЕсли;

	ОшибкаHTML 		= ТекстОшибки;
	ТекущаяСтраница = Элементы.СтраницаОшибка;
	
	Элементы.ФормаПродолжить.Видимость = Ложь;
	Элементы.ФормаПодклчюить.Видимость = Ложь;

КонецПроцедуры

&НаСервере
Функция ПолучитьHTMLТекстСообщенияОшибки(ТекстОшибки)
	
	ТекстHTML = "<HTML>
	|<HEAD>
	|</HEAD>
	|<BODY>";
	
	ТекстHTML = ТекстHTML + "
	|<p>" + ТекстОшибки + "</p>";
	
	ТекстHTML = ТекстHTML+	"
	|</BODY>
	|</HTML>";
	
	Возврат ТекстHTML;
	
КонецФункции


&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	КодСостояния = ПроверитьПодключениеНаСервере();
	
	Элементы.СоединениеУспешно.Видимость = КодСостояния = 200;
	
	//Если КодСостояния <> Неопределено Тогда
	//	Если КодСостояния = 200 Тогда
	//		
	//		СтруктураПараметров = Новый Структура;
	//		СтруктураПараметров.Вставить("Заголовок",  "Личный кабинет клиента");
	//		СтруктураПараметров.Вставить("Текст",  		"Успешное подключение");
	//		
	//		ОткрытьФорму("ОбщаяФорма.CW_ЛичныйКабинетУспешнаяОтправкаСчета", СтруктураПараметров, ЭтаФорма); 
	//	КонецЕсли;
	//Иначе
	//	ПоказатьСтраницуОшибки("Не удалось подключиться");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗащищенноеСоединениеПриИзменении(Элемент)

	Порт = ?(ЗащищенноеСоединение, 443, 80);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНеПолучилНажатие(Элемент)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("Если у Вас нет доступа к почтовому ящику, указанному при");
	МассивСтрок.Добавить("приобретении программы ""Бухгалтерия экспедитора 8"", то"); 
	МассивСтрок.Добавить("Вам необходимо направить запрос на адрес: ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("sale@coralway.ru", Новый Шрифт(,,Истина)));
	МассивСтрок.Добавить(" или по телефону: +7 812 600-91-77 доб. 232");
	МассивСтрок.Добавить(" на смену электронного адреса владельца программы.");
	МассивСтрок.Добавить("В запросе Вам необходимо указать: название компании,");
	МассивСтрок.Добавить("регистрационный номер программы, ФИО и должность сотрудника");
	МассивСтрок.Добавить(" компании для обратной связи");
	
	ТекстПредупреждения = Новый ФорматированнаяСтрока(МассивСтрок);
	
	ПоказатьПредупреждение(,ТекстПредупреждения,,"Я не получил пин-код");

КонецПроцедуры

&НаКлиенте
Процедура НадписьГдеВзятьПараметрыПубликацииНажатие(Элемент)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("Для работы сервиса ""Личный кабинет клиента"" Ваша информационная ");
	МассивСтрок.Добавить("база данных должна быть опубликована на web-сервере. Для публикации "); 
	МассивСтрок.Добавить("и получения параметров пубикации информационной базы на web-сервере ");
	МассивСтрок.Добавить("обратитесь к Вашему системному администратору!");
	
	ТекстПредупреждения = Новый ФорматированнаяСтрока(МассивСтрок);
	
	ПоказатьПредупреждение(,ТекстПредупреждения,,"Где взять параметры публикации?");
	
КонецПроцедуры



&НаКлиенте
Процедура ОтменаПодключения(Команда)
	
	Если Не ПродолжитьЗакрытиеФормы Тогда
		Отказ = Истина;
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеОтказаОтПодклчюенияКСервису", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Вы действительно хотите отказаться от подклчюения к сервису?", Режим, 0);
		
	Иначе
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеОтказаОтПодклчюенияКСервису(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РегистрационныйНомер", 	РегистрационныйНомер);
	СтруктураПараметров.Вставить("ПинКод", 					"");//передаем пустую строку, будут заблокирвоаны все активные
	СтруктураПараметров.Вставить("Событие", 				0);

	Успешно =  CW_РегистрацияПрограммыСервер.ПроверитьВведенныйПинКод(СтруктураПараметров);   
	CW_РегистрацияПрограммыСервер.ЗаблокироватьПинКод(СтруктураПараметров);
		
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресЛоготипаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = истина;
	
	Оповещение= Новый ОписаниеОповещения("ОбрабоатьДобавлениеЛоготипа", ЭтаФорма);
 	НачатьПомещениеФайла(Оповещение, , , Истина,    УникальныйИдентификатор);	
	
КонецПроцедуры 

&НаКлиенте
Процедура Выбрать(Команда)
	
	Оповещение= Новый ОписаниеОповещения("ОбработатьДобавлениеЛоготипа", ЭтаФорма);
 	НачатьПомещениеФайла(Оповещение, , , Истина,    УникальныйИдентификатор);	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьДобавлениеЛоготипа(Результат, Адрес,	ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		Если ПроверитьРазмерФайлаНаСервере(Адрес) Тогда
			ПоказатьПредупреждение(, "Размер файла логотипа не должен превышать 100Кб");
			Возврат;
		КонецЕсли;
		
        АдресЛоготипа = Адрес;
		
	КонецЕсли 
	
КонецПроцедуры

&НаСервере
Функция ПроверитьРазмерФайлаНаСервере(АдресФайла)
	
	Возврат CW_ОбщийМодульЛичныйКабинетСервер.ПроверитьРазмерФайлаЛоготипа(АдресФайла);
	
КонецФункции

&НаКлиенте
Процедура Удалить(Команда)
	АдресЛоготипа = "";
КонецПроцедуры

