#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СброситьУстановитьНастройкиПриИзмененииОпцийПрограммы(ИмяОпции, Значение=ложь) Экспорт
	
	МассивИзменяемыхНастроек = ПолучитьмассивИзменяемыхНастроек(ИмяОпции);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НастройкиПользователей.Пользователь КАК Пользователь
	               |ИЗ
	               |	РегистрСведений.CW_НастройкиПользователей КАК CW_НастройкиПользователей";
	
	ВыборкаНастройки = Запрос.Выполнить().Выбрать();
	
	пока ВыборкаНастройки.Следующий() Цикл
		
		ЗаписьРегистра = РегистрыСведений.CW_НастройкиПользователей.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Пользователь = ВыборкаНастройки.Пользователь;
		ЗаписьРегистра.Прочитать();
		
		ЗаписьИзменена = Ложь;
		Если ЗаписьРегистра.Выбран() Тогда
			Для каждого ИмяНастройки из МассивИзменяемыхНастроек Цикл
				Если ИмяНастройки <> Неопределено Тогда
					Если ЗаписьРегистра[ИмяНастройки] <> Значение Тогда
						ЗаписьРегистра[ИмяНастройки] = Значение;
						ЗаписьИзменена = истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗаписьИзменена Тогда
			ЗаписьРегистра.Пользователь = ВыборкаНастройки.Пользователь;
			ЗаписьРегистра.Записать(Истина);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьмассивИзменяемыхНастроек(Знач ИмяОпции)
	
	Если ИмяОпции = "CW_ИспользованиеФайловогоАрхива" Тогда
		МассивНастроек = Новый Массив;
		МассивНастроек.Добавить("ОтображатьКолонкуФайлыВСписках");
		
		Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаявок") Тогда
			МассивНастроек.Добавить("ОтображатьКолонкуФайлы_CW_Заявки");
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов") Тогда
			МассивНастроек.Добавить("ОтображатьКолонкуФайлы_CW_Заказы");
		КонецЕсли;
		
		МассивНастроек.Добавить("ОтображатьКолонкуФайлы_CW_Грузоперевозки");
		
	Иначе
		
		СоответствиеОпций = ПолучитьСоответствиеИмениОпцииПрограммы();
		МассивНастроек = СоответствиеОпций.Получить(ИмяОпции);
		
	КонецЕсли;

	Возврат МассивНастроек;
	
КонецФункции

Функция ПолучитьСоответствиеИмениОпцииПрограммы()
	
	Соответствие = Новый Соответствие;  
	
	Массив = Новый Массив;
	Массив.Добавить("ОтображатьКолонкуФайлы_CW_Заявки");
	Соответствие.Вставить("CW_ИспользованиеЗаявок",				Массив);         
	
	Массив = Новый Массив;
	Массив.Добавить("ОтображатьКолонкуФайлы_CW_Заказы");	
	Соответствие.Вставить("CW_ИспользованиеЗаказов",			Массив);

	Массив = Новый Массив;
	Массив.Добавить("КонтролироватьСрокДействияПриложения");	
	Соответствие.Вставить("CW_ВедетсяУчетПриложенийПоДоговорам", Массив);
	
	Возврат Соответствие;
	
КонецФункции

Процедура ЗаполнитьНастройкиФоновогоОбновления() Экспорт
	
	Набор = РегистрыСведений.CW_НастройкиПользователей.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	Для Каждого ЗаписьНабора из Набор Цикл
		ЗаписьНабора.ИнтервалФоновогоОбновленияЖурналаЗавок = 1;
		ЗаписьНабора.ИнтервалФоновогоОбновленияЖурналаЗаказов = 1;
		ЗаписьНабора.ИнтервалФоновогоОбновленияЖурналаГрузоперевозок = 1;
	КонецЦикла; 
	
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецЕсли