
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодключаемыйОбъект = Неопределено;
	Параметры.Свойство("ПодключаемыйОбъект", ПодключаемыйОбъект);
	Если ПодключаемыйОбъект = Неопределено Тогда
		Отказ = истина;
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьСписокМакросов();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокМакросов()
	
	Для Каждого СтрокаМакросов из ПодключаемыйОбъект.Макросы Цикл
		//СписокМакрсов.Добавить("["+СокрЛП(СтрокаМакросов.ИмяМакроса)+"]", СтрокаМакросов.ПредставлениеМакроса,,БиблиотекаКартинок.CW_ЗеленаяТочка);
		СписокМакрсов.Добавить(СокрЛП(СтрокаМакросов.ИмяМакроса), СтрокаМакросов.ПредставлениеМакроса,,БиблиотекаКартинок.CW_ЗеленаяТочка);
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура СписокМакрсовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыполнитьВыбораМакроса(ВыбраннаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда)

	ВыбраннаяСтрока = Элементы.СписокМакрсов.ТекущаяСтрока;
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ВыполнитьВыбораМакроса(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыбораМакроса(ВыбраннаяСтрока)
	
	ИмяМакроса = ПолучитьиИмяМакросаНаСервере(ВыбраннаяСтрока);
	
	ЭтаФорма.Закрыть(ИмяМакроса);
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьиИмяМакросаНаСервере(ВыбраннаяСтрока)
	
	ЭлементСписка = СписокМакрсов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Возврат ЭлементСписка.Значение;
	
КонецФункции
