#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПредставлениеСтатуса(Статус, Проведен = Истина, Подробно = Ложь) Экспорт
	
	Если Не Проведен Тогда
		Возврат ПредставлениеСтатусаНеПроведен(Подробно);
	Иначе
		ПредставленияСтатусов = ПредставленияСтатусов(Подробно);
		Возврат ПредставленияСтатусов[Статус];
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеСтатусаНеПроведен(Подробно)
	
	Если Подробно Тогда
		Возврат НСтр("ru = 'Расчет не проведен'");
	Иначе
		Возврат НСтр("ru = 'Не проведен'");
	КонецЕсли;
	
КонецФункции

Функция ПредставленияСтатусов(Подробно)
	
	СтатусыРасчетов = Новый Соответствие;
	СтатусыРасчетов.Вставить(ПустаяСсылка(),
		?(Подробно, НСтр("ru = 'Расчет не передавался'"), НСтр("ru = 'Не передавался'")));
	СтатусыРасчетов.Вставить(ОжидаетОтправки,
		?(Подробно, НСтр("ru = 'Расчет ожидает отправки'"), НСтр("ru = 'Ожидает отправки'")));
	СтатусыРасчетов.Вставить(ПереданВБанк,
		?(Подробно, НСтр("ru = 'Расчет передан в банк'"), НСтр("ru = 'Передан в банк'")));
	СтатусыРасчетов.Вставить(ПереданВФНС,
		?(Подробно, НСтр("ru = 'Расчет передан в ФНС'"), НСтр("ru = 'Передан в ФНС'")));
	СтатусыРасчетов.Вставить(Принят,
		?(Подробно, НСтр("ru = 'Расчет принят ФНС'"), НСтр("ru = 'Принят ФНС'")));
	СтатусыРасчетов.Вставить(Отклонен,
		?(Подробно, НСтр("ru = 'Расчет отклонен ФНС'"), НСтр("ru = 'Отклонен ФНС'")));
	СтатусыРасчетов.Вставить(ОшибкаПриОтправке,
		?(Подробно, НСтр("ru = 'Ошибка при отправке расчета'"), НСтр("ru = 'Ошибка при отправке'")));
	
	Возврат СтатусыРасчетов;
	
КонецФункции

#КонецОбласти

#КонецЕсли