
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыВыполненияКоманды.Источник, "Объект") Тогда
		ПоказатьПредупреждение(, "Для заполнения документа конманду необходимо вызвать из формы документа");
		Возврат;
	КонецЕсли;  
	
	ЗаполнитьДанныеНаСервере(ПараметрКоманды);  
	
КонецПроцедуры      

&НаСервере
Процедура ЗаполнитьДанныеНаСервере(ПараметрКоманды)
	
	ЭтоВерсияКОРП = ВариантыПриложений.ЭтоВерсияКОРП();
	
	ПараметрыУчетнойПолитики = CW_Настройки.ПараметрыУчетнойПолитики(ПараметрКоманды.Дата, ПараметрКоманды.Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_НезавершенноеПроизводствоОстатки.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СУММА(CW_НезавершенноеПроизводствоОстатки.СуммаОстаток) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА &НЗПОтражатьВНУ
	|				ТОГДА CW_НезавершенноеПроизводствоОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНУ
	|ИЗ
	|	РегистрНакопления.CW_НезавершенноеПроизводство.Остатки(
	|			&ДатаСреза,
	|			Организация = &Организация
	|				И Подразделение = &Подразделение
	|						) КАК CW_НезавершенноеПроизводствоОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_НезавершенноеПроизводствоОстатки.Номенклатура.НоменклатурнаяГруппа";  
	
	Запрос.УстановитьПараметр("ДатаСреза", 		Новый Граница(ПараметрКоманды.Дата, ВидГраницы.Включая)); 
	Запрос.УстановитьПараметр("Организация",	ПараметрКоманды.Организация);
	Запрос.УстановитьПараметр("Подразделение",	ПараметрКоманды.ПодразделениеОрганизации); 
	Запрос.УстановитьПараметр("НЗПОтражатьВНУ",	ПараметрыУчетнойПолитики.НЗПОтражатьВНУ); 

	РезультатЗапроса = Запрос.Выполнить();
	
	ДокументОбъект = ПараметрКоманды.ПолучитьОбъект();
	ДокументОбъект.Состав.Загрузить(РезультатЗапроса.Выгрузить());	
	ДокументОбъект.Записать();

КонецПроцедуры

