&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВедетсяУчетПриложенийПоДоговорам  = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");
		
	Если ТипЗнч(Запись.Договор) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		Договор		= Запись.Договор;
		Заголовок 	= "Параметры договора"; 
		
		Элементы.Владелец.Видимость = Ложь;
		Элементы.ЗаписьДоговор.Заголовок = "Договор";
		
		ИспользуютсяПриложенияПоДоговору = ВедетсяУчетПриложенийПоДоговорам и Договор.ИспользуютсяПриложения;
		
	Иначе
		Договор		= Запись.Договор.Договор;
		Заголовок 	= "Параметры приложения (соглашения)"; 
		
		Элементы.ЗаписьДоговор.Заголовок = "Приложение (соглашение)";
		
		ИспользуютсяПриложенияПоДоговору = Истина;
	КонецЕсли;
	
	ИспользуетсяОграниченияПоГруппамУслуг =  Запись.Договор.ИспользуетсяОграниченияПоГруппамУслуг;
	
	Валюта						= Запись.Договор.ВалютаДоговора;
	
	ВидДоговора 				= Договор.ВидДоговора;
	ЕстьОграниченияНоменклатуры = Договор.ОграничиватьНоменклатуру;
	
	ИспользуютсяЗаказы 			   		= ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов");
	ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	
	БазоваяВалюта 						= CW_Настройки.ВалютаРегламентированногоУчета();
	
	Элементы.ФормироватьСправкуКАкту.Видимость = ИспользуютсяПриложенияПоДоговору и ИспользуетсяОграниченияПоГруппамУслуг;
	
	ТекущаяОрганизация = Договор.Организация;
	
	Если ТипЗнч(Запись.Договор) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		ТекущийКонтрагент  = Запись.Договор.Владелец;
	Иначе
		ТекущийКонтрагент  = Запись.Договор.Договор.Владелец;
	КонецЕсли;
	
	Если Запись.ИзКарточкиОрганизации Тогда
		ОбновитьДанныеОрганизацииИзКарточки(ТекущаяОрганизация);
	КонецЕсли;
	
	Если Запись.РеквизитыИзКарточкиКонтрагента Тогда
		ОбновитьДанныеКонтрагентаИзКарточки(ТекущийКонтрагент);
	КонецЕсли;
	
	//подписанты
	Если Запись.РежимПодписей = 0 Тогда
		ПолучитьПодпиантовИзКарточкиОрганизацииНаСервере();
	КонецЕсли;
	//подписанты
	
	Элементы.ГруппаВыводНаПечать.Видимость 	= ТекущийКонтрагент.ОбособленноеПодразделение;
	ВыводитьРеквизитыГоловнойОрганизации 	= ?(Запись.ВПечатныхФормахВыводитьРеквизитыГоловнойОрганизации,1,0);
	
	Элементы.ГруппаПересчетСуммыРублевогоЭквивалента.Видимость = Валюта <> БазоваяВалюта;
	
	РасчетРублевогоЭквивалентаПропорциональноПоСуммеИтога = ?(Запись.РасчетРублевогоЭквивалентаПропорциональноПоСуммеИтога,1,0);
	
	//Заполнение списка порядка заполнения
	Если ИспользуютсяЗаказы Тогда
		
		Элементы.ПорядокЗаполнения.СписокВыбора.Добавить(2,"По заказу");
		Элементы.ПорядокЗаполнения.СписокВыбора.Добавить(3,"По списку заказов");
		
	КонецЕсли;
	
	//Получим настрйоки пользователя
	СтруктураНастроекПользователя 	= CW_Настройки.ПолучитьНастройкиПользователя();
	
	СтруктураНастроекПользователя.Свойство("ОсновнойПорядокОтраженияДоходов"	, ОсновнойПорядокОтраженияДоходов);
	СтруктураНастроекПользователя.Свойство("ОсновнойПорядокОтраженияРасходов"	, ОсновнойПорядокОтраженияРасходов);
	
	Если Не ЗначениеЗаполнено(ОсновнойПорядокОтраженияДоходов) тогда
		Если ВалютаРегламентированногоУчетаРубль Тогда
			ОсновнойПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
		Иначе
			ОсновнойПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОсновнойПорядокОтраженияРасходов) тогда
		Если ВалютаРегламентированногоУчетаРубль Тогда
			ОсновнойПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		Иначе
			ОсновнойПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи) Тогда
		//Новая запись
		Если Не ВалютаРегламентированногоУчетаРубль Тогда
			Запись.ЯзыкПечатиДокументов 			= 1;
			Запись.ВыводитьРеквизитыПриПечатиАкта 	= Ложь;
			Запись.СкрыватьКолонкиНДСвТЧСчета 		= Истина;
		КонецЕсли;
		
		Запись.ОсновнойПорядокОтраженияДоходов  = ОсновнойПорядокОтраженияДоходов;
		Запись.ОсновнойПорядокОтраженияРасходов = ОсновнойПорядокОтраженияРасходов;
		
		Если НЕ ЗначениеЗаполнено(Запись.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ) Тогда 
			Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда 
				// с покупателями - Автоматически
				Запись.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.Автоматически;
			Иначе 
				Запись.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.НеУчитывать;
			КонецЕсли;
		КонецЕсли;
		
		Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда 
			ОсновнойПорядокЗачетаАвансов = CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"СпособЗачетаАвнасовИсходящихДокументов");
		Иначе 
			ОсновнойПорядокЗачетаАвансов = CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"СпособЗачетаАвнасовВходящихДокументов");
		КонецЕсли;
		
		Запись.ПорядокЗачетаАвансовОЗ = ?(ЗначениеЗаполнено(ОсновнойПорядокЗачетаАвансов), ОсновнойПорядокЗачетаАвансов, Перечисления.СпособыЗачетаАвансов.Автоматически);
		
		Запись.СчетНаПредоплату = 1;
		
	КонецЕсли;
	
	Элементы.АвтоматическиРасчитыватьПланОплатыПриЗаписиДокумента.Видимость = ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"); 
	
	// --- 
	
	Элементы.СтраницыДопИнфо.ОтображениеСтраниц=ОтображениеСтраницФормы.Нет;
	// проверяем, не изменилась ли валюта
	
	// ---------------------------------------------------------------------------- 
	
	Элементы.РасчетныйСчетОрганизацииРус.ПараметрыВыбора = _УФКС.СформироватьПараметрВыбораПоля("Отбор.Владелец",Договор.Организация);
	Элементы.РасчетныйСчетОрганизацииАнгл.ПараметрыВыбора = _УФКС.СформироватьПараметрВыбораПоля("Отбор.Владелец",Договор.Организация);
	
	_ОбновитьУчетнуюПолитику();
	_СформироватьПараметрыВыбораДляЭлементов();
	_УправлениеЭлементамиФормы();
	Если Элементы.ГруппаПереключениеЯзыков.Видимость Тогда
		
		_ВыделитьКнопкуЯзыка("RU");
		
	КонецЕсли; 
	
	_ЗаполнитьСпискиРеквизитов();
	
	
	Элементы.НалоговыйАгент_НДСЗаСчетСредствПоставщика.Видимость = Запись.Договор.УчетныйДоговор.УчетАгентскогоНДС;
	
	//----
	Элементы.АдресПечати.РазмерКартинки=РазмерКартинки.АвтоРазмер;
	КартинкаПечать = РеквизитФормыВЗначение("Запись").Печать.Получить();
	Если (КартинкаПечать <> Неопределено) Тогда
		АдресПечати = ПоместитьВоВременноеХранилище(КартинкаПечать,ЭтаФорма.УникальныйИдентификатор);
	Иначе
		АдресПечати = "";
	КонецЕсли; 
	
	//----
	
	Элементы.АдресПодписиРуководителя.РазмерКартинки=РазмерКартинки.АвтоРазмер;
	КартинкаПодписи = РеквизитФормыВЗначение("Запись").ПодписьРуководителя.Получить();
	Если (КартинкаПодписи <> Неопределено) Тогда
		АдресПодписиРуководителя = ПоместитьВоВременноеХранилище(КартинкаПодписи,ЭтаФорма.УникальныйИдентификатор);
	Иначе
		АдресПодписиРуководителя = "";
	КонецЕсли; 
	
	//----
	
	Элементы.АдресПодписиГлавногоБухгалтера.РазмерКартинки=РазмерКартинки.АвтоРазмер;
	КартинкаПодписиГлавногоБухгалтера = РеквизитФормыВЗначение("Запись").ПодписьГлБухгалтера.Получить();
	Если (КартинкаПодписиГлавногоБухгалтера <> Неопределено) Тогда
		АдресПодписиГлавногоБухгалтера = ПоместитьВоВременноеХранилище(КартинкаПодписиГлавногоБухгалтера,ЭтаФорма.УникальныйИдентификатор);
	Иначе
		АдресПодписиГлавногоБухгалтера = "";
	КонецЕсли;  
	
	Элементы.ГруппаРасчетКАкту.Видимость = Запись.ТребуетсяРасчетКАкту;

	ПорядокПеревыставленияПриИзмененииНаСервере();
	СчетНаПредоплатуПриИзмененииНаСервере();  
	УстановитьЗаголовокСтраницНаСервере();
	УстановитьВидимостьЭлементовДляУПД();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДопИнфо();
	УправлениеЭлементамиФормы(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.АвтоматическийРасчетВознаграждения И Запись.Номенклатура.Пустая() Тогда
		
		_УФК.ВывестиПредупреждение("Не указана Номенклатура вознаграждения.");
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	// если не заданы значения, то принудительно определим их
	Если Не ЗначениеЗаполнено(Запись.ОсновнойПорядокОтраженияДоходов) Тогда
		Если ЗначениеЗаполнено(ОсновнойПорядокОтраженияДоходов) Тогда
			Запись.ОсновнойПорядокОтраженияДоходов = ОсновнойПорядокОтраженияДоходов;
		Иначе
			Если Не ЗначениеЗаполнено(ОсновнойПорядокОтраженияДоходов) тогда
				Если ВалютаРегламентированногоУчетаРубль Тогда
					Запись.ОсновнойПорядокОтраженияДоходов = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга");
				Иначе
					Запись.ОсновнойПорядокОтраженияДоходов = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.ОсновнойПорядокОтраженияРасходов) Тогда
		Если ЗначениеЗаполнено(ОсновнойПорядокОтраженияРасходов) Тогда
			Запись.ОсновнойПорядокОтраженияРасходов = ОсновнойПорядокОтраженияРасходов;
		Иначе
			Если Не ЗначениеЗаполнено(ОсновнойПорядокОтраженияРасходов) тогда
				Если ВалютаРегламентированногоУчетаРубль Тогда
					Запись.ОсновнойПорядокОтраженияРасходов = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты");
				Иначе
					Запись.ОсновнойПорядокОтраженияРасходов =  ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам") ;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Запись.РасчетРублевогоЭквивалентаПропорциональноПоСуммеИтога = РасчетРублевогоЭквивалентаПропорциональноПоСуммеИтога = 1;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Валюта = БазоваяВалюта ИЛИ Договор.ВзаиморасчетыВУЕ Тогда
		
		Если Запись.ЯзыкПечатиДокументов<>0 Тогда 
			Запись.ЯзыкПечатиДокументов = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	// ------
	
	Если (АдресПодписиГлавногоБухгалтера = "") Тогда
		ТекущийОбъект.ПодписьГлБухгалтера = Новый ХранилищеЗначения(Неопределено);
	Иначе
		ТекущийОбъект.ПодписьГлБухгалтера = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресПодписиГлавногоБухгалтера));	
	КонецЕсли;  
	
	// ------
	
	Если (АдресПодписиРуководителя = "") Тогда
		ТекущийОбъект.ПодписьРуководителя = Новый ХранилищеЗначения(Неопределено);
	Иначе
		ТекущийОбъект.ПодписьРуководителя = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресПодписиРуководителя));	
	КонецЕсли; 
	
	// ------
	
	Если (АдресПечати = "") Тогда
		ТекущийОбъект.Печать = Новый ХранилищеЗначения(Неопределено);
	Иначе
		ТекущийОбъект.Печать = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресПечати));	
	КонецЕсли; 

	ТекущийОбъект.ВПечатныхФормахВыводитьРеквизитыГоловнойОрганизации = ВыводитьРеквизитыГоловнойОрганизации = 1;
	
КонецПроцедуры

&НаСервере
Функция _ЗаполнитьСпискиРеквизитов()
	// --- 
	
	#Область Контрагент
	
	СведенияКонтрагент = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Договор.Владелец, Запись.Период); // ВызовБП
	
	#Область Адрес 
	Элементы.АдресКонтрагентаРус.СписокВыбора.Очистить();
	Элементы.АдресКонтрагентаАнгл.СписокВыбора.Очистить();
	
	Если (ЗначениеЗаполнено(СведенияКонтрагент.ФактическийАдрес)) Тогда
		
		Элементы.АдресКонтрагентаРус.СписокВыбора.Добавить(СведенияКонтрагент.ФактическийАдрес);
		Элементы.АдресКонтрагентаАнгл.СписокВыбора.Добавить(_сф.стр_Транслит(СведенияКонтрагент.ФактическийАдрес));
		
	КонецЕсли; 
	Если (ЗначениеЗаполнено(СведенияКонтрагент.ЮридическийАдрес)) Тогда
		
		Если (СведенияКонтрагент.ЮридическийАдрес <> СведенияКонтрагент.ФактическийАдрес) Тогда
			Элементы.АдресКонтрагентаРус.СписокВыбора.Добавить(СведенияКонтрагент.ЮридическийАдрес);
			Элементы.АдресКонтрагентаАнгл.СписокВыбора.Добавить(_сф.стр_Транслит(СведенияКонтрагент.ЮридическийАдрес));	
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если (Элементы.АдресКонтрагентаРус.СписокВыбора.Количество() = 0) Тогда
		Элементы.АдресКонтрагентаРус.СписокВыбора.Добавить("<< нет данных >>");
	КонецЕсли; 
	Если (Элементы.АдресКонтрагентаАнгл.СписокВыбора.Количество() = 0) Тогда
		Элементы.АдресКонтрагентаАнгл.СписокВыбора.Добавить("<< нет данных >>");
	КонецЕсли; 
	
	#КонецОбласти 
	
	#Область Телефон
	
	Элементы.ТелефонКонтрагентаРус.СписокВыбора.Очистить();
	Если (ЗначениеЗаполнено(СведенияКонтрагент.Телефоны)) Тогда
		
		Элементы.ТелефонКонтрагентаРус.СписокВыбора.Добавить(СведенияКонтрагент.Телефоны);
		
	КонецЕсли; 
	Если (Элементы.ТелефонКонтрагентаРус.СписокВыбора.Количество() = 0) Тогда
		Элементы.ТелефонКонтрагентаРус.СписокВыбора.Добавить("<< нет данных >>");
	КонецЕсли; 
	
	#КонецОбласти 
	
	#Область КонтактныеЛица
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Договор.Владелец);
	Запрос.Текст=
	"ВЫБРАТЬ
	|	КонтактныеЛица.Должность,
	|	КонтактныеЛица.Ссылка,
	|	КонтактныеЛица.Наименование,
	|	КонтактныеЛица.Роль
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.ОбъектВладелец = &Контрагент";	
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	#Область РуководительКонтрагента 
	РольРуководителя = Константы.CW_РольРуководителя.Получить();
	Если (ЗначениеЗаполнено(РольРуководителя)) Тогда
		
		Отбор = Новый Структура("Роль",РольРуководителя);
		ТаблицаРуководителей = ТЗ.Скопировать(Отбор);
		// --- 
		КолонкаДолжностей = ТаблицаРуководителей.Скопировать(,"Должность");
		КолонкаДолжностей.Свернуть("Должность");
		МассивДолжностей = КолонкаДолжностей.ВыгрузитьКолонку("Должность");
		
	Иначе
		
		ТаблицаРуководителей = ТЗ;
		МассивДолжностей = Новый Массив;
		МассивДолжностей.Добавить("Генеральный директор");
		
	КонецЕсли; 
	
	Элементы.ДолжностьРуководителяКонтрагентаРус.СписокВыбора.Очистить();
	Элементы.ДолжностьРуководителяКонтрагентаАнгл.СписокВыбора.Очистить();
	Для каждого Стр Из МассивДолжностей Цикл
		
		Элементы.ДолжностьРуководителяКонтрагентаРус.СписокВыбора.Добавить(Стр);
		Элементы.ДолжностьРуководителяКонтрагентаАнгл.СписокВыбора.Добавить(_сф.стр_Транслит(Стр));
		
	КонецЦикла; 
	// --- 
	Если (Элементы.ДолжностьРуководителяКонтрагентаРус.СписокВыбора.Количество()=0) Тогда
		Элементы.ДолжностьРуководителяКонтрагентаРус.СписокВыбора.Добавить("< не указан>");
	КонецЕсли; 
	Если (Элементы.ДолжностьРуководителяКонтрагентаАнгл.СписокВыбора.Количество()=0) Тогда
		Элементы.ДолжностьРуководителяКонтрагентаАнгл.СписокВыбора.Добавить("< не указан>");
	КонецЕсли; 
	
	// --- 
	
	Элементы.РуководительКонтрагентаРус.СписокВыбора.Очистить();
	Элементы.РуководительКонтрагентаАнгл.СписокВыбора.Очистить();
	// --- 
	Для каждого Стр Из ТаблицаРуководителей Цикл
		
		ФИО = Стр.Наименование;
		Элементы.РуководительКонтрагентаРус.СписокВыбора.Добавить(ФИО);
		Элементы.РуководительКонтрагентаАнгл.СписокВыбора.Добавить(_сф.стр_Транслит(ФИО));
		
	КонецЦикла; 
	// --- 
	Если (Элементы.РуководительКонтрагентаРус.СписокВыбора.Количество() = 0) Тогда
		
		Элементы.РуководительКонтрагентаРус.СписокВыбора.Добавить("< не указан>");
		
	КонецЕсли; 
	Если (Элементы.РуководительКонтрагентаАнгл.СписокВыбора.Количество() = 0) Тогда
		
		Элементы.РуководительКонтрагентаАнгл.СписокВыбора.Добавить("< не указан>");
		
	КонецЕсли; 
	
	#КонецОбласти 
	
	#Область ГлавныйБухгалтерКонтрагента 
	
	РольГлавногоБухгалтера = Константы.CW_РольГлавногоБухгалтера.Получить();
	Если (ЗначениеЗаполнено(РольРуководителя)) Тогда
		
		Отбор = Новый Структура("Роль",РольГлавногоБухгалтера);
		ТаблицаБухгалтеров = ТЗ.Скопировать(Отбор);
		
	Иначе
		
		ТаблицаБухгалтеров = ТЗ;
		
	КонецЕсли; 
	
	Элементы.ГлавныйБухгалтерКонтрагентаРус.СписокВыбора.Очистить();
	Элементы.ГлавныйБухгалтерКонтрагентаАнгл.СписокВыбора.Очистить();
	// --- 
	Для каждого Стр Из ТаблицаБухгалтеров Цикл
		
		ФИО = Стр.Наименование;
		Элементы.ГлавныйБухгалтерКонтрагентаРус.СписокВыбора.Добавить(ФИО);
		Элементы.ГлавныйБухгалтерКонтрагентаАнгл.СписокВыбора.Добавить(_сф.стр_Транслит(ФИО));
		
	КонецЦикла; 
	// --- 
	Если (Элементы.ГлавныйБухгалтерКонтрагентаРус.СписокВыбора.Количество() = 0) Тогда
		
		Элементы.ГлавныйБухгалтерКонтрагентаРус.СписокВыбора.Добавить("< не указан>");
		
	КонецЕсли; 
	Если (Элементы.ГлавныйБухгалтерКонтрагентаАнгл.СписокВыбора.Количество() = 0) Тогда
		
		Элементы.ГлавныйБухгалтерКонтрагентаАнгл.СписокВыбора.Добавить("< не указан>");
		
	КонецЕсли; 
	
	#КонецОбласти 
	
	#КонецОбласти 
	
	#КонецОбласти 
	
	// --- 
	
	#Область Организация
	
	СведенияОрганизация		= CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Договор.Организация,Запись.Период); // ВызовБП
	СведенияОрганизацияАнгл = РегистрыСведений.CW_УчетнаяПолитика.ПолучитьСведенияОбОрганизацииНаАнглийскомЯзыке(Договор.Организация);
							//НаименованиеОрганизации,ДолжностьРуководителя,АдресОрганизации"

	#Область АдресОрганизации
	
	Элементы.АдресОрганизацииРус.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(СведенияОрганизация.ФактическийАдрес) Тогда
		Элементы.АдресОрганизацииРус.СписокВыбора.Добавить(СведенияОрганизация.ФактическийАдрес);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СведенияОрганизация.ЮридическийАдрес) 
		И СведенияОрганизация.ЮридическийАдрес <> СведенияОрганизация.ФактическийАдрес Тогда
		Элементы.АдресОрганизацииРус.СписокВыбора.Добавить(СведенияОрганизация.ЮридическийАдрес);
	КонецЕсли; 
	Если Элементы.АдресОрганизацииРус.СписокВыбора.Количество() = 0 Тогда
		Элементы.АдресОрганизацииРус.СписокВыбора.Добавить("< не указано >");
	КонецЕсли; 

	
	Элементы.АдресОрганизацииАнгл.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(СведенияОрганизацияАнгл.АдресОрганизации) Тогда
		Элементы.АдресОрганизацииАнгл.СписокВыбора.Добавить(СведенияОрганизацияАнгл.АдресОрганизации);
	Иначе
		
		Если ЗначениеЗаполнено(СведенияОрганизация.ФактическийАдрес) Тогда
			Элементы.АдресОрганизацииАнгл.СписокВыбора.Добавить(_сф.стр_Транслит(СведенияОрганизация.ФактическийАдрес));
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОрганизация.ЮридическийАдрес)
			И СведенияОрганизация.ЮридическийАдрес <> СведенияОрганизация.ФактическийАдрес Тогда
			Элементы.АдресОрганизацииАнгл.СписокВыбора.Добавить(_сф.стр_Транслит(СведенияОрганизация.ЮридическийАдрес));
		КонецЕсли;
		
	КонецЕсли;
	
	Если Элементы.АдресОрганизацииАнгл.СписокВыбора.Количество() = 0 Тогда
		Элементы.АдресОрганизацииАнгл.СписокВыбора.Добавить("< не указано >");
	КонецЕсли; 
	
	#КонецОбласти 
	
	
	#Область ТелефонОрганизации
	
	Элементы.ТелефонОрганизацииРус.СписокВыбора.Очистить();
	Если (ЗначениеЗаполнено(СведенияОрганизация.Телефоны)) Тогда
		Элементы.ТелефонОрганизацииРус.СписокВыбора.Добавить(СведенияОрганизация.Телефоны);
	КонецЕсли; 
	Если (Элементы.ТелефонОрганизацииРус.СписокВыбора.Количество() = 0 ) Тогда
		Элементы.ТелефонОрганизацииРус.СписокВыбора.Добавить("< не указано >");
	КонецЕсли; 
	
	#КонецОбласти 
	
	// --- 
	
	#Область ОтветственныеЛицаОрганизации
	
	ОтветственныеЛица = ОтветственныеЛицаБППереопределяемый.ОтветственныеЛица(Договор.Организация,Запись.Период);
	
	#Область ДолжностьРуководителяОрганизации
	
	Элементы.ДолжностьРуководителяОрганизации.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(ОтветственныеЛица.РуководительДолжностьПредставление) Тогда
		Элементы.ДолжностьРуководителяОрганизации.СписокВыбора.Добавить(ОтветственныеЛица.РуководительДолжностьПредставление);
	КонецЕсли;
	Если Элементы.ДолжностьРуководителяОрганизации.СписокВыбора.Количество() = 0 Тогда
		Элементы.ДолжностьРуководителяОрганизации.СписокВыбора.Добавить("< не указано >");
	КонецЕсли; 
	
	Элементы.ДолжностьРуководителяОрганизацииАнгл.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(СведенияОрганизацияАнгл.ДолжностьРуководителя) Тогда
		Элементы.ДолжностьРуководителяОрганизацииАнгл.СписокВыбора.Добавить(СведенияОрганизацияАнгл.ДолжностьРуководителя);
	КонецЕсли;	
	Если Элементы.ДолжностьРуководителяОрганизацииАнгл.СписокВыбора.Количество() = 0 Тогда
		Элементы.ДолжностьРуководителяОрганизацииАнгл.СписокВыбора.Добавить("< не указано >");
	КонецЕсли; 
	
	#КонецОбласти 
	
	// --- 
	
	#Область Руководитель
	
	Элементы.РуководительОрганизации.СписокВыбора.Очистить();
	Если (ЗначениеЗаполнено(ОтветственныеЛица.Руководитель)) Тогда
		Элементы.РуководительОрганизации.СписокВыбора.Добавить(ОтветственныеЛица.Руководитель);
	КонецЕсли; 
	Если (Элементы.РуководительОрганизации.СписокВыбора.Количество() =0) Тогда
		Элементы.РуководительОрганизации.СписокВыбора.Добавить(Справочники.ФизическиеЛица.ПустаяСсылка(),"< не указано >");
	КонецЕсли; 
	
	#КонецОбласти 
	
	// --- 
	
	#Область ГлавныйБухгалтерОрганизации
	
	Элементы.ГлавныйБухгалтерОрганизации.СписокВыбора.Очистить();
	Если (ЗначениеЗаполнено(ОтветственныеЛица.ГлавныйБухгалтер)) Тогда
		Элементы.ГлавныйБухгалтерОрганизации.СписокВыбора.Добавить(ОтветственныеЛица.ГлавныйБухгалтер);
	КонецЕсли; 
	Если (Элементы.ГлавныйБухгалтерОрганизации.СписокВыбора.Количество() =0) Тогда
		Элементы.ГлавныйБухгалтерОрганизации.СписокВыбора.Добавить(Справочники.ФизическиеЛица.ПустаяСсылка(),"< не указано >");
	КонецЕсли; 
	
	#КонецОбласти 
	
	// --- 
	
	#КонецОбласти 
	
	#КонецОбласти 
	
	// --- 
КонецФункции

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	_РуководительОрганизацииАнглПриИзменении();
	_ГлавныйБухгалтерОрганизацииАнглПриИзменении();
	
	СтруктураПараметровБухУчета = Новый Структура;
	
	Если ТипЗнч(Запись.Договор) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		СтруктураПараметровБухУчета.Вставить("Договор", 			Запись.Договор);
		СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",	ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка"));
	Иначе
		СтруктураПараметровБухУчета.Вставить("Договор",				Запись.Договор.Договор);
		СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",	Запись.Договор);
	КонецЕсли;
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета);
	
	Элементы.ПорядокЗачетаАвансов.Доступность = ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет;
	
	// Видимость элементов группы "Расчет вознаграждения"
	Элементы.МоментАвтоматическогоВыставленияВознаграждения.Видимость = Запись.АвтоматическийРасчетВознаграждения;
	Элементы.ГруппаВариантРасчета.Видимость = Запись.АвтоматическийРасчетВознаграждения;
	Элементы.ГруппаНоменклатураВознаграждения.Видимость = Запись.АвтоматическийРасчетВознаграждения;
	Элементы.ИсключатьКН.Видимость = Запись.АвтоматическийРасчетВознаграждения;
	
	Если Запись.АвтоматическийРасчетВознаграждения Тогда 
		Если Запись.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ПроцентОтСуммы Тогда
			
			Элементы.РазмерАгентскогоВознаграждения.Видимость = Истина;
			Элементы.РазмерАгентскогоВознаграждения.Заголовок = "Процент";
			Элементы.ИсключатьКН.Видимость = Истина;
			Элементы.МоментАвтоматическогоВыставленияВознаграждения.Доступность = Истина;
			Элементы.СтавкаНДС.Видимость = Истина;
			
		ИначеЕсли Запись.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ФиксированнаяСумма Тогда 
			
			Элементы.РазмерАгентскогоВознаграждения.Видимость = Истина;
			Элементы.РазмерАгентскогоВознаграждения.Заголовок = "Сумма, "+Валюта.Наименование;
			Элементы.ИсключатьКН.Видимость = Ложь;
			Элементы.МоментАвтоматическогоВыставленияВознаграждения.Доступность = Истина;
			Элементы.СтавкаНДС.Видимость = Истина;
			
		ИначеЕсли Запись.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ДоходыМинусРасходы Тогда 
			
			Элементы.РазмерАгентскогоВознаграждения.Видимость = Ложь;
			Элементы.ИсключатьКН.Видимость = Ложь;
			Элементы.МоментАвтоматическогоВыставленияВознаграждения.Доступность = Ложь;
			Элементы.СтавкаНДС.Видимость = Ложь;
			
		Иначе
			
			Элементы.РазмерАгентскогоВознаграждения.Видимость = Ложь;
			Элементы.ИсключатьКН.Видимость = Ложь;
			Элементы.МоментАвтоматическогоВыставленияВознаграждения.Доступность = Ложь;
			Элементы.СтавкаНДС.Видимость = Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	
	
	// в зависимости от варианта печати обеспечим доступ к данным на английском языке
	Если БазоваяВалюта = Валюта  Тогда 
		//Элементы.РеквизитыАнглийскийЯзык.Видимость 	= Ложь;
		//Элементы.РеквизитыРусскийЯзык.Видимость 	= Ложь;
		Элементы.СтраницыДопИнфо.ТекущаяСтраница 	= Элементы.СтраницаДопИнфоРус;
	Иначе 
		//Элементы.РеквизитыАнглийскийЯзык.Видимость 	= Истина;
		//Элементы.РеквизитыРусскийЯзык.Видимость 	= Истина;
		Элементы.СтраницыДопИнфо.ТекущаяСтраница 	= Элементы.СтраницаДопИнфоРусАнгл;
	КонецЕсли;
	
	Элементы.ГруппаРеквизитыДокументов.Видимость = ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	Элементы.ГруппаРасчетВознаграждения.Видимость = Не ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	
	// отображение и скрытие лишних элементов
	Элементы.ГруппаПодписантыИзКарточки.Видимость 	= Запись.РежимПодписей = 0;   
	Элементы.ГруппаФиксированные.Видимость 			= Запись.РежимПодписей = 1;  
	Элементы.ГруппаФиксированыеАнгл.Видимость 		= Запись.РежимПодписей = 1;  
	Элементы.ВариантПодписей.Видимость 				= Запись.РежимПодписей = 2;  
	Элементы.ВариантПодписейАнгл.Видимость 			= Запись.РежимПодписей = 2;  
	
	Элементы.ЗаполнитьРеквизитыОрганизацииРус.Видимость = Не (Запись.ИзКарточкиОрганизации и Запись.РежимПодписей = 0);  
	
	Элементы.ОсновнойПорядокОтраженияДоходов.Видимость = (ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Элементы.ОсновнойПорядокОтраженияРасходов.Видимость = (ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	Элементы.ДополнениеВШапкеСчета.Видимость     			= Запись.ВыводитьДополнениеВШапкуСчета 	И (Запись.ЯзыкПечатиДокументов = 0 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ДополнениеВШапкеСчетаАнгл.Видимость 			= Запись.ВыводитьДополнениеВШапкуСчета 	И (Запись.ЯзыкПечатиДокументов = 1 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ПодвалВСчете.Видимость    						= Запись.ВыводитьПодвалВСчете = 2 		И (Запись.ЯзыкПечатиДокументов = 0 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ПодвалВСчетеАнгл.Видимость 					= Запись.ВыводитьПодвалВСчете = 2 		И (Запись.ЯзыкПечатиДокументов = 1 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ДополнениеВШапкеАкта.Видимость     			= Запись.ВыводитьДополнениеВШапкуАкта 	И (Запись.ЯзыкПечатиДокументов = 0 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ДополнениеВШапкеАктаАнгл.Видимость 			= Запись.ВыводитьДополнениеВШапкуАкта 	И (Запись.ЯзыкПечатиДокументов = 1 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ДополнениеВШапкеСчф.Видимость     				= Запись.ВыводитьДополнениевШапкуСчф 	И (Запись.ЯзыкПечатиДокументов = 0 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ДополнениеВШапкеСчфАнгл.Видимость 				= Запись.ВыводитьДополнениевШапкуСчф 	И (Запись.ЯзыкПечатиДокументов = 1 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	
	Элементы.ДополнениеВШапкеРасчетаАкта.Видимость		= Запись.ВыводитьДополнениевШапкуРасчетаАкта 	И (Запись.ЯзыкПечатиДокументов = 0 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ДополнениеВШапкеРасчетаАктаАнгл.Видимость	= Запись.ВыводитьДополнениевШапкуРасчетаАкта 	И (Запись.ЯзыкПечатиДокументов = 1 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	
	ПриИзмененииФлагаВыводитьДополнениеВПодвалеОтчетаЭкспедитора();
	ПриИзмененииФлагаВыводитьДополнениеВШапкеОтчетаЭкспедитора();
	
	Элементы.ТипЦен.Видимость 	= Не ЕстьОграниченияНоменклатуры;
	Элементы.ГруппаСФ.Видимость = ВалютаРегламентированногоУчетаРубль;
	
	Элементы.ГруппаРасчетКАкту.Видимость 				= Запись.ТребуетсяРасчетКАкту;
	Элементы.ДополнениеВШапкеСправкиКАкту.Видимость		= Запись.ВыводитьДополнениевШапкуСправкиКАкту;
	Элементы.ГруппаСправка.Видимость					= Запись.ФормироватьСправку;

	Элементы.ДополнениеПодвалаАктаРус.Видимость     	= Запись.ВыводитьДополнениеВПодавлеАкта И (Запись.ЯзыкПечатиДокументов = 0 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ДополнениеПодвалаАктаАнгл.Видимость 		= Запись.ВыводитьДополнениеВПодавлеАкта И (Запись.ЯзыкПечатиДокументов = 1 ИЛИ Запись.ЯзыкПечатиДокументов = 2);

	Элементы.ДополнениеПодвалаРасчетаРус.Видимость     	= Запись.ВыводитьДополнениеВПодавлеРасчета И (Запись.ЯзыкПечатиДокументов = 0 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ДополнениеПодвалаРасчетаАнгл.Видимость 	= Запись.ВыводитьДополнениеВПодавлеРасчета И (Запись.ЯзыкПечатиДокументов = 1 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	
	Элементы.НужноПечататьQRКод.Видимость = Запись.ЯзыкПечатиДокументов = 0;
	
	УстановитьВидимостьРеквизитовОрганизции();
	УстановитьВидимостьРеквизитовКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()

	Элементы.ПредставлениеАгентаДляСчетаФактуры.Видимость = Не Запись.ПродавецПоСФСвояОрганизация и НЕ Запись.ИспользуетсяУниверсальныйДокумент;

КонецПроцедуры // УправлениеЭлементамиФормы()

&НаСервере
Процедура _ВыделитьКнопкуЯзыка(Язык)
	// --- 
	
	ЦветФона = Новый Цвет(83,106,194);
	ЦветТекста = WebЦвета.Белый;
	
	Элементы.РеквизитыРусскийЯзык.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	Элементы.РеквизитыАнглийскийЯзык.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	// --- 
	Элементы.РеквизитыРусскийЯзык.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	Элементы.РеквизитыАнглийскийЯзык.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	
	Если Язык = "RU" Тогда
		
		Элементы.РеквизитыРусскийЯзык.ЦветФона = ЦветФона;
		Элементы.РеквизитыРусскийЯзык.ЦветТекста = ЦветТекста;
		
	Иначе
		
		Элементы.РеквизитыАнглийскийЯзык.ЦветФона = ЦветФона;
		Элементы.РеквизитыАнглийскийЯзык.ЦветТекста = ЦветТекста;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаСервере
Процедура _СформироватьПараметрыВыбораДляЭлементов()
	// --- 
	
	// р/с контрагента
	// ---------------------------------------------------------------------------- 
	ПВ = _сф.ст_Создать("Владелец,ВалютаДенежныхСредств");
	ПВ.Владелец = Договор.Владелец;
	ПВ.ВалютаДенежныхСредств = ?(Договор.ВзаиморасчетыВУЕ, CW_Настройки.ВалютаРегламентированногоУчета(),Валюта);
	Элементы.РасчетныйСчетКонтрагентаРус.ПараметрыВыбора = _УФКС.СформироватьПараметрыВыбораПоля(ПВ);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьУчетнуюПолитику()
	// --- 
	
	мПараметрыУчетнойПолитикиОрганизации = CW_Настройки.ПараметрыУчетнойПолитики(Запись.Период, Договор.Организация);
	НаименованиеОрганизацииАнгл = мПараметрыУчетнойПолитикиОрганизации.НаименованиеОрганизацииАнгл;
	АдресУчетнойПолитики = ПоместитьВоВременноеХранилище(мПараметрыУчетнойПолитикиОрганизации,ЭтаФорма.УникальныйИдентификатор);
		
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДопИнфо()
	// --- 
	
	Если ЗначениеЗаполнено(Запись.ДопИнфоДляПечатиСчетовРуб) Тогда 
		Элементы.ДопИнфоДляПечатиСчетовРуб.Доступность = Истина;
		флРедактироватьДопИнфоРуб = Истина;
	Иначе 
		Элементы.ДопИнфоДляПечатиСчетовРуб.Доступность = Ложь;
		//мД = ЭтаФорма.Модифицированность;
		//Элементы.ДопИнфоДляПечатиСчетовРуб.ВыделенныйТекст = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовРуб");
		//ЭтаФорма.Модифицированность = мД;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ДопИнфоДляПечатиСчетовВалРус) Тогда 
		Элементы.ДопИнфоДляПечатиСчетовВалРус.Доступность = Истина;
		флРедактироватьДопИнфоВалРус = Истина;
	Иначе 
		Элементы.ДопИнфоДляПечатиСчетовВалРус.Доступность = Ложь;
		//мД = ЭтаФорма.Модифицированность;
		//Элементы.ДопИнфоДляПечатиСчетовВалРус.ВыделенныйТекст = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовВалРус");
		//ЭтаФорма.Модифицированность = мД;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ДопИнфоДляПечатиСчетовВалАнгл) Тогда 
		Элементы.ДопИнфоДляПечатиСчетовВалАнгл.Доступность = Истина;
		флРедактироватьДопИнфоВалАнгл = Истина;
	Иначе 
		Элементы.ДопИнфоДляПечатиСчетовВалАнгл.Доступность = Ложь;
		//ЭтаФорма.Модифицированность = мД;
		//Элементы.ДопИнфоДляПечатиСчетовВалАнгл.ВыделенныйТекст = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовВалАнгл");
		//ЭтаФорма.Модифицированность = мД;
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	_ЗаполнитьСпискиРеквизитов();
	_ОбновитьУчетнуюПолитику();
	ОбновитьДопИнфо();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическийРасчетВознагражденияПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры
 
 &НаСервере
Функция _СформироватьСписокВыбораАдреса(ИмяЭлемента)
	// --- 
	
	СписокВыбора = Новый СписокЗначений;
	
	СведенияКонтрагент = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Договор.Владелец, Запись.Период); // ВызовБП
	
	Возврат(СписокВыбора);
	
	// --- 
КонецФункции

&НаСервере
Функция _СформироватьСписокВыбораРуководителя(ИмяЭлемента)
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Договор.Владелец);
	
	Запрос.Текст=
		"ВЫБРАТЬ
		|	КонтактныеЛица.Должность,
		|	КонтактныеЛица.Ссылка,
		|	КонтактныеЛица.Наименование
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.ОбъектВладелец = &Контрагент";
		Выборка = Запрос.Выполнить().Выбрать();
		Спис = Новый СписокЗначений;

		Если Выборка.Количество() <> 0 тогда
			Пока Выборка.Следующий() цикл
				Если не Выборка.Ссылка.ЭтоГруппа Тогда
					Если Прав(ИмяЭлемента, 4)="Англ" Тогда 
						Спис.Добавить(_СФ.Стр_Транслит(Выборка.Наименование), _СФ.Стр_Транслит(Выборка.Наименование) + " (" + Выборка.Должность + ")");
					Иначе 
						Спис.Добавить(Выборка.Ссылка, Выборка.Наименование + " (" + (Выборка.Должность) + ")");
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
		Иначе
			Спис.Добавить(,"<<< Нет сотрудников >>>");	
		КонецЕсли;
	Возврат(спис);
	
	// --- 
КонецФункции

&НаСервере
Процедура _РуководительКонтрагентаРусОбработкаВыбора()
	// --- 
	
	Если НЕ ЗначениеЗаполнено(Запись.ДолжностьРуководителя) Тогда
		Запрос = Новый Запрос;		
		Запрос.Текст =		
			"ВЫБРАТЬ
			|	КонтактныеЛица.Должность
			|ИЗ
			|	Справочник.КонтактныеЛица КАК КонтактныеЛица
			|ГДЕ
			|	КонтактныеЛица.ОбъектВладелец = &Контрагент
			|	И КонтактныеЛица.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Контрагент", Договор.Владелец);
		Запрос.УстановитьПараметр("Ссылка", Запись.Руководитель);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() <> 0 Тогда
			Пока Выборка.Следующий() цикл
				Запись.ДолжностьРуководителя = Выборка.Должность;
			КонецЦикла;	
		КонецЕсли;	
		
	КонецЕсли;	
	
	// --- 
КонецПроцедуры
 
#Область ЗаполнениеРеквизитовОрганизации 

&НаКлиенте
Процедура ЗаполнитьРеквизитыОрганизацииРус(Команда)
	
	_ЗаполнитьРеквизитыОрганизацииРус();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыОрганизацииАнгл(Команда)
	
	_ЗаполнитьРеквизитыОрганизацииАнгл();
	
КонецПроцедуры

// --- 

&НаСервере
Процедура _ЗаполнитьРеквизитыОрганизацииРус()
	// --- 
	
	Если Не Запись.РежимПодписей = 0 Тогда
		//Создаем отбор для получения бухгалтера
		Отбор = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо", Договор.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		Запись.ГлавныйБухгалтерОрганизации = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(Запись.Период, Отбор).ФизическоеЛицо;
		
		//Меняем отбор для получения руководителя
		Отбор.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель;
		рс = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(ТекущаяДата(), Отбор); // МетаданныеБП
		Запись.РуководительОрганизации          = рс.ФизическоеЛицо;
		Запись.ДолжностьРуководителяОрганизации = рс.Должность;
	КонецЕсли;
	
	Если Не Запись.ИзКарточкиОрганизации Тогда
		_СведенияОбОрганизации = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Договор.Организация, Запись.Период); // ВызовБП
		Запись.АдресОрганизации   =_СведенияОбОрганизации.ЮридическийАдрес;
		Запись.ТелефонОрганизации =_СведенияОбОрганизации.Телефоны;
		
		Запись.РасчетныйСчетОрганизации = Договор.Организация.ОсновнойБанковскийСчет;	
	КонецЕсли;
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьРеквизитыОрганизацииАнгл()
	// --- 
	
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	CW_ИностранныеБанковскиеСчета.Ссылка
		|ИЗ
		|	Справочник.CW_ИностранныеБанковскиеСчета КАК CW_ИностранныеБанковскиеСчета
		|ГДЕ
		|	CW_ИностранныеБанковскиеСчета.Владелец = &Организация
		|	И CW_ИностранныеБанковскиеСчета.ВалютаДенежныхСредств = &Валюта"
	);
	з.УстановитьПараметр("Организация", Договор.Организация);
	з.УстановитьПараметр("Валюта", Валюта);
	рз = з.Выполнить();
	выб = рз.Выбрать();
	Если выб.Следующий() Тогда 
		Запись.РасчетныйСчетОрганизацииИностранный = выб.Ссылка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.РуководительОрганизации) Тогда 
		Отбор = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо", Договор.Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		рс = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(ТекущаяДата(), Отбор);
		Запись.РуководительОрганизации          = рс.ФизическоеЛицо;
		Запись.ДолжностьРуководителяОрганизации = рс.Должность;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.ГлавныйБухгалтерОрганизации) Тогда 
		Отбор = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо", Договор.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		Запись.ГлавныйБухгалтерОрганизации = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(ТекущаяДата(), Отбор).ФизическоеЛицо;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.РуководительОрганизации) Тогда 
		стр = РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Запись.РуководительОрганизации);
		Если НЕ ЗначениеЗаполнено(стр) Тогда 
			стр = _СФ.Стр_Транслит(Запись.РуководительОрганизации.Наименование);
			РегистрыСведений.CW_ПараметрыСотрудников.УстановитьФамилиюИмяАнгл(Запись.РуководительОрганизации, стр);
		КонецЕсли;
		_РуководительОрганизацииАнглПриИзменении();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ГлавныйБухгалтерОрганизации) Тогда 
		стр = РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Запись.ГлавныйБухгалтерОрганизации);
		Если НЕ ЗначениеЗаполнено(стр) Тогда 
			стр = _СФ.Стр_Транслит(Запись.ГлавныйБухгалтерОрганизации.Наименование);
			РегистрыСведений.CW_ПараметрыСотрудников.УстановитьФамилиюИмяАнгл(Запись.ГлавныйБухгалтерОрганизации, стр);
		КонецЕсли;
		_ГлавныйБухгалтерОрганизацииАнглПриИзменении();
	КонецЕсли;

	з = Новый Запрос(
		"ВЫБРАТЬ
		|	CW_УчетнаяПолитикаСрезПоследних.ДолжностьРуководителяОрганизацииАнгл,
		|	CW_УчетнаяПолитикаСрезПоследних.АдресОрганизацииАнгл
		|ИЗ
		|	РегистрСведений.CW_УчетнаяПолитика.СрезПоследних КАК CW_УчетнаяПолитикаСрезПоследних
		|ГДЕ
		|	CW_УчетнаяПолитикаСрезПоследних.Организация = &Организация"
	);
	з.УстановитьПараметр("Организация", Договор.Организация);
	рз = з.Выполнить();
	выб = рз.Выбрать();
	Если выб.Следующий() Тогда 
		Если ЗначениеЗаполнено(выб.АдресОрганизацииАнгл) Тогда 
			Запись.АдресОрганизацииАнгл = выб.АдресОрганизацииАнгл;
		КонецЕсли;
		Если ЗначениеЗаполнено(выб.ДолжностьРуководителяОрганизацииАнгл) Тогда 
			Запись.ДолжностьРуководителяОрганизацииАнгл = выб.ДолжностьРуководителяОрганизацииАнгл;
		КонецЕсли;
	КонецЕсли;
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ЗаполнениеРеквизитовКонтрагента

&НаКлиенте
Процедура ЗаполнитьРеквизитыКонтрагентаРус(Команда)
	
	_ЗаполнитьРеквизитыКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыКонтрагентаАнгл(Команда)
	
	_ЗаполнитьРеквизитыКонтрагента();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруНеобходимыхРеквизитов()
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Адрес"						, "");
	Реквизиты.Вставить("АдресАнгл"					, "");
	Реквизиты.Вставить("Телефон"					, "");
	Реквизиты.Вставить("РасчетныйСчет"				, Неопределено);
	Реквизиты.Вставить("ДолжностьРуководителя"		, "");
	Реквизиты.Вставить("Руководитель"				, "");
	Реквизиты.Вставить("ДолжностьРуководителяАнгл"	, "");
	Реквизиты.Вставить("РуководительАнгл"			, "");
	Реквизиты.Вставить("ГлавныйБухгалтер"			, "");
	Реквизиты.Вставить("ГлавныйБухгалтерАнгл"		, "");
	
	Возврат Реквизиты;
	
КонецФункции

&НаСервере
Функция _ЗаполнитьРеквизитыКонтрагента()
	
	Реквизиты = ПолучитьСтруктуруНеобходимыхРеквизитов();
	
	ВладелецДоговора	= ТекущийКонтрагент;
	ПериодЗаписи 		= Запись.Период;
	
	СведенияКонтрагент = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(ВладелецДоговора, ПериодЗаписи); // ВызовБП
	
	//Адрес
	СведенияКонтрагент.Свойство("ЮридическийАдрес", Реквизиты.Адрес);
	Если Не ЗначениеЗаполнено(Реквизиты.Адрес) Тогда
		СведенияКонтрагент.Свойство("ФактическийАдрес", Реквизиты.Адрес);
	КонецЕсли;
	Реквизиты.АдресАнгл = _сф.стр_Транслит(Реквизиты.Адрес);
	
	СведенияКонтрагент.Свойство("Телефоны"	, Реквизиты.Телефон);
	
	
	Реквизиты.РасчетныйСчет = БухгалтерскийУчетПереопределяемый.ПолучитьБанковскийСчетПоУмолчанию(ВладелецДоговора);
	
	//Данные контактных лиц
	РольРуководителя 		= Константы.CW_РольРуководителя.Получить();
	РольГлавногоБухгалтера 	= Константы.CW_РольГлавногоБухгалтера.Получить();
	
	мРоли = Новый Массив;
	Если ЗначениеЗаполнено(РольРуководителя) Тогда
		мРоли.Добавить(РольРуководителя);	
	КонецЕсли;
	Если ЗначениеЗаполнено(РольГлавногоБухгалтера) Тогда
		мРоли.Добавить(РольГлавногоБухгалтера);	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактныеЛица.Ссылка КАК Ссылка,
	               |	КонтактныеЛица.Фамилия КАК Фамилия,
	               |	КонтактныеЛица.Имя КАК Имя,
	               |	КонтактныеЛица.Отчество КАК Отчество,
	               |	КонтактныеЛица.Роль КАК Роль,
	               |	КонтактныеЛица.Должность КАК Должность
	               |ИЗ
	               |	Справочник.КонтактныеЛица КАК КонтактныеЛица
	               |ГДЕ
	               |	КонтактныеЛица.ОбъектВладелец = &Контрагент
	               |	И КонтактныеЛица.Роль В(&мРоли)";	
	
	Запрос.УстановитьПараметр("Контрагент"	, ВладелецДоговора);
	Запрос.УстановитьПараметр("мРоли"		, мРоли);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Роль = РольРуководителя Тогда
			Реквизиты.Руководитель 			= Выборка.Фамилия+" "+Выборка.Имя+" "+Выборка.Отчество;
			Реквизиты.ДолжностьРуководителя = Выборка.Должность;
			
			Реквизиты.РуководительАнгл			=  _сф.стр_Транслит(Реквизиты.Руководитель);
			Реквизиты.ДолжностьРуководителяАнгл	=  _сф.стр_Транслит(Реквизиты.ДолжностьРуководителя);
		КонецЕсли;
		
		Если Выборка.Роль = РольГлавногоБухгалтера Тогда
			Реквизиты.ГлавныйБухгалтер		= Выборка.Фамилия+" "+Выборка.Имя+" "+Выборка.Отчество;
			Реквизиты.ГлавныйБухгалтерАнгл	=  _сф.стр_Транслит(Реквизиты.ГлавныйБухгалтер);
		КонецЕсли;	
		
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Запись, Реквизиты);
	
КонецФункции
 

#КонецОбласти 

&НаКлиенте
Процедура РуководительОрганизацииАнглПриИзменении(Элемент)
	
	_РуководительОрганизацииАнглПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _РуководительОрганизацииАнглПриИзменении()
	// --- 
	
	Если ЗначениеЗаполнено(Запись.РуководительОрганизации) Тогда 
		стр = РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Запись.РуководительОрганизации);
		Если ЗначениеЗаполнено(стр) Тогда 
			Элементы.НадписьРуководительОрганизацииФамилияИмяАнгл.Заголовок = стр;
		Иначе 
			Элементы.НадписьРуководительОрганизацииФамилияИмяАнгл.Заголовок = "(задать)";
		КонецЕсли;
	Иначе 
		Элементы.НадписьРуководительОрганизацииФамилияИмяАнгл.Заголовок = "";
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ГлавныйБухгалтерОрганизацииАнглПриИзменении(Элемент)
	
	_ГлавныйБухгалтерОрганизацииАнглПриИзменении();
	
КонецПроцедуры
 
&НаСервере
Процедура _ГлавныйБухгалтерОрганизацииАнглПриИзменении()
	// --- 
	
	Если ЗначениеЗаполнено(Запись.ГлавныйБухгалтерОрганизации) Тогда 
		стр = РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Запись.ГлавныйБухгалтерОрганизации);
		Если ЗначениеЗаполнено(стр) Тогда 
			Элементы.НадписьГлавныйБухгалтерОрганизацииФамилияИмяАнгл.Заголовок = стр;
		Иначе 
			Элементы.НадписьГлавныйБухгалтерОрганизацииФамилияИмяАнгл.Заголовок = "(задать)";
		КонецЕсли;
	Иначе 
		Элементы.НадписьГлавныйБухгалтерОрганизацииФамилияИмяАнгл.Заголовок = "";
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПолучитьДопИнфо(Тип)
	// --- 
	
	УП = ПолучитьИзВременногоХранилища(АдресУчетнойПолитики);
	Возврат(УП[Тип]);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ДопИнфоДляПечатиСчетовРубПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Запись.ДопИнфоДляПечатиСчетовРуб) Тогда 
		
		Элементы.ДопИнфоДляПечатиСчетовРуб.Доступность = Ложь;
		Элементы.ДопИнфоДляПечатиСчетовРуб.ВыделенныйТекст = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовРуб");
		флРедактироватьДопИнфоРуб = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура флРедактироватьДопИнфоРубПриИзменении(Элемент)
	
	Если флРедактироватьДопИнфоРуб Тогда 
		
		Элементы.ДопИнфоДляПечатиСчетовРуб.Доступность = Истина;
		Если НЕ ЗначениеЗаполнено(Запись.ДопИнфоДляПечатиСчетовРуб) Тогда 
			//Запись.ДопИнфоДляПечатиСчетовРуб = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовРуб");
		КонецЕсли;
		
	Иначе 
		
		Запись.ДопИнфоДляПечатиСчетовРуб = "";
		Элементы.ДопИнфоДляПечатиСчетовРуб.Доступность = Ложь;
		//Элементы.ДопИнфоДляПечатиСчетовРуб.ВыделенныйТекст = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовРуб");
		флРедактироватьДопИнфоРуб = Ложь;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопИнфоДляПечатиСчетовВалРусПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Запись.ДопИнфоДляПечатиСчетовВалРус) Тогда 
		
		Элементы.ДопИнфоДляПечатиСчетовВалРус.Доступность = Ложь;
		Элементы.ДопИнфоДляПечатиСчетовВалРус.ВыделенныйТекст = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовВалРус");
		флРедактироватьДопИнфоВалРус = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура флРедактироватьДопИнфоВалРусПриИзменении(Элемент)
	
	Если флРедактироватьДопИнфоВалРус Тогда 
		
		Элементы.ДопИнфоДляПечатиСчетовВалРус.Доступность = Истина;
		Если НЕ ЗначениеЗаполнено(Запись.ДопИнфоДляПечатиСчетовВалРус) Тогда 
			//Запись.ДопИнфоДляПечатиСчетовВалРус = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовВалРус");
		КонецЕсли;
		
	Иначе 
		
		Запись.ДопИнфоДляПечатиСчетовВалРус = "";
		Элементы.ДопИнфоДляПечатиСчетовВалРус.Доступность = Ложь;
		Элементы.ДопИнфоДляПечатиСчетовВалРус.ВыделенныйТекст = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовВалРус");
		флРедактироватьДопИнфоВалРус = Ложь;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопИнфоДляПечатиСчетовВалАнглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Запись.ДопИнфоДляПечатиСчетовВалАнгл) Тогда 
		
		Элементы.ДопИнфоДляПечатиСчетовВалАнгл.Доступность = Ложь;
		Элементы.ДопИнфоДляПечатиСчетовВалАнгл.ВыделенныйТекст = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовВалАнгл");
		флРедактироватьДопИнфоВалАнгл = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура флРедактироватьДопИнфоВалАнглПриИзменении(Элемент)
	
	Если флРедактироватьДопИнфоВалАнгл Тогда 
		
		Элементы.ДопИнфоДляПечатиСчетовВалАнгл.Доступность = Истина;
		Если НЕ ЗначениеЗаполнено(Запись.ДопИнфоДляПечатиСчетовВалАнгл) Тогда 
			//Запись.ДопИнфоДляПечатиСчетовВалАнгл = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовВалАнгл");
		КонецЕсли;
		
	Иначе 
		
		Запись.ДопИнфоДляПечатиСчетовВалАнгл = "";
		Элементы.ДопИнфоДляПечатиСчетовВалАнгл.Доступность = Ложь;
		Элементы.ДопИнфоДляПечатиСчетовВалАнгл.ВыделенныйТекст = _ПолучитьДопИнфо("ДопИнфоДляПечатиСчетовВалАнгл");
		флРедактироватьДопИнфоВалАнгл = Ложь;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантРасчетаВознагражденияПриИзменении(Элемент)
	
	Если Запись.ВариантРасчетаВознаграждения.Пустая() Тогда
		
		Запись.ВариантРасчетаВознаграждения=ПредопределенноеЗначение("Перечисление.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ДоходыМинусРасходы");
		Запись.МоментАвтоматическогоВыставленияВознаграждения=ПредопределенноеЗначение("Перечисление.CW_МоментАвтоматическогоВыставленияВознаграждения.ОтдельнымДокументом");
		
	ИначеЕсли Запись.ВариантРасчетаВознаграждения=ПредопределенноеЗначение("Перечисление.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ДоходыМинусРасходы") Тогда 
		
		 Запись.МоментАвтоматическогоВыставленияВознаграждения=ПредопределенноеЗначение("Перечисление.CW_МоментАвтоматическогоВыставленияВознаграждения.ОтдельнымДокументом");
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыРусскийЯзык(Команда)
	
	Элементы.СтраницыРеквизитыКонтрагента.ТекущаяСтраница = Элементы.СтраницаРеквизитыКонтрагентаРус;
	Элементы.СтраницыРеквизитыОрганизации.ТекущаяСтраница = Элементы.СтраницаРеквизитыОрганизацииРус;
	_ВыделитьКнопкуЯзыка("RU");
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыАнглийскийЯзык(Команда)
	
	Элементы.СтраницыРеквизитыКонтрагента.ТекущаяСтраница = Элементы.СтраницаРеквизитыКонтрагентаАнгл;
	Элементы.СтраницыРеквизитыОрганизации.ТекущаяСтраница = Элементы.СтраницаРеквизитыОрганизацииАнгл;
	_ВыделитьКнопкуЯзыка("EN");
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокЗачетаАвансовПриИзменении(Элемент)
	
	Если Запись.ПорядокЗачетаАвансов.Пустая() Тогда
		
		Запись.ПорядокЗачетаАвансов=ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	Если Запись.СтавкаНДС.Пустая() Тогда
		
		Запись.СтавкаНДС = ПолучиьСтавкуНДС();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучиьСтавкуНДС()
	
	Возврат  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(Запись.Номенклатура);
	 
КонецФункции

&НаКлиенте
Процедура НадписьРуководительОрганизацииФамилияИмяАнглНажатие(Элемент)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияРуководителяАнгл",ЭтотОбъект); 
	ОткрытьФорму("РегистрСведений.CW_ПараметрыСотрудников.ФормаЗаписи",_ПФ_Руководитель(),,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияРуководителяАнгл(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	_РуководительОрганизацииАнглПриИзменении();
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПФ_Руководитель()
	// --- 
	
	КлючЗаписи = РегистрыСведений.CW_ПараметрыСотрудников.СоздатьКлючЗаписи(Новый Структура("Сотрудник",Запись.РуководительОрганизации));
	ПФ = Новый Структура("Ключ",КлючЗаписи);
	Возврат(ПФ);
	
	// --- 
КонецФункции
 
&НаКлиенте
Процедура НадписьГлавныйБухгалтерОрганизацииФамилияИмяАнглНажатие(Элемент)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияБухгалтераАнгл",ЭтотОбъект); 
	ОткрытьФорму("РегистрСведений.CW_ПараметрыСотрудников.ФормаЗаписи",_ПФ_ГлавныйБухгалтер(),,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияБухгалтераАнгл(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	_ГлавныйБухгалтерОрганизацииАнглПриИзменении();
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПФ_ГлавныйБухгалтер()
	// --- 
	
	КлючЗаписи = РегистрыСведений.CW_ПараметрыСотрудников.СоздатьКлючЗаписи(Новый Структура("Сотрудник",Запись.ГлавныйБухгалтерОрганизации));
	ПФ = Новый Структура("Ключ",КлючЗаписи);
	Возврат(ПФ);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ЯзыкПечатиДокументовПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработатьИзменениеЯзыка",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеЯзыка() Экспорт 
	// --- 
	
	// для русскоязычной печати принудительно переключаемся на русские реквизиты
	Если Запись.ЯзыкПечатиДокументов = 0 Тогда
		Элементы.СтраницыРеквизитыКонтрагента.ТекущаяСтраница = Элементы.СтраницаРеквизитыКонтрагентаРус;
		Элементы.СтраницыРеквизитыОрганизации.ТекущаяСтраница = Элементы.СтраницаРеквизитыОрганизацииРус;
		_ВыделитьКнопкуЯзыка("RU");
	КонецЕсли;
	
 	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОрганизацииАнглНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.CW_УчетнаяПолитика.ФормаЗаписи",_ПараметрыФормыУчетнойПолитики());
	
КонецПроцедуры

&НаСервере
Функция _ПараметрыФормыУчетнойПолитики()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_УчетнаяПолитика.Период КАК Период
	|ИЗ
	|	РегистрСведений.CW_УчетнаяПолитика КАК CW_УчетнаяПолитика
	|ГДЕ
	|	CW_УчетнаяПолитика.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("Организация", Договор.Организация);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если (ТЗ.Количество() <> 0) Тогда
		
		Период = _сф.к_ПервыйЭлемент(ТЗ).Период;
		
	КонецЕсли; 
	 
	
	// пробуем получить ключ
	Отбор = Новый Структура("Организация,Период", Договор.Организация,Период);
	Ключ = РегистрыСведений.CW_УчетнаяПолитика.СоздатьКлючЗаписи(Отбор);
	// --- 	
	ПФ = Новый Структура("Ключ",Ключ);
	Возврат(ПФ);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ВыводитьДополнениевШапкуСчетаПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеВШапкеСчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблона", ЭтотОбъект); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеСчета.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблона(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		Запись.ДополнениеВШапкеСчета = Ответ;
		Элементы.ДополнениеВШапкеСчета.ОбновитьТекстРедактирования();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеВШапкеСчетаАнглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаАнгл", ЭтотОбъект); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеСчетаАнгл.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблонаАнгл(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		Запись.ДополнениеВШапкеСчетаАнгл = Ответ;
		Элементы.ДополнениеВШапкеСчетаАнгл.ОбновитьТекстРедактирования();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьДополнениевШапкуАктаПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьДополнениеВПодавлеАктаПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура ДополнениеВШапкеАктаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаАкта", ЭтотОбъект); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеАкта.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблонаАкта(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		Запись.ДополнениеВШапкеАкта = Ответ;
		Элементы.ДополнениеВШапкеАкта.ОбновитьТекстРедактирования();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеВШапкеАктаАнглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаАктаАнгл", ЭтотОбъект); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеАктаАнгл.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблонаАктаАнгл(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		Запись.ДополнениеВШапкеАктаАнгл = Ответ;
		Элементы.ДополнениеВШапкеАктаАнгл.ОбновитьТекстРедактирования();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПодвалВСчетеПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработатьИзменениеВыводитьПодвалВСчете",0.1,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеВыводитьПодвалВСчете() Экспорт 

	_УправлениеЭлементамиФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодвалВСчетеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПодвала", ЭтотОбъект); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ПодвалВСчете.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПодвала(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		Запись.ПодвалВСчете = Ответ;
		Элементы.ПодвалВСчете.ОбновитьТекстРедактирования();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПодвалВСчетеАнглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПодвалаАнгл", ЭтотОбъект); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ПодвалВСчетеАнгл.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПодвалаАнгл(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		Запись.ПодвалВСчетеАнгл = Ответ;
		Элементы.ПодвалВСчетеАнгл.ОбновитьТекстРедактирования();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСверткиНоменклатурыДляАктовПриИзменении(Элемент)
	
	// автоматически подставляем свертку акта для с\ф
	Если ЗначениеЗаполнено(Запись.ВариантСверткиНоменклатурыДляАктов) и (Не ЗначениеЗаполнено(Запись.ВариантСверткиНоменклатурыДляСФ)) Тогда
		Запись.ВариантСверткиНоменклатурыДляСФ = Запись.ВариантСверткиНоменклатурыДляАктов;		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПродавецПоСФСвояОрганизацияПриИзменении(Элемент)
	
	//AFR-233396
	//Запись.ВариантВыводаСводнойСчетФактуры = ?(Запись.ПродавецПоСФСвояОрганизация,0,1);
	//AFR-233396
	УправлениеЭлементамиФормы();
	
КонецПроцедуры


// ---------------------------------------------------------------------------- 
// подписи и печати

&НаКлиенте
Процедура ВыбратьПодписьРуководителя(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = 	"Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
	+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
	+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
	+ "Формат TIFF (*.tif)|*.tif|"
	+ "Формат GIF (*.gif)|*.gif|"
	+ "Формат PNG (*.png)|*.png|"
	+ "Формат icon (*.ico)|*.ico|"
	+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|"; // картинки
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Файл = МассивФайлов[0];
		
		АдресФайла = "";
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаЗагрузкиФайлаПодписиРуководителя",ЭтотОбъект, Новый Структура()); 
		НачатьПомещениеФайла(ПОВ,АдресФайла,Файл,Ложь,УникальныйИдентификатор);
		
	Иначе
		Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
		_УФК.ВывестиПредупреждение(НСтр(Текст));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПодписьГлавногоБухгалтера(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = 	"Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
	+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
	+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
	+ "Формат TIFF (*.tif)|*.tif|"
	+ "Формат GIF (*.gif)|*.gif|"
	+ "Формат PNG (*.png)|*.png|"
	+ "Формат icon (*.ico)|*.ico|"
	+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|"; // картинки
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Файл = МассивФайлов[0];
		
		АдресФайла = "";
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаЗагрузкиФайлаПодписиГлавногоБухгалтера",ЭтотОбъект, Новый Структура()); 
		НачатьПомещениеФайла(ПОВ,АдресФайла,Файл,Ложь,УникальныйИдентификатор);
		
	Иначе
		Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
		_УФК.ВывестиПредупреждение(НСтр(Текст));
	КонецЕсли;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОбработкаЗагрузкиФайлаПодписиРуководителя(Результат, АдресВременногоХранилищаФайла, ВыбранноеИмя, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Результат) Тогда
		
		Ответ = _ОбработатьЗагрузкуФайлаПодписиРуководителя(АдресВременногоХранилищаФайла);
		Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗагрузкиФайлаПодписиГлавногоБухгалтера(Результат, АдресВременногоХранилищаФайла, ВыбранноеИмя, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Результат) Тогда
		
		Ответ = _ОбработатьЗагрузкуФайлаПодписиГлавногоБухгалтера(АдресВременногоХранилищаФайла);
		Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _ОбработатьЗагрузкуФайлаПодписиРуководителя(Адрес)
	// --- 
	
	Попытка
		ДД = ПолучитьИзВременногоХранилища(Адрес);
		АдресПодписиРуководителя = ПоместитьВоВременноеХранилище(ДД,ЭтаФорма.УникальныйИдентификатор);
		ЭтотОбъект.Модифицированность = Истина;
		Возврат(_УФКС.Ответ());
	Исключение
	    Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	// --- 
КонецФункции

&НаСервере
Функция _ОбработатьЗагрузкуФайлаПодписиГлавногоБухгалтера(Адрес)
	// --- 
	
	Попытка
		ДД = ПолучитьИзВременногоХранилища(Адрес);
		АдресПодписиГлавногоБухгалтера = ПоместитьВоВременноеХранилище(ДД,ЭтаФорма.УникальныйИдентификатор);
		ЭтотОбъект.Модифицированность = Истина;
		Возврат(_УФКС.Ответ());
	Исключение
	    Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОчиститьПодписьРуководителя(Команда)
	
	АдресПодписиРуководителя = "";
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПодписьГлавногоБухгалтера(Команда)
	
	АдресПодписиГлавногоБухгалтера = "";
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ШаблонПодписи(Команда)
	
	Таблица = _ПолучитьШаблон("ШаблонПодписи");
	Таблица.Показать("Шаблон образца подписи");
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыбратьПечать(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = 	"Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
	+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
	+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
	+ "Формат TIFF (*.tif)|*.tif|"
	+ "Формат GIF (*.gif)|*.gif|"
	+ "Формат PNG (*.png)|*.png|"
	+ "Формат icon (*.ico)|*.ico|"
	+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|"; // картинки
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Файл = МассивФайлов[0];
		
		АдресФайла = "";
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаЗагрузкиФайлаПечати",ЭтотОбъект, Новый Структура()); 
		НачатьПомещениеФайла(ПОВ,АдресФайла,Файл,Ложь,УникальныйИдентификатор);
		
	Иначе
		Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
		_УФК.ВывестиПредупреждение(НСтр(Текст));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗагрузкиФайлаПечати(Результат, АдресВременногоХранилищаФайла, ВыбранноеИмя, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Результат) Тогда
		
		Ответ = _ОбработкаЗагрузкиФайлаПечати(АдресВременногоХранилищаФайла);
		Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ОбработкаЗагрузкиФайлаПечати(Адрес)
	// --- 
	
	Попытка
		ДД = ПолучитьИзВременногоХранилища(Адрес);
		АдресПечати = ПоместитьВоВременноеХранилище(ДД,ЭтаФорма.УникальныйИдентификатор);
		ЭтотОбъект.Модифицированность = Истина;
		Возврат(_УФКС.Ответ());
	Исключение
	    Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОчиститьПечать(Команда)
	
	АдресПечати = "";
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьШаблон(ИмяШаблона)
	// --- 
	
	Таблица = Новый ТабличныйДокумент;
	Макет = РегистрыСведений.CW_ПараметрыДоговоров.ПолучитьМакет(ИмяШаблона);
	Обл = Макет.ПолучитьОбласть("Область_Образцы");
	Таблица.Вывести(Обл);			
	Таблица.ОтображатьЗаголовки = Ложь;
	Таблица.ОтображатьСетку = Ложь;
	Таблица.СохранятьСвойстваОтображения = Истина;
	Таблица.ТолькоПросмотр = Истина;
	
	Возврат(Таблица);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ШаблонПечати(Команда)
	
	Таблица = _ПолучитьШаблон("ШаблонПечати");
	Таблица.Показать("Шаблон образца печатей");
	
КонецПроцедуры


// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ДополнениеВШапкеСчфНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаСчф", ЭтотОбъект); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеСчф.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблонаСчф(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		Запись.ДополнениеВШапкеСчф = Ответ;
		Элементы.ДополнениеВШапкеСчф.ОбновитьТекстРедактирования();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеВШапкеСчфАнглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаСчфАнгл", ЭтотОбъект); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеСчфАнгл.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблонаСчфАнгл(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		Запись.ДополнениеВШапкеСчфАнгл = Ответ;
		Элементы.ДополнениеВШапкеСчфАнгл.ОбновитьТекстРедактирования();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьДополнениевШапкуСчфПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьРеквизитыОрганизации(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияКарточкиОрганизации", ЭтотОбъект, ТекущаяОрганизация);
	
	ПараметрыОткрытияФормы = новый Структура;
	ПараметрыОткрытияФормы.Вставить("Ключ", ТекущаяОрганизация);
	
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта",параметрыОткрытияФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияКарточкиОрганизации(Результат, ДополнительныйПараметр) Экспорт
	
	ОбновитьДанныеОрганизацииИзКарточки(ДополнительныйПараметр);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзКарточкиОрганизацииПриИзменении(Элемент)
	
	ОбновитьДанныеОрганизацииИзКарточки(ТекущаяОрганизация);
	УстановитьВидимостьРеквизитовОрганизции();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРеквизитовОрганизции()
	
	Элементы.ГруппаРеквизитыПроизвольные.Видимость 	= НЕ Запись.ИзКарточкиОрганизации; 
	Элементы.ГруппаРеквизитыИзКарточки.Видимость 	= Запись.ИзКарточкиОрганизации;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеОрганизацииИзКарточки(Организация)
	
	СведенияОбОрганизации = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Организация, ТекущаяДата());
	
	РасчетныйСчетИзКарточкиОрганизации 	= "№"+СведенияОбОрганизации.НомерСчета +", в "+СведенияОбОрганизации.Банк;
	АдресИзКарточкиОрганизации 			= СведенияОбОрганизации.ЮридическийАдрес;
	ТелефонИзКарточкиОрганизации 		= СведенияОбОрганизации.Телефоны;
	
КонецПроцедуры

	
&НаКлиенте
Процедура ПорядокПеревыставленияПриИзменении(Элемент)
	
	ПорядокПеревыставленияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПорядокПеревыставленияПриИзмененииНаСервере()
	
	Если Запись.ПорядокПеревыставления = 0 Тогда
		Если Запись.ДатаПеревставления <> 0 Тогда
			Запись.ДатаПеревставления = 0;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ДатаПеревставления.ТолькоПросмотр 	= Запись.ПорядокПеревыставления = 0;
	Элементы.ДатаПеревставления.Видимость 		= Запись.ПорядокПеревыставления <> 3;
	Элементы.Надпись_Группировать.Видимость     = Запись.ПорядокПеревыставления = 3;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетНаПредоплатуПриИзменении(Элемент)
	
	СчетНаПредоплатуПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура СчетНаПредоплатуПриИзмененииНаСервере()
	
	Элементы.СчетНаПредоплату_Значение.Видимость = Запись.СчетНаПредоплату = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьДополнениеВШапкеОтчетаЭкспедитораПриИзменении(Элемент)
	
	ПриИзмененииФлагаВыводитьДополнениеВШапкеОтчетаЭкспедитора();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьДополнениеВПодвалеОтчетаЭкспедитораПриИзменении(Элемент)
	
	ПриИзмененииФлагаВыводитьДополнениеВПодвалеОтчетаЭкспедитора();
	
КонецПроцедуры

&НаСервере
Процедура  ПриИзмененииФлагаВыводитьДополнениеВШапкеОтчетаЭкспедитора()
	
	Элементы.ДополнениеВШапкеОтчетаЭкспедитора.Видимость		= Запись.ВыводитьДополнениеВШапкеОтчетаЭкспедитора 		И (Запись.ЯзыкПечатиДокументов = 0 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ДополнениеВШапкеОтчетаЭкспедитораАнгл.Видимость	= Запись.ВыводитьДополнениеВШапкеОтчетаЭкспедитора 		И (Запись.ЯзыкПечатиДокументов = 1 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	
КонецПроцедуры

&НаСервере
Процедура  ПриИзмененииФлагаВыводитьДополнениеВПодвалеОтчетаЭкспедитора()
	
	Элементы.ДополнениеВПодвалеОтчетаЭкспедитора.Видимость 		= Запись.ВыводитьДополнениеВПодвалеОтчетаЭкспедитора 	И (Запись.ЯзыкПечатиДокументов = 0 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ДополнениеВПодвалеОтчетаЭкспедитораАнгл.Видимость 	= Запись.ВыводитьДополнениеВПодвалеОтчетаЭкспедитора 	И (Запись.ЯзыкПечатиДокументов = 1 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеВШапкеОтчетаЭкспедитораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ДополнительныеПараметры = Новый Структура("ИмяРеквизита","ДополнениеВШапкеОтчетаЭкспедитора");
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ОбработкаИзмененияДополнениеОтчетаЭкспедитора", ЭтотОбъект, ДополнительныеПараметры); 
	ПараметрыФормы 		= Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеОтчетаЭкспедитора.ТекстРедактирования, Истина, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеВШапкеОтчетаЭкспедитораАнглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ДополнительныеПараметры = Новый Структура("ИмяРеквизита","ДополнениеВШапкеОтчетаЭкспедитораАнгл");
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ОбработкаИзмененияДополнениеОтчетаЭкспедитора", ЭтотОбъект, ДополнительныеПараметры); 
	ПараметрыФормы 		= Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеОтчетаЭкспедитораАнгл.ТекстРедактирования, Истина, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеВПодвалеОтчетаЭкспедитораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура("ИмяРеквизита","ДополнениеВПодвалеОтчетаЭкспедитора");
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ОбработкаИзмененияДополнениеОтчетаЭкспедитора", ЭтотОбъект, ДополнительныеПараметры); 
	ПараметрыФормы 		= Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВПодвалеОтчетаЭкспедитора.ТекстРедактирования, Истина, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеВПодвалеОтчетаЭкспедитораАнглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура("ИмяРеквизита","ДополнениеВПодвалеОтчетаЭкспедитораАнгл");
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ОбработкаИзмененияДополнениеОтчетаЭкспедитора", ЭтотОбъект, ДополнительныеПараметры); 
	ПараметрыФормы 		= Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВПодвалеОтчетаЭкспедитораАнгл.ТекстРедактирования, Истина, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияДополнениеОтчетаЭкспедитора(Ответ, ДополнительныеПараметры) Экспорт
	
	Если (Ответ <> Неопределено) Тогда
		ИмяРеквизита = "";
		ДополнительныеПараметры.Свойство("ИмяРеквизита", ИмяРеквизита);
		
		Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
			Запись[ИмяРеквизита] = Ответ;
			Элементы[ИмяРеквизита].ОбновитьТекстРедактирования();
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСверткиНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 		= Ложь;
	ОбработатьВыборВариантаСвертки(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСверткиНоменклатурыДляАктовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 		= Ложь;
	ОбработатьВыборВариантаСвертки(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВариантСверткиНоменклатурыДляСФНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка 		= Ложь;
	ОбработатьВыборВариантаСвертки(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВариантСверткиНоменклатурыДляОтчетаЭкспедитораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 		= Ложь;
	ОбработатьВыборВариантаСвертки(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборВариантаСвертки(Элемент)
	
	ПараметрыОткрываемойФормы 	= Новый Структура("Договор", Договор);
	ОткрытьФорму("Справочник.CW_ВариантыСверткиТабличныхЧастей.ФормаВыбора",ПараметрыОткрываемойФормы,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьРеквизитыКонтрагента(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияКарточкиКонтрагента", ЭтотОбъект, ТекущийКонтрагент);
	
	ПараметрыОткрытияФормы = новый Структура;
	ПараметрыОткрытияФормы.Вставить("Ключ", ТекущийКонтрагент);
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта",параметрыОткрытияФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура РеквизитыИзКарточкиКонтрагентаПриИзменении(Элемент)
	
	ОбновитьДанныеКонтрагентаИзКарточки(ТекущийКонтрагент);
	УстановитьВидимостьРеквизитовКонтрагента();;

КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗакрытияКарточкиКонтрагента(Результат, ДополнительныйПараметр) Экспорт
	
	ОбновитьДанныеКонтрагентаИзКарточки(ДополнительныйПараметр);
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьРеквизитовКонтрагента()
	
	Элементы.ГруппаПроизвольныеРеквизитыКонтрагента.Видимость 	= НЕ Запись.РеквизитыИзКарточкиКонтрагента; 
	Элементы.ГруппаРеквизитыИзКарточкиКонтрагента.Видимость 	= Запись.РеквизитыИзКарточкиКонтрагента;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКонтрагентаИзКарточки(ТекущийКонтрагент)
	
	СведенияОбОрганизации = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(ТекущийКонтрагент, ТекущаяДата());
	
	РасчетныйСчетИзКарточки = "№"+СведенияОбОрганизации.НомерСчета +", в "+СведенияОбОрганизации.Банк;
	АдресИзКарточки 		= СведенияОбОрганизации.ЮридическийАдрес;
	ТелефонИзКарточки 		= СведенияОбОрганизации.Телефоны;  
	
	Если СведенияОбОрганизации.Свойство("Email") Тогда
		ЭлектронныйАдресКонтрагентаИзКарточки = СведенияОбОрганизации.Email;  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяРасчетКАктуПриИзменении(Элемент)
	
	Элементы.ГруппаРасчетКАкту.Видимость = Запись.ТребуетсяРасчетКАкту;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьДополнениевШапкуРасчетаАктаПриИзменении(Элемент)
	
	Элементы.ДополнениеВШапкеРасчетаАкта.Видимость		= Запись.ВыводитьДополнениевШапкуРасчетаАкта 	И (Запись.ЯзыкПечатиДокументов = 0 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	Элементы.ДополнениеВШапкеРасчетаАктаАнгл.Видимость	= Запись.ВыводитьДополнениевШапкуРасчетаАкта 	И (Запись.ЯзыкПечатиДокументов = 1 ИЛИ Запись.ЯзыкПечатиДокументов = 2);
	
КонецПроцедуры
&НаКлиенте
Процедура ФормирвоатьСправкуКАктуПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьДополнениевШапкуСправкиКАктуПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура ДополнениеВШапкеРасчетаАктаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаДополнения", ЭтотОбъект, Элемент.Имя); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеРасчетаАкта.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеВШапкеРасчетаАктаАнглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаДополнения", ЭтотОбъект, Элемент.Имя); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеРасчетаАктаАнгл.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеВШапкеСправкиКАктуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаДополнения", ЭтотОбъект, Элемент.Имя); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеСправкиКАкту.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеПодвалаАктаРусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаДополнения", ЭтотОбъект, Элемент.Имя); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеПодвалаАктаРус.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеПодвалаАктаАнглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаДополнения", ЭтотОбъект, Элемент.Имя); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеРасчетаАктаАнгл.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаИзмененияШаблонаДополнения(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		Запись[ДополнительныеПараметры] = Ответ;
		Элементы[ДополнительныеПараметры].ОбновитьТекстРедактирования();
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура КопироватьПараметрыДругогоОбъекта(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьКопированиеПараметров", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Значения параметров на закладках ""Основные"" и ""Документы"" будут заменены на текущие значения параметров выбранного объекта. Продолжить?", Режим, 0);	
	
КонецПроцедуры


&НаКлиенте
Процедура ПродолжитьКопированиеПараметров(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;

	ИмяОбъектаМетаданных = ПолучитьИмяОбъектаМетаданныхВладельцаПараметров(Запись.Договор);

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборТипаОбъекта", ЭтотОбъект);
	
	Если ВедетсяУчетПриложенийПоДоговорам Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресСпискаЗначений", 	ПолучитьАдресСписка());
		ПараметрыФормы.Вставить("СписокСПометками", 	Ложь);
		ПараметрыФормы.Вставить("ЗаголовокФормы", 		"Выберите тип объекта");
		
		ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораИзСписка", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		АдресРезультата = ПолучитьАдресРезультатаДоговор();
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресРезультатаДоговор()
	
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("Значение", "CW_ДоговорыПоГрузоперевозкам"); 
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураВыбора);

КонецФункции

&НаСервере
Функция получитьАдресСписка()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("CW_ДоговорыПоГрузоперевозкам", "Договоры по грузоперевозкам"	,,БиблиотекаКартинок.CW_Договоры);
	СписокВыбора.Добавить("CW_ПриложенияКДоговорам"		, "Приложения к договорам"		,,БиблиотекаКартинок.CW_Приложение);

	Возврат ПоместитьВоВременноеХранилище(СписокВыбора);
	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьИмяОбъектаМетаданныхВладельцаПараметров(Договор)
	Возврат	Договор.Метаданные().Имя;
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборТипаОбъекта(ЗначениеВыбора, Параметры) Экспорт
	Если ЗначениеВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = ПолучитьЗначениеВыбора(ЗначениеВыбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборОбъектаКопирования", ЭтотОбъект,);
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник."+ДанныеВыбора.Значение+".ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеВыбора(ЗначениеВыбора)
	
	Возврат ПолучитьИзВременногоХранилища(ЗначениеВыбора);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборОбъектаКопирования(ЗначениеВыбора, Параметры) Экспорт
    Если ЗначениеВыбора = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ОбработатьВыборОбъектаКопированиянаСервере(ЗначениеВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборОбъектаКопированиянаСервере(ЗначениеВыбора)
	
	ВыборкаЗначенийПараметровОбъекта = ПолучитьПараметрыДоговора(ЗначениеВыбора);
	
	Если ВыборкаЗначенийПараметровОбъекта =Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИсключаемыеСвойства = ПолучитьНеКопируемыеРеквизиты();
	
	ЗаполнитьЗначенияСвойств(Запись, ВыборкаЗначенийПараметровОбъекта,,ИсключаемыеСвойства);
	
	_УправлениеЭлементамиФормы();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыДоговора(ЗначениеВыбора)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ *
	               |ИЗ
	               |	РегистрСведений.CW_ПараметрыДоговоров.СрезПоследних(&ДатаСреза, Договор = &Договор) КАК CW_ПараметрыДоговоровСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", 	ТекущаяДата());
	Запрос.УстановитьПараметр("Договор", 	ЗначениеВыбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьНеКопируемыеРеквизиты()
	
	мРеквизитыИсключения = новый Массив;
	
	мРеквизитыИсключения.Добавить("Договор");
	
	//Закладка "Контрагент"
	//RU
	мРеквизитыИсключения.Добавить("РеквизитыИзКарточкиКонтрагента");
	мРеквизитыИсключения.Добавить("Адрес");
	мРеквизитыИсключения.Добавить("РасчетныйСчет");
	мРеквизитыИсключения.Добавить("Телефон");	
	
	мРеквизитыИсключения.Добавить("ВПечатныхФормахВыводитьРеквизитыГоловнойОрганизации");
	
	мРеквизитыИсключения.Добавить("ДолжностьРуководителя");
	мРеквизитыИсключения.Добавить("Руководитель");
	мРеквизитыИсключения.Добавить("РуководительКонтрагентаОснование");
	мРеквизитыИсключения.Добавить("ГлавныйБухгалтер");
	мРеквизитыИсключения.Добавить("ГлавныйБухгалтерКонтрагентаОснование");
	
	//EN
	мРеквизитыИсключения.Добавить("НаименованиеКонтрагентаАнгл");
	мРеквизитыИсключения.Добавить("РасчетныйСчетИностранный");
	мРеквизитыИсключения.Добавить("АдресАнгл");
	мРеквизитыИсключения.Добавить("ДолжностьРуководителяАнгл");
	мРеквизитыИсключения.Добавить("РуководительАнгл");
	мРеквизитыИсключения.Добавить("РуководительКонтрагентаОснованиеАнгл");
	мРеквизитыИсключения.Добавить("ГлавныйБухгалтерАнгл");
	мРеквизитыИсключения.Добавить("ГлавныйБухгалтерКонтрагентаОснованиеАнгл");
	
	//Закладка "Орагнизация"
	//Ru
	мРеквизитыИсключения.Добавить("ИзКарточкиОрганизации");
	мРеквизитыИсключения.Добавить("РасчетныйСчетОрганизации");
	мРеквизитыИсключения.Добавить("ТелефонОрганизации");
	мРеквизитыИсключения.Добавить("АдресОрганизации");
	
	мРеквизитыИсключения.Добавить("РежимПодписей");
	мРеквизитыИсключения.Добавить("ВариантПодписей");
	мРеквизитыИсключения.Добавить("ДолжностьРуководителяОрганизации");
	мРеквизитыИсключения.Добавить("РуководительОрганизации");
	мРеквизитыИсключения.Добавить("РуководительОснование");
	мРеквизитыИсключения.Добавить("ГлавныйБухгалтерОрганизации");
	мРеквизитыИсключения.Добавить("ГлавныйБухгалтерОснование");
	
	//EN
	мРеквизитыИсключения.Добавить("РасчетныйСчетОрганизацииИностранный");
	мРеквизитыИсключения.Добавить("АдресОрганизацииАнгл");
	мРеквизитыИсключения.Добавить("ДолжностьРуководителяОрганизацииАнгл");
	мРеквизитыИсключения.Добавить("РуководительОснованиеАнгл");
	мРеквизитыИсключения.Добавить("ГлавныйБухгалтерОснованиеАнгл");
	
	//Закладка "Комментарий"
	мРеквизитыИсключения.Добавить("Комментарий");
	
	Возврат СтрСоединить(мРеквизитыИсключения, ",");
	
КонецФункции

&НаКлиенте
Процедура РежимПодписейПриИзменении(Элемент)
	
	//подписанты
	Если Запись.РежимПодписей = 0 Тогда
		ПолучитьПодпиантовИзКарточкиОрганизацииНаСервере();
	КонецЕсли;
	//подписанты
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&наСервере
Процедура ПолучитьПодпиантовИзКарточкиОрганизацииНаСервере()
	
	ДанныеОтветственных = РегистрыСведений.CW_ПараметрыДоговоров.ПолучитьОтветственныхЛицИзКарточкиОрганизации(Договор.Организация);
	
	РуководительОрганизацииИзКарточки			= ДанныеОтветственных.РуководительОрганизации;
	ДолжностьРуководителяОрганизацииИзКарточки 	= ДанныеОтветственных.ДолжностьРуководителя;
	
	ГлавныйБухгалтерОрганизацииИзКарточки		= ДанныеОтветственных.ГлавныйБухгалтер;
	ДолжностьГлавногоБухгалтераИзКарточки 		= ДанныеОтветственных.ДолжностьГлавногоБухгалтера;

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПодпиантовНажатие(Элемент)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ", ПолучитьОрганизацию(Договор));
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыОрганизации", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", СтруктураПараметров,,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыОрганизации(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ПолучитьПодпиантовИзКарточкиОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОрганизацию(Договор)
	Возврат Договор.Организация;
КонецФункции

&НаКлиенте
Процедура ПринадлежностьДоговораПриИзменении(Элемент)
	УстановитьЗаголовокСтраницНаСервере();
КонецПроцедуры  

&НаСервере
Процедура УстановитьЗаголовокСтраницНаСервере()
	
	Если Запись.ИспользуетсяУниверсальныйДокумент Тогда
		ЗаголовокСтраницаСФ 	= "УПД (с/ф)";
		ЗаголовокСтраницаАкт 	= "УПД (Акт)";
	Иначе
		ЗаголовокСтраницаСФ 	= "Счет-фактура";
		ЗаголовокСтраницаАкт 	= "Акт";
	КонецЕсли;
	
	Если Запись.ХарактерДоговора = 1 Тогда
		ЗаголовокСтраницаОтчетЭкспедитора = "Отчет агента";	
	Иначе
		ЗаголовокСтраницаОтчетЭкспедитора = "Отчет экспедитора";	
	КонецЕсли;

	Элементы.ГруппаСФ.Заголовок 	= ЗаголовокСтраницаСФ;
	Элементы.ГруппаАкт.Заголовок 	= ЗаголовокСтраницаАкт;
	Элементы.ГруппаОтчетЭкспедитора.Заголовок = ЗаголовокСтраницаОтчетЭкспедитора;

КонецПроцедуры

//УПД
&НаКлиенте
Процедура ИспользуетсяУниверсальныйДокументПриИзменении(Элемент)
	УстановитьЗаголовокСтраницНаСервере(); 
	УстановитьВидимостьЭлементовДляУПД();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовДляУПД()
	
	Элементы.ГруппаОформлениеТабличнойЧастиСФ.Видимость = Не Запись.ИспользуетсяУниверсальныйДокумент; 
	Элементы.Услуги0Или1Работы.Видимость = Не Запись.ИспользуетсяУниверсальныйДокумент;
	Элементы.ВыводитьРеквизитыПриПечатиАкта.Видимость = Не Запись.ИспользуетсяУниверсальныйДокумент;
	Элементы.ВыводСуммыБезНДСДляАкта.Видимость = Не Запись.ИспользуетсяУниверсальныйДокумент;
	Элементы.ГруппаШаблонДополненияВСчф.Видимость = Не Запись.ИспользуетсяУниверсальныйДокумент; 
	Элементы.ПредставлениеАгентаДляСчетаФактуры.Видимость = Не Запись.ИспользуетсяУниверсальныйДокумент; 

КонецПроцедуры
//УПД

&НаКлиенте
Процедура ВыводитьДополнениеВПодавлеРасчетаПриИзменении(Элемент)

	_УправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура ДополнениеПодвалаРасчетаРусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаДополнения", ЭтотОбъект, Элемент.Имя); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеРасчетаАктаАнгл.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ДополнениеПодвалаРасчетаАнглНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаДополнения", ЭтотОбъект, Элемент.Имя); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья", Элементы.ДополнениеВШапкеРасчетаАктаАнгл.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПФ,,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры



