
Функция ПолучитьСписокСведенийОперевозках() Экспорт
	
	Результат = Новый Массив;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ПутевойЛист.СведенияОПеревозке КАК СведенияОПеревозке
	               |ИЗ
	               |	Документ.CW_ПутевойЛист КАК CW_ПутевойЛист";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.СведенияОПеревозке) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(Выборка.СведенияОПеревозке);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции