#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// формируем пробег документа
	//ПробегДокумента = ЭтапыМаршрута.Итог("Пробег");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Если ОбновлятьПриЗаписиПараметрыГрузоперевозок Тогда
		ЗаписатьПараметрыГрузоперевозок();
	КонецЕсли;
	
	CW_УчетСобственногоТранспортаСервер.ПодготовитьДвженияКПроведению(ЭтотОбъект);
	
	МассивИменРегистров = CW_УчетСобственногоТранспортаСервер.ПолучитьИспользуемыеРегистры(ЭтотОбъект);
	
	ДанныеДляПроведения = ПодготовитьДанныеДляПроведения(МассивИменРегистров);
	
	CW_УчетСобственногоТранспортаСервер.ЗарегистрироватьДвиженияДокумента(Движения,ДанныеДляПроведения,МассивИменРегистров);	
	
	
КонецПроцедуры

Функция ПодготовитьДанныеДляПроведения(МассивИменРегистров)
	
	ВедетсяУчетШинТранспортногоСредства 		= ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетШинТранспортногоСредства");
	УчитыватьПробегТранспортногоСредстваСГрузом = ПолучитьФункциональнуюОпцию("CW_УчитыватьПробегТранспортногоСредстваСГрузом");
	НоменклатураЗарплата						= Константы.CW_НоменклатураУчетаЗарплатыВодителей.Получить();
	
	ДанныеДляПроведения = CW_УчетСобственногоТранспортаСервер.ПодготовитьТаблицыДанныхДляПроведения(МассивИменРегистров);
	
	// ------
	//Заполнение таблиц проведения
	// CW_СостоянияТС
	Если ЗначениеЗаполнено(ВыездФакт) Тогда
		СтрокаСостоянияТС = ДанныеДляПроведения.CW_СостоянияТС.Добавить();
		СтрокаСостоянияТС.Период 				= ВыездФакт;
		СтрокаСостоянияТС.ТранспортноеСредство 	= ТранспортноеСредство;
		СтрокаСостоянияТС.Состояние 			= Справочники.CW_СостоянияТС.ВРейсе;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВозвращениеФакт) Тогда
		
		СтрокаСостоянияТС = ДанныеДляПроведения.CW_СостоянияТС.Добавить();
		СтрокаСостоянияТС.Период 				= ВозвращениеФакт;
		СтрокаСостоянияТС.ТранспортноеСредство 	= ТранспортноеСредство;
		СтрокаСостоянияТС.Состояние 			= Справочники.CW_СостоянияТС.Исправно;
		
		// CW_ПоказанияОдометровТранспортныхСредств
		Если  (ПробегПриВозвращении <> 0) Тогда 
			СтрокаПробегТС = ДанныеДляПроведения.CW_ПоказанияОдометровТранспортныхСредств.Добавить();
			СтрокаПробегТС.Период 					= ВозвращениеФакт;
			СтрокаПробегТС.ТранспортноеСредство 	= ТранспортноеСредство;
			СтрокаПробегТС.Пробег 					= ПробегПриВозвращении;
		КонецЕсли;
		
		//CW_ТопливоТС
		Если РасходТоплива <> 0 Тогда
			СтрокаСостоянияТС = ДанныеДляПроведения.CW_ТопливоТС.Добавить();
			СтрокаСостоянияТС.Период 				= ВозвращениеФакт;
			СтрокаСостоянияТС.ВидДвижения           = ВидДвиженияНакопления.Расход;
			СтрокаСостоянияТС.Организация 			= Организация;
			СтрокаСостоянияТС.ТранспортноеСредство 	= ТранспортноеСредство;
			СтрокаСостоянияТС.Топливо 				= Топливо;
			СтрокаСостоянияТС.Количество 			= РасходТоплива;
		КонецЕсли;
		
		Если ВедетсяУчетШинТранспортногоСредства Тогда
			
			// CW_ПробегШин
			мТранспортноеСредство = новый Массив;
			мТранспортноеСредство.Добавить(ТранспортноеСредство);
			мТранспортноеСредство.Добавить(Прицеп);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	CW_ШиныТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
			|	CW_ШиныТССрезПоследних.Шина КАК Шина
			|ИЗ
			|	РегистрСведений.CW_ШиныТС.СрезПоследних(&ДатаСреза, ТранспортноеСредство В (&мТранспортноеСредство)) КАК CW_ШиныТССрезПоследних";
			
			Запрос.УстановитьПараметр("ДатаСреза"			 , ВозвращениеФакт);
			Запрос.УстановитьПараметр("мТранспортноеСредство", мТранспортноеСредство);
			
			РезультатЗапросаШины = Запрос.Выполнить();
			
		КонецЕсли;

		//  ЭТАПЫ ПУТЕВОГО ЛИСТА
		//	CW_ЗарплатаВодителейТС
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		                |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.Организация КАК Организация,
		                |	CW_ПутевойЛистЭтапыМаршрута.Ссылка КАК ПутевойЛист,
		                |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.ТранспортноеСредство КАК ТранспортноеСредство,
		                |	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка КАК Грузоперевозка,
		                |	ВЫБОР
		                |		КОГДА CW_ПутевойЛистЭтапыМаршрута.Водитель = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.пустаяСсылка)
		                |			ТОГДА CW_ПутевойЛистЭтапыМаршрута.Водитель
		                |		ИНАЧЕ CW_ПутевойЛистЭтапыМаршрута.Водитель
		                |	КОНЕЦ КАК Водитель,
		                |	СУММА(CW_ПутевойЛистЭтапыМаршрута.Зарплата) КАК Сумма,
		                |	СУММА(CW_ПутевойЛистЭтапыМаршрута.Пробег) КАК Пробег,
		                |	СУММА(CW_ПутевойЛистЭтапыМаршрута.ПробегСГрузом) КАК ПробегСГрузом,
		                |	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка.Маршрут КАК Маршрут,
		                |	CW_ПутевойЛистЭтапыМаршрута.ИдентификаторСтроки КАК ИдентификаторСтроки,
		                |	СУММА(CW_ПутевойЛистЭтапыМаршрута.ПробегПорожний) КАК ПробегПорожний,
		                |	СУММА(CW_ПутевойЛистЭтапыМаршрута.ПробегБезПрицепа) КАК ПробегБезПрицепа
		                |ИЗ
		                |	Документ.CW_ПутевойЛист.ЭтапыМаршрута КАК CW_ПутевойЛистЭтапыМаршрута
		                |ГДЕ
		                |	CW_ПутевойЛистЭтапыМаршрута.Ссылка = &Ссылка
		                |
		                |СГРУППИРОВАТЬ ПО
		                |	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка,
		                |	CW_ПутевойЛистЭтапыМаршрута.Ссылка,
		                |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.ТранспортноеСредство,
		                |	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка.Маршрут,
		                |	CW_ПутевойЛистЭтапыМаршрута.ИдентификаторСтроки,
		                |	ВЫБОР
		                |		КОГДА CW_ПутевойЛистЭтапыМаршрута.Водитель = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.пустаяСсылка)
		                |			ТОГДА CW_ПутевойЛистЭтапыМаршрута.Водитель
		                |		ИНАЧЕ CW_ПутевойЛистЭтапыМаршрута.Водитель
		                |	КОНЕЦ,
		                |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.Организация";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			// CW_ЗарплатаВодителейТС
			СтрокаЗарплатаВодителейТС				= ДанныеДляПроведения.CW_ЗарплатаВодителейТС.Добавить();
			СтрокаЗарплатаВодителейТС.Период 		= ВозвращениеФакт;
			СтрокаЗарплатаВодителейТС.Номенклатура 	= НоменклатураЗарплата;
			
			ЗаполнитьЗначенияСвойств(СтрокаЗарплатаВодителейТС, ВыборкаДетальныеЗаписи);
			
			//  CW_ПробегТС
			СтрокаПробегТС = ДанныеДляПроведения.CW_ПробегТС.Добавить();
			СтрокаПробегТС.Период 				= ВозвращениеФакт;
			СтрокаПробегТС.ПутевойЛист			= Ссылка;
			СтрокаПробегТС.ТранспортноеСредство	= ВыборкаДетальныеЗаписи.ТранспортноеСредство;
			СтрокаПробегТС.Грузоперевозка		= ВыборкаДетальныеЗаписи.Грузоперевозка;
			СтрокаПробегТС.Водитель				= ВыборкаДетальныеЗаписи.Водитель;
			СтрокаПробегТС.Пробег				= ВыборкаДетальныеЗаписи.Пробег;
			
			Если УчитыватьПробегТранспортногоСредстваСГрузом Тогда
				СтрокаПробегТС.ПробегСГрузом		=  ВыборкаДетальныеЗаписи.ПробегСГрузом;
				СтрокаПробегТС.ПробегПорожний		=  ВыборкаДетальныеЗаписи.ПробегПорожний;
			КонецЕсли;
			
			Если ВедетсяУчетШинТранспортногоСредства Тогда
				
				ВыборкаДетальныеЗаписиШины = РезультатЗапросаШины.Выбрать();
				
				Пока ВыборкаДетальныеЗаписиШины.Следующий() Цикл
					
					СтрокаПробегШин = ДанныеДляПроведения.CW_ПробегШин.Добавить();
					СтрокаПробегШин.Период 					= ВозвращениеФакт;
					СтрокаПробегШин.ТранспортноеСредство	= ВыборкаДетальныеЗаписи.ТранспортноеСредство;
					СтрокаПробегШин.Грузоперевозка			= ВыборкаДетальныеЗаписи.Грузоперевозка;
					СтрокаПробегШин.Шина					= ВыборкаДетальныеЗаписиШины.Шина;
					
					Если ВыборкаДетальныеЗаписи.ТранспортноеСредство = ТранспортноеСредство тогда
						СтрокаПробегШин.Пробег = ВыборкаДетальныеЗаписи.Пробег;
					ИначеЕсли ВыборкаДетальныеЗаписи.ТранспортноеСредство = Прицеп Тогда
						СтрокаПробегШин.Пробег = ВыборкаДетальныеЗаписи.Пробег - ВыборкаДетальныеЗаписи.ПробегБезПрицепа;
					Конецесли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			// CW_РаботаВодителей
			СтрокаРаботаВодителей = ДанныеДляПроведения.CW_РаботаВодителей.Добавить();
			СтрокаРаботаВодителей.Период 				= ВозвращениеФакт;
			СтрокаРаботаВодителей.ПутевойЛист			= Ссылка;
			СтрокаРаботаВодителей.Водитель				= ВыборкаДетальныеЗаписи.Водитель;
			СтрокаРаботаВодителей.Грузоперевозка		= ВыборкаДетальныеЗаписи.Грузоперевозка;
			СтрокаРаботаВодителей.Маршрут				= ВыборкаДетальныеЗаписи.Маршрут;
			СтрокаРаботаВодителей.КоличествоЕздок		= 1;
			СтрокаРаботаВодителей.Зарплата				= ВыборкаДетальныеЗаписи.Сумма;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	//CW_ТопливоТС
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	CW_ПутевойЛистТопливоВыдано.Ссылка КАК ПутевойЛист,
	|	CW_ПутевойЛистТопливоВыдано.Документ.Дата КАК Период,
	|	CW_ПутевойЛистТопливоВыдано.Объем КАК Объем
	|ПОМЕСТИТЬ ВТ_Приходы
	|ИЗ
	|	Документ.CW_ПутевойЛист.ТопливоВыдано КАК CW_ПутевойЛистТопливоВыдано
	|ГДЕ
	|	CW_ПутевойЛистТопливоВыдано.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	CW_ПутевойЛистЗаправки.Ссылка,
	|	CW_ПутевойЛистЗаправки.ДатаЗаправки,
	|	CW_ПутевойЛистЗаправки.Количество
	|ИЗ
	|	Документ.CW_ПутевойЛист.Заправки КАК CW_ПутевойЛистЗаправки
	|ГДЕ
	|	CW_ПутевойЛистЗаправки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Приходы.ПутевойЛист КАК ПутевойЛист,
	|	ВТ_Приходы.Период КАК Период,
	|	СУММА(ВТ_Приходы.Объем) КАК Объем
	|ИЗ
	|	ВТ_Приходы КАК ВТ_Приходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Приходы.Период,
	|	ВТ_Приходы.ПутевойЛист";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаСостоянияТС = ДанныеДляПроведения.CW_ТопливоТС.Добавить();
		СтрокаСостоянияТС.Период 				= Выборка.Период;
		СтрокаСостоянияТС.ВидДвижения           = ВидДвиженияНакопления.Приход;
		СтрокаСостоянияТС.Организация 			= Организация;
		СтрокаСостоянияТС.ТранспортноеСредство 	= ТранспортноеСредство;
		СтрокаСостоянияТС.Топливо 				= Топливо;
		СтрокаСостоянияТС.Количество 			= Выборка.Объем;
	КонецЦикла;
	
	//	CW_ЗаправкиПодотчетныхЛиц
	//  CW_ЗаправкиТопливнымиКартами
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_ПутевойЛистЗаправки.ДатаЗаправки КАК Период,
	|	CW_ПутевойЛистЗаправки.Ссылка.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВЫБОР
	|		КОГДА CW_ПутевойЛистЗаправки.Водитель = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.пустаяСсылка)
	|			ТОГДА CW_ПутевойЛистЗаправки.Ссылка.Водитель
	|		ИНАЧЕ CW_ПутевойЛистЗаправки.Водитель
	|	КОНЕЦ КАК Водитель,
	|	CW_ПутевойЛистЗаправки.Топливо КАК Топливо,
	|	CW_ПутевойЛистЗаправки.ТопливнаяКарта КАК ТопливнаяКарта,
	|	CW_ПутевойЛистЗаправки.Документ КАК ПервичныйДокумент,
	|	CW_ПутевойЛистЗаправки.Количество КАК Количество,
	|	CW_ПутевойЛистЗаправки.Сумма КАК Сумма,
	|	CW_ПутевойЛистЗаправки.НДС КАК НДС,
	|	CW_ПутевойЛистЗаправки.Всего КАК Всего,
	|	CW_ПутевойЛистЗаправки.Валюта КАК Валюта,
	|	CW_ПутевойЛистЗаправки.СтавкаНДС КАК СтавкаНДС,
	|	CW_ПутевойЛистЗаправки.ВариантЗаправки КАК ВариантЗаправки,
	|	CW_ПутевойЛистЗаправки.Контрагент КАК Контрагент,
	|	CW_ПутевойЛистЗаправки.ДокументНомер КАК ДокументНомер,
	|	CW_ПутевойЛистЗаправки.ДокументДата КАК ДокументДата,
	|	CW_ПутевойЛистЗаправки.Ссылка.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДанныеЗаправок
	|ИЗ
	|	Документ.CW_ПутевойЛист.Заправки КАК CW_ПутевойЛистЗаправки
	|ГДЕ
	|	CW_ПутевойЛистЗаправки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеЗаправок.Период КАК Период,
	|	ВТ_ДанныеЗаправок.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВТ_ДанныеЗаправок.Водитель КАК Водитель,
	|	ВТ_ДанныеЗаправок.Топливо КАК Топливо,
	|	ВТ_ДанныеЗаправок.ТопливнаяКарта КАК ТопливнаяКарта,
	|	ВТ_ДанныеЗаправок.ПервичныйДокумент КАК ПервичныйДокумент,
	|	СУММА(ВТ_ДанныеЗаправок.Количество) КАК Количество,
	|	ВТ_ДанныеЗаправок.ДокументНомер КАК ДокументНомер,
	|	ВТ_ДанныеЗаправок.ДокументДата КАК ДокументДата,
	|	ВТ_ДанныеЗаправок.Организация КАК Организация
	|ИЗ
	|	ВТ_ДанныеЗаправок КАК ВТ_ДанныеЗаправок
	|ГДЕ
	|	ВТ_ДанныеЗаправок.ВариантЗаправки = ЗНАЧЕНИЕ(Перечисление.CW_ВариантыЗаправокТС.ТопливнаяКарта)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеЗаправок.ТранспортноеСредство,
	|	ВТ_ДанныеЗаправок.Топливо,
	|	ВТ_ДанныеЗаправок.Период,
	|	ВТ_ДанныеЗаправок.Водитель,
	|	ВТ_ДанныеЗаправок.ПервичныйДокумент,
	|	ВТ_ДанныеЗаправок.ТопливнаяКарта,
	|	ВТ_ДанныеЗаправок.ДокументНомер,
	|	ВТ_ДанныеЗаправок.ДокументДата,
	|	ВТ_ДанныеЗаправок.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеЗаправок.Период КАК Период,
	|	ВТ_ДанныеЗаправок.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ВТ_ДанныеЗаправок.Водитель КАК Водитель,
	|	ВТ_ДанныеЗаправок.Топливо КАК Топливо,
	|	ВТ_ДанныеЗаправок.ПервичныйДокумент КАК ПервичныйДокумент,
	|	ВТ_ДанныеЗаправок.Валюта КАК Валюта,
	|	ВТ_ДанныеЗаправок.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВТ_ДанныеЗаправок.Количество) КАК Количество,
	|	СУММА(ВТ_ДанныеЗаправок.Сумма) КАК Сумма,
	|	СУММА(ВТ_ДанныеЗаправок.НДС) КАК НДС,
	|	СУММА(ВТ_ДанныеЗаправок.Всего) КАК Всего,
	|	ВТ_ДанныеЗаправок.Контрагент КАК Контрагент,
	|	ВТ_ДанныеЗаправок.ДокументНомер КАК ДокументНомер,
	|	ВТ_ДанныеЗаправок.ДокументДата КАК ДокументДата,
	|	ВТ_ДанныеЗаправок.Организация КАК Организация
	|ИЗ
	|	ВТ_ДанныеЗаправок КАК ВТ_ДанныеЗаправок
	|ГДЕ
	|	ВТ_ДанныеЗаправок.ВариантЗаправки = ЗНАЧЕНИЕ(Перечисление.CW_ВариантыЗаправокТС.НаличныйРасчет)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеЗаправок.Период,
	|	ВТ_ДанныеЗаправок.ТранспортноеСредство,
	|	ВТ_ДанныеЗаправок.Топливо,
	|	ВТ_ДанныеЗаправок.ПервичныйДокумент,
	|	ВТ_ДанныеЗаправок.Валюта,
	|	ВТ_ДанныеЗаправок.СтавкаНДС,
	|	ВТ_ДанныеЗаправок.Водитель,
	|	ВТ_ДанныеЗаправок.Контрагент,
	|	ВТ_ДанныеЗаправок.ДокументНомер,
	|	ВТ_ДанныеЗаправок.ДокументДата,
	|	ВТ_ДанныеЗаправок.Организация";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ПакетРезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписиТоплвныеКарты = ПакетРезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаДетальныеЗаписиТоплвныеКарты.Следующий() Цикл
		
		СтрокаЗаправкиТопливнымиКартами = ДанныеДляПроведения.CW_ЗаправкиТопливнымиКартами.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаЗаправкиТопливнымиКартами, ВыборкаДетальныеЗаписиТоплвныеКарты);
		
	КонецЦикла;
	
	
	ВыборкаДетальныеЗаписиПодотчетныеЛица = ПакетРезультатЗапроса[2].Выбрать();
	
	Пока ВыборкаДетальныеЗаписиПодотчетныеЛица.Следующий() Цикл
		
		СтрокаЗаправкиПодотчетныхЛиц = ДанныеДляПроведения.CW_ЗаправкиПодотчетныхЛиц.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаЗаправкиПодотчетныхЛиц, ВыборкаДетальныеЗаписиПодотчетныеЛица);
		
	КонецЦикла;
	
	
	Если ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		//Данные списания ГСМ
		//	CW_РасходГСМТС
		Запрос_ВидОтражения = Новый Запрос;
		Запрос_ВидОтражения.Текст = 
		"ВЫБРАТЬ
		|	CW_ПутевойЛистОтражениеРасходовСверхНорматива.ВариантОтраженияЗатратПоБУ КАК ВариантОтраженияЗатратПоБУ,
		|	СУММА(CW_ПутевойЛистОтражениеРасходовСверхНорматива.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Документ
		|ИЗ
		|	Документ.CW_ПутевойЛист.ОтражениеРасходовСверхНорматива КАК CW_ПутевойЛистОтражениеРасходовСверхНорматива
		|ГДЕ
		|	CW_ПутевойЛистОтражениеРасходовСверхНорматива.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_ПутевойЛистОтражениеРасходовСверхНорматива.ВариантОтраженияЗатратПоБУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Документ.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_Документ КАК ВТ_Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Документ.ВариантОтраженияЗатратПоБУ КАК ВариантОтраженияЗатратПоБУ,
		|	ВТ_Документ.Количество КАК Количество,
		|	ВТ_Итог.Количество КАК КоличествоВсего,
		|	ВТ_Документ.Количество / ВТ_Итог.Количество КАК Коэффициент
		|ИЗ
		|	ВТ_Документ КАК ВТ_Документ,
		|	ВТ_Итог КАК ВТ_Итог";
		
		Запрос_ВидОтражения.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат_ВидОтражения =  Запрос_ВидОтражения.Выполнить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка.Организация КАК Организация,
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка КАК ПутевойЛист,
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка.ТранспортноеСредство КАК ТранспортноеСредство,
		|	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка КАК Грузоперевозка,
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка.Топливо КАК Номенклатура,
		|	СУММА(CW_ПутевойЛистЭтапыМаршрута.РасходФакт) КАК РасходФакт,
		|	СУММА(CW_ПутевойЛистЭтапыМаршрута.РасходНорма) КАК РасходНорма
		|ИЗ
		|	Документ.CW_ПутевойЛист.ЭтапыМаршрута КАК CW_ПутевойЛистЭтапыМаршрута
		|ГДЕ
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка,
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка,
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка.ТранспортноеСредство,
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка.Топливо,
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка.Организация";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			РасходНорма 					= ?(ПриравнятьФактическийРасходКНормативному, ВыборкаДетальныеЗаписи.РасходФакт, ВыборкаДетальныеЗаписи.РасходНорма);
			РасходСверхНормыПоСтроке 		= Макс(0,ВыборкаДетальныеЗаписи.РасходФакт - РасходНорма);
			РасходВПределахНорммыПоСтроке 	= Мин(РасходНорма,ВыборкаДетальныеЗаписи.РасходФакт);
			
			//CW_РасходГСМТС
			
			//РасходПоНорме
			СтрокаРасходПоНорме = ДанныеДляПроведения.CW_РасходГСМТС.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаРасходПоНорме,ВыборкаДетальныеЗаписи);
			
			СтрокаРасходПоНорме.Период 						= ДатаЗакрытия;
			СтрокаРасходПоНорме.ВидРасходаТоплива    		= ПредопределенноеЗначение("Перечисление.CW_ВидыРасходаТоплива.РасходПоНорме");
			СтрокаРасходПоНорме.Количество 					= РасходНорма;
			//	СтрокаРасходПоНорме.ВариантОтраженияЗатратПоБУ 	= ПредопределенноеЗначение("Справочник.CW_ВариантыОтраженияЗатратПоБУ.СписаниеНаСобсвенныеЗатраты");
			
			//РасходФактический
			СтрокаРасходФактическийС = ДанныеДляПроведения.CW_РасходГСМТС.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаРасходФактическийС,ВыборкаДетальныеЗаписи);
			
			СтрокаРасходФактическийС.Период 						= ДатаЗакрытия;
			СтрокаРасходФактическийС.ВидРасходаТоплива     			= ПредопределенноеЗначение("Перечисление.CW_ВидыРасходаТоплива.РасходФактический");
			СтрокаРасходФактическийС.Количество 					= ВыборкаДетальныеЗаписи.РасходФакт;
			//	СтрокаРасходФактическийС.ВариантОтраженияЗатратПоБУ 	= ПредопределенноеЗначение("Справочник.CW_ВариантыОтраженияЗатратПоБУ.СписаниеНаСобсвенныеЗатраты");
			
			
			//РасходВПределахНорммы
			СтрокаРасходВПределахНорммы = ДанныеДляПроведения.CW_РасходГСМТС.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаРасходВПределахНорммы,ВыборкаДетальныеЗаписи);
			
			СтрокаРасходВПределахНорммы.Период 						= ДатаЗакрытия;
			СтрокаРасходВПределахНорммы.ВидРасходаТоплива     		= ПредопределенноеЗначение("Перечисление.CW_ВидыРасходаТоплива.РасходВПределахНормы");
			СтрокаРасходВПределахНорммы.Количество 					= РасходВПределахНорммыПоСтроке;
			//		СтрокаРасходВПределахНорммы.ВариантОтраженияЗатратПоБУ 	= ПредопределенноеЗначение("Справочник.CW_ВариантыОтраженияЗатратПоБУ.СписаниеНаСобсвенныеЗатраты");
			
			//РасходСверхНормы
			Если РасходСверхНормыПоСтроке > 0 Тогда
				Выборка_ВидОтражения = Результат_ВидОтражения.Выбрать();
				
				ИтогоРаспределено = 0;
				Пока Выборка_ВидОтражения.Следующий() и РасходСверхНормыПоСтроке > 0  Цикл
					
					Распределено = Окр(РасходСверхНормыПоСтроке * Выборка_ВидОтражения.Коэффициент, 3);
					
					СтрокаРасходСверхНормы = ДанныеДляПроведения.CW_РасходГСМТС.Добавить();
					
					ЗаполнитьЗначенияСвойств(СтрокаРасходСверхНормы,ВыборкаДетальныеЗаписи);
					
					СтрокаРасходСверхНормы.Период 						= ДатаЗакрытия;
					СтрокаРасходСверхНормы.ВидРасходаТоплива     		= ПредопределенноеЗначение("Перечисление.CW_ВидыРасходаТоплива.РасходСверхНормы");
					СтрокаРасходСверхНормы.Количество 					= Распределено;
					СтрокаРасходСверхНормы.ВариантОтраженияЗатратПоБУ 	= Выборка_ВидОтражения.ВариантОтраженияЗатратПоБУ;
					
					ИтогоРаспределено = ИтогоРаспределено + Распределено;
				КонецЦикла;
				
				Если РасходСверхНормыПоСтроке <> ИтогоРаспределено и СтрокаРасходСверхНормы <> Неопределено Тогда
					Погрешность = РасходВПределахНорммыПоСтроке - ИтогоРаспределено;
					СтрокаРасходСверхНормы.Количество =  СтрокаРасходСверхНормы.Количество + Погрешность;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//  CW_РаботаВодителей
	
	
	Возврат ДанныеДляПроведения;
	
	
КонецФункции

Процедура ЗаписатьПараметрыГрузоперевозок()
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка.ТипПеревозки КАК ТипПеревозки,
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.Прицеп КАК Прицеп,
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.ВыездФакт КАК ВыездФакт,
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.ВозвращениеФакт КАК ВозвращениеФакт,
	               |	ВЫБОР
	               |		КОГДА CW_ПутевойЛистЭтапыМаршрута.Водитель = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.пустаяСсылка)
	               |			ТОГДА CW_ПутевойЛистЭтапыМаршрута.Водитель
	               |		ИНАЧЕ CW_ПутевойЛистЭтапыМаршрута.Водитель
	               |	КОНЕЦ КАК Водитель,
	               |	CW_ПутевойЛистЭтапыМаршрута.АдресПогрузки КАК АдресПогрузки,
	               |	CW_ПутевойЛистЭтапыМаршрута.АдресРазгрузки КАК АдресРазгрузки,
	               |	CW_ПутевойЛистЭтапыМаршрута.Груз КАК Груз,
	               |	CW_ПутевойЛистЭтапыМаршрута.ВесГруза КАК ВесГруза,
	               |	CW_ПутевойЛистЭтапыМаршрута.ДатаПогрузки КАК ДатаПогрузки,
	               |	CW_ПутевойЛистЭтапыМаршрута.ДатаРазгрузки КАК ДатаРазгрузки,
	               |	CW_ПутевойЛистЭтапыМаршрута.ДатаВыезда КАК ДатаВыезда,
	               |	CW_ПутевойЛистЭтапыМаршрута.ДатаВозвращения КАК ДатаВозвращения,
	               |	CW_ПутевойЛистЭтапыМаршрута.Пробег КАК Пробег,
	               |	CW_ПутевойЛистЭтапыМаршрута.ПробегСГрузом КАК ПробегСГрузом,
	               |	CW_ПутевойЛистЭтапыМаршрута.ПробегПорожний КАК ПробегПорожний,
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.Номер КАК Номер,
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.Дата КАК Дата,
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ЗначенияПараметров
	               |ИЗ
	               |	Документ.CW_ПутевойЛист.ЭтапыМаршрута КАК CW_ПутевойЛистЭтапыМаршрута
	               |ГДЕ
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.Ссылка КАК ТипПеревозки,
	               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр КАК Параметр,
	               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста КАК РеквизитПутевогоЛиста
	               |ПОМЕСТИТЬ ВТ_Параметры
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок.ПараметрыПутевыхЛистов КАК CW_ТипыПеревозокПараметрыПутевыхЛистов
	               |ГДЕ
	               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.ЗаполнитьИзПутевогоЛиста
	               |	И CW_ТипыПеревозокПараметрыПутевыхЛистов.ТипыСоответствуют
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗначенияПараметров.Грузоперевозка КАК Грузоперевозка,
	               |	ВТ_Параметры.Параметр КАК Параметр,
	               |	ВТ_Параметры.РеквизитПутевогоЛиста КАК РеквизитПутевогоЛиста
	               |ИЗ
	               |	ВТ_ЗначенияПараметров КАК ВТ_ЗначенияПараметров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Параметры КАК ВТ_Параметры
	               |		ПО ВТ_ЗначенияПараметров.ТипПеревозки = ВТ_Параметры.ТипПеревозки
	               |ИТОГИ ПО
	               |	Грузоперевозка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗначенияПараметров.Ссылка КАК Ссылка,
	               |	ВТ_ЗначенияПараметров.Дата КАК Дата,
	               |	ВТ_ЗначенияПараметров.Номер КАК Номер,
	               |	ВТ_ЗначенияПараметров.Грузоперевозка КАК Грузоперевозка,
	               |	ВТ_ЗначенияПараметров.ТипПеревозки КАК ТипПеревозки,
	               |	ВТ_ЗначенияПараметров.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	ВТ_ЗначенияПараметров.Прицеп КАК Прицеп,
	               |	ВТ_ЗначенияПараметров.ВыездФакт КАК ВыездФакт,
	               |	ВТ_ЗначенияПараметров.ВозвращениеФакт КАК ВозвращениеФакт,
	               |	ВТ_ЗначенияПараметров.Водитель КАК ЭтапыМаршрута_Водитель,
	               |	ВТ_ЗначенияПараметров.АдресПогрузки КАК ЭтапыМаршрута_АдресПогрузки,
	               |	ВТ_ЗначенияПараметров.АдресРазгрузки КАК ЭтапыМаршрута_АдресРазгрузки,
	               |	ВТ_ЗначенияПараметров.Груз КАК ЭтапыМаршрута_Груз,
	               |	ВТ_ЗначенияПараметров.ВесГруза КАК ЭтапыМаршрута_ВесГруза,
	               |	ВТ_ЗначенияПараметров.ДатаПогрузки КАК ЭтапыМаршрута_ДатаПогрузки,
	               |	ВТ_ЗначенияПараметров.ДатаРазгрузки КАК ЭтапыМаршрута_ДатаРазгрузки,
	               |	ВТ_ЗначенияПараметров.ДатаВыезда КАК ЭтапыМаршрута_ДатаВыезда,
	               |	ВТ_ЗначенияПараметров.ДатаВозвращения КАК ЭтапыМаршрута_ДатаВозвращения,
	               |	ВТ_ЗначенияПараметров.Пробег КАК ЭтапыМаршрута_Пробег,
	               |	ВТ_ЗначенияПараметров.ПробегСГрузом КАК ЭтапыМаршрута_ПробегСГрузом,
	               |	ВТ_ЗначенияПараметров.ПробегПорожний КАК ЭтапыМаршрута_ПробегПорожний
	               |ИЗ
	               |	ВТ_ЗначенияПараметров КАК ВТ_ЗначенияПараметров";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Пакет_РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат_Параметры = Пакет_РезультатЗапроса[2];
	Результат_Значения  = Пакет_РезультатЗапроса[3];
	ВыборкаЗначения 	= Результат_Значения.Выбрать();
	
	Выборка_Грузоперевозки = Результат_Параметры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка_Грузоперевозки.Следующий() Цикл
		
		ВыборкаЗначения.Сбросить();          
		
		Выборка_Параметры = Выборка_Грузоперевозки.Выбрать();
		
		Если ВыборкаЗначения.НайтиСледующий(новый Структура("Грузоперевозка",Выборка_Грузоперевозки.Грузоперевозка)) Тогда
			
			ОбъектГрузоперевозка 		= Выборка_Грузоперевозки.Грузоперевозка.ПолучитьОбъект();
			
			Пока Выборка_Параметры.Следующий() Цикл
				Параметр 		= Выборка_Параметры.Параметр;
				ЭтоНомер        = Выборка_Параметры.РеквизитПутевогоЛиста = ПредопределенноеЗначение("Перечисление.CW_РеквизитыПутевыхЛистов.Номер");
				ИмяРеквизита	= Выборка_Параметры.РеквизитПутевогоЛиста.Метаданные().ЗначенияПеречисления[Перечисления.CW_РеквизитыПутевыхЛистов.Индекс(Выборка_Параметры.РеквизитПутевогоЛиста)].Имя;
				
				СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ОбъектГрузоперевозка, Параметр);
				Если (СтрокаПараметра = Неопределено) Тогда
					СтрокаПараметра 			= ОбъектГрузоперевозка.ПараметрыГрузоперевозки.Добавить();
					СтрокаПараметра.Параметр 	= Параметр;
				КонецЕсли; 
				
				ЗначениеПараметра = СтрокаПараметра.Параметр.ТипЗначения.ПривестиЗначение(ВыборкаЗначения[ИмяРеквизита]);
				
				Если ЭтоНомер Тогда
					ЗначениеПараметра = CW_Документы.ПолучитьНомерНаПечать(ВыборкаЗначения.Ссылка);
				КонецЕсли;
				
				СтрокаПараметра.Значение = ЗначениеПараметра;
				
				Если Параметр.ЭтоКонтрольнаяДата Тогда
					СтрокаПараметра.ЗначениеФакт = ЗначениеПараметра;
				КонецЕсли;
				
			КонецЦикла;
			
			ОбъектГрузоперевозка.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//--------------------------------------------------------------------

Функция ПолучитьДанныеДляПечати() Экспорт
	
	ТабДокумент = новый ТабличныйДокумент;
	
	ТабДокумент.НачатьАвтогруппировкуСтрок();
	
	ПорядокПолученияНормативов 					= Константы.CW_ПорядокРасчетаНормативаТоплива.Получить();
	ИспользуютсяПоказателиТранспортногоСредства = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяПоказателиТранспортногоСредстваОтдельноОтМодели");
	
	//Инициализация макета
	Макет = ПолучитьМакет("РасшифровкаФормулы");
	
	ОбластьЗаголовок 				= Макет.ПолучитьОбласть("Заголовок");
	
	ТабДокумент.Вывести(ОбластьЗаголовок, 1, "заголовок" );
	
	//действующие формулы по этапам
	мДействующиеФормулы = Новый Массив;
	Для Каждого СтрокаЭтапа из  ЭтапыМаршрута Цикл
		
		// Получим используемую формулу
		Если ПорядокПолученияНормативов = Перечисления.CW_ПорядокРасчетаНормативаТоплива.НаДатуНачалаПеревозки Тогда
			ДатаСреза 	= Макс(СтрокаЭтапа.ДатаПогрузки, СтрокаЭтапа.ДатаВыезда);
		Иначе
			ДатаСреза 	= Макс(СтрокаЭтапа.ДатаРазгрузки, СтрокаЭтапа.ДатаВозвращения);
		КонецЕсли;
		
		СсылкаТранспортноеСредство 	=  СтрокаЭтапа.ТранспортноеСредство;
		СсылкаПрицеп				=  Прицеп;
		СсылкаМодель				=  СсылкаТранспортноеСредство.Модель;
		ФормулаМодели				=  СсылкаТранспортноеСредство.Модель.ФормулаРасчетаНормыРасходаТоплива;
		
		ПараметрыФормулы = CW_УчетСобственногоТранспортаСервер.ПолучитьДействующуюФормулуНормрасходатранспортныхСредств(ДатаСреза, СсылкаТранспортноеСредство);
		
		Если НЕ ПараметрыФормулы = Неопределено Тогда
			тСсылкаНаФормулу		= ПараметрыФормулы.ФормулаРасчетаНормыРасходаТоплива; 
		Иначе
			тСсылкаНаФормулу 		= ФормулаМодели;
		КонецЕсли;
		
		Если мДействующиеФормулы.Найти(тСсылкаНаФормулу) = Неопределено Тогда
			мДействующиеФормулы.Добавить(тСсылкаНаФормулу);
		КонецЕсли;
		
	КонецЦикла;
	
	Если  мДействующиеФормулы.Количество() = 0 Тогда
		//что за... ?
		Возврат ТабДокумент;
	КонецЕсли;
		
	ИспользуетсяНесколькоФормул = мДействующиеФормулы.Количество() > 1;
	
	Если Не ИспользуетсяНесколькоФормул Тогда
		
		ТекущаяФормула = мДействующиеФормулы[0];
		
		ФормулаРасчета = CW_УчетСобственногоТранспортаСервер.ПривестиФормулуКСтроке(ТекущаяФормула.ФормулаРасчета);
		//Формулу выводим в заголовок
			
		ПараметрыВыполненияФормулы = CW_УчетСобственногоТранспортаСервер.ПараметрыВыполненияФормулы(ФормулаРасчета,,ТекущаяФормула.Наименование);
		
		Если ПараметрыВыполненияФормулы = Неопределено Тогда
			Возврат ТабДокумент;
		КонецЕсли;
		
		СтрПоказателиБувенныйКод 	= Новый Структура;
		
		Для Каждого Показатель из ПараметрыВыполненияФормулы.ПоказателиФормулы Цикл
			
			СтрПоказателиБувенныйКод.Вставить(Показатель.Идентификатор	, Показатель.БуквенныйКод);
			
		КонецЦикла;
		
		ОбластьФормула	= Макет.ПолучитьОбласть("Формула");
		
		ТекстФормулы 	=  ФормулаДляВыполнения(ФормулаРасчета, СтрПоказателиБувенныйКод);
		ТекстФормулы 	= СтрЗаменить(ТекстФормулы,"*"," х ");
		ТекстФормулы 	= СтрЗаменить(ТекстФормулы,"  "," ");
		
		ОбластьФормула.Параметры.ТекстФормулы 			= "Qн ="  + ТекстФормулы;
		ОбластьФормула.Параметры.НаименованиеФормулы 	= "Основная формула расчета расхода топлива: " +ТекущаяФормула.Наименование;
		ТабДокумент.Вывести(ОбластьФормула, 1, "Формула");
		
		ОбластьПараметры_Заголовок 		= Макет.ПолучитьОбласть("Параметры_Заголовок");
		ТабДокумент.Вывести(ОбластьПараметры_Заголовок, 1 ,"Параметры_Заголовок");
		
		ОбластьПараметры_строка 		= Макет.ПолучитьОбласть("Параметры_строка");
		
		Для Каждого Показатель из ПараметрыВыполненияФормулы.ПоказателиФормулы Цикл
			
			БуквенныйКод = "";
			СтрПоказателиБувенныйКод.Свойство(Показатель.Идентификатор, БуквенныйКод);
			
			ОбластьПараметры_строка.Параметры.Параметр 			= БуквенныйКод;
			ОбластьПараметры_строка.Параметры.ОписаниеПараметра = Показатель.Описание;
			
			ТабДокумент.Вывести(ОбластьПараметры_строка,2, "Параметры_строка");
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИтогоРасходПоНорме = 0;
	МассивИтогов = Новый Массив;
	Для ИндексСтроки = 0 по  ЭтапыМаршрута.Количество() - 1 Цикл
		
		// Получим используемую формулу
		ТекущаяСтрокаГрузоперевозки = ЭтапыМаршрута[ИндексСтроки];
		
		Если ПорядокПолученияНормативов = Перечисления.CW_ПорядокРасчетаНормативаТоплива.НаДатуНачалаПеревозки Тогда
			ДатаСреза 	= Макс(ТекущаяСтрокаГрузоперевозки.ДатаПогрузки, ТекущаяСтрокаГрузоперевозки.ДатаВыезда);
		Иначе
			ДатаСреза 	= Макс(ТекущаяСтрокаГрузоперевозки.ДатаРазгрузки, ТекущаяСтрокаГрузоперевозки.ДатаВозвращения);
		КонецЕсли;
		
		ОбластьИсходныеДанные_Заголовок = Макет.ПолучитьОбласть("ИсходныеДанные_Заголовок");
		ТабДокумент.Вывести(ОбластьИсходныеДанные_Заголовок, 1, "ИсходныеДанные_Заголовок" );
		
		ДатаВозвращения =  Вычислить(" ЭтапыМаршрута[ИндексСтроки].ДатаВозвращения");
		ДатаРазгрузки 	=  Вычислить(" ЭтапыМаршрута[ИндексСтроки].ДатаРазгрузки");
		
		СрокВозвращения = Формат(Макс(ДатаВозвращения,ДатаРазгрузки),"ДФ='dd.MM.yyyy HH:mm'") ;
		
		ОбластьИсходныеДанные_НомерЭтапа 							= Макет.ПолучитьОбласть("ИсходныеДанные_НомерЭтапа");
		ОбластьИсходныеДанные_НомерЭтапа.Параметры.ЗаголовокЭтапа 	= "Грузоперевозка: "+СокрЛП(Вычислить(" ЭтапыМаршрута[ИндексСтроки].Грузоперевозка"))+ ", Срок с: "+Формат(Вычислить(" ЭтапыМаршрута[ИндексСтроки].ДатаВыезда"),"ДФ='dd.MM.yyyy HH:mm'")+ " по " + СрокВозвращения  +?(ЭтапыМаршрута.Количество()= 1, "", "(Строка № "+Формат(ИндексСтроки+1, "ЧДЦ=; ЧГ=0")+")");
		
		ТабДокумент.Вывести(ОбластьИсходныеДанные_НомерЭтапа, 1, "ИсходныеДанные_НомерЭтапа");
	
		СсылкаТранспортноеСредство 	=  ТекущаяСтрокаГрузоперевозки.ТранспортноеСредство;
		СсылкаПрицеп				=  Прицеп;
		СсылкаМодель				=  СсылкаТранспортноеСредство.Модель;
		ФормулаМодели				=  СсылкаТранспортноеСредство.Модель.ФормулаРасчетаНормыРасходаТоплива;
		
		мДопОборудование = Неопределено;
		ЕстьДопОборудование = ДополнительноеОборудование.Количество() > 0;
		Если мДопОборудование = Неопределено тогда
			мДопОборудование 	= ДополнительноеОборудование.Выгрузить().ВыгрузитьКолонку("ДополнительноеОборудование");
		КонецЕсли;
		
		
		ПараметрыФормулы = CW_УчетСобственногоТранспортаСервер.ПолучитьДействующуюФормулуНормрасходатранспортныхСредств(ДатаСреза, СсылкаТранспортноеСредство);
		
		Если НЕ ПараметрыФормулы = Неопределено Тогда
			СсылкаНаФормулу			= ПараметрыФормулы.ФормулаРасчетаНормыРасходаТоплива; 
		Иначе
			СсылкаНаФормулу 		= ФормулаМодели;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СсылкаНаФормулу) Тогда
			Возврат ТабДокумент;
		КонецЕсли;
		
		ФормулаРасчета = CW_УчетСобственногоТранспортаСервер.ПривестиФормулуКСтроке(СсылкаНаФормулу.ФормулаРасчета);

		ПараметрыВыполненияФормулы 				= CW_УчетСобственногоТранспортаСервер.ПараметрыВыполненияФормулы(ФормулаРасчета,,СсылкаНаФормулу.Наименование);
		
		Если ПараметрыВыполненияФормулы = Неопределено Тогда
			Возврат ТабДокумент;
		КонецЕсли;
		
		СтрПоказателиБувенныйКод 	= Новый Структура;
		
		Для Каждого Показатель из ПараметрыВыполненияФормулы.ПоказателиФормулы Цикл
			
			СтрПоказателиБувенныйКод.Вставить(Показатель.Идентификатор	, Показатель.БуквенныйКод);
			
		КонецЦикла;
		
		Если ИспользуетсяНесколькоФормул Тогда
			
			ОбластьФормула 					= Макет.ПолучитьОбласть("Формула");
			
			ТекстФормулы 	=  ФормулаДляВыполнения(ФормулаРасчета, СтрПоказателиБувенныйКод);
			ТекстФормулы 	= СтрЗаменить(ТекстФормулы,"*"," х ");
			ТекстФормулы 	= СтрЗаменить(ТекстФормулы,"  "," ");
			
			ОбластьФормула.Параметры.ТекстФормулы 			= "Qн ="  + ТекстФормулы;
			ОбластьФормула.Параметры.НаименованиеФормулы 	= "Формула расчета расхода топлива: " + СсылкаНаФормулу.Наименование;
			ТабДокумент.Вывести(ОбластьФормула, 2, "Формула");
			
			
			ОбластьПараметры_Заголовок 		= Макет.ПолучитьОбласть("Параметры_Заголовок");
			ТабДокумент.Вывести(ОбластьПараметры_Заголовок, 2 ,"Параметры_Заголовок");
			
			ОбластьПараметры_строка 		= Макет.ПолучитьОбласть("Параметры_строка");
			
			Для Каждого Показатель из ПараметрыВыполненияФормулы.ПоказателиФормулы Цикл
				
				БуквенныйКод = "";
				СтрПоказателиБувенныйКод.Свойство(Показатель.Идентификатор, БуквенныйКод);
				
				ОбластьПараметры_строка.Параметры.Параметр 			= БуквенныйКод;
				ОбластьПараметры_строка.Параметры.ОписаниеПараметра = Показатель.Описание;
				
				ТабДокумент.Вывести(ОбластьПараметры_строка,3, "Параметры_строка");
				
			КонецЦикла;
			
		КонецЕсли;
		
		//Получим показатели   
		мПоказатели 					=  Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПолучитьМассивПоказателей();
		
		ЗначенияПоказателейМодели = новый Соответствие;
		ПолучитьЗначенияПоказателей(ДатаСреза, ЗначенияПоказателейМодели , СсылкаМодель, мПоказатели);
		
		Если ИспользуютсяПоказателиТранспортногоСредства Тогда
			ЗначенияПоказателейТранспортногоСредства 		= новый Соответствие;
			ПолучитьЗначенияПоказателей(ДатаСреза, ЗначенияПоказателейтранспортногоСредства	, СсылкаТранспортноеСредство	, мПоказатели);
		КонецЕсли;	
		
		Если ЕстьДопОборудование тогда
			ЗначенияПоказателейДополнительногоОборудования 	= новый Соответствие;
			мПоказателиДопОборудования 		=  Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПолучитьМассивДоступныхПоказателейПоВидутранспортногоСредства(ПредопределенноеЗначение("Перечисление.CW_ВидыТС.ДополнительноеОборудование"));
			ПолучитьЗначенияПоказателей(ДатаСреза, ЗначенияПоказателейДополнительногоОборудования, мДопОборудование	, мПоказателиДопОборудования);
		КонецЕсли;
		
		СоответствиеПоказателейШапки			=  Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПолучитьСоответствиеПоказателейШапки();
		СоответствиеПоказателейТабличнойЧасти	=  Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПолучитьСоответствиеПоказателейТабличнойЧасти();
		МассивПоказателейСОсобымПорядком		=  Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПоулчитьМассивПоказателейСОсобымПорядком();
		
		ИсходныеДанные 					= Новый Структура;
		мПоказателиТабличнойЧасти 		= Новый Массив;
		мПоказателиОсобыйПорядок 		= Новый Массив;
		
		// заполняем исходные данные по настраиваемым показателям
		Для каждого Показатель из ПараметрыВыполненияФормулы.ПоказателиФормулы Цикл
			Если Показатель.УказываетсяВНастройках тогда
				
				ЗначениеПоказателя =  ЗначенияПоказателейМодели.Получить(Показатель);
				
				Если ИспользуютсяПоказателиТранспортногоСредства Тогда
					ЗначениеПоказателяТС =  ЗначенияПоказателейтранспортногоСредства.Получить(Показатель);
					Если ЗначениеЗаполнено(ЗначениеПоказателяТС) Тогда
						ЗначениеПоказателя =  ЗначениеПоказателяТС;
					КонецЕсли;
				КонецЕсли;

				ИсходныеДанные.Вставить(Показатель.Идентификатор, ?(ЗначениеПоказателя = Неопределено,0, ЗначениеПоказателя));
				
			Иначе
				
				ПутьКДаннымПоказателяШапки = СоответствиеПоказателейШапки.Получить(Показатель);
				Если ПутьКДаннымПоказателяШапки <> Неопределено Тогда
					ПутьКДаннымПоказателяШапки = СтрЗаменить(ПутьКДаннымПоказателяШапки, "Объект.","");
					ИсходныеДанные.Вставить(Показатель.Идентификатор, Вычислить(СокрЛП(ПутьКДаннымПоказателяШапки)));
				КонецЕсли;
				
				ПутьКДаннымПоказателяТабличнойЧасти = СоответствиеПоказателейТабличнойЧасти.Получить(Показатель);
				Если ПутьКДаннымПоказателяТабличнойЧасти <> Неопределено Тогда
					мПоказателиТабличнойЧасти.Добавить(Показатель);
				КонецЕсли;
				
				НомерВМассиве = МассивПоказателейСОсобымПорядком.Найти(Показатель);
				Если НомерВМассиве <> Неопределено Тогда
					мПоказателиОсобыйПорядок.Добавить(Показатель);
					ПоказательПолучен = истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьИсходныеДанные_НомерЭтапа_ЗначенияПараметров 		= Макет.ПолучитьОбласть("ИсходныеДанные_НомерЭтапа_ЗначенияПараметров");
		ТабДокумент.Вывести(ОбластьИсходныеДанные_НомерЭтапа_ЗначенияПараметров, 2, "ИсходныеДанные_НомерЭтапа_ЗначенияПараметров");
		
		ОбластьИсходныеДанные_Параметры = Макет.ПолучитьОбласть("ИсходныеДанные_Параметры");
		
		ФормулаДляРасчета = ФормулаРасчета;
		
		Для каждого Показатель из мПоказателиТабличнойЧасти Цикл
			
			ПутьКДаннымПоказателяТабличнойЧасти = СоответствиеПоказателейТабличнойЧасти.Получить(Показатель);
			ПутьКДаннымПоказателяТабличнойЧасти = СтрЗаменить(ПутьКДаннымПоказателяТабличнойЧасти, "Объект.","");
			
			ЗначениеПоказателя =  Вычислить(СокрЛП(ПутьКДаннымПоказателяТабличнойЧасти));
			
			ИсходныеДанные.Вставить(Показатель.Идентификатор, ЗначениеПоказателя);
			
		КонецЦикла;
		
		Для каждого Показатель из мПоказателиОсобыйПорядок Цикл
			
			Если Показатель =  ПредопределенноеЗначение("Справочник.CW_ПоказателиРасчетаРасходаТоплива.ВремяПростоя") Тогда
				//Дополним исходные данные временим простоя
				ИдентификаторСтроки 	= Вычислить("ЭтапыМаршрута[ИндексСтроки].ИдентификаторСтроки");
				
				Отбор = Новый Структура("ИдентификаторСтроки,ДвигательВключен", ИдентификаторСтроки, Истина);
				ТабПростои = Простои.Выгрузить().Скопировать(Отбор);
				
				ЗначениеПоказателя  = ТабПростои.Итог("ВремяПростояЧас");
				
				ИсходныеДанные.Вставить(Показатель.Идентификатор, ЗначениеПоказателя);
				
			Иначе
				
				//Другие показатели
				
			КонецЕсли;
			
		КонецЦикла;
		
		
		Для Каждого ЭлементИсходныхДанных из ИсходныеДанные Цикл			
			
			Если ЭлементИсходныхДанных.Значение = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			стрЗначениеПоказателя = Формат(ЭлементИсходныхДанных.Значение, "ЧДЦ=3;ЧГ=0");
			
			БуквенныйКод = "";
			СтрПоказателиБувенныйКод.Свойство(ЭлементИсходныхДанных.Ключ, БуквенныйКод);
			
			ОбластьИсходныеДанные_Параметры.Параметры.Параметр 				= БуквенныйКод;
			ОбластьИсходныеДанные_Параметры.Параметры.ЗначениеПараметра 	= стрЗначениеПоказателя;
			
			ТабДокумент.Вывести(ОбластьИсходныеДанные_Параметры,3, "ИсходныеДанные_Параметры");
			
		КонецЦикла;
		
		
		
		ОбластьИсходныеДанные_ДатаПараметров = Макет.ПолучитьОбласть("ИсходныеДанные_ДатаПараметров");
		ОбластьИсходныеДанные_ДатаПараметров.Параметры.ДатаПараметров = Формат(ДатаСреза,"ДФ='dd.MM.yyyy HH:mm'");
		ТабДокумент.Вывести(ОбластьИсходныеДанные_ДатаПараметров, 3, "ИсходныеДанные_ДатаПараметров");
	
		
		РасходПоНормеЭтапа = CW_УчетСобственногоТранспортаСервер.ВыполнитьРасчетНормыРасходаТопливаПоФормуле(ИсходныеДанные, ПараметрыВыполненияФормулы);
		
		ФормулаДляРасчета =  ФормулаДляВыполнения(ФормулаРасчета, ИсходныеДанные);
		ФормулаДляРасчета =  СтрЗаменить(ФормулаДляРасчета,"*"," х ");
		ФормулаДляРасчета =  СтрЗаменить(ФормулаДляРасчета,",",".");
		ФормулаДляРасчета =  СтрЗаменить(ФормулаДляРасчета,"  "," ");
		
		ОбластьИсходныеДанные_Формула_Заголовок 	= Макет.ПолучитьОбласть("ИсходныеДанные_Формула_Заголовок");
		ТабДокумент.Вывести(ОбластьИсходныеДанные_Формула_Заголовок, 2 ,"ИсходныеДанные_Формула");
		
		ОбластьИсходныеДанные_Формула 	= Макет.ПолучитьОбласть("ИсходныеДанные_Формула");
		
		РасходНормаПриведенный = 0;
		Если ПриравнятьФактическийРасходКНормативному Тогда
			РасходНормаПриведенный 	= Вычислить("ЭтапыМаршрута[ИндексСтроки].РасходНорма");
		КонецЕсли;
		
		стрЗначениеПоСтроке = Формат(РасходПоНормеЭтапа, "ЧДЦ=3") + ?(РасходНормаПриведенный=0,""," (" + Формат(РасходНормаПриведенный, "ЧДЦ=3")+")");
		
		ОбластьИсходныеДанные_Формула.Параметры.ТекстФормулыРезультат 	= ФормулаДляРасчета + " = " + стрЗначениеПоСтроке;
		
		ТабДокумент.Вывести(ОбластьИсходныеДанные_Формула, 3 ,"ИсходныеДанные_Формула");
		
		ИтогоРасходПоНорме = ИтогоРасходПоНорме + РасходПоНормеЭтапа;
		
		МассивИтогов.Добавить(стрЗначениеПоСтроке);
		
	КонецЦикла;
	
	Если ЭтапыМаршрута.Количество() = 1 Тогда
		
		ОбластьОбласть_Итог 									= Макет.ПолучитьОбласть("Область_ИтогДляОднойСтроки");
		ОбластьОбласть_Итог.Параметры.РезультатРасчетаИтого 	= Формат(ИтогоРасходПоНорме, "ЧДЦ=3") + ?(ПриравнятьФактическийРасходКНормативному," (" + Формат(РасходТоплива, "ЧДЦ=3")+")", "");
		
		ТабДокумент.Вывести(ОбластьОбласть_Итог, 1, "Область_Итог");
		
	Иначе
		
		СтрокаВсегоПоДокументу 									= СтрСоединить(МассивИтогов," + ");
		
		ОбластьОбласть_Итог 									= Макет.ПолучитьОбласть("Область_Итог");
		ОбластьОбласть_Итог.Параметры.СтрокаВсегоПоДокументу 	= СтрокаВсегоПоДокументу + " = " +Формат(ИтогоРасходПоНорме, "ЧДЦ=3") + ?(ПриравнятьФактическийРасходКНормативному," (" + Формат(РасходТоплива, "ЧДЦ=3")+")", "");
		
		ТабДокумент.Вывести(ОбластьОбласть_Итог, 1, "Область_Итог");
		
	КонецЕсли;
	
	Если ПриравнятьФактическийРасходКНормативному Тогда
		
		ОбластьОбласть_ПредупреждениеНормативногоРасхода = Макет.ПолучитьОбласть("Область_ПредупреждениеНормативногоРасхода");
		ТабДокумент.Вывести(ОбластьОбласть_ПредупреждениеНормативногоРасхода, 1, "Область_Итог");
		
	КонецЕсли;
	
	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ТабДокумент.ОтображатьГруппировки 	= истина;
	ТабДокумент.ОтображатьЗаголовки 	= ложь;
	ТабДокумент.ОтображатьСетку 		= ложь;
	
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьДанныеДляПечатиПоФактическомуРасходу() Экспорт
	
	ТабДокумент = новый ТабличныйДокумент;
	
	//Инициализация макета
	Макет = ПолучитьМакет("РасперделениеФактическогоРасхода");
	
	ОбластьЗаголовок 				= Макет.ПолучитьОбласть("Заголовок");
	
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	БазаРаспределения  = ЭтапыМаршрута.Итог("Пробег");
	
	Если БазаРаспределения = 0 Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	ОбластьБазаРаспределения = Макет.ПолучитьОбласть("БазаРаспределения");
	ОбластьБазаРаспределения.Параметры.РасходТоплива      = РасходТоплива;
	ОбластьБазаРаспределения.Параметры.БазаРаспределения  = БазаРаспределения;
	ТабДокумент.Вывести(ОбластьБазаРаспределения);
	
	ОбластьЭтапыЗаголовок = Макет.ПолучитьОбласть("ЭтапыЗаголовок");
	ТабДокумент.Вывести(ОбластьЭтапыЗаголовок);
	
	ОбластьЭтапыШапка = Макет.ПолучитьОбласть("ЭтапыШапка");
	ТабДокумент.Вывести(ОбластьЭтапыШапка);
	
	НужноРаспределить = РасходТоплива;
	
	Для Каждого СтрокаЭтапы из ЭтапыМаршрута Цикл
		ОбластьЭтапыСтрока = Макет.ПолучитьОбласть("ЭтапыСтрока");
		
		ЗаполнитьЗначенияСвойств(ОбластьЭтапыСтрока.Параметры, СтрокаЭтапы);
		
		Коэффициент = СтрокаЭтапы.Пробег / БазаРаспределения;
		
		
		ОбластьЭтапыСтрока.Параметры.Коэффициент 	= Окр(Коэффициент , 15);
		ОбластьЭтапыСтрока.Параметры.Нпп 			= СтрокаЭтапы.НомерСтроки;
		
		ТабДокумент.Вывести(ОбластьЭтапыСтрока);
		
		Распределено 		= РасходТоплива * Коэффициент;
		НужноРаспределить 	= НужноРаспределить - Распределено;
		
	КонецЦикла;
	
	Если НужноРаспределить <> 0 Тогда
		
		ОбластьПогрешность = Макет.ПолучитьОбласть("Погрешность");
		ОбластьПогрешность.Параметры.Погрешность = НужноРаспределить;
		ОбластьПогрешность.Параметры.Нпп = СтрокаЭтапы.НомерСтроки;
		
		ТабДокумент.Вывести(ОбластьПогрешность);
		
	КонецЕсли;
	
	ТабДокумент.ОтображатьГруппировки = истина;
	ТабДокумент.ОтображатьЗаголовки = ложь;
	ТабДокумент.ОтображатьСетку = ложь;
	
	Возврат ТабДокумент;
	
	
КонецФункции


// Функция преобразует формулу введенную пользователем в формулу для выполнения при расчете норм расхода топлива.
// К показателям прибавляется префикс.
Функция ФормулаДляВыполнения(Формула, ИдентификаторыПоказателей)
	ФормулаДляВыполнения = "";
	
	НачалоСлова = 1;
	Для Позиция = 1 По СтрДлина(Формула) Цикл
		КодСимвола = КодСимвола(Формула, Позиция);
		Если СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола) Тогда
			ДописатьТекущееСловоВФормулуДляВыполнения(Формула, ФормулаДляВыполнения, Позиция, НачалоСлова, ИдентификаторыПоказателей);
			ФормулаДляВыполнения = ФормулаДляВыполнения + Сред(Формула, Позиция, 1);
			НачалоСлова = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	ДописатьТекущееСловоВФормулуДляВыполнения(Формула, ФормулаДляВыполнения, Позиция, НачалоСлова, ИдентификаторыПоказателей);
	
	Возврат ФормулаДляВыполнения
	
КонецФункции

Процедура ДописатьТекущееСловоВФормулуДляВыполнения(Формула, ФормулаДляВыполнения, Позиция, НачалоСлова, ИдентификаторыПоказателей)
	
	Если Позиция <> НачалоСлова Тогда
		Слово = Сред(Формула, НачалоСлова, Позиция - НачалоСлова);
		
		Попытка
			ЕстьСвойство = ИдентификаторыПоказателей.Свойство(Слово);
		Исключение
			ЕстьСвойство = Ложь;
		КонецПопытки;
		Если ЕстьСвойство Тогда
			ЗначениеПоказателя = "";
			ИдентификаторыПоказателей.Свойство(Слово,ЗначениеПоказателя); 
			ФормулаДляВыполнения = ФормулаДляВыполнения + ЗначениеПоказателя;
		Иначе
			ФормулаДляВыполнения = ФормулаДляВыполнения + Слово;
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПолучитьЗначенияПоказателей(ДатаСреза, ЗначенияНастроек, мОбъектыРасчета, МассивПоказателей) Экспорт
	
	Если ТипЗнч(мОбъектыРасчета) <> тип("Массив") Тогда
		мОбъектыРасчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(мОбъектыРасчета);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних.ПоказательРасчетаРасходаТоплива КАК ПоказательРасчетаРасходаТоплива,
	|	CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних.ЗначениеПоказателя КАК ЗначениеПоказателя
	|ИЗ
	|	РегистрСведений.CW_ЗначенияПоказателейНормРасходаТоплива.СрезПоследних(
	|			&ДатаСреза,
	|			ОбъектРасчета В (&мОбъектыРасчета)
	|				И ПоказательРасчетаРасходаТоплива В (&МассивПоказателей)) КАК CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних
	|ГДЕ
	|	CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних.ЗначениеПоказателя <> 0";
	
	Запрос.УстановитьПараметр("ДатаСреза"			, ДатаСреза);
	Запрос.УстановитьПараметр("мОбъектыРасчета"		, мОбъектыРасчета);
	Запрос.УстановитьПараметр("МассивПоказателей"	, МассивПоказателей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		
		ЗначениеПоказателя = ВыборкаДетальныеЗаписи.ЗначениеПоказателя;
		ЗначенияНастроек.Вставить(ВыборкаДетальныеЗаписи.ПоказательРасчетаРасходаТоплива,ЗначениеПоказателя);
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПорядокПрисвоенияНомеров = CW_Настройки.ПараметрУчетнойПолитики(Дата,Организация,"ПорядокНумерацииПутевыхЛистов");
	
	Если ПорядокПрисвоенияНомеров = 0 Тогда //Автоматически
		Префикс = CW_Документы.ПрефиксОрганизации(Организация);
	КонецЕсли;	
	
	Если ПорядокПрисвоенияНомеров = 1 Тогда  //Внешний нумератор
		// проверки
		Нумератор = CW_Настройки.ПараметрУчетнойПолитики(Дата,Организация,"ВнешнийНумераторПутевыхЛистов");
		
		ОбработкаНумерации = _ПО.ПолучитьОбработку(Нумератор);
		ОбработкаНумерации.УстановитьНомерДокумента(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	КонецЕсли;

КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	АналитикаЗатрат = Неопределено;
	
КонецПроцедуры

#КонецЕсли