
&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ГруппаАвтоматическогоПланированияРасходов.Видимость 	= Запись.РасходыАвтоматическоеПланирование;
	Элементы.РасходыСтатьяДДСВнутрихолдинг.Видимость		 		= Запись.ВключатьВнутрихолдинговыеРасходы и Запись.РасходыАвтоматическоеПланирование; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыАвтоматическоеПланированиеПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура РасходыИсключитьВнутрихолдингПриИзменении(Элемент)
	УправлениеЭлементамиФормы()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеЭлементамиФормы()
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗаполненияСодержанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ОбработкаИзмененияШаблона", ЭтотОбъект); 
	ПараметрыФормы 		= Новый Структура("Шаблон", Элементы.ШаблонЗаполненияСодержания.ТекстРедактирования);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблона(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		Запись.ШаблонЗаполненияСодержания = Результат;
		Элементы.ШаблонЗаполненияСодержания.ОбновитьТекстРедактирования();
	КонецЕсли; 
	
КонецПроцедуры
