#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//Обновление
Процедура ЗаполнитьИзмерениеВидДоговора() ЭКспорт
	
	Набор = РегистрыСведений.CW_ОтсутствующиеОригиналыДокументов.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	Для Каждого СтрокаНабора из Набор Цикл
		Если ЗначениеЗаполнено(СтрокаНабора.Договор) Тогда
			СтрокаНабора.ВидДоговора = СтрокаНабора.Договор.ВидДоговора;
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры
//Обновление


Процедура ЗаписатьОтсутствующиеОригиналыДокументов(СтруктураПараметров) Экспорт	
	
	//Отсутствующие оригиналы документов
	НаборЗаписей = РегистрыСведений.CW_ОтсутствующиеОригиналыДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Значение 		= СтруктураПараметров.Ссылка;
	НаборЗаписей.Отбор.Документ.Использование 	= Истина;
	НаборЗаписей.Очистить();
	
	Если НЕ СтруктураПараметров.Признак Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Документ 	= СтруктураПараметров.Ссылка;
		Запись.Организация 	= СтруктураПараметров.Организация;
		Запись.Контрагент 	= СтруктураПараметров.Контрагент;
		Запись.Договор 		= СтруктураПараметров.Договор;
		Запись.ВидДоговора  = СтруктураПараметров.Договор.ВидДоговора;
	КонецЕсли; 
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

#КонецЕсли