
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Ответ =	ОтправитьЗапросНаПолучениеПинКодов();
	Если Ответ.КодСостояния <> 200 тогда
		ПоказатьПредупреждение(, Ответ.Сообщение);
	Иначе
		ПоказатьПредупреждение(, "Список резервных пин-кодов отправен!");
	КонецЕсли;       
	
КонецПроцедуры      

&НаСервере
Функция ОтправитьЗапросНаПолучениеПинКодов()
	
	Логин = CW_РегистрацияПрограммыСервер.ПолучитьЛогинПользовательяИнтернетПоддержки();
	РегистрационныйНомер = Сред(Логин, 2);
	
	Возврат CW_РегистрацияПрограммыСервер.ПолучитьПинкодДоступа(РегистрационныйНомер, "Резерв");
	
КонецФункции   
