
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ШаблонНомера", 		ШаблонНомера);
	Параметры.Свойство("ИмяКонстанты", 		ИмяКонстанты);
	Параметры.Свойство("ДлинаЧисловйЧасти", ДлинаЧисловйЧасти);
	
	ЗаполнитьСписокДоступныхПрефиксов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхПрефиксов()
	
	ЗначениеНастройки = Константы[ИмяКонстанты].Получить();
	СписокШаблоновПрефикса = ЗначениеНастройки.Получить();
	
	Если СписокШаблоновПрефикса.Количество() = 0 Тогда
		СписокШаблоновПрефикса.Добавить("[ОР]", 	"префикс организации");
		СписокШаблоновПрефикса.Добавить("[ГГГГ]", 	"префикс года (4 символа)");
		СписокШаблоновПрефикса.Добавить("[ГГ]", 	"префикс года (2 символа)");
		СписокШаблоновПрефикса.Добавить("[ММ]", 	"префикс месяца");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокШаблоновПрефиксаПометкаПриИзменении(Элемент)
	ДобавитьУдалитьПрефикс();
КонецПроцедуры

&НаКлиенте
Процедура СписокШаблоновПрефиксаПриИзменении(Элемент)
	ДобавитьУдалитьПрефикс();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьУдалитьПрефикс()
	
	ШаблонНомера = "";
	Для Каждого ЭлементСписка Из СписокШаблоновПрефикса Цикл
		Если ЭлементСписка.Пометка Тогда
			ШаблонНомера = ШаблонНомера+ЭлементСписка.Значение;
		КонецЕсли;
	КонецЦикла;;
	
	ОбновитьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПримерНомера()
	
	
	ПрефиксОрганизаии	= "ОР";
	ПрефиксГодПолный	= Формат(ТекущаяДата(),"ДФ=yyyy");
	ПрефиксГодКраткий	= Формат(ТекущаяДата(),"ДФ=yy");
	ПрефиксМесяц		= Формат(ТекущаяДата(),"ДФ=MM");
	
	СтрокаШаблон = СтрЗаменить(ШаблонНомера, "[ОР]",   ПрефиксОрганизаии);
	СтрокаШаблон = СтрЗаменить(СтрокаШаблон, "[ГГГГ]", ПрефиксГодПолный);
	СтрокаШаблон = СтрЗаменить(СтрокаШаблон, "[ГГ]",   ПрефиксГодКраткий);
	СтрокаШаблон = СтрЗаменить(СтрокаШаблон, "[ММ]",   ПрефиксМесяц);
	
	СтрокаШаблон = СтрокаШаблон;
	
	ДлинаПрефикса = СтрДлина(СтрокаШаблон);
	Если ДлинаЧисловйЧасти = 0 Тогда
		СтрНомер = "1";
	Иначе
		СтрНомер = Прав("000000000001", ДлинаЧисловйЧасти);
	КонецЕсли;
	
	Элементы.ПримерНомера.Заголовок = СтрокаШаблон+СтрНомер;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьЗначенияКонстант();
	ЭтаФорма.Закрыть(ШаблонНомера);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначенияКонстант()
	
	ХранилищеЗначения = Новый ХранилищеЗначения(СписокШаблоновПрефикса);
	Константы[ИмяКонстанты].Установить(ХранилищеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 ОбновитьПримерНомера();
КонецПроцедуры




