
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьОбработчикиОбновления(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Будут выполнены выбранные обработчики обновления. Продоложить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;                                   
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("МассивКлючей", ВыделенныеСтроки); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыполнениеОбработчиков", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.CW_ОбработчикиОбновления.Форма.ФормаВыполненияОбработчиковОбновления", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры      

&НаКлиенте
Процедура ЗавершитьВыполнениеОбработчиков(РезультатВыплнения, ДополнительныеПараметры) Экспорт  
	
	Если ТипЗнч(РезультатВыплнения) <> тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыплнения.Ошибка Тогда 
		
		ПоказатьПредупреждение(, "В процессе выполнения обработчиков возникли ошибки.
								 |Подробно см. журнал регистрации");
		
	ИначеЕсли РезультатВыплнения.ТребуетсяПерезапуск Тогда  
		
		ПоказатьПредупреждение(, "Для продолжения работы необходимо выполнить перезапуск программы!");	
		
	КонецЕсли;  
	
	Элементы.Список.Обновить();
	
КонецПроцедуры