&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресТаблицыДокумента", АдресТаблицыДокумента);   
	Параметры.Свойство("ВнешниеДанные",			ВнешниеДанные);  
	Параметры.Свойство("Контрагент",			Контрагент);     
	
	
	Соответствие = Обработки.CW_ЗагрузкаТабличнойЧастиДокументаРасходыПоГрузоперевозкеИзФайла.ПолучитьСоответствиеТиповРеквизитовДокумента();      
    СоответствиТипаРеквизита = Новый ФиксированноеСоответствие(Соответствие);
	
	ДанныеДокумента = Новый ФиксированнаяСтруктура(Параметры.ДанныеДокумента);	
	
	Организация = ДанныеДокумента.Организация;

	ПараметрыУчетнойПолитики = CW_Настройки.ПараметрыУчетнойПолитики(ДанныеДокумента.Дата, ДанныеДокумента.Организация);
	Если ПараметрыУчетнойПолитики.Свойство("ОсновнаяСтатьяЗатрат") Тогда
		ОсновнаяСтатьяЗатрат = ПараметрыУчетнойПолитики.ОсновнаяСтатьяЗатрат;
	КонецЕсли;
	
	ТекстНезаполненногоЗаголовкаПарамтера   = "Выбрать параметр";
	ТекстНезаполненногоЗаголовкаДействия 	= "Выбрать действие";
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	МакетЗаголовка = ТОбъект.ПолучитьМакет("МакетЗаголовка");   
	ОбластьЗаголовок = МакетЗаголовка.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ИмяРеквизита 	= ТекстНезаполненногоЗаголовкаПарамтера;
	ОбластьЗаголовок.Параметры.Действие 		= ТекстНезаполненногоЗаголовкаДействия;
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок); 

	РежимПоказать = "Все";  
	
	РаздельныйУчетВходящегоНДС 			= ПолучитьРаздельныйУчетНДС();  
	ГруппировкаЗатратПоПодразделениям 	= ПолучитьГруппировкуЗатратПоПодразделениям();

	ПоказатьСпособУчетаНДС 		= РаздельныйУчетВходящегоНДС И CW_ПраваДоступа.ПравоДоступно("РедактированиеСпособаУчетаНДС");
	
	Элементы.ФормаЗагрузитьФайл.Видимость 	= (ТипЗнч(ВнешниеДанные) <> Тип("ТабличныйДокумент"));  
	Если ТипЗнч(ВнешниеДанные) <> Тип("ТабличныйДокумент") Тогда
		Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаНачало;	
	КонецЕсли;

	//Значения по умолчанию
	Элементы.СпособУчетаНДС.Видимость =  ПоказатьСпособУчетаНДС;
	Элементы.Подразделение.Видимость  =  ГруппировкаЗатратПоПодразделениям;   
	
	ПорядокОтражения	= ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты");
	ЗаполнятьСтавкуНДСИзНоменклатуры = истина;
	СпособУчетаНДС		= ПредопределенноеЗначение("Перечисление.СпособыУчетаНДС.ПринимаетсяКВычету");
	Количество  		= 1;
	//Значения по умолчанию
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРаздельныйУчетНДС()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиУчетаНДССрезПоследних.Организация КАК Организация,
	|	НастройкиУчетаНДССрезПоследних.РаздельныйУчетНДСНаСчете19 КАК РаздельныйУчетНДСНаСчете19
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК НастройкиУчетаНДССрезПоследних";  
	
	Запрос.УстановитьПараметр("ДатаСреза", 		ДанныеДокумента.Дата);
	Запрос.УстановитьПараметр("Организация", 	ДанныеДокумента.Организация); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	Если Выборка.Следующий() Тогда
		Возврат Выборка.РаздельныйУчетНДСНаСчете19;
	КонецЕсли;  
	
	Возврат Ложь;

КонецФункции    

&НаСервере
Функция ПолучитьГруппировкуЗатратПоПодразделениям()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УчетнаяПолитикаСрезПоследних.Организация КАК Организация,
	               |	CW_УчетнаяПолитикаСрезПоследних.ГруппировкаЗатратПоПодразделениям КАК ГруппировкаЗатратПоПодразделениям
	               |ИЗ
	               |	РегистрСведений.CW_УчетнаяПолитика.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК CW_УчетнаяПолитикаСрезПоследних";  
	
	Запрос.УстановитьПараметр("ДатаСреза", 		ДанныеДокумента.Дата);
	Запрос.УстановитьПараметр("Организация", 	ДанныеДокумента.Организация); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ГруппировкаЗатратПоПодразделениям;
	КонецЕсли;  
	
	Возврат Ложь;

КонецФункции 


&НаКлиенте
Процедура ПриОткрытии(Отказ)    
	
	Если ТипЗнч(ВнешниеДанные) = Тип("ТабличныйДокумент") Тогда 
		Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаОжидание;
		НачатьЧтениеФайлаВФоне(ВнешниеДанные);  
	Иначе
		ОбработатьШагНаКлиенте("Шаг1");
	КонецЕсли;

КонецПроцедуры

//Шаги
&НаКлиенте
Процедура КомандаДалее(Команда)  
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСохраненииНастроек", ЭтотОбъект);
	Если Не СохраненыНастройки Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Сохранить выполненное сопоставление колонок?", Режим, 0);		
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Нет); 
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСохраненииНастроек(Результат, ДополнительныеПараметры) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПослеСхраненияНастроекФормы", ЭтотОбъект);
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьФормуСохраненияНастроек(Оповещение);  
	КонецЕсли; 
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ВыполнитьОбработкуОповещения(Оповещение, Неопределено); 
	КонецЕсли;  
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеСхраненияНастроекФормы(Результат, ДополнительныеПараметры) Экспорт
	
	ОбработатьШагНаКлиенте("Шаг2"); 
	
	УстановитьОтборСтрок();
	УстановитьИтогиПоКолонкам();

КонецПроцедуры


&НаКлиенте
Процедура КомандаДалееШаг3(Команда)

	ОбработатьШагНаКлиенте("Шаг3"); 
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаНазад(Команда) 
	
	ОбработатьШагНаКлиенте("Шаг1");   
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШагНаКлиенте(ИмяШага) 
	
	Если ИмяШага = "Шаг1" Тогда
		Элементы.ФормаЗагрузитьФайл.КнопкаПоУмолчанию = Истина;  
		Если ТаблицаСоответствий.Количество() > 0 Тогда
			ПометитьСтрокиТабличногоДокумента();
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяШага = "Шаг2" Тогда
		Успешно = Истина;
		ЗаполнитьТаблицуСоответствий(Успешно);    
		Если Успешно Тогда
			Элементы.КомандаДалееШаг3.КнопкаПоУмолчанию = Истина; 
		Иначе
			ПоказатьПредупреждение(, "Не установлено соответствие колонок!"); 
			ИмяШага = "Шаг1"	
		КонецЕсли;
	КонецЕсли;

	УстановитьТекущуюСтраницуДляШагаНаСервере(ИмяШага); 
	
	Если ИмяШага = "Шаг3" Тогда 
		
		Если Не ПропускатьНеподобранныеСтроки Тогда
			СтруктураОтбора = Новый Структура("ФлагПодобрано", Ложь);
			мСтроки = ТаблицаСоответствий.НайтиСтроки(СтруктураОтбора);
			Если мСтроки.Количество() > 0 Тогда
				ПоказатьПредупреждение(, "Необходимо подобрать все соответствия!"); 
				Возврат;
			КонецЕсли; 
		КонецЕсли;
	
		ПолучитьАдресТаблицыДокумента();
		ЭтаФорма.Закрыть();
		
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Функция УстановитьТекущуюСтраницуДляШагаНаСервере(ИмяШага)
	
	СоответствиеСтраницШагам = ПолучитьСоответствиеСтраницШагам();
	
	Страница = СоответствиеСтраницШагам.Получить(ИмяШага);
	Если Страница = Неопределено Тогда
		ВызватьИсключение "Ошибка!";
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Страница;

КонецФункции 

&НаСервере
Функция ПолучитьСоответствиеСтраницШагам() 
	
	Соответствие = новый Соответствие;
	Соответствие.Вставить("Шаг1", Элементы.СтраницаШаг1);
	Соответствие.Вставить("Шаг2", Элементы.СтраницаШаг2); 
	Соответствие.Вставить("Шаг3", Элементы.СтраницаШаг2); 
	Соответствие.Вставить("Шаг4", Элементы.СтраницаШаг2); 
	
	Возврат Соответствие;
	
	
КонецФункции
//Шаги

//Работа с макетом 
&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Область.Верх = 1 И Область.Лево <= ТабличныйДокумент.ШиринаТаблицы Тогда
		
		ДополнительныеПараметры = Новый Структура("ТекущаяОбласть", Область);  
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить("РеквизитДокумента", 		"Реквизит табличной части документа",, БиблиотекаКартинок.Реквизит);
		СписокВыбора.Добавить("Параметр", 				"Параметр грузоперевозки"			,, БиблиотекаКартинок.CW_ПараметрыГрузоперевозок);
		СписокВыбора.Добавить("ДополнительныеПоиск", 	"Дополнительные поля поиска"		,, БиблиотекаКартинок.CW_Лупа);
		
		Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборТипаДанных", ЭтотОбъект, ДополнительныеПараметры);

		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элемент); 
	
	КонецЕсли;  
	
	Если Область.Верх = 2 И Область.Лево <= ТабличныйДокумент.ШиринаТаблицы Тогда
		
		ОбластьДанных = ТабличныйДокумент.Область(1,Область.Лево, 1, Область.Лево);
		
		СписокВыбора = Новый СписокЗначений;
		
		ДополнительныеПараметры = Новый Структура("ТекущаяОбласть", Область);
		
		СписокРеквизитовПоиска 	= ПолучитьСписокРеквизитовПоиска();
		Если СписокРеквизитовПоиска.НайтиПоЗначению(ОбластьДанных.ПараметрРасшифровки) <> Неопределено Тогда
			СписокВыбора.Добавить("ПоискПоЗначению",	"Поиск по значению", , БиблиотекаКартинок.Найти);
		КонецЕсли;
		
		СписокРеквизитовДокумента = ПолучитьСписокДоступныхРеквизитовДокумента();
		Если СписокРеквизитовДокумента.НайтиПоЗначению(ОбластьДанных.ПараметрРасшифровки) <> Неопределено Тогда  
			
			СписокВыбора.Добавить("ПоискПоЗначению",	"Поиск по значению", , БиблиотекаКартинок.Найти);
			
			Если ОбластьДанных.ПараметрРасшифровки <> "Грузоперевозка" Тогда
				СписокВыбора.Добавить("ОбновитьЗначение",	"Записать значение", , БиблиотекаКартинок.Изменить);   
			КонецЕсли;
			
		КонецЕсли;  
		
		Если СписокВыбора.Количество() = 0 Тогда
			СписокВыбора.Добавить("ПоискПоЗначению",	"Поиск по значению", , БиблиотекаКартинок.Найти);
			СписокВыбора.Добавить("ОбновитьЗначение",	"Записать значение", , БиблиотекаКартинок.Изменить);
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборДействия", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элемент); 
		
	КонецЕсли;  
	
КонецПроцедуры

     

&НаКлиенте
Процедура ЗавершитьВыборТипаДанных(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;   

	ДоступныеДействия = ПолучитьДоступныеДействия();
		
	ОбластьДействие 	= ТабличныйДокумент.Область(2, ДополнительныеПараметры.ТекущаяОбласть.Лево, 2, ДополнительныеПараметры.ТекущаяОбласть.Лево);
	ДопПараметры 		= Новый Структура("ТекущаяОбласть", ОбластьДействие);
	ОповещениеДействие	= Новый ОписаниеОповещения("ЗавершитьВыборДействия", ЭтотОбъект, ДопПараметры);
	ОписаниеОповещения  = Новый ОписаниеОповещения("ТабличныйДокументВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если РезультатВыбора.Значение = "Параметр" Тогда 
		
		Действие  = ДоступныеДействия.НайтиПоЗначению("ПоискПоЗначению");
		
		ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",, ЭтотОбъект,,,, ОписаниеОповещения);
		
	ИначеЕсли РезультатВыбора.Значение = "ДополнительныеПоиск" Тогда
		
		Действие = ДоступныеДействия.НайтиПоЗначению("ПоискПоЗначению");
		
		СписокВыбора 	= ПолучитьСписокРеквизитовПоиска();
		СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите реквизит поиска");  
		
		
	ИначеЕсли РезультатВыбора.Значение = "РеквизитДокумента" Тогда
		
		ДополнительныеПараметры.Вставить("УстановитьДействие", Истина);
		
		СписокРеквизитов = ПолучитьСписокДоступныхРеквизитовДокумента(); 
     	СписокРеквизитов.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите реквизит документа");  

	КонецЕсли;

	ВыполнитьОбработкуОповещения(ОповещениеДействие, Действие); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокРеквизитовПоиска()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Заказ", 	"Заказ",, БиблиотекаКартинок.Реквизит); 
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокДоступныхРеквизитовДокумента()
	
	СписокДоступныхРеквизитов = Обработки.CW_ЗагрузкаТабличнойЧастиДокументаРасходыПоГрузоперевозкеИзФайла.ПолучитьСписокДоступныхРеквизитовДокумента();
	
	Если НЕ ПоказатьСпособУчетаНДС Тогда
		СписокДоступныхРеквизитов.Удалить(СписокДоступныхРеквизитов.НайтиПоЗначению("СпособУчетаНДС"));
	КонецЕсли;
	
	Если Не ГруппировкаЗатратПоПодразделениям Тогда
		СписокДоступныхРеквизитов.Удалить(СписокДоступныхРеквизитов.НайтиПоЗначению("Подразделение"));
	КонецЕсли; 
	
	Возврат СписокДоступныхРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыборДействия(РезультатВыбора, ДополнительныеПараметры) Экспорт
   	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ТабличныйДокументВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	РезультатЗакрытия = Новый Структура;
	РезультатЗакрытия.Вставить("Представление", РезультатВыбора.Представление);
	РезультатЗакрытия.Вставить("Идентификатор", РезультатВыбора.Значение);
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, РезультатЗакрытия);
	
	ПодключитьОбработчикОжидания("РассчитатьШиринуКолонокТабличногоДокумента", 0.1, Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура РассчитатьШиринуКолонокТабличногоДокумента()
	
	РассчитатьШиринуКолонокТабличногоДокументаНаСервере();
	
КонецПроцедуры  

&НаСервере
Процедура РассчитатьШиринуКолонокТабличногоДокументаНаСервере()
	
	Обработки.CW_ЗагрузкаТабличнойЧастиДокументаРасходыПоГрузоперевозкеИзФайла.РассчитатьШиринуКолонокТабличногоДокумента(ТабличныйДокумент);
	
КонецПроцедуры


&НаКлиенте
Процедура ТабличныйДокументВыборЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;  

	Если  ТипЗнч(РезультатВыбора) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
		РезультатЗакрытия = ПолучитьДанныеПараметра(РезультатВыбора);                                         
	КонецЕсли;   
	
	Если ТипЗнч(РезультатВыбора) = Тип("ЭлементСпискаЗначений") Тогда  
		
		Идентификатор = РезультатВыбора.Значение;
		Если СтрНачинаетсяС(РезультатВыбора.Значение, "Грузоперевозка") Тогда  
			Идентификатор = "Грузоперевозка";  
			
			ИскатьГрузоперевозкиПоКоду = СтрЗаканчиваетсяНа(РезультатВыбора.Значение, "_ПоКоду");
		КонецЕсли;
			
		РезультатЗакрытия = Новый Структура;
		РезультатЗакрытия.Вставить("Представление", РезультатВыбора.Представление);
		РезультатЗакрытия.Вставить("Идентификатор", Идентификатор);
		
		Если ДополнительныеПараметры.Свойство("УстановитьДействие") и
			ДополнительныеПараметры.УстановитьДействие Тогда 
			
			ДоступныеДействия = ПолучитьДоступныеДействия();
			
			Если СтрНачинаетсяС(РезультатВыбора.Значение, "Грузоперевозка") Тогда  
				Действие = ДоступныеДействия.НайтиПоЗначению("ПоискПоЗначению");
			Иначе
				Действие = ДоступныеДействия.НайтиПоЗначению("ОбновитьЗначение");
			КонецЕсли;
			
			ОбластьДействие 	= ТабличныйДокумент.Область(2, ДополнительныеПараметры.ТекущаяОбласть.Лево, 2, ДополнительныеПараметры.ТекущаяОбласть.Лево);
			ДопПараметры 		= Новый Структура("ТекущаяОбласть", ОбластьДействие);
			ОповещениеДействие	= Новый ОписаниеОповещения("ЗавершитьВыборДействия", ЭтотОбъект, ДопПараметры);
			
			ВыполнитьОбработкуОповещения(ОповещениеДействие, Действие); 
		КонецЕсли;
	
	КонецЕсли;  
	
	Если  ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		РезультатЗакрытия = РезультатВыбора;
	КонецЕсли;     
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстНезаполненногоЗаголовка = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.ТекстЗаголовкаНесопоставленнойКолонки();
	Для НомерКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		
		Область = ТабличныйДокумент.Область(1, НомерКолонки);
		Если Область.ПараметрРасшифровки = РезультатЗакрытия.Идентификатор Тогда
			Область.Текст = ТекстНезаполненногоЗаголовка;
			Область.ПараметрРасшифровки = "";
			Область.ЦветТекста = ОбщегоНазначенияКлиентПовтИсп.ЦветСтиля("НезаполненныйРеквизит");
		КонецЕсли;
		
	КонецЦикла;  
	
	ДополнительныеПараметры.ТекущаяОбласть.Текст      			= РезультатЗакрытия.Представление;
	ДополнительныеПараметры.ТекущаяОбласть.ЦветТекста 			= ОбщегоНазначенияКлиентПовтИсп.ЦветСтиля("ЦветГиперссылки");
	ДополнительныеПараметры.ТекущаяОбласть.ПараметрРасшифровки 	= РезультатЗакрытия.Идентификатор;

КонецПроцедуры  

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	Верх = ТабличныйДокумент.ТекущаяОбласть.Верх;
	Низ  = ТабличныйДокумент.ТекущаяОбласть.Низ;
	Лево = ТабличныйДокумент.ТекущаяОбласть.Лево;
	
	Если (Верх = 1 или Верх = 2) И (Низ = 1 или Низ = 2) Тогда
		Возврат; // выделена первая строка (строка заголовка)
	КонецЕсли;
	
	УдалитьСтрокиНаСервере(Верх, Низ);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево);
	
КонецПроцедуры  

&НаКлиенте
Процедура ДобавитьСтроку(Команда)

	Верх = ТабличныйДокумент.ТекущаяОбласть.Верх;
	Низ  = ТабличныйДокумент.ТекущаяОбласть.Низ;
	Лево = ТабличныйДокумент.ТекущаяОбласть.Лево;
	
	Если (Верх = 1 или Верх = 2) И (Низ = 1 или Низ = 2) Тогда
		Возврат; // выделена первая строка (строка заголовка)
	КонецЕсли;
	
	ДобавитьСтрокиНаСервере(Верх, Низ);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево); 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКолонку(Команда)
	
	Если ТабличныйДокумент.ШиринаТаблицы = 1 Тогда
		Возврат; // выделена первая строка (строка заголовка)
	КонецЕсли;

	Лево  = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Право = ТабличныйДокумент.ТекущаяОбласть.Право;
	Верх  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	
	УдалитьКолонкиНаСервере(Лево, Право);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево);
	
КонецПроцедуры  

&НаСервере
Процедура УдалитьСтрокиНаСервере(Верх, Низ)
	
	Если Верх = 1 Тогда
		Верх = 2; // чтобы не удалить заголовки колонок
	КонецЕсли;
	
	Область = ТабличныйДокумент.Область(Верх,, Низ);
	ТабличныйДокумент.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоВертикали);
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьСтрокиНаСервере(Верх, Низ)
	
	Область = ТабличныйДокумент.Область(Верх,, Низ);
	ТабличныйДокумент.ВставитьОбласть(Область, Область, ТипСмещенияТабличногоДокумента.ПоВертикали);  
	
	ВыделеноСтрок = (Низ - Верх) + 1;
	
	НоваяОбласть = ТабличныйДокумент.Область(Низ+1,, Низ+ВыделеноСтрок);
	НоваяОбласть.Очистить(Истина,Ложь,Ложь);
	
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьКолонку(Команда) 
	
	Лево  = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Право = ТабличныйДокумент.ТекущаяОбласть.Право;
	Верх  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	
	ДобавитьКолонкиНаСервере(Лево, Право);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкиНаСервере(Лево, Право)
	
	Область = ТабличныйДокумент.Область(, Лево,, Право);
	ТабличныйДокумент.ВставитьОбласть(Область, Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
	ВыделеноКолонок = (Право - Лево) + 1; 
	ЛевоНовая 		= Лево+1;
	ПравоНовая		= Лево+ВыделеноКолонок;
	
	НоваяОбласть = ТабличныйДокумент.Область(3,ЛевоНовая, ТабличныйДокумент.ВысотаТаблицы, ПравоНовая);
	НоваяОбласть.Очистить(Истина,Ложь,Ложь);
	
	Для Колонка = ЛевоНовая По ПравоНовая Цикл
		Область = ТабличныйДокумент.Область(1, Колонка, 1, Колонка);    
		Область.Текст 				= "Выбрать параметр";
		Область.ПараметрРасшифровки = "";
		Область.ЦветТекста 			= ЦветаСтиля.НезаполненныйРеквизит;  
		
		Область = ТабличныйДокумент.Область(2, Колонка, 2, Колонка);    
		Область.Текст 				= "Выбрать действие";
		Область.ПараметрРасшифровки = "";
		Область.ЦветТекста 			= ЦветаСтиля.НезаполненныйРеквизит;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКолонкиНаСервере(Лево, Право)
	
	Область = ТабличныйДокумент.Область(, Лево,, Право);
	ТабличныйДокумент.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
КонецПроцедуры   

&НаКлиенте
Процедура СнятьЗащитуЯчеек(Команда)
	
	Лево  = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Право = ТабличныйДокумент.ТекущаяОбласть.Право;
	Верх  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	Низ  = ТабличныйДокумент.ТекущаяОбласть.Низ;
	
	СнятьЗащитуЯчеекНаСервере(Право, Лево, Верх, Низ);  
	УстановитьГраницыНаСервере(Право, Лево, Верх, Низ);
	
КонецПроцедуры


&НаСервере
Процедура УстановитьГраницыНаСервере(Право, Лево, Верх, Низ)
	
	Линия	 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	
	Для НомерСтроки = Верх По Низ Цикл
		Для НомерКолонки = Лево По Право Цикл
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Ячейка.Обвести(Линия, Линия, Линия, Линия);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Процедура СнятьЗащитуЯчеекНаСервере(Право, Лево, Верх, Низ) 
	
	Для НомерСтроки = Верх По Низ Цикл 
		Если НомерСтроки < 3 Тогда
			Продолжить;
		КонецЕсли;
		
		Для НомерКолонки = Лево По Право Цикл
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Ячейка.Защита = Ложь; 
			Ячейка.ЦветФона = ЦветаСтиля.ПравоРедактированияФон
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеПараметра(Параметр)
	
	Структура = Новый Структура;
	Структура.Вставить("Представление", Параметр.Наименование);
	Структура.Вставить("Идентификатор", XMLСтрока(Параметр));
	Структура.Вставить("ТипЗначения", 	Параметр.ТипЗначения);
	
	Возврат Структура;
	
КонецФункции   

&НаСервере
Процедура ПометитьСтрокиТабличногоДокумента()
	
	Для Каждого СтрокаТаблицы из ТаблицаСоответствий Цикл 
		Если СтрокаТаблицы.ФлагПодобрано Тогда
			Продолжить;
		КонецЕсли;
		Область = ТабличныйДокумент.Область(СтрокаТаблицы.СтрокаМакета, , СтрокаТаблицы.СтрокаМакета);
		Область.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;	
	КонецЦикла;
	
КонецПроцедуры   


//Работа с макетом

//Работа с настройрками
&НаКлиенте
Процедура СохранитьНастройку(Команда)  
	
	ОткрытьФормуСохраненияНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСохраненияНастроек(Оповещение = Неопределено)
	
	СохраненыНастройки = Истина;
	
	СоответствиеНастроек = ПолучитьНастроенныйЗаголовокНаСервере();
	
	ПараметрыФормыВариантов = новый Структура;
	ПараметрыФормыВариантов.Вставить("РежимФормы", 	0);
	ПараметрыФормыВариантов.Вставить("Настройки", 	СоответствиеНастроек);
	
	ОткрытьФорму("Обработка.CW_ЗагрузкаТабличнойЧастиДокументаРасходыПоГрузоперевозкеИзФайла.Форма.ФормаВариантовНастроек", ПараметрыФормыВариантов,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция ПолучитьНастроенныйЗаголовокНаСервере()
	
	СоответствиеНастроек = новый Соответствие;
	
	Для Лево = 1 по ТабличныйДокумент.ШиринаТаблицы Цикл
		
		Область 		= ТабличныйДокумент.Область(1, Лево);
		ОбластьДействия = ТабличныйДокумент.Область(2, Лево);
		
		СтруктураНастроек = Новый Структура;
		
		ДанныеЯчейки = Новый Структура;
		ДанныеЯчейки.Вставить("Текст", 					Область.Текст);
		ДанныеЯчейки.Вставить("ПараметрРасшифровки", 	Область.ПараметрРасшифровки); 
		ДанныеЯчейки.Вставить("ЦветТекста", 			Область.ЦветТекста); 
		
		СтруктураНастроек.Вставить("Заголовок", ДанныеЯчейки);
		
		ДанныеЯчейки = Новый Структура;
		ДанныеЯчейки.Вставить("Текст", 					ОбластьДействия.Текст);
		ДанныеЯчейки.Вставить("ПараметрРасшифровки", 	ОбластьДействия.ПараметрРасшифровки); 
		ДанныеЯчейки.Вставить("ЦветТекста", 			ОбластьДействия.ЦветТекста); 
		
		СтруктураНастроек.Вставить("Действия", ДанныеЯчейки);
		
		СоответствиеНастроек.Вставить(Лево, СтруктураНастроек);
	КонецЦикла;
	
	Возврат СоответствиеНастроек;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьНастройку(Команда)       
	
	СохраненыНастройки = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборНастроек", ЭтотОбъект);

	ПараметрыФормыВариантов = новый Структура;
	ПараметрыФормыВариантов.Вставить("РежимФормы", 1);
	
	ОткрытьФорму("Обработка.CW_ЗагрузкаТабличнойЧастиДокументаРасходыПоГрузоперевозкеИзФайла.Форма.ФормаВариантовНастроек", ПараметрыФормыВариантов,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&наКлиенте
Процедура ЗавершитьВыборНастроек(РезультатВыбора, ДополнительныеПараметры) Экспорт   
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьВыборНастроекНаСервере(РезультатВыбора);	
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьВыборНастроекНаСервере(СоответствиеНастроек)    
	
	Если ТипЗнч(СоответствиеНастроек) <> тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	Для Лево = 1 по ТабличныйДокумент.ШиринаТаблицы Цикл   
		
		СтруктураНастроек = СоответствиеНастроек.Получить(Лево);
		Если СтруктураНастроек = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеЗаголовка = СтруктураНастроек.Заголовок;
		
		Область	 = ТабличныйДокумент.Область(1, Лево);
		Область.Текст 				= ДанныеЗаголовка.Текст;
		Область.ПараметрРасшифровки = ДанныеЗаголовка.ПараметрРасшифровки;
		Область.ЦветТекста 			= ДанныеЗаголовка.ЦветТекста;
		
		ДанныеДействия   = СтруктураНастроек.Действия; 
		
		ОбластьДействия = ТабличныйДокумент.Область(2, Лево);
		ОбластьДействия.Текст 				= ДанныеДействия.Текст;
		ОбластьДействия.ПараметрРасшифровки = ДанныеДействия.ПараметрРасшифровки;
		ОбластьДействия.ЦветТекста 			= ДанныеДействия.ЦветТекста;
		
	КонецЦикла;
	
	Обработки.CW_ЗагрузкаТабличнойЧастиДокументаРасходыПоГрузоперевозкеИзФайла.РассчитатьШиринуКолонокТабличногоДокумента(ТабличныйДокумент);
	
КонецПроцедуры
//Работа с настройрками

//Чтиение файла
&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьПомещениеФайлаНаНаСервер", ЭтотОбъект);
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файл";
	ПараметрыДиалога.Фильтр    = "Файл Excel|*.xls;*.xlsx";
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения,, ,,ПараметрыДиалога, Новый УникальныйИдентификатор);
	
КонецПроцедуры           

&НаКлиенте
Процедура ЗавершитьПомещениеФайлаНаНаСервер(ОписаниеПомещенногоФайла,ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено 
		Или ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	Конецесли;       

	Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаОжидание;
	
	ДанныеДляЗагрузки = Новый Структура;
	ДанныеДляЗагрузки.Вставить("Адрес", ОписаниеПомещенногоФайла.Адрес);
	ДанныеДляЗагрузки.Вставить("РасширениеФайла", ОписаниеПомещенногоФайла.СсылкаНаФайл.Расширение);
	
	НачатьЧтениеФайлаВФоне(ДанныеДляЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЧтениеФайлаВФоне(Знач ДанныеДляЗагрузки)
	
	РезультатВыполнения =  ОбработатьЗагрузкуФайлаНаСервереВФоне(ДанныеДляЗагрузки);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗагрузкиФайла", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ОбработатьЗагрузкуФайлаНаСервереВФоне(ДанныеДляЗагрузки=Неопределено) 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Чтение файла Excel в табличный документ";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;

	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("ИмяМакетаЗаголовка", "МакетЗаголовка");
	
	Если ТипЗнч(ДанныеДляЗагрузки) = Тип("Структура") тогда
		ДвоичныеДанные 			= ПолучитьИзВременногоХранилища(ДанныеДляЗагрузки.Адрес);
		ХранилищеДанныхФайла 	= Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9)); 
		
		ПараметрыЗагрузки.Вставить("ХранилищеДанныхФайла", 	ХранилищеДанныхФайла);
		ПараметрыЗагрузки.Вставить("РасширениеФайла", 		ДанныеДляЗагрузки.РасширениеФайла);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеДляЗагрузки) = Тип("ТабличныйДокумент") тогда
		ПараметрыЗагрузки.Вставить("ДанныеФайла", 	ДанныеДляЗагрузки); 
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ЗагрузкаТабличнойЧастиДокументаРасходыПоГрузоперевозкеИзФайла.ЗагрузитьФайлВТабличныйДокумент", ПараметрыЗагрузки, ПараметрыВыполнения);
	
КонецФункции  

&НаКлиенте
Процедура ОбработатьРезультатЗагрузкиФайла(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ТабличныйДокумент = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата); 
		
		Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаРезультат;
		
		Элементы.ФормаКомандаДалее.КнопкаПоУмолчанию = Истина;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось прочитать файл!!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка чтения файла");
	КонецЕсли;
	
КонецПроцедуры
//Чтиение файла

//Таблица соответстий  
&НаКлиенте
Процедура РежимПоказатьПриИзменении(Элемент)
	
	УстановитьОтборСтрок();
	УстановитьИтогиПоКолонкам();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрок()
	
	Включен = РежимПоказать <> "Все";
	
	ОтборСтрок = Неопределено;
	Если Включен Тогда  
		Подобрано = (РежимПоказать = "Синхронизированные");
		ОтборСтрок = новый ФиксированнаяСтруктура(Новый Структура("ФлагПодобрано", Подобрано));
	КонецЕсли;
	
	Элементы.ТаблицаСоответствий.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуСоответствий(Успешно) 
	
	СоответствиеИменКолонок = Новый Соответствие;    
	ТаблицаЗначений 		= Новый ТаблицаЗначений; 
	ТаблицаЗначений.Колонки.Добавить("НомерСтроки", 	Новый ОписаниеТипов("Число"));
	ТаблицаЗначений.Колонки.Добавить("СтрокаМакета", 	Новый ОписаниеТипов("Число"));
	
	ОписаниеКолонок.Очистить();
	
	//Соответствие колонок
	ЗаполнитьОписаниеКолонок(СоответствиеИменКолонок, ТаблицаЗначений);
	Если ОписаниеКолонок.Количество() = 0 Тогда
		Успешно = Ложь;
		Возврат;
	КонецЕсли;
	//Соответствие колонок  
	
	мСтрокиПоискПоЗначению = ОписаниеКолонок.НайтиСтроки(Новый Структура("ОтборПоЗначению", Истина));
	Если мСтрокиПоискПоЗначению.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют поля поиска грузоперевозок!");
		Возврат;
	КонецЕсли;
	
	//Заполнение промежуточной таблицы
	ЗаполнитьТабицуДанных(СоответствиеИменКолонок, ТаблицаЗначений);
	//Заполнение промежуточной таблицы

	//Реквизиты формы
	ОбработатьРеквизитыФормы(ТаблицаЗначений);
	//Реквизиты формы
	
	//Удаление элементов формы
	УдалитьНенужныеЭлементыФормы();
   	//Удаление элементов формы
	
	//Добавление элементов на фомру
	ДобавитьЭлементыФормы(ТаблицаЗначений);
	//Добавление элементов на фомру

	//Поиск грузоперевозок  
	ПодобратьГрузоперевозки(ТаблицаЗначений);
	//Поиск грузоперевозок  
	
	ТаблицаСоответствий.Загрузить(ТаблицаЗначений); 
	
	УстановитьИтогиПоКолонкам();
	УстановитьФлагПодобрано();

КонецПроцедуры 

&НаСервере
Процедура ПодобратьГрузоперевозки(ТаблицаЗначений)
	
	мСтрокиПоискПоЗначению = ОписаниеКолонок.НайтиСтроки(Новый Структура("ОтборПоЗначению", Истина));
	Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл 
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "Грузоперевозка") Тогда	
			ОтборКомпоновкиДанных = Новый ОтборКомпоновкиДанных;
			Для Каждого СтрокаПоиска из мСтрокиПоискПоЗначению Цикл   
				ЗначениеКолонки = СтрокаТаблицы[СтрокаПоиска.ИмяПоля];
				Если Не ЗначениеЗаполнено(ЗначениеКолонки) Тогда 
					Продолжить;
				КонецЕсли;
				ЭлементОтбора = ОтборКомпоновкиДанных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(СтрокаПоиска.ИмяПоляКомпоновки); 
				ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
				ЭлементОтбора.ПравоеЗначение 	= ЗначениеКолонки; 
				ЭлементОтбора.Использование 	= Истина; 
			КонецЦикла; 
			
			СтрокаТаблицы.Грузоперевозка = ПолучитьГрузоперевозкуПоОтбору(ОтборКомпоновкиДанных);
		КонецЕсли;
	
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "Номенклатура") 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТаблицы, "Грузоперевозка") Тогда
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Грузоперевозка)
				и ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
				
				НоменклатураЗамены = ПолучитьЗначениеЗаменыДляНоменклатуры(СтрокаТаблицы.Номенклатура, СтрокаТаблицы.Грузоперевозка); 
				Если ЗначениеЗаполнено(НоменклатураЗамены) Тогда
					СтрокаТаблицы.Номенклатура = НоменклатураЗамены;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли; 
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыФормы(Знач ТаблицаЗначений)
	
	ТаблицаФормы 		= Элементы.ТаблицаСоответствий;
	ГруппаПоиск 		= ДобавитьГруппуТаблицы("ГруппаПоискПоЗначению", "Грузоперевозка", Истина, Новый Картинка, ТаблицаФормы);
	
	СоответствиеКартинок = Новый Соответствие;
 	СоответствиеКартинок.Вставить("ПоискПоЗначению", 	БиблиотекаКартинок.Найти);
	СоответствиеКартинок.Вставить("ОбновитьЗначение", 	БиблиотекаКартинок.Изменить);
	
	ТабОписаниеКолонок 	= ОписаниеКолонок.Выгрузить();
	
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		
		СтрокаОписания = ТабОписаниеКолонок.Найти(Колонка.Имя, "ИмяКолонки");  
		Если СтрокаОписания = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаОписания.Действие = "ПоискПоЗначению" Тогда
			ЭлементРодитель = ГруппаПоиск;	
		Иначе   
			ЭлементРодитель = ТаблицаФормы;	
		КонецЕсли; 
		
		//Добавляем группу таблицы
		ГруппаТаблицы = Элементы.Найти(СтрокаОписания.ИмяГруппы);
		Если ГруппаТаблицы = Неопределено Тогда
			ГруппаТаблицы 	= ДобавитьГруппуТаблицы(СтрокаОписания.ИмяГруппы, 
														СтрокаОписания.ЗаголовокГруппы,
														СтрокаОписания.ОтображатьВШапкеГруппу, 
														Новый Картинка, 
														ЭлементРодитель);
														
			ГруппаТаблицы.РастягиватьПоГоризонтали = ложь;
			ГруппаТаблицы.РастягиватьПоВертикали   = Ложь;   
			
			Если СтрокаОписания.ЕстьСсылочныйТип Тогда
				ГруппаТаблицы.Группировка  = ГруппировкаКолонок.Вертикальная;
			КонецЕсли;
		КонецЕсли;
		//Добавляем группу таблицы
		
		ЦветФонаЯчейки 	= ?(СтрокаОписания.ТолькоПросмотр, Новый Цвет, ЦветаСтиля.ПравоРедактированияФон);
		
		КартинкаШапки = СоответствиеКартинок.Получить(СтрокаОписания.Действие); 
		КартинкаШапки = ?(КартинкаШапки=Неопределено, Новый Картинка, КартинкаШапки);
	
		//Добавляем элемент формы
		НовыйЭлемент = Элементы.Добавить("ТаблицаСоответствий"+Колонка.Имя, Тип("ПолеФормы"), ГруппаТаблицы);       
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "ТаблицаСоответствий." + Колонка.Имя; 
		НовыйЭлемент.АвтоОтметкаНезаполненного 	= СтрокаОписания.КонтрольЗаполнения; 
		НовыйЭлемент.ОтображатьВШапке 		   	= СтрокаОписания.ОтображатьВШапке; 
		НовыйЭлемент.ОтображатьВПодвале			= Ложь;
		НовыйЭлемент.ТолькоПросмотр 			= СтрокаОписания.ТолькоПросмотр; 
		НовыйЭлемент.ЦветФона 		   			= ЦветФонаЯчейки;
		НовыйЭлемент.КартинкаШапки  			= КартинкаШапки;        
		НовыйЭлемент.РастягиватьПоГоризонтали 	= ложь;
		НовыйЭлемент.РастягиватьПоВертикали   	= Ложь; 
		
		НовыйЭлемент.ПутьКДаннымПодвала  		= СтрокаОписания.ПутьКДаннымПодвала; 
		НовыйЭлемент.ОтображатьВПодвале			= Не ПустаяСтрока(СтрокаОписания.ПутьКДаннымПодвала);
		
		Если НовыйЭлемент.ОтображатьВПодвале Тогда
			НовыйЭлемент.ШрифтПодвала = Новый Шрифт(,,Истина);                
		КонецЕсли;

		Ширина = ПолучитьШиринуКолнки(ТаблицаЗначений, Колонка.Имя);
		
		НовыйЭлемент.Ширина = Макс(Ширина, СтрДлина(Колонка.Заголовок)+4);
	
		//Добавляем элемент формы
		
	КонецЦикла;

КонецПроцедуры  

&НаСервере
Функция ПолучитьШиринуКолнки(ТаблицаЗначений, КолонкаИмя)
	
	ШиринаПоля = 0;
	Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл
		ДлинаЗначнеия = СтрДлина(СокрЛП(СтрокаТаблицы[КолонкаИмя]));
		ШиринаПоля = Макс(ШиринаПоля, ДлинаЗначнеия);
		Если ШиринаПоля > 20 Тогда
			ШиринаПоля = 0;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ШиринаПоля;
	
КонецФункции

&НаСервере
Функция ПолучитьИтогПоПолю(КолонкаИмя)    
	
	Возврат ТаблицаСоответствий.Итог(КолонкаИмя);
	
КонецФункции

&НаСервере
Функция ДобавитьГруппуТаблицы(ИмяГруппы, ЗаголовокГруппы, ОтображатьВШапке, КартинкаШапки, РодительскийЭлемент)
	
	ГруппаПоиск = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаПоиск.Заголовок 			= ЗаголовокГруппы;  
	ГруппаПоиск.ОтображатьВШапке 	= ОтображатьВШапке;
	ГруппаПоиск.КартинкаШапки 		= КартинкаШапки;
	
	ГруппаПоиск.Вид			 		= ВидГруппыФормы.ГруппаКолонок; 
	ГруппаПоиск.Группировка 		= ГруппировкаКолонок.Горизонтальная;

	Возврат ГруппаПоиск;
	
КонецФункции

&НаСервере
Процедура УдалитьНенужныеЭлементыФормы()
	
	мЭлементы = Новый Массив;
	Для Каждого Элемент из Элементы.ТаблицаСоответствий.ПодчиненныеЭлементы Цикл 
		Если Элемент.Имя = "ТаблицаСоответствийНомерСтроки"	Тогда
			Продолжить;
		КонецЕсли;
		мЭлементы.Добавить(Элемент);
	КонецЦикла;  
	Для Каждого Элемент из мЭлементы Цикл  
		Элементы.Удалить(Элемент);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписаниеКолонок(СоответствиеИменКолонок, ТаблицаЗначений)
	
	мРеквизитыТабличнойЧасти	= Метаданные.Документы.CW_РасходыПоГрузоперевозке.ТабличныеЧасти.Услуги.Реквизиты;    
	мРеквизитыГрузоперевозки	= Метаданные.Справочники.CW_Грузоперевозки.Реквизиты;    
	
	Для Лево = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		Область 		= ТабличныйДокумент.Область(1, Лево);  
		Если Область.ПараметрРасшифровки = "" Тогда 
			Продолжить;
		КонецЕсли; 
		
		ОбластьДействие = ТабличныйДокумент.Область(2, Лево); 
		
		РеквизитОбъекта = мРеквизитыТабличнойЧасти.Найти(Область.ПараметрРасшифровки);
		Если РеквизитОбъекта = Неопределено Тогда
			РеквизитОбъекта	= мРеквизитыГрузоперевозки.Найти(Область.ПараметрРасшифровки);
		КонецЕсли;
		
		Если РеквизитОбъекта <> Неопределено Тогда
			
			ТипЗначенияРеквизита 	= ТипЗнч(РеквизитОбъекта.Тип.ПривестиЗначение()); 
			СсылочныйТип 			= ЭтоСсылочныйТип(ТипЗначенияРеквизита);
			
			ТолькоПросмотрКолонки 	= Ложь;
			ЗаголовокКолонки 		= "Значение";
			ИмяКолонки 				= Область.ПараметрРасшифровки;	
			ТипЗначенияКолонки 		= Новый ОписаниеТипов("Строка"); 
			ПутьКДаннымПодвала		= "";
			
			Если СсылочныйТип Тогда 
				ТолькоПросмотрКолонки 	= Истина;  
				ИмяКолонки 				= "Значение"+ИмяКолонки;
			Иначе
				ТипЗначенияКолонки		= РеквизитОбъекта.Тип;  
				ЗаголовокКолонки 		= РеквизитОбъекта.Синоним; 
				
				ПустоеЗначениеПоТипу = ТипЗначенияКолонки.привестиЗначение(Неопределено);
				Если ТипЗнч(ПустоеЗначениеПоТипу) = Тип("Число") Тогда
					ПутьКДаннымПодвала = "Итог"+ИмяКолонки;	
				КонецЕсли;
			КонецЕсли; 

			СтруктураОписанияКолонки = ПолучитьСтруктуруОписанияКолонки();
			СтруктураОписанияКолонки.ИмяКолонки 				= ИмяКолонки; 
			СтруктураОписанияКолонки.Заголовок 					= ЗаголовокКолонки;
			СтруктураОписанияКолонки.Действие 					= ОбластьДействие.ПараметрРасшифровки;
			СтруктураОписанияКолонки.ТолькоПросмотр 			= Истина;
			СтруктураОписанияКолонки.ОтображатьВШапке			= Истина; 
			СтруктураОписанияКолонки.ЕстьСсылочныйТип			= СсылочныйТип; 
			СтруктураОписанияКолонки.ТипЗначения  				= ТипЗначенияКолонки;
			СтруктураОписанияКолонки.ТолькоПросмотр				= ТолькоПросмотрКолонки; 
			СтруктураОписанияКолонки.ПутьКДаннымПодвала  		= ПутьКДаннымПодвала; 
			СтруктураОписанияКолонки.УказанПутьКДаннымПодвала 	= Не ПустаяСтрока(ПутьКДаннымПодвала);
		
			СтруктураОписанияКолонки.ИмяГруппы 				= "Группа"+Область.ПараметрРасшифровки;
			СтруктураОписанияКолонки.ЗаголовокГруппы 		= РеквизитОбъекта.Синоним;
			СтруктураОписанияКолонки.ОтображатьВШапкеГруппу	= СсылочныйТип;  
			
			СтруктураОписанияКолонки.ОтборПоЗначению 		= (ОбластьДействие.ПараметрРасшифровки = "ПоискПоЗначению"); 
			
			Если ИмяКолонки = "ЗначениеГрузоперевозка" Тогда
				Если ИскатьГрузоперевозкиПоКоду Тогда  
					СтруктураОписанияКолонки.ИмяПоляКомпоновки	= "Код";
				Иначе
					СтруктураОписанияКолонки.ИмяПоляКомпоновки	= "Наименование";
				КонецЕсли;
				СтруктураОписанияКолонки.ИмяПоля			= "ЗначениеГрузоперевозка";
			КонецЕсли;   
			
			Если мРеквизитыГрузоперевозки.Найти(Область.ПараметрРасшифровки) <> Неопределено Тогда
				СтруктураОписанияКолонки.ИмяПоляКомпоновки	= Область.ПараметрРасшифровки; 
				СтруктураОписанияКолонки.ИмяПоля			= Область.ПараметрРасшифровки;
			КонецЕсли;    
			
			УстановитьОписаниеКолонки(СтруктураОписанияКолонки);  
			
			ТаблицаЗначений.Колонки.Добавить(ИмяКолонки, ТипЗначенияКолонки, РеквизитОбъекта.Синоним); 
			
			СоответствиеИменКолонок.Вставить(Лево, ИмяКолонки);
			
			Если СсылочныйТип Тогда    
				//Добавляем поле сылка
				СтруктураОписанияКолонки.ИмяКолонки			= Область.ПараметрРасшифровки;
				СтруктураОписанияКолонки.Заголовок			= "Ссылка";
				СтруктураОписанияКолонки.ТипЗначения		= РеквизитОбъекта.Тип;
				СтруктураОписанияКолонки.КонтрольЗаполнения	= Истина;
				СтруктураОписанияКолонки.ЕстьСсылочныйТип	= Ложь;
				СтруктураОписанияКолонки.ОтборПоЗначению 	= Ложь;  
				СтруктураОписанияКолонки.ТолькоПросмотр 	= Ложь;
				
				УстановитьОписаниеКолонки(СтруктураОписанияКолонки); 
				
				ТаблицаЗначений.Колонки.Добавить(Область.ПараметрРасшифровки, РеквизитОбъекта.Тип, РеквизитОбъекта.Синоним); 
			КонецЕсли;
			
		Иначе
			//Параметр грузоперевозки  
			
			//Определяем характиристик парамтера
			ИмяКолонки  = СтрЗаменить(СокрЛП(Область.ПараметрРасшифровки), "-","_");   
			ИмяГруппы 	= "Группа"+ИмяКолонки;  
			
			ПараметрГрузоперевозки 	= XMLЗначение(Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок"), Область.ПараметрРасшифровки);
			ТипЗначенияПараметра	= ТипЗнч(ПараметрГрузоперевозки.ТипЗначения.ПривестиЗначение()); 
			СсылочныйТип 			= ЭтоСсылочныйТип(ТипЗначенияПараметра);
			
			ЗаголовокКолонки 		= "Значение"; 
			ТолькоПросмотрКолонки 	= Ложь;
			ТипЗначенияКолонки 		= Новый ОписаниеТипов("Строка");
			ПутьКДаннымПодвала		= "";
			
			Если СсылочныйТип Тогда          
				ТолькоПросмотрКолонки 	= Истина;
			Иначе
				ТипЗначенияКолонки  	= ПараметрГрузоперевозки.ТипЗначения;  
				ЗаголовокКолонки 		= СокрЛП(ПараметрГрузоперевозки);
				
				ПустоеЗначениеПоТипу = ТипЗначенияКолонки.привестиЗначение(Неопределено);
				Если ТипЗнч(ПустоеЗначениеПоТипу) = Тип("Число") Тогда
					ПутьКДаннымПодвала = "Итог"+ИмяКолонки;	
				КонецЕсли;
			КонецЕсли;
			
			СтруктураОписанияКолонки = ПолучитьСтруктуруОписанияКолонки();
			СтруктураОписанияКолонки.ИмяКолонки 				= "Параметр"+ИмяКолонки;
			СтруктураОписанияКолонки.Заголовок 					= ЗаголовокКолонки;
			СтруктураОписанияКолонки.ТипЗначения 				= ТипЗначенияКолонки;
			СтруктураОписанияКолонки.Действие 					= ОбластьДействие.ПараметрРасшифровки;
			СтруктураОписанияКолонки.ТолькоПросмотр 			= ТолькоПросмотрКолонки;  
			СтруктураОписанияКолонки.ОтображатьВШапке			= Истина; 
			СтруктураОписанияКолонки.ЕстьСсылочныйТип			= СсылочныйТип; 
			СтруктураОписанияКолонки.ОтборПоЗначению 			= Не СсылочныйТип; 
			СтруктураОписанияКолонки.ПутьКДаннымПодвала 		= ПутьКДаннымПодвала; 
			СтруктураОписанияКолонки.УказанПутьКДаннымПодвала 	= Не ПустаяСтрока(ПутьКДаннымПодвала);
	
			СтруктураОписанияКолонки.ИмяГруппы 				= ИмяГруппы;
			СтруктураОписанияКолонки.ЗаголовокГруппы 		= СокрЛП(ПараметрГрузоперевозки); 
			СтруктураОписанияКолонки.ОтображатьВШапкеГруппу	= СсылочныйТип; 
			
			Если СтруктураОписанияКолонки.ОтборПоЗначению Тогда
				СтруктураОписанияКолонки.ИмяПоляКомпоновки 	= "Ссылка.["+ПараметрГрузоперевозки.Идентификатор+"]";   
				СтруктураОписанияКолонки.Параметр 			= ПараметрГрузоперевозки; 
				СтруктураОписанияКолонки.ИмяПоля			= СтруктураОписанияКолонки.ИмяКолонки;
			КонецЕсли;
			
			УстановитьОписаниеКолонки(СтруктураОписанияКолонки);
			
			ТаблицаЗначений.Колонки.Добавить("Параметр"+ИмяКолонки, ТипЗначенияКолонки, СокрЛП(ПараметрГрузоперевозки));  
			
			СоответствиеИменКолонок.Вставить(Лево, "Параметр"+ИмяКолонки);
			//Колонка "Параметр" - примитивные типы
			
			//Колонка "Параметр" - ссылочного типа
			Если СсылочныйТип Тогда  

				СтруктураОписанияКолонки.ИмяКолонки 		= "Ссылка"+ИмяКолонки;
				СтруктураОписанияКолонки.Заголовок 			= "Ссылка";
				СтруктураОписанияКолонки.ТипЗначения 		= ПараметрГрузоперевозки.ТипЗначения;
				СтруктураОписанияКолонки.Действие 			= ОбластьДействие.ПараметрРасшифровки;
				СтруктураОписанияКолонки.ТолькоПросмотр 	= Ложь;  
				
				СтруктураОписанияКолонки.ИмяГруппы 			= ИмяГруппы;
				СтруктураОписанияКолонки.ЗаголовокГруппы 	= СокрЛП(ПараметрГрузоперевозки); 
				СтруктураОписанияКолонки.ЕстьСсылочныйТип	= Ложь; 
				
				СтруктураОписанияКолонки.КонтрольЗаполнения	= Ложь;
				
				СтруктураОписанияКолонки.ОтборПоЗначению	= Истина;
				СтруктураОписанияКолонки.ИмяПоляКомпоновки 	= "Ссылка.[" + ПараметрГрузоперевозки.Идентификатор + "]";   
				СтруктураОписанияКолонки.Параметр 			= ПараметрГрузоперевозки; 
				
				УстановитьОписаниеКолонки(СтруктураОписанияКолонки);
				
				ТаблицаЗначений.Колонки.Добавить("Ссылка"+ИмяКолонки, ПараметрГрузоперевозки.ТипЗначения, СокрЛП(ПараметрГрузоперевозки));  
	
			КонецЕсли; 
			//Колонка "Параметр" - ссылочного типа  
		КонецЕсли;
		
	КонецЦикла;   
	
	ПараметрыОтбора = Новый Структура("ИмяКолонки", "Грузоперевозка");
	НайденныеСтроки = ОписаниеКолонок.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтруктураОписанияКолонки = ПолучитьСтруктуруОписанияКолонки();  
		СтруктураОписанияКолонки.Действие			= "ПоискПоЗначению";
		СтруктураОписанияКолонки.Заголовок			= "Грузоперевозка";
		СтруктураОписанияКолонки.ЗаголовокГруппы	= "Грузоперевозка";
		СтруктураОписанияКолонки.ИмяГруппы			= "ГруппаГрузоперевозка";
		СтруктураОписанияКолонки.ИмяКолонки			= "Грузоперевозка";
		СтруктураОписанияКолонки.ИмяПоля			= "ЗначениеГрузоперевозка";
		СтруктураОписанияКолонки.ИмяПоляКомпоновки	= "Наименование";
		СтруктураОписанияКолонки.КонтрольЗаполнения	= Истина;
		СтруктураОписанияКолонки.ТипЗначения		= Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки");
		
		УстановитьОписаниеКолонки(СтруктураОписанияКолонки); 
		
		ТаблицаЗначений.Колонки.Добавить("Грузоперевозка", Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки"), "Грузоперевозка"); 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЭтоСсылочныйТип(Знач ТипЗначенияРеквизита)
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗначенияРеквизита)
		ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(ТипЗначенияРеквизита) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТабицуДанных(Знач СоответствиеИменКолонок, ТаблицаЗначений)
	                
	ТабОписаниеКолонок =  ОписаниеКолонок.Выгрузить();
	
	НомерСтроки = 0;
	Для Верх = 3 по ТабличныйДокумент.ВысотаТаблицы Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.СтрокаМакета 	= Верх;    
		НоваяСтрока.НомерСтроки 	= НомерСтроки;    
		
		Для Лево = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл 
			
			ЗначениеТекст = ТабличныйДокумент.Область(Верх, Лево).Текст;  
			
			ИмяКолнки = СоответствиеИменКолонок.Получить(Лево);
			Если ИмяКолнки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаОписания = ТабОписаниеКолонок.Найти(ИмяКолнки, "ИмяКолонки"); 
			
			//преобразование примитивных типов
			ПустаяСсылка = СтрокаОписания.ТипЗначения.ПривестиЗначение(Неопределено);   
			Если ТипЗнч(ПустаяСсылка) = Тип("Дата") Тогда       
				ЗначениеЯчейки = ОбщегоНазначенияКлиентСервер.СтрокаВДату(ЗначениеТекст);  
			ИначеЕсли ТипЗнч(ПустаяСсылка) = Тип("Число") Тогда  
				Попытка
					ЗначениеЯчейки = Число(ЗначениеТекст); 
				Исключение       
					ЗначениеЯчейки = 0;
				КонецПопытки;
			ИначеЕсли ТипЗнч(ПустаяСсылка) = Тип("Булево") Тогда
				Если ВРЕГ(ЗначениеТекст) = "ДА" или ВРЕГ(ЗначениеТекст) = "YES" Тогда
					ЗначениеЯчейки = Истина;
				Иначе
					ЗначениеЯчейки = ЛожЬ;
				КонецЕсли; 
			Иначе   
				ЗначениеЯчейки = ЗначениеТекст   
			КонецЕсли;  
			//преобразование примитивных типов
		
			
			НоваяСтрока[ИмяКолнки] = ЗначениеЯчейки;  
	
			//Обработаем ссылочные типы 
			Если СтрокаОписания.ЕстьСсылочныйТип и ИмяКолнки <> "ЗначениеГрузоперевозка" Тогда 
				
				Если СтрНачинаетсяС(ИмяКолнки, "Параметр") Тогда
					ИмяКолнкиЗначения = СтрЗаменить(ИмяКолнки, "Параметр", "Ссылка");
				Иначе
					ИмяКолнкиЗначения = СтрЗаменить(ИмяКолнки, "Значение", ""); 
				КонеЦЕсли; 
				
				СтрокаОписанияЗначения 	= ТабОписаниеКолонок.Найти(ИмяКолнкиЗначения, "ИмяКолонки"); 
				Если СтрокаОписанияЗначения <> Неопределено Тогда  
					НоваяСтрока[ИмяКолнкиЗначения] = ПолучитьЗначениеСинхронизации(ЗначениеТекст, СтрокаОписанияЗначения);
				КонецЕсли;
				
			КонецЕсли;  
			//Обработаем ссылочные типы 
			
		КонецЦикла;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРеквизитыФормы(Знач ТаблицаЗначений)   
	
	ТабОписаниеКолонок = ОписаниеКолонок.Выгрузить();  
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Колонка из ТаблицаЗначений.Колонки Цикл   
		СтрокаОписания = ТабОписаниеКолонок.Найти(Колонка.Имя, "ИмяКолонки");
		Если СтрокаОписания <> Неопределено Тогда
			
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения,"ТаблицаСоответствий", СтрокаОписания.Заголовок));
			Если СтрокаОписания.УказанПутьКДаннымПодвала Тогда
				ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(СтрокаОписания.ПутьКДаннымПодвала, Колонка.ТипЗначения));
			КонецЕсли;
			
		Конецесли;
	КонецЦикла; 
	
	УдалаемыеРеквизиты 	= Новый Массив;
	КолонкиТаблицы = ЭтаФорма.ПолучитьРеквизиты("ТаблицаСоответствий");
	
	ВсеИменаРеквизитовФормы = Новый Массив;
	РеквизитыФормы = ПолучитьРеквизиты();   
	Для Каждого РеквизитФормы из РеквизитыФормы Цикл
		ВсеИменаРеквизитовФормы.Добавить(РеквизитФормы.Имя);
	КонецЦикла;
	
	Для Каждого Реквизит из КолонкиТаблицы Цикл   
		Если Реквизит.Имя = "ФлагПодобрано" 
			или Реквизит.Имя = "СтрокаМакета" 
			или Реквизит.Имя = "НомерСтроки" Тогда 
			Продолжить;
		КонецЕсли;
		
		УдалаемыеРеквизиты.Добавить("ТаблицаСоответствий."+Реквизит.Имя); 
		
		Если ВсеИменаРеквизитовФормы.Найти("Итог"+Реквизит.Имя) <> Неопределено Тогда
			УдалаемыеРеквизиты.Добавить("Итог"+Реквизит.Имя); 
		КонецЕсли;
	КонецЦикла; 
	     
	ИзменитьРеквизиты(Добавляемыереквизиты, УдалаемыеРеквизиты); 

КонецПроцедуры

&НаСервере
Процедура УстановитьОписаниеКолонки(ПараметрыКолонки)
	
	СтрокаОписания = ОписаниеКолонок.Добавить(); 
	СтрокаОписания.ИмяКолонки 				= ПараметрыКолонки.ИмяКолонки;
	СтрокаОписания.Заголовок 				= ПараметрыКолонки.Заголовок; 
	СтрокаОписания.ТипЗначения 				= ПараметрыКолонки.ТипЗначения;
	СтрокаОписания.Действие   				= ПараметрыКолонки.Действие;
	СтрокаОписания.ТолькоПросмотр 			= ПараметрыКолонки.ТолькоПросмотр;   
	СтрокаОписания.ПутьКДаннымПодвала 		= ПараметрыКолонки.ПутьКДаннымПодвала;   
	СтрокаОписания.УказанПутьКДаннымПодвала = ПараметрыКолонки.УказанПутьКДаннымПодвала;   

	СтрокаОписания.ИмяГруппы 				= ПараметрыКолонки.ИмяГруппы;   
	СтрокаОписания.ЗаголовокГруппы			= ПараметрыКолонки.ЗаголовокГруппы;   
	СтрокаОписания.ОтображатьВШапкеГруппу	= ПараметрыКолонки.ОтображатьВШапкеГруппу;   

	СтрокаОписания.КонтрольЗаполнения	= ПараметрыКолонки.КонтрольЗаполнения; 
	
	СтрокаОписания.ОтборПоЗначению		= ПараметрыКолонки.ОтборПоЗначению;
   	СтрокаОписания.ИмяПоляКомпоновки	= ПараметрыКолонки.ИмяПоляКомпоновки;
   	СтрокаОписания.ИмяПоля				= ПараметрыКолонки.ИмяПоля;

	СтрокаОписания.Параметр				= ПараметрыКолонки.Параметр;

	СтрокаОписания.ОтображатьВШапке     = ПараметрыКолонки.ОтображатьВШапке; 
	
	СтрокаОписания.ЕстьСсылочныйТип    	= ПараметрыКолонки.ЕстьСсылочныйТип;
      
КонецПроцедуры    

&НаСервере
Функция ПолучитьСтруктуруОписанияКолонки()
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяКолонки", 				"");
	Структура.Вставить("Заголовок", 				"");  
	Структура.Вставить("ТипЗначения", 				Новый ОписаниеТипов("Строка"));  
	Структура.Вставить("Действие", 					"");  
	Структура.Вставить("ТолькоПросмотр", 			Истина); 
	Структура.Вставить("ПутьКДаннымПодвала", 		"");  
	Структура.Вставить("УказанПутьКДаннымПодвала", 	Ложь);  
	
	Структура.Вставить("ИмяГруппы", 				"");  
	Структура.Вставить("ЗаголовокГруппы",			"");  
	Структура.Вставить("ОтображатьВШапкеГруппу",	Ложь);  
	
	Структура.Вставить("КонтрольЗаполнения",Ложь); 
	
	Структура.Вставить("ОтборПоЗначению",	Ложь);  
	Структура.Вставить("ИмяПоля", 			"");
	Структура.Вставить("ИмяПоляКомпоновки",	"");  

	Структура.Вставить("Параметр",			Неопределено);  
	Структура.Вставить("ОтображатьВШапке",	Истина);  

	Структура.Вставить("ЕстьСсылочныйТип",	Ложь);  
	
    Возврат Структура;
	
КонецФункции

&НаСервере
Процедура УстановитьФлагПодобрано()
	
	мСтроки = ОписаниеКолонок.НайтиСтроки(Новый Структура("КонтрольЗаполнения", Истина));
	
	Для Каждого СтрокаТаблицы из ТаблицаСоответствий Цикл 
		ЗначенияПодобраны = Ложь;
		Для Каждого СтрокаОисания из мСтроки Цикл  
			ЗначенияПодобраны = ЗначениеЗаполнено(СтрокаТаблицы[СтрокаОисания.ИмяКолонки]);
			Если не ЗначенияПодобраны Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		СтрокаТаблицы.ФлагПодобрано = ЗначенияПодобраны;
	КонецЦикла;
	
	УстановитьДоступностьКомандыВДокумент();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКомандыВДокумент()
	
	мНеПодобрано = ТаблицаСоответствий.НайтиСтроки(Новый Структура("ФлагПодобрано",Ложь));
	Элементы.КомандаДалееШаг3.Доступность = мНеПодобрано.Количество() = 0 или ПропускатьНеподобранныеСтроки;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствийПриИзменении(Элемент)
	
	УстановитьФлагПодобрано(); 
	УстановитьИтогиПоКолонкам();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьГрузоперевозкуПоОтбору(ОтборКомпоновкиДанных)
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	СхемаКомпоновкиДанных = ТОбъект.ПолучитьМакет("МакетОтбораГрузоперевозок");
	
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	_УФС.СкопироватьОтбор(ОтборКомпоновкиДанных, Настройки.Отбор);
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	Результат = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Если Результат.Количество() = 0 или Результат.Количество() > 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаТаблицы = Результат[0];
	Возврат СтрокаТаблицы.Ссылка;
	
КонецФункции
//Таблица соответстий  

&НаСервере
Процедура ПолучитьАдресТаблицыДокумента()  

	ВремТаблицаСоответствий = ТаблицаСоответствий.Выгрузить();
	КолонкаНоменклатура 	= ВремТаблицаСоответствий.Колонки.Найти("Номенклатура");
	
	МассивНоменклатуры = Новый Массив;
	Если КолонкаНоменклатура <> Неопределено Тогда
		МассивНоменклатуры = ТаблицаСоответствий.Выгрузить().ВыгрузитьКолонку("Номенклатура"); 
	КонецЕсли;
	СоответствияСтатейЗатрат = ПолучитьСоответствияСтатейЗатрат(МассивНоменклатуры);

	ТаблицаДокумента = ПолучитьТаблицуДокумента();  
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Номенклатура");  
	МассивРеквизитов.Добавить("ПорядокОтражения"); 
	Если НЕ ЗаполнятьСтавкуНДСИзНоменклатуры Тогда
		МассивРеквизитов.Добавить("СтавкаНДС");       
	КонецЕсли;
	МассивРеквизитов.Добавить("Количество");  
	Если ПоказатьСпособУчетаНДС Тогда
		МассивРеквизитов.Добавить("СпособУчетаНДС");
	КонецЕсли;
	Если ГруппировкаЗатратПоПодразделениям Тогда
		МассивРеквизитов.Добавить("Подразделение");  
	КонецЕсли;    
	
	СтруктураОтбора = Новый Структура("ФлагПодобрано", Истина);
	мПодобранныеСтроки = ТаблицаСоответствий.НайтиСтроки(СтруктураОтбора);

	Для Каждого СтрокаТабицы из мПодобранныеСтроки Цикл
		
		НоваяСтрока = ТаблицаДокумента.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабицы); 
		УстановитьЗначенияПоУмолчанию(НоваяСтрока, МассивРеквизитов);  
		
		СтатьяЗатрат = СоответствияСтатейЗатрат.Получить(НоваяСтрока.Номенклатура); 
		Если СтатьяЗатрат = Неопределено Тогда
			СтатьяЗатрат = ОсновнаяСтатьяЗатрат;
		КонецЕсли;
		
		НоваяСтрока.СтатьяЗатрат  = СтатьяЗатрат;
		
		Если ЗаполнятьСтавкуНДСИзНоменклатуры Тогда
			СтавкаНДСНоменклаутры =  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(НоваяСтрока.Номенклатура, ТекущаяДата());
			НоваяСтрока.СтавкаНДС = СтавкаНДСНоменклаутры;	
		КонецЕсли;
		
		Если ВариантПересчетаСуммы = 1 Тогда 
			ПереситатьДанныеСтрокиПоПервомуВарианту(НоваяСтрока); 
		ИначеЕсли  ВариантПересчетаСуммы = 2 Тогда 
			ПереситатьДанныеСтрокиПоВторомуВарианту(НоваяСтрока); 
		КонецЕсли; 
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТабицы, "ЗначениеНоменклатура") Тогда
			РегистрыСведений.CW_СоответствияНоменклатурыПоставщиков.ЗаписатьСоответствиеНоменклатуры(Контрагент, СтрокаТабицы["ЗначениеНоменклатура"], СтрокаТабицы["Номенклатура"]);
		КонецЕсли;   
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаДокумента, АдресТаблицыДокумента);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСоответствияСтатейЗатрат(МассивНоменклатуры)
	
	Соответствие = новый Соответствие;   
	
	Если МассивНоменклатуры.Количество() = 0 Тогда
		Возврат Соответствие;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_СтатьиЗатратНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры
	               |ГДЕ
	               |	CW_СтатьиЗатратНоменклатуры.Номенклатура В(&МассивНоменклатуры)";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Номенклатура, Выборка.СтатьяЗатрат);	
	КонецЦикла;  
	
    Возврат Соответствие;
	
КонецФункции


&НаСервере
Процедура ПереситатьДанныеСтрокиПоПервомуВарианту(НоваяСтрока)
	
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС)/100; 
	
	НоваяСтрока.НДС 	= НоваяСтрока.Всего*Ставка/(1+Ставка);
	НоваяСтрока.Сумма 	= НоваяСтрока.Всего - НоваяСтрока.НДС;
	НоваяСтрока.Цена 	= ?(НоваяСтрока.Количество = 0, 0, НоваяСтрока.Сумма / НоваяСтрока.Количество);  
	
КонецПроцедуры 

&НаСервере
Процедура ПереситатьДанныеСтрокиПоВторомуВарианту(НоваяСтрока)
	
	ЗначениеСтавкиНДС  = CW_Финансы.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС);
	
	Если ДанныеДокумента.ЦенаСНДС Тогда
		РасчетнаяСтавкаНДС 	= (ЗначениеСтавкиНДС +?(ДанныеДокумента.ЦенаСНДС,100,0))/100;
		ЦенаБезНДС 			= НоваяСтрока.Цена / РасчетнаяСтавкаНДС;
	Иначе
		ЦенаБезНДС 			= НоваяСтрока.Цена;
	КонецЕсли;
	
	НоваяСтрока.Сумма 	= ЦенаБезНДС * НоваяСтрока.Количество;
	НоваяСтрока.НДС		= Окр(НоваяСтрока.Сумма	* ЗначениеСтавкиНДС/100,2,1);
	НоваяСтрока.Всего 	= НоваяСтрока.Сумма + НоваяСтрока.НДС;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию(НоваяСтрока, Знач МассивРеквизитов)
	
	Для Каждого ИмяРеквизита из МассивРеквизитов Цикл
		Если Не ЗначениеЗаполнено(НоваяСтрока[ИмяРеквизита]) Тогда
			НоваяСтрока[ИмяРеквизита] = ЭтаФорма[ИмяРеквизита];
		КонецЕсли;                                       
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуДокумента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	|	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,
	|	CW_РасходыПоГрузоперевозкеУслуги.Номенклатура КАК Номенклатура,
 	|	CW_РасходыПоГрузоперевозкеУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
 	|	CW_РасходыПоГрузоперевозкеУслуги.Представление КАК Представление,
	|	CW_РасходыПоГрузоперевозкеУслуги.ПорядокОтражения КАК ПорядокОтражения,
	|	CW_РасходыПоГрузоперевозкеУслуги.СпособУчетаНДС КАК СпособУчетаНДС,
	|	CW_РасходыПоГрузоперевозкеУслуги.ПрочиеРасходы КАК ПрочиеРасходы,
	|	CW_РасходыПоГрузоперевозкеУслуги.Подразделение КАК Подразделение,
	|	CW_РасходыПоГрузоперевозкеУслуги.Количество КАК Количество,
	|	CW_РасходыПоГрузоперевозкеУслуги.Цена КАК Цена,
	|	CW_РасходыПоГрузоперевозкеУслуги.Сумма КАК Сумма,
	|	CW_РасходыПоГрузоперевозкеУслуги.СтавкаНДС КАК СтавкаНДС,
	|	CW_РасходыПоГрузоперевозкеУслуги.НДС КАК НДС,
	|	CW_РасходыПоГрузоперевозкеУслуги.Всего КАК Всего
	|ИЗ
	|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги"; 
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции


&НаКлиенте
Процедура ЗаполнитьЗначенияКолонки(Команда) 

	ВыделенныеСтроки 	= Элементы.ТаблицаСоответствий.ВыделенныеСтроки;
	ОписаниеКолонки 	= ПолучитьДанныеКолонки();   
	Если ОписаниеКолонки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОписаниеКолонки", 	ОписаниеКолонки);
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", 	ВыделенныеСтроки);
	
	ОписаниеОпвещения = Новый ОписаниеОповещения("ЗавершитьВыборЭлемента", ЭтотОбъект, ДополнительныеПараметры);  
	
    СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимВыбора", 		Истина);
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", 	Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", 	Ложь);
	
	ОткрытьФорму(ОписаниеКолонки.ИмяСправочника+".ФормаВыбора", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОпвещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗавершитьВыборЭлемента(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыборЭлементаНаСервере(РезультатВыбора, ДополнительныеПараметры);
	
КонецПроцедуры    

&НаСервере
Процедура ОбработатьВыборЭлементаНаСервере(ВыбранноеЗначение, ДополнительныеПараметры)
	
	Для Каждого ИдентификаторСтроки из ДополнительныеПараметры.ВыделенныеСтроки Цикл
		СтрокаТекущая = ТаблицаСоответствий.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаТекущая[ДополнительныеПараметры.ОписаниеКолонки.Имя]  = ВыбранноеЗначение;
	КонецЦикла; 
	
	УстановитьФлагПодобрано();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеКолонки() 
	
	ПутьКданным 	= Элементы.ТаблицаСоответствий.ТекущийЭлемент.ПутьКДанным;
	мДанныеПоля 	= СтрРазделить(ПутьКданным, ".");   
	ИмяПоля 		= мДанныеПоля[1];
	НайденныеСтроки = ОписаниеКолонок.НайтиСтроки(Новый Структура("ИмяКолонки", ИмяПоля));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденнаяСтрока = НайденныеСтроки[0];
	Если НайденнаяСтрока.ТолькоПросмотр Тогда
		Возврат Неопределено;
	КонецЕсли;    
	
	ТипЗначенияКолонки = НайденнаяСтрока.ТипЗначения.Типы()[0];   

	ОписаниеТипаВсеСсылки = ОбщегоНазначения.ОписаниеТипаВсеСсылки();
	Если Не ОписаниеТипаВсеСсылки.СодержитТип(ТипЗначенияКолонки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПолноеИмяСправочника = Метаданные.НайтиПоТипу(ТипЗначенияКолонки).ПолноеИмя();
	
	ОписаниеКолонки = Новый Структура;
	ОписаниеКолонки.Вставить("Имя", 			ИмяПоля);
	ОписаниеКолонки.Вставить("ТипЗначения", 	НайденнаяСтрока.ТипЗначения);
	ОписаниеКолонки.Вставить("ИмяСправочника", 	ПолноеИмяСправочника);
	
	Возврат ОписаниеКолонки
	
КонецФункции    

&НаСервере
Процедура ПропускатьНеПодобранныеСтрокиПриИзмененииНаСервере()
	УстановитьДоступностьКомандыВДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПропускатьНеПодобранныеСтрокиПриИзменении(Элемент)
	ПропускатьНеПодобранныеСтрокиПриИзмененииНаСервере();
КонецПроцедуры    

&НаКлиенте
Процедура СинхронизацияПоРегиструНоменклатураПоставщиков(Команда) 
	
	ВыделенныеСтроки = Элементы.ТаблицаСоответствий.ВыделенныеСтроки;
	СинхронизацияПоРегиструНоменклатураПоставщиковНаСервере(ВыделенныеСтроки);  
	
КонецПроцедуры

&НаСервере
Процедура СинхронизацияПоРегиструНоменклатураПоставщиковНаСервере(ВыделенныеСтроки) 
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПерваяСтрока = ТаблицаСоответствий.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
	Если Не (ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПерваяСтрока, "Номенклатура")
		и ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПерваяСтрока, "ЗначениеНоменклатура"))Тогда
		Возврат; //нет колонки номенклатура или НоменклатураЗначение!
	КонецЕсли;
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = ТаблицаСоответствий.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаТаблицы.Номенклатура = ПолучитьЗначениеДляНоменклатурыПоставщика(СтрокаТаблицы.ЗначениеНоменклатура);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияПоРегиструКомандаПравилаЗаменыНоменклатуры(Команда)
	ВыделенныеСтроки = Элементы.ТаблицаСоответствий.ВыделенныеСтроки;
	СинхронизацияПоРегиструКомандаПравилаЗаменыНоменклатурыНаСервере(ВыделенныеСтроки);
КонецПроцедуры

&НаСервере
Процедура СинхронизацияПоРегиструКомандаПравилаЗаменыНоменклатурыНаСервере(ВыделенныеСтроки)
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПерваяСтрока = ТаблицаСоответствий.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
	Если Не (ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПерваяСтрока, "Номенклатура")
		и ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПерваяСтрока, "ЗначениеНоменклатура")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПерваяСтрока, "Грузоперевозка"))Тогда
		Возврат; //нет колонки номенклатура или НоменклатураЗначение!
	КонецЕсли; 
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = ТаблицаСоответствий.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Не (ЗначениеЗаполнено(СтрокаТаблицы.Грузоперевозка) 
			и ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура)) Тогда
			Продолжить;
		КонецЕсли; 
		
		ЗначениеЗамены = ПолучитьЗначениеЗаменыДляНоменклатуры(СтрокаТаблицы.Номенклатура, СтрокаТаблицы.Грузоперевозка); 
		Если ЗначениеЗаполнено(ЗначениеЗамены) Тогда
			СтрокаТаблицы.Номенклатура = ЗначениеЗамены;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеСинхронизации(Знач ЗначениеТекст, Знач СтрокаОписанияЗначения)
	
	ПустаяСсылка = СтрокаОписанияЗначения.ТипЗначения.ПривестиЗначение();   
	
	Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(ПустаяСсылка)) Тогда 
		СтрЗначениеПеречисления = СтрЗаменить(ЗначениеТекст, " ", "");
		
		МетаданныеПеречисления 	= ПустаяСсылка.Метаданные();
		ИмяОбъекта			 	= МетаданныеПеречисления.Имя; 
		
		мдЗначениеПеречисления 	= МетаданныеПеречисления.ЗначенияПеречисления.Найти(СокрЛП(СтрЗначениеПеречисления)); 
		Если мдЗначениеПеречисления <> Неопределено Тогда
			ПолученноеЗначение = ПредопределенноеЗначение("Перечисление."+ИмяОбъекта+"."+СокрЛП(СтрЗначениеПеречисления)); 
		КонецЕсли;
		
	Иначе   
		
		Если ТипЗнч(ПустаяСсылка) = Тип("СправочникСсылка.Номенклатура") Тогда
			ПолученноеЗначение = ПолучитьЗначениеДляНоменклатурыПоставщика(ЗначениеТекст); 
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПолученноеЗначение) Тогда
			Менеджер			= ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПустаяСсылка); 
			ПолученноеЗначение	= Менеджер.НайтиПоНаименованию(СокрЛП(ЗначениеТекст), Истина); 
		КонецЕсли;
		
	Конецесли;                  
	
	Возврат ПолученноеЗначение;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеДляНоменклатурыПоставщика(Знач ЗначениеТекст)
	
	Если ПустаяСтрока(ЗначениеТекст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РегистрыСведений.CW_СоответствияНоменклатурыПоставщиков.ПолучитьСоответствиеНоменклатуры(Контрагент, СокрЛП(ЗначениеТекст));

КонецФункции

&НаСервере
Функция ПолучитьЗначениеЗаменыДляНоменклатуры(Знач Номенклатура, Знач Грузоперевозка) 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ПравилаЗаменыНоменклатурыКонтрагентов.НоменклатураЗамены КАК НоменклатураЗамены,
	|	CW_ПравилаЗаменыНоменклатурыКонтрагентов.НоменклатураЗаменыПоУсловию КАК НоменклатураЗаменыПоУсловию,
	|	CW_ПравилаЗаменыНоменклатурыКонтрагентов.ПараметрДляПроверкиЗаменыПоУсловию КАК ПараметрДляПроверкиЗаменыПоУсловию
	|ИЗ
	|	РегистрСведений.CW_ПравилаЗаменыНоменклатурыКонтрагентов КАК CW_ПравилаЗаменыНоменклатурыКонтрагентов
	|ГДЕ
	|	CW_ПравилаЗаменыНоменклатурыКонтрагентов.Контрагент = &Контрагент
	|	И CW_ПравилаЗаменыНоменклатурыКонтрагентов.Номенклатура = &Номенклатура
	|	И CW_ПравилаЗаменыНоменклатурыКонтрагентов.ТипПеревозки = &ТипПеревозки";
	
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	Запрос.УстановитьПараметр("ТипПеревозки", 	Грузоперевозка.ТипПеревозки);  
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий(); //Запись всегда одна
	
	Если Не ЗначениеЗаполнено(Выборка.ПараметрДляПроверкиЗаменыПоУсловию) Тогда
		Возврат Выборка.НоменклатураЗамены;
	КонецЕсли;
	
	//Указан параметр условия
	СтрокаПараметров = Грузоперевозка.ПараметрыГрузоперевозки.Найти(Выборка.ПараметрДляПроверкиЗаменыПоУсловию, "Параметр");
	Если СтрокаПараметров = Неопределено Тогда
		Если ЗначениеЗаполнено(Грузоперевозка.Заказ) Тогда
			СтрокаПараметров = Грузоперевозка.Заказ.ПараметрыЗаказа.Найти(Выборка.ПараметрДляПроверкиЗаменыПоУсловию, "Параметр");
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаПараметров = Неопределено Тогда
		Возврат Выборка.НоменклатураЗамены;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаПараметров.Значение) = Тип("Булево")
		И СтрокаПараметров.Значение Тогда
		Возврат Выборка.НоменклатураЗаменыПоУсловию;
	КонецЕсли;   
	
	Возврат Выборка.НоменклатураЗамены;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнятьСтавкуНДСИзНоменклатурыПриИзменении(Элемент)
	
	Если ЗаполнятьСтавкуНДСИзНоменклатуры Тогда
		СтавкаНДС = Неопределено;                  
	КонецЕсли; 
	
	Элементы.СтавкаНДС.Доступность = НЕ ЗаполнятьСтавкуНДСИзНоменклатуры;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьКолонкиТаблицы(Команда)
	
	СопоставитьКолонкиТаблицыНаСервере();

КонецПроцедуры  

&НаСервере
Процедура СопоставитьКолонкиТаблицыНаСервере()  
	
	Обработки.CW_ЗагрузкаТабличнойЧастиДокументаРасходыПоГрузоперевозкеИзФайла.СопоставитьКолонкиТаблицы(ТабличныйДокумент);
	Обработки.CW_ЗагрузкаТабличнойЧастиДокументаРасходыПоГрузоперевозкеИзФайла.РассчитатьШиринуКолонокТабличногоДокумента(ТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
ФункциЯ ПолучитьДоступныеДействия()
	
	Возврат Обработки.CW_ЗагрузкаТабличнойЧастиДокументаРасходыПоГрузоперевозкеИзФайла.ПолучитьДоступныеДействия();
	
КонецФункции

&НаКлиенте
Процедура ТаблицаСоответствийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура УстановитьИтогиПоКолонкам()
	
	ОтборОписанияКолонок = Новый Структура;
	ОтборОписанияКолонок.Вставить("УказанПутьКДаннымПодвала", истина);   
	
	НайденныеСтроки = ОписаниеКолонок.НайтиСтроки(ОтборОписанияКолонок);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ОторВключен = РежимПоказать <> "Все";
	
	Если ОторВключен Тогда  
		Подобрано = (РежимПоказать = "Синхронизированные");
		ОтборСтрок = Новый Структура("ФлагПодобрано", Подобрано);  
		
		ВремТаблицаСоответствий = ТаблицаСоответствий.Выгрузить().Скопировать(ОтборСтрок);;
	Иначе
		ВремТаблицаСоответствий = ТаблицаСоответствий.Выгрузить();
	КонецЕсли;
	
	Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл  
		ЭтаФорма[НайденнаяСтрока.ПутьКДаннымПодвала] = ВремТаблицаСоответствий.Итог(НайденнаяСтрока.ИмяКолонки);
	КонецЦикла;  
	
	КоличествоСтрок = "Строк: "+ Формат(ВремТаблицаСоответствий.Количество(), "ЧДЦ=0; ЧН=-");
	
КонецПроцедуры

