&НаКлиенте
Перем ПараметрТекущиейСтрокиДерева;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	// ---------------------------------------------------------------------------- 
	
	Параметры.Свойство("НеРассчитыватьСтатусыПриЗаписи", НеРассчитыватьСтатусыПриЗаписи);
	
	Если (Объект.ГруппыПараметровЗаявки.Количество()=0) Тогда
		
		НастоящийОбъект = РеквизитФормыВЗначение("Объект");
		НастоящийОбъект.ПроверитьИерархиюПараметров();
		ЗначениеВРеквизитФормы(НастоящийОбъект,"Объект");
		
	КонецЕсли; 
	
	Если Параметры.Ключ.Пустая() Тогда
		
		//Времено на переходный период
		//Для новых объектов уже используется новый механизм хранения данных
		СлужебныйВыполненПереход = Истина;
		//Времено на переходный период
		
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;   
	
	Пользователь						= CW_Настройки.Пользователь();
	НастройкиПользователя 				= CW_Настройки.ПолучитьНастройкиПользователя(Пользователь);
 	КонтролироватьПросрочкуПлановыхДат 	= НастройкиПользователя.КонтролироватьПросрочкуПлановыхДат;

	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("CW_Пользователь", 		ПараметрыСеанса.ТекущийПользователь);  
	СтруктураПараметров.Вставить("CW_ГруппаПользователя", 	ГруппаПользователя);
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураПараметров);
	
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("CW_Пользователь", ПараметрыСеанса.ТекущийПользователь);  
	
	Элементы.СписокЗаказыФайлы.Видимость = ПолучитьФункциональнуюОпцию("CW_ОтображатьКолонкуФайлыВСпискеЗаказы", СтруктураПараметров);
	
	ПоказыватьПриложениеВБюджете = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам") 
									И ПолучитьФункциональнуюОпцию("CW_УказыватьДоговорДляПлановыхСтатейБюджета");
									
	Элементы.БюджетДоходыПриложениеКДоговору.Видимость = ПоказыватьПриложениеВБюджете;
	Элементы.БюджетРасходыПриложениеКДоговору.Видимость = ПоказыватьПриложениеВБюджете;
	
	// кэшируем свойства параметров
	_ОбновитьСвойстваПапаметров();
	// ---
	Если (НЕ ЗначениеЗаполнено(Объект.ДатаОбращения)) Тогда
		Объект.ДатаОбращения = ТекущаяДата();		
	КонецЕсли; 
	
	// --- 
	
	Если (НЕ Параметры.ЗначениеКопирования.Пустая()) Тогда
		
		ОбъектКопирования = Параметры.ЗначениеКопирования;
		РежимКопирования = Истина;
		// --- 
		// проверяем, что у объекта копирования есть бюджеты
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ВариантыБюджетовПоЗаявкам.Ссылка
		|ИЗ
		|	Справочник.CW_ВариантыБюджетовПоЗаявкам КАК CW_ВариантыБюджетовПоЗаявкам
		|ГДЕ
		|	CW_ВариантыБюджетовПоЗаявкам.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец", ОбъектКопирования);
		ТЗ = Запрос.Выполнить().Выгрузить();
		// --- 
		Варианты = ТЗ.ВыгрузитьКолонку("Ссылка");
		
		// --- 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка
		               |ИЗ
		               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
		               |ГДЕ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец В(&Владельцы)";
		СписокВладельцев = Новый СписокЗначений;
		СписокВладельцев.ЗагрузитьЗначения(Варианты);
		Запрос.УстановитьПараметр("Владельцы", СписокВладельцев);
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если (ТЗ.Количество() = 0) Тогда
			
			РежимКопирования = Ложь;
			
		КонецЕсли; 
		 
		
	КонецЕсли;
	
	// --- 
	
	ВРУ = CW_Настройки.ВалютаРегламентированногоУчета();
	// --- 
	Элементы.Маршрут.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМаршрутов");
	Элементы.Груз.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеГрузов");
	// --- 
	Элементы.СтраницаБюджет.Видимость =  ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования") и CW_ПраваДоступа.ПравоДоступно("ПросмотрБюджетов");
	Элементы.ВыводитьАрхивные1.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов");  

	// --- 
	БюджетТекущаяВерсия = Справочники.CW_ВерсииБюджетов.Основная;
	// --- 
	Если (НЕ Объект.Ссылка.Пустая()) Тогда
		
		_ОтборСобытий(); 
		
	КонецЕсли; 
	
	Элементы.БюджетРасходыСуммаРуб.Заголовок 		= "Сумма, "+?(ЗначениеЗаполнено(ВРУ),СокрЛП(ВРУ), "-");
	Элементы.БюджетРасходыСуммаВсегоРуб.Заголовок	= "Всего, "+?(ЗначениеЗаполнено(ВРУ),СокрЛП(ВРУ), "-");
	Элементы.БюджетДоходыСуммаРуб.Заголовок			= "Сумма, "+?(ЗначениеЗаполнено(ВРУ),СокрЛП(ВРУ), "-");
	Элементы.БюджетДоходыСуммаВсегоРуб.Заголовок	= "Всего, "+?(ЗначениеЗаполнено(ВРУ),СокрЛП(ВРУ), "-");

	// --- 
	_УправлениеЭлементамиФормы();
	// --- 
	
	// определяем количество грузоперевозок
	Если (НЕ ГрузоперевозкиИнициализированы ) Тогда
		_УстановитьЗаголовокСтраницыГрузоперевозок();
	КонецЕсли;  
	
	Если Параметры.Ключ.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.ТипПеревозки) Тогда
			_УФС.ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(Объект, Объект.ТипПеревозки, "ДляЗаявки");
		КонецЕсли;
	КонецЕсли;

	//Список заказов
	УстановитьОтборЗаказов();
	УстановитьЗаголовокЗакладкиЗаказы();
	//Список заказов
	
	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов
	
	//Подсистема.ЛогистическиеСтатусы
	Если ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыЗаявок") Тогда
		CW_ЛогистическиеСтатусыСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	//Подсистема.ЛогистическиеСтатусы
	
	ИспользуютсяФинансовыеСтатусы 			= ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок");
	ИспользованиеФинансовыхСтатусовЗаказов 	= ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыЗаказов");

	Элементы.СписокЗаказыЛогистическийСтатусКартинка.Видимость 	= Не НастройкиПользователя.СкрыватьКартинкиСтатусовВЖурналах и ИспользуютсяФинансовыеСтатусы;
	Элементы.СписокЗаказыФинансовыйСтатусКартинка.Видимость 	= Не НастройкиПользователя.СкрыватьКартинкиФинансовыхСтатусовВЖурналах и ИспользованиеФинансовыхСтатусовЗаказов;
	//ПрогнозОплаты
	ИспользуетсяПрогнозированиеДДСПоБюджету = ПолучитьФункциональнуюОпцию("CW_ИспользуетсяПрогнозированиеДДСПоБюджету");
	//ПрогнозОплаты
	
	//РаботаСАрхивомОбъектов
	УстановитьПараметрыДинамическогОСписка();
	CW_АрхивОбъектовСервер.ПриСозданииНаСервере(ЭтаФорма);
	//РаботаСАрхивомОбъектов
	
	_Заголовок();          
	
	УстановитьЦветФонаСрокаДеййствияНаСервере();   
	
	УстаноитьВидимостьСтраниц();    
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ВариантБюджета = ТекущийОбъект.ВариантБюджета;

	//ХранениеПолногоЗначения
	Для Каждого СтрокаОбъекта из ТекущийОбъект.ПараметрыЗаявки Цикл
		ДобавитьСохраняемоеПолноеЗначение(СтрокаОбъекта.Параметр, СтрокаОбъекта.ХранилищеДанных.Получить());
	КонецЦикла;
	//---ХранениеПолногоЗначения
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		Если ГрузоперевозкиИнициализированы Тогда
			ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/СохранитьСеансовыеНастройки","ПоследняяНастройкаЗаявки"));	
		КонецЕсли;                    
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстаноитьВидимостьСтраниц()
	
	Элементы.СтраницаБюджет.Видимость = Не Объект.Ссылка.Пустая();
	Элементы.СтраницаЗаказы.Видимость = Не Объект.Ссылка.Пустая();
	Элементы.СтраницаЖурналГрузоперевозок.Видимость = Не Объект.Ссылка.Пустая();

КонецПроцедуры  

&НаСервере
Процедура УстановитьЦветФонаСрокаДеййствияНаСервере() 
	
	СрокДействия = Объект.ВариантБюджета.СрокДействия;	
	
	Если Не ЗначениеЗаполнено(СрокДействия) или СрокДействия >= НачалоДня(ТекущаяДата()) Тогда 
		Элементы.ГруппаСрокДействияВариантаБюджета.ЦветФона = Новый Цвет();	
	Иначе
		Элементы.ГруппаСрокДействияВариантаБюджета.ЦветФона = Новый Цвет(255,160,122);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборЗаказов()
	
	СписокЗаказы.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = СписокЗаказы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Заявка");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка);;
	ЭлементОтбора.Использование 	= Истина;
	
	УстановитьОтборПоГруппеПользователя();
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьСвойстваПапаметров()
	// --- 
	
	КартаПравПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	АдресКартыПравПараметров = ПоместитьВоВременноеХранилище(КартаПравПараметров, ЭтаФорма.УникальныйИдентификатор);
	// --- 
	КартаСвойствПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
	АдресКартыСвойствПараметров = ПоместитьВоВременноеХранилище(КартаСвойствПараметров, ЭтаФорма.УникальныйИдентификатор);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Если (РежимКопирования) Тогда
	//	
	//	Отказ = Истина;
	//	// --- 
	//	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаКопированияБюджета",ЭтотОбъект, Новый Структура()); 
	//	ПФ = Новый Структура("ОбъектКопирования,УИД",ОбъектКопирования,ЭтаФорма.УникальныйИдентификатор);
	//	ОткрытьФорму("ОбщаяФорма.CW_ФормаКопированияБюджетаПоЗаявке",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//	
	//КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"ИнтерактивныйРежим", 			Истина);
	
	Если (ВариантыБюджетов.Количество() <> 0) Тогда
		
		_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"КопироватьБюджеты",Истина);
		_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"КопироватьБюджетыМассивВариантов",ВариантыБюджетов.ВыгрузитьЗначения());
		
	КонецЕсли; 
	
	//Запись данных харнилища занчений по строкам 
	Для Каждого ЭлементСписка из СписокАдресовЗначенийПараметров Цикл
		
		//ДанныеПоАдресу - тип "Структура("Параметр, ТаблицаДанных")
		ДанныеПоАдресу = ЭлементСписка.Значение;
		
		Отбор = Новый Структура("Параметр", ДанныеПоАдресу.Параметр);
		мСтроки = ТекущийОбъект.ПараметрыЗаявки.НайтиСтроки(Отбор);
		Если мСтроки.Количество() > 0 Тогда
			//Предполагаем что строка будет только одна
			СтрокаДанных = мСтроки[0]; 
			Если ТипЗНЧ(ДанныеПоАдресу.ДанныеДляХранения) = Тип("ДанныеФормыКоллекция") Тогда
				СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(ДанныеПоАдресу.ДанныеДляХранения.Выгрузить());	
			Иначе
				СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(ДанныеПоАдресу.ДанныеДляХранения);	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	//ХранениеПолногоЗначения 
	Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда 
		Для Каждого КлючЗначение из СохраняемоеПолноеЗначение Цикл
			Отбор = Новый Структура("Параметр", КлючЗначение.Ключ);
			НайденныеСтроки = ТекущийОбъект.ПараметрыЗаявки.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				//Предполагаем что строка будет только одна
				СтрокаДанных = НайденныеСтроки[0];   
				СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(КлючЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//---ХранениеПолногоЗначения
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если (НЕ Элементы.СтраницаСобытия.Видимость) Тогда
		
		_ОтборСобытий();
		
	КонецЕсли; 
	
	УстановитьОтборЗаказов();
	// --- 
	_УправлениеЭлементамиФормы();
	// --- 
	Если (НЕ ГрузоперевозкиИнициализированы ) Тогда
		_УстановитьЗаголовокСтраницыГрузоперевозок();
	КонецЕсли;
	// --- 
	_Заголовок();
	
	//Подсистема.ЛогистическиеСтатусы
	ВыполнитьРасчетЛогистическогоСтатусаНаСервере();
	//Подсистема.ЛогистическиеСтатусы   
	
	//ПрогнозОплаты   
	Если ИспользуетсяПрогнозированиеДДСПоБюджету Тогда
		CW_Бюджетирование.РассчитатьПрогнозОплаты(Объект.Ссылка);
	КонецЕсли;
	//ПрогнозОплаты 
	
	//РаботаСАрхивомОбъектов
	CW_АрхивОбъектовСервер.ПослеЗаписиНаСервере(ЭтаФорма);
	//РаботаСАрхивомОбъектов
	
	УстаноитьВидимостьСтраниц();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// --- 
	ВариантыБюджетов.Очистить();
	// --- 
	ОповеститьОЗаписиНового(Объект.Ссылка);
	Оповестить("ЗаписьСправочника",Объект.Ссылка,"Справочник.CW_Заявки");
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОбработкаВопросаКопированияБюджета(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		// сохраняем список вариантов 
		Для каждого Элемент Из Ответ.ВариантыБюджетов Цикл
			
			Если (Элемент.Пометка) Тогда
				ВариантыБюджетов.Добавить(Элемент.Значение);	
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	// --- 
	РежимКопирования = Ложь;
	// --- 
	//ЭтаФорма.Записать();
	
	// --- 
КонецПроцедуры
  

&НаСервере
Процедура _Заголовок()
	
	Если Объект.Ссылка.Пустая() Тогда
		Заголовок = "Новая заявка";
	Иначе
		Заголовок = Объект.Наименование;
	КонецЕсли; 

КонецПроцедуры
 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Элементы.СтраницаСобытия.Видимость = НЕ Объект.Ссылка.Пустая();
	Элементы.СтраницаЖурналГрузоперевозок.Видимость = НЕ Объект.Ссылка.Пустая();
	// --- 
	Элементы.ДобавитьСобытие.Видимость = НЕ Объект.Ссылка.Пустая();
	
	Элементы.Типоразмер.Видимость = (Объект.ТипПеревозки.ВидПеревозки = Перечисления.CW_ВидыПеревозок.Контейнер);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	_ОтборСобытий();
	
	УстановитьМенеджераПродаж();

	_УправлениеЭлементамиФормы();
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.Контрагент, "Клиент");
	
КонецПроцедуры


&НаСервере
Процедура УстановитьМенеджераПродаж()
	
	ПараметрыСреза = Новый Структура;
	ПараметрыСреза.Вставить("ДатаСреза"	, Объект.ДатаОбращения);
	ПараметрыСреза.Вставить("Контрагент", Объект.Контрагент);
	
	НовыйМенеджерПродаж = РегистрыСведений.CW_МенеджерыПродажКлиентов.ПолучитьМенеджераКлиента(ПараметрыСреза);
	
	Если НовыйМенеджерПродаж <> Объект.МенеджерПродаж Тогда
		Объект.МенеджерПродаж = НовыйМенеджерПродаж;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура МенеджерПродажПриИзменении(Элемент)
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.МенеджерПродаж, "МенеджерПродаж");
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если (ТекущаяСтраница = Элементы.СтраницаБюджет) Тогда

		УстановитьВариантБюджета();
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
		
		//Сортировка бюджетов
		ВосстановитьСортировкуТаблицы("БюджетРасходы");
		ВосстановитьСортировкуТаблицы("БюджетДоходы");
		//Сортировка бюджетов
		
	ИначеЕсли (ТекущаяСтраница = Элементы.СтраницаЖурналГрузоперевозок) Тогда 
		Если (НЕ ГрузоперевозкиИнициализированы) Тогда
			
			// инициализируем
			ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ИнициализацияФормы",Новый Структура("ИмяСеансовойНастройки","ПоследняяНастройкаЗаявки")));
			ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ИнициализацияНастроек"));
			ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ОбновитьДанные"));
			ГрузоперевозкиИнициализированы = Истина;
		КонецЕсли;  
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьЗаголовокСтраницыГрузоперевозок()
	
	Если (Объект.Ссылка.Пустая()) Тогда
		Возврат;
	КонецЕсли; 
	
	КоличествоГрузоперевозокПоЗаявке = Справочники.CW_Заявки.ПолучитьКоличествоГрузоперевозокПоЗаявке(Объект.Ссылка);

	Элементы.СтраницаЖурналГрузоперевозок.Заголовок = "Грузоперевозки ("+Формат(КоличествоГрузоперевозокПоЗаявке,"ЧДЦ=; ЧН=; ЧГ=")+")";
	
КонецПроцедуры

//#КонецОбласти 


&НаСервере
Процедура УстановитьВариантБюджета()   
	
	Если Объект.Ссылка.Пустая() 
		или ЗначениеЗаполнено(Объект.ВариантБюджета) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ВариантыБюджетовПоЗаявкам.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ВариантыБюджетовПоЗаявкам КАК CW_ВариантыБюджетовПоЗаявкам
	|ГДЕ
	|	CW_ВариантыБюджетовПоЗаявкам.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	РезультатЗапроса =  Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВариантОбъект = Справочники.CW_ВариантыБюджетовПоЗаявкам.СоздатьЭлемент();
		ВариантОбъект.Владелец = Объект.Ссылка;
		ВариантОбъект.Наименование = "Основной";
		ВариантОбъект.Записать();
		
		ВариантБюджета = ВариантОбъект.Ссылка;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ВариантБюджета = Выборка.Ссылка;
	КонецЕсли; 
	
	Объект.ВариантБюджета = ВариантБюджета;
	
КонецПроцедуры
 

#Область МеханизмДействий 

&НаКлиенте
Процедура ВыполнитьДействия(Результат,ДополнительныеПараметры) Экспорт 
	// --- 
	
	ВыполнитьДействие(Результат);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьДействие(Действия)
	// --- 
	
	Если (Действия = Неопределено) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	
	Если (ТипЗнч(Действия)=Тип("Структура")) Тогда
		МассивДействий = Новый Массив;
		МассивДействий.Добавить(Действия);
	Иначе
		МассивДействий = Действия;
	КонецЕсли; 
	МассивОтветов = Новый Массив;
	
	Для каждого СтруктураДействия Из МассивДействий Цикл
		
		Если (СтруктураДействия = Неопределено) Тогда
			
			Продолжить;
			
		КонецЕсли; 
		// --- 
		Если (НЕ ЗначениеЗаполнено(СтруктураДействия.Модуль)) Тогда
			Сообщить("Ошибка: не указан модуль действиядля команды """+СтруктураДействия.Команда+"""");
		КонецЕсли; 
		Если (НЕ ЗначениеЗаполнено(СтруктураДействия.Выполнение)) Тогда
			Сообщить("Ошибка: не указан вариант выполнения для команды """+СтруктураДействия.Команда+"""");
			Возврат(Неопределено);
		КонецЕсли; 
		
		// ---------------------------------------------------------------------------- 
		
		Если (СтруктураДействия.Выполнение = "клиент") Тогда
			
			ПОВ = Новый ОписаниеОповещения("ВыполнитьДействия",ЭтотОбъект);
			
			Если (СтруктураДействия.Модуль = "Грузоперевозки") Тогда
				
				Ответ = CW_Грузоперевозки_Клиент.ВыполнитьДействие(ЭтаФорма,СтруктураДействия, ПОВ);
				
			ИначеЕсли (СтруктураДействия.Модуль = "Журналы") Тогда 
				
				Ответ = CW_Журналы_Клиент.ВыполнитьДействие(ЭтаФорма,СтруктураДействия, ПОВ);
				
			КонецЕсли;
			
		ИначеЕсли (СтруктураДействия.Выполнение = "сервер") Тогда 
			
			Ответ = ВыполнитьДействиеНаСервере(СтруктураДействия);
			
		КонецЕсли;
		
		Если (Ответ <> Неопределено) Тогда
			Если (ТипЗнч(Ответ)=Тип("Структура")) Тогда
				МассивОтветов.Добавить(Ответ);
			Иначе
				Для каждого ЭлементОтвета Из Ответ Цикл
					МассивОтветов.Добавить(ЭлементОтвета);
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если (МассивОтветов.Количество() <> 0) Тогда
		Возврат(ВыполнитьДействие(МассивОтветов)); 
	Иначе
		Возврат(Неопределено);
	КонецЕсли; 
	
	// --- 
КонецФункции
  
&НаСервере
Функция ВыполнитьДействиеНаСервере(СтруктураДействия)
	// --- 
	
	Если (СтруктураДействия.Модуль = "Грузоперевозки") Тогда
		Возврат(CW_Грузоперевозки_Сервер.ВыполнитьДействие(ЭтаФорма,СтруктураДействия));
	ИначеЕсли (СтруктураДействия.Модуль = "Журналы") Тогда 
		Возврат(CW_Журналы_Сервер.ВыполнитьДействие(ЭтаФорма,СтруктураДействия));	
	КонецЕсли; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

// событие всех кнопок панели (!!!)
&НаКлиенте
Процедура ЖурналДействие(Команда)
	
	ВыполнитьДействие(_УФКС.СД("Журналы","клиент",СтрЗаменить(Команда.Имя,"Журнал_","/"),Неопределено));
	
КонецПроцедуры

// событие всех кнопок панели (!!!)
&НаКлиенте
Процедура ФормаДействие(Команда)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент",СтрЗаменить(Команда.Имя,"Форма_","/"),Неопределено));
	
КонецПроцедуры

#КонецОбласти 

#Область Журнал

&НаКлиенте
Процедура ЖурналПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	Отказ = истина;
	Возврат;
	
	Если Копирование Тогда
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ЭтаФорма.Записать();
	КонецЕсли;  
	
	CW_Журналы_Клиент.ЖурналПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ВыполнитьДействие(CW_Журналы_Клиент.ЗадатьВопросыОчиститьЛибоПометитьНаУдаление(ЭтаФорма, Новый ОписаниеОповещения("ВыполнитьДействия",ЭтотОбъект)));
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПриАктивизацииЯчейки(Элемент)
	
	CW_Журналы_Клиент.ЖурналПриАктивизацииЯчейки(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПриАктивизацииПоля(Элемент)
	
	CW_Журналы_Клиент.ЖурналПриАктивизацииПоля(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(НовыйОбъект);
	ВыполнитьДействие(_УФКС.СД("Журналы","сервер","/ОбновитьДанные",МассивСсылок));
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СобытиеЖурналВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	СобытиеЖурналВыбор(Элемент,Элементы.Журнал.ТекущаяСтрока,Элементы.Журнал.ТекущийЭлемент,Истина);
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура СобытиеЖурналВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "ЖурналФайлы" Тогда
		_УФК.ОткрытьСписокФайловОбъекта(ЭтаФорма, Элемент.ТекущиеДанные.Ссылка);
	Иначе
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент","/ОткрытьЛибоРедактировать",ВыбраннаяСтрока)); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВариантБюджетаПриИзменении(Элемент)
	
	Объект.ВариантБюджета = ВариантБюджета;
	
	УстановитьЦветФонаСрокаДеййствияНаСервере();
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));  
	
	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетРасходы");
	ВосстановитьСортировкуТаблицы("БюджетДоходы");
	//Сортировка бюджетов

	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры

#Область События
  
&НаСервере
Процедура _ОтборСобытий()
	// --- 
	
	События.Отбор.Элементы.Очистить();
	_УФС.ДобавитьОтбор(События.Отбор,"Владелец",,Объект.Контрагент);
	_УФС.ДобавитьОтбор(События.Отбор,"ОбъектСобытия",,Объект.Ссылка);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ДеревоПараметров
// --- 
&НаКлиенте
Процедура ВосстановитьТекущуюПозициюКурсора()
	
	ИдентификаторСтрокиДерева = НайтиПозициюВДереве(ДПГ.ПолучитьЭлементы());
	Элементы.ДПГ.ТекущаяСтрока = ИдентификаторСтрокиДерева;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиПозициюВДереве(ЭлементыДерева) Экспорт
	
	Для Каждого СтрокаДерева Из ЭлементыДерева Цикл
		Если СтрокаДерева.Параметр = ПараметрТекущиейСтрокиДерева Тогда
			Возврат СтрокаДерева.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
		ИдентификаторСтрокиДерева =  НайтиПозициюВДереве(СтрокаДерева.ПолучитьЭлементы());
		Если ИдентификаторСтрокиДерева <> Неопределено Тогда
			Возврат ИдентификаторСтрокиДерева;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции



#Область ФормированиеДерева 

&НаКлиенте
Процедура ДПГ_Обновить(Команда)
	
	ОбновитьДеревоПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоПараметров(СП=Неопределено)
	
	ТекущиеДанные =  Элементы.ДПГ.ТекущиеДанные;
	Если  ТекущиеДанные <> Неопределено Тогда
		ПараметрТекущиейСтрокиДерева = Элементы.ДПГ.ТекущиеДанные.Параметр;
	КонецЕсли;
	
	_ОбновитьДеревоПараметров(СП);
	ПересчитатьДинамическиеПараметры();
	ДПГ_ВосстановитьСостояниеСвертки();
	
	Если ЗначениеЗаполнено(ПараметрТекущиейСтрокиДерева) Тогда
		ВосстановитьТекущуюПозициюКурсора();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьДеревоПараметров(СП=Неопределено)
	// --- 
	
	Если (Объект.ГруппыПараметровЗаявки.Количество()=0) Тогда
		Корень = Объект.ГруппыПараметровЗаявки.Добавить();
		Корень.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(Новый Массив);
	Иначе
		Корень = Объект.ГруппыПараметровЗаявки[0];	
	КонецЕсли; 
	Если (НЕ Корень.Раскрывать) Тогда
		Корень.Раскрывать = Истина;
	КонецЕсли; 
	Если (Корень.ИдентификаторыВедомых="") Тогда
		Корень.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(Новый Массив);
	КонецЕсли; 
	// ---------------------------------------------------------------------------- 
	
	// получаем текущие группы 		
	Элементы.ДПГ.НачальноеОтображениеДерева=НачальноеОтображениеДерева.НеРаскрывать;
	ДПГ.ПолучитьЭлементы().Очистить();
	// --- 
	СПВ = Новый Структура("КартаПрав,КартаСвойств,ТаблицаКонтроляГрупп,ТаблицаКонтроляПараметров");
	СПВ.КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	СПВ.КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	СПВ.ТаблицаКонтроляГрупп = _ТаблицаКонтроляГрупп();
	СПВ.ТаблицаКонтроляПараметров = _ТаблицаКонтроляПараметров(СПВ.КартаПрав);
	// --- 
	УдалятьПустыеГруппы = Ложь;
	Если (СП <> Неопределено) Тогда
		СП.Свойство("УдалятьПустыеГруппы",УдалятьПустыеГруппы);
	КонецЕсли; 
	СПВ.Вставить("УдалятьПустыеГруппы",УдалятьПустыеГруппы);
	// --- 
	_СформироватьЭлементыДерева(Корень,Неопределено,СПВ);
	
	// проверим, всё ли выведено
	#Область КонтрольНесформированных 
	// после формирования проверяем, нет ли потерянных групп, 
	// если есть, то засовываем их в корень и переформировываем дерево
	// сообщаем о потерянных группах
	МассивНеучтенныхГрупп = _сф.к_НайтиСтроки(СПВ.ТаблицаКонтроляГрупп,Новый Структура("Видимость",Ложь));
	Если (МассивНеучтенныхГрупп.Количество() <> 0) Тогда
		
		// переносим каждую в корень
		Для каждого КонтрольнаяСтрокаГруппы Из МассивНеучтенныхГрупп Цикл
			
			_ДобавитьЭлементГруппы(КонтрольнаяСтрокаГруппы.Идентификатор, Корень);
			
		КонецЦикла; 
		// --- 
		// переформировываем дерево
		_ОбновитьДеревоПараметров();
		
	КонецЕсли; 
	
	// далее проверяем, нет ли потерянных/новых параметров, если есть
	// то добавляем их в корень и снова переформировываем дерево
	МассивНеучтенныхПараметров = _сф.к_НайтиСтроки(СПВ.ТаблицаКонтроляПараметров,Новый Структура("Видимость",Ложь));
	Если (МассивНеучтенныхПараметров.Количество() <> 0) Тогда
		
		// переносим каждую в корень
		Для каждого КонтрольнаяСтрокаПараметра Из МассивНеучтенныхПараметров Цикл
			
			_ДобавитьЭлементГруппы(КонтрольнаяСтрокаПараметра.Параметр, Корень);
			
		КонецЦикла; 
		// переформировываем дерево
		_ОбновитьДеревоПараметров();
		
	КонецЕсли; 
	#КонецОбласти 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ТаблицаКонтроляГрупп()
	// --- 
	
	ТаблицаКонтроляГрупп = Объект.ГруппыПараметровЗаявки.Выгрузить();
	ТаблицаКонтроляГрупп.Колонки.Добавить("Видимость");
	ТаблицаКонтроляГрупп.ЗаполнитьЗначения(Ложь,"Видимость");
	СтрокаКорня = _сф.к_ПервыйЭлемент(ТаблицаКонтроляГрупп);
	СтрокаКорня.Видимость = Истина;
	// --- 
	Возврат(ТаблицаКонтроляГрупп);
	
	// --- 
КонецФункции

&НаСервере
Функция _ТаблицаКонтроляПараметров(НаборПрав)
	// --- 
	
	ТаблицаКонтроляПараметров = Объект.ПараметрыЗаявки.Выгрузить();
	// --- 
	ТаблицаКонтроляПараметров.Колонки.Добавить("Видимость");
	ТаблицаКонтроляПараметров.ЗаполнитьЗначения(Ложь,"Видимость");
	// --- 
	МассивУдаляемыхСтрок = Новый Массив;
	Для каждого СтрокаКонтроля Из ТаблицаКонтроляПараметров Цикл
		
		СтруктураПрав = НаборПрав["п_"+_сф.КлючПоСсылке(СтрокаКонтроля.Параметр)];
		Если (НЕ СтруктураПрав.Просмотр) Тогда
			
			МассивУдаляемыхСтрок.Добавить(СтрокаКонтроля);
			
		КонецЕсли;
		
	КонецЦикла; 
	_сф.к_УдалитьЭлементыПоМассиву(ТаблицаКонтроляПараметров, МассивУдаляемыхСтрок);
	// --- 
	Возврат(ТаблицаКонтроляПараметров);
	
	// --- 
КонецФункции

&НаСервере
Функция _СформироватьЭлементыДерева(Группа,СтрокаДерева = Неопределено, СПВ)
	
	// СПВ - структура параметров вызова
	// --- 
	// .КартаПрав
	// .КартаСвойств
	// .ТаблицаКонтроляГрупп = Неопределено
	// .ТаблицаКонтроляПараметров = Неопределено
	
	// ---------------------------------------------------------------------------- 
	
	Если (СтрокаДерева <> Неопределено) Тогда
		КоллекцияЭлементовДерева = СтрокаДерева.ПолучитьЭлементы();
	Иначе
		КоллекцияЭлементовДерева = ДПГ.ПолучитьЭлементы();		
	КонецЕсли; 
	КоллекцияЭлементовДерева.Очистить();
	// --- 
	
	МассивПодчиненныхЭлементов = ЗначениеИзСтрокиВнутр(Группа.ИдентификаторыВедомых);
	МассивИдентификаторовДляУдаления = Новый Массив;
	Для каждого ПодчиненныйЭлемент Из МассивПодчиненныхЭлементов Цикл
		
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда  
			ПодчиненныйЭлементОбъект = ПодчиненныйЭлемент.ПолучитьОбъект();
			Если ПодчиненныйЭлементОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;                                                                                            
		Конецесли;

		ЭтоГруппа = (ТипЗнч(ПодчиненныйЭлемент)=Тип("Число"));
		// --- 	
		Если (ЭтоГруппа) Тогда
			
			ОтборПоИдентификаторуГруппы = Новый Структура("Идентификатор",ПодчиненныйЭлемент);
			СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,ОтборПоИдентификаторуГруппы);
			// проверяем, что еще не выведена и записываем признак формирования
			Если (СПВ.ТаблицаКонтроляГрупп <> Неопределено) Тогда
				
				КонтрольнаяСтрокаГруппы = _сф.к_НайтиСтроку(СПВ.ТаблицаКонтроляГрупп, ОтборПоИдентификаторуГруппы);
				Если (КонтрольнаяСтрокаГруппы.Видимость) Тогда
					
					// ахтунг, зацикливание
					МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
					Продолжить;
					
				Иначе
					
					КонтрольнаяСтрокаГруппы.Видимость = Истина;
					
				КонецЕсли; 
				
			КонецЕсли; 
			// --- 
			Нстр = КоллекцияЭлементовДерева.Добавить();
			_ЗаполнитьСтрокуДереваПоГруппе(Нстр, СтрокаГруппы);
			// --- 
			УстановитьСостояниеСверткиСтроки(Нстр.ПолучитьИдентификатор(), Нстр.ИдентификаторГруппы, СтрокаГруппы.Раскрывать);
			_СформироватьЭлементыДерева(СтрокаГруппы, Нстр, СПВ);
			// ---------------------------------------------------------------------------- 
			// устанавливаем признак разрешения удаления для группы
			УдалениеРазрешено = Истина;
			// --- 
			КоллекцияПодчиненных = Нстр.ПолучитьЭлементы();
			КоличествоСформированныхПодчиненных = КоллекцияПодчиненных.Количество();
			КоличествоПодчиненных = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых).Количество();
			Если (КоличествоСформированныхПодчиненных <> КоличествоПодчиненных) Тогда
				
				УдалениеРазрешено = Ложь;
				
			Иначе
				
				Для каждого ПодчиненнаяСтрока Из КоллекцияПодчиненных Цикл
					
					Если (НЕ ПодчиненнаяСтрока.УдалениеРазрешено) Тогда
						УдалениеРазрешено = Ложь;
						Прервать;
					КонецЕсли; 
					
				КонецЦикла; 
				
			КонецЕсли; 
			Нстр.УдалениеРазрешено = УдалениеРазрешено;
			// ---
			Нстр.КоличествоПараметров = 0;
			Для каждого ПодчиненнаяСтрока Из КоллекцияПодчиненных Цикл
				
				_сф.Инкремент(Нстр.КоличествоПараметров,ПодчиненнаяСтрока.КоличествоПараметров);
				
			КонецЦикла;
			Если (ПоказыватьКоличествоПараметров) Тогда
				 
				Нстр.Параметр_Представление = Нстр.НаименованиеГруппы + " ("+Формат(Нстр.КоличествоПараметров,"ЧН=; ЧГ=")+")";
				
			КонецЕсли; 
			
		КонецЕсли; 
		// --- 
		Если (НЕ ЭтоГруппа) Тогда
			
			Параметр = ПодчиненныйЭлемент;
			// ---------------------------------------------------------------------------- 
			
			// проверим права
			СтруктураПрав = СПВ.КартаПрав["п_"+_сф.КлючПоСсылке(Параметр)];
			Если (НЕ СтруктураПрав.Просмотр) Тогда
				
				Продолжить;
				
			КонецЕсли;
			// --- 
			// найдем свойства
			СП = СПВ.КартаСвойств.Получить(ПодчиненныйЭлемент);
			// --- 
			// контроль формирования
			Если (СПВ.ТаблицаКонтроляПараметров <> Неопределено) Тогда
				
				ОтборПоПараметру = Новый Структура("Параметр",ПодчиненныйЭлемент);
				КонтрольнаяСтрокаПараметра = _сф.к_НайтиСтроку(СПВ.ТаблицаКонтроляПараметров, ОтборПоПараметру);
				Если (КонтрольнаяСтрокаПараметра = Неопределено) Тогда
					
					//Сообщить("Параметр """+Строка(ПодчиненныйЭлемент)+""" не найден в контрольной таблице.");
					
				Иначе
					
					Если (КонтрольнаяСтрокаПараметра.Видимость) Тогда
						
						// ахтунг, параметр уже в какой-то группе, удаляем из текущей
						МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
						Продолжить;
						
					Иначе
						
						КонтрольнаяСтрокаПараметра.Видимость = Истина;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			// --- 
			СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыЗаявки,Новый Структура("Параметр",Параметр));
			Если (СтрокаПараметра = Неопределено) Тогда
				
				// параметр был удален
				МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
				Продолжить;
				
			КонецЕсли; 
			Нстр = КоллекцияЭлементовДерева.Добавить();
			_ЗаполнитьСтрокуДереваПоПараметру(Нстр, СтрокаПараметра, СП, СтруктураПрав);
			
			// записываем добавленную строку в карту параметров дерева
			ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Параметр);
			Если (ЭлементКартыПараметров = Неопределено) Тогда
				ЭлементКартыПараметров = КартаПараметровДерева.Добавить(Параметр);
			КонецЕсли; 
			ЭлементКартыПараметров.Представление = Формат(Нстр.ПолучитьИдентификатор(),"ЧЦ=10; ЧДЦ=; ЧН=; ЧГ=");
			
		КонецЕсли; 
		
		
	КонецЦикла; 
	// --- 
	// удаление пустых групп
	Если (СПВ.Свойство("УдалятьПустыеГруппы")) Тогда
		
		Если (СПВ.УдалятьПустыеГруппы) Тогда
			
			МассивУдаляемыхСтрокДерева = Новый Массив;
			// --- 
			Для каждого ПодчиненнаяСтрока Из КоллекцияЭлементовДерева Цикл
				
				Если (ПодчиненнаяСтрока.ЭтоГруппа И ПодчиненнаяСтрока.КоличествоПараметров = 0) Тогда
					
					// удаляем группу
					Идентификатор = ПодчиненнаяСтрока.ИдентификаторГруппы;
					СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор",Идентификатор));
					Если (СтрокаГруппы <> Неопределено) Тогда
						
						Если (СтрокаГруппы.Идентификатор <> 0) Тогда
							
							МассивИдентификаторовДляУдаления.Добавить(Идентификатор);
							МассивУдаляемыхСтрокДерева.Добавить(ПодчиненнаяСтрока);
							Объект.ГруппыПараметровЗаявки.Удалить(Объект.ГруппыПараметровЗаявки.Индекс(СтрокаГруппы));
							
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла; 
			// --- 
			Если (МассивУдаляемыхСтрокДерева.Количество() <> 0) Тогда
				
				Для каждого УдаляемаяСтрока Из МассивУдаляемыхСтрокДерева Цикл
					
					КоллекцияЭлементовДерева.Удалить(КоллекцияЭлементовДерева.Индекс(УдаляемаяСтрока));
					
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли; 
	 
	// --- 
	// удаляем некорректные элементы
	Если (МассивИдентификаторовДляУдаления.Количество() <> 0) Тогда
		
		Для каждого ИдентификаторДляУдаления Из МассивИдентификаторовДляУдаления Цикл
			
			МассивПодчиненныхЭлементов.Удалить(МассивПодчиненныхЭлементов.Найти(ИдентификаторДляУдаления));
			
		КонецЦикла; 
		Группа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивПодчиненныхЭлементов);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Процедура _ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева,СтрокаПараметра,СвойстваПараметра=Неопределено,СтруктураПрав=Неопределено)
	// --- 
	
	Если (СтрокаПараметра = Неопределено) Тогда
		Возврат;
	КонецЕсли; 
	// ---------------------------------------------------------------------------- 
	
	Параметр = СтрокаПараметра.Параметр;
	ТДата = ТекущаяДата();
	// ---------------------------------------------------------------------------- 
	Если (СвойстваПараметра = Неопределено) Тогда
		СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
		СвойстваПараметра = СвойстваПараметров.Получить(Параметр);
		Если (СвойстваПараметра = Неопределено) Тогда
			КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
			СвойстваПараметра = КартаСвойств.Получить(Параметр);
		КонецЕсли; 
	КонецЕсли; 
	Если (СтруктураПрав = Неопределено) Тогда
		
		КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
		СтруктураПрав = КартаПрав["п_"+_сф.КлючПоСсылке(Параметр)];
		
	КонецЕсли; 
	// ---------------------------------------------------------------------------- 
	
	// основное
	СтрокаДерева.Параметр = Параметр;	
	СтрокаДерева.Параметр_Представление = СвойстваПараметра.Наименование;	
	СтрокаДерева.Значение = СтрокаПараметра.Значение;
	СтрокаДерева.КоличествоПараметров = 1;
	СтрокаДерева.Примечание = СтрокаПараметра.Примечание;
	
	//Новый механизм
	СтрокаДерева.ИдентификаторВладельца = СтрокаПараметра.ИдентификаторВладельца;
	//Новый механизм
	
	// ---------------------------------------------------------------------------- 
	// индекс картинки
	Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
		СтрокаДерева.ИндексКартинки = 2;				
	ИначеЕсли (СвойстваПараметра.ДинамическийПараметр) Тогда 
		СтрокаДерева.ИндексКартинки = 3;
	Иначе
		СтрокаДерева.ИндексКартинки = 1;
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	// формат вывода
	ТипЗначенияПараметра = СвойстваПараметра.ТипЗначения;
	ТипПараметра = СвойстваПараметра.ТипЗначения.Типы()[0];
	Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
		
		Если СвойстваПараметра.ФорматВывода <> "" Тогда
			СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,СвойстваПараметра.ФорматВывода);
		Иначе
			
			Если (НЕ СвойстваПараметра.КонтрольнаяДатаИспользуетВремя) Тогда
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,"ДФ=dd.MM.yyyy");
			Иначе
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,"ДФ='dd.MM.yyyy HH:mm'");
			КонецЕсли; 
			
		КонецЕсли; 
		
	Иначе
		
		Если (ТипПараметра = Тип("Булево") ИЛИ ТипПараметра = Тип("Дата") ИЛИ ТипПараметра=Тип("Число")) Тогда
			
			Если (СвойстваПараметра.ФорматВывода <> "") Тогда
				
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,СвойстваПараметра.ФорматВывода);
				
			Иначе
				
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение);
				
				Если ТипПараметра = Тип("Дата") Тогда
					
					ФорматВывода = "";
					ЧастьДаты = ТипЗначенияПараметра.КвалификаторыДаты.ЧастиДаты;
					Если ЧастьДаты = ЧастиДаты.Дата Тогда
						
						// формат дат по умолчанию
						ФорматВывода = "ДФ=dd.MM.yyyy";
						
					ИначеЕсли ЧастьДаты = ЧастиДаты.Время Тогда 
						
						// формат дат по умолчанию
						ФорматВывода = "ДФ=HH:mm:ss";
						
					ИначеЕсли ЧастьДаты = ЧастиДаты.ДатаВремя Тогда 
						
						// формат дат по умолчанию
						ФорматВывода = "ДЛФ=";
						
					КонецЕсли;
					
					СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,ФорматВывода);
					
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе
			
			СтрокаДерева.Значение_Представление = Строка(СтрокаДерева.Значение);
			
		КонецЕсли; 					
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	// статус план/факт
	Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
		
		Если (СтрокаПараметра.ЗначениеФакт <> Дата(1,1,1)) Тогда
			
			СтрокаДерева.ПланФакт=Истина;
			СтрокаДерева.ПланПросрочен=Ложь;
			
		Иначе
			
			СтрокаДерева.ПланФакт=Ложь;
			Если (СтрокаПараметра.ЗначениеПлан <> Дата(1,1,1)) И (СтрокаПараметра.ЗначениеПлан - НачалоДня(ТДата) <= СвойстваПараметра.ЛимитПросрочкиКонтрольнойДаты * 60*60*24) Тогда
				СтрокаДерева.ПланПросрочен=Истина;
			Иначе	
				СтрокаДерева.ПланПросрочен=Ложь;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 

	// ---------------------------------------------------------------------------- 
	// право удаления
	СтрокаДерева.УдалениеРазрешено = СтруктураПрав.Редактирование;
	
	// ---------------------------------------------------------------------------- 
	// контроль заполнения
	Если (ЗначениеЗаполнено(Объект.ТипПеревозки)) Тогда
		
		СтрокаКонтроляЗаполненияПараметра = Объект.ТипПеревозки.ПараметрыЗаявки.Найти(СтрокаПараметра.Параметр,"Параметр");
		Если (СтрокаКонтроляЗаполненияПараметра <> Неопределено) Тогда
			
			СтрокаДерева.КонтрольЗаполнения = СтрокаКонтроляЗаполненияПараметра.КонтрольЗаполнения;
			
		КонецЕсли; 
		ТекущееЗначениеКонтроляЗаполнения = СтрокаДерева.ЗначениеНезаполнено;
		Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
			
			СтрокаДерева.ЗначениеНезаполнено = (СтрокаДерева.КонтрольЗаполнения И НЕ ЗначениеЗаполнено(СтрокаПараметра.ЗначениеФакт));
			
		Иначе
			
			СтрокаДерева.ЗначениеНезаполнено = (СтрокаДерева.КонтрольЗаполнения И НЕ ЗначениеЗаполнено(СтрокаПараметра.Значение));
			
		КонецЕсли; 
		Если (ТекущееЗначениеКонтроляЗаполнения <> СтрокаДерева.ЗначениеНезаполнено) Тогда
			
			// требуется рекурсивно проверить контроль заполнения
			_ПроверитьГруппыПоИерархии(СтрокаДерева);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ПроверитьГруппыПоИерархии(СтрокаДерева)
	// --- 
	
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		СтрокаРодителя = СтрокаДерева;
	Иначе
		СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
		Если (СтрокаРодителя = Неопределено) Тогда
			
			Возврат;
			
		КонецЕсли; 
	КонецЕсли; 
	// --- 
	ЗначениеНеЗаполнено = Ложь;
	// требуется проверить отметку контроля заполнения у родителя
	
	ЭлементыСтроки = СтрокаРодителя.ПолучитьЭлементы();
	СтрокаРодителя.КоличествоПараметров = 0;
	Для каждого Стр Из ЭлементыСтроки Цикл
		
		Если (Стр.КонтрольЗаполнения И Стр.ЗначениеНезаполнено) Тогда
			
			ЗначениеНеЗаполнено = Истина;
			
		КонецЕсли; 
		_сф.Инкремент(СтрокаРодителя.КоличествоПараметров,Стр.КоличествоПараметров);
		
	КонецЦикла; 
	СтрокаРодителя.ЗначениеНезаполнено = ЗначениеНеЗаполнено;
	Если (ПоказыватьКоличествоПараметров) Тогда
		СтрокаРодителя.Параметр_Представление = СтрокаРодителя.НаименованиеГруппы + " ("+Формат(СтрокаРодителя.КоличествоПараметров,"ЧН=; ЧГ=")+")";	
	КонецЕсли; 
	
	// --- 
	
	// устанавливаем признак разрешения удаления для группы
	УдалениеРазрешено = Истина;
	// --- 
	КоличествоСформированныхПодчиненных = ЭлементыСтроки.Количество();
	СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
	КоличествоПодчиненных = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых).Количество();
	Если (КоличествоСформированныхПодчиненных <> КоличествоПодчиненных) Тогда
		
		УдалениеРазрешено = Ложь;
		
	Иначе
		
		Для каждого ПодчиненнаяСтрока Из ЭлементыСтроки Цикл
			
			Если (НЕ ПодчиненнаяСтрока.УдалениеРазрешено) Тогда
				УдалениеРазрешено = Ложь;
				Прервать;
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	СтрокаРодителя.УдалениеРазрешено = УдалениеРазрешено;
	
	// --- 
	РодительРодителя = СтрокаРодителя.ПолучитьРодителя();
	Если (РодительРодителя <> Неопределено) Тогда
		_ПроверитьГруппыПоИерархии(РодительРодителя);	
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы)
	// --- 
	
	СтрокаДерева.ЭтоГруппа = Истина;
	СтрокаДерева.НаименованиеГруппы = СтрокаГруппы.Наименование;
	СтрокаДерева.Параметр_Представление = СтрокаГруппы.Наименование;
	СтрокаДерева.ИдентификаторГруппы = СтрокаГруппы.Идентификатор;
	СтрокаДерева.КонтрольЗаполнения = Истина;
	// --- 
	СтрокаДерева.ИндексКартинки = 0;
	
	//Новый механизм
	СтрокаДерева.ИдентификаторВладельца = СтрокаГруппы.ИдентификаторВладельца;
	//Новый механизм
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ВыполнитьПодгрузкуСтрок(ИдентификаторСтрокиРодителя)
	// --- 
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
	СтрокаДерева.ПолучитьЭлементы().Очистить();
	_ВыполнитьПодгрузку(ИдентификаторСтрокиРодителя);
	// --- 
	
	ВосстановитьСостояниеСверткиСтроки(ИдентификаторСтрокиРодителя);
	// --- 
	Элементы.ДПГ.Развернуть(ИдентификаторСтрокиРодителя);
	СохранитьСостояниеСверткиСтроки(ИдентификаторСтрокиРодителя, Истина);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ВыполнитьПодгрузку(ИдентификаторСтрокиРодителя)
	// --- 
	
	СтрокаРодителя = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
	СтрокаГруппа = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор",СтрокаРодителя.ИдентификаторГруппы));
	// --- 
	СПВ = Новый Структура("КартаПрав,КартаСвойств,ТаблицаКонтроляГрупп,ТаблицаКонтроляПараметров");
	СПВ.КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	СПВ.КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	// --- 
	_СформироватьЭлементыДерева(СтрокаГруппа,СтрокаРодителя, СПВ);
	
	//
	_ПроверитьГруппыПоИерархии(СтрокаРодителя);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область СобытияДерева


&НаКлиенте
Процедура ДПГПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	Идентификатор = Элементы.ДПГ.ТекущаяСтрока;
	СтрокаДПГ = ДПГ.НайтиПоИдентификатору(Идентификатор);
	// ---------------------------------------------------------------------------- 
	
	// группа
	Если (СтрокаДПГ.ЭтоГруппа) Тогда
		
		ДоступнаСменаРежимаСвертки 	= ПроверитьСостояниеВедомых(СтрокаДПГ);
		СостояниеГруппы 			= ПолучитьНастройкуРаскрытияГруппы(СтрокаДПГ.ИдентификаторГруппы);
		
		ПФ 				= Новый Структура("НаименованиеГруппы,ГруппаРазвернута,РежимГрузоперевозки,ДоступнаСменаРежимаСвертки", СтрокаДПГ.НаименованиеГруппы,СостояниеГруппы, Ложь,ДоступнаСменаРежимаСвертки);
		ПОВ 			= Новый ОписаниеОповещения("ОбработатьВводНаименованияГруппы",ЭтотОбъект, Новый Структура("Редактирование",Истина)); 
		
		ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВиртуальнойГруппы",ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	// параметр
	Если (НЕ СтрокаДПГ.ЭтоГруппа) Тогда
		
		Параметр = Элемент.ТекущиеДанные.Параметр;
		
		ИдентификаторСтрокиГруппы	= Неопределено;
		РодительПараметра 			= СтрокаДПГ.ПолучитЬРодителя();
		Если  РодительПараметра <> Неопределено тогда
			ИдентификаторСтрокиГруппы	= РодительПараметра.ПолучитьИдентификатор()
		КонецЕсли;
		
		// --- 
		ПараметрТолькоПросмотр = _ТолькоПросмотрПараметра(Параметр);
		СвойстваПараметра = CW_Мониторинг.СтруктураСвойствПараметра(Параметр);	
		Если (СвойстваПараметра.Ведомый) Тогда
			
			// проверяем ведущие на заполненность
			Результат = _ПроверитьЗаполнениеВедущих(Параметр,СвойстваПараметра.СписокВедущих);
			Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
				
				_УФК.ВывестиПредупреждение("Данный параметр является зависимым!");
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли; 
		Если (СвойстваПараметра.ДинамическийПараметр) Тогда
			
			_УФК.ВывестиПредупреждение("Динамические параметры не редактируются");
			Возврат;
			
		КонецЕсли;
		// --- 
		АдресОбъекта 	=  _АдресОбъекта();
		ВыбраннаяФорма 	= Неопределено;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Режим"						, "РедактированиеОбъекта");
		ПараметрыФормы.Вставить("Параметр"					, Параметр);
		ПараметрыФормы.Вставить("ИдентификаторСтрокиГруппы"	, ИдентификаторСтрокиГруппы);
		ПараметрыФормы.Вставить("АдресСвойствПараметра"		, ПоместитьВоВременноеХранилище(СвойстваПараметра,ЭтаФорма.УникальныйИдентификатор));
		ПараметрыФормы.Вставить("АдресОбъекта"				, АдресОбъекта);
		ПараметрыФормы.Вставить("ТолькоПросмотр"			, ПараметрТолькоПросмотр);
		ПараметрыФормы.Вставить("Значение"			        , СтрокаДПГ.Значение);
		
		//ХранениеПолногоЗначения  
		Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда
			Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда
				ПолноеЗначение = СохраняемоеПолноеЗначение.Получить(Параметр);
			КонецЕсли;
			ПолноеЗначение = ?(ПолноеЗначение=Неопределено, СтрокаДПГ.Значение, ПолноеЗначение);
			
			ПараметрыФормы.Вставить("ПолноеЗначение", ПолноеЗначение);
		КонецЕсли;
		//---ХранениеПолногоЗначения
		
		ПОВ = Новый ОписаниеОповещения("ОбработатьИзменениеПараметра",ЭтотОбъект,Новый Структура("СвойстваПараметра,Параметр",СвойстваПараметра,Параметр));
		
		Если СвойстваПараметра.ИспользоватьФормуВыбораОбъекта тогда
			
			Если Не ПараметрТолькоПросмотр Тогда
				ВыбраннаяФорма = СвойстваПараметра.ИмяФормыВыбора;
				
				ПараметрыФормы.Вставить("РежимВыбора"		,         Истина);
				ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",         Истина);
				
				Если СвойстваПараметра.ИспользуютсяДополнительныеЗначения Тогда
					ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец",Параметр));
				КонецЕсли;

			КонецЕсли;
			
		Иначе
			Если СвойстваПараметра.ИспользуетсяВнешняяОбработкаПередНачаломИзменения Тогда
				СтруктураПараметров = _ПО.ПолучитьИмяФормыНаСервере(Параметр, АдресОбъекта);
				ВыбраннаяФорма 		= "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
				
				ОбработчикНеИспользуется = Ложь;
				Если СтруктураПараметров.Свойство("НеИспользуется") Тогда
					ОбработчикНеИспользуется = СтруктураПараметров.НеИспользуется;
				КонецЕсли;

				Если СтруктураПараметров.Свойство("ТолькоПросмотр") Тогда
					Если  НЕ ПараметрыФормы.ТолькоПросмотр Тогда
						ПараметрыФормы.ТолькоПросмотр =  СтруктураПараметров.ТолькоПросмотр;
					КонецЕсли;
				КонецЕсли;
				
				Если СтруктураПараметров.Свойство("ПодключаемыйОбъект") Тогда
					ПараметрыФормы.Вставить("ПодключаемыйОбъект",СтруктураПараметров.ПодключаемыйОбъект);
				КонецЕсли; 	
				
				Если ОбработчикНеИспользуется ИЛИ 
					СтруктураПараметров.РежимОткрытия = 1 Тогда
					ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
				ИначеЕсли	СтруктураПараметров.РежимОткрытия = 0 Тогда
					ВыбраннаяФорма = СтруктураПараметров.ИмяФормы;
				КонецЕсли;

			Иначе
				ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
			КонецЕсли;

		КонецЕсли;
		
		Если ВыбраннаяФорма <> Неопределено Тогда
			ОткрытьФорму(ВыбраннаяФорма, ПараметрыФормы,ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры


&наКлиенте
Функция ПроверитьСостояниеВедомых(СтрокаДерева)
	
	ДоступностьСменыРежима = Истина;
	
	тЭлеметы = СтрокаДерева.ПолучитьЭлементы();
	ПроверитьСостояниеВедомыхРекурсивно(тЭлеметы, ДоступностьСменыРежима);
	
	Возврат ДоступностьСменыРежима;
	
КонецФункции

&наКлиенте
Процедура ПроверитьСостояниеВедомыхРекурсивно(тЭлеметы, ДоступностьСменыРежима)
	
	Если Не ДоступностьСменыРежима Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого стрЭлемент из тЭлеметы Цикл
		Если  стрЭлемент.ЭтоГруппа Тогда
			ЭлементСостояния = ДПГ_СостояниеСвертки.НайтиПоЗначению(стрЭлемент.ИдентификаторГруппы);
			Если ЭлементСостояния <> Неопределено Тогда
				Если ЭлементСостояния.Пометка Тогда
					ДоступностьСменыРежима = Ложь;
				КонецЕсли;
			КонецЕсли;
			Подчиненные = стрЭлемент.получитьЭлементы();
			ПроверитьСостояниеВедомыхРекурсивно(подчиненные, ДоступностьСменыРежима);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры


&НаСервере
Функция ПолучитьНастройкуРаскрытияГруппы(Идентификатор)
	
	мНайденныеСтроки = Объект.ГруппыПараметровЗаявки.НайтиСтроки(Новый Структура("Идентификатор",Идентификатор));
	
	Если мНайденныеСтроки.Количество() = 0 Тогда
		//Странно... группа есть, а строки нет
		//получим настройку из параметров
		
		CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"РазворачиватьДеревоПараметровЗаявок");		
	Иначе
		Возврат мНайденныеСтроки[0].Раскрывать;
	КонецЕсли;
	
КонецФункции


&НаСервере
Функция _ПроверитьЗаполнениеВедущих(Параметр,СписокВедущих)
	// --- 
	
	// контроллируем заполнение и единство
	ФлагОшибки = Ложь;
	ТекстОшибки = "";
	Для каждого ВедущийПГ Из СписокВедущих Цикл
		
		// проверяем параметр у переданных объектов
		МассивНепустыхЗначений = Новый Массив;
		
		ВедущийПараметр = ВедущийПГ.Значение;
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыЗаявки,"Параметр",ВедущийПараметр);
		Если СтрокаПараметра = Неопределено Тогда
			
			ЗначениеПараметра = Неопределено;
			
		Иначе
			
			ЗначениеПараметра = СтрокаПараметра.Значение;
			
		КонецЕсли; 
		Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			
			_сф.м_ДобавитьУникально(МассивНепустыхЗначений,ЗначениеПараметра);
			
		Иначе
			
			ФлагОшибки = Истина;
			ТекстОшибки = "";
			
		КонецЕсли; 
		
		
		// теперь если нет ошибки считаем количество
		// если не 1, то выдаём ошибку
		Если НЕ ФлагОшибки Тогда
			
			Если МассивНепустыхЗначений.Количество() <> 1 Тогда
				
				ФлагОшибки = Истина;
				ТекстОшибки = ""
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если ФлагОшибки Тогда
			
			// тут необходимо закрыть форму и вернуть описание ошибки
			ТекстОшибки = "Условия отбора для выбранного параметра ("""+Параметр.Наименование+""") требуют, чтобы было задано значение параметра """+ВедущийПараметр.Наименование+""".";
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

#КонецОбласти 

#Область СостояниеСвертки 

&НаСервере
Функция УстановитьСостояниеСверткиСтроки(ИдентификаторСтроки, ИдентификаторГруппы, Развернута=Истина)

	ЭлементСостояния = ДПГ_СостояниеСвертки.НайтиПоЗначению(ИдентификаторГруппы);
	Если (ЭлементСостояния = Неопределено) Тогда
		ЭлементСостояния = ДПГ_СостояниеСвертки.Добавить(ИдентификаторГруппы);
	КонецЕсли; 
	ЭлементСостояния.Представление 	= Формат(ИдентификаторСтроки,"ЧДЦ=; ЧН=; ЧГ=");
	ЭлементСостояния.Пометка 		= Развернута;

КонецФункции

&НаКлиенте
Процедура ДПГ_ВосстановитьСверткуДерево(Команда)
	
	ДПГ_ВосстановитьСостояниеСвертки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ВосстановитьСостояниеСвертки()
	
	тЭлементы = ДПГ.ПолучитьЭлементы();
	ДПГ_ВосстановитьСостояниеСверткиРекунсивно(тЭлементы);
		
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ВосстановитьСостояниеСверткиРекунсивно(тЭлементы)
	
	Для каждого тЭлемент Из тЭлементы Цикл
		
		тПодчиненные = тЭлемент.ПолучитьЭлементы();
		ДПГ_ВосстановитьСостояниеСверткиРекунсивно(тПодчиненные);
		
		ВосстановитьСостояниеСверткиСтроки(тЭлемент.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура ВосстановитьСостояниеСверткиДерева()
	
	Для каждого Стр Из ДПГ.ПолучитьЭлементы() Цикл
		ВосстановитьСостояниеСверткиСтроки(Стр.ПолучитьИдентификатор());
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьСостояниеСверткиСтроки(Идентификатор)
	
	СтрокаДерева 		= ДПГ.НайтиПоИдентификатору(Идентификатор);
	ЭлементСостояния 	= ДПГ_СостояниеСвертки.НайтиПоЗначению(СтрокаДерева.ИдентификаторГруппы);
	
	Если ЭлементСостояния <> Неопределено Тогда
		
		Если ЭлементСостояния.Пометка Тогда
			Элементы.ДПГ.Развернуть(СтрокаДерева.ПолучитьИдентификатор());
		Иначе
			Элементы.ДПГ.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
		конецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СохранитьСостояниеСверткиСтроки(ИдентификаторСтроки,Признак)
	// --- 
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (СтрокаДерева = Неопределено) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	// --- 
	СтрокиГрупп = Объект.ГруппыПараметровЗаявки.НайтиСтроки(Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
	Если (СтрокиГрупп.Количество() <> 0) Тогда
		СтрокаГруппы = СтрокиГрупп[0];
		СтрокаГруппы.Раскрывать = Признак;
	КонецЕсли; 
	// --- 
	ЭлементСостояния = ДПГ_СостояниеСвертки.НайтиПоЗначению(СтрокаДерева.ИдентификаторГруппы);
	Если (ЭлементСостояния = Неопределено) Тогда
		ЭлементСостояния = ДПГ_СостояниеСвертки.Добавить(СтрокаДерева.ИдентификаторГруппы);
	КонецЕсли; 
	ЭлементСостояния.Представление = Формат(ИдентификаторСтроки,"ЧДЦ=; ЧН=; ЧГ=");
	ЭлементСостояния.Пометка = Признак;
	
	// --- 
КонецФункции

// --- 

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	тЭлементы = ДПГ.ПолучитьЭлементы();
	СвернутьРекурсивно(тЭлементы); 
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРекурсивно(тЭлементы)
	
	Для Каждого тСтр Из тЭлементы Цикл
		тСтрЭлементы = тСтр.ПолучитьЭлементы();
		СвернутьРекурсивно(тСтрЭлементы);
		
		Элементы.ДПГ.Свернуть(тСтр.ПолучитьИдентификатор());
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	тЭлементы = ДПГ.ПолучитьЭлементы();
	Для Каждого тСтр Из тЭлементы Цикл
		Элементы.ДПГ.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

#Область ДобавлениеЭлементов 

&НаКлиенте
Процедура ДеревоПараметровГППередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПараметра",ЭтотОбъект); 
	
	ПарамерыФормыВыбора = Новый Структура;
	ПарамерыФормыВыбора.Вставить("ВыборГруппИЭлементов"	,ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПарамерыФормыВыбора.Вставить("Множественныйвыбор"	,Истина);

	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПарамерыФормыВыбора,Элемент,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПараметра(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
		
	Если (Ответ <> Неопределено) Тогда
		Если ТипЗнч(Ответ) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
			Ответ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответ);
		КонецЕсли;
		
		// если группа
		МассивДобавляемых = Новый Массив;
		ОдиночныйВыбор = Ответ.Количество() = 1;
		
		Для Каждого Параметр из Ответ Цикл
			
			// если группа
			Если (_ПараметрЯвляетсяГруппой(Параметр)) Тогда
				МассивДобавляемых = _ЭлементыГруппыПараметров(Параметр);
			Иначе
				МассивДобавляемых.Добавить(Параметр);
			КонецЕсли; 
			
		КонецЦикла;
		
		Если  ОдиночныйВыбор Тогда
			ДобавляемыйПараметр = Ответ[0];
			Если Не ДобавляемыйПараметрНовый(ДобавляемыйПараметр) Тогда
				// позиционируемся на выбранный элемент
				Идентификатор = _ИдентификаторСтрокиПараметра(ДобавляемыйПараметр);
				Если (Идентификатор <> Неопределено) Тогда
					Элементы.ДПГ.ТекущаяСтрока = Идентификатор;	
				КонецЕсли; 
				//_УФК.ВывестиПредупреждение("Параметр уже добавлен.");
				Возврат;
			КонецЕсли;
		КонецЕсли; 
		

		Для каждого ДобавляемыйПараметр Из МассивДобавляемых Цикл
			
			// проверяем, что параметр новый
			Если (ДобавляемыйПараметрНовый(ДобавляемыйПараметр)) Тогда
				
				ИдентификаторДобавленнойСтроки = _ДобавитьПараметр(ДобавляемыйПараметр);
				
				// ракрываем строку родителя, если свернута
				ДобавленнаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторДобавленнойСтроки);
				РодительДобавленнойСтроки = ДобавленнаяСтрока.ПолучитьРодителя();
				Если (РодительДобавленнойСтроки <> Неопределено) Тогда
					
					ИдентификаторРодителяДобавленнойСтроки = РодительДобавленнойСтроки.ПолучитьИдентификатор();
					Если (НЕ Элементы.ДПГ.Развернут(ИдентификаторРодителяДобавленнойСтроки)) Тогда
						Элементы.ДПГ.Развернуть(ИдентификаторРодителяДобавленнойСтроки);
						СохранитьСостояниеСверткиСтроки(ИдентификаторРодителяДобавленнойСтроки,Истина);
					КонецЕсли; 
					// --- 
					ДПГ_ТекущаяГруппа = РодительДобавленнойСтроки.ИдентификаторГруппы;
					
				Иначе
					
					ДПГ_ТекущаяГруппа = 0;
					
				КонецЕсли; 
				
				// позиционируемся на добавленный элемент
				Элементы.ДПГ.ТекущаяСтрока = ИдентификаторДобавленнойСтроки;
				// --- 
				ДПГ_ТекущийПараметр = ДобавленнаяСтрока.Параметр;
											
			КонецЕсли;
			
		КонецЦикла; 
		
		// --- 
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПараметрЯвляетсяГруппой(Параметр)
	// --- 
	
	Возврат(Параметр.ЭтоГруппа);
	
	// --- 
КонецФункции

&НаСервере
Функция _ЭлементыГруппыПараметров(ГруппаПараметров)
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.Ссылка В ИЕРАРХИИ(&Ссылка)
	               |	И CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", ГруппаПараметров);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат(ТЗ.ВыгрузитьКолонку("Ссылка"));
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ИдентификаторСтрокиПараметра(Параметр)
	// --- 
	
	ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Параметр);
	Если (ЭлементКартыПараметров = Неопределено) Тогда
		Сообщить("Для параметра """+Строка(Параметр)+""" в карте параметров не найден идентификатор строки.");
		Возврат(Неопределено);
	Иначе
		
		Возврат(Число(ЭлементКартыПараметров.Представление));
		
	КонецЕсли; 
	
	// --- 
КонецФункции
 

&НаКлиенте
Функция ДобавляемыйПараметрНовый(Параметр)
	// --- 
	
	Отбор = Новый Структура("Параметр",Параметр);
	СтрокиПараметра = Объект.ПараметрыЗаявки.НайтиСтроки(Отбор);
	Возврат(СтрокиПараметра.Количество()=0);
	
	// --- 
КонецФункции
  
&НаСервере
Функция ТекущийРодитель()
	// --- 
	
	Если (Элементы.ДПГ.ТекущаяСтрока <> Неопределено) Тогда
		
		ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
		ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		РодительТекущейСтроки = ТекущаяСтрока.ПолучитьРодителя();
		Если (РодительТекущейСтроки <> Неопределено) Тогда
			Возврат(РодительТекущейСтроки);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат(ДПГ);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДобавитьПараметр(Параметр)
	// --- 
	//Новый механизм
	ИдентификаторГруппыВладельца = Неопределено;
	//Новый механизм
	
	// добавляем в ТЧ параметров
	СтрокаПараметра = Объект.ПараметрыЗаявки.Добавить();
	СтрокаПараметра.Параметр = Параметр; 
	СтрокаПараметра.Значение = Параметр.ТипЗначения.ПривестиЗначение(Неопределено); 
	
	// добавляем в дерево
	Если (Элементы.ДПГ.ТекущаяСтрока <> Неопределено) Тогда
		ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
		ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (ТекущаяСтрока.ЭтоГруппа) Тогда
			ТР = ТекущаяСтрока;
		Иначе
			ТР = ТекущийРодитель();	
		КонецЕсли; 
		
		//Новый механизм
		Если ТР <> ДПГ Тогда
			ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
		КонецЕсли;
		//Новый механизм
		
	Иначе
		ТР = ТекущийРодитель();
	КонецЕсли; 
	
	//Новый механизм
	Если ИдентификаторГруппыВладельца <>  Неопределено Тогда
		ОтборСтрок = Новый Структура("Идентификатор",ТР.ИдентификаторГруппы);
		мСтрокиГрупп = Объект.ГруппыПараметровЗаявки.НайтиСтроки(ОтборСтрок);
		Если мСтрокиГрупп.Количество() > 0 Тогда
			СтрокаГруппы = мСтрокиГрупп[0];
			СтрокаПараметра.ИдентификаторВладельца = СтрокаГруппы.ИдентификаторГруппы; 	
		КонецЕсли;
	КонецЕсли; 
	//Новый механизм

	//ХранениеПолногоЗначения
	ДобавитьСохраняемоеПолноеЗначение(СтрокаПараметра.Параметр);
	//---ХранениеПолногоЗначения
	
	// --- 
	СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
	// заполняем строку дерева
	_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева,СтрокаПараметра);
	// записываем принадлежность параметра группе
	ГруппаСтроки = _ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева);
	_ДобавитьЭлементГруппы(Параметр, ГруппаСтроки);
	СтрокаДерева.ИдентификаторГруппы = ГруппаСтроки.Идентификатор;
	
	// записываем в карту 
	Идентификатор = СтрокаДерева.ПолучитьИдентификатор();
	// --- 
	ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Параметр);
	Если (ЭлементКартыПараметров = Неопределено) Тогда
		ЭлементКартыПараметров = КартаПараметровДерева.Добавить(Параметр);
	КонецЕсли; 
	ЭлементКартыПараметров.Представление = Формат(Идентификатор,"ЧЦ=10; ЧДЦ=; ЧН=0; ЧГ=");
	// --- 
	_ПроверитьГруппыПоИерархии(СтрокаДерева);	
	// --- 
	Возврат(Идентификатор);
	
	// --- 
КонецФункции

&НаСервере
Функция _ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева)
	// --- 
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтроки = Неопределено) Тогда
		СтрокаГруппы = Объект.ГруппыПараметровЗаявки[0];
	Иначе
		Отбор = Новый Структура("Идентификатор", РодительСтроки.ИдентификаторГруппы);
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки, Отбор);
	КонецЕсли; 
	
	Возврат(СтрокаГруппы);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ДобавитьЭлементГруппы(Элемент, СтрокаГруппы, НовыйПредыдущий=Неопределено)
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	Если (НовыйПредыдущий =  Неопределено) Тогда
		МассивВедомых.Добавить(Элемент);
	Иначе
		
		ИндексПредыдущего = МассивВедомых.Найти(НовыйПредыдущий);
		Если (ИндексПредыдущего <> Неопределено) Тогда
			МассивВедомых.Вставить(ИндексПредыдущего,Элемент);
		Иначе
			МассивВедомых.Добавить(Элемент);
		КонецЕсли; 
		
	КонецЕсли; 
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	Если (ТипЗнч(Элемент)=Тип("Число")) Тогда
		
		ДПГ_ТекущаяГруппа = Элемент;
		ДПГ_ТекущийПараметр = Неопределено;
		
	Иначе
		
		ДПГ_ТекущаяГруппа = СтрокаГруппы.Идентификатор;
		ДПГ_ТекущийПараметр = Элемент;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ПереместитьЭлементГруппы(Элемент, СтрокаГруппы, НовыйПредыдущий);
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	// --- 
	Если (НовыйПредыдущий = Неопределено ) Тогда
		
		ИндексЭлемента = МассивВедомых.Найти(Элемент);
		МассивВедомых.Удалить(ИндексЭлемента);
		МассивВедомых.Добавить(Элемент);
		
	Иначе
		
		ИндесНовогоПредыдущего = МассивВедомых.Найти(НовыйПредыдущий);
		ИндексЭлемента = МассивВедомых.Найти(Элемент);
		МассивВедомых.Удалить(ИндексЭлемента);
		МассивВедомых.Вставить(ИндесНовогоПредыдущего,Элемент);
		
	КонецЕсли; 
	// --- 
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _УдалитьЭлементГруппы(Элемент, СтрокаГруппы)
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	МассивВедомых.Удалить(МассивВедомых.Найти(Элемент));
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	
	// --- 
КонецПроцедуры
 
#КонецОбласти 

#Область РедактированиеЭлементов

&НаСервере
Функция _АдресОбъекта()

	ТаблицаПараметров = Объект.ПараметрыЗаявки.Выгрузить();
	ТаблицаПараметров.Колонки.Добавить("ХранилищеДанных"); 
	ТаблицаПараметров.Очистить(); 
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого СтрокаТаблицы из ТОбъект.ПараметрыЗаявки Цикл
		НоваяСтрока = ТаблицаПараметров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы); 
		
		НоваяСтрока.ХранилищеДанных = Новый ХранилищеЗначения(СтрокаТаблицы.ХранилищеДанных.Получить());
	КонецЦикла;
	
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Ссылка", 			Объект.Ссылка);
	СтруктураОбъекта.Вставить("ТаблицаПараметров", 	ТаблицаПараметров);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураОбъекта,ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция _ТолькоПросмотрПараметра(Параметр)
	
	ТолькоПросмотрПараметра = Истина;
	
	НаборПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	Попытка
		ТолькоПросмотрПараметра = НЕ НаборПрав["п_"+_сф.КлючПоСсылке(Параметр)].Редактирование;
	Исключение
		ТолькоПросмотрПараметра = Истина;
	КонецПопытки; 
	
	Возврат ТолькоПросмотрПараметра;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеПараметра(Ответ,ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если ТипЗнч(Ответ) <> Тип("Структура") И ТипЗнч(Ответ) <> Тип("Массив") Тогда
			//В случае если ответ форме не имеет тип структура, поместим его в структуру для последующей обработки
			Ответ = _ПО.ПолучитьСтруктуруОтветаВнешнейФормы(Ответ, ДополнительныеПараметры.Параметр);
		КонецЕсли;
		
		Если ТипЗнч(Ответ) <> Тип("Массив") Тогда
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Ответ);
		Иначе
			МассивПараметров = Ответ;
		КонецЕсли;

	 	
		Для каждого ОтветСтруктура из МассивПараметров Цикл
			
			Если (ОтветСтруктура.ПараметрИзменен) Тогда
				
				Если (ДополнительныеПараметры.СвойстваПараметра = Неопределено) Тогда
					СписокВедомых = Неопределено;
				Иначе	
					СписокВедомых = ДополнительныеПараметры.СвойстваПараметра.СписокВедомых;
				КонецЕсли; 
				// --- 
				Ответ = _ОбновитьПараметр(ОтветСтруктура, СписокВедомых);	
				Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
					
					ЭтаФорма.Модифицированность = Истина;
					ТребуетсяПолноеОбновление = Ложь;
					Ответ.Свойство("ПолноеОбновление",ТребуетсяПолноеОбновление);
					Если (ТребуетсяПолноеОбновление) Тогда
						
						ОбновитьДеревоПараметров();
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ОбновитьПараметр(СтруктураПараметра, СписокВедомых)
	// --- 
	
	Параметр = СтруктураПараметра.Параметр;
	// --- 
	КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	СП = КартаСвойств.Получить(Параметр);
	КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	НП = КартаПрав["п_"+_сф.КлючПоСсылке(Параметр)];
	// --- 
	ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Параметр);
	Если (ЭлементКартыПараметров = Неопределено) Тогда
		
		Сообщить("Для параметра """+Строка(Параметр)+""" в карте параметров не найден идентификатор строки.");
		ИдентификаторСтрокиДерева = Неопределено;
		
	Иначе
		
		ИдентификаторСтрокиДерева = Число(ЭлементКартыПараметров.Представление);
		
	КонецЕсли; 
	Если (ИдентификаторСтрокиДерева = Неопределено) Тогда
		
		// добавляем...
		Если (Элементы.ДПГ.ТекущаяСтрока <> Неопределено) Тогда
			ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
			ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
			Если (ТекущаяСтрока.ЭтоГруппа) Тогда
				ТР = ТекущаяСтрока;
			Иначе
				ТР = ТекущийРодитель();	
			КонецЕсли; 
		Иначе
			ТР = ТекущийРодитель();
		КонецЕсли; 
		// --- 
		СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
		
	Иначе
		
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);	
		
	КонецЕсли; 
	// --- 
	СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыЗаявки,Новый Структура("Параметр",Параметр));
	Если (СтруктураПараметра.Значение <> Неопределено) Тогда
		СтрокаПараметра.Значение = СтруктураПараметра.Значение;
	КонецЕсли; 
	Если (СтрокаПараметра.ЗначениеПлан <> Неопределено) Тогда
		СтрокаПараметра.ЗначениеПлан = СтруктураПараметра.ЗначениеПлан;
	КонецЕсли;
	Если (СтрокаПараметра.ЗначениеФакт <> Неопределено) Тогда
		СтрокаПараметра.ЗначениеФакт = СтруктураПараметра.ЗначениеФакт;
	КонецЕсли;
	Если (СтрокаПараметра.Примечание <> Неопределено) Тогда
		СтрокаПараметра.Примечание = СтруктураПараметра.Примечание;
	КонецЕсли;

	//ХранениеПолногоЗначения   
	Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда 
		ДобавитьСохраняемоеПолноеЗначение(Параметр, СтруктураПараметра.ПолноеЗначение);  
	КонецЕсли;
	//---ХранениеПолногоЗначения

	Если (СП.ЭтоКонтрольнаяДата) Тогда
		Если (ЗначениеЗаполнено(СтрокаПараметра.ЗначениеФакт)) Тогда
			СтрокаПараметра.Значение = СтрокаПараметра.ЗначениеФакт;
		Иначе
			СтрокаПараметра.Значение = СтрокаПараметра.ЗначениеПлан;
		КонецЕсли; 
	КонецЕсли; 
	// --- 
	_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева, СтрокаПараметра, СП, НП);
	// --- 
	Если (СписокВедомых <> Неопределено) Тогда
		Если (СписокВедомых.Количество() <> 0) Тогда
			
			Для каждого ЭлементСписка Из СписокВедомых Цикл
				
				ВедомыйПараметр = ЭлементСписка.Значение;
				// ---------------------------------------------------------------------------- 
				ВедомыйЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(ВедомыйПараметр);
				Если (ВедомыйЭлементКартыПараметров <> Неопределено) Тогда
					
					СвойстваВедомогоПараметра = CW_Мониторинг.СтруктураСвойствПараметра(ВедомыйПараметр);
					
					СтруктураВедомогоПараметра = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
					СтруктураВедомогоПараметра.Параметр 		= ВедомыйПараметр;
					СтруктураВедомогоПараметра.ПараметрИзменен 	= Истина;    
					СтруктураВедомогоПараметра.Значение 		= Новый(ВедомыйПараметр.ТипЗначения.Типы()[0]);    
					
					_ОбновитьПараметр(СтруктураВедомогоПараметра, СвойстваВедомогоПараметра.СписокВедомых);
					
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли; 
	КонецЕсли; 
	// ---
	// --- 
	// проверяем, не подключены ли к параметру обработчики изменения
	ТребуетсяПолноеОбновление = Ложь;
	Если (СП.ОбработкаИзменения) Тогда
		
		Если (ЗначениеЗаполнено(Параметр.ВнешняяОбработкаИзменения)) Тогда
			
			// --- 
			
			ОбработкаОбъект = _ПО.ПолучитьОбработку(Параметр.ВнешняяОбработкаИзменения);   
			
			Попытка
				ПараметрыПроцедуры = новый Структура;
				ПараметрыПроцедуры.Вставить("ВнешняяОбработка",	Параметр.ВнешняяОбработкаИзменения);
				ПараметрыПроцедуры.Вставить("Объект", 			Объект);
				ПараметрыПроцедуры.Вставить("Форма", 			ЭтаФорма);
				ПараметрыПроцедуры.Вставить("СтрокаПараметра", 	СтрокаПараметра);
				
				Результат = ОбработкаОбъект.ВыполнитьОбработкуИзмененияПараметра(ПараметрыПроцедуры); 
			Исключение
				//Поддержка старых версий обработок
				Результат = ОбработкаОбъект.ОбработкаИзмененияПараметра(Объект,ЭтаФорма,СтрокаПараметра);
			КонецПопытки;
			
			ОбработкаОбъект = Неопределено;
			// --- 
			Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
				
				// параметры
				ТаблицаПараметров = Неопределено;
				Результат.Свойство("ТаблицаПараметров",ТаблицаПараметров);
				Если (ТаблицаПараметров <> Неопределено) Тогда
					
					Для каждого Стр Из ТаблицаПараметров Цикл
						
						Отбор = Новый Структура("Параметр", Стр.Параметр);
						ЗаполняемаяСтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыЗаявки,Отбор);
						Если (ЗаполняемаяСтрокаПараметра = Неопределено) Тогда
							ЗаполняемаяСтрокаПараметра = Объект.ПараметрыЗаявки.Добавить();
							
							//ХранениеПолногоЗначения
							ДобавитьСохраняемоеПолноеЗначение(Стр.Параметр, Стр.Значение);
							//---ХранениеПолногоЗначения   
							
							ТребуетсяПолноеОбновление = Истина;
						КонецЕсли; 
						ЗаполнитьЗначенияСвойств(ЗаполняемаяСтрокаПараметра, Стр);
						Если (НЕ ТребуетсяПолноеОбновление) Тогда
							
							// находим строку дерева этого параметра и обновляем её
							ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Стр.Параметр);
							Если (ЭлементКартыПараметров = Неопределено) Тогда
								
								Сообщить("Для параметра """+Строка(Стр.Параметр)+""" в карте параметров не найден идентификатор строки.");
								ИдентификаторСтрокиДерева = Неопределено;
								
							Иначе
								
								ИдентификаторСтрокиДерева = Число(ЭлементКартыПараметров.Представление);
								
							КонецЕсли; 
							// --- 
							Если (ИдентификаторСтрокиДерева <> Неопределено) Тогда
								
								СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
								Если (СтрокаДерева <> Неопределено) Тогда
									СП = КартаСвойств.Получить(Стр.Параметр);
									НП = КартаПрав["п_"+_сф.КлючПоСсылке(Стр.Параметр)];
									_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева, ЗаполняемаяСтрокаПараметра, СП, НП);	
								КонецЕсли; 
								
							КонецЕсли; 
							
						КонецЕсли; 
						
					КонецЦикла; 
					
				КонецЕсли;
				
				// реквизиты
				СтруктураРеквизитов = Неопределено;
				Результат.Свойство("СтруктураРеквизитов",СтруктураРеквизитов);
				Если (СтруктураРеквизитов <> Неопределено) Тогда
					
					ЗаполнитьЗначенияСвойств(Объект, СтруктураРеквизитов);
					
				КонецЕсли; 
				
			Иначе
				
				Сообщить(_УФКС.ПредставлениеОшибки(Результат));
				
			КонецЕсли; 
			
			// --- 
			
		КонецЕсли; 
		
		// пересчитываем все дин. параметры
		ПересчитатьДинамическиеПараметры();	
		
	Иначе
		
		// просто пересчитываем параметры по текущему
		ПересчитатьДинамическиеПараметры(Параметр);	
		
	КонецЕсли; 
	
	Ответ = _УФКС.Ответ();
	Ответ.Вставить("ПолноеОбновление",ТребуетсяПолноеОбновление);
	Возврат(Ответ);
	
	// --- 
КонецФункции

&НаСервере
Функция ПересчитатьДинамическиеПараметры(ИзменившийсяПараметр=Неопределено)
	// --- 
	
	// пересчитываем и показываем
	КартаСвойствПараметров = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	ТаблицаДП = CW_Мониторинг.ДинамическиеПараметрыОбъекта(Объект,КартаСвойствПараметров,,Объект.ПараметрыЗаявки.Выгрузить());
	Если (ТаблицаДП.Количество() <> 0) Тогда
		КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	КонецЕсли; 
	Для каждого Стр Из ТаблицаДП Цикл
		
		// в ТЧ
		Отбор = Новый Структура("Параметр",Стр.Параметр);
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыЗаявки,Отбор);
		Если (СтрокаПараметра <> Неопределено) Тогда
			
			СтрокаПараметра.Значение = Стр.Значение;
			// --- 
			ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Стр.Параметр);
			Если (ЭлементКартыПараметров = Неопределено) Тогда
				
				Сообщить("Для параметра """+Строка(Стр.Параметр)+""" в карте параметров не найден идентификатор строки.");
				ИдентификаторСтрокиДерева = Неопределено;
				
			Иначе
				
				ИдентификаторСтрокиДерева = Число(ЭлементКартыПараметров.Представление);
				
			КонецЕсли;
			// --- 
			Если (ИдентификаторСтрокиДерева <> Неопределено) Тогда
				СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
				СП = КартаСвойствПараметров.Получить(Стр.Параметр);
				НП = КартаПрав["п_"+_сф.КлючПоСсылке(Стр.Параметр)];
				_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева, СтрокаПараметра, СП, НП);
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецФункции

#КонецОбласти 

#Область ДобавлениеГруппЭлементов

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	// спрашиваем название группы
	ПараметрыФормы 	= Новый Структура("НоваяГруппа,РежимГрузоперевозки,ДоступнаСменаРежимаСвертки", Истина, Ложь, Истина);
	ПОВ 			= Новый ОписаниеОповещения("ОбработатьВводНаименованияГруппы",ЭтотОбъект, Новый Структура()); 
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВиртуальнойГруппы",ПараметрыФормы,ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводНаименованияГруппы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		РедактированиеГруппы = Ложь;
		ДополнительныеПараметры.Свойство("Редактирование",РедактированиеГруппы);
		Если (РедактированиеГруппы = Неопределено ) Тогда
			РедактированиеГруппы = Ложь;
		КонецЕсли; 
	
		Если (РедактированиеГруппы) Тогда
			ИдентификаторСтроки = _ОбновитьГруппу(Элементы.ДПГ.ТекущаяСтрока,Ответ);
		Иначе
			ИдентификаторСтроки = _ДобавитьГруппу(Ответ);	
		КонецЕсли; 
		
		//Обнолвение пометок вышестоящий групп
		ОбновитьРаскрытиеВышеСтоящихГрупп(ИдентификаторСтроки, Ответ.ГруппаРазвернута);
	
		ИдентификаторГруппы = ДПГ.НайтипоИдентификатору(ИдентификаторСтроки).ИдентификаторГруппы;
		УстановитьСостояниеСверткиСтроки(ИдентификаторСтроки, ИдентификаторГруппы, Ответ.ГруппаРазвернута);
	//	ВосстановитьСостояниеСверткиСтроки(ИдентификаторСтроки);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРаскрытиеВышеСтоящихГрупп(ИдентификаторСтроки,ГруппаРазвернута)
	
	Если Не ГруппаРазвернута Тогда
		//ничего делать не нужно, свертка вышестоящией группы от этого не зависит;
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = ДПГ.НайтипоИдентификатору(ИдентификаторСтроки);

	ОбработатьСверткуРодителяРекурсивно(СтрокаДерева,ГруппаРазвернута);
	
КонецПроцедуры

&наКлиенте
Процедура ОбработатьСверткуРодителяРекурсивно(СтрокаДерева, ГруппаРазвернута)
	
	РодительГруппы = СтрокаДерева.ПолучитьРодителя();
	
	Если РодительГруппы <> Неопределено Тогда
		
		СтруктураПараметров = новый Структура("НаименованиеГруппы,ГруппаРазвернута",РодительГруппы.НаименованиеГруппы,ГруппаРазвернута);
		_ОбновитьГруппу(РодительГруппы.ПолучитьИдентификатор(),СтруктураПараметров);
		
		УстановитьСостояниеСверткиСтроки(РодительГруппы.ПолучитьИдентификатор(), РодительГруппы.ИдентификаторГруппы, ГруппаРазвернута);

		ОбработатьСверткуРодителяРекурсивно(РодительГруппы, ГруппаРазвернута)
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция _ОбновитьГруппу(ИдентификаторСтрокиДерева,СтруктураПараметров)
	// --- 
	
	Модифицированность = истина;
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
	СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
	// --- 
	СтрокаГруппы.Наименование 			= СтруктураПараметров.НаименованиеГруппы;
	СтрокаГруппы.Раскрывать 			= СтруктураПараметров.ГруппаРазвернута;
	// --- 
	_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы);
	// --- 
	_ПроверитьГруппыПоИерархии(СтрокаДерева);
	
	Возврат(ИдентификаторСтрокиДерева);
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ДобавитьГруппу(СтруктураПараметров)
	// --- 
	Модифицированность = истина;
	
	//Новый механизм
	ИдентификаторГруппыВладельца = Неопределено;
	//Новый механизм

	// создаем строку ТЧ
	СтрокаГруппы = Объект.ГруппыПараметровЗаявки.Добавить();
	СтрокаГруппы.Идентификатор 			= _ИдентификаторНовойГруппы();
	
	СтрокаГруппы.Наименование 			= СтруктураПараметров.НаименованиеГруппы;
	СтрокаГруппы.Раскрывать 			= СтруктураПараметров.ГруппаРазвернута;
	
	СтрокаГруппы.ИдентификаторыВедомых 	= ЗначениеВСтрокуВнутр(Новый Массив);
	// --- 
	// создаем строку дерева
	Если (Элементы.ДПГ.ТекущаяСтрока <> Неопределено) Тогда
		ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
		ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (ТекущаяСтрока.ЭтоГруппа) Тогда
			ТР = ТекущаяСтрока;
		Иначе
			ТР = ТекущийРодитель();	
		КонецЕсли; 
		
		//Новый механизм
		Если ТР <> ДПГ Тогда
			ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
		КонецЕсли;
		//Новый механизм
		
	Иначе
		ТР = ТекущийРодитель();
	КонецЕсли; 
	
	//Новый механизм
	СтрокаГруппы.ИдентификаторГруппы = Новый УникальныйИдентификатор;
	Если ИдентификаторГруппыВладельца <>  Неопределено Тогда
		ОтборСтрок = Новый Структура("Идентификатор",ИдентификаторГруппыВладельца);
		мСтрокиГрупп = Объект.ГруппыПараметровЗаявки.НайтиСтроки(ОтборСтрок);
		Если мСтрокиГрупп.Количество() > 0 Тогда
			СтрокаГруппыВладельца = мСтрокиГрупп[0];
			СтрокаГруппы.ИдентификаторВладельца = СтрокаГруппыВладельца.ИдентификаторГруппы; 	
		КонецЕсли;
	КонецЕсли;
	//Новый механизм
	
	// --- 
	СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
	// заполняем
	_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы);
	// добавляем в массив элементов родителя
	_ДобавитьЭлементГруппы(СтрокаГруппы.Идентификатор, _ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева));
	// --- 
	_ПроверитьГруппыПоИерархии(СтрокаДерева);
	// --- 
	Возврат(СтрокаДерева.ПолучитьИдентификатор());
	
	// --- 
КонецФункции

&НаСервере
Функция _ИдентификаторНовойГруппы()
	// --- 
	
	ТЗИ = Объект.ГруппыПараметровЗаявки.Выгрузить(,"Идентификатор");
	ТЗИ.Сортировать("Идентификатор Возр");
	ПоследнийИдентификатор = _сф.к_ПоследнийЭлемент(ТЗИ).Идентификатор;
	НовыйИдентификатор = ПоследнийИдентификатор+1;
	Возврат(НовыйИдентификатор);
	
	// --- 
КонецФункции
 

#КонецОбласти 

#Область ПодборПараметров

&НаКлиенте
Процедура ПодборПараметров(Команда)
	
	ПараметрыФормыПодбора = Новый Структура;
	ПараметрыФормыПодбора.Вставить("МножественныйВыбор"	, Истина);
	ПараметрыФормыПодбора.Вставить("РежимВыбора"		, Истина);
	ПараметрыФормыПодбора.Вставить("ЗакрыватьПриВыборе"	, Истина);
	
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ПослеЗакрытияФормыПодбораПараметра", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.CW_ПодборПараметровГрузоперевозок",ПараметрыФормыПодбора, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПодбораПараметра(ВыбранныеЗначения, ДополнительныеПараметры) Экспорт
	
	ОбработкаВыбораПараметра(ВыбранныеЗначения, Неопределено);

КонецПроцедуры



&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ПодборПараметровГрузоперевозки" И Параметр <> Неопределено) Тогда
		
		ОбработкаВыбораПараметра(Параметр, Неопределено);
		
	ИначеЕсли (ИмяСобытия = "ПараметрИзменен") Тогда 
		
		_ОбновитьСвойстваПапаметров();
		
	ИначеЕсли ИмяСобытия = "ОбновитьДеревоПараметров" и Параметр = Объект.Ссылка  Тогда
		
		ЭтаФорма.Прочитать();
		ОбновитьДеревоПараметров();
	
	ИначеЕсли ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
		
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	//Наличие прикрепленных файлов
	ИначеЕсли ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
		
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
		
	//Наличие прикрепленных файлов
	ИначеЕсли ИмяСобытия = "ЗаписьСправочника" Тогда
		
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			Журнал_ОбновитьСтрокиЖурналаНаСервере();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_ВариантыБюджетов" Тогда
		
		//Блокировка бюджета 
		ОбработатьСобытиеЗапись_ВариантыБюджетовНаСервере();
		//Блокировка бюджета

	КонецЕсли; 
	
КонецПроцедуры   

&НаСервере
Процедура ОбработатьСобытиеЗапись_ВариантыБюджетовНаСервере();

	УстановитьЦветФонаСрокаДеййствияНаСервере();
	
	БюджетУтвержден = РегистрыСведений.CW_УтверждениеБюджетов.ПолучитьБлокировкуБюджета(Объект.Ссылка, Объект.ВариантБюджета);
	Если БюджетУтвержден Тогда
		Элементы.СтатусУтверждения.Заголовок = CW_Грузоперевозки_Сервер._ПолучитьТексЗаголовкаСтатусаУтвержденияБюджета(ЭтаФорма); 
	Иначе
		Элементы.СтатусУтверждения.Заголовок = "Не утвержден";
	КонецЕсли;    
	
	
	ВыполнитьДействиеНаСервере(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
	
	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетРасходы");
	ВосстановитьСортировкуТаблицы("БюджетДоходы");
	//Сортировка бюджетов
	
КонецПроцедуры

//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()
	
	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
//Наличие прикрепленных файлов



#КонецОбласти 

#Область УдалениеЭлементов 

&НаКлиенте
Процедура ДПГПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	Идентификатор = Элементы.ДПГ.ТекущаяСтрока;
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(Идентификатор);
	// --- 
	Если (СтрокаДерева.УдалениеРазрешено) Тогда
	
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			
			Если (СтрокаДерева.ПолучитьЭлементы().Количество() <> 0) Тогда
				
				ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияУдаленияГруппы",ЭтотОбъект, Новый Структура()); 
				ПоказатьВопрос(ПОВ,"Группа будет удалена вместе с параметрами. Продолжить?", РежимДиалогаВопрос.ДаНет);
				
			Иначе
				
				УдалитьСтрокуДерева(Идентификатор);
				
			КонецЕсли; 
			
		Иначе
			
			УдалитьСтрокуДерева(Идентификатор);
			ЭтаФорма.Модифицированность=Истина;
			
		КонецЕсли; 
		
	Иначе
		
		_УФК.ВывестиПредупреждение("Недостаточно прав для данного действия");
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодтвержденияУдаленияГруппы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			УдалитьСтрокуДерева(Элементы.ДПГ.ТекущаяСтрока);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура УдалитьСтрокуДерева(Идентификатор)
	// --- 
	
	НоваяТекущаяСтрока = Неопределено;
	// --- 
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(Идентификатор);
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		КоллекцияСтрок = ДПГ.ПолучитьЭлементы();
	Иначе
		КоллекцияСтрок = РодительСтрокиДерева.ПолучитьЭлементы();
	КонецЕсли; 
	КоличествоЭлементовКоллекции = КоллекцияСтрок.Количество();
	Если (КоличествоЭлементовКоллекции > 1) Тогда
		
		// получаем индекс
		ИндексУдаляемойСтроки = КоллекцияСтрок.Индекс(СтрокаДерева);
		Если (ИндексУдаляемойСтроки <> КоличествоЭлементовКоллекции-1) Тогда
			НоваяТекущаяСтрока = КоллекцияСтрок[ИндексУдаляемойСтроки+1].ПолучитьИдентификатор();
		Иначе 
			НоваяТекущаяСтрока = КоллекцияСтрок[ИндексУдаляемойСтроки-1].ПолучитьИдентификатор();
		КонецЕсли; 
		
	Иначе
		
		Если (РодительСтрокиДерева <> Неопределено) Тогда
			
			НоваяТекущаяСтрока = РодительСтрокиДерева.ПолучитьИдентификатор();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// удаляем рекурсивно группы/параметры
	Результат = _УдалитьПараметрыРекурсивно(Идентификатор);
	Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
		
		// удаляем строку дерева
		_УдалитьСтрокуДерева(Идентификатор);
		
		Если (НоваяТекущаяСтрока <> Неопределено ) Тогда
			
			Элементы.ДПГ.ТекущаяСтрока = НоваяТекущаяСтрока;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _УдалитьПараметрыРекурсивно(ИдентификаторСтроки)
	// --- 
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		ЭлементДПГ = СтрокаДерева.ИдентификаторГруппы;
	Иначе
		ЭлементДПГ = СтрокаДерева.Параметр;
	КонецЕсли; 
	
	// удаляем из родителя
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		СтрокаГруппы = Объект.ГруппыПараметровЗаявки[0];
	Иначе
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор", РодительСтрокиДерева.ИдентификаторГруппы));
	КонецЕсли; 
	_УдалитьЭлементГруппы(ЭлементДПГ, СтрокаГруппы);
	
	// физически удаляем
	_УдалитьЭлементДПГ(ЭлементДПГ);
	// --- 
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Процедура _УдалитьЭлементДПГ(ЭлементДПГ)
	// --- 
	
	Если (ТипЗнч(ЭлементДПГ)=Тип("Число")) Тогда
		
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор", ЭлементДПГ));
		МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
		Для каждого Ведомый Из МассивВедомых Цикл
			
			_УдалитьЭлементДПГ(Ведомый);
			
		КонецЦикла; 
		// --- 
		Объект.ГруппыПараметровЗаявки.Удалить(Объект.ГруппыПараметровЗаявки.Индекс(СтрокаГруппы));
		
	Иначе
		
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыЗаявки,Новый Структура("Параметр",ЭлементДПГ));
		Объект.ПараметрыЗаявки.Удалить(Объект.ПараметрыЗаявки.Индекс(СтрокаПараметра));
		
		//ХранениеПолногоЗначения
		Если ЭлементДПГ.СохранятьПолноеЗначениеПараметра Тогда
			Соответствие = Новый Соответствие(СохраняемоеПолноеЗначение);
			Соответствие.Удалить(ЭлементДПГ); 
			СохраняемоеПолноеЗначение = Новый ФиксированноеСоответствие(Соответствие);
		КонецЕсли;
		//---ХранениеПолногоЗначения
	
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

#КонецОбласти 

#Область ПеремещениеЭлементов

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	СдвинутьСтроку(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	СдвинутьСтроку(1);
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьСтроку(Направление)
	// --- 
	
	ТекущаяСтрока = Элементы.ДПГ.ТекущаяСтрока;
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ТекущаяСтрока);
	РодительТекущейСтроки = СтрокаДерева.ПолучитьРодителя();
	Если (РодительТекущейСтроки = Неопределено) Тогда
		РодительТекущейСтроки = ДПГ;
		ГруппаРодитель = 0;
	Иначе
		ГруппаРодитель = РодительТекущейСтроки.ИдентификаторГруппы;	
	КонецЕсли; 
	// --- 
	КоллекцияСтрок = РодительТекущейСтроки.ПолучитьЭлементы();
	КоличествоСтрок = КоллекцияСтрок.Количество();
	Если (КоличествоСтрок = 1) Тогда
		Возврат;
	КонецЕсли; 
	ИндексТекущейСтроки = КоллекцияСтрок.Индекс(СтрокаДерева);
	// --- 
	// проверяем крайние положения
	// если уперлись - переносим в конец/начало
	Сдвиг = 0;
	ПредыдущееДействие = Неопределено;
	СледующееДействие = Неопределено;
	// --- 
	Если (ИндексТекущейСтроки = 0 И Направление=-1) Тогда
		
		Сдвиг = КоличествоСтрок-1; // с плюсом;
		ПредыдущаяСтрока = КоллекцияСтрок.Получить(КоличествоСтрок-1);
		Если (ПредыдущаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.Параметр;
		КонецЕсли; 
		
		
	ИначеЕсли (ИндексТекущейСтроки <> 0 И Направление=-1) Тогда 
		
		Сдвиг = -1;
		СледующаяСтрока = КоллекцияСтрок.Получить(ИндексТекущейСтроки+Сдвиг);
		Если (СледующаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторСледующейСтроки = СледующаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторСледующейСтроки = СледующаяСтрока.Параметр;
		КонецЕсли;
		
	ИначеЕсли (ИндексТекущейСтроки = КоличествоСтрок-1 И Направление=1) Тогда 
		
		 Сдвиг = -(КоличествоСтрок-1);
		 СледующаяСтрока = КоллекцияСтрок.Получить(0);
		 Если (СледующаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторСледующейСтроки = СледующаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторСледующейСтроки = СледующаяСтрока.Параметр;
		КонецЕсли;
		 
	ИначеЕсли (ИндексТекущейСтроки <> КоличествоСтрок-1 И Направление=1) Тогда 
		
		 Сдвиг = 1;
		 ПредыдущаяСтрока = КоллекцияСтрок.Получить(ИндексТекущейСтроки+Сдвиг);
		 Если (ПредыдущаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.Параметр;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Ответ = _ИзменитьПорядокСтроки(ГруппаРодитель, ТекущаяСтрока, ИдентификаторПредыдущейСтроки, ИдентификаторСледующейСтроки);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		КоллекцияСтрок.Сдвинуть(КоллекцияСтрок.Индекс(СтрокаДерева),Сдвиг);
		
	Иначе
		
		Сообщить(_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ИзменитьПорядокСтроки(ИдентификаторГруппыРодителя, ИдентификаторТекущейСтроки, ИдентификаторПредыдущейСтроки, ИдентификаторСледующейСтроки)
	// --- 
	
	Попытка
		
		Группа = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор",ИдентификаторГруппыРодителя));
		МассивЭлементов = ЗначениеИзСтрокиВнутр(Группа.ИдентификаторыВедомых);
		ТаблицаЭлементов = Новый ТаблицаЗначений;
		ТаблицаЭлементов.Колонки.Добавить("Идентификатор");
		Для каждого Элемент Из МассивЭлементов Цикл
			Нстр = ТаблицаЭлементов.Добавить();
			Нстр.Идентификатор = Элемент;
		КонецЦикла; 
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			СдвигаемоеЗначение = СтрокаДерева.ИдентификаторГруппы;
		Иначе
			СдвигаемоеЗначение = СтрокаДерева.Параметр;
		КонецЕсли; 
		СтрокаСдвигаемогоЗначения = _сф.к_НайтиСтроку(ТаблицаЭлементов, Новый Структура("Идентификатор",СдвигаемоеЗначение));
		// --- 
		Если (ИдентификаторПредыдущейСтроки <> Неопределено) Тогда
			
			ОтносительноеЗначение = ИдентификаторПредыдущейСтроки;
			//СтрокаДействия = _сф.к_НайтиСтроку(ТЧ, Новый Структура("Действие",ПредыдущееДействие));
			
		ИначеЕсли (ИдентификаторСледующейСтроки <> Неопределено) Тогда 
			
			ОтносительноеЗначение = ИдентификаторСледующейСтроки;
			
		КонецЕсли; 
		СтрокаОтносительногоЗначения = _сф.к_НайтиСтроку(ТаблицаЭлементов, Новый Структура("Идентификатор",ОтносительноеЗначение));
		Сдвиг = (ТаблицаЭлементов.Индекс(СтрокаОтносительногоЗначения)-ТаблицаЭлементов.Индекс(СтрокаСдвигаемогоЗначения));
		ТаблицаЭлементов.Сдвинуть(СтрокаСдвигаемогоЗначения,Сдвиг);
		// --- 
		МассивЭлементов=ТаблицаЭлементов.ВыгрузитьКолонку("Идентификатор");
		Группа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивЭлементов);
		
		
	Исключение
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции
 
#КонецОбласти 

#Область ДрагЭндДроп

&НаКлиенте
Процедура ДеревоПараметровГПНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если (Элементы.ДПГ.ВыделенныеСтроки.Количество() > 1) Тогда
		
		Выполнение = Ложь;
		ПоказатьПредупреждение(,"Множественное перетаскивание недоступно.");
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПараметровГППеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка=Ложь;
	// --- 
	
	// проверим, что действие, в которое мы вставляем не находится ниже по иерархии вставляемого действия
	// сформируем массив действий по иерархии от текущего вверх
	МассивСтрок = Новый Массив;
	ИдентификаторТекущейСтроки = Строка;
	МассивИдентификаторов = ПараметрыПеретаскивания.Значение;
	Если (ИдентификаторТекущейСтроки = Неопределено) Тогда
		
		НовыйРодитель = 0;
		НовыйПредыдущий = Неопределено;
		ВставкаРазрешена = Истина;
		
	Иначе
		
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			МассивСтрок.Добавить(СтрокаДерева.ИдентификаторГруппы);	
			НовыйРодитель = СтрокаДерева.ИдентификаторГруппы;
			НовыйПредыдущий = Неопределено;
		Иначе
			НовыйПредыдущий = СтрокаДерева.Параметр;
			НовыйРодительСтрока = СтрокаДерева.ПолучитьРодителя();
			Если (НовыйРодительСтрока <>  Неопределено) Тогда
				НовыйРодитель = НовыйРодительСтрока.ИдентификаторГруппы;
			Иначе
				НовыйРодитель = 0;
			КонецЕсли; 
		КонецЕсли; 
		
		РодительСтроки = СтрокаДерева.ПолучитьРодителя();
		Пока (РодительСтроки <> Неопределено) Цикл
			
			// всегда группа
			МассивСтрок.Добавить(РодительСтроки.ИдентификаторГруппы);
			РодительСтроки = РодительСтроки.ПолучитьРодителя();
			
		КонецЦикла; 
		// ---
		МассивПеремещаемыхСтрок = Новый Массив;
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			ПеремещаемаяСтрокаДерева = ДПГ.НайтиПоИдентификатору(Идентификатор);
			Если (ПеремещаемаяСтрокаДерева.ЭтоГруппа) Тогда
				МассивПеремещаемыхСтрок.Добавить(ПеремещаемаяСтрокаДерева.ИдентификаторГруппы);
			Иначе
				МассивПеремещаемыхСтрок.Добавить(ПеремещаемаяСтрокаДерева.Параметр);	
			КонецЕсли; 
		КонецЦикла; 
		// --- 
		ВставкаРазрешена = Истина;
		Для каждого ПеремещаемаяСтрока Из МассивПеремещаемыхСтрок Цикл
			
			Если (МассивСтрок.Найти(ПеремещаемаяСтрока) <> Неопределено) Тогда
				
				ВставкаРазрешена = Ложь;
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	Если (НЕ ВставкаРазрешена) Тогда
		
		ПоказатьПредупреждение(,"Вставка в иерархию с нарушением логической целостности.");
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	Ответ = _ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель,НовыйПредыдущий);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		Модифицированность = истина;
	
		// удаляем вставляемые действия
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			
			_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЦикла; 
		
		Если (ИдентификаторТекущейСтроки = Неопределено) Тогда
			
			ПолноеОбновление = Истина;
			_ОбновитьДеревоПараметров();
			ПересчитатьДинамическиеПараметры();
			ВосстановитьСостояниеСверткиДерева();
			
		Иначе
			
			// переформировываем элементы текущего действия
			ПолноеОбновление = Ложь;
			СтрокаДерева = ДПГ.НайтиПоИдентификатору(Строка);
			Если (СтрокаДерева.ЭтоГруппа) Тогда
				
				ТекущаяСтрока = Строка;
				ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
				
			Иначе
				
				СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
				Если (СтрокаРодителя = Неопределено) Тогда
					
					// обновить все
					// тут бы процедуру анализа новых ... TODO
					ПолноеОбновление = Истина;
					_ОбновитьДеревоПараметров();
					ПересчитатьДинамическиеПараметры();
					ВосстановитьСостояниеСверткиДерева();
					
				Иначе
					
					ТекущаяСтрока = СтрокаРодителя.ПолучитьИдентификатор();
					ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			
		КонецЕсли; 
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ВыполнитьПеремещениеСтрок(МассивИдентификаторовСтрок, НовыйРодитель, НовыйПредыдущий=Неопределено)
	// --- 
	
	Попытка
		
		Для каждого ИдентификаторСтроки Из МассивИдентификаторовСтрок Цикл
			
			Результат = _УстановитьРодителяСтроки(ИдентификаторСтроки, НовыйРодитель, НовыйПредыдущий);
			Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
				
				Возврат(_УФКС.Ответ(1,_УФКС.ПредставлениеОшибки(Результат)));
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Функция _УстановитьРодителяСтроки(ИдентификаторСтроки, НовыйРодитель, НовыйПредыдущий=Неопределено)
	// --- 
	
	Строка = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (Строка.ЭтоГруппа) Тогда
		ПеремещаемоеЗначение = Строка.ИдентификаторГруппы;
	Иначе
		ПеремещаемоеЗначение = Строка.Параметр;
	КонецЕсли; 
	
	// --- 
	
	ГруппаСтарыйРодитель = _ОпределитьСтрокуГруппуСтрокиДерева(Строка);
	ГруппаНовыйРодитель = _сф.к_НайтиСтроку(Объект.ГруппыПараметровЗаявки,Новый Структура("Идентификатор",НовыйРодитель));
	
	Если (ГруппаСтарыйРодитель.Идентификатор <> НовыйРодитель) Тогда
		
		Попытка
			
			// удаляем из старого родителя
			_УдалитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаСтарыйРодитель);
			
			// добавляем в новый
			_ДобавитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаНовыйРодитель, НовыйПредыдущий);
			
			//Новый механизм
			УстановитьНовогоВладельца(ИдентификаторСтроки,ГруппаНовыйРодитель.ИдентификаторГруппы);
			//Новый механизм
			
		Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			Сообщить(ТекстОшибки);
			// --- 
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецПопытки; 
		
	Иначе
		
		// перемещение в пределах родителя
		_ПереместитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаНовыйРодитель, НовыйПредыдущий);
		
	КонецЕсли; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции


//Новый механизм
&наСервере
Процедура УстановитьНовогоВладельца(ИдентификаторСтроки, ИдентификаторГруппы)
	
	ИдентификаторВладельца = ИдентификаторГруппы;
	
	Строка = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Строка.ЭтоГруппа Тогда
		мСтроки = Объект.ГруппыПараметровЗаявки.НайтиСтроки(Новый Структура("Идентификатор",Строка.ИдентификаторГруппы));
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0];	
		КонецЕсли;
		Если СтрокаДанных.ИдентификаторГруппы = ИдентификаторГруппы Тогда
			ИдентификаторВладельца = Неопределено;
		КонецЕсли;
	Иначе
		мСтроки = Объект.ПараметрыЗаявки.НайтиСтроки(Новый Структура("Параметр",Строка.Параметр));
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0];	
		КонецЕсли;
	КонецЕсли; 
	
	СтрокаДанных.ИдентификаторВладельца = ИдентификаторВладельца;
	
КонецПроцедуры
//Новый механизм

&НаСервере
Процедура _УдалитьСтрокуДерева(ИдентификаторСтроки)
	// --- 
	
	ИерархическийКонтроль = Ложь;
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		РодительСтрокиДерева = ДПГ;
	Иначе
		ИерархическийКонтроль=Истина;
	КонецЕсли; 
	РодительСтрокиДерева.ПолучитьЭлементы().Удалить(СтрокаДерева);
	Если (ИерархическийКонтроль) Тогда
		_ПроверитьГруппыПоИерархии(РодительСтрокиДерева);
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область Копипаста

&НаКлиенте
Процедура ДПГ_ПереместитьНаУровеньВверх(Команда)
	
	ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
	ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
	Если (РодительСтроки <> Неопределено) Тогда
		
		РодительРодителя = РодительСтроки.ПолучитьРодителя();
		НовыйРодитель = ТекущаяСтрока.ИдентификаторГруппы;
		
		// --- 
		МассивИдентификаторов = Новый Массив;
		МассивИдентификаторов.Добавить(ИдентификаторТекущейСтроки);
		Ответ = _ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель);
		Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
			
			// удаляем вставляемые действия
			Для каждого Идентификатор Из МассивИдентификаторов Цикл
				
				_УдалитьСтрокуДерева(Идентификатор);
				
			КонецЦикла; 
			
			// переформировываем элементы текущего действия
			//ПолноеОбновление = Ложь;
			//Если (РодительРодителя = Неопределено) Тогда
				
			ПолноеОбновление = Истина;
			_ОбновитьДеревоПараметров();
			ПересчитатьДинамическиеПараметры();
			ВосстановитьСостояниеСверткиДерева();
			
			//Иначе
			//	
			//	ВыполнитьПодгрузкуСтрок(РодительРодителя.ПолучитьИдентификатор());
			//	
			//КонецЕсли; 
						
		Иначе
			
			ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		// --- 
		
	//Иначе
	//	
	//	_УФК.ВывестиПредупреждение("");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Строка_Вырезать(Команда)
	
	// снимаем признак нахождения в буфере
	Для каждого Стр Из ДПГ_БуферОбмена Цикл
		ИдентификаторСтроки = Число(Стр.Представление);
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если (СтрокаДерева <> Неопределено) Тогда
			СтрокаДерева.Буфер = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	ДПГ_БуферОбмена.Очистить();
	// --- 
	Для каждого Стр Из Элементы.ДПГ.ВыделенныеСтроки Цикл
		
		ВыделеннаяСтрока = ДПГ.НайтиПоИдентификатору(Стр);
		ВыделеннаяСтрока.Буфер = Истина;
		Если (ВыделеннаяСтрока.ЭтоГруппа) Тогда
			ДПГ_БуферОбмена.Добавить(ВыделеннаяСтрока.ИдентификаторГруппы, Формат(Стр,"ЧДЦ=; ЧН=; ЧГ="));
		Иначе
			ДПГ_БуферОбмена.Добавить(ВыделеннаяСтрока.Параметр, Формат(Стр,"ЧДЦ=; ЧН=; ЧГ="));	
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Строка_Вставить(Команда)
	
	МассивСтрок = Новый Массив;
	ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
	// --- 
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		МассивСтрок.Добавить(СтрокаДерева.ИдентификаторГруппы);	
		НовыйРодитель = СтрокаДерева.ИдентификаторГруппы;
		НовыйПредыдущий = Неопределено;
	Иначе
		НовыйПредыдущий = СтрокаДерева.Параметр;
		НовыйРодительСтрока = СтрокаДерева.ПолучитьРодителя();
		Если (НовыйРодительСтрока <>  Неопределено) Тогда
			НовыйРодитель = НовыйРодительСтрока.ИдентификаторГруппы;
		Иначе
			НовыйРодитель = 0;
		КонецЕсли; 
	КонецЕсли; 
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Пока (РодительСтроки <> Неопределено) Цикл
		
		// всегда группа
		МассивСтрок.Добавить(РодительСтроки.ИдентификаторГруппы);
		РодительСтроки = РодительСтроки.ПолучитьРодителя();
		
	КонецЦикла; 
	// ---
	МассивПеремещаемыхСтрок = ДПГ_БуферОбмена.ВыгрузитьЗначения();
	// --- 
	ВставкаРазрешена = Истина;
	Для каждого ПеремещаемаяСтрока Из МассивПеремещаемыхСтрок Цикл
		
		Если (МассивСтрок.Найти(ПеремещаемаяСтрока) <> Неопределено) Тогда
			
			ВставкаРазрешена = Ложь;
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	Если (НЕ ВставкаРазрешена) Тогда
		
		ПоказатьПредупреждение(,"Вставка в иерархию с нарушением логической целостности.");
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	МассивИдентификаторов = Новый Массив;
	Для каждого ЭлементБуфера Из ДПГ_БуферОбмена Цикл
		
		МассивИдентификаторов.Добавить(Число(ЭлементБуфера.Представление));
		
	КонецЦикла; 
	// --- 
	Ответ = _ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель,НовыйПредыдущий);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		// удаляем вставляемые действия
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			
			_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЦикла; 
		
		// очищаем буфер
		ДПГ_БуферОбмена.Очистить();
		
		// переформировываем элементы текущего действия
		ПолноеОбновление = Ложь;
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			
			ТекущаяСтрока = ИдентификаторТекущейСтроки;
			ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
			
		Иначе
			
			СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
			Если (СтрокаРодителя = Неопределено) Тогда
				
				// обновить все
				// тут бы процедуру анализа новых ... TODO
				ПолноеОбновление = Истина;
				_ОбновитьДеревоПараметров();
				ПересчитатьДинамическиеПараметры();
				ВосстановитьСостояниеСверткиДерева();
				
			Иначе
				
				ТекущаяСтрока = СтрокаРодителя.ПолучитьИдентификатор();
				ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ПредопределеннеПараметры

&НаКлиенте
Процедура Форма_ПерезаполнитьПредопределенныеПараметры(Команда)
	
	ЗначениеРеквизита 	=	Объект[ЭтаФорма.ТекущийЭлемент.Имя];
	ИмяРеквизита  		= ЭтаФорма.ТекущийЭлемент.Имя;
	
	Если ИмяРеквизита = "Контрагент" Тогда
		ИмяРеквизита = "Клиент";
	КонецЕсли;
	
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(ЗначениеРеквизита, ИмяРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Реквизит, ИмяРеквизита)
	// --- 
	
	Если _ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Реквизит, ИмяРеквизита) Тогда
		
		ОбновитьДеревоПараметров();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаСервере
Функция _ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Реквизит, ИмяРеквизита)
	// --- 
	
	СП = ПолучитьПредопределенныеПараметры(Реквизит,ИмяРеквизита);
	Если (_УФКС.ВыполненоУспешно(СП)) Тогда
		Результат = ДобавитьПредопределенныеПараметры(СП.Параметры);
		Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
			Возврат(Истина);
		КонецЕсли;
	КонецЕсли; 
	Возврат(Ложь);
	
	// --- 
КонецФункции

&НаСервере
Функция ПолучитьПредопределенныеПараметры(Субъект, ИмяРеквизита)
	// --- 
	
	Возврат(CW_Мониторинг.ПолучитьПредопределенныеПараметры(Субъект,ИмяРеквизита, УникальныйИдентификатор));
	
	// --- 
КонецФункции

&НаСервере
Функция ДобавитьПредопределенныеПараметры(АдресПараметров)
	// --- 
	
	Возврат(CW_Мониторинг.ДобавитьПредопределенныеПараметры(Объект,АдресПараметров));
	
	// --- 
КонецФункции


#КонецОбласти 

#Область Заполнение 

&НаКлиенте
Процедура ДПГ_ПерезаполнитьПараметрыПоШаблону(Команда)
	
	ДиалогЗаполненияПоТипу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогЗаполненияПоТипу()
	
	Если (ЗначениеЗаполнено(Объект.ТипПеревозки)) Тогда
		
		Если (Объект.ПараметрыЗаявки.Количество() <> 0) Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВариантаЗаполненияПоТипу",ЭтотОбъект);
			ОткрытьФорму("Справочник.CW_Грузоперевозки.Форма.ФормаЗаполненияПоТипуПеревозки",,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе
			
			ЗаполнитьПараметрыПоТипуПеревозки(0);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
  

&НаКлиенте
Процедура ОбработкаВыбораВариантаЗаполненияПоТипу(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		
		ЗаполнитьПараметрыПоТипуПеревозки(Ответ);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыПоТипуПеревозки(ВариантЗаполнения)

	ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(); 
	_ЗаполнитьПараметрыПоТипуПеревозки(ВариантЗаполнения);
	_ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.ТипПеревозки, "ТипПеревозки");
	
	ЭтаФорма.Модифицированность = Истина;
	
	ОбновитьДеревоПараметров();
	
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьПараметрыПоТипуПеревозки(ВариантЗаполнения)
	// --- 
	
	// удаляем несоответствующие параметры
	Если (ВариантЗаполнения = 1) Тогда
		
		МассивУдаляемых = Новый Массив;
		Для каждого СтрПараметр Из Объект.ПараметрыЗаявки Цикл
			
			Отбор = Новый Структура("Параметр", СтрПараметр.Параметр);
			СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ТипПеревозки.ПараметрыЗаявки, Отбор);
			Если (СтрокаПараметра = Неопределено) Тогда
				МассивУдаляемых.Добавить(СтрПараметр);
			КонецЕсли; 
			
		КонецЦикла;
		_сф.к_УдалитьЭлементыПоМассиву(Объект.ПараметрыЗаявки, МассивУдаляемых);
		
	КонецЕсли; 
	
	// переносим иерархию
	Если (ВариантЗаполнения = 0 ИЛИ ВариантЗаполнения = 1) Тогда
		
		// очищаем текущие группы
		Объект.ГруппыПараметровЗаявки.Очистить();
		// копируем группы из типа 
		Объект.ГруппыПараметровЗаявки.Загрузить(Объект.ТипПеревозки.ГруппыПараметровЗаявки.Выгрузить());
		
	КонецЕсли; 
	
	// переносим параметры из типа
	ТаблицаПараметров = Объект.ТипПеревозки.ПараметрыЗаявки.Выгрузить();
	Для каждого СтрПараметр Из ТаблицаПараметров Цикл
		
		Отбор = Новый Структура("Параметр", СтрПараметр.Параметр);
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыЗаявки, Отбор);
		Если (СтрокаПараметра = Неопределено) Тогда
			
			// добавляем
			Нстр = Объект.ПараметрыЗаявки.Добавить();
			Нстр.Параметр = СтрПараметр.Параметр;
			Нстр.Значение = СтрПараметр.Параметр.ТипЗначения.ПривестиЗначение(Неопределено); 
			
			//Новый механизм
			Нстр.ИдентификаторВладельца = СтрПараметр.ИдентификаторВладельца;
			//Новый механизм	
			
			//ХранениеПолногоЗначения
			ДобавитьСохраняемоеПолноеЗначение(СтрПараметр.Параметр);
			//---ХранениеПолногоЗначения
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

// --- 
#КонецОбласти

// ---------------------------------------------------------------------------- 

#Область Бюджеты 

#Область ВерсияБюджета 

&НаКлиенте
Процедура БюджетТекущаяВерсияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетВыбратьИзСписка"));
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетТекущаяВерсияПриИзменении(Элемент)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
	
	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетРасходы");
	ВосстановитьСортировкуТаблицы("БюджетДоходы");
	//Сортировка бюджетов
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетТекущаяВерсияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетВыбрать"));
	
КонецПроцедуры

#КонецОбласти 

#Область Расходы

&НаКлиенте
Процедура БюджетЗатратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетДобавить",Новый Структура("Элемент,Копирование",Элемент,Копирование)));
		
КонецПроцедуры

&НаКлиенте
Процедура БюджетЗатратыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетОткрыть",Новый Структура("Элемент,ВыбраннаяСтрока,Поле",Элемент,ВыбраннаяСтрока,Поле)));
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетЗатратыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетОткрыть",Новый Структура("Элемент",Элемент)));
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетЗатратыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ВыделенныеСтроки = Элементы.БюджетРасходы.ВыделенныеСтроки;
	ПередУдалениемБюджета(ВыделенныеСтроки, "БюджетРасходы");
	
КонецПроцедуры 


&НаКлиенте
Процедура БюджетЗатратыПослеУдаления(Элемент)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетРасходыОбновитьИтоги"));

	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетРасходы");
	//Сортировка бюджетов
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетЗатратыОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетРасходыОбновить"));
	
	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетРасходы");
	//Сортировка бюджетов
	
КонецПроцедуры

#КонецОбласти 



&НаКлиенте
Процедура ПередУдалениемБюджета(ВыделенныеСтроки, ИмяТаблицы)

	ДополнительныеПараметры = Новый Структура;   
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", 	ВыделенныеСтроки);
	ДополнительныеПараметры.Вставить("ИмяТаблицы", 			ИмяТаблицы);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьУдалениеБюджета", ЭтотОбъект, ДополнительныеПараметры);
	
	CW_БюджетированиеКлиент.ПередУдалениемБюджета(ЭтотОбъект,Оповещение);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПродолжитьУдалениеБюджета(Ответ,  ДополнительныеПараметры) Экспорт
	Если Ответ = Неопределено
		или Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;   
	
	Текст = БюджетПередУдалениемНаСервере(ДополнительныеПараметры); 
	Если Не ПустаяСтрока(Текст) Тогда
		ПоказатьПредупреждение(, Текст);
	КонецЕсли; 
	
КонецПроцедуры   

&НаСервере
Функция БюджетПередУдалениемНаСервере(ДополнительныеПараметры)
	
	Возврат CW_Бюджетирование.ВыполнитьУдалениеСтатьиБюдежта(ЭтаФорма, ДополнительныеПараметры);

КонецФункции




#Область Доходы

&НаКлиенте
Процедура БюджетДоходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетДобавить",Новый Структура("Элемент,Копирование",Элемент,Копирование)));
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетОткрыть",Новый Структура("Элемент,ВыбраннаяСтрока,Поле",Элемент,ВыбраннаяСтрока,Поле)));
		
КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетОткрыть",Новый Структура("Элемент",Элемент)));

КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ВыделенныеСтроки = Элементы.БюджетДоходы.ВыделенныеСтроки;
	ПередУдалениемБюджета(ВыделенныеСтроки, "БюджетДоходы");
	
КонецПроцедуры 


&НаКлиенте
Процедура БюджетДоходыПослеУдаления(Элемент)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетДоходыОбновитьИтоги"));
	
	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетДоходы");
	//Сортировка бюджетов

КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходыОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетДоходыОбновить"));
	
	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетДоходы");
	//Сортировка бюджетов
	
КонецПроцедуры

#КонецОбласти

#Область Сервис

#Область ЗаполнениеБюджета 

&НаКлиенте
Процедура ЗаполнитьБюджет(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(0,"Скопировать из грузоперевозки");
	СписокВыбора.Вставить(1,"Подключаемые обработки заполнения");
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВариантаЗаполненияБюджета",ЭтотОбъект, Новый Структура()); 
	СписокВыбора.ПоказатьВыборЭлемента(ПОВ,"Вариант заполнения", Элементы.ЗаполнитьПоПрайсам);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВариантаЗаполненияБюджета(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ.Значение = 0) Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораГрузоперевозки",ЭтотОбъект, Новый Структура()); 
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("РежимВыбора",Истина);
			ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора",ПараметрыФормы,,Истина,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе
			
			// получаем список обработок заполнения бюджета
			Ответ = _ОбработкиЗаполненияБюджета();
			Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
				
				Для каждого Стр Из Ответ.Обработки Цикл
					
					//СП = _ПараметрыЗаполнения();
					
					Если (Стр.Интерактив) Тогда
						
						// открываем форму
						ИмяФормыНастроек = _ИмяФормыНастроекЗаполнения(Стр.Обработка);
						ПФ = _ПараметрыЗаполнения(Стр.Обработка);
						ПОВ = Новый ОписаниеОповещения("ОбработкаЗаполненияБюджета",ЭтотОбъект);
						ОткрытьФорму(ИмяФормыНастроек,ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
						
					Иначе
						
						// неинтерактивно
						ОбработкаЗаполненияБюджета(_ЗаполнитьНеинтерактивно(Стр.Обработка));
						
					КонецЕсли; 
					
				КонецЦикла; 
				
			Иначе
				
				_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
				Возврат;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ОбработкаЗаполненияБюджета(Ответ,ДополнительныеПараметры=Неопределено) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
			
			_УФК.ВывестиПредупреждение("Ошибка заполнения: "+_УФКС.ПредставлениеОшибки(Ответ));
			
		Иначе
			
			ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
			
			//Сортировка бюджетов
			ВосстановитьСортировкуТаблицы("БюджетРасходы");
			ВосстановитьСортировкуТаблицы("БюджетДоходы");
			//Сортировка бюджетов
			
		КонецЕсли;
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ОбработкиЗаполненияБюджета()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъекты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	               |ГДЕ
	               |	CW_ПодключаемыеОбъекты.ТипВнешнегоОбъекта = Значение(Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка)
	               |	И CW_ПодключаемыеОбъекты.Вид = &Вид
	               |	И CW_ПодключаемыеОбъекты.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ПодключаемыеОбъекты.НеИспользуется = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Вид", "ЗаполнениеБюджета");
	// --- 
	МассивОбработок = Новый Массив;
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из ТЗ Цикл
		
		СО = Новый Структура("Обработка,Интерактив",Стр.Ссылка,Ложь);
		Отбор = Новый Структура("ТипФормы","ФормаНастроекЗаполнения");
		СтрокаФормы = _сф.к_НайтиСтроку(Стр.Ссылка.ФормыОбъекта,Отбор);
		Если (СтрокаФормы <> Неопределено) Тогда
			
			СО.Интерактив = Истина;
			
		КонецЕсли; 
		МассивОбработок.Добавить(СО);
		
	КонецЦикла; 
	Если (МассивОбработок.Количество()=0) Тогда
		Возврат(_УФКС.Ответ(1,"Обработок заполнения не обнаружено"));
	Иначе
		Ответ = _УФКС.Ответ();
		Ответ.Вставить("Обработки",МассивОбработок);
		Возврат(Ответ);
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция _ПараметрыЗаполнения(ОбработкаЗаполнения)
	// --- 
	
	СП = Новый Структура;
	СП.Вставить("Грузоперевозка",Объект.Ссылка);
	СП.Вставить("ВерсияБюджета",БюджетТекущаяВерсия);
	СП.Вставить("Обработка",ОбработкаЗаполнения);
	
	Возврат(СП);
	
	// --- 
КонецФункции

&НаСервере
Функция _ЗаполнитьНеинтерактивно(ОбработкаЗаполнения)
	// --- 
	
	СП = _ПараметрыЗаполнения(ОбработкаЗаполнения);
	Обработка = _ПО.ПолучитьОбработку(ОбработкаЗаполнения);
	Ответ = Обработка.ЗаполнитьБюджет(СП);
	Возврат(Ответ);
	
	// --- 
КонецФункции

&НаСервере
Функция _ИмяФормыНастроекЗаполнения(ОбработкаЗаполнения)
	// --- 
	
	// подключаем обработку, вдруг ещё не подключена
	_ПО.ПодключитьОбработку(ОбработкаЗаполнения);
	Возврат(_ПО.ПолучитьПолноеИмяФормыПоТипу(ОбработкаЗаполнения,"ФормаНастроекЗаполнения"));
	
	// --- 
КонецФункции


#КонецОбласти 

#КонецОбласти 

#КонецОбласти 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПОВ_БазоваяЛогика = Новый ОписаниеОповещения("ПриОткрытииБазоваяЛогика",ЭтотОбъект);
	
	Если (РежимКопирования) Тогда
		
		ПОВ_Отказ = Новый ОписаниеОповещения("ОбработкаКопированияОтказ",ЭтотОбъект);
		ПОВ_Обработка = Новый ОписаниеОповещения("ОбработкаКопированияБюджета",ЭтотОбъект,Новый Структура("ПОВ_БазоваяЛогика,ПОВ_Отказ",ПОВ_БазоваяЛогика,ПОВ_Отказ));
		// --- 
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаКопированияБюджета",ЭтотОбъект, Новый Структура()); 
		ПФ = Новый Структура("ОбъектКопирования,УИД",ОбъектКопирования,ЭтаФорма.УникальныйИдентификатор);
		ОткрытьФорму("ОбщаяФорма.CW_ФормаКопированияБюджетаПоЗаявке",ПФ,,,,,ПОВ_Обработка,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

		
	Иначе
		
		ВыполнитьОбработкуОповещения(ПОВ_БазоваяЛогика);
		
	КонецЕсли;
	
	
	ДПГ_ВосстановитьСостояниеСвертки();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКопированияБюджета(Ответ,ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ = Неопределено) Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ_Отказ);
		Возврат;
		
	Иначе
		
		Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
			
			// сохраняем список вариантов 
			Для каждого Элемент Из Ответ.ВариантыБюджетов Цикл
				
				Если (Элемент.Пометка) Тогда
					ВариантыБюджетов.Добавить(Элемент.Значение);	
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		// --- 
		РежимКопирования = Ложь;
		Попытка
			//ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/ИнициализацияФормы"));
			ЭтаФорма.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКопированияОтказ(Ответ,ДополнительныеПараметры) Экспорт
	// --- 
	
	ПОВ_БазоваяЛогика = Новый ОписаниеОповещения("ПриОткрытииБазоваяЛогика",ЭтотОбъект);
	ВыполнитьОбработкуОповещения(ПОВ_БазоваяЛогика);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииБазоваяЛогика(Ответ,ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Объект.Ссылка.Пустая() И НЕ Объект.ТипПеревозки.Пустая()) Тогда
		ЗаполнитьПараметрыПоТипуПеревозки(0);
	КонецЕсли; 
	// формируем дерево
	ОбновитьДеревоПараметров();
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура ТипПеревозкиПриИзменении(Элемент) 
	
	ДиалогЗаполненияПоТипу();
	_УправлениеЭлементамиФормы();
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.ТипПеревозки, "ТипПеревозки");
	
	ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ИнициализацияФормы",Новый Структура("ИмяСеансовойНастройки","ПоследняяНастройкаЗаявки")));
	ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ИнициализацияНастроек"));
	ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ОбновитьДанные"));
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СтатусПодтвержденияПриИзменении(Элемент)
	
	Если (ЗначениеЗаполнено(Объект.СтатусПодтверждения) И НЕ ЗначениеЗаполнено(Объект.ФактическаяДатаПодтверждения)) Тогда
		Объект.ФактическаяДатаПодтверждения = ТекущаяДата();
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КонтрагентОткрытие(Элемент, СтандартнаяОбработка)
	
	Если (ПолучитьФункциональнуюОпциюФормы("CW_ИспользованиеCRM")) Тогда
		
	    // получаем настройку пользователя
		ИспользоватьСобственнуюФорму = (CW_Настройки.ПолучитьНастройкуПользователя( , "ИспользуемаяФормаКонтрагента") <> 0);
		Если (ИспользоватьСобственнуюФорму) Тогда
			
			СтандартнаяОбработка = Ложь;
			// --- 
			Если (ЗначениеЗаполнено(Объект.Контрагент)) Тогда
				ПФ = Новый Структура("ВидФормы,Ссылка","ФормаКонтрагента",Объект.Контрагент);
				ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина);	
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоОткрытие(Элемент, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//// --- 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура МенеджерПродажОткрытие(Элемент, СтандартнаяОбработка)
	
	Если (ПолучитьФункциональнуюОпциюФормы("CW_ИспользованиеCRM")) Тогда
		
	    // получаем настройку пользователя
		ИспользоватьСобственнуюФорму = (CW_Настройки.ПолучитьНастройкуПользователя( , "ИспользуемаяФормаКонтрагента") <> 0);
		Если (ИспользоватьСобственнуюФорму) Тогда
			
			СтандартнаяОбработка = Ложь;
			// --- 
			Если (ЗначениеЗаполнено(Объект.МенеджерПродаж)) Тогда
				ПФ = Новый Структура("Ключ",Объект.МенеджерПродаж);
				ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина);	
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
Процедура КлиентОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	Если (ЗначениеЗаполнено(Объект.Клиент)) Тогда
		ПФ = Новый Структура("ВидФормы,Ссылка","ФормаКонтрагента",Объект.Клиент);
		ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина);	
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьСобытие(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаСозданияСобытия",ЭтотОбъект, Новый Структура()); 
	ПоказатьВопрос(ПОВ,"Добавить содержание заявки как событие?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаСозданияСобытия(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			Если (НЕ ЗначениеЗаполнено(Объект.Содержание)) Тогда
				
				ПоказатьПредупреждение(,"Содержание не заполнено.");
				
			ИначеЕсли (НЕ ЗначениеЗаполнено(Объект.Контрагент)) Тогда 
				
				ПоказатьПредупреждение(,"Не указан клиент"); 
				
			Иначе		
				
				ПФ = _ПараметрыФормыСобытия();
				ОткрытьФорму("Справочник.CW_События.Форма.ФормаЭлемента",ПФ);
				//_СоздатьСобытиеПоСодержанию();
				//ПоказатьПредупреждение(,"Событие создано.");
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПараметрыФормыСобытия()
	// --- 
	
	ПФ = Новый Структура;
	ДанныеЗаполнения = Новый Структура("ДатаСобытия,ТипСобытия,Владелец,КонтактноеЛицо,Описание,ОбъектСобытия");
	ДанныеЗаполнения.ДатаСобытия = Объект.ДатаОбращения;
	ДанныеЗаполнения.ТипСобытия = Объект.ТипОбращения;
	ДанныеЗаполнения.Владелец = Объект.Контрагент;
	//ДанныеЗаполнения.КонтактноеЛицо = Объект.КонтактноеЛицо;
	ДанныеЗаполнения.Описание = Объект.Содержание;
	ДанныеЗаполнения.ОбъектСобытия = Объект.Ссылка;
	// --- 
	ПФ.Вставить("ЗначенияЗаполнения",ДанныеЗаполнения);
	Возврат(ПФ);
	
	// --- 
КонецФункции
 

&НаСервере
Процедура СоздатьСобытиеПоСодержаниюНаСервере()
	
	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.УстановитьHTML(Объект.Содержание, Новый Структура);
	
	СтруктураСобытия = Справочники.CW_События.ПоучитьСтруктуруСобытия();
	СтруктураСобытия.ДатаСобытия 	= Объект.ДатаОбращения;
	СтруктураСобытия.ТипСобытия 	= Объект.ТипОбращения;
	СтруктураСобытия.Владелец 		= Объект.Контрагент;
	СтруктураСобытия.ОбъектСобытия 	= Объект.Ссылка;  
	СтруктураСобытия.Сообщение 		= ФорматированныйДокумент;

	Справочники.CW_События.СоздатьСобытие(СтруктураСобытия);

КонецПроцедуры

&НаКлиенте
Процедура МаршрутПриИзменении(Элемент)
	
	Если (ЗначениеЗаполнено(Объект.Маршрут)) Тогда
		
		Если (_МаршрутСоответствуетТипуПеревозки(Объект.Маршрут,Объект.ТипПеревозки)) Тогда
			ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.Маршрут, "Маршрут");
		Иначе
			Объект.Маршрут = Неопределено;
			ПоказатьПредупреждение(,"Маршрут не соответствует указанному типу перевозки.");
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузПриИзменении(Элемент)
	
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.Груз, "Груз");

КонецПроцедуры

&НаКлиенте
Процедура ТипоразмерПриИзменении(Элемент)
	
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.Типоразмер, "Типоразмер");

КонецПроцедуры

&НаСервереБезКонтекста
Функция _МаршрутСоответствуетТипуПеревозки(Маршрут,ТипПеревозки)
	// --- 
	
	Если (Маршрут.ОграничениеПоТипамПеревозок) Тогда
		
		Если (НЕ ЗначениеЗаполнено(ТипПеревозки)) Тогда
			
			Возврат(Ложь);
			
		Иначе
			
			Если (Маршрут.ТипыПеревозок.Найти(ТипПеревозки,"ТипПеревозки") <> Неопределено) Тогда
				Возврат(Истина);
			Иначе
				Возврат(Ложь);
			КонецЕсли; 
			
		КонецЕсли; 
		
	Иначе
		
		Возврат(Истина);
		
	КонецЕсли;  
	
	// --- 
КонецФункции

&НаКлиенте
Процедура МаршрутНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.CW_МаршрутыГрузоперевозок.ФормаВыбора",Новый Структура("ТекущийТипПеревозки,РежимВыбора",Объект.ТипПеревозки,Истина),Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти

//Создание заказа
&НаКлиенте
Процедура СоздатьЗаказПоТекущейЗаявке(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо записать заявку!");
		Возврат;
	КонецЕсли;
		
	ПараметрыЗаказа = ПолучитьПараметрыФормированияЗаказа();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьФормированиеЗаказа", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CW_СозданиеЗаказа", ПараметрыЗаказа, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормированияЗаказа()
	
	Результат = Новый Структура;
	Результат.Вставить("Заявка", 				Объект.Ссылка);
	Результат.Вставить("Количество", 			Объект.КоличествоПеревозок);
	Результат.Вставить("ТипПеревозки", 			Объект.ТипПеревозки);
	Результат.Вставить("РежимСозданиеЗаказа", 	Истина);
	Результат.Вставить("ДоступенРежимНеСоздаватьГрузоперевозки", Истина);
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования") Тогда
		
		Результат.Вставить("ВариантБюжетаЗаявки", Объект.ВариантБюджета);
		Результат.Вставить("КопироватьБюджет", Истина);
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьФормированиеЗаказа(Ответ, Параметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьФормированиеЗаказаНаСервереВФоне(Ответ);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатСозданияЗаказа", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатСозданияЗаказа(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент","/Обновить",Неопределено));
	
		СтрПараметров = Новый Структура;
		СтрПараметров.Вставить("Ключ", ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата));
		
		УстановитьОтборЗаказов();
		УстановитьЗаголовокЗакладкиЗаказы();
		
		ОткрытьФорму("Справочник.CW_Заказы.ФормаОбъекта", СтрПараметров, ЭтаФорма);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Заказ не сформирован!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка создания заказа");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПродолжитьФормированиеЗаказаНаСервереВФоне(ПараметрыПроцедуры)
	
	Если НЕ ГрузоперевозкиИнициализированы Тогда
		// инициализируем
		ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ИнициализацияФормы",Новый Структура("ИмяСеансовойНастройки","ПоследняяНастройкаЗаявки")));
		ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ИнициализацияНастроек"));
		ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ОбновитьДанные"));
		// --- 
		ГрузоперевозкиИнициализированы = Истина;
	КонецЕсли;  
	
	Если ЭтоАдресВременногоХранилища(ПараметрыПроцедуры.АдресВариантовБюжетаЗаявки) Тогда
		СписокВариантовБюджета = ПолучитьИзВременногоХранилища(ПараметрыПроцедуры.АдресВариантовБюжетаЗаявки);   
	КонецЕсли; 
	
	ПараметрыПроцедуры.Вставить("СписокВариантовБюджета", 		СписокВариантовБюджета); 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Создание заказа по заявке";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_Заявки.СформироватьЗаполнитьЗаказПоЗаявке",ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции
//Создание заказа

//Создание грузоперевозок
&НаКлиенте
Процедура ДобавитьГрузоперевозокиСписком(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаписиЗаказа", ЭтотОбъект);
	Если Объект.Ссылка.Пустая() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(ОписаниеОповещения, "Текущий заказ будет записан. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаписиЗаказа(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	
	ПараметрыЗаказа = ПолучитьПараметрыОткрытияФормыСозданияЗаказов();
	ПараметрыЗаказа.Вставить("РежимСозданияГрузоперевозок", Истина);
	ПараметрыЗаказа.Вставить("Количество",  1);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьСозданиеГрузоперевозок", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CW_СозданиеЗаказа", ПараметрыЗаказа, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОткрытияФормыСозданияЗаказов()
	
	Результат = Новый Структура;
	Результат.Вставить("Заказ", 	 			ПредопределенноеЗначение("Справочник.CW_Заказы.ПустаяСсылка"));
	Результат.Вставить("Заявка", 		 		Объект.Ссылка);
	Результат.Вставить("ТипПеревозки", 	 		Объект.ТипПеревозки);
	Результат.Вставить("РежимСозданиеЗаказа",	Ложь);
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования") Тогда
		
		Результат.Вставить("ВариантБюжетаЗаявки", 	Объект.ВариантБюджета);
		Результат.Вставить("КопироватьБюджет", 		Истина);
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ПродолжитьСозданиеГрузоперевозок(Ответ, Параметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьСозданиеГрузоперевозокНаСервереВФоне(Ответ);
	
	Дополнительныепараметры = Новый Структура;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатСозданияГрузоперевозок", ЭтотОбъект, Ответ);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьСозданиеГрузоперевозокНаСервереВФоне(ПараметрыПроцедуры)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Создание грузоперевозок";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;

	Если ЭтоАдресВременногоХранилища(ПараметрыПроцедуры.АдресВариантовБюжетаЗаявки) Тогда
		СписокВариантовБюджета = ПолучитьИзВременногоХранилища(ПараметрыПроцедуры.АдресВариантовБюжетаЗаявки);   
	КонецЕсли; 
	
	ПараметрыПроцедуры.Вставить("СписокВариантовБюджета", 		СписокВариантовБюджета);	
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_Заявки.СформироватьЗаполнитьЗаказПоЗаявке",ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции  

&НаКлиенте
Процедура ОбработатьРезультатСозданияГрузоперевозок(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент","/Обновить",Неопределено));
		
		ПоказатьОповещениеПользователя("Создание грузоперевозок",,"Создано "+Формат(Дополнительныепараметры.Количество,"ЧДЦ=0")+" грузоперевозок");
		
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка создания грузоперевозок!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка создания грузоперевозок");
		
	КонецЕсли;
	
КонецПроцедуры
//Создание грузоперевозок


&НаСервере
Процедура УстановитьОтборПоГруппеПользователя()
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	Если  ГруппаПользователя = ПредопределенноеЗначение("Справочник.CW_ГруппыПользователей.Администраторы") 
		ИЛИ ГруппаПользователя.ПолныеПрава  Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиГруппы  = ГруппаПользователя.ХранилищеФильтраЗаказов.Получить();
	Если НастройкиГруппы <> Неопределено Тогда
		СписокЗаказы.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиГруппы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокЗакладкиЗаказы()
	
	КоличествоЗаказов = Справочники.CW_Заказы.ПолучитьКоличествоЗаказовПоЗаявке(Объект.Ссылка);
	Элементы.СтраницаЗаказы.Заголовок = "Заказы" + ?(КоличествоЗаказов=0, ""," ("+Формат(КоличествоЗаказов,"ЧН=; ЧГ=0")+")");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказыВЖурнале(Команда)
	
	МассивЗаказов = ПолучитьМассивЗаказовОбъета();
	
	СтруктураПараметров = Новый Структура("РежимОткрытия,МассивДоступных","ОтборПоСписку", МассивЗаказов);
	ОткрытьФорму("Обработка.CW_ЖурналЗаказов.Форма.Форма", СтруктураПараметров, ЭтаФорма, Истина);

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивЗаказовОбъета()
	
	Возврат Справочники.CW_Заказы.ПолучитьМассивЗаказовПоЗаявке(Объект.Ссылка);
	
КонецФункции

//Ограничение выбора менеджеров
&НаКлиенте
Процедура ВыбратьИзСпискаДействующихМенеджеров(Команда)
	
	МассивДействующиеМенеджеры = ПолучитьМассивДействующиеМенеджеровНаСервере();

	Если МассивДействующиеМенеджеры.Количество() <> 0 Тогда
		СтандартнаяОбработка = Ложь;
		СтруктураОтбора = Новый Структура("Ссылка", МассивДействующиеМенеджеры);
		
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("Отбор", СтруктураОтбора);
		ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
		ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
		ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяРеквизита", Этаформа.ТекущийЭлемент.Имя);
		
		Оповещение = Новый ОписаниеОповещения("ПродолжитьВыборМенеджера", ЭтаФорма, ДополнительныеПараметры);
		
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыФормыВыбора, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДействующиеМенеджеровНаСервере()
	Возврат РегистрыСведений.CW_ДействующиеМенеджеры.ПолучитьМассивДействующиеМенеджеров();
КонецФункции

&НаКлиенте
Процедура ПродолжитьВыборМенеджера(РезльтатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезльтатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект[ДополнительныеПараметры.ИмяРеквизита] = РезльтатВыбора;
	
КонецПроцедуры
//Ограничение выбора менеджеров


//Подсистема.ЛогистическиеСтатусы
&НаКлиенте
Процедура ЛогистическийСтатусОбновить(Команда)
	
	ВыполнитьРасчетЛогистическогоСтатусаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРасчетЛогистическогоСтатусаНаСервере()
	
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	CW_ЛогистическиеСтатусыСервер.ПослеЗаписиНаСервере(ЭтаФорма);
	
КонецПроцедуры
//Подсистема.ЛогистическиеСтатусы


//Обновление статусов обектов
&НаКлиенте
Процедура ОбновитьСтатусыОбъектов(СтруктураДанных, ДополнительныеПараметры) Экспорт
	
	Журнал_ОбновитьСтрокиЖурналаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Журнал_ОбновитьСтрокиЖурналаНаСервере()
	
	МассивСсылок = Справочники.CW_Заказы.ПолучитьМассивГрузоперевозокЗаказа(Объект.Ссылка);
	ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ОбновитьДанные", МассивСсылок));

КонецПроцедуры
//Обновление статусов обектов


//Блокировка бюджета
&НаКлиенте
Процедура ЗаблокированТекстНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	Отбор = Новый Структура;
	Отбор.Вставить("Объект", Объект.Ссылка);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",Отбор);

	ОткрытьФорму("РегистрСведений.CW_ИсторияУтверждениеБюджетов.ФормаСписка",ПараметрыФормы, ЭтаФорма,Истина);

КонецПроцедуры
//Блокировка бюджета  

//Подбор грузоперевозок   

&НаКлиенте
Процедура ВыборГрузопереовозки(Команда)
	
	ОткрытьФормуВыбораГрузоперевозок(Ложь, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ПодборГрузопереовзок(Команда) 

	ОткрытьФормуВыбораГрузоперевозок(Истина, Ложь);	
	
КонецПроцедуры   

&НаКлиенте
Процедура ОткрытьФормуВыбораГрузоперевозок(МножественныйВыбор, ЗакрыватьПриВыборе)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Клиент", 			Объект.Контрагент);
	СтруктураОтбора.Вставить("ТипПеревозки", 	Объект.ТипПеревозки); 
	СтруктураОтбора.Вставить("Заявка", 			ПредопределенноеЗначение("Справочник.CW_Заявки.ПустаяСсылка")); 
	
	ПараметрыФормыПодбора = Новый Структура;
	ПараметрыФормыПодбора.Вставить("РежимВыбора", 			Истина);
	ПараметрыФормыПодбора.Вставить("МножественныйВыбор", 	МножественныйВыбор);
	ПараметрыФормыПодбора.Вставить("ЗакрыватьПриВыборе", 	ЗакрыватьПриВыборе);
	
	ПараметрыФормыПодбора.Вставить("Отбор", СтруктураОтбора); 

	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора", ПараметрыФормыПодбора, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	Если ВРег(ИсточникВыбора.ИмяФормы)  = ВРег("Справочник.Пользователи.Форма.ФормаСписка") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		ВыбранноеЗначение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение);	
	КонецЕсли; 
	
	// по заявке AFR-240195
	//Тип отличный от грузоперевозок не обрабатываем 
	Если ВыбранноеЗначение.Количество() > 0 Тогда 
		Если ТипЗнч(ВыбранноеЗначение[0]) <> Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			Возврат;
		Конецесли;
	КонецЕсли;
	// по заявке AFR-240195
	
	Если ВыбранноеЗначение.Количество() > 5 Тогда
		РезультатВыполнения =  ОбработатьВыборНаСервереВФоне(ВыбранноеЗначение);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатДобавленияГрузоперевозок", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	Иначе
		//меньше 5-ти грузопереозок обрабатываем без фона
		ОбработатьВыборНаСервере(ВыбранноеЗначение);	
		
		ПоказатьОповещениеПользователя("Добавление грузоперевозок к заказу",,"Выполнено",,СтатусОповещенияПользователя.Информация);
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент","/Обновить",Неопределено));
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьВыборНаСервере(ВыбранноеЗначение)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Заявка",	Объект.Ссылка);
	ПараметрыПроцедуры.Вставить("МассивГрузоперевозок",	ВыбранноеЗначение);
	
	Справочники.CW_Заявки.ДобавитьГрузоперевозки(ПараметрыПроцедуры);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьВыборНаСервереВФоне(ВыбранноеЗначение)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Добавление грузопереовзок к заказу";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= Ложь; 

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Заявка",	Объект.Ссылка);
	ПараметрыПроцедуры.Вставить("МассивГрузоперевозок",	ВыбранноеЗначение);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_Заявки.ДобавитьГрузоперевозки",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатДобавленияГрузоперевозок(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ПоказатьОповещениеПользователя("Добавление грузоперевозок к заказу",,"Выполнено",,СтатусОповещенияПользователя.Информация);
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент","/Обновить",Неопределено));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Документы не сформированы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка добавления грузоперевозок");
	КонецЕсли;
	
КонецПроцедуры
//Подбор грузоперевозок

 //Суммирование значений колонок
&НаКлиенте
Процедура СуммаПоВыделеннымСтрокам(Команда)

	ИмяТаблицы 		= Этаформа.ТекущийЭлемент.Имя; 
	ТаблицаФормы 	= Этаформа[ИмяТаблицы];   

	Если Элементы[ИмяТаблицы].ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтркутраПараметров = CW_Грузоперевозки_Клиент.ПолучитьСтруктуруИтоговТаблицыФормы(Этаформа, ИмяТаблицы);	 
	
	CW_Грузоперевозки_Клиент.ОткрытьФормуВычисленияЗначений(СтркутраПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруИтоговДинамическогоСпискаНаСервере(ИмяТаблицы)
	
	Возврат CW_Грузоперевозки_Сервер.ПолучитьСтруктуруИтоговДинамическогоСписка(ЭтаФорма, ИмяТаблицы);
	
КонецФункции
 //Суммирование значений колонок

 //РаботаСАрхивомОбъектов
&НаКлиенте
Процедура ВыводитьАрхивныеПриИзменении(Элемент)
	
	Если ГрузоперевозкиИнициализированы Тогда
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент","/Обновить",Неопределено));  
	КонецЕсли;
	
	УстановитьПараметрыДинамическогОСписка();
	
КонецПроцедуры   

&НаСервере
Процедура УстановитьПараметрыДинамическогОСписка()
	
	СписокЗаказы.Параметры.УстановитьЗначениеПараметра("ПоказатьАрхивные", ВыводитьАрхивные);

КонецПроцедуры
//РаботаСАрхивомОбъектов

//Работа с буфером обмена 
&НаКлиенте
Процедура СкопироватьВБуферОбмена(Команда) 
	
	ВыделенныеСтроки = Элементы.Журнал.ВыделенныеСтроки;
	МассивСсылок = ПолучитьМассивСсылокВыделенныхСтрок(ВыделенныеСтроки);
	
	СкопироватьНаСервере(МассивСсылок);
	
	CW_РаботаСБуферомОбменаКлиент.ОповеститьОКопированииСтрокВБуферОбмена(ЭтаФорма, МассивСсылок.Количество());
	
КонецПроцедуры      

 &НаКлиенте
Функция ПолучитьМассивСсылокВыделенныхСтрок(Знач ВыделенныеСтроки)
	
	МассивСсылок = Новый Массив;
	
	Для Каждого ИдентификаторСтроки из  ВыделенныеСтроки Цикл
		ВыделеннаяСтрока = Журнал_Данные.НайтиПоИдентификатору(ИдентификаторСтроки);
		МассивСсылок.Добавить(ВыделеннаяСтрока.Ссылка);
	КонецЦикла;
	
	Возврат МассивСсылок;

КонецФункции

&НаСервере
Процедура СкопироватьНаСервере(ПараметрКоманды) 
	
	CW_РаботаСБуферомОбмена.СкопироватьВБуферОбмена(ПараметрКоманды, ПараметрКоманды[0].Метаданные().Имя);
	
КонецПроцедуры   

//Работа с буфером обмена


//Копирование грузоперевозок&НаКлиенте 
&НаКлиенте
Процедура СкопироватьГрузоперевозки(Команда)  
	
	ВыделенныеСтроки = Элементы.Журнал.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Необходимо выбрать грузоперевозку для копирования!");
		Возврат;
	КонецЕсли;                                            
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);   
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьКопированиеГрузоперевозок", ЭтотОбъект, ДополнительныеПараметры); 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КопированиеИзЗаказа", 	Ложь);	
	СтруктураПараметров.Вставить("ИзменятьТипПеревозки", 	Истина);	
	СтруктураПараметров.Вставить("УИД", 				УникальныйИдентификатор);		
	
	ОткрытьФорму("ОбщаяФорма.CW_КопированиеГрузоперевозок",СтруктураПараметров ,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьКопированиеГрузоперевозок(АдресПараметров, ДополнительныеПараметры) Экспорт 
	
	Если АдресПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьКопированиеГрузоперевозокНаСервереВФоне(АдресПараметров, ДополнительныеПараметры);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатКопированияГрузоперевозок", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьКопированиеГрузоперевозокНаСервереВФоне(АдресПараметров, ДополнительныеПараметры)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Копирование грузоперевозок заказа";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь; 
	
	МассивОбъектовКопирования = Новый Массив;
	Для Каждого ИдентификаторСтроки из ДополнительныеПараметры.ВыделенныеСтроки Цикл
		СтрокаТекущая = Журнал_Данные.НайтиПоИдентификатору(ИдентификаторСтроки);
		МассивОбъектовКопирования.Добавить(СтрокаТекущая.Ссылка);
	КонецЦикла;
	
	ПараметрыПроцедуры = ПолучитьИзВременногоХранилища(АдресПараметров); 
	Если ТипЗнч(ПараметрыПроцедуры) <> Тип("Структура") Тогда
		ВызватьИсключение "Непредвиденная ошибка копирования! Обратитесь к администратору!";
	КонецЕсли;  
	
	ПараметрыПроцедуры.Вставить("МассивОбъектовКопирования", МассивОбъектовКопирования);

	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_Заказы.ВыполнитьКопированиеГрузоперевозок",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатКопированияГрузоперевозок(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент","/Обновить")); 
		
		РезультатКопирования = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		Если ТипЗнч(РезультатКопирования) = Тип("Массив")
			И РезультатКопирования.Количество() = 1 Тогда
			ПоказатьЗначение(, РезультатКопирования[0]);	
		КонецЕсли;  
		
		ПоказатьПредупреждение(,"Копирование грузоперевозок завершено!",,"Копирование грузоперевозок");
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось скопировать грузоперевозки!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка копирования грузоперевозк");
	КонецЕсли;
	
КонецПроцедуры
 //Копирование грузоперевозок&НаКлиенте 

 &НаКлиенте
Процедура ПерезаполнитьПредопределенныеЗначенияРеквизитовШапки(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТипПеревозки) Тогда
		ЗаполнитьПредопределенныеЗначенияРеквизитовШапки();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредопределенныеЗначенияРеквизитовШапки()
	
	_УФС.ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(Объект, Объект.ТипПеревозки, "ДляЗаявки");
	
КонецПроцедуры



//Изменение представления грузоперевозок
&НаКлиенте
Процедура ВводПредставленияГрузоперевозок(Команда)
	
	ВыделенныеСтроки 	= Элементы.Журнал.ВыделенныеСтроки;  
	Грузоперевозки 		= ПолучитьСсылкиВыделенныхСтрокНаСервере(ВыделенныеСтроки);	
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("КоличествоСтрок", 		Грузоперевозки.Количество());
	ПараметрыПроцедуры.Вставить("Грузоперевозки",  		Грузоперевозки);
	ПараметрыПроцедуры.Вставить("ВыделенныеСтроки",  	ВыделенныеСтроки);
	
	CW_МониторингКлиент.ПередНачаломВводаПредставлений(ЭтаФорма, ПараметрыПроцедуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗаполненияПредставлений(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ОбновитьПредставленияНаФормеНаСервере(РезультатВыполнения.АдресРезультата, ДополнительныеПараметры.ВыделенныеСтроки); 
	   	ОповеститьОбИзменении(Тип("СправочникСсылка.CW_Грузоперевозки"));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось обновить предсставления грузоперевозок!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка обновления представлений");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставленияНаФормеНаСервере(АдресРезультата, ВыделенныеСтроки)
	
	CW_Мониторинг.ОбновитьПредставленияНаФорме(ЭтаФорма, ВыделенныеСтроки, АдресРезультата);
	
КонецПроцедуры
//---Изменение представления грузоперевозок


&НаКлиенте
Процедура БюджетРасходыПриАктивизацииСтроки(Элемент) 
	
	ПодключитьОбработчикОжидания("ОбработатьАктивизацияюСтрокиБюджетРасходы",0.1, Истина);
	
КонецПроцедуры    

&НаКлиенте
Процедура ОбработатьАктивизацияюСтрокиБюджетРасходы()
	
	ИдентификаторСтроки = Элементы.БюджетРасходы.ТекущаяСтрока; 
	Если ИдентификаторСтроки <> Неопределено Тогда
		ОбработатьАктивизацияюСтрокиБюджетаНаСервере("БюджетРасходы", ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура БюджетДоходыПриАктивизацииСтроки(Элемент)   
	
	ПодключитьОбработчикОжидания("ОбработатьАктивизацияюСтрокиБюджетДоходы",0.1, Истина); 
	
КонецПроцедуры  
 
&НаКлиенте
Процедура ОбработатьАктивизацияюСтрокиБюджетДоходы()
	
	ИдентификаторСтроки = Элементы.БюджетДоходы.ТекущаяСтрока;
	Если ИдентификаторСтроки <> Неопределено Тогда
		ОбработатьАктивизацияюСтрокиБюджетаНаСервере("БюджетДоходы", ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры 


&НаСервере
Процедура ОбработатьАктивизацияюСтрокиБюджетаНаСервере(ИмяТаблицы, ИдентификаторСтроки) 
	
	СоответствиеИмениРеквизита = ПолучитьСоответствиеИмениРеквизитаТаблице();
	
	ИмяРеквизита = СоответствиеИмениРеквизита.Получить(ИмяТаблицы);
	Если ИмяРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТекущая =	ЭтаФорма[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	 
	УстановитьТекущуюСтатью(СтрокаТекущая.СтатьяСсылка, ИмяРеквизита);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтатью(СтатьяБюджета, ИмяРеквизита)
	
	ЭтаФорма[ИмяРеквизита]= СтатьяБюджета;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСоответствиеИмениРеквизитаТаблице()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("БюджетРасходы", "СтатьяРасходовТекущая");
	Соответствие.Вставить("БюджетДоходы", 	"СтатьяДоходовТекущая");
	
	Возврат Соответствие;
	
КонецФункции

&НаКлиенте
Процедура БюджетЗаполнитьДоходыПоРасходам(Команда)
	
	ПараметрыВариантаБюджета = ПолучитьПараметрыВариантаБюджета();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВалютаВарианта", ПараметрыВариантаБюджета.Валюта);  
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораВариантаВалюты", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_Заявки.Форма.ВыборВалютыБюджета", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораВариантаВалюты(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	МассивСсылок = Новый Массив;
	Для каждого ВыделеннаяСтрока Из Элементы.БюджетРасходы.ВыделенныеСтроки Цикл
		СтрокаТаблицы = БюджетРасходы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		МассивСсылок.Добавить(СтрокаТаблицы.СтатьяСсылка);
	КонецЦикла; 
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Объект", 					Объект.ВариантБюджета);
	ПараметрыЗаполнения.Вставить("ВерсияБюджета", 			БюджетТекущаяВерсия);
	ПараметрыЗаполнения.Вставить("ВариантВалютыБюджета",	РезультатВыбора.ВариантВалютыБюджета);
	ПараметрыЗаполнения.Вставить("МассивСсылок", 	    	МассивСсылок);
	ПараметрыЗаполнения.Вставить("ДоходыВРасходы", 	    	Ложь);
	ПараметрыЗаполнения.Вставить("РежимДерево", 			Ложь);
	
	Ответ = БюджетЗаполнитьДоходыПоРасходамНаСервере(ПараметрыЗаполнения);
	
	ВыполнитьДействие(Ответ);
	
КонецПроцедуры  

&НаСервере
Функция БюджетЗаполнитьДоходыПоРасходамНаСервере(ПараметрыЗаполнения)
	
	Возврат CW_Грузоперевозки_Сервер.БюджетЗаполнитьДоходыПоРасходам(ЭтаФорма, ПараметрыЗаполнения); 
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыВариантаБюджета() 
	
	ВариантБюджетаВалюта	= Объект.ВариантБюджета.Валюта; 
	ВариантБюджетаКурс 		= Объект.ВариантБюджета.Курс;
	ВариантБюджетаКратность	= Объект.ВариантБюджета.Кратность;
	
	Если ВариантБюджетаВалюта.Пустая() Тогда
		ВариантБюджетаВалюта 	= Константы.ВалютаРегламентированногоУчета.Получить();
		ВариантБюджетаКурс 		= 1;
		ВариантБюджетаКратность = 1;
	КонецЕсли;
	
	ПараметрыВариантаБюджета = Новый Структура;
	ПараметрыВариантаБюджета.Вставить("Валюта", 	ВариантБюджетаВалюта);
	ПараметрыВариантаБюджета.Вставить("Курс", 		ВариантБюджетаКурс);
	ПараметрыВариантаБюджета.Вставить("Кратность", 	ВариантБюджетаКратность);
	
	Возврат ПараметрыВариантаБюджета;
	
КонецФункции

//ХранениеПолногоЗначения
&НаСервере
Процедура ДобавитьСохраняемоеПолноеЗначение(Параметр, ХранимоеЗначение=Неопределено)
	
	Если Не CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда   
		Возврат
    КонецЕсли;
	
	Соответствие = Новый Соответствие;
	Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда
		Соответствие = Новый Соответствие(СохраняемоеПолноеЗначение);                                             
	КонецЕсли;
	
	Соответствие.Вставить(Параметр, ХранимоеЗначение);
	СохраняемоеПолноеЗначение = Новый ФиксированноеСоответствие(Соответствие);
	
КонецПроцедуры
//---ХранениеПолногоЗначения
	

&НаКлиенте
Процедура Форма_БюджетРасходыПересчитатьПоКурсу(Команда)
	
	ВыделенныеСтроки 	= Элементы.БюджетРасходы.ВыделенныеСтроки;
	МассивСтатейБюджета = ПолучитьМассивВыбранныхСтатейБюджетаНаСервере(ВыделенныеСтроки, "БюджетРасходы");
	
	CW_БюджетированиеКлиент.ПередНачаломПересчетаСтатейБюджета(ЭтаФорма, МассивСтатейБюджета, "/БюджетРасходыОбновить");
	
КонецПроцедуры

&НаКлиенте
Процедура Форма_БюджетДоходыПересчитатьПоКурсу(Команда)
	
	ВыделенныеСтроки 	= Элементы.БюджетДоходы.ВыделенныеСтроки;
	МассивСтатейБюджета = ПолучитьМассивВыбранныхСтатейБюджетаНаСервере(ВыделенныеСтроки, "БюджетДоходы");
	
	CW_БюджетированиеКлиент.ПередНачаломПересчетаСтатейБюджета(ЭтаФорма, МассивСтатейБюджета, "/БюджетДоходыОбновить");

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивВыбранныхСтатейБюджетаНаСервере(ВыделенныеСтроки, ИмяТаблицы) 
	
	Возврат CW_Бюджетирование.ПолучитьМассивСтатейБюджета(ЭтаФорма, ВыделенныеСтроки, ИмяТаблицы);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТаблицуБюджета(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент", ДополнительныеПараметры.ИмяПроцедуры, Неопределено));
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПоложениеКурсора(ИмяТаблицы)   
	
	СоответствиеИмениРеквизита = ПолучитьСоответствиеИмениРеквизитаТаблице();
	
	ИмяРеквизита = СоответствиеИмениРеквизита.Получить(ИмяТаблицы);
	Если ИмяРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтатья = ЭтаФорма[ИмяРеквизита];  
	Если Не ЗначениеЗаполнено(ТекущаяСтатья) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СтатьяСсылка", ТекущаяСтатья);
	
	НайденныеСтроки = ЭтаФорма[ИмяТаблицы].НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 тогда
		//по утвреждению АПС всегдаодна строка
		НайденнаяСтрока = НайденныеСтроки[0];
		Элементы[ИмяТаблицы].ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры


//Сортировка бюджетов
&НаКлиенте
Процедура СортироватьПоВозрастаниюДоходы(Команда) 
	
	СортироватьТаблицуНаСервере("БюджетДоходы", "ВОЗР");  

КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбываниюДоходы(Команда)    
	
	СортироватьТаблицуНаСервере("БюджетДоходы", "УБЫВ");  
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоВозрастаниюРасходы(Команда)  

	СортироватьТаблицуНаСервере("БюджетРасходы", "ВОЗР");  
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбываниюРасходы(Команда)
	
	СортироватьТаблицуНаСервере("БюджетРасходы", "УБЫВ");  
	
КонецПроцедуры  

&НаСервере
Процедура СортироватьТаблицуНаСервере(ИмяТаблицы, Знач Направление)
	
	CW_Бюджетирование.СортироватьТаблицуБюджета(ЭтаФорма, ИмяТаблицы, Направление);

КонецПроцедуры 

&НаСервере
Процедура ВосстановитьСортировкуТаблицы(ИмяТаблицы)
	
	CW_Бюджетирование.ВосстановитьСортировкуТаблицы(ЭтаФорма, ИмяТаблицы);
	
	ВосстановитьПоложениеКурсора(ИмяТаблицы)
	
КонецПроцедуры   
//Сортировка бюджетов


//Групповое редактирование реквизитов статей бюджета
&НаКлиенте
Процедура ГрупповоеРедактированиеРеквизитаСтатейРасходов(Команда)
	Отказ = Ложь;

	ВыделенныеСтроки 	= Элементы.БюджетРасходы.ВыделенныеСтроки;   
	CW_БюджетированиеКлиент.ПередНачаломГруповогоРедактированияРеквизитовСтатенйБюджета(ВыделенныеСтроки, Отказ);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;    
	
	МассивСтатейБюджета = ПолучитьМассивВыбранныхСтатейБюджетаНаСервере(ВыделенныеСтроки, "БюджетРасходы");

	CW_БюджетированиеКлиент.ГрупповоеРедактированиеРеквизитовСтатейБюджета(ЭтотОбъект, МассивСтатейБюджета, "БюджетРасходы");

КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеРедактированиеРеквизитовСтатейДоходов(Команда)
	
	Отказ = Ложь;

	ВыделенныеСтроки 	= Элементы.БюджетДоходы.ВыделенныеСтроки;   
	CW_БюджетированиеКлиент.ПередНачаломГруповогоРедактированияРеквизитовСтатенйБюджета(ВыделенныеСтроки, Отказ);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;    
	
	МассивСтатейБюджета = ПолучитьМассивВыбранныхСтатейБюджетаНаСервере(ВыделенныеСтроки, "БюджетДоходы");
	
	CW_БюджетированиеКлиент.ГрупповоеРедактированиеРеквизитовСтатейБюджета(ЭтотОбъект, МассивСтатейБюджета, "БюджетДоходы");
  
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьФоновоеРедактированиеРеквизитов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов"));
		
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
		
		//Сортировка бюджетов
		ВосстановитьСортировкуТаблицы("БюджетРасходы");
		ВосстановитьСортировкуТаблицы("БюджетДоходы");
		//Сортировка бюджетов
	
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось изменить реквизты!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка изменения реквизитов");
	КонецЕсли;
	
КонецПроцедуры
//Групповое редактирование реквизитов статей бюджета

&НаСервере
Функция ПолучитьСсылкиВыделенныхСтрокНаСервере(Знач ВыделенныеСтроки)
	
	Возврат CW_Журналы_Сервер.ПолучитьСсылкиВыделенныхСтрок(ЭтаФорма, ВыделенныеСтроки);
	
КонецФункции

