#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = Новый Структура("Отбор");
	ПараметрыОткрытия.Отбор = ПростойИнтерфейсКлиент.ПараметрыОткрытияЗависимыхФорм(ПараметрыВыполненияКоманды.Источник);
	
	ОткрытьФорму("Документ.ОтражениеНачисленияНДС.ФормаСписка",
		ПараметрыОткрытия,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти