#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция Информация() Экспорт 
	
	СтруктураОписания 					= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 				= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 				= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешняяОбработка();

	СтруктураОписания.Наименование 				= "Пример внешней формы";
	СтруктураОписания.Описание 					= "Пример внешней формы";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	//Метаданыне объекта
	CW_ПодключаемыеКомандыСервер.УстановитьМетаданныеВнешнегоОбъекта(СтруктураОписания, "Справочник.CW_Грузоперевозки");
	
	Возврат СтруктураОписания;
	
КонецФункции

//Функция ПолучитьИмяПодключаемойФормы(ВидФормы)
// возвращает имя формы в зависимсоти от ее вида
//параметры:
// - вид формы - тип "Строка" - имя вида формы: "ФормаОбъекта","ФормаСписка" и пр.
//
Функция ПолучитьИмяПодключаемойФормы(ВидФормы) Экспорт
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Возврат  "НоваяФорма";
	КонецЕсли;
	
	Возврат Неопределено
	
КонецФункции

#КонецЕсли