
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Ответ = ПроверитьВозможностьФормированияЗаписейРееста(ПараметрКоманды);
	Если Ответ.Успешно = Ложь Тогда
		ПоказатьПредупреждение(, Ответ.Описание);
		Возврат;
	КонецЕсли;
	
	СтруктураДокументов	= ПолучитьВедомыйВедущийДокумент(ПараметрКоманды); 

	СписокПриложенийДокумента 	= ПолучитьСписокПриложенийПоДокументу(СтруктураДокументов.ВедущийДокумент);  
	Если СписокПриложенийДокумента = Неопределено Тогда
		ПоказатьПредупреждение(, "Не настроен мониторинговый параметр для учета Реестра по НДС 0%");
		Возврат;
	КонецЕсли; 
	
	Если СписокПриложенийДокумента.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Нет данных для формирования приложений Реестра по НДС 0%");
		Возврат;
	КонецЕсли;  
	
	ДополнительныеПарамтры = Новый Структура;
	ДополнительныеПарамтры.Вставить("ПараметрыВыполненияКоманды", 	ПараметрыВыполненияКоманды);	 
	ДополнительныеПарамтры.Вставить("СтруктураДокументов", 			СтруктураДокументов);	 
	ДополнительныеПарамтры.Вставить("СписокПриложенийДокумента", 	СписокПриложенийДокумента);	 

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборВариантФормированияЗаписиРеестра", ЭтотОбъект, ДополнительныеПарамтры);
	
	ЕстьЗаписиРеестра = ЕстьЗаписиРеестра(ПараметрКоманды);
	Если ЕстьЗаписиРеестра Тогда 
		
		ОткрытьФорму("ОбщаяФорма.CW_РеестрыНДС0ВариантФормированияЗаписиРеестра",,ПараметрыВыполненияКоманды.Источник,,,,ОписаниеОповещения);

	Иначе
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, 0);
		
	КонецЕсли;
	
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработатьВыборВариантФормированияЗаписиРеестра(РезультатВыбора, Параметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВедущийДокумент", 			Параметры.СтруктураДокументов.ВедущийДокумент);
	ДополнительныеПараметры.Вставить("ВедомыйДокумент", 			Параметры.СтруктураДокументов.ВедомыйДокумент);
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды",	Параметры.ПараметрыВыполненияКоманды);
	ДополнительныеПараметры.Вставить("ВариантФормирования",			РезультатВыбора);

	ОписаниеОповещения = новый ОписаниеОповещения("ОтметкаЭлементовЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Параметры.СписокПриложенийДокумента.Количество() = 1 Тогда   
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Параметры.СписокПриложенийДокумента);	
	Иначе
		Параметры.СписокПриложенийДокумента.ПоказатьОтметкуЭлементов(ОписаниеОповещения, "Выберите приложения реестра по НДС 0%");
	КонецЕсли;
	
	
КонецПроцедуры   


&НаСервере
Функция ЕстьЗаписиРеестра(ДокументДоходов)   
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
		|	CW_РеестрыНДС0ЗаписиРеестра.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.CW_РеестрыНДС0ЗаписиРеестра КАК CW_РеестрыНДС0ЗаписиРеестра
		|ГДЕ
		|	CW_РеестрыНДС0ЗаписиРеестра.ДокументДоходов = &ДокументДоходов";
	
	Запрос.УстановитьПараметр("ДокументДоходов", ДокументДоходов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции


&НаСервере
Функция ПроверитьВозможностьФормированияЗаписейРееста(ПараметрКоманды) 
	
	Ответ = Новый Структура("Успешно, Описание", Истина,"");   
	
	Если НЕ ПараметрКоманды.Проведен Тогда
		Ответ.Успешно 	= Ложь;    
		Ответ.Описание  = "Формирование реестра возможно только для проведенного документа!";
		Возврат Ответ;
	КонецЕсли;
	
	ВедетсяУчетПриложений 	= ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");
	
	ДоговорДокумента 		= ПараметрКоманды.Договор;
	Если ВедетсяУчетПриложений И ЗначениеЗаполнено(ПараметрКоманды.ПриложениеКДоговору) Тогда  
		ДоговорДокумента = ПараметрКоманды.ПриложениеКДоговору;
	КонецЕсли;  

	СтрукутраВедомыеДокументы = CW_РеестрыНДС0СерверВызовСервера.ПолучитьВедомыйВедущийДокумент(ПараметрКоманды);
	Если Не ЗначениеЗаполнено(СтрукутраВедомыеДокументы.ВедомыйДокумент) Тогда
		Ответ.Успешно = Ложь;
		Ответ.Описание = "Отсутствует ведомый документ";
		Возврат Ответ;
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ДоходыПоГрузоперевозкеУслуги.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ПараметрКоманды 
	|	И CW_ДоходыПоГрузоперевозкеУслуги.СтавкаНДС = &СтавкаНДС
	|	И CW_ДоходыПоГрузоперевозкеУслуги.ПорядокОтражения = &ПорядокОтражения";
	
	Запрос.УстановитьПараметр("ПараметрКоманды", 	ПараметрКоманды);
	Запрос.УстановитьПараметр("СтавкаНДС", 			ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0"));
	Запрос.УстановитьПараметр("ПорядокОтражения", 	ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Ответ.Успешно = Ложь;
		Ответ.Описание = "В документе нет ни одной строки со ставкой НДС 0% и порядоком отражения ""Собственная услуга""";
		Возврат Ответ;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПолучитьВедомыйВедущийДокумент(ПараметрКоманды) 
	
	Возврат CW_РеестрыНДС0СерверВызовСервера.ПолучитьВедомыйВедущийДокумент(ПараметрКоманды); 
	
КонецФункции

&НаСервере
Функция ПолучитьСписокПриложенийПоДокументу(ВедущийДокумент)  
	
	Возврат CW_РеестрыНДС0Дополнительный.ПолучитьСписокПриложенийПоДокументу(ВедущийДокумент);
	
КонецФункции

&НаКлиенте
Процедура ОтметкаЭлементовЗавершение(СписокЗначений, ДополнительныеПараметры) Экспорт
	
	Если СписокЗначений = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	МассивВидыТранспорта = новый Массив;
	Для Каждого ЭлементСписка из СписокЗначений Цикл
		Если ЭлементСписка.Пометка = Ложь Тогда
			Продолжить;
		КонецЕсли;  
	   МассивВидыТранспорта.Добавить(ЭлементСписка.Значение);
   КонецЦикла;   
   
    ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
   
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ВариантФормирования", 			ДополнительныеПараметры.ВариантФормирования); 
	ПараметрыПроцедуры.Вставить("ВедущийДокумент", 				ДополнительныеПараметры.ВедущийДокумент);
	ПараметрыПроцедуры.Вставить("ВедомыйДокумент", 				ДополнительныеПараметры.ВедомыйДокумент);
	ПараметрыПроцедуры.Вставить("ВидыТранспорта", 				МассивВидыТранспорта);   
	ПараметрыПроцедуры.Вставить("ВариантПериодаПодтверждения", 	0);   
	
	РезультатВыполнения =  НачатьФормированиеРеестровВФоне(СписокЗначений, ПараметрыПроцедуры);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ПараметрыВыполненияКоманды.Источник);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьФормированиеРеестров", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры    


&НаСервере
Функция НачатьФормированиеРеестровВФоне(СписокЗначений, ПараметрыПроцедуры)
	
	Если ПараметрыПроцедуры.ВариантФормирования = 1 Тогда
		УдалитьЗаписиРеестраПоДокументу(ПараметрыПроцедуры.ВедущийДокумент);
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Формирование реестра по НДС 0%";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_РеестрыНДС0Дополнительный.СформироватьЗаписьРеестраНДС",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции 

&НаСервере
Процедура УдалитьЗаписиРеестраПоДокументу(ДокументДоходов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	CW_РеестрыНДС0ЗаписиРеестра.Ссылка КАК Ссылка
	               	|ИЗ
	               	|	Справочник.CW_РеестрыНДС0ЗаписиРеестра КАК CW_РеестрыНДС0ЗаписиРеестра
	               	|ГДЕ
	               	|	CW_РеестрыНДС0ЗаписиРеестра.ДокументДоходов = &ДокументДоходов
	               	|	И CW_РеестрыНДС0ЗаписиРеестра.Заблокирован = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДокументДоходов", ДокументДоходов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбъектЗаписьРеестра =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ОбъектЗаписьРеестра.Удалить();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьФормированиеРеестров(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
		
		СтруктураОтбора = новый Структура;
		СтруктураОтбора.Вставить("ДокументРеализации", ДополнительныеПараметры.ВедомыйДокумент);
		
		ПараметрыФормы = Новый Структура("Отбор", СтруктураОтбора);    
		
		ОткрытьФорму("Справочник.CW_РеестрыНДС0ЗаписиРеестра.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_РеестрыНДС0ЗаписиРеестра"));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Реестры НДС 0% не сформированы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования реестра по НДС");
	КонецЕсли;
	
КонецПроцедуры



