
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Предопределенные значения параметров
	ВидСубъекта = Перечисления.CW_ВидыСубъектовСвязанныхПараметров.Маршрут;
	CW_Отчеты.ДобавитьОтборКомпоновкиДанных("ВидСубъекта", ВидСравненияКомпоновкиДанных.Равно, ВидСубъекта, Истина, ПредопределенныеЗначенияПараметров.Отбор);
	_УправлениеЭлементамиФормы_ПредопределенныеЗначенияПараметров();
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	// --- 
	_УправлениеЭлементамиФормы();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	_УправлениеЭлементамиФормы_ПредопределенныеЗначенияПараметров();
	
КонецПроцедуры


&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Элементы.СтраницаТипыПеревозок.Видимость = Объект.ОграничениеПоТипамПеревозок;
	
	// --- 
КонецПроцедуры
 

// Предопределенные значения параметров

Процедура _УправлениеЭлементамиФормы_ПредопределенныеЗначенияПараметров()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Элементы.СтраницаПредопределенныеЗначения.Видимость = Истина;
		CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Субъект", ВидСравненияКомпоновкиДанных.Равно, Объект.Ссылка, Истина, ПредопределенныеЗначенияПараметров.Отбор);
		
	Иначе 
		Элементы.СтраницаПредопределенныеЗначения.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОграничениеПоТипамПеревозокПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти