#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПараметрыПланирования(Организация, Период) Экспорт
	
	Результат = Новый Структура("ИспользоватьАвтоматическоеПланирование,РасходыСтатьяДДС,РасходыСтатьяДДСВнутрихолдинг,ВключатьВнутрихолдинговыеРасходы,ПересчитыватьСуммуПриСогласовании,РасходыИнициаторПоЗаявке,РасходыСценарий,ШаблонЗаполненияСодержания,ОсновнойВидОперацииПлатежногоПоручения");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ПараметрыПланированияДДСДССрезПоследних.РасходыАвтоматическоеПланирование КАК ИспользоватьАвтоматическоеПланирование,
		|	CW_ПараметрыПланированияДДСДССрезПоследних.РасходыСтатьяДДС КАК РасходыСтатьяДДС,
		|	CW_ПараметрыПланированияДДСДССрезПоследних.РасходыСтатьяДДСВнутрихолдинг КАК РасходыСтатьяДДСВнутрихолдинг,
		|	CW_ПараметрыПланированияДДСДССрезПоследних.ВключатьВнутрихолдинговыеРасходы КАК ВключатьВнутрихолдинговыеРасходы,
		|	CW_ПараметрыПланированияДДСДССрезПоследних.ПересчитыватьСуммуПриСогласовании КАК ПересчитыватьСуммуПриСогласовании,
		|	CW_ПараметрыПланированияДДСДССрезПоследних.РасходыИнициаторПоЗаявке КАК РасходыИнициаторПоЗаявке,
		|	CW_ПараметрыПланированияДДСДССрезПоследних.РасходыСценарий КАК РасходыСценарий,
		|	CW_ПараметрыПланированияДДСДССрезПоследних.ШаблонЗаполненияСодержания КАК ШаблонЗаполненияСодержания,
		|	CW_ПараметрыПланированияДДСДССрезПоследних.РасходыСтатьяДДС.ОсновнойВидОперацииПлатежногоПоручения КАК ОсновнойВидОперацииПлатежногоПоручения
		|ИЗ
		|	РегистрСведений.CW_ПараметрыПланированияДДС.СрезПоследних(&Период, Организация = &Организация) КАК CW_ПараметрыПланированияДДСДССрезПоследних
		|ГДЕ
		|	CW_ПараметрыПланированияДДСДССрезПоследних.РасходыАвтоматическоеПланирование";
	
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ВыборкаПараметров = РезультатЗапроса.Выбрать();
		ВыборкаПараметров.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаПараметров);
		Возврат Результат
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции
#КонецЕсли