#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Запись = Получить(0);
	Если Запись.РасходыАвтоматическоеПланирование Тогда
		ПроверяемыеРеквизиты.Добавить("РасходыСтатьяДДС");
		ПроверяемыеРеквизиты.Добавить("РасходыСценарий");
		Если Запись.ВключатьВнутрихолдинговыеРасходы Тогда
			ПроверяемыеРеквизиты.Добавить("РасходыСтатьяДДСВнутрихолдинг");
		КонецЕсли; 		
	КонецЕсли; 
КонецПроцедуры

#КонецЕсли