#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = ОбъектыПлатежа.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("Дата", Дата);
		ДанныеЗаполнения.Свойство("Организация", Организация);
		
		Если ДанныеЗаполнения.Свойство("ОбъектыПлатежа") Тогда
			Для Каждого Стр Из ДанныеЗаполнения.ОбъектыПлатежа Цикл
				ЗаполнитьЗначенияСвойств(ОбъектыПлатежа.Добавить(),Стр);	
			КонецЦикла; 	
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = CW_Документы.ПрефиксОрганизации(Организация);	

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		РегистрыСведений.CW_СоставРеестраПлатежей.ОбработатьУдалениеПлатежныхПорученийОбъекта(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли