#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если МобильныйКлиентБПКлиент.ЭтоМобильныйКлиент() Тогда
		МобильныйКлиентБПКлиент.ПоказатьФормуНедоступнаяФункциональность(
			НСтр("ru = 'Подготовить отчетность по НДС'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПростойИнтерфейсКлиент.ПараметрыОткрытияЗависимыхФорм(ПараметрыВыполненияКоманды.Источник);
	
	ОткрытьФорму("Обработка.ПомощникРасчетаНДС.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры

#КонецОбласти