
&НаСервере
Процедура ПоказатьСкрытьНастройкиНаСервере(ВидимостьЭлемента)
	
	Элементы.ГруппаПараметры.Видимость = ВидимостьЭлемента;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьНастройки(Команда)
	ПоказатьСкрытьНастройкиНаСервере(Не Элементы.ГруппаПараметры.Видимость);
КонецПроцедуры

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			Если СеансоваяНастройка.Свойство("Настройки") Тогда
				АдресНастроек = ПоместитьВоВременноеХранилище(СеансоваяНастройка.Настройки);
			КонецЕсли; 
			
			СеансоваяНастройка.Свойство("ТипПериода"		, ТипПериода);
			СеансоваяНастройка.Свойство("СписокГруппировок"	, СписокГруппировок); 
			
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Настройки"			, КомпоновщикНастроек.ПолучитьНастройки());
	СтруктураНастройки.Вставить("ТипПериода"		, ТипПериода);
	СтруктураНастройки.Вставить("СписокГруппировок"	, СписокГруппировок);
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_ВосстановитьСеансовуюНастройку();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	МакетСКД 	= ОтчетОбъект.ПолучитьМакет("СхемаОтбраПутевыхЛистов");
	
	//Загрзука настроек отбора по СКД
	АдресИсточникаНастроек 	= ПоместитьВоВременноеХранилище(МакетСКД ,ЭтаФорма.УникальныйИдентификатор);
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресНастроек) Тогда
		АдресНастроек = ПоместитьВоВременноеХранилище(КомпоновщикНастроек.Настройки,ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(АдресНастроек));
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресИсточникаНастроек));
	
	ДатаНачала 		= НачалоМесяца(ТекущаяДата());
	ДатаОкончания 	= НачалоДня(ТекущаяДата());
	
	Если СписокГруппировок.Количество() = 0 Тогда
		
		СписокГруппировок.Добавить("Автомобиль");
		СписокГруппировок.Добавить("Водитель");
		
	Конецесли;
	
	ВнешнийВызов = Ложь;
	Если Параметры.Свойство("ВнешнийВызов") Тогда
		ВнешнийВызов = истина;
	КонецЕсли;
	
	Если ВнешнийВызов Тогда
		Ответ = СформироватьОтчетНаСервере();
		
		//Обрабатываем ответ
		Результат = Ответ.Результат;
		
		ПоказатьСкрытьНастройкиНаСервере(Ложь);
		
		ВнешнийВызов = Ложь;
		
	Иначе
		ПоказатьСкрытьНастройкиНаСервере(Истина);
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Отказ = ЗавершениеРаботы;
	
	ТекстПредупреждения = "Закрыть отчет без сохранения настроек?";
	
	Если Не ЗавершениеРаботы Тогда
		_СохранитьСеансовуюНастройку();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПутевыеЛистыПоОтбору()
	
	ОтчетОбъект 			= РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных 	= ОтчетОбъект.ПолучитьМакет("СхемаОтбраПутевыхЛистов");
	
	Настройки	= СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	_УФС.СкопироватьОтбор(КомпоновщикНастроек.Настройки.Отбор, Настройки.Отбор);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаПутевыхЛистов = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаПутевыхЛистов);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПутевыхЛистов.ВыгрузитьКолонку("ПутевойЛист"));
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Ответ = СформироватьОтчетНаСервере();
	
	//Обрабатываем ответ
	Результат = Ответ.Результат;
	
	Если Ответ.ОписаниеОшибки <> "" Тогда
		ПоказатьПредупреждение(,Ответ.ОписаниеОшибки);
	КонецЕсли;
	
	ПоказатьСкрытьНастройкиНаСервере(Ложь);
	
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	АдресПутевыхЛистов	= ПолучитьПутевыеЛистыПоОтбору();
	АдресНастроекОтбора = ПоместитьВоВременноеХранилище(КомпоновщикНастроек.Настройки.Отбор);
	АдресГруппировок 	= ПоместитьВоВременноеХранилище(СписокГруппировок);
	
	ДанныеНастроек = Новый Структура("АдресПутевыхЛистов,АдресНастроекОтбора,АдресГруппировок, ДатаНачала,ДатаОкончания, ТипПериода",АдресПутевыхЛистов,АдресНастроекОтбора, АдресГруппировок, НачалоДня(ДатаНачала), КонецДня(ДатаОкончания), ТипПериода);
	
	Результат.Очистить();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Возврат  ОтчетОбъект.СформироватьОтчет(ДанныеНастроек);
	
КонецФункции

&НаКлиенте
Процедура СписокГруппировокЗначениеСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период 					= Период;
	Диалог.Период.ДатаНачала 		= ДатаНачала;
	Диалог.Период.ДатаОкончания 	= ДатаОкончания;
	Диалог.Период.Вариант 			= ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПериод <> Неопределено) Тогда
		
		ДатаНачала 		= ОтветПериод.ДатаНачала;
		ДатаОкончания  	= ОтветПериод.ДатаОкончания;
		Период 			= ОтветПериод;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
