#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Входящий счёт";
	СтруктураОписания.Описание 					= "Печатная форма счета на оплату, внешний вид которого можно изменить (частично) параметрами договора с контрагентом.";
	
	СтруктураОписания.Версия					= "3.2.9.3";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.17.2";
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерИсправления]", 			"Номер исправлния", 			"ПолучитьНомерИсправления(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления
	
	Возврат СтруктураОписания;
	
КонецФункции

//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьНомерИсправления(ПараметрыПроцедуры) Экспорт
	
	НомерИсправления  = ?(ЗначениеЗаполнено(ПараметрыПроцедуры.НомерИсправления), " (испр. "+Формат(ПараметрыПроцедуры.НомерИсправления,"ЧГ=0")+")","");
	Возврат СокрЛП(НомерИсправления);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления
Процедура Регистрация(Ссылка) Экспорт
	
	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_РасходыПоГрузоперевозке");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "Счёт"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		
	
	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);
	
КонецПроцедуры

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	Если СсылкаНаОбъект.Корректировка Тогда
		Возврат Ложь; 
	КонецЕсли;
	
	Если СсылкаНаОбъект.ПредъявленСчет Тогда
		Возврат Истина; 
	КонецЕсли;
	
	Возврат СсылкаНаОбъект.ПредъявленАкт И ЗначениеЗаполнено(СсылкаНаОбъект.Счет);
	
КонецФункции

Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт
	
	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	КонецЕсли;
	
	Если (НЕ СсылкаНаОбъект.ПредъявленСчет И СсылкаНаОбъект.ПредъявленАкт И ЗначениеЗаполнено(СсылкаНаОбъект.Счет)) Тогда
		Ссылка = СсылкаНаОбъект.Счет;
	Иначе
		Ссылка = СсылкаНаОбъект;
	КонецЕсли; 
	
	БазоваяВалюта = CW_Настройки.ВалютаРегламентированногоУчета();   
	
	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();
	
	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхСчета", Истина);
	Если КоличествоЭксземпляров <> Неопределено Тогда 
		РезультатПечати.Параметры.Количество = КоличествоЭксземпляров;
		РезультатПечати.Параметры.Печать 	 = (КоличествоЭксземпляров <> 0);  
	Иначе
		РезультатПечати.Параметры.Количество = 2;
		РезультатПечати.Параметры.Печать 	 = Истина;  
	КонецЕсли;  
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				СсылкаНаОбъект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		СсылкаНаОбъект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, СсылкаНаОбъект.Дата);
	
	НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерСчета", "ДатаСчета");
	ДатаДокумента = Ссылка.ДатаСчета;
	ПредставлениеДокумента     = "Счет №"    + НомерДокумента+" от "  + Формат(ДатаДокумента,"ДФ=dd.MM.yyyy");
	ПредставлениеДокументаАнгл = "INVOICE №" + НомерДокумента+" of  " + Формат(ДатаДокумента,"ДФ=dd.MM.yyyy");
	
	// --- 
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(ПредставлениеДокумента));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НомерДокумента",	НомерДокумента);
	ПараметрыПроцедуры.Вставить("ДатаДокумента",	ДатаДокумента);
	ПараметрыПроцедуры.Вставить("НомерИсправления",	СсылкаНаОбъект.НомерИсправления);
	
	РезультатПечати.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы
	
	// ---------------------------------------------------------------------------- 
	// формируем печатную форму
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= ДатаДокумента;
	СтруктураПараметров.Договор 			= Ссылка.Договор;
	СтруктураПараметров.ПриложениеКДоговору = Ссылка.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
	
	ПараметрыУчетнойПолитики = CW_Настройки.ПараметрыУчетнойПолитики(Ссылка.Дата, Ссылка.Организация);
	Макет = ПолучитьМакет("МакетСчет");
	
	//СведенияООрганзации  			= CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.ВедомыйДокумент.Дата);
	//ОрганизацияНаименованиеПолное = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияООрганзации, "ПолноеНаименование,");
	//ОрганизацияНаименованиеСокращенное = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияООрганзации, "СокращенноеНаименование,");
	
	НаименованияОрганиазции = Справочники.Организации.НаименованияНаДату(Ссылка.Организация, ДатаДокумента);
	
	НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент, ДатаДокумента);
	КПП_Контрагента         = Справочники.Контрагенты.КППНаДату(Ссылка.Контрагент, ДатаДокумента);
	
	// ---------------------------------------------------------------------------- 
	// язык печати документов : 0=русский 1=английский 2=двуязычный
	// ---------------------------------------------------------------------------- 
	
	//--------
	// шапка
	обл = Макет.ПолучитьОбласть("Шапка");
	Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
		стр = ПараметрыДоговора.НаименованиеКонтрагентаАнгл + Символы.ПС + ПараметрыДоговора.АдресАнгл;
	ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
		стр = НаименованияКонтрагента.НаименованиеДляПечатныхФорм
		+ Символы.ПС
		+ ПараметрыДоговора.Адрес + ", тел.: " + ПараметрыДоговора.Телефон
		+ Символы.ПС
		+ ПараметрыДоговора.НаименованиеКонтрагентаАнгл
		+ Символы.ПС
		+ ПараметрыДоговора.АдресАнгл;
	Иначе 
		стр = НаименованияКонтрагента.НаименованиеДляПечатныхФорм
		+ Символы.ПС
		+ ПараметрыДоговора.Адрес + ", тел.: " + ПараметрыДоговора.Телефон;
	КонецЕсли;
	обл.Параметры.ТекстШапки = стр;
	ТабличныйДокумент.Вывести(обл);
	
	//--------
	// образец заполнения
	Если ПараметрыДоговора.ЯзыкПечатиДокументов = 0 Тогда//Если (Ссылка.Валюта=БазоваяВалюта ИЛИ Ссылка.Договор.ВзаиморасчетыВУЕ) Тогда 
		
		// только русский вариант
		обл = Макет.ПолучитьОбласть("ОбразецЗаполненияРус");
		обл.Параметры.ИНН = "ИНН " + Ссылка.Контрагент.ИНН;
		обл.Параметры.КПП = "КПП " + КПП_Контрагента;
		Если (ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчет.ТекстКорреспондента)) Тогда
			обл.Параметры.Получатель = "Получатель" + Символы.ПС + ПараметрыДоговора.РасчетныйСчет.ТекстКорреспондента;
		Иначе
			обл.Параметры.Получатель = "Получатель" + Символы.ПС + НаименованияКонтрагента.ПолноеНаименование;
		КонецЕсли; 
		обл.Параметры.БанкПолучателя = "Банк получателя" + Символы.ПС + ПараметрыДоговора.РасчетныйСчет.Банк + " " + ПараметрыДоговора.РасчетныйСчет.Банк.Город;
		обл.Параметры.НомерСчета = ПараметрыДоговора.РасчетныйСчет.НомерСчета;
		обл.Параметры.БикБанкаПолучателя =ПараметрыДоговора.РасчетныйСчет.Банк.Код;
		обл.Параметры.НомерСчетаБанкаПолучателя = ПараметрыДоговора.РасчетныйСчет.Банк.КоррСчет;
		обл.Параметры.Заполнить(Новый Структура("Валюта", Ссылка.Валюта));
		ТабличныйДокумент.Вывести(обл);
		
	Иначе 
		
		СуффиксОбластей = ?(ПараметрыДоговора.ЯзыкПечатиДокументов=1,"_Англ","_Двуязычный");
		// --- 
		обл_Верх = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Верх"+СуффиксОбластей);
		обл_Посредник = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Посредник"+СуффиксОбластей);
		обл_Корреспондент = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Корреспондент"+СуффиксОбластей);
		обл_Получатель = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Получатель"+СуффиксОбластей);
		
		обл_Верх.Параметры.Заполнить(Новый Структура("Валюта", Ссылка.Валюта));
		ТабличныйДокумент.Вывести(обл_Верх);
		
		Если ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетИностранный.БанкПосредникБанкаКорреспондента) Тогда 
			банк = ПараметрыДоговора.РасчетныйСчетИностранный.БанкПосредникБанкаКорреспондента;
			обл_Посредник.Параметры.БанкПосредникБанкаКорреспондента = 
			банк.Наименование
			+ ", " + банк.АдресАнгл
			+ Символы.ПС + "SWIFT: " + банк.SWIFT;
			ТабличныйДокумент.Вывести(обл_Посредник);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетИностранный.БанкКорреспондент) Тогда 
			банк = ПараметрыДоговора.РасчетныйСчетИностранный.БанкКорреспондент;
			обл_Корреспондент.Параметры.БанкКорреспондент = 
			банк.Наименование
			+ ", " + банк.АдресАнгл
			+ Символы.ПС + "SWIFT: " + банк.SWIFT;
			ТабличныйДокумент.Вывести(обл_Корреспондент);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетИностранный.Банк) Тогда 
			банк = ПараметрыДоговора.РасчетныйСчетИностранный.Банк;
			обл_Получатель.Параметры.БанкПолучателя = 
			банк.Наименование
			+ ", " + банк.АдресАнгл
			+ Символы.ПС + "SWIFT: " + банк.SWIFT
			+?(ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетИностранный.КоррСчет), Символы.ПС + "Acc. " + ПараметрыДоговора.РасчетныйСчетИностранный.КоррСчет,"");
		КонецЕсли;
		обл_Получатель.Параметры.Получатель = 
		"Acc. " + ПараметрыДоговора.РасчетныйСчетИностранный.НомерСчета
		+ Символы.ПС + ПараметрыДоговора.НаименованиеКонтрагентаАнгл
		+ ", " + ПараметрыДоговора.АдресАнгл;
		ТабличныйДокумент.Вывести(обл_Получатель);
		
	КонецЕсли;
	
	//--------
	// верхняя часть
	обл = Макет.ПолучитьОбласть("ВерхняяЧасть");
	Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
		
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокументаАнгл;
		//обл.Параметры.Договор = "Contract №"+Ссылка.Договор.НомерДоговора+" оf  "+Формат(Ссылка.Договор.ДатаДоговора, "ДФ=dd.MM.yyyy");
		обл.Параметры.Покупатель = "Customer: " + ПараметрыУчетнойПолитики.НаименованиеОрганизацииАнгл + ", " + ПараметрыДоговора.АдресОрганизацииАнгл;
		ТабличныйДокумент.Вывести(обл);
		
	ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
		
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокумента + Символы.ПС + ПредставлениеДокументаАнгл;
		//обл.Параметры.Договор = "Договор №"+Ссылка.Договор.НомерДоговора+" от "+Формат(Ссылка.Договор.ДатаДоговора, "ДФ=dd.MM.yyyy")+" / "+"Contract №"+Ссылка.Договор.НомерДоговора+" оf  "+Формат(Ссылка.Договор.ДатаДоговора, "ДФ=dd.MM.yyyy");
		обл.Параметры.Покупатель = "Покупатель / Customer: "+НаименованияОрганиазции.ПолноеНаименование+"/"+ПараметрыУчетнойПолитики.НаименованиеОрганизацииАнгл+", "+ПараметрыДоговора.АдресОрганизации + " / " +ПараметрыДоговора.АдресОрганизацииАнгл;
		ТабличныйДокумент.Вывести(обл);
		
	Иначе 
		
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокумента;
		обл.Параметры.Покупатель = "Покупатель: "+НаименованияОрганиазции.ПолноеНаименование + ", ИНН: "+ Ссылка.Организация.ИНН
		+", "+ПараметрыДоговора.АдресОрганизации + ?(ЗначениеЗаполнено(ПараметрыДоговора.ТелефонОрганизации), ", тел.: "+ ПараметрыДоговора.ТелефонОрганизации, "");
		//обл.Параметры.Договор = "Договор №"+Ссылка.Договор.НомерДоговора+" от "+Формат(Ссылка.Договор.ДатаДоговора, "ДФ=dd.MM.yyyy");
		ТабличныйДокумент.Вывести(обл);
		
	КонецЕсли;
	
	//----------------------
	// дополнительно
	Если ПараметрыДоговора.ВыводитьДополнениевШапкуСчета Тогда
		ОблДоп = Макет.ПолучитьОбласть("Дополнительно");
		Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
			ОблДоп.Параметры.Дополнительно = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеСчетаАнгл, Ссылка, Неопределено, Ссылка.Услуги);
		ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
			ОблДоп.Параметры.Дополнительно = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеСчета, Ссылка, Неопределено, Ссылка.Услуги) + " / " + CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеСчетаАнгл, Ссылка, Неопределено, Ссылка.Услуги);
		Иначе
			ОблДоп.Параметры.Дополнительно = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеСчета, Ссылка, Неопределено, Ссылка.Услуги);
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОблДоп);
	КонецЕсли;	
	
	облОтступ = Макет.ПолучитьОбласть("Отступ");
	ТабличныйДокумент.Вывести(облОтступ);
	
	
	//--------
	//  шапка таблицы, строки таблицы, подвал таблицы
	Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
		облСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыБезНДС");
		облПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицыБезНДС");
	Иначе	
		облСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		облПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	КонецЕсли;	
	Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
		Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_АнглБезНДС");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "TOTAL:";
			облПодвалТаблицы.Параметры.НадписьНДС = "INCLUDING VAT:";
		Иначе	
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Англ");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "TOTAL:";
			стрбезНДС = "Without VAT";
		КонецЕсли;	
	ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
		Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_ДвуязБезНДС");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "ИТОГО / TOTAL:";
			облПодвалТаблицы.Параметры.НадписьНДС = "В т.ч. НДС / INCLUDING VAT:";
		Иначе	
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Двуяз");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "ИТОГО / TOTAL:";
			стрбезНДС = "БЕЗ НДС / Without VAT";
		КонецЕсли;				
	Иначе 
		Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_РусБезНДС");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "ИТОГО:";
			облПодвалТаблицы.Параметры.НадписьНДС = "В т.ч. НДС:";
		Иначе	
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Рус");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "ИТОГО:";
			стрбезНДС = "БЕЗ НДС";
		КонецЕсли;	
	КонецЕсли;
	облШапкаТаблицы.Параметры.Заполнить(Новый Структура("Валюта", Ссылка.Валюта));
	ТабличныйДокумент.Вывести(облШапкаТаблицы);
	
	// ---------------------------------------------------------------------------- 
	// определяем таблицу услуг для вывода
	ОсновнойЯзык = Константы.CW_ОсновнойЯзык.Получить();
	
	ТаблицаУслуг = CW_Финансы.ПолучитьУслугиДокумента(Ссылка);
	ТаблицаУслуг.Колонки.Добавить("ПредставлениеГП");
	Для Каждого СтрокаУслуг из ТаблицаУслуг Цикл
		СтрокаУслуг.ПредставлениеГП = СокрЛП(СтрокаУслуг.Грузоперевозка.CW_Представление);
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов) И ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов.СворачиватьПоГрузоперевозкам Тогда
		ТЗ_Усл = ТаблицаУслуг.Скопировать();
		ТЗ_Ит  = ТаблицаУслуг.Скопировать();
		ТЗ_Ит.Очистить();
		ТЗ_ГП  = ТЗ_Усл.Скопировать();
		ТЗ_ГП.Свернуть("ПредставлениеГП");
		ТЗ_ГП.Колонки.Добавить("Представление");
		ТЗ_ГП.Колонки.Добавить("НомСтр");
		ТЗ_ГП.Колонки.Добавить("Итого");
		НомСтр = 0;
		Для Каждого Стр_ГП из ТЗ_ГП Цикл
			ТЗ_Отбор = ТЗ_Усл.Скопировать(Новый Структура("ПредставлениеГП", Стр_ГП.ПредставлениеГП));
			
			Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов.ШаблонСверткиПоГрузоперевозкамАнгл, Ссылка, Неопределено, ТЗ_Отбор);
			ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов.ШаблонСверткиПоГрузоперевозкам, Ссылка, Неопределено, ТЗ_Отбор) + " / " + CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов.ШаблонСверткиПоГрузоперевозкамАнгл, Ссылка, Неопределено, ТЗ_Отбор);
			Иначе 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов.ШаблонСверткиПоГрузоперевозкам, Ссылка, Неопределено, ТЗ_Отбор);
			КонецЕсли;
			Стр_ГП.НомСтр = НомСтр;
			Стр_ГП.Итого  = ТЗ_Отбор.Итог("Всего");
			
			CW_Печать.ПодготовитьТаблицуУслуг(ТЗ_Отбор, Ссылка, ПараметрыДоговора, "счет");
			Для Каждого Стр_Отбор из ТЗ_Отбор Цикл
				Стр_Ит = ТЗ_Ит.Добавить();
				ЗаполнитьЗначенияСвойств(Стр_Ит, Стр_Отбор);
			КонецЦикла;	
			НомСтр = НомСтр + 1 + ТЗ_Отбор.Количество();
		КонецЦикла;
		ТаблицаУслуг = ТЗ_Ит.Скопировать();
	Иначе	
		CW_Печать.ПодготовитьТаблицуУслуг(ТаблицаУслуг,Ссылка,ПараметрыДоговора,"счет");
	КонецЕсли;	
	// ----------------------------------------------------------------------------  
	
	ВсегоСтрокДляВывода = ТаблицаУслуг.Количество();
	ТекущаяСтрока = 0;
	
	// подготовим подвал и подписи
	// ---------------------------------------------------------------------------- 
	Подвал = Новый ТабличныйДокумент;
	// --- 
	Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
		Итого = _сф.Итог(Ссылка.Услуги,"Всего");
		облПодвалТаблицы.Параметры.СуммаИтого = Итого;
		облПодвалТаблицы.Параметры.СуммаНДС = _сф.Итог(Ссылка.Услуги,"НДС");
	Иначе	
		облПодвалТаблицы.Параметры.Сумма = _сф.Итог(Ссылка.Услуги,"Сумма");
		облПодвалТаблицы.Параметры.СуммаНДС = _сф.Итог(Ссылка.Услуги,"НДС");
		Если облПодвалТаблицы.Параметры.СуммаНДС = 0 Тогда
			ТЗ_НДС = Ссылка.Услуги.Выгрузить();
			ТЗ_НДС.Свернуть("СтавкаНДС");
			Если ТЗ_НДС.Количество() = 1 Тогда
				Если ТЗ_НДС[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					облПодвалТаблицы.Параметры.СуммаНДС = "-";
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
		Итого = _сф.Итог(Ссылка.Услуги,"Всего");
		облПодвалТаблицы.Параметры.СуммаИтого = Итого;
	КонецЕсли;	
	Подвал.Вывести(облПодвалТаблицы);
	// --- 
	// итого и сумма прописью
	
	// представление строки НДС
	ТаблицаНДС = Ссылка.Услуги.Выгрузить(,"СтавкаНДС,НДС");
	ТаблицаНДС.Свернуть("СтавкаНДС","НДС");
	ПредставлениеНДС = "";
	ПредставлениеНДСАнгл = "";
	СуммаНДС = _сф.Итог(Ссылка.Услуги,"НДС");
	ЕстьНДС = (СуммаНДС <> 0);
	Если (ЕстьНДС) Тогда
		
		Для каждого Стр Из ТаблицаНДС Цикл
			
			Если (Стр.СтавкаНДС = перечисления.СтавкиНДС.НДС18) Тогда
				ндс = "18%";
			ИначеЕсли (Стр.СтавкаНДС = перечисления.СтавкиНДС.НДС10) Тогда 
				ндс = "10%";
			ИначеЕсли (Стр.СтавкаНДС = перечисления.СтавкиНДС.НДС20) Тогда 
				ндс = "20%";
			Иначе
				Продолжить;
			КонецЕсли; 
			ПредставлениеНДС     = ПредставлениеНДС + ", в том числе НДС "+ндс+" - "+Формат(Стр.НДС,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Ссылка.Валюта);
			ПредставлениеНДСАнгл = ПредставлениеНДСАнгл + ", including VAT " + Формат(ТаблицаУслуг.Итог("НДС"),"ЧДЦ=2; ЧРД=.; ЧРГ=,; ЧН=0.00")+" "+?(Ссылка.Валюта.Код = "643", "rub.", Ссылка.Валюта);
			
		КонецЦикла; 
		
	Иначе
		
		Если ПараметрыДоговора.ВыводСуммыБезНДС = 1 Тогда
			масНДС = Ссылка.Услуги.НайтиСтроки(Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.НДС0));
			Если масНДС.Количество() > 0 Тогда
				ПредставлениеНДС     = ", без НДС";
				ПредставлениеНДСАнгл = ", without VAT";
			Иначе
				ПредставлениеНДС     = ", НДС не облагается";
				ПредставлениеНДСАнгл = ", without VAT";
			КонецЕсли;	
		ИначеЕсли ПараметрыДоговора.ВыводСуммыБезНДС = 0 Тогда	
			ПредставлениеНДС     = ", в том числе НДС 0,00 " + Строка(Ссылка.Валюта);
			ПредставлениеНДСАнгл = ", including VAT 0,00 " + ?(Ссылка.Валюта.Код = "643", "rub.", Ссылка.Валюта);
		КонецЕсли;	
		
	КонецЕсли; 
	
	
	обл = Макет.ПолучитьОбласть("ИтогоСуммаПрописью");
	Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
		
		обл.Параметры.ИтоговыйТекст = "Total items "+ТаблицаУслуг.Количество()+", the amount is "+Формат(Итого,"ЧДЦ=2; ЧРД=.; ЧРГ=,")+" "+?(Ссылка.Валюта.Код = "643", "rub.", Ссылка.Валюта);
		обл.Параметры.СуммаПрописью = CW_Печать.СформироватьСуммуПрописьюАнгл(Итого, Ссылка.Валюта) + ПредставлениеНДСАнгл;
		
	ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
		
		обл.Параметры.ИтоговыйТекст = "Всего наименований "+ТаблицаУслуг.Количество()+", на сумму "+Формат(Итого,"ЧДЦ=2")+" "+Ссылка.Валюта
		+ Символы.ПС + ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Итого, Ссылка.Валюта) + ПредставлениеНДС; // ВызовБП
		обл.Параметры.СуммаПрописью = ""
		+ Символы.ПС + "Total items "+ТаблицаУслуг.Количество()+", the amount is "+Формат(Итого,"ЧДЦ=2; ЧРД=.; ЧРГ=,")+" "+?(Ссылка.Валюта.Код = "643", "rub.", Ссылка.Валюта)
		+ Символы.ПС + CW_Печать.СформироватьСуммуПрописьюАнгл(Итого, Ссылка.Валюта) + ПредставлениеНДСАнгл;
		
	Иначе 
		
		обл.Параметры.ИтоговыйТекст = "Всего наименований "+ТаблицаУслуг.Количество()+", на сумму "+Формат(Итого,"ЧДЦ=2")+" "+Ссылка.Валюта;
		обл.Параметры.СуммаПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Итого, Ссылка.Валюта) + ПредставлениеНДС; // ВызовБП
		
	КонецЕсли;
	Подвал.Вывести(обл);
	// --- 
	// рублёвый счет
	Если ПараметрыДоговора.ВыводитьПодвалВСчете = 1 Тогда
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов=0) Тогда 
			стрДополнительнаяИнформация = ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалРус;
			Если НЕ ПустаяСтрока(стрДополнительнаяИнформация) Тогда 
				обл = Макет.ПолучитьОбласть("ДопИнфо");
				обл.Параметры.ДополнительнаяИнформация = стрДополнительнаяИнформация;
				Подвал.Вывести(обл);
			КонецЕсли;
		КонецЕсли;
		// валютный счет, англ
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
			стрДополнительнаяИнформация = ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалАнгл;
			Если НЕ ПустаяСтрока(стрДополнительнаяИнформация) Тогда 
				обл = Макет.ПолучитьОбласть("ДопИнфо");
				обл.Параметры.ДополнительнаяИнформация = стрДополнительнаяИнформация;
				Подвал.Вывести(обл);
			КонецЕсли;
		КонецЕсли;
		// валютный счет, рус/двуяз
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
			стрДополнительнаяИнформация = ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалРус + " / " + ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалАнгл;
			Если НЕ ПустаяСтрока(стрДополнительнаяИнформация) Тогда 
				обл = Макет.ПолучитьОбласть("ДопИнфо");
				обл.Параметры.ДополнительнаяИнформация = стрДополнительнаяИнформация;
				Подвал.Вывести(обл);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ПараметрыДоговора.ВыводитьПодвалВСчете = 2 Тогда
		Обл = Макет.ПолучитьОбласть("ПодвалПоШаблону");
		Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
			Обл.Параметры.ДополнительнаяИнформацияПоШаблону = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчетеАнгл, Ссылка, Неопределено, Ссылка.Услуги);
		ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
			Обл.Параметры.ДополнительнаяИнформацияПоШаблону = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчете, Ссылка, Неопределено, Ссылка.Услуги) +
			Символы.ПС +
			CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчетеАнгл, Ссылка, Неопределено, Ссылка.Услуги);
		Иначе
			Обл.Параметры.ДополнительнаяИнформацияПоШаблону = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчете, Ссылка, Неопределено, Ссылка.Услуги);				
		КонецЕсли;
		Подвал.Вывести(Обл);
	КонецЕсли;
	
	// --- 
	
	
	// подписи, печать
	// ---------------------------------------------------------------------------- 
	обл = Макет.ПолучитьОбласть("Подписи");
	ВыводитьПодписиИПечать = НастройкиПечати.ПодписьИПечать = Истина ИЛИ (Ссылка.Договор.ПодставлятьПодписиИПечатьПриЭлектроннойРассылке И НастройкиПечати.ДляРассылки);
	//ВыводитьПодписиИПечать = Истина;
	
	РисунокПечатьОрганизации = обл.Рисунки.ПечатьОрганизации;
	РисунокПечатьОрганизации.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	РисунокПечатьОрганизации.ВыводитьНаПечать = Ложь;
	// --- 
	РисунокПодписьРуководителя = обл.Рисунки.ПодписьРуководителя;
	РисунокПодписьРуководителя.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	РисунокПодписьРуководителя.ВыводитьНаПечать = Ложь;
	// --- 
	РисунокПодписьБухгалтера = обл.Рисунки.ПодписьБухгалтера;
	РисунокПодписьБухгалтера.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	РисунокПодписьБухгалтера.ВыводитьНаПечать = Ложь;
	
	//Закомментирован т.к. получает подписантов организации
	//Подписанты = CW_Печать.ВернутьПодписантов(Ссылка, ПД);
	
	
	
	Если ВыводитьПодписиИПечать Тогда
		
		//подпись руководителя...
		// ---------------------------------------------------------------------------- 
		
		Картинка = ПараметрыДоговора.ПодписьРуководителя.Получить();
		Если Картинка <> Неопределено Тогда
			
			РисунокПодписьРуководителя.ВыводитьНаПечать = Истина;
			Если ТипЗнч(Картинка) = Тип("ДвоичныеДанные") Тогда
				РисунокПодписьРуководителя.Картинка = Новый Картинка(Картинка);
			ИначеЕсли ТипЗнч(Картинка) = Тип("Картинка") Тогда
				РисунокПодписьРуководителя.Картинка = Картинка;
			Иначе
				РисунокПодписьРуководителя.ВыводитьНаПечать = Ложь;
			КонецЕсли; 
			
		КонецЕсли; 
		
		
		
		
		//подпись главного бухгалтера...
		// ---------------------------------------------------------------------------- 
		
		Картинка = ПараметрыДоговора.ПодписьГлБухгалтера.Получить();
		Если Картинка <> Неопределено Тогда
			
			РисунокПодписьБухгалтера.ВыводитьНаПечать = Истина;
			Если ТипЗнч(Картинка)=Тип("ДвоичныеДанные") Тогда
				РисунокПодписьБухгалтера.Картинка = Новый Картинка(Картинка);
			ИначеЕсли ТипЗнч(Картинка) = Тип("Картинка") Тогда 
				РисунокПодписьБухгалтера.Картинка = Картинка;
			Иначе
				РисунокПодписьБухгалтера.ВыводитьНаПечать = Ложь;
			КонецЕсли; 
			
		КонецЕсли;
		
		
		
		//вывод печати...
		// ---------------------------------------------------------------------------- 
		
		Картинка = ПараметрыДоговора.Печать.Получить();
		Если Картинка <> Неопределено Тогда
			
			РисунокПечатьОрганизации.ВыводитьНаПечать = Истина;
			Если (ТипЗнч(Картинка)=Тип("ДвоичныеДанные")) Тогда
				РисунокПечатьОрганизации.Картинка = Новый Картинка(Картинка);
			ИначеЕсли ТипЗнч(Картинка) = Тип("Картинка") Тогда
				РисунокПечатьОрганизации.Картинка = Картинка;
			Иначе
				РисунокПечатьОрганизации.ВыводитьНаПечать = Ложь;
			КонецЕсли; 
			
		КонецЕсли;
		
		
		
	КонецЕсли; 
	
	Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
		
		обл.Параметры.ДолжностьРуководителя = ПараметрыДоговора.ДолжностьРуководителяАнгл;
		обл.Параметры.ДолжностьГлавныйБухгалтер = "Chief accounting manager";
		обл.Параметры.ФиоРуководителя = CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.РуководительАнгл)
		+ ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл), " (" + ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл + ")", "");
		обл.Параметры.ФиоГлавБуха     = CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.ГлавныйБухгалтерАнгл)
		+ ?(ЗначениеЗаполнено(ПараметрыДоговора.ГлавныйБухгалтерКонтрагентаОснованиеАнгл), " (" + ПараметрыДоговора.ГлавныйБухгалтерКонтрагентаОснованиеАнгл + ")", "");
		обл.Параметры.НадписьМП = "SEAL";
		
	ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
		
		обл.Параметры.ДолжностьРуководителя = ПараметрыДоговора.ДолжностьРуководителя + Символы.ПС + ПараметрыДоговора.ДолжностьРуководителяАнгл;
		обл.Параметры.ДолжностьГлавныйБухгалтер = "Главный бухгалтер " + Символы.ПС + "Chief accounting manager";
		обл.Параметры.ФиоРуководителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.Руководитель) + ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснование), " (" + ПараметрыДоговора.РуководительКонтрагентаОснование + ")", "")
		+ Символы.ПС + CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.РуководительАнгл)
		+ ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл), " (" + ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл + ")", "");
		обл.Параметры.ФиоГлавБуха     = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.ГлавныйБухгалтер) + ?(ЗначениеЗаполнено(ПараметрыДоговора.ГлавныйБухгалтерКонтрагентаОснование), " (" + ПараметрыДоговора.ГлавныйБухгалтерКонтрагентаОснование + ")", "") 
		+ Символы.ПС + CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.ГлавныйБухгалтерАнгл)
		+ ?(ЗначениеЗаполнено(ПараметрыДоговора.ГлавныйБухгалтерКонтрагентаОснованиеАнгл), " (" + ПараметрыДоговора.ГлавныйБухгалтерКонтрагентаОснованиеАнгл + ")", "");
		обл.Параметры.НадписьМП = "М.П."+ Символы.ПС +"SEAL";
		
	Иначе 
		
		обл.Параметры.ДолжностьРуководителя = ПараметрыДоговора.ДолжностьРуководителя;
		обл.Параметры.ДолжностьГлавныйБухгалтер = "Главный бухгалтер";
		обл.Параметры.ФиоРуководителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.Руководитель) + ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснование), " (" + ПараметрыДоговора.РуководительКонтрагентаОснование + ")", "");
		обл.Параметры.ФиоГлавБуха     = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.ГлавныйБухгалтер) + ?(ЗначениеЗаполнено(ПараметрыДоговора.ГлавныйБухгалтерКонтрагентаОснование), " (" + ПараметрыДоговора.ГлавныйБухгалтерКонтрагентаОснование + ")", "");
		обл.Параметры.НадписьМП = "М.П.";
		
	КонецЕсли;
	
	// ---------------------------------------------------------------------------- 
	Подвал.Вывести(обл);
	
	// подготовка единиц измерения
	ТЗЕИ = ТаблицаУслуг.Скопировать(,"Номенклатура");
	ТЗЕИ.Свернуть("Номенклатура");
	МассивНоменклатуры = ТЗЕИ.ВыгрузитьКолонку("Номенклатура");
	// --- 
	МассивЯзыков = Новый Массив;
	МассивЯзыков.Добавить(Справочники.CW_Языки.ru);
	МассивЯзыков.Добавить(Справочники.CW_Языки.en);
	// --- 
	ОсновнойЯзык = Константы.CW_ОсновнойЯзык.Получить();
	// --- 
	СоответствиеПереводовЕдиниц = Новый Соответствие;
	// --- 
	Для каждого Номенклатура Из МассивНоменклатуры Цикл
		СтруктураПеревода = CW_ПереводыСервер.ПолучитьПереводы(Номенклатура.ЕдиницаИзмерения, ,МассивЯзыков);
		СоответствиеПереводовЕдиниц.Вставить(Номенклатура.ЕдиницаИзмерения, СтруктураПеревода);
	КонецЦикла; 
	
	// --- 
	
	НомСтрГП = 0;
	Для каждого усл Из ТаблицаУслуг Цикл
		
		_сф.Инкремент(ТекущаяСтрока);
		
		стру = Новый Структура;
		стру.Вставить("Номер",        ТекущаяСтрока);
		стру.Вставить("Наименование", усл.Представление);
		// --- 
		
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов=0) Тогда
			стру.Вставить("Единица",      СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["ru"] );
		ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 					
			стру.Вставить("Единица",      СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["en"] ); 
		ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
			стру.Вставить("Единица",      СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["ru"] + "/" + СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["en"] );
		КонецЕсли; 
		
		Если СокрЛП(усл.Номенклатура.ЕдиницаИзмерения.Наименование) = "-" Тогда
			Если ПараметрыДоговора.ВыводитьКоличествоЦенуУслугБезЕИ Тогда
				стру.Вставить("Количество",   Усл.Количество);
				стру.Вставить("Цена",         Усл.Цена);
			Иначе
				стру.Вставить("Количество", "-");
				стру.Вставить("Цена", "-");
			КонецЕсли;
		Иначе
			стру.Вставить("Количество",   Усл.Количество);
			стру.Вставить("Цена",         Усл.Цена);
		КонецЕсли;	
		
		
		
		стру.Вставить("Сумма",        усл.Сумма);
		стру.Вставить("СтавкаНДС",    ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, стрБезНДС, усл.СтавкаНДС));
		стру.Вставить("СуммаНДС",     усл.НДС);
		стру.Вставить("Итого",        усл.Всего);
		
		Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов) И ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов.СворачиватьПоГрузоперевозкам Тогда
			СтрТЗ_ГП = ТЗ_ГП.Найти(НомСтрГП, "НомСтр");
			Если СтрТЗ_ГП <> Неопределено Тогда
				ОблГП = Макет.ПолучитьОбласть("Группировка");
				ОблГП.Параметры.Группировка = СтрТЗ_ГП.Представление;
				Если ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов.ВыводитьИтогиПоГрузоперевозкам Тогда
					ОблГП.Параметры.Итого = СтрТЗ_ГП.Итого;
				КонецЕсли;	
				ТабличныйДокумент.Вывести(ОблГП);
				НомСтрГП = НомСтрГП + 1;
			КонецЕсли;	
		КонецЕсли;	
		НомСтрГП = НомСтрГП + 1;
		
		облСтрокаТаблицы.Параметры.Заполнить(стру);
		Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
			облСтрокаТаблицы.Параметры.Цена = усл.Цена; 
		Иначе	
			облСтрокаТаблицы.Параметры.СуммаНДС = ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, "-", усл.НДС);
		КонецЕсли;	
		
		Если ТекущаяСтрока = ВсегоСтрокДляВывода Тогда
			
			// проверяем, влезает ли строка, итог и подвал
			ВТД = Новый ТабличныйДокумент;
			ВТД.Вывести(облСтрокаТаблицы);
			ВТД.Вывести(Подвал);
			
			Если ТабличныйДокумент.ПроверитьВывод(ВТД) Тогда
				
				ТабличныйДокумент.Вывести(ВТД);
				
			Иначе
				
				Если ВсегоСтрокДляВывода =1 Тогда
					
					// ничего не поделать
					ТабличныйДокумент.Вывести(ВТД);
					
				Иначе
					
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(облШапкаТаблицы);
					ТабличныйДокумент.Вывести(ВТД);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		Иначе
			
			ТабличныйДокумент.Вывести(облСтрокаТаблицы);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	
	РезультатПечати.ПечатнаяФорма = ТабличныйДокумент;
	
	
	Возврат РезультатПечати;
	
КонецФункции
#КонецЕсли