
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,  КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	НачалоПериода 	= МакетКомпоновки.ЗначенияПараметров.НачалоПериода.Значение;
	КонецПериода 	= МакетКомпоновки.ЗначенияПараметров.КонецПериода.Значение;
	Организация 	= МакетКомпоновки.ЗначенияПараметров.Организация.Значение;
	
	СведенияОДоходах = ПолучитьСведенияОДоходах(Организация, НачалоПериода, КонецПериода);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ВнешнийНабор", СведенияОДоходах);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
КонецПроцедуры   

Функция ПолучитьСведенияОДоходах(Организация, НачалоПериода, КонецПериода)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыНерезидентовСведенияОДоходах.Контрагент КАК Контрагент,
	               |	ЛОЖЬ КАК ТребуетсяЗаполнение,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК Наименование_ru,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК Наименование_en,
	               |	ВЫРАЗИТЬ(0 КАК ЧИСЛО(3, 0)) КАК КодСтраны,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК АдресВСтранеРегистрации,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК КодНалогоплательщика
	               |ИЗ
	               |	Справочник.CW_ДоходыНерезидентовСведенияОДоходах КАК CW_ДоходыНерезидентовСведенияОДоходах
	               |ГДЕ
	               |	CW_ДоходыНерезидентовСведенияОДоходах.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ДоходыНерезидентовСведенияОДоходах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И CW_ДоходыНерезидентовСведенияОДоходах.Организация = &Организация";   
	
	Запрос.УстановитьПараметр("НачалоПериода", 	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 	КонецПериода);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	Для Каждого СтрокаТаблицы из ТаблицаЗапроса Цикл 
		
		СведенияКонтрагента = CW_ДоходыНерезидентовДополнительный.ПолучитьСведенияКонтрагента(СтрокаТаблицы.Контрагент, КонецПериода);
	
		СтрокаТаблицы.Наименование_ru 			= СведенияКонтрагента.ПолноеНаименование_ru;
		СтрокаТаблицы.Наименование_en 			= СведенияКонтрагента.ПолноеНаименование;
		СтрокаТаблицы.КодСтраны 				= СведенияКонтрагента.КодСтраны;
		СтрокаТаблицы.АдресВСтранеРегистрации	= СведенияКонтрагента.ЮридическийАдерс;
		СтрокаТаблицы.КодНалогоплательщика 		= СведенияКонтрагента.РегистрационныйНомер; 	
		
		СтрокаТаблицы.ТребуетсяЗаполнение = НЕ (ЗначениеЗаполнено(СведенияКонтрагента.ПолноеНаименование_ru) 
											И ЗначениеЗаполнено(СведенияКонтрагента.ПолноеНаименование)
											И ЗначениеЗаполнено(СведенияКонтрагента.КодСтраны)
											И ЗначениеЗаполнено(СведенияКонтрагента.ЮридическийАдерс)
											И ЗначениеЗаполнено(СведенияКонтрагента.РегистрационныйНомер));
		
	КонецЦикла;  
	
	ТаблицаЗапроса.Свернуть("Контрагент,ТребуетсяЗаполнение,Наименование_ru,Наименование_en,КодСтраны,АдресВСтранеРегистрации,КодНалогоплательщика",);
	
    Возврат ТаблицаЗапроса;
	
КонецФункции
