
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Ответ = ПроверитьВозможностьОткрытияСписка(ПараметрКоманды);
	Если Ответ.Успешно = Ложь Тогда
		ПоказатьПредупреждение(, Ответ.Описание);
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = ПолучитьСтруктуруОтбораНаСервере(ПараметрКоманды);  

	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("Отбор", 				СтруктураОтбора);
	ПараметрыФормы.Вставить("ДокументРеализации", 	СтруктураОтбора.ДокументРеализации);

	ОткрытьФорму("Справочник.CW_РеестрыНДС0ЗаписиРеестра.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры   

&НаСервере
Функция ПолучитьСтруктуруОтбораНаСервере(ПараметрКоманды)   
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		  ДокументРеализации = ПараметрКоманды;
	КонецЕсли; 
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда    
		  ДокументРеализации = CW_РеестрыНДС0СерверВызовСервера.ПолучитьВедомыйВедущийДокумент(ПараметрКоманды).ВедомыйДокумент;     
	КонецЕсли;   
	
	Структура = Новый Структура;
	Структура.Вставить("Организация", 			ПараметрКоманды.Организация);
	Структура.Вставить("ДокументРеализации", 	ДокументРеализации);
	
	Возврат Структура;
	
КонецФункции    

&НаСервере
Функция ПроверитьВозможностьОткрытияСписка(ПараметрКоманды) 
	
	Ответ = Новый Структура("Успешно, Описание", Истина,"");
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда 
		
		ВедомыйВедущий  = CW_РеестрыНДС0СерверВызовСервера.ПолучитьВедомыйВедущийДокумент(ПараметрКоманды);
		ВедомыйДокумент = ВедомыйВедущий.ВедомыйДокумент;
		Если Не ЗначениеЗаполнено(ВедомыйДокумент) Тогда 
			Ответ.Успешно = Ложь;
			Ответ.Описание = "Отсутствует ведомый документ";
		КонецЕсли;
	Иначе	
		ВедущийДокумент = ПолучитьВедущийДокумент(ПараметрКоманды);
		Если ВедущийДокумент = Неопределено Тогда  
			Ответ.Успешно = Ложь;
			Ответ.Описание = "Документ не связан с документом модуля ""Бухгалтерия экспедитора""";
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПолучитьВедущийДокумент(ПараметрКоманды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ДоходыПоГрузоперевозке.Ссылка
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозке.ВедомыйДокумент = &ВедомыйДокумент"; 
	
	Запрос.УстановитьПараметр("ВедомыйДокумент", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

