
Процедура ЗаписатьСоответствиеНоменклатуры(Поставщик, Наименование, Номенклатура) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.CW_СоответствияНоменклатурыПоставщиков.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Контрагент = Поставщик;
	ЗаписьРегистра.Наименование = Наименование;
	ЗаписьРегистра.Номенклатура = Номенклатура;
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры  

Функция ПолучитьСоответствиеНоменклатуры(Контрагент, Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_СоответствияНоменклатурыПоставщиков.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.CW_СоответствияНоменклатурыПоставщиков КАК CW_СоответствияНоменклатурыПоставщиков
	               |ГДЕ
	               |	CW_СоответствияНоменклатурыПоставщиков.Контрагент = &Контрагент
	               |	И CW_СоответствияНоменклатурыПоставщиков.Наименование = &Наименование"; 
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Наименование", Наименование); 
	
	РезультатЗапроса = запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Номенклатура;
	КонецЕсли;
	
КонецФункции