
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ПодключаемыйОбъект = Параметры.Объект;
	Если  ЗначениеЗаполнено(Объект.ПодключаемыйОбъект) Тогда
		Настройки = _ПО.ПолучитьНастройкиОбработки(Объект.ПодключаемыйОбъект);
		Если (Настройки <> Неопределено) Тогда
			Если Настройки.Свойство("МассивПараметров") Тогда
				СписокПараметров.ЗагрузитьЗначения(Настройки.МассивПараметров);
			КонецЕсли;
			Если Настройки.Свойство("ФлагМножественногоВыбора") Тогда
				ФлагМножественногоВыбора = Настройки.ФлагМножественногоВыбора;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНастройки();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	СтруктураНастройки = Новый Структура;
	
	СтруктураНастройки.Вставить("МассивПараметров"			, СписокПараметров.ВыгрузитьЗначения());
	СтруктураНастройки.Вставить("ФлагМножественногоВыбора"	, ФлагМножественногоВыбора);

	_ПО.ЗаписатьНастройкиОбработки(Объект.ПодключаемыйОбъект,СтруктураНастройки); 
	
	ЗаписатьОбработкуВРеквизитПараметраНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбработкуВРеквизитПараметраНаСервере()
	
	Для Каждого ЭлементСписка из СписокПараметров Цикл
		
		ОбъектТекущийПараметр = ЭлементСписка.Значение.ПолучитьОбъект();
		ОбъектТекущийПараметр.ИспользуетсяОбработкаПередНачаломВыбора   = Истина;
		ОбъектТекущийПараметр.МножественноеПрямоеРедактирование 		= Ложь;
		ОбъектТекущийПараметр.ВнешняяОбработкаПередНачаломВыбора = Объект.ПодключаемыйОбъект;
		
		Попытка
			ОбъектТекущийПараметр.Записать();
		исключение
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст = "не удалось записать параметр "+ ЭлементСписка.Представление;
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбработкуВРеквизитПараметра(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Для выбранных параметров будет установления обработка начала редактирования. Продолжить?", Режим, 0);
	
КонецПроцедуры



&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ЗаписатьОбработкуВРеквизитПараметраНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗначениеЭлемента(Команда)
	
	ПоказатьЗначение(,Элементы.СписокПараметров.ТекущиеДанные.Значение);
	
КонецПроцедуры


 