
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	
	Параметры.Свойство("RU", ТекстRU);
	Параметры.Свойство("EN", ТекстEN); 
	Параметры.Свойство("МногострочныйРежим", МногострочныйРежим);	
	
	Элементы.ТекстRU.МногострочныйРежим = МногострочныйРежим;
	Элементы.ТекстEN.МногострочныйРежим = МногострочныйРежим;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда) 
	
	Структура = новый Структура;
	Структура.Вставить("RU", ТекстRU);
	Структура.Вставить("EN", ТекстEN); 
	
	ЭтаФорма.Закрыть(Структура);

КонецПроцедуры
