#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Инициализация_отчета
// информация об отчете
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОтчет();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешнийОтчет();
	
	СтруктураОписания.Наименование 				= "Реализация за период (Внешний)";
	СтруктураОписания.Описание 					= "Реализация за период (Внешний)";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.10.10";
	
	СтруктураОписания.РасполагатьНаРабочемСтоле =  Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "ОткрытьФорму");
	
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыОбъекта(СтруктураОписания, 		"ФормаОтчета");

	CW_ПодключаемыеКомандыСервер.УстановитьКомандыВнешнегоОбъекта(СтруктураОписания,
						"ВнешнийОтчет_CW_РеализацияЗаПериод",
						"Реализация за период (Внешний)",
						"Отчет",
						Ложь);
	
	Возврат СтруктураОписания;
	
КонецФункции

#КонецОбласти

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	// --- 
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// ---
	НастройкиСКД.Выбор.Элементы.Очистить();
	НастройкиСКД.Структура.Очистить();

	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	
	//Параметры вывода
	СтркутураПараметров = Новый Структура;
	СтркутураПараметров.Вставить("Заголовок"					, ВРег(МетаданныеОтчета.Синоним));
	СтркутураПараметров.Вставить("РасположениеРеквизитов"		, ?(Настройки.ОбъединитьГруппировки,РасположениеРеквизитовКомпоновкиДанных.Отдельно			, РасположениеРеквизитовКомпоновкиДанных.ВСпециальнойПозиции));
	СтркутураПараметров.Вставить("РасположениеГруппировки"		, ?(Настройки.ОбъединитьГруппировки,РасположениеГруппировкиКомпоновкиДанных.Конец			, Неопределено));
	СтркутураПараметров.Вставить("РасположениеПолейГруппировки"	, ?(Настройки.ОбъединитьГруппировки,РасположениеПолейГруппировкиКомпоновкиДанных.Отдельно	, Неопределено));
	СтркутураПараметров.Вставить("ТипЗаголовкаПолей"			, ?(Настройки.ОбъединитьГруппировки,ТипЗаголовкаПолейКомпоновкиДанных.Краткий				, Неопределено));
	
	CW_Отчеты.УстановитьПараметрыВыводаКомпоновкиДанных(НастройкиСКД, СтркутураПараметров);
	
	
	//Параметры данных
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ВариантПериода"			, Настройки.ВариантПериодаОтчета		, НастройкиСКД.ПараметрыДанных);

	Если Настройки.ВариантПериодаОтчета = 1 Тогда //По первичным
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоПериода"				, Дата(1,1,1)	, НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецПериода"				, Дата(1,1,1)	, НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоПериодаПоДокументам"	, НачалоДня(Настройки.НачалоПериода), НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецПериодаПоДокументам"	, КонецДня(Настройки.КонецПериода)	, НастройкиСКД.ПараметрыДанных);
	Иначе
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоПериода"				, НачалоДня(Настройки.НачалоПериода), НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецПериода"				, КонецДня(Настройки.КонецПериода)	, НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоПериодаПоДокументам"	, Дата(1,1,1)	, НастройкиСКД.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецПериодаПоДокументам"	, Дата(1,1,1)	, НастройкиСКД.ПараметрыДанных);
	КонецЕсли;
	
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПериодНачало"				, НачалоДня(Настройки.НачалоПериода), НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПериодКонец"				, КонецДня(Настройки.КонецПериода)	, НастройкиСКД.ПараметрыДанных);
		
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ФормированиеОтчета"		, Настройки.ВариантФормирования		, НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПорядокОтраженияДоходов"	, Настройки.ПорядокОтражения		, НастройкиСКД.ПараметрыДанных);
	
	Если (Настройки.ИсключатьВнутрихолдинговыеВзаиморасчеты) Тогда
		ЗначениеПараметра = CW_Финансы.ПолучитьКонтрагентовХолдинга();	
	Иначе
		ЗначениеПараметра = Новый Массив;
	КонецЕсли; 
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонтрагентыХолдинга", ЗначениеПараметра, НастройкиСКД.ПараметрыДанных);
	
	//----
	//Выбранные поля
	мПоляОтчета = Настройки.Группировки.ВыгрузитьКолонку("ИмяПоля");
	CW_Отчеты.УстановитьВыбранныеПоляКомпоновкиДанных(НастройкиСКД 	, мПоляОтчета);	
	
	//----
	//Дополним выбранные поля выбранными показателями
	CW_Отчеты.УстановитьПоказателиКомпоновкиДанных(НастройкиСКД 		, Настройки.Показатели);	
	
	//----
	// формируем структуру отчета по группировкам
	CW_Отчеты.УстановитьГруппировкиОтчетаКомпановкиДанных(НастройкиСКД.Структура, Настройки.Группировки, Настройки.ОбъединитьГруппировки);
	
	// ---------------------------------------------------------------------------- 
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());   
	Если ГруппаПользователя.ФильтрГрузоперевозок 
		ИЛИ ГруппаПользователя.ФильтрЗаказов Тогда
		КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	КонецЕсли;	
	
	Если ГруппаПользователя.ФильтрГрузоперевозок Тогда
		ФильтрГрузоперевозок = ГруппаПользователя.ХранилищеФильтраГрузоперевозок.Получить(); 
		CW_Отчеты.СкопироватьОтбор(ФильтрГрузоперевозок.Отбор, КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Грузоперевозка");
	КонецЕсли;
	
	//Если ГруппаПользователя.ФильтрЗаказов Тогда
	//	ФильтрЗаказов = ГруппаПользователя.ХранилищеФильтраЗаказов.Получить(); 
	//	КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	//	CW_Отчеты.СкопироватьОтбор(ФильтрГрузоперевозок.Отбор, КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Заказ");
	//КонецЕсли;
	
	
КонецПроцедуры
#КонецЕсли