#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 					= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте();
	СтруктураОписания.Тип 				= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 				= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешнийНумератор();

	СтруктураОписания.Наименование 				= "Внешний нумератор (счета - сплошная впределах даты, акты - независимая в пределах даты)";
	СтруктураОписания.Описание 					= "Обеспечивает сплошную нумерацию счетов и независимую для актов и с/ф в пределах даты";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	//Методы
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания,	"Регистрация");
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания,	"ОбработчикПриПроведении");
	//Методы
	
	Возврат СтруктураОписания;

КонецФункции

Функция Регистрация(СсылкаНаОбъект) Экспорт 
	
	Возврат(_УФКС.Ответ());
	
КонецФункции
// --- 



Процедура УстановитьНомерДокумента(Объект,СтандартнаяОбработка,Префикс) Экспорт
	
	Префикс = Строка(Объект.Организация.Префикс)+Строка(Формат(Объект.Дата,"ДФ=ММ"))+ Строка(Формат(Объект.Дата,"ДФ=dd"))+"-";
	
КонецПроцедуры

Процедура УстановитьНомерСчета(Объект, СчетОбъект=Неопределено) Экспорт 
	
	Если СчетОбъект <> Неопределено Тогда
		Объект.Номер = СчетОбъект.Номер;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНомерАкта(Ведущий, АктОбъект) Экспорт 
	
	Префикс = Строка(Ведущий.Организация.Префикс)+Строка(Формат(Ведущий.ДатаАкта,"ДФ=ММ"))+ Строка(Формат(Ведущий.ДатаАкта,"ДФ=dd"))+"-";
	_сф.ст_УстановитьСвойство(АктОбъект.ДополнительныеСвойства,"Префикс",Префикс);
	АктОбъект.УстановитьНовыйНомер();
	
КонецПроцедуры

Процедура УстановитьНомерСчетаФактуры(Объект, СчетФактураОбъект) Экспорт 
	
	Если СчетФактураОбъект <> Неопределено Тогда
		СчетФактураОбъект.Номер = Объект.НомерАкта;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли