
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	CW_ОбменГИСЭПДДополнительный.УстановитьПараметрыТиповДокументовЭПД(ЭтотОбъект);
	
	Если ТипЗнч(ДоступныеТипыДокументовЭПД) = Тип("ФиксированныйМассив") 
		И Параметры.Ключ.Пустая() 
		и ДоступныеТипыДокументовЭПД.Количество() = 1 Тогда
		Объект.ТипДокументаЭПД = ДоступныеТипыДокументовЭПД[0];
	КонецЕсли;   
	
	Если Не Объект.ТипДокументаЭПД.Пустая() Тогда
		ТипДокументаЭПДПриИзмененииНаСервере();  
	КонецЕсли;  
	
	CW_ОбменГИСЭПДДополнительный.ЗаполнитьДоступныеТипыОбъектов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	CW_ОбменГИСЭПДДополнительный.УстановитьПараметрыТиповДокументовЭПД(ЭтотОбъект);
	
	ИнформацияПоПрефиксамТитула = CW_ОбменГИСЭПДПереопределяемый.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	ПрефиксТитула = ИнформацияПоПрефиксамТитула.ВПрограмме;  
	
	ТекущийТитулПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаписатьНастройкиЗаполненияЭПД();

КонецПроцедуры   

&НаСервере
Процедура ЗаписатьНастройкиЗаполненияЭПД()  
	
	ПоляТаблицПоТитулам = CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьСоставПолейТаблиц();

	Набор = РегистрыСведений.CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.СоздатьНаборЗаписей();
	Набор.Отбор.НастройкаЗаполнения.Установить(Объект.Ссылка);
	Набор.Очистить();
	
	ПоляТаблиц = ПоляТаблицПоТитулам.Получить(Объект.ТекущийТитул);
	
	Для Каждого Область из ТабличныйДокумент.Области Цикл
		Если СтрНачинаетсяС(Область.Имя, "МногострочнаяЧасть") Тогда
			Продолжить;
		КонецЕсли; 
		
		ИмяТабличнойЧасти = ПоляТаблиц.Получить(Область.Имя);
		
		Запись = Набор.Добавить();
		Запись.НастройкаЗаполнения	= Объект.Ссылка;
		Запись.ИмяТабличнойЧасти 	= ИмяТабличнойЧасти;
		Запись.ИмяОбласти 			= Область.Имя;
		Запись.АлгоритмЗаполнения	= Область.Значение;
		
	КонецЦикла;   
	
	Набор.Записать(Истина);

КонецПроцедуры    



&НаКлиенте
Процедура ТипДокументаЭПДПриИзменении(Элемент)
	
	ТипДокументаЭПДПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТипДокументаЭПДПриИзмененииНаСервере()

	CW_ОбменГИСЭПДДополнительный.УстановитьСписокВыбораТитула(ЭтотОбъект);

КонецПроцедуры


&НаКлиенте
Процедура ТекущийТитулПриИзменении(Элемент)
	ТекущийТитулПриИзмененииНаСервере(); 
	ЗаполнитьНаименованиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекущийТитулПриИзмененииНаСервере()
	
	ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
	Если ТипЗнч(ПараметрыДокументаЭПД) = Тип("ФиксированнаяСтруктура") тогда 
		
		ИнформацияПоПрефиксамТитула = CW_ОбменГИСЭПДПереопределяемый.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
		ПрефиксТитула = ИнформацияПоПрефиксамТитула.ВПрограмме;
		
		Макет = ПолучитьМакетОбъекта();
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Макет);  
		
		ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(0);  
		
		ЗаполнитьМакетИзНастроек();                                                     
		
		Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1") Тогда 
			ОбластьДоверенность	= ТабличныйДокумент.Области.Найти("Доверенность");   
			Если ОбластьДоверенность <> Неопределено Тогда
				ТабличныйДокумент.УдалитьОбласть(ОбластьДоверенность, ТипСмещенияТабличногоДокумента.ПоВертикали);
			КонецЕсли; 
			
			Для каждого Область из ТабличныйДокумент.Области Цикл
				Если СтрНачинаетсяС(Область.Имя, "УдалитьСтроку") Тогда
					Область.Гиперссылка = Ложь;
					Область.Текст = "";  
				КонецЕсли; 
			КонецЦикла;     
		КонецЕсли;  
		
	КонецЕсли;  
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьМакетИзНастроек()  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.НастройкаЗаполнения КАК НастройкаЗаполнения,
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.ИмяОбласти КАК ИмяОбласти,
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.АлгоритмЗаполнения КАК АлгоритмЗаполнения
	|ИЗ
	|	РегистрСведений.CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД КАК CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД
	|ГДЕ
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.НастройкаЗаполнения = &НастройкаЗаполнения";
	
	Запрос.УстановитьПараметр("НастройкаЗаполнения", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбластьТабличногоДокумента = ТабличныйДокумент.Области.Найти(Выборка.ИмяОбласти);
		Если ОбластьТабличногоДокумента <> Неопределено Тогда
			ОбластьТабличногоДокумента.Значение = Выборка.АлгоритмЗаполнения;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьМакетОбъекта()
	
	ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
	ИмяМакета 	= ПараметрыДокументаЭПД["Настройки"].Получить(Объект.ТекущийТитул); 
	Макет 		= Справочники.CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.ПолучитьМакет(ИмяМакета);

	Возврат Макет;
	
КонецФункции


&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)

	Если Элементы.ТабличныйДокумент.Защита Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	Модифицированность = истина;
КонецПроцедуры

&НаСервере
Процедура ПоказатьУровеньГруппировокСтрокНаСервере(Индекс)
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(Индекс);  
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент) 
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		ЗаполнитьНаименованиеНаСервере();              
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Процедура СоздатьАлгоритмыЗаполненияРеквизитов(Команда)  
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ТипОбъекта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран тип объекта!",,"ТипОбъекта", "Объект", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ТекущийТитул) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран титул!",,"ТекущийТитул", "Объект", Отказ);
	КонецЕсли;   
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;   
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Для каждого незаполненного реквизита титула будет найден, а в случае отсутствия будет создан новый алгоритм заполнения. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	РезультатВыполнения =  ПродолжитьЗаполнениеСправочникАлгоритмыНаСервереВФоне(); 
	Если РезультатВыполнения = Неопределено Тогда 
		ПоказатьПредупреждение(, "Не удалось определить имя макета настроек для титула!");
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатВыполнения", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 	

КонецПроцедуры

&НаСервере 
Функция ПродолжитьЗаполнениеСправочникАлгоритмыНаСервереВФоне()  
	
	СоответствиеОбластей = Новый Соответствие;  
	
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1, 	"ЭЗЗ_Титул1");
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2, 	"ЭЗЗ_Титул2");  
	
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1, 	"ЭТрН_Титул1"); 
	
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1, 	"ЭПЛ_Титул1");   
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул2, 	"ЭПЛ_Титул2");   
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул3, 	"ЭПЛ_Титул3");   
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул4, 	"ЭПЛ_Титул4");   
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул5, 	"ЭПЛ_Титул5"); 
	
	СоответствиеОбластей.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_1, "ЭСВ_Титул1_1");   

	ИмяОбласти = СоответствиеОбластей.Получить(Объект.ТекущийТитул);
	Если ИмяОбласти = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне   = ложь;   

	ПараметрыПроцедуры = Новый Структура;  
	ПараметрыПроцедуры.Вставить("ТипДокументаЭПД", 	Объект.ТипДокументаЭПД);  
	ПараметрыПроцедуры.Вставить("ТекущийТитул", 	Объект.ТекущийТитул);  
	ПараметрыПроцедуры.Вставить("ТипОбъекта", 		Объект.ТипОбъекта);  
	ПараметрыПроцедуры.Вставить("ИмяОбласти", 		ИмяОбласти);  
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ОбменГИСЭПДДополнительный.СформироватьАлгоритмыЗаполненияРеквизитовЭПД",ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции     

&НаКлиенте 
Процедура ОбработатьРезультатВыполнения(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда 
		//Выполннение прервано
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
        ОбработатьРезультатВыполненияНаСервере(РезультатВыполнения.АдресРезультата);
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка заполнения справочника!");  
		
	КонецЕсли;  
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьРезультатВыполненияНаСервере(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли; 
	
	Для Каждого КлючЗначение из Результат Цикл
		НайденнаяОбласть = ТабличныйДокумент.Области.Найти(КлючЗначение.Ключ);
		Если НайденнаяОбласть <> Неопределено Тогда
			НайденнаяОбласть.Значение = КлючЗначение.Значение;    
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование(Команда)
	ЗаполнитьНаименованиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаименованиеНаСервере()
	
	ШаблонНаименования  = "%1 (%2, %3)";
	
	Объект.Наименование  = СтрШаблон(ШаблонНаименования, 
		СокрЛП(Объект.ТипОбъекта.Синоним),
		СокрЛП(Объект.ТипДокументаЭПД),
		СокрЛП(Объект.ТекущийТитул));
	
КонецПроцедуры



