
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.УчетПоПодразделениям.Доступность = ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	УстановитьВидимостьКолонокСвойстСубконто();	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтрокаПорядка = "";
	ПланыСчетов.CW_МСФО.ПолучитьСтрокуПорядка(ТекущийОбъект, СтрокаПорядка);
	ТекущийОбъект.Порядок = СтрокаПорядка; 
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьКолонокСвойстСубконто()
	
	Элементы.ВидыСубконтоВалютный.Видимость 		= Объект.Валютный;
	Элементы.ВидыСубконтоКоличественный.Видимость 	= Объект.Количественный;
	
КонецПроцедуры

&НаСервере
Процедура ВалютныйПриИзмененииНаСервере()
	
	Если Не Объект.Валютный Тогда
		Для каждого СтрокаСубконто из Объект.ВидыСубконто Цикл
			СтрокаСубконто.Валютный = ложь;
		КонецЦикла;
	Конецесли;
	
	УстановитьВидимостьКолонокСвойстСубконто();
	
КонецПроцедуры

&НаСервере
Процедура КоличественныйПриИзмененииНаСервере()
	
	Если Не Объект.Количественный Тогда
		Для каждого СтрокаСубконто из Объект.ВидыСубконто Цикл
			СтрокаСубконто.Количественный = ложь;
		КонецЦикла;
	Конецесли;
	
	УстановитьВидимостьКолонокСвойстСубконто();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютныйПриИзменении(Элемент)
	
	ВалютныйПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличественныйПриИзменении(Элемент)
	
	КоличественныйПриИзмененииНаСервере();
	
КонецПроцедуры

