
#Область События_формы_НаСервере

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользуютсяЗаказы 			   						= ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов");
	ОбратныйПересчетВДокументах    						= CW_Настройки.ПолучитьНастройкуПользователя(,"ОбратныйПересчетВДокументах");
	ПодставлятьУполномоченныхЛицПриСозданииДокументов  	= CW_Настройки.ПолучитьНастройкуПользователя(,"ПодставлятьУполномоченныхЛицПриСозданииДокументов");
	
	ВалютаРегламентированногоУчета 						= Константы.ВалютаРегламентированногоУчета.Получить();
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Элементы.СвязанныеДокументыСтатусДокумента.Видимость = Справочники.CW_НазначенияСтатусов.ОбъектИспользуетсяВСистемеСтатусов(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"));
	
	НазначениеСтатусов 				= Справочники.CW_НазначенияСтатусов.ПолучитьНазначениеСтатусовПоТипуОбъекрта(Тип("ДокументСсылка.CW_ОтчетЭкспедитора"));
	ЗадатьВопросПриИзмененииСтатуса = Справочники.CW_НазначенияСтатусов.СодержитТипОбъекта(НазначениеСтатусов, Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"));
	//Подсистема.СтатусыДокументов
	
	//Заполнение списка порядка заполнения
	Элементы.ПорядокЗаполнения.СписокВыбора.Добавить(0,"Грузоперевозка",,БиблиотекаКартинок.CW_Грузоперевозки);
	Элементы.ПорядокЗаполнения.СписокВыбора.Добавить(1,"Список грузоперевозок",,БиблиотекаКартинок.CW_ГрузоперевозкиСписок);
	
	Если ИспользуютсяЗаказы Тогда
		Элементы.ПорядокЗаполнения.СписокВыбора.Добавить(2,"Заказ",,БиблиотекаКартинок.CW_Коробка);
		Элементы.ПорядокЗаполнения.СписокВыбора.Добавить(3,"Список заказов",,БиблиотекаКартинок.CW_Меню2);
	КонецЕсли;
	
	Элементы.ПорядокЗаполнения.СписокВыбора.Добавить(4,"Документ затрат",,БиблиотекаКартинок.CW_РасходыПоГрузоперевозке);
	Элементы.ПорядокЗаполнения.СписокВыбора.Добавить(5,"Список документов затрат",,БиблиотекаКартинок.CW_ВидыДокументов);
	//Заполнение списка порядка заполнения
	
	ЭтоНовый = Параметры.Ключ.Пустая(); 
	
	Если ЭтоНовый Тогда
		Объект.ПорядокПроведенияДокументов 	= 1;
		
		Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата 						= ТекущаяДата();
		КонецЕсли;
		Объект.КоличествоДней 				= 5;
		
		Если ВестиУчетПоПодразделениям и Не ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда
			Объект.ПодразделениеОрганизации 	= CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ПодразделениеПользователя");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(Объект.АдресЗначенияОтбораПриКопировании) Тогда
		//Сюда попадаем только в случае копирвоани!
		ЗначениеОтбора 							 	= ПолучитьИзВременногоХранилища(Объект.АдресЗначенияОтбораПриКопировании);
		Объект.АдресЗначенияОтбораПриКопировании 	= "";
	Иначе
		тОбъект 		= РеквизитФормыВЗначение("Объект");
		ЗначениеОтбора 	= тОбъект.ЗначениеОтбора.Получить();
	КонецЕсли;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("ВводНаОсновании") Тогда
		ЗначениеОтбора 			= Параметры.ЗначенияЗаполнения.ДокументОснование;
	КонецЕсли;  
	
	Если Параметры.ЗначенияЗаполнения.Свойство("ЗначениеОтбора") Тогда
		ЗначениеОтбора 			= Параметры.ЗначенияЗаполнения.ЗначениеОтбора;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		АдресЗначенияОтбора = ПоместитьВоВременноеХранилище(ЗначениеОтбора, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();	
	СчетНаПредоплатуПриИзмененииНаСервере();
	УстановитьВидимостьИТипЗначенияЗаполнения();
	
	УстановитьОтборДинамическогоСписка();
	
	СформироватьКурсВалюты();
	
	ЗаполнитьИтогиПоОтчетуНаСервере(Истина);
	
	СостояниеДокумента = ПолучитьСостояниеДокумента(); 
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		СтруктураПараметровДоговора = ПолучитьСтруктуруПараметровДоговораКлиента();
		ВводНаОснованииДоступен = СтруктураПараметровДоговора.АвтоматическийРасчетВознаграждения и СтруктураПараметровДоговора.МоментАвтоматическогоВыставленияВознаграждения = Перечисления.CW_МоментАвтоматическогоВыставленияВознаграждения.ОтдельнымДокументом; 
	    УстановитьВидимостьВводаНаОсновании(ВводНаОснованииДоступен);
	КонецЕсли;

	ОбновитьЗаголовокНадписиКоличествоДней();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров
	
	//Подсистема.ДополнительныеРеквизиты
	ИспользоватьДопРеквизиты = CW_ДополнительныеРеквизитыСлужебный.ИспользуютсяДополниительныеРеквизиты();
	//Подсистема.ДополнительныеРеквизиты
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ПроизвольныйОбъект", НЕ ИспользоватьДопРеквизиты); 
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЗаголовкиСтраниц(Истина);	
	УстановитьДоступностьЭлементовФормы();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокНадписиКоличествоДней()
	
	ФормСтрока = "Л = ru_RU; ДП = Ложь; НП = Истина; НД = Истина";
	ПарПредмета="день,дня,дней,м";
	
	УбираемыеСимволы = ЧислоПрописью(Объект.КоличествоДней, "Л = ru_RU; ДП = Ложь; НП = Ложь; НД = Ложь", "день,дня,дней,м"); //Два 00
	УбираемыеСимволы = СокрЛП(СтрЗаменить(УбираемыеСимволы, "00","")); //Два
	
	Предмет = ЧислоПрописью(Объект.КоличествоДней, "Л = ru_RU; ДП = Ложь; НП = Истина; НД = Ложь", "день,дня,дней,м"); //Два дня 00
	Предмет = СокрЛП(СтрЗаменить(Предмет, "00","")); //Два дня
	Предмет = СокрЛП(СтрЗаменить(Предмет, УбираемыеСимволы,"")); //дня
	
	Элементы.КоличествоДнейИнтервала.Заголовок = Формат(Объект.КоличествоДней, "ЧДЦ=0; ЧГ=0")+ " "+ Предмет;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВводаНаОсновании(Флаг)
	
	Элементы.ФормаДокументCW_ДоходыПоГрузоперевозкеСоздатьНаОсновании.Видимость = Флаг;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСписка()
	
	СвязанныеДокументы.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = СвязанныеДокументы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтчетЭкспедитрора");
	ЭлементОтбора.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.СчетНаПредоплату_Значение) Тогда
		ЭлементОтбора = СвязанныеДокументы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СвязанныйДокумент");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = ?(Объект.Ссылка.Пустая(), Неопределено, Объект.СчетНаПредоплату_Значение);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СостояниеДокумента = ПолучитьСостояниеДокумента(); 
	
	Если Объект.СчетНаПредоплату = 0 
		и ЗначениеЗаполнено(Объект.СчетНаПредоплату_Значение) Тогда
		КлючЗаписи = Новый Структура("ОтчетЭкспедитора,СвязанныйДокумент", Объект.Ссылка, Объект.СчетНаПредоплату_Значение);
		Документы.CW_ОтчетЭкспедитора.ЗаписатьДокументВРегистр(КлючЗаписи);                          
	КонецЕсли;   
	
	УстановитьОтборДинамическогоСписка();
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	CW_Документы.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ);
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
	Если Объект.ПорядокЗаполнения = 0 или Объект.ПорядокЗаполнения = 2 или Объект.ПорядокЗаполнения = 4 Тогда
		
		ТекущийОбъект.ЗначениеОтбора 		= Новый ХранилищеЗначения(ЗначениеЗаполненияСсылка);	
		ТекущийОбъект.СписокЗначениеОтбора 	= СокрЛП(ЗначениеЗаполненияСсылка);
		
	ИначеЕсли Объект.ПорядокЗаполнения = 1 или Объект.ПорядокЗаполнения = 3   или Объект.ПорядокЗаполнения = 5 тогда
		
		МассивЗначенийОтбора 				= ЗначениеЗаполненияСписок.ВыгрузитьЗначения();
		ТекущийОбъект.ЗначениеОтбора 		= Новый ХранилищеЗначения(МассивЗначенийОтбора);	
		ТекущийОбъект.СписокЗначениеОтбора 	= СтрСоединить(МассивЗначенийОтбора,";");
		
	КонецЕсли;	 
	
	Отбор 	= новый Структура("ЕстьСчетФактура",Истина);
	мСтроки = ТекущийОбъект.Услуги.НайтиСтроки(Отбор);
	
	ТекущийОбъект.ФормируютсясчетаФактуры = мСтроки.Количество() > 0;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОрагнизацияПриИзмененииНаСервере()
	
	Если ПодставлятьУполномоченныхЛицПриСозданииДокументов И Объект.Ссылка.Пустая() Тогда
		_ПодставитьПодписантов();
	КонецЕсли;
	
	Если Объект.Организация <> Объект.Ссылка.Организация Тогда
		Объект.Номер = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрагнизацияПриИзменении(Элемент)
	ОрагнизацияПриИзмененииНаСервере();
КонецПроцедуры



#КонецОбласти

#Область События_формы_НаКлиенте

&НаКлиенте
Процедура УслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьЗаголовкиСтраниц();
	ЗаполнитьИтогиПоОтчетуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеУдаления(Элемент)
	
	ОбновитьЗаголовкиСтраниц();
	ЗаполнитьИтогиПоОтчетуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПорядокЗаполненияПриИзменении(Элемент)
	ПорядокЗаполненияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ОбработатьИзменениеДоговораНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если Поле.Имя = "УслугиГрузопереовзка" Тогда
		 ПоказатьЗначение(,ТекущиеДанные.Грузоперевозка);
	ИначЕесли Поле.Имя = "УслугиЗаказ" Тогда
		 ПоказатьЗначение(,ТекущиеДанные.Заказ);
	ИначЕесли Поле.Имя = "УслугиКонтрагент" Тогда
		 ПоказатьЗначение(,ТекущиеДанные.Контрагент);
	ИначЕесли Поле.Имя = "УслугиДокументЗатрат" Тогда
		 ПоказатьЗначение(,ТекущиеДанные.ДокументРасходов);
	ИначЕесли Поле.Имя = "УслугиЕстьСчетФактура" Тогда
		Если ТекущиеДанные.ЕстьСчетФактура Тогда
			ПоказатьЗначение(,ПолучитьСчетФактуру(ТекущиеДанные.ДокументРасходов));
		Иначе
			ПоказатьЗначение(,ТекущиеДанные.ДокументРасходов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подписанты_Обновить(Команда)
	
	Если ПодставлятьУполномоченныхЛицПриСозданииДокументов Тогда
		_ПодставитьПодписантов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработка_событий_формы_На_Сервере

&НаСервере
Процедура ОбработатьИзменениеДоговораНаСервере()
	
	СтруктураПараметровДоговора		= ПолучитьСтруктуруПараметровДоговораКлиента();
	ВводНаОснованииДоступен 		= СтруктураПараметровДоговора.АвтоматическийРасчетВознаграждения и СтруктураПараметровДоговора.МоментАвтоматическогоВыставленияВознаграждения = Перечисления.CW_МоментАвтоматическогоВыставленияВознаграждения.ОтдельнымДокументом; 
	
	Если ЭтоНовый Тогда
		
		ЗаполнитьЗначенияСвойств(Объект, СтруктураПараметровДоговора, "ПорядокЗаполнения,ПорядокПеревыставления,СчетНаПредоплату,ДатаПеревставления");
		
		ПорядокПеревыставленияПриИзмененииНаСервере();
		СчетНаПредоплатуПриИзмененииНаСервере();
		УстановитьВидимостьИТипЗначенияЗаполнения();
		
	КонецЕсли;
	
	УстановитьВидимостьВводаНаОсновании(ВводНаОснованииДоступен);
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииДоговораНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
	СформироватьКурсВалюты();
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	ТолькоПросмотрШапки = Объект.Услуги.Количество() <> 0;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьФормированияДрокументов()
	
	Отказ = Ложь;
	
	Если Объект.ПорядокПеревыставления = 3 и Объект.КоличествоДней = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не указано количество дней для группировки документов!";
		Сообщение.Поле  		= "ПорядокПеревыставления";
		Сообщение.ПутьКДанным	= "Объект";
		Сообщение.Сообщить();
		
		Отказ = истина;
	КонецЕсли;
	
	Если Объект.СчетНаПредоплату = 0 и Не ЗначениеЗаполнено(Объект.СчетНаПредоплату_Значение) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не выбрн счет предоплаты клиента!";
		Сообщение.Поле  		= "СчетНаПредоплату_Значение";
		Сообщение.ПутьКДанным	= "Объект";
		Сообщение.Сообщить();
		
		Отказ = истина;
		
	КонецЕсли;  
	
	Если Объект.СчетНаПредоплату = 0 
		и НЕ (Объект.СчетНаПредоплату_Значение.ФормируетсяСчет и НЕ Объект.СчетНаПредоплату_Значение.ФормируетсяАкт) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Документ, указанный в качестве счета на предоплату, не может быть актом. Формирование документов не возможно!";
		Сообщение.Поле  		= "СчетНаПредоплату_Значение";
		Сообщение.ПутьКДанным	= "Объект";
		Сообщение.Сообщить();
		
		Отказ = истина;
		
	КонецЕсли;  
	
	
	//Проверка нулевых сумм "Всего"
	Отбор = Новый Структура("Всего", 0);
	мСтроки = Объект.Услуги.НайтиСтроки(Отбор);
	
	Если мСтроки.Количество() > 0 Тогда
		
		Отказ = истина;
		Для Каждого СтрокаМассива из мСтроки Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст 		= "Сумма по строке равна 0!";
			Сообщение.Поле  		= "Услуги["+Формат(СтрокаМассива.НомерСтроки-1,"ЧГ=0")+"].Всего";
			Сообщение.ПутьКДанным	= "Объект";
			Сообщение.Сообщить();
		КонецЦикла;
		
	КонецЕсли;

	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЗаголовкиСтраниц(СтраницаДополнительно=Ложь)
	
	ВсегоУслуг 							= Объект.Услуги.Количество();
	Элементы.Страница_Услуги.Заголовок 	= "Услуги"+?(ВсегоУслуг <> 0," ("+Формат(ВсегоУслуг,"ЧДЦ=; ЧГ=")+")","");
	
	Если СтраницаДополнительно Тогда
		ВсегоСвязанныхДокументов 				= ПолучитьКоличествоСвязанныхДокументов(Объект.Ссылка);
		Элементы.Страница_Документы.Заголовок 	= "Документы"+?(ВсегоСвязанныхДокументов <> 0," ("+Формат(ВсегоСвязанныхДокументов,"ЧДЦ=; ЧГ=")+")","");
	КонецЕсли;
	
	ВсегоДокументовВознаграждения 						= Объект.ДокументыВознаграждения.Количество();
	Элементы.Страница_ДокументыВознаграждения.Заголовок = "Документы вознаграждения"+?(ВсегоДокументовВознаграждения <> 0," ("+Формат(ВсегоДокументовВознаграждения,"ЧДЦ=; ЧГ=")+")","");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоСвязанныхДокументов(ОбъектСсылка)
	
	СтруктураСвязанныеДокументы 			= Документы.CW_ОтчетЭкспедитора.ПолучитьСвязанныеДоходыПоГрузопереовзкам(ОбъектСсылка);
	ЕстьПроведенныеСвязанныеДокументы 		= СтруктураСвязанныеДокументы.Проведенные.Количество();
	ЕстьСвязанныеДокументы					= СтруктураСвязанныеДокументы.ВсеДокументы.Количество();
	
	Возврат СтруктураСвязанныеДокументы.ВсеДокументы.Количество();
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьИТипЗначенияЗаполнения()
	
	Если ЭтоАдресВременногоХранилища(АдресЗначенияОтбора) Тогда
		ЗначениеЗаполнения = ПолучитьИзВременногоХранилища(АдресЗначенияОтбора);
	КонецЕсли;
	
	СвязьПараметровВыбора =  Новый СвязьПараметраВыбора("Отбор.Клиент",	"Объект.Контрагент");
	Массив = новый Массив;
	Массив.Добавить(СвязьПараметровВыбора);
	СвязиПараметровВыбора = Новый ФиксированныйМассив(Массив);
	
	Если Объект.ПорядокЗаполнения = 0 Тогда
		
		Элементы.ЗначениеЗаполненияСсылка.Видимость = истина;
		Элементы.ЗначениеЗаполненияСписок.Видимость = Ложь;
		
		Элементы.ЗначениеЗаполненияСсылка.СвязиПараметровВыбора = СвязиПараметровВыбора;
	
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) и ТипЗнч(ЗначениеЗаполнения) = тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			ЗначениеЗаполненияСсылка = ЗначениеЗаполнения;
		Иначе
			ЗначениеЗаполненияСсылка = ПредопределенноеЗначение("Справочник.CW_Грузоперевозки.ПустаяСсылка");
		КонецЕсли;
		
	ИначеЕсли Объект.ПорядокЗаполнения = 1 тогда
		
		Элементы.ЗначениеЗаполненияСсылка.Видимость = Ложь;
		Элементы.ЗначениеЗаполненияСписок.Видимость = истина;    
		
		Элементы.ЗначениеЗаполненияСписок.СвязиПараметровВыбора = СвязиПараметровВыбора;
		
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) и ТипЗнч(ЗначениеЗаполнения) = Тип("Массив") Тогда
			ЗначениеЗаполненияСписок.ЗагрузитьЗначения(ЗначениеЗаполнения);
		Иначе
			ОписаниеТипов  							= Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки");
			ЗначениеЗаполненияСписок.ТипЗначения 	= ОписаниеТипов;
		КонецЕсли;
		
	ИначеЕсли Объект.ПорядокЗаполнения = 2 тогда
		
		Элементы.ЗначениеЗаполненияСсылка.Видимость = истина;
		Элементы.ЗначениеЗаполненияСписок.Видимость = Ложь;
		
		Элементы.ЗначениеЗаполненияСсылка.СвязиПараметровВыбора = СвязиПараметровВыбора;
		
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) и ТипЗнч(ЗначениеЗаполнения) = тип("СправочникСсылка.CW_Заказы") Тогда
			ЗначениеЗаполненияСсылка = ЗначениеЗаполнения;
		Иначе
			ЗначениеЗаполненияСсылка = ПредопределенноеЗначение("Справочник.CW_Заказы.ПустаяСсылка");
		КонецЕсли;
		
	ИначеЕсли Объект.ПорядокЗаполнения = 3 тогда
		
		Элементы.ЗначениеЗаполненияСсылка.Видимость = Ложь;
		Элементы.ЗначениеЗаполненияСписок.Видимость = истина;
		
		Элементы.ЗначениеЗаполненияСписок.СвязиПараметровВыбора = СвязиПараметровВыбора;
		
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) и ТипЗнч(ЗначениеЗаполнения) = Тип("Массив") Тогда
			ЗначениеЗаполненияСписок.ЗагрузитьЗначения(ЗначениеЗаполнения);
		Иначе
			ОписаниеТипов  							= Новый ОписаниеТипов("СправочникСсылка.CW_Заказы");
			ЗначениеЗаполненияСписок.ТипЗначения 	= ОписаниеТипов;;
		КонецЕсли;
		
	ИначеЕсли Объект.ПорядокЗаполнения = 4 тогда
		
		Элементы.ЗначениеЗаполненияСсылка.Видимость = истина;
		Элементы.ЗначениеЗаполненияСписок.Видимость = Ложь;
		
		СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
		Элементы.ЗначениеЗаполненияСсылка.СвязиПараметровВыбора = СвязиПараметровВыбора;
	
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) и ТипЗнч(ЗначениеЗаполнения) = тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
			ЗначениеЗаполненияСсылка = ЗначениеЗаполнения;
		Иначе
			ЗначениеЗаполненияСсылка = ПредопределенноеЗначение("Документ.CW_РасходыПоГрузоперевозке.ПустаяСсылка");
		КонецЕсли;
		
	ИначеЕсли Объект.ПорядокЗаполнения = 5 тогда
		
		Элементы.ЗначениеЗаполненияСсылка.Видимость = Ложь;
		Элементы.ЗначениеЗаполненияСписок.Видимость = истина;
		
		СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
		Элементы.ЗначениеЗаполненияСписок.СвязиПараметровВыбора = СвязиПараметровВыбора;
		
		Если ЗначениеЗаполнено(ЗначениеЗаполнения) и ТипЗнч(ЗначениеЗаполнения) = Тип("Массив") Тогда
			ЗначениеЗаполненияСписок.ЗагрузитьЗначения(ЗначениеЗаполнения);
		Иначе
			ОписаниеТипов  							= Новый ОписаниеТипов("ДокументСсылка.CW_РасходыПоГрузоперевозке");
			ЗначениеЗаполненияСписок.ТипЗначения 	= ОписаниеТипов;;
		КонецЕсли;
		
	КонецЕсли;	 
	
КонецПроцедуры

&НаСервере
Процедура ПорядокЗаполненияПриИзмененииНаСервере()
	
	УстановитьВидимостьИТипЗначенияЗаполнения();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКурсВалюты()
	
	
	Если  Не ЗначениеЗаполнено(Объект.Договор.ВалютаДоговора) Тогда
		Возврат;
	КонецЕсли;                               
	
	//Подсистема.УчетПриложенийДоговоров
	Объект.ВалютаДокумента = CW_УчетПриложенийДоговоровСервер.ПолучитьВалютуПриложенияДоговора(Объект.ПриложениеКДоговору, Объект.Договор);
	//Подсистема.УчетПриложенийДоговоров
	
	СтруктураКурса 			= CW_Финансы.ПолучитьКурсВалюты(Объект.ВалютаДокумента, ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	
	Элементы.Надпись_ВалютаКурс.Заголовок = Строка(Объект.ВалютаДокумента)+" = "+Формат(СтруктураКурса.Курс,"ЧЦ=15; ЧДЦ=4; ЧГ=");
	
	Элементы.ГруппаДокументыперевыставленоВВалюте.Видимость = Не Объект.ВалютаДокумента = ВалютаРегламентированногоУчета;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметровДоговораКлиента()
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= Объект.Дата;
	СтруктураПараметров.Договор 			= Объект.Договор;
	СтруктураПараметров.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
	
	СписокИменПараметров = 	"АвтоматическийРасчетВознаграждения;МоментАвтоматическогоВыставленияВознаграждения;"+
							"ПорядокЗаполнения;ПорядокПеревыставления;СчетНаПредоплату;ДатаПеревставления";
	
	СтруктураПараметровДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, СписокИменПараметров);
	
	Возврат СтруктураПараметровДоговора;
	
КонецФункции

&НаСервере
Процедура СформироватьПредставлениеНаСервере(Знач Строки)
	
	Для каждого Идентификатор Из Строки Цикл
		
		СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Идентификатор);
		
		ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
		
		ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
		ПараметрыШаблона.Объект 		= Объект;
		ПараметрыШаблона.Дата 			= Объект.Дата;
		ПараметрыШаблона.Договор 		= Объект.Договор;
		ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
		ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
		
		CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
		
	КонецЦикла; 
	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПредставлениеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуСвязанногоДокумента(Ключзаписи)
	
	Возврат КлючЗаписи.СвязанныйДокумент;	
	
КонецФункции

&НаСервере
Процедура ПорядокПеревыставленияПриИзмененииНаСервере()
	
	Если Объект.ПорядокПеревыставления = 0 Тогда
		Если Объект.ДатаПеревставления <> 0 Тогда
			Объект.ДатаПеревставления = 0;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.КоличествоДней = 0 И  Объект.ПорядокПеревыставления =  3 Тогда
		Объект.КоличествоДней = 5;
		ОбновитьЗаголовокНадписиКоличествоДней();
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.ДатаПеревставления.ТолькоПросмотр 	= Объект.ПорядокПеревыставления = 0;
	
	Элементы.ГруппаДниИнтервала.Видимость 		= Объект.ПорядокПеревыставления =  3;
	Элементы.ДатаПеревставления.Видимость 		= Объект.ПорядокПеревыставления <> 3;
	
	
КонецПроцедуры

&НаСервере
Процедура СчетНаПредоплатуПриИзмененииНаСервере()
	
	Если Объект.СчетНаПредоплату > 0 тогда
		Если ЗначениеЗаполнено(Объект.СчетНаПредоплату_Значение) Тогда
			Объект.СчетНаПредоплату_Значение = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.СчетНаПредоплату_Значение.Видимость = Объект.СчетНаПредоплату = 0;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСчетФактуру(ДокументРасходов)
	
	Возврат ДокументРасходов.ВедомыйСчетФактура;
	
	
КонецФункции

#КонецОбласти

#Область Обработчики_команд_формы_НаКлиенте

&НаКлиенте
Процедура Заполнить(Команда)
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеОбъектовОстатков(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Услуги.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Табличная часть документа будет очищена. Продолжить?';"
		+ " en = 'The document is cleared. Do you want to continue?'"), Режим, 0); 
		
	Иначе     
		
		РезультатВыполнения =  ЗаполнитьНаСервереВФоне();
		
		Если РезультатВыполнения <> Неопределено Тогда
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗаполнения", ЭтотОбъект);
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные для заполнения документа!");
			
		конецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеОбъектовОстатков(Отказ)
	
	Если Объект.ПорядокЗаполнения = 0 или Объект.ПорядокЗаполнения = 2 или Объект.ПорядокЗаполнения = 4 Тогда
		Если Не ЗначениеЗаполнено(ЗначениеЗаполненияСсылка) Тогда
			
			Если Объект.ПорядокЗаполнения = 0 Тогда
				ТекстПредупрежедения = "Не выбрана грузоперевозка";
			ИначеЕсли Объект.ПорядокЗаполнения = 2 Тогда 
				ТекстПредупрежедения = "Не выбран заказ";
			ИначеЕсли Объект.ПорядокЗаполнения = 3 Тогда 
				ТекстПредупрежедения = "Не выбран документ затрат";
			КонецЕсли;
			
			ПоказатьПредупреждение(,ТекстПредупрежедения);
			Отказ = истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ПорядокЗаполнения = 1 или Объект.ПорядокЗаполнения = 3 или Объект.ПорядокЗаполнения = 5 тогда
		
		Если ЗначениеЗаполненияСписок.Количество() = 0 Тогда
			
			Если Объект.ПорядокЗаполнения = 0 Тогда
				ТекстПредупрежедения = "Не выбрана ни одна грузоперевозка";
			ИначеЕсли Объект.ПорядокЗаполнения = 2 Тогда 
				ТекстПредупрежедения = "Не выбран ни один заказ";
			ИначеЕсли Объект.ПорядокЗаполнения = 3 Тогда 
				ТекстПредупрежедения = "Не выбран ни оди документ затрат";
			КонецЕсли;
			
			ПоказатьПредупреждение(,ТекстПредупрежедения);
			
			Отказ = истина;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ЗаполнитьНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗаполнения", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНаСервереВФоне()
	
	МассивОбъектов = ПолучитьДанныеДляЗаполнения();
	Если МассивОбъектов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Запонение табличной части услуги (Отчет экспедитора)";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ОтборПоГрузоперевозкам = ТипЗнч(МассивОбъектов[0]) = Тип("СправочникСсылка.CW_Грузоперевозки");
		
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Объект", Объект.Ссылка);
	ПараметрыПроцедуры.Вставить("Дата", Объект.Дата);
	ПараметрыПроцедуры.Вставить("Организация", Объект.Организация);
	ПараметрыПроцедуры.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыПроцедуры.Вставить("Договор", Объект.Договор);
	
	//Подсистема.УчетПриложенийДоговоров
	ПараметрыПроцедуры.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	ПараметрыПроцедуры.Вставить("ВестиУчетПоПодразделениям", 	ВестиУчетПоПодразделениям);
	ПараметрыПроцедуры.Вставить("ПодразделениеОрганизации", 	Объект.ПодразделениеОрганизации);
	ПараметрыПроцедуры.Вставить("МассивОбъектов", 				МассивОбъектов);
	ПараметрыПроцедуры.Вставить("ОтборПоГрузоперевозкам", 		ОтборПоГрузоперевозкам);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.CW_ОтчетЭкспедитора.ЗаполнитьТабличнуюЧастьУслуги",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатЗаполнения(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ОбработатьРезультатВыполненияНаСервере(РезультатВыполнения.АдресРезультата);
		УстановитьДоступностьЭлементовФормы();	
		
		ПоказатьОповещениеПользователя("Заполнение таблицы услуг",,Объект.Ссылка,,СтатусОповещенияПользователя.Информация);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Табличная часть не заполнена!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка заполнения табличной части");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыполненияНаСервере(АдресРезультата)
	
	ТаблицаРезультата = ПолучитьИзВременногоХранилища(АдресРезультата);
	Объект.Услуги.Загрузить(ТаблицаРезультата);
	
	ЗаполнитьИтогиПоОтчетуНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура СформироватьПредставление(Команда)
	СформироватьПредставлениеНаСервере(Элементы.Услуги.ВыделенныеСтроки);
КонецПроцедуры


&НаКлиенте
Процедура СчетНаПредоплатуПриИзменении(Элемент)
	СчетНаПредоплатуПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПорядокПеревыставленияПриИзменении(Элемент)
	ПорядокПеревыставленияПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьДокументРасходов(Команда)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ПоказатьЗначение(,ТекущиеДанные.ДокументРасходов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейИнтервалаНажатие(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект);
	ПоказатьВводЧисла(Оповещение, Объект.КоличествоДней, "Введите количество дней", 10, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(Число, Параметры) Экспорт
	
	Если НЕ Число = Неопределено Тогда
		// обработка введенного количества
		
		Если Число = 0 Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаВводаЧисла", ЭтотОбъект, Параметры);
			ПоказатьВопрос(Оповещение, "Недопустимое количество дней 0. Будет устанвлено значение 5. Продолжить?", Режим, 0);
		Иначе
			ПродолжитьОбработкуВведенногоЗначения(Число);
		Конецесли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаВводаЧисла(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьОбработкуВведенногоЗначения(5);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбработкуВведенногоЗначения(Число)
	
	Объект.КоличествоДней = Число;
	ОбновитьЗаголовокНадписиКоличествоДней();
	Модифицированность = истина;
	
КонецПроцедуры


#КонецОбласти

#Область Связанные_документы

&НаКлиенте
Процедура СвязанныеДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РазоватьСвязьДокумента(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбРазрывеСвязи", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Документ(ы) будет отсоединен от отчета экспедитора. Продолжить?", Режим, 0); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбРазрывеСвязи(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  РазоватьСвязьДокументаНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатОтсоедениенияДокумента", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция РазоватьСвязьДокументаНаСервереВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Открпеление связанных документов (Отчет экспедитора)";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ВсеДокументы", Элементы.СвязанныеДокументы.ВыделенныеСтроки);
	ПараметрыПроцедуры.Вставить("Ссылка", Объект.Ссылка);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.CW_ОтчетЭкспедитора.РазоватьСвязьДокументаНаСервере",ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции


&НаКлиенте
Процедура ОбработатьРезультатОтсоедениенияДокумента(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ЗаполнитьИтогиПоОтчетуНаСервере(Истина);
	ОбновитьЗаголовкиСтраниц(Истина);	
		УстановитьДоступностьЭлементовФормы();
		
		МассивДокументов = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата); 
		
		Если  МассивДокументов.Количество() > 0 Тогда
			ОповеститьОбИзменении(МассивДокументов[0]);
		КонецЕсли;

		ТексСообщения = СтрСоединить(МассивДокументов,Символы.ПС);
		
		ПоказатьОповещениеПользователя("Документы отсоединены ("+Формат(МассивДокументов.Количество(),"ЧГ=0")+"):",,ТексСообщения,,СтатусОповещенияПользователя.Информация);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось отсоединить документы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		ПоказатьПредупреждение(,ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	Если Модифицированность или ЭтоНовый Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаписиДокумента", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Перед формированием документов необходимо записать документ! Продолжить?", Режим, 0); 
	Иначе
		ПродолжитьФормированиеДокументов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаписиДокумента(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	Если ЭтоНовый Тогда
		УстановитьОтборДинамическогоСписка();
		ЭтоНовый = Ложь;
	КонецЕсли;
	
	ПродолжитьФормированиеДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьФормированиеДокументов()
	
	Отказ = ПроверитьВозможностьФормированияДрокументов();
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьФормированиеДокументовНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатФормированияДокументов", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьФормированиеДокументовНаСервереВФоне()
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Запонение табличной части услуги (Отчет экспедитора)";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыПроцедуры.Вставить("Дата", Объект.Дата);
	ПараметрыПроцедуры.Вставить("Организация", Объект.Организация);
	ПараметрыПроцедуры.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыПроцедуры.Вставить("Договор", Объект.Договор);
	
	//Подсистема.УчетПриложенийДоговоров
	ПараметрыПроцедуры.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	ПараметрыПроцедуры.Вставить("ПодразделениеОрганизации", Объект.ПодразделениеОрганизации);
	ПараметрыПроцедуры.Вставить("ВестиУчетПоПодразделениям", ВестиУчетПоПодразделениям);
	ПараметрыПроцедуры.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	ПараметрыПроцедуры.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	ПараметрыПроцедуры.Вставить("ПорядокПеревыставления", Объект.ПорядокПеревыставления);
	ПараметрыПроцедуры.Вставить("ДатаПеревставления", Объект.ДатаПеревставления);
	ПараметрыПроцедуры.Вставить("ТаблицаУслуг", Объект.Услуги.Выгрузить());
	ПараметрыПроцедуры.Вставить("КоличествоДней", Объект.КоличествоДней);
	
	ПараметрыПроцедуры.Вставить("Руководитель", Объект.Руководитель);
	ПараметрыПроцедуры.Вставить("Руководитель_основание", Объект.Руководитель_основание);
	ПараметрыПроцедуры.Вставить("ГлавныйБухгалтер", Объект.ГлавныйБухгалтер);
	ПараметрыПроцедуры.Вставить("ГлавныйБухгалтер_основание", Объект.ГлавныйБухгалтер_основание);
	ПараметрыПроцедуры.Вставить("Ответственный", Объект.Ответственный);
	
	ПараметрыПроцедуры.Вставить("СчетНаПредоплату", Объект.СчетНаПредоплату);
	ПараметрыПроцедуры.Вставить("СчетНаПредоплату_Значение", Объект.СчетНаПредоплату_Значение);
	
	ПараметрыПроцедуры.Вставить("БухгалтерскийУчет", ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет);

	ПараметрыПроцедуры.Вставить("ПорядокПроведенияДокументов", Объект.ПорядокПроведенияДокументов);
	ПараметрыПроцедуры.Вставить("Комментарий", Объект.Комментарий);
	
	
	ЗаполнятьПодписантов = CW_Настройки.ПолучитьНастройкуПользователя(,"ПодставлятьУполномоченныхЛицПриСозданииДокументов");
	ПараметрыПроцедуры.Вставить("ЗаполнятьПодписантов", ЗаполнятьПодписантов);
	
	
	//Подсистема.СтатусыДокументов
	ПараметрыПроцедуры.Вставить("УстановитьСтатусДокумента", ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов"));
	ПараметрыПроцедуры.Вставить("СтатусДокумента", СтатусДокумента);
	//Подсистема.СтатусыДокументов
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.CW_ОтчетЭкспедитора.СформироватьДокументыОтчетаЭкспедитора",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатФормированияДокументов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ЗаполнитьИтогиПоОтчетуНаСервере(Истина);
		ОбновитьЗаголовкиСтраниц(Истина);	
		УстановитьДоступностьЭлементовФормы();
		
		МассивДокументов = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);      
		ТексСообщения = СтрСоединить(МассивДокументов,Символы.ПС);
		
		Если МассивДокументов.Количество()> 0 Тогда
			ОповеститьОбИзменении(МассивДокументов[0]);
		КонецЕсли;
		
		ПоказатьОповещениеПользователя("Сформированы документы ("+Формат(МассивДокументов.Количество(),"ЧГ=0")+"):",,ТексСообщения,,СтатусОповещенияПользователя.Информация);
		
		Элементы.Группа_Страницы.ТекущаяСтраница = Элементы.Страница_Документы;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Документы не сформированы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования документов");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Обработка_данных_НаКлиенте

&НаКлиенте
Процедура УслугиОчистить(Команда)
	
	Если Объект.Услуги.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОчистке", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить?", Режим, 0); 
		
	Иначе
		Объект.Услуги.Очистить();
		УстановитьДоступностьЭлементовФормы();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОчистке(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Услуги.Очистить();
	УстановитьДоступностьЭлементовФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.Услуги.ТекущиеДанные) ;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.Услуги.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыСтроки(СтрокаТаблицы)
	
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
	
	СтрокаТаблицы.Сумма		= СтрокаТаблицы.Цена 		* СтрокаТаблицы.Количество;
	СтрокаТаблицы.СуммаНДС	= Окр(СтрокаТаблицы.Сумма 	* Ставка/100,2,1);
	СтрокаТаблицы.Всего		= СтрокаТаблицы.Сумма 		+ СтрокаТаблицы.СуммаНДС;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	УслугиСуммаПриИзмененииНаСервере(Элементы.Услуги.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаНДСПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Услуги.ТекущиеДанные;
	
	Если НЕ ОбратныйПересчетВДокументах Тогда
		СтрокаТаблицы.Всего = СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС;
	Иначе
		СтрокаТаблицы.Сумма = СтрокаТаблицы.Всего - СтрокаТаблицы.СуммаНДС;
		СтрокаТаблицы.Цена = _сф.БезопасноРазделить(СтрокаТаблицы.Сумма,СтрокаТаблицы.Количество);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиВсегоПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.Услуги.ТекущиеДанные;
	
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
	
	СтрокаТаблицы.СуммаНДС 	= СтрокаТаблицы.Всего	*	Ставка/(100+Ставка);
	СтрокаТаблицы.Сумма 	= СтрокаТаблицы.Всего 	- 	СтрокаТаблицы.СуммаНДС;
	СтрокаТаблицы.Цена 		= _сф.БезопасноРазделить(СтрокаТаблицы.Сумма,СтрокаТаблицы.Количество);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиКлиента(Команда)
	
	Отказ = Ложь;
	ПроверитьЗаполнениеРеквизитов(Отказ);

	Если Не Отказ Тогда
		
		ЕстьМножественныйВыбор 	= Ложь;
		
		ВыборПоГрузоперевозкам 	= Ложь;
		ВыборПоДокументам		= Ложь;
		ВыборПоЗаказам	        = Ложь;
		
		Если Объект.ПорядокЗаполнения = 1 или Объект.ПорядокЗаполнения = 3 или Объект.ПорядокЗаполнения = 5 Тогда
			ЕстьМножественныйВыбор = истина;
		КонецЕсли;
		
		ВыборПоГрузоперевозкам 	= Объект.ПорядокЗаполнения = 0 или Объект.ПорядокЗаполнения = 1;
		ВыборПоЗаказам 			= Объект.ПорядокЗаполнения = 2 или Объект.ПорядокЗаполнения = 3;
		ВыборПоДокументам 		= Объект.ПорядокЗаполнения = 4 или Объект.ПорядокЗаполнения = 5;
	
		ОповещениеПриЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораГрузоперевозок",ЭтаФорма,ЕстьМножественныйВыбор);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВыборИзДокументаОтчетЭкспедитора"	, Истина);
		ПараметрыФормы.Вставить("ДатаОстатка"						, ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата, ТекущаяДата()));
		ПараметрыФормы.Вставить("Контрагент"						, Объект.Контрагент);
		ПараметрыФормы.Вставить("Договор"							, Объект.Договор);
		
		//Подсистема.УчетПриложенийДоговоров
		ПараметрыФормы.Вставить("ПриложениеКДоговору"				, Объект.ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров
		
		ПараметрыФормы.Вставить("ВыборПоЗаказам"					, ВыборПоЗаказам);
		ПараметрыФормы.Вставить("ВыборПоДокументам"					, ВыборПоДокументам);
		ПараметрыФормы.Вставить("ВыборПоГрузоперевозкам"			, ВыборПоГрузоперевозкам);
		
		ПараметрыФормы.Вставить("ЕстьМножественныйВыбор"			, ЕстьМножественныйВыбор);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе"				, Истина);
		ПараметрыФормы.Вставить("РежимВыбора"						, Истина);
		ПараметрыФормы.Вставить("Организация"						, Объект.Организация);
		ПараметрыФормы.Вставить("ПодразделениеОрганизации"			, Объект.ПодразделениеОрганизации);
		
		ОткрытьФорму("Документ.CW_ОтчетЭкспедитора.Форма.ФормаВыбораГрузоперевозокПоОстаткам" , ПараметрыФормы, ЭтаФорма,,,,ОповещениеПриЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не выбран контрагент!";
		Сообщение.Поле  		= "Контрагент";
		Сообщение.ПутьКДанным	= "Объект";
		Сообщение.Сообщить();
		
		Отказ = истина;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не выбран договор!";
		Сообщение.Поле  		= "Договор";
		Сообщение.ПутьКДанным	= "Объект";
		Сообщение.Сообщить();
		
		Отказ = истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораГрузоперевозок(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ОбработатьРезульатаНаСервере(Результат, ДополнительныеПараметры);
		
		//После выбора грузоперевозок перезаполняем табличную часть
		РезультатВыполнения =  ЗаполнитьНаСервереВФоне();
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗаполнения", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не выбран контрагент!";
		Сообщение.Поле  		= "Контрагент";
		Сообщение.ПутьКДанным	= "Объект";
		Сообщение.Сообщить();

		
		СтандартнаяОбработка = ложь;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область Обработка_данных_НаСервере

&НаСервере
Функция ПолучитьСостояниеДокумента()
	
	Если Объект.ПометкаУдаления Тогда
		Возврат 4;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыДокумента(Ссылка)
	
	МетаданныеДокумента	= Ссылка.Метаданные();
	
	ЕстьРучнаяКорректировка	= ОбщегоНазначения.ЕстьРеквизитОбъекта("РучнаяКорректировка", МетаданныеДокумента);
	
	ИменаРеквизитов	= "Проведен, ПометкаУдаления";
	Если ЕстьРучнаяКорректировка Тогда
		ИменаРеквизитов	= ИменаРеквизитов + ", РучнаяКорректировка";
	КонецЕсли;
	
	Результат	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	Если НЕ ЕстьРучнаяКорректировка Тогда
		Результат.Вставить("РучнаяКорректировка", Ложь);
	КонецЕсли;
	
	Результат.Вставить("РегОперация",	БухгалтерскийУчетКлиентСерверПереопределяемый.ЭтоРегламентнаяОперация(Ссылка));
	Результат.Вставить("ОперацияБух",	ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОперацияБух"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбработатьРезульатаНаСервере(Результат,ЕстьМножественныйВыбор)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		МассивОбъектов = ПолучитьИзВременногоХранилища(Результат);
		Если ЕстьМножественныйВыбор тогда
			ЗначениеЗаполненияСписок.ЗагрузитьЗначения(МассивОбъектов);
		Иначе
			ЗначениеЗаполненияСсылка = МассивОбъектов[0];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьГрузоперевозкиКлиентаНаСервере(ОтобрГрузоперевозок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПеревыставлениеОстатки.Грузоперевозка КАК Грузоперевозка,
	|	CW_ПеревыставлениеОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	CW_ПеревыставлениеОстатки.ВсегоОстаток КАК ВсегоОстаток,
	|	CW_ПеревыставлениеОстатки.СуммаОстаток КАК СуммаОстаток,
	|	CW_ПеревыставлениеОстатки.НДСОстаток КАК НДСОстаток
	|ПОМЕСТИТЬ ВТ_Грузоперевозки
	|ИЗ
	|	РегистрНакопления.CW_Перевыставление.Остатки(
	|			&ДатаОтчета,
	|			Контрагент = &Контрагент
	//Подсистема.УчетПриложенийДоговоров
	|			И ПриложениеКДоговору = &ПриложениеКДоговору
	//Подсистема.УчетПриложенийДоговоров
	|				И Договор = &Договор) КАК CW_ПеревыставлениеОстатки";
	
	Запрос.УстановитьПараметр("ДатаОтчета"	, Объект.Дата);	
	Запрос.УстановитьПараметр("Контрагент"	, Объект.Контрагент);	
	Запрос.УстановитьПараметр("Договор"		, Объект.Договор);	
	
	//Подсистема.УчетПриложенийДоговоров
	Запрос.УстановитьПараметр("ПриложениеКДоговору"		, Объект.ПриложениеКДоговору);	
	//Подсистема.УчетПриложенийДоговоров
	
	Запрос.Выполнить();
	
	Если  ОтобрГрузоперевозок тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Грузоперевозки.Грузоперевозка КАК ОбъектОтбора
		|ИЗ
		|	ВТ_Грузоперевозки КАК ВТ_Грузоперевозки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Грузоперевозки.Грузоперевозка"
		
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_Грузоперевозки.Грузоперевозка.Заказ КАК ОбъектОтбора
		|ИЗ
		|	ВТ_Грузоперевозки КАК ВТ_Грузоперевозки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Грузоперевозки.Грузоперевозка.Заказ";
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ОбъектОтбора");
		
	КонецЕсли;
	
	Возврат Новый Массив;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьИтогиПоОтчетуНаСервере(ПолучитьИтогиПоПеревыставленным = Ложь)
	
	//Таблица услуги
	Итог_Получено_Сумма   = Объект.Услуги.Итог("Сумма_1");
	Итог_Получено_НДС     = Объект.Услуги.Итог("СуммаНДС_1");
	Итог_Получено_Всего   = Объект.Услуги.Итог("Всего_1");
	
	Итог_Перевыставить_Сумма   	= Объект.Услуги.Итог("Сумма");
	Итог_Перевыставить_НДС     	= Объект.Услуги.Итог("СуммаНДС");
	Итог_Перевыставить_Всего   	= Объект.Услуги.Итог("Всего");
	СтрВалюта 					= Строка(ВалютаРегламентированногоУчета);
	СтрВалютаДоговора 			= Строка(Объект.ВалютаДокумента);
	
	Элементы.Строка_ИтогоПолученоРасходов.ЦветТекста 		=  ?(Итог_Получено_Сумма <> Итог_Перевыставить_Сумма, 	Новый Цвет(255,0,0),	Новый Цвет);
	Элементы.Строка_ИтогоПеревыставитьРасходов.ЦветТекста 	=  ?(Итог_Получено_НДС 	 <> Итог_Перевыставить_НДС, 	Новый Цвет(255,0,0),	Новый Цвет);
	Элементы.Строка_ИтогоПеревытавленоРасходов.ЦветТекста 	=  ?(Итог_Получено_Всего <> Итог_Перевыставить_Всего, 	Новый Цвет(255,0,0),	Новый Цвет);
	
	Строка_ИтогоПолученоРасходов 		= "Получено расходов: "+Формат(Итог_Получено_Сумма,"ЧДЦ=2")+" "+ СтрВалюта+ 
										?(Итог_Получено_НДС = 0,"", ", НДС: "+Формат(Итог_Получено_НДС,"ЧДЦ=2")+" "+СтрВалюта)+ 
										", Всего: "+ Формат(Итог_Получено_Всего,"ЧДЦ=2")+" "+СтрВалюта;
									
	Строка_ИтогоПеревыставитьРасходов 	= "К перевыставлению: "+Формат(Итог_Перевыставить_Сумма,"ЧДЦ=2")+" "+СтрВалюта+ 
										?(Итог_Перевыставить_НДС = 0,"", ", НДС: "+Формат(Итог_Перевыставить_НДС,"ЧДЦ=2")+" "+СтрВалюта)+ 
										", Всего: "+ Формат(Итог_Перевыставить_Всего,"ЧДЦ=2")+" "+СтрВалюта;
										
	Строка_ИтогоПеревытавленоРасходов 				 = "Перевыставлено: ";
	Строка_ИтогоПеревытавленоРасходовВВалютеДоговора = "Перевыставлено: ";
										
	Итог_Перевыставлено_Сумма   = 0;
	Итог_Перевыставлено_НДС   	= 0;
	Итог_Перевыставлено_Всего  	= 0;
	
	Итог_Перевыставлено_СуммаВал  = 0;	
	Итог_Перевыставлено_НДСВал    = 0;
	Итог_Перевыставлено_ВсегоВал  = 0;
	
	Если ПолучитьИтогиПоПеревыставленным тогда
		
		Запрос = новый Запрос;
		запрос.Текст = "ВЫБРАТЬ
		               |	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент КАК СвязанныйДокумент
		               |ПОМЕСТИТЬ ВТ_Документы
		               |ИЗ
		               |	РегистрСведений.CW_ДокументыОтчетаЭкспедитора КАК CW_ДокументыОтчетаЭкспедитора
		               |ГДЕ
		               |	CW_ДокументыОтчетаЭкспедитора.ОтчетЭкспедитора = &ОтчетЭкспедитора
		               |	И CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.Проведен
		               |	И CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.ФормируетсяАкт = ИСТИНА
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	СвязанныйДокумент
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	CW_ДоходыПоГрузоперевозкамОбороты.ДокументДоходов КАК ДокументДоходов,
		               |	CW_ДоходыПоГрузоперевозкамОбороты.ВсегоОборот КАК ВсегоОборот,
		               |	CW_ДоходыПоГрузоперевозкамОбороты.СуммаОборот КАК СуммаОборот,
		               |	CW_ДоходыПоГрузоперевозкамОбороты.НДСОборот КАК НДСОборот
		               |ПОМЕСТИТЬ ВТ_Обороты
		               |ИЗ
		               |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам.Обороты(
		               |			,
		               |			,
		               |			Период,
		               |			ДокументДоходов В
		               |				(ВЫБРАТЬ
		               |					ВТ_Документы.СвязанныйДокумент КАК СвязанныйДокумент
		               |				ИЗ
		               |					ВТ_Документы КАК ВТ_Документы)) КАК CW_ДоходыПоГрузоперевозкамОбороты
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДокументДоходов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Документы.СвязанныйДокумент КАК СвязанныйДокумент,
		               |	СУММА(ВТ_Документы.СвязанныйДокумент.СуммаДокумента) КАК ВсегоВал,
		               |	СУММА(ВТ_Документы.СвязанныйДокумент.СуммаНДС) КАК НДСВал,
		               |	СУММА(ВТ_Документы.СвязанныйДокумент.СуммаДокумента - ВТ_Документы.СвязанныйДокумент.СуммаНДС) КАК СуммаВал,
		               |	СУММА(ЕСТЬNULL(ВТ_Обороты.ВсегоОборот, 0)) КАК Всего,
		               |	СУММА(ЕСТЬNULL(ВТ_Обороты.СуммаОборот, 0)) КАК Сумма,
		               |	СУММА(ЕСТЬNULL(ВТ_Обороты.НДСОборот, 0)) КАК НДС
		               |ИЗ
		               |	ВТ_Документы КАК ВТ_Документы
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Обороты КАК ВТ_Обороты
		               |		ПО ВТ_Документы.СвязанныйДокумент = ВТ_Обороты.ДокументДоходов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_Документы.СвязанныйДокумент
		               |ИТОГИ
		               |	СУММА(ВсегоВал),
		               |	СУММА(НДСВал),
		               |	СУММА(СуммаВал),
		               |	СУММА(Всего),
		               |	СУММА(Сумма),
		               |	СУММА(НДС)
		               |ПО
		               |	ОБЩИЕ";
		
		Запрос.УстановитьПараметр("ОтчетЭкспедитора",  Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаИтог.Следующий() Тогда
			
			Итог_Перевыставлено_Сумма   = ?(Объект.ВалютаДокумента = ВалютаРегламентированногоУчета,ВыборкаИтог.СуммаВал	, ВыборкаИтог.Сумма) 	;
			Итог_Перевыставлено_НДС   	= ?(Объект.ВалютаДокумента = ВалютаРегламентированногоУчета,ВыборкаИтог.НДСВал		, ВыборкаИтог.НДС) 		;
			Итог_Перевыставлено_Всего  	= ?(Объект.ВалютаДокумента = ВалютаРегламентированногоУчета,ВыборкаИтог.ВсегоВал	, ВыборкаИтог.Всего) 	;
			
			Итог_Перевыставлено_СуммаВал  = ВыборкаИтог.СуммаВал;	
			Итог_Перевыставлено_НДСВал    = ВыборкаИтог.НДСВал;
			Итог_Перевыставлено_ВсегоВал  = ВыборкаИтог.ВсегоВал;
			
			
			Строка_ИтогоПеревытавленоРасходов = Строка_ИтогоПеревытавленоРасходов+Формат(Итог_Перевыставлено_Сумма,"ЧДЦ=2")+" "+СтрВалюта+ 
												?(Итог_Перевыставлено_НДС = 0,"", ", НДС: "+Формат(Итог_Перевыставлено_НДС,"ЧДЦ=2")+" "+СтрВалюта)+ 
												", Всего: "+ Формат(Итог_Перевыставлено_Всего,"ЧДЦ=2")+" "+СтрВалюта;

			Строка_ИтогоПеревытавленоРасходовВВалютеДоговора = 	Строка_ИтогоПеревытавленоРасходовВВалютеДоговора+Формат(Итог_Перевыставлено_СуммаВал,"ЧДЦ=2")+" "+СтрВалютаДоговора+ 
																?(Итог_Перевыставлено_НДСВал = 0,"", ", НДС: "+Формат(Итог_Перевыставлено_НДСВал,"ЧДЦ=2")+" "+СтрВалютаДоговора)+ 
																", Всего: "+ Формат(Итог_Перевыставлено_ВсегоВал,"ЧДЦ=2")+" "+СтрВалютаДоговора;
			
		Конецесли;
		
	КонецЕсли;
	
	если Итог_Получено_Всего <> Итог_Перевыставлено_Всего Тогда
		Элементы.ГруппаПеревыставлено.ЦветФона = ЦветаСтиля.СобытиеОтказ; 
	Иначе
		Элементы.ГруппаПеревыставлено.ЦветФона = Новый Цвет; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УслугиСуммаПриИзмененииНаСервере(ИдентификаторСтроки)
	
	СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС);
	
	СтрокаТаблицы.Цена 		= _сф.БезопасноРазделить(СтрокаТаблицы.Сумма,СтрокаТаблицы.Количество);
	СтрокаТаблицы.СуммаНДС 	= CW_Финансы.РассчитатьСуммуНДС(СтрокаТаблицы.Сумма, Истина, Ложь, Ставка);
	СтрокаТаблицы.Всего		= СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляЗаполнения()
	
	МассивОбъектов 		= Новый Массив;
	
	//ГРУЗОПЕРЕВОЗКИ
	Если Объект.ПорядокЗаполнения = 0 Тогда
		//Выбрана однга грузоперевозка
		МассивОбъектов.Добавить(ЗначениеЗаполненияСсылка);
	ИначеЕсли Объект.ПорядокЗаполнения = 1 Тогда
		//Передан список грузоперевозок
		МассивОбъектов = ЗначениеЗаполненияСписок.ВыгрузитьЗначения();
	ИначеЕсли Объект.ПорядокЗаполнения = 2 ИЛИ Объект.ПорядокЗаполнения = 3 Тогда
		//ЗАКАЗЫ	
		МассивОбъектов = ПолучитьГрузоперевозкиИзЗаказов();
	ИначеЕсли Объект.ПорядокЗаполнения = 4 Тогда
		//Документы
		МассивОбъектов.Добавить(ЗначениеЗаполненияСсылка);
	ИначеЕсли Объект.ПорядокЗаполнения = 5 Тогда
		//Список документов
		МассивОбъектов = ЗначениеЗаполненияСписок.ВыгрузитьЗначения();
	КонецЕсли;
	
	Возврат МассивОбъектов;
	
КонецФункции

&НаСервере
Функция ПолучитьГрузоперевозкиИзЗаказов()
	
	Если Объект.ПорядокЗаполнения = 2 Тогда
		//Выбран один заказа
		МассивЗаказов = Новый Массив;
		МассивЗаказов.Добавить(ЗначениеЗаполненияСсылка);
		
	ИначеЕсли Объект.ПорядокЗаполнения = 3 Тогда
		//Передан список заказов
		МассивЗаказов =  ЗначениеЗаполненияСписок.ВыгрузитьЗначения();
		
	КонецЕсли;
	
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_Грузоперевозки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.Заказ В(&МассивЗаказов)
	|	И НЕ CW_Грузоперевозки.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_Грузоперевозки.Ссылка";
	
	запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		времТаблица = РезультатЗапроса.Выгрузить();
		Возврат времТаблица.ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура _ПодставитьПодписантов()
	
	Если (Объект.Организация.Пустая()) Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.Руководитель 			= Неопределено;
	Объект.Руководитель_основание 	= "";
	
	Объект.ГлавныйБухгалтер 			= Неопределено;
	Объект.ГлавныйБухгалтер_основание 	= "";
	
	ДанныеПодписантовОрагнизации = _УФС.ПолучитьОтветственныхЛиц(Объект.Организация,Объект.ПодразделениеОрганизации);
	
	ДанныеРуководитель = ДанныеПодписантовОрагнизации.Получить(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	
	Если ДанныеРуководитель <> Неопределено Тогда
		
		ДанныеРуководитель.Свойство("УполномоченноеЛицо", Объект.Руководитель);
		ДанныеРуководитель.Свойство("НомерДатаПриказа"	, Объект.Руководитель_основание);
		
	КонецЕсли;
	
	ДанныеГлавныйБухгалтер = ДанныеПодписантовОрагнизации.Получить(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	
	Если ДанныеГлавныйБухгалтер <> Неопределено Тогда
		
		ДанныеГлавныйБухгалтер.Свойство("УполномоченноеЛицо", Объект.ГлавныйБухгалтер);
		ДанныеГлавныйБухгалтер.Свойство("НомерДатаПриказа"	, Объект.ГлавныйБухгалтер_основание);
		
	КонецЕсли;


КонецПроцедуры

#КонецОбласти

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область Документы_вознаграждения

&НаКлиенте
Процедура ДокументыВознагражденияПодбор(Команда)
	
	ОткрытьФОрмуПодбораДОкументовВознаграждения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВознагражденияДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуПодбораДОкументовВознаграждения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФОрмуПодбораДОкументовВознаграждения(Элемент = Неопределено)
	
	ВладелецФормы 		= Элемент;
	Если Элемент = Неопределено Тогда
		ВладелецФормы 		= Элементы.ДокументыВознаграждения;	
		ОписаниеОповещения 	= Новый ОписаниеОповещения("ПродолжитьВыборДокументов", ЭтотОбъект);
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", ПолучитьДанныеВыбораНаСервере());
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("Отбор", 					СтруктураОтбора);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", 	Элемент = Неопределено);
	ПараметрыФормыВыбора.Вставить("РежимВыбора", 			Истина);
	ПараметрыФормыВыбора.Вставить("ПодборВознаграждения", 	Истина);
	
	ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.ФормаВыбора",ПараметрыФормыВыбора,ВладелецФормы,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыборДокументов(РезультатВыбора, Параметры) Экспорт

	Если РезультатВыбора <> Неопределено Тогда
		ЗаполнитьВыбранныеДокументыНаСервере(РезультатВыбора);
		ОбновитьЗаголовкиСтраниц();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыбранныеДокументыНаСервере(РезультатВыбора)
	
	ТабЧасть = Объект.ДокументыВознаграждения;
	
	Для Каждого ЭлементМасссива из РезультатВыбора Цикл
		
		Отбор = Новый Структура("Документ",ЭлементМасссива);
		мСтроки = ТабЧасть.НайтиСтроки(Отбор);
		
		Если мСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТабЧасть.Добавить();
			НоваяСтрока.Документ = ЭлементМасссива;
			НоваяСтрока.СуммаДокумента = ЭлементМасссива.СуммаДокумента;
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеВыбораНаСервере()
	
	МассивГрузоперевозок = Объект.Услуги.Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.Контрагент = &Контрагент
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.Договор = &Договор
				   //Подсистема.УчетПриложенийДоговоров
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ПриложениеКДоговору = &ПриложениеКДоговору
				   //Подсистема.УчетПриложенийДоговоров
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.Организация = &Организация
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ФормируетсяАкт
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.ПорядокОтражения = &ПорядокОтражения
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка В(&МассивГрузоперевозок)";
	
	
	Запрос.УстановитьПараметр("Организация"				, Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент"				, Объект.Контрагент);
	Запрос.УстановитьПараметр("Договор"					, Объект.Договор);
	
	//Подсистема.УчетПриложенийДоговоров
	Запрос.УстановитьПараметр("ПриложениеКДоговору"		, Объект.ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	Запрос.УстановитьПараметр("МассивГрузоперевозок"	, МассивГрузоперевозок);
	Запрос.УстановитьПараметр("ПорядокОтражения"		, ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ДокументыВознагражденияОчистить(Команда)
	
	Если Объект.ДокументыВознаграждения.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОчисткеДокументовВознаграждения", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить?", Режим, 0); 
		
	Иначе
		ОчиститьДокументыВознаграждения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОчисткеДокументовВознаграждения(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьДокументыВознаграждения();
	
КонецПроцедуры

&НаКлиенте
Процедура  ОчиститьДокументыВознаграждения()
	
	Объект.ДокументыВознаграждения.Очистить();
	ОбновитьЗаголовкиСтраниц();

КонецПроцедуры

&НаКлиенте
Процедура ДокументыВознагражденияДокументПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДокументыВознаграждения.ТекущиеДанные;
	ТекущиеДанные.СуммаДокумента = ПолучитьСуммуДокументаНаСервере(ТекущиеДанные.Документ);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуДокументаНаСервере(ВыбранныеДокумент)
	
	Возврат ВыбранныеДокумент.СуммаДокумента;
	
КонецФункции

&НаКлиенте
Процедура ДокументыВознагражденияДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Отбор = Новый Структура("Документ",ВыбранноеЗначение);
	мСтроки = Объект.ДокументыВознаграждения.НайтиСтроки(Отбор);
	
	Если мСтроки.количество()> 0 Тогда      
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(,"Документ "+Строка(ВыбранноеЗначение)+" уже есть в списке!");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыВознагражденияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьЗаголовкиСтраниц();
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументыПриИзменении(Элемент)
	ЗаполнитьИтогиПоОтчетуНаСервере(Истина);
КонецПроцедуры


#КонецОбласти

//Подсистема.СтатусыДокументов
&НаКлиенте
Процедура СтатусДокументаИзменить(Команда)
	
	CW_СтатусыДокументовКлиент.ОткрытьФормуРедактированияСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДанныхСтатуса(Результат, ДополнительныеПараметры) Экспорт
	
	CW_СтатусыДокументовКлиент.ОбработатьИзменениеДанныхСтатуса(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаИстория(Команда)
	
	CW_СтатусыДокументовКлиент.ПоказатьИсториюСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.ОткрытьСтатусДокумента(ЭтаФорма,Элемент, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаАвтоПодбор(ЭтаФорма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	CW_СтатусыДокументовКлиент.ПриИзмененииСтатусаДокумента(ЭтаФорма, Элемент);
	
	ЗадатьВопросОбИзмененииСтатусовСвязанныхДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОбИзмененииСтатусовСвязанныхДокументов()
	
	ВсегоСвязанныхДокументов = ПолучитьКоличествоСвязанныхДокументов(Объект.Ссылка);
	
	Если ЗадатьВопросПриИзмененииСтатуса и 
		(ВсегоСвязанныхДокументов > 0 или Объект.ДокументыВознаграждения.Количество() > 0) Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбИзмененииСтатуса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Изменить статус подчиненных документов?", Режим, 0);	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбИзмененииСтатуса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ПродолжитьУстановкуСтатусовСвязанныхДокументов();
	

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьУстановкуСтатусовСвязанныхДокументов()

	РезультатВыполнения =  ПродолжитьУстановкуСтатусовСвязанныхДокументовНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатУстановкуСтатусовСвязанныхДокументов", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

Функция ПродолжитьУстановкуСтатусовСвязанныхДокументовНаСервереВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Установка статуса связанных документов (Отчет экспедитора)";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	СтруктураСвязанныеДокументы = Документы.CW_ОтчетЭкспедитора.ПолучитьСвязанныеДоходыПоГрузопереовзкам(Объект.Ссылка);
	мДокументыВознаграждения 	= Объект.ДокументыВознаграждения.Выгрузить().ВыгрузитьКолонку("Документ");
	
	мВсеДокументы = СтруктураСвязанныеДокументы.ВсеДокументы;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мВсеДокументы, мДокументыВознаграждения, Истина);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ВсеДокументы", мВсеДокументы);
	ПараметрыПроцедуры.Вставить("УстанавливаемыйСтатус", СтатусДокумента);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.CW_ОтчетЭкспедитора.УстановитьСтатусСвязанныхДокументов",ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатУстановкуСтатусовСвязанныхДокументов(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ЗаполнитьИтогиПоОтчетуНаСервере(Истина);
		ОбновитьЗаголовкиСтраниц(Истина);	
		УстановитьДоступностьЭлементовФормы();
		
		МассивДокументов = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата); 
		
		Если  МассивДокументов.Количество() > 0 Тогда
			ОповеститьОбИзменении(МассивДокументов[0]);
		КонецЕсли;
		
		ТексСообщения = СтрСоединить(МассивДокументов,Символы.ПС);
		
		ПоказатьОповещениеПользователя("Изменен статус ("+Формат(МассивДокументов.Количество(),"ЧГ=0")+"):",,ТексСообщения,,СтатусОповещенияПользователя.Информация);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось отсоединить документы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		ПоказатьПредупреждение(,ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеИзменениеСтатусДокументаНаСервере()
	
	CW_СтатусыДокументовСервер.ПолучитьТекущийСтатусДокумента(Объект, ЭтаФорма);

КонецПроцедуры
//Подсистема.СтатусыДокументов

//Подсистема.УчетПриложенийДоговоров
&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	ОбработатьИзменениеДоговораНаСервере();
КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ИспользоватьДопРеквизиты Тогда
		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
		// Конец СтандартныеПодсистемы.Свойства
	КонецЕсли;
	
	//ДатыЗапретаИзменения
	//Проверяем дату запрета по документам БУ
	мОбъектыПроверки = ПолучитьМассивОбъектовДляПроверки();
	Для Каждого ЭлементМассива из мОбъектыПроверки Цикл
		//Есть ведомые документы, проверяем дату запрета редактирования БП
		ОбъектМассива = ЭлементМассива.ПолучитьОбъект();
		Разрешено = ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ОбъектМассива);
		Если не Разрешено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//ДатыЗапретаИзменения

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОбъектовДляПроверки()
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент КАК СвязанныйДокумент
	               |ИЗ
	               |	РегистрСведений.CW_ДокументыОтчетаЭкспедитора КАК CW_ДокументыОтчетаЭкспедитора
	               |ГДЕ
	               |	CW_ДокументыОтчетаЭкспедитора.ОтчетЭкспедитора = &ОтчетЭкспедитора
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	CW_ОтчетЭкспедитораДокументыВознаграждения.Документ
	               |ИЗ
	               |	Документ.CW_ОтчетЭкспедитора.ДокументыВознаграждения КАК CW_ОтчетЭкспедитораДокументыВознаграждения
	               |ГДЕ
	               |	CW_ОтчетЭкспедитораДокументыВознаграждения.Ссылка = &ОтчетЭкспедитора";
	
	Запрос.УстановитьПараметр("ОтчетЭкспедитора", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СвязанныйДокумент.ВедомыйДокумент) 
			и Результат.Найти(Выборка.СвязанныйДокумент.ВедомыйДокумент) = Неопределено   Тогда
			Результат.Добавить(Выборка.СвязанныйДокумент.ВедомыйДокумент);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СвязанныйДокумент.ВедомыйСчетФактура) 
			и Результат.Найти(Выборка.СвязанныйДокумент.ВедомыйСчетФактура) = Неопределено   Тогда
			Результат.Добавить(Выборка.СвязанныйДокумент.ВедомыйСчетФактура);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СвязанныйДокумент.ВедомыйСчет) 
			и Результат.Найти(Выборка.СвязанныйДокумент.ВедомыйСчет) = Неопределено   Тогда
			Результат.Добавить(Выборка.СвязанныйДокумент.ВедомыйСчет);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СвязанныйДокумент.ВедомыйДокументКорректировки) 
			и Результат.Найти(Выборка.СвязанныйДокумент.ВедомыйДокументКорректировки) = Неопределено   Тогда
			Результат.Добавить(Выборка.СвязанныйДокумент.ВедомыйДокументКорректировки);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СвязанныйДокумент.ВедомыйСчетФактураКорректировочный) 
			и Результат.Найти(Выборка.СвязанныйДокумент.ВедомыйСчетФактураКорректировочный) = Неопределено   Тогда
			Результат.Добавить(Выборка.СвязанныйДокумент.ВедомыйСчетФактураКорректировочный);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.СвязанныйДокумент.ВедомыйСчетКорректировочный) 
			и Результат.Найти(Выборка.СвязанныйДокумент.ВедомыйСчетКорректировочный) = Неопределено   Тогда
			Результат.Добавить(Выборка.СвязанныйДокумент.ВедомыйСчетКорректировочный);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат; 
	
КонецФункции

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

	Оповестить("ЗаписьОтчетаЭкспедитора");
	
КонецПроцедуры

 &НаКлиенте
Процедура ПодобратьКонтрагентаИДоговорИзОстатков(Команда)
	
	ДатаОстатка = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаОстатка", ДатаОстатка);
	ПараметрыФормы.Вставить("ПодразделениеОрганизации", Объект.ПодразделениеОрганизации);     
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПодбораКонтрагентаИДоговораИзОстатковЗавершение", ЭтотОбъект);

	ОткрытьФорму("Документ.CW_ОтчетЭкспедитора.Форма.ФормаПодбораКонтрагентаИДоговораИзОстатков", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры      

&НаКлиенте
Процедура ПодбораКонтрагентаИДоговораИзОстатковЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = ПолучитьИзВременногоХранилища(РезультатВыбора);
	
	Объект.Контрагент 			= ДанныеВыбора.Контрагент;
	Объект.Договор 				= ДанныеВыбора.Договор;
	Объект.ПриложениеКДоговору 	= ДанныеВыбора.ПриложениеКДоговору;
	
	ОбработатьИзменениеДоговораНаСервере();
	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти