
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Параметры.Свойство("Организация", 	Организация);
	
	Элементы.ГруппаПодразделение.Видимость = Параметры.ПоказатьПодразделение;
	
КонецПроцедуры       

&НаКлиенте
Процедура ДоговорПокупателяПриИзменении(Элемент)
	ДоговорПокупателяПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДоговорПокупателяПриИзмененииНаСервере()
	
	УчетПриложений = CW_УчетПриложенийДоговоровСервер.ПолучитьПризнакУчетаПриложенийПоДоговору(ДоговорПокупателя);
 	Элементы.ГруппаПриложениеКДоговоруПокупателя.Видимость = УчетПриложений;
	
	Если Не УчетПриложений Тогда
		ФлагПриложениеКДоговоруПокупателя = Истина;
		ПриложениеКДоговоруПокупателя = Неопределено;
	КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура ФлагПриИзменении(Элемент) 
	
	ФлагИмя 	= Элемент.Имя;
	ЭлементИмя 	= СтрЗаменить(ФлагИмя, "Флаг", "");
	
	УстановитьДоступностьЭлемента(ЭлементИмя)

КонецПроцедуры     

&НаКлиенте
Процедура УстановитьДоступностьЭлемента(ЭлементИмя)

	Элементы[ЭлементИмя].ТолькоПросмотр = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначения(Команда)  
	
	СтруктураОтвета = Новый Структура;
	
	мФлаги = Новый Массив;
	Для Каждого Элемент из Элементы Цикл
		Если СтрНачинаетсяС(Элемент.Имя, "Флаг") 
			и ТипЗнч(Элемент) = тип("ПолеФормы") тогда
			мФлаги.Добавить(Элемент.Имя);
		КонецЕсли;
	КонецЦикла;  
	
	Для Каждого ИмяФлага из мФлаги Цикл
		
		ЗначениеФлага = ЭтаФорма[ИмяФлага];
		Если Не ЗначениеФлага Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита 		= СтрЗаменить(ИмяФлага, "Флаг", ""); 
		ЗначениеРеквизита 	= ЭтаФорма[ИмяРеквизита];
		
		СтруктураОтвета.Вставить(ИмяРеквизита, ЗначениеРеквизита);

	КонецЦикла;  
	
	ЭтаФорма.Закрыть(СтруктураОтвета);
	
КонецПроцедуры

