
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВариантОтбора = 1;
	
	ЭтаФорма.ТолькоПросмотр = (НЕ CW_ПраваДоступа.ПравоДоступно("УправлениеСистемнымиФункциями"));
	// --- 
	Если ЭтаФорма.ТолькоПросмотр Тогда
		
		Элементы.Список.ИзменятьСоставСтрок = Ложь;
		Элементы.Список.ТолькоПросмотр = Истина;
		
	КонецЕсли; 
	
	УстановитьОтборДинамическогоСписка();
	
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура 	УстановитьОтборДинамическогоСписка() 
	
	
	Отбор = Список.Отбор;
	Отбор.Элементы.Очистить();
	
	Если ВариантОтбора > 0 Тогда
		
		НовЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("НеИспользуется"); 
		НовЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
		НовЭлементОтбора.Использование 		= истина; 
		НовЭлементОтбора.ПравоеЗначение 	= ВариантОтбора = 2;
		НовЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораПриИзменении(Элемент)
	УстановитьОтборДинамическогоСписка();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьИзФайла(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлы(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Не выбрано ни одного элемена для сохранения!");
		Возврат;
	КонецЕсли; 
	
	Если ВыделенныеСтроки.Количество() = 1 Тогда
		СохранитьВыбранныйФайл(ВыделенныеСтроки[0]);	
	КонецЕсли;
	
	Если ВыделенныеСтроки.Количество() > 1 Тогда      
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
		
		Оповещение = Новый ОписаниеОповещения("ПослеПолученияПараметровСохранения", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.Форма.ФормаПараметровСохранения",,ЭтаФорма,,,,Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеПолученияПараметровСохранения(СтруктураПараметрыСохранения, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(СтруктураПараметрыСохранения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ПолучаемыеФайлы = ПолучитьПолучаемыеФайлы(ДополнительныеПараметры.ВыделенныеСтроки, СтруктураПараметрыСохранения);
	
	Если ПолучаемыеФайлы.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Для встроенной обработки не поддерживается сохранение в файл!");
		Возврат;
	КонецЕсли;      
	
	ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов("Сохранить в каталог...", Истина);
	
	ПараметрыПолученияАрхиваФайлов = Неопределено;
	Если СтруктураПараметрыСохранения.УпаковатьФайлыВАрхив Тогда   
		ПараметрыПолученияАрхиваФайлов = Новый ПараметрыПолученияАрхиваФайлов("Подключаемые_объекты.zip");
	Конецесли ;

	НачатьПолучениеФайловССервера(ПолучаемыеФайлы, ПараметрыДиалогаПолученияФайлов, ПараметрыПолученияАрхиваФайлов);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВыбранныйФайл(ВыбранныйФайл)
	
	ДанныеФайла = ПолучитьДанныеФайла(ВыбранныйФайл);
	Если ДанныеФайла = Неопределено Тогда
		ПоказатьПредупреждение(, "Ошибка получения файла");
		Возврат;
	КонецЕсли;

	ОписаниеПередаваемогоФайла = Новый ОписаниеПередаваемогоФайла;
	ОписаниеПередаваемогоФайла.Имя 		= ДанныеФайла.ИмяФайла;
	ОписаниеПередаваемогоФайла.Хранение = ДанныеФайла.АдресФайла;
	
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(ОписаниеПередаваемогоФайла);

	ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов("Сохранить как...", Ложь);
	
	НачатьПолучениеФайловССервера(ПолучаемыеФайлы, ПараметрыДиалогаПолученияФайлов); 
	
КонецПроцедуры    

&НаСервере
Функция ПолучитьДанныеФайла(ВыбранныйФайл)
	
	ДвоичныеДанные = ВыбранныйФайл.ХранилищеОбработки.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;  
	
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);

	ПолучитьДанныеФайла = Новый Структура;
	ПолучитьДанныеФайла.Вставить("ИмяФайла",	ВыбранныйФайл.ИмяФайла);
	ПолучитьДанныеФайла.Вставить("АдресФайла",	АдресФайла);
	
	Возврат ПолучитьДанныеФайла
	
КонецФункции


&НаСервере
Функция ПолучитьПолучаемыеФайлы(мСсылки, СтруктураПараметрыСохранения)
	
	ПолучаемыеФайлы = Новый Массив;
	
	ИменаФайлов = Новый Массив;
	
	Для Каждого ПодключаемыйОбъект из мСсылки Цикл
		
		ДвоичныеДанные = ПодключаемыйОбъект.ХранилищеОбработки.Получить();
		Если ДвоичныеДанные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		АдресДанныхФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	
		ПозицияТочки			= СтрНайти(ПодключаемыйОбъект.ИмяФайла,".", НаправлениеПоиска.СНачала,,1);
		
		Расширение 				= Сред(ПодключаемыйОбъект.ИмяФайла, ПозицияТочки+1); 
		ИмяФайлаБезРасширения 	= Лев(ПодключаемыйОбъект.ИмяФайла, ПозицияТочки-1);
		
		Если СтруктураПараметрыСохранения.ВариантПолученияИмениФайла = 1 Тогда
			ИмяФайлаБезРасширения = СокрЛП(ПодключаемыйОбъект);
		КонецЕсли; 
		
		ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаБезРасширения);
		
		Если СтруктураПараметрыСохранения.ПараметрыСохранения = 1 Тогда  
			ИмяФайлаБезРасширения = ИмяФайлаБезРасширения+"\"+ИмяФайлаБезРасширения;
		КонецЕсли;
		
		Индекс = 1;
		Пока ИменаФайлов.Найти(ИмяФайлаБезРасширения) <> Неопределено Цикл
			ИмяФайлаБезРасширения = ИмяФайлаБезРасширения+"("+Формат(Индекс,"ЧГ=0")+")";
			Индекс = Индекс + 1;
		КонецЦикла;
		
		ИменаФайлов.Добавить(ИмяФайлаБезРасширения);
		
		ОписаниеПередаваемогоФайла = Новый ОписаниеПередаваемогоФайла;
		ОписаниеПередаваемогоФайла.Имя 		= ИмяФайлаБезРасширения+"."+Расширение;
		ОписаниеПередаваемогоФайла.Хранение = АдресДанныхФайла;
		
		ПолучаемыеФайлы.Добавить(ОписаниеПередаваемогоФайла);
		
	КонецЦикла;
	
	Возврат ПолучаемыеФайлы;
	
КонецФункции


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти