&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьПриОткрытии=Параметры.Свойство("Документ",Документ);
	Параметры.Свойство("ВерсияБюджета",ВерсияБюджета);
	Если ВерсияБюджета.Пустая() Тогда
		ВерсияБюджета = CW_Бюджетирование.ПолучитьОсновнуюВерсиюБюджета();
		ВерсияБюджета = ?(ЗначениеЗаполнено(ВерсияБюджета),ВерсияБюджета, Справочники.CW_ВерсииБюджетов.Основная);
	КонецЕсли; 
	
	ПравоДоступноПросмотрБюджетов = CW_ПраваДоступа.ПравоДоступно("ПросмотрБюджетов");
	ПравоДоступноРедактированиеБюджетов = CW_ПраваДоступа.ПравоДоступно("РедактированиеБюджетов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаНастройка.Пометка=Истина;
	
	Если СформироватьПриОткрытии Тогда
		
		_Настройка(Истина);
		СформироватьОтчет();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	_Настройка(Истина);
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	// --- 
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда 
		_УФК.ВывестиПредупреждение("Не выбран документ!");
		Возврат;
	КонецЕсли;
	
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	// дорабатываем
	_Доработать();
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	// --- 
	
	Настройки = _сф.ст_Создать("ВерсияБюджета,Документ");
	Настройки.Документ = Документ;
	Настройки.ВерсияБюджета = ВерсияБюджета;
	Возврат(ПоместитьВоВременноеХранилище(Настройки,ЭтаФорма.УникальныйИдентификатор));
	
	// --- 
КонецФункции

&НаСервере
Процедура _Доработать()
	// --- 
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Контрагент:",   "Клиент:"     ,                                   , 8);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого",        "ИТОГО:");
	CW_Отчеты.УжатьПоВысотеСтрокиПередИПослеЗаголовка(Результат);
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть=Ложь)
	// --- 
	
	Если Скрыть Тогда
		
		Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка=Ложь;
		
	Иначе
		
		Если Элементы.ГруппаНастройкиОтчета.Видимость Тогда
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка=Ложь;
			
		Иначе
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка=Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
		
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
    СтандартнаяОбработка = Ложь;
	
	СтруктураИзРасшифровки = _ПолучитьСтруктуруПоДаннымРасшифровки(Расшифровка);
	ИмяПоля = СтруктураИзРасшифровки.ИмяПоля;
	Статья  = СтруктураИзРасшифровки.Статья;
	
	Если ИмяПоля = "Ссылка" Тогда
		Если НЕ ЗначениеЗаполнено(Статья) ИЛИ ТипЗнч(Статья) <> Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов") Тогда
			Возврат;
		КонецЕсли;	
		Если ПравоДоступноПросмотрБюджетов Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", Статья);
			ПараметрыФормы.Вставить("ТолькоПросмотр", СтруктураИзРасшифровки.ТолькоПросмотр);
			ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;	
		Возврат;
	КонецЕсли;
	
	Если ИмяПоля = "Отклонение" Тогда
		Если СтруктураИзРасшифровки.Отклонение <> 0 Тогда
			Если ПравоДоступноРедактированиеБюджетов Тогда
				
				Если НЕ ЗначениеЗаполнено(Статья) ИЛИ ТипЗнч(Статья) <> Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов") Тогда
					
					// Статьи нет
					ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаДобавленияСтатьиБюджета",ЭтотОбъект, Новый Структура("СтруктураИзРасшифровки",СтруктураИзРасшифровки)); 
					ПоказатьВопрос(ПОВ,"Добавить статью бюджета?", РежимДиалогаВопрос.ДаНет);
					
				Иначе
					
					// Статью корректировать;
					ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаКорректированияСтатьиБюджета",ЭтотОбъект, Новый Структура("СтруктураИзРасшифровки",СтруктураИзРасшифровки)); 
					ПоказатьВопрос(ПОВ,"Скорректировать статью бюджета?", РежимДиалогаВопрос.ДаНет);
					
				КонецЕсли;	
				
			КонецЕсли;
		КонецЕсли;
		Возврат;
	КонецЕсли;	
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	// ---------------------------------------------------------------------------- 
	
    ДоступныеДействия = Новый Массив();
    ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
    
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				СформироватьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаДобавленияСтатьиБюджета(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		
		Ответ = _ДобавитьСтатьюБюджетаПоСтруктуреИзРасшифровки(ДополнительныеПараметры.СтруктураИзРасшифровки);
		Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда 
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
			Возврат;
		КонецЕсли;
		СформироватьОтчет();
		
	КонецЕсли;	
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаКорректированияСтатьиБюджета(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Ответ = _СкорректироватьСтатьюБюджетаПоСтруктуреИзРасшифровки(ДополнительныеПараметры.СтруктураИзРасшифровки);
		Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда 
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
			Возврат;
		КонецЕсли;
		СформироватьОтчет();
	КонецЕсли;	
	
	// --- 
КонецПроцедуры
  

&НаСервере
Процедура ПересчитатьСуммыСтатьиНаСервере(Статья)
	
	СтавкаНДСПроцент 	= CW_Финансы.ПолучитьСтавкуНДС(Статья.СтавкаНДС);
	Статья.СуммаНДС 	= ОКР(Статья.СуммаВсего * СтавкаНДСПроцент / (100 + СтавкаНДСПроцент), 2);
	
	Статья.СуммаВсегоРуб 	= ОКР(Статья.СуммаВсего * Статья.Курс / Статья.Кратность, 2);
	Статья.СуммаНДСРуб 		= ОКР(Статья.СуммаВсегоРуб * СтавкаНДСПроцент/(100 + СтавкаНДСПроцент), 2);
	
	Если Статья.УчитыватьНДСВСебестоимости Тогда
		Статья.Сумма	= Статья.СуммаВсего;
		Статья.СуммаРуб	= Статья.СуммаВсегоРуб;
	Иначе
		Статья.Сумма	= Статья.СуммаВсего - Статья.СуммаНДС;
		Статья.СуммаРуб	= Статья.СуммаВсегоРуб - Статья.СуммаНДСРуб;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция _ЗапрещеноРедактированиеБюджета(Грузоперевозка)
	
	ТокаПосмотреть = Истина;
	Если ПравоДоступноРедактированиеБюджетов Тогда
		ТокаПосмотреть = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	CW_УтверждениеБюджетов.Объект
			|ИЗ
			|	РегистрСведений.CW_УтверждениеБюджетов КАК CW_УтверждениеБюджетов
			|ГДЕ
			|	CW_УтверждениеБюджетов.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект", Грузоперевозка);
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
			ТокаПосмотреть = Истина;
		КонецЕсли;
	КонецЕсли;	
			
	Возврат ТокаПосмотреть;
	
КонецФункции

&НаСервере
Функция _ДобавитьСтатьюБюджетаПоСтруктуреИзРасшифровки(стру)

	УчитыватьНДСВСебестоимости = CW_Настройки.ПараметрУчетнойПолитики(Документ.Дата, Документ.Организация, "УчитыватьНДСВСебестоимости");

	Статья = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьЭлемент();
	Статья.Валюта                	 = Документ.Валюта;
	Статья.ВерсияБюджета        	  = ВерсияБюджета;
	Статья.ВидСтатьиПланирования 	  = Перечисления.CW_ВидыСтатейПланирования.Расходы;
	Статья.Владелец              	  = стру.Грузоперевозка;
	Статья.Организация           	  = Документ.Организация;
	Статья.Контрагент            	  = Документ.Контрагент;
	Статья.Номенклатура         	  = стру.Номенклатура;  
	Статья.УчитыватьНДСВСебестоимости = УчитыватьНДСВСебестоимости;  
	
	ДанныеКурса = CW_Финансы.ПолучитьКурсВалюты(Статья.Валюта, Документ.Дата);
	Статья.Курс			= ДанныеКурса.Курс;   
	Статья.Кратность	= ДанныеКурса.Кратность;   
	
	Статья.СтавкаНДС             = стру.СтавкаНДС;
	Статья.СуммаВсего            = стру.СуммаВсего;
	ПересчитатьСуммыСтатьиНаСервере(Статья);
	Попытка
		Статья.Записать();
	Исключение
		Возврат _УФКС.Ответ(1, "Ошибка создания статьи бюджета!" + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат _УФКС.Ответ();

КонецФункции 

&НаСервере
Функция _СкорректироватьСтатьюБюджетаПоСтруктуреИзРасшифровки(стру)

	СтатьяОб = стру.Статья.ПолучитьОбъект();
	СтатьяОб.СуммаВсего = стру.СуммаВсего;
	ПересчитатьСуммыСтатьиНаСервере(СтатьяОб);						
	
	Попытка
		СтатьяОб.Записать();
	Исключение
		Возврат _УФКС.Ответ(1, "Ошибка обновления статьи бюджета!" + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат _УФКС.Ответ();

КонецФункции
Функция _ПолучитьСтруктуруПоДаннымРасшифровки(Расшифровка)
	
	// значение возврата
	стру = Новый Структура("ИмяПоля, Статья");
	
	// объект
	ДР = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	
	стру.ИмяПоля = ДР.Элементы[Расшифровка].ПолучитьПоля()[0].Поле;
	
	Если стру.ИмяПоля = "Ссылка" Тогда
		стру.Вставить("Статья", ДР.Элементы[Расшифровка].ПолучитьПоля()[0].Значение);
		стру.Вставить("Грузоперевозка", ДР.Элементы[Расшифровка - 3].ПолучитьПоля()[0].Значение);
		Если ПравоДоступноПросмотрБюджетов И ЗначениеЗаполнено(стру.Статья) И ТипЗнч(стру.Статья) = Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов") Тогда
			стру.Вставить("ТолькоПросмотр", _ЗапрещеноРедактированиеБюджета(стру.Грузоперевозка));
		КонецЕсли;	
		
	ИначеЕсли стру.ИмяПоля = "Отклонение" Тогда
		стру.Вставить("Отклонение", ДР.Элементы[Расшифровка].ПолучитьПоля()[0].Значение);
		стру.Вставить("Статья", ДР.Элементы[Расшифровка - 3].ПолучитьПоля()[0].Значение);	
		Если стру.Отклонение <> 0 Тогда
			Если ПравоДоступноРедактированиеБюджетов Тогда
				Если НЕ ЗначениеЗаполнено(стру.Статья) ИЛИ ТипЗнч(стру.Статья) <> Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов") Тогда
					// Статьи нет - для создания надо...
					стру.Вставить("Грузоперевозка", ДР.Элементы[Расшифровка - 6].ПолучитьПоля()[0].Значение);
					стру.Вставить("Номенклатура", ДР.Элементы[Расшифровка - 5].ПолучитьПоля()[0].Значение);
					стру.Вставить("СтавкаНДС", ДР.Элементы[Расшифровка - 4].ПолучитьПоля()[0].Значение);
					стру.Вставить("СуммаВсего", ДР.Элементы[Расшифровка - 1].ПолучитьПоля()[0].Значение + ДР.Элементы[Расшифровка - 2].ПолучитьПоля()[0].Значение);
				Иначе
					// Чтобы Статью корректировать...
					стру.Вставить("СуммаВсего", ДР.Элементы[Расшифровка - 1].ПолучитьПоля()[0].Значение + ДР.Элементы[Расшифровка - 2].ПолучитьПоля()[0].Значение);
				КонецЕсли;									
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат стру;
	
КонецФункции


&НаСервере
Функция _ТолькоПосмотреть(Грузоперевозка)
	// --- 
	
	ТокаПосмотреть = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	CW_УтверждениеБюджетов.Объект
	|ИЗ
	|	РегистрСведений.CW_УтверждениеБюджетов КАК CW_УтверждениеБюджетов
	|ГДЕ
	|	CW_УтверждениеБюджетов.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Грузоперевозка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() > 0 Тогда
		ТокаПосмотреть = Истина;
	КонецЕсли;
	
	Возврат(ТокаПосмотреть);
	
	// --- 
КонецФункции
 

&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных=РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

&НаСервере
Процедура ПересчитатьСуммыСтатьи(Статья)
	
	СтавкаНДСПроцент = CW_Финансы.ПолучитьСтавкуНДС(Статья.СтавкаНДС);
	Статья.СуммаНДС = Статья.СуммаВсего * СтавкаНДСПроцент / (100 + СтавкаНДСПроцент);
	Статья.Сумма = Статья.СуммаВсего - Статья.СуммаНДС;
	
	Статья.СуммаВсегоРуб = Статья.СуммаВсего * Статья.Курс;
	Статья.СуммаНДСРуб = Статья.СуммаВсегоРуб * СтавкаНДСПроцент/(100 + СтавкаНДСПроцент);
	Статья.СуммаРуб = Статья.СуммаВсегоРуб - Статья.СуммаНДСРуб;
	
КонецПроцедуры
