&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Если Параметры.Свойство("ИдентификаторДокумента") Тогда
		ИдентификаторДокумента = СокрЛП(Параметры.ИдентификаторДокумента);  
	КонецЕсли;
	
	Параметры.Свойство("Организаия", 	Организаия);  
	Параметры.Свойство("Контрагент", 	Контрагент); 
	Параметры.Свойство("НомерСчета", 	НомерСчета); 
	Параметры.Свойство("ДатаСчета", 	ДатаСчета); 
	Параметры.Свойство("НомерАкта", 	НомерАкта); 
	Параметры.Свойство("ДатаАкта", 		ДатаАкта); 

	ПараметрыПоискаПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПоискаПриИзменении(Элемент)
	ПараметрыПоискаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПараметрыПоискаПриИзмененииНаСервере()
	
	Элементы.ИдентификаторДокумента.Доступность = (ПараметрыПоиска  = 0);
	Элементы.ГруппаСчет.Доступность = (ПараметрыПоиска  = 1);
	Элементы.ГруппаАкт.Доступность = (ПараметрыПоиска  = 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДокумент(Команда)  
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = ПолучитьДокументНаСервереВФоне();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПолученияДанныхДокументаПоставщика", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 

КонецПроцедуры


&НаСервере 
Функция ПолучитьДокументНаСервереВФоне()  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне    = ложь; 
	
	ПараметрыПроцедуры = Новый Структура; 
	ПараметрыПроцедуры.Вставить("ИННОрганизации",  СокрЛП(Организаия.ИНН)); 
	ПараметрыПроцедуры.Вставить("ИННRКонтрагента", СокрЛП(Контрагент.ИНН)); 
	
	Если ПараметрыПоиска = 0 Тогда
		ПараметрыПроцедуры.Вставить("ИдентификаторДокумента", XMLСтрока(ИдентификаторДокумента));   
	КонецЕсли;  
	
	Если ПараметрыПоиска = 1 Тогда
		ПараметрыСчета = Новый Структура;  
		ПараметрыСчета.Вставить("nomber",	XMLСтрока(НомерСчета));   
		ПараметрыСчета.Вставить("date",		XMLСтрока(ДатаСчета));   
		
		ПараметрыПроцедуры.Вставить("Счет",	ПараметрыСчета);   
	КонецЕсли; 
	
	Если ПараметрыПоиска = 2 Тогда
		ПараметрыАкта = Новый Структура;  
		ПараметрыАкта.Вставить("nomber",	XMLСтрока(НомерАкта));   
		ПараметрыАкта.Вставить("date",		XMLСтрока(ДатаАкта));   

		ПараметрыПроцедуры.Вставить("Акт",	ПараметрыАкта);   
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ЭлектронныйОбменДанными.ПолучитьДокументПоставщика",ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции

&НаКлиенте 
Процедура ПослеПолученияДанныхДокументаПоставщика(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда  
		
		ЗагруженныеДанные = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		ЭтаФорма.Закрыть(ЗагруженныеДанные);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информацию об ошибке см. в журнале регистрации!";
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка получения документов");  
		
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)  
	
	Если ПараметрыПоиска = 0 Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НомерАкта"));	 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаАкта"));	 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НомерСчета"));	 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаСчета"));	 
	КонецЕсли; 
	
	Если ПараметрыПоиска = 1 Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ИдентификаторДокумента"));	 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НомерАкта"));	 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаАкта"));	 
	КонецЕсли; 
	
	Если ПараметрыПоиска = 2 Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ИдентификаторДокумента"));	 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("НомерСчета"));	 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ДатаСчета"));	 		
	КонецЕсли;   
	
КонецПроцедуры

