&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = CW_Настройки.Пользователь();
	
	// --- 
	
	Список.Параметры.Элементы[0].Значение = Параметры.КлючОбъекта;
	Список.Параметры.Элементы[0].Использование = Истина;
	Список.Параметры.Элементы[1].Значение = Пользователь;
	Список.Параметры.Элементы[1].Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	// --- 
	
	Если _сф.стр_Сократить(ИмяНастройки) <> "" Тогда
		
		// создаем новую настройку
		ЭтаФорма.Закрыть(СоздатьНовуюНастройку());
		
	Иначе
		
		Если Элементы.Список.ТекущиеДанные <> Неопределено  Тогда
			
			// --- 
			
			ЭтаФорма.Закрыть(Элементы.Список.ТекущаяСтрока);
			
			// --- 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
	
КонецПроцедуры

&НаСервере
Функция СоздатьНовуюНастройку()
	
	НоваяНастройка = Справочники.CW_НастройкиПользователей.СоздатьЭлемент();
	НоваяНастройка.КлючОбъекта = Параметры.КлючОбъекта;
	НоваяНастройка.Наименование = ИмяНастройки;
	НоваяНастройка.Пользователь = Пользователь;
	НоваяНастройка.Записать();
	
	Возврат(НоваяНастройка.Ссылка);
	
КонецФункции

&НаКлиенте
Процедура Удалить(Команда)
	// --- 
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		
		// помечаем на удаление
		_УдалитьНастройку(Элементы.Список.ТекущаяСтрока);
		Элементы.Список.Обновить();

	КонецЕсли; 
		
	// --- 
КонецПроцедуры

&НаСервере
Процедура _УдалитьНастройку(Ссылка)
	// --- 
	
	Настройка = ССылка.ПолучитьОбъект();
	Настройка.УстановитьПометкуУдаления(Истина);
	
	// --- 
КонецПроцедуры
 
&НаКлиенте
Процедура Редактировать(Команда)
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Элементы.Список.ТекущаяСтрока));
		                                                                    		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
КонецПроцедуры


