
Функция ПолучитьРеестрПлатежей(ПланированиеДДС)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ ПЕРВЫЕ 1
	              |	CW_СтатьиПланированияПоРеестрам.Ссылка КАК Ссылка
	              |ИЗ
	              |	КритерийОтбора.CW_СтатьиПланированияПоРеестрам(&ПланированиеДДС) КАК CW_СтатьиПланированияПоРеестрам";
	
	Запрос.УстановитьПараметр("ПланированиеДДС", ПланированиеДДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Документ.CW_РеестрПлатежей.ПустаяСсылка");
	
КонецФункции