#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ВводНаОсновании") Тогда
			
			Дата 				=  ДанныеЗаполнения.ДатаДокумента;
			Организация 		=  ДанныеЗаполнения.Организация;
			Контрагент 			=  ДанныеЗаполнения.Контрагент;
			Договор 			=  ДанныеЗаполнения.Договор;
			ПриложениеКДоговору =  ДанныеЗаполнения.ПриложениеКДоговору;
			ПорядокЗаполнения 	= 4;
			
			СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
			СтруктураПараметров.Дата 				= Дата;
			СтруктураПараметров.Договор 			= Договор;
			СтруктураПараметров.ПриложениеКДоговору = ПриложениеКДоговору;
			
			СписокИменПараметров = 	"ПорядокПеревыставления;СчетНаПредоплату;ДатаПеревставления";
			СтруктураПараметровДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, СписокИменПараметров);
			
			ПорядокПеревыставления 	=  СтруктураПараметровДоговора.ПорядокПеревыставления;
			СчетНаПредоплату 		=  СтруктураПараметровДоговора.СчетНаПредоплату;
			ДатаПеревставления 		=  СтруктураПараметровДоговора.ДатаПеревставления;
			
			Если ДанныеЗаполнения.Свойство("ЗаполнитьТабличнуюЧасть") Тогда
				
				МассивОбъектов 		= Новый Массив;
				МассивОбъектов.Добавить(ДанныеЗаполнения.ДокументОснование);
				
				ВестиУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
			
				ПараметрыПроцедуры = Новый Структура;
				ПараметрыПроцедуры.Вставить("Объект", 		ЭтотОбъект);
				ПараметрыПроцедуры.Вставить("Дата", 		Дата);
				ПараметрыПроцедуры.Вставить("Организация", 	Организация);
				ПараметрыПроцедуры.Вставить("Контрагент", 	Контрагент);
				ПараметрыПроцедуры.Вставить("Договор", 		Договор);
				
				//Подсистема.УчетПриложенийДоговоров
				ПараметрыПроцедуры.Вставить("ПриложениеКДоговору", ПриложениеКДоговору);
				//Подсистема.УчетПриложенийДоговоров
				
				ПараметрыПроцедуры.Вставить("ВестиУчетПоПодразделениям", 	ВестиУчетПоПодразделениям);
				ПараметрыПроцедуры.Вставить("ПодразделениеОрганизации", 	ПодразделениеОрганизации);
				ПараметрыПроцедуры.Вставить("МассивОбъектов", 				МассивОбъектов);
				ПараметрыПроцедуры.Вставить("ОтборПоГрузоперевозкам", 		Ложь);
				
				АдресТаблицы = ПоместитьВоВременноеХранилище(Новый УникальныйИдентификатор);
				
				Документы.CW_ОтчетЭкспедитора.ЗаполнитьТабличнуюЧастьУслуги(ПараметрыПроцедуры, АдресТаблицы);
				
				Если ЭтоАдресВременногоХранилища(АдресТаблицы) Тогда
					ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресТаблицы);
					
					Услуги.Загрузить(ТаблицаДанных);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПометкаУдаления тогда
		
		СтруктураСвязанныеДокументы = Документы.CW_ОтчетЭкспедитора.ПолучитьСвязанныеДоходыПоГрузопереовзкам(Ссылка);
		ВсеСвязанныеДокументы		= СтруктураСвязанныеДокументы.ВсеДокументы;
	
		ПометитьНаУдалениеВсеСвязанныеДокументы(ВсеСвязанныеДокументы, Отказ);
	
	КонецЕсли;
	
	ЗаполнитьИтоговыеСуммыДокумента();

КонецПроцедуры

Процедура ПометитьНаУдалениеВсеСвязанныеДокументы(ВсеДокументы, Отказ)
	
	Для Каждого СвязанныйДокумент из ВсеДокументы Цикл
		
		//Обрабатываем документ
		Попытка
			ДокументОбъект = СвязанныйДокумент.ПолучитьОбъект();
			ДокументОбъект.УстановитьпометкуУдаления(Истина);
			
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст = "Помечен на удаление связанный документ: "+ СокрЛП(СвязанныйДокумент.ПредставлениеДокумента);
			Сообщение.Сообщить();
			
		Исключение
			
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось пометить на удаление связанный документ: "+ СокрЛП(СвязанныйДокумент.ПредставлениеДокумента);
			Сообщение.Сообщить();
			Отказ = истина;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ВремЗначениеОтбора 	= ОбъектКопирования.ЗначениеОтбора.Получить();
	АдресЗначенияОтбораПриКопировании =  ПоместитьВоВременноеХранилище(ВремЗначениеОтбора);
	
КонецПроцедуры

Процедура ЗаполнитьИтоговыеСуммыДокумента()

	ВсегоСуммаВсего = Услуги.Итог("Всего");
	ВсегоСуммаНДС 	= Услуги.Итог("СуммаНДС");
	ВсегоСумма	 	= Услуги.Итог("Сумма");

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = CW_Документы.ПрефиксОрганизации(Организация);

КонецПроцедуры

#КонецЕсли

