//CoralWay
//Для исподьзования дополнительных реквизитов тебуется установка расширения "AF_AddProp"
//CoralWay   

Функция ИспользуютсяДополниительныеРеквизиты() Экспорт  
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения");
	
КонецФункции

Функция ИспользуемыеМетаданныеAF_AddProp() Экспорт
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы.CW_ДоходыПоГрузоперевозке);
	МассивМетаданных.Добавить(Метаданные.Документы.CW_РасходыПоГрузоперевозке);
	МассивМетаданных.Добавить(Метаданные.Документы.CW_ДвижениеДенежныхСредств);
	МассивМетаданных.Добавить(Метаданные.Документы.CW_ОтчетЭкспедитора);
	МассивМетаданных.Добавить(Метаданные.Документы.CW_РеализацияПрочихТоваровУслуг);  
	МассивМетаданных.Добавить(Метаданные.Справочники.CW_ПланированиеДДС);  
	
	Возврат МассивМетаданных;
	
КонецФункции

Процедура УстановитьПрименениеДополнительныхРеквизитов() Экспорт 
	
	ПараметрыПроцедуры = Новый Структура;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ПараметрыПроцедуры);
	
	ФоновыеЗадания.Выполнить("CW_ДополнительныеРеквизитыСлужебный.ПрименениеДополнительныхРеквизитов", МассивПараметров);
	
КонецПроцедуры  

Процедура ПрименениеДополнительныхРеквизитов(ПараметрыПроцедуры, АдресРезультата = Неопределено) Экспорт
	
	//ДополнительныеРеквизиты
	ИспользуемыеМетадланные = ИспользуемыеМетаданныеAF_AddProp();
	Для Каждого МетаданныеМассива из ИспользуемыеМетадланные Цикл
		ДополнитьНаборДополнительныхСведений(МетаданныеМассива);
	КонецЦикла;
	//ДополнительныеРеквизиты
	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьНаборДополнительныхСведений(Метаданное) Экспорт
	
	ПолноеИмя 			= Метаданное.ПолноеИмя();
	МассивИмениФормы 	= СтрРазделить(ПолноеИмя, ".");
	ИмяЭлемента 		= МассивИмениФормы[0] + "_" + МассивИмениФормы[1];
	
	НаборСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоРеквизиту("ИмяПредопределенногоНабора", ИмяЭлемента);
	Если НаборСсылка.Пустая() Тогда
		НаборОбъект = Справочники.НаборыДополнительныхРеквизитовИСведений.СоздатьЭлемент();
	Иначе  
		НаборОбъект = НаборСсылка.ПолучитьОбъект();
		НаборОбъект.Представления.Очистить();
	КонецЕсли;
	
	НаборОбъект.ИмяПредопределенногоНабора 	= ИмяЭлемента;
	НаборОбъект.Наименование				= Метаданное.Синоним;
	НаборОбъект.Используется 				= Истина;
	НаборОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти