
&НаСервере
Процедура саб_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	НовыйЭлемент = Элементы.Добавить("СписокКонтейнеров", Тип("ПолеФормы"), Элементы.Список);
	НовыйЭлемент.ПутьКДанным = "Список.СписокКонтейнеров";
	НовыйЭлемент.Заголовок = "Список контейнеров";
	//
	НомерСимволаДляВставки = СтрНайти(ЭтаФорма.Список.ТекстЗапроса,"ВЫБРАТЬ"+Символы.ПС) + 6;	
	ЭтаФорма.Список.ТекстЗапроса = ВМС_ВставитьСтрокуВСтроку(ЭтаФорма.Список.ТекстЗапроса,Символы.ПС + "	ПоследняяДатаДоставкиНаСклад.ВМС_ДатаДоставкиНаСклад КАК ВМС_ДатаДоставкиНаСклад,",НомерСимволаДляВставки);	
	//НомерСимволаДляВставки = СтрНайти(ЭтаФорма.Список.ТекстЗапроса,"ВЫБРАТЬ"+Символы.ПС) + 6;	
	
	ТекстЗапросаЛевоеСоединение = "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследняяДатаДоставкиНаСклад КАК ПоследняяДатаДоставкиНаСклад
		|		ПО ДокументCW_ДоходыПоГрузоперевозке.Ссылка = ПоследняяДатаДоставкиНаСклад.Ссылка";
	
	ПозицияХарактеристики = СтрНайти(ЭтаФорма.Список.ТекстЗапроса,Символы.ПС+"{ХАРАКТЕРИСТИКИ"); 
	
	
	Если ПозицияХарактеристики <> 0 тогда                                                   
		ЭтаФорма.Список.ТекстЗапроса = Лев(ЭтаФорма.Список.ТекстЗапроса,ПозицияХарактеристики-1) + ТекстЗапросаЛевоеСоединение + Прав(ЭтаФорма.Список.ТекстЗапроса,СтрДлина(ЭтаФорма.Список.ТекстЗапроса) - ПозицияХарактеристики+1);
	Иначе 
		ЭтаФорма.Список.ТекстЗапроса = ЭтаФорма.Список.ТекстЗапроса + ТекстЗапросаЛевоеСоединение
	КонецЕсли;
	
	ЭтаФорма.Список.ТекстЗапроса = 	
	"ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫРАЗИТЬ(Т_ДатаДоставкиНаСклад.Значение КАК ДАТА)) КАК ВМС_ДатаДоставкиНаСклад
	|ПОМЕСТИТЬ ПоследняяДатаДоставкиНаСклад
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК Т_ДатаДоставкиНаСклад
	|		ПО CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка = Т_ДатаДоставкиНаСклад.Грузоперевозка
	|			И (Т_ДатаДоставкиНаСклад.Параметр = &ПВХ_ДатаДоставкиНаСклад)
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка;" + Символы.ПС + ЭтаФорма.Список.ТекстЗапроса;
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("ПВХ_ДатаДоставкиНаСклад",ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.НайтиПоКоду("000010043"));
	
	Элементы.Добавить("ВМС_ДатаДоставкиНаСклад", Тип("ПолеФормы"),Элементы.Список);  
	
	Элементы.ВМС_ДатаДоставкиНаСклад.ПутьКДанным = "Список.ВМС_ДатаДоставкиНаСклад";
	Элементы.ВМС_ДатаДоставкиНаСклад.Заголовок = "Дата доставки на склад";
	Элементы.ВМС_ДатаДоставкиНаСклад.Формат = "ДФ=dd.MM.yyyy";
	Элементы.ВМС_ДатаДоставкиНаСклад.Ширина = 8;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ВМС_ВставитьСтрокуВСтроку(Знач Текст, Знач СтрокаДляВставки, Знач НомерСимволаДляВставки)
	Возврат Лев(Текст,НомерСимволаДляВставки) + СтрокаДляВставки + Прав(Текст, СтрДлина(Текст)-НомерСимволаДляВставки);
КонецФункции
