#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПорядокОтраженияДоходов(ПорядокОтраженияЗатрат) Экспорт
	
	Если ПорядокОтраженияЗатрат = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление Тогда
		Возврат Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление;
	ИначеЕсли ПорядокОтраженияЗатрат = Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам  Тогда
		Возврат Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам ;
	ИначеЕсли  ПорядокОтраженияЗатрат = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда
		Возврат Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга ;
	КонецЕсли;
	
	Возврат Перечисления.CW_ПорядокОтраженияДоходов.ПустаяСсылка()
	
КонецФункции

#КонецЕсли