#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	// --- 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок",ВРег(МетаданныеОтчета.Синоним));
	// --- 
	ДокументСсылка = Настройки.Документ;
	МассивГП = _сф.м_СоздатьИзКолонкиТЗ(ДокументСсылка.Услуги.Выгрузить(,"Грузоперевозка"),"Грузоперевозка");
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Грузоперевозки",МассивГП);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Документ",ДокументСсылка);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Организация",ДокументСсылка.Организация);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Контрагент",ДокументСсылка.Контрагент);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Валюта",ДокументСсылка.Валюта);
	// --- 
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВерсияБюджета",?(Настройки["ВерсияБюджета"].Пустая(),Справочники.CW_ВерсииБюджетов.Основная,Настройки["ВерсияБюджета"]));
	
КонецПроцедуры
#КонецЕсли