#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ЗаписатьСтатусОбороудованияПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОтслеживаемоеОборудование.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ОтслеживаемоеОборудование КАК CW_ОтслеживаемоеОборудование";   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		спрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		спрОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры  


Процедура ЗавершитьСлежениеОборудования(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	Для Каждого ОтслеживаемоеОборудование из ПараметрыПроцедуры.ОтслеживаемоеОборудование Цикл
		
		Если ЗначениеЗаполнено(ОтслеживаемоеОборудование.ОкончаниеСлежения) Тогда
			Продолжить;
		КонецЕсли;
		
		ОтслеживаемоеОборудованиеОбъект = ОтслеживаемоеОборудование.ПолучитьОбъект();
		ОтслеживаемоеОборудованиеОбъект.ОкончаниеСлежения = ПараметрыПроцедуры.ОкончаниеСлежения;
		ОтслеживаемоеОборудованиеОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
#КонецЕсли
