#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		СформироватьНаименование();          
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСтатусПоУмолчанию();
	
КонецПроцедуры 

Процедура СформироватьНаименование() Экспорт 
	
	Наименование = Строка(Оборудование)+" ("+Строка(ВариантСлежения)+", "+Формат(НачалоСлежения,"ДЛФ=D")+")";
	
КонецПроцедуры

Процедура УстановитьСтатусПоУмолчанию()  
	
	СтатусПоУмолчанию = ВариантСлежения.ТипСлежения.СтатусОборудованияПоУмолчанию; //Наше любимое... получение заненачения через 300 точек  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатусыОборудованияНаСлеженииСрезПоследних.ОбъектСлежения КАК ОбъектСлежения,
	               |	CW_СтатусыОборудованияНаСлеженииСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.CW_СтатусыОборудованияНаСлежении.СрезПоследних(&НаДату, ОбъектСлежения = &ОбъектСлежения) КАК CW_СтатусыОборудованияНаСлеженииСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", 		НачалоСлежения);
	Запрос.УстановитьПараметр("ОбъектСлежения", Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда   
		ЗаписьРегистра = РегистрыСведений.CW_СтатусыОборудованияНаСлежении.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Период 			= НачалоСлежения;
		ЗаписьРегистра.ОбъектСлежения 	= Ссылка;
		ЗаписьРегистра.Статус 			= СтатусПоУмолчанию;
		ЗаписьРегистра.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
