
&НаСервере
Процедура VMS_УстановитьСхемуСтарое()

	Настройки = ПолучитьНастройки();
	СКД = Новый СхемаКомпоновкиДанных;

	ИД = СКД.ИсточникиДанных.Добавить();
	ИД.Имя = "ИсточникДанных";
	ИД.ТипИсточникаДанных = "Local";

	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "ВНД";
	НаборДанных.ИмяОбъекта = "ВНД";
	НаборДанных.ИсточникДанных = "ИсточникДанных";

	//-----------------------------------------------------------------------------------------------------------//	

	//Группировки
	НаборДанных.Поля.Очистить();

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Организация";
	НД_Поле.ПутьКДанным = "Организация";
	НД_Поле.Заголовок = "Организация";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	НД_Поле.Роль.Измерение = Истина;

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Контрагент";
	НД_Поле.ПутьКДанным = "Контрагент";
	НД_Поле.Заголовок = "Контрагент";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "МенеджерПродаж";
	НД_Поле.ПутьКДанным = "МенеджерПродаж";
	НД_Поле.Заголовок = "Менеджер продаж";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Договор";
	НД_Поле.ПутьКДанным = "Договор";
	НД_Поле.Заголовок = "Договор";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам");	

	//Подсистема.УчетПриложенийДоговоров
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ПриложениеКДоговору";
	НД_Поле.ПутьКДанным = "ПриложениеКДоговору";
	НД_Поле.Заголовок = "Приложение";
	НД_Поле.Роль.Измерение = Истина;
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ПриложенияКДоговорам");
	//Подсистема.УчетПриложенийДоговоров

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Валюта";
	НД_Поле.ПутьКДанным = "Валюта";
	НД_Поле.Заголовок = "Валюта";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Валюты");

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "СчетУчета";
	НД_Поле.ПутьКДанным = "СчетУчета";
	НД_Поле.Заголовок = "Счет учета";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");	

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ДокументВзаиморасчетов";
	НД_Поле.ПутьКДанным = "ДокументВзаиморасчетов";
	НД_Поле.Заголовок = "Документ взаиморасчетов";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("ДокументСсылка.CW_РасходыПоГрузоперевозке");
	НД_Поле.ВыражениеПредставления = "CW_Отчеты.ПредставлениеДокументовВзаиморасчетовДляОперативныхОтчетов(ДокументВзаиморасчетов,&ВыводитьГрузоперевозки,&ВыводитьЗаказы)";

	//Подсистема.СтатусыДокументов
	Если ВыводитьСтатусДокумента тогда
		НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НД_Поле.Поле = "СтатусДокумента";
		НД_Поле.ПутьКДанным = "СтатусДокумента";
		НД_Поле.Заголовок = "Статус";
		НД_Поле.Роль.Измерение = Истина;
		НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_СтатусыДокументов");
	КонецЕсли;
	//Подсистема.СтатусыДокументов

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ПланируемаяДатаОплаты";
	НД_Поле.ПутьКДанным = "ПланируемаяДатаОплаты";
	НД_Поле.Заголовок = "Планируемая дата оплаты";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Дата");

	// Реквизиты
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ВалОстаток";
	НД_Поле.ПутьКДанным = "ВалОстаток";
	НД_Поле.Заголовок = "Задолженность, Вал.";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Число");
	НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
	НД_Поле.ОграничениеИспользования.Группировка = Истина;
	НД_Поле.ОграничениеИспользования.Условие = Ложь;

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "РубОстаток";
	НД_Поле.ПутьКДанным = "РубОстаток";
	НД_Поле.Заголовок = "Задолженность, ВРУ."; 
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Число");
	НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
	НД_Поле.ОграничениеИспользования.Группировка = Истина;
	НД_Поле.ОграничениеИспользования.Условие = Ложь;

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "СрокОплаты";
	НД_Поле.ПутьКДанным = "СрокОплаты";
	НД_Поле.Заголовок = "Срок оплаты";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Дата");
	НД_Поле.ОграничениеИспользования.Группировка = Истина;

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ПериодЗадолженности";
	НД_Поле.ПутьКДанным = "ПериодЗадолженности";
	НД_Поле.Заголовок = "Период задолженности";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Число");
	НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=0;ЧН=");	
	НД_Поле.ОграничениеИспользования.Группировка = Истина;

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле 			= "ДатаВозвратаДокументов";
	НД_Поле.ПутьКДанным 	= "ДатаВозвратаДокументов";
	НД_Поле.Заголовок 		= "Дата возврата документов";
	НД_Поле.ОграничениеИспользования.Группировка 	= Истина;	
	НД_Поле.ОграничениеИспользования.Условие 		= Истина;	

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ПлановаяДатаОплаты";
	НД_Поле.ПутьКДанным = "ПлановаяДатаОплаты";
	НД_Поле.Заголовок = "Плановая дата оплаты";
	НД_Поле.ОграничениеИспользования.Группировка = Истина;
	НД_Поле.ОграничениеИспользования.Условие = Истина;

	//-----------------------------------------------------------------------------------------------------------//	
	// Вычисляемые поля (Периоды)
	СКД.ВычисляемыеПоля.Очистить();
	Если ПоПериодам И Периоды.Количество() > 0 Тогда
		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "ВалПериод0";
		Выч_Поле.Заголовок = "ВалПериод0";
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>0 Тогда Выбор Когда ВалОстаток > 0 Тогда ВалОстаток Иначе 0 Конец Иначе 0 Конец"; //ВалОстаток
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;

		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "РубПериод0";
		Выч_Поле.Заголовок = "РубПериод0";
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>0 Тогда Выбор Когда РубОстаток > 0 Тогда РубОстаток Иначе 0 Конец Иначе 0 Конец"; //РубОстаток
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;

		Ном = 1;
		Для Каждого Интервал из Периоды Цикл
			Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
			Выч_Поле.ПутьКДанным = "ВалПериод" + Ном;
			Выч_Поле.Заголовок = "ВалПериод" + Ном;
			Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>=" + Интервал.НачДень + " И ПериодЗадолженности<=" + Интервал.КонДень + " Тогда Выбор Когда ВалОстаток > 0 Тогда ВалОстаток Иначе 0 Конец Иначе 0 Конец";
			Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
			Выч_Поле.ОграничениеИспользования.Группировка = Истина;
			Выч_Поле.ОграничениеИспользования.Условие = Истина;

			Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
			Выч_Поле.ПутьКДанным = "РубПериод" + Ном;
			Выч_Поле.Заголовок = "РубПериод" + Ном;
			Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>=" + Интервал.НачДень + " И ПериодЗадолженности<=" + Интервал.КонДень + " Тогда Выбор Когда РубОстаток > 0 Тогда РубОстаток Иначе 0 Конец Иначе 0 Конец";
			Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
			Выч_Поле.ОграничениеИспользования.Группировка = Истина;
			Выч_Поле.ОграничениеИспользования.Условие = Истина;			

			Ном = Ном + 1;
		КонецЦикла;	
		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "ВалПериод" + Ном;
		Выч_Поле.Заголовок = "ВалПериод" + Ном;
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>" + Интервал.КонДень + " Тогда Выбор Когда ВалОстаток > 0 Тогда ВалОстаток Иначе 0 Конец Иначе 0 Конец";
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;

		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "РубПериод" + Ном;
		Выч_Поле.Заголовок = "РубПериод" + Ном;
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>" + Интервал.КонДень + " Тогда Выбор Когда РубОстаток > 0 Тогда РубОстаток Иначе 0 Конец Иначе 0 Конец";
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;			
	КонецЕсли; 

	//-----------------------------------------------------------------------------------------------------------//	

	//Ресурсы
	СКД.ПоляИтога.Очистить();

	//Поле_Ресурса = СКД.ПоляИтога.Добавить();
	//Поле_Ресурса.ПутьКДанным = "ВалОстаток";
	//Поле_Ресурса.Выражение = "ВалОстаток";
	//Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ВалОстаток";
	Поле_Ресурса.Выражение = "Сумма(ВалОстаток)";
	Поле_Ресурса.Группировки.Добавить("Валюта");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "РубОстаток";
	Поле_Ресурса.Выражение = "Сумма(РубОстаток)";

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "СрокОплаты";
	Поле_Ресурса.Выражение = "СрокОплаты";
	Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ПериодЗадолженности";
	Поле_Ресурса.Выражение = "МАКСИМУМ(ПериодЗадолженности)";
	//Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ВалОстаток";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "СрокОплаты";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ПериодЗадолженности";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

	Если ПоПериодам И Периоды.Количество() > 0 Тогда

		//Поле_Ресурса = СКД.ПоляИтога.Добавить();
		//Поле_Ресурса.ПутьКДанным = "ВалПериод0";
		//Поле_Ресурса.Выражение = "ВалПериод0";
		//Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод0";
		Поле_Ресурса.Выражение = "Сумма(ВалПериод0)";
		Поле_Ресурса.Группировки.Добавить("Валюта");

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод0";
		Поле_Ресурса.Выражение = """ Х """;
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод0";
		Поле_Ресурса.Выражение = "Сумма(РубПериод0)";

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод0";
		Поле_Ресурса.Выражение = "Сумма(РубПериод0)";
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

		Ном = 1;
		Для Каждого Интервал из Периоды Цикл

			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
			Поле_Ресурса.Выражение = "Сумма(ВалПериод" + Ном + ")";
			Поле_Ресурса.Группировки.Добавить("Валюта");

			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
			Поле_Ресурса.Выражение = """ Х """;
			Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
			Поле_Ресурса.Выражение = "Сумма(РубПериод" + Ном + ")";

			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
			Поле_Ресурса.Выражение = "Сумма(РубПериод" + Ном + ")";
			Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

			Ном = Ном + 1;

		КонецЦикла;

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
		Поле_Ресурса.Выражение = "Сумма(ВалПериод" + Ном + ")";
		Поле_Ресурса.Группировки.Добавить("Валюта");

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
		Поле_Ресурса.Выражение = """ Х """ + Ном;
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
		Поле_Ресурса.Выражение = "Сумма(РубПериод" + Ном + ")";

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
		Поле_Ресурса.Выражение = "Сумма(РубПериод" + Ном + ")";
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

	КонецЕсли;

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ПлановаяДатаОплаты";
	Поле_Ресурса.Выражение = "ПлановаяДатаОплаты";
	Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");	

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ПлановаяДатаОплаты";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");	

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ДатаВозвратаДокументов";
	Поле_Ресурса.Выражение = "ДатаВозвратаДокументов";
	Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ДатаВозвратаДокументов";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");
	

	//-----------------------------------------------------------------------------------------------------------//

	//Параметры
	СКД.Параметры.Очистить();

	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "Период";
	Пар.Заголовок = "На дату";
	Пар.ТипЗначения = Новый ОписаниеТипов("Дата");
	Пар.ВключатьВДоступныеПоля = Ложь;
	Пар.Значение = Ложь;

	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "ВыводитьГрузоперевозки";
	Пар.Заголовок = "Выводить грузоперевозки";
	Пар.ТипЗначения = Новый ОписаниеТипов("Булево");
	Пар.ВключатьВДоступныеПоля = Ложь;

	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "ВыводитьЗаказы";
	Пар.Заголовок = "Выводить заказы";
	Пар.ТипЗначения = Новый ОписаниеТипов("Булево");
	Пар.ВключатьВДоступныеПоля = Ложь;

	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "ОтборГрузоперевозок";
	Пар.Заголовок = "Отбор грузоперевозок";
	Пар.ТипЗначения = Новый ОписаниеТипов("Строка");
	Пар.ВключатьВДоступныеПоля = Ложь;

	Отчет.АдресСхемы = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);	

	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет.АдресСхемы));	

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьСхему")
Процедура саб_УстановитьСхему()

	Настройки = ПолучитьНастройки();
	СКД = Новый СхемаКомпоновкиДанных;

	ИД = СКД.ИсточникиДанных.Добавить();
	ИД.Имя = "ИсточникДанных";
	ИД.ТипИсточникаДанных = "Local";

	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "ВНД";
	НаборДанных.ИмяОбъекта = "ВНД";
	НаборДанных.ИсточникДанных = "ИсточникДанных";

	//-----------------------------------------------------------------------------------------------------------//	

	//Группировки
	НаборДанных.Поля.Очистить();

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Организация";
	НД_Поле.ПутьКДанным = "Организация";
	НД_Поле.Заголовок = "Организация";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	НД_Поле.Роль.Измерение = Истина;

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Контрагент";
	НД_Поле.ПутьКДанным = "Контрагент";
	НД_Поле.Заголовок = "Контрагент";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "МенеджерПродаж";
	НД_Поле.ПутьКДанным = "МенеджерПродаж";
	НД_Поле.Заголовок = "Менеджер продаж";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Договор";
	НД_Поле.ПутьКДанным = "Договор";
	НД_Поле.Заголовок = "Договор";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам");	

	//Подсистема.УчетПриложенийДоговоров
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ПриложениеКДоговору";
	НД_Поле.ПутьКДанным = "ПриложениеКДоговору";
	НД_Поле.Заголовок = "Приложение";
	НД_Поле.Роль.Измерение = Истина;
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ПриложенияКДоговорам");
	//Подсистема.УчетПриложенийДоговоров

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Валюта";
	НД_Поле.ПутьКДанным = "Валюта";
	НД_Поле.Заголовок = "Валюта";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Валюты");

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "СчетУчета";
	НД_Поле.ПутьКДанным = "СчетУчета";
	НД_Поле.Заголовок = "Счет учета";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");	

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ДокументВзаиморасчетов";
	НД_Поле.ПутьКДанным = "ДокументВзаиморасчетов";
	НД_Поле.Заголовок = "Документ взаиморасчетов";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("ДокументСсылка.CW_РасходыПоГрузоперевозке");
	НД_Поле.ВыражениеПредставления = "CW_Отчеты.ПредставлениеДокументовВзаиморасчетовДляОперативныхОтчетов(ДокументВзаиморасчетов,&ВыводитьГрузоперевозки,&ВыводитьЗаказы)";

	//Подсистема.СтатусыДокументов
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "СтатусДокумента";
	НД_Поле.ПутьКДанным = "СтатусДокумента";
	НД_Поле.Заголовок = "Статус";
	НД_Поле.Роль.Измерение = Истина;
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_СтатусыДокументов");
	//Подсистема.СтатусыДокументов

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ПланируемаяДатаОплаты";
	НД_Поле.ПутьКДанным = "ПланируемаяДатаОплаты";
	НД_Поле.Заголовок = "Планируемая дата оплаты";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Дата");

	// Реквизиты
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ВалОстаток";
	НД_Поле.ПутьКДанным = "ВалОстаток";
	НД_Поле.Заголовок = "Задолженность, Вал.";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Число");
	НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
	НД_Поле.ОграничениеИспользования.Группировка = Истина;
	НД_Поле.ОграничениеИспользования.Условие = Ложь;

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "РубОстаток";
	НД_Поле.ПутьКДанным = "РубОстаток";
	НД_Поле.Заголовок = "Задолженность, ВРУ."; 
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Число");
	НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
	НД_Поле.ОграничениеИспользования.Группировка = Истина;
	НД_Поле.ОграничениеИспользования.Условие = Ложь;

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "СрокОплаты";
	НД_Поле.ПутьКДанным = "СрокОплаты";
	НД_Поле.Заголовок = "Срок оплаты";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Дата");
	НД_Поле.ОграничениеИспользования.Группировка = Истина;

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ПериодЗадолженности";
	НД_Поле.ПутьКДанным = "ПериодЗадолженности";
	НД_Поле.Заголовок = "Период задолженности";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Число");
	НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=0; ЧН=; ЧГ=");	
	НД_Поле.ОграничениеИспользования.Группировка = Истина;

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле 			= "ДатаВозвратаДокументов";
	НД_Поле.ПутьКДанным 	= "ДатаВозвратаДокументов";
	НД_Поле.Заголовок 		= "Дата возврата (передачи) документов";
	НД_Поле.ОграничениеИспользования.Группировка 	= Истина;	
	НД_Поле.ОграничениеИспользования.Условие 		= Истина;	

	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ПлановаяДатаОплаты";
	НД_Поле.ПутьКДанным = "ПлановаяДатаОплаты";
	НД_Поле.Заголовок = "Плановая дата оплаты";
	НД_Поле.ОграничениеИспользования.Группировка = Истина;
	НД_Поле.ОграничениеИспользования.Условие = Истина;

	//-----------------------------------------------------------------------------------------------------------//	

	// Вычисляемые поля (Периоды)
	СКД.ВычисляемыеПоля.Очистить();
	Если ПоПериодам И Периоды.Количество() > 0 Тогда
		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "ВалПериод0";
		Выч_Поле.Заголовок = "ВалПериод0";
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>0 Тогда Выбор Когда ВалОстаток > 0 Тогда ВалОстаток Иначе 0 Конец Иначе 0 Конец"; //ВалОстаток
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;

		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "РубПериод0";
		Выч_Поле.Заголовок = "РубПериод0";
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>0 Тогда Выбор Когда РубОстаток > 0 Тогда РубОстаток Иначе 0 Конец Иначе 0 Конец"; //РубОстаток
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;

		Ном = 1;
		Для Каждого Интервал из Периоды Цикл
			Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
			Выч_Поле.ПутьКДанным = "ВалПериод" + Ном;
			Выч_Поле.Заголовок = "ВалПериод" + Ном;
			Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>=" + Интервал.НачДень + " И ПериодЗадолженности<=" + Интервал.КонДень + " Тогда Выбор Когда ВалОстаток > 0 Тогда ВалОстаток Иначе 0 Конец Иначе 0 Конец";
			Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
			Выч_Поле.ОграничениеИспользования.Группировка = Истина;
			Выч_Поле.ОграничениеИспользования.Условие = Истина;

			Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
			Выч_Поле.ПутьКДанным = "РубПериод" + Ном;
			Выч_Поле.Заголовок = "РубПериод" + Ном;
			Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>=" + Интервал.НачДень + " И ПериодЗадолженности<=" + Интервал.КонДень + " Тогда Выбор Когда РубОстаток > 0 Тогда РубОстаток Иначе 0 Конец Иначе 0 Конец";
			Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
			Выч_Поле.ОграничениеИспользования.Группировка = Истина;
			Выч_Поле.ОграничениеИспользования.Условие = Истина;			

			Ном = Ном + 1;
		КонецЦикла;	
		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "ВалПериод" + Ном;
		Выч_Поле.Заголовок = "ВалПериод" + Ном;
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>" + Интервал.КонДень + " Тогда Выбор Когда ВалОстаток > 0 Тогда ВалОстаток Иначе 0 Конец Иначе 0 Конец";
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;

		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "РубПериод" + Ном;
		Выч_Поле.Заголовок = "РубПериод" + Ном;
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>" + Интервал.КонДень + " Тогда Выбор Когда РубОстаток > 0 Тогда РубОстаток Иначе 0 Конец Иначе 0 Конец";
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;			
	КонецЕсли;
    #Вставка
	Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
	Выч_Поле.ПутьКДанным = "СтавкиНДС";
	Выч_Поле.Заголовок = "Ставка НДС";
	Выч_Поле.Выражение = "CW_Отчеты.ПредставлениеСтавокНДСДляОперативныхОтчетов(ДокументВзаиморасчетов)";
	Выч_Поле.ОграничениеИспользования.Группировка = Истина;
	Выч_Поле.ОграничениеИспользования.Условие = Истина;

	Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
	Выч_Поле.ПутьКДанным = "ОперативныеМенеджеры";
	Выч_Поле.Заголовок = "Оперативный менеджер";
	Выч_Поле.Выражение = "CW_Отчеты.ПредставлениеОперативныхМенеджеровДляОперативныхОтчетов(ДокументВзаиморасчетов)";
	Выч_Поле.ОграничениеИспользования.Группировка = Истина;
	Выч_Поле.ОграничениеИспользования.Условие = Истина;
	#КонецВставки
	//-----------------------------------------------------------------------------------------------------------//	

	//Ресурсы
	СКД.ПоляИтога.Очистить();

	//Поле_Ресурса = СКД.ПоляИтога.Добавить();
	//Поле_Ресурса.ПутьКДанным = "ВалОстаток";
	//Поле_Ресурса.Выражение = "ВалОстаток";
	//Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ВалОстаток";
	Поле_Ресурса.Выражение = "Сумма(ВалОстаток)";
	Поле_Ресурса.Группировки.Добавить("Валюта");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "РубОстаток";
	Поле_Ресурса.Выражение = "Сумма(РубОстаток)";

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "СрокОплаты";
	Поле_Ресурса.Выражение = "СрокОплаты";
	Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ПериодЗадолженности";
	Поле_Ресурса.Выражение = "МАКСИМУМ(ПериодЗадолженности)";
	//Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ВалОстаток";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "СрокОплаты";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ПериодЗадолженности";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

	Если ПоПериодам И Периоды.Количество() > 0 Тогда

		//Поле_Ресурса = СКД.ПоляИтога.Добавить();
		//Поле_Ресурса.ПутьКДанным = "ВалПериод0";
		//Поле_Ресурса.Выражение = "ВалПериод0";
		//Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод0";
		Поле_Ресурса.Выражение = "Сумма(ВалПериод0)";
		Поле_Ресурса.Группировки.Добавить("Валюта");

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод0";
		Поле_Ресурса.Выражение = """ Х """;
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод0";
		Поле_Ресурса.Выражение = "Сумма(РубПериод0)";

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод0";
		Поле_Ресурса.Выражение = "Сумма(РубПериод0)";
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

		Ном = 1;
		Для Каждого Интервал из Периоды Цикл

			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
			Поле_Ресурса.Выражение = "Сумма(ВалПериод" + Ном + ")";
			Поле_Ресурса.Группировки.Добавить("Валюта");

			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
			Поле_Ресурса.Выражение = """ Х """;
			Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
			Поле_Ресурса.Выражение = "Сумма(РубПериод" + Ном + ")";

			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
			Поле_Ресурса.Выражение = "Сумма(РубПериод" + Ном + ")";
			Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

			Ном = Ном + 1;

		КонецЦикла;

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
		Поле_Ресурса.Выражение = "Сумма(ВалПериод" + Ном + ")";
		Поле_Ресурса.Группировки.Добавить("Валюта");

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
		Поле_Ресурса.Выражение = """ Х """ + Ном;
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
		Поле_Ресурса.Выражение = "Сумма(РубПериод" + Ном + ")";

		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
		Поле_Ресурса.Выражение = "Сумма(РубПериод" + Ном + ")";
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

	КонецЕсли;

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ПлановаяДатаОплаты";
	Поле_Ресурса.Выражение = "ПлановаяДатаОплаты";
	Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");	

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ПлановаяДатаОплаты";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");	

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ДатаВозвратаДокументов";
	Поле_Ресурса.Выражение = "ДатаВозвратаДокументов";
	Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ДатаВозвратаДокументов";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

    #Вставка
	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "СтавкиНДС";
	Поле_Ресурса.Выражение = "СтавкиНДС";
	Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "СтавкиНДС";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ОперативныеМенеджеры";
	Поле_Ресурса.Выражение = "ОперативныеМенеджеры";
	Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");

	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ОперативныеМенеджеры";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

	#КонецВставки
	//-----------------------------------------------------------------------------------------------------------//

	//Параметры
	СКД.Параметры.Очистить();

	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "Период";
	Пар.Заголовок = "На дату";
	Пар.ТипЗначения = Новый ОписаниеТипов("Дата");
	Пар.ВключатьВДоступныеПоля = Ложь;
	Пар.Значение = Ложь;

	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "ВыводитьГрузоперевозки";
	Пар.Заголовок = "Выводить грузоперевозки";
	Пар.ТипЗначения = Новый ОписаниеТипов("Булево");
	Пар.ВключатьВДоступныеПоля = Ложь;

	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "ВыводитьЗаказы";
	Пар.Заголовок = "Выводить заказы";
	Пар.ТипЗначения = Новый ОписаниеТипов("Булево");
	Пар.ВключатьВДоступныеПоля = Ложь;

	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "ОтборГрузоперевозок";
	Пар.Заголовок = "Отбор грузоперевозок";
	Пар.ТипЗначения = Новый ОписаниеТипов("Строка");
	Пар.ВключатьВДоступныеПоля = Ложь;

	Отчет.АдресСхемы = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);	

	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет.АдресСхемы));	

КонецПроцедуры

//&НаСервере
//&ИзменениеИКонтроль("УстановитьНастройкиСКД")
//Функция VMS_УстановитьНастройкиСКД()

//	СКД = ПолучитьИзВременногоХранилища(Отчет.АдресСхемы);
//	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
//	НастройкиСКД = Компоновщик.Настройки;
//	Настройки = ПолучитьНастройки();

//	//-----------------------------------------------------------------------------------------------------------//

//	// формируем структуру отчета по группировкам
//	НастройкиСКД.Структура.Очистить();
//	ТекущийРодитель = НастройкиСКД.Структура;

//	Если ОбъединитьГруппировки Тогда   
//		//Добавляем пустую группировку
//		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));

//		Если (ДополнительнаяСортировка <> 0) Тогда

//			ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Убыв;
//			Если ПорядокСортировки = 1 тогда
//				ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Возр;
//			КонецЕсли;

//			ВП = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
//			ВП.Использование 		= Истина;
//			ВП.ТипУпорядочивания 	= ТипУпорядочивания;
//			Если (ДополнительнаяСортировка = 1) Тогда
//				ВП.Поле = Новый ПолеКомпоновкиДанных("РубОстаток");
//			ИначеЕсли (ДополнительнаяСортировка = 2) Тогда
//				ВП.Поле = Новый ПолеКомпоновкиДанных("ПериодЗадолженности");
//			Иначе
//				ВП.Поле = Новый ПолеКомпоновкиДанных("СрокОплаты");
//			КонецЕсли; 

//		КонецЕсли;

//	КонецЕсли;

//	Для Каждого Групп Из Настройки.Группировки Цикл

//		Если Не ОбъединитьГруппировки Тогда
//			НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
//			ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
//			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Групп.ИмяПоля);
//			ПолеГруппировки.Использование = Истина;
//			НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
//			НовоеАвтоПолеВыбора.Использование = Истина;
//			// --- 
//			// --- 
//			Если (ДополнительнаяСортировка <> 0) Тогда

//				ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Убыв;
//				Если ПорядокСортировки = 1 тогда
//					ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Возр;
//				КонецЕсли;

//				ВП = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
//				ВП.Использование 		= Истина;
//				ВП.ТипУпорядочивания 	= ТипУпорядочивания;
//				Если (ДополнительнаяСортировка = 1) Тогда
//					ВП.Поле = Новый ПолеКомпоновкиДанных("РубОстаток");
//				ИначеЕсли (ДополнительнаяСортировка = 2) Тогда
//					ВП.Поле = Новый ПолеКомпоновкиДанных("ПериодЗадолженности");
//				Иначе
//					ВП.Поле = Новый ПолеКомпоновкиДанных("СрокОплаты");
//				КонецЕсли; 

//			КонецЕсли;

//			ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
//			ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Групп.ИмяПоля);
//			НС = ?(Групп.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию,НаправлениеСортировкиКомпоновкиДанных.Возр,НаправлениеСортировкиКомпоновкиДанных.Убыв);
//			ЭлементПорядка.ТипУпорядочивания = НС;
//			ЭлементПорядка.Использование = Истина;
//			НоваяГруппировка.Имя = Групп.Представление;
//			НоваяГруппировка.Использование = Истина;
//			ТекущийРодитель = НоваяГруппировка.Структура;
//		Иначе
//			//Заполняем группировку полями группирвоки
//			ПолеГруппировки 				= НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
//			ПолеГруппировки.Поле 			= Новый ПолеКомпоновкиДанных(Групп.ИмяПоля);
//			ПолеГруппировки.Использование 	= Истина;

//			НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
//			НовоеАвтоПолеВыбора.Использование	= Истина;

//			ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
//			ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Групп.ИмяПоля);

//			НС = ?(Групп.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию, НаправлениеСортировкиКомпоновкиДанных.Возр, НаправлениеСортировкиКомпоновкиДанных.Убыв);

//			ЭлементПорядка.ТипУпорядочивания = НС;
//			ЭлементПорядка.Использование = Истина;

//		КонецЕсли;

//	КонецЦикла; 


//	Если Не ОбъединитьГруппировки Тогда
//		// Предопределенная группировка "ДокументВзаиморасчетов"
//		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
//		НоваяГруппировка.Использование = Истина;

//		ПолеГруппировки	= НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
//		ПолеГруппировки.Использование 		= Истина;
//		ПолеГруппировки.Поле 				= Новый ПолеКомпоновкиДанных("ДокументВзаиморасчетов");

//		НовоеАвтоПолеВыбора	= НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
//		НовоеАвтоПолеВыбора.Использование 	= Истина;

//		//Подсистема.СтатусыДокументов
//		Если ВыводитьСтатусДокумента Тогда
//			ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
//			ПолеГруппировки.Использование 	= Истина;
//			ПолеГруппировки.Поле 			= Новый ПолеКомпоновкиДанных("СтатусДокумента");

//			НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
//			НовоеАвтоПолеВыбора.Использование = Истина;
//		КонецЕсли;
//		//Подсистема.СтатусыДокументов

//		// --- 
//		Если (ДополнительнаяСортировка <> 0) Тогда
//			ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Убыв;
//			Если ПорядокСортировки = 1 тогда
//				ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Возр;
//			КонецЕсли;

//			ВП = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
//			ВП.Использование 		= Истина;
//			ВП.ТипУпорядочивания	= ТипУпорядочивания;
//			Если (ДополнительнаяСортировка = 1) Тогда
//				ВП.Поле = Новый ПолеКомпоновкиДанных("РубОстаток");
//			ИначеЕсли (ДополнительнаяСортировка = 2) Тогда
//				ВП.Поле = Новый ПолеКомпоновкиДанных("ПериодЗадолженности");
//			Иначе
//				ВП.Поле = Новый ПолеКомпоновкиДанных("СрокОплаты");
//			КонецЕсли; 

//		КонецЕсли;
//		// --- 
//		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
//		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ДокументВзаиморасчетов");
//		ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
//		ЭлементПорядка.Использование = Истина;
//		НоваяГруппировка.Имя = "Документ взаиморасчетов";
//		НоваяГруппировка.Использование = Истина;

//	Иначе
//		//Заполняем группировку полями группирвоки
//		ПолеГруппировки 				= НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
//		ПолеГруппировки.Поле 			= Новый ПолеКомпоновкиДанных("ДокументВзаиморасчетов");
//		ПолеГруппировки.Использование 	= Истина;

//		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
//		НовоеАвтоПолеВыбора.Использование	= Истина;

//		//Подсистема.СтатусыДокументов
//		Если ВыводитьСтатусДокумента Тогда
//			ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
//			ПолеГруппировки.Использование = Истина;
//			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("СтатусДокумента");

//			НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
//			НовоеАвтоПолеВыбора.Использование = Истина;
//		КонецЕсли;
//		//Подсистема.СтатусыДокументов

//		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
//		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ДокументВзаиморасчетов");

//	КонецЕсли;

//	//-----------------------------------------------------------------------------------------------------------//

//	НастройкиСКД.Выбор.Элементы.Очистить();

//	ГруппаВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
//	ГруппаВП.Использование = Истина;
//	ГруппаВП.Заголовок = "Задолженность";	
//	ВП = ГруппаВП.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//	ВП.Использование = Валюта;
//	ВП.Заголовок = "ВалОстаток";
//	ВП.Поле = Новый ПолеКомпоновкиДанных("ВалОстаток");
//	ВП = ГруппаВП.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//	ВП.Использование = Рубли;
//	ВП.Заголовок = "РубОстаток";
//	ВП.Поле = Новый ПолеКомпоновкиДанных("РубОстаток");

//	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//	ВП.Использование = Истина;
//	ВП.Заголовок = "Срок оплаты";
//	ВП.Поле = Новый ПолеКомпоновкиДанных("СрокОплаты");

//	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//	ВП.Использование = Истина;
//	ВП.Заголовок = "Период задолженности";
//	ВП.Поле = Новый ПолеКомпоновкиДанных("ПериодЗадолженности");

//	Если ПоПериодам И Периоды.Количество() > 0 Тогда
//		ГруппаВП0 = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
//		ГруппаВП0.Использование = Истина;
//		ГруппаВП0.Заголовок = "Просроченная задолженность";

//		ГруппаВсего = ГруппаВП0.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
//		ГруппаВсего.Использование = Истина;
//		ГруппаВсего.Заголовок = "Всего";

//		ВП = ГруппаВсего.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//		ВП.Использование = Валюта;
//		ВП.Заголовок = "ВалПериод0";
//		ВП.Поле = Новый ПолеКомпоновкиДанных("ВалПериод0");

//		ВП = ГруппаВсего.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//		ВП.Использование = Рубли;
//		ВП.Заголовок = "РубПериод0";
//		ВП.Поле = Новый ПолеКомпоновкиДанных("РубПериод0");

//		Ном = 1;
//		Для Каждого Интервал из Периоды Цикл
//			ГруппаПериода = ГруппаВП0.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
//			ГруппаПериода.Использование = Истина;
//			ГруппаПериода.Заголовок = Интервал.Представление;

//			ВП = ГруппаПериода.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//			ВП.Использование = Валюта;
//			ВП.Заголовок = "ВалПериод" + Ном;
//			ВП.Поле = Новый ПолеКомпоновкиДанных("ВалПериод" + Ном);

//			ВП = ГруппаПериода.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//			ВП.Использование = Рубли;
//			ВП.Заголовок = "РубПериод" + Ном;
//			ВП.Поле = Новый ПолеКомпоновкиДанных("РубПериод" + Ном);

//			Ном = Ном + 1;	
//		КонецЦикла;	
//		ГруппаПериода = ГруппаВП0.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
//		ГруппаПериода.Использование = Истина;
//		ГруппаПериода.Заголовок = "Свыше " + Интервал.КонДень + " дней";

//		ВП = ГруппаПериода.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//		ВП.Использование = Валюта;
//		ВП.Заголовок = "ВалПериод" + Ном;
//		ВП.Поле = Новый ПолеКомпоновкиДанных("ВалПериод" + Ном);

//		ВП = ГруппаПериода.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//		ВП.Использование = Рубли;
//		ВП.Заголовок = "РубПериод" + Ном;
//		ВП.Поле = Новый ПолеКомпоновкиДанных("РубПериод" + Ном);
//	КонецЕсли;

//	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//	ВП.Использование = ПланОплаты;
//	ВП.Заголовок = "Плановая дата оплаты";
//	ВП.Поле = Новый ПолеКомпоновкиДанных("ПлановаяДатаОплаты");

//	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//	ВП.Использование = ДатаВозвратаДокументов;
//	ВП.Заголовок = "Дата возврата документов";
//	ВП.Поле = Новый ПолеКомпоновкиДанных("ДатаВозвратаДокументов");  
//	
//	#Вставка
//	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//	ВП.Использование = Истина;
//	ВП.Заголовок = "Ставка НДС";
//	ВП.Поле = Новый ПолеКомпоновкиДанных("СтавкиНДС");

//	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
//	ВП.Использование = Истина;
//	ВП.Заголовок = "Оперативный менеджер";
//	ВП.Поле = Новый ПолеКомпоновкиДанных("ОперативныеМенеджеры");
//	#КонецВставки

//	//-----------------------------------------------------------------------------------------------------------//

//	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Период", КонецДня(Настройки.НаДату));
//	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьГрузоперевозки", Настройки.ВыводитьГрузоперевозки);
//	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьЗаказы", Настройки.ВыводитьЗаказы);	
//	Если (ОтборПоГрузоперевозкам) Тогда
//		ОтборПоГрузоперевозкамПредставление = Строка(ОтборГП_КомпоновщикНастроек.Настройки.Отбор);
//	Иначе
//		ОтборПоГрузоперевозкамПредставление = "<не установлен>";
//	КонецЕсли; 
//	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ОтборГрузоперевозок", ОтборПоГрузоперевозкамПредставление);

//	//-----------------------------------------------------------------------------------------------------------//

//	НастройкиСКД.УсловноеОформление.Элементы.Очистить();
//	ЭлУО = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
//	ЭлУО.Использование = Истина;
//	ЭлПоле = ЭлУО.Поля.Элементы.Добавить();
//	ЭлПоле.Использование = Истина;
//	ЭлПоле.Поле = Новый ПолеКомпоновкиДанных("СрокОплаты");
//	ЭлПоле = ЭлУО.Поля.Элементы.Добавить();
//	ЭлПоле.Использование = Истина;
//	ЭлПоле.Поле = Новый ПолеКомпоновкиДанных("ПлановаяДатаОплаты");
//	ЭлУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
//	ЭлУО.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=Д");	

//	ЭлУО = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
//	ЭлУО.Использование = Истина;
//	ЭлПоле = ЭлУО.Поля.Элементы.Добавить();
//	ЭлПоле.Использование = Истина;
//	ЭлПоле.Поле = Новый ПолеКомпоновкиДанных("ДатаВозвратаДокументов");
//	ЭлПоле = ЭлУО.Поля.Элементы.Добавить();
//	ЭлПоле.Использование = Истина;
//	ЭлПоле.Поле = Новый ПолеКомпоновкиДанных("ДатаВозвратаДокументов");
//	ЭлУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
//	ЭлУО.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=Д");	

//	Если (ПланОплаты И ПланОплатыВыделятьПросрочку) Тогда

//		УО = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
//		УО.Использование = Истина;
//		// --- 
//		УО_Поле = УО.Поля.Элементы.Добавить();
//		УО_Поле.Использование=Истина;
//		УО_Поле.Поле = Новый ПолеКомпоновкиДанных("ПлановаяДатаОплаты");
//		// --- 
//		УО_Условие = УО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//		УО_Условие.Использование = Истина;
//		УО_Условие.ЛевоеЗначение = УО_Поле.Поле;
//		УО_Условие.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
//		УО_Условие.ПравоеЗначение = НаДату;
//		// --- 
//		УО.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.СветлоРозовый);
//		//	УО.Оформление.УстановитьЗначениеПараметра("СтильГраницы",Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2,Ложь));

//	КонецЕсли; 

//	// --- 
//	ЭлУО = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
//	ЭлУО.Использование = Истина;
//	ЭлПоле = ЭлУО.Поля.Элементы.Добавить();
//	ЭлПоле.Использование = Истина;
//	ЭлПоле.Поле = Новый ПолеКомпоновкиДанных("ПериодЗадолженности");
//	ЭлУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);

//	//-----------------------------------------------------------------------------------------------------------//

//	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("МакетОформления"	, "CW_ОсновнойМакетСКД");
//	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок"		, "ОПЕРАТИВНАЯ ЗАДОЛЖЕННОСТЬ ПЕРЕД ПОСТАВЩИКАМИ");
//	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьЗаголовок", Истина);

//	//-----------------------------------------------------------------------------------------------------------//

//	//Для Каждого СтрОтб из НастройкиСКД.Отбор.Элементы Цикл
//	//	Если СтрОтб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПланируемаяДатаОплаты")	Тогда
//	//		СтрОтб.ПравоеЗначение = Дата(СтрОтб.ПравоеЗначение);
//	//	КонецЕсли;	
//	//КонецЦикла;	

//	Возврат НастройкиСКД;

//КонецФункции
