
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СсылкаОбъекта = ПараметрКоманды;
	Если (ТипЗнч(СсылкаОбъекта)=Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет")
		ИЛИ ТипЗнч(СсылкаОбъекта)=Тип("ДокументСсылка.СписаниеСРасчетногоСчета")) Тогда
		ВедущийДокумент = ПолучитьВедущийДокумент_Оплата(СсылкаОбъекта);
	ИначеЕсли (ТипЗнч(СсылкаОбъекта)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг")) Тогда 
		 ВедущийДокумент = ПолучитьВедущийДокументРасходыПоГрузперевозке(СсылкаОбъекта);
	ИначеЕсли (ТипЗнч(СсылкаОбъекта)=Тип("ДокументСсылка.КорректировкаПоступления")) Тогда 
		 ВедущийДокумент = ПолучитьВедущийДокументРасходыПоГрузперевозкеКорректировка(СсылкаОбъекта);
	ИначеЕсли (ТипЗнч(СсылкаОбъекта)=Тип("ДокументСсылка.РеализацияТоваровУслуг")) Тогда 
		 ВедущийДокумент = ПолучитьВедущийДокументДоходыПоГрузперевозке(СсылкаОбъекта);
	ИначеЕсли (ТипЗнч(СсылкаОбъекта)=Тип("ДокументСсылка.КорректировкаРеализации")) Тогда 
		 ВедущийДокумент = ПолучитьВедущийДокументДоходыПоГрузперевозкеКорректировка(СсылкаОбъекта);
	ИначеЕсли (ТипЗнч(СсылкаОбъекта)=Тип("ДокументСсылка.СчетНаОплатуПокупателю")) Тогда 
		 ВедущийДокумент = ПолучитьВедущийДокументДоходыПоГрузперевозкеСчет(СсылкаОбъекта);
	ИначеЕсли (ТипЗнч(СсылкаОбъекта)=Тип("ДокументСсылка.СчетНаОплатуПоставщика")) Тогда 
		 ВедущийДокумент = ПолучитьВедущийДокументРасходыПоГрузперевозкеСчет(СсылкаОбъекта);
	 КонецЕсли; 
	 
	 Если ВедущийДокумент = Неопределено Тогда
		 ПоказатьПредупреждение(,"Связанных документов не найдено"); 
	 Иначе
		 ПоказатьЗначение(,ВедущийДокумент);
	 КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВедущийДокумент_Оплата(СсылкаОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_Оплата.Ссылка
	|ИЗ
	|	Документ.CW_Оплата КАК CW_Оплата
	|ГДЕ
	|	CW_Оплата.Основание = &Основание";

	Запрос.УстановитьПараметр("Основание", СсылкаОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции


&НаСервере
Функция ПолучитьВедущийДокументРасходыПоГрузперевозке(СсылкаОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_РасходыПоГрузоперевозке.Ссылка
	|ИЗ
	|	Документ.CW_РасходыПоГрузоперевозке КАК CW_РасходыПоГрузоперевозке
	|ГДЕ
	|	CW_РасходыПоГрузоперевозке.ВедомыйДокумент = &ВедомыйДокумент";

	Запрос.УстановитьПараметр("ВедомыйДокумент", СсылкаОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

&НаСервере
Функция ПолучитьВедущийДокументРасходыПоГрузперевозкеКорректировка(СсылкаОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_РасходыПоГрузоперевозке.Ссылка
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке КАК CW_РасходыПоГрузоперевозке
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозке.ВедомыйДокументКорректировки = &ВедомыйДокумент";

	Запрос.УстановитьПараметр("ВедомыйДокумент", СсылкаОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьВедущийДокументРасходыПоГрузперевозкеСчет(СсылкаОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_РасходыПоГрузоперевозке.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке КАК CW_РасходыПоГрузоперевозке
	               |ГДЕ
	               |	(CW_РасходыПоГрузоперевозке.ВедомыйСчет = &ВедомыйДокумент
	               |			ИЛИ CW_РасходыПоГрузоперевозке.ВедомыйСчетКорректировочный = &ВедомыйДокумент)";  
	
	Запрос.УстановитьПараметр("ВедомыйДокумент", СсылкаОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


&НаСервере
Функция ПолучитьВедущийДокументДоходыПоГрузперевозке(СсылкаОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ДоходыПоГрузоперевозке.Ссылка
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозке.ВедомыйДокумент = &ВедомыйДокумент"; 

	Запрос.УстановитьПараметр("ВедомыйДокумент", СсылкаОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ЗакрытиеГрузоперевозки.Ссылка
	|ИЗ
	|	Документ.CW_ЗакрытиеГрузоперевозки КАК CW_ЗакрытиеГрузоперевозки
	|ГДЕ
	|	CW_ЗакрытиеГрузоперевозки.ВедомыйДокумент = &ВедомыйДокумент";    
	
	Запрос.УстановитьПараметр("ВедомыйДокумент", СсылкаОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьВедущийДокументДоходыПоГрузперевозкеКорректировка(СсылкаОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ДоходыПоГрузоперевозке.Ссылка
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозке.ВедомыйДокументКорректировки = &ВедомыйДокумент";

	Запрос.УстановитьПараметр("ВедомыйДокумент", СсылкаОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Неопределено;
	
	
КонецФункции

&НаСервере
Функция ПолучитьВедущийДокументДоходыПоГрузперевозкеСчет(СсылкаОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ДоходыПоГрузоперевозке.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	               |ГДЕ
	               |	(CW_ДоходыПоГрузоперевозке.ВедомыйСчет = &ВедомыйДокумент
	               |			ИЛИ CW_ДоходыПоГрузоперевозке.ВедомыйСчетКорректировочный = &ВедомыйДокумент)";

	Запрос.УстановитьПараметр("ВедомыйДокумент", СсылкаОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции  


 
