#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьОбъектНаСогласование(ОбъектСогласования, мДанныеДляЗаписи = Неопределено) Экспорт
	
	Набор = РегистрыСведений.CW_ОбъектыНаСогласовании.СоздатьНаборЗаписей();
	Набор.Отбор.ОбъектСогласования.Установить(ОбъектСогласования);
	Набор.Прочитать();
	Набор.Очистить();
	
	Если мДанныеДляЗаписи <> Неопределено Тогда
		Для Каждого ЭлементМассива из мДанныеДляЗаписи Цикл
			ЗаписьНабора = Набор.Добавить();
			ЗаписьНабора.ОбъектСогласования 		= ОбъектСогласования;
			
			ЗаписьНабора.ГруппаСогласования 		= ЭлементМассива.ГруппаСогласования;
			ЗаписьНабора.Пользователь 				= ЭлементМассива.Пользователь;
			ЗаписьНабора.ЭтапСогласования 			= ЭлементМассива.ЭтапСогласования;
			
			ЗаписьНабора.ВидОбъекта 				= ПолучитьВидОбъекта(ОбъектСогласования);
			ЗаписьНабора.ДатаНачала 				= ЭлементМассива.ДатаНачала;
			ЗаписьНабора.ДатаПланЗавершения 		= ЭлементМассива.ДатаПланЗавершения;
			ЗаписьНабора.ПорядокСогласования 		= ЭлементМассива.ПорядокСогласования;
			ЗаписьНабора.Комментарий 				= ЭлементМассива.Комментарий;
			
		КонецЦикла;
	КонецЕсли;
	
	Набор.Отбор.ОбъектСогласования.Установить(ОбъектСогласования);
	Набор.Записать();
	
КонецПроцедуры

Функция ПолучитьВидОбъекта(ОбъектСогласования)
	
	Возврат ОбъектСогласования.Метаданные().Синоним;
	
КонецФункции

Процедура ОчиститьДанныеРегистра(ОбъектСогласования) Экспорт
	
	Набор = РегистрыСведений.CW_ОбъектыНаСогласовании.СоздатьНаборЗаписей();
	Набор.Отбор.ОбъектСогласования.Установить(ОбъектСогласования);
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать();
	
КонецПроцедуры

#КонецЕсли