
&НаКлиенте
Процедура Подбор(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимВыбора", Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗаполнениеСписка", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора",СтруктураПараметров, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеСписка(РезультатВыбора, Дополнительныепараметры) Экспорт
	
	Если РезультатВыбора = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьЗаполнениеСпискаНаСерере(РезультатВыбора);
	
КонецПроцедуры

&наСервере
Процедура ПродолжитьЗаполнениеСпискаНаСерере(мПользователи)
	
	Для Каждого Пользователь из мПользователи Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Пользователь",Пользователь);
		
		мСтроки	= Объект.СписокСотрудников.НайтиСтроки(ПараметрыОтбора);
		
		Если мСтроки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.СписокСотрудников.Добавить();
		НоваяСтрока.Пользователь = Пользователь;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВводаСтроки(Должность, мВыделенныеСтроки) Экспорт
	Если Должность = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДолжностьНаСервере(мВыделенныеСтроки, Должность);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДолжностьНаСервере(мВыделенныеСтроки, Должность)
	
	Для Каждого ИдентификаторСтроки из мВыделенныеСтроки Цикл
		
		СтрокаТекущая = Объект.СписокСотрудников.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаТекущая.Должность = Должность

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДолжность(Команда)
	
	мВыделенныеСтроки = Элементы.СписокСотрудников.ВыделенныеСтроки;
	Если мВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Подсказка = "Введите должность";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект, мВыделенныеСтроки);
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Ложь);	
	
КонецПроцедуры
