#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьДанныеСтатусаДокумента(Объект) Экспорт
	
	Результат = Новый Структура("СтатусДокумента,Комментарий, Автор", Неопределено, Неопределено, Неопределено); 

	Если Не ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов") Тогда
		 Возврат Результат;
	КонецЕсли;
	
	Если Не Справочники.CW_НазначенияСтатусов.ОбъектИспользуетсяВСистемеСтатусов(ТипЗнч(Объект)) Тогда
		 Возврат Результат;
	КонецЕсли;

	Результат.СтатусДокумента 	= ПредопределенноеЗначение("Справочник.CW_СтатусыДокументов.ПустаяСсылка"); 
	Результат.Автор 			= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатусыДокументовСрезПоследних.Документ КАК Документ,
	               |	CW_СтатусыДокументовСрезПоследних.СтатусДокумента КАК СтатусДокумента,
	               |	CW_СтатусыДокументовСрезПоследних.Комментарий КАК Комментарий,
	               |	CW_СтатусыДокументовСрезПоследних.Автор КАК Автор
	               |ИЗ
	               |	РегистрСведений.CW_СтатусыДокументов.СрезПоследних(, Документ = &Документ) КАК CW_СтатусыДокументовСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", Объект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьЗаписьВРегистр(ДанныеДляЗаписи) Экспорт
	
	ТекущийСтатус = ПолучитьДанныеСтатусаДокумента(ДанныеДляЗаписи.Документ);
	
	Если ТекущийСтатус.СтатусДокумента <> ДанныеДляЗаписи.СтатусДокумента Тогда
		
		ЗаписьРегистра = РегистрыСведений.CW_СтатусыДокументов.СоздатьМенеджерЗаписи();
		
		Период = Неопределено;
		Если ДанныеДляЗаписи.Свойство("Период") Тогда
			Период = ДанныеДляЗаписи.Период;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Период) Тогда
			Период = ТекущаяДата();
		КонецЕсли;
		
		ЗаписьРегистра.Период = Период;
		
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ДанныеДляЗаписи);
		
		ЗаписьРегистра.Записать(Истина);
		СтатусУстановлен = Истина;
	
	КонецЕсли;  
	
КонецПроцедуры

Процедура ОбновитьКомментарийЗаписиСтатуса(КлючЗаписи, Комментарий) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.CW_СтатусыДокументов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра, КлючЗаписи);
	ЗаписьРегистра.Прочитать();
	
	Если ЗаписьРегистра.Выбран() Тогда
		ЗаписьРегистра.Комментарий = Комментарий;
		ЗаписьРегистра.Записать(Истина);
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьКлючПоследнейЗаписи(Документ) Экспорт
	
	Результат = Новый Структура("Период,Документ",Неопределено,Неопределено);
	
	Запрос = Новый ЗАпрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатусыДокументовСрезПоследних.Период КАК Период,
	               |	CW_СтатусыДокументовСрезПоследних.Документ КАК Документ
	               |ИЗ
	               |	РегистрСведений.CW_СтатусыДокументов.СрезПоследних КАК CW_СтатусыДокументовСрезПоследних
	               |ГДЕ
	               |	CW_СтатусыДокументовСрезПоследних.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ",Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
	
КонецФункции

#КонецЕсли