&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Параметры.Свойство("ОбъектПечати", ОбъектПечати);         
	
	ТипЗначенияОбъекта = ТипЗнч(ОбъектПечати.ЗначениеПустойСсылки);                                                                
	
	Схема 		= CW_ШаблоныДокументовСерверВызовСервера.ПолучитьСхемуКомпоновкиДанных(ТипЗначенияОбъекта);
	АдресСхемы 	= ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор);

	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);

	Ограничение = Элементы.ВыборДоступныеПоляВыбора.ОграниченияИспользования.Добавить();	
	Ограничение.Поле = Новый ПолеКомпоновкиДанных("СистемныеПоля");
	Ограничение.Доступность = Ложь;  
	
КонецПроцедуры    

&НаКлиенте
Процедура ВыборДоступныеПоляВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборПользователя(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда) 
	
	ВыбраннаяСтрока = Элементы.ВыборДоступныеПоляВыбора.ТекущаяСтрока;
	ОбработатьВыборПользователя(ВыбраннаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПользователя(Знач ВыбраннаяСтрока)
	
	ЭтаФорма.Закрыть(СокрЛП(ВыбраннаяСтрока));

КонецПроцедуры   



