
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	мАктивныеПользователи = Справочники.CW_ВебПользователиЛКК.ПолучитьМассивИдентификаторовАктивныхПользователей();
	
	Запрос = новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	CW_ПользователиВебПрофилей.Раздел КАК Раздел,
	              |	CW_ПользователиВебПрофилей.Пользователь КАК Пользователь,
	              |	ВЫБОР
	              |		КОГДА CW_ПользователиВебПрофилей.Пользователь.ИдентифкаторПользователя В (&мАктивныеПользователи)
	              |			ТОГДА ИСТИНА
	              |		ИНАЧЕ ЛОЖЬ
	              |	КОНЕЦ КАК Активный,
	              |	CW_ПользователиВебПрофилей.Пользователь КАК Количество,
	              |	ВЫБОР
	              |		КОГДА CW_ПользователиВебПрофилей.Пользователь.ИдентифкаторПользователя В (&мАктивныеПользователи)
	              |			ТОГДА CW_ПользователиВебПрофилей.Пользователь
	              |		ИНАЧЕ NULL
	              |	КОНЕЦ КАК КоличествоАктивных
	              |ИЗ
	              |	РегистрСведений.CW_ПользователиВебПрофилей КАК CW_ПользователиВебПрофилей
	              |ГДЕ
	              |	CW_ПользователиВебПрофилей.Пользователь.ИдентифкаторПользователя <> """"";
	
	Запрос.УстановитьПараметр("мАктивныеПользователи", мАктивныеПользователи);
	
	РезультатЗапроса = Запрос.Выполнить();
				  
	НаборыДанных 	= Новый Структура("НаборДанных", РезультатЗапроса.Выгрузить());
	СКД 			= СхемаКомпоновкиДанных;
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(СКД, СКД.НастройкиПоУмолчанию);
	ПроцессорКомпДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпДанных.Инициализировать(МакетКомпоновки, НаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпДанных, Истина);

КонецПроцедуры
