
&НаКлиенте
Процедура КомандаВыполнитьПересчет(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьРасчетСтатусов", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Будет выполнен пересчет логистических статусов грузоперевозок. Продолжить?",Режим, 0, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте 
Процедура ПродолжитьРасчетСтатусов(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет или Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьПересчетСтатусовНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПересчетаСтатусов", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры


&НаСервере
Функция ПродолжитьПересчетСтатусовНаСервереВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Запонение табличной части услуги (Отчет экспедитора)";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДатаНачала", 		ДатаНачала);
	ПараметрыПроцедуры.Вставить("ДатаОкончания",	КонецДня(ДатаОкончания));
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ПересчетЛогистическихСтатусовПоМаксимальнойДатеПараметра.ВыполнитьРасчетЛогистическихСтатусов",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатПересчетаСтатусов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		СтруктураОтвета = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		ТекстСообщения = 	"Начало обработки: "+ СтруктураОтвета.НачалоОбработки 	+"
							|Конец обработки: "	+ СтруктураОтвета.КонецОбработки 	+"
							|Обработано: "		+ СтруктураОтвета.Обработано		+ " грузоперевозок";

		
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ТекстСообщения;
		СообщениеПользователю.Сообщить();
		
		ПоказатьПредупреждение(,"Завершено");
		
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка расчета логистических статусов!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка расчета логистических статусов");
		
	КонецЕсли;
	
КонецПроцедуры

