//////////////////////////////////////////////////////////////////////////////////
//// Подсистема "Клиент ЭДО".
//// ОбщийМодуль.ТорговыеПредложенияКЭДО.
//////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. ТорговыеПредложенияПереопределяемый.ПриОпределенииНастроек.
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	Настройки.ДоступнаФункциональностьЗапросаЦен = Истина;
	
	Настройки.ВариантыПубликацииОстатков.Добавить(Перечисления.ВариантыПубликацииОстатковТорговыеПредложения.Наличие);
	Настройки.ВариантыПубликацииОстатков.Добавить(Перечисления.ВариантыПубликацииОстатковТорговыеПредложения.Количество);
	Настройки.ВариантыПубликацииОстатков.Добавить(Перечисления.ВариантыПубликацииОстатковТорговыеПредложения.КоличествоИНаличие);
	
КонецПроцедуры

// См. ТорговыеПредложенияПереопределяемый.ФункциональнаяОпцияИспользуется.
Процедура ФункциональнаяОпцияИспользуется(Знач ИмяФормы, Результат) Экспорт
	
	Результат = ПолучитьФункциональнуюОпцию("ИспользоватьТорговыеПредложения");
	
КонецПроцедуры

// См. ТорговыеПредложенияПереопределяемый.ДобавитьСлужебныеКолонкиТовары.
Процедура ДобавитьСлужебныеКолонкиТовары(Товары, Знач ПолучатьШтрихКоды = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Товары.Упаковка КАК Справочник.КлассификаторЕдиницИзмерения) КАК Упаковка
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Товары.Упаковка, НЕОПРЕДЕЛЕНО) КАК Упаковка,
	|	Товары.Номенклатура.Наименование КАК Наименование,
	|	Товары.Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|			ТОГДА Товары.Номенклатура.ЕдиницаИзмерения.Код
	|		ИНАЧЕ Товары.Упаковка.Код
	|	КОНЕЦ КАК УпаковкаКод
	|ИЗ
	|	Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Упаковка КАК ЕдиницаИзмерения,
	|	Штрихкоды.Штрихкод КАК Значение
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО Товары.Номенклатура = Штрихкоды.Номенклатура";
	Запрос.УстановитьПараметр("Товары", Товары);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаСвойства = Результат[1].Выбрать();
	Пока ВыборкаСвойства.Следующий() Цикл
		СтрокиТовара = Товары.НайтиСтроки(Новый Структура("Номенклатура, Упаковка",
			ВыборкаСвойства.Номенклатура, ВыборкаСвойства.Упаковка));
		Для Каждого СтрокаТовара Из СтрокиТовара Цикл
			ЗаполнитьЗначенияСвойств(СтрокаТовара, ВыборкаСвойства,, "Номенклатура, Упаковка");
		КонецЦикла;
	КонецЦикла;
	
	Товары.ЗаполнитьЗначения(Неопределено, "Штрихкоды");
	
	ВыборкаШтрихКоды = Результат[2].Выбрать();
	Пока ВыборкаШтрихКоды.Следующий() Цикл
		СтрокаТовара = Товары.НайтиСтроки(Новый Структура("Номенклатура, Упаковка",
			ВыборкаШтрихКоды.Номенклатура, ВыборкаШтрихКоды.ЕдиницаИзмерения));
		Если СтрокаТовара.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаТовара[0].Штрихкоды = Неопределено Тогда
			СтрокаТовара[0].Штрихкоды = Новый Массив;
		КонецЕсли;
		СтрокаТовара[0].Штрихкоды.Добавить(ВыборкаШтрихКоды.Значение);
	КонецЦикла;
		
КонецПроцедуры

// См. ТорговыеПредложенияПереопределяемый.ПолучитьСвойстваТорговогоПредложения.
Процедура ПолучитьСвойстваТорговогоПредложения(Знач Источник, ЗначенияСвойств) Экспорт
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, ТипЦены");
	РеквизитыВидаЦен   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.ТипЦены, "ВалютаЦены, ЦенаВключаетНДС");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(РеквизитыДокумента, РеквизитыВидаЦен, Ложь);
	
	ЗаполнитьЗначенияСвойств(ЗначенияСвойств, РеквизитыДокумента);
	
КонецПроцедуры

// См. ТорговыеПредложенияПереопределяемый.ПолучитьИмяСтавкиНДС.
Процедура ПолучитьИмяСтавкиНДС(Знач Ссылка, ИмяСтавкиНДС) Экспорт
		
	ОбъектМетаданных = Ссылка.Метаданные();
	ИндексЗначения = Перечисления.СтавкиНДС.Индекс(Ссылка);
	Если ИндексЗначения <> -1 Тогда
		ИмяСтавкиНДС = ОбъектМетаданных.ЗначенияПеречисления[ИндексЗначения].Имя;
	Иначе
		ИмяСтавкиНДС = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// См. ТорговыеПредложенияПереопределяемый.ПолучитьЗначениеСтавкиНДС.
Процедура ПолучитьЗначениеСтавкиНДС(Знач ИмяСтавкиНДС, Ссылка) Экспорт
		
	Если Не ПустаяСтрока(ИмяСтавкиНДС)
		И Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления.Найти(ИмяСтавкиНДС) <> Неопределено Тогда
		Ссылка = Перечисления.СтавкиНДС[ИмяСтавкиНДС];
	Иначе
		Ссылка = Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
		
КонецПроцедуры

// См. ТорговыеПредложенияПереопределяемый.ПолучитьПараметрыЕдиницыИзмерения.
//
// Параметры:
//  Код		 - Строка - код единицы измерения.
//  Ссылка - Ссылка - ссылку на единицу измерения
//  Представление - Строка - представление единицы измерения в базе.
//
Процедура ПолучитьПараметрыЕдиницыИзмерения(Знач Код, Ссылка, Представление) Экспорт
	
	Ссылка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(Код);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Наименование");
	КонецЕсли;
	
КонецПроцедуры

// См. ТорговыеПредложенияПереопределяемый.ИнициализацияЗапросаПубликуемыхТоваров
Процедура ИнициализацияЗапросаПубликуемыхТоваров(Запрос, ФормироватьСвойства = Ложь) Экспорт
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиНДСПоОрганизациям.Организация КАК Организация,
	|	СтавкиНДСПоОрганизациям.Общая КАК Общая,
	|	СтавкиНДСПоОрганизациям.ОбщаяРасчетная КАК ОбщаяРасчетная,
	|	СтавкиНДСПоОрганизациям.ПрименяютсяПониженныеСтавки КАК ПрименяютсяПониженныеСтавки
	|ПОМЕСТИТЬ ВТ_СтавкиНДС
	|ИЗ
	|	&СтавкиНДСПоОрганизациям КАК СтавкиНДСПоОрганизациям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрайсЛист.Ссылка КАК Ссылка,
	|	ПрайсЛист.Организация КАК Организация,
	|	ПрайсЛист.Наименование КАК Наименование,
	|	ПрайсЛист.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ПрайсЛист.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ПрайсЛист.ТипЦены.ВалютаЦены КАК Валюта,
	|	ПрайсЛист.ТипЦены.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ПрайсЛист.СрокПоставки КАК СрокПоставки,
	|	ПрайсЛист.ПоВсемТоварам КАК ПоВсемТоварам,
	|	ПрайсЛист.ОбновлятьОстаткиИЦены КАК ОбновлятьОстаткиИЦены,
	|	ПрайсЛист.ТипЦены КАК ВидЦены,
	|	ПрайсЛист.МинимальнаяСуммаЗаказа КАК МинимальнаяСуммаЗаказа,
	|	ЕСТЬNULL(СостоянияСинхронизацииТорговыеПредложения.ПубликоватьЦены, ЛОЖЬ) КАК ПубликоватьЦены
	|ПОМЕСТИТЬ ПрайсЛисты
	|ИЗ
	|	Справочник.ТорговыеПредложения КАК ПрайсЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияСинхронизацииТорговыеПредложения КАК СостоянияСинхронизацииТорговыеПредложения
	|		ПО (СостоянияСинхронизацииТорговыеПредложения.ТорговоеПредложение = ПрайсЛист.Ссылка)
	|ГДЕ
	|	(&ПрайсЛист = НЕОПРЕДЕЛЕНО
	|			ИЛИ ПрайсЛист.Ссылка В (&ПрайсЛист))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрайсЛисты.Ссылка КАК ПрайсЛист,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент
	|ПОМЕСТИТЬ Контрагенты
	|ИЗ
	|	ПрайсЛисты КАК ПрайсЛисты
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрайсЛисты.Ссылка КАК ПрайсЛист,
	|	&ПредставлениеКонтакта КАК ПредставлениеКонтакта,
	|	ЕСТЬNULL(ОрганизацияТелефон.Представление, """") КАК Телефон,
	|	ЕСТЬNULL(ОрганизацияЭлектроннаяПочта.Представление, """") КАК ЭлектроннаяПочта
	|ПОМЕСТИТЬ Контакты
	|ИЗ
	|	ПрайсЛисты КАК ПрайсЛисты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияТелефон
	|		ПО ПрайсЛисты.Организация = ОрганизацияТелефон.Ссылка
	|			И (ОрганизацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации))
	|			И (ОрганизацияТелефон.Вид.Предопределенный)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацияЭлектроннаяПочта
	|		ПО ПрайсЛисты.Организация = ОрганизацияЭлектроннаяПочта.Ссылка
	|			И (ОрганизацияЭлектроннаяПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailОрганизации))
	|			И (ОрганизацияЭлектроннаяПочта.Вид.Предопределенный)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПрайсЛист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыТорговыхПредложений.ТорговоеПредложение КАК ПрайсЛист,
	|	ТоварыТорговыхПредложений.Номенклатура КАК Номенклатура,
	|	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СправочникНоменклатура.Родитель КАК Родитель,
	|	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	&ПустаяХарактеристика КАК Характеристика,
	|	"""" КАК НаименованиеХарактеристики,
	|	СправочникНоменклатура.НаименованиеПолное КАК НаименованиеНоменклатуры,
	|	СправочникНоменклатура.Артикул КАК Артикул,
	|	ВЫРАЗИТЬ(СправочникНоменклатура.Комментарий КАК СТРОКА(250)) КАК ОписаниеНоменклатуры,
	|	ТоварыТорговыхПредложений.ЕдиницаИзмерения КАК Упаковка,
	|	ЕСТЬNULL(ЕдиницыИзмерения.Наименование, """") КАК НаименованиеУпаковки,
	|	1 КАК ЧислительУпаковки,
	|	1 КАК ЗнаменательУпаковки,
	|	1 КАК КратностьУпаковки,
	|	ВЫБОР
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|				ИЛИ СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|					И НЕ СтавкиНДС.ПрименяютсяПониженныеСтавки
	|			ТОГДА СтавкиНДС.Общая
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|				ИЛИ СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|					И НЕ СтавкиНДС.ПрименяютсяПониженныеСтавки
	|			ТОГДА СтавкиНДС.ОбщаяРасчетная
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ПрайсЛисты.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ТоварыТорговыхПредложений.Цена КАК Цена,
	|	ПрайсЛисты.СрокПоставки КАК СрокПоставки,
	|	ТоварыТорговыхПредложений.Оценка КАК Наличие,
	|	ТоварыТорговыхПредложений.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ПрайсЛисты.ПубликоватьЦены
	|				И ТоварыТорговыхПредложений.Цена = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныИсключенияИзПубликацииТорговогоПредложения.НеУказанаЦена)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПричиныИсключенияИзПубликацииТорговогоПредложения.ПустаяСсылка)
	|	КОНЕЦ КАК ПричинаИсключенияИзПубликации
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	РегистрСведений.ТоварыТорговыхПредложений КАК ТоварыТорговыхПредложений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрайсЛисты КАК ПрайсЛисты
	|		ПО ТоварыТорговыхПредложений.ТорговоеПредложение = ПрайсЛисты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТоварыТорговыхПредложений.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО ТоварыТорговыхПредложений.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтавкиНДС КАК СтавкиНДС
	|		ПО (ПрайсЛисты.Организация = СтавкиНДС.Организация)
	|ГДЕ
	|	НЕ ПрайсЛисты.ПоВсемТоварам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрайсЛисты.Ссылка,
	|	ТоварыПрайсЛиста.Номенклатура,
	|	СправочникНоменклатура.ВидНоменклатуры,
	|	СправочникНоменклатура.Родитель,
	|	СправочникНоменклатура.ЕдиницаИзмерения,
	|	&ПустаяХарактеристика,
	|	"""",
	|	СправочникНоменклатура.НаименованиеПолное,
	|	СправочникНоменклатура.Артикул,
	|	ВЫРАЗИТЬ(СправочникНоменклатура.Комментарий КАК СТРОКА(250)),
	|	СправочникНоменклатура.ЕдиницаИзмерения,
	|	ЕСТЬNULL(ЕдиницыИзмерения.Наименование, """"),
	|	1,
	|	1,
	|	1,
	|	ВЫБОР
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Общая)
	|				ИЛИ СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|					И НЕ СтавкиНДС.ПрименяютсяПониженныеСтавки
	|			ТОГДА СтавкиНДС.Общая
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ОбщаяРасчетная)
	|				ИЛИ СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|					И НЕ СтавкиНДС.ПрименяютсяПониженныеСтавки
	|			ТОГДА СтавкиНДС.ОбщаяРасчетная
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Пониженная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.ПониженнаяРасчетная)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.Нулевая)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		КОГДА СправочникНоменклатура.ВидСтавкиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыСтавокНДС.БезНДС)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	|	КОНЕЦ,
	|	ПрайсЛисты.ЦенаВключаетНДС,
	|	ТоварыПрайсЛиста.Цена,
	|	ПрайсЛисты.СрокПоставки,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ПрайсЛисты.ПубликоватьЦены
	|				И ТоварыПрайсЛиста.Цена = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПричиныИсключенияИзПубликацииТорговогоПредложения.НеУказанаЦена)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПричиныИсключенияИзПубликацииТорговогоПредложения.ПустаяСсылка)
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ТоварыПрайсЛиста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПрайсЛисты КАК ПрайсЛисты
	|		ПО ТоварыПрайсЛиста.ТипЦен = ПрайсЛисты.ВидЦены
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТоварыПрайсЛиста.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
	|		ПО (СправочникНоменклатура.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтавкиНДС КАК СтавкиНДС
	|		ПО (ПрайсЛисты.Организация = СтавкиНДС.Организация)
	|ГДЕ
	|	ПрайсЛисты.ПоВсемТоварам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	ДополнительныеРеквизиты.Свойство КАК Свойство,
	|	ДополнительныеРеквизиты.Значение КАК Значение
	|ПОМЕСТИТЬ Свойства
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Товары КАК Товары
	|		ПО (Товары.Номенклатура = ДополнительныеРеквизиты.Ссылка)
	|ГДЕ
	|	&ИспользоватьДополнительныеРеквизитыИСведения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	НЕОПРЕДЕЛЕНО,
	|	&Свойство,
	|	&Значение
	|ИЗ
	|	Товары КАК Товары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ЕдиницаИзмерения КАК Упаковка,
	|	Товары.Характеристика КАК Характеристика,
	|	Штрихкоды.Штрихкод КАК Значение
	|ПОМЕСТИТЬ Штрихкоды
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|		ПО Товары.Номенклатура = Штрихкоды.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	НоменклатураПрисоединенныеФайлы.Ссылка КАК ФайлИзображения,
	|	Товары.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ Изображения
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|		ПО Товары.Номенклатура = НоменклатураПрисоединенныеФайлы.ВладелецФайла
	|ГДЕ
	|	НоменклатураПрисоединенныеФайлы.ИндексКартинки МЕЖДУ 42 И 50
	|	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ФайлИзображения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.ПрайсЛист КАК ПрайсЛист,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Товары.Номенклатура) КАК ВсегоКоличествоТоваров
	|ПОМЕСТИТЬ ВсегоТоваровПрайсЛиста
	|ИЗ
	|	Товары КАК Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.ПрайсЛист
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПрайсЛист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ПрайсЛист КАК ВидыЦен,
	|	0 КАК Количество,
	|	0 КАК Цена,
	|	0 КАК ЦенаДоСкидки,
	|	НЕОПРЕДЕЛЕНО КАК Комментарий
	|ПОМЕСТИТЬ СкидкиЗаОбъемПродаж
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.ПрайсЛист КАК ВидыЦен,
	|	0 КАК Количество,
	|	0 КАК Цена,
	|	0 КАК ЦенаДоСкидки,
	|	НЕОПРЕДЕЛЕНО КАК Комментарий
	|ПОМЕСТИТЬ СкидкиЗаОбъемПродажВидыЦен
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ПрайсЛист КАК ВидыЦен,
	|	Товары.Характеристика КАК Характеристика,
	|	0 КАК Цена,
	|	НЕОПРЕДЕЛЕНО КАК Комментарий
	|ПОМЕСТИТЬ СкидкиПроцентСумма
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ПрайсЛист КАК ВидыЦен,
	|	0 КАК Количество,
	|	0 КАК Цена,
	|	Товары.Характеристика КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК Комментарий
	|ПОМЕСТИТЬ СкидкиПроцентСуммаВидыЦен
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	ЛОЖЬ";
	
	Запрос.УстановитьПараметр("СтавкиНДСПоОрганизациям", СтавкиНДСПоОрганизациям());
	Запрос.УстановитьПараметр("ПредставлениеКонтакта", НСтр("ru = 'Отдел продаж'"));
	Запрос.УстановитьПараметр("ПустаяХарактеристика", Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка());
	
	ИспользоватьДополнительныеРеквизитыИСведения = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения");
	Запрос.УстановитьПараметр("ИспользоватьДополнительныеРеквизитыИСведения", ИспользоватьДополнительныеРеквизитыИСведения);
	
	ДобавитьРеквизитыНоменклатурыВЗапрос(Запрос);

КонецПроцедуры

Функция СтавкиНДСПоОрганизациям()
	СписокОрганизаций  = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	
	ТаблицаСтавок = Новый ТаблицаЗначений;
	ТаблицаСтавок.Колонки.Добавить("Организация",                 Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаСтавок.Колонки.Добавить("Общая",                       Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТаблицаСтавок.Колонки.Добавить("ОбщаяРасчетная",              Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС")); 
	ТаблицаСтавок.Колонки.Добавить("ПрименяютсяПониженныеСтавки", Новый ОписаниеТипов("Булево")); 
	
	ПониженнаяУСНСтавкаНДС = УчетНДСКлиентСервер.ПониженнаяУСНСтавкаНДС(ТекущаяДатаСеанса());
	
	Для каждого Организация Из СписокОрганизаций Цикл
		
		СтавкаНДСПоОрганизации = УчетНДСВызовСервера.СтавкаНДСПоОрганизации(Организация, ТекущаяДатаСеанса());
		РасчетнаяСтавкаНДСОрганизации = УчетНДСВызовСервера.РасчетнаяСтавкаНДСОрганизации(Организация, ТекущаяДатаСеанса()); 
		
		НоваяСтрока = ТаблицаСтавок.Добавить();
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.Общая                       = СтавкаНДСПоОрганизации;
		НоваяСтрока.ОбщаяРасчетная              = РасчетнаяСтавкаНДСОрганизации;
		// пониженные ставки применяются только если не применяется ПониженнаяУСН
		НоваяСтрока.ПрименяютсяПониженныеСтавки = НЕ СтавкаНДСПоОрганизации = ПониженнаяУСНСтавкаНДС;
	КонецЦикла;
	
	ВОзврат ТаблицаСтавок;
КонецФункции 


// См. ТорговыеПредложенияПереопределяемый.ОпределитьОбрабатываемыеРеквизитыКарточкиТорговогоПредложения
Процедура ОпределитьОбрабатываемыеРеквизитыКарточкиТорговогоПредложения(Реквизиты) Экспорт
	
	// Таблица "Товары"
	Реквизиты.Вставить("Товары.НаименованиеНоменклатуры"                 , Истина);
	Реквизиты.Вставить("Товары.Артикул"                                  , Истина);
	Реквизиты.Вставить("Товары.НаименованиеУпаковки"                     , Истина);
	Реквизиты.Вставить("Товары.Цена"                                     , Истина);
	Реквизиты.Вставить("Товары.СтавкаНДС"                                , Истина);
	Реквизиты.Вставить("Товары.СрокПоставки"                             , Истина);
	Реквизиты.Вставить("Товары.Наличие"                                  , Истина);
	
	// Таблица "ПрайсЛистыСлужебный"
	Реквизиты.Вставить("ПрайсЛистыСлужебный.НаименованиеОрганизации"     , Истина);
	Реквизиты.Вставить("ПрайсЛистыСлужебный.ИННОрганизации"              , Истина);
	Реквизиты.Вставить("ПрайсЛистыСлужебный.КППОрганизации"              , Истина);
	Реквизиты.Вставить("ПрайсЛистыСлужебный.ТелефонОрганизации"          , Истина);
	Реквизиты.Вставить("ПрайсЛистыСлужебный.СайтОрганизации"             , Истина);
	Реквизиты.Вставить("ПрайсЛистыСлужебный.ЭлектроннаяПочтаОрганизации" , Истина);
	
	// Таблица "Контакты"
	Реквизиты.Вставить("Контакты.Телефон"                                , Истина);
	Реквизиты.Вставить("Контакты.ЭлектроннаяПочта"                       , Истина);
	
	// Изображения.
	Реквизиты.Вставить("Изображения.ФайлИзображения"                     , Истина);
	
КонецПроцедуры

// См. ТорговыеПредложенияПереопределяемый.ОпределитьВладельцевНезаполненныхРеквизитов
Процедура ОпределитьВладельцевНезаполненныхРеквизитов(ПроверяемыйРеквизит, СтрокаТорговогоПредложения, ДополнительныйРеквизит, СсылкаНаОбъект, ПутьКДанным, ТекстСообщения) Экспорт

	Если ПроверяемыйРеквизит = "Товары.Артикул" Тогда
		СсылкаНаОбъект = СтрокаТорговогоПредложения.Номенклатура;
		ПутьКДанным    = "Объект.Артикул";
		ТекстСообщения = НСтр("ru = 'Не заполнен артикул номенклатуры'");
	ИначеЕсли ПроверяемыйРеквизит = "Товары.НаименованиеНоменклатуры" Тогда
		СсылкаНаОбъект = СтрокаТорговогоПредложения.Номенклатура;
		ПутьКДанным    = "Объект.Наименование";
		ТекстСообщения = НСтр("ru = 'Не заполнено наименование номенклатуры'");
	ИначеЕсли ПроверяемыйРеквизит = "Товары.НаименованиеУпаковки" 
		И СтрокаТорговогоПредложения.Упаковка.Пустая() Тогда
		СсылкаНаОбъект = СтрокаТорговогоПредложения.Номенклатура;
		ПутьКДанным    = "Объект.ЕдиницаИзмерения";
		ТекстСообщения = НСтр("ru = 'Не заполнена единица измерения'");
	ИначеЕсли ПроверяемыйРеквизит = "Товары.НаименованиеУпаковки" 
		И НЕ СтрокаТорговогоПредложения.Упаковка.Пустая() Тогда
		СсылкаНаОбъект = СтрокаТорговогоПредложения.Упаковка;
		ПутьКДанным    = "Объект.Наименование";
		ТекстСообщения = НСтр("ru = 'Не заполнено наименование единицы измерения'");
	ИначеЕсли ПроверяемыйРеквизит = "Товары.УпаковкаКод" 
		И СтрокаТорговогоПредложения.Упаковка.Пустая() Тогда
		СсылкаНаОбъект = СтрокаТорговогоПредложения.Номенклатура;
		ПутьКДанным    = "Объект.ЕдиницаИзмерения";
		ТекстСообщения = НСтр("ru = 'Не заполнена единица измерения'");
	ИначеЕсли ПроверяемыйРеквизит = "Товары.УпаковкаКод" 
		И НЕ СтрокаТорговогоПредложения.Упаковка.Пустая() Тогда
		СсылкаНаОбъект = СтрокаТорговогоПредложения.Упаковка;
		ПутьКДанным    = "Объект.Код";
		ТекстСообщения = НСтр("ru = 'Не заполнен код ОКЕИ'");
	ИначеЕсли ПроверяемыйРеквизит = "Товары.СтавкаНДС" Тогда
		СтавкаНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТорговогоПредложения.Номенклатура, "ВидСтавкиНДС");
		
		Если ЗначениеЗаполнено(СтавкаНДС) Тогда
			СсылкаНаОбъект = СтрокаТорговогоПредложения.Номенклатура;
			ПутьКДанным    = "Объект.ВидСтавкиНДС";
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ставка НДС %1 является недопустимой для публикации товаров'"), СтавкаНДС);
		Иначе
			СсылкаНаОбъект = СтрокаТорговогоПредложения.Номенклатура;
			ПутьКДанным    = "Объект.ВидСтавкиНДС";
			ТекстСообщения = НСтр("ru = 'Некорректно заполнена ставка НДС'");
		КонецЕсли;
		
	ИначеЕсли ПроверяемыйРеквизит = "Свойства.Свойство" Тогда
		СсылкаНаОбъект  = СтрокаТорговогоПредложения.Номенклатура;
		ДанныеРеквизита = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДополнительныйРеквизит, "НаборСвойств, Заголовок");
		ПутьКДанным     = СтрШаблон("ДополнительныйРеквизитЗначение_%1_%2", 
			СтрЗаменить(ВРег(Строка(ДанныеРеквизита.НаборСвойств.УникальныйИдентификатор())), "-", "x"),
			СтрЗаменить(ВРег(Строка(ДополнительныйРеквизит.УникальныйИдентификатор())), "-", "x"));
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Некорректно заполнен реквизит ""%1""'"), ДанныеРеквизита.Заголовок);
	ИначеЕсли ПроверяемыйРеквизит = "Контакты.Телефон" Тогда
		СсылкаНаОбъект  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТорговогоПредложения.ПрайсЛист, "Организация");
		ПутьКДанным     = СтрШаблон("КонтактнаяИнформацияПоле%1%2", 
			СтрЗаменить(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации.УникальныйИдентификатор(), "-", "x"), 1);
		ТекстСообщения = НСтр("ru = 'Некорректно заполнен контактный телефон организации'");
	ИначеЕсли ПроверяемыйРеквизит = "Контакты.ЭлектроннаяПочта" Тогда
		СсылкаНаОбъект  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТорговогоПредложения.ПрайсЛист, "Организация");
		ПутьКДанным     = СтрШаблон("КонтактнаяИнформацияПоле%1%2", 
			СтрЗаменить(Справочники.ВидыКонтактнойИнформации.EmailОрганизации.УникальныйИдентификатор(), "-", "x"), 1);
		ТекстСообщения = НСтр("ru = 'Не заполнен адрес электронной почты организации'");
	ИначеЕсли ПроверяемыйРеквизит = "ПрайсЛисты.Наименование" Тогда
		СсылкаНаОбъект  = СтрокаТорговогоПредложения.ПрайсЛист;
		ПутьКДанным     = "Объект.Наименование";
		ТекстСообщения = НСтр("ru = 'Не заполнено наименование торгового предложения'");
	ИначеЕсли ПроверяемыйРеквизит = "ПрайсЛисты.ДатаНачалаДействия" Тогда
		СсылкаНаОбъект  = СтрокаТорговогоПредложения.ПрайсЛист;
		ПутьКДанным     = "Объект.ДатаНачалаДействия";
		ТекстСообщения = НСтр("ru = 'Не заполнена дата начала публикации торгового предложения'");
	ИначеЕсли ПроверяемыйРеквизит = "ПрайсЛисты.ДатаОкончанияДействия" Тогда
		СсылкаНаОбъект  = СтрокаТорговогоПредложения.ПрайсЛист;
		ПутьКДанным     = "Объект.ДатаОкончанияДействия";
		ТекстСообщения = НСтр("ru = 'Не верно заполнена дата окончания публикации торгового предложения'");
	ИначеЕсли ПроверяемыйРеквизит = "КонтрагентыСлужебный.КонтрагентИНН" Тогда
		СсылкаНаОбъект  = ДополнительныйРеквизит;
		ПутьКДанным     = "Объект.ИНН";
		ТекстСообщения = НСтр("ru = 'Не верно задан ИНН контрагента'");
	ИначеЕсли ПроверяемыйРеквизит = "КонтрагентыСлужебный.КонтрагентКПП" Тогда
		СсылкаНаОбъект  = ДополнительныйРеквизит;
		ПутьКДанным     = "Объект.КПП";
		ТекстСообщения = НСтр("ru = 'Не верно задан КПП контрагента'");
	ИначеЕсли ПроверяемыйРеквизит = "ПричинаИсключенияИзПубликации"
		И СсылкаНаОбъект = Перечисления.ПричиныИсключенияИзПубликацииТорговогоПредложения.НеУказанаЦена Тогда
		
		СтруктураОтбора = Новый Структура("Номенклатура, Упаковка");
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТорговогоПредложения);
		
		СсылкаНаОбъект  = СтрокаТорговогоПредложения.ПрайсЛист;
		ПутьКДанным     = ОпределитьПутьКДаннымТовараТорговогоПредложения(СтрокаТорговогоПредложения.ПрайсЛист,
			СтруктураОтбора);
		ТекстСообщения  = НСтр("ru = 'Не заполнена цена товара'");
		
	КонецЕсли;

КонецПроцедуры

// См. ТорговыеПредложенияПереопределяемый.ОпределитьОбрабатываемыеПричиныИсключенияИзПубликации
Процедура ОпределитьОбрабатываемыеПричиныИсключенияИзПубликации(Причины) Экспорт

	Причины.Добавить(Перечисления.ПричиныИсключенияИзПубликацииТорговогоПредложения.НеУказанаЦена);

КонецПроцедуры

// См. ТорговыеПредложенияПереопределяемый.ОпределитьКодЕдиницыИзмерения
Процедура ОпределитьКодЕдиницыИзмерения(ЕдиницаИзмерения, КодЕдиницыИзмерения) Экспорт

	КодЕдиницыИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "Код");

КонецПроцедуры

// Получает реквизиты номенклатуры и значение признака "ХарактеристикиИспользуются".
//
// Параметры:
//  СсылкаНаОбъект - СправочникСсылка.Номенклатура - объект, значения реквизитов которого необходимо получить.
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//     Если используются характеристики, то дополнительно содержит
//     значение признака "ХарактеристикиИспользуются".
//
Функция РеквизитыНоменклатурыПриИзменении(СсылкаНаОбъект, Знач Реквизиты = "") Экспорт
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизиты);
	
	Результат.Вставить("ХарактеристикиИспользуются", Ложь);
	
	Возврат Результат;
КонецФункции

// См. ТорговыеПредложенияПереопределяемый.ЗаполнитьСведенияОНоменклатуре
Процедура ЗаполнитьСведенияОНоменклатуре(ДанныеНоменклатуры) Экспорт
	СписокНоменклатуры = ОбщегоНазначения.ВыгрузитьКолонку(ДанныеНоменклатуры, "Номенклатура");
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокНоменклатуры, "ЕдиницаИзмерения");
	Для каждого СтрокаДанныеНоменклатуры Из ДанныеНоменклатуры Цикл
		СвойстваЭлемента = РеквизитыНоменклатуры[СтрокаДанныеНоменклатуры.Номенклатуры];
		Если СвойстваЭлемента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваЭлемента.Вставить("ИспользованиеХарактеристик", Ложь);
		
		ЗаполнитьЗначенияСвойств(СтрокаДанныеНоменклатуры, СвойстваЭлемента);
	КонецЦикла;

КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
// Дополнение в запрос источников по дополнительным реквизитам номенклатуры.
//
// Параметры:
//   Запрос - Запрос - основной запрос сбора данных.
//
Процедура ДобавитьРеквизитыНоменклатурыВЗапрос(Запрос)
	
	БлокРеквизитовШаблон =
	"ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	НЕОПРЕДЕЛЕНО,
	|	&Свойство,
	|	&Значение
	|ИЗ
	|	Товары КАК Товары";
	
	ДоступныеДляПубликацииРеквизиты = Новый Соответствие;
	РаботаСНоменклатуройБП.ПолучитьРеквизитыНоменклатурыДоступныеДляПубликации(ДоступныеДляПубликацииРеквизиты); 
	
	МассивПодзапросов = Новый Массив;
	СчетчикРеквизитов = 0;
	Для Каждого СвойстваРеквизита Из ДоступныеДляПубликацииРеквизиты Цикл
		
		ИндексСтрокой = XMLСтрока(СчетчикРеквизитов);
		
		СчетчикРеквизитов = СчетчикРеквизитов + 1;
		ТекстПодзапроса = БлокРеквизитовШаблон;
		
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "&Значение", СвойстваРеквизита.Значение.ПутьКДанным);
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "&Свойство", "&Свойство" + ИндексСтрокой);
		
		Запрос.УстановитьПараметр("Свойство" + ИндексСтрокой, СвойстваРеквизита.Ключ);
		
		Если СвойстваРеквизита.Значение.Свойство("ПустоеЗначение") Тогда
			ТекстПодзапроса = ТекстПодзапроса + Символы.ПС
				+ "ГДЕ НЕ "+ СвойстваРеквизита.Значение.ПутьКДанным + " = &ПустоеЗначение" + ИндексСтрокой;
			Запрос.УстановитьПараметр("ПустоеЗначение" + ИндексСтрокой,
				СвойстваРеквизита.Значение.ПустоеЗначение);
		КонецЕсли;
		
		МассивПодзапросов.Добавить(ТекстПодзапроса);
		
	КонецЦикла;
	
	БлокРеквизитовПодстановка = СтрСоединить(МассивПодзапросов, Символы.ПС + Символы.ПС
		+ "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС);
	
	// Если реквизиты не найдены, то возврат.
	Если ПустаяСтрока(БлокРеквизитовПодстановка) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрЧислоВхождений(Запрос.Текст, БлокРеквизитовШаблон) = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка компоновки запроса получения данных номенклатуры.'");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, БлокРеквизитовШаблон, БлокРеквизитовПодстановка);
	
КонецПроцедуры

Функция ОпределитьПутьКДаннымТовараТорговогоПредложения(ТорговоеПредложение, Отбор)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТоварыТорговыхПредложений.Номенклатура КАК Номенклатура,
	|	ТоварыТорговыхПредложений.ЕдиницаИзмерения КАК Упаковка
	|ИЗ
	|	РегистрСведений.ТоварыТорговыхПредложений КАК ТоварыТорговыхПредложений
	|ГДЕ
	|	ТоварыТорговыхПредложений.ТорговоеПредложение = &ТорговоеПредложение");
	
	Запрос.УстановитьПараметр("ТорговоеПредложение", ТорговоеПредложение);
	Товары = Запрос.Выполнить().Выгрузить();
	
	НайденныеСтроки = Товары.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат "Товары";
	КонецЕсли;
	
	Возврат СтрШаблон("Товары[%1].Цена", Формат(Товары.Индекс(НайденныеСтроки[0]), "ЧДЦ=0; ЧН=0; ЧГ="));

КонецФункции

#КонецОбласти
