
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = "Запись журнала ("+Объект.Дата+")";
	ЭтаФорма.ТолькоПросмотр=Истина;
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры



&НаКлиенте
Процедура ТестоваяОтправка(Команда)
	
	_ОтправитьСообщение();
	
КонецПроцедуры

&НаСервере
Процедура _ОтправитьСообщение()
	// --- 
	
	Сервер = "172.16.150.220";
	Порт="3000";
	Путь = "/send";
	
	Получатель = "ollowtf@jabber.ru";
	ТелоСообщения = Формат(Объект.Дата)+Символы.ПС+ПолучитьНавигационнуюСсылку(Объект.Ссылка)+Символы.ПС+Строка(Объект.Событие);
	//СтруктураДанных = Новый Структура("jid,body", Получатель, ТелоСообщения);
	ЗаписьДанных = Новый ЗаписьJSON;
	ЗаписьДанных.УстановитьСтроку();
	ЗаписьДанных.ЗаписатьНачалоОбъекта();
	ЗаписьДанных.ЗаписатьИмяСвойства("jid");
	ЗаписьДанных.ЗаписатьЗначение(Получатель);
	ЗаписьДанных.ЗаписатьИмяСвойства("body");
	ЗаписьДанных.ЗаписатьЗначение(ТелоСообщения);
	ЗаписьДанных.ЗаписатьКонецОбъекта();
	СтрокаДанных = ЗаписьДанных.Закрыть();
	
	Соединение = Новый HTTPСоединение(Сервер,Порт);
	Запрос = Новый HTTPЗапрос(Путь);
	Запрос.Заголовки.Вставить("content-type","application/json");
	Запрос.УстановитьТелоИзСтроки(СтрокаДанных,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
	Результат = Соединение.ОтправитьДляОбработки(Запрос); // POST
	
	// --- 
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти