&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Параметры.Свойство("ИдентификаторОбъектовМетаданных", ИдентификаторОбъектовМетаданных);         
	
	Схема = ПолучитьИзВременногоХранилища(Параметры.АдресСхемы);
	
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.АдресСхемы);
	
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);

	Ограничение = Элементы.ВыборДоступныеПоляВыбора.ОграниченияИспользования.Добавить();	
	Ограничение.Поле = Новый ПолеКомпоновкиДанных("СистемныеПоля");
	Ограничение.Доступность = Ложь;  
	
КонецПроцедуры    

&НаКлиенте
Процедура ВыборДоступныеПоляВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборПользователя(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда) 
	
	ВыбраннаяСтрока = Элементы.ВыборДоступныеПоляВыбора.ТекущаяСтрока;
	ОбработатьВыборПользователя(ВыбраннаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборПользователя(Знач ВыбраннаяСтрока)
	
	ЭтаФорма.Закрыть(СокрЛП(ВыбраннаяСтрока));

КонецПроцедуры   



