// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет отправку сообщения получателю
// 
// Параметры:
//  Сообщение - см. Отчетность24БРОШинаСлужебный.НовоеСообщениеДляОтправки
Процедура ОтправитьСообщение(Сообщение) Экспорт
	
	Если Не ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Возврат; // На клиент-серверных базах есть проблема с закрытием сокета при сохранении конфигурации
	КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.26.0", СистемнаяИнформация.ВерсияПриложения) <= 0 Тогда
		
		// Обход ошибки при проверке модуля на платформе ниже 8.3.27
		УстановитьБезопасныйРежим(Истина);
		// АПК:488-выкл Поддержка новых методов платформы (исполняемый код безопасен)
		// Не нарушает безопасность информации, так как вычисляется фиксированная строка, 
		// содержащая только вызов метода платформы.
		ВебСокет = Вычислить("WebSocketКлиентСоединения.ПолучитьСоединение(КлючСоединения())");
		// АПК:488-вкл
		УстановитьБезопасныйРежим(Ложь);
		Если ВебСокет <> Неопределено Тогда
			Отчетность24БРОШинаСлужебный.ПоместитьСообщениеВОчередьДляОтправки(ВебСокет, Сообщение);
			Отчетность24БРОШинаСлужебный.ОтправитьСообщения(ВебСокет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик при получении сообщений из шины
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение
//  Сообщение  - см. Отчетность24БРОШинаСлужебный.СообщениеSTOMP
Процедура ПриПолученииСообщения(Соединение, Сообщение) Экспорт
	
	// Проверяем отправителя
	ИндексНачалаJSON = СтрНайти(Сообщение.Тело, "{");
	Если ИндексНачалаJSON > 0 Тогда
		Попытка
			СтруктураСообщения = ОбщегоНазначения.JSONВЗначение(Сообщение.Тело,,Ложь); // Структура
		Исключение
			ЗаписьЖурналаРегистрации(
				"ШинаRabbitMQ",
				УровеньЖурналаРегистрации.Ошибка, , ,
				СтрШаблон(НСтр("ru = 'Не удалось десериализовать сообщение:
				|%1'"), Сообщение.Тело));
			Возврат;
		КонецПопытки;
		
		ИдентификаторБазы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураСообщения, "ИдентификаторБазы", ""); // Строка
		Если Не ЗначениеЗаполнено(ИдентификаторБазы) Тогда
			ЗаписьЖурналаРегистрации(
				"ШинаRabbitMQ",
				УровеньЖурналаРегистрации.Ошибка, , ,
				СтрШаблон(НСтр("ru = 'Не указан идентификатор базы отправителя сообщения:
				|%1'"), Сообщение.Тело));
			Возврат;
		КонецЕсли;
		
		// проверка отправителя по базе подключений
		Если Не НастроенаИнтеграцияСОтправителем(ИдентификаторБазы) Тогда
			// нет интеграции по данной базе - защита от возможной DDOS атаки
			Возврат;
		КонецЕсли;
	Иначе
		// защита от возможной DDOS атаки
		Возврат;
	КонецЕсли;
	
	// запускаем получение сообщений из шины-отчетности по защищенному каналу 
	
	//@skip-check bsl-legacy-check-string-literal
	Если ДокументооборотСКОВызовСервера.ЭтоРежимОблачной1СО() Тогда
		// Конфигурация Отчетность
		ИмяМодуляИнтеграции = "СервисИнтеграцииСУчетнымиСистемамиВызовСервера"; 
		Попытка
			МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль(ИмяМодуляИнтеграции);
			Если МодульИнтеграции <> Неопределено Тогда
				ОбщегоНазначения.ВыполнитьМетодКонфигурации(
					"СервисИнтеграцииСУчетнымиСистемамиВызовСервера.ПолучитьСообщенияПоHttp", Новый Массив);
			КонецЕсли;
		Исключение
			МодульИнтеграции = Неопределено;
		КонецПопытки;
	Иначе
		// Учетная конфигурация
		ИмяМодуляИнтеграции = "ИнтеграцияСОтчетность24ВызовСервера";
		Попытка
			МодульИнтеграции = ОбщегоНазначения.ОбщийМодуль(ИмяМодуляИнтеграции);
			Если МодульИнтеграции <> Неопределено Тогда
				ПараметрыВызова = Новый Массив(); // Массив Из Строка, Булево -
				ПараметрыВызова.Добавить("");
				ПараметрыВызова.Добавить(Ложь);
				ОбщегоНазначения.ВыполнитьМетодКонфигурации(
					"ИнтеграцияСОтчетность24ВызовСервера.ПолучитьСообщенияПоHttp", ПараметрыВызова);
			КонецЕсли;
		Исключение
			МодульИнтеграции = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет методы под требование безопасности
// 
// Параметры:
//  Методы - Структура - СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
    Методы.Вставить("ПриПолученииСообщения");
КонецПроцедуры

// Выполняет запуск подключения к шине если веб-сокет еще не подключен
//
Процедура Подключиться() Экспорт
	
	Если Не ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Возврат; // На клиент-серверных базах есть проблема с закрытием сокета при сохранении конфигурации
	КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.26.0", СистемнаяИнформация.ВерсияПриложения) > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЕстьНастроенныеПриложения() Тогда
		Отключиться(Истина);
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Параметры = Отчетность24БРОШинаСлужебный.НовыеПараметрыПодключения();
	Параметры.Ключ = КлючСоединения();
	Параметры.ПереподключениеПриЗакрытииСоединения = Истина;
	Параметры.Сервер = АдресСервера();
	Параметры.Путь = ПутьСервера();
	Параметры.ЗащищенноеСоединение = ЗащищенноеСоединение();
	Параметры.Порт = ПортСервера();

	Параметры.ПриПолученииСообщения = "Отчетность24БРОШинаУведомления.ПриПолученииСообщения";

	ИдентификаторБазы = Отчетность24БРО.ИдентификаторБазы();	
	ИдентификаторНаШине = ВРЕГ(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ИдентификаторБазы));
	
	Параметры.Подписки.Добавить(Отчетность24БРОШинаСлужебный.Подписка("db." + ИдентификаторНаШине, 
		Отчетность24БРОШинаСлужебный.ТипыПриемниковОбработкиСообщений().ПоШаблону)); // получение сообщений адресованных этой базе
	
	Отчетность24БРОШинаСлужебный.Подключиться(Параметры);
	
КонецПроцедуры

// Выполняет отключение от шины (если текущий пользователь последний активный пользователь файловой базы)
// Для серверных баз отключение не требуется,
// т.к. веб-сокет должен принимать сообщения даже если с базой никто не работает
// 
// Параметры:
//  Принудительно - Булево
Процедура Отключиться(Принудительно = Ложь) Экспорт

	Если Принудительно Или ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
	
		УстановитьБезопасныйРежим(Истина);
		// АПК:488-выкл Поддержка новых методов платформы (исполняемый код безопасен)
		// Не нарушает безопасность информации, так как вычисляется фиксированная строка, 
		// содержащая только вызов метода платформы.
		ВебСокет = Вычислить("WebSocketКлиентСоединения.ПолучитьСоединение(КлючСоединения())");
		// АПК:488-вкл
		УстановитьБезопасныйРежим(Ложь);
		
		Если ВебСокет <> Неопределено Тогда
			Отчетность24БРОШинаСлужебный.Отключиться(ВебСокет);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Адрес сервера шины уведомлений
// 
// Возвращаемое значение:
//  Строка
Функция АдресСервера()
	Возврат "edi.1cfresh.com";
КонецФункции

// Порт сервера шины уведомлений
// 
// Возвращаемое значение:
//  Число
Функция ПортСервера()
	Возврат 443;
КонецФункции

// Признак необходимости защищенного соединения
// 
// Возвращаемое значение:
//  Булево
Функция ЗащищенноеСоединение()
	Возврат Истина;
КонецФункции

// Путь сервера шины уведомлений
// 
// Возвращаемое значение:
//  Строка
Функция ПутьСервера()
	Возврат "/notifybus";
КонецФункции

// Ключ соединения.
// 
// Возвращаемое значение:
//  Строка
Функция КлючСоединения()

	ИдентификаторБазы = Отчетность24БРО.ИдентификаторБазы();	
	ИдентификаторНаШине = ВРЕГ(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ИдентификаторБазы));
	
	Возврат "RabbitMQ-BusReports" + ИдентификаторНаШине;
	
КонецФункции

// Возвращает признак наличия записи с базой отправителя в регистре настроек интеграции
// 
// Параметры:
//  ИдентификаторБазы - Строка
// 
// Возвращаемое значение:
//  Булево
Функция НастроенаИнтеграцияСОтправителем(ИдентификаторБазы)
	
	Запрос = Новый Запрос;

	Если ДокументооборотСКОВызовСервера.ЭтоРежимОблачной1СО() Тогда
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	НастройкиИнтеграцииСУчетнымиСистемами.Получатель КАК Получатель
			|ИЗ
			|	РегистрСведений.НастройкиИнтеграцииСУчетнымиСистемами КАК НастройкиИнтеграцииСУчетнымиСистемами
			|ГДЕ
			|	НастройкиИнтеграцииСУчетнымиСистемами.Получатель ПОДОБНО &Получатель";
	Иначе
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Отчетность24Подключения.Получатель КАК Получатель
			|ИЗ
			|	РегистрСведений.Отчетность24БРОПодключения КАК Отчетность24Подключения
			|ГДЕ
			|	Отчетность24Подключения.Получатель ПОДОБНО &Получатель";
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("Получатель", "%_"+ ВРЕГ(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ИдентификаторБазы)));
	
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

// Возвращает наличие настроенных интеграций с приложениями
// 
// Возвращаемое значение:
// 	Булево 
Функция ЕстьНастроенныеПриложения()
	
	ИмяРегистра = "РегистрСведений.Отчетность24БРОПодключения";

	Если ДокументооборотСКОВызовСервера.ЭтоРежимОблачной1СО() Тогда
		ИмяРегистра = "РегистрСведений.НастройкиИнтеграцииСУчетнымиСистемами";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Таблица.Получатель КАК Получатель
		|ИЗ
		|	&ИмяРегистра КАК Таблица";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяРегистра", ИмяРегистра);
	
	УстановитьПривилегированныйРежим(Истина);

	Возврат Не  Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
	