Функция ВалютаРегламентированногоУчета() Экспорт 
	// --- 
	
	// МетаданныеБП
	УстановитьПривилегированныйРежим(Истина);
	Возврат(Константы.ВалютаРегламентированногоУчета.Получить());
	
	// --- 
КонецФункции

Функция ПредставлениеВалютыНаРусском(Валюта) Экспорт
	
	Если Валюта = CW_Настройки.ВалютаРегламентированногоУчета() 
		И Валюта.Код = "643" Тогда
		ПредставлениеВалютыНаРусском = "руб.";
	Иначе
		ПредставлениеВалютыНаРусском = Строка(Валюта);
	конецЕсли;
	
	Возврат ПредставлениеВалютыНаРусском;
	
КонецФункции