
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивПараметров = ПолучитьИзВременногоХранилища(Параметры.АдресВыбранныеКолонки);
	
	Если ТипЗнч(МассивПараметров) = Тип("Массив") тогда
		Для Каждого Параметр из МассивПараметров Цикл
			НоваяСтрока = СписокПараметров.Добавить();
			НоваяСтрока.Параметр = Параметр;
			НоваяСтрока.ИндексКартинки = ПолучитьИндексКартинки(Параметр);
		КонецЦикла;
	КонецЕсли;
	
	Параметры.Свойство("СуммированиеКоличества", 			СуммированиеКоличества);
	Параметры.Свойство("РасчитыватьЦенуПослеСвертки", 		РасчитыватьЦенуПослеСвертки);
	Параметры.Свойство("СворачиватьПоДокументуРасходов", 	СворачиватьПоДокументуРасходов);

КонецПроцедуры

&НаСервере
Функция ПолучитьИндексКартинки(Параметр) 
	
	// индекс картинки
	Если Параметр.ЭтоКонтрольнаяДата Тогда
		ИндексКартинки = 2;				
	ИначеЕсли Параметр.ДинамическийПараметр Тогда 
		ИндексКартинки = 3;
	Иначе
		ИндексКартинки = 1;
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции

&НаКлиенте
Процедура СписокПараметровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбораПараметраЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбораПараметраЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбораПараметраЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонеЦЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") тогда
		Для Каждого Параметр из ВыбранноеЗначение Цикл
			ДобавитьСтрокуПараметров(Параметр);
		КонецЦикла;
	Иначе
		ДобавитьСтрокуПараметров(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуПараметров(Параметр)
	
	Отбор = Новый Структура("Параметр", Параметр);
	мСтроки = СписокПараметров.НайтиСтроки(Отбор);
	Если мСтроки.Количество() = 0 Тогда
		НоваяСтрока = СписокПараметров.Добавить();
		НоваяСтрока.Параметр = Параметр;
		НоваяСтрока.ИндексКартинки = ПолучитьИндексКартинки(Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	СтруктураДанных = ВыбратьНаСервере();
	ЭтаФорма.Закрыть(СтруктураДанных);
КонецПроцедуры

&НаСервере
Функция ВыбратьНаСервере()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("РасчитыватьЦенуПослеСвертки", 	РасчитыватьЦенуПослеСвертки);
	СтруктураДанных.Вставить("СуммированиеКоличества", 			СуммированиеКоличества);
	СтруктураДанных.Вставить("СворачиватьПоДокументуРасходов", 	СворачиватьПоДокументуРасходов);
	СтруктураДанных.Вставить("Параметры", 						СписокПараметров.Выгрузить().ВыгрузитьКолонку("Параметр"));
	
	Возврат СтруктураДанных;
	
КонецФункции

