#Область ПрограммныйИнтерфейс

// Возвращает данные истории операций по счету цифрового рубля
//
// Параметры:
//  ДвоичныеДанныеФайла - Двоичные данные - данные файла с историей операций по счет ЦР
//  РеквизитыОрганизации - Структура - реквизиты организации, содержит поля:
//    * ИНН - Строка - ИНН организации
//    * КПП - Строка - КПП организации
//    * Наименование - Строка - наименование организации
//    * НомерСчета   - Строка - номер счета цифрового рубля (20 знаков)
//    * ИдентификаторЦифровогоСчета - Строка - идентификатор счета цифрового рубля (до 70 знаков)
//    * Организация  - СправочникСсылка.Организации - организация, по которой разбирается история операций
//
// Возвращаемое значение:
//  Структура - разобранные данные истории операций по счету ЦР, содержит значения:
//    * ДанныеИзБанка - Структура       - см. ОбменСБанкомВФормате1С.НовыйДанныеИзБанка()
//    * Протокол      - ТаблицаЗначений - см. ОбменСБанкомВФормате1С.НовыйПротоколЧтенияФайла()
//
Функция РазобратьВыпискуБанкаПоЦифровомуРублю(ДвоичныеДанныеФайла, РеквизитыОрганизации) Экспорт
	
	// По схеме cbdc.011.001.04_ReturnOrganisationWalletInfo_2026.07.xsd
	
	ДеревоДанных = ОбменСБанкамиЦифровойРубль.ДанныеИсторииОпераций(ДвоичныеДанныеФайла, РеквизитыОрганизации);
	ПрочитанныеДанныеСервиса = ДеревоВыписокБанкаВКоллекцию(ДеревоДанных, РеквизитыОрганизации);
	
	Возврат ПрочитанныеДанныеСервиса;
	
КонецФункции

Процедура ВыгрузитьПорученияПоЦР(ПотокВыгрузки, ПлатежныеДокументы, ИдентификаторСчета) Экспорт
	
	Данные = СформироватьПлатежныеДанные(ПлатежныеДокументы, ИдентификаторСчета);
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, Символы.Таб);
	ДанныеJSON = ОбщегоНазначенияБП.ЗначениеВСтрокуJSON(Данные, ПараметрыЗаписиJSON);
	
	ПотокВыгрузки.ЗаписатьСтроку(ДанныеJSON);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДеревоВыписокБанкаВКоллекцию(ДеревоДанных, РеквизитыОрганизации) Экспорт
	
	МассивСчетов = Новый Массив;
	ПрочитанныеДанныеСервиса = ЭлектронноеВзаимодействиеБПВызовСервера.ПрочитанныеДанныеВыпискиИзДерева(
		ДеревоДанных, РеквизитыОрганизации.Организация, МассивСчетов);
	
	Возврат ПрочитанныеДанныеСервиса;
	
КонецФункции

Функция ПериодДоступенПлатежОбменСЦифровымКошельком() Экспорт
	
	Период = '20250101';
	
	Возврат Период;
	
КонецФункции

Функция ДоступенПлатежОбменСЦифровымКошельком(Период) Экспорт
	
	Результат = ЗначениеЗаполнено(Период) И Период >= ПериодДоступенПлатежОбменСЦифровымКошельком();
	
	Возврат Результат;
	
КонецФункции

Функция БИКПлатформыЦифровогоРубля() Экспорт
	
	БИК = ОбменСБанкамиЦифровойРубль.БИКПлатформыЦифровогоРубля();
	
	Возврат БИК;
	
КонецФункции

Функция НомерСчетаПлатформыЦифровогоРубля() Экспорт
	
	Счет = ОбменСБанкамиЦифровойРубль.НомерСчетаПлатформыЦифровогоРубля();
	
	Возврат Счет;
	
КонецФункции

Функция НаименованиеПлатформыЦифровогоРубля() Экспорт
	
	Наименование = ОбменСБанкамиЦифровойРубль.НаименованиеПлатформыЦифровогоРубля();
	
	Возврат Наименование;
	
КонецФункции

Функция РеквизитыОператораПлатформыЦифровогоРубля() Экспорт
	
	Реквизиты = ОбменСБанкамиЦифровойРубль.РеквизитыОператораПлатформыЦифровогоРубля();
	
	Возврат Реквизиты;
	
КонецФункции

#Область ВидыОперацийЦР

// Перевод цифровой валюты от Клиента - ЮЛ  Клиенту - ЮЛ
//
Функция ОперацияB2B() Экспорт
	
	Возврат ОбменСБанкамиЦифровойРубль.ОперацияB2B(); // BTOB
	
КонецФункции

// Перевод цифровой валюты от Клиента - ФЛ  Клиенту - ЮЛ
//
Функция ОперацияC2B() Экспорт
	
	Возврат ОбменСБанкамиЦифровойРубль.ОперацияC2B(); // CTOB
	
КонецФункции

// Возврат цифровой валюты от Клиента - ЮЛ  Клиенту - ФЛ
//
Функция ОперацияB2C() Экспорт
	
	Возврат ОбменСБанкамиЦифровойРубль.ОперацияB2C(); // BTOC
	
КонецФункции

//Обмен Клиентом ЦР на безналичные средства
//
Функция ОперацияDCSE() Экспорт
	
	Возврат ОбменСБанкамиЦифровойРубль.ОперацияDCSE();
	
КонецФункции

// Обмен Клиентом безналичных средств на ЦР
//
Функция ОперацияDCBU() Экспорт
	
	Возврат ОбменСБанкамиЦифровойРубль.ОперацияDCBU();
	
КонецФункции

// Возврат цифровой валюты
//
Функция ОперацияDCRF() Экспорт
	
	Возврат ОбменСБанкамиЦифровойРубль.ОперацияDCRF();
	
КонецФункции

// Перевод Клиентом ЮЛ в бюджет
//
Функция ОперацияB2G() Экспорт
	
	Возврат ОбменСБанкамиЦифровойРубль.ОперацияB2G(); // BTOG
	
КонецФункции

// Выплата ЦР из бюджета Клиенту ЮЛ
//
Функция ОперацияG2B() Экспорт
	
	Возврат ОбменСБанкамиЦифровойРубль.ОперацияG2B(); // GTOB
	
КонецФункции

// Выплата Оператором по обращению СЛ или Клиента
//
Функция ОперацияOPTR() Экспорт
	
	Возврат ОбменСБанкамиЦифровойРубль.ОперацияOPTR();
	
КонецФункции

// Другие операции
//
Функция ОперацияOOPN() Экспорт
	
	Возврат ОбменСБанкамиЦифровойРубль.ОперацияOOPN();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПроцедурыИФункции

#Область ПлатежныеПорученияЦРСлужебная

Функция СформироватьПлатежныеДанные(ПлатежныеДокументы, ИдентификаторСчета)
	
	ДанныеПлатежей = Новый Структура;
	СписокПлатежей = Новый Массив;
	ДанныеОрганизации = Новый Структура;
	
	Если ПлатежныеДокументы.Количество() = 0 Тогда
		ДанныеПлатежей.Вставить("Org",      ДанныеОрганизации);
		ДанныеПлатежей.Вставить("Payments", СписокПлатежей);
		
		Возврат ДанныеПлатежей;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныеДокументы[0].ОрганизацияСчет, "Владелец");
		
		Если ПлатежныеДокументы[0].ОрганизацияЦифровойСчет Тогда
			НомерСчета = ПлатежныеДокументы[0].ОрганизацияНомерСчета;
		Иначе
			ВалютаРеглУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			БанковскиеСчетаЦифровые = Справочники.БанковскиеСчета.БанковскиеСчетаОрганизации(
				Владелец, ВалютаРеглУчета, , Истина);
			Если БанковскиеСчетаЦифровые.Количество() > 0 Тогда
				НомерСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскиеСчетаЦифровые[0].Ссылка, "НомерСчета");
			КонецЕсли;
		КонецЕсли;
		
		ОГРН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ОГРН");
		УстановитьПривилегированныйРежим(Ложь);
		
		ДанныеОрганизации.Вставить("Nm",           ПлатежныеДокументы[0].ОрганизацияКратко);
		ДанныеОрганизации.Вставить("WalletNumber", НомерСчета);
		ДанныеОрганизации.Вставить("WltId",        ИдентификаторСчета);
		ДанныеОрганизации.Вставить("INN",          ПлатежныеДокументы[0].ОрганизацияИНН);
		ДанныеОрганизации.Вставить("KPP",          ПлатежныеДокументы[0].ОрганизацияКПП);
		ДанныеОрганизации.Вставить("OGRN",         ОГРН);
		
		ДанныеПлатежей.Вставить("Org", ДанныеОрганизации);
	КонецЕсли;
	
	Для Каждого СтрокаДокумента Из ПлатежныеДокументы Цикл
		
		Если Не СтрокаДокумента.Выгружать Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеПлатежа = ПодготовитьДанныеПлатежа(СтрокаДокумента, ИдентификаторСчета);
		Если ДанныеПлатежа <> Неопределено Тогда
			
			СписокПлатежей.Добавить(ДанныеПлатежа);
			СтрокаДокумента.Готовность = -2;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеПлатежей.Вставить("Payments", СписокПлатежей);
	
	Возврат ДанныеПлатежей;
	
КонецФункции

Функция ПодготовитьДанныеПлатежа(СтрокаДокумента, ИдентификаторСчета)
	
	ДанныеПлатежа = Неопределено;
	
	Если СтрокаДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПереводНаДругойСчет Тогда
		Если СтрокаДокумента.КонтрагентИдентификаторЦифровогоСчета = ИдентификаторСчета Тогда
			ДанныеПлатежа = ПодготовитьДанныеПлатежаПополнениеСредствЦР(СтрокаДокумента);
		Иначе
			ДанныеПлатежа = ПодготовитьДанныеПлатежаВыводСредствЦР(СтрокаДокумента);
		КонецЕсли;
	ИначеЕсли СтрокаДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику
		Или СтрокаДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПрочиеРасчетыСКонтрагентами
		Или СтрокаДокумента.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю Тогда
		ДанныеПлатежа = ПодготовитьДанныеПлатежаB2B(СтрокаДокумента);
	КонецЕсли;
	
	Возврат ДанныеПлатежа;
	
КонецФункции

Функция ПодготовитьДанныеПлатежаВыводСредствЦР(СтрокаДокумента)
	
	ДанныеDCSE = Новый Структура;
	ДанныеDCSE.Вставить("TtlAmt", СтрокаДокумента.СуммаДокумента);
	ДанныеDCSE.Вставить("Tp",     "DCSE");
	ДанныеDCSE.Вставить("OprId",  СтрокаДокумента.Номер);
	
	ДанныеКонтрагента = Новый Структура;
	ДанныеКонтрагента.Вставить("AccountId", СтрокаДокумента.КонтрагентНомерСчета);
	ДанныеКонтрагента.Вставить("MmbId",     СтрокаДокумента.КонтрагентБИКБанка);
	
	ДанныеDCSE.Вставить("Recipient", ДанныеКонтрагента);
	
	Возврат ДанныеDCSE;
	
КонецФункции

Функция ПодготовитьДанныеПлатежаПополнениеСредствЦР(СтрокаДокумента)
	
	DCBU = Новый Структура;
	DCBU.Вставить("TtlAmt",    СтрокаДокумента.СуммаДокумента);
	DCBU.Вставить("Tp",        "DCBU");
	DCBU.Вставить("OprId",     СтрокаДокумента.Номер);
	DCBU.Вставить("AccountId", СтрокаДокумента.ОрганизацияНомерСчета);
	DCBU.Вставить("MmbId",     СтрокаДокумента.ОрганизацияБИКБанка);
	
	Возврат DCBU;
	
КонецФункции

Функция ПодготовитьДанныеПлатежаB2B(СтрокаДокумента)
	
	ДанныеB2BD = Новый Структура;
	ДанныеB2BD.Вставить("TtlAmt",  СтрокаДокумента.СуммаДокумента);
	ДанныеB2BD.Вставить("Tp",      "BTOB");
	ДанныеB2BD.Вставить("OprId",   СтрокаДокумента.Номер);
	
	Если ЗначениеЗаполнено(СтрокаДокумента.НазначениеПлатежа) Тогда
		НазначениеПлатежа = СтрЗаменить(СтрокаДокумента.НазначениеПлатежа, Символы.ПС + Символы.ВК, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ПС, " ");
		НазначениеПлатежа = СтрЗаменить(НазначениеПлатежа, Символы.ВК, " ");
		ДанныеB2BD.Вставить("Purpose", СокрЛП(НазначениеПлатежа));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДокумента.ИдентификаторПлатежа) Тогда
		ДанныеB2BD.Вставить("UIP", СтрокаДокумента.ИдентификаторПлатежа);
	КонецЕсли;
	
	ДанныеКонтрагента = Новый Структура;
	Если ЗначениеЗаполнено(СтрокаДокумента.КонтрагентИдентификаторЦифровогоСчета) Тогда
		ДанныеКонтрагента.Вставить("Type", "WALLETID");
		ДанныеКонтрагента.Вставить("Value", СтрокаДокумента.КонтрагентИдентификаторЦифровогоСчета);
		ДанныеКонтрагента.Вставить("Nm",    СтрокаДокумента.Контрагент);
	ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.КонтрагентНомерСчета) Тогда
		ДанныеКонтрагента.Вставить("Type", "WALLETNUMBER");
		ДанныеКонтрагента.Вставить("Value", СтрокаДокумента.КонтрагентНомерСчета);
		ДанныеКонтрагента.Вставить("Nm",    СтрокаДокумента.Контрагент);
	ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.КонтрагентОГРН)
		И ЗначениеЗаполнено(СтрокаДокумента.ИННПолучателя) Тогда
		ДанныеКонтрагента.Вставить("Type",  "REQUISITES");
		ДанныеКонтрагента.Вставить("OGRN",  СтрокаДокумента.КонтрагентОГРН);
		ДанныеКонтрагента.Вставить("INN",   СтрокаДокумента.ИННПолучателя);
		
		Если ЗначениеЗаполнено(СтрокаДокумента.КПППолучателя) Тогда
			ДанныеКонтрагента.Вставить("KPP", СтрокаДокумента.КПППолучателя);
		Иначе
			ДанныеКонтрагента.Вставить("KPP", СтрокаДокумента.КонтрагентКПП);
		КонецЕсли;
		
		ДанныеКонтрагента.Вставить("Nm",    СтрокаДокумента.Контрагент);
	Иначе
		// Нет данных
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеB2BD.Вставить("Recipient", ДанныеКонтрагента);
	
	Возврат ДанныеB2BD;
	
КонецФункции

#КонецОбласти

#КонецОбласти
