&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОтображаемоеИмяАдресаПриРассылке", ОтображаемоеИмяАдресаПриРассылке);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметры(Команда)  
	
	
	КодСостояния = CW_РаботаСВнешнимиРесурсамиСервер.ПроверитьПодключениеНаСервере();
	
	Если КодСостояния <> 200 Тогда
		ОписаниеКодовСостояний = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка подклчюения! Код: "+Строка(КодСостояния)+" - " + ОписаниеКодовСостояний.Получить(КодСостояния);
		Сообщение.Сообщить();
		
		ПоказатьПредупреждение(,"Не удалось подключиться");
	Иначе
		Ответ = ИзменитьОтображаемоеИмяАдресаПриРассылкеНаСервере(); 
		Если Ответ.КодСостояния = 200 Тогда  
			ЭтаФорма.Закрыть(ОтображаемоеИмяАдресаПриРассылке);
		Иначе
			ПоказатьПредупреждение(,Ответ.Тело,,"Изменение представления адреса электронной почты"); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ИзменитьОтображаемоеИмяАдресаПриРассылкеНаСервере()
	
	РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("displayname",	XMLСтрока(ОтображаемоеИмяАдресаПриРассылке));
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_changedisplayname", СтруктураJSON);
	HTTPОтвет 	= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST"); 
	Если HTTPОтвет = Неопределено Тогда
		Ответ = Новый Структура;
		Ответ.Вставить("КодСостояния", 	533);	
		Ответ.Вставить("Тело",			"Отсутствует инетрен-соединение");	
		Возврат Ответ;
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("КодСостояния", 	HTTPОтвет.КодСостояния);	
	Ответ.Вставить("Тело",			HTTPОтвет.ПолучитьТелоКакСтроку());	
	
	Возврат Ответ;
	
КонецФункции
