//см.CW_ОбновлениеКонфигурацииСервер.ПриДобавленииОбработчиков()
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт  
	
	ДобавитьПроцедурыОбновления(Обработчики);
	
	//"CW_РеестрыНДС0"
	Модуль_CW_РеестрыНДС0Служебный = CW_ОбщегоНазначения.ОбщийМодуль("CW_РеестрыНДС0Служебный");
	Если Модуль_CW_РеестрыНДС0Служебный <> Неопределено Тогда
		Модуль_CW_РеестрыНДС0Служебный.ПриДобавленииОбработчиковОбновления(Обработчики);
	КонецЕсли; 
	//"CW_РеестрыНДС0"    
	
	//CW_ДоходыНерезидентов
	Модуль_CW_ДоходыНерезидентовСлужебный = CW_ОбщегоНазначения.ОбщийМодуль("CW_ДоходыНерезидентовСлужебный");
	Если Модуль_CW_ДоходыНерезидентовСлужебный <> Неопределено Тогда
		Модуль_CW_ДоходыНерезидентовСлужебный.ПриДобавленииОбработчиковОбновления(Обработчики);
	КонецЕсли; 
	//CW_ДоходыНерезидентов 
	
	//CW_ОбменГИСЭПД
	Модуль_CW_ОбменГИСЭПДСлужебный = CW_ОбщегоНазначения.ОбщийМодуль("CW_ОбменГИСЭПДСлужебный");
	Если Модуль_CW_ОбменГИСЭПДСлужебный <> Неопределено Тогда
		Модуль_CW_ОбменГИСЭПДСлужебный.ПриДобавленииОбработчиковОбновления(Обработчики);
	КонецЕсли; 
	//CW_ОбменГИСЭПД 	
	
КонецПроцедуры


Процедура ДобавитьПроцедурыОбновления(Обработчики)
	
	//НачальноеЗаполнение
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_БухгалтерияЭкспедитораДляРоссииСлужебный.УстановитьПрофилиДоступаДляПолныхПрав";  
	НоваяСтрока.Версия 				= "8.3.14.3";
	НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитораДляРоссии";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Отложенно";
	НоваяСтрока.ОчередьВыполнения	= 9;
	НоваяСтрока.Наименование		= "Установить профили доступа для полных прав";
	НоваяСтрока.Комментарий			= "Устанавливает профили доступа для групп пользователей с признаком ""Полные права""";
	//---НачальноеЗаполнение
	
	
	////Версия 8.3.13.6
	// НоваяСтрока = Обработчики.Добавить();
	//НоваяСтрока.ИмяОбработчика  		= "CW_БухгалтерияЭкспедитораДляРоссииСлужебный.ЗаполнитьСлужебныеДоговора";  
	//НоваяСтрока.Версия 				= "8.3.13.6";
	//НоваяСтрока.ИмяПодсистемы 		= "CW_БухгалтерияЭкспедитораДляРоссии";
	//НоваяСтрока.НачальноеЗаполнение	= Ложь;
	//НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	//НоваяСтрока.РежимВыполнения		= "Отложенно";
	//НоваяСтрока.ОчередьВыполнения		= 9;
	//НоваяСтрока.Наименование			= "Заполнить служебные договора";
	//НоваяСтрока.Комментарий			= "Заполняет служебные договора Договоров по грузоперевозкам и Приложений к договорам в регистр ""Служебные договора""";
	////Версия 8.3.13.6
	
КонецПроцедуры   

Процедура УстановитьПрофилиДоступаДляПолныхПрав(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_ГруппыПользователей.УстановитьЗначениеИстинаДляПолныхПрав();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ГруппыПользователей.Ссылка КАК Ссылка,
	|	CW_ГруппыПользователей.РеестрыНДС0 КАК РеестрыНДС0,
	|	CW_ГруппыПользователей.ДоходыНерезидентов КАК ДоходыНерезидентов,
	|	CW_ГруппыПользователей.ОбменС1СЭПД КАК ОбменС1СЭПД
	|ИЗ
	|	Справочник.CW_ГруппыПользователей КАК CW_ГруппыПользователей
	|ГДЕ
	|	CW_ГруппыПользователей.ПолныеПрава = ИСТИНА";  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл    
		
		ПараметрыПроцедуры = Новый Структура;
		ПараметрыПроцедуры.Вставить("ГруппаПользователей", 	Выборка.Ссылка);
		ПараметрыПроцедуры.Вставить("РеестрыНДС0",			Выборка.РеестрыНДС0);
		ПараметрыПроцедуры.Вставить("ДоходыНерезидентов",	Выборка.ДоходыНерезидентов);
		ПараметрыПроцедуры.Вставить("ОбменС1СЭПД", 			Выборка.ОбменС1СЭПД);
		
		Справочники.CW_ГруппыПользователей.ОбновитьПрофилиПользователей(ПараметрыПроцедуры);
		
	КонецЦикла;
	
КонецПроцедуры