&НаКлиенте
Перем ПараметрТекущиейСтрокиДерева;

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов
	
	Параметры.Свойство("НеРассчитыватьСтатусыПриЗаписи", НеРассчитыватьСтатусыПриЗаписи);
	
	ПоказыватьПриложениеВБюджете = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам") 
									И ПолучитьФункциональнуюОпцию("CW_УказыватьДоговорДляПлановыхСтатейБюджета");
									
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("CW_Пользователь", 		ПараметрыСеанса.ТекущийПользователь);
	СтруктураПараметров.Вставить("CW_ГруппаПользователя", 	ГруппаПользователя);
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураПараметров);									
									
	Элементы.БюджетДоходыПриложениеКДоговору.Видимость = ПоказыватьПриложениеВБюджете;
	Элементы.БюджетРасходыПриложениеКДоговору.Видимость = ПоказыватьПриложениеВБюджете;
	
	НастрйкаОтображенияКолонкиКомментарий = ХранилищеСистемныхНастроек.Загрузить(ЭтаФорма.ИмяФормы,"ОтображенияКолонкиКомментарий");
	
	Если Не НастрйкаОтображенияКолонкиКомментарий = Неопределено Тогда
		НастрйкаОтображенияКолонкиКомментарий.Свойство("ПоказатьСкрытьКомментарий_Доходы", ПоказатьСкрытьКомментарий_Доходы);
		НастрйкаОтображенияКолонкиКомментарий.Свойство("ПоказатьСкрытьКомментарий_Расходы", ПоказатьСкрытьКомментарий_Расходы);
	КонецЕсли;
	
	// получим опции и права
	ИспользуетсяБлокировкаМониторинга 				= ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокировкиМониторинга");
	ВалютаРегламентированногоУчетаОтличнаОтРубля 	= НЕ ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	ИспользуетсяРеквизитКлиент 						= ПолучитьФункциональнуюОпцию("CW_ИспользованиеКлиент");
	ИспользуютсяПараметрыВЗаказах 					= ПолучитьФункциональнуюОпцию("CW_ИспользуютсяПараметрыВЗаказах");
	ИспользуетсяМониторингОборудования				= ПолучитьФункциональнуюОпцию("CW_ИспользованиеМониторингаОборудования");
	ВыполнятьПоискОборудования						= ПолучитьФункциональнуюОпцию("CW_ВыполнятьПоискОборудованияПриВводеПредставленияГрузоперевозки");
	АвтоматическиПодставлятьОборудование			= ПолучитьФункциональнуюОпцию("CW_АвтоматическиПодставлятьОборудованиеНаСлеженииВГрузоперевозку");
	
	Элементы.НадписьЗакрытие.Видимость 				= ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокировкиФинансов");   
	
	ОтображатьПараметрыЗаказаВГрузоперевозке 			= CW_Настройки.ПолучитьНастройкуПользователя(,"ОтображатьПараметрыЗаказаВГрузоперевозке");
	Элементы.ДПГПоказатьСкрытьПараметрыЗаказа.Пометка 	=  ОтображатьПараметрыЗаказаВГрузоперевозке;
	
	//Видимость отчета Ведомость перевыставления по ставкам    
	ИспользованиеСхемыПеревыставленияПоСтавкам = ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
	ПросмотрФинансов = CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов", ПараметрыСеанса.ТекущийПользователь);
	Элементы.Отчет_ВедомостьПеревыставленияПоСтавкам.Видимость = ИспользованиеСхемыПеревыставленияПоСтавкам и ПросмотрФинансов;
	//КОНЕЦ   

	// выполним действия в зависимости от опций и прав 	
	Элементы.ГруппаБлокировкаМониторинга.Видимость 			= ИспользуетсяБлокировкаМониторинга И НЕ Объект.Ссылка.Пустая();
	Элементы.ИзменитьДатуБлокировкиГрузоперевозок.Видимость = (НЕ ЗначениеЗаполнено(Объект.Заказ));
	_ОбновитьСтатусБлокировкиМониторинга();
	
	ЭтоНовыйОбъект = Параметры.Ключ.Пустая();
	
	Основание = Неопределено;
	Параметры.Свойство("Основание",Основание);
	ВводНаОсновании = ЗначениеЗаполнено(Основание);
	
	Попытка
		Заявка = Параметры.ЗначенияЗаполнения.Заявка;
	Исключение
	    Заявка = Неопределено;
	КонецПопытки; 
	
	Если (Заявка <> Неопределено) Тогда
		ВводНаОсновании = Истина;
		ВводНаОснованииЗаявки = Истина;
	КонецЕсли; 
	
	Если (Объект.ГруппыПараметровГрузоперевозки.Количество()=0) Тогда
		
		НастоящийОбъект = РеквизитФормыВЗначение("Объект");
		НастоящийОбъект.ПроверитьИерархиюПараметров();
		ЗначениеВРеквизитФормы(НастоящийОбъект,"Объект");
		
	КонецЕсли; 
	
	// кэшируем свойства параметров
	_ОбновитьСвойстваПараметров();
	
	КартаСвойствПараметров = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	Если (_сф.ст_ПолучитьСвойство(Параметры, "ОчищатьФактическиеДаты")=Истина) Тогда
		Для каждого СтрокаПараметра Из Объект.ПараметрыГрузоперевозки Цикл
			СП = КартаСвойствПараметров.Получить(СтрокаПараметра.Параметр);
			Если (СП.ЭтоКонтрольнаяДата) Тогда
				СтрокаПараметра.ЗначениеФакт = Дата(1,1,1);
				СтрокаПараметра.Значение = СтрокаПараметра.ЗначениеПлан;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Если (ЗначениеЗаполнено(Объект.ОтслеживаемоеОборудование)) Тогда
		_ОбновитьСписокПараметровОтслеживаемогоОборудования();
	КонецЕсли; 
	
	//Подсистема.ЛогистическиеСтатусы
	ИспользоватьЛогистическиеСтатусыГрузоперевозок = ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыГрузоперевозок");   
	Если ИспользоватьЛогистическиеСтатусыГрузоперевозок Тогда
	CW_ЛогистическиеСтатусыСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	//Подсистема.ЛогистическиеСтатусы
	
	//Подсистема.ФинансовыеСтатусы
	ИспользоватьФинансовыеСтатусыГрузоперевозок = ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок");
	Если ИспользоватьФинансовыеСтатусыГрузоперевозок Тогда
		CW_ФинансовыеСтатусыСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	//Подсистема.ФинансовыеСтатусы
	
	//РаботаСАрхивомОбъектов    
	CW_АрхивОбъектовСервер.ПриСозданииНаСервере(ЭтаФорма);
	//РаботаСАрхивомОбъектов  
	
	
	// выполнение действий при открытии формы
	#Область ОбластьИнициализацияФормы
	
		Инициализировать = Ложь;
		Если (НЕ Параметры.ЗначениеКопирования.Пустая()) Тогда
			
			Если Параметры.Ключ.Пустая() Тогда
				
				НастройкиПользователя = CW_Настройки.ПолучитьНастройкиПользователя(ПараметрыСеанса.ТекущийПользователь);
				
				Если НастройкиПользователя.ОчищатьПредставлениеГрузоперевозкиПриКопировании Тогда
					Объект.CW_Представление = "";
				КонецЕсли;
				
				Если НастройкиПользователя.УстанавливатьТекущуюДатуГрузоперевозкиПриКопировании Тогда
					Объект.ДатаСделкиФ = ТекущаяДата();
				КонецЕсли;
				
			КонецЕсли;
	
			ОбъектКопирования = Параметры.ЗначениеКопирования;
			Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования")) Тогда
				РежимКопирования = Истина;
				ВыполнитьДействиеНаСервере(_УФКС.СД("Грузоперевозки","сервер","/ОтборДокументовФинансовогоРезультата"));
			Иначе
				Инициализировать = Истина;
			КонецЕсли; 
		Иначе
			Инициализировать = Истина;
		КонецЕсли; 
		Если (Инициализировать) Тогда
			
			// логика, связанная с доступностью (видимостью) в зависимости от прав пользователя,
			// отрабатывается в этой процедуре
			ВыполнитьДействиеНаСервере(_УФКС.СД("Грузоперевозки","сервер","/ИнициализацияФормы"));
		КонецЕсли; 
	
	#КонецОбласти 
	
	Элементы.ПерезаполнитьРеквизитыШапкиПоЗаказу.Доступность = Не Элементы.ГруппаШапка.ТолькоПросмотр;
	
	// ---
	ЗагрузитьСеансовуюНастройкуДеклараций();
	// ---
	
	//Элементы.ФормаВнешниеДействия.Видимость = (_СписокДействий().Количество() <> 0);
	
	стНастроек = ХранилищеСистемныхНастроек.Загрузить("Грузоперевозки", "ОтображатьПостатейно");
	Если стНастроек <> Неопределено Тогда
		ФинансыДоходыОтображатьПостатейно  		= _сф.ст_ПолучитьСвойство(стНастроек, "ОтображатьПостатейно");
		ФинансыРасходыОтображатьПостатейно 		= _сф.ст_ПолучитьСвойство(стНастроек, "ОтображатьПостатейно");
		ФинансыТранспортОтображатьПостатейно 	= _сф.ст_ПолучитьСвойство(стНастроек, "ОтображатьПостатейно");
	КонецЕсли;	
	
	_ОбновитьПодсказкуКоманды();
	
	//Заполнение списка выбора элемента
	Если ВалютаРегламентированногоУчетаОтличнаОтРубля Тогда
		Элементы.ВыводФинрезультата.СписокВыбора.Очистить();
		Элементы.ВыводФинрезультата.СписокВыбора.Добавить(1, "По счетам");
		ОтображениеФинансовогоРезультата = 1;
	КонецЕсли;
	
	Если ЭтоНовыйОбъект Тогда
		
		//Времено на переходный период
		//Для новых объектов уже используется новый механизм хранения данных
		СлужебныйВыполненПереход = Истина;
		//Времено на переходный период
		
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
		//Заполнение предопределенных параметров
		МассивИменРеквизитов = Новый Массив;
		МассивИменРеквизитов.Добавить("ТипПеревозки");
		МассивИменРеквизитов.Добавить("Типоразмер");
		МассивИменРеквизитов.Добавить("МенеджерПродаж");
		МассивИменРеквизитов.Добавить("ОперативныйМенеджер");
		МассивИменРеквизитов.Добавить("Клиент");
		МассивИменРеквизитов.Добавить("Маршрут");
		МассивИменРеквизитов.Добавить("Груз");
		
		Для Каждого РеквизитМассива из МассивИменРеквизитов Цикл
			Если ЗначениеЗаполнено(Объект[РеквизитМассива]) Тогда
				_ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект[РеквизитМассива],РеквизитМассива);
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Объект.ТипПеревозки) Тогда
			_ЗаполнитьПараметрыПоТипуПеревозки(0);
			_УФС.ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(Объект, Объект.ТипПеревозки, "ДляГрузоперевозки");
		КонецЕсли;
		
		_ОбновитьДеревоПараметров();
		ПересчитатьДинамическиеПараметры();
		
	КонецЕсли;
	
	Элементы.БюджетДоходыКомментарий.Видимость  = ПоказатьСкрытьКомментарий_Доходы;
	Элементы.БюджетРасходыКомментарий.Видимость = ПоказатьСкрытьКомментарий_Расходы;
	
	Элементы.БюджетРасходыПоказатьСкрытьКомментарий_Расходы.Пометка = ПоказатьСкрытьКомментарий_Расходы;
	Элементы.БюджетДоходыПоказатьСкрытьКомментарий_Доходы.Пометка 	= ПоказатьСкрытьКомментарий_Доходы;
	
	Элементы.БюджетРасходыСуммаРуб.Заголовок 		= "Сумма, "+?(ЗначениеЗаполнено(ВРУ),СокрЛП(ВРУ), "-");
	Элементы.БюджетРасходыСуммаВсегоРуб.Заголовок   = "Всего, "+?(ЗначениеЗаполнено(ВРУ),СокрЛП(ВРУ), "-");
	Элементы.БюджетДоходыСуммаРуб.Заголовок			= "Сумма, "+?(ЗначениеЗаполнено(ВРУ),СокрЛП(ВРУ), "-");
	Элементы.БюджетДоходыСуммаВсегоРуб.Заголовок	= "Всего, "+?(ЗначениеЗаполнено(ВРУ),СокрЛП(ВРУ), "-");
	
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования") Тогда
		ДобавитьПодключаемыеКоманды();
	КонецЕсли;

	ЗаявкаПриИзмененииНаСервере();
	
	СтараяЗаявка = Объект.Заявка;
	СтарыйЗаказ  = Объект.Заказ;
	
	УстановитьПараметрыДинамическогоСписка();
	УстановитьИтогиДинамическогоСписка();   
	
	//Использование количества
	ИспользованиеКоличестваДляПлановыхСтатей 			= ПолучитьФункциональнуюОпцию("CW_ИспользованиеКоличестваДляПлановыхСтатей");
	ПолучениеКоличестваУслугИзПараметраГрузоперевозки 	= ПолучитьФункциональнуюОпцию("CW_РазрешитьПолучениеКоличестваУслугИзПараметраГрузоперевозки");

	Элементы.ОбновитьКоличествоРасходы.Видимость = ИспользованиеКоличестваДляПлановыхСтатей и ПолучениеКоличестваУслугИзПараметраГрузоперевозки; 
	Элементы.ОбновитьКоличествоДоходы.Видимость  = ИспользованиеКоличестваДляПлановыхСтатей и ПолучениеКоличестваУслугИзПараметраГрузоперевозки;
	//Использование количества   
	
	//ПрогнозОплаты
	ИспользуетсяПрогнозированиеДДСПоБюджету = 	ПолучитьФункциональнуюОпцию("CW_ИспользуетсяПрогнозированиеДДСПоБюджету");
	//ПрогнозОплаты    
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	ДополнительныеСвойстваФормы = Новый Структура();               
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ХранениеПолногоЗначения
	Для Каждого СтрокаОбъекта из ТекущийОбъект.ПараметрыГрузоперевозки Цикл 
		ДобавитьСохраняемоеПолноеЗначение(СтрокаОбъекта.Параметр, СтрокаОбъекта.ХранилищеДанных.Получить());  
	КонецЦикла;
	//---ХранениеПолногоЗначения
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьПараметрыДинамическогоСписка()
	
	ОтчетЭкспедитора.Параметры.УстановитьЗначениеПараметра("Грузоперевозка",Объект.Ссылка); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИтогиДинамическогоСписка()
	
	СтруктураИтоговОтчетЭкспедитора = CW_БухгалтерияЭкспедитораСерверПереопределяемый.ИтогиДинамическогоСписка(ОтчетЭкспедитора, "КоличествоЗаписей");
	
	Элементы.СтраницаОтчетЭкспедитора.Заголовок = "Отчет экспедитора "+?(СтруктураИтоговОтчетЭкспедитора.КоличествоЗаписей = Null,	"",	" ("+СтруктураИтоговОтчетЭкспедитора.КоличествоЗаписей+")"); 
	
КонецПроцедуры

&наСервере
Процедура _ОбновитьПодсказкуКоманды()
	
	ЭтаФорма.Команды.ПерезаполнитьРеквизитыШапкиПоЗаказу.Подсказка = ?(ЗначениеЗаполнено(Объект.Заказ),"Перезаполнить реквизиты шапки по заказу","Создать заказ на основании грузоперевозки");
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьСвойстваПараметров()
	// --- 
	
	КартаПравПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	АдресКартыПравПараметров = ПоместитьВоВременноеХранилище(КартаПравПараметров, ЭтаФорма.УникальныйИдентификатор);
	// --- 
	КартаСвойствПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
	АдресКартыСвойствПараметров = ПоместитьВоВременноеХранилище(КартаСвойствПараметров, ЭтаФорма.УникальныйИдентификатор);
	
	// --- 
КонецПроцедуры
 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	ПОВ_БазоваяЛогика = Новый ОписаниеОповещения("ПриОткрытииБазоваяЛогика",ЭтотОбъект);
	
	Если (РежимКопирования ИЛИ ВводНаОснованииЗаявки) Тогда
		
		Если (РежимКопирования) Тогда
			
			ПОВ_Отказ = Новый ОписаниеОповещения("ОбработкаКопированияОтказ",ЭтотОбъект);
			ПОВ_Обработка = Новый ОписаниеОповещения("ОбработкаКопированияГрузоперевозки",ЭтотОбъект,Новый Структура("ПОВ_БазоваяЛогика,ПОВ_Отказ",ПОВ_БазоваяЛогика,ПОВ_Отказ));
			// --- 
			ПФ = Новый Структура("ОбъектКопирования,УИД",ОбъектКопирования,ЭтаФорма.УникальныйИдентификатор);
			ОткрытьФорму("ОбщаяФорма.CW_ФормаКопированияАналитики",ПФ,,,,,ПОВ_Обработка,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
		Иначе
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаКопированияБюджетаПоЗаявке",ЭтотОбъект, Новый Структура()); 
			//ПоказатьВопрос(ПОВ,"Копировать бюджет?",РежимДиалогаВопрос.ДаНет); 
			ВыполнитьОбработкуОповещения(ПОВ,КодВозвратаДиалога.Нет); 
			
		КонецЕсли; 
		
				
	Иначе
		
		ВыполнитьОбработкуОповещения(ПОВ_БазоваяЛогика);
		
	КонецЕсли;
	
	//Если НЕ CW_Настройки.ПолучитьНастройкуПользователя( , "ВыводитьКурсПланирования") Тогда
	//	Элементы.БюджетДоходыКурс.Видимость = Ложь;
	//	//Элементы.БюджетДоходыПиктограммаКурса.Видимость = Ложь;
	//	Элементы.БюджетРасходыКурс.Видимость = Ложь;		
	//	//Элементы.БюджетРасходыПиктограммаКурса.Видимость = Ложь;
	//КонецЕсли;	
	
	ДПГ_ВосстановитьСостояниеСвертки();

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКопированияГрузоперевозки(Ответ,ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ = Неопределено) Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ_Отказ);
		Возврат;
		
	Иначе
		
		АдресНастроекКопирования = Ответ;
		Попытка    
			ЗаполнитьПараметрыПоНастройке(АдресНастроекКопирования);
			ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/ИнициализацияФормы"));
			ЭтаФорма.Записать();
			
		Исключение
			Сообщить(ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоНастройке(АдресНастроекКопирования)
	
	ПараметрыСоздания = ПолучитьИзВременногоХранилища(АдресНастроекКопирования);
	
	Если ПараметрыСоздания.СпособЗаполненияПараметровГрузоперевозкиПриКопировании = 0 Тогда
		   _ЗаполнитьПараметрыПоТипуПеревозки(1);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКопированияОтказ(Ответ,ДополнительныеПараметры) Экспорт
	// --- 
	
	ЭтаФорма.Закрыть();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаКопированияБюджетаПоЗаявке(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			Если Не БюджетЗаявкиВалиден() тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВалидностиБюджета",ЭтотОбъект); 
				ПоказатьВопрос(ОписаниеОповещения,"Бюджет заявки просрочен. Копировать бюджет?",РежимДиалогаВопрос.ДаНет);
			Иначе
				КопироватьБюджетЗаявки = Истина;
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 
	ПриОткрытииБазоваяЛогика(Истина,Неопределено);
	
	// --- 
КонецПроцедуры

&наСервере
Функция БюджетЗаявкиВалиден()
	
	СрокДействияБюджета = Объект.Заявка.ВариантБюджета.СрокДействия;
	
	Возврат	СрокДействияБюджета >= НачалоДня(ТекущаяДата()) или Не ЗначениеЗаполнено(СрокДействияБюджета);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВалидностиБюджета(Ответ,ДополнительныеПараметры) Экспорт
	
	Если (Ответ <> Неопределено) Тогда
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			КопироватьБюджетЗаявки = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытииБазоваяЛогика(Ответ,ДополнительныеПараметры) Экспорт
	
	//// формируем дерево
	ОбновитьДеревоПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СеансовыеНастройки = Новый Структура("ФинансыРасходыОтображатьПостатейно,ФинансыТранспортОтображатьПостатейно,ФинансыДоходыОтображатьПостатейно",ФинансыРасходыОтображатьПостатейно,ФинансыТранспортОтображатьПостатейно, ФинансыДоходыОтображатьПостатейно);
	_УФС.СохранитьСеансовыеНастройки(ЭтаФорма,,СеансовыеНастройки);
	// --- 
	_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"ИнтерактивныйРежим", Истина);
	// --- 
	Если (ТекущийОбъект.Ссылка.Пустая() И ЗначениеЗаполнено(ТекущийОбъект.Заявка) И ВводНаОсновании) Тогда
		_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"ПеренестиБюджетИзЗаявки",КопироватьБюджетЗаявки);
	КонецЕсли; 
	// --- 
	Если (АдресНастроекКопирования <> "") Тогда
		
		_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"АдресНастроекКопирования",АдресНастроекКопирования);
		
	КонецЕсли; 
	
	Если Не ИспользуетсяРеквизитКлиент тогда
		
		ПараметрПлательщика = Константы.CW_ПараметрПлательщика.Получить();
		
		Если ЗначениеЗаполнено(ПараметрПлательщика) Тогда
			
			СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ТекущийОбъект, ПараметрПлательщика);
			Если Не СтрокаПараметра = Неопределено Тогда
				ТекущийОбъект.Клиент = СтрокаПараметра.Значение;
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Запись данных харнилища занчений по строкам 
	Для Каждого ЭлементСписка из СписокАдресовЗначенийПараметров Цикл
		
		//ДанныеПоАдресу - тип "Структура("Параметр, ТаблицаДанных")
		ДанныеПоАдресу = ЭлементСписка.Значение;
		
		Отбор = Новый Структура("Параметр", ДанныеПоАдресу.Параметр);
		мСтроки = ТекущийОбъект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
		Если мСтроки.Количество() > 0 Тогда
			//Предполагаем что строка будет только одна
			СтрокаДанных = мСтроки[0]; 
			Если ТипЗНЧ(ДанныеПоАдресу.ДанныеДляХранения) = Тип("ДанныеФормыКоллекция") Тогда
				СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(ДанныеПоАдресу.ДанныеДляХранения.Выгрузить());	
			Иначе
				СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(ДанныеПоАдресу.ДанныеДляХранения);	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;  
	
	//ХранениеПолногоЗначения 
	Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда 
		Для Каждого КлючЗначение из СохраняемоеПолноеЗначение Цикл
			Отбор = Новый Структура("Параметр", КлючЗначение.Ключ);
			НайденныеСтроки = ТекущийОбъект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				//Предполагаем что строка будет только одна
				СтрокаДанных = НайденныеСтроки[0];   
				СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(КлючЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//---ХранениеПолногоЗначения
	
	
	//Перенесем ДополнительныеСвойстваФормы в ДополнительныеСвойства объекта
	Для Каждого Свойство Из ДополнительныеСвойстваФормы Цикл
		_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,Свойство.Ключ,Свойство.Значение);               			
	КонецЦикла; 
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СтараяЗаявка", 	СтараяЗаявка);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СтарыйЗаказ", 	СтарыйЗаказ);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	
	//Подсистема.ЛогистическиеСтатусы
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	CW_ЛогистическиеСтатусыСервер.ПослеЗаписиНаСервере(ЭтаФорма);
	//Подсистема.ЛогистическиеСтатусы
	
	//Подсистема.ФинансовыеСтатусы
	CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
	CW_ФинансовыеСтатусыСервер.ПослеЗаписиНаСервере(ЭтаФорма);
	//Подсистема.ФинансовыеСтатусы   
	
	//ПрогнозОплаты
	Если ИспользуетсяПрогнозированиеДДСПоБюджету Тогда
		CW_Бюджетирование.РассчитатьПрогнозОплаты(Объект.Ссылка);
	КонецЕсли;
	//ПрогнозОплаты

	Если (ЗначениеЗаполнено(объект.Заказ)) Тогда
		Справочники.CW_Заказы.ПроверитьСоответствиеРеквизитов(объект.Заказ);	
	КонецЕсли; 
	АдресНастроекКопирования = _сф.ст_ПолучитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"АдресНастроекКопирования");
	Если (ЭтоНовыйОбъект) Тогда
		
		Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам")) Тогда
			ВыполнитьДействиеНаСервере(_УФКС.СД("Грузоперевозки","сервер","/ОтборДокументовФинансовогоРезультата"));	
		КонецЕсли; 
		Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеМеханизмаСвязейГрузоперевозок")) Тогда
			ВыполнитьДействиеНаСервере(_УФКС.СД("Грузоперевозки","сервер","/ОтборСвязей"));	
		КонецЕсли; 
		ВыполнитьДействиеНаСервере(_УФКС.СД("Грузоперевозки","сервер","/УправлениеЭлементамиФормы"));
		// --- 
		ЭтоНовыйОбъект = Ложь;
		
	КонецЕсли; 
	// ---
	//ВыполнитьДействиеНаСервере(_УФКС.СД("Грузоперевозки","сервер","/Заголовок"));
	
	//РаботаСАрхивомОбъектов
	CW_АрхивОбъектовСервер.ПослеЗаписиНаСервере(ЭтаФорма);
	//РаботаСАрхивомОбъектов

	ДополнительныеСвойстваФормы = Новый Структура();               

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если (НЕ ЗакрытиеФормы) Тогда
		ОбновитьДеревоПараметров();
		
		СтараяЗаявка = Объект.Заявка;
		СтарыйЗаказ  = Объект.Заказ;
		
	Иначе
		ЗакрытиеФормы = Ложь;
	КонецЕсли; 
	
	ОповеститьОЗаписиНового(Объект.Ссылка);
	Оповестить("ЗаписьСправочника",Объект.Ссылка,"Справочник.CW_Грузоперевозки");
	Оповестить("Запись_CW_Грузоперевозки", Новый Структура("Объект",Объект.Ссылка), "Справочник.CW_Грузоперевозки");

	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/ПраваДоступа"));
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		СтруктураНастройки = Новый Структура;
		СтруктураНастройки.Вставить("ПоказатьСкрытьКомментарий_Доходы"	, ПоказатьСкрытьКомментарий_Доходы);
		СтруктураНастройки.Вставить("ПоказатьСкрытьКомментарий_Расходы"	, ПоказатьСкрытьКомментарий_Расходы);
		СохранитьНастройкиНаСервере(ЭтаФорма.ИмяФормы, СтруктураНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиНаСервере(ИмяТекущейФормы, СтруктураНастройки)
	
	ХранилищеСистемныхНастроек.Сохранить(ИмяТекущейФормы,"ОтображенияКолонкиКомментарий", СтруктураНастройки);
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область МеханизмДействий 

&НаКлиенте
Процедура ВыполнитьДействия(Результат,ДополнительныеПараметры) Экспорт 
	// --- 
	
	ВыполнитьДействие(Результат);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьДействие(Действия)
	// --- 
	
	Если (Действия = Неопределено) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	
	Если (ТипЗнч(Действия)=Тип("Структура")) Тогда
		МассивДействий = Новый Массив;
		МассивДействий.Добавить(Действия);
	Иначе
		МассивДействий = Действия;
	КонецЕсли; 
	МассивОтветов = Новый Массив;
	
	Для каждого СтруктураДействия Из МассивДействий Цикл
		
		Если (СтруктураДействия = Неопределено) Тогда
			
			Продолжить;
			
		КонецЕсли; 
		// --- 
		Если (НЕ ЗначениеЗаполнено(СтруктураДействия.Модуль)) Тогда
			Сообщить("Ошибка: не указан модуль действия для команды """+СтруктураДействия.Команда+"""");
		КонецЕсли; 
		Если (НЕ ЗначениеЗаполнено(СтруктураДействия.Выполнение)) Тогда
			Сообщить("Ошибка: не указан вариант выполнения для команды """+СтруктураДействия.Команда+"""");
			Возврат(Неопределено);
		КонецЕсли; 
		
		// ---------------------------------------------------------------------------- 
		
		Если (СтруктураДействия.Выполнение = "клиент") Тогда
			
			ПОВ = Новый ОписаниеОповещения("ВыполнитьДействия",ЭтотОбъект);
			
			Если (СтруктураДействия.Модуль = "Грузоперевозки") Тогда
				
				Ответ = CW_Грузоперевозки_Клиент.ВыполнитьДействие(ЭтаФорма,СтруктураДействия, ПОВ);
				
			ИначеЕсли (СтруктураДействия.Модуль = "Журналы") Тогда 
				
				Ответ = CW_Журналы_Клиент.ВыполнитьДействие(ЭтаФорма,СтруктураДействия, ПОВ);
				
			КонецЕсли;
			
		ИначеЕсли (СтруктураДействия.Выполнение = "сервер") Тогда 
			
			Ответ = ВыполнитьДействиеНаСервере(СтруктураДействия);
			
		КонецЕсли;
		
		Если (Ответ <> Неопределено) Тогда
			Если (ТипЗнч(Ответ)=Тип("Структура")) Тогда
				МассивОтветов.Добавить(Ответ);
			Иначе
				Для каждого ЭлементОтвета Из Ответ Цикл
					МассивОтветов.Добавить(ЭлементОтвета);
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если (МассивОтветов.Количество() <> 0) Тогда
		Возврат(ВыполнитьДействие(МассивОтветов)); 
	Иначе
		Возврат(Неопределено);
	КонецЕсли; 
	
	// --- 
КонецФункции
  
&НаСервере
Функция ВыполнитьДействиеНаСервере(СтруктураДействия)
	// --- 
	
	Если (СтруктураДействия.Модуль = "Грузоперевозки") Тогда
		Возврат(CW_Грузоперевозки_Сервер.ВыполнитьДействие(ЭтаФорма,СтруктураДействия));
	ИначеЕсли (СтруктураДействия.Модуль = "Журналы") Тогда 
		Возврат(CW_Журналы_Сервер.ВыполнитьДействие(ЭтаФорма,СтруктураДействия));	
	КонецЕсли; 
	
	// --- 
КонецФункции

// Обработка событий для всех кнопок панели
&НаКлиенте
Процедура ФормаДействие(Команда)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент",СтрЗаменить(Команда.Имя,"Форма_","/"),Неопределено));
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область Форма 

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если (ТекущаяСтраница = Элементы.СтраницаФинансы) Тогда
		
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/ФинансыОбновить"));
		
		Элементы.ФинансыДоходыГруппаВводНаОсновании.Доступность		= ФинансыДоходы.Количество() > 0	и Не ЗначениеЗаполнено(ДатаЗакрытия);
		Элементы.ФинансыРасходыГруппаВводНаОсновании.Доступность	= ФинансыРасходы.Количество() > 0 	и Не ЗначениеЗаполнено(ДатаЗакрытия);
		
	ИначеЕсли (ТекущаяСтраница = Элементы.СтраницаБюджет) Тогда
		
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
		
		//Сортировка бюджетов
		ВосстановитьСортировкуТаблицы("БюджетРасходы");
		ВосстановитьСортировкуТаблицы("БюджетДоходы");
		//Сортировка бюджетов
		
		//Использование количества
		УстановитьДоступностьОбновленияКоличестваНаСервере();
		//Использование количества
		
	ИначеЕсли (ТекущаяСтраница = Элементы.СтраницаДекларации) Тогда
		
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/ДекларацииОбновить"));
		
	КонецЕсли; 
	
КонецПроцедуры  

#КонецОбласти 

#Область Реквизиты 

&НаКлиенте
Процедура ПредставлениеПриИзменении(Элемент)
	
	Если (ПроверятьНомерКонтейнера) Тогда 
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/ПроверитьНомерКонтейнера"));
	КонецЕсли;
	
	Если ВыполнятьПоискОборудования И ИспользуетсяМониторингОборудования И ЗначениеЗаполнено(Объект.CW_Представление) Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьНаличиеОборудования",0.1,Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Форма_ПроверитьНомерГрузоперевозки(Команда)
	
	МассивДоступных = _МассивДоступных();
	Если МассивДоступных.Количество() <> 0 Тогда
		ПФ = Новый Структура("РежимВыбора,МассивДоступных",Истина,МассивДоступных);
		ОткрытьФорму("Обработка.CW_ЖурналГрузоперевозок.Форма.Форма",ПФ, ЭтаФорма,Истина,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		_УФК.ВывестиПредупреждение("Грузоперевозок со сходным представлением не найдено.");
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Функция _МассивДоступных()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	               |	CW_Грузоперевозки.Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.CW_Представление ПОДОБНО &Наименование
	               |	И CW_Грузоперевозки.Ссылка <> &Ссылка";

	Запрос.УстановитьПараметр("Наименование", СокрЛП(Объект.CW_Представление));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ДатаСделкиФПриИзменении(Элемент)
	
	Если (Объект.ДатаСделкиФ=Дата(1,1,1)) Тогда
		
		Объект.ДатаСделкиФ=ТекущаяДата();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	
	// проверяем, что заказ не заблокирован
	Если (_ЗаказЗаблокирован()) Тогда
		Объект.Заказ = Неопределено;
		ПоказатьПредупреждение(,"Заказ заблокирован.");
		Возврат;
	КонецЕсли; 
	
	// если по заказу утверждён бюджет, а мы подключаем к нему эту грузоперевозку - надо обновить данные утверждения бюджета из заказа
	ВыполнитьДействие(_уфкс.СД("Грузоперевозки","сервер","/БюджетИнициализация"));
	Если (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаБюджет) Тогда
		ВыполнитьДействие(_уфкс.СД("Грузоперевозки","клиент","/БюджетОбновить"));
	КонецЕсли; 
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/УправлениеЭлементамиФормы"));
	
	_ОбновитьПодсказкуКоманды();
	
	Если ИспользуютсяПараметрыВЗаказах и ЗначениеЗаполнено(Объект.Заказ) Тогда
		_ОбновитьСписокПараметровОтслеживаемогоОборудования();
		ОбновитьДеревоПараметров();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция _ЗаказЗаблокирован()
	// --- 
	
	Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокировкиМониторинга")) Тогда
		Возврат(ЗначениеЗаполнено(CW_Мониторинг.ПолучитьДатуЗакрытияМониторинга(Объект.Заказ)));
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура ПерезаполнитьРеквизитыШапкиПоЗаказу(Команда)
	
	Если (ЗначениеЗаполнено(Объект.Заказ)) Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаполнитьГрузоперевозку", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение,"Заполнить грузоперевозку по текущему заказу? ", Режим, 0); 
		
	Иначе
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСформироватьЗаказ", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение,"Создать заказ на основании текущей грузоперевозки? ", Режим, 0); 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура _ЗаполнитьГрузоперевозку()
	
	Результат = _ПерезаполнитьРеквизитыШапкиПоЗаказу();
	Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
		
		ТребуетсяПерезаполнениеПараметровПоТипу = Ложь;
		Результат.Свойство("ТребуетсяПерезаполнениеПараметровПоТипу",ТребуетсяПерезаполнениеПараметровПоТипу);
		Если (ТребуетсяПерезаполнениеПараметровПоТипу = Истина) Тогда
			
			ДиалогЗаполненияПоТипу();
			
		Иначе
			
			ОбновитьДеревоПараметров();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаполнитьГрузоперевозку(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	_ЗаполнитьГрузоперевозку();  
	_ОбновитьПодсказкуКоманды();
	
	ЭтотОбъект.Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаСформироватьЗаказ(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	_СоздатьЗаказНаСервере();
	_ОбновитьПодсказкуКоманды();
	
	ЭтотОбъект.Модифицированность = Истина;

КонецПроцедуры

&НаСервере
ФункциЯ _ПолучитьСтркутуруШапкиЗаказ()
	
	мдЗаказ = Метаданные.Справочники.CW_Заказы;
	
	СтруктураРеквизитов = Новый Структура;
	
	Для Каждого Реквизит из мдЗаказ.Реквизиты Цикл
		
		СтруктураРеквизитов.Вставить(Реквизит.Имя,Неопределено);
		
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Объект);
	
	Возврат СтруктураРеквизитов;
		
КонецФункции

&НаСервере
Процедура _СоздатьЗаказНаСервере()
	
	СтруктураШапкиЗаказа = _ПолучитьСтркутуруШапкиЗаказ();
	
	НовыйЗаказ = Справочники.CW_Заказы.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(НовыйЗаказ, СтруктураШапкиЗаказа);
	
	НовыйЗаказ.Записать();
	
	Объект.Заказ = НовыйЗаказ.Ссылка;
	
	//Запишем стутасы
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовыйЗаказ.Ссылка);
	
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
	//Запишем стутасы
	
	
КонецПроцедуры


&НаСервере
Функция _ПерезаполнитьРеквизитыШапкиПоЗаказу()
	// --- 
	
	Ответ = _УФКС.Ответ();
	
	ТребуетсяПерезаполнениеПараметровПоТипу = (Объект.ТипПеревозки <> Объект.Заказ.ТипПеревозки И ЗначениеЗаполнено(Объект.Заказ.ТипПеревозки));
	// --- 
	Объект.ТипПеревозки = Объект.Заказ.ТипПеревозки;
	ИзмененКлиент = (Объект.Клиент <> Объект.Заказ.Клиент);
	Объект.Клиент = Объект.Заказ.Клиент;
	ИзмененМаршрут = (Объект.Маршрут <> Объект.Заказ.Маршрут);
	Объект.Маршрут = Объект.Заказ.Маршрут;
	ИзмененГруз = (Объект.Груз <> Объект.Заказ.Груз);
	Объект.Груз = Объект.Заказ.Груз;
	
	Если (ТребуетсяПерезаполнениеПараметровПоТипу) Тогда
		
		_ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.ТипПеревозки, "ТипПеревозки");
		
	КонецЕсли; 
	Если (ИзмененКлиент) Тогда
		
		_ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.Клиент, "Клиент");
		
	КонецЕсли; 
	Если (ИзмененМаршрут) Тогда
		
		_ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.Маршрут, "Маршрут");
		
	КонецЕсли; 
	Если (ИзмененГруз) Тогда
		
		_ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.Груз, "Груз");
		
	КонецЕсли; 
	
	Ответ.Вставить("ТребуетсяПерезаполнениеПараметровПоТипу",ТребуетсяПерезаполнениеПараметровПоТипу);
	Возврат(Ответ);
	
	// --- 
КонецФункции
 

// --- 

#Область ТипПеревозки 

&НаКлиенте
Процедура ТипПеревозкиПриИзменении(Элемент)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/ПроверитьНомерКонтейнера"));
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/УправлениеЭлементамиФормы"));
	
	// ---------------------------------------------------------------------------- 
	
	ДиалогЗаполненияПоТипу();
	
КонецПроцедуры
 
#КонецОбласти 

#Область Клиент 

&НаКлиенте
Процедура КлиентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	_УФК.ВыбратьКлиента(Объект.Клиент,Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	УстановитьМенеджераПродаж();
	
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.Клиент, "Клиент");
	
	// --- 
	ОбновитьДерево = _ПроверитьСвязанныеПараметры("Клиент");
	Если (ОбновитьДерево) Тогда
		ОбновитьДеревоПараметров();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМенеджераПродаж()
	
	ПараметрыСреза = Новый Структура;
	ПараметрыСреза.Вставить("ДатаСреза", Объект.ДатаСделкиФ);
	ПараметрыСреза.Вставить("Контрагент", Объект.Клиент);
	
	НовыйМенеджерПродаж = РегистрыСведений.CW_МенеджерыПродажКлиентов.ПолучитьМенеджераКлиента(ПараметрыСреза);
	
	Если ЗначениеЗаполнено(НовыйМенеджерПродаж) Тогда
		Если НовыйМенеджерПродаж <> Объект.МенеджерПродаж Тогда
			Объект.МенеджерПродаж = НовыйМенеджерПродаж;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПродажПриИзменении(Элемент)
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.МенеджерПродаж, "МенеджерПродаж");
КонецПроцедуры

&НаКлиенте
Процедура ОперативныйМенеджерПриИзменении(Элемент)
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.ОперативныйМенеджер, "ОперативныйМенеджер");
КонецПроцедуры

//Ограничение выбора менеджеров
&НаКлиенте
Процедура ВыбратьИзСпискаДействующихМенеджеров(Команда)
	
	МассивДействующиеМенеджеры = ПолучитьМассивДействующиеМенеджеровНаСервере();

	Если МассивДействующиеМенеджеры.Количество() <> 0 Тогда
		СтандартнаяОбработка = Ложь;
		СтруктураОтбора = Новый Структура("Ссылка", МассивДействующиеМенеджеры);
		
		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("Отбор", СтруктураОтбора);
		ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
		ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
		ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяРеквизита", Этаформа.ТекущийЭлемент.Имя);
		
		Оповещение = Новый ОписаниеОповещения("ПродолжитьВыборМенеджера", ЭтаФорма, ДополнительныеПараметры);
		
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыФормыВыбора, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДействующиеМенеджеровНаСервере()
	Возврат РегистрыСведений.CW_ДействующиеМенеджеры.ПолучитьМассивДействующиеМенеджеров();
КонецФункции

&НаКлиенте
Процедура ПродолжитьВыборМенеджера(РезльтатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезльтатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект[ДополнительныеПараметры.ИмяРеквизита] = РезльтатВыбора;
	
КонецПроцедуры
//Ограничение выбора менеджеров



&НаСервере
Функция _ПроверитьСвязанныеПараметры(ИмяРеквизита)
	// --- 
	
	ОбновитьДП = Ложь;
	КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	// --- 
	Для каждого Стр Из Объект.ПараметрыГрузоперевозки Цикл
		
		СП = КартаСвойств.Получить(Стр.Параметр);
		Если (СП.ИспользованиеОтбора) Тогда
			
			Для каждого СтрокаОтбора Из Стр.Параметр.ПараметрыОтбора Цикл
				
				Если (СтрокаОтбора.ВидУсловия = Перечисления.CW_ВидыУсловийОтбораПараметров.Реквизит) Тогда
					
					Если (СтрокаОтбора.Значение = ИмяРеквизита) Тогда
						
						СвойстваПараметра = CW_Мониторинг.СтруктураСвойствПараметра(Стр.Параметр);
						// --- 
						Стр.Значение = Неопределено;     
						
						Ответ = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
						Ответ.Параметр 		= Стр.Параметр;
						Ответ.Примечание 	= Стр.Примечание;
						
						Результат = _ОбновитьПараметр(Ответ, СвойстваПараметра.СписокВедомых);

						ОбновитьДП = Истина;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	Возврат(ОбновитьДП);
	
	// --- 
КонецФункции 

#КонецОбласти 

#Область Маршрут

&НаКлиенте
Процедура МаршрутПриИзменении(Элемент)
	
	Если (ЗначениеЗаполнено(Объект.Маршрут)) Тогда
		
		Если (_МаршрутСоответствуетТипуПеревозки(Объект.Маршрут,Объект.ТипПеревозки)) Тогда
			ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.Маршрут, "Маршрут");
		Иначе
			Объект.Маршрут = Неопределено;
			ПоказатьПредупреждение(,"Маршрут не соответствует указанному типу перевозки.");
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция _МаршрутСоответствуетТипуПеревозки(Маршрут,ТипПеревозки)
	// --- 
	
	Если (Маршрут.ОграничениеПоТипамПеревозок) Тогда
		
		Если (НЕ ЗначениеЗаполнено(ТипПеревозки)) Тогда
			
			Возврат(Ложь);
			
		Иначе
			
			Если (Маршрут.ТипыПеревозок.Найти(ТипПеревозки,"ТипПеревозки") <> Неопределено) Тогда
				Возврат(Истина);
			Иначе
				Возврат(Ложь);
			КонецЕсли; 
			
		КонецЕсли; 
		
	Иначе
		
		Возврат(Истина);
		
	КонецЕсли;  
	
	// --- 
КонецФункции
 

#КонецОбласти 

#Область Груз 

&НаКлиенте
Процедура ГрузПриИзменении(Элемент)
	
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.Груз, "Груз");
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ТипоразмерПриИзменении(Элемент)
	
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.Типоразмер, "Типоразмер");
	
КонецПроцедуры
// --- 

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/УправлениеЭлементамиФормы"));
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОткрытие(Элемент, СтандартнаяОбработка)
	
	Если (ПолучитьФункциональнуюОпциюФормы("CW_ИспользованиеCRM")) Тогда
		
	    // получаем настройку пользователя
		ИспользоватьСобственнуюФорму = (CW_Настройки.ПолучитьНастройкуПользователя( , "ИспользуемаяФормаКонтрагента") <> 0);
		Если (ИспользоватьСобственнуюФорму) Тогда
			
			СтандартнаяОбработка = Ложь;
			// --- 
			Если (ЗначениеЗаполнено(Объект.Клиент)) Тогда
				ПФ = Новый Структура("ВидФормы,Ссылка","ФормаКонтрагента",Объект.Клиент);
				ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина);	
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПродажОткрытие(Элемент, СтандартнаяОбработка)
	
	Если (ПолучитьФункциональнуюОпциюФормы("CW_ИспользованиеCRM")) Тогда
		
	    // получаем настройку пользователя
		ИспользоватьСобственнуюФорму = (CW_Настройки.ПолучитьНастройкуПользователя( , "ИспользуемаяФормаКонтрагента") <> 0);
		Если (ИспользоватьСобственнуюФорму) Тогда
			
			СтандартнаяОбработка = Ложь;
			// --- 
			Если (ЗначениеЗаполнено(Объект.МенеджерПродаж)) Тогда
				ПФ = Новый Структура("Ключ",Объект.МенеджерПродаж);
				ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина);	
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОперативныйМенеджерОткрытие(Элемент, СтандартнаяОбработка)
	
	Если (ПолучитьФункциональнуюОпциюФормы("CW_ИспользованиеCRM")) Тогда
		
	    // получаем настройку пользователя
		ИспользоватьСобственнуюФорму = (CW_Настройки.ПолучитьНастройкуПользователя( , "ИспользуемаяФормаКонтрагента") <> 0);
		Если (ИспользоватьСобственнуюФорму) Тогда
			
			СтандартнаяОбработка = Ложь;
			// --- 
			Если (ЗначениеЗаполнено(Объект.ОперативныйМенеджер)) Тогда
				ПФ = Новый Структура("Ключ",Объект.ОперативныйМенеджер);
				ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации",ПФ,Элемент,Истина);	
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьКомментарий_Доходы(Команда)
	
	ПоказатьСкрытьКомментарий_Доходы 								= Не ПоказатьСкрытьКомментарий_Доходы;
	Элементы.БюджетДоходыПоказатьСкрытьКомментарий_Доходы.Пометка 	= ПоказатьСкрытьКомментарий_Доходы;
	
	ПоказатьСкрытьКомментарийДоходыРасходы(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьКомментарий_Расходы(Команда)
	
	ПоказатьСкрытьКомментарий_Расходы 								= Не ПоказатьСкрытьКомментарий_Расходы;
	Элементы.БюджетРасходыПоказатьСкрытьКомментарий_Расходы.Пометка = ПоказатьСкрытьКомментарий_Расходы;

	ПоказатьСкрытьКомментарийДоходыРасходы(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьКомментарийДоходыРасходы(ДоходыРасходы)
	
	Если ДоходыРасходы Тогда
		Элементы.БюджетДоходыКомментарий.Видимость = ПоказатьСкрытьКомментарий_Доходы;
	Иначе
		Элементы.БюджетРасходыКомментарий.Видимость = ПоказатьСкрытьКомментарий_Расходы;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ДеревоПараметров
// --- 

#Область ФормированиеДерева 

&НаКлиенте
Процедура ВосстановитьТекущуюПозициюКурсора()
	
	ИдентификаторСтрокиДерева = НайтиПозициюВДереве(ДПГ.ПолучитьЭлементы());
	Элементы.ДПГ.ТекущаяСтрока = ИдентификаторСтрокиДерева;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиПозициюВДереве(ЭлементыДерева) Экспорт
	
	Для Каждого СтрокаДерева Из ЭлементыДерева Цикл
		Если СтрокаДерева.Параметр = ПараметрТекущиейСтрокиДерева Тогда
			Возврат СтрокаДерева.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
		ИдентификаторСтрокиДерева =  НайтиПозициюВДереве(СтрокаДерева.ПолучитьЭлементы());
		Если ИдентификаторСтрокиДерева <> Неопределено Тогда
			Возврат ИдентификаторСтрокиДерева;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ДПГ_ВосстановитьСверткуДерево(Команда)
	
	ДПГ_ВосстановитьСостояниеСвертки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ВосстановитьСостояниеСвертки()
	
	тЭлементы = ДПГ.ПолучитьЭлементы();
	ДПГ_ВосстановитьСостояниеСверткиРекунсивно(тЭлементы);
		
КонецПроцедуры

&НаКлиенте
Процедура ДПГ_ВосстановитьСостояниеСверткиРекунсивно(тЭлементы)
	
	Для каждого тЭлемент Из тЭлементы Цикл
		
		тПодчиненные = тЭлемент.ПолучитьЭлементы();
		ДПГ_ВосстановитьСостояниеСверткиРекунсивно(тПодчиненные);
		
		ВосстановитьСостояниеСверткиСтроки(тЭлемент.ПолучитьИдентификатор());
		
	КонецЦикла; 
	
КонецПроцедуры


&НаКлиенте
Процедура ДПГ_Обновить(Команда)
	

	_ОбновитьСписокПараметровОтслеживаемогоОборудования();
	ОбновитьДеревоПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоПараметров()
	
	ТекущиеДанные =  Элементы.ДПГ.ТекущиеДанные;
	Если  ТекущиеДанные <> Неопределено Тогда
		ПараметрТекущиейСтрокиДерева = Элементы.ДПГ.ТекущиеДанные.Параметр;
	КонецЕсли;
	
	_ОбновитьДеревоПараметров();  
	ПересчитатьДинамическиеПараметры();
	
	ДПГ_ВосстановитьСостояниеСвертки();
	
	Если ЗначениеЗаполнено(ПараметрТекущиейСтрокиДерева) Тогда
		ВосстановитьТекущуюПозициюКурсора();
	КонецЕсли;   
	
КонецПроцедуры 

&НаСервере
Процедура _ОбновитьДеревоПараметров()
	
	// получаем текущие группы 		
	Элементы.ДПГ.НачальноеОтображениеДерева=НачальноеОтображениеДерева.НеРаскрывать;
	ДПГ.ПолучитьЭлементы().Очистить();
	
	Если ИспользуютсяПараметрыВЗаказах и ОтображатьПараметрыЗаказаВГрузоперевозке И ЗначениеЗаполнено(Объект.Заказ) Тогда
		ДополнитьДеревоПараметрамиЗакза();
	КонецЕсли;

	Если (Объект.ГруппыПараметровГрузоперевозки.Количество()=0) Тогда
		Корень = Объект.ГруппыПараметровГрузоперевозки.Добавить();
		Корень.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(Новый Массив);
	Иначе
		Корень = Объект.ГруппыПараметровГрузоперевозки[0];	
	КонецЕсли; 
	Если (НЕ Корень.Раскрывать) Тогда
		Корень.Раскрывать = Истина;
	КонецЕсли; 
	Если (Корень.ИдентификаторыВедомых="") Тогда
		Корень.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(Новый Массив);
	КонецЕсли; 
	
	СПВ = Новый Структура("КартаПрав,КартаСвойств,ТаблицаКонтроляГрупп,ТаблицаКонтроляПараметров");
	СПВ.КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	СПВ.КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	СПВ.ТаблицаКонтроляГрупп = _ТаблицаКонтроляГрупп(Объект.ГруппыПараметровГрузоперевозки.Выгрузить());
	СПВ.ТаблицаКонтроляПараметров = _ТаблицаКонтроляПараметров(СПВ.КартаПрав, Объект.ПараметрыГрузоперевозки.Выгрузить());
	_СформироватьЭлементыДерева(Корень,Неопределено,СПВ);
	
	// проверим, всё ли выведено
	#Область КонтрольНесформированных 
	// после формирования проверяем, нет ли потерянных групп, 
	// если есть, то засовываем их в корень и переформировываем дерево
	// сообщаем о потерянных группах
	МассивНеучтенныхГрупп = _сф.к_НайтиСтроки(СПВ.ТаблицаКонтроляГрупп,Новый Структура("Видимость",Ложь));
	Если (МассивНеучтенныхГрупп.Количество() <> 0) Тогда
		
		// переносим каждую в корень
		Для каждого КонтрольнаяСтрокаГруппы Из МассивНеучтенныхГрупп Цикл
			
			_ДобавитьЭлементГруппы(КонтрольнаяСтрокаГруппы.Идентификатор, Корень);
			
		КонецЦикла; 
		// --- 
		// переформировываем дерево
		_ОбновитьДеревоПараметров();
		
	КонецЕсли; 
	
	// далее проверяем, нет ли потерянных/новых параметров, если есть
	// то добавляем их в корень и снова переформировываем дерево
	МассивНеучтенныхПараметров = _сф.к_НайтиСтроки(СПВ.ТаблицаКонтроляПараметров,Новый Структура("Видимость",Ложь));
	Если (МассивНеучтенныхПараметров.Количество() <> 0) Тогда
		
		_ОбновитьСписокПараметровОтслеживаемогоОборудования();
		// проверяем, что есть хотя бы один предопределенный
		ЕстьПредопределенные = Ложь;
		Для каждого СтрокаПараметра Из МассивНеучтенныхПараметров Цикл
			
			Если (СписокПараметровОтслеживаемогоОборудования.НайтиПоЗначению(СтрокаПараметра.Параметр) <> Неопределено) Тогда
				ЕстьПредопределенные = Истина;
				Прервать;
			КонецЕсли; 			
			
		КонецЦикла; 
		Если (ЕстьПредопределенные) Тогда
			
			// проверяем наличие группы "Оборудование"
			// если её нет - создаём
			НаименованиеГруппыОборудования = "Оборудование на слежении";
			Отбор = Новый Структура("Наименование",НаименованиеГруппыОборудования);
			СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Отбор);
			Если (СтрокаГруппы = Неопределено) Тогда
				
				// создаем строку ТЧ
				СтрокаГруппы = Объект.ГруппыПараметровГрузоперевозки.Добавить();
				СтрокаГруппы.Идентификатор 			= _ИдентификаторНовойГруппы();
				СтрокаГруппы.Наименование 			= НаименованиеГруппыОборудования;
				СтрокаГруппы.ИдентификаторыВедомых  = ЗначениеВСтрокуВнутр(Новый Массив);
				СтрокаГруппы.ИдентификаторГруппы 	= Новый УникальныйИдентификатор;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		// переносим каждую в корень
		Для каждого КонтрольнаяСтрокаПараметра Из МассивНеучтенныхПараметров Цикл
			
			Если (СписокПараметровОтслеживаемогоОборудования.НайтиПоЗначению(КонтрольнаяСтрокаПараметра.Параметр) <> Неопределено) Тогда
				
				_ДобавитьЭлементГруппы(КонтрольнаяСтрокаПараметра.Параметр, СтрокаГруппы);
				
			Иначе
				
				_ДобавитьЭлементГруппы(КонтрольнаяСтрокаПараметра.Параметр, Корень);
				
			КонецЕсли; 
			
			
		КонецЦикла; 
		// переформировываем дерево
		_ОбновитьДеревоПараметров();
		
	КонецЕсли; 
	#КонецОбласти 
	
КонецПроцедуры

&наСервере
Процедура ДополнитьДеревоПараметрамиЗакза()

	мСтрокиКУдалению 	= Новый Массив;
	ЭлементыДерева 		= ДПГ.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из ЭлементыДерева Цикл
		Если СтрокаДерева.ПараметрЗаказа Тогда
			мСтрокиКУдалению.Добавить(СтрокаДерева);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементМассива из мСтрокиКУдалению Цикл
		ЭлементыДерева.Удалить(ЭлементМассива);
	КонецЦикла;
	
	Если (Объект.Заказ.ГруппыПараметровЗаказа.Количество()=0) Тогда
		Возврат;
	Иначе
		Корень = Объект.Заказ.ГруппыПараметровЗаказа[0];	
	КонецЕсли; 
	Если (НЕ Корень.Раскрывать) Тогда
		Корень.Раскрывать = Истина;
	КонецЕсли; 
	Если (Корень.ИдентификаторыВедомых="") Тогда
		Корень.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(Новый Массив);
	КонецЕсли; 
	
	СПВ = Новый Структура("КартаПрав,КартаСвойств,ТаблицаКонтроляГрупп,ТаблицаКонтроляПараметров");
	СПВ.КартаПрав 		= ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	СПВ.КартаСвойств 	= ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	
	СПВ.ТаблицаКонтроляГрупп 		= _ТаблицаКонтроляГрупп(Объект.Заказ.ГруппыПараметровЗаказа.Выгрузить());
	СПВ.ТаблицаКонтроляПараметров 	= _ТаблицаКонтроляПараметров(СПВ.КартаПрав, Объект.Заказ.ПараметрыЗаказа.Выгрузить());
	
	_СформироватьЭлементыДерева(Корень,Неопределено,СПВ, Истина);

КонецПроцедуры

&НаСервере
Функция _ТаблицаКонтроляГрупп(ТаблицаГрупп)
	// --- 
	
	ТаблицаКонтроляГрупп = ТаблицаГрупп; 
	ТаблицаКонтроляГрупп.Колонки.Добавить("Видимость");
	ТаблицаКонтроляГрупп.ЗаполнитьЗначения(Ложь,"Видимость");
	СтрокаКорня = _сф.к_ПервыйЭлемент(ТаблицаКонтроляГрупп);
	СтрокаКорня.Видимость = Истина;
	// --- 
	Возврат(ТаблицаКонтроляГрупп);
	
	// --- 
КонецФункции

&НаСервере
Функция _ТаблицаКонтроляПараметров(НаборПрав, ТаблицаПараметров)
	// --- 
	
	ТаблицаКонтроляПараметров = ТаблицаПараметров;
	// --- 
	ТаблицаКонтроляПараметров.Колонки.Добавить("Видимость");
	ТаблицаКонтроляПараметров.ЗаполнитьЗначения(Ложь,"Видимость");
	// --- 
	МассивУдаляемыхСтрок = Новый Массив;
	Для каждого СтрокаКонтроля Из ТаблицаКонтроляПараметров Цикл
		
		СтруктураПрав = НаборПрав["п_"+_сф.КлючПоСсылке(СтрокаКонтроля.Параметр)];
		Если (НЕ СтруктураПрав.Просмотр) Тогда
			
			МассивУдаляемыхСтрок.Добавить(СтрокаКонтроля);
			
		КонецЕсли;
		
	КонецЦикла; 
	_сф.к_УдалитьЭлементыПоМассиву(ТаблицаКонтроляПараметров, МассивУдаляемыхСтрок);
	// --- 
	Возврат(ТаблицаКонтроляПараметров);
	
	// --- 
КонецФункции

&НаСервере
Функция _СформироватьЭлементыДерева(Группа,СтрокаДерева = Неопределено, СПВ, ПараметрЗаказа=Ложь)
	
	// СПВ - структура параметров вызова
	// --- 
	// .КартаПрав
	// .КартаСвойств
	// .ТаблицаКонтроляГрупп = Неопределено
	// .ТаблицаКонтроляПараметров = Неопределено
	
	// ---------------------------------------------------------------------------- 
	
	Если (СтрокаДерева <> Неопределено) Тогда
		КоллекцияЭлементовДерева = СтрокаДерева.ПолучитьЭлементы();
	Иначе
		КоллекцияЭлементовДерева = ДПГ.ПолучитьЭлементы();		
	КонецЕсли; 
	
	//Если Не ПараметрЗаказа Тогда
	//	КоллекцияЭлементовДерева.Очистить();
	//КонецЕсли; 
	// --- 
	
	МассивПодчиненныхЭлементов = ЗначениеИзСтрокиВнутр(Группа.ИдентификаторыВедомых);
	МассивИдентификаторовДляУдаления = Новый Массив;
	Для каждого ПодчиненныйЭлемент Из МассивПодчиненныхЭлементов Цикл
		
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда  
			ПодчиненныйЭлементОбъект = ПодчиненныйЭлемент.ПолучитьОбъект();
			Если ПодчиненныйЭлементОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;                                                                                            
		Конецесли;
		
		ЭтоГруппа = (ТипЗнч(ПодчиненныйЭлемент)=Тип("Число"));
		// --- 	
		Если (ЭтоГруппа) Тогда
			
			ОтборПоИдентификаторуГруппы = Новый Структура("Идентификатор",ПодчиненныйЭлемент);
			Если ПараметрЗаказа Тогда
				СтрокаГруппы = _сф.к_НайтиСтроку(Объект.Заказ.ГруппыПараметровЗаказа,ОтборПоИдентификаторуГруппы);
			Иначе
				СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,ОтборПоИдентификаторуГруппы);
			КонецЕсли;
			// проверяем, что еще не выведена и записываем признак формирования
			Если (СПВ.ТаблицаКонтроляГрупп <> Неопределено) Тогда
				
				КонтрольнаяСтрокаГруппы = _сф.к_НайтиСтроку(СПВ.ТаблицаКонтроляГрупп, ОтборПоИдентификаторуГруппы);
				Если (КонтрольнаяСтрокаГруппы.Видимость) Тогда
					
					// ахтунг, зацикливание
					МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
					Продолжить;
					
				Иначе
					
					КонтрольнаяСтрокаГруппы.Видимость = Истина;
					
				КонецЕсли; 
				
			КонецЕсли; 
			// --- 
			Нстр = КоллекцияЭлементовДерева.Добавить();
			_ЗаполнитьСтрокуДереваПоГруппе(Нстр, СтрокаГруппы, ПараметрЗаказа);
			// --- 
			УстановитьСостояниеСверткиСтроки(Нстр.ПолучитьИдентификатор(), Нстр.ИдентификаторГруппы, СтрокаГруппы.Раскрывать);
			
			_СформироватьЭлементыДерева(СтрокаГруппы, Нстр, СПВ, ПараметрЗаказа);
			// ---------------------------------------------------------------------------- 
			// устанавливаем признак разрешения удаления для группы
			УдалениеРазрешено = Истина;
			ПредопределенныйПараметр = Ложь;
			// --- 
			КоллекцияПодчиненных = Нстр.ПолучитьЭлементы();
			КоличествоСформированныхПодчиненных = КоллекцияПодчиненных.Количество();
			КоличествоПодчиненных = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых).Количество();
			Если (КоличествоСформированныхПодчиненных <> КоличествоПодчиненных) Тогда
				
				УдалениеРазрешено = Ложь;
				
			Иначе
				
				Для каждого ПодчиненнаяСтрока Из КоллекцияПодчиненных Цикл
					
					Если (НЕ ПодчиненнаяСтрока.УдалениеРазрешено) Тогда
						УдалениеРазрешено = Ложь;
						Прервать;
					КонецЕсли; 
					
				КонецЦикла;
								
			КонецЕсли; 
			Для каждого ПодчиненнаяСтрока Из КоллекцияПодчиненных Цикл
				
				Если (ПодчиненнаяСтрока.ПредопределенныйПараметр) Тогда
					ПредопределенныйПараметр = Истина;
					Прервать;
				КонецЕсли; 
				
			КонецЦикла;
			// --- 
			Нстр.УдалениеРазрешено = УдалениеРазрешено;
			Нстр.ПредопределенныйПараметр = ПредопределенныйПараметр;
			// --- 
			Если (ПоказыватьКоличествоПараметров) Тогда
				
				Нстр.КоличествоПараметров = 0;
				Для каждого ПодчиненнаяСтрока Из КоллекцияПодчиненных Цикл
					
					_сф.Инкремент(Нстр.КоличествоПараметров,ПодчиненнаяСтрока.КоличествоПараметров);
					
				КонецЦикла; 
				Нстр.Параметр_Представление = Нстр.НаименованиеГруппы + " ("+Формат(Нстр.КоличествоПараметров,"ЧН=; ЧГ=")+")";
				
			КонецЕсли; 
			
		КонецЕсли; 
		// --- 
		Если (НЕ ЭтоГруппа) Тогда
			
			Параметр = ПодчиненныйЭлемент;
			// ---------------------------------------------------------------------------- 
			
			// проверим права
			СтруктураПрав = СПВ.КартаПрав["п_"+_сф.КлючПоСсылке(Параметр)];
			Если (НЕ СтруктураПрав.Просмотр) Тогда
				
				Продолжить;
				
			КонецЕсли;
			// --- 
			// найдем свойства
			СП = СПВ.КартаСвойств.Получить(ПодчиненныйЭлемент);
			// --- 
			// контроль формирования
			Если (СПВ.ТаблицаКонтроляПараметров <> Неопределено) Тогда
				
				ОтборПоПараметру = Новый Структура("Параметр",ПодчиненныйЭлемент);
				КонтрольнаяСтрокаПараметра = _сф.к_НайтиСтроку(СПВ.ТаблицаКонтроляПараметров, ОтборПоПараметру);
				Если (КонтрольнаяСтрокаПараметра = Неопределено) Тогда
					
					//Сообщить("Параметр """+Строка(ПодчиненныйЭлемент)+""" не найден в контрольной таблице.");
					
				Иначе
					
					Если (КонтрольнаяСтрокаПараметра.Видимость) Тогда
						
						// ахтунг, параметр уже в какой-то группе, удаляем из текущей
						МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
						Продолжить;
						
					Иначе
						
						КонтрольнаяСтрокаПараметра.Видимость = Истина;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			// --- 
			Если ПараметрЗаказа Тогда
				СтрокаПараметра = _сф.к_НайтиСтроку(Объект.Заказ.ПараметрыЗаказа,Новый Структура("Параметр",Параметр));
			Иначе
				СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,Новый Структура("Параметр",Параметр));
			КонецЕсли;
			Если (СтрокаПараметра = Неопределено) Тогда
				
				// параметр был удален
				МассивИдентификаторовДляУдаления.Добавить(ПодчиненныйЭлемент);
				Продолжить;
				
			КонецЕсли; 
			Нстр = КоллекцияЭлементовДерева.Добавить();
			_ЗаполнитьСтрокуДереваПоПараметру(Нстр, СтрокаПараметра, СП, СтруктураПрав, ПараметрЗаказа);
			
			Если Не ПараметрЗаказа Тогда
				// записываем добавленную строку в карту параметров дерева
				ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Параметр);
				Если (ЭлементКартыПараметров = Неопределено) Тогда
					ЭлементКартыПараметров = КартаПараметровДерева.Добавить(Параметр);
				КонецЕсли; 
				ЭлементКартыПараметров.Представление = Формат(Нстр.ПолучитьИдентификатор(),"ЧЦ=10; ЧДЦ=; ЧН=; ЧГ=");
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	// удаляем некорректные элементы
	Если (МассивИдентификаторовДляУдаления.Количество() <> 0) Тогда
		
		Для каждого ИдентификаторДляУдаления Из МассивИдентификаторовДляУдаления Цикл
			
			МассивПодчиненныхЭлементов.Удалить(МассивПодчиненныхЭлементов.Найти(ИдентификаторДляУдаления));
			
		КонецЦикла; 
		
		Попытка
			Группа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивПодчиненныхЭлементов);
		Исключение
		КонецПопытки;
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Процедура _ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева,СтрокаПараметра,СвойстваПараметра=Неопределено,СтруктураПрав=Неопределено, ПараметрЗаказа = Ложь)
	// --- 
	
	Если (СтрокаПараметра = Неопределено) Тогда
		Возврат;
	КонецЕсли; 
	// ---------------------------------------------------------------------------- 
	
	Параметр = СтрокаПараметра.Параметр;
	ТДата = ТекущаяДата();
	// ---------------------------------------------------------------------------- 
	Если (СвойстваПараметра = Неопределено) Тогда
		СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
		СвойстваПараметра = СвойстваПараметров.Получить(Параметр);
		Если (СвойстваПараметра = Неопределено) Тогда
			КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
			СвойстваПараметра = КартаСвойств.Получить(Параметр);
		КонецЕсли; 
	КонецЕсли; 
	Если (СтруктураПрав = Неопределено) Тогда
		
		КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
		СтруктураПрав = КартаПрав["п_"+_сф.КлючПоСсылке(Параметр)];
		
	КонецЕсли; 
	// ---------------------------------------------------------------------------- 
	
	// основное
	СтрокаДерева.Параметр 				= Параметр;	
	СтрокаДерева.Параметр_Представление = СвойстваПараметра.Наименование;	
	СтрокаДерева.Значение 				= СтрокаПараметра.Значение;
	СтрокаДерева.КоличествоПараметров 	= 1;
	СтрокаДерева.Примечание 			= СтрокаПараметра.Примечание;
	СтрокаДерева.ПараметрЗаказа 		= ПараметрЗаказа;
	
	//Новый механизм
	СтрокаДерева.ИдентификаторВладельца = СтрокаПараметра.ИдентификаторВладельца;
	//Новый механизм

	// ---------------------------------------------------------------------------- 
	// индекс картинки
	Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
		СтрокаДерева.ИндексКартинки = 2 + ?(ПараметрЗаказа,5,0);				
	ИначеЕсли (СвойстваПараметра.ДинамическийПараметр) Тогда 
		СтрокаДерева.ИндексКартинки = 3 + ?(ПараметрЗаказа,5,0);
	Иначе
		СтрокаДерева.ИндексКартинки = 1 + ?(ПараметрЗаказа,5,0);
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	// формат вывода
	ТипЗначенияПараметра = СвойстваПараметра.ТипЗначения;
	ТипПараметра = СвойстваПараметра.ТипЗначения.Типы()[0];
	Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
		
		Если СвойстваПараметра.ФорматВывода <> "" Тогда
			СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,СвойстваПараметра.ФорматВывода);
		Иначе
			
			Если (НЕ СвойстваПараметра.КонтрольнаяДатаИспользуетВремя) Тогда
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,"ДФ=dd.MM.yyyy");
			Иначе
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,"ДФ='dd.MM.yyyy HH:mm'");
			КонецЕсли; 
			
		КонецЕсли; 
		
	Иначе
		
		Если (ТипПараметра = Тип("Булево") ИЛИ ТипПараметра = Тип("Дата") ИЛИ ТипПараметра=Тип("Число")) Тогда
			
			Если (СвойстваПараметра.ФорматВывода <> "") Тогда
				
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,СвойстваПараметра.ФорматВывода);
				
			Иначе
				
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение);
				
				Если ТипПараметра = Тип("Дата") Тогда
					
					ФорматВывода = "";
					ЧастьДаты = ТипЗначенияПараметра.КвалификаторыДаты.ЧастиДаты;
					Если ЧастьДаты = ЧастиДаты.Дата Тогда
						
						// формат дат по умолчанию
						ФорматВывода = "ДФ=dd.MM.yyyy";
						
					ИначеЕсли ЧастьДаты = ЧастиДаты.Время Тогда 
						
						// формат дат по умолчанию
						ФорматВывода = "ДФ=HH:mm:ss";
						
					ИначеЕсли ЧастьДаты = ЧастиДаты.ДатаВремя Тогда 
						
						// формат дат по умолчанию
						ФорматВывода = "ДЛФ=";
						
					КонецЕсли;
					
					СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,ФорматВывода);
					
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе
			
			СтрокаДерева.Значение_Представление = Строка(СтрокаДерева.Значение);
			
		КонецЕсли; 					
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	// статус план/факт
	Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
		
		Если (СтрокаПараметра.ЗначениеФакт <> Дата(1,1,1)) Тогда
			
			СтрокаДерева.ПланФакт=Истина;
			СтрокаДерева.ПланПросрочен=Ложь;
			
		Иначе
			
			СтрокаДерева.ПланФакт=Ложь;
			Если (СтрокаПараметра.ЗначениеПлан <> Дата(1,1,1)) И (СтрокаПараметра.ЗначениеПлан - НачалоДня(ТДата) <= СвойстваПараметра.ЛимитПросрочкиКонтрольнойДаты * 60*60*24) Тогда
				СтрокаДерева.ПланПросрочен=Истина;
			Иначе	
				СтрокаДерева.ПланПросрочен=Ложь;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 

	// ---------------------------------------------------------------------------- 
	// право удаления
	СтрокаДерева.УдалениеРазрешено = СтруктураПрав.Редактирование;
	Если (ЗначениеЗаполнено(Объект.ОтслеживаемоеОборудование)) Тогда
		
		Если (СписокПараметровОтслеживаемогоОборудования.НайтиПоЗначению(Параметр) <> Неопределено) Тогда
			
			СтрокаДерева.УдалениеРазрешено = Ложь;
			СтрокаДерева.ПредопределенныйПараметр = Истина;
			СтрокаДерева.ПараметрОборудования = Истина;
			СтрокаДерева.ИндексКартинки = 4;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	// контроль заполнения
	Если (ЗначениеЗаполнено(Объект.ТипПеревозки)) Тогда
		
		СтрокаКонтроляЗаполненияПараметра = Объект.ТипПеревозки.ПараметрыГрузоперевозки.Найти(СтрокаПараметра.Параметр,"Параметр");
		Если (СтрокаКонтроляЗаполненияПараметра <> Неопределено) Тогда
			
			СтрокаДерева.КонтрольЗаполнения = СтрокаКонтроляЗаполненияПараметра.КонтрольЗаполнения;
			
		КонецЕсли; 
		ТекущееЗначениеКонтроляЗаполнения = СтрокаДерева.ЗначениеНезаполнено;
		Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
			
			СтрокаДерева.ЗначениеНезаполнено = (СтрокаДерева.КонтрольЗаполнения И НЕ ЗначениеЗаполнено(СтрокаПараметра.ЗначениеФакт));
			
		Иначе
			
			СтрокаДерева.ЗначениеНезаполнено = (СтрокаДерева.КонтрольЗаполнения И НЕ ЗначениеЗаполнено(СтрокаПараметра.Значение));
			
		КонецЕсли; 
		Если (ТекущееЗначениеКонтроляЗаполнения <> СтрокаДерева.ЗначениеНезаполнено) Тогда
			
			// требуется рекурсивно проверить контроль заполнения
			_ПроверитьГруппыПоИерархии(СтрокаДерева);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ПроверитьГруппыПоИерархии(СтрокаДерева)
	// --- 
	
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		СтрокаРодителя = СтрокаДерева;
	Иначе
		СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
		Если (СтрокаРодителя = Неопределено) Тогда
			
			Возврат;
			
		КонецЕсли; 
	КонецЕсли; 
	// --- 
	ЗначениеНеЗаполнено = Ложь;
	// требуется проверить отметку контроля заполнения у родителя
	
	ЭлементыСтроки = СтрокаРодителя.ПолучитьЭлементы();
	СтрокаРодителя.КоличествоПараметров = 0;
	Для каждого Стр Из ЭлементыСтроки Цикл
		
		Если (Стр.КонтрольЗаполнения И Стр.ЗначениеНезаполнено) Тогда
			
			ЗначениеНеЗаполнено = Истина;
			
		КонецЕсли; 
		_сф.Инкремент(СтрокаРодителя.КоличествоПараметров,Стр.КоличествоПараметров);
		
	КонецЦикла; 
	СтрокаРодителя.ЗначениеНезаполнено = ЗначениеНеЗаполнено;
	Если (ПоказыватьКоличествоПараметров) Тогда
		СтрокаРодителя.Параметр_Представление = СтрокаРодителя.НаименованиеГруппы + " ("+Формат(СтрокаРодителя.КоличествоПараметров,"ЧН=; ЧГ=")+")";	
	КонецЕсли; 
	
	// --- 
	
	// устанавливаем признак разрешения удаления для группы
	УдалениеРазрешено = Истина;
	ПредопределенныйПараметр = Ложь;
	// --- 
	КоличествоСформированныхПодчиненных = ЭлементыСтроки.Количество();
	СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
	КоличествоПодчиненных = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых).Количество();
	Если (КоличествоСформированныхПодчиненных <> КоличествоПодчиненных) Тогда
		
		УдалениеРазрешено = Ложь;
		
	Иначе
		
		Для каждого ПодчиненнаяСтрока Из ЭлементыСтроки Цикл
			
			Если (НЕ ПодчиненнаяСтрока.УдалениеРазрешено) Тогда
				УдалениеРазрешено = Ложь;
				Прервать;
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	Для каждого ПодчиненнаяСтрока Из ЭлементыСтроки Цикл
		
		Если (ПодчиненнаяСтрока.ПредопределенныйПараметр) Тогда
			ПредопределенныйПараметр = Истина;
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	СтрокаРодителя.УдалениеРазрешено = УдалениеРазрешено;
	СтрокаРодителя.ПредопределенныйПараметр = ПредопределенныйПараметр;
	
	// --- 
	РодительРодителя = СтрокаРодителя.ПолучитьРодителя();
	Если (РодительРодителя <> Неопределено) Тогда
		_ПроверитьГруппыПоИерархии(РодительРодителя);	
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы, ПараметрЗаказа=Ложь)
	// --- 
	
	СтрокаДерева.ЭтоГруппа = Истина;
	СтрокаДерева.НаименованиеГруппы = СтрокаГруппы.Наименование;
	СтрокаДерева.Параметр_Представление = СтрокаГруппы.Наименование;
	СтрокаДерева.ИдентификаторГруппы = СтрокаГруппы.Идентификатор;
	СтрокаДерева.КонтрольЗаполнения = Истина;
	// --- 
	СтрокаДерева.ИндексКартинки	= 0 + ?(ПараметрЗаказа,5,0);	
	СтрокаДерева.ПараметрЗаказа	= ПараметрЗаказа;
	
	//Новый механизм
	СтрокаДерева.ИдентификаторВладельца = СтрокаГруппы.ИдентификаторВладельца;
	//Новый механизм
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ВыполнитьПодгрузкуСтрок(ИдентификаторСтрокиРодителя)
	// --- 
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
	СтрокаДерева.ПолучитьЭлементы().Очистить();
	_ВыполнитьПодгрузку(ИдентификаторСтрокиРодителя);
	// --- 
	
	ВосстановитьСостояниеСверткиСтроки(ИдентификаторСтрокиРодителя);
	// --- 
	Элементы.ДПГ.Развернуть(ИдентификаторСтрокиРодителя);
	СохранитьСостояниеСверткиСтроки(ИдентификаторСтрокиРодителя, Истина);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ВыполнитьПодгрузку(ИдентификаторСтрокиРодителя)
	// --- 
	
	СтрокаРодителя = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиРодителя);
	СтрокаГруппа = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор",СтрокаРодителя.ИдентификаторГруппы));
	// --- 
	СПВ = Новый Структура("КартаПрав,КартаСвойств,ТаблицаКонтроляГрупп,ТаблицаКонтроляПараметров");
	СПВ.КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	СПВ.КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	// --- 
	_СформироватьЭлементыДерева(СтрокаГруппа,СтрокаРодителя, СПВ);
	
	//
	_ПроверитьГруппыПоИерархии(СтрокаРодителя);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область СобытияДерева

// --- 

&НаКлиенте
Процедура ДПГПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если ЗначениеЗаполнено(ДатаБлокировкиМониторинга) тогда
		Возврат;
	КонецЕсли;

	
	Идентификатор = Элементы.ДПГ.ТекущаяСтрока;
	СтрокаДПГ = ДПГ.НайтиПоИдентификатору(Идентификатор);
	// ---------------------------------------------------------------------------- 
	Если СтрокаДПГ.ПараметрЗаказа Тогда
		Возврат;
	КонецЕсли;
	                                             
	Если СтрокаДПГ.ПараметрОборудования Тогда
		Возврат;
	КонецЕсли;
	
	// группа
	Если (СтрокаДПГ.ЭтоГруппа) Тогда
		
		ДоступнаСменаРежимаСвертки 	= ПроверитьСостояниеВедомых(СтрокаДПГ);
		СостояниеГруппы  			= ПолучитьНастройкуРаскрытияГруппы(СтрокаДПГ.ИдентификаторГруппы);
		
		ПараметрыФормы 	= Новый Структура("НаименованиеГруппы,ГруппаРазвернута,РежимГрузоперевозки,ДоступнаСменаРежимаСвертки", СтрокаДПГ.НаименованиеГруппы,СостояниеГруппы, Истина,ДоступнаСменаРежимаСвертки);
		ПОВ 			= Новый ОписаниеОповещения("ОбработатьВводНаименованияГруппы",ЭтотОбъект, Новый Структура("Редактирование",Истина)); 
		
		ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВиртуальнойГруппы",ПараметрыФормы,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	// параметр
	Если (НЕ СтрокаДПГ.ЭтоГруппа) Тогда 
		
		Параметр = Элемент.ТекущиеДанные.Параметр;
		
		ИдентификаторСтрокиГруппы	= Неопределено;
		РодительПараметра 			= СтрокаДПГ.ПолучитЬРодителя();
		Если  РодительПараметра <> Неопределено тогда
			ИдентификаторСтрокиГруппы	= РодительПараметра.ПолучитьИдентификатор()
		КонецЕсли;
		
		// --- 
		ПараметрТолькоПросмотр = _ТолькоПросмотрПараметра(Параметр);
		СвойстваПараметра = CW_Мониторинг.СтруктураСвойствПараметра(Параметр);	
		Если (СвойстваПараметра.Ведомый) Тогда
			
			// проверяем ведущие на заполненность
			Результат = _ПроверитьЗаполнениеВедущих(Параметр,СвойстваПараметра.СписокВедущих);
			Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
				
				_УФК.ВывестиПредупреждение("Данный параметр является зависимым!");
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли; 
		Если (СвойстваПараметра.ДинамическийПараметр) Тогда
			
			_УФК.ВывестиПредупреждение("Динамические параметры не редактируются");
			Возврат;
			
		КонецЕсли;
		// --- 
		АдресОбъекта 		= _АдресОбъекта();
		РежимТолькоПросмотр = ПараметрТолькоПросмотр ИЛИ ЗначениеЗаполнено(ДатаБлокировкиМониторинга);
		ВыбраннаяФорма 		= Неопределено;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Режим"						, "РедактированиеОбъекта");
		ПараметрыФормы.Вставить("Параметр"					, Параметр);
		ПараметрыФормы.Вставить("ИдентификаторСтрокиГруппы"	, ИдентификаторСтрокиГруппы);
		ПараметрыФормы.Вставить("АдресСвойствПараметра"		, ПоместитьВоВременноеХранилище(СвойстваПараметра,ЭтаФорма.УникальныйИдентификатор));
		ПараметрыФормы.Вставить("АдресОбъекта"				, АдресОбъекта);
		ПараметрыФормы.Вставить("ТолькоПросмотр"			, РежимТолькоПросмотр);
		ПараметрыФормы.Вставить("Значение"			        , СтрокаДПГ.Значение);
		
		//ХранениеПолногоЗначения  
		Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда
			Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда
				ПолноеЗначение = СохраняемоеПолноеЗначение.Получить(Параметр);
			КонецЕсли;
			ПолноеЗначение = ?(ПолноеЗначение=Неопределено, СтрокаДПГ.Значение, ПолноеЗначение);
			
			ПараметрыФормы.Вставить("ПолноеЗначение", ПолноеЗначение);
		КонецЕсли;
		//---ХранениеПолногоЗначения
		
		ПОВ = Новый ОписаниеОповещения("ОбработатьИзменениеПараметра",ЭтотОбъект,Новый Структура("СвойстваПараметра,Параметр",СвойстваПараметра,Параметр));
		
		Если СвойстваПараметра.ИспользоватьФормуВыбораОбъекта тогда
			
			Если Не РежимТолькоПросмотр Тогда
				ВыбраннаяФорма = СвойстваПараметра.ИмяФормыВыбора;
				
				ПараметрыФормы.Вставить("РежимВыбора"		,         Истина);
				ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",         Истина);
				
				ОтборФормы = СформироватьПараметрыОтбора(Объект.Ссылка, Параметр);
				
				Если ОтборФормы <> Неопределено Тогда
					Если СвойстваПараметра.ИспользуютсяДополнительныеЗначения Тогда
						Если ОтборФормы.Свойство("Отбор") Тогда
							ОтборФормы.Отбор.Вставить("Владелец",Параметр);
						КонецЕсли;
					КонецЕсли;
					ПараметрыФормы.Вставить("Отбор", ОтборФормы.Отбор);
				Иначе
					Если СвойстваПараметра.ИспользуютсяДополнительныеЗначения Тогда
						ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец",Параметр));
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли; 
			
		Иначе
			Если СвойстваПараметра.ИспользуетсяВнешняяОбработкаПередНачаломИзменения Тогда
				
				СтруктураПараметров = _ПО.ПолучитьИмяФормыНаСервере(Параметр, АдресОбъекта);
				ВыбраннаяФорма 		= "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
				
				ОбработчикНеИспользуется = Ложь;
				Если СтруктураПараметров.Свойство("НеИспользуется") Тогда
					ОбработчикНеИспользуется = СтруктураПараметров.НеИспользуется;
				КонецЕсли;
				

				Если СтруктураПараметров.Свойство("ТолькоПросмотр") Тогда
					Если  НЕ ПараметрыФормы.ТолькоПросмотр Тогда
						ПараметрыФормы.ТолькоПросмотр =  СтруктураПараметров.ТолькоПросмотр;
					КонецЕсли;
				КонецЕсли;
				
				Если СтруктураПараметров.Свойство("ПодключаемыйОбъект") Тогда
					ПараметрыФормы.Вставить("ПодключаемыйОбъект",СтруктураПараметров.ПодключаемыйОбъект);
				КонецЕсли; 
				
				Если ОбработчикНеИспользуется ИЛИ 
					СтруктураПараметров.РежимОткрытия = 1 Тогда
					ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
				ИначеЕсли	СтруктураПараметров.РежимОткрытия = 0 Тогда
					ВыбраннаяФорма = СтруктураПараметров.ИмяФормы;
				КонецЕсли;

			Иначе
				ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
			КонецЕсли;

		КонецЕсли;
		
		Если ВыбраннаяФорма <> Неопределено Тогда
			ОткрытьФорму(ВыбраннаяФорма, ПараметрыФормы,ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция СформироватьПараметрыОтбора(РедактируемыйОбъект,Параметр)
	
	Если Не Параметр.ИспользованиеОтбора Тогда
		Возврат Неопределено;
	Конецесли;

	Если Параметр.ВариантОтбора=Перечисления.CW_ВариантыОтбораДляПараметров.СтандартныйОтбор Тогда
		
		МассивПараметровВыбора = Новый Массив;
		Для каждого ПараметрВыбора Из Параметр.ПараметрыОтбора Цикл
			
			Если (ПараметрВыбора.ВидУсловия = Перечисления.CW_ВидыУсловийОтбораПараметров.Значение) Тогда
				
				НовыйПараметр = Новый ПараметрВыбора(ПараметрВыбора.РеквизитОтбора,ПараметрВыбора.Значение);
				МассивПараметровВыбора.Добавить(НовыйПараметр);
				
			ИначеЕсли (ПараметрВыбора.ВидУсловия = Перечисления.CW_ВидыУсловийОтбораПараметров.Реквизит) Тогда
				
				Попытка
					
					ИмяРеквизита = ПараметрВыбора.Значение;
					Если (ИмяРеквизита = "Клиент") Тогда
						Если (ТипЗнч(РедактируемыйОбъект.Ссылка)=Тип("СправочникСсылка.CW_Заявки")) Тогда
							ИмяРеквизита = "Контрагент";
						КонецЕсли; 
					КонецЕсли; 
					
					СсылкаОбъекта = РедактируемыйОбъект.Ссылка;
					ЗначениеРеквизита = СсылкаОбъекта[ИмяРеквизита];
					
				Исключение
					ЗначениеРеквизита = Неопределено;
				КонецПопытки; 
				
				Если (ЗначениеРеквизита <> Неопределено) Тогда
					
					Если (ЗначениеЗаполнено(ЗначениеРеквизита)) Тогда
						
						НовыйПараметр = Новый ПараметрВыбора(ПараметрВыбора.РеквизитОтбора,ЗначениеРеквизита);
						МассивПараметровВыбора.Добавить(НовыйПараметр);
						
					КонецЕсли; 
					
				КонецЕсли; 
				
				
			ИначеЕсли (ПараметрВыбора.ВидУсловия = Перечисления.CW_ВидыУсловийОтбораПараметров.Параметр) Тогда
				
				ИмяТЧ = CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(РедактируемыйОбъект); 
				
				Если ИмяТЧ <> Неопределено Тогда
					// в качестве значения подставляем значение параметра 
					СтрокаПараметра = _сф.к_НайтиСтроку(РедактируемыйОбъект[ИмяТЧ],"Параметр",ПараметрВыбора.Значение);
					Если СтрокаПараметра <> Неопределено Тогда
						НовыйПараметр = Новый ПараметрВыбора(ПараметрВыбора.РеквизитОтбора,СтрокаПараметра.Значение);
						МассивПараметровВыбора.Добавить(НовыйПараметр);
					КонецЕсли;	
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		//Элементы.Значение.ВыборГруппИЭлементов=ГруппыИЭлементы.ГруппыИЭлементы;
		
		ПараметрыФормыВыбора = Новый Структура("ИмяФормы,ПараметрыФормы,ПараметрыВыбора","",Новый Структура,Новый Массив);
		Для каждого Стр Из МассивПараметровВыбора Цикл
			
			// 
			ТипПараметра = Параметр.ТипЗначения.Типы()[0];
			СсылкаТипа = Новый(ТипПараметра);
			ПараметрыФормыВыбора.ИмяФормы = СсылкаТипа.Метаданные().ПолноеИмя()+".ФормаВыбора";
			// --- 
			Если (Стр.Имя = "Отбор.Родитель") Тогда
				
				// ПараметрВыбора.Значение.Ссылка.Метаданные().ПолноеИмя()
				
				ПараметрыФормыВыбора.ИмяФормы = Стр.Значение.Метаданные().ПолноеИмя()+".ФормаВыбора";
				ПараметрыФормыВыбора.ПараметрыФормы.Вставить("РежимВыбора",Истина);
				
				Если (Стр.Значение.Метаданные().ПолноеИмя()="Справочник.Контрагенты") Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
					|	Контрагенты.Ссылка
					|ИЗ
					|	Справочник.Контрагенты КАК Контрагенты
					|ГДЕ
					|	Контрагенты.Родитель = &Родитель";
					Запрос.УстановитьПараметр("Родитель",Стр.Значение);
					Первый = _сф.ВыполнитьЗапрос(Запрос,,Истина,"Ссылка",Неопределено);
					Если (Первый <> Неопределено) Тогда
						
						ПараметрыФормыВыбора.ПараметрыФормы.Вставить("ТекущаяСтрока",Первый);
						
					Иначе
						
						ПараметрыФормыВыбора.ПараметрыФормы.Вставить("ТекущаяСтрока",Стр.Значение);
						
					КонецЕсли; 
					
				Иначе
					
					ПараметрыФормыВыбора.ПараметрыФормы.Вставить("ТекущаяСтрока",Стр.Значение);
					
				КонецЕсли; 
				
				ПН = Новый НастройкиКомпоновкиДанных;
				ЭлементОтбора = ПН.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				ЭлементОтбора.ПравоеЗначение = Стр.Значение;
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.Применение=ТипПримененияОтбораКомпоновкиДанных.ТолькоИерархия;
				ПараметрыФормыВыбора.ПараметрыФормы.Вставить("ФиксированныеНастройки", ПН);
				
				
			Иначе
				
				ПараметрыФормыВыбора.ПараметрыВыбора.Добавить(Стр);
				ПараметрыФормыВыбора.ПараметрыФормы.Вставить("РежимВыбора",Истина);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		// добавляем параметры выбора в отбор
		ПараметрыФормыВыбора.ПараметрыФормы.Вставить("Отбор",Новый Структура);
		Для каждого Стр Из ПараметрыФормыВыбора.ПараметрыВыбора Цикл
			
			ПараметрыФормыВыбора.ПараметрыФормы.Отбор.Вставить(СтрЗаменить(Стр.Имя,"Отбор.",""),Стр.Значение);
			
		КонецЦикла; 
		
	Возврат ПараметрыФормыВыбора.ПараметрыФормы;
		
	ИначеЕсли Параметр.ВариантОтбора=Перечисления.CW_ВариантыОтбораДляПараметров.ВнешняяОбработка Тогда
		
		ОбработкаОбъект = _ПО.ПолучитьОбработку(Параметр.ВнешняяОбработкаОтбора);
		// Параметры:
		// Параметр - текущий редактируемый параметр
		// РедактируемыйОбъект - грузоперевозка, заявки или другое
		// ТекущееЗначение - Текущее значение параметра
		// ВозвращаемоеЗначение: Структура:
		// ИмяФормы - полное имя формы
		// ПараметрыФормы - внезапно, параметры формы
		// ПараметрыВыбора - массив фиксированных структур или пустой массив (?) - зачем он нужен не очень понятно
		// --- 
		// пример заполнения структуры в предыдущей ветке
		// --- 
		ПараметрыФормыВыбора = ОбработкаОбъект.ПараметрыФормыВыбора(Параметр,РедактируемыйОбъект,Неопределено);
		ОбработкаОбъект = Неопределено;
		
		Возврат ПараметрыФормыВыбора.ПараметрыФормы; 
		
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции


&наКлиенте
Функция ПроверитьСостояниеВедомых(СтрокаДерева)
	
	ДоступностьСменыРежима = Истина;
	
	тЭлеметы = СтрокаДерева.ПолучитьЭлементы();
	ПроверитьСостояниеВедомыхРекурсивно(тЭлеметы, ДоступностьСменыРежима);
	
	Возврат ДоступностьСменыРежима;
	
КонецФункции

&наКлиенте
Процедура ПроверитьСостояниеВедомыхРекурсивно(тЭлеметы, ДоступностьСменыРежима)
	
	Если Не ДоступностьСменыРежима Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого стрЭлемент из тЭлеметы Цикл
		Если  стрЭлемент.ЭтоГруппа Тогда
			ЭлементСостояния = ДПГ_СостояниеСвертки.НайтиПоЗначению(стрЭлемент.ИдентификаторГруппы);
			Если ЭлементСостояния <> Неопределено Тогда
				Если ЭлементСостояния.Пометка Тогда
					ДоступностьСменыРежима = Ложь;
				КонецЕсли;
			КонецЕсли;
			Подчиненные = стрЭлемент.получитьЭлементы();
			ПроверитьСостояниеВедомыхРекурсивно(подчиненные, ДоступностьСменыРежима);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкуРаскрытияГруппы(Идентификатор)
	
	мНайденныеСтроки = Объект.ГруппыПараметровГрузоперевозки.НайтиСтроки(Новый Структура("Идентификатор",Идентификатор));
	
	Если мНайденныеСтроки.Количество() = 0 Тогда
		//Странно... группа есть, а строки нет
		//получим настройку из параметров
		
		CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"РазворачиватьДеревоПараметровГрузоперевозок");		
	Иначе
		Возврат мНайденныеСтроки[0].Раскрывать;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция _ПроверитьЗаполнениеВедущих(Параметр,СписокВедущих)
	// --- 
	
	// контроллируем заполнение и единство
	ФлагОшибки = Ложь;
	ТекстОшибки = "";
	Для каждого ВедущийПГ Из СписокВедущих Цикл
		
		// проверяем параметр у переданных объектов
		МассивНепустыхЗначений = Новый Массив;
		
		ВедущийПараметр = ВедущийПГ.Значение;
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,"Параметр",ВедущийПараметр);
		Если СтрокаПараметра = Неопределено Тогда
			
			ЗначениеПараметра = Неопределено;
			
		Иначе
			
			ЗначениеПараметра = СтрокаПараметра.Значение;
			
		КонецЕсли; 
		Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			
			_сф.м_ДобавитьУникально(МассивНепустыхЗначений,ЗначениеПараметра);
			
		Иначе
			
			ФлагОшибки = Истина;
			ТекстОшибки = "";
			
		КонецЕсли; 
		
		
		// теперь если нет ошибки считаем количество
		// если не 1, то выдаём ошибку
		Если НЕ ФлагОшибки Тогда
			
			Если МассивНепустыхЗначений.Количество() <> 1 Тогда
				
				ФлагОшибки = Истина;
				ТекстОшибки = ""
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если ФлагОшибки Тогда
			
			// тут необходимо закрыть форму и вернуть описание ошибки
			ТекстОшибки = "Условия отбора для выбранного параметра ("""+Параметр.Наименование+""") требуют, чтобы было задано значение параметра """+ВедущийПараметр.Наименование+""".";
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

#КонецОбласти 

#Область СостояниеСвертки 

&НаСервере
Функция УстановитьСостояниеСверткиСтроки(ИдентификаторСтроки, ИдентификаторГруппы, Развернута=Истина)

	ЭлементСостояния = ДПГ_СостояниеСвертки.НайтиПоЗначению(ИдентификаторГруппы);
	Если (ЭлементСостояния = Неопределено) Тогда
		ЭлементСостояния = ДПГ_СостояниеСвертки.Добавить(ИдентификаторГруппы);
	КонецЕсли; 
	ЭлементСостояния.Представление 	= Формат(ИдентификаторСтроки,"ЧДЦ=; ЧН=; ЧГ=");
	ЭлементСостояния.Пометка 		= Развернута;
	
КонецФункции

&НаКлиенте
Процедура ВосстановитьСостояниеСверткиДерева()
	
	Для каждого Стр Из ДПГ.ПолучитьЭлементы() Цикл
		ВосстановитьСостояниеСверткиСтроки(Стр.ПолучитьИдентификатор());
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьСостояниеСверткиСтроки(Идентификатор)
	
	СтрокаДерева 		= ДПГ.НайтиПоИдентификатору(Идентификатор);
	ЭлементСостояния 	= ДПГ_СостояниеСвертки.НайтиПоЗначению(СтрокаДерева.ИдентификаторГруппы);
	
	Если ЭлементСостояния <> Неопределено Тогда
		
		Если ЭлементСостояния.Пометка Тогда
			Элементы.ДПГ.Развернуть(СтрокаДерева.ПолучитьИдентификатор());
		Иначе
			Элементы.ДПГ.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
		конецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция СохранитьСостояниеСверткиСтроки(ИдентификаторСтроки,Признак)
	// --- 
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (СтрокаДерева = Неопределено) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	// --- 
	СтрокиГрупп = Объект.ГруппыПараметровГрузоперевозки.НайтиСтроки(Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
	Если (СтрокиГрупп.Количество() <> 0) Тогда
		СтрокаГруппы = СтрокиГрупп[0];
		СтрокаГруппы.Раскрывать = Признак;
	КонецЕсли; 
	// --- 
	ЭлементСостояния = ДПГ_СостояниеСвертки.НайтиПоЗначению(СтрокаДерева.ИдентификаторГруппы);
	Если (ЭлементСостояния = Неопределено) Тогда
		ЭлементСостояния = ДПГ_СостояниеСвертки.Добавить(СтрокаДерева.ИдентификаторГруппы);
	КонецЕсли; 
	ЭлементСостояния.Представление = Формат(ИдентификаторСтроки,"ЧДЦ=; ЧН=; ЧГ=");
	ЭлементСостояния.Пометка = Признак;
	
	// --- 
КонецФункции


&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	тЭлементы = ДПГ.ПолучитьЭлементы();
	СвернутьРекурсивно(тЭлементы); 
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРекурсивно(тЭлементы)
	
	Для Каждого тСтр Из тЭлементы Цикл
		тСтрЭлементы = тСтр.ПолучитьЭлементы();
		СвернутьРекурсивно(тСтрЭлементы);
		
		Элементы.ДПГ.Свернуть(тСтр.ПолучитьИдентификатор());
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	тЭлементы = ДПГ.ПолучитьЭлементы();
	Для Каждого тСтр Из тЭлементы Цикл
		Элементы.ДПГ.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

#Область ДобавлениеЭлементов 

&НаКлиенте
Процедура ДеревоПараметровГППередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если ЗначениеЗаполнено(ДатаБлокировкиМониторинга) тогда
		Возврат;
	КонецЕсли;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПараметра",ЭтотОбъект);
	
	ПарамерыФормыВыбора = Новый Структура;
	ПарамерыФормыВыбора.Вставить("ВыборГруппИЭлементов"	,ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПарамерыФормыВыбора.Вставить("Множественныйвыбор"	,Истина);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПарамерыФормыВыбора,Элемент,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПараметра(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	Если ТипЗнч(Ответ) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
		Ответ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответ);
	КонецЕсли;
	
	Если (Ответ <> Неопределено) Тогда
		Модифицированность = Истина;
		// --- 
		МассивДобавляемых = Новый Массив;
		ОдиночныйВыбор = Ответ.Количество() = 1;
		
		Для Каждого Параметр из Ответ Цикл
			
			// если группа
			Если (_ПараметрЯвляетсяГруппой(Параметр)) Тогда
				МассивДобавляемых = _ЭлементыГруппыПараметров(Параметр);
			Иначе
				МассивДобавляемых.Добавить(Параметр);
			КонецЕсли; 
			
		КонецЦикла;
		
		Если  ОдиночныйВыбор Тогда
			ДобавляемыйПараметр = Ответ[0];
			Если Не ДобавляемыйПараметрНовый(ДобавляемыйПараметр) Тогда
				// позиционируемся на выбранный элемент
				Идентификатор = _ИдентификаторСтрокиПараметра(ДобавляемыйПараметр);
				Если (Идентификатор <> Неопределено) Тогда
					Элементы.ДПГ.ТекущаяСтрока = Идентификатор;	
				КонецЕсли; 
				//_УФК.ВывестиПредупреждение("Параметр уже добавлен.");
				Возврат;
			КонецЕсли;
		КонецЕсли; 
		
		Для каждого ДобавляемыйПараметр Из МассивДобавляемых Цикл
			
			// проверяем, что параметр новый
			Если (ДобавляемыйПараметрНовый(ДобавляемыйПараметр)) Тогда
				
				ИдентификаторДобавленнойСтроки = _ДобавитьПараметр(ДобавляемыйПараметр);
				
				// ракрываем строку родителя, если свернута
				ДобавленнаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторДобавленнойСтроки);
				РодительДобавленнойСтроки = ДобавленнаяСтрока.ПолучитьРодителя();
				Если (РодительДобавленнойСтроки <> Неопределено) Тогда
					
					ИдентификаторРодителяДобавленнойСтроки = РодительДобавленнойСтроки.ПолучитьИдентификатор();
					Если (НЕ Элементы.ДПГ.Развернут(ИдентификаторРодителяДобавленнойСтроки)) Тогда
						Элементы.ДПГ.Развернуть(ИдентификаторРодителяДобавленнойСтроки);
						СохранитьСостояниеСверткиСтроки(ИдентификаторРодителяДобавленнойСтроки,Истина);
					КонецЕсли; 
					// --- 
					ДПГ_ТекущаяГруппа = РодительДобавленнойСтроки.ИдентификаторГруппы;
					
				Иначе
					
					ДПГ_ТекущаяГруппа = 0;
					
				КонецЕсли; 
				
				// позиционируемся на добавленный элемент
				Элементы.ДПГ.ТекущаяСтрока = ИдентификаторДобавленнойСтроки;
				// --- 
				ДПГ_ТекущийПараметр = ДобавленнаяСтрока.Параметр;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		// --- 
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПараметрЯвляетсяГруппой(Параметр)
	// --- 
	
	Возврат(Параметр.ЭтоГруппа);
	
	// --- 
КонецФункции

&НаСервере
Функция _ЭлементыГруппыПараметров(ГруппаПараметров)
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.Ссылка В ИЕРАРХИИ(&Ссылка)
	               |	И CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", ГруппаПараметров);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат(ТЗ.ВыгрузитьКолонку("Ссылка"));
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ИдентификаторСтрокиПараметра(Параметр)
	// --- 
	
	ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Параметр);
	Если (ЭлементКартыПараметров = Неопределено) Тогда
		Сообщить("Для параметра """+Строка(Параметр)+""" в карте параметров не найден идентификатор строки.");
		Возврат(Неопределено);
	Иначе
		
		Возврат(Число(ЭлементКартыПараметров.Представление));
		
	КонецЕсли; 
	
	// --- 
КонецФункции
 

&НаКлиенте
Функция ДобавляемыйПараметрНовый(Параметр)
	// --- 
	
	Отбор = Новый Структура("Параметр",Параметр);
	СтрокиПараметра = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
	Возврат(СтрокиПараметра.Количество()=0);
	
	// --- 
КонецФункции
  
&НаСервере
Функция ТекущийРодитель()
	// --- 
	
	Если (Элементы.ДПГ.ТекущаяСтрока <> Неопределено) Тогда
		
		ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
		ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		РодительТекущейСтроки = ТекущаяСтрока.ПолучитьРодителя();
		Если (РодительТекущейСтроки <> Неопределено) Тогда
			Возврат(РодительТекущейСтроки);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат(ДПГ);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДобавитьПараметр(Параметр)
	// --- 
	//Новый механизм
	ИдентификаторГруппыВладельца = Неопределено;
	//Новый механизм
	
	// добавляем в ТЧ параметров
	СтрокаПараметра = Объект.ПараметрыГрузоперевозки.Добавить();
	СтрокаПараметра.Параметр = Параметр;
	СтрокаПараметра.Значение = Параметр.ТипЗначения.ПривестиЗначение(Неопределено); 
	// добавляем в дерево
	Если (Элементы.ДПГ.ТекущаяСтрока <> Неопределено) Тогда
		ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
		ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (ТекущаяСтрока.ЭтоГруппа) Тогда
			ТР = ТекущаяСтрока;
		Иначе
			ТР = ТекущийРодитель();	
		КонецЕсли; 
		//Новый механизм
		Если ТР <> ДПГ Тогда
			ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
		КонецЕсли;
		//Новый механизм
	Иначе
		ТР = ТекущийРодитель();
	КонецЕсли; 
	
	//Новый механизм
	Если ИдентификаторГруппыВладельца <>  Неопределено Тогда
		ОтборСтрок = Новый Структура("Идентификатор",ТР.ИдентификаторГруппы);
		мСтрокиГрупп = Объект.ГруппыПараметровГрузоперевозки.НайтиСтроки(ОтборСтрок);
		Если мСтрокиГрупп.Количество() > 0 Тогда
			СтрокаГруппы = мСтрокиГрупп[0];
			СтрокаПараметра.ИдентификаторВладельца = СтрокаГруппы.ИдентификаторГруппы; 	
		КонецЕсли;
	КонецЕсли; 
	//Новый механизм  
	
	//ХранениеПолногоЗначения
	ДобавитьСохраняемоеПолноеЗначение(СтрокаПараметра.Параметр);
	//---ХранениеПолногоЗначения
	
	// --- 
	СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
	// заполняем строку дерева
	_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева,СтрокаПараметра);
	// записываем принадлежность параметра группе
	ГруппаСтроки = _ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева);
	_ДобавитьЭлементГруппы(Параметр, ГруппаСтроки);
	СтрокаДерева.ИдентификаторГруппы = ГруппаСтроки.Идентификатор;
	
	// записываем в карту 
	Идентификатор = СтрокаДерева.ПолучитьИдентификатор();
	// --- 
	ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Параметр);
	Если (ЭлементКартыПараметров = Неопределено) Тогда
		ЭлементКартыПараметров = КартаПараметровДерева.Добавить(Параметр);
	КонецЕсли; 
	ЭлементКартыПараметров.Представление = Формат(Идентификатор,"ЧЦ=10; ЧДЦ=; ЧН=0; ЧГ=");
	// --- 
	_ПроверитьГруппыПоИерархии(СтрокаДерева);	
	// --- 
	Возврат(Идентификатор);
	
	// --- 
КонецФункции

&НаСервере
Функция _ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева)
	// --- 
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтроки = Неопределено) Тогда
		СтрокаГруппы = Объект.ГруппыПараметровГрузоперевозки[0];
	Иначе
		Отбор = Новый Структура("Идентификатор", РодительСтроки.ИдентификаторГруппы);
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки, Отбор);
	КонецЕсли; 
	
	Возврат(СтрокаГруппы);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ДобавитьЭлементГруппы(Элемент, СтрокаГруппы, НовыйПредыдущий=Неопределено)
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	Если (НовыйПредыдущий =  Неопределено) Тогда
		МассивВедомых.Добавить(Элемент);
	Иначе
		
		ИндексПредыдущего = МассивВедомых.Найти(НовыйПредыдущий);
		Если (ИндексПредыдущего <> Неопределено) Тогда
			МассивВедомых.Вставить(ИндексПредыдущего,Элемент);
		Иначе
			МассивВедомых.Добавить(Элемент);
		КонецЕсли; 
		
	КонецЕсли; 
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	Если (ТипЗнч(Элемент)=Тип("Число")) Тогда
		
		ДПГ_ТекущаяГруппа = Элемент;
		ДПГ_ТекущийПараметр = Неопределено;
		
	Иначе
		
		ДПГ_ТекущаяГруппа = СтрокаГруппы.Идентификатор;
		ДПГ_ТекущийПараметр = Элемент;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ПереместитьЭлементГруппы(Элемент, СтрокаГруппы, НовыйПредыдущий);
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	// --- 
	Если (НовыйПредыдущий = Неопределено ) Тогда
		
		ИндексЭлемента = МассивВедомых.Найти(Элемент);
		МассивВедомых.Удалить(ИндексЭлемента);
		МассивВедомых.Добавить(Элемент);
		
	Иначе
		
		ИндесНовогоПредыдущего = МассивВедомых.Найти(НовыйПредыдущий);
		ИндексЭлемента = МассивВедомых.Найти(Элемент);
		МассивВедомых.Удалить(ИндексЭлемента);
		МассивВедомых.Вставить(ИндесНовогоПредыдущего,Элемент);
		
	КонецЕсли; 
	// --- 
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _УдалитьЭлементГруппы(Элемент, СтрокаГруппы)
	// --- 
	
	МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
	МассивВедомых.Удалить(МассивВедомых.Найти(Элемент));
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивВедомых);
	
	// --- 
КонецПроцедуры
 
#КонецОбласти 

#Область РедактированиеЭлементов

&НаСервере
Функция _АдресОбъекта()  
	
	ТаблицаПараметров = Объект.ПараметрыГрузоперевозки.Выгрузить();
	ТаблицаПараметров.Колонки.Добавить("ХранилищеДанных"); 
	ТаблицаПараметров.Очистить(); 
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого СтрокаТаблицы из ТОбъект.ПараметрыГрузоперевозки Цикл
		НоваяСтрока = ТаблицаПараметров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы); 
		
		НоваяСтрока.ХранилищеДанных = Новый ХранилищеЗначения(СтрокаТаблицы.ХранилищеДанных.Получить());
	КонецЦикла;
	
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Ссылка", 			Объект);
	СтруктураОбъекта.Вставить("ТаблицаПараметров", 	ТаблицаПараметров); 
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураОбъекта,ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция _ТолькоПросмотрПараметра(Параметр)
	
	ТолькоПросмотрПараметра = Истина;
	
	НаборПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	Попытка
		ТолькоПросмотрПараметра = (НЕ НаборПрав["п_"+_сф.КлючПоСсылке(Параметр)].Редактирование);
	Исключение
		ТолькоПросмотрПараметра = Истина;
	КонецПопытки; 
	
	Если НЕ ТолькоПросмотрПараметра Тогда
		// проверим, что параметр не указан в связанном объекте оборудования
		Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеМониторингаОборудования") Тогда
			Если ЗначениеЗаполнено(Объект.ОтслеживаемоеОборудование) Тогда
				СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(Объект.ОтслеживаемоеОборудование,Параметр);
				Если СтрокаПараметра <> Неопределено Тогда
					ТолькоПросмотрПараметра = Истина;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат ТолькоПросмотрПараметра;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеПараметра(Ответ,ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если ТипЗнч(Ответ) <> Тип("Структура") И ТипЗнч(Ответ) <> Тип("Массив") Тогда
			//В случае если ответ форме не имеет тип структура, поместим его в структуру для последующей обработки
			Ответ = _ПО.ПолучитьСтруктуруОтветаВнешнейФормы(Ответ, ДополнительныеПараметры.Параметр);
		КонецЕсли;
		
		Если ТипЗнч(Ответ) <> Тип("Массив") Тогда
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Ответ);
		Иначе
			МассивПараметров = Ответ;
		КонецЕсли;
		
		Для каждого ОтветСтруктура из МассивПараметров Цикл
			Если (ОтветСтруктура.ПараметрИзменен) Тогда
				
				Если (ДополнительныеПараметры.СвойстваПараметра = Неопределено) Тогда
					СписокВедомых = Неопределено;
				Иначе	
					СписокВедомых = ДополнительныеПараметры.СвойстваПараметра.СписокВедомых;
				КонецЕсли; 
				// --- 
				Ответ = _ОбновитьПараметр(ОтветСтруктура, СписокВедомых);	
				Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
					
					Модифицированность = Истина;
					ТребуетсяПолноеОбновление = Ложь;
					Ответ.Свойство("ПолноеОбновление",ТребуетсяПолноеОбновление);
					Если (ТребуетсяПолноеОбновление) Тогда
						
						ОбновитьДеревоПараметров();
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция _ОбновитьПараметр(СтруктураПараметра, СписокВедомых)
	// --- 
	
	Параметр = СтруктураПараметра.Параметр;
	// --- 
	КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	СП = КартаСвойств.Получить(Параметр);
	КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	НП = КартаПрав["п_"+_сф.КлючПоСсылке(Параметр)];
	// --- 
	ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Параметр);
	Если (ЭлементКартыПараметров = Неопределено) Тогда
		
		Сообщить("Для параметра """+Строка(Параметр)+""" в карте параметров не найден идентификатор строки.");
		ИдентификаторСтрокиДерева = Неопределено;
		
	Иначе
		
		ИдентификаторСтрокиДерева = Число(ЭлементКартыПараметров.Представление);
		
	КонецЕсли; 
	Если (ИдентификаторСтрокиДерева = Неопределено) Тогда
		
		// добавляем...
		Если (Элементы.ДПГ.ТекущаяСтрока <> Неопределено) Тогда
			ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
			ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
			Если (ТекущаяСтрока.ЭтоГруппа) Тогда
				ТР = ТекущаяСтрока;
			Иначе
				ТР = ТекущийРодитель();	
			КонецЕсли; 
		Иначе
			ТР = ТекущийРодитель();
		КонецЕсли; 
		// --- 
		СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
		
	Иначе
		
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);	
		
	КонецЕсли; 
	// --- 
	СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,Новый Структура("Параметр",Параметр));
	Если (СтруктураПараметра.Значение <> Неопределено) Тогда
		СтрокаПараметра.Значение = СтруктураПараметра.Значение;
	КонецЕсли; 
	Если (СтрокаПараметра.ЗначениеПлан <> Неопределено) Тогда
		СтрокаПараметра.ЗначениеПлан = СтруктураПараметра.ЗначениеПлан;
	КонецЕсли;
	Если (СтрокаПараметра.ЗначениеФакт <> Неопределено) Тогда
		СтрокаПараметра.ЗначениеФакт = СтруктураПараметра.ЗначениеФакт;
	КонецЕсли;
	Если (СтрокаПараметра.Примечание <> Неопределено) Тогда
		СтрокаПараметра.Примечание = СтруктураПараметра.Примечание;
	КонецЕсли;
	// --- 
	Если (СП.ЭтоКонтрольнаяДата) Тогда
		Если (ЗначениеЗаполнено(СтрокаПараметра.ЗначениеФакт)) Тогда
			СтрокаПараметра.Значение = СтрокаПараметра.ЗначениеФакт;
		Иначе
			СтрокаПараметра.Значение = СтрокаПараметра.ЗначениеПлан;
		КонецЕсли; 
	КонецЕсли;  

	//ХранениеПолногоЗначения     
	Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда 
		ДобавитьСохраняемоеПолноеЗначение(Параметр, СтруктураПараметра.ПолноеЗначение);             
	КонецЕсли;
	//---ХранениеПолногоЗначения
	
	// --- 
	_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева, СтрокаПараметра, СП, НП);
	// --- 
	Если (СписокВедомых <> Неопределено) Тогда
		Если (СписокВедомых.Количество() <> 0) Тогда
			
			Для каждого ЭлементСписка Из СписокВедомых Цикл
				
				ВедомыйПараметр = ЭлементСписка.Значение;
				// ---------------------------------------------------------------------------- 
				ВедомыйЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(ВедомыйПараметр);
				Если (ВедомыйЭлементКартыПараметров <> Неопределено) Тогда
					
					СвойстваВедомогоПараметра = CW_Мониторинг.СтруктураСвойствПараметра(ВедомыйПараметр);
					
					СтруктураВедомогоПараметра = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
					СтруктураВедомогоПараметра.Параметр 		= ВедомыйПараметр;
					СтруктураВедомогоПараметра.ПараметрИзменен 	= Истина;    
					СтруктураВедомогоПараметра.Значение 		= Новый(ВедомыйПараметр.ТипЗначения.Типы()[0]);    
					                                        	
					_ОбновитьПараметр(СтруктураВедомогоПараметра, СвойстваВедомогоПараметра.СписокВедомых);
					
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли; 
	КонецЕсли; 
	// --- 
	// проверяем, не подключены ли к параметру обработчики изменения
	ТребуетсяПолноеОбновление = Ложь;
	Если (СП.ОбработкаИзменения) Тогда
		
		Если (ЗначениеЗаполнено(Параметр.ВнешняяОбработкаИзменения)) Тогда
			
			ОбработкаОбъект = _ПО.ПолучитьОбработку(Параметр.ВнешняяОбработкаИзменения);  
			
			Попытка
				ПараметрыПроцедуры = новый Структура;
				ПараметрыПроцедуры.Вставить("ВнешняяОбработка",	Параметр.ВнешняяОбработкаИзменения);
				ПараметрыПроцедуры.Вставить("Объект", 			Объект);
				ПараметрыПроцедуры.Вставить("Форма", 			ЭтаФорма);
				ПараметрыПроцедуры.Вставить("СтрокаПараметра", 	СтрокаПараметра);
				
				Результат = ОбработкаОбъект.ВыполнитьОбработкуИзмененияПараметра(ПараметрыПроцедуры); 
			Исключение
				//Поддержка старых версий обработок
				Результат = ОбработкаОбъект.ОбработкаИзмененияПараметра(Объект,ЭтаФорма,СтрокаПараметра);
			КонецПопытки;
			
			ОбработкаОбъект = Неопределено;
			// --- 
			Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
				
				// параметры
				ТаблицаПараметров = Неопределено;
				Результат.Свойство("ТаблицаПараметров",ТаблицаПараметров);
				Если (ТаблицаПараметров <> Неопределено) Тогда
					
					Для каждого Стр Из ТаблицаПараметров Цикл
						
						Отбор = Новый Структура("Параметр", Стр.Параметр);
						ЗаполняемаяСтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,Отбор);
						Если (ЗаполняемаяСтрокаПараметра = Неопределено) Тогда
							ЗаполняемаяСтрокаПараметра = Объект.ПараметрыГрузоперевозки.Добавить(); 
							
							//ХранениеПолногоЗначения
							ДобавитьСохраняемоеПолноеЗначение(Стр.Параметр, Стр.Значение);
							//---ХранениеПолногоЗначения
							
							ТребуетсяПолноеОбновление = Истина;
						КонецЕсли; 
						ЗаполнитьЗначенияСвойств(ЗаполняемаяСтрокаПараметра, Стр);
						Если (НЕ ТребуетсяПолноеОбновление) Тогда
							
							// находим строку дерева этого параметра и обновляем её
							ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Стр.Параметр);
							Если (ЭлементКартыПараметров = Неопределено) Тогда
								
								Сообщить("Для параметра """+Строка(Стр.Параметр)+""" в карте параметров не найден идентификатор строки.");
								ИдентификаторСтрокиДерева = Неопределено;
								
							Иначе
								
								ИдентификаторСтрокиДерева = Число(ЭлементКартыПараметров.Представление);
								
							КонецЕсли; 
							// --- 
							Если (ИдентификаторСтрокиДерева <> Неопределено) Тогда
								
								СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
								Если (СтрокаДерева <> Неопределено) Тогда
									СП = КартаСвойств.Получить(Стр.Параметр);
									НП = КартаПрав["п_"+_сф.КлючПоСсылке(Стр.Параметр)];
									_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева, ЗаполняемаяСтрокаПараметра, СП, НП);	
								КонецЕсли; 
								
							КонецЕсли; 
							
						КонецЕсли; 
						
					КонецЦикла; 
					
				КонецЕсли;
				
				// реквизиты
				СтруктураРеквизитов = Неопределено;
				Результат.Свойство("СтруктураРеквизитов",СтруктураРеквизитов);
				Если (СтруктураРеквизитов <> Неопределено) Тогда
					
					ЗаполнитьЗначенияСвойств(Объект, СтруктураРеквизитов);
					
				КонецЕсли; 
				
			Иначе
				
				Сообщить(_УФКС.ПредставлениеОшибки(Результат));
				
			КонецЕсли; 
			
			// --- 
			
		КонецЕсли; 
		
		// пересчитываем все дин. параметры
		ПересчитатьДинамическиеПараметры();	
		
	Иначе
		
		// просто пересчитываем параметры по текущему
		ПересчитатьДинамическиеПараметры(Параметр);	
		
	КонецЕсли; 
	
	Ответ = _УФКС.Ответ();
	Ответ.Вставить("ПолноеОбновление",ТребуетсяПолноеОбновление);
	Возврат(Ответ);
	
	// --- 
КонецФункции

&НаСервере
Функция ПересчитатьДинамическиеПараметры(ИзменившийсяПараметр=Неопределено)
	// --- 
	
	// пересчитываем и показываем
	КартаСвойствПараметров = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	ТаблицаДП = CW_Мониторинг.ДинамическиеПараметрыОбъекта(Объект,КартаСвойствПараметров,,Объект.ПараметрыГрузоперевозки.Выгрузить());
	Если (ТаблицаДП.Количество() <> 0) Тогда
		КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	КонецЕсли; 
	Для каждого Стр Из ТаблицаДП Цикл
		
		// в ТЧ
		Отбор = Новый Структура("Параметр",Стр.Параметр);
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,Отбор);
		Если (СтрокаПараметра <> Неопределено) Тогда
			
			СтрокаПараметра.Значение = Стр.Значение;
			// --- 
			ЭлементКартыПараметров = КартаПараметровДерева.НайтиПоЗначению(Стр.Параметр);
			Если (ЭлементКартыПараметров = Неопределено) Тогда
				
				Сообщить("Для параметра """+Строка(Стр.Параметр)+""" в карте параметров не найден идентификатор строки.");
				ИдентификаторСтрокиДерева = Неопределено;
				
			Иначе
				
				ИдентификаторСтрокиДерева = Число(ЭлементКартыПараметров.Представление);
				
			КонецЕсли;
			// --- 
			Если (ИдентификаторСтрокиДерева <> Неопределено) Тогда
				СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
				СП = КартаСвойствПараметров.Получить(Стр.Параметр);
				НП = КартаПрав["п_"+_сф.КлючПоСсылке(Стр.Параметр)];
				_ЗаполнитьСтрокуДереваПоПараметру(СтрокаДерева, СтрокаПараметра, СП, НП);
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецФункции

#КонецОбласти 

#Область ДобавлениеГруппЭлементов

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	// спрашиваем название группы
	ПараметрыФормы 	= Новый Структура("НоваяГруппа,РежимГрузоперевозки,ДоступнаСменаРежимаСвертки", Истина,Истина,Истина);
	ПОВ 			= Новый ОписаниеОповещения("ОбработатьВводНаименованияГруппы",ЭтотОбъект, Новый Структура()); 
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВиртуальнойГруппы",ПараметрыФормы,ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводНаименованияГруппы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Модифицированность 		= истина;
		РедактированиеГруппы 	= Ложь;
		
		ДополнительныеПараметры.Свойство("Редактирование",РедактированиеГруппы);
		Если (РедактированиеГруппы = Неопределено ) Тогда
			РедактированиеГруппы = Ложь;
		КонецЕсли;
		
		Если (РедактированиеГруппы) Тогда
			ИдентификаторСтроки = _ОбновитьГруппу(Элементы.ДПГ.ТекущаяСтрока,Ответ);
		Иначе
			ИдентификаторСтроки = _ДобавитьГруппу(Ответ);	
		КонецЕсли; 
		
		//Обнолвение пометок вышестоящий групп
		ОбновитьРаскрытиеВышеСтоящихГрупп(ИдентификаторСтроки, Ответ.ГруппаРазвернута);
	
		ИдентификаторГруппы = ДПГ.НайтипоИдентификатору(ИдентификаторСтроки).ИдентификаторГруппы;
		УстановитьСостояниеСверткиСтроки(ИдентификаторСтроки, ИдентификаторГруппы, Ответ.ГруппаРазвернута);
		//ВосстановитьСостояниеСверткиСтроки(ИдентификаторСтроки);

	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРаскрытиеВышеСтоящихГрупп(ИдентификаторСтроки,ГруппаРазвернута)
	
	Если Не ГруппаРазвернута Тогда
		//ничего делать не нужно, свертка вышестоящией группы от этого не зависит;
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = ДПГ.НайтипоИдентификатору(ИдентификаторСтроки);

	ОбработатьСверткуРодителяРекурсивно(СтрокаДерева,ГруппаРазвернута);
	
КонецПроцедуры

&наКлиенте
Процедура ОбработатьСверткуРодителяРекурсивно(СтрокаДерева, ГруппаРазвернута)
	
	РодительГруппы = СтрокаДерева.ПолучитьРодителя();
	
	Если РодительГруппы <> Неопределено Тогда
		
		СтруктураПараметров = новый Структура("НаименованиеГруппы,ГруппаРазвернута",РодительГруппы.НаименованиеГруппы,ГруппаРазвернута);
		_ОбновитьГруппу(РодительГруппы.ПолучитьИдентификатор(),СтруктураПараметров);
		
		УстановитьСостояниеСверткиСтроки(РодительГруппы.ПолучитьИдентификатор(), РодительГруппы.ИдентификаторГруппы, ГруппаРазвернута);

		ОбработатьСверткуРодителяРекурсивно(РодительГруппы, ГруппаРазвернута)
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция _ОбновитьГруппу(ИдентификаторСтрокиДерева,СтруктураПараметров)
	// --- 
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
	СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор",СтрокаДерева.ИдентификаторГруппы));
	// --- 
	СтрокаГруппы.Наименование 			= СтруктураПараметров.НаименованиеГруппы;
	СтрокаГруппы.Раскрывать 			= СтруктураПараметров.ГруппаРазвернута;
	// --- 
	_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы);
	// --- 
	_ПроверитьГруппыПоИерархии(СтрокаДерева);
	
	Возврат(ИдентификаторСтрокиДерева);
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ДобавитьГруппу(СтруктураПараметров)
	// --- 
	//Новый механизм
	ИдентификаторГруппыВладельца = Неопределено;
	//Новый механизм
	
	// создаем строку ТЧ
	СтрокаГруппы = Объект.ГруппыПараметровГрузоперевозки.Добавить();
	СтрокаГруппы.Идентификатор = _ИдентификаторНовойГруппы();
	
	СтрокаГруппы.Наименование 			= СтруктураПараметров.НаименованиеГруппы;
	СтрокаГруппы.Раскрывать 			= СтруктураПараметров.ГруппаРазвернута;
	
	
	СтрокаГруппы.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(Новый Массив);
	// --- 
	// создаем строку дерева
	Если (Элементы.ДПГ.ТекущаяСтрока <> Неопределено) Тогда
		ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
		ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (ТекущаяСтрока.ЭтоГруппа) Тогда
			ТР = ТекущаяСтрока;
		Иначе
			ТР = ТекущийРодитель();	
		КонецЕсли; 
		//Новый механизм
		Если ТР <> ДПГ Тогда
			ИдентификаторГруппыВладельца = ТР.ИдентификаторГруппы;
		КонецЕсли;
		//Новый механизм
	Иначе
		ТР = ТекущийРодитель();
	КонецЕсли; 
	
	//Новый механизм
	СтрокаГруппы.ИдентификаторГруппы = Новый УникальныйИдентификатор;
	Если ИдентификаторГруппыВладельца <>  Неопределено Тогда
		ОтборСтрок = Новый Структура("Идентификатор",ИдентификаторГруппыВладельца);
		мСтрокиГрупп = Объект.ГруппыПараметровГрузоперевозки.НайтиСтроки(ОтборСтрок);
		Если мСтрокиГрупп.Количество() > 0 Тогда
			СтрокаГруппыВладельца = мСтрокиГрупп[0];
			СтрокаГруппы.ИдентификаторВладельца = СтрокаГруппыВладельца.ИдентификаторГруппы; 	
		КонецЕсли;
	КонецЕсли;
	//Новый механизм

	// --- 
	СтрокаДерева = ТР.ПолучитьЭлементы().Добавить();
	// заполняем
	_ЗаполнитьСтрокуДереваПоГруппе(СтрокаДерева, СтрокаГруппы);
	// добавляем в массив элементов родителя
	_ДобавитьЭлементГруппы(СтрокаГруппы.Идентификатор, _ОпределитьСтрокуГруппуСтрокиДерева(СтрокаДерева));
	// --- 
	_ПроверитьГруппыПоИерархии(СтрокаДерева);
	// --- 
	Возврат(СтрокаДерева.ПолучитьИдентификатор());
	
	// --- 
КонецФункции

&НаСервере
Функция _ИдентификаторНовойГруппы()
	// --- 
	
	ТЗИ = Объект.ГруппыПараметровГрузоперевозки.Выгрузить(,"Идентификатор");
	ТЗИ.Сортировать("Идентификатор Возр");
	ПоследнийИдентификатор = _сф.к_ПоследнийЭлемент(ТЗИ).Идентификатор;
	НовыйИдентификатор = ПоследнийИдентификатор+1;
	Возврат(НовыйИдентификатор);
	
	// --- 
КонецФункции
 

#КонецОбласти 

#Область ПодборПараметров

&НаКлиенте
Процедура ПодборПараметров(Команда)
	
	ПараметрыФормыПодбора = Новый Структура;
	ПараметрыФормыПодбора.Вставить("МножественныйВыбор"	, Истина);
	ПараметрыФормыПодбора.Вставить("РежимВыбора"		, Истина);
	ПараметрыФормыПодбора.Вставить("ЗакрыватьПриВыборе"	, Истина);
	
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ПослеЗакрытияФормыПодбораПараметра", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.CW_ПодборПараметровГрузоперевозок",ПараметрыФормыПодбора, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПодбораПараметра(ВыбранныеЗначения, ДополнительныеПараметры) Экспорт
	
	ОбработкаВыбораПараметра(ВыбранныеЗначения, Неопределено);

КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПараметрИзменен" Тогда 
		_ОбновитьСвойстваПараметров();
		
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант" Тогда
		
		//Подистема.СобственныйТранспорт
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/ФинансыТранспортОбновить",Неопределено));
		//Подистема.СобственныйТранспорт
		
	ИначеЕсли ИмяСобытия = "ОбновитьДеревоПараметровГрузоперевозки" Тогда 
		Если ТипЗнч(Параметр) = Тип("Массив") И НЕ Параметр.Найти(Объект.Ссылка) = Неопределено 
			ИЛИ	 ТипЗнч(Параметр) = Тип("СправочникСсылка.CW_Грузоперевозки") И Параметр = Объект.Ссылка Тогда
			ЭтаФорма.Прочитать();
			ОбновитьДеревоПараметров();
		КонецЕсли
		
	ИначеЕсли ИмяСобытия = "ОбновитьДеревоПараметровГрузоперевозкиПоЗаказу" Тогда 
		Если ТипЗнч(Параметр) = Тип("Массив") И 
			НЕ Параметр.Найти(Объект.Заказ) = Неопределено	
			ИЛИ Параметр = Объект.Заказ Тогда
			
			ЭтаФорма.Прочитать();
			ОбновитьДеревоПараметров();
			
		КонецЕсли
		
	ИначеЕсли ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
		
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	ИначеЕсли  ИмяСобытия = "ОбновитьБюджеты" Тогда
		
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.CW_Грузоперевозки") И Параметр = Объект.Ссылка Тогда
			
			ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетРасходыОбновить", Неопределено));
			ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетДоходыОбновить" , Неопределено));
			
			//Сортировка бюджетов
			ВосстановитьСортировкуТаблицы("БюджетРасходы");
			ВосстановитьСортировкуТаблицы("БюджетДоходы");
			//Сортировка бюджетов
			
		КонецЕсли
		
		//Наличие прикрепленных файлов
	ИначеЕсли ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
		
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
		//Наличие прикрепленных файлов
		
	ИначеЕсли ИмяСобытия = "ФинансыДоходыОбновить" Тогда
		
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/ФинансыДоходыОбновить",Неопределено));
		
		
	ИначеЕсли ИмяСОбытия = "ЗаписьОтчетаЭкспедитора" Тогда
		
		УстановитьИтогиДинамическогоСписка();  
		
	КонецЕсли; 
	
КонецПроцедуры     

#КонецОбласти 

#Область УдалениеЭлементов 

&НаКлиенте
Процедура ДПГПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если ЗначениеЗаполнено(ДатаБлокировкиМониторинга) тогда
		Возврат;
	КонецЕсли;
	
	// --- 
	Идентификатор = Элементы.ДПГ.ТекущаяСтрока;
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(Идентификатор);
	
	Если СтрокаДерева.ПараметрЗаказа Тогда
		Возврат;
	КонецЕсли;
	
	// --- 
	Если (СтрокаДерева.УдалениеРазрешено) Тогда

		Если (СтрокаДерева.ЭтоГруппа) Тогда
			
			Если (СтрокаДерева.ПолучитьЭлементы().Количество() <> 0) Тогда
				
				ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияУдаленияГруппы",ЭтотОбъект, Новый Структура()); 
				ПоказатьВопрос(ПОВ,"Группа будет удалена вместе с параметрами. Продолжить?", РежимДиалогаВопрос.ДаНет);
				
			Иначе
				
				УдалитьСтрокуДерева(Идентификатор);
				
			КонецЕсли; 
			
		Иначе
			
			УдалитьСтрокуДерева(Идентификатор);
			ЭтаФорма.Модифицированность=Истина;
			
		КонецЕсли; 
		
	Иначе
		
		Если (СтрокаДерева.ПредопределенныйПараметр) Тогда
			
			Если (СтрокаДерева.ЭтоГруппа) Тогда
				
				_УФК.ВывестиПредупреждение("Группа содержит предопределённые параметры.");
				Возврат;
				
			Иначе
				
				_УФК.ВывестиПредупреждение("Нельзя удалить предопределённые параметр.");
				Возврат;
				
			КонецЕсли;
			
		Иначе
			
			_УФК.ВывестиПредупреждение("Недостаточно прав для данного действия.");
			Возврат;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодтвержденияУдаленияГруппы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			УдалитьСтрокуДерева(Элементы.ДПГ.ТекущаяСтрока);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура УдалитьСтрокуДерева(Идентификатор)
	// --- 
	Модифицированность = Истина;
	
	НоваяТекущаяСтрока = Неопределено;
	// --- 
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(Идентификатор);
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		КоллекцияСтрок = ДПГ.ПолучитьЭлементы();
	Иначе
		КоллекцияСтрок = РодительСтрокиДерева.ПолучитьЭлементы();
	КонецЕсли; 
	КоличествоЭлементовКоллекции = КоллекцияСтрок.Количество();
	Если (КоличествоЭлементовКоллекции > 1) Тогда
		
		// получаем индекс
		ИндексУдаляемойСтроки = КоллекцияСтрок.Индекс(СтрокаДерева);
		Если (ИндексУдаляемойСтроки <> КоличествоЭлементовКоллекции-1) Тогда
			НоваяТекущаяСтрока = КоллекцияСтрок[ИндексУдаляемойСтроки+1].ПолучитьИдентификатор();
		Иначе 
			НоваяТекущаяСтрока = КоллекцияСтрок[ИндексУдаляемойСтроки-1].ПолучитьИдентификатор();
		КонецЕсли; 
		
	Иначе
		
		Если (РодительСтрокиДерева <> Неопределено) Тогда
			
			НоваяТекущаяСтрока = РодительСтрокиДерева.ПолучитьИдентификатор();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// удаляем рекурсивно группы/параметры
	Результат = _УдалитьПараметрыРекурсивно(Идентификатор);
	Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
		
		// удаляем строку дерева
		_УдалитьСтрокуДерева(Идентификатор);
		
		Если (НоваяТекущаяСтрока <> Неопределено ) Тогда
			
			Элементы.ДПГ.ТекущаяСтрока = НоваяТекущаяСтрока;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _УдалитьПараметрыРекурсивно(ИдентификаторСтроки)
	// --- 
	
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		ЭлементДПГ = СтрокаДерева.ИдентификаторГруппы;
	Иначе
		ЭлементДПГ = СтрокаДерева.Параметр;
	КонецЕсли; 
	
	// удаляем из родителя
	РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
	Если (РодительСтрокиДерева = Неопределено) Тогда
		СтрокаГруппы = Объект.ГруппыПараметровГрузоперевозки[0];
	Иначе
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор", РодительСтрокиДерева.ИдентификаторГруппы));
	КонецЕсли; 
	_УдалитьЭлементГруппы(ЭлементДПГ, СтрокаГруппы);
	
	// физически удаляем
	_УдалитьЭлементДПГ(ЭлементДПГ);
	// --- 
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Процедура _УдалитьЭлементДПГ(ЭлементДПГ)
	// --- 
	
	Если (ТипЗнч(ЭлементДПГ)=Тип("Число")) Тогда
		
		СтрокаГруппы = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор", ЭлементДПГ));
		МассивВедомых = ЗначениеИзСтрокиВнутр(СтрокаГруппы.ИдентификаторыВедомых);
		Для каждого Ведомый Из МассивВедомых Цикл
			
			_УдалитьЭлементДПГ(Ведомый);
			
		КонецЦикла; 
		// --- 
		Объект.ГруппыПараметровГрузоперевозки.Удалить(Объект.ГруппыПараметровГрузоперевозки.Индекс(СтрокаГруппы));
		
	Иначе
		
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,Новый Структура("Параметр",ЭлементДПГ));
		Объект.ПараметрыГрузоперевозки.Удалить(Объект.ПараметрыГрузоперевозки.Индекс(СтрокаПараметра));
		
		//ХранениеПолногоЗначения
		Если ЭлементДПГ.СохранятьПолноеЗначениеПараметра Тогда
			Соответствие = Новый Соответствие(СохраняемоеПолноеЗначение);
			Соответствие.Удалить(ЭлементДПГ); 
			СохраняемоеПолноеЗначение = Новый ФиксированноеСоответствие(Соответствие);
		КонецЕсли;
		//---ХранениеПолногоЗначения
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

#КонецОбласти 

#Область ПеремещениеЭлементов

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	СдвинутьСтроку(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	СдвинутьСтроку(1);
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьСтроку(Направление)
	// --- 
	
	ТекущаяСтрока = Элементы.ДПГ.ТекущаяСтрока;
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ТекущаяСтрока);
	РодительТекущейСтроки = СтрокаДерева.ПолучитьРодителя();
	Если (РодительТекущейСтроки = Неопределено) Тогда
		РодительТекущейСтроки = ДПГ;
		ГруппаРодитель = 0;
	Иначе
		ГруппаРодитель = РодительТекущейСтроки.ИдентификаторГруппы;	
	КонецЕсли; 
	// --- 
	КоллекцияСтрок = РодительТекущейСтроки.ПолучитьЭлементы();
	КоличествоСтрок = КоллекцияСтрок.Количество();
	Если (КоличествоСтрок = 1) Тогда
		Возврат;
	КонецЕсли; 
	ИндексТекущейСтроки = КоллекцияСтрок.Индекс(СтрокаДерева);
	// --- 
	// проверяем крайние положения
	// если уперлись - переносим в конец/начало
	Сдвиг = 0;
	ПредыдущееДействие = Неопределено;
	СледующееДействие = Неопределено;
	// --- 
	Если (ИндексТекущейСтроки = 0 И Направление=-1) Тогда
		
		Сдвиг = КоличествоСтрок-1; // с плюсом;
		ПредыдущаяСтрока = КоллекцияСтрок.Получить(КоличествоСтрок-1);
		Если (ПредыдущаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.Параметр;
		КонецЕсли; 
		
		
	ИначеЕсли (ИндексТекущейСтроки <> 0 И Направление=-1) Тогда 
		
		Сдвиг = -1;
		СледующаяСтрока = КоллекцияСтрок.Получить(ИндексТекущейСтроки+Сдвиг);
		Если (СледующаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторСледующейСтроки = СледующаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторСледующейСтроки = СледующаяСтрока.Параметр;
		КонецЕсли;
		
	ИначеЕсли (ИндексТекущейСтроки = КоличествоСтрок-1 И Направление=1) Тогда 
		
		 Сдвиг = -(КоличествоСтрок-1);
		 СледующаяСтрока = КоллекцияСтрок.Получить(0);
		 Если (СледующаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторСледующейСтроки = СледующаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторСледующейСтроки = СледующаяСтрока.Параметр;
		КонецЕсли;
		 
	ИначеЕсли (ИндексТекущейСтроки <> КоличествоСтрок-1 И Направление=1) Тогда 
		
		 Сдвиг = 1;
		 ПредыдущаяСтрока = КоллекцияСтрок.Получить(ИндексТекущейСтроки+Сдвиг);
		 Если (ПредыдущаяСтрока.ЭтоГруппа) Тогда
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.ИдентификаторГруппы;
		Иначе
			ИдентификаторПредыдущейСтроки = ПредыдущаяСтрока.Параметр;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Ответ = _ИзменитьПорядокСтроки(ГруппаРодитель, ТекущаяСтрока, ИдентификаторПредыдущейСтроки, ИдентификаторСледующейСтроки);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		КоллекцияСтрок.Сдвинуть(КоллекцияСтрок.Индекс(СтрокаДерева),Сдвиг);
		
	Иначе
		
		Сообщить(_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ИзменитьПорядокСтроки(ИдентификаторГруппыРодителя, ИдентификаторТекущейСтроки, ИдентификаторПредыдущейСтроки, ИдентификаторСледующейСтроки)
	// --- 
	
	Попытка
		
		Группа = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор",ИдентификаторГруппыРодителя));
		МассивЭлементов = ЗначениеИзСтрокиВнутр(Группа.ИдентификаторыВедомых);
		ТаблицаЭлементов = Новый ТаблицаЗначений;
		ТаблицаЭлементов.Колонки.Добавить("Идентификатор");
		Для каждого Элемент Из МассивЭлементов Цикл
			Нстр = ТаблицаЭлементов.Добавить();
			Нстр.Идентификатор = Элемент;
		КонецЦикла; 
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			СдвигаемоеЗначение = СтрокаДерева.ИдентификаторГруппы;
		Иначе
			СдвигаемоеЗначение = СтрокаДерева.Параметр;
		КонецЕсли; 
		СтрокаСдвигаемогоЗначения = _сф.к_НайтиСтроку(ТаблицаЭлементов, Новый Структура("Идентификатор",СдвигаемоеЗначение));
		// --- 
		Если (ИдентификаторПредыдущейСтроки <> Неопределено) Тогда
			
			ОтносительноеЗначение = ИдентификаторПредыдущейСтроки;
			//СтрокаДействия = _сф.к_НайтиСтроку(ТЧ, Новый Структура("Действие",ПредыдущееДействие));
			
		ИначеЕсли (ИдентификаторСледующейСтроки <> Неопределено) Тогда 
			
			ОтносительноеЗначение = ИдентификаторСледующейСтроки;
			
		КонецЕсли; 
		СтрокаОтносительногоЗначения = _сф.к_НайтиСтроку(ТаблицаЭлементов, Новый Структура("Идентификатор",ОтносительноеЗначение));
		Сдвиг = (ТаблицаЭлементов.Индекс(СтрокаОтносительногоЗначения)-ТаблицаЭлементов.Индекс(СтрокаСдвигаемогоЗначения));
		ТаблицаЭлементов.Сдвинуть(СтрокаСдвигаемогоЗначения,Сдвиг);
		// --- 
		МассивЭлементов=ТаблицаЭлементов.ВыгрузитьКолонку("Идентификатор");
		Группа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивЭлементов);
		
		
	Исключение
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции
 
#КонецОбласти 

#Область ДрагЭндДроп

&НаКлиенте
Процедура ДеревоПараметровГПНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	//Если (Элементы.ДПГ.ВыделенныеСтроки.Количество() > 1) Тогда
	//	
	//	Выполнение = Ложь;
	//	ПоказатьПредупреждение(,"Множественное перетаскивание недоступно.");
	//	Возврат;
	//	
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПараметровГППеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Модифицированность = истина;
	СтандартнаяОбработка=Ложь;
	// --- 
	
	// проверим, что действие, в которое мы вставляем не находится ниже по иерархии вставляемого действия
	// сформируем массив действий по иерархии от текущего вверх
	МассивСтрок = Новый Массив;
	ИдентификаторТекущейСтроки = Строка;
	МассивИдентификаторов = ПараметрыПеретаскивания.Значение;
	Если (ИдентификаторТекущейСтроки = Неопределено) Тогда
		
		НовыйРодитель = 0;
		НовыйПредыдущий = Неопределено;
		ВставкаРазрешена = Истина;
		
	Иначе
		
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			МассивСтрок.Добавить(СтрокаДерева.ИдентификаторГруппы);	
			НовыйРодитель = СтрокаДерева.ИдентификаторГруппы;
			НовыйПредыдущий = Неопределено;
		Иначе
			НовыйПредыдущий = СтрокаДерева.Параметр;
			НовыйРодительСтрока = СтрокаДерева.ПолучитьРодителя();
			Если (НовыйРодительСтрока <>  Неопределено) Тогда
				НовыйРодитель = НовыйРодительСтрока.ИдентификаторГруппы;
			Иначе
				НовыйРодитель = 0;
			КонецЕсли; 
		КонецЕсли; 
		
		РодительСтроки = СтрокаДерева.ПолучитьРодителя();
		Пока (РодительСтроки <> Неопределено) Цикл
			
			// всегда группа
			МассивСтрок.Добавить(РодительСтроки.ИдентификаторГруппы);
			РодительСтроки = РодительСтроки.ПолучитьРодителя();
			
		КонецЦикла; 
		// ---
		МассивПеремещаемыхСтрок = Новый Массив;
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			ПеремещаемаяСтрокаДерева = ДПГ.НайтиПоИдентификатору(Идентификатор);
			Если (ПеремещаемаяСтрокаДерева.ЭтоГруппа) Тогда
				МассивПеремещаемыхСтрок.Добавить(ПеремещаемаяСтрокаДерева.ИдентификаторГруппы);
			Иначе
				МассивПеремещаемыхСтрок.Добавить(ПеремещаемаяСтрокаДерева.Параметр);	
			КонецЕсли; 
		КонецЦикла; 
		// --- 
		ВставкаРазрешена = Истина;
		Для каждого ПеремещаемаяСтрока Из МассивПеремещаемыхСтрок Цикл
			
			Если (МассивСтрок.Найти(ПеремещаемаяСтрока) <> Неопределено) Тогда
				
				ВставкаРазрешена = Ложь;
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	Если (НЕ ВставкаРазрешена) Тогда
		
		ПоказатьПредупреждение(,"Вставка в иерархию с нарушением логической целостности.");
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	Ответ = _ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель,НовыйПредыдущий);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		// удаляем вставляемые действия
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			
			_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЦикла; 
		
		Если (ИдентификаторТекущейСтроки = Неопределено) Тогда
			
			ПолноеОбновление = Истина;
			_ОбновитьДеревоПараметров();
			ПересчитатьДинамическиеПараметры();
			ВосстановитьСостояниеСверткиДерева();
			
		Иначе
			
			// переформировываем элементы текущего действия
			ПолноеОбновление = Ложь;
			СтрокаДерева = ДПГ.НайтиПоИдентификатору(Строка);
			Если (СтрокаДерева.ЭтоГруппа) Тогда
				
				ТекущаяСтрока = Строка;
				ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
				
			Иначе
				
				СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
				Если (СтрокаРодителя = Неопределено) Тогда
					
					// обновить все
					// тут бы процедуру анализа новых ... TODO
					ПолноеОбновление = Истина;
					_ОбновитьДеревоПараметров();
					ПересчитатьДинамическиеПараметры();
					ВосстановитьСостояниеСверткиДерева();
					
				Иначе
					
					ТекущаяСтрока = СтрокаРодителя.ПолучитьИдентификатор();
					ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			
		КонецЕсли; 
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ВыполнитьПеремещениеСтрок(МассивИдентификаторовСтрок, НовыйРодитель, НовыйПредыдущий=Неопределено)
	// --- 
	
	Попытка
		
		Для каждого ИдентификаторСтроки Из МассивИдентификаторовСтрок Цикл
			
			Результат = _УстановитьРодителяСтроки(ИдентификаторСтроки, НовыйРодитель, НовыйПредыдущий);
			Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
				
				Возврат(_УФКС.Ответ(1,_УФКС.ПредставлениеОшибки(Результат)));
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Функция _УстановитьРодителяСтроки(ИдентификаторСтроки, НовыйРодитель, НовыйПредыдущий=Неопределено)
	// --- 
	
	Строка = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если (Строка.ЭтоГруппа) Тогда
		ПеремещаемоеЗначение = Строка.ИдентификаторГруппы;
	Иначе
		ПеремещаемоеЗначение = Строка.Параметр;
	КонецЕсли; 
	
	
	// --- 
	
	ГруппаСтарыйРодитель = _ОпределитьСтрокуГруппуСтрокиДерева(Строка);
	ГруппаНовыйРодитель = _сф.к_НайтиСтроку(Объект.ГруппыПараметровГрузоперевозки,Новый Структура("Идентификатор",НовыйРодитель));
	
	Если (ГруппаСтарыйРодитель.Идентификатор <> НовыйРодитель) Тогда
		
		Попытка
			
			// удаляем из старого родителя
			_УдалитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаСтарыйРодитель);
			
			// добавляем в новый
			_ДобавитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаНовыйРодитель, НовыйПредыдущий);
			
			//Новый механизм
			УстановитьНовогоВладельца(ИдентификаторСтроки,ГруппаНовыйРодитель.ИдентификаторГруппы);
			//Новый механизм
			
		Исключение
			
			ТекстОшибки = ОписаниеОшибки();
			Сообщить(ТекстОшибки);
			// --- 
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецПопытки; 
		
	Иначе
		
		// перемещение в пределах родителя
		_ПереместитьЭлементГруппы(ПеремещаемоеЗначение, ГруппаНовыйРодитель, НовыйПредыдущий);
		
	КонецЕсли; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

//Новый механизм
&наСервере
Процедура УстановитьНовогоВладельца(ИдентификаторСтроки, ИдентификаторГруппы)
	
	ИдентификаторВладельца = ИдентификаторГруппы;
	
	Строка = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Строка.ЭтоГруппа Тогда
		мСтроки = Объект.ГруппыПараметровГрузоперевозки.НайтиСтроки(Новый Структура("Идентификатор",Строка.ИдентификаторГруппы));
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0];	
		КонецЕсли;
		Если СтрокаДанных.ИдентификаторГруппы = ИдентификаторГруппы Тогда
			ИдентификаторВладельца = Неопределено;
		КонецЕсли;
	Иначе
		мСтроки = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Новый Структура("Параметр",Строка.Параметр));
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0];	
		КонецЕсли;
	КонецЕсли; 
	
	СтрокаДанных.ИдентификаторВладельца = ИдентификаторВладельца;
	
КонецПроцедуры
//Новый механизм

&НаСервере
Процедура _УдалитьСтрокуДерева(ИдентификаторСтроки)
	// --- 
	
	ИерархическийКонтроль = Ложь;
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если СтрокаДерева <> Неопределено тогда
		РодительСтрокиДерева = СтрокаДерева.ПолучитьРодителя();
		Если (РодительСтрокиДерева = Неопределено) Тогда
			РодительСтрокиДерева = ДПГ;
		Иначе
			ИерархическийКонтроль=Истина;
		КонецЕсли; 
		РодительСтрокиДерева.ПолучитьЭлементы().Удалить(СтрокаДерева);
		Если (ИерархическийКонтроль) Тогда
			_ПроверитьГруппыПоИерархии(РодительСтрокиДерева);
		КонецЕсли; 
	КонецЕсли;
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область Копипаста

&НаКлиенте
Процедура ДПГ_ПереместитьНаУровеньВверх(Команда)
	
	ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
	ТекущаяСтрока = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	РодительСтроки = ТекущаяСтрока.ПолучитьРодителя();
	Если (РодительСтроки <> Неопределено) Тогда
		
		РодительРодителя = РодительСтроки.ПолучитьРодителя();
		НовыйРодитель = ТекущаяСтрока.ИдентификаторГруппы;
		
		// --- 
		МассивИдентификаторов = Новый Массив;
		МассивИдентификаторов.Добавить(ИдентификаторТекущейСтроки);
		Ответ = _ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель);
		Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
			
			// удаляем вставляемые действия
			Для каждого Идентификатор Из МассивИдентификаторов Цикл
				
				_УдалитьСтрокуДерева(Идентификатор);
				
			КонецЦикла; 
			
			// переформировываем элементы текущего действия
			//ПолноеОбновление = Ложь;
			//Если (РодительРодителя = Неопределено) Тогда
			
			ПолноеОбновление = Истина;
			_ОбновитьДеревоПараметров();
			ПересчитатьДинамическиеПараметры();
			ВосстановитьСостояниеСверткиДерева();
			
			//Иначе
			//	
			//	ВыполнитьПодгрузкуСтрок(РодительРодителя.ПолучитьИдентификатор());
			//	
			//КонецЕсли; 
			
		Иначе
			
			ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		// --- 
		
	//Иначе
	//	
	//	_УФК.ВывестиПредупреждение("");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Строка_Вырезать(Команда)
	
	// снимаем признак нахождения в буфере
	Для каждого Стр Из ДПГ_БуферОбмена Цикл
		ИдентификаторСтроки = Число(Стр.Представление);
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если (СтрокаДерева <> Неопределено) Тогда
			СтрокаДерева.Буфер = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	ДПГ_БуферОбмена.Очистить();
	// --- 
	Для каждого Стр Из Элементы.ДПГ.ВыделенныеСтроки Цикл
		
		ВыделеннаяСтрока = ДПГ.НайтиПоИдентификатору(Стр);
		ВыделеннаяСтрока.Буфер = Истина;
		Если (ВыделеннаяСтрока.ЭтоГруппа) Тогда
			ДПГ_БуферОбмена.Добавить(ВыделеннаяСтрока.ИдентификаторГруппы, Формат(Стр,"ЧДЦ=; ЧН=; ЧГ="));
		Иначе
			ДПГ_БуферОбмена.Добавить(ВыделеннаяСтрока.Параметр, Формат(Стр,"ЧДЦ=; ЧН=; ЧГ="));	
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Строка_Вставить(Команда)
	
	МассивСтрок = Новый Массив;
	ИдентификаторТекущейСтроки = Элементы.ДПГ.ТекущаяСтрока;
	// --- 
	СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
	Если (СтрокаДерева.ЭтоГруппа) Тогда
		МассивСтрок.Добавить(СтрокаДерева.ИдентификаторГруппы);	
		НовыйРодитель = СтрокаДерева.ИдентификаторГруппы;
		НовыйПредыдущий = Неопределено;
	Иначе
		НовыйПредыдущий = СтрокаДерева.Параметр;
		НовыйРодительСтрока = СтрокаДерева.ПолучитьРодителя();
		Если (НовыйРодительСтрока <>  Неопределено) Тогда
			НовыйРодитель = НовыйРодительСтрока.ИдентификаторГруппы;
		Иначе
			НовыйРодитель = 0;
		КонецЕсли; 
	КонецЕсли; 
	
	РодительСтроки = СтрокаДерева.ПолучитьРодителя();
	Пока (РодительСтроки <> Неопределено) Цикл
		
		// всегда группа
		МассивСтрок.Добавить(РодительСтроки.ИдентификаторГруппы);
		РодительСтроки = РодительСтроки.ПолучитьРодителя();
		
	КонецЦикла; 
	// ---
	МассивПеремещаемыхСтрок = ДПГ_БуферОбмена.ВыгрузитьЗначения();
	// --- 
	ВставкаРазрешена = Истина;
	Для каждого ПеремещаемаяСтрока Из МассивПеремещаемыхСтрок Цикл
		
		Если (МассивСтрок.Найти(ПеремещаемаяСтрока) <> Неопределено) Тогда
			
			ВставкаРазрешена = Ложь;
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	Если (НЕ ВставкаРазрешена) Тогда
		
		ПоказатьПредупреждение(,"Вставка в иерархию с нарушением логической целостности.");
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	МассивИдентификаторов = Новый Массив;
	Для каждого ЭлементБуфера Из ДПГ_БуферОбмена Цикл
		
		МассивИдентификаторов.Добавить(Число(ЭлементБуфера.Представление));
		
	КонецЦикла; 
	// --- 
	Ответ = _ВыполнитьПеремещениеСтрок(МассивИдентификаторов, НовыйРодитель,НовыйПредыдущий);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		// удаляем вставляемые действия
		Для каждого Идентификатор Из МассивИдентификаторов Цикл
			
			_УдалитьСтрокуДерева(Идентификатор);
			
		КонецЦикла; 
		
		// очищаем буфер
		ДПГ_БуферОбмена.Очистить();
		
		// переформировываем элементы текущего действия
		ПолноеОбновление = Ложь;
		СтрокаДерева = ДПГ.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если (СтрокаДерева.ЭтоГруппа) Тогда
			
			ТекущаяСтрока = ИдентификаторТекущейСтроки;
			ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
			
		Иначе
			
			СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
			Если (СтрокаРодителя = Неопределено) Тогда
				
				// обновить все
				// тут бы процедуру анализа новых ... TODO
				ПолноеОбновление = Истина;
				_ОбновитьДеревоПараметров();
				ПересчитатьДинамическиеПараметры();
				ВосстановитьСостояниеСверткиДерева();
				
			Иначе
				
				ТекущаяСтрока = СтрокаРодителя.ПолучитьИдентификатор();
				ВыполнитьПодгрузкуСтрок(ТекущаяСтрока);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		
	Иначе
		
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ПредопределеннеПараметры

&НаКлиенте
Процедура Форма_ПерезаполнитьПредопределенныеПараметры(Команда)
	
	ЗначениеРеквизита 	=	Объект[ЭтаФорма.ТекущийЭлемент.Имя];
	ИмяРеквизита  		= ЭтаФорма.ТекущийЭлемент.Имя;
	ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(ЗначениеРеквизита, ИмяРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Реквизит, ИмяРеквизита)
	// --- 
	
	Если _ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Реквизит, ИмяРеквизита) Тогда
		
		ОбновитьДеревоПараметров();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Реквизит, ИмяРеквизита)
	// --- 
	
	СП = ПолучитьПредопределенныеПараметры(Реквизит, ИмяРеквизита);
	Если (_УФКС.ВыполненоУспешно(СП)) Тогда
		Результат = ДобавитьПредопределенныеПараметры(СП.Параметры);
		Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
			Возврат(Истина);
		КонецЕсли;
	КонецЕсли; 
	Возврат(Ложь);
	
	// --- 
КонецФункции

&НаСервере
Функция ПолучитьПредопределенныеПараметры(Субъект,ИмяРеквизита)
	// --- 
	
	Возврат(CW_Мониторинг.ПолучитьПредопределенныеПараметры(Субъект,ИмяРеквизита,УникальныйИдентификатор));
	
	// --- 
КонецФункции

&НаСервере
Функция ДобавитьПредопределенныеПараметры(АдресПараметров)
	// --- 
	
	Возврат(CW_Мониторинг.ДобавитьПредопределенныеПараметры(Объект,АдресПараметров));
	
	// --- 
КонецФункции


#КонецОбласти 

#Область Заполнение 

&НаКлиенте
Процедура ДПГ_ПерезаполнитьПараметрыПоШаблону(Команда)
	
	ДиалогЗаполненияПоТипу();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогЗаполненияПоТипу()
	// --- 
	
	Если (ЗначениеЗаполнено(Объект.ТипПеревозки)) Тогда
		
		Если (Объект.ПараметрыГрузоперевозки.Количество() <> 0) Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВариантаЗаполненияПоТипу",ЭтотОбъект);
			ОткрытьФорму("Справочник.CW_Грузоперевозки.Форма.ФормаЗаполненияПоТипуПеревозки",,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе
			
			ЗаполнитьПараметрыПоТипуПеревозки(0);
			
		КонецЕсли; 

	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ОбработкаВыбораВариантаЗаполненияПоТипу(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		ЗаполнитьПараметрыПоТипуПеревозки(Ответ);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПредопределенныеЗначенияРеквизитовШапки(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТипПеревозки) Тогда
		ЗаполнитьПредопределенныеЗначенияРеквизитовШапки();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредопределенныеЗначенияРеквизитовШапки()
	
	_УФС.ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(Объект, Объект.ТипПеревозки, "ДляГрузоперевозки");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыПоТипуПеревозки(ВариантЗаполнения)

	ЗаполнитьПредопределенныеЗначенияРеквизитовШапки();
	_ЗаполнитьПараметрыПоТипуПеревозки(ВариантЗаполнения);
	_ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(Объект.ТипПеревозки, "ТипПеревозки");

	ЭтаФорма.Модифицированность = Истина;
	ОбновитьДеревоПараметров();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьПараметрыПоТипуПеревозки(ВариантЗаполнения)
	// --- 
	
	// удаляем несоответствующие параметры
	Если (ВариантЗаполнения = 1) Тогда
		
		МассивУдаляемых = Новый Массив;
		Для каждого СтрПараметр Из Объект.ПараметрыГрузоперевозки Цикл
			
			Отбор = Новый Структура("Параметр", СтрПараметр.Параметр);
			СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ТипПеревозки.ПараметрыГрузоперевозки, Отбор);
			Если (СтрокаПараметра = Неопределено) Тогда
				МассивУдаляемых.Добавить(СтрПараметр);
			КонецЕсли; 
			
		КонецЦикла;
		_сф.к_УдалитьЭлементыПоМассиву(Объект.ПараметрыГрузоперевозки, МассивУдаляемых);
		
	КонецЕсли; 
	
	// переносим иерархию
	Если (ВариантЗаполнения = 0 ИЛИ ВариантЗаполнения = 1) Тогда
		
		// очищаем текущие группы
		Объект.ГруппыПараметровГрузоперевозки.Очистить();
		// копируем группы из типа 
		Объект.ГруппыПараметровГрузоперевозки.Загрузить(Объект.ТипПеревозки.ГруппыПараметровГрузоперевозки.Выгрузить());
		
	КонецЕсли; 
	
	// переносим параметры из типа
	Для каждого СтрПараметр Из Объект.ТипПеревозки.ПараметрыГрузоперевозки Цикл
		
		Отбор = Новый Структура("Параметр", СтрПараметр.Параметр);
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки, Отбор);
		Если (СтрокаПараметра = Неопределено) Тогда
			
			// добавляем
			Нстр = Объект.ПараметрыГрузоперевозки.Добавить();
			Нстр.Параметр = СтрПараметр.Параметр;
			Нстр.Значение = СтрПараметр.Параметр.ТипЗначения.ПривестиЗначение(Неопределено); 
			
			//Новый механизм
			Нстр.ИдентификаторВладельца = СтрПараметр.ИдентификаторВладельца;
			//Новый механизм	
			
			//ХранениеПолногоЗначения
			ДобавитьСохраняемоеПолноеЗначение(СтрПараметр.Параметр);
			//---ХранениеПолногоЗначения

		КонецЕсли; 
		
	КонецЦикла; 
	
	Если (ЗначениеЗаполнено(Объект.ОтслеживаемоеОборудование)) Тогда
		
		_ОбновитьСписокПараметровОтслеживаемогоОборудования();
		// добавляем и заполняем параметры	
		Для каждого СтрокаПараметраОС Из Объект.ОтслеживаемоеОборудование.ПараметрыГрузоперевозки Цикл
			
			СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(Объект,СтрокаПараметраОС.Параметр);
			Если (СтрокаПараметра = Неопределено) Тогда
				СтрокаПараметра = Объект.ПараметрыГрузоперевозки.Добавить();
				СтрокаПараметра.Параметр = СтрокаПараметраОС.Параметр;
			КонецЕсли; 
			СтрокаПараметра.Значение = СтрокаПараметраОС.Значение;
			
			//ХранениеПолногоЗначения
			ДобавитьСохраняемоеПолноеЗначение(СтрПараметр.Параметр, СтрокаПараметраОС.Значение);
			//---ХранениеПолногоЗначения
			
		КонецЦикла;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

// --- 
#КонецОбласти

// ---------------------------------------------------------------------------- 

#Область Бюджеты 

#Область ВерсияБюджета 

&НаКлиенте
Процедура БюджетТекущаяВерсияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетВыбратьИзСписка"));
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетТекущаяВерсияПриИзменении(Элемент)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
	
	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетРасходы");
	ВосстановитьСортировкуТаблицы("БюджетДоходы");
	//Сортировка бюджетов

КонецПроцедуры

&НаКлиенте
Процедура БюджетТекущаяВерсияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетВыбрать"));
	
КонецПроцедуры

#КонецОбласти 

#Область Расходы

&НаКлиенте
Процедура БюджетЗатратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетДобавить",Новый Структура("Элемент,Копирование",Элемент,Копирование)));
		
КонецПроцедуры

&НаКлиенте
Процедура БюджетЗатратыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетОткрыть",Новый Структура("Элемент,ВыбраннаяСтрока,Поле",Элемент,ВыбраннаяСтрока,Поле)));
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетЗатратыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетОткрыть",Новый Структура("Элемент",Элемент)));
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетЗатратыПередУдалением(Элемент, Отказ) 
	
	Отказ = Истина;
	ВыделенныеСтроки = Элементы.БюджетРасходы.ВыделенныеСтроки;
	
	ПередУдалениемБюджета(ВыделенныеСтроки, "БюджетРасходы");

КонецПроцедуры 

&НаКлиенте
Процедура БюджетЗатратыПослеУдаления(Элемент)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетРасходыОбновитьИтоги"));

	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетРасходы");
	//Сортировка бюджетов
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетЗатратыОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетРасходыОбновить"));

	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетРасходы");
	//Сортировка бюджетов
	
КонецПроцедуры


#КонецОбласти 


&НаКлиенте
Процедура ПередУдалениемБюджета(ВыделенныеСтроки, ИмяТаблицы)
	
	ДополнительныеПараметры = Новый Структура;   
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", 	ВыделенныеСтроки);
	ДополнительныеПараметры.Вставить("ИмяТаблицы", 			ИмяТаблицы);

	Оповещение = Новый ОписаниеОповещения("ПродолжитьУдалениеБюджета", ЭтотОбъект, ДополнительныеПараметры);
	
	CW_БюджетированиеКлиент.ПередУдалениемБюджета(ЭтотОбъект,Оповещение);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПродолжитьУдалениеБюджета(Ответ,  ДополнительныеПараметры) Экспорт
	Если Ответ = Неопределено
		или Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;   
	
	Текст = БюджетПередУдалениемНаСервере(ДополнительныеПараметры); 
	Если Не ПустаяСтрока(Текст) Тогда
		ПоказатьПредупреждение(, Текст);
	КонецЕсли; 

КонецПроцедуры   

&НаСервере
Функция БюджетПередУдалениемНаСервере(ДополнительныеПараметры)
	
	Возврат CW_Бюджетирование.ВыполнитьУдалениеСтатьиБюдежта(ЭтаФорма, ДополнительныеПараметры);
	
КонецФункции

#Область Доходы

&НаКлиенте
Процедура БюджетДоходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетДобавить",Новый Структура("Элемент,Копирование",Элемент,Копирование)));
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетОткрыть",Новый Структура("Элемент,ВыбраннаяСтрока,Поле",Элемент,ВыбраннаяСтрока,Поле)));
		
КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетОткрыть",Новый Структура("Элемент",Элемент)));

КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ВыделенныеСтроки = Элементы.БюджетДоходы.ВыделенныеСтроки;

	ПередУдалениемБюджета(ВыделенныеСтроки, "БюджетДоходы");
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходыПослеУдаления(Элемент)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетДоходыОбновитьИтоги"));

	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетДоходы");
	//Сортировка бюджетов
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетДоходыОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетДоходыОбновить")); 
	
	//Сортировка бюджетов
	ВосстановитьСортировкуТаблицы("БюджетДоходы");
	//Сортировка бюджетов
	
КонецПроцедуры


#КонецОбласти

#Область Расходы 

&НаКлиенте
Процедура ЗатратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/ФинансыДобавить",Новый Структура("Элемент,Копирование",Элемент,Копирование)));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ=Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/ФинансыОткрыть",Новый Структура("Элемент",Элемент))); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "РасходыФайлы" Тогда
		_УФК.ОткрытьСписокФайловОбъекта(ЭтаФорма, Элемент.ТекущиеДанные.Документ);
	Иначе
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/ФинансыОткрыть",Новый Структура("Элемент,ВыбраннаяСтрока,Поле",Элемент,ВыбраннаяСтрока,Поле)));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗатратыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/ФинансыУдалить",Новый Структура("Элемент",Элемент)));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/ФинансыРасходыОбновить"));
	
КонецПроцедуры

#КонецОбласти 

#Область Доходы 

&НаКлиенте
Процедура ДоходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/ФинансыДобавить",Новый Структура("Элемент,Копирование",Элемент,Копирование)));
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ=Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/ФинансыОткрыть",Новый Структура("Элемент",Элемент))); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "ДоходыФайлы" Тогда
		_УФК.ОткрытьСписокФайловОбъекта(ЭтаФорма, Элемент.ТекущиеДанные.Документ);
	Иначе
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/ФинансыОткрыть",Новый Структура("Элемент,ВыбраннаяСтрока,Поле",Элемент,ВыбраннаяСтрока,Поле)));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоходыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/ФинансыУдалить",Новый Структура("Элемент",Элемент)));
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/ФинансыДоходыОбновить"));
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансыДоходыПриАктивизацииСтроки(Элемент)
	//Через )|(опу, но так доступа общая команда документа 
	ТекущиеДанные = Элементы.ФинансыДоходы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущийДокументДоходов = ТекущиеДанные.Документ;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФинансыРасходыПриАктивизацииСтроки(Элемент)
	//Через )|(опу, но так доступа общая команда документа 
	ТекущиеДанные = Элементы.ФинансыРасходы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущийДокументРасходов = ТекущиеДанные.Документ;	
	КонецЕсли;
КонецПроцедуры

// --- 

#КонецОбласти 

#Область Результат 

&НаКлиенте
Процедура ВыявлениеРезультатаОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/ФинансыРезультатОбновить"));
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ВыводФинрезультатаПриИзменении(Элемент)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/ФинансыДоходыОбновить"));
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область Декларации

&НаКлиенте
Процедура ДекларацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/ДекларацииОткрыть",Новый Структура("Элемент,ВыбраннаяСтрока,Поле",Элемент,ВыбраннаяСтрока,Поле)));

КонецПроцедуры

&НаКлиенте
Процедура Форма_ДекларацииНастроитьСписок(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ДекларацииНастроитьСписокОбработка", ЭтаФорма); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаНастройкиСписка",ПФ_НастройкаСписка(),,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекларацииНастроитьСписокОбработка(Ответ, ДополнительныеПараметры) Экспорт
	
	Если (Ответ <> Неопределено) Тогда
		 ОбработатьНастройкуСпискаДеклараций(Ответ);
		 СохранитьСеансовуюНастройкуДеклараций();
	КонецЕсли;

КонецПроцедуры

#Область НастройкаСпискаРасчетов

&НаСервере
Функция СохранитьСеансовуюНастройкуДеклараций()
	
	_УФС.СохранитьСеансовыеНастройки(ЭтаФорма,"НастройкаСпискаДекларацийДТ",ПФ_НастройкаСписка().СписокКолонок);
	
КонецФункции

&НаСервере
Функция ЗагрузитьСеансовуюНастройкуДеклараций()
	
	Настройка = _УФС.ЗагрузитьСеансовыеНастройки(ЭтаФорма, "НастройкаСпискаДекларацийДТ");
	ОбработатьНастройкуСпискаДеклараций(Настройка);
	
КонецФункции

&НаСервере
Функция ПФ_НастройкаСписка()
	
	ПФ = Новый Структура("Источник,СписокКолонок",ЭтаФорма.Заголовок,Новый Массив);
	
	СформироватьСтруктуруКолонок(Элементы.Декларации, ПФ.СписокКолонок);
	СписокКолонок.ЗагрузитьЗначения(ПФ.СписокКолонок);
	
	Возврат(ПФ);
	
КонецФункции

&НаСервере
Процедура СформироватьСтруктуруКолонок(Элемент,МассивСК)
	
	// обходим подчинённые элементы
	Для каждого ПЭ Из Элемент.ПодчиненныеЭлементы Цикл
		
		Узел = ШаблонУзла();
		_сф.ст_ЗаполнитьСвойства(Узел,"Имя,Заголовок,Видимость",ПЭ);
		Узел.ЭтоГруппа = (ТипЗнч(ПЭ) <> Тип("ПолеФормы"));
		МассивСК.Добавить(Узел);
		// --- 
		Если Узел.ЭтоГруппа Тогда
			
			СформироватьСтруктуруКолонок(ПЭ,Узел.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ШаблонУзла()
	
	Возврат(Новый Структура("Имя,Заголовок,Видимость,ИзменениеВидимости,ЭтоГруппа,Элементы","","",Ложь,Истина,Ложь,Новый Массив));
	
КонецФункции

&НаСервере
Процедура ОбработатьНастройкуСпискаДеклараций(Настройка)
	
	Если (Настройка = Неопределено) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Попытка
		
		// необходимо проверить порядок и видимость, 
		// сначала видимость
		Для каждого СК Из Настройка Цикл
			
			ОбновитьВидимость(СК);
			
		КонецЦикла; 
		// потом порядок
		Если (СписокКолонок.Количество()=0) Тогда
			СформироватьСтруктуруКолонок(Элементы.Декларации,СписокКолонок);
			ОбновитьПорядок(Настройка);
		Иначе
			ОбновитьПорядок(Настройка);
		КонецЕсли; 
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимость(СК)
	
	ЭлементФормы = Элементы.Найти(СК.Имя);
	Если ЭлементФормы <> Неопределено Тогда
		
		ЭлементФормы.Видимость = СК.Видимость;
		Если СК.Видимость И СК.ЭтоГруппа Тогда
			
			Для каждого Элемент Из СК.Элементы Цикл
				
				ОбновитьВидимость(Элемент);
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПорядок(Настройка)
	
	ТекущийИндекс = 1;
	Для каждого СК Из Настройка Цикл
		
		ПередвигаемыйЭлемент = Элементы[СК.Имя];
		Элементы.Переместить(ПередвигаемыйЭлемент, ПередвигаемыйЭлемент.Родитель);
		
		Если СК.ЭтоГруппа Тогда
			
			ОбновитьПорядок(СК.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	СписокКолонок.ЗагрузитьЗначения(Настройка);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СтатусУтвержденияНажатие(Элемент)
	
	Если (Объект.Заказ.Пустая()) Тогда
		Отбор = Новый Структура("Объект",Объект.Ссылка);
	Иначе
		Отбор = Новый Структура("Объект",Объект.Заказ);
	КонецЕсли; 
	// --- 
	ПФ = Новый Структура("Отбор",Отбор);
	ОткрытьФорму("РегистрСведений.CW_ИсторияУтверждениеБюджетов.ФормаСписка",ПФ,,Истина);
	
КонецПроцедуры

#Область Связи

&НаКлиенте
Процедура ВедущиеГрузоперевозкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораГрузоперевозкиСвязи",ЭтотОбъект, Новый Структура("Режим","Ведущие")); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора",ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомыеГрузоперевозкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораГрузоперевозкиСвязи",ЭтотОбъект, Новый Структура("Режим","Ведомые")); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора",ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
  
&НаКлиенте
Процедура ОбработкаВыбораГрузоперевозкиСвязи(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (ДополнительныеПараметры.Режим = "Ведущие") Тогда
			
			Результат = _ДобавитьВедущуюГП(Ответ);
			Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
				Элементы.ВедущиеГрузоперевозки.Обновить();
			Иначе
				ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Результат));
			КонецЕсли; 
			
		КонецЕсли; 
		// --- 
		Если (ДополнительныеПараметры.Режим = "Ведомые") Тогда
			
			Результат = _ДобавитьВедомуюГП(Ответ);
			Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
				Элементы.ВедомыеГрузоперевозки.Обновить();
			Иначе
				ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(Результат));
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДобавитьВедущуюГП(Грузоперевозка)
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СвязиГрузоперевозок.Грузоперевозка
	|ИЗ
	|	РегистрСведений.CW_СвязиГрузоперевозок КАК CW_СвязиГрузоперевозок
	|ГДЕ
	|	CW_СвязиГрузоперевозок.Грузоперевозка = &Грузоперевозка
	|	И CW_СвязиГрузоперевозок.ГрузоперевозкаРодитель = &ГрузоперевозкаРодитель";
	Запрос.УстановитьПараметр("ГрузоперевозкаРодитель", Грузоперевозка);
	Запрос.УстановитьПараметр("Грузоперевозка", Объект.Ссылка); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если (ТЗ.Количество() <> 0) Тогда
		
		Возврат(_УФКС.Ответ(1,"Грузоперевозка уже добавлена."));
		
	Иначе
		
		Запись = РегистрыСведений.CW_СвязиГрузоперевозок.СоздатьМенеджерЗаписи();
		Запись.Грузоперевозка = Объект.Ссылка;
		Запись.ГрузоперевозкаРодитель = Грузоперевозка;
		Запись.Записать(Истина);
		// --- 
		Возврат(_УФКС.Ответ());
		
	КонецЕсли; 
	
	// --- 
КонецФункции
 
&НаСервере
Функция _ДобавитьВедомуюГП(Грузоперевозка)
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СвязиГрузоперевозок.Грузоперевозка
	|ИЗ
	|	РегистрСведений.CW_СвязиГрузоперевозок КАК CW_СвязиГрузоперевозок
	|ГДЕ
	|	CW_СвязиГрузоперевозок.Грузоперевозка = &Грузоперевозка
	|	И CW_СвязиГрузоперевозок.ГрузоперевозкаРодитель = &ГрузоперевозкаРодитель";
	Запрос.УстановитьПараметр("ГрузоперевозкаРодитель", Объект.Ссылка);
	Запрос.УстановитьПараметр("Грузоперевозка", Грузоперевозка); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если (ТЗ.Количество() <> 0) Тогда
		
		Возврат(_УФКС.Ответ(1,"Грузоперевозка уже добавлена."));
		
	Иначе
		
		Запись = РегистрыСведений.CW_СвязиГрузоперевозок.СоздатьМенеджерЗаписи();
		Запись.Грузоперевозка = Грузоперевозка;
		Запись.ГрузоперевозкаРодитель = Объект.Ссылка;
		Запись.Записать(Истина);
		// --- 
		Возврат(_УФКС.Ответ());
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ВедущиеГрузоперевозкиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	ПоказатьЗначение(,Элементы.ВедущиеГрузоперевозки.ТекущиеДанные.ГрузоперевозкаРодитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомыеГрузоперевозкиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	ПоказатьЗначение(,Элементы.ВедомыеГрузоперевозки.ТекущиеДанные.Грузоперевозка);
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.CW_МаршрутыГрузоперевозок.ФормаВыбора",Новый Структура("ТекущийТипПеревозки,РежимВыбора",Объект.ТипПеревозки,Истина),Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


#КонецОбласти 

#Область МониторингОборудования

&НаСервере
Процедура _ОбновитьСписокПараметровОтслеживаемогоОборудования()
	
	СписокПараметровОтслеживаемогоОборудования.Очистить();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДобавлятьВКарточку", Истина);
	
	мСтроки = Объект.ОтслеживаемоеОборудование.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
	Для каждого СтрокаМассива из мСтроки Цикл
		СписокПараметровОтслеживаемогоОборудования.Добавить(СтрокаМассива.Параметр);
	КонецЦикла;
	
КонецПроцедуры
 

&НаКлиенте
Процедура ПроверитьНаличиеОборудования() Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Объект.ОтслеживаемоеОборудование) Тогда
		
		// проверяем наличие оборудования с одинаковым представлением
		Если ПолучитьНаличиеОборудования(Объект.CW_Представление) Тогда
			
			Если Не АвтоматическиПодставлятьОборудование 
				или Не ПроверитьОборудованиенаСлежении(Объект.CW_Представление)  Тогда
				
				// задаем вопрос
				ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаПостановкиНаСлежение",ЭтотОбъект, Новый Структура()); 
				ПоказатьВопрос(ПОВ,"Введённое представление соответствует оборудованию на слежении. Поставить грузоперевозку на слежение?",РежимДиалогаВопрос.ДаНет,,,"Мониторинг оборудования");
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ОбработкаВопросаПостановкиНаСлежение(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			// открываем форму выбора отслеживаемого оборудования
			ОткрытьФормуОтслеживаемогоОборудования();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаличиеОборудования(ПредставлениеОборудования)
	Возврат Справочники.CW_Оборудование.ПолучитьНаличиеОборудования(ПредставлениеОборудования);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОборудованиеПоНаименованию(ПредставлениеОборудования)
	Возврат Справочники.CW_Оборудование.ПолучитьОборудованиеПоНаименованию(ПредставлениеОборудования);
КонецФункции

&НаСервере
Функция ПроверитьОборудованиенаСлежении(ПредставлениеОборудования)

	Оборудование = ПолучитьОборудованиеПоНаименованию(ПредставлениеОборудования);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОтслеживаемоеОборудование.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ОтслеживаемоеОборудование КАК CW_ОтслеживаемоеОборудование
	               |ГДЕ
	               |	CW_ОтслеживаемоеОборудование.Оборудование = &Оборудование
	               |	И ВЫБОР
	               |			КОГДА CW_ОтслеживаемоеОборудование.ОкончаниеСлежения = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА &ДатаПеревозки >= НАЧАЛОПЕРИОДА(CW_ОтслеживаемоеОборудование.НачалоСлежения, ДЕНЬ)
	               |			ИНАЧЕ &ДатаПеревозки МЕЖДУ НАЧАЛОПЕРИОДА(CW_ОтслеживаемоеОборудование.НачалоСлежения, ДЕНЬ) И КОНЕЦПЕРИОДА(CW_ОтслеживаемоеОборудование.ОкончаниеСлежения, ДЕНЬ)
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Оборудование", 	Оборудование);
	Запрос.УстановитьПараметр("ДатаПеревозки", 	Объект.ДатаСделкиФ); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() > 1 Тогда
		Возврат ложь;
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Объект.ОтслеживаемоеОборудование = Выборка.Ссылка;
	КонецЕсли;  
	
	Возврат истина;

КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОтслеживаемогоОборудования()
	
	ОборудованиеДляОтбора = ПолучитьОборудованиеПоНаименованию(Объект.CW_Представление);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимВыбора",				Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор",		Ложь);
	СтруктураПараметров.Вставить("ДатаПроверки",			Объект.ДатаСделкиФ);
	СтруктураПараметров.Вставить("ОборудованиеДляОтбора",	ОборудованиеДляОтбора);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаПривязкиОборудования",ЭтотОбъект); 
	
	ОткрытьФорму("Справочник.CW_ОтслеживаемоеОборудование.ФормаВыбора", СтруктураПараметров,ЭтаФорма,Истина,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаПривязкиОборудования(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		Модифицированность = Истина; 
		
		ОбработкаПривязкиОборудованияНаСервере(Ответ);
		
		
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/УправлениеЭлементамиФормы"));
		
		ОбновитьДеревоПараметров();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры  

&НаСервере
Процедура ОбработкаПривязкиОборудованияНаСервере(Ответ)
	
	ОбработатьОтветПривязкиОбороудованияНаСервере(Ответ.ОбъектСлежения);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтветПривязкиОбороудованияНаСервере(ОбъектСлежения)
	
	Объект.ОтслеживаемоеОборудование = ОбъектСлежения;
	
	_ОбновитьСписокПараметровОтслеживаемогоОборудования();
	_ОбработатьПривязкуОборудования();
	
	Если Не ЗначениеЗаполнено(Объект.CW_Представление) Тогда
		Объект.CW_Представление =  ОбъектСлежения.Оборудование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ОбработатьПривязкуОборудования()
	// --- 
	
	// проверяем и заполняем типоразмер
	Если (Объект.ОтслеживаемоеОборудование.Оборудование.ВидПеревозки = Перечисления.CW_ВидыПеревозок.Контейнер) Тогда
		
		Объект.Типоразмер = Объект.ОтслеживаемоеОборудование.Оборудование.Типоразмер;
		
	КонецЕсли; 
	
	// добавляем и заполняем параметры	
	Отбор = Новый Структура;
	Отбор.Вставить("ДобавлятьВКарточку", Истина);
	
	мСтроки = Объект.ОтслеживаемоеОборудование.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
	Для каждого СтрокаМассива из мСтроки Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Параметр", СтрокаМассива.Параметр);
		
		мСтроки = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
		Если мСтроки.Количество() <> 0 Тогда
			НоваяСтрока = мСтроки[0];  //Всегда одна строка
		Иначе
			НоваяСтрока = Объект.ПараметрыГрузоперевозки.Добавить();
			НоваяСтрока.Параметр	= СтрокаМассива.Параметр;
		КонецЕсли;
		
		НоваяСтрока.Значение	= СтрокаМассива.Значение;
		НоваяСтрока.Примечание 	= СтрокаМассива.Примечание;
		
		//ХранениеПолногоЗначения
		ДобавитьСохраняемоеПолноеЗначение(СтрокаМассива.Параметр, СтрокаМассива.Значение);
		//---ХранениеПолногоЗначения
		
	КонецЦикла;
	// добавляем и заполняем параметры	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтслеживаемоеОборудованиеОчистка(Элемент, СтандартнаяОбработка)
	
	ОчиститьПараметрыОборудования();

	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/УправлениеЭлементамиФормы"));
	ОбновитьДеревоПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтслеживаемоеОборудованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополонительныеПараметры = Новый Структура;
	ДополонительныеПараметры.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьВыборОборудования", ЭтотОбъект, ДополонительныеПараметры);

	Если Не ДатаПеревозкиВПериодеСлежения(ВыбранноеЗначение, Объект.ДатаСделкиФ) Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Дата грузоперевозки находится за пределами периода слежения выбранного оборудования. Продолжить?", Режим, 0);
	Иначе
		 ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыборОборудования(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.ОтслеживаемоеОборудование = ПредопределенноеЗначение("Справочник.CW_ОтслеживаемоеОборудование.ПустаяСсылка");
	Иначе
		Объект.ОтслеживаемоеОборудование = Параметры.ВыбранноеЗначение;
	КонецЕсли;
	
	ОчиститьПараметрыОборудования();
	
	ОбработатьОтветПривязкиОбороудованияНаСервере(Объект.ОтслеживаемоеОборудование);
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/УправлениеЭлементамиФормы"));
	ОбновитьДеревоПараметров();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаПеревозкиВПериодеСлежения(ВыбранноеЗначение, ДатаПеревозки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОтслеживаемоеОборудование.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ОтслеживаемоеОборудование КАК CW_ОтслеживаемоеОборудование
	               |ГДЕ
	               |	CW_ОтслеживаемоеОборудование.Ссылка = &ВыбранноеЗначение
	               |	И &ДатаПеревозки МЕЖДУ CW_ОтслеживаемоеОборудование.НачалоСлежения И ВЫБОР
	               |			КОГДА CW_ОтслеживаемоеОборудование.ОкончаниеСлежения = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА КОНЕЦПЕРИОДА(&ДатаПеревозки, ДЕНЬ)
	               |			ИНАЧЕ КОНЕЦПЕРИОДА(CW_ОтслеживаемоеОборудование.ОкончаниеСлежения, ДЕНЬ)
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДатаПеревозки", ДатаПеревозки);
	Запрос.УстановитьПараметр("ВыбранноеЗначение", ВыбранноеЗначение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Процедура ОчиститьПараметрыОборудования()
	
	МассивСтрок = Новый Массив;
	ЭлементыДерева = ДПГ.ПолучитьЭлементы();
	ПолучитьСтрокиПоОборудованиюДляУдаления(ЭлементыДерева, МассивСтрок);
	
	Для Каждого ИдентификаторСтроки из МассивСтрок Цикл
		УдалитьСтрокуДерева(ИдентификаторСтроки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтрокиПоОборудованиюДляУдаления(ЭлементыДерева, МассивСтрок)
	
	Для Каждого СтрокаДерева из ЭлементыДерева Цикл
		Если СтрокаДерева.ЭтоГруппа Тогда
			Если СтрокаДерева.НаименованиеГруппы = "Оборудование на слежении" Тогда
				МассивСтрок.Добавить(СтрокаДерева.ПолучитьИдентификатор());
			Иначе
				ПолучитьСтрокиПоОборудованиюДляУдаления(СтрокаДерева.ПолучитьЭлементы(), МассивСтрок);
			КонецЕсли;
		ИначеЕсли СтрокаДерева.ПараметрОборудования Тогда
			МассивСтрок.Добавить(СтрокаДерева.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область Ввод_на_основании

&НаКлиенте
Процедура ФинансыДоходыВвестиНаОснованииРасходыПоГрузоперевозке(Команда)
	
	Если Элементы.ФинансыДоходы.ВыделенныеСтроки.Количество() > 1 Тогда
		ПоказатьПредупреждение(,"Для ввода на основании необходимо выбрать один документ!");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КомандаИмя",  "/ФинансыРасходыОбновить");  
	ОписаниеОповещенияПриЗакрытииФормы = Новый ОписаниеОповещения("ОбновитьТаблицуФинансы", ЭтотОбъект, ДополнительныеПараметры);
	
	СсылкаДокументОснование = ПолучитьСсылкуНаДокумент("ФинансыДоходы", Элементы.ФинансыДоходы.ТекущаяСтрока);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", СсылкаДокументОснование);
	ПараметрыФормы.Вставить("Основание"			, СсылкаДокументОснование);
	
	ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещенияПриЗакрытииФормы);
	
КонецПроцедуры


&НаКлиенте
Процедура ФинансыРасходыВвестиНаОснованииРасходыПоГрузоперевозке(Команда)
	
	Если Элементы.ФинансыРасходы.ВыделенныеСтроки.Количество() > 1 Тогда
		ПоказатьПредупреждение(,"Для ввода на основании необходимо выбрать один документ!");
		Возврат;
	КонецЕсли;
	
	СсылкаДокументОснование	= ПолучитьСсылкуНаДокумент("ФинансыРасходы", Элементы.ФинансыРасходы.ТекущаяСтрока);
	
	СтруктураОснования = Новый Структура("ПредъявленСчет,ПредъявленАкт,ПредъявленСФ");
	ПолучитьДанныеДляВводаНаОсновании(СтруктураОснования, СсылкаДокументОснование) ;

	Если СтруктураОснования.ПредъявленСчет И 
		НЕ (СтруктураОснования.ПредъявленАкт ИЛИ СтруктураОснования.ПредъявленСФ) тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("КомандаИмя",  "/ФинансыРасходыОбновить");
		ОписаниеОповещенияПриЗакрытииФормы = Новый ОписаниеОповещения("ОбновитьТаблицуФинансы", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", СсылкаДокументОснование);
		ПараметрыФормы.Вставить("Основание"			, СсылкаДокументОснование);
		
		ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещенияПриЗакрытииФормы);
		
	Иначе
		ПоказатьПредупреждение(,"Ввод документ ""Расходы по грузоперевозке"" возможен только для документа с признаком ""Счет""");
	конецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСсылкуНаДокумент(ИмяТаблицы, ИдентификаторСтроки)
	
	ТекущаяСтрока = ЭтаФорма[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Возврат ТекущаяСтрока.Документ;
	
КонецФункции


&НаКлиенте
Процедура ОбновитьТаблицуФинансы(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент",ДополнительныеПараметры.КомандаИмя,Неопределено));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьДанныеДляВводаНаОсновании(СтруктураОснования, ТекущаяСсылка)
	
	ЗаполнитьЗначенияСвойств(СтруктураОснования, ТекущаяСсылка);
	
КонецПроцедуры


#КонецОбласти 



#Область ИспользуетсяБлокировкаМониторинга

&НаСервере
Процедура _ОбновитьСтатусБлокировкиМониторинга()
	// --- 
	
	ДатаБлокировкиМониторинга = CW_Мониторинг.ПолучитьДатуЗакрытияМониторинга(Объект.Ссылка);
	Если (ЗначениеЗаполнено(ДатаБлокировкиМониторинга)) Тогда
		
		Элементы.НадписьДатаБлокировки.Заголовок = Формат(ДатаБлокировкиМониторинга,"ДФ=dd.MM.yyyy");
		
	Иначе
		
		Элементы.НадписьДатаБлокировки.Заголовок = "<Нет>";
		
	КонецЕсли; 
	
	ВыполнитьДействиеНаСервере(_УФКС.СД("Грузоперевозки","сервер","/ПраваДоступа"));
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуБлокировкиГрузоперевозок(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияДатыБлокировки",ЭтотОбъект, Новый Структура()); 
	ПФ = Новый Структура("ДатаЗакрытия,Аналитика",ДатаБлокировкиМониторинга,Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.CW_УстановкаДатыБлокировкиМониторинга",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаИзмененияДатыБлокировки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	_ОбновитьСтатусБлокировкиМониторинга();
	
	ВыполнитьРасчетЛогистическогоСтатусаНаСервере();
	ВыполнитьРасчетФинансовогоСтатусаНаСервере();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура Форма_ФинансыТранспортОбновить(Команда)
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент",СтрЗаменить(Команда.Имя,"Форма_","/"),Неопределено));
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансыТранспортВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ФинансыТранспортПутевойЛист" Тогда
		ПараметрыФормы = Новый Структура("Ключ", ФинансыТранспорт[ВыбраннаяСтрока].ПутевойЛист);
		ОткрытьФорму("Документ.CW_ПутевойЛист.ФормаОбъекта",ПараметрыФормы);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", ФинансыТранспорт[ВыбраннаяСтрока].ДокументРасходов);
		ОткрытьФорму("Документ.ТребованиеНакладная.ФормаОбъекта",ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры
  

#КонецОбласти 

//Блокировка финансов
&НаКлиенте
Процедура Форма_ИзменитьДатуЗакрытия(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияДатыБлокировкиФинансов",ЭтотОбъект, Новый Структура()); 
	ПФ = Новый Структура("ДатаЗакрытия,Аналитика",ДатаЗакрытия,Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.CW_УстановкаДатыБлокировкиДокументов",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияДатыБлокировкиФинансов(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	ОбновитьСтатусБлокировкиФинансов();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусБлокировкиФинансов()
	
	ДатаЗакрытия = CW_Мониторинг.ПолучитьДатуЗакрытия(Объект.Ссылка);
	Если ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		Элементы.НадписьЗакрытие.Заголовок = Формат(ДатаЗакрытия,"ДФ=dd.MM.yyyy");
	Иначе
		Элементы.НадписьЗакрытие.Заголовок = "<Нет>";
	КонецЕсли;
	
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	
	//Подсистема.ЛогистическиеСтатусы
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	CW_ЛогистическиеСтатусыСервер.ПослеЗаписиНаСервере(ЭтаФорма);
	//Подсистема.ЛогистическиеСтатусы
	
	//Подсистема.ФинансовыеСтатусы
	CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
	CW_ФинансовыеСтатусыСервер.ПослеЗаписиНаСервере(ЭтаФорма);
	//Подсистема.ФинансовыеСтатусы
	
	// --- 
	ВыполнитьДействиеНаСервере(_УФКС.СД("Грузоперевозки","сервер","/ПраваДоступа"));
	// --- 
	
КонецПроцедуры
//Блокировка финансов


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()
	
	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
//Наличие прикрепленных файлов


&НаСервере
Процедура ЗаявкаПриИзмененииНаСервере()
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования") Тогда
		Элементы.ЗаполнитьБюджетыПоЗаявке.Видимость = ЗначениеЗаполнено(Объект.Заявка);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	ЗаявкаПриИзмененииНаСервере();
КонецПроцедуры

//ЗАПОЛНЕНИЕ БЮДЖЕТОВ

//Заполнение по грузоперевозке
&НаКлиенте
Процедура Бюджет_ЗаполнитьПоГрузоперевозке(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораГрузоперевозки",ЭтотОбъект); 
	СтруктураПараметров = Новый Структура("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора",СтруктураПараметров,,Истина,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораГрузоперевозки(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПараметровКопированияБюджетаГрузоперевозки",ЭтотОбъект); 
	СтруктураПараметров = Новый Структура("Грузоперевозка, ВерсияБюджета", ВыбранноеЗначение, БюджетТекущаяВерсия);
	ОткрытьФорму("Справочник.CW_Грузоперевозки.Форма.ФормаКопированияБюджета",СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПараметровКопированияБюджетаГрузоперевозки(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьЗаполнениеБюджетаПоГрузоперевозкеНаСервереВФоне(РезультатВыбора);
	
	Дополнительныепараметры = Новый Структура;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатКопированияБюджетаИзГрузоперевозки", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьЗаполнениеБюджетаПоГрузоперевозкеНаСервереВФоне(ПараметрыПроцедуры)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Копирование бюджета из грузоперевозки";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры.Вставить("Ссылка", 			Объект.Ссылка);
	ПараметрыПроцедуры.Вставить("Клиент", 			Объект.Клиент);
	ПараметрыПроцедуры.Вставить("ТекущаяВерсия", 	БюджетТекущаяВерсия);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_Грузоперевозки.СкопироватьБюджетИзГрузоперевозки",ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции  

&НаКлиенте
Процедура ОбработатьРезультатКопированияБюджетаИзГрузоперевозки(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент","/БюджетОбновить"));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка заполнения бюджетов!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка заполнения бюджетов");
		
	КонецЕсли;
	
КонецПроцедуры
//Заполнение по грузоперевозке

//Заполнение по заявке
&НаКлиенте
Процедура ЗаполнитьБюджетыПоЗаявке(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо записать грузоперевозку!");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаказа = ПолучитьПараметрыОткрытияФормыСозданияЗаказов();
	ПараметрыЗаказа.Вставить("РежимЗаполненияБюджетов", Истина);
	ПараметрыЗаказа.Вставить("Количество", 1);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьЗаполнениеБюджетовПоЗаявке", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CW_СозданиеЗаказа", ПараметрыЗаказа, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеБюджетовПоЗаявке(Ответ, Параметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьЗаполнениеБюджетаПоЗаявкеНаСервереВФоне(Ответ);
	
	Дополнительныепараметры = Новый Структура;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗаполнениеБюджетаПоЗаявке", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьЗаполнениеБюджетаПоЗаявкеНаСервереВФоне(ПараметрыПроцедуры)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Заполнение бюджетов по заявке";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	мГрузоперевозка = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
	
	ПараметрыПроцедуры.Вставить("Грузоперевозки", мГрузоперевозка);

	Если ЭтоАдресВременногоХранилища(ПараметрыПроцедуры.АдресВариантовБюжетаЗаявки) Тогда
		СписокВариантовБюджета = ПолучитьИзВременногоХранилища(ПараметрыПроцедуры.АдресВариантовБюжетаЗаявки);   
	КонецЕсли; 
	
	ПараметрыПроцедуры.Вставить("СписокВариантовБюджета", 			СписокВариантовБюджета);
	ПараметрыПроцедуры.Вставить("УдалитьСуществующиеСтатьиБюджета", Истина);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_Бюджетирование.ЗаполнитьБюджетыПоЗаявке",ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции  

&НаКлиенте
Процедура ОбработатьРезультатЗаполнениеБюджетаПоЗаявке(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));	
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка заполнения бюджетов!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка заполнения бюджетов");
		
	КонецЕсли;
	
КонецПроцедуры
//Заполнение по заявке

&НаСервере
Функция ПолучитьПараметрыОткрытияФормыСозданияЗаказов()
	
	Результат = Новый Структура;
	Результат.Вставить("Заявка", 		 		Объект.Заявка);
	Результат.Вставить("ТипПеревозки", 	 		Объект.ТипПеревозки);
	Результат.Вставить("РежимСозданиеЗаказа",	Ложь);
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования") Тогда
		
		Результат.Вставить("ВариантБюжетаЗаявки", 	Объект.Заявка.ВариантБюджета);
		Результат.Вставить("КопироватьБюджет", 		Истина);
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции


//Подключаемые команды
&НаСервере
Процедура ДобавитьПодключаемыеКоманды()
	
	ДанныеПодключаемыхКоманд =  ПолучитьДанныеПодключаемыхКоманд();
	
	Для Каждого ЭлементДанных из ДанныеПодключаемыхКоманд Цикл
		
		ИмяКоманды 		= ЭлементДанных.Ключ;
		ДанныеКоманды 	= ЭлементДанных.Значение;

		СоздатьКомандуФормы(ЭлементДанных.Ключ, ДанныеКоманды.ЗаголовокКоманды);
		
		ИмяЭлементаГруппы 	= "ГруппаПодключаемыеКоманды";
		
		ПараметрыКнопки = новый Структура;
		ПараметрыКнопки.Вставить("ИмяКоманды"			, ИмяКоманды);
		ПараметрыКнопки.Вставить("ИмяКартинки"			, "");
		ПараметрыКнопки.Вставить("Заголовок"			, ДанныеКоманды.ЗаголовокКоманды);
		ПараметрыКнопки.Вставить("ИмяЭлементаГруппы"	, ИмяЭлементаГруппы);
		
		ДобавитьКнопкуНаФорму(ПараметрыКнопки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПодключаемыхКоманд()
	
	ДанныеПодключаемыхКоманд = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъекты.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА CW_ПодключаемыеОбъектыФормыОбъекта.ИмяФормы ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьФормаЗаполнения,
	               |	CW_ПодключаемыеОбъектыФормыОбъекта.ИмяФормы КАК ИмяФормы
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CW_ПодключаемыеОбъекты.ФормыОбъекта КАК CW_ПодключаемыеОбъектыФормыОбъекта
	               |		ПО CW_ПодключаемыеОбъекты.Ссылка = CW_ПодключаемыеОбъектыФормыОбъекта.Ссылка
	               |			И (CW_ПодключаемыеОбъектыФормыОбъекта.ТипФормы = ""ФормаНастроекЗаполнения"")
	               |ГДЕ
	               |	CW_ПодключаемыеОбъекты.ТипВнешнегоОбъекта = Значение(Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка)
	               |	И (CW_ПодключаемыеОбъекты.Вид = ""ЗаполнениеБюджета_CW_Грузоперевозки""
				   //Поддержка версии 1.0
	               |			ИЛИ CW_ПодключаемыеОбъекты.Вид = ""ЗаполнениеБюджета"")
				   //Поддержка версии 1.0
	               |	И CW_ПодключаемыеОбъекты.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ПодключаемыеОбъекты.НеИспользуется = ЛОЖЬ";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИдентифкаторКоманды = "_"+Строка(Выборка.Ссылка.УникальныйИдентификатор());
		ИдентифкаторКоманды = СтрЗаменить(ИдентифкаторКоманды, "-", "_");
		
		Подключена =_ПО.ПодключитьОбработку(Выборка.Ссылка);

		СтруктурДанных = Новый Структура;
		СтруктурДанных.Вставить("Обработка", 			Выборка.Ссылка);
		СтруктурДанных.Вставить("ЗаголовокКоманды", 	Строка(Выборка.Ссылка));
		СтруктурДанных.Вставить("Подключена", 			Подключена);
		СтруктурДанных.Вставить("ЕстьФормаЗаполнения", 	Выборка.ЕстьФормаЗаполнения);
		
		Если Выборка.ЕстьФормаЗаполнения Тогда
			ПолноеИмяФрмы = _ПО.ПолучитьПолноеИмяФормы(Выборка.Ссылка,Выборка.ИмяФормы);
			СтруктурДанных.Вставить("ПолноеИмяФрмы", 	ПолноеИмяФрмы);
		КонецЕсли;
		
		ДанныеПодключаемыхКоманд.Вставить(ИдентифкаторКоманды, СтруктурДанных);
		
	КонецЦикла;
	
	АдресПодключаемыхКоманд = ПоместитьВоВременноеХранилище(ДанныеПодключаемыхКоманд, УникальныйИдентификатор);
	
	Возврат ДанныеПодключаемыхКоманд;
	
КонецФункции

&НаСервере
Процедура ДобавитьКнопкуНаФорму(ПараметрыКнопки)
	
	РасположениеКоманды = ЭтотОбъект.Элементы.Найти(ПараметрыКнопки.ИмяЭлементаГруппы);
	
	//Ссмылки на форме
	НайденныйЭлемент =  ЭтотОбъект.Элементы.Найти(ПараметрыКнопки.ИмяКоманды);
	Если НайденныйЭлемент <> Неопределено Тогда
		ЭтотОбъект.Элементы.Удалить(НайденныйЭлемент);
	КонецЕсли;
	
	// создадим кнопку
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить(ПараметрыКнопки.ИмяКоманды,  	// Первый параметр - имя кнопки
												Тип("КнопкаФормы")		,  	// Второй параметр - тип элемента управления
												РасположениеКоманды)	;	// Третий параметр - место расположения на форме
	
	НовыйЭлемент.Вид    		= ВидКнопкиФормы.КнопкаКоманднойПанели; // вид кнопки
	НовыйЭлемент.Заголовок  	= ПараметрыКнопки.Заголовок;
	НовыйЭлемент.ИмяКоманды 	= ПараметрыКнопки.ИмяКоманды;
	НовыйЭлемент.Картинка 		= БиблиотекаКартинок.CW_Загрузка;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКомандуФормы(ИмяКоманды, ЗаголовокКоманды)
	
	Если ЭтотОбъект.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		
		// создадим команду
		НоваяКоманда = ЭтотОбъект.Команды.Добавить(ИмяКоманды); 			// Имя нашей команды
		НоваяКоманда.Заголовок  = ЗаголовокКоманды; 						// заголовок
		НоваяКоманда.Действие   = "ПодключаемыеКоманды_ЗаполнитьБюджет"; 	// Имя функции/процедуры	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыеКоманды_ЗаполнитьБюджет(Команда)
	
	ПараметрыКоманды 	= ПолучитьПараметрыКомандыНаСервере(Команда.Имя);

	СтруктураПараметров	= ПолучитьПараметрыЗаполнения(ПараметрыКоманды.Обработка);
	
	Если ПараметрыКоманды.ЕстьФормаЗаполнения Тогда
		// открываем форму
		ОписаниеОповещения	= Новый ОписаниеОповещения("ОбработкаЗаполненияБюджета",ЭтотОбъект);
		
		ОткрытьФорму(ПараметрыКоманды.ПолноеИмяФрмы,СтруктураПараметров,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		Если ПараметрыКоманды.ВыполнятьВФоне Тогда     

			РезультатВыполнения =  ПродолжитьЗаполнениеБюджетаНаСервереВФоне(СтруктураПараметров);
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗаполненияБюджета", ЭтотОбъект);
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
			
		Иначе
			// неинтерактивно
			Ответ = ЗаполнитьНеинтерактивно(ПараметрыКоманды.Обработка);
			Если Ответ <> Неопределено Тогда
				Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
					_УФК.ВывестиПредупреждение("Ошибка заполнения: "+_УФКС.ПредставлениеОшибки(Ответ));
				КонецЕсли;
			КонецЕсли; 
			
			ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗаполненияБюджета(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
	
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Бюджеты не заполнены!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка заполнения");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПродолжитьЗаполнениеБюджетаНаСервереВФоне(ПараметрыПроцедуры)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Заполнение бюджета заказа";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_Заказы.ПодключаемыеКоманды_ЗаполнитьБюджет", ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции

&НаСервере
Функция ПолучитьПараметрыКомандыНаСервере(ИмяКоманды)
	
	ПараметрыКоманд = ПолучитьИзВременногоХранилища(АдресПодключаемыхКоманд);
	
	СтруктураКоманды = ПараметрыКоманд.Получить(ИмяКоманды);
	
	//Дополнительная информация по обработке
	ОбработкаОбъект 		= _ПО.ПолучитьОбработку(СтруктураКоманды.Обработка);
	ИнформацияОбОбработке 	= ОбработкаОбъект.Информация();
	
	ВыполнятьВФоне = Ложь;
	Если ИнформацияОбОбработке.Свойство("ВыполнятьВФоне") Тогда
		ВыполнятьВФоне = ИнформацияОбОбработке.ВыполнятьВФоне;	
	КонецЕсли;
	
	СтруктураКоманды.Вставить("ВыполнятьВФоне",ВыполнятьВФоне);
	
	Возврат СтруктураКоманды;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыЗаполнения(ОбработкаЗаполнения)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Грузоперевозка",	Объект.Ссылка);
	СтруктураПараметров.Вставить("ВерсияБюджета",	БюджетТекущаяВерсия);
	СтруктураПараметров.Вставить("Обработка",		ОбработкаЗаполнения);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Функция ЗаполнитьНеинтерактивно(ОбработкаЗаполнения)
	// --- 
	
	СтруктураПараметров = ПолучитьПараметрыЗаполнения(ОбработкаЗаполнения);
	Обработка 			= _ПО.ПолучитьОбработку(ОбработкаЗаполнения);
	Ответ 				= Обработка.ЗаполнитьБюджет(СтруктураПараметров);
	Возврат Ответ;
	
	// --- 
КонецФункции
//Подключаемые команды

//Подсистема.ЛогистическиеСтатусы
&НаКлиенте
Процедура ЛогистическийСтатусОбновить(Команда)
	ВыполнитьРасчетЛогистическогоСтатусаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРасчетЛогистическогоСтатусаНаСервере()
	
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);

	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	CW_ЛогистическиеСтатусыСервер.ПослеЗаписиНаСервере(ЭтаФорма);

КонецПроцедуры
//Подсистема.ЛогистическиеСтатусы


//Подсистема.ФинансовыеСтатусы  
&НаКлиенте
Процедура ФинансовыйСтатусОбновить(Команда)
	ВыполнитьРасчетФинансовогоСтатусаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРасчетФинансовогоСтатусаНаСервере()
	
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);

	CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
	CW_ФинансовыеСтатусыСервер.ПослеЗаписиНаСервере(ЭтаФорма);
	
КонецПроцедуры
//Подсистема.ФинансовыеСтатусы




&НаКлиенте
Процедура ОбработкаЗаполненияБюджета(Ответ,ДополнительныеПараметры=Неопределено) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
			
			_УФК.ВывестиПредупреждение("Ошибка заполнения: "+_УФКС.ПредставлениеОшибки(Ответ));
			
		Иначе
			
			ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));

			//Сортировка бюджетов
			ВосстановитьСортировкуТаблицы("БюджетРасходы");
			ВосстановитьСортировкуТаблицы("БюджетДоходы");
			//Сортировка бюджетов
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтслеживаемоеОборудованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимВыбора",				Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор",		Ложь);
	СтруктураПараметров.Вставить("ДатаПроверки",			Объект.ДатаСделкиФ);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаПривязкиОборудования",ЭтотОбъект); 
	
	ОткрытьФорму("Справочник.CW_ОтслеживаемоеОборудование.ФормаВыбора", СтруктураПараметров,ЭтаФорма,Истина,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//Использование количества  
&НаСервере
Процедура УстановитьДоступностьОбновленияКоличестваНаСервере()       
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если БюджетТекущаяВерсия.Пустая() Тогда
		Возврат;
	Конецесли;
	
	Если ИспользованиеКоличестваДляПлановыхСтатей и ПолучениеКоличестваУслугИзПараметраГрузоперевозки Тогда
		БюджетЗаблокирован = РегистрыСведений.CW_УтверждениеБюджетов.ПолучитьБлокировкуБюджета(Объект.Ссылка, БюджетТекущаяВерсия);
		Элементы.ОбновитьКоличествоРасходы.Доступность = Не БюджетЗаблокирован; 
		Элементы.ОбновитьКоличествоДоходы.Доступность  = НЕ БюджетЗаблокирован;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоДоходы(Команда)
	
	ОбновитьКоличествоНаКлиенте(ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"));

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоРасходы(Команда)  
	
	ОбновитьКоличествоНаКлиенте(ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы")); 
	
КонецПроцедуры    

&НаКлиенте
Процедура ОбновитьКоличествоНаКлиенте(ВидСтатьиПланирования)
	
	РезультатВыполнения =  ОбновитьКоличествоНаСервереВФоне(ВидСтатьиПланирования);
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;   
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидСтатьиПланирования", ВидСтатьиПланирования);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатОбновленияКоличества", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьКоличествоНаСервереВФоне(ВидСтатьиПланирования)
	
	МассивСтатей = ПолучитьМассивСтатейБюджетаНаСервере(ВидСтатьиПланирования);   
	Если МассивСтатей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Обновление количества статей бюджета: "+Строка(Объект.Ссылка);
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("МассивСтатей", 	МассивСтатей);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ПлановыеСтатьиЗатратИДоходов.ОбновитьКоличествоПлановыхСтатей",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Функция  ПолучитьМассивСтатейБюджетаНаСервере(ВидСтатьиПланирования)  
	
	МассивСтатей = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	|ГДЕ
	|	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец
	|	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
	|	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = &ВидСтатьиПланирования";
	
	Запрос.УстановитьПараметр("Владелец", 				Объект.Ссылка);
	Запрос.УстановитьПараметр("ВерсияБюджета", 			БюджетТекущаяВерсия);
	Запрос.УстановитьПараметр("ВидСтатьиПланирования", 	ВидСтатьиПланирования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивСтатей.Добавить(Выборка.Ссылка);
	КонецЦикла;                           
	
	Возврат МассивСтатей;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатОбновленияКоличества(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		Если ДополнительныеПараметры.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда
			КомандаИмя = "/БюджетДоходыОбновить"	
		Иначе
			КомандаИмя = "/БюджетРасходыОбновить"	
		КонецЕсли;
		
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент", КомандаИмя, Неопределено));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось обновить количество одной или нескольких статей бюджета!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка обновления количества");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьПараметрыЗаказа(Команда)
	ПоказатьСкрытьПараметрыЗаказаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьПараметрыЗаказаНаКлиенте()
	
	ОтображатьПараметрыЗаказаВГрузоперевозке = Не ОтображатьПараметрыЗаказаВГрузоперевозке;
	Элементы.ДПГПоказатьСкрытьПараметрыЗаказа.Пометка 	=  ОтображатьПараметрыЗаказаВГрузоперевозке;
	
	_ОбновитьСписокПараметровОтслеживаемогоОборудования();
	ОбновитьДеревоПараметров();

КонецПроцедуры
//Использование количества   

//Суммирование значений колонок
&НаКлиенте
Процедура СуммаПоВыделеннымСтрокам(Команда)

	ИмяТаблицы 		= Этаформа.ТекущийЭлемент.Имя;   
	
	// если имя текущего элемента не удается найти на форме	
	Попытка
 		ТаблицаФормы 	= Этаформа[ИмяТаблицы];   
	Исключение
		Возврат;	
	КонецПопытки;  
	
	Если Элементы[ИмяТаблицы].ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ТаблицаФормы) = Тип("ДинамическийСписок") Тогда    
		СтркутраПараметров = ПолучитьСтруктуруИтоговДинамическогоСпискаНаСервере(ИмяТаблицы);	 
	Иначе
		СтркутраПараметров = CW_Грузоперевозки_Клиент.ПолучитьСтруктуруИтоговТаблицыФормы(Этаформа, ИмяТаблицы);	 
	КонецЕсли;  
	
	CW_Грузоперевозки_Клиент.ОткрытьФормуВычисленияЗначений(СтркутраПараметров, ЭтаФорма);
	
КонецПроцедуры    

&НаСервере
Функция ПолучитьСтруктуруИтоговДинамическогоСпискаНаСервере(ИмяТаблицы)
	
	Возврат CW_Грузоперевозки_Сервер.ПолучитьСтруктуруИтоговДинамическогоСписка(ЭтаФорма, ИмяТаблицы);
	
КонецФункции
//Суммирование значений колонок


&НаКлиенте
Процедура ОтчетЭкспедитораПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = истина;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ПорядокЗаполнения", 0);
	ЗначенияЗаполнения.Вставить("ЗначениеОтбора", Объект.Ссылка);

	ДополнитьКонтрагентаИДоговор(ЗначенияЗаполнения);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.CW_ОтчетЭкспедитора.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	

КонецПроцедуры   

&НаСервере
Процедура ДополнитьКонтрагентаИДоговор(ЗначенияЗаполнения)   
	
	СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя();
	СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
	
	Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда 
		ЗначенияЗаполнения.Вставить("Контрагент", СтруктураДанныхСтроки.Покупатель);
	КонецЕсли;
	Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
		ЗначенияЗаполнения.Вставить("Договор", СтруктураДанныхСтроки.ДоговорПокупателя);
	КонецЕсли;
	Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
		ЗначенияЗаполнения.Вставить("ПриложениеКДоговору", СтруктураДанныхСтроки.ПриложениеКДоговору);
	КонецЕсли;
	
КонецПроцедуры		

//Получение параметров для строки "Покупатель", "Договор", "Приложение"
&НаСервере
Функция ПодготовитьДанныеДляПолученияДанныхпокупателя()
	
	Организация = CW_Настройки.ОсновнаяОрганизация();
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", 		Организация);
	Результат.Вставить("Контрагент", 		Объект.Клиент);
	Результат.Вставить("Объект", 			Объект.Ссылка);
	Результат.Вставить("Заказ", 			Объект.Заказ);
	Результат.Вставить("ЭтоВариантБюджета", ЛОЖЬ);
	Результат.Вставить("УчетПриложений", 	ЛОЖЬ);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПокупателя(СтруктураПараметров)
	
	Покупатель = CW_Финансы.ВернутьПлательщика(СтруктураПараметров);
	СтруктураПараметров.Вставить("Покупатель", Покупатель);
	
	ПолучитьДоговорПокупателя(СтруктураПараметров);
	ПолучитьПриложениеПоДоговору(СтруктураПараметров);
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("Покупатель", СтруктураПараметров.Покупатель);
	
	Если СтруктураПараметров.Свойство("ДоговорПокупателя") Тогда
		ДанныеСтроки.Вставить("ДоговорПокупателя", СтруктураПараметров.ДоговорПокупателя);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ПриложениеКДоговору") Тогда
		ДанныеСтроки.Вставить("ПриложениеКДоговору", СтруктураПараметров.ПриложениеКДоговору);
	КонецЕсли;
	
	Возврат ДанныеСтроки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПолучитьДоговорПокупателя(СтруктураПараметров)
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Объект) Тогда
		Возврат;
	КонецЕсли; 
	
	НайденныйДоговор = ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка");
	
	ПараметрДоговора = Константы.CW_ПараметрДоговораПлательщика.Получить();
	Если Не ПараметрДоговора.Пустая() Тогда
		
		НайденныйДоговор = ПолучитьЗначениеПараметра(СтруктураПараметров.Объект, ПараметрДоговора, ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка"));
		
		Если Не ЗначениеЗаполнено(НайденныйДоговор) Тогда
			Если СтруктураПараметров.Свойство("Заказ") Тогда
				Если ЗначениеЗаполнено(СтруктураПараметров.Заказ) Тогда
					НайденныйДоговор = ПолучитьЗначениеПараметра(СтруктураПараметров.Заказ, ПараметрДоговора, ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка"))
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденныйДоговор) Тогда
			Если НайденныйДоговор.Владелец <> СтруктураПараметров.Покупатель ИЛИ
				НайденныйДоговор.Организация <> СтруктураПараметров.Организация Тогда
				
				НайденныйДоговор = ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка");
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(НайденныйДоговор)  Тогда
		ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");
		НайденныйДоговор = CW_Документы.ПолучитьПоследнийДоговор(СтруктураПараметров.Покупатель, СтруктураПараметров.Организация, ВидДоговора);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ДоговорПокупателя", НайденныйДоговор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьПриложениеПоДоговору(СтруктураПараметров)
	
	Если НЕ ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам") Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Объект) Тогда
		Возврат;
	КонецЕсли; 

	Если НЕ СтруктураПараметров.ДоговорПокупателя.ИспользуютсяПриложения Тогда
		Возврат;
	КонецЕсли;
	
	НайденноеПриложение = ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка");
	
	СтруктураПараметров.УчетПриложений = Истина;
	
	ПараметрПриложенияДоговора = Константы.CW_ПараметрПриложенияДоговора.Получить();
	Если Не ПараметрПриложенияДоговора.Пустая() Тогда
		
		НайденноеПриложение = ПолучитьЗначениеПараметра(СтруктураПараметров.Объект, ПараметрПриложенияДоговора, ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка"));
		
		Если НайденноеПриложение.Пустая() Тогда
			Если СтруктураПараметров.Свойство("Заказ") Тогда
				Если ЗначениеЗаполнено(СтруктураПараметров.Заказ) Тогда
					НайденноеПриложение = ПолучитьЗначениеПараметра(СтруктураПараметров.Заказ, ПараметрПриложенияДоговора, ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка"))
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не НайденноеПриложение.Пустая() Тогда
			Если НайденноеПриложение.Договор <> СтруктураПараметров.ДоговорПокупателя  Тогда
				НайденноеПриложение = ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка");
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
	Если НайденноеПриложение.Пустая() Тогда
		
		Запрос = Новый Запрос;
		запрос.Текст = "ВЫБРАТЬ
		               |	CW_ПриложенияКДоговорам.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.CW_ПриложенияКДоговорам КАК CW_ПриложенияКДоговорам
		               |ГДЕ
		               |	CW_ПриложенияКДоговорам.Договор = &Договор
		               |	И CW_ПриложенияКДоговорам.ПометкаУдаления = ЛОЖЬ
		               |	И (CW_ПриложенияКДоговорам.СрокДействия > &Текущаядата
		               |			ИЛИ CW_ПриложенияКДоговорам.СрокДействия = &ПустаяДата)";
		
		Запрос.УстановитьПараметр("Договор", 		СтруктураПараметров.ДоговорПокупателя);
		Запрос.УстановитьПараметр("Текущаядата", 	ТекущаяДата());
		Запрос.УстановитьПараметр("ПустаяДата", 	Дата(1,1,1));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			НайденноеПриложение = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;

	СтруктураПараметров.Вставить("ПриложениеКДоговору", НайденноеПриложение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПараметра(ВладелецПараметров, Параметр, ПустоеЗначение)
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ВладелецПараметров)  = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
		               |	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
		               |	CW_ХарактеристикиГрузоперевозок.Значение КАК Значение
		               |ИЗ
		               |	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
		               |ГДЕ
		               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка = &ВладелецПараметров
		               |	И CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр";
	КонецЕсли;
	
	Если ТипЗнч(ВладелецПараметров)  = Тип("СправочникСсылка.CW_Заказы") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ХарактеристикиЗаказов.Параметр КАК Параметр,
		               |	CW_ХарактеристикиЗаказов.Значение КАК Значение
		               |ИЗ
		               |	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
		               |ГДЕ
		               |	CW_ХарактеристикиЗаказов.Заказ = &ВладелецПараметров
		               |	И CW_ХарактеристикиЗаказов.Параметр = &Параметр";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВладелецПараметров", ВладелецПараметров);
	Запрос.УстановитьПараметр("Параметр", 			Параметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат ПустоеЗначение;
	
КонецФункции
//Получение параметров для строки "Покупатель", "Договор", "Приложение"

&НаКлиенте
Процедура Отчет_ВедомостьПеревыставленияПоСтавкам(Команда) 
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода", 	Дата(1,1,1));
	ПараметрыОтчета.Вставить("КонецПериода", 	ТекущаяДата());  
	
	МассивГруппировок = Новый Массив;
	МассивГруппировок.Добавить("Контрагент");
	МассивГруппировок.Добавить("Договор");
	МассивГруппировок.Добавить("Грузоперевозка");
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("ВнешнийВызов", 	Истина);
	ПараметрыФормы.Вставить("Параметры", 		ПараметрыОтчета);
	ПараметрыФормы.Вставить("Группировки", 		МассивГруппировок);
	
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Грузоперевозка", Объект.Ссылка));
	
	ОткрытьФорму("Отчет.CW_ВедомостьПеревыставленияПоСтавкам.Форма", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры


//ХранениеПолногоЗначения
&НаСервере
Процедура ДобавитьСохраняемоеПолноеЗначение(Параметр, ХранимоеЗначение=Неопределено)
	
	Если Не CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда   
		Возврат
    КонецЕсли;
	
	Соответствие = Новый Соответствие;
	Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда
		Соответствие = Новый Соответствие(СохраняемоеПолноеЗначение);                                             
	КонецЕсли;
	
	Соответствие.Вставить(Параметр, ХранимоеЗначение);
	СохраняемоеПолноеЗначение = Новый ФиксированноеСоответствие(Соответствие);
	
КонецПроцедуры
//---ХранениеПолногоЗначения

&НаКлиенте
Процедура Форма_БюджетРасходыПересчитатьПоКурсу(Команда)

	ВыделенныеСтроки 	= Элементы.БюджетРасходы.ВыделенныеСтроки;
	МассивСтатейБюджета = ПолучитьМассивВыбранныхСтатейБюджетаНаСервере(ВыделенныеСтроки, "БюджетРасходы");
	
	CW_БюджетированиеКлиент.ПередНачаломПересчетаСтатейБюджета(ЭтаФорма, МассивСтатейБюджета, "/БюджетРасходыОбновить");
	
КонецПроцедуры 

&НаКлиенте
Процедура Форма_БюджетДоходыПересчитатьПоКурсу(Команда)

	ВыделенныеСтроки 	= Элементы.БюджетДоходы.ВыделенныеСтроки;
	МассивСтатейБюджета = ПолучитьМассивВыбранныхСтатейБюджетаНаСервере(ВыделенныеСтроки, "БюджетДоходы");
	
	CW_БюджетированиеКлиент.ПередНачаломПересчетаСтатейБюджета(ЭтаФорма, МассивСтатейБюджета, "/БюджетДоходыОбновить");
	
КонецПроцедуры


&НаСервере
Функция ПолучитьМассивВыбранныхСтатейБюджетаНаСервере(ВыделенныеСтроки, ИмяТаблицы) 
	
	Возврат CW_Бюджетирование.ПолучитьМассивСтатейБюджета(ЭтаФорма, ВыделенныеСтроки, ИмяТаблицы);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТаблицуБюджета(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполнитьДействие(_УФКС.СД("Грузоперевозки","клиент", ДополнительныеПараметры.ИмяПроцедуры, Неопределено));
	
КонецПроцедуры

//Сортировка бюджетов
&НаКлиенте
Процедура СортироватьПоВозрастаниюДоходы(Команда) 
	
	СортироватьТаблицуНаСервере("БюджетДоходы", "ВОЗР");  

КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбываниюДоходы(Команда)    
	
	СортироватьТаблицуНаСервере("БюджетДоходы", "УБЫВ");  
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоВозрастаниюРасходы(Команда)  

	СортироватьТаблицуНаСервере("БюджетРасходы", "ВОЗР");  
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбываниюРасходы(Команда)
	
	СортироватьТаблицуНаСервере("БюджетРасходы", "УБЫВ");  
	
КонецПроцедуры  

&НаСервере
Процедура СортироватьТаблицуНаСервере(ИмяТаблицы, Знач Направление)
	
	CW_Бюджетирование.СортироватьТаблицуБюджета(ЭтаФорма, ИмяТаблицы, Направление);

КонецПроцедуры 

&НаСервере
Процедура ВосстановитьСортировкуТаблицы(ИмяТаблицы)
	
	CW_Бюджетирование.ВосстановитьСортировкуТаблицы(ЭтаФорма, ИмяТаблицы);
	
КонецПроцедуры   
//Сортировка бюджетов


//Групповое редактирование реквизитов статей бюджета
&НаКлиенте
Процедура ГрупповоеРедактированиеРеквизитаСтатейРасходов(Команда)

	Отказ = Ложь;

	ВыделенныеСтроки 	= Элементы.БюджетРасходы.ВыделенныеСтроки;   
	CW_БюджетированиеКлиент.ПередНачаломГруповогоРедактированияРеквизитовСтатенйБюджета(ВыделенныеСтроки, Отказ);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;  	

	МассивСтатейБюджета = ПолучитьМассивВыбранныхСтатейБюджетаНаСервере(ВыделенныеСтроки, "БюджетРасходы");

	CW_БюджетированиеКлиент.ГрупповоеРедактированиеРеквизитовСтатейБюджета(ЭтотОбъект, МассивСтатейБюджета, "БюджетРасходы");

КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеРедактированиеРеквизитовСтатейДоходов(Команда)
	Отказ = Ложь;

	ВыделенныеСтроки 	= Элементы.БюджетДоходы.ВыделенныеСтроки;   
	CW_БюджетированиеКлиент.ПередНачаломГруповогоРедактированияРеквизитовСтатенйБюджета(ВыделенныеСтроки, Отказ);	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;  	

	МассивСтатейБюджета = ПолучитьМассивВыбранныхСтатейБюджетаНаСервере(ВыделенныеСтроки, "БюджетДоходы");
	
	CW_БюджетированиеКлиент.ГрупповоеРедактированиеРеквизитовСтатейБюджета(ЭтотОбъект, МассивСтатейБюджета, "БюджетДоходы");
  
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьФоновоеРедактированиеРеквизитов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов"));
		
		ВыполнитьДействие(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
		
		//Сортировка бюджетов
		ВосстановитьСортировкуТаблицы("БюджетРасходы");
		ВосстановитьСортировкуТаблицы("БюджетДоходы");
		//Сортировка бюджетов
	
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось изменить реквизты!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка изменения реквизитов");
	КонецЕсли;
	
КонецПроцедуры
//Групповое редактирование реквизитов статей бюджета
