
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВерсииПодсистем  = CW_ВерсииПодсистемСервер.УстановленныеВерсииПодсистем();
	Если ВерсииПодсистем.Свойство("CW_ДоходыНерезидентов") Тогда
		ВерсияПодсистемы = ВерсииПодсистем.CW_ДоходыНерезидентов;
	КонецЕсли;      
	
	ВерсияПодсистемы 	= ?(ВерсияПодсистемы = Неопределено, "Не установлена", ВерсияПодсистемы);
	Заголовок 			= Заголовок + " (версия "+СокрЛП(ВерсияПодсистемы)+")"; 

	Результат = CW_ДоходыНерезидентовСервер.ПолучитьРегистрационнуюИнформациюСервиса();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Результат);
	
	Если КонецДня(ТекущаяДата()) <= ДатаОкончания 
		И НачалоДня(ТекущаяДата()) >= ДатаНачала Тогда
		Статус = "Действует";
		ЦветТекстаНадписи = WebЦвета.Зеленый;
	Иначе
		Статус = "Не оформлена";
		ЦветТекстаНадписи = WebЦвета.Красный;
	КонецЕсли;

	Элементы.Статус.ЦветТекста = ЦветТекстаНадписи;   
	
	ПроверитьНаличиеДополнительныъРеквизитовДоговоров();  
	
	Элементы.Группа3.Видимость = Не РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована();
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьНаличиеДополнительныъРеквизитовДоговоров()   
	
	КартинкаПриказа = ПолучитьКартинкуСуществованияРеквизитов("Отчет_2023Кв4_Раздел42");
	СписокПриказов.Добавить("СоздатьРеквизиты2023Кв4",ПредопределенноеЗначение("ПланВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела.Отчет_2023Кв4_Раздел42"),,КартинкаПриказа);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКартинкуСуществованияРеквизитов(ИмяСвойства)

	РеквизитыСуществуют = Истина;
	НаборСвойств 		= ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ДоговорыКонтрагентов");	
	
	ИменаПроверяемыхРеквизтов	= CW_ДоходыНерезидентовДополнительный.ПолучитьИменаПроверяемыхРеквизтов();  
	
	ИменаДополнительныхРеквизитов 	= ИменаПроверяемыхРеквизтов.Получить(ИмяСвойства); 
	Для Каждого ИмяРеквизита из ИменаДополнительныхРеквизитов Цикл
		НайденнаяСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", ИмяРеквизита);  
		Если НайденнаяСсылка.Пустая() Тогда
			РеквизитыСуществуют = Ложь;
			Прервать;
		КонецЕсли;
		
		НайденнаяСтрока = НаборСвойств.ДополнительныеРеквизиты.Найти(НайденнаяСсылка, "Свойство");
		Если НайденнаяСтрока = Неопределено Тогда 
			//Реквизит есть, а в набор не добалвен!
			РеквизитыСуществуют = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;    
	
	КартинкаПриказа = ?(РеквизитыСуществуют, БиблиотекаКартинок.ЗеленаяГалка, БиблиотекаКартинок.ВниманиеКрасноБелое);
	
	Возврат КартинкаПриказа;

КонецФункции

&НаКлиенте
Процедура СоздатьДополнительныеРквизитыДоговоров(Команда)    
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Будут созданы (переформированы) дополнительные реквизиты договоров с контрагентами. Продолжить?", Режим, 0);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ТекущиеДанные = Элементы.СписокПриказов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	Конецесли;
	
	ПродолжитьФормированиеРеквизитовНаСервере(ТекущиеДанные.Значение);

КонецПроцедуры

&НаСервере
Процедура ПродолжитьФормированиеРеквизитовНаСервере(ИмяПроцедуры)   
	
	Выполнить "CW_ДоходыНерезидентовСервер."+ИмяПроцедуры+"()";
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСчетовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;   
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборСчета", ЭтотОбъект);  
	
	ДоступныеСчета = ПолучитьДоступныеСчета(); 
	
	СтрукутраОтбора = Новый Структура;
	СтрукутраОтбора.Вставить("Ссылка", ДоступныеСчета);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", ложь);
	СтруктураПараметров.Вставить("Отбор", СтрукутраОтбора);
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.ФормаВыбора", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВыборСчета(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;   

	ДобавитьСчетаВСписокНаСервере(РезультатВыбора, Ложь);
	Элементы.СписокСчетов.Обновить();
	
КонецПроцедуры        

&НаКлиенте
Процедура ТаблицаСчетовПодбор(Команда)

	ДоступныеСчета = ПолучитьДоступныеСчета(); 
	
	СтрукутраОтбора = Новый Структура;
	СтрукутраОтбора.Вставить("Ссылка", ДоступныеСчета);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", ложь);
	СтруктураПараметров.Вставить("Отбор", СтрукутраОтбора);
	
	ОткрытьФорму("ПланСчетов.Хозрасчетный.ФормаВыбора", СтруктураПараметров, Элементы.СписокСчетов,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьДоступныеСчета()   
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты"));
	МассивСубконто.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры"));

	Возврат	CW_ДоходыНерезидентовДополнительный.ПолучитьДоступныеСчета(,МассивСубконто); 
	
КонецФункции

&НаКлиенте
Процедура СписокСчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДобавитьСчетаВСписокНаСервере(ВыбранноеЗначение, Ложь);
	Элементы.СписокСчетов.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаСчетовЗаполнитьВсеНаСервере()
	
	МассивСчетов   = CW_ДоходыНерезидентовДополнительный.ПолучитьСписокСчетовДляЗаполнения();
	ДоступныеСчета = CW_ДоходыНерезидентовДополнительный.ПолучитьДоступныеСчета(МассивСчетов,);
	ДобавитьСчетаВСписокНаСервере(ДоступныеСчета, Истина);
	
КонецПроцедуры   

&НаСервере
Процедура ДобавитьСчетаВСписокНаСервере(ДоступныеСчета, ОчиститьНабор)
	
	CW_ДоходыНерезидентовДополнительный.ДобавитьСчетаВСписок(ДоступныеСчета, ОчиститьНабор);
	
КонецПроцедуры 


&НаКлиенте
Процедура ТаблицаСчетовЗаполнитьВсе(Команда)
	ТаблицаСчетовЗаполнитьВсеНаСервере(); 
	Элементы.СписокСчетов.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокСчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = ложь;
	
	ТекущиеДанные = Элементы.СписокСчетов.ТекущиеДанные;
	ПоказатьЗначение(,ТекущиеДанные.Счет);
	
КонецПроцедуры
