&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовокФормыНаСервере();

	КонтролироватьКоректностьНомераКонтейнера = ПолучитьФункциональнуюОпцию("CW_КонтролироватьКоректностьНомераКонтейнерногоОборудования");
	
	ТекстНезаполненногоЗаголовкаПарамтера   = "Выбрать параметр";
	ТекстНезаполненногоЗаголовкаДействия 	= "Выбрать действие";
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	МакетЗаголовка = ТОбъект.ПолучитьМакет("МакетЗаголовка");   
	ОбластьЗаголовок = МакетЗаголовка.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ИмяРеквизита 	= ТекстНезаполненногоЗаголовкаПарамтера;
	ОбластьЗаголовок.Параметры.Действие 		= ТекстНезаполненногоЗаголовкаДействия;
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок); 
	
	РежимПоказать = "Все";  
	
	Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаНачало;  

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбработатьШагНаКлиенте("Шаг1");
	
КонецПроцедуры  


&НаСервере
Процедура УстановитьЗаголовокФормыНаСервере(Знач ИмяВыбраннойНастройки="")
	
	Если ПустаяСтрока(ИмяВыбраннойНастройки) Тогда
		ИмяНастройки = "";
	Иначе
		ИмяНастройки = "(" + ИмяВыбраннойНастройки + ")";
	КонецЕсли;
	
	ЭтаФорма.Заголовок = СокрЛП("Загрузка параметров оборудования из файла "+ИмяНастройки);

КонецПроцедуры


//Шаги
&НаКлиенте
Процедура КомандаДалее(Команда)  
	
	ОбработатьШагНаКлиенте("Шаг2"); 
	
	ВключитьОтбор = (РежимПоказать = "НеПодобранные");
	УстановитьОтборСтрок(ВключитьОтбор);
	
КонецПроцедуры   

&НаКлиенте
Процедура КомандаДалееШаг3(Команда)
	
	ОбработатьШагНаКлиенте("Шаг3"); 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда) 
	
	ОбработатьШагНаКлиенте("Шаг1");   
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШагНаКлиенте(ИмяШага) 
	
	Если ИмяШага = "Шаг1" Тогда
		Если ТаблицаСоответствий.Количество() > 0 Тогда
			ПометитьСтрокиТабличногоДокумента();
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяШага = "Шаг2" Тогда 
		Успешно = Истина;
		ЗаполнитьТаблицуСоответствий(Успешно);    
		Если Успешно Тогда
		Иначе
			ПоказатьПредупреждение(, "Не установлено соответствие колонок!"); 
			ИмяШага = "Шаг1"	
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяШага = "Шаг3" Тогда 
		
		УстановитьКартинкуОжиданияПоСтрокам(); 
		
		ПодключитьОбработчикОжидания("ВыполнитьЗагрузкуОборудования",1, Истина);
		
	КонецЕсли;  
	
	УстановитьТекущуюСтраницуДляШагаНаСервере(ИмяШага); 
	
	Элементы.КомандаДалееШаг3.Доступность 	= (ИмяШага <> "Шаг4"); 
	
КонецПроцедуры

&НаСервере
Функция УстановитьТекущуюСтраницуДляШагаНаСервере(ИмяШага)
	
	СоответствиеСтраницШагам = ПолучитьСоответствиеСтраницШагам();
	
	Страница = СоответствиеСтраницШагам.Получить(ИмяШага);
	Если Страница = Неопределено Тогда
		ВызватьИсключение "Ошибка!";
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Страница;
	
КонецФункции 

&НаСервере
Функция ПолучитьСоответствиеСтраницШагам() 
	
	Соответствие = новый Соответствие;
	Соответствие.Вставить("Шаг1", Элементы.СтраницаШаг1);
	Соответствие.Вставить("Шаг2", Элементы.СтраницаШаг2); 
	Соответствие.Вставить("Шаг3", Элементы.СтраницаШаг2); 
	Соответствие.Вставить("Шаг4", Элементы.СтраницаШаг2); 
	
	Возврат Соответствие;
	
	
КонецФункции
//Шаги

//Работа с макетом
&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Область.Верх = 1 И Область.Лево <= ТабличныйДокумент.ШиринаТаблицы Тогда
		
		Если ТипЗнч(Область.Расшифровка) = Тип("Структура") Тогда
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура("ТекущаяОбласть", Область);
		
		СписокВыбора = ПолучитьСписокВыборТипаДанных();
		
		Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборТипаДанных", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элемент); 
		
	КонецЕсли;  
	
	Если Область.Верх = 2 И Область.Лево <= ТабличныйДокумент.ШиринаТаблицы Тогда
		
		ОбластьПараметра = ТабличныйДокумент.Область(1, Область.Лево, 1, Область.Лево);
		Если ОбластьПараметра.Расшифровка = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить("ПоискПоЗначению",	"Поиск по значению", ,БиблиотекаКартинок.Найти);
		
		Если ОбластьПараметра.Расшифровка.Свойство("Реквизит") Тогда   
			Если  ОбластьПараметра.Расшифровка["Идентификатор"] <> "Наименование" Тогда
				СписокВыбора.Добавить("ОбновитьЗначение",	"Обновить реквизит", ,БиблиотекаКартинок.Изменить);
			КонецЕсли;
		КонецЕсли;  
		
		Если ОбластьПараметра.Расшифровка.Свойство("Параметр") Тогда
			СписокВыбора.Добавить("ОбновитьЗначение",	"Обновить параметр", ,БиблиотекаКартинок.Изменить);
			СписокВыбора.Добавить("ДобавитьЗначение",	"Добавить параметр", ,БиблиотекаКартинок.СоздатьЭлементСписка);
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура("ТекущаяОбласть", Область);
		
		Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборДействия", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВыборИзМеню(Оповещение,СписокВыбора, Элемент); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;    
	Если Элемент.ТекущаяОбласть.Верх > 1 Тогда   
		Возврат;
	КонецЕсли;   
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяОбласть", 	Элемент.ТекущаяОбласть); 
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Реквизит",	"Реквизит оборудования",,БиблиотекаКартинок.Реквизит);
	СписокВыбора.Добавить("Параметр",	"Параметр оборудования",,БиблиотекаКартинок.CW_ПараметрыГрузоперевозок);
	
	Если Расшифровка.Свойство("Параметр") Тогда
		Если ЗначениеПараметраСсылка(Расшифровка["Параметр"]["Ссылка"]) Тогда  
			СинонимПоля = Расшифровка["Параметр"]["ПолеПоиска"]["СинонимПоля"];
			ПредставлениеКоманды = "Реквизит поиска - " + СинонимПоля; 
			
			СписокВыбора.Добавить("ВыборПоляПоискаПараметр",	ПредставлениеКоманды, ,БиблиотекаКартинок.Найти); 
		КонецЕсли;
	КонецЕсли;
	
	Если Расшифровка.Свойство("Реквизит") Тогда     
		
		Если ЭтоСсылка(Расшифровка["Реквизит"]["ИмяРеквизита"]) Тогда 
			СинонимПоля = Расшифровка["Реквизит"]["ПолеПоиска"]["СинонимПоля"];
			ПредставлениеКоманды = "Реквизит поиска - " + СинонимПоля; 
			
			СписокВыбора.Добавить("ВыборПоляПоискаРеквизит",	ПредставлениеКоманды, ,БиблиотекаКартинок.Найти); 
		КонецЕсли;
	КонецЕсли;  
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборТипаДанных", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборТипаДанных(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ТабличныйДокументВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если РезультатВыбора.Значение = "Параметр" Тогда
		ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",, ЭтотОбъект,,,, ОписаниеОповещения);
	КонецЕсли; 
	
	Если РезультатВыбора.Значение = "Реквизит" Тогда 
		СписокРеквизитов = ПолучитьСписокДоступныхРеквизитовОбъекта(); 
		СписокРеквизитов.ПоказатьВыборЭлемента(ОписаниеОповещения, "Реквизиты");
	КонецЕсли;    
	
	Если РезультатВыбора.Значение = "ЗначенияПараметра" Тогда 
		
		Расшифровка = ДополнительныеПараметры.ТекущаяОбласть.Расшифровка;
		
		СписокЗначенийПараметра = Новый СписокЗначений;
		СписокЗначенийПараметра.Добавить("Значение",		"Значение"	, ,	БиблиотекаКартинок.Календарь);
		СписокЗначенийПараметра.Добавить("ЗначениеПлан",	"План"		, ,	БиблиотекаКартинок.CW_КонтрольныеДаты);
		СписокЗначенийПараметра.Добавить("ЗначениеФакт",	"Факт"		, ,	БиблиотекаКартинок.CW_КалендарьТекущаяДата);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборЗначенияПарамета", ЭтотОбъект, ДополнительныеПараметры);
		
		ТекущееЗначение 	= Расшифровка["Параметр"]["ЗначениеПоля"]["ИмяПоля"];
		НачальаноеЗначение 	= СписокЗначенийПараметра.НайтиПоЗначению(ТекущееЗначение);
		
		СписокЗначенийПараметра.ПоказатьВыборЭлемента(ОписаниеОповещения,,НачальаноеЗначение);
		
	КонецЕсли;    
	
	Если РезультатВыбора.Значение = "ВыборПоляПоискаРеквизит" Тогда 
		
		Расшифровка 		= ДополнительныеПараметры.ТекущаяОбласть.Расшифровка;
		
		СписокРеквизитов 	= ПолучитьСписокРеквизитовДоступныхДляПоиска(Расшифровка.Идентификатор);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборПоляПоискаРеквизита", ЭтотОбъект, ДополнительныеПараметры);
		
		ТекущееЗначение 	= Расшифровка["Реквизит"]["ПолеПоиска"]["ИмяПоля"];
		НачальаноеЗначение 	= СписокРеквизитов.НайтиПоЗначению(ТекущееЗначение);
		
		СписокРеквизитов.ПоказатьВыборЭлемента(ОписаниеОповещения,,НачальаноеЗначение); 
		
	КонецЕсли;  
	
	
	Если РезультатВыбора.Значение = "ВыборПоляПоискаПараметр" Тогда 
		
		Расшифровка 		= ДополнительныеПараметры.ТекущаяОбласть.Расшифровка;
		
		СписокРеквизитов 	= ПолучитьСписокРеквизитовПараметраДоступныхДляПоиска(Расшифровка.Идентификатор);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборПоляПоискаПараметра", ЭтотОбъект, ДополнительныеПараметры);
		
		ТекущееЗначение 	= Расшифровка["Параметр"]["ПолеПоиска"]["ИмяПоля"];
		НачальаноеЗначение 	= СписокРеквизитов.НайтиПоЗначению(ТекущееЗначение);
		
		СписокРеквизитов.ПоказатьВыборЭлемента(ОписаниеОповещения,,НачальаноеЗначение); 
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборДействия(РезультатВыбора, ДополнительныеПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ТабличныйДокументВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	СтруктураДействия = Новый Структура;
	СтруктураДействия.Вставить("Значение", 		РезультатВыбора.Значение); 
	СтруктураДействия.Вставить("Представление", РезультатВыбора.Представление); 
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, СтруктураДействия);
	
КонецПроцедуры


&НаКлиенте
Процедура ТабличныйДокументВыборЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	Если ТипЗнч(РезультатВыбора) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
		СтруктураРасшифровки = Новый Структура;
		ЗаполнитьДанныеПараметра(РезультатВыбора, СтруктураРасшифровки);  
	КонецЕсли; 
	
	Если ТипЗнч(РезультатВыбора) = Тип("ЭлементСпискаЗначений") Тогда  
		
		ПолеПоиска = Новый Структура("ИмяПоля,СинонимПоля", "",""); 
		
		Если ЭтоСсылка(РезультатВыбора.Значение) Тогда
			ПолеПоиска.ИмяПоля =	"Наименование";
			ПолеПоиска.СинонимПоля=	"Наименование"; 
		КонецЕсли;    
		
		ПредставлениеЯчейки = СокрЛП(РезультатВыбора.Представление); 
		
		ДанныеРасшифровки = Новый Структура;
		ДанныеРасшифровки.Вставить("ИмяРеквизита",	СокрЛП(РезультатВыбора.Значение));
		ДанныеРасшифровки.Вставить("СинонимПоля", 	СокрЛП(РезультатВыбора.Представление));
		ДанныеРасшифровки.Вставить("ПолеПоиска", 	ПолеПоиска);
		
		СтруктураРасшифровки = Новый Структура;
		СтруктураРасшифровки.Вставить("ПредставлениеЯчейки",	ПредставлениеЯчейки);
		СтруктураРасшифровки.Вставить("Идентификатор", 			СокрЛП(РезультатВыбора.Значение));
		СтруктураРасшифровки.Вставить("Реквизит", 				ДанныеРасшифровки);
		СтруктураРасшифровки.Вставить("ТипЗначения", 			Новый ОписаниеТипов("Строка"));
		
	КонецЕсли;  
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		СтруктураРасшифровки = Новый Структура;
		СтруктураРасшифровки.Вставить("ПредставлениеЯчейки",	РезультатВыбора.Представление);
		СтруктураРасшифровки.Вставить("Идентификатор", 			СокрЛП(РезультатВыбора.Значение));
	КонецЕсли;
	
	Если СтруктураРасшифровки = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если СтруктураРасшифровки.Свойство("ТипЗначения") Тогда
		ТипизироватьЗначенияКолонкиНаСервере(ДополнительныеПараметры.ТекущаяОбласть.Лево, СтруктураРасшифровки.ТипЗначения);
	КонецЕсли;
	
	УстановитьОформлениеОбласти(СтруктураРасшифровки, ДополнительныеПараметры);
	
	ТабличныйДокументВыборЗавершениеНаСервере(); 
	
КонецПроцедуры 

&НаСервере
Процедура ТипизироватьЗначенияКолонкиНаСервере(НомерКолонки, ТипЗначения)	
	
	Для Строка = 3 По ТабличныйДокумент.ВысотаТаблицы Цикл 
		Область = ТабличныйДокумент.Область(Строка, НомерКолонки, Строка, НомерКолонки);
		Если Не Область.СодержитЗначение Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Область.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Область.СодержитЗначение = Истина;
		Область.ТипЗначения = ТипЗначения;
		Область.Значение 	= Область.ТипЗначения.ПривестиЗначение(Неопределено); 
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьВыборЗначенияПарамета(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	Расшифровка = ДополнительныеПараметры.ТекущаяОбласть.Расшифровка; 
	Расшифровка.ПредставлениеЯчейки	= СокрЛП(Расшифровка["Параметр"]["СинонимПоля"])+" ("+СокрЛП(РезультатВыбора.Представление)+")";
	
	Расшифровка["Параметр"]["ЗначениеПоля"].ИмяПоля		= СокрЛП(РезультатВыбора.Значение);
	Расшифровка["Параметр"]["ЗначениеПоля"].СинонимПоля	= СокрЛП(РезультатВыбора.Представление);
	
	УстановитьОформлениеОбласти(Расшифровка, ДополнительныеПараметры);
	
	ТабличныйДокументВыборЗавершениеНаСервере();  
	
КонецПроцедуры       

&НаКлиенте
Процедура ЗавершитьВыборПоляПоискаРеквизита(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Расшифровка = ДополнительныеПараметры.ТекущаяОбласть.Расшифровка; 
	Расшифровка.ПредставлениеЯчейки	= СокрЛП(Расшифровка["Реквизит"]["СинонимПоля"])+" ("+СокрЛП(РезультатВыбора.Представление)+")";
	
	Расшифровка["Реквизит"]["ПолеПоиска"].ИмяПоля		= СокрЛП(РезультатВыбора.Значение);
	Расшифровка["Реквизит"]["ПолеПоиска"].СинонимПоля	= СокрЛП(РезультатВыбора.Представление);
	
	УстановитьОформлениеОбласти(Расшифровка, ДополнительныеПараметры);
	
	ТабличныйДокументВыборЗавершениеНаСервере();  
	
КонецПроцедуры   

&НаКлиенте
Процедура  ЗавершитьВыборПоляПоискаПараметра(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Расшифровка = ДополнительныеПараметры.ТекущаяОбласть.Расшифровка; 
	Расшифровка.ПредставлениеЯчейки	= СокрЛП(Расшифровка["Параметр"]["СинонимПоля"])+" ("+СокрЛП(РезультатВыбора.Представление)+")";
	
	Расшифровка["Параметр"]["ПолеПоиска"].ИмяПоля		= СокрЛП(РезультатВыбора.Значение);
	Расшифровка["Параметр"]["ПолеПоиска"].СинонимПоля	= СокрЛП(РезультатВыбора.Представление);
	
	УстановитьОформлениеОбласти(Расшифровка, ДополнительныеПараметры);
	
	ТабличныйДокументВыборЗавершениеНаСервере();  
	
КонецПроцедуры  



&НаСервере
Процедура ТабличныйДокументВыборЗавершениеНаСервере()
	
	Обработки.CW_ЗагрузкаОборудованияИзФайлаExcel.РассчитатьШиринуКолонокТабличногоДокумента(ТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеОбласти(Знач Расшифровка, Знач ДополнительныеПараметры)
	
	ТекстНезаполненногоЗаголовка = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.ТекстЗаголовкаНесопоставленнойКолонки();
	Для НомерКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		Область = ТабличныйДокумент.Область(1, НомерКолонки);
		Если Область.ПараметрРасшифровки 	= Расшифровка.Идентификатор Тогда
			Область.Текст 					= ТекстНезаполненногоЗаголовка;
			Область.ПараметрРасшифровки 	= "";
			Область.Расшифровка 			= Неопределено;
			Область.ЦветТекста 				= ОбщегоНазначенияКлиентПовтИсп.ЦветСтиля("НезаполненныйРеквизит");
		КонецЕсли;  
	КонецЦикла; 
	
	ДополнительныеПараметры.ТекущаяОбласть.Текст      			= Расшифровка.ПредставлениеЯчейки;
	ДополнительныеПараметры.ТекущаяОбласть.ЦветТекста 			= ОбщегоНазначенияКлиентПовтИсп.ЦветСтиля("ЦветГиперссылки");
	ДополнительныеПараметры.ТекущаяОбласть.ПараметрРасшифровки 	= Расшифровка.Идентификатор;
	ДополнительныеПараметры.ТекущаяОбласть.Расшифровка 			= Расшифровка;
	
КонецПроцедуры  

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	Верх = ТабличныйДокумент.ТекущаяОбласть.Верх;
	Низ  = ТабличныйДокумент.ТекущаяОбласть.Низ;
	Лево = ТабличныйДокумент.ТекущаяОбласть.Лево;
	
	Если (Верх = 1 или Верх = 2) И (Низ = 1 или Низ = 2) Тогда
		Возврат; // выделена первая строка (строка заголовка)
	КонецЕсли;
	
	УдалитьСтрокиНаСервере(Верх, Низ);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево);
	
КонецПроцедуры  

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	Верх = ТабличныйДокумент.ТекущаяОбласть.Верх;
	Низ  = ТабличныйДокумент.ТекущаяОбласть.Низ;
	Лево = ТабличныйДокумент.ТекущаяОбласть.Лево;
	
	Если (Верх = 1 или Верх = 2) И (Низ = 1 или Низ = 2) Тогда
		Возврат; // выделена первая строка (строка заголовка)
	КонецЕсли;
	
	ДобавитьСтрокиНаСервере(Верх, Низ);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево); 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКолонку(Команда)
	
	Если ТабличныйДокумент.ШиринаТаблицы = 1 Тогда
		Возврат; // выделена первая строка (строка заголовка)
	КонецЕсли;
	
	Лево  = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Право = ТабличныйДокумент.ТекущаяОбласть.Право;
	Верх  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	
	УдалитьКолонкиНаСервере(Лево, Право);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево);
	
КонецПроцедуры  

&НаСервере
Процедура УдалитьСтрокиНаСервере(Верх, Низ)
	
	Если Верх = 1 Тогда
		Верх = 2; // чтобы не удалить заголовки колонок
	КонецЕсли;
	
	Область = ТабличныйДокумент.Область(Верх,, Низ);
	ТабличныйДокумент.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоВертикали);
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьСтрокиНаСервере(Верх, Низ)
	
	Область = ТабличныйДокумент.Область(Верх,, Низ);
	ТабличныйДокумент.ВставитьОбласть(Область,Область, ТипСмещенияТабличногоДокумента.ПоВертикали);
	
	Для Строка = Верх По Низ Цикл
		Для Колонка = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
			ОбластьНиз = ТабличныйДокумент.Область(Низ+1, Колонка, Низ+1, Колонка);
			
			Ячейка = ТабличныйДокумент.Область(Строка, Колонка, Строка, Колонка);    
			Ячейка.СодержитЗначение = Истина;
			Ячейка.ТипЗначения 		= ОбластьНиз.ТипЗначения;
			Ячейка.Значение 		= ОбластьНиз.ТипЗначения.ПривестиЗначение(Неопределено);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьКолонку(Команда)
	Лево  = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Право = ТабличныйДокумент.ТекущаяОбласть.Право;
	Верх  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	
	ДобавитьКолонкиНаСервере(Лево, Право);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево);
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкиНаСервере(Лево, Право)
	
	Область = ТабличныйДокумент.Область(, Лево,, Право);
	ТабличныйДокумент.ВставитьОбласть(Область, Область , ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
	ТекстНезаполненногоЗаголовка = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.ТекстЗаголовкаНесопоставленнойКолонки();
	
	Для Колонка = Лево По Право Цикл
		Для Строка = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл 
			Область = ТабличныйДокумент.Область(Строка, Колонка, Строка, Колонка);    
			Если Строка = 1 или Строка = 2 Тогда
				Область.Текст 				= ТекстНезаполненногоЗаголовка;
				Область.ПараметрРасшифровки = "";
				Область.ЦветТекста 			= ЦветаСтиля.НезаполненныйРеквизит;
			Иначе      
				Область.СодержитЗначение = Истина;
				Область.ТипЗначения = Новый ОписаниеТипов("Строка");
				Область.Значение 	= Область.ТипЗначения.ПривестиЗначение(Неопределено);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКолонкиНаСервере(Лево, Право)
	
	Область = ТабличныйДокумент.Область(, Лево,, Право);
	ТабличныйДокумент.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
КонецПроцедуры   

&НаКлиенте
Процедура УстановитьГраницы(Команда)
	
	Лево  = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Право = ТабличныйДокумент.ТекущаяОбласть.Право;
	Верх  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	Низ  = ТабличныйДокумент.ТекущаяОбласть.Низ;
	
	УстановитьГраницыНаСервере(Право, Лево, Верх, Низ);
	
КонецПроцедуры  

&НаКлиенте
Процедура СнятьЗащитуЯчеек(Команда)
	
	Лево  = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Право = ТабличныйДокумент.ТекущаяОбласть.Право;
	Верх  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	Низ  = ТабличныйДокумент.ТекущаяОбласть.Низ;
	
	СнятьЗащитуЯчеекНаСервере(Право, Лево, Верх, Низ);  
	УстановитьГраницыНаСервере(Право, Лево, Верх, Низ);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьГраницыНаСервере(Право, Лево, Верх, Низ)
	
	Линия	 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	
	Для НомерСтроки = Верх По Низ Цикл
		Для НомерКолонки = Лево По Право Цикл
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Ячейка.Обвести(Линия, Линия, Линия, Линия);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура СнятьЗащитуЯчеекНаСервере(Право, Лево, Верх, Низ) 
	
	Для НомерСтроки = Верх По Низ Цикл
		Если НомерСтроки < 3 Тогда
			Продолжить;
		КонецЕсли; 
		
		Для НомерКолонки = Лево По Право Цикл
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Ячейка.Защита 	= Ложь;
			Ячейка.ЦветФона = ЦветаСтиля.ПравоРедактированияФон
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьСтрокиТабличногоДокумента()
	
	Для Каждого СтрокаТаблицы из ТаблицаСоответствий Цикл 
		Если СтрокаТаблицы.ФлагПодобрано Тогда
			Продолжить;
		КонецЕсли;
		Область = ТабличныйДокумент.Область(СтрокаТаблицы.СтрокаМакета, , СтрокаТаблицы.СтрокаМакета);
		Область.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;	
	КонецЦикла;
	
КонецПроцедуры
//Работа с макетом

//Работа с настройрками
&НаКлиенте
Процедура СохранитьНастройку(Команда)  
	
	СоответствиеНастроек = ПолучитьНастроенныйЗаголовокНаСервере();
	
	ПараметрыФормыВариантов = новый Структура;
	ПараметрыФормыВариантов.Вставить("РежимФормы", 				0);
	ПараметрыФормыВариантов.Вставить("Настройки", 				СоответствиеНастроек);
	
	ОткрытьФорму("Обработка.CW_ЗагрузкаОборудованияИзФайлаExcel.Форма.ФормаВариантовНастроек", ПараметрыФормыВариантов,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастроенныйЗаголовокНаСервере()
	
	СоответствиеНастроек = новый Соответствие;
	
	Для Лево = 1 по ТабличныйДокумент.ШиринаТаблицы Цикл
		
		Область 		= ТабличныйДокумент.Область(1, Лево);
		ОбластьДействия = ТабличныйДокумент.Область(2, Лево);
		
		СтруктураНастроек = Новый Структура;
		
		ДанныеЯчейки = Новый Структура;
		ДанныеЯчейки.Вставить("Текст", 					Область.Текст);
		ДанныеЯчейки.Вставить("ПараметрРасшифровки", 	Область.ПараметрРасшифровки); 
		ДанныеЯчейки.Вставить("Расшифровка", 			Область.Расшифровка); 
		ДанныеЯчейки.Вставить("ЦветТекста", 			Область.ЦветТекста); 
		
		СтруктураНастроек.Вставить("Заголовок", ДанныеЯчейки);
		
		ДанныеЯчейки = Новый Структура;
		ДанныеЯчейки.Вставить("Текст", 					ОбластьДействия.Текст);
		ДанныеЯчейки.Вставить("ПараметрРасшифровки", 	ОбластьДействия.ПараметрРасшифровки); 
		ДанныеЯчейки.Вставить("Расшифровка", 			ОбластьДействия.Расшифровка); 
		ДанныеЯчейки.Вставить("ЦветТекста", 			ОбластьДействия.ЦветТекста); 
		
		СтруктураНастроек.Вставить("Действия", ДанныеЯчейки);
		
		СоответствиеНастроек.Вставить(Лево, СтруктураНастроек);
	КонецЦикла;  
	
	Возврат СоответствиеНастроек;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьНастройку(Команда)       
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборНастроек", ЭтотОбъект);
	
	ПараметрыФормыВариантов = новый Структура;
	ПараметрыФормыВариантов.Вставить("РежимФормы", 1);
	
	ОткрытьФорму("Обработка.CW_ЗагрузкаОборудованияИзФайлаExcel.Форма.ФормаВариантовНастроек", ПараметрыФормыВариантов,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&наКлиенте
Процедура ЗавершитьВыборНастроек(ВыбраннаяНастройка, ДополнительныеПараметры) Экспорт   
	
	Если ВыбраннаяНастройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьВыборНастроекНаСервере(ВыбраннаяНастройка);	
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьВыборНастроекНаСервере(ВыбраннаяНастройка)    
	
	УстановитьЗаголовокФормыНаСервере(ВыбраннаяНастройка["ИмяНастройки"]);
	
	СоответствиеНастроек = ВыбраннаяНастройка["Настройка"];
	Если ТипЗнч(СоответствиеНастроек) <> тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;  
	
	Для Лево = 1 по ТабличныйДокумент.ШиринаТаблицы Цикл   
		
		СтруктураНастроек = СоответствиеНастроек.Получить(Лево);
		Если СтруктураНастроек = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеЗаголовка = СтруктураНастроек.Заголовок;
		
		Область	 = ТабличныйДокумент.Область(1, Лево);
		Область.Текст 				= ДанныеЗаголовка.Текст;
		Область.ПараметрРасшифровки = ДанныеЗаголовка.ПараметрРасшифровки;
		Область.Расшифровка 		= ДанныеЗаголовка.Расшифровка;
		Область.ЦветТекста 			= ДанныеЗаголовка.ЦветТекста;  
		
		ДанныеДействия   = СтруктураНастроек.Действия; 
		
		ОбластьДействия = ТабличныйДокумент.Область(2, Лево);
		ОбластьДействия.Текст 				= ДанныеДействия.Текст;
		ОбластьДействия.ПараметрРасшифровки = ДанныеДействия.ПараметрРасшифровки;
		ОбластьДействия.Расшифровка 		= ДанныеДействия.Расшифровка;
		ОбластьДействия.ЦветТекста 			= ДанныеДействия.ЦветТекста;  
		
	КонецЦикла; 
	
	Обработки.CW_ЗагрузкаОборудованияИзФайлаExcel.РассчитатьШиринуКолонокТабличногоДокумента(ТабличныйДокумент);
	
КонецПроцедуры
//Работа с настройрками

//Чтиение файла
&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьПомещениеФайлаНаНаСервер", ЭтотОбъект);
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файл";
	ПараметрыДиалога.Фильтр    = "Файл Excel|*.xls;*.xlsx";
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , ,, ПараметрыДиалога, Новый УникальныйИдентификатор);
	
КонецПроцедуры           

&НаКлиенте
Процедура ЗавершитьПомещениеФайлаНаНаСервер(ОписаниеПомещенногоФайла,ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено 
		Или ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	Конецесли;    
	
	Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаОжидание;
	
	РезультатВыполнения =  ОбработатьЗагрузкуФайлаНаСервереВФоне(ОписаниеПомещенногоФайла.Адрес, ОписаниеПомещенногоФайла.СсылкаНаФайл.Расширение);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗагрузкиФайла", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьЗагрузкуФайлаНаСервереВФоне(Адрес, РасширениеФайла)  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Чтение файла Excel в табличный документ";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ДвоичныеДанные 			= ПолучитьИзВременногоХранилища(Адрес);
	ХранилищеДанныхФайла 	= Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("ХранилищеДанныхФайла", 	ХранилищеДанныхФайла);
	ПараметрыЗагрузки.Вставить("РасширениеФайла", 		РасширениеФайла);
	ПараметрыЗагрузки.Вставить("ИмяМакетаЗаголовка", 	"МакетЗаголовка");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ЗагрузкаОборудованияИзФайлаExcel.ЗагрузитьФайлВТабличныйДокумент", ПараметрыЗагрузки, ПараметрыВыполнения);
	
КонецФункции  

&НаКлиенте
Процедура ОбработатьРезультатЗагрузкиФайла(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ТабличныйДокумент = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаРезультат; 
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаНачало;
		
		ТекстПредупреждения = "Не удалось прочитать файл!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка чтения файла");
	КонецЕсли;
	
КонецПроцедуры
//Чтиение файла 

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеПараметра(Параметр, СтруктураРасшифровки) 
	
	ПолеПоиска = Новый Структура("ИмяПоля,СинонимПоля", "",""); 
	
	ПустаяСсылка = Параметр.ТипЗначения.ПривестиЗначение(Неопределено);
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустаяСсылка)) Тогда
		ПолеПоиска.ИмяПоля 		= 	"Наименование";
		ПолеПоиска.СинонимПоля	=	"Наименование"; 
	КонецЕсли;    
	
	ЗначениеПараметра = Новый Структура;
	ЗначениеПараметра.Вставить("ИмяПоля", 		"Значение");
	ЗначениеПараметра.Вставить("СинонимПоля", 	"Значение");
	
	ДанныеРасшифровки = Новый Структура;
	ДанныеРасшифровки.Вставить("Ссылка", 		Параметр);
	ДанныеРасшифровки.Вставить("СинонимПоля", 	СокрЛП(Параметр.Наименование));
	ДанныеРасшифровки.Вставить("ЗначениеПоля", 	ЗначениеПараметра);
	ДанныеРасшифровки.Вставить("ПолеПоиска", 	ПолеПоиска);
	
	СтруктураРасшифровки = Новый Структура;
	СтруктураРасшифровки.Вставить("ПредставлениеЯчейки",	СокрЛП(Параметр.Наименование));
	СтруктураРасшифровки.Вставить("Идентификатор", 			XMLСтрока(Параметр));
	СтруктураРасшифровки.Вставить("Параметр", 				ДанныеРасшифровки);
	СтруктураРасшифровки.Вставить("ТипЗначения", 			Параметр.ТипЗначения);
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьСписокРеквизитовДоступныхДляПоиска(ИмяРеквизита)
	
	РеквизитыПоиска = новый СписокЗначений;
	
	Реквизит = Метаданные.Справочники.CW_Грузоперевозки.Реквизиты.Найти(ИмяРеквизита);
	Если Реквизит = Неопределено Тогда
		Возврат РеквизитыПоиска;
	КонецЕсли;
	
	ПустоеЗначение = Реквизит.Тип.ПривестиЗначение(Неопределено);
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) Тогда
		
		МетаданныеРеквизита = ПустоеЗначение.Метаданные();
		
		Если МетаданныеРеквизита.ДлинаКода <> 0 Тогда  
			
			Реквизит = МетаданныеРеквизита.СтандартныеРеквизиты["Код"];
			Синоним  = Реквизит.Синоним;
			Если ПустаяСтрока(Синоним) Тогда
				Синоним = "Код";  
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Синоним); 
		КонецЕсли;
		
		Если МетаданныеРеквизита.ДлинаНаименования <> 0 Тогда
			Реквизит = МетаданныеРеквизита.СтандартныеРеквизиты["Наименование"];
			Синоним  = Реквизит.Синоним;
			Если ПустаяСтрока(Синоним) Тогда
				Синоним = "Наименование";  
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Синоним); 
		КонецЕсли;
		
		Для Каждого Реквизит из МетаданныеРеквизита.Реквизиты Цикл   
			Если Реквизит.Тип = Новый ОписаниеТипов("ХранилищеЗначения") Тогда
				Продолжить;
			Конецесли; 
			Если СтрНачинаетсяС(ВРег(Реквизит.Имя), "УДАЛИТЬ") Тогда
				Продолжить;
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Реквизит.Синоним); 
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РеквизитыПоиска; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокРеквизитовПараметраДоступныхДляПоиска(ИдентифкаторПараметра)
	
	РеквизитыПоиска = новый СписокЗначений;
	
	ПараметрГрузоперевозки = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентифкаторПараметра));
	
	ПустоеЗначение = ПараметрГрузоперевозки.ТипЗначения.ПривестиЗначение(Неопределено);
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) Тогда
		
		МетаданныеРеквизита = ПустоеЗначение.Метаданные();
		
		Если МетаданныеРеквизита.ДлинаКода <> 0 Тогда  
			
			Реквизит = МетаданныеРеквизита.СтандартныеРеквизиты["Код"];
			Синоним  = Реквизит.Синоним;
			Если ПустаяСтрока(Синоним) Тогда
				Синоним = "Код";  
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Синоним); 
		КонецЕсли;
		
		Если МетаданныеРеквизита.ДлинаНаименования <> 0 Тогда
			Реквизит = МетаданныеРеквизита.СтандартныеРеквизиты["Наименование"];
			Синоним  = Реквизит.Синоним;
			Если ПустаяСтрока(Синоним) Тогда
				Синоним = "Наименование";  
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Синоним); 
		КонецЕсли;
		
		Для Каждого Реквизит из МетаданныеРеквизита.Реквизиты Цикл   
			Если Реквизит.Тип = Новый ОписаниеТипов("ХранилищеЗначения") Тогда
				Продолжить;
			Конецесли; 
			Если СтрНачинаетсяС(ВРег(Реквизит.Имя), "УДАЛИТЬ") Тогда
				Продолжить;
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Реквизит.Синоним); 
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РеквизитыПоиска; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоСсылка(ИмяРеквизита)
	
	Реквизит = Метаданные.Справочники.CW_Грузоперевозки.Реквизиты.Найти(ИмяРеквизита);
	Если Реквизит = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПустаяСсылка = Реквизит.Тип.ПривестиЗначение(Неопределено);
	Возврат ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустаяСсылка));
	
КонецФункции 

&НаСервереБезКонтекста
Функция ЗначениеПараметраСсылка(Параметр)
	
	ПустаяСсылка = Параметр.ТипЗначения.ПривестиЗначение(Неопределено);
	Возврат ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустаяСсылка));
	
КонецФункции


//Таблица соответстий  
&НаКлиенте
Процедура РежимПоказатьПриИзменении(Элемент)
	
	ВключитьОтбор = (РежимПоказать = "НеПодобранные");
	УстановитьОтборСтрок(ВключитьОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрок(Включен)
	
	ОтборСтрок = Неопределено;
	Если Включен Тогда
		ОтборСтрок = новый ФиксированнаяСтруктура(Новый Структура("ФлагПодобрано", Ложь));
	КонецЕсли;
	
	Элементы.ТаблицаСоответствий.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСоответствий(Успешно) 
	
	СоответствиеИменКолонок = Новый Соответствие;    
	ТаблицаЗначений 		= Новый ТаблицаЗначений;  
	ТаблицаЗначений.Колонки.Добавить("СтрокаМакета", Новый ОписаниеТипов("Число"));
	
	//Соответствие колонок
	ЗаполнитьОписаниеКолонок(СоответствиеИменКолонок, ТаблицаЗначений);
	//Соответствие колонок
	
	Если ОписаниеКолонок.Количество() = 0 Тогда 
		Успешно = Ложь;
		Возврат;
	КонецЕсли;
	
	//Заполнение промежуточной таблицы
	ЗаполнитьТабицуДанных(СоответствиеИменКолонок, ТаблицаЗначений);
	//Заполнение промежуточной таблицы
	
	//Реквизиты формы
	ОбработатьРеквизитыФормы(ТаблицаЗначений);
	//Реквизиты формы
	
	//Удаление элементов формы
	УдалитьНенужныеЭлементыФормы();
	//Удаление элементов формы
	
	//Добавлениеэлементов на фомру
	ДобавитьЭлементыФормы(ТаблицаЗначений);
	//Добавлениеэлементов на фомру
	
	//Поиск грузоперевозок  
	ПодобратьГрузоперевозки(ТаблицаЗначений);
	//Поиск грузоперевозок  
	
	ТаблицаСоответствий.Загрузить(ТаблицаЗначений);
	
	УстановитьФлагПодобрано(); 
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьГрузоперевозки(ТаблицаЗначений)
	
	СоответствиеКолонок = Новый Соответствие;
	Для Каждого КлючЗначение из ОписаниеКолонок Цикл  
		
		ОписаниеКолонки = КлючЗначение.Значение;
		
		Действие = ОписаниеКолонки["Действие"];  
		Если Действие <> "ПоискПоЗначению" Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКолонки			= ОписаниеКолонки["ИмяКолонки"]; 
		ИмяПоляКомпоновки	= ОписаниеКолонки["ИмяПоляКомпоновки"]; 
		
		Если ИмяКолонки <> "Наименование" Тогда 
			ПолеЗначения = ОписаниеКолонки["ПолеЗначения"];   
			Если ПолеЗначения <> Неопределено Тогда 
				ИмяКолонки 			= ПолеЗначения["ИмяКолонки"];	
				ИмяПоляКомпоновки	= ПолеЗначения["ИмяПоляКомпоновки"]; 
			КонецЕсли;                             
		КонецЕсли;
		
		СоответствиеКолонок.Вставить(ИмяКолонки, ИмяПоляКомпоновки);
		
	КонецЦикла;  
	
	Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл 
		
		ОтборКомпоновкиДанных = Новый ОтборКомпоновкиДанных;
		
		Для Каждого КлючЗначение из СоответствиеКолонок Цикл
			ЗначениеКолонки = СтрокаТаблицы[КлючЗначение.Ключ];
			Если Не ЗначениеЗаполнено(ЗначениеКолонки) тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементОтбора = ОтборКомпоновкиДанных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(КлючЗначение.Значение); 
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементОтбора.ПравоеЗначение 	= ЗначениеКолонки; 
			ЭлементОтбора.Использование 	= Истина; 
			
		КонецЦикла;
		
		СтрокаТаблицы.СсылкаНаименование = ПолучитьГрузоперевозкуПоОтбору(ОтборКомпоновкиДанных);
		
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьГрузоперевозкуПоОтбору(ОтборКомпоновкиДанных)
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	СхемаКомпоновкиДанных = ТОбъект.ПолучитьМакет("МакетОтбора");
	
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	_УФС.СкопироватьОтбор(ОтборКомпоновкиДанных, Настройки.Отбор);
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	Результат = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Если Результат.Количество() = 0 или Результат.Количество() > 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаТаблицы = Результат[0];
	Возврат СтрокаТаблицы.Ссылка;
	
КонецФункции


&НаСервере
Процедура ДобавитьЭлементыФормы(Знач ТаблицаЗначений)
	
	ТаблицаФормы = Элементы.ТаблицаСоответствий;    
	
	СоответствиеКартинокДействию = Новый Соответствие;
	СоответствиеКартинокДействию.Вставить("ПоискПоЗначению", БиблиотекаКартинок.Найти);	  
	СоответствиеКартинокДействию.Вставить("ОбновитьЗначение", БиблиотекаКартинок.Изменить);	  
	СоответствиеКартинокДействию.Вставить("ДобавитьЗначение", БиблиотекаКартинок.СоздатьЭлементСписка);	  
	
	Для Каждого КлючЗначение из ОписаниеКолонок Цикл
		
		ОписаниеКолнки = КлючЗначение.Значение;
		
		ДанныеГруппы  = ОписаниеКолнки["Группа"];  
		
		ГруппаТаблицы = Элементы.Найти(ДанныеГруппы["Имя"]);
		Если ГруппаТаблицы = Неопределено Тогда
			ГруппаТаблицы = ДобавитьГруппуТаблицы(ДанныеГруппы["Имя"], 
			ДанныеГруппы["Заголовок"],
			Истина, 
			Новый Картинка, 
			ТаблицаФормы);
			
			ГруппаТаблицы.РастягиватьПоГоризонтали = ложь;
			ГруппаТаблицы.РастягиватьПоВертикали   = Ложь;   
			
		КонецЕсли;	 
		
		ЕстьПолеЗначения = (ОписаниеКолнки["ПолеЗначения"] <> Неопределено);
		
		ЦветФонаЯчейки 	= ?(ЕстьПолеЗначения,Новый Цвет,ЦветаСтиля.ПравоРедактированияФон);
		ТолькоПросмотр = ЕстьПолеЗначения;
		
		КартинкаШапки = СоответствиеКартинокДействию.Получить(ОписаниеКолнки["Действие"]);
		КартинкаШапки = ?(КартинкаШапки = Неопределено, Новый Картинка, КартинкаШапки);
		
		//Добавляем элемент формы
		НовыйЭлемент = Элементы.Добавить("ТаблицаСоответствий"+ОписаниеКолнки["ИмяКолонки"], Тип("ПолеФормы"), ГруппаТаблицы); 
		Если Не ЕстьПолеЗначения Тогда
			НовыйЭлемент.Заголовок = "Значение";	
		КонецЕсли;
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "ТаблицаСоответствий." + ОписаниеКолнки["ИмяКолонки"]; 
		НовыйЭлемент.ОтображатьВШапке 		   	= Истина;
		НовыйЭлемент.ЦветФона 		   			= ЦветФонаЯчейки;
		НовыйЭлемент.КартинкаШапки  			= КартинкаШапки; 
		НовыйЭлемент.ТолькоПросмотр 			= ЕстьПолеЗначения; 
		НовыйЭлемент.РастягиватьПоГоризонтали 	= ложь;
		НовыйЭлемент.РастягиватьПоВертикали   	= Ложь;
		НовыйЭлемент.АвтоМаксимальнаяШирина		= Истина;
		
		Ширина = ПолучитьШиринуКолнки(ТаблицаЗначений, ОписаниеКолнки["ИмяКолонки"]);
		НовыйЭлемент.Ширина = Макс(Ширина, СтрДлина(ОписаниеКолнки["Заголовок"])+4);
		//Добавляем элемент формы  
		
		Если ЕстьПолеЗначения Тогда
			
			ПолеЗначения =	ОписаниеКолнки["ПолеЗначения"];
			
			//Добавляем элемент формы
			НовыйЭлемент = Элементы.Добавить("ТаблицаСоответствий"+ПолеЗначения["ИмяКолонки"], Тип("ПолеФормы"), ГруппаТаблицы);       
			НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 				= "ТаблицаСоответствий." + ПолеЗначения["ИмяКолонки"]; 
			НовыйЭлемент.ОтображатьВШапке 		   	= Истина;
			НовыйЭлемент.ЦветФона 		   			= ЦветаСтиля.ПравоРедактированияФон;
			НовыйЭлемент.КартинкаШапки  			= КартинкаШапки; 
			НовыйЭлемент.ТолькоПросмотр 			= Ложь; 
			НовыйЭлемент.РастягиватьПоГоризонтали 	= ложь;
			НовыйЭлемент.РастягиватьПоВертикали   	= Ложь; 
			НовыйЭлемент.АвтоМаксимальнаяШирина		= Истина;
			
			Ширина = ПолучитьШиринуКолнки(ТаблицаЗначений, ПолеЗначения["ИмяКолонки"]);
			НовыйЭлемент.Ширина = Макс(Ширина, СтрДлина(ПолеЗначения["Заголовок"])+4);
			//Добавляем элемент формы 		
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры          

&НаСервере
Функция ПолучитьШиринуКолнки(ТаблицаЗначений, КолонкаИмя)
	
	ШиринаПоля = 0;
	Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл
		ДлинаЗначнеия = СтрДлина(СокрЛП(СтрокаТаблицы[КолонкаИмя]));
		ШиринаПоля = Макс(ШиринаПоля, ДлинаЗначнеия);
		Если ШиринаПоля > 20 Тогда
			ШиринаПоля = 0;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ШиринаПоля;
	
КонецФункции

&НаСервере
Функция ДобавитьГруппуТаблицы(ИмяГруппы, ЗаголовокГруппы, ОтображатьВШапке, КартинкаШапки, РодительскийЭлемент)
	
	ГруппаПоиск = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаПоиск.Заголовок 			= ЗаголовокГруппы;  
	ГруппаПоиск.ОтображатьВШапке 	= ОтображатьВШапке;
	ГруппаПоиск.КартинкаШапки 		= КартинкаШапки;
	
	ГруппаПоиск.Вид			 		= ВидГруппыФормы.ГруппаКолонок; 
	ГруппаПоиск.Группировка 		= ГруппировкаКолонок.Горизонтальная;
	
	Возврат ГруппаПоиск;
	
КонецФункции

&НаСервере
Процедура УдалитьНенужныеЭлементыФормы()
	
	мЭлементы = Новый Массив;
	Для Каждого Элемент из Элементы.ТаблицаСоответствий.ПодчиненныеЭлементы Цикл  
		Если Элемент.Имя = "ТаблицаСоответствийИндексКартинки" Тогда
			Продолжить;
		Конецесли;
		мЭлементы.Добавить(Элемент);
	КонецЦикла;  
	
	Для Каждого Элемент из мЭлементы Цикл  
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписаниеКолонок(СоответствиеИменКолонок, ТаблицаЗначений)
	
	МетаданныеОбъекта = ПолучитьМетаданныеОбъекта();
	
	ДанныеКолонок = Новый Соответствие;
	
	ОписаниеПоляНаименование = ОписаниеПоляНаименование();
	
	Для Лево = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ОбластьДанные = ТабличныйДокумент.Область(1, Лево);
		Если ОбластьДанные.Расшифровка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОбластьДействие = ТабличныйДокумент.Область(2, Лево); 
		
		Расшифровка = ОбластьДанные.Расшифровка;
		
		Если Расшифровка.Свойство("Реквизит") Тогда       
			
			ИмяПоля		= Расшифровка["Идентификатор"];
			СинонимПоля	= Расшифровка["Реквизит"]["СинонимПоля"]; 
			
			СоответствиеИменКолонок.Вставить(Лево, ИмяПоля); 
			
			Реквизит = МетаданныеОбъекта.Реквизиты.Найти(ИмяПоля);
			Если Реквизит = Неопределено Тогда
				Реквизит = МетаданныеОбъекта.СтандартныеРеквизиты[ИмяПоля];
			КонецЕсли; 
			
			ПустоеЗначение = Реквизит.Тип.ПривестиЗначение(Неопределено);
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) Тогда   
				ОписаниеТипа = Новый ОписаниеТипов("Строка");  
			Иначе
				ОписаниеТипа = Реквизит.Тип;
			КонецЕсли;
			
			ТаблицаЗначений.Колонки.Добавить(ИмяПоля, ОписаниеТипа, СинонимПоля); 
			
			ОтборПоЗначению = (ОбластьДействие.ПараметрРасшифровки = "ПоискПоЗначению"); 
			ИмяПоляПоиска 	= Расшифровка["Реквизит"]["ПолеПоиска"]["ИмяПоля"];
			
			ИмяГруппы 			= "Группа"+ИмяПоля;   
			ЗаголовокГруппы 	= СинонимПоля;  
			
			Если ИмяПоля = "Наименование" Тогда 
				ИмяГруппы 			= ОписаниеПоляНаименование.ИмяГруппы;
				ЗаголовокГруппы 	= ОписаниеПоляНаименование.ЗаголовокГруппы;
			КонецЕсли;
			
			ДанныеГруппы = Новый Структура;
			ДанныеГруппы.Вставить("Имя", 				ИмяГруппы);
			ДанныеГруппы.Вставить("Заголовок", 			ЗаголовокГруппы);
			ДанныеГруппы.Вставить("ОтображатьВШапке",	Истина);
			
			ОписаниеКолонки = Новый Структура; 
			ОписаниеКолонки.Вставить("ИмяКолонки", 			ИмяПоля); 
			ОписаниеКолонки.Вставить("Заголовок", 			СинонимПоля); 
			ОписаниеКолонки.Вставить("ТипЗначения", 		ОписаниеТипа); 
			ОписаниеКолонки.Вставить("Действие", 			ОбластьДействие.ПараметрРасшифровки); 
			ОписаниеКолонки.Вставить("ТипДанных", 			"Реквизит");   
			ОписаниеКолонки.Вставить("Группа", 				ДанныеГруппы); 
			ОписаниеКолонки.Вставить("ПоискПоПолю", 		ИмяПоляПоиска);
			ОписаниеКолонки.Вставить("ИмяПоляКомпоновки", 	ИмяПоля);
			
			ПолеЗначения = Неопределено;
			
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) 
				или ИмяПоля = "Наименование" Тогда 
				
				ОписаниеТипаСсылка = Реквизит.Тип;
				Если ИмяПоля = "Наименование" тогда  
					ОписаниеТипаСсылка 	= ОписаниеПоляНаименование.ОписаниеТипа;
				КонецЕсли;
				
				ТаблицаЗначений.Колонки.Добавить("Ссылка"+ИмяПоля, ОписаниеТипаСсылка, "Ссылка"); 
				
				ПолеЗначения = Новый Структура; 
				ПолеЗначения.Вставить("ИмяКолонки",			"Ссылка"+ИмяПоля); 
				ПолеЗначения.Вставить("Заголовок", 			"Ссылка"); 
				ПолеЗначения.Вставить("ТипЗначения", 		ОписаниеТипаСсылка); 
				ПолеЗначения.Вставить("ИмяПоляКомпоновки", 	ИмяПоля);
			КонецЕсли;
			
			ОписаниеКолонки.Вставить("ПолеЗначения", ПолеЗначения); 
			
			ДанныеКолонок.Вставить(Расшифровка["Идентификатор"], ОписаниеКолонки); 
			
		КонецЕсли;
		
		Если Расшифровка.Свойство("Параметр") Тогда      
			
			ИмяПоля 		= СтрЗаменить(Расшифровка["Идентификатор"],"-", "_");
			СинонимПоля	 	= Расшифровка["Параметр"]["СинонимПоля"]; 
			ИмяРеквизита 	= Расшифровка["Параметр"]["ЗначениеПоля"]["ИмяПоля"]; 
			ИмяПоляПоиска 	= Расшифровка["Параметр"]["ПолеПоиска"]["ИмяПоля"];
			
			Параметр 		= XMLЗначение(Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок"), Расшифровка["Идентификатор"]);
			ПустоеЗначение 	= Параметр.ТипЗначения.ПривестиЗначение(Неопределено); 
			
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) Тогда   
				ОписаниеТипа = Новый ОписаниеТипов("Строка");  
			Иначе
				ОписаниеТипа = Параметр.ТипЗначения;
			КонецЕсли; 
			
			ТаблицаЗначений.Колонки.Добавить("Параметр_"+ИмяПоля, ОписаниеТипа, СинонимПоля); 
			
			ДанныеГруппы = Новый Структура;
			ДанныеГруппы.Вставить("Имя", 				"ГруппаПараметр_"+ИмяПоля);
			ДанныеГруппы.Вставить("Заголовок", 			СинонимПоля);
			ДанныеГруппы.Вставить("ОтображатьВШапке",	Истина);
			
			ОписаниеКолонки = Новый Структура; 
			ОписаниеКолонки.Вставить("ИмяКолонки", 			"Параметр_"+ИмяПоля); 
			ОписаниеКолонки.Вставить("Заголовок", 			СинонимПоля); 
			ОписаниеКолонки.Вставить("ТипЗначения", 		ОписаниеТипа); 
			ОписаниеКолонки.Вставить("Действие", 			ОбластьДействие.ПараметрРасшифровки); 
			ОписаниеКолонки.Вставить("ТипДанных", 			"Параметр");   
			ОписаниеКолонки.Вставить("Группа", 				ДанныеГруппы); 
			ОписаниеКолонки.Вставить("ИмяРеквизита", 		ИмяРеквизита);
			ОписаниеКолонки.Вставить("ПоискПоПолю", 		ИмяПоляПоиска);
			ОписаниеКолонки.Вставить("ИмяПоляКомпоновки", 	"Ссылка.["+Параметр.Идентификатор+"]"); 
			
			ПолеЗначения = Неопределено;
			
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) Тогда 
				
				ТаблицаЗначений.Колонки.Добавить("СсылкаПараметр_"+ИмяПоля, Параметр.ТипЗначения, "Ссылка"); 
				
				ПолеЗначения = Новый Структура; 
				ПолеЗначения.Вставить("ИмяКолонки", 		"СсылкаПараметр_"+ИмяПоля); 
				ПолеЗначения.Вставить("Заголовок", 			"Ссылка"); 
				ПолеЗначения.Вставить("ТипЗначения", 		Параметр.ТипЗначения); 
				ПолеЗначения.Вставить("ИмяПоляКомпоновки", 	"Ссылка.["+Параметр.Идентификатор+"]");
				
			КонецЕсли;
			
			ОписаниеКолонки.Вставить("ПолеЗначения", ПолеЗначения); 
			
			ДанныеКолонок.Вставить(Расшифровка["Идентификатор"], ОписаниеКолонки); 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОписаниеКолонок = новый ФиксированноеСоответствие(ДанныеКолонок);
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьТабицуДанных(Знач СоответствиеИменКолонок, ТаблицаЗначений)
	
	Для Верх = 3 по ТабличныйДокумент.ВысотаТаблицы Цикл   
		
		Если Не ТабличныйДокумент.Область(Верх, 1).СодержитЗначение Тогда  
			//Не удалили строку заголовка
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.СтрокаМакета = Верх;    
		
		Для Лево = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл    
			
			ОбластьОписание = ТабличныйДокумент.Область(1, Лево);   
			Если ОбластьОписание.Расшифровка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяКолонки  = ОбластьОписание.Расшифровка.Идентификатор; 
			
			ОписаниеКолонки = ОписаниеКолонок[ИмяКолонки];
			Если ОписаниеКолонки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеЯчейки = ТабличныйДокумент.Область(Верх, Лево).Значение;
			
			//преобразование пимитивных типов
			ПустаяСсылка = ОписаниеКолонки["ТипЗначения"].ПривестиЗначение(Неопределено); 
			Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустаяСсылка)) Тогда 
				Если ТипЗнч(ПустаяСсылка) = Тип("Дата") Тогда
					ЗначениеЯчейки = ОбщегоНазначенияКлиентСервер.СтрокаВДату(ЗначениеЯчейки);
				Конецесли;
				
				Если ТипЗнч(ПустаяСсылка) = Тип("Число") Тогда
					ЗначениеЯчейки = ОписаниеКолонки["ТипЗначения"].ПривестиЗначение(ЗначениеЯчейки);
				Конецесли;  
				
				Если ТипЗнч(ПустаяСсылка) = Тип("Булево") Тогда
					Если ВРег(ЗначениеЯчейки) = "ДА" или ВРег(ЗначениеЯчейки) = "YES" Тогда
						ЗначениеЯчейки = Истина;
					Иначе
						ЗначениеЯчейки = Ложь;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			//преобразование примитивных типов
			
			НоваяСтрока[ОписаниеКолонки.ИмяКолонки] = ЗначениеЯчейки;
			
			Если ОписаниеКолонки["ПолеЗначения"] <> Неопределено Тогда
				
				ИмяПоляЗначения		= ОписаниеКолонки["ПолеЗначения"]["ИмяКолонки"];
				ЗначениеРеквизита 	= ОписаниеКолонки["ПолеЗначения"].ТипЗначения.ПривестиЗначение(Неопределено); 
				Менеджер			= ОбщегоНазначения.МенеджерОбъектаПоСсылке(ЗначениеРеквизита); 
				
				Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда 
					СтрЗначениеПеречисления = СтрЗаменить(СокрЛП(ЗначениеЯчейки), " ", "");
					
					МетаданныеПеречисления 	= ЗначениеРеквизита.Метаданные();
					ИмяОбъекта			 	= МетаданныеПеречисления.Имя; 
					мдЗначениеПеречисления 	= МетаданныеПеречисления.ЗначенияПеречисления.Найти(СокрЛП(СтрЗначениеПеречисления)); 
					
					Если мдЗначениеПеречисления <> Неопределено Тогда
						ЗначениеРеквизита 	 = ПредопределенноеЗначение("Перечисление."+ИмяОбъекта+"."+СокрЛП(СтрЗначениеПеречисления)); 
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
						//Ищем перечисление по синониму
						Для Каждого ЗначениеПеречисления из МетаданныеПеречисления.ЗначенияПеречисления Цикл
							Если ЗначениеПеречисления.Синоним = СтрЗначениеПеречисления Тогда
								ЗначениеРеквизита = ПредопределенноеЗначение("Перечисление."+ИмяОбъекта+"."+СокрЛП(ЗначениеПеречисления.Имя)); 
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
				Иначе	
					
					Если ИмяКолонки <> "Наименование" Тогда  
						
						Если ОписаниеКолонки.ПоискПоПолю = "Наименование" Тогда
							ЗначениеРеквизита	= Менеджер.НайтиПоНаименованию(СокрЛП(ЗначениеЯчейки), Истина); 
						ИначеЕсли ОписаниеКолонки.ПоискПоПолю = "Код" Тогда
							ЗначениеРеквизита	= Менеджер.НайтиПоКоду(СокрЛП(ЗначениеЯчейки)); 
						Иначе
							ЗначениеРеквизита	= Менеджер.НайтиПоРеквизиту(ОписаниеКолонки.ПоискПоПолю, СокрЛП(ЗначениеЯчейки)); 
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			
				НоваяСтрока[ИмяПоляЗначения] = ЗначениеРеквизита;
				
			КонецЕсли;
			
		КонецЦикла;  
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРеквизитыФормы(Знач ТаблицаЗначений)   
	
	ИгнорируемыеКолонки = ПолучиьИгнорируемыеКолонкиТаблицы();
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Колонка из ТаблицаЗначений.Колонки Цикл  
		
		Если ИгнорируемыеКолонки.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения,"ТаблицаСоответствий", Колонка.Заголовок));
	КонецЦикла;  
	
	Удалаемыереквизиты 	= Новый Массив;
	КолонкиТаблицы 		= ЭтаФорма.ПолучитьРеквизиты("ТаблицаСоответствий");
	
	Для Каждого Реквизит из КолонкиТаблицы Цикл   
		Если ИгнорируемыеКолонки.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Удалаемыереквизиты.Добавить("ТаблицаСоответствий."+Реквизит.Имя);
	КонецЦикла;  
	
	ИзменитьРеквизиты(Добавляемыереквизиты, Удалаемыереквизиты);
	
КонецПроцедуры

&НаСервере
Функция ПолучиьИгнорируемыеКолонкиТаблицы()
	
	ИгнорируемыеКолонки = Новый Массив;
	ИгнорируемыеКолонки.Добавить("ФлагПодобрано");	
	ИгнорируемыеКолонки.Добавить("ИндексКартинки");	
	ИгнорируемыеКолонки.Добавить("СтрокаМакета");
	
	Возврат ИгнорируемыеКолонки;
	
КонецФункции   

&НаКлиенте
Процедура ТаблицаСоответствийПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаСоответствий.ТекущаяСтрока;
	УстановитьФлагПодобраноПоСтроке(ТекущаяСТрока);
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьФлагПодобраноПоСтроке(ТекущаяСтрока)
	
	СтрокаТекущая = ТаблицаСоответствий.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ФлагПодобрано = Ложь;
	Для Каждого КлючЗначение из ОписаниеКолонок Цикл  
		
		ОписаниеКолонки = КлючЗначение.Значение;
		ПолеЗначения 	= ОписаниеКолонки["ПолеЗначения"];   
		
		ИмяКолонки = ОписаниеКолонки["ИмяКолонки"];  
		
		Если ПолеЗначения <> Неопределено Тогда 
			ИмяКолонки = ПолеЗначения["ИмяКолонки"];	
		КонецЕсли;  
		
		ФлагПодобрано = ЗначениеЗаполнено(СтрокаТекущая[ИмяКолонки]);
		
		Если Не ФлагПодобрано Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаТекущая.ФлагПодобрано = ФлагПодобрано;	
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьФлагПодобрано()
	
	Для Каждого СтрокаТаблицы из ТаблицаСоответствий Цикл 
		УстановитьФлагПодобраноПоСтроке(СтрокаТаблицы.ПолучитьИдентификатор());
	КонецЦикла; 
	
КонецПроцедуры
//Таблица соответстий  

//Загрузка данных  
&НаСервере
Процедура УстановитьКартинкуОжиданияПоСтрокам()
	
	Для Каждого СтрокаТаблицы из ТаблицаСоответствий Цикл
		СтрокаТаблицы.ИндексКартинки = 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуОборудования()
	
	ЗаголовокСостояния = ?(РежимЗагрузки=0, "Обновление оборорудования","Загрузка оборорудования");
	
	НомерСтроки = 1;
	Для Каждого СтрокаТаблицы из ТаблицаСоответствий Цикл
		
		ЗагрузитьДанныеВИнформационнуБазу(СтрокаТаблицы.ПолучитьИдентификатор());  
		
		Прогресс = Окр(НомерСтроки / ТаблицаСоответствий.Количество() * 100, 0);;	
		Состояние(ЗаголовокСостояния, Прогресс, СокрЛП(СтрокаТаблицы.СсылкаНаименование));   
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
	
	ОбработатьШагНаКлиенте("Шаг4");  
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.CW_Оборудование"));
	
	ПоказатьПредупреждение(, "Загрузка завершена");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеВИнформационнуБазу(ИдентификаторСтроки)  
	
	СтрокаТаблицы = ТаблицаСоответствий.НайтиПоИдентификатору(ИдентификаторСтроки); 
	
	ОборудованиеСсылка = СтрокаТаблицы.СсылкаНаименование;   
	
	Если РежимЗагрузки = 0 и Не ЗначениеЗаполнено(ОборудованиеСсылка) Тогда
		Возврат;
	КонецЕсли;
 
	ЗаписатьОборудование = Ложь;
	
	Если Не ЗначениеЗаполнено(ОборудованиеСсылка) и РежимЗагрузки = 1 Тогда
		ОборудованиеОбъект = Справочники.CW_Оборудование.СоздатьЭлемент();
		ЗаписатьОборудование = Истина;     
	Иначе
		ОборудованиеОбъект = ОборудованиеСсылка.ПолучитьОбъект();  
	КонецЕсли;
	
	ПараметрыОборудования = ОборудованиеОбъект.ПараметрыГрузоперевозки; 
	
	Для Каждого КлючЗначение из ОписаниеКолонок Цикл
		
		ОписаниеКолонки = КлючЗначение.Значение;
		
		ИмяКолонки	= ОписаниеКолонки["ИмяКолонки"]; 
		Действие 	= ОписаниеКолонки["Действие"];  
		ТипДанных 	= ОписаниеКолонки["ТипДанных"];  
		
		ПолеЗначения = ОписаниеКолонки["ПолеЗначения"];   
		Если ПолеЗначения <> Неопределено Тогда 
			ИмяКолонки = ПолеЗначения["ИмяКолонки"];	
		КонецЕсли;                             
		
		Если ТипДанных = "Реквизит" Тогда  
			Если Действие <> "ПоискПоЗначению" или РежимЗагрузки = 1 Тогда
				Если ОборудованиеОбъект[КлючЗначение.Ключ] <> СтрокаТаблицы[ИмяКолонки] тогда  
					
					ЗначениеРеквизита = СтрокаТаблицы[ИмяКолонки];
					Если КлючЗначение.Ключ = "Наименование" Тогда
						ЗначениеРеквизита = СтрокаТаблицы.Наименование;  
					КонецЕсли; 
					
					ОборудованиеОбъект[КлючЗначение.Ключ] = ЗначениеРеквизита;	
					ЗаписатьОборудование = Истина;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
		
		Если ТипДанных = "Параметр" Тогда  
			
			ИмяРеквизита 		= ОписаниеКолонки["ИмяРеквизита"];
			ЗначениеПараметра 	= СтрокаТаблицы[ИмяКолонки]; 
			Параметр 			= ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Ключ));
			
			Если Действие = "ДобавитьЗначение" Тогда 
				
				НайденнаяСтрока = ПараметрыОборудования.Найти(Параметр, "Параметр"); 
				Если НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока = ПараметрыОборудования.Добавить();	
					НайденнаяСтрока.Параметр = Параметр;
				КонецЕсли;                                
				ПродолжитьДействие	 = "ОбновитьЗначение";
				ЗаписатьОборудование = Истина;
				
			КонецЕсли;   
			
			Если Действие = "ОбновитьЗначение" 
				или ПродолжитьДействие = "ОбновитьЗначение" Тогда 
				
				НайденнаяСтрока = ПараметрыОборудования.Найти(Параметр, "Параметр");
				Если НайденнаяСтрока <> Неопределено Тогда  
					НайденнаяСтрока.Значение = ЗначениеПараметра;     
					ЗаписатьОборудование = Истина;
				КонецЕсли;
				
			КонецЕсли;   
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаТаблицы.ИндексКартинки = 0; 
	
	Успешно = Ложь;
	Если ЗаписатьОборудование Тогда
		Попытка  
			Если Не ЗначениеЗаполнено(ОборудованиеОбъект.ВидПеревозки) Тогда
				ОборудованиеОбъект.ВидПеревозки = ВидОборудования;	
			КонецЕсли; 
			
			Если ОборудованиеОбъект.ВидПеревозки = Перечисления.CW_ВидыПеревозок.Контейнер  
				И КонтролироватьКоректностьНомераКонтейнера 
				И НЕ _БЭ.НомерКонтейнераКорректный(ОборудованиеОбъект.Наименование) Тогда   
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Введен некорректный номер "+ СокрЛП(ОборудованиеОбъект.Наименование)+" контейнера ");
				СтрокаТаблицы.ИндексКартинки = 6; 
				Возврат;
			КонецЕсли; 
			
			ОборудованиеОбъект.Записать(); 			
			СтрокаТаблицы.ИндексКартинки = 5; 
			Успешно = Истина; 
		Исключение
			СтрокаТаблицы.ИндексКартинки = 6; 
		КонецПопытки;
	Конецесли; 
	
	Если Успешно и ОбновлятьПараметрыТекущегоОборудованияНаСлежении Тогда
		ОбновитьПараметрыТекущегоОборудованияНаСлежении(ОборудованиеОбъект.Ссылка);	
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Процедура ОбновитьПараметрыТекущегоОборудованияНаСлежении(Оборудование) 
	
	//Массив измененного оборужования на слежении
	мОборудованиеНаСлежении = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОборудованиеПараметрыГрузоперевозки.Параметр КАК Параметр,
	|	CW_ОборудованиеПараметрыГрузоперевозки.Значение КАК Значение,
	|	CW_ОборудованиеПараметрыГрузоперевозки.Примечание КАК Примечание
	|ИЗ
	|	Справочник.CW_Оборудование.ПараметрыГрузоперевозки КАК CW_ОборудованиеПараметрыГрузоперевозки
	|ГДЕ
	|	CW_ОборудованиеПараметрыГрузоперевозки.Ссылка = &Оборудование";
	
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПараметров = РезультатЗапроса.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОтслеживаемоеОборудование.Ссылка КАК ОтслеживаемоеОборудование
	|ИЗ
	|	Справочник.CW_ОтслеживаемоеОборудование КАК CW_ОтслеживаемоеОборудование
	|ГДЕ
	|	CW_ОтслеживаемоеОборудование.Оборудование = &Оборудование
	|	И CW_ОтслеживаемоеОборудование.ПометкаУдаления = ЛОЖЬ
	|	И (CW_ОтслеживаемоеОборудование.ОкончаниеСлежения >= &ОкончаниеСлежения
	|			ИЛИ CW_ОтслеживаемоеОборудование.ОкончаниеСлежения = ДАТАВРЕМЯ(1, 1, 1))";  
	
	Запрос.УстановитьПараметр("Оборудование", 		Оборудование);
	Запрос.УстановитьПараметр("ОкончаниеСлежения", 	НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();  
	Пока Выборка.Следующий() Цикл   
		
		ЗаписатьИзменения = Ложь;
		
		ОборудованиеНаСлеженииОбъект 	= Выборка.ОтслеживаемоеОборудование.ПолучитьОбъект();
		ПараметрыОборудования 			= ОборудованиеНаСлеженииОбъект.ПараметрыГрузоперевозки;  
		
		Для Каждого СтрокаТаблицы из ТаблицаПараметров Цикл  
			НайденнаяСтрока = ПараметрыОборудования.Найти(СтрокаТаблицы.Параметр, "Параметр");
			Если НайденнаяСтрока = Неопределено Тогда
				НайденнаяСтрока = ПараметрыОборудования.Добавить();
				НайденнаяСтрока.ДобавлятьВКарточку = истина;
			КонецЕсли; 
			
			СтароеЗначение = НайденнаяСтрока.Значение;
			
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока, СтрокаТаблицы); 
			
			Если Не ЗаписатьИзменения 
				и СтароеЗначение <> НайденнаяСтрока.Значение Тогда
				ЗаписатьИзменения = Истина;	
			КонецЕсли;
		КонецЦикла; 
		
		Если ЗаписатьИзменения Тогда
			ОборудованиеНаСлеженииОбъект.ОбменДанными.Загрузка = истина;
			ОборудованиеНаСлеженииОбъект.Записать();
			
			мОборудованиеНаСлежении.Добавить(Выборка.ОтслеживаемоеОборудование);
		КонецЕсли;
		
	КонецЦикла; 
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_Грузоперевозки.ОтслеживаемоеОборудование КАК ОборудованиеНаСлежении,
	|	CW_Грузоперевозки.Ссылка КАК Грузоперевозка
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.ОтслеживаемоеОборудование В (&мОборудованиеНаСлежении)
	|ИТОГИ ПО
	|	ОтслеживаемоеОборудование";  
	
	Запрос.УстановитьПараметр("мОборудованиеНаСлежении", мОборудованиеНаСлежении);
	
	РезультатГрузоперевозки = Запрос.Выполнить();
	ВыборкаОборудованиеНаСлежении = РезультатГрузоперевозки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОборудованиеНаСлежении.Следующий() Цикл
		
		ТаблицаПараметров = ПолучитьТаблицуПараметров(ВыборкаОборудованиеНаСлежении.ОборудованиеНаСлежении);
		Если ТаблицаПараметров.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		ВыборкаГрузоперевозки = ВыборкаОборудованиеНаСлежении.Выбрать();
		Пока ВыборкаГрузоперевозки.Следующий() Цикл
			ЗаполнитьПараметрыВГрузоперевозку(ТаблицаПараметров, ВыборкаГрузоперевозки.Грузоперевозка);	
		КонецЦикла; 
		
	КонецЦикла;  
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьТаблицуПараметров(ОборудованиеНаСлежении)
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки.Параметр КАК Параметр,
	|	CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки.Значение КАК Значение,
	|	CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки.Примечание КАК Примечание
	|ИЗ
	|	Справочник.CW_ОтслеживаемоеОборудование.ПараметрыГрузоперевозки КАК CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки
	|ГДЕ
	|	CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки.Ссылка = &ОборудованиеНаСлежении
	|	И CW_ОтслеживаемоеОборудованиеПараметрыГрузоперевозки.ДобавлятьВКарточку = ИСТИНА";  
	
	Запрос.УстановитьПараметр("ОборудованиеНаСлежении", ОборудованиеНаСлежении);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыВГрузоперевозку(ТаблицаПараметров, Грузоперевозка) 
	
	ГрузоперевозкаОбъект = Грузоперевозка.ПолучитьОбъект();
	
	Для каждого СтрокаПараметров из ТаблицаПараметров Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("Параметр", СтрокаПараметров.Параметр);
		
		мСтроки = ГрузоперевозкаОбъект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
		Если мСтроки.Количество() <> 0 Тогда
			НоваяСтрока = мСтроки[0];  //Всегда одна строка
		Иначе
			НоваяСтрока = ГрузоперевозкаОбъект.ПараметрыГрузоперевозки.Добавить();
			НоваяСтрока.Параметр = СтрокаПараметров.Параметр;
		КонецЕсли;
		
		НоваяСтрока.Значение	= СтрокаПараметров.Значение;
		НоваяСтрока.Примечание	= СтрокаПараметров.Примечание;
		
	КонецЦикла;
	
	ГрузоперевозкаОбъект.Записать();
	
	//Запишем стутасы
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Грузоперевозка);
	
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
	//Запишем стутасы
	
	
КонецПроцедуры
//Загрузка данных                


&НаКлиенте
Процедура ЗаполнитьЗначенияКолонки(Команда) 
	
	ВыделенныеСтроки = Элементы.ТаблицаСоответствий.ВыделенныеСтроки;
	
	ОписаниеКолонки  = ПолучитьДанныеКолонки();   
	Если ОписаниеКолонки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки",	ВыделенныеСтроки);
	ДополнительныеПараметры.Вставить("ОписаниеКолонки", 	ОписаниеКолонки);
	
	ОписаниеОпвещения = Новый ОписаниеОповещения("ЗавершитьВыборЭлемента", ЭтотОбъект, ДополнительныеПараметры);  
	
	Если ОписаниеКолонки.ЭтоСсылка Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("РежимВыбора", 		Истина);
		СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", 	Истина);
		СтруктураПараметров.Вставить("МножественныйВыбор", 	Ложь);
		
		ОткрытьФорму(ОписаниеКолонки.ИмяОбъекта+".ФормаВыбора", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОпвещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе  
		
		ПоказатьВводЗначения(ОписаниеОпвещения,, "Введите значение", ОписаниеКолонки.ТипЗначения);
		
	КонецЕсли;
	
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьДанныеКолонки() 
	
	ПутьКданным 	= Элементы.ТаблицаСоответствий.ТекущийЭлемент.ПутьКДанным;
	мДанныеПоля 	= СтрРазделить(ПутьКданным, ".");   
	ИмяКолонки 		= мДанныеПоля[1];  
	
	Для Каждого КлючЗначение из  ОписаниеКолонок Цикл
		
		ОписаниеКолонки = КлючЗначение.Значение; 
		ПолеЗначения 	= ОписаниеКолонки["ПолеЗначения"]; 
		ИмяПоля 		= ОписаниеКолонки["ИмяКолонки"]; 
		
		Если ИмяПоля = ИмяКолонки и ПолеЗначения <> Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если ПолеЗначения <> Неопределено Тогда
			ИмяПоля 		= ПолеЗначения["ИмяКолонки"];
			ОписаниеКолонки = ПолеЗначения;
		КонецЕсли;
		
		Если ИмяПоля = ИмяКолонки Тогда
			ТипЗначения = ОписаниеКолонки["ТипЗначения"];	
			Прервать;
		Конецесли;
		
	КонецЦикла;
	
	ПустаяСсылка = ТипЗначения.ПривестиЗначение(Неопределено);   
	
	ОписаниеКолонки = Новый Структура;
	ОписаниеКолонки.Вставить("Имя",			ИмяПоля);
	ОписаниеКолонки.Вставить("ТипЗначения",	ТипЗнч(ПустаяСсылка));
	ОписаниеКолонки.Вставить("ЭтоСсылка", 	Ложь);  
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустаяСсылка)) Тогда
		ПолноеИмяОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(ПустаяСсылка)).ПолноеИмя();
		ОписаниеКолонки.Вставить("ЭтоСсылка",	Истина);  
		ОписаниеКолонки.Вставить("ИмяОбъекта", 	ПолноеИмяОбъекта);  
	КонецЕсли;      
	
	Возврат ОписаниеКолонки
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыборЭлемента(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыборЭлементаНаСервере(РезультатВыбора, ДополнительныеПараметры);
	
КонецПроцедуры    

&НаСервере
Процедура ОбработатьВыборЭлементаНаСервере(ВыбранноеЗначение, ДополнительныеПараметры)
	
	Для Каждого ИдентификаторСтроки из ДополнительныеПараметры.ВыделенныеСтроки Цикл
		СтрокаТекущая = ТаблицаСоответствий.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаТекущая[ДополнительныеПараметры.ОписаниеКолонки["Имя"]]  = ВыбранноеЗначение;
	КонецЦикла; 
	
	УстановитьФлагПодобрано();
	
КонецПроцедуры

//Расширения
&НаКлиенте
Функция ПолучитьСписокВыборТипаДанных()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Реквизит",	"Реквизит оборудования",,БиблиотекаКартинок.Реквизит);
	СписокВыбора.Добавить("Параметр",	"Параметр оборудования",,БиблиотекаКартинок.CW_ПараметрыГрузоперевозок);   
	
	Возврат СписокВыбора;

КонецФункции  

&НаСервере
Функция ПолучитьСписокДоступныхРеквизитовОбъекта()
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("Наименование", "Наименование");
	
	стрДоступныеРеквизиты 		= "ВидПеревозки,Типоразмер,Примечание";
	массивДоступнныхРеквизитов 	= СтрРазделить(стрДоступныеРеквизиты,",", Ложь); 
	
	МетаданныеОбъекта = ПолучитьМетаданныеОбъекта();
	
	Реквизиты = МетаданныеОбъекта.Реквизиты;
	Для Каждого ИмяРеквизита из массивДоступнныхРеквизитов Цикл
		Реквизит = Реквизиты.Найти(ИмяРеквизита);
		Если Реквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СписокЗначений.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции

&НаСервере
Функция ПолучитьМетаданныеОбъекта()
	
	МетаданныеОбъекта = Метаданные.Справочники.CW_Оборудование;
	Возврат МетаданныеОбъекта;

КонецФункции

&НаСервере
Функция ОписаниеПоляНаименование()
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяПоля", 			"Наименование");
	Структура.Вставить("ИмяГруппы", 		"ГруппаОборудование");
  	Структура.Вставить("ЗаголовокГруппы",	"Оборудование");
  	Структура.Вставить("ОписаниеТипа",		Новый ОписаниеТипов("СправочникСсылка.CW_Оборудование"));
	
	Возврат Структура;
	
КонецФункции
