Процедура ВыполнитьПереводЗаявокПрофиляВАрхив(ПараметрыПроцедуры, РезультатВыполнения) Экспорт
	
	CW_ОбщийМодульЛичныйКабинетСервер.ПеревестиЗаявкиВАрхив(ПараметрыПроцедуры.Профили);

КонецПроцедуры   

Процедура ВыполнитьКонвертациюВебПрофилей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВебПрофилиЗаявок.Ссылка КАК Ссылка,
	               |	CW_ВебПрофилиЗаявок.СтруктураПрофиля.(
	               |		СтрокаПоляКомпоновки КАК СтрокаПоляКомпоновки,
	               |		ОбъектХарактеристики КАК ОбъектХарактеристики,
	               |		ЗаголовокRU КАК ЗаголовокRU,
	               |		ЗаголовокEN КАК ЗаголовокEN,
	               |		Формат КАК Формат,
	               |		Фиксация КАК Фиксация,
	               |		БыстрыйОтбор КАК БыстрыйОтбор,
	               |		ДоступенФормат КАК ДоступенФормат,
	               |		ИмяПоля КАК ИмяПоля,
	               |		ХранилищеТипаЗначения КАК ХранилищеТипаЗначения
	               |	) КАК СтруктураПрофиля,
	               |	CW_ВебПрофилиЗаявок.ПоляСортировки.(
	               |		СтрокаПоляКомпоновки КАК СтрокаПоляКомпоновки,
	               |		Заголовок КАК Заголовок,
	               |		Сортировка КАК Сортировка
	               |	) КАК ПоляСортировки
	               |ИЗ
	               |	Справочник.CW_ВебПрофилиЗаявок КАК CW_ВебПрофилиЗаявок
	               |ГДЕ
	               |	CW_ВебПрофилиЗаявок.ШаблонПрофиля = Значение(Справочник.CW_ВебШаблоныПрофилей.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВебШаблонОбъект = Справочники.CW_ВебШаблоныПрофилей.СоздатьЭлемент();
		ВебШаблонОбъект.Наименование 	= СокрЛП(Выборка.Ссылка);
		ВебШаблонОбъект.Раздел			= "ЗАЯВКИ"; 
		
		ВыборкаСтруктураПрофиля = Выборка.СтруктураПрофиля.Выбрать();   
		Пока ВыборкаСтруктураПрофиля.Следующий() Цикл
			
			СтрокаТаблицы = ВебШаблонОбъект.СтруктураПрофиля.Добавить(); 
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаСтруктураПрофиля); 
			
			СтрокаТаблицы.ХранилищеТипаЗначения = Новый ХранилищеЗначения(ВыборкаСтруктураПрофиля.ХранилищеТипаЗначения.Получить());			 
			
			СтрокаТаблицы = ВебШаблонОбъект.ПоляОбъекта.Добавить(); 
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаСтруктураПрофиля); 
		КонецЦикла;
		
		ВыборкаПоляСортировки = Выборка.ПоляСортировки.Выбрать(); 
		Пока ВыборкаПоляСортировки.Следующий() Цикл
			СтрокаТаблицы = ВебШаблонОбъект.ПоляСортировки.Добавить(); 
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаПоляСортировки); 
		КонецЦикла; 
		
		СтрокаТаблицы = ВебШаблонОбъект.ГруппыПолей.Добавить(); 
		СтрокаТаблицы.ИмяГруппыRU 			= "<Пустая>"; 
		СтрокаТаблицы.ЕстьОформление		= -1;
		СтрокаТаблицы.ХранилищеШрифт 	 	= Новый ХранилищеЗначения(ШрифтыСтиля.ШрифтТекста);
		СтрокаТаблицы.ХранилищеЦветТекста 	= Новый ХранилищеЗначения(ЦветаСтиля.ЦветТекстаПоля);
		СтрокаТаблицы.ХранилищеЦветФона 	= Новый ХранилищеЗначения(ЦветаСтиля.ЦветФонаПоля);  
		
		ВебШаблонОбъект.ОбменДанными.Загрузка = ИСТИНА;
		ВебШаблонОбъект.Записать();
		
		ОбъектПрофиль = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектПрофиль.ШаблонПрофиля = ВебШаблонОбъект.Ссылка;
		
		ОбъектПрофиль.ОбменДанными.Загрузка = ИСТИНА;
		ОбъектПрофиль.Записать();   
		
	КонецЦикла;
	//Шаблоны заявок  

КонецПроцедуры

Процедура ПриОтключенииКонтстантыЗапрашиватьТипФайлаПриДобавленииВАрхив() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ВебПрофилиЗаявок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ВебПрофилиЗаявок КАК CW_ВебПрофилиЗаявок";  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПрофильОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПрофильОбъект.ВыгружатьФайлы = Ложь;
		ПрофильОбъект.ВыводитьТипФайла = Ложь;
		ПрофильОбъект.РазрешеноПрикреплятьФайлы = Ложь;
		
		ПрофильОбъект.ТипыФайлов.Очистить(); 
		
		ПрофильОбъект.ОбменДанными.Загрузка = Истина; 
		ПрофильОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
