#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Активный = Ложь;
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ПредставлениеRU, "'") > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимо использование символа ' (одинарная кавычка) ",,"ПредставлениеRU","Объект", Отказ);
	КонецЕсли;
	
	Если СтрНайти(ПредставлениеEN, "'") > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимо использование символа ' (одинарная кавычка) ",,"ПредставлениеEN","Объект", Отказ);
	КонецЕсли;
	
	Если ВыгружатьФайлы и ТипыФайлов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен список типов выгружаемых файлов",,"ВыгружатьФайлы","Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ АвтоматическиПереводитьВАрхив Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("ИдентификаторАрхива");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;  
		
		Индекс = ПроверяемыеРеквизиты.Найти("ПараметрПереводаВАрхив");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;  
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли