#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	КонтрольЗаполненияТипоразмера 			= (КонтрольЗаполненияТипоразмера И ВидПеревозки = Перечисления.CW_ВидыПеревозок.Контейнер);
	КонтрольЗаполненияГруза 				= (КонтрольЗаполненияГруза И Константы.CW_Мониторинг_Груз.Получить());
	КонтрольЗаполненияМаршрута 				= (КонтрольЗаполненияМаршрута И Константы.CW_Мониторинг_Маршрут.Получить());
	КонтрольЗаполненияОперативногоМенеджера = (КонтрольЗаполненияОперативногоМенеджера И Константы.CW_Мониторинг_ОперативныйМенеджер.Получить());
	КонтрольЗаполненияМенеджераПродаж 		= (КонтрольЗаполненияМенеджераПродаж И Константы.CW_Мониторинг_МенеджерПродаж.Получить());
	
КонецПроцедуры

Процедура ПроверитьИерархиюПараметров() Экспорт 
	// --- 
	
	Если (ГруппыПараметровГрузоперевозки.Количество()=0) Тогда
		
		// требуется сформировать группы по текущей иерархии параметров
		
		// добавляем корневой элемент
		КорневаяГруппа = ГруппыПараметровГрузоперевозки.Добавить();
		КорневаяГруппа.Идентификатор = 0;
		КорневаяГруппа.ИдентификаторВедущего=0;
		КорневаяГруппа.Наименование = "Корень";
		КорневаяГруппа.Раскрывать = Истина;
		
		// получаем родителей текущих параметров
		ТЗП = ПараметрыГрузоперевозки.Выгрузить();
		ТЗП.Колонки.Добавить("Код");
		ТЗП.Колонки.Добавить("Родитель");
		ТЗП.Колонки.Добавить("КодРодителя");
		Для каждого Стр Из ТЗП Цикл
			
			Стр.Код = Стр.Параметр.Код;
			Стр.Родитель = Стр.Параметр.Родитель;
			Стр.КодРодителя = Стр.Родитель.Код;
			
		КонецЦикла; 
		
		ТЗР = ТЗП.Скопировать(,"Родитель,КодРодителя");
		ТЗР.Свернуть("Родитель,КодРодителя");
		ТЗР.Сортировать("КодРодителя Возр");
		// --- 
		МассивГруппВерхнегоУровня = Новый Массив;
		ЕстьПустойРодитель = Ложь;
		МассивПараметровБезРодителя = Новый Массив;
		Индекс = 1;
		Для каждого СтрРодитель Из ТЗР Цикл
			
			Отбор = Новый Структура("Родитель",СтрРодитель.Родитель);
			// --- 
			Если (СтрРодитель.Родитель.Пустая()) Тогда
				
				ЕстьПустойРодитель=Истина;
				ТЗПБР = ТЗП.Скопировать(Отбор);
				ТЗПБР.Сортировать("Код Возр");
				Для каждого СтрПБР Из ТЗПБР Цикл
					МассивПараметровБезРодителя.Добавить(Стр.Параметр);
				КонецЦикла;
				
			Иначе
				
				// создаем
				Нстр = ГруппыПараметровГрузоперевозки.Добавить();
				Нстр.Идентификатор = Индекс;
				_сф.Инкремент(Индекс);
				Нстр.ИдентификаторВедущего = 0;
				Нстр.Раскрывать = Истина;
				// --- 
				Нстр.Наименование = Строка(СтрРодитель.Родитель);
				
				// формируем подчиненные
				ТЗПР = ТЗП.Скопировать(Отбор);
				ТЗПР.Сортировать("Код Возр");
				// --- 
				МассивПараметров = ТЗПР.ВыгрузитьКолонку("Параметр");
				Нстр.ИдентификаторыВедомых=ЗначениеВСтрокуВнутр(МассивПараметров);
				
				МассивГруппВерхнегоУровня.Добавить(Нстр);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		// --- 
		
		МассивЭлементовВерхнегоУровня = Новый Массив;
		Для каждого СтрРодитель Из МассивГруппВерхнегоУровня Цикл
			
			МассивЭлементовВерхнегоУровня.Добавить(СтрРодитель.Идентификатор);
			
		КонецЦикла; 
		Если (МассивПараметровБезРодителя.Количество()<>0) Тогда
			
			Для каждого Параметр Из МассивПараметровБезРодителя Цикл
				
				МассивЭлементовВерхнегоУровня.Добавить(Параметр);
				
			КонецЦикла; 
			
		КонецЕсли; 
		КорневаяГруппа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивЭлементовВерхнегоУровня);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецЕсли 