&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ВнешнийВызов", Отчет.ВнешнийВызов);
	Если Отчет.ВнешнийВызов Тогда
		ПФ = Новый Структура("Отбор,Группировки,Параметры");
		ЗаполнитьЗначенияСвойств(ПФ, Параметры);
		Отчет.АдресВнешнихНастроек = ПоместитьВоВременноеХранилище(ПФ, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли; 
	
	Заголовок = "Ведомость перевыставления затрат";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	_ВосстановитьСтандартныеНастройки();
	
	_ВосстановитьСеансовуюНастройку();
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяДата());
		КонецПериода  = КонецМесяца(ТекущаяДата());
	КонецЕсли;	
	
	Если Отчет.ВнешнийВызов Тогда
		_ОбработатьВнешниеПараметры();
		Сформировать(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ОбработатьВнешниеПараметры()
	
	ПокКол   = Ложь;
	ПокСумма = Ложь;
	ПокНДС   = Ложь;
	ПокВсего = Истина;
	
	СП = ПолучитьИзВременногоХранилища(Отчет.АдресВнешнихНастроек);
	
	ПараметрыОтчета = _сф.ст_ПолучитьСвойство(СП,"Параметры");
	НачалоПериода = ПараметрыОтчета.НачалоПериода;
	КонецПериода = ПараметрыОтчета.КонецПериода;
	
	_Группировки = _сф.ст_ПолучитьСвойство(СП,"Группировки");
	Если (_Группировки <> Неопределено) Тогда
		Группировки.Очистить();
		Для каждого _Группировка Из _Группировки Цикл
			Нстр = Группировки.Добавить();
			Нстр.ИмяПоля = _Группировка;
			Нстр.Представление = _Группировка;
			Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		КонецЦикла; 
	КонецЕсли; 
	// --- 
	
КонецПроцедуры

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_ВедомостьПеревыставленияЗатрат.ПолучитьМакет("Схема").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть = Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка    = Ложь;
	Иначе
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка    = Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка    = Истина;
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод;
	Диалог.Период.ДатаНачала = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПериод <> Неопределено) Тогда
		НачалоПериода = ОтветПериод.ДатаНачала;
		КонецПериода  = ОтветПериод.ДатаОкончания;
		//Период = ОтветПериод;
	КонецЕсли;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("НачалоПериода", НачалоПериода);
			СеансоваяНастройка.Свойство("КонецПериода", КонецПериода);
			СеансоваяНастройка.Свойство("ПокКол", ПокКол);
			СеансоваяНастройка.Свойство("ПокСумма", ПокСумма);
			СеансоваяНастройка.Свойство("ПокНДС", ПокНДС);
			СеансоваяНастройка.Свойство("ПокВсего", ПокВсего);			
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			СеансоваяНастройка.Свойство("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
			// Отбор
			НастройкиКД = "";
			СеансоваяНастройка.Свойство("Отбор", НастройкиКД);
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			Для Каждого СтрОтбор из НастройкиКД.Отбор.Элементы Цикл
				НовОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовОтбор, СтрОтбор);
			КонецЦикла;	
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("НачалоПериода", НачалоПериода);
	СтруктураНастройки.Вставить("КонецПериода", КонецПериода);	
	СтруктураНастройки.Вставить("ПокКол", ПокКол);
	СтруктураНастройки.Вставить("ПокСумма", ПокСумма);
	СтруктураНастройки.Вставить("ПокНДС", ПокНДС);
	СтруктураНастройки.Вставить("ПокВсего", ПокВсего);
	СтруктураНастройки.Вставить("Группировки", Группировки.Выгрузить());
	СтруктураНастройки.Вставить("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
	СтруктураНастройки.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда
		СписокПолей.Добавить("Регистратор");
		СписокПолей.Добавить("ПериодСекунда");
		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
		      
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ПокСумма И НЕ ПокНДС И НЕ ПокВсего И НЕ ПокКол Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного показателя!");
		Возврат;		
	КонецЕсли;
	
	Если Группировки.Количество() = 0 Тогда
		_УФК.ВывестиПредупреждение("Не выбрано ни одной группировки!");
		Возврат;				
	КонецЕсли;	
	
	_Настройка(Истина);
	СформироватьОтчет();
	ОбработатьОтчет();
	
	Отчет.ВнешнийВызов = Ложь;
		
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
		
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	
	Если ВыводитьДокументыДвижения И Отчет.КомпоновщикНастроек.Настройки.Структура.Количество() > 0 Тогда
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		Для Каждого СтрОтбораГр из Отчет.КомпоновщикНастроек.Настройки.Структура[0].Отбор.Элементы Цикл
			СтрОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(СтрОтбора, СтрОтбораГр);
		КонецЦикла;	
	КонецЕсли;	
	
	// --- 
	_СохранитьСеансовуюНастройку();
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	
	Настройки = _сф.ст_Создать("НачалоПериода,КонецПериода,ПокСумма,ПокНДС,ПокВсего,ПокКол,Группировки,ВыводитьДокументыДвижения");
	Настройки.НачалоПериода = НачалоПериода;
	Настройки.КонецПериода = КонецПериода;
	Настройки.ПокКол = ПокКол;
	Настройки.ПокСумма = ПокСумма;
	Настройки.ПокНДС = ПокНДС;
	Настройки.ПокВсего = ПокВсего;
	Настройки.Группировки = Группировки.Выгрузить();
	Настройки.ВыводитьДокументыДвижения = ВыводитьДокументыДвижения;
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор));
	
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "0:00:00", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "23:59:59", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сальдо на начало периода", "Сальдо на " + Формат(НачалоПериода,"ДФ=dd.MM.yy"), ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сальдо на конец периода", "Сальдо на " + Формат(КонецПериода,"ДФ=dd.MM.yy"), ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "КолонкаКол", "Количество", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "КолонкаСумма", "Сумма", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "КолонкаНДС", "НДС", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "КолонкаВсего", "Всего", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "КолПриход", "Приход", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "КолРасход", "Расход", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(Результат,"Ведомость перевыставления затрат");
	//УправлениеКолонтитулами
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
	СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	
	ДоступныеДействия = Новый Массив();
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
	
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("НачалоПериода", НачалоПериода);
	Настройки.ДополнительныеСвойства.Вставить("КонецПериода", КонецПериода);
	Настройки.ДополнительныеСвойства.Вставить("ПокКол", ПокКол);
	Настройки.ДополнительныеСвойства.Вставить("ПокСумма", ПокСумма);
	Настройки.ДополнительныеСвойства.Вставить("ПокНДС", ПокНДС);
	Настройки.ДополнительныеСвойства.Вставить("ПокВсего", ПокВсего);
	//Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки.Выгрузить());
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); // ДанныеФормыКоллекция
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма,Настройки);
	
КонецПроцедуры