
Процедура ПередЗаписью(Отказ) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() 
		или Родитель <> Ссылка.Родитель Тогда
		
		ИндексЭлемента = ПолучитьИндексЭлемента();                                    
		
		Если НЕ ЭтоГруппа Тогда
			Если ТипЗнч(Значение) = Тип("Неопределено") Тогда
				Значение = Параметр.ТипЗначения.ПривестиЗначение(Неопределено);   
			КонецЕсли;  
			
			Если Параметр.ЭтоКонтрольнаяДата Тогда
				Если ТипЗнч(ЗначениеПлан) = Тип("Неопределено") Тогда
					ЗначениеПлан = Параметр.ТипЗначения.ПривестиЗначение(Неопределено);   
				КонецЕсли;
				Если ТипЗнч(ЗначениеФакт) = Тип("Неопределено") Тогда
					ЗначениеФакт = Параметр.ТипЗначения.ПривестиЗначение(Неопределено);   
				КонецЕсли;  
			КонецЕсли;
			
		КонецЕсли;   
	КонецЕсли; 
	
	Если НЕ ЭтоГруппа 
		и Параметр.ЭтоКонтрольнаяДата Тогда  
		Значение = Макс(ЗначениеПлан, ЗначениеФакт);  
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтоГруппа Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Наименование"));
	КонецЕсли;   
	
КонецПроцедуры

Функция ПолучитьИндексЭлемента()   
	
	ИндексЭлемента = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_МониторинговыеПараметрыОбъектов.ИндексЭлемента КАК ИндексЭлемента
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыОбъектов КАК CW_МониторинговыеПараметрыОбъектов
	|ГДЕ
	|	CW_МониторинговыеПараметрыОбъектов.Владелец = &Владелец
	|	И CW_МониторинговыеПараметрыОбъектов.Родитель = &Родитель
	|	И CW_МониторинговыеПараметрыОбъектов.ЭтоГруппа = &ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИндексЭлемента УБЫВ";  
	
	Запрос.УстановитьПараметр("Владелец", 	Владелец);  
	Запрос.УстановитьПараметр("Родитель", 	Родитель);
	Запрос.УстановитьПараметр("ЭтоГруппа", 	ЭтоГруппа);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда  
		ИндексЭлемента =  Выборка.ИндексЭлемента;
	КонецЕсли;
	
	Возврат ИндексЭлемента + 1;
	
КонецФункции
