
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиОтбора 	= Истина;
	ПоляСортировки   	= Истина;
	СтруктураПрофиля	= Истина;
	ТипыФайлов			= Истина;
	УстановитьВыводНаАнглийскомЯзыке = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтруктураПрофиля",	СтруктураПрофиля);
	СтруктураПараметров.Вставить("ПоляСортировки",		ПоляСортировки);
	СтруктураПараметров.Вставить("НастройкиОтбора",		НастройкиОтбора);
	СтруктураПараметров.Вставить("ТипыФайлов",			ТипыФайлов);
	СтруктураПараметров.Вставить("УстановитьВыводНаАнглийскомЯзыке", УстановитьВыводНаАнглийскомЯзыке);
	
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры
