
Функция ДополнитьДополнительныеПоляСвертки(ТаблицаУслуг, ВариантСвертки, СтарыйВариант = ложь) Экспорт
	
	СоответствиеСтрокаСвертки = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПараметрыСвертки.ИдентификаторСтрокиСвертки КАК ИдентификаторСтрокиСвертки,
	               |	НоменклатураСвертки.Номенклатура КАК Номенклатура,
	               |	ПараметрыСвертки.МониторинговыйПараметр КАК МониторинговыйПараметр,
	               |	""_"" + ПараметрыСвертки.МониторинговыйПараметр.Код КАК ИмяПоля
	               |ПОМЕСТИТЬ ВТ_ПараметрыСвертки
	               |ИЗ
	               |	Справочник.CW_ВариантыСверткиТабличныхЧастей.ПараметрыСвертки КАК ПараметрыСвертки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CW_ВариантыСверткиТабличныхЧастей.НоменклатураСвертки КАК НоменклатураСвертки
	               |		ПО ПараметрыСвертки.ИдентификаторСтрокиСвертки = НоменклатураСвертки.ИдентификаторСтрокиСвертки
	               |ГДЕ
	               |	ПараметрыСвертки.Ссылка = &ВариантСвертки
	               |	И НоменклатураСвертки.Ссылка = &ВариантСвертки";
	
	Запрос.УстановитьПараметр("ВариантСвертки", ВариантСвертки);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ПараметрыСвертки.Номенклатура КАК Номенклатура,
	               |	ВТ_ПараметрыСвертки.ИдентификаторСтрокиСвертки КАК ИдентификаторСтрокиСвертки,
	               |	ВТ_ПараметрыСвертки.ИмяПоля КАК ИмяПоля
	               |ИЗ
	               |	ВТ_ПараметрыСвертки КАК ВТ_ПараметрыСвертки
	               |ИТОГИ ПО
	               |	ИдентификаторСтрокиСвертки";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИдентификаторыСтрок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИдентификаторыСтрок.Следующий() Цикл
		
		мИменаПолей = Новый Массив;
		
		Выборка = ВыборкаИдентификаторыСтрок.Выбрать();
		Пока Выборка.Следующий() Цикл
			мИменаПолей.Добавить(Выборка.ИмяПоля);
		КонецЦикла;
		
		Ключ = ВыборкаИдентификаторыСтрок.ИдентификаторСтрокиСвертки;
		Если СтарыйВариант Тогда
			ВыборкаНоменклатура = ВыборкаИдентификаторыСтрок.Выбрать();
			Если ВыборкаНоменклатура.Следующий() Тогда
				Ключ = ВыборкаНоменклатура.Номенклатура;
			КонецЕсли;
		КонецЕсли;
		
		СоответствиеСтрокаСвертки.Вставить(Ключ, СтрСоединить(мИменаПолей,","));
		
	КонецЦикла;

	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ПараметрыСвертки.МониторинговыйПараметр КАК МониторинговыйПараметр
	               |ИЗ
	               |	ВТ_ПараметрыСвертки КАК ВТ_ПараметрыСвертки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПараметрыСвертки.МониторинговыйПараметр";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	мПараметры = Новый Массив;
	Пока Выборка.Следующий() Цикл
		мПараметры.Добавить(Выборка.МониторинговыйПараметр);
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ПараметрыСвертки.МониторинговыйПараметр КАК МониторинговыйПараметр,
	               |	ВТ_ПараметрыСвертки.ИмяПоля КАК ИмяПоля
	               |ИЗ
	               |	ВТ_ПараметрыСвертки КАК ВТ_ПараметрыСвертки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПараметрыСвертки.МониторинговыйПараметр,
	               |	ВТ_ПараметрыСвертки.ИмяПоля";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	СоответствиеИменПолей = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ТаблицаУслуг.Колонки.Добавить(Выборка.ИмяПоля);	
		
		СоответствиеИменПолей.Вставить(Выборка.МониторинговыйПараметр, Выборка.ИмяПоля);
	КонецЦикла;
	
	
	мГрузоперевозки = ТаблицаУслуг.ВыгрузитьКолонку("Грузоперевозка");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка,
	               |	CW_Грузоперевозки.Заказ КАК Заказ,
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Параметр
	               |ПОМЕСТИТЬ ВТ_ГрузоперевозкиИПараметры
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки,
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_Грузоперевозки.Ссылка В(&мГрузоперевозки)
	               |	И CW_ПараметрыГрузоперевозок.Ссылка В(&мПараметры)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ГрузоперевозкиИПараметры.Ссылка КАК Грузоперевозка,
	               |	ВТ_ГрузоперевозкиИПараметры.Параметр КАК Параметр,
	               |	ЕСТЬNULL(CW_ХарактеристикиГрузоперевозок.Значение, ЕСТЬNULL(CW_ХарактеристикиЗаказов.Значение, НЕОПРЕДЕЛЕНО)) КАК Значение
	               |ИЗ
	               |	ВТ_ГрузоперевозкиИПараметры КАК ВТ_ГрузоперевозкиИПараметры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	               |		ПО ВТ_ГрузоперевозкиИПараметры.Ссылка = CW_ХарактеристикиГрузоперевозок.Грузоперевозка
	               |			И ВТ_ГрузоперевозкиИПараметры.Параметр = CW_ХарактеристикиГрузоперевозок.Параметр
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
	               |		ПО ВТ_ГрузоперевозкиИПараметры.Заказ = CW_ХарактеристикиЗаказов.Заказ
	               |			И ВТ_ГрузоперевозкиИПараметры.Параметр = CW_ХарактеристикиЗаказов.Параметр
	               |ИТОГИ ПО
	               |	Грузоперевозка";
	
	Запрос.УстановитьПараметр("мПараметры",			мПараметры);
	Запрос.УстановитьПараметр("мГрузоперевозки",	мГрузоперевозки);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГрузоперевозки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГрузоперевозки.Следующий() Цикл
		
		Отбор = Новый Структура("Грузоперевозка",ВыборкаГрузоперевозки.Грузоперевозка);
		мСтроки = ТаблицаУслуг.НайтиСтроки(Отбор);
		
		Выборка = ВыборкаГрузоперевозки.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ИмяПоля = СоответствиеИменПолей.Получить(Выборка.Параметр);
			Для Каждого СтрокаУслуг из мСтроки Цикл
				СтрокаУслуг[ИмяПоля] = Выборка.Значение;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СоответствиеСтрокаСвертки;
	
КонецФункции