&После("ОбработкаЗаполненияЭЭР")
Процедура САБ_ОбработкаЗаполненияЭЭР(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.ЭлектронноеПоручениеЭкспедитору") Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
	
	Если ДанныеЗаполнения.ЭтоВходящий = Истина Тогда
		ДокументОбъект.СсылкаТитулЭкспедитораЭкспедитор = ДанныеЗаполнения.СсылкаТитулЗаказчикаЭкспедитор;
		ДокументОбъект.СсылкаТитулЭкспедитораЗаказчик   = ДанныеЗаполнения.СсылкаТитулЗаказчикаЗаказчик;
	Иначе
		ДокументОбъект.СсылкаТитулЭкспедитораЭкспедитор = ДанныеЗаполнения.СсылкаТитулЗаказчикаЗаказчик;
		ДокументОбъект.СсылкаТитулЭкспедитораЗаказчик   = ДанныеЗаполнения.СсылкаТитулЗаказчикаЭкспедитор;
	КонецЕсли;
	
	ДокументОбъект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЭР_Титул1");
	ДокументОбъект.РольУчастника = 3;
	
	ОбменСГИСЭПДБП.ДобавитьДокументОснование(ДокументОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

&После("ОбработкаЗаполненияЭЗЗ")
Процедура САБ_ОбработкаЗаполненияЭЗЗ(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.ЭлектронноеПоручениеЭкспедитору") Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
	
	Если ДанныеЗаполнения.ЭтоВходящий = Истина Тогда
		ДокументОбъект.СсылкаТитулГрузоотправителяГрузоотправитель = ДанныеЗаполнения.СсылкаТитулЗаказчикаЭкспедитор;
		ДокументОбъект.СсылкаТитулГрузоотправителяПеревозчик      = ДанныеЗаполнения.СсылкаТитулЗаказчикаЗаказчик;
	Иначе
		ДокументОбъект.СсылкаТитулГрузоотправителяГрузоотправитель = ДанныеЗаполнения.СсылкаТитулЗаказчикаЗаказчик;
		ДокументОбъект.СсылкаТитулГрузоотправителяПеревозчик      = ДанныеЗаполнения.СсылкаТитулЗаказчикаЭкспедитор;
	КонецЕсли;
	
	ДокументОбъект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1");
	ДокументОбъект.РольУчастника = 3;
	
	ОбменСГИСЭПДБП.ДобавитьДокументОснование(ДокументОбъект, ДанныеЗаполнения);
	
КонецПроцедуры