&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Параметры.Свойство("ДокументРеализации", ДокументРеализации);     
	Элементы.ДокументРеализацииОтбор.Видимость = ЗначениеЗаполнено(ДокументРеализации);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
//	CW_РеестрыНДС0Клиент.СписокПередНачаломДобавления(ЭтаФорма,Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры 

&НаКлиенте
Процедура ИзменитьРеквизитыОбъектов(Команда)     
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	МассивРеквизитов = Новый Массив;
	
	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"ПериодОтчета");
	ДанныеРеквизита.Вставить("Заголовок", 	"Период отчета");
	ДанныеРеквизита.Вставить("Значение", 	НачалоКвартала(ТекущаяДата()));

	МассивРеквизитов.Добавить(ДанныеРеквизита);  
	
	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"ПодтверждениеНДС");
	ДанныеРеквизита.Вставить("Заголовок", 	"Подтверждение НДС");
	ДанныеРеквизита.Вставить("Значение", 	ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0СтатусыЗаписиРеестра.ПустаяСсылка"));

	МассивРеквизитов.Добавить(ДанныеРеквизита);  
	
	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"Организация");
	ДанныеРеквизита.Вставить("Заголовок", 	"Организация");
	ДанныеРеквизита.Вставить("Значение", 	ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")); 
	
	МассивРеквизитов.Добавить(ДанныеРеквизита);  
	
 	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 		"Заблокирован");
	ДанныеРеквизита.Вставить("Заголовок", 	"Заблокирован");
	ДанныеРеквизита.Вставить("Значение", 	Ложь);

	МассивРеквизитов.Добавить(ДанныеРеквизита);  
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("РедактируемыеРеквизиты", МассивРеквизитов); 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьРедактированиеРеквизитов", ЭтотОбъект, ДополнительныеПараметры);	
	
	ОткрытьФорму("Справочник.CW_РеестрыНДС0ЗаписиРеестра.Форма.ФормаГрупповогоИзмененияРеквизитов", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьРедактированиеРеквизитов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Ссылки", 				ДополнительныеПараметры.ВыделенныеСтроки); 
	ПараметрыПроцедуры.Вставить("ЗначенияРеквизитов",	РезультатВыбора);
	
	РезультатВыполнения =  НачатьИзменениеРеквизитовВФоне(ПараметрыПроцедуры);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьФоновоеРедактированиеРеквизитов", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры    

&НаСервере
Функция НачатьИзменениеРеквизитовВФоне(ПараметрыПроцедуры)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Редактирование реквизитов";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_РеестрыНДС0ЗаписиРеестра.ВыполнитьИзменениеРеквитовОбъетов", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции 

&НаКлиенте
Процедура ЗавершитьФоновоеРедактированиеРеквизитов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_РеестрыНДС0ЗаписиРеестра"));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось изменить реквизты!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка изменения реквизитов");
	КонецЕсли;
	
КонецПроцедуры

