
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = (Параметры.ТолькоПросмотр = Истина);  // также может быть Неопределено
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОбработчикиОбновления(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Будут выполнены текущий обработчик обновления. Продоложить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;                                   
	
	КлючЗаписи = Новый Структура;
	КлючЗаписи.Вставить("ИмяОбработчика", Запись.ИмяОбработчика);
	
	МассивКлючей = Новый Массив;
	МассивКлючей.Добавить(КлючЗаписи);
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("МассивКлючей", МассивКлючей); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыполнениеОбработчиков", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.CW_ОбработчикиОбновления.Форма.ФормаВыполненияОбработчиковОбновления", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры      

&НаКлиенте
Процедура ЗавершитьВыполнениеОбработчиков(РезультатВыплнения, ДополнительныеПараметры) Экспорт  
	
	Если ТипЗнч(РезультатВыплнения) <> тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыплнения.Ошибка Тогда 
		
		ПоказатьПредупреждение(, "В процессе выполнения обработчиков возникли ошибки.
								 |Подробно см. журнал регистрации");
		
	ИначеЕсли РезультатВыплнения.ТребуетсяПерезапуск Тогда  
		
		ПоказатьПредупреждение(, "Для продолжения работы необходимо выполнить перезапуск программы!");	
		
	КонецЕсли;   
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры