// возвращает ссылку по строковому описанию метаданного
Функция МетаданноеКонфигурации(Знач СтроковыйИдентификатор) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектМетаданоеКонфигурации = Справочники.CW_МетаданныеКонфигурации.НайтиПоНаименованию(СокрЛП(СтроковыйИдентификатор),Истина);
	
	Если ОбъектМетаданоеКонфигурации.Пустая() Тогда
		//Создаем новый объект
		ОбъектМетаданоеКонфигурации 						= Справочники.CW_МетаданныеКонфигурации.СоздатьЭлемент();
		ОбъектМетаданоеКонфигурации.Наименование 			= СокрЛП(СтроковыйИдентификатор);
		ОбъектМетаданоеКонфигурации.ОбменДанными.Загрузка 	= Истина;
		ОбъектМетаданоеКонфигурации.Записать();
	КонецЕсли;
	
	Возврат ОбъектМетаданоеКонфигурации.Ссылка;

КонецФункции

Функция МетаданноеРегистрируется(МС) Экспорт 
	// --- 
	
	МассивОбменов = Новый Массив;
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_МетаданныеДляРегистрации.Обмен,
	               |	CW_МетаданныеДляРегистрации.ПроверкаПередЗаписью КАК ПередЗаписью,
	               |	CW_МетаданныеДляРегистрации.ПроверкаПриЗаписи КАК ПриЗаписи,
	               |	CW_МетаданныеДляРегистрации.ПроверкаПередУдалением Как ПередУдалением
	               |ИЗ
	               |	РегистрСведений.CW_МетаданныеДляРегистрации КАК CW_МетаданныеДляРегистрации
	               |ГДЕ
	               |	CW_МетаданныеДляРегистрации.Метаданное = &Метаданное
	               |	И CW_МетаданныеДляРегистрации.Обмен.Использование = ИСТИНА";
	Запрос.УстановитьПараметр("Метаданное", МС);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из ТЗ Цикл
		
		СО = _сф.ст_Создать("Обмен,ПередЗаписью,ПриЗаписи,ПередУдалением",Стр);
		МассивОбменов.Добавить(СО);
		
	КонецЦикла;  
	Если ТЗ.Количество() = 0 Тогда
		
		Возврат(_УФКС.Ответ(1));
		
	Иначе
		
		Ответ = _УФКС.Ответ();
		_сф.ст_УстановитьСвойство(Ответ,"МассивОбменов",МассивОбменов);
		Возврат(Ответ);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

Функция ПолучитьДанныеПоВнешнейПодписке(СсылкаНаМетаданное, Событие) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВнешниеПодписки.Ссылка КАК ВнешняяПодписка,
	               |	CW_ВнешниеПодписки.Порядок КАК Порядок,
	               |	CW_ВнешниеПодписки.Обработка КАК Обработка
	               |ИЗ
	               |	Справочник.CW_ВнешниеПодписки КАК CW_ВнешниеПодписки
	               |ГДЕ
	               |	CW_ВнешниеПодписки.ВидПодписки = &Событие
	               |	И CW_ВнешниеПодписки.НеИспользуется = ЛОЖЬ
	               |	И CW_ВнешниеПодписки.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ВнешниеПодписки.МетаданноеПодписки = &СсылкаМетаданное
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок,
	               |	ВнешняяПодписка";
	
	Запрос.УстановитьПараметр("СсылкаМетаданное", СсылкаНаМетаданное);
	Запрос.УстановитьПараметр("Событие"			, Событие);
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьИмяМетаданногоПоИмениФормы(ИмяФормыОбъекта) Экспорт
	
	мДанныеФормы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяФормыОбъекта,".");
	
	ИмяОбъектаМетаданных = "";
	Если мДанныеФормы.Количество() > 0 Тогда
		ИмяОбъектаМетаданных = мДанныеФормы[0]+"."+мДанныеФормы[1];
	КонецЕсли;
	
	Возврат ИмяОбъектаМетаданных;
	
КонецФункции

Функция ПолучитьИмяФормыПоПолномуИмениФормы(ИмяФормыОбъекта) Экспорт
	
	мДанныеФормы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяФормыОбъекта,".");
	
	Если мДанныеФормы.Количество() > 0 Тогда
		Возврат мДанныеФормы[мДанныеФормы.Количество()-1];
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьИмяОбъектаМатаданныхПоИмениФормы(ИмяФормыОбъекта) Экспорт
	
	мДанныеФормы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяФормыОбъекта,".");
	
	ИмяОбъектаМетаданных = "";
	Если мДанныеФормы.Количество() > 1 Тогда
		ИмяОбъектаМетаданных = мДанныеФормы[1];
	КонецЕсли;
	
	Возврат ИмяОбъектаМетаданных;
	
КонецФункции

