&НаКлиенте
Процедура СохранитьВложение(Команда)
	
	СтрокаТЧ = Объект.Вложения.НайтиПоИдентификатору(Элементы.Вложения.ТекущаяСтрока);
	
	СтруктураОтвета = _ПолучитьВложениеПисьма(СтрокаТЧ.НомерСтроки);
	
	Если СтруктураОтвета.Код = 0 Тогда
		
		// --- получаем файл
		ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
		ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
		
		НачатьПолучениеФайлаССервера(СтруктураОтвета.АдресФайла,СтрокаТЧ.ИмяФайла,ПараметрыДиалогаПолученияФайлов);
		
		
	Иначе
		
		Сообщить(СтруктураОтвета.ОписаниеОшибки);
		
	КонецЕсли; 

	
КонецПроцедуры

&НаСервере
Функция _ПолучитьВложениеПисьма(Знач СтрокаТЧ)
	// --- 
	
	Ответ = _УФКС.Ответ(0);
	
	Попытка
		
		Справочник = РеквизитФормыВЗначение("Объект");
		
		СтрокаТЧ = Справочник.Вложения[СтрокаТЧ-1];
		Ответ.Вставить("АдресФайла",ПоместитьВоВременноеХранилище(СтрокаТЧ.Вложение.Получить(),УникальныйИдентификатор));

		ЗначениеВРеквизитФормы(Справочник,"Объект");
		
		Возврат(Ответ);
		
	Исключение
		
		Ответ.Код = 1;
		Ответ.ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат(Ответ);
		
	КонецПопытки; 
	
	// --- 
КонецФункции
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СохранитьТекст(Команда)
	
	СтрокаТЧ = Объект.Тексты.НайтиПоИдентификатору(Элементы.Тексты.ТекущаяСтрока);
	
	СтруктураОтвета = _ПолучитьТекстПисьма(СтрокаТЧ.НомерСтроки);
	
	Если СтруктураОтвета.Код = 0 Тогда
		
		// --- получаем файл
		ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
		ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
		
		НачатьПолучениеФайлаССервера(СтруктураОтвета.АдресФайла,"Текст"+СтрокаТЧ.НомерСтроки+".txt",ПараметрыДиалогаПолученияФайлов);
		
	Иначе
		
		Сообщить(СтруктураОтвета.ОписаниеОшибки);
		
	КонецЕсли; 

	
КонецПроцедуры

&НаСервере
Функция _ПолучитьТекстПисьма(Знач СтрокаТЧ)
	// --- 
	
	Ответ = _УФКС.Ответ(0);
	
	Попытка
		
		Справочник = РеквизитФормыВЗначение("Объект");
		
		СтрокаТЧ = Справочник.Тексты[СтрокаТЧ-1];
		Ответ.Вставить("АдресФайла",ПоместитьВоВременноеХранилище(СтрокаТЧ.ДД.Получить(),УникальныйИдентификатор));

		ЗначениеВРеквизитФормы(Справочник,"Объект");
		
		Возврат(Ответ);
		
	Исключение
		
		Ответ.Код = 1;
		Ответ.ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат(Ответ);
		
	КонецПопытки; 
		
	// --- 
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДанныеОтправки();
	
	СтатусОбработки = РегистрыСведений.CW_СтатусОбработкиЭлектронныхПисем.ПолучитьСтатусОбработки(Объект.Ссылка);
	
	Элементы.ГруппаСостояние.Видимость = ЗначениеЗаполнено(Объект.СсылкаНаОбъект);
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеОтправки()
	
	Если Объект.СсылкаНаОбъект.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПризнакОтправкиПоЭлектроннойПочте.Документ КАК Документ,
	               |	CW_ПризнакОтправкиПоЭлектроннойПочте.ДатаОтправки КАК ДатаОтправки,
	               |	CW_ПризнакОтправкиПоЭлектроннойПочте.СтатусОтправки КАК СтатусОтправки
	               |ИЗ
	               |	РегистрСведений.CW_ПризнакОтправкиПоЭлектроннойПочте КАК CW_ПризнакОтправкиПоЭлектроннойПочте
	               |ГДЕ
	               |	CW_ПризнакОтправкиПоЭлектроннойПочте.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Объект.СсылкаНаОбъект);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаОтправки 	= Выборка.ДатаОтправки;
		СтатусОтправки 	= Выборка.СтатусОтправки;
	Конецесли;
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти


 
