
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ---------------------------------------------------------------------------- 
	
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	Если (ЗначениеЗаполнено(ЗначениеКопирования)) Тогда
		АдресПрайса = ПоместитьВоВременноеХранилище(ЗначениеКопирования.ХранилищеПрайса.Получить(),ЭтаФорма.УникальныйИдентификатор);
	Иначе
		АдресПрайса = ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("Объект").ХранилищеПрайса.Получить(),ЭтаФорма.УникальныйИдентификатор);	
		Если (Объект.Ссылка.Пустая()) Тогда
			Объект.ВидКонтрагента = Перечисления.CW_ВидыКонтрагентов.Поставщик;	
		КонецЕсли; 
	КонецЕсли; 
	
	_СформироватьЗаголовок();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

// --- 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если (ЭтоАдресВременногоХранилища(АдресПрайса)) Тогда
		Нечто = ПолучитьИзВременногоХранилища(АдресПрайса);
		ТекущийОбъект.ХранилищеПрайса = Новый ХранилищеЗначения(Нечто);
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТипПрайсаПриИзменении(Элемент)
	АдресПрайса = "";
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РедактироватьПрайс(Команда)
	
	Если (Объект.ВидКонтрагента.Пустая()) Тогда
		
		_УФК.ВывестиПредупреждение("Не указан вид контрагента!");
		Возврат;
		
	КонецЕсли; 
	Если (Объект.Контрагент.Пустая()) Тогда
		
		_УФК.ВывестиПредупреждение("Не указан контрагент!");
		Возврат;
		
	КонецЕсли; 
	Если (Объект.ТипПрайса.Пустая()) Тогда
		
		_УФК.ВывестиПредупреждение("Не указан тип прайса!");
		Возврат;
		
	КонецЕсли; 
	// --- 
	
	ИмяФормыРедактирования = _ИмяФормыРедактирования();
	Если ИмяФормыРедактирования <> Неопределено Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработатьИзменениеПрайса",ЭтотОбъект); 
		ПФ = Новый Структура("ТипПрайса,АдресПрайса,УИД, СтруктураОбъектаПрайса", Объект.ТипПрайса, АдресПрайса, ЭтаФорма.УникальныйИдентификатор, Объект);
		ОткрытьФорму(ИмяФормыРедактирования,ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПрайса(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		АдресПрайса = Ответ;
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ИмяФормыРедактирования()
	// --- 
	
	// подключаем обработку, вдруг ещё не подключена
	_ПО.ПодключитьОбработку(Объект.ТипПрайса.Обработка);
	Возврат(_ПО.ПолучитьПолноеИмяФормыПоТипу(Объект.ТипПрайса.Обработка,"ФормаРедактирования"));
	
	// --- 
КонецФункции

&НаСервере
Функция _СформироватьЗаголовок()
	
	ЗаголовокДокумента = "Прайс контрагента " +  
		 ?(ЗначениеЗаполнено(Объект.Ссылка), " "+Объект.Номер+" от "+Объект.Дата, " (создание)")
	;
	ЭтаФорма.Заголовок = ЗаголовокДокумента;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;

КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры

