
Функция ПолучитьСписокДоступныхОрганизаций(ГруппаПользователей) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОрганизацииДоступныеПоГруппамПользователей.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.CW_ОрганизацииДоступныеПоГруппамПользователей КАК CW_ОрганизацииДоступныеПоГруппамПользователей
	|ГДЕ
	|	CW_ОрганизацииДоступныеПоГруппамПользователей.ГруппаПользователей = &ГруппаПользователей";
	
	Запрос.УстановитьПараметр("ГруппаПользователей", ГруппаПользователей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура ЗаписатьСписокДоступныхОрганизаций(ГруппаПользователей, ТаблицаНабора) Экспорт 
	
	Набор = РегистрыСведений.CW_ОрганизацииДоступныеПоГруппамПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.ГруппаПользователей.Установить(ГруппаПользователей);
	Набор.Прочитать();
	
	Набор.Загрузить(ТаблицаНабора);
	
	Набор.Записать(Истина);
	
КонецПроцедуры   

Функция ПолучитьПустуюТаблицуНабора() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	               |	CW_ОрганизацииДоступныеПоГруппамПользователей.ГруппаПользователей КАК ГруппаПользователей,
	               |	CW_ОрганизацииДоступныеПоГруппамПользователей.Организация КАК Организация
	               |ИЗ
	               |	РегистрСведений.CW_ОрганизацииДоступныеПоГруппамПользователей КАК CW_ОрганизацииДоступныеПоГруппамПользователей";
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции


