&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокОбъектовПараметра.Добавить("Грузоперевозка",,Истина);
	СписокОбъектовПараметра.Добавить("Заказ");
	СписокОбъектовПараметра.Добавить("Заявка");     
	
	ИсключатьВнутрихолдинговыеВзаиморасчеты = CW_Настройки.ПолучитьНастройкуПользователя(,"ИсключатьВнутрихолдинговыеВзаиморасчеты");
	
	Параметры.Свойство("СформироватьПриОткрытии", СформироватьПриОткрытии);  
	
	Параметры.Свойство("ВнешнийВызов", Отчет.ВнешнийВызов);
	Если Отчет.ВнешнийВызов Тогда
		ПФ = Новый Структура("Отбор,Группировки,Параметры,Разделы,Показатели");
		ЗаполнитьЗначенияСвойств(ПФ, Параметры);   
		
		Если Параметры.Свойство("НачалоПериода") Тогда
			НачалоПериода = Параметры.НачалоПериода;
		КонецЕсли;
		Если Параметры.Свойство("КонецПериода") Тогда
			КонецПериода = Параметры.КонецПериода;
		КонецЕсли;
		Если Параметры.Свойство("ВерсияБюджета") Тогда
			ВерсияБюджета = Параметры.ВерсияБюджета;
		КонецЕсли;
		Если Параметры.Свойство("ОбъединитьГруппировки") Тогда
			ОбъединитьГруппировки = Параметры.ОбъединитьГруппировки;
		КонецЕсли;
		Если Параметры.Свойство("ВыводитьРасходыДоходы") Тогда
			ВыводитьРасходыДоходы = Параметры.ВыводитьРасходыДоходы;
		КонецЕсли;
		Если Параметры.Свойство("ПолучитьРасходыПоПутевымЛистам") Тогда
			ПолучитьРасходыПоПутевымЛистам = Параметры.ПолучитьРасходыПоПутевымЛистам;
		КонецЕсли;
		Если Параметры.Свойство("ВыводитьСтатистику") Тогда
			ВыводитьСтатистику = Параметры.ВыводитьСтатистику;
		КонецЕсли;               
		Если Параметры.Свойство("ВыводитьСтатистикуПалн") Тогда
			ВыводитьСтатистикуПлан = Параметры.ВыводитьСтатистикуПлан;
		КонецЕсли;               
		Если Параметры.Свойство("ИсключатьВнутрихолдинговыеВзаиморасчеты") Тогда
			ИсключатьВнутрихолдинговыеВзаиморасчеты = Параметры.ИсключатьВнутрихолдинговыеВзаиморасчеты;
		КонецЕсли;
		Если Параметры.Свойство("ВариантФормирования") Тогда
			ВариантФормирования = Параметры.ВариантФормирования;
		КонецЕсли;
		Если Параметры.Свойство("ПорядокОтражения") Тогда
			ПорядокОтражения = Параметры.ПорядокОтражения;
		КонецЕсли;
		Если Параметры.Свойство("ДатаОпределенияПрибылиПолучаемоеЗначение") Тогда
			ДатаОпределенияПрибылиПолучаемоеЗначение = Параметры.ДатаОпределенияПрибылиПолучаемоеЗначение;
		КонецЕсли;
		Если Параметры.Свойство("ДатаОпределенияПрибыли") Тогда
			ДатаОпределенияПрибыли = Параметры.ДатаОпределенияПрибыли;
		КонецЕсли;
		Если Параметры.Свойство("Данные") Тогда
			Данные = Параметры.Данные;
		КонецЕсли;
		Если Параметры.Свойство("Грузоперевозки") Тогда 
			Если ТипЗнч(Параметры.Грузоперевозки) = Тип("Массив") Тогда
				Грузоперевозки.ЗагрузитьЗначения(Параметры.Грузоперевозки);
			КонецЕсли;
		КонецЕсли;
		
		Отчет.АдресВнешнихНастроек = ПоместитьВоВременноеХранилище(ПФ, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	// ---------------------------------------------------------------------------- 
	
	ИспользованиеБюджетирования = ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования");
	

	// параметры
	ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
	
	// показатели
	Показатели.Добавить("Сумма",,Истина);
	Показатели.Добавить("НДС",,Истина);
	Показатели.Добавить("Всего",,Истина);
	
	// разделы
	Разделы.Добавить("План",,Истина);	
	Разделы.Добавить("Факт",,Истина);
	Разделы.Добавить("Отклонение",,Истина);	
		
	// группировки
	Нстр = Группировки.Добавить();
	Нстр.ИмяПоля = "Грузоперевозка.Клиент";
	Нстр.Представление = "Клиент";
	Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
	// --- 
	Нстр = Группировки.Добавить();
	Нстр.ИмяПоля = "Грузоперевозка";
	Нстр.Представление = "Грузоперевозка";
	Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
	
	ПолучитьСписокПолейДляОтбораПоИнтервалу(Элементы.ДатаОпределенияПрибыли.СписокВыбора);
	
	_ВосстановитьСеансовуюНастройку(); 
	
	Если НЕ ИспользованиеБюджетирования Тогда
		Элементы.ВерсияБюджета.Видимость = Ложь;
	КонецЕсли;   
	
	_УправлениеЭлементамиФормы();

	//Работа с буфером обмена
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена());
	//Работа с буфером обмена
	
	ДатаОпределенияПрибылиПолучаемоеЗначение = "Значение";

	УстановитьВидимостьПолучаемогоЗначения();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если (НЕ Отчет.ВнешнийВызов) Тогда
		_ВосстановитьСтандартныеНастройки();
		_ВосстановитьСеансовуюНастройку();	
		Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
			НачалоПериода = НачалоМесяца(ТекущаяДата());
			КонецПериода  = КонецМесяца(ТекущаяДата());
		КонецЕсли;
	КонецЕсли; 
	
	// --- 
	
	Если (Отчет.ВнешнийВызов) Тогда
		
		_ОбработатьВнешниеПараметры();
		_ВосстановитьСеансовуюНастройку();
		_УправлениеЭлементамиФормы();  
		
		Если СформироватьПриОткрытии Тогда
			Сформировать(Неопределено);       
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;		
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	
	//БухгалтерскиеОтчетыКлиент
	БухгалтерскиеОтчетыКлиент.НачатьРасчетСуммыВыделенныхЯчеек(
		Элементы.Результат,
		ЭтотОбъект,
		"Подключаемый_РезультатПриАктивизацииПодключаемый");
	//---БухгалтерскиеОтчетыКлиент

КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ОбработатьВнешниеПараметры()
	
	СП = ПолучитьИзВременногоХранилища(Отчет.АдресВнешнихНастроек);
	// ---------------------------------------------------------------------------- 
	
	// параметры
	СП.Параметры.Свойство("Данные",Данные);
	// --- 
	СП.Параметры.Свойство("ДатаОпределенияПрибыли",ДатаОпределенияПрибыли);
	
	СП.Параметры.Свойство("Грузоперевозки",Грузоперевозки);
	Если (Грузоперевозки.Количество() = 0) Тогда
		Если (СП.Параметры.Свойство("Грузоперевозка")) Тогда
			Грузоперевозки.Добавить(СП.Параметры.Грузоперевозка);
		КонецЕсли; 
		Если (СП.Параметры.Свойство("Заказ")) Тогда
			МассивГП = CW_Мониторинг.ГрузоперевозкиЗаказа(СП.Параметры.Заказ);
			Грузоперевозки.ЗагрузитьЗначения(МассивГП);
		КонецЕсли; 
	КонецЕсли; 
	
	СП.Параметры.Свойство("НачалоПериода",НачалоПериода);
	СП.Параметры.Свойство("КонецПериода",КонецПериода);
	// --- 
	СП.Параметры.Свойство("ВариантФормирования",ВариантФормирования);
	Если (НЕ СП.Параметры.Свойство("ВариантФормирования")) Тогда
		// получаем из настроек пользователя
		// ...
	КонецЕсли; 
	СП.Параметры.Свойство("ИсключатьВнутрихолдинговыеВзаиморасчеты",ИсключатьВнутрихолдинговыеВзаиморасчеты);
	СП.Параметры.Свойство("ВыводитьРасходыДоходы",ВыводитьРасходыДоходы);
	СП.Параметры.Свойство("ОбъединитьГруппировки",ОбъединитьГруппировки);
	СП.Параметры.Свойство("ВыводитьСтатистику",ВыводитьСтатистику); 
	СП.Параметры.Свойство("ВыводитьСтатистикуПлан",ВыводитьСтатистикуПлан); 
	СП.Параметры.Свойство("ПорядокОтражения",ПорядокОтражения);
	// --- 
	СП.Параметры.Свойство("Организация",Организация);
	СП.Параметры.Свойство("ВерсияБюджета",ВерсияБюджета);
	
	Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
		ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
	КонецЕсли; 
	
	// разделы - массив идентификаторов
	Если (СП.Свойство("Разделы")) Тогда
		МассивРазделов = СП.Разделы;
		Если (МассивРазделов <> Неопределено) Тогда
			Для каждого ЭлементРаздела Из Разделы Цикл
				
				Если (МассивРазделов.Найти(ЭлементРаздела.Значение) <> Неопределено) Тогда
					ЭлементРаздела.Пометка = Истина;
				Иначе
					ЭлементРаздела.Пометка = Ложь;
				КонецЕсли; 
				
			КонецЦикла; 
		КонецЕсли;	
	КонецЕсли; 
	 
	
	// показатели - массив идентификаторов
	Если (СП.Свойство("Показатели")) Тогда
		МассивПоказателей = СП.Показатели;
		Если (МассивПоказателей <> Неопределено) Тогда
			Для каждого ЭлементПоказателя Из Показатели Цикл
				
				Если (МассивПоказателей.Найти(ЭлементПоказателя.Значение) <> Неопределено) Тогда
					ЭлементПоказателя.Пометка = Истина;
				Иначе
					ЭлементПоказателя.Пометка = Ложь;
				КонецЕсли; 
				
			КонецЦикла; 
		КонецЕсли;	
	КонецЕсли; 
	
	
	// группировки - список идентификаторов с представлениями
	СГ =  _сф.ст_ПолучитьСвойство(СП,"Группировки");
	Если (СГ <> Неопределено) Тогда
		
		Группировки.Очистить();
		Для каждого Стр Из СГ Цикл
			Нстр = Группировки.Добавить();
			Нстр.ИмяПоля = Стр.Значение;
			Нстр.Представление = Стр.Представление;
			Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
		КонецЦикла; 
		
	КонецЕсли; 
	
	Отчет.ВнешнийВызов = Ложь;

КонецПроцедуры


&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_АнализПрибылиПоГрузоперевозкам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	// --- 
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("Показатели",Показатели);
			СеансоваяНастройка.Свойство("ОбъединитьГруппировки", ОбъединитьГруппировки);
			СеансоваяНастройка.Свойство("ПолучитьРасходыПоПутевымЛистам", ПолучитьРасходыПоПутевымЛистам);
			Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования") Тогда
				СеансоваяНастройка.Свойство("Разделы", Разделы);
				Если Разделы.Количество() = 1 Тогда
					Разделы.Вставить(0, "План", , Ложь);
					Разделы.Добавить("Отклонение", , Ложь);
				КонецЕсли;	
				СеансоваяНастройка.Свойство("ВерсияБюджета",ВерсияБюджета);
				Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
					ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
				КонецЕсли;	
			Иначе
				Разделы.Очистить();
				Разделы.Добавить("Факт",,Истина);
				Элементы.ВерсияБюджета.Видимость = Ложь;
			КонецЕсли;	
			СеансоваяНастройка.Свойство("ВариантФормирования",ВариантФормирования);
			СеансоваяНастройка.Свойство("ВыводитьРасходыДоходы",ВыводитьРасходыДоходы);
			СеансоваяНастройка.Свойство("ДатаОпределенияПрибыли",ДатаОпределенияПрибыли);
			Если НЕ ЗначениеЗаполнено(ДатаОпределенияПрибыли) Тогда
				ДатаОпределенияПрибыли = Элементы.ДатаОпределенияПрибыли.СписокВыбора.НайтиПоЗначению("Реквизит.ДатаЗакрытия");
			КонецЕсли;		
			СеансоваяНастройка.Свойство("Организация",Организация);
			СеансоваяНастройка.Свойство("ВыводитьСтатистику",ВыводитьСтатистику); 
			СеансоваяНастройка.Свойство("ВыводитьСтатистикуПлан",ВыводитьСтатистикуПлан); 
			СеансоваяНастройка.Свойство("ПорядокОтражения",ПорядокОтражения);  
			
			Если СеансоваяНастройка.Свойство("МассивОбъектовПараметра") 
				и ТипЗнч(СеансоваяНастройка.МассивОбъектовПараметра) = Тип("Массив") Тогда
				
				Отмечено = 0;
				Для Каждого ЭлементСписка из СписокОбъектовПараметра Цикл
					ЭлементСписка.Пометка = СеансоваяНастройка.МассивОбъектовПараметра.Найти(ЭлементСписка.Значение) <> Неопределено;   
					Отмечено = Отмечено +?(ЭлементСписка.Пометка, 1,0);
				КонецЦикла;  
				
				Если Отмечено = 0 Тогда
					ЭлементСписка = СписокОбъектовПараметра.НайтиПоЗначению("Грузоперевозка");
					Если ЭлементСписка <> Неопределено Тогда
						ЭлементСписка.Пометка = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	// --- 
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Показатели",Показатели);
	СтруктураНастройки.Вставить("Разделы",Разделы);
	СтруктураНастройки.Вставить("Группировки",Группировки.Выгрузить());
	СтруктураНастройки.Вставить("ВариантФормирования",ВариантФормирования);
	СтруктураНастройки.Вставить("ВерсияБюджета",ВерсияБюджета);
	СтруктураНастройки.Вставить("ВыводитьРасходыДоходы",ВыводитьРасходыДоходы);
	СтруктураНастройки.Вставить("ДатаОпределенияПрибыли",ДатаОпределенияПрибыли);
	СтруктураНастройки.Вставить("Организация",Организация);
	СтруктураНастройки.Вставить("ВыводитьСтатистику",ВыводитьСтатистику);   
	СтруктураНастройки.Вставить("ВыводитьСтатистикуПлан",ВыводитьСтатистикуПлан);   
	СтруктураНастройки.Вставить("ПорядокОтражения",ПорядокОтражения);
	СтруктураНастройки.Вставить("ОбъединитьГруппировки", ОбъединитьГруппировки);
	СтруктураНастройки.Вставить("ПолучитьРасходыПоПутевымЛистам", ПолучитьРасходыПоПутевымЛистам); 
	
	СохраняемыеЗначенияОбъектовПараметра = Новый Массив;
	Для Каждого ЭлементСписка из СписокОбъектовПараметра Цикл   
		Если ЭлементСписка.Пометка Тогда
			СохраняемыеЗначенияОбъектовПараметра.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	СтруктураНастройки.Вставить("МассивОбъектовПараметра", СохраняемыеЗначенияОбъектовПараметра); 

	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

&НаСервере
Функция _УправлениеЭлементамиФормы()
	
	ПоГрузоперевозкам = (Данные = 1);

	Элементы.Грузоперевозки.Видимость = ПоГрузоперевозкам;
	Элементы.БуферОбменаВставитьДляРеквизита.Видимость = ПоГрузоперевозкам;
	Элементы.ГруппаПериод.Видимость = (НЕ ПоГрузоперевозкам);
	Элементы.ДатаОпределенияПрибыли.Видимость = (НЕ ПоГрузоперевозкам);
	Элементы.ГруппаПараметрИЗначение.Видимость 	= (Данные =0);
	Элементы.ГруппаОбъектыПраметров.Видимость 	= (Данные =0) и ВыбранПараметрНаСервере();
	
	Элементы.ПолучитьРасходыПоПутевымЛистам.Доступность = ПорядокОтражения <> 2 и ВариантФормирования = 0;
	
	Если (ИспользованиеБюджетирования) Тогда
		ЕстьПлан = Ложь;
		Для каждого Стр Из Разделы Цикл
			Если ((Стр.Значение = "План" ИЛИ Стр.Значение = "Отклонение") И Стр.Пометка) Тогда
				ЕстьПлан = Истина;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		Элементы.ВерсияБюджета.Видимость = ЕстьПлан;
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	_Настройка(Истина);
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	// --- 
	
	Раздел = Ложь;
	Для Каждого Стр из Разделы Цикл
		Раздел = ?(Стр.Пометка, Истина, Раздел);
	КонецЦикла;
	Если НЕ Раздел Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного раздела!");
		Возврат;		
	КонецЕсли;	
	
	Показатель = Ложь;
	Для Каждого Стр из Показатели Цикл
		Показатель = ?(Стр.Пометка, Истина, Показатель);
	КонецЦикла;
	Если НЕ Показатель Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного показателя!");
		Возврат;		
	КонецЕсли;	
	
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	ОбработатьОтчет();
	
	Отчет.ВнешнийВызов = Ложь;	
	// --- 
	
	_СохранитьСеансовуюНастройку();
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	// --- 
	
	Настройки = _сф.ст_Создать("Данные,ВариантФормирования,НачалоПериода,КонецПериода,ВерсияБюджета,Организация,ВыводитьРасходыДоходы,ДатаОпределенияПрибыли,ПолучаемоеЗначение,Показатели,Разделы,Группировки,ИсключатьВнутрихолдинговыеВзаиморасчеты,ПорядокОтражения,ВыводитьСтатистику,ВыводитьСтатистикуПлан,Грузоперевозки,ОбъединитьГруппировки,ПолучитьРасходыПоПутевымЛистам,ОбъектыПараметра");
	Настройки.Данные = Данные;
	Настройки.ВариантФормирования = ВариантФормирования;
	Настройки.ВыводитьРасходыДоходы = ВыводитьРасходыДоходы;
	
	Настройки.НачалоПериода = ?(Данные = 1, Неопределено,НачалоДня(НачалоПериода));
	Настройки.КонецПериода 	= ?(Данные = 1, Неопределено, КонецДня(КонецПериода));
	
	Настройки.ВерсияБюджета = ВерсияБюджета;
	Настройки.Организация 	= Организация;
	Настройки.Показатели 	= Показатели;
	Настройки.Разделы 		= Разделы;
	Настройки.Группировки 	= Группировки.Выгрузить();  
	
	Настройки.ДатаОпределенияПрибыли	= ДатаОпределенияПрибыли; 
	Настройки.ПолучаемоеЗначение		= ДатаОпределенияПрибылиПолучаемоеЗначение; 

	Настройки.ИсключатьВнутрихолдинговыеВзаиморасчеты = ИсключатьВнутрихолдинговыеВзаиморасчеты;
	Настройки.ПорядокОтражения 			= ПорядокОтражения;
	Настройки.ВыводитьСтатистику 		= ВыводитьСтатистику;
	Настройки.ВыводитьСтатистикуПлан 	= ВыводитьСтатистикуПлан;
	
	Настройки.Грузоперевозки 			= Грузоперевозки;
	Настройки.ОбъединитьГруппировки 	= ОбъединитьГруппировки;
	
	Настройки.ПолучитьРасходыПоПутевымЛистам 	= ПолучитьРасходыПоПутевымЛистам;    
	
	МассивОбъектовПараметра = Новый Массив;
	Для Каждого ЭлементСписка из СписокОбъектовПараметра Цикл   
		Если ЭлементСписка.Пометка Тогда
			МассивОбъектовПараметра.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Настройки.ОбъектыПараметра = МассивОбъектовПараметра;    
	
	Возврат ПоместитьВоВременноеХранилище(Настройки,ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "0:00:00", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "23:59:59", "");     
	//Удалено Заявка №AFR-240133 от 26.03.2024
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "План", "План", ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Факт", "Факт", ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Отклонение", "Отклонение", ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Расходы", "Расходы", ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Доходы", "Доходы", ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Прибыль", "Прибыль", ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Статистика", "Статистика", ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Количество", "Количество", ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "СредняяПрибыль", "Средняя прибыль", ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сумма", "Сумма", ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "НДС", "НДС", ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Всего", "Всего", ГоризонтальноеПоложение.Центр); 
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(Результат,"Анализ прибыли по грузоперевозкам");
	//УправлениеКолонтитулами

КонецПроцедуры	

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть=Ложь)
	// --- 
	
	Если Скрыть Тогда
		
		Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка=Ложь;
		
	Иначе
		
		Если Элементы.ГруппаНастройкиОтчета.Видимость Тогда
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка=Ложь;
			
		Иначе
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка=Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
		
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПолучитьСписокДоступныхГруппировок()
	// --- 
	
	//Возврат(_сф.сп_ОтобратьПоПометке(СписокГруппировок,Ложь));
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ГруппировкиПередУдалением(Элемент, Отказ)
	
	//УдаляемаяСтрока = Группировки.НайтиПоИдентификатору(Элементы.Группировки.ТекущаяСтрока);
	//Стр = СписокГруппировок.НайтиПоЗначению(УдаляемаяСтрока.ИмяПоля);
	//Если Стр <> Неопределено Тогда
	//	Стр.Пометка = Ложь;	
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда
		//СписокПолей.Добавить("Регистратор");
		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
    СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	// ---------------------------------------------------------------------------- 
	
    ДоступныеДействия = Новый Массив();
    ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
    
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных=РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура  ПолучитьСписокПолейДляОтбораПоИнтервалу(СписокЗначений) 
	
	Массив = Новый Массив;
	
	СписокЗначений.Очистить();
	СписокЗначений.Добавить("Реквизит.ДатаСделкиФ", 	"Дата грузоперевозки"		, , БиблиотекаКартинок.CW_Грузоперевозки);
	СписокЗначений.Добавить("Реквизит.ДатаЗакрытия", 	"Дата блокировки финансов"	, , БиблиотекаКартинок.CW_Грузоперевозки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка,
	|	CW_ПараметрыГрузоперевозок.Наименование КАК Наименование,
	|	CW_ПараметрыГрузоперевозок.ТипЗначения КАК ТипЗначения,
	|	CW_ПараметрыГрузоперевозок.Код КАК Код,
	|	CW_ПараметрыГрузоперевозок.ЭтоКонтрольнаяДата КАК ЭтоКонтрольнаяДата
	|ИЗ
	|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	|ГДЕ
	|	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	|	И CW_ПараметрыГрузоперевозок.ПометкаУдаления = ЛОЖЬ";  
	
	РезультатЗапрсоа = Запрос.Выполнить();
	Выборка = РезультатЗапрсоа.Выбрать();
	Пока Выборка.Следующий() Цикл   
		
		Если Выборка.ТипЗначения.СодержитТип(Тип("Дата")) Тогда      
			
			КартинкаДаты = БиблиотекаКартинок.Сегодня; 
			
			УИД_Парамтера = XMLСтрока(Выборка.Ссылка);
			Если Выборка.ЭтоКонтрольнаяДата Тогда
				КартинкаДаты = БиблиотекаКартинок.CW_КонтрольныеДаты; 
				Массив.Добавить(УИД_Парамтера);
			КонецЕсли;
			
			СписокЗначений.Добавить(УИД_Парамтера, СокрЛП(Выборка.Наименование), , КартинкаДаты);
		КонецЕсли; 
		
	КонецЦикла;    
	
	МассивКонтрольныеДаты = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	Диалог.Период.ДатаНачала = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПериод <> Неопределено) Тогда
		НачалоПериода = НачалоДня(ОтветПериод.ДатаНачала);
		КонецПериода  = КонецДня(ОтветПериод.ДатаОкончания);
		Период = ОтветПериод;
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВерсияБюджетаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
		ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьБазовуюВерсиюБюджета()
	
	тВерсияБюджета = CW_Бюджетирование.ПолучитьОсновнуюВерсиюБюджета();
	тВерсияБюджета = ?(ЗначениеЗаполнено(тВерсияБюджета), тВерсияБюджета, Справочники.CW_ВерсииБюджетов.Основная);
	
	Возврат тВерсияБюджета;
	
КонецФункции

&НаКлиенте
Процедура ДатаОпределенияПрибылиПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ДатаОпределенияПрибыли) Тогда
		ДатаОпределенияПрибыли = Элементы.ДатаОпределенияПрибыли.СписокВыбора.НайтиПоЗначению("Реквизит.ДатаЗакрытия");
	КонецЕсли;	

	Если МассивКонтрольныеДаты.Найти(ДатаОпределенияПрибыли) = Неопределено Тогда
		ДатаОпределенияПрибылиПолучаемоеЗначение = "Значение";
	Конецесли;  
	
	Элементы.ГруппаОбъектыПраметров.Видимость = ВыбранПараметрНаСервере();
	
	УстановитьВидимостьПолучаемогоЗначения();   

КонецПроцедуры 

&НаСервере
Функция ВыбранПараметрНаСервере()
	
	Попытка
		Параметр = XMLЗначение(Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок"), ДатаОпределенияПрибыли);
		Возврат Истина;
	Исключение       
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьПолучаемогоЗначения()
	
	Элементы.ДатаОпределенияПрибылиПолучаемоеЗначение.Видимость = (МассивКонтрольныеДаты.Найти(ДатаОпределенияПрибыли) <> Неопределено);

КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("Показатели",Показатели);
	Настройки.ДополнительныеСвойства.Вставить("Разделы",Разделы);
	//Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки.Выгрузить());
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); // ДанныеФормыКоллекция
	//Настройки.ДополнительныеСвойства.Вставить("НачалоПериода",НачалоПериода);
	//Настройки.ДополнительныеСвойства.Вставить("КонецПериода",КонецПериода);
	Настройки.ДополнительныеСвойства.Вставить("ВерсияБюджета",ВерсияБюджета);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьРасходыДоходы",ВыводитьРасходыДоходы);
	Настройки.ДополнительныеСвойства.Вставить("ДатаОпределенияПрибыли",ДатаОпределенияПрибыли);
	Настройки.ДополнительныеСвойства.Вставить("Организация",Организация);
	Настройки.ДополнительныеСвойства.Вставить("ИсключатьВнутрихолдинговыеВзаиморасчеты",ИсключатьВнутрихолдинговыеВзаиморасчеты);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьСтатистику",ВыводитьСтатистику);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьСтатистикуПлан",ВыводитьСтатистикуПлан);
	Настройки.ДополнительныеСвойства.Вставить("ПорядокОтражения",ПорядокОтражения);
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если НЕ СформироватьПриОткрытии Тогда
		CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
		
		Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования") Тогда
			Если Разделы.Количество() = 1 Тогда
				Разделы.Вставить(0, "План", , Ложь);
				Разделы.Добавить("Отклонение", , Ложь);
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
				ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
			КонецЕсли;	
		Иначе
			Разделы.Очистить();
			Разделы.Добавить("Факт",,Истина);
			Элементы.ВерсияБюджета.Видимость = Ложь;
			ВерсияБюджета = Неопределено;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ДатаОпределенияПрибыли) Тогда
			ДатаОпределенияПрибыли = Элементы.ДатаОпределенияПрибыли.СписокВыбора.НайтиПоЗначению("Реквизит.ДатаЗакрытия");
		КонецЕсли;
		
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Очистить();
	Настройки.ДополнительныеСвойства.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОтраженияПриИзменении(Элемент)
	
	Если ПорядокОтражения = 2 Тогда
		ПолучитьРасходыПоПутевымЛистам = Ложь;
	КонецЕсли;
	
	 УстановитьДоступностьЭлементаПолучитьрасходПоПутевымЛистам();

КонецПроцедуры

&НаКлиенте
Процедура ВариантФормированияПриИзменении(Элемент)
	
	Если ВариантФормирования = 1 Тогда
		ПолучитьРасходыПоПутевымЛистам = Ложь;
	КонецЕсли;

	 УстановитьДоступностьЭлементаПолучитьрасходПоПутевымЛистам();
	 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементаПолучитьрасходПоПутевымЛистам()
	
	Элементы.ПолучитьРасходыПоПутевымЛистам.Доступность = ПорядокОтражения <> 2 и ВариантФормирования = 0;
	
	
КонецПроцедуры


//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.КомандаБуфераОбменаВставить.Доступность = Доступность;
	Элементы.БуферОбменаВставитьДляРеквизита.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуферОбменаВставить(Команда)
	КоличествоСтрок = БуферОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БуферОбменаВставитьНаСервере()
	
	Возврат CW_РаботаСБуферомОбмена.УстановитьОтборКомпановщикаПоБуферуОбмена(Отчет.КомпоновщикНастроек);

КонецФункции 

&НаКлиенте
Процедура БуферОбменаВставитьДляРеквизита(Команда)

	КоличествоСтрок = БуферОбменаВставитьДляРеквизитаНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 

КонецПроцедуры    

&НаСервере
Функция БуферОбменаВставитьДляРеквизитаНаСервере()
	
	ДанныеБуфераОбмена 	= CW_РаботаСБуферомОбмена.СтрокиИзБуфераОбмена(); 
	ТипИсточника		= CW_РаботаСБуферомОбмена.ПолучитьТипОбъектаПоИмени(ДанныеБуфераОбмена.Источник); 
	Если ТипИсточника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Если ТипИсточника <> тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Грузоперевозки.ЗагрузитьЗначения(ДанныеБуфераОбмена.Данные);
	
	Возврат Грузоперевозки.Количество();
	
КонецФункции 

//Работа с буфером обмена

//БухгалтерскиеОтчетыКлиент
&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Результат, Элементы.Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры
//---БухгалтерскиеОтчетыКлиент
