
// ---------------------------------------------------------------------------- 
// ОСТАВЛЕН ДЛЯ СОВМЕСТИМОСТИ
// ----------------------------------------------------------------------------
Функция РекомендуемаяВерсияБухгалтерияПредприятия() Экспорт
	
	Возврат CW_ОбновлениеКонфигурацииСервер.РекомендуемаяВерсияБухгалтерияПредприятия();
	
КонецФункции

Функция ТекущаяВерсияБухгалтерияПредприятия() Экспорт
	
	Возврат	CW_ОбновлениеКонфигурацииСервер.ТекущаяВерсияБухгалтерияПредприятия();
	
КонецФункции

Функция ВерсииПодсистем() 
	
	Возврат CW_ОбновлениеКонфигурацииСервер.ВерсииПодсистемБухгалтерияПредприятия();
	
КонецФункции

Функция ВерсииПодсистемБЭ() Экспорт
	
	Возврат CW_ВерсииПодсистемСервер.УстановленныеВерсииПодсистем(); 
	
КонецФункции

Функция ПодготовитьСтруктуруОписаниеПодсистем() Экспорт
	
	ОписаниеПодсистем = Новый Структура;
	ОписаниеПодсистем.Вставить("ИмяПодсистемы", 	"");
	ОписаниеПодсистем.Вставить("Версия", 			"");
	
	Возврат ОписаниеПодсистем
	
КонецФункции

Функция СравнитьВерсии(ТекущаяВерсия, ВерсияКонфигурации) Экспорт  
	
	Если СокрЛП(ТекущаяВерсия) = СокрЛП(ВерсияКонфигурации) Тогда
		Возврат Истина;
	КонецЕсли;
	
	мВерсияКонфигурации	= СтрРазделить(СокрЛП(ВерсияКонфигурации),	".");
	мТекущаяВерсия 		= СтрРазделить(СокрЛП(ТекущаяВерсия),		".");
	
	СоответствуетМинимальнойВерсии   = Истина;
	СоответствуетРекомендуемойВерсии = Истина;
	
	Для Индекс = 0 по мТекущаяВерсия.ВГраница() Цикл
		
		индТекущаяВерсия 		= Число(мТекущаяВерсия.Получить(Индекс));
		индВерсияКонфигурации 	= Число(мВерсияКонфигурации.Получить(Индекс));
		
		Если индТекущаяВерсия > индВерсияКонфигурации Тогда
			//Если текущий разряд весрии больше чем разряд версии базы данных, то возвращаем "Истина"
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь

КонецФункции // СравнитьВерсии()


#Область Мониторинг 

Функция СтрокаПараметра(Объект,Параметр) Экспорт 
	Возврат(CW_Мониторинг.СтрокаПараметра(Объект,Параметр));	
КонецФункции
// --- 
Функция ТабличнаяЧастьПараметровОбъекта(Объект) Экспорт 
	Возврат(CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(Объект));
КонецФункции
// --- 
Функция НомерКонтейнераКорректный(НомерКонтейнера) Экспорт
	Возврат(CW_Мониторинг.НомерКонтейнераКорректный(НомерКонтейнера));    
КонецФункции 
// --- 
Функция ГрузоперевозкиЗаказа(Заказ,ТолькоНепомеченные=Истина) Экспорт 
	Возврат(CW_Мониторинг.ГрузоперевозкиЗаказа(Заказ,ТолькоНепомеченные));
КонецФункции
// --- 
Функция ПараметрГрузоперевозки(Грузоперевозка, Параметр) Экспорт 
	Возврат(CW_Мониторинг.ПараметрГрузоперевозки(Грузоперевозка,Параметр));
КонецФункции
// --- 
Функция СтруктураПараметраГрузоперевозки(СтрокаПараметра) Экспорт 
	Возврат(CW_Мониторинг.СтруктураПараметраГрузоперевозки(СтрокаПараметра));
КонецФункции
// --- 
Функция СтруктураСвойствПараметра(Параметр) Экспорт 
	Возврат(CW_Мониторинг.СтруктураСвойствПараметра(Параметр));	
КонецФункции
// --- 
Функция ПолучитьСоответствиеСвойствПараметров() Экспорт 
	Возврат(CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров());
КонецФункции
// --- 
Функция ПересчитатьДинамическиеПараметрыОбъекта(Грузоперевозка, СоответствиеСвойствПараметров=Неопределено) Экспорт
	Возврат(CW_Мониторинг.ПересчитатьДинамическиеПараметрыОбъекта(Грузоперевозка, СоответствиеСвойствПараметров));
КонецФункции
// ---   
Функция ДинамическиеПараметрыОбъекта(Грузоперевозка, СоответствиеСвойствПараметров, МассивПараметров=Неопределено,ТаблицаПараметровГрузоперевозки=Неопределено) Экспорт
	Возврат(CW_Мониторинг.ДинамическиеПараметрыОбъекта(Грузоперевозка, СоответствиеСвойствПараметров, МассивПараметров,ТаблицаПараметровГрузоперевозки)); 
КонецФункции
// --- 
Процедура УстановитьПараметрДатыЕжедневногоОбновления() Экспорт 
	CW_Мониторинг.УстановитьПараметрДатыЕжедневногоОбновления();  
КонецПроцедуры
// --- 
Функция СписокМакросовДинамическихПараметров() Экспорт 
	Возврат(CW_Мониторинг.СписокМакросовДинамическихПараметров());
КонецФункции
// --- 
Процедура CW_ПересчетДинамическихПараметров() Экспорт
	CW_Мониторинг.CW_ПересчетДинамическихПараметров(); 
КонецПроцедуры

#КонецОбласти 

#Область Настройки 

Функция Пользователь() Экспорт 
	Возврат(CW_Настройки.Пользователь());
КонецФункции
// --- 
Функция ПолучитьНастройкуПользователя(Пользователь=Неопределено, ИмяНастройки, ПечатныеФормы = Ложь) Экспорт 
	Возврат(CW_Настройки.ПолучитьНастройкуПользователя(Пользователь, ИмяНастройки, ПечатныеФормы));
КонецФункции
// --- 
Функция ПолучитьНастройкиПользователя(Пользователь=Неопределено) Экспорт
	Возврат(CW_Настройки.ПолучитьНастройкиПользователя(Пользователь)); 
КонецФункции
// ---   
Функция ПолучитьФизЛицоПользователя(Пользователь) Экспорт 
	Возврат(CW_Настройки.ПолучитьФизЛицоПользователя(Пользователь));
КонецФункции
// --- 

//Устарела. Следует использовать функцию CW_Настрйоки.ПолучитьПараметрыДоговора  или CW_Настрйоки.ПолучитьЗначениеПараметраДоговора
Функция ПараметрДоговора(Дата, Договор, ИмяПараметра) Экспорт
	Возврат(CW_Настройки.ПараметрДоговора(Дата, Договор, ИмяПараметра));	
КонецФункции
// --- 

//Устарела. Следует использовать функцию CW_Настрйоки.ПолучитьПараметрыДоговора
Функция ПараметрыДоговора(Дата, Договор) Экспорт
	Возврат(CW_Настройки.ПараметрыДоговора(Дата, Договор));	
КонецФункции
// --- 
Функция ПараметрУчетнойПолитики(Дата, Организация, ИмяПараметра, кэшСтрокаПараметров=Неопределено) Экспорт
	Возврат(CW_Настройки.ПараметрУчетнойПолитики(Дата, Организация, ИмяПараметра, кэшСтрокаПараметров));	
КонецФункции
// --- 
Функция ПараметрыУчетнойПолитики(Дата, Организация) Экспорт
	Возврат(CW_Настройки.ПараметрыУчетнойПолитики(Дата, Организация));
КонецФункции
// --- 
Функция ПараметрГлобальнойУчетнойПолитики(Дата, Организация, ИмяПараметра, кэшСтрокаПараметров=Неопределено) Экспорт
	Возврат(CW_Настройки.ПараметрГлобальнойУчетнойПолитики(Дата, Организация, ИмяПараметра, кэшСтрокаПараметров));	
КонецФункции
// --- 
Функция ПараметрыГлобальнойУчетнойПолитики(Дата, Организация) Экспорт
	Возврат(CW_Настройки.ПараметрыГлобальнойУчетнойПолитики(Дата, Организация));	 
КонецФункции

#КонецОбласти 

#Область Печать 

Функция ПолучитьТаблицуПечатныхФорм(СсылкаОбъекта, ИгнорироватьСтандартнуюПроверкуУсловий=Ложь) Экспорт
	Возврат(CW_Печать.ПолучитьТаблицуПечатныхФорм(СсылкаОбъекта, ИгнорироватьСтандартнуюПроверкуУсловий));	
КонецФункции
// --- 
Функция ПолучитьПечатнуюФорму(Ссылка, ВидОбработки, ОбработкаПФ , ИгнорироватьУловияИспользования=Ложь, Настройка=Неопределено, ДляРассылки = Неопределено) Экспорт
	Возврат(CW_Печать.ПолучитьПечатнуюФорму(Ссылка, ВидОбработки, ОбработкаПФ , ИгнорироватьУловияИспользования, Настройка, ДляРассылки));	
КонецФункции
// --- 
Функция ФамилияИОИзСтрокиФамилияИмяОтчество(строкаФамилияИмяОтчество,Знач Дата=Неопределено) Экспорт 
	Возврат(CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(строкаФамилияИмяОтчество,Дата));	
КонецФункции
// --- 
Функция ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(строкаФамилияИмяОтчество) Экспорт 
	Возврат(CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(строкаФамилияИмяОтчество));	
КонецФункции
// --- 
Процедура ПодготовитьТаблицуУслуг(ТаблицаУслуг, Объект, ПараметрыДоговора, Источник) Экспорт 
	CW_Печать.ПодготовитьТаблицуУслуг(ТаблицаУслуг, Объект, ПараметрыДоговора, Источник);  
КонецПроцедуры

#КонецОбласти 

#Область Финансы 

Процедура ПеренестиПризнакВосстановленияПоследовательности(ОбъектИсточник,ОбъектПриемник) Экспорт 
	CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ОбъектИсточник,ОбъектПриемник);
КонецПроцедуры
// --- 
Функция РабочееВремя() Экспорт
	Возврат(CW_Документы.РабочееВремя()); 
КонецФункции
// --- 
Функция ГрузоперевозкиДокумента(Документ) Экспорт
	Возврат(CW_Финансы.ГрузоперевозкиДокумента(Документ));	
КонецФункции
// --- 
Функция НоменклатураДокумента(Документ) Экспорт
	Возврат(CW_Финансы.НоменклатураДокумента(Документ));
КонецФункции
// --- 
Функция ВернутьПлательщика(СтруктураПараметров) Экспорт
	Возврат(CW_Финансы.ВернутьПлательщика(СтруктураПараметров));	
КонецФункции	
// --- 
Функция ПрефиксОрганизации(Организация) Экспорт 
	Возврат(CW_Документы.ПрефиксОрганизации(Организация));	
КонецФункции
// --- 
Функция ПолучитьНомерНаПечать(Документ) Экспорт 
	Возврат(CW_Документы.ПолучитьНомерНаПечать(Документ)); 
КонецФункции
// --- 
Функция ТаблицаАвансовДляОЗ(Параметры,ТаблицаДокумента,ТаблицаЗачета) Экспорт 
	Возврат(CW_Финансы.ТаблицаАвансовДляОЗ(Параметры,ТаблицаДокумента,ТаблицаЗачета));		
КонецФункции
// --- 
Функция ТаблицаАвансов(Параметры,ТаблицаДокумента,ТаблицаЗачета,ТаблицаЗачетаОЗ=Неопределено) Экспорт 
	Возврат(CW_Финансы.ТаблицаАвансов(Параметры,ТаблицаДокумента,ТаблицаЗачета,ТаблицаЗачетаОЗ=Неопределено));
КонецФункции
// --- 
Функция ПолучитьВедущийДоговор(Договор) Экспорт 
	Возврат(CW_Финансы.ПолучитьВедущийДоговор(Договор));
КонецФункции
// --- 
Функция ДоговорПокупателя(Договор) Экспорт 
	Возврат(CW_Финансы.ДоговорПокупателя(Договор)); 
КонецФункции
Функция СчетАванса(СчетЗадолженности) Экспорт 
	Возврат(CW_Финансы.СчетАванса(СчетЗадолженности));
КонецФункции
Функция СобственнаяУслуга(СтрокаТаблицыУслуг) Экспорт 
	Возврат(CW_Финансы.СобственнаяУслуга(СтрокаТаблицыУслуг)); 
КонецФункции
// --- 
Функция СтруктураСчетовРасчетов_Клиенты(Дата,Организация,ДС=Неопределено) Экспорт 
	Возврат(CW_Финансы.СтруктураСчетовРасчетов_Клиенты(Дата,Организация,ДС));
КонецФункции
// --- 
Функция СтруктураСчетовРасчетов_Поставщики(Дата,Организация) Экспорт 
	Возврат(CW_Финансы.СтруктураСчетовРасчетов_Поставщики(Дата,Организация)); 
КонецФункции
// --- 
Функция ОпределитьСчетУчетаДоходов(СтрокаТаблицыУслуг,СтруктураСчетов,ПризнакВалютногоДокумента,ПризнакРасчетовУЕ) Экспорт 
 	Возврат(CW_Финансы.ОпределитьСчетУчетаДоходов(СтрокаТаблицыУслуг,СтруктураСчетов,ПризнакВалютногоДокумента,ПризнакРасчетовУЕ)); 
КонецФункции
// --- 
Функция ОпределитьСчетУчетаРасходов(СтрокаТаблицыУслуг,СтруктураСчетов,ПризнакВалютногоДокумента,ПризнакРасчетовУЕ) Экспорт 
 	Возврат(CW_Финансы.ОпределитьСчетУчетаРасходов(СтрокаТаблицыУслуг,СтруктураСчетов,ПризнакВалютногоДокумента,ПризнакРасчетовУЕ));
КонецФункции
// --- 
Функция ПолучитьДатуНачалаВеденияУчета(Организация) Экспорт
	Возврат(CW_Настройки.ПолучитьДатуНачалаВеденияУчета(Организация));
КонецФункции
// --- 
Функция ПолучитьНастройкиОперативногоУчета(Организация,ВидЗадолженности) Экспорт
	Возврат(CW_Настройки.ПолучитьНастройкиОперативногоУчета(Организация,ВидЗадолженности));
КонецФункции
// --- 
Функция ПолучитьВедущийДокумент(ВедомыйДокумент) Экспорт 
	Возврат(CW_Документы.ПолучитьВедущийДокумент(ВедомыйДокумент));
КонецФункции
// --- 
Функция ПроверкаНомера(Документ, РежимЗаписи, ВедущийДокумент ,Отказ) Экспорт
	Возврат(CW_Документы.ПроверкаНомера(Документ, РежимЗаписи, ВедущийДокумент ,Отказ));	
КонецФункции
// --- 
Функция ПолучитьУслугиДокумента(Документ) Экспорт 
	Возврат(CW_Финансы.ПолучитьУслугиДокумента(Документ)); 
КонецФункции
// --- 
Процедура ДобавитьКолонкиБазовойВалюты(Таблица) Экспорт 
	CW_Финансы.ДобавитьКолонкиБазовойВалюты(Таблица);  
КонецПроцедуры
// --- 
Функция ПолучитьПланОплаты(Документ) Экспорт 
	Возврат(CW_Документы.ПолучитьПланОплаты(Документ));
КонецФункции  
// --- 
Функция ПолучитьСрокОплаты(Документ) Экспорт 
	Возврат(CW_Документы.ПолучитьСрокОплаты(Документ)); 
КонецФункции  
// --- 
Функция УстановитьСрокОплаты(ДанныеДляЗаписи) Экспорт
	Возврат(CW_Документы.УстановитьСрокОплаты(ДанныеДляЗаписи));
КонецФункции
// --- 

//УСТАРЕЛА!!!
//Для расчета срока оплаты следует использовать функцию
//CW_Документы.РассчитатьСрокОплаты(ДанныеДляРасчета);
Функция РассчитатьСрокОплаты(Документ) Экспорт
	
	ДанныеДляРасчета = CW_Документы.ПодготовитьДанныеДляРасчетаСрокаОплаты(Документ);
	Возврат CW_Документы.РассчитатьСрокОплаты(ДанныеДляРасчета);
	
КонецФункции
// --- 
Функция ТаблицаОперативнойЗадолженностиПоСчетам(Параметры) Экспорт
	Возврат(CW_Финансы.ТаблицаОперативнойЗадолженностиПоСчетам(Параметры)); 
КонецФункции
// --- 
&НаСервере
Функция СтруктураБухгалтерскойЗадолженностиПоАктам(Параметры) Экспорт
	Возврат(CW_Финансы.СтруктураБухгалтерскойЗадолженностиПоАктам(Параметры));	
КонецФункции
// --- 
&НаСервере
Процедура СформироватьДеревоОплат(ДеревоОплат,Параметры) Экспорт
	CW_Финансы.СформироватьДеревоОплат(ДеревоОплат,Параметры);
КонецПроцедуры
// --- 
&НаСервере
Функция ПредупреждениеПоСхемеУчетаПеревыставленияПоСтавкам(Объект) Экспорт 
	Возврат(CW_Финансы.ПредупреждениеПоСхемеУчетаПеревыставленияПоСтавкам(Объект));
КонецФункции
// --- 
&НаСервере
Процедура ВыполнитьАвтораспределениеОплатыПоСчетам(ДеревоОплат, СуммаОплаты, ПустойАкт, УЕ, Курс) Экспорт 
	CW_Финансы.ВыполнитьАвтораспределениеОплатыПоСчетам(ДеревоОплат, СуммаОплаты, ПустойАкт, УЕ, Курс);
КонецПроцедуры
// --- 
&НаСервере
Процедура ЗаполнитьТаблицыПлатежныхДокументов(ДеревоОплат,ТаблицаОЗ,ТабличнаяЧасть,ПараметрыЗаполнения) Экспорт 
	CW_Финансы.ЗаполнитьТаблицыПлатежныхДокументов(ДеревоОплат,ТаблицаОЗ,ТабличнаяЧасть,ПараметрыЗаполнения);
КонецПроцедуры

#КонецОбласти 

#Область Шаблоны 

Процедура УстановитьПредставлениеНоменклатуры(СтрокаТЧ,Договор,Объект) Экспорт 
	
	ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
	
	ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
	ПараметрыШаблона.Объект 		= Объект;
	ПараметрыШаблона.Дата 			= Объект.Дата;
	ПараметрыШаблона.Договор 		= Договор;
	ПараметрыШаблона.ВидДоговора 	= Договор.ВидДоговора;
	ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
	
	CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ,ПараметрыШаблона); 
	
КонецПроцедуры
// --- 
Функция СписокМакросовШаблоновНоменклатуры(РасходнаяСтатья,ДоходнаяСтатья) Экспорт 
	Возврат(CW_Шаблоны.СписокМакросовШаблоновНоменклатуры(РасходнаяСтатья,ДоходнаяСтатья)); 
КонецФункции
// --- 
Функция СписокМакросовШаблоновСтатусовОборудования() Экспорт 
	Возврат(CW_Шаблоны.СписокМакросовШаблоновСтатусовОборудования());
КонецФункции
// --- 
Функция ОбработатьШаблонНоменклатуры(Знач Шаблон, Объект,СтрокаТЧ = Неопределено, СтрокиТЧ = Неопределено) Экспорт 
	Возврат(CW_Шаблоны.ОбработатьШаблонНоменклатуры(Шаблон, Объект,СтрокаТЧ, СтрокиТЧ));	
КонецФункции
// --- 
Функция ОбработатьШаблонСтатусаОборудования(Знач Шаблон, Грузоперевозка, ИсходнаяСтрокаСтатуса) Экспорт 
	Возврат(CW_Шаблоны.ОбработатьШаблонСтатусаОборудования(Шаблон, Грузоперевозка, ИсходнаяСтрокаСтатуса));	
КонецФункции

#КонецОбласти 

#Область Оригиналы 

Функция ПолучитьПризнакНаличияОригиналов(Документ) Экспорт
	
	//Функция устарела. 
	//Для получения признака документа следует использовать функцию CW_Документы.ПолучитьПризнакНаличияИДатуВозвратаОригиналов
	
	СтруктураДанных = CW_Документы.ПолучитьПризнакНаличияИДатуВозвратаОригиналов(Документ);
	
	Возврат СтруктураДанных.ОригиналыПредоставлены;
	
КонецФункции
	
Функция УстановитьПризнакНаличияОригиналов(Документ,Признак) Экспорт 
	
	//Функция устарела. 
	//Для установки признака документа следует использовать функцию CW_Документы.УстановитьПризнакНаличияИдатуВозвратаОригиналов
	
	СтруктураДанных = CW_Документы.ПолучитьПризнакНаличияИДатуВозвратаОригиналов(Документ);
	
	ДанныеДлязаписи = Новый Структура;
	ДанныеДлязаписи.Вставить("ЗаписьНового"			, Ложь);
	ДанныеДлязаписи.Вставить("Ссылка"				, Документ);
	ДанныеДлязаписи.Вставить("Признак"				, Признак);
	ДанныеДлязаписи.Вставить("ДатаВозврата" 		, СтруктураДанных.ДатаПолучения);
	
	СтруктураПараметров = CW_Документы.ПодготовитьСтруктуруДляЗаписиНаличияОригиналовДокументов(ДанныеДлязаписи);
	
	Возврат CW_Документы.УстановитьПризнакНаличияИдатуВозвратаОригиналов(СтруктураПараметров);
	
КонецФункции

#КонецОбласти 

#Область ПоследниеДоговоры 

Функция ПолучитьПоследнийДоговор(Контрагент, Организация, ВидДоговора) Экспорт 
	Возврат(CW_Документы.ПолучитьПоследнийДоговор(Контрагент, Организация, ВидДоговора));
КонецФункции
// --- 
Процедура ЗаписатьПоследнийДоговор(Договор) Экспорт 
	CW_Документы.ЗаписатьПоследнийДоговор(Договор);
КонецПроцедуры

#КонецОбласти 

#Область БлокировкаГрузоперевозок

Функция ПолучитьДатуЗакрытия(Аналитика) Экспорт 
	Возврат(CW_Мониторинг.ПолучитьДатуЗакрытия(Аналитика));
КонецФункции
// --- 
Функция УстановитьДатуЗакрытия(Аналитика, Дата) Экспорт 
	Возврат(CW_Мониторинг.УстановитьДатуЗакрытия(Аналитика,Дата)); 
КонецФункции
  // --- 
Функция ПроверитьЗакрытиеГрузоперевозок(Объект,ВыводитьРасшифровку=Ложь) Экспорт 
	Возврат(CW_Мониторинг.ПроверитьЗакрытиеГрузоперевозок(Объект,ВыводитьРасшифровку)); 
КонецФункции
// --- 
Функция ТаблицаЗакрытыхГрузоперевозок(Объект) Экспорт 
	Возврат(CW_Мониторинг.ТаблицаЗакрытыхГрузоперевозок(Объект));  
КонецФункции
// --- 
Функция ТаблицаЗакрытыхПоАналитике(МассивАналитик) Экспорт 
	Возврат(CW_Мониторинг.ТаблицаЗакрытыхПоАналитике(МассивАналитик)); 
КонецФункции

#КонецОбласти 

#Область ПредопределённыеПараметры 

Функция ВидСубъекта(ИмяПеречисления) Экспорт
	Возврат(CW_Мониторинг.ВидСубъекта(ИмяПеречисления));  
КонецФункции
// --- 
Функция ПолучитьПредопределенныеПараметры(Субъект,ИдентификаторФормы=Неопределено) Экспорт 
	Возврат(CW_Мониторинг.ПолучитьПредопределенныеПараметры(Субъект,ИдентификаторФормы)); 
КонецФункции
// --- 
Функция ДобавитьПредопределенныеПараметры(Объект,АдресПараметров) Экспорт 
	Возврат(CW_Мониторинг.ДобавитьПредопределенныеПараметры(Объект,АдресПараметров)); 
КонецФункции

#КонецОбласти 

#Область Служебное 

Функция ДоступныОбъектыБухгалтерии() Экспорт
	Возврат(CW_ПраваДоступа.ДоступныОбъектыБухгалтерии()); 
КонецФункции
// --- 
Функция ОбъектБДСуществует(ТестоваяСсылка) Экспорт
    Возврат(_сф.ОбъектБДСуществует(ТестоваяСсылка)); 
КонецФункции
// --- 
Функция Отладка() Экспорт 
	Возврат(CW_Настройки.Отладка());
КонецФункции

#КонецОбласти 

Функция СформироватьСуммуПрописьюАнгл(Сумма, Валюта) Экспорт
	Возврат(CW_Печать.СформироватьСуммуПрописьюАнгл(Сумма, Валюта)); 
КонецФункции
// --- 
Функция ПолучитьКурсВалюты(Валюта, ДатаКурса) Экспорт
	Возврат(CW_Финансы.ПолучитьКурсВалюты(Валюта, ДатаКурса)); 	
КонецФункции
// --- 
Функция ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон, ПоКратностьНач = 1, ПоКратностьКон = 1) Экспорт 
	Возврат(CW_Финансы.ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач, ПоКурсуКон, ПоКратностьНач, ПоКратностьКон));  
КонецФункции
// --- 
Функция ОсновнаяОрганизация() Экспорт 
	Возврат(CW_Настройки.ОсновнаяОрганизация()); 
КонецФункции
// --- 
Функция ОсновнаяСтавкаНДС() Экспорт 
	Возврат(CW_Настройки.ОсновнаяСтавкаНДС());  
КонецФункции
// ---   
Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт 
	Возврат(CW_Финансы.ПолучитьСтавкуНДС(СтавкаНДС));  
КонецФункции
// --- 
Функция РассчитатьСуммуНДС(Сумма, УчитыватьНДС, СуммаВключаетНДС, СтавкаНДС) Экспорт 
	Возврат(CW_Финансы.РассчитатьСуммуНДС(Сумма, УчитыватьНДС, СуммаВключаетНДС, СтавкаНДС)); 
КонецФункции
// --- 
Функция ПолучитьРабочуюДату() Экспорт 
	Возврат(CW_Документы.ПолучитьРабочуюДату()); 
КонецФункции
// --- 
Функция НайтиВыданнуюСчетФактуру(ДокументОснование) Экспорт 
	Возврат(CW_Финансы.НайтиВыданнуюСчетФактуру(ДокументОснование)); 
КонецФункции
// --- 
Функция НайтиПолученнуюСчетФактуру(ДокументОснование) Экспорт 
	Возврат(CW_Финансы.НайтиПолученнуюСчетФактуру(ДокументОснование)); 
КонецФункции
// --- 
Функция ПереопределяемыйМодуль() Экспорт
	
	Если (ЭтоРедакция_3()) Тогда
		
		Обработка = Обработки.CW_ПереопределяемыеФункции_Редакция3.Создать();
		
	Иначе
		
		Обработка = Обработки.CW_ПереопределяемыеФункции_Редакция2.Создать();
		
	КонецЕсли; 
	
	Возврат(Обработка);
	
КонецФункции
Функция ЭтоРедакция_3() Экспорт 
	
	Версия = Метаданные.Версия;
	Если (Лев(Версия,1)="3") Тогда
		Возврат(Истина);
	Иначе
		Возврат(Ложь);
	КонецЕсли; 
	
КонецФункции
// --- 
Функция ПредставлениеДокументаРасчетовСоСпискомГрузоперевозок(док, флДетализироватьПоГрузоперевозкам, флДетализироватьПоЗаказам) Экспорт
	Возврат(CW_Отчеты.ПредставлениеДокументаРасчетовСоСпискомГрузоперевозок(док, флДетализироватьПоГрузоперевозкам, флДетализироватьПоЗаказам)); 
КонецФункции
// --- 
Функция ПредставлениеДокументовВзаиморасчетов(Док, флДетализироватьПоГрузоперевозкам, флДетализироватьПоЗаказам) Экспорт
	Возврат(CW_Отчеты.ПредставлениеДокументовВзаиморасчетов(Док, флДетализироватьПоГрузоперевозкам, флДетализироватьПоЗаказам)); 	
КонецФункции
// --- 
Функция ПредставлениеДокументовВзаиморасчетовДляОперативныхОтчетов(Док, флДетализироватьПоГрузоперевозкам, флДетализироватьПоЗаказам) Экспорт
	Возврат(CW_Отчеты.ПредставлениеДокументовВзаиморасчетовДляОперативныхОтчетов(Док, флДетализироватьПоГрузоперевозкам, флДетализироватьПоЗаказам)); 	
КонецФункции
// --- 
Функция ПредставлениеДокументовРеализации(Док, ФормированиеОтчета) Экспорт
	Возврат(CW_Отчеты.ПредставлениеДокументовРеализации(Док, ФормированиеОтчета)); 	
КонецФункции
// --- 
Функция ПредставлениеДокументовПоступления(Док, ФормированиеОтчета) Экспорт
	Возврат(CW_Отчеты.ПредставлениеДокументовПоступления(Док, ФормированиеОтчета)); 	
КонецФункции
// --- 
Функция СсылкаДляРасшифровкиПоДокументуРасчетов(док) Экспорт
	Возврат(CW_Отчеты.СсылкаДляРасшифровкиПоДокументуРасчетов(док)); 	
КонецФункции
// --- 
Функция ВернутьПодписантов(Ссылка, ПараметрыДоговора) Экспорт
	Возврат(CW_Печать.ВернутьПодписантов(Ссылка, ПараметрыДоговора)); 	
КонецФункции	
// --- 
Функция ПолучитьФинРез(ГП,ОтображениеФинРеза=Неопределено) Экспорт
	Возврат(CW_Финансы.ПолучитьФинРез(ГП,ОтображениеФинРеза)); 		
КонецФункции	
// --- 
Функция ПолучитьКонтрагентовХолдинга() Экспорт
	Возврат(CW_Финансы.ПолучитьКонтрагентовХолдинга()); 
КонецФункции
// --- 
Функция ПолучитьДатуКурсаПлановойСтатьи(Владелец, Параметр, ДатаПоУмолчанию=Неопределено) Экспорт
	Возврат(CW_Бюджетирование.ПолучитьДатуКурсаПлановойСтатьи(Владелец, Параметр, ДатаПоУмолчанию)); 
КонецФункции	
// --- 
Функция ПолучитьСпособУчетаНДС(Организация, Номенклатура, Дата) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата"					, Дата);
	СтруктураПараметров.Вставить("Организация"			, Организация);
	СтруктураПараметров.Вставить("Номенклатура"			, Номенклатура);
	СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, Номенклатура.НоменклатурнаяГруппа);
	
	Возврат CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров); 
	
КонецФункции	


Функция ПараметрыРаботыКлиента() Экспорт
	
	// Установка даты клиента непосредственно перед вызовом, чтобы уменьшить погрешность.
	СвойстваКлиента = новый Структура;
	СвойстваКлиента.Вставить("ТекущаяДатаНаКлиенте", ТекущаяДата()); // Для расчета ПоправкаКВремениСеанса.
	СвойстваКлиента.Вставить("ТекущаяУниверсальнаяДатаВМиллисекундахНаКлиенте", ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Возврат  СтандартныеПодсистемыВызовСервера.ПараметрыРаботыКлиента(СвойстваКлиента);
	
КонецФункции

