
#Область СлужебныеПроцедурыИФункции

// Настройки публикации.
//
// Параметры:
//  ТорговоеПредложение	 - Ссылка - ссылка на торговое предложение.
// 
// Возвращаемое значение:
//  Структура - значения дополнительных настроек.
//   * Организация - Ссылка - организация настройки.
//   * АдресЭлектроннойПочты - Строка - адрес электронной почты поставщика.
//   * Организация - Ссылка - организация настройки.
//   * УведомлятьОЗаказах - Булево - признак уведомления о получении заказов покупателей.
//   * ПубликоватьЦены - Булево - публиковать цены.
//   * ПубликоватьСрокиПоставки - Булево - публиковать сроки поставки.
//   * ПубликоватьОстатки - Булево - публиковать остатки.
//   * ДополнительноеОписание - Строка - дополнительное текстовое описание.
//   * ПоВсемТоварам - Булево - признак публикации все товаров из прайс-листа.
//
Функция НастройкиПубликации(ТорговоеПредложение) Экспорт
	
	НастройкиПубликации = ТорговыеПредложения.НастройкиПубликации(ТорговоеПредложение);
	
	Если НастройкиПубликации = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиПубликации.Вставить("ПоВсемТоварам", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговоеПредложение, "ПоВсемТоварам"));
	
	Возврат НастройкиПубликации;
	
КонецФункции

Функция ДанныеРедактированияПрайсЛиста(ПозицииТорговыхПредложений) Экспорт
	
	ИсходныеДанные = Новый ТаблицаЗначений;
	ИсходныеДанные.Колонки.Добавить("Номенклатура"   , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ИсходныеДанные.Колонки.Добавить("Упаковка"       , Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	
	Если Не ПозицииТорговыхПредложений = Неопределено Тогда
		Для каждого ПозицияТорговогоПредложения Из ПозицииТорговыхПредложений Цикл
			ЗаполнитьЗначенияСвойств(ИсходныеДанные.Добавить(), ПозицияТорговогоПредложения);
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПозицииТорговыхПредложений", ИсходныеДанные);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПозицииТорговыхПредложений.Номенклатура КАК Номенклатура,
	               |	ПозицииТорговыхПредложений.Упаковка КАК ЕдиницаИзмерения
	               |ПОМЕСТИТЬ ПозицииТорговыхПредложений
	               |ИЗ
	               |	&ПозицииТорговыхПредложений КАК ПозицииТорговыхПредложений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПрайсЛист.Номенклатура КАК Номенклатура,
	               |	ПрайсЛист.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПрайсЛист.Организация КАК Организация,
	               |	ПрайсЛист.ВидЦены КАК ВидЦены,
	               |	МАКСИМУМ(ПрайсЛист.Цена) КАК Цена,
	               |	МАКСИМУМ(ПрайсЛист.Оценка) КАК Наличие,
	               |	СУММА(ПрайсЛист.Количество) КАК Количество
	               |ИЗ
	               |	РегистрСведений.ПрайсЛист КАК ПрайсЛист
	               |ГДЕ
	               |	ИСТИНА В
	               |			(ВЫБРАТЬ ПЕРВЫЕ 1
	               |				ИСТИНА
	               |			ИЗ
	               |				ПозицииТорговыхПредложений КАК ПозицииТорговыхПредложений
	               |			ГДЕ
	               |				ПозицииТорговыхПредложений.Номенклатура = ПрайсЛист.Номенклатура
	               |				И ПозицииТорговыхПредложений.ЕдиницаИзмерения = ПрайсЛист.ЕдиницаИзмерения)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПрайсЛист.Организация,
	               |	ПрайсЛист.Номенклатура,
	               |	ПрайсЛист.ЕдиницаИзмерения,
	               |	ПрайсЛист.ВидЦены";
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаДанных.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Наличие", Новый ОписаниеТипов("Число"));
	ТаблицаДанных.Колонки.Добавить("Модифицирован", Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("ХарактеристикиИспользуются", Новый ОписаниеТипов("Булево"));
	
	ВидыЦен = Новый Соответствие;
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("Организация, Номенклатура, Характеристика, ЕдиницаИзмерения");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаЗапроса);
		
		НайденныеСтроки = ТаблицаДанных.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Строка = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, СтруктураПоиска);
		Иначе
			Строка = НайденныеСтроки[0];
		КонецЕсли;
		
		Строка.Количество = Макс(Строка.Количество, ВыборкаЗапроса.Количество);
		Строка.Наличие    = Макс(Строка.Наличие, ВыборкаЗапроса.Наличие);
		
		Если НЕ ЗначениеЗаполнено(ВыборкаЗапроса.ВидЦены) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКолонки = ВидыЦен[ВыборкаЗапроса.ВидЦены];
		
		Если ИмяКолонки = Неопределено Тогда
			ИмяКолонки = СтрШаблон("ВидЦены_%1", СтрЗаменить(ВыборкаЗапроса.ВидЦены.УникальныйИдентификатор(), "-", "x"));
			ВидыЦен.Вставить(ВыборкаЗапроса.ВидЦены, ИмяКолонки);
			ТаблицаДанных.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Число"));
		КонецЕсли;
		
		Строка[ИмяКолонки] = ВыборкаЗапроса.Цена;
		
	КонецЦикла;
	
	АдресДанныхНоменклатуры = ПоместитьВоВременноеХранилище(ТаблицаДанных);
	
	ВидЦеныТорговогоПредложения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицииТорговыхПредложений[0].ПрайсЛист, "ВидЦены");
	ИмяКолонкиЦена = СтрШаблон("ВидЦены_%1", СтрЗаменить(ВидЦеныТорговогоПредложения.УникальныйИдентификатор(), "-", "x"));
	
	ДанныеРедактированияПрайсЛиста = Новый Структура;
	ДанныеРедактированияПрайсЛиста.Вставить("АдресДанныхНоменклатуры" , АдресДанныхНоменклатуры);
	ДанныеРедактированияПрайсЛиста.Вставить("ИмяКолонкиЦена"          , ИмяКолонкиЦена);
	
	Возврат ДанныеРедактированияПрайсЛиста;
	
КонецФункции

#КонецОбласти