
Процедура УстановитьДоступностьЭлементовФормы(Форма, Архив) Экспорт   
	
	Если Не CW_АрхивОбъектовСервер.БлокироватьОбъектыПриПереводеВАрхив() Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Форма.ИмяФормы, "ФормаЭлемента") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбрабатываемыеЭлементы = Новый Массив;
	ОбрабатываемыеЭлементы.Добавить(Тип("КнопкаФормы"));
	ОбрабатываемыеЭлементы.Добавить(Тип("ПолеФормы"));
	ОбрабатываемыеЭлементы.Добавить(Тип("ТаблицаФормы"));
	
	мИсключаемыеЭлементыЕслиАрхив = Новый Массив;
	мИсключаемыеЭлементыЕслиАрхив.Добавить("ФормаОбщаяКомандаCW_ИзвлечьИзАрхива");
	мИсключаемыеЭлементыЕслиАрхив.Добавить("ФормаКнопкаЗакрыть"); 
	мИсключаемыеЭлементыЕслиАрхив.Добавить("ФормаЗакрыть"); 
	мИсключаемыеЭлементыЕслиАрхив.Добавить("ВыводФинрезультата");  
	мИсключаемыеЭлементыЕслиАрхив.Добавить("ФормаСправочникCW_ШаблоныДокументовШаблоныДокумента");  
	мИсключаемыеЭлементыЕслиАрхив.Добавить("ФормаОбщаяКомандаCW_СкопироватьВБуферОбмена");  
	                                                               
	мИсключенияРодители = Новый Массив;
	мИсключенияРодители.Добавить(Форма.Элементы.Найти("ФормаГруппаОтчеты"));    
	     
	Для Каждого ЭлементФормы  из Форма.Элементы Цикл 
		
		Если ОбрабатываемыеЭлементы.Найти(ТипЗнч(ЭлементФормы)) = Неопределено Тогда
			Продолжить;
		КонецЕсли;                
		
		Если Архив и мИсключаемыеЭлементыЕслиАрхив.Найти(ЭлементФормы.Имя) <> Неопределено или СтрНайти(ЭлементФормы.Имя,"ОбщаяКоманда") > 0 Тогда
			Продолжить;
		КонецЕсли;  
		
		Если ПроверитьРодителя(ЭлементФормы, мИсключенияРодители) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементФормы) = Тип("ТаблицаФормы") Тогда
			ЭлементФормы.ТолькоПросмотр = Архив;
		Иначе
			ЭлементФормы.Доступность = Не Архив;
		Конецесли;
	КонецЦикла;  
	
КонецПроцедуры    

Функция ПроверитьРодителя(ЭлементФормы, мРодители)   
	
	Если ТипЗнч(ЭлементФормы.Родитель) = Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если мРодители.Найти(ЭлементФормы.Родитель) <> Неопределено Тогда  
		Возврат Истина
	КонецЕсли;
	
	Возврат ПроверитьРодителя(ЭлементФормы.Родитель, мРодители);
	
КонецФункции