
Функция РазрешеноИнициироватьСогласование(ИдентификаторОбъекта) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ЛицаЗамещающиеИнициаторовСогласования.ЛицоЗамещающееИнициатораСогласования КАК ЛицоЗамещающееИнициатораСогласования
	               |ИЗ
	               |	РегистрСведений.CW_ЛицаЗамещающиеИнициаторовСогласования КАК CW_ЛицаЗамещающиеИнициаторовСогласования
	               |ГДЕ
	               |	CW_ЛицаЗамещающиеИнициаторовСогласования.ЛицоЗамещающееИнициатораСогласования = &ЛицоЗамещающееИнициатораСогласования
	               |	И CW_ЛицаЗамещающиеИнициаторовСогласования.ИдентификаторОбъектаМетаданных = &ИдентификаторОбъекта"; 
	
	Запрос.УстановитьПараметр("ЛицоЗамещающееИнициатораСогласования", 	ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", 					ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции   

Функция ПолучитьСписокЗамещаемых(ТекущийПользователь, ИдентификаторОбъекта) Экспорт
	
	СписокЗначений = Новый СписокЗначений;   
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЛицаЗамещающиеИнициаторовСогласования.ИнициаторСогласования КАК ИнициаторСогласования
	               |ИЗ
	               |	РегистрСведений.CW_ЛицаЗамещающиеИнициаторовСогласования КАК CW_ЛицаЗамещающиеИнициаторовСогласования
	               |ГДЕ
	               |	CW_ЛицаЗамещающиеИнициаторовСогласования.ЛицоЗамещающееИнициатораСогласования <> &ТекущийПользователь
	               |	И CW_ЛицаЗамещающиеИнициаторовСогласования.ЛицоЗамещающееИнициатораСогласования = &ЛицоЗамещающееИнициатораСогласования
	               |	И CW_ЛицаЗамещающиеИнициаторовСогласования.ИдентификаторОбъектаМетаданных = &ИдентификаторОбъекта"; 
	
	Запрос.УстановитьПараметр("ЛицоЗамещающееИнициатораСогласования", 	ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущийПользователь", 					ТекущийПользователь);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", 					ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() > 0 Тогда
		РазрешеноИнициироватьСогласование = CW_ПраваДоступа.ПравоДоступно("РазрешеноИнициироватьСогласование");
		СписокЗначений.Добавить(ПараметрыСеанса.ТекущийПользователь, "За себя");
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		СписокЗначений.Добавить(Выборка.ИнициаторСогласования,);
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции