&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");

	Если НЕ CW_ВалютаРегламентированногоУчетаРубль Тогда
		ВариантФормирования = 1;
	КонецЕсли;
	
	ВерсияБюджета = CW_Бюджетирование.ПолучитьОсновнуюВерсиюБюджета();
	
	// показатели
	Показатели.Добавить("Сумма"	,,Истина);
	Показатели.Добавить("НДС"	,,Истина);
	Показатели.Добавить("Всего"	,,Истина);
	
	// разделы
	Разделы.Добавить("План"			,,Истина);
	Разделы.Добавить("Факт"			,,Истина);
	Разделы.Добавить("Отклонение"	,,Истина);
		
	// если переданы параметры - выполняем отчёт
	Если Параметры.Свойство("Грузоперевозки") Тогда
		
		Грузоперевозки 	= Параметры.Грузоперевозки;
		
		Если ЗначениеЗаполнено(Параметры.ВерсияБюджета) Тогда
			ВерсияБюджета 	= Параметры.ВерсияБюджета;
		КонецЕсли;
		
		СформироватьПриОткрытии = Истина;
				
		// при внешнем вызове показывать только "Всего"
		Показатели.ЗаполнитьПометки(Ложь);
		Показатели.НайтиПоЗначению("Всего").Пометка = Истина;
		
	КонецЕсли; 
	
	//Работа с буфером обмена
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена());
	//Работа с буфером обмена	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если СформироватьПриОткрытии Тогда
		СформироватьПриОткрытии = Ложь;
		_Настройка(Истина);
		СформироватьОтчет();
	Иначе	
		_ВосстановитьСтандартныеНастройки();
		_ВосстановитьСеансовуюНастройку();
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_ПланФакторныйАнализГрузоперевозок.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	// --- 
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		
		Попытка
			СеансоваяНастройка.Свойство("Показатели",Показатели);
			Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования")) Тогда
				СеансоваяНастройка.Свойство("Разделы", Разделы);
				Если Разделы.Количество() = 1 Тогда
					Разделы.Вставить(0, "План", , Ложь);
					Разделы.Добавить("Отклонение", , Ложь);
				КонецЕсли;	
				СеансоваяНастройка.Свойство("ВерсияБюджета",ВерсияБюджета);
				Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
					ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
				КонецЕсли;	
			Иначе
				Разделы.Очистить();
				Разделы.Добавить("Факт",,Истина);
				Элементы.ВерсияБюджета.Видимость = Ложь;
			КонецЕсли;	
			СеансоваяНастройка.Свойство("ПоСтатьям",ПоСтатьям);
			СеансоваяНастройка.Свойство("Организация",Организация);
			СеансоваяНастройка.Свойство("ВариантФормирования",ВариантФормирования);
			
			Если НЕ CW_ВалютаРегламентированногоУчетаРубль Тогда
				ВариантФормирования = 1;
			КонецЕсли;
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
		
	КонецЕсли; 
	
		
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	// --- 
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Показатели",Показатели);
	СтруктураНастройки.Вставить("Разделы",Разделы);
	СтруктураНастройки.Вставить("ВерсияБюджета",ВерсияБюджета);
	СтруктураНастройки.Вставить("ПоСтатьям",ПоСтатьям);
	СтруктураНастройки.Вставить("Организация",Организация);
	СтруктураНастройки.Вставить("ВариантФормирования",ВариантФормирования);
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	Раздел = Ложь;
	Для Каждого Стр из Разделы Цикл
		Раздел = ?(Стр.Пометка, Истина, Раздел);
	КонецЦикла;
	Если НЕ Раздел Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного раздела!");
		Возврат;		
	КонецЕсли;	
	
	Показатель = Ложь;
	Для Каждого Стр из Показатели Цикл
		Показатель = ?(Стр.Пометка, Истина, Показатель);
	КонецЦикла;
	Если НЕ Показатель Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного показателя!");
		Возврат;		
	КонецЕсли;	
	
	_Настройка(Истина);
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	ОбработатьОтчет();	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	// --- 
		
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	ОбработатьОтчет();	
	
	// --- 
	_СохранитьСеансовуюНастройку();
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	// --- 
	
	Настройки = _сф.ст_Создать("Грузоперевозки,ВерсияБюджета,ВариантФормирования,Организация,ПоСтатьям,Показатели,Разделы");
	Настройки.ВариантФормирования = ВариантФормирования;
	Настройки.Грузоперевозки = Грузоперевозки;
	Настройки.ВерсияБюджета = ВерсияБюджета;
	Настройки.Организация = Организация;
	Настройки.ПоСтатьям = ПоСтатьям;
	Настройки.Показатели = Показатели;
	Настройки.Разделы = Разделы;
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки,ЭтаФорма.УникальныйИдентификатор));
	
	// --- 
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "План", "План", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Факт", "Факт", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Отклонение", "Отклонение", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сумма", "Сумма", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "НДС", "НДС", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Всего", "Всего", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть=Ложь)
	// --- 
	
	Если Скрыть Тогда
		
		Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка=Ложь;
		
	Иначе
		
		Если Элементы.ГруппаНастройкиОтчета.Видимость Тогда
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка=Ложь;
			
		Иначе
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка=Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
		
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
    СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	// ---------------------------------------------------------------------------- 
	
    ДоступныеДействия = Новый Массив();
    ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	//ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
    
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных=РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

&НаКлиенте
Процедура ЗаказНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораЗаказа",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура("Адрес",ПоместитьВоВременноеХранилище(Грузоперевозки,ЭтаФорма.УникальныйИдентификатор));
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораГрузоперевозок",ПараметрыФормы,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗаказа(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		Грузоперевозки = ПолучитьИзВременногоХранилища(Ответ);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  


&НаКлиенте
Процедура ГрузоперевозкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГрузоперевозки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора",ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГрузоперевозки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		Грузоперевозки.Добавить(Ответ);
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  


&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("Показатели", Показатели);
	Настройки.ДополнительныеСвойства.Вставить("Разделы", Разделы);
	Настройки.ДополнительныеСвойства.Вставить("ВерсияБюджета", ВерсияБюджета);
	Настройки.ДополнительныеСвойства.Вставить("ПоСтатьям", ПоСтатьям);
	Настройки.ДополнительныеСвойства.Вставить("Организация", Организация);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если НЕ СформироватьПриОткрытии Тогда
		CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
		
		Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования")) Тогда
			Если Разделы.Количество() = 1 Тогда
				Разделы.Вставить(0, "План", , Ложь);
				Разделы.Добавить("Отклонение", , Ложь);
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
				ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
			КонецЕсли;	
		Иначе
			Разделы.Очистить();
			Разделы.Добавить("Факт",,Истина);
			Элементы.ВерсияБюджета.Видимость = Ложь;  
			ВерсияБюджета = Неопределено;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыПометкаПриИзменении(Элемент)
	
	ПроверитьБюджет();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьБюджет()
	
	Пр = Ложь;
	Для Каждого Стр из Разделы Цикл
		Если Стр.Значение = "План" ИЛИ Стр.Значение = "Отклонение" Тогда
			Если Стр.Пометка Тогда
				Пр = Истина;
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	Элементы.ВерсияБюджета.Видимость = Пр;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВерсияБюджетаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
		ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьБазовуюВерсиюБюджета()
	
	Возврат ?(ЗначениеЗаполнено(Константы.CW_БазоваяВерсияБюджета.Получить()), Константы.CW_БазоваяВерсияБюджета.Получить(), Справочники.CW_ВерсииБюджетов.Основная);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьГрузоперевозки(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораГрузоперевозок",ЭтаФорма);
	ПараметрыФормы = Новый Структура("МножественныйВыбор,ЗакрыватьПриВыборе,РежимВыбора", Истина, Истина, Истина);
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораГрузоперевозок(РезультатВыбора, ДопПараметры) Экспорт
	
	Если Не РезультатВыбора = Неопределено Тогда
		
		Для Каждого ЗначениеВыбора из РезультатВыбора Цикл
			
			Если Грузоперевозки.НайтиПоЗначению(ЗначениеВыбора) = Неопределено Тогда
				Грузоперевозки.Добавить(ЗначениеВыбора);
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьГрузоперевозки(Команда)
	
	Грузоперевозки.Очистить();
	
КонецПроцедуры


//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.КомандаБуфераОбменаВставить.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуфераОбменаВставить(Команда)
	КоличествоСтрок = БуфераОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БуфераОбменаВставитьНаСервере()
	
	ДанныеБуфераОбмена 	= CW_РаботаСБуферомОбмена.СтрокиИзБуфераОбмена(); 
	ТипИсточника		= CW_РаботаСБуферомОбмена.ПолучитьТипОбъектаПоИмени(ДанныеБуфераОбмена.Источник); 
	Если ТипИсточника <> тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Возврат Неопределено;
	КонецЕсли;   
	
	Грузоперевозки.ЗагрузитьЗначения(ДанныеБуфераОбмена.Данные);
	
	Возврат ДанныеБуфераОбмена.Данные.Количество();
	
КонецФункции
//Работа с буфером обмена