
Процедура ЗаписатьСтатусыОборудования(Грузоперевозка, ОтслеживаемоеОборудование) Экспорт
	
	ПодсистемаВключена = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМониторингаОборудования");
	Если Не ПодсистемаВключена тогда
		Возврат;
	КонецЕсли;
	
	Если Грузоперевозка.ОтключитьСлежение Тогда
		Возврат;
	КонецЕсли;
	
	//Очистка записей регистра по грузопереовозке
	РегистрыСведений.CW_СтатусыОборудованияНаСлежении.ОчиститьЗаписиРегистра(ОтслеживаемоеОборудование, Грузоперевозка);  
	
	ТаблицаСтатусов = РегистрыСведений.CW_СтатусыОборудованияНаСлежении.ПолучитьПустуюТаблицуСтатусовОборудования();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ТипыСлеженияСтатусы.НомерСтроки КАК НомерСтроки,
	               |	CW_ТипыСлеженияСтатусы.КонтрольнаяДата КАК КонтрольнаяДата,
	               |	CW_ТипыСлеженияСтатусы.Статус КАК Статус,
	               |	CW_ТипыСлеженияСтатусы.ШаблонОписания КАК ШаблонОписания,
	               |	CW_ТипыСлеженияСтатусы.ХранилищеОтбора КАК ХранилищеОтбора,
	               |	CW_ТипыСлеженияСтатусы.Ссылка.СтатусОборудованияПоУмолчанию КАК СтатусПоУмолчанию
	               |ИЗ
	               |	Справочник.CW_ТипыСлежения.Статусы КАК CW_ТипыСлеженияСтатусы
	               |ГДЕ
	               |	CW_ТипыСлеженияСтатусы.Ссылка = &ТипСлежения
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки УБЫВ";  
	
	Запрос.УстановитьПараметр("ТипСлежения", ОтслеживаемоеОборудование.ВариантСлежения.ТипСлежения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл       
		
		ИдентификаторПараметра = Выборка.КонтрольнаяДата.Идентификатор;
		Если Выборка.КонтрольнаяДата.ЭтоКонтрольнаяДата Тогда
			ИдентификаторПараметра = Выборка.КонтрольнаяДата.ИдентификаторФакт;
		КонецЕсли;  
		ИмяПоляКомпоновки = "Ссылка.["+ИдентификаторПараметра+"]";
		
		ПараметрыПроцедуры = Новый Структура;
		ПараметрыПроцедуры.Вставить("Грузоперевозка", 		Грузоперевозка);
		ПараметрыПроцедуры.Вставить("ХранилищеОтбора", 		Выборка.ХранилищеОтбора);
		ПараметрыПроцедуры.Вставить("ИмяПоляКомпоновки", 	ИмяПоляКомпоновки);
		
		Если ПроверитьУсловияСтатусаОборудования(ПараметрыПроцедуры) Тогда     
			
			ЗначениеКонтрольнойДаты = 	ПолучитьЗначениеДаты(Грузоперевозка, Выборка.КонтрольнаяДата, Выборка.НомерСтроки);
			
			НоваяСтрока = ТаблицаСтатусов.добавить();
			НоваяСтрока.Период 				= ЗначениеКонтрольнойДаты;    
			НоваяСтрока.ОбъектСлежения 		= ОтслеживаемоеОборудование; 
			НоваяСтрока.Статус 				= Выборка.Статус;      
			
			//Если Выборка.Статус <> Выборка.СтатусПоУмолчанию Тогда
				НоваяСтрока.Грузоперевозка 		= Грузоперевозка;     
			//КонецЕсли;
			
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("Статус",					Выборка.Статус);
			СтруктураСтроки.Вставить("ЗначениеКонтрольнойДаты",	ЗначениеКонтрольнойДаты);
			СтруктураСтроки.Вставить("КонтрольнаяДата", 		Выборка.КонтрольнаяДата);

			ТекстОписание = CW_Шаблоны.ОбработатьШаблонСтатусаОборудования(Выборка.ШаблонОписания, Грузоперевозка, СтруктураСтроки);
			НоваяСтрока.Описание 			= ТекстОписание;
		КонецЕсли
		
	КонецЦикла;
	   
	//Запись данных регистра
	РегистрыСведений.CW_СтатусыОборудованияНаСлежении.ЗаписатьДанныеВРегистр(ТаблицаСтатусов);

	
КонецПроцедуры   

Функция ПолучитьЗначениеДаты(Грузоперевозка, Параметр, НомерСтроки)  
	
	ЗначениеДаты = ТекущаяДата();    
	
	Отбор = Новый Структура;
	Отбор.Вставить("Параметр", Параметр);  
	
	мСтроки = Грузоперевозка.ПараметрыГрузоперевозки.НайтиСтроки(Отбор); 
	Если мСтроки.Количество() > 0 Тогда
		//Должна ыбть только одна строка
		
		СтрокаТекущая = мСтроки[0];  
		
		ЗначениеПараметра = СтрокаТекущая.Значение;
		Если Параметр.ЭтоКонтрольнаяДата Тогда
			ЗначениеПараметра = СтрокаТекущая.ЗначениеФакт; 
		КонецЕсли;  
		
		Год 	= Год(ЗначениеПараметра);
		Месяц 	= Месяц(ЗначениеПараметра);
		День 	= День(ЗначениеПараметра); 
		
		Час 	= Час(ЗначениеПараметра);
		Минута 	= Минута(ЗначениеПараметра);
		Секунда = Секунда(ЗначениеПараметра);
		
		Если Параметр.ЭтоКонтрольнаяДата Тогда
			Если НЕ Параметр.КонтрольнаяДатаИспользуетВремя Тогда
				Час 	= Час(ТекущаяДата());
				Минута 	= Минута(ТекущаяДата());
				Секунда = 0;
			КонецЕсли;
		Иначе
			Если Параметр.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
				Год 	= Год(ТекущаяДата());
				Месяц 	= Месяц(ТекущаяДата());
				День 	= День(ТекущаяДата());  
			КонецЕсли;   
			
			Если Параметр.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
				Час 	= Час(ТекущаяДата());
				Минута 	= Минута(ТекущаяДата());
				Секунда = 0;
			КонецЕсли;	
		КонецЕсли;
		
		Секунда = ?(Секунда=0, НомерСтроки, Секунда);
		
		ЗначениеДаты = Дата(Год, Месяц, День, Час, Минута, Секунда);
		
	КонецЕсли;
	
    Возврат ЗначениеДаты;
	
КонецФункции

Функция ПроверитьУсловияСтатусаОборудования(ПараметрыПроцедуры)  
	
	НастройкиСтатуса 		= ПараметрыПроцедуры.ХранилищеОтбора.Получить();
	
	СхемаКомпоновкиДанных 	= Справочники.CW_ТипыСлежения.ПолучитьМакет("МакетОтбораГрузоперевозок");
	Настройки 				= СхемаКомпоновкиДанных.НастройкиПоУмолчанию; 
	
	Если НастройкиСтатуса <> Неопределено Тогда
		_УФС.СкопироватьОтбор(НастройкиСтатуса.Отбор, Настройки.Отбор);
	КонецЕсли;
	
	ЭлементОтбора 					= Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ПараметрыПроцедуры.Грузоперевозка;
	ЭлементОтбора.Использование	 	= Истина;  
	
	ЭлементОтбора 					= Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ПараметрыПроцедуры.ИмяПоляКомпоновки);
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементОтбора.Использование	 	= Истина;  

	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	Результат = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат Результат.Количество() > 0;

КонецФункции
