&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектПечати", 		ОбъектПечати); 
	Параметры.Свойство("ШаблонДокумента", 	ШаблонДокумента);   
	
	Заголовок = СокрЛП(ОбъектПечати);
	
	Если НЕ ЗначениеЗаполнено(ОбъектПечати) Тогда
		ВызватьИсключение НСтр("ru = 'Не определен документ, для которого необходимо распечатать текст.'");
	КонецЕсли;      
	Если НЕ ЗначениеЗаполнено(ШаблонДокумента) Тогда
		ВызватьИсключение НСтр("ru = 'Не определен шаблон документа.'");
	КонецЕсли;      
	
	//Настройки колонтитулов  
	Если ШаблонДокумента.ВыводитьКолонтитулы Тогда
		Настройки = ШаблонДокумента.НастройкиКолонтитулов.Получить();   
		
		Если ТипЗнч(Настройки) = Тип("Структура")  Тогда
			НастройкиКолонтитулов = новый ФиксированнаяСтруктура(Настройки);
		КонецЕсли;
	КонецЕсли;
	//Настройки колонтитулов  
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматированныйДокументПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяФормата", "MXL");          
	
	ОткрытьФорму("ОбщаяФорма.CW_СохранениеДокумента", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры       

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) 
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.CW_СохранениеДокумента") Тогда
		
		Если ВыбранноеЗначение <> Неопределено 
			И ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
			
			ФорматыСохранения = ВыбранноеЗначение.ФорматыСохранения;
			Если ВыбранноеЗначение.ВариантСохранения = "СохранитьВПапку" Тогда
				СохранитьФайлыВКаталог(ВыбранноеЗначение);
			Иначе
				ЗаписатьФайлыНаСервере(ВыбранноеЗначение);
				Оповестить("ОбновитьНаличиеПрикрепленныхФайлов");
				Состояние(НСтр("ru = 'Сохранение успешно завершено.'"));
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры      

&НаСервере
Процедура ЗаписатьФайлыНаСервере(ВыбранноеЗначение)
	
	// подготовка временной папки
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	
	// Проверим наличие имени файла, заданное пользователем. 
	// В случае его отсутствия в качестве имени будем использовать наименование шаблона документа
	Если ЗначениеЗаполнено(ВыбранноеЗначение.ИмяФайла) Тогда
		ИмяФайлаБезРасширения = ВыбранноеЗначение.ИмяФайла;		
	Иначе
		ИмяФайлаБезРасширения = ШаблонДокумента.Наименование;		
	КонецЕсли;
	
	ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СокрЛП(ИмяФайлаБезРасширения));
	
	Для Каждого ФорматФайла Из ВыбранноеЗначение.ФорматыСохранения Цикл
		
		Если ФорматФайла = "DOCX" Тогда
			// Подготовим DOCX документ на основе табличного документа
			ИмяФайла 	= ИмяФайлаБезРасширения+".docx";    
			Расширение 	= ".docx";
			ПолноеИмяФайла = ПодготовитьDOCXНаОсновеТабличногоДокумента(ИмяВременнойПапки, ИмяФайла);
			
		ИначеЕсли ФорматФайла = "PDF" Тогда
			// Подготовим PDF документ на основе табличного документа
			ИмяФайла 	= ИмяФайлаБезРасширения + ".pdf";
			Расширение 	= ".pdf";
			ПолноеИмяФайла = ПодготовитьPDFНаОсновеТабличногоДокумента(ИмяВременнойПапки, ИмяФайла);
			
		ИначеЕсли ФорматФайла = "MXL" Тогда
			// Подготовим PDF документ на основе табличного документа
			ИмяФайла 	= ИмяФайлаБезРасширения + ".mxl";
			Расширение 	= ".mxl";
			ПолноеИмяФайла = ПодготовитьMXLНаОсновеТабличногоДокумента(ИмяВременнойПапки, ИмяФайла);
			
		ИначеЕсли ФорматФайла = "HTML" Тогда
			// Подготовим HTML документ на основе табличного документа
			ИмяФайла 	= ИмяФайлаБезРасширения + ".htm";
			Расширение 	= ".htm";
			ПолноеИмяФайла = ПодготовитьHTMLНаОсновеТабличногоДокумента(ИмяВременнойПапки, ИмяФайла);
			
		КонецЕсли;                          
		
		ОбъектыАрхива = Новый Массив;
		ОбъектыАрхива.Добавить(ОбъектПечати);  
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
		Хранение = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);

		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("Имя",			ИмяФайла);
		ДанныеФайла.Вставить("Расширение",	Расширение);
		ДанныеФайла.Вставить("Хранение",	Хранение);
		
		ПомещенныеФайлы = Новый Массив;
		ПомещенныеФайлы.Добавить(ДанныеФайла);

		CW_РаботаСФайламиСервер.ПрикрепитьФайлы(ПомещенныеФайлы, ОбъектыАрхива, ВыбранноеЗначение.ТипДокумента); 
		
	КонецЦикла;
	
	// Удалим временный файл.
	УдалитьВременныйФайлНаСервер(ИмяВременнойПапки);
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьMXLНаОсновеТабличногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.MXL);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

&НаСервере
Функция ПодготовитьDOCXНаОсновеТабличногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.DOCX);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

&НаСервере
Функция ПодготовитьPDFНаОсновеТабличногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

&НаСервере
Функция ПодготовитьHTMLНаОсновеТабличногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.HTML);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции


&НаКлиенте
Процедура СохранитьФайлыВКаталог(Знач ВыбранноеЗначение)
	
	МассивДанных = ПоместитьФайлыВоВременноеХранилищеНаСервере(ВыбранноеЗначение.ФорматыСохранения);
	
	#Если ВебКлиент Тогда
		Для Каждого Элемент Из МассивДанных Цикл
			
			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
			ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
			
			НачатьПолучениеФайлаССервера(Элемент.АдресВоВременномХранилище, Элемент.Представление, ПараметрыДиалогаПолученияФайлов);
			
		КонецЦикла;
	#Иначе 
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("КаталогДляСохранения", ВыбранноеЗначение.КаталогДляСохранения);
	
		ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьФайлыВКаталогЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		КаталогДляСохранения = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ВыбранноеЗначение.КаталогДляСохранения);
		
		ПолучаемыеФайлы = Новый Массив;
		Для Каждого Элемент Из МассивДанных Цикл
		
			ПолучаемыйФайл 			= Новый ОписаниеПередаваемогоФайла;
			ПолучаемыйФайл.Имя 		= Элемент.Представление;
			ПолучаемыйФайл.Хранение = Элемент.АдресВоВременномХранилище;
			
			ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
		
		КонецЦикла;
		
		НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, КаталогДляСохранения, Ложь);
		
	#КонецЕсли

КонецПроцедуры

&НаСервере
Функция ПоместитьФайлыВоВременноеХранилищеНаСервере(ФорматыСохранения)
	
	Папка = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(Папка);
	
	// Указываем имя файла вложения
	ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СокрЛП(ОбъектПечати));
	
	МассивДанных = Новый Массив;
	Для Каждого ФорматФайла Из ФорматыСохранения Цикл
		
		Если ФорматФайла = "DOCX" Тогда
			ИмяФайла = ИмяФайлаБезРасширения + ".docx";
			// Подготовим DOCX документ на основе табличного документа
			ПолноеИмяФайла = ПодготовитьDOCXНаОсновеТабличногоДокумента(Папка, ИмяФайла);
		ИначеЕсли ФорматФайла = "PDF" Тогда
			ИмяФайла = ИмяФайлаБезРасширения + ".pdf";
			// Подготовим PDF документ на основе табличного документа
			ПолноеИмяФайла = ПодготовитьPDFНаОсновеТабличногоДокумента(Папка, ИмяФайла);
		ИначеЕсли ФорматФайла = "MXL" Тогда
			ИмяФайла = ИмяФайлаБезРасширения + ".mxl";
			// Подготовим PDF документ на основе табличного документа
			ПолноеИмяФайла = ПодготовитьMXLНаОсновеТабличногоДокумента(Папка, ИмяФайла);
		КонецЕсли;
		
		ДвоичныеДанные 				= Новый ДвоичныеДанные(ПолноеИмяФайла);
		ПутьВоВременномХранилище 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтотОбъект.УникальныйИдентификатор);   
		
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("Представление", ИмяФайла);
		ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
		
		МассивДанных.Добавить(ОписаниеФайла);
		
	КонецЦикла;  
	
	УдалитьВременныйФайлНаСервер(Папка);
	
	Возврат МассивДанных;

КонецФункции

&НаКлиенте
Процедура СохранитьФайлыВКаталогЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Если ПолученныеФайлы = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'При сохранении возникла ошибка'"));
	Иначе
		Состояние(НСтр("ru = 'Сохранение успешно завершено'"), , НСтр("ru = 'в папку:'") + " " + ДополнительныеПараметры.КаталогДляСохранения);
	КонецЕсли;

КонецПроцедуры

 &НаСервере
Процедура УдалитьВременныйФайлНаСервер(ИмяФайла)

	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;

	// Удалим временный файл.
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		СведенияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось удалить временный файл по причине: %1'"),
			ПодробноеПредставлениеОшибки(СведенияОбОшибке));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Сохранение текста документа.'", 
			ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ТекстСообщения);
	КонецПопытки;

КонецПроцедуры   

 &НаСервереБезКонтекста
Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения 	= Файл.ИмяБезРасширения;
	Расширение 			= Файл.Расширение;
	Папка 				= Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	ПродолжитьФормированиеДокументаНаСервереВФоне();
	
КонецПроцедуры

&НаСервере
Процедура ПродолжитьФормированиеДокументаНаСервереВФоне()  
	
	ХранилищеШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонДокумента, "ХранилищеШаблона");  
	Если ТипЗнч(ХранилищеШаблона) = Тип("ХранилищеЗначения") Тогда
		Макет = ХранилищеШаблона.Получить();
	КонецЕсли; 
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Макет", 		Макет); 
	ПараметрыПроцедуры.Вставить("ОбъектПечати",	ОбъектПечати); 
	
	ТабличныйДокумент = CW_ШаблоныДокументовСерверВызовСервера.ЗаполнитьMXLДокументПоШаблону(ПараметрыПроцедуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПодписьИПечатьПриИзменении(Элемент)
	
	ВывестиПодписьИПечать();

КонецПроцедуры

&НаКлиенте
Процедура ВывестиПодписьИПечать()
	
	Перем ДвоичныеДанные, Картинка, КартинкаМакета;
	
	Если ТабличныйДокумент.Рисунки.Количество() > 0 Тогда  
		
		Для Каждого КартинкаМакета из ТабличныйДокумент.Рисунки Цикл
			Если СтрНачинаетсяС(КартинкаМакета.Имя, "ШтрихКод") Тогда
				Продолжить;
			КонецЕсли;
			
			КартинкаМакета.ВыводитьНаПечать = ВывестиПодписьИПечать;
			
			Картинка  = Новый Картинка;
			
			Если ВывестиПодписьИПечать Тогда
				Если СтрНачинаетсяС(КартинкаМакета.Имя, "ПечатьОрганизации") Тогда
					ДвоичныеДанные = CW_ШаблоныДокументовФункции.НашиРеквизиты_ПечатьОрганизации(ОбъектПечати);
				КонецЕсли;     
				Если СтрНачинаетсяС(КартинкаМакета.Имя, "РуководительПодпись") Тогда
					ДвоичныеДанные = CW_ШаблоныДокументовФункции.НашиРеквизиты_РуководительПодпись(ОбъектПечати);
				КонецЕсли; 
				
				Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
					Картинка = новый Картинка(ДвоичныеДанные);   
				КонецЕсли;
			КонецЕсли; 
			
			КартинкаМакета.Картинка = Картинка;  
			
		КонецЦикла 
		
	КонецЕсли;
	
КонецПроцедуры


//Настройки колонтитулов  
&НаСервере
Процедура УстановитьКолонтитулыНаСервере(Настройки)
	
	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(ТабличныйДокумент,,,Настройки);
	//УправлениеКолонтитулами
	
КонецПроцедуры
//Настройки колонтитулов  
