#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура _ЗаполнитьРеквизитыОрганизацииРус(Запись) Экспорт
	// --- 
	
	Договор = Запись.Договор;
	
	//Создаем отбор для получения бухгалтера
	Отбор = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо", Договор.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Запись.ГлавныйБухгалтерОрганизации = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(Запись.Период, Отбор).ФизическоеЛицо;
	
	//Меняем отбор для получения руководителя
	Отбор.ОтветственноеЛицо = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель;
	рс = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(ТекущаяДата(), Отбор); // МетаданныеБП
	Запись.РуководительОрганизации          = рс.ФизическоеЛицо;
	Запись.ДолжностьРуководителяОрганизации = рс.Должность;
	
	_СведенияОбОрганизации = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Договор.Организация, Запись.Период); // ВызовБП
	Запись.АдресОрганизации   =_СведенияОбОрганизации.ЮридическийАдрес;
	Запись.ТелефонОрганизации =_СведенияОбОрганизации.Телефоны;
	
	Запись.РасчетныйСчетОрганизации = Договор.Организация.ОсновнойБанковскийСчет;	
	
	// --- 
КонецПроцедуры

Процедура _ЗаполнитьРеквизитыОрганизацииАнгл(Запись, Валюта) Экспорт
	// --- 
	
	Договор = Запись.Договор;
	
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	CW_ИностранныеБанковскиеСчета.Ссылка
		|ИЗ
		|	Справочник.CW_ИностранныеБанковскиеСчета КАК CW_ИностранныеБанковскиеСчета
		|ГДЕ
		|	CW_ИностранныеБанковскиеСчета.Владелец = &Организация
		|	И CW_ИностранныеБанковскиеСчета.ВалютаДенежныхСредств = &Валюта"
	);
	з.УстановитьПараметр("Организация", Договор.Организация);
	з.УстановитьПараметр("Валюта", Валюта);
	рз = з.Выполнить();
	выб = рз.Выбрать();
	Если выб.Следующий() Тогда 
		Запись.РасчетныйСчетОрганизацииИностранный = выб.Ссылка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.РуководительОрганизации) Тогда 
		Отбор = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо", Договор.Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		рс = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(ТекущаяДата(), Отбор);
		Запись.РуководительОрганизации          = рс.ФизическоеЛицо;
		Запись.ДолжностьРуководителяОрганизации = рс.Должность;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.ГлавныйБухгалтерОрганизации) Тогда 
		Отбор = Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо", Договор.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		Запись.ГлавныйБухгалтерОрганизации = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(ТекущаяДата(), Отбор).ФизическоеЛицо;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.РуководительОрганизации) Тогда 
		стр = РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Запись.РуководительОрганизации);
		Если НЕ ЗначениеЗаполнено(стр) Тогда 
			стр = _СФ.Стр_Транслит(Запись.РуководительОрганизации.Наименование);
			РегистрыСведений.CW_ПараметрыСотрудников.УстановитьФамилиюИмяАнгл(Запись.РуководительОрганизации, стр);
		КонецЕсли;
		//_РуководительОрганизацииАнглПриИзменении(Запись);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ГлавныйБухгалтерОрганизации) Тогда 
		стр = РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Запись.ГлавныйБухгалтерОрганизации);
		Если НЕ ЗначениеЗаполнено(стр) Тогда 
			стр = _СФ.Стр_Транслит(Запись.ГлавныйБухгалтерОрганизации.Наименование);
			РегистрыСведений.CW_ПараметрыСотрудников.УстановитьФамилиюИмяАнгл(Запись.ГлавныйБухгалтерОрганизации, стр);
		КонецЕсли;
		//_ГлавныйБухгалтерОрганизацииАнглПриИзменении(Запись);
	КонецЕсли;

	з = Новый Запрос(
		"ВЫБРАТЬ
		|	CW_УчетнаяПолитикаСрезПоследних.ДолжностьРуководителяОрганизацииАнгл,
		|	CW_УчетнаяПолитикаСрезПоследних.АдресОрганизацииАнгл
		|ИЗ
		|	РегистрСведений.CW_УчетнаяПолитика.СрезПоследних КАК CW_УчетнаяПолитикаСрезПоследних
		|ГДЕ
		|	CW_УчетнаяПолитикаСрезПоследних.Организация = &Организация"
	);
	з.УстановитьПараметр("Организация", Договор.Организация);
	рз = з.Выполнить();
	выб = рз.Выбрать();
	Если выб.Следующий() Тогда 
		Если ЗначениеЗаполнено(выб.АдресОрганизацииАнгл) Тогда 
			Запись.АдресОрганизацииАнгл = выб.АдресОрганизацииАнгл;
		КонецЕсли;
		Если ЗначениеЗаполнено(выб.ДолжностьРуководителяОрганизацииАнгл) Тогда 
			Запись.ДолжностьРуководителяОрганизацииАнгл = выб.ДолжностьРуководителяОрганизацииАнгл;
		КонецЕсли;
	КонецЕсли;
	
	// --- 
КонецПроцедуры

Функция _ЗаполнитьРеквизитыКонтрагента(Запись, Язык) Экспорт
	// --- 
	
	СведенияКонтрагент = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Запись.Договор.Владелец, Запись.Период); // ВызовБП
	// --- 
	
	Адрес = "";
	Если (ЗначениеЗаполнено(СведенияКонтрагент.ФактическийАдрес)) Тогда
		Адрес = СведенияКонтрагент.ФактическийАдрес;
	Иначе
		Адрес = СведенияКонтрагент.ЮридическийАдрес;
	КонецЕсли; 
	
	Если (Язык = "Рус") Тогда
		
		Запись.Адрес = Адрес;
		Запись.Телефон = СведенияКонтрагент.Телефоны;
		
	Иначе
		
		Запись.АдресАнгл = _сф.стр_Транслит(Адрес);
		
	КонецЕсли; 
	
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Запись.Договор.Владелец);
	Запрос.Текст=
	"ВЫБРАТЬ
	|	КонтактныеЛица.Должность,
	|	КонтактныеЛица.Ссылка,
	|	КонтактныеЛица.Наименование,
	|	КонтактныеЛица.Роль
	|ИЗ
	|	Справочник.КонтактныеЛица КАК КонтактныеЛица
	|ГДЕ
	|	КонтактныеЛица.ОбъектВладелец = &Контрагент";	
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	РольРуководителя = Константы.CW_РольРуководителя.Получить();
	Если (ЗначениеЗаполнено(РольРуководителя)) Тогда
		
		Отбор = Новый Структура("Роль",РольРуководителя);
		ТаблицаРуководителей = ТЗ.Скопировать(Отбор);
		// --- 
		Если (ТаблицаРуководителей.Количество() <> 0) Тогда
			СтрокаРуководителя = ТаблицаРуководителей[0];
			
			Если (Язык = "Рус") Тогда
				
				Запись.ДолжностьРуководителя = СтрокаРуководителя.Должность;
				Запись.Руководитель = СтрокаРуководителя.Наименование;
				
			Иначе
				
				Запись.ДолжностьРуководителяАнгл = _сф.стр_Транслит(СтрокаРуководителя.Должность);
				Запись.РуководительАнгл = _сф.стр_Транслит(СтрокаРуководителя.Наименование);
				
			КонецЕсли; 
			
			
		КонецЕсли; 
		
		
	КонецЕсли; 
	// --- 
	РольГлавногоБухгалтера = Константы.CW_РольГлавногоБухгалтера.Получить();
	Если (ЗначениеЗаполнено(РольГлавногоБухгалтера)) Тогда
		
		Отбор = Новый Структура("Роль",РольГлавногоБухгалтера);
		ТаблицаБухгалтеров = ТЗ.Скопировать(Отбор);
		// --- 
		Если (ТаблицаБухгалтеров.Количество() <> 0) Тогда
			СтрокаБухгалтера = ТаблицаБухгалтеров[0];
			
			Если (Язык = "Рус") Тогда
				
				Запись.ГлавныйБухгалтер = СтрокаБухгалтера.Наименование;
				
			Иначе
				
				Запись.ГлавныйБухгалтерАнгл = _сф.стр_Транслит(СтрокаБухгалтера.Наименование);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 

	// --- 
КонецФункции

Функция ПолучитьОтветственныхЛицИзКарточкиОрганизации(Организация, Знач ДатаСреза = Неопределено) Экспорт
	
	ДатаСреза = ?(ЗначениеЗаполнено(ДатаСреза), ДатаСреза, ТекущаяДата());
	
	Результат = Новый Структура("РуководительОрганизации,ДолжностьРуководителя,ГлавныйБухгалтер,ДолжностьГлавногоБухгалтера",Неопределено,Неопределено,Неопределено,Неопределено);
	
	мОтветственныеЛица = Новый Массив;
	мОтветственныеЛица.Добавить(ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель"));
	мОтветственныеЛица.Добавить(ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтветственныеЛицаОрганизаций.ОтветственноеЛицо КАК ОтветственноеЛицо,
	               |	ОтветственныеЛицаОрганизаций.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ОтветственныеЛицаОрганизаций.Должность КАК Должность
	               |ИЗ
	               |	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	               |			&ТекущаяДата,
	               |			СтруктурнаяЕдиница = &Организация
	               |				И ОтветственноеЛицо В (&мОтветственныеЛица)) КАК ОтветственныеЛицаОрганизаций";
	
	Запрос.УстановитьПараметр("ТекущаяДата", 		ДатаСреза);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("мОтветственныеЛица", мОтветственныеЛица);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОтветственноеЛицо = ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель") Тогда
			Результат.Вставить("РуководительОрганизации", 	Выборка.ФизическоеЛицо);
			Результат.Вставить("ДолжностьРуководителя",		Выборка.Должность);
		КонецЕсли;
		Если Выборка.ОтветственноеЛицо = ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер") Тогда
			Результат.Вставить("ГлавныйБухгалтер", 				Выборка.ФизическоеЛицо);
			Результат.Вставить("ДолжностьГлавногоБухгалтера", 	Выборка.Должность);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;      
	
КонецФункции

Процедура УстановитьВыводQRКода() Экспорт

	Набор = РегистрыСведений.CW_ПараметрыДоговоров.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Для Каждого СтрокаНабора из Набор Цикл  
		Если СтрокаНабора.ЯзыкПечатиДокументов  = 0 Тогда
			СтрокаНабора.НужноПечататьQRКод = Истина;        
		КонецЕсли;
	КонецЦикла;
	Набор.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьПолРуководителя() Экспорт
	
	Набор =  РегистрыСведений.CW_ПараметрыДоговоров.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	Для Каждого Запись из Набор Цикл
		Запись.РуководительПол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской");
		Запись.ГлавныйБухгалтерПол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской");
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры


//Обновление

#КонецЕсли