
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)   
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды);

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродложитьПодключениеКСервису", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВопрос(Оповещение, "Будет выполнено подключение к сервису 
	                            |""Доходы нерезидентов"". 
								|Продолжить?", Режим, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПродложитьПодключениеКСервису(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ CW_РаботаСВнешнимиРесурсамиСервер.ПроверитьПараметрыАвторизацииНаСервереТехподдрежки() Тогда
		ПоказатьПредупреждение(,"Не указаны параметры авторизации на сервере техподдержки!",,"Авторизация");
	Иначе   
		
		Если Не ПроверитьНаличиеПодпискиМодуля() Тогда
			ПоказатьПредупреждение(,"Подключение сервиса возможно только при условии наличия действующей подписки на обновление модуля.");
		Иначе
			Оповещение = Новый ОписаниеОповещения("ОбработатьРезультатПодключенияКСервису", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("ОбщаяФорма.CW_ДоходыНерезидентовВводПинКода",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПроверитьНаличиеПодпискиМодуля() 
	
	Логин = CW_РегистрацияПрограммыСервер.ПолучитьЛогинПользовательяИнтернетПоддержки();
	Если Логин = Неопределено Тогда
		Возврат Ложь;
	Иначе
		РегистрационныйНомер = Сред(Логин, 2);	
		
		Ответ = CW_БухгалтерияЭкспедитораСервер.ПроверитьНаличиеПодписки(РегистрационныйНомер, "AF");
		Если Ответ.КодСостояния = 200 Тогда  
			Возврат Истина;	
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатПодключенияКСервису(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		//Отказ от подклчюения
		Возврат;
	КонецЕсли;   
	
	РезультатПодключения = ОбработатьРезультатПодключенияКСервисуНаСервере(Результат); 
	
	Если РезультатПодключения.Успешно Тогда 
		
		Если  ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник.ИмяФормы = "ОбщаяФорма.CW_Настройки" Тогда
			ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник.CW_ДоходыНерезидентовИспользуется = РезультатПодключения.Успешно;
			ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник.Элементы.ОбщаяКомандаCW_ДоходыНерезидентовПодключить.Видимость = Не РезультатПодключения.Успешно;
		КонецЕсли;
		
		ПоказатьПредупреждение(, "Cервис ""Доходы нерезидентов""
		|успешно подключен!");
		
		ОбновитьИнтерфейс();   
		Оповестить("ПодключенСервисДоходыНерезидентов");
		
	Иначе
		ПоказатьПредупреждение(, РезультатПодключения.Сообщение);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ОбработатьРезультатПодключенияКСервисуНаСервере(Результат); 
	
	Возврат CW_ДоходыНерезидентовДополнительный.ЗавершитьПодклчюениеПодписки(Результат); 
	
КонецФункции

