#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ПростойИнтерфейсПродажи", , Истина);
	
	ОткрытьФорму(
		"Обработка.ПанелиПростойИнтерфейс.Форма.ПанельПродажи", ,
		ПараметрыВыполненияКоманды.Источник,
		"Обработка.ПанелиПростойИнтерфейс.Форма.ПанельПродажи" + ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", ""),
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти