
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьУдаляемые = ложь;      
	
	Параметры.Свойство("Режим", Режим);
	
	ТаблицаЗначений = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы);
	ТаблицаРасширений.Загрузить(ТаблицаЗначений);  
	
	Для Каждого СтрокаТаблицы из ТаблицаРасширений Цикл
		СтрокаТаблицы.ТекстВерсия = "Версия:"; 
		Если ЕстьУдаляемые = Ложь и Режим = "ИСПРАВЛЕНИЯ" Тогда
			Если ЗначениеЗаполнено(СтрокаТаблицы.Удаляемые) Тогда
				ЕстьУдаляемые = истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ГруппаПояснениеОтозвано.Видимость = ЕстьУдаляемые;
	
	ОбновитьИтогиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогиНаСервере()
	
	ДанныеСтрок = ПолучитьКоличествоВыбрано();
	
	Если Режим = "ИСПРАВЛЕНИЯ" Тогда
		ТекстВыбраноРасширений = "Выбрано исправлений (патчей) "+ Строка(ДанныеСтрок.Выбрано)+ " из "+ Строка(ДанныеСтрок.Всего);
	Иначе
		ТекстВыбраноРасширений = "Выбрано расширений "+ Строка(ДанныеСтрок.Выбрано)+ " из "+ Строка(ДанныеСтрок.Всего);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоВыбрано()
	
	Результат = Новый Структура;
	Результат.Вставить("Всего", ТаблицаРасширений.Количество());
	
	Отбор = Новый Структура("Отметка", Истина);
	мСтроки = ТаблицаРасширений.НайтиСтроки(Отбор);

	Результат.Вставить("Выбрано", мСтроки.Количество());
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Процедура СнятьВсеПометки(Команда)
	
	ОбработатьОтметкиНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеПометки(Команда)
	
	ОбработатьОтметкиНаСервере(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтметкиНаСервере(Отметка)
	
	Для Каждого СтрокаМассива из ТаблицаРасширений Цикл
		СтрокаМассива.Отметка = Отметка;
	КонецЦикла;
	
	ОбновитьИтогиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	ЭтаФорма.Закрыть(ПолучитьПараметрЗакрытия());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрЗакрытия()
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаРасширений.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ИсправленияОтметкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаРасширений.ТекущаяСтрока;
	ОбновитьИтогиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодробно(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаРасширений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,"Для просмотра описания необходимо выбрать стрку расширения!",60);
		Возврат;
	КонецЕсли;
	
	ПараметрыОписания = Новый Структура;
	ПараметрыОписания.Вставить("ИмяИсправления",		СокрЛП(ТекущиеДанные.Наименование));
	ПараметрыОписания.Вставить("ТекстОписанияСтрока",	СокрЛП(ТекущиеДанные.Описание));

	ОткрытьФорму("ОбщаяФорма.CW_ФормаОписанияИсправлений",ПараметрыОписания,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
	
КонецПроцедуры

