#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	CW_УчетСобственногоТранспортаСервер.ПодготовитьДвженияКПроведению(ЭтотОбъект);
	
	МассивИменРегистров = CW_УчетСобственногоТранспортаСервер.ПолучитьИспользуемыеРегистры(ЭтотОбъект);
	
	ДанныеДляПроведения = ПодготовитьДанныеДляПроведения(МассивИменРегистров);
	
	CW_УчетСобственногоТранспортаСервер.ЗарегистрироватьДвиженияДокумента(Движения,ДанныеДляПроведения,МассивИменРегистров);	
	
КонецПроцедуры

Функция ПодготовитьДанныеДляПроведения(МассивИменРегистров)
	
	ВедетсяУчетШинТранспортногоСредства 	= ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетШинТранспортногоСредства");
	ДанныеДляПроведения 					= CW_УчетСобственногоТранспортаСервер.ПодготовитьТаблицыДанныхДляПроведения(МассивИменРегистров);
	СтуктураУстанавилваемыхПараметров 		= CW_УчетСобственногоТранспортаСервер.ПолучитьУстанавливаемыеПараметры();
	
	Для Каждого СтрокаДок из СписокТранспортныхСредств Цикл
		
		//----
		//СостояниеТС
		СтрокаСостояния = ДанныеДляПроведения.CW_СостоянияТС.Добавить();
		СтрокаСостояния.Период = Дата;
		СтрокаСостояния.ТранспортноеСредство 	= СтрокаДок.ТранспортноеСредство;
		СтрокаСостояния.Состояние 				= СтрокаДок.СостояниеТранспортногоСредства;
		
		//----
		//ПараметрыТС
		Для Каждого ЭлементСтркутуры из СтуктураУстанавилваемыхПараметров Цикл
			СтрокаПараметрыТС = ДанныеДляПроведения.CW_ПараметрыТС.Добавить();
			СтрокаПараметрыТС.Период 						= Дата;
			СтрокаПараметрыТС.ТранспортноеСредство 			= СтрокаДок.ТранспортноеСредство;
			СтрокаПараметрыТС.ПараметрТранпортногоСредства 	= ЭлементСтркутуры.Значение;
			
			Если ЭлементСтркутуры.Ключ = "Организация" Тогда
				ЗначениеПараметра = Организация;
			Иначе
				ЗначениеПараметра = СтрокаДок[ЭлементСтркутуры.Ключ];
			КонецЕсли;
			
			СтрокаПараметрыТС.Значение 	= ЗначениеПараметра;
			
		КонецЦикла;
		
		//----
		//ПробегТС
		Если  (СтрокаДок.Пробег <> 0) или   (СтрокаДок.ПробегСГрузом <> 0) Тогда 
			СтрокаПробегТС = ДанныеДляПроведения.CW_ПробегТС.Добавить();
			СтрокаПробегТС.Период 					= Дата;
			СтрокаПробегТС.ТранспортноеСредство 	= СтрокаДок.ТранспортноеСредство;
			СтрокаПробегТС.Пробег 					= СтрокаДок.Пробег;
			СтрокаПробегТС.ПробегСГрузом 			= СтрокаДок.ПробегСГрузом;
		КонецЕсли;
		//----
		//ПробегТС
		Если  (СтрокаДок.Пробег <> 0) Тогда 
			СтрокаПробегТС = ДанныеДляПроведения.CW_ПоказанияОдометровТранспортныхСредств.Добавить();
			СтрокаПробегТС.Период 					= Дата;
			СтрокаПробегТС.ТранспортноеСредство 	= СтрокаДок.ТранспортноеСредство;
			СтрокаПробегТС.Пробег 					= СтрокаДок.Пробег;
		КонецЕсли;
		
		//ТопливоТС
		Если  (СтрокаДок.ТопливоКоличество <> 0) Тогда 
			СтрокаТопливоТС = ДанныеДляПроведения.CW_ТопливоТС.Добавить();
			СтрокаТопливоТС.Период 					= Дата;
			СтрокаТопливоТС.ВидДвижения 			= ВидДвиженияНакопления.Приход;
			СтрокаТопливоТС.Организация 			= Организация;
			СтрокаТопливоТС.ТранспортноеСредство 	= СтрокаДок.ТранспортноеСредство;
			СтрокаТопливоТС.Топливо 				= СтрокаДок.ТранспортноеСредство.ОсновноеТопливо;
			СтрокаТопливоТС.Количество 				= СтрокаДок.ТопливоКоличество;
		КонецЕсли;
		
	КонецЦикла;
	
	// ---
	Если ВедетсяУчетШинТранспортногоСредства Тогда
	
		Для каждого СтрокаШин из ШиныТранспортногоСредства Цикл
			
			СтрокаСостояния = ДанныеДляПроведения.CW_ШиныТС.Добавить();
			СтрокаСостояния.Период = Дата;
			СтрокаСостояния.ТранспортноеСредство 	= СтрокаШин.ТранспортноеСредство;
			СтрокаСостояния.МестоУстановкиШины 		= СтрокаШин.МестоУстановкиШины;
			СтрокаСостояния.Шина 					= СтрокаШин.Шина;
			
			Если СтрокаШин.Пробег <> 0 Тогда
				СтрокаСостояния = ДанныеДляПроведения.CW_ПробегШин.Добавить();
				СтрокаСостояния.Период = Дата;
				СтрокаСостояния.Шина 					= СтрокаШин.Шина;
				СтрокаСостояния.ТранспортноеСредство 	= СтрокаШин.ТранспортноеСредство;
				СтрокаСостояния.Пробег 					= СтрокаШин.Пробег;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// ---	
	
	Возврат ДанныеДляПроведения;
	
	
КонецФункции

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = CW_Документы.ПрефиксОрганизации(Организация);
	
КонецПроцедуры

#КонецЕсли
