#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает признак участия контрагента в системе маркировки по определенной группе товаров
// по данным пользователя и ИСМП
//
// Параметры:
//  <Контрагент>  - <СправочникСсылка.Контрагенты> - проверяемый контрагент
//  <ВидыМаркируемойПродукции>  - <Массив> - список проверяемых видов продукции
//
// Возвращаемое значение:
//   <Булево, Неопределено>   - ИСТИНА - контрагент является участником
//            ЛОЖЬ - не является участником
//            НЕОПРЕДЕЛЕНО - не удалось определить статус участника
//
Функция УчастникСистемыМаркировки(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент",    Контрагент);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(СтатусыКонтрагентовИСМП.СтатусУчастника) КАК СтатусУчастника
	|ИЗ
	|	РегистрСведений.СтатусыКонтрагентовИСМП КАК СтатусыКонтрагентовИСМП
	|ГДЕ
	|	СтатусыКонтрагентовИСМП.Контрагент = &Контрагент";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЭтоУчастникСистемыМаркировки = Истина;
	Если Выборка.Следующий() Тогда
		ЭтоУчастникСистемыМаркировки = Выборка.СтатусУчастника <> 2;
	КонецЕсли;
	
	Возврат ЭтоУчастникСистемыМаркировки;
КонецФункции

#КонецОбласти

#КонецЕсли
 
