#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки = ПрочитатьНастройки();
	ПоказыватьПриЗапуске = Настройки.ПоказыватьПриЗапуске;
	ИмяТекущегоМакета = Параметры.ИмяТекущегоМакета;
	ТекущийИдентификатор = Параметры.ТекущийИдентификатор;
	Если Не ЗначениеЗаполнено(ИмяТекущегоМакета) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Настройки, "ИмяТекущегоМакета,ТекущийИдентификатор");
	КонецЕсли;
	СформироватьОглавление();
	ПроверитьНастройкиПриОткрытии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьСтартовуюСтраницу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки(ИмяТекущегоМакета, ТекущийИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеОглавлениеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекстСсылки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСобытия, "href", "");
	ПерейтиПоСсылкеИзОглавления(ТекстСсылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекстСсылки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСобытия, "href", "");
	ПерейтиПоСсылкеИзДокумента(ТекстСсылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаДокументСформирован(Элемент)
	
	Если ТекущийИдентификатор = "" Тогда
		ТекущийИдентификатор = ОсновнойИдентификаторМакета(ИмяТекущегоМакета);
	КонецЕсли;
	ПоказатьПодраздел(ТекущийИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОглавление()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СоставитьОглавлениеИзМакетов(ОбработкаОбъект);
	СформироватьHTMLОглавления(ОбработкаОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СоставитьОглавлениеИзМакетов(ОбработкаОбъект)
	
	ОтключенныеМакеты = ОтключенныеМакеты();
	
	МетаданныеОбработки = ОбработкаОбъект.Метаданные(); 
	
	Для каждого Макет Из МетаданныеОбработки.Макеты Цикл
		
		ИмяМакета = Макет.Имя;
		Если Не СтрНачинаетсяС(ИмяМакета, "Раздел") Тогда
			Продолжить;
		КонецЕсли;
		ПоказыватьМакет = ОтключенныеМакеты.Найти(ИмяМакета) = Неопределено;
		Если Не ПоказыватьМакет Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущийМакет = ОбработкаОбъект.ПолучитьМакет(ИмяМакета);
		
		ТекущийДокументHTML = ТекущийМакет.ПолучитьДокументHTML();
		ТекстФильтра = "{""type"": ""hasattribute"", ""value"": {""value"": ""id"", ""operation"": ""nameequals""}}";
		ВсеНайденныеЭлементы = ТекущийДокументHTML.НайтиПоФильтру(ТекстФильтра);
		// Пропускаем служебные идентификаторы, которые добавляет платформа и скрипт обработки прокрутки
		НайденныеЭлементы = Новый Массив;
		Для каждого Элемент Из ВсеНайденныеЭлементы Цикл
			Если СтрНачинаетсяС(Элемент.Идентификатор, "1C_") Тогда
				Продолжить;
			КонецЕсли;
			НайденныеЭлементы.Добавить(Элемент);
		КонецЦикла;
		Если Не ЗначениеЗаполнено(НайденныеЭлементы) Тогда
			// Некорректный макет - нет ни одного идентификатора
			Продолжить;
		КонецЕсли;
			
		ОсновнойИдентификаторМакета = НайденныеЭлементы[0].Идентификатор;
		ЭтоГруппа = НайденныеЭлементы.Количество() > 1;
		
		СтрокаМакета = ВсеМакеты.Добавить();
		СтрокаМакета.ИмяМакета = ИмяМакета;
		СтрокаМакета.ЭтоГруппа = ЭтоГруппа;
		СтрокаМакета.Идентификатор = ОсновнойИдентификаторМакета;
		
		СтрокаОглавления = Оглавление.Добавить();
		СтрокаОглавления.ИмяМакета = ИмяМакета;
		СтрокаОглавления.Наименование = ОсновнойИдентификаторМакета;
		СтрокаОглавления.Идентификатор = ОсновнойИдентификаторМакета;
		СтрокаОглавления.ЭтоГруппа = ЭтоГруппа;
		
		Для каждого Элемент Из НайденныеЭлементы Цикл
			Идентификатор = Элемент.Идентификатор;
			Если Идентификатор = ОсновнойИдентификаторМакета Тогда
				Продолжить;
			КонецЕсли;
			Наименование = Элемент.ТекстовоеСодержимое;
			СтрокаОглавления = Оглавление.Добавить();
			СтрокаОглавления.ИмяМакета = ИмяМакета;
			СтрокаОглавления.Наименование = ?(ЗначениеЗаполнено(Наименование), Наименование, Идентификатор);
			СтрокаОглавления.Идентификатор = Идентификатор;
			СтрокаОглавления.ЭтоГруппа = Ложь;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтключенныеМакеты()
	
	Результат = Новый Массив;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыпускПродукции") Тогда
		Результат.Добавить("РазделПроизводство");
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("ВедетсяУчетОсновныхСредств") Тогда
		Результат.Добавить("РазделОсновныеСредства");
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПродажиЧерезМаркетплейс") Тогда
		Результат.Добавить("РазделМаркетплейсы");
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("ОтображатьПодсистемуСотрудники") Тогда
		Результат.Добавить("РазделСотрудники");
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьФискальныйРегистратор") Тогда
		Результат.Добавить("РазделКассовыеАппараты");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СформироватьHTMLОглавления(ОбработкаОбъект)
	
	ТекстОглавления = "";
	
	МакетОглавление = ОбработкаОбъект.ПолучитьМакет("Оглавление");
	ПолеОглавление = МакетОглавление.ПолучитьТекст();
	ДокументHTML = МакетОглавление.ПолучитьДокументHTML();
	ПутьМакетаОглавления = Прав(ДокументHTML.БазовыйURI, 36);
	
	ИмяТекущегоРаздела = "";
	ЕстьОткрытаяГруппа = Ложь;
	ЭтоПерваяСтрока = Истина;
	ЭтоНовыйРаздел = Истина;
	
	Для каждого СтрокаОглавления Из Оглавление Цикл
		
		ИмяРаздела = СтрокаОглавления.ИмяМакета;
		Наименование = СтрокаОглавления.Наименование;
		ЭтоГруппа = СтрокаОглавления.ЭтоГруппа;
		Идентификатор = СтрокаОглавления.Идентификатор;
		
		ЭтоНовыйРаздел = ИмяРаздела <> ИмяТекущегоРаздела;
		Если ЭтоНовыйРаздел Тогда
			Если ЕстьОткрытаяГруппа Тогда // Заканчиваем прошлый раздел-группу
				ТекстОглавления = ТекстОглавления + ОкончаниеРаздела();
				ЕстьОткрытаяГруппа = Ложь;
			КонецЕсли;
			ИмяТекущегоРаздела = ИмяРаздела;
		КонецЕсли;
		
		ЧастиЗаголовка = Новый Массив;
		Если ЭтоГруппа Тогда 
			Если ЭтоПерваяСтрока Тогда
				ШаблонНачала = ШаблонНачалаОткрытогоРаздела();
				ШаблонКартинки = ШаблонКартинкиОткрытогоРаздела();
			Иначе
				ШаблонНачала = ШаблонНачалаЗакрытогоРаздела();
				ШаблонКартинки = ШаблонКартинкиЗакрытогоРаздела();
			КонецЕсли;
			// Начало раздела-группы
			ЧастиЗаголовка.Добавить(СтрШаблон(
				"<H3 id=%1 class=""usual""><A hideFocus=true href=""ShowMaket=%2""><DIV style=""display: flex; align-items: flex-start;"">",
				Идентификатор, ИмяРаздела));
			// Картинка
			ЧастиЗаголовка.Добавить(СтрШаблон(ШаблонКартинки, ИмяРаздела, ПутьМакетаОглавления));
			// Наименование
			ЧастиЗаголовка.Добавить(СтрШаблон(
				"<DIV style=""flex-grow: 1; padding-top: 2px;"">%1</DIV>", 
				Наименование));
			// Конец заголовка раздела-группы
			ЧастиЗаголовка.Добавить("</DIV></A></H3>");
			ЧастиЗаголовка.Добавить(Символы.ПС);
			// Начало подчиненных элементов 
			ЧастиЗаголовка.Добавить(СтрШаблон(ШаблонНачала, ИмяРаздела));
			ЧастиЗаголовка.Добавить(Символы.ПС);
			ЕстьОткрытаяГруппа = Истина;
		ИначеЕсли ЭтоНовыйРаздел Тогда
			// Раздел без подчиненных элементов
			ЧастиЗаголовка.Добавить(СтрШаблон(
				"<P id=%1 class=""usual""><A href=""ShowMaket=%2"">%3</A></P>",
				Идентификатор, ИмяРаздела, Наименование));
			ЧастиЗаголовка.Добавить(Символы.ПС);
		Иначе
			// Подчиненный элемент группы
			ЧастиЗаголовка.Добавить(СтрШаблон(
				"<P id=%1 class=""usual""><A href=""ShowPart=%1"">%2</A></P>",
				Идентификатор, Наименование));
			ЧастиЗаголовка.Добавить(Символы.ПС);
		КонецЕсли;
		ТекстОглавления = ТекстОглавления + СтрСоединить(ЧастиЗаголовка, "");
		ЭтоПерваяСтрока = Ложь;
		
	КонецЦикла;
	
	Если ЕстьОткрытаяГруппа Тогда // Заканчиваем последний раздел-группу
		ТекстОглавления = ТекстОглавления + ОкончаниеРаздела();
	КонецЕсли;
	
	ПолеОглавление = СтрШаблон(ПолеОглавление, ТекстОглавления);
	Если Не ПоказыватьПриЗапуске Тогда
		СкрытьКнопкуПропуститьОбучение(ПолеОглавление);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМакет(ИмяМакета)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийМакет = ОбработкаОбъект.ПолучитьМакет(ИмяМакета);
	ПолеHTMLДокумента = ТекущийМакет.ПолучитьТекст();
	
	ДополнитьМакетДляПоказа(ИмяМакета, ОбработкаОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьМакетДляПоказа(ИмяМакета, ОбработкаОбъект)
	
	СтрокиМакета = ВсеМакеты.НайтиСтроки(Новый Структура("ИмяМакета", ИмяМакета));
	Если Не ЗначениеЗаполнено(СтрокиМакета) Тогда
		Возврат;
	КонецЕсли;
	ЭтоГруппа = СтрокиМакета[0].ЭтоГруппа;
	
	ИмяПервогоМакета = ВсеМакеты[0].ИмяМакета;
	ЭтоПервыйМакет = ИмяМакета = ИмяПервогоМакета;
	ИмяПоследнегоМакета = ВсеМакеты[ВсеМакеты.Количество()-1].ИмяМакета;
	ЭтоПоследнийМакет = ИмяМакета = ИмяПоследнегоМакета;
	
	ТекстДополнения = "";
	Если Не ЭтоПоследнийМакет Тогда
		// Дополняем html макета кнопкой Начать / Продолжить
		МакетДополнениеКнопка = ОбработкаОбъект.ПолучитьМакет("ДополнениеКнопка");
		ШаблонДополнениеКнопка = МакетДополнениеКнопка.ПолучитьТекст();
		Если ЭтоПервыйМакет Тогда
			ТекстДополнения = СтрШаблон(ШаблонДополнениеКнопка, "Начать");
		Иначе
			ТекстДополнения = СтрШаблон(ШаблонДополнениеКнопка, "Продолжить");
		КонецЕсли;
	КонецЕсли;
	Если ЭтоГруппа Тогда
		// Дополняем html макета скриптом обработки прокрутки
		МакетДополнениеСкрипт = ОбработкаОбъект.ПолучитьМакет("ДополнениеСкрипт");
		ТекстДополнениеСкрипт = МакетДополнениеСкрипт.ПолучитьТекст();
		ТекстДополнения = ТекстДополнения + ТекстДополнениеСкрипт;
	КонецЕсли;
	Если Не ПустаяСтрока(ТекстДополнения) Тогда
		ПолеHTMLДокумента = СтрЗаменить(ПолеHTMLДокумента, "</body>", ТекстДополнения + "</body>");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтартовуюСтраницу()
	
	ИмяМакета = ИмяТекущегоМакета;
	ИмяТекущегоМакета = "";
	ПоказатьМакет(ИмяМакета);
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьНастройкиПриОткрытии()
	
	Если Оглавление.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ИмяМакета", ИмяТекущегоМакета);
	СтрокиОглавления = Оглавление.НайтиСтроки(Отбор);
	Если СтрокиОглавления.Количество() = 0 Тогда
		ИмяТекущегоМакета = Оглавление[0].ИмяМакета;
		ТекущийИдентификатор = Оглавление[0].Идентификатор;
		Возврат;
	КонецЕсли;
	
	Для каждого ДанныеСтроки Из СтрокиОглавления Цикл
		Если ДанныеСтроки.Идентификатор = ТекущийИдентификатор Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	ТекущийИдентификатор = СтрокиОглавления[0].Идентификатор;
	
КонецПроцедуры


&НаКлиенте
Процедура ПерейтиПоСсылкеИзОглавления(ТекстСсылки)
	
	Если Не ЗначениеЗаполнено(ТекстСсылки) Тогда
		Возврат;
	КонецЕсли;
	
	Позиция = СтрНайти(ТекстСсылки, "ShowMaket=");
	Если Позиция > 0 Тогда
		ИмяМакета = Сред(ТекстСсылки,  Позиция + 10);
		ТекущийИдентификатор = "";
		ПоказатьМакет(ИмяМакета);
		Возврат;
	КонецЕсли;
	
	Позиция = СтрНайти(ТекстСсылки, "ShowPart=");
	Если Позиция > 0 Тогда
		ИдентификаторПодраздела = Сред(ТекстСсылки,  Позиция + 9);
		ПоказатьПодраздел(ИдентификаторПодраздела);
		Возврат;
	КонецЕсли;
	
	Позиция = СтрНайти(ТекстСсылки , "EndShow");
	Если Позиция > 0 Тогда
		ЗакончитьОбучение();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПерейтиПоСсылкеИзДокумента(ТекстСсылки)
	
	Если Не ЗначениеЗаполнено(ТекстСсылки) Тогда
		Возврат;
	КонецЕсли;
	
	Позиция = СтрНайти(ТекстСсылки, "Scroll=");
	Если Позиция > 0 Тогда
		ИдентификаторНовойСтроки = Сред(ТекстСсылки,  Позиция + 7);
		ИзменитьТекущуюСтрокуОглавления(ИдентификаторНовойСтроки);
		Возврат;
	КонецЕсли;
	
	Позиция = СтрНайти(ТекстСсылки , "ShowNext");
	Если Позиция > 0 Тогда
		ПоказатьСледующийМакет();
		Возврат;
	КонецЕсли;
	
	Позиция = СтрНайти(ТекстСсылки , "e1cib/");
	Если Позиция > 0 Тогда
		ПерейтиПоНавигационнойСсылке(Сред(ТекстСсылки , Позиция));
		Возврат;
	КонецЕсли;
	
	Если ВРег(Лев(ТекстСсылки , 4)) = ВРег("http") Тогда
		ПерейтиПоНавигационнойСсылке(ТекстСсылки );
		Возврат;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьМакет(ИмяМакета)
	
	Если ИмяМакета = ИмяТекущегоМакета Тогда
		ПоказатьПодраздел(ОсновнойИдентификаторМакета(ИмяМакета));
	Иначе
		ИмяТекущегоМакета = ИмяМакета;
		Если ТекущийИдентификатор = "" Тогда
			ТекущийИдентификатор = ОсновнойИдентификаторМакета(ИмяМакета);
		КонецЕсли;
		УстановитьМакет(ИмяМакета);
		ОформитьТекущийРазделОглавления(ИмяМакета);
	КонецЕсли;
	ПодключитьОбработчикОжидания("УстановитьТекущийЭлемент", 0.1, Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьПодраздел(ИдентификаторПодраздела)
	
	Элемент = Элементы.ПолеHTMLДокумента.Документ.getElementById(ИдентификаторПодраздела);
	Если Элемент <> Неопределено Тогда
		Элемент.scrollIntoView(); 
	КонецЕсли;
	ИзменитьТекущуюСтрокуОглавления(ИдентификаторПодраздела);
	ПодключитьОбработчикОжидания("УстановитьТекущийЭлемент", 0.1, Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура ИзменитьТекущуюСтрокуОглавления(ИдентификаторНовойСтроки)
	
	ТекущийИдентификатор = ИдентификаторНовойСтроки;
	ОформитьТекущуюСтрокуОглавления(ИдентификаторНовойСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьТекущуюСтрокуОглавления(ИдентификаторСтроки)
	
	ПолеОглавление = СтрЗаменить(ПолеОглавление,  "class=""selected""", "class=""usual""");
	ПолеОглавление = СтрЗаменить(ПолеОглавление,  
		СтрШаблон("id=%1 class=""usual""", ИдентификаторСтроки),
		СтрШаблон("id=%1 class=""selected""", ИдентификаторСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСледующийМакет()
	
	НашлиТекущий = Ложь;
	ИмяСледующегоМакета = "";
	Для каждого СтрокаМакета Из ВсеМакеты Цикл
		Если СтрокаМакета.ИмяМакета = ИмяТекущегоМакета Тогда
			НашлиТекущий = Истина;
			Продолжить;
		КонецЕсли;
		Если НашлиТекущий Тогда
			ИмяСледующегоМакета = СтрокаМакета.ИмяМакета;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ИмяСледующегоМакета = "" Тогда
		Возврат;
	КонецЕсли;
	ТекущийИдентификатор = "";
	ПоказатьМакет(ИмяСледующегоМакета);
	ПодключитьОбработчикОжидания("УстановитьТекущийЭлемент", 0.1, Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОформитьТекущийРазделОглавления(ИмяТекущегоРаздела)
	
	Для каждого ДанныеМакета Из ВсеМакеты Цикл
		ИмяРаздела = ДанныеМакета.ИмяМакета;
		ТекстНачалаЗакрытогоРаздела = СтрШаблон(ШаблонНачалаЗакрытогоРаздела(), ИмяРаздела);
		ТекстНачалаОткрытогоРаздела = СтрШаблон(ШаблонНачалаОткрытогоРаздела(), ИмяРаздела);
		ТекстКартинкиЗакрытогоРаздела = СтрШаблон(ШаблонКартинкиЗакрытогоРаздела(), ИмяРаздела, Прав(ПутьМакетаОглавления, 36));
		ТекстКартинкиОткрытогоРаздела = СтрШаблон(ШаблонКартинкиОткрытогоРаздела(), ИмяРаздела, Прав(ПутьМакетаОглавления, 36));
		Если ИмяРаздела = ИмяТекущегоРаздела Тогда
			// Раскрываем текущий раздел
			ПолеОглавление = СтрЗаменить(ПолеОглавление, ТекстНачалаЗакрытогоРаздела, ТекстНачалаОткрытогоРаздела);
			ПолеОглавление = СтрЗаменить(ПолеОглавление, ТекстКартинкиЗакрытогоРаздела, ТекстКартинкиОткрытогоРаздела);
		Иначе
			// Сворачиваем остальные разделы
			ПолеОглавление = СтрЗаменить(ПолеОглавление, ТекстНачалаОткрытогоРаздела, ТекстНачалаЗакрытогоРаздела);
			ПолеОглавление = СтрЗаменить(ПолеОглавление, ТекстКартинкиОткрытогоРаздела, ТекстКартинкиЗакрытогоРаздела);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОкончаниеРаздела()
	
	Возврат "</DIV>" + Символы.ПС;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонНачалаОткрытогоРаздела()
	
	Возврат "<DIV id=%1 style=""display: block; overflow: hidden;"">";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонНачалаЗакрытогоРаздела()
	
	Возврат "<DIV id=%1 style=""display: none; overflow: hidden;"">";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонКартинкиОткрытогоРаздела()
	
	Возврат "<img id=%1 src=""%2_files/down.png"">";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ШаблонКартинкиЗакрытогоРаздела()
	
	Возврат "<img id=%1 src=""%2_files/right.png"">";
	
КонецФункции

&НаКлиенте
Функция ОсновнойИдентификаторМакета(ИмяМакета)
	
	Для каждого СтрокаТаблицы Из ВсеМакеты Цикл
		Если СтрокаТаблицы.ИмяМакета = ИмяМакета Тогда
			Возврат СтрокаТаблицы.Идентификатор;
		КонецЕсли;
	КонецЦикла;
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура ЗакончитьОбучение()
	
	Оповещение = Новый ОписаниеОповещения("УточнитьПричинуЗакрытияЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ОбучениеРаботеВБизнесСтарт.Форма.ПропуститьОбучение", , ЭтотОбъект, , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УточнитьПричинуЗакрытияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьПричинуЗакрытия(Результат);
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьПричинуЗакрытия(Знач ОписаниеПричины)
	
	Обработки.ОбучениеРаботеВБизнесСтарт.СохранитьПричинуЗакрытия(ОписаниеПричины);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройки(Знач ИмяМакета, Знач Идентификатор)
	
	Обработки.ОбучениеРаботеВБизнесСтарт.СохранитьНастройку("ИмяМакета", ИмяМакета);
	Обработки.ОбучениеРаботеВБизнесСтарт.СохранитьНастройку("Идентификатор", Идентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьНастройки()
	
	Результат = Новый Структура;
	Результат.Вставить("ПоказыватьПриЗапуске", 
		Обработки.ОбучениеРаботеВБизнесСтарт.ПрочитатьНастройку("Показывать", Ложь));
	Результат.Вставить("ИмяТекущегоМакета", 
		Обработки.ОбучениеРаботеВБизнесСтарт.ПрочитатьНастройку("ИмяМакета", "РазделПриветствие"));
	Результат.Вставить("ТекущийИдентификатор", 
		Обработки.ОбучениеРаботеВБизнесСтарт.ПрочитатьНастройку("Идентификатор", ""));
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СкрытьКнопкуПропуститьОбучение(ТекстОглавления)
	
	ТекстОглавления = СтрЗаменить(ТекстОглавления, 
		"class=""end-show-button""",
		"style=""display: none""");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущийЭлемент()
	
	ТекущийЭлемент = Элементы.ПолеHTMLДокумента;
	
КонецПроцедуры

#КонецОбласти
