
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресЗначенияПоУмолчанию	= Параметры.АдресЗначенияПоУмолчанию;  
	
	//Создаем реквизит формы
	ДобавляемыеРеквизиты	= Новый Массив;  
	НовыйРеквизит = Новый РеквизитФормы("ЗначениеПоУмолчанию", Параметры.ОписаниеТипов,, Параметры.ЗаголвоокПоля);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, );  
	//Создаем реквизит формы
	
	//Создаем элемент формы
	ЭлементФормы 						= Элементы.Добавить("ЗначениеПоУмолчанию", Тип("ПолеФормы"));        
	ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным 			= "ЗначениеПоУмолчанию";
	
	Если Параметры.ОписаниеТипов.СодержитТип(Тип("Строка")) Тогда
		ЭлементФормы.КнопкаВыбора 		= Истина;
		ЭлементФормы.КнопкаОчистки 		= Истина;
	КонецЕсли;
	
	ЭлементФормы.ВыбиратьТип	= (Параметры.ОписаниеТипов.Типы().Количество() > 1);	
	ЭлементФормы.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Верх;
	ЭлементФормы.АвтоМаксимальнаяШирина	= Ложь;
	//Создаем элемент формы
	
	ЭтаФорма["ЗначениеПоУмолчанию"] = ПолучитьИзВременногоХранилища(АдресЗначенияПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ПоместитьВоВременноеХранилище(ЭтаФорма["ЗначениеПоУмолчанию"], АдресЗначенияПоУмолчанию);   
	
	ЭтаФорма.Закрыть(Истина);

КонецПроцедуры
