
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьСтатьиРасходов 		= Истина;
	КопироватьСтатьиДоходов 		= Истина;
	
	Параметры.Свойство("ВерсияБюджета", ВерсияБюджета);
	Параметры.Свойство("Грузоперевозка", Грузоперевозка);
	
	Элементы.ПерезаполнятьСуществующиеСтатьи.Доступность = ПорядокЗаполненияБюджета = 1;
	
	ЗаполнитьСписокВерсий();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВерсий()
	
	СписокВерсий.Очистить();

	Если КопироватьСтатьиРасходов и КопироватьСтатьиДоходов Тогда
		ВидКопируемыхСтатей = 0;
	ИначеЕсли КопироватьСтатьиРасходов Тогда
		ВидКопируемыхСтатей = 1;
	ИначеЕсли КопироватьСтатьиДоходов Тогда
		ВидКопируемыхСтатей = 2;
	Иначе
		ВидКопируемыхСтатей = -1;
	КонецЕсли;
	
	Если ВидКопируемыхСтатей < 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета КАК ВерсияБюджета
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ
		           |	//УсловиеСтатьиПланирования
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета";
	

	Запрос.УстановитьПараметр("Владелец", Грузоперевозка);
	
	Если ВидКопируемыхСтатей = 1 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеСтатьиПланирования", "И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = Значение(Перечисление.CW_ВидыСтатейПланирования.Расходы)");	
	КонецЕсли;
	Если ВидКопируемыхСтатей = 2 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеСтатьиПланирования", "И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = Значение(Перечисление.CW_ВидыСтатейПланирования.Доходы)");	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокВерсий.Добавить(Выборка.ВерсияБюджета,,Выборка.ВерсияБюджета = ВерсияБюджета);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокЗаполненияБюджетаПриИзменении(Элемент)
	
	Если ПорядокЗаполненияБюджета = 0 Тогда
		ПерезаполнятьСуществующиеСтатьи = ложь;
	КонецЕсли;
	
	Элементы.ПерезаполнятьСуществующиеСтатьи.Доступность = ПорядокЗаполненияБюджета = 1;
	
КонецПроцедуры


&НаКлиенте
Процедура КопироватьСтатьиРасходовПриИзменении(Элемент)
	
	ЗаполнитьСписокВерсий();
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьСтатьиДоходовПриИзменении(Элемент)
	
	Если КопироватьСтатьиДоходов = 0 Тогда
		ЗаполнятьПлательщика = ложь;
	КонецЕсли;
	
	Элементы.ЗаполнятьПлательщика.Доступность = КопироватьСтатьиДоходов;
	
	ЗаполнитьСписокВерсий();
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОК(Команда)
	
	ВыбранныеВерсии	= Новый Массив;
	Для Каждого ЭлементСписка из СписокВерсий Цикл
		Если ЭлементСписка.Пометка Тогда
			ВыбранныеВерсии.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранныеВерсии.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Не выбрано ни одной версии бюджета для копирования");
		Возврат;
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Грузоперевозка", Грузоперевозка);
	Ответ.Вставить("КопироватьСтатьиРасходов", 			КопироватьСтатьиРасходов);
	Ответ.Вставить("КопироватьСтатьиДоходов", 			КопироватьСтатьиДоходов);
	Ответ.Вставить("ЗаполнятьПлательщика", 				ЗаполнятьПлательщика);
	Ответ.Вставить("ПорядокЗаполненияБюджета", 			ПорядокЗаполненияБюджета);
	Ответ.Вставить("ПерезаполнятьСуществующиеСтатьи", 	ПерезаполнятьСуществующиеСтатьи);
	Ответ.Вставить("ВыбранныеВерсии", 					ВыбранныеВерсии);
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры



