&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектСсылка", ОбъектСсылка);
	Параметры.Свойство("ВидДоговора", ВидДоговора);
	Параметры.Свойство("УИД", УИД);    
	
	флИспользоватьКоличествоВБюджетах = ПолучитьФункциональнуюОпцию("CW_ИспользованиеКоличестваДляПлановыхСтатей");
	
	Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда 
		
		МассивЗаказов = _сф.ст_ПолучитьСвойство(Параметры,"Заказы");
		Если МассивЗаказов = Неопределено Тогда
			
			МассивГрузоперевозок = _сф.ст_ПолучитьСвойство(Параметры,"Грузоперевозки");
			Если МассивГрузоперевозок = Неопределено Тогда
				
				ВызватьИсключение "Не задан заказ/грузоперевозка";
				
			Иначе
				
				РежимГрузоперевозок = Истина;
				СписокГрузоперевозок.ЗагрузитьЗначения(МассивГрузоперевозок);
				
			КонецЕсли;
			
		Иначе
			
			РежимЗаказов = Истина;
			СписокЗаказов.ЗагрузитьЗначения(МассивЗаказов);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) Тогда
		Элементы.ГрузоперевозкиПорядокОтраженияРасходов.Видимость = Ложь;
	ИначеЕсли (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком) Тогда
		Элементы.ГрузоперевозкиПорядокОтраженияДоходов.Видимость = Ложь;
	КонецЕсли; 
	
	врРежим = _сф.ст_ПолучитьСвойство(Параметры,"Режим");
	Если врРежим <> Неопределено Тогда
		
		Если врРежим = "Подбор" Тогда
			
			РежимПодбора=Истина;
			Договор = _сф.ст_ПолучитьСвойство(Параметры,"Договор");
			Элементы.ДатаДокумента.Видимость = Ложь;
			
			//Подсистема.УчетПриложенийДоговоров
			Если Параметры.Свойство("ПриложениеКДоговору") тогда
				ПриложениеКДоговору = Параметры.ПриложениеКДоговору;
			КонецЕсли;
			//Подсистема.УчетПриложенийДоговоров
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ПерезаполнитьДокумент.Видимость = РежимПодбора;
	
	// --- 
	
	ДатаДокумента 		= CW_Настройки.ТекущаяДатаПользователя();
	
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	// пытаемся получить версию бюджета из настройки пользователя
	НП = CW_Настройки.ПолучитьНастройкиПользователя(CW_Настройки.Пользователь());
	
	ОтображатьКомментарийДоговора = НП.ОтображатьКомментарийДоговораВФормеВводаДокументовПоБюджету;
	
	Если (ЗначениеЗаполнено(НП.ОсновнаяВерсияБюджета)) Тогда
		ВерсияБюджета = НП.ОсновнаяВерсияБюджета;
	Иначе
		
		ВерсияБюджета = Константы.CW_БазоваяВерсияБюджета.Получить();
		Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда 
			Попытка
				Константы.CW_БазоваяВерсияБюджета.Установить(Справочники.CW_ВерсииБюджетов.Основная);
				ВерсияБюджета = Справочники.CW_ВерсииБюджетов.Основная;
			Исключение
				Сообщить(
				"Не выбрана базовая версия бюджета!
				|Формирование документов выполняется всегда по
				|базовой версии, установлееной в настройках программы."
				);
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если (НП.ОтображениеФинРез <> Неопределено) Тогда
		
		ФормированиеФакта = НП.ОтображениеФинРез;
		
	КонецЕсли; 

	// --- 
	
	_УправлениеЭлементамиФормы();
	
	// --- 
	
	_ПолучитьТаблицыБюджетаПланФакт_ДляВыбораКонтрагента();
	
	// --- 
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	// --- 
	
	Элементы.ВыборКлиентаСуммаФактДругиеВалюты.Видимость = Ложь;
	
	// --- 
	ПроцентВыставления 	= 100;
	УстановитьЗаголовокКнопкиПроцентаВыставления();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокКнопкиПроцентаВыставления()
	
	Если Цел(ПроцентВыставления) <> ПроцентВыставления Тогда
		ФорматнаяСтрока = "ЧДЦ=2";
	Иначе
		ФорматнаяСтрока = "ЧДЦ=0";
	КонецЕсли;
	
	Элементы.СтатьиВвестиПроцентВыставления.Заголовок = Формат(ПроцентВыставления,ФорматнаяСтрока)+"%";
	
КонецПроцедуры


// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Элементы.Договор.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Контрагент);
	
	ПараметрыОпции = Новый Структура("CW_ДоговорПоГрузоперевозкам", Договор);
	Элементы.ПриложениеКДоговору.Видимость = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам", ПараметрыОпции);

	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

Процедура _ПолучитьТаблицыБюджетаПланФакт_ДляВыбораКонтрагента()

	Если (НЕ РежимЗаказов) И (НЕ РежимГрузоперевозок) Тогда
		
		//дфкВыборКлиента.Загрузить(CW_Бюджетирование._ПолучитьТаблицыБюджетаПланФакт_ДляВыбораКлиента(ОбъектСсылка, ВерсияБюджета));
		дфкВыборКлиента.Загрузить(
			CW_Бюджетирование._ПолучитьТаблицыБюджетаПланФакт_ДляВыбораКонтрагента(
				ОбъектСсылка, 
				ВерсияБюджета,
				ВидДоговора,
				?(Договор.Пустая(),Неопределено,Договор),
				?(ФормированиеФакта=0,Ложь,Истина)
			)
		);
		
		Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда 
			// одна грузоперевозка
			Элементы.СтатьиСуммаКВыставлению.ТолькоПросмотр 		= Ложь;
			Элементы.СтатьиКоличествоКВыставлению.ТолькоПросмотр 	= Ложь;
			Элементы.СтатьиСальдо.ТолькоПросмотр 					= Ложь;
			Элементы.СтатьиСальдоКоличество.ТолькоПросмотр 			= Ложь;
			Элементы.ГруппаГрузоперевозки.Видимость 		= Ложь;
			ВводПоГрузоперевозке 							= истина;
		КонецЕсли;
		
	Иначе
		
		Если РежимЗаказов Тогда
			//дфкВыборКлиента.Загрузить(CW_Бюджетирование._ПолучитьТаблицыБюджетаПланФакт_ДляВыбораКлиентаПоЗаказам(СписокЗаказов.ВыгрузитьЗначения(), ВерсияБюджета));
			дфкВыборКлиента.Загрузить(
				CW_Бюджетирование._ПолучитьТаблицыБюджетаПланФакт_ДляВыбораКонтрагентаПоЗаказам(
					СписокЗаказов.ВыгрузитьЗначения(), 
					ВерсияБюджета, 
					ВидДоговора,
					?(РежимПодбора,Договор,Неопределено),
					?(ФормированиеФакта=0,Ложь,Истина)
				)
			);
		ИначеЕсли РежимГрузоперевозок Тогда
			//дфкВыборКлиента.Загрузить(CW_Бюджетирование._ПолучитьТаблицыБюджетаПланФакт_ДляВыбораКонтрагентаПоГрузоперевозкам(СписокГрузоперевозок.ВыгрузитьЗначения(), ВерсияБюджета, ВидДоговора,?(РежимПодбора,Договор,Неопределено),?(ФормированиеФакта=0,Ложь,Истина)));	
			дфкВыборКлиента.Загрузить(
				CW_Бюджетирование._ПолучитьТаблицыБюджетаПланФакт_ДляВыбораКонтрагентаПоГрузоперевозкам(
					СписокГрузоперевозок.ВыгрузитьЗначения(), 
					ВерсияБюджета, 
					ВидДоговора,
					Неопределено,
					?(ФормированиеФакта=0,Ложь,Истина)
				)
			);	
		КонецЕсли;
		
	КонецЕсли; 
	
	дфкВыборКлиента.Сортировать("Клиент Возр");
	// --- 
	ВыводитьДругиеВалютыПриИзмененииНаСервере();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыборКлиентаДалее(Команда)
	
	КонтрагентПоБюджету = Ложь;
	
	Если (Элементы.ВыборКлиента.ТекущаяСтрока=Неопределено) Тогда 
		_УФК.ВывестиПредупреждение("Не выбрана строка таблицы!");
		Возврат;
	КонецЕсли;
	
	ВыборКорректен = Истина;
	// --- 
	Если (Элементы.ВыборКлиента.ВыделенныеСтроки.Количество() > 0) Тогда
		
		МассивОрганизаций = Новый Массив;
		МассивКонтрагентовПоБюджету = Новый Массив;
		МассивВалютПоБюджету = Новый Массив;
		
		Для каждого Идентификатор Из Элементы.ВыборКлиента.ВыделенныеСтроки Цикл
			
			СтрокаТЗ = дфкВыборКлиента.НайтиПоИдентификатору(Идентификатор);
			Если (МассивОрганизаций.Найти(СтрокаТЗ.Организация) = Неопределено) Тогда
				МассивОрганизаций.Добавить(СтрокаТЗ.Организация);	
			КонецЕсли; 
			Если (МассивКонтрагентовПоБюджету.Найти(СтрокаТЗ.Клиент) = Неопределено) Тогда
				МассивКонтрагентовПоБюджету.Добавить(СтрокаТЗ.Клиент);	
			КонецЕсли; 
			Если (МассивВалютПоБюджету.Найти(СтрокаТЗ.Валюта) = Неопределено) Тогда
				МассивВалютПоБюджету.Добавить(СтрокаТЗ.Валюта);	
			КонецЕсли; 
			
		КонецЦикла; 
		
		// --- 
		
		Если (МассивОрганизаций.Количество() <> 1) Тогда
			
			ВыборКорректен = Ложь;
			_УФК.ВывестиПредупреждение("Организации в выбранных строках должны совпадать");
			Возврат;
			
		Иначе
			
			Организация = МассивОрганизаций.Получить(0);
			
		КонецЕсли; 
		// --- 
		Если (МассивКонтрагентовПоБюджету.Количество() <> 1) Тогда
			
			ВыборКорректен = Ложь;
			_УФК.ВывестиПредупреждение("Контрагенты в выбранных строках должны совпадать");
			Возврат;
			
		Иначе
			
			КонтрагентПоБюджету = МассивКонтрагентовПоБюджету.Получить(0);
			
		КонецЕсли; 
		// --- 
		СписокВалютПоБюджету.Очистить();
		Если (МассивВалютПоБюджету.Количество() = 1) Тогда
			
			ВалютаПоБюджету = МассивВалютПоБюджету.Получить(0);
			
		Иначе
			
			ВалютаПоБюджету = Неопределено;
			// --- 
			
			Для каждого СтрВалюта Из МассивВалютПоБюджету Цикл
				СписокВалютПоБюджету.Добавить(СтрВалюта);
			КонецЦикла; 
			
		КонецЕсли; 
		
	Иначе
		
		ВыборКорректен = Ложь;
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	Если (ВыборКорректен) Тогда
		
		// --- 
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыбораСтатей;
		// --- 
		_ПереходНаСтраницуВыбораСтатей();
		_УправлениеЭлементамиФормы();
		
		
		// --- 
		ОбновитьИтоги();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКлиентаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборКлиентаДалее(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтоги()
	
	сум = дфкСтатьи.Итог("СуммаКВыставлению");
	Элементы.НадписьСуммаКВыставлению.Заголовок = "К выставлению: "+Формат(сум, "ЧДЦ=2; ЧН=")+" "+Валюта;
	Элементы.КомандаОК.Доступность = (сум<>0);
	
	ПолучитьКоличествоВыставленныхСтрокСтатьи();
	ПолучитьКоличествоВыставленныхСтрокГрузоперевозки();
	
КонецПроцедуры

&НаСервере
Процедура _ПереходНаСтраницуВыбораСтатей()

	Если (ЗначениеЗаполнено(КонтрагентПоБюджету)) Тогда
		Контрагент = КонтрагентПоБюджету;
	КонецЕсли; 	
	
	Если (ЗначениеЗаполнено(ВалютаПоБюджету)) Тогда
		Валюта = ВалютаПоБюджету;
	КонецЕсли; 

	// по умолчанию дата курса для пересчётов
	ДатаКурса = ДатаДокумента;
	
	МассивСтатейБюджета = ПолучитьМассивСтатейБюджета();
  	УстановитьДоговорИПриложениеНаФорме(МассивСтатейБюджета);
	
	// если указан контрагент и не указан договор - пробуем определить
	Если (ЗначениеЗаполнено(Контрагент) И Договор.Пустая()) Тогда
		
		Договор = CW_Документы.ПолучитьПоследнийДоговор(Контрагент, Организация, ВидДоговора);
		Если Договор <> Неопределено Тогда
			Если (Договор.ВалютаДоговора <> Валюта И ЗначениеЗаполнено(Валюта)) Тогда
				Договор = Справочники.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка();
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
	_ДоговорПриИзменении();
	
	// если передан договор, то устанавливаем контрагента
	Если (Контрагент.Пустая()) И (НЕ Договор.Пустая()) Тогда
		Контрагент = Договор.Владелец;
	КонецЕсли;	
	
	// при мультивалюте не показываем данные по другим документам  и не даём выбирать валюту
	Если (ВалютаПоБюджету.Пустая()) Тогда
		
		//Элементы.Валюта.Видимость = Ложь;
		Элементы.СтатьиСуммаФакт.Видимость = Ложь;
		Элементы.ГрузоперевозкиСуммаФакт.Видимость = Ложь;
		// --- 
		Элементы.НадписьСуммаКВыставлению.Видимость = Ложь;
		
	КонецЕсли; 
	
	ОбработатьИзмененииВалютыДоговора();
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьМассивСтатейБюджета()  
	
	МассивВладельцев = Новый Массив; 
	
	Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			МассивВладельцев.Добавить(ОбъектСсылка); 
		ИначеЕсли ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.CW_Заказы") Тогда
			МассивВладельцев = Справочники.CW_Заказы.ПолучитьМассивГрузоперевозокЗаказа(ОбъектСсылка);
		КонецЕсли;
	Иначе
		Если СписокЗаказов.Количество() > 0 Тогда
			МассивЗаказов = СписокЗаказов.ВыгрузитьЗначения();
			МассивВладельцев = Справочники.CW_Заказы.ПолучитьМассивГрузоперевозокЗаказа(МассивЗаказов);
		КонецЕсли;
		Если СписокГрузоперевозок.Количество() > 0 Тогда
			МассивВладельцев = СписокГрузоперевозок.ВыгрузитьЗначения();
		КонецЕсли;
	КонецЕсли;	 
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	|ГДЕ
	|	CW_ПлановыеСтатьиЗатратИДоходов.Организация = &Организация
	|	И CW_ПлановыеСтатьиЗатратИДоходов.Контрагент = &Контрагент
	|	И CW_ПлановыеСтатьиЗатратИДоходов.Валюта = &Валюта
	|	И CW_ПлановыеСтатьиЗатратИДоходов.Владелец В(&МассивВладельцев)";    
	
	Запрос.УстановитьПараметр("МассивВладельцев", 	МассивВладельцев);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Контрагент", 		Контрагент);
	Запрос.УстановитьПараметр("Валюта", 			Валюта);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура УстановитьДоговорИПриложениеНаФорме(МассивСтатейБюджета) 
	
	ПрименяютсяДоговора = ПолучитьФункциональнуюОпцию("CW_УказыватьДоговорДляПлановыхСтатейБюджета");  
	Если Не ПрименяютсяДоговора Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтатей = Новый Массив;
	Для Каждого СтатьяБюджета из МассивСтатейБюджета Цикл 
		Если Не ЗначениеЗаполнено(СтатьяБюджета) Тогда
			Продолжить;
		КонецЕсли;
		МассивСтатей.Добавить(СтатьяБюджета);
	КонецЦикла;   
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивСтатей", МассивСтатей);
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПлановыеСтатьиЗатратИДоходов.Договор КАК Договор,
	|	CW_ПлановыеСтатьиЗатратИДоходов.ПриложениеКДоговору КАК ПриложениеКДоговору
	|ПОМЕСТИТЬ ВТ_ДоговораИПриложения
	|ИЗ
	|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	|ГДЕ
	|	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка В(&МассивСтатей)";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДоговораИПриложения.Договор КАК Договор
	|ИЗ
	|	ВТ_ДоговораИПриложения КАК ВТ_ДоговораИПриложения"; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка.Следующий();
	Если Не ЗначениеЗаполнено(Выборка.Договор) Тогда
		Возврат;
	КонецЕсли;

	Договор = Выборка.Договор;

	ВалютаДоговора = Договор.ВалютаДоговора;
	
	//при изменении валюты договора
	ПослеУстановкиВалютыДоговора();
	//при изменении договора     
	
	Если Не Договор.ИспользуютсяПриложения Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДоговораИПриложения.ПриложениеКДоговору КАК ПриложениеКДоговору
	|ИЗ
	|	ВТ_ДоговораИПриложения КАК ВТ_ДоговораИПриложения";  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка.Следующий();
	
	ПриложениеКДоговору = Выборка.ПриложениеКДоговору;    
	
	Если ЗначениеЗаполнено(ПриложениеКДоговору) Тогда
		ВалютаДоговора 		= ПриложениеКДоговору.ВалютаДоговора;
		
		//при изменении валюты договора
		ПослеУстановкиВалютыДоговора();
		//при изменении договора
	КонецЕсли;
	
КонецПроцедуры


&наСервере
Процедура УстановитьЗаголовокНадписиКомментарияДоговора()
	
	КомментарийДоговора = ?(Договор.Пустая(),"", СокрЛП(Договор.Комментарий));
	
	Элементы.НадписьКомментарийДоговора.Видимость = ОтображатьКомментарийДоговора и ЗначениеЗаполнено(КомментарийДоговора);
	Элементы.НадписьКомментарийДоговора.Заголовок = КомментарийДоговора;
	
КонецПроцедуры
			

&НаСервере
Процедура _ЗаполнитьТаблицыСтатейИГрузоперевозок()
	
	Если ЗначениеЗаполнено(Договор) ИЛИ ЗначениеЗаполнено(ПриложениеКДоговору) Тогда 
		
		Если (РежимЗаказов) Тогда
			стру = CW_Бюджетирование._ПолучитьТаблицыБюджетаПланФакт_СтатьиИГрузоперевозкиПоЗаказам(
				СписокЗаказов.ВыгрузитьЗначения(), 
				ВерсияБюджета, 
				Организация, 
				КонтрагентПоБюджету, 
				?(ЗначениеЗаполнено(ВалютаПоБюджету),ВалютаПоБюджету,СписокВалютПоБюджету.ВыгрузитьЗначения()), 
				Договор, 
				ПриложениеКДоговору,
				ФормированиеФакта
			);
			
		ИначеЕсли (РежимГрузоперевозок) Тогда
			стру = CW_Бюджетирование._ПолучитьТаблицыБюджетаПланФакт_СтатьиИГрузоперевозкиПоГрузоперевозкам(
				СписокГрузоперевозок.ВыгрузитьЗначения(), 
				ВерсияБюджета, 
				Организация, 
				КонтрагентПоБюджету, 
				?(ЗначениеЗаполнено(ВалютаПоБюджету),ВалютаПоБюджету,СписокВалютПоБюджету.ВыгрузитьЗначения()), 
				Договор, 
				ПриложениеКДоговору,
				ФормированиеФакта
			);
			
		Иначе
			стру = CW_Бюджетирование._ПолучитьТаблицыБюджетаПланФакт_СтатьиИГрузоперевозки(
				ОбъектСсылка, 
				ВерсияБюджета, 
				Организация, 
				КонтрагентПоБюджету, 
				?(ЗначениеЗаполнено(ВалютаПоБюджету),ВалютаПоБюджету,СписокВалютПоБюджету.ВыгрузитьЗначения()), 
				Договор, 
				ПриложениеКДоговору,
				ФормированиеФакта
			);
			
		КонецЕсли; 
		
		ТЗС = стру.тзСтатьи;  
		
		ТЗС.Свернуть("Номенклатура,СтавкаНДС,Валюта","КоличествоПоБюджету,КоличествоКВыставлению,СальдоКоличество,КоличествоФакт,СуммаПоБюджету, СуммаФакт, СуммаКВыставлению, Сальдо");
		дфкСтатьи.Загрузить(ТЗС);
		
		СтатьиВсегоСтрок  = дфкСтатьи.Количество();
		ПолучитьКоличествоВыставленныхСтрокСтатьи();
		
		дфкГрузоперевозки.Загрузить(стру.тзГрузоперевозки);
		
		// сальдо по таблице г/п
		Для каждого Стр Из дфкГрузоперевозки Цикл
			Стр.СуммаКВыставлению = 0;
			Стр.Сальдо = Стр.СуммаПоБюджету - Стр.СуммаФакт - Стр.СуммаКВыставлению;
		КонецЦикла; 
		
		// сальдо по таблице статей
		Для каждого Стр Из дфкСтатьи Цикл
			Стр.СуммаКВыставлению = 0;
			Стр.Сальдо = Стр.СуммаПоБюджету - Стр.СуммаФакт - Стр.СуммаКВыставлению;
		КонецЦикла; 
		
	Иначе 	
		
		дфкСтатьи.Очистить();
		дфкГрузоперевозки.Очистить();
		
	КонецЕсли;
	
	Если (ВыводитьДругиеВалюты) Тогда
		_ДополнитьФактомПоДругимВалютам();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеУстановкиВалютыДоговора()
	
	ВидимостьДатыКурса = ЗначениеЗаполнено(Договор) или ЗначениеЗаполнено(ПриложениеКДоговору);
	
	Элементы.ГруппаДатаКурса.Видимость = ВидимостьДатыКурса И ВалютаПоБюджету <> ВалютаДоговора;  
	Если ДатаКурса=Дата(1,1,1) Тогда
		ДатаКурса = ДатаДокумента;
	КонецЕсли;       
	
	УстановитьВидимостьПересчетаСуммы();
	
	ВариантКурсаПриИзмененииНаСервере();
	
	_УправлениеЭлементамиФормы();
	УстановитьВидимостьПересчетаСуммы();
	
	УстановитьЗаголовокНадписиКомментарияДоговора();
   	ОбновитьИтоги();

КонецПроцедуры

 

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	_ДоговорПриИзменении();
	ОбновитьИтоги();
	
КонецПроцедуры

&НаСервере
Процедура _ДоговорПриИзменении()
	
	ВалютаДоговора = Договор.ВалютаДоговора;
	ОбработатьИзмененииВалютыДоговора();
	УстановитьЗаголовокНадписиКомментарияДоговора();

КонецПроцедуры


&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	
	ПриложениеКДоговоруПриИзмененииНаСервере();
	ОбновитьИтоги();
	
КонецПроцедуры

&НаСервере
Процедура ПриложениеКДоговоруПриИзмененииНаСервере()
	
	ВалютаДоговора = ПриложениеКДоговору.ВалютаДоговора;
	ОбработатьИзмененииВалютыДоговора();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзмененииВалютыДоговора()
	
	ВидимостьДатыКурса = ЗначениеЗаполнено(Договор) или ЗначениеЗаполнено(ПриложениеКДоговору);
	
	Элементы.ГруппаДатаКурса.Видимость = ВидимостьДатыКурса И ВалютаПоБюджету <> ВалютаДоговора;  
	Если ДатаКурса=Дата(1,1,1) Тогда
		ДатаКурса = ДатаДокумента;
	КонецЕсли;       
	
	УстановитьВидимостьПересчетаСуммы();

	ВариантКурсаПриИзмененииНаСервере();
	
	_ЗаполнитьТаблицыСтатейИГрузоперевозок();
	_УправлениеЭлементамиФормы();
 	УстановитьВидимостьПересчетаСуммы();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПересчетаСуммы()
	
	ПересчетСуммыВидимость = ложь;
	
	ВалютаСтатьи = дфкСтатьи.Выгрузить();  
	ВалютаСтатьи.Свернуть("Валюта",); 
	
	Если ВалютаСтатьи.Количество() > 0 Тогда
		ВалютаСтатей = ВалютаСтатьи[0].Валюта;
		ПересчетСуммыВидимость = (ВариантКурса = 0) И (ВалютаСтатьи.Количество() = 1) и Не ВалютаДоговора.Пустая() и (ВалютаСтатей <> ВалютаДоговора);
	КонецЕсли; 
	
	Элементы.ПересчетСуммы.Видимость = ПересчетСуммыВидимость; 
	Если Не ПересчетСуммыВидимость Тогда
		ПересчетСуммы = 0;
	КонецЕсли;
	
КонецПроцедуры

 

&НаКлиенте
Процедура СтатьиПриАктивизацииСтроки(Элемент)
	Если (Элементы.Статьи.ТекущаяСтрока <> Неопределено) Тогда 
		
		текСтрока = дфкСтатьи.НайтиПоИдентификатору(Элементы.Статьи.ТекущаяСтрока);
		Элементы.Грузоперевозки.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура, СтавкаНДС, Валюта", текСтрока.Номенклатура, текСтрока.СтавкаНДС, текСтрока.Валюта);
		
		ПолучитьКоличествоВыставленныхСтрокГрузоперевозки();
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиСуммаКВыставлениюПриИзменении(Элемент)
	
	Если Элементы.Грузоперевозки.ТекущиеДанные <> Неопределено Тогда
		текСтрокаГрузоперевозок = дфкГрузоперевозки.НайтиПоИдентификатору(Элементы.Грузоперевозки.ТекущаяСтрока);
		текСтрокаГрузоперевозок.Сальдо = текСтрокаГрузоперевозок.СуммаПоБюджету - текСтрокаГрузоперевозок.СуммаФакт - текСтрокаГрузоперевозок.СуммаКВыставлению;
		_ПересчитатьТекущуюСтрокуСтатейПоГрузоперевозкам(Элементы.Статьи.ТекущаяСтрока);
	КонецЕсли;

	ОбновитьИтоги();
	
КонецПроцедуры 

&НаКлиенте
Процедура ГрузоперевозкиКоличествоКВыставлениюПриИзменении(Элемент)

	Если Элементы.Грузоперевозки.ТекущиеДанные <> Неопределено Тогда
		текСтрокаГрузоперевозок = дфкГрузоперевозки.НайтиПоИдентификатору(Элементы.Грузоперевозки.ТекущаяСтрока);
		текСтрокаГрузоперевозок.СальдоКоличество = текСтрокаГрузоперевозок.КоличествоПоБюджету - текСтрокаГрузоперевозок.КоличествоФакт - текСтрокаГрузоперевозок.КоличествоКВыставлению;
		_ПересчитатьТекущуюСтрокуСтатейПоГрузоперевозкам(Элементы.Статьи.ТекущаяСтрока);
	КонецЕсли;

	ОбновитьИтоги();

КонецПроцедуры


&НаКлиенте
Процедура ГрузоперевозкиСальдоПриИзменении(Элемент)

	текСтрокаГрузоперевозок = дфкГрузоперевозки.НайтиПоИдентификатору(Элементы.Грузоперевозки.ТекущаяСтрока);
	текСтрокаГрузоперевозок.СуммаКВыставлению = текСтрокаГрузоперевозок.СуммаПоБюджету - текСтрокаГрузоперевозок.СуммаФакт - текСтрокаГрузоперевозок.Сальдо;
	Если текСтрокаГрузоперевозок.СуммаПоБюджету<>0 Тогда 
		текСтрокаГрузоперевозок.КоличествоКВыставлению = текСтрокаГрузоперевозок.КоличествоПоБюджету * текСтрокаГрузоперевозок.СуммаКВыставлению/текСтрокаГрузоперевозок.СуммаПоБюджету;
	КонецЕсли;
	// сумма к выставлению - реквизит неотрицательный, если что - сбросится в 0, чтобы учесть такой случай, сразу пересчитаем в обратную сторону
	ГрузоперевозкиСуммаКВыставлениюПриИзменении(Элемент);

КонецПроцедуры

&НаСервере
Процедура _ПересчитатьТекущуюСтрокуСтатейПоГрузоперевозкам(ИдентификаторСтроки)
	
	// после того, как что-то отредактировали в таблице Грузоперевозок, надо собрать итог для текущей строки статей
	текСтрокаСтатьи = дфкСтатьи.НайтиПоИдентификатору(ИдентификаторСтроки);

	тз = дфкГрузоперевозки.Выгрузить(Новый Структура("Номенклатура, СтавкаНДС, Валюта", текСтрокаСтатьи.Номенклатура, текСтрокаСтатьи.СтавкаНДС, текСтрокаСтатьи.Валюта));
	текСтрокаСтатьи.КоличествоКВыставлению = тз.Итог("КоличествоКВыставлению");
	текСтрокаСтатьи.СуммаКВыставлению      = тз.Итог("СуммаКВыставлению");
	текСтрокаСтатьи.Сальдо                 = тз.Итог("Сальдо");
	текСтрокаСтатьи.СальдоКоличество       = тз.Итог("СальдоКоличество");

КонецПроцедуры

&НаКлиенте
Процедура СтатьиСуммаКВыставлениюПриИзменении(Элемент)
	
	текСтрокаСтатей = дфкСтатьи.НайтиПоИдентификатору(Элементы.Статьи.ТекущаяСтрока);
	текСтрокаСтатей.Сальдо = текСтрокаСтатей.СуммаПоБюджету - текСтрокаСтатей.СуммаФакт - текСтрокаСтатей.СуммаКВыставлению;
	Если текСтрокаСтатей.СуммаПоБюджету<>0 Тогда 
		текСтрокаСтатей.КоличествоКВыставлению = текСтрокаСтатей.КоличествоПоБюджету * текСтрокаСтатей.СуммаКВыставлению/текСтрокаСтатей.СуммаПоБюджету;
	КонецЕсли;
	
	// корректно отработает только !!! в случае одной грузоперевозки
	массСтрок = дфкГрузоперевозки.НайтиСтроки(Новый Структура("Номенклатура, СтавкаНДС, Валюта", текСтрокаСтатей.Номенклатура, текСтрокаСтатей.СтавкаНДС, текСтрокаСтатей.Валюта));
	Если массСтрок.Количество() = 1 Тогда 
		текСтрокаГрузоперевозок = массСтрок[0];
		текСтрокаГрузоперевозок.Сальдо            = текСтрокаСтатей.Сальдо;
		текСтрокаГрузоперевозок.КоличествоКВыставлению = текСтрокаСтатей.КоличествоКВыставлению;
		текСтрокаГрузоперевозок.СуммаКВыставлению = текСтрокаСтатей.СуммаКВыставлению;
		текСтрокаГрузоперевозок.Пометка           = (текСтрокаСтатей.СуммаКВыставлению>0);
		
	Иначе 
		ВызватьИсключение "СтатьиСуммаКВыставлениюПриИзменении: редактировать суммы в статьях можно только если работаем с одной грузоперевозкой";
	КонецЕсли;
	
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиСальдоПриИзменении(Элемент)
	
	текСтрокаСтатей = дфкСтатьи.НайтиПоИдентификатору(Элементы.Статьи.ТекущаяСтрока);
	текСтрокаСтатей.СуммаКВыставлению = текСтрокаСтатей.СуммаПоБюджету - текСтрокаСтатей.СуммаФакт - текСтрокаСтатей.Сальдо;
	Если текСтрокаСтатей.СуммаПоБюджету<>0 Тогда 
		текСтрокаСтатей.КоличествоКВыставлению = текСтрокаСтатей.КоличествоПоБюджету * текСтрокаСтатей.СуммаКВыставлению/текСтрокаСтатей.СуммаПоБюджету;
	КонецЕсли;
	// корректно отработает только в случае одной грузоперевозки
	СтатьиСуммаКВыставлениюПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиОтметитьВсе(Команда)
	УстановитьПометкиГрузоперевозок(Элементы.Статьи.ТекущаяСтрока, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиСнятьОтметки(Команда)
	УстановитьПометкиГрузоперевозок(Элементы.Статьи.ТекущаяСтрока,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиГрузоперевозок(ИдентификаторСтроки, НовоеЗначениеПометки)
	
	КоэффциентВыставления =  ПроцентВыставления/100;
	текСтрокаСтатей = дфкСтатьи.НайтиПоИдентификатору(ИдентификаторСтроки);
	массСтрок = дфкГрузоперевозки.НайтиСтроки(Новый Структура("Номенклатура, СтавкаНДС, Валюта", текСтрокаСтатей.Номенклатура, текСтрокаСтатей.СтавкаНДС, текСтрокаСтатей.Валюта));
	Для Каждого строкаГрузоперевозок Из массСтрок Цикл
		строкаГрузоперевозок.Пометка = НовоеЗначениеПометки;
		Если НовоеЗначениеПометки = Истина Тогда
			строкаГрузоперевозок.СуммаКВыставлению = (строкаГрузоперевозок.СуммаПоБюджету - строкаГрузоперевозок.СуммаФакт) * КоэффциентВыставления;//строкаГрузоперевозок.Сальдо;
			Если строкаГрузоперевозок.СуммаПоБюджету<>0 Тогда 
				строкаГрузоперевозок.КоличествоКВыставлению = строкаГрузоперевозок.КоличествоПоБюджету * строкаГрузоперевозок.СуммаКВыставлению/строкаГрузоперевозок.СуммаПоБюджету;
			КонецЕсли;
		Иначе
			строкаГрузоперевозок.КоличествоКВыставлению = 0;
			строкаГрузоперевозок.СуммаКВыставлению = 0;
		КонецЕсли; 
		строкаГрузоперевозок.Сальдо 			= строкаГрузоперевозок.СуммаПоБюджету - строкаГрузоперевозок.СуммаФакт - строкаГрузоперевозок.СуммаКВыставлению;
		строкаГрузоперевозок.СальдоКоличество 	= строкаГрузоперевозок.КоличествоПоБюджету - строкаГрузоперевозок.КоличествоФакт - строкаГрузоперевозок.КоличествоКВыставлению;
		
	КонецЦикла;
	_ПересчитатьТекущуюСтрокуСтатейПоГрузоперевозкам(ИдентификаторСтроки);
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПроцентВыставления(Команда)
	
	Оповещение 			= Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект);
	ПоказатьВводЧисла(Оповещение,ПроцентВыставления,"Введите процент",5,2);
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВводаКоличества(ЗначениеПроцента, Параметры) Экспорт
	
	Если НЕ ЗначениеПроцента = Неопределено Тогда
		Если ЗначениеПроцента > 100 Тогда
			ПоказатьПредупреждение(,"Значение процента не может быть больше 100!");
			ПроцентВыставления = 100;
		ИначеЕсли ЗначениеПроцента < 0 Тогда
			ПоказатьПредупреждение(,"Значение процента не может быть меньше 0!");
			ПроцентВыставления = 100;
		Иначе
			ПроцентВыставления = ЗначениеПроцента;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЗаголовокКнопкиПроцентаВыставления();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если НЕ ПроверитьЗаполнениеДатыКурса() Тогда 
		ПоказатьПредупреждение(, "Не задана дата курсов для пересчёта.");
		Возврат;
	КонецЕсли; 

	СтруктураПараметров = ПолучитьПараметрыДокументаНаСервере();
	
	Если РежимПодбора Тогда  
		
		ПараметрыЗакрытияФормы = Новый Структура;  
		
		ПараметрыЗакрытияФормы.Вставить("Вариант",					"Бюджет");
		ПараметрыЗакрытияФормы.Вставить("ПерезаполнитьДокумент",	ПерезаполнитьДокумент);
		ПараметрыЗакрытияФормы.Вставить("Строки",					СтруктураПараметров.Услуги);
		
		Если СтруктураПараметров.Свойство("КомментарийЗаполнения") Тогда
			ПараметрыЗакрытияФормы.Вставить("КомментарийЗаполнения",СтруктураПараметров.КомментарийЗаполнения);
		КонецЕсли; 
		
		ЭтаФорма.Закрыть(параметрыЗакрытияФормы);
		
	Иначе
		
		ОткрытьФорму(СтруктураПараметров.ИмяФормы,СтруктураПараметров.ПараметрыФормы);
		ЭтаФорма.Закрыть(Истина); 
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеДатыКурса()
	
	Если Валюта = ВалютаДоговора Тогда
		Возврат Истина; 
	КонецЕсли;
	
	Если ВариантКурса = 1 Тогда
		Возврат Истина; 
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(ДатаКурса);
	
КонецФункции
 

&НаСервере
Функция ПолучитьПараметрыДокументаНаСервере()
	
	СтруктураПараметров = Новый Структура("ИмяФормы,ПараметрыФормы");
	
	Если ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда   
		СтруктураДокумента = ПолучитьСтруктуруДокументаДоходовНаСервере();
		СтруктураПараметров.ИмяФормы = "Документ.CW_ДоходыПоГрузоперевозке.ФормаОбъекта";
	Иначе      
		СтруктураДокумента = ПолучитьСтруктуруДокументаРасходовНаСервере();
		СтруктураПараметров.ИмяФормы = "Документ.CW_РасходыПоГрузоперевозке.ФормаОбъекта";
	КонецЕсли; 
	
	АдресПараметровЗаполнения = ПоместитьВоВременноеХранилище(СтруктураДокумента,ЭтаФорма.УникальныйИдентификатор);
	СтруктураПараметров.ПараметрыФормы = Новый Структура("АдресПараметровЗаполнения",АдресПараметровЗаполнения);  
	СтруктураПараметров.Вставить("Услуги", ПоместитьВоВременноеХранилище(СтруктураДокумента.Услуги, УИД));
	
	Возврат СтруктураПараметров;
	
КонецФункции


&НаСервере
Функция ПолучитьСтруктуруДокументаРасходовНаСервере()
	// сейчас только создат и заполняет объект   
	
	ПараметрыУчетнойПолитики 	= CW_Настройки.ПараметрыУчетнойПолитики(ДатаДокумента, Договор.Организация); 
	
	ПодразделениеПользователя = Неопределено;
	Если ПараметрыУчетнойПолитики.ГруппировкаЗатратПоПодразделениям Тогда
		НастройкиПользователя = CW_Настройки.ПолучитьНастройкиПользователя();  
		ПодразделениеПользователя = НастройкиПользователя.ПодразделениеПользователя;
	КонецЕсли;
	
	МассивСообщений 				= Новый Массив;
	ВариантРасчетаРублевойСуммыНДС 	= Константы.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.Получить();

	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("Дата", 				ДатаДокумента);
	СтруктураДокумента.Вставить("Организация", 			Договор.Организация);
	СтруктураДокумента.Вставить("Контрагент", 			Контрагент);
	СтруктураДокумента.Вставить("Договор", 				Договор);
	СтруктураДокумента.Вставить("ПриложениеКДоговору", 	ПриложениеКДоговору);
	СтруктураДокумента.Вставить("Валюта", 				ВалютаДоговора);

	СтрокаИменПараметров 	= "ПорядокЗачетаАвансов;ПорядокЗачетаАвансовОЗ;КоличествоДнейПросрочки;ОсновнойПорядокОтраженияРасходов";
	ПараметрыДоговора 		= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураДокумента,СтрокаИменПараметров);
	СрокОплаты				= СтруктураДокумента.Дата + (24*60*60) * ПараметрыДоговора.КоличествоДнейПросрочки;
	
	СтруктураДокумента.Вставить("СпособЗачетаАвансов",		ПараметрыДоговора.ПорядокЗачетаАвансов);
	СтруктураДокумента.Вставить("СпособЗачетаАвансовОЗ",	ПараметрыДоговора.ПорядокЗачетаАвансовОЗ);
	СтруктураДокумента.Вставить("СрокОплаты", 				СрокОплаты);
	СтруктураДокумента.Вставить("Услуги",					Документы.CW_РасходыПоГрузоперевозке.ПустаяСсылка().Услуги.Выгрузить());
	
	ПорядокОтражения = ПараметрыДоговора.ОсновнойПорядокОтраженияРасходов;
	Если НЕ ЗначениеЗаполнено(ПорядокОтражения) Тогда
		ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
	КонецЕсли; 

	ОсновнаяСтатьяЗатрат 		= CW_Настройки.ПараметрУчетнойПолитики(СтруктураДокумента.Дата, СтруктураДокумента.Организация, "ОсновнаяСтатьяЗатрат");
	СоответствиеСтатейЗатрат 	= ПолучитьСоответствиеСтатейЗатратНоменклатуре();

	СуммаКВыставлентюВВалютеБюджета = 0;
	СуммаВыставелно = 0; 
	МаксимальнаяСумма = 0;
	
	ВедетсяУчетСтатейБюджетаВДокументах = CW_Бюджетирование.ВедетсяУчетСтатейБюджетаВДокументах();
	
	Для Каждого СтрокаТаблицы Из дфкГрузоперевозки Цикл
		Если СтрокаТаблицы.СуммаКВыставлению = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаКВыставлентюВВалютеБюджета = СуммаКВыставлентюВВалютеБюджета + СтрокаТаблицы.СуммаКВыставлению;
	
		НоваяСтрока = СтруктураДокумента.Услуги.Добавить();
		НоваяСтрока.Грузоперевозка = СтрокаТаблицы.Грузоперевозка;
		НоваяСтрока.Номенклатура   = СтрокаТаблицы.Номенклатура;
		НоваяСтрока.СтавкаНДС      = СтрокаТаблицы.СтавкаНДС;
		
		НоваяСтрока.Представление  = НоваяСтрока.Номенклатура.НаименованиеПолное + " " + НоваяСтрока.Грузоперевозка.CW_Представление; 
		
		СтатьяЗатрат = СоответствиеСтатейЗатрат.Получить(СтрокаТаблицы.Номенклатура);
		СтатьяЗатрат = ?(СтатьяЗатрат = Неопределено, ОсновнаяСтатьяЗатрат, СтатьяЗатрат); 
		
		НоваяСтрока.СтатьяЗатрат   = СтатьяЗатрат;  
		
		Если ВедетсяУчетСтатейБюджетаВДокументах Тогда
			НоваяСтрока.СтатьяБюджета = СтрокаТаблицы.СтатьяБюджета;	
		КонецЕсли;
	
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПорядокОтраженияРасходов) Тогда
			НоваяСтрока.ПорядокОтражения = СтрокаТаблицы.ПорядокОтраженияРасходов;
		Иначе
			НоваяСтрока.ПорядокОтражения = ПорядокОтражения;
		КонецЕсли; 
		
		НоваяСтрока.Подразделение = ПодразделениеПользователя;
		
		Если (НоваяСтрока.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
			// пытаемся получить клиента и его договор
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Объект"				, СтрокаТаблицы.Грузоперевозка);
			СтруктураПараметров.Вставить("ЭтоВариантБюджета"	, Ложь);
			СтруктураПараметров.Вставить("Контрагент"			, СтрокаТаблицы.Грузоперевозка.Клиент);
			
			Плательщик = CW_Финансы.ВернутьПлательщика(СтруктураПараметров);
			Если ЗначениеЗаполнено(Плательщик) Тогда
				ДоговорПокупателя =	CW_Документы.ПолучитьПоследнийДоговор(Плательщик, Договор.Организация, Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);	
				НоваяСтрока.Покупатель 			= Плательщик;
				НоваяСтрока.ДоговорПокупателя 	= ДоговорПокупателя;
			КонецЕсли; 
		КонецЕсли; 
		
		Если НЕ флИспользоватьКоличествоВБюджетах ИЛИ СтрокаТаблицы.КоличествоКВыставлению =0 Тогда 
			НоваяСтрока.Количество	= 1;
		Иначе 
			НоваяСтрока.Количество	= СтрокаТаблицы.КоличествоКВыставлению;
		КонецЕсли;
	
		Если Валюта <> ВалютаДоговора Тогда
			
			КурсНаДату = ДатаКурса;
		
			Если ВариантКурса = 0 Тогда
				
				ПараметрДатыКурса = СтрокаТаблицы.СтатьяБюджета.КонтрольнаяДатаКурсаДляПроверки; 
				Если ЗначениеЗаполнено(ПараметрДатыКурса) Тогда
					ДатаПараметра = ПолучитьДатуКурсаПоПараметруНаСервере(СтрокаТаблицы.Грузоперевозка, ПараметрДатыКурса);
					Если ДатаПараметра = Неопределено Тогда
						МассивСообщений.Добавить("У грузоперевозки """+Строка(СтрокаТаблицы.Грузоперевозка)+""" значение параметра """ + Строка(ПараметрДатыКурса) + """ не задано. Расчет суммы произведен по курсу на " + Формат(ДатаКурса,"ДФ=dd.MM.yy") + ".");
					Иначе
						КурсНаДату = ДатаПараметра;
					КонецЕсли;
				КонецЕсли;  
				
				КурсВалютыБюджета 	= CW_Финансы.ПолучитьКурсВалюты(СтрокаТаблицы.Валюта, 	КурсНаДату);
				КурсВалютыДоговора 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора, 		КурсНаДату); 
				
			Иначе  
				
				КурсВалютыБюджета = Новый Структура;
				КурсВалютыБюджета.Вставить("Курс", 		СтрокаТаблицы.СтатьяБюджетаКурс);
				КурсВалютыБюджета.Вставить("Кратность", СтрокаТаблицы.СтатьяБюджетаКратность);
				
				КурсВалютыДоговора 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора, 	 	КурсНаДату); 
		
			КонецЕсли;   
			
			НоваяСтрока.Всего	= CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаКВыставлению,
																		Валюта,
																		ВалютаДоговора,
																		КурсВалютыБюджета.Курс,
																		КурсВалютыДоговора.Курс,
																		КурсВалютыБюджета.Кратность,
																		КурсВалютыДоговора.Кратность);
																		
			Если СтрокаТаблицы.СуммаКВыставлению = СтрокаТаблицы.СуммаПоБюджету Тогда  
																			
				СтавкаНДСПроцент 	= CW_Финансы.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС)/100;
				
				Если ВариантРасчетаРублевойСуммыНДС = ПредопределенноеЗначение("Перечисление.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.РасчетОтРублевойСуммыВсего") Тогда
					
					НоваяСтрока.НДС		= Окр(НоваяСтрока.Всего * СтавкаНДСПроцент / (1+СтавкаНДСПроцент),2,1);
					НоваяСтрока.Сумма	= НоваяСтрока.Всего - НоваяСтрока.НДС; 
					
				ИначеЕсли ВариантРасчетаРублевойСуммыНДС = ПредопределенноеЗначение("Перечисление.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.РасчетОтРублевойСуммыБезНДС") Тогда
					
					СуммаБезНДС			= ПолучитьСуммуБезНДС(СтрокаТаблицы, Перечисления.CW_ВидыСтатейПланирования.Расходы);
					
					НоваяСтрока.Сумма  	= CW_Финансы.ПересчитатьИзВалютыВВалюту(СуммаБезНДС,
																				Валюта,
																				ВалютаДоговора,
																				КурсВалютыБюджета.Курс,
																				КурсВалютыДоговора.Курс,
																				КурсВалютыБюджета.Кратность,
																				КурсВалютыДоговора.Кратность);	
					
					НоваяСтрока.НДС		= Окр(НоваяСтрока.Сумма * СтавкаНДСПроцент, 2,1);
					НоваяСтрока.Всего	= НоваяСтрока.Сумма + НоваяСтрока.НДС;
					
				Иначе
					НоваяСтрока.НДС		= CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаНДСПоБюджету,
																				Валюта,
																				ВалютаДоговора,
																				КурсВалютыБюджета.Курс,
																				КурсВалютыДоговора.Курс,
																				КурсВалютыБюджета.Кратность,
																				КурсВалютыДоговора.Кратность);	
																				
					НоваяСтрока.Сумма	= НоваяСтрока.Всего - НоваяСтрока.НДС;
				КонецЕсли;
				
			КонецЕсли

		Иначе
			
			НоваяСтрока.Всего = СтрокаТаблицы.СуммаКВыставлению;
			Если СтрокаТаблицы.СуммаКВыставлению = СтрокаТаблицы.СуммаПоБюджету Тогда
				НоваяСтрока.НДС 	= СтрокаТаблицы.СуммаНДСПоБюджету;
				НоваяСтрока.Сумма	= НоваяСтрока.Всего - НоваяСтрока.НДС;
			КонецЕсли
			
		КонецЕсли; 
		
		МаксимальнаяСумма 	= Макс(МаксимальнаяСумма, НоваяСтрока.Всего);
		СуммаВыставелно 	= СуммаВыставелно + НоваяСтрока.Всего;
	
		Если СтрокаТаблицы.СуммаКВыставлению <> СтрокаТаблицы.СуммаПоБюджету Тогда
			СтавкаНДСПроцент 	= CW_Финансы.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС)/100;
			НоваяСтрока.НДС		= Окр(НоваяСтрока.Всего * СтавкаНДСПроцент / (1+СтавкаНДСПроцент),2,1);
			НоваяСтрока.Сумма	= НоваяСтрока.Всего - НоваяСтрока.НДС;
		КонецЕсли;
		
		НоваяСтрока.Цена  = ?(НоваяСтрока.Количество=0, 1, НоваяСтрока.Сумма /НоваяСтрока.Количество);     
		
		ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
		ПараметрыШаблона.Номенклатура 			= НоваяСтрока.Номенклатура;
		ПараметрыШаблона.Объект 				= СтруктураДокумента;
		ПараметрыШаблона.Дата 					= СтруктураДокумента.Дата;
		ПараметрыШаблона.Договор 				= Договор;
		ПараметрыШаблона.ВидДоговора 			= Договор.ВидДоговора;
		ПараметрыШаблона.ПриложениеКДоговору 	= ПриложениеКДоговору;
		
		CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(НоваяСтрока, ПараметрыШаблона); 
		
		Если ДобавлятьКомментарии Тогда
			КомментарийСтатьи = _ПолучитьКомментарий(СтрокаТаблицы,Перечисления.CW_ВидыСтатейПланирования.Расходы);
			Если Не ПустаяСтрока(КомментарийСтатьи) Тогда     
				НоваяСтрока.Представление = НоваяСтрока.Представление + " ("+КомментарийСтатьи+")";	
			КонецЕсли; 
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ПересчетСуммы = 1 Тогда   
		
		ВалютаСтатьи = дфкСтатьи.Выгрузить(, "Валюта");  
		ВалютаСтатьи.Свернуть("Валюта",);
		ВалютаСтатейБюджета = ВалютаСтатьи[0].Валюта;

		КурсВалютыБюджета 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаСтатейБюджета,	ДатаКурса);
		КурсВалютыДоговора 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора,			ДатаКурса); 
		
		ВсегоКВыставлению	= CW_Финансы.ПересчитатьИзВалютыВВалюту(СуммаКВыставлентюВВалютеБюджета,
																	ВалютаСтатейБюджета,
																	ВалютаДоговора,
																	КурсВалютыБюджета.Курс,
																	КурсВалютыДоговора.Курс,
																	КурсВалютыБюджета.Кратность,
																	КурсВалютыДоговора.Кратность);  
		
		
		Разница = ВсегоКВыставлению - СуммаВыставелно;
		Если Разница <> 0 Тогда
			
			Отбор = Новый Структура("Всего", МаксимальнаяСумма);
			мСтроки = СтруктураДокумента.Услуги.НайтиСтроки(Отбор);
			Если мСтроки.Количество() > 0 Тогда
				СтрокаРаспределения = мСтроки[0]; // берем первую, так как строк может быть несколько
				СтрокаРаспределения.Всего = СтрокаРаспределения.Всего + Разница;
				
				СтавкаНДСПроцент = CW_Финансы.ПолучитьСтавкуНДС(СтрокаРаспределения.СтавкаНДС)/100;
				
				СтрокаРаспределения.НДС		= Окр(СтрокаРаспределения.Всего*СтавкаНДСПроцент/(1+СтавкаНДСПроцент),2,1);
				СтрокаРаспределения.Сумма	= Окр(СтрокаРаспределения.Всего - СтрокаРаспределения.НДС,2,1);
				
				СтрокаРаспределения.Цена  = ?(СтрокаРаспределения.Количество=0, 1, Окр(СтрокаРаспределения.Сумма /СтрокаРаспределения.Количество,2,1));     
	
			КонецЕсли;
			
		КонецЕсли;
																			
		
	КонецЕсли;

	
	Если МассивСообщений.Количество() > 0 Тогда
		СтруктураДокумента.Вставить("КомментарийЗаполнения", СтрСоединить(МассивСообщений,Символы.ПС));
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(ВерсияБюджета.Обработка)) Тогда
		
		// Вид: ОбработкаУслугПоБюджету
		// Функция: ОбработатьТаблицуУслуг(ОбработкаСсылка,ВерсияБюджета,ТаблицаУслуг);
		
		ОбработкаОбъект = _ПО.ПолучитьОбработку(ВерсияБюджета.Обработка);
		Результат 		= ОбработкаОбъект.ОбработатьТаблицуУслуг(ВерсияБюджета.Обработка,ВерсияБюджета,СтруктураДокумента.Услуги);
		ОбработкаОбъект = Неопределено;
		
		Если _УФКС.ВыполненоУспешно(Результат) Тогда
			// параметры
			СтруктураДокумента.Услуги = Результат.Услуги;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(_УФКС.ПредставлениеОшибки(Результат));
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат СтруктураДокумента;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруДокументаДоходовНаСервере()
	
	УчетСтатейБюджетаВДокументах = ПолучитьФункциональнуюОпцию("CW_УчетСтатейБюджетаВДокументах");

	// сейчас только создает и заполняет объект
	ВариантРасчетаРублевойСуммыНДС = Константы.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.Получить();

	СтруктураДокумента = Новый Структура;
	
	СтруктураДокумента.Вставить("ВидОперации", 			Перечисления.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг);
	СтруктураДокумента.Вставить("Дата",					ДатаДокумента);
	СтруктураДокумента.Вставить("Организация", 			Договор.Организация);
	СтруктураДокумента.Вставить("Контрагент", 			Контрагент);
	СтруктураДокумента.Вставить("Договор", 				Договор);
	СтруктураДокумента.Вставить("ПриложениеКДоговору", 	ПриложениеКДоговору);
	СтруктураДокумента.Вставить("Валюта", 				ВалютаДоговора);
	
	СтрокаИменПараметров 	= "ПорядокЗачетаАвансов;ПорядокЗачетаАвансовОЗ;КоличествоДнейПросрочки;ОсновнойПорядокОтраженияДоходов";
	ПараметрыДоговора 		= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураДокумента,СтрокаИменПараметров);
	
	СрокОплаты = СтруктураДокумента.Дата + (24*60*60) * ПараметрыДоговора.КоличествоДнейПросрочки;
	
	СтруктураДокумента.Вставить("СпособЗачетаАвансов",		ПараметрыДоговора.ПорядокЗачетаАвансов);
	СтруктураДокумента.Вставить("СпособЗачетаАвансовОЗ",	ПараметрыДоговора.ПорядокЗачетаАвансовОЗ);
	СтруктураДокумента.Вставить("СрокОплаты", 				СрокОплаты);
	СтруктураДокумента.Вставить("Услуги",					Документы.CW_ДоходыПоГрузоперевозке.ПустаяСсылка().Услуги.Выгрузить());

	ПорядокОтражения = ПараметрыДоговора.ОсновнойПорядокОтраженияДоходов; 
	Если (НЕ ЗначениеЗаполнено(ПорядокОтражения)) Тогда
		ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
	КонецЕсли; 

	ОсновнаяСтатьяЗатрат 		= CW_Настройки.ПараметрУчетнойПолитики(СтруктураДокумента.Дата, СтруктураДокумента.Организация, "ОсновнаяСтатьяЗатрат");
	СоответствиеСтатейЗатрат 	= ПолучитьСоответствиеСтатейЗатратНоменклатуре();
	
	МассивСообщений 	= Новый Массив; 
	
	СуммаКВыставлентюВВалютеБюджета = 0;
	СуммаВыставелно = 0; 
	МаксимальнаяСумма = 0;

	ВедетсяУчетСтатейБюджетаВДокументах = CW_Бюджетирование.ВедетсяУчетСтатейБюджетаВДокументах();
	
	Для Каждого СтрокаТаблицы Из дфкГрузоперевозки Цикл 
		Если СтрокаТаблицы.СуммаКВыставлению = 0 Тогда
			Продолжить;
		КонецЕсли;  
		
		СуммаКВыставлентюВВалютеБюджета = СуммаКВыставлентюВВалютеБюджета + СтрокаТаблицы.СуммаКВыставлению;
		
		НоваяСтрока = СтруктураДокумента.Услуги.Добавить();
		НоваяСтрока.Грузоперевозка = СтрокаТаблицы.Грузоперевозка;
		НоваяСтрока.Номенклатура   = СтрокаТаблицы.Номенклатура;
		НоваяСтрока.СтавкаНДС      = СтрокаТаблицы.СтавкаНДС;      
		
		СтатьяЗатрат = СоответствиеСтатейЗатрат.Получить(СтрокаТаблицы.Номенклатура);
		СтатьяЗатрат = ?(СтатьяЗатрат = Неопределено, ОсновнаяСтатьяЗатрат, СтатьяЗатрат); 

		НоваяСтрока.СтатьяЗатрат   = СтатьяЗатрат;  
		Если ВедетсяУчетСтатейБюджетаВДокументах Тогда
			НоваяСтрока.СтатьяБюджета = СтрокаТаблицы.СтатьяБюджета;	
		КонецЕсли;
	
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПорядокОтраженияДоходов) Тогда
			НоваяСтрока.ПорядокОтражения = СтрокаТаблицы.ПорядокОтраженияДоходов;
		Иначе
			НоваяСтрока.ПорядокОтражения = ПорядокОтражения;
		КонецЕсли;  
		
		Если НЕ флИспользоватьКоличествоВБюджетах ИЛИ СтрокаТаблицы.КоличествоКВыставлению = 0 Тогда 
			НоваяСтрока.Количество = 1;
		Иначе 
			НоваяСтрока.Количество = СтрокаТаблицы.КоличествоКВыставлению;
		КонецЕсли;
		
		Если Валюта <> ВалютаДоговора Тогда
			
			КурсНаДату = ДатаКурса;
		
			Если ВариантКурса = 0 Тогда
				
				ПараметрДатыКурса = СтрокаТаблицы.СтатьяБюджета.КонтрольнаяДатаКурсаДляПроверки; 
				Если ЗначениеЗаполнено(ПараметрДатыКурса) Тогда
					ДатаПараметра = ПолучитьДатуКурсаПоПараметруНаСервере(СтрокаТаблицы.Грузоперевозка, ПараметрДатыКурса);
					Если ДатаПараметра = Неопределено Тогда
						МассивСообщений.Добавить("У грузоперевозки """+Строка(СтрокаТаблицы.Грузоперевозка)+""" значение параметра """ + Строка(ПараметрДатыКурса) + """ не задано. Расчет суммы произведен по курсу на " + Формат(ДатаКурса,"ДФ=dd.MM.yy") + ".");
					Иначе
						КурсНаДату = ДатаПараметра;
					КонецЕсли;
				КонецЕсли;  
				
				КурсВалютыБюджета 	= CW_Финансы.ПолучитьКурсВалюты(СтрокаТаблицы.Валюта, 	КурсНаДату);
				КурсВалютыДоговора 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора, 		КурсНаДату); 
				
			Иначе  
				
				КурсВалютыБюджета = Новый Структура;
				КурсВалютыБюджета.Вставить("Курс", 		СтрокаТаблицы.СтатьяБюджетаКурс);
				КурсВалютыБюджета.Вставить("Кратность", СтрокаТаблицы.СтатьяБюджетаКратность);
				
				КурсВалютыДоговора 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора, 	 	КурсНаДату); 
		
			КонецЕсли;
			
			НоваяСтрока.Всего	= CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаКВыставлению,
																		Валюта,
																		ВалютаДоговора,
																		КурсВалютыБюджета.Курс,
																		КурсВалютыДоговора.Курс,
																		КурсВалютыБюджета.Кратность,
																		КурсВалютыДоговора.Кратность);
																		
			Если СтрокаТаблицы.СуммаКВыставлению = СтрокаТаблицы.СуммаПоБюджету Тогда 
				
				СтавкаНДСПроцент 	= CW_Финансы.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС)/100;
				
				Если ВариантРасчетаРублевойСуммыНДС = ПредопределенноеЗначение("Перечисление.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.РасчетОтРублевойСуммыВсего") Тогда
					
					НоваяСтрока.НДС		= НоваяСтрока.Всего*СтавкаНДСПроцент/(1+СтавкаНДСПроцент);
					НоваяСтрока.Сумма	= НоваяСтрока.Всего - НоваяСтрока.НДС;
					
				ИначеЕсли ВариантРасчетаРублевойСуммыНДС = ПредопределенноеЗначение("Перечисление.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.РасчетОтРублевойСуммыБезНДС") Тогда
					
					СуммаБезНДС			= ПолучитьСуммуБезНДС(СтрокаТаблицы,Перечисления.CW_ВидыСтатейПланирования.Доходы);
					НоваяСтрока.Сумма  	= CW_Финансы.ПересчитатьИзВалютыВВалюту(СуммаБезНДС,
																				Валюта,
																				ВалютаДоговора,
																				КурсВалютыБюджета.Курс,
																				КурсВалютыДоговора.Курс,
																				КурсВалютыБюджета.Кратность,
																				КурсВалютыДоговора.Кратность);	     
					
					НоваяСтрока.НДС		= Окр(НоваяСтрока.Сумма*СтавкаНДСПроцент, 2);
					НоваяСтрока.Всего	= НоваяСтрока.Сумма + НоваяСтрока.НДС;
					
				Иначе
					
					НоваяСтрока.НДС		= CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаНДСПоБюджету,
																				Валюта,
																				ВалютаДоговора,
																				КурсВалютыБюджета.Курс,
																				КурсВалютыДоговора.Курс,
																				КурсВалютыБюджета.Кратность,
																				КурсВалютыДоговора.Кратность);	      
																				
					НоваяСтрока.Сумма		= НоваяСтрока.Всего - НоваяСтрока.НДС;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе 
			
			НоваяСтрока.Всего	= СтрокаТаблицы.СуммаКВыставлению; 
			
			Если СтрокаТаблицы.СуммаКВыставлению = СтрокаТаблицы.СуммаПоБюджету Тогда 
				НоваяСтрока.НДС 	= СтрокаТаблицы.СуммаНДСПоБюджету;
				НоваяСтрока.Сумма	= НоваяСтрока.Всего - НоваяСтрока.НДС;
			КонецЕсли; 
			
		КонецЕсли;  
		
		МаксимальнаяСумма 	= Макс(МаксимальнаяСумма, НоваяСтрока.Всего);
		СуммаВыставелно 	= СуммаВыставелно + НоваяСтрока.Всего;
		
		Если СтрокаТаблицы.СуммаКВыставлению <> СтрокаТаблицы.СуммаПоБюджету Тогда 
			СтавкаНДСПроцент 	= CW_Финансы.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС)/100;
			НоваяСтрока.НДС		= НоваяСтрока.Всего*СтавкаНДСПроцент/(1+СтавкаНДСПроцент);
			НоваяСтрока.Сумма	= НоваяСтрока.Всего - НоваяСтрока.НДС;
		КонецЕсли;
		
		НоваяСтрока.Цена  = ?(НоваяСтрока.Количество, 0, НоваяСтрока.Сумма /НоваяСтрока.Количество);     
		
		ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
		ПараметрыШаблона.Номенклатура 			= НоваяСтрока.Номенклатура;
		ПараметрыШаблона.Объект 				= СтруктураДокумента;
		ПараметрыШаблона.Дата 					= СтруктураДокумента.Дата;
		ПараметрыШаблона.Договор 				= Договор;
		ПараметрыШаблона.ВидДоговора 			= Договор.ВидДоговора;
		ПараметрыШаблона.ПриложениеКДоговору 	= ПриложениеКДоговору;
		
		CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(НоваяСтрока, ПараметрыШаблона); 
		
		Если ДобавлятьКомментарии Тогда
			КомментарийСтатьи = _ПолучитьКомментарий(СтрокаТаблицы, Перечисления.CW_ВидыСтатейПланирования.Доходы);
			Если Не ПустаяСтрока(КомментарийСтатьи) Тогда  
				НоваяСтрока.Представление = НоваяСтрока.Представление + " ("+КомментарийСтатьи+")";
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла; 

	Если ПересчетСуммы = 1 Тогда 
		
		ВалютаСтатьи = дфкСтатьи.Выгрузить(, "Валюта");  
		ВалютаСтатьи.Свернуть("Валюта",);
		ВалютаСтатейБюджета = ВалютаСтатьи[0].Валюта;

		КурсВалютыБюджета 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаСтатейБюджета,	ДатаКурса);
		КурсВалютыДоговора 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора,			ДатаКурса); 
		
		ВсегоКВыставлению	= CW_Финансы.ПересчитатьИзВалютыВВалюту(СуммаКВыставлентюВВалютеБюджета,
																	ВалютаСтатейБюджета,
																	ВалютаДоговора,
																	КурсВалютыБюджета.Курс,
																	КурсВалютыДоговора.Курс,
																	КурсВалютыБюджета.Кратность,
																	КурсВалютыДоговора.Кратность);  
		
		
		Разница = ВсегоКВыставлению - СуммаВыставелно;
		Если Разница <> 0 Тогда
			
			Отбор = Новый Структура("Всего", МаксимальнаяСумма);
			мСтроки = СтруктураДокумента.Услуги.НайтиСтроки(Отбор);
			Если мСтроки.Количество() > 0 Тогда
				СтрокаРаспределения = мСтроки[0]; // берем первую, так как строк может быть несколько
				СтрокаРаспределения.Всего = СтрокаРаспределения.Всего + Разница;
				
				СтавкаНДСПроцент = CW_Финансы.ПолучитьСтавкуНДС(СтрокаРаспределения.СтавкаНДС)/100;
				
				СтрокаРаспределения.НДС		= СтрокаРаспределения.Всего*СтавкаНДСПроцент/(1+СтавкаНДСПроцент);
				СтрокаРаспределения.Сумма	= СтрокаРаспределения.Всего - СтрокаРаспределения.НДС;
				
				СтрокаРаспределения.Цена  = ?(СтрокаРаспределения.Количество, 0, СтрокаРаспределения.Сумма /СтрокаРаспределения.Количество);     
	
			КонецЕсли;
			
		КонецЕсли;
																			
		
	КонецЕсли;
	
	Если МассивСообщений.Количество() > 0 Тогда
		СтруктураДокумента.Вставить("КомментарийЗаполнения", СтрСоединить(МассивСообщений,Символы.ПС));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВерсияБюджета.Обработка) Тогда
		
		// Вид: ОбработкаУслугПоБюджету
		// Функция: ОбработатьТаблицуУслуг(ОбработкаСсылка,ВерсияБюджета,ТаблицаУслуг);
		
		ОбработкаОбъект = _ПО.ПолучитьОбработку(ВерсияБюджета.Обработка);
		Результат 		= ОбработкаОбъект.ОбработатьТаблицуУслуг(ВерсияБюджета.Обработка,ВерсияБюджета,СтруктураДокумента.Услуги);
		ОбработкаОбъект = Неопределено;
		Если _УФКС.ВыполненоУспешно(Результат) Тогда
			// параметры
			СтруктураДокумента.Услуги = Результат.Услуги;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(_УФКС.ПредставлениеОшибки(Результат));
		КонецЕсли; 
		
	КонецЕсли; 

	Возврат СтруктураДокумента;
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеСтатейЗатратНоменклатуре()
	
	СоответствиеСтатейЗатрат = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СтатьиЗатратНоменклатуры.Номенклатура КАК Номенклатура,
	|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат КАК СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры";  
	
	РезульттаЗапроса = Запрос.Выполнить();
	Выборка = РезульттаЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеСтатейЗатрат.Вставить(Выборка.Номенклатура, Выборка.СтатьяЗатрат);	
	КонецЦикла;
	Возврат СоответствиеСтатейЗатрат;

КонецФункции


&НаСервере
Функция ПолучитьДатуКурсаПоПараметруНаСервере(Грузоперевозка, ПараметрДатыКурса)
	
	СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(Грузоперевозка, ПараметрДатыКурса);
	Если (СтрокаПараметра <> Неопределено) Тогда
		
		Если (ПараметрДатыКурса.ЭтоКонтрольнаяДата) Тогда
			
			Если (ЗначениеЗаполнено(СтрокаПараметра.ЗначениеФакт)) Тогда
				Возврат (СтрокаПараметра.ЗначениеФакт);
			Иначе
				Возврат(Неопределено);
			КонецЕсли; 
			
		Иначе
			
			Если (ЗначениеЗаполнено(СтрокаПараметра.Значение)) Тогда
				Возврат(СтрокаПараметра.Значение);
			Иначе
				Возврат(Неопределено);
			КонецЕсли; 
			
		КонецЕсли; 
		
	Иначе
		
		Возврат(Неопределено);
		
	КонецЕсли; 
	
КонецФункции
 

&НаСервере
Функция _СформироватьСтрокиДокумента()
	
	ВариантРасчетаРублевойСуммыНДС = Константы.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.Получить();
	
	// --- 
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата = ТекущаяДата();
	СтруктураПараметров.Договор = Договор;
	СтруктураПараметров.ПриложениеКДоговору = ПриложениеКДоговору;
	
	ПД = CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров,"ОсновнойПорядокОтраженияДоходов;ОсновнойПорядокОтраженияРасходов");

	ТекстЗапроса = "ВЫБРАТЬ
	|	CW_СтатьиЗатратНоменклатуры.Номенклатура,
	|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры";
	СоответствиеСтатейЗатрат = _сф.со_Создать("Номенклатура","СтатьяЗатрат",_сф.ВыполнитьЗапрос(ТекстЗапроса));
	ОсновнаяСтатьяЗатрат = CW_Настройки.ПараметрУчетнойПолитики(ТекущаяДата(), Договор.Организация, "ОсновнаяСтатьяЗатрат");
	
	Пересчет = (Валюта <> ВалютаДоговора);
	ЕстьПустыеКД = Ложь;
	
	Если ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		
		Если (Пересчет) Тогда
			
			ТаблицаГП = дфкГрузоперевозки.Выгрузить().Скопировать(,"Грузоперевозка,Номенклатура,СтавкаНДС,Валюта");
			ТаблицаГП.Свернуть("Грузоперевозка,Номенклатура,СтавкаНДС,Валюта");
			ТаблицаГП.Колонки.Добавить("СтатьяПланирования");
			ТаблицаГП.Колонки.Добавить("ДатаКурса");
			
			ЕстьПустыеКД=Ложь;
			МассивСообщений = Новый Массив;
			Для каждого Стр Из ТаблицаГП Цикл
				
				СтруктураСтатьяПланирования = _ПолучитьСтатьюПланирования(Стр,Перечисления.CW_ВидыСтатейПланирования.Доходы);
				Стр.СтатьяПланирования 	= СтруктураСтатьяПланирования.Ссылка;
				ПараметрДатыКурса 		= СтруктураСтатьяПланирования.КонтрольнаяДатаКурсаДляПроверки;
				
				Если (ЗначениеЗаполнено(ПараметрДатыКурса)) Тогда
					РД = ПолучитьДатуКурсаПоПараметруНаСервере(Стр.Грузоперевозка,ПараметрДатыКурса);
					Если (РД = Неопределено) Тогда
						
						МассивСообщений.Добавить("У грузоперевозки """+Строка(Стр.Грузоперевозка)+""" значение параметра """ + Строка(ПараметрДатыКурса) + """ не задано. Расчет суммы произведен по курсу на " + Формат(ДатаКурса,"ДФ=dd.MM.yy") + ".");
						ЕстьПустыеКД=Истина;
						РД = ДатаКурса;
						
					КонецЕсли;
				Иначе
					РД = ДатаКурса;	
				КонецЕсли; 
				// --- 
				Стр.ДатаКурса = РД;
				
			КонецЦикла;
			
			ДатыКурсовПоСтатьям = _сф.со_Создать("СтатьяПланирования","ДатаКурса",ТаблицаГП);
			
		КонецЕсли; 
		
		ПорядокОтражения = ПД.ОсновнойПорядокОтраженияДоходов;
		Если (НЕ ЗначениеЗаполнено(ПорядокОтражения)) Тогда
			ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
		КонецЕсли; 
		
		ТЗУслуг = Документы.CW_ДоходыПоГрузоперевозке.ПустаяСсылка().Услуги.Выгрузить();
		// --- 
		СЗ = Новый Структура;
		СЗ.Вставить("ВидОперации", Перечисления.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг);
		СЗ.Вставить("Дата", ТекущаяДата());
		СЗ.Вставить("Организация", Договор.Организация);
		СЗ.Вставить("Контрагент", Контрагент);
		СЗ.Вставить("Договор", Договор);
		СЗ.Вставить("ПриложениеКДоговору", ПриложениеКДоговору);
		СЗ.Вставить("Валюта", Валюта);
	
		Для Каждого Стр Из дфкГрузоперевозки Цикл
			
			Если Стр.СуммаКВыставлению <> 0 Тогда
				
				Если (Пересчет) Тогда
					
					СтатьяПланирования = _ПолучитьСтатьюПланирования(Стр,Перечисления.CW_ВидыСтатейПланирования.Доходы);
					Если ЗначениеЗаполнено(СтатьяПланирования.Ссылка) Тогда
						ТДК = ДатыКурсовПоСтатьям.Получить(СтатьяПланирования.Ссылка);	
					Иначе
						ТДК = ДатаКурса;
					КонецЕсли; 
					// --- 
					КурсВалютыБюджета = CW_Финансы.ПолучитьКурсВалюты(Стр.Валюта,ТДК);
					КурсВалютыДоговора = CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора,ТДК);
					
				КонецЕсли;
				
				Нстр = ТЗУслуг.Добавить();
				Нстр.Грузоперевозка = Стр.Грузоперевозка;
				Нстр.Номенклатура   = Стр.Номенклатура;
				Нстр.СтавкаНДС      = Стр.СтавкаНДС;
				Нстр.Представление  = Нстр.Номенклатура.НаименованиеПолное + " " + Нстр.Грузоперевозка.CW_Представление;
				Нстр.СтатьяЗатрат   = _сф.со_Получить(СоответствиеСтатейЗатрат,Нстр.Номенклатура,ОсновнаяСтатьяЗатрат);
				Если (ЗначениеЗаполнено(Стр.ПорядокОтраженияДоходов)) Тогда
					Нстр.ПорядокОтражения = Стр.ПорядокОтраженияДоходов;
				Иначе
					Нстр.ПорядокОтражения = ПорядокОтражения;
				КонецЕсли; 
				Если 0=стр.КоличествоКВыставлению ИЛИ НЕ флИспользоватьКоличествоВБюджетах Тогда 
					Нстр.Количество     = 1;
				Иначе 
					Нстр.Количество     = стр.КоличествоКВыставлению;
				КонецЕсли;
				Если (НЕ Пересчет) Тогда
					Нстр.Всего     		= Стр.СуммаКВыставлению;
				Иначе
					Нстр.Всего			= CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.СуммаКВыставлению,Валюта,ВалютаДоговора,КурсВалютыБюджета.Курс,КурсВалютыДоговора.Курс,КурсВалютыБюджета.Кратность,КурсВалютыДоговора.Кратность);
				КонецЕсли;
				
				Если (Стр.СуммаКВыставлению = Стр.СуммаПоБюджету) Тогда 
					// (будет работать только при полном выставлении по бюджету, но иначе пока не получается)
					Если (НЕ Пересчет) Тогда
						Нстр.НДС	= Стр.СуммаНДСПоБюджету;
						Нстр.Сумма	= Нстр.Всего - Нстр.НДС;
					Иначе
						СтавкаНДСПроцент 	= CW_Финансы.ПолучитьСтавкуНДС(Нстр.СтавкаНДС)/100;
						
						Если ВариантРасчетаРублевойСуммыНДС = ПредопределенноеЗначение("Перечисление.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.РасчетОтРублевойСуммыВсего") Тогда
							
							Нстр.НДС		= Нстр.Всего*СтавкаНДСПроцент/(1+СтавкаНДСПроцент);
							Нстр.Сумма		= Нстр.Всего - Нстр.НДС;
							
						ИначеЕсли ВариантРасчетаРублевойСуммыНДС = ПредопределенноеЗначение("Перечисление.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.РасчетОтРублевойСуммыБезНДС") Тогда
							
							СуммаБезНДС		= ПолучитьСуммуБезНДС(Стр,Перечисления.CW_ВидыСтатейПланирования.Доходы);
							Нстр.Сумма  	= CW_Финансы.ПересчитатьИзВалютыВВалюту(СуммаБезНДС,Валюта,ВалютаДоговора,КурсВалютыБюджета.Курс,КурсВалютыДоговора.Курс,КурсВалютыБюджета.Кратность,КурсВалютыДоговора.Кратность);	
							Нстр.НДС 		= Окр(Нстр.Сумма*СтавкаНДСПроцент, 2);
							Нстр.Всего		= Нстр.Сумма + Нстр.НДС;
							
						Иначе
							
							Нстр.НДС 		= CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.СуммаНДСПоБюджету,Валюта,ВалютаДоговора,КурсВалютыБюджета.Курс,КурсВалютыДоговора.Курс,КурсВалютыБюджета.Кратность,КурсВалютыДоговора.Кратность);	
							Нстр.Сумма		= Нстр.Всего - Нстр.НДС;
							
						КонецЕсли;
					КонецЕсли; 
				Иначе 
					СтавкаНДСПроцент 	= CW_Финансы.ПолучитьСтавкуНДС(Нстр.СтавкаНДС)/100;
					Нстр.НДС       		= Нстр.Всего*СтавкаНДСПроцент/(1+СтавкаНДСПроцент);
					Нстр.Сумма          = Нстр.Всего - Нстр.НДС;
				КонецЕсли;
				
				Нстр.Цена           = _сф.БезопасноРазделить(Нстр.Сумма, Нстр.Количество);
				
				// --- 
				
				ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
				
				ПараметрыШаблона.Номенклатура 	= Нстр.Номенклатура;
				ПараметрыШаблона.Объект 		= СЗ;
				ПараметрыШаблона.Дата 			= СЗ.Дата;
				ПараметрыШаблона.Договор 		= Договор;
				ПараметрыШаблона.ВидДоговора 	= Договор.ВидДоговора;
				ПараметрыШаблона.ПриложениеКДоговору = ПриложениеКДоговору;
				
				CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(Нстр, ПараметрыШаблона); 
				
				Если (ДобавлятьКомментарии) Тогда
					
					КомментарийСтатьи = _ПолучитьКомментарий(Стр,Перечисления.CW_ВидыСтатейПланирования.Доходы);
					Если (ЗначениеЗаполнено(КомментарийСтатьи)) Тогда
						_сф.стр_Добавить(Нстр.Представление," ("+КомментарийСтатьи+")");	
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	Иначе
		
		Если (Пересчет) Тогда
			
			ТаблицаГП = дфкГрузоперевозки.Выгрузить().Скопировать(,"Грузоперевозка,Номенклатура,СтавкаНДС,Валюта");
			ТаблицаГП.Свернуть("Грузоперевозка,Номенклатура,СтавкаНДС,Валюта");
			ТаблицаГП.Колонки.Добавить("СтатьяПланирования");
			ТаблицаГП.Колонки.Добавить("ДатаКурса");
			
			ЕстьПустыеКД=Ложь;
			МассивСообщений = Новый Массив;
			Для каждого Стр Из ТаблицаГП Цикл
				
				СтрСтатьяПланирования = _ПолучитьСтатьюПланирования(Стр,Перечисления.CW_ВидыСтатейПланирования.Расходы);
				
				Стр.СтатьяПланирования 	= СтрСтатьяПланирования.Ссылка;
				ПараметрДатыКурса 		= СтрСтатьяПланирования.КонтрольнаяДатаКурсаДляПроверки;
				
				Если (ЗначениеЗаполнено(ПараметрДатыКурса)) Тогда
					РД = ПолучитьДатуКурсаПоПараметруНаСервере(Стр.Грузоперевозка,ПараметрДатыКурса);
					Если (РД = Неопределено) Тогда
						
						МассивСообщений.Добавить("У грузоперевозки """+Строка(Стр.Грузоперевозка)+""" значение параметра """ + Строка(ПараметрДатыКурса) + """ не задано. Расчет суммы произведен по курсу на " + Формат(ДатаКурса,"ДФ=dd.MM.yy") + ".");
						ЕстьПустыеКД=Истина;
						РД = ДатаКурса;
						
					КонецЕсли;
				Иначе
					РД = ДатаКурса;	
				КонецЕсли; 
				// --- 
				Стр.ДатаКурса = РД;
				
			КонецЦикла;
			
			ДатыКурсовПоСтатьям = _сф.со_Создать("СтатьяПланирования","ДатаКурса",ТаблицаГП);
						
		КонецЕсли; 
		
		ПорядокОтражения = ПД.ОсновнойПорядокОтраженияРасходов;
		Если (НЕ ЗначениеЗаполнено(ПорядокОтражения)) Тогда
			ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		КонецЕсли;
		
		ТЗУслуг = Документы.CW_РасходыПоГрузоперевозке.ПустаяСсылка().Услуги.Выгрузить();
		
		СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметров.Дата 				= ТекущаяДата();
		СтруктураПараметров.Договор 			= Договор;
		СтруктураПараметров.ПриложениеКДоговору = ПриложениеКДоговору;
		
		ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "КоличествоДнейПросрочки");
		
		// --- 
		СЗ = Новый Структура;
		
		СЗ.Вставить("Дата", ТекущаяДата());
		СЗ.Вставить("Организация", Договор.Организация);
		СЗ.Вставить("Контрагент", Контрагент);
		СЗ.Вставить("Договор", Договор);
		СЗ.Вставить("ПриложениеКДоговору", ПриложениеКДоговору);
		СЗ.Вставить("Валюта", Валюта);
		СЗ.Вставить("СпособЗачетаАвансов",Перечисления.СпособыЗачетаАвансов.Автоматически);
		СЗ.Вставить("СрокОплаты", СЗ.Дата + 24*60*60*ПараметрыДоговора.КоличествоДнейПросрочки);
		
		Для Каждого Стр Из дфкГрузоперевозки Цикл
			
			Если Стр.СуммаКВыставлению <> 0 Тогда
				
				Если (Пересчет) Тогда
					
					СтатьяПланирования = _ПолучитьСтатьюПланирования(Стр,Перечисления.CW_ВидыСтатейПланирования.Расходы);
					Если ЗначениеЗаполнено(СтатьяПланирования.Ссылка) Тогда
						ТДК = ДатыКурсовПоСтатьям.Получить(СтатьяПланирования.Ссылка);	
					Иначе
						ТДК = ДатаКурса;
					КонецЕсли; 
					// --- 
					КурсВалютыБюджета = CW_Финансы.ПолучитьКурсВалюты(Стр.Валюта,ТДК);
					КурсВалютыДоговора = CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора,ТДК);

				КонецЕсли;
				
				Нстр = ТЗУслуг.Добавить();
				Нстр.Грузоперевозка = Стр.Грузоперевозка;
				Нстр.Номенклатура   = Стр.Номенклатура;
				Нстр.СтавкаНДС      = Стр.СтавкаНДС;
				Нстр.Представление  = Нстр.Номенклатура.НаименованиеПолное + " " + Нстр.Грузоперевозка.CW_Представление;
				Нстр.СтатьяЗатрат   = _сф.со_Получить(СоответствиеСтатейЗатрат,Нстр.Номенклатура,ОсновнаяСтатьяЗатрат);
				Если (ЗначениеЗаполнено(Стр.ПорядокОтраженияРасходов)) Тогда
					Нстр.ПорядокОтражения = Стр.ПорядокОтраженияРасходов;
				Иначе
					Нстр.ПорядокОтражения = ПорядокОтражения;
				КонецЕсли; 
				Если (Нстр.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
					// пытаемся получить клиента и его договор
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("Объект"				, Стр.Грузоперевозка);
					СтруктураПараметров.Вставить("ЭтоВариантБюджета"	, Ложь);
					СтруктураПараметров.Вставить("Контрагент"			, Стр.Грузоперевозка.Клиент);
					
					Плательщик = CW_Финансы.ВернутьПлательщика(СтруктураПараметров);
					Если (ЗначениеЗаполнено(Плательщик)) Тогда
						Нстр.Покупатель = Плательщик;
						// --- 
						Нстр.ДоговорПокупателя = CW_Документы.ПолучитьПоследнийДоговор(Нстр.Покупатель, Договор.Организация, Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);	
					КонецЕсли; 
				КонецЕсли;
				Если 0=стр.КоличествоКВыставлению ИЛИ НЕ флИспользоватьКоличествоВБюджетах Тогда 
					Нстр.Количество     = 1;
				Иначе 
					Нстр.Количество     = стр.КоличествоКВыставлению;
				КонецЕсли;
				Если (НЕ Пересчет) Тогда
					Нстр.Всего     		= Стр.СуммаКВыставлению;
				Иначе
					Нстр.Всего			= CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.СуммаКВыставлению,Валюта,ВалютаДоговора,КурсВалютыБюджета.Курс,КурсВалютыДоговора.Курс,КурсВалютыБюджета.Кратность,КурсВалютыДоговора.Кратность);
				КонецЕсли;
				
				СтавкаНДСПроцент 	= CW_Финансы.ПолучитьСтавкуНДС(Нстр.СтавкаНДС)/100;
				
				Если Пересчет Тогда
					
					Если ВариантРасчетаРублевойСуммыНДС = ПредопределенноеЗначение("Перечисление.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.РасчетОтРублевойСуммыВсего") Тогда
						
						Нстр.НДС		= Нстр.Всего*СтавкаНДСПроцент/(1+СтавкаНДСПроцент);
						Нстр.Сумма		= Нстр.Всего - Нстр.НДС;
						
					ИначеЕсли ВариантРасчетаРублевойСуммыНДС = ПредопределенноеЗначение("Перечисление.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.РасчетОтРублевойСуммыБезНДС") Тогда
						
						СуммаБезНДС		= ПолучитьСуммуБезНДС(Стр,Перечисления.CW_ВидыСтатейПланирования.Расходы);
						Нстр.Сумма  	= CW_Финансы.ПересчитатьИзВалютыВВалюту(СуммаБезНДС,Валюта,ВалютаДоговора,КурсВалютыБюджета.Курс,КурсВалютыДоговора.Курс,КурсВалютыБюджета.Кратность,КурсВалютыДоговора.Кратность);	
						Нстр.НДС 		= Окр(Нстр.Сумма*СтавкаНДСПроцент, 2);
						Нстр.Всего		= Нстр.Сумма + Нстр.НДС;
						
					Иначе
						
						Нстр.НДС 		= CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.СуммаНДСПоБюджету,Валюта,ВалютаДоговора,КурсВалютыБюджета.Курс,КурсВалютыДоговора.Курс,КурсВалютыБюджета.Кратность,КурсВалютыДоговора.Кратность);	
						Нстр.Сумма		= Нстр.Всего - Нстр.НДС;
						
					КонецЕсли;
					
				Иначе
					Нстр.НДС	= Нстр.Всего*СтавкаНДСПроцент/(1+СтавкаНДСПроцент);
					Нстр.Сумма	= Нстр.Всего - Нстр.НДС;
				КонецЕсли;
				
				Нстр.Цена           = _сф.БезопасноРазделить(Нстр.Сумма, Нстр.Количество);
				
				ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
				
				ПараметрыШаблона.Номенклатура 	= Нстр.Номенклатура;
				ПараметрыШаблона.Объект 		= СЗ;
				ПараметрыШаблона.Дата 			= СЗ.Дата;
				ПараметрыШаблона.Договор 		= Договор;
				ПараметрыШаблона.ВидДоговора 	= Договор.ВидДоговора;
				ПараметрыШаблона.ПриложениеКДоговору = ПриложениеКДоговору;
				
				CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(Нстр, ПараметрыШаблона); 
				
				Если (ДобавлятьКомментарии) Тогда
					
					КомментарийСтатьи = _ПолучитьКомментарий(Стр,Перечисления.CW_ВидыСтатейПланирования.Расходы);
					Если (ЗначениеЗаполнено(КомментарийСтатьи)) Тогда
						_сф.стр_Добавить(Нстр.Представление," ("+КомментарийСтатьи+")");	
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
	// формируем структуру
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Вариант","Бюджет");
	СтруктураОтвета.Вставить("ПерезаполнитьДокумент",ПерезаполнитьДокумент);
	СтруктураОтвета.Вставить("Строки",ПоместитьВоВременноеХранилище(ТЗУслуг,УИД));
	Если (ЕстьПустыеКД) Тогда
		
		СтруктураОтвета.Вставить("КомментарийЗаполнения", _сф.м_Представление(МассивСообщений,Символы.ПС));
		
	КонецЕсли; 

	Возврат(СтруктураОтвета);
	
КонецФункции

// --- 
&НаСервере
Функция ПолучитьСуммуБезНДС(СТ,ВидСтатьиПланирования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Сумма КАК Сумма,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Грузоперевозка
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = &ВидСтатьиПланирования
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.Контрагент = &Контрагент
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура = &Номенклатура
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.Валюта = &Валюта
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС = &СтавкаНДС
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Грузоперевозка", 		СТ.Грузоперевозка);
	Запрос.УстановитьПараметр("ВерсияБюджета", 			ВерсияБюджета);
	Запрос.УстановитьПараметр("ВидСтатьиПланирования", 	ВидСтатьиПланирования);
	Запрос.УстановитьПараметр("Контрагент", 			Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", 			СТ.Номенклатура);
	Запрос.УстановитьПараметр("Валюта", 				СТ.Валюта);
	Запрос.УстановитьПараметр("СтавкаНДС", 				СТ.СтавкаНДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	КонецЕсли; 
	
	Возврат 0;
	
КонецФункции


&НаСервере
Функция _ПолучитьКомментарий(СТ,ВидСтатьиПланирования)
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Комментарий
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Грузоперевозка
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = &ВидСтатьиПланирования
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.Контрагент = &Контрагент
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура = &Номенклатура
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.Валюта = &Валюта
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС = &СтавкаНДС
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Грузоперевозка", СТ.Грузоперевозка);
	Запрос.УстановитьПараметр("ВерсияБюджета", ВерсияБюджета);
	Запрос.УстановитьПараметр("ВидСтатьиПланирования", ВидСтатьиПланирования);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", СТ.Номенклатура);
	Запрос.УстановитьПараметр("Валюта", СТ.Валюта);
	Запрос.УстановитьПараметр("СтавкаНДС", СТ.СтавкаНДС);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если (ТЗ.Количество()=1) Тогда
		Возврат(СокрЛП(_сф.к_ПервыйЭлемент(ТЗ).Комментарий));
	Иначе
		Возврат("");
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция _ПолучитьСтатьюПланирования(СтрокаПараметров,ВидСтатьиПланирования)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Ссылка"							, Справочники.CW_ПлановыеСтатьиЗатратИДоходов.ПустаяСсылка());
	СтруктураВозврата.Вставить("КонтрольнаяДатаКурсаДляПроверки", Дата(1,1,1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.КонтрольнаяДатаКурсаДляПроверки КАК КонтрольнаяДатаКурсаДляПроверки
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Грузоперевозка
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = &ВидСтатьиПланирования
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.Контрагент = &Контрагент
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура = &Номенклатура
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.Валюта = &Валюта
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС = &СтавкаНДС
	               |	И НЕ CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Грузоперевозка"			, СтрокаПараметров.Грузоперевозка);
	Запрос.УстановитьПараметр("Номенклатура"			, СтрокаПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Валюта"					, СтрокаПараметров.Валюта);
	Запрос.УстановитьПараметр("СтавкаНДС"				, СтрокаПараметров.СтавкаНДС);
	Запрос.УстановитьПараметр("ВерсияБюджета"			, ВерсияБюджета);
	Запрос.УстановитьПараметр("ВидСтатьиПланирования"	, ВидСтатьиПланирования);
	Запрос.УстановитьПараметр("Контрагент"				, Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции


// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГрузоперевозкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ГрузоперевозкиСальдо" Тогда
		
		СтандартнаяОбработка=Ложь;
		Строка = дфкГрузоперевозки.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если Строка.Сальдо <> 0 Тогда
			
			Строка.СуммаКВыставлению = (Строка.СуммаПоБюджету - Строка.СуммаФакт) * ПроцентВыставления/100 ;//Строка.Сальдо;
			Если Строка.СуммаПоБюджету<>0 Тогда 
				Строка.КоличествоКВыставлению = строка.КоличествоПоБюджету * Строка.СуммаКВыставлению/Строка.СуммаПоБюджету;
			КонецЕсли;
			Строка.Сальдо = Строка.СуммаПоБюджету - Строка.СуммаФакт - Строка.СуммаКВыставлению;
			ГрузоперевозкиСуммаКВыставлениюПриИзменении(Поле);
			
		КонецЕсли; 
		
		ПолучитьКоличествоВыставленныхСтрокГрузоперевозки();	
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура СтатьиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	Если Поле.Имя = "СтатьиСальдо" или Поле.Имя = "СтатьиСальдоКоличество"  Тогда
		
		УстановитьПометкиГрузоперевозок(ВыбраннаяСтрока, Истина);
		
	ИначеЕсли Поле.Имя = "СтатьиСуммаКВыставлению" или Поле.Имя = "СтатьиКоличествоКВыставлению" Тогда 
		
		// если форма вызвана из карточки г/п даём редактировать сумму
		Если Элементы.ГруппаГрузоперевозки.Видимость = Ложь Тогда
			
			СтандартнаяОбработка = Истина;
			
		КонецЕсли; 
				
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ОткрытьФорму("Справочник.CW_ДоговорыПоГрузоперевозкам.ФормаВыбора",_ПолучитьПараметрыВыбораДоговора(),Элемент);
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьПараметрыВыбораДоговора()
	// --- 
	
	Отбор = _сф.ст_Создать("Владелец:Контрагент,Организация,ВидДоговора",ЭтаФорма);
	ПараметрыФормы = Новый Структура("Отбор,РежимВыбора",Отбор,Истина);
	Возврат(ПараметрыФормы);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ВерсияБюджетаПриИзменении(Элемент)
	_ПолучитьТаблицыБюджетаПланФакт_ДляВыбораКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура ФормированиеФактаПриИзменении(Элемент)
	_ПолучитьТаблицыБюджетаПланФакт_ДляВыбораКонтрагента();	
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокументаПриИзменении(Элемент)
	
	Если (ДатаДокумента = Дата(1,1,1)) Тогда
		
		ДатаДокумента = ТекущаяДата();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Договор = Неопределено;
	_ЗаполнитьТаблицыСтатейИГрузоперевозок(); 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ВыводитьДругиеВалютыПриИзмененииНаСервере()
	
	Если (НЕ ВыводитьДругиеВалюты) Тогда
		
		Для каждого Стр Из дфкВыборКлиента Цикл
			Стр.СуммаФактДругиеВалюты = 0;
			Стр.Сальдо = Стр.СуммаПоБюджету - Стр.СуммаФакт;
		КонецЦикла;
		// --- 
		Элементы.ВыборКлиентаСуммаФактДругиеВалюты.Видимость = Ложь;
		
	Иначе
		
		// получаем данные
		Если (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	CW_ДоходыПоГрузоперевозкамОбороты.Контрагент КАК Клиент,
			               |	CW_ДоходыПоГрузоперевозкамОбороты.Валюта,
			               |	СУММА(CW_ДоходыПоГрузоперевозкамОбороты.Всего_ВалютаОборот) КАК СуммаФакт,
			               |	CW_ДоходыПоГрузоперевозкамОбороты.ДокументДоходов КАК Документ,
			               |	CW_ДоходыПоГрузоперевозкамОбороты.Период
			               |ИЗ
			               |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам.Обороты(
			               |			,
			               |			,
			               |			Регистратор,
			               |			Грузоперевозка В (&Грузоперевозки)
			               |				И ВЫБОР
			               |					КОГДА &ПоСчетам 
			               |						ТОГДА ЭтоСчет
			               |					ИНАЧЕ ЭтоАкт
			               |				КОНЕЦ
			               |				И Контрагент = &Контрагент
			               |				И Валюта <> &ВалютаСтроки) КАК CW_ДоходыПоГрузоперевозкамОбороты
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	CW_ДоходыПоГрузоперевозкамОбороты.Контрагент,
			               |	CW_ДоходыПоГрузоперевозкамОбороты.Валюта,
			               |	CW_ДоходыПоГрузоперевозкамОбороты.ДокументДоходов,
			               |	CW_ДоходыПоГрузоперевозкамОбороты.Период";
						   
		ИначеЕсли (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком) Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	CW_РасходыПоГрузоперевозкамОбороты.Контрагент КАК Клиент,
			               |	CW_РасходыПоГрузоперевозкамОбороты.Валюта,
			               |	СУММА(CW_РасходыПоГрузоперевозкамОбороты.Всего_ВалютаОборот) КАК СуммаФакт,
			               |	CW_РасходыПоГрузоперевозкамОбороты.ДокументРасходов КАК Документ,
			               |	CW_РасходыПоГрузоперевозкамОбороты.Период
			               |ИЗ
			               |	РегистрНакопления.CW_РасходыПоГрузоперевозкам.Обороты(
			               |			,
			               |			,
			               |			Регистратор,
			               |			Грузоперевозка В (&Грузоперевозки)
			               |				И Валюта <> &ВалютаСтроки
			               |				И ВЫБОР
			               |					КОГДА &ПоСчетам 
			               |						ТОГДА ЭтоСчет
			               |					ИНАЧЕ ЭтоАкт
			               |				КОНЕЦ) КАК CW_РасходыПоГрузоперевозкамОбороты
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	CW_РасходыПоГрузоперевозкамОбороты.Контрагент,
			               |	CW_РасходыПоГрузоперевозкамОбороты.Валюта,
			               |	CW_РасходыПоГрузоперевозкамОбороты.ДокументРасходов,
			               |	CW_РасходыПоГрузоперевозкамОбороты.Период"; 				
						   
			
		КонецЕсли;
		
		// --- 
		СписокГП = Новый Массив;
		Если (ТипЗнч(ОбъектСсылка)=Тип("СправочникСсылка.CW_Грузоперевозки")) Тогда
			СписокГП.Добавить(ОбъектСсылка);
		Иначе
			СписокГП = CW_Мониторинг.ГрузоперевозкиЗаказа(ОбъектСсылка); 
		КонецЕсли; 
		Запрос.УстановитьПараметр("Грузоперевозки", СписокГП); 			   
		
		Для каждого Стр Из дфкВыборКлиента Цикл
			
			Запрос.УстановитьПараметр("ПоСчетам", ?(ФормированиеФакта=0,Ложь,Истина));
			// --- 
			Запрос.УстановитьПараметр("Контрагент", Стр.Клиент);
			Запрос.УстановитьПараметр("ВалютаСтроки", Стр.Валюта);	
			// --- 
			СуммаФакт = 0;
			// --- 
			ТЗ = Запрос.Выполнить().Выгрузить();
			Для каждого СтрокаДокумента Из ТЗ Цикл
				
				СтруктураКурсаДокумента = CW_Финансы.ПолучитьКурсВалюты(СтрокаДокумента.Валюта,СтрокаДокумента.Период);
				СтруктураКурсаСтроки = CW_Финансы.ПолучитьКурсВалюты(Стр.Валюта,СтрокаДокумента.Период);
				// --- 
				СуммаПересчитанная = CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаДокумента.СуммаФакт,СтрокаДокумента.Валюта,Стр.Валюта,СтруктураКурсаДокумента.Курс,СтруктураКурсаСтроки.Курс,СтруктураКурсаДокумента.Кратность,СтруктураКурсаСтроки.Кратность); 
				_сф.Инкремент(СуммаФакт,СуммаПересчитанная);
				
			КонецЦикла; 
			// --- 
			Стр.СуммаФактДругиеВалюты = СуммаФакт;
			Стр.Сальдо = Стр.СуммаПоБюджету - Стр.СуммаФакт - Стр.СуммаФактДругиеВалюты;
			
		КонецЦикла; 
		
		// --- 
		Элементы.ВыборКлиентаСуммаФактДругиеВалюты.Видимость = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьДругиеВалютыПриИзменении(Элемент)
	ВыводитьДругиеВалютыПриИзмененииНаСервере();
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ДополнитьФактомПоДругимВалютам()
	// --- 
	
	// получаем данные
	Если (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ДоходыПоГрузоперевозкамОбороты.Контрагент КАК Клиент,
		|	CW_ДоходыПоГрузоперевозкамОбороты.Валюта,
		|	СУММА(CW_ДоходыПоГрузоперевозкамОбороты.Всего_ВалютаОборот) КАК СуммаФакт,
		|	CW_ДоходыПоГрузоперевозкамОбороты.ДокументДоходов КАК Документ,
		|	CW_ДоходыПоГрузоперевозкамОбороты.Период
		|ИЗ
		|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ВЫБОР
		|					КОГДА &ПоСчетам 
		|						ТОГДА ЭтоСчет
		|					ИНАЧЕ ЭтоАкт
		|				КОНЕЦ
		|				И Контрагент = &Контрагент
		|				И Валюта <> &ВалютаСтроки
		|				И Номенклатура = &Номенклатура
		|				И Грузоперевозка = &Грузоперевозка
		|				И СтавкаНДС = &СтавкаНДС) КАК CW_ДоходыПоГрузоперевозкамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_ДоходыПоГрузоперевозкамОбороты.Контрагент,
		|	CW_ДоходыПоГрузоперевозкамОбороты.Валюта,
		|	CW_ДоходыПоГрузоперевозкамОбороты.ДокументДоходов,
		|	CW_ДоходыПоГрузоперевозкамОбороты.Период";
		
	ИначеЕсли (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_РасходыПоГрузоперевозкамОбороты.Контрагент КАК Клиент,
		|	CW_РасходыПоГрузоперевозкамОбороты.Валюта,
		|	СУММА(CW_РасходыПоГрузоперевозкамОбороты.Всего_ВалютаОборот) КАК СуммаФакт,
		|	CW_РасходыПоГрузоперевозкамОбороты.ДокументРасходов КАК Документ,
		|	CW_РасходыПоГрузоперевозкамОбороты.Период
		|ИЗ
		|	РегистрНакопления.CW_РасходыПоГрузоперевозкам.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ВЫБОР
		|					КОГДА &ПоСчетам 
		|						ТОГДА ЭтоСчет
		|					ИНАЧЕ ЭтоАкт
		|				КОНЕЦ
		|				И Контрагент = &Контрагент
		|				И Валюта <> &ВалютаСтроки
		|				И Номенклатура = &Номенклатура
		|				И Грузоперевозка = &Грузоперевозка
		|				И СтавкаНДС = &СтавкаНДС) КАК CW_РасходыПоГрузоперевозкамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_РасходыПоГрузоперевозкамОбороты.Контрагент,
		|	CW_РасходыПоГрузоперевозкамОбороты.Валюта,
		|	CW_РасходыПоГрузоперевозкамОбороты.ДокументРасходов,
		|	CW_РасходыПоГрузоперевозкамОбороты.Период"; 				
		
		
	КонецЕсли;
					   
	Для каждого Стр Из дфкГрузоперевозки Цикл
		
		Запрос.УстановитьПараметр("ПоСчетам", ?(ФормированиеФакта=0,Ложь,Истина));
		// --- 
		Запрос.УстановитьПараметр("Контрагент", Договор.Владелец);
		Запрос.УстановитьПараметр("ВалютаСтроки", Стр.Валюта);
		Запрос.УстановитьПараметр("Грузоперевозка", Стр.Грузоперевозка);
		Запрос.УстановитьПараметр("Номенклатура", Стр.Номенклатура);
		Запрос.УстановитьПараметр("СтавкаНДС", Стр.СтавкаНДС); 
		// --- 
		ТЗ = Запрос.Выполнить().Выгрузить();
		СуммаФакт = 0;
		Для каждого СтрокаДокумента Из ТЗ Цикл
			
			СтруктураКурсаДокумента = CW_Финансы.ПолучитьКурсВалюты(СтрокаДокумента.Валюта,СтрокаДокумента.Период);
			СтруктураКурсаСтроки = CW_Финансы.ПолучитьКурсВалюты(Стр.Валюта,СтрокаДокумента.Период);
			// --- 
			СуммаПересчитанная = CW_Финансы.ПересчитатьИзВалютыВВалюту(СтрокаДокумента.СуммаФакт,СтрокаДокумента.Валюта,Стр.Валюта,СтруктураКурсаДокумента.Курс,СтруктураКурсаСтроки.Курс,СтруктураКурсаДокумента.Кратность,СтруктураКурсаСтроки.Кратность); 
			_сф.Инкремент(СуммаФакт,СуммаПересчитанная);
			
		КонецЦикла;
		_сф.Инкремент(Стр.СуммаФакт,СуммаФакт);
		Стр.Сальдо = Стр.СуммаПоБюджету - Стр.СуммаФакт - Стр.СуммаКВыставлению;
		
	КонецЦикла; 
	
	ТаблицаДляСвертки = дфкГрузоперевозки.Выгрузить();
	ТаблицаДляСвертки.Свернуть("Номенклатура,СтавкаНДС,Валюта","СуммаФакт");
	// --- 
	Для каждого Стр Из ТаблицаДляСвертки Цикл
		
		Отбор = Новый Структура("Номенклатура,СтавкаНДС,Валюта",Стр.Номенклатура,Стр.СтавкаНДС,Стр.Валюта);
		СтрокаСтатьи = _сф.к_НайтиСтроку(дфкСтатьи,Отбор);
		Если (СтрокаСтатьи <> Неопределено) Тогда
			_сф.Инкремент(СтрокаСтатьи.СуммаФакт,Стр.СуммаФакт);
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	Для каждого Стр Из дфкСтатьи Цикл
		
		Стр.Сальдо = Стр.СуммаПоБюджету - Стр.СуммаФакт - Стр.СуммаКВыставлению;
		
	КонецЦикла;      
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура СтатьиВыставитьВсе(Команда)
	
	Для каждого СтрокаСтатьи из дфкСтатьи Цикл
		УстановитьПометкиГрузоперевозок(СтрокаСтатьи.ПолучитьИдентификатор(), истина);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СтатьиОчиститьВсе(Команда)
	
	Для каждого СтрокаСтатьи из дфкСтатьи Цикл
		УстановитьПометкиГрузоперевозок(СтрокаСтатьи.ПолучитьИдентификатор(), Ложь);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьКоментарийДоговораНаФрме" Тогда
		УстановитьЗаголовокНадписиКомментарияДоговора();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПолучитьКоличествоВыставленныхСтрокГрузоперевозки()
	
	ТекущаяСтрока = Элементы.Статьи.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПолучитьКоличествоВыставленныхСтрокГрузоперевозкиНаСервере(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКоличествоВыставленныхСтрокГрузоперевозкиНаСервере(ИдентификаторСтроки)
	
	СтрокаТекущая = дфкСтатьи.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если СтрокаТекущая = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("Номенклатура, СтавкаНДС, Валюта", СтрокаТекущая.Номенклатура, СтрокаТекущая.СтавкаНДС, СтрокаТекущая.Валюта);
	мСтрокиВсего = дфкГрузоперевозки.НайтиСтроки(ОтборСтрок);
	
	ОтборСтрок.Вставить("СуммаКВыставлению", 0);
	мСтрокиВыставлено = дфкГрузоперевозки.НайтиСтроки(ОтборСтрок);
	
	ГрузоперевозкиВсегоСтрок  = мСтрокиВсего.Количество();
	ГрузоперевозкиВыставлено = ГрузоперевозкиВсегоСтрок - мСтрокиВыставлено.Количество(); 
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКоличествоВыставленныхСтрокСтатьи()
	
	мСтроки = дфкСтатьи.НайтиСтроки(Новый Структура("СуммаКВыставлению",0));
	СтатьиВыставлено = дфкСтатьи.Количество() - мСтроки.Количество(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьГрузоперевозку(Команда)
	
	ТекущиеДанные = Элементы.Грузоперевозки.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		СтруктураПараметров = Новый Структура("Ключ", ТекущиеДанные.Грузоперевозка);
		ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаОбъекта", СтруктураПараметров,ЭтаФорма, Истина,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантКурсаПриИзменении(Элемент)
	ВариантКурсаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВариантКурсаПриИзмененииНаСервере()
	
	Элементы.ДатаКурса.Видимость 				= (ВариантКурса = 0);
	Элементы.ГрузоперевозкиБюджетКурс.Видимость = (ВариантКурса = 1);
	
	УстановитьВидимостьПересчетаСуммы();
	
КонецПроцедуры


