
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сервис доставки".
// ОбщийМодуль.СервисДоставкиКлиентПереопределяемый.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик события АвтоПодбор поля формы контактной информации для подбора вариантов адреса по введенной строке.
//
// Параметры:
//     Элемент                  - ПолеФормы      - элемент формы, содержащий представление контактной информации.
//     Текст                    - Строка         - строка текста, введенная пользователем в поле контактной информации.
//     ДанныеВыбора             - СписокЗначений Из Строка - содержит список значений, который будет использован при стандартной
//                                                 обработке события.
//     ПараметрыПолученияДанных - Структура
//                              - Неопределено - содержит параметры поиска, которые будут переданы
//                                в метод ПолучитьДанныеВыбора. Подробнее см. описание расширения поля формы для
//                                поля ввода АвтоПодбор в синтакс-помощнике.
//     Ожидание -   Число       - интервал в секундах после ввода текста, через который произошло событие.
//                                Если 0, то это означает, что событие было вызвано не по поводу ввода текста,
//                                а для формирования списка быстрого выбора. 
//     СтандартнаяОбработка     - Булево         - в данный параметр передается признак выполнения стандартной
//                                системной) обработки события. Если в теле процедуры-обработчика
//                                установить данному параметру значение Ложь, стандартная обработка события
//                                производиться не будет.
//
Процедура АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Устанавливает имя формы выбора объекта, если она отличается от формы выбора по умолчанию.
//
// Параметры:
//  ИмяОбъекта - Строка - имя объекта метаданных.
//  ИмяФормыВыбора - Строка - полное имя формы выбора объекта. Например, "Документ.ЗаказПокупателя.ФормаВыбора".
//
Процедура УстановитьИмяФормыВыбораОбъектаПоИмени(ИмяОбъекта, ИмяФормыВыбора) Экспорт
	
КонецПроцедуры

// Открытие формы нового заказа на доставку, создаваемого на основании переданного объекта
// в параметре "МассивСсылок". Вызывается из подсистемы "ПодключаемыеКоманды".
//
// Параметры:
//  ДокументыОснования - Массив из ЛюбаяСсылка - объект или список объектов.
//  ПараметрыВыполнения - см. ПодключаемыеКомандыКлиентСервер.ПараметрыВыполненияКоманды
//
Процедура ЗаказНаДоставкуСоздатьНаОсновании(ДокументыОснования, ПараметрыВыполнения) Экспорт
	
КонецПроцедуры

// Открытие формы нового заказа на доставку, создаваемого на основании документа.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма документа.
//
Процедура ОткрытьФормуНовогоЗаказаНаДоставку(Форма) Экспорт
	
КонецПроцедуры

// Обработка выбора заказа на доставку из списка выбора заказов.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма документа.
//  ВыбранныйЗаказ - ДанныеФормыЭлементКоллекции, Неопределено - Строка списка заказов.
//  ИмяПроцедурыОбработки - Строка - Имя процедуры обработки выбора заказа в списке заказов.
//
Процедура ОбработатьРезультатВыбораЗаказаНаДоставку(Форма, ВыбранныйЗаказ, ИмяПроцедурыОбработки) Экспорт
	
КонецПроцедуры

// Открытие списка платежных документов
// 
// Параметры:
//  ПараметрыСписка - Структура - Параметры списка. Содержит свойства:
//  *Организация - ОпределяемыйТип.ОрганизацияСервисДоставки - организация-заказчик перевозки,
//    сервиса доставки.
//
Процедура ПерейтиКСпискуПлатежныхДокументов(ПараметрыСписка) Экспорт
	
КонецПроцедуры

// Открывает форму настроек, если требуется
//
Процедура ОткрытьФормуНастройкиСозданиеПлатежныхДокументов() Экспорт
	
КонецПроцедуры

// Проверяет является ли добавленный документ - документом реализации
// 
// Параметры:
//  ДобавленныйДокумент - ОпределяемыйТип.ОснованиеЗаказаСервисДоставки
// 
// Возвращаемое значение: 
//  Булево - результат проверки
Функция ЭтоДокументРеализации(ДобавленныйДокумент) Экспорт
	
КонецФункции

#Область НаложенныеПлатежи

// Заполняет перечень типов документов-оснований, для которых можно оформить оплату доставки наложенным платежом.
//  
// Параметры:
//	КоллекцияТиповДокументов - Массив из ОписаниеТипов
Процедура ТипыОснованийДляНаложенногоПлатежа(КоллекцияТиповДокументов) Экспорт
	
КонецПроцедуры

#КонецОбласти

// Возвращает процент НДС по строковому представлению ставки НДС .
// 
// Параметры:
//  СтавкаНДС - строка - строковое представление ставки НДС
// 
// Возвращаемое значение:
//  Число - процент ставки НДС
Функция ЗначениеСтавкиНДС(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = "10" Или СтавкаНДС = "10/110" Тогда
		Возврат 10;
	ИначеЕсли СтавкаНДС = "18" Или СтавкаНДС = "18/118" Тогда
		Возврат 18;
	ИначеЕсли СтавкаНДС = "20" Или СтавкаНДС = "20/120" Тогда
		Возврат 20;
	ИначеЕсли СтавкаНДС = "22" Или СтавкаНДС = "22/122" Тогда
		Возврат 22;
	ИначеЕсли СтавкаНДС = "5" Или СтавкаНДС = "5/105" Тогда
		Возврат 5;
	ИначеЕсли СтавкаНДС = "7" Или СтавкаНДС = "7/107" Тогда
		Возврат 7;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
