&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Подсистема.СогласованиеОбъктов
	CW_СогласованиеСервер.ПриСозданииНаСервереФормыСписка(ЭтаФорма, "СправочникСсылка.CW_ДоговорыПоГрузоперевозкам", Отказ, СтандартнаяОбработка);
	//Подсистема.СогласованиеОбъктов
	
	Если НЕ CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Доходы")
		И НЕ CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Расходы") Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ВидДоговора") Тогда
		СоответствиеЗначенийОтбора = ПолучитьЗначенияОтбораНаСервере();
		ОтборПоВидуДоговора = Параметры.Отбор.ВидДоговора;
		Если ТипЗнч(ОтборПоВидуДоговора) = Тип("Массив") ИЛИ ТипЗнч(ОтборПоВидуДоговора) = Тип("ФиксированныйМассив") Тогда
			Для Каждого ЭлементМассива из ОтборПоВидуДоговора Цикл
				ЗначениеОтбора = СоответствиеЗначенийОтбора.Получить(ЭлементМассива);
				Элементы.ОтборВидДоговора.СписокВыбора.Добавить(ЗначениеОтбора, ЭлементМассива);
			КонецЦикла;
		Иначе
			ЗначениеОтбора = СоответствиеЗначенийОтбора.Получить(ОтборПоВидуДоговора);
			Элементы.ОтборВидДоговора.СписокВыбора.Добавить(ЗначениеОтбора, ОтборПоВидуДоговора);
			
			ОтборВидДоговора = ЗначениеОтбора;
		КонецЕсли;
		
		Если Элементы.ОтборВидДоговора.СписокВыбора.Количество() > 1 Тогда
			Элементы.ОтборВидДоговора.СписокВыбора.Вставить(0, 0, "Все");
		КонецЕсли;

	Иначе
		Элементы.ОтборВидДоговора.СписокВыбора.Добавить(0, "Все");
		Элементы.ОтборВидДоговора.СписокВыбора.Добавить(1, "С поставщиком");
		Элементы.ОтборВидДоговора.СписокВыбора.Добавить(2, "С покупателем");
		Элементы.ОтборВидДоговора.СписокВыбора.Добавить(3, "Прочее");
	КонецЕсли;
	
	ЗаголовокОтбора = Неопределено;
	Параметры.Свойство("ЗаголовокОтбора",ЗаголовокОтбора);
	Если (ЗаголовокОтбора <> Неопределено) Тогда
		АвтоЗаголовок=Ложь;
		Заголовок = "Договоры по грузоперевозкам ("+ЗаголовокОтбора+")";
	КонецЕсли; 
	
	_УФС.ПриСозданииФормыСписка(ЭтотОбъект);
	
	УстановитьОтборДинамическогоСписка();

	Элементы.ИспользуютсяПриложения.Видимость = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");
	
	//только действующие
	ОтборДействующие = 2;
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ФормаСпискаПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	//Подсистема.СтатусыДокументов

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначенияОтбораНаСервере()
	
	Результат = Новый Соответствие;
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"),	1);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"),	2);
	Результат.Вставить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее"),		3);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборДинамическогоСписка()
	
	ИмяПоляОтбораВидДоговора 		= новый ПолеКомпоновкиДанных("ВидДоговора");
	ИспользоватьОтборВидДоговора	= ОтборВидДоговора <> 0;
	ОтборВидДоговораНайден 			= Ложь;
	
	Если ОтборВидДоговора = 1 Тогда
		ВидДоговораПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком");
	ИначеЕсли ОтборВидДоговора = 2 Тогда
		ВидДоговораПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");
	ИначеЕсли ОтборВидДоговора = 3 Тогда
		ВидДоговораПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее");
	Иначе
		ВидДоговораПравоеЗначение = Неопределено;
	КонецЕсли;
	
	ИмяПоляОтборДействующие  		= новый ПолеКомпоновкиДанных("Закрыт");
	ДействующиеПравоеЗначение 		= ?(ОтборДействующие=1, Истина, Ложь);
	ОтборДействующиеНайден 			= Ложь;
	ИспользоватьОтборДействующие	= ОтборДействующие <> 0;
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ИмяПоляОтбораВидДоговора Тогда
			
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение 	= ВидДоговораПравоеЗначение;
			ЭлементОтбора.Использование 	= ИспользоватьОтборВидДоговора;
			
			ОтборВидДоговораНайден = Истина;
		КонецЕсли;
		Если ЭлементОтбора.ЛевоеЗначение = ИмяПоляОтборДействующие Тогда
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение 	= ДействующиеПравоеЗначение;
			ЭлементОтбора.Использование 	= ИспользоватьОтборДействующие;
			
			ОтборДействующиеНайден 			= Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОтборВидДоговораНайден И ИспользоватьОтборВидДоговора Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= ИмяПоляОтбораВидДоговора;
		ЭлементОтбора.ПравоеЗначение 	= ВидДоговораПравоеЗначение;
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= ИспользоватьОтборВидДоговора;
		
	КонецЕсли;
	
	Если Не ОтборДействующиеНайден И ИспользоватьОтборДействующие Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= ИмяПоляОтборДействующие;
		ЭлементОтбора.ПравоеЗначение 	= ДействующиеПравоеЗначение;
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование 	= ИспользоватьОтборДействующие;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидДоговораПриИзменении(Элемент)
	УстановитьОтборДинамическогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура ОтборДействующиеПриИзменении(Элемент)
	УстановитьОтборДинамическогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Файлы" Тогда
		СтандартнаяОбработка = Ложь;
		_УФК.ОткрытьСписокФайловОбъекта(ЭтаФорма, ВыбраннаяСтрока);
	КонецЕсли;

КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти

 