
Функция ПроверитьКонтрагентаПоБазеЛККНаСервереВФоне(ПараметрыПроцедуры) Экспорт  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    		= 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне     			= Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне   			= ложь;   

	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ЭлектронныйОбменДанными.ПроверитьКонтрагентаПоБазеЛКК",ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции  

Функция ИзменитьРазрешенныеОрагнизацииНаСервере(РазрешенныеОрганизации) Экспорт
	
	Возврат CW_ЭлектронныйОбменДанными.ИзменитьРазрешенныеОрагнизацииНаСервере(РазрешенныеОрганизации);
	
КонецФункции  

Процедура ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки) Экспорт

	ЗаписьЖурналаРегистрации("ЭлектронныйОбменДанными", УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
	
КонецПроцедуры
