// @strict-types

#Область ПрограммныйИнтерфейс

// Возвращает структуру описывающую вариант подписки на сообщения
// 
// Параметры:
//  Ключ - Строка - Ключ маршрутизации (RoutingKey)
//  ТипПриемника - Строка - См. ТипыПриемниковОбработкиСообщений()
//  ТипПодтвержденияПолучения - Строка - Тип подтверждения получения сообщения
// 										 auto (все полученные сообщения сразу считаются подтвержденными)
// 										 client (необходимо подтвердить все последние полученные сообщения)
// 										 client-individual (необходимо подтвердить получение каждого сообщения)
// Возвращаемое значение:
//  Структура - Подписка:
// * Идентификатор - Строка - 
// * Ключ - Строка - 
// * ТипПриемника - Строка
// * ТипПодтвержденияПолучения - Строка 
Функция Подписка(Ключ, ТипПриемника = "topic", ТипПодтвержденияПолучения = "client-individual") Экспорт
	
	Результат = Новый Структура( );
	Результат.Вставить("Идентификатор", Строка(Новый УникальныйИдентификатор()));
	Результат.Вставить("Ключ", Ключ);
	Результат.Вставить("ТипПриемника", ТипПриемника);
	Результат.Вставить("ТипПодтвержденияПолучения", ТипПодтвержденияПолучения);
	
	Возврат Результат;
КонецФункции

// Возваращает перечень типы приемников обработки сообщений на основе которых происходит их маршрутизация по получателям
// 
// Возвращаемое значение:
//  Структура:
// * ПоКлючу      - Строка - 
// * ДляВсем      - Строка - 
// * ПоЗаголовкам - Строка - 
// * ПоШаблону    - Строка - 
Функция ТипыПриемниковОбработкиСообщений() Экспорт

	Результат = Новый Структура();

	Результат.Вставить("ПоКлючу",      "direct");  // Маршрутизация происходит по точному совпадению ключа маршрутизации 
	                                               // сообщения с ключом привязки. 
	                                               // Если ключ не совпадает ни с одной привязкой, 
	                                               // сообщение отбрасывается 
	                                               // (или перенаправляется в обменник мёртвых писем, если он настроен)

	Результат.Вставить("ДляВсем",      "fanout");  // Широковещательная рассылка копии каждого сообщения во все 
	                                               // привязанные к нему очереди, полностью игнорируя ключ маршрутизации.

	Результат.Вставить("ПоЗаголовкам", "headers"); // Маршрутизация осуществляется на основе заголовков сообщения 
	                                               // (пар ключ-значение), а не ключа маршрутизации. 
	                                               // При привязке очереди задаётся набор пар ключ-значение 
	                                               // и режим совпадения (x-match):
	                                               //   all — должны совпасть все указанные заголовки.
	                                               //   any — должен совпасть хотя бы один из указанных заголовков

	Результат.Вставить("ПоШаблону",    "topic");   // Маршрутизация основана на сопоставлении шаблонов 
	                                               // с подстановочными знаками. 
	                                               // Ключи маршрутизации и ключи привязки представляют собой 
	                                               // последовательности слов, разделённых точками. 
	                                               // Специальные символы:
	                                               // * (звездочка) — соответствует ровно одному слову.
	                                               // # (решётка) — соответствует нулю или более словам. 

	Возврат Результат;
	
КонецФункции


// Возвращает перечень команд с сервера
// 
// Возвращаемое значение:
//  Структура:
// * ПодключениеВыполнено  - Строка - 
// * ВходящееСообщение     - Строка - 
// * ПодтверждениеОтправки - Строка - 
// * Ошибка                - Строка - 
Функция КомандыСервера() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ПодключениеВыполнено",  "CONNECTED");
	Результат.Вставить("ВходящееСообщение",     "MESSAGE");
	Результат.Вставить("ПодтверждениеОтправки", "RECEIPT");
	Результат.Вставить("Ошибка", "ERROR");
	
	Возврат Результат;
	
КонецФункции

// Возвращает перечень команд для отправки на сервер
// 
// Возвращаемое значение:
//  Структура - Команды клиента:
// * ОтправитьСообщение             - Строка - 
// * ОформитьПодпискуНаСообщения    - Строка - 
// * ОтменитьПодпискуНаСообщения    - Строка - 
// * НачатьТранзакцию               - Строка - 
// * ЗафиксироватьТранзакцию        - Строка - 
// * ОтменитьТранзакцию             - Строка - 
// * ПодтвердитьПолучениеСообщения  - Строка - 
// * ОтказатьсяОтПолученияСообщения - Строка - 
// * Отключиться                    - Строка - 
// * Подключиться                   - Строка - 
Функция КомандыКлиента() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ОтправитьСообщение",             "SEND");
	Результат.Вставить("ОформитьПодпискуНаСообщения",    "SUBSCRIBE");
	Результат.Вставить("ОтменитьПодпискуНаСообщения",    "UNSUBSCRIBE");
	Результат.Вставить("НачатьТранзакцию",               "BEGIN");
	Результат.Вставить("ЗафиксироватьТранзакцию",        "COMMIT");
    Результат.Вставить("ОтменитьТранзакцию",             "ABORT");
    Результат.Вставить("ПодтвердитьПолучениеСообщения",  "ACK");
    Результат.Вставить("ОтказатьсяОтПолученияСообщения", "NACK");
    Результат.Вставить("Отключиться",                    "DISCONNECT");
    Результат.Вставить("Подключиться",                   "CONNECT");

	Возврат Результат;

КонецФункции

// Выполняет запуск подключения к шине
// 
// Параметры:
//  Параметры - см. НовыеПараметрыПодключения
//  
Процедура Подключиться(Параметры) Экспорт
	
	Если Не ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Возврат; // На клиент-серверных базах есть проблема с закрытием сокета при сохранении конфигурации
	КонецЕсли;

	// Обход ошибки при проверке модуля на платформе ниже 8.3.27
	УстановитьБезопасныйРежим(Истина);
	
	// АПК:488-выкл Поддержка новых методов платформы (исполняемый код безопасен)
	// Не нарушает безопасность информации, так как вычисляется фиксированная строка, 
	// содержащая только вызов метода платформы.
	Соединение = Вычислить("WebSocketКлиентСоединения.ПолучитьСоединение(Параметры.Ключ)"); // WebSocketКлиентСоединение
	// АПК:488-вкл
	
	УстановитьБезопасныйРежим(Ложь);

	Если Соединение <> Неопределено Тогда
		Отключиться(Соединение);
	КонецЕсли;

	ПараметрыСоединения = ОбщегоНазначения.ВычислитьВБезопасномРежиме("Новый ПараметрыWebSocketКлиентСоединения()"); // ПараметрыWebSocketКлиентСоединения
	ПараметрыСоединения.Пароль = Параметры.Пароль;
	ПараметрыСоединения.Пользователь = Параметры.Пользователь;
	ПараметрыСоединения.Таймаут = Параметры.Таймаут;
	ПараметрыСоединения.ДополнительныеПараметры = ОбщегоНазначения.СкопироватьРекурсивно(Параметры);
	
	ОбработчикиСокета = ОбщегоНазначения.ВычислитьВБезопасномРежиме("Новый ОбработчикиWebSocketКлиентСоединения()"); // ОбработчикиWebSocketКлиентСоединения
	ОбработчикиСокета.Модуль = Отчетность24БРОШинаСлужебный;
	ОбработчикиСокета.ОбработчикОткрытияСоединения = "ПриОткрытииСоединения";
	ОбработчикиСокета.ОбработчикПолученияСообщения = "ПриПолученииСообщенияСлужебный";
	ОбработчикиСокета.ОбработчикОшибки             = "ПриОшибкеСоединения";
	ОбработчикиСокета.ОбработчикЗакрытияСоединения = "ПриЗакрытииСоединения";
	
	ТипСоединения = ?(Параметры.ЗащищенноеСоединение, "wss", "ws");
	
	Путь = Параметры.Путь;
	
	//@skip-check module-unused-local-variable - используется в "Вычислить"
	СтрокаПодключения = СтрШаблон("%1://%2:%3%4", 
		ТипСоединения, Параметры.Сервер, Формат(Параметры.Порт, "ЧГ=0"), Путь);

	УстановитьБезопасныйРежим(Истина);
	УстановитьОтключениеБезопасногоРежима(Истина);
	//@skip-check server-execution-safe-mode

	// АПК:488-выкл Поддержка новых методов платформы (исполняемый код безопасен)
	// Не нарушает безопасность информации, так как вычисляется фиксированная строка, 
	// содержащая только вызов метода платформы.
	Соединение = Вычислить("WebSocketКлиентСоединения.ОткрытьСоединение(Параметры.Ключ, СтрокаПодключения, ОбработчикиСокета, ПараметрыСоединения)"); // WebSocketКлиентСоединение
	// АПК:488-вкл

	ЗаписатьСохраняемыеПараметрыСокета(Соединение);
	
КонецПроцедуры

// Выполняет отмену подписок и отключение от шины
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение 
Процедура Отключиться(Соединение) Экспорт

	Если СоединениеЗакрыто(Соединение) Тогда
		Возврат; // На клиент-серверных базах есть проблема с закрытием сокета при сохранении конфигурации
	КонецЕсли;
	
	Параметры = Соединение.Параметры.ДополнительныеПараметры; // см. НовыеПараметрыПодключения

	Попытка
		РазрешитьЗакрытиеСокета(Соединение);
		
		// закрываем подключенные подписки
		Для Каждого Подписка Из Параметры.Подписки Цикл
			Соединение.ОтправитьСообщение(КомандаОтменыПодпискиНаПолучениеСообщений(Подписка));
		КонецЦикла;
		Соединение.ОтправитьСообщение(КомандаОтключения());
	Исключение
		Параметры = Неопределено;
	КонецПопытки;
	
	Соединение.Закрыть();
	
КонецПроцедуры

// Добавляет сообщение в очередь для отправки.
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение
//  Сообщение  - см. НовоеСообщениеДляОтправки
Процедура ПоместитьСообщениеВОчередьДляОтправки(Соединение, Сообщение) Экспорт

	Попытка
		СохраненныеПараметры = СохраняемыеПараметрыСокета(Соединение);
		СохраненныеПараметры.СообщенияДляОтправки.Добавить(Сообщение);
		ЗаписатьСохраняемыеПараметрыСокета(Соединение, СохраненныеПараметры);
	Исключение
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

// Выполняет попытку отправки накопленных сообщений
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение 
Процедура ОтправитьСообщения(Соединение) Экспорт
	
	СохраненныеПараметры = СохраняемыеПараметрыСокета(Соединение);
	
	Для Каждого Сообщение Из СохраненныеПараметры.СообщенияДляОтправки Цикл
		ПараметрыСообщения = ПараметрыСообщенияДляОтправки();
		ПараметрыСообщения.Идентификатор = Сообщение.ИдентификаторОтправки;
		ПараметрыСообщения.КлючМаршрутизации = Сообщение.КлючМаршрутизации;
		ПараметрыСообщения.Заголовки = Сообщение.Заголовки;
		ПараметрыСообщения.Тело = Сообщение.ТекстСообщения;
		ПараметрыСообщения.ТочкаОбмена = Сообщение.ТочкаОбмена; 
		
		ТекстКоманды = КомандаОтправкиСообщения(ПараметрыСообщения);
		ОтправитьСообщение(Соединение, ТекстКоманды);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСоедиения

// Обработчик срабатывающий при открытии соединения
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение 
Процедура ПриОткрытииСоединения(Соединение) Экспорт
	
	Параметры = Соединение.Параметры.ДополнительныеПараметры; // см. НовыеПараметрыПодключения
	КомандаПодключения = КомандаПодключения(Параметры);
	Попытка
		Если Не СоединениеЗакрыто(Соединение) Тогда
			Соединение.ОтправитьСообщение(КомандаПодключения);
		КонецЕсли;
	Исключение
		КлючОбработки = "ПриОткрытииСоединения";
		ЗаписьЖурналаРегистрации(
			СтрШаблон("ШинаRabbitMQ.%1", КлючОбработки),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Если Параметры.ПереподключениеПриЗакрытииСоединения Тогда
			Подключиться(Параметры);
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

// Обработчик срабатывающий при закрытии соединения
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение - 
//  КодЗакрытия - Число
Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия) Экспорт

	Если КодЗакрытия <> 1005 Тогда
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ",
			УровеньЖурналаРегистрации.Ошибка, , ,
			СтрШаблон("%1 - Закрылся сокет с кодом: %2", Соединение.URLСервера, КодЗакрытия));
	КонецЕсли;
	
	ЗакрытьСокет = Истина;
	СохраняемыеПараметрыСокета = СохраняемыеПараметрыСокета(Соединение);
	ЗакрытьСокет = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СохраняемыеПараметрыСокета, 
		"ЗакрытьСокет", Ложь); // Булево
	
	ПараметрыСозданияСоединения = Соединение.Параметры.ДополнительныеПараметры; // см. НовыеПараметрыПодключения
	Если Не ЗакрытьСокет И ПараметрыСозданияСоединения.ПереподключениеПриЗакрытииСоединения Тогда
		// Переподключение
		Параметры = Соединение.Параметры.ДополнительныеПараметры; // см. НовыеПараметрыПодключения
		Подключиться(Параметры);
	КонецЕсли;

КонецПроцедуры

// Обработчик срабатывающий при ошибке соединения
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение - 
//  КодОшибки  - Строка
//  Описание   - Строка
Процедура ПриОшибкеСоединения(Соединение, КодОшибки, Описание) Экспорт

	КлючОбработки = "ПриОшибкеСоединения";
	ЗаписьЖурналаРегистрации(
		СтрШаблон("ШинаRabbitMQ.%1", КлючОбработки),
		УровеньЖурналаРегистрации.Ошибка, , ,
		СтрШаблон("%1 - %2 %3", Соединение.URLСервера, КодОшибки, Описание));

	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.26.0", СистемнаяИнформация.ВерсияПриложения) <= 0 Тогда
		// Обход ошибки при проверке модуля на платформе ниже 8.3.27
		УстановитьБезопасныйРежим(Истина);	
		// АПК:488-выкл Поддержка новых методов платформы (исполняемый код безопасен)
		// Не нарушает безопасность информации, так как вычисляется фиксированная строка, 
		// содержащая только вызов метода платформы.
		Выполнить "ВызватьПаузу(2000)";
		// АПК:488-вкл
		УстановитьБезопасныйРежим(Ложь);
	КонецЕсли;
	
	Параметры = Соединение.Параметры.ДополнительныеПараметры; // см. НовыеПараметрыПодключения
	Если Параметры.ПереподключениеПриЗакрытииСоединения Тогда
		Подключиться(Параметры);
	КонецЕсли;

КонецПроцедуры

// Обработчик срабатывающий при получении сообщений из шины
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение
//  Сообщение  - см. СообщениеSTOMP
Процедура ПриПолученииСообщения(Соединение, Сообщение) Экспорт

	СообщениеОбработано = Истина;

	КлючОбработки = "ПриПолученииСообщения";
	ДополнительныеПараметры = Соединение.Параметры.ДополнительныеПараметры; // Структура
	Обработчик = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, КлючОбработки); // Строка
	Если Обработчик = "Отчетность24БРОШинаУведомления.ПриПолученииСообщения" Тогда
		Попытка
			ПараметрыВызова = Новый Массив; // Массив Из Произвольный
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыВызова, 
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Соединение));
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыВызова, 
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сообщение));
			ОбщегоНазначения.ВыполнитьМетодКонфигурации("Отчетность24БРОШинаУведомления.ПриПолученииСообщения", ПараметрыВызова);
		Исключение
			СообщениеОбработано = Ложь;
			
			ЗаписьЖурналаРегистрации(
				СтрШаблон("ШинаRabbitMQ.%1", КлючОбработки), УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	// отправка результата обработки сообщения
	ИдентификаторСообщения = Сообщение.Заголовки["ack"]; // Строка
	Если ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		ПозицияЗавершенияИдентификатора = СтрНайти(ИдентификаторСообщения, "@@");
		Если ПозицияЗавершенияИдентификатора > 38 Тогда
			ИдентификаторСообщения = Сред(ИдентификаторСообщения, 3, ПозицияЗавершенияИдентификатора - 1 - 2);
			
			ИдентификаторСообщения = Сообщение.Заголовки["ack"];
			Если СообщениеОбработано = Истина Тогда
				ОтправитьСообщение(Соединение, КомандаПодтвержденияПолученияСообщения(ИдентификаторСообщения));
			Иначе
				ОтправитьСообщение(Соединение, КомандаНеудачнойОбработкиПолученияСообщения(ИдентификаторСообщения));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Обработчик срабатывающий при получении ошибки доставки сообщения в шину
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение
//  Сообщение  - см. СообщениеSTOMP
Процедура ПриПолученииОшибки(Соединение, Сообщение) Экспорт

	КлючОбработки = "ПриПолученииОшибки";
	ЗаписьЖурналаРегистрации(
		СтрШаблон("ШинаRabbitMQ.%1", КлючОбработки), УровеньЖурналаРегистрации.Ошибка, , ,
		Сообщение.Тело);

КонецПроцедуры

// Обработчик срабатывающий при получении уведомления об удачной доставке сообщения в шину
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение
//  Сообщение  - см. СообщениеSTOMP
Процедура ПриПодтвержденииОтправкиСообщения(Соединение, Сообщение) Экспорт

	ИдентификаторОтправленногоСообщения = Сообщение.Заголовки["receipt-id"];
	Если ЗначениеЗаполнено(ИдентификаторОтправленногоСообщения) Тогда
		// Находим сообщение и удаляем его из очереди на доставку	
		СохраняемыеПараметрыСокета = СохраняемыеПараметрыСокета(Соединение);
		СообщенияДляОтправки = СохраняемыеПараметрыСокета.СообщенияДляОтправки;
		Для Каждого СообщениеДляОтправки Из СообщенияДляОтправки Цикл
			Если СообщениеДляОтправки.ИдентификаторОтправки = ИдентификаторОтправленногоСообщения Тогда
				Индекс = СообщенияДляОтправки.Найти(СообщениеДляОтправки);
				Если Индекс <> Неопределено Тогда
					СообщенияДляОтправки.Удалить(Индекс);
					ЗаписатьСохраняемыеПараметрыСокета(Соединение, СохраняемыеПараметрыСокета);
				КонецЕсли;
				Прервать;
			КонецЕсли;		
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры

// Обработчик срабатывающий при получении сообщений из шины
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение
//  Данные     - Строка
Процедура ПриПолученииСообщенияСлужебный(Соединение, Данные) Экспорт
	
	Сообщение = СообщениеSTOMP(Данные);
		
	Если Не ЗначениеЗаполнено(Сообщение.Команда) Тогда 
		// Поддержка соединения
		ОтправитьСообщение(Соединение, Символы.ПС);
	ИначеЕсли Сообщение.Команда = КомандыСервера().ПодключениеВыполнено Тогда
		// При соединении оформляем подписки.
		Параметры = Соединение.Параметры.ДополнительныеПараметры; // см. НовыеПараметрыПодключения

		Для Каждого Подписка Из Параметры.Подписки Цикл
			ОтправитьСообщение(Соединение, КомандаПодпискаНаПолучениеСообщений(Подписка));
		КонецЦикла;
		
		ОтправитьСообщения(Соединение);
	
	ИначеЕсли Сообщение.Команда = КомандыСервера().Ошибка Тогда 
		ПриПолученииОшибки(Соединение, Сообщение);
	ИначеЕсли Сообщение.Команда = КомандыСервера().ВходящееСообщение Тогда
		// получение сообщение из очереди по подписке
		ПриПолученииСообщения(Соединение, Сообщение);
	ИначеЕсли  Сообщение.Команда = КомандыСервера().ПодтверждениеОтправки Тогда  // отправленное сообщение на шину успешно доставлено
		ПриПодтвержденииОтправкиСообщения(Соединение, Сообщение);
	Иначе
		
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ",
			УровеньЖурналаРегистрации.Информация, , ,
			СтрШаблон("Получена неучтенная команда из Шины
			|Команда:'%1'
			|Тело:   '%2'", Сообщение.Команда, Сообщение.Тело));
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Конструктор параметров подключения к серверу RabbitMQ
// 
// Возвращаемое значение:
//  Структура - Новые параметры подключения:
//	* Ключ                 - Строка - Уникальный идентификатор соединения, служит для поиска соединения через менеджер
//	* Сервер               - Строка
//	* Путь                 - Строка - Request-URI
//	* Порт                 - Число  - Порт обслуживающий STOMP
//	* СохраняемыеПараметры - Структура - Структура сохраняется в регистре для доступа к параметрам из разных сессий:
//    ** СообщенияДляОтправки - Массив Из см. НовоеСообщениеДляОтправки
//	* ПереподключениеПриЗакрытииСоединения - Булево 
//	* ПоддерживаемыеВерсии - Строка - поддерживаемые версии протокола (1.0,1.1,1.2)
//	* Пользователь         - Строка - логин
//	* Пароль               - Строка - пароль
//	* ЗащищенноеСоединение - Булево - влияет на URL ws:// или wss://
//	* ВиртуальныйХост      - Строка - виртуальный хост
//	* Заголовки            - Соответствие Из КлючИЗначение:
//	** Ключ                - Строка
//	** Значение            - Строка
//	* Подписки             - Массив Из см. Подписка
//	* Таймаут              - Число  - Таймаут в секундах
//	* ЧастотаПульса        - Число  - частота подтвержения активности в милисекундах
//	* ПриОткрытииСоединения - Строка - Пример: "ПолучениеУведомленийНовости.ПриОткрытииСоединения" - см. ПриОткрытииСоединения
//	* ПриОшибкеСоединения   - Строка - Пример: "ПолучениеУведомленийНовости.ПриОшибкеСоединения"   - см. ПриОшибкеСоединения
//	* ПриЗакрытииСоединения - Строка - Пример: "ПолучениеУведомленийНовости.ПриЗакрытииСоединения" - см. ПриЗакрытииСоединения
//	* ПриПодтвержденииОтправкиСообщения     - Строка - см. ПриПодтвержденииОтправкиСообщения - Служит для фиксации результата отправки
//	* ПриПолученииОшибки                    - Строка - см. ПриПолученииОшибки - Обработка ошибки полученной с шины, до закрытие соединения  
//	* ПриПолученииСообщения    - Строка - см. ПриПолученииСообщения 
Функция НовыеПараметрыПодключения() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Ключ", "");
	Результат.Вставить("Сервер", "");
	Результат.Вставить("Путь", "/ws");
	Результат.Вставить("Порт", 15674);
	Результат.Вставить("СохраняемыеПараметры", Новый Структура("СообщенияДляОтправки", Новый Массив()));
	Результат.Вставить("ПереподключениеПриЗакрытииСоединения", Ложь);
	Результат.Вставить("ЗащищенноеСоединение", Ложь);
	Результат.Вставить("ПоддерживаемыеВерсии", "1.0,1.1,1.2");
	Результат.Вставить("Пользователь", "guest");
	Результат.Вставить("Пароль", "guest");
	Результат.Вставить("ВиртуальныйХост", "/");
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("Подписки", Новый Массив());
	Результат.Вставить("Таймаут", 300);
	Результат.Вставить("ЧастотаПульса", 3000); // время поддержки активности соединения
	
	Результат.Вставить("ПриОткрытииСоединения", "");
	Результат.Вставить("ПриОшибкеСоединения", "");
	Результат.Вставить("ПриЗакрытииСоединения", "");
	Результат.Вставить("ПриПодтвержденииОтправкиСообщения", "");
	Результат.Вставить("ПриПолученииОшибки", "");
	Результат.Вставить("ПриПолученииСообщения", "");
	
	Возврат Результат;

КонецФункции

#Область КомандыРаботыСШиной

// Конструктор строки команды подключения к серверу RabbitMQ
// 
// Параметры:
//  ПараметрыПодключения - см. НовыеПараметрыПодключения
//
// Возвращаемое значение:
//	 Строка
Функция КомандаПодключения(ПараметрыПодключения) Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();
	СообщениеSTOMP.Команда = КомандыКлиента().Подключиться;
	СообщениеSTOMP.Заголовки.Вставить("accept-version",	ПараметрыПодключения.ПоддерживаемыеВерсии);
	СообщениеSTOMP.Заголовки.Вставить("login",			ПараметрыПодключения.Пользователь);
	СообщениеSTOMP.Заголовки.Вставить("passcode",		ПараметрыПодключения.Пароль);
	СообщениеSTOMP.Заголовки.Вставить("host",			ПараметрыПодключения.ВиртуальныйХост);
	СообщениеSTOMP.Заголовки.Вставить("heart-beat",		СтрШаблон("%1,%1", Формат(ПараметрыПодключения.ЧастотаПульса,"ЧГ=0")));
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды отключения от шины
//
// Возвращаемое значение:
//	 Строка
//
Функция КомандаОтключения() Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();	
	СообщениеSTOMP.Команда = КомандыКлиента().Отключиться;
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды подписки на получение сообщений из RabbitMQ
// 
// Параметры:
//  Подписка - см. Подписка
//
// Возвращаемое значение:
//	 Строка
Функция КомандаПодпискаНаПолучениеСообщений(Подписка) Экспорт
	
	Если ТипЗнч(Подписка.ТипПриемника) <> Тип("Строка") Тогда
		Подписка.ТипПриемника = ТипыПриемниковОбработкиСообщений().ПоКлючу;
	КонецЕсли;

	Если ТипЗнч(Подписка.ТипПодтвержденияПолучения) <> Тип("Строка") Тогда
		Подписка.ТипПодтвержденияПолучения = "client-individual";
	КонецЕсли;

	СообщениеSTOMP = СообщениеSTOMP();
	СообщениеSTOMP.Команда = КомандыКлиента().ОформитьПодпискуНаСообщения;
	СообщениеSTOMP.Заголовки.Вставить("id", Подписка.Идентификатор);
	СообщениеSTOMP.Заголовки.Вставить("destination", СтрШаблон("/%1/%2", Подписка.ТипПриемника, Подписка.Ключ));
	СообщениеSTOMP.Заголовки.Вставить("ack", Подписка.ТипПодтвержденияПолучения);
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды подписки на получение сообщений из RabbitMQ
// 
// Параметры:
//  Подписка             - см. Подписка
//
// Возвращаемое значение:
//	 Строка
Функция КомандаОтменыПодпискиНаПолучениеСообщений(Подписка) Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();
	СообщениеSTOMP.Команда = КомандыКлиента().ОтменитьПодпискуНаСообщения;
	СообщениеSTOMP.Заголовки.Вставить("id", Подписка.Идентификатор);
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды подтверждения получения сообщения
//
// Параметры:
//	 Идентификатор - Строка - идентификатор сообщения
//
// Возвращаемое значение:
//	 Строка
//
Функция КомандаПодтвержденияПолученияСообщения(Идентификатор) Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();
	СообщениеSTOMP.Команда = КомандыКлиента().ПодтвердитьПолучениеСообщения;
	СообщениеSTOMP.Заголовки.Вставить("id",	Идентификатор);
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды отказа обработки полученного сообщения
//
// Параметры:
//	 Идентификатор - Строка - идентификатор сообщения
//
// Возвращаемое значение:
//	 Строка
//
Функция КомандаНеудачнойОбработкиПолученияСообщения(Идентификатор) Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();
	СообщениеSTOMP.Команда = КомандыКлиента().ОтказатьсяОтПолученияСообщения;
	СообщениеSTOMP.Заголовки.Вставить("message-id",	Идентификатор);
	СообщениеSTOMP.Заголовки.Вставить("id",			Идентификатор);
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды отправки сообщения
//
// Параметры:
//	 Параметры - см. ПараметрыСообщенияДляОтправки 
//
// Возвращаемое значение:
//	 Строка
Функция КомандаОтправкиСообщения(Параметры) Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();	
	СообщениеSTOMP.Команда = КомандыКлиента().ОтправитьСообщение;
	СообщениеSTOMP.Заголовки.Вставить("receipt",		Параметры.Идентификатор);
	СообщениеSTOMP.Заголовки.Вставить("content-type",	Параметры.ТипСодержимого);
	СообщениеSTOMP.Заголовки.Вставить("destination",	СтрШаблон("/exchange/%1/%2", Параметры.ТочкаОбмена,
																					 Параметры.КлючМаршрутизации));
		
	Для Каждого КлючЗначение Из Параметры.Заголовки Цикл
		СообщениеSTOMP.Заголовки.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение); 
	КонецЦикла;
	
	СообщениеSTOMP.Тело = Параметры.Тело;
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Конструктор параметров для сообщения для отправки
//
// Возвращаемое значение:
//   Структура:
//     * Идентификатор      - Строка - уникальный идентификатор сообщения (по умолчанию пустой).
//     * ТипСодержимого     - Строка - MIME-тип содержимого сообщения (по умолчанию "text/plain").
//     * ТочкаОбмена        - Строка - amq.direct, amq.fanout, amq.headers, amq.match, amq.topic и т.п. (Binding from)	 
//     * КлючМаршрутизации  - Строка - ключ маршрутизации сообщения (Routing key) 
//     * Заголовки          - Соответствие Из КлючИЗначение:
//     ** Ключ              - Строка
//     ** Значение          - Строка
//     * Тело               - Строка - содержимое сообщения.
Функция ПараметрыСообщенияДляОтправки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("ТипСодержимого", "text/plain");
	Результат.Вставить("ТочкаОбмена", "");
	Результат.Вставить("КлючМаршрутизации", "");
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("Тело", "");
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Отправляет сообщение в шину
// 
// Параметры:
//  Соединение     - WebSocketКлиентСоединение
//  ТекстСообщения - Строка
// 
Процедура ОтправитьСообщение(Соединение, ТекстСообщения)

	Если СоединениеЗакрыто(Соединение) Тогда
		Возврат; // На клиент-серверных базах есть проблема с закрытием сокета при сохранении конфигурации
	КонецЕсли;
	
	Попытка
		Соединение.ОтправитьСообщение(ТекстСообщения);
	Исключение
		Состояние =  Соединение.ПолучитьСостояние(); // СостояниеWebSocketСоединения
		
		// Обход ошибки при проверке модуля на платформе ниже 8.3.27
		УстановитьБезопасныйРежим(Истина);

		// АПК:488-выкл Поддержка новых методов платформы (исполняемый код безопасен)
		// Не нарушает безопасность информации, так как вычисляется фиксированная строка, 
		// содержащая только вызов метода платформы.
		СоединениеЗакрыто = Вычислить("СостояниеWebSocketСоединения.Закрыто");
		// АПК:488-вкл

		УстановитьБезопасныйРежим(Ложь);
		
		Если Состояние = СоединениеЗакрыто Тогда
			ЗаписьЖурналаРегистрации(
				"ШинаRabbitMQ", 
				УровеньЖурналаРегистрации.Информация, , , 
				СтрШаблон("Не удалось отправить сообщение 
				|Тело: '%1'
				|Статус соединения - %2", Строка(Состояние)));
		КонецЕсли; 
	КонецПопытки;
КонецПроцедуры

// Возвращает статус закрытого соединения
// 
// Параметры:
//  Соединение     - WebSocketКлиентСоединение
// 
// Возвращаемое значение:
//  Булево
Функция СоединениеЗакрыто(Соединение) 
	
	Если ТипЗнч(Соединение) = Тип("WebSocketКлиентСоединение") Тогда
		Состояние =  Соединение.ПолучитьСостояние(); // СостояниеWebSocketСоединения
		
		// Обход ошибки при проверке модуля на платформе ниже 8.3.27
		УстановитьБезопасныйРежим(Истина);

		// АПК:488-выкл Поддержка новых методов платформы (исполняемый код безопасен)
		// Не нарушает безопасность информации, так как вычисляется фиксированная строка, 
		// содержащая только вызов метода платформы.
		СоединениеЗакрыто = Вычислить("СостояниеWebSocketСоединения.Закрыто");
		// АПК:488-вкл

		УстановитьБезопасныйРежим(Ложь);
		
		Возврат Состояние = СоединениеЗакрыто;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Сохранение параметров сокета в параметрах сеанса
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение
Процедура РазрешитьЗакрытиеСокета(Соединение)
	
	Параметры = СохраняемыеПараметрыСокета(Соединение);
	Параметры.Вставить("ЗакрытьСокет", Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	Попытка
		Запись = РегистрыСведений.Отчетность24БРОПараметрыШины.СоздатьМенеджерЗаписи();
		Запись.Ключ = Соединение.Ключ;
		Запись.ХранилищеПараметров = Новый ХранилищеЗначения(Параметры);
		Запись.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ОтменитьТранзакцию();
	КонецПопытки;
	 
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Сохранение параметров сокета в базе
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение -
//  СохраняемыеПараметрыСокета - Структура
Процедура ЗаписатьСохраняемыеПараметрыСокета(Соединение, СохраняемыеПараметрыСокета = Неопределено)
	
	Если СохраняемыеПараметрыСокета = Неопределено Тогда
		СохраняемыеПараметрыСокета = СохраняемыеПараметрыСокета(Соединение);
	КонецЕсли;
	
	Если СохраняемыеПараметрыСокета.Свойство("ЗакрытьСокет") Тогда
		СохраняемыеПараметрыСокета.Удалить("ЗакрытьСокет");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина); 
	НачатьТранзакцию();
	Попытка
		Запись = РегистрыСведений.Отчетность24БРОПараметрыШины.СоздатьМенеджерЗаписи();
		Запись.Ключ = Соединение.Ключ;
		Запись.ХранилищеПараметров = Новый ХранилищеЗначения(СохраняемыеПараметрыСокета);
		Запись.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ОтменитьТранзакцию();
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Контруктор структуры сообщения для отправки.
// 
// Параметры:
//  КлючМаршрутизации - Строка
//  ТекстСообщения    - Строка
//  ТочкаОбмена       - Строка
//  Заголовки         - Соответствие из КлючИЗначение - заголовки для маршрутизации:
// * Ключ     - Строка
// * Значение - Строка 
// 
// Возвращаемое значение:
//  Структура - Новое сообщение для отправки:
// * ИдентификаторОтправки - Строка
// * КлючМаршрутизации     - Строка
// * ТочкаОбмена           - Строка
// * ТекстСообщения        - Строка
// * Заголовки             - Соответствие из КлючИЗначение - заголовки для маршрутизации:
// ** Ключ     - Строка
// ** Значение - Строка 
Функция НовоеСообщениеДляОтправки(КлючМаршрутизации, ТекстСообщения = "", ТочкаОбмена = "amq.topic", 
	Заголовки = Неопределено) Экспорт

	СтруктураСообщения = Новый Структура();
	СтруктураСообщения.Вставить("ИдентификаторБазы", Отчетность24БРО.ИдентификаторБазы());
	СтруктураСообщения.Вставить("Сообщение", ТекстСообщения);
	
	Результат = Новый Структура();
	Результат.Вставить("ИдентификаторОтправки", Строка(Новый УникальныйИдентификатор()));
	Результат.Вставить("КлючМаршрутизации", КлючМаршрутизации);
	Результат.Вставить("ТочкаОбмена", ТочкаОбмена);
	Результат.Вставить("ТекстСообщения", ОбщегоНазначения.ЗначениеВJSON(СтруктураСообщения));
	Если ТипЗнч(Заголовки) = Тип("Соответствие") Тогда
		Результат.Вставить("Заголовки", Заголовки);
	Иначе
		Результат.Вставить("Заголовки", Новый Соответствие);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Возвращает сохраняемые параметры сокета из базы
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение -
// 
// Возвращаемое значение:
//  Структура:
//  	СообщенияДляОтправки - Массив Из см. НовоеСообщениеДляОтправки
//
Функция СохраняемыеПараметрыСокета(Соединение)
	
	ПараметрыСокета = Соединение.Параметры.ДополнительныеПараметры; // см. НовыеПараметрыПодключения
	Результат = ПараметрыСокета.СохраняемыеПараметры;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Запись = РегистрыСведений.Отчетность24БРОПараметрыШины.СоздатьМенеджерЗаписи();
		Запись.Ключ = Соединение.Ключ;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Параметры = Запись.ХранилищеПараметров.Получить(); // Структура
			Если ТипЗнч(Параметры) <> Тип("Структура") Или Не Параметры.Свойство("СообщенияДляОтправки") Тогда
				Параметры = Новый Структура("СообщенияДляОтправки", Новый Массив);
			КонецЕсли;
			Результат = Параметры;
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Возвращает текст сообщения в формате STOMP
// 
// Параметры:
//  СообщениеSTOMP - см. СообщениеSTOMP
// 
// Возвращаемое значение:
//  Строка
Функция ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP)
	
	Заголовки = "";
	
	Для Каждого КлючЗначение Из СообщениеSTOMP.Заголовки Цикл
		
		Заголовки = СтрШаблон("%1:%2%3%4", КлючЗначение.Ключ, ЭкранироватьСимволы(КлючЗначение.Значение), 
										   Символы.ПС, Заголовки);
	КонецЦикла;

	Результат = СообщениеSTOMP.Команда + Символы.ПС + Заголовки;
	
	Результат = СтрШаблон("%1%2%3%4", Результат, Символы.ПС, СообщениеSTOMP.Тело, Символ(0));

	Возврат Результат;
	
КонецФункции

// Структура сообщения STOMP
// 
// Параметры:
//  Данные - Неопределено, Строка - Текст сообщения в формате STOMP
// 
// Возвращаемое значение:
//  Структура:
// * Команда   - Строка 
// * Заголовки - Соответствие из КлючИЗначение:
// ** Ключ     - Строка
// ** Значение - Строка 
// * Тело      - Строка 
Функция СообщениеSTOMP(Знач Данные = Неопределено) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Команда", "");
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("Тело", "");

	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		
		Данные = СтрЗаменить(Данные, Символ(0), "");
		
		ПозицияЗавершенияКоманды = СтрНайти(Данные, Символы.ПС);
		Команда = Лев(Данные, ПозицияЗавершенияКоманды - 1);
		Если Не ЗначениеЗаполнено(Команда) Тогда
			Возврат Результат;
		КонецЕсли;

		Результат.Команда = Команда;
		
		Данные = Сред(Данные, СтрДлина(Результат.Команда) + 2);
		ПозицияЗавершенияЗаголовков = СтрНайти(Данные, Символы.ПС + Символы.ПС);
		СтрокаЗаголовков = Лев(Данные, ПозицияЗавершенияЗаголовков - 1);
		
		Заголовки = СтрРазделить(СтрокаЗаголовков, Символы.ПС, Ложь);
		Для Каждого Заголовок Из Заголовки Цикл
			ДанныеЗаголовка = СтрРазделить(Заголовок, ":", Ложь);
			Результат.Заголовки.Вставить(СокрЛП(ДанныеЗаголовка[0]), СокрЛП(ДанныеЗаголовка[1]));
		КонецЦикла;
		
		РазмерТела = СтрДлина(Данные) - (ПозицияЗавершенияЗаголовков + 2);
		Результат.Тело = Сред(Данные, ПозицияЗавершенияЗаголовков + 2, РазмерТела);
		
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Экранирует символы для передачи в шину
// 
// Параметры:
//  Значение - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ЭкранироватьСимволы(Значение)
	
	Результат = Значение;
	
	ЭкранируемыеСимволы = Новый Соответствие;
	ЭкранируемыеСимволы.Вставить("\", "\\");
	ЭкранируемыеСимволы.Вставить(":", "\c");
	ЭкранируемыеСимволы.Вставить(Символ(10), "\n");
	ЭкранируемыеСимволы.Вставить(Символ(13), "\r");
	
	Для Каждого КлючЗначение Из ЭкранируемыеСимволы Цикл
		Результат = СтрЗаменить(Результат, КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
