#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
КонецПроцедуры

Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 23, 0);
	
КонецФункции

// Подготавливает данные для заполнения документа
//
// Параметры:
//   СтруктураПараметров - Струкутра - структура входных параметров с ключами:
//     * Организация           - СправочникСсылка.Организация - организация, для которой будут получены данные для заполнения документа.
//     * Дата                  - Дата - дата, на которую будут получены данные для заполнения документа.
//   АдресХранилища - Строка - адрес временного хранилища для помещения результата выполнения.
Процедура ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища) Экспорт
	
	ДанныеДляЗаполнения = Новый Структура;
	СведенияИзДокументовОПредстоящейПоставке = НовыйСведенияИзДокументовОПредстоящейПоставке();
	ОбеспечительныеПлатежи = НовыйОбеспечительныеПлатежи();
	
	ДанныеДляЗаполнения.Вставить("СведенияИзДокументовОПредстоящейПоставке", СведенияИзДокументовОПредстоящейПоставке);
	ДанныеДляЗаполнения.Вставить("ОбеспечительныеПлатежи", ОбеспечительныеПлатежи);
	
	УчетНДСОтчетыПереопределяемый.ЗаполнитьДокументОтражениеДОППВДекларацииПоКосвеннымНалогам(
		СтруктураПараметров, ДанныеДляЗаполнения, АдресХранилища); 
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений - с колонками:
//     * Имя           - Строка - Имя набора свойств. Формируется из полного имени объекта
//                       метаданных заменой символа "." на "_".
//                       Например, "Документ_ЗаказПокупателя".
//     * Идентификатор - УникальныйИдентификатор - Идентификатор ссылки предопределенного элемента.
//     * Используется  - Неопределено, Булево - Признак того, что набор свойств используется.
//                       Например, можно использовать для скрытия набора по функциональным опциям.
//                       Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_ОтражениеДОППВДекларацииПоКосвеннымНалогам";
	Набор.Идентификатор = Новый УникальныйИдентификатор("dbbf21d5-fdf4-4ec8-9fb2-1da890daf7e9");
	Набор.Используется  = ПолучитьФункциональнуюОпцию("ВедетсяУчетИмпортаТоваров");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйСведенияИзДокументовОПредстоящейПоставке()
	
	СведенияИзДокументовОПредстоящейПоставке = Новый ТаблицаЗначений;
	СведенияИзДокументовОПредстоящейПоставке.Колонки.Добавить("КлючСтроки", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	СведенияИзДокументовОПредстоящейПоставке.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	СведенияИзДокументовОПредстоящейПоставке.Колонки.Добавить("ДОПП", Документы.ТипВсеСсылки());
	СведенияИзДокументовОПредстоящейПоставке.Колонки.Добавить("РегистрационныйНомерДОПП", ОбщегоНазначения.ОписаниеТипаСтрока(13));
	СведенияИзДокументовОПредстоящейПоставке.Колонки.Добавить("Состояние");
	СведенияИзДокументовОПредстоящейПоставке.Колонки.Добавить("ОбеспечительныйПлатежПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	СведенияИзДокументовОПредстоящейПоставке.Колонки.Добавить("ДокументОприходования", Документы.ТипВсеСсылки());
	Возврат СведенияИзДокументовОПредстоящейПоставке;
	
КонецФункции

Функция НовыйОбеспечительныеПлатежи()
	
	ОбеспечительныеПлатежи = Новый ТаблицаЗначений;
	ОбеспечительныеПлатежи.Колонки.Добавить("КлючСтроки", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ОбеспечительныеПлатежи.Колонки.Добавить("КБК", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ОбеспечительныеПлатежи.Колонки.Добавить("ОбеспечительныйПлатежВсего", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ОбеспечительныеПлатежи.Колонки.Добавить("ОбеспечительныйПлатежКОтражению", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ОбеспечительныеПлатежи.Колонки.Добавить("НачисленоПриВвозе", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ОбеспечительныеПлатежи.Колонки.Добавить("КДоплате", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Возврат ОбеспечительныеПлатежи;
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли