#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
	СведенияИзДокументовОПредстоящейПоставке.Очистить();
	ОбеспечительныеПлатежи.Очистить();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументовПереопределяемый.ОбработкаПроведенияДокументаОтражениеДОППВДекларацииПоКосвеннымНалогам(ЭтотОбъект, Движения, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Для Каждого Строка Из СведенияИзДокументовОПредстоящейПоставке Цикл
		
		Префикс = "Объект.СведенияИзДокументовОПредстоящейПоставке[%1].";
		Префикс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Префикс, Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
		Если Не ЗначениеЗаполнено(Строка.РегистрационныйНомерДОПП)
			И Строка.Состояние <> Перечисления.СостоянияПоставкиТоваровИзЕАЭС.Ожидается Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Заполнение",
				НСтр("ru='Регистрационный номер ДОПП'"),
				Строка.НомерСтроки,
				НСтр("ru='Сведения из документов о предстоящей поставке товаров'"));
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Префикс + "РегистрационныйНомерДОПП", , Отказ);
				
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли