
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// получаем список ПФ
	Ответ = _СписокПФ(ПараметрКоманды);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Ответ", 						Ответ);
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", 	ПараметрыВыполненияКоманды);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПечатныхФорм",ЭтотОбъект, ДополнительныеПараметры); 
	
	Ответ.СписокПФ.ПоказатьОтметкуЭлементов(ОписаниеОповещения,"Доступные печатные формы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПечатныхФорм(СписокПФ, ДополнительныеПараметры) Экспорт 

	Если СписокПФ <> Неопределено Тогда
		
		// проверяем, что есть печатные формы
		КоличествоПФ = 0;
		Для каждого Стр Из СписокПФ Цикл
			
			Если (стр.Пометка) Тогда
				
				КоличествоПФ = КоличествоПФ +1;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если (КоличествоПФ <> 0) Тогда
			
			ВыполнитьПечать(ДополнительныеПараметры.Ответ, ДополнительныеПараметры.ПараметрыВыполненияКоманды, СписокПФ);
			
		Иначе
			
			_УФК.ВывестиПредупреждение("Печатные формы не выбраны!");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
  

&НаСервере
Функция _СписокПФ(ПараметрКоманды)
	
	ТаблицаПФ	 	= CW_Печать.ПолучитьПустуюТаблицуПечатныхФорм();
	
	мОбъектыПечати 	= Новый Массив;
	
	МассивСссылок 	= Новый Массив;
	
	Если ПараметрКоманды.Количество()> 0 Тогда
		
		СсылкаВМассиве  = ПараметрКоманды[0];
		Если ТипЗнч(СсылкаВМассиве)= Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
			//Дополняем метаданые связанных документов
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CW_ДокументыОтчетаЭкспедитора.ОтчетЭкспедитора КАК ОтчетЭкспедитора,
			|	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент КАК СвязанныйДокумент
			|ИЗ
			|	РегистрСведений.CW_ДокументыОтчетаЭкспедитора КАК CW_ДокументыОтчетаЭкспедитора
			|ГДЕ
			|	CW_ДокументыОтчетаЭкспедитора.ОтчетЭкспедитора В(&ОтчетыЭкспедитора)
			|	И CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.Проведен
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	CW_ОтчетЭкспедитораДокументыВознаграждения.Ссылка,
			|	CW_ОтчетЭкспедитораДокументыВознаграждения.Документ
			|ИЗ
			|	Документ.CW_ОтчетЭкспедитора.ДокументыВознаграждения КАК CW_ОтчетЭкспедитораДокументыВознаграждения
			|ГДЕ
			|	CW_ОтчетЭкспедитораДокументыВознаграждения.Ссылка В(&ОтчетыЭкспедитора)
			|	И CW_ОтчетЭкспедитораДокументыВознаграждения.Документ.Проведен
			|
			|УПОРЯДОЧИТЬ ПО
			|	СвязанныйДокумент УБЫВ
			|ИТОГИ ПО
			|	ОтчетЭкспедитора
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			Запрос.УстановитьПараметр("ОтчетыЭкспедитора", ПараметрКоманды);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаОтчетЭкспедитора = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока  ВыборкаОтчетЭкспедитора.Следующий() Цикл
				
				МассивСссылок.Добавить(ВыборкаОтчетЭкспедитора.ОтчетЭкспедитора);
				
				мСвязанныеДокументы = Новый Массив;
				
				ВыборкаДетали = ВыборкаОтчетЭкспедитора.Выбрать();
				Пока ВыборкаДетали.Следующий() Цикл
					мСвязанныеДокументы.Добавить(ВыборкаДетали.СвязанныйДокумент);
					МассивСссылок.Добавить(ВыборкаДетали.СвязанныйДокумент);
				КонецЦикла;
				
				ОбъектПечати = Новый Структура;
				ОбъектПечати.Вставить("Ссылка", 			ВыборкаОтчетЭкспедитора.ОтчетЭкспедитора);
				ОбъектПечати.Вставить("СвязанныеДокументы", мСвязанныеДокументы);
				
				мОбъектыПечати.Добавить(ОбъектПечати);
				
			КонецЦикла;
			
			МассивИменМетаданных	= CW_Печать.ПолучитьМассивИменМетеданных(МассивСссылок);
			
			
		Иначе
			
			Для Каждого СсылкаВМассиве из ПараметрКоманды Цикл
				ОбъектПечати = Новый Структура;
				ОбъектПечати.Вставить("Ссылка", СсылкаВМассиве);
				
				мОбъектыПечати.Добавить(ОбъектПечати);
			КонецЦикла;
			
			МассивИменМетаданных	= CW_Печать.ПолучитьМассивИменМетеданных(ПараметрКоманды);
			
		КонецЕсли;
		
	КонецЕсли;
	
	CW_Печать.ЗаполнитьТаблицуПечатныхФормОбъектов(МассивИменМетаданных, ТаблицаПФ);
	
	СписокПФ = Новый СписокЗначений;
	Для каждого СтрокаТаблицы Из ТаблицаПФ Цикл
		СписокПФ.Добавить(СтрокаТаблицы.СсылкаНаОбработку, СтрокаТаблицы.Представление);
	КонецЦикла; 
	
	Ответ = Новый Структура;
	Ответ.Вставить("СписокПФ", 				СписокПФ);
	Ответ.Вставить("ОбъектыПечати", 		мОбъектыПечати);
	Ответ.Вставить("МассивИменМетаданных", 	МассивИменМетаданных);
	
	Возврат Ответ;
	
КонецФункции
 

&НаКлиенте
Процедура ВыполнитьПечать(ПараметрыПечати, ПараметрыВыполненияКоманды, СписокПФ)
	
	Ответ = CW_Печать.ПолучитьПараметрыФормыПакетнойПечати(ПараметрыПечати, ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор, СписокПФ);
	
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		ОткрытьФорму("ОбщаяФорма.CW_Печать",Ответ.ПФ);
	КонецЕсли; 
	
КонецПроцедуры
  
