#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьТипыЗначенийРеквизитовПутевогоЛиста() Экспорт
	
	СоответствияТиповРеквизитов = Новый Соответствие;
	
	//РЕКВИЗИТЫ ШАПКИ
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.Дата					, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.Номер					, Тип("Строка"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.Прицеп					, Тип("СправочникСсылка.CW_ТранспортныеСредства"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ВыездФакт				, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ВозвращениеФакт			, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ТранспортноеСредство	, Тип("СправочникСсылка.CW_ТранспортныеСредства"));
	
	//РЕКВИЗИТЫ ТАБЛИЧНОЙ ЧАСТИ
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_Водитель			, Тип("СправочникСсылка.ФизическиеЛица"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_АдресПогрузки		, Тип("Строка"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_АдресРазгрузки	, Тип("Строка"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_Груз				, Тип("СправочникСсылка.CW_Грузы"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ВесГруза			, Тип("Число"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаПогрузки		, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаРазгрузки		, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаВыезда		, Тип("Дата"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ДатаВозвращения	, Тип("Дата"));
	
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_Пробег			, Тип("Число"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ПробегСГрузом		, Тип("Число"));
	СоответствияТиповРеквизитов.Вставить(Перечисления.CW_РеквизитыПутевыхЛистов.ЭтапыМаршрута_ПробегПорожний	, Тип("Число"));
	
	Возврат СоответствияТиповРеквизитов;
	
КонецФункции

#КонецЕсли