
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыВариантЗаполнить = Истина;
	ПараметрыВариантДополнить = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнение(Команда)

	Ответ = Новый Структура;
	Ответ.Вставить("ВариантПерезаполнить", ПараметрыВариантЗаполнить);
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗаполнитьПриИзменении(Элемент)
	
	Если ПараметрыВариантЗаполнить Тогда
		ПараметрыВариантДополнить = Ложь;
	Иначе
		ПараметрыВариантЗаполнить = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантДополнитьПриИзменении(Элемент)
	
	Если ПараметрыВариантДополнить Тогда
		ПараметрыВариантЗаполнить = Ложь;
	Иначе
		ПараметрыВариантДополнить = истина;
	КонецЕсли;
	
КонецПроцедуры



