
Процедура ВыполнитьОбновлениеКонфигурации(Форма) Экспорт
	
	НачатьОбновлениеМодуля(Форма);
	
КонецПроцедуры  

Процедура ОбработатьКонтрольЛегальностиОбновления(РезультатКонтроля, ДополнительныеПараметры) Экспорт   
	
	ДополнительныеПараметры.Вставить("ВремяНачала", ТекущаяДата()); 
	
	Параметры = Новый Структура;
	Параметры.Вставить("РезультатКонтроля", РезультатКонтроля);
	
	ОписаниеОповещения = новый ОписаниеОповещения("ЗавершитьОбновлениеПодсистем", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ПрогрессОбновленияКонфигурации",Параметры ,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры   

Процедура ЗавершитьОбновлениеПодсистем(РезультатВыполнения, ДополнительныеПарамтеры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;  

	ДополнительныеПарамтеры.Вставить("ВремяЗавершения", ТекущаяДата());
	
	Если РезультатВыполнения = "Ошибка" Тогда
		ПоказатьПредупреждение(, 	"Не удалось выполнить обновление модуля. 
		 							|Обратитесь к разработчику!",,"Ошибка применения обновления");	
	КонецЕсли;   
	
	Если РезультатВыполнения = "Успешно" Тогда 
		
		ОбработкаОповещения = Новый ОписаниеОповещения("ПродолжитьОткрытиеФормы",ДополнительныеПарамтеры.Форма); 
		ВыполнитьОбработкуОповещения(ОбработкаОповещения, Истина);
		
		Если ДополнительныеПарамтеры.Свойство("Форма") Тогда
			ДополнительныеПарамтеры.Удалить("Форма");
		КонецЕсли;
		
		CW_ОбновлениеКонфигурацииСервер.ЗавершитьОбновлениеПодсистем(ДополнительныеПарамтеры);  
		
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммыПослеОбновления", 0.1, Истина);  
		
		Оповестить("ОбновлениеКонфигурации_Успешно");  
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("СтартРегламентногоЗадания", Истина);
		
		ОткрытьФорму("ОбщаяФорма.CW_РезультатОбновления", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	Конецесли;
	
КонецПроцедуры    



Процедура ВыполнитьПервыйЗапускКонфигурации() Экспорт
	
	ПодключитьОбработчикОжидания("ПервыйЗапускКонфигурации", 0.1, Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьНачальноеЗаполнение(РезультатЗаполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗаполнения = "Успешно" тогда
		
		Оповестить("ВыполненыПроцедурыПервогоЗапуска");  
		
	ИначеЕсли  РезультатЗаполнения = "Ошибка" тогда
		
		ПоказатьПредупреждение(, "При выполнении начальньного заполнения возникла ошибка. 
									|Подробности см. в журнале регистрации!");
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьПервыйЗапускКонфигурации(Форма) Экспорт
	
	CW_ОбновлениеКонфигурацииСервер.ЗавершитьОбновлениеПодсистем();   

	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммыПослеОбновления", 0.1, Истина);  

КонецПроцедуры
