
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		УстановитьПустуюКартинку();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДанныеПечати  = ТекущийОбъект.ХранилищеПечати.Получить();
	АдресКартинки = ПоместитьВоВременноеХранилище(ДанныеПечати, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДанныеПечати = ПолучитьИзВременногоХранилища(АдресКартинки);
	ТекущийОбъект.ХранилищеПечати = Новый ХранилищеЗначения(ДанныеПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКартинку(Команда) 
	
	УстановитьПустуюКартинку();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьПустуюКартинку()

	АдресКартинки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинку(Команда)
	
	Фильтр = ПолучитьФильтрФайловКартинок();
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов("Выберите картинку", Ложь, Фильтр , 0);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗагрузкуКартинки",ЭтотОбъект); 
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , , , ПараметрыДиалога, УникальныйИдентификатор);	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьЗагрузкуКартинки(ПомещаемыйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещаемыйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьЗагрузкуКартинкиНаСервере(ПомещаемыйФайл.Адрес);
	
КонецПроцедуры  

&НаСервере
Функция ЗавершитьЗагрузкуКартинкиНаСервере( Адрес)   
	
	ДанныеКартинки = ПолучитьИзВременногоХранилища( Адрес);
	АдресКартинки = ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
	
КонецФункции
  
&НаСервере
Функция ПолучитьФильтрФайловКартинок()  
	
	Массив = Новый Массив;
	Массив.Добавить("Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf");
	Массив.Добавить("Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle");
	Массив.Добавить("Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg");
	Массив.Добавить("Формат TIFF (*.tif)|*.tif");
	Массив.Добавить("Формат GIF (*.gif)|*.gif");
	Массив.Добавить("Формат PNG (*.png)|*.png");
	Массив.Добавить("Формат icon (*.ico)|*.ico");
	Массив.Добавить("Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf");
	
	Возврат СтрСоединить(Массив, "|");
	
КонецФункции

&НаКлиенте
Процедура ПоказатьШаблон(Команда)

	Таблица = ПолучитьШаблонНаСервере();
	Таблица.Показать("Шаблон образца печати");

КонецПроцедуры

&НаСервере
Функция ПолучитьШаблонНаСервере()
	
	Макет = РегистрыСведений.CW_ПечатиОрганизаций.ПолучитьМакет("ШаблонПечати");
	ОбластьОбразецПечати = Макет.ПолучитьОбласть("ОбразецПечати");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(ОбластьОбразецПечати);
	ТабличныйДокумент.ОтображатьЗаголовки	= Ложь;
	ТабличныйДокумент.ОтображатьСетку		= Ложь;
	ТабличныйДокумент.СохранятьСвойстваОтображения = Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
	
