#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Инициализация_отчета
// информация об отчете
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОтчет();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешнийОтчет();
	
	СтруктураОписания.Наименование				= "Внешний подключаемый отчет (с формой настроек)";
	СтруктураОписания.Описание					= "Пример внешнего подключаемого отчета с поставляемой формой настроек";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	СтруктураОписания.РасполагатьНаРабочемСтоле	= Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "ОткрытьФорму");
	
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыОбъекта(СтруктураОписания, "ФормаОтчета");
	 
	CW_ПодключаемыеКомандыСервер.УстановитьКомандыВнешнегоОбъекта(СтруктураОписания,
			"Отчет",
			"Внешний подключаемый отчет (Команда №1)",
			БиблиотекаКартинок.CW_Отчеты,
			Истина);
	
	CW_ПодключаемыеКомандыСервер.УстановитьКомандыВнешнегоОбъекта(СтруктураОписания,
			"Отчет",
			"Внешний подключаемый отчет (Команда №2)",
			БиблиотекаКартинок.CW_Отчеты,
			Истина);
	
 
	Возврат СтруктураОписания;

КонецФункции

#КонецОбласти

//Функция СформироватьОтчет(СтруктураНастроек) Экспорт
//
//	Параметры:
//	- СтруктураНастроек - 	структра с различным с произовольными 
//							параметрами передавамыми в процедуру 
//							формирования отчета из формы.     
//
Функция СформироватьОтчет(СтруктураНастроек) Экспорт
	
	//Ответ возвраща
	Ответ = новый Структура("Результат,ОписаниеОшибки");
	
	Макет = ПолучитьМакет("МакетОтчета");
	
	ТабличныйДокумент 	= Новый ТабличныйДокумент;
	
	//алгоритм формирования отчета	
	Ответ.Результат 		= ТабличныйДокумент;
	Ответ.ОписаниеОшибки 	= "";
	
	Возврат Ответ;
	
КонецФункции
#КонецЕсли