Функция ПолучитьДоступныеРеквизиты(Знач ТаблицаРеквизитов) Экспорт
	
	мИменаДоступныхРеквизитов = Новый Массив;
	мИменаДоступныхРеквизитов.Добавить("ВидДвижения");
	мИменаДоступныхРеквизитов.Добавить("Количество");
	мИменаДоступныхРеквизитов.Добавить("Сумма");
	мИменаДоступныхРеквизитов.Добавить("НДС");
	мИменаДоступныхРеквизитов.Добавить("Всего");
	
	ТаблицаКорректировки = Метаданные.Документы.CW_КорректировкаПеревыставления.ТабличныеЧасти.ТаблицаКорректировки;
	
	Для Каждого ИмяРеквизита из мИменаДоступныхРеквизитов Цикл 
		
		Реквизит = ТаблицаКорректировки.Реквизиты.Найти(ИмяРеквизита);
		Если Реквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.Имя			= Реквизит.Имя;
		НоваяСтрока.Синоним		= Реквизит.Синоним;
   		НоваяСтрока.Значение  	= Реквизит.Тип.ПривестиЗначение(Неопределено); 
		
	КонецЦикла;  
	
	Возврат ТаблицаРеквизитов;

КонецФункции