#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда 
		Дата 		= CW_Настройки.ТекущаяДатаПользователя();
		Организация = ДанныеЗаполнения.Организация;
		ВидОперации = 0;
		
		//Табличная часть
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	1 КАК ВидДвижения,
		               |	CW_ПеревыставлениеОстатки.Контрагент КАК Контрагент,
		               |	CW_ПеревыставлениеОстатки.Договор КАК Договор,
		               |	CW_ПеревыставлениеОстатки.ПриложениеКДоговору КАК ПриложениеКДоговору,
		               |	CW_ПеревыставлениеОстатки.ДокументРасходов КАК ДокументРасходов,
		               |	CW_ПеревыставлениеОстатки.Грузоперевозка КАК Грузоперевозка,
		               |	CW_ПеревыставлениеОстатки.Номенклатура КАК Номенклатура,
		               |	CW_ПеревыставлениеОстатки.СтавкаНДС КАК СтавкаНДС,
		               |	CW_ПеревыставлениеОстатки.КоличествоОстаток КАК Количество,
		               |	CW_ПеревыставлениеОстатки.ВсегоОстаток КАК Всего,
		               |	CW_ПеревыставлениеОстатки.СуммаОстаток КАК Сумма,
		               |	CW_ПеревыставлениеОстатки.НДСОстаток КАК НДС
		               |ИЗ
		               |	РегистрНакопления.CW_Перевыставление.Остатки(&ДатаСреза, ДокументРасходов = &ДокументРасходов) КАК CW_ПеревыставлениеОстатки";
		
		Запрос.УстановитьПараметр("ДатаСреза", 			Дата);
		Запрос.УстановитьПараметр("ДокументРасходов", 	ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблицаКорректировки.Загрузить(РезультатЗапроса.Выгрузить());	
		
	КонецЕсли;
	
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
		
КонецПроцедуры



Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = CW_Документы.ПрефиксОрганизации(Организация);
	
КонецПроцедуры

// --- 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// --- 
	
КонецПроцедуры

// --- 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для каждого Стр Из ТаблицаКорректировки Цикл
		
		Если ВидОперации = 0 Тогда
			Движение = Движения.CW_Перевыставление.Добавить();
		Иначе
			Движение = Движения.CW_ПеревыставлениеПоСтавкам.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Движение, Стр);
		Движение.Период = Дата;
		Движение.ВидДвижения = ?(Стр.ВидДвижения=0,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецЕсли


