#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 					= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 				= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 				= CW_ПодключаемыеКомандыСервер.ВидОбработкиЗаполнениеБюджетаЗаказа();

	СтруктураОписания.Наименование 				= "Пример внешней обработки заполнения бюджета заказа";
	СтруктураОписания.Описание 					= "Пример внешней обработки заполнения бюджета заказа";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	СтруктураОписания.ВыполнятьВФоне			= Истина;
	
	Возврат СтруктураОписания;
	
КонецФункции

  
// Функция - Заполнить бюджет
//
// Параметры:
//  СтруктураПараметров	 - 	Структура с ключами:
//				- Заказ 		- Ссылка на заполняемый заказ;
//				- ВерсияБюджета - Версия бюжета заказа;
//				- Обработка 	- Ссылка на текущую обработку заполнение;
// 
// Возвращаемое значение:
//   - Тип Структура с ключами: 
//			- Код - тип Число,  код ошибки;
//			- ОписаниеОшибки" - Описание ошибки;     
//
Функция ЗаполнитьБюджет(СтруктураПараметров) Экспорт
	
	// здесь нужно описать код обработчика
	
	
	
	
	Возврат Новый Структура("Код, ОписаниеОшибки", 0,"");
	
	
КонецФункции	


#КонецЕсли