
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)  
	
	ДанныеПроверки = ПроверитьВозможностьСписанияСРасчетногоСчетаНаСервере(ПараметрКоманды); 
	Если ДанныеПроверки.Отказ Тогда  
		ПоказатьПредупреждение(, ДанныеПроверки.Сообщение);
		Возврат;
	КонецЕсли;
	
	ПродлжитьВыполнениеКомандыСписанияСРасчетногоСчета(ПараметрКоманды, ПараметрыВыполненияКоманды);
	
КонецПроцедуры         

&НаКлиенте
Процедура ПродлжитьВыполнениеКомандыСписанияСРасчетногоСчета(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник", ПараметрыВыполненияКоманды.Источник);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьПодборСчетов", ЭтотОбъект, ДополнительныеПараметры);

	ПараметрыФормы = ПолучитьПараметрыФормыСписанияСРасчетногоСчета(ПараметрКоманды);    
	
	ОткрытьФорму("Обработка.CW_ПодборОперативныхДокументов.Форма", ПараметрыФормы, , , , ,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПодборСчетов(Результат, ДополнительныеПараметры) Экспорт    
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ДополнительныеПараметры.Источник.прочитать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыСписанияСРасчетногоСчета(Знач ПараметрКоманды)
	
	СтрокаТаблицы 		= ПараметрКоманды.РасшифровкаПлатежа[0];
	СвязанныйДоговор 	= ПолучитьСвязанныйДоговор(СтрокаТаблицы.ДоговорКонтрагента); 
	
	ПараметрыФормы = Новый Структура("Договор, ПриложениеКДоговору", Неопределено, Неопределено);  
	
	ПараметрыФормы.Вставить("Ссылка", 				ПараметрКоманды);
	ПараметрыФормы.Вставить("ДатаДокумента", 		ПараметрКоманды.Дата);
	ПараметрыФормы.Вставить("Организация", 			ПараметрКоманды.Организация);
	ПараметрыФормы.Вставить("Контрагент", 			ПараметрКоманды.Контрагент);
	ПараметрыФормы.Вставить("УчетныйДоговор",		СтрокаТаблицы.ДоговорКонтрагента);  
	
	Если ТипЗнч(СвязанныйДоговор)= Тип("Структура") Тогда
		ПараметрыФормы.Договор 				= СвязанныйДоговор.Договор;  
		ПараметрыФормы.ПриложениеКДоговору 	= СвязанныйДоговор.ПриложениеКДоговору;  
	КонецЕсли;  
	
	Возврат ПараметрыФормы;

КонецФункции

&НаСервере
Функция ПроверитьВозможностьСписанияСРасчетногоСчетаНаСервере(ПараметрКоманды)
	
	Ответ = Новый Структура("Отказ, Сообщение", Ложь, "");
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		Если ПараметрКоманды.ВидОперации <> Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю Тогда
			Ответ.Отказ 	= Истина;
			Ответ.Сообщение = "Подбор по оперативным документам возможен только для вида операции ""Возврат покупателю""!";
			Возврат Ответ;
		КонецЕсли;
	КонецЕсли;   
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		Если ПараметрКоманды.ВидОперации <> Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика Тогда
			Ответ.Отказ 	= Истина;
			Ответ.Сообщение = "Подбор по оперативным документам возможен только для вида операции ""Возврат от поставщика""!";
			Возврат Ответ;
		КонецЕсли;
	КонецЕсли;	
	
	ТабличнаяЧасть = ПараметрКоманды.РасшифровкаПлатежа;
	Если ТабличнаяЧасть.Количество() = 0 Тогда
		Ответ.Отказ 	= Истина;
		Ответ.Сообщение = "В табличной части необходимо добавить хотя-бы одну строку!";
		Возврат Ответ;
	КонецЕсли; 
	
	СтрокаТаблицы = ПараметрКоманды.РасшифровкаПлатежа[0];
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.ДоговорКонтрагента) Тогда
		Ответ.Отказ 	= Истина;  
		Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
			Ответ.Сообщение = "Для подбора по оперативным документам необходимо указать договор с покупателем!";
		КонецЕсли;   
		
		Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
			Ответ.Сообщение = "Для подбора по оперативным документам необходимо указать договор с поставщиком!";
		КонецЕсли;    
		Возврат Ответ;
	КонецЕсли;    
	
	СвязанныйДоговор = ПолучитьСвязанныйДоговор(СтрокаТаблицы.ДоговорКонтрагента); 
	Если ТипЗнч(СвязанныйДоговор) <> тип("Структура") Тогда
		Ответ.Отказ 	= Истина;
		Ответ.Сообщение = "Подбор по оперативным документам возможен только для договоров, связанных с договорами по грузоперевозкам!";
		Возврат Ответ;
	КонецЕсли;  
	
	Возврат Ответ;
	
КонецФункции    

&НаСервере
Функция ПолучитьСвязанныйДоговор(Знач УчетныйДоговор)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УчетныеДогоовра.Ссылка КАК Ссылка
	               |ИЗ
	               |	КритерийОтбора.CW_УчетныеДогоовра(&УчетныйДоговор) КАК CW_УчетныеДогоовра"; 
	
	Запрос.УстановитьПараметр("УчетныйДоговор", УчетныйДоговор); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		Ответ = новый Структура;
		
		Если ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
			Ответ.Вставить("Договор", 				Выборка.Ссылка);
			Ответ.Вставить("ПриложениеКДоговору", 	Неопределено);
		КонецЕсли;
		
		Если ТипЗнч(Выборка.Ссылка) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
			Ответ.Вставить("Договор", 				Выборка.Ссылка.Договор);
			Ответ.Вставить("ПриложениеКДоговору", 	Выборка.Ссылка);
		КонецЕсли;
		
		Возврат Ответ  
		
	КонецЕсли;
	
КонецФункции
