#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоПросмотрТребованиеНакладная = ПравоДоступа("Просмотр", Метаданные.Документы.ТребованиеНакладная);
	ЕстьПравоПросмотрБезвозмезднаяПередача = ПравоДоступа("Просмотр", Метаданные.Документы.ПередачаТоваров);
	ЕстьПравоПросмотрКомплектацияНоменклатуры = ПравоДоступа("Просмотр", Метаданные.Документы.КомплектацияНоменклатуры);
	ЕстьПравоПросмотрИнвентаризацияТоваров = ПравоДоступа("Просмотр", Метаданные.Документы.ИнвентаризацияТоваровНаСкладе);
	ЕстьПравоПросмотрПеремещениеТоваров = ПравоДоступа("Просмотр", Метаданные.Документы.ПеремещениеТоваров);
	ЕстьПравоПросмотрСписаниеТоваров = ПравоДоступа("Просмотр", Метаданные.Документы.СписаниеТоваров);
	ЕстьПравоПросмотрОбесценениеЗапасов = Ложь;
	ЕстьПравоПросмотрАвизоПоМПЗИсходящие =
		ОбщегоНазначенияБП.ЕстьПравоДоступаКОбъекту("Документ.АвизоМПЗИсходящее", "Просмотр");
	ЕстьПравоПросмотрАвизоПоМПЗВходящие =
		ОбщегоНазначенияБП.ЕстьПравоДоступаКОбъекту("Документ.АвизоМПЗВходящее", "Просмотр");
	
	Если Метаданные.Документы.Найти("ОбесценениеЗапасов") <> Неопределено Тогда
		УчетОбесцененияАктивов.ЕстьПравоПросмотраОбесценениеЗапасов(ЕстьПравоПросмотрОбесценениеЗапасов);
	КонецЕсли;
	
	ЕстьПравоПросмотрПередачаМатериаловВЭксплуатацию =
		ПравоДоступа("Просмотр", Метаданные.Документы.ПередачаМатериаловВЭксплуатацию);
	ЕстьПравоПросмотрСписаниеМатериаловИзЭксплуатации =
		ПравоДоступа("Просмотр", Метаданные.Документы.СписаниеМатериаловИзЭксплуатации);

	Элементы.РасходМатериалов.Видимость = ЕстьПравоПросмотрТребованиеНакладная;
	Элементы.БезвозмезднаяПередача.Видимость = ЕстьПравоПросмотрБезвозмезднаяПередача;
	Элементы.КомплектацияНоменклатуры.Видимость = ЕстьПравоПросмотрКомплектацияНоменклатуры;
	Элементы.ИнвентаризацияТоваров.Видимость = ЕстьПравоПросмотрИнвентаризацияТоваров;
	Элементы.ПеремещениеТоваровМатериалов.Видимость = ЕстьПравоПросмотрПеремещениеТоваров;
	Элементы.СписаниеТоваровМатериалов.Видимость = ЕстьПравоПросмотрСписаниеТоваров;
	Элементы.ОбесценениеЗапасов.Видимость = ЕстьПравоПросмотрОбесценениеЗапасов;
	Элементы.ПередачаМатериаловВЭксплуатацию.Видимость = ЕстьПравоПросмотрПередачаМатериаловВЭксплуатацию;
	Элементы.СписаниеМатериаловИзЭксплуатации.Видимость = ЕстьПравоПросмотрСписаниеМатериаловИзЭксплуатации;
	Элементы.АвизоПоМПЗИсходящие.Видимость = ЕстьПравоПросмотрАвизоПоМПЗИсходящие;
	Элементы.АвизоПоМПЗВходящие.Видимость = ЕстьПравоПросмотрАвизоПоМПЗВходящие;
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаСкладскиеОперации,
		"ИнвентаризацияТоваров");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаЛеваяКолонка);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаПраваяКолонка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДокументыПоСкладу(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru='Документы по складу'"));
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.СкладскиеДокументы.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаСотрудникам(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru='Передача материалов сотрудникам'"));
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.ПередачаМатериалов.ФормаСписка",
		ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходМатериалов(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ТребованиеНакладная.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура БезвозмезднаяПередача(Команда)
	
	Отбор = Новый Структура("ВидОперации",
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачаТоваров.БезвозмезднаяПередача"));
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПередачаТоваров.Форма.ФормаСпискаБезвозмезднаяПередача",
		ЭтотОбъект, ПараметрыФормы, , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияНоменклатуры(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.КомплектацияНоменклатуры.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацияТоваров(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ИнвентаризацияТоваровНаСкладе.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеТоваровМатериалов(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПеремещениеТоваров.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОприходованиеТоваров(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ОприходованиеТоваров.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписаниеТоваровМатериалов(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.СписаниеТоваров.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбесценениеЗапасов(Команда)
	
	УчетОбесцененияАктивовКлиент.ОбесценениеЗапасовПростойИнтерфейс(ЭтотОбъект, ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересортицаТоваров(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПересортицаТоваров.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаМатериаловВЭксплуатацию(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПередачаМатериаловВЭксплуатацию.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписаниеМатериаловИзЭксплуатации(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.СписаниеМатериаловИзЭксплуатации.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура АвизоПоМПЗИсходящие(Команда)
	
	УчетОбособленныхПодразделенийКлиент.ОткрытьВОкнеФормыАвизоМПЗИсходящие(ЭтотОбъект, ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура АвизоПоМПЗВходящие(Команда)
	
	УчетОбособленныхПодразделенийКлиент.ОткрытьВОкнеФормыАвизоМПЗВходящие(ЭтотОбъект, ОткрытыеФормы);
	
КонецПроцедуры

#КонецОбласти
