
Процедура ВыполнитьКонвертациюНовостей() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НовостиКомпании.Ссылка КАК Ссылка,
	               |	CW_НовостиКомпании.Содержание_RU КАК Содержание_RU,
	               |	CW_НовостиКомпании.Содержание_EN КАК Содержание_EN
	               |ИЗ
	               |	Справочник.CW_НовостиКомпании КАК CW_НовостиКомпании";  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовостьОбъект = Выборка.Ссылка.ПолучитьОбъект();   
		
		ФорматированныйДокумент_RU = новый ФорматированныйДокумент;  
		ФорматированныйДокумент_RU.УстановитьHTML(Выборка.Содержание_RU, новый Структура);
		
		ФорматированныйДокумент_EN = новый ФорматированныйДокумент;  
		ФорматированныйДокумент_EN.УстановитьHTML(Выборка.Содержание_EN, новый Структура);

		ХранилищеСодержания = Новый Структура;
		ХранилищеСодержания.Вставить("ru", ФорматированныйДокумент_RU);
		ХранилищеСодержания.Вставить("en", ФорматированныйДокумент_EN);   
		
		НовостьОбъект.ХранилищеСодержания = новый ХранилищеЗначения(ХранилищеСодержания); 
		НовостьОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьАктуальныеНовости(Пользователь, Язык="ru") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НовостиКомпанииСписокПользователей.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ОбщиеНовости
	               |ИЗ
	               |	Справочник.CW_НовостиКомпании.СписокПользователей КАК CW_НовостиКомпанииСписокПользователей
	               |ГДЕ
	               |	CW_НовостиКомпанииСписокПользователей.ПользовательЛКК = ЗНАЧЕНИЕ(Справочник.CW_ВебПользователиЛКК.ПустаяССылка)
	               |	И CW_НовостиКомпанииСписокПользователей.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И CW_НовостиКомпанииСписокПользователей.Ссылка.ДатаНовости <= &ДатаНовости
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_НовостиКомпанииСписокПользователей.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_НовостиПользователя
	               |ИЗ
	               |	Справочник.CW_НовостиКомпании.СписокПользователей КАК CW_НовостиКомпанииСписокПользователей
	               |ГДЕ
	               |	CW_НовостиКомпанииСписокПользователей.ПользовательЛКК = &Пользователь
	               |	И CW_НовостиКомпанииСписокПользователей.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОбщиеНовости.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_НовостиДляОтображения
	               |ИЗ
	               |	ВТ_ОбщиеНовости КАК ВТ_ОбщиеНовости
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_НовостиПользователя.Ссылка
	               |ИЗ
	               |	ВТ_НовостиПользователя КАК ВТ_НовостиПользователя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТ_НовостиДляОтображения.Ссылка) КАК Ссылка,
	               |	ВТ_НовостиДляОтображения.Ссылка.ДатаНовости КАК Дата,
	               |	ВЫБОР
	               |		КОГДА &Язык = ""en""
	               |			ТОГДА ВТ_НовостиДляОтображения.Ссылка.Тема_EN
	               |		ИНАЧЕ ВТ_НовостиДляОтображения.Ссылка.Тема_RU
	               |	КОНЕЦ КАК Тема,
	               |	ВТ_НовостиДляОтображения.Ссылка.Архив КАК Архив,
	               |	ВТ_НовостиДляОтображения.Ссылка.Важность КАК Важность,
	               |	ВЫБОР
	               |		КОГДА ВТ_НовостиДляОтображения.Ссылка.Архив
	               |			ТОГДА 2
	               |		КОГДА ВТ_НовостиДляОтображения.Ссылка.Важность
	               |			ТОГДА 4
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ИндексКартинки
	               |ИЗ
	               |	ВТ_НовостиДляОтображения КАК ВТ_НовостиДляОтображения
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата"; 
	
	Запрос.УстановитьПараметр("Пользователь", 	Пользователь);   
	Запрос.УстановитьПараметр("ДатаНовости", 	ТекущаяДата());   
	Запрос.УстановитьПараметр("Язык", 			Язык);   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции