&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = CW_Настройки.ОсновнаяОрганизация();
	
	ПериодОбработки = НачалоКвартала(ТекущаяДата()); 
	ДатаДокумента 	= ТекущаяДатаСеанса();
	
	УстановитьПредставлениеПериода();
	ВариантФормированияПриИзмененииНаСервере();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьПредставлениеПериода()
	
	ПериодОбработкиСтрока = Формат(ПериодОбработки,"ДФ='к ""квартал"" гггг ""г.""'");
	
КонецПроцедуры

&НаКлиенте
Процедура КвраталНазад(Команда)   
	
	ОбработатьИзменениеКварталаНаСервере("НАЗАД");
	
КонецПроцедуры

&НаКлиенте
Процедура КварталВперед(Команда)
	
	ОбработатьИзменениеКварталаНаСервере("ВПЕРЕД");
	
КонецПроцедуры   

&НаСервере
Процедура ОбработатьИзменениеКварталаНаСервере(Направление)  
	
	Если Направление = "НАЗАД" Тогда
		ПериодОбработки = НачалоКвартала(ПериодОбработки) - 1;
	ИначеЕсли Направление = "ВПЕРЕД" Тогда
		ПериодОбработки = КонецКвартала(ПериодОбработки) + 1;
	КонецЕсли;
	
	ДатаДокумента = КонецКвартала(ПериодОбработки);  
	
	УстановитьПредставлениеПериода(); 
	
КонецПроцедуры 

&НаСервере
Процедура ВариантФормированияПриИзмененииНаСервере()

	Элементы.ПодтверждениеНулевойСтавкиНДС.Видимость = (ВариантФормированияДокументов = 1);
	Элементы.ГруппаНовыйДокумент.Видимость = (ВариантФормированияДокументов = 0);

КонецПроцедуры

&НаКлиенте
Процедура ВариантФормированияПриИзменении(Элемент)
	ВариантФормированияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеНулевойСтавкиНДСНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОбора = Новый Структура;
	ПараметрыОбора.Вставить("Организация", 		Организация);
	ПараметрыОбора.Вставить("ДатаНачала", 		НачалоКвартала(ПериодОбработки));
	ПараметрыОбора.Вставить("ДатаОкончания", 	КонецКвартала(ПериодОбработки));
	
	МассивДокументов = ПодтверждениеНулевойСтавкиНДСНачалоВыбораНаСервере(ПараметрыОбора);    
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", МассивДокументов);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("Документ.ПодтверждениеНулевойСтавкиНДС.ФормаВыбора", ПараметрыОткрытияФормы, Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодтверждениеНулевойСтавкиНДСНачалоВыбораНаСервере(ПараметрыОбора)    
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодтверждениеНулевойСтавкиНДС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПодтверждениеНулевойСтавкиНДС КАК ПодтверждениеНулевойСтавкиНДС
	               |ГДЕ
	               |	ПодтверждениеНулевойСтавкиНДС.Организация = &Организация
	               |	И ПодтверждениеНулевойСтавкиНДС.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";    
	
	Запрос.УстановитьПараметр("Организация", 	ПараметрыОбора.Организация);
	Запрос.УстановитьПараметр("ДатаНачала",  	ПараметрыОбора.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",  ПараметрыОбора.ДатаОкончания);
	
	РезультатЗапрсоа = Запрос.Выполнить();
	ТаблицаЗапроса = РезультатЗапрсоа.Выгрузить();
	
	Возврат ТаблицаЗапроса.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура СформироватьДокументы(Команда)

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = НачатьФормированиеДокументовВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьФормированиеДокументов", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры 

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ВариантФормированияДокументов = 0 Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаДокумента");	
		ПроверяемыеРеквизиты.Добавить("СтатьяПрочихРасходов");	
	Иначе
		ПроверяемыеРеквизиты.Добавить("ПодтверждениеНулевойСтавкиНДС");	
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Функция НачатьФормированиеДокументовВФоне()    

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Организация",		Организация);  
	ПараметрыПроцедуры.Вставить("ДатаНачала",		НачалоКвартала(ПериодОбработки));
	ПараметрыПроцедуры.Вставить("ДатаОкончания", 	КонецКвартала(ПериодОбработки));
	
	ПараметрыПроцедуры.Вставить("ФормированиеДокументов",			ВариантФормированияДокументов);
	ПараметрыПроцедуры.Вставить("ПодтверждениеНулевойСтавкиНДС",	ПодтверждениеНулевойСтавкиНДС);     
	ПараметрыПроцедуры.Вставить("ДатаДокумента",					ДатаДокумента);     
	ПараметрыПроцедуры.Вставить("СтатьяПрочихРасходов",				СтатьяПрочихРасходов);     
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Формирование документов ""Подтверждение нулевой ставки НДС""";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_РеестрыНДС0Дополнительный.СформироватьПодтверждениеНулевойСтавкиНДС", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьФормированиеДокументов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда   
		
		ПодтверждениеНулевойСтавкиНДС = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		Если  ТипЗнч(ПодтверждениеНулевойСтавкиНДС) = Тип("ДокументСсылка.ПодтверждениеНулевойСтавкиНДС") Тогда
			ПоказатьЗначение(, ПодтверждениеНулевойСтавкиНДС);
		КонецЕсли;  
		
		ЭтаФорма.Закрыть();
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка формирования документа ""Подтверждение нулевой ставки НДС""!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры




