#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ВРег(МетаданныеОтчета.Синоним));
	
	// Установим параметры
	Если Настройки.НачалоПериода <> Дата(1,1,1) Тогда
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(Настройки.НачалоПериода));
	КонецЕсли;
	Если Настройки.КонецПериода <> Дата(1,1,1) Тогда
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(Настройки.КонецПериода));
	КонецЕсли;
	
	// формируем по показателям
	СоответствиеИменПоказателей = ПолучитьСоответствиеИменПоказателейПолям();
	Для Каждого ВыбранноеПоле Из НастройкиСКД.Выбор.Элементы Цикл
		ИмяПоказателя = СоответствиеИменПоказателей.Получить(ВыбранноеПоле.Поле);
		Если ИмяПоказателя <> Неопределено Тогда
			ВыбранноеПоле.Использование = Настройки.Показатели.Найти(ИмяПоказателя) <> Неопределено;
		КонецЕсли;
	КонецЦикла;	

	
	
	// формируем структуру отчета по группировкам
	НастройкиСКД.Структура.Очистить();
	ТекущийРодитель = НастройкиСКД.Структура;
	Для Каждого Группировка Из Настройки.Группировки Цикл
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		// --- 
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		ПолеГруппировки.Использование = Истина;
		// --- 
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование=Истина;
		// --- 
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		НС = ?(Группировка.Сортировка=Перечисления.CW_НаправлениеСортировки.ПоВозрастанию,НаправлениеСортировкиКомпоновкиДанных.Возр,НаправлениеСортировкиКомпоновкиДанных.Убыв);
		ЭлементПорядка.ТипУпорядочивания = НС;
		ЭлементПорядка.Использование = Истина;
		// --- 
		НоваяГруппировка.Имя = Группировка.Представление;
		НоваяГруппировка.Использование = Истина;
		// --- 
		ТекущийРодитель = НоваяГруппировка.Структура;
		
	КонецЦикла; 
			
	Если Настройки.ВыводитьДокументыДвижения Тогда
		элГруппировкаПоРегистратору = CW_Отчеты.ДобавитьГруппировкуКомпоновкиДанных("Регистратор", НастройкиСКД.Структура);
		ЭлементУсловногоОформления = элГруппировкаПоРегистратору.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,"Arial",,,Истина));
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
		ЭлементУсловногоОформления.ИспользоватьВЗаголовкеПолей = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
	КонецЕсли;

		
КонецПроцедуры

Функция ПолучитьСоответствиеИменПоказателейПолям()
	
	Результат = новый Соответствие;
	
	Результат.Вставить(Новый ПолеКомпоновкиДанных("КоличествоОборот"),	"КоличествоОборот");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СуммаОборот"), 		"СуммаОборот");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("НДСОборот"),			"НДСОборот");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("ВсегоОборот"), 		"ВсегоОборот");
	
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Сумма_ВалютаОборот"),	"Сумма_ВалютаОборот");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("НДС_ВалютаОборот"),		"НДС_ВалютаОборот");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Всего_ВалютаОборот"), 	"Всего_ВалютаОборот");

	Возврат Результат;
	
	
КонецФункции


#КонецЕсли