
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Элементы.Приказ.СписокВыбора.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела.Отчет_2023Кв4_Раздел42"));
	
	Если Параметры.Ключ.Пустая() Тогда
		ИндексТекущегоПриказа 	= Элементы.Приказ.СписокВыбора.Количество()-1;  
		ЭлементСписка 			= Элементы.Приказ.СписокВыбора.Получить(ИндексТекущегоПриказа);
		Объект.Приказ 			= ЭлементСписка.Значение; 
		ПриказПриИзмененииНаСервере();
	Конецесли;  
	
	Если Элементы.Приказ.СписокВыбора.Количество() = 1 Тогда
		Элементы.Приказ.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриказПриИзменении(Элемент)
	ПриказПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриказПриИзмененииНаСервере()
	
	Объект.РедакцияОтчета = Объект.Приказ.ДатаНачала;  
	ЗаполнитьНастрокйиСтрокиНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура НастройкиСтрокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры   

&НаКлиенте
Процедура НастройкиСтрокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьНастрокйиСтрокиНаСервере()   

	Объект.НастройкиСтрок.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыНерезидентовЯчейкиРаздела.Ссылка КАК ЯчейкаОтчета
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела КАК CW_ДоходыНерезидентовЯчейкиРаздела
	               |ГДЕ
	               |	CW_ДоходыНерезидентовЯчейкиРаздела.Родитель = &Родитель
	               |	И CW_ДоходыНерезидентовЯчейкиРаздела.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИмяЯчейки
	               |АВТОУПОРЯДОЧИВАНИЕ";   
	
	Запрос.УстановитьПараметр("Родитель", Объект.Приказ);   
	
	РезультатЗапроса = Запрос.Выполнить(); 

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.НастройкиСтрок.Добавить();
		НоваяСтрока.ЯчейкаОтчета = Выборка.ЯчейкаОтчета;
	КонецЦикла; 
	
КонецПроцедуры



