&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр = (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеНастроекМониторинга"));
	 
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Элементы.ПараметрыГрузоперевозок.ИзменятьСоставСтрок = Ложь;
		Элементы.ПараметрыГрузоперевозок.ТолькоПросмотр = Истина;
	КонецЕсли; 
	
	ДляРедактирования = _сф.ст_ПолучитьСвойство(Параметры, "ДляРедактирования");
	Если ДляРедактирования = Неопределено Тогда
		ДляРедактирования = Ложь;
	КонецЕсли; 
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());
	Если (ГруппаПользователя.ПолныеПрава) Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли; 
	ПараметрыГрузоперевозок.Параметры.УстановитьЗначениеПараметра("Группа", ГруппаПользователя);
	ПараметрыГрузоперевозок.Параметры.УстановитьЗначениеПараметра("ДляРедактирования", ДляРедактирования);
	
	Отбор = _сф.ст_ПолучитьСвойство(Параметры, "Отбор");
	Если Отбор <> Неопределено Тогда
		Если Отбор.Количество() > 0 Тогда
			Элементы.ПараметрыГрузоперевозок.Отображение = ОтображениеТаблицы.Список;
		КонецЕсли; 
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыГрузоперевозокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.Закрыть(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыбор(Команда)

	ЭтаФорма.Закрыть(Элементы.ПараметрыГрузоперевозок.ВыделенныеСтроки);
	
КонецПроцедуры
 