
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИмяФормыИсточникаКоманды = ПараметрыВыполненияКоманды.Источник.ИмяФормы;
	
	ЭтоДоходы = СтрНайти(ИмяФормыИсточникаКоманды,"CW_ДоходыПоГрузоперевозке") > 0;
	
	Если ЭтоДоходы Тогда
		ПравоКонтроляОригиналов = CW_ПраваДоступа.ПравоДоступно("РедактированиеВозвратаОригиналовОтКлиента");
	Иначе
		ПравоКонтроляОригиналов = CW_ПраваДоступа.ПравоДоступно("РедактированиеВозвратаОригиналовОтПоставщика");
	КонецЕсли;

	Если ПравоКонтроляОригиналов Тогда
		
		КоличествоВыделенных = ПараметрКоманды.Количество();
		ПараметрыФормы  = Новый Структура("ОригиналыПредоставлены,ДатаВозврата,КоличествоВыделенных",Ложь, ТекущаяДата(), КоличествоВыделенных);
		
		Если  КоличествоВыделенных = 1 Тогда
			ПолучитьДанныеДокумента(ПараметрКоманды[0], ПараметрыФормы);
		КонецЕсли;	
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыполнениеКоманды", ЭтотОбъект, Новый Структура("Источник,МассивСсылок",ПараметрыВыполненияКоманды.Источник, ПараметрКоманды));
		ОткрытьФорму("ОбщаяФорма.CW_ФормаВозвратаОригиналовДокументов",ПараметрыФормы,ПараметрыВыполненияКоманды.Источник,ПараметрыВыполненияКоманды.Уникальность,ПараметрыВыполненияКоманды.Окно,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ПоказатьПредупреждение(,"Недостаточно прав для редактирования возврата оригиналов документов");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыполнениеКоманды(СтруктураДанных, ДополнительныеПараметры) Экспорт
	
	Если СтруктураДанных <> Неопределено Тогда
		ОбработатьВыполнениеКомандыНаСервере(ДополнительныеПараметры.МассивСсылок,СтруктураДанных);
		ДополнительныеПараметры.Источник.Элементы.Список.Обновить();     
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеДокумента(ПараметрКоманды, ПараметрыФормы)
	
	СтруктураКонтроляОригиналов =  CW_Документы.ПолучитьПризнакНаличияИДатуВозвратаОригиналов(ПараметрКоманды);
	ПараметрыФормы.ОригиналыПредоставлены 	= СтруктураКонтроляОригиналов.ОригиналыПредоставлены;
	ПараметрыФормы.ДатаВозврата 			= СтруктураКонтроляОригиналов.ДатаПолучения;
		
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыполнениеКомандыНаСервере(МассивСсылок, СтруктураДанных)
	
	УстанавливатьПризнакНаличия = Константы.CW_УстанавливатьПризнакНаличияОригиналовДляСчетов.Получить();
	
	Для Каждого СсылкаНаДокумент из  МассивСсылок Цикл
		
		ДанныеДлязаписи = Новый Структура;
		ДанныеДлязаписи.Вставить("Ссылка"				, СсылкаНаДокумент);
		ДанныеДлязаписи.Вставить("Признак"				, СтруктураДанных.ОригиналыПредоставлены);
		ДанныеДлязаписи.Вставить("ДатаВозврата" 		, СтруктураДанных.ДатаВозврата);
		
		СтруктураПараметров = CW_Документы.ПодготовитьСтруктуруДляЗаписиналичияОригиналовДокументов(ДанныеДлязаписи);

		CW_Документы.УстановитьПризнакНаличияИдатуВозвратаОригиналов(СтруктураПараметров);
		
		ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(СсылкаНаДокумент);
		
		Если НЕ ДанныеСрокаОплаты.РучноеРедактирование 
			и СтруктураДанных.ПересчитатьСрокОплаты Тогда
			СтруктураДанныхДляРасчетаСрокаОплаты = CW_Документы.ПодготовитьДанныеДляРасчетаСрокаОплаты(СсылкаНаДокумент);
			ДатаОплаты 		= CW_Документы.РассчитатьСрокОплаты(СтруктураДанныхДляРасчетаСрокаОплаты);
			
			CW_Документы.УстановитьСрокОплаты(Новый Структура("Счет,ДатаОплаты,Описание",СсылкаНаДокумент,ДатаОплаты,""));	
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры


