
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды", 			ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды",	ПараметрыВыполненияКоманды);

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ДополнительныеПараметры); 
	
	ТекстРеестра = "реестра";
	Если ПараметрКоманды.Количество() > 1 Тогда
		ТекстРеестра = "реестров";
	КонецЕсли;
	
	ПоказатьВопрос(Оповещение, "Будет выполнен контроль заполнения "+ТекстРеестра+". Продолжить?", Режим, 0);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 
	
	НачатьКонтрольЗаполненияРеестров(ДополнительныеПараметры);
	
КонецПроцедуры  

&НаКлиенте
Процедура НачатьКонтрольЗаполненияРеестров(ДополнительныеПараметры)
	
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	
	РезультатВыполнения = НачатьКонтрольЗаполненияРеестровНаСервереВФоне(ДополнительныеПараметры.ПараметрКоманды);  
	
	ВыводитьОкноОжидания = Истина;
	Если ДополнительныеПараметры.ПараметрКоманды.Количество() = 1 Тогда
		ВыводитьОкноОжидания = Истина;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ПараметрыВыполненияКоманды.Источник);
	ПараметрыОжидания.ВыводитьОкноОжидания = ВыводитьОкноОжидания;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьКонтрольЗаполненияРеестров", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры  


&НаСервере
Функция НачатьКонтрольЗаполненияРеестровНаСервереВФоне(ПараметрКоманды)   
	
	ЗапуститьВФоне = Истина;
	Если ПараметрКоманды.Количество() = 1 Тогда
		ЗапуститьВФоне = Ложь;
	КонецЕсли;
	
	ПараметрыПроцеудры = Новый Структура;
	ПараметрыПроцеудры.Вставить("ЗаписиРеестра", ПараметрКоманды); 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.ЗапуститьВФоне 				= ЗапуститьВФоне;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= Не ЗапуститьВФоне;
	
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Контроль заполненя реестров НДС 0%";
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_РеестрыНДС0Дополнительный.КонтрольЗаполненияРеестров", ПараметрыПроцеудры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьКонтрольЗаполненияРеестров(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		ТекстПредупреждения = "Контроль заполнения реестров НДС 0% успешно завершен!";
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_РеестрыНДС0ЗаписиРеестра"));
		Оповестить("АвтоматическийКонтрольЗаполнения");
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не выполнить контроль заполнения реестра(ов) НДС 0%!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ПоказатьПредупреждение(,ТекстПредупреждения); 
	
КонецПроцедуры

