// Содержимое модуля отличается в версиях ПРОФ и КОРП.
// В версии ПРОФ отсутствует:
// - тело экспортных процедур (остаются только сигнатуры методов)
// - неэкспортные процедуры и все функции.
// Поэтому не допускается реализация в модуле экспортных функций: вместо них следует использовать процедуры с возвращаемым параметром.

Процедура ПечатьРегламентированногоОтчета(Ссылка, ИмяМакетаДляПечати, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.УведомлениеОКонтролируемыхСделках") Тогда
		
		СтандартнаяОбработка = Ложь;
		Если Не ЗначениеЗаполнено(Ссылка) Тогда 
			Возврат;
		КонецЕсли;
		
		ПараметрыПечати = Новый Структура("Уведомление", Ссылка);
		ОткрытьФорму("Документ.УведомлениеОКонтролируемыхСделках.Форма.ФормаПечатиУведомления", ПараметрыПечати);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузкаРегламентированногоОтчета(Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.УведомлениеОКонтролируемыхСделках") Тогда
		
		ПараметрыФормы = Новый Структура("Уведомление", Ссылка);
		ОткрытьФорму("Обработка.ПомощникПодготовкиУведомленияОКонтролируемыхСделках.Форма.Форма", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СозданиеРегламентированногоОтчета(Организация, Тип, СтандартнаяОбработка) Экспорт
	
	Если Тип = Тип("ДокументСсылка.УведомлениеОКонтролируемыхСделках") Тогда
		
		ПараметрыФормы = Новый Структура("Организация", Организация);
		ОткрытьФорму("Обработка.ПомощникПодготовкиУведомленияОКонтролируемыхСделках.Форма.Форма", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НалоговыеОрганыГруппОбособленныхПодразделений(Форма, Команда) Экспорт
	
	ОткрытьФорму("РегистрСведений.НастройкиУчетаНалогаНаПрибыльГруппОбособленныхПодразделений.Форма.ИФНСОтветственныхПодразделений",
		Новый Структура("Организация", Форма.ГоловнаяОрганизация),
		,
		Форма.ГоловнаяОрганизация);
	
КонецПроцедуры

Процедура СоздатьАвизоПоМПЗВходящее(СтруктураПараметров, Форма) Экспорт
	
	ОткрытьФорму("Документ.АвизоМПЗВходящее.ФормаОбъекта", СтруктураПараметров, Форма);
	
КонецПроцедуры

Процедура СоздатьАвизоПоМПЗИсходящее(СтруктураПараметров, Форма) Экспорт
	
	ОткрытьФорму("Документ.АвизоМПЗИсходящее.ФормаОбъекта", СтруктураПараметров, Форма);
	
КонецПроцедуры

// См. РегламентированнаяОтчетностьКлиентПереопределяемый.ДобавитьПрикладныеФормыОтправкаОтчетов
Процедура ДобавитьПрикладныеФормыОтправкаОтчетов(ИменаФорм) Экспорт
	
	ИменаФорм.Добавить("Обработка.ДекларацииНалогНаПрибыльОбособленныеПодразделения.Форма.Форма");
	
КонецПроцедуры

// Открывает форму документа "АвизоОСИсходящее"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
//   СтруктураПараметров - Структура - параметры для инициализации открываемой формы
Процедура ОткрытьАвизоОСИсходящее(Форма, СтруктураПараметров) Экспорт
	
	ОткрытьФорму("Документ.АвизоОСИсходящее.ФормаОбъекта", СтруктураПараметров, Форма);
	
КонецПроцедуры

// Открывает форму документа "АвизоОСВходящее"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
//   СтруктураПараметров - Структура - параметры для инициализации открываемой формы
Процедура ОткрытьАвизоОСВходящее(Форма, СтруктураПараметров) Экспорт
	
	ОткрытьФорму("Документ.АвизоОСВходящее.ФормаОбъекта", СтруктураПараметров, Форма);
	
КонецПроцедуры

// Открывает форму списка документа "АвизоПрочееИсходящее"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
Процедура ОткрытьАвизоПрочиеИсходящие(Форма) Экспорт
	
	ОткрытьФорму("Документ.АвизоПрочееИсходящее.ФормаСписка", , Форма);
	
КонецПроцедуры

// Открывает форму списка документа "АвизоПрочееВходящее"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
Процедура ОткрытьАвизоПрочиеВходящие(Форма) Экспорт
	
	ОткрытьФорму("Документ.АвизоПрочееВходящее.ФормаСписка", , Форма);
	
КонецПроцедуры

// Открывает форму списка документа "АвизоОСИсходящее"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
//   ОткрытыеФормы - Соответствие - коллекция открытых форм для предотвращения повторного открытия
Процедура ОткрытьВОкнеФормыАвизоОСИсходящие(Форма, ОткрытыеФормы) Экспорт
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.АвизоОСИсходящее.ФормаСписка",
		Форма, , , ОткрытыеФормы);
	
КонецПроцедуры

// Открывает форму списка документа "АвизоОСВходящее"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
//   ОткрытыеФормы - Соответствие - коллекция открытых форм для предотвращения повторного открытия
Процедура ОткрытьВОкнеФормыАвизоОСВходящие(Форма, ОткрытыеФормы) Экспорт
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.АвизоОСВходящее.ФормаСписка",
		Форма, , , ОткрытыеФормы);
	
КонецПроцедуры

// Открывает форму списка документа "АвизоРасчетыИсходящее"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
//   ОткрытыеФормы - Соответствие - коллекция открытых форм для предотвращения повторного открытия
Процедура ОткрытьВОкнеФормыАвизоРасчетыИсходящие(Форма, ОткрытыеФормы) Экспорт
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.АвизоРасчетыИсходящее.ФормаСписка",
		Форма, , , ОткрытыеФормы);
	
КонецПроцедуры

// Открывает форму списка документа "АвизоРасчетыВходящее"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
//   ОткрытыеФормы - Соответствие - коллекция открытых форм для предотвращения повторного открытия
Процедура ОткрытьВОкнеФормыАвизоРасчетыВходящие(Форма, ОткрытыеФормы) Экспорт
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.АвизоРасчетыВходящее.ФормаСписка",
		Форма, , , ОткрытыеФормы);
	
КонецПроцедуры

// Открывает форму списка документа "АвизоМПЗИсходящее"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
//   ОткрытыеФормы - Соответствие - коллекция открытых форм для предотвращения повторного открытия
Процедура ОткрытьВОкнеФормыАвизоМПЗИсходящие(Форма, ОткрытыеФормы) Экспорт
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.АвизоМПЗИсходящее.ФормаСписка",
		Форма, , , ОткрытыеФормы);
	
КонецПроцедуры

// Открывает форму списка документа "АвизоМПЗВходящее"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
//   ОткрытыеФормы - Соответствие - коллекция открытых форм для предотвращения повторного открытия
Процедура ОткрытьВОкнеФормыАвизоМПЗВходящие(Форма, ОткрытыеФормы) Экспорт
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.АвизоМПЗВходящее.ФормаСписка",
		Форма, , , ОткрытыеФормы);
	
КонецПроцедуры