&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсключатьВнутрихолдинговыеВзаиморасчеты = CW_Настройки.ПолучитьНастройкуПользователя(,"ИсключатьВнутрихолдинговыеВзаиморасчеты");
	
	_ВосстановитьСтандартныеНастройки();
	_ВосстановитьСеансовуюНастройку();
	
	CW_ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	
	Элементы.ПолучитьРасходыПоПутевымЛистам.Доступность = ПорядокОтражения <> 2 и ВариантФормирования = 0;

	Если Не CW_ВалютаРегламентированногоУчетаРубль Тогда
		ВариантФормирования = 1;
	КонецЕсли;
	
	//Работа с буфером обмена
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена());
	//Работа с буфером обмена
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяДата());
		КонецПериода  = КонецМесяца(ТекущаяДата());
	КонецЕсли;	
	
	//Если вдруг по каким то причинам показатели не заполнены
	Если Показатели.Количество() = 0 Тогда
		Показатели.Добавить("Сумма", "Сумма", Истина);
		Показатели.Добавить("НДС", "НДС", Истина);
		Показатели.Добавить("Всего", "Всего", Истина);	
		Показатели.Добавить("ВсегоВал", "Всего Вал.", Истина);	
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	
	ВариантМодифицирован = Ложь;		
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	
	//БухгалтерскиеОтчетыКлиент
	БухгалтерскиеОтчетыКлиент.НачатьРасчетСуммыВыделенныхЯчеек(
		Элементы.Результат,
		ЭтотОбъект,
		"Подключаемый_РезультатПриАктивизацииПодключаемый");
	//---БухгалтерскиеОтчетыКлиент

КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	об = РеквизитФормыВЗначение("Отчет");
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(об.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("НачалоПериода", НачалоПериода);
			СеансоваяНастройка.Свойство("КонецПериода", КонецПериода);
			СеансоваяНастройка.Свойство("Показатели", Показатели);
			СеансоваяНастройка.Свойство("ВариантФормирования", ВариантФормирования);
			СеансоваяНастройка.Свойство("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
			СеансоваяНастройка.Свойство("ПорядокОтражения", ПорядокОтражения);
			СеансоваяНастройка.Свойство("ОбъединитьГруппировки", ОбъединитьГруппировки);
			СеансоваяНастройка.Свойство("ПолучитьРасходыПоПутевымЛистам", ПолучитьРасходыПоПутевымЛистам);
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("НачалоПериода", НачалоПериода);
	СтруктураНастройки.Вставить("КонецПериода", КонецПериода);
	СтруктураНастройки.Вставить("Показатели", Показатели);
	СтруктураНастройки.Вставить("Группировки", Группировки.Выгрузить());
	СтруктураНастройки.Вставить("ВариантФормирования", ВариантФормирования);
	СтруктураНастройки.Вставить("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
	СтруктураНастройки.Вставить("ПорядокОтражения", ПорядокОтражения);
	СтруктураНастройки.Вставить("ОбъединитьГруппировки", ОбъединитьГруппировки);
	СтруктураНастройки.Вставить("ПолучитьРасходыПоПутевымЛистам", ПолучитьРасходыПоПутевымЛистам);
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	_Настройка(Истина);
	
	СформироватьОтчет();	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	
	Показатель = Ложь;
	Для Каждого Стр из Показатели Цикл
		Показатель = ?(Стр.Пометка, Истина, Показатель);
	КонецЦикла;
	
	Если НЕ Показатель Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного показателя!");
		Возврат;		
	КонецЕсли;
	
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	ОбработатьОтчет();
	
	// --- 
	_СохранитьСеансовуюНастройку();

КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ВариантФормирования", 		ВариантФормирования);
	Настройки.Вставить("ВариантПериодаОтчета", 		ВариантПериодаОтчета);
	Настройки.Вставить("НачалоПериода", 			НачалоПериода);
	Настройки.Вставить("КонецПериода", 				КонецПериода);
	Настройки.Вставить("Показатели", 				Показатели);
	Настройки.Вставить("Группировки",  				Группировки.Выгрузить());
	Настройки.Вставить("ИсключатьВнутрихолдинговыеВзаиморасчеты", 				ИсключатьВнутрихолдинговыеВзаиморасчеты);
	Настройки.Вставить("ВыводитьДокументыДвижения",  	 	ВыводитьДокументыДвижения);
	Настройки.Вставить("ПорядокОтражения",  	 			ПорядокОтражения);
	Настройки.Вставить("ОбъединитьГруппировки",  			ОбъединитьГруппировки);
	Настройки.Вставить("ПолучитьРасходыПоПутевымЛистам",  	ПолучитьРасходыПоПутевымЛистам);
	
	Возврат ПоместитьВоВременноеХранилище(Настройки,ЭтаФорма.УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Расход", "Расход", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Доход", "Доход", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Прибыль", "Прибыль", ГоризонтальноеПоложение.Центр);	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сумма", "Сумма", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "НДС", "НДС", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Всего", "Всего", ГоризонтальноеПоложение.Центр);
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(Результат,"Анализ прибыли за период");
	//УправлениеКолонтитулами
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть=Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка = Ложь;
	Иначе
		Если Элементы.ГруппаНастройкиОтчета.Видимость Тогда
			Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка = Ложь;
		Иначе
			Элементы.ГруппаНастройкиОтчета.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка = Истина;
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	
	Если (Ответ <> Неопределено) Тогда
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда
		СписокПолей.Добавить("Регистратор");
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
    СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	
    ДоступныеДействия = Новый Массив();
    ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
    
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		Если (НовыеНастройки <> Неопределено) Тогда
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	Диалог.Период.ДатаНачала = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	
	Если (ОтветПериод <> Неопределено) Тогда
		НачалоПериода = ОтветПериод.ДатаНачала;
		КонецПериода  = ОтветПериод.ДатаОкончания;
		Период = ОтветПериод;
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("Показатели", Показатели);
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); 
	Настройки.ДополнительныеСвойства.Вставить("НачалоПериода", НачалоПериода);
	Настройки.ДополнительныеСвойства.Вставить("КонецПериода", КонецПериода);
	Настройки.ДополнительныеСвойства.Вставить("ИсключатьВнутрихолдинговыеВзаиморасчеты", ИсключатьВнутрихолдинговыеВзаиморасчеты);
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если НЕ СформироватьПриОткрытии Тогда
		CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма,Настройки);
	КонецЕсли;

	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Очистить();
	Настройки.ДополнительныеСвойства.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОтраженияПриИзменении(Элемент)
	
	Если ПорядокОтражения = 2 Тогда
		ПолучитьРасходыПоПутевымЛистам = Ложь;
	КонецЕсли;
	
	 УстановитьДоступностьЭлементаПолучитьрасходПоПутевымЛистам();
	 
КонецПроцедуры

&НаКлиенте
Процедура ВариантФормированияПриИзменении(Элемент)
	
	Если ВариантФормирования = 1 Тогда
		ПолучитьРасходыПоПутевымЛистам = Ложь;
	КонецЕсли;
	УстановитьДоступностьЭлементаПолучитьрасходПоПутевымЛистам();
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступностьЭлементаПолучитьрасходПоПутевымЛистам()
	
	Элементы.ПолучитьРасходыПоПутевымЛистам.Доступность = ПорядокОтражения <> 2 и ВариантФормирования = 0;
	
КонецПроцедуры

//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.КомандаБуфераОбменаВставить.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуфераОбменаВставить(Команда)
	КоличествоСтрок = БуфераОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БуфераОбменаВставитьНаСервере()
	
	Возврат CW_РаботаСБуферомОбмена.УстановитьОтборКомпановщикаПоБуферуОбмена(Отчет.КомпоновщикНастроек);

КонецФункции
//Работа с буфером обмена

//БухгалтерскиеОтчетыКлиент
&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Результат, Элементы.Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры
//---БухгалтерскиеОтчетыКлиент
