#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ПростойИнтерфейсКлиент.ПараметрыОткрытияЗависимыхФорм(ПараметрыВыполненияКоманды.Источник);
	Если Не ПараметрыФормы.СформироватьПриОткрытии Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормы, БазовыеРеквизитыЗначенияПоУмолчанию());
	КонецЕсли;
	
	ОткрытьФорму("Отчет.СверкаДекларацийПрибыльНДС.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция БазовыеРеквизитыЗначенияПоУмолчанию()
	
	Возврат БухгалтерскиеОтчеты.БазовыеРеквизитыЗначенияПоУмолчанию();
	
КонецФункции

#КонецОбласти