
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	CW_ШаблоныДокументовСерверВызовСервера.ПриСозданииФормыСпискаНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);  
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры

&НаКлиенте
Процедура СписокНазначенийПриАктивизацииСтроки(Элемент)  
	
	ТекущиеДанные = Элементы.СписокНазначений.ТекущиеДанные;
	
	Если ТекущееНазначение <> ТекущиеДанные.Значение Тогда
		ПодключитьОбработчикОжидания("ЗаполнитьДеревоПараметров",0.1,Истина);  
		ТекущееНазначение = ТекущиеДанные.Значение;
	Конецесли;

КонецПроцедуры      

&НаКлиенте
Процедура ЗаполнитьДеревоПараметров() 
	
	УстановитьОтборСписка();
	
КонецПроцедуры 	 

&НаСервере
Процедура УстановитьОтборСписка()   
	
	ТекущаяСтрока = Элементы.СписокНазначений.ТекущаяСтрока;
	ЭлементСписка = СписокНазначений.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Список.Отбор.Элементы.Очистить();

	НовыйЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НазначениеШаблона");
	НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение 	= ЭлементСписка.Значение;
	НовыйЭлементОтбора.Использование 	= Истина; 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПодборФункций(Команда)
	
	ЗначениеПустойСсылки = ПолучитьЗначениеПустойСсылкиНазначениеШаблонов(); 
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("НазначениеШаблонаПустаяСсылка", ЗначениеПустойСсылки);
	
	ОткрытьФорму("Справочник.CW_ПредопреленныеФункцииШаблоновДокументов.Форма.ФормаПодбора", ПараметрыПодбора, ЭтаФорма);

КонецПроцедуры  

&НаСервере
Функция ПолучитьЗначениеПустойСсылкиНазначениеШаблонов()
	
	ЭлементСписка = СписокНазначений.НайтиПоИдентификатору(Элементы.СписокНазначений.ТекущаяСтрока);
	Возврат ЭлементСписка.Значение.ЗначениеПустойСсылки
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранныеЭлементы, ИсточникВыбора)
	
	ОбработкаВыбораНаСервере(ВыбранныеЭлементы);	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранныеЭлементы)
	
	ЭлементСписка 		= СписокНазначений.НайтиПоИдентификатору(Элементы.СписокНазначений.ТекущаяСтрока);
	НазначениеШаблона 	= ЭлементСписка.Значение;   
	
	СоответствиеГрупп 	= Новый Соответствие;

	Для Каждого ПредопределеннаяФункция из ВыбранныеЭлементы Цикл
		
		ДеревоРодителей = Новый ДеревоЗначений;
		ДеревоРодителей.Колонки.Добавить("Ссылка");
		
		ЗаполнитьДеревоРодителейПоСсылке(ПредопределеннаяФункция, ДеревоРодителей);
		СоздатьДеревоЭлементов(ДеревоРодителей.Строки, СоответствиеГрупп); 
		
		НайденнаяСсылка 	= НайтиМакросШаблонаПоПредопределеннойФункции(НазначениеШаблона, ПредопределеннаяФункция);
		Если НайденнаяСсылка = Неопределено Тогда
			ОбъетШаблдон = Справочники.CW_МакросыШаблоновДокументов.СоздатьЭлемент();   
		Иначе
			ОбъетШаблдон = НайденнаяСсылка.ПолучитьОбъект();
		КонецЕсли;  
		
		ОбъетШаблдон.Наименование 				= СокрЛП(ПредопределеннаяФункция);
		ОбъетШаблдон.Родитель 					= СоответствиеГрупп.Получить(ПредопределеннаяФункция.Родитель);
		ОбъетШаблдон.НазначениеШаблона  		= НазначениеШаблона;    
		ОбъетШаблдон.Идентификатор				= ПредопределеннаяФункция.ИдентификаторФункции;    
		ОбъетШаблдон.Рассчитывается   			= 2;    
		ОбъетШаблдон.Формула   					= ПредопределеннаяФункция.ИмяМетода;    
		ОбъетШаблдон.ПредопределеннаяФункция 	= ПредопределеннаяФункция;    
		ОбъетШаблдон.Записать();   
		
	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения(); 
	Элементы.Список.Обновить();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДеревоРодителейПоСсылке(Ссылка, ДеревоРодителей)
	
	ТекущаяСтрока = Элементы.СписокНазначений.ТекущаяСтрока;
	ЭлементСписка = СписокНазначений.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ПредопреленныеФункцииШаблоновДокументовДоступныеНазначенияШаблонов.Ссылка КАК Ссылка,
	               |	CW_ПредопреленныеФункцииШаблоновДокументовДоступныеНазначенияШаблонов.Ссылка.ЭтоГруппа КАК ЭтоГруппа
	               |ИЗ
	               |	Справочник.CW_ПредопреленныеФункцииШаблоновДокументов.ДоступныеНазначенияШаблонов КАК CW_ПредопреленныеФункцииШаблоновДокументовДоступныеНазначенияШаблонов
	               |ГДЕ
	               |	CW_ПредопреленныеФункцииШаблоновДокументовДоступныеНазначенияШаблонов.НазначениеШаблона = &НазначениеШаблона
	               |	И CW_ПредопреленныеФункцииШаблоновДокументовДоступныеНазначенияШаблонов.Ссылка = &Ссылка
	               |ИТОГИ ПО
	               |	Ссылка ТОЛЬКО ИЕРАРХИЯ";    
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	Запрос.УстановитьПараметр("НазначениеШаблона", ЭлементСписка.Значение);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДеревоЗначений = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);

	ЗаполнитьДеревоРодителей(ДеревоЗначений.Строки, ДеревоРодителей.Строки); 
	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьДеревоРодителей(СтрокиИсточника, СтрокиПриемника)
	
	Для Каждого СтрокаИсточника из СтрокиИсточника Цикл  
		Если Не СтрокаИсточника.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СтрокиПриемника.Добавить();
		НоваяСтрока.Ссылка 			= СтрокаИсточника.Ссылка;
		
		Если СтрокаИсточника.Строки.Количество() > 0 Тогда
			ЗаполнитьДеревоРодителей(СтрокаИсточника.Строки, НоваяСтрока.Строки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДеревоЭлементов(СтрокиДерева, СоответствиеГрупп)
	
	Для Каждого СтрокаДерева из СтрокиДерева Цикл
		
		Если СтрокаДерева.Родитель = Неопределено Тогда
			Родитель = ПредопределенноеЗначение("Справочник.CW_МакросыШаблоновДокументов.ПустаяСсылка");
		Иначе
			Родитель =  СоответствиеГрупп.Получить(СтрокаДерева.Родитель.Ссылка);
		КонецЕсли;
		
		ГруппаСправочника = СоздатьГруппуСправочника(СтрокаДерева.Ссылка, Родитель);
		СоответствиеГрупп.Вставить(СтрокаДерева.Ссылка, ГруппаСправочника); 
		
		Если СтрокаДерева.Строки.Количество() > 0 Тогда 
			СоздатьДеревоЭлементов(СтрокаДерева.Строки, СоответствиеГрупп);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьГруппуСправочника(ПредопределеннаяФункция, Родитель)  
	
	ЭлементСписка 		= СписокНазначений.НайтиПоИдентификатору(Элементы.СписокНазначений.ТекущаяСтрока);
	НазначениеШаблона 	= ЭлементСписка.Значение;   
	
	НайденнаяСсылка 	= НайтиМакросШаблонаПоПредопределеннойФункции(НазначениеШаблона, ПредопределеннаяФункция);
	Если НайденнаяСсылка = Неопределено Тогда
		ОбъектРодитель = Справочники.CW_МакросыШаблоновДокументов.СоздатьГруппу();
		ОбъектРодитель.Наименование					= СокрЛП(ПредопределеннаяФункция);
		ОбъектРодитель.Родитель						= Родитель;
		ОбъектРодитель.НазначениеШаблона			= НазначениеШаблона;   
		ОбъектРодитель.ПредопределеннаяФункция		= ПредопределеннаяФункция;   
		ОбъектРодитель.Записать(); 
		Возврат ОбъектРодитель.Ссылка;
	КонецЕсли;  
	
	Возврат НайденнаяСсылка;
	
КонецФункции

&НаСервере
Функция НайтиМакросШаблонаПоПредопределеннойФункции(НазначениеШаблона, ПредопределеннаяФункция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_МакросыШаблоновДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_МакросыШаблоновДокументов КАК CW_МакросыШаблоновДокументов
	               |ГДЕ
	               |	CW_МакросыШаблоновДокументов.НазначениеШаблона = &НазначениеШаблона
	               |	И CW_МакросыШаблоновДокументов.ПредопределеннаяФункция = &ПредопределеннаяФункция"; 
	
	Запрос.УстановитьПараметр("НазначениеШаблона", 			НазначениеШаблона);
	Запрос.УстановитьПараметр("ПредопределеннаяФункция", 	ПредопределеннаяФункция); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;   
	
	Возврат Неопределено;
	
КонецФункции



