#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Счёт";
	СтруктураОписания.Описание 					= "Счёт";
	СтруктураОписания.Версия					= "3.2.8.1";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.15.8";
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерИсправления]", 			"Номер исправлния", 			"ПолучитьНомерИсправления(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления
	
	Возврат СтруктураОписания;
	
КонецФункции

//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьНомерИсправления(ПараметрыПроцедуры) Экспорт
	
	НомерИсправления  = ?(ЗначениеЗаполнено(ПараметрыПроцедуры.НомерИсправления), " (испр. "+Формат(ПараметрыПроцедуры.НомерИсправления,"ЧГ=0")+")","");
	Возврат СокрЛП(НомерИсправления);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления

Процедура Регистрация(Ссылка) Экспорт 
	
	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_ДоходыПоГрузоперевозке");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "Счёт"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		
	
	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);
	
КонецПроцедуры

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	Если СсылкаНаОбъект.Корректировка Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если СсылкаНаОбъект.ФормируетсяСчет Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат СсылкаНаОбъект.ФормируетсяАкт И ЗначениеЗаполнено(СсылкаНаОбъект.Счет);
	
КонецФункции

Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт
	
	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	КонецЕсли; 
	
	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();
	
	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхСчета", Истина);
	Если КоличествоЭксземпляров <> Неопределено Тогда 
		РезультатПечати.Параметры.Количество = КоличествоЭксземпляров;
		РезультатПечати.Параметры.Печать 	 = (КоличествоЭксземпляров <> 0);  
	Иначе
		РезультатПечати.Параметры.Количество = 2;
		РезультатПечати.Параметры.Печать 	 = Истина;  
	КонецЕсли;  
	
	Если НЕ СсылкаНаОбъект.ФормируетсяСчет И СсылкаНаОбъект.ФормируетсяАкт И ЗначениеЗаполнено(СсылкаНаОбъект.Счет) Тогда
		Ссылка = СсылкаНаОбъект.Счет;
	Иначе
		Ссылка = СсылкаНаОбъект;
	КонецЕсли; 
	
	БазоваяВалюта = CW_Настройки.ВалютаРегламентированногоУчета();
	
	//----
	//Проверим наличие/отсутсвте грузоперевозок в строках документа,
	//если хотбя в одной пустая, значит это "Предварительный счет"
	
	ЭтоПредварительныйсчет = ПроверитьТипСчета(Ссылка);
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				СсылкаНаОбъект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		СсылкаНаОбъект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, СсылкаНаОбъект.Дата);
	
	// ---------------------------------------------------------------------------- 
	// формируем представление
	Если (ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
		НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка.ВедомыйСчет);
		ДатаДокумента = Ссылка.ВедомыйСчет.Дата;
	Иначе
		НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерСчета", "ДатаСчета");
		ДатаДокумента = Ссылка.ДатаСчета;
	КонецЕсли; 
	//	ПредставлениеДокумента     = "Счет №"    + НомерДокумента+" от "  + Формат(ДатаДокумента,"ДФ=dd.MM.yyyy");
	ПредставлениеДокументаАнгл =?(ЭтоПредварительныйсчет,"PRELIMINARY ","")+ "INVOICE № " + НомерДокумента+" of  " + Формат(ДатаДокумента,"ДФ=dd.MM.yyyy");
	
	// --- 
	
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(ПредставлениеДокументаАнгл));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НомерДокумента",	НомерДокумента);
	ПараметрыПроцедуры.Вставить("ДатаДокумента",	ДатаДокумента);
	ПараметрыПроцедуры.Вставить("НомерИсправления",	СсылкаНаОбъект.НомерИсправления);
	
	РезультатПечати.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы
	
	// ---------------------------------------------------------------------------- 
	// формируем печатную форму
	
	ТД=Новый ТабличныйДокумент;
	ТД.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТД.АвтоМасштаб=Истина;
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= ДатаДокумента;
	СтруктураПараметров.Договор 			= Ссылка.Договор;
	СтруктураПараметров.ПриложениеКДоговору = Ссылка.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
	
	ПараметрыУчетнойПолитики = CW_Настройки.ПараметрыУчетнойПолитики(Ссылка.Дата, Ссылка.Организация);
	Макет = ПолучитьМакет("МакетСчет");
	
	НаименованияКонтагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент,ДатаДокумента);
	КонтагентНаименованиеПолное 		= НаименованияКонтагента.ПолноеНаименование;
	КонтагентНаименованиеСокращенное 	= НаименованияКонтагента.СокращенноеНаименование;
	
	КонтагентНаименованиеВШапку =  КонтагентНаименованиеПолное;
	
	Если НЕ ЗначениеЗаполнено(КонтагентНаименованиеВШапку) Тогда
		КонтагентНаименованиеВШапку =  КонтагентНаименованиеСокращенное;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КонтагентНаименованиеВШапку) Тогда
		КонтагентНаименованиеВШапку =  ПараметрыДоговора.НаименованиеКонтрагентаАнгл;
	КонецЕсли;
	
	Если Ссылка.Контрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
		ИННКонтрагента  = "ИНН: "+СокрЛП(Ссылка.Контрагент.ИНН);
	Иначе
		ИННКонтрагента  = "VAT No. " + СокрЛП(Ссылка.Контрагент.НалоговыйНомер);
	КонецЕсли;
	
	НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(Ссылка.Организация,ДатаДокумента);
	
	ОрганизацияНаименованиеПолное 		= НаименованияОрганизации.ПолноеНаименование;
	ОрганизацияНаименованиеСокращенное 	= НаименованияОрганизации.СокращенноеНаименование;
	
	// ---------------------------------------------------------------------------- 
	// язык печати документов : 0=русский 1=английский 2=двуязычный
	// ---------------------------------------------------------------------------- 
	
	//--------
	// шапка
	обл = Макет.ПолучитьОбласть("Шапка");
	стр = ПараметрыУчетнойПолитики.НаименованиеОрганизацииАнгл+Символы.ПС+ПараметрыДоговора.АдресОрганизацииАнгл;
	обл.Параметры.ТекстШапки = стр;
	ТД.Вывести(обл);
	
	облОтступ = Макет.ПолучитьОбласть("Отступ");
	ТД.Вывести(облОтступ);
	
	//--------
	// верхняя часть
	обл = Макет.ПолучитьОбласть("ВерхняяЧасть");
	
	обл.Параметры.НомерДатаДокумента = ПредставлениеДокументаАнгл;
	//обл.Параметры.Договор = "Contract №"+Ссылка.Договор.НомерДоговора+" оf  "+Формат(Ссылка.Договор.ДатаДоговора, "ДФ=dd.MM.yyyy");
	обл.Параметры.Покупатель = "Customer: "+КонтагентНаименованиеВШапку+", "+ИННКонтрагента+", "+ПараметрыДоговора.АдресАнгл;
	ТД.Вывести(обл);
	
	//----------------------
	// дополнительно
	Если ЭтоПредварительныйсчет Тогда
		// Для предварительного счета всегда всегда выводим дополнение шапки, если оно там есть;
		ТекстДополнительно = ПолучитьТекстДополнения(Ссылка);
		Если ЗначениеЗаполнено(ТекстДополнительно) Тогда
			ОблДоп = Макет.ПолучитьОбласть("Дополнительно");
			ОблДоп.Параметры.Дополнительно = СокрЛП(ТекстДополнительно);
			ТД.Вывести(ОблДоп);
		КонецЕсли;
	Иначе
		Если ПараметрыДоговора.ВыводитьДополнениевШапкуСчета Тогда
			ОблДоп = Макет.ПолучитьОбласть("Дополнительно");
			ОблДоп.Параметры.Дополнительно = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеСчетаАнгл, Ссылка, Неопределено, Ссылка.Услуги);
			ТД.Вывести(ОблДоп);
		КонецЕсли;	
	КонецЕсли;
	
	облОтступ = Макет.ПолучитьОбласть("Отступ");
	ТД.Вывести(облОтступ);
	
	
	//--------
	//  шапка таблицы, строки таблицы, подвал таблицы
	Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
		облСтрокаТаблицы 	= Макет.ПолучитьОбласть("СтрокаТаблицыБезНДС");
		облПодвалТаблицы	= Макет.ПолучитьОбласть("ПодвалТаблицыБезНДС");
		облПодвалТаблицыНДС = Макет.ПолучитьОбласть("ПодвалТаблицыБезНДССуммаНДС");
	Иначе	
		облСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		облПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	КонецЕсли;	
	Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
		облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_АнглБезНДС");
		облПодвалТаблицы.Параметры.НадписьИТОГО = "TOTAL:";
		облПодвалТаблицыНДС.Параметры.НадписьНДС = "INCLUDING VAT:";
	Иначе	
		облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Англ");
		облПодвалТаблицы.Параметры.НадписьИТОГО = "TOTAL:";
		стрбезНДС = "Without VAT";
	КонецЕсли;	
	
	облШапкаТаблицы.Параметры.Заполнить(Новый Структура("Валюта", Ссылка.Валюта));
	ТД.Вывести(облШапкаТаблицы);
	
	// ---------------------------------------------------------------------------- 
	// определяем таблицу услуг для вывода
	
	ТаблицаУслуг = CW_Финансы.ПолучитьУслугиДокумента(Ссылка);
	ТаблицаУслуг.Колонки.Добавить("ПредставлениеГП");
	Для Каждого СтрТУ из ТаблицаУслуг Цикл
		СтрТУ.ПредставлениеГП = СокрЛП(СтрТУ.Грузоперевозка.CW_Представление);
	КонецЦикла;	
	Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов) И ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов.СворачиватьПоГрузоперевозкам Тогда
		ТЗ_Усл = ТаблицаУслуг.Скопировать();
		ТЗ_Ит  = ТаблицаУслуг.Скопировать();
		ТЗ_Ит.Очистить();
		ТЗ_ГП  = ТЗ_Усл.Скопировать();
		ТЗ_ГП.Свернуть("ПредставлениеГП");
		ТЗ_ГП.Колонки.Добавить("Представление");
		ТЗ_ГП.Колонки.Добавить("НомСтр");
		ТЗ_ГП.Колонки.Добавить("Итого");
		НомСтр = 0;
		Для Каждого Стр_ГП из ТЗ_ГП Цикл
			ТЗ_Отбор = ТЗ_Усл.Скопировать(Новый Структура("ПредставлениеГП", Стр_ГП.ПредставлениеГП));
			
			Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов.ШаблонСверткиПоГрузоперевозкамАнгл, Ссылка, Неопределено, ТЗ_Отбор);
			Стр_ГП.НомСтр = НомСтр;
			Стр_ГП.Итого  = ТЗ_Отбор.Итог("Всего");
			
			CW_Печать.ПодготовитьТаблицуУслуг(ТЗ_Отбор, Ссылка, ПараметрыДоговора, "счет");
			Для Каждого Стр_Отбор из ТЗ_Отбор Цикл
				Стр_Ит = ТЗ_Ит.Добавить();
				ЗаполнитьЗначенияСвойств(Стр_Ит, Стр_Отбор);
			КонецЦикла;	
			НомСтр = НомСтр + 1 + ТЗ_Отбор.Количество();
		КонецЦикла;
		ТаблицаУслуг = ТЗ_Ит.Скопировать();
	Иначе	
		CW_Печать.ПодготовитьТаблицуУслуг(ТаблицаУслуг,Ссылка,ПараметрыДоговора,"счет");
	КонецЕсли;	
	// ----------------------------------------------------------------------------  
	
	ВсегоСтрокДляВывода = ТаблицаУслуг.Количество();
	ТекущаяСтрока = 0;
	
	// подготовим подвал и подписи
	// ---------------------------------------------------------------------------- 
	Подвал = Новый ТабличныйДокумент;
	// --- 
	Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
		Итого = _сф.Итог(Ссылка.Услуги,"Всего");
		облПодвалТаблицы.Параметры.СуммаИтого = Итого;
		облПодвалТаблицыНДС.Параметры.СуммаНДС = _сф.Итог(Ссылка.Услуги,"НДС");
	Иначе	
		облПодвалТаблицы.Параметры.Сумма = _сф.Итог(Ссылка.Услуги,"Сумма");
		Итого = _сф.Итог(Ссылка.Услуги,"Всего");
		облПодвалТаблицы.Параметры.СуммаИтого = Итого;
	КонецЕсли;	
	Подвал.Вывести(облПодвалТаблицы);
	
	СуммаНДС = _сф.Итог(Ссылка.Услуги,"НДС");
	Если СуммаНДС <> 0 Тогда 
		ТД.Вывести(облПодвалТаблицыНДС);
	КонецЕсли;
	
	// --- 
	// итого и сумма прописью
	
	// представление строки НДС
	ТаблицаНДС = Ссылка.Услуги.Выгрузить(,"СтавкаНДС,НДС");
	ТаблицаНДС.Свернуть("СтавкаНДС","НДС");
	ПредставлениеНДС = "";
	ПредставлениеНДСАнгл = "";
	СуммаНДС = _сф.Итог(Ссылка.Услуги,"НДС");
	ЕстьНДС = (СуммаНДС <> 0);
	Если (ЕстьНДС) Тогда
		
		Для каждого Стр Из ТаблицаНДС Цикл
			
			Если (Стр.СтавкаНДС = перечисления.СтавкиНДС.НДС18) Тогда
				ндс = "18%";
			ИначеЕсли (Стр.СтавкаНДС = перечисления.СтавкиНДС.НДС10) Тогда 
				ндс = "10%";
			ИначеЕсли (Стр.СтавкаНДС = перечисления.СтавкиНДС.НДС20) Тогда 
				ндс = "20%";
			Иначе
				Продолжить;
			КонецЕсли; 
			ПредставлениеНДС     = ПредставлениеНДС + ", в том числе НДС "+ндс+" - "+Формат(Стр.НДС,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Ссылка.Валюта);
			ПредставлениеНДСАнгл = ПредставлениеНДСАнгл + ", including VAT " + Формат(ТаблицаУслуг.Итог("НДС"),"ЧДЦ=2; ЧРД=.; ЧРГ=,; ЧН=0.00")+" "+?(Ссылка.Валюта.Код = "643", "rub.", Ссылка.Валюта);
			
		КонецЦикла; 
		
	Иначе
		
		Если ПараметрыДоговора.ВыводСуммыБезНДС = 1 Тогда
			масНДС = Ссылка.Услуги.НайтиСтроки(Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.НДС0));
			Если масНДС.Количество() > 0 Тогда
				ПредставлениеНДС     = ", без НДС";
				ПредставлениеНДСАнгл = ", without VAT";
			Иначе
				ПредставлениеНДС     = ", НДС не облагается";
				ПредставлениеНДСАнгл = ", without VAT";
			КонецЕсли;	
		ИначеЕсли ПараметрыДоговора.ВыводСуммыБезНДС = 0 Тогда	
			ПредставлениеНДС     = ", в том числе НДС 0,00 " + Строка(Ссылка.Валюта);
			ПредставлениеНДСАнгл = "";
		КонецЕсли;	
		
	КонецЕсли; 
	
	
	обл = Макет.ПолучитьОбласть("ИтогоСуммаПрописью");
	
	обл.Параметры.ИтоговыйТекст = "Total "+Формат(Итого,"ЧДЦ=2; ЧРД=.; ЧРГ=,")+" "+ Ссылка.Валюта;
	обл.Параметры.СуммаПрописью = CW_Печать.СформироватьСуммуПрописьюАнгл(Итого, Ссылка.Валюта) + ПредставлениеНДСАнгл;
	
	Подвал.Вывести(обл);
	
	// образец заполнения
	Если Не ПараметрыДоговора.ЯзыкПечатиДокументов = 0 Тогда//Если (Ссылка.Валюта=БазоваяВалюта ИЛИ Ссылка.Договор.ВзаиморасчетыВУЕ) Тогда 
		
		СуффиксОбластей = ?(ПараметрыДоговора.ЯзыкПечатиДокументов=1,"_Англ","_Двуязычный");
		// --- 
		обл_Верх = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Верх"+СуффиксОбластей);
		обл_Посредник = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Посредник"+СуффиксОбластей);
		обл_Корреспондент = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Корреспондент"+СуффиксОбластей);
		обл_Получатель = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Получатель"+СуффиксОбластей);
		
		обл_Верх.Параметры.Заполнить(Новый Структура("Валюта", Ссылка.Валюта));
		Подвал.Вывести(обл_Верх);
		
		Если ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.БанкПосредникБанкаКорреспондента) Тогда 
			банк = ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.БанкПосредникБанкаКорреспондента;
			обл_Посредник.Параметры.БанкПосредникБанкаКорреспондента = 
			банк.Наименование
			+", "+банк.АдресАнгл
			+Символы.ПС+"SWIFT: "+банк.SWIFT;
			Подвал.Вывести(обл_Посредник);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.БанкКорреспондент) Тогда 
			банк = ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.БанкКорреспондент;
			обл_Корреспондент.Параметры.БанкКорреспондент = 
			банк.Наименование
			+", "+банк.АдресАнгл
			+Символы.ПС+"SWIFT: "+банк.SWIFT;
			Подвал.Вывести(обл_Корреспондент);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.Банк) Тогда 
			банк = ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.Банк;
			обл_Получатель.Параметры.БанкПолучателя = 
			банк.Наименование
			+", "+банк.АдресАнгл
			+Символы.ПС+"SWIFT: "+банк.SWIFT
			+?(ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.КоррСчет),Символы.ПС+"Acc. "+ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.КоррСчет,"");
		КонецЕсли;
		обл_Получатель.Параметры.Получатель = 
		"Acc. "+ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.НомерСчета
		+ ?(ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.IBAN),Символы.ПС+"IBAN "+ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.IBAN,"")
		+ Символы.ПС + ПараметрыУчетнойПолитики.НаименованиеОрганизацииАнгл
		+ ", " + ПараметрыДоговора.АдресОрганизацииАнгл;
		Подвал.Вывести(обл_Получатель);
		
	КонецЕсли;
	
	
	//---
	// рублёвый счет
	Если ПараметрыДоговора.ВыводитьПодвалВСчете = 1 Тогда
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов=0) Тогда 
			стрДополнительнаяИнформация = ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалРус;
			Если НЕ ПустаяСтрока(стрДополнительнаяИнформация) Тогда 
				обл = Макет.ПолучитьОбласть("ДопИнфо");
				обл.Параметры.ДополнительнаяИнформация = стрДополнительнаяИнформация;
				Подвал.Вывести(обл);
			КонецЕсли;
		КонецЕсли;
		// валютный счет, англ
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
			стрДополнительнаяИнформация = ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалАнгл;
			Если НЕ ПустаяСтрока(стрДополнительнаяИнформация) Тогда 
				обл = Макет.ПолучитьОбласть("ДопИнфо");
				обл.Параметры.ДополнительнаяИнформация = стрДополнительнаяИнформация;
				Подвал.Вывести(обл);
			КонецЕсли;
		КонецЕсли;
		// валютный счет, рус/двуяз
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
			стрДополнительнаяИнформация = ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалРус + " / " + ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалАнгл;
			Если НЕ ПустаяСтрока(стрДополнительнаяИнформация) Тогда 
				обл = Макет.ПолучитьОбласть("ДопИнфо");
				обл.Параметры.ДополнительнаяИнформация = стрДополнительнаяИнформация;
				Подвал.Вывести(обл);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ПараметрыДоговора.ВыводитьПодвалВСчете = 2 Тогда
		Обл = Макет.ПолучитьОбласть("ПодвалПоШаблону");
		Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
			Обл.Параметры.ДополнительнаяИнформацияПоШаблону = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчетеАнгл, Ссылка, Неопределено, Ссылка.Услуги);
		ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
			Обл.Параметры.ДополнительнаяИнформацияПоШаблону = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчете, Ссылка, Неопределено, Ссылка.Услуги) +
			Символы.ПС +
			CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчетеАнгл, Ссылка, Неопределено, Ссылка.Услуги);
		Иначе
			Обл.Параметры.ДополнительнаяИнформацияПоШаблону = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчете, Ссылка, Неопределено, Ссылка.Услуги);				
		КонецЕсли;
		Подвал.Вывести(Обл);
	КонецЕсли;
	
	// подготовка единиц измерения
	ТЗЕИ = ТаблицаУслуг.Скопировать(,"Номенклатура");
	ТЗЕИ.Свернуть("Номенклатура");
	МассивНоменклатуры = ТЗЕИ.ВыгрузитьКолонку("Номенклатура");
	
	НомСтрГП = 0;
	Для каждого усл Из ТаблицаУслуг Цикл
		
		_сф.Инкремент(ТекущаяСтрока);
		
		стру = Новый Структура;
		стру.Вставить("Номер",        ТекущаяСтрока);
		стру.Вставить("Наименование", усл.Представление);
		// --- 
		
		стру.Вставить("Единица",     усл.Номенклатура.ЕдиницаИзмерения);
		
		Если СокрЛП(усл.Номенклатура.ЕдиницаИзмерения.Наименование) = "-" Тогда
			Если ПараметрыДоговора.ВыводитьКоличествоЦенуУслугБезЕИ Тогда
				стру.Вставить("Количество",   Усл.Количество);
				стру.Вставить("Цена",         Усл.Цена);
			Иначе
				стру.Вставить("Количество", "-");
				стру.Вставить("Цена", "-");
			КонецЕсли;
		Иначе
			стру.Вставить("Количество",   Усл.Количество);
			стру.Вставить("Цена",         Усл.Цена);
		КонецЕсли;	
		
		
		
		стру.Вставить("Сумма",        усл.Сумма);
		стру.Вставить("СтавкаНДС",    ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, стрБезНДС, усл.СтавкаНДС));
		стру.Вставить("СуммаНДС",     усл.НДС);
		стру.Вставить("Итого",        усл.Всего);
		
		Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов) И ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов.СворачиватьПоГрузоперевозкам Тогда
			СтрТЗ_ГП = ТЗ_ГП.Найти(НомСтрГП, "НомСтр");
			Если СтрТЗ_ГП <> Неопределено Тогда
				ОблГП = Макет.ПолучитьОбласть("Группировка");
				ОблГП.Параметры.Группировка = СтрТЗ_ГП.Представление;
				Если ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов.ВыводитьИтогиПоГрузоперевозкам Тогда
					ОблГП.Параметры.Итого = СтрТЗ_ГП.Итого;
				КонецЕсли;	
				ТД.Вывести(ОблГП);
				НомСтрГП = НомСтрГП + 1;
			КонецЕсли;	
		КонецЕсли;	
		НомСтрГП = НомСтрГП + 1;
		
		облСтрокаТаблицы.Параметры.Заполнить(стру);
		Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
			облСтрокаТаблицы.Параметры.Цена = усл.Цена;
		Иначе	
			облСтрокаТаблицы.Параметры.СуммаНДС = ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, "-", усл.НДС);
		КонецЕсли;	
		
		Если ТекущаяСтрока = ВсегоСтрокДляВывода Тогда
			
			// проверяем, влезает ли строка, итог и подвал
			ВТД = Новый ТабличныйДокумент;
			ВТД.Вывести(облСтрокаТаблицы);
			ВТД.Вывести(Подвал);
			
			Если ТД.ПроверитьВывод(ВТД) Тогда
				
				ТД.Вывести(ВТД);
				
			Иначе
				
				Если ВсегоСтрокДляВывода =1 Тогда
					
					// ничего не поделать
					ТД.Вывести(ВТД);
					
				Иначе
					
					ТД.ВывестиГоризонтальныйРазделительСтраниц();
					ТД.Вывести(облШапкаТаблицы);
					ТД.Вывести(ВТД);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		Иначе
			
			ТД.Вывести(облСтрокаТаблицы);
			
		КонецЕсли; 
		
	КонецЦикла;
	
	
	РезультатПечати.ПечатнаяФорма = ТД;
	
	
	Возврат РезультатПечати;
	
КонецФункции


Функция ПроверитьТипСчета(Ссылка)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозкеУслуги.Номенклатура КАК Номенклатура,
	|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
	|	И CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка = ЗНАЧЕНИЕ(Справочник.CW_Грузоперевозки.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции


Функция  ПолучитьТекстДополнения(Ссылка)
	
	ТегОткрывающий = "<%Текст шапки%/";
	ТегЗакрывающий = "/%Текст шапки%>";
	
	стрКомментарий = Ссылка.Комментарий;
	
	ПозПервогоСимвола    = СтрНайти(стрКомментарий,ТегОткрывающий);
	ПозПоследнегоСимвола = СтрНайти(стрКомментарий,ТегЗакрывающий);
	
	Если ПозПервогоСимвола = 0 или ПозПоследнегоСимвола = 0 тогда
		Возврат "";
	КонецЕсли;
	
	ТекстДополнения = Сред(стрКомментарий,ПозПервогоСимвола, ПозПоследнегоСимвола - ПозПервогоСимвола);
	
	ТекстДополнения = СтрЗаменить(ТекстДополнения, ТегОткрывающий,"");
	
	Возврат ТекстДополнения;
	
КонецФункции


#КонецЕсли