
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	АдресСпискаЗначений = ПолучитьАдресСпискаПутевыхЛистовПогрузопереовзке(ПараметрКоманды);
	
	Если ЭтоАдресВременногоХранилища(АдресСпискаЗначений)  Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресСпискаЗначений"	, АдресСпискаЗначений);
		ПараметрыФормы.Вставить("СписокСПометками"		, Ложь);
		ПараметрыФормы.Вставить("ЗаголовокФормы"		, "Список путевых листов");
		
		ОписаниеОповещения = новый ОписаниеОповещения("ПриЗакрытиФормыВыбораИзСписка", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораИзСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ТипЗнч(АдресСпискаЗначений)  = Тип("ДокументСсылка.CW_ПутевойЛист") Тогда
		ПоказатьЗначение(,АдресСпискаЗначений);
	Иначе
		ПоказатьПредупреждение(,"Нет путевых листов связанных с текущей грузоперевозкой!");
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытиФормыВыбораИзСписка(Результат, ДопПараметр) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗначениеВыбора = ОбработатьРезультаВыбораЗначения(Результат);
		
		Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
			ПоказатьЗначение(,ЗначениеВыбора);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьРезультаВыбораЗначения(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		СтркутураОтвета = ПолучитьИзВременногоХранилища(Результат);
		Возврат СтркутураОтвета.Значение;
	КонецЕсли;
	
	Возврат Неопределено
	
КонецФункции

&НаСервере
Функция ПолучитьАдресСпискаПутевыхЛистовПоГрузопереовзке(ПараметрКоманды)
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка КАК ПутевойЛист,
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.Проведен КАК Проведен,
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Документ.CW_ПутевойЛист.ЭтапыМаршрута КАК CW_ПутевойЛистЭтапыМаршрута
	               |ГДЕ
	               |	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка = &Грузоперевозка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ПутевойЛистЭтапыМаршрута.Ссылка";
	
	Запрос.УстановитьПараметр("Грузоперевозка", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СписокПутевыхЛистов = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Проведен Тогда
			Картинка = БиблиотекаКартинок.CW_ПроведенныйДокумент;
		ИначеЕсли Выборка.ПометкаУдаления Тогда
			Картинка = БиблиотекаКартинок.CW_ПометкаУдаления;
		Иначе
			Картинка = БиблиотекаКартинок.CW_Документ;
		КонецЕсли;
		
		СписокПутевыхЛистов.Добавить(Выборка.ПутевойЛист,,,Картинка);
		
	КонецЦикла;
	
	Если СписокПутевыхЛистов.Количество()= 1 Тогда
		Возврат СписокПутевыхЛистов.Получить(0).Значение;	
	ИначеЕсли СписокПутевыхЛистов.Количество() > 1 Тогда
		Возврат ПоместитьВоВременноеХранилище(СписокПутевыхЛистов);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
	
