// ***************************************************************************
// **                 ОБЩИЕ ФУНКЦИИ ДЛЯ ОТЧЕТОВ НА СКД                      **
// ***************************************************************************

Функция НайтиЭлементОтбораКомпоновкиДанных(ИмяОтбора, Отбор) Экспорт 
	
	Если 0=Отбор.Элементы.Количество() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Для ы=0 По Отбор.Элементы.Количество()-1 Цикл
		эл = Отбор.Элементы.Получить(ы);
		Если СокрЛП(эл.ЛевоеЗначение)=ИмяОтбора Тогда 
			Возврат эл;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДобавитьОтборКомпоновкиДанных(ИмяОтбора, ВидСравненияОтбора, ПравоеЗначениеОтбора, ИспользованиеОтбора, Отбор) Экспорт 
	
	эл = НайтиЭлементОтбораКомпоновкиДанных(ИмяОтбора, Отбор);
	
	Если Неопределено = эл Тогда 
		эл = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	КонецЕсли;
	
	эл.ВидСравнения = ВидСравненияОтбора;
	эл.ПравоеЗначение = ПравоеЗначениеОтбора;
	эл.Использование  = ИспользованиеОтбора;
	
	Возврат эл;
	
КонецФункции

Функция УдалитьОтборКомпоновкиДанных(ИмяОтбора, Отбор) Экспорт 
	
	эл = НайтиЭлементОтбораКомпоновкиДанных(ИмяОтбора, Отбор);
	
	Если НЕ Неопределено = эл Тогда 
		Отбор.Элементы.Удалить(эл);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОтключитьВсеОтборыКомпоновкиДанных(Отбор) Экспорт 
	
	Для ы=0 По Отбор.Элементы.Количество()-1 Цикл
		эл = Отбор.Элементы.Получить(ы);
		эл.Использование = Ложь;
	КонецЦикла;

КонецФункции

Функция НайтиПараметрДанныхКомпоновкиДанных(ИмяПараметра, ПараметрыДанных)
	
	Если 0=ПараметрыДанных.Элементы.Количество() Тогда 
		Возврат Неопределено;
	КонецЕсли;

	Для ы=0 По ПараметрыДанных.Элементы.Количество()-1 Цикл
		эл = ПараметрыДанных.Элементы.Получить(ы);
		Если СокрЛП(ПараметрыДанных.Элементы[ы].Параметр)=ИмяПараметра Тогда 
			Возврат эл;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция УстановитьЗначениеПараметраДанныхКомпоновкиДанных(ИмяПараметра, ЗначениеПараметра, ПараметрыДанных) Экспорт 
	
	эл = НайтиПараметрДанныхКомпоновкиДанных(ИмяПараметра, ПараметрыДанных);
	Если Неопределено=эл Тогда 
		эл = ПараметрыДанных.Элементы.Добавить();
		эл.Параметр = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	КонецЕсли;
	
	ПараметрыДанных.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);
	
	Возврат эл;
	
КонецФункции

Функция НайтиЭлементГруппировкиКомпоновкиДанных(ИмяГруппировки, НастройкиСтруктура) Экспорт 
	
	Если 0=НастройкиСтруктура.Количество() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Для ы=0 По НастройкиСтруктура.Количество()-1 Цикл
		
		эл = НастройкиСтруктура.Получить(ы);
		
		флПолеНайдено = Ложь;
		Если ТипЗнч(эл) = Тип("ГруппировкаКомпоновкиДанных") Тогда 
			Для Каждого поле Из эл.ПоляГруппировки.Элементы Цикл
				Если СокрЛП(поле.Поле) = ИмяГруппировки Тогда 
					флПолеНайдено = Истина;
				Иначе 
					// ищем дальше
				КонецЕсли;
			КонецЦикла;
		Иначе 
			// желательно будет отработать и другие варианты
		КонецЕсли;
		
		Если флПолеНайдено Тогда 
			Возврат эл;
		Иначе 
			элИзПодчиненных = НайтиЭлементГруппировкиКомпоновкиДанных(ИмяГруппировки, эл.Структура);
			Если НЕ Неопределено=элИзПодчиненных Тогда 
				Возврат элИзПодчиненных;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// прошлись по всем уровням, но ничего не нашли
	Возврат Неопределено;
	
КонецФункции

Функция НайтиПоследнийЭлементГруппировкиКомпоновкиДанных(НастройкиСтруктура) Экспорт 
	
	Если 0=НастройкиСтруктура.Количество() Тогда 
		// это последний элемент по вложенности
		Возврат НастройкиСтруктура;
	КонецЕсли;
	
	// есть подчиненные
	Для ы=0 По НастройкиСтруктура.Количество()-1 Цикл
		эл = НастройкиСтруктура.Получить(ы);
		элИзПодчиненных = НайтиПоследнийЭлементГруппировкиКомпоновкиДанных(эл.Структура);
		Возврат элИзПодчиненных;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДобавитьГруппировкуКомпоновкиДанных(ИмяГруппировки, НастройкиСтруктура) Экспорт 

	// вдруг уже есть?
	эл = НайтиЭлементГруппировкиКомпоновкиДанных(ИмяГруппировки, НастройкиСтруктура);
	
	Если Неопределено = эл Тогда 
		// еще нету, значит, добавляем
		элПоследний = НайтиПоследнийЭлементГруппировкиКомпоновкиДанных(НастройкиСтруктура);
		эл = элПоследний.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		пг = эл.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		пг.Использование = Истина;
		пг.Поле = Новый ПолеКомпоновкиДанных(ИмяГруппировки);
		эл.Использование = Истина;
		эл.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		эл.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	КонецЕсли;
	
	// уже был или только что добавлен, включим
	эл.Состояние = СостояниеЭлементаНастройкиКомпоновкиДанных.Включен;
	
	Возврат эл;
	
КонецФункции

Процедура ПеренестиПодчиненныеЭлементыГруппировкиКомпоновкиДанных(элИсточник, элПриемник)

	Для Каждого элПодчиненный Из элИсточник.Структура Цикл
		Если ТипЗнч(элПодчиненный) = Тип("ГруппировкаКомпоновкиДанных") Тогда 
			элПереноса = элПриемник.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			Для Каждого пгПодчиненного Из элПодчиненный.ПоляГруппировки.Элементы Цикл
				пг = элПереноса.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				пг.Использование = пгПодчиненного.Использование;
				пг.Поле = пгПодчиненного.Поле;
			КонецЦикла;
			элПереноса.Использование = элПодчиненный.Использование;
			элПереноса.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			элПереноса.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			ПеренестиПодчиненныеЭлементыГруппировкиКомпоновкиДанных(элПодчиненный, элПереноса);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция УдалитьГруппировкуКомпоновкиДанных(ИмяГруппировки, НастройкиСтруктура) Экспорт 
	
	эл = НайтиЭлементГруппировкиКомпоновкиДанных(ИмяГруппировки, НастройкиСтруктура);
	
	Если НЕ Неопределено = эл Тогда 
		ПеренестиПодчиненныеЭлементыГруппировкиКомпоновкиДанных(эл, эл.Родитель); // если удаляем из середины дерева
		эл.Родитель.Структура.Удалить(эл);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция УдалитьВсеГруппировкиКомпоновкиДанных(НастройкиСтруктура) Экспорт 
	
	Если 0=НастройкиСтруктура.Количество() Тогда 
		// это последний элемент по вложенности
		Возврат НастройкиСтруктура;
	КонецЕсли;
	
	// есть элементы
	Для ы=0 По НастройкиСтруктура.Количество()-1 Цикл
		НастройкиСтруктура.Удалить(ы);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// устанавливает в компоновщике видимость показателей согласно флажкам из сзПоказатели; те элементы, которых нет в списке - просто не трогает; возвращает Истина, если успешно отмечен хотя бы один из показателей
Функция ПрименитьНастройкуСоставаПоказателей(НастройкиВыбор, сзПоказатели) Экспорт 
	
	Если 0=НастройкиВыбор.Элементы.Количество() Тогда 
		Возврат Ложь;
	КонецЕсли;

	флОтмеченХотяБыОдинПоказатель = Ложь;
	Для Каждого элПоказатели Из сзПоказатели Цикл
		
		ИмяПараметра = элПоказатели.Значение;
		Для ы=0 По НастройкиВыбор.Элементы.Количество()-1 Цикл
			элВыбора = НастройкиВыбор.Элементы.Получить(ы);
			Если ТипЗнч(элВыбора) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда 
				// для групп
				флЧтоТоОтметилиВГруппе = ПрименитьНастройкуСоставаПоказателей(элВыбора, сзПоказатели);
				флОтмеченХотяБыОдинПоказатель = флОтмеченХотяБыОдинПоказатель ИЛИ флЧтоТоОтметилиВГруппе;
			Иначе 
				// для элементов
				Если Лев(элВыбора.Поле, СтрДлина(ИмяПараметра)) = ИмяПараметра Тогда 
					// Имя поля начинается с того, что мы ищем
					элВыбора.Использование = элПоказатели.Пометка;
					Если элПоказатели.Пометка Тогда 
						флОтмеченХотяБыОдинПоказатель = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат флОтмеченХотяБыОдинПоказатель;
	
КонецФункции

// поиск и замена текста в табличном документе, заодно возможность немного отформатировать найденную область
Функция ЗаменитьТекстВТаблицеРезультата(ТабДок, стрЧтоИщем, стрНаЧтоМеняем, НовоеГоризонтальноеПоложение=Неопределено, МаксНомерСтрокиПоиска=Неопределено) Экспорт 
	
	ПредНайденнаяОбласть = Неопределено;
	
	Если ЗначениеЗаполнено(МаксНомерСтрокиПоиска) Тогда 
		ГдеИскать = ТабДок.Область(1,,МаксНомерСтрокиПоиска,);
	Иначе 
		ГдеИскать = Неопределено;
	КонецЕсли;
	
	Пока Истина Цикл
	
		НайденнаяОбласть = ТабДок.НайтиТекст(стрЧтоИщем, ПредНайденнаяОбласть, ГдеИскать); 
		Если Неопределено=НайденнаяОбласть Тогда 
			Прервать;
		Иначе 
			ПредНайденнаяОбласть = НайденнаяОбласть;
		КонецЕсли;
		//Если ЗначениеЗаполнено(МаксНомерСтрокиПоиска) И (НайденнаяОбласть.Верх > МаксНомерСтрокиПоиска) Тогда 
		//	Прервать;
		//КонецЕсли;
			
		Если стрЧтоИщем<>стрНаЧтоМеняем Тогда 
			НайденнаяОбласть.Текст = СтрЗаменить(НайденнаяОбласть.Текст, стрЧтоИщем, стрНаЧтоМеняем);
		КонецЕсли;
			
		Если НЕ Неопределено=НовоеГоризонтальноеПоложение Тогда 
			НайденнаяОбласть.ГоризонтальноеПоложение = НовоеГоризонтальноеПоложение;
		КонецЕсли;
		
	КонецЦикла;
	
	//НайденнаяОбласть.Шрифт =Новый Шрифт(НайденнаяОбласть.Шрифт, , 10);

КонецФункции

Функция УжатьПоВысотеСтрокиПередИПослеЗаголовка(ТабДок) Экспорт

	ТабДок.Область(1, , 1, ).ВысотаСтроки = 1;
	ТабДок.Область(3, , 3, ).ВысотаСтроки = 1;
	ТабДок.ФиксацияСверху = ТабДок.ФиксацияСверху; // Маразм? Но иначе прокручиваемая область появится изначально уже слегка прокученной

КонецФункции

Функция ПредставлениеПустогоКонтрагента(Контрагент) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "<Неопределен>";
	КонецЕсли;
	
	Возврат Контрагент;
	
КонецФункции

// ***************************************************************************

Функция ПредставлениеДокументаРасчетовСоСпискомГрузоперевозок(док, флДетализироватьПоГрузоперевозкам, флДетализироватьПоЗаказам) Экспорт
	// для отчетов CW_ВзаиморасчетыСПокупателями CW_ВзаиморасчетыСПоставщиками
	
	тз = Новый ТаблицаЗначений;
	
	Если ТипЗнч(док)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Если флДетализироватьПоГрузоперевозкам Тогда
			з = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка,
				|	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка,
				|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.ПредставлениеДокумента КАК ПредставлениеДокумента
				|ИЗ
				|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
				|ГДЕ
				|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйДокумент = &ВедомыйДокумент"
			);
			з.УстановитьПараметр("ВедомыйДокумент", док);
			тз = з.Выполнить().Выгрузить();
		ИначеЕсли флДетализироватьПоЗаказам Тогда
			з = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка,
				|	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ КАК Заказ,
				|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.ПредставлениеДокумента КАК ПредставлениеДокумента
				|ИЗ
				|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
				|ГДЕ
				|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйДокумент = &ВедомыйДокумент
				|	И CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ <> &Заказ"
			);
			з.УстановитьПараметр("ВедомыйДокумент", док);
			з.УстановитьПараметр("Заказ", Справочники.CW_Заказы.ПустаяСсылка());
			тз = з.Выполнить().Выгрузить();			
		КонецЕсли;	
	ИначеЕсли ТипЗнч(док)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Если флДетализироватьПоГрузоперевозкам Тогда
			з = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка,
				|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка,
				|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ПредставлениеДокумента КАК ПредставлениеДокумента
				|ИЗ
				|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
				|ГДЕ
				|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйДокумент = &ВедомыйДокумент"
			);
			з.УстановитьПараметр("ВедомыйДокумент", док);
			тз = з.Выполнить().Выгрузить();
		ИначеЕсли флДетализироватьПоЗаказам Тогда
			з = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка,
				|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ КАК Заказ,
				|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ПредставлениеДокумента КАК ПредставлениеДокумента
				|ИЗ
				|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
				|ГДЕ
				|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйДокумент = &ВедомыйДокумент
				|	И CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ <> &Заказ"
			);
			з.УстановитьПараметр("ВедомыйДокумент", док);
			з.УстановитьПараметр("Заказ", Справочники.CW_Заказы.ПустаяСсылка());
			тз = з.Выполнить().Выгрузить();			
		КонецЕсли;	
	ИначеЕсли ТипЗнч(док)=Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		Возврат "п/п входящее №"+СокрЛП(док.НомерВходящегоДокумента)+" от "+Формат(док.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy");
	ИначеЕсли ТипЗнч(док)=Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		Возврат "п/п исходящее №"+СокрЛП(док.НомерВходящегоДокумента)+" от "+Формат(док.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy");
	Иначе
		Возврат СокрЛП(док);
	КонецЕсли;
	
	Если тз.Количество() = 0 Тогда
		Если флДетализироватьПоГрузоперевозкам Тогда
			Возврат СокрЛП(док);
		Иначе
			Если ТипЗнч(док)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				з = Новый Запрос(
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка,
					|	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка,
					|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.ПредставлениеДокумента КАК ПредставлениеДокумента
					|ИЗ
					|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
					|ГДЕ
					|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйДокумент = &ВедомыйДокумент"
				);
				з.УстановитьПараметр("ВедомыйДокумент", док);
				тзп = з.Выполнить().Выгрузить();
			ИначеЕсли ТипЗнч(док)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				з = Новый Запрос(
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка,
					|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка,
					|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ПредставлениеДокумента КАК ПредставлениеДокумента
					|ИЗ
					|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
					|ГДЕ
					|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ВедомыйДокумент = &ВедомыйДокумент"
				);
				з.УстановитьПараметр("ВедомыйДокумент", док);
				тзп = з.Выполнить().Выгрузить();
			КонецЕсли;
			
			Если тзп.Количество() = 0 Тогда
				Возврат СокрЛП(док);
			Иначе
				Возврат СокрЛП(тзп[0].ПредставлениеДокумента);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	стр = СокрЛП(тз[0].ПредставлениеДокумента);
	Если флДетализироватьПоГрузоперевозкам Тогда 
		стр=стр+" ("+_СФ.м_Представление(тз.ВыгрузитьКолонку("Грузоперевозка"), ", ")+")";
	ИначеЕсли флДетализироватьПоЗаказам Тогда
		стр=стр+" ("+_СФ.м_Представление(тз.ВыгрузитьКолонку("Заказ"), ", ")+")";		
	КонецЕсли;
	
	Возврат стр;
	
КонецФункции // 
Функция ПредставлениеДокументовВзаиморасчетов(Док, флДетализироватьПоГрузоперевозкам, флДетализироватьПоЗаказам) Экспорт
	// для отчетов CW_ВедомостьОперативныхВзаиморасчетовСПоставщиками 
	// Признак = 1 - представление счета
	// Признак = 2 - представление ссылки
	
	Стр = "";
	
	Если ТипЗнч(док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")
		ИЛИ ТипЗнч(док) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") 
	Тогда
		
		Если ТипЗнч(док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
			
			Если док.ФормируетсяСчет Тогда
				НомерСчета = CW_Документы.ПолучитьНомерНаПечать(док, "НомерСчета", "ДатаСчета");
				Стр = "Счет №" + СокрЛП(НомерСчета) + " от " + Формат(Док.ДатаСчета, "ДЛФ=Д");
			КонецЕсли; 
			
			Если док.ФормируетсяАкт Тогда
				Если ЗначениеЗаполнено(Стр) Тогда
					Стр = Стр + "; ";
				КонецЕсли; 
				НомерАкта = CW_Документы.ПолучитьНомерНаПечать(док, "НомерАкта", "ДатаАкта");
				Стр = Стр + "Акт №" + СокрЛП(НомерАкта) + " от " + Формат(Док.ДатаАкта, "ДЛФ=Д");
			КонецЕсли; 
			
		ИначеЕсли ТипЗнч(док) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
			
			Если док.ПредъявленСчет Тогда
				Стр = "Счет №" + СокрЛП(Док.НомерСчета) + " от " + Формат(Док.ДатаСчета, "ДЛФ=Д");
			КонецЕсли; 
			
			Если док.ПредъявленАкт Тогда
				Если ЗначениеЗаполнено(Стр) Тогда
					Стр = Стр + "; ";
				КонецЕсли; 
				Стр = Стр + "Акт №" + СокрЛП(Док.НомерАкта) + " от " + Формат(Док.ДатаАкта, "ДЛФ=Д");
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если флДетализироватьПоГрузоперевозкам Тогда
			
			Если ТипЗнч(Док)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка
					|ИЗ
					|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
					|ГДЕ
					|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка";
				Запрос.УстановитьПараметр("Ссылка", Док);
				ТЗ = Запрос.Выполнить().Выгрузить();
				
			ИначеЕсли ТипЗнч(Док)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка
					|ИЗ
					|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
					|ГДЕ
					|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка";
				Запрос.УстановитьПараметр("Ссылка", Док);
				ТЗ = Запрос.Выполнить().Выгрузить();
			КонецЕсли;
			
			Если ТЗ.Количество() > 0 Тогда 
				Стр = Стр + " ("+_СФ.м_Представление(тз.ВыгрузитьКолонку("Грузоперевозка"), ", ")+")";
			КонецЕсли;
			
		ИначеЕсли флДетализироватьПоЗаказам Тогда
			
			Если ТипЗнч(Док)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ КАК Заказ
					|ИЗ
					|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
					|ГДЕ
					|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
					|	И CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ <> &Заказ";
				Запрос.УстановитьПараметр("Ссылка", Док);
				Запрос.УстановитьПараметр("Заказ", Справочники.CW_Заказы.ПустаяСсылка());
				ТЗ = Запрос.Выполнить().Выгрузить();
			ИначеЕсли ТипЗнч(Док)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ КАК Заказ
					|ИЗ
					|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
					|ГДЕ
					|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
					|	И CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ <> &Заказ";
				Запрос.УстановитьПараметр("Ссылка", Док);
				Запрос.УстановитьПараметр("Заказ", Справочники.CW_Заказы.ПустаяСсылка());
				ТЗ = Запрос.Выполнить().Выгрузить();
			КонецЕсли;				
			
			Если ТЗ.Количество() > 0 Тогда 
				Стр = Стр + " ("+_СФ.м_Представление(тз.ВыгрузитьКолонку("Заказ"), ", ")+")";
			КонецЕсли;
		
		КонецЕсли;	
		
	ИначеЕсли док = Неопределено Тогда	
		Стр = "";
		
	Иначе	
		Попытка
			Стр = док.ПредставлениеДокумента;	
		Исключение
		    Стр = Строка(док);
		КонецПопытки; 
		
	КонецЕсли;	
		
	Возврат Стр;
	
КонецФункции
Функция ПредставлениеДокументовВзаиморасчетовДляОперативныхОтчетов(Док, флДетализироватьПоГрузоперевозкам, флДетализироватьПоЗаказам) Экспорт
	// для отчетов CW_ВедомостьОперативныхВзаиморасчетовСПоставщиками 
	// Признак = 1 - представление счета
	// Признак = 2 - представление ссылки
	
	Стр = "";
	
	Если ТипЗнч(док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") ИЛИ ТипЗнч(док) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		Если (ТипЗнч(док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
			
			Если (док.ФормируетсяСчет) Тогда
				НомерСчета = CW_Документы.ПолучитьНомерНаПечать(док, "НомерСчета", "ДатаСчета");
				Стр = "Счет №" + СокрЛП(НомерСчета) + " от " + Формат(Док.ДатаСчета, "ДЛФ=Д");
				
			ИначеЕсли (док.ФормируетсяАкт) Тогда
				
				Если (Стр <> "") Тогда
					Стр = Стр + "; ";
				КонецЕсли; 
				НомерАкта = CW_Документы.ПолучитьНомерНаПечать(док, "НомерАкта", "ДатаАкта");
				Стр = Стр + "Акт №" + СокрЛП(НомерАкта) + " от " + Формат(Док.ДатаАкта, "ДЛФ=Д");
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (ТипЗнч(док) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда
			
			Если (док.ПредъявленСчет) Тогда
				Стр = "Счет №" + СокрЛП(Док.НомерСчета) + " от " + Формат(Док.ДатаСчета, "ДЛФ=Д");
				
			ИначеЕсли (док.ПредъявленАкт) Тогда
				
				Если (Стр <> "") Тогда
					Стр = Стр + "; ";
				КонецЕсли; 
				Стр = Стр + "Акт №" + СокрЛП(Док.НомерАкта) + " от " + Формат(Док.ДатаАкта, "ДЛФ=Д");
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		//Стр = "Счет №" + СокрЛП(Док.НомерСчета) + " от " + Формат(Док.ДатаСчета, "ДЛФ=Д");
		
		ТЗ = Новый ТаблицаЗначений;
		
		Если флДетализироватьПоГрузоперевозкам Тогда
			Если ТипЗнч(Док)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка
					|ИЗ
					|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
					|ГДЕ
					|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка";
				Запрос.УстановитьПараметр("Ссылка", Док);
				ТЗ = Запрос.Выполнить().Выгрузить();
			ИначеЕсли ТипЗнч(Док)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка
					|ИЗ
					|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
					|ГДЕ
					|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка";
				Запрос.УстановитьПараметр("Ссылка", Док);
				ТЗ = Запрос.Выполнить().Выгрузить();
			КонецЕсли;
			Если флДетализироватьПоГрузоперевозкам И ТЗ.Количество() > 0 Тогда 
				Стр = Стр + " ("+_СФ.м_Представление(тз.ВыгрузитьКолонку("Грузоперевозка"), ", ")+")";
			КонецЕсли;
			
		ИначеЕсли флДетализироватьПоЗаказам Тогда
			Если ТипЗнч(Док)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ КАК Заказ
					|ИЗ
					|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
					|ГДЕ
					|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
					|	И CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ <> &Заказ";
				Запрос.УстановитьПараметр("Ссылка", Док);
				Запрос.УстановитьПараметр("Заказ", Справочники.CW_Заказы.ПустаяСсылка());
				ТЗ = Запрос.Выполнить().Выгрузить();
			ИначеЕсли ТипЗнч(Док)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ КАК Заказ
					|ИЗ
					|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
					|ГДЕ
					|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
					|	И CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.Заказ <> &Заказ";
				Запрос.УстановитьПараметр("Ссылка", Док);
				Запрос.УстановитьПараметр("Заказ", Справочники.CW_Заказы.ПустаяСсылка());
				ТЗ = Запрос.Выполнить().Выгрузить();
			КонецЕсли;
			Если ТЗ.Количество() > 0 Тогда 
				Стр = Стр + " ("+_СФ.м_Представление(тз.ВыгрузитьКолонку("Заказ"), ", ")+")";
			КонецЕсли;
			
		КонецЕсли;	
		
	ИначеЕсли док = Неопределено Тогда	
		Стр = "";
	Иначе	
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(док,"ПредставлениеДокумента") Тогда
			Стр = док.ПредставлениеДокумента;
		Иначе
			Стр = СокрЛП(док);
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Стр;
	
КонецФункции
Функция ПредставлениеДокументовРеализации(Док, ФормированиеОтчета) Экспорт
	// для отчетов CW_ВедомостьОперативныхВзаиморасчетовСПоставщиками 
	// Признак = 1 - представление счета
	// Признак = 2 - представление ссылки
	
	Стр = "";
	
	Если ТипЗнч(док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") ИЛИ ТипЗнч(док) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		Если (ТипЗнч(док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
			
			// по актам
			Если (ФормированиеОтчета=0) Тогда
				Стр = Док.ПредставлениеДокумента;
			Иначе
				НомерСчета = CW_Документы.ПолучитьНомерНаПечать(док, "НомерСчета", "ДатаСчета");
				Стр = "Счет №" + СокрЛП(НомерСчета) + " от " + Формат(Док.ДатаСчета, "ДЛФ=Д");
			КонецЕсли; 
			
		ИначеЕсли (ТипЗнч(док) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда
			
			Если (док.ПредъявленСчет) Тогда
				Стр = "Счет №" + СокрЛП(Док.НомерСчета) + " от " + Формат(Док.ДатаСчета, "ДЛФ=Д");
				
			ИначеЕсли (док.ПредъявленАкт) Тогда
				
				Если (Стр <> "") Тогда
					Стр = Стр + "; ";
				КонецЕсли; 
				Стр = Стр + "Акт №" + СокрЛП(Док.НомерАкта) + " от " + Формат(Док.ДатаАкта, "ДЛФ=Д");
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	ИначеЕсли док = Неопределено Тогда	
		Стр = "";
	Иначе	
		Стр = док.ПредставлениеДокумента;
	КонецЕсли;	
		
	Возврат Стр;
	
КонецФункции
Функция ПредставлениеДокументовПоступления(Док, ФормированиеОтчета) Экспорт
	// для отчетов CW_ВедомостьОперативныхВзаиморасчетовСПоставщиками 
	// Признак = 1 - представление счета
	// Признак = 2 - представление ссылки
	
	Стр = "";
	
	Если ТипЗнч(док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") ИЛИ ТипЗнч(док) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		Если (ТипЗнч(док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
			
			// по актам
			Если (ФормированиеОтчета=0) Тогда
				Стр = Док.ПредставлениеДокумента;
			Иначе
				НомерСчета = CW_Документы.ПолучитьНомерНаПечать(док, "НомерСчета", "ДатаСчета");
				Стр = "Счет №" + СокрЛП(НомерСчета) + " от " + Формат(Док.ДатаСчета, "ДЛФ=Д");
			КонецЕсли; 
			
		ИначеЕсли (ТипЗнч(док) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда
			
			// по актам
			Если (ФормированиеОтчета=0) Тогда
				Стр = Док.ПредставлениеДокумента;
			Иначе
				Стр = "Счет №" + СокрЛП(Док.НомерСчета) + " от " + Формат(Док.ДатаСчета, "ДЛФ=Д");
			КонецЕсли; 
			
		КонецЕсли; 
		
	ИначеЕсли док = Неопределено Тогда	
		Стр = "";
	Иначе	
		Стр = док.Метаданные().Синоним + " №"+СокрЛП(Док.Номер)+" от "+Формат(Док.Дата, "ДЛФ=Д")//док.ПредставлениеДокумента;
	КонецЕсли;	
		
	Возврат Стр;
	
КонецФункции

// --- 
Функция СсылкаДляРасшифровкиПоДокументуРасчетов(док) Экспорт
	// для отчетов, чтобы по поступлению/реализации находить ведущий документ
	
	Если ТипЗнч(док)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		з = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	док.Ссылка
			|ИЗ
			|	Документ.CW_РасходыПоГрузоперевозке КАК док
			|ГДЕ
			|	док.ВедомыйДокумент = &ВедомыйДокумент"
		);
		з.УстановитьПараметр("ВедомыйДокумент", док);
		тз = з.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(док)=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		з = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	док.Ссылка
			|ИЗ
			|	Документ.CW_ДоходыПоГрузоперевозке КАК док
			|ГДЕ
			|	док.ВедомыйДокумент = &ВедомыйДокумент"
		);
		з.УстановитьПараметр("ВедомыйДокумент", док);
		тз = з.Выполнить().Выгрузить();
		
	Иначе
		Возврат док;
		
	КонецЕсли;
	
	Если тз.Количество()=0 Тогда
		// не нашли ведущего документа или у него пуста таб.часть
		Возврат док;
	КонецЕсли;
	
	Возврат тз[0].Ссылка;
	
КонецФункции //

// ***************************************************************************

//Процедура УстановитьПараметрыВыводаКомпоновкиДанных(НастройкиСКД, СтркутураПараметров)
//
// 	Устанавилвает параметры вывода СКД
//
// 	Парамеры:
// 		НастройкиСКД - Настройки компановки данных отчета;
//		СтркутураПараметров - "Структура" 
//				- Ключ 		- имя параметра;
//				- Значение 	- устанавилваемео значение параметра;
//
//		Если значение = Неопределено, то у параметра снимается флаг "Использование"
//
Процедура УстановитьПараметрыВыводаКомпоновкиДанных(НастройкиСКД, СтркутураПараметров) Экспорт
	
	Для Каждого ЭлементСтркутуры из СтркутураПараметров Цикл
		
		_Параметр = НастройкиСКД.ПараметрыВывода.Элементы.Найти(ЭлементСтркутуры.Ключ);
		
		Если _Параметр <> Неопределено Тогда
			_Параметр.Значение 			= ЭлементСтркутуры.Значение;
			_Параметр.Использование 	= ЭлементСтркутуры.Значение <> Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Процедура УстановитьВыбранныеПоляКомпоновкиДанных(НастройкиСКД , мПоляОтчета)
//
// 	Добавляет в настройку СКД выводимые поля отчета
//
// 	Парамеры:
// 		НастройкиСКД 	- Настройки компановки данных отчета;
//      мПоляОтчета 	- "Массив"
//
Процедура УстановитьВыбранныеПоляКомпоновкиДанных(НастройкиСКД , мПоляОтчета) Экспорт
	
	Для каждого Поле Из мПоляОтчета Цикл
		
		ПолеВыбора = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		
		Если ПолеВыбора <> Неопределено Тогда
			ПолеВыбора.Поле		 		= Новый ПолеКомпоновкиДанных(Поле);
			ПолеВыбора.Использование 	= Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Процедура УстановитьПоказателиКомпоновкиДанны(НастройкиСКД , Показатели)
//
// 	Добавляет в настройку СКД выводимые поля отчета
//
// 	Парамеры:
// 		НастройкиСКД - Настройки компановки данных отчета;
//      Показатели 		- "Список значений" с пометками
//
Процедура УстановитьПоказателиКомпоновкиДанных(НастройкиСКД, Показатели) Экспорт
	
	Для Каждого Показатель из Показатели Цикл
		ПолеВыбора = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		
		Если ПолеВыбора <> Неопределено Тогда
			ПолеВыбора.Поле 			= Новый ПолеКомпоновкиДанных(Показатель.Значение);
			ПолеВыбора.Использование 	= Показатель.Пометка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Процедура УстановитьГруппировкиОтчетаКомпановкиДанных(НастройкиСКД_Структура, ПоляГруппировки, ПоГоризонтали=Ложь)
//
// 	Добавляет в настройку СКД группировки
//
// 	Парамеры:
// 		НастройкиСКД_Структура 	- Стркутура настрйоки СКД компановки данных отчета;
//      ПоляГруппировки 		- "Таблица значений"
//									колонки:
//									ИмяПоля 	- Имя поля группировки;
//									Сортировка 	- Направление сортировкидля поля;
//     ПоГоризонтали			- признак вывода группирвоко оттчет апо горизонтали, в отдельных колонках.
//									Значение по умолчанию  = ЛОЖЬ;
//
Процедура УстановитьГруппировкиОтчетаКомпановкиДанных(НастройкиСКД_Структура, ПоляГруппировки, ПоГоризонтали=Ложь) Экспорт
	
	Если ПоГоризонтали Тогда   
		//Добавляем пустую группировку
		НоваяГруппировка = ДобавитьГруппировкуКомпоновкиДанных("", НастройкиСКД_Структура);
	КонецЕсли;
	
	Для Каждого Группировка Из ПоляГруппировки Цикл

		Если Не ПоГоризонтали Тогда
		//	//Добавляем каждую последующую группировку
		//	ПозицияПервойТочки = СтрНайти(Группировка.ИмяПоля,".");
		//	ИмяПоляГруппировки = ?(ПозицияПервойТочки = 0, Группировка.ИмяПоля,Сред(Группировка.ИмяПоля,ПозицияПервойТочки+1));
		//	
			НоваяГруппировка = ДобавитьГруппировкуКомпоновкиДанных(Группировка.ИмяПоля, НастройкиСКД_Структура);
		Иначе
			//Заполняем группировку полями группирвоки
			ПолеГруппировки 				= НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Поле 			= Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
			ПолеГруппировки.Использование 	= Истина;
			
			НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			НовоеАвтоПолеВыбора.Использование	= Истина;
			
			ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
			
			НС = ?(Группировка.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию, НаправлениеСортировкиКомпоновкиДанных.Возр, НаправлениеСортировкиКомпоновкиДанных.Убыв);
			
			ЭлементПорядка.ТипУпорядочивания = НС;
			ЭлементПорядка.Использование = Истина;

		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(ФормаОтчета, ПользовательскиеНастройки) Экспорт
	
	ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
	
	Для Каждого ЭлементСтруктуры Из ДополнительныеСвойства Цикл
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаОтчета, ЭлементСтруктуры.Ключ) Тогда
			Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ТаблицаЗначений") 
				и ЭлементСтруктуры.Значение.Количество() > 0 Тогда 
				ФормаОтчета[ЭлементСтруктуры.Ключ].Загрузить(ЭлементСтруктуры.Значение); 
			ИначеЕсли ТипЗнч(ЭлементСтруктуры.Значение) = Тип("ДанныеФормыКоллекция")  
				и ЭлементСтруктуры.Значение.Количество() > 0 Тогда 
				ФормаОтчета[ЭлементСтруктуры.Ключ].Загрузить(ЭлементСтруктуры.Значение.Выгрузить()); 
			Иначе
				Если ЗначениеЗаполнено(ЭлементСтруктуры.Значение) Тогда
					ФормаОтчета[ЭлементСтруктуры.Ключ] = ЭлементСтруктуры.Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если  ДополнительныеСвойства.Свойство("Отбор") Тогда
		Если  ДополнительныеСвойства.Свойство("ИмяКомпоновщика") Тогда
			ОсновнойКомпоновщикНаФорме = ФормаОтчета[ДополнительныеСвойства.ИмяКомпоновщика];
			ОсновнойКомпоновщикНаФорме.ЗагрузитьНастройки(ДополнительныеСвойства.Отбор);
		Иначе
			ФормаОтчета.Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ДополнительныеСвойства.Отбор);
		КонецЕсли;
	КонецЕсли;
	
	Если  ДополнительныеСвойства.Свойство("ИсточникКопирования") Тогда
		
		ИсточникКопирования =	ДополнительныеСвойства.ИсточникКопирования;   
		Если  ДополнительныеСвойства.Свойство("ИмяКомпоновщикаКопирования") Тогда
			КомпоновщикНаФорме = ФормаОтчета[ДополнительныеСвойства.ИмяКомпоновщикаКопирования];
			
			_УФС.СкопироватьОтбор(ИсточникКопирования.Отбор,КомпоновщикНаФорме.Настройки.Отбор);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры


Процедура СкопироватьОтбор(ОтборИсточник, ОтборПриемник, ИмяПоляОбъекта=Неопределено) Экспорт

	Для Каждого ЭлементОтбора из ОтборИсточник.Элементы Цикл   
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда    
			ГруппаОтбора = ОтборПриемник.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));  
			ГруппаОтбора.ТипГруппы =  ЭлементОтбора.ТипГруппы;
			
			СкопироватьОтбор(ЭлементОтбора, ГруппаОтбора, ИмяПоляОбъекта);  
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = СокрЛП(ЭлементОтбора.ЛевоеЗначение);
		Если ЗначениеЗаполнено(ИмяПоляОбъекта) Тогда
			Если СтрНачинаетсяС(ИмяПоля, "Ссылка.") Тогда
				ИмяПоля = Сред(СокрЛП(ЭлементОтбора.ЛевоеЗначение), 8);
				ИмяПоля = ИмяПоляОбъекта +"."+ИмяПоля;
			ИначеЕсли ИмяПоля = "Ссылка" Тогда
				ИмяПоля =  ИмяПоляОбъекта; 
			Иначе
				ИмяПоля =  ИмяПоляОбъекта+"."+ИмяПоля;
			КонецЕсли;  
		КонеЦесли;
	
		НовыйЭлементОтбора = ОтборПриемник.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ИмяПоля);
		НовыйЭлементОтбора.ВидСравнения 	= ЭлементОтбора.ВидСравнения;
		НовыйЭлементОтбора.ПравоеЗначение 	= ЭлементОтбора.ПравоеЗначение; 
		НовыйЭлементОтбора.Использование 	= Истина; 
		НовыйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;  
		
	КонецЦикла;
	
КонецПроцедуры

