#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ВРег(МетаданныеОтчета.Синоним));
	
	// Установим параметры
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Период",Новый Граница(КонецДня(Настройки.НаДату), ВидГраницы.Включая));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("НаДату", Настройки.НаДату);
	
	// формируем по показателям
	СоответствиеИменПоказателей = ПолучитьСоответствиеИменПоказателейПолям();
	Для Каждого ВыбранноеПоле Из НастройкиСКД.Выбор.Элементы Цикл
		ИмяПоказателя = СоответствиеИменПоказателей.Получить(ВыбранноеПоле.Поле);
		Если ИмяПоказателя <> Неопределено Тогда
			ВыбранноеПоле.Использование = Настройки.Показатели.Найти(ИмяПоказателя) <> Неопределено;
		КонецЕсли;
	КонецЦикла;	

	
	// формируем структуру отчета по группировкам
	НастройкиСКД.Структура.Очистить();
	ТекущийРодитель = НастройкиСКД.Структура;
	Для Каждого Группировка Из Настройки.Группировки Цикл
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		// --- 
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		ПолеГруппировки.Использование = Истина;
		// --- 
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование=Истина;
		// --- 
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		НС = ?(Группировка.Сортировка=Перечисления.CW_НаправлениеСортировки.ПоВозрастанию,НаправлениеСортировкиКомпоновкиДанных.Возр,НаправлениеСортировкиКомпоновкиДанных.Убыв);
		ЭлементПорядка.ТипУпорядочивания = НС;
		ЭлементПорядка.Использование = Истина;
		// --- 
		НоваяГруппировка.Имя = Группировка.Представление;
		НоваяГруппировка.Использование = Истина;
		// --- 
		ТекущийРодитель = НоваяГруппировка.Структура;
	КонецЦикла; 
	
	
КонецПроцедуры

Функция ПолучитьСоответствиеИменПоказателейПолям()
	
	Результат = новый Соответствие;
	
	Результат.Вставить(Новый ПолеКомпоновкиДанных("КоличествоОстаток"),	"КоличествоОстаток");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СуммаОстаток"),		"СуммаОстаток");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("НДСОстаток"), 		"НДСОстаток");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("ВсегоОстаток"), 		"ВсегоОстаток");
	
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Сумма_ВалютаОстаток"),	"Сумма_ВалютаОстаток");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("НДС_ВалютаОстаток"),		"НДС_ВалютаОстаток");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Всего_ВалютаОстаток"), 	"Всего_ВалютаОстаток");

	Возврат Результат;
	
КонецФункции


Функция _ПолучитьСписокГрузоперевозокЗаказа(Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_Грузоперевозки.Ссылка
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат(_сф.сп_СоздатьИзКолонкиТЗ(ТЗ, "Ссылка"));
		
КонецФункции
#КонецЕсли