
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РедактированиеЗапрещено = РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.РедактированиеОбъектаЗапрещено("РегистрСведений.CW_ШаблоныУслуг");
	ЭтаФорма.ТолькоПросмотр = РедактированиеЗапрещено;
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Запись.ПриложениеКДоговору) Тогда 
		Если НЕ Запись.ПриложениеКДоговору.Пустая() Тогда
			Запись.ДоходнаяСтатья 	= ?(Запись.ПриложениеКДоговору.Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"), Истина, Ложь);
			Запись.РасходнаяСтатья 	= ?(Запись.ПриложениеКДоговору.Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"), Истина, Ложь);
		КонецЕсли;
	Иначе
		Если НЕ Запись.Договор.Пустая() Тогда
			Запись.ДоходнаяСтатья 	= ?(Запись.Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"), Истина, Ложь);
			Запись.РасходнаяСтатья 	= ?(Запись.Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"), Истина, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Запись.РасходнаяСтатья И НЕ Запись.ДоходнаяСтатья Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите для какой услуги (входящей или исходящей) должен применяться шаблон.",,"Входящая","Запись", Отказ);
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Если Запись.Договор.Пустая() Тогда
		
		Элементы.РасходнаяСтатья.Доступность = Истина;
		Элементы.ДоходнаяСтатья.Доступность = Истина;
		
	Иначе
		
		Элементы.РасходнаяСтатья.Доступность = Ложь;
		Элементы.ДоходнаяСтатья.Доступность = Ложь;		
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	_ДоговорПриИзменении();
	
КонецПроцедуры
 
&НаСервере
Процедура _ДоговорПриИзменении()
	// --- 
	
	Если НЕ Запись.Договор.Пустая() Тогда
		
		Если Запись.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			
			Запись.ДоходнаяСтатья = Истина;
			Запись.РасходнаяСтатья = Ложь;
			
		ИначеЕсли Запись.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			
			Запись.ДоходнаяСтатья = Ложь;
			Запись.РасходнаяСтатья = Истина;
			
		КонецЕсли; 
		
	Иначе
		
		Запись.ДоходнаяСтатья = Ложь;
		Запись.РасходнаяСтатья = Ложь;
		
	КонецЕсли;
	
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ШаблонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблона",ЭтотОбъект); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья",Элементы.Шаблон.ТекстРедактирования,Запись.РасходнаяСтатья,Запись.ДоходнаяСтатья);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов",ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблона(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Запись.Шаблон = Ответ;
		Элементы.Шаблон.ОбновитьТекстРедактирования();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
 
&НаСервере
Функция _ПолучитьСписокМакросов()
	// --- 
	
	Возврат(CW_Шаблоны.СписокМакросовШаблоновНоменклатуры(Запись.РасходнаяСтатья, Запись.ДоходнаяСтатья));
	
	// --- 
КонецФункции


&НаКлиенте
Процедура ШаблонАнглийскийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаАнгл",ЭтотОбъект); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья",Элементы.ШаблонАнглийский.ТекстРедактирования,Запись.РасходнаяСтатья,Запись.ДоходнаяСтатья);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов",ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблонаАнгл(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Запись.ШаблонАнглийский = Ответ;
		Элементы.ШаблонАнглийский.ОбновитьТекстРедактирования();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
