#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ВРег(МетаданныеОтчета.Синоним));
	
	
	// Установим параметры
	Если Настройки.НачалоПериода <> дата(1,1,1) Тогда
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(Настройки.НачалоПериода));
	КонецЕсли;
	Если Настройки.КонецПериода <> дата(1,1,1) Тогда
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(Настройки.КонецПериода));
	КонецЕсли;
	
	СоответствиеИменПоказателей = ПолучитьСоответствиеИменПоказателейПолям();
	// формируем по показателям
	Для Каждого Поле Из НастройкиСКД.Выбор.Элементы Цикл
		Если ТипЗнч(Поле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			Для Каждого ПодРаздел из Поле.Элементы Цикл
				ИмяПоказателя = СоответствиеИменПоказателей.Получить(ПодРаздел.Поле);
				Если ИмяПоказателя <> Неопределено Тогда
					ПодРаздел.Использование = Настройки.Показатели.Найти(ИмяПоказателя) <> Неопределено;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;	
	
	ЭлементУсловногоОформления = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
	Для каждого Элемент из СоответствиеИменПоказателей Цикл
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Элемент.Ключ;
	КонецЦикла;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина", 10);
	
		
	// формируем структуру отчета по группировкам
	НастройкиСКД.Структура.Очистить();
	ТекущийРодитель = НастройкиСКД.Структура;
	Для Каждого Группировка Из Настройки.Группировки Цикл
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		// --- 
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		ПолеГруппировки.Использование = Истина;
		// --- 
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование=Истина;
		// --- 
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		НС = ?(Группировка.Сортировка=Перечисления.CW_НаправлениеСортировки.ПоВозрастанию,НаправлениеСортировкиКомпоновкиДанных.Возр,НаправлениеСортировкиКомпоновкиДанных.Убыв);
		ЭлементПорядка.ТипУпорядочивания = НС;
		ЭлементПорядка.Использование = Истина;
		// --- 
		НоваяГруппировка.Имя = Группировка.Представление;
		НоваяГруппировка.Использование = Истина;
		// --- 
		ТекущийРодитель = НоваяГруппировка.Структура;
		
	КонецЦикла; 
	
	Если Настройки.ВыводитьДокументыДвижения Тогда
		элГруппировкаПоРегистратору = CW_Отчеты.ДобавитьГруппировкуКомпоновкиДанных("Регистратор", НастройкиСКД.Структура);
		
		ЭлементУсловногоОформления = элГруппировкаПоРегистратору.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,"Arial",7,,Истина));
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
		ЭлементУсловногоОформления.ИспользоватьВЗаголовкеПолей = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		
		ЭлементУсловногоОформления = элГруппировкаПоРегистратору.УсловноеОформление.Элементы.Добавить();
		
		МассивПолей = ПолучитьМассивОформляемыхПолейПоРегистратору();
		Для Каждого Поле из МассивПолей Цикл
			ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Поле;
		КонецЦикла;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", " ");
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Право);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", новый Цвет(255,255,255));
		ЭлементУсловногоОформления.ИспользоватьВЗаголовкеПолей = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьМассивОформляемыхПолейПоРегистратору()
	
	Результат = новый Массив;
	
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоНач.КоличествоНачальныйОстаток"));
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоКон.КоличествоКонечныйОстаток"));
	
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоНач.СуммаНачальныйОстаток"));
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоКон.СуммаКонечныйОстаток"));
	
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоНач.НДСНачальныйОстаток"));
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоКон.НДСКонечныйОстаток"));

	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоНач.ВсегоНачальныйОстаток"));
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоКон.ВсегоКонечныйОстаток"));

	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоНач.Сумма_ВалютаНачальныйОстаток"));
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоКон.Сумма_ВалютаКонечныйОстаток"));
	
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоНач.НДС_ВалютаНачальныйОстаток"));
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоКон.НДС_ВалютаКонечныйОстаток"));
	
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоНач.Всего_ВалютаНачальныйОстаток"));
	Результат.Добавить(Новый ПолеКомпоновкиДанных("СальдоКон.Всего_ВалютаКонечныйОстаток"));

	Возврат Результат;

КонецФункции

Функция ПолучитьСоответствиеИменПоказателейПолям()
	
	Результат = новый Соответствие;
	
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоНач.КоличествоНачальныйОстаток"), 	"Количество");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Приход.КоличествоПриход"), 				"Количество");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Расход.КоличествоРасход"), 				"Количество");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоКон.КоличествоКонечныйОстаток"), 	"Количество");
	
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоНач.СуммаНачальныйОстаток"), 	"Сумма");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Приход.СуммаПриход"), 				"Сумма");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Расход.СуммаРасход"), 				"Сумма");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоКон.СуммаКонечныйОстаток"), 	"Сумма");
	
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоНач.НДСНачальныйОстаток"), "НДС");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Приход.НДСПриход"), 				"НДС");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Расход.НДСРасход"), 				"НДС");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоКон.НДСКонечныйОстаток"), 	"НДС");

	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоНач.ВсегоНачальныйОстаток"), 	"Всего");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Приход.ВсегоПриход"),	 			"Всего");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Расход.ВсегоРасход"), 				"Всего");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоКон.ВсегоКонечныйОстаток"), 	"Всего");

	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоНач.Сумма_ВалютаНачальныйОстаток"), 	"СуммаВал");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Приход.Сумма_ВалютаПриход"), 				"СуммаВал");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Расход.Сумма_ВалютаРасход"), 				"СуммаВал");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоКон.Сумма_ВалютаКонечныйОстаток"), 	"СуммаВал");
	
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоНач.НДС_ВалютаНачальныйОстаток"), 	"НДСВал");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Приход.НДС_ВалютаПриход"), 				"НДСВал");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Расход.НДС_ВалютаРасход"), 				"НДСВал");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоКон.НДС_ВалютаКонечныйОстаток"), 	"НДСВал");
	
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоНач.Всего_ВалютаНачальныйОстаток"), 	"ВсегоВал");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Приход.Всего_ВалютаПриход"), 				"ВсегоВал");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("Расход.Всего_ВалютаРасход"), 				"ВсегоВал");
	Результат.Вставить(Новый ПолеКомпоновкиДанных("СальдоКон.Всего_ВалютаКонечныйОстаток"), 	"ВсегоВал");

	Возврат Результат;
	
КонецФункции


#КонецЕсли