
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ЕстьПравоВводаКорректировки() Тогда
		ПоказатьПредупреждение(,"Недостаточно прав для ввода корректировки");
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("КорректируемыйДокумент",  ПараметрКоманды); 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения); 
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда   
		
		ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаОбъекта", СтруктураПараметров); 
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда  
		
		ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.ФормаОбъекта", СтруктураПараметров); 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЕстьПравоВводаКорректировки()
	
	Возврат CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Корректировки");
	
КонецФункции
 