
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	РазрешенныеСимволы = "1234567890_ЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮQWERTYUIOPASDFGHJKLZXCVBNM";
	//НеРазрешенныеСимволы= " !~`@№#;$%^:&?*()-+={}[]|/\.,<>";
	
	//Посимвольный разбор кода
	СтрокаКода =Объект.Код;
	Для поз = 1 по СтрДлина(Объект.Код) Цикл
		СимволКода = Сред(СтрокаКода,Поз,1);
		
		Если СтрНайти(РазрешенныеСимволы, ВРег(СимволКода)) = 0 Тогда
			Отказ = истина;
			ПоказатьПредупреждение(,"Не верный код! Код языка должен состоять из одного слова, начинаться с буквы и не содержать специальных символов кроме ""_""");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
