
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Ключ.Пустая() Тогда
		//Это новый документ 
		ОбновитьДанныеПараметровНаСервере();
	КонецЕсли;
	
	ОбновитьДанныеРегистрационныхЗнаков();
	
	ОбновитьДобавленныеКолонки();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДобавленныеКолонки()
	
	Для Каждого СтрокаДанных из Объект.УстанавливаемыеПараметрыТС Цикл
		СтрокаДанных.ЗначениеДоступность = СтрокаДанных.ДействиеСоЗначениемПараметра = "Изменить"
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокДоступныхПараметровТранспортнооСредства()
	
	СтрПараметры = CW_УчетСобственногоТранспортаСервер.ПолучитьУстанавливаемыеПараметры();
	
	Для каждого ЭлементСтркутуры из СтрПараметры Цикл
		
		ПараметрыОтбора = Новый Структура("ПараметрТранпортногоСредства",ЭлементСтркутуры.Значение);
		мСтроки = Объект.УстанавливаемыеПараметрыТС.НайтиСтроки(ПараметрыОтбора);
		
		Если мСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.УстанавливаемыеПараметрыТС.Добавить();
			НоваяСтрока.ПараметрТранпортногоСредства 	=  ЭлементСтркутуры.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияПараметровТранспортногоСредства()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВнешниеДанные.ПараметрТранпортногоСредства КАК ПараметрТранпортногоСредства
	               |ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	               |ИЗ
	               |	&ВнешниеДанные КАК ВнешниеДанные
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПараметрТранпортногоСредства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ПараметрыТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	CW_ПараметрыТССрезПоследних.ПараметрТранпортногоСредства КАК ПараметрТранпортногоСредства,
	               |	CW_ПараметрыТССрезПоследних.Значение КАК Значение
	               |ПОМЕСТИТЬ ВТ_ЗначенияПараметров
	               |ИЗ
	               |	РегистрСведений.CW_ПараметрыТС.СрезПоследних(
	               |			&ДатаСреза,
	               |			ТранспортноеСредство = &ТранспортноеСредство
	               |				И ПараметрТранпортногоСредства <> &Параметр_РегистрацонныйЗнак) КАК CW_ПараметрыТССрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПараметрТранпортногоСредства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаДокумента.ПараметрТранпортногоСредства КАК ПараметрТранпортногоСредства,
	               |	ЕСТЬNULL(ВТ_ЗначенияПараметров.Значение, НЕОПРЕДЕЛЕНО) КАК СтароеЗначение,
	               |	НЕОПРЕДЕЛЕНО КАК Значение,
	               |	""Не изменять"" КАК ДействиеСоЗначениемПараметра
	               |ИЗ
	               |	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияПараметров КАК ВТ_ЗначенияПараметров
	               |		ПО ВТ_ТаблицаДокумента.ПараметрТранпортногоСредства = ВТ_ЗначенияПараметров.ПараметрТранпортногоСредства";
	
	ВнешниеДанные = Объект.УстанавливаемыеПараметрыТС.Выгрузить();
	
	Запрос.УстановитьПараметр("ДатаСреза"			, Объект.Дата);
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.ТранспортноеСредство);
	Запрос.УстановитьПараметр("ВнешниеДанные"		, ВнешниеДанные);
	
	//ВРЕМЕННО
	Запрос.УстановитьПараметр("Параметр_РегистрацонныйЗнак"		, ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.РегистрационныйЗнак);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.УстанавливаемыеПараметрыТС.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеРегистрационныхЗнаков()
	
	РегистрационныйЗнак = РегистрыСведений.CW_РегистрацонныеЗнакиАвтомобилей.ПолучитьПредставлениеГосНомераТранспортногоСредства(Объект.Дата, Объект.ТранспортноеСредство);

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПараметровНаСервере()
	ОбновитьСписокДоступныхПараметровТранспортнооСредства();
	ОбновитьЗначенияПараметровТранспортногоСредства();	
КонецПроцедуры


&НаКлиенте
Процедура УстанавливаемыеПараметрыТСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
		
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	ИначеЕсли ИмяСобытия = "ОбновитьРегистрационныеНомера" Тогда
		
		ОбновитьДанныеРегистрационныхЗнаков();
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()
	
	ОбновитьЗначенияПараметровТранспортногоСредства();
	ОбновитьДанныеРегистрационныхЗнаков();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеДействияПараметра(ИдентификаторСтроки)
	
	СтрокаДанных = Объект.УстанавливаемыеПараметрыТС.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если СтрокаДанных.ДействиеСоЗначениемПараметра = "Не изменять" Тогда
		СтрокаДанных.Значение = Неопределено;
	КонецЕсли;
	
	СтрокаДанных.ЗначениеДоступность = СтрокаДанных.ДействиеСоЗначениемПараметра = "Изменить";
	
КонецПроцедуры

&НаКлиенте
Процедура УстанавливаемыеПараметрыТСДействиеСоЗначениемПараметраПриИзменении(Элемент)
	ОбработатьИзменениеДействияПараметра(Элементы.УстанавливаемыеПараметрыТС.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура УстанавливаемыеПараметрыТСЗначениеПараметраПриИзмененииНаСервере(ИдентификаторСтроки)
	
	СтрокаДанных = Объект.УстанавливаемыеПараметрыТС.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если ЗначениеЗаполнено(СтрокаДанных.Значение) Тогда
		СтрокаДанных.ДействиеСоЗначениемПараметра = "Изменить";	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстанавливаемыеПараметрыТСЗначениеПараметраПриИзменении(Элемент)
	УстанавливаемыеПараметрыТСЗначениеПараметраПриИзмененииНаСервере(Элементы.УстанавливаемыеПараметрыТС.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ТранспортноеСредствоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьДанныеПараметровНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ОпределитьВыборГруппИЭлементовПоля(ИдентификаторСтроки)
	
	СтрокаДанных = Объект.УстанавливаемыеПараметрыТС.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Возврат СтрокаДанных.ПараметрТранпортногоСредства = ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.ГруппаПутевыхЛистов;
	
КонецФункции


&НаКлиенте
Процедура УстанавливаемыеПараметрыТСЗначениеПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыбиратьГруппы = ОпределитьВыборГруппИЭлементовПоля(Элементы.УстанавливаемыеПараметрыТС.ТекущаяСтрока);
	Элемент.ВыборГруппИЭлементов = ?(ВыбиратьГруппы, ГруппыИЭлементы.ГруппыИЭлементы, ГруппыИЭлементы.Авто);
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры


#КонецОбласти