#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	CW_УчетСобственногоТранспортаСервер.ПодготовитьДвженияКПроведению(ЭтотОбъект);
	
	МассивИменРегистров = CW_УчетСобственногоТранспортаСервер.ПолучитьИспользуемыеРегистры(ЭтотОбъект);
	
	ДанныеДляПроведения = ПодготовитьДанныеДляПроведения(МассивИменРегистров);
	
	CW_УчетСобственногоТранспортаСервер.ЗарегистрироватьДвиженияДокумента(Движения,ДанныеДляПроведения,МассивИменРегистров);	

КонецПроцедуры

Функция ПодготовитьДанныеДляПроведения(МассивИменРегистров)
	
	ДанныеДляПроведения 		= CW_УчетСобственногоТранспортаСервер.ПодготовитьТаблицыДанныхДляПроведения(МассивИменРегистров);
	
	Для Каждого СтрокаДок из ШиныТранспортногоСредства Цикл
		
		СтрокаСостояния = ДанныеДляПроведения.CW_ШиныТС.Добавить();
		СтрокаСостояния.Период = Дата;
		СтрокаСостояния.ТранспортноеСредство 	= ТранспортноеСредство;
		СтрокаСостояния.Шина 					= СтрокаДок.Шина;
		СтрокаСостояния.МестоУстановкиШины 		= СтрокаДок.МестоУстановкиШины;
		
	КонецЦикла;
	// ---	
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

#КонецЕсли