
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Отбор.Свойство("Владелец", Параметр);
	
КонецПроцедуры

&НаСервере
Процедура ПараметрПриИзмененииНаСервере()

	Список.Отбор.Элементы.Очистить();
	
	НовыйЭлемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Владелец");
	НовыйЭлемент.ВидСравнения  		= ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлемент.ПравоеЗначение   	= Параметр;
	НовыйЭлемент.Использование 		= Истина ;

КонецПроцедуры

&НаКлиенте
Процедура ПараметрПриИзменении(Элемент)
	ПараметрПриИзмененииНаСервере();
КонецПроцедуры
