
Функция ПолучитьПорядокОтраженияДляУчетаВСоставеНЗП() Экспорт
	
	Расходы = Новый Массив;
	Расходы.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"));
	
	Доходы = Новый Массив;
	Доходы.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
	
	Результат = Новый Структура;
	Результат.Вставить("Расходы", Расходы);
	Результат.Вставить("Доходы",  Доходы);
	
	Возврат Результат;
	
КонецФункции   

функция ПолучитьМассивГрузоперевозокПоНЗП(Грузоперевозки, ПараметрНеВключатьВНЗП) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_Грузоперевозки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Грузоперевозки
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.Ссылка В(&Грузоперевозки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	|	ВЫРАЗИТЬ(CW_ХарактеристикиГрузоперевозок.Значение КАК БУЛЕВО) КАК Значение
	|ПОМЕСТИТЬ ВТ_ЗначенияПараметров
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	|ГДЕ
	|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка В(&Грузоперевозки)
	|	И CW_ХарактеристикиГрузоперевозок.Параметр = &ПараметрНеВключатьВНЗП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Грузоперевозка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Грузоперевозки.Ссылка КАК Грузоперевозка,
	|	ЕСТЬNULL(ВТ_ЗначенияПараметров.Значение, ЛОЖЬ) КАК Значение
	|ИЗ
	|	ВТ_Грузоперевозки КАК ВТ_Грузоперевозки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияПараметров КАК ВТ_ЗначенияПараметров
	|		ПО ВТ_Грузоперевозки.Ссылка = ВТ_ЗначенияПараметров.Грузоперевозка
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ЗначенияПараметров.Значение, ЛОЖЬ) = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Грузоперевозки", 		Грузоперевозки);
	Запрос.УстановитьПараметр("ПараметрНеВключатьВНЗП", ПараметрНеВключатьВНЗП);

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	
КонецФункции