
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрПериодОтчета 			= Новый ПараметрКомпоновкиДанных("ПериодОтчета");
	ЗначениеПараметраПериодОтчета 	= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрПериодОтчета); 

	ИдентификаторПользовательсколйНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(ЗначениеПараметраПериодОтчета);
	ЗначениеПараметраНастроекКомпоновкиДанных = КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьОбъектПоИдентификатору(ИдентификаторПользовательсколйНастройки);
	ПериодОтчета = ЗначениеПараметраНастроекКомпоновкиДанных.Значение;
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета", ПериодОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода",	ПериодОтчета.ДатаНачала);
	СтруктураПараметров.Вставить("КонецПериода",	ПериодОтчета.ДатаОкончания);
	
	ВНД_Доходы = ПолучитьТаблицуДоходы(СтруктураПараметров);
	
	ВнешнийНаборДанных = Новый Структура("ВНД_Доходы", ВНД_Доходы);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ПолучитьТаблицуДоходы(СтруктураПараметров)
	
	ПроверятьВедомыеДокументы = Истина;
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	МассивПорядокОтражения = новый Массив;  
	МассивПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
	МассивПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Организация КАК Организация,
	|	CW_ДоходыПоГрузоперевозкам.Контрагент КАК Контрагент,
	|	CW_ДоходыПоГрузоперевозкам.Договор КАК Договор,
	|	CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов КАК ДокументДоходов,
	|	НЕОПРЕДЕЛЕНО КАК ДокументРеализации,
	|	СУММА(CW_ДоходыПоГрузоперевозкам.Всего) КАК СуммаРеализацииРуб,
	|	СУММА(ВЫБОР
	|			КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяССЫЛКА)
	|				ТОГДА ВЫБОР
	|						КОГДА CW_ДоходыПоГрузоперевозкам.Договор.ВзаиморасчетыВУЕ
	|							ТОГДА CW_ДоходыПоГрузоперевозкам.Всего
	|						ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Всего_Валюта
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору.ВзаиморасчетыВУЕ
	|						ТОГДА CW_ДоходыПоГрузоперевозкам.Всего
	|					ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Всего_Валюта
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаРеализации,
	|	ВЫБОР
	|		КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяССЫЛКА)
	|			ТОГДА ВЫБОР
	|					КОГДА CW_ДоходыПоГрузоперевозкам.Договор.ВзаиморасчетыВУЕ
	|						ТОГДА &ВалютаРегламентированногоУчета
	|					ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору.ВзаиморасчетыВУЕ
	|					ТОГДА &ВалютаРегламентированногоУчета
	|				ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	|			КОНЕЦ
	|	КОНЕЦ КАК Валюта,
	|	"""" КАК ОбщийИтог0,
	|	"""" КАК Период0
	|ИЗ
	|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозкам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И CW_ДоходыПоГрузоперевозкам.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И CW_ДоходыПоГрузоперевозкам.ПорядокОтражения В(&ПорядокОтражения)
	|	И CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяАкт = ИСТИНА
	|	И CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяСчетФактура = ИСТИНА
	|	//УСЛОВИЕ_ВедомыеДокументы
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДоходыПоГрузоперевозкам.Договор,
	|	CW_ДоходыПоГрузоперевозкам.Контрагент,
	|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов,
	|	CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору,
	|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Организация,
	|	ВЫБОР
	|		КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяССЫЛКА)
	|			ТОГДА ВЫБОР
	|					КОГДА CW_ДоходыПоГрузоперевозкам.Договор.ВзаиморасчетыВУЕ
	|						ТОГДА &ВалютаРегламентированногоУчета
	|					ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору.ВзаиморасчетыВУЕ
	|					ТОГДА &ВалютаРегламентированногоУчета
	|				ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	|			КОНЕЦ
	|	КОНЕЦ";  
	
	Запрос.УстановитьПараметр("НачалоПериода", 		СтруктураПараметров.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", 		СтруктураПараметров.КонецПериода);
	Запрос.УстановитьПараметр("ПорядокОтражения", 	МассивПорядокОтражения); 
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета); 
	     
	Если ПроверятьВедомыеДокументы Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ВедомыеДокументы", "И (НЕ CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ВедомыйДокумент = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
		|			ИЛИ НЕ CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ВедомыйДокументКорректировки = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка))");	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДоходы = РезультатЗапроса.Выгрузить();
	
	Для Каждого СтрокаТаблицы из ТаблицаДоходы Цикл  
		ВедомыйВедущий = CW_РеестрыНДС0СерверВызовСервера.ПолучитьВедомыйВедущийДокумент(СтрокаТаблицы.ДокументДоходов);
		СтрокаТаблицы.ДокументРеализации = ВедомыйВедущий.ВедомыйДокумент;
		СтрокаТаблицы.СуммаРеализации    = CW_РеестрыНДС0Дополнительный.ПересчитатьСуммуРеализации(
												СтрокаТаблицы.СуммаРеализации,
												СтрокаТаблицы.СуммаРеализацииРуб,
												СтрокаТаблицы.Валюта,
												СтрокаТаблицы.ДокументДоходов);
	КонецЦикла;
	
	Возврат ТаблицаДоходы;   
	
КонецФункции