#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Универсальный передаточный документ";
	СтруктураОписания.Описание 					= "Печатная форма универсального передаточного документа (УПД)";
	
	СтруктураОписания.Версия					= "3.2.9.4";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.17.3";
	СтруктураОписания.ИсторияИзменений			= Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерИсправления]", 			"Номер исправлния", 			"ПолучитьНомерИсправления(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления
	
	Возврат СтруктураОписания;
	
КонецФункции

Процедура Регистрация(Ссылка) Экспорт
	
	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_ДоходыПоГрузоперевозке");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "УПД"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		

	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);

КонецПроцедуры

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	Возврат СсылкаНаОбъект.ЭтоУниверсальныйДокумент 
	И (СсылкаНаОбъект.ФормируетсяСчетФактура ИЛИ СсылкаНаОбъект.ФормируетсяАкт); 
	
КонецФункции

Функция ИспользованиеВКонтексте(КонтекстВызова) Экспорт 
	
	Возврат	ТипЗнч(КонтекстВызова) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора");
	
КонецФункции

Функция ПолучитьМакетИсторииИзменений() Экспорт 
	
	Возврат ПолучитьМакет("ИсторияИзменений");
	
КонецФункции

//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьНомерИсправления(ПараметрыПроцедуры) Экспорт
	
	НомерИсправления  = ?(ЗначениеЗаполнено(ПараметрыПроцедуры.НомерИсправления), " (испр. "+Формат(ПараметрыПроцедуры.НомерИсправления,"ЧГ=0")+")","");
	Возврат СокрЛП(НомерИсправления);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления

Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт
	
	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	КонецЕсли; 
	
	Если СсылкаНаОбъект.Корректировка Тогда
		Если НужноПечататьОбычныйСчетФактуру(СсылкаНаОбъект) Тогда
			Возврат ПечатьУПД(НастройкиПечати);
		Иначе
			Возврат ПечатьУКД(НастройкиПечати);
		КонецЕсли;
	Иначе
		Возврат ПечатьУПД(НастройкиПечати);
	КонецЕсли;
	
КонецФункции

Функция ПечатьУПД(НастройкиПечати)
	
	#Область ИнициализацияСлужебныхПеременных
	
	// для удобства обращения по тексту кода
	Ссылка = СсылкаНаОбъект;     
	Если СсылкаНаОбъект.Корректировка Тогда
		ВедомыйДокумент = СсылкаНаОбъект.ВедомыйДокументКорректировки;
	Иначе
		ВедомыйДокумент = СсылкаНаОбъект.ВедомыйДокумент;
	КонецЕсли;
	
	// получаем настройку из учетной политики
	ИспользоватьПостановление1137 = CW_Настройки.ПараметрУчетнойПолитики(ВедомыйДокумент.Дата, Ссылка.Организация, "СчетаФактурыПоПостановлению1137");
	Если ИспользоватьПостановление1137 = Неопределено Тогда
		ИспользоватьПостановление1137 = Ложь;
	КонецЕсли; 
	
	// признак того, что наша организация является индивидуальным предпринимателем
	ИП = ЗначениеЗаполнено(Ссылка.Организация.ИндивидуальныйПредприниматель); 
	
	// флаг того, что все строки документа были только перевыставляемыми
	ТолькоПеревыставляемые = Истина;
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.CW_ЗакрытиеГрузоперевозки") Тогда
		Для Каждого Стр Из Ссылка.Услуги Цикл
			Если Стр.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление Тогда
				ТолькоПеревыставляемые = Ложь;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	Иначе 
		ТолькоПеревыставляемые = Ложь;	
	КонецЕсли; 
	
	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();

	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхАкта", Истина);
	Если КоличествоЭксземпляров <> Неопределено Тогда 
		РезультатПечати.Параметры.Количество = КоличествоЭксземпляров;
		РезультатПечати.Параметры.Печать 	 = (КоличествоЭксземпляров <> 0);  
	Иначе
		РезультатПечати.Параметры.Количество = 2;
		РезультатПечати.Параметры.Печать 	 = Истина;  
	КонецЕсли;  

	// параметры договора
	СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметровДоговора.Дата 				= ВедомыйДокумент.Дата;
	СтруктураПараметровДоговора.Договор 			= Ссылка.Договор;
	СтруктураПараметровДоговора.ПриложениеКДоговору = Ссылка.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора);
	
	// вариант вывода реквизита "Продавец": 
	// "Истина" - в качестве продавца безальтернативно (всегда) выводится своя организация;
	// "Ложь" - заполнение продавца будет зависить от других опций (применение постановления №1137, 
	// признака того что это сводная или смешанная с\ф и пр.)
	ПродавецПоСФСвояОрганизация = ПараметрыДоговора.ПродавецПоСФСвояОрганизация;
	
	// вариант вывода сводной с\ф: "0" - сводно, "1" - своя организация в качестве продавца
	//ВариантВыводаСводнойСФ = ПараметрыДоговора.ВариантВыводаСводнойСчетФактуры;   //AFR-233396
	
	#КонецОбласти 
	
	#Область ПараметрыДляВыводаВФормуПакета
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				СсылкаНаОбъект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		СсылкаНаОбъект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, СсылкаНаОбъект.Дата);
	
	// формируем представление
	Если Ссылка.ФормируетсяСчетФактура Тогда
		Если ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет Тогда
			СФ = ПолучитьВедомыйСчетФактуру(Ссылка);
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(СФ);
			ДатаДокумента = СФ.Дата;
		Иначе
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерСчетаФактуры", "ДатаСчетаФактуры");
			ДатаДокумента = Ссылка.ДатаСчетаФактуры;
		КонецЕсли; 
	Иначе	
		Если (ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(ВедомыйДокумент);
			ДатаДокумента = ВедомыйДокумент.Дата;
		Иначе
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерАкта", "ДатаАкта");
			ДатаДокумента = Ссылка.ДатаАкта;
		КонецЕсли; 
	КонецЕсли;     

	ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(ДатаДокумента);
	
	ПродавецПоСФСвояОрганизация = ?(ДатаДокумента < дата(2012,1,1), Истина,  ПродавецПоСФСвояОрганизация);		
	
	
	ПредставлениеДокумента = "УПД №" + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
	
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(ПредставлениеДокумента));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НомерДокумента",	НомерДокумента);
	ПараметрыПроцедуры.Вставить("ДатаДокумента",	ДатаДокумента);
	ПараметрыПроцедуры.Вставить("НомерИсправления",	СсылкаНаОбъект.НомерИсправления);
	
	РезультатПечати.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы
	
	#КонецОбласти 
	
	#Область ЗаполнениеРеквизитовПродавца
	
	// Принципиально возможны следующие варианты:
	// - Если в параметрах договора задана опция "выводить свою организацию в качестве продавца",
	// 	 то в качестве продавца всегда будет выведена наша организация (прочие условия не анализируются).
	// - Если в документе есть собственные услуги, то в качестве продавца 
	//   будет всегда выводится наша организация (это простая и смешанная с\ф).
	// - Если в документе толко перевыставляемые услуги (с\ф на возмещение), 
	//   то в зависимости от опции "ВариантВыводаСводнойСФ" в параметрах 
	//   договора выводим или нашу организацию или перечисляем всех продавцов 
	//   по перевыставляемым с\ф (с\ф документов затрат), НО если в документе 
	//   только один реальный продавец, то не зависимо от опции "ВариантВыводаСводнойСФ"
	//   в качестве продавца будет выведен именно он.
	
	// это временная переменная, если она в результате всех проверок останется пустой,
	// то в качестве продавца подставим собственную организацию
	Продавец = Справочники.Контрагенты.ПустаяСсылка();
	
	// это массив реальных продавцов для сводной с\ф
	ТЗ_Продавцов = _сф.т_Создать("Продавец,КПП,СокращенноеНаименование,ПолноеНаименование,НаименованиеДляПечатныхФорм");
	
	// несколько продавцов может быть только по документу "ДоходыПоГрузоперевозке" 
	Если ТипЗнч(Ссылка) =  Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		// до вступления в силу постановления №1137 в качестве продавца всегда выступает наша организация 
		ПродавецПоСФСвояОрганизация = ?(ВедомыйДокумент.Дата < дата(2012,1,1), Истина,  ПродавецПоСФСвояОрганизация);		
		
		// если в карточке договора не задана опция выводить в качестве продавца 
		// свою организацию, то проанализируем содержание табличной части и 
		// другие опции договора
		Если Не ПродавецПоСФСвояОрганизация Тогда
			
			// в документе только перевыставляемые услуги
			Если ТолькоПеревыставляемые Тогда
				
				МассивДокументов = _сф.м_СоздатьИзКолонкиТЗ(Ссылка.Услуги.Выгрузить(),"ДокументРасходов");
				Для Каждого Стр Из МассивДокументов Цикл
					
					НСтр = ТЗ_Продавцов.Добавить();
					Если Стр.Продавец.Пустая() Тогда
						НСтр.Продавец = Стр.Контрагент;
					Иначе
						НСтр.Продавец = Стр.Продавец;
					КонецЕсли;
					
					Если ТипЗнч(НСтр.Продавец) = Тип("СправочникСсылка.Контрагенты") Тогда
						НаименованияНаДату 	= Справочники.Контрагенты.НаименованияНаДату(Нстр.Продавец, ДатаДокумента);
						КППнаДату 			= Справочники.Контрагенты.КППНаДату(Нстр.Продавец, ДатаДокумента);
					Иначе
						НаименованияНаДату 	= Справочники.Организации.НаименованияНаДату(Нстр.Продавец, ДатаДокумента);
						КППнаДату 			= Справочники.Организации.КППНаДату(Нстр.Продавец, ДатаДокумента);
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(НСтр,НаименованияНаДату);
					
					Нстр.КПП 							= КППнаДату;
					
					//КонецЕсли; // если при выводе "сводной" с\ф надо выводить реальных продавцов	
				КонецЦикла; // перебор перевыставляемых документов затрат 
				ТЗ_Продавцов.Свернуть("Продавец,КПП,СокращенноеНаименование,ПолноеНаименование,НаименованиеДляПечатныхФорм");
				
			КонецЕсли; // в документе только перевыставляемые услуги 
			//КонецЕсли; // вывод в соответствии с постановлением 1137
		КонецЕсли; // в параметрах договора вывод собственной организации в качестве продавца не установлен 
	КонецЕсли; // это ссылка на документ "Расходы по грузоперевозке"
	
	// если вывод печатной формы в режиме акта,
	// то в качестве продавца всегда своя организация
	Если (НЕ Ссылка.ФормируетсяСчетФактура) Тогда
		Продавец = Справочники.Контрагенты.ПустаяСсылка();
		ТЗ_Продавцов.Очистить();
	КонецЕсли; 
	
	// вывод в качестве продавца одного реального продавца
	Если НЕ Продавец.Пустая() Тогда     
		НаДату = ВедомыйДокумент.Дата;
		СведенияОПоставщике = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Продавец, НаДату); 
		
		Если ТипЗнч(Продавец) = Тип("СправочникСсылка.Контрагенты") Тогда
			НаименованияНаДату 	    = Справочники.Контрагенты.НаименованияНаДату(Продавец, ДатаДокумента);
			КППнаДату 			    = Справочники.Контрагенты.КППНаДату(Продавец, ДатаДокумента);
			ПредставлениеПоставщика = НаименованияНаДату.ПолноеНаименование;
		Иначе
			НаименованияНаДату      = Справочники.Организации.НаименованияНаДату(Нстр.Продавец, ДатаДокумента);
			КППнаДату 			    = Справочники.Организации.КППНаДату(Продавец, ДатаДокумента);
			ПредставлениеПоставщика = НаименованияНаДату.СокращенноеНаименование;
		КонецЕсли;
		
		АдресПоставщика         = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике,"ЮридическийАдрес"); 
		
		ИННПоставщика           = Продавец.ИНН + "/"+ КППнаДату;
		
		// вывод нескольких продавцов (сводная с\ф)
	ИначеЕсли ТЗ_Продавцов.Количество() > 0 Тогда
		
		ПредставлениеПоставщика = "";
		АдресПоставщика = "";
		ИННПоставщика = "";
		
		Для Каждого СтрПр из ТЗ_Продавцов Цикл   
			
			НаДату 					= ВедомыйДокумент.Дата;
			СведенияОПоставщике 	= CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(СтрПр.Продавец, НаДату); // ВызовБП
			
			ПредставлениеПоставщика = ПредставлениеПоставщика + СтрПр.ПолноеНаименование + "; ";
			АдресПоставщика 		= АдресПоставщика + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес") + "; "; // ВызовБП
			ИННПоставщика 			= ИННПоставщика + СтрПр.Продавец.ИНН + "/"+ СтрПр.КПП + "; ";
		КонецЦикла;	
		
		ПредставлениеПоставщика = Сред(ПредставлениеПоставщика, 1, СтрДлина(ПредставлениеПоставщика) - 2);
		АдресПоставщика = Сред(АдресПоставщика, 1, СтрДлина(АдресПоставщика) - 2);
		ИННПоставщика = Сред(ИННПоставщика, 1, СтрДлина(ИННПоставщика) - 2);
		
		// вывод в качестве продавца нашу организацию
	Иначе
		
		НаДату 				 = ВедомыйДокумент.Дата;
		СведенияОПоставщике  = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, НаДату); 
		
		НаименованияНаДату 	= Справочники.Организации.НаименованияНаДату(Ссылка.Организация, ДатаДокумента);
		КППнаДату 			= Справочники.Организации.КППНаДату(Ссылка.Организация, ДатаДокумента);
		
		Если ЗначениеЗаполнено(Ссылка.ПодразделениеОрганизации) Тогда
			Если Ссылка.ПодразделениеОрганизации.ОбособленноеПодразделение Тогда
				КППнаДату = Справочники.ПодразделенияОрганизаций.КППНаДату(Ссылка.ПодразделениеОрганизации, ДатаДокумента);
			КонецЕсли;
		КонецЕсли;
		
		ПредставлениеПоставщика = НаименованияНаДату.СокращенноеНаименование;
		АдресПоставщика         = ПараметрыДоговора.АдресОрганизации;
		ИННПоставщика           = Ссылка.Организация.ИНН + "/" + КППнаДату;
	КонецЕсли; 
	
	#КонецОбласти 
	
	#Область ПолучениеТаблицыУслуг
	
	РасчетыУЕ = ВедомыйДокумент.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах;
	Если (ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
		
		ТаблицаУслуг = _БЭ.ПолучитьУслугиДокумента(Ссылка);
		ТаблицаУслуг.Колонки.Добавить("ПредставлениеГП");
		Для Каждого СтрТУ из ТаблицаУслуг Цикл
			СтрТУ.ПредставлениеГП = СокрЛП(СтрТУ.Грузоперевозка.CW_Представление);
		КонецЦикла;			
		Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов) И ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.СворачиватьПоГрузоперевозкам Тогда
			ТЗ_Усл = ТаблицаУслуг.Скопировать();
			ТЗ_Ит  = ТаблицаУслуг.Скопировать();
			ТЗ_Ит.Очистить();
			ТЗ_ГП  = ТЗ_Усл.Скопировать();
			ТЗ_ГП.Свернуть("ПредставлениеГП");
			ТЗ_ГП.Колонки.Добавить("Представление");
			ТЗ_ГП.Колонки.Добавить("НомСтр");
			ТЗ_ГП.Колонки.Добавить("Итого");
			НомСтр = 0;
			Для Каждого Стр_ГП из ТЗ_ГП Цикл
				ТЗ_Отбор = ТЗ_Усл.Скопировать(Новый Структура("ПредставлениеГП", Стр_ГП.ПредставлениеГП));
				
				Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
					Стр_ГП.Представление = _БЭ.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкамАнгл, Ссылка, Неопределено, ТЗ_Отбор);
				ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
					Стр_ГП.Представление = _БЭ.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкам, Ссылка, Неопределено, ТЗ_Отбор) + " / " + _БЭ.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкамАнгл, Ссылка, Неопределено, ТЗ_Отбор);
				Иначе 
					Стр_ГП.Представление = _БЭ.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкам, Ссылка, Неопределено, ТЗ_Отбор);
				КонецЕсли;
				Стр_ГП.НомСтр = НомСтр;
				Стр_ГП.Итого  = ТЗ_Отбор.Итог("Всего");
				
				CW_Печать.ПодготовитьТаблицуУслуг(ТЗ_Отбор,Ссылка,ПараметрыДоговора,"акт");
				Для Каждого Стр_Отбор из ТЗ_Отбор Цикл
					Стр_Ит = ТЗ_Ит.Добавить();
					ЗаполнитьЗначенияСвойств(Стр_Ит, Стр_Отбор);
				КонецЦикла;	
				НомСтр = НомСтр + 1 + ТЗ_Отбор.Количество();
			КонецЦикла;
			ТаблицаУслуг = ТЗ_Ит.Скопировать();
		Иначе				
			CW_Печать.ПодготовитьТаблицуУслуг(ТаблицаУслуг,Ссылка,ПараметрыДоговора,"акт");
		КонецЕсли;	
		
	ИначеЕсли (ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_ЗакрытиеГрузоперевозки")) Тогда
		
		ТаблицаУслуг = Ссылка.Вознаграждение.Выгрузить();
		РасчетыУЕ = Ложь;
		
	КонецЕсли;
	
	ВсегоСтрокДляВывода = ТаблицаУслуг.Количество();
	
	#КонецОбласти
	
	// формируем печатную форму
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "CW_ПЕЧАТЬ_УПД";
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	
	// выбираем макет для заполнения
	Если ДатаДокумента >= Дата(2026,4,1) Тогда 
		Макет = ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент26");
	ИначеЕсли ДатаДокумента >= Дата(2026,1,1) Тогда 
		Макет = ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент2026");
	ИначеЕсли ДатаДокумента >= Дата(2024,10,1) Тогда 
		Макет = ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент1096");
	ИначеЕсли ДатаДокумента >= Дата(2017,10,01) Тогда
		Если ВерсияПостановления1137 >=5 Тогда
			Макет = ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент534");
		Иначе
			Макет = ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент981");
		КонецЕсли;
	Иначе
		Макет = ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент");
	КонецЕсли;   
	
	Если Ссылка.Контрагент.ОбособленноеПодразделение 
		И Ссылка.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
		НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент.ГоловнойКонтрагент, ДатаДокумента);
	Иначе
		НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент,ДатаДокумента);
	КонецЕсли;

	КПП_Контрагента 		= Справочники.Контрагенты.КППНаДату(Ссылка.Контрагент,ДатаДокумента);
	
	//ИдентификаторДокумента
	ИспользуетсяЭлектронныйОбменДанными = Константы.CW_ИспользуетсяЭлектронныйОбменДанными.Получить(); 
	Если ДатаДокумента >= Дата(2024,10,1) и ИспользуетсяЭлектронныйОбменДанными Тогда 
		ИдентификаторДокумента = Макет.ПолучитьОбласть("ИдентификаторДокумента");  
		ИдентификаторДокумента.Параметры.ИдентификаторДокумента = СокрЛП(XMLСтрока(СсылкаНаОбъект));
		ТабличныйДокумент.Вывести(ИдентификаторДокумента);
	КонецЕсли;              
	//ИдентификаторДокумента
	
	//Инициализация областей документа
	Шапка         = Макет.ПолучитьОбласть("Шапка");
	ШапкаТаблицы  = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	СтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
	ПодвалТаблицы = Макет.ПолучитьОбласть("Итого");
	
	//Дополнение 
	ОбластьДополнениеШапка			= Макет.ПолучитьОбласть("ДополнениеШапки");
	ОбластьДополнениеПодвал			= Макет.ПолучитьОбласть("Дополнение"); 
	ОбластьДополнениеЛинияСверху	= Макет.ПолучитьОбласть("ДополнениеЛинияСверху"); 
	//Дополнение 
	
	Заглушка 	  = Неопределено;
	ГосКонтракт   = Неопределено;  
	Если ВерсияПостановления1137 < 5 Тогда  
		Если Макет.Области.Найти("Заглушка") <> Неопределено Тогда
			Заглушка 	  = Макет.ПолучитьОбласть("Заглушка");
		КонецЕсли;
		Если Макет.Области.Найти("ИдентификаторГосКонтракта") <> Неопределено Тогда
			ГосКонтракт   = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");  
		КонецЕсли;
	КонецЕсли;
	
	ВыводитьПодписиИПечать = НастройкиПечати.ПодписьИПечать = Истина ИЛИ (Ссылка.Договор.ПодписьИПечатьАкты И НастройкиПечати.ДляРассылки);
	Если НЕ ВыводитьПодписиИПечать Тогда
		Подписи  = Макет.ПолучитьОбласть("Подвал");
		Подписи2 = Макет.ПолучитьОбласть("ПодвалНакладной");
	Иначе
		Подписи  = Макет.ПолучитьОбласть("ПодвалПодписи");
		Подписи2 = Макет.ПолучитьОбласть("ПодвалНакладнойПодписи");
	КонецЕсли;
	НумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
	//Инициализация областей документа
	
	СписокСвязанныхСчетов = "";
	Если ПараметрыДоговора.ВыводитьВАктахИнформациюОСчетах Тогда
		СписокСвязанныхСчетов = СписокСвязанныхСчетов();
	КонецЕсли;	
	
	Подписи2.Параметры.ДанныеТранспортнаяНакладная 	= Ссылка.СведенияОТранспортировкеИГрузе;
	Подписи2.Параметры.СопроводительныеДокументы 	= СокрЛП(Ссылка.СопроводительныеДокументы + " " + СписокСвязанныхСчетов);
	
	//Заголовок печатной формы
	Если Ссылка.ФормируетсяСчетФактура Тогда
		Шапка.Параметры.СтатусУПД = "1";
	Иначе
		Шапка.Параметры.СтатусУПД = "2";
	КонецЕсли;	
	
	Шапка.Параметры.Номер = НомерДокумента;
	Шапка.Параметры.Дата  = Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
	
	Если Ссылка.Корректировка И Ссылка.ЭтоУниверсальныйДокумент 
		И  Ссылка.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда 
		Шапка.Параметры.НомерИсправления = Ссылка.НомерИсправления;
		Шапка.Параметры.ДатаИсправления  = Формат(Ссылка.ДатаСчетаФактуры, "ДФ=dd.MM.yyyy");
	Иначе
		Шапка.Параметры.НомерИсправления = "--";
		Шапка.Параметры.ДатаИсправления  = "--";
	КонецЕсли;
	
	Шапка.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
	Шапка.Параметры.АдресПоставщика         = АдресПоставщика;
	Шапка.Параметры.ИННПоставщика           = ИННПоставщика;
	
	Шапка.Параметры.ПредставлениеГрузоотправителя = "--";
	Шапка.Параметры.ПредставлениеГрузополучателя  = "--";
	
	#Область РасчетноПлатежныеДокументы
	
	_стр = "";
	
	// В документе "ДоходыПоГрузоперевозке" расчетно-платежные документы указаны 
	// в одноименной табличной части документа. Подготовим строку для вывода в макет.
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		Если Ссылка.ПлатёжноРасчётныеДокументы.Количество() = 0 Тогда
			
			// до 01.10.17 г при отсутствии в табличной части строк используем 
			// "старый" алгоритм вывода расчетно-платежных документов - 
			// по информации о зачтенных авансах. Расчетно-платежные документы
			// берем из ТЧ "ЗачетАвансов" (при зачете аванса они туда всегда 
			// прописываются в явном виде)
			Если ДатаДокумента < Дата(2017,10,01) Тогда 
				Для Каждого ПлатежныйДокумент Из Ссылка.ЗачетАвансов Цикл
					Если Не ПустаяСтрока(ПлатежныйДокумент.ПредставлениеДокументаАванса) Тогда
						_стр = _стр + "; " + Сред(СокрЛП(ПлатежныйДокумент.ПредставлениеДокументаАванса),2);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли; // если дата документа ранее 01.10.17
		Иначе 
			_стр = "";
			Для Каждого строкаПлатёжноРасчётныеДокументы Из Ссылка.ПлатёжноРасчётныеДокументы Цикл
				_стр = _стр + "; " + строкаПлатёжноРасчётныеДокументы.НомерДокумента + " от " + Формат(строкаПлатёжноРасчётныеДокументы.ДатаДокумента, "ДФ=dd.MM.yyyy");
			КонецЦикла;
			
		КонецЕсли; // в ТЧ есть платежно-расчетные документв
		
		// при наличии документов удалим ";" в начале строки 
		Если Не ПустаяСтрока(_стр) Тогда
			_стр = Сред(_стр,2); 
		КонецЕсли; 
		
		// В документе "ЗакрытиеГрузоперевозки" автоматическое формирование строки пока не предусмотрено...
	Иначе
	КонецЕсли;  // проверка на тип документа
	
	АвансовыеСчетаФактурыТекст = "";
	Для Каждого ДокументОплаты Из Ссылка.ПлатёжноРасчётныеДокументы Цикл
		Если ЗначениеЗаполнено(ДокументОплаты.НомерСчетаФактурыНаАванс) Тогда
			АвансовыеСчетаФактурыНомерДата = СтрШаблон(НСтр("ru='№ %1 от %2, исправление № %3 от %4 '"),
			ДокументОплаты.НомерСчетаФактурыНаАванс, Формат(ДокументОплаты.ДатаСчетаФактурыНаАванс, "ДФ=dd.MM.yyyy"),
			ДокументОплаты.НомерИсправленияСчетаФактурыНаАванс, Формат(ДокументОплаты.ДатаИсправленияСчетаФактурыНаАванс, "ДФ=dd.MM.yyyy"));
			АвансовыеСчетаФактурыТекст = АвансовыеСчетаФактурыТекст 
			+ ?(Не ЗначениеЗаполнено(АвансовыеСчетаФактурыТекст), "", "; ") + АвансовыеСчетаФактурыНомерДата;
		КонецЕсли;
	КонецЦикла;     
	
	Если ПустаяСтрока(АвансовыеСчетаФактурыТекст) Тогда
		АвансовыеСчетаФактурыТекст = "№   от   , исправление №   от   ";
	КонецЕсли;
	
	// формируем строку в документ  
	Если ВерсияПостановления1137 >= 8 И ЗначениеЗаполнено(АвансовыеСчетаФактурыТекст) Тогда
		Шапка.Параметры.АвансовыеСчетаФактуры = АвансовыеСчетаФактурыТекст;
	КонецЕсли;
	
	
	// формируем строку в документ
	Шапка.Параметры.ПоДокументу = ?(ПустаяСтрока(_стр)," от",СокрЛП(_стр));
	
	#КонецОбласти 
	
	ВРУ = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ПредставлениеВалюты = "";
	Если ЗначениеЗаполнено(ВедомыйДокумент) Тогда
		ПредставлениеВалюты = Строка(?(ВедомыйДокумент.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ВРУ.НаименованиеПолное, ВедомыйДокумент.ВалютаДокумента.НаименованиеПолное))+","+Строка(?(ВедомыйДокумент.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ВРУ.Код, ВедомыйДокумент.ВалютаДокумента.Код));	
	Иначе
		ПредставлениеВалюты = Строка(?(Ссылка.Договор.ВзаиморасчетыВУЕ, ВРУ.НаименованиеПолное, Ссылка.Валюта.НаименованиеПолное))+","+Строка(?(Ссылка.Договор.ВзаиморасчетыВУЕ, ВРУ.Код, Ссылка.Валюта.Код));	
	КонецЕсли;
	
	Шапка.Параметры.Валюта = "" + ПредставлениеВалюты;
	
	Шапка.Параметры.ПредставлениеПокупателя = "" + НаименованияКонтрагента.ПолноеНаименование;
	
	Если ПараметрыДоговора.ВПечатныхФормахВыводитьРеквизитыГоловнойОрганизации Тогда
		ГоловнойКонтрагент = Ссылка.Контрагент.ГоловнойКонтрагент;
		
		КПП_ГоловнойКонтрагент = Справочники.Контрагенты.КППНаДату(ГоловнойКонтрагент,ДатаДокумента);
		
		НаДату =  Ссылка.ДатаСчетаФактуры;
		СведенияКонтрагент = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(ГоловнойКонтрагент, НаДату); 
		
		Шапка.Параметры.АдресПокупателя         = "" + СведенияКонтрагент.ЮридическийАдрес;
		Шапка.Параметры.ИННПокупателя           = "" + ГоловнойКонтрагент.ИНН + "/" + КПП_ГоловнойКонтрагент ;
	Иначе
		Шапка.Параметры.АдресПокупателя         = "" + ПараметрыДоговора.Адрес;	
		Шапка.Параметры.ИННПокупателя           = "" + Ссылка.Контрагент.ИНН + "/" + КПП_Контрагента;
	КонецЕсли; 

	
	// постановление в шапке печатной формы
	Если ВерсияПостановления1137 < 5 Тогда
		Если ДатаДокумента >= Дата(2017,10,01) Тогда
			Шапка.Параметры.Постановление = "Приложение № 1 к постановлению Правительства Российской Федерации от 26 декабря 2011 г. № 1137 
			|(в редакции постановления Правительства Российской Федерации от 19 августа 2017 г. № 981)";				
		ИначеЕсли ДатаДокумента >= Дата(2017,07,01) Тогда
			Шапка.Параметры.Постановление = "Приложение № 1 к постановлению Правительства Российской Федерации от 26 декабря 2011 г. № 1137 
			|(в редакции постановления Правительства Российской Федерации от 25 мая 2017 г. № 625)";				
		Иначе
			Шапка.Параметры.Постановление = "Приложение № 1 к постановлению Правительства Российской Федерации от 26 декабря 2011 г. № 1137";
		КонецЕсли;	
	КонецЕсли;
	
	Если ВерсияПостановления1137 >= 5 Тогда
		Шапка.Параметры.ИдентификаторГосКонтракта = Ссылка.ИдентификаторГосКонтракта;
		
		Если ДатаДокумента >= Дата(2024,10,1) Тогда    
			
			ШаблонСтрокиДокументовОбОтгрузке = НСтр("ru = '%1 № %2 от %3 г.'");
			
			Если Ссылка.ОтредактированыДокументыОтгрузки Тогда
				
				НадписьДокументыОбОтгрузке = "";
				Для Каждого СтрокаДокументаОбОтгрузке Из Ссылка.ДокументыОбОтгрузке Цикл
					Если ЗначениеЗаполнено(НадписьДокументыОбОтгрузке) Тогда
						НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке + "; ";
					КонецЕсли;
					ТекущийДокументОбОтгрузке =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиДокументовОбОтгрузке, 
					СтрокаДокументаОбОтгрузке.НаименованиеДокумента,
					СтрокаДокументаОбОтгрузке.НомерДокумента,
					Формат(СтрокаДокументаОбОтгрузке.ДатаДокумента,"ДЛФ=Д"));
					НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке + ТекущийДокументОбОтгрузке;
				КонецЦикла;
				Если Не ЗначениеЗаполнено(НадписьДокументыОбОтгрузке) Тогда
					НадписьДокументыОбОтгрузке = НСтр("ru = '№  от  '");
				Иначе
					НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке;
				КонецЕсли;
				
			Иначе
				
				РеквизитНомер 	= ?(Ссылка.ФормируетсяСчетФактура, 	"НомерСчетаФактуры", 	"НомерАкта");
				РеквизитДата 	= ?(Ссылка.ФормируетсяСчетФактура, 	"ДатаСчетаФактуры", 	"ДатаАкта");
				
				ЗначениеДаты = Ссылка[РеквизитДата];
				
				НадписьДокументыОбОтгрузке =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиДокументовОбОтгрузке, 
				?(Ссылка.ЭтоУниверсальныйДокумент, "Универсальный передаточный документ", "Акт"),
				CW_Документы.ПолучитьНомерНаПечать(Ссылка, РеквизитНомер),
				Формат(ЗначениеДаты,"ДЛФ=Д"));
				
			КонецЕсли;
			
		Иначе
			
			
			ШаблонСтрокиДокументовОбОтгрузке = НСтр("ru = '№ п/п %1 № %2 от %3 г.'");
			
			Если Ссылка.ОтредактированыДокументыОтгрузки Тогда
				
				НадписьДокументыОбОтгрузке = "";
				Для Каждого СтрокаДокументаОбОтгрузке Из Ссылка.ДокументыОбОтгрузке Цикл
					Если ЗначениеЗаполнено(НадписьДокументыОбОтгрузке) Тогда
						НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке + "; ";
					КонецЕсли;
					ТекущийДокументОбОтгрузке =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиДокументовОбОтгрузке,
					СтрокаДокументаОбОтгрузке.НомераСтрок,
					СтрокаДокументаОбОтгрузке.НомерДокумента,
					Формат(СтрокаДокументаОбОтгрузке.ДатаДокумента,"ДЛФ=Д"));
					НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке + ТекущийДокументОбОтгрузке;
				КонецЦикла;
				Если Не ЗначениеЗаполнено(НадписьДокументыОбОтгрузке) Тогда
					НадписьДокументыОбОтгрузке = НСтр("ru = '№ п/п  №  от  '");
				Иначе
					НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке;
				КонецЕсли;
				
			Иначе
				
				НадписьДокументыОбОтгрузке =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиДокументовОбОтгрузке,
				"1-"+Формат(ТаблицаУслуг.Количество(),"ЧГ=0"),
				CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерАкта"),
				Формат(Ссылка.ДатаАкта,"ДЛФ=Д"));
				
			КонецЕсли; 
			
		КонецЕсли;
		Шапка.Параметры.ДокументыОбОтгрузке = НадписьДокументыОбОтгрузке;
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(Шапка);
	
	// госконтракт
	Если ДатаДокумента >= Дата(2017,07,01) и ВерсияПостановления1137 < 5 Тогда
		ГосКонтракт.Параметры.ИдентификаторГосКонтракта = Ссылка.ИдентификаторГосКонтракта; 
		Если ГосКонтракт <> Неопределено Тогда
			ТабличныйДокумент.Вывести(ГосКонтракт);
		КонецЕсли;
	КонецЕсли;	
	
	//Дополнение 
	Если ПараметрыДоговора.ВыводитьДополнениевШапкуАкта Тогда
		ОбластьДополнениеШапка.Параметры.ДополнениеТекст = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеАкта, Ссылка, Неопределено, Ссылка.Услуги);
		ТабличныйДокумент.Вывести(ОбластьДополнениеШапка);
	КонецЕсли;
	
	Если ПараметрыДоговора.ВыводитьДополнениеВПодавлеАкта Тогда
		ОбластьДополнениеПодвал.Параметры.ДополнениеТекст = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеПодвалаАктаРус, Ссылка, Неопределено, Ссылка.Услуги);
	КонецЕсли;
	//Дополнение
	
	Если ВерсияПостановления1137 < 5 Тогда
		// пустая строчка перед таблицей  
		Если Заглушка <> Неопределено Тогда
			ТабличныйДокумент.Вывести(Заглушка);
		КонецЕсли;
	КонецЕсли;	
	
	//Заголовок печатной формы 	
	
	// шапка таблицы		
	ТабличныйДокумент.Вывести(ШапкаТаблицы);
	
	ТолькоБезНДС = Истина;  НомСтрГП = 0; НомСтр = 0; КолЛистов = 1;
	Для Каждого усл Из ТаблицаУслуг Цикл
		
		НомСтр = НомСтр + 1;
		
		Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов) И ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.СворачиватьПоГрузоперевозкам Тогда
			СтрТЗ_ГП = ТЗ_ГП.Найти(НомСтрГП, "НомСтр");
			Если СтрТЗ_ГП <> Неопределено Тогда
				ОблГП = Макет.ПолучитьОбласть("Группировка");
				ОблГП.Параметры.Группировка = СтрТЗ_ГП.Представление;
				Если ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ВыводитьИтогиПоГрузоперевозкам Тогда
					ОблГП.Параметры.Итого = СтрТЗ_ГП.Итого;
				КонецЕсли;	
				ТабличныйДокумент.Вывести(ОблГП);
				НомСтрГП = НомСтрГП + 1;
			КонецЕсли;	
		КонецЕсли;	
		НомСтрГП = НомСтрГП + 1;
		
		СтрокаТаблицы.Параметры.НомерСтроки = НомСтр;
		СтрокаТаблицы.Параметры.ТоварКод    = "--";
		
		Если ВерсияПостановления1137 >= 5 Тогда
			ТоварКодТНВЭД = ?(ЗначениеЗаполнено(усл.Номенклатура.КодТНВЭД), усл.Номенклатура.КодТНВЭД, "--");
			СтрокаТаблицы.Параметры.ТоварКодТНВЭД =  ТоварКодТНВЭД;
		КонецЕсли;
		
		
		СтрокаТаблицы.Параметры.ТоварНаименование = усл.Представление;
		Если СокрЛП(усл.Номенклатура.ЕдиницаИзмерения) = "-" 
			ИЛИ Не ЗначениеЗаполнено(усл.Номенклатура.ЕдиницаИзмерения) Тогда
			СтрокаТаблицы.Параметры.ЕдиницаИзмерения    = "--";
			СтрокаТаблицы.Параметры.ЕдиницаИзмеренияКод = "--";
			СтрокаТаблицы.Параметры.Количество          = "--";
			СтрокаТаблицы.Параметры.Цена                = "--";
		Иначе
			СтрокаТаблицы.Параметры.ЕдиницаИзмерения    = усл.Номенклатура.ЕдиницаИзмерения;
			СтрокаТаблицы.Параметры.ЕдиницаИзмеренияКод = ?(ЗначениеЗаполнено(усл.Номенклатура.ЕдиницаИзмерения.Код), усл.Номенклатура.ЕдиницаИзмерения.Код, "--");
			СтрокаТаблицы.Параметры.Количество          = Усл.Количество;
			СтрокаТаблицы.Параметры.Цена 				= ?(РасчетыУЕ, усл.Цена_Рег, усл.Цена);
		КонецЕсли; 
		
		СтрокаТаблицы.Параметры.Стоимость = ?(ВедомыйДокумент.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, усл.Сумма_Рег, усл.Сумма);
		СтрокаТаблицы.Параметры.Акциз     = "без акциза";
		СтрокаТаблицы.Параметры.СтавкаНДС = ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, "БЕЗ НДС", усл.СтавкаНДС);
		СтрокаТаблицы.Параметры.СуммаНДС  = ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, "БЕЗ НДС", ?(РасчетыУЕ, усл.НДС_Рег, усл.НДС));
		СтрокаТаблицы.Параметры.Всего     = ?(РасчетыУЕ, усл.Всего_Рег, усл.Всего);
		
		СтрокаТаблицы.Параметры.СтранаПроисхожденияКод = "--";
		СтрокаТаблицы.Параметры.ПредставлениеСтраны    = "--";
		СтрокаТаблицы.Параметры.ПредставлениеГТД       = "--";
		
		Если (усл.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС) Тогда
			ТолькоБезНДС = Ложь;
		КонецЕсли; 
		
		//Проверяем возможность вывода
		Если ВсегоСтрокДляВывода = НомСтр Тогда
			
			МассивОбластийВывода = Новый Массив;
			МассивОбластийВывода.Добавить(СтрокаТаблицы);
			МассивОбластийВывода.Добавить(ПодвалТаблицы);
			
			МассивОбластийВывода.Добавить(Подписи);
			
			//Дополнение
			Если ПараметрыДоговора.ВыводитьДополнениеВПодавлеАкта Тогда   
				МассивОбластийВывода.Добавить(ОбластьДополнениеПодвал);
			Иначе
				МассивОбластийВывода.Добавить(ОбластьДополнениеЛинияСверху);
			КонецЕсли;
			//Дополнение
			
			МассивОбластийВывода.Добавить(Подписи2);   
			
			Если Не ТабличныйДокумент.ПроверитьВывод(МассивОбластийВывода) Тогда
				КолЛистов = КолЛистов + 1;
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НумерацияЛистов.Параметры.Номер 		= "Универсальный передаточный документ №" + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
				НумерацияЛистов.Параметры.НомерЛиста 	= КолЛистов;
				ТабличныйДокумент.Вывести(НумерацияЛистов);
				ТабличныйДокумент.Вывести(ШапкаТаблицы);
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(СтрокаТаблицы);
			
		Иначе
			МассивОбластийВывода = Новый Массив;
			МассивОбластийВывода.Добавить(СтрокаТаблицы);
			
			Если Не ТабличныйДокумент.ПроверитьВывод(МассивОбластийВывода) Тогда
				
				КолЛистов = КолЛистов + 1;
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НумерацияЛистов.Параметры.Номер 		= "Универсальный передаточный документ №" + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
				НумерацияЛистов.Параметры.НомерЛиста 	= КолЛистов;
				ТабличныйДокумент.Вывести(НумерацияЛистов);
				ТабличныйДокумент.Вывести(ШапкаТаблицы);
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(СтрокаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПодвалТаблицы.Параметры.ИтогоСтоимость = ТаблицаУслуг.Итог(?(РасчетыУЕ, "Сумма_Рег", "Сумма"));
	СуммаНДС = ТаблицаУслуг.Итог(?(РасчетыУЕ, "НДС_Рег", "НДС"));
	Если (ТолькоБезНДС) Тогда
		ПодвалТаблицы.Параметры.ИтогоСуммаНДС = "БЕЗ НДС";
	Иначе
		ПодвалТаблицы.Параметры.ИтогоСуммаНДС = СуммаНДС;	
	КонецЕсли; 
	Итого = ТаблицаУслуг.Итог(?(РасчетыУЕ, "Всего_Рег", "Всего"));
	ПодвалТаблицы.Параметры.ИтогоВсего = Итого;
	
	ТабличныйДокумент.Вывести(ПодвалТаблицы); 
	
	#Область ПодписантыПоДокументу
	
	Подписанты = _БЭ.ВернутьПодписантов(Ссылка, ПараметрыДоговора);
	
	// организация (не ИП)
	Если (НЕ ИП) Тогда
		
		// получаем картинки подписей руководителя и главного бухгалтера
		Если ВыводитьПодписиИПечать Тогда 
			
			ПодписьРуководителя	= CW_Печать.ПолучитьПодписьСотрудника(Подписанты.Руководитель, ложь);
			ПодписьБухгалтера  	= CW_Печать.ПолучитьПодписьСотрудника(Подписанты.ГлБух, ложь);
			
			РисунокПодписьРуководителя = Подписи.Рисунки.ПодписьРуководителяСФ;
			РисунокПодписьРуководителя.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
			РисунокПодписьРуководителя.ВыводитьНаПечать = Ложь;
			Если ПодписьРуководителя <> Неопределено Тогда;
				РисунокПодписьРуководителя.ВыводитьНаПечать = Истина;
				РисунокПодписьРуководителя.Картинка			= Новый Картинка(ПодписьРуководителя);
			КонецЕсли;
			
			РисунокПодписьБухгалтера = Подписи.Рисунки.ПодписьБухгалтераСФ;
			РисунокПодписьБухгалтера.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
			РисунокПодписьБухгалтера.ВыводитьНаПечать = Ложь;
			Если ПодписьБухгалтера <> Неопределено Тогда;
				РисунокПодписьБухгалтера.ВыводитьНаПечать = Истина;
				РисунокПодписьБухгалтера.Картинка	= Новый Картинка(ПодписьБухгалтера);
			КонецЕсли;
			
		КонецЕсли;
		
		// подписи руководителя и главного бухгалтера
		Подписи.Параметры.ФИОруководителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,Ссылка.Дата) 
			+ ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", ""); 
		
		Подписи.Параметры.ФИОГлавногоБухгалтера = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.ГлБух,Ссылка.Дата)
			+ ?(ЗначениеЗаполнено(Подписанты.ГлБухОснованиеРус), " (" + Подписанты.ГлБухОснованиеРус + ")", ""); 
	
		// Индивидуальный предприниматель
	Иначе   
		НаДату = ВедомыйДокумент.Дата;
		СведенияИП = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, НаДату); 
		Подписи.Параметры.ФИОПБОЮЛ 				= СведенияИП.НаименованиеДляПечатныхФорм;
		Подписи.Параметры.ФИОРуководителя 		= СведенияИП.ФамилияИнициалыФизлица;
		Подписи.Параметры.Свидетельство 		= СведенияИП.Свидетельство;
		
		Подписи2.Параметры.ФИООтветственного 	= СведенияИП.ФамилияИнициалыФизлица;
	КонецЕсли; 
	
	Подписи.Параметры.КоличествоЛистов = "Документ составлен на " + КолЛистов + ?(КолЛистов = 1, " листе", " листах");
	ТабличныйДокумент.Вывести(Подписи);  
	
	//Дополнение
	Если ПараметрыДоговора.ВыводитьДополнениеВПодавлеАкта Тогда   
		ТабличныйДокумент.Вывести(ОбластьДополнениеПодвал);  
	Иначе
		ТабличныйДокумент.Вывести(ОбластьДополнениеЛинияСверху);  
	КонецЕсли;
	//Дополнение
	
	Если ВыводитьПодписиИПечать Тогда 
		
		ПечатьОрганизации 	 		= CW_Печать.ПолучитьПечатьОрганизации(Ссылка.Организация, НастройкиПечати.ПодключаемыйОбъект, Ссылка.ДатаАкта, ложь);
		ПодписьРуководителя  		= CW_Печать.ПолучитьПодписьСотрудника(Подписанты.Руководитель, ложь);
		ПодписьГлавногоБухгалтера  	= CW_Печать.ПолучитьПодписьСотрудника(Подписанты.ГлБух, ложь);
		
		РисунокПодписьРуководителя = Подписи2.Рисунки.ПодписьРуководителя;
		РисунокПодписьРуководителя.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		РисунокПодписьРуководителя.ВыводитьНаПечать	= Ложь;
		Если ПодписьРуководителя <> Неопределено Тогда
			РисунокПодписьРуководителя.ВыводитьНаПечать	= Истина;
			РисунокПодписьРуководителя.Картинка		= Новый Картинка(ПодписьРуководителя);
		КонецЕсли;
		
		РисунокПодписьБухгалтера = Подписи2.Рисунки.ПодписьБухгалтера;
		РисунокПодписьБухгалтера.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		РисунокПодписьБухгалтера.ВыводитьНаПечать 	= Ложь;
		Если ПодписьГлавногоБухгалтера <> Неопределено Тогда
			РисунокПодписьБухгалтера.ВыводитьНаПечать 	= Истина;
			РисунокПодписьБухгалтера.Картинка 			= Новый Картинка(ПодписьГлавногоБухгалтера);
		КонецЕсли;
		
		РисунокПечатьОрганизации = Подписи2.Рисунки.ПечатьОрганизации;
		РисунокПечатьОрганизации.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		РисунокПечатьОрганизации.ВыводитьНаПечать 	= Ложь;
		Если ПечатьОрганизации <> Неопределено Тогда
			РисунокПечатьОрганизации.ВыводитьНаПечать 	= Истина;
			РисунокПечатьОрганизации.Картинка 			= Новый Картинка(ПечатьОрганизации);
		КонецЕсли;
		
	КонецЕсли; 
	
	Основание = СокрЛП(Ссылка.Договор.ВидДокумента.КраткоеНаименование) +" №"+ СокрЛП(Ссылка.Договор.НомерДоговора)+ " от "	+ Формат(Ссылка.Договор.ДатаДоговора,"ДФ=dd.MM.yyyy");
	Если ЗначениеЗаполнено(Ссылка.ПриложениеКДоговору) Тогда
		Основание = СокрЛП(Ссылка.ПриложениеКДоговору.ВидДокумента.КраткоеНаименование)+
		" №"	+ СокрЛП(Ссылка.ПриложениеКДоговору.НомерДокумента)+
		" от "	+ Формат(Ссылка.ПриложениеКДоговору.ДатаДокумента,"ДФ=dd.MM.yyyy") + 
		" к "	+ Основание;
	КонецЕсли;
	
	Подписи2.Параметры.Основание = Основание; 
	
	// подписи руководителя и главного бухгалтера нашей организации
	Подписи2.Параметры.ДолжностьКладовщика = Подписанты.РуководительДолжностьРус;
	Подписи2.Параметры.ФИОКладовщика = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,Ссылка.Дата)
	+ ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", "");
	
	
	Если ЗначениеЗаполнено(Подписанты.ОтветственныйЗаОформление) Тогда
		Подписи2.Параметры.ДолжностьОтветственного = Подписанты.ОтветственныйЗаОформлениеДолжность;
		Если не ИП тогда
			Подписи2.Параметры.ФИООтветственного = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.ОтветственныйЗаОформление,Ссылка.Дата)
			+ ?(ЗначениеЗаполнено(Подписанты.ОтветственныйЗаОформлениеОснованиеРус), " (" + Подписанты.ОтветственныйЗаОформлениеОснованиеРус + ")", "");
		КонецЕсли;
	Иначе
		Подписи2.Параметры.ДолжностьОтветственного = "Главный бухгалтер";
		Если не ИП тогда
			Подписи2.Параметры.ФИООтветственного = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.ГлБух,Ссылка.Дата)
			+ ?(ЗначениеЗаполнено(Подписанты.ГлБухОснованиеРус), " (" + Подписанты.ГлБухОснованиеРус + ")", "");
		КонецЕсли;
	КонецЕсли;
	
	НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(Ссылка.Организация, Ссылка.Дата); 
	
	
	Если Ссылка.Контрагент.ОбособленноеПодразделение 
		И Ссылка.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
		НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент.ГоловнойКонтрагент, ДатаДокумента);
	Иначе
		НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент,ДатаДокумента);
	КонецЕсли;
	
	Подписи2.Параметры.ДатаОтгрузкиПередачи 	= Формат(Ссылка.ДатаАкта, "ДЛФ=ДД");
	Подписи2.Параметры.ПредставлениеОрганизации	= НаименованияОрганизации.НаименованиеДляПечатныхФорм + ", ИНН/КПП " + Ссылка.Организация.ИНН +?(ИП, "", "/" + Справочники.Организации.КППНаДату(Ссылка.Организация, Ссылка.Дата)) ;
	
	// подписи руководителя контрагента
	Подписи2.Параметры.ДолжностьТоварПолучил = ПараметрыДоговора.ДолжностьРуководителя;
	Подписи2.Параметры.ФИОТоварПолучил = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.Руководитель,Ссылка.Дата)
	+ ?(ПустаяСтрока(ПараметрыДоговора.РуководительКонтрагентаОснование), "", " ("+ПараметрыДоговора.РуководительКонтрагентаОснование+")");
	
	Подписи2.Параметры.ПредставлениеКонтрагента =  НаименованияКонтрагента.НаименованиеДляПечатныхФорм + ",  ИНН/КПП " + Ссылка.Контрагент.ИНН + "/" + Справочники.Контрагенты.КППНаДату(Ссылка.Контрагент, Ссылка.Дата) ;
	
	ТабличныйДокумент.Вывести(Подписи2);  
	
	//исполнитель документа
	Если Не Ссылка.Ответственный.Пустая() и ПараметрыДоговора.ВыводитьИсполнителяАкт Тогда
		
		Исполнитель 				= ""; 
		Если ЗначениеЗаполнено(Ссылка.Ответственный.ФизическоеЛицо) Тогда
			Исполнитель 				= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Ссылка.Ответственный.ФизическоеЛицо);
		КонецЕсли;
		ТелефонИсполнителя 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Ответственный, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПользователя"),,Истина);		
		
		ОбластьИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
		ОбластьИсполнитель.Параметры.Исполнитель 		= "Исп.: "+ Исполнитель;
		ОбластьИсполнитель.Параметры.ТелефонИсполнителя = "Тел.: "+ ТелефонИсполнителя;
		
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
	КонецЕсли;
	//исполнитель документа
	
	
	#КонецОбласти 
	
	РезультатПечати.ПечатнаяФорма = ТабличныйДокумент;
	
	Возврат РезультатПечати;
	
КонецФункции // ПечатьУПД

Функция ПечатьУКД(НастройкиПечати)
	
	#Область ИнициализацияСлужебныхПеременных
	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();

	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхАкта", Истина);
	Если КоличествоЭксземпляров <> Неопределено Тогда 
		РезультатПечати.Параметры.Количество = КоличествоЭксземпляров;
		РезультатПечати.Параметры.Печать 	 = (КоличествоЭксземпляров <> 0);  
	Иначе
		РезультатПечати.Параметры.Количество = 2;
		РезультатПечати.Параметры.Печать 	 = Истина;  
	КонецЕсли;  
	
	// для удобства обращения по тексту кода
	Ссылка = СсылкаНаОбъект;
	
	// получаем настройку из учетной политики
	ИспользоватьПостановление1137 = CW_Настройки.ПараметрУчетнойПолитики(Ссылка.ВедомыйДокументКорректировки.Дата, Ссылка.Организация, "СчетаФактурыПоПостановлению1137");
	Если ИспользоватьПостановление1137 = Неопределено Тогда
		ИспользоватьПостановление1137 = Ложь;
	КонецЕсли; 
	
	ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Ссылка.ВедомыйДокументКорректировки.Дата);
	
	
	// признак того, что наша организация является индивидуальным предпринимателем
	ИП = ЗначениеЗаполнено(Ссылка.Организация.ИндивидуальныйПредприниматель); 
	
	// флаг того, что все строки документа были только перевыставляемыми
	ТолькоПеревыставляемые = Истина;
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.CW_ЗакрытиеГрузоперевозки") Тогда
		Для Каждого Стр Из Ссылка.Услуги Цикл
			Если Стр.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление Тогда
				ТолькоПеревыставляемые = Ложь;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	Иначе 
		ТолькоПеревыставляемые = Ложь;	
	КонецЕсли; 
	
	// параметры договора
	СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметровДоговора.Дата 				= Ссылка.ВедомыйДокументКорректировки.Дата;
	СтруктураПараметровДоговора.Договор 			= Ссылка.Договор;
	СтруктураПараметровДоговора.ПриложениеКДоговору = Ссылка.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора);
	
	// вариант вывода реквизита "Продавец": 
	// "Истина" - в качестве продавца безальтернативно (всегда) выводится своя организация;
	// "Ложь" - заполнение продавца будет зависить от других опций (применение постановления №1137, 
	// признака того что это сводная или смешанная с\ф и пр.)
	ПродавецПоСФСвояОрганизация = ПараметрыДоговора.ПродавецПоСФСвояОрганизация;
	
	#КонецОбласти 
	
	#Область ПараметрыДляВыводаВФормуПакета
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				СсылкаНаОбъект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		СсылкаНаОбъект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, СсылкаНаОбъект.Дата);
	
	// формируем представление
	Если Ссылка.ФормируетсяСчетФактура Тогда
		Если ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет Тогда
			СФ = ПолучитьВедомыйСчетФактуру(Ссылка);
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерСчетаФактуры", "ДатаСчетаФактуры");
			ДатаДокумента = Ссылка.ДатаСчетаФактуры;
		Иначе
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерСчетаФактуры", "ДатаСчетаФактуры");
			ДатаДокумента = Ссылка.ДатаСчетаФактуры;
		КонецЕсли; 
	Иначе	
		Если (ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка.ВедомыйДокументКорректировки);
			ДатаДокумента = Ссылка.ВедомыйДокументКорректировки.Дата;
		Иначе
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерАкта", "ДатаАкта");
			ДатаДокумента = Ссылка.ДатаАкта;
		КонецЕсли; 
	КонецЕсли;
	ПредставлениеДокумента = "УКД №" + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
	
	//AFR-233396
	ПродавецПоСФСвояОрганизация = ?(ДатаДокумента < дата(2012,1,1), Истина,  ПродавецПоСФСвояОрганизация);		
	//AFR-233396
	
	РезультатПечати.Представление = ПредставлениеДокумента;
	
	//Установка представления печатной формы
	ДанныеДляЗаполнения = Новый Структура;
	ДанныеДляЗаполнения.Вставить("НомерДокумента", 		НомерДокумента);
	ДанныеДляЗаполнения.Вставить("ДатаДокумента",  		ДатаДокумента);
	
	CW_Печать.УстановитьПредставлениеПоШаблону(РезультатПечати.Представление, НастройкиПечати, ДанныеДляЗаполнения);
	//Установка представления печатной формы

	#КонецОбласти 
	
	#Область ЗаполнениеРеквизитовПродавца
	
	// Принципиально возможны следующие варианты:
	// - Если в параметрах договора задана опция "выводить свою организацию в качестве продавца",
	// 	 то в качестве продавца всегда будет выведена наша организация (прочие условия не анализируются).
	// - Если в документе есть собственные услуги, то в качестве продавца 
	//   будет всегда выводится наша организация (это простая и смешанная с\ф).
	// - Если в документе толко перевыставляемые услуги (с\ф на возмещение), 
	//   то в зависимости от опции "ВариантВыводаСводнойСФ" в параметрах 
	//   договора выводим или нашу организацию или перечисляем всех продавцов 
	//   по перевыставляемым с\ф (с\ф документов затрат), НО если в документе 
	//   только один реальный продавец, то не зависимо от опции "ВариантВыводаСводнойСФ"
	//   в качестве продавца будет выведен именно он.
	
	// это временная переменная, если она в результате всех проверок останется пустой,
	// то в качестве продавца подставим собственную организацию
	Продавец = Справочники.Контрагенты.ПустаяСсылка();
	
	// это массив реальных продавцов для сводной с\ф
	ТЗ_Продавцов = _сф.т_Создать("Продавец,КПП,СокращенноеНаименование,ПолноеНаименование,НаименованиеДляПечатныхФорм");
	
	// несколько продавцов может быть только по документу "ДоходыПоГрузоперевозке" 
	Если ТипЗнч(Ссылка) =  Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		// до вступления в силу постановления №1137 в качестве продавца всегда выступает наша организация 
		Если (Ссылка.Корректировка) Тогда
			ПродавецПоСФСвояОрганизация = ?(Ссылка.ВедомыйДокументКорректировки.Дата < дата(2012,1,1), Истина,  ПродавецПоСФСвояОрганизация);		
		КонецЕсли; 
		
		// если в карточке договора не задана опция выводить в качестве продавца 
		// свою организацию, то проанализируем содержание табличной части и 
		// другие опции договора
		Если Не ПродавецПоСФСвояОрганизация Тогда
			
			// в документе только перевыставляемые услуги
			Если ТолькоПеревыставляемые Тогда
				
				МассивДокументов = _сф.м_СоздатьИзКолонкиТЗ(Ссылка.Услуги.Выгрузить(),"ДокументРасходов");
				Для Каждого Стр Из МассивДокументов Цикл
					
							НСтр = ТЗ_Продавцов.Добавить();
					Если Стр.Продавец.Пустая() Тогда
						НСтр.Продавец = Стр.Контрагент;
					Иначе
						НСтр.Продавец = Стр.Продавец;
					КонецЕсли;
					
					Если ТипЗнч(НСтр.Продавец) = Тип("СправочникСсылка.Контрагенты") Тогда
						НаименованияНаДату 	= Справочники.Контрагенты.НаименованияНаДату(Нстр.Продавец, ДатаДокумента);
						КППнаДату 			= Справочники.Контрагенты.КППНаДату(Нстр.Продавец, ДатаДокумента);
					Иначе
						НаименованияНаДату 	= Справочники.Организации.НаименованияНаДату(Нстр.Продавец, ДатаДокумента);
						КППнаДату 			= Справочники.Организации.КППНаДату(Нстр.Продавец, ДатаДокумента);
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(НСтр,НаименованияНаДату);
					
					Нстр.КПП = КППнаДату;
					
				КонецЦикла; // перебор перевыставляемых документов затрат 
				ТЗ_Продавцов.Свернуть("Продавец,КПП,СокращенноеНаименование,ПолноеНаименование,НаименованиеДляПечатныхФорм");
				
				//КонецЕсли; // в документе только перевыставляемые услуги 
			КонецЕсли; // вывод в соответствии с постановлением 1137
		КонецЕсли; // в параметрах договора вывод собственной организации в качестве продавца не установлен 
	КонецЕсли; // это ссылка на документ "Расходы по грузоперевозке"
	
	// если вывод печатной формы в режиме акта,
	// то в качестве продавца всегда своя организация
	Если (НЕ Ссылка.ФормируетсяСчетФактура) Тогда
		Продавец = Справочники.Контрагенты.ПустаяСсылка();
		ТЗ_Продавцов.Очистить();
	КонецЕсли; 
	
	// вывод в качестве продавца одного реального продавца
	Если НЕ Продавец.Пустая() Тогда    
		НаДату = Ссылка.ВедомыйДокументКорректировки.Дата;
		СведенияОПоставщике = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Продавец, НаДату); 
		
		Если ТипЗнч(Продавец) = Тип("СправочникСсылка.Контрагенты") Тогда
			НаименованияНаДату 	= Справочники.Контрагенты.НаименованияНаДату(Продавец, ДатаДокумента);
			КППнаДату 			= Справочники.Контрагенты.КППНаДату(Продавец, ДатаДокумента);
		Иначе
			НаименованияНаДату 	= Справочники.Организации.НаименованияНаДату(Нстр.Продавец, ДатаДокумента);
			КППнаДату 			= Справочники.Организации.КППНаДату(Продавец, ДатаДокумента);
		КонецЕсли;
		
		ПредставлениеПоставщика = НаименованияНаДату.ПолноеНаименование;
		АдресПоставщика         = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике,"ЮридическийАдрес"); 
		
		ИННПоставщика           = Продавец.ИНН + "/"+ КППнаДату;
		
		// вывод нескольких продавцов (сводная с\ф)
	ИначеЕсли ТЗ_Продавцов.Количество() > 0 Тогда
		
		ПредставлениеПоставщика = "";
		АдресПоставщика = "";
		ИННПоставщика = "";
		
		Для Каждого СтрПр из ТЗ_Продавцов Цикл    
			
			НаДату =  Ссылка.ВедомыйДокументКорректировки.Дата;
			СведенияОПоставщике 	= CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(СтрПр.Продавец, НаДату); // ВызовБП
			
			ПредставлениеПоставщика = ПредставлениеПоставщика + СтрПр.ПолноеНаименование + "; ";
			АдресПоставщика 		= АдресПоставщика + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес") + "; "; // ВызовБП
			ИННПоставщика 			= ИННПоставщика + СтрПр.Продавец.ИНН + "/"+ СтрПр.КПП + "; ";
		КонецЦикла;	
		
		ПредставлениеПоставщика = Сред(ПредставлениеПоставщика, 1, СтрДлина(ПредставлениеПоставщика) - 2);
		АдресПоставщика = Сред(АдресПоставщика, 1, СтрДлина(АдресПоставщика) - 2);
		ИННПоставщика = Сред(ИННПоставщика, 1, СтрДлина(ИННПоставщика) - 2);
		
		// вывод в качестве продавца нашу организацию
	Иначе
		
		НаДату = Ссылка.ВедомыйДокументКорректировки.Дата; 
		СведенияОПоставщике  = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, НаДату); 
		
		НаименованияНаДату 	= Справочники.Организации.НаименованияНаДату(Ссылка.Организация, ДатаДокумента);
		КППнаДату 			= Справочники.Организации.КППНаДату(Ссылка.Организация, ДатаДокумента);
		
		Если ЗначениеЗаполнено(Ссылка.ПодразделениеОрганизации) Тогда
			Если Ссылка.ПодразделениеОрганизации.ОбособленноеПодразделение Тогда
				КППнаДату = Справочники.ПодразделенияОрганизаций.КППНаДату(Ссылка.ПодразделениеОрганизации, ДатаДокумента);
			КонецЕсли;
		КонецЕсли;
		
		ПредставлениеПоставщика = НаименованияНаДату.ПолноеНаименование;
		АдресПоставщика         = ПараметрыДоговора.АдресОрганизации;
		ИННПоставщика           = Ссылка.Организация.ИНН + "/" + КППнаДату;
	КонецЕсли; 
	
	#КонецОбласти 
	
	#Область ПолучениеТаблицыУслуг
	
	РасчетыУЕ = Ссылка.ВедомыйДокументКорректировки.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах;
	Если (ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
		
		ТаблицаУслуг = CW_Финансы.ПолучитьУслугиДокумента(Ссылка.КорректируемыйДокумент);
		
		_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПредставлениеГП",,"");
		_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Количество",,0);
		_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Цена",,0);
		_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Сумма",,0);
		_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_НДС",,0);
		_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Всего",,0);
		
		_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Цена_Рег",,0);
		_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Сумма_Рег",,0);
		_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_НДС_Рег",,0);
		_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Всего_Рег",,0);  
		
		ТаблицаУслугПослеИзменения = CW_Финансы.ПолучитьУслугиДокументаКорректировки(Ссылка);
		ТаблицаУслугПослеИзменения.Колонки.Добавить("ПредставлениеГП");
		Для Каждого СтрТУ из ТаблицаУслугПослеИзменения Цикл
			СтрТУ.ПредставлениеГП = СокрЛП(СтрТУ.Грузоперевозка.CW_Представление);
		КонецЦикла;
		
		Индекс=0;  
		Для каждого Стр Из ТаблицаУслугПослеИзменения Цикл
			СтрокаДобавлена = Ложь;
			Попытка
				СтрокаУслуг = ТаблицаУслуг.Получить(Индекс);   
				СтрокаУслуг.СтавкаНДС_ДоКорректировки = СтрокаУслуг.СтавкаНДС;	
				СтрокаУслуг.СтавкаНДС 		= Стр.СтавкаНДС;	
				СтрокаУслуг.Представление 	= Стр.Представление;
			Исключение
				СтрокаДобавлена = Истина;
				//Строка была добавлена
				СтрокаУслуг = ТаблицаУслуг.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаУслуг, Стр);
			КонецПопытки;
			
			// --- 
			СтрокаУслуг.ПК_Количество = Стр.Количество;
			СтрокаУслуг.ПК_Цена = Стр.Цена;
			СтрокаУслуг.ПК_Сумма = Стр.Сумма;
			СтрокаУслуг.ПК_НДС = Стр.НДС;
			СтрокаУслуг.ПК_Всего = Стр.Всего;
			// --- 
			СтрокаУслуг.ПК_Цена_Рег = Стр.Цена_Рег;
			СтрокаУслуг.ПК_Сумма_Рег = Стр.Сумма_Рег;
			СтрокаУслуг.ПК_НДС_Рег = Стр.НДС_Рег;
			СтрокаУслуг.ПК_Всего_Рег = Стр.Всего_Рег;
			// --- 
			
			Если СтрокаДобавлена Тогда
				СтрокаУслуг.Количество 	= 0;
				СтрокаУслуг.Цена		= 0;
				СтрокаУслуг.Сумма		= 0;
				СтрокаУслуг.НДС			= 0;
				СтрокаУслуг.Всего		= 0;
			КонецЕсли;
			
			_сф.Инкремент(Индекс);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов) И ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.СворачиватьПоГрузоперевозкам Тогда
			ТЗ_Усл = ТаблицаУслуг.Скопировать();
			ТЗ_Ит  = ТаблицаУслуг.Скопировать();
			ТЗ_Ит.Очистить();
			ТЗ_ГП  = ТЗ_Усл.Скопировать();
			ТЗ_ГП.Свернуть("ПредставлениеГП");
			ТЗ_ГП.Колонки.Добавить("Представление");
			ТЗ_ГП.Колонки.Добавить("НомСтр");
			ТЗ_ГП.Колонки.Добавить("Итого");
			НомСтр = 0;
			Для Каждого Стр_ГП из ТЗ_ГП Цикл
				ТЗ_Отбор = ТЗ_Усл.Скопировать(Новый Структура("ПредставлениеГП", Стр_ГП.ПредставлениеГП));
				
				Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
					Стр_ГП.Представление = _БЭ.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкамАнгл, Ссылка, Неопределено, ТЗ_Отбор);
				ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
					Стр_ГП.Представление = _БЭ.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкам, Ссылка, Неопределено, ТЗ_Отбор) + " / " + _БЭ.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкамАнгл, Ссылка, Неопределено, ТЗ_Отбор);
				Иначе 
					Стр_ГП.Представление = _БЭ.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкам, Ссылка, Неопределено, ТЗ_Отбор);
				КонецЕсли;
				Стр_ГП.НомСтр = НомСтр;
				Стр_ГП.Итого  = ТЗ_Отбор.Итог("Всего");
				
				CW_Печать.ПодготовитьТаблицуУслуг(ТЗ_Отбор,Ссылка,ПараметрыДоговора,"акт",Истина);
				
				Для Каждого Стр_Отбор из ТЗ_Отбор Цикл
					Стр_Ит = ТЗ_Ит.Добавить();
					ЗаполнитьЗначенияСвойств(Стр_Ит, Стр_Отбор);
				КонецЦикла;	
				НомСтр = НомСтр + 1 + ТЗ_Отбор.Количество();
			КонецЦикла;
			ТаблицаУслуг = ТЗ_Ит.Скопировать();
		Иначе				
			CW_Печать.ПодготовитьТаблицуУслуг(ТаблицаУслуг,Ссылка,ПараметрыДоговора,"акт",Истина);
		КонецЕсли;	
		
	ИначеЕсли (ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_ЗакрытиеГрузоперевозки")) Тогда
		
		ТаблицаУслуг = Ссылка.Вознаграждение.Выгрузить();
		РасчетыУЕ = Ложь;
		
	КонецЕсли;
	
	ВсегоСтрокДляВывода = ТаблицаУслуг.Количество();
	
	#КонецОбласти
	
	// формируем печатную форму
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "CW_ПЕЧАТЬ_УПД";
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	// выбираем макет для заполнения   
	Если ДатаДокумента >= Дата(2026,4,1) Тогда 
		Макет = ПолучитьМакет("ПФ_MXL_УниверсальныйКорректировочныйДокумент26");
	ИначеЕсли ДатаДокумента >= Дата(2026,1,1) Тогда 
		Макет = ПолучитьМакет("ПФ_MXL_УниверсальныйКорректировочныйДокумент2026");
	ИначеЕсли ДатаДокумента >= Дата(2024,10,1) Тогда 
		Макет = ПолучитьМакет("ПФ_MXL_УниверсальныйКорректировочныйДокумент1096");
	Иначе
		Макет = ПолучитьМакет("ПФ_MXL_УниверсальныйКорректировочныйДокумент534"); 
	КонецЕсли;  
	
	//ИдентификаторДокумента
	ИспользуетсяЭлектронныйОбменДанными = Константы.CW_ИспользуетсяЭлектронныйОбменДанными.Получить(); 
	Если ДатаДокумента >= Дата(2024,10,1) и ИспользуетсяЭлектронныйОбменДанными Тогда 
		ИдентификаторДокумента = Макет.ПолучитьОбласть("ИдентификаторДокумента");  
		ИдентификаторДокумента.Параметры.ИдентификаторДокумента = СокрЛП(XMLСтрока(СсылкаНаОбъект));
		ТабличныйДокумент.Вывести(ИдентификаторДокумента);
	КонецЕсли;              
	//ИдентификаторДокумента
	
	
	ВыводитьПодписиИПечать = НастройкиПечати.ПодписьИПечать = Истина ИЛИ (Ссылка.Договор.ПодписьИПечатьАкты И НастройкиПечати.ДляРассылки);
	
	Если Ссылка.Контрагент.ОбособленноеПодразделение 
		И Ссылка.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
		НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент.ГоловнойКонтрагент, ДатаДокумента);
	Иначе
		НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент,ДатаДокумента);
	КонецЕсли;

	КПП_Контрагента 		= Справочники.Контрагенты.КППНаДату(Ссылка.Контрагент,ДатаДокумента);
	
	//Инициализация областей документа
	ЗаголовокДокумента	= Макет.ПолучитьОбласть("ЗаголовокДокумента");
	ОбластьОснования	= Макет.ПолучитьОбласть("ОбластьОснования");
	ОбластьОснований	= Макет.ПолучитьОбласть("ОбластьОснований");
	
	Шапка         = Макет.ПолучитьОбласть("Шапка");
	ШапкаТаблицы  = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	СтрокаТаблицы = Макет.ПолучитьОбласть("Строка");
	ПодвалТаблицы = Макет.ПолучитьОбласть("Итого");
	
	ПодвалТаблицы = Макет.ПолучитьОбласть("Итого");
	
	Если Макет.Области.Найти("ИдентификаторГосКонтракта") <> Неопределено Тогда
		ГосКонтракт   = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта"); 
	Иначе
		ГосКонтракт = Неопределено;
	КонецЕсли;
	
	//Дополнение 
	ОбластьДополнениеШапка  = Макет.ПолучитьОбласть("ДополнениеШапки");
	ОбластьДополнениеПодвал = Макет.ПолучитьОбласть("Дополнение");
	ОбластьДополнениеЛинияСверху	= Макет.ПолучитьОбласть("ДополнениеЛинияСверху"); 
	//Дополнение 
	
	Если ВыводитьПодписиИПечать Тогда
		Подписи  = Макет.ПолучитьОбласть("ПодвалПодписи");
		Подписи2 = Макет.ПолучитьОбласть("ПодвалНакладнойПодписи");
	Иначе
		Подписи  = Макет.ПолучитьОбласть("Подвал");
		Подписи2 = Макет.ПолучитьОбласть("ПодвалНакладной");
	КонецЕсли;
	
	Подписи2.Параметры.ИныеСведения 	= Ссылка.СопроводительныеДокументы;
	
	НумерацияЛистов = Макет.ПолучитьОбласть("НумерацияЛистов");
	//Инициализация областей документа
	
	//Заголовок печатной формы 
	НомерДатаДокумента = Новый Структура("Номер,Дата","НомерСчетаФактуры","ДатаСчетаФактуры");
	Если Ссылка.ФормируетсяСчетФактура Тогда
		Шапка.Параметры.СтатусУКД = "1";
	Иначе
		Шапка.Параметры.СтатусУКД = "2"; 
		
		НомерДатаДокумента.Номер = "НомерАкта";
		НомерДатаДокумента.Дата  = "ДатаАкта";
	КонецЕсли;	   
	
	Если Ссылка.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") Тогда
		ЗаголовокДокумента.Параметры.Номер 	= CW_Документы.ПолучитьНомерНаПечать(Ссылка, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата);
		ЗаголовокДокумента.Параметры.Дата 	= Формат(Ссылка[НомерДатаДокумента.Дата],"ДЛФ=DD");
	Иначе
		ЗаголовокДокумента.Параметры.Номер 	= CW_Документы.ПолучитьНомерНаПечать(Ссылка, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата);
		ЗаголовокДокумента.Параметры.Дата 	= Формат(Ссылка[НомерДатаДокумента.Дата],"ДЛФ=DD");
	КонецЕсли;
	
	Если Ссылка.Корректировка и Ссылка.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
		ЗаголовокДокумента.Параметры.НомерИсправленияКорректировочного = Формат(Ссылка.НомерИсправления,"ЧГ=0");
		ЗаголовокДокумента.Параметры.ДатаИсправленияКорректировочного = Формат(Ссылка.ДатаСчетаФактуры, "ДЛФ=DD");
	Иначе
		ЗаголовокДокумента.Параметры.НомерИсправленияКорректировочного = "--";
		ЗаголовокДокумента.Параметры.ДатаИсправленияКорректировочного = "--";
	КонецЕсли;
	
	НумерацияЛистовНомер 	= CW_Документы.ПолучитьНомерНаПечать(Ссылка, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата);
	НумерацияЛистовДата 	= Формат(Ссылка[НомерДатаДокумента.Дата],"ДЛФ=DD");
	
	Шапка.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
	Шапка.Параметры.АдресПоставщика         = АдресПоставщика;
	Шапка.Параметры.ИННПоставщика           = ИННПоставщика;
	
	#Область РасчетноПлатежныеДокументы
	
	_стр = "";
	
	// В документе "ДоходыПоГрузоперевозке" расчетно-платежные документы указаны 
	// в одноименной табличной части документа. Подготовим строку для вывода в макет.
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		Если Ссылка.ПлатёжноРасчётныеДокументы.Количество() = 0 Тогда
			
			// до 01.10.17 г при отсутствии в табличной части строк используем 
			// "старый" алгоритм вывода расчетно-платежных документов - 
			// по информации о зачтенных авансах. Расчетно-платежные документы
			// берем из ТЧ "ЗачетАвансов" (при зачете аванса они туда всегда 
			// прописываются в явном виде)
			Если ДатаДокумента < Дата(2017,10,01) Тогда 
				Для Каждого ПлатежныйДокумент Из Ссылка.ЗачетАвансов Цикл
					Если Не ПустаяСтрока(ПлатежныйДокумент.ПредставлениеДокументаАванса) Тогда
						_стр = _стр + "; " + Сред(СокрЛП(ПлатежныйДокумент.ПредставлениеДокументаАванса),2);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли; // если дата документа ранее 01.10.17
		Иначе 
			_стр = "";
			Для Каждого строкаПлатёжноРасчётныеДокументы Из Ссылка.ПлатёжноРасчётныеДокументы Цикл
				_стр = _стр + "; " + строкаПлатёжноРасчётныеДокументы.НомерДокумента + " от " + Формат(строкаПлатёжноРасчётныеДокументы.ДатаДокумента, "ДФ=dd.MM.yyyy");
			КонецЦикла;
			
		КонецЕсли; // в ТЧ есть платежно-расчетные документв
		
		// при наличии документов удалим ";" в начале строки 
		Если Не ПустаяСтрока(_стр) Тогда
			_стр = Сред(_стр,2); 
		КонецЕсли; 
		
		// В документе "ЗакрытиеГрузоперевозки" автоматическое формирование строки пока не предусмотрено...
	Иначе
	КонецЕсли;  // проверка на тип документа
	
	#КонецОбласти 
	
	ВРУ = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ПредставлениеВалюты = "";
	Если ЗначениеЗаполнено(Ссылка.ВедомыйДокументКорректировки) Тогда
		ПредставлениеВалюты = Строка(?(Ссылка.ВедомыйДокументКорректировки.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ВРУ.НаименованиеПолное, Ссылка.ВедомыйДокументКорректировки.ВалютаДокумента.НаименованиеПолное))+","+Строка(?(Ссылка.ВедомыйДокументКорректировки.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ВРУ.Код, Ссылка.ВедомыйДокументКорректировки.ВалютаДокумента.Код));	
	Иначе
		ПредставлениеВалюты = Строка(?(Ссылка.Договор.ВзаиморасчетыВУЕ, ВРУ.НаименованиеПолное, Ссылка.Валюта.НаименованиеПолное))+","+Строка(?(Ссылка.Договор.ВзаиморасчетыВУЕ, ВРУ.Код, Ссылка.Валюта.Код));	
	КонецЕсли;
	
	Шапка.Параметры.Валюта = "" + ПредставлениеВалюты;

	Шапка.Параметры.ПредставлениеПокупателя = "" + НаименованияКонтрагента.ПолноеНаименование;
	
	Если ПараметрыДоговора.ВПечатныхФормахВыводитьРеквизитыГоловнойОрганизации Тогда
		ГоловнойКонтрагент = Ссылка.Контрагент.ГоловнойКонтрагент;
		
		КПП_ГоловнойКонтрагент 			= Справочники.Контрагенты.КППНаДату(ГоловнойКонтрагент,ДатаДокумента);
		
		НаДату = Ссылка.ДатаСчетаФактуры;
		СведенияКонтрагент = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(ГоловнойКонтрагент, НаДату); 
		
		Шапка.Параметры.АдресПокупателя         = "" + СведенияКонтрагент.ЮридическийАдрес;
		Шапка.Параметры.ИННПокупателя           = "" + ГоловнойКонтрагент.ИНН + "/" + КПП_ГоловнойКонтрагент ;
	Иначе
		Шапка.Параметры.АдресПокупателя         = "" + ПараметрыДоговора.Адрес;	
		Шапка.Параметры.ИННПокупателя           = "" + Ссылка.Контрагент.ИНН + "/" + КПП_Контрагента;
	КонецЕсли; 
	
	ТабличныйДокумент.Вывести(ЗаголовокДокумента);
	
	//ТабличныйДокумент.Вывести(ОбластьОснований);
	
	НомерИсправленияОснования = "--";
	ДатаИсправленияОснования = "--"; 
	
	Если Ссылка.КорректируемыйДокумент.Корректировка Тогда  
		
		ИсходныйВедущий 				= CW_Подписки.ПолучитьИсходныйСчетФактуру(Ссылка);
		ПоследнееИсправлениеИсходного 	= CW_Подписки.ПолучитьПоследнееИсправлениеИсходногоСчетФактуры(ИсходныйВедущий, "CW_ДоходыПоГрузоперевозке"); 	
		
		Если ПоследнееИсправлениеИсходного <> ИсходныйВедущий Тогда  
			НомерИсправленияОснования 	= Формат(ПоследнееИсправлениеИсходного.НомерИсправления,"ЧН=--; ЧГ=0");
			ДатаИсправленияОснования 	= Формат(ПоследнееИсправлениеИсходного.ДатаСчетаФактуры,"ДЛФ=DD; ДП=--");
		КонецЕсли;
		
		НомерОснования = CW_Документы.ПолучитьНомерНаПечать(ИсходныйВедущий, "НомерСчетаФактуры", "ДатаСчетаФактуры");	
		ДатаОсновнания = Формат(ИсходныйВедущий.ДатаСчетаФактуры,"ДЛФ=DD");	
		
	ИначеЕсли Ссылка.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") тогда
		
		НомерОснования = CW_Документы.ПолучитьНомерНаПечать(Ссылка.КорректируемыйДокумент, "НомерСчетаФактуры", "ДатаСчетаФактуры");	
		ДатаОсновнания = Формат(Ссылка.КорректируемыйДокумент.ДатаСчетаФактуры,"ДЛФ=DD");	
	Конецесли;
	
	ОбластьОснования.Параметры.НомерОснования 				= НомерОснования;
	ОбластьОснования.Параметры.ДатаОсновнания 				= ДатаОсновнания;
	ОбластьОснования.Параметры.НомерИсправленияОснования	= НомерИсправленияОснования;  
	ОбластьОснования.Параметры.ДатаИсправленияОснования		= ДатаИсправленияОснования;
	ТабличныйДокумент.Вывести(ОбластьОснования);
	
	ТабличныйДокумент.Вывести(Шапка);
	
	// госконтракт        
	Если ГосКонтракт <> Неопределено Тогда
		ГосКонтракт.Параметры.ИдентификаторГосКонтракта = Ссылка.ИдентификаторГосКонтракта;
		ТабличныйДокумент.Вывести(ГосКонтракт); 
	КонецЕсли;
	
	//Дополнение 
	Если ПараметрыДоговора.ВыводитьДополнениевШапкуАкта Тогда
		ОбластьДополнениеШапка.Параметры.ДополнениеТекст = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеАкта, Ссылка, Неопределено, Ссылка.Услуги);
		ТабличныйДокумент.Вывести(ОбластьДополнениеШапка);
	КонецЕсли;
	
	Если ПараметрыДоговора.ВыводитьДополнениеВПодавлеАкта Тогда
		ОбластьДополнениеПодвал.Параметры.ДополнениеТекст = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеПодвалаАктаРус, Ссылка, Неопределено, Ссылка.Услуги);
	КонецЕсли;
	//Дополнение
	
	// шапка таблицы		
	ТабличныйДокумент.Вывести(ШапкаТаблицы);
	
	
	ВсегоРазницаБезНДСУвеличение = 0;		ВсегоРазницаНДСУвеличение = 0;	ВсегоРазницаСНДСУвеличение = 0;
	ВсегоРазницаБезНДСУменьшение	= 0;	ВсегоРазницаНДСУменьшение = 0;	ВсегоРазницаСНДСУменьшение = 0;
	
	ТолькоБезНДС = Истина;  НомСтрГП = 0; НомСтр = 0; КолЛистов = 1;
	Для Каждого усл Из ТаблицаУслуг Цикл
		
		НомСтр = НомСтр + 1;
		
		Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов) И ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.СворачиватьПоГрузоперевозкам Тогда
			СтрТЗ_ГП = ТЗ_ГП.Найти(НомСтрГП, "НомСтр");
			Если СтрТЗ_ГП <> Неопределено Тогда
				ОблГП = Макет.ПолучитьОбласть("Группировка");
				ОблГП.Параметры.Группировка = СтрТЗ_ГП.Представление;
				Если ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ВыводитьИтогиПоГрузоперевозкам Тогда
					ОблГП.Параметры.Итого = СтрТЗ_ГП.Итого;
				КонецЕсли;	
				ТабличныйДокумент.Вывести(ОблГП);
				НомСтрГП = НомСтрГП + 1;
			КонецЕсли;	
		КонецЕсли;	
		НомСтрГП = НомСтрГП + 1;
		
		СтрокаТаблицы.Параметры.НомерСтроки = НомСтр;
		СтрокаТаблицы.Параметры.ТоварКод    = "--";
		
		ТоварКодТНВЭД = ?(ЗначениеЗаполнено(усл.Номенклатура.КодТНВЭД), усл.Номенклатура.КодТНВЭД, "--");
		
		СтрокаТаблицы.Параметры.ТоварКодТНВЭДДоИзменения =  ТоварКодТНВЭД;
		СтрокаТаблицы.Параметры.ТоварКодТНВЭД            =  ТоварКодТНВЭД;
		
		СтрокаТаблицы.Параметры.НаименованиеНоменклатуры = усл.Представление;
		Если СокрЛП(усл.Номенклатура.ЕдиницаИзмерения) = "-"
			ИЛИ НЕ ЗначениеЗаполнено(усл.Номенклатура.ЕдиницаИзмерения) Тогда
			СтрокаТаблицы.Параметры.НаименованиеЕдиницыИзмерения    = "--";
			СтрокаТаблицы.Параметры.ЕдиницаИзмеренияКод				= "--";
			
			СтрокаТаблицы.Параметры.КоличествоДоИзменения		=  "--";;
			СтрокаТаблицы.Параметры.КоличествоПослеИзменения	=  "--";;
			
			СтрокаТаблицы.Параметры.ЦенаДоИзменения 	= "--";
			СтрокаТаблицы.Параметры.ЦенаПослеИзменения 	= "--";
		Иначе
			СтрокаТаблицы.Параметры.НаименованиеЕдиницыИзмерения    = усл.Номенклатура.ЕдиницаИзмерения;
			СтрокаТаблицы.Параметры.ЕдиницаИзмеренияКод 			= ?(ЗначениеЗаполнено(усл.Номенклатура.ЕдиницаИзмерения.Код), усл.Номенклатура.ЕдиницаИзмерения.Код, "--");
			СтрокаТаблицы.Параметры.КоличествоДоИзменения          	= Усл.Количество;
			СтрокаТаблицы.Параметры.КоличествоПослеИзменения 		= Усл.ПК_Количество;
			
			Если Усл.Количество = 0 Тогда
				ЦенаДоИзменения = 0;
			Иначе
				ЦенаДоИзменения = ?(РасчетыУЕ, Усл.Цена_Рег, Усл.Цена);
			КонецЕсли;
			
			Если Усл.ПК_Количество = 0 Тогда
				ЦенаПослеИзменения = 0;
			Иначе
				ЦенаПослеИзменения = ?(РасчетыУЕ, Усл.ПК_Цена_Рег, Усл.ПК_Цена);
			КонецЕсли;
			
			СтрокаТаблицы.Параметры.ЦенаДоИзменения 	= ЦенаДоИзменения;
			СтрокаТаблицы.Параметры.ЦенаПослеИзменения 	= ЦенаПослеИзменения;
		КонецЕсли; 
		
		//Стоимость без НДС
		СтоимостьБезНДСДоИзменения		= ?(РасчетыУЕ, усл.Сумма_Рег, усл.Сумма);
		СтоимостьБезНДСПослеИзменения 	= ?(РасчетыУЕ, усл.ПК_Сумма_Рег, усл.ПК_Сумма);
		
		СтрокаТаблицы.Параметры.СтоимостьБезНДСПослеИзменения 	= СтоимостьБезНДСПослеИзменения;
		СтрокаТаблицы.Параметры.СтоимостьБезНДСДоИзменения 		= СтоимостьБезНДСДоИзменения;
		
		РазницаБезНДСУвеличение = 0; РазницаБезНДСУменьшение = 0;
		Если СтоимостьБезНДСПослеИзменения > СтоимостьБезНДСДоИзменения Тогда  
			РазницаБезНДСУвеличение			= СтоимостьБезНДСПослеИзменения - СтоимостьБезНДСДоИзменения;
			СтрокаТаблицы.Параметры.РазницаБезНДСУвеличение = РазницаБезНДСУвеличение;
		Иначе
			РазницаБезНДСУменьшение 		= -1* (СтоимостьБезНДСПослеИзменения - СтоимостьБезНДСДоИзменения);
			СтрокаТаблицы.Параметры.РазницаБезНДСУменьшение = РазницаБезНДСУменьшение;
		КонецЕсли;
		//Стоимость без НДС
		
		СтрокаТаблицы.Параметры.Акциз     = "без акциза";
		
		//Ставка НДС
		СтрокаТаблицы.Параметры.СтавкаНДСДоИзменения	= ?(усл.СтавкаНДС_ДоКорректировки = Перечисления.СтавкиНДС.БезНДС, "БЕЗ НДС", усл.СтавкаНДС_ДоКорректировки);
		СтрокаТаблицы.Параметры.СтавкаНДСПослеИзменения	= ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, "БЕЗ НДС", усл.СтавкаНДС);
		//Ставка НДС
		
		
		//Сумма НДС
		СуммаНДСДоИзменения 		= ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, 0, ?(РасчетыУЕ, усл.НДС_Рег, усл.НДС));
		СуммаНДСПослеИзменения 		= ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, 0, ?(РасчетыУЕ, усл.ПК_НДС_Рег, усл.ПК_НДС));
		
		СтрокаТаблицы.Параметры.СуммаНДСДоИзменения 	= СуммаНДСДоИзменения;
		СтрокаТаблицы.Параметры.СуммаНДСПослеИзменения 	= СуммаНДСПослеИзменения;
		
		РазницаНДСУвеличение = 0; РазницаНДСУменьшение = 0;
		Если СуммаНДСПослеИзменения > СуммаНДСДоИзменения Тогда 
			РазницаНДСУвеличение		=  СуммаНДСПослеИзменения - СуммаНДСДоИзменения;
			СтрокаТаблицы.Параметры.РазницаНДСУвеличение = РазницаНДСУвеличение;
		Иначе
			РазницаНДСУменьшение 		= -1* (СуммаНДСПослеИзменения - СуммаНДСДоИзменения);
			СтрокаТаблицы.Параметры.РазницаНДСУменьшение = РазницаНДСУменьшение;
		КонецЕсли;
		//Сумма НДС
		
		//Всего
		СтоимостьСНДСДоИзменения 		= ?(РасчетыУЕ, усл.Всего_Рег, усл.Всего);
		СтоимостьСНДСПослеИзменения 	= ?(РасчетыУЕ, усл.ПК_Всего_Рег, усл.ПК_Всего);
		
		СтрокаТаблицы.Параметры.СтоимостьСНДСДоИзменения     = СтоимостьСНДСДоИзменения;
		СтрокаТаблицы.Параметры.СтоимостьСНДСПослеИзменения  = СтоимостьСНДСПослеИзменения;
		
		РазницаСНДСУвеличение = 0; РазницаСНДСУменьшение = 0;
		Если СтоимостьСНДСПослеИзменения > СтоимостьСНДСДоИзменения Тогда 
			РазницаСНДСУвеличение 		= СтоимостьСНДСПослеИзменения - СтоимостьСНДСДоИзменения;
			СтрокаТаблицы.Параметры.РазницаСНДСУвеличение = РазницаСНДСУвеличение;
		Иначе
			РазницаСНДСУменьшение 		= -1*(СтоимостьСНДСПослеИзменения - СтоимостьСНДСДоИзменения);
			СтрокаТаблицы.Параметры.РазницаСНДСУменьшение = РазницаСНДСУменьшение;
		КонецЕсли;
		//Всего
		
		Если РазницаБезНДСУвеличение = 0 И РазницаБезНДСУменьшение = 0 
			И РазницаНДСУвеличение = 0 И РазницаНДСУменьшение = 0 
			И РазницаСНДСУменьшение = 0 И РазницаСНДСУвеличение = 0 Тогда
			
			//Ничего не изменилось
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.Параметры.СтранаПроисхожденияКодДо 	= "--";
		СтрокаТаблицы.Параметры.СтранаПроисхожденияКодПосле = "--";
		
		СтрокаТаблицы.Параметры.ПредставлениеСтраныДо    	= "--";
		СтрокаТаблицы.Параметры.ПредставлениеСтраныПосле	= "--";
		
		СтрокаТаблицы.Параметры.ПредставлениеГТДДо			= "--";
		СтрокаТаблицы.Параметры.ПредставлениеГТДПосле		= "--";
		
		Если (усл.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС) Тогда
			ТолькоБезНДС = Ложь;
		КонецЕсли; 
		
		//Проверяем возможность вывода
		Если ВсегоСтрокДляВывода = НомСтр Тогда
			
			МассивОбластийВывода = Новый Массив;
			МассивОбластийВывода.Добавить(СтрокаТаблицы);
			МассивОбластийВывода.Добавить(ПодвалТаблицы); 
			
			МассивОбластийВывода.Добавить(Подписи);
			
			//Дополнение
			Если ПараметрыДоговора.ВыводитьДополнениеВПодавлеАкта Тогда   
				МассивОбластийВывода.Добавить(ОбластьДополнениеПодвал);
			Иначе
				МассивОбластийВывода.Добавить(ОбластьДополнениеЛинияСверху);
			КонецЕсли;
			//Дополнение
			
			МассивОбластийВывода.Добавить(Подписи2);
			
			Если Не ТабличныйДокумент.ПроверитьВывод(МассивОбластийВывода) Тогда
				КолЛистов = КолЛистов + 1;
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 
				НумерацияЛистов.Параметры.Номер 		= НумерацияЛистовНомер;
				НумерацияЛистов.Параметры.Дата 			= НумерацияЛистовДата;
				НумерацияЛистов.Параметры.НомерЛиста 	= КолЛистов;
				ТабличныйДокумент.Вывести(НумерацияЛистов);
				ТабличныйДокумент.Вывести(ШапкаТаблицы);
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(СтрокаТаблицы);
			
		Иначе
			МассивОбластийВывода = Новый Массив;
			МассивОбластийВывода.Добавить(СтрокаТаблицы);
			
			Если Не ТабличныйДокумент.ПроверитьВывод(МассивОбластийВывода) Тогда
				
				КолЛистов = КолЛистов + 1;
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НумерацияЛистов.Параметры.Номер 		= НумерацияЛистовНомер;
				НумерацияЛистов.Параметры.Дата 			= НумерацияЛистовДата;
				НумерацияЛистов.Параметры.НомерЛиста 	= КолЛистов;
				ТабличныйДокумент.Вывести(НумерацияЛистов);
				ТабличныйДокумент.Вывести(ШапкаТаблицы);
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(СтрокаТаблицы);
			
		КонецЕсли;
		
		//Итоги по строке
		ВсегоРазницаБезНДСУвеличение	= ВсегоРазницаБезНДСУвеличение + РазницаБезНДСУвеличение;
		ВсегоРазницаБезНДСУменьшение	= ВсегоРазницаБезНДСУменьшение + РазницаБезНДСУменьшение;
		
		ВсегоРазницаНДСУвеличение 	= ВсегоРазницаНДСУвеличение + РазницаНДСУвеличение;
		ВсегоРазницаНДСУменьшение 	= ВсегоРазницаНДСУменьшение + РазницаНДСУменьшение;
		
		ВсегоРазницаСНДСУменьшение 	= ВсегоРазницаСНДСУменьшение + РазницаСНДСУменьшение;
		ВсегоРазницаСНДСУвеличение 	= ВсегоРазницаСНДСУвеличение + РазницаСНДСУвеличение;
		
	КонецЦикла;
	
	
	ПодвалТаблицы.Параметры.РазницаБезНДСУвеличение = ВсегоРазницаБезНДСУвеличение;		
	ПодвалТаблицы.Параметры.РазницаБезНДСУменьшение = ВсегоРазницаБезНДСУменьшение;	
	
	ПодвалТаблицы.Параметры.РазницаНДСУвеличение = ВсегоРазницаНДСУвеличение;	
	ПодвалТаблицы.Параметры.РазницаНДСУменьшение = ВсегоРазницаНДСУменьшение;	
	
	ПодвалТаблицы.Параметры.РазницаСНДСУвеличение = ВсегоРазницаСНДСУвеличение;
	ПодвалТаблицы.Параметры.РазницаСНДСУменьшение = ВсегоРазницаСНДСУменьшение;
	
	ТабличныйДокумент.Вывести(ПодвалТаблицы);
	
	
	#Область ПодписантыПоДокументу
	
	// организация (не ИП)
	Если (НЕ ИП) Тогда
		Подписанты = _БЭ.ВернутьПодписантов(Ссылка, ПараметрыДоговора);
		
		// получаем картинки подписей руководителя и главного бухгалтера
		Если ВыводитьПодписиИПечать Тогда 
			
			ПодписьРуководителя	= CW_Печать.ПолучитьПодписьСотрудника(Подписанты.Руководитель, Ложь);
			ПодписьБухгалтера  	= CW_Печать.ПолучитьПодписьСотрудника(Подписанты.ГлБух, Ложь);
			
			РисунокПодписьРуководителя = Подписи.Рисунки.ПодписьРуководителяСФ;
			РисунокПодписьРуководителя.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
			РисунокПодписьРуководителя.ВыводитьНаПечать = Ложь ;
			Если ПодписьРуководителя <> Неопределено Тогда
				РисунокПодписьРуководителя.ВыводитьНаПечать = Истина;
				РисунокПодписьРуководителя.Картинка			= Новый Картинка(ПодписьРуководителя);
			КонецЕсли;
			
			РисунокПодписьБухгалтера = Подписи.Рисунки.ПодписьБухгалтераСФ;
			РисунокПодписьБухгалтера.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
			РисунокПодписьБухгалтера.ВыводитьНаПечать = Ложь;
			Если ПодписьБухгалтера <> Неопределено Тогда
				РисунокПодписьБухгалтера.ВыводитьНаПечать 	= Истина;
				РисунокПодписьБухгалтера.Картинка			= Новый Картинка(ПодписьБухгалтера);
			КонецЕсли;
			
		КонецЕсли;
		// подписи руководителя и главного бухгалтера
		Подписи.Параметры.ФИОруководителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,Ссылка.Дата)
		+ ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", "");
		
		Подписи.Параметры.ФИОГлавногоБухгалтера = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.ГлБух,Ссылка.Дата)
		+ ?(ЗначениеЗаполнено(Подписанты.ГлБухОснованиеРус), " (" + Подписанты.ГлБухОснованиеРус + ")", ""); 
		
		// Индивидуальный предприниматель
	Иначе     
		НаДату 		= Ссылка.ВедомыйДокументКорректировки.Дата;
		СведенияИП 	= CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, НаДату); 
		Подписи.Параметры.ФИОПБОЮЛ = СведенияИП.НаименованиеДляПечатныхФорм;
		Подписи.Параметры.Свидетельство = СведенияИП.Свидетельство;
	КонецЕсли; 
	
	Подписи.Параметры.КоличествоЛистов = "Документ составлен на " + КолЛистов + ?(КолЛистов = 1, " листе", " листах");
	ТабличныйДокумент.Вывести(Подписи);
	
	//Дополнение
	Если ПараметрыДоговора.ВыводитьДополнениеВПодавлеАкта Тогда   
		ТабличныйДокумент.Вывести(ОбластьДополнениеПодвал);  
	Иначе
		ТабличныйДокумент.Вывести(ОбластьДополнениеЛинияСверху);  
	КонецЕсли;
	//Дополнение
	
	Если ВыводитьПодписиИПечать Тогда   
		
		ПечатьОрганизации   = CW_Печать.ПолучитьПечатьОрганизации(Ссылка.Организация, НастройкиПечати.ПодключаемыйОбъект, Ссылка.ДатаАкта, Ложь);
		ПодписьРуководителя	= CW_Печать.ПолучитьПодписьСотрудника(Подписанты.Руководитель, Ложь);
		ПодписьБухгалтера  	= CW_Печать.ПолучитьПодписьСотрудника(Подписанты.ГлБух, Ложь);
		
		РисунокПодписьРуководителя = Подписи2.Рисунки.ПодписьРуководителя;
		РисунокПодписьРуководителя.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		РисунокПодписьРуководителя.ВыводитьНаПечать = Ложь;
		Если ПодписьРуководителя <> Неопределено Тогда
			РисунокПодписьРуководителя.ВыводитьНаПечать = Истина;
			РисунокПодписьРуководителя.Картинка			= Новый Картинка(ПодписьРуководителя);
		КонецЕсли;
		
		РисунокПодписьБухгалтера = Подписи2.Рисунки.ПодписьБухгалтера;
		РисунокПодписьБухгалтера.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		РисунокПодписьБухгалтера.ВыводитьНаПечать = Ложь;
		Если ПодписьБухгалтера <> Неопределено Тогда
			РисунокПодписьБухгалтера.ВыводитьНаПечать 	= Истина;
			РисунокПодписьБухгалтера.Картинка			= Новый Картинка(ПодписьБухгалтера);
		КонецЕсли;
		
		РисунокПечатьОрганизации = Подписи2.Рисунки.ПечатьОрганизации;
		РисунокПечатьОрганизации.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		РисунокПечатьОрганизации.ВыводитьНаПечать =  Ложь;
		Если ПечатьОрганизации <> Неопределено Тогда
			РисунокПечатьОрганизации.ВыводитьНаПечать	=  Истина;
			РисунокПечатьОрганизации.Картинка			= Новый Картинка(ПечатьОрганизации);
		КонецЕсли;
		
	КонецЕсли;   
	
	Основание = СокрЛП(Ссылка.Договор.ВидДокумента.КраткоеНаименование) +" №"+ СокрЛП(Ссылка.Договор.НомерДоговора)+ " от "	+ Формат(Ссылка.Договор.ДатаДоговора,"ДФ=dd.MM.yyyy");
	Если ЗначениеЗаполнено(Ссылка.ПриложениеКДоговору) Тогда
		Основание = СокрЛП(Ссылка.ПриложениеКДоговору.ВидДокумента.КраткоеНаименование)+
		" №"	+ СокрЛП(Ссылка.ПриложениеКДоговору.НомерДокумента)+
		" от "	+ Формат(Ссылка.ПриложениеКДоговору.ДатаДокумента,"ДФ=dd.MM.yyyy") + 
		" к "	+ Основание;
	КонецЕсли;
	
	Подписи2.Параметры.Основание = Основание;
	
	КорректируемыйДокументНомер  = CW_Документы.ПолучитьНомерНаПечать(Ссылка.КорректируемыйДокумент, НомерДатаДокумента.Номер, НомерДатаДокумента.Дата);
	КорректируемыйДокументДата 	 = Формат(Ссылка.КорректируемыйДокумент[НомерДатаДокумента.Дата],"ДЛФ=DD");

	Подписи2.Параметры.РеквизитыПередаточныхДокументов 	= "Универсальный корректировочный документ №" + КорректируемыйДокументНомер +" от " + КорректируемыйДокументДата;
	Подписи2.Параметры.ДолжностьРуководителя 	= Подписанты.РуководительДолжностьРус;
	Подписи2.Параметры.ФИОРуководителяНакладная = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель, Ссылка.Дата);
	
	Если ЗначениеЗаполнено(Подписанты.ОтветственныйЗаОформление) Тогда
		Подписи2.Параметры.ДолжностьОтветственного = Подписанты.ОтветственныйЗаОформлениеДолжность;
		Подписи2.Параметры.ФИООтветственного = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.ОтветственныйЗаОформление,Ссылка.Дата)
		+ ?(ЗначениеЗаполнено(Подписанты.ОтветственныйЗаОформлениеОснованиеРус), " (" + Подписанты.ОтветственныйЗаОформлениеОснованиеРус + ")", "");
	Иначе
		Подписи2.Параметры.ДолжностьОтветственного = "Главный бухгалтер";
		Подписи2.Параметры.ФИООтветственного = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.ГлБух,Ссылка.Дата)
		+ ?(ЗначениеЗаполнено(Подписанты.ГлБухОснованиеРус), " (" + Подписанты.ГлБухОснованиеРус + ")", "");
	КонецЕсли;
	
	НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(Ссылка.Организация, Ссылка.Дата);

	Если Ссылка.Контрагент.ОбособленноеПодразделение 
		И Ссылка.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
		НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент.ГоловнойКонтрагент, ДатаДокумента);
	Иначе
		НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент,ДатаДокумента);
	КонецЕсли;
	
	Подписи2.Параметры.ПредставлениеОрганизации	= НаименованияОрганизации.НаименованиеДляПечатныхФорм + ", ИНН/КПП " + Ссылка.Организация.ИНН + "/" + Справочники.Организации.КППНаДату(Ссылка.Организация, Ссылка.Дата) ;
	Подписи2.Параметры.ПредставлениеКонтрагента = НаименованияКонтрагента.НаименованиеДляПечатныхФорм + ", ИНН/КПП " + Ссылка.Контрагент.ИНН + "/" + Справочники.Контрагенты.КППНаДату(Ссылка.Контрагент, Ссылка.Дата) ;
	
	ТабличныйДокумент.Вывести(Подписи2); 
	
	//исполнитель документа
	Если Не Ссылка.Ответственный.Пустая() и ПараметрыДоговора.ВыводитьИсполнителяАкт Тогда
		
		Исполнитель 				= ""; 
		Если ЗначениеЗаполнено(Ссылка.Ответственный.ФизическоеЛицо) Тогда
			Исполнитель 			= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Ссылка.Ответственный.ФизическоеЛицо);
		КонецЕсли;
		ТелефонИсполнителя 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Ответственный, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПользователя"),,Истина);		
		
		ОбластьИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
		ОбластьИсполнитель.Параметры.Исполнитель 		= "Исп.: "+ Исполнитель;
		ОбластьИсполнитель.Параметры.ТелефонИсполнителя = "Тел.: "+ ТелефонИсполнителя;
		
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
	КонецЕсли;
	//исполнитель документа
	
	#КонецОбласти 
	
	РезультатПечати.ПечатнаяФорма = ТабличныйДокумент;
	
	Возврат РезультатПечати;
	
КонецФункции // ПечатьУПД

Функция СписокСвязанныхСчетов(Язык=0)
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				СсылкаНаОбъект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		СсылкаНаОбъект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, СсылкаНаОбъект.Дата);
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CW_СоответствиеАктовИсходящимСчетам.Счет 
	|ИЗ
	|	РегистрСведений.CW_СоответствиеАктовИсходящимСчетам КАК CW_СоответствиеАктовИсходящимСчетам
	|ГДЕ
	|	CW_СоответствиеАктовИсходящимСчетам.Акт = &Акт";
	Запрос.УстановитьПараметр("Акт", СсылкаНаОбъект);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Ответ = ""; ОтветАнгл = "";
	Для Каждого Стр из ТЗ Цикл
		Если (ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Стр.Счет.ВедомыйСчет);
			ДатаДокумента = Стр.Счет.ВедомыйСчет.Дата;
		Иначе
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Стр.Счет, "НомерСчета", "ДатаСчета");
			ДатаДокумента = Стр.Счет.ДатаСчета;
		КонецЕсли; 
		Ответ     = Ответ     + "№" + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy") + "; ";
		ОтветАнгл = ОтветАнгл + "№" + НомерДокумента + " of " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy") + "; ";
	КонецЦикла;	
	
	Если НЕ ЗначениеЗаполнено(Ответ) Тогда
		Возврат "";
	Иначе
		Ответ =     Сред(Ответ,     1, СтрДлина(Ответ)     - 2);
		ОтветАнгл = Сред(ОтветАнгл, 1, СтрДлина(ОтветАнгл) - 2);
		//Если Язык = 0 Тогда
		Возврат "к счету " + Ответ;
		//ИначеЕсли Язык = 1 Тогда
		//	Возврат "to invoice " + ОтветАнгл;
		//Иначе
		//	Возврат "к счету " + Ответ + Символы.ПС + "to invoice " + ОтветАнгл;
		//КонецЕсли;	
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПоследнееИсправление(ИсправляемыйСчетФактура)
	
	Результат = Новый Структура("НомерИсправления,ДатаИсправления","",Дата(1,1,1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданный.Дата КАК ДатаИсправления,
	|	СчетФактураВыданный.НомерИсправления КАК НомерИсправления
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ИсправляемыйСчетФактура = &ИсправляемыйСчетФактура
	|	И СчетФактураВыданный.Исправление = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерИсправления УБЫВ";
	
	Запрос.УстановитьПараметр("ИсправляемыйСчетФактура", ИсправляемыйСчетФактура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

Функция НужноПечататьОбычныйСчетФактуру(Ссылка)  
	
	ВидОперацииКорректировки = Ссылка.ВидОперацииКорректировки; 
	Если  ВидОперацииКорректировки.Пустая() Тогда
		ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение");
	КонецЕсли;   
	
	Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") Тогда  
		Если Не Ссылка.КорректируемыйДокумент.Корректировка Тогда 
			Возврат Ложь;
		Иначе
			Возврат НужноПечататьОбычныйСчетФактуру(Ссылка.КорректируемыйДокумент);	
		КонецЕсли; 
	КонецЕсли;	
	
	Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда  
		Если Не Ссылка.КорректируемыйДокумент.Корректировка Тогда 
			Возврат Истина;  
		Иначе
			Возврат НужноПечататьОбычныйСчетФактуру(Ссылка.КорректируемыйДокумент);	
		КонецЕсли; 
	КонецЕсли;  
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьВедомыйСчетФактуру(Ссылка);  
	
	Если Не Ссылка.Корректировка Тогда
		Возврат Ссылка.ВедомыйСчетФактура; 
	Иначе
		Если Ссылка.КорректируемыйДокумент.Корректировка Тогда
			Возврат	ПолучитьВедомыйСчетФактуру(Ссылка.КорректируемыйДокумент);
		КонецЕсли;
		
		Возврат Ссылка.КорректируемыйДокумент.ВедомыйСчетФактура;
	КонецЕсли;
	
КонецФункции


#КонецЕсли