
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаДоговорПриложение.Заголовок = СокрЛП(Запись.Владелец.Метаданные().ПредставлениеОбъекта);
	ЗаполнитьСписокУслугПоГруппе();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСписокУслугПоГруппе()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоставГруппУслуг.Услуга КАК Услуга
	               |ИЗ
	               |	РегистрСведений.CW_СоставГруппУслуг КАК CW_СоставГруппУслуг
	               |ГДЕ
	               |	CW_СоставГруппУслуг.Владелец = &Владелец
	               |	И CW_СоставГруппУслуг.ГруппаУслуг = &ГруппаУслуг";
	
	Запрос.УстановитьПараметр("Владелец" , 		Запись.Владелец);
	Запрос.УстановитьПараметр("ГруппаУслуг" , 	Запись.ГруппаУслуг);
	
	Выборка = Запрос.Выполнить().Выбрать();                  

	СоставГруппыУслуг.Очистить();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СоставГруппыУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Набор = РегистрыСведений.CW_СоставГруппУслуг.СоздатьНаборЗаписей();
	Набор.Отбор.Владелец.Установить(ТекущийОбъект.Владелец);
	Набор.Отбор.ГруппаУслуг.Установить(ТекущийОбъект.ГруппаУслуг);
	Набор.Прочитать();
	Набор.Очистить();
	
	Для каждого СтрокаУслуг из СоставГруппыУслуг Цикл
		СтрокаНабора = Набор.Добавить();
		СтрокаНабора.Владелец		= ТекущийОбъект.Владелец;
		СтрокаНабора.ГруппаУслуг	= ТекущийОбъект.ГруппаУслуг;
		СтрокаНабора.Услуга			= СтрокаУслуг.Услуга;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ГруппаУслугПриИзмененииНаСервере(ГруппаУслуг)
	Возврат ГруппаУслуг.ОсновнойВариантПредставления;
КонецФункции

&НаКлиенте
Процедура ГруппаУслугПриИзменении(Элемент)
	
	Запись.ВариантПредставления =ГруппаУслугПриИзмененииНаСервере(Запись.ГруппаУслуг);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставГруппыУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Запись.ГруппаУслуг.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана группа услуг!",,"ГруппаУслуг","Запись", Отказ);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроверитьСоставГруппыУслуг(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоставГруппыУслуг(Отказ)
	
	мУслуги = СоставГруппыУслуг.Выгрузить().ВыгрузитьКолонку("Услуга");
	
	мУслугиУникально = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мУслугиУникально, мУслуги, Истина);
	
	Если мУслуги.Количество() <> мУслугиУникально.Количество() Тогда
		
		Для каждого УникальнаяУслуга из  мУслугиУникально Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Услуга", УникальнаяУслуга);
			мСтроки = СоставГруппыУслуг.НайтиСтроки(Отбор);
			
			Если мСтроки.Количество() > 1 Тогда
				//Должна быть одна строка, она в принципе должна быть
				ИндексСтроки = СоставГруппыУслуг.Индекс(мСтроки[0]);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дублирование услуги "+УникальнаяУслуга+" в составе группы!",, "СоставГруппыУслуг["+ИндексСтроки+"].Услуга",, Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоставГруппУслуг.ГруппаУслуг КАК ГруппаУслуг,
	               |	CW_СоставГруппУслуг.Услуга КАК Услуга
	               |ИЗ
	               |	РегистрСведений.CW_СоставГруппУслуг КАК CW_СоставГруппУслуг
	               |ГДЕ
	               |	CW_СоставГруппУслуг.Владелец = &Владелец
	               |	И CW_СоставГруппУслуг.ГруппаУслуг <> &ГруппаУслуг
	               |	И CW_СоставГруппУслуг.Услуга В (&мУслугиУникально)";
	
	Запрос.УстановитьПараметр("Владелец", 			Запись.Владелец);
	Запрос.УстановитьПараметр("ГруппаУслуг",		Запись.ГруппаУслуг);
	Запрос.УстановитьПараметр("мУслугиУникально",	мУслугиУникально);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Услуга", Выборка.Услуга);
			мСтроки = СоставГруппыУслуг.НайтиСтроки(Отбор);
			
			Если мСтроки.Количество() > 0 Тогда
				//Должна быть одна строка, она в принципе должна быть
				ИндексСтроки = СоставГруппыУслуг.Индекс(мСтроки[0]);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Услуга "+Выборка.Услуга+" уже вклчюена в группу "+Выборка.ГруппаУслуг+"!",, "СоставГруппыУслуг["+ИндексСтроки+"].Услуга",, Отказ);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры
