&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма 	= ПараметрыВыполненияКоманды.Источник;
	Объект 	= Форма.Объект;
	Отказ 	= Ложь;
	
	ТекстОшибки	= "";
	Если (Объект.Дата = Дата(1,1,1)) Тогда
		ТекстОшибки = ТекстОшибки +"Поле ""Дата"" не заполнено!"+Символы.ПС;
		Отказ = истина;
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(Объект.Организация)) Тогда
		ТекстОшибки = ТекстОшибки + "Поле ""Организация"" не заполнено!"+Символы.ПС;
		Отказ = истина;
	КонецЕсли;	
	
	Если (НЕ ЗначениеЗаполнено(Объект.Контрагент)) Тогда
		ТекстОшибки = ТекстОшибки + "Поле ""Контрагент"" не заполнено!"+Символы.ПС;
		Отказ = истина;
	КонецЕсли;

	Если Отказ Тогда
		ТекстОшибки = "Ошибки заполнения обязательных реквизитов:"+Символы.ПС+ТекстОшибки; 
		ПоказатьПредупреждение(,ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ПроверитьВедениеОперативногоУчета(Объект, Отказ);
	Если НЕ ПроверитьВозможностьПодбораСчетов(ТипЗнч(ПараметрКоманды), Объект.Организация, Объект.Дата) Тогда
		ТекстПредупреждения = "Ведется раздельный учет оперативной и бухгалтерской задолженности. Подбор счетов не предусмотрен!
		| см. Настройки учета оперативной задолженности";
		
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	Конецесли;
	
	// если дата документа после даты начала ведения учёта по оперативке
	// иначе открываем документ оплаты в режиме ввода остатков
	Оповещение = Новый ОписаниеОповещения("ОбработкаПодбораСчетовДляОплаты",ЭтотОбъект, Новый Структура("Форма",Форма)); 
	ПараметрыФормыПодбора = _ПараметрыФормыПодбора(Форма.УникальныйИдентификатор,Объект);
	КодВозврата = 0;
	Если (ПараметрыФормыПодбора.Свойство("Код")) Тогда
		КодВозврата = ПараметрыФормыПодбора.Код;
	КонецЕсли; 
	Если (КодВозврата <> 0) Тогда
		ПоказатьПредупреждение(,_УФКС.ПредставлениеОшибки(ПараметрыФормыПодбора));
	Иначе
		ОткрытьФорму("ОбщаяФорма.CW_ФормаПодбораСчетовДляОплаты",ПараметрыФормыПодбора,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьПодбораСчетов(ТипДокумента, Знач Организация, Знач Дата)   
	
	Если ТипДокумента = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		ВидОперативнойЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская;
	КонецЕсли; 
	
	Если ТипДокумента = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ВидОперативнойЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская;
	КонецЕсли; 
	
	СтруктураНастроек 	= CW_Настройки.ПолучитьНастройкиОперативногоУчета(Организация, ВидОперативнойЗадолженности, Дата);
	
	Если Не СтруктураНастроек["ВедетсяОперативныйУчет"]  
		ИЛИ СтруктураНастроек["НастройкиОперативногоУчета"]["РаздельныйУчет"] Тогда
		//Оперативная задолженность не ведется
		Возврат Ложь;
	КонецЕсли; 

	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеВидовОперативнойЗадолженности()
	
	Результат = Новый Соответствие;
	Результат.Вставить(Тип("ДокументСсылка.СписаниеСРасчетногоСчета"), ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская"));
	Результат.Вставить(Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет"), ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская"));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВедениеОперативногоУчета(Объект, Отказ)
	
	Если (ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета")) Тогда
		Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику") Тогда
			_УФК.ВывестиПредупреждение("Недопустимый вид операции. ("+Строка(Объект.ВидОперации)+")
			|
			|Подбор счетов возможен только для вида операции ""Оплата поставщику""");
			
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ВидОЗ 	= ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская");
		
	ИначеЕсли (ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет")) Тогда 
		Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя") Тогда
			_УФК.ВывестиПредупреждение("Недопустимый вид операции. ("+Строка(Объект.ВидОперации)+")
			|
			|Подбор счетов возможен только для вида операции ""Оплата покупателя""");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ВидОЗ 	= ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская");
		ПОУ 	= _ПараметрыОперативногоУчета(Объект,ВидОЗ);
		
	Иначе
		_УФК.ВывестиПредупреждение("Невозможно определить вид оперативной задолженности.");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	ПОУ = _ПараметрыОперативногоУчета(Объект,ВидОЗ);
	
	Если НЕ ПОУ.ОперативныйУчет Тогда
		_УФК.ВывестиПредупреждение("Оперативный учёт по организации не ведётся.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеВидаДоговораТипуДокумента()
	
	Результат = Новый Соответствие;
	Результат.Вставить(Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет"), ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
	Результат.Вставить(Тип("ДокументСсылка.СписаниеСРасчетногоСчета"),   ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
	
	Возврат Результат;
	
КонецФункции
 

&НаКлиенте
Процедура ОбработкаПодбораСчетовДляОплаты(Ответ, ДополнительныеПараметры) Экспорт
	
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда
		
			ДокументОбъект = ДополнительныеПараметры.Форма.Объект;
			Результат = _ОбработатьРезультатПодбора(Ответ,ДокументОбъект);			
			Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
				_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Результат));
			Иначе
				ДополнительныеПараметры.Форма.Прочитать();
			КонецЕсли; 
			
		КонецЕсли; 
		
КонецПроцедуры
  

&НаСервере
Функция _ПараметрыОперативногоУчета(Объект,ВидОЗ)

	СтруктураНастроек = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Объект.Организация, ВидОЗ, Объект.Дата);

	ОперативныйУчет = СтруктураНастроек["ВедетсяОперативныйУчет"];
	ВводОстатковОЗ  = СтруктураНастроек["ВводОстатков"];
	
	Возврат Новый Структура("ОперативныйУчет,ВводОстатковОЗ", ОперативныйУчет, ВводОстатковОЗ);
	
КонецФункции

&НаСервере
Функция _ПараметрыФормыПодбора(Знач УИД,Объект)
	
		ПараметрыФормыПодбора = Новый Структура;
		ПараметрыФормыПодбора.Вставить("Дата", 			Объект.Дата);
		ПараметрыФормыПодбора.Вставить("Контрагент",	Объект.Контрагент);
		ПараметрыФормыПодбора.Вставить("Организация",	Объект.Организация);
		
		ВедущийДоговор 		= Неопределено;
		
		Договор				= ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка");
		ПриложениеКДоговору = ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка");
	
		Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
			//У нас только одна строка
			ДоговорКонтрагента = Объект.РасшифровкаПлатежа[0].ДоговорКонтрагента;
			
			Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	CW_ПриложенияКДоговорам.Ссылка КАК Ссылка,
				|	CW_ПриложенияКДоговорам.ВалютаДоговора КАК ВалютаДоговора
				|ИЗ
				|	Справочник.CW_ПриложенияКДоговорам КАК CW_ПриложенияКДоговорам
				|ГДЕ
				|	CW_ПриложенияКДоговорам.УчетныйДоговор = &УчетныйДоговор";
				
				Запрос.УстановитьПараметр("УчетныйДоговор", Объект.ДоговорКонтрагента);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				Если Выборка.Следующий() Тогда
					ВедущийДоговор = Выборка.Ссылка;
					ВалютаДоговора = Выборка.ВалютаДоговора;
					
					Договор 			= ВедущийДоговор.Договор;
					ПриложениеКДоговору = ВедущийДоговор;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ВедущийДоговор) Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
					|	CW_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка,
					|	CW_ДоговорыПоГрузоперевозкам.ВалютаДоговора КАК ВалютаДоговора
					|ИЗ
					|	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
					|ГДЕ
					|	CW_ДоговорыПоГрузоперевозкам.УчетныйДоговор = &УчетныйДоговор";
					
					Запрос.УстановитьПараметр("УчетныйДоговор", Объект.ДоговорКонтрагента);
					
					Результат = Запрос.Выполнить();
					Выборка = Результат.Выбрать();
					
					Если Выборка.Следующий() Тогда
						ВедущийДоговор = Выборка.Ссылка;
						ВалютаДоговора = Выборка.ВалютаДоговора;
						
						Договор 	   = Выборка.Ссылка;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ВедущийДоговор = Неопределено Тогда
					Возврат _УФКС.Ответ(1,"Выбранный договор не связан с договором по грузоперевозке");
				КонецЕсли;
			Конецесли;
			
		КонецЕсли;

		ПараметрыФормыПодбора.Вставить("Договор",				Договор);
		ПараметрыФормыПодбора.Вставить("ПриложениеКДоговору",	ПриложениеКДоговору);
		
		ПараметрыФормыПодбора.Вставить("Валюта", 				ВалютаДоговора);
		ПараметрыФормыПодбора.Вставить("Представление",			"№"+Объект.НомерВходящегоДокумента+" от "+Формат(Объект.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy"));
		ПараметрыФормыПодбора.Вставить("Дата",					Объект.Дата);
		
		// пробуем найти ведомый документ
		ВедомыйДокумент = ПредопределенноеЗначение("Документ.CW_Оплата.ПустаяСсылка");
		Если НЕ Объект.Ссылка.Пустая() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	CW_Оплата.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.CW_Оплата КАК CW_Оплата
			|ГДЕ
			|	CW_Оплата.Основание = &Основание";
			
			Запрос.УстановитьПараметр("основание", Объект.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка 		 = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				ВедомыйДокумент = Выборка.Ссылка;
			КонецЕсли; 
			
		КонецЕсли; 
		
		ПараметрыФормыПодбора.Вставить("ВедомыйДокумент",			ВедомыйДокумент);
		ПараметрыФормыПодбора.Вставить("ПлатежноеПоручение",		Объект.Ссылка);
		ПараметрыФормыПодбора.Вставить("АдресТаблицыОЗ", 			ПоместитьВоВременноеХранилище(Неопределено,УИД));
		ПараметрыФормыПодбора.Вставить("СуммаОплаты", 				Объект.СуммаДокумента);
		ПараметрыФормыПодбора.Вставить("ПодразделениеОрганизации",  Объект.ПодразделениеОрганизации);
		ПараметрыФормыПодбора.Вставить("СтатьяДДС", 				Объект.СтатьяДвиженияДенежныхСредств);
		ПараметрыФормыПодбора.Вставить("ВидОперации", 				Объект.ВидОперации);
		ПараметрыФормыПодбора.Вставить("ВалютаДокумента", 			Объект.ВалютаДокумента);
		
		Возврат ПараметрыФормыПодбора;
		
КонецФункции

&НаСервере
Функция _ОбработатьРезультатПодбора(Ответ,Объект)
	
	СП = ПолучитьИзВременногоХранилища(Ответ.АдресПараметровОплаты);
	_сф.ст_УстановитьСвойство(СП.Реквизиты,"Дата",Объект.Дата);
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для весрии КОРП
	
	ЭтоУСН = ПолчитьСистемуНалогообложения(Объект.Организация, Объект.Дата);
	
	Документ = Объект.Ссылка.ПолучитьОбъект();
	ИмяТабличнойЧасти = "РасшифровкаПлатежа";
	ТЧ = Документ[ИмяТабличнойЧасти];
	ТЧ.Очистить();
	Для каждого Стр Из СП.ТаблицаДокумента Цикл
		Нстр = ТЧ.Добавить();
		
		ЗаполнитьЗначенияСвойств(Нстр,Стр,,"СтавкаНДС,СуммаНДС");
		
		//Если ЭтоУСН Тогда
		//	Нстр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");	
		//	Нстр.СуммаНДС = 0;
		//Иначе
		Нстр.СтавкаНДС = Стр.СтавкаНДС;	
		Нстр.СуммаНДС = Стр.СуммаНДС;
		//КонецЕсли;
	КонецЦикла; 
	
	Если (ТЧ.Количество()=0) Тогда
		Нстр = ТЧ.Добавить();
	КонецЕсли; 
	
	Документ.СуммаДокумента = _сф.Итог(Документ[ИмяТабличнойЧасти],"СуммаПлатежа");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Договор", 			СП.Реквизиты.Договор);
	
	Если  СП.Свойство("ПриложениеКДоговору") Тогда
		СтруктураПараметров.Вставить("ПриложениеКДоговору",	СП.ПриложениеКДоговору);
	Иначе
		СтруктураПараметров.Вставить("ПриложениеКДоговору", ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка"));
	КонецЕсли;
	
	Документ.ДоговорКонтрагента = CW_Финансы.ПолучитьУчетныйДоговор(СтруктураПараметров);
	
	Документ.ОбменДанными.Загрузка = Истина;
	Документ.Записать();
	
	// находим ведомую оплату
	
	ВедомыйДокумент = СП.ВедомыйДокумент;
	Ведомый = Неопределено;
	
	Если (СП.ТаблицаПоОперативнойЗадолженности.Количество() <> 0) Тогда
		
		Если (ЗначениеЗаполнено(ВедомыйДокумент)) Тогда
			Ведомый = ВедомыйДокумент.ПолучитьОбъект();
			Ведомый.Дата 			= Объект.Дата;
			Ведомый.ПометкаУдаления = Ложь;
		Иначе
			Ведомый = Документы.CW_Оплата.СоздатьДокумент();
			Ведомый.Дата 		= Объект.Дата;
			Ведомый.Основание 	= Объект.Ссылка;
		КонецЕсли;
		
		//Подсистема.УчетПриложенийДоговоров
		Если  СП.Свойство("ПриложениеКДоговору") Тогда
			Ведомый.ПриложениеКДоговору = СП.ПриложениеКДоговору;
		КонецЕсли;
		//Подсистема.УчетПриложенийДоговоров
		
	Иначе
		Если (ЗначениеЗаполнено(ВедомыйДокумент)) Тогда
			
			// удаляем ведомый
			ВО = ВедомыйДокумент.ПолучитьОбъект();
			ВО.Оплата.Очистить();
			ВО.Записать();
		КонецЕсли; 
	КонецЕсли; 
	
	Если (Ведомый <> Неопределено) Тогда
		ЗаполнитьЗначенияСвойств(Ведомый,СП.Реквизиты);
		Ведомый.Оплата.Загрузить(СП.ТаблицаПоОперативнойЗадолженности);
		Ведомый.ОбменДанными.Загрузка = Истина;
		
		//Для версии КОРП
		Если ВестиУчетПоПодразделениям Тогда
			Ведомый.ПодразделениеОрганизации = Объект.ПодразделениеОрганизации;
		КонецЕсли;
		//Для версии КОРП
		
		
		Ведомый.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли; 
	
	Возврат(_УФКС.Ответ());
КонецФункции  

&НаСервере
Функция ПолчитьСистемуНалогообложения(Знач Организация, Знач ДатаСреза)  
	
	ДатаСреза = ?(Не ЗначениеЗаполнено(ДатаСреза), ТекущаяДата(), ДатаСреза);
	
	МассивУпрощенная = Новый Массив;
	МассивУпрощенная.Добавить(ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.АУСН"));
	МассивУпрощенная.Добавить(ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НастройкиСистемыНалогообложенияСрезПоследних.Организация КАК Организация,
	               |	НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	               |ИЗ
	               |	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК НастройкиСистемыНалогообложенияСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", 		ДатаСреза);
	Запрос.УстановитьПараметр("Организация", 	Организация);  
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		СистемаНалогообложения = Выборка.СистемаНалогообложения;
	КонецЕсли;
	
	Возврат МассивУпрощенная.Найти(СистемаНалогообложения) <> Неопределено;	
	
КонецФункции

