&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаПредупреждение.Видимость  				= Форма.CW_РегистрироватьСобытияОтправкиПисемКлиентам 
															И НЕ ЗначениеЗаполнено(Форма.CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия)
															И Форма.CW_ИспользованиеCRM;
															
	Элементы.CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия.Доступность  		= Форма.CW_РегистрироватьСобытияОтправкиПисемКлиентам;
	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначенияРеквизитовФормы(Форма)
	
	Форма.CW_ИспользованиеCRM 								= Константы.CW_ИспользованиеCRM.Получить();
	Форма.CW_РегистрироватьСобытияОтправкиПисемКлиентам		= Константы.CW_РегистрироватьСобытияОтправкиПисемКлиентам.Получить();
	Форма.CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия	= Константы.CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия.Получить();
	
КонецПроцедуры


&НаКлиенте
Процедура CW_РегистрироватьСобытияОтправкиПисемКлиентамПриИзменении(Элемент)
	
	НаборКонстант.CW_РегистрироватьСобытияОтправкиПисемКлиентам =  CW_РегистрироватьСобытияОтправкиПисемКлиентам;
	ИзмененныеКонстанты = РегистрироватьСобытияОтправкиПисемКлиентамНаСервере();
	
	УправлениеФормой(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РегистрироватьСобытияОтправкиПисемКлиентамНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_РегистрироватьСобытияОтправкиПисемКлиентам");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	 
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаКлиенте
Процедура CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытияПриИзменении(Элемент)
	
	НаборКонстант.CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия =  CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия;
	ИзмененныеКонстанты = РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытияНаСервере();
	
	УправлениеФормой(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытияНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	 
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции


&НаКлиенте
Процедура ПриИзмененииРеквизитаФормы(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры


