
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = (НЕ CW_ПраваДоступа.ПравоДоступно("ПросмотрИсторииРедактирования"));
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если Параметры.Свойство("Заголовок") Тогда
		
		ЭтаФорма.Заголовок = Параметры.Заголовок+" (история)";
		
	КонецЕсли; 
    //Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти