&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.Период = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ТипЗнч(ПараметрыЗаписи)= Тип("Структура") 
		и ПараметрыЗаписи.Свойство("ЗакрытьФорму") Тогда
		Если ПараметрыЗаписи.ЗакрытьФорму Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзмененРаздельныйУчет и Не ПродолжитьЗапись Тогда
		
		Если ПроверитьНаличиеДокументовНаСервере(Запись.Организация, Запись.ВидОперативнойЗадолженности, Запись.Период) Тогда
			Отказ = истина;
			
			Если Запись.РаздельныйУчетОперативнойИБухгалтерскойЗадолженности Тогда
				
				Режим = РежимДиалогаВопрос.ДаНет;
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУстановкеПередЗаписью", ЭтотОбъект, ПараметрыЗаписи);
				ПоказатьВопрос(Оповещение, "Документы ""Оплата"" связанные с банковскими выписками по виду задолженности "+Строка(Запись.ВидОперативнойЗадолженности)+"
				|будут помечены на удаление. Продолжить?", Режим, 0);
				
			Иначе
				
				Режим = РежимДиалогаВопрос.ДаНет;
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОСнятииФлагаПередЗаписью", ЭтотОбъект, ПараметрыЗаписи);
				ПоказатьВопрос(Оповещение, "После снятия флага необходимо банковские выписки дополнить документами ""Оплата"". Продолжить?", Режим, 0);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаздельныйУчетОперативнойИБухгалтерскойЗадолженностиПриИзменении(Элемент)
	ИзмененРаздельныйУчет = Истина; 
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда) 
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ЗакрытьФорму", Истина);

	ЭтаФорма.Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНаличиеДокументовНаСервере(Знач Организация, Знач ВидОперативнойЗадолженности, Знач Период)
	
	Если ВидОперативнойЗадолженности = ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.ПустаяСсылка") Тогда
		Возврат ложь;
	КонецЕсли;
	
	Если ВидОперативнойЗадолженности =  ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская") Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CW_Оплата.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CW_Оплата КАК CW_Оплата
		|		ПО СписаниеСРасчетногоСчета.Ссылка = CW_Оплата.Основание
		|ГДЕ
		|	СписаниеСРасчетногоСчета.Организация = &Организация
		|	И СписаниеСРасчетногоСчета.Дата >= &ДатаНачала
		|	И СписаниеСРасчетногоСчета.ПометкаУдаления = ЛОЖЬ";
		
	КонецЕсли;
	
	Если ВидОперативнойЗадолженности =  ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская") Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	CW_Оплата.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CW_Оплата КАК CW_Оплата
		|		ПО ПоступлениеНаРасчетныйСчет.Ссылка = CW_Оплата.Основание
		|ГДЕ
		|	ПоступлениеНаРасчетныйСчет.Организация = &Организация
		|	И ПоступлениеНаРасчетныйСчет.Дата >= &ДатаНачала
		|	И ПоступлениеНаРасчетныйСчет.ПометкаУдаления = ЛОЖЬ";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаНачала", 	Период);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаОСнятииФлагаПередЗаписью(Результат, ПараметрыЗаписи) Экспорт
	
	ПродолжитьЗапись = Истина;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Запись.РаздельныйУчетОперативнойИБухгалтерскойЗадолженности = Истина;
	КонецЕсли;
	
	ЭтаФорма.Записать(ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУстановкеПередЗаписью(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Запись.РаздельныйУчетОперативнойИБухгалтерскойЗадолженности = Ложь;
		ПродолжитьЗапись = Истина;
		ЭтаФорма.Записать(ПараметрыЗаписи);
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ОбработатьДокументыОплатВФонеНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатУдаленияДокументов", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ОбработатьДокументыОплатВФонеНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Пометка на удаление документов ""Оплата""";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Период", 						Запись.Период);
	ПараметрыПроцедуры.Вставить("Организация", 					Запись.Организация);
	ПараметрыПроцедуры.Вставить("ВидОперативнойЗадолженности", 	Запись.ВидОперативнойЗадолженности);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.CW_НастройкиУчетаОперативнойЗадолженности.ОбработатьКассовыеДокументы",ПараметрыПроцедуры, ПараметрыВыполнения);
	                           
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатУдаленияДокументов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		Результат = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата); 
		ПродолжитьЗапись = Истина;
		ЭтаФорма.Записать();
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Документы не сформированы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка пометки на удаление документов");
	КонецЕсли;
	
КонецПроцедуры




