
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресСписка", 		АдресСписка);
	Параметры.Свойство("ОтборКонтрагент", 	ОтборКонтрагент);
	
	ОтборКонтрагентИспользуется = ЗначениеЗаполнено(ОтборКонтрагент);
		
	Если ЭтоАдресВременногоХранилища(АдресСписка) Тогда
		мАдреса = ПолучитьИзВременногоХранилища(АдресСписка);
		Для Каждого АдресВМассиве из мАдреса Цикл
			НоваяСтрока = ТаблицаАдресов.Добавить();
			НоваяСтрока.Адрес = АдресВМассиве; 
		КонецЦикла;
	КонецЕсли;
	
	ПодборИзКонтактов = ПолучитьФункциональнуюОпцию("CW_ИспользованиеCRM");
	ЗаполнитьДеревоКонтактнойИнформации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ЗаполнитьДеревоКонтактнойИнформации();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоКонтактнойИнформации()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ВидыКИ
	               |ИЗ
	               |	Справочник.CW_ВидыКонтактнойИнформации КАК CW_ВидыКонтактнойИнформации
	               |ГДЕ
	               |	CW_ВидыКонтактнойИнформации.ТипКИ.Действие = Значение(Перечисление.CW_ДействияДляТиповКонтактнойИнформации.НаписатьПисьмо)";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОрганизацииКонтактнаяИнформация.Ссылка КАК Ссылка,
	               |	ОрганизацииКонтактнаяИнформация.Представление КАК АдресЭлектроннойПочты,
	               |	НЕОПРЕДЕЛЕНО КАК ОбъектВладелец,
	               |	ПРЕДСТАВЛЕНИЕ(ОрганизацииКонтактнаяИнформация.Ссылка) КАК ПредставлениеСсылки,
	               |	"""" КАК ПредставлениеДопСсылки,
	               |	""Организации"" КАК ВидОбъекта,
	               |	1 КАК Порядок
	               |ИЗ
	               |	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	               |ГДЕ
	               |	ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |	//УсловиеКонтрагентЛожь
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтрагентыКонтактнаяИнформация.Ссылка,
	               |	КонтрагентыКонтактнаяИнформация.Представление,
	               |	НЕОПРЕДЕЛЕНО,
	               |	ПРЕДСТАВЛЕНИЕ(КонтрагентыКонтактнаяИнформация.Ссылка),
	               |	"""",
	               |	""Контрагенты"",
	               |	2
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |	//УсловиеКонтрагент_Контрагенты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтактныеЛицаКонтактнаяИнформация.Ссылка,
	               |	КонтактныеЛицаКонтактнаяИнформация.Представление,
	               |	КонтактныеЛицаКонтактнаяИнформация.Ссылка.ОбъектВладелец,
	               |	ПРЕДСТАВЛЕНИЕ(КонтактныеЛицаКонтактнаяИнформация.Ссылка.ОбъектВладелец),
	               |	ПРЕДСТАВЛЕНИЕ(КонтактныеЛицаКонтактнаяИнформация.Ссылка),
	               |	""Контактные лица"",
	               |	3
	               |ИЗ
	               |	Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	               |ГДЕ
	               |	КонтактныеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |	//УсловиеКонтрагент_КонтактныеЛица
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПользователиКонтактнаяИнформация.Ссылка,
	               |	ПользователиКонтактнаяИнформация.Представление,
	               |	НЕОПРЕДЕЛЕНО,
	               |	ПРЕДСТАВЛЕНИЕ(ПользователиКонтактнаяИнформация.Ссылка),
	               |	"""",
	               |	""Пользователи"",
	               |	4
	               |ИЗ
	               |	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	               |ГДЕ
	               |	ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |	//УсловиеКонтрагентЛожь
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка,
	               |	ФизическиеЛицаКонтактнаяИнформация.Представление,
	               |	НЕОПРЕДЕЛЕНО,
	               |	ПРЕДСТАВЛЕНИЕ(ФизическиеЛицаКонтактнаяИнформация.Ссылка),
	               |	"""",
	               |	""Физические лица"",
	               |	5
	               |ИЗ
	               |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	               |ГДЕ
	               |	ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |	//УсловиеКонтрагентЛожь
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	CW_КонтактнаяИнформация.Владелец,
	               |	CW_КонтактнаяИнформация.Наименование,
	               |	НЕОПРЕДЕЛЕНО,
	               |	ПРЕДСТАВЛЕНИЕ(CW_КонтактнаяИнформация.Владелец),
	               |	"""",
	               |	""Контактная информация (CRM)"",
	               |	6
	               |ИЗ
	               |	Справочник.CW_КонтактнаяИнформация КАК CW_КонтактнаяИнформация
	               |ГДЕ
	               |	CW_КонтактнаяИнформация.ВидКИ В
	               |			(ВЫБРАТЬ
	               |				ВТ_ВидыКИ.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_ВидыКИ КАК ВТ_ВидыКИ)
	               |	И &ПодборИзКонтактов = ИСТИНА
	               |	//УсловиеКонтрагент_CW_КонтактнаяИнформация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок
	               |ИТОГИ ПО
	               |	ВидОбъекта";
	
	Запрос.УстановитьПараметр("ПодборИзКонтактов", ПодборИзКонтактов);
	
	Если ОтборКонтрагентИспользуется Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеКонтрагент_CW_КонтактнаяИнформация", 	"И (CW_КонтактнаяИнформация.Владелец = &Контрагент
																								|			ИЛИ CW_КонтактнаяИнформация.Владелец.Владелец = &Контрагент)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеКонтрагент_КонтактныеЛица", 	"И КонтактныеЛицаКонтактнаяИнформация.Ссылка.ОбъектВладелец = &Контрагент");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеКонтрагент_Контрагенты", 		"И КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеКонтрагентЛожь", 				"И ЛОЖЬ");
		
		Запрос.УстановитьПараметр("Контрагент", ОтборКонтрагент);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЭлементыДерева = КонтактнаяИнформация.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();
	
	ВыборкаВидыОбъектов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидыОбъектов.Следующий() Цикл
		
		ГруппаДерева = ЭлементыДерева.Добавить(); 
		ГруппаДерева.Представление          = ВыборкаВидыОбъектов.ВидОбъекта;
		ГруппаДерева.ЭтоГруппа              = Истина;
		ГруппаДерева.ИндексКартинки         = 0;
		
		ЭлементыГруппыДерева = ГруппаДерева.ПолучитьЭлементы();
		
		ВыборкаДетали = ВыборкаВидыОбъектов.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			СтрокаДерева = ЭлементыГруппыДерева.Добавить(); 
			СтрокаДерева.Представление          = ВыборкаДетали.ПредставлениеСсылки + ?(ЗначениеЗаполнено(ВыборкаДетали.ПредставлениеДопСсылки)," ("+ВыборкаДетали.ПредставлениеДопСсылки+")","");
			СтрокаДерева.АдресЭлектроннойПочты 	= ВыборкаДетали.АдресЭлектроннойПочты;
			
			СтрокаДерева.Ссылка   				= ВыборкаДетали.Ссылка;
			СтрокаДерева.ЭтоГруппа              = Ложь;
			СтрокаДерева.ИндексКартинки         = 8;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура КонтактнаяИнформацияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыполнитьВыборАдреса();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыборАдреса()
	
	ВыделенныеСтроки = Элементы.КонтактнаяИнформация.ВыделенныеСтроки;
	
	ДобавитьСтрокиАдресатовНаСервере(ВыделенныеСтроки);
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьСтрокиАдресатовНаСервере(ВыделенныеСтроки)
	
	Для Каждого ИдентифкаторСтроки из ВыделенныеСтроки Цикл
		
		СтрокаДерева = КонтактнаяИнформация.НайтиПоИдентификатору(ИдентифкаторСтроки);
		Если СтрокаДерева.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Адрес",СокрЛП(СтрокаДерева.АдресЭлектроннойПочты));
		
		мСтроки = ТаблицаАдресов.НайтиСтроки(Отбор);
		
		Если мСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаАдресов.Добавить();
			НоваяСтрока.Адрес = СокрЛП(СтрокаДерева.АдресЭлектроннойПочты); 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписокВыбранных(Команда)
	
	Если ТаблицаАдресов.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Список выбранных адресов будет очищен. Продолжить?", Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ТаблицаАдресов.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Адресаты = ПолучитьСтрокуАдресатовНаСервере();
	ЭтаФорма.Закрыть(Адресаты);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуАдресатовНаСервере()
	
	мАдреса = ТаблицаАдресов.Выгрузить().ВыгрузитьКолонку("Адрес");
	тАдреса = СтрСоединить(мАдреса, ";");
	
	Возврат ПоместитьВоВременноеХранилище(тАдреса, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ТаблицаАдресовПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	МассивИдентификатров = Новый Массив;
	Для Каждого СтрокаТаблицы из ПараметрыПеретаскивания.Значение Цикл
		МассивИдентификатров.Добавить(СтрокаТаблицы.ПолучитьИдентификатор());
	КонецЦикла;
	
	ДобавитьСтрокиАдресатовНаСервере(МассивИдентификатров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентОчистка(Элемент, СтандартнаяОбработка)
	ОтборКонтрагентИспользуется 	= ЗначениеЗаполнено(ОтборКонтрагент);
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	ОтборКонтрагентИспользуется 	= ЗначениеЗаполнено(ОтборКонтрагент);
КонецПроцедуры
