
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр = (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеНастроекМониторинга"));
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПросмотрПриИзменении(Элемент)
	
	Если (НЕ Запись.Просмотр) Тогда
		
		Запись.Редактирование = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеПриИзменении(Элемент)
	
	Если (Запись.Редактирование) Тогда
		
		Запись.Просмотр = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры


