///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

&НаКлиенте
Перем ТекущийКонтекст;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
		ВызватьИсключение НСтр("ru = 'Текущий режим работы не поддерживается.'");
	КонецЕсли;
	
	Фильтр = Параметры.Исправления;
	
	Если ОбщегоНазначения.ЭтоВебКлиент()
		Или ОбщегоНазначения.РазделениеВключено()
		Или ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ()
		Или Не ОбщегоНазначения.ЭтоWindowsКлиент() Тогда
		Элементы.ФормаУстановитьИсправление.Видимость = Ложь;
		Элементы.ФормаУдалитьИсправление.Видимость    = Ложь;
		Элементы.ГруппаИнформация.Видимость           = Ложь;
	КонецЕсли;
	
	ОбновитьСписокИсправлений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияЖурналРегистрацииНажатие(Элемент)
	МассивСобытий = Новый Массив;
	МассивСобытий.Добавить(НСтр("ru = 'Исправления. Установка'"));
	МассивСобытий.Добавить(НСтр("ru = 'Исправления. Изменение'"));
	МассивСобытий.Добавить(НСтр("ru = 'Исправления. Удаление'"));
	Отбор = Новый Структура("СобытиеЖурналаРегистрации", МассивСобытий);
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(Отбор);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУстановленныеИсправления

&НаКлиенте
Процедура УстановленныеИсправленияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	УдалитьРасширения(Элемент.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеИсправленияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ПроверитьПрименимостьФайловОбновления", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Ключ", "ПередВыборомФайлаОбновления");
	ОткрытьФорму("ОбщаяФорма.ПредупреждениеБезопасности", ПараметрыФормы, , , , , Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПрименимостьФайловОбновления(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> "Продолжить" Тогда
		Возврат;
	КонецЕсли;

	ОбработчикЗавершения = Новый ОписаниеОповещения("ОбработатьЗагрузкуИсправления", ЭтотОбъект);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.Интерактивно	= Истина;
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОбработчикЗавершения, ПараметрыЗагрузки,"*.cfe;*.zip"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗагрузкуИсправления(Патч, Параметры) Экспорт
	
	Если Патч = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Чтение исправления из архива.
	Если ТипЗнч(Патч) <> Тип("Строка") Тогда
		Если СтрЗаканчиваетсяНа(Патч.Имя, ".zip") Тогда 
			ИсправлениеИзАрхива = CW_ИсправленияКонфигурации.ИзвлечьИсправлениеИзАрхива(Патч.Хранение, Истина, ложь);
			ИмяИсправления 		= ИсправлениеИзАрхива.ИмяПатча;
			Если ЗначениеЗаполнено(ИсправлениеИзАрхива.ТекстОшибки) Тогда
				ВызватьИсключение ИсправлениеИзАрхива.ТекстОшибки;
			КонецЕсли;
			Данные = ИсправлениеИзАрхива.Данные;
		Иначе 
			Данные 	= ПолучитьИзВременногоХранилища(Патч.Хранение); 
			ПатчИмя = CW_ИсправленияКонфигурации.ПолучитьИмяФайлаИзПути(Патч.Имя);
			ИмяИсправления = СтрЗаменить(ПатчИмя,".cfe","");   

			ИсправлениеИзАрхива = Новый Структура;
			ИсправлениеИзАрхива.Вставить("ИмяИсправления", 		ИмяИсправления);
			ИсправлениеИзАрхива.Вставить("ОписаниеРасширения", 	"");
			
		КонецЕсли;
	Иначе
		ИсправлениеИзАрхива = CW_ИсправленияКонфигурации.ИзвлечьИсправлениеИзАрхива(Патч, Истина, Ложь);
		ИмяИсправления 		= ИсправлениеИзАрхива.ИмяПатча;
		Если ЗначениеЗаполнено(ИсправлениеИзАрхива.ТекстОшибки) Тогда
			ВызватьИсключение ИсправлениеИзАрхива.ТекстОшибки;
		КонецЕсли;
		Данные = ИсправлениеИзАрхива.Данные;
	КонецЕсли;
	
	Если РасширениеУстановлено(СтрЗаменить(ИмяИсправления,".cfe",""))  Тогда
		ВызватьИсключение НСтр("ru = 'Выбранное исправление уже установлено.'");
	КонецЕсли;
	
	ОбработатьЗагрузкуРасширенияНаСервере(Данные);
	
	ДобавитьРасширениеВСписокИсправлений(ИсправлениеИзАрхива);	
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьЗагрузкуРасширенияНаСервере(ДвоичныеДанные)
	
	Расширение = РасширенияКонфигурации.Создать();
	Справочники.ВерсииРасширений.ОтключитьПредупрежденияБезопасности(Расширение);
	Справочники.ВерсииРасширений.ОтключитьИспользованиеОсновныхРолейДляВсехПользователей(Расширение);
	Расширение.БезопасныйРежим = Ложь;
	Расширение.ИспользуетсяВРаспределеннойИнформационнойБазе = Истина;
	Расширение.Записать(ДвоичныеДанные);
	
	УстановленноеИсправление = РасширениеПоИдентификатору(Расширение.УникальныйИдентификатор);
	Если НЕ CW_ИсправленияКонфигурации.ЭтоИсправление(УстановленноеИсправление) 
		И НЕ CW_ИсправленияКонфигурации.ЭтоДополнение(УстановленноеИсправление) Тогда
		Расширение.Удалить();
		ВызватьИсключение НСтр("ru = 'Расширение не является патчем или дополнением к конфигурации!'");
	КонецЕсли;
	
КонецПроцедуры

&наСервере
Функция РасширениеПоИдентификатору(Идентификатор)
	УстановитьПривилегированныйРежим(Истина);
	Отбор = Новый Структура;
	Отбор.Вставить("УникальныйИдентификатор", Идентификатор);
	Возврат РасширенияКонфигурации.Получить(Отбор)[0];
КонецФункции

&НаСервере
Функция РасширениеУстановлено(ИмяРасширения) 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Имя", ИмяРасширения);
	
	УстановитьПривилегированныйРежим(Истина);
	мРасширения = РасширенияКонфигурации.Получить(Отбор);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если мРасширения.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьКак(Команда)
	
	ВыделенныеСтроки = Элементы.УстановленныеИсправления.ВыделенныеСтроки;
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьКакЗавершение", ЭтотОбъект, ВыделенныеСтроки);
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли ВыделенныеСтроки.Количество() = 1 Тогда
		СохраняемыеФайлы = СохранитьНаСервере(ВыделенныеСтроки);
	Иначе
		Заголовок = НСтр("ru = 'Выберите каталог для сохранения исправлений конфигурации'");
		ФайловаяСистемаКлиент.ВыбратьКаталог(ОписаниеОповещения, Заголовок);
		Возврат;
	КонецЕсли;
	
	Если СохраняемыеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Диалог.Заголовок = НСтр("ru = 'Выберите файл для сохранения исправления конфигурации'");
	ПараметрыСохранения.Диалог.Фильтр    = НСтр("ru = 'Файлы исправлений конфигурации (*.cfe)|*.cfe|Все файлы (*.*)|*.*'");
	
	ФайловаяСистемаКлиент.СохранитьФайлы(Неопределено, СохраняемыеФайлы, ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОписание(Команда)
	
	ТекущиеДанные = Элементы.УстановленныеИсправления.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,"Для просмотра описания необходимо выбрать стрку исправдения!",60);
		Возврат;
	КонецЕсли;
	
	ПараметрыОписания = Новый Структура;
	ПараметрыОписания.Вставить("ИмяИсправления",		СокрЛП(ТекущиеДанные.Имя));
	ПараметрыОписания.Вставить("ТекстОписанияСтрока",	СокрЛП(ТекущиеДанные.Описание));

	ОткрытьФорму("ОбщаяФорма.CW_ФормаОписанияИсправлений",ПараметрыОписания,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьРасширениеВСписокИсправлений(ИсправлениеИзАрхива)    
	
	УстановитьПривилегированныйРежим(Истина);
	Расширения = РасширенияКонфигурации.Получить(Новый Структура("Имя",ИсправлениеИзАрхива.ИмяИсправления));
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого Расширение Из Расширения Цикл
		
		Если Не CW_ИсправленияКонфигурации.ЭтоИсправление(Расширение) 
					и Не CW_ИсправленияКонфигурации.ЭтоДополнение(Расширение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Фильтр <> Неопределено И Фильтр.НайтиПоЗначению(Расширение.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваИсправления = CW_ИсправленияКонфигурации.СвойстваИсправления(ИсправлениеИзАрхива.ИмяИсправления);
		
		НоваяСтрока 						= УстановленныеИсправления.Добавить();
		НоваяСтрока.Имя 					= Расширение.Имя;
		НоваяСтрока.КонтрольнаяСумма 		= Base64Строка(Расширение.ХешСумма);
		НоваяСтрока.ИдентификаторРасширения = Расширение.УникальныйИдентификатор;
		НоваяСтрока.Версия 					= Расширение.Версия;
		НоваяСтрока.Активно					= Расширение.Активно;
		НоваяСтрока.БезопасныйРежим			= Расширение.БезопасныйРежим; 
		НоваяСтрока.ВидРасширения			= СокрЛП(Расширение.Назначение); 
		
		Если ТипЗнч(СвойстваИсправления) = Тип("Структура") Тогда
			СвойстваИсправления.Свойство("Description", НоваяСтрока.Описание);
			НоваяСтрока.Статус		= 0;
		Иначе
			НоваяСтрока.Статус 		= 1;
			НоваяСтрока.Описание 	= ИсправлениеИзАрхива.ОписаниеРасширения;      
			НоваяСтрока.Версия 		= ИсправлениеИзАрхива.Версия;      
		КонецЕсли;  
		
		Если Не РасширениеПрименимо(Расширение, НоваяСтрока) Тогда
			НоваяСтрока.Статус 		= 2;
			НоваяСтрока.ВопросОшибки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.CW_Вопрос, Новый УникальныйИдентификатор);
		КонецЕсли;
		
		Если ПустаяСтрока(СокрЛП(НоваяСтрока.Описание)) Тогда
			НоваяСтрока.Описание = "<Описание расширения отсутствует>";         
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры      


&НаСервере    
Функция РасширениеПрименимо(Расширение, НоваяСтрока)
	
	ПроблемыПрименимости = Расширение.ПроверитьВозможностьПрименения();
	Если ПроблемыПрименимости.Количество() > 0 Тогда 
		
		Массив = новый Массив;
		Для Каждого Пробелма Из ПроблемыПрименимости Цикл
			Массив.Добавить(Пробелма.Описание);	
		КонецЦикла;
		
		НоваяСтрока.ОписаниеОшибки = СтрСоединить(Массив, Символы.ПС);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


&НаСервере
Процедура ОбновитьСписокИсправлений()    
	
	УстановленныеИсправления.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	Расширения = РасширенияКонфигурации.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого Расширение Из Расширения Цикл
		
		Если Не CW_ИсправленияКонфигурации.ЭтоИсправление(Расширение) 
					и Не CW_ИсправленияКонфигурации.ЭтоДополнение(Расширение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Фильтр <> Неопределено И Фильтр.НайтиПоЗначению(Расширение.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваИсправления = CW_ИсправленияКонфигурации.СвойстваИсправления(Расширение.Имя);
		
		НоваяСтрока 						= УстановленныеИсправления.Добавить();
		НоваяСтрока.Имя 					= Расширение.Имя;
		НоваяСтрока.КонтрольнаяСумма 		= Base64Строка(Расширение.ХешСумма);
		НоваяСтрока.ИдентификаторРасширения = Расширение.УникальныйИдентификатор;
		НоваяСтрока.Версия 					= Расширение.Версия;
		НоваяСтрока.Активно					= Расширение.Активно;
		НоваяСтрока.БезопасныйРежим			= Расширение.БезопасныйРежим; 
		НоваяСтрока.ВидРасширения			= СокрЛП(Расширение.Назначение); 
			
		Если ТипЗнч(СвойстваИсправления) = Тип("Структура") Тогда
			СвойстваИсправления.Свойство("Description", НоваяСтрока.Описание);
			НоваяСтрока.Статус		= 0;
		Иначе
			НоваяСтрока.Статус 		= 1;
		КонецЕсли;  
		
		Если Не РасширениеПрименимо(Расширение, НоваяСтрока) Тогда
			НоваяСтрока.Статус 		= 2;
			НоваяСтрока.ВопросОшибки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.CW_Вопрос, Новый УникальныйИдентификатор);
		КонецЕсли;
		
		Если ПустаяСтрока(СокрЛП(НоваяСтрока.Описание)) Тогда
			НоваяСтрока.Описание = "<Описание расширения отсутствует>";         
		КонецЕсли;

		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРасширения(ВыделенныеСтроки)
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторыРасширений = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		СтрокаИсправления = УстановленныеИсправления.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИдентификаторыРасширений.Добавить(СтрокаИсправления.ИдентификаторРасширения);
	КонецЦикла;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ИдентификаторыРасширений", 	ИдентификаторыРасширений);
	Контекст.Вставить("ВыделенныеСтроки", 			ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("УдалитьРасширениеПослеПодтверждения", ЭтотОбъект, Контекст);
	Если ИдентификаторыРасширений.Количество() > 1 Тогда
		ТекстВопроса = НСтр("ru = 'Удалить выделенные исправления?'", "ru");
	Иначе
		ТекстВопроса = НСтр("ru = 'Удалить исправление?'", "ru");
	КонецЕсли;
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРасширениеПослеПодтверждения(Результат, Контекст) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Обработчик = Новый ОписаниеОповещения("УдалитьРасширениеПродолжение", ЭтотОбъект, Контекст);
		
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПрофилиБезопасности") Тогда
			Запросы = ЗапросыНаОтменуРазрешенийИспользованияВнешнегоМодуля(Контекст.ИдентификаторыРасширений);
			МодульРаботаВБезопасномРежимеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаВБезопасномРежимеКлиент");
			МодульРаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(Запросы, ЭтотОбъект, Обработчик);
		Иначе
			ВыполнитьОбработкуОповещения(Обработчик, КодВозвратаДиалога.ОК);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРасширениеПродолжение(Результат, Контекст) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ТекущийКонтекст = Контекст;
		ПодключитьОбработчикОжидания("УдалитьРасширениеЗавершение", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРасширениеЗавершение()
	
	Контекст = ТекущийКонтекст;
	
	Попытка
		УдалитьРасширенияНаСервере(Контекст);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПоказатьПредупреждение(, КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьРасширенияНаСервере(Контекст)
	
	ТекстОшибки = "";
	Справочники.ВерсииРасширений.УдалитьРасширения(Контекст.ИдентификаторыРасширений, ТекстОшибки);
	
	Если ТекстОшибки <> "" Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;         
	
	Для Каждого ВыделеннаяСтрока из Контекст.ВыделенныеСтроки Цикл
		СтрокаТаблицы = УстановленныеИсправления.НайтиПоИдентификатору(ВыделеннаяСтрока);
		УстановленныеИсправления.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗапросыНаОтменуРазрешенийИспользованияВнешнегоМодуля(ИдентификаторыРасширений)
	
	Возврат Справочники.ВерсииРасширений.ЗапросыНаОтменуРазрешенийИспользованияВнешнегоМодуля(ИдентификаторыРасширений);
	
КонецФункции

&НаКлиенте
Процедура СохранитьКакЗавершение(ПутьККаталогу, ВыделенныеСтроки) Экспорт
	
	СохраняемыеФайлы = СохранитьНаСервере(ВыделенныеСтроки, ПутьККаталогу);
	
	Если СохраняемыеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Интерактивно     = Ложь;
	
	ФайловаяСистемаКлиент.СохранитьФайлы(Неопределено, СохраняемыеФайлы, ПараметрыСохранения);
	
КонецПроцедуры

&НаСервере
Функция СохранитьНаСервере(ИдентификаторыСтрок, ПутьККаталогу = "")
	
	СохраняемыеФайлы = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ИдентификаторыСтрок Цикл
		СтрокаСписка = УстановленныеИсправления.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИдентификаторРасширения = СтрокаСписка.ИдентификаторРасширения;
		Расширение = НайтиРасширение(ИдентификаторРасширения);
	
		Если Расширение <> Неопределено Тогда
			Если ЗначениеЗаполнено(ПутьККаталогу) Тогда
				Префикс = ПутьККаталогу + ПолучитьРазделительПути();
			Иначе
				Префикс = "";
			КонецЕсли;
			Имя = Префикс + Расширение.Имя + "_" + Расширение.Версия + ".cfe";
			Хранение = ПоместитьВоВременноеХранилище(Расширение.ПолучитьДанные(), ЭтотОбъект.УникальныйИдентификатор);
			ОписаниеПередаваемогоФайла = Новый ОписаниеПередаваемогоФайла(Имя, Хранение);
			СохраняемыеФайлы.Добавить(ОписаниеПередаваемогоФайла);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СохраняемыеФайлы;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиРасширение(ИдентификаторРасширения)
	
	Возврат Справочники.ВерсииРасширений.НайтиРасширение(ИдентификаторРасширения);
	
КонецФункции

#КонецОбласти  

&НаКлиенте
Процедура УстановленныеИсправленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.ГиперссылкаЯчейки Тогда
		ТекущиеДанные = Элементы.УстановленныеИсправления.ТекущиеДанные;
		ТекстОшибки = ТекущиеДанные.ОписаниеОшибки;
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьПоказОшибки", ЭтотОбъект);
		ПоказатьВводСтроки(ОписаниеОповещения, ТекстОшибки,,,Истина);
	КонецЕсли;

КонецПроцедуры      

&НаКлиенте
Процедура ЗавершитьПоказОшибки(Результат, ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры