
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураПараметров = ПолучитьПараметрыКоманд(ПараметрКоманды);

	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("ВнешнийВызов"	, Истина);
	ПараметрыФормы.Вставить("НачалоПериода" , СтруктураПараметров.ДатаНачала);
	ПараметрыФормы.Вставить("КонецПериода"	, СтруктураПараметров.ДатаОкончания);
	
	Если ЗначениеЗаполнено(Структурапараметров.Организация) тогда
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация", СтруктураПараметров.Организация));
	КонецЕсли;
	
	ОткрытьФорму("Отчет.CW_АнализРаспределенияЗатратПоПутевымЛистам.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыКоманд(ПараметрКоманды)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаНачала"		, ПараметрКоманды.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончания"	, ПараметрКоманды.ДатаОкончания);
	СтруктураПараметров.Вставить("Организация"		, ПараметрКоманды.Организация);
	
	Возврат СтруктураПараметров	
	
КонецФункции