
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Ключ.Пустая() Тогда
		Элементы.ВидТС.Доступность 								= НЕ Объект.Предопределенный;
		Элементы.НаличиеКузоваИлиЦистерны.Доступность 			= НЕ Объект.Предопределенный;
		Элементы.НаличиеРефрижираторнойУстанвоки.Доступность 	= НЕ Объект.Предопределенный;
	КонецЕсли;
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти