#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыФормы = Новый Структура;
	
	УчетПоОрганизациям = УчетПоОрганизациям();
	
	Если УчетПоОрганизациям.ВестиУчетПоОрганизациям Тогда
		
		ПараметрыФормы.Вставить("Заголовок", "Организация");
		ПараметрыОткрытия.ИмяФормы = "Справочник.Организации.ФормаСписка";
		ПараметрыОткрытия.ЗамерПроизводительности = "ПростойИнтерфейсОрганизацииФормаСписка";
		
	Иначе
		
		Если ЗначениеЗаполнено(УчетПоОрганизациям.ОсновнаяОрганизация) Тогда
			ПараметрыФормы.Вставить("Ключ", УчетПоОрганизациям.ОсновнаяОрганизация);
		КонецЕсли;
		ПараметрыОткрытия.ИмяФормы = "Справочник.Организации.ФормаОбъекта";
		ПараметрыОткрытия.ЗамерПроизводительности = "ПростойИнтерфейсОрганизацииФормаОбъекта";
		
	КонецЕсли;
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УчетПоОрганизациям()
	
	Результат = Новый Структура("ВестиУчетПоОрганизациям, ОсновнаяОрганизация");
	Результат.ВестиУчетПоОрганизациям = ПолучитьФункциональнуюОпцию("ВестиУчетПоОрганизациям");
	Если Не Результат.ВестиУчетПоОрганизациям Тогда
		Результат.ОсновнаяОрганизация = ОбщегоНазначенияБПВызовСервера.ОсновнаяОрганизация();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
