#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УдалитьЗаписьПользователя(ВебПрофиль, Пользователь) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.CW_ДоступныеПользователи.СоздатьМенеджерЗаписи();	
	ЗаписьРегистра.ВебПрофиль = ВебПрофиль;
	ЗаписьРегистра.Пользователь = Пользователь;
	ЗаписьРегистра.Прочитать();
	
	Если ЗаписьРегистра.Выбран() Тогда
		ЗаписьРегистра.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьПользователейПрофиля(Профиль, мПользователиПрофиля) Экспорт
	
	НаборЗаписей = РегистрыСведений.CW_ДоступныеПользователи.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВебПрофиль.Установить(Профиль);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого Пользователь из  мПользователиПрофиля Цикл
		НоваяСтрока =  НаборЗаписей.Добавить();
		НоваяСтрока.ВебПрофиль = Профиль;
		НоваяСтрока.Пользователь = Пользователь;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

//Служебные процедуры
Процедура ЗаполнитьДанныеРегистра() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВебПользователиЛКК.СлужебныйВладелец КАК ВебПрофиль,
	               |	CW_ВебПользователиЛКК.Ссылка КАК Пользователь
	               |ИЗ
	               |	Справочник.CW_ВебПользователиЛКК КАК CW_ВебПользователиЛКК";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НаборЗаписей = РегистрыСведений.CW_ДоступныеПользователи.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(РезультатЗапроса.Выгрузить());
	НаборЗаписей.Записать();
	
КонецПроцедуры
//Служебные процедуры
#КонецЕсли
