
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	Фильтр = НСтр("ru = 'Документ pdf'; en = 'Document pdf'") + "(*.pdf)|*.pdf";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Сохраниение файла";
	ДиалогОткрытияФайла.ПолноеИмяФайла = ПараметрыВыполненияКоманды.Источник.Окно.Заголовок;

	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораИменифайла",ЭтотОбъект, ПараметрыВыполненияКоманды.Источник.Результат); 
	ДиалогОткрытияФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораИменифайла(Результат, ТабличныйДокумент) Экспорт 
	
	Если Результат = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = Результат[0];
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗаписиТабличногоДокумента",ЭтотОбъект, Новый Структура("ИмяФайла",ИмяФайла)); 
	ТабличныйДокумент.НачатьЗапись(ОписаниеОповещения,ИмяФайла,ТипФайлаТабличногоДокумента.PDF);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиТабличногоДокумента(Результат, ДополнительныеПараметры) Экспорт 
	
	#Если НЕ ВебКлиент Тогда
		Если Результат <> Неопределено Тогда
			Если Результат Тогда
				ЗапуститьПриложение(ДополнительныеПараметры.ИмяФайла,,Ложь);
			КонецЕсли; 
		КонецЕсли; 	
	#КонецЕсли

КонецПроцедуры
  
