
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	Параметры.Свойство("Грузоперевозка",		Грузоперевозка);
	Параметры.Свойство("Представление",			Представление);
	Параметры.Свойство("ДатаГрузоперевозки",	ДатаГрузоперевозки);
	Параметры.Свойство("ОтслеживаемоеОборудование",ОтслеживаемоеОборудование);
	
	ТаблицаОтслеживаемогоОборудования.Очистить();
	
	Оборудование = Справочники.CW_Оборудование.ПолучитьОборудованиеПоНаименованию(Представление);
	Если Не Оборудование.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ОтслеживаемоеОборудование.Ссылка КАК ОтслеживаемоеОборудование,
		               |	CW_ОтслеживаемоеОборудование.НачалоСлежения КАК НачалоСлежения,
		               |	CW_ОтслеживаемоеОборудование.ОкончаниеСлежения КАК ОкончаниеСлежения,
		               |	CW_СтатусыОборудованияНаСлеженииСрезПоследних.Статус КАК Статус
		               |ИЗ
		               |	РегистрСведений.CW_СтатусыОборудованияНаСлежении.СрезПоследних КАК CW_СтатусыОборудованияНаСлеженииСрезПоследних,
		               |	Справочник.CW_ОтслеживаемоеОборудование КАК CW_ОтслеживаемоеОборудование
		               |ГДЕ
		               |	CW_ОтслеживаемоеОборудование.Оборудование = &Оборудование
		               |	И &ДатаПеревозки МЕЖДУ CW_ОтслеживаемоеОборудование.НачалоСлежения И ВЫБОР
		               |			КОГДА CW_ОтслеживаемоеОборудование.ОкончаниеСлежения = ДАТАВРЕМЯ(1, 1, 1)
		               |				ТОГДА КОНЕЦПЕРИОДА(&ДатаПеревозки, ДЕНЬ)
		               |			ИНАЧЕ КОНЕЦПЕРИОДА(CW_ОтслеживаемоеОборудование.ОкончаниеСлежения, ДЕНЬ)
		               |		КОНЕЦ
		               |	И ВЫБОР
		               |			КОГДА &ВыбраноОтслеживаемоеОборудование
		               |				ТОГДА CW_ОтслеживаемоеОборудование.Ссылка = &ОтслеживаемоеОборудование
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ";
		
		Запрос.УстановитьПараметр("Грузоперевозка",			Грузоперевозка);
		Запрос.УстановитьПараметр("ДатаПеревозки", 			ДатаГрузоперевозки);
		Запрос.УстановитьПараметр("Оборудование",  			Оборудование);
		
		Запрос.УстановитьПараметр("ВыбраноОтслеживаемоеОборудование",  	ЗначениеЗаполнено(ОтслеживаемоеОборудование));
		Запрос.УстановитьПараметр("ОтслеживаемоеОборудование",  			ОтслеживаемоеОборудование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока =  ТаблицаОтслеживаемогоОборудования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура КомандаОК(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаОтслеживаемогоОборудования.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(, "Не выбрано отслеживаемое оборудование для подставновки в грузоперевозоку!");
		Возврат;
	Иначе
		ПродолжитьВыборОборудования(ТекущаяСтрока);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтслеживаемогоОборудованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПродолжитьВыборОборудования(ВыбраннаяСтрока);
	
КонецПроцедуры   

&НаКлиенте
Процедура ПродолжитьВыборОборудования(ВыбраннаяСтрока);
	
	ВыбранноеОборудование = ПродолжитьВыборОборудованияНаСервере(ВыбраннаяСтрока);
	ЭтаФорма.Закрыть(ВыбранноеОборудование);
	
КонецПроцедуры

&НаСервере
Функция  ПродолжитьВыборОборудованияНаСервере(ВыбраннаяСтрока)
	
	СтрокаТекущая = ТаблицаОтслеживаемогоОборудования.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Возврат СтрокаТекущая.ОтслеживаемоеОборудование;
	
КонецФункции

  