
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивКлючей = Неопределено;
	Параметры.Свойство("МассивКлючей", МассивКлючей); 
	Если МассивКлючей = Неопределено Тогда   
		ВызватьИсключение "Не удалось получить список обработчиков для выполянения!";
	КонецЕсли;
	
	ПодготовитьСписокОбработчиков(МассивКлючей);
	
КонецПроцедуры  

&НаСервере
Процедура ПодготовитьСписокОбработчиков(МассивКлючей) 

	Для каждого КлючЗаписи из МассивКлючей Цикл
		ЗаписьРгистра = РегистрыСведений.CW_ОбработчикиОбновления.СоздатьМенеджерЗаписи();
		ЗаписьРгистра.ИмяОбработчика = КлючЗаписи.ИмяОбработчика;
		ЗаписьРгистра.Прочитать();
		
		Если ЗаписьРгистра.Выбран() тогда
			СтрокаТаблицы = ТаблицаОбработчиков.Добавить();	
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ЗаписьРгистра);
			
			Если СтрокаТаблицы.Версия = "*" тогда
				Продолжить;
			КонецЕсли;
			
			мРазряды = СтрРазделить(СтрокаТаблицы.Версия, ".");
			
			СтрокаТаблицы.Разряд_1 = Число(мРазряды[0]);	
			СтрокаТаблицы.Разряд_2 = Число(мРазряды[1]);	
			СтрокаТаблицы.Разряд_3 = Число(мРазряды[2]);	
			
		КонецЕсли;
		
	КонецЦикла;   

	ТаблицаОбработчиков.Сортировать("Версия ВОЗР, Разряд_1 ВОЗР, Разряд_2 ВОЗР, Разряд_3 ВОЗР, Разряд_4 ВОЗР, НачальноеЗаполнение УБЫВ, ПриКаждомОбновлении УБЫВ, ОчередьВыполнения ВОЗР");	

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ИндикаторОбновления.МаксимальноеЗначение = ТаблицаОбработчиков.Количество();

	ПодключитьОбработчикОжидания("НачатьВыполнениеобработчиков", 0.1, Истина);
	
КонецПроцедуры    

&НаКлиенте
Процедура НачатьВыполнениеобработчиков() Экспорт 
	
	ВремяНачалаОбновления 	= ДатаСеанса(); 

	Для Каждого СтрокаТаблицы из ТаблицаОбработчиков Цикл    
		
		РезульатВыполнения = CW_ОбновлениеКонфигурацииСлужебный.ВыполнитьЗаданиеНаСервере(СтрокаТаблицы.ИмяОбработчика);  
		Если РезульатВыполнения.Состояние = "Ошибка" Тогда
			ПодключитьОбработчикОжидания("ЗавершитьВыполнениеОбработчиковОшибка", 1, Истина);
			Возврат;
		КонецЕсли; 
		
		Результат 			= ПолучитьИзВременногоХранилища(РезульатВыполнения.АдресРезультата);
		Если ТипЗнч(Результат) = Тип("Структура") Тогда 
			Результат.Свойство("ТребуетсяПерезапуск", ТребуетсяПерезапуск);
			ИндикаторОбновления = ИндикаторОбновления + 1; 
			ОбновитьОтображениеДанных(Элементы.ИндикаторОбновления);   
		КонецЕсли;  
		
		ИндикаторОбновления = ИндикаторОбновления + 1; 
		ОбновитьОтображениеДанных(Элементы.ИндикаторОбновления);    
		
	КонецЦикла; 
	
	ПодключитьОбработчикОжидания("ЗавершитьВыполнениеОбработчиковУспешно", 1, Истина);
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ДатаСеанса()
	 Возврат  ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыполнениеОбработчиковУспешно() Экспорт 
	
	Ответ = Новый Структура;
	Ответ.Вставить("Ошибка", 				Ложь);
	Ответ.Вставить("ТребуетсяПерезапуск",	ТребуетсяПерезапуск);

	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВыполнениеОбработчиковОшибка() Экспорт 
	
	Ответ = Новый Структура;
	Ответ.Вставить("Ошибка", 				Истина);
	Ответ.Вставить("ТребуетсяПерезапуск", 	ТребуетсяПерезапуск);
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры 

	
&НаКлиенте
Процедура ТехническаяИнформацияНажатие(Элемент)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЗапускатьНеВФоне", Истина);
	ПараметрыОтбора.Вставить("ДатаНачала", ВремяНачалаОбновления);
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ПараметрыОтбора);
	
КонецПроцедуры
