
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МониторинговыйПараметрПриложения 		= Константы.CW_РеестрыНДС0МониторинговыйПараметрПриложения.Получить();
	
	ИспользуетсяПодменаГрузоперевозок 		= Константы.CW_РеестрыНДС0ИспользуетсяПодменаГрузоперевозок.Получить(); 
	ПараметрТребуетсяПодменаГрузоперевозок  = Константы.CW_РеестрыНДС0ПараметрТребуетсяПодменаГрузоперевозок.Получить(); 
	ПараметрГрузоперевозкаДляЗамены 		= Константы.CW_РеестрыНДС0ПараметрГрузоперевозкаДляЗамены.Получить(); 
	
	ВерсииПодсистем  = CW_ВерсииПодсистемСервер.УстановленныеВерсииПодсистем();
	Если ВерсииПодсистем.Свойство("CW_РеестрыНДС0") Тогда
		ВерсияПодсистемы = ВерсииПодсистем.CW_РеестрыНДС0;
	КонецЕсли;      
	
	ВерсияПодсистемы 	= ?(ВерсияПодсистемы = Неопределено, "Не установлена", ВерсияПодсистемы);
	Заголовок 			= Заголовок + " (версия "+СокрЛП(ВерсияПодсистемы)+")"; 

	Результат = CW_РеестрыНДС0Сервер.ПолучитьРегистрационнуюИнформациюСервиса();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Результат);
	
	Если КонецДня(ТекущаяДата()) <= ДатаОкончания 
		И НачалоДня(ТекущаяДата()) >= ДатаНачала Тогда
		Статус = "Действует";
		ЦветТекстаНадписи = WebЦвета.Зеленый;
	Иначе
		Статус = "Не оформлена";
		ЦветТекстаНадписи = WebЦвета.Красный;
	КонецЕсли;
	
	Элементы.Статус.ЦветТекста = ЦветТекстаНадписи;

	Элементы.Группа3.Видимость = Не РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована();
	
КонецПроцедуры  


&НаКлиенте
Процедура ПараметрПриложенияРеестраПриИзменении(Элемент)  
	
	ПараметрПриложенияРеестраПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ПараметрПриложенияРеестраПриИзмененииНаСервере()   
	
	Константы.CW_РеестрыНДС0МониторинговыйПараметрПриложения.Установить(МониторинговыйПараметрПриложения); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникНастройкиРеестрНДС0(Команда)        
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПомощникаНастройки", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.CW_РеестрыНДС0ПомощникНастройки.Форма.Форма",, ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеЗакрытияПомощникаНастройки(Результат, ДополнительныеПараметры) Экспорт
	
	ПослеЗакрытияПомощникаНастройкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗакрытияПомощникаНастройкиНаСервере()

	МониторинговыйПараметрПриложения = Константы.CW_РеестрыНДС0МониторинговыйПараметрПриложения.Получить(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяПодменаГрузоперевозокПриИзменении(Элемент)
	ПодменаГрузоперевозокПриИзменени("CW_РеестрыНДС0ИспользуетсяПодменаГрузоперевозок", ИспользуетсяПодменаГрузоперевозок); 
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрГрузоперевозкаДляЗаменыПриИзменении(Элемент)
	ПодменаГрузоперевозокПриИзменени("CW_РеестрыНДС0ПараметрГрузоперевозкаДляЗамены", ПараметрГрузоперевозкаДляЗамены);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрТребуетсяПодменаГрузоперевозокПриИзменении(Элемент)
	ПодменаГрузоперевозокПриИзменени("CW_РеестрыНДС0ПараметрТребуетсяПодменаГрузоперевозок", ПараметрТребуетсяПодменаГрузоперевозок);
КонецПроцедуры

&НаСервере
Процедура ПодменаГрузоперевозокПриИзменени(ИмяКонстнаты, УстанавливаемоеЗначение)   
	
	Константы[ИмяКонстнаты].Установить(УстанавливаемоеЗначение);      
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрГрузоперевозкаДляЗаменыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	ДоступныеПараметры = ПолучитьСписокПараметровДлявыбора(Тип("СправочникСсылка.CW_Грузоперевозки"));    
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ДоступныеПараметры);

	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", ПараметрыВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрТребуетсяПодменаГрузоперевозокНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ДоступныеПараметры = ПолучитьСписокПараметровДлявыбора(Тип("Булево"));    
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", ДоступныеПараметры);

	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", ПараметрыВыбора, Элемент);

КонецПроцедуры        

&НаСервере
Функция ПолучитьСписокПараметровДлявыбора(ТипЗначенияПараметра)
	
	Возврат ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСписокПараметровПоТипуЗначения(ТипЗначенияПараметра);
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		Если Не ПроверитьЗаполнение() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


