&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ДекорацияПрефиксыПодразделенийНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.CW_ПрефиксыПодразделений.ФормаСписка");
	
КонецПроцедуры


&НаКлиенте
Процедура CW_ПрефиксЗаказовПриИзменении(Элемент)
	
	НаборКонстант.CW_ПрефиксЗаказов =  CW_ПрефиксЗаказов;
	ИзмененныеКонстанты = ПрефиксЗаказовПриИзменениииНаСервере();
	
	УправлениеФормой(ЭтаФорма);
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПрефиксЗаказовПриИзменениииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ПрефиксЗаказов");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	 
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции



&НаКлиенте
Процедура CW_НумераторЗаказовПриИзменении(Элемент)
	
	НаборКонстант.CW_НумераторЗаказов =  CW_НумераторЗаказов;
	ИзмененныеКонстанты = НумераторЗаказовНаСервере();
	
	УправлениеФормой(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция НумераторЗаказовНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_НумераторЗаказов");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ПрефиксЗаказов = "";
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ПрефиксЗаказов");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции  


&НаКлиенте
Процедура CW_ПрефиксЗаказовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("[ПП]"	, "Префикс подразделения");
	СписокВыбора.Добавить("[ПС]"	, "Префикс сотрудника");
	СписокВыбора.Добавить("[ГГГГ]"	, "Год заказа (4 цифры)");
	СписокВыбора.Добавить("[ГГ]"	, "Год заказа (2 цифры)");
	СписокВыбора.Добавить("[ММ]"	, "Месяц заказа (2 цифры)");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораМакроса",ЭтотОбъект, Новый Структура()); 
	ПоказатьВыборИзМеню(ОписаниеОповещения,СписокВыбора,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораМакроса(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.CW_ПрефиксЗаказов.ВыделенныйТекст 			= Ответ.Значение;
	Элементы.ДекорацияПрефиксыПодразделений.Видимость 	= СтрНайти(НаборКонстант.CW_ПрефиксЗаказов, "[ПП]");
	
КонецПроцедуры


&НаКлиенте
Процедура CW_ИспользоватьЛогистическиеСтатусыЗаказовПриИзменении(Элемент)
	
	НаборКонстант.CW_ИспользоватьЛогистическиеСтатусыЗаказов =  CW_ИспользоватьЛогистическиеСтатусыЗаказов;
	ИзмененныеКонстанты = ИспользоватьЛогистическиеСтатусыЗаказовПриИзменениииНаСервере();
	
	УправлениеФормой(ЭтаФорма);
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент);

	
КонецПроцедуры

&НаСервере
Функция ИспользоватьЛогистическиеСтатусыЗаказовПриИзменениииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
		
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользоватьЛогистическиеСтатусыЗаказов");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_РассчитыватьЛогистическийСтатусЗаказаПоНаиболшейКонтрольнойДате = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_РассчитыватьЛогистическийСтатусЗаказаПоНаиболшейКонтрольнойДате");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииРеквизитаФормы(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначенияРеквизитовФормы(Форма)

	Форма.CW_НумераторЗаказов	= Константы.CW_НумераторЗаказов.Получить();
	Форма.CW_ПрефиксЗаказов		= Константы.CW_ПрефиксЗаказов.Получить();
	
	Форма.CW_ИспользоватьЛогистическиеСтатусыЗаказов = Константы.CW_ИспользоватьЛогистическиеСтатусыЗаказов.Получить();
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Элементы.ГруппаПрефиксЗаказов.Видимость 			= НЕ ЗначениеЗаполнено(Форма.CW_НумераторЗаказов);
	Элементы.ДекорацияПрефиксыПодразделений.Видимость	= СтрНайти(Форма.CW_ПрефиксЗаказов, "[ПП]");
																	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты)
	
	УправлениеФормой(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОБласти
