
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ДокументПроведен(ПараметрКоманды) Тогда
		ПоказатьПредупреждение(,"Ввод на основании возможен только для проведенных документов!");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды",	ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды",	ПараметрыВыполненияКоманды);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВопросаПодтвержденияВводаНаОсновании",ЭтотОбъект, ДополнительныеПараметры); 
	
	Если ТребуетсяПодтверждениеВводаНаОсновании(ПараметрКоманды) Тогда
		ПоказатьВопрос(ОписаниеОповещения,"В документе отсутствует признак наличия акта и (или) счёта-фактуры. Продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДокументПроведен(ПараметрКоманды)
	Возврат ПараметрКоманды.Проведен;
КонецФункции

&НаКлиенте
Процедура ОбработатьВыполнениеКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивПорядкаОтражения = ПолучитьМассивПорядокаОтраженияРасходов(ПараметрКоманды); 
	Если МассивПорядкаОтражения.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Нет данных для ввода документа!");
	КонецЕсли;
	
	ДополнительныеПараметры = новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды",	ПараметрКоманды);
	ДополнительныеПараметры.Вставить("Источник",		ПараметрыВыполненияКоманды.Источник);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборПорядкаОтражения", ЭтотОбъект, ДополнительныеПараметры);
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.ЗагрузитьЗначения(МассивПорядкаОтражения);
	
	Если СписокВыбора.Количество() = 1 Тогда
		//В документе толькоодин порядок отражения затрат
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, СписокВыбора.Получить(0));
	Иначе
		СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите порядок отражения затрат");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаПодтвержденияВводаНаОсновании(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыполнениеКоманды(ДополнительныеПараметры.ПараметрКоманды, ДополнительныеПараметры.ПараметрыВыполненияКоманды);
	
КонецПроцедуры

&НаСервере
Функция ТребуетсяПодтверждениеВводаНаОсновании(ПараметрКоманды)
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				ПараметрКоманды.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПараметрКоманды.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, ПараметрКоманды.Дата);
	
	Если НЕ ПараметрКоманды.ПредъявленАкт И НЕ ПараметрКоманды.ПредъявленСФ и ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивПорядокаОтраженияРасходов(ПараметрКоманды)
	
	Массив = Новый Массив;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_РасходыПоГрузоперевозкеУслуги.ПорядокОтражения КАК ПорядокОтражения
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &ПараметрКоманды";
	
	Запрос.УстановитьПараметр("ПараметрКоманды", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.ПорядокОтражения);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборПорядкаОтражения(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПорядокОтражения", 	ВыбранныйЭлемент.Значение);
	СтруктураПараметров.Вставить("ДокументОснование", 	ДополнительныеПараметры.ПараметрКоманды);
	
	АдресТаблицыПеревыставления = ПолучитьАдресДанных(СтруктураПараметров);
	
	Если АдресТаблицыПеревыставления = Неопределено Тогда
		ПоказатьПредупреждение(,"Нет данных для ввода документа!");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("АдресТаблицыПеревыставления", 	АдресТаблицыПеревыставления);
	
	ДополнительныеПараметры.Вставить("ПорядокОтражения", ВыбранныйЭлемент.Значение);
	ОписаниеОповещения = новый ОписаниеОповещения("ПродолжитьВводНаОсновании", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.Форма.ФормаВводаНаОснованииУправляемая",СтруктураПараметров,ДополнительныеПараметры.Источник,,,,ОписаниеОповещения); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПродолжитьВводНаОсновании(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Отмена 
		ИЛИ РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляЗаполнения = ПолучитьИзВременногоХранилища(РезультатВыбора);
	
	ДанныеДляЗаполнения.Вставить("ВводНаОсновании", 	Истина);
	ДанныеДляЗаполнения.Вставить("ТипОснования", 		ТипЗнч(ДополнительныеПараметры.ПараметрКоманды));
	ДанныеДляЗаполнения.Вставить("ДокументОснование", 	ДополнительныеПараметры.ПараметрКоманды);
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("ЗначенияЗаполнения", ДанныеДляЗаполнения);
	
	ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.ФормаОбъекта", ПараметрыОбъекта);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресДанных(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Покупатель КАК Контрагент,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ДоговорПокупателя КАК Договор,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.Валюта КАК Валюта,
	               |	СУММА(CW_РасходыПоГрузоперевозкеУслуги.Всего) КАК Сумма
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &ДокументОснование
	               |	И CW_РасходыПоГрузоперевозкеУслуги.ПорядокОтражения = &ПорядокОтражения
	               |	И CW_РасходыПоГрузоперевозкеУслуги.Покупатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	И CW_РасходыПоГрузоперевозкеУслуги.ДоговорПокупателя <> ЗНАЧЕНИЕ(Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_РасходыПоГрузоперевозкеУслуги.Покупатель,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ДоговорПокупателя,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ПриложениеКДоговору,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.Валюта";
	
	Запрос.УстановитьПараметр("ДокументОснование",	СтруктураПараметров.ДокументОснование);
	Запрос.УстановитьПараметр("ПорядокОтражения",	СтруктураПараметров.ПорядокОтражения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаПеревыставления = РезультатЗапроса.Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПеревыставления, Новый УникальныйИдентификатор);
	
КонецФункции