//см.CW_ОбновлениеКонфигурацииСервер.ПриДобавленииОбработчиков()
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт  
	
	//НачальноеЗаполнение
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_РеестрыНДС0Служебный.ЗаполнитьПредопределенныеФункции";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_РеестрНДС";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;
	НоваяСтрока.Наименование		= "Заполнить предопределенные функции реестров НДС";
	НоваяСтрока.Комментарий			= "Заполнить предопределенные функции реестров НДС";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_РеестрыНДС0Служебный.ПодключитьИсториюДляОбъектовПодсистемы";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_РеестрНДС";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;
	НоваяСтрока.Наименование		= "Подключение истории объетов";
	НоваяСтрока.Комментарий			= "Выполняет подключение истории объектов";   
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_РеестрыНДС0Служебный.ОбновитьИменаЯчееекПриложений";  
	НоваяСтрока.Версия 				= "8.3.2.1";
	НоваяСтрока.ИмяПодсистемы 		= "CW_РеестрНДС";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;
	НоваяСтрока.Наименование		= "Обновление настройки ячеек приложений";
	НоваяСтрока.Комментарий			= "Обновляет настройки ячеек приложений";  	
    //---НачальноеЗаполнение

	
	//НоваяСтрока = Обработчики.Добавить(); .
	//НоваяСтрока.ИмяОбработчика  		= "CW_РеестрыНДС0Служебный.ОбновитьИменаЯчееекПриложений";  
	//НоваяСтрока.Версия 				= "8.3.0.5";
	//НоваяСтрока.ИмяПодсистемы 		= "CW_РеестрНДС";
	//НоваяСтрока.НачальноеЗаполнение	= Ложь;
	//НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	//НоваяСтрока.РежимВыполнения		= "Оперативно";
	//НоваяСтрока.ОчередьВыполнения		= 3;
	//НоваяСтрока.Наименование			= "Заполнение имен ячеек для предопределенных элементов";
	//НоваяСтрока.Комментарий			= "Выполняет заполнение имен ячеек справочника ""Реестр НДС 0%: ЯчейкиОтчета"" для предопределенных элементов";   
	
КонецПроцедуры 

//НачальноеЗаполнение
Процедура ЗаполнитьПредопределенныеФункции(АдресРезультата=Неопределено) Экспорт  

	Справочники.CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета.ЗаполнитьПредопределенныеФункции();
	  
КонецПроцедуры

Процедура ПодключитьИсториюДляОбъектовПодсистемы(АдресРезультата=Неопределено) Экспорт
	
	МассивИменМетаданных = Новый Массив;
	МассивИменМетаданных.Добавить("Справочник.CW_РеестрыНДС0АлгоритмыЗаполненияЯчеекОтчета");
  	МассивИменМетаданных.Добавить("Справочник.CW_РеестрыНДС0ЗаписиРеестра");
	МассивИменМетаданных.Добавить("Справочник.CW_РеестрыНДС0СоответствиеЗаполненияСтрок");
	МассивИменМетаданных.Добавить("Справочник.CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета");
	МассивИменМетаданных.Добавить("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений");
	
	Для Каждого ИмяМетаданного из МассивИменМетаданных Цикл
		СсылкаНаМетаданное  		= CW_Обмены_ПИ.МетаданноеКонфигурации(ИмяМетаданного);

		ОбъектМетаданоеКонфигурации = СсылкаНаМетаданное.ПолучитьОбъект();
		ОбъектМетаданоеКонфигурации.ДляИсторииОбъектов = Истина;  
		ОбъектМетаданоеКонфигурации.Записать();
	КонецЦикла;
	
КонецПроцедуры  

Процедура ОбновитьИменаЯчееекПриложений(АдресРезультата=Неопределено) Экспорт

	ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.ОбновитьИменаЯчееекПриложений(ПредопределенноеЗначение("ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2021Кв2"));
	
КонецПроцедуры
//---НачальноеЗаполнение
   