
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресОтбора", АдресОтбора); 
	Параметры.Свойство("АдресСхемы",  АдресСхемы); 

	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));  
	
	ПолученныеНастройки = ПолучитьИзВременногоХранилища(АдресОтбора);  
	Если ТипЗнч(ПолученныеНастройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(ПолученныеНастройки); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)

	ЗаписатьНастройкиВоВременноеХранилище(); 
	
	ОтборУстановлен = ПолучитьНаличиеОтбораНаСервере();
	
	Ответ = Новый Структура;
	Ответ.Вставить("АдресОтбора", 		АдресОтбора);
	Ответ.Вставить("ОтборУстановлен", 	ОтборУстановлен);
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаличиеОтбораНаСервере()
	
	ОтборУстановлен = Ложь;
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для Каждого ЭлементОтбора из ЭлементыОтбора Цикл
		Если ЭлементОтбора.Использование Тогда  
			ОтборУстановлен = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;  
	
	Возврат ОтборУстановлен;

КонецФункции

&НаСервере
Процедура ЗаписатьНастройкиВоВременноеХранилище()  
	
	ПередаваемыеНастройки = КомпоновщикНастроек.Настройки; 
	ПоместитьВоВременноеХранилище(ПередаваемыеНастройки, АдресОтбора);
	
КонецПроцедуры

