
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);  
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(Запись.Пользователь,Истина);
	ГруппаПользователя 			= CW_ПраваДоступа_ПИ.ГруппаПользователя(Запись.Пользователь);
	ГруппаТекущегоПользователя 	= CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	УстановитьПривилегированныйРежим(Ложь);

	
	ИспользованиеБюджетирования 		= ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования");
	ОграничиватьДоступНаУровнеЗаписей 	= ПолучитьФункциональнуюОпцию("CW_ОграничиватьДоступНаУровнеЗаписей");
	
	УправлениеПользователями = CW_ПраваДоступа.ПравоДоступно("УправлениеПользователями");	
	ЭтаФорма.ТолькоПросмотр = Не УправлениеПользователями 
						и Запись.Пользователь <> ПараметрыСеанса.ТекущийПользователь 
						и НЕ ЭтоПолноправныйПользователь;
	
	Элементы.ОтображатьКолонкуФайлы_CW_Заявки.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаявок");
	Элементы.ОтображатьКолонкуФайлы_CW_Заказы.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов");
	
	_ПолучитьРежимРабочегоСтолаБЭ();
	
	//Подсистема.КлючевыеПоказатели
	РежимКлючевыхПоказателей = CW_КлючевыеПоказателиСервер.ТекущийРежимФормыКлючевыхПоказателейНаНачальнойСтранце();
	//Подсистема.КлючевыеПоказатели
	
	//Рабочая дата пользователя
	ЗначениеРабочейДаты = CW_Настройки.РабочаяДатаПользователя();
	
	Если ЗначениеЗаполнено(ЗначениеРабочейДаты) Тогда
		ИспользоватьТекущуюДатуКомпьютера = 1;
	Иначе
		ИспользоватьТекущуюДатуКомпьютера = 0;
		ЗначениеРабочейДаты = '0001-01-01';
	КонецЕсли;
	//Рабочая дата пользователя
	
	СтараяГруппаПользователя = ГруппаПользователя;
	
	//Если пользователь настройку которого редкаутруем является полноправным (см. CW_ПраваДоступа.ЭтоПолноправныйПользователь)
	//Блокируем группу для изменения, так как он может не быть пользователем модуля БЭ, 
	//а является администратором БД, у него может не быть записей в регистре "CW_ПараметрыПользователей"
	//для такого пользователя наличие/отсутсвтие записей в  регистре игнорируется, группа всегда "Администратры"
	Элементы.ГруппаПользователя.Доступность =  НЕ ЭтоПолноправныйПользователь;
	
	
	_УправлениеЭлементамиФормы();
	УстановитьДоступностьЭлементов();

	// --- 
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	НастройкиКП = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", "",, Пользователь.Имя);
	Если Не ТипЗнч(НастройкиКП) = Тип("НастройкиКлиентскогоПриложения") Тогда
		НастройкиКП = Новый НастройкиКлиентскогоПриложения;
	КонецЕсли;
	
	Элементы.СтраницаИнтерфейс.Видимость = (НастройкиКП.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Такси);
	Если (Элементы.СтраницаИнтерфейс.Видимость) Тогда
		
		ВариантМасштабаТакси = ?(НастройкиКП.ВариантМасштабаФормКлиентскогоПриложения=ВариантМасштабаФормКлиентскогоПриложения.Компактный,1,0);
		
	КонецЕсли; 
	
//	Элементы.ПроверятьСоответствиеРеквизитовЗаказаРеквизитамГрузоперевозок.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов");
	Элементы.СкрыватьКартинкиФинансовыхСтатусовВЖурналах.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок");
	
	// --- 
	Элементы.ИспользуемаяФормаКонтрагента.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеCRM");
	
	ИндексСтраницыФинансыМониторинг = 0;  
	
	//Фоновое обновление журналов
	ВыполнятьФоновоеОбновлениеЖурналаЗавокПриИзмененииНаСервере();
	ВыполнятьФоновоеОбновлениеЖурналаЗаказовПриИзмененииНаСервере();
	ВыполнятьФоновоеОбновлениеЖурналаГрузоперевозокПриИзмененииНаСервере();
	//Фоновое обновление журналов
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("CW_НастройкиПользователей_Запись");
КонецПроцедуры

&НаСервере
Функция _УправлениеЭлементамиФормы()
	
	Элементы.Доходы_ФормироватьСчетФактуру.Доступность 	= (Запись.Доходы_ФормироватьАкт);
	Элементы.СтраницаБюджеты.Видимость 					= ИспользованиеБюджетирования;
	
	ЭтоАдминистратор = ГруппаТекущегоПользователя 		= Справочники.CW_ГруппыПользователей.Администраторы 	
															или CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь,Истина);
	
	Элементы.ГруппаПользователя.Видимость 							= ЭтоАдминистратор ;
	Элементы.ФормаКопироватьНастройкиДругогоПользователя.Видимость 	= ЭтоАдминистратор ;
	
КонецФункции
 

&НаКлиенте
Процедура Доходы_ФормироватьАктПриИзменении(Элемент)
	
	Если (НЕ Запись.Доходы_ФормироватьАкт) Тогда
		Запись.Доходы_ФормироватьСчетФактуру=Ложь;
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантМасштабаТаксиПриИзменении(Элемент)
	
	_ВариантМасштабаТаксиПриИзменении();
	ПоказатьПредупреждение(,"Требуется перезапуск приложения.");
	
КонецПроцедуры

&НаСервере
Функция _ВариантМасштабаТаксиПриИзменении()
	// --- 
	
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	НастройкиКП = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", "",, Пользователь.Имя);
	Если Не ТипЗнч(НастройкиКП) = Тип("НастройкиКлиентскогоПриложения") Тогда
		НастройкиКП = Новый НастройкиКлиентскогоПриложения;
	КонецЕсли;
	НастройкиКП.ВариантМасштабаФормКлиентскогоПриложения = ?(ВариантМасштабаТакси=1,ВариантМасштабаФормКлиентскогоПриложения.Компактный,ВариантМасштабаФормКлиентскогоПриложения.Обычный);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", НастройкиКП,, Пользователь.Имя);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура РежимРабочегоСтолаПриИзменении(Элемент)
	
	РежимРабочегоСтолаПриИзмененииНаСервере();
	ОбновитьИнтерфейс();
	
КонецПроцедуры  

&НаСервере
Процедура РежимРабочегоСтолаПриИзмененииНаСервере()
	
	Если РежимРабочегоСтола = 1 Тогда
		CW_БухгалтерияЭкспедитораСервер.ВключитьРабочийСтолБухгалтерияЭкспедитора();
	Иначе
		CW_БухгалтерияЭкспедитораСервер.ОтключитьРабочийСтолБухгалтерияЭкспедитора();;
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура _ПолучитьРежимРабочегоСтолаБЭ()
	
	ИмяФормыРабочегоСтола = CW_БухгалтерияЭкспедитораСервер.ИмяФормыРабочийСтолБухгалтерияЭкспедитора();
	
	НастройкиНачальнойСтраницы = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы");
	Если НастройкиНачальнойСтраницы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
	
	ЕстьРабочийСтол = Ложь;
	
	ИндексФормы = СоставФорм.ЛеваяКолонка.Найти(ИмяФормыРабочегоСтола);
	Если ИндексФормы <> Неопределено Тогда
		РежимРабочегоСтола = 1;
	КонецЕсли;
	ИндексФормы = СоставФорм.ПраваяКолонка.Найти(ИмяФормыРабочегоСтола);
	Если ИндексФормы <> Неопределено Тогда
		РежимРабочегоСтола = 1;
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура РежимКлючевыхПоказателейПриИзменении(Элемент) 
	
	РежимКлючевыхПоказателейПриИзмененииНаСервере();
	ОбновитьИнтерфейс(); 
	
КонецПроцедуры

&НаСервере
Процедура РежимКлючевыхПоказателейПриИзмененииНаСервере()
	
	CW_КлючевыеПоказателиСервер.ФормаКлючевыхПоказателейНаНачальнойСтранце(РежимКлючевыхПоказателей);
	
КонецПроцедуры


&НаКлиенте
Процедура МаксимизироватьРазмерРабочейОбласти(Команда)
	
	_МаксимизироватьРазмерРабочейОбласти();
	// --- 
	_УФК.ВывестиПредупреждение("Настройки вступят в силу после перезапуска.");
	
КонецПроцедуры
 
&НаСервере
Процедура _МаксимизироватьРазмерРабочейОбласти()
	// --- 
	
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	// --- 
	НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();
	// --- 
	НастройкиСостава.Верх.Очистить();
	НастройкиСостава.Лево.Очистить();
	НастройкиСостава.Низ.Очистить();
	НастройкиСостава.Право.Очистить();
	// --- 
	ПанельИнструментов = Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов");
	ПанельОткрытых = Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых");
	ГруппаПраво = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	ГруппаПраво.Добавить(ПанельИнструментов);
	ГруппаПраво.Добавить(ПанельОткрытых);
	НастройкиСостава.Право.Добавить(ГруппаПраво);
	// --- 
	НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
	// --- 
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", НастройкиИнтерфейса,,Пользователь);
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура ПерезапуститьПриложение(Команда)
	
	ЗавершитьРаботуСистемы(Ложь,Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаМониторинг Тогда
		Элементы.ГруппаМониторингЗакладки.ТекущаяСтраница 	= ПолучитьСтраницуМониторинга();
	ИначеЕсли  ТекущаяСтраница = Элементы.СтраницаФинансы Тогда
		Элементы.ГруппаЗакладкиФинансы.ТекущаяСтраница 		= ПолучитьСтраницуФинансы();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтраницуМониторинга()
	
	МассивСтраниц = Новый Массив;
	МассивСтраниц.Добавить(Элементы.ГруппаМониторингЗначенияПоУмолчанию);
	МассивСтраниц.Добавить(Элементы.ГруппаМониторингДействия);
	МассивСтраниц.Добавить(Элементы.ГруппаМониторингКонтрольИПроверка);
	
	Возврат МассивСтраниц[ИндексСтраницыФинансыМониторинг];
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтраницуФинансы()
	
	МассивСтраниц = Новый Массив;
	МассивСтраниц.Добавить(Элементы.ГруппаФинансыЗначенияПоУмолчанию);
	МассивСтраниц.Добавить(Элементы.ГруппаФинансыДействия);
	МассивСтраниц.Добавить(Элементы.ГруппаФинансыКонтроль);
	
	Возврат МассивСтраниц[ИндексСтраницыФинансыМониторинг];
	
КонецФункции

&НаКлиенте
Процедура ГруппаМониторингЗакладкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаМониторингЗначенияПоУмолчанию тогда
		ИндексСтраницыФинансыМониторинг = 0;	
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаМониторингДействия тогда
		ИндексСтраницыФинансыМониторинг = 1;	
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаМониторингКонтрольИПроверка тогда
		ИндексСтраницыФинансыМониторинг = 2;	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ГруппаЗакладкиФинансыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаФинансыЗначенияПоУмолчанию тогда
		ИндексСтраницыФинансыМониторинг = 0;	
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаФинансыДействия тогда
		ИндексСтраницыФинансыМониторинг = 1;	
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаФинансыКонтроль тогда
		ИндексСтраницыФинансыМониторинг = 2;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПользователяПриИзменении(Элемент)
	
	ИзмененаГруппаПользователя = ГруппаПользователя <> СтараяГруппаПользователя;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеВРегистр()

	ЗаписьРегистра = РегистрыСведений.CW_ПараметрыПользователей.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Пользователь = Запись.Пользователь;
	ЗаписьРегистра.Прочитать();

	ЗаписьРегистра.Пользователь = Запись.Пользователь;
	ЗаписьРегистра.Группа = ГруппаПользователя;
	ЗаписьРегистра.Записать();
	
	СтараяГруппаПользователя 	= ГруппаПользователя;
	ИзмененаГруппаПользователя 	= Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ГруппаПользователя) Тогда

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указана группа пользователя!";
		Сообщение.Поле = "ГруппаПользователя";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	Если ИзмененаГруппаПользователя Тогда
		
		ЗаписатьДанныеВРегистр();
		
		ТекстОповещения	= "Изменение:";
		ТекстПояснения	= "Изменена группа пользователя";
		ПоказатьОповещениеПользователя(ТекстОповещения, , ТекстПояснения);
		
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	ГруппаПользователя 	= CW_ПраваДоступа_ПИ.ГруппаПользователя(Запись.Пользователь);

КонецПроцедуры

&НаКлиенте
Процедура КопироватьНастройкиДругогоПользователя(Команда)
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора"		, истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", истина);
	
	ОписаниеОповещенияПриВыборе = Новый ОписаниеОповещения("ОбработкаВыбораПользователя",ЭтаФорма);
	
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора",ПараметрыФормы , ЭтаФорма,,,,ОписаниеОповещенияПриВыборе,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПользователя(ЗначениеВыбора, ДополнительныйПараметр) Экспорт
	
	Если Не ЗначениеВыбора = Неопределено Тогда
		
		Отказ = ПроверитьВозможностьВыбораПользователя(ЗначениеВыбора);
		
		Если Отказ Тогда
			ПоказатьПредупреждение(,"Выбранный пользователь помечен на удаление или недействителен!");
		КонецЕсли;

		Если Не Отказ Тогда
			Успешно = ЗаполнитьНастройкиПользователя(ЗначениеВыбора);	
			
			Если Не Успешно Тогда
				ПоказатьПредупреждение(,"Для выбранного пользователя отсутсвуют настройки модуля БЭ");
			КонецЕсли;

		Конецесли;
		
	Конецесли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьВыбораПользователя(ЗначениеВыбора)
	
	Если ЗначениеВыбора.ПометкаУдаления или ЗначениеВыбора.Недействителен  Тогда
		Возврат Истина
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции


&НаСервере
Функция ЗаполнитьНастройкиПользователя(ЗначениеВыбора)
	
	//Получение группы пользователя-донора настроек
	ЗапросПараметры = Новый Запрос;
	ЗапросПараметры.Текст = "ВЫБРАТЬ
	                        |	CW_ПараметрыПользователей.Пользователь КАК Пользователь,
	                        |	CW_ПараметрыПользователей.Группа КАК Группа
	                        |ИЗ
	                        |	РегистрСведений.CW_ПараметрыПользователей КАК CW_ПараметрыПользователей
	                        |ГДЕ
	                        |	CW_ПараметрыПользователей.Пользователь = &Пользователь";
	
	ЗапросПараметры.УстановитьПараметр("Пользователь", ЗначениеВыбора);
	РезультатЗапроса 	= ЗапросПараметры.Выполнить();
	Выборка	 			= РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ГруппаПользователя = Выборка.Группа;	
	КонецЕсли;
	
	//Настройки пользователя-донора
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ *
		           |ИЗ
	               |	РегистрСведений.CW_НастройкиПользователей КАК CW_НастройкиПользователей
	               |ГДЕ
	               |	CW_НастройкиПользователей.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ЗначениеВыбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() тогда
		
		Возврат ложь;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Запись, Выборка,,"Пользователь");
		КонецЕсли;
		
		Возврат истина;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИспользоватьТекущуюДатуКомпьютера = 0 Тогда
		ЗначениеРабочейДатыДляСохранения  = '0001-01-01';
	Иначе
		ЗначениеРабочейДатыДляСохранения  = ЗначениеРабочейДаты;
	КонецЕсли;
	
	CW_Настройки.УстановитьРабочуюДатуПользователя(ЗначениеРабочейДатыДляСохранения);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОтправкиОповещенийПриИзменении(Элемент)
	Элементы.ДекорацияПредупреждение.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура ОтображатьКолонкуФайлыВСпискахПриИзмененииНаСервере() 
	
	Если Не Запись.ОтображатьКолонкуФайлыВСписках Тогда
		Запись.ОтображатьКолонкуФайлы_CW_Заявки = Ложь;
		Запись.ОтображатьКолонкуФайлы_CW_Заказы = Ложь;
		Запись.ОтображатьКолонкуФайлы_CW_Грузоперевозки = Ложь;
	Иначе	
		Запись.ОтображатьКолонкуФайлы_CW_Заявки  = Истина 
		И ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаявок");
		
		Запись.ОтображатьКолонкуФайлы_CW_Заказы  = Истина 
		И ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов") ;
		
		Запись.ОтображатьКолонкуФайлы_CW_Грузоперевозки = Истина;
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.ОтображатьКолонкуФайлы_CW_Заявки.Доступность 			= Запись.ОтображатьКолонкуФайлыВСписках;
	Элементы.ОтображатьКолонкуФайлы_CW_Заказы.Доступность			= Запись.ОтображатьКолонкуФайлыВСписках;
	Элементы.ОтображатьКолонкуФайлы_CW_Грузоперевозки.Доступность	= Запись.ОтображатьКолонкуФайлыВСписках;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьКолонкуФайлыВСпискахПриИзменении(Элемент)
	ОтображатьКолонкуФайлыВСпискахПриИзмененииНаСервере();
КонецПроцедуры

//Рабочая дата
&НаКлиенте
Процедура ИспользоватьТекущуюДатуКомпьютераПриИзменении(Элемент)
	
	Если ИспользоватьТекущуюДатуКомпьютера = 0 Тогда
		ЗначениеРабочейДаты = '0001-01-01';
	ИначеЕсли ИспользоватьТекущуюДатуКомпьютера = 1 Тогда
		ЗначениеРабочейДаты = ТекущаяДата();
	КонецЕсли;
	Модифицированность = Истина;

КонецПроцедуры
//Рабочая дата  

//Фоновое обновление журналов
&НаКлиенте
Процедура ВыполнятьФоновоеОбновлениеЖурналаЗавокПриИзменении(Элемент)
	ВыполнятьФоновоеОбновлениеЖурналаЗавокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнятьФоновоеОбновлениеЖурналаЗавокПриИзмененииНаСервере()
	
	Элементы.ИнтервалФоновогоОбновленияЖурналаЗавок.Доступность = Запись.ВыполнятьФоновоеОбновлениеЖурналаЗавок;  
	Элементы.ПоказыватьОповещениеВыполненияОбновлениеЖурналаЗавок.Доступность = Запись.ВыполнятьФоновоеОбновлениеЖурналаЗавок;  
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнятьФоновоеОбновлениеЖурналаЗаказовПриИзменении(Элемент)
	
	ВыполнятьФоновоеОбновлениеЖурналаЗаказовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнятьФоновоеОбновлениеЖурналаЗаказовПриИзмененииНаСервере()

	Элементы.ИнтервалФоновогоОбновленияЖурналаЗаказов.Доступность = Запись.ВыполнятьФоновоеОбновлениеЖурналаЗаказов;
	Элементы.ПоказыватьОповещениеВыполненияОбновлениеЖурналаЗаказов.Доступность = Запись.ВыполнятьФоновоеОбновлениеЖурналаЗаказов;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнятьФоновоеОбновлениеЖурналаГрузоперевозокПриИзменении(Элемент)
	
	ВыполнятьФоновоеОбновлениеЖурналаГрузоперевозокПриИзмененииНаСервере(); 
	
КонецПроцедуры 

&НаСервере
Процедура ВыполнятьФоновоеОбновлениеЖурналаГрузоперевозокПриИзмененииНаСервере()
	
	Элементы.ИнтервалФоновогоОбновленияЖурналаГрузоперевозок.Доступность = Запись.ВыполнятьФоновоеОбновлениеЖурналаГрузоперевозок;
	Элементы.ПоказыватьОповещениеВыполненияОбновлениеЖурналаГрузоперевозок.Доступность = Запись.ВыполнятьФоновоеОбновлениеЖурналаГрузоперевозок;

КонецПроцедуры
//Фоновое обновление журналов


