&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВладелецСиноним = Объект.Владелец.Метаданные().Синоним;
	Элементы.Владелец.Заголовок = ВладелецСиноним;	 

	//ПараметрыДоступности = CW_МониторинговыеПараметрыСерверПовторноеИспользование.ПолучитьДоступностьПараметра(Объект.Параметр); 
	//
	//ТолькоПросмотр = Не ПараметрыДоступности.Редактирование;
	
	УстановитьВидимостьПланФакт(); 
	
	Элементы.Параметр.ТолькоПросмотр = Не Параметры.Ключ.Пустая();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПараметрПриИзменении(Элемент) 
	
	ПараметрПриИзмененииНаСервере(); 
	
КонецПроцедуры
 
&НаСервере
Процедура ПараметрПриИзмененииНаСервере()
	
	Объект.Наименование = СокрЛП(Объект.Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФакт(Команда)  
	
	Объект.ЗначениеФакт = Объект.ЗначениеПлан;
	
КонецПроцедуры   

&наСервере
Процедура УстановитьВидимостьПланФакт()
	
	Элементы.ГруппаПланФакт.Видимость 	= Объект.Параметр.ЭтоКонтрольнаяДата;
	Элементы.Значение.Видимость 		= Не Объект.Параметр.ЭтоКонтрольнаяДата;
	
КонецПроцедуры


