#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НезаполняемыеПоляСтрокиСделок(ИспользованиеПроисхождениеТовара, ПризнакУчастникаСделки) Экспорт
	
	НезаполняемыеПоля = Новый Массив;
	
	Если ИспользованиеПроисхождениеТовара <> Перечисления.ТипыИспользованияПроисхожденияТовараКонтролируемыхСделок.Иное Тогда
		НезаполняемыеПоля.Добавить("НаименованиеИспользованияПроисхожденияТовара");
	КонецЕсли;
	
	Если Не КонтролируемыеСделкиКлиентСервер.НужноЗаполнятьСведенияОСделкеЛиста1В(ИспользованиеПроисхождениеТовара) Тогда
		НезаполняемыеПоля.Добавить("ДатаСовершенияСделки");
		НезаполняемыеПоля.Добавить("ПризнакУчастникаСделки");
		НезаполняемыеПоля.Добавить("Контрагент");
		НезаполняемыеПоля.Добавить("НомерДоговора");
		НезаполняемыеПоля.Добавить("ДатаДоговора");
		НезаполняемыеПоля.Добавить("КодУсловийПоставки");
		НезаполняемыеПоля.Добавить("Количество");
		НезаполняемыеПоля.Добавить("ЕдиницаИзмерения");
		НезаполняемыеПоля.Добавить("Цена");
		НезаполняемыеПоля.Добавить("Валюта");
		НезаполняемыеПоля.Добавить("Стоимость");
		НезаполняемыеПоля.Добавить("СтранаСовершенияСделки");
		НезаполняемыеПоля.Добавить("ОКТМОСовершенияСделки");
	ИначеЕсли КонтролируемыеСделкиКлиентСервер.ЭтоРозничнаяПродажаЦепочкиСделок(ПризнакУчастникаСделки) Тогда
		НезаполняемыеПоля.Добавить("ДатаСовершенияСделки");
		НезаполняемыеПоля.Добавить("Контрагент");
		НезаполняемыеПоля.Добавить("НомерДоговора");
		НезаполняемыеПоля.Добавить("ДатаДоговора");
		НезаполняемыеПоля.Добавить("КодУсловийПоставки");
		НезаполняемыеПоля.Добавить("Цена");
		НезаполняемыеПоля.Добавить("СтранаСовершенияСделки");
		НезаполняемыеПоля.Добавить("ОКТМОСовершенияСделки");
	КонецЕсли;
	
	Возврат НезаполняемыеПоля;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

