#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("СформироватьЧекАвтоматически", Истина);
	Методы.Вставить("ОбновитьСведенияОСформированныхЧекахНПДВФоне", Истина);
	Методы.Вставить("НачатьОбновлениеСтатусовОфлайнЧековНПД", Истина);
	Методы.Вставить("ОчиститьДатуОбновленияЧековНПД");
	
КонецПроцедуры

// Конструктор структуры параметров для формирования чека.
// См. РегистрыСведений.ЧекиНПД.СформироватьЧекВФоне()
// и РегистрыСведений.ЧекиНПД.СформироватьЧек().
// 
// Возвращаемое значение:
//   - Структура.
//
Функция НовыйПараметрыФормированияЧека() Экспорт
	
	ПараметрыФормирования = Новый Структура;
	ПараметрыФормирования.Вставить("Ссылка", Неопределено);
	ПараметрыФормирования.Вставить("Организация", Неопределено);
	ПараметрыФормирования.Вставить("Контрагент", Неопределено);
	ПараметрыФормирования.Вставить("Дата", '00010101');
	ПараметрыФормирования.Вставить("СуммаДокумента", 0);
	ПараметрыФормирования.Вставить("Услуги", НовыйТаблицаУслуг());
	ПараметрыФормирования.Вставить("АвтоматическаяФискализация", Ложь);
	ПараметрыФормирования.Вставить("ОтправлятьEmail", Ложь);
	ПараметрыФормирования.Вставить("ОтправлятьSMS", Ложь);
	
	Возврат ПараметрыФормирования;
	
КонецФункции

// Возвращает параметры формирования чека.
//
// Параметры:
//   ДокументОснование - ДокументСсылка - ссылка на основание чека.
//   Организация - СправочникСсылка.Организации - ссылка на организацию.
//
// Возвращаемое значение:
//   Структура - см. НовыйПараметрыФормированияЧека()
//
Функция ПараметрыФормированияЧека(ДокументОснование, Организация) Экспорт
	
	ПараметрыЧека = НовыйПараметрыФормированияЧека();
	
	Запрос = Новый Запрос;
	
	ИменаТаблиц = Новый Массив;
	МенеджерОснования = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДокументОснование);
	Запрос.Текст = МенеджерОснования.ТекстЗапросаПараметрыФормированияЧекаНПД(ИменаТаблиц);
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета",
		ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДанныеПечатиЧека = Новый Структура;
	Для Индекс = 0 По ИменаТаблиц.Количество()-1 Цикл
		ИмяТаблицы = ИменаТаблиц[Индекс];
		ТаблицаРезультата = Результат[Индекс].Выгрузить();
		ДанныеПечатиЧека.Вставить(ИмяТаблицы, ТаблицаРезультата);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДанныеПечатиЧека.РеквизитыДокумента) Тогда
		Возврат ПараметрыЧека;
	КонецЕсли;
	РеквизитыДокумента = ДанныеПечатиЧека.РеквизитыДокумента[0];
	ЗаполнитьЗначенияСвойств(ПараметрыЧека, РеквизитыДокумента);
	
	ОплаченныеСчета = ДанныеПечатиЧека.ОплаченныеСчета;
	ОплачиваемаяНоменклатура = ДанныеПечатиЧека.НоменклатураОплаченныхСчетов;
	НоменклатураБезСчетов = ДанныеПечатиЧека.НоменклатураБезСчетов;
	
	ТаблицаУслуг = ПараметрыЧека.Услуги.Скопировать(, "Наименование, Цена");
	ТаблицаУслуг.Колонки.Добавить("НомерТЧ", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаУслуг.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	
	Отбор = Новый Структура("СчетНаОплату");
	Для Каждого ОплачиваемыйДокумент Из ОплаченныеСчета Цикл
		Если Не ЗначениеЗаполнено(ОплачиваемыйДокумент.СуммаОплаты) Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Отбор, ОплачиваемыйДокумент);
		ОплачиваемыеПозицииСчета = ОплачиваемаяНоменклатура.Скопировать(Отбор);
		Если ОплачиваемыеПозицииСчета.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ОплачиваемыйДокумент.РасчетыВУсловныхЕдиницах Тогда
			КурсОплаты = ОплачиваемыйДокумент.СуммаОплаты / ОплачиваемыйДокумент.СуммаВзаиморасчетов;
			ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(
				ОплачиваемыеПозицииСчета.Итог("Сумма") * КурсОплаты, ОплачиваемыеПозицииСчета, "Сумма");
		КонецЕсли;
		СуммаСчета = ОплачиваемыеПозицииСчета.Итог("Сумма");
		Если ОплачиваемыйДокумент.СуммаОплаты <> СуммаСчета Тогда
			МассивСуммыПоСчету = ОбщегоНазначения.ВыгрузитьКолонку(ОплачиваемыеПозицииСчета, "Сумма");
			СуммыДокумента = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
				ОплачиваемыйДокумент.СуммаОплаты, МассивСуммыПоСчету);
			Если СуммыДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОплачиваемыеПозицииСчета.ЗагрузитьКолонку(СуммыДокумента, "Сумма");
		КонецЕсли;
		Для Каждого СтрокаСчета Из ОплачиваемыеПозицииСчета Цикл
			НоваяУслуга = ТаблицаУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяУслуга, СтрокаСчета);
			НоваяУслуга.Цена = СтрокаСчета.Сумма;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаНоменклатуры Из НоменклатураБезСчетов Цикл
		НоваяУслуга = ТаблицаУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяУслуга, СтрокаНоменклатуры);
		Если СтрокаНоменклатуры.Услуга Тогда
			НоваяУслуга.Наименование = РаботаСНоменклатуройКлиентСерверБП.СодержаниеУслуги(
				СтрокаНоменклатуры.Наименование, СтрокаНоменклатуры.ПериодичностьУслуги, РеквизитыДокумента.Дата);
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаУслуг.Итог("Цена") <> РеквизитыДокумента.СуммаДокумента Тогда
		ЦеныУслуг = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаУслуг, "Цена");
		СуммыДокумента = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
			РеквизитыДокумента.СуммаДокумента, ЦеныУслуг);
		Если СуммыДокумента <> Неопределено Тогда
			ТаблицаУслуг.ЗагрузитьКолонку(СуммыДокумента, "Цена");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаУслуг.Наименование КАК Наименование,
	|	ТаблицаУслуг.Цена КАК Цена,
	|	ТаблицаУслуг.НомерТЧ КАК НомерТЧ,
	|	ТаблицаУслуг.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ УслугиНПД
	|ИЗ
	|	&ТаблицаУслуг КАК ТаблицаУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УслугиНПД.Наименование КАК Наименование,
	|	СУММА(УслугиНПД.Цена) КАК Цена,
	|	МАКСИМУМ(УслугиНПД.НомерТЧ) КАК НомерТЧ,
	|	МАКСИМУМ(УслугиНПД.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	УслугиНПД КАК УслугиНПД
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиНПД.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТЧ,
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ТаблицаУслуг", ТаблицаУслуг);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяУслуга = ПараметрыЧека.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяУслуга, Выборка);
		НоваяУслуга.Количество = 1;
	КонецЦикла;
	
	Возврат ПараметрыЧека;
	
КонецФункции

// Возвращает цену услуги НПД для организации.
//
// Параметры:
//  УслугаНПД	 - СправочникСсылка.Номенклатура - Услуга, по которой нужно определить цену.
//  Организация	 - СправочникСсылка.Организация - Организация на НПД, для которой нужно вернуть цену услуги.
//  Дата		 - Дата - Дата, на которую нужно вернуть цену.
// 
// Возвращаемое значение:
//   - Число - цена услуги НПД.
//
Функция ЦенаУслугиНПД(УслугаНПД, Организация, Дата) Экспорт
	
	ДанныеОбъекта = Новый Структура();
	ДанныеОбъекта.Вставить("Дата", Дата);
	ДанныеОбъекта.Вставить("Организация", Организация);
	ДанныеОбъекта.Вставить("СпособЗаполненияЦены", Перечисления.СпособыЗаполненияЦен.ПоПродажнымЦенам);
	ДанныеОбъекта.Вставить("СуммаВключаетНДС", СуммаВключаетНДСДляНПД());
	ДанныеОбъекта.Вставить("СтавкаНДС", Перечисления.СтавкиНДС.БезНДС);
	
	СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОНоменклатуре(
		УслугаНПД, ДанныеОбъекта, Ложь);
	Если СведенияОНоменклатуре = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат СведенияОНоменклатуре.Цена;
	
КонецФункции

// Сохраняет цену услуги НПД при записи документа.
//
// Параметры:
//  Объект	 - ДокументСсылка - Документ, в котором указывается цена НПД.
//             В модуле менеджера данного документа должна быть реализована функция ТекстЗапросаДанныеДляОбновленияЦенДокументов().
// 
Процедура СохранитьЦенуУслугиНПД(Объект) Экспорт
	
	Ценообразование.ОбновитьЦеныНоменклатуры(Объект.Ссылка,
		Перечисления.СпособыЗаполненияЦен.ПоПродажнымЦенам,
		Объект.ВалютаДокумента,
		СуммаВключаетНДСДляНПД());
	
КонецПроцедуры

// Возвращает контактную информацию для отправки чека.
//
// Параметры:
//  Контрагент	 - СправочникСсылка.Контрагенты - Контрагент, для которого возвращается контактная информация.
// 
// Возвращаемое значение:
//   - Структура - контактная информация для отправки чека.
//
Функция ПараметрыОтправкиЧека(Контрагент) Экспорт
	
	ПараметрыОтправки = Новый Структура;
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат ПараметрыОтправки;
	КонецЕсли;
	
	Если ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат ПараметрыОтправки;
	КонецЕсли;
	
	АдресЭлектроннойПочты = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияНаДату(
		Контрагент, Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты);
	
	Если ЗначениеЗаполнено(АдресЭлектроннойПочты.Представление) Тогда
		ПараметрыОтправки.Вставить("АдресЭлектроннойПочты", АдресЭлектроннойПочты.Представление);
	КонецЕсли;
	
	Телефон = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияНаДату(
		Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	
	Если ЗначениеЗаполнено(Телефон.Представление) Тогда
		ПараметрыОтправки.Вставить("НомерТелефона", Телефон.Представление);
	КонецЕсли;
	
	Возврат ПараметрыОтправки;
	
КонецФункции

// Процедура "УстановитьВДинамическомСпискеПредставленияАннулированныхЧеков"
//
// Параметры:
//  Строки - СтрокиДинамическогоСписка - в которых необходимо изменить представление поля "НомерЧека"
//
Процедура УстановитьВДинамическомСпискеПредставленияАннулированныхЧеков(Строки) Экспорт
	
	Если ИнтеграцияСПлатформойСамозанятыеПовтИсп.ДоступнаИнтеграцияСПлатформойСамозанятые() Тогда
		СостояниеАннулирован = Перечисления.СостоянияЧековНПД.Аннулирован;
		Для Каждого Строка Из Строки Цикл
			ДанныеСтроки = Строка.Значение.Данные;
			Если ДанныеСтроки.Состояние = СостояниеАннулирован
				Или ДанныеСтроки.ПроизведенВозвратПоЧеку Тогда
				ДанныеСтроки.НомерЧека = РегистрыСведений.ЧекиНПД.ПредставлениеАннулированногоЧека(
					ДанныеСтроки.НомерЧека, ДанныеСтроки.ДатаАннулированияЧека);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиОбновления

// Удаляет дату обновления чеков НПД из хранилища за ненадобностью
//
Процедура ОчиститьДатуОбновленияЧековНПД() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияБП.УдалитьДанныеИзХранилища(Выборка.Ссылка, "ДатаОбновленияЧековНПД");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НачатьОбновлениеСтатусовОфлайнЧековНПД(Организация) Экспорт
	
	ОфлайнЧеки = РегистрыСведений.ЧекиНПД.ЧекиОжидающиеОтправкуВФНС(Организация);
	
	Если Не ЗначениеЗаполнено(ОфлайнЧеки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыМетода = ИнтеграцияСПлатформойСамозанятыеКлиентСервер.НовыеПараметрыМетодаВзаимодействия("СтатусыЧеков");
	ПараметрыМетода.Организация = Организация;
	ПараметрыМетода.Чеки = ОфлайнЧеки;
	
	Запрос = ИнтеграцияСПлатформойСамозанятые.ВыполнитьМетодВзаимодействия(ПараметрыМетода);
	
	РезультатЗапроса = Неопределено;
	ТекстОшибки = "";
	
	Если Не Запрос.Ошибка Тогда
		ИнтеграцияСПлатформойСамозанятые.ПолучитьРезультатВыполненияФункцииВФоне(Запрос, РезультатЗапроса, ТекстОшибки);
	Иначе
		ТекстОшибки = Запрос.Сообщение;
		КомментарийЖурналаРегистрации = СтрШаблон(
			НСтр("ru = 'При обновлении статусов офлайн чеков возникла ошибка: %1'"),
			ТекстОшибки);
		ЗаписьЖурналаРегистрации(ИнтеграцияСПлатформойСамозанятыеКлиентСервер.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			КомментарийЖурналаРегистрации);
	КонецЕсли;
	
	Результат = Неопределено;
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если РезультатЗапроса <> Неопределено
		И ТипЗнч(РезультатЗапроса) = Тип("Структура") Тогда
		
		Результат = ИзменитьСтатусыОфлайнЧеков(Организация, РезультатЗапроса);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьСведенияОСформированныхЧекахНПДВФоне(ПараметрыОбновления) Экспорт
	
	ПараметрыМетода = ИнтеграцияСПлатформойСамозанятыеКлиентСервер.НовыеПараметрыМетодаВзаимодействия("СписокАннулированныхЧеков");
	ПараметрыМетода.Организация = ПараметрыОбновления.Организация;
	ПараметрыМетода.НачалоПериода = ПараметрыОбновления.НачалоПериода;
	ПараметрыМетода.КонецПериода = ПараметрыОбновления.КонецПериода;
	
	Запрос = ИнтеграцияСПлатформойСамозанятые.ВыполнитьМетодВзаимодействия(ПараметрыМетода);
	
	РезультатЗапроса = Неопределено;
	ТекстОшибки = "";
	
	Если Не Запрос.Ошибка Тогда
		ИнтеграцияСПлатформойСамозанятые.ПолучитьРезультатВыполненияФункцииВФоне(Запрос, РезультатЗапроса, ТекстОшибки);
	Иначе
		ТекстОшибки = Запрос.Сообщение;
		КомментарийЖурналаРегистрации = СтрШаблон(
			НСтр("ru = 'При обновлении сведений о чеках возникла ошибка: %1'"),
			ТекстОшибки);
		ЗаписьЖурналаРегистрации(ИнтеграцияСПлатформойСамозанятыеКлиентСервер.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			КомментарийЖурналаРегистрации);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстОшибки", ТекстОшибки);
	Результат.Вставить("НомераОбновленныхЧеков", Неопределено);
	
	Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПоследняяДатаАннулирования = Неопределено;
	
	Если РезультатЗапроса <> Неопределено
		И ТипЗнч(РезультатЗапроса) = Тип("Структура")
		И ЗначениеЗаполнено(РезультатЗапроса.СписокАннулированныхЧеков) Тогда
		
		ПараметрыОбновления.СписокАннулированныхЧеков = РезультатЗапроса.СписокАннулированныхЧеков;
		Результат.НомераОбновленныхЧеков = РегистрыСведений.ЧекиНПД.ОбновитьЧекиПоСпискуАннулированныхВФоне(
			ПараметрыОбновления);
		
		РезультатЗапроса.СписокАннулированныхЧеков.Сортировать("ДатаАннулирования Убыв");
		ПоследняяДатаАннулирования = РезультатЗапроса.СписокАннулированныхЧеков[0].ДатаАннулирования;
	КонецЕсли;
	
	Если ПоследняяДатаАннулирования <> Неопределено Тогда
		РегистрыСведений.ПараметрыАннулированныхЧековМойНалог.ОбновитьДатуОкончания(
			ПараметрыОбновления.Организация, ПоследняяДатаАннулирования);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаОбновленияСформированныхЧековНПД(Организация) Экспорт
	
	Возврат РегистрыСведений.ПараметрыАннулированныхЧековМойНалог.ДатаОкончания(Организация);
	
КонецФункции

Процедура СформироватьЧекАвтоматически(ПараметрыФормированияЧекаНПД) Экспорт
	
	РегистрыСведений.ЧекиНПД.СформироватьЧекАвтоматически(ПараметрыФормированияЧекаНПД);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СуммаВключаетНДСДляНПД()
	
	Возврат Истина;
	
КонецФункции

Функция НовыйТаблицаУслуг()
	
	ТаблицаУслуг = Новый ТаблицаЗначений;
	ТаблицаУслуг.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТаблицаУслуг.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	ТаблицаУслуг.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Возврат ТаблицаУслуг;
	
КонецФункции

Функция ИзменитьСтатусыОфлайнЧеков(Организация, СведенияОЧеках)
	
	ОбновленныеОфлайнЧеки = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СведенияОЧеках) Тогда
		Возврат ОбновленныеОфлайнЧеки;
	КонецЕсли;
	
	СтатусыЧеков = ИнтеграцияСПлатформойСамозанятыеКлиентСервер.СтатусыЧеков();
	
	Для Каждого СведенияОЧеке Из СведенияОЧеках.СтатусыЧеков Цикл
		
		Если Не СведенияОЧеке.ЧекOffLine Тогда
			Продолжить; // Обрабатываем только офлайн чеки.
		КонецЕсли;
		
		Если ВРег(СведенияОЧеке.Статус) = ВРег(СтатусыЧеков.ОжидаетОтправкиВФНС) Тогда
			Продолжить; // Статус не изменился. Чек по-прежнему не передан в ФНС.
		КонецЕсли;
		
		РегистрыСведений.ЧекиНПД.ОбновитьОфлайнЧекВФоне(Организация, СведенияОЧеке);
		
		ОбновленныеОфлайнЧеки.Добавить(СведенияОЧеке.ИдентификаторЧека);
		
	КонецЦикла;
	
	Возврат ОбновленныеОфлайнЧеки;
	
КонецФункции

#КонецОбласти
