
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВходящийОтборПоОрганизации = Ложь;
	СтруктураОтбора = Неопределено;
	
	Если Параметры.Свойство("Отбор", СтруктураОтбора) И ЗначениеЗаполнено(СтруктураОтбора) Тогда
		ВходящийОтборПоОрганизации = СтруктураОтбора.Свойство("Организация", ОтборОрганизация);
		ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	КонецЕсли;
	
	ОсновнаяОрганизация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Если Не ВходящийОтборПоОрганизации И ОтборОрганизация <> ОсновнаяОрганизация Тогда
		ОтборОрганизация              = ОсновнаяОрганизация;
		ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	КонецЕсли;
	
	ЗаполнитьСтатусыРасчетов();
	УстановитьСвойстваДинамическогоСписка();
	ЗаполнитьСписокВыбораСтатуса();
	
	УстановитьВосстановленныеОтборы();
	НастроитьОтборСтатус();
	
	УправлениеФормой(ЭтотОбъект);
	
	ГруппаКонтекстноеМенюСоздатьНаОсновании = Элементы.Список.КонтекстноеМеню.ПодчиненныеЭлементы.Найти(
		"СписокКонтекстноеМенюСоздатьНаОсновании");
	Если ГруппаКонтекстноеМенюСоздатьНаОсновании <> Неопределено Тогда
		ГруппаКонтекстноеМенюСоздатьНаОсновании.Видимость = Ложь;
	КонецЕсли;
	
	Поля = Новый Массив;
	Поля.Добавить("Сотрудники");
	Поля.Добавить("ПредставлениеСтатуса");
	Список.УстановитьОграниченияИспользованияВГруппировке(Поля);
	Список.УстановитьОграниченияИспользованияВОтборе(Поля);
	Список.УстановитьОграниченияИспользованияВПорядке(Поля);
	
	УстановитьУсловноеОформление();
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ОтборСтатус.ПодсказкаВвода = НСтр("ru = 'Все статусы'");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("Подключаемый_АУСН", 0.1, Истина);
	ПодключитьОбработчикОжидания("Подключаемый_ЛКАУСН", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОсновнаяОрганизация = Параметр;
		Если ОсновнаяОрганизация <> ОтборОрганизация Тогда
			ОтборОрганизация              = ОсновнаяОрганизация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
			УстановитьВосстановленныеОтборы();
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = ИнтеграцияАУСНКлиент.ИмяСобытияОбменССервисом() Тогда
		Элементы.Список.Обновить();
	ИначеЕсли ИмяСобытия = ИнтеграцияАУСНКлиент.ИмяСобытияИзмененоСостояние() Тогда
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	СтруктураОтбора = Неопределено;
	Если Параметры.Свойство("Отбор", СтруктураОтбора) И ЗначениеЗаполнено(СтруктураОтбора) Тогда
		
		Если СтруктураОтбора.Свойство("Организация") И ЗначениеЗаполнено(СтруктураОтбора.Организация) Тогда
			ОтборОрганизация = СтруктураОтбора.Организация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
			Параметры.Отбор.Удалить("Организация");
		КонецЕсли;
	Иначе
		Если ОтборОрганизация <> ОсновнаяОрганизация Тогда
			ОтборОрганизация = ОсновнаяОрганизация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		ИначеЕсли Не ОтборОрганизацияИспользование Тогда
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВосстановленныеОтборы();
	НастроитьОтборСтатус();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСтатусИспользованиеПриИзменении(Элемент)
	
	НастроитьОтборСтатус();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	
	ОтборСтатусИспользование = ЗначениеЗаполнено(ОтборСтатус);
	НастроитьОтборСтатус();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПлатежныйДокумент", ВыбраннаяСтрока);
	ОткрытьФорму("Документ.СписаниеСРасчетногоСчета.Форма.ФормаРасчетНДФЛАУСНПоДокументу", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Если Строки.Количество() > 0 Тогда
		ПредставлениеСотрудников = ПредставлениеСотрудниковПоВедомостям(Строки.ПолучитьКлючи());
		
		Для Каждого Строка Из Строки Цикл
			ДанныеСтроки = Строка.Значение.Данные;
			ТекущееПредставление = ПредставлениеСотрудников[Строка.Ключ];
			Если ТекущееПредставление <> Неопределено Тогда
				ДанныеСтроки.Сотрудники = ПредставлениеСотрудников[Строка.Ключ];
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	ОтборыСписков.СброситьИспользованиеПользовательскихОтборовВНастройке(Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ИнтеграцияАУСНКлиент.ВыполнитьОбменССервисом(ЭтотОбъект, Истина);
	ИнтеграцияАУСНКлиент.ВыполнитьОбменССервисомЛКАУСН(ЭтотОбъект, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВосстановленныеОтборы()
	
	ОтборыСписковКлиентСервер.УстановитьБыстрыйОтбор(ЭтотОбъект, "Организация");
	
КонецПроцедуры
	
&НаСервере
Процедура НастроитьОтборСтатус()
	
	ПоискСтатуса = Новый Структура("КлючСтроки", ОтборСтатус);
	СтрокаСтатуса = СтатусыРасчетов.НайтиСтроки(ПоискСтатуса);
	Если СтрокаСтатуса.Количество() > 0 Тогда
		Статус = СтрокаСтатуса[0].Статус;
	Иначе
		Статус = Неопределено;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Проведен",
		ОтборСтатус <> СтатусНеПроведен() И Статус <> Неопределено,
		ВидСравненияКомпоновкиДанных.Равно,,
		ОтборСтатусИспользование,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,
		"ОтборПоСтатусуНеПроведен");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Статус",
		Статус,
		?(Статус = Неопределено, ВидСравненияКомпоновкиДанных.Заполнено, ВидСравненияКомпоновкиДанных.Равно),,
		ОтборСтатусИспользование,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,
		"ОтборПоСтатусуСтатус");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеСотрудниковПоВедомостям(СписокДокументов)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеСРасчетногоСчета.Ссылка КАК Ссылка,
	|	СписаниеСРасчетногоСчетаПеречислениеЗаработнойПлаты.Ведомость КАК Ведомость,
	|	НЕОПРЕДЕЛЕНО КАК ФизическоеЛицо,
	|	СписаниеСРасчетногоСчета.Дата КАК Дата
	|ПОМЕСТИТЬ Ведомости
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета.ПеречислениеЗаработнойПлаты КАК СписаниеСРасчетногоСчетаПеречислениеЗаработнойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|		ПО СписаниеСРасчетногоСчетаПеречислениеЗаработнойПлаты.Ссылка = СписаниеСРасчетногоСчета.Ссылка
	|ГДЕ
	|	СписаниеСРасчетногоСчета.Ссылка В(&СписокДокументов)
	|	И СписаниеСРасчетногоСчета.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗП), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеСотрудникамПоДоговорамПодряда))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеСРасчетногоСчета.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	СписаниеСРасчетногоСчета.Контрагент,
	|	СписаниеСРасчетногоСчета.Дата
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
	|ГДЕ
	|	СписаниеСРасчетногоСчета.Ссылка В(&СписокДокументов)
	|	И СписаниеСРасчетногоСчета.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗаработнойПлатыРаботнику), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеСотрудникуПоДоговоруПодряда))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ведомость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ведомости.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ВедомостьНаВыплатуЗарплатыВБанк.КраткийСоставДокумента, """") КАК КраткийСоставДокумента,
	|	Ведомости.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Ведомости.Дата КАК Дата
	|ИЗ
	|	Ведомости КАК Ведомости
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыВБанк КАК ВедомостьНаВыплатуЗарплатыВБанк
	|		ПО Ведомости.Ведомость = ВедомостьНаВыплатуЗарплатыВБанк.Ссылка";
	
	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущееПредставление = "";
		Если ЗначениеЗаполнено(Выборка.КраткийСоставДокумента) Тогда
			ТекущееПредставление = Выборка.КраткийСоставДокумента;
		ИначеЕсли ЗначениеЗаполнено(Выборка.ФизическоеЛицо) Тогда
			ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Неопределено, Выборка.ФизическоеЛицо, Выборка.Дата, Истина);
			ТекущееПредставление = ДанныеФизЛица.Представление;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекущееПредставление) Тогда
			Продолжить;
		КонецЕсли;
		Представление = Результат[Выборка.Ссылка];
		Если Представление = Неопределено Тогда
			Представление = "";
		КонецЕсли;
		Если Не ПустаяСтрока(Представление) Тогда
			Представление = СтрШаблон("%1, %2", Представление, ТекущееПредставление);
			МассивПредставлений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Представление, ", ");
			ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивПредставлений);
			Представление = СтрСоединить(МассивПредставлений, ", ");
		Иначе
			Представление = ТекущееПредставление;
		КонецЕсли;
		Результат[Выборка.Ссылка] = Представление;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Организация
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Организация");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборОрганизацияИспользование", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборОрганизация", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// ПредставлениеСтатуса
	
	СтатусыРасчетовНДФЛ = Перечисления.СтатусыРасчетовНДФЛАУСН;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПредставлениеСтатуса");
	ГруппаОтбораИли = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
		ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИли,
		"Список.Статус", ВидСравненияКомпоновкиДанных.Равно, СтатусыРасчетовНДФЛ.Отклонен);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИли,
		"Список.Статус", ВидСравненияКомпоновкиДанных.Равно, СтатусыРасчетовНДФЛ.ОшибкаПриОтправке);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаОтрицательногоЗначения);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПредставлениеСтатуса");
	ГруппаОтбораИли = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
		ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИли,
		"Список.Статус", ВидСравненияКомпоновкиДанных.Равно, СтатусыРасчетовНДФЛ.ПереданВБанк);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИли,
		"Список.Статус", ВидСравненияКомпоновкиДанных.Равно, СтатусыРасчетовНДФЛ.ПереданВФНС);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИли,
		"Список.Статус", ВидСравненияКомпоновкиДанных.Равно, СтатусыРасчетовНДФЛ.Принят);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаПоложительногоЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_АУСН() Экспорт

	ИнтеграцияАУСНКлиент.ВыполнитьОбменССервисом(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЛКАУСН() Экспорт

	ИнтеграцияАУСНКлиент.ВыполнитьОбменССервисомЛКАУСН(ЭтотОбъект);

КонецПроцедуры

&НаСервереБезКонтекста
Функция МожноПередаватьНДФЛАУСН(Организация)
	
	Возврат ПравоДоступа("Редактирование", Метаданные.Документы.СписаниеСРасчетногоСчета)
		И РегистрыСведений.СостоянияИнтеграцииАУСН.МожемПередатьНДФЛИзПрограммы(Организация);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Организация = ?(Форма.ОтборОрганизацияИспользование, Форма.ОтборОрганизация, Неопределено);
	МожноПередаватьНДФЛАУСН = МожноПередаватьНДФЛАУСН(Организация);
	
	Элементы.ФормаВыполнитьОбмен.Видимость = МожноПередаватьНДФЛАУСН;
	Элементы.ФормаОбновить.ПоложениеВКоманднойПанели = ?(МожноПередаватьНДФЛАУСН,
		ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю,
		ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораСтатуса()
	
	СписокВыбора = Элементы.ОтборСтатус.СписокВыбора;
	СписокВыбора.Очистить();
	
	Для Каждого СтрокаСтатуса Из СтатусыРасчетов Цикл
		СписокВыбора.Добавить(СтрокаСтатуса.КлючСтроки, СтрокаСтатуса.ПредставлениеСтатуса);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыРасчетов()
	
	СтатусыРасчетовНДФЛ = Перечисления.СтатусыРасчетовНДФЛАУСН;
	
	СтатусыРасчетов.Очистить();
	ДобавитьСтатусРасчетов(СтатусНеПроведен(), СтатусыРасчетовНДФЛ.ПустаяСсылка(), ПредставлениеСтатусаНеПроведен());
	ДобавитьСтатусРасчетов(СтатусПустаяСсылка(), СтатусыРасчетовНДФЛ.ПустаяСсылка(), ПредставлениеПустогоСтатуса());
	
	КоллекцияМетаданных = Метаданные.Перечисления.СтатусыРасчетовНДФЛАУСН.ЗначенияПеречисления;
	
	Для Индекс = 0 По КоллекцияМетаданных.Количество() - 1 Цикл
		ЗначениеПеречисления = СтатусыРасчетовНДФЛ.Получить(Индекс);
		ПредставлениеСтатуса = Перечисления.СтатусыРасчетовНДФЛАУСН.ПредставлениеСтатуса(ЗначениеПеречисления);
		ДобавитьСтатусРасчетов(КоллекцияМетаданных[Индекс].Имя, ЗначениеПеречисления, ПредставлениеСтатуса);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтатусРасчетов(КлючСтроки, Статус, ПредставлениеСтатуса)
	
	НоваяСтрока = СтатусыРасчетов.Добавить();
	НоваяСтрока.КлючСтроки = КлючСтроки;
	НоваяСтрока.Статус = Статус;
	НоваяСтрока.ПредставлениеСтатуса = ПредставлениеСтатуса;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтатусНеПроведен()
	
	Возврат "НеПроведен";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтатусПустаяСсылка()
	
	Возврат "ПустаяСсылка";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеСтатусаНеПроведен()
	
	СтатусыРасчетовНДФЛ = Перечисления.СтатусыРасчетовНДФЛАУСН;
	Возврат СтатусыРасчетовНДФЛ.ПредставлениеСтатуса(СтатусыРасчетовНДФЛ.ПустаяСсылка(), Ложь);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеПустогоСтатуса()
	
	СтатусыРасчетовНДФЛ = Перечисления.СтатусыРасчетовНДФЛАУСН;
	Возврат СтатусыРасчетовНДФЛ.ПредставлениеСтатуса(СтатусыРасчетовНДФЛ.ПустаяСсылка());

КонецФункции

&НаСервере
Процедура УстановитьСвойстваДинамическогоСписка()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДокументСписаниеСРасчетногоСчета.Ссылка КАК Ссылка,
	|	ДокументСписаниеСРасчетногоСчета.ПометкаУдаления КАК ПометкаУдаления,
	|	ДокументСписаниеСРасчетногоСчета.Номер КАК Номер,
	|	ДокументСписаниеСРасчетногоСчета.Дата КАК Дата,
	|	ДокументСписаниеСРасчетногоСчета.Проведен КАК Проведен,
	|	ДокументСписаниеСРасчетногоСчета.ВидОперации КАК ВидОперации,
	|	ДокументСписаниеСРасчетногоСчета.Организация КАК Организация,
	|	ДокументСписаниеСРасчетногоСчета.СчетОрганизации КАК СчетОрганизации,
	|	ДокументСписаниеСРасчетногоСчета.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ДокументСписаниеСРасчетногоСчета.СчетБанк КАК СчетБанк,
	|	ДокументСписаниеСРасчетногоСчета.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ДокументСписаниеСРасчетногоСчета.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ДокументСписаниеСРасчетногоСчета.Контрагент КАК Контрагент,
	|	ДокументСписаниеСРасчетногоСчета.СчетКонтрагента КАК СчетКонтрагента,
	|	ДокументСписаниеСРасчетногоСчета.СуммаДокумента КАК СуммаДокумента,
	|	ДокументСписаниеСРасчетногоСчета.СчетУчетаРасчетовСКонтрагентом КАК СчетУчетаРасчетовСКонтрагентом,
	|	ДокументСписаниеСРасчетногоСчета.СубконтоДт1 КАК СубконтоДт1,
	|	ДокументСписаниеСРасчетногоСчета.СубконтоДт2 КАК СубконтоДт2,
	|	ДокументСписаниеСРасчетногоСчета.СубконтоДт3 КАК СубконтоДт3,
	|	ДокументСписаниеСРасчетногоСчета.ПодразделениеДт КАК ПодразделениеДт,
	|	ДокументСписаниеСРасчетногоСчета.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДокументСписаниеСРасчетногоСчета.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ДокументСписаниеСРасчетногоСчета.Ответственный КАК Ответственный,
	|	ДокументСписаниеСРасчетногоСчета.Комментарий КАК Комментарий,
	|	ДокументСписаниеСРасчетногоСчета.ДокументОснование КАК ДокументОснование,
	|	ДокументСписаниеСРасчетногоСчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументСписаниеСРасчетногоСчета.ВалютаДокумента КАК ВалютаДокумента,
	|	ДокументСписаниеСРасчетногоСчета.ОтражениеВУСН КАК ОтражениеВУСН,
	|	ДокументСписаниеСРасчетногоСчета.Содержание_УСН КАК Содержание_УСН,
	|	ДокументСписаниеСРасчетногоСчета.Графа4_УСН КАК Графа4_УСН,
	|	ДокументСписаниеСРасчетногоСчета.Графа5_УСН КАК Графа5_УСН,
	|	ДокументСписаниеСРасчетногоСчета.Графа6_УСН КАК Графа6_УСН,
	|	ДокументСписаниеСРасчетногоСчета.Графа7_УСН КАК Графа7_УСН,
	|	ДокументСписаниеСРасчетногоСчета.ДоходыЕНВД_УСН КАК ДоходыЕНВД_УСН,
	|	ДокументСписаниеСРасчетногоСчета.НДС_УСН КАК НДС_УСН,
	|	ДокументСписаниеСРасчетногоСчета.РучнаяКорректировка КАК РучнаяКорректировка,
	|	ДокументСписаниеСРасчетногоСчета.НеПодтвержденоВыпискойБанка КАК НеПодтвержденоВыпискойБанка,
	|	ДокументСписаниеСРасчетногоСчета.НалоговыйПериод КАК НалоговыйПериод,
	|	ДокументСписаниеСРасчетногоСчета.ПлатежнаяВедомость КАК ПлатежнаяВедомость,
	|	ДокументСписаниеСРасчетногоСчета.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ДокументСписаниеСРасчетногоСчета.РучнаяКорректировка = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументСписаниеСРасчетногоСчета.ПометкаУдаления = ИСТИНА
	|						ТОГДА 10
	|					КОГДА ДокументСписаниеСРасчетногоСчета.Проведен = ЛОЖЬ
	|						ТОГДА 9
	|					ИНАЧЕ 8
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументСписаниеСРасчетногоСчета.ПометкаУдаления = ИСТИНА
	|					ТОГДА 2
	|				КОГДА ДокументСписаниеСРасчетногоСчета.Проведен = ИСТИНА
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СостояниеДокумента,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК Сотрудники,
	|	ДокументыНДФЛАУСН.Статус КАК Статус,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ПредставлениеСтатуса,
	|	"""" КАК Отступ
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК ДокументСписаниеСРасчетногоСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыНДФЛАУСН КАК ДокументыНДФЛАУСН
	|		ПО ДокументСписаниеСРасчетногоСчета.Ссылка = ДокументыНДФЛАУСН.Документ
	|			И ДокументСписаниеСРасчетногоСчета.Организация = ДокументыНДФЛАУСН.Организация";
	
	СписокПараметров = Новый СписокЗначений;
	
	ВыборСтатуса = "ВЫБОР";
	
	Для Каждого СтрокаСтатуса Из СтатусыРасчетов Цикл
		Если СтрокаСтатуса.КлючСтроки = СтатусНеПроведен() Тогда
			ВыборСтатуса = СтрШаблон(
			"%1
			|	КОГДА НЕ ДокументСписаниеСРасчетногоСчета.Проведен
			|		ТОГДА ""%2""",
			ВыборСтатуса,
			СтрокаСтатуса.ПредставлениеСтатуса);
		Иначе
			ВыборСтатуса = СтрШаблон(
			"%1
			|	КОГДА ДокументыНДФЛАУСН.Статус = &Статус%2
			|		ТОГДА ""%3""",
			ВыборСтатуса,
			СтрокаСтатуса.КлючСтроки,
			СтрокаСтатуса.ПредставлениеСтатуса);
			СписокПараметров.Добавить(СтрокаСтатуса.Статус, СтрШаблон("Статус%1", СтрокаСтатуса.КлючСтроки));
		КонецЕсли;
	КонецЦикла;
	
	ВыборСтатуса = СтрШаблон("%1
	|	ИНАЧЕ """"
	|КОНЕЦ",
	ВыборСтатуса);
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПоляЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля;
	ПоляЗапроса.Добавить(ВыборСтатуса, ПоляЗапроса.Количество() - 2);
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ТекстЗапроса                 = ТекстЗапроса;
	СвойстваСписка.ОсновнаяТаблица              = "Документ.СписаниеСРасчетногоСчета";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	Для Каждого Параметр Из СписокПараметров Цикл
		Список.Параметры.УстановитьЗначениеПараметра(Параметр.Представление, Параметр.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
