#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьСоответствиеКартикиТипуЗначения() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Тип("СправочникСсылка.CW_Заказы"), 			БиблиотекаКартинок.CW_Коробка);
	Результат.Вставить(Тип("СправочникСсылка.CW_Грузоперевозки"), 	БиблиотекаКартинок.CW_Грузоперевозки);
	
	//При расширении типов доступныых объектво статустов добавить соответствие картинки
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеИмениМакетаТипуЗначения() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Тип("СправочникСсылка.CW_Заказы"), 			"МакетОтбораДляЗаказа");
	Результат.Вставить(Тип("СправочникСсылка.CW_Грузоперевозки"), 	"МакетОтбораДляГрузоперевозки");
	
	//При расширении типов доступныых объектво статустов добавить соответствие картинки
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеНеопредленногоСтатуса() Экспорт
	
	Результат = Новый Соответствие;
	
	Результат.Вставить(Тип("СправочникСсылка.CW_Заказы"), 			ПредопределенноеЗначение("Справочник.CW_ФинансовыеСтатусы.Заказы_НеОпределен"));
	Результат.Вставить(Тип("СправочникСсылка.CW_Грузоперевозки"), 	ПредопределенноеЗначение("Справочник.CW_ФинансовыеСтатусы.Грузоперевозки_НеОпределен"));
	
	//При расширении типов доступныых объектво статустов добавить соответствие картинки
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьФинансовыеСтатусыОбъекта(ТипОбъекта, мИспользуемыеСтатусы) Экспорт
	
	ИдентифкаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ФинансовыеСтатусы.Ссылка КАК Ссылка,
	               |	CW_ФинансовыеСтатусы.СсылкаКартинки КАК СсылкаКартинки,
	               |	CW_ФинансовыеСтатусы.Наименование КАК Наименование,
	               |	CW_ФинансовыеСтатусы.Ссылка В (&мИспользуемыеСтатусы) КАК Использование
	               |ИЗ
	               |	Справочник.CW_ФинансовыеСтатусы КАК CW_ФинансовыеСтатусы
	               |ГДЕ
	               |	CW_ФинансовыеСтатусы.ИдентификаторОбъекта = &ИдентифкаторОбъекта
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ФинансовыеСтатусы.Код
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ИдентифкаторОбъекта",  ИдентифкаторОбъекта);
	Запрос.УстановитьПараметр("мИспользуемыеСтатусы", мИспользуемыеСтатусы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Возврат Выборка;
	
КонецФункции
	

//Служебные процедуры
Процедура ЗаполнитьПредпоределенныеОбъекты(ЛогистическийСтатусСсылка, ТипОбъекта) Экспорт
	
	Если ЛогистическийСтатусСсылка <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ЛогистическийСтатусСсылка.ИдентификаторОбъекта) Тогда
			
			ИдентифкаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
			
			ЛогистическийСтатусОбъект 						= ЛогистическийСтатусСсылка.ПолучитьОбъект();
			ЛогистическийСтатусОбъект.ИдентификаторОбъекта 	= ИдентифкаторОбъекта;
			ЛогистическийСтатусОбъект.Записать();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанныеСправочника() Экспорт
	
	Справочники.CW_ФинансовыеСтатусы.ЗаполнитьПредпоределенныеОбъекты(ПредопределенноеЗначение("Справочник.CW_ФинансовыеСтатусы.Грузоперевозки_НеОпределен"),	Тип("СправочникСсылка.CW_Грузоперевозки"));
	Справочники.CW_ФинансовыеСтатусы.ЗаполнитьПредпоределенныеОбъекты(ПредопределенноеЗначение("Справочник.CW_ФинансовыеСтатусы.Заказы_НеОпределен"),			Тип("СправочникСсылка.CW_Заказы"));
	
КонецПроцедуры
//Служебные процедуры

#КонецЕсли
