
Процедура ПередЗаписью(Отказ)
	
	Если Не ПроверитьУникальностьКода() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Код не уникальный!",,"Объект.Код",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьУникальностьКода()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ФинансовыеСтатусы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ФинансовыеСтатусы КАК CW_ФинансовыеСтатусы
	               |ГДЕ
	               |	CW_ФинансовыеСтатусы.Код = &Код
	               |	И CW_ФинансовыеСтатусы.Ссылка <> &Ссылка
	               |	И CW_ФинансовыеСтатусы.ИдентификаторОбъекта = &ИдентификаторОбъекта";
	
	Запрос.УстановитьПараметр("Код",					Код);
	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", 	ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьНовыйКод()
	
	НовыйКод = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ФинансовыеСтатусы.Ссылка КАК Ссылка,
	               |	CW_ФинансовыеСтатусы.Код КАК Код
	               |ИЗ
	               |	Справочник.CW_ФинансовыеСтатусы КАК CW_ФинансовыеСтатусы
	               |ГДЕ
	               |	CW_ФинансовыеСтатусы.ИдентификаторОбъекта = &ИдентификаторОбъекта
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код УБЫВ";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выбрка = РезультатЗапроса.Выбрать();
	Если Выбрка.Следующий() Тогда
		Возврат Выбрка.Код + 1;
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	Код = ПолучитьНовыйКод();
	
КонецПроцедуры
