&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НаборКонстант.CW_БазоваяВерсияБюджета.Пустая() Тогда
		НаборКонстант.CW_БазоваяВерсияБюджета = ПредопределенноеЗначение("Справочник.CW_ВерсииБюджетов.Основная");
	КонецЕсли; 
	Если НаборКонстант.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.Пустая() Тогда
		НаборКонстант.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета = ПредопределенноеЗначение("Перечисление.CW_ВариантРасчетаРублевойСуммыНДССтатейБюджета.РасчетОтРублевойСуммыВсего");
	КонецЕсли;   
	
	ЗаполнитьПараметрыОтбораСтатей();

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаФормы(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыОтбораСтатей()
	
	СоответствиеПредставлений 	= ПолучитьСоответствиеПредставленийПараметровОтбораСтатейБюджета();
	ПорядокПараметровОтбора 	= ПолучитьПорядокПараметровОтбораСтатейБюджетаДляДокументов();
	
	НастройкиОтбораДоходов = CW_Бюджетирование.ПолучитьЗначенияПараметровОтбора("CW_ПараметрыОтбораДоходов");
	Для Каждого КлючЗначение из НастройкиОтбораДоходов Цикл
		НоваяСтрока = ПараметрыОтбораДоходов.Добавить();
		НоваяСтрока.Флаг 					= КлючЗначение.Значение;
		НоваяСтрока.ИмяПараметра 			= КлючЗначение.Ключ;
		НоваяСтрока.ПредставлениеПараметра 	= СоответствиеПредставлений[КлючЗначение.Ключ];
		НоваяСтрока.Порядок 				= ПорядокПараметровОтбора[КлючЗначение.Ключ];
	КонецЦикла;   
	ПараметрыОтбораДоходов.Сортировать("Порядок");
	
	НастройкиОтбораРасходов = CW_Бюджетирование.ПолучитьЗначенияПараметровОтбора("CW_ПараметрыОтбораРасходов");
	Для Каждого КлючЗначение из НастройкиОтбораРасходов Цикл
		НоваяСтрока = ПараметрыОтбораРасходов.Добавить();
		НоваяСтрока.Флаг 					= КлючЗначение.Значение;
		НоваяСтрока.ИмяПараметра 			= КлючЗначение.Ключ;
		НоваяСтрока.ПредставлениеПараметра 	= СоответствиеПредставлений[КлючЗначение.Ключ];
		НоваяСтрока.Порядок 				= ПорядокПараметровОтбора[КлючЗначение.Ключ];
	КонецЦикла;
	ПараметрыОтбораРасходов.Сортировать("Порядок");
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыОтбораДоходовФлагПриИзменении(Элемент)  
	ТекущаяСтрока = Элементы.ПараметрыОтбораДоходов.ТекущаяСтрока;
	ЗаписатьПараметрыОтбораНаСервере(ТекущаяСтрока, "ПараметрыОтбораДоходов", "CW_ПараметрыОтбораДоходов");
КонецПроцедуры 

&НаКлиенте
Процедура ПараметрыОтбораРасходовФлагПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ПараметрыОтбораРасходов.ТекущаяСтрока;
	ЗаписатьПараметрыОтбораНаСервере(ТекущаяСтрока, "ПараметрыОтбораРасходов", "CW_ПараметрыОтбораРасходов");
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыОтбораНаСервере(ТекущаяСтрока, ИмяТаблицы, ИмяКонстанты)
	
	СоответствиеПараметров = CW_Бюджетирование.ПолучитьЗначенияПараметровОтбора(ИмяКонстанты);
	
	СтрокаТекущая = ЭтаФорма[ИмяТаблицы].НайтиПоИдентификатору(ТекущаяСтрока);
	
	СоответствиеПараметров.Вставить(СтрокаТекущая.ИмяПараметра, СтрокаТекущая.Флаг);
	
	CW_Бюджетирование.УстановитьЗначенияПараметровОтбора(ИмяКонстанты, СоответствиеПараметров); 

КонецПроцедуры  

&НаСервере
Функция ПолучитьСоответствиеПредставленийПараметровОтбораСтатейБюджета() 
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Организация", 		"учитывать организацию");
	Соответствие.Вставить("Контрагент", 		"учитывать контрагента");
  	Соответствие.Вставить("Договор", 			"учитывать договор");  
	Соответствие.Вставить("Валюта", 			"учитывать валюту");
	Соответствие.Вставить("Номенклатура", 		"учитывать номенклатуру");
	Соответствие.Вставить("ПорядокОтражения", 	"учитывать порядок отражения");
	Соответствие.Вставить("СтавкаНДС",			"учитывать ставку НДС");
	Соответствие.Вставить("СуммаВсего", 		"учитывать сумму ""Всего""");
	Соответствие.Вставить("СтатьяИспользуетсяОднократно", "статья не используется в документах");
	
	Если ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам") Тогда
		Соответствие.Вставить("ПриложениеКДоговору", "учитывать приложение к договору");
	КонецЕсли;

	Возврат Соответствие;
	
КонецФункции 

&НаСервере
Функция ПолучитьПорядокПараметровОтбораСтатейБюджетаДляДокументов() 
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Организация", 		1);
	Соответствие.Вставить("Контрагент", 		2);
  	Соответствие.Вставить("Договор", 			3);
	Соответствие.Вставить("Валюта", 			5);
	Соответствие.Вставить("Номенклатура", 		6);
	Соответствие.Вставить("ПорядокОтражения", 	7);
	Соответствие.Вставить("СтавкаНДС",			8);
	Соответствие.Вставить("СуммаВсего", 				9);
	Соответствие.Вставить("СтатьяИспользуетсяОднократно",10);
	
	Если ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам") Тогда
		Соответствие.Вставить("ПриложениеКДоговору",4);
	КонецЕсли;
	
	Возврат Соответствие;
	
КонецФункции 




