#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановитьЗначениеИстинаДляПолныхПрав(мИменаРеквизитов =Неопределено, Значение = Истина, ТолькоДляПолныхПрав = Истина) Экспорт
	
	Если мИменаРеквизитов = Неопределено Тогда
		мИменаРеквизитов = ПолучитьМассивИменРеквизитовДляПолныхПрав();
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ГруппыПользователей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ГруппыПользователей КАК CW_ГруппыПользователей
	|ГДЕ
	|	ИСТИНА //CW_ГруппыПользователей.Ссылка <> Значение(Справочник.CW_ГруппыПользователей.Администраторы)
	| 	//УсловиеТолькоДляПолныхПрав";  
	
	Если ТолькоДляПолныхПрав Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеТолькоДляПолныхПрав", "И CW_ГруппыПользователей.ПолныеПрава"); 
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ГруппаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Для Каждого ИмяРеквизита из мИменаРеквизитов Цикл
			ГруппаОбъект[ИмяРеквизита] = Значение;
		КонецЦикла;
		
		ГруппаОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПраваДляГруппыАдминистраторы() ЭКспорт
	
	ГруппаОбъект = Справочники.CW_ГруппыПользователей.Администраторы.ПолучитьОбъект();
	
	мИменаРеквизитов = ПолучитьМассивИменРеквизитовДляПолныхПрав();
	Для Каждого ИмяРеквизита из мИменаРеквизитов Цикл
		ГруппаОбъект[ИмяРеквизита] = Истина;
	КонецЦикла;  
	
	ГруппаОбъект.Записать();
	
КонецПроцедуры

Функция ПолучитьМассивИменРеквизитовДляПолныхПрав() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("БюджетированиеРедактированиеСтавкиНДС");
	Массив.Добавить("ПросмотрИРедактированиеДвиженийДокументов");
	Массив.Добавить("РазрешеноПомещениеИзвлечениеОбъектовВАрхив");
	Массив.Добавить("РазрешеноПисатьВТехническуюПоддержку");
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеCRM") Тогда
		Массив.Добавить("РедактированиеCRM");
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокаСобственногоТранспорта") Тогда
		Массив.Добавить("ЗакрытиеПутевыхЛистов");
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("CW_ЛичныйКабинетИспользуется") Тогда
		Массив.Добавить("ЛичныйКабинетУправлениеПрофилями");
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользуетсяБлокПланированиеДДС") Тогда
		Массив.Добавить("ДоступенБлокПланированияДДС");
		Массив.Добавить("ВводЗаявокНаРасходБДДС");
		Массив.Добавить("ВводПлановыхПоступленийБДДС");
		Массив.Добавить("ВводПлановыхПоступленийБДДС");
		Массив.Добавить("РольФинансовогоКонтролера");
		Массив.Добавить("РольКазначея");
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("CW_ВедениеБухгалтескогоУчетаМСФО") Тогда
		Массив.Добавить("ДоступенБлокМСФО");			                          
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("CW_РеестрыНДС0Используется") Тогда
		Массив.Добавить("РеестрыНДС0");  
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("CW_ДоходыНерезидентовИспользуется") Тогда
		Массив.Добавить("ДоходыНерезидентов");
	КонецЕсли;  
	
	Если ПолучитьФункциональнуюОпцию("CW_ОбменГИСЭПДИспользуется") Тогда
		Массив.Добавить("ОбменС1СЭПД");
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

Процедура ОбновитьПрофилиПользователей(ПараметрыПроцедуры) Экспорт
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда   
		CW_РеестрыНДС0Сервер.ОбновитьПрофилиПользователей(ПараметрыПроцедуры);		
	КонецЕсли;   
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_ДоходыНерезидентов") Тогда   
		CW_ДоходыНерезидентовСервер.ОбновитьПрофилиПользователей(ПараметрыПроцедуры);		
	КонецЕсли;     
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_ОбменГИСЭПД") Тогда   
		CW_ОбменГИСЭПДСервер.ОбновитьПрофилиПользователей(ПараметрыПроцедуры);		
	КонецЕсли;  
	
КонецПроцедуры



#КонецЕсли