
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Услуги.Итог("Всего");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	Движения.CW_ОперативнаяДебиторскаяЗадолженность.Записывать = истина;
	
	ВедетсяУчетПриложенийПоДоговорамОбщий = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");
	
	ПараметрыОпции = Новый Структура;
	ПараметрыОпции.Вставить("CW_ДоговорПоГрузоперевозкам", Договор);
	
	ВедетсяУчетПриложенийПоДоговору = ПолучитьФункциональнуюОпцию("CW_УчитыватьПриложенияВДокументах", ПараметрыОпции);
	
	
	ВалютаРегламентированногоУчета 	= Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютныйДокумент 				= ВалютаДокумента <> ВалютаРегламентированногоУчета;
	
	СтруктураСчетов = CW_Финансы.СтруктураСчетовРасчетов_Клиенты(Дата, Организация);
	
	ВзаиморасчетыВУЕ = Договор.ВзаиморасчетыВУЕ;
	Если ЗначениеЗаполнено(ПриложениеКДоговору) и ВедетсяУчетПриложенийПоДоговорамОбщий и ВедетсяУчетПриложенийПоДоговору Тогда
		ВзаиморасчетыВУЕ = ПриложениеКДоговору.ВзаиморасчетыВУЕ;
	КонецЕсли;
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("ПорядокОтражения", ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
	
	СчетУчета = CW_Финансы.ОпределитьСчетУчетаДоходов(СтруктураСтроки,СтруктураСчетов,ВалютныйДокумент,ВзаиморасчетыВУЕ);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка КАК Счет,
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.Организация КАК Организация,
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.Контрагент КАК Контрагент,
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.Договор КАК Договор,
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.ВалютаДокумента КАК Валюта,
	               |	СУММА(CW_РеализацияПрочихТоваровУслугУслуги.Всего) КАК Всего_Валюта,
	               |	СУММА(ВЫРАЗИТЬ(CW_РеализацияПрочихТоваровУслугУслуги.Всего * CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов / CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))) КАК Всего
	               |ИЗ
	               |	Документ.CW_РеализацияПрочихТоваровУслуг.Услуги КАК CW_РеализацияПрочихТоваровУслугУслуги
	               |ГДЕ
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка,
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.Организация,
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.Контрагент,
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.Договор,
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.ВалютаДокумента,
	               |	CW_РеализацияПрочихТоваровУслугУслуги.Ссылка.ПриложениеКДоговору";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Движение = Движения.CW_ОперативнаяДебиторскаяЗадолженность.ДобавитьПриход();

		Движение.Период = Дата;
		
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		Движение.СчетУчета 		= СчетУчета;
		Движение.ВидОперации 	= ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.Начисление");
		
	КонецЕсли;
	
КонецПроцедуры