&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДатаОплаты", 			ДатаОплаты);	
	Параметры.Свойство("Описание", 				Описание);	
	Параметры.Свойство("РучноеРедактирование", 	РучноеРедактирование);

	Если ТипЗнч(Параметры.Документ) <> Тип("СписокЗначений") Тогда
		Если Не Параметры.Документ.Пустая() Тогда
			Представление = "Счёт №"+СокрЛП(Параметры.Документ.НомерСчета)+" от "+Формат(Параметры.Документ.ДатаСчета,"ДФ=dd.MM.yyyy")+" ("+Строка(Параметры.Документ.Контрагент)+")";
			СписокДокументов.Добавить(Параметры.Документ, Представление);  
		КонецЕсли;
	Иначе 
		Для Каждого ЭлементСписка из Параметры.Документ Цикл
			СписокДокументов.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
	КонецЕсли; 
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.ДатаОплаты.Доступность	= РучноеРедактирование;
	Элементы.Описание.Доступность 	= РучноеРедактирование;
	
КонецПроцедуры
 
&НаКлиенте
Процедура РучноеРедактированиенПриИзменении(Элемент)
	
	ДатаОплаты	= Дата(1,1,1);
	Описание	= "";

	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда) 
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ДатаОплаты", 				ДатаОплаты);	
	СтруктураПараметров.Вставить("Описание", 				Описание);	
	СтруктураПараметров.Вставить("РучноеРедактирование", 	РучноеРедактирование);
	
	ЭтаФорма.Закрыть(СтруктураПараметров);

КонецПроцедуры
