
Функция ИспользованиеВСтатусахОборудования(КонтрольнаяДата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ТипыСлеженияСтатусы.КонтрольнаяДата КАК КонтрольнаяДата
	               |ИЗ
	               |	Справочник.CW_ТипыСлежения.Статусы КАК CW_ТипыСлеженияСтатусы
	               |ГДЕ
	               |	CW_ТипыСлеженияСтатусы.КонтрольнаяДата = &КонтрольнаяДата";
	
	Запрос.УстановитьПараметр("КонтрольнаяДата", КонтрольнаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции