
Процедура ПередЗаписью(Отказ)   
	
	// контроль статуса по умолчанию и его очистка в случие отсутствия соответствующего статуса в табличной части
	Если ЗначениеЗаполнено(СтатусОборудованияПоУмолчанию) Тогда
		ЗначениеНайдено = Ложь;
		Для Каждого Стр из Статусы Цикл
			Если Стр.Статус = СтатусОборудованияПоУмолчанию Тогда
				ЗначениеНайдено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЗначениеНайдено Тогда
			СтатусОборудованияПоУмолчанию = Неопределено;				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
