
Процедура ЗаполнитьПредопределенныеФункции() Экспорт
	
	СпрОбъект = Справочники.CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета.НалоговаяБаза.ПолучитьОбъект();
	СпрОбъект.СпособПолученияЗначения 	= 3;
	СпрОбъект.Идентификатор 			= "НалоговаяБаза";
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.CW_РеестрыНДС0ФункцииЗначенийЯчеекОтчета.ЮридическийАдресКонтрагента.ПолучитьОбъект();
	СпрОбъект.СпособПолученияЗначения 	= 3;
	СпрОбъект.Идентификатор 			= "ЮридическийАдресКонтрагента";
	СпрОбъект.Записать();
	
КонецПроцедуры
	