#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОтчетВывести(ТабДок, ДанныеРасшифровки) Экспорт 
	
	//ТабДок.Очистить();

	//CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоПериода", НачалоДня(НачПериода), КомпоновщикНастроек.Настройки.ПараметрыДанных);
	//CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецПериода", КонецДня(КонПериода), КомпоновщикНастроек.Настройки.ПараметрыДанных);
	//CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПредставлениеПериода", ПредставлениеПериода(НачалоДня(НачПериода), КонецДня(КонПериода)), КомпоновщикНастроек.Настройки.ПараметрыДанных);
	//CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("флДетализироватьПоГрузоперевозкам", флДетализироватьПоГрузоперевозкам, КомпоновщикНастроек.Настройки.ПараметрыДанных);
	//
	//Если флДетализацияПоРегистратору Тогда
	//	элГруппировкаПоРегистратору = CW_Отчеты.ДобавитьГруппировкуКомпоновкиДанных("Регистратор", КомпоновщикНастроек.Настройки.Структура);
	//	CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Регистратор",ВидСравненияКомпоновкиДанных.Заполнено, , Истина, элГруппировкаПоРегистратору.Отбор);
	//	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить, элГруппировкаПоРегистратору.ПараметрыВывода);
	//	
	//	// прочерки в нач и кон. остатках
	//	ЭлементУсловногоОформления = элГруппировкаПоРегистратору.УсловноеОформление.Элементы.Добавить();
	//	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВалютнаяСуммаНачальныйОстаток");
	//	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВалютнаяСуммаКонечныйОстаток");
	//	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СуммаНачальныйОстаток");
	//	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СуммаКонечныйОстаток");
	//	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
	//	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
	//	
	//	// строки по регистратору курсивом, цвет темно-синий
	//	ЭлементУсловногоОформления = элГруппировкаПоРегистратору.УсловноеОформление.Элементы.Добавить();
	//	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,"Arial",,,Истина));
	//	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	//	
	//КонецЕсли;
	//
	//КомпоновщикМакета=Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновкиДанных=КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки,ДанныеРасшифровки);
	//ПроцессорКомпоновкиДанных=Новый ПроцессорКомпоновкиДанных;
	//// Здесь, при необходимости, следует добавить инициализацию внешних данных, если используется источник данных типа Объект.
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,ДанныеРасшифровки,Истина);
	//ПроцессорВывода=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ТабДок);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	//
	//Если флДетализацияПоРегистратору Тогда
	//	CW_Отчеты.УдалитьГруппировкуКомпоновкиДанных("Регистратор", КомпоновщикНастроек.Настройки.Структура);
	//КонецЕсли;
	//
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "0:00:00", "");
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "23:59:59", "");
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "Сальдо на начало периода", "Сальдо на "+Формат(НачПериода,"ДФ=dd.MM.yy"), ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "Сальдо на конец периода", "Сальдо на "+Формат(КонПериода,"ДФ=dd.MM.yy"), ГоризонтальноеПоложение.Центр);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "Сумма валютная", "Вал.", ГоризонтальноеПоложение.Центр, 8);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "Сумма рублевая", "Руб.", ГоризонтальноеПоложение.Центр, 8);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "Приход", "Выставлено, зачтено", ГоризонтальноеПоложение.Центр, 8);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "Расход", "Оплачено, зачтено", ГоризонтальноеПоложение.Центр, 8);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "Всего",  "Всего",  ГоризонтальноеПоложение.Центр, 8);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "Сумма",  "Сумма",  ГоризонтальноеПоложение.Центр, 8);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "НДС",    "НДС",    ГоризонтальноеПоложение.Центр, 8);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "Количество", "Количество", ГоризонтальноеПоложение.Центр, 8);
	//CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТабДок, "Итого", "ИТОГО:");
	//
	//CW_Отчеты.УжатьПоВысотеСтрокиПередИПослеЗаголовка(ТабДок);
	//
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ВРег(МетаданныеОтчета.Синоним));
	
	// Установим параметры
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(Настройки.НачалоПериода));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(Настройки.КонецПериода));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьГрузоперевозки", Настройки.ВыводитьГрузоперевозки);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьЗаказы", Настройки.ВыводитьЗаказы);
	
	// формируем по показателям
	Для Каждого Поле Из НастройкиСКД.Выбор.Элементы Цикл
		Если ТипЗнч(Поле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			Для Каждого ПодРаздел из Поле.Элементы Цикл
				Если Найти(Строка(ПодРаздел.Поле), "СуммаРуб") <> 0 Тогда
					ПодРаздел.Использование = Настройки.Рубли;
				ИначеЕсли Найти(Строка(ПодРаздел.Поле), "ВалютнаяСумма") <> 0 Тогда
					ПодРаздел.Использование = Настройки.Валюта;
				КонецЕсли;					
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;	
	
	// формируем структуру отчета по группировкам
	НастройкиСКД.Структура.Очистить();
	ТекущийРодитель = НастройкиСКД.Структура;
	Для каждого Группировка Из Настройки.Группировки Цикл
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		// --- 
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		ПолеГруппировки.Использование = Истина;
		// --- 
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование=Истина;
		// --- 
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		НС = ?(Группировка.Сортировка=Перечисления.CW_НаправлениеСортировки.ПоВозрастанию,НаправлениеСортировкиКомпоновкиДанных.Возр,НаправлениеСортировкиКомпоновкиДанных.Убыв);
		ЭлементПорядка.ТипУпорядочивания = НС;
		ЭлементПорядка.Использование = Истина;
		// --- 
		НоваяГруппировка.Имя = Группировка.Представление;
		НоваяГруппировка.Использование = Истина;
		// --- 
		ТекущийРодитель = НоваяГруппировка.Структура;
	КонецЦикла; 
	
	ЭлементУсловногоОформления = НоваяГруппировка.УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.ВалютнаяСуммаНачальныйОстаток");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.ВалютнаяСуммаКонечныйОстаток");
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОборотКТ.СуммаРубОборотКт");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОборотКТ.ВалютнаяСуммаОборотКт");
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОборотДТ.СуммаРубОборотДт");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОборотДТ.ВалютнаяСуммаОборотДт");
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.СуммаРубНачальныйОстаток");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.СуммаРубКонечныйОстаток");
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ВертикальноеПоложение", ВертикальноеПоложение.Центр);
	
	ЭлементУсловногоОформления.ИспользоватьВГруппировке = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;		
	
	Если Настройки.ВыводитьДокументыДвижения Тогда
		элГруппировкаПоРегистратору = CW_Отчеты.ДобавитьГруппировкуКомпоновкиДанных("Регистратор", ТекущийРодитель); // КомпоновщикНастроек.Настройки.Структура);
		элГруппировкаПоРегистратору.Имя = "Регистратор";
		CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Регистратор",ВидСравненияКомпоновкиДанных.Заполнено, , Истина, элГруппировкаПоРегистратору.Отбор);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить, элГруппировкаПоРегистратору.ПараметрыВывода);
		
		ЭлементУсловногоОформления = элГруппировкаПоРегистратору.УсловноеОформление.Элементы.Добавить();
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.ВалютнаяСуммаНачальныйОстаток");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.ВалютнаяСуммаКонечныйОстаток");
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоНач.СуммаРубНачальныйОстаток");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СальдоКон.СуммаРубКонечныйОстаток");
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "-");
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Право);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
		
		ЭлементУсловногоОформления.ИспользоватьВЗаголовкеПолей = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		
		//----------------------------------------------------------------------------------------------------------------------------------
		
		ЭлементУсловногоОформления = элГруппировкаПоРегистратору.УсловноеОформление.Элементы.Добавить();
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОборотКТ.СуммаРубОборотКт");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОборотКТ.ВалютнаяСуммаОборотКт");
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОборотДТ.СуммаРубОборотДт");
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОборотДТ.ВалютнаяСуммаОборотДт");
		
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Регистратор");
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ШрифтТекста,"Arial",7,,Истина));
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
		
		ЭлементУсловногоОформления.ИспользоватьВЗаголовкеПолей = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
		
		//----------------------------------------------------------------------------------------------------------------------------------
						
	КонецЕсли;	
	
	
КонецПроцедуры
#КонецЕсли