
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);   
	
	ОбработатьИзменениеРежимаОтображенияНаСервере();  
	
КонецПроцедуры


&НаКлиенте
Процедура ОтметитьВсеПрочитанным(Команда)
	
	ОтметитьВсеПрочитаннымНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОтметитьВсеПрочитаннымНаСервере()     
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УведомленияСайта.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА CW_ПрочитанныеУведомления.Уведомление ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Прочитано
	               |ИЗ
	               |	Справочник.CW_УведомленияСайта КАК CW_УведомленияСайта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПрочитанныеУведомления КАК CW_ПрочитанныеУведомления
	               |		ПО CW_УведомленияСайта.Ссылка = CW_ПрочитанныеУведомления.Уведомление
	               |			И (CW_ПрочитанныеУведомления.Пользователь = &Пользователь)
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА CW_ПрочитанныеУведомления.Уведомление ЕСТЬ NULL
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ = ЛОЖЬ
	               |	И CW_УведомленияСайта.ПометкаУдаления = ЛОЖЬ";  
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий()Цикл
		РегистрыСведений.CW_ПрочитанныеУведомления.ПрочитатьУведомление(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПоказатьВсе(Команда)
	
	РежимОтбораСписка = 1;
	ОбработатьИзменениеРежимаОтображенияНаСервере();   
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНепрочитанные(Команда)   
	
	РежимОтбораСписка = 0;
	ОбработатьИзменениеРежимаОтображенияНаСервере();  
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьИзменениеРежимаОтображенияНаСервере()
	
	Элементы.ФормаПоказатьВсе.Пометка = (РежимОтбораСписка = 1);
	Элементы.ФормаПоказатьНепрочитанные.Пометка = (РежимОтбораСписка = 0);
	
	УстановитьОтборСпискаНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура УстановитьОтборСпискаНаСервере()
	
	Список.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ИндексКартинки");
	ЭлементОтбора.Использование 	= (РежимОтбораСписка = 0);
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрзуитьУведомления(Команда)
	ВыполнитьЗагрузкуУведомлений();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуУведомлений()
	
	РезультатВыполнения =  ВыполнитьЗагрузкуУведомленийНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗагрузкиУведомлений", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры    

&НаСервере
Функция ВыполнитьЗагрузкуУведомленийНаСервереВФоне() Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Выполняется загрузка уведомлений с сайта...";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;   
	
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_УведомленияСайтаСервер.ЗагрузитьУведомления", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатЗагрузкиУведомлений(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		Элементы.Список.Обновить();
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		ТекстПредупреждения = "Не удалось получить данные с сайте. Попробуйте позже.";
		ПоказатьПредупреждение(,ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Уведомления_Прочитано" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры


