#Область ОсновныеСобытияФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	_УстановитьПараметрыФункциональныхОпцийФормы(); 

	ВалютаРегламентированногоУчетаРубль	= ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");   
	ВалютаРегламентированногоУчета 		= Константы.ВалютаРегламентированногоУчета.Получить();
	
	Элементы.УслугиГруппаДобвитЬСтрокуСчета.Видимость 	= Не ВалютаРегламентированногоУчетаРубль;
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП
	
	ПравоРедактированияНомераДокумента 	= CW_ПраваДоступа.ПравоДоступно("РедактированиеНомераДокументаДоходыПоГрузоперевозкам");
	
	Элементы.Номер.ТолькоПросмотр 		=  НЕ ПравоРедактированияНомераДокумента;
	Элементы.ПолучитьНомер.Видимость 	=  ПравоРедактированияНомераДокумента;
	
	РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки 	= ПолучитьФункциональнуюОпцию("CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки");
	УстановитьЗначениеНольЗначениеПараметраНеУстановлено 		= Константы.CW_УстановитьЗначениеНольЗначениеПараметраНеУстановлено.Получить();
	СохранятьРеквизитыПервичныхДокументов 						= Константы.CW_СохранятьРеквизитыПервичныхДокументов.Получить();
	
	// проверим на копирование
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Копия = Параметры.ЗначениеКопирования;
	КонецЕсли;	
	
	Элементы.ГруппаИнфо.Видимость = Ложь;
	// ---      
	
	//Взаиморасчеты по документу
	CW_ВзаиморасчетыПоДокументуСервер.УстановитьНазваниеСсылкиОтчета(ЭтаФорма, Объект.ФормируетсяСчет);
	//Взаиморасчеты по документу
	
	ПросмотрБюджетиа = CW_ПраваДоступа.ПравоДоступно("ПросмотрБюджетов");
	Элементы.УслугиПроверкаДокументаПоБюджету.Видимость = ПросмотрБюджетиа;
	
	НачальнаяДатаДокумента = Объект.Дата;
	
	ЭтоНовыйОбъект = Объект.Ссылка.Пустая();
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Модифицированность = Истина;
		Если Не ЗначениеЗаполнено(НачальнаяДатаДокумента) Тогда
			НачальнаяДатаДокумента = ТекущаяДата();
		КонецЕсли;
		
		Если Объект.ВидОперации.Пустая() Тогда
			Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг");
		КонецЕсли;
		
		Если Не Объект.Корректировка 
			И Не Параметры.ЗначенияЗаполнения.Свойство("ВводНаОсновании") Тогда
			Объект.ЦенаСНДС = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ВДокументахЦенаСНДС");
		КонецЕсли;
		
		Если ВестиУчетПоПодразделениям и Не ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда
			Объект.ПодразделениеОрганизации 	= CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ПодразделениеПользователя");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Договор) Тогда
			_ОбработатьИзменениеДоговора();
		КонецЕсли;
	КонецЕсли;
	
	НеЗаменятьПредставлениеНоменклатуры = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"НеЗаменятьПредставлениеПриИзмененииНоменклатурыДоходы");

	#Область Динамический_вывод_дополнительных_колонок
	
	_УФС.ОбновитьСписокДополнительныхКолонокФормы(ЭтаФорма, "CW_ДоходыПоГрузоперевозке");
	УстановитьВидимостьКнопкиОбновленияЗначений();
	
	#КонецОбласти
	
	ЗаполнитьСписокКодовОпераций();
	
	//Услуги по договру 
	ОграничиватьУслугиПоДоговорам = ПолучитьФункциональнуюОпцию("CW_ОграничиватьУслугиПоДоговорам");
	Если ОграничиватьУслугиПоДоговорам Тогда
		УстанавливатьЦенуВЗависимостиОтГруза 	= ПолучитьФункциональнуюОпцию("CW_УстанавливатьЦенуВЗависимостиОтГруза");
		НеОграничиватьУслугиПоПеревыставлению 	= Константы.CW_НеОграничиватьСписокУслугПриПеревыставленииЗатрат.Получить();
	КонецЕсли;   

	АдресУслугПоДоговору = "";
	УстановитьАдресСпискаУслугПоДоговору();
	
	//AFR-233578
	//ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре();
	//ОтключитьИсториюВыбораНоменклатуры(ИспользуетсяОгранчиениеУслуг);
	//AFR-233578
	
	//Подсистема.ДополнительныеРеквизиты
	ИспользоватьДопРеквизиты = CW_ДополнительныеРеквизитыСлужебный.ИспользуютсяДополниительныеРеквизиты();
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ПроизвольныйОбъект", НЕ ИспользоватьДопРеквизиты); 
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства   
	
	// Конец Подсистема.ДополнительныеРеквизиты  
	
	Основание = _сф.ст_ПолучитьСвойство(Параметры,"Основание");
	Если Основание <> Неопределено Тогда
		
		СтрукутраДоговорПриложение = ПолучитьДоговорПриложениеОснования(Основание);
		СтрукутраДоговорПриложение.Свойство("Договор", 				Объект.Договор);
		СтрукутраДоговорПриложение.Свойство("ПриложениеКДоговору", 	Объект.ПриложениеКДоговору);
		
		Если (ТипЗнч(Основание)=Тип("СправочникСсылка.CW_Грузоперевозки")) Тогда
				
			Если ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Организация) и НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
					Объект.Договор = CW_Документы.ПолучитьПоследнийДоговор(Объект.Контрагент, Объект.Организация, Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			КонецЕсли;
			Если (ЗначениеЗаполнено(Объект.Договор)) Тогда
				_ОбработатьИзменениеДоговора();
			КонецЕсли;	
				
			// добавляем строку
			Нстр = Объект.Услуги.Добавить();
			Нстр.Грузоперевозка = Основание;
		КонецЕсли; 
			
		Если (ТипЗнч(Основание)=Тип("СправочникСсылка.CW_Заказы")) Тогда
				
			Объект.Контрагент = Основание.Клиент;
			Если ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Организация) и НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
				Объект.Договор = CW_Документы.ПолучитьПоследнийДоговор(Объект.Контрагент, Объект.Организация, Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			КонецЕсли; 
			Если (ЗначениеЗаполнено(Объект.Договор)) Тогда
				_СформироватьОбщиеПараметры();
				_ОбработатьИзменениеДоговора();
			КонецЕсли; 
				
			// добавляем строку
			МассивГП = CW_Мониторинг.ГрузоперевозкиЗаказа(Основание);
			Для каждого ГП Из МассивГП Цикл
				Нстр = Объект.Услуги.Добавить();
				Нстр.Грузоперевозка = ГП;
			КонецЦикла; 
			
		КонецЕсли; 	
		
	КонецЕсли; 
	
	// заполнение по бюджету
	АдресПараметровЗаполнения = _сф.ст_ПолучитьСвойство(Параметры,"АдресПараметровЗаполнения");
	Если (АдресПараметровЗаполнения <> Неопределено) Тогда
		
		СтруктураПараметровЗаполнения = ПолучитьИзВременногоХранилища(АдресПараметровЗаполнения);
		ЗаполнитьЗначенияСвойств(Объект,СтруктураПараметровЗаполнения,,"Услуги");
		
		СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметров.Дата 				= СтруктураПараметровЗаполнения.Дата;
		СтруктураПараметров.Договор 			= СтруктураПараметровЗаполнения.Договор;
		СтруктураПараметров.ПриложениеКДоговору = СтруктураПараметровЗаполнения.ПриложениеКДоговору;
		
		ПараметрыДоговора = CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "ОсновнойКодСпособаВыставленияСчетовФактур");
		Объект.КодСпособаВыставления = ПараметрыДоговора.ОсновнойКодСпособаВыставленияСчетовФактур;
		
		// --- 
		Для каждого Стр Из СтруктураПараметровЗаполнения.Услуги Цикл
			
			Нстр = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,Стр);
			
		КонецЦикла; 
		
		//
		КомментарийЗаполнения = Неопределено;
		СтруктураПараметровЗаполнения.Свойство("КомментарийЗаполнения",КомментарийЗаполнения);
		
		ОбработатьИзменениеФлагаЦенаСНДС();    
		
		Если ЗначениеЗаполнено(Объект.Договор) Тогда
			_ОбработатьИзменениеДоговора();
		КонецЕсли;
		
	КонецЕсли; 
	
	
	ЗапрашиватьПодтверждениеПриУдаленииСтрок = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ДоходыЗапрашиватьПодтверждениеПриУдаленииСтрок");
	
	ОтображатьКомментарийДоговора = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОтображатьКомментарийДоговораВФормеВводаДокументовПоБюджету");
	УстановитьЗаголовокНадписиКомментарияДоговора();
	
	_ИнициализацияФормы();
	_ОбновитьСтатусПометокУдаления();
	ОбработатьИзменениеСоставаЦены();
	
	УстановитьВерсиюПоставленияНДС1137();
	
	//Срок оплаты
	Если Не Параметры.Ключ.Пустая() Тогда
		ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(Параметры.Ключ);
		
		ДанныеСрокаОплаты.Свойство("ДатаОплаты",			_СрокОплаты);
		ДанныеСрокаОплаты.Свойство("Описание",				_СрокОплатыОписание);
		ДанныеСрокаОплаты.Свойство("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);

		УстановитьОписаниеСрокаОплаты();	
	КонецЕсли;
	//Срок оплаты
	
	//Первичные документы
	ПервичныеДокументыПриСозданииНаСервере();
	ПервичныеДокументыУправлениеЭлементамиФормы();
	//Первичные документы
	
	//Подистема.CW_ПланированиеДДС
	CW_ПланированиеДДССервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подистема.CW_ПланированиеДДС
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	//Подсистема.СтатусыДокументов
	
	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.ОригиналыДокументов
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров
	
	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов
	
	//Подсистема.УчетНЗП
	УстановитьОтборДинамическогоСпискаРасходы();
	//Подсистема.УчетНЗП   
	
	//Подсистема.ЭДО
	УстановитьВидимостьКомандЭДО();
	//Подсистема.ЭДО     
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	#Область Динамический_вывод_дополнительных_колонок
	
	//Обновляем динамические колонки параметров ГП
	Если Объект.Услуги.Количество() > 0 Тогда
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВерсиюПоставленияНДС1137()
	
	ДатаДляПостановления = ?(Объект.ФормируетсяСчетФактура, Объект.ДатаСчетаФактуры, Объект.Дата);  
	ДатаДляПостановления = ?(ДатаДляПостановления = Дата(1,1,1), Объект.Дата, 	ДатаДляПостановления);  
	ДатаДляПостановления = ?(ДатаДляПостановления = Дата(1,1,1), ТекущаяДата(), ДатаДляПостановления);  
	
	ВерсияПостановленияНДС1137 = CW_БухгалтерияЭкспедитораСерверПереопределяемый.ВерсияПостановленияНДС1137(ДатаДляПостановления);

КонецПроцедуры

&НаСервере
Процедура ОтключитьИсториюВыбораНоменклатуры(ЕстьОграниченияПоСпискуУслуг)
	
	Если ЕстьОграниченияПоСпискуУслуг Тогда 
		Элементы.УслугиНоменклатура.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	Иначе
		Элементы.УслугиНоменклатура.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.Авто;
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура УстановитьВидимостьКомандЭДО()       
	
	СтруктураВидимости = ПроверитьПодключениеКЭДО();
	
	Если Не РольДоступна("ПолныеПрава") Тогда 
		Возврат;
	КонецЕсли;
	
	Элементы.ОбщаяКомандаAF_ЭДО_ПросмотретьЭлектронныйДокументСФКорректировочный.Видимость 	= СтруктураВидимости.СчетФактураКорр;
	Элементы.ОбщаяКомандаAF_ЭДО_ПросмотретьЭлектронныйДокументАктКорректировочный.Видимость = СтруктураВидимости.АктКорр; 
	
	Элементы.ОбщаяКомандаAF_ЭДО_ПросмотретьЭлектронныйДокументСФ.Видимость		= СтруктураВидимости.СчетФактура;
	Элементы.ОбщаяКомандаAF_ЭДО_ПросмотретьЭлектронныйДокументАкт.Видимость 	= СтруктураВидимости.Акт;
	Элементы.ОбщаяКомандаAF_ЭДО_ПросмотретьЭлектронныйДокументСчет.Видимость 	= СтруктураВидимости.Счет;

	Элементы.ОбщаяКомандаCW_ДобавитьФайлВПакетСчет.Видимость				= СтруктураВидимости.ДобавитьФайлСчет;
	Элементы.ОбщаяКомандаCW_ДобавитьФайлВПакетАкт.Видимость 				= СтруктураВидимости.ДобавитьФайлАкт;
	Элементы.ОбщаяКомандаCW_ДобавитьФайлВПакетСФ.Видимость 					= СтруктураВидимости.ДобавитьФайлСчетФактура;
	Элементы.ОбщаяКомандаCW_ДобавитьФайлВПакетСФКорректировка.Видимость		= СтруктураВидимости.ДобавитьФайлСчетФактураКорр;
	Элементы.ОбщаяКомандаCW_ДобавитьФайлВПакетАктКорректировка.Видимость	= СтруктураВидимости.ДобавитьФайлАктКорр;

	
КонецПроцедуры

&НаСервере
Функция ПроверитьПодключениеКЭДО() 
	
	СтруктураВидимости 	= Новый Структура("СчетФактураКорр,АктКорр,СчетФактура,Акт,Счет,ДобавитьФайлСчет,ДобавитьФайлАкт,ДобавитьФайлСчетФактура,ДобавитьФайлСчетФактураКорр,ДобавитьФайлАктКорр",
			Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь, Ложь);	
	
	ИспользуетсяЭДО 	= НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами(); 
	Если Не ИспользуетсяЭДО Тогда
		Возврат СтруктураВидимости;
	КонецЕсли;   
	
	ЕстьПравоЧтенияДокументов = ИнтерфейсДокументовЭДОВызовСервера.ЕстьПравоЧтенияДокументов();
	Если Не ЕстьПравоЧтенияДокументов Тогда
		Возврат СтруктураВидимости;
	КонецЕсли;   

	CW_ЭДОВызовСервера.ЗаполнитьВидимостьДобавленияФайловЭДО(Объект.Ссылка, СтруктураВидимости);
	
	Если Объект.Корректировка Тогда
		Если Объект.ФормируетсяАкт Тогда
			ДанныеСостоянияЭДО 	= ИнтеграцияЭДОВызовСервера.ДанныеСостоянияЭДОДляФормыОбъектаУчета(Объект.ВедомыйДокументКорректировки);   
			СтруктураВидимости.Вставить("АктКорр", ДанныеСостоянияЭДО.ИспользуетсяОбменЭлектроннымиДокументами и НЕ ДанныеСостоянияЭДО.НеобходимаНастройка);
		КонецЕсли;
		Если Объект.ФормируетсяСчетФактура Тогда
			ДанныеСостоянияЭДО 	= ИнтеграцияЭДОВызовСервера.ДанныеСостоянияЭДОДляФормыОбъектаУчета(Объект.ВедомыйСчетФактураКорректировочный); 
			СтруктураВидимости.Вставить("СчетФактураКорр", ДанныеСостоянияЭДО.ИспользуетсяОбменЭлектроннымиДокументами и НЕ ДанныеСостоянияЭДО.НеобходимаНастройка);
		КонецЕсли;
	Иначе
		Если Объект.ФормируетсяСчет Тогда
			ДанныеСостоянияЭДО 	= ИнтеграцияЭДОВызовСервера.ДанныеСостоянияЭДОДляФормыОбъектаУчета(Объект.ВедомыйСчет); 
			СтруктураВидимости.Вставить("Счет", ДанныеСостоянияЭДО.ИспользуетсяОбменЭлектроннымиДокументами и НЕ ДанныеСостоянияЭДО.НеобходимаНастройка);
		КонецЕсли;
		Если Объект.ФормируетсяАкт Тогда
			ДанныеСостоянияЭДО 	= ИнтеграцияЭДОВызовСервера.ДанныеСостоянияЭДОДляФормыОбъектаУчета(Объект.ВедомыйДокумент);   
			СтруктураВидимости.Вставить("Акт", ДанныеСостоянияЭДО.ИспользуетсяОбменЭлектроннымиДокументами и НЕ ДанныеСостоянияЭДО.НеобходимаНастройка);
		КонецЕсли;
		Если Объект.ФормируетсяСчетФактура Тогда
			ДанныеСостоянияЭДО 	= ИнтеграцияЭДОВызовСервера.ДанныеСостоянияЭДОДляФормыОбъектаУчета(Объект.ВедомыйСчетФактура); 
			СтруктураВидимости.Вставить("СчетФактура", ДанныеСостоянияЭДО.ИспользуетсяОбменЭлектроннымиДокументами и НЕ ДанныеСостоянияЭДО.НеобходимаНастройка);
		КонецЕсли;
	КонецЕсли;     
	
	Возврат СтруктураВидимости;
	
КонецФункции 


&НаСервере
Функция  ПолучитьДоговорПриложениеОснования(ИсточникДоговора)
	
	ПараметрДоговор 	= Константы.CW_ПараметрДоговораПлательщика.Получить();
	ПараметрПриложение 	= Константы.CW_ПараметрПриложенияДоговора.Получить();
	
	Если Не ЗначениеЗаполнено(ПараметрДоговор) Тогда
		///Приложение не проверяем, так как без договора он не имеет смысла
		Возврат Новый Структура;
	Конецесли;
	
	Если ТипЗнч(ИсточникДоговора) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		НайденныйДоговор = ПолучитьПараметрГрузоперевозки(ИсточникДоговора, ПараметрДоговор);
		Если ТипЗнч(НайденныйДоговор) <> тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
			НайденныйДоговор = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НайденныйДоговор) Тогда
		НайденныйДоговор = ПолучитьПараметрЗаказа(ИсточникДоговора, ПараметрДоговор);
		Если ТипЗнч(НайденныйДоговор) <> тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
			НайденныйДоговор = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденныйДоговор) Тогда
		Если НайденныйДоговор.ИспользуютсяПриложения Тогда
			НайденноеПриложение = ПолучитьПараметрГрузоперевозки(ИсточникДоговора, ПараметрПриложение);
			Если ТипЗнч(НайденноеПриложение) <> тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
				НайденноеПриложение = Неопределено;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НайденноеПриложение) тогда
				НайденноеПриложение = ПолучитьПараметрЗаказа(ИсточникДоговора, ПараметрПриложение);
			КонецЕсли;
			
			Если ТипЗнч(НайденноеПриложение) = тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
				Если НайденноеПриложение.Договор <> НайденныйДоговор Тогда
					НайденноеПриложение = Неопределено;
				КонецЕсли;
			Иначе 
				НайденноеПриложение = Неопределено;
			КонецЕсли;
		Конецесли;
	КонецЕсли;
	
	Струкутра = Новый Структура;
	Струкутра.Вставить("Договор", 				НайденныйДоговор);
	Струкутра.Вставить("ПриложениеКДоговору", 	НайденноеПриложение);
	
	Возврат Струкутра;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрГрузоперевозки(ИсточникДоговора, Параметр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПараметрыГрузоперевозок.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК ПараметрыГрузоперевозок
	|ГДЕ
	|	ПараметрыГрузоперевозок.Грузоперевозка = &ИсточникДоговора
	|	И ПараметрыГрузоперевозок.Параметр = &Параметр";
	
	Запрос.УстановитьПараметр("ИсточникДоговора", 	ИсточникДоговора);
	Запрос.УстановитьПараметр("Параметр",  			Параметр);
	
	РезультатЗапроса = запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрЗаказа(ИсточникДоговора, Параметр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПараметрыЗаказов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиЗаказов КАК ПараметрыЗаказов
	|ГДЕ
	|	ПараметрыЗаказов.Заказ = &ИсточникДоговора
	|	И ПараметрыЗаказов.Параметр = &ПараметрДоговор";
	
	Запрос.УстановитьПараметр("ИсточникДоговора", 	ИсточникДоговора);
	Запрос.УстановитьПараметр("ПараметрДоговор", 	Параметр);
	
	РезультатЗапроса = запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


&НаСервере
Процедура _УстановитьПараметрыФункциональныхОпцийФормы()
	
	ПараметрыФункциональныхОпций = Новый Структура;
	ПараметрыФункциональныхОпций.Вставить("CW_Пользователь", CW_Настройки.Пользователь());
	ПараметрыФункциональныхОпций.Вставить("CW_Организация",	 Объект.Организация);
	
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФункциональныхОпций);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	Если (ЗначениеЗаполнено(КомментарийЗаполнения)) Тогда
		
		Сообщить(КомментарийЗаполнения);		
		
	КонецЕсли;
	
	// проверим на копирование
	Если ЗначениеЗаполнено(Копия) Тогда
		// проверим грузоперевозки
		
		Блок = _ПроверитьБлок();
		Если (Блок) Тогда    
			Объект.Услуги.Очистить();
			_УФК.ВывестиПредупреждение("Документ содержит блокированые грузоперевозки." + Символы.ПС + "Табличная часть очищена.");
			УстановитьДоступность(); 
		КонецЕсли;	
		
		ОбновитьИтогиПоУслугам();
		ОбновитьИтогиПоАвансам();
		
	КонецЕсли;	
	
	// вид операции
	Если (Объект.Ссылка.Пустая() И Объект.ВидОперации.Пустая()) Тогда
		Если (НЕ Объект.Корректировка) Тогда
			УстановитьВидОперации(Неопределено);	
		КонецЕсли; 
	КонецЕсли; 
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства    
	
	//Подсистема.CW_ЭлектронныйОбменДанными
	Если ЗначениеЗаполнено(Объект.Контрагент) 
		и Не Объект.Корректировка Тогда
		ПроверитьКонтрагентаПоБазеЛКК();
	КонецЕсли;
	//Подсистема.CW_ЭлектронныйОбменДанными
	
	
	//Подсчистема.CW_РеестрыНДС0   
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда 
		ПодключитьОбработчикОжидания("ПоказатьРекламныйБаннерВДокументе", 0.1, Истина); 
	КонецЕсли;
	//Подсчистема.CW_РеестрыНДС0
	
	
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьДоступность()  
	
	ЭтаФорма.ТолькоПросмотр = Ложь;
	Элементы.ГруппаИнфо.Видимость = Ложь;
	Элементы.ПолучитьНомер.Доступность = Истина;
	Элементы.ФормаУстановитьВидОперации.Доступность = Истина;
	Элементы.ФормаОбщаяКомандаCW_ИнформацияПоЗакрытиюГрузоперевозок.Видимость = Истина;
	Элементы.УслугиИзменить.Доступность = Истина;
	Элементы.УслугиУслуги_ПереформироватьПредставление.Доступность = Истина;
	Элементы.УслугиГруппаЗаполнить.Видимость = Истина;
	// --- 
	Элементы.ЗачетАвансовЗаполнитьАвансы.Доступность=Истина;
	Элементы.ЗачетАвансовЗаполнитьАвансы1.Доступность=Истина;
	Элементы.ЗачетАвансов.ТолькоПросмотр = Ложь;
	Элементы.ЗачетАвансовОЗ.ТолькоПросмотр = Ложь;
	Элементы.ЗачетАвансовЗачетАвансов_Очистить.Доступность=Истина;
	Элементы.ЗачетАвансовОЗЗачетАвансовОЗ_Очистить.Доступность=Истина;
	Элементы.ЗачетАвансовОЗЗачетАвансовОЗ_Открыть.Доступность = Истина;
	Элементы.ЗачетАвансовЗачетАвансов_Открыть.Доступность = Истина;
	
	Элементы.НадписьДокументыОбОтгрузке.Доступность = Истина;
	
	Элементы.Заявки.ТолькоПросмотр = Истина;
	Элементы.СоздатьЗаявку.Доступность = Истина;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	
	Если Объект.Ссылка.Пустая() Тогда
		РедактированиеАктированныхСчетов = CW_ПраваДоступа.ПравоДоступно("РазрешитьРедактированиеИсходящихАктированныхСчетов");
		Если Объект.ФормируетсяАкт и Объект.ФормируетсяСчет и Не РедактированиеАктированныхСчетов Тогда
			ПоказатьПредупреждение(, "Недостаточно прав для записи пакетного документа!");
			Отказ = истина;
			Возврат ;
		КонецЕсли;
	КонецЕсли;
	
	ЭтоСмешанный 	= ПолучитьЭтоСмешанный(Объект.ВедомыйСчетФактура);
	СистемаНалогообложения 	= ПолучитьСистемуНалогообложения(Объект.Организация, Объект.Дата);
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Общая")
		И ЭтоСмешанный 
		И Объект.ФормируетсяСчетФактура Тогда
		 ПоказатьПредупреждение(, "По документу оформлена смешанная с\ф. Проверьте корректность отражения записей по документу в книге покупок и журнале учета счет-фактур!");
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Функция ПолучитьЭтоСмешанный(ВедомыйСчетФактура)
	
	УслугиПорядокОтражения = Объект.Услуги.Выгрузить(,"ПорядокОтражения"); 
	УслугиПорядокОтражения.Свернуть("ПорядокОтражения",);
	
	Возврат УслугиПорядокОтражения.Количество() > 1;
	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьСистемуНалогообложения(Организация, Знач НаДату= Неопределено)
	
	НаДату = ?(НаДату=Неопределено, ТекущаяДата(), НаДату);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиСистемыНалогообложенияСрезПоследних.Организация КАК Организация,
	               |	НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	               |ИЗ
	               |	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&НаДату, Организация = &Организация) КАК НастройкиСистемыНалогообложенияСрезПоследних"; 
	
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СистемаНалогообложения;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	CW_Документы.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ);

	//Подсистема.ГруппыУслугПриложенийИДоговоров
	CW_ГруппыУслугСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ОригиналыДокументов
	
	// для новых сохраняем срок оплаты
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	// признак интерактивного режима
	_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"ИнтерактивныйРежим",Истина);
	
	// тут перенесём доп. свойства в дополнительные свойства объекта
	_сф.ст_ДобавитьСвойства(ТекущийОбъект.ДополнительныеСвойства,"*",_ДС());
	ТекущийОбъект.ДС = ТекущийОбъект.ДополнительныеСвойства;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	_ОбновитьНомераДокументов();
	_СформироватьЗаголовок();
	СостояниеДокумента 		= ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	//Подистема.CW_ПланированиеДДС
	CW_ПланированиеДДССервер.ПослеЗаписиНаСервере(ЭтаФорма,ТекущийОбъект, ПараметрыЗаписи); 
	//Подистема.CW_ПланированиеДДС
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ОригиналыДокументов
	
	//Подсистема.УчетНЗП
	УстановитьОтборДинамическогоСпискаРасходы();
	//Подсистема.УчетНЗП   
	
	//Взаиморасчеты по документу
	CW_ВзаиморасчетыПоДокументуСервер.УстановитьНазваниеСсылкиОтчета(ЭтаФорма, Объект.ФормируетсяСчет);
	//Взаиморасчеты по документу   

	//Данные первичных документов
	CW_Документы.ЗаписатьДанныеПервичногоДокумента(Объект);
	//Данные первичных документов
	
	//СрокОплаты
	Если ЭтоНовыйОбъект Тогда
		Если Не _СрокОплатыРучноеРедактирование Тогда
			УстановитьСрокОплатыНаСервере();
		Иначе
			ЗаписатьСрокОплатыДокумента();
			УстановитьОписаниеСрокаОплаты();             
		КонецЕсли;
	КонецЕсли;
	//СрокОплаты    
	
	
	Если Объект.Проведен 
		и Не Объект.Корректировка 
		И Объект.Валюта = ВалютаРегламентированногоУчета Тогда
		
		Если ЗначениеЗаполнено(Объект.ПриложениеКДоговору) Тогда
			ВедетсяБухгалтерскийУчет = Объект.ПриложениеКДоговору.БухгалтерскийУчет;	
		Иначе
			ВедетсяБухгалтерскийУчет = Объект.Договор.БухгалтерскийУчет;	
		КонецЕсли;
		
		Если ВедетсяБухгалтерскийУчет И Объект.ФормируетсяАкт и Объект.ФормируетсяСчетФактура Тогда  
			CW_БухгалтерияЭкспедитораСервер.СоздатьДокументыСчетФактураВыданныйСВидомНалоговыйАгент(Объект);
		КонецЕсли;
		
	КонецЕсли;
	
	НачальнаяДатаДокумента 	= Объект.Дата;
	_ОбновитьНадписиКорректировок();
	
	_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	
	ЭтоНовыйОбъект = Ложь;	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

	//Подсчистема.CW_РеестрыНДС0   
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда 
		ПодключитьОбработчикОжидания("ПоказатьРекламныйБаннерВДокументе", 0.1, Истина);
	КонецЕсли;
	//Подсчистема.CW_РеестрыНДС0
	
	//Срок оплаты
	ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(Объект.Ссылка);
	ДанныеСрокаОплаты.Свойство("ДатаОплаты",			_СрокОплаты);
	ДанныеСрокаОплаты.Свойство("Описание",				_СрокОплатыОписание);
	ДанныеСрокаОплаты.Свойство("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
	
	УстановитьОписаниеСрокаОплаты();
	//Срок оплаты
	
	// регенерируем форму
	_УправлениеЭлементамиФормы();
	
	// --- 
	Если (НЕ Объект.Корректировка) Тогда
		
		Если (ЗначениеЗаполнено(Объект.ВедомыйСчет)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйСчет);
		КонецЕсли;
		Если (ЗначениеЗаполнено(Объект.ВедомыйДокумент)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйДокумент);
		КонецЕсли; 
		Если (ЗначениеЗаполнено(Объект.ВедомыйСчетФактура)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйСчетФактура);
		КонецЕсли; 
		
	Иначе
		
		Если (ЗначениеЗаполнено(Объект.ВедомыйСчетКорректировочный)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйСчетКорректировочный);
		КонецЕсли; 
		Если (ЗначениеЗаполнено(Объект.ВедомыйДокументКорректировки)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйДокументКорректировки);
		КонецЕсли; 
		Если (ЗначениеЗаполнено(Объект.ВедомыйСчетФактураКорректировочный)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйСчетФактураКорректировочный);
		КонецЕсли;
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если (ИмяСобытия = "ВыполненаЗаписьДокумента") Тогда
		
		Прочитать();
		_УправлениеЭлементамиФормы();
		
	ИначеЕсли ИмяСобытия = "ОбновитьСписокУслугПоПротоколу" Тогда
		
		УстановитьАдресСпискаУслугПоДоговору();
		
	ИначеЕсли ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
		
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	ИначеЕсли ИмяСобытия = "ОбновитьКоментарийДоговораНаФрме" Тогда
		
		УстановитьЗаголовокНадписиКомментарияДоговора();
		
	ИначеЕсли ИмяСобытия = "ОбновитьАдресУслугДоговора" Тогда
		
		ОбработатьОповещениеИзмененияСпискаУслуг();
		
	ИначеЕсли ИмяСобытия = "Запись_CW_Грузоперевозки" Тогда
		
		#Область Динамический_вывод_дополнительных_колонок
		
		ОбновитьЗначенияПараметровГрузоперевозокнаСервере();
		
		#КонецОбласти
		
		//Подистема.CW_ПланированиеДДС
	ИначеЕсли ИмяСобытия = "Запись_CW_ПланированиеДДС" Тогда
		
		ОбновитьЗаголовокСтраницы()
		//Подистема.CW_ПланированиеДДС
		
		//Наличие прикрепленных файлов
	ИначеЕсли ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
		
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
		//Наличие прикрепленных файлов
		
		УстановитьВидимостьКомандЭДО();
	
		//Подсистема.СтатусыДокументов
	ИначеЕсли ИмяСобытия = "Изменение_СтатусДокумента" Тогда
		
		ОбработатьОповещениеИзменениеСтатусДокументаНаСервере();
		//Подсистема.СтатусыДокументов     
		
	ИначеЕсли ИмяСобытия = "ПодключенСервисРеестрНДС0" Тогда
		
		ПодключитьОбработчикОжидания("ПоказатьРекламныйБаннерВДокументе", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		УстановитьВидимостьКомандЭДО();
		
	КонецЕсли;
	
КонецПроцедуры

//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()
	
	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
//Наличие прикрепленных файлов


&НаСервере
Процедура ОбновитьЗначенияПараметровГрузоперевозокнаСервере()
	
	Если Объект.Услуги.Количество() > 0 Тогда
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	КонецЕсли;
	
КонецПроцедуры	
	

&НаСервере
Процедура ОбработатьОповещениеИзмененияСпискаУслуг()
	
	УстановитьАдресСпискаУслугПоДоговору();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
		ОповеститьОбИзменении(Объект.Ссылка);
		
		//
		//Оповестить("ФинансыДоходыОбновить");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	_ОбновитьСтатусПометокУдаления();
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	Если ИспользоватьДопРеквизиты Тогда
		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
		// Конец СтандартныеПодсистемы.Свойства
	КонецЕсли;

	//ДатыЗапретаИзменения
	//Проверяем дату запрета по документам БУ
	мОбъектыПроверки = ПолучитьМассивОбъектовДляПроверки();
	Для Каждого ЭлементМассива из мОбъектыПроверки Цикл
		//Есть ведомые документы, проверяем дату запрета редактирования БП
		ОбъектМассива = ЭлементМассива.ПолучитьОбъект();
		Разрешено = ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ОбъектМассива);
		Если не Разрешено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//ДатыЗапретаИзменения
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОбъектовДляПроверки()
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ВедомыйДокумент) Тогда
		Результат.Добавить(Объект.ВедомыйДокумент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчетФактура) Тогда
		Результат.Добавить(Объект.ВедомыйСчетФактура);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчет) Тогда
		Результат.Добавить(Объект.ВедомыйСчет);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйДокументКорректировки) Тогда
		Результат.Добавить(Объект.ВедомыйДокументКорректировки);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчетФактураКорректировочный) Тогда
		Результат.Добавить(Объект.ВедомыйСчетФактураКорректировочный);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчетКорректировочный) Тогда
		Результат.Добавить(Объект.ВедомыйСчетКорректировочный);
	КонецЕсли;

	
	Возврат Результат; 
	
КонецФункции


&НаСервере
Процедура УстановитьАдресСпискаУслугПоДоговору()
	
	АдресУслугПоДоговору = "";
	Если ОграничиватьУслугиПоДоговорам и ЗначениеЗаполнено(Объект.Договор) Тогда
		//Услуги по договру
		ЕстьОграниченияПоСпискуУслуг =?(ЗначениеЗаполнено(Объект.Договор), Объект.Договор.ОграничиватьНоменклатуру, Ложь);
		Если ЕстьОграниченияПоСпискуУслуг Тогда    
			
			ДатаДокумента = Объект.Дата;
			Если Объект.ФормируетсяАкт 
				и ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
				ДатаДокумента = Объект.ДатаАкта;  
			ИначеЕсли Объект.ФормируетсяСчет 
				и ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
				ДатаДокумента = Объект.ДатаСчета;  
			КонецЕсли; 
			
			АдресУслугПоДоговору = _УФС.ОбновитьСписокУслугПоДоговору(ДатаДокумента, Объект.Договор, ЭтаФорма);   
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&наСервере
Процедура УстановитьЗаголовокНадписиКомментарияДоговора()
	
	КомментарийДоговора = ?(Объект.Договор.Пустая(),"", СокрЛП(Объект.Договор.Комментарий));
	
	Элементы.НадписьКомментарийДоговора.Видимость = ОтображатьКомментарийДоговора и ЗначениеЗаполнено(КомментарийДоговора);
	Элементы.НадписьКомментарийДоговора.Заголовок = КомментарийДоговора;
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ИнициализацияФормы 

&НаСервере
Процедура _ИнициализацияФормы()
	// --- 
	
	//_СформироватьЗаголовок();
	// --- 
	_СформироватьОбщиеПараметры();
	// --- 
	_ПроверитьРежимВводаОстатков();
	// --- 
	//_УправлениеЭлементамиФормы();
	// --- 
	_СформироватьКурс();
	// --- 
	_ОбновитьНомераДокументов();
	
	// --- 
	
	Если (Объект.Ссылка.Пустая()) Тогда
		
		Объект.Ответственный = Неопределено;
		
	КонецЕсли; 
	
	Если (Объект.ВидОперации.Пустая()) Тогда
		Если (Объект.Корректировка) Тогда
			Объект.ВидОперации = Объект.КорректируемыйДокумент.ВидОперации;			
		КонецЕсли; 
	КонецЕсли; 
	
	// --- 
	
	// обновление таблицы актов
	Если НЕ Объект.Ссылка.Пустая() И (НЕ Объект.ФормируетсяАкт И НЕ Объект.ФормируетсяСчетФактура) И НЕ ВводОстатковОЗ И НЕ Объект.Корректировка Тогда
		_ОбновитьАкты();
	КонецЕсли; 
	
	// проверяем на закрытие
	Если (НЕ РеквизитФормыВЗначение("Объект").ПроверитьЗакрытиеГрузоперевозок() И НЕ Объект.Корректировка) Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ГруппаИнфо.Видимость = Истина;
		Элементы.ДекорацияИнфо.Заголовок = "Документ доступен только для просмотра, т.к. содержит блокированные грузоперевозки!";
		Элементы.ПолучитьНомер.Доступность = Ложь;
		Элементы.ФормаУстановитьВидОперации.Доступность = Ложь;
		Элементы.ФормаОбщаяКомандаCW_ИнформацияПоЗакрытиюГрузоперевозок.Видимость = Ложь;
		Элементы.УслугиИзменить.Доступность = Ложь;
		Элементы.УслугиУслуги_ПереформироватьПредставление.Доступность = Ложь;
		Элементы.УслугиГруппаЗаполнить.Видимость = Ложь;
		// --- 
		Элементы.ЗачетАвансовЗаполнитьАвансы.Доступность=Ложь;
		Элементы.ЗачетАвансовЗаполнитьАвансы1.Доступность=Ложь;
		Элементы.ЗачетАвансов.ТолькоПросмотр = Истина;
		Элементы.ЗачетАвансовОЗ.ТолькоПросмотр = Истина;
		Элементы.ЗачетАвансовЗачетАвансов_Очистить.Доступность=Ложь;
		Элементы.ЗачетАвансовОЗЗачетАвансовОЗ_Очистить.Доступность=Ложь;
		Элементы.ЗачетАвансовОЗЗачетАвансовОЗ_Открыть.Доступность = Ложь;
		Элементы.ЗачетАвансовЗачетАвансов_Открыть.Доступность = Ложь;
		
		Элементы.НадписьДокументыОбОтгрузке.Доступность = Ложь;
		
		Элементы.Заявки.ТолькоПросмотр = Истина;
		Элементы.СоздатьЗаявку.Доступность = Ложь;
	Иначе
		//Если ЭтотОбъект.ТолькоПросмотр = Ложь Тогда  //AFR-233633
			_ПраваДоступа();
		//КонецЕсли; //AFR-233633
		Элементы.ФормаОбщаяКомандаCW_ИнформацияПоЗакрытиюГрузоперевозок.Видимость = Ложь;
	КонецЕсли; 
	
	// --- 
	
	
	//// видимость доп.действий
	//СписокДействий = _СписокДействий();
	//Если (СписокДействий.Количество() = 0) Тогда
	//	Элементы.ФормаВнешниеДействия.Видимость = Ложь;
	//КонецЕсли; 
	
	Если (НЕ Объект.Организация.Пустая()) Тогда
		
		Если (_ДС().НП.ПодставлятьУполномоченныхЛицПриСозданииДокументов И Объект.Ссылка.Пустая()) Тогда
			
			_ПодставитьПодписантов();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ОбновитьИтогиПоУслугам();
	_ОбновитьСтатусПометокУдаления();
	// --- 
	ОбновитьИтогиПоАвансам();
	
	ЭтаФорма.АвтоЗаголовок = Ложь;
	_СформироватьЗаголовок();
	
	// пометка блокированных грузоперевозок
	АдресДефис = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.CW_ЭлементСписка, ЭтаФорма.УникальныйИдентификатор);
	АдресЗамок = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.CW_Замок, ЭтаФорма.УникальныйИдентификатор);
	ПометитьГрузоперевозки();

	//МассивИсключаемых = Новый Массив;
	//МассивИсключаемых.Добавить("Объект.Услуги.Грузоперевозка");
	//МассивИсключаемых.Добавить("Объект.Услуги.Номенклатура");
	//МассивИсключаемых.Добавить("Объект.Услуги.СтатьяЗатрат");
	//_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма, МассивИсключаемых);
	
	Элементы.УслугиПорядокОтражения.РежимВыбораИзСписка=Истина;
	Элементы.УслугиПорядокОтражения.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	Элементы.УслугиПорядокОтражения.ИсторияВыбораПриВводе=ИсторияВыбораПриВводе.НеИспользовать;
	// --- 
	Элементы.УслугиПорядокОтражения.СписокВыбора.Очистить();
	Элементы.УслугиПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга);
	Элементы.УслугиПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление);
	ПеревыставлениеПоСтавкам = ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
	Если (ПеревыставлениеПоСтавкам) Тогда
		Элементы.УслугиПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам);
	КонецЕсли; 
	Элементы.УслугиПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПрочиеДоходы);
	
	// --- 
	Элементы.УслугиНоменклатурнаяГруппа.Видимость = _ДС().НП.ОтображатьНоменклатурнуюГруппу;
	Элементы.УслугиЕИ.Видимость = _ДС().НП.ОтображатьЕИ;
	Элементы.УслугиКорректировкаЕИ.Видимость = _ДС().НП.ОтображатьЕИ;
	
	// ---------------------------------------------------------------------------- 
	
	_УправлениеЭлементамиФормы();
	// --- 
	_ОбновитьНадписиКорректировок();
	
	Элементы.УслугиКартинкаФинансовогоСтатуса.Видимость = _ДС().НП.ВыводитьФинансовыйСтатусВДокументах;
	
	#Область ЗаполнитьПоНеактированнымСчетам
	
		УстановитьВидимостьКомандыЗаполнитьПоНеактированнымСчетам();
	
	#КонецОбласти
	
	УстановитьПараметрыВыбораСтавкиНДС();
	
	// ---------------------------------------------------------------------------- 
	ФормаИнициализирована = Истина;
	
КонецПроцедуры


&НаСервере
Процедура _СформироватьЗаголовок()
	// управляемое прилолжение
	
	Если (НЕ Объект.Корректировка) Тогда
		ВидОперацииСтрокой = ?(ЗначениеЗаполнено(Объект.ВидОперации), "("+нрег(Объект.ВидОперации)+")", "");
	Иначе
		ВидОперацииСтрокой = "(корректировка)";
	КонецЕсли; 
	
	ЗаголовокДокумента = 
		"Доходы по грузоперевозке" + " " 
		+ ВидОперацииСтрокой
		+ ?(ЗначениеЗаполнено(Объект.Ссылка), " "+Объект.Номер+" от "+Объект.Дата, " (создание)")
	;
	ЭтаФорма.Заголовок = ЗаголовокДокумента;
КонецПроцедуры

&НаСервере
Процедура _ПраваДоступа()
	
	БазоваяВалютаРубль 	= Константы.CW_ВалютаРегламентированногоУчетаРубль.Получить();
						
	ЭтоСчет 	= Объект.ФормируетсяСчет;
	ЭтоАкт 		= Не Объект.ФормируетсяСчет и (Объект.ФормируетсяАкт или Объект.ФормируетсяСчетФактура);
	ЭтоПакет 	= Объект.ФормируетсяСчет и (Объект.ФормируетсяАкт или Объект.ФормируетсяСчетФактура);

	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов");
	
	Если ПравоРедактирования и Объект.Корректировка Тогда
		ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Корректировки");
	КонецЕсли;
	
	Если ПравоРедактирования и ЭтоСчет Тогда
		ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Счета");
	Конецесли;
	
	Если БазоваяВалютаРубль Тогда
		
		Если ПравоРедактирования и ЭтоАкт Тогда
			ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Акты");
		Конецесли;
		
		Если ПравоРедактирования Тогда
			
			РедактированиеАктированныхСчетов = CW_ПраваДоступа.ПравоДоступно("РазрешитьРедактированиеИсходящихАктированныхСчетов");
			Если НЕ РедактированиеАктированныхСчетов Тогда
				
				Если ЭтоПакет Тогда
					ПравоРедактирования = Ложь;
				КонецЕсли;
				
				Если ПравоРедактирования Тогда
					
					// проверяем, что нет сформированных актов
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	CW_СоответствиеАктовИсходящимСчетам.Акт КАК Акт
					|ИЗ
					|	РегистрСведений.CW_СоответствиеАктовИсходящимСчетам КАК CW_СоответствиеАктовИсходящимСчетам
					|ГДЕ
					|	CW_СоответствиеАктовИсходящимСчетам.Счет = &Счет";
					
					Запрос.УстановитьПараметр("Счет", Объект.Ссылка);
					РезультатЗапроса = Запрос.Выполнить();
					
					ПравоРедактирования = РезультатЗапроса.Пустой();
					
				КонецЕсли;
				
			Конецесли;
			
		Конецесли;
		
	Конецесли;
	
	Если ПравоРедактирования Тогда
		
		РедактированиеОплаченныхСчетов 	= CW_ПраваДоступа.ПравоДоступно("РазрешитьРедактированиеИсходящихОплаченныхСчетов");
		Если Не РедактированиеОплаченныхСчетов Тогда	
			
			// проверяем, нет ли оплат
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	CW_ОплатаИсходящихДокументов.ДокументОплаты КАК ДокументОплаты
			|ИЗ
			|	РегистрСведений.CW_ОплатаИсходящихДокументов КАК CW_ОплатаИсходящихДокументов
			|ГДЕ
			|	CW_ОплатаИсходящихДокументов.Документ = &Документ";
			Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ПравоРедактирования = РезультатЗапроса.Пустой();
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Управление элементами формы
	ЭтаФорма.ТолькоПросмотр = НЕ ПравоРедактирования;
	
	Элементы.УслугиГруппаЗаполнить.Видимость 				= ПравоРедактирования;
	Элементы.УслугиОчиститьТабличнуюЧастьУслуг.Видимость 	= ПравоРедактирования;
	Элементы.УслугиУслуги_ГрупповоеРедактирование.Видимость = ПравоРедактирования;
	
	Элементы.УслугиПодбор.Видимость 	= ПравоРедактирования;
	Элементы.УслугиИзменить.Доступность = ПравоРедактирования;
	
	Элементы.УслугиУслуги_ПереформироватьПредставление.Доступность = ПравоРедактирования;
	
	Элементы.УслугиГруппаЗаполнить.Видимость = ПравоРедактирования;
	
	Элементы.ГруппаКорректируемыйДокумент.Доступность 			= ПравоРедактирования;
	Элементы.ГруппаВедомыйДокумент.Доступность 					= ПравоРедактирования;
	Элементы.ГруппаВедомыеДокументыКорректировки.Доступность 	= ПравоРедактирования;

	
	ПравоПросмотраБухгалтерскихОбъектов 					= CW_ПраваДоступа.ДоступныОбъектыБухгалтерии();
	Элементы.ГруппаКорректируемыйДокумент.Видимость 		= Объект.Корректировка;
	Элементы.ГруппаВедомыйДокумент.Видимость 				= ПравоПросмотраБухгалтерскихОбъектов И НЕ Объект.Корректировка;
	Элементы.ГруппаВедомыеДокументыКорректировки.Видимость 	= ПравоПросмотраБухгалтерскихОбъектов И Объект.Корректировка;
	
	РедактированиеСтавкиНДС = CW_ПраваДоступа.ПравоДоступно("РедактированиеСтавкиНДС");
	Элементы.УслугиСтавкаНДС.Доступность = РедактированиеСтавкиНДС и ПравоРедактирования;
	//Управление элементами формы
	
КонецПроцедуры

&НаСервере
Процедура _ПроверитьРежимВводаОстатков()
	
	// контроль параметров учетной политики можно осуществить только при условии того, 
	// что в документе были заполнены организация и договор
	Если _ДС().Свойство("УП") Тогда
		ВводОстатковБУ = _ДС().УП.ВводОстатковБУ;
		ДатаНачалаВеденияУчетаБУ = _ДС().УП.ДатаНачалаВеденияУчетаБУ;
		
		ОперативныйУчет = _ДС().УП.ОЗ;
		
		РаздельныйУчетЗаполженности = _ДС().УП.РаздельныйУчетОперативнойИБухгалтерскойЗадолженности;
		ПереплатаКакАванс 			= _ДС().УП.УчитыватьПереплатыПоДокументамКакАванс;
		
		ВводОстатковОЗ = _ДС().УП.ВводОстатковОЗ;
		ДатаНачалаВеденияУчетаОЗ = _ДС().УП.ДатаНачалаВеденияУчетаОЗ;
	Иначе
		ВводОстатковБУ = Дата(1,1,1);
		ДатаНачалаВеденияУчетаБУ = Дата(1,1,1);

		РаздельныйУчетЗаполженности = Истина;
		ПереплатаКакАванс 			= Ложь;
		
		ОперативныйУчет = Ложь;
		ВводОстатковОЗ = Ложь;
		ДатаНачалаВеденияУчетаОЗ = Дата(1,1,1);
	КонецЕсли;
	

	Если ВводОстатковБУ Тогда
		Элементы.УслугиВводОстатков.Заголовок = "Не перевыставлены на "+Формат(ДатаНачалаВеденияУчетаБУ,"ДФ=dd.MM.yyyy");
		Элементы.ГруппаНачальныеОстаткиБУ.Заголовок = "Сальдо по бухгалтерскому учёту на "+Формат(ДатаНачалаВеденияУчетаБУ,"ДФ=dd.MM.yyyy");
	КонецЕсли; 
	
	Если Объект.ВводОстатковБУ <> ВводОстатковБУ Тогда
		Объект.ВводОстатковБУ = ВводОстатковБУ;
	КонецЕсли; 
	
	Если ВводОстатковОЗ Тогда
		Элементы.ГруппаНачальныеОстаткиОЗ.Заголовок = "Сальдо по оперативному учёту на "+Формат(ДатаНачалаВеденияУчетаОЗ,"ДФ=dd.MM.yyyy");
		Элементы.УслугиНеактированноеСальдо.Заголовок = "Неактированное сальдо на "+Формат(ДатаНачалаВеденияУчетаОЗ,"ДФ=dd.MM.yyyy");
	КонецЕсли; 
	
	Если Объект.ВводОстатковОЗ <> ВводОстатковОЗ Тогда
		Объект.ВводОстатковОЗ = ВводОстатковОЗ;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПроверитьБлок()
	// --- 
	
	Блок = Ложь;
	Для Каждого Стр из Копия.Услуги Цикл
		Если НЕ ПроверитьГрузоперевозку(?(ЗначениеЗаполнено(Стр.Грузоперевозка.Заказ), Стр.Грузоперевозка.Заказ, Стр.Грузоперевозка)) Тогда 
			Блок = Истина;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат(Блок);
	
	// --- 
КонецФункции


&НаСервере
Процедура ПометитьГрузоперевозки()
	
	Для Каждого Стр из Объект.Услуги Цикл
		Попытка
			Если ПроверитьГрузоперевозку(?(ЗначениеЗаполнено(Стр.Грузоперевозка.Заказ), Стр.Грузоперевозка.Заказ, Стр.Грузоперевозка)) Тогда
				//			Стр.БлокГП = АдресДефис;
				Стр.БлокГП = Неопределено;
			Иначе
				Стр.БлокГП = АдресЗамок;
			КонецЕсли;	
		исключение
			Стр.БлокГП = Неопределено;
		КонецПопытки;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Функция ПроверитьГрузоперевозку(ГП)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	CW_ЗакрытиеФинансов.Аналитика
		|ИЗ
		|	РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
		|ГДЕ
		|	CW_ЗакрытиеФинансов.Аналитика = &Аналитика";
	Запрос.УстановитьПараметр("Аналитика", ГП);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ?(ТЗ.Количество() = 0, Истина, Ложь);
	
КонецФункции	


&НаСервере
Процедура УстановитьПараметрыВыбораСтавкиНДС() Экспорт
	
	Если Объект.Корректировка Тогда
		ИмяРеквизитаСтавкаНДС = "УслугиКорректировкаСтавкаНДС";
	Иначе
		ИмяРеквизитаСтавкаНДС = "УслугиСтавкаНДС";
	КонецЕсли;
	
	CW_БухгалтерияЭкспедитораСерверПереопределяемый.УстановитьПараметрыВыбораСтавкиНДС(ЭтотОбъект, ИмяРеквизитаСтавкаНДС);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбщиеПараметры 

Функция _ДС()
	Возврат(ДС[0].Значение);
КонецФункции

&НаСервере
Процедура _СформироватьОбщиеПараметры(СписокПараметров=Неопределено) Экспорт
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.СформироватьОбщиеПараметры(СписокПараметров);
	
	Если СписокПараметров = Неопределено Тогда
		ДС.Очистить();
		ДС.Добавить(ДокументОбъект.ДополнительныеСвойства);
	Иначе
		
		СоответствиеПарамеров = Новый Соответствие;
		СоответствиеПарамеров.Вставить("ПараметрыДоговора","ПД");
		СоответствиеПарамеров.Вставить("Константы","КО");
		СоответствиеПарамеров.Вставить("УчетнаяПолитика","УП");
		СоответствиеПарамеров.Вставить("НастройкиПользователя","НП");
		
		МассивПараметров = _сф.м_СоздатьИзСтроки(СписокПараметров,",");
		
		Если (ДС.Количество()=0) Тогда
			ДС.Добавить(Новый Структура());
		КонецЕсли; 
		ДСС = _ДС();
		
		Для каждого Параметр Из МассивПараметров Цикл
			
			Ключ = СоответствиеПарамеров.Получить(Параметр);
			_сф.ст_УстановитьСвойство(ДСС,Ключ,ДокументОбъект.ДополнительныеСвойства[Ключ]);
			
		КонецЦикла; 
		
		ДС.Очистить();
		ДС.Добавить(ДСС);
		
	КонецЕсли; 
	
	_ПроверитьРежимВводаОстатков();
	
КонецПроцедуры

#КонецОбласти 

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	// обновим итоги
	ОбновитьИтогиПоУслугам();
	ОбновитьИтогиПоАктированию();
	ОбновитьИтогиПоАвансам();
	
	// шапка документа
	Элементы.КурсВалюты.Видимость = (НЕ Объект.Валюта.Пустая() И Объект.Валюта <> _ДС().КО.ВалютаРегламентированногоУчета);
	//Элементы.КурсВалюты.КнопкаВыбора = (Объект.Договор.ВзаиморасчетыВУЕ);
	//Элементы.КурсВалюты.ТолькоПросмотр = НЕ Объект.Договор.ВзаиморасчетыВУЕ;
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);

	ЗачетАвансовБУ = (Объект.ФормируетсяАкт И ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет);
	ЗачетАвансовОЗ = (Объект.ФормируетсяСчет И ?(_ДС().Свойство("УП"),_ДС().УП.ОЗ,Ложь));
	
	// закладки
	мЭтоСчет = (Объект.ФормируетсяСчет) И (НЕ Объект.ФормируетсяАкт) И (НЕ Объект.ФормируетсяСчетФактура); 	
	
	// видимость закладок
	Элементы.СтраницаУслуги.Видимость = (НЕ Объект.Корректировка);
	Элементы.СтраницаУслугиКорректировка.Видимость = (Объект.Корректировка);
	Элементы.СтраницаАкты.Видимость = мЭтоСчет И (НЕ Объект.Ссылка.Пустая()) И (НЕ ВводОстатковОЗ) И НЕ Объект.Корректировка и ВалютаРегламентированногоУчетаРубль;
	Элементы.СтраницаЗачетАвансов.Видимость = (Объект.СпособЗачетаАвансов=Перечисления.СпособыЗачетаАвансов.ПоДокументу И ЗачетАвансовБУ);
	Элементы.СтраницаЗачетАвансовОЗ.Видимость = (Объект.СпособЗачетаАвансовОЗ=Перечисления.СпособыЗачетаАвансов.ПоДокументу И ЗачетАвансовОЗ);
	Элементы.СтраницаПлатёжноРасчётныеДокументы.Видимость = 
		Объект.ФормируетсяСчетФактура 
		И (Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ=Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.ПоДокументу);
	Элементы.ПлатёжноРасчётныеДокументы.ТолькоПросмотр = НЕ (Объект.ФормируетсяСчетФактура И (Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ=Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.ПоДокументу));
	
	// заголовки закладок
	Элементы.СтраницаКомментарий.Заголовок = " Комментарий" +?(ЗначениеЗаполнено(Объект.Комментарий)," (*)","");
	Элементы.СтраницаУслуги.Заголовок = " Услуги (" +Объект.Услуги.Количество() + ")";
	Элементы.СтраницаАкты.Заголовок = " Акты (" +ТаблицаАктов.Количество() + ")";
	Элементы.СтраницаЗачетАвансовОЗ.Заголовок = " Зачет опер.авансов (" +Объект.ЗачетАвансовОЗ.Количество() + ")";
	Элементы.СтраницаЗачетАвансов.Заголовок = " Зачет бух.авансов (" +Объект.ЗачетАвансов.Количество() + ")";
	Элементы.СтраницаПлатёжноРасчётныеДокументы.Заголовок = " Платёжно-расчётные документы с/ф (" + Объект.ПлатёжноРасчётныеДокументы.Количество() + ")";
	
	// таблица услуг
	//Элементы.УслугиЗаказ.Видимость = _ДС().КО.CW_ИспользованиеЗаказов;
	Элементы.УслугиВсего.ТолькоПросмотр = (НЕ _ДС().НП.ОбратныйПересчетВДокументах);
	Элементы.УслугиГруппаСчет.Видимость = Объект.СписокСчетов;
	//Элементы.УслугиПроверитьДокументПоБюджету.Видимость = _ДС().КО.CW_ИспользованиеБюджетирования;
	Элементы.УслугиГруппаПоНеперевыставленным.Видимость = (Объект.ВидОперации=Перечисления.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг);
	Элементы.УслугиЗаполнитьРасчетАгентскогоВознаграждения.Видимость = (Истина);
	Элементы.УслугиЗаполнитьРасчетАгентскогоВознаграждения.Видимость = ?(Объект.ВидОперации = Перечисления.CW_ВидыОперацийДоходыПоГрузоперевозке.ОтчетАгента, Истина, Ложь);
	
	// ведомый счет 
	Элементы.ВедомыйСчетКорректировочный_Удалить.Видимость = НЕ Объект.ВедомыйСчетКорректировочный.Пустая() И (Объект.ФормируетсяСчет И Объект.ВедомыйСчетКорректировочный.ПометкаУдаления);
	
	
	// ведомый документ "Реализация т/у"
	Элементы.ВедомыйДокумент_Движения.Видимость 			= (НЕ Объект.ВедомыйДокумент.Пустая()  И Объект.ВедомыйДокумент.Проведен 	И ВалютаРегламентированногоУчетаРубль);
	Элементы.ВедомыйДокумент_Удалить.Видимость 				= (НЕ Объект.ВедомыйДокумент.Пустая()  И НЕ Объект.ФормируетсяАкт 			И ВалютаРегламентированногоУчетаРубль);
	Элементы.ГруппаДействияСВедомойРеализацией.Видимость 	= НЕ Объект.ВедомыйДокумент.Пустая()   И (Элементы.ВедомыйДокумент_Движения.Видимость ИЛИ Элементы.ВедомыйДокумент_Удалить.Видимость и ВалютаРегламентированногоУчетаРубль);
	
	// ведомый документ "Корректировка реализации т/у"
	Элементы.ВедомыйДокументКорректировочный_Движения.Видимость 			= (НЕ Объект.ВедомыйДокументКорректировки.Пустая()  И Объект.ВедомыйДокументКорректировки.Проведен 	И ВалютаРегламентированногоУчетаРубль);
	Элементы.ВедомыйАктКорректировочный_Удалить.Видимость  = (НЕ Объект.ВедомыйДокументКорректировки.Пустая()  И НЕ Объект.ФормируетсяАкт И ВалютаРегламентированногоУчетаРубль);
	
	
	// ведомая счёт-фактура
	Элементы.ОбщаяКомандаCW_ДвиженияВедомого.Видимость 		= (НЕ Объект.ВедомыйСчетФактура.Пустая() И Объект.ВедомыйСчетФактура.Проведен 	И ВалютаРегламентированногоУчетаРубль);
	Элементы.ВедомыйСчетФактура_Удалить.Видимость 			= (НЕ Объект.ВедомыйСчетФактура.Пустая() И НЕ Объект.ФормируетсяСчетФактура 	И ВалютаРегламентированногоУчетаРубль);
	
	// ведомая корректировочная счёт-фактура
	Элементы.ВедомыйСФКорректировочный_Движения.Видимость 		= (НЕ Объект.ВедомыйСчетФактураКорректировочный.Пустая() И Объект.ВедомыйСчетФактураКорректировочный.Проведен 	И ВалютаРегламентированногоУчетаРубль);
	Элементы.ВедомыйСФКорректировочный_Удалить.Видимость  = (НЕ Объект.ВедомыйСчетФактураКорректировочный.Пустая()  И НЕ Объект.ФормируетсяСчетФактура И ВалютаРегламентированногоУчетаРубль);
	
	
	Элементы.ГруппаДействияСВедомойСчетФактурой.Видимость 	= НЕ Объект.ВедомыйСчетФактура.Пустая()  И (Элементы.ОбщаяКомандаCW_ДвиженияВедомого.Видимость ИЛИ Элементы.ВедомыйСчетФактура_Удалить.Видимость и ВалютаРегламентированногоУчетаРубль);
	
	// ведомый документ "Счет покупателю"
	Элементы.ГруппаДействияСВедомымСчетом.Видимость = (НЕ Объект.ВедомыйСчет.Пустая() И НЕ Объект.ФормируетсяСчет);
	
	// ввод остатков
	Элементы.УслугиВводОстатков.Видимость = ВводОстатковБУ И (Объект.ФормируетсяАкт);
	Элементы.УслугиНеактированноеСальдо.Видимость = ВводОстатковОЗ И (Объект.ФормируетсяСчет) И (НЕ Объект.ФормируетсяАкт И НЕ Объект.ФормируетсяСчетФактура);
	Элементы.ГруппаНачальныеОстаткиБУ.Видимость = ВводОстатковБУ И (Объект.ФормируетсяАкт);
	Элементы.ГруппаНачальныеОстаткиОЗ.Видимость = ВводОстатковОЗ И (Объект.ФормируетсяСчет);
	Элементы.КурсВзаиморасчетовБУ.Видимость = Объект.Договор.ВзаиморасчетыВУЕ;
	Элементы.КурсВзаиморасчетовОЗ.Видимость = (Объект.Договор.ВалютаДоговора <> _ДС().КО.ВалютаРегламентированногоУчета);
	
	// кнопки нижней панели и меню "Действия"
	Элементы.ФормаОбщаяКомандаCW_ФайлыАрхива.Видимость = Константы.CW_ИспользованиеФайловогоАрхива.Получить();
	Элементы.ФормаДокументCW_КорректировкаАктированияСчетовСоздатьНаОсновании.Видимость = (Объект.ФормируетсяСчет) И (НЕ Объект.ФормируетсяАкт И НЕ Объект.ФормируетсяСчетФактура) И (НЕ Объект.Ссылка.Пустая());
	
	// отчеты
	Элементы.ФормаОбщаяКомандаCW_ОтчетНеперевыставленныеЗатраты.Видимость = (Объект.ФормируетсяАкт);
	Элементы.ФормаОбщаяКомандаCW_ОтчетВедомостьНеперевыставленныхЗатрат.Видимость = (Объект.ФормируетсяАкт);
	Элементы.ФормаОбщаяКомандаCW_ОтчетВедомостьПеревыставленияПоСтавкам.Видимость = ((Не ВалютаРегламентированногоУчетаРубль) или (Объект.ФормируетсяАкт));
	Элементы.ФормаОбщаяКомандаCW_ОтчетВедомостьАктированияСчетов.Видимость = (Объект.ФормируетсяСчет);

	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	//Исправления
	УстановитьВидимостьЭлементовИсправления();
	//Исправления

КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// РЕКВИЗИТЫ
// ---------------------------------------------------------------------------- 

#Область ПакетДокументов 

&НаСервере
Процедура _ОбновитьНомераДокументов()
	
	ЭтоУПД =  Объект.ФормируетсяАкт И Объект.ЭтоУниверсальныйДокумент; 
	
	Элементы.ПредставлениеАкта.Видимость 		 = НЕ ЭтоУПД;
	Элементы.ПредставлениеСчетаФактуры.Видимость = НЕ ЭтоУПД;  
	Элементы.ПредставлениеУПД.Видимость 		 = ЭтоУПД; 

	// Представление счета
	Если Объект.ФормируетсяСчет Тогда  
		
		Если ЗначениеЗаполнено(Объект.НомерСчета) Тогда
			ПредставлениеНомераСчета = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерСчета, Объект.ДатаСчета));	 
		Иначе
			ПредставлениеНомераСчета = "<...>";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
			ПредставлениеДатыСчета	= Формат(Объект.ДатаСчета, "ДФ=dd.MM.yyyy");
		Иначе
			ПредставлениеДатыСчета 	= "<...>";	
		КонецЕсли;
	
		//План оплаты
		ПредставлениеСрокаОплаты = "";
		ДанныеПланаОплаты = CW_Документы.ПолучитьПланОплаты(Объект.Ссылка);
		Если Не ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) и НЕ ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
			ПредставлениеСрокаОплаты = ", План оплаты: <...>";
		ИначеЕсли ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) Тогда
			ПредставлениеСрокаОплаты = ", План оплаты: "+Формат(ДанныеПланаОплаты.Дата,"ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если Не ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
			ПредставлениеСрокаОплаты = ПредставлениеСрокаОплаты + " ("+СокрЛП(ДанныеПланаОплаты.Примечание)+")";
		КонецЕсли; 
		//План оплаты
		
		ПредставлениеСчета = "Счет №" +ПредставлениеНомераСчета +  " от "+ ПредставлениеДатыСчета + ПредставлениеСрокаОплаты;
	
	// счет не формируется
	Иначе
		ПредставлениеСчета = "<Счёт не формируется>";
	КонецЕсли; 
	// Представление счета
	
	// акт формируется  
	Если Не ЭтоУПД Тогда 
		
		//Представление акта
		Если Объект.ФормируетсяАкт Тогда
			
			Если ЗначениеЗаполнено(Объект.НомерАкта) Тогда
				ПредставлениеНомераАкта = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерАкта, Объект.ДатаАкта));	 
			Иначе
				ПредставлениеНомераАкта = "<...>";	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
				ПредставлениеДатыАкта  = Формат(Объект.ДатаАкта, "ДФ=dd.MM.yyyy");
			Иначе
				ПредставлениеДатыАкта = "<...>";	
			КонецЕсли;
			
			ПредставлениеОбъектаВнешнегоСчета = "";
			Если Объект.СписокСчетов и НЕ ВводОстатковОЗ Тогда
				ПредставлениеОбъектаВнешнегоСчета = " к списку счетов";
			Конецесли;  
			
			Если НЕ Объект.ФормируетсяСчет и НЕ Объект.СписокСчетов Тогда 
				Если Объект.Счет.Пустая() Тогда  
					ПредставлениеВнешнегоСчета = " <не указан>";
				Иначе   
					ПредставлениеНомераВнешнегоСчета = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.Счет.НомерСчета, Объект.Счет.ДатаСчета));	 
					ПредставлениеДатыВнешнегоСчета 	 = Формат(Объект.Счет.ДатаСчета, "ДФ=dd.MM.yyyy"); 
					
					ПредставлениеВнешнегоСчета 		= ПредставлениеНомераВнешнегоСчета + " от "+ПредставлениеДатыВнешнегоСчета;
				КонецЕсли;
				
				ПредставлениеОбъектаВнешнегоСчета = "  к счёту №" + ПредставлениеВнешнегоСчета;
			КонецЕсли;
			
			ПредставлениеАкта = "Акт №" + ПредставлениеНомераАкта + " от " + ПредставлениеДатыАкта + ПредставлениеОбъектаВнешнегоСчета;
			
			// акт не формируется
		Иначе
			ПредставлениеАкта = "<Акт не формируется>";
		КонецЕсли; 
		//Представление акта  
		

		// Представление с/ф 
		Если Объект.ФормируетсяСчетФактура Тогда   
			
			Если ЗначениеЗаполнено(Объект.НомерСчетаФактуры) Тогда
				ПредставлениеНомераСчетФактура = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерСчетаФактуры, Объект.ДатаСчетаФактуры));	 
			Иначе
				ПредставлениеНомераСчетФактура = "<...>";	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ДатаСчетаФактуры) Тогда
				ПредставлениеДатыСчетФактура 	 = Формат(Объект.ДатаСчетаФактуры, "ДФ=dd.MM.yyyy");
			Иначе
				ПредставлениеДатыСчетФактура = "<...>";	
			КонецЕсли;    
			
			ПредставлениеИсправленияСчетФактура = "";
			Если ЗначениеЗаполнено(Объект.НомерИсправления) 
				И Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
				ПредставлениеИсправленияСчетФактура  =  " (испр. "+Формат(Объект.НомерИсправления, "ЧГ=0")+")";
			КонецЕсли;    
			
			ПредставлениеСчетаФактуры = "С/ф №" + ПредставлениеНомераСчетФактура + ПредставлениеИсправленияСчетФактура+" от " + ПредставлениеДатыСчетФактура;
			
		Иначе
			ПредставлениеСчетаФактуры = "<С/ф не формируется>";
		КонецЕсли; 
		// Представление с/ф 
		
		
	КонецЕсли;
	
	Если ЭтоУПД Тогда 
		
		ВидУПД = "УПД";	
		Если Объект.Корректировка и Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") Тогда
			ВидУПД = "УКД";	
		КонецЕсли;  
		
		ПредставлениеОбъектаВнешнегоСчета = "";  
		Если Объект.СписокСчетов и НЕ ВводОстатковОЗ Тогда
			ПредставлениеОбъектаВнешнегоСчета = " к списку счетов";
		КонецЕсли;  
		
		Если НЕ Объект.ФормируетсяСчет и НЕ Объект.СписокСчетов Тогда 
			Если Объект.Счет.Пустая() Тогда  
				ПредставлениеВнешнегоСчета = " <не указан>";
			Иначе   
				ПредставлениеНомераВнешнегоСчета = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.Счет.НомерСчета, Объект.Счет.ДатаСчета));	 
				ПредставлениеДатыВнешнегоСчета 	 = Формат(Объект.Счет.ДатаСчета, "ДФ=dd.MM.yyyy"); 
				
				ПредставлениеВнешнегоСчета 		= ПредставлениеНомераВнешнегоСчета + " от "+ПредставлениеДатыВнешнегоСчета;
			КонецЕсли;
			
			ПредставлениеОбъектаВнешнегоСчета = "  к счёту №" + ПредставлениеВнешнегоСчета;
		КонецЕсли;
		
	
		ПредставлениеИсправленияУПД = "";
		Если Объект.ФормируетсяСчетФактура Тогда  
			СтатусУПД 				= "(1)";
			ПредставлениеНомераУПД	= CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерСчетаФактуры, Объект.ДатаСчетаФактуры));
			ПредставлениеНомераУПД	= " №"+ ?(ПустаяСтрока(ПредставлениеНомераУПД), "<...>", 	ПредставлениеНомераУПД);
			ПредставлениеДатыУПД 	= ?(Объект.ДатаСчетаФактуры = Дата(1,1,1),		"<...>",	Формат(Объект.ДатаСчетаФактуры,"ДФ=dd.MM.yyyy"));
			
			Если ЗначениеЗаполнено(Объект.НомерИсправления) 
				И Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
				ПредставлениеИсправленияУПД  =  " (испр. "+Формат(Объект.НомерИсправления, "ЧГ=0")+")";
			КонецЕсли;    
			
		Иначе
			СтатусУПД 				= "(2)";
			ПредставлениеНомераУПД	= CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Объект.Организация, Объект.НомерАкта, Объект.ДатаАкта));
			ПредставлениеНомераУПД	= " №"+ ?(ПустаяСтрока(ПредставлениеНомераУПД), "<...>", 	ПредставлениеНомераУПД);
			ПредставлениеДатыУПД 	= ?(Объект.ДатаАкта = Дата(1,1,1),				"<...>",	Формат(Объект.ДатаАкта,"ДФ=dd.MM.yyyy"));
		КонецЕсли;  
		
		ПредставлениеУПД = ВидУПД + СтатусУПД + ПредставлениеНомераУПД + ПредставлениеИсправленияУПД+" от "+ ПредставлениеДатыУПД + ПредставлениеОбъектаВнешнегоСчета;
		
	КонецЕсли;
	
	ВедомыйДокументСчет = Строка(Объект.ВедомыйСчет);
	ВедомыйДокументРеализация = Строка(Объект.ВедомыйДокумент);
	ВедомыйДокументСчетФактура = Строка(Объект.ВедомыйСчетФактура);
	
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеНомера 

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	// 2016.03.31
	// ничего не делаем, номера ведомых полностью контроллируются пользователем
	
КонецПроцедуры


&НаСервере
Функция _ИспользуетсяПакетнаяНумерация()
	
	ПорядокПрисвоенияНомеров = CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата,Объект.Организация,"ПорядокПрисвоенияНомеров");
	Если (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) Или
		 (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация)	
	Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

#КонецОбласти 

#Область ИзменениеДаты 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Если (_ГодИзменился()) Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаИзмененияГода",ЭтотОбъект, Новый Структура()); 
			ПоказатьВопрос(ПОВ,"Дата документа перенесена в другой год."+Символы.ПС+ 
			"Документу будет присвоен новый номер."+Символы.ПС+ 
			"Продолжить?",РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			ДиалогСменыДатыВедомых();
			
		КонецЕсли; 
	КонецЕсли;
	
	_ДатаПриИзменении(); 
	
КонецПроцедуры

&НаСервере
Процедура _ДатаПриИзменении()
	
	// если очистили дату, то принудительно 
	// устанавливаем текущую дату
	Если (Объект.Дата = Дата(1,1,1)) Тогда
		Объект.Дата = CW_Документы.РабочееВремя();
	КонецЕсли;
	
	// необходимо обновить параметры учётной политики и параметры договора
	_СформироватьОбщиеПараметры("ПараметрыДоговора,УчетнаяПолитика");
	
	// и курс валюты
	_СформироватьКурс();
	
	// проверка на режим ввода остатков
	_ПроверитьРежимВводаОстатков();
	
	// пересчитаем принудительно срок оплаты
	РасчитатьСрокОплатыДокумента();
	
	// актуализируем список услуг по договору (если по договору предусмотрено ограничение)
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		УстановитьАдресСпискаУслугПоДоговору();     
	КонецЕсли;
	
	// регенерация формы 
	_ОбновитьНомераДокументов();
	_УправлениеЭлементамиФормы();
	_СформироватьЗаголовок();
	УстановитьПараметрыВыбораСтавкиНДС();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВопросаИзмененияГода(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			// присваевам новый номер
			_ОбработатьИзменениеГода();
			ДиалогСменыДатыВедомых(); 
			
		Иначе
			
			// восстанавливаем дату по ссылке
			_ВосстановитьДатуДокумента();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбработатьИзменениеГода()
	НачальнаяДатаДокумента = Объект.Дата;
	_ПолучитьНомер();
КонецПроцедуры
 

&НаСервере
Процедура _ВосстановитьДатуДокумента()
	Объект.Дата = НачальнаяДатаДокумента;
	_ДатаПриИзменении();
КонецПроцедуры

&НаСервере
Функция _ГодИзменился()
	// --- 
	
	Возврат(Год(Объект.Дата) <> Год(НачальнаяДатаДокумента));
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ДиалогСменыДатыВедомых()
	// --- 
	
	Если (Объект.ФормируетсяСчет ИЛИ Объект.ФормируетсяАкт ИЛИ Объект.ФормируетсяСчетФактура) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияСменыДатыВедомых",ЭтотОбъект, Новый Структура()); 
		ПоказатьВопрос(ПОВ,"Изменить даты первичных документов?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодтвержденияСменыДатыВедомых(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			_ИзменитьДатыВедомых();
			
			// спросим об изменении номеров ведомых
			ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияСменыНомеровВедомых",ЭтотОбъект, Новый Структура()); 
			ПоказатьВопрос(ПОВ,"Изменить номера ведомых документов?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ИзменитьДатыВедомых()
	// --- 
	
	Если (Объект.ФормируетсяСчет) Тогда
		
		Объект.ДатаСчета = Объект.Дата;
		
	КонецЕсли; 
	Если (Объект.ФормируетсяАкт) Тогда
		
		Объект.ДатаАкта = Объект.Дата;
		
	КонецЕсли; 
	Если (Объект.ФормируетсяСчетФактура) Тогда
		
		Объект.ДатаСчетаФактуры = Объект.Дата;
		
	КонецЕсли; 
	
	// --- 
	
	_ОбновитьНомераДокументов();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодтвержденияСменыНомеровВедомых(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			_ПолучитьНомер();

			ВыполнитьСменуНомеровВедомыхДокументов();
			
		КонецЕсли; 
		
	КонецЕсли; 	
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ВыполнитьСменуНомеровВедомыхДокументов()
	// --- 
	
	Если (Объект.ФормируетсяСчет) Тогда
		
		_УстановитьНомерСчета();
		
	КонецЕсли;
	// --- 
	Если (Объект.ФормируетсяАкт) Тогда
		
		_УстановитьНомерАкта();
		
	КонецЕсли;
	// --- 
	Если (Объект.ФормируетсяСчетФактура) Тогда
		
		_УстановитьНомерСчетаФактуры();
		
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _УстановитьНомерСчета()
	
	ПорядокПрисвоенияНомеров = _ДС().УП.ПорядокПрисвоенияНомеров;
	ВнешнийНумератор = _ДС().УП.ВнешнийНумератор;
	
	Если (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) Или
		 (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация) 
	Тогда
		
		Объект.НомерСчета = Объект.Номер;
		
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда 
		
		НовыйСчет = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
		НовыйСчет.Организация = Объект.Организация;
		НовыйСчет.Дата = Объект.ДатаСчета;
		НовыйСчет.УстановитьНовыйНомер();
		// --- 
		Объект.НомерСчета = НовыйСчет.Номер;
		НовыйСчет = Неопределено;
		
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда 
		
		ОбработкаНумерации = _ПО.ПолучитьОбработку(ВнешнийНумератор);
		ОбработкаНумерации.УстановитьНомерСчета(Объект);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьНомерАкта()
	
	ПорядокПрисвоенияНомеров = _ДС().УП.ПорядокПрисвоенияНомеров;
	ВнешнийНумератор = _ДС().УП.ВнешнийНумератор;
	
	Если (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) ИЛИ
		 (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация) 
	Тогда
		
		Объект.НомерАкта = Объект.Номер;
		
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда 
		
		НовыйАкт = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйАкт.Организация = Объект.Организация;
		НовыйАкт.Дата = Объект.ДатаАкта;
		НовыйАкт.УстановитьНовыйНомер();
		// --- 
		Объект.НомерАкта = НовыйАкт.Номер;
		НовыйАкт = Неопределено;
		
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда 
		
		ОбработкаНумерации = _ПО.ПолучитьОбработку(ВнешнийНумератор);
		ОбработкаНумерации.УстановитьНомерАкта(Объект);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьНомерСчетаФактуры()
	
	ПорядокПрисвоенияНомеров = _ДС().УП.ПорядокПрисвоенияНомеров;
	ВнешнийНумератор = _ДС().УП.ВнешнийНумератор;
	
	Если (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) ИЛИ
		 (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация) 
	Тогда
		
		Объект.НомерСчетаФактуры = Объект.Номер;
		
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда 
		
		НовыйСФ = Документы.СчетФактураВыданный.СоздатьДокумент();
		НовыйСФ.ВидСчетаФактуры=Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;
		НовыйСФ.Организация = Объект.Организация;
		НовыйСФ.Дата = Объект.ДатаСчетаФактуры;
		НовыйСФ.УстановитьНовыйНомер();
		// --- 
		Объект.НомерСчетаФактуры = НовыйСФ.Номер;
		НовыйСФ = Неопределено;
		
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда 
		
		ОбработкаНумерации = _ПО.ПолучитьОбработку(ВнешнийНумератор);
		ОбработкаНумерации.УстановитьНомерСчетаФактуры(Объект);
		
	КонецЕсли; 
	
	Если Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") тогда
		ИсправлениеПолучитьНомерНаСервере();
	КонецЕсли;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ДатаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеОрганизации 

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	_ОрганизацияПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _ОрганизацияПриИзменении()
	// --- 
	
	_СформироватьОбщиеПараметры("УчетнаяПолитика");
	Если (_ДС().НП.ПодставлятьУполномоченныхЛицПриСозданииДокументов И Объект.Ссылка.Пустая()) Тогда
		
		_ПодставитьПодписантов();
		
	КонецЕсли; 
	
	Если СтараяОрганизация <> Объект.Организация Тогда
		Объект.Номер = "";
		
		Объект.НомерСчета 			= "";
		Объект.НомерАкта 			= "";
		Объект.НомерСчетаФактуры 	= "";
		Объект.ДатаСчета 		= Дата(1,1,1);
		Объект.ДатаАкта 		= Дата(1,1,1);
		Объект.ДатаСчетаФактуры = Дата(1,1,1);
		
		СтараяОрганизация = Объект.Организация;
		
		_ОбновитьНомераДокументов() ;
		
	КонецЕсли;
	
	_УстановитьПараметрыФункциональныхОпцийФормы();
	
	УстановитьПараметрыВыбораСтавкиНДС();
	// --- 
КонецПроцедуры

#КонецОбласти 


#Область ИзменениеПодразделения

&НаСервере
Процедура ПодразделениеОрганизацииПриИзмененииНаСервере()
	
	Если (_ДС().НП.ПодставлятьУполномоченныхЛицПриСозданииДокументов И Объект.Ссылка.Пустая()) Тогда
		
		_ПодставитьПодписантов();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОрганизацииПриИзменении(Элемент)
	ПодразделениеОрганизацииПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область ПодстановкаПодписантов

&НаКлиенте
Процедура Подписанты_Обновить(Команда)
	
	Если _ДС().НП.ПодставлятьУполномоченныхЛицПриСозданииДокументов Тогда
		_ПодставитьПодписантов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ПодставитьПодписантов()
	
	Если Объект.Организация.Пустая() Тогда
		Возврат;
	КонецЕсли; 
	
	Объект.Руководитель 			= Неопределено;
	Объект.ЗаРуководителяПоПриказу 	= "";
	
	Объект.ГлавныйБухгалтер 				= Неопределено;
	Объект.ЗаГлавногоБухгалтераПоПриказу 	= "";
	
	ДанныеПодписантовОрагнизации = _УФС.ПолучитьОтветственныхЛиц(Объект.Организация, Объект.ПодразделениеОрганизации);
	
	ДанныеРуководитель = ДанныеПодписантовОрагнизации.Получить(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	
	Если ДанныеРуководитель <> Неопределено Тогда
		
		ДанныеРуководитель.Свойство("УполномоченноеЛицо", Объект.Руководитель);
		ДанныеРуководитель.Свойство("НомерДатаПриказа"	, Объект.ЗаРуководителяПоПриказу);
		
	КонецЕсли;
	
	ДанныеГлавныйБухгалтер = ДанныеПодписантовОрагнизации.Получить(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	
	Если ДанныеГлавныйБухгалтер <> Неопределено Тогда
		
		ДанныеГлавныйБухгалтер.Свойство("УполномоченноеЛицо", Объект.ГлавныйБухгалтер);
		ДанныеГлавныйБухгалтер.Свойство("НомерДатаПриказа"	, Объект.ЗаГлавногоБухгалтераПоПриказу);
		
	КонецЕсли;
	
	ДанныеОтветственныйЗаОформление = ДанныеПодписантовОрагнизации.Получить(Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаОформление);
	
	Если ДанныеОтветственныйЗаОформление <> Неопределено
		И ДанныеГлавныйБухгалтер <> Неопределено Тогда
		
		ДанныеГлавныйБухгалтер.Свойство("УполномоченноеЛицо", Объект.ОтветственныйЗаОформление);
		ДанныеГлавныйБухгалтер.Свойство("НомерДатаПриказа"	, Объект.ОтветственныйЗаОформлениеПоПриказу);
		
	КонецЕсли;
	
КонецПроцедуры
 

#КонецОбласти 

#Область ИзменениеКонтрагента 

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	_УФК.ВыбратьКлиента(Объект.Контрагент,Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ПроверитьКонтрагентаПоБазеЛКК = КонтрагентПриИзмененииНаСервере(); 
	
	//Подсистема.CW_ЭлектронныйОбменДанными
	Если ПроверитьКонтрагентаПоБазеЛКК Тогда
		ПроверитьКонтрагентаПоБазеЛКК();
	КонецЕсли;
	//Подсистема.CW_ЭлектронныйОбменДанными
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИННКонтрагента(Контрагент)
	
	Возврат Контрагент.Инн;
	
КонецФункции


&НаСервере
Функция КонтрагентПриИзмененииНаСервере()
	
	// если очистили контрагента, то принудительно очищаем и договор
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Договор = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(Объект.Контрагент) И (Объект.Договор.Владелец = Объект.Контрагент)) Тогда 
		Объект.Договор = CW_Документы.ПолучитьПоследнийДоговор(Объект.Контрагент, Объект.Организация, Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		_ОбработатьИзменениеДоговора();
	КонецЕсли;
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииКонтрагентаНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров   
	
	//Подсистема.ЭДО
	УстановитьВидимостьКомандЭДО();
	//Подсистема.ЭДО

	Если Объект.Корректировка Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти 

#Область ИзменениеДоговора 

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	Отбор = Новый Структура("Владелец,Организация,ВидДоговора",Объект.Контрагент,Объект.Организация,ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
	ПараметрыФормы = Новый Структура("Отбор,РежимВыбора",Отбор,Истина);
	// --- 
	ОткрытьФорму("Справочник.CW_ДоговорыПоГрузоперевозкам.ФормаВыбора",ПараметрыФормы,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	_ОбработатьИзменениеДоговора();
	
КонецПроцедуры

&НаСервере
Процедура _ОбработатьИзменениеДоговора()

	УстановитьАдресСпискаУслугПоДоговору();
	
	//AFR-233578
	//ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре();
	//ОтключитьИсториюВыбораНоменклатуры(ИспользуетсяОгранчиениеУслуг);
	//AFR-233578       
	
	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		Возврат;
	КонецЕсли;
	
	_СформироватьОбщиеПараметры();

	//Подсистема.УчетПриложенийДоговоров
	Объект.Валюта = CW_УчетПриложенийДоговоровСервер.ПолучитьВалютуПриложенияДОговора(Объект.ПриложениеКДоговору, Объект.Договор);  

	ИдентификаторГосКонтракта = CW_УчетПриложенийДоговоровСервер.ПолучитьИдентификаторГосКонтрактаПриложенияДоговора(Объект.ПриложениеКДоговору, Объект.Договор);  
	Если ИдентификаторГосКонтракта <> Неопределено Тогда //Значение будет неопределено в случае, если отклчена функциональность "Используется Гособоронзаказ", т.е. только для версии КОРП
		Объект.ИдентификаторГосКонтракта = ИдентификаторГосКонтракта;                                         
	КонецЕсли;
	//Подсистема.УчетПриложенийДоговоров
	
	Объект.ЗачетАвансов.Очистить();
	Объект.ПлатёжноРасчётныеДокументы.Очистить();
	_ПараметрыДоговора = _ДС().ПД;
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);

	ВзаиморасчетыВУЕ 	= ПараметрыБухгалтерскогоУчета.ВзаиморасчетыВУЕ;
	
	Если НЕ Объект.Договор.Пустая() Тогда
		
		Если ЗначениеЗаполнено(_ПараметрыДоговора.ПорядокЗачетаАвансов) Тогда
			Объект.СпособЗачетаАвансов = _ПараметрыДоговора.ПорядокЗачетаАвансов;
		КонецЕсли;

		Если ЗначениеЗаполнено(_ПараметрыДоговора.ПорядокЗачетаАвансовОЗ) Тогда
			Объект.СпособЗачетаАвансовОЗ = _ПараметрыДоговора.ПорядокЗачетаАвансовОЗ;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(_ПараметрыДоговора.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ) Тогда
			Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = _ПараметрыДоговора.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ;
		Иначе
			Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.Автоматически;
		КонецЕсли;
		
		Если (НЕ ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
			Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
		КонецЕсли;
		
		Объект.КодСпособаВыставления 	= _ПараметрыДоговора.ОсновнойКодСпособаВыставленияСчетовФактур;
		
		Объект.ЭтоУниверсальныйДокумент = _ПараметрыДоговора.ИспользуетсяУниверсальныйДокумент;
		
		РасчитатьСрокОплатыДокумента();
		_СформироватьКурс();
		
	КонецЕсли;   
	
	
	УстановитьЗаголовокНадписиКомментарияДоговора();

	_ОбновитьНомераДокументов();
	_УправлениеЭлементамиФормы();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииДоговораНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _СформироватьКурс()
	// --- 
	
	Если НЕ Объект.Валюта.Пустая() И (Объект.Валюта <> _ДС().КО.ВалютаРегламентированногоУчета) Тогда
		
		Если (НЕ Объект.УЕ_ПользовательскийКурс) Тогда
			СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,_ДатаВозникновенияЗадолженности());
			ТекущийКурс = СК.Курс;	
		Иначе
			СК = Новый Структура("Курс,Кратность",Объект.УЕ_Курс,Объект.УЕ_Кратность);
		КонецЕсли;
		// --- 
		КурсВалюты = Строка(Объект.Валюта)+" = "+Формат(СК.Курс,"ЧЦ=15; ЧДЦ=4; ЧГ=");
		Если СК.Кратность <> 1 Тогда
			
			_сф.стр_Добавить(КурсВалюты,"/"+Формат(СК.Кратность,"ЧЦ=10; ЧГ="));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеСрокаОплаты 

&НаКлиенте
Процедура ПолучитьСрокОплаты(Команда)
	
	РасчитатьСрокОплатыДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСрокОплатыДокумента() 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Счет", 					Объект.Ссылка);
	СтруктураПараметров.Вставить("ДатаОплаты", 				_СрокОплаты);
	СтруктураПараметров.Вставить("Описание", 				_СрокОплатыОписание);
	СтруктураПараметров.Вставить("РучноеРедактирование", 	_СрокОплатыРучноеРедактирование);

	РегистрыСведений.CW_СрокиОплатыСчетов.ЗаписатьСрокОплатыДокумента(СтруктураПараметров); 

КонецПроцедуры


&НаСервере
Процедура РасчитатьСрокОплатыДокумента()
	
	Если Объект.Ссылка.Пустая() или _СрокОплатыРучноеРедактирование Тогда
		//или ЗначениеЗаполнено(_СрокОплаты) Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокРасчетаСрокаОплаты = _ДС().ПД.УсловияОплаты.ПорядокРасчета; 
	Если Объект.ФормируетсяСчет и Не Объект.ФормируетсяАкт 
		и ПорядокРасчетаСрокаОплаты = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыВозвратаАкта") Тогда
		Возврат;
	Конецесли;	
	
	СтруктураДанных = CW_Документы.ПодготовитьДанныеДляРасчетаСрокаОплаты(Объект);
	_СрокОплаты 	= CW_Документы.РассчитатьСрокОплаты(СтруктураДанных);
	
	ЗаписатьСрокОплатыДокумента();
	
	Если Не Объект.ФормируетсяСчет и Объект.ФормируетсяАкт 
		и ПорядокРасчетаСрокаОплаты = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыВозвратаАкта") Тогда
		
		мСвязанныеСчета = Документы.CW_ДоходыПоГрузоперевозке.ПолучитьСвязанныеСчета(Объект.Ссылка);
		Для каждого СвязанныйСчет из мСвязанныеСчета Цикл    
			
			ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(СвязанныйСчет);
			Если НЕ ДанныеСрокаОплаты.РучноеРедактирование Тогда
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Счет",		СвязанныйСчет);
				СтруктураПараметров.Вставить("ДатаОплаты",	_СрокОплаты);
				
				РегистрыСведений.CW_СрокиОплатыСчетов.ЗаписатьСрокОплатыДокумента(СтруктураПараметров); 
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
 
&НаСервере
Функция _ДатаВозникновенияЗадолженности()
	
	// это всегда дата документа
	Возврат(Объект.Дата);
	
КонецФункции

&НаСервере
Функция _ДатаКурса()
	// --- 
	
	Если (Объект.ФормируетсяАкт) Тогда
		
		Возврат(Объект.ДатаАкта);
		
	ИначеЕсли (Объект.ФормируетсяСчет) Тогда 
		
		Возврат(Объект.ДатаСчета);
		
	Иначе
		
		Возврат(Объект.Дата);
		
	КонецЕсли; 
	
	// --- 
КонецФункции


#КонецОбласти 

//Подсистема.ОригиналыДокументов
&НаКлиенте
Процедура ОригиналыПредоставленыПриИзменении(Элемент)
	
	ОригиналыПредоставленыПриИзмененииНаСервере();
	
КонецПроцедуры

&Насервере
Процедура ОригиналыПредоставленыПриИзмененииНаСервере()
	
	CW_ОригиналыДокументовСервер.ОригиналыПредоставленыПриИзмененииНаСервере(ЭтаФорма) ;
	
	Если НЕ Объект.Договор.Пустая() Тогда
		РасчитатьСрокОплатыДокумента();
		УстановитьОписаниеСрокаОплаты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвратаНажатие(Элемент, СтандартнаяОбработка)
	
	CW_ОригиналыДокументовКлиент.ОткрытьФормуВводаДаты(ЭтаФорма,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(НоваяДата, Параметры) Экспорт
	
	Если НЕ НоваяДата = Неопределено Тогда
		ОбработатьИзменениедатыВозвратаОригиналовДокументов(НоваяДата);
		
		Если НЕ Объект.Договор.Пустая() Тогда
			РасчитатьСрокОплатыДокумента();
			УстановитьОписаниеСрокаОплаты();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениедатыВозвратаОригиналовДокументов(НоваяДата)
	
	CW_ОригиналыДокументовСервер.ОбработатьИзменениедатыВозвратаОригиналовДокументов(ЭтаФорма, НоваяДата);

КонецПроцедуры
//Подсистема.ОригиналыДокументов


#Область ИзменениеКомментария 

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// УСЛУГИ
// ---------------------------------------------------------------------------- 

#Область УслугиОбщиеСобытия 

&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;

	Если НоваяСтрока и НЕ Копирование Тогда
		ТекущиеДанные.Количество = 1;
		
		ПорядокОтражения = _ДС().ПД.ОсновнойПорядокОтраженияДоходов;
		Если ПорядокОтражения.Пустая() Тогда
			ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга");
		КонецЕсли; 
		ТекущиеДанные.ПорядокОтражения = ПорядокОтражения;   
	Иначе
		Если ТекущиеДанные.Количество = 0 Тогда
			ТекущиеДанные.Количество = 1;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ПорядокОтражения) Тогда 
			ПорядокОтражения = _ДС().ПД.ОсновнойПорядокОтраженияДоходов;
			Если ПорядокОтражения.Пустая() Тогда
				ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"); 
			Иначе
				ТекущиеДанные.ПорядокОтражения = ПорядокОтражения;   
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;   
	
	//AFR-233578
	ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре(ТекущиеДанные.ПорядокОтражения);
	ОтключитьИсториюВыбораНоменклатуры(ИспользуетсяОгранчиениеУслуг);
	//AFR-233578
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.УслугиКорректировка.ТекущиеДанные;
		ТекущиеДанные.ЭтоДобавленнаяСтрока = Истина;
		ТекущиеДанные.Количество = 1;
		
		Если Копирование Тогда
			ТекущиеДанные.Представление_ДоКорректировки = "";
			ТекущиеДанные.Количество_ДоКорректировки	= 0;
			ТекущиеДанные.Цена_ДоКорректировки			= 0;
			ТекущиеДанные.Сумма_ДоКорректировки			= 0;
			ТекущиеДанные.НДС_ДоКорректировки  			= 0;
			ТекущиеДанные.Всего_ДоКорректировки			= 0;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные 	= Элементы.УслугиКорректировка.ТекущиеДанные;
	Отказ 			= ТекущиеДанные.ЭтоДобавленнаяСтрока = Ложь;
	
	Если Отказ Тогда
		ПоказатьПредупреждение(,"Удаляемая строка есть в корректируемом документе. Удаление запрещено!",30, "Ошибка удаления строки");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.УслугиЗаказ Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		Попытка
			ПоказатьЗначение(,_Заказ(Элементы.Услуги.ТекущиеДанные.Грузоперевозка));
		Исключение
			//ОписаниеОшибки()
		КонецПопытки; 
		
	ИначеЕсли (Поле = Элементы.УслугиНоменклатурнаяГруппа) Тогда 
		
		 Попытка
			ПоказатьЗначение(,_НоменклатурнаяГруппа(Элементы.Услуги.ТекущиеДанные.Номенклатура));
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;
		
	ИначеЕсли (Поле = Элементы.УслугиДокументРасходовПредставлениеДокумента) Тогда 
		
		 Попытка
			ПоказатьЗначение(,Элементы.Услуги.ТекущиеДанные.ДокументРасходов);
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;
		
	Иначе
		
		Если ЭтаФорма.ТолькоПросмотр Тогда
			
			СтандартнаяОбработка = Ложь;
			// --- 
			Если Поле = Элементы.УслугиГрузоперевозка Тогда
				
				Попытка
					ПоказатьЗначение(,Элементы.Услуги.ТекущиеДанные.Грузоперевозка);
				Исключение
					//ОписаниеОшибки()
				КонецПопытки; 
				
			ИначеЕсли Поле = Элементы.УслугиДокументРасходов Тогда 
				
				Попытка
					ПоказатьЗначение(,Элементы.Услуги.ТекущиеДанные.ДокументРасходов);
				Исключение
					//ОписаниеОшибки()
				КонецПопытки; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция _Заказ(Грузоперевозка)
	// --- 
	
	Возврат(Грузоперевозка.Заказ);
	
	// --- 
КонецФункции

&НаСервереБезКонтекста
Функция _НоменклатурнаяГруппа(Номенклатура)
	// --- 
	
	Возврат(Номенклатура.НоменклатурнаяГруппа);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ОбновитьСтатусПометокУдаления()
	
	ЗаполнитьДобавленныеКолонкиТаблиц("Услуги");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц(ИмяТабличнойЧасти)
	
	ИспользютсяФинансовыеСтатусы 		= ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок");
	
	МассивГрузоперевозок 			= Объект[ИмяТабличнойЧасти].Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	СвойстваГрузоперевозок 			= CW_Грузоперевозки_Сервер.ПолучитьСведенияПоГрузоперевозкам(МассивГрузоперевозок);
	
	Для каждого СтрокаДокумента Из Объект[ИмяТабличнойЧасти] Цикл
		
		СтруктураСвойств = СвойстваГрузоперевозок.Получить(СтрокаДокумента.Грузоперевозка);
		
		Если СтруктураСвойств <> Неопределено Тогда
			СтруктураСвойств.Свойство("ПометкаУдаления",			СтрокаДокумента.ГрузоперевозкаУдалена);
			
			Если ИспользютсяФинансовыеСтатусы Тогда
				СтруктураСвойств.Свойство("КартинкаФинансовыйСтатус",	СтрокаДокумента.КартинкаФинансовыйСтатус);
			КонецЕсли;
			
		Конецесли;
		
	КонецЦикла;
	
КонецПроцедуры



#КонецОбласти 

#Область УслугиРеквизиты 

&НаКлиенте
Процедура УслугиСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// ---------------------------------------------------------------------------- 
	
	Вариант = Неопределено;
	
	Список = Новый СписокЗначений;
	Список.Добавить("список","Выбор из списка");
	
	// если ведется оперативный учет задолженности
	
	Если (ОперативныйУчет И НЕ ВводОстатковОЗ) Тогда
		
		Список.Добавить("подбор","Подбор неактированных");
		
	КонецЕсли; 
	
	
	ПОВ = Новый ОписаниеОповещения("ОбработатьВыборВариантаПодбораСчета",ЭтотОбъект, Новый Структура("Элемент",Элемент)); 
	Если (Список.Количество()=1) Тогда
		
		ВыполнитьОбработкуОповещения(ПОВ,Список[0]);
		
	Иначе
		
		ПоказатьВыборИзМеню(ПОВ,Список,Элемент);
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборВариантаПодбораСчета(Ответ, ДополнительныеПараметры) Экспорт 

	Если Ответ  = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ.Значение = "подбор" Тогда
		
		ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;    
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация", Объект.Организация);
		
		СтруктураОтбора.Вставить("Контрагент", 			Объект.Контрагент);
		СтруктураОтбора.Вставить("Договор", 			Объект.Договор);  
		СтруктураОтбора.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
		
		СтруктураОтбора.Вставить("Валюта", 				Объект.Валюта);
		
		СтруктураОтбора.Вставить("Грузоперевозка", 		ТекущиеДанные.Грузоперевозка);
		СтруктураОтбора.Вставить("ПорядокОтражения", 	ТекущиеДанные.ПорядокОтражения);
		СтруктураОтбора.Вставить("Номенклатура", 		ТекущиеДанные.Номенклатура);
		СтруктураОтбора.Вставить("СтавкаНДС", 			ТекущиеДанные.СтавкаНДС);      
		
		ПараметрыФормыПодбора = Новый Структура;
		ПараметрыФормыПодбора.Вставить("Дата",			Объект.Дата);
		ПараметрыФормыПодбора.Вставить("Документ",		Объект.Ссылка);
		ПараметрыФормыПодбора.Вставить("Отбор",			СтруктураОтбора);
		ПараметрыФормыПодбора.Вставить("РежимВыбора",	Истина);
		
		ОткрытьФорму("ОбщаяФорма.CW_ПодборНеактированныхСчетов", ПараметрыФормыПодбора, ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;   
	
	Если Ответ.Значение = "список" Тогда   
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Контрагент", 			Объект.Контрагент);
		СтруктураОтбора.Вставить("Договор", 			Объект.Договор);
		
		Если ЗначениеЗаполнено(Объект.ПриложениеКДоговору) Тогда
			СтруктураОтбора.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
		КонецЕсли;
		
		СтруктураОтбора.Вставить("ФормируетсяСчет", 		Истина);
		СтруктураОтбора.Вставить("ФормируетсяАкт", 			Ложь);
		СтруктураОтбора.Вставить("ФормируетсяСчетФактура", 	Ложь);
		
		ПараметрыФормаВыбора = Новый Структура;
		ПараметрыФормаВыбора.Вставить("Отбор",			СтруктураОтбора);
		ПараметрыФормаВыбора.Вставить("РежимВыбора",	Истина);
		
		// во всех остальных случаях
		ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.ФормаВыбора",ПараметрыФормаВыбора, ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;   
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура УслугиПорядокОтраженияОчистка(Элемент, СтандартнаяОбработка)
	ПриИзмененииУслугиПорядокОтражения(Элементы.Услуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УслугиПорядокОтраженияПриИзменении(Элемент)
	_ПорядокОтражения = Элементы.Услуги.ТекущиеДанные.ПорядокОтражения;
	Для Каждого ид Из Элементы.Услуги.ВыделенныеСтроки Цикл
		строкаУслуги = Объект.Услуги.НайтиПоИдентификатору(ид);
		строкаУслуги.ПорядокОтражения = _ПорядокОтражения;
		ПриИзмененииУслугиПорядокОтражения(строкаУслуги);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииУслугиПорядокОтражения(строкаУслуги)
	
	// принудительная установка порядка отражения
	Если строкаУслуги.ПорядокОтражения.Пустая() Тогда
		строкаУслуги.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга");
	КонецЕсли; 
	
	// очищаем документ расходов и базу если собственная
	Если (строкаУслуги.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга")) 
		ИЛИ (строкаУслуги.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам"))  
		ИЛИ (строкаУслуги.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"))
	Тогда
		строкаУслуги.ДокументРасходов = Неопределено;
		строкаУслуги.База = 0;
	КонецЕсли;
	
	//AFR-233578
	//ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре(строкаУслуги.ПорядокОтражения);
	//ОтключитьИсториюВыбораНоменклатуры(ИспользуетсяОгранчиениеУслуг);
	//AFR-233578
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура УслугиГрузоперевозкаПриИзменении(Элемент)
	
	_УслугиГрузоперевозкаПриИзменении(Элементы.Услуги.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _УслугиГрузоперевозкаПриИзменении(Строка)
	// --- 
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	
	Если НЕ НеЗаменятьПредставлениеНоменклатуры Тогда
		ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
		
		ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
		ПараметрыШаблона.Объект 		= Объект;
		ПараметрыШаблона.Дата 			= Объект.Дата;
		ПараметрыШаблона.Договор 		= Объект.Договор;
		ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
		ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
		
		CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
	КонецЕсли;

	_ОбновитьСтатусПометокУдаления();
	
	#Область Динамический_вывод_дополнительных_колонок
	
	_УФС.ОбновитьЗначенияПараметровГрузоперевозкиПоСтроке(СтрокаТЧ, ПолучитьСтруктуруПараметровДляПередачи());	
	
	#КонецОбласти
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура УслугиНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре(Элементы.Услуги.ТекущиеДанные.ПорядокОтражения);
	
	Если Не ИспользуетсяОгранчиениеУслуг Тогда
		
		ВыбранноеЗначение = Элементы.Услуги.ТекущиеДанные.Номенклатура;	
		_УФК.ВыбратьНоменклатуру(ВыбранноеЗначение,Элемент,ДанныеВыбора,СтандартнаяОбработка);
		
	Иначе

		СписокЗначений = Новый СписокЗначений;
		Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
			МассивУслуг =  _УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору);
			СписокЗначений.ЗагрузитьЗначения(МассивУслуг);
		КонецЕсли; 
		
		Если СписокЗначений.Количество() = 0 Тогда
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст   		= "Не определен список услуг по договору!";
			Сообщение.ПутьКДанным  	= "Объект";
			Сообщение.Поле    		= "Договор";
			Сообщение.Сообщить();
			
		Конецесли;
		
		ДанныеВыбора = СписокЗначений;
		СтандартнаяОбработка = Ложь;
		
	Конецесли;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьОграничениеУслугПоНоменклатуре(ПорядокОтражения=Неопределено)

	ИспользуетсяОгранчиениеУслуг = Ложь; 
	
	Если ОграничиватьУслугиПоДоговорам Тогда   
		
		ИспользуетсяОгранчиениеУслуг = ?(ЗначениеЗаполнено(Объект.Договор), Объект.Договор.ОграничиватьНоменклатуру, Ложь);
		Если НеОграничиватьУслугиПоПеревыставлению и  ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление") Тогда
			ИспользуетсяОгранчиениеУслуг = Ложь;	
		КонецЕсли;    
		
	КонецЕсли;
	
	Возврат ИспользуетсяОгранчиениеУслуг;
	
	
КонецФункции

&НаКлиенте
Процедура УслугиКорректировкаНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре(Элементы.Услуги.ТекущиеДанные.ПорядокОтражения);	
	Если Не ИспользуетсяОгранчиениеУслуг Тогда

		ВыбранноеЗначение = Элементы.Услуги.ТекущиеДанные.Номенклатура;	
		_УФК.ВыбратьНоменклатуру(ВыбранноеЗначение,Элемент,ДанныеВыбора,СтандартнаяОбработка);
		
	Иначе

		СписокЗначений = Новый СписокЗначений;
		Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
			МассивУслуг =  _УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору);
			СписокЗначений.ЗагрузитьЗначения(МассивУслуг);
		КонецЕсли; 
		
		Если СписокЗначений.Количество() = 0 Тогда
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст   		= "Не определен список услуг по договору!";
			Сообщение.ПутьКДанным  	= "Объект";
			Сообщение.Поле    		= "Договор";
			Сообщение.Сообщить();
			
		Конецесли;
		
		ДанныеВыбора = СписокЗначений;
		СтандартнаяОбработка = Ложь;
		
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	_УслугиНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура _УслугиНоменклатураПриИзмененииНаСервере()
	_Номенклатура = Объект.Услуги.НайтиПоИдентификатору(Элементы.Услуги.ТекущаяСтрока).Номенклатура;
	Для Каждого ид Из Элементы.Услуги.ВыделенныеСтроки Цикл
		строкаУслуги = Объект.Услуги.НайтиПоИдентификатору(ид);
		строкаУслуги.Номенклатура = _Номенклатура;
		_УслугиНоменклатураПриИзменении(ид);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаНоменклатураПриИзменении(Элемент)
	УслугиКорректировкаНоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УслугиКорректировкаНоменклатураПриИзмененииНаСервере()
	_Номенклатура = Объект.Услуги.НайтиПоИдентификатору(Элементы.УслугиКорректировка.ТекущаяСтрока).Номенклатура;
	Для Каждого ид Из Элементы.УслугиКорректировка.ВыделенныеСтроки Цикл
		строкаУслуги = Объект.Услуги.НайтиПоИдентификатору(ид);
		строкаУслуги.Номенклатура = _Номенклатура;
		_УслугиНоменклатураПриИзменении(ид);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура _УслугиНоменклатураПриИзменении(Строка)
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда 
		
		Если _ДС().НП.ПодставлятьСтавкуНДС или Не ЗначениеЗаполнено(СтрокаТЧ.СтавкаНДС) Тогда   
			
			ПараметрыСтавкиНДС = Новый Структура;
			ПараметрыСтавкиНДС.Вставить("Дата", 		Объект.Дата);
			ПараметрыСтавкиНДС.Вставить("Организация", 	Объект.Организация);
			ПараметрыСтавкиНДС.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
			ПараметрыСтавкиНДС.Вставить("Договор", 		Объект.Договор); 
			ПараметрыСтавкиНДС.Вставить("ПодставлятьСтавкуНДС",_ДС().НП.ПодставлятьСтавкуНДС); 
			ПараметрыСтавкиНДС.Вставить("ТипДвижения", "ДОХОДЫ");
			
			СтрокаТЧ.СтавкаНДС = CW_Документы.ПолучитьСтавкуНДС(ПараметрыСтавкиНДС);
		КонецЕсли;
		
		// пробуем найти в регистре
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат
		|ИЗ
		|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры
		|ГДЕ
		|	CW_СтатьиЗатратНоменклатуры.Номенклатура = &Номенклатура";
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТЧ.Номенклатура);
		ТЗ = Запрос.Выполнить().Выгрузить();
		СтрокаСтатьяЗатрат = _сф.к_ПервыйЭлемент(ТЗ);
		Если (СтрокаСтатьяЗатрат <> Неопределено) Тогда
			СтрокаТЧ.СтатьяЗатрат = СтрокаСтатьяЗатрат.СтатьяЗатрат;
		Иначе
			СтрокаТЧ.СтатьяЗатрат = _ДС().УП.ОсновнаяСтатьяЗатрат;
		КонецЕсли; 
		
		Грузоперевозка = СтрокаТЧ.Грузоперевозка;
		//Получаем количество из Параметра
		Если РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки тогда
			
			ЗначениеПараметра 	=  0;
			СтруктураПараметров = новый Структура("ТипПеревозки,Номенклатура,ЕдиницаИзмерения", Грузоперевозка.ТипПеревозки,СтрокаТЧ.Номенклатура,СтрокаТЧ.Номенклатура.ЕдиницаИзмерения);
			НайденныйПараметр 	= CW_Документы.ПолучитьПараметрДляПодстановкиЗначенияВКоличество(СтруктураПараметров);
			
			Если НайденныйПараметр <> Неопределено Тогда
				//Получаем только первое значение
				СтрокаПараметраГП = Грузоперевозка.ПараметрыГрузоперевозки.Найти(НайденныйПараметр, "Параметр");
				
				Если СтрокаПараметраГП <> Неопределено Тогда
					ЗначениеПараметра =  СтрокаПараметраГП.Значение;
				КонецЕсли;
				
			КонецЕсли;	
			
			Если Не УстановитьЗначениеНольЗначениеПараметраНеУстановлено и Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
				ЗначениеПараметра = 1;
			КонецЕсли;
			
			СтрокаТЧ.Количество =  ЗначениеПараметра;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// пробуем переформировать представление номенклатуры
	Если НЕ НеЗаменятьПредставлениеНоменклатуры Тогда
		ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
		
		ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
		ПараметрыШаблона.Объект 		= Объект;
		ПараметрыШаблона.Дата 			= Объект.Дата;
		ПараметрыШаблона.Договор 		= Объект.Договор;
		ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
		ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
		
		CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
	КонецЕсли;

	Если Не РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки тогда
		Если (СтрокаТЧ.Количество = 0) Тогда
			СтрокаТЧ.Количество = 1;
		КонецЕсли; 
	КонецЕсли;
	
	// установка цены номенклатуры 
	ИспользуетсяОграничениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре(СтрокаТЧ.ПорядокОтражения);
	Если ИспользуетсяОграничениеУслуг  Тогда
		
		Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("АдресУслугПоДоговору"						, АдресУслугПоДоговору);
			СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтГруза"		, УстанавливатьЦенуВЗависимостиОтГруза);
			СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтКлиента"	, Ложь);
			
			СтруктураПараметров.Вставить("Номенклатура"							, СтрокаТЧ.Номенклатура);
			Если УстанавливатьЦенуВЗависимостиОтГруза Тогда
				СтруктураПараметров.Вставить("Груз" , СтрокаТЧ.Грузоперевозка.Груз);
			КонецЕсли;
					
			УслугаДоговора = _УФС.ПолучитьУслугуДоговораПоПараметрам(СтруктураПараметров);			
			
			Если УслугаДоговора <> Неопределено Тогда 	
				
				Если ЗначениеЗаполнено(УслугаДоговора.ПорядокОтражения) Тогда
					СтрокаТЧ.ПорядокОтражения = УслугаДоговора.ПорядокОтражения;
					
					// очищаем документ расходов и базу если собственная
					Если (СтрокаТЧ.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга")) 
						ИЛИ (СтрокаТЧ.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам"))
						Тогда
						СтрокаТЧ.ДокументРасходов = Неопределено;
						СтрокаТЧ.База = 0;
					КонецЕсли; 
					
				КонецЕсли;
				
				СтрокаТЧ.Цена			= УслугаДоговора.ЦенаБезНДС;
				
				Если СтрокаТЧ.СтавкаНДС <> УслугаДоговора.СтавкаНДС и ЗначениеЗаполнено(УслугаДоговора.СтавкаНДС) Тогда
					СтрокаТЧ.СтавкаНДС	= УслугаДоговора.СтавкаНДС;
				КонецЕсли;
				
				Если УслугаДоговора.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДССверху тогда
					СтрокаТЧ.Сумма 		= УслугаДоговора.ЦенаБезНДС * СтрокаТЧ.Количество;
					ОбратныйПересчет = Ложь;
				Иначе //в сумме
					СтрокаТЧ.Всего = УслугаДоговора.Цена * СтрокаТЧ.Количество;
					ОбратныйПересчет = Истина;
				КонецЕсли;
				
				Ставка = CW_Финансы.ПолучитьСтавкуНДС(УслугаДоговора.СтавкаНДС);
				
				Если ОбратныйПересчет Тогда
					
					СтрокаТЧ.НДС 	= СтрокаТЧ.Всего*(Ставка/(100+Ставка));
					СтрокаТЧ.Сумма 	= СтрокаТЧ.Всего - СтрокаТЧ.НДС;
					СтрокаТЧ.Цена 	= _сф.БезопасноРазделить(СтрокаТЧ.Сумма,СтрокаТЧ.Количество);
					
				Иначе
					
					СтрокаТЧ.НДС 	= СтрокаТЧ.Сумма*(Ставка/100);
					СтрокаТЧ.Всего 	= СтрокаТЧ.Сумма+СтрокаТЧ.НДС;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
	Иначе
		ТД = СтрокаТЧ;
		Если ТД.Цена = 0  Тогда
			
			ТипЦен = _ДС().ПД.ТипЦен;
			Если НЕ ТипЦен.Пустая() Тогда
				
				СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,_ДатаВозникновенияЗадолженности());
				Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура, ТипЦен, _ДатаВозникновенияЗадолженности(), Объект.Валюта, СК.Курс,СК.Кратность);
				Если Цена <> 0 Тогда
					
					Если ТипЦен.ЦенаВключаетНДС Тогда
						
						Если ЗначениеЗаполнено(ТД.СтавкаНДС) И ЗначениеЗаполнено(ТД.Количество) Тогда
							
							ТД.Цена 	= Цена;
							ТД.Всего 	= Цена*ТД.Количество;
							Ставка 		= CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
							ТД.НДС 		= ТД.Всего*Ставка/(1+Ставка);
							ТД.Сумма 	= ТД.Всего - ТД.НДС;
							
						Иначе
							
							Если ЗначениеЗаполнено(ТД.СтавкаНДС) Тогда
								
								СтавкаНДСПроцент = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
								ТД.Цена = Цена/(1+СтавкаНДСПроцент);
								
							КонецЕсли; 
							
						КонецЕсли; 
						
					Иначе
						
						Если ЗначениеЗаполнено(ТД.СтавкаНДС) И ЗначениеЗаполнено(ТД.Количество) Тогда
							
							ТД.Цена = Цена;
							ТД.Сумма = ТД.Цена * ТД.Количество;
							ТД.НДС = ТД.Сумма * CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
							ТД.Всего = ТД.Сумма + ТД.НДС;
							
						Иначе
							
							ТД.Цена = Цена;
							
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ПересчитатьСтрокуНаСерере(СтрокаТЧ.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура УслугиПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	_УслугиПредставлениеНачалоВыбора(Элементы.Услуги.ТекущаяСтрока);
	Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиПорядокОтражения;
	
КонецПроцедуры

&НаСервере
Процедура _УслугиПредставлениеНачалоВыбора(Строка)
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
	
	ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
	ПараметрыШаблона.Объект 		= Объект;
	ПараметрыШаблона.Дата 			= Объект.Дата;
	ПараметрыШаблона.Договор 		= Объект.Договор;
	ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
	ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
	
	CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
	
КонецПроцедуры

&НаСервере
Процедура _ПереформироватьПредставлениеУслуг(Знач Строки)
	
	Если CW_ДополнительныеРеквизитыСлужебный.ИспользуютсяДополниительныеРеквизиты() Тогда 
		// надо перенести значения в таб.часть ДополнительныеРеквизиты
		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствамиСлужебный.ПеренестиЗначенияИзРеквизитовФормыВОбъект(ЭтотОбъект, Неопределено, Ложь);
		// Конец СтандартныеПодсистемы.Свойства
	КонецЕсли;	

	Для каждого Идентификатор Из Строки Цикл
		_УслугиПредставлениеНачалоВыбора(Идентификатор);
	КонецЦикла; 
	
КонецПроцедуры
 

&НаКлиенте
Процедура Услуги_ПереформироватьПредставление(Команда)
	
	_ПереформироватьПредставлениеУслуг(Элементы.Услуги.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировка_ПереформироватьПредставление(Команда)
	
	_ПереформироватьПредставлениеУслуг(Элементы.УслугиКорректировка.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти 

#Область УслугиСуммы 

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.Услуги.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.Услуги.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.Услуги.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаВсегоПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
	ТД.НДС = ТД.Всего*Ставка/(1+Ставка);
	ТД.Сумма = ТД.Всего - ТД.НДС;
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);

КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаНДСПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	
	Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
		ТД.Всего = ТД.Сумма + ТД.НДС;
	Иначе
		ТД.Сумма = ТД.Всего - ТД.НДС;
		ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	
	_УслугиСуммаПриИзменении(Элементы.Услуги.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _УслугиСуммаПриИзменении(Строка)
	// --- 
	
	ТД = Объект.Услуги.НайтиПоИдентификатору(Строка);
	
	Ставка 		= CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС);
	
	ТД.НДС 		= CW_Финансы.РассчитатьСуммуНДС(ТД.Сумма, Истина, Ложь, Ставка);
	ТД.Всего 	= ТД.Сумма + ТД.НДС;
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС,Истина);
	
	// --- 
КонецПроцедуры

// --- 

&НаСервере
Процедура ОбновитьИтогиПоУслугам()
	
	// итоговая строка по табличной части "Услуги" 
	СВ = Строка(Объект.Валюта);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	
	Если (НЕ Объект.Корректировка) Тогда
		
		Элементы.СтраницаУслуги.Заголовок = " Услуги (" +Объект.Услуги.Количество() + ")";
		Если Объект.Услуги.Количество() = 0 Тогда
			ИтогоПоУслугам = "Сведения об услугах отсутствуют";
		Иначе
			ИтогоПоУслугам=	"Строк: "+Объект.Услуги.Количество()+
			";  Сумма: "+Формат(Объект.Услуги.Итог("Сумма"),ФЧ)+" "+СВ+ 
			";  НДС: "+Формат(Объект.Услуги.Итог("НДС"),ФЧ)+" "+СВ+
			";  Всего: "+Формат(Объект.Услуги.Итог("Всего"),ФЧ)+" " +СВ;
		КонецЕсли;
		
	Иначе
		
		Если Объект.Услуги.Количество() = 0 Тогда
			ИтогоПоУслугам_Корректировка = "Сведения об услугах отсутствуют";
		Иначе
			ИтогоПоУслугам_Корректировка =	"Строк: "+Объект.Услуги.Количество()+
			";  Сумма: "+Формат(Объект.Услуги.Итог("Сумма")-Объект.Услуги.Итог("Сумма_ДоКорректировки"),ФЧ)+" "+СВ+ 
			";  НДС: "+Формат(Объект.Услуги.Итог("НДС")-Объект.Услуги.Итог("НДС_ДоКорректировки"),ФЧ)+" "+СВ+
			";  Всего: "+Формат(Объект.Услуги.Итог("Всего")-Объект.Услуги.Итог("Всего_ДоКорректировки"),ФЧ)+" " +СВ;
		КонецЕсли;
		
	КонецЕсли; 
	
	
						
КонецПроцедуры

// --- 

&НаКлиенте
Процедура Услуги_ГрупповоеРедактирование(Команда)
	
	Если Объект.Корректировка Тогда
		ТаблицаФормы = Элементы.УслугиКорректировка;
	Иначе
		ТаблицаФормы = Элементы.Услуги;
	КонецЕсли;

	// если нет выделенных строк
	Если ТаблицаФормы.ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Для групповой обработки необходимо выделить строки!",10,"Предупреждение");
		Возврат;
	КонецЕсли; 
	
	// Получаем имя реквизта по его пути к данным
	ИмяРеквизитаТабличнойЧасти = ПолучитьИмяРеквизитаТабличнойЧасти(ТаблицаФормы.ТекущийЭлемент.Имя);
	Если ИмяРеквизитаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;      
	
	ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугНоменклатурыПоТабличнойЧасти();	

	// параметры для открываемой формы
	ПФ = Новый Структура();
	ПФ.Вставить("Организация", 		Объект.Организация);
	ПФ.Вставить("ДатаДокумента", 	?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	ПФ.Вставить("Строк", 			ТаблицаФормы.ВыделенныеСтроки.Количество());
	ПФ.Вставить("Док", 				"Доходы");
	
	ПФ.Вставить("ТекущийРеквизит"				, ИмяРеквизитаТабличнойЧасти);
	ПФ.Вставить("ТекущееЗначение"				, ТаблицаФормы.ТекущиеДанные[ИмяРеквизитаТабличнойЧасти]);
	ПФ.Вставить("ТекущееЗначениеДополнительное"	, Неопределено);
	ПФ.Вставить("ЦенаСНДС"						, Объект.ЦенаСНДС);
	
	ПФ.Вставить("ИспользуетсяОгранчиениеУслуг"	, ИспользуетсяОгранчиениеУслуг);
	ПФ.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	
	ПОВ = Новый ОписаниеОповещения("ОбработатьГрупповоеРедактирование", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаГрупповогоРедактированияТЧ", ПФ, Этаформа,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьОграничениеУслугНоменклатурыПоТабличнойЧасти()
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("ПорядокОтражения",ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга")) ;
	мСтроки = Объект.Услуги.НайтиСтроки(ОтборСтрок);
	
	ИспользуетсяОгранчиениеУслуг = ОграничиватьУслугиПоДоговорам;
	Если НеОграничиватьУслугиПоПеревыставлению и мСтроки.Количество() = 0 Тогда
		ИспользуетсяОгранчиениеУслуг = Ложь;	
	КонецЕсли;
	
	Возврат ИспользуетсяОгранчиениеУслуг;
	
КонецФункции


&НаКлиенте
Процедура ОбработатьГрупповоеРедактирование(Ответ, ДопПар) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Ответ.Реквизит) Тогда
		Возврат;		
	Иначе	
		Реквизит = Ответ.Реквизит;
	КонецЕсли;
	
	Если Объект.Корректировка Тогда
		ТаблицаФормы = Элементы.УслугиКорректировка;
	Иначе
		ТаблицаФормы = Элементы.Услуги;
	КонецЕсли;
	
	ЦенаСНДС = Объект.ЦенаСНДС;
	
	мВС = ТаблицаФормы.ВыделенныеСтроки;
	КолСтр = мВС.Количество();
	Распределять = Ложь;
	Разница = 0;
	Если Ответ.Свойство("Распределить") Тогда
		Если Ответ.Распределить Тогда
			Распределять = Истина;
			Сумма = Окр(Ответ.Значение / КолСтр, 2);
			Разница = Ответ.Значение - Сумма * КолСтр;
		Иначе
			Сумма = Ответ.Значение;
		КонецЕсли;
	КонецЕсли;	
	
	мПорядокОтражения = Новый Массив;
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));
	
	Для Каждого ВСтр из мВС Цикл 
		Стр = Объект.Услуги.НайтиПоИдентификатору(ВСтр);
		
		Если Реквизит = "Номенклатура" Тогда
			Стр.Номенклатура = Ответ.Значение;
			_УслугиНоменклатураПриИзменении(ВСтр);
			
		ИначеЕсли Реквизит = "СтатьяЗатрат" Тогда
			
			Стр.СтатьяЗатрат = Ответ.Значение;
			
		ИначеЕсли Реквизит = "Грузоперевозка" Тогда
			
			Стр.Грузоперевозка = Ответ.Значение;
			_УслугиГрузоперевозкаПриИзменении(Стр.ПолучитьИдентификатор());
			
		ИначеЕсли Реквизит = "Порядок отражения" Тогда
			Стр.ПорядокОтражения = Ответ.Значение;
			ПриИзмененииУслугиПорядокОтражения(Стр)
		ИначеЕсли Реквизит = "Документ затрат" Тогда
			Если Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление") Тогда
				Стр.ДокументРасходов = Ответ.Значение;
			Иначе
				Стр.ДокументРасходов = Неопределено;
			КонецЕсли; 
		ИначеЕсли Реквизит = "Количество" Тогда
			Стр.Количество = Ответ.Значение;
			ПересчитатьСтрокуНаСерере(ВСтр,ЦенаСНДС);
		ИначеЕсли Реквизит = "Цена" Тогда
			Стр.Цена = Сумма;
			ПересчитатьСтрокуНаСерере(ВСтр,ЦенаСНДС);
		ИначеЕсли Реквизит = "Сумма" Тогда
			Стр.Сумма = Сумма;
			Стр.Цена = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
			Стр.НДС = CW_Финансы.РассчитатьСуммуНДС(Стр.Сумма, Истина, Ложь, Ставка);
			Стр.Всего = Стр.Сумма + Стр.НДС;
			ПересчитатьСтрокуНаСерере(ВСтр,ЦенаСНДС,Истина);
		ИначеЕсли Реквизит = "Ставка НДС" Тогда
			Стр.СтавкаНДС = Ответ.Значение;
			ПересчитатьСтрокуНаСерере(ВСтр,ЦенаСНДС);
		ИначеЕсли Реквизит = "Сумма НДС" Тогда
			Стр.НДС = Сумма;
			Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
				Стр.Всего = Стр.Сумма + Стр.НДС;
			Иначе
				Стр.Сумма = Стр.Всего - Стр.НДС;
				Стр.Цена  = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			КонецЕсли;
			ПересчитатьСтрокуНаСерере(ВСтр,ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Всего" Тогда
			Стр.Всего 	= Сумма;
			Ставка 		= CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100;
			Стр.НДС   	= Стр.Всего * Ставка / (1 + Ставка);
			Стр.Сумма 	= Стр.Всего - Стр.НДС;
			Стр.Цена  	= _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			ПересчитатьСтрокуНаСерере(ВСтр,ЦенаСНДС, Истина);
			
		ИначеЕсли Реквизит = "Представление" Тогда
			
			ДополнитьПредставление 	= Ложь;
			Если Ответ.Свойство("Дополнять") Тогда
				ДополнитьПредставление = Ответ.Дополнять;
			КонецЕсли;
			
			Если ДополнитьПредставление Тогда
				Стр.Представление = Стр.Представление + СокрП(Ответ.Значение);
			Иначе
				Стр.Представление = СокрЛП(Ответ.Значение);
			КонецЕсли;
			
		ИначеЕсли Реквизит = "ПрочиеДоходы" Тогда
			
			Стр.ПрочиеДоходы = Ответ.Значение;
			
		ИначеЕсли Реквизит = "РеестрыНДС0Приложение" Тогда
			
			Если Стр.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") 
				И мПорядокОтражения.Найти(Стр.ПорядокОтражения) <> Неопределено  Тогда
				Стр.РеестрыНДС0Приложение = Ответ.Значение;
			КонецЕсли;
				
		КонецЕсли;	
	КонецЦикла;	
	
	Если Распределять И Разница <> 0 Тогда
		Если Реквизит = "Цена" Тогда
			Стр.Цена = Сумма + Разница;
			ПересчитатьСтрокуНаСерере(ВСтр,ЦенаСНДС);
		ИначеЕсли Реквизит = "Сумма" Тогда
			Стр.Сумма = Сумма + Разница;
			Стр.Цена = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
			Стр.НДС = CW_Финансы.РассчитатьСуммуНДС(Стр.Сумма, Истина, Ложь, Ставка);
			Стр.Всего = Стр.Сумма + Стр.НДС;
			ПересчитатьСтрокуНаСерере(ВСтр,ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Сумма НДС" Тогда
			Стр.НДС = Сумма + Разница;
			Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
				Стр.Всего = Стр.Сумма + Стр.НДС;
			Иначе
				Стр.Сумма = Стр.Всего - Стр.НДС;
				Стр.Цена  = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			КонецЕсли;
			ПересчитатьСтрокуНаСерере(ВСтр,ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Всего" Тогда
			Стр.Всего = Сумма + Разница;
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100;
			Стр.НДС   = Стр.Всего * Ставка / (1 + Ставка);
			Стр.Сумма = Стр.Всего - Стр.НДС;
			Стр.Цена  = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			ПересчитатьСтрокуНаСерере(ВСтр,ЦенаСНДС, Истина);
		КонецЕсли;	
	КонецЕсли;	
	
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьИмяРеквизитаТабличнойЧасти(ИмяРеквизитаФормы)
	
	ЭлементФрмы = Элементы.Найти(ИмяРеквизитаФормы);
	мПутьРеквизита = СтрРазделить(ЭлементФрмы.ПутьКДанным,".", Ложь);
	
	//Всегда реквизит табличной части, имя реквизита всегда по индексу 2
	Если мПутьРеквизита.Количество() <> 3 Тогда
		//Это не реквизит табичной части
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяРеквизита = мПутьРеквизита[2];
	
	МассивЗапрещенныхРеквизитов = ПолучитьМассивЗапрещенныхРеквизитов();
	Если МассивЗапрещенныхРеквизитов.Найти(ИмяРеквизита) <> Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЕстьРеквизитОбъекта	= ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизита, Метаданные.Документы.CW_ДоходыПоГрузоперевозке.ТабличныеЧасти.Услуги);
	Если ЕстьРеквизитОбъекта Тогда
		Возврат ИмяРеквизита;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивЗапрещенныхРеквизитов()
	
	Массив = Новый Массив;
	
	Массив.Добавить("Представление_ДоКорректировки");
	Массив.Добавить("Количество_ДоКорректировки");
	Массив.Добавить("Цена_ДоКорректировки");
	Массив.Добавить("Сумма_ДоКорректировки");
	Массив.Добавить("СтавкаНДС_ДоКорректировки");
	Массив.Добавить("НДС_ДоКорректировки");
	Массив.Добавить("Всего_ДоКорректировки");
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// ЗАЧЕТ АВАНСОВ
// ---------------------------------------------------------------------------- 

#Область СпособЗачетаАвансов 

&НаКлиенте
Процедура СпособЗачетаАвансовПриИзменении(Элемент)
	_СпособЗачетаАвансовПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансовОчистка(Элемент, СтандартнаяОбработка)
	_СпособЗачетаАвансовПриИзменении();
КонецПроцедуры
 
&НаСервере
Процедура _СпособЗачетаАвансовПриИзменении()
	
	// очистили значение
	Если Не ЗначениеЗаполнено(Объект.СпособЗачетаАвансов) Тогда
		Объект.СпособЗачетаАвансов = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать"); 
	КонецЕсли; 
	
	// если не по документу, то очищаем таблицу зачета авансов
	Если Объект.СпособЗачетаАвансов <> Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		Объект.ЗачетАвансов.Очистить();
	КонецЕсли; 
	
	// регенерация формы
	_УправлениеЭлементамиФормы();	
	
	// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти 

#Область СпособЗачетаАвансовОЗ

&НаКлиенте
Процедура СпособЗачетаАвансовОЗПриИзменении(Элемент)
	
	_СпособЗачетаАвансовОЗПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансовОЗОчистка(Элемент, СтандартнаяОбработка)
	
	_СпособЗачетаАвансовОЗПриИзменении();	
	
КонецПроцедуры

&НаСервере
Процедура _СпособЗачетаАвансовОЗПриИзменении()
	
	// очистили значение
	Если Не ЗначениеЗаполнено(Объект.СпособЗачетаАвансовОЗ) Тогда
		Объект.СпособЗачетаАвансовОЗ = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать"); 
	КонецЕсли; 
	
	// если не по документу, то очищаем таблицу зачета авансов
	Если Объект.СпособЗачетаАвансовОЗ <> Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		Объект.ЗачетАвансовОЗ.Очистить();
	КонецЕсли; 
	
	// регенерация формы
	_УправлениеЭлементамиФормы();	
	
	// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();

КонецПроцедуры

#КонецОбласти 

#Область ЗачетАвансовОбщие 

&НаКлиенте
Процедура ЗачетАвансовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Попытка
		ПоказатьЗначение(,Элементы.ЗачетАвансов.ТекущиеДанные.ДокументАванса);
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	
	Если (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов) Тогда
		
		ПроверяемыйДокумент = Объект.ВедомыйДокумент;
		ТЧ = Объект.ЗачетАвансов;
		
	ИначеЕсли (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ) Тогда 
		
		ПроверяемыйДокумент = Объект.Ссылка; 
		ТЧ = Объект.ЗачетАвансовОЗ;
		
	КонецЕсли; 
	
	Если ПроверяемыйДокумент.Пустая() Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаОтветаЗаписиПриЗаполненииАвансов",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Документ не записан! Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьЗачетАвансов();
		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаЗаписиПриЗаполненииАвансов(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ВыполнитьЗачетАвансов();
	Иначе
		Возврат;
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗачетАвансов()
	// --- 
	
	Если (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов) Тогда
		
		ПроверяемыйДокумент = Объект.ВедомыйДокумент;
		ТЧ = Объект.ЗачетАвансов;
		
	ИначеЕсли (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ) Тогда 
		
		ПроверяемыйДокумент = Объект.Ссылка; 
		ТЧ = Объект.ЗачетАвансовОЗ;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	БУ = (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов);
	ОЗ = (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ);
	
	ПФ = _ПараметрыФормыПодбораАвансов(БУ, ОЗ);
	Если ПФ.Количество = 0 Тогда
		
		_УФК.ВывестиПредупреждение("Доступных авансов не найдено.");
		ТЧ.Очистить();
		Возврат;
		
	КонецЕсли; 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаЗаполненияАвансов",ЭтотОбъект, Новый Структура("БУ,ОЗ",БУ,ОЗ)); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаЗачетаАвансов",ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаполненияАвансов(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		_ЗагрузитьРезультатПодбораАванса(Ответ,ДополнительныеПараметры.БУ,ДополнительныеПараметры.ОЗ);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПараметрыФормыПодбораАвансов(БУ,ОЗ)
	// --- 
	
	ПФ = Новый Структура("Документ,ЗачетБУ,ЗачетОЗ,Валюта,СуммаСобственных,СуммаПеревыставляемых,ТаблицаАвансов,СчетАвансовПоСобственным,СчетАвансовПоПеревыставляемым,Количество,ОЗ,РаздельныйУчетЗаполженности");
	// ---------------------------------------------------------------------------- 
	ПФ.Документ = Документы.CW_ДоходыПоГрузоперевозке.ПустаяСсылка();
	ПФ.ЗачетБУ = БУ;
	ПФ.ЗачетОЗ = ОЗ;
	ПФ.Валюта = Объект.Валюта;
	ПФ.РаздельныйУчетЗаполженности = РаздельныйУчетЗаполженности;;
	// ---------------------------------------------------------------------------- 
	
	ПараметрыТА = Новый Структура("Дата,Договор,ПриложениеКДоговору,ОЗ,Акт,РаздельныйУчетЗаполженности,ПереплатаКакАванс");
	// --- 
	ПараметрыТА.Договор = Объект.Договор;
	
	//Подсистема УчетПриложенийДоговоров
	ПараметрыТА.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
	//Подсистема УчетПриложенийДоговоров
	
	ПараметрыТА.ОЗ = ОперативныйУчет;
	ПараметрыТА.Акт = Объект.Ссылка;
	ПараметрыТА.РаздельныйУчетЗаполженности = РаздельныйУчетЗаполженности;
	ПараметрыТА.ПереплатаКакАванс 			= ПереплатаКакАванс;
	// --- 
	Услуги = Объект.Услуги.Выгрузить();
	Если (ОперативныйУчет) Тогда
		Если (НЕ Объект.СписокСчетов) Тогда
			Если (ЗначениеЗаполнено(Объект.Счет)) Тогда
				Услуги.ЗаполнитьЗначения(Объект.Счет,"Счет");
			Иначе
				Услуги.ЗаполнитьЗначения(Объект.Ссылка,"Счет");
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;  
	
	Если (БУ) Тогда
		
		ПараметрыТА.Дата = Объект.ВедомыйДокумент.МоментВремени();
		ТаблицаАвансов = CW_Финансы.ТаблицаАвансов(ПараметрыТА,Услуги,Объект.ЗачетАвансов.Выгрузить(), Объект.ЗачетАвансовОЗ.Выгрузить());
		
	ИначеЕсли (ОЗ) Тогда 
		
		ПараметрыТА.Дата = Новый Граница(Объект.ДатаСчета,ВидГраницы.Исключая);
		ТаблицаАвансов = CW_Финансы.ТаблицаАвансовДляОЗ(ПараметрыТА,Услуги,Объект.ЗачетАвансовОЗ.Выгрузить());
		
	КонецЕсли; 
	
	// --- 
	Услуги.Свернуть("ПорядокОтражения", "Всего");
	СуммаСобственных 	= _сф.Итог(Услуги.Скопировать(Новый Структура("ПорядокОтражения",Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга)),"Всего");
	СуммаПрочих 		= _сф.Итог(Услуги.Скопировать(Новый Структура("ПорядокОтражения",Перечисления.CW_ПорядокОтраженияДоходов.ПрочиеДоходы)),"Всего");
    ПФ.СуммаСобственных = СуммаСобственных + СуммаПрочих;
	
	ПФ.СуммаПеревыставляемых = _сф.Итог(Услуги,"Всего")-ПФ.СуммаСобственных;
	
	// ---------------------------------------------------------------------------- 
	
	// счета расчета по возмещаемым
	// --- 
	Счет_Рубли = _ДС().УП.СчетРасчетов_Клиенты_Рубли;
	Счет_Валюта = _ДС().УП.СчетРасчетов_Клиенты_Валюта;
	Счет_УЕ = _ДС().УП.СчетРасчетов_Клиенты_УЕ;
	// --- 
	ВРУ = _ДС().КО.ВалютаРегламентированногоУчета;
	// --- 
	Счета = CW_Конфигурация.ПланСчетов();
	
	// определяем счета
	Если Объект.Валюта=ВРУ Тогда
		// --- 
		ПФ.СчетАвансовПоСобственным = Счета.РасчетыПоАвансамПолученным;
		Если Счет_Рубли=Счета.РасчетыСПокупателями Тогда
			ПФ.СчетАвансовПоПеревыставляемым = Счета.РасчетыПоАвансамПолученным;
		Иначе
			ПФ.СчетАвансовПоПеревыставляемым = Счет_Рубли;
		КонецЕсли;
		// --- 
	Иначе
		Если Объект.Договор.ВзаиморасчетыВУЕ Тогда
			// --- 
			ПФ.СчетАвансовПоСобственным = Счета.РасчетыПоАвансамПолученнымУЕ;
			Если Счет_УЕ = Счета.РасчетыСПокупателямиУЕ Тогда
				ПФ.СчетАвансовПоПеревыставляемым = Счета.РасчетыПоАвансамПолученнымУЕ;
			Иначе
				ПФ.СчетАвансовПоПеревыставляемым = Счет_УЕ;
			КонецЕсли; 
			// --- 
		Иначе 
			// --- 
			ПФ.СчетАвансовПоСобственным = Счета.РасчетыПоАвансамПолученнымВал;
			Если Счет_Валюта = Счета.РасчетыСПокупателямиВал Тогда
				ПФ.СчетАвансовПоПеревыставляемым = Счета.РасчетыПоАвансамПолученнымВал;
			Иначе
				ПФ.СчетАвансовПоПеревыставляемым = Счет_Валюта;
			КонецЕсли; 
			// --- 
		КонецЕсли;	
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	ПФ.ТаблицаАвансов = ПоместитьВоВременноеХранилище(ТаблицаАвансов,ЭтаФорма.УникальныйИдентификатор);
	ПФ.Количество = ТаблицаАвансов.Количество();
	// --- 
	ПФ.ОЗ = _ДС().УП.ОЗ;
	
	// ---------------------------------------------------------------------------- 
	
	Возврат(ПФ);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ЗагрузитьРезультатПодбораАванса(Адрес,БУ,ОЗ)
	// --- 
	
	Попытка
		
		Если (БУ) Тогда
			Объект.ЗачетАвансов.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
		ИначеЕсли (ОЗ) Тогда 
			Объект.ЗачетАвансовОЗ.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
		КонецЕсли; 
		
		ОбновитьИтогиПоАвансам();
		
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
	
	// --- 
КонецПроцедуры

// --- 

Процедура ОбновитьИтогиПоАвансам()
	// --- 
	
	СВ = Строка(Объект.Валюта);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	Если Объект.ЗачетАвансов.Количество() = 0 Тогда
		ИтогоПоАвансам = "Нет зачтённых авансов";
	Иначе
		ИтогоПоАвансам=	"Зачтено:  "+Формат(Объект.ЗачетАвансов.Итог("СуммаЗачета"),ФЧ)+" "+СВ;
	КонецЕсли;
	Если Объект.ЗачетАвансов.Итог("СуммаЗачета") > Объект.Услуги.Итог("Всего") Тогда
		
		Элементы.ИтогоПоАвансам.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		
	Иначе
		
		Элементы.ИтогоПоАвансам.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		
	КонецЕсли; 
	// --- 
	Если Объект.ЗачетАвансовОЗ.Количество() = 0 Тогда
		ИтогоПоАвансамОЗ = "Нет зачтённых авансов";
	Иначе
		ИтогоПоАвансамОЗ =	"Зачтено:  "+Формат(Объект.ЗачетАвансовОЗ.Итог("СуммаЗачета"),ФЧ)+" "+СВ;
	КонецЕсли;
	Если Объект.ЗачетАвансовОЗ.Итог("СуммаЗачета") > Объект.Услуги.Итог("Всего") Тогда
		
		Элементы.ИтогоПоАвансамОЗ.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		
	Иначе
		
		Элементы.ИтогоПоАвансамОЗ.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		
	КонецЕсли; 	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ЗачетАвансовКоманды 

&НаКлиенте
Процедура ЗачетАвансовОЗ_Открыть(Команда)
	
	Если Элементы.ЗачетАвансов.ТекущиеДанные <> Неопределено Тогда
		
		Попытка
			
			ПоказатьЗначение(,Элементы.ЗачетАвансовОЗ.ТекущиеДанные.ДокументАванса);
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовОЗ_Очистить(Команда)
	
	Объект.ЗачетАвансовОЗ.Очистить();
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ЗачетАвансов_Очистить(Команда)
	
	Объект.ЗачетАвансов.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансов_Открыть(Команда)
	
	Если Элементы.ЗачетАвансов.ТекущиеДанные <> Неопределено Тогда
		
		Попытка
			
			ПоказатьЗначение(,Элементы.ЗачетАвансов.ТекущиеДанные.ДокументАванса);
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ЗачетАвансовОЗПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	ЗаполнитьАвансы(Команды.Найти("ЗаполнитьАвансы"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	ЗаполнитьАвансы(Команды.Найти("ЗаполнитьАвансы"));
	
КонецПроцедуры

#КонецОбласти 


#Область ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ

&НаКлиенте
Процедура ЗаполнитьПлатёжноРасчётныеДокументы(Команда)
	
	Если НЕ Объект.Проведен Тогда 
		ПоказатьПредупреждение(Неопределено, "Документ должен быть проведён, чтобы заполнить список платёжно-расчётных длкументов для счёта-фактуры");
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ=ПредопределенноеЗначение("Перечисление.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.ПоДокументу") Тогда 
		ПоказатьПредупреждение(Неопределено, "Ручное заполнение платёжно-расчётных длкументов для счёта-фактуры доступно, если выбрать порядок заполнения ""По документу""");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда
		оо = Новый ОписаниеОповещения("ОбработкаВопросаЗаписи_ЗаполнитьПлатёжноРасчётныеДокументы", ЭтотОбъект); 
		ПоказатьВопрос(оо,"Документ был изменён. Записать?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьПлатёжноРасчётныеДокументыПродолжение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписи_ЗаполнитьПлатёжноРасчётныеДокументы(Ответ, ДополнительныеПараметры) Экспорт 

	Если Ответ=КодВозвратаДиалога.Да Тогда
		Записать();
		ЗаполнитьПлатёжноРасчётныеДокументыПродолжение();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлатёжноРасчётныеДокументыПродолжение()
	
	_ЗаполнитьПлатёжноРасчётныеДокументыНаСервере();
	
	Если Объект.ПлатёжноРасчётныеДокументы.Количество() = 0 Тогда 
		ПоказатьПредупреждение(, 
			"Не найдено ни одного зачтенного аванса, ни сведений о расчетно-платежных документах в перевыставляемых документах ""Расходы по грузоперевозкам""!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьПлатёжноРасчётныеДокументыНаСервере()

	Ответ = Документы.CW_ДоходыПоГрузоперевозке.ПолучитьТаблицу_ПлатёжноРасчётныеДокументы_дляСФ(Объект.Ссылка);
	Если Ответ.Код = 0 Тогда
		Объект.ПлатёжноРасчётныеДокументы.Загрузить(Ответ.ПлатёжноРасчётныеДокументы);
		_УправлениеЭлементамиФормы();
	Иначе 
		Сообщить(Ответ.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// АКТЫ
// ---------------------------------------------------------------------------- 

#Область Акты 

&НаКлиенте
Процедура Акты_Открыть(Команда)
	
	 ОткрытьАкт();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАктовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьАкт();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАкт()
	// --- 
	
	Попытка
		
		ПоказатьЗначение(,Элементы.ТаблицаАктов.ТекущиеДанные.Акт);
		
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Акты_Обновить(Команда)
	
	_ОбновитьАкты();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьАкты()
	
	Если НЕ Объект.ФормируетсяСчет Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_АктированиеИсходящихСчетовОбороты.Регистратор КАК Акт,
	               |	CW_АктированиеИсходящихСчетовОбороты.ВсегоРасход КАК Всего,
	               |	ЕСТЬNULL(CW_АктированиеИсходящихСчетовОбороты.Регистратор.НомерАкта, CW_АктированиеИсходящихСчетовОбороты.Регистратор.Номер) КАК Номер,
	               |	ЕСТЬNULL(CW_АктированиеИсходящихСчетовОбороты.Регистратор.ДатаАкта, CW_АктированиеИсходящихСчетовОбороты.Регистратор.Дата) КАК Дата,
	               |	ЕСТЬNULL(CW_АктированиеИсходящихСчетовОбороты.Регистратор.Корректировка, ИСТИНА) КАК ЭтоАктКорректировка
	               |ИЗ
	               |	РегистрНакопления.CW_АктированиеИсходящихСчетов.Обороты(, , Регистратор, Счет = &Счет) КАК CW_АктированиеИсходящихСчетовОбороты
	               |ГДЕ
	               |	CW_АктированиеИсходящихСчетовОбороты.Регистратор <> &Счет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
	Запрос.УстановитьПараметр("Счет", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	ТаблицаАктов.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаАктов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если ТипЗнч(Выборка.Акт) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда 
			Префикс 			= ?(Выборка.ЭтоАктКорректировка, "(К)","");
			ШаблонПредставления = "Акт №%1 %2 от %3";
		Иначе
			Префикс 	= "";
			Название 	= Выборка.Акт.Метаданные().Синоним;
			ШаблонПредставления = Название+ "№%1 %2 от %3";
		КонецЕсли;
	
		НоваяСтрока.Представление = СтрШаблон(ШаблонПредставления,Строка(Выборка.Номер),Префикс,Формат(Выборка.Дата,"ДФ=dd.MM.yyyy"));
		
	КонецЦикла;
	
	// обновим форму
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

Процедура ОбновитьИтогиПоАктированию()
	
	// обновим итоговую строку
	СВ = Строка(Объект.Валюта);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	
	ИтогоПоАктам = 	"Всего: "+Формат(ТаблицаАктов.Итог("Всего"),ФЧ)+" "+СВ;
	НеАктировано = Объект.Услуги.Итог("Всего")-ТаблицаАктов.Итог("Всего");
	Если НеАктировано <> 0 Тогда
		ИтогоПоАктам = ИтогоПоАктам + ";  Не актировано: "+Формат(НеАктировано,ФЧ)+" "+СВ;
		//Элементы.ИтогоПоАктам.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
	Иначе
		//Элементы.ИтогоПоАктам.ЦветТекста = ЦветаСтиля.ЦветТекстаКнопки;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ
// ---------------------------------------------------------------------------- 

#Область ЗаполнениеАгентскогоВознаграждения 

&НаКлиенте
Процедура ЗаполнитьРасчетАгентскогоВознаграждения(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда 
		_УФК.ВывестиПредупреждение("Не выбран договор!");
		Возврат;
	КонецЕсли;
	Если Объект.ВидОперации<>ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДоходыПоГрузоперевозке.ОтчетАгента") Тогда 
		
		_УФК.ВывестиПредупреждение("Расчёт вознаграждения выполняется только для вида операции ""Отчёт агента""!");
		Возврат;
		
	КонецЕсли;
	Если НЕ _ДС().ПД.АвтоматическийРасчетВознаграждения Тогда 
		
		_УФК.ВывестиПредупреждение("Заполнение по перевыставленнм затратам производится только если в параметрах договора указано автоматически рассчитывать вознаграждение!");
		Возврат;
		
	КонецЕсли;
	Если _ДС().ПД.МоментАвтоматическогоВыставленияВознаграждения <> ПредопределенноеЗначение("Перечисление.CW_МоментАвтоматическогоВыставленияВознаграждения.ОтдельнымДокументом") Тогда 
		
		_УФК.ВывестиПредупреждение("Заполнение по перевыставленнм затратам производится только если момент автоматического выставления вознаграждения - отдельным документом!");
		Возврат;
		
	КонецЕсли;
	
	Ответ = _ЗагрузитьАгентскоеВознаграждение();
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		
		ОбновитьИтогиПоУслугам();
		Если (Объект.Услуги.Количество()=0) Тогда
			
			_УФК.ВывестиПредупреждение("Оснований для начисления вознаграждения не найдено.");
			
		КонецЕсли; 
		
	КонецЕсли; 	
	
	
КонецПроцедуры

&НаСервере
Функция _ЗагрузитьАгентскоеВознаграждение()
	// --- 
	
	Попытка
		
		Объект.Услуги.Очистить();
		// --- 
		ТЗ = Документы.CW_ДоходыПоГрузоперевозке.Услуги_СформироватьВознаграждение(Объект.Дата,Объект.Договор,Объект.ПриложениеКДоговору,_ДС().ПД);
		// --- 
		Объект.Услуги.Загрузить(ТЗ);
		_ОбновитьСтатусПометокУдаления();
		
		ОбновитьПредставлениеНоменклатуры();

		// --- 
		Возврат(_УФКС.Ответ());
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
	// --- 
КонецФункции

&НаСервере
Процедура ОбновитьПредставлениеНоменклатуры()
	
	Для Каждого СтрокаТЗ из Объект.Услуги Цикл
		ИдентификаторСтроки = СтрокаТЗ.ПолучитьИдентификатор();
		_УслугиПредставлениеНачалоВыбора(ИдентификаторСтроки)
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

#Область ЗаполнениеНеперевыставленными

&НаКлиенте
Процедура ЗаполнитьПоНеперевыставленнымЗатратам(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда 
		_УФК.ВывестиПредупреждение("Не выбран договор!");
		Возврат;
	КонецЕсли;
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг") Тогда 
		_УФК.ВывестиПредупреждение("Заполнение по остаткам неперевыставленных затрат производится только если вид операции - оказание услуг!");
		Возврат;
	КонецЕсли;
	// --- 
	Если Объект.Услуги.Количество()<>0 Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиУслугДляЗаполненияПоНеперевыставленным",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Очищать табличную часть при заполнении?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьЗаполнениеПоНеперевыставленнымЗатратам();
		
	КонецЕсли;
	// --- 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОчисткиУслугДляЗаполненияПоНеперевыставленным(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		Объект.Услуги.Очистить();
	КонецЕсли;  
	ВыполнитьЗаполнениеПоНеперевыставленнымЗатратам();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеПоНеперевыставленнымЗатратам()
	// --- 
	
	// открываем форму, даём выбрать
	ПараметрыФормы = Новый Структура;
	АдресаТаблиц = _ПолучитьАдресТаблицПоПеревыставляемым();
	ПараметрыФормы.Вставить("АдресТЗ",АдресаТаблиц.ТаблицаСвертки);
	ПараметрыФормы.Вставить("ВыводитьЗаказы",_ДС().КО.CW_ИспользованиеЗаказов);
	ПараметрыФормы.Вставить("ПоПоставщику",_ДС().НП.ГруппироватьПоПоставщикамПриПеревыставлении);
	Если (НЕ Объект.ФормируетсяСчет И Объект.ФормируетсяАкт И НЕ Объект.СписокСчетов) Тогда
		ПараметрыФормы.Вставить("СчетДляОтбора",Объект.Счет);	
	КонецЕсли; 
	
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаЗаполненияПоНеперевыставленнымЗатратам",ЭтотОбъект, Новый Структура("АдресаТаблиц",АдресаТаблиц)); 
	ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.Форма.ФормаВыбораПеревыставляемыхЗатрат",ПараметрыФормы,ЭтаФорма,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаполненияПоНеперевыставленнымЗатратам(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если Ответ <> Неопределено Тогда
		_ЗагрузитьПеревыставляемые(Ответ,ДополнительныеПараметры.АдресаТаблиц.НовыеУслуги);
		
		#Область Динамический_вывод_дополнительных_колонок
		
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
		
		#КонецОбласти
		
		ОбновитьИтогиПоУслугам();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресТаблицПоПеревыставляемым()
	// --- 
	
	// получим неперевыставленные затраты
	НовыеУслуги = Документы.CW_ДоходыПоГрузоперевозке.Услуги_СформироватьПоНеперевыставленным(Объект.Дата,Объект.Договор);
	
	// получим настройки
	ПоПоставщику = _ДС().НП.ГруппироватьПоПоставщикамПриПеревыставлении;
	Используется1137 = _ДС().УП.СчетаФактурыПоПостановлению1137;
	ИспользуютсяЗаказы = _ДС().КО.CW_ИспользованиеЗаказов;
	
	// для 1137 меняем поставщика на продавца, если указан
	Если Используется1137 Тогда
		
		Для каждого Стр Из НовыеУслуги Цикл
			
			Если НЕ Стр.Продавец.Пустая() Тогда
				
				Стр.Поставщик = Стр.Продавец;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	// подготавливаем таблицу для отбора
	ТЗСвертки = НовыеУслуги.Скопировать(,"Грузоперевозка,Поставщик,ДокументРасходов,Номенклатура,Всего_Рег");
	// группируем
	Если ПоПоставщику Тогда
		
		ТЗСвертки.Свернуть("Грузоперевозка,Поставщик,ДокументРасходов,Номенклатура","Всего_Рег");
		
	Иначе
		
		ТЗСвертки.Свернуть("Грузоперевозка,Номенклатура","Всего_Рег");
		
	КонецЕсли; 
	_сф.т_ПереименоватьКолонки(ТЗСвертки,"Всего_Рег:СуммаВсего");
	ТЗСвертки.Колонки.Добавить("Заказ");
	ТЗСвертки.Колонки.Добавить("Пометка");
	Для каждого Стр Из ТЗСвертки Цикл
		
		Стр.Заказ = Стр.Грузоперевозка.Заказ;
		Стр.Пометка = Ложь;
		
	КонецЦикла; 
	
	СА = Новый Структура("ТаблицаСвертки,НовыеУслуги");
	СА.ТаблицаСвертки = ПоместитьВоВременноеХранилище(ТЗСвертки,ЭтаФорма.УникальныйИдентификатор);
	СА.НовыеУслуги = ПоместитьВоВременноеХранилище(НовыеУслуги,ЭтаФорма.УникальныйИдентификатор);
	
	Возврат(СА);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ЗагрузитьПеревыставляемые(АдресСвертки,АдресНовыхУслуг)
	// --- 
	
	// формируем тз по отбору
	ТЗСвертки = ПолучитьИзВременногоХранилища(АдресСвертки);
	НовыеУслуги = ПолучитьИзВременногоХранилища(АдресНовыхУслуг);
	ТаблицаУслуг = НовыеУслуги.СкопироватьКолонки();
	тзУслугиДляСохранения = Объект.Услуги.Выгрузить();
	ПоПоставщику = _ДС().НП.ГруппироватьПоПоставщикамПриПеревыставлении;
	флЗановоФормироватьПредставлениеПриПеревыставленииЗатрат = CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат");
	_сф.т_ПереименоватьКолонки(ТЗСвертки,"СуммаВсего:Всего");
	Для каждого Стр Из ТЗСвертки Цикл
		
		Если ПоПоставщику Тогда
			
			Отбор = _сф.ст_Создать("Грузоперевозка,Поставщик,ДокументРасходов,Номенклатура",Стр);
			
		Иначе
			
			Отбор = _сф.ст_Создать("Грузоперевозка,Номенклатура",Стр);
			
		КонецЕсли; 
		
		СтрокиПоГП = НовыеУслуги.НайтиСтроки(Отбор);
		Для каждого Стр Из СтрокиПоГП Цикл
			
			Нстр = ТаблицаУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,Стр);
			
		КонецЦикла; 
		
		// --- 
		
	КонецЦикла; 
	// --- 
	
	ТребуетсяПересчетВалюты = (Объект.Валюта <> _ДС().КО.ВалютаРегламентированногоУчета);
	ТребуетсяВознаграждение = (_ДС().ПД.АвтоматическийРасчетВознаграждения И _ДС().ПД.МоментАвтоматическогоВыставленияВознаграждения=Перечисления.CW_МоментАвтоматическогоВыставленияВознаграждения.ПриПеревыставлении);
	
	// просто пересчитываем из рублей
	Если ТребуетсяПересчетВалюты Тогда
		
		ДатаКурса = ?(Объект.ДатаАкта=Дата(1,1,1),Объект.Дата,Объект.ДатаАкта);
		Если Объект.УЕ_ПользовательскийКурс Тогда  
			СК = Новый Структура;
			СК.Вставить("Курс", 		Объект.УЕ_Курс);
			СК.Вставить("Кратность", 	Объект.УЕ_Кратность);
			СК.Вставить("Валюта", 		Объект.Валюта);
			СК.Вставить("ДатаКурса", 	ДатаКурса);
		Иначе
			СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта, ДатаКурса);
		КонецЕсли;    
		
		Документы.CW_ДоходыПоГрузоперевозке.Услуги_ПересчитатьИзВалютыРегламентированногоУчета(ТаблицаУслуг, СК);
		
	Иначе
		
		Документы.CW_ДоходыПоГрузоперевозке.Услуги_ПеренестиИзВалютыРегламентированногоУчета(ТаблицаУслуг);
		
	КонецЕсли;
	
	Если ТребуетсяВознаграждение Тогда
		
		ТаблицаУслуг.Колонки.Добавить("База");
		Документы.CW_ДоходыПоГрузоперевозке.Услуги_ДобавитьВознаграждение(ТаблицаУслуг,Объект.Договор,Объект.ПриложениеКДоговору,_ДС().ПД,Объект.Дата);
		
		ОбновитьПредставлениеНоменклатуры();

	КонецЕсли; 
	
	// загружаем только если был выбор
	// ---------------------------------------------------------------------------- 
	Для каждого Стр Из ТаблицаУслуг Цикл
		
		Нстр = тзУслугиДляСохранения.Добавить();
		ЗаполнитьЗначенияСвойств(Нстр,Стр);
		
	КонецЦикла; 
	
	тзУслугиДляСохранения.Колонки.Добавить("Покупатель");
	тзУслугиДляСохранения.Колонки.Добавить("ДоговорПокупателя");
	
	тзУслугиДляСохранения.ЗаполнитьЗначения(Объект.Контрагент	, "Покупатель");
	тзУслугиДляСохранения.ЗаполнитьЗначения(Объект.Договор		, "ДоговорПокупателя");
	
	// формируем представление номенклатуры
	Документы.CW_ДоходыПоГрузоперевозке.Услуги_СформироватьПредставлениеНоменклатуры(тзУслугиДляСохранения,Объект.Договор,Объект,флЗановоФормироватьПредставлениеПриПеревыставленииЗатрат);
	
	Объект.Услуги.Загрузить(тзУслугиДляСохранения);
	_ОбновитьСтатусПометокУдаления();
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ЗаполнениеНеперевыставленнымиПоСтавкам

&НаКлиенте
Процедура ЗаполнитьПоНеперевыставленнымПоСтавкам(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда 
		_УФК.ВывестиПредупреждение("Не выбран договор!");
		Возврат;
	КонецЕсли;
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг") Тогда 
		_УФК.ВывестиПредупреждение("Заполнение по остаткам неперевыставленных затрат 
		               |производится только для вид операции ""Оказание услуг""!");
		Возврат;
	КонецЕсли;
	
	Если (Объект.Услуги.Количество()<>0) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиУслугПриЗаполненииПоНеперевыставленнымПоСтавкам",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Табличная часть будет очищена. 
			        |Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьЗаполнениеПоНеперевыставленнымПоСтавкам();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОчисткиУслугПриЗаполненииПоНеперевыставленнымПоСтавкам(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		Объект.Услуги.Очистить();
	КонецЕсли; 
	ВыполнитьЗаполнениеПоНеперевыставленнымПоСтавкам();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеПоНеперевыставленнымПоСтавкам()
	// --- 
	
	Ответ = _ЗаполнитьПоНеперевыставленнымПоСтавкам();
	Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
		_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
	КонецЕсли; 
	
	#Область Динамический_вывод_дополнительных_колонок
	
	_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	
	#КонецОбласти
	
	ОбновитьИтогиПоУслугам();
	_УправлениеЭлементамиФормы();
	// --- 
КонецПроцедуры

&НаСервере
Функция _ЗаполнитьПоНеперевыставленнымПоСтавкам()
	
	ТаблицаУслуг = Документы.CW_ДоходыПоГрузоперевозке.Услуги_СформироватьПоНеперевыставленнымПоСтавкам(Объект.Дата,Объект.Договор);
	
	флЗановоФормироватьПредставлениеПриПеревыставленииЗатрат = CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат");
	
	ТребуетсяПересчетВалюты = (Объект.Валюта <> _ДС().КО.ВалютаРегламентированногоУчета);
	
	Если ТребуетсяПересчетВалюты Тогда
		СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,?(Объект.ДатаАкта=Дата(1,1,1),Объект.Дата,Объект.ДатаАкта));
		Документы.CW_ДоходыПоГрузоперевозке.Услуги_ПересчитатьИзВалютыРегламентированногоУчета(ТаблицаУслуг,СК);
	Иначе
		Документы.CW_ДоходыПоГрузоперевозке.Услуги_ПеренестиИзВалютыРегламентированногоУчета(ТаблицаУслуг);
	КонецЕсли;
	
	// формируем представление номенклатуры
	Документы.CW_ДоходыПоГрузоперевозке.Услуги_СформироватьПредставлениеНоменклатуры(ТаблицаУслуг,Объект.Договор,Объект, флЗановоФормироватьПредставлениеПриПеревыставленииЗатрат);
	Если (ТаблицаУслуг.Количество() <> 0) Тогда
		
		Для каждого Стр Из ТаблицаУслуг Цикл
			Нстр = Объект.Услуги.Добавить();
			
			ЗаполнитьЗначенияСвойств(Нстр,Стр);
			
			ЗначениеПараметра	= Стр.Количество;
			Если РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки Тогда
				//Получаем количество из Параметра
				ЗначениеПараметра	= 0;
				СтруктураПараметров = новый Структура("ТипПеревозки,Номенклатура,ЕдиницаИзмерения", Стр.Грузоперевозка.ТипПеревозки, Стр.Номенклатура, Стр.Номенклатура.ЕдиницаИзмерения);
				НайденныйПараметр 	= CW_Документы.ПолучитьПараметрДляПодстановкиЗначенияВКоличество(СтруктураПараметров);
				Если НайденныйПараметр <> Неопределено Тогда
					//Получаем только первое значение
					СтрокаПараметраГП = Стр.Грузоперевозка.ПараметрыГрузоперевозки.Найти(НайденныйПараметр, "Параметр");
					Если СтрокаПараметраГП <> Неопределено Тогда
						ЗначениеПараметра = СтрокаПараметраГП.Значение;
					КонецЕсли;
				КонецЕсли;	
				Если Не ЗначениеЗаполнено(ЗначениеПараметра) и Не УстановитьЗначениеНольЗначениеПараметраНеУстановлено тогда
					ЗначениеПараметра = 1;
				КонецЕсли;
			КонецЕсли;
			
			Нстр.Количество = ЗначениеПараметра;
			
		КонецЦикла; 
		
		//Поставим цены из протокола согласования
		Документы.CW_ДоходыПоГрузоперевозке.Услуги_УстновитьЦенуУслугПоПротоколуСогласованияЦен(Объект.Услуги, Объект);	
		
		
		_ОбновитьСтатусПометокУдаления();
		Модифицированность = истина;
		
		Возврат(_УФКС.Ответ());
	Иначе
		Возврат(_УФКС.Ответ(1,"Данных для заполнения нет."));
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();

КонецФункции

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// КОМАНДЫ
// ---------------------------------------------------------------------------- 

#Область ЗаполнитьПоНеактированнымСчетам

&НаСервере
Процедура ОбработкаВыбораСчетоДляЗаполненеия(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> Неопределено Тогда
		ОбработатьРезультатаВыбора(Ответ, ДополнительныеПараметры);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатаВыбора(РезультатВыбора,ДополнительныеПараметры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Номенклатура КАК Номенклатура,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Представление КАК Представление,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Количество КАК Количество,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Цена КАК Цена,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Сумма КАК Сумма,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.НДС КАК НДС,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Всего КАК Всего,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Затраты КАК Затраты,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов КАК ДокументРасходов,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.База КАК База,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ВводОстатков КАК ВводОстатков,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка КАК Счет,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ОЗ_Всего КАК ОЗ_Всего,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ОЗ_НДС КАК ОЗ_НДС,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ОЗ_Сумма КАК ОЗ_Сумма,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.СчетЗадолженности КАК СчетЗадолженности,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Представление_ДоКорректировки КАК Представление_ДоКорректировки,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Количество_ДоКорректировки КАК Количество_ДоКорректировки,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Цена_ДоКорректировки КАК Цена_ДоКорректировки,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Сумма_ДоКорректировки КАК Сумма_ДоКорректировки,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.СтавкаНДС_ДоКорректировки КАК СтавкаНДС_ДоКорректировки,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.НДС_ДоКорректировки КАК НДС_ДоКорректировки,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Всего_ДоКорректировки КАК Всего_ДоКорректировки
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка В(&МассивСсылок)";
	
	Запрос.УстановитьПараметр("МассивСсылок", РезультатВыбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Услуги.Загрузить(РезультатЗапроса.Выгрузить());
	
	СписокСчетов = РезультатВыбора.Количество() > 1;
	
	Объект.СписокСчетов = СписокСчетов;
	
	Если Не СписокСчетов Тогда 
		Если РезультатВыбора.Количество() = 1 Тогда
			Объект.Счет = РезультатВыбора[0];
		КонецЕсли;
	КонецЕсли;
	
	_ОбновитьНомераДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоНеактированнымСчетам(Команда)
	
	Если Объект.Услуги.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение,"Табличная часть будет очищена. Продолжить?", Режим, 0);
	Иначе
		ПродолжитьВыборДокументов();	
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыборДокументов();
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыборДокументов()
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка"	, ПолучитьМассивДокументовДляОтбора());
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("Отбор"				, ПараметрыОтбора);
	ПараметрыФормыВыбора.Вставить("РежимВыбора"			, Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор"	, Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораСчетоДляЗаполненеия",ЭтотОбъект); 
	ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.ФормаВыбора",ПараметрыФормыВыбора,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДокументовДляОтбора()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыПоГрузоперевозке.Ссылка КАК Ссылка
	               |ИЗ
	               |	РегистрНакопления.CW_АктированиеИсходящихСчетов.Остатки(&ДатаСреза, ) КАК CW_АктированиеИсходящихСчетовОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	               |		ПО CW_АктированиеИсходящихСчетовОстатки.Счет = CW_ДоходыПоГрузоперевозке.Ссылка
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозке.Проведен
	               |	И НЕ CW_ДоходыПоГрузоперевозке.ФормируетсяАкт
	               |	И CW_ДоходыПоГрузоперевозке.ФормируетсяСчет
	               |	И CW_ДоходыПоГрузоперевозке.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор"		, Объект.Договор);
	Запрос.УстановитьПараметр("ДатаСреза"	, ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивДокументов = новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивДокументов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(МассивДокументов); 
														
КонецФункции

&НаСервере
Процедура УстановитьВидимостьКомандыЗаполнитьПоНеактированнымСчетам()
	
	Элементы.УслугиЗаполнитьПоНеактированнымСчетам.Видимость = Объект.ФормируетсяАкт и Не Объект.ФормируетсяСчет;

КонецПроцедуры

#КонецОбласти


#Область ВводНаОсновании 

&НаСервере
Функция ПолучитьДанныеДляВводаНаОсновании()
	
	СтруктураОснования = Новый Структура;
	СтруктураОснования.Вставить("Ссылка"				, Объект.Ссылка);
	СтруктураОснования.Вставить("ФормируетсяСчет"		, Объект.ФормируетсяСчет);
	СтруктураОснования.Вставить("ФормируетсяАкт"		, Объект.ФормируетсяАкт);
	СтруктураОснования.Вставить("ФормируетсяСчетФактура", Объект.ФормируетсяСчетФактура);
	
	Возврат СтруктураОснования;
	
КонецФункции

#КонецОбласти 

#Область ВыборВидаОперации 

&НаКлиенте
Процедура УстановитьВидОперации(Команда)
	
	ВыбратьЗначениеВидаОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеВидаОперации()
	
	СписокВидовОпераций = Новый СписокЗначений;
	СписокВидовОпераций.Добавить(ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг"),"Оказание услуг");
	СписокВидовОпераций.Добавить(ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДоходыПоГрузоперевозке.ОтчетАгента"),"Отчёт агента");
	
	Выбор = СписокВидовОпераций.НайтиПоЗначению(Объект.ВидОперации);
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВидаОперации",ЭтотОбъект); 
	СписокВидовОпераций.ПоказатьВыборЭлемента(ПОВ,"Выберите вид операции", Выбор);
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаВыбораВидаОперации(Выбор, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Выбор <> Неопределено) Тогда
		Объект.ВидОперации = Выбор.Значение;
		_УправлениеЭлементамиФормы();
		_СформироватьЗаголовок();
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

#Область ПолучениеНомера 

&НаКлиенте
Процедура ПолучитьНомер(Команда)
	
	// автоматическая установка номера возможно 
	// только если задана организация
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		_УФК.ВывестиПредупреждение("Для автоматической установки нового номера
					   |необходимо выбрать организацию.",10);
		Возврат;
	КонецЕсли;
	
	// получаем новый номер
	СтарыйНомер = Объект.Номер;
	_ПолучитьНомер();
	
	// если изменился номер, то попытаемся его переприсвоить первичным документам
	Если СтарыйНомер <> Объект.Номер Тогда
		НомерПриИзменении(ЭтаФорма.ТекущийЭлемент);	
		
		// регенерация номеров
		_ОбновитьНомераДокументов();
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура _ПолучитьНомер()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	_сф.ст_ДобавитьСвойства(ДокументОбъект.ДополнительныеСвойства,"*",_ДС());
	ДокументОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	
КонецПроцедуры

#КонецОбласти 

#Область ПодборГрузоперевозок 

&НаКлиенте
Процедура Подбор(Команда)
	
	Если Объект.Валюта.Пустая() Тогда
		
		_УФК.ВывестиПредупреждение("Не указана валюта документа");
		Возврат;
		
	КонецЕсли; 
	
	// формируем параметры
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодбора",ЭтотОбъект);
	ПФ = ПолучитьПараметрыФормыПодбора();
	ОткрытьФорму("ОбщаяФорма.CW_ФормаПодбора",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбора(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьПодборНаСервере(Результат);

	//подсистема.Бюджетирование
	Если CW_Бюджетирование.ВедетсяУчетСтатейБюджетаВДокументах() Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПолученияСтатейБюджета", ЭтотОбъект); 
		CW_БюджетированиеКлиент.ЗаполнитьСтатьиБюджетаПослеподбора(ЭтаФорма, ОповещениеОЗавершении);	
	КонецЕсли;
	//подсистема.Бюджетирование

	ДобавитьЗависимуюУслугу();
	
	// обновим итоги в табличных частях
	ОбновитьИтогиПоУслугам();
	_ОбновитьСтатусПометокУдаления();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗависимуюУслугу()
	
	//Проверим и при необходимости добавим дополнительную услугу
	CW_Подписки.ДобавитьДополнительнуюУслугу(Объект);

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыПодбора()
	
	СтруктураПараметров = Новый Структура("Договор,Валюта,ТипДокумента,Грузоперевозки,ДатаДокумента");
	СтруктураПараметров.Договор 		= Объект.Договор;
	СтруктураПараметров.Валюта 			= Объект.Валюта;
	СтруктураПараметров.ТипДокумента 	= РеквизитФормыВЗначение("Объект").Метаданные().Имя;
	СтруктураПараметров.Грузоперевозки 	= _сф.м_СоздатьИзКолонкиТЗ(Объект.Услуги.Выгрузить(),"Грузоперевозка");
	
	ДатаДокумента = Объект.Дата;
	Если Объект.ФормируетсяАкт 
		и ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
		ДатаДокумента = Объект.ДатаАкта;  
	ИначеЕсли Объект.ФормируетсяСчет  
		и ЗначениеЗаполнено(Объект.ДатаСчета)Тогда
		ДатаДокумента = Объект.ДатаСчета;  
	КонецЕсли;

	ДатаДокумента = ?(ДатаДокумента = Дата(1,1,1), ТекущаяДата(), ДатаДокумента);
	
	СтруктураПараметров.ДатаДокумента = ДатаДокумента;

	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Процедура ОбработатьПодборНаСервере(Результат)
	// --- 
	
	Если Результат.Вариант = "Грузоперевозка" Тогда
		
			Нстр = Объект.Услуги.Добавить();
			Нстр.Грузоперевозка = Результат.Грузоперевозка;
			Нстр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
			Нстр.Количество = 1;
			
			Если Объект.Корректировка Тогда
				Нстр.ЭтоДобавленнаяСтрока = Истина;
			КонецЕсли;
			
			// --- 
			ОбновитьИтогиПоУслугам();
			_ОбновитьСтатусПометокУдаления();
			
		ИначеЕсли Результат.Вариант = "Бюджет" Тогда
			
			Если (Результат.Свойство("КомментарийЗаполнения")) Тогда
				Сообщить(Результат.КомментарийЗаполнения); 
			КонецЕсли;
			ТЗУслуг = ПолучитьИзВременногоХранилища(Результат.Строки);
			Если (Результат.ПерезаполнитьДокумент) Тогда
				Объект.Услуги.Очистить();
			КонецЕсли; 
			Для каждого Стр Из ТЗУслуг Цикл
				
				Нстр = Объект.Услуги.Добавить();
				ЗаполнитьЗначенияСвойств(Нстр,Стр);
				
				ПересчитатьСтрокуНаСерере(Нстр.ПолучитьИдентификатор(), Объект.ЦенаСНДС, Истина);
				
			КонецЦикла;
			// --- 
			ОбновитьИтогиПоУслугам();
			_ОбновитьСтатусПометокУдаления();
			
		ИначеЕсли Результат.Вариант = "ГрузоперевозкиИНоменклатура" Тогда
			
			ИспользуетсяОграничениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре();
	
			СтруктураНоменклатуры = Результат.СтруктураНоменклатуры;
			
			// определяем вариант представления
			// 0 - получаем шаблон
			// 1 - используем полученный шаблон
			
			// определяем вариант суммы
			// 0 - по цене номенклатуры
			// 1 - фиксированное значение 
			// 2 - фиксированное значение цены
			// для фиксированных значений необходимо прочитать саму сумму и признак того, что сумма с НДС
			
			// режим распределения суммы
			// 0 - на все г/п
			// 1 - на каждую г/п
			// 2 - пропорционально параметру
			
			// порядок получения количества
			// 0 - из параметра грузоперевозки
			// 1 - фиксированная сумма
	
			// учитываем РазделитьКоличествоУслугНаКоличествоГрузоперевозок
			
			СуммаУслуги = 0;
			РазделитьКоличествоУслугНаКоличествоГрузоперевозок 	= _сф.ст_ПолучитьСвойство(СтруктураНоменклатуры,"РазделитьКоличествоУслугНаКоличествоГрузоперевозок");
			РаспределитьКоличествоПророрциональноПараметру 		= _сф.ст_ПолучитьСвойство(СтруктураНоменклатуры,"РаспределитьКоличествоПророрциональноПараметру");
			ПорядокПолученияКоличества 							= _сф.ст_ПолучитьСвойство(СтруктураНоменклатуры,"ПорядокПолученияКоличества");
			
			Если ПорядокПолученияКоличества = 1 Тогда
				Количество = _сф.ст_ПолучитьСвойство(СтруктураНоменклатуры,"Количество");
				Если (Количество = Неопределено) Тогда
					Количество = 1;
				КонецЕсли;
			Иначе
			
				Если РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки Тогда
					
					//получаем количество из параметров ГП
					КоличествоПоГрузоперевозкам = Новый Соответствие;
					Для каждого Грузоперевозка Из Результат.Грузоперевозки Цикл
						
						//Получаем количество из Параметра
						ЗначениеПараметра	= 0;
						СтруктураПараметров = новый Структура("ТипПеревозки,Номенклатура,ЕдиницаИзмерения", Грузоперевозка.ТипПеревозки,СтруктураНоменклатуры.Номенклатура,СтруктураНоменклатуры.Номенклатура.ЕдиницаИзмерения);
						НайденныйПараметр 	= CW_Документы.ПолучитьПараметрДляПодстановкиЗначенияВКоличество(СтруктураПараметров);
						
						Если НайденныйПараметр <> Неопределено Тогда
							//Получаем только первое значение
							СтрокаПараметраГП = Грузоперевозка.ПараметрыГрузоперевозки.Найти(НайденныйПараметр, "Параметр");
							
							Если СтрокаПараметраГП <> Неопределено Тогда
								ЗначениеПараметра = СтрокаПараметраГП.Значение;
							КонецЕсли;
							
						КонецЕсли;	
						
						Если Не ЗначениеЗаполнено(ЗначениеПараметра) и Не УстановитьЗначениеНольЗначениеПараметраНеУстановлено тогда
							ЗначениеПараметра = 1;
						КонецЕсли;
						
						КоличествоПоГрузоперевозкам.Вставить(Грузоперевозка,ЗначениеПараметра);
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОбратныйПересчет = Ложь;
			Если НЕ ЗначениеЗаполнено(СтруктураНоменклатуры.СтавкаНДС) Тогда
				
				СуммаУслуги = 0;
				
			Иначе
				Если СтруктураНоменклатуры.ВариантОпределенияСуммы =1 Тогда
					
					СуммаУслуги 		= СтруктураНоменклатуры.Всего;
					ОбратныйПересчет 	= СтруктураНоменклатуры.СуммаВключаетНДС; 
					
				ИначеЕсли СтруктураНоменклатуры.ВариантОпределенияСуммы = 2 Тогда
					
					ЦенаУслуги 			= СтруктураНоменклатуры.Цена;
					ОбратныйПересчет 	= СтруктураНоменклатуры.ЦенаВключаетНДС; 

				ИначеЕсли Не ИспользуетсяОграничениеУслуг Тогда  
					
					// получаем сумму из тепа цены
					ТипЦен = _ДС().ПД.ТипЦен;
					Если НЕ ТипЦен.Пустая() Тогда
						
						СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,_ДатаВозникновенияЗадолженности());
						Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтруктураНоменклатуры.Номенклатура, ТипЦен, _ДатаВозникновенияЗадолженности(), Объект.Валюта, СК.Курс,СК.Кратность);
						ОбратныйПересчет = ТипЦен.ЦенаВключаетНДС;
						СуммаУслуги = Цена*Количество;
						
					Иначе
						
						ОбратныйПересчет = Ложь;
						СуммаУслуги = 0;
						
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли; 
			
			// распределение по параметру
			Если СуммаУслуги <> 0 И СтруктураНоменклатуры.ВариантРаспределения = 2 Тогда 
				
				// считаем общую сумму 
				ТР = _сф.т_Создать("Грузоперевозка,Значение");
				Для каждого Грузоперевозка Из Результат.Грузоперевозки Цикл
					
					СтрокаПараметра = _сф.к_НайтиСтроку(Грузоперевозка.ПараметрыГрузоперевозки,_сф.ст_Отбор("Параметр",СтруктураНоменклатуры.ПараметрРаспределения));
					Если СтрокаПараметра = Неопределено Тогда
						
						Значение = 0;
						
					Иначе
						
						Значение = Число(СтрокаПараметра.Значение);
						
					КонецЕсли; 
					
					Нстр = ТР.Добавить();
					Нстр.Грузоперевозка = Грузоперевозка;
					Нстр.Значение = Значение;
					
				КонецЦикла; 
				
				БазаРаспределенияПоПараметру = _сф.Итог(ТР,"Значение");
				СоответствиеЗначенийПараметра = _сф.со_Создать("Грузоперевозка","Значение",ТР);
				
				Если БазаРаспределенияПоПараметру = 0 Тогда
					
					СуммаУслуги = 0;
					
				КонецЕсли; 
				
			КонецЕсли;
			
			// проверяем вариант распределения
			Если СтруктураНоменклатуры.ВариантРаспределения = 0 ИЛИ СтруктураНоменклатуры.ВариантРаспределения = 2 Тогда
				
				ОстатокРаспределения = СуммаУслуги;
				
			КонецЕсли; 
			
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(СтруктураНоменклатуры.СтавкаНДС);
			
			// ЗАПОЛНЯЕМ
			// ---------------------------------------------------------------------------- 
			Индекс=0;
			Для каждого Грузоперевозка Из Результат.Грузоперевозки Цикл
				
				_сф.Инкремент(Индекс);
				
				Нстр = Объект.Услуги.Добавить();
				Нстр.Грузоперевозка 	= Грузоперевозка;
				Нстр.Номенклатура 		= СтруктураНоменклатуры.Номенклатура;
				Нстр.СтатьяЗатрат 		= СтруктураНоменклатуры.СтатьяЗатрат;
				Нстр.ПорядокОтражения 	= СтруктураНоменклатуры.ПорядокОтраженияДоходов;
				Нстр.СтавкаНДС 			= СтруктураНоменклатуры.СтавкаНДС;
				
				Если Объект.Корректировка Тогда
					Нстр.ЭтоДобавленнаяСтрока = Истина;
				КонецЕсли;

				// --- 
				Если ПорядокПолученияКоличества = 0 Тогда
					Количество = КоличествоПоГрузоперевозкам.Получить(Грузоперевозка);	
					
					//ВРЕМЕННО УДАЛЕНО
					//Если Количество = 0 Тогда
					//	Сообщение = новый СообщениеПользователю;
					//	Сообщение.Текст = "По грузоперевозке "+Строка(Грузоперевозка)+" не удалось получить количество услуги!";
					//	Сообщение.ПутьКДанным  = "Объект";
					//	Сообщение.Поле    = "Услуги["+Нстр.ПолучитьИдентификатор()+"].Количество";
					//	Сообщение.Сообщить();
					//конецЕсли;
					
				КонецЕсли;
				
				Нстр.Количество = Количество;
				Если СтруктураНоменклатуры.ВариантОпределенияСуммы = 2 Тогда  
					
					Если ОбратныйПересчет Тогда
						Нстр.Всего 	= ЦенаУслуги * Количество;
						Нстр.НДС 	= Нстр.Всего*(Ставка/(100+Ставка));
						Нстр.Сумма 	= Нстр.Всего - Нстр.НДС;
						Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма, Нстр.Количество);
					Иначе
						Нстр.Цена 	= ЦенаУслуги; 
						Нстр.Сумма 	= ЦенаУслуги * Количество;
						Нстр.НДС 	= Нстр.Сумма * (Ставка/100);
						Нстр.Всего 	= Нстр.Сумма + Нстр.НДС;
					КонецЕсли;   
					
					ПересчитатьСтрокуНаСерере(Нстр.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
					
				ИначеЕсли ИспользуетсяОграничениеУслуг и СтруктураНоменклатуры.ВариантОпределенияСуммы = 0 Тогда
					
					Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
						
						СтруктураПараметров = Новый Структура;
						СтруктураПараметров.Вставить("АдресУслугПоДоговору"						, АдресУслугПоДоговору);
						СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтГруза"		, УстанавливатьЦенуВЗависимостиОтГруза);
						СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтКлиента"	, Ложь);
						
						СтруктураПараметров.Вставить("Номенклатура"							, СтруктураНоменклатуры.Номенклатура);
						Если УстанавливатьЦенуВЗависимостиОтГруза Тогда
							СтруктураПараметров.Вставить("Груз" , Грузоперевозка.Груз);
						КонецЕсли;
						
						УслугаДоговора = _УФС.ПолучитьУслугуДоговораПоПараметрам(СтруктураПараметров);	
						
						Если УслугаДоговора <> Неопределено Тогда 	
							
							Сумма		= УслугаДоговора.ЦенаБезНДС * Количество;
							Если ЗначениеЗаполнено(УслугаДоговора.СтавкаНДС)  Тогда
								НДС = Сумма * CW_Финансы.ПолучитьСтавкуНДС(УслугаДоговора.СтавкаНДС)/100;
							Иначе
								НДС = 0;
							КонецЕсли; 
							
							Если ЗначениеЗаполнено(УслугаДоговора.ПорядокОтражения) Тогда
								Нстр.ПорядокОтражения = УслугаДоговора.ПорядокОтражения;
							КонецЕсли;
							
							Нстр.СтавкаНДС 	= УслугаДоговора.СтавкаНДС;
							Нстр.Цена 		= УслугаДоговора.ЦенаБезНДС;
							Нстр.НДС 		= НДС;
							Если УслугаДоговора.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДССверху тогда
								Нстр.Сумма 		= УслугаДоговора.ЦенаБезНДС * Количество;
								ОбратныйПересчет = Ложь;
							Иначе //в сумме
								Нстр.Всего = УслугаДоговора.Цена * Количество;
								ОбратныйПересчет = Истина;
							КонецЕсли;
							
							Ставка = CW_Финансы.ПолучитьСтавкуНДС(УслугаДоговора.СтавкаНДС);
							
							Если ОбратныйПересчет Тогда
								
								Нстр.НДС 	= Нстр.Всего*(Ставка/(100+Ставка));
								Нстр.Сумма 	= Нстр.Всего - Нстр.НДС;
								Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
								
							Иначе
								
								Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
								Нстр.НДС 	= Нстр.Сумма*(Ставка/100);
								Нстр.Всего 	= Нстр.Сумма+Нстр.НДС;
								
							КонецЕсли;   
							
							ПересчитатьСтрокуНаСерере(Нстр.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
							
						КонецЕсли; 
						
					КонецЕсли;
					
				Иначе				
					// --- 
					
					Если (СуммаУслуги <> 0) Тогда
						// --- 
						
						// на каждую г/п
						Если СтруктураНоменклатуры.ВариантРаспределения = 1 Тогда
							
							Если ОбратныйПересчет Тогда
								
								Нстр.Всего = СуммаУслуги;
								
							Иначе
								
								Нстр.Сумма = СуммаУслуги;
								
							КонецЕсли; 
							
							Если (РазделитьКоличествоУслугНаКоличествоГрузоперевозок) Тогда
								
								Нстр.Количество = Количество/Результат.Грузоперевозки.Количество();
								
							КонецЕсли; 
							
							// на все г/п
						ИначеЕсли СтруктураНоменклатуры.ВариантРаспределения = 0 Тогда 
							
							Если ОбратныйПересчет Тогда
								
								Нстр.Всего = СуммаУслуги/Результат.Грузоперевозки.Количество();
								_сф.Декремент(ОстатокРаспределения,Нстр.Всего);
								
							Иначе
								
								Нстр.Сумма = СуммаУслуги/Результат.Грузоперевозки.Количество();
								_сф.Декремент(ОстатокРаспределения,Нстр.Сумма);
								
							КонецЕсли; 
							
							Если (РазделитьКоличествоУслугНаКоличествоГрузоперевозок) Тогда
								
								Нстр.Количество = Количество/Результат.Грузоперевозки.Количество();
								
							КонецЕсли; 
							
							Если Результат.Грузоперевозки.Количество()=Индекс Тогда
								
								_сф.Инкремент(?(ОбратныйПересчет,Нстр.Всего,Нстр.Сумма),ОстатокРаспределения);
								
							КонецЕсли; 
							
							// по параметру
						ИначеЕсли СтруктураНоменклатуры.ВариантРаспределения = 2 Тогда 
							
							Если ОбратныйПересчет Тогда
								
								Нстр.Всего = СуммаУслуги*СоответствиеЗначенийПараметра.Получить(Грузоперевозка)/БазаРаспределенияПоПараметру;
								_сф.Декремент(ОстатокРаспределения,Нстр.Всего);
								
							Иначе
								
								Нстр.Сумма = СуммаУслуги*СоответствиеЗначенийПараметра.Получить(Грузоперевозка)/БазаРаспределенияПоПараметру;
								_сф.Декремент(ОстатокРаспределения,Нстр.Сумма);
								
							КонецЕсли; 
							
							Если (РаспределитьКоличествоПророрциональноПараметру) Тогда
								
								Нстр.Количество = Количество*СоответствиеЗначенийПараметра.Получить(Грузоперевозка)/БазаРаспределенияПоПараметру;
								
							КонецЕсли; 
							
							Если Результат.Грузоперевозки.Количество()=Индекс Тогда
								
								_сф.Инкремент(?(ОбратныйПересчет,Нстр.Всего,Нстр.Сумма),ОстатокРаспределения);
								
							КонецЕсли; 
							
						КонецЕсли; 
						
						Если ОбратныйПересчет Тогда
							
							Нстр.НДС = Нстр.Всего*(Ставка/(100+Ставка));
							Нстр.Сумма = Нстр.Всего - Нстр.НДС;
							Нстр.Цена = _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
							
						Иначе
							
							Нстр.Цена = _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
							Нстр.НДС = Нстр.Сумма*(Ставка/100);
							Нстр.Всего = Нстр.Сумма+Нстр.НДС;
							
						КонецЕсли; 
						
						ПересчитатьСтрокуНаСерере(Нстр.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
		
						// --- 
					КонецЕсли; 
				КонецЕсли; 
				// ---------------------------------------------------------------------------- 
				
				// устанавливаем представление
				Если СтруктураНоменклатуры.ВариантПредставления = 0 Тогда
					
					ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
					
					ПараметрыШаблона.Номенклатура 	= Нстр.Номенклатура;
					ПараметрыШаблона.Объект 		= Объект;
					ПараметрыШаблона.Дата 			= Объект.Дата;
					ПараметрыШаблона.Договор 		= Объект.Договор;
					ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
					ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
					
					CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(Нстр, ПараметрыШаблона); 
					
				Иначе
					
					Представление = СтруктураНоменклатуры.Представление;
					Если Найти(Представление,"%")  <> 0 Тогда
						
						// это шаблон
						Нстр.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(Представление,Объект,Нстр);
						
					Иначе
						
						Нстр.Представление = Представление;
						
					КонецЕсли; 
					
				КонецЕсли; 
								
				// --- 
				
			КонецЦикла; 
			// --- 
			ОбновитьИтогиПоУслугам();
			_ОбновитьСтатусПометокУдаления();
			
			
			#Область Динамический_вывод_дополнительных_колонок
			
			_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
			
			#КонецОбласти
			
		КонецЕсли; 
		
		
		// --- 
КонецПроцедуры

#КонецОбласти 

#Область УдалениеВедомых 

&НаКлиенте
Процедура ВедомыйСчет_Удалить(Команда)
	
	УдалитьВедомый("Счет");	
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомыйСчетКорректировочный_Удалить(Команда)
	
	УдалитьВедомый("СчетКорректировочный");	
	
КонецПроцедуры    


&НаКлиенте
Процедура ВедомыйАктКорректировочный_Удалить(Команда)

	УдалитьВедомый("ВедомыйДокументКорректировки");	

КонецПроцедуры

&НаКлиенте
Процедура ВедомыйСФКорректировочный_Удалить(Команда)

	УдалитьВедомый("ВедомыйСчетФактураКорректировочный");	

КонецПроцедуры


&НаКлиенте
Процедура ВедомыйДокумент_Удалить(Команда)
	
	УдалитьВедомый("Документ");	
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомыйСчетФактура_Удалить(Команда)
	
	УдалитьВедомый("СчетФактура");	
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура УдалитьВедомый(ВидВедомого)
	// --- 
	
	//Если (ЭтаФорма.Модифицированность) Тогда
	//	
	//	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаЗаписиДляУдаленияВедомых",ЭтотОбъект, Новый Структура("ВидВедомого",ВидВедомого)); 
	//	ПоказатьВопрос(ПОВ,"Документ необходимо записать. 
	//				   |Продолжить?", РежимДиалогаВопрос.ДаНет); 
	//				   
	//Иначе
	//	
	//	ВыполнитьУдалениеВедомого(ВидВедомого);
	//	
	//КонецЕсли; 
	
	ВыполнитьУдалениеВедомого(ВидВедомого);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписиДляУдаленияВедомых(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ=КодВозвратаДиалога.Да) Тогда
		
		Записать();
		ВыполнитьУдалениеВедомого(ДополнительныеПараметры.ВидВедомого)
		
	КонецЕсли;
		
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУдалениеВедомого(ВидВедомого)
	// --- 
	
	Если (ВидВедомого = "Документ") Тогда 
		
		ТекстВопроса = "Ведомый документ поступления будет отвязан и помечен на удаление. 
				   |Продолжить?";
				   
	ИначеЕсли (ВидВедомого = "СчетФактура") Тогда 
		
		ТекстВопроса = "Ведомый счёт-фактура поступления будет отвязан и помечен на удаление.
				   |Продолжить?";
				   
	ИначеЕсли (ВидВедомого = "Счет") или ВидВедомого = "СчетКорректировочный" Тогда 
		
		ТекстВопроса = "Ведомый счёт поступления будет отвязан и помечен на удаление.
				   |Продолжить?";
		
	КонецЕсли; 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУдаленияВедомых",ЭтотОбъект, Новый Структура("ВидВедомого",ВидВедомого)); 
	ПоказатьВопрос(ПОВ,ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУдаленияВедомых(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		
		ВыполнитьНепосредственноеУдалениеВедомых(ДополнительныеПараметры.ВидВедомого);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ВыполнитьНепосредственноеУдалениеВедомых(ВидВедомого)
	// --- 
	
	Если (ВидВедомого = "Счет") Тогда     
		
		Ответ = _УдалитьВедомыйСчет();
		
	ИначеЕсли (ВидВедомого = "СчетКорректировочный") Тогда 
		
		Ответ = _УдалитьВедомыйСчетКорректировочный();
	
	ИначеЕсли (ВидВедомого = "Документ") Тогда 
		
		Ответ = _УдалитьВедомый();
		
	ИначеЕсли (ВидВедомого = "СчетФактура") Тогда 
		
		Ответ = _УдалитьВедомыйСчетФактуру();
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

// --- 
&НаСервере
Функция _УдалитьВедомыйСчетКорректировочный()
	// --- 
	
	Если (НЕ Объект.ВедомыйСчетКорректировочный.ПометкаУдаления) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ведомый = Объект.ВедомыйСчетКорректировочный.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);	
	КонецЕсли; 
	// --- 
	Объект.ВедомыйСчетКорректировочный = Неопределено;
	
	// --- 
КонецФункции

&НаСервере
Функция _УдалитьВедомыйСчет()
	// --- 
	
	Если (НЕ Объект.ВедомыйСчет.ПометкаУдаления) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ведомый = Объект.ВедомыйСчет.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);	
	КонецЕсли; 
	// --- 
	Объект.ВедомыйСчет = Неопределено;
	ВедомыйДокументСчет = Неопределено;
	
	// --- 
КонецФункции

&НаСервере
Функция _УдалитьВедомый()
	// --- 
	
	Если (НЕ Объект.ВедомыйДокумент.ПометкаУдаления) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ведомый = Объект.ВедомыйДокумент.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);	
	КонецЕсли;
	// --- 
	Объект.ВедомыйДокумент = Неопределено;
	ВедомыйДокументРеализация=Неопределено;
	Объект.ВедомыйСчетФактура = Неопределено;
	ВедомыйДокументСчетФактура=Неопределено;
	
	// --- 
КонецФункции

&НаСервере
Функция _УдалитьВедомыйСчетФактуру()
	// --- 
	
	Если (НЕ Объект.ВедомыйСчетФактура.ПометкаУдаления) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ведомый = Объект.ВедомыйСчетФактура.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);	
	КонецЕсли;
	// --- 
	Объект.ВедомыйСчетФактура = Неопределено;
	ВедомыйДокументСчетФактура=Неопределено;
	
	// --- 
КонецФункции

#КонецОбласти 

#Область ОчисткаТабличнойЧасти

&НаКлиенте
Процедура ОчиститьТабличнуюЧастьУслуг(Команда)
	
	Если Объект.Услуги.Количество() <> 0 Тогда 
		
		массВидимыхСтрок = Новый Массив;
		массСкрытыхСтрок = Новый Массив;
		Для Каждого строкаУслуги Из Объект.Услуги Цикл
			Если Элементы.Услуги.ПроверитьСтроку(строкаУслуги.ПолучитьИдентификатор()) Тогда 
				массВидимыхСтрок.Добавить(строкаУслуги);
			Иначе 
				массСкрытыхСтрок.Добавить(строкаУслуги);
			КонецЕсли;
		КонецЦикла;
		
		Если массВидимыхСтрок.Количество() = Объект.Услуги.Количество() Тогда 
			
			// нет отбора
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиУслугДляОчистки",ЭтотОбъект); 
			ПоказатьВопрос(ПОВ,"Очистить табличную часть Услуги?", РежимДиалогаВопрос.ОКОтмена);
			
		Иначе 
			
			// установлен какой-то отбор
			сз = Новый СписокЗначений;
			сз.Добавить("Все", "Очистить - все строки ("+Объект.Услуги.Количество()+")");
			сз.Добавить("Видимые", "С учетом отбора - видимые ("+массВидимыхСтрок.Количество()+")");
			сз.Добавить("Скрытые", "С учетом отбора - скрытые ("+массСкрытыхСтрок.Количество()+")");
			ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВариантаОчистки",ЭтотОбъект, Новый Структура("массВидимыхСтрок,массСкрытыхСтрок",массВидимыхСтрок,массСкрытыхСтрок)); 
			СЗ.ПоказатьВыборЭлемента(ПОВ,"РежимОчистки");
			
		КонецЕсли;
		
	Иначе 
		
		_УФК.ВывестиПредупреждение("Табличная часть ""Услуги"" уже пустая.");
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОчисткиУслугДляОчистки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.ОК) Тогда
		
		Объект.Услуги.Очистить();
		ОбновитьИтогиПоУслугам();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ОбработкаВыбораВариантаОчистки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда 
		
		Если Ответ.Значение = "Все" Тогда 
			
			Объект.Услуги.Очистить();
			ОбновитьИтогиПоУслугам();
			
		ИначеЕсли Ответ.Значение = "Видимые" Тогда 
			
			Для Каждого строкаУслуги Из ДополнительныеПараметры.массВидимыхСтрок Цикл
				Объект.Услуги.Удалить(строкаУслуги);
			КонецЦикла;
			ОбновитьИтогиПоУслугам();
			_УФК.ВывестиПредупреждение("Отключите отбор, чтобы увидеть, что осталось.");
			
		ИначеЕсли Ответ.Значение = "Скрытые" Тогда 
			
			Для Каждого строкаУслуги Из ДополнительныеПараметры.массСкрытыхСтрок Цикл
				Объект.Услуги.Удалить(строкаУслуги);
			КонецЦикла;
			ОбновитьИтогиПоУслугам();
			_УФК.ВывестиПредупреждение("Невидимые строки удалены.");
			
		КонецЕсли;
		
	КонецЕсли;
			
	// --- 
КонецПроцедуры
  

#КонецОбласти 

#Область ПроверкаПоБюджету

&НаКлиенте
Процедура ПроверитьДокументПоБюджету(Команда)
	
	Если (ЭтаФорма.Модифицированность) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаЗаписиДляПроверкиПоБюджету",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Документ был изменён. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьПроверкуПоБюджету();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписиДляПроверкиПоБюджету(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ=КодВозвратаДиалога.Да) Тогда
		
		Записать();
		ВыполнитьПроверкуПоБюджету();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ВыполнитьПроверкуПоБюджету()
	// --- 
	
	ОткрытьФорму("Отчет.CW_ПроверкаДокументаРеализацииПоБюджету.Форма.ФормаОтчета",_сф.ст_Создать("Документ:Ссылка",Объект.Ссылка));
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ОтображениеШапки 

&НаКлиенте
Процедура ОтображениеШапки(Команда)
	
	_ОтображениеШапки(); 
	
КонецПроцедуры

&НаСервере
Процедура _ОтображениеШапки()
	
	Элементы.ГруппаШапка.Видимость = (НЕ Элементы.ГруппаШапка.Видимость);
	Элементы.ОтображениеШапки.Заголовок = ?(Элементы.ГруппаШапка.Видимость," Развернуть"," Свернуть"); 
	Элементы.УслугиКорректировкаОтображениеШапки.Заголовок = ?(Элементы.ГруппаШапка.Видимость," Развернуть"," Свернуть");
	Элементы.ОтображениеШапки.Картинка = ?(Элементы.ГруппаШапка.Видимость,БиблиотекаКартинок.CW_Развернуть,БиблиотекаКартинок.CW_Свернуть); 
	Элементы.УслугиКорректировкаОтображениеШапки.Картинка = ?(Элементы.ГруппаШапка.Видимость,БиблиотекаКартинок.CW_Развернуть,БиблиотекаКартинок.CW_Свернуть);
	
КонецПроцедуры

#КонецОбласти 

#Область АвтоматическийПодборСчетов 

&НаКлиенте
Процедура АвтоматическийПодборСчетов()
	
	Если (Объект.Проведен) Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОтменыПроведения",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Автоматический подбор счетов возможен только для непроведённого документа. Отменить проведение?",РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьАвтоматическийПодборСчетов();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОтменыПроведения(ОтветПользователя, ДополнительныеПараметры) Экспорт 
	
	Если (ОтветПользователя = КодВозвратаДиалога.Да) Тогда
		Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.ОтменаПроведения));
		ВыполнитьАвтоматическийПодборСчетов();
	КонецЕсли; 
	
КонецПроцедуры
  
&НаКлиенте
Процедура ВыполнитьАвтоматическийПодборСчетов()
	
	// показываем форму выбора даты подбора
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВариантаПодбора",ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДатыПодбораСчетов",,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВариантаПодбора(ВариантВыбораДатыПодбора, ДополнительныеПараметры) Экспорт 
	
	Если (ВариантВыбораДатыПодбора <> Неопределено) Тогда
		
		Результат = _ВыполнитьПодборСчетов(ВариантВыбораДатыПодбора);
		Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
			_ОбновитьНомераДокументов();
			_УправлениеЭлементамиФормы();
			ПервичныеДокументыУправлениеЭлементамиФормы();
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Результат));
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ВыполнитьПодборСчетов(ВариантПодбора)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Ответ = ДокументОбъект.АвтоматическийПодборСчетов(ВариантПодбора);
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	Возврат(Ответ);
	
КонецФункции
 
#КонецОбласти 

#Область УстановкаСальдоВзаиморасчетов 

&НаКлиенте
Процедура УстановитьСальдоВзаиморасчетовБУ(Команда)
	Объект.СальдоВзаиморасчетовБУ = Объект.Услуги.Итог("Всего");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСальдоВзаиморасчетовОУ(Команда)
	Объект.СальдоВзаиморасчетовОЗ = Объект.Услуги.Итог("Всего");
КонецПроцедуры

#КонецОбласти 

#Область ОткрытиеВедомыхДокументов 

&НаКлиенте
Процедура ВедомыйСчетОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// проверяем существование счета
	Если НЕ Объект.ВедомыйСчет.Пустая() Тогда
		
		ПоказатьЗначение(,Объект.ВедомыйСчет);
		
	Иначе
		
		_УФК.ВывестиПредупреждение("Ведомый счёт ещё не сформирован.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомыйДокументОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// проверяем существование счета
	Если НЕ Объект.ВедомыйДокумент.Пустая() Тогда
		
		ПоказатьЗначение(,Объект.ВедомыйДокумент);
		
	Иначе
		
		_УФК.ВывестиПредупреждение("Ведомый документ реализации ещё не сформирован.");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомыйСчетФактураОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// проверяем существование счета
	Если НЕ Объект.ВедомыйСчетФактура.Пустая() Тогда
		
		ПоказатьЗначение(,Объект.ВедомыйСчетФактура);
		
	Иначе
		
		_УФК.ВывестиПредупреждение("Ведомый счёт-фактура ещё не сформирован.");
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КурсВалютыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораКурса",ЭтотОбъект, Новый Структура()); 
	ПФ = Новый Структура("ПользовательскийКурс,Курс,Кратность,ДатаКурса,Валюта,РасчетыВУЕ",Объект.УЕ_ПользовательскийКурс,Объект.УЕ_Курс,Объект.УЕ_Кратность,_ДатаКурса(),Объект.Валюта, ВзаиморасчетыВУЕ);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаКурсаДляУсловныхЕдиниц",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКурса(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Объект.УЕ_ПользовательскийКурс = Ответ.ПользовательскийКурс;
		Если (Объект.УЕ_ПользовательскийКурс) Тогда
			Объект.УЕ_Курс = Ответ.Курс;
			Объект.УЕ_Кратность = Ответ.Кратность;
		Иначе
			Объект.УЕ_Курс = 1;
			Объект.УЕ_Кратность = 1;
		КонецЕсли;
		// --- 
		_СформироватьКурс();
				
	КонецЕсли; 
	
	// --- 
КонецПроцедуры



#Область Корректировки

&НаСервере
Процедура _ОбновитьНадписиКорректировок()
	// --- 
	
	Для каждого Стр Из Объект.Услуги Цикл
		
		Стр.НадписьПередКорректировкой 	= "до корректировки";
		Стр.НадписьДоКорректировки 		= "до изменения";
		Стр.НадписьПослеКорректировки 	= "после изменения";
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура УслугиКорректировкаКоличествоПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.УслугиКорректировка.ТекущаяСтрока,Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаЦенаПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.УслугиКорректировка.ТекущаяСтрока,Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаСуммаПриИзменении(Элемент)
	
	_УслугиСуммаПриИзменении(Элементы.УслугиКорректировка.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.УслугиКорректировка.ТекущаяСтрока,Объект.ЦенаСНДС);

КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаНДСПриИзменении(Элемент)
	
	ТД = Элементы.УслугиКорректировка.ТекущиеДанные;
	
	Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
		ТД.Всего = ТД.Сумма + ТД.НДС;
	Иначе
		ТД.Сумма = ТД.Всего - ТД.НДС;
		ТД.Цена 	= _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	КонецЕсли;
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаВсегоПриИзменении(Элемент)
	
	ТД = Элементы.УслугиКорректировка.ТекущиеДанные;
	
	Ставка 		= CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
	ТД.НДС 		= ТД.Всего*Ставка/(1+Ставка);
	ТД.Сумма 	= ТД.Всего - ТД.НДС;
	ТД.Цена 	= _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоКорректируемомуДокументу(Команда)
	
	_ПерезаполнитьПоКорректируемомуДокументу();
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры

&НаСервере
Процедура _ПерезаполнитьПоКорректируемомуДокументу()  
	
	Объект.Услуги.Очистить();
	
	ЗаполнитьПередКорректировкой = CW_Документы.НужноПоказатьПередКорректировкой(Объект);
	ЗаполнитьЗначенияСвойств(Объект, Объект.КорректируемыйДокумент,"Организация,Контрагент,Договор,Валюта,ФормируетсяСчетФактура");  
	
	тДокументыРасходов = Объект.КорректируемыйДокумент.Услуги.Выгрузить().Скопировать(,"ПорядокОтражения,ДокументРасходов");   
	тДокументыРасходов.Свернуть("ПорядокОтражения,ДокументРасходов",); 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПорядокОтражения", ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление"));
	
	мСтроки = тДокументыРасходов.НайтиСтроки(Отбор);
	
	мДокументыРасходов = Новый Массив;
	Для Каждого НайденнаяСтрока из мСтроки Цикл
		мДокументыРасходов.Добавить(НайденнаяСтрока.ДокументРасходов);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_РасходыПоГрузоперевозке.КорректируемыйДокумент КАК КорректируемыйДокумент,
	|	CW_РасходыПоГрузоперевозке.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.CW_РасходыПоГрузоперевозке КАК CW_РасходыПоГрузоперевозке
	|ГДЕ
	|	CW_РасходыПоГрузоперевозке.КорректируемыйДокумент В(&КорректируемыйДокумент)";
	
	Запрос.УстановитьПараметр("КорректируемыйДокумент", мДокументыРасходов); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответствиеДокументов = новый Соответствие;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеДокументов.Вставить(Выборка.КорректируемыйДокумент, Выборка.Ссылка);
	КонецЦикла;
	
	Для каждого КорректируемаяСтрока Из  Объект.КорректируемыйДокумент.Услуги Цикл 
		
		НоваяСтрока = Объект.Услуги.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, КорректируемаяСтрока); 
		
		НоваяСтрока.Представление_ДоКорректировки 	= КорректируемаяСтрока.Представление;
		НоваяСтрока.Количество_ДоКорректировки 		= КорректируемаяСтрока.Количество;
		НоваяСтрока.Цена_ДоКорректировки 			= КорректируемаяСтрока.Цена;
		НоваяСтрока.Сумма_ДоКорректировки 			= КорректируемаяСтрока.Сумма;
		НоваяСтрока.СтавкаНДС_ДоКорректировки 		= КорректируемаяСтрока.СтавкаНДС;
		НоваяСтрока.НДС_ДоКорректировки 			= КорректируемаяСтрока.НДС;
		НоваяСтрока.Всего_ДоКорректировки 			= КорректируемаяСтрока.Всего;
		
		Если КорректируемаяСтрока.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление Тогда
			ДокументКорректировкиРасходов = СоответствиеДокументов.Получить(КорректируемаяСтрока.ДокументРасходов);
			Если ДокументКорректировкиРасходов <> Неопределено Тогда
				НоваяСтрока.ДокументРасходов = ДокументКорректировкиРасходов;
			КонецЕсли; 
		КонецЕсли;     
		
		Если ЗаполнитьПередКорректировкой Тогда 
			НоваяСтрока.Представление_ПередКорректировкой 	= КорректируемаяСтрока.Представление_ДоКорректировки;
			НоваяСтрока.Количество_ПередКорректировкой 		= КорректируемаяСтрока.Количество_ДоКорректировки;
			НоваяСтрока.Цена_ПередКорректировкой 			= КорректируемаяСтрока.Цена_ДоКорректировки;
			НоваяСтрока.Сумма_ПередКорректировкой 			= КорректируемаяСтрока.Сумма_ДоКорректировки;
			НоваяСтрока.СтавкаНДС_ПередКорректировкой 		= КорректируемаяСтрока.СтавкаНДС_ДоКорректировки;
			НоваяСтрока.НДС_ПередКорректировкой 			= КорректируемаяСтрока.НДС_ДоКорректировки;
			НоваяСтрока.Всего_ПередКорректировкой 			= КорректируемаяСтрока.Всего_ДоКорректировки;
		КонецЕсли;  
		
	КонецЦикла; 
	
	Если Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") тогда
		ИсправлениеПолучитьНомерНаСервере();
	КонецЕсли;
	
	_ОбновитьНомераДокументов();

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	_УслугиПредставлениеНачалоВыбора(Элементы.УслугиКорректировка.ТекущаяСтрока);
	Элементы.УслугиКорректировка.ТекущийЭлемент = Элементы.УслугиКорректировкаПорядокОтражения;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Отработка действий при попытке выбора (изменений) реквизитов, 
	// для которых установлен признак "Только просмотр":
	Если Элементы.УслугиКорректировка.ТекущиеДанные.ЭтоДобавленнаяСтрока = Ложь Тогда
		
		// колонка "Заказ"
		Если Поле = Элементы.УслугиКорректировкаГрузоперевозкаЗаказ Тогда 
			СтандартнаяОбработка = Ложь;
			Попытка
				ПоказатьЗначение(,_Заказ(Элементы.УслугиКорректировка.ТекущиеДанные.Грузоперевозка));
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			
			// колонка "Грузоперевозка"
		ИначеЕсли (Поле = Элементы.УслугиКорректировкаГрузоперевозка) Тогда 
			СтандартнаяОбработка = Ложь;
			Попытка
				ПоказатьЗначение(,Элементы.УслугиКорректировка.ТекущиеДанные.Грузоперевозка);
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			
			// колонка "Представление документа расходов"
		ИначеЕсли (Поле = Элементы.УслугиКорректировкаДокументРасходовПредставлениеДокумента) Тогда 
			СтандартнаяОбработка = Ложь;
			Попытка
				ПоказатьЗначение(,Элементы.УслугиКорректировка.ТекущиеДанные.ДокументРасходов);
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			
		КонецЕсли; 
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПриИзменении(Элемент)
	
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры


#КонецОбласти 


#Область ОграниченияУслуг

&НаКлиенте
Процедура УслугиНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) и ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
		ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре( Элементы.Услуги.ТекущиеДанные.ПорядокОтражения);
		Элемент.РежимВыбораИзСписка  = ИспользуетсяОгранчиениеУслуг;	
		Если ИспользуетсяОгранчиениеУслуг Тогда 
			Если Элемент.СписокВыбора.Количество()> 0 Тогда
				Элемент.СписокВыбора.Очистить();
			КонецЕсли;
			
			Элемент.СписокВыбора.ЗагрузитьЗначения(_УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору));   
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) и ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
		ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре( Элементы.Услуги.ТекущиеДанные.ПорядокОтражения);
		Элемент.РежимВыбораИзСписка  = ИспользуетсяОгранчиениеУслуг;	
		Если ИспользуетсяОгранчиениеУслуг Тогда 
			Если Элемент.СписокВыбора.Количество()> 0 Тогда
				Элемент.СписокВыбора.Очистить();
			КонецЕсли;
			
			Элемент.СписокВыбора.ЗагрузитьЗначения(_УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору));   
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Добалвение_Строки_Счета

&НаКлиенте
Процедура Услуги_ДобавитьСтрокуСчета(Команда)
	
	ДополнительныеСвойства = Неопределено;
	Если ДС.Количество() > 0 Тогда
		ДополнительныеСвойства = ДС[0].Значение;
	КонецЕсли;	

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЕстьОграниченияПоСпискуУслуг"			, ЛОЖЬ);
	ПараметрыФормы.Вставить("УстанавливатьЦенуВЗависимостиОтГруза"	, УстанавливатьЦенуВЗависимостиОтГруза);
	ПараметрыФормы.Вставить("АдресУслугПоДоговору"					, АдресУслугПоДоговору);
	ПараметрыФормы.Вставить("Договор"								, Объект.Договор);
	
	//Подсистема.УчетПриложенийДоговоров	
	ПараметрыФормы.Вставить("ПриложениеКДоговору"					, Объект.ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров	
	
	ПараметрыФормы.Вставить("ДатаДокумента"							, Объект.Дата);
	ПараметрыФормы.Вставить("Валюта"								, Объект.Валюта);
	ПараметрыФормы.Вставить("Организация"							, Объект.Организация);
	ПараметрыФормы.Вставить("ДополнительныеСвойства"				, ДополнительныеСвойства);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьДобавлениеСтроки",ЭтотОбъект, Новый Структура()); 
	
	ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.Форма.ФормаДобавленияСтрокиВДокумент",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры


&НаКлиенте
Процедура ОбработатьДобавлениеСтроки(Ответ, ДопПараметры) Экспорт
	
	Если Ответ <> Неопределено Тогда
		
		ДобавиьСтрокуНаСервере(Ответ.Адрес);
		
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавиьСтрокуНаСервере(Адрес)
	
	Если ЭтоАдресВременногоХранилища(Адрес) тогда
		ДанныеСтроки = ПолучитьИзВременногоХранилища(Адрес);
		
		НоваяСтрока = Объект.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки[0]);
		
		//Дополним комментарий тегами
		ТегОткрывающий = "<%Текст шапки%/";
		ТегЗакрывающий = "/%Текст шапки%>";

		//Проверим может уже ессть тогда ничего не делаем
		
		ПозПервогоСимвола    = СтрНайти(Объект.Комментарий,ТегОткрывающий);
		
		Если ПозПервогоСимвола = 0 тогда
			//вставляем всегда в начало с строки;
			Объект.Комментарий = ТегОткрывающий + " {Введите текст дополнения шапки счета} "+ТегЗакрывающий + " "+Объект.Комментарий;
		КонецЕсли;
		
		#Область Динамический_вывод_дополнительных_колонок
	
		_УФС.ОбновитьЗначенияПараметровГрузоперевозкиПоСтроке(НоваяСтрока, ПолучитьСтруктуруПараметровДляПередачи());	
	
		#КонецОбласти
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Команда_ОбновитьКоличество(Команда)
	
	ОбновитьКоличествоНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоНаСервере()
	
	_УФС.ОбработатьтаблицуУслугНаСервере(Объект.Услуги, УстановитьЗначениеНольЗначениеПараметраНеУстановлено);
	
	Модифицированность = истина;
	
КонецПроцедуры


#КонецОбласти

#Область Настройка_динамических_колонок

&НаКлиенте
Процедура НастройкаКолонок(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаЗначений"	, ПолучитьДанныеДляПередачи());
	ПараметрыФормы.Вставить("СписокСПометками"		, Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы"		, "Дополнительные колонки");
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораСпискаПараметров", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораИзСписка",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&наСервере
Функция ПолучитьДанныеДляПередачи()
	
	Возврат ПоместитьВоВременноеХранилище(СписокДополнительныхКолонок);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораСпискаПараметров(Результат, ДопПараметры) Экспорт
 
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ОбработатьРезультатВыбораКолонок(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыбораКолонок(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		СписокКолонок = ПолучитьИзВременногоХранилища(Результат);
		
		СписокДополнительныхКолонок.Очистить();
		СписокВыбранныеКолонки.Очистить();
		
		Для Каждого ЭлементСписка из СписокКолонок Цикл
			СписокДополнительныхКолонок.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, ЭлементСписка.Пометка);
			Если ЭлементСписка.Пометка Тогда
				СписокВыбранныеКолонки.Добавить(ЭлементСписка.Значение);	
			КонецЕсли;
		КонецЦикла;
		
		_УФС.ДополнитьДинамическиеКолонки(ЭтаФорма);
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	
	КонецЕсли;
	
	УстановитьВидимостьКнопкиОбновленияЗначений();
	                                 
КонецПроцедуры

&наСервере
Функция ПолучитьСтруктуруПараметровДляПередачи()
	
	СоответствиеПараметров = Неопределено;
	Если СписокДоступныхПараметров.Количество() > 0 Тогда
		СоответствиеПараметров = СписокДоступныхПараметров[0].Значение ;
	КонецЕсли;

	СтуктураПараметров = Новый Структура;
	СтуктураПараметров.Вставить("Объект"				, Объект);
	СтуктураПараметров.Вставить("ТаблицаДокумента"		, Объект.Услуги);
	СтуктураПараметров.Вставить("ВыбранныеКолонки"		, СписокВыбранныеКолонки.ВыгрузитьЗначения());
	СтуктураПараметров.Вставить("СоответствиеПараметров", СоответствиеПараметров);
	СтуктураПараметров.Вставить("мГрузоперевозки"		, Объект.Услуги.Выгрузить().ВыгрузитьКолонку("Грузоперевозка"));
	
	Возврат СтуктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура НастройкаКолонок_ОбновитьЗначения(Команда)
	
	ОбновлитьЗначенияПараметровнаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновлитьЗначенияПараметровнаСервере()
	
	_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопкиОбновленияЗначений()
	
	Элементы.УслугиНастройкаКолонок_ОбновитьЗначения.Видимость = СписокВыбранныеКолонки.Количество() > 0;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	мВыбранныеКолонки = Новый Массив;
	
	Для Каждого ЭлементСписка из СписокДополнительныхКолонок Цикл
		Если ЭлементСписка.Пометка Тогда
			мВыбранныеКолонки.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Настройка = Новый Структура;
	Настройка.Вставить("ВыбранныеКолонки"	, мВыбранныеКолонки);
	
	ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы, "CW_ДоходыПоГрузоперевозке",Настройка);
	
КонецПроцедуры


#КонецОбласти

#Область Изменение_Состава_цены

&НаКлиенте
Процедура ЦенаСНДС(Команда)
	
	Если Объект.Услуги.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбИзмененииСоставаЦены", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Данные табличной части будут пересчитаны. Продолжить?" , Режим, 0);
		
	Иначе
		
		Объект.ЦенаСНДС = не Объект.ЦенаСНДС;
		ОбработатьИзменениеФлагаЦенаСНДС();
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеФлагаЦенаСНДС()
	
	ОбработатьИзменениеСоставаЦены();
	ПересчитатьДанныеСтрокНаСервере(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбИзмененииСоставаЦены(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	Объект.ЦенаСНДС = не Объект.ЦенаСНДС;
	ОбработатьИзменениеСоставаЦены();

	ПересчитатьДанныеСтрокНаСервере(Истина);

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСоставаЦены()
	
	ТекстЗаголовкаЦены 	= "Цена";
	ШрифтЗаголовка 		= Новый Шрифт();
	ЦенаСНДС 			= Объект.ЦенаСНДС;
	
	Если ЦенаСНДС Тогда
		ТекстЗаголовкаЦены 	= ТекстЗаголовкаЦены + " (с НДС)";
		ШрифтЗаголовка 		= Новый Шрифт(, , Истина);
	КонецЕсли;
	
	Элементы.УслугиЦена.Заголовок 		=  ТекстЗаголовкаЦены;
	Элементы.УслугиЦена.ШрифтЗаголовка 	=  ШрифтЗаголовка;
	
	Элементы.УслугиКорректировкаГруппаЦена.Заголовок 		=  ТекстЗаголовкаЦены;
	Элементы.УслугиКорректировкаГруппаЦена.ШрифтЗаголовка =  ШрифтЗаголовка;
	
	Элементы.УслугиЦенаСНДС.Пометка 				= ЦенаСНДС;
	Элементы.УслугиКорректировкаЦенаСНДС.Пометка 	= ЦенаСНДС;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДанныеСтрокНаСервере(ТолькоЦена)
	
	ЦенаСНДС = Объект.ЦенаСНДС;
	
	Для Каждого СтрокаУслуги из Объект.Услуги Цикл
		ПересчитатьСтрокуНаСерере(СтрокаУслуги.ПолучитьИдентификатор(), ЦенаСНДС, ТолькоЦена);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокуНаСерере(ИдентификаторСтроки, ЦенаСНДС, ТолькоЦена=Ложь, ПризнакКорр="", Повторить = Истина)
	
	ТекущаяСтрока = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекСтавкаНДС  = CW_Финансы.ПолучитьСтавкуНДС(ТекущаяСтрока["СтавкаНДС"+ПризнакКорр]);
	
	Если ТолькоЦена Тогда
		Если ЦенаСНДС Тогда
			ТекущаяСтрока["Цена"+ПризнакКорр] = _сф.БезопасноРазделить(ТекущаяСтрока["Всего"+ПризнакКорр],ТекущаяСтрока["Количество"+ПризнакКорр]);	
		Иначе
			ТекущаяСтрока["Цена"+ПризнакКорр] = _сф.БезопасноРазделить(ТекущаяСтрока["Сумма"+ПризнакКорр],ТекущаяСтрока["Количество"+ПризнакКорр]);	
		КонецЕсли;
	Иначе   
		
		Если ЦенаСНДС Тогда
			ТекущаяСтрока["Всего"+ПризнакКорр] 	= ТекущаяСтрока["Цена"+ПризнакКорр] * ТекущаяСтрока["Количество"+ПризнакКорр];
			ТекущаяСтрока["НДС"+ПризнакКорр] 	= ТекущаяСтрока["Всего"+ПризнакКорр] * ТекСтавкаНДС/(100 + ТекСтавкаНДС); 
			ТекущаяСтрока["Сумма"+ПризнакКорр] 	= ТекущаяСтрока["Всего"+ПризнакКорр] - ТекущаяСтрока["НДС"+ПризнакКорр];
		Иначе
			ТекущаяСтрока["Сумма"+ПризнакКорр] 	= ТекущаяСтрока["Цена"+ПризнакКорр] * ТекущаяСтрока["Количество"+ПризнакКорр];
			ТекущаяСтрока["НДС"+ПризнакКорр] 	= ТекущаяСтрока["Сумма"+ПризнакКорр] * ТекСтавкаНДС/100;
			ТекущаяСтрока["Всего"+ПризнакКорр] 	= ТекущаяСтрока["Сумма"+ПризнакКорр] + ТекущаяСтрока["НДС"+ПризнакКорр];	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область подписанты

&НаКлиенте
Процедура РуководительПриИзменении(Элемент)
	Объект.ЗаРуководителяПоПриказу = ПолучитьОснованиеПраваПодписиФизЛица(Объект.Руководитель,Объект.Организация,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ГлавныйБухгалтерПриИзменении(Элемент)
	Объект.ЗаГлавногоБухгалтераПоПриказу = ПолучитьОснованиеПраваПодписиФизЛица(Объект.ГлавныйБухгалтер,Объект.Организация,Объект.Дата);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОснованиеПраваПодписиФизЛица(ФизическоеЛицо,Организация,ДатаОтбор)
	
	Возврат Справочники.ОснованияПраваПодписи.ОснованиеПраваПодписиФизЛица(ФизическоеЛицо,Организация,ДатаОтбор);
	
КонецФункции

#КонецОбласти

//Подсистема.СтатусыДокументов
&НаКлиенте
Процедура СтатусДокументаИзменить(Команда)
	
	CW_СтатусыДокументовКлиент.ОткрытьФормуРедактированияСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДанныхСтатуса(Результат, ДополнительныеПараметры) Экспорт
	
	CW_СтатусыДокументовКлиент.ОбработатьИзменениеДанныхСтатуса(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаИстория(Команда)
	
	CW_СтатусыДокументовКлиент.ПоказатьИсториюСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.ОткрытьСтатусДокумента(ЭтаФорма,Элемент, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаАвтоПодбор(ЭтаФорма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	CW_СтатусыДокументовКлиент.ПриИзмененииСтатусаДокумента(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеИзменениеСтатусДокументаНаСервере()
	
	CW_СтатусыДокументовСервер.ПолучитьТекущийСтатусДокумента(Объект, ЭтаФорма);

КонецПроцедуры
//Подсистема.СтатусыДокументов


//Подистема.CW_ПланированиеДДС
&НаСервере
Процедура ОбновитьЗаголовокСтраницы()
	
	CW_ПланированиеДДССервер.ОбновитьЗаголовокСтраницыЗаявок(Элементы, Объект.Ссылка);
	
КонецПроцедуры
//Подистема.CW_ПланированиеДДС

//Подсистема.УчетПриложенийДоговоров
&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	_ОбработатьИзменениеДоговора();
КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти


//Первичные документы
&НаКлиенте
Процедура ПервичныеДокументыВыделитьВсе(Команда)
	
	ОбработатьСнятиеУстанокуФлажков(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыСнятьВсе(Команда)
	
	ОбработатьСнятиеУстанокуФлажков(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСнятиеУстанокуФлажков(Флаг)
	
	Если РедактированиеФинансов_Доходы_Счета Тогда
		Объект.ФормируетсяСчет 			= Флаг;
		ПриИзмененииФормируетсяСчет();
	КонецЕсли;
	
	Если РедактированиеФинансов_Доходы_Акты Тогда
		Объект.ФормируетсяАкт 			= Флаг;
		Объект.ФормируетсяСчетФактура 	= Флаг;
		
		ПриИзмененииФормируетсяАкт();
		ПриИзмененииФормируетсяСчетФактура();
	КонецЕсли;
	
	ПервичныеДокументыУправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура ФормируетсяСчетПриИзменении(Элемент)
	
	ПриИзмененииФормируетсяСчет();

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФормируетсяСчет()
	
	//Взаиморасчеты по документу
	Элементы.Команда_ВзаиморасчетыПоДокументу.Видимость  =  Объект.ФормируетсяСчет;
	Элементы.Команда_ВзаиморасчетыПоДокументу1.Видимость =  Объект.ФормируетсяСчет;
	//Взаиморасчеты по документу
	
	// не формируем счет
	Если НЕ Объект.ФормируетсяСчет Тогда
		Объект.СпособЗачетаАвансовОЗ = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать");
		
		Если Не СохранятьРеквизитыПервичныхДокументов Тогда
			Объект.ДатаСчета	= Неопределено;
			Объект.НомерСчета 	= Неопределено;
		КонецЕсли;
		// формируем акт
	Иначе
		// всегда предполагаем, что это будет по одному акту
		Объект.СписокСчетов = Ложь;
	КонецЕсли; 
	
	Если Не _СрокОплатыРучноеРедактирование Тогда
		УстановитьСрокОплатыНаСервере();             
	КонецЕсли;

	ПервичныеДокументыУправлениеЭлементамиФормы();
	
	УстановитьВидимостьКомандыЗаполнитьПоНеактированнымСчетам();
	_ОбновитьНомераДокументов();
	
КонецПроцедуры    

&НаКлиенте
Процедура ФормируетсяАктПриИзменении(Элемент)
	
	ПриИзмененииФормируетсяАкт();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФормируетсяАкт()
	
	Если Объект.ФормируетсяАкт Тогда
		СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметров.Дата 				= Объект.Дата;
		СтруктураПараметров.Договор 			= Объект.Договор;
		СтруктураПараметров.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
		
		ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "ПорядокЗачетаАвансов");
		Объект.СпособЗачетаАвансов = ПараметрыДоговора.ПорядокЗачетаАвансов;
		
	Иначе
		// если не формируем акт, то с/ф так же формироваться не будет
		Объект.СпособЗачетаАвансов = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать");
		
		Объект.ФормируетсяСчетФактура 	= Ложь;
		
		Если Не СохранятьРеквизитыПервичныхДокументов Тогда
			Объект.ДатаАкта		= Неопределено;
			Объект.НомерАкта	= Неопределено;
		КонецЕсли;
	КонецЕсли; 
	
	Если Не _СрокОплатыРучноеРедактирование Тогда
		УстановитьСрокОплатыНаСервере();             
	КонецЕсли;

	ПервичныеДокументыУправлениеЭлементамиФормы();
	
	УстановитьВидимостьКомандыЗаполнитьПоНеактированнымСчетам();
	_ОбновитьНомераДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ЭтоУниверсальныйДокументПриИзменении(Элемент)
	
	_ОбновитьНомераДокументов();

КонецПроцедуры     

&НаКлиенте
Процедура ФормируетсяСчетФактураПриИзменении(Элемент)
	
	ПриИзмененииФормируетсяСчетФактура();

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФормируетсяСчетФактура()
	
	Если Объект.ФормируетсяСчетФактура Тогда
		Если Объект.КодСпособаВыставления = 0 Тогда
			Объект.КодСпособаВыставления = 1;
		КонецЕсли;
	Иначе
		Если Не СохранятьРеквизитыПервичныхДокументов Тогда
			Объект.ДатаСчетаФактуры  = Неопределено;
			Объект.НомерСчетаФактуры = Неопределено
		КонецЕсли;
	КонецЕсли;

	УстановитьВерсиюПоставленияНДС1137();
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
	_ОбновитьНомераДокументов();

КонецПроцедуры

&НаСервере
Процедура УстановитьСрокОплатыНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;   
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ссылка"		, Объект.Ссылка);
	СтруктураПараметров.Вставить("Договор"		, Объект.Договор);
	
	//Подсистема.УчетПриложенийДоговоров
	Если ЗначениеЗаполнено(Объект.ПриложениеКДоговору) Тогда
		СтруктураПараметров.Вставить("Договор", Объект.ПриложениеКДоговору);
	КонецЕсли;
	//Подсистема.УчетПриложенийДоговоров
	
	СтруктураПараметров.Вставить("Дата"			, Объект.Дата);
	СтруктураПараметров.Вставить("ДатаСчета"	, Объект.ДатаСчета);
	СтруктураПараметров.Вставить("ЕстьСчет"		, Объект.ФормируетсяСчет);
	СтруктураПараметров.Вставить("ЕстьАкт"		, Объект.ФормируетсяАкт);
	
	ДатаОплаты = CW_Документы.РассчитатьСрокОплаты(СтруктураПараметров);
	
	СтруктураПараметровСрокаОплаты = Новый Структура;
	СтруктураПараметровСрокаОплаты.Вставить("Счет",			Объект.Ссылка);
	СтруктураПараметровСрокаОплаты.Вставить("ДатаОплаты",	ДатаОплаты);
	СтруктураПараметровСрокаОплаты.Вставить("Описание", 	"");
	
	РегистрыСведений.CW_СрокиОплатыСчетов.ЗаписатьСрокОплатыДокумента(СтруктураПараметровСрокаОплаты); 
	
	ПорядокРасчета = _ДС().ПД.УсловияОплаты.ПорядокРасчета;
	Если Не Объект.ФормируетсяСчет и Объект.ФормируетсяАкт и ПорядокРасчета = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыВозвратаАкта") Тогда
		мСвязанныеСчета = Документы.CW_ДоходыПоГрузоперевозке.ПолучитьСвязанныеСчета(Объект.Ссылка);
		Для каждого СвязанныйСчет из мСвязанныеСчета Цикл
			
			ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(СвязанныйСчет);
			Если НЕ ДанныеСрокаОплаты.РучноеРедактирование Тогда
				СтруктураПараметровСрокаОплаты = Новый Структура;
				СтруктураПараметровСрокаОплаты.Вставить("Счет",			СвязанныйСчет);
				СтруктураПараметровСрокаОплаты.Вставить("ДатаОплаты",	ДатаОплаты);
				СтруктураПараметровСрокаОплаты.Вставить("Описание", 	"");
				
				РегистрыСведений.CW_СрокиОплатыСчетов.ЗаписатьСрокОплатыДокумента(СтруктураПараметровСрокаОплаты); 
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;  
	
	ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(Объект.Ссылка);
	
	ДанныеСрокаОплаты.Свойство("ДатаОплаты",			_СрокОплаты);
	ДанныеСрокаОплаты.Свойство("Описание",				_СрокОплатыОписание);
	ДанныеСрокаОплаты.Свойство("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
	
	УстановитьОписаниеСрокаОплаты();

КонецПроцедуры

&НаСервере
Процедура УстановитьОписаниеСрокаОплаты()
	
	Текст = "<не установлен>";
	
	Если ЗначениеЗаполнено(_СрокОплаты) Тогда
		Текст = Формат(_СрокОплаты,"ДФ=dd.MM.yyyy");
		Если СокрЛП(_СрокОплатыОписание) <> "" Тогда
			Текст = Текст + " ("+СокрЛП(_СрокОплатыОписание)+")";
		КонецЕсли; 
	Иначе
		Если Не _СрокОплатыРучноеРедактирование Тогда
			Текст = "<авто>";
		КонецЕсли; 
	КонецЕсли;	
	
	СрокОплаты = Текст;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОписаниеПланОплаты()
	
	Текст = "<не задан>";

	ДанныеПланаОплаты = CW_Документы.ПолучитьПланОплаты(Объект.Ссылка);
	Если Не ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) и НЕ ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
		Текст = "<...>";
	ИначеЕсли ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) Тогда
		Текст = Формат(ДанныеПланаОплаты.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
		Текст = Текст + " ("+СокрЛП(ДанныеПланаОплаты.Примечание)+")";
	КонецЕсли; 
	
	ПланОплаты = Текст;
	
	_ОбновитьНомераДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыУстановитьСрокОплаты(Команда)
	
	УстановитьСрокОплатыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СрокОплатыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыСрокаОплаты = Новый Структура;
	ПараметрыФормыСрокаОплаты.Вставить("Документ", 				Объект.Ссылка); 
	
	ПараметрыФормыСрокаОплаты.Вставить("ДатаОплаты",			_СрокОплаты);
	ПараметрыФормыСрокаОплаты.Вставить("Описание",				_СрокОплатыОписание);
	ПараметрыФормыСрокаОплаты.Вставить("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзменениеСрокаОплаты",ЭтотОбъект); 

	ОткрытьФорму("ОбщаяФорма.CW_СрокОплаты", ПараметрыФормыСрокаОплаты,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСрокаОплаты(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	РезультатВыбора.Свойство("ДатаОплаты",   		 _СрокОплаты);
	РезультатВыбора.Свойство("Описание",  			 _СрокОплатыОписание);
	РезультатВыбора.Свойство("РучноеРедактирование", _СрокОплатыРучноеРедактирование); 
	
	Если Не РезультатВыбора.РучноеРедактирование Тогда
		УстановитьСрокОплатыНаСервере();
	Иначе
		ЗаписатьСрокОплатыДокумента();  
		УстановитьОписаниеСрокаОплаты();             
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланОплатыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "План оплаты можно установить только для записанного документа.");
	Иначе
		
		Представление = "Счёт №"+СокрЛП(Объект.НомерСчета)+" от "+Формат(Объект.ДатаСчета,"ДФ=dd.MM.yyyy")+" ("+Строка(Объект.Контрагент)+")";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияПланаОплаты",ЭтотОбъект); 
		
		ПараметрыФормыПланаОплаты = Новый Структура;
		ПараметрыФормыПланаОплаты.Вставить("Документ", Объект.Ссылка);
		ПараметрыФормыПланаОплаты.Вставить("ПредставлениеДокумента", Представление);
	
		ОткрытьФорму("ОбщаяФорма.CW_ПлановыйСрокОплаты",ПараметрыФормыПланаОплаты,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПланаОплаты(Ответ, ДополнительныеПараметры) Экспорт
	
	УстановитьОписаниеПланОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСчетовПриИзменении(Элемент)
	
	Элементы.Счет.Видимость = НЕ Объект.СписокСчетов;
	ПервичныеДокументыУправлениеЭлементамиФормы();
 	_ОбновитьНомераДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыПодборСчетов(Команда)
	
	АвтоматическийПодборСчетов();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКодовОпераций()
	
	ИспользоватьКоды2015 = Ложь;
	Если Объект.Дата >= '20150101' Тогда 
		ИспользоватьКоды2015 = Истина;
	КонецЕсли;

	ДатаЗаполнения = Объект.Дата;
	Если  Объект.ФормируетсяСчетФактура И ЗначениеЗаполнено(Объект.ДатаСчетаФактуры) Тогда
		ДатаЗаполнения = Объект.ДатаСчетаФактуры;
	КонецЕсли; 
	
	CW_БухгалтерияЭкспедитораСерверПереопределяемый.ЗаполнитьСписокКодовВидовОпераций(
		ПредопределенноеЗначение("Перечисление.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры"), 
		Элементы.КодВидаОперации.СписокВыбора,
		ДатаЗаполнения);
		
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыВремяСчета(Команда)
	
	Если не ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата счета!",,"ДатаСчета", "Объект");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НачальнаяДата",	Объект.ДатаСчета);
	ДополнительныеПараметры.Вставить("ИмяРеквизита", 	"ДатаСчета");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияВремени",ЭтотОбъект, ДополнительныеПараметры); 
	
	ПоказатьВводДаты(ОписаниеОповещения,Объект.ДатаСчета,"Время счёта",ЧастиДаты.Время);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыВремяАкта(Команда)
	
	Если не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата акта!",,"ДатаАкта", "Объект");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НачальнаяДата",	Объект.ДатаАкта);
	ДополнительныеПараметры.Вставить("ИмяРеквизита", 	"ДатаАкта");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияВремени",ЭтотОбъект, ДополнительныеПараметры); 
	
	ПоказатьВводДаты(ОписаниеОповещения,Объект.ДатаАкта,"Время акта",ЧастиДаты.Время);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияВремени(ВведенноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВведенноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСтрокой	 = Формат(Объект[ДополнительныеПараметры.ИмяРеквизита],"ДФ=yyyyMMdd");
	ВремяСтрокой = Формат(ВведенноеЗначение,"ДФ=HHmmss");

	Объект[ДополнительныеПараметры.ИмяРеквизита] = Дата(ДатаСтрокой+ВремяСтрокой);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыУстановитьНомерСчета(Команда)
	
	// для пакетной нумерации нужен номер документа
	Если (Не ЗначениеЗаполнено(Объект.Номер)) и _ИспользуетсяПакетнаяНумерация() Тогда
		ПоказатьПредупреждение(,"Для автоматического присвоения номера счета 
								|необходимо установить номер документа.");
	КонецЕсли;
	
	// присваиваем номер
	_УстановитьНомерСчета();
	_ОбновитьНомераДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыУстановитьНомерАкта(Команда)
	
	Если _ИспользуетсяПакетнаяНумерация() Тогда
		Если Объект.ФормируетсяСчет и ЗначениеЗаполнено(Объект.НомерСчета) Тогда
			
			Объект.НомерАкта = Объект.НомерСчета;	
			
			Если Объект.ДатаАкта = Дата(1,1,1) Тогда
				Объект.ДатаАкта = Объект.ДатаСчета;
			КонецЕсли;
			Если Объект.ДатаАкта = Дата(1,1,1) Тогда
				Объект.ДатаАкта = Объект.Дата;
			КонецЕсли;
		
		Иначе
			Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
				ПоказатьПредупреждение(,"Для автоматического присвоения номера акта 
							   |необходимо установить номер документа!");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// присваиваем номер
	_УстановитьНомерАкта();
	_ОбновитьНомераДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыУстановитьНомерСчетФактуры(Команда)
	
	// если для организации прописана пакетная нумерация,
	// то предполагается, что номера всех документов в 
	// пакете должны совпадать, т.е. при попытке присвоить 
	// номер с/ф предполагаем, что он должен совпадать с
	// номером акта (если он задан). Если номер акта не 
	// определен, то номеру с/ф будет присвоен номер счета.
	// Если номер счета не определен, то номер акта будет 
	// присвоен в соответствии с алгоритмом пакетной нумерации, 
	// указанным в учетной gолитике организации
	
	Если _ИспользуетсяПакетнаяНумерация() Тогда
		
		// пытаемся присвоить номер акта
		Если Объект.ФормируетсяАкт и ЗначениеЗаполнено(Объект.НомерАкта) Тогда
			Объект.НомерСчетаФактуры = Объект.НомерАкта;	
			
			Если Объект.ДатаСчетаФактуры = Дата(1,1,1) Тогда
				Объект.ДатаСчетаФактуры = Объект.ДатаАкта;
			КонецЕсли;
			Если Объект.ДатаСчетаФактуры = Дата(1,1,1) Тогда
				Объект.ДатаСчетаФактуры = Объект.Дата;
			КонецЕсли;

			Возврат;
			
		// пытаемся присвоить номер счета
		ИначеЕсли  Объект.ФормируетсяСчет и ЗначениеЗаполнено(Объект.НомерСчета) Тогда
			Объект.НомерСчетаФактуры =  Объект.НомерСчета;	
			
			Если Объект.ДатаСчетаФактуры = Дата(1,1,1) Тогда
				Объект.ДатаСчетаФактуры = Объект.ДатаСчета;
			КонецЕсли;
			
			Если Объект.ДатаСчетаФактуры = Дата(1,1,1) Тогда
				Объект.ДатаСчетаФактуры = Объект.Дата;
			КонецЕсли;
			
		// проверка на возможность присвоения пакетного номера по алгоритму
		Иначе
			Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
				ПоказатьПредупреждение(,"Для автоматического присвоения номера счет-фактуры 
							   |необходимо установить номер документа!");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// присваиваем номер	
	_УстановитьНомерСчетаФактуры();
	_ОбновитьНомераДокументов();

КонецПроцедуры

&НаСервере
Процедура ПервичныеДокументыПриСозданииНаСервере()
	
	РедактированиеФинансов_Доходы_Счета 			= CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Счета");
	РедактированиеФинансов_Доходы_Акты 				= CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Акты");
	ПравоРедактированияНомеровПервичныхДокументов 	= CW_ПраваДоступа.ПравоДоступно("РедактированиеНомеровПервичныхДокументов");
	
	Элементы.ГруппаСчет.Доступность				= РедактированиеФинансов_Доходы_Счета;
	Элементы.ГруппаАктСчетФактура.Доступность 	= РедактированиеФинансов_Доходы_Акты;
	
	Элементы.НомерСчета.Доступность 							= РедактированиеФинансов_Доходы_Счета И ПравоРедактированияНомеровПервичныхДокументов;
	Элементы.ПервичныеДокументыУстановитьНомерСчета.Видимость	= РедактированиеФинансов_Доходы_Счета И ПравоРедактированияНомеровПервичныхДокументов;
	
	Элементы.НомерАкта.Доступность 								= РедактированиеФинансов_Доходы_Акты И ПравоРедактированияНомеровПервичныхДокументов;
	Элементы.ПервичныеДокументыУстановитьНомерАкта.Видимость	= РедактированиеФинансов_Доходы_Акты И ПравоРедактированияНомеровПервичныхДокументов; 
	
	Элементы.НомерСчетаФактуры.Доступность 						= РедактированиеФинансов_Доходы_Акты И ПравоРедактированияНомеровПервичныхДокументов; 
	Элементы.ПервичныеДокументыУстановитьНомерСчетФактуры.Видимость	= РедактированиеФинансов_Доходы_Акты И ПравоРедактированияНомеровПервичныхДокументов; 
	
	УстановитьПривилегированныйРежим(Истина);
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	УстановитьПривилегированныйРежим(Ложь);
	
	СрокОплатыДоступен = 	ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы 
							Или ГруппаПользователя.РедактированиеСроковОплатыИсходящихСчетов
							Или ГруппаПользователя.ПолныеПрава;
							
	ПланОплатыДоступен = 	ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы 
							Или ГруппаПользователя.РедактированиеФинансов_Доходы_Счета
							Или ГруппаПользователя.ПолныеПрава;
							
	УстановитьОписаниеСрокаОплаты();
	УстановитьОписаниеПланОплаты();
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПервичныеДокументыУправлениеЭлементамиФормы()
	
	// счет
	Элементы.ГруппаСчет.Доступность 			= РедактированиеФинансов_Доходы_Счета;
	
	Элементы.ФормируетсяСчет.Доступность 		= РедактированиеФинансов_Доходы_Счета;
	Элементы.ГруппаРеквизитыСчета.Доступность 	= РедактированиеФинансов_Доходы_Счета и Объект.ФормируетсяСчет;
	Элементы.СпособЗачетаАвансовОЗ.Видимость 	= РедактированиеФинансов_Доходы_Счета и Объект.ФормируетсяСчет И ОперативныйУчет;
	
	Элементы.ПервичныеДокументыВремяСчета.Доступность 	= РедактированиеФинансов_Доходы_Счета и НЕ (Объект.ФормируетсяСчет 
														  И Объект.СпособЗачетаАвансовОЗ = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.Автоматически")
														  И НачалоДня(Объект.ДатаСчета) = НачалоДня(Объект.Дата));
	
	Элементы.ГруппаАктСчетФактура.Доступность	= РедактированиеФинансов_Доходы_Акты;
	
	Элементы.ГруппаАктСчетФактура.Видимость					= ВалютаРегламентированногоУчетаРубль;
	Элементы.ПервичныеДокументыКоманднаяПанель.Видимость	= ВалютаРегламентированногоУчетаРубль и НЕ Объект.Корректировка;
	
	Если ВалютаРегламентированногоУчетаРубль Тогда
		СтруктураПараметровБухУчета = Новый Структура;
		СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
		СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
		
		ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);
		
		// акт
		Элементы.ФормируетсяАкт.Доступность 			= РедактированиеФинансов_Доходы_Акты и Не Объект.Корректировка;
		Элементы.ГруппаРеквизитыАкта.Доступность 		= РедактированиеФинансов_Доходы_Акты и Объект.ФормируетсяАкт;
		Элементы.ДатаАкта.Доступность 					= РедактированиеФинансов_Доходы_Акты и Объект.ФормируетсяАкт;
		Элементы.СпособЗачетаАвансов.Видимость 			= РедактированиеФинансов_Доходы_Акты и Объект.ФормируетсяАкт И ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет И НЕ Объект.Корректировка;
		
		Элементы.ЭтоУниверсальныйДокумент.Доступность 	= РедактированиеФинансов_Доходы_Акты и Объект.ФормируетсяАкт;
		
		// счет-фактура
		Если Объект.КорректируемыйДокумент.ФормируетсяСчетФактура Тогда
			Элементы.ФормируетсяСчетФактура.Доступность = Ложь;
		Иначе
			Элементы.ФормируетсяСчетФактура.Доступность 		= РедактированиеФинансов_Доходы_Акты и Объект.ФормируетсяАкт и Не Объект.Корректировка;
		КонецЕсли;
		
		Элементы.КодВидаОперации.Видимость 					= РедактированиеФинансов_Доходы_Акты и Объект.ФормируетсяСчетФактура;
		Элементы.КодВидаОперации.Доступность 				= РедактированиеФинансов_Доходы_Акты ;
		
		Элементы.ГруппаРеквизитыСчетФактуры.Доступность	= РедактированиеФинансов_Доходы_Акты и Объект.ФормируетсяСчетФактура И Объект.ФормируетсяАкт;
		
		Элементы.ИдентификаторГосКонтракта.Видимость	= РедактированиеФинансов_Доходы_Акты и CW_БухгалтерияЭкспедитораСерверПереопределяемый.ВедетсяУчетНДСПоФЗ56(Объект.Дата);
		Элементы.ГруппаДопРеквизитыСчф.Видимость 		= РедактированиеФинансов_Доходы_Акты и Объект.ФормируетсяСчетФактура;
		
		Элементы.ПервичныеДокументыВремяАкта.Доступность	= РедактированиеФинансов_Доходы_Акты и НЕ (Объект.ФормируетсяАкт 
															  И Объект.СпособЗачетаАвансов = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.Автоматически") 
															  И НачалоДня(Объект.ДатаАкта)=НачалоДня(Объект.Дата));
				
		Элементы.ГруппаАктирование.Видимость 	=  НЕ Объект.ФормируетсяСчет;
		Элементы.ГруппаАктирование.Доступность 	=  РедактированиеФинансов_Доходы_Акты;   
		
		//AFR23-3305
		Элементы.ПервичныеДокументыПодборСчетов.Видимость = Не Объект.Корректировка;
		//AFR23-3305
		
	КонецЕсли;
	
	Элементы.Счет.Видимость = НЕ Объект.СписокСчетов;
	Элементы.Счет.Доступность 	=  РедактированиеФинансов_Доходы_Акты;  
	
	// срок оплаты 
	Элементы.СрокОплаты.Доступность	= РедактированиеФинансов_Доходы_Счета и Объект.ФормируетсяСчет И СрокОплатыДоступен; 	
	Элементы.СрокОплаты.Видимость	= РедактированиеФинансов_Доходы_Счета и Объект.ФормируетсяСчет И СрокОплатыДоступен; 
	
	Элементы.ПервичныеДокументыУстановитьСрокОплаты.Доступность	= РедактированиеФинансов_Доходы_Счета и Объект.ФормируетсяСчет И СрокОплатыДоступен; 
	Элементы.ПервичныеДокументыУстановитьСрокОплаты.Видимость 	= РедактированиеФинансов_Доходы_Счета и НЕ Объект.Ссылка.Пустая(); 
	
	// план оплаты
	Элементы.ПланОплаты.Видимость = РедактированиеФинансов_Доходы_Счета и Объект.ФормируетсяСчет И НЕ Объект.Ссылка.Пустая() И ОперативныйУчет И ПланОплатыДоступен;
	
	Элементы.УслугиГруппаСчет.Видимость = Объект.СписокСчетов; 
	
	//AFR23-3305
	Элементы.УслугиКорректировкаГруппаСчет.Видимость = Объект.СписокСчетов и Объект.Корректировка; 
	//AFR23-3305
	
	//Исправления
	Элементы.НомерИсправления.Доступность = РедактированиеФинансов_Доходы_Акты И Объект.ФормируетсяСчетФактура;
	//Исправления
	
	Если ВерсияПостановленияНДС1137 >=5 Тогда
		Элементы.НадписьДокументыОбОтгрузке.Видимость  = Объект.ФормируетсяСчетФактура и Не Объект.Корректировка;
		
		Если Объект.ОтредактированыДокументыОтгрузки Тогда
			Если Объект.ДатаСчетаФактуры >= Дата(2024,10,1) Тогда
				ШаблонСтрокиДокументовОбОтгрузке = НСтр("ru = '№ %1 от %2 г.'");
				НадписьДокументыОбОтгрузке = "";
				Для Каждого СтрокаДокументаОбОтгрузке Из Объект.ДокументыОбОтгрузке Цикл
					Если ЗначениеЗаполнено(НадписьДокументыОбОтгрузке) Тогда
						НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке + "; ";
					КонецЕсли;
					ТекущийДокументОбОтгрузке =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиДокументовОбОтгрузке,
					СтрокаДокументаОбОтгрузке.НомерДокумента,
					Формат(СтрокаДокументаОбОтгрузке.ДатаДокумента,"ДЛФ=Д"));
					НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке + ТекущийДокументОбОтгрузке;
				КонецЦикла;
				Если Не ЗначениеЗаполнено(НадписьДокументыОбОтгрузке) Тогда
					НадписьДокументыОбОтгрузке = НСтр("ru = '№  от  '");
				Иначе
					НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке;
				КонецЕсли;
			Иначе
				ШаблонСтрокиДокументовОбОтгрузке = НСтр("ru = '№ п/п %1 № %2 от %3 г.'");
				НадписьДокументыОбОтгрузке = "";
				Для Каждого СтрокаДокументаОбОтгрузке Из Объект.ДокументыОбОтгрузке Цикл
					Если ЗначениеЗаполнено(НадписьДокументыОбОтгрузке) Тогда
						НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке + "; ";
					КонецЕсли;
					ТекущийДокументОбОтгрузке =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиДокументовОбОтгрузке,
					СтрокаДокументаОбОтгрузке.НомераСтрок,
					СтрокаДокументаОбОтгрузке.НомерДокумента,
					Формат(СтрокаДокументаОбОтгрузке.ДатаДокумента,"ДЛФ=Д"));
					НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке + ТекущийДокументОбОтгрузке;
				КонецЦикла;
				Если Не ЗначениеЗаполнено(НадписьДокументыОбОтгрузке) Тогда
					НадписьДокументыОбОтгрузке = НСтр("ru = '№ п/п  №  от  '");
				Иначе
					НадписьДокументыОбОтгрузке = НадписьДокументыОбОтгрузке;
				КонецЕсли;
			КонецЕсли;  
		Иначе
			НадписьДокументыОбОтгрузке = НСтр("ru = '<Авто>'");
		КонецЕсли;
	Иначе
		Элементы.НадписьДокументыОбОтгрузке.Видимость  = Ложь;
	КонецЕсли;
	
  	//Подсистема.ЭДО
	УстановитьВидимостьКомандЭДО();
	//Подсистема.ЭДО

КонецПроцедуры


&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	ИзменениеНомераСчетаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаОчистка(Элемент, СтандартнаяОбработка)
	ИзменениеНомераСчетаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеНомераСчетаНаКлиенте()
	
	// если очистили номер документа, то очистим дату счета
	Если Не ЗначениеЗаполнено(Объект.НомерСчета) Тогда
		Объект.ДатаСчета = Дата(1,1,1);
	Иначе // значение номера не пустое
		// дата счета по умолчанию ставим дате документа
		Если Объект.ДатаСчета = Дата(1,1,1) Тогда
			Объект.ДатаСчета = Объект.Дата;
		КонецЕсли;
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерАктаПриИзменении(Элемент)
	ИзменениеНомераАктаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НомерАктаОчистка(Элемент, СтандартнаяОбработка)
	ИзменениеНомераАктаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеНомераАктаНаКлиенте()
	
	// значение номера пустое	
	Если Не ЗначениеЗаполнено(Объект.НомерАкта) Тогда
		Объект.ДатаАкта = Дата(1,1,1);
	Иначе  // значение номера не пустое
		
		// Если заполнили номер документа, а дата пустая, 
		// то установим ее равной дате документа
		// значение номера не пустое
		Если Объект.ДатаАкта = Дата(1,1,1) Тогда
			Объект.ДатаАкта = Объект.Дата;			
		КонецЕсли;
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();

КонецПроцедуры


&НаКлиенте
Процедура НомерСчетаФактурыПриИзменении(Элемент)
	ИзменениеНомераСчетаФактурыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаФактурыОчистка(Элемент, СтандартнаяОбработка)
	ИзменениеНомераСчетаФактурыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеНомераСчетаФактурыНаКлиенте()
	
	// если очистили номер документа, то очистим дату с/ф, 
	// т.к. в этом случае дата с/ф будет принудительно сформирована на основании даты акта
	Если Не ЗначениеЗаполнено(Объект.НомерСчетаФактуры) Тогда
		Объект.ДатаСчетаФактуры = Дата(1,1,1);
	Иначе 	// номер заполнили 
		
		// дата с/ф должна совпадать с датой акта или датой документа (в случае отсутствия акта)
		Если Объект.ДатаСчетаФактуры = Дата(1,1,1) Тогда
			Если Объект.ДатаАкта = Дата(1,1,1) Тогда
				Объект.ДатаСчетаФактуры = Объект.Дата;
			Иначе
				Объект.ДатаСчетаФактуры = Объект.ДатаАкта;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаСчетаПриИзменении(Элемент)
	
	ИзменениеДатыСчетаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСчетаОчистка(Элемент, СтандартнаяОбработка)
	ИзменениеДатыСчетаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДатыСчетаНаКлиенте()
	
	// если очистили дату с/ф, то принудительно очистим номер документа
	Если Объект.ДатаСчета = Дата(1,1,1) Тогда
		Объект.НомерСчета = "";
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура ДатаАктаПриИзменении(Элемент)
	ИзменениеДатыАктаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктаОчистка(Элемент, СтандартнаяОбработка)
	ИзменениеДатыАктаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДатыАктаНаКлиенте()
	
	// если очистили дату акта, то принудительно очистим номер документа,
	Если Объект.ДатаАкта = Дата(1,1,1) Тогда
		Объект.НомерАкта = "";
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСчетаФактурыПриИзменении(Элемент)
	 ИзменениеДатыСчетаФактурыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДатаСчетаФактурыОчистка(Элемент, СтандартнаяОбработка)
	 ИзменениеДатыСчетаФактурыНаКлиенте();
КонецПроцедуры


&НаКлиенте
Процедура ИзменениеДатыСчетаФактурыНаКлиенте()
	
	// если очистили дату с/ф, то принудительно очистим номер документа
	Если Объект.ДатаСчетаФактуры = Дата(1,1,1) Тогда
		Объект.НомерСчетаФактуры = "";
		Возврат;
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	УстановитьВерсиюПоставленияНДС1137();

	// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений;
	Список.Добавить("список","Выбор из списка");
	
	// если ведется оперативный учет задолженности
	Если ОперативныйУчет И НЕ ВводОстатковОЗ Тогда
		Список.Добавить("подбор","Подбор неактированных");
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура("Элемент", Элемент);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПакетДокументовОбработатьВыборВариантаПодбораСчета",ЭтотОбъект, ДополнительныеПараметры); 
	Если Список.Количество() = 1 Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Список[0]);
	Иначе
		ПоказатьВыборИзМеню(ОписаниеОповещения, Список, Элемент);
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПакетДокументовОбработатьВыборВариантаПодбораСчета(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыбора.Значение = "подбор" Тогда
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация", 		Объект.Организация);
		СтруктураОтбора.Вставить("Контрагент", 			Объект.Контрагент);
		СтруктураОтбора.Вставить("Договор", 			Объект.Договор);
		СтруктураОтбора.Вставить("Валюта", 				Объект.Валюта);
		СтруктураОтбора.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
		
		ПараметрыФормыПодбора = Новый Структура;
		ПараметрыФормыПодбора.Вставить("Дата",		Объект.Дата);
		ПараметрыФормыПодбора.Вставить("Документ",	Объект.Ссылка);
		ПараметрыФормыПодбора.Вставить("Отбор",		СтруктураОтбора);
		
		ОткрытьФорму("ОбщаяФорма.CW_ПодборНеактированныхСчетов",ПараметрыФормыПодбора,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли РезультатВыбора.Значение = "список" Тогда 
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Контрагент", 				Объект.Контрагент);
		СтруктураОтбора.Вставить("Договор", 				Объект.Договор);
		СтруктураОтбора.Вставить("ПриложениеКДоговору", 	Объект.ПриложениеКДоговору);;
		СтруктураОтбора.Вставить("ФормируетсяСчет", 		Истина);
		СтруктураОтбора.Вставить("ФормируетсяАкт", 			Ложь);
		СтруктураОтбора.Вставить("ФормируетсяСчетФактура", Ложь);
	
		// во всех остальных случаях
		ПараметрыФормыПодбора = Новый Структура;
		ПараметрыФормыПодбора.Вставить("РежимВыбора",	Истина);
		ПараметрыФормыПодбора.Вставить("Отбор",		СтруктураОтбора);
		
		ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.ФормаВыбора",ПараметрыФормыПодбора,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	_ОбновитьНомераДокументов();

КонецПроцедуры
//Первичные документы
	
//Исправления
&НаКлиенте
Процедура ВидОперацииКорректировкиПриИзменении(Элемент)
	
	ВидОперацииКорректировкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВидОперацииКорректировкиПриИзмененииНаСервере() 
	
	Если Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") Тогда
		Объект.НомерИсправления = 0;
	Иначе
		ИсправлениеПолучитьНомерНаСервере();
	КонецЕсли;   
	
	_ОбновитьНомераДокументов();
	УстановитьВидимостьЭлементовИсправления();
	
КонецПроцедуры  

&НаСервере
Процедура ИсправлениеПолучитьНомерНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_ДоходыПоГрузоперевозке.Ссылка) КАК Ссылка
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозке.КорректируемыйДокумент = &КорректируемыйДокумент
	               |	И CW_ДоходыПоГрузоперевозке.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("КорректируемыйДокумент", Объект.КорректируемыйДокумент);
	Запрос.УстановитьПараметр("Ссылка",	Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ВсегоИсправлений = 0;
	Если Выборка.Следующий() Тогда
		ВсегоИсправлений = Выборка.Ссылка;
	КонецЕсли;
	
	ВсегоИсправлений = ВсегоИсправлений + 1;
	
	Объект.НомерСчетаФактуры = Объект.КорректируемыйДокумент.НомерСчетаФактуры; 
	Объект.ДатаСчетаФактуры  = ТекущаяДата(); 
	
	Объект.НомерИсправления  = ВсегоИсправлений; 
	
	_ОбновитьНомераДокументов();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовИсправления()
	
	Элементы.ГруппаОперацияИсправления.Видимость  	= Объект.Корректировка;
	Элементы.НомерИсправления.Видимость 			= Объект.Корректировка и Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки");

	ПоказатьПередКорректировкой = НужноПоказатьПередКорректировкой();
	
	Элементы.УслугиКорректировкаНадписьПередКорректировкой.Видимость				= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаПредставление_ПередКорректировкой.Видимость			= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаКоличество_ПередКорректировкой.Видимость			= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаЦена_ПередКорректировкой.Видимость 					= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаСумма_ПередКорректировкой.Видимость 				= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаСтавкаНДС_ПередКорректировкой.Видимость 			= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаНДС_ПередКорректировкой.Видимость 					= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаВсего_ПередКорректировкой.Видимость 				= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаРеестрыНДС0Приложение_ПередКорректировкой.Видимость = ПоказатьПередКорректировкой;
	
КонецПроцедуры 

&НаСервере
Функция НужноПоказатьПередКорректировкой() 
	
	Возврат CW_Документы.НужноПоказатьПередКорректировкой(Объект)
	
КонецФункции


&НаКлиенте
Процедура НомерИсправленияПриИзменении(Элемент)
	_ОбновитьНомераДокументов();
КонецПроцедуры
//Исправления

//Подсистема.УчетНЗП
Процедура УстановитьОтборДинамическогоСпискаРасходы()
	
	СписокСписаниеЗатарт.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = СписокСписаниеЗатарт.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ДокументОснование");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка);
	ЭлементОтбора.Использование 	= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСписаниеЗатартПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Необходимо записать документ.");
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", 			Объект.Организация);
	ЗначенияЗаполнения.Вставить("ДокументОснование",	Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("Дата",					Объект.Дата);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.CW_СписаниеЗатратНаРеализацию.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

//Подсистема.УчетНЗП

&НаКлиенте
Процедура НадписьДокументыОбОтгрузкеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресТаблицДокумента",             ПоместитьТаблицыДокументаВХранилище());
	СтруктураПараметров.Вставить("ВключитьВозможностьРедактировать", Объект.ОтредактированыДокументыОтгрузки);
	
	ОткрытьФорму("ОбщаяФорма.CW_ДокументыОбОтгрузкеСчетаФактуры", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицыДокументаВХранилище()
	
	ТаблицыДокумента = Новый Структура;
	ТаблицыДокумента.Вставить("ТаблицаДокументовОбОтгрузке", Объект.ДокументыОбОтгрузке.Выгрузить());
	
	мОснования = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);		                                                            
	ТаблицыДокумента.Вставить("ТаблицаДокументовОснований",  мОснования);
	
	АдресТаблицДокумента = ПоместитьВоВременноеХранилище(ТаблицыДокумента, УникальныйИдентификатор);
	
	Возврат АдресТаблицДокумента;
	
КонецФункции

&НаКлиенте
Процедура УслугиПередУдалением(Элемент, Отказ)
	
	Если ЗапрашиватьПодтверждениеПриУдаленииСтрок Тогда
		Отказ = Истина;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("мИдентифкаторы", Элементы.Услуги.ВыделенныеСтроки);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУдаленииСтроки", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, "Удалить выделенные строки?", Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУдаленииСтроки(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ПродолжитьУдалениеНаСервере(ДополнительныеПараметры.мИдентифкаторы);
	
КонецПроцедуры

&наСервере
Процедура ПродолжитьУдалениеНаСервере(мИдентифкаторы)
	
	Для Каждого ИдентификаторСтроки из мИдентифкаторы Цикл
		УдаляемаяСтрока = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		Объект.Услуги.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиГрузоперевозкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если _ГрузоперевозкаЗакрыта(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, "Грузоперевозка блокирована для использования в документах!");
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ГрузоперевозкаЗакрыта(ГП)
	
	ДатаЗакрытия = CW_Мониторинг.ПолучитьДатуЗакрытия(ГП);
	Возврат ДатаЗакрытия <> Дата(1,1,1); 
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.CW_ДокументыОбОтгрузкеСчетаФактуры" Тогда
		Модифицированность	= Истина;
		ОбработкаВыбораДокументовОбОтгрузкеНаСервере(ВыбранноеЗначение);
	Иначеесли  ИсточникВыбора.ИмяФормы = "Справочник.CW_Грузоперевозки.Форма.ФормаСписка" Тогда
		ДобавитьСтрокуНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораДокументовОбОтгрузкеНаСервере(ВыбранноеЗначение)
	
	Объект.ДокументыОбОтгрузке.Очистить();
	Объект.ОтредактированыДокументыОтгрузки = ВыбранноеЗначение.ОтредактированыДокументыОтгрузки;
	
	Если Объект.ОтредактированыДокументыОтгрузки Тогда
		ТаблицаДокументовОбОтгрузке = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТаблицыОтгрузочныхДокументов);
		Объект.ДокументыОбОтгрузке.Загрузить(ТаблицаДокументовОбОтгрузке);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПодбор(Команда)
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", 			Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", 	Ложь);
	
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуНаСервере(ВыбранноеЗначение)
	
	НоваяСтрока = Объект.Услуги.Добавить();
	НоваяСтрока.Грузоперевозка = ВыбранноеЗначение;
	
КонецПроцедуры


//Подсистема.РаботаСПодключаемымиОбъектами
&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры
//Подсистема.РаботаСПодключаемымиОбъектами


//ГрупповоеКопирование
&НаКлиенте
Процедура ГрупповоеКопирование(Команда)
	ВыделенныеСтроки = Элементы.Услуги.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Тогда
		ПоказатьПредупреждение(, "Не выбранони одной строки для копирования",60);
		Возврат;
	КонецЕсли;
	
	ГрупповоеКопированиеНаСервере(ВыделенныеСтроки);
КонецПроцедуры  

&НаСервере
Процедура ГрупповоеКопированиеНаСервере(ВыделенныеСтроки)
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		
		СтрокаУслуги = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		НоваяСтрока = Объект.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуги);
		
	КонецЦикла;
	
КонецПроцедуры
//ГрупповоеКопирование 


//Подсистема.CW_БухгалтерияЭкспедитораДляРоссии
&НаКлиенте
Процедура СчетаФактурыНалоговогоАгента(Команда)                                
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ВедущийДокумент", Объект.Ссылка); 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("РегистрСведений.CW_СчетаФактурыНалоговыхАгентов.ФормаСписка", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры
//Подсистема.CW_БухгалтерияЭкспедитораДляРоссии


//Взаиморасчеты по документу
&НаКлиенте
Процедура Команда_ВзаиморасчетыПоДокументу(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда   
		Возврат;
	КонецЕсли;   
	
	ВариантАналитикиКорректировки = ПолучитьЗначениеУчетнойПолитики();
	
	ДокументОтчета = ПолучитьДокументОтчета(Объект.Ссылка, ВариантАналитикиКорректировки);
	Если ДокументОтчета = Неопределено Тогда
		Возврат;
	КонецЕсли;

	CW_ВзаиморасчетыПоДокументуКлиент.ОткрытьФормуОтчетаВзаиморасчетыПоДокументу(ЭтаФорма, ДокументОтчета, "ДЕБИТОРСКАЯ");
	
КонецПроцедуры


&НаСервере
Функция ПолучитьДокументОтчета(ОбъектСсылка, ВариантАналитикиКорректировки) 
	
	Если Не ОбъектСсылка.Корректировка Тогда
		Возврат ОбъектСсылка;
	КонецЕсли;     
	
	Если ВариантАналитикиКорректировки = 1 Тогда
		Возврат ОбъектСсылка;
	КонецЕсли;                           
	                                       
	Если Объект.КорректируемыйДокумент.Корректировка Тогда
		Возврат ПолучитьДокументОтчета(Объект.КорректируемыйДокумент, ВариантАналитикиКорректировки); 
	КонецЕсли;
	
	Возврат  Объект.КорректируемыйДокумент;
	
КонецФункции  

&НаСервере
Функция ПолучитьЗначениеУчетнойПолитики() 
	
	//корректируемый документ(0), документ корректировки(1)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УчетнаяПолитикаСрезПоследних.АналитикаКорректировкиОперативнойЗадолженности КАК АналитикаКорректировки
	               |ИЗ
	               |	РегистрСведений.CW_УчетнаяПолитика.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК CW_УчетнаяПолитикаСрезПоследних"; 
	
	Запрос.УстановитьПараметр("ДатаСреза", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.АналитикаКорректировки;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
//Взаиморасчеты по документу  


//Подсчистема.CW_РеестрыНДС0
&НаКлиенте
Процедура РеестрНДС0Закрыть(Команда)   
	
	Элементы.ГруппаРеестрНДС0.Видимость = Ложь; 
    УстановитьПараметрСеансаРеестрыНДС0(Ложь);
	
КонецПроцедуры      

 &НаСервере
Процедура УстановитьПараметрСеансаРеестрыНДС0(Значение)
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда 
		Модуль_CW_РеестрыНДС0Сервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_РеестрыНДС0Сервер");
		Модуль_CW_РеестрыНДС0Сервер.УстановитьПараметрСеансаРеестрыНДС0(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРекламныйБаннерВДокументе()
	
	ПоказатьРекламныйБаннерВДокументеНаСервере();
	
КонецПроцедуры  

 &НаСервере
Процедура ПоказатьРекламныйБаннерВДокументеНаСервере()

	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда 
		Модуль_CW_РеестрыНДС0Сервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_РеестрыНДС0Сервер");
		Элементы.ГруппаРеестрНДС0.Видимость = Модуль_CW_РеестрыНДС0Сервер.ПоказатьРекламныйБаннерВДокументе(ЭтотОбъект); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрНДС0Подробно(Команда)
	
	ПерейтиПоНавигационнойСсылке("https://www.coralway.ru/products/688");
	
КонецПроцедуры
//Подсчистема.CW_РеестрыНДС0

//Подсистема.CW_ЭлектронныйОбменДанными
&НаКлиенте
Процедура ПроверитьКонтрагентаПоБазеЛКК() 
	
	ИННКонтрагента = ПолучитьИННКонтрагента(Объект.Контрагент);  
	
	CW_ЭлектронныйОбменДаннымиКлиент.ПроверитьКонтрагентаПоБазеЛКК(ЭтаФорма, ИННКонтрагента);
	
КонецПроцедуры   

&НаКлиенте
Процедура ГипрессылкаПодробнееНажатие(Элемент)    
	
	CW_ЭлектронныйОбменДаннымиКлиент.ОбработатьСсылкуПодробнее();  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменДокументамиЗакрыть(Команда)
	
	CW_ЭлектронныйОбменДаннымиКлиент.СкрытьГруппуОбменДокументами(ЭтаФорма);  
	
КонецПроцедуры
//--Подсистема.CW_ЭлектронныйОбменДанными

//Подсистема.Бюджетирование 
&НаКлиенте
Процедура УслугиСтатьяБюджетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;   
	
	ТекущаяСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ПараметрыФормыВыбора = ПолучитьПараметрыФормыВыбора(ТекущаяСтрока);
		
    ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаВыбора", ПараметрыФормыВыбора, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаСтатьяБюджетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	
	ТекущаяСтрока = Элементы.УслугиКорректировка.ТекущаяСтрока;
	
	ПараметрыФормыВыбора = ПолучитьПараметрыФормыВыбора(ТекущаяСтрока);
		
    ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаВыбора", ПараметрыФормыВыбора, Элемент); 

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыВыбора(ТекущаяСтрока)
	
	НастройкиОтбора = CW_Бюджетирование.ПолучитьЗначенияПараметровОтбора("CW_ПараметрыОтбораДоходов");   
	
	СтрокаТекущая 	= Объект.Услуги.НайтиПоИдентификатору(ТекущаяСтрока);   

	ФиксированныеНастройкиОтбора = новый Структура;		
	ФиксированныеНастройкиОтбора.Вставить("Владелец", 				СтрокаТекущая.Грузоперевозка);	
	ФиксированныеНастройкиОтбора.Вставить("ВидСтатьиПланирования", 	ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"));

	ПользовательскиеНастройкиОтбора = Новый Структура; 
	
	ВерсияБюджета = Константы.CW_ВерсияСтатьиБюджетаДляОтбора.Получить();
	ПользовательскиеНастройкиОтбора.Вставить("ВерсияБюджета", ВерсияБюджета);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	Для Каждого КлючЗначение из НастройкиОтбора Цикл  
		Если Не КлючЗначение.Значение Тогда
			Продолжить;
		КонецЕсли;   
		
		ЗначениеОтбора = Неопределено;  
		РеквизитОбъекта = ?(КлючЗначение.Ключ = "СуммаВсего","Всего",КлючЗначение.Ключ);
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта(РеквизитОбъекта, МетаданныеОбъекта) Тогда
			ПользовательскиеНастройкиОтбора.Вставить(КлючЗначение.Ключ, Объект[РеквизитОбъекта]);
		КонецЕсли; 
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТекущая, РеквизитОбъекта) Тогда
			ПользовательскиеНастройкиОтбора.Вставить(КлючЗначение.Ключ, СтрокаТекущая[РеквизитОбъекта]);
		КонецЕсли;   
	КонецЦикла; 
	
	Если НастройкиОтбора["СтатьяИспользуетсяОднократно"] Тогда
		ПользовательскиеНастройкиОтбора.Вставить("ИспользуетсяВДокументах", Ложь);
	КонецЕсли;
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("ДокументДоходов",		Объект.Ссылка);
	ПараметрыФормыВыбора.Вставить("Владелец",				СтрокаТекущая.Грузоперевозка);
	ПараметрыФормыВыбора.Вставить("ВидСтатьиПланироваия",	ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"));
	ПараметрыФормыВыбора.Вставить("ФиксированныеНастройкиОтбора", 		ФиксированныеНастройкиОтбора);
	ПараметрыФормыВыбора.Вставить("ПользовательскиеНастройкиОтбора", 	ПользовательскиеНастройкиОтбора); 
	
	Возврат ПараметрыФормыВыбора;	
	
КонецФункции


&НаКлиенте
Процедура БюджетЗаполнитьСтатьи(Команда)

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПолученияСтатейБюджета", ЭтотОбъект); 
	
	CW_БюджетированиеКлиент.ЗаполнитьСтатьиБюджета(ЭтаФорма, ОповещениеОЗавершении);
	
КонецПроцедуры  

&НаКлиенте 
Процедура ПослеПолученияСтатейБюджета(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		ПослеПолученияСтатейБюджетаНаСервере(РезультатВыполнения.АдресРезультата);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка при подборе статей бюджета");  
		
	КонецЕсли;  
	
КонецПроцедуры  

&НаСервере
Процедура ПослеПолученияСтатейБюджетаНаСервере(АдресРезультата) 
	
	ТаблцицаСтатейБюджета = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(ТаблцицаСтатейБюджета) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	тИдентификаторы = ТаблцицаСтатейБюджета.Скопировать(); 
	тИдентификаторы.Свернуть("ИдентификаторСтроки",);
	мИдентификаторы = тИдентификаторы.ВыгрузитьКолонку("ИдентификаторСтроки");
	
	//переносим в документ
	Для Каждого ИдентификаторСтроки из мИдентификаторы Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
		
		НайденныеСтроки = ТаблцицаСтатейБюджета.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 1 Тогда
			СтрокаУслуги = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
			СтрокаУслуги.СтатьяБюджета = НайденныеСтроки[0].СтатьяБюджета;
		Конецесли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура БюджетЗаполнитьСтатьиСОтбором(Команда)
	
	ПараметрыПодбора = ПолучитьПараметрыПодбораСтатейБюджета(Элементы.Услуги.ВыделенныеСтроки); 
	Если ПараметрыПодбора = Неопределено Тогда
		ПоказатьПредупреждение(,"Для выделенных строк уже указаны статьи бюджета!"); 
		Возврат;
	КонецЕсли; 
	
	CW_ЗаполнениеДокументовКлиент.ПередНачаломЗаполненияДокумента(ПараметрыПодбора);
	
КонецПроцедуры   

&НаКлиенте
Функция ПолучитьПараметрыПодбораСтатейБюджета(Знач ВыделенныеСтроки)
	
	СписокГрузоперевозок = Новый СписокЗначений;
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);   
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Грузоперевозка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СписокГрузоперевозок.НайтиПоЗначению(СтрокаТаблицы.Грузоперевозка) = Неопределено Тогда
			СписокГрузоперевозок.Добавить(СтрокаТаблицы.Грузоперевозка);
		КонецЕсли;
	КонецЦикла;  
	
	Если СписокГрузоперевозок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяТабличнойЧасти = "Услуги";
	
	ДополлнительныеПараметры = Новый Структура;
	ДополлнительныеПараметры.Вставить("ИмяТабличнойЧасти", 	ИмяТабличнойЧасти);
	ДополлнительныеПараметры.Вставить("ВыделенныеСтроки",	ВыделенныеСтроки);
	
  	Оповещение 	= Новый ОписаниеОповещения("ЗаполнитьПодобранныеСтатьиБюджета", ЭтотОбъект, ДополлнительныеПараметры);
	
	ПараметрыЗаполнения = CW_ЗаполнениеДокументовКлиент.НоваяСтруктураПараметровЗаполнения(); 
	
	ПараметрыЗаполнения.Отбор.Вставить("Организация", 	Объект.Организация);
	ПараметрыЗаполнения.Отбор.Вставить("ВидСтатьи", 	ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"));
	ПараметрыЗаполнения.Отбор.Вставить("Владелец", 		СписокГрузоперевозок);

	ПараметрыЗаполнения.ПустаяСсылка 			= ПредопределенноеЗначение("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ПустаяСсылка");
	ПараметрыЗаполнения.Форма 					= ЭтаФорма;
	ПараметрыЗаполнения.ИмяТабличнойЧасти 		= ИмяТабличнойЧасти;
	ПараметрыЗаполнения.ИмяМакета 				= "СхемаПодбораСтатейБюджета";
	ПараметрыЗаполнения.Оповещение 				= Оповещение; 
	ПараметрыЗаполнения.ОчищатьТабличнуюЧасть	= ложь; 
	
	Возврат ПараметрыЗаполнения;  
	
КонецФункции     

&НаКлиенте
Процедура ЗаполнитьПодобранныеСтатьиБюджета(Результат, ДополлнительныеПараметры) Экспорт
	
	Если Результат = Неопределено 
		или Не ЭтоАдресВременногоХранилища(Результат) Тогда
		Модифицированность = Ложь;
		Возврат;
	КонецЕсли;
	
	РезультатЗаполнения = ЗаполнитьПодобранныеСтатьиБюджетаНаСервере(Результат, ДополлнительныеПараметры);
	
	Если Не ПустаяСтрока(РезультатЗаполнения) Тогда
		ПоказатьПредупреждение(, РезультатЗаполнения);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ЗаполнитьПодобранныеСтатьиБюджетаНаСервере(АдресТаблицы, ДополлнительныеПараметры)  
	
	ТаблицаСтатейБюджета = ПолучитьИзВременногоХранилища(АдресТаблицы);
	Если ТипЗнч(ТаблицаСтатейБюджета) = Тип("ТаблицаЗначений") Тогда 
		Если ТаблицаСтатейБюджета.Количество() = 0 Тогда
			Возврат "Не удалось получить статьи бюджета!";
		КонецЕсли;  
		
		Для Каждого ИдентификаторСтроки из ДополлнительныеПараметры.ВыделенныеСтроки Цикл
			СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки); 
			
			Отбор = Новый Структура;
			Отбор.Вставить("Владелец", СтрокаТаблицы.Грузоперевозка);
			
			НайденныеСтроки = ТаблицаСтатейБюджета.НайтиСтроки(Отбор);   
			Если НайденныеСтроки.Количество() = 1 Тогда
				СтрокаТаблицы.СтатьяБюджета = НайденныеСтроки[0].СтатьяБюджета;	
			КонецЕсли;
			
		КонецЦикла;
		
		Модифицированность = Истина;
		
	Иначе
		Возврат "Не удалось получить данные для заполнения статей бюджета!";
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции 



&НаКлиенте
Процедура БюджетСоздатьСтатьи(Команда)  
	
	ПараметрыСтатейБюджета = ПолучитьПараметрыСозданияСтатейБюджета(Элементы.Услуги.ВыделенныеСтроки); 
	Если ПараметрыСтатейБюджета = Неопределено Тогда
		ПоказатьПредупреждение(,"Для выделенных строк уже указаны статьи бюджета!");
		Возврат;
	КонецЕсли;

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьСозданиеСтатейБюджета", ЭтотОбъект, ПараметрыСтатейБюджета);
	ПоказатьВопрос(Оповещение, "Для выделенных строк с незаполненной статьей бюджета будут созданы новые статьи. Продолжить?", Режим, 0);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьПараметрыСозданияСтатейБюджета(Знач ВыделенныеСтроки)
	
	ДанныеОбъекта = Новый Структура("Дата,ДатаКурса,Организация,Контрагент,Договор,ПриложениеКДоговору,Валюта,УЕ_ПользовательскийКурс,УЕ_Кратность,УЕ_Курс");
	
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект); 
	
	Если Объект.ФормируетсяАкт Тогда
		ДанныеОбъекта.ДатаКурса = Объект.ДатаАкта;  
	ИначеЕсли Объект.ФормируетсяСчет Тогда
		ДанныеОбъекта.ДатаКурса = Объект.ДатаСчета;
	Иначе
		ДанныеОбъекта.ДатаКурса = Объект.Дата;
	КонецЕсли;   
	
	ДанныеСтрок = Новый Массив;
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки); 
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтатьяБюджета) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтроки = Новый Структура("ИдентификаторСтроки,Грузоперевозка,Номенклатура,ПорядокОтражения,Количество,Цена,Сумма,СтавкаНДС,НДС,Всего", ИдентификаторСтроки);
		
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаТаблицы); 
		
		ДанныеСтрок.Добавить(ДанныеСтроки);
	КонецЦикла; 

	Если ДанныеСтрок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСтатейБюджета = Новый Структура;
	ПараметрыСтатейБюджета.Вставить("ДанныеОбъекта",		 ДанныеОбъекта);
	ПараметрыСтатейБюджета.Вставить("ДанныеСтрок", 			 ДанныеСтрок);
	ПараметрыСтатейБюджета.Вставить("ВидСтатьиПланирования", ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"));
	
	Возврат ПараметрыСтатейБюджета;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьСозданиеСтатейБюджета(Результат, ПараметрыСтатейБюджета) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 
	
	ПослеВыбораВерсииБюджета = Новый ОписаниеОповещения("ПослеВыбораВерсииБюджета", ЭтотОбъект, ПараметрыСтатейБюджета);
	
	ОткрытьФорму("Справочник.CW_ВерсииБюджетов.ФормаВыбора",,ЭтаФорма,,,,ПослеВыбораВерсииБюджета, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораВерсииБюджета(ВерсияБюджета, ПараметрыСтатейБюджета) Экспорт
	
	Если ВерсияБюджета = Неопределено Тогда
		Возврат;
	КонецЕсли;    

	ВыделенныеСтроки = Элементы.Услуги.ВыделенныеСтроки; 
	
	ВладельцыБюжета = ПолучитьМассвВладельцевБюджета(ВыделенныеСтроки);
	Если CW_Бюджетирование.БюджетУтвержден(ВерсияБюджета, ВладельцыБюжета) Тогда
		ПоказатьПредупреждение(,"По заказу (грузоперевозке) заблокирован бюджет! Формирование статей невозможно!");
		Возврат;
	КонецЕсли;
	
	ПараметрыСтатейБюджета.Вставить("ВерсияБюджета", ВерсияБюджета);
	
	ДопоплнительныеПараметры = Новый Структура;
	ДопоплнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ПослеСозданияСтатейБюджета", ЭтотОбъект, ДопоплнительныеПараметры);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Форма", 					ЭтотОбъект); 
	СтруктураПараметров.Вставить("Оповещение", 				Оповещение); 
	СтруктураПараметров.Вставить("ПараметрыСтатейБюджета", 	ПараметрыСтатейБюджета); 

	CW_БюджетированиеКлиент.СоздатьСтатьиБюжета(СтруктураПараметров);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьМассвВладельцевБюджета(ВыделенныеСтроки) 
	
	ВладельцыБюжета = Новый Массив;
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл  
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ВладельцыБюжета.Найти(СтрокаТаблицы.Грузоперевозка) = Неопределено Тогда
			ВладельцыБюжета.Добавить(СтрокаТаблицы.Грузоперевозка);
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтрокаТаблицы.Грузоперевозка.Заказ) 
			и ВладельцыБюжета.Найти(СтрокаТаблицы.Грузоперевозка.Заказ) = Неопределено Тогда  
			ВладельцыБюжета.Добавить(СтрокаТаблицы.Грузоперевозка.Заказ);
		Конецесли;
	КонецЦикла;   
	
	Возврат ВладельцыБюжета;
	
КонецФункции
	
	
&НаКлиенте
Процедура ПослеСозданияСтатейБюджета(РезультатВыполнения, ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		ЗаполнитьСтатьиБюджетаВСтроках(РезультатВыполнения.АдресРезультата);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения);  
		
	КонецЕсли; 
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьСтатьиБюджетаВСтроках(АдресРезультата) 
	
	СоответствиеСтатейБюджета = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Для Каждого КлючЗначение из СоответствиеСтатейБюджета Цикл
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(КлючЗначение.Ключ);
		СтрокаТаблицы.СтатьяБюджета = КлючЗначение.Значение;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура БюджетОбновитьСтатьи(Команда)  
	
	ДанныеСтатейБюджета = ПолучитьПараметрыДляОбновленияСтатейБюджета(Элементы.Услуги.ВыделенныеСтроки);	
	Если ДанныеСтатейБюджета = Неопределено Тогда
		ПоказатьПредупреждение(,"Для выделенных строк не указаны статьи бюджета!");
		Возврат;
	КонецЕсли;        
	
	ДопоплнительныеПараметры = Новый Структура;
	ДопоплнительныеПараметры.Вставить("ДанныеСтатейБюджета", ДанныеСтатейБюджета);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьОбновлениеСтатейБюджета", ЭтотОбъект, ДопоплнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Для статей бюджета выделенных строк будут обновлены реквизиты. Продолжить?", Режим, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбновлениеСтатейБюджета(Результат, ДопоплнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;  

	Оповещение = Новый ОписаниеОповещения("ПослеОбновленияСтатейБюджета", ЭтотОбъект);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Форма",				ЭтотОбъект); 
	ПараметрыПроцедуры.Вставить("Оповещение",			Оповещение); 
	ПараметрыПроцедуры.Вставить("ДанныеСтатейБюджета", 	ДопоплнительныеПараметры.ДанныеСтатейБюджета);
	
	CW_БюджетированиеКлиент.ОбновитьСтатьиБюджета(ПараметрыПроцедуры);
	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеОбновленияСтатейБюджета(РезультатВыполнения, ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		ОповеститьОбИзменении(тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов"));
		
		Элементы.Услуги.Обновить();
	
		ПоказатьОповещениеПользователя("Статьи бюджета",,"Обновлены данные статей бюджета");
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения);  
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыДляОбновленияСтатейБюджета(Знач ВыделенныеСтроки)
	
	ДанныеСтатейБюджета = Новый Соответствие;
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки); 
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.СтатьяБюджета) Тогда
			Продолжить;
		КонецЕсли;   
		
		ДанныеСтатьи = ДанныеСтатейБюджета.Получить(СтрокаТаблицы.СтатьяБюджета);
		Если ДанныеСтатьи = Неопределено Тогда
			ДанныеСтатьи = Новый Структура("Контрагент,Договор,ПриложениеКДоговору,Валюта,Курс,Кратность,Номенклатура,ПорядокОтражения,СтавкаНДС,Количество,Цена,Сумма,СуммаНДС,СуммаВсего");
		КонецЕсли;
	
		ЗаполнитьЗначенияСвойств(ДанныеСтатьи, СтрокаТаблицы);                     
		
		ДанныеСтатьи.Вставить("Контрагент",Объект.Контрагент);
		ДанныеСтатьи.Вставить("Договор",Объект.Договор);  
		ДанныеСтатьи.Вставить("Валюта",Объект.Валюта);  
		ДанныеСтатьи.Вставить("ПриложениеКДоговору",Объект.ПриложениеКДоговору); 
		ДанныеСтатьи.Вставить("СуммаНДС",СтрокаТаблицы.НДС);
		ДанныеСтатьи.Вставить("СуммаВсего",СтрокаТаблицы.Всего);  
		
		// определим курс и кратность 
		Курс = 1;
		Кратность = 1;   
		ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();  
		Если Объект.Валюта <> ВалютаРегламентированногоУчета Тогда 
			Контракт = ?(ЗначениеЗаполнено(Объект.ПриложениеКДоговору),Объект.ПриложениеКДоговору, Объект.Договор);
			Если Объект.УЕ_ПользовательскийКурс Тогда
				Курс = Объект.УЕ_Курс;
				Кратность = Объект.УЕ_Кратность;
			Иначе
				Если (Объект.ФормируетсяАкт) Тогда
					ДатаКурса = Объект.ДатаАкта;
				Иначе
					Если (Объект.ФормируетсяСчет) Тогда 
						ДатаКурса = Объект.ДатаСчета;
					Иначе
						ДатаКурса = Объект.Дата;
					КонецЕсли;
				КонецЕсли; 
				СтруктураКурсаВалюты = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,ДатаКурса);
				Курс = СтруктураКурсаВалюты.Курс;
				Кратность = СтруктураКурсаВалюты.Кратность;
			КонецЕсли;
		КонецЕсли;
 		ДанныеСтатьи.Вставить("Курс",Курс);
 		ДанныеСтатьи.Вставить("Кратность",Кратность);
		
		ДанныеСтатейБюджета.Вставить(СтрокаТаблицы.СтатьяБюджета, ДанныеСтатьи);
	КонецЦикла; 

	Если ДанныеСтатейБюджета.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ДанныеСтатейБюджета;
	
КонецФункции

&НаКлиенте
Процедура БюджетОчиститьСтатьи(Команда)  
	ВыделенныеСтроки = Элементы.Услуги.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Режим = РежимДиалогаВопрос.ДаНет;                                                            
	Оповещение = Новый ОписаниеОповещения("ПродолжитьОчисткуСтатейБюджетаПоСтрокам", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Статьи бюджета в выделенных строках будут очищены. Продолжить?", Режим, 0);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПродолжитьОчисткуСтатейБюджетаПоСтрокам(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	БюджетОчиститьСтатьиНаСервере(ДополнительныеПараметры.ВыделенныеСтроки);

КонецПроцедуры  

&НаСервере
Процедура БюджетОчиститьСтатьиНаСервере(ВыделенныеСтроки)   
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаТаблицы.СтатьяБюджета = ПредопределенноеЗначение("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ПустаяСсылка");
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОчистка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = ложь;

КонецПроцедуры

//---Подсистема.Бюджетирование