
Функция ПолучитьНастройкуПоОбъекту(ИдентификаторОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_НастройкиВыводаСтатистики.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_НастройкиВыводаСтатистики КАК CW_НастройкиВыводаСтатистики
	               |ГДЕ
	               |	CW_НастройкиВыводаСтатистики.ИдентификаторОбъекта = &ИдентификаторОбъекта
	               |	И CW_НастройкиВыводаСтатистики.НеИспользуется = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.CW_НастройкиВыводаСтатистики.ПустаяСсылка");

КонецФункции