
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьДули()  Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройка для "+Строка(ИдентификаторОбъекта)+" уже есть",,"ИдентификаторОбъекта","Объект", Отказ);
	КонецЕсли;
	
	
КонецПроцедуры

Функция ЕстьДули()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_НастройкиВыводаСтатистики.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_НастройкиВыводаСтатистики КАК CW_НастройкиВыводаСтатистики
	               |ГДЕ
	               |	CW_НастройкиВыводаСтатистики.Ссылка <> &Ссылка
	               |	И CW_НастройкиВыводаСтатистики.ИдентификаторОбъекта = &ИдентификаторОбъекта
	               |	И CW_НастройкиВыводаСтатистики.НеИспользуется = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции
