#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКопировании(ОбъектКопирования)
	
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"ОбъектКопированияСсылка",ОбъектКопирования.Ссылка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если (ЭтоНовый()) Тогда
		_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"ЭтоНовый",Истина);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ЭтоНовый = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ЭтоНовый");
	Если (ЭтоНовый <> Неопределено) Тогда
		
		ОбъектКопированияСсылка = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ОбъектКопированияСсылка");
		Если (ОбъектКопированияСсылка <> Неопределено) Тогда
			
			Если (ОбъектКопированияСсылка.Обработка = Ссылка.Обработка) Тогда
				
				// читаем настройки
				НастройкиСубъекта = _ПО.ПолучитьНастройкиСубъекта(ОбъектКопированияСсылка.Обработка,ОбъектКопированияСсылка);
				// пишем настройки
				_ПО.ЗаписатьНастройкиСубъекта(Ссылка.Обработка,Ссылка,НастройкиСубъекта);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры


#КонецЕсли