
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;      
	ПараметрыФормы.Вставить("Корректировка", ПараметрыВыполненияКоманды.Источник.Объект.Корректировка);    
	
	ПолучитьИтогиПоСтрокам(ПараметрыВыполненияКоманды.Источник, ПараметрыФормы);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаИтоговПоВыделеннымСтрокам", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры   

&НаКлиенте
Процедура ПолучитьИтогиПоСтрокам(Форма, ПараметрыФормы)
	
	Элементы 	= Форма.Элементы;	
	Объект 		= Форма.Объект;	

	ИтогоКоличество = 0; 	
	ИтогоСумма 		= 0; 	
	ИтогоНДС 		= 0;  	
	ИтогоВсего 		= 0; 
	
	ИтогоКоличествоДоКорректировки 	= 0; 	
	ИтогоСуммаДоКорректировки 		= 0;	
	ИтогоНДСДоКорректировки 		= 0;	
	ИтогоВсегоДоКорректировки 		= 0; 
	
	ИмяЭлеметаФормы = "Услуги";
	Если Объект.Корректировка Тогда
		ИмяЭлеметаФормы = "УслугиКорректировка";
	КонецЕсли;
	
	Для Каждого Идентификатор из Элементы[ИмяЭлеметаФормы].ВыделенныеСтроки Цикл
		ВыделеннаяСтрока = Объект.Услуги.НайтиПоИдентификатору(Идентификатор);
		
		ИтогоКоличество	= ИтогоКоличество + ВыделеннаяСтрока.Количество;
		ИтогоСумма 		= ИтогоСумма + ВыделеннаяСтрока.Сумма;
		ИтогоНДС 		= ИтогоНДС + ВыделеннаяСтрока.НДС;
		ИтогоВсего 		= ИтогоВсего + ВыделеннаяСтрока.Всего;
		
		Если Объект.Корректировка Тогда
			ИтогоКоличествоДоКорректировки 	= ИтогоКоличествоДоКорректировки + ВыделеннаяСтрока.Количество_ДоКорректировки;
			ИтогоСуммаДоКорректировки 		= ИтогоСуммаДоКорректировки + ВыделеннаяСтрока.Сумма_ДоКорректировки;
			ИтогоНДСДоКорректировки 		= ИтогоНДСДоКорректировки + ВыделеннаяСтрока.НДС_ДоКорректировки;
			ИтогоВсегоДоКорректировки 		= ИтогоВсегоДоКорректировки + ВыделеннаяСтрока.Всего_ДоКорректировки; 
		Конецесли;
		
	КонецЦикла;       
	
	Если Объект.Корректировка Тогда    
		Если Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
			ПараметрыФормы.Вставить("НадписьДоКорректировки",		"До изменения:");
			ПараметрыФормы.Вставить("НадписьПослеКорректирвоки",	"После изменения:");
		Иначе
			ПараметрыФормы.Вставить("НадписьДоКорректировки",		"До корректировки:");
			ПараметрыФормы.Вставить("НадписьПослеКорректирвоки",	"После корректировки:");
		КонецЕсли;
	Иначе
		ПараметрыФормы.Вставить("НадписьДоКорректировки",		"");
		ПараметрыФормы.Вставить("НадписьПослеКорректирвоки",	"Итого по строкам:");
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Количество",	ИтогоКоличество);
	ПараметрыФормы.Вставить("Сумма",		ИтогоСумма);
	ПараметрыФормы.Вставить("НДС",			ИтогоНДС);
	ПараметрыФормы.Вставить("Всего",		ИтогоВсего); 
	
	ПараметрыФормы.Вставить("КоличествоДоКорректировки",	ИтогоКоличествоДоКорректировки);
	ПараметрыФормы.Вставить("СуммаДоКорректировки",			ИтогоСуммаДоКорректировки);
	ПараметрыФормы.Вставить("НДСДоКорректировки",			ИтогоНДСДоКорректировки);
	ПараметрыФормы.Вставить("ВсегоДоКорректировки",			ИтогоВсегоДоКорректировки);   
	
КонецПроцедуры
