
Функция ПолучитьСписокВидовОпераций() Экспорт
	
	ВсеВидыОпераций = Перечисления.CW_ВидыОперацийДДС;
	
	СписокДоступныхЗначений = Новый СписокЗначений;
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ПоступлениеОтПокупателя);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ВозвратПокупателю);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ОплатаПоставщику);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ВозвратОтПоставщика);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ОплатаПоставщикуПоПриобретениям);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ПеремещениеВДругуюКассу);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ПрочиеПоступления);
	СписокДоступныхЗначений.Добавить(ВсеВидыОпераций.ПрочиеСписания);
	
	Возврат СписокДоступныхЗначений;
	
КонецФункции
