
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСписка = Параметры.АдресСписка;
	
	Если ЭтоАдресВременногоХранилища(АдресСписка) Тогда
		мВыбранныеГруппы = ПолучитьИзВременногоХранилища(АдресСписка);
	Иначе
		мВыбранныеГруппы = новый Массив;
	КонецЕсли;
	
	СписокГрупп 	= Справочники.CW_ПодключаемыеОбъекты.ПолучитьМассивГруппПользователей();
	
	Для Каждого ЭлементСписка из СписокГрупп Цикл
		
		Пометка = мВыбранныеГруппы.Найти(ЭлементСписка.Значение)<> Неопределено;
		ДоступностьОбъекта.Добавить(ЭлементСписка.Значение,ЭлементСписка.Представление, Пометка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСпискаПользователей()
	
	мМассивВыбранных = Новый Массив;
	
	Для Каждого ЭлементСписка из ДоступностьОбъекта Цикл
		
		Если ЭлементСписка.Пометка Тогда
			мМассивВыбранных.Добавить(ЭлементСписка.Значение);	
		КонецЕсли;
		
	КонецЦикла;
	
	Если мМассивВыбранных.Количество() = 0 Тогда
		мМассивВыбранных.Добавить(Справочники.CW_ГруппыПользователей.Администраторы);
	КонецЕсли;

	Возврат ПоместитьВоВременноеХранилище(мМассивВыбранных);
	
КонецФункции

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	АдресСписка = ПолучитьАдресСпискаПользователей();
	ЭтаФорма.Закрыть(АдресСписка);
	
КонецПроцедуры
