
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МакетДокумента 		= Обработки.CW_КонтрольЛегальностиОбновленияМодуля.ПолучитьМакет("УсловияРаспространенияОбновлений");
	ТекстПредупреждения = МакетДокумента.ПолучитьТекст();
	
	СтандартныйПрефикс = ПолучитьНавигационнуюСсылкуИнформационнойБазы() + "/";
	ЭтоВебКлиент = СтрНайти(СтандартныйПрефикс, "http://") > 0;
	Если ЭтоВебКлиент Тогда
		КодЛокализации = ТекущийКодЛокализации();
		СтандартныйПрефикс = СтандартныйПрефикс + КодЛокализации + "/";
	КонецЕсли;   
	
	CW_ОбновлениеКонфигурацииСервер.ПодготовитьСписокОбновляемыхПодсистем(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	Отказ = КомандаПродолжитьНаСервере(); 
	Если Отказ Тогда   
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеКомандыПродолжить", ЭтотОбъект);
		ПоказатьПредупреждение(ОписаниеОповещения, "Обнаружено нелегальное применение обновления программного продукта! 
													|
													|Обратитесь на линию технической поддержики.",,"Ошибка применения обновления"); 
	Иначе
		ЭтаФорма.Закрыть(Результат);
	КонецЕсли;	
	
КонецПроцедуры       

&НаКлиенте
Процедура ЗавершениеКомандыПродолжить(ДополнительныеПараметры) Экспорт
	
	ПрекратитьРаботуСистемы();
	Закрыть(Результат);
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	ИначеЕсли ТипЗнч(Результат) <> тип("ФиксированнаяСтруктура") Тогда
		ПрекратитьРаботуСистемы();
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Функция КомандаПродолжитьНаСервере()
	
	Отказ = Ложь;
	CW_РегистрацияПрограммыСервер.ОбработатьПодтверждениеЛегальностьОбновления(ЭтаФорма, Отказ);
	Возврат Отказ; 
	
КонецФункции

&НаКлиенте
Процедура ТекстПредупрежденияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Свойство("href") И ЗначениеЗаполнено(ДанныеСобытия.href) Тогда
		ИмяОткрываемойСтраницы = СокрЛП(ДанныеСобытия.href);
		Протокол = ВРег(СтрЛевДоСимвола(ИмяОткрываемойСтраницы, ":"));  
		Если Протокол <> "HTTP" И Протокол <> "HTTPS" И Протокол <> "E1C" и Протокол <> "V8CONFIG" Тогда
			Возврат; // Не ссылка
		КонецЕсли;
		
		Если СтрНайти(ИмяОткрываемойСтраницы, "ОткрытьСписокСчетовПодпискиМодуля") > 0 Тогда
			ОткрытьСписокСчетовПодпискиМодуля();
		Иначе
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ИмяОткрываемойСтраницы); 
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры  


&НаКлиенте
Процедура ОткрытьСписокСчетовПодпискиМодуля() 
	
	ПараметрыФормы = Новый Структура("ПрограммныйПродукт",  "AF");
	ОткрытьФорму("ОбщаяФорма.CW_ЛичныйКабинетСписокСчетов", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция СтрЛевДоСимвола(Строка, Разделитель, Остаток = Неопределено)
	Позиция = СтрНайти(Строка, Разделитель);
	Если Позиция = 0 Тогда
		СтрокаДоТочки = Строка;
		Остаток = "";
	Иначе
		СтрокаДоТочки = Лев(Строка, Позиция - 1);
		Остаток = Сред(Строка, Позиция + СтрДлина(Разделитель));
	КонецЕсли;
	Возврат СтрокаДоТочки;
КонецФункции    

Функция РаскодированнаяСтрока(Строка)
	
	Возврат РаскодироватьСтроку(Строка, СпособКодированияСтроки.КодировкаURL);
	
КонецФункции

