#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ВнешнийВызов Тогда
		
		СП = ПолучитьИзВременногоХранилища(АдресВнешнихНастроек);
		_Отбор = _сф.ст_ПолучитьСвойство(СП, "Отбор");
		НастройкиСКД.Отбор.Элементы.Очистить();
		КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
		
		Если _Отбор <> Неопределено Тогда
			Для каждого КЗ Из _Отбор Цикл
				Ключ = КЗ.Ключ;
				Значение = _Отбор[Ключ];
				Если (Ключ = "Грузоперевозка") Тогда
					CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Грузоперевозка", ВидСравненияКомпоновкиДанных.Равно, Значение, Истина, НастройкиСКД.Отбор);	
				ИначеЕсли (Ключ = "Грузоперевозки") Тогда 
					СписокГП = Новый СписокЗначений;
					СписокГП.ЗагрузитьЗначения(Значение);
					CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Грузоперевозка", ВидСравненияКомпоновкиДанных.ВСписке, СписокГП, Истина, НастройкиСКД.Отбор);
				ИначеЕсли (Ключ = "Номенклатура") Тогда 
					СписокНМ = Новый СписокЗначений;
					СписокНМ.ЗагрузитьЗначения(Значение);
					CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Номенклатура", ВидСравненияКомпоновкиДанных.ВСписке, СписокНМ, Истина, НастройкиСКД.Отбор);
				ИначеЕсли (Ключ = "Заказ") Тогда 
					CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Грузоперевозка", ВидСравненияКомпоновкиДанных.ВСписке, _ПолучитьСписокГрузоперевозокЗаказа(Значение), Истина, НастройкиСКД.Отбор);
				Иначе
					//CW_Отчеты.ДобавитьОтборКомпоновкиДанных("Ключ", ВидСравненияКомпоновкиДанных.Равно, Значение, Истина, НастройкиСКД.Отбор);
					CW_Отчеты.ДобавитьОтборКомпоновкиДанных(Ключ, ВидСравненияКомпоновкиДанных.Равно, Значение, Истина, НастройкиСКД.Отбор);
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		
	КонецЕсли;	
		
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ВРег(МетаданныеОтчета.Синоним));
	
	// Установим параметры
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Период",Новый Граница(КонецДня(Настройки.НаДату), ВидГраницы.Включая));
	
	// формируем по показателям
	Для Каждого Поле Из НастройкиСКД.Выбор.Элементы Цикл
		Если Найти(Строка(Поле.Поле), "Сумма") <> 0 Тогда
			Поле.Использование = Настройки.ПокСумма;
		ИначеЕсли Найти(Строка(Поле.Поле), "НДС") <> 0 Тогда
			Поле.Использование = Настройки.ПокНДС;
		ИначеЕсли Найти(Строка(Поле.Поле), "Всего") <> 0 Тогда
			Поле.Использование = Настройки.ПокВсего;
		ИначеЕсли Найти(Строка(Поле.Поле), "Кол") <> 0 Тогда
			Поле.Использование = Настройки.ПокКол;
		КонецЕсли;					
	КонецЦикла;	
	
	// формируем структуру отчета по группировкам
	НастройкиСКД.Структура.Очистить();
	ТекущийРодитель = НастройкиСКД.Структура;
	Для Каждого Группировка Из Настройки.Группировки Цикл
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		// --- 
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		ПолеГруппировки.Использование = Истина;
		// --- 
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование=Истина;
		// --- 
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		НС = ?(Группировка.Сортировка=Перечисления.CW_НаправлениеСортировки.ПоВозрастанию,НаправлениеСортировкиКомпоновкиДанных.Возр,НаправлениеСортировкиКомпоновкиДанных.Убыв);
		ЭлементПорядка.ТипУпорядочивания = НС;
		ЭлементПорядка.Использование = Истина;
		// --- 
		НоваяГруппировка.Имя = Группировка.Представление;
		НоваяГруппировка.Использование = Истина;
		// --- 
		ТекущийРодитель = НоваяГруппировка.Структура;
	КонецЦикла; 
	
	//эл = НастройкиСКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Грузоперевозка");
	//эл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//эл.ПравоеЗначение = Справочники.CW_Грузоперевозки.НайтиПоНаименованию("");
	//эл.Использование  = Истина;
	
	
КонецПроцедуры

Функция _ПолучитьСписокГрузоперевозокЗаказа(Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_Грузоперевозки.Ссылка
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат(_сф.сп_СоздатьИзКолонкиТЗ(ТЗ, "Ссылка"));
		
КонецФункции
#КонецЕсли