

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СсылкаПараметраКоманды 	= ПараметрКоманды[0];
	ИдентификаторОбъекта 	= ПолучитьИдентификаторОбъекта(СсылкаПараметраКоманды);
	АдресДокументовДляОтбора = ПолучитьАдресДокументов(ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторОбъекта", 	ИдентификаторОбъекта);
	ПараметрыФормы.Вставить("АдресДокументовДляОтбора",	АдресДокументовДляОтбора);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", 	Истина);
	
	ОткрытьФорму("Отчет.CW_СтатистикаНахожденияДокументаВСтатусах.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресДокументов(ПараметрКоманды)
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрКоманды);
	
КонецФункции

&НаСервере
Функция ПолучитьИдентификаторОбъекта(Ссылка)
	
	Возврат ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Ссылка));

КонецФункции