
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма);
	//CW_Документы.ОтображениеКнопокКоманднойПанелиФормыСписка(ЭтаФорма);
	// --------------------------------------------------------------------------- 
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("CW_ГруппаПользователя", 	ГруппаПользователя);
	СтруктураПараметров.Вставить("CW_Пользователь", 		ПараметрыСеанса.ТекущийПользователь);
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураПараметров);
	
	Параметры.Свойство("РежимВыбора",Элементы.Список.РежимВыбора);
	Если (Элементы.Список.РежимВыбора) Тогда
		
		Элементы.Список.МножественныйВыбор=Ложь;
	КонецЕсли; 
	
	УстановитьОтборПоГруппеПользователя();
	
	Параметры.Свойство("Клиент",Клиент);
	
	Если Параметры.Свойство("МассивОбъектовОтбора") Тогда
		
		НовыйЭлемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("Ссылка");
		НовыйЭлемент.ВидСравнения  		= ВидСравненияКомпоновкиДанных.ВСписке;
		НовыйЭлемент.ПравоеЗначение   	= Параметры.МассивОбъектовОтбора;
		НовыйЭлемент.Применение 		= ТипПримененияОтбораКомпоновкиДанных.Элементы;
		НовыйЭлемент.Использование 		= Истина;
		
	КонецЕсли;                                                  	

	_ЗагрузитьСеансовуюНастройку();

	_ПраваДоступа();
	
	 УстановитьИнтевалСпискаНаСервере();
	 
	 //Подсистема.ЛогистическиеСтатусы
	ИспользоватьЛогистическиеСтатусыГрузоперевозок = ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыГрузоперевозок");
	Элементы.ГруппаЛогистическийСтатус.Видимость   = ИспользоватьЛогистическиеСтатусыГрузоперевозок;
	
	Если ИспользоватьЛогистическиеСтатусыГрузоперевозок Тогда
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_Грузоперевозки"));
		МеханизмРаскраски 	 = Константы.CW_МеханизмРаскраскиСписковМониторинга.Получить();
		
		CW_ЛогистическиеСтатусыСервер.ПриСозданииФормыСпискаНаСервере(ЭтаФорма, "Список", ИдентификаторОбъекта, МеханизмРаскраски, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	//Подсистема.ЛогистическиеСтатусы

	//Подсистема.ФинансовыеСтатусы
	ИспользоватьФинансовыеСтатусыГрузоперевозок = ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок");
	Элементы.ГруппаФинансовыйСтатус.Видимость   = ИспользоватьФинансовыеСтатусыГрузоперевозок;
	
	Если ИспользоватьФинансовыеСтатусыГрузоперевозок Тогда
		CW_ФинансовыеСтатусыСервер.ПриСозданииФормыСпискаНаСервере(ЭтаФорма, "Список", ИдентификаторОбъекта, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	//Подсистема.ФинансовыеСтатусы
	
	УстановитьПараметрыыДинамическогоСписка();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		
		ОтборНайден = Ложь;
		Для Каждого ЭлементОтбора из Список.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Клиент") Тогда
				ОтборНайден = Истина;
				Прервать;
			Конецесли;
		КонецЦикла;
		
		Если НЕ ОтборНайден Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		КонецЕсли;
		
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Клиент");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Клиент;
		ЭлементОтбора.Использование 	= Истина;
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ ПравоДобавленияГрузоперевозокя Тогда
		Отказ = истина;
		ПоказатьПредупреждение(,"Нет прав для добавления грузоперевозки");
	КонецЕсли;

	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьОтборПоГруппеПользователя()
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	Если  ГруппаПользователя = ПредопределенноеЗначение("Справочник.CW_ГруппыПользователей.Администраторы") 
		ИЛИ ГруппаПользователя.ПолныеПрава ИЛИ Не ГруппаПользователя.ФильтрГрузоперевозок Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиГруппы  = ГруппаПользователя.ХранилищеФильтраГрузоперевозок.Получить();
	
	Если НастройкиГруппы <> Неопределено Тогда
		Список.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиГруппы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ПраваДоступа()
	// --- 
	
	ПравоДобавленияГрузоперевозокя = CW_ПраваДоступа.ПравоДоступно("ДобавлениеГрузоперевозок"); //(CW_ПраваДоступа.ПравоДоступно("???")

	//Элементы.ФормаОтборСортировка.Видимость = CW_Настройки.ПолучитьНастройкуПользователя(, "РежимОтладкиВключен");
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _СохранитьСеансовуюНастройку()
	// --- 
	
	_УФС.СохранитьСеансовыеНастройки(ЭтаФорма,,_ПФ_НастройкаСписка().СписокКолонок);
	
	// --- 
КонецФункции

&НаСервере
Функция _ЗагрузитьСеансовуюНастройку()
	// --- 
	
	Настройка = _УФС.ЗагрузитьСеансовыеНастройки(ЭтаФорма);
	_ОбработатьНастройкуСписка(Настройка);
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура НастройкаСписка(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияНастройкиСписка",ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаНастройкиСписка",_ПФ_НастройкаСписка(),,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияНастройкиСписка(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		_ОбработатьНастройкуСписка(Ответ); 
	КонецЕсли;
	
	// --- 
КонецПроцедуры
// ---------------------------------------------------------------------------- 

&НаСервере
Функция _ПФ_НастройкаСписка()
	// --- 
	
	ПФ = Новый Структура("Источник,СписокКолонок",ЭтаФорма.Заголовок,Новый Массив);
	// --- 
	_СформироватьСтруктуруКолонок(Элементы.Список,ПФ.СписокКолонок);
	СписокКолонок.ЗагрузитьЗначения(ПФ.СписокКолонок);
	// --- 
	Возврат(ПФ);
	
	// --- 
КонецФункции
 
&НаСервере
Процедура _СформироватьСтруктуруКолонок(Элемент,МассивСК)
	// --- 
	мИсключения = Новый Массив;   
	//Добавили, убрали, потом уберем обратно, поэтому не удаляю
	//мИсключения.Добавить("КартинкаСтатуса");
	//мИсключения.Добавить("ФинансовыйСтатусКартинка");
	//мИсключения.Добавить("ГруппаЛогистическийСтатус");
	//мИсключения.Добавить("ГруппаФинансовыйСтатус");
	
	мНеДоступноПоОпциям = Новый Массив;
	Если НЕ ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок") Тогда
		мНеДоступноПоОпциям.Добавить("ФинансовыйСтатус");	
	КонецЕсли;
	Если НЕ ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыГрузоперевозок") Тогда
		мНеДоступноПоОпциям.Добавить("ЛогистическийСтатус");	
	КонецЕсли; 
	Если CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(), "СкрыватьКартинкиСтатусовВЖурналах") тогда
		мНеДоступноПоОпциям.Добавить("КартинкаСтатуса");	
	КонецЕсли;
	Если CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(), "СкрыватьКартинкиФинансовыхСтатусовВЖурналах") тогда
		мНеДоступноПоОпциям.Добавить("ФинансовыйСтатусКартинка");	
	КонецЕсли;
	
	// обходим подчинённые элементы
	Для каждого ПЭ Из Элемент.ПодчиненныеЭлементы Цикл
		
		Если мИсключения.Найти(ПЭ.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если мНеДоступноПоОпциям.Найти(ПЭ.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
	
		Узел = _ШаблонУзла();
		_сф.ст_ЗаполнитьСвойства(Узел,"Имя,Заголовок,Видимость",ПЭ);
		Узел.ЭтоГруппа = (ТипЗнч(ПЭ) <> Тип("ПолеФормы"));
		МассивСК.Добавить(Узел);

		Если Узел.ЭтоГруппа Тогда
			_СформироватьСтруктуруКолонок(ПЭ,Узел.Элементы);
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция _ШаблонУзла()
	// --- 
	
	Возврат(Новый Структура("Имя,Заголовок,Видимость,ИзменениеВидимости,ЭтоГруппа,Элементы","","",Ложь,Истина,Ложь,Новый Массив));
	
	// --- 
КонецФункции

// --- 

&НаСервере
Процедура _ОбработатьНастройкуСписка(Настройка)
	// --- 
	
	Если (Настройка = Неопределено) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Попытка
		
		// необходимо проверить порядок и видимость, 
		// сначала видимость
		Для каждого СК Из Настройка Цикл
			
			_ОбновитьВидимость(СК);
			
		КонецЦикла; 
		// потом порядок
		Если (СписокКолонок.Количество()=0) Тогда
			_СформироватьСтруктуруКолонок(Элементы.Список,СписокКолонок);
			_ОбновитьПорядок(Настройка);
		Иначе
			_ОбновитьПорядок(Настройка);
		КонецЕсли; 
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки; 
	
	_СохранитьСеансовуюНастройку();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьВидимость(СК)
	// --- 
	
	ЭлементФормы = Элементы.Найти(СК.Имя);
	Если ЭлементФормы <> Неопределено Тогда
		
		ЭлементФормы.Видимость = СК.Видимость;
		Если СК.Видимость И СК.ЭтоГруппа Тогда
			
			Для каждого Элемент Из СК.Элементы Цикл
				
				_ОбновитьВидимость(Элемент);
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьПорядок(Настройка)
	// --- 
	
	ТекущийИндекс = 1;
	Для каждого СК Из Настройка Цикл
		
		ПередвигаемыйЭлемент = Элементы[СК.Имя];
		Элементы.Переместить(ПередвигаемыйЭлемент, ПередвигаемыйЭлемент.Родитель);
		
		Если СК.ЭтоГруппа Тогда
			
			_ОбновитьПорядок(СК.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
	СписокКолонок.ЗагрузитьЗначения(Настройка);
	// --- 
КонецПроцедуры


&НаСервере
Процедура УстановитьИнтевалСпискаНаСервере()
	
	ДатаНачала 		= ПериодСписка.ДатаНачала;
	ДатаОкончания 	= ?(ЗначениеЗаполнено(ПериодСписка.ДатаОкончания), ПериодСписка.ДатаОкончания, Дата('39991231'));
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала"	, ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ДатаОкончания);
	
	//Установим заголовок формы
	СтрокаПериода = ПредставлениеПериода(ПериодСписка.ДатаНачала,ПериодСписка.ДатаОкончания);
	Заголовок = "Список грузоперевозок "+?(ЗначениеЗаполнено(СтрокаПериода),"("+СтрокаПериода+")",""); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтевалСписка(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала 	= ПериодСписка.ДатаНачала;
	Диалог.Период.ДатаОкончания = ПериодСписка.ДатаОкончания;
	Диалог.Период.Вариант 		= ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ОписаниеОповещения);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	
	Если ОтветПериод <> Неопределено Тогда
		ПериодСписка = ОтветПериод;
		установитьИнтевалСпискаНаСервере();
	КонецЕсли; 
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти    

&НаКлиенте
Процедура ПоказатьАрхивныеПриИзменении(Элемент)

	УстановитьПараметрыыДинамическогоСписка();
	Элементы.Список.Обновить();	

КонецПроцедуры   

&НаСервере
Процедура УстановитьПараметрыыДинамическогоСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьАрхивные", ПоказатьАрхивные);
	
КонецПроцедуры

