&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма);
	//CW_Документы.ОтображениеКнопокКоманднойПанелиФормыСписка(ЭтаФорма);
	// ---------------------------------------------------------------------------- 
	
	//Параметры.Свойство("РежимВыбора",Элементы.Список.РежимВыбора);
	//Если (Элементы.Список.РежимВыбора) Тогда
	//	
	//	Элементы.Список.МножественныйВыбор=Ложь;
	//	
	//КонецЕсли; 

	//_ЗагрузитьСеансовуюНастройку();

	_ПраваДоступа();
    //Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура _ПраваДоступа()
	// --- 
	
	ПравоРедактирования = Истина; //(CW_ПраваДоступа.ПравоДоступно("???")
	Если НЕ ПравоРедактирования Тогда

		Элементы.Список.ИзменятьСоставСтрок = Ложь;
		Элементы.Список.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	//Элементы.ФормаОтборСортировка.Видимость = CW_Настройки.ПолучитьНастройкуПользователя(, "РежимОтладкиВключен");
	
	// --- 
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти