&НаСервере
Функция ПолучитьЛинииИзФТП(Отказ);
	
	ДанныеАутентификации = CW_МониторПорталаПоддержкиСервер.ДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ДанныеАутентификации = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны данные аутентификации пользователя на FTP-сервере",,,,Отказ);
	КонецЕсли;
	
	ПараметрыFTPПодключения = CW_РаботаСFTPРесурсами.ПолучитьПустуюСтруктуруНастроекFTP();   
	ПараметрыFTPПодключения.Логин  = ДанныеАутентификации.Логин;
	ПараметрыFTPПодключения.Пароль = ДанныеАутентификации.Пароль;
	
	CW_РаботаСFTPРесурсами.ЗаполнитьНастройкиFTPРесурса(ПараметрыFTPПодключения);	
	
	FTPСоединение = CW_РаботаСFTPРесурсами.ПодключитьсяКFTPРесурсу(ПараметрыFTPПодключения);
	
	Если FTPСоединение = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить соединение с FTP-сервером",,,,Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Каталог = "/Reference/Lines";
	FTPСоединение.УстановитьТекущийКаталог(Каталог);
	
	Если FTPСоединение.НайтиФайлы("Lines.mxl").Количество() = 0 тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("mxl");
	FTPСоединение.Получить("Lines.mxl",ВременныйФайл);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ВременныйФайл);
	
	УдалитьФайлы(ВременныйФайл);
	
	Возврат ТабличныйДокумент;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// заполнение из макета
	Макет = ПолучитьЛинииИзФТП(Отказ);
	Если Отказ Тогда Возврат КонецЕсли;
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		НовСтрока = ТаблицаЗагрузки.Добавить();
		НовСтрока.Наименование = Макет.Область(НомерСтроки, 1).Текст;
		НовСтрока.АдресСайта   = Макет.Область(НомерСтроки, 2).Текст;
		Если ЗначениеЗаполнено(Справочники.CW_Линии.НайтиПоНаименованию(НовСтрока.Наименование)) Тогда
			НовСтрока.ЕстьВБазе = Истина;
		КонецЕсли;
	КонецЦикла;
	УО = ЭтаФорма.УсловноеОформление; 
	УО.Элементы.Очистить(); 
	ЭлементУО = УО.Элементы.Добавить(); 

	Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить(); // Поля таблицы для которых будет действовать оформление 
	Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗагрузки"); 
	Оформляемоеполе.Использование = ИСТИНА; 


	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); // отбор текущей строки таблицы 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаЗагрузки.ЕстьВБазе"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФОна",WebЦвета.СветлоЗеленый);
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	колВоВыделенных = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	Элементы.НадписьИтого.Заголовок = "Выделено "+колВоВыделенных+" из "+ТаблицаЗагрузки.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормыКлиент()
	
	колВоВыделенных = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	Элементы.НадписьИтого.Заголовок = "Выделено "+колВоВыделенных+" из "+ТаблицаЗагрузки.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагрузкиПометкаПриИзменении(Элемент)
	
	фл = Элементы.ТаблицаЗагрузки.ТекущиеДанные.Пометка;
	Для Каждого ИдСтроки Из Элементы.ТаблицаЗагрузки.ВыделенныеСтроки Цикл
		СтрокаДФК = ТаблицаЗагрузки.НайтиПоИдентификатору(ИдСтроки);
		СтрокаДФК.Пометка = фл;
	КонецЦикла;
	
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагрузкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаЗагрузкиАдресСайта" Тогда 
		
		АдресСайта = Элемент.ТекущиеДанные.АдресСайта;
		Если ЗначениеЗаполнено(АдресСайта) Тогда 
			Если Лев(АдресСайта, 4) <> "http" Тогда 
				АдресСайта = "http://"+АдресСайта;
			КонецЕсли;
			#Если Вебклиент Тогда 
				ПерейтиПоНавигационнойСсылке(АдресСайта);
			#Иначе
				ЗапуститьПриложение(АдресСайта);
			#КонецЕсли
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСайт(Команда)
	
	Если Элементы.ТаблицаЗагрузки.ТекущиеДанные<>Неопределено Тогда 
		АдресСайта = Элементы.ТаблицаЗагрузки.ТекущиеДанные.АдресСайта;
		Если ЗначениеЗаполнено(АдресСайта) Тогда 
			Если Лев(АдресСайта, 4) <> "http" Тогда 
				АдресСайта = "http://"+АдресСайта;
			КонецЕсли;
			#Если Вебклиент Тогда 
				ПерейтиПоНавигационнойСсылке(АдресСайта);
			#Иначе
				ЗапуститьПриложение(АдресСайта);
			#КонецЕсли

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для Каждого строкаКоллекции  Из ТаблицаЗагрузки Цикл
		строкаКоллекции.Пометка = Ложь;
	КонецЦикла;
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого строкаКоллекции  Из ТаблицаЗагрузки Цикл
		строкаКоллекции.Пометка = Истина;
	КонецЦикла;
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	// строки к загрузке
	колВоВыделенных = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	Если колВоВыделенных=0 Тогда 
		_УФК.ВывестиПредупреждение("Не отмечено ни одной строки");
		Возврат;
	КонецЕсли;
	
	// поиск существующих по наименованию
	Ответ = _ПроверитьСуществованиеЗагружаемыхЛиний();
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда 
		
		// добавим без дополнительных вопросов
		ВыполнитьЗагрузкуЛиний();
		
	Иначе 
		// часть линий найдена
		сз = Новый СписокЗначений;
		сз.Добавить(КодВозвратаДиалога.Да,         "Перезаписать все");
		сз.Добавить(КодВозвратаДиалога.Пропустить, "Пропустить найденные"); //"Пропустить существующие"//"Добавить только новые"
		сз.Добавить(КодВозвратаДиалога.Отмена,     "Отмена");
		// --- 
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаПерезаписиЛиний",ЭтотОбъект, Новый Структура("Ответ",Ответ)); 
		// --- 
		ПоказатьВопрос(ПОВ,
			"В справочнике уже существуют линии :"+Ответ.ОписаниеОшибки
			+ Символы.ПС + "Перезаписать существующие элементы справочника Линии?",
			сз);
		
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаПерезаписиЛиний(КодВозврата, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если КодВозврата = КодВозвратаДиалога.Да Тогда 
		
		// добавляем все
		ВыполнитьЗагрузкуЛиний();
		
	ИначеЕсли КодВозврата = КодВозвратаДиалога.Пропустить Тогда 
		
		// снимем отметки у найденных
		Для Каждого наим Из ДополнительныеПараметры.Ответ.НайденныеНаименования Цикл
			масс = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка, Наименование", Истина, наим));
			Для Каждого СтрокаДФК Из масс Цикл
				СтрокаДФК.Пометка = Ложь;
			КонецЦикла;
		КонецЦикла;
		ВыполнитьЗагрузкуЛиний();
		
	Иначе 
		
		// отмена
		Возврат;
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ВыполнитьЗагрузкуЛиний()
	// --- 
	
	// создание новых
	Ответ = _ЗагрузитьЛинии();
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда 
		ЭтаФорма.ОповеститьОЗаписиНового(Ответ.Ссылка);
		_УФК.ВывестиПредупреждение("Добавлено линий: "+Ответ.КоличествоДобавлено);
	Иначе 
		_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПроверитьСуществованиеЗагружаемыхЛиний()
	
	//массНаименования = ТаблицаЗагрузки.Выгрузить(Новый Структура("Пометка", Истина), "Наименование").ВыгрузитьКолонку("Наименование");
	//
	//з = Новый Запрос(
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	CW_Линии.Наименование
	//	|ИЗ
	//	|	Справочник.CW_Линии КАК CW_Линии
	//	|ГДЕ
	//	|	CW_Линии.Наименование В(&массНаименования)"
	//);
	//з.УстановитьПараметр("массНаименования", массНаименования);
	//тз = з.Выполнить().Выгрузить();
	
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаЗагрузки.Наименование КАК НаименованиеИзКоллекции
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	&ТаблицаЗагрузки КАК ТаблицаЗагрузки
		|ГДЕ
		|	ТаблицаЗагрузки.Пометка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CW_Линии.Наименование КАК НаименованиеИзСправочника,
		|	вт.НаименованиеИзКоллекции
		|ИЗ
		|	Справочник.CW_Линии КАК CW_Линии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО CW_Линии.Наименование = вт.НаименованиеИзКоллекции"
	);
	з.УстановитьПараметр("ТаблицаЗагрузки", ТаблицаЗагрузки.Выгрузить(Новый Структура("Пометка", Истина)));
	тз = з.Выполнить().Выгрузить();
	//рз = з.Выполнить();
	//выб = рз.Выбрать();
	
	
	Если тз.Количество()=0 Тогда 
		Возврат _УФКС.Ответ();
		
	Иначе 
		КоличествоУжеСуществует = тз.Количество();
		ОтображатьNПервых = 8;
		стр="";
		Для ы=0 По Мин(КоличествоУжеСуществует, ОтображатьNПервых)-1 Цикл
			СтрокаТЗ = тз[ы];
			стр = стр + Символы.ПС + тз[ы].НаименованиеИзСправочника;
		КонецЦикла;
		Если КоличествоУжеСуществует>ОтображатьNПервых Тогда 
			стр = стр + Символы.ПС + "и ещё "+(КоличествоУжеСуществует-ОтображатьNПервых)+"...";
		КонецЕсли;
		
		СтруктураОтвета = _УФКС.Ответ(КоличествоУжеСуществует, стр);
		СтруктураОтвета.Вставить("НайденныеНаименования", тз.ВыгрузитьКолонку("НаименованиеИзКоллекции"));
		Возврат СтруктураОтвета;
	
	КонецЕсли;
	
	
КонецФункции

&НаСервере
Функция _ЗагрузитьЛинии()
	
	Ответ = _УФКС.Ответ();
	Ответ.Вставить("Ссылка", Справочники.CW_Линии.ПустаяСсылка()); // достаточно вернуть хотя бы одну ссылку
	Ответ.Вставить("КоличествоДобавлено", 0);

	массСтрок = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина));	
	Для Каждого строкаДФК Из массСтрок Цикл
		об = Справочники.CW_Линии.НайтиПоНаименованию(строкаДФК.Наименование);
		Если ЗначениеЗаполнено(об) Тогда
			об = об.ПолучитьОбъект();
		Иначе
			об = Справочники.CW_Линии.СоздатьЭлемент();		
		КонецЕсли;
		об.Наименование = строкаДФК.Наименование;
		об.АдресСайта   = строкаДФК.АдресСайта;
		
		Попытка
			об.Записать();
			//Ответ.Ссылка = об.Ссылка;
			Ответ.КоличествоДобавлено = Ответ.КоличествоДобавлено + 1;
		Исключение
			Возврат _УФКС.Ответ(1, ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Процедура НажатьНаСервере()
	Wsh = Новый COMОбъект("Wscript.shell");
	Wsh.SendKeys("^+а");   
	Wsh.SendKeys("^+f");
КонецПроцедуры	