
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоКонтрольныеДаты = Истина;
	_СформироватьСписокТипов();
	
КонецПроцедуры

&НаСервере
Процедура _СформироватьСписокТипов()
	// --- 
	
	СписокТиповПеревозок.Очистить();
	// --- 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ТипыПеревозок.Ссылка
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок КАК CW_ТипыПеревозок
	               |ГДЕ
	               |	CW_ТипыПеревозок.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ТипыПеревозок.Наименование";
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из ТЗ Цикл
		
		СписокТиповПеревозок.Добавить(Стр.Ссылка,Строка(Стр.Ссылка));
		
	КонецЦикла; 
	
	СписокТиповПеревозок.Добавить(Справочники.CW_ТипыПеревозок.ПустаяСсылка(),"<без типа>");
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура СписокТиповПеревозокПриАктивизацииСтроки(Элемент)
	
	Если (Элементы.СписокТиповПеревозок.ТекущаяСтрока <> ТекущийТипГрузоперевозки) Тогда
		ТекущийТипГрузоперевозки = Элементы.СписокТиповПеревозок.ТекущаяСтрока;
		_СформироватьСписокПараметров();	
	КонецЕсли; 
	//ПодключитьОбработчикОжидания("АктивизацияСтрокиТипа",0.1,Истина);
	
КонецПроцедуры
 
&НаКлиенте
Процедура АктивизацияСтрокиТипа() Экспорт 
	// --- 
	
	ТекущийТипГрузоперевозки = Элементы.СписокТиповПеревозок.ТекущаяСтрока;
	_СформироватьСписокПараметров();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _СформироватьСписокПараметров()
	// --- 
	
	Если (ЗначениеЗаполнено(ТекущийТипГрузоперевозки)) Тогда
		
		ТЗПараметров = ТекущийТипГрузоперевозки.ПараметрыГрузоперевозки.Выгрузить();
		Если (ТолькоКонтрольныеДаты) Тогда
			
			МассивУдаляемых = Новый Массив;
			Для каждого Стр Из ТЗПараметров Цикл
				Если (НЕ Стр.Параметр.ЭтоКонтрольнаяДата) Тогда
					МассивУдаляемых.Добавить(Стр);
				КонецЕсли; 
			КонецЦикла; 
			_сф.к_УдалитьЭлементыПоМассиву(ТЗПараметров,МассивУдаляемых);
			
		КонецЕсли; 
		ПараметрыГрузоперевозок.Загрузить(ТЗПараметров);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ПараметрыГрузоперевозок.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
		|ГДЕ
		|	CW_ПараметрыГрузоперевозок.ЭтоКонтрольнаяДата = ИСТИНА
		|	И CW_ПараметрыГрузоперевозок.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	CW_ПараметрыГрузоперевозок.Наименование";
		ТЗПараметров = Запрос.Выполнить().Выгрузить();
		ПараметрыГрузоперевозок.Загрузить(ТЗПараметров); 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура ПараметрыГрузоперевозокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЭтаФорма.Закрыть(Элементы.ПараметрыГрузоперевозок.ТекущиеДанные.Параметр);
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	Если (Элементы.ПараметрыГрузоперевозок.ТекущиеДанные <> Неопределено) Тогда
		ЭтаФорма.Закрыть(Элементы.ПараметрыГрузоперевозок.ТекущиеДанные.Параметр);	
	КонецЕсли; 
	
КонецПроцедуры
 