#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	ЭтоВерсияКОРП = ВариантыПриложений.ЭтоВерсияКОРП();
	ЭтоВерсияПРОФ = ВариантыПриложений.ЭтоВерсияПРОФ();
	
	//Обязательные
	Объект_AF_AddProp = Справочники.CW_ОбязательныеРасширения.AF_AddProp.ПолучитьОбъект();
	Объект_AF_AddProp.Наименование 			= "AddProp";
	Объект_AF_AddProp.Описание     			= "Использование дополнительных реквизитов в документах ""Движение денежных средства"", ""Доходы по грузоперевозке"" и ""Расходы по грузоперевозке""";
	Объект_AF_AddProp.Используется 			= Истина;
	Объект_AF_AddProp.Обязательное 			= Истина;
	Объект_AF_AddProp.РасширениеДоступно 	= ЭтоВерсияКОРП или ЭтоВерсияПРОФ;
	Объект_AF_AddProp.Записать();
	
	Объект_AF_AddSP = Справочники.CW_ОбязательныеРасширения.AF_AddSP.ПолучитьОбъект();
	Объект_AF_AddSP.Наименование 		= "AddSP";
	Объект_AF_AddSP.Описание     		= "Установка параметров сеанса модуля ""Бухгалтерия экспедитора""";
	Объект_AF_AddSP.Используется 		= Истина;
	Объект_AF_AddSP.Обязательное 		= Истина;
	Объект_AF_AddSP.РасширениеДоступно 	= ЭтоВерсияКОРП или ЭтоВерсияПРОФ;
	Объект_AF_AddSP.Записать();
	
	Объект_AF_AddCorp = Справочники.CW_ОбязательныеРасширения.AF_AddCorp.ПолучитьОбъект();
	Объект_AF_AddCorp.Наименование 		= "AF_AddCorp";
	Объект_AF_AddCorp.Описание     		= "Расширение для версии КОРП";
	Объект_AF_AddCorp.Используется 		= ЭтоВерсияКОРП;
	Объект_AF_AddCorp.Обязательное 		= ЭтоВерсияКОРП;
	Объект_AF_AddCorp.РасширениеДоступно= ЭтоВерсияКОРП;
	Объект_AF_AddCorp.Записать();
	//---Обязательные

	
	Объект_AF_AddEDI = Справочники.CW_ОбязательныеРасширения.AF_AddEDI.ПолучитьОбъект();
	Объект_AF_AddEDI.Наименование 		= "AddEDI";
	Объект_AF_AddEDI.Описание     		= "Использование обмена ЭДО в документах ""Движение денежных средства"", ""Доходы по грузоперевозке"" и ""Расходы по грузоперевозке""";
	Объект_AF_AddEDI.Используется 		= РасширениеУстановлено("AF_AddEDI");
	Объект_AF_AddEDI.РасширениеДоступно	= ЭтоВерсияКОРП или ЭтоВерсияПРОФ;
	Объект_AF_AddEDI.Записать();
	
 	Объект_AF_AddUSN = Справочники.CW_ОбязательныеРасширения.AF_AddUSN.ПолучитьОбъект();
	Объект_AF_AddUSN.Наименование 		= "AddUSN";
	Объект_AF_AddUSN.Описание     		= "Использование одновременного отражения взаиморасчетов по одному договору на разных счетах учета (62 и 76) при применении УСН в документе ""Поступление на расчетный счет""";
	Объект_AF_AddEDI.Используется 		= РасширениеУстановлено("AF_AddUSN");
	Объект_AF_AddUSN.РасширениеДоступно	= ЭтоВерсияКОРП или ЭтоВерсияПРОФ;
	Объект_AF_AddUSN.Записать(); 
	
КонецПроцедуры   

Функция РасширениеУстановлено(Имя) Экспорт 
	
	Отбор = Новый Структура;
	Отбор.Вставить("Имя", Имя); 
	
	УстановитьПривилегированныйРежим(Истина);
	НайденныеРасширения = РасширенияКонфигурации.Получить(Отбор); 
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НайденныеРасширения.Количество() > 0;
	
КонецФункции

Функция ПолучитьЗагружаемыеРасширения() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОбязательныеРасширения.ИмяПредопределенныхДанных КАК ИмяРасширения
	|ИЗ
	|	Справочник.CW_ОбязательныеРасширения КАК CW_ОбязательныеРасширения
	|ГДЕ
	|	CW_ОбязательныеРасширения.Используется = ИСТИНА
	|	И CW_ОбязательныеРасширения.ПометкаУдаления = ЛОЖЬ";   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивИменРасширений = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ИмяРасширения");  
	
	Возврат МассивИменРасширений;
	
КонецФункции

Функция ОбязательныеРасширенияУстановлены() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОбязательныеРасширения.ИмяПредопределенныхДанных КАК ИмяРасширения
	|ИЗ
	|	Справочник.CW_ОбязательныеРасширения КАК CW_ОбязательныеРасширения
	|ГДЕ
	|	CW_ОбязательныеРасширения.Обязательное = ИСТИНА
	|	И CW_ОбязательныеРасширения.Используется = ИСТИНА"; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		ИмяМодуля = СокрЛП(Выборка.ИмяРасширения)+"_ОбщегоНазначения";
		Попытка
			ОбщийМодуль = Вычислить(ИмяМодуля);
		Исключение 
		КонецПопытки; 
		
		Если ОбщийМодуль = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;

	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
#КонецЕсли