&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПараметров = Новый Структура("Заказ,ВерсияБюджета,Обработка");
	
	Заказ    		= Параметры.Заказ;
	ВерсияБюджета   = Параметры.ВерсияБюджета;
	Обработка 		= Параметры.Обработка;

	ПараметрыВыполнения = ПолучитьПараметрвыВыполнения(Обработка);
	ВыполнятьВФоне 		= ПараметрыВыполнения.ВыполнятьВФоне;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрвыВыполнения(Обработка)
	
	СтруктураКоманды = Новый Структура;
	
	//Дополнительная информация по обработке
	ОбработкаОбъект 		= _ПО.ПолучитьОбработку(Обработка);
	ИнформацияОбОбработке 	= ОбработкаОбъект.Информация();
	
	ВФоне = Ложь;
	Если ИнформацияОбОбработке.Свойство("ВыполнятьВФоне") Тогда
		ВФоне = ИнформацияОбОбработке.ВыполнятьВФоне;	
	КонецЕсли;
	
	СтруктураКоманды.Вставить("ВыполнятьВФоне",ВФоне);
	
	Возврат СтруктураКоманды;

КонецФункции

&НаКлиенте
Процедура ПродолжитьЗаполнение(Команда)
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("Заказ", Заказ);
	СтруктураПараметров.Вставить("ВерсияБюджета", ВерсияБюджета);
	СтруктураПараметров.Вставить("Обработка", Обработка);
	
	Если ВыполнятьВФоне Тогда
		
		РезультатВыполнения =  ПродолжитьЗаполнениеБюджетаНаСервереВФоне(СтруктураПараметров);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗаполненияБюджета", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
		
	Иначе
		
		Ответ = ПродолжитьЗаполнениенаСервере();
		ЭтаФорма.Закрыть(Ответ);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПродолжитьЗаполнениеБюджетаНаСервереВФоне(ПараметрыПроцедуры)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Заполнение бюджета заказа";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_Заказы.ПодключаемыеКоманды_ЗаполнитьБюджет", ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатЗаполненияБюджета(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ЭтаФорма.Закрыть(ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Бюджеты не заполнены!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Ответ =	Новый Структура("Код, ОписаниеОшибки", 1,"ТекстПредупреждения");
		
		ЭтаФорма.Закрыть(Ответ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПродолжитьЗаполнениенаСервере()
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("Заказ", 			Заказ);
	СтруктураПараметров.Вставить("ВерсияБюджета", 	ВерсияБюджета);
	СтруктураПараметров.Вставить("Обработка", 		Обработка);

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
			
	Ответ = ОбработкаОбъект.ЗаполнитьБюджет(СтруктураПараметров);
	
	Возврат Ответ;

КонецФункции




