
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Если Не Параметры.Свойство("РедактируемыеРеквизиты") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;       
	
	ИсключитьПустоеЗначение = Новый Массив;
	ИсключитьПустоеЗначение.Добавить("");
	ТаблицаКодовОпераций0.Загрузить(УчетНДС.КлассификаторКодовОперацийПоСтавке0(ТекущаяДата(),,ИсключитьПустоеЗначение));
	
	Для Каждого ДанныеРеквизита из Параметры.РедактируемыеРеквизиты Цикл
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита		= ДанныеРеквизита.Имя;
		НоваяСтрока.ЗаголовокРеквизита	= ДанныеРеквизита.Заголовок;
		НоваяСтрока.ЗначениеРеквизита	= ДанныеРеквизита.Значение;

		//ЗначениеРеквизита = НоваяСтрока.ЗначениеРеквизита;	
		//НоваяСтрока.ЗначениеРеквизита 	= ДанныеРеквизита.ТипЗначения.ПривестиЗначение(ЗначениеРеквизита);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)  
	
	Структура = Новый Структура;
	Для Каждого СтрокаТаблицы из ТаблицаРеквизитов Цикл    
		Если СтрокаТаблицы.Выбор = Истина Тогда 
			Структура.Вставить(СтрокаТаблицы.ИмяРеквизита, СтрокаТаблицы.ЗначениеРеквизита);	
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Закрыть(Структура);
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	
	Если ТекущиеДанные.ИмяРеквизита = "ПериодОтчета" Тогда 
		ТекущиеДанные.ЗначениеРеквизита = НачалоКвартала(ТекущиеДанные.ЗначениеРеквизита);	
	КонецЕсли;   
	
	ТекущиеДанные.Выбор = ЗначениеЗаполнено(ТекущиеДанные.ЗначениеРеквизита);  
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	
	Если ТекущиеДанные.ИмяРеквизита = "КодВидаОперации" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок",          "Выбор кода операции НДС 0%");
		ПараметрыФормы.Вставить("ТаблицаЗначений",    ТаблицаКодовОпераций0);
		ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура()); 
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущаяСтрока", Элементы.ТаблицаРеквизитов.ТекущаяСтрока);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиКодОперации0Завершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы",	ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры   


&НаКлиенте
Процедура ВвестиКодОперации0Завершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = ТаблицаРеквизитов.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	СтрокаТаблицы.ЗначениеРеквизита = РезультатВыбора.Код;
	СтрокаТаблицы.Выбор = ЗначениеЗаполнено(СтрокаТаблицы.ЗначениеРеквизита);  
	
КонецПроцедуры   



