//События формы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	СостояниеДокумента	= ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	ВедениеБухгалтескогоУчетаМСФО 	= ПолучитьФункциональнуюОпцию("CW_ВедениеБухгалтескогоУчетаМСФО");
	Если ВедениеБухгалтескогоУчетаМСФО Тогда
		ИмяНастроек 		= "Настойки_CW_ОперацииМСФО";
		СтруктураНастройки 	= Обработки.CW_ОперацииМСФО.ПолучитьНастройки(ИмяНастроек);
		НастройкиМСФО.Добавить(СтруктураНастройки);
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Организация = CW_Настройки.ОсновнаяОрганизация();
	Конецесли;
	
	ОбновитьИтогиНаСервере();
	УправлениеЭлементамиФормы();
	СформироватьЗаголовокНаСервере();
	УстановитьОтборДоговораНаСервере();
	
	Если Не ЭтаФорма.ТолькоПросмотр тогда
		ЭтаФорма.ТолькоПросмотр = Не CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_ОперативныйУчет");
	КонецЕсли;   
	
	АдресТаблицыДокумента = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	#Область МСФО_Модуль
	СчетПриИзмененииНаСервере();
	УстановитьВидимостьНДС();
	УчитыватьНДСПриИзмененииНаСервере();
	#КонецОбласти    
	
	УстановитьДоступныеТипыДокументаРасшифровки();
	
	//Взаиморасчеты по документу
	CW_ВзаиморасчетыПоДокументуСервер.УстановитьНазваниеСсылкиОтчета(ЭтаФорма);
	//Взаиморасчеты по документу
	
	//Подсистема.ДополнительныеРеквизиты
	ИспользоватьДопРеквизиты = CW_ДополнительныеРеквизитыСлужебный.ИспользуютсяДополниительныеРеквизиты();
	//Подсистема.ДополнительныеРеквизиты
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ПроизвольныйОбъект", НЕ ИспользоватьДопРеквизиты); 
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ИспользоватьДопРеквизиты Тогда
		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
		// Конец СтандартныеПодсистемы.Свойства
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Взаиморасчеты по документу
	CW_ВзаиморасчетыПоДокументуСервер.УстановитьНазваниеСсылкиОтчета(ЭтаФорма);
	//Взаиморасчеты по документу
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	СформироватьЗаголовокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
		
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
//--- События формы


&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	//Реквизиты валюта кассы
	ВалютаКассы 					= Объект.Касса.Валюта;
	Элементы.СуммаВК.Доступность 	= Объект.Касса.Валюта <> Объект.Валюта;
	Элементы.СуммаВК.Заголовок 		= "Сумма";
	
	Если ЗначениеЗаполнено(ВалютаКассы) Тогда
		Элементы.СуммаВК.Заголовок = Элементы.СуммаВК.Заголовок + ", " + Строка(ВалютаКассы);	
	КонецЕсли;    
	
	Элементы.РасшифровкаСуммаВК.Заголовок = Элементы.СуммаВК.Заголовок;
	//---Реквизиты валюта кассы
	
	
	//Реквизиты валюта договора
	ВалютаДоговора = Объект.Договор.ВалютаДоговора;
	Элементы.СуммаВД.Доступность = ЗначениеЗаполнено(ВалютаДоговора);
	Элементы.СуммаВД.Заголовок = "Сумма";
	
	Если ЗначениеЗаполнено(ВалютаДоговора) Тогда
		Элементы.СуммаВД.Заголовок = Элементы.СуммаВД.Заголовок + ", " + Строка(ВалютаДоговора);	
	КонецЕсли;
	Элементы.РасшифровкаСуммаВД.Заголовок = Элементы.СуммаВД.Заголовок;
	//---Реквизиты валюта договора  
	
	
	ВидимостьВалютыДоговора = ЗначениеЗаполнено(ВалютаКассы) 
	И ЗначениеЗаполнено(ВалютаДоговора)
	И ВалютаКассы <>  ВалютаДоговора;
	
	Элементы.СуммаВД.Видимость 				= ВидимостьВалютыДоговора;
	Элементы.РасшифровкаСуммаВД.Видимость 	= ВидимостьВалютыДоговора;
	
	Элементы.СтраницаКомментарий.Заголовок	= " Комментарий" +?(ЗначениеЗаполнено(Объект.Комментарий)," (*)","");
	
КонецПроцедуры

&НаСервере
Функция ОбновитьИтогиНаСервере()
	
	ИтогоСуммаВК = Объект.Расшифровка.Итог("СуммаВК");
	
	мСтроки = Новый Массив;
	мСтроки.Добавить("Возвращено:");   
	мСтроки.Добавить(Формат(Объект.Расшифровка.Итог("СуммаВК"),"ЧЦ=15; ЧДЦ=2; ЧН=")); 
	мСтроки.Добавить(Строка(Объект.Касса.Валюта));   
	
	Итого = СтрСоединить(мСтроки, " "); 
	
	Если Объект.Касса.Валюта = Объект.Валюта Тогда
		Объект.СуммаВК = ИтогоСуммаВК;	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СформироватьЗаголовокНаСервере()
	
	ЭтаФорма.Заголовок = 
	"Движение денежных средств" + " " 
	+ ?(ЗначениеЗаполнено(Объект.ВидОперации), "("+нрег(Объект.ВидОперации)+")", "")
	+ ?(ЗначениеЗаполнено(Объект.Ссылка), " "+Объект.Номер+" от "+Объект.Дата, " (создание)")
	
КонецФункции



//При изменении элементов на форме 
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииКонтрагентаНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	УправлениеЭлементамиФормы();  
	
КонецПроцедуры  

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	//Подсистема.УчетПриложенийДоговоров
	Объект.Валюта = CW_УчетПриложенийДоговоровСервер.ПолучитьВалютуПриложенияДоговора(Объект.ПриложениеКДоговору, Объект.Договор);
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииДоговораНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	СформироватьЗаголовокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СформироватьЗаголовокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры 

&НаКлиенте
Процедура РасшифровкаПриИзменении(Элемент)
	
	ОбновитьИтогиНаСервере();
	
КонецПроцедуры

//Подсистема.УчетПриложенийДоговоров
&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров

&НаСервере
Функция УстановитьОтборДоговораНаСервере()
	
	мПараметрыВыбора = Новый Массив;
	
	Если Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ВозвратОтПоставщика Тогда
		
		МассивЗначений = Новый Массив;
		МассивЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
		
		ФиксированныйМассив = Новый ФиксированныйМассив(МассивЗначений);
		
		мПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ФиксированныйМассив));
		
	ИначеЕсли Объект.ВидОперации = Перечисления.CW_ВидыОперацийДДС.ВозвратПокупателю Тогда
		
		МассивЗначений = Новый Массив;
		МассивЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
		
		ФиксированныйМассив = Новый ФиксированныйМассив(МассивЗначений);
		
		мПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ФиксированныйМассив));
		
	КонецЕсли; 
	
	Элементы.Договор.ПараметрыВыбора =  Новый ФиксированныйМассив(мПараметрыВыбора);
	
КонецФункции

//---При изменении элементов на форме

&НаСервере
Процедура УстановитьДоступныеТипыДокументаРасшифровки()
	
	ОграничениеТипа = ПолучитьОграниченияТипа();
	Элементы.РасшифровкаДокумент.ОграничениеТипа  = Новый ОписаниеТипов(ОграничениеТипа);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОграниченияТипа()
	
	ОграничениеТипа = Новый Массив;    
	Если Объект.Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем") Тогда
		ОграничениеТипа.Добавить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"));  
	ИначеЕсли Объект.Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда
		ОграничениеТипа.Добавить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"));  
	Иначе
		ОграничениеТипа.Добавить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"));  
		ОграничениеТипа.Добавить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"));  
	КонеЦЕсли; 
	
	ОграничениеТипа.Добавить(Тип("ДокументСсылка.CW_Оплата"));
	ОграничениеТипа.Добавить(Тип("ДокументСсылка.CW_ДвижениеДенежныхСредств"));
	
	Возврат ОграничениеТипа;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьТабличнуюЧасть(Команда)
	
	Объект.Расшифровка.Очистить();
	ОбновитьИтогиНаСервере();
	РассчитатьСуммуВВалютеДоговора();
	
КонецПроцедуры



&НаКлиенте
Процедура РасшифровкаСуммаВКПриИзменении(Элемент)  
	
	ТекущаяСтрока = Элементы.Расшифровка.ТекущаяСтрока;
	РасшифровкаСуммаВКПриИзмененииНаСервере(ТекущаяСтрока);
	
КонецПроцедуры 

&НаСервере
Процедура РасшифровкаСуммаВКПриИзмененииНаСервере(ТекущаяСтрока)  
	
	СтрокаТекущая = Объект.Расшифровка.НайтиПоИдентификатору(ТекущаяСтрока);
	
	СуммаВВалютеДоговора = СтрокаТекущая.СуммаВК;
	
	Если Объект.Касса.Валюта <>  Объект.Договор.ВалютаДоговора Тогда
		СуммаВВалютеДоговора = Объект.СуммаВД;	
	КонецЕсли;  
	
	СтрокаТекущая.СуммаВД = СуммаВВалютеДоговора; 
	
	РассчитатьСуммуВВалютеДоговора();
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти 

#Область МСФО_Модуль

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	СчетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СчетПриИзмененииНаСервере()
	
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоШапкиПриИзмененииСчета(
	ЭтотОбъект, ЭтотОбъект.Объект, ПараметрыУстановкиСвойствСубконто(ЭтотОбъект));
	
	УстановитьВидимостьКоличества();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКоличества()
	
	Элементы.Количество.Видимость = Объект.Счет.Количественный; 
	
КонецПроцедуры

&НаСервере
Функция ПараметрыУстановкиСвойствСубконто(Форма, Постфикс = "") Экспорт
	
	Результат = CW_БухгалтерскийУчетКлиентСерверМСФО.ПараметрыУстановкиСвойствСубконтоПоШаблону(
	"Субконто"  	+ Постфикс,
	"Подразделение" + Постфикс,
	"Субконто",
	"Подразделение",
	"Счет");
	
	Результат.ДопРеквизиты.Вставить("Организация", Форма.Объект.Организация);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Субконто1ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто2ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто3ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСубконто(Форма, НомерСубконто)
	
	тОбъект = Форма.Объект;
	
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоШапкиПриИзмененииСубконто(
	Форма, тОбъект, НомерСубконто, ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере());
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	тОбъект = Форма.Объект;
	
	ДанныеОбъекта = CW_БухгалтерскийУчетКлиентСерверМСФО.ДанныеУстановкиПараметровСубконто(
	тОбъект, ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере()
	Возврат  ПараметрыУстановкиСвойствСубконто(ЭтотОбъект, "");
КонецФункции

&НаКлиенте
Процедура РассчитатьНДС(Команда)
	РассчитатьНДСНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьНДСНаСервере()
	
	ТекСтавкаНДС  	= CW_Финансы.ПолучитьСтавкуНДС(Объект.СтавкаНДС);
	ЦенаСНДС 		= Объект.СуммаВК;
	Объект.СуммаНДС	= Окр(ЦенаСНДС /(100+ТекСтавкаНДС)*ТекСтавкаНДС, 2, 1);
	
КонецПроцедуры

&НаСервере
Процедура УчитыватьНДСПриИзмененииНаСервере()
	
	Элементы.ГруппаУчетНДС.Видимость = Объект.УчитыватьНДС;
	
	Если Объект.УчитыватьНДС Тогда
		//Заполняем счета МСФО
		Если НастройкиМСФО.Количество() > 0 Тогда
			ЭлементСписка 		= НастройкиМСФО.Получить(0);
			СтруктураНастроек 	= ЭлементСписка.Значение;
			
			Если Не ЗначениеЗаполнено(Объект.СчетНДС) и СтруктураНастроек.Свойство("СчетУчетаНДС") Тогда
				Объект.СчетНДС = СтруктураНастроек.СчетУчетаНДС;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСПриИзменении(Элемент)
	
	УчитыватьНДСПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СтавкаНДСПриИзмененииНаСервере()
	РассчитатьНДСНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	СтавкаНДСПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтразитьВСоставеРасходовПоПриобретениямПриИзмененииНаСервере()
	УстановитьВидимостьНДС();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНДС()
	
	Элементы.ГруппаНДСМСФО.Видимость = Объект.ОтразитьВСоставеРасходовПоПриобретениям;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВСоставеРасходовПоПриобретениямПриИзменении(Элемент)
	ОтразитьВСоставеРасходовПоПриобретениямПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуПуоступления(Команда)
	РассчитатьСуммуПоступленияНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуПоступленияНаСервере()
	
	ВалютаКассыСписания 	= Объект.Касса.Валюта;
	ВалютаКассыПоступления 	= Объект.КассаПоступления.Валюта;
	
	ДатаКурса	 					= ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	СтруктураКурсаКассы 			= CW_Финансы.ПолучитьКурсВалюты(ВалютаКассыСписания,ДатаКурса);
	СтруктураКурсаКассыПоступления 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаКассыПоступления,ДатаКурса);
	
	Объект.СуммаВД = CW_Финансы.ПересчитатьИзВалютыВВалюту(Объект.СуммаВК, ВалютаКассыСписания, ВалютаКассыПоступления,СтруктураКурсаКассы.Курс, СтруктураКурсаКассыПоступления.Курс,СтруктураКурсаКассы.Кратность, СтруктураКурсаКассыПоступления.Кратность);
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

//Взаиморасчеты по документу
&НаКлиенте
Процедура Команда_ВзаиморасчетыПоДокументу(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда   
		Возврат;
	КонецЕсли;   
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ВозвратПокупателю") Тогда
		ВидЗадолженности ="ДЕБИТОРСКАЯ";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ВозвратПоставщику") Тогда
		ВидЗадолженности ="КРЕДИТОРСКАЯ";
	КонеЦЕсли;	
	
	CW_ВзаиморасчетыПоДокументуКлиент.ОткрытьФормуОтчетаВзаиморасчетыПоДокументу(ЭтаФорма, Объект.Ссылка, ВидЗадолженности);
	
КонецПроцедуры
//Взаиморасчеты по документу 


&НаКлиенте
Процедура Подбор(Команда) 
	
	МассивОграничениеТипа = ПолучитьОграниченияТипа(); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборТипаДокумента", ЭтотОбъект);
	
	СписокТиповДокумента = Новый СписокЗначений;
	СписокТиповДокумента.ЗагрузитьЗначения(МассивОграничениеТипа);
	СписокТиповДокумента.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите тип документа");
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗавершитьВыборТипаДокумента(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;          
	
	ТипОбъекта = РезультатВыбора.Значение;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТипОбъекта", ТипОбъекта);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборДокументов", ЭтотОбъект, ДополнительныеПараметры);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Проведен",		Истина);
	Отбор.Вставить("Организация",	Объект.Организация);
	Отбор.Вставить("Контрагент", 	Объект.Контрагент);
	Отбор.Вставить("Договор",		Объект.Договор);
	
	Если ЗначениеЗаполнено(Объект.ПриложениеКДоговору) Тогда
		Отбор.Вставить("ПриложениеКДоговору", 	Объект.ПриложениеКДоговору);
	КонецЕсли; 
	
	Если ТипОбъекта = тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		Отбор.Вставить("ФормируетсяСчет", Истина);
	КонецЕсли;
	Если ТипОбъекта = тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		Отбор.Вставить("ПредъявленСчет", Истина);
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;    
	СтруктураПараметров.Вставить("РежимВыбора", 		Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", 	Истина);
	СтруктураПараметров.Вставить("Отбор", 				Отбор);
	
	ИмяОбъекта = ПолучитьИмяОбъектаПоТипуНаСервере(ТипОбъекта);  
	ОткрытьФорму("Документ."+ИмяОбъекта+".ФормаВыбора",СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры         

&НаСервере
Функция ПолучитьИмяОбъектаПоТипуНаСервере(Знач Тип)
	
	ПолноеИмя  = Метаданные.НайтиПоТипу(Тип).ПолноеИмя();
	ИмяОбъекта = СтрРазделить(ПолноеИмя, ".")[1];
	
	Возврат ИмяОбъекта;
	
КонецФункции  

&НаКлиенте
Процедура ОбработатьВыборДокументов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ОбработатьВыборДокументовНаСервере(РезультатВыбора, ДополнительныеПараметры);
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьВыборДокументовНаСервере(РезультатВыбора, ДополнительныеПараметры) 
	
	Если РезультатВыбора.Найти(Объект.Ссылка) <> Неопределено Тогда
		РезультатВыбора.Удалить(РезультатВыбора.Найти(Объект.Ссылка));
	КонецЕсли; 
	
	Если РезультатВыбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДокумента = ПодготовитьТаблицуДляЗаполнения(РезультатВыбора, ДополнительныеПараметры); 
	Для Каждого СтрокаТаблицы из ТаблицаДокумента Цикл 
		
		Отбор = Новый Структура("Документ, Счет");
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
		
		НайденныеСтроки = Объект.Расшифровка.НайтиСтроки(Отбор);  
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.Расшифровка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы); 
		КонецЕсли;
		
	КонецЦикла;
	
	РассчитатьСуммуВВалютеДоговора();
	
КонецПроцедуры  

&НаСервере
Функция ПодготовитьТаблицуДляЗаполнения(РезультатВыбора, ДополнительныеПараметры) 
	
	ДатаСреза 			= ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());  
	ТаблицаДокумента 	= ПолучитьПустуюТаблицуДокумента();

	Если ДополнительныеПараметры.ТипОбъекта = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка КАК Документ,
		               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.ПредставлениеДокумента КАК Представление,
		               |	CW_ДоходыПоГрузоперевозкеУслуги.СчетЗадолженности КАК СчетЗадолженности,
		               |	СУММА(CW_ДоходыПоГрузоперевозкеУслуги.Всего) КАК СуммаВД
		               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
		               |ИЗ
		               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
		               |ГДЕ
		               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка В(&РезультатВыбора)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка,
		               |	CW_ДоходыПоГрузоперевозкеУслуги.СчетЗадолженности
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет КАК Счет,
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.СчетУчета КАК СчетУчета,
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК ВсегоОстаток
		               |ПОМЕСТИТЬ ВТ_Остатки
		               |ИЗ
		               |	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность.Остатки(
		               |			&ДатаСреза,
		               |			(Счет, СчетУчета) В
		               |				(ВЫБРАТЬ
		               |					ВТ_ДанныеДокумента.Документ КАК Счет,
		               |					ВТ_ДанныеДокумента.СчетЗадолженности КАК СчетУчета
		               |				ИЗ
		               |					ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК CW_ОперативнаяДебиторскаяЗадолженностьОстатки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ДанныеДокумента.Документ КАК Документ,
		               |	ВТ_ДанныеДокумента.Представление КАК Представление,
		               |	ВТ_ДанныеДокумента.СчетЗадолженности КАК Счет,
		               |	ВТ_ДанныеДокумента.СуммаВД - ЕСТЬNULL(ВТ_Остатки.ВсегоОстаток, 0) КАК СуммаВД
		               |ИЗ
		               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		               |		ПО ВТ_ДанныеДокумента.Документ = ВТ_Остатки.Счет
		               |			И ВТ_ДанныеДокумента.СчетЗадолженности = ВТ_Остатки.СчетУчета
		               |ГДЕ
		               |	ВТ_ДанныеДокумента.СуммаВД - ЕСТЬNULL(ВТ_Остатки.ВсегоОстаток, 0) <> 0";
		
		
		Запрос.УстановитьПараметр("РезультатВыбора", РезультатВыбора);
		Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
		
		ВалютаКассы			= Объект.Касса.Валюта;
		СтруктураКурсаКассы	= CW_Финансы.ПолучитьКурсВалюты(ВалютаКассы, ДатаСреза);
		
		ВалютаДоговора			= Объект.Договор.ВалютаДоговора;
		СтруктураКурсаДоговора	= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора, ДатаСреза);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Отбор = Новый Структура("Документ, Счет");
			ЗаполнитьЗначенияСвойств(Отбор, Выборка);
			
			НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);  
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаДокумента.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				НоваяСтрока.УникальныйИдентификатор = Новый УникальныйИдентификатор;
				
				НоваяСтрока.СуммаВК = CW_Финансы.ПересчитатьИзВалютыВВалюту(
											Выборка.СуммаВД, 
											ВалютаКассы, 
											ВалютаДоговора, 
											СтруктураКурсаКассы.Курс, 
											СтруктураКурсаДоговора.Курс, 
											СтруктураКурсаКассы.Кратность, 
											СтруктураКурсаДоговора.Кратность);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТипОбъекта = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка КАК Документ,
		               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.ПредставлениеДокумента КАК Представление,
		               |	CW_РасходыПоГрузоперевозкеУслуги.СчетЗадолженности КАК СчетЗадолженности,
		               |	СУММА(CW_РасходыПоГрузоперевозкеУслуги.Всего) КАК СуммаВД
		               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
		               |ИЗ
		               |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
		               |ГДЕ
		               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка В(&РезультатВыбора)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка,
		               |	CW_РасходыПоГрузоперевозкеУслуги.СчетЗадолженности
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет КАК Счет,
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.СчетУчета КАК СчетУчета,
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК ВсегоОстаток
		               |ПОМЕСТИТЬ ВТ_Остатки
		               |ИЗ
		               |	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность.Остатки(
		               |			&ДатаСреза,
		               |			(Счет, СчетУчета) В
		               |				(ВЫБРАТЬ
		               |					ВТ_ДанныеДокумента.Документ КАК Счет,
		               |					ВТ_ДанныеДокумента.СчетЗадолженности КАК СчетУчета
		               |				ИЗ
		               |					ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК CW_ОперативнаяДебиторскаяЗадолженностьОстатки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ДанныеДокумента.Документ КАК Документ,
		               |	ВТ_ДанныеДокумента.Представление КАК Представление,
		               |	ВТ_ДанныеДокумента.СчетЗадолженности КАК Счет,
		               |	ВТ_ДанныеДокумента.СуммаВД - ЕСТЬNULL(ВТ_Остатки.ВсегоОстаток, 0) КАК СуммаВД
		               |ИЗ
		               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		               |		ПО ВТ_ДанныеДокумента.Документ = ВТ_Остатки.Счет
		               |			И ВТ_ДанныеДокумента.СчетЗадолженности = ВТ_Остатки.СчетУчета
		               |ГДЕ
		               |	ВТ_ДанныеДокумента.СуммаВД - ЕСТЬNULL(ВТ_Остатки.ВсегоОстаток, 0) <> 0";
		
		
		Запрос.УстановитьПараметр("РезультатВыбора", РезультатВыбора);
		Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
		
		ВалютаКассы			= Объект.Касса.Валюта;
		СтруктураКурсаКассы	= CW_Финансы.ПолучитьКурсВалюты(ВалютаКассы, ДатаСреза);
		
		ВалютаДоговора			= Объект.Договор.ВалютаДоговора;
		СтруктураКурсаДоговора	= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора, ДатаСреза);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Отбор = Новый Структура("Документ, Счет");
			ЗаполнитьЗначенияСвойств(Отбор, Выборка);
			
			НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);  
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаДокумента.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				
				НоваяСтрока.УникальныйИдентификатор = Новый УникальныйИдентификатор;
				
				НоваяСтрока.СуммаВК = CW_Финансы.ПересчитатьИзВалютыВВалюту(
											Выборка.СуммаВД, 
											ВалютаКассы, 
											ВалютаДоговора, 
											СтруктураКурсаКассы.Курс, 
											СтруктураКурсаДоговора.Курс, 
											СтруктураКурсаКассы.Кратность, 
											СтруктураКурсаДоговора.Кратность);
				
			КонецЕсли;
			
		КонецЦикла;
	
		
	КонецЕсли;  

	Если ДополнительныеПараметры.ТипОбъекта = Тип("ДокументСсылка.CW_ДвижениеДенежныхСредств")  Тогда  
		
		СтруктураВозвартПокупателю = Новый Структура;
		СтруктураВозвартПокупателю.Вставить("_0", "CW_ОперативнаяДебиторскаяЗадолженность");
		СтруктураВозвартПокупателю.Вставить("_1", "CW_ОплатаИсходящихДокументов");

		СтруктураВозвратОтПоставщика = Новый Структура;
		СтруктураВозвратОтПоставщика.Вставить("_0", "CW_ОперативнаяКредиторскаяЗадолженность");
		СтруктураВозвратОтПоставщика.Вставить("_1", "CW_ОплатаВходящихДокументов");
		
		СоответствиеИмяРегистра = Новый Соответствие;
		СоответствиеИмяРегистра.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ВозвратПокупателю"),		СтруктураВозвартПокупателю);
		СоответствиеИмяРегистра.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ВозвратОтПоставщика"), 	СтруктураВозвратОтПоставщика);

		СтруктураРегистра = СоответствиеИмяРегистра.Получить(Объект.ВидОперации);
		Если СтруктураРегистра = Неопределено Тогда
			ВызватьИсключение "Не удалось определить вид оперативной задолженности!";
		КонецЕсли; 
		
		ВалютаКассы			= Объект.Касса.Валюта;
		СтруктураКурсаКассы	= CW_Финансы.ПолучитьКурсВалюты(ВалютаКассы, ДатаСреза);
		
		ВалютаДоговора			= Объект.Договор.ВалютаДоговора;
		СтруктураКурсаДоговора	= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора, ДатаСреза); 
		
		ИмяРегистраОперативнаяЗадолженность = СтруктураРегистра["_0"];
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОперативнаяЗадолженность.Счет КАК Документ,
		               |	ОперативнаяЗадолженность.Счет.ПредставлениеДокумента КАК Представление,
		               |	ОперативнаяЗадолженность.СчетУчета КАК Счет,
		               |	ОперативнаяЗадолженность.Всего_ВалютаРасход КАК СуммаВД,
		               |	ОперативнаяЗадолженность.ВсегоРасход КАК СуммаВК
		               |ИЗ
		               |	РегистрНакопления."+ИмяРегистраОперативнаяЗадолженность+".Обороты(, , Период, Счет В(&РезультатВыбора)) КАК ОперативнаяЗадолженность"; 
		
		Запрос.УстановитьПараметр("РезультатВыбора", РезультатВыбора);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Отбор = Новый Структура("Документ, Счет");
			ЗаполнитьЗначенияСвойств(Отбор, Выборка);
			
			НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);  
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаДокумента.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.УникальныйИдентификатор = Новый УникальныйИдентификатор;
				
				НоваяСтрока.СуммаВК = CW_Финансы.ПересчитатьИзВалютыВВалюту(
											Выборка.СуммаВД, 
											ВалютаКассы, 
											ВалютаДоговора, 
											СтруктураКурсаКассы.Курс, 
											СтруктураКурсаДоговора.Курс, 
											СтруктураКурсаКассы.Кратность, 
											СтруктураКурсаДоговора.Кратность);
				
				
			КонецЕсли;                                                                
		КонецЦикла; 
		
		
		ИмяРегистраОплатаДокументов = СтруктураРегистра["_1"];

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОплатаДокументов.Документ КАК Документ,
		               |	ОплатаДокументов.Документ.ПредставлениеДокумента КАК Представление,
		               |	ОплатаДокументов.СчетЗадолженности КАК Счет,
		               |	СУММА(ОплатаДокументов.Всего) КАК СуммаВД
		               |ИЗ
		               |	РегистрСведений."+ИмяРегистраОплатаДокументов+" КАК ОплатаДокументов
		               |ГДЕ
		               |	ОплатаДокументов.Регистратор В(&РезультатВыбора)
		               |	И ОплатаДокументов.ПризнакАкта = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ОплатаДокументов.СчетЗадолженности,
		               |	ОплатаДокументов.Документ,
		               |	ОплатаДокументов.Документ.ПредставлениеДокумента"; 
		
		Запрос.УстановитьПараметр("РезультатВыбора", РезультатВыбора);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Отбор = Новый Структура("Документ, Счет");
			ЗаполнитьЗначенияСвойств(Отбор, Выборка);
			
			НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);  
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаДокумента.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.УникальныйИдентификатор = Новый УникальныйИдентификатор;  
				
				НоваяСтрока.СуммаВК = CW_Финансы.ПересчитатьИзВалютыВВалюту(
											Выборка.СуммаВД, 
											ВалютаКассы, 
											ВалютаДоговора, 
											СтруктураКурсаКассы.Курс, 
											СтруктураКурсаДоговора.Курс, 
											СтруктураКурсаКассы.Кратность, 
											СтруктураКурсаДоговора.Кратность);
				
			КонецЕсли;
			
		КонецЦикла; 
		

	
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТипОбъекта = Тип("ДокументСсылка.CW_Оплата") Тогда
		
		СоответствиеИмяРегистра = Новый Соответствие;
		СоответствиеИмяРегистра.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ВозвратПокупателю"),		"CW_ОперативнаяДебиторскаяЗадолженность");
		СоответствиеИмяРегистра.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДДС.ВозвратОтПоставщика"), 	"CW_ОперативнаяКредиторскаяЗадолженность");

		ИмяРегистра = СоответствиеИмяРегистра.Получить(Объект.ВидОперации);
		Если ИмяРегистра = Неопределено Тогда
			ВызватьИсключение "Не удалось определить вид оперативной задолженности!";
		КонецЕсли;
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОперативнаяЗадолженность.Счет КАК Документ,
		               |	ОперативнаяЗадолженность.Счет.ПредставлениеДокумента КАК Представление,
		               |	ОперативнаяЗадолженность.СчетУчета КАК Счет,
		               |	ОперативнаяЗадолженность.Всего_ВалютаРасход КАК СуммаВД,
		               |	ОперативнаяЗадолженность.ВсегоРасход КАК СуммаВК
		               |ИЗ
		               |	РегистрНакопления."+ИмяРегистра+".Обороты(, , Период, Счет В(&РезультатВыбора)) КАК ОперативнаяЗадолженность"; 
		
		Запрос.УстановитьПараметр("РезультатВыбора", РезультатВыбора);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Отбор = Новый Структура("Документ, Счет");
			ЗаполнитьЗначенияСвойств(Отбор, Выборка);
			
			НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);  
			Если НайденныеСтроки.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаДокумента.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				НоваяСтрока.УникальныйИдентификатор = Новый УникальныйИдентификатор;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	Возврат ТаблицаДокумента;
	
КонецФункции

&НаСервере
Функция ПолучитьПустуюТаблицуДокумента()
	                               
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	               |	НЕОПРЕДЕЛЕНО КАК УникальныйИдентификатор,
	               |	CW_ДвижениеДенежныхСредствРасшифровка.Документ КАК Документ,
	               |	CW_ДвижениеДенежныхСредствРасшифровка.Представление КАК Представление,
	               |	CW_ДвижениеДенежныхСредствРасшифровка.Счет КАК Счет,
	               |	CW_ДвижениеДенежныхСредствРасшифровка.СуммаВК КАК СуммаВК,
	               |	CW_ДвижениеДенежныхСредствРасшифровка.СуммаВД КАК СуммаВД
	               |ИЗ
	               |	Документ.CW_ДвижениеДенежныхСредств.Расшифровка КАК CW_ДвижениеДенежныхСредствРасшифровка"; 
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

&НаКлиенте
Процедура РасшифровкаДокументПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы.Расшифровка.ТекущаяСтрока;
	РасшифровкаДокументПриИзмененииНаСервере(ТекущаяСтрока); 
	
КонецПроцедуры   

&НаСервере
Процедура РасшифровкаДокументПриИзмененииНаСервере(ТекущаяСтрока)
	
	СоответствиеИмениРеквизита = ПолучитьСоответствиеРеквизитПредставлениеТипуДокумента();

	СтрокаТекущая = Объект.Расшифровка.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если СтрокаТекущая.Документ = Объект.Ссылка Тогда
		СтрокаТекущая.Документ = Неопределено;
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = СоответствиеИмениРеквизита.Получить(ТипЗнч(СтрокаТекущая.Документ));
	Если ИмяРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;
										  
	СтрокаТекущая.Представление = СтрокаТекущая.Документ[ИмяРеквизита];  
	
	ПоместитьТаблицуДокументаВоВременноеХранилище(СтрокаТекущая.Документ);

КонецПроцедуры

&НаСервере
Процедура ПоместитьТаблицуДокументаВоВременноеХранилище(Знач Документ)
	
	//Подготовим таблицу для заполнения документа
	РезультатВыбора = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Документ);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТипОбъекта", ТипЗнч(Документ));
	
	ТаблицаДокумента = ПодготовитьТаблицуДляЗаполнения(РезультатВыбора, ДополнительныеПараметры);
	ПоместитьВоВременноеХранилище(ТаблицаДокумента, АдресТаблицыДокумента);
	//---Подготовим таблицу для заполнения документа

КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеРеквизитПредставлениеТипуДокумента()
	
	Соответствие = новый Соответствие;
	Соответствие.Вставить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"),  "ПредставлениеДокумента");
 	Соответствие.Вставить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"), "ПредставлениеДокумента");
	Соответствие.Вставить(Тип("ДокументСсылка.CW_Оплата"), 					"ПредставлениеДокумента");
	Соответствие.Вставить(Тип("ДокументСсылка.CW_ДвижениеДенежныхСредств"), "ПредставлениеДокумента");

	Возврат Соответствие;
	
КонецФункции

&НаКлиенте
Процедура РасшифровкаСчетНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока 	= Элементы.Расшифровка.ТекущаяСтрока;
	СписокВыбора 	= ПолучитьСписокСчетовДокумента(ТекущаяСтрока); 
	Если СписокВыбора = Неопределено Тогда
		ПоказатьПредупреждение(, "Не удалось получить список счетов задолженности по документу");
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборСчета", ЭтотОбъект, ДополнительныеПараметры);
	
	СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите счет задолженности");
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьВыборСчета(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьВыборСчетаНаСервере(РезультатВыбора.Значение, ДополнительныеПараметры);
	
КонецПроцедуры   

&НаСервере
Процедура ЗавершитьВыборСчетаНаСервере(Знач Значение, ДополнительныеПараметры)
	
	ТаблицаДокумента = ПолучитьИзВременногоХранилища(АдресТаблицыДокумента); 
	Если ТаблицаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	НайденнаяСтрока = ТаблицаДокумента.Найти(Значение, "УникальныйИдентификатор");
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СтрокаТекущая = Объект.Расшифровка.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	СтрокаТекущая.Счет 	  = НайденнаяСтрока.Счет;
	СтрокаТекущая.СуммаВК = НайденнаяСтрока.СуммаВК;
	СтрокаТекущая.СуммаВД = НайденнаяСтрока.СуммаВД;  
	
	ОбновитьИтогиНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСчетовДокумента(ТекущаяСтрока)
	
	СтрокаТекущая = Объект.Расшифровка.НайтиПоИдентификатору(ТекущаяСтрока);
	
	СписокВыбора = ПолучитьМассивСчетов(СтрокаТекущая.Документ);   
	Возврат СписокВыбора;
	
КонецФункции 

&НаСервере
Функция ПолучитьМассивСчетов(Документ)  
	
	ТаблицаДокумента = ПолучитьИзВременногоХранилища(АдресТаблицыДокумента); 
	Если ТаблицаДокумента = Неопределено Тогда  
		ПоместитьТаблицуДокументаВоВременноеХранилище(Документ);
		ТаблицаДокумента = ПолучитьИзВременногоХранилища(АдресТаблицыДокумента); 
		Если ТаблицаДокумента = Неопределено Тогда  
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли; 

	СписокВыбора = Новый СписокЗначений;
	Для Каждого СтрокаТаблциы из ТаблицаДокумента Цикл   
		ПредставлениеЭлемента = СокрЛП(СтрокаТаблциы.Счет) + " ("+Формат(СтрокаТаблциы.СуммаВД, "ЧДЦ=2")+")";
		СписокВыбора.Добавить(СтрокаТаблциы.УникальныйИдентификатор, ПредставлениеЭлемента);
	КонецЦикла;
	
	Возврат СписокВыбора

КонецФункции


&НаКлиенте
Процедура РасшифровкаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПодключитьОбработчикОжидания("РасшифровкаПриОкончанииРедактированияОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура РасшифровкаПриОкончанииРедактированияОбработчикОжидания()

	РассчитатьСуммуВВалютеДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСуммаВДПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расшифровка.ТекущаяСтрока;
	РасшифровкаСуммаВДПриИзмененииНаСервере(ТекущаяСтрока);  
	
КонецПроцедуры  

&НаСервере
Процедура РасшифровкаСуммаВДПриИзмененииНаСервере(ТекущаяСтрока)
	
	Если Элементы.СуммаВД.Видимость Тогда
		
		СтрокаТекущая = Объект.Расшифровка.НайтиПоИдентификатору(ТекущаяСтрока);
		
		ДатаСреза 			= ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());  
		ВалютаКассы			= Объект.Касса.Валюта;
		СтруктураКурсаКассы	= CW_Финансы.ПолучитьКурсВалюты(ВалютаКассы, ДатаСреза);
		
		ВалютаДоговора			= Объект.Договор.ВалютаДоговора; 
		СтруктураКурсаДоговора	= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора, ДатаСреза);
		
		СтрокаТекущая.СуммаВК = CW_Финансы.ПересчитатьИзВалютыВВалюту(
									СтрокаТекущая.СуммаВД, 
									ВалютаКассы, 
									ВалютаДоговора, 
									СтруктураКурсаКассы.Курс, 
									СтруктураКурсаДоговора.Курс, 
									СтруктураКурсаКассы.Кратность, 
									СтруктураКурсаДоговора.Кратность); 
		
	КонецЕсли;
	
	РассчитатьСуммуВВалютеДоговора();
	
КонецПроцедуры
 
&НаСервере
Процедура РассчитатьСуммуВВалютеДоговора()
	
	Объект.СуммаВД = Объект.Расшифровка.Итог("СуммаВД"); 
	
КонецПроцедуры
