#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 					= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте();
	СтруктураОписания.Тип 				= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 				= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешнийМакрос();

	СтруктураОписания.Наименование 				= "Пример внешнего макроса";
	СтруктураОписания.Описание 					= "Пример внешнего макроса";
	СтруктураОписания.Версия 					= "3.2.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	СтруктураОписания.Настройка 		= Истина;
	
	//Описание форм
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыНастроекОбъекта(СтруктураОписания, "ФормаНастроек");  

	Возврат СтруктураОписания;
	
КонецФункции

// Функция - Выполнить команду
//
// Параметры:
//  Обработка			 - 	 	Ссылка на подключаемый объект
//  ПараметрыОбработки	 - 	 	Структура
//		Свойства:
//			-  Объект    -  	Адрес временного хранилища. в котором размещения структура со свойствами: 
//								- Действие - выполняемое действие. 
//									Доступные действия: 
//										- "СписокМакросов";
//										- "ОбработкаМакросов"
//
//		                        - Текст    - имя макрсоа
//							    - Объект   - документ
//							    - СтрокиТЧ - строка документа
//			
// 
// Возвращаемое значение:
//   Для действия "СписокМакросов": массив со структурой (Значение,Представление) во временном хранилище
//   Для действия "ОбработкаМакросов": рассчитанное занчениемакроса во временном хранилище
//
Функция ВыполнитьКоманду(Обработка, ПараметрыОбработки) Экспорт
	
	Если Не ЭтоАдресВременногоХранилища(ПараметрыОбработки.Объект) тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыПроцеудры = ПолучитьИзВременногоХранилища(ПараметрыОбработки.Объект);
	Если ТипЗнч(ПараметрыПроцеудры) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Получение действия макроса
	Действие = Неопределено;
	ПараметрыПроцеудры.Свойство("Действие", Действие);
	Если Действие = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	
	//Получение действия макроса
	
	//Получение настроек внешнего объекта
	Настройки 	= _ПО.ПолучитьНастройкиОбработки(Обработка);
	Если Настройки <> Неопределено Тогда
		
	КонецЕсли;
	//Получение настроек внешнего объекта
	
	
	Если Действие = "СписокМакросов" Тогда
		
		СтрукутраМакрсоа = Новый Структура;
		СтрукутраМакрсоа.Вставить("Значение",		"<ИмяМакроса>");
		СтрукутраМакрсоа.Вставить("Представление",	"<ПредставлениеVароса>");
	
		мМакросы  = Новый Массив;
		мМакросы.Добавить(СтрукутраМакрсоа);
		
		Ответ = новый Структура;
		Ответ.Вставить("Адрес", ПоместитьВоВременноеХранилище(мМакросы, ПараметрыОбработки.УИД));
		
		Возврат Ответ;
		
	КонецЕсли;
	
	Если Действие = "ОбработкаМакросов" Тогда
		
		ЗначениеМакроса = Неопределено;
	
		//Напишите код получения значения для макроса;
		
		Ответ = новый Структура;
		Ответ.Вставить("Адрес", ПоместитьВоВременноеХранилище(ЗначениеМакроса, Новый УникальныйИдентификатор));
	
		Возврат Ответ;
		
	КонецЕсли;
	
	Ответ = новый Структура;
	Ответ.Вставить("Адрес", ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор));
	
	Возврат Ответ;
	
КонецФункции


#КонецЕсли