Функция ПредставлениеСтавокНДСДляОперативныхОтчетов(Док) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(Док) <> Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	CW_РасходыПоГрузоперевозкеУслуги.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
	|ГДЕ
	|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
	|	И НЕ CW_РасходыПоГрузоперевозкеУслуги.СтавкаНДС ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат _СФ.м_Представление(ТЗ.ВыгрузитьКолонку("СтавкаНДС"), ", ");
	
КонецФункции	
Функция ПредставлениеОперативныхМенеджеровДляОперативныхОтчетов(Док) Экспорт
	УстановитьПривилегированныйРежим(Истина);	
	Если ТипЗнч(Док) <> Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка.ОперативныйМенеджер КАК ОперативныйМенеджер
	|ИЗ
	|	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
	|ГДЕ
	|	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
	|	И НЕ CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка.ОперативныйМенеджер ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат _СФ.м_Представление(ТЗ.ВыгрузитьКолонку("ОперативныйМенеджер"), ", ");
	
КонецФункции

Функция ПредставлениеСтавокНДСДляОперативныхОтчетовДоходы(Док) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(Док) <> Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	CW_ДоходыПоГрузоперевозкеУслуги.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
	|	И НЕ CW_ДоходыПоГрузоперевозкеУслуги.СтавкаНДС ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат _СФ.м_Представление(ТЗ.ВыгрузитьКолонку("СтавкаНДС"), ", ");
	
КонецФункции	
Функция ПредставлениеОперативныхМенеджеровДляОперативныхОтчетовДоходы(Док) Экспорт
	УстановитьПривилегированныйРежим(Истина);	
	Если ТипЗнч(Док) <> Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.ОперативныйМенеджер КАК ОперативныйМенеджер
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
	|	И НЕ CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.ОперативныйМенеджер ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", Док);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат _СФ.м_Представление(ТЗ.ВыгрузитьКолонку("ОперативныйМенеджер"), ", ");
	
КонецФункции
