&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПолучитьИнтевалОбновленияДанных();
	УстановитьНастройкиКлючевыхПоказателей();
	ДобавитьРеквизитыИЭлементыНаФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	УстановитьЗначенияКлючевыхПоказателей();
	УстановитьОбработчикОжиданияОбновленияДанных();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ИнтервалОбновления <> 0 Тогда
		ОтключитьТекущийОбработчикОжидания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьТекущийОбработчикОжидания()
	
	ОтключитьОбработчикОжидания("ОбновитьКлючевыеПоказатели");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбработчикОжиданияОбновленияДанных()
	
	Если ИнтервалОбновления <> 0 Тогда
		ПодключитьОбработчикОжидания("ОбновитьКлючевыеПоказатели", ИнтервалОбновления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "CW_НастройкиКлючевыхПоказателей_Запись" Тогда
		УстановитьНастройкиКлючевыхПоказателей();
		ДобавитьРеквизитыИЭлементыНаФорму();
		УстановитьЗначенияКлючевыхПоказателей();
	КонецЕсли;
	
	Если ИмяСобытия = "CW_НастройкиПользователей_Запись" Тогда
		ПолучитьИнтевалОбновленияДанных();
		ОтключитьТекущийОбработчикОжидания();
		УстановитьОбработчикОжиданияОбновленияДанных();
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура Обновить(Команда)
	
	УстановитьНастройкиКлючевыхПоказателей();
	
	ДобавитьРеквизитыИЭлементыНаФорму();
	УстановитьЗначенияКлючевыхПоказателей();
	
КонецПроцедуры   

&наКлиенте
Процедура ОбновитьКлючевыеПоказатели()
	
	УстановитьЗначенияКлючевыхПоказателей();
	
КонецПроцедуры



&НаСервере
Процедура УстановитьНастройкиКлючевыхПоказателей()
	
	ТекущиеНастройкиКлючевыхПоказателей = CW_КлючевыеПоказателиСервер.ПолучитьНастройкиКлючевыхПоказателей();
	НастройкиКлючевыхПоказателей = Новый ФиксированноеСоответствие(ТекущиеНастройкиКлючевыхПоказателей);

КонецПроцедуры  

&НаСервере
Процедура ДобавитьРеквизитыИЭлементыНаФорму()
	
	УдаляемыеРеквизиты 		= новый Массив;  
	ДобавляемыеРеквизитов	= новый Массив;
	УдаляемыеЭлементы 		= Новый Массив;
	СоответствиеПоказателейИменамРеквизитов = Новый Соответствие; 
	
	ИсключаемыеРеквизиты = Новый Массив;
	ИсключаемыеРеквизиты.Добавить("СоответствиеИменРеквизитов");
	ИсключаемыеРеквизиты.Добавить("НастройкиКлючевыхПоказателей"); 
	ИсключаемыеРеквизиты.Добавить("ИнтервалОбновления"); 

	//Удаляем реквизиты и элементы формы
	РеквизитыФормы = ПолучитьРеквизиты();
	Для Каждого РеквизитФормы из РеквизитыФормы Цикл 
		Если ИсключаемыеРеквизиты.Найти(РеквизитФормы.Имя) <> Неопределено Тогда
			Продолжить;
		Конецесли;
		
		УдаляемыеРеквизиты.Добавить(РеквизитФормы.Имя); 
		
		НайденныйЭлемент = Элементы.Найти(РеквизитФормы.Имя);
		Если НайденныйЭлемент <> Неопределено Тогда
			УдаляемыеЭлементы.Добавить(НайденныйЭлемент);	
		Конецесли;
	КонецЦикла;     
	
	Для каждого Элемент из Элементы Цикл  
		Если СтрНачинаетсяС(Элемент.Имя, "ГруппаПоказателей_") 
			и ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
			УдаляемыеЭлементы.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Элемент из УдаляемыеЭлементы Цикл 
		Элементы.Удалить(Элемент);
	КонецЦикла; 
	//---Удаляем реквизиты и элементы формы
	
	//Добавляем реквизиты формы
	Для Каждого Показатель из НастройкиКлючевыхПоказателей["ПорядокПоказателей"] Цикл  
		
		СтруктураПоказателя = НастройкиКлючевыхПоказателей["Показатели"][Показатель];  
		ИмяРеквизита 		= "Значение_"+СтруктураПоказателя.Код;
		
		РеквизитФормы = Новый РеквизитФормы(
			ИмяРеквизита, 
			Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)), 
			, 
			СокрЛП(СтруктураПоказателя.Наименование));
		
		ДобавляемыеРеквизитов.Добавить(РеквизитФормы);    
		
		СоответствиеПоказателейИменамРеквизитов.Вставить(Показатель, ИмяРеквизита);
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизитов, УдаляемыеРеквизиты);   
	//---Добавляем реквизиты формы 
	
	
	СоответствиеРодителяГруппе = Новый Соответствие;
	//Добавляем группы на форму
	Для Каждого ГруппаПоказателя из НастройкиКлючевыхПоказателей["ПорядокГрупп"] Цикл
		
		СтруктураГруппы = НастройкиКлючевыхПоказателей["ГруппыПокзателей"][ГруппаПоказателя];  
		ИмяГруппы 		= "ГруппаПоказателей_"+СтруктураГруппы.Код;
		
		НовыйЭлемент = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы")); 
		НовыйЭлемент.Заголовок 		= СтруктураГруппы.Наименование;
		НовыйЭлемент.Вид 			= ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлемент.Группировка 	= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;  
		НовыйЭлемент.Объединенная 	= Ложь;
		
		Если СтруктураГруппы.Свойство("ДанныеСтиля") Тогда  
			УстановитьОформлениеЭлемента(НовыйЭлемент, СтруктураГруппы.ДанныеСтиля);
		КонецЕсли;	
		
		СоответствиеРодителяГруппе.Вставить(ГруппаПоказателя, ИмяГруппы);
	КонецЦикла;
 	//---Добавляем элементы на форму  	
	
	//Добавляем элементы на форму
	Для Каждого Показатель из НастройкиКлючевыхПоказателей["ПорядокПоказателей"] Цикл
		
		СтруктураПоказателя = НастройкиКлючевыхПоказателей["Показатели"][Показатель];  
		ПутьКДанным 		= СоответствиеПоказателейИменамРеквизитов.Получить(Показатель);
		
		Родитель  = Неопределено;
		ИмяГруппы = СоответствиеРодителяГруппе.Получить(СтруктураПоказателя.Родитель); 
		Если ИмяГруппы <> Неопределено Тогда
			Родитель = Элементы.Найти(ИмяГруппы);
		Конецесли; 
		
		НовыйЭлемент = Элементы.Добавить(ПутьКДанным, Тип("ПолеФормы"), Родитель); 
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ПутьКДанным				= ПутьКДанным; 
		НовыйЭлемент.ГоризонтальноеПоложение 	= ГоризонтальноеПоложениеЭлемента.Право;  
		НовыйЭлемент.Гиперссылка				= Истина; 
		НовыйЭлемент.АвтоМаксимальнаяШирина 	= Истина; 
		
		Если СтруктураПоказателя.Свойство("ДанныеСтиля") Тогда  
			УстановитьОформлениеЭлемента(НовыйЭлемент, СтруктураПоказателя.ДанныеСтиля);
		КонецЕсли;	
		
		Если Показатель.ИмяМакета = "ДебиторскаяЗадолженность" Тогда
			НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_ДебиторскаяЗадолженность");  
		Иначе
			НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_ОткрытьСписок");  
		КонецЕсли;
		
	КонецЦикла;
 	//---Добавляем элементы на форму   
	
	СоответствиеИменРеквизитов 	= Новый ФиксированноеСоответствие(СоответствиеПоказателейИменамРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеЭлемента(Знач ОформляемыйЭлемент, Знач ДанныеСтиля, Знач УсловноеОформление=Ложь)
	
	Если ДанныеСтиля.Свойство("Формат") Тогда
		ОформляемыйЭлемент.Формат = ДанныеСтиля.Формат;      
	КонецЕсли;
	
	Если ДанныеСтиля.Свойство("ЦветФона") Тогда
		ОформляемыйЭлемент.ЦветФона = ДанныеСтиля.ЦветФона;      
	КонецЕсли; 
	
	Если ДанныеСтиля.Свойство("ЦветТекста") Тогда   
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОформляемыйЭлемент, "ЦветТекста") Тогда
			ОформляемыйЭлемент.ЦветТекста 			= ДанныеСтиля.ЦветТекста; 
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОформляемыйЭлемент, "ЦветТекстаЗаголовка") Тогда
			ОформляемыйЭлемент.ЦветТекстаЗаголовка 	= ДанныеСтиля.ЦветТекста;     
		КонеЦЕсли;
	КонецЕсли;
	
	Если ДанныеСтиля.Свойство("Шрифт") Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОформляемыйЭлемент, "Шрифт") Тогда
			ОформляемыйЭлемент.Шрифт			= ДанныеСтиля.Шрифт;   
		КонецЕсли;    
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОформляемыйЭлемент, "ШрифтЗаголовка") Тогда
			ОформляемыйЭлемент.ШрифтЗаголовка	= ДанныеСтиля.Шрифт;
		КонецЕсли;    
	КонецЕсли;    

	Если ДанныеСтиля.Свойство("Рамка") 
		и ДанныеСтиля.Рамка Тогда
		ОформляемыйЭлемент.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная);	
	КонецЕсли;    
	
	Если Не УсловноеОформление Тогда 
		
		ОтображатьЗаголовокЭлемента = Истина;
		Если ДанныеСтиля.Свойство("ОтображатьЗаголовок") Тогда 
			ОтображатьЗаголовокЭлемента = ДанныеСтиля.ОтображатьЗаголовок;
		КонецЕсли;  
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОформляемыйЭлемент, "ОтображатьЗаголовок") Тогда
			ОформляемыйЭлемент.ОтображатьЗаголовок = ОтображатьЗаголовокЭлемента;   
		КонецЕсли;  
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОформляемыйЭлемент, "ПоложениеЗаголовка") Тогда
			Если ОтображатьЗаголовокЭлемента = Ложь Тогда
				ОформляемыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Иначе
				ОформляемыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
			Конецесли;
		Конецесли;  
		
		Если ДанныеСтиля.Свойство("ГоризонтальноеПоложение") Тогда    
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОформляемыйЭлемент, "ГоризонтальноеПоложение") Тогда 
				СоответствиеЭлементовГоризонтальногоПоложения = CW_КлючевыеПоказателиСервер.СоответствиеЭлементовГоризонтальногоПоложения();	
				ОформляемыйЭлемент.ГоризонтальноеПоложение = СоответствиеЭлементовГоризонтальногоПоложения.Получить(ДанныеСтиля.ГоризонтальноеПоложение);	
			КонецЕсли;  
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры    


&НаКлиенте
Процедура УстановитьЗначенияКлючевыхПоказателей()
	
	РезультатВыполнения =  УстановитьЗначенияКлючевыхПоказателейНаСервереВФоне();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПолученияКлючевыхПоказателей", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры

&НаСервере 
Функция УстановитьЗначенияКлючевыхПоказателейНаСервереВФоне() 
	
	КлючевыеПоказатели = Новый Массив;
	Для Каждого КлючЗначение из НастройкиКлючевыхПоказателей["Показатели"] Цикл
		КлючевыеПоказатели.Добавить(КлючЗначение.Ключ);	
	КонецЦикла;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне   = ложь;   
	ПараметрыПроцедуры = Новый Структура;  
	ПараметрыПроцедуры.Вставить("КлючевыеПоказатели", КлючевыеПоказатели);  

	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_КлючевыеПоказателиСервер.ПолучитьЗначенияКлючевыхПоказателей",ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции       


&НаКлиенте 
Процедура ОбработатьРезультатПолученияКлючевыхПоказателей(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения <> Неопределено
		и РезультатВыполнения.Статус = "Выполнено" Тогда    
		УстановитьЗначенияКлючевыхПоказателейНаСервере(РезультатВыполнения.АдресРезультата);
	КонецЕсли;  
	
КонецПроцедуры  
 
&НаСервере
Процедура УстановитьЗначенияКлючевыхПоказателейНаСервере(АдресРезультата)    
	
	ЗначенияПоказателей = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(ЗначенияПоказателей)  <> Тип("Соответствие") Тогда
		Возврат;	
	КонецЕсли;  
	
	ЗнакиУсловия = ПолучитьЗнакУсловия();

	Для каждого КлючЗначение из ЗначенияПоказателей Цикл
		ИмяРеквизита 		= СоответствиеИменРеквизитов[КлючЗначение.Ключ];
		НастройкиПоказателя = НастройкиКлючевыхПоказателей["Показатели"][КлючЗначение.Ключ];
		
		ЭтаФорма[ИмяРеквизита]= КлючЗначение.Значение;
		
		Если НастройкиПоказателя.Свойство("УсловноеОформление")
			и НастройкиПоказателя.УсловноеОформление <> Неопределено Тогда 
			
			Условие  = НастройкиПоказателя.УсловноеОформление["Условие"]; 
			ЗнакУсловия = ЗнакиУсловия.Получить(Условие);  
			Если ЗнакУсловия <> Неопределено Тогда
				Значение 		= НастройкиПоказателя.УсловноеОформление["Значение"];
				ТекущееЗначение = КлючЗначение.Значение;
				
				Формула   = "ТекущееЗначение"+ЗнакУсловия+"Значение";
				Результат = Вычислить(Формула);
				Если Результат Тогда  
					УстановитьОформлениеЭлемента(Элементы[ИмяРеквизита], НастройкиПоказателя.УсловноеОформление["Оформление"], Истина);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьЗнакУсловия()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Равно", "=");
	Соответствие.Вставить("НеРавно", "<>");
	Соответствие.Вставить("Больше", ">");
	Соответствие.Вставить("БольшеИлиРавно", ">=");
	Соответствие.Вставить("Меньше", "<");
	Соответствие.Вставить("МеньшеИлиРавно", "<=");
	
	Возврат Соответствие;
	
КонецФункции

&НаКлиенте
Процедура Настроить(Команда)
	
	ОткрытьФорму("Справочник.CW_НастройкиКлючевыхПоказателей.ФормаСписка",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОбновления(Команда) 
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаИнетрвалаОбновления", ЭтотОбъект);
	
	ПоказатьВводЧисла(Оповещение, ИнтервалОбновления, "Укажите интервал обновления данных", 10,0);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеВводаИнетрвалаОбновления(ВведенноеЗначение, ДополнительныеПараметры) Экспорт
    Если ВведенноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	ОбработатьВводИнтервалаОбновленияданныхНаСерере(ВведенноеЗначение);
	
	ПолучитьИнтевалОбновленияДанных();
	ОтключитьТекущийОбработчикОжидания();
	УстановитьОбработчикОжиданияОбновленияДанных();
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьВводИнтервалаОбновленияданныхНаСерере(ВведенноеЗначение)
	
	CW_КлючевыеПоказателиСервер.УстановитьИнтервалОбновленияДанных(ВведенноеЗначение);

КонецПроцедуры

Процедура ПолучитьИнтевалОбновленияДанных() Экспорт
	
	НастройкиПользователя = CW_Настройки.ПолучитьНастройкиПользователя();   
	НастройкиПользователя.Свойство("ИнтревалОбновленияКлючевыхПоказателей", ИнтервалОбновления);

КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ОткрытьСписок(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КодЭлемента = Сред(Элемент.Имя, 10);
	
	СтруктураПараметров = ПолучитьДанныеОткрываемойФормы(КодЭлемента);  
	Если СтруктураПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ОткрытьФорму(СтруктураПараметров.ПолноеИмяФормы, СтруктураПараметров, ЭтаФорма); 
	
КонецПроцедуры    

&НаКлиенте
Процедура Подключаемый_ДебиторскаяЗадолженность(Элемент, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	КодЭлемента = Сред(Элемент.Имя, 10);
	
	ПараметрыРасшифровки = ПолучитьНастройкиКомпоновщика(КодЭлемента);
	
	ФормаОтчета = ПолучитьФорму("Отчет.CW_ОперативнаяЗадолженностьКлиентов.Форма.ФормаОтчета",,ЭтаФорма);
	ФормаОтчета.Открыть();    
	
	Если ТипЗнч(ПараметрыРасшифровки) = Тип("Структура") Тогда
		
		ФормаОтчета.Рубли  = (ПараметрыРасшифровки.Показатель = "РубОстаток");  
		ФормаОтчета.Валюта = (ПараметрыРасшифровки.Показатель = "ВалОстаток");  	
		
		Если ПараметрыРасшифровки.Свойство("НастройкиКомпоновкиДанных")
			И ТипЗнч(ПараметрыРасшифровки.НастройкиКомпоновкиДанных) = Тип("НастройкиКомпоновкиДанных") Тогда 
			
			НастройкиКомпоновкиДанных = ПараметрыРасшифровки.НастройкиКомпоновкиДанных;
			
			ФормаОтчета.Компоновщик.Настройки.Отбор.Элементы.Очистить();	
			Для Каждого ЭлементОтбораНастроек из НастройкиКомпоновкиДанных.отбор.Элементы Цикл
				ЭлементОтбора = ФормаОтчета.Компоновщик.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение 	= ЭлементОтбораНастроек.ЛевоеЗначение;
				ЭлементОтбора.ВидСравнения 		= ЭлементОтбораНастроек.ВидСравнения;
				ЭлементОтбора.ПравоеЗначение 	= ЭлементОтбораНастроек.ПравоеЗначение;
				ЭлементОтбора.Использование 	= ЭлементОтбораНастроек.Использование;
			КонецЦикла; 
			
		КонецЕсли;  
	КонецЕсли;  
	
	ФормаОтчета.СформироватьОтчет();
	ФормаОтчета.ОбработатьОтчет();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиКомпоновщика(КодЭлемента)
	
	КлючевойПоказатель = Справочники.CW_НастройкиКлючевыхПоказателей.НайтиПоКоду(КодЭлемента,,,ПараметрыСеанса.ТекущийПользователь);
	
	Результат = Новый Структура;
	Результат.Вставить("Показатель", КлючевойПоказатель.ИмяПоказателя);
	Результат.Вставить("НастройкиКомпоновкиДанных", КлючевойПоказатель.ХранилищеНастроек.Получить());
	
	Возврат Результат;
	
КонецФункции


&НаСервере
Функция ПолучитьДанныеОткрываемойФормы(КодЭлемента)
	
	КлючевойПоказатель = Справочники.CW_НастройкиКлючевыхПоказателей.НайтиПоКоду(КодЭлемента,,,ПараметрыСеанса.ТекущийПользователь);
	Если КлючевойПоказатель.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СоответствиеИмениМакетаСправочнику = Новый Соответствие;
	СоответствиеИмениМакетаСправочнику.Вставить("Грузоперевозки", 	"Справочник.CW_Грузоперевозки.ФормаСписка");
	СоответствиеИмениМакетаСправочнику.Вставить("Заказы", 			"Справочник.CW_Заказы.ФормаСписка");
	СоответствиеИмениМакетаСправочнику.Вставить("Заявки", 			"Справочник.CW_Заявки.ФормаСписка");

	ПолноеИмяФормы = СоответствиеИмениМакетаСправочнику.Получить(КлючевойПоказатель.ИмяМакета);
	МассивСсылок   = Справочники.CW_НастройкиКлючевыхПоказателей.ПолучитьРезультат(КлючевойПоказатель, Истина);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", МассивСсылок);
	
    СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПолноеИмяФормы",	ПолноеИмяФормы);
	СтруктураПараметров.Вставить("Отбор", 			Отбор);
	 
    Возврат СтруктураПараметров;
	
КонецФункции




