
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработка = _сф.ст_ПолучитьСвойство(Параметры,"Объект");
	Обмен = _сф.ст_ПолучитьСвойство(Параметры,"Субъект");
	Если Обмен.Пустая() Тогда
		
		// не передали субъект
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	// ---------------------------------------------------------------------------- 
	
	// формируем заголовок
	ЭтаФорма.Заголовок = "Настройки обмена """+Строка(Обмен)+""""; 
	
	// читаем настройки:
	_ПрочитатьНастройки();
	
	// --- 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// --- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	// --- 
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура Записать(Команда)
	
	// записываем настройки
	Если _ЗаписатьНастройки() Тогда
		
		// закрываем форму
		ЭтаФорма.Закрыть();
		
	Иначе
		
		// можем сообщить об ошибке
		// --- 
		
	КонецЕсли; 
	
	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _СписокНастроекСтрокой()
	// --- 
	
	СписокНастроек = 	"Выгрузка_ИспользованиеРегламента,
						|Выгрузка_РасписаниеОнлайн,
						|Выгрузка_РасписаниеЕжедневное,
						|Выгрузка_КаталогВыгрузкиКонтрагентов,
						|Выгрузка_КаталогВыгрузкиФиксированныхБюджетов,
						|Выгрузка_КаталогВыгрузкиРабочихБюджетов,
						|Выгрузка_БюджетФиксированный,
						|Выгрузка_БюджетРабочий,
						|Выгрузка_КаталогВыгрузкиСчетов,
						|Выгрузка_КаталогВыгрузкиЗакрытий,
						|Выгрузка_СчетчикСообщенийПоСчетам,
						|Загрузка_ИспользованиеРегламента,
						|Загрузка_Расписание,
						|Загрузка_ОсновнойТипПеревозки,
						|Загрузка_КаталогЗагрузкиФайлов,
						|Загрузка_КаталогДляУспешных,
						|Загрузка_КаталогДляОшибочных,
						|Загрузка_ПараметрНомераГрузоперевозки,
						|Загрузка_РазрешитьАвтосинхронизациюПриРегламентнойЗагрузке";
						
	Возврат(СтрЗаменить(СписокНастроек,Символы.ПС,""));
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ПрочитатьНастройки()
	// --- 
	
	Настройки = _ПО.ПолучитьНастройкиСубъекта(Обработка,Обмен);
	// ---------------------------------------------------------------------------- 
	
	_сф.ст_ЗаполнитьСвойства(ЭтаФорма,_СписокНастроекСтрокой(),Настройки);
	
	// для рз
	Если Загрузка_Расписание.Количество() > 0 Тогда
        РасписаниеРЗ = Загрузка_Расписание.Получить(0).Значение;
        Элементы.Загрузка_Расписание.Заголовок = "Расписание ("+Строка(РасписаниеРЗ)+")";
	КонецЕсли;
	Если Выгрузка_РасписаниеОнлайн.Количество() > 0 Тогда
        РасписаниеРЗ = Выгрузка_РасписаниеОнлайн.Получить(0).Значение;
        Элементы.Выгрузка_РасписаниеОнлайн.Заголовок = "Расписание онлайн-выгрузки ("+Строка(РасписаниеРЗ)+")";
	КонецЕсли;
	Если Выгрузка_РасписаниеЕжедневное.Количество() > 0 Тогда
        РасписаниеРЗ = Выгрузка_РасписаниеЕжедневное.Получить(0).Значение;
        Элементы.Выгрузка_РасписаниеЕжедневное.Заголовок = "Расписание ежедневной выгрузки ("+Строка(РасписаниеРЗ)+")";
    КонецЕсли;
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ЗаписатьНастройки()
	// --- 
	
	Попытка
		
		Настройки = Новый Структура();
		// --- 
		_сф.ст_ДобавитьСвойства(Настройки,_СписокНастроекСтрокой(),ЭтаФорма);
		
		// ---------------------------------------------------------------------------- 
		_ПО.ЗаписатьНастройкиСубъекта(Обработка,Обмен,Настройки);
	    Возврат(Истина);
		
	Исключение
	    Возврат(Ложь);
	КонецПопытки; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Загрузка_РасписаниеНажатие(Элемент)
	
	РедактироватьРасписание("Загрузка_Расписание","Загрузка_Расписание");
		
КонецПроцедуры

&НаКлиенте
Процедура Выгрузка_РасписаниеОнлайнНажатие(Элемент)
	
	РедактироватьРасписание("Выгрузка_РасписаниеОнлайн","Выгрузка_РасписаниеОнлайн");
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузка_РасписаниеЕжедневноеНажатие(Элемент)
	
	РедактироватьРасписание("Выгрузка_РасписаниеЕжедневное","Выгрузка_РасписаниеЕжедневное");
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьРасписание(ИмяРеквизита,ИмяНадписи)
	// --- 
	
	РеквизитРасписания = ЭтаФорма[ИмяРеквизита];
	
	Если РеквизитРасписания.Количество() > 0 Тогда
        РасписаниеРЗ = РеквизитРасписания.Получить(0).Значение;
    Иначе
        РасписаниеРЗ = Неопределено;
    КонецЕсли;
	
	Если РасписаниеРЗ = Неопределено Тогда
		
		РасписаниеРЗ = Новый РасписаниеРегламентногоЗадания;
		
	КонецЕсли;
	
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРЗ);
	Если ДиалогРасписания.ОткрытьМодально() Тогда
		
		РеквизитРасписания.Очистить();
		РеквизитРасписания.Добавить(ДиалогРасписания.Расписание);
		Элементы[ИмяНадписи].Заголовок = "Расписание ("+Строка(ДиалогРасписания.Расписание)+")";
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

// ---------------------------------------------------------------------------- 


