// ---------------------------------------------------------------------------- 
// ОСНОВНЫЕ СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ---------------------------------------------------------------------------- 
	ЗапрашиватьТипФайлаПриДобавленииВАрхив = Константы.CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив.Получить();
	
	Отладка = Ложь;

	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	УстанавливаемыеПараметры = Новый Структура; 
	УстанавливаемыеПараметры.Вставить("CW_ГруппаПользователя", ГруппаПользователя);
	
	УстановитьПараметрыФункциональныхОпцийФормы(УстанавливаемыеПараметры);
	
	//// внешние команды
	//СписокДействий = _СписокДействий();
	//Если (СписокДействий.Количество()=0) Тогда
	//	 Элементы.ГруппаВнешниеДействия.Видимость = Ложь;
	//КонецЕсли; 
	
	// --- 
	ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ИнициализацияФормы",Параметры));
	
	ПараметрыОпции = Новый Структура("CW_Пользователь", ПараметрыСеанса.ТекущийПользователь);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыОпции);

	//Фоновое обновление журнала
	НастройкиПользователя = CW_Настройки.ПолучитьНастройкиПользователя();
	
	СтруктураФоновоеОбновление = Новый Структура;
	СтруктураФоновоеОбновление.Вставить("Используется", 	НастройкиПользователя.ВыполнятьФоновоеОбновлениеЖурналаЗавок);
	СтруктураФоновоеОбновление.Вставить("Интервал", 		НастройкиПользователя.ИнтервалФоновогоОбновленияЖурналаЗавок);
	СтруктураФоновоеОбновление.Вставить("Оповещать", 		НастройкиПользователя.ПоказыватьОповещениеВыполненияОбновлениеЖурналаЗавок);
	
	ПараметрыФоновогоОбновления = Новый ФиксированнаяСтруктура(СтруктураФоновоеОбновление);
	//Фоновое обновление журнала
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	// ---------------------------------------------------------------------------- 
	Если (РежимОткрытия <> "") Тогда
		
		ВыполнитьДействие(_УФКС.СД("Журналы","сервер","/ИнициализацияНастроек"));
		Если (НЕ Журнал_РежимНастройки) Тогда
			ВыполнитьДействие(_УФКС.СД("Журналы","сервер","/ОбновитьДанные"));	
		КонецЕсли;
		
	Иначе
		
		// механизм подтверждения настройки журнала
		ПодключитьОбработчикОжидания("ПодтверждениеНастройкиЖурнала",0.1,Истина);
		
	КонецЕсли; 

	//Фоновое обновление журнала
	Если ПараметрыФоновогоОбновления.Используется Тогда
		ПодключитьОбработчикОжидания("ВыполнитьФоновоеОбновлениеЖурнала", ПараметрыФоновогоОбновления.Интервал);
	КонецЕсли;
	//Фоновое обновление журнала
	
	
КонецПроцедуры

#Область ПередЗакрытием 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//Фоновое обновление журнала
	Если ПараметрыФоновогоОбновления.Используется Тогда
		ОтключитьОбработчикОжидания("ВыполнитьФоновоеОбновлениеЖурнала");
	КонецЕсли;
	//Фоновое обновление журнала
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	//ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/СохранитьСеансовыеНастройки",ИмяСеансовойНастройки));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияФормы(Результат, ДополнительныеСвойства) Экспорт 
	// --- 
	
	Если Результат=КодВозвратаДиалога.Да Тогда
		
		ЗакрытиеФормы = Истина;
		ЭтаФорма.Закрыть();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПодтверждениеНастройкиЖурнала() Экспорт 
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияСеансовойНастройки",ЭтотОбъект); 
	ПД = Новый Структура("ПОВ,СтруктураНастройки", ПОВ, _СтруктураНастройки());
	ВыполнитьДействие(_УФКС.СД("Журналы","клиент","/ДиалогПодтвержденияНастройки",ПД));
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _СтруктураНастройки()
	// --- 
	
	Возврат(CW_Журналы_Сервер.ПолучитьСтруктуруНастройки(ЭтаФорма));
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура ОбработкаПодтвержденияСеансовойНастройки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		// смотрим на выбранное действие
		Действие = Неопределено;
		Ответ.Свойство("Действие",Действие);
		Если (Действие = "Восстановить") Тогда
			
			ВыполнитьДействие(_УФКС.СД("Журналы","сервер","/ИнициализацияНастроек"));
			ВыполнитьДействие(_УФКС.СД("Журналы","сервер","/ОбновитьДанные"));
			
		ИначеЕсли (Действие = "Выбрать") Тогда 
			
			ВыполнитьДействие(_УФКС.СД("Журналы","клиент","/ЗагрузитьНастройку"));
			
		ИначеЕсли (Действие = "Создать") Тогда 
			
			Журнал_ТекущаяНастройка = Неопределено;
			Журнал_РежимНастройки = Истина;
			ВыполнитьДействие(_УФКС.СД("Журналы","сервер","/ИнициализацияНастроек"));
			
		КонецЕсли; 
		
	Иначе
		
		// снова открываем диалог подтверждения
		Закрыть();
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыполнитьДействия(Результат,ДополнительныеПараметры) Экспорт 
	// --- 
	
	ВыполнитьДействие(Результат);
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Функция ВыполнитьДействие(Действия)
	// --- 
	
	Если (Действия = Неопределено) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	
	Если (ТипЗнч(Действия)=Тип("Структура")) Тогда
		МассивДействий = Новый Массив;
		МассивДействий.Добавить(Действия);
	Иначе
		МассивДействий = Действия;
	КонецЕсли; 
	МассивОтветов = Новый Массив;
	
	Для каждого СтруктураДействия Из МассивДействий Цикл
		
		Если (СтруктураДействия = Неопределено) Тогда
			
			Продолжить;
			
		КонецЕсли; 
		// --- 
		Если (НЕ ЗначениеЗаполнено(СтруктураДействия.Модуль)) Тогда
			Сообщить("Ошибка: не указан модуль действия для команды """+СтруктураДействия.Команда+"""");
		КонецЕсли; 
		Если (НЕ ЗначениеЗаполнено(СтруктураДействия.Выполнение)) Тогда
			Сообщить("Ошибка: не указан вариант выполнения для команды """+СтруктураДействия.Команда+"""");
			Возврат(Неопределено);
		КонецЕсли; 
		
		// ---------------------------------------------------------------------------- 
		
		Если (СтруктураДействия.Выполнение = "клиент") Тогда
			
			ПОВ = Новый ОписаниеОповещения("ВыполнитьДействия",ЭтотОбъект);
			Если (СтруктураДействия.Модуль = "Грузоперевозки") Тогда
				
				Ответ = CW_Грузоперевозки_Клиент.ВыполнитьДействие(ЭтаФорма,СтруктураДействия);
				
			ИначеЕсли (СтруктураДействия.Модуль = "Журналы") Тогда 
				
				Ответ = CW_Журналы_Клиент.ВыполнитьДействие(ЭтаФорма,СтруктураДействия,ПОВ);
				
			ИначеЕсли (СтруктураДействия.Модуль = "Форма") Тогда 
				
				ПодключитьОбработчикОжидания(СтруктураДействия.Команда,0.1,Истина);
				
			КонецЕсли;
			
		ИначеЕсли (СтруктураДействия.Выполнение = "сервер") Тогда 
			
			Ответ = ВыполнитьДействиеНаСервере(СтруктураДействия);
			
		КонецЕсли;
		
		Если (Ответ <> Неопределено) Тогда
			Если (ТипЗнч(Ответ)=Тип("Структура")) Тогда
				МассивОтветов.Добавить(Ответ);
			Иначе
				Для каждого ЭлементОтвета Из Ответ Цикл
					МассивОтветов.Добавить(ЭлементОтвета);
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если (МассивОтветов.Количество() <> 0) Тогда
		Возврат(ВыполнитьДействие(МассивОтветов)); 
	Иначе
		Возврат(Неопределено);
	КонецЕсли; 
	
	// --- 
КонецФункции
  
&НаСервере
Функция ВыполнитьДействиеНаСервере(СтруктураДействия)
	// --- 
	
	Если (СтруктураДействия.Модуль = "Грузоперевозки") Тогда
		Возврат(CW_Грузоперевозки_Сервер.ВыполнитьДействие(ЭтаФорма,СтруктураДействия));
	ИначеЕсли (СтруктураДействия.Модуль = "Журналы") Тогда 
		Возврат(CW_Журналы_Сервер.ВыполнитьДействие(ЭтаФорма,СтруктураДействия));	
	КонецЕсли; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

// событие всех кнопок панели (!!!)
&НаКлиенте
Процедура ЖурналДействие(Команда)
	
	Если Команда.Имя = "Журнал_ОтключитьОтбор" Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПодтвержденииОчисткиНастроек", ЭтотОбъект, Команда.Имя);
		ПоказатьВопрос(Оповещение, "Отключить все установленные отборы журнала?", Режим, 0);
		
	Иначе
		
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент",СтрЗаменить(Команда.Имя,"Журнал_","/"),Неопределено));
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПодтвержденииОчисткиНастроек(Результат, Параметры) Экспорт
   
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	Если ПроверитьНеобходимостьПодтврежденияОтключенияОтбора() Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупрежденияОДлительностиОчисткиОтбора", ЭтотОбъект,Параметры);
		ПоказатьВопрос(Оповещение, "Очистка всех отборов может занять продолжительное время. Продолжить?", Режим, 0);
		
	Иначе
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент",СтрЗаменить(Параметры,"Журнал_","/"),Неопределено));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупрежденияОДлительностиОчисткиОтбора(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьДействие(_УФКС.СД("Журналы","клиент",СтрЗаменить(Параметры,"Журнал_","/"),Неопределено));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНеобходимостьПодтврежденияОтключенияОтбора()
	
	ЗначениеНастройки = CW_Настройки.ПолучитьНастройкуПользователя(,"ПодтверждатьОтклчюениеОтбораВЖурналах");
	
	Возврат ?(ЗначениеНастройки = Неопределено, Истина, ЗначениеНастройки);
	
КонецФункции


// ---------------------------------------------------------------------------- 


// ---------------------------------------------------------------------------- 
// СОБЫТИЯ Журнала

&НаКлиенте
Процедура ЖурналПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	CW_Журналы_Клиент.ЖурналПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ВыполнитьДействие(CW_Журналы_Клиент.ЗадатьВопросыОчиститьЛибоПометитьНаУдаление(ЭтаФорма,Новый ОписаниеОповещения("ВыполнитьДействия",ЭтотОбъект)));
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПриАктивизацииЯчейки(Элемент)
	
	ПодключитьОбработчикОжидания("ЖурналПриАктивизацииЯчейкиОжидание", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПриАктивизацииЯчейкиОжидание()
	
	CW_Журналы_Клиент.ЖурналПриАктивизацииЯчейки(ЭтаФорма, " ");
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПриАктивизацииПоля(Элемент)
	
	CW_Журналы_Клиент.ЖурналПриАктивизацииПоля(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(НовыйОбъект);
	// --- 
	ВыполнитьДействие(_УФКС.СД("Журналы","сервер","/ОбновитьДанные",МассивСсылок));
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СобытиеЖурналВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	СобытиеЖурналВыбор(Элемент,Элементы.Журнал.ТекущаяСтрока,Элементы.Журнал.ТекущийЭлемент,Истина);
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура СобытиеЖурналВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ЖурналФайлы" Тогда
		_УФК.ОткрытьСписокФайловОбъекта(ЭтаФорма, Элемент.ТекущиеДанные.Ссылка);
	Иначе
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент","/ОткрытьЛибоРедактировать",ВыбраннаяСтрока)); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.CW_Заявки") Тогда
		
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Параметр);
		
		Журнал_ПродолжитьОбновитьСтатусыСтрокЖурналаНаСервере(МассивСсылок);
	
	КонецЕсли;
	
	//РаботаСАрхивомОбъектов
	Если ИмяСобытия = "ПереводИзвлечениеИзАрхива" Тогда
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент", "/Обновить",Неопределено));
	КонецЕсли;              
	//РаботаСАрхивомОбъектов

КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкиВыделенныхСтрокНаСервере(Знач ВыделенныеСтроки)
	
	Возврат CW_Журналы_Сервер.ПолучитьСсылкиВыделенныхСтрок(ЭтаФорма, ВыделенныеСтроки);
	
КонецФункции

//Подсистема.Подключаемые_внешние_команды
&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	МассивСсылок = ПолучитьСсылкиВыделенныхСтрокНаСервере(Элементы.Журнал.ВыделенныеСтроки);
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, МассивСсылок);
	
КонецПроцедуры
//Подсистема.Подключаемые_внешние_команды

//Подсистема.ЛогистическиеСтатусы
&НаКлиенте
Процедура Журнал_ПересчитатьЛогистическиеСтатусы(Команда)
	
	ВыделенныеСтроки = Элементы.Журнал.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивСсылок = ПолучитьМассивСсылокВыделенныхСтрок(ВыделенныеСтроки);

	ЛогистическийСтатусОбновитьНаСервере(МассивСсылок);

КонецПроцедуры

&НаСервере
Процедура ЛогистическийСтатусОбновитьНаСервере(МассивСсылок)
	
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	
	ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ОбновитьДанные", МассивСсылок));

КонецПроцедуры

//Подсистема.ЛогистическиеСтатусы

//Обновление статусов обектов
&НаКлиенте
Процедура ОбновитьСтатусыОбъектов(СтруктураДанных, ДополнительныеПараметры) Экспорт
	
	Журнал_ПродолжитьОбновитьСтатусыСтрокЖурналаНаСервере(ДополнительныеПараметры.МассивСсылок);
		
КонецПроцедуры

&НаСервере
Процедура Журнал_ПродолжитьОбновитьСтатусыСтрокЖурналаНаСервере(МассивСсылок)
	
	ВыполнитьДействиеНаСервере(_УФКС.СД("Журналы","сервер","/ОбновитьДанные", МассивСсылок));

КонецПроцедуры
//Обновление статусов обектов

&НаКлиенте
Функция ПолучитьМассивСсылокВыделенныхСтрок(Знач ВыделенныеСтроки)
	
	МассивСсылок = Новый Массив;
	
	Для Каждого ИдентификаторСтроки из  ВыделенныеСтроки Цикл
		ВыделеннаяСтрока = Журнал_Данные.НайтиПоИдентификатору(ИдентификаторСтроки);
		МассивСсылок.Добавить(ВыделеннаяСтрока.Ссылка);
	КонецЦикла;
	
	Возврат МассивСсылок;

КонецФункции


//РаботаСАрхивомОбъектов
&НаКлиенте
Процедура ИзвлечьИзАрхива(Команда)  

	ВыделенныеСтроки = Элементы.Журнал.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрКоманды = новый Массив;
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТекущая = Журнал_Данные.НайтиПоИдентификатору(ИдентификаторСтроки);
		ПараметрКоманды.Добавить(СтрокаТекущая.Ссылка);
	КонецЦикла;
	
	ОдинОбъект	= "заявку";
	Несколько 	= "заявки";
	
	Если ПараметрКоманды.Количество() = 1 Тогда
		ТекстВопроса = СтрШаблон("Извлечь %1 в архива?", ОдинОбъект);	
	Иначе
		ТекстВопроса = СтрШаблон("Извлечь %1 в архива?", Несколько);	
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;    
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник", ЭтаФорма);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды", 			ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", 	ПараметрыВыполненияКоманды);
	ДополнительныеПараметры.Вставить("Архив", 						Ложь);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВАрхив(Команда)   
	
	ВыделенныеСтроки = Элементы.Журнал.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрКоманды = новый Массив;
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТекущая = Журнал_Данные.НайтиПоИдентификатору(ИдентификаторСтроки);
		ПараметрКоманды.Добавить(СтрокаТекущая.Ссылка);
	КонецЦикла;
	
	ОдинОбъект	= "заявку";
	Несколько 	= "заявки";
	
	Если ПараметрКоманды.Количество() = 1 Тогда
		ТекстВопроса = СтрШаблон("Перевести %1 в архив?", ОдинОбъект);	
	Иначе
		ТекстВопроса = СтрШаблон("Перевести %1 в архив?", Несколько);	
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет; 

	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник", ЭтаФорма);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды", 			ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", 	ПараметрыВыполненияКоманды);
	ДополнительныеПараметры.Вставить("Архив", 						Истина);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;   

	Источник 		= ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник;
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	
	CW_АрхивОбъектовКлиент.ПеревестиИзвлечьОбъектыИзАрхива(Источник, ПараметрКоманды, ДополнительныеПараметры.Архив);
		
КонецПроцедуры    
//РаботаСАрхивомОбъектов


//Работа с буфером обмена 
&НаКлиенте
Процедура СкопироватьВБуферОбмена(Команда) 
	
	ВыделенныеСтроки = Элементы.Журнал.ВыделенныеСтроки;
	МассивСсылок = ПолучитьМассивСсылокВыделенныхСтрок(ВыделенныеСтроки);
	
	СкопироватьНаСервере(МассивСсылок);
	
	CW_РаботаСБуферомОбменаКлиент.ОповеститьОКопированииСтрокВБуферОбмена(ЭтаФорма, МассивСсылок.Количество());
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНаСервере(ПараметрКоманды) 
	
	CW_РаботаСБуферомОбмена.СкопироватьВБуферОбмена(ПараметрКоманды, ПараметрКоманды[0].Метаданные().Имя);
	
КонецПроцедуры
//Работа с буфером обмена


//Прикрепление файлов
&НаКлиенте
Процедура ПрикрепитьФайлы(Команда)
	
	Отказ = Истина;  
	
	МассивВладельцев = Новый Массив;
	
	ВыделенныеСтроки = Элементы.Журнал.ВыделенныеСтроки;   
	Для Каждого ИдентифкаторСтроки из ВыделенныеСтроки Цикл
		ВыбраннаяСтрока = Журнал_Данные.НайтиПоИдентификатору(ИдентифкаторСтроки);
		МассивВладельцев.Добавить(ВыбраннаяСтрока.Ссылка);
	КонецЦикла;
	
	ОбработчикРезультата = Новый ОписаниеОповещения("ПрикрепитьФайлыЗавершение", ЭтотОбъект);
	
	CW_РаботаСФайламиКлиент.ПрикрепитьФайлы(МассивВладельцев, ЗапрашиватьТипФайлаПриДобавленииВАрхив, ОбработчикРезультата);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПрикрепитьФайлыЗавершение(Результат, Дополнительныепараметры) ЭКспорт
	
	Если Результат Тогда
		ВыполнитьДействие(_УФКС.СД("Журналы","клиент","/Обновить",Неопределено));
	КонецЕсли;
	
КонецПроцедуры
//Прикрепление файлов

//ЗагрузкаИзВнешнегоИсточника
&НаКлиенте
Процедура ЗагрузкаИзВнешнегоИсточника(Команда)
	
	ТекущиеДанные = Элементы.Журнал.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ОбъектОтбора",ТекущиеДанные.Ссылка);
	ОткрытьФорму("Обработка.CW_ЗагрузкаПараметровГрузоперевозокИзФайла.Форма", ПараметрыФормы, ЭтаФорма);  

КонецПроцедуры    
//ЗагрузкаИзВнешнегоИсточника

//Подсистема CW_РеестрыНДС0
&НаКлиенте
Процедура CW_РеестрыНДС0Проверить(Команда)
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда 
		МассивСсылок = ПолучитьСсылкиВыделенныхСтрокНаСервере(Элементы.Журнал.ВыделенныеСтроки);
		
		МодульCW_РеестрыНДС0Клиент = CW_ОбщегоНазначенияКлиент.ОбщийМодуль("CW_РеестрыНДС0Клиент");	
		МодульCW_РеестрыНДС0Клиент.ПодготовитьДанныеЗаписиРеестраНДС(МассивСсылок, ЭтаФорма);  
	КонецЕсли;
	
КонецПроцедуры
//Подсистема CW_РеестрыНДС0


&НаКлиенте
Процедура ОтчетАнализИсполненияБюджетаГрузоперевозок(Команда)

	ПараметрКоманды = ПолучитьСсылкиВыделенныхСтрокНаСервере(Элементы.Журнал.ВыделенныеСтроки);
	Если ПараметрКоманды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник", ЭтаФорма);
	
	CW_БюджетированиеКлиент.СформироватьОтчетАнализИсполненияБюджетаГрузоперевозок(ПараметрКоманды, ПараметрыВыполненияКоманды);

КонецПроцедуры  

//Отчет "Анализ бюджета"
&НаКлиенте
Процедура ОтчетАнализБюджета(Команда)
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник", ЭтаФорма);

	ПараметрКоманды = ПолучитьСсылкиВыделенныхСтрокНаСервере(Элементы.Журнал.ВыделенныеСтроки);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрКоманды", 			ПараметрКоманды); 
	ПараметрыФормы.Вставить("ВидСтатьи", 				0); 
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", 	Истина); 
	ПараметрыФормы.Вставить("ВариантГруппировки", 		"ЗАЯВКА");     

	ОткрытьФорму("Отчет.CW_АнализБюджета.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры         
//Отчет "Анализ бюджета"

//Фоновое обновление журнала
&НаКлиенте
Процедура ВыполнитьФоновоеОбновлениеЖурнала()   
	
	РезультатВыполнения = ПродолжитьФоновоеОбновлениеЖурналаНаСервереВФоне();
	ПараметрыОжидания 	= ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатФоновогоОбновления", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры  

&НаСервере 
Функция ПродолжитьФоновоеОбновлениеЖурналаНаСервереВФоне()  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    		= 0;    
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне     			= Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне			= ложь;   
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("СКД",				ПолучитьИзВременногоХранилища(Журнал_СхемаКомпоновки));
	ПараметрыПроцедуры.Вставить("НастройкиСКД",		Журнал_КомпоновщикНастроек.ПолучитьНастройки());
  	ПараметрыПроцедуры.Вставить("УстанавливаемыеПараметры",	Новый Структура);

	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_Журналы_Сервер.ПодготовитьДанные",ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции       

&НаКлиенте 
Процедура ОбработатьРезультатФоновогоОбновления(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда 
		
		Если Не АктивноРедактированиеВРежимеExcel Тогда  
			
			ЕстьПолеСсылка = ЕстьПолеСсылка();
			Если ЕстьПолеСсылка Тогда
				УстановитьТекущуюССылку(Элементы.Журнал.ТекущаяСтрока);
			КонецЕсли;
			
			ОбработатьРезультатФоновогоОбновленияНаСервере(РезультатВыполнения.АдресРезультата);   
			
			Если ЕстьПолеСсылка Тогда
				ТекущаяСтрока = ПолучитьТекущуюСтрокуЖурнала(); 
				Если ТекущаяСтрока <> Неопределено Тогда
					Элементы.Журнал.ТекущаяСтрока = ТекущаяСтрока;
				КонецЕсли;
			КонецЕсли;

			Если ПараметрыФоновогоОбновления.Оповещать Тогда
				ПоказатьОповещениеПользователя("Журнал заявок", ,"Данные обновлены"); 
			КонецЕсли;
			
		КонецЕсли;

	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ОтключитьОбработчикОжидания("ВыполнитьФоновоеОбновлениеЖурнала");

		ПоказатьОповещениеПользователя("Журнал заявок", ,	"Ошибка фонового обновления журнала. 
															|Подробности см. в журнале регистрации."); 
		
	КонецЕсли;  
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьРезультатФоновогоОбновленияНаСервере(АдресРезультата)

	CW_Журналы_Сервер.ЗагрузитьДанные(ЭтаФорма, АдресРезультата);
	
КонецПроцедуры  

&НаСервере
Функция ЕстьПолеСсылка() 
	
	ТаблицаЖурнала = Журнал_Данные.Выгрузить();
	Возврат ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТаблицаЖурнала.Колонки, "ссылка");
	
КонецФункции

&НаСервере
Функция ПолучитьТекущуюСтрокуЖурнала()
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ссылка", ТекущаяСсылка); 
	
	НайденныеСтроки = Журнал_Данные.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		//Должна быть одна строка  
		Возврат НайденныеСтроки[0].ПолучитьИдентификатор();				
	КонецЕсли;

КонецФункции    

&НаСервере
Процедура УстановитьТекущуюССылку(Знач ТекущаяСтрока) 

	Если ТекущаяСтрока = Неопределено Тогда  
		ТекущаяСсылка = Неопределено;
		Возврат;
	КонецЕсли;
	
	СтрокаЖурнала = Журнал_Данные.НайтиПоИдентификатору(ТекущаяСтрока);
	ТекущаяСсылка = СтрокаЖурнала.ссылка;
	
КонецПроцедуры
//Фоновое обновление журнала

//CW_АнализПрибылиПоГрузоперевозкам
&НаКлиенте
Процедура Отчет_АнализПрибылиПоГрузоперевозкам(Команда)

	Заявки = ПолучитьСсылкиВыделенныхСтрокНаСервере(Элементы.Журнал.ВыделенныеСтроки);
	
	Грузоперевозки = ПолучитьГрузоперевозокиЗаявокНаСервере(Заявки);
	
	CW_Грузоперевозки_Клиент.ОткытьОтчетАнализПрибылиПоГрузоперевозкам(ЭтаФорма, Грузоперевозки);
	
КонецПроцедуры            

&НаСервере
Функция  ПолучитьГрузоперевозокиЗаявокНаСервере(Заявки)
	
	Возврат Справочники.CW_Заявки.ПолучитьМассивГрузоперевозокЗаявки(Заявки);
	
КонецФункции
//CW_АнализПрибылиПоГрузоперевозкам
