
&НаКлиенте
Процедура Подбор(Команда)
	
	ОпианиеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФизическихЛиц", ЭтотОбъект);
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыФормыВыбора, ЭтаФорма,,,,ОпианиеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьВыборФизическихЛиц(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		КлючЗаписи = ОбработатьРезультатВыбораНаСервере(РезультатВыбора);
		ОповеститьОбИзменении(КлючЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция  ОбработатьРезультатВыбораНаСервере(мФизическиеЛица)
	
	Для Каждого ФизическоеЛицо из мФизическиеЛица Цикл
		
		ЗаписьРегистра = РегистрыСведений.CW_ДействующиеМенеджеры.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Менеджер = ФизическоеЛицо;
		
		Если ЗаписьРегистра.Выбран() Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьРегистра.Менеджер = ФизическоеЛицо;
		ЗаписьРегистра.Записать();
		
	КонецЦикла;
	
	ЗначенияКлюча = Новый Структура("Менеджер",ФизическоеЛицо);
	Возврат РегистрыСведений.CW_ДействующиеМенеджеры.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции