&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДобавленныеКолонки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонки()
	
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	Для Каждого ТекущаяСтрока из Объект.ДополнительныеХарактеристики Цикл
		Параметр = ТекущаяСтрока.Параметр;
		ТекущаяСтрока.СоставДаты = CW_ДополнительныеХарактиристикиДоговоровСервер.ПолучитьСоставДатыСтроки(Параметр.ТипЗначения.КвалификаторыДаты.ЧастиДаты);
	КонецЦикла;
	//Подсистема.ДополнительныеХарактиристикиДоговоров
	
КонецПроцедуры

//Подсистема.ДополнительныеХарактиристикиДоговоров
&НаКлиенте
Процедура ДополнительныеХарактеристикиПараметрПриИзменении(Элемент)
	
	ОбработатьИзменениеПараметраНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПараметраНаСервере()
	
	ИдентификаторСтроки = Элементы.ДополнительныеХарактеристики.ТекущаяСтрока;
	ТекущаяСтрока 		= Объект.ДополнительныеХарактеристики.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ПараметрыОтбора = Новый Структура("Параметр", ТекущаяСтрока.Параметр);
	мСтроки = Объект.ДополнительныеХарактеристики.НайтиСтроки(ПараметрыОтбора);
	
	Если мСтроки.Количество() > 1 Тогда
		ТекущаяСтрока.Параметр = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранный параметр уже есть в списке!");
	Иначе
		Если ЗначениеЗаполнено(ТекущаяСтрока.Параметр) Тогда
			CW_ДополнительныеХарактиристикиДоговоровСервер.ОбработатьДанныеСтроки(ТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиПараметрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_ДополнительныеХарактиристикиДоговоровКлиент.ПараметрНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеХарактеристикиЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеВыбораЗначения(ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДополнительныеХарактеристики.ТекущиеДанные;
	Если ТекущиеДанные.ОграниченСпискомЗначений Тогда
		ДанныеВыбора = ПолучитьСписокВыбораНаСервере();
		СтандартнаяОбработка = ДанныеВыбора = Неопределено;
	Конецесли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВыбораНаСервере()
	
	мДоступныеЗначения = ПолучитьСписокВыбораПараметра();
	Если мДоступныеЗначения <> Неопределено Тогда
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.ЗагрузитьЗначения(мДоступныеЗначения);
		
		Возврат СписокВыбора;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокВыбораПараметра() Экспорт
	
	ИдентификаторСтроки = Элементы.ДополнительныеХарактеристики.ТекущаяСтрока;
	ТекущаяСтрока 		= Объект.ДополнительныеХарактеристики.НайтиПоИдентификатору(ИдентификаторСтроки);
	Параметр 			= ТекущаяСтрока.Параметр;
	
	Если Параметр.ОграниченСпискомЗначений Тогда
		мДоступноеЗначение = Параметр.ДоступныеЗначения.ВыгрузитьКолонку("ДоступноеЗначение");
		Возврат мДоступноеЗначение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ДополнительныеХарактеристикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = истина;
	Конецесли;
	
КонецПроцедуры
//Подсистема.ДополнительныеХарактиристикиДоговоров


