#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 					= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 				= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 				= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешняяПодписка();
	СтруктураОписания.ИмяВидаПодписки 	= CW_ПодключаемыеКомандыСервер.ИмяВидаПодпискиОбработчикПередЗаписью();

	СтруктураОписания.Наименование 				= "Пример внешней подписки";
	СтруктураОписания.Описание 					= "Пример внешней подписки";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	СтруктураОписания.Настройка 	= Истина;
	
	//Описание форм
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыНастроекОбъекта(СтруктураОписания, 	"ФормаНастроек");  

	//метеданные подписки
	CW_ПодключаемыеКомандыСервер.УстановитьМетаданныеВнешнейПодписки(СтруктураОписания, "Документ.CW_ДоходыПоГрузоперевозке");  

	Возврат СтруктураОписания;
	
КонецФункции

Функция Использование(Источник, Отказ) Экспорт
	
	//условия использования текущей обработки подписки на событие
	
	Возврат Не Отказ;
	
КонецФункции

//Обработчики видов подписок
Процедура ОбработчикПередЗаписью(ПодключаемыйОбъект, Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи <>  РежимЗаписиДокумента.Проведение тогда
		Возврат;
	КонецЕсли;
	
	//получаем настройки при их наличии
	СтруктураНастроек = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъект);
	
	Если СтруктураНастроек <> Неопределено Тогда
		
		Если СтруктураНастроек.Свойство("Параметр") Тогда
			Источник.Комментарий = "Параметр внешней подписки: "+ СтруктураНастроек.Параметр;
		КонецЕсли;
		
	КонецЕсли;
	
	//Код обработичка события "ПередЗаписью"
	
КонецПроцедуры	

Процедура ОбработчикПриЗаписи(ПодключаемыйОбъект, Источник, Отказ) экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//получаем настройки при их наличии
	СтруктураНастроек = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъект);
	
	Если СтруктураНастроек <> Неопределено Тогда
		
		
	КонецЕсли;
	


	//Код обработичка события "ПриЗаписи"
	
	
КонецПроцедуры

Процедура ОбработчикПриПроведении(ПодключаемыйОбъект, Источник, Отказ, РежимПроведения) экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//получаем настройки при их наличии
	СтруктураНастроек = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъект);
	
	Если СтруктураНастроек <> Неопределено Тогда
		
		
	КонецЕсли;
	

	//Код обработичка события "ПриПроведении"
	
	
КонецПроцедуры

Процедура ОбработчикПередУдалением(ПодключаемыйОбъект, Источник, Отказ) экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//получаем настройки при их наличии
	СтруктураНастроек = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъект);
	
	Если СтруктураНастроек <> Неопределено Тогда
		
		
	КонецЕсли;
	

	//Код обработичка события "ПередУдалением"
	
	
КонецПроцедуры

#КонецЕсли