
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	CW_ОбновлениеКонфигурацииКлиент.ВыполнитьПервыйЗапускКонфигурации();

КонецПроцедуры

//Страница Регистрация
&НаКлиенте
Процедура Регистарция_ПоказатьСкрытьПароль(Команда)
	Регистарция_ПоказатьСкрытьПарольНаСервере();
КонецПроцедуры  

&НаСервере
Процедура Регистарция_ПоказатьСкрытьПарольНаСервере()
	
	Регистарция_ПоказатьСкрытьПароль = Не Регистарция_ПоказатьСкрытьПароль;
	Элементы.Регистарция_ПоказатьСкрытьПароль.Картинка = ?(Регистарция_ПоказатьСкрытьПароль, БиблиотекаКартинок.СкрытьПароль, БиблиотекаКартинок.ПоказатьПароль);
	
	Элементы.Регистарция_Пароль.РежимПароля = НЕ Регистарция_ПоказатьСкрытьПароль;
	
КонецПроцедуры

&НаКлиенте
Процедура Регистрация_ПроверитьПодключение(Команда)
	
	Если ПроверитьПодключениеКПорталуПоддержкиНаСервере() Тогда
		ПоказатьПредупреждение(,"Подключение выполнено успешно",60,"Проверка подключения");
	Иначе
		ПоказатьПредупреждение(,"Не удалось подключиться к серверу технической поддержки! Проверьте правильность введенных данных.",60,"Проверка подключения");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПодключениеКПорталуПоддержкиНаСервере()

	HTTPСоединение = CW_ИсправленияКонфигурации.ПодключитьсяКРесурусуОбновлений(Регистарция_Логин, Регистарция_Пароль);
	Возврат НЕ HTTPСоединение = Неопределено;
	
КонецФункции   

&НаКлиенте
Процедура Регистрация_Продолжить(Команда)   
	
	Отказ = Ложь;
	ПроверитьЗаполнениеДанныхРегистрации(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Регистрация_ПродолжитьНаСервере();  
	
КонецПроцедуры  

&НаКлиенте
Процедура ПроверитьЗаполнениеДанныхРегистрации(Отказ)

	Если ПустаяСтрока(Регистарция_Логин) Тогда  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан логин", ,"Регистарция_Логин",, Отказ);
	КонецЕсли;  
	
	Если ПустаяСтрока(Регистарция_Пароль) Тогда  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Пароль не может быть пустым", ,"Регистарция_Пароль",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Регистрация_ПродолжитьНаСервере()
	
	ВладелецДанных = CW_МониторПорталаПоддержкиСервер.ИдентификаторПодсистемы();     
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ВладелецДанных, Регистарция_Логин, 	"login");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ВладелецДанных, Регистарция_Пароль, "password");
	
	Успешно = CW_ОбщийМодульЛичныйКабинетСервер.СоздатьОбновитьПользователяЛичногоКабинета();	 
	Если Не Успешно Тогда
		Возврат;
	КонецЕсли;   
	
	РегистрационныйНомер = Сред(Регистарция_Логин, 2);
	
	//Переходим на страницу регистарции
	Элементы.СтраницыПервогоЗапуска.ТекущаяСтраница = Элементы.СтраницаРегистрацияПрограммы;
	
КонецПроцедуры

&НаКлиенте
Процедура Регистарция_ПолучитьКлюч(Команда)

	Если РежимПолученияКлюча = 1 Тогда
		Фильтр = "Лицензия CoralWay (*.lcw)|*.lcw";
		ПараметрыДиалога 	= Новый ПараметрыДиалогаПомещенияФайлов("Выберите помещаемый файл", Ложь, Фильтр);
		ОписаниеОповещения 	= Новый ОписаниеОповещения("ЗавершитьПомещениеФайла", ЭтотОбъект);
		
		НачатьПомещениеФайлаНаСервер(ОписаниеОповещения,,,, ПараметрыДиалога, УникальныйИдентификатор);
	Иначе    
		CW_РегистрацияПрограммыКлиент.ПолучитьКлючЧерезИнтернетПоддержку(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры 

 &НаКлиенте
Процедура ЗавершитьПомещениеФайла(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ОбработатьКлючНаСервере(ОписаниеПомещенногоФайла.Адрес);
	
	CW_ОбновлениеКонфигурацииКлиент.ЗавершитьПервыйЗапускКонфигурации(ЭтаФорма);
	
	Если РегистарцияВыполнена Тогда  
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветУстановкиНачальнойСтраницы", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, 	"Начальное заполнение информационной базы завершено. 
			|Установить рабочий стол ""Бухгалтерия экспедитора 8"" в качестве начальной страницы?", Режим, 0);  
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьУспешныйВводПинкодаНаСервере()
	
	ОбработатьКлючНаСервере();  
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьКлючНаСервере(Адрес = Неопределено)
	
	CW_РегистрацияПрограммыСервер.ОбработатьПолучениеЛицензионногоКлюча(ЭтаФорма, РегистрационныйНомер, Адрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненыПроцедурыПервогоЗапуска" Тогда   
		
		Элементы.СтраницыПервогоЗапуска.ТекущаяСтраница 	= Элементы.СтраницаВводЛогинаИПароля;  
		
	ИначеЕсли ИмяСобытия = "ПервыйЗапускПрограммыВыполнен" Тогда   
		
		ЭтоПервыйЗапуск  = Ложь;
		
		ОбработатьУспешныйВводПинкодаНаСервере();
		CW_ОбновлениеКонфигурацииКлиент.ЗавершитьПервыйЗапускКонфигурации(ЭтаФорма); 
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветУстановкиНачальнойСтраницы", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, 	"Начальное заполнение информационной базы завершено. 
									|Установить рабочий стол ""Бухгалтерия экспедитора 8"" в качестве начальной страницы?", Режим, 0);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветУстановкиНачальнойСтраницы(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ОткрытьФорму("Обработка.CW_РабочийСтол_БЭ.Форма");
	Иначе
		ВключитьРабочийСтолВНачальныеНастройки();  
		ОбновитьИнтерфейс();
	КонецЕсли;
	
	ЭтаФорма.Закрыть();  
	
КонецПроцедуры  

 &НаСервере
Процедура ВключитьРабочийСтолВНачальныеНастройки() 
	
	CW_БухгалтерияЭкспедитораСервер.ВключитьРабочийСтолБухгалтерияЭкспедитора();
	
КонецПроцедуры


//Странциа Регистрация
