#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ЗаписатьНаличеОригиналов(СтруктураПараметров) Экспорт
	
	//Признак наличия оригиналов документо
	НаборНаличияОригиналов = РегистрыСведений.CW_ПризнакНаличияОригиналовДокументов.СоздатьНаборЗаписей();
	НаборНаличияОригиналов.Отбор.ДокументСсылка.Установить(СтруктураПараметров.Ссылка);
	НаборНаличияОригиналов.Очистить();
	
	Запись = НаборНаличияОригиналов.Добавить();
	Запись.ДокументСсылка 			= СтруктураПараметров.Ссылка;
	Запись.ОригиналыПредоставлены 	= СтруктураПараметров.Признак;
	Запись.ДатаПолучения 			= СтруктураПараметров.ДатаВозврата;
	НаборНаличияОригиналов.Записать(Истина);
	
	Если ТипЗнч(СтруктураПараметров.Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") 
		Или ТипЗнч(СтруктураПараметров.Ссылка) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		ЗаписатьСтатусВедомыхДокументов(СтруктураПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСтатусВедомыхДокументов(СтруктураПараметров)
	//Запись статусов документов
	НовыйСтатус 		= Неопределено;
	МассивДокументов 	= Новый Массив;
	МассивСчетФактур 	= Новый Массив;
	
	Если ТипЗнч(СтруктураПараметров.Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		
		Если СтруктураПараметров.Признак Тогда
			НовыйСтатус = Перечисления.СтатусыДокументовРеализации.Подписан;
		Иначе
			НовыйСтатус = Перечисления.СтатусыДокументовРеализации.НеПодписан;
		КонецЕсли; 
		МассивДокументов.Добавить(СтруктураПараметров.ВедомыйДокумент);	
		
	ИначеЕсли ТипЗнч(СтруктураПараметров.Ссылка) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда 
		
		Если СтруктураПараметров.Признак Тогда
			НовыйСтатус = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;
			
			Если СтруктураПараметров.Ссылка.ПредъявленСФ Тогда
				СтатусОригиналаСФ = Перечисления.СтатусыДокументовПоступления.ОригиналПолучен;	
			КонецЕсли;
			
		Иначе
			НовыйСтатус 		= Перечисления.СтатусыДокументовПоступления.ОригиналНеПолучен;
			СтатусОригиналаСФ 	= Перечисления.СтатусыДокументовПоступления.ОригиналНеПолучен;	
		КонецЕсли;
		МассивДокументов.Добавить(СтруктураПараметров.ВедомыйДокумент);	
		
		Если ЗначениеЗаполнено(СтруктураПараметров.ВедомыйСчетФактура) Тогда
			Если СтруктураПараметров.ВедомыйСчетФактура.Проведен Тогда
				СтатусСФ = Перечисления.СтатусыСчетаФактуры.Проведен;
			Иначе
				СтатусСФ = Перечисления.СтатусыСчетаФактуры.Проведен;
			КонецЕсли;
		
			МассивСчетФактур.Добавить(СтруктураПараметров.ВедомыйСчетФактура);	
		КонецЕсли

		
	КонецЕсли; 
	
	Если МассивДокументов.Количество() > 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
		СтатусыДокумента.Статус 			= НовыйСтатус;
		СтатусыДокумента.СтатусСФ 			= СтатусСФ;
		СтатусыДокумента.СтатусОригиналаСФ 	= СтатусОригиналаСФ;
		
		РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокументов(МассивДокументов, СтатусыДокумента);	
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
	Если МассивСчетФактур.Количество() > 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
		СтатусыДокумента.Статус 			= НовыйСтатус;
		СтатусыДокумента.СтатусСФ 			= СтатусСФ;
		СтатусыДокумента.СтатусОригиналаСФ 	= СтатусОригиналаСФ;
		
		РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокументов(МассивСчетФактур, СтатусыДокумента);	
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
КонецПроцедуры

#КонецЕсли