
Процедура ДобавитьЗаписьВРегистр(ЭПД, СвязанныйЭПД) Экспорт  
	
	Запись = РегистрыСведений.CW_ОбменГИСЭПДСвязанныеДокументыЭПД.СоздатьМенеджерЗаписи();
	Запись.ПроформаТитулаЭПД = ЭПД;
	Запись.СвязанныйЭПД = СвязанныйЭПД;
	Запись.Записать(Истина);	
	
КонецПроцедуры  

Функция ПолучитьСвязанныйДокументЭПД(ЭПД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОбменГИСЭПДСвязанныеДокументыЭПД.СвязанныйЭПД КАК СвязанныйЭПД
	|ИЗ
	|	РегистрСведений.CW_ОбменГИСЭПДСвязанныеДокументыЭПД КАК CW_ОбменГИСЭПДСвязанныеДокументыЭПД
	|ГДЕ
	|	CW_ОбменГИСЭПДСвязанныеДокументыЭПД.ПроформаТитулаЭПД = &ПроформаТитулаЭПД"; 
	
	Запрос.УстановитьПараметр("ПроформаТитулаЭПД", ЭПД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СвязанныйЭПД;
	КонецЕсли;
	
КонецФункции