// @strict-types

#Область ПрограммныйИнтерфейс

// Создает новый документ ЭТрН для отправки через сервис 1С:EDI
//
// Важно:
//  Перед открытием формы ЭТрН будут проверены/созданы настройки обмена между 
//  Организация и Контрагент для обмена через сервис 1С:EDI.
//
// Параметры:
//  Организация                 - ОпределяемыйТип.Организация                - Грузоотправитель по ЭТрН
//  Контрагент                  - ОпределяемыйТип.УчастникЭДО                - Грузополучатель по ЭТрН
//  ДокументОснования           - ОпределяемыйТип.ДокументыОснованияЭТрН_ЭПД - Документ-основания ЭТрН
//  ФормаВладелец               - ФормаКлиентскогоПриложения                 - Форма, из которой открывается форма документа ЭТрН
//                              - Неопределено                               - Форма не задана
//  АдресХранилищаИнфоПолейЭТрН - Строка                                     - адрес хранилища таблицы инфополей ЭТрН
//                              - Неопределено                               - Таблица инфополей не передана
//  Оповещение                  - ОписаниеОповещения                         - Обработчик завершения работы с ЭТрН
//                              - Неопределено                               - Оповещать не требуется
Процедура СоздатьЭТрН(
	Знач Организация,
	Знач Контрагент,
	Знач ДокументОснования = Неопределено,
	Знач ФормаВладелец = Неопределено,
	Знач АдресХранилищаИнфоПолейЭТрН = Неопределено,
	Знач Оповещение = Неопределено) Экспорт
	
	СервисEDIСлужебныйКлиент.СоздатьЭТрН(
		Организация,
		Контрагент,
		ДокументОснования,
		ФормаВладелец,
		АдресХранилищаИнфоПолейЭТрН,
		Оповещение);
	
КонецПроцедуры

// Получить сообщения.
// 
// Параметры:
//  ФормаВладелец     - ФормаКлиентскогоПриложения                     - Форма, из которой открывается форма 
//                                                                       документа ЭТрН.
//                    - Неопределено                                   - Форма не задана
//  Оповещение        - ОписаниеОповещения                             - Обработчик завершения работы с ЭТрН
//                    - Неопределено                                   - Оповещать не требуется
//  ПараметрыОжидания - См. ДлительныеОперацииКлиент.ПараметрыОжидания
//                    - Неопределено                                   - Стандартные параметры ожидания
Процедура ПолучитьСообщения(
	Знач ФормаВладелец = Неопределено, 
	Знач Оповещение = Неопределено, 
	Знач ПараметрыОжидания = Неопределено) Экспорт
	СервисEDIСлужебныйКлиент.ПолучитьСообщения(ФормаВладелец, Оповещение, ПараметрыОжидания);
КонецПроцедуры

#КонецОбласти
