
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОснование 	= Параметры.Основание;
	ДатаДокумента 		= Параметры.Дата;
	
	ПолчитьДанныеДокументаОснования(Отказ)
	
КонецПроцедуры

&НаСервере
Процедура ПолчитьДанныеДокументаОснования(Отказ)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Покупатель КАК Контрагент,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ДоговорПокупателя КАК Договор,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.Валюта КАК Валюта,
	               |	СУММА(CW_РасходыПоГрузоперевозкеУслуги.Всего) КАК Сумма
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Основание
	               |	И CW_РасходыПоГрузоперевозкеУслуги.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_РасходыПоГрузоперевозкеУслуги.Покупатель,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ДоговорПокупателя,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ПриложениеКДоговору,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.Валюта";
	
	Запрос.УстановитьПараметр("Основание", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для ввода на основании!",,,,Отказ);
	КонецЕсли;
	
	ДанныеДокумента.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыполнитьВыборДанных(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВводНаосновании(Команда)
	
	ТекущаяСтрока = Элементы.ДанныеДокумента.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(,"Не выбраны данные для заполнения!");
		Возврат;
	КонецЕсли;
	
	ВыполнитьВыборДанных(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыборДанных(ВыбраннаяСтрока)
	
	АдресДанных = ОбработатьВыборДанныхДокумента(ВыбраннаяСтрока);
	ЭтаФорма.Закрыть(АдресДанных);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьВыборДанныхДокумента(ВыбраннаяСтрока)
	
	СтрокаДанных = ДанныеДокумента.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Организация", 		ДокументОснование.Организация);
	СтруктураДанных.Вставить("Контрагент", 			СтрокаДанных.Контрагент);
	СтруктураДанных.Вставить("Договор", 			СтрокаДанных.Договор);
	СтруктураДанных.Вставить("ПриложениеКДоговору", СтрокаДанных.ПриложениеКДоговору);
	СтруктураДанных.Вставить("ДатаДокумента", 		ДатаДокумента);
	СтруктураДанных.Вставить("ДокументОснование", 	ДокументОснование);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураДанных, Новый УникальныйИдентификатор);
	
КонецФункции