
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма);
	
	#Область ПолучениеКартинки
	
	к = РеквизитФормыВЗначение("Объект").ХранилищеКартинки.Получить();
	Если к <> Неопределено Тогда
		
		АдресКартинки = ПоместитьВоВременноеХранилище(к,ЭтаФорма.УникальныйИдентификатор);
		
	Иначе
		
		АдресКартинки = "";
		
	КонецЕсли;
	
	#КонецОбласти 
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если (ЭтоАдресВременногоХранилища(АдресКартинки)) Тогда
		Нечто = ПолучитьИзВременногоХранилища(АдресКартинки);
		Если (ТипЗнч(Нечто) = Тип("Картинка")) Тогда
			ТекущийОбъект.ХранилищеКартинки = Новый ХранилищеЗначения(Нечто.ПолучитьДвоичныеДанные());
		Иначе
			ТекущийОбъект.ХранилищеКартинки = Новый ХранилищеЗначения(Нечто);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

#Область ИзменениеКартинки 

&НаКлиенте
Процедура ВыбратьКартинку(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("коллекция","Из коллекции",,БиблиотекаКартинок.ПанельНастроек);//БиблиотекаКартинок.ПанельПользователя);
	СписокВыбора.Добавить("файл","Из файла",,БиблиотекаКартинок.ОткрытьФайл);
	СписокВыбора.Добавить("очистить","Очистить",,БиблиотекаКартинок.Очистить);
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВариантаПиктограммы",ЭтотОбъект); 
	ПоказатьВыборИзМеню(ПОВ,СписокВыбора,Элементы.ВыбратьКартинку);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВариантаПиктограммы(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		Если Ответ.Значение = "коллекция" Тогда
			
			// выбираем из списка
			Если СписокКартинок.Количество() = 0 Тогда
				
				_ЗаполнитьСписокКартинок();
				
			КонецЕсли; 
			ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПиктограммы",ЭтотОбъект); 
			СписокКартинок.ПоказатьВыборЭлемента(ПОВ,"Выберите пиктограмму");
			
		ИначеЕсли Ответ.Значение = "файл" Тогда 
			
			Режим = РежимДиалогаВыбораФайла.Открытие;
			ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
			ДиалогОткрытияФайла.ПолноеИмяФайла = "";
			//Текст = "ru = ""Текст""; en = ""Text""";
			Фильтр = "PNG|*.png|GIF|*.gif|BMP|*.bmp";
			ДиалогОткрытияФайла.Фильтр = Фильтр;
			ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
			ДиалогОткрытияФайла.Заголовок = "Выберите файл";
			Если ДиалогОткрытияФайла.Выбрать() Тогда
				
				МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
				Файл = МассивФайлов[0];
				
				АдресФайла = "";
				ПОВ = Новый ОписаниеОповещения("ОбработкаЗагрузкиФайла",ЭтотОбъект, Новый Структура()); 
				НачатьПомещениеФайла(ПОВ,АдресФайла,Файл,Ложь,УникальныйИдентификатор);
				
			Иначе
				Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
				_УФК.ВывестиПредупреждение(НСтр(Текст));
			КонецЕсли;
			
		ИначеЕсли Ответ.Значение = "очистить" Тогда 
			
			АдресКартинки=ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗагрузкиФайла(Результат, АдресВременногоХранилищаФайла, ВыбранноеИмя, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Результат) Тогда
		
		Ответ = _ОбработатьЗагрузкуФайла(АдресВременногоХранилищаФайла);
		Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ОбработкаВыбораПиктограммы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		_ОбработатьВыборКартинки(Ответ.Значение);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Процедура _ЗаполнитьСписокКартинок()

	СписокКартинок.Очистить();
	CW_ОбщегоНазначения.ЗаполнитьСписокКартинок(СписокКартинок); 

КонецПроцедуры

&НаСервере
Функция _ОбработатьВыборКартинки(Элемент)
	// --- 
	
	ДД = БиблиотекаКартинок[Элемент].ПолучитьДвоичныеДанные();
	АдресКартинки = ПоместитьВоВременноеХранилище(ДД,ЭтаФорма.УникальныйИдентификатор);
	
	// --- 
КонецФункции

&НаСервере
Функция _ОбработатьЗагрузкуФайла(Адрес)
	// --- 
	
	Попытка
		ДД = ПолучитьИзВременногоХранилища(Адрес);
		АдресКартинки = ПоместитьВоВременноеХранилище(ДД,ЭтаФорма.УникальныйИдентификатор);
		Возврат(_УФКС.Ответ());
	Исключение
	    Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	// --- 
КонецФункции

#КонецОбласти 
 
#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти


