#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УдалитьЗаписьПрофилей(СтруктураОтбора) Экспорт
	
	НаборЗаписей = РегистрыСведений.CW_ПользователиВебПрофилей.СоздатьНаборЗаписей();
	
	Для Каждого КлючЗначение из СтруктураОтбора Цикл
		НаборЗаписей.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
	КонецЦикла;
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры   

Процедура ЗаполнитьРазделПрофилейПользователя() Экспорт    
	
	НаборЗаписей = РегистрыСведений.CW_ПользователиВебПрофилей.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Для Каждого СтрокаНабора из НаборЗаписей Цикл 
		Если ТипЗнч(СтрокаНабора.ВебПрофиль) = Тип("СправочникСсылка.CW_ВебПрофили") Тогда
			СтрокаНабора.ОсновнойПрофиль = СтрокаНабора.ВебПрофиль.ОсновнойПрофиль;                                                   
		КонецЕсли;  
		СтрокаНабора.Раздел = "ГРУЗОПЕРЕВОЗКИ"; 
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецЕсли
