#Область ОсновныеСобытияФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовыйОбъект = Параметры.Ключ.Пустая();
	
	_УстановитьПараметрыФункциональныхОпцийФормы();
	
	ВалютаРегламентированногоУчетаРубль 						= ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	КонтролироватьПолучениеОригиналовОтПоставщиков 				= ПолучитьФункциональнуюОпцию("CW_КонтролироватьПолучениеОригиналовОтПоставщиков");	
	РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки 	= ПолучитьФункциональнуюОпцию("CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки");
	УстановитьЗначениеНольЗначениеПараметраНеУстановлено 		= Константы.CW_УстановитьЗначениеНольЗначениеПараметраНеУстановлено.Получить();
	СохранятьРеквизитыПервичныхДокументов 						= Константы.CW_СохранятьРеквизитыПервичныхДокументов.Получить();   
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ПравоРедактированияНомераДокумента 	= CW_ПраваДоступа.ПравоДоступно("РедактированиеНомераДокументаРасходыПоГрузоперевозкам");
	Элементы.Номер.ТолькоПросмотр 		=  НЕ ПравоРедактированияНомераДокумента;
	

	НачальнаяДатаДокумента 				= Объект.Дата;
	
	ПросмотрБюджетиа = CW_ПраваДоступа.ПравоДоступно("ПросмотрБюджетов");
	Элементы.УслугиПроверкаДокументаПоБюджету.Видимость = ПросмотрБюджетиа;

	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП
	
	ОграничиватьУслугиПоДоговорам		= ПолучитьФункциональнуюОпцию("CW_ОграничиватьУслугиПоДоговорам");
	Если ОграничиватьУслугиПоДоговорам Тогда
		УстанавливатьЦенуВЗависимостиОтГруза 	= ПолучитьФункциональнуюОпцию("CW_УстанавливатьЦенуВЗависимостиОтГруза");
		УстанавливатьЦенуВЗависимостиОтКлиента 	= ПолучитьФункциональнуюОпцию("CW_УстановкаЦенНоменклатурыВЗависимостиОтКлиента");
		НеОграничиватьУслугиПоПеревыставлению 	= Константы.CW_НеОграничиватьСписокУслугПриПеревыставленииЗатрат.Получить();
	КонецЕсли;  
	
	//Услуги по договру
	АдресУслугПоДоговору 			= "";
	УстановитьАдресСпискаУслугПоДоговору();
	
	//AFR-233578
	//ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре();
	//ОтключитьИсториюВыбораНоменклатуры(ИспользуетсяОгранчиениеУслуг);
	//AFR-233578
	
	
	//Подсистема.СогласованиеОбъктов
	CW_СогласованиеСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	//Подсистема.СогласованиеОбъктов

	//Взаиморасчеты по документу
	CW_ВзаиморасчетыПоДокументуСервер.УстановитьНазваниеСсылкиОтчета(ЭтаФорма, Объект.ПредъявленСчет);
	//Взаиморасчеты по документу  
	
	// проверим на копирование
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Копия = Параметры.ЗначениеКопирования;
	КонецЕсли;	
	
	// проверка лицензии
	Элементы.ГруппаИнфо.Видимость = Ложь;
	Если Параметры.Ключ.Пустая() И НЕ Модифицированность Тогда
		
		Если Не ЗначениеЗаполнено(НачальнаяДатаДокумента) Тогда
			НачальнаяДатаДокумента = ТекущаяДата();
		КонецЕсли;
		
		Модифицированность  = Истина;
		
		Если Не Объект.Корректировка 
			И Не Параметры.ЗначенияЗаполнения.Свойство("ВводНаОсновании") Тогда
			Объект.ЦенаСНДС = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ВДокументахЦенаСНДС");
			ОбработатьИзменениеСоставаЦены();
		КонецЕсли;
		
		Если ВестиУчетПоПодразделениям и Не ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда
			Объект.ПодразделениеОрганизации 	= CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ПодразделениеПользователя");
		КонецЕсли;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Договор) Тогда
		_ОбработатьИзменениеДоговора(ЗначениеЗаполнено(Параметры.ЗначениеКопирования));
	КонецЕсли;
	
	ЗапрашиватьПодтверждениеПриУдаленииСтрок = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"РасходыЗапрашиватьПодтверждениеПриУдаленииСтрок");
	
	ОтображатьКомментарийДоговора = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОтображатьКомментарийДоговораВФормеВводаДокументовПоБюджету");
	УстановитьЗаголовокНадписиКомментарияДоговора();
	
	НеЗаменятьПредставлениеНоменклатуры = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"НеЗаменятьПредставлениеПриИзмененииНоменклатурыРасходы");
	
	_ИнициализацияФормы();  
	
	//Срок оплаты
	Если Не Параметры.Ключ.Пустая() Тогда
		ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(Параметры.Ключ);
		
		ДанныеСрокаОплаты.Свойство("ДатаОплаты",			_СрокОплаты);
		ДанныеСрокаОплаты.Свойство("Описание",				_СрокОплатыОписание);
		ДанныеСрокаОплаты.Свойство("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
		
		УстановитьОписаниеСрокаОплаты();	
	КонецЕсли; 
	//Срок оплаты

	
	#Область Динамический_вывод_дополнительных_колонок
	
	_УФС.ОбновитьСписокДополнительныхКолонокФормы(ЭтаФорма, "CW_РасходыПоГрузоперевозке");
	УстановитьВидимостьКнопкиОбновленияЗначений();
	
	#КонецОбласти

	УстановитьВидимостьГруппыСуммыДокмента();
	
	ЗаполнитьСписокКодовОпераций();

	//Подсистема.ДополнительныеРеквизиты
	ИспользоватьДопРеквизиты = CW_ДополнительныеРеквизитыСлужебный.ИспользуютсяДополниительныеРеквизиты();
	//Подсистема.ДополнительныеРеквизиты
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ПроизвольныйОбъект", НЕ ИспользоватьДопРеквизиты); 
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	//Подистема.CW_ПланированиеДДС
	CW_ПланированиеДДССервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подистема.CW_ПланированиеДДС
	
	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.ОригиналыДокументов
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	//Подсистема.СтатусыДокументов
	
	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов

	ПервичныеДокументыПриСозданииНаСервере();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

	Основание = _сф.ст_ПолучитьСвойство(Параметры,"Основание");
	Если Основание <> Неопределено Тогда
		
		Если (ТипЗнч(Основание) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда
			
			// проверяем, что онованием является счет
			Если НЕ (Основание.ПредъявленСчет И НЕ (Основание.ПредъявленАкт ИЛИ Основание.ПредъявленСФ)) Тогда
				
				ФлагОтменыОткрытия = Истина;
				ТекстОтменыОткрытия = "Ввод на основании доступен только для неактированного счёта!";
				Возврат;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (ТипЗнч(Основание) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
			
			// режим ввода на основании
			РежимВводаНаОсновании = Истина;
			ДокументОснование = Основание;
			Возврат;
			
		КонецЕсли; 
		
		Если (ТипЗнч(Основание)=Тип("СправочникСсылка.CW_Грузоперевозки")) Тогда
			
			// добавляем строку
			Нстр = Объект.Услуги.Добавить();
			Нстр.Грузоперевозка = Основание;
			// --- 
			ЗаполнитьДополнительныеКолонкиТабличнойЧасти();
			
		КонецЕсли; 
		
		Если (ТипЗнч(Основание)=Тип("СправочникСсылка.CW_Заказы")) Тогда
			
			// добавляем строку
			МассивГП = CW_Мониторинг.ГрузоперевозкиЗаказа(Основание);
			Для каждого ГП Из МассивГП Цикл
				
				Нстр = Объект.Услуги.Добавить();
				Нстр.Грузоперевозка = ГП;
				
			КонецЦикла; 
			
			ЗаполнитьДополнительныеКолонкиТабличнойЧасти();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// заполнение по бюджету
	АдресПараметровЗаполнения = _сф.ст_ПолучитьСвойство(Параметры,"АдресПараметровЗаполнения");
	Если (АдресПараметровЗаполнения <> Неопределено) Тогда
		
		СЗ = ПолучитьИзВременногоХранилища(АдресПараметровЗаполнения);
		ЗаполнитьЗначенияСвойств(Объект,СЗ,,"Услуги");
		// --- 
		Для каждого Стр Из СЗ.Услуги Цикл
			
			Нстр = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,Стр);
			
			ТребоватьЗаполненияПокупателя = _ДС().ПД.ТребоватьЗаполненияПокупателяДляПорядокаОтраженияЗатратыВРасходах;
			
			Если (Нстр.ПорядокОтражения <> ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты")) Тогда
				
				// значение заполнено
				СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(Нстр.ПолучитьИдентификатор());
				СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
				
				Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
					Нстр.Покупатель 		 	= СтруктураДанныхСтроки.Покупатель;
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
					Нстр.ДоговорПокупателя 	= СтруктураДанныхСтроки.ДоговорПокупателя;
				КонецЕсли;
				Если  СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
					Нстр.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
				КонецЕсли;
				Если  СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
					Нстр.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
				КонецЕсли;
				
			Иначе
				
				Если ТребоватьЗаполненияПокупателя Тогда
					// значение заполнено
					СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(Нстр.ПолучитьИдентификатор());
					СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
					
					Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
						Нстр.Покупатель 		 	= СтруктураДанныхСтроки.Покупатель;
					КонецЕсли;
					Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
						Нстр.ДоговорПокупателя 	= СтруктураДанныхСтроки.ДоговорПокупателя;
					КонецЕсли;
					Если  СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
						Нстр.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
					КонецЕсли;
					Если  СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
						Нстр.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли; 
			
			
		КонецЦикла;
		
		ЗаполнитьДополнительныеКолонкиТабличнойЧасти();
		// 
		КомментарийЗаполнения = Неопределено;
		СЗ.Свойство("КомментарийЗаполнения",КомментарийЗаполнения);
		
		ОбработатьИзменениеФлагаЦенаСНДС();
		
		//Бред конечно, но при заполнении по бюджету нужно это процедуру вызвать повторно, чтоббы обновить параметры "ДС".
		_ИнициализацияФормы();

	КонецЕсли; 
	
	#Область Динамический_вывод_дополнительных_колонок
	
	//Обновляем динамические колонки параметров ГП
	Если Объект.Услуги.Количество() > 0 Тогда
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	КонецЕсли;
	
	#КонецОбласти

	УстановитьВидимостьЭлементовРег();
	
	ОбработатьИзменениеСоставаЦены();
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьИсториюВыбораНоменклатуры(ЕстьОграниченияПоСпискуУслуг)
	
	Если ЕстьОграниченияПоСпискуУслуг Тогда 
		Элементы.УслугиНоменклатура.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	Иначе
		Элементы.УслугиНоменклатура.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.Авто;
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура _УстановитьПараметрыФункциональныхОпцийФормы()
	ТекущийПользователь = CW_Настройки.Пользователь();
	ГруппаПользователя 	= CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	ПараметрыФункциональныхОпций = Новый Структура("CW_Пользователь, CW_ГруппаПользователя",ТекущийПользователь, ГруппаПользователя);
	
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФункциональныхОпций);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	// проверим на копирование
	Если ЗначениеЗаполнено(Копия) Тогда
		// проверим грузоперевозки
		Блок = _ПроверитьБлок();
		Если (Блок) Тогда
			Объект.Услуги.Очистить();
			_УФК.ВывестиПредупреждение("Документ содержит блокированые грузоперевозки." + Символы.ПС + "Табличная часть очищена.");
			УстановитьДоступность(); 	
		КонецЕсли;		
		
		ОбновитьИтогиПоУслугам();
		ОбновитьИтогиПоАвансам();	
		ОбновитьИтогиПоАктированию();
	КонецЕсли;	
	
	
	Если (ЗначениеЗаполнено(КомментарийЗаполнения)) Тогда
		
		Сообщить(КомментарийЗаполнения);		
		
	КонецЕсли;
	
	Если ФлагОтменыОткрытия Тогда
		
		_УФК.ВывестиПредупреждение(ТекстОтменыОткрытия);
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	Если (РежимВводаНаОсновании) Тогда
		
		ПодключитьОбработчикОжидания("ДиалогВводаНаОсновании",0.1,Истина);
		
	КонецЕсли;    
	
	//Подсистема.CW_ЭлектронныйОбменДанными
	Если ЗначениеЗаполнено(Объект.Контрагент) 
		и Не Объект.Корректировка Тогда
		ПроверитьКонтрагентаПоБазеЛКК();
	КонецЕсли;
	//Подсистема.CW_ЭлектронныйОбменДанными
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДоступность() 
	
	ЭтаФорма.ТолькоПросмотр = Ложь;
	Элементы.ГруппаИнфо.Видимость = Ложь;
	// --- 
	Элементы.УслугиИзменить.Доступность = Истина;
	Элементы.УслугиУслуги_ПереформироватьПредставление.Доступность = Истина;
	Элементы.УслугиГруппаЗаполнить.Видимость = Истина;
	// --- 
	Элементы.ЗачетАвансов.ТолькоПросмотр = Ложь;
	Элементы.ЗачетАвансовОЗ.ТолькоПросмотр = Ложь;
	// --- 
	Элементы.ЗачетАвансовЗаполнитьАвансы.Доступность = Истина;
	Элементы.ЗачетАвансовОЗ_Заполнить.Доступность = Истина;
	// --- 
	Элементы.ЗачетАвансовАвансы_Открыть.Доступность = Истина;
	Элементы.ЗачетАвансовОЗ_Открыть.Доступность = Истина;
	// --- 
	Элементы.ЗачетАвансовУдалить.Доступность = Истина;
	Элементы.ЗачетАвансовОЗ_Удалить.Доступность = Истина;
	// --- 
	Элементы.ЗачетАвансовАвансы_Очистить.Доступность = Истина;
	Элементы.ЗачетАвансовОЗ_Очистить.Доступность = Истина;
	
	Элементы.Заявки.ТолькоПросмотр = ложь;
	Элементы.СоздатьЗаявку.Доступность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ИдентификаторДокументаПоставщика) Тогда
		ТекущийОбъект.ИдентификаторДокументаПоставщика = Новый УникальныйИдентификатор(ИдентификаторДокументаПоставщика);
	КонецЕсли;	
		
	CW_Документы.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ);
	
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	CW_ГруппыУслугСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ГруппыУслугПриложенийИДоговоров
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// признак интерактивного режима
	_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"ИнтерактивныйРежим",Истина);
	
	// тут перенесём доп. свойства в дополнительные свойства объекта
	_сф.ст_ДобавитьСвойства(ТекущийОбъект.ДополнительныеСвойства,"*",_ДС());
	ТекущийОбъект.ДС = ТекущийОбъект.ДополнительныеСвойства;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьНомераДокументовНаСервере();
	_СформироватьЗаголовок();
	// --- 
	_УправлениеЭлементамиФормы();
	// --- 
	ЗаполнитьДополнительныеКолонкиТабличнойЧасти();
	// --- 
	НачальнаяДатаДокумента = Объект.Дата;
	
	//Подистема.CW_ПланированиеДДС
	CW_ПланированиеДДССервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи); 
	//Подистема.CW_ПланированиеДДС
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ОригиналыДокументов
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(ЭтаФорма, "Услуги", "ДоговорПокупателя");
	//Подсистема.УчетПриложенийДоговоров
	
	//план оплаты
	Если _ДС().ПД.АвтоматическиРасчитыватьПланОплатыПриЗаписиДокумента тогда
		РассчитатьПлановуюДатуОплатыНаСервере(Истина, Ложь);
	КонецЕсли;
	//план оплаты   

	//Взаиморасчеты по документу
	CW_ВзаиморасчетыПоДокументуСервер.УстановитьНазваниеСсылкиОтчета(ЭтаФорма, Объект.ПредъявленСчет);
	//Взаиморасчеты по документу
	
	//СрокОплаты
	Если ЭтоНовыйОбъект Тогда
		Если Не _СрокОплатыРучноеРедактирование Тогда
			УстановитьСрокОплатыНаСервере();
		Иначе
			ЗаписатьСрокОплатыДокумента();
			УстановитьОписаниеСрокаОплаты();             
		КонецЕсли;
	КонецЕсли;
	//СрокОплаты
	

	_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами
	
	//Срок оплаты
	ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(Объект.Ссылка);
	ДанныеСрокаОплаты.Свойство("ДатаОплаты",			_СрокОплаты);
	ДанныеСрокаОплаты.Свойство("Описание",				_СрокОплатыОписание);
	ДанныеСрокаОплаты.Свойство("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
	
	УстановитьОписаниеСрокаОплаты();
	//Срок оплаты
	
	ОповеститьОбИзменении(Объект.Ссылка);
	_УправлениеЭлементамиФормы();
	
	Если (НЕ Объект.Корректировка) Тогда
		
		Если (ЗначениеЗаполнено(Объект.ВедомыйСчет)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйСчет);
		КонецЕсли;
		Если (ЗначениеЗаполнено(Объект.ВедомыйДокумент)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйДокумент);
		КонецЕсли; 
		Если (ЗначениеЗаполнено(Объект.ВедомыйСчетФактура)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйСчетФактура);
		КонецЕсли; 
		
	Иначе
		
		Если (ЗначениеЗаполнено(Объект.ВедомыйДокументКорректировки)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйДокументКорректировки);
		КонецЕсли; 
		Если (ЗначениеЗаполнено(Объект.ВедомыйСчетФактураКорректировочный)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйСчетФактураКорректировочный);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ВыполненаЗаписьДокумента") Тогда
		
		Прочитать();
		_УправлениеЭлементамиФормы();
		
	ИначеЕсли ИмяСобытия = "ОбновитьСписокУслугПоПротоколу" Тогда
		
		УстановитьАдресСпискаУслугПоДоговору();
		
	ИначеЕсли ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
		
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	ИначеЕсли ИмяСобытия = "ОбновитьКоментарийДоговораНаФрме" Тогда
		
		УстановитьЗаголовокНадписиКомментарияДоговора();
		
	ИначеЕсли ИмяСобытия = "ОбновитьАдресУслугДоговора" Тогда
		
		ОбработатьОповещениеИзмененияСпискаУслуг() ;
		
	ИначеЕсли ИмяСобытия = "Запись_CW_Грузоперевозки" Тогда
		
		#Область Динамический_вывод_дополнительных_колонок
		
		ОбновитьЗначенияПараметровГрузоперевозокнаСервере();
		
		#КонецОбласти
		
	//Подистема.CW_ПланированиеДДС
	ИначеЕсли ИмяСобытия = "Запись_CW_ПланированиеДДС" Тогда
		
		ОбновитьЗаголовокСтраницы()
	//Подистема.CW_ПланированиеДДС
	
	//Наличие прикрепленных файлов
	ИначеЕсли ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
	
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
	//Наличие прикрепленных файлов
		
		//Подсистема.СтатусыДокументов
	ИначеЕсли ИмяСобытия = "Изменение_СтатусДокумента" Тогда
		
		ОбработатьОповещениеИзменениеСтатусДокументаНаСервере();
		//Подсистема.СтатусыДокументов

		//Подсистема.СогласованиеОбъктов 
	ИначеЕсли ИмяСобытия = "Изменение_СогласованиеОбъектов" Тогда
		
		  CW_СогласованиеКлиент.ОбновитьСтатусОбъекта(Истина, ЭтаФорма);
		//Подсистема.СогласованиеОбъктов
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	
КонецПроцедуры

//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()
	
	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
//Наличие прикрепленных файлов


&НаСервере
Процедура ОбновитьЗначенияПараметровГрузоперевозокнаСервере()
	
	Если Объект.Услуги.Количество() > 0 Тогда
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	КонецЕсли;
	
КонецПроцедуры	


&НаСервере
Процедура ОбработатьОповещениеИзмененияСпискаУслуг()
	
	УстановитьАдресСпискаУслугПоДоговору();
	
КонецПроцедуры


&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	мВыбранныеКолонки = Новый Массив;
	
	Для Каждого ЭлементСписка из СписокДополнительныхКолонок Цикл
		Если ЭлементСписка.Пометка Тогда
			мВыбранныеКолонки.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Настройка = Новый Структура;
	Настройка.Вставить("ВыбранныеКолонки"	, мВыбранныеКолонки);
	
	ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы, "CW_РасходыПоГрузоперевозке",Настройка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторДокументаПоставщика) Тогда
		ИдентификаторДокументаПоставщика = СокрЛП(ТекущийОбъект.ИдентификаторДокументаПоставщика);
	КонецЕсли; 
	
	ЗаполнитьДополнительныеКолонкиТабличнойЧасти();

	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(ЭтаФорма, "Услуги", "ДоговорПокупателя");
	//Подсистема.УчетПриложенийДоговоров 
	
	Если ИспользоватьДопРеквизиты Тогда
		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
		// Конец СтандартныеПодсистемы.Свойства
	КонецЕсли;
	
	//ДатыЗапретаИзменения
	//Проверяем дату запрета по документам БУ
	мОбъектыПроверки = ПолучитьМассивОбъектовДляПроверки();
	Для Каждого ЭлементМассива из мОбъектыПроверки Цикл
		//Есть ведомые документы, проверяем дату запрета редактирования БП
		ОбъектМассива = ЭлементМассива.ПолучитьОбъект();
		Разрешено = ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ОбъектМассива);
		Если не Разрешено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//ДатыЗапретаИзменения

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОбъектовДляПроверки()
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ВедомыйДокумент) Тогда
		Результат.Добавить(Объект.ВедомыйДокумент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчетФактура) Тогда
		Результат.Добавить(Объект.ВедомыйСчетФактура);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчет) Тогда
		Результат.Добавить(Объект.ВедомыйСчет);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйДокументКорректировки) Тогда
		Результат.Добавить(Объект.ВедомыйДокументКорректировки);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчетФактураКорректировочный) Тогда
		Результат.Добавить(Объект.ВедомыйСчетФактураКорректировочный);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчетКорректировочный) Тогда
		Результат.Добавить(Объект.ВедомыйСчетКорректировочный);
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции


&НаСервере
Процедура УстановитьАдресСпискаУслугПоДоговору()
	
	Если ОграничиватьУслугиПоДоговорам и ЗначениеЗаполнено(Объект.Договор) Тогда
		ЕстьОграниченияПоСпискуУслуг =?(ЗначениеЗаполнено(Объект.Договор), Объект.Договор.ОграничиватьНоменклатуру, Ложь);
		Если ЕстьОграниченияПоСпискуУслуг Тогда       
			
			ДатаДокумента = Объект.Дата;
			Если Объект.ПредъявленАкт
				и ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
				ДатаДокумента = Объект.ДатаАкта;  
			ИначеЕсли Объект.ПредъявленСчет 
				и ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
				ДатаДокумента = Объект.ДатаСчета;  
			КонецЕсли;      

			АдресУслугПоДоговору = _УФС.ОбновитьСписокУслугПоДоговору(ДатаДокумента,Объект.Договор, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&наСервере
Процедура УстановитьЗаголовокНадписиКомментарияДоговора()
	
	КомментарийДоговора = ?(Объект.Договор.Пустая(),"", СокрЛП(Объект.Договор.Комментарий));
	
	Элементы.НадписьКомментарийДоговора.Видимость = ОтображатьКомментарийДоговора и ЗначениеЗаполнено(КомментарийДоговора);
	Элементы.НадписьКомментарийДоговора.Заголовок = КомментарийДоговора;
	
КонецПроцедуры


#КонецОбласти 

#Область ИнициализацияФормы 

&НаСервере
Процедура _ИнициализацияФормы()
	
	// заполнение данных
	_СформироватьОбщиеПараметры();
	_ПроверитьРежимВводаОстатков();
	_СформироватьКурс();
	ОбновитьНомераДокументовНаСервере();
	
	// --- 
	Если (Объект.Ссылка.Пустая()) Тогда
		
		Объект.Ответственный = Неопределено;
		
	КонецЕсли; 
	// --- 
	
	// для документов "счет" обновим таблицу связанных актов и оплат
	ВыводитьСвязанныеАктыОплаты = (НЕ Объект.Ссылка.Пустая()); 
	ВыводитьСвязанныеАктыОплаты = (ВыводитьСвязанныеАктыОплаты И НЕ (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ));
	ВыводитьСвязанныеАктыОплаты = (ВыводитьСвязанныеАктыОплаты И НЕ Объект.Корректировка);
	Если (ВыводитьСвязанныеАктыОплаты) Тогда
		_ОбновитьАкты();
	КонецЕсли; 
	
	// проверяем на закрытие (кроме корректировки)
	Если (НЕ РеквизитФормыВЗначение("Объект").ПроверитьЗакрытиеГрузоперевозок() И НЕ Объект.Корректировка) Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ГруппаИнфо.Видимость = Истина;
		Элементы.ДекорацияИнфо.Заголовок = "Документ доступен только для просмотра, т.к. содержит блокированные грузоперевозки!";
		// --- 
		Элементы.УслугиИзменить.Доступность = Ложь;
		Элементы.УслугиУслуги_ПереформироватьПредставление.Доступность = Ложь;
		Элементы.УслугиГруппаЗаполнить.Видимость = Ложь;
		// --- 
		Элементы.ЗачетАвансов.ТолькоПросмотр = Истина;
		Элементы.ЗачетАвансовОЗ.ТолькоПросмотр = Истина;
		// --- 
		Элементы.ЗачетАвансовЗаполнитьАвансы.Доступность = Ложь;
		Элементы.ЗачетАвансовОЗ_Заполнить.Доступность = Ложь;
		// --- 
		Элементы.ЗачетАвансовАвансы_Открыть.Доступность = Ложь;
		Элементы.ЗачетАвансовОЗ_Открыть.Доступность = Ложь;
		// --- 
		Элементы.ЗачетАвансовУдалить.Доступность = Ложь;
		Элементы.ЗачетАвансовОЗ_Удалить.Доступность = Ложь;
		// --- 
		Элементы.ЗачетАвансовАвансы_Очистить.Доступность = Ложь;
		Элементы.ЗачетАвансовОЗ_Очистить.Доступность = Ложь;
		
		Элементы.Заявки.ТолькоПросмотр = Истина;
		Элементы.СоздатьЗаявку.Доступность = ложь;
	Иначе
		//// права
		//Если ЭтотОбъект.ТолькоПросмотр = Ложь Тогда   //AFR-233633
			_ПраваДоступа();
		//КонецЕсли;  //AFR-233633
	КонецЕсли; 
	
	//// видимость доп.действий
	//СписокДействий = _СписокДействий();
	//Если (СписокДействий.Количество() = 0) Тогда
	//	Элементы.ФормаВнешниеДействия.Видимость = Ложь;
	//КонецЕсли; 
	
	// обновляем итоговые строки табличных частей 
	ОбновлятьИтоги = (НЕ Объект.Корректировка);
	Если (ОбновлятьИтоги) Тогда
		ОбновитьИтогиПоУслугам();
		ОбновитьИтогиПоАвансам();
	КонецЕсли; 
	
	
	// маркеры блокированных грузоперевозок
	АдресДефис = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.CW_ЭлементСписка, ЭтаФорма.УникальныйИдентификатор);
	АдресЗамок = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.CW_Замок, ЭтаФорма.УникальныйИдентификатор);
	
	// --- 
	Элементы.УслугиПорядокОтражения.РежимВыбораИзСписка=Истина;
	Элементы.УслугиПорядокОтражения.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	Элементы.УслугиПорядокОтражения.ИсторияВыбораПриВводе=ИсторияВыбораПриВводе.НеИспользовать;
	// --- 
	Элементы.УслугиПорядокОтражения.СписокВыбора.Очистить();
	Элементы.УслугиПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Затраты);
	Элементы.УслугиПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление);
	ПеревыставлениеПоСтавкам = ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
	Если (ПеревыставлениеПоСтавкам) Тогда
		Элементы.УслугиПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам);
	КонецЕсли; 
	Элементы.УслугиПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы);
	// --- 
	
	// --- 
	Элементы.УслугиНоменклатурнаяГруппа.Видимость = _ДС().НП.ОтображатьНоменклатурнуюГруппу;
	Элементы.УслугиЕИ.Видимость = _ДС().НП.ОтображатьЕИ;
	Элементы.УслугиКорректировкаЕИ.Видимость = _ДС().НП.ОтображатьЕИ;
	
	//КонтрольДокументовПоСумме = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"КонтрольВходящихДокументовПоСумме");
	структураНастройкиПользователя = CW_Настройки.ПолучитьНастройкиПользователя();    
	ПодразделениеПользователя = структураНастройкиПользователя.ПодразделениеПользователя;
	КонтрольДокументовПоСумме = структураНастройкиПользователя.КонтрольВходящихДокументовПоСумме;
	
	//// регенерация формы
	//МассивИсключаемых = Новый Массив;
	//МассивИсключаемых.Добавить("Объект.Услуги.Грузоперевозка");
	//МассивИсключаемых.Добавить("Объект.Услуги.Номенклатура");
	//МассивИсключаемых.Добавить("Объект.Услуги.СтатьяЗатрат");
	//МассивИсключаемых.Добавить("Объект.Услуги.Подразделение");
	//_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма, МассивИсключаемых);
	// --- 
	_УправлениеЭлементамиФормы();
	_СформироватьЗаголовок();
	ЗаполнитьДополнительныеКолонкиТабличнойЧасти();
	
	Элементы.УслугиКартинкаФинансовыйСтатус.Видимость = _ДС().НП.ВыводитьФинансовыйСтатусВДокументах;
	
	// --- 
	
	Элементы.ПредставлениеАкта.Видимость 			= ВалютаРегламентированногоУчетаРубль;
	Элементы.ПредставлениеСчетаФактуры.Видимость 	= ВалютаРегламентированногоУчетаРубль;
	
	//Исправления
	УстановитьВидимостьЭлементовИсправления();
	//Исправления
	
	УстановитьПараметрыВыбораСтавкиНДС();
	
КонецПроцедуры
 

&НаСервере
Процедура _ПраваДоступа()
	
	БазоваяВалютаРубль = Константы.CW_ВалютаРегламентированногоУчетаРубль.Получить();
	
	ЭтоСчет 	= Объект.ПредъявленСчет;
	ЭтоАкт 		= Не Объект.ПредъявленСчет и (Объект.ПредъявленАкт или Объект.ПредъявленСФ);
	ЭтоПакет 	= Объект.ПредъявленСчет и (Объект.ПредъявленАкт или Объект.ПредъявленСФ);
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов");
	
	Если ПравоРедактирования и ЭтоСчет Тогда
		ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Счета");
	Конецесли;
	
	Если ПравоРедактирования и Объект.Корректировка Тогда
		ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Корректировки");
	КонецЕсли;
	
	Если БазоваяВалютаРубль Тогда
		
		Если ПравоРедактирования и ЭтоАкт Тогда
			ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Акты");
		Конецесли;
		
		Если ПравоРедактирования Тогда
			
			РедактированиеАктированныхСчетов = CW_ПраваДоступа.ПравоДоступно("РазрешитьРедактированиеВходящихАктированныхСчетов");
			Если НЕ РедактированиеАктированныхСчетов Тогда
				
				Если ЭтоПакет Тогда
					ПравоРедактирования = Ложь;
				КонецЕсли;
				
				Если ПравоРедактирования Тогда
					
					// проверяем, что нет сформированных актов
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					               |	CW_СоответствиеАктовВходящимСчетам.Акт КАК Акт
					               |ИЗ
					               |	РегистрСведений.CW_СоответствиеАктовВходящимСчетам КАК CW_СоответствиеАктовВходящимСчетам
					               |ГДЕ
					               |	CW_СоответствиеАктовВходящимСчетам.Счет = &Счет";
					
					Запрос.УстановитьПараметр("Счет", Объект.Ссылка);
					РезультатЗапроса = Запрос.Выполнить();
					
					ПравоРедактирования = РезультатЗапроса.Пустой();
					
				КонецЕсли;
				
			Конецесли;
			
		Конецесли;
		
	Конецесли;
	
	Если ПравоРедактирования Тогда
		
		РедактированиеОплаченныхСчетов 	= CW_ПраваДоступа.ПравоДоступно("РазрешитьРедактированиеВходящихОплаченныхСчетов");
		Если Не РедактированиеОплаченныхСчетов Тогда	
			// проверяем, нет ли оплат
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	CW_ОплатаВходящихДокументов.ДокументОплаты КАК ДокументОплаты
			|ИЗ
			|	РегистрСведений.CW_ОплатаВходящихДокументов КАК CW_ОплатаВходящихДокументов
			|ГДЕ
			|	CW_ОплатаВходящихДокументов.Документ = &Документ";
			Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ПравоРедактирования = РезультатЗапроса.Пустой();
			
		КонецЕсли;
		
	КонецЕсли;

	ПравоПросмотраБухгалтерскихОбъектов = CW_ПраваДоступа.ДоступныОбъектыБухгалтерии();
	
	//Управление элементаи формы
	ЭтаФорма.ТолькоПросмотр = НЕ ПравоРедактирования;
	
	
	Элементы.УслугиОчиститьТабличнуюЧастьУслуг.Видимость 	= ПравоРедактирования;
	Элементы.УслугиУслуги_ГрупповоеРедактирование.Видимость = ПравоРедактирования;
	
	Элементы.УслугиПодбор.Видимость 	= ПравоРедактирования;
	Элементы.УслугиИзменить.Доступность = ПравоРедактирования;
	
	Элементы.УслугиУслуги_ПереформироватьПредставление.Доступность = ПравоРедактирования;
	
	Элементы.УслугиГруппаЗаполнить.Видимость = ПравоРедактирования;
	
	
	Элементы.ГруппаВедомыеДокументы.Доступность		= ПравоРедактирования;
	Элементы.ГруппаВедомыеДокументы.Видимость		= ПравоПросмотраБухгалтерскихОбъектов И НЕ Объект.Корректировка;

	Элементы.ГруппаВедомыеДокументыКорректировки.Доступность 	= ПравоРедактирования;
	Элементы.ГруппаВедомыеДокументыКорректировки.Видимость 		= ПравоПросмотраБухгалтерскихОбъектов И Объект.Корректировка;
	
	Элементы.ГруппаКорректируемыйДокумент.Видимость 	= Объект.Корректировка;

	РедактированиеСтавкиНДС = CW_ПраваДоступа.ПравоДоступно("РедактированиеСтавкиНДС");
	Элементы.УслугиСтавкаНДС.Доступность = РедактированиеСтавкиНДС и ПравоРедактирования; 
	
КонецПроцедуры

&НаСервере
Процедура _ПроверитьРежимВводаОстатков()
	
	//---------------------------------------------------------------------
	// начало ведения бухгалтерского учета с применением дополнительного модуля
	//---------------------------------------------------------------------
	
	// контроль параметров учетной политики можно осуществить только при условии того, 
	// что в документе были заполнены организация и договор
	Если _ДС().Свойство("УП") Тогда
		ВводОстатковБУ = _ДС().УП.ВводОстатковБУ;
		ДатаНачалаВеденияУчетаБУ = _ДС().УП.ДатаНачалаВеденияУчетаБУ;
		
		РаздельныйУчетЗаполженности = _ДС().УП.РаздельныйУчетОперативнойИБухгалтерскойЗадолженности;
		ПереплатаКакАванс 			= _ДС().УП.УчитыватьПереплатыПоДокументамКакАванс;
		
		ОперативныйУчет = _ДС().УП.ОЗ;
		ВводОстатковОЗ = _ДС().УП.ВводОстатковОЗ;
		ДатаНачалаВеденияУчетаОЗ = _ДС().УП.ДатаНачалаВеденияУчетаОЗ;
	Иначе
		ВводОстатковБУ = Дата(1,1,1);
		ДатаНачалаВеденияУчетаБУ = Дата(1,1,1);

		РаздельныйУчетЗаполженности = Истина;
		ПереплатаКакАванс 			= Ложь;
		
		ОперативныйУчет = Ложь;
		ВводОстатковОЗ = Ложь;
		ДатаНачалаВеденияУчетаОЗ = Дата(1,1,1);
	КонецЕсли;

    // если режим ввода остатков, то формируем заголовки 
	Если ВводОстатковБУ Тогда
		Элементы.УслугиВводОстатков.Заголовок = "Не перевыставлены на "+Формат(ДатаНачалаВеденияУчетаБУ,"ДФ=dd.MM.yyyy");
		Элементы.ГруппаНачальныеОстаткиБУ.Заголовок = "Сальдо по бухгалтерскому учёту на "+Формат(ДатаНачалаВеденияУчетаБУ,"ДФ=dd.MM.yyyy");
	КонецЕсли; 
	
	// если по каким-то причинам режим ввода остатков БУ по документу отличается от текущей ситуации
	Если Объект.ВводОстатковБУ <> ВводОстатковБУ Тогда
		Объект.ВводОстатковБУ = ВводОстатковБУ;
	КонецЕсли; 
	
	//---------------------------------------------------------------------
	// начало ведения учета оперативной кредиторской задолженности в модуле 
	//---------------------------------------------------------------------
	
	//ОперативныйУчет = _ДС().УП.ОЗ;
	//ВводОстатковОЗ = _ДС().УП.ВводОстатковОЗ;
	//ДатаНачалаВеденияУчетаОЗ = _ДС().УП.ДатаНачалаВеденияУчетаОЗ;
	
	// если режим ввода остатков, то формируем заголовки 
	Если ВводОстатковОЗ Тогда
		Элементы.ГруппаНачальныеОстаткиОЗ.Заголовок = "Сальдо по оперативному учёту на "+Формат(ДатаНачалаВеденияУчетаОЗ,"ДФ=dd.MM.yyyy");
		Элементы.УслугиНеактированноеСальдо.Заголовок = "Неактированное сальдо на "+Формат(ДатаНачалаВеденияУчетаОЗ,"ДФ=dd.MM.yyyy");
	КонецЕсли; 
	
	// если по каким-то причинам режим ввода остатков ОЗ по документу отличается от текущей ситуации
	Если Объект.ВводОстатковОЗ <> ВводОстатковОЗ Тогда
		Объект.ВводОстатковОЗ = ВводОстатковОЗ;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПроверитьБлок()
	// --- 
	
	Блок = Ложь;
	Для Каждого Стр из Копия.Услуги Цикл
		Если НЕ ПроверитьГрузоперевозку(?(ЗначениеЗаполнено(Стр.Грузоперевозка.Заказ), Стр.Грузоперевозка.Заказ, Стр.Грузоперевозка)) Тогда 
			Блок = Истина;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат(Блок);
	
	// --- 
КонецФункции


&НаСервере
Функция ПроверитьГрузоперевозку(Аналитика)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	CW_ЗакрытиеФинансов.Аналитика КАК Аналитика
	               |ИЗ
	               |	РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
	               |ГДЕ
	               |	CW_ЗакрытиеФинансов.Аналитика = &Аналитика";
	
	Запрос.УстановитьПараметр("Аналитика", Аналитика);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), Истина, Ложь);
	
КонецФункции	

&НаСервере
Функция ПолучитьДанныеПоГрузоперевозокам()
	
	МассивГрузоперевозок = Новый Массив;
	Для Каждого СтрокаТаблицы из Объект.Услуги Цикл
		МассивГрузоперевозок.Добавить(СтрокаТаблицы.Грузоперевозка);
	КонецЦикла;
	
	Возврат CW_Грузоперевозки_Сервер.ПолучитьСведенияПоГрузоперевозкам(МассивГрузоперевозок);

КонецФункции

&НаСервере
Процедура _СформироватьЗаголовок()
	
	ЗаголовокДокумента = 
		"Расходы по грузоперевозке" + 
		?(Объект.Корректировка," (корректировка) "," ") +
		?(ЗначениеЗаполнено(Объект.Ссылка), " "+Объект.Номер+" от "+Объект.Дата, " (создание)")	;
	ЭтаФорма.Заголовок = ЗаголовокДокумента;
	
КонецПроцедуры

&НаСервере
Функция _ПризнакБлокировки(ПроверяемыйОбъект)
	// --- 
	
	Блок = Ложь;
	Для Каждого Стр из ПроверяемыйОбъект.Услуги Цикл
		Если НЕ ПроверитьГрузоперевозку(?(ЗначениеЗаполнено(Стр.Грузоперевозка.Заказ), Стр.Грузоперевозка.Заказ, Стр.Грузоперевозка)) Тогда 
			Блок = Истина;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат(Блок);
	
	// --- 
КонецФункции


&НаСервере
Процедура УстановитьПараметрыВыбораСтавкиНДС() Экспорт
	
	Если Объект.Корректировка Тогда
		ИмяРеквизитаСтавкаНДС = "УслугиКорректировкаСтавкаНДС";
	Иначе
		ИмяРеквизитаСтавкаНДС = "УслугиСтавкаНДС";
	КонецЕсли;
	
	CW_БухгалтерияЭкспедитораСерверПереопределяемый.УстановитьПараметрыВыбораСтавкиНДС(ЭтотОбъект, ИмяРеквизитаСтавкаНДС);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбщиеПараметры 

Функция _ДС()
	Возврат(ДС[0].Значение);
КонецФункции

&НаСервере
Процедура _СформироватьОбщиеПараметры(СписокПараметров=Неопределено) Экспорт
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.СформироватьОбщиеПараметры(СписокПараметров);
	
	Если СписокПараметров = Неопределено Тогда
		ДС.Очистить();
		ДС.Добавить(ДокументОбъект.ДополнительныеСвойства);
	Иначе
		
		СоответствиеПарамеров = Новый Соответствие;
		СоответствиеПарамеров.Вставить("ПараметрыДоговора","ПД");
		СоответствиеПарамеров.Вставить("Константы","КО");
		СоответствиеПарамеров.Вставить("УчетнаяПолитика","УП");
		СоответствиеПарамеров.Вставить("НастройкиПользователя","НП");
		
		МассивПараметров = _сф.м_СоздатьИзСтроки(СписокПараметров,",");
		
		ДСС = _ДС();
		
		Для каждого Параметр Из МассивПараметров Цикл
			
			Ключ = СоответствиеПарамеров.Получить(Параметр);
			_сф.ст_УстановитьСвойство(ДСС,Ключ,ДокументОбъект.ДополнительныеСвойства[Ключ]);
			
		КонецЦикла; 
		
		ДС.Очистить();
		ДС.Добавить(ДСС);
		
	КонецЕсли; 
	
	_ПроверитьРежимВводаОстатков();
	
КонецПроцедуры

#КонецОбласти 

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	Если (Объект.Корректировка) Тогда
		
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Контрагент.ТолькоПросмотр = Истина;
		Элементы.Договор.ТолькоПросмотр = Истина;
		
		// для корректировочных документов блокируем ввод документов "Доходы по грузоперевозкам" и "Отчет экспедитора" 
		Элементы.ФормаДокументCW_ДоходыПоГрузоперевозкеВводНаОснованииРасходовПоГрузоперевозке.Видимость = Ложь;
		Элементы.ФормаДокументCW_ОтчетЭкспедитораКомандаВводНаОсновании.Видимость = Ложь;
		Элементы.ФормаСоздатьНаОсновании.Видимость = Истина;
		
	КонецЕсли; 
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);
	
	ЗачетАвансовБУ = ((Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ) И ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет);
	ЗачетАвансовОЗ = (Объект.ПредъявленСчет И _ДС().УП.ОЗ);
	
	// шапка
	Элементы.КурсВалюты.Видимость = (НЕ Объект.Валюта.Пустая() И Объект.Валюта <> _ДС().КО.ВалютаРегламентированногоУчета);
	
	// видимость закладок
	Элементы.СтраницаУслуги.Видимость = (НЕ Объект.Корректировка);
	Элементы.СтраницаАкты.Видимость = (Объект.ПредъявленСчет) И (НЕ Объект.Ссылка.Пустая()) И НЕ (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ) И (НЕ Объект.Ссылка.Пустая()) И НЕ Объект.Корректировка и ВалютаРегламентированногоУчетаРубль;
	Элементы.СтраницаУслугиКорректировка.Видимость = (Объект.Корректировка);
	Элементы.СтраницаЗачетАвансов.Видимость = (Объект.СпособЗачетаАвансов=Перечисления.СпособыЗачетаАвансов.ПоДокументу И ЗачетАвансовБУ);
	Элементы.СтраницаЗачетАвансовОЗ.Видимость = (Объект.СпособЗачетаАвансовОЗ=Перечисления.СпособыЗачетаАвансов.ПоДокументу И ЗачетАвансовОЗ);
	Элементы.СтраницаПлатёжноРасчётныеДокументы.Видимость = 
		Объект.ПредъявленСФ И
		(Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.ПоДокументу)
	;
	Элементы.ПлатёжноРасчётныеДокументы.ТолькоПросмотр = НЕ (Объект.ПредъявленСФ И (Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ=Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.ПоДокументу));
	
	// заголовки закладок
	Элементы.СтраницаКомментарий.Заголовок = " Комментарий" +?(ЗначениеЗаполнено(Объект.Комментарий)," (*)","");
	Элементы.СтраницаУслуги.Заголовок = " Услуги (" +Объект.Услуги.Количество() + ")";
	Элементы.СтраницаАкты.Заголовок = " Акты (" +ТаблицаАктов.Количество() + ")";
	Элементы.СтраницаЗачетАвансов.Заголовок = " Зачет бух. авансов (" +Объект.ЗачетАвансов.Количество() + ")";
	Элементы.СтраницаЗачетАвансовОЗ.Заголовок = " Зачет упр. авансов (" +Объект.ЗачетАвансовОЗ.Количество() + ")";
	Элементы.СтраницаПлатёжноРасчётныеДокументы.Заголовок = " Платёжно-расчётные документы с/ф (" + Объект.ПлатёжноРасчётныеДокументы.Количество() + ")";
	
	// ведомый счет
	Элементы.ВедомыйСчет_Удалить.Видимость = НЕ Объект.ВедомыйСчет.Пустая() И НЕ (Объект.ПредъявленСчет);
	Элементы.ГруппаДействияСВедомымСчетом.Видимость = НЕ Объект.ВедомыйСчет.Пустая() И (Элементы.ВедомыйСчет_Удалить.Видимость);
	
	// ведомый документ
	Элементы.ВедомыйДокумент_Движения.Видимость = (НЕ Объект.ВедомыйДокумент.Пустая()) И (Объект.ВедомыйДокумент.Проведен);
	Элементы.ВедомыйДокумент_Удалить.Видимость = НЕ Объект.ВедомыйДокумент.Пустая() И НЕ (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ);
	Элементы.ГруппаДействияСВедомым.Видимость = НЕ Объект.ВедомыйДокумент.Пустая() И (Элементы.ВедомыйДокумент_Движения.Видимость ИЛИ Элементы.ВедомыйДокумент_Удалить.Видимость);
	// ведомый с/ф
	Элементы.ВедомыйСчетФактура_Движения.Видимость = (НЕ Объект.ВедомыйСчетФактура.Пустая()) И (Объект.ВедомыйСчетФактура.Проведен);
	Элементы.ВедомыйСчетФактура_Удалить.Видимость = НЕ Объект.ВедомыйСчетФактура.Пустая() И НЕ Объект.ПредъявленСФ;
	Элементы.ГруппаДействияСВедомойСчетФактурой.Видимость = НЕ Объект.ВедомыйСчетФактура.Пустая() И (Элементы.ВедомыйСчетФактура_Движения.Видимость ИЛИ Элементы.ВедомыйСчетФактура_Удалить.Видимость);
	
	// таблица услуг
	//Элементы.УслугиЗаказ.Видимость = _ДС().КО.CW_ИспользованиеЗаказов;
	Элементы.УслугиВсего.ТолькоПросмотр = (НЕ _ДС().НП.ОбратныйПересчетВДокументах);
	Элементы.УслугиГруппаСчет.Видимость = Объект.СписокСчетов;
	//Элементы.УслугиПроверитьДокументПоБюджету.Видимость = _ДС().КО.CW_ИспользованиеБюджетирования;
	
	// ввод остатков
	Элементы.УслугиВводОстатков.Видимость = ВводОстатковБУ И (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ);
	Элементы.УслугиНеактированноеСальдо.Видимость = ВводОстатковОЗ И Объект.ПредъявленСчет И НЕ (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ);
	Элементы.ГруппаНачальныеОстаткиБУ.Видимость = ВводОстатковБУ  И (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ);
	Элементы.ГруппаНачальныеОстаткиОЗ.Видимость = ВводОстатковОЗ И Объект.ПредъявленСчет;
	Элементы.КурсВзаиморасчетовБУ.Видимость = Объект.Договор.ВзаиморасчетыВУЕ;
	Элементы.КурсВзаиморасчетовОУ.Видимость = (Объект.Договор.ВалютаДоговора <> _ДС().КО.ВалютаРегламентированногоУчета);
	
	// кнопки нижней панели и меню "Действия"
 	Элементы.ФормаДокументCW_РасходыПоГрузоперевозкеСоздатьНаОсновании.Видимость = Объект.ПредъявленСчет И НЕ (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ);
	Элементы.ФормаОбщаяКомандаCW_ФайлыАрхива.Видимость = Константы.CW_ИспользованиеФайловогоАрхива.Получить();
	
	// итоговые строки табличных частей
	ОбновитьИтогиПоУслугам();
	ОбновитьИтогиПоАвансам();
	ОбновитьИтогиПоАктированию();
	
	Элементы.ФормаОбщаяКомандаCW_ИнформацияПоЗакрытиюГрузоперевозок.Видимость = НЕ РеквизитФормыВЗначение("Объект").ПроверитьЗакрытиеГрузоперевозок(); 

	// отчеты
	Если Элементы.Найти("ФормаОтчетCW_ВедомостьНезавершенногоПроизводстваВедомостьНезавершенногоПроизводства") <> Неопределено Тогда
		Элементы.ФормаОтчетCW_ВедомостьНезавершенногоПроизводстваВедомостьНезавершенногоПроизводства.Видимость = Объект.ПредъявленАкт;
	КонецЕсли;
	Если Элементы.Найти("ФормаОбщаяКомандаCW_ОтчетВедомостьНеперевыставленныхЗатрат") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаCW_ОтчетВедомостьНеперевыставленныхЗатрат.Видимость = Объект.ПредъявленСчет;
	КонецЕсли;
	Если Элементы.Найти("ФормаОбщаяКомандаCW_ОтчетНеперевыставленныеЗатраты") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаCW_ОтчетНеперевыставленныеЗатраты.Видимость = Объект.ПредъявленАкт;
	КонецЕсли;
	Если Элементы.Найти("ФормаОтчетCW_ОперативнаяЗадолженностьПередПоставщикамиОперативнаяЗадолженностьПередПоставщиками") <> Неопределено Тогда
		Элементы.ФормаОтчетCW_ОперативнаяЗадолженностьПередПоставщикамиОперативнаяЗадолженностьПередПоставщиками.Видимость = Объект.ПредъявленАкт;
	КонецЕсли;
	
	Попытка
		РаздельныйУчетВходящегоНДС = _ДС().УП.РаздельныйУчетНДСНаСчете19;	
	Исключение
	    РаздельныйУчетВходящегоНДС = Ложь;
	КонецПопытки; 
	ПоказатьСпособУчетаНДС = (РаздельныйУчетВходящегоНДС = Истина) И CW_ПраваДоступа.ПравоДоступно("РедактированиеСпособаУчетаНДС");
	Элементы.УслугиСпособУчетаНДС.Видимость = ПоказатьСпособУчетаНДС;
	
	ПоказатьПодразделение = ?(_ДС().Свойство("УП"),_ДС().УП.ГруппировкаЗатратПоПодразделениям,Ложь);
	Элементы.УслугиПодразделение.Видимость = ПоказатьПодразделение;
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	Если Элементы.Найти("ФормаДокументCW_ВводОстатковНезавершенногоПроизводстваСоздатьНаОсновании") <> Неопределено Тогда
		Элементы.ФормаДокументCW_ВводОстатковНезавершенногоПроизводстваСоздатьНаОсновании.Видимость = Объект.ПредъявленАкт;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ПакетДокументов 

&НаСервере
Функция _ДокументСодержитБлокированныеГП()
	Возврат НЕ РеквизитФормыВЗначение("Объект").ПроверитьЗакрытиеГрузоперевозок();	
КонецФункции

// --- 
&НаКлиенте
Процедура ОбновитьНомераДокументовНаКлиенте() Экспорт  
	
	 ОбновитьНомераДокументовНаСервере();
	  
КонецПроцедуры

&НаСервере
Процедура ОбновитьНомераДокументовНаСервере()
	
	ЭтоУПД = Объект.ПредъявленАкт и Объект.ЭтоУниверсальныйДокумент;
	
	Элементы.ПредставлениеАкта.Видимость = Не ЭтоУПД;
	Элементы.ПредставлениеСчетаФактуры.Видимость = Не ЭтоУПД;
	Элементы.ПредставлениеУПД.Видимость = ЭтоУПД;
	
	// Представление счета
	Если Объект.ПредъявленСчет Тогда
		
		Если ЗначениеЗаполнено(Объект.НомерСчета) Тогда
			ПредставлениеНомераСчета = Объект.НомерСчета;	 
		Иначе
			ПредставлениеНомераСчета = "<...>";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
			ПредставлениеДатыСчета	= Формат(Объект.ДатаСчета, "ДФ=dd.MM.yyyy");
		Иначе
			ПредставлениеДатыСчета 	= "<...>";	
		КонецЕсли;
		
		//План оплаты
		ПредставлениеСрокаОплаты = "";
		ДанныеПланаОплаты = CW_Документы.ПолучитьПланОплаты(Объект.Ссылка);
		Если Не ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) и НЕ ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
			ПредставлениеСрокаОплаты = ", План оплаты: <...>";
		ИначеЕсли ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) Тогда
			ПредставлениеСрокаОплаты = ", План оплаты: "+Формат(ДанныеПланаОплаты.Дата,"ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если Не ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
			ПредставлениеСрокаОплаты = ПредставлениеСрокаОплаты + " ("+СокрЛП(ДанныеПланаОплаты.Примечание)+")";
		КонецЕсли; 
		//План оплаты
		
		ПредставлениеСчета = "Счёт №"+ ПредставлениеНомераСчета+ " от " + ПредставлениеДатыСчета + ПредставлениеСрокаОплаты;
		
	// счет не предоставлен
	Иначе
		ПредставлениеСчета = "<Счёт не предоставлен>";
	КонецЕсли;   
	// Представление счета
	
	Если Не ЭтоУПД Тогда 
		
		// предоставление акт 
		Если Объект.ПредъявленАкт Тогда
			
			Если ЗначениеЗаполнено(Объект.НомерАкта) Тогда
				ПредставлениеНомераАкта = Объект.НомерАкта;	 
			Иначе
				ПредставлениеНомераАкта = "<...>";	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
				ПредставлениеДатыАкта  = Формат(Объект.ДатаАкта, "ДФ=dd.MM.yyyy");
			Иначе
				ПредставлениеДатыАкта = "<...>";	
			КонецЕсли;
			
			ПредставлениеОбъектаВнешнегоСчета = "";
			Если Объект.СписокСчетов и НЕ ВводОстатковОЗ Тогда
				ПредставлениеОбъектаВнешнегоСчета = " к списку счетов";
			Конецесли;  
			
			Если НЕ Объект.ПредъявленСчет и НЕ Объект.СписокСчетов Тогда 
				Если Объект.Счет.Пустая() Тогда  
					ПредставлениеВнешнегоСчета = " <не указан>";
				Иначе   
					ПредставлениеНомераВнешнегоСчета = Объект.Счет.НомерСчета;	 
					ПредставлениеДатыВнешнегоСчета 	 = Формат(Объект.Счет.ДатаСчета, "ДФ=dd.MM.yyyy"); 
					
					ПредставлениеВнешнегоСчета 		= ПредставлениеНомераВнешнегоСчета + " от "+ПредставлениеДатыВнешнегоСчета;
				КонецЕсли;
				
				ПредставлениеОбъектаВнешнегоСчета = "  к счёту №" + ПредставлениеВнешнегоСчета;
			КонецЕсли;
			
			ПредставлениеАкта = "Акт №" + ПредставлениеНомераАкта + " от " + ПредставлениеДатыАкта + ПредставлениеОбъектаВнешнегоСчета;
			
		Иначе
			ПредставлениеАкта = "<Акт не предоставлен>";
		КонецЕсли; 
		// предоставление акт 
		
		
		// с/ф предоставлена 
		Если Объект.ПредъявленСФ Тогда 
			
			Если ЗначениеЗаполнено(Объект.НомерСФ) Тогда
				ПредставлениеНомераСчетФактура = Объект.НомерСФ;	 
			Иначе
				ПредставлениеНомераСчетФактура = "<...>";	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ДатаСФ) Тогда
				ПредставлениеДатыСчетФактура 	 = Формат(Объект.ДатаСФ, "ДФ=dd.MM.yyyy");
			Иначе
				ПредставлениеДатыСчетФактура = "<...>";	
			КонецЕсли;    
			
			ПредставлениеИсправленияСчетФактура = "";
			Если ЗначениеЗаполнено(Объект.НомерИсправления) 
				И Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
				ПредставлениеИсправленияСчетФактура  =  " (испр. "+Формат(Объект.НомерИсправления, "ЧГ=0")+")";
			КонецЕсли;
			
			ПредставлениеПродавца = "";
			Если Не Объект.Продавец.Пустая() Тогда
				ПредставлениеПродавца = "  продавец " + СокрЛП(Объект.Продавец);
			КонецЕсли;
	
			ПредставлениеСчетаФактуры = "С/ф №" + ПредставлениеНомераСчетФактура + ПредставлениеИсправленияСчетФактура + " от " + ПредставлениеДатыСчетФактура + ПредставлениеПродавца;
			
		Иначе
			ПредставлениеСчетаФактуры = "<С/ф не предоставлен>";
		КонецЕсли;  
		
	КонецЕсли;  
	
	Если ЭтоУПД Тогда
		
		ВидУПД = "УПД";	
		Если Объект.Корректировка и Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") Тогда
			ВидУПД = "УКД";	
		КонецЕсли;
		
		ПредставлениеОбъектаВнешнегоСчета = "";
		Если Объект.СписокСчетов и НЕ ВводОстатковОЗ Тогда
			ПредставлениеОбъектаВнешнегоСчета = " к списку счетов";
		Конецесли;  
		
		Если НЕ Объект.ПредъявленСчет и НЕ Объект.СписокСчетов Тогда 
			Если Объект.Счет.Пустая() Тогда  
				ПредставлениеВнешнегоСчета = " <не указан>";
			Иначе   
				ПредставлениеНомераВнешнегоСчета = Объект.Счет.НомерСчета;	 
				ПредставлениеДатыВнешнегоСчета 	 = Формат(Объект.Счет.ДатаСчета, "ДФ=dd.MM.yyyy"); 
				
				ПредставлениеВнешнегоСчета 		= ПредставлениеНомераВнешнегоСчета + " от "+ПредставлениеДатыВнешнегоСчета;
			КонецЕсли;
			
			ПредставлениеОбъектаВнешнегоСчета = "  к счёту №" + ПредставлениеВнешнегоСчета;
		КонецЕсли;

		
		
		Если Объект.ПредъявленСФ Тогда  
			СтатусУПД 				= "(1)";
			ПредставлениеНомераУПД	= Объект.НомерСФ;
			ПредставлениеНомераУПД	= " №"+ ?(ПустаяСтрока(ПредставлениеНомераУПД), "<...>", 	ПредставлениеНомераУПД);
			ПредставлениеДатыУПД 	= ?(Объект.ДатаСФ = Дата(1,1,1),				  "<...>",	Формат(Объект.ДатаСФ,"ДФ=dd.MM.yyyy"));
			
			ПредставлениеИсправленияУПД = "";
			Если ЗначениеЗаполнено(Объект.НомерИсправления) 
				И Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
				ПредставлениеИсправленияУПД  =  " (испр. "+Формат(Объект.НомерИсправления, "ЧГ=0")+")";
			КонецЕсли;

		Иначе
			СтатусУПД 				= "(2)";
			ПредставлениеНомераУПД	= Объект.НомерАкта;
			ПредставлениеНомераУПД	= " №"+ ?(ПустаяСтрока(ПредставлениеНомераУПД), "<...>", 	ПредставлениеНомераУПД);
			ПредставлениеДатыУПД 	= ?(Объект.ДатаАкта = Дата(1,1,1),				"<...>",	Формат(Объект.ДатаАкта,"ДФ=dd.MM.yyyy"));
		КонецЕсли;  
		
		ПредставлениеУПД = ВидУПД + СтатусУПД + ПредставлениеНомераУПД + ПредставлениеИсправленияУПД + " от "+ ПредставлениеДатыУПД + ПредставлениеОбъектаВнешнегоСчета;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _СформироватьКурс()
	// --- 
	
	Если НЕ Объект.Валюта.Пустая() И (Объект.Валюта <> _ДС().КО.ВалютаРегламентированногоУчета) Тогда
		
		Если (НЕ Объект.УЕ_ПользовательскийКурс) Тогда
			СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,_ДатаВозникновенияЗадолженности());
			ТекущийКурс = СК.Курс;	
		Иначе
			СК = Новый Структура("Курс,Кратность",Объект.УЕ_Курс,Объект.УЕ_Кратность);
		КонецЕсли; 
		// --- 
		КурсВалюты = Строка(Объект.Валюта)+" = "+Формат(СК.Курс,"ЧЦ=15; ЧДЦ=4; ЧГ=");
		Если СК.Кратность <> 1 Тогда
			
			_сф.стр_Добавить(КурсВалюты,"/"+Формат(СК.Кратность,"ЧЦ=10; ЧГ="));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДатаКурса()
	// --- 
	
	Если (Объект.ПредъявленАкт) Тогда
		
		Возврат(Объект.ДатаАкта);
		
	ИначеЕсли (Объект.ПредъявленСчет) Тогда 
		
		Возврат(Объект.ДатаСчета);
		
	Иначе
		
		Возврат(Объект.Дата);
		
	КонецЕсли; 
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ДатаВозникновенияЗадолженности()
	
	Если Объект.ФормироватьВедомыеДатойДокумента Тогда
		Возврат ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	КонецЕсли;
	
	Если Объект.ПредъявленАкт Тогда
		Возврат Объект.ДатаАкта;
	КонецЕсли;
	
	Если Объект.ПредъявленСчет Тогда
		Возврат Объект.ДатаСчета;
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
	
КонецФункции

&НаСервере
Процедура ЗаписатьСрокОплатыДокумента() 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Счет", 					Объект.Ссылка);
	СтруктураПараметров.Вставить("ДатаОплаты", 				_СрокОплаты);
	СтруктураПараметров.Вставить("Описание", 				_СрокОплатыОписание);
	СтруктураПараметров.Вставить("РучноеРедактирование", 	_СрокОплатыРучноеРедактирование);

	РегистрыСведений.CW_СрокиОплатыСчетов.ЗаписатьСрокОплатыДокумента(СтруктураПараметров); 

КонецПроцедуры

&НаСервере
Процедура РасчитатьСрокОплатыДокумента()
	
	Если Объект.Ссылка.Пустая() или _СрокОплатыРучноеРедактирование Тогда
	//	или ЗначениеЗаполнено(_СрокОплаты)
		Возврат;
	КонецЕсли;
	
	ПорядокРасчетаСрокаОплаты = _ДС().ПД.УсловияОплаты.ПорядокРасчета; 
	Если Объект.ПредъявленСчет и Не Объект.ПредъявленАкт 
		и ПорядокРасчетаСрокаОплаты = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыВозвратаАкта") Тогда
		Возврат;
	Конецесли;	
	
	СтруктураДанных = CW_Документы.ПодготовитьДанныеДляРасчетаСрокаОплаты(Объект);
	_СрокОплаты 	= CW_Документы.РассчитатьСрокОплаты(СтруктураДанных);
	
	ЗаписатьСрокОплатыДокумента();
	
	Если Не Объект.ПредъявленСчет и Объект.ПредъявленАкт 
		и ПорядокРасчетаСрокаОплаты = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыВозвратаАкта") Тогда
		
		мСвязанныеСчета = Документы.CW_РасходыПоГрузоперевозке.ПолучитьСвязанныеСчета(Объект.Ссылка);
		Для каждого СвязанныйСчет из мСвязанныеСчета Цикл    
			
			ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(СвязанныйСчет);
			Если НЕ ДанныеСрокаОплаты.РучноеРедактирование Тогда
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Счет",		СвязанныйСчет);
				СтруктураПараметров.Вставить("ДатаОплаты",	_СрокОплаты);
				
				РегистрыСведений.CW_СрокиОплатыСчетов.ЗаписатьСрокОплатыДокумента(СтруктураПараметров); 
			КонецЕсли;
		
		КонецЦикла;
	КонецЕсли;
	 	
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеДаты 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Если (_ГодИзменился()) Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаИзмененияГода",ЭтотОбъект, Новый Структура()); 
			ПоказатьВопрос(ПОВ,"Дата документа перенесена в другой год."+Символы.ПС+ 
			"Документу будет присвоен новый номер."+Символы.ПС+ 
			"Продолжить?",РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
	КонецЕсли;
	
	_ДатаПриИзменении();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВопросаИзмененияГода(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			// присваевам новый номер
			_ОбработатьИзменениеГода();
			
		Иначе
			
			// восстанавливаем дату по ссылке
			_ВосстановитьДатуДокумента();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбработатьИзменениеГода()
	// --- 
	
	НачальнаяДатаДокумента = Объект.Дата;
	// --- 
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	// --- 
	_ДатаПриИзменении();
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _ВосстановитьДатуДокумента()
	// --- 
	
	Объект.Дата = НачальнаяДатаДокумента;
	
	// --- 
КонецПроцедуры
 

&НаСервере
Функция _ГодИзменился()
	// --- 
	
	Возврат(Год(Объект.Дата) <> Год(НачальнаяДатаДокумента));
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура ДатаОчистка(Элемент, СтандартнаяОбработка)
	_ДатаПриИзменении();
КонецПроцедуры

&НаСервере
Процедура _ДатаПриИзменении()
	
	// если очистили дату, то принудительно 
	// устанавливаем текущую дату
	Если Объект.Дата = Дата(1,1,1) Тогда
		ДатаСтрокой = Формат(ТекущаяДата(),"ДФ=yyyyMMdd");
		ВремяСтрокой = Формат(ТекущаяДата(),"ДФ=HHmmss");
		Объект.Дата = Дата(ДатаСтрокой+ВремяСтрокой);
	КонецЕсли;
	
	// необходимо обновить параметры учётной политики и параметры договора
	_СформироватьОбщиеПараметры("ПараметрыДоговора,УчетнаяПолитика");
	
	// и курс валюты
	_СформироватьКурс();
	_ПроверитьРежимВводаОстатков();
	
	// пересчитаем принудительно срок оплаты
	РасчитатьСрокОплатыДокумента();   
	
	// актуализируем список услуг по договору (если по договору предусмотрено ограничение)
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		УстановитьАдресСпискаУслугПоДоговору();     
	КонецЕсли;
	
	// регенерация формы 
	ОбновитьНомераДокументовНаСервере();
	_УправлениеЭлементамиФормы(); 
	
	УстановитьПараметрыВыбораСтавкиНДС();
	
КонецПроцедуры  


#КонецОбласти 

#Область ИзменениеОрганизации 

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	_ОрганизацияПриИзменении();
	// --- 
	Если СокрЛП(Объект.Номер) <> "" И НЕ Объект.Организация.Пустая() Тогда
		
		// проверяем, нужно ли менять
		Если _НужноУстановитьНовыйНомер() Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУстановкиНовогоНомера",ЭтотОбъект); 
			ПоказатьВопрос(ПОВ,"Установить новый номер?", РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУстановкиНовогоНомера(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ=КодВозвратаДиалога.Да Тогда
		
		_УстановитьНовыйНомер();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _НужноУстановитьНовыйНомер()
	// --- 
	
	Если Объект.Организация.Префикс = "" Тогда
		
		Возврат(Ложь);
		
	КонецЕсли; 

	ДлинаПрефикса = СтрДлина(Объект.Организация.Префикс);
	Если Лев(СокрЛП(Объект.Номер),ДлинаПрефикса) <> Объект.Организация.Префикс Тогда
		
		Возврат(Истина);
		
	КонецЕсли; 
	
	Возврат(Ложь);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ОрганизацияПриИзменении()
	// --- 
	
	_СформироватьОбщиеПараметры("УчетнаяПолитика");
	УстановитьПараметрыВыбораСтавкиНДС();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _УстановитьНовыйНомер()
	// --- 
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(Документ,"Объект");
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеКонтрагента 

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	_УФК.ВыбратьПоставщика(Объект.Контрагент,Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ПроверитьКонтрагентаПоБазеЛКК = КонтрагентПриИзмененииНаСервере(); 
	
	//Подсистема.CW_ЭлектронныйОбменДанными
	Если ПроверитьКонтрагентаПоБазеЛКК Тогда
		ПроверитьКонтрагентаПоБазеЛКК();
	КонецЕсли;
	//Подсистема.CW_ЭлектронныйОбменДанными
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьИННКонтрагента(Контрагент)
	
	Возврат Контрагент.Инн;
	
КонецФункции

&НаСервере
Функция КонтрагентПриИзмененииНаСервере()
	
	// если очистили контрагента, то очищаем и договор
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Договор = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) И (Объект.Договор.Владелец = Объект.Контрагент) Тогда 
		Возврат Ложь;
		// нечего менять
	Иначе 
		Объект.Договор = CW_Документы.ПолучитьПоследнийДоговор(Объект.Контрагент, Объект.Организация, Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		_ОбработатьИзменениеДоговора();
	КонецЕсли;
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииКонтрагентаНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
	Если Объект.Корректировка Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти 

#Область ИзменениеДоговора 

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	Отбор = Новый Структура("Владелец,Организация,ВидДоговора",Объект.Контрагент,Объект.Организация,ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
	ПараметрыФормы = Новый Структура("Отбор,РежимВыбора",Отбор,Истина);
	// --- 
	ОткрытьФорму("Справочник.CW_ДоговорыПоГрузоперевозкам.ФормаВыбора",ПараметрыФормы,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	_ОбработатьИзменениеДоговора();
	
КонецПроцедуры

&НаСервере
Процедура _ОбработатьИзменениеДоговора(КопированиеДокумента = Ложь)
	
	_СформироватьОбщиеПараметры();

	УстановитьАдресСпискаУслугПоДоговору();
	
	//AFR-233578
	//ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре();
	//ОтключитьИсториюВыбораНоменклатуры(ИспользуетсяОгранчиениеУслуг);
	//AFR-233578
	
	Объект.ПоказатьРубли = Ложь;
	УстановитьВидимостьГруппыСуммыДокмента();

	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		Возврат;		
	КонецЕсли;
	
	//Подсистема.УчетПриложенийДоговоров
	Объект.Валюта = CW_УчетПриложенийДоговоровСервер.ПолучитьВалютуПриложенияДОговора(Объект.ПриложениеКДоговору, Объект.Договор);
	//Подсистема.УчетПриложенийДоговоров
	
	Объект.ЗачетАвансов.Очистить();
	Объект.ПлатёжноРасчётныеДокументы.Очистить();
	_ПараметрыДоговора = _ДС().ПД;
	
	Если НЕ Объект.Договор.Пустая() Тогда
		
		СтруктураПараметровБухУчета = Новый Структура;
		СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
		СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
		
		ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);
		
		ВзаиморасчетыВУЕ		= ПараметрыБухгалтерскогоУчета.ВзаиморасчетыВУЕ;	
		
		Если ЗначениеЗаполнено(_ПараметрыДоговора.ПорядокЗачетаАвансов) Тогда
			Объект.СпособЗачетаАвансов = _ПараметрыДоговора.ПорядокЗачетаАвансов;
		КонецЕсли;

		Если ЗначениеЗаполнено(_ПараметрыДоговора.ПорядокЗачетаАвансовОЗ) Тогда
			Объект.СпособЗачетаАвансовОЗ = _ПараметрыДоговора.ПорядокЗачетаАвансовОЗ;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(_ПараметрыДоговора.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ) Тогда
			Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = _ПараметрыДоговора.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ;
		Иначе
			Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.НеУчитывать;
		КонецЕсли;
		
		Если (НЕ ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
			Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
		КонецЕсли; 
		
		Если НЕ КопированиеДокумента Тогда
			Объект.ЭтоУниверсальныйДокумент = _ПараметрыДоговора.ИспользуетсяУниверсальныйДокумент;
		КонецЕсли;
		
		РасчитатьСрокОплатыДокумента();
		_СформироватьКурс();
		
	КонецЕсли;   
	
	
	УстановитьЗаголовокНадписиКомментарияДоговора();
	_УправлениеЭлементамиФормы();
	ОбновитьНомераДокументовНаСервере();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииДоговораНаСервере(ЭтаФорма);		
	//Подсистема.УчетПриложенийДоговоров

	
	// --- 
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГруппыСуммыДокмента()
	
	Элементы.ГруппаСуммыДокумента.Видимость 	= Объект.Договор.ВзаиморасчетыВУЕ;
	Элементы.ГруппаСуммыДокумента.Доступность 	= НЕ Объект.Корректировка;

КонецПроцедуры

#КонецОбласти 

//Подсистема.ОригиналыДокументов
&НаКлиенте
Процедура ОригиналыПредоставленыПриИзменении(Элемент)
	
	ОригиналыПредоставленыПриИзмененииНаСервере();
	
КонецПроцедуры

&Насервере
Процедура ОригиналыПредоставленыПриИзмененииНаСервере()
	
	CW_ОригиналыДокументовСервер.ОригиналыПредоставленыПриИзмененииНаСервере(ЭтаФорма) ;
	
	Если Не Объект.Договор.Пустая() Тогда
		РасчитатьСрокОплатыДокумента();
		УстановитьОписаниеСрокаОплаты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвратаНажатие(Элемент, СтандартнаяОбработка)
	
	CW_ОригиналыДокументовКлиент.ОткрытьФормуВводаДаты(ЭтаФорма,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(НоваяДата, Параметры) Экспорт
	
	Если НЕ НоваяДата = Неопределено Тогда
		ОбработатьИзменениедатыВозвратаОригиналовДокументов(НоваяДата);
		
		Если Не Объект.Договор.Пустая() Тогда
			РасчитатьСрокОплатыДокумента();
			УстановитьОписаниеСрокаОплаты();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениедатыВозвратаОригиналовДокументов(НоваяДата)
	
	CW_ОригиналыДокументовСервер.ОбработатьИзменениедатыВозвратаОригиналовДокументов(ЭтаФорма, НоваяДата);

КонецПроцедуры
//Подсистема.ОригиналыДокументов


#Область ИзменениеКомментария 

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	_УправлениеЭлементамиФормы();
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// УСЛУГИ
// ---------------------------------------------------------------------------- 

#Область УслугиОбщиеСобытия 

&НаКлиенте
Процедура УслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.УслугиЗаказ Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		Попытка
			ПоказатьЗначение(,_Заказ(Элементы.Услуги.ТекущиеДанные.Грузоперевозка));
		Исключение
			//ОписаниеОшибки()
		КонецПопытки; 
		
	ИначеЕсли (Поле = Элементы.УслугиНоменклатурнаяГруппа) Тогда 
		
		 Попытка
			ПоказатьЗначение(,_НоменклатурнаяГруппа(Элементы.Услуги.ТекущиеДанные.Номенклатура));
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;
		
	Иначе
		
		Если ЭтаФорма.ТолькоПросмотр Тогда
			
			СтандартнаяОбработка = Ложь;
			// --- 
			Если Поле = Элементы.УслугиГрузоперевозка Тогда
				
				Попытка
					ПоказатьЗначение(,Элементы.Услуги.ТекущиеДанные.Грузоперевозка);
				Исключение
					//ОписаниеОшибки()
				КонецПопытки; 
				
			ИначеЕсли Поле = Элементы.УслугиСчет Тогда 
				
				Попытка
					ПоказатьЗначение(,Элементы.Услуги.ТекущиеДанные.Счет);
				Исключение
					//ОписаниеОшибки()
				КонецПопытки; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция _Заказ(Грузоперевозка)
	// --- 
	
	Возврат(Грузоперевозка.Заказ);
	
	// --- 
КонецФункции

&НаСервереБезКонтекста
Функция _НоменклатурнаяГруппа(Номенклатура)
	// --- 
	
	Возврат(Номенклатура.НоменклатурнаяГруппа);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура УслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиГрузоперевозкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если _ГрузоперевозкаЗакрыта(ВыбранноеЗначение) Тогда
		
		СтандартнаяОбработка = Ложь;
		_УФК.ВывестиПредупреждение("Грузоперевозка блокирована для использования в документах!");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ГрузоперевозкаЗакрыта(ГП)
	// --- 
	
	ДатаЗакрытия = CW_Мониторинг.ПолучитьДатуЗакрытия(ГП);
	Если ДатаЗакрытия <> Дата(1,1,1) Тогда
		
		Возврат(Истина);
		
	Иначе
		
		Возврат(Ложь);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;

	Если НоваяСтрока и НЕ Копирование Тогда
		
		ТекущиеДанные.Количество = 1;
		
		ПорядокОтражения = _ДС().ПД.ОсновнойПорядокОтраженияРасходов;
		Если ПорядокОтражения.Пустая() Тогда
			ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты");
		КонецЕсли; 
		ТекущиеДанные.ПорядокОтражения = ПорядокОтражения;
		//ТекущиеДанные.Подразделение = ПодразделениеПользователя; //AFR-250522
		
		ПриИзмененииУслугиПорядокОтражения();   
	Иначе
		Если ТекущиеДанные.Количество = 0 Тогда
			ТекущиеДанные.Количество = 1;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ПорядокОтражения) Тогда 
			ПорядокОтражения = _ДС().ПД.ОсновнойПорядокОтраженияДоходов;
			Если ПорядокОтражения.Пустая() Тогда
				ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"); 
			Иначе
				ТекущиеДанные.ПорядокОтражения = ПорядокОтражения;   
			КонецЕсли; 
		КонецЕсли;   
		//УДАЛЕНО по заявке AFR-250522
		//Если Не ЗначениеЗаполнено(ТекущиеДанные.Подразделение) Тогда 
		//	ТекущиеДанные.Подразделение = ПодразделениеПользователя;
		//КонецЕсли;
	КонецЕсли;
	
	//AFR-233578
	ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре(ТекущиеДанные.ПорядокОтражения);
	ОтключитьИсториюВыбораНоменклатуры(ИспользуетсяОгранчиениеУслуг);
	//AFR-233578
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтогиПоУслугам()
	//! ИтогоВсего
	
	// итоговая строка по табличной части "Услуги" 
	ПредставлениеВалюты 	= Строка(Объект.Валюта); 
	ПредставлениеВалютыРег	= Строка(ВалютаРегламентированногоУчета); 
	
	ФорматнаяСтрока = "ЧЦ=15; ЧДЦ=2; ЧН=";
	Если (НЕ Объект.Корректировка) Тогда
		
		Если Объект.Услуги.Количество() = 0 Тогда
			ИтогоПоУслугам = "Сведения об услугах отсутствуют";
		Иначе
			ИтогоПоУслугам=	"Строк: "+Объект.Услуги.Количество()+
			";  Сумма: "+Формат(Объект.Услуги.Итог("Сумма"),ФорматнаяСтрока)+" "+ПредставлениеВалюты+ 
			";  НДС: "+Формат(Объект.Услуги.Итог("НДС"),ФорматнаяСтрока)+" "+ПредставлениеВалюты+
			";  Всего: "+Формат(Объект.Услуги.Итог("Всего"),ФорматнаяСтрока)+" " +ПредставлениеВалюты; 
			
			Если Объект.ПоказатьРубли Тогда
				ИтогоПоУслугам=	ИтогоПоУслугам+
				";  Сумма: "+Формат(Объект.Услуги.Итог("СуммаРег"),ФорматнаяСтрока)+" "+ПредставлениеВалютыРег+ 
				";  НДС: "+Формат(Объект.Услуги.Итог("НДСРег"),ФорматнаяСтрока)+" "+ПредставлениеВалютыРег+
				";  Всего: "+Формат(Объект.Услуги.Итог("ВсегоРег"),ФорматнаяСтрока)+" " +ПредставлениеВалютыРег; 
			КонецЕсли;
			
		КонецЕсли;
		
		Если (КонтрольДокументовПоСумме) Тогда
			Отклонение = 0;
			Если (Объект.СуммаПоПервичномуДокументу <> 0) Тогда
				Если (Объект.Услуги.Итог("Всего") <> Объект.СуммаПоПервичномуДокументу) Тогда
					Отклонение = Объект.СуммаПоПервичномуДокументу - Объект.Услуги.Итог("Всего");
					Если (Отклонение <> 0) Тогда
						ИтогоПоУслугам = ИтогоПоУслугам + "; Отклонение от контрольной суммы: "+Формат(Отклонение,ФорматнаяСтрока)+" " +ПредставлениеВалюты;	
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; 
			
			// управление цветом итоговой надписи при наличии отклонения от контрольной суммы
			Если Отклонение <> 0 Тогда
				Элементы.ИтогоПоУслугам.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
			Иначе
				Элементы.ИтогоПоУслугам.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
			КонецЕсли; 
		КонецЕсли; // выполняется котроль суммы документа
		
	Иначе
		
		Если Объект.Услуги.Количество() = 0 Тогда
			ИтогоПоУслугам_Корректировка = "Сведения об услугах отсутствуют";
		Иначе
			ИтогоПоУслугам_Корректировка =	"Строк: "+Объект.Услуги.Количество()+
			";  Сумма: "+Формат(Объект.Услуги.Итог("Сумма")-Объект.Услуги.Итог("Сумма_ДоКорректировки"),ФорматнаяСтрока)+" "+ПредставлениеВалюты+ 
			";  НДС: "+Формат(Объект.Услуги.Итог("НДС")-Объект.Услуги.Итог("НДС_ДоКорректировки"),ФорматнаяСтрока)+" "+ПредставлениеВалюты+
			";  Всего: "+Формат(Объект.Услуги.Итог("Всего")-Объект.Услуги.Итог("Всего_ДоКорректировки"),ФорматнаяСтрока)+" " +ПредставлениеВалюты;  
			
			Если Объект.ПоказатьРубли Тогда
				ИтогоПоУслугам_Корректировка =	ИтогоПоУслугам_Корректировка +
				";  Сумма: "+Формат(Объект.Услуги.Итог("СуммаРег")-Объект.Услуги.Итог("Сумма_ДоКорректировкиРег"),ФорматнаяСтрока)+" "+ПредставлениеВалютыРег + 
				";  НДС: "+Формат(Объект.Услуги.Итог("НДСРег")-Объект.Услуги.Итог("НДС_ДоКорректировкиРег"),ФорматнаяСтрока)+" "+ПредставлениеВалютыРег +
				";  Всего: "+Формат(Объект.Услуги.Итог("ВсегоРег")-Объект.Услуги.Итог("Всего_ДоКорректировкиРег"),ФорматнаяСтрока)+" " +ПредставлениеВалютыРег ;  
			КонецЕсли;
		КонецЕсли;
		
		Если (КонтрольДокументовПоСумме) Тогда
			Отклонение = 0; 
			Если (Объект.СуммаПоПервичномуДокументу <> 0) Тогда
				Если (Объект.Услуги.Итог("Всего") <> Объект.СуммаПоПервичномуДокументу) Тогда
					Отклонение = Объект.СуммаПоПервичномуДокументу - (Объект.Услуги.Итог("Всего")-Объект.Услуги.Итог("Всего_ДоКорректировки"));
					Если Отклонение <> 0 Тогда
						ИтогоПоУслугам_Корректировка = ИтогоПоУслугам_Корректировка + "; Отклонение от контрольной суммы: "+Формат(Отклонение,ФорматнаяСтрока)+" " +ПредставлениеВалюты;	
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; 
			
			// управление цветом итоговой надписи при наличии отклонения от контрольной суммы
			Если Отклонение <> 0 Тогда
				Элементы.ИтогоПоУслугам_Корректировка.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
			Иначе
				Элементы.ИтогоПоУслугам_Корректировка.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
			КонецЕсли; 
		КонецЕсли; // выполняется котроль суммы документа
		

		
		
	КонецЕсли;
						
КонецПроцедуры

#КонецОбласти 

#Область УслугиРеквизиты

&НаКлиенте
Процедура УслугиГрузоперевозкаПриИзменении(Элемент)
	
	_УслугиГрузоперевозкаПриИзменении(Элементы.Услуги.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _УслугиГрузоперевозкаПриИзменении(Строка)
	
	ТребоватьЗаполненияПокупателя = _ДС().ПД.ТребоватьЗаполненияПокупателяДляПорядокаОтраженияЗатратыВРасходах;
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	
	Если НЕ НеЗаменятьПредставлениеНоменклатуры Тогда
		ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
		
		ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
		ПараметрыШаблона.Объект 		= Объект;
		ПараметрыШаблона.Дата 			= Объект.Дата;
		ПараметрыШаблона.Договор 		= Объект.Договор;
		ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
		ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
		
		CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
	КонецЕсли;
	// --- 
	Если СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда 
		
		Если ТребоватьЗаполненияПокупателя Тогда
			СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(Строка);
			СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
			
			Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
				СтрокаТЧ.Покупатель 		 = СтруктураДанныхСтроки.Покупатель;
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
				СтрокаТЧ.ДоговорПокупателя 	 = СтруктураДанныхСтроки.ДоговорПокупателя;
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
				СтрокаТЧ.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
				СтрокаТЧ.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
			КонецЕсли;
		КонецЕсли;
		
		_ПодставитьПодразделение(СтрокаТЧ);
		
	Иначе
		СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(Строка);
		СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
		
		Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
			СтрокаТЧ.Покупатель 		 = СтруктураДанныхСтроки.Покупатель;
		КонецЕсли;
		Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
			СтрокаТЧ.ДоговорПокупателя 	 = СтруктураДанныхСтроки.ДоговорПокупателя;
		КонецЕсли;
		Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
			СтрокаТЧ.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
		КонецЕсли;
		Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
			СтрокаТЧ.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
		КонецЕсли;
	КонецЕсли; 
	
	ЗаполнитьДополнительныеКолонкиТабличнойЧасти();
	
	#Область Динамический_вывод_дополнительных_колонок
	
	_УФС.ОбновитьЗначенияПараметровГрузоперевозкиПоСтроке(СтрокаТЧ, ПолучитьСтруктуруПараметровДляПередачи());	
	
	#КонецОбласти
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ПодставитьПодразделение(СтрокаТЧ)
	
	Если НЕ _ДС().УП.ГруппировкаЗатратПоПодразделениям 
		или НЕ СтрокаТЧ.Подразделение.Пустая() 
		или СтрокаТЧ.Грузоперевозка.Пустая() Тогда
		Возврат;
	КонецЕсли;     

	ПодразделениеЗатрат		= ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка");

	ПараметрПодразделения 	= Константы.CW_ПараметрПодразделенияЗатрат.Получить(); 
	Если Не ПараметрПодразделения.Пустая() Тогда   
		
		СтруктураЗначения 	= РегистрыСведений.CW_ХарактеристикиГрузоперевозок.ПолучитьЗначениеПараметра(СтрокаТЧ.Грузоперевозка, ПараметрПодразделения); 
		ПодразделениеЗатрат = СтруктураЗначения.Значение;
		
		Если НЕ ЗначениеЗаполнено(ПодразделениеЗатрат) и ЗначениеЗаполнено(СтрокаТЧ.Грузоперевозка.Заказ) Тогда
			СтруктураЗначения 	= РегистрыСведений.CW_ХарактеристикиЗаказов.ПолучитьЗначениеПараметра(СтрокаТЧ.Грузоперевозка.Заказ, ПараметрПодразделения); 
			ПодразделениеЗатрат = СтруктураЗначения.Значение;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ПодразделениеЗатрат) Тогда
		ПодразделениеЗатрат = CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "ОсновноеПодразделение");
	КонецЕсли;
	
	СтрокаТЧ.Подразделение = ПодразделениеЗатрат;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	_УслугиНоменклатураПриИзменении(Элементы.Услуги.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _УслугиНоменклатураПриИзменении(Строка)
	
	ТребоватьЗаполненияПокупателя = _ДС().ПД.ТребоватьЗаполненияПокупателяДляПорядокаОтраженияЗатратыВРасходах;

	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда 
		
		Если РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки тогда
			
			//Получаем количество из Параметра
			ЗначениеПараметра   = 0;
			СтруктураПараметров = Новый Структура("ТипПеревозки,Номенклатура,ЕдиницаИзмерения", СтрокаТЧ.Грузоперевозка.ТипПеревозки,СтрокаТЧ.Номенклатура,СтрокаТЧ.Номенклатура.ЕдиницаИзмерения);		
			НайденныйПараметр 	= CW_Документы.ПолучитьПараметрДляПодстановкиЗначенияВКоличество(СтруктураПараметров);
			
			Если НайденныйПараметр <> Неопределено Тогда
				//Получаем только первое значение
				СтрокаПараметраГП = СтрокаТЧ.Грузоперевозка.ПараметрыГрузоперевозки.Найти(НайденныйПараметр, "Параметр");
				
				Если СтрокаПараметраГП <> Неопределено Тогда
					ЗначениеПараметра =  СтрокаПараметраГП.Значение;
				КонецЕсли;
				
				Если Не УстановитьЗначениеНольЗначениеПараметраНеУстановлено и Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
					ЗначениеПараметра = 1;
				КонецЕсли;
				
				СтрокаТЧ.Количество =  ЗначениеПараметра;
				
			КонецЕсли;	
			
		КонецЕсли;
		
		Если _ДС().НП.ПодставлятьСтавкуНДС или Не ЗначениеЗаполнено(СтрокаТЧ.СтавкаНДС) Тогда
			
			ПараметрыСтавкиНДС = Новый Структура;
			ПараметрыСтавкиНДС.Вставить("Дата", 		Объект.Дата);
			ПараметрыСтавкиНДС.Вставить("Организация", 	Объект.Организация);
			ПараметрыСтавкиНДС.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
			ПараметрыСтавкиНДС.Вставить("Договор", 		Объект.Договор); 
			ПараметрыСтавкиНДС.Вставить("ПодставлятьСтавкуНДС", _ДС().НП.ПодставлятьСтавкуНДС);
			ПараметрыСтавкиНДС.Вставить("ТипДвижения", "РАСХОДЫ");
			
			ПолученнаяСтавкаНДС = CW_Документы.ПолучитьСтавкуНДС(ПараметрыСтавкиНДС);
			
			// пересчет суммовых показателей осуществляем, только при изменении ставки НДС
			Если СтрокаТЧ.СтавкаНДС <> ПолученнаяСтавкаНДС Тогда
				СтрокаТЧ.СтавкаНДС = ПолученнаяСтавкаНДС;
				
				ТД = СтрокаТЧ;
				ТД.Сумма = ТД.Цена * ТД.Количество;
				ТД.НДС = ТД.Сумма * CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
				ТД.Всего = ТД.Сумма + ТД.НДС;
			КонецЕсли; 
			
		КонецЕсли;
		
		// пробуем найти в регистре
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат
		|ИЗ
		|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры
		|ГДЕ
		|	CW_СтатьиЗатратНоменклатуры.Номенклатура = &Номенклатура";
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТЧ.Номенклатура);
		ТЗ = Запрос.Выполнить().Выгрузить();
		СтрокаСтатьяЗатрат = _сф.к_ПервыйЭлемент(ТЗ);
		Если (СтрокаСтатьяЗатрат <> Неопределено) Тогда
			СтрокаТЧ.СтатьяЗатрат = СтрокаСтатьяЗатрат.СтатьяЗатрат;
		Иначе
			СтрокаТЧ.СтатьяЗатрат = _ДС().УП.ОсновнаяСтатьяЗатрат;
		КонецЕсли; 
		
		Если СтрокаТЧ.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление И СтрокаТЧ.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам Тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Дата"					, Объект.Дата);
			СтруктураПараметров.Вставить("Организация"			, Объект.Организация);
			СтруктураПараметров.Вставить("Номенклатура"			, СтрокаТЧ.Номенклатура);
			СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа);
			
			СтрокаТЧ.СпособУчетаНДС = CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров);
			
		КонецЕсли;	
		
		
		
	КонецЕсли;
	
	Если (СтрокаТЧ.Количество = 0) Тогда
		СтрокаТЧ.Количество = 1;
	КонецЕсли;
	
	Если НЕ НеЗаменятьПредставлениеНоменклатуры Тогда
		// пробуем переформировать представление номенклатуры
		ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
		
		ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
		ПараметрыШаблона.Объект 		= Объект;
		ПараметрыШаблона.Дата 			= Объект.Дата;
		ПараметрыШаблона.Договор 		= Объект.Договор;
		ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
		ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
		
		CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
		
	КонецЕсли;

	//Если есть ограничение услуг по договору то берем цену оттуда 
	ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре(СтрокаТЧ.ПорядокОтражения);
	Если ИспользуетсяОгранчиениеУслуг Тогда
		
		Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("АдресУслугПоДоговору"						, АдресУслугПоДоговору);
			СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтГруза"		, УстанавливатьЦенуВЗависимостиОтГруза);
			СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтКлиента"	, УстанавливатьЦенуВЗависимостиОтКлиента);
			
			СтруктураПараметров.Вставить("Номенклатура"							, СтрокаТЧ.Номенклатура);
			Если УстанавливатьЦенуВЗависимостиОтГруза Тогда
				СтруктураПараметров.Вставить("Груз" , СтрокаТЧ.Грузоперевозка.Груз);
			КонецЕсли;
			Если УстанавливатьЦенуВЗависимостиОтКлиента тогда
				
				СтруктураПараметровКлиента = Новый Структура;
				СтруктураПараметровКлиента.Вставить("Объект"				, СтрокаТЧ.Грузоперевозка);
				СтруктураПараметровКлиента.Вставить("ЭтоВариантБюджета"		, Ложь);
				СтруктураПараметровКлиента.Вставить("Контрагент"			, СтрокаТЧ.Грузоперевозка.Клиент);
				
				тПокупатель = CW_Финансы.ВернутьПлательщика(СтруктураПараметровКлиента);
				СтруктураПараметров.Вставить("Клиент", тПокупатель);
			КонецЕсли;
			
			УслугаДоговора = _УФС.ПолучитьУслугуДоговораПоПараметрам(СтруктураПараметров);		

			Если УслугаДоговора <> Неопределено Тогда
				
				Если СтрокаТЧ.СтавкаНДС <> УслугаДоговора.СтавкаНДС и ЗначениеЗаполнено(УслугаДоговора.СтавкаНДС) Тогда
					СтрокаТЧ.СтавкаНДС = УслугаДоговора.СтавкаНДС;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(УслугаДоговора.ПорядокОтражения) Тогда
					СтрокаТЧ.ПорядокОтражения = УслугаДоговора.ПорядокОтражения;
					
					// значение заполнено
					
					_ПриИзмененииУслугиПорядокОтражения(СтрокаТЧ.ПолучитьИдентификатор());
					
					Если (СтрокаТЧ.ПорядокОтражения <> ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты")) Тогда
						Если (Элементы.УслугиСпособУчетаНДС.Видимость) Тогда
							СтрокаТЧ.СпособУчетаНДС = Неопределено;	
						КонецЕсли; 
						
						СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(СтрокаТЧ.ПолучитьИдентификатор());
						СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
						
						Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
							СтрокаТЧ.Покупатель 		 	= СтруктураДанныхСтроки.Покупатель;
						КонецЕсли;
						Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
							СтрокаТЧ.ДоговорПокупателя 		= СтруктураДанныхСтроки.ДоговорПокупателя;
						КонецЕсли;
						Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
							СтрокаТЧ.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
						КонецЕсли;
						Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
							СтрокаТЧ.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
						КонецЕсли;
					Иначе
						Если ТребоватьЗаполненияПокупателя Тогда
							СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(СтрокаТЧ.ПолучитьИдентификатор());
							СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
							
							Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
								СтрокаТЧ.Покупатель 		 	= СтруктураДанныхСтроки.Покупатель;
							КонецЕсли;
							Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
								СтрокаТЧ.ДоговорПокупателя 		= СтруктураДанныхСтроки.ДоговорПокупателя;
							КонецЕсли;
							Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
								СтрокаТЧ.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
							КонецЕсли;
							Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
								СтрокаТЧ.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли; 
					
				КонецЕсли;
				
				Если УслугаДоговора.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДССверху тогда
					СтрокаТЧ.Сумма 		= УслугаДоговора.ЦенаБезНДС * СтрокаТЧ.Количество;
					ОбратныйПересчет = Ложь;
				Иначе //в сумме
					СтрокаТЧ.Всего = УслугаДоговора.Цена * СтрокаТЧ.Количество;
					ОбратныйПересчет = Истина;
				КонецЕсли;
				
				Ставка = CW_Финансы.ПолучитьСтавкуНДС(УслугаДоговора.СтавкаНДС);
				
				Если ОбратныйПересчет Тогда
					СтрокаТЧ.НДС 	= СтрокаТЧ.Всего*(Ставка/(100+Ставка));
					СтрокаТЧ.Сумма 	= СтрокаТЧ.Всего - СтрокаТЧ.НДС;
					СтрокаТЧ.Цена 	= _сф.БезопасноРазделить(СтрокаТЧ.Сумма,СтрокаТЧ.Количество);
				Иначе
					СтрокаТЧ.Цена 	= _сф.БезопасноРазделить(СтрокаТЧ.Сумма,СтрокаТЧ.Количество);
					СтрокаТЧ.НДС 	= СтрокаТЧ.Сумма*(Ставка/100);
					СтрокаТЧ.Всего 	= СтрокаТЧ.Сумма+СтрокаТЧ.НДС;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли; 
	Иначе
		
		// установка цены номенклатуры
		ТД = СтрокаТЧ;
		Если ТД.Цена = 0  Тогда
			
			ТипЦен = _ДС().ПД.ТипЦен;
			Если НЕ ТипЦен.Пустая() Тогда
				
				СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,_ДатаВозникновенияЗадолженности());
				Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура, ТипЦен, _ДатаВозникновенияЗадолженности(), Объект.Валюта, СК.Курс,СК.Кратность);
				Если Цена <> 0 Тогда
					
					Если ТипЦен.ЦенаВключаетНДС Тогда
						Если ЗначениеЗаполнено(ТД.СтавкаНДС) И ЗначениеЗаполнено(ТД.Количество) Тогда
							ТД.Всего = Цена*ТД.Количество;
							Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
							ТД.НДС = ТД.Всего*Ставка/(1+Ставка);
							ТД.Сумма = ТД.Всего - ТД.НДС;
							ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
						Иначе
							Если ЗначениеЗаполнено(ТД.СтавкаНДС) Тогда
								Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
								ТД.Цена = Цена/(1+Ставка);
							КонецЕсли; 
						КонецЕсли; 
					Иначе
						Если ЗначениеЗаполнено(ТД.СтавкаНДС) И ЗначениеЗаполнено(ТД.Количество) Тогда
							ТД.Цена = Цена;
							ТД.Сумма = ТД.Цена * ТД.Количество;
							ТД.НДС = ТД.Сумма * CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
							ТД.Всего = ТД.Сумма + ТД.НДС;
						Иначе
							
							ТД.Цена = Цена;
						КонецЕсли; 
					КонецЕсли;
					
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	ПересчитатьСтрокуНаСерере(СтрокаТЧ.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре(Элементы.Услуги.ТекущиеДанные.ПорядокОтражения);	
	Если Не ИспользуетсяОгранчиениеУслуг Тогда      
		
		ВыбранноеЗначение = Элементы.Услуги.ТекущиеДанные.Номенклатура;	
		_УФК.ВыбратьНоменклатуру(ВыбранноеЗначение,Элемент,ДанныеВыбора,СтандартнаяОбработка);
		
	Иначе

		СписокЗначений = Новый СписокЗначений;
		Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
			МассивУслуг =  _УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору);
			СписокЗначений.ЗагрузитьЗначения(МассивУслуг);
		КонецЕсли; 
		
		Если СписокЗначений.Количество() = 0 Тогда
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст   		= "Не определен список услуг по договору!";
			Сообщение.ПутьКДанным  	= "Объект";
			Сообщение.Поле    		= "Договор";
			Сообщение.Сообщить();
			
		Конецесли;
		
		ДанныеВыбора = СписокЗначений;
		СтандартнаяОбработка = Ложь;
		
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	_УслугиПредставлениеНачалоВыбора(Элементы.Услуги.ТекущаяСтрока);
	Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиПорядокОтражения;
	Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиПредставление;
	
КонецПроцедуры

&НаСервере
Процедура _УслугиПредставлениеНачалоВыбора(Строка)
	// --- 
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	
	ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
	
	ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
	ПараметрыШаблона.Объект 		= Объект;
	ПараметрыШаблона.Дата 			= Объект.Дата;
	ПараметрыШаблона.Договор 		= Объект.Договор;
	ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
	ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
	
	CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ПереформироватьПредставлениеУслуг(Знач Строки)
	// --- 
	
	Для каждого Идентификатор Из Строки Цикл
		
		_УслугиПредставлениеНачалоВыбора(Идентификатор);
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
 

&НаКлиенте
Процедура Услуги_ПереформироватьПредставление(Команда)
	
	_ПереформироватьПредставлениеУслуг(Элементы.Услуги.ВыделенныеСтроки);
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура УслугиСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// ---------------------------------------------------------------------------- 
	
	Вариант = Неопределено;
	
	Список = Новый СписокЗначений;
	Список.Добавить("список","Выбор из списка");
	
	// если ведется оперативный учет задолженности
	
	Если (ОперативныйУчет И НЕ ВводОстатковОЗ) Тогда
		
		Список.Добавить("подбор","Подбор неактированных");
		
	КонецЕсли; 
	
	ПОВ = Новый ОписаниеОповещения("ВыполнитьПодборСчета",ЭтотОбъект, Новый Структура("Элемент", Элемент)); 
	Если (Список.Количество()=1) Тогда
		
		Вариант = Список[0];
		ВыполнитьОбработкуОповещения(ПОВ, Вариант);
		
	Иначе
		
		ПоказатьВыборИзМеню(ПОВ,Список,Элемент);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПодборСчета(Вариант, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Вариант <> Неопределено) Тогда
		
		Вариант = Вариант.Значение;
		
	КонецЕсли; 
	
	Если (Вариант = "подбор") Тогда
		
		ТД=Элементы.Услуги.ТекущиеДанные;
		
		СтруктураОтбора = Новый Структура("Организация,Контрагент,Договор,Валюта,Грузоперевозка,ПорядокОтражения,Номенклатура,СтавкаНДС",Объект.Организация,Объект.Контрагент,Объект.Договор,Объект.Валюта,ТД.Грузоперевозка,ТД.ПорядокОтражения,ТД.Номенклатура,ТД.СтавкаНДС);
		
		//Подсистема.УчетПриложенийДоговоров
		СтруктураОтбора.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров
		
		ПФ = Новый Структура("Дата,Документ,Отбор",Объект.Дата,Объект.Ссылка, СтруктураОтбора);
		ОткрытьФорму("ОбщаяФорма.CW_ПодборНеактированныхСчетов",ПФ,ДополнительныеПараметры.Элемент);
		
	ИначеЕсли (Вариант = "список") Тогда 
		
		СтруктураОтбора = Новый Структура("Контрагент,Договор,ПредъявленСчет,ПредъявленАкт,ПредъявленСФ",Объект.Контрагент,Объект.Договор,Истина,Ложь,Ложь);
		
		//Подсистема.УчетПриложенийДоговоров
		СтруктураОтбора.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров
		
		ПФ = Новый Структура("Отбор,РежимВыбора",СтруктураОтбора,Истина);
		ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаВыбора",ПФ,ДополнительныеПараметры.Элемент);
				
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПФ_ВыборНеактированногоСчетаДляСтроки()
	// --- 
	
	//ПФ = Новый Структура("Дата,Документ,Отбор",Объект.Дата,Объект.Ссылка,Новый Структура("Организация,Контрагент,Договор,Валюта,Грузоперевозка,ПорядокОтражения,Номенклатура,СтавкаНДС",Объект.Организация,Объект.Контрагент,Объект.Договор,Объект.Валюта,ТД.Грузоперевозка,ТД.ПорядокОтражения,ТД.Номенклатура,ТД.СтавкаНДС));
	//Возврат(ПФ);
	
	// --- 
КонецФункции

// --- 

&НаКлиенте
Процедура УслугиПокупательПриИзменении(Элемент)
	
	_УслугиПокупательПриИзменении(Элементы.Услуги.ТекущаяСтрока);
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровКлиентСервер.ПриИзмененеииКонтрагентаВСтрокеТабличнойЧасти(ЭтаФорма, "Услуги");
	//Подсистема.УчетПриложенийДоговоров

КонецПроцедуры

&НаСервере
Процедура _УслугиПокупательПриИзменении(Строка)
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	Если НЕ СтрокаТЧ.Покупатель.Пустая() Тогда
		
		СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(Строка);
		СтруктураПараметров.Вставить("Контрагент", 			СтрокаТЧ.Покупатель);
		СтруктураПараметров.Вставить("ЭтоВариантБюджета", 	Истина);
		
		СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
		
		Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
			СтрокаТЧ.Покупатель 		 	= СтруктураДанныхСтроки.Покупатель;
		КонецЕсли;
		Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
			СтрокаТЧ.ДоговорПокупателя 		= СтруктураДанныхСтроки.ДоговорПокупателя;
		КонецЕсли;
		
		Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
			СтрокаТЧ.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
		КонецЕсли;
		
		Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
			СтрокаТЧ.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры

// --- 

&НаКлиенте
Процедура УслугиПорядокОтраженияПриИзменении(Элемент)
	ПриИзмененииУслугиПорядокОтражения();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПорядокОтраженияОчистка(Элемент, СтандартнаяОбработка)
	ПриИзмененииУслугиПорядокОтражения();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииУслугиПорядокОтражения(Строка = Неопределено)
	
	Если Строка = Неопределено Тогда
		Стр = Элементы.Услуги.ТекущиеДанные;
	Иначе
		Стр = Объект.Услуги.НайтиПоИдентификатору(Строка);
	КонецЕсли;	

	// очистили значение
	Если Стр.ПорядокОтражения.Пустая() Тогда
		Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты");
	КонецЕсли;    
	
	Стр.Подразделение = ПодразделениеПользователя;  //AFR-250522
	
	ТребоватьЗаполненияПокупателя = _ДС().ПД.ТребоватьЗаполненияПокупателяДляПорядокаОтраженияЗатратыВРасходах;
	
	_ПриИзмененииУслугиПорядокОтражения(?(Строка = Неопределено, Элементы.Услуги.ТекущаяСтрока, Строка));
	
	Если (Стр.ПорядокОтражения <> ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты")) Тогда
		Если (Элементы.УслугиСпособУчетаНДС.Видимость) Тогда
			Стр.СпособУчетаНДС = Неопределено;	
		КонецЕсли; 
		
		// значение заполнено
		СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(Стр.ПолучитьИдентификатор());
		СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
		
		Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
			Стр.Покупатель 		 	= СтруктураДанныхСтроки.Покупатель;
		КонецЕсли;
		Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
			Стр.ДоговорПокупателя 	= СтруктураДанныхСтроки.ДоговорПокупателя;
		КонецЕсли;
		Если  СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
			Стр.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
		КонецЕсли;
		Если  СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
			Стр.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
		КонецЕсли;
		
	Иначе
		
		Если ТребоватьЗаполненияПокупателя Тогда
			// значение заполнено
			СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(Стр.ПолучитьИдентификатор());
			СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
			
			Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
				Стр.Покупатель 		 	= СтруктураДанныхСтроки.Покупатель;
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
				Стр.ДоговорПокупателя 	= СтруктураДанныхСтроки.ДоговорПокупателя;
			КонецЕсли;
			Если  СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
				Стр.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
			КонецЕсли;
			Если  СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
				Стр.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _ПриИзмененииУслугиПорядокОтражения(Строка)
	// --- 
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	Если (СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
		_ПодставитьПодразделение(СтрокаТЧ);	
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Дата"					, Объект.Дата);
			СтруктураПараметров.Вставить("Организация"			, Объект.Организация);
			СтруктураПараметров.Вставить("Номенклатура"			, СтрокаТЧ.Номенклатура);
			СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа);
			
			СтрокаТЧ.СпособУчетаНДС = CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров);
			
		КонецЕсли;	
	Иначе
		СтрокаТЧ.Подразделение = Неопределено;
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область УслугиСуммы 

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	//Если Элементы.Услуги.ТекущиеДанные.Количество = 0 Тогда
	//	Элементы.Услуги.ТекущиеДанные.Количество = 1;
	//КонецЕсли; 
	
	ПересчитатьСтрокуНаСерере(Элементы.Услуги.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.Услуги.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.Услуги.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаВсегоПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
	ТД.НДС = ТД.Всего*Ставка/(1+Ставка);
	ТД.Сумма = ТД.Всего - ТД.НДС;
	ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаНДСПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	
	Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
		ТД.Всего = ТД.Сумма + ТД.НДС;
	Иначе
		ТД.Сумма = ТД.Всего - ТД.НДС;
		ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	КонецЕсли;
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	
	_УслугиСуммаПриИзменении(Элементы.Услуги.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _УслугиСуммаПриИзменении(Строка)
	// --- 
	
	ТД = Объект.Услуги.НайтиПоИдентификатору(Строка);
	ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС);
	ТД.НДС = CW_Финансы.РассчитатьСуммуНДС(ТД.Сумма, Истина, Ложь, Ставка);
	ТД.Всего = ТД.Сумма + ТД.НДС;
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
	// --- 
КонецПроцедуры


// --- 

&НаКлиенте
Процедура УслугиОУ_ВсегоПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
	ТД.ОЗ_НДС = ТД.ОЗ_Всего*Ставка/(1+Ставка);
	ТД.ОЗ_Сумма = ТД.ОЗ_Всего - ТД.ОЗ_НДС;

КонецПроцедуры

&НаКлиенте
Процедура УслугиОУ_НДСПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	
	Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
		ТД.ОЗ_Всего = ТД.ОЗ_Сумма + ТД.ОЗ_НДС;
	Иначе
		ТД.ОЗ_Сумма = ТД.ОЗ_Всего - ТД.ОЗ_НДС;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УслугиОУ_СуммаПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
	
	ТД.ОЗ_НДС = ТД.ОЗ_Сумма*Ставка;
	ТД.ОЗ_Всего = ТД.ОЗ_Сумма + ТД.ОЗ_НДС;
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура Услуги_ГрупповоеРедактирование(Команда)
	
	Если Объект.Корректировка Тогда
		ТаблицаФормы = Элементы.УслугиКорректировка;
	Иначе
		ТаблицаФормы = Элементы.Услуги;
	КонецЕсли;
	
	// если нет выделенных строк
	Если ТаблицаФормы.ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Для групповой обработки необходимо выделить строки!",10,"Предупреждение");
		Возврат;
	КонецЕсли; 
	
	// передадим имя реквизита (колонки) на котором установлен курсор и его значение
	#Область ОбластьТекущаяКолонка
	
	// Получаем имя реквизта по его пути к данным
	ИмяРеквизитаТабличнойЧасти = ПолучитьИмяРеквизитаТабличнойЧасти(ТаблицаФормы.ТекущийЭлемент.Имя);
	
	Если ИмяРеквизитаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугНоменклатурыПоТабличнойЧасти();	
	
	// параметры для открываемой формы
	ПФ = Новый Структура();
	ПФ.Вставить("Организация", 				Объект.Организация);
	ПФ.Вставить("Строк", 					ТаблицаФормы.ВыделенныеСтроки.Количество());
	ПФ.Вставить("Док", 						"Расходы");
	ПФ.Вставить("ПоказатьСпособУчетаНДС", 	ПоказатьСпособУчетаНДС);
	ПФ.Вставить("ПоказатьПодразделение", 	ПоказатьПодразделение); 
	
	ПФ.Вставить("ИспользуетсяОгранчиениеУслуг", ИспользуетсяОгранчиениеУслуг);
	ПФ.Вставить("АдресУслугПоДоговору", 		АдресУслугПоДоговору);

	// если реквизит "Покупатель" или "ДоговорПокупателя",
	// то в процедуру передаем как "Покупатель"
	Если ИмяРеквизитаТабличнойЧасти = "Покупатель" или ИмяРеквизитаТабличнойЧасти = "ДоговорПокупателя" 
		
		//Подсистема.УчетПриложенийДоговоров
		или ИмяРеквизитаТабличнойЧасти = "ПриложениеКДоговору"
		//Подсистема.УчетПриложенийДоговоров
		
		Тогда
		
		ПФ.Вставить("ТекущийРеквизит", "Покупатель");
		ПФ.Вставить("ТекущееЗначение", ТаблицаФормы.ТекущиеДанные["Покупатель"]);
		ПФ.Вставить("ТекущееЗначениеДополнительное",ТаблицаФормы.ТекущиеДанные["ДоговорПокупателя"]);
		
		//Подсистема.УчетПриложенийДоговоров
		ПФ.Вставить("ТекущееЗначениеПриложение",ТаблицаФормы.ТекущиеДанные["ПриложениеКДоговору"]);
		//Подсистема.УчетПриложенийДоговоров
		
	Иначе
		ПФ.Вставить("ТекущийРеквизит",ИмяРеквизитаТабличнойЧасти);
		ПФ.Вставить("ТекущееЗначение",ТаблицаФормы.ТекущиеДанные[ИмяРеквизитаТабличнойЧасти]);
		ПФ.Вставить("ТекущееЗначениеДополнительное",Неопределено);
	КонецЕсли; 
	#КонецОбласти 
	
	ПФ.Вставить("ЦенаСНДС", Объект.ЦенаСНДС);

	// открываем диалог для выбора действия	
	ПОВ = Новый ОписаниеОповещения("ОбработатьГрупповоеРедактирование", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаГрупповогоРедактированияТЧ", ПФ, Этаформа,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОграничениеУслугНоменклатурыПоТабличнойЧасти()
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("ПорядокОтражения",ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты")) ;
	мСтроки = Объект.Услуги.НайтиСтроки(ОтборСтрок);
	
	ИспользуетсяОгранчиениеУслуг = ОграничиватьУслугиПоДоговорам;
	Если НеОграничиватьУслугиПоПеревыставлению и мСтроки.Количество() = 0 Тогда
		ИспользуетсяОгранчиениеУслуг = Ложь;	
	КонецЕсли;
	
	Возврат ИспользуетсяОгранчиениеУслуг;
	
КонецФункции


&НаСервере
Функция ПолучитьИмяРеквизитаТабличнойЧасти(ИмяРеквизитаФормы)
	
	ЭлементФрмы = Элементы.Найти(ИмяРеквизитаФормы);
	мПутьРеквизита = СтрРазделить(ЭлементФрмы.ПутьКДанным,".", Ложь);
	
	//Всегда реквизит табличной части, имя реквизита всегда по индексу 2
	Если мПутьРеквизита.Количество() <> 3 Тогда
		//Это не реквизит табичной части
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяРеквизита = мПутьРеквизита[2];
	
	МассивЗапрещенныхРеквизитов = ПолучитьМассивЗапрещенныхРеквизитов();
	Если МассивЗапрещенныхРеквизитов.Найти(ИмяРеквизита) <> Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЕстьРеквизитОбъекта	= ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизита, Метаданные.Документы.CW_РасходыПоГрузоперевозке.ТабличныеЧасти.Услуги);
	Если ЕстьРеквизитОбъекта Тогда
		Возврат ИмяРеквизита;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивЗапрещенныхРеквизитов()
	
	Массив = Новый Массив;
	
	Массив.Добавить("Представление_ДоКорректировки");
	Массив.Добавить("Количество_ДоКорректировки");
	Массив.Добавить("Цена_ДоКорректировки");
	Массив.Добавить("Сумма_ДоКорректировки");
	Массив.Добавить("СтавкаНДС_ДоКорректировки");
	Массив.Добавить("НДС_ДоКорректировки");
	Массив.Добавить("Всего_ДоКорректировки");
	
	Возврат Массив;
	
КонецФункции


&НаКлиенте
Процедура ОбработатьГрупповоеРедактирование(Ответ, ДопПар) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Ответ.Реквизит) Тогда
		Возврат;		
	Иначе	
		Реквизит = Ответ.Реквизит;
	КонецЕсли;
	
	Если Объект.Корректировка Тогда
		ТаблицаФормы = Элементы.УслугиКорректировка;
	Иначе
		ТаблицаФормы = Элементы.Услуги;
	КонецЕсли;

	
	мВС = ТаблицаФормы.ВыделенныеСтроки;
	КолСтр = мВС.Количество();
	Распределять = Ложь;
	Разница = 0;
	Если Ответ.Свойство("Распределить") Тогда
		Если Ответ.Распределить Тогда
			Распределять = Истина;
			Сумма = Окр(_сф.БезопасноРазделить(Ответ.Значение,КолСтр), 2,1);
			Разница = Ответ.Значение - Сумма * КолСтр;
		Иначе
			Сумма = Ответ.Значение;
		КонецЕсли;
	КонецЕсли;	
	
	Для Каждого ВСтр из мВС Цикл 
		Стр = Объект.Услуги.НайтиПоИдентификатору(ВСтр);
		
		Если Реквизит = "Номенклатура" Тогда
			Стр.Номенклатура = Ответ.Значение;
			_УслугиНоменклатураПриИзменении(ВСтр);
			
		ИначеЕсли Реквизит = "СтатьяЗатрат" Тогда
			
			Стр.СтатьяЗатрат = Ответ.Значение;
			
		ИначеЕсли Реквизит = "Подразделение" Тогда
			
			Стр.Подразделение = Ответ.Значение;
			
		ИначеЕсли Реквизит = "Грузоперевозка" Тогда
			
			Стр.Грузоперевозка = Ответ.Значение;
			_УслугиГрузоперевозкаПриИзменении(Стр.ПолучитьИдентификатор());
	
		ИначеЕсли Реквизит = "Способ учета НДС" Тогда
			
			Если Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты") 
				или Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы") Тогда
				Стр.СпособУчетаНДС = Ответ.Значение;
			КонецЕсли;
			
		ИначеЕсли Реквизит = "Порядок отражения" Тогда
			Стр.ПорядокОтражения = Ответ.Значение;
			ПриИзмененииУслугиПорядокОтражения(ВСтр)
		ИначеЕсли Реквизит = "Клиент / Договор" Тогда
			
			Если Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление")  
				ИЛИ Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам") 
				ИЛИ Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты") Тогда
				
				Стр.Покупатель 			= Ответ.Значение;
				Стр.ДоговорПокупателя 	= Ответ.Договор;
				
				//Подсистема.УчетПриложенийДоговоров
				Стр.УчетПриложенийПоДоговору	= Ответ.УчетПриложенийПоДоговору;
				Стр.ПриложениеКДоговору 		= Ответ.ПриложениеКДоговору;
				//Подсистема.УчетПриложенийДоговоров
			Иначе
				Стр.Покупатель 			= Неопределено;
				Стр.ДоговорПокупателя 	= Неопределено;
				
				//Подсистема.УчетПриложенийДоговоров
				Стр.УчетПриложенийПоДоговору = Ложь;
				Стр.ПриложениеКДоговору = Неопределено;
				//Подсистема.УчетПриложенийДоговоров
		КонецЕсли; 
		ИначеЕсли Реквизит = "Количество" Тогда
			Стр.Количество = Ответ.Значение;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС);
		ИначеЕсли Реквизит = "Цена" Тогда
			Стр.Цена = Сумма;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС);
		ИначеЕсли Реквизит = "Сумма" Тогда
			Стр.Сумма = Сумма;
			Стр.Цена = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
			Стр.НДС = CW_Финансы.РассчитатьСуммуНДС(Стр.Сумма, Истина, Ложь, Ставка);
			Стр.Всего = Стр.Сумма + Стр.НДС;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Ставка НДС" Тогда
			Стр.СтавкаНДС = Ответ.Значение;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС);
		ИначеЕсли Реквизит = "Сумма НДС" Тогда
			Стр.НДС = Сумма;
			Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
				Стр.Всего = Стр.Сумма + Стр.НДС;
			Иначе
				Стр.Сумма = Стр.Всего - Стр.НДС;
				Стр.Цена  = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			КонецЕсли;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Всего" Тогда
			Стр.Всего = Сумма;
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100;
			Стр.НДС   = Стр.Всего * Ставка / (1 + Ставка);
			Стр.Сумма = Стр.Всего - Стр.НДС;
			Стр.Цена  = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Представление" Тогда
			ДополнитьПредставление 	= Ложь;
			Если Ответ.Свойство("Дополнять") Тогда
				ДополнитьПредставление = Ответ.Дополнять;
			КонецЕсли;
			
			Если ДополнитьПредставление Тогда
				Стр.Представление = Стр.Представление + СокрП(Ответ.Значение);
			Иначе
				Стр.Представление = СокрЛП(Ответ.Значение);
			КонецЕсли;
		ИначеЕсли Реквизит = "ПрочиеРасходы" Тогда
			Стр.ПрочиеРасходы = Ответ.Значение;
		КонецЕсли;	
	КонецЦикла;	
	
	Если Распределять И Разница <> 0 Тогда
		Если Реквизит = "Цена" Тогда
			Стр.Цена = Сумма + Разница;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС);
		ИначеЕсли Реквизит = "Сумма" Тогда
			Стр.Сумма = Сумма + Разница;
			Стр.Цена = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
			Стр.НДС = CW_Финансы.РассчитатьСуммуНДС(Стр.Сумма, Истина, Ложь, Ставка);
			Стр.Всего = Стр.Сумма + Стр.НДС;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Сумма НДС" Тогда
			Стр.НДС = Сумма + Разница;
			Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
				Стр.Всего = Стр.Сумма + Стр.НДС;
			Иначе
				Стр.Сумма = Стр.Всего - Стр.НДС;
				Стр.Цена  = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			КонецЕсли;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Всего" Тогда
			Стр.Всего = Сумма + Разница;
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100;
			Стр.НДС   = Стр.Всего * Ставка / (1 + Ставка);
			Стр.Сумма = Стр.Всего - Стр.НДС;
			Стр.Цена  = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		КонецЕсли;	
	КонецЕсли;	
	
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры	
	
#КонецОбласти 

// ---------------------------------------------------------------------------- 
// ЗАЧЕТ АВАНСОВ
// ---------------------------------------------------------------------------- 

#Область ЗачетАвансов

&НаКлиенте
Процедура ЗачетАвансовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовПриИзменении(Элемент)
	ОбновитьИтогиПоАвансам();
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовОЗПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	ЗаполнитьАвансы(Команды.Найти("ЗаполнитьАвансы"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	ЗаполнитьАвансы(Команды.Найти("ЗаполнитьАвансы"));
	
КонецПроцедуры

&НаКлиенте
Процедура Авансы_Очистить(Команда)
	
	Если (Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов) Тогда
		Объект.ЗачетАвансов.Очистить();
	ИначеЕсли (Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ) Тогда 
		Объект.ЗачетАвансовОЗ.Очистить();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Авансы_Открыть(Команда)
	
	Если (Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов) Тогда
		Если Элементы.ЗачетАвансов.ТекущиеДанные <> Неопределено Тогда
			
			Попытка
				
				ПоказатьЗначение(,Элементы.ЗачетАвансов.ТекущиеДанные.ДокументАванса);
				
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			
		КонецЕсли; 
	ИначеЕсли (Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ) Тогда 
		Если Элементы.ЗачетАвансовОЗ.ТекущиеДанные <> Неопределено Тогда
			
			Попытка
				
				ПоказатьЗначение(,Элементы.ЗачетАвансовОЗ.ТекущиеДанные.ДокументАванса);
				
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбновитьИтогиПоАвансам()
	// --- 
	
	СВ = Строка(Объект.Валюта);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	Если Объект.ЗачетАвансов.Количество() = 0 Тогда
		ИтогоПоАвансам = "Нет зачтённых авансов";
	Иначе
		ИтогоПоАвансам=	"Зачтено:  "+Формат(Объект.ЗачетАвансов.Итог("СуммаЗачета"),ФЧ)+" "+СВ;
	КонецЕсли;
	Если Объект.ЗачетАвансов.Итог("СуммаЗачета") > Объект.Услуги.Итог("Всего") Тогда
		
		Элементы.ИтогоПоАвансам.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		
	Иначе
		
		Элементы.ИтогоПоАвансам.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		
	КонецЕсли; 
	// --- 
	Если Объект.ЗачетАвансовОЗ.Количество() = 0 Тогда
		ИтогоПоАвансамОЗ = "Нет зачтённых авансов";
	Иначе
		ИтогоПоАвансамОЗ =	"Зачтено:  "+Формат(Объект.ЗачетАвансовОЗ.Итог("СуммаЗачета"),ФЧ)+" "+СВ;
	КонецЕсли;
	Если Объект.ЗачетАвансовОЗ.Итог("СуммаЗачета") > Объект.Услуги.Итог("Всего") Тогда
		
		Элементы.ИтогоПоАвансамОЗ.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		
	Иначе
		
		Элементы.ИтогоПоАвансамОЗ.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ЗаполнениеАвансов

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	
	Если (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов) Тогда
		
		ПроверяемыйДокумент = Объект.ВедомыйДокумент;
		ТЧ = Объект.ЗачетАвансов;
		
	ИначеЕсли (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ) Тогда 
		
		ПроверяемыйДокумент = Объект.Ссылка; 
		ТЧ = Объект.ЗачетАвансовОЗ;
		
	КонецЕсли; 
	
	Если ПроверяемыйДокумент.Пустая() Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаОтветаЗаписиПриЗаполненииАвансов",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Документ не записан! Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьЗачетАвансов();
		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаЗаписиПриЗаполненииАвансов(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ВыполнитьЗачетАвансов();
	Иначе
		Возврат;
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗачетАвансов()
	// --- 
	
	Если (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов) Тогда
		
		ПроверяемыйДокумент = Объект.ВедомыйДокумент;
		ТЧ = Объект.ЗачетАвансов;
		
	ИначеЕсли (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ) Тогда 
		
		ПроверяемыйДокумент = Объект.Ссылка; 
		ТЧ = Объект.ЗачетАвансовОЗ;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	БУ = (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов);
	ОЗ = (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ);
	
	ПФ = _ПараметрыФормыПодбораАвансов(БУ, ОЗ);
	Если ПФ.Количество = 0 Тогда
		
		_УФК.ВывестиПредупреждение("Доступных авансов не найдено.");
		ТЧ.Очистить();
		Возврат;
		
	КонецЕсли; 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаЗаполненияАвансов",ЭтотОбъект, Новый Структура("БУ,ОЗ",БУ,ОЗ)); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаЗачетаАвансов",ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаполненияАвансов(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		_ЗагрузитьРезультатПодбораАванса(Ответ,ДополнительныеПараметры.БУ,ДополнительныеПараметры.ОЗ);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПараметрыФормыПодбораАвансов(БУ,ОЗ)
	// --- 
	
	ПФ = Новый Структура("Документ,ЗачетБУ,ЗачетОЗ,Валюта,СуммаСобственных,СуммаПеревыставляемых,ТаблицаАвансов,СчетАвансовПоСобственным,СчетАвансовПоПеревыставляемым,Количество,ОЗ,РаздельныйУчетЗаполженности");
	// ---------------------------------------------------------------------------- 
	ПФ.Документ = Документы.CW_РасходыПоГрузоперевозке.ПустаяСсылка();
	ПФ.ЗачетБУ = БУ;
	ПФ.ЗачетОЗ = ОЗ;
	ПФ.Валюта = Объект.Валюта;
	ПФ.РаздельныйУчетЗаполженности = РаздельныйУчетЗаполженности;
	// ---------------------------------------------------------------------------- 
	
	//Для версии КОРП
	Если ВестиУчетПоПодразделениям Тогда
		ПФ.Вставить("ВестиУчетПоПодразделениям"	, ВестиУчетПоПодразделениям);	
		ПФ.Вставить("ПодразделениеОрганизации"	, Объект.ПодразделениеОрганизации);	
	КонецЕсли;
	//Для версии КОРП
	
	ПараметрыТА 		= Новый Структура("Дата,Договор,ОЗ,РаздельныйУчетЗаполженности,Акт,ПереплатаКакАванс");
	ПараметрыТА.Договор = Объект.Договор;
	ПараметрыТА.ОЗ 		= ОперативныйУчет;
	ПараметрыТА.Акт 	= Объект.Ссылка;
	
	ПараметрыТА.РаздельныйУчетЗаполженности = РаздельныйУчетЗаполженности;
	ПараметрыТА.ПереплатаКакАванс 			= ПереплатаКакАванс;
	
	//Подсистема.УчетПриложенийДоговоров
	ПараметрыТА.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	//Для версии КОРП
	Если ВестиУчетПоПодразделениям Тогда
		ПараметрыТА.Вставить("ВестиУчетПоПодразделениям"	, ВестиУчетПоПодразделениям);	
		ПараметрыТА.Вставить("ПодразделениеОрганизации"		, Объект.ПодразделениеОрганизации);	
	КонецЕсли;
	//Для версии КОРП

	
	Услуги = Объект.Услуги.Выгрузить();
	Если (ОперативныйУчет) Тогда
		Если (НЕ Объект.СписокСчетов) Тогда
			Если (ЗначениеЗаполнено(Объект.Счет)) Тогда
				Услуги.ЗаполнитьЗначения(Объект.Счет,"Счет");
			Иначе
				Услуги.ЗаполнитьЗначения(Объект.Ссылка,"Счет");
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	// --- 
	
	Если (БУ) Тогда
		
		ДатаГраницы = ?(Объект.ФормироватьВедомыеДатойДокумента, Объект.Дата, Объект.ДатаАкта);
		ПараметрыТА.Дата = Новый Граница(ДатаГраницы,ВидГраницы.Исключая);
		Если ЗначениеЗаполнено(Объект.ВедомыйДокумент) Тогда
			ПараметрыТА.Дата = Объект.ВедомыйДокумент.МоментВремени();
		КонецЕсли;
		
		ТаблицаАвансов = CW_Финансы.ТаблицаАвансов(ПараметрыТА,Услуги,Объект.ЗачетАвансов.Выгрузить(), Объект.ЗачетАвансовОЗ.Выгрузить());
		
	ИначеЕсли (ОЗ) Тогда 
		
		ПараметрыТА.Дата = Новый Граница(Объект.ДатаСчета,ВидГраницы.Исключая);
		ТаблицаАвансов = CW_Финансы.ТаблицаАвансовДляОЗ(ПараметрыТА,Услуги,Объект.ЗачетАвансовОЗ.Выгрузить());
		
	КонецЕсли; 
	
	// --- 
	Услуги.Свернуть("ПорядокОтражения", "Всего"); 
	ПФ.СуммаСобственных = _сф.Итог(Услуги,"Всего");
	ПФ.СуммаПеревыставляемых = 0;
	
	// счета расчета по возмещаемым
	// --- 
	Счет_Рубли = _ДС().УП.СчетРасчетов_Поставщики_Рубли;
	Счет_Валюта = _ДС().УП.СчетРасчетов_Поставщики_Валюта;
	Счет_УЕ = _ДС().УП.СчетРасчетов_Поставщики_УЕ;
	// --- 
	ВРУ = _ДС().КО.ВалютаРегламентированногоУчета;
	// --- 
	Счета = CW_Конфигурация.ПланСчетов();
	
	// определяем счета
	Если Объект.Валюта=ВРУ Тогда
		// --- 
		ПФ.СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданным;
		Если Счет_Рубли=Счета.РасчетыСПоставщиками Тогда
			ПФ.СчетАвансовПоПеревыставляемым = Счета.РасчетыПоАвансамВыданным;
		Иначе
			ПФ.СчетАвансовПоПеревыставляемым = Счет_Рубли;
		КонецЕсли;
		// --- 
	Иначе
		Если Объект.Договор.ВзаиморасчетыВУЕ Тогда
			// --- 
			ПФ.СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданнымУЕ;
			Если Счет_УЕ = Счета.РасчетыСПоставщикамиУЕ Тогда
				ПФ.СчетАвансовПоПеревыставляемым = Счета.РасчетыПоАвансамВыданнымУЕ;
			Иначе
				ПФ.СчетАвансовПоПеревыставляемым = Счет_УЕ;
			КонецЕсли; 
			// --- 
		Иначе 
			// --- 
			ПФ.СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданнымВал;
			Если Счет_Валюта = Счета.РасчетыСПоставщикамиВал Тогда
				ПФ.СчетАвансовПоПеревыставляемым = Счета.РасчетыПоАвансамВыданнымВал;
			Иначе
				ПФ.СчетАвансовПоПеревыставляемым = Счет_Валюта;
			КонецЕсли; 
			// --- 
		КонецЕсли;	
	КонецЕсли; 
	
	
	ПФ.ТаблицаАвансов = ПоместитьВоВременноеХранилище(ТаблицаАвансов,ЭтаФорма.УникальныйИдентификатор);
	ПФ.Количество = ТаблицаАвансов.Количество();
	// --- 
	ПФ.ОЗ = _ДС().УП.ОЗ;

	Возврат(ПФ);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ЗагрузитьРезультатПодбораАванса(Адрес,БУ,ОЗ)
	// --- 
	
	Попытка
		
		Если (БУ) Тогда
			Объект.ЗачетАвансов.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
		ИначеЕсли (ОЗ) Тогда 
			Объект.ЗачетАвансовОЗ.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
		КонецЕсли; 
		
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 


#Область ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ

&НаКлиенте
Процедура ЗаполнитьПлатёжноРасчётныеДокументы(Команда)
	
	Если НЕ Объект.Проведен Тогда 
		ПоказатьПредупреждение(Неопределено, "Чтобы автоматически заполнить список платёжно-расчётных документов"
		                                     "по счёта-фактуре документ должен быть проведён!");
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = ПредопределенноеЗначение("Перечисление.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.ПоДокументу") Тогда 
		ПоказатьПредупреждение(Неопределено, "Ручное заполнение платёжно-расчётных длкументов для счёта-фактуры доступно, если выбрать порядок заполнения ""По документу""");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда
		оо = Новый ОписаниеОповещения("ОбработкаВопросаЗаписи_ЗаполнитьПлатёжноРасчётныеДокументы", ЭтотОбъект); 
		ПоказатьВопрос(оо,"Документ был изменён. Записать?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьПлатёжноРасчётныеДокументыПродолжение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписи_ЗаполнитьПлатёжноРасчётныеДокументы(Ответ, ДополнительныеПараметры) Экспорт 

	Если Ответ=КодВозвратаДиалога.Да Тогда
		Записать();
		ЗаполнитьПлатёжноРасчётныеДокументыПродолжение();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлатёжноРасчётныеДокументыПродолжение()
	
	_ЗаполнитьПлатёжноРасчётныеДокументыНаСервере();
	
	Если Объект.ПлатёжноРасчётныеДокументы.Количество() = 0 Тогда 
		ПоказатьПредупреждение(Неопределено, "Зачтенных авансов по документам ""Списание с расчетного счета"" не обнаружено!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьПлатёжноРасчётныеДокументыНаСервере()

	Ответ = Документы.CW_РасходыПоГрузоперевозке.ПолучитьТаблицу_ПлатёжноРасчётныеДокументы_дляСФ(Объект.Ссылка);
	Если Ответ.Код = 0 Тогда
		Объект.ПлатёжноРасчётныеДокументы.Загрузить(Ответ.ПлатёжноРасчётныеДокументы);
		_УправлениеЭлементамиФормы();
	Иначе 
		Сообщить(Ответ.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


// ---------------------------------------------------------------------------- 
// АКТЫ
// ---------------------------------------------------------------------------- 

#Область Акты

Процедура ОбновитьИтогиПоАктированию()
	
	СВ = Строка(Объект.Валюта);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	
	ИтогоПоАктам = 	"Всего: "+Формат(ТаблицаАктов.Итог("Всего"),ФЧ)+" "+СВ;
	НеАктировано = Объект.Услуги.Итог("Всего")-ТаблицаАктов.Итог("Всего");
	Если НеАктировано <> 0 Тогда
		ИтогоПоАктам = ИтогоПоАктам + ";  Не актировано: "+Формат(НеАктировано,ФЧ)+" "+СВ;
		//Элементы.ИтогоПоАктам.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
	Иначе
		//Элементы.ИтогоПоАктам.ЦветТекста = ЦветаСтиля.ЦветТекстаКнопки;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Акты_Обновить(Команда)
	
	_ОбновитьАкты();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьАкты()
	
	Если НЕ Объект.ПредъявленСчет Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_АктированиеВходящихСчетовОбороты.Регистратор КАК Акт,
	               |	CW_АктированиеВходящихСчетовОбороты.ВсегоРасход КАК Всего,
	               |	ВЫБОР
	               |		КОГДА CW_АктированиеВходящихСчетовОбороты.Регистратор ССЫЛКА Документ.CW_РасходыПоГрузоперевозке
	               |			ТОГДА ВЫБОР
	               |					КОГДА CW_АктированиеВходящихСчетовОбороты.Регистратор.ПредъявленАкт
	               |						ТОГДА CW_АктированиеВходящихСчетовОбороты.Регистратор.НомерАкта
	               |					ИНАЧЕ CW_АктированиеВходящихСчетовОбороты.Регистратор.НомерСФ
	               |				КОНЕЦ
	               |		ИНАЧЕ CW_АктированиеВходящихСчетовОбороты.Регистратор.Номер
	               |	КОНЕЦ КАК Номер,
	               |	ВЫБОР
	               |		КОГДА CW_АктированиеВходящихСчетовОбороты.Регистратор ССЫЛКА Документ.CW_РасходыПоГрузоперевозке
	               |			ТОГДА ВЫБОР
	               |					КОГДА CW_АктированиеВходящихСчетовОбороты.Регистратор.ПредъявленАкт
	               |						ТОГДА CW_АктированиеВходящихСчетовОбороты.Регистратор.ДатаАкта
	               |					ИНАЧЕ CW_АктированиеВходящихСчетовОбороты.Регистратор.ДатаСФ
	               |				КОНЕЦ
	               |		ИНАЧЕ CW_АктированиеВходящихСчетовОбороты.Регистратор.Дата
	               |	КОНЕЦ КАК Дата,
	               |	ЕСТЬNULL(CW_АктированиеВходящихСчетовОбороты.Регистратор.Корректировка, ИСТИНА) КАК ЭтоАктКорректировка,
	               |	ЕСТЬNULL(CW_АктированиеВходящихСчетовОбороты.Регистратор.ПредъявленАкт, ЛОЖЬ) КАК ПредъявленАкт
	               |ИЗ
	               |	РегистрНакопления.CW_АктированиеВходящихСчетов.Обороты(, , Регистратор, Счет = &Счет) КАК CW_АктированиеВходящихСчетовОбороты
	               |ГДЕ
	               |	CW_АктированиеВходящихСчетовОбороты.Регистратор <> &Счет
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_АктированиеВходящихСчетовОбороты.Период
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Счет", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаАктов.Очистить();
	МассиивАктов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаАктов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		
		Если ТипЗнч(Выборка.Акт) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда 
			Префикс	 = ?(Выборка.ЭтоАктКорректировка, "(К)","");
			Название = ?(Выборка.ПредъявленАкт, "Акт", "С/ф");	
		Иначе
			Префикс = "";
			Название = Выборка.Акт.Метаданные().Синоним;
		КонецЕсли;
		
		ШаблонПредставления = "%1 №%2 %3 от %4";
		НоваяСтрока.Представление = СтрШаблон(ШаблонПредставления,Название, Строка(Выборка.Номер),Префикс,Формат(Выборка.Дата,"ДФ=dd.MM.yyyy"));

		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассиивАктов, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Выборка.Акт), Истина);
		
	КонецЦикла;
	
	КоличествоАктов = МассиивАктов.Количество();
	Элементы.СтраницаАкты.Заголовок = "Акты"+?(КоличествоАктов=0,""," ("+Строка(КоличествоАктов)+")");
	
КонецПроцедуры


&НаКлиенте
Процедура Акты_Открыть(Команда)
	
	 ОткрытьАкт();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАктовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьАкт();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАкт()
	// --- 
	
	Попытка
		
		ПоказатьЗначение(,Элементы.ТаблицаАктов.ТекущиеДанные.Акт);
		
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки;
	
	// --- 
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// КОМАНДЫ
// ---------------------------------------------------------------------------- 

#Область ВводНаОсновании

&НаКлиенте
Процедура ДиалогВводаНаОсновании() Экспорт 
	// --- 
	
	ПоказатьДиалогВводаНаОсновании();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ПоказатьДиалогВводаНаОсновании()
	// --- 
	
	ПОВ_ОтказОткрытия = Новый ОписаниеОповещения("ЗакрытьФорму",ЭтотОбъект);
	ПОВ = Новый ОписаниеОповещения("ОбработкаРезультатаВводаНаОсновании",ЭтотОбъект, Новый Структура("ПОВ_ОтказОткрытия",ПОВ_ОтказОткрытия)); 
	ПФ = Новый Структура("Основание",ДокументОснование);
	ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.Форма.ФормаВводаНаОснованииУправляемая",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаРезультатаВводаНаОсновании(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Отказ = Ложь;
	Если (Ответ = Неопределено) Тогда
		
		Отказ = Истина;
		
	Иначе
		
		Результат = _ОбработатьВводНаОсновании(Ответ); 
		
		// по заявке AFR-250448
		Для Каждого СтрокаУслуг из Объект.Услуги Цикл  
			ИдентификаторСтроки = СтрокаУслуг.ПолучитьИдентификатор();
			ПриИзмененииУслугиПорядокОтражения(ИдентификаторСтроки);
		КонецЦикла;
		//---- по заявке AFR-250448		
		
		Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
			
			Отказ = Истина;
			
		Иначе
			
			_ИнициализацияФормы();
			
			#Область Динамический_вывод_дополнительных_колонок
			
			//Обновляем динамические колонки параметров ГП
			Если Объект.Услуги.Количество() > 0 Тогда
				_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
			КонецЕсли;
			
			#КонецОбласти
		
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если (Отказ) Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ_ОтказОткрытия);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ОбработатьВводНаОсновании(Знач Ответ)
	// --- 
	
	ЭтаФорма.Модифицированность=Истина;
	Объект.Дата = Ответ.Дата;
	Объект.Контрагент = Ответ.Контрагент;
	Объект.Договор = Ответ.Договор;
	Объект.Организация = Объект.Договор.Организация;
	Объект.Валюта = Объект.Договор.ВалютаДоговора;
	
	//Подсистема.УчетПриложенийДоговоров
	Объект.ПриложениеКДоговору = Ответ.ПриложениеКДоговору;
	//Подсистема.УчетПриложенийДоговоров
	
	//Для версии КОРП
	Если ВестиУчетПоПодразделениям Тогда
		Объект.ПодразделениеОрганизации = Ответ.Основание.ПодразделениеОрганизации;
	КонецЕсли;
	//Для версии КОРП
	
	ОтображатьКомментарийДоговора = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОтображатьКомментарийДоговораВФормеВводаДокументовПоБюджету");
	УстановитьЗаголовокНадписиКомментарияДоговора();
	
	// --- 
	_СформироватьОбщиеПараметры();
	// --- 
	
	РасчитатьСрокОплатыДокумента();
	
	Объект.СпособЗачетаАвансовОЗ = _ДС().ПД.ПорядокЗачетаАвансовОЗ;
	Объект.СпособЗачетаАвансов = _ДС().ПД.ПорядокЗачетаАвансов;
	
	// --- 
	
	Объект.ПредъявленСчет = Ответ.Основание.ФормируетсяСчет;
	//Объект.НомерСчета = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация,Номер", Ответ.Основание.Организация,Ответ.Основание.НомерСчета));
	Объект.НомерСчета = CW_Документы.ПолучитьНомерНаПечать(Ответ.Основание, "НомерСчета", "ДатаСчета");
	ОБъект.ДатаСчета = Ответ.Основание.ДатаСчета;
	// --- 
	Объект.ПредъявленАкт = Ответ.Основание.ФормируетсяАкт;
	//Объект.НомерАкта = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация,Номер", Ответ.Основание.Организация,Ответ.Основание.НомерАкта));
	Объект.НомерАкта = CW_Документы.ПолучитьНомерНаПечать(Ответ.Основание, "НомерАкта", "ДатаАкта");
	ОБъект.ДатаАкта = Ответ.Основание.ДатаАкта;
	// --- 
	Объект.ПредъявленСФ = Ответ.Основание.ФормируетсяСчетФактура;
	//Объект.НомерСФ = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация,Номер", Ответ.Основание.Организация,Ответ.Основание.НомерСчетаФактуры));
	Объект.НомерСФ = CW_Документы.ПолучитьНомерНаПечать(Ответ.Основание, "НомерСчетаФактуры", "ДатаСчетаФактуры");
	ОБъект.ДатаСФ = Ответ.Основание.ДатаСчетаФактуры;
	
	// --- 
	
	ПорядокОтражения = Ответ.ПорядокОтражения;
	Если (НЕ ЗначениеЗаполнено(ПорядокОтражения)) Тогда
		ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление;
	КонецЕсли; 
	ДатаИсточника = ДокументОснование.Дата;
	ВалютаИсточника = ДокументОснование.Валюта;
	
	НачальнаяДатаДокумента  = Объект.Дата;
	ВзаиморасчетыВУЕ		= Объект.Договор.ВзаиморасчетыВУЕ;	
	
	СостояниеДокумента 		= ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	// --- 
	
	//
	Ответ = Документы.CW_РасходыПоГрузоперевозке.Услуги_СформироватьПоДокументуДоходов(ДокументОснование,Объект.Договор);
	Если Ответ.Код <> 0 Тогда
		
		Возврат(_УФКС.Ответ(1));
		
	Иначе
		
		Объект.Продавец = Ответ.Продавец;
		ТаблицаУслуг = Ответ.ТаблицаУслуг; // в валюте и рублях
		
		// анализируем
		ПересчетЧерезРубли = Ложь;
		// если валюта документов одинаковая
		Если (ВалютаИсточника = Объект.Валюта) Тогда
			
			// если рубли
			Если (Объект.Валюта = _ДС().КО.ВалютаРегламентированногоУчета) Тогда
				
				ПересчетЧерезРубли = Ложь;
				
			Иначе
				
				// проверяем даты документов и порядок отражения
				Если (ПорядокОтражения=Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам) Тогда
					
					ПересчетЧерезРубли = Ложь;
					
				ИначеЕсли (ПорядокОтражения=Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление) Тогда 
					
					// проверяем даты
					Если (НачалоДня(Объект.Дата)=НачалоДня(ДатаИсточника)) Тогда
						
						ПересчетЧерезРубли = Ложь;
						
					Иначе
						
						ПересчетЧерезРубли = Истина;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		Иначе
			
			ПересчетЧерезРубли = Истина;
			
		КонецЕсли; 
		
		Если (ПересчетЧерезРубли) Тогда
			
			СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,Объект.Дата);
			Документы.CW_РасходыПоГрузоперевозке.Услуги_ПересчитатьИзВалютыРегламентированногоУчета(ТаблицаУслуг,СК);
			
		КонецЕсли; 
		
		ТаблицаУслуг.Колонки.Удалить(ТаблицаУслуг.Колонки.Найти("ПорядокОтражения"));
		ТаблицаУслуг.Колонки.Добавить("ПорядокОтражения");
		ТаблицаУслуг.ЗаполнитьЗначения(ПорядокОтражения,"ПорядокОтражения");
		Если ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты
			ИЛИ ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление
			ИЛИ ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам Тогда
			
			Если ДокументОснование.Организация = Объект.Организация Тогда
				ТаблицаУслуг.Колонки.Добавить("Покупатель");
				ТаблицаУслуг.Колонки.Добавить("ДоговорПокупателя");
				
				ТаблицаУслуг.ЗаполнитьЗначения(ДокументОснование.Контрагент,"Покупатель");
				ТаблицаУслуг.ЗаполнитьЗначения(ДокументОснование.Договор,"ДоговорПокупателя");
				
				//Подсистема.УчетПриложенийДоговоров
				ТаблицаУслуг.Колонки.Добавить("ПриложениеКДоговору");
				ТаблицаУслуг.ЗаполнитьЗначения(ДокументОснование.ПриложениеКДоговору,"ПриложениеКДоговору");
				//Подсистема.УчетПриложенийДоговоров
			Иначе
				ТаблицаУслуг.Колонки.Добавить("Покупатель");
				ТаблицаУслуг.Колонки.Добавить("ДоговорПокупателя");
				ТаблицаУслуг.Колонки.Добавить("ПриложениеКДоговору");
				ТаблицаУслуг.Колонки.Добавить("УчетПриложенийПоДоговору");
				
				Для Каждого СтрокаТекущая из ТаблицаУслуг Цикл
					
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("Организация", 		Объект.Организация);
					СтруктураПараметров.Вставить("Контрагент", 			СтрокаТекущая.Грузоперевозка.Клиент);
					СтруктураПараметров.Вставить("Объект", 				СтрокаТекущая.Грузоперевозка);
					СтруктураПараметров.Вставить("ЭтоВариантБюджета", 	ЛОЖЬ);
					СтруктураПараметров.Вставить("УчетПриложений", 		ЛОЖЬ);
					
					СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
					
					Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
						СтрокаТекущая.Покупатель 		 = СтруктураДанныхСтроки.Покупатель;
					КонецЕсли;
					Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
						СтрокаТекущая.ДоговорПокупателя  = СтруктураДанныхСтроки.ДоговорПокупателя;
					КонецЕсли;
					Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
						СтрокаТекущая.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
					КонецЕсли;
					Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
						СтрокаТекущая.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли; 
		
		//	// --- 
		Объект.Услуги.Загрузить(ТаблицаУслуг);
		
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());

		Возврат(_УФКС.Ответ());
		
	КонецЕсли; 
	//
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму(Ответ,ДополнительныеПараметры) Экспорт
	// --- 
	
	Закрыть();
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ПодборГрузоперевозок 

&НаКлиенте
Процедура Подбор(Команда)
	
	Если Объект.Валюта.Пустая() Тогда
		
		_УФК.ВывестиПредупреждение("Не указана валюта документа");
		Возврат;
		
	КонецЕсли; 
	
	// формируем параметры
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодбора",ЭтотОбъект);
	ПФ = _ПараметрыФормыПодбора();
	ОткрытьФорму("ОбщаяФорма.CW_ФормаПодбора",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбора(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		_ОбработатьПодбор(Результат);
		
		//подсистема.Бюджетирование
		Если CW_Бюджетирование.ВедетсяУчетСтатейБюджетаВДокументах() Тогда
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПолученияСтатейБюджета", ЭтотОбъект); 
			CW_БюджетированиеКлиент.ЗаполнитьСтатьиБюджетаПослеподбора(ЭтаФорма, ОповещениеОЗавершении);	
		КонецЕсли;
		//подсистема.Бюджетирование
		
		ДобавитьЗависимуюУслугу();
		
		// обновим итоги табличных частей на форме
		ОбновитьИтогиПоУслугам();
		ЗаполнитьДополнительныеКолонкиТабличнойЧасти();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗависимуюУслугу()
	
	//Проверим и при необходимости добавим дополнительную услугу
	CW_Подписки.ДобавитьДополнительнуюУслугу(Объект);
	
КонецПроцедуры


&НаСервере
Функция _ПараметрыФормыПодбора()
	// --- 
	
	ДатаДокумента = Объект.Дата;
	Если Объект.ПредъявленАкт 
		И ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
		ДатаДокумента = Объект.ДатаАкта;  
	ИначеЕсли Объект.ПредъявленСчет  
		И ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
		ДатаДокумента = Объект.ДатаСчета;  
	КонецЕсли;

	ДатаДокумента = ?(ДатаДокумента = Дата(1,1,1), ТекущаяДата(), ДатаДокумента);
	
	ПФ = Новый Структура("Договор,Валюта,ТипДокумента,Грузоперевозки,РаздельныйУчетВходящегоНДС,ГруппировкаЗатратПоПодразделениям,ДатаДокумента");
	// --- 
	ПФ.Договор 			= Объект.Договор;
	ПФ.ДатаДокумента 	= ДатаДокумента;
	ПФ.Валюта 			= Объект.Валюта;
	ПФ.ТипДокумента 	= РеквизитФормыВЗначение("Объект").Метаданные().Имя;
	
	//Подсистема.УчетПриложенийДоговоров
	ПФ.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	// --- 
	Попытка
		РаздельныйУчетВходящегоНДС = _ДС().УП.РаздельныйУчетНДСНаСчете19;	
	Исключение
	    РаздельныйУчетВходящегоНДС = Ложь;
	КонецПопытки; 
	ПФ.РаздельныйУчетВходящегоНДС = (РаздельныйУчетВходящегоНДС И CW_ПраваДоступа.ПравоДоступно("РедактированиеСпособаУчетаНДС"));
	// --- 
	Попытка
		ГруппировкаЗатратПоПодразделениям = _ДС().УП.ГруппировкаЗатратПоПодразделениям;
	Исключение
	    ГруппировкаЗатратПоПодразделениям = Ложь;
	КонецПопытки; 
	ПФ.ГруппировкаЗатратПоПодразделениям = ГруппировкаЗатратПоПодразделениям;
	// --- 
	ПФ.Грузоперевозки = _сф.м_СоздатьИзКолонкиТЗ(Объект.Услуги.Выгрузить(),"Грузоперевозка");
	// --- 
	Возврат(ПФ);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ОбработатьПодбор(Результат)
		// --- 
	ТребоватьЗаполненияПокупателя = _ДС().ПД.ТребоватьЗаполненияПокупателяДляПорядокаОтраженияЗатратыВРасходах;
	
	Если Результат.Вариант = "Грузоперевозка" Тогда
		
		Нстр = Объект.Услуги.Добавить();
		Нстр.Грузоперевозка = Результат.Грузоперевозка;
		Нстр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		Нстр.Количество = 1;
		
		Если Объект.Корректировка Тогда
			Нстр.ЭтоДобавленнаяСтрока = Истина;
		КонецЕсли;
		
		Если ТребоватьЗаполненияПокупателя Тогда
			СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(Нстр.ПолучитьИдентификатор());
			СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
			
			Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
				Нстр.Покупатель 		 = СтруктураДанныхСтроки.Покупатель;
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
				Нстр.ДоговорПокупателя 	 = СтруктураДанныхСтроки.ДоговорПокупателя;
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
				Нстр.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
				Нстр.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
			КонецЕсли;
		КонецЕсли;
		
		// --- 
		_ПодставитьПодразделение(Нстр);
		// --- 
		ОбновитьИтогиПоУслугам();
		ЗаполнитьДополнительныеКолонкиТабличнойЧасти();
		
	ИначеЕсли Результат.Вариант = "Бюджет" Тогда
		
		Если (Результат.Свойство("КомментарийЗаполнения")) Тогда
			Сообщить(Результат.КомментарийЗаполнения); 
		КонецЕсли; 
		ТЗУслуг = ПолучитьИзВременногоХранилища(Результат.Строки);
		Если (Результат.ПерезаполнитьДокумент) Тогда
			Объект.Услуги.Очистить();
		КонецЕсли; 
		
		Для каждого Стр Из ТЗУслуг Цикл
			
			Нстр = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,Стр);
			
			Если Объект.ЦенаСНДС Тогда 
				Если Нстр.Количество = 0 Тогда
					Нстр.Цена = 0;	
				Иначе
					Нстр.Цена = Нстр.Всего / Нстр.Количество;
				КонецЕсли;
			КонецЕсли;

			// заполнение покупателя и договора
			СтрокаТЧ = Нстр;
			
			Если СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда
				Если ТребоватьЗаполненияПокупателя Тогда
					СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(СтрокаТЧ.ПолучитьИдентификатор());
					СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
					
					Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
						СтрокаТЧ.Покупатель 		 = СтруктураДанныхСтроки.Покупатель;
					КонецЕсли;
					Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
						СтрокаТЧ.ДоговорПокупателя 	 = СтруктураДанныхСтроки.ДоговорПокупателя;
					КонецЕсли;
					Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
						СтрокаТЧ.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
					КонецЕсли;
					Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
						СтрокаТЧ.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
					КонецЕсли;
				КонецЕсли;
			Иначе
				СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(СтрокаТЧ.ПолучитьИдентификатор());
				СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
				
				Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
					СтрокаТЧ.Покупатель 		 = СтруктураДанныхСтроки.Покупатель;
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
					СтрокаТЧ.ДоговорПокупателя 	 = СтруктураДанныхСтроки.ДоговорПокупателя;
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
					СтрокаТЧ.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
					СтрокаТЧ.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) И (СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты ИЛИ СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.ПустаяСсылка()) Тогда	
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Дата"					, Объект.Дата);
				СтруктураПараметров.Вставить("Организация"			, Объект.Организация);
				СтруктураПараметров.Вставить("Номенклатура"			, СтрокаТЧ.Номенклатура);
				СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа);
				
				СтрокаТЧ.СпособУчетаНДС = CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров);
				
			КонецЕсли; 
			// --- 
			_ПодставитьПодразделение(СтрокаТЧ);
			// --- 
			
		КонецЦикла;
		// --- 
		ОбновитьИтогиПоУслугам();
		ЗаполнитьДополнительныеКолонкиТабличнойЧасти();
		
	ИначеЕсли Результат.Вариант = "ГрузоперевозкиИНоменклатура" Тогда
		
		ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре();
		СН = Результат.СтруктураНоменклатуры;
		
		// определяем вариант представления
		// 0 - получаем шаблон
		// 1 - используем полученный шаблон
		
		// определяем вариант суммы
		// 0 - по цене номенклатуры
		// 1 - фиксированное значение
		// 2 - фиксированное значение цены
		// для фиксированных значений необходимо прочитать саму сумму и признак того, что сумма с НДС
		
		// режим распределения суммы
		// 0 - на все г/п
		// 1 - на каждую г/п
		// 2 - пропорционально параметру
		// 3 - пропорционально выручке
		
		// порядок получения количества
		// 0 - из параметра грузоперевозки
		// 1 - фиксированная сумма
		
		СуммаУслуги = 0;
		РазделитьКоличествоУслугНаКоличествоГрузоперевозок 	= _сф.ст_ПолучитьСвойство(СН,"РазделитьКоличествоУслугНаКоличествоГрузоперевозок");
		РаспределитьКоличествоПророрциональноПараметру 		= _сф.ст_ПолучитьСвойство(СН,"РаспределитьКоличествоПророрциональноПараметру");
		ПорядокПолученияКоличества 							= _сф.ст_ПолучитьСвойство(СН,"ПорядокПолученияКоличества");
		
		Если ПорядокПолученияКоличества = 1 Тогда
			Количество = _сф.ст_ПолучитьСвойство(СН,"Количество");
			Если (Количество = Неопределено) Тогда
				Количество = 1;
			КонецЕсли;
		Иначе
			
			Если РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки тогда
				
				//получаем количество из параметров ГП
				КоличествоПоГрузоперевозкам = Новый Соответствие;
				Для каждого Грузоперевозка Из Результат.Грузоперевозки Цикл
					
					//Получаем количество из Параметра
					ЗначениеПараметра   = 0;
					СтруктураПараметров = Новый Структура("ТипПеревозки,Номенклатура,ЕдиницаИзмерения", Грузоперевозка.ТипПеревозки,СН.Номенклатура,СН.Номенклатура.ЕдиницаИзмерения);		
					НайденныйПараметр 	= CW_Документы.ПолучитьПараметрДляПодстановкиЗначенияВКоличество(СтруктураПараметров);
					
					Если НайденныйПараметр <> Неопределено Тогда
						//Получаем только первое значение
						СтрокаПараметраГП = Грузоперевозка.ПараметрыГрузоперевозки.Найти(НайденныйПараметр, "Параметр");
						
						Если СтрокаПараметраГП <> Неопределено Тогда
							ЗначениеПараметра = СтрокаПараметраГП.Значение;
						КонецЕсли;
						
					КонецЕсли;	
					
					Если Не УстановитьЗначениеНольЗначениеПараметраНеУстановлено и Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
						ЗначениеПараметра = 1;
					КонецЕсли;
					
					КоличествоПоГрузоперевозкам.Вставить(Грузоперевозка,ЗначениеПараметра);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОбратныйПересчет = Ложь;
		Если НЕ ЗначениеЗаполнено(СН.СтавкаНДС) Тогда
			
			СуммаУслуги = 0;
			
		Иначе
			
			Если СН.ВариантОпределенияСуммы =1 Тогда
				
				СуммаУслуги 		= СН.Всего;
				ОбратныйПересчет 	= СН.СуммаВключаетНДС;
				
			ИначеЕсли СН.ВариантОпределенияСуммы = 2 Тогда
				
				ЦенаУслуги 			= СН.Цена;
				ОбратныйПересчет 	= СН.ЦенаВключаетНДС; 
				
			ИначеЕсли Не ИспользуетсяОгранчиениеУслуг Тогда
				
				// получаем сумму из типа цены
				ТипЦен = _ДС().ПД.ТипЦен;
				Если НЕ ТипЦен.Пустая() Тогда
					
					СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,_ДатаВозникновенияЗадолженности());
					Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СН.Номенклатура, ТипЦен, _ДатаВозникновенияЗадолженности(), Объект.Валюта, СК.Курс,СК.Кратность);
					ОбратныйПересчет = ТипЦен.ЦенаВключаетНДС;
					СуммаУслуги = Цена*Количество;
					
				Иначе
					
					ОбратныйПересчет = Ложь;
					СуммаУслуги = 0;
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли; 
		
		// пропорционально выручке
		Если (СуммаУслуги <> 0 И СН.ВариантРаспределения = 3) Тогда
			
			Грузоперевозки = Результат.Грузоперевозки;
			ОпределениеВыручки = _сф.ст_ПолучитьСвойство(СН,"ОпределениеВыручки");
			УчитыватьСуммыНеактированныхСчетов = _сф.ст_ПолучитьСвойство(СН,"УчитыватьСуммыНеактированныхСчетов");
			// --- 
			
			// по счетам
			Если (ОпределениеВыручки = 0) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка,
				|	CW_ДоходыПоГрузоперевозкам.Всего
				|ИЗ
				|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
				|ГДЕ
				|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяСчет = ИСТИНА
				|	И CW_ДоходыПоГрузоперевозкам.Грузоперевозка В(&Грузоперевозки)";
				Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозки);
				ТЗ = Запрос.Выполнить().Выгрузить();
				ТЗ.Свернуть("Грузоперевозка","Всего");
				
			КонецЕсли; 
			
			// по актам
			Если (ОпределениеВыручки = 1) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка,
				|	CW_ДоходыПоГрузоперевозкам.Всего
				|ИЗ
				|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
				|ГДЕ
				|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяАкт = ИСТИНА
				|	И CW_ДоходыПоГрузоперевозкам.Грузоперевозка В(&Грузоперевозки)";
				Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозки);
				ТЗ = Запрос.Выполнить().Выгрузить();
				ТЗ.Свернуть("Грузоперевозка","Всего");
				
				Если (УчитыватьСуммыНеактированныхСчетов) Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					|	CW_АктированиеИсходящихСчетов.Грузоперевозка,
					|	CW_АктированиеИсходящихСчетов.Валюта,
					|	CW_АктированиеИсходящихСчетов.Счет.ДатаСчета КАК ДатаСчета,
					|	ВЫБОР
					|		КОГДА CW_АктированиеИсходящихСчетов.ВидДвижения = &Приход
					|			ТОГДА CW_АктированиеИсходящихСчетов.Всего
					|		ИНАЧЕ -CW_АктированиеИсходящихСчетов.Всего
					|	КОНЕЦ КАК Всего_Валюта,
					|	0 КАК Всего
					|ИЗ
					|	РегистрНакопления.CW_АктированиеИсходящихСчетов КАК CW_АктированиеИсходящихСчетов
					|ГДЕ
					|	CW_АктированиеИсходящихСчетов.Грузоперевозка В(&Грузоперевозки)";
					Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозки);
					ТЗ2 = Запрос.Выполнить().Выгрузить();
					ТЗ2.Свернуть("Грузоперевозка,Валюта","Всего_Валюта,Всего");
					Для каждого Стр Из ТЗ2 Цикл
						
						Если (ТЗ2.Всего_Валюта > 0) Тогда
							
							КВ = CW_Финансы.ПолучитьКурсВалюты(Стр.Валюта,Стр.ДатаСчета);
							Стр.Всего = CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Всего_Валюта,Стр.Валюта,CW_Настройки.ВалютаРегламентированногоУчета(),КВ.Курс,1,КВ.Кратность,1); 
							// --- 
							Отбор = Новый Структура("Грузоперевозка",Стр.Грузоперевозка);
							СтрокаГП = _сф.к_НайтиСтроку(ТЗ,Отбор);
							Если (СтрокаГП <> Неопределено) Тогда
								
								_сф.Инкремент(СтрокаГП.Всего,Стр.Всего);
								
							КонецЕсли; 
							
						КонецЕсли; 
						
					КонецЦикла; 
					// --- 
					
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			БазаРаспределенияПоВыручке = ТЗ.Итог("Всего");
			СоответствиеВыручки = _сф.со_Создать("Грузоперевозка","Всего",ТЗ);
			// --- 
			ОстатокРаспределения = СуммаУслуги;
			
		КонецЕсли;	
		
		// распределение по параметру
		Если (СуммаУслуги <> 0 И СН.ВариантРаспределения = 2) Тогда 
			
			// считаем общую сумму 
			ТР = _сф.т_Создать("Грузоперевозка,Значение");
			Для каждого Грузоперевозка Из Результат.Грузоперевозки Цикл
				
				СтруктураЗначения = РегистрыСведений.CW_ХарактеристикиГрузоперевозок.ПолучитьЗначениеПараметра(Грузоперевозка, СН.ПараметрРаспределения);
				
				Значение = 0;
				Если ТипЗнч(СтруктураЗначения.Значение) = Тип("Число") Тогда
					Значение = СтруктураЗначения.Значение;
				КонецЕсли;
				
				Нстр 				= ТР.Добавить();
				Нстр.Грузоперевозка = Грузоперевозка;
				Нстр.Значение 		= Значение;
				
			КонецЦикла; 
			
			БазаРаспределенияПоПараметру = _сф.Итог(ТР,"Значение");
			СоответствиеЗначенийПараметра = _сф.со_Создать("Грузоперевозка","Значение",ТР);
			
			Если БазаРаспределенияПоПараметру = 0 Тогда
				
				СуммаУслуги = 0;
				
			КонецЕсли; 
			
		КонецЕсли;
		
		// проверяем вариант распределения
		Если СН.ВариантРаспределения = 0 ИЛИ СН.ВариантРаспределения = 2 Тогда
			
			ОстатокРаспределения = СуммаУслуги;
			
		КонецЕсли; 
		
		Ставка = CW_Финансы.ПолучитьСтавкуНДС(СН.СтавкаНДС);
		
		// ЗАПОЛНЯЕМ
		// ---------------------------------------------------------------------------- 
		Индекс=0;
		Для каждого Грузоперевозка Из Результат.Грузоперевозки Цикл
			
			_сф.Инкремент(Индекс);
			
			Нстр = Объект.Услуги.Добавить();
			Нстр.Грузоперевозка 	= Грузоперевозка;
			Нстр.Номенклатура 		= СН.Номенклатура;
			Нстр.СтатьяЗатрат 		= СН.СтатьяЗатрат;
			Нстр.ПорядокОтражения 	= СН.ПорядокОтраженияРасходов;
			Нстр.СтавкаНДС 			= СН.СтавкаНДС;
			
			Нстр.СпособУчетаНДС		= СН.СпособУчетаНДС;
			
			Если Объект.Корректировка Тогда
				Нстр.ЭтоДобавленнаяСтрока = Истина;
			КонецЕсли;
			
			// --- 
			Если ПорядокПолученияКоличества = 0 Тогда
				Количество = КоличествоПоГрузоперевозкам.Получить(Грузоперевозка);
				//ВРЕМЕННО УДАЛЕНО
				//Если Количество = 0 Тогда
				//	Сообщение = новый СообщениеПользователю;
				//	Сообщение.Текст = "По грузоперевозке "+Строка(Грузоперевозка)+" не удалось получить количество услуги!";
				//	Сообщение.ПутьКДанным  = "Объект";
				//	Сообщение.Поле    = "Услуги["+Нстр.ПолучитьИдентификатор()+"].Количество";
				//	Сообщение.Сообщить();
				//конецЕсли;
			КонецЕсли;
			
			Нстр.Количество = Количество;
			Если СН.ВариантОпределенияСуммы = 2 Тогда  
				
				Если ОбратныйПересчет Тогда
					Нстр.Всего 	= ЦенаУслуги * Количество;
					Нстр.НДС 	= Нстр.Всего*(Ставка/(100+Ставка));
					Нстр.Сумма 	= Нстр.Всего - Нстр.НДС;
					Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма, Нстр.Количество);
				Иначе
					Нстр.Цена 	= ЦенаУслуги; 
					Нстр.Сумма 	= ЦенаУслуги * Количество;
					Нстр.НДС 	= Нстр.Сумма * (Ставка/100);
					Нстр.Всего 	= Нстр.Сумма + Нстр.НДС;
				КонецЕсли; 			
				
				ПересчитатьСтрокуНаСерере(Нстр.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
				
			ИначеЕсли ИспользуетсяОгранчиениеУслуг и СН.ВариантОпределенияСуммы = 0  Тогда
				
				Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда 
					
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("АдресУслугПоДоговору"						, АдресУслугПоДоговору);
					СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтГруза"		, УстанавливатьЦенуВЗависимостиОтГруза);
					СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтКлиента"	, УстанавливатьЦенуВЗависимостиОтКлиента);
					
					СтруктураПараметров.Вставить("Номенклатура"							, СН.Номенклатура);
					Если УстанавливатьЦенуВЗависимостиОтГруза Тогда
						СтруктураПараметров.Вставить("Груз" , Грузоперевозка.Груз);
					КонецЕсли;
					Если УстанавливатьЦенуВЗависимостиОтКлиента тогда
						
						СтруктураПараметровКлиента = Новый Структура;
						СтруктураПараметровКлиента.Вставить("Объект"				, Грузоперевозка);
						СтруктураПараметровКлиента.Вставить("ЭтоВариантБюджета"		, Ложь);
						СтруктураПараметровКлиента.Вставить("Контрагент"			, Грузоперевозка.Клиент);
						
						тПокупатель = CW_Финансы.ВернутьПлательщика(СтруктураПараметровКлиента);
						
						СтруктураПараметров.Вставить("Клиент", тПокупатель);
					КонецЕсли;
					
					УслугаДоговора = _УФС.ПолучитьУслугуДоговораПоПараметрам(СтруктураПараметров);	
					
					Если УслугаДоговора <> Неопределено Тогда 				   
						
						Если ЗначениеЗаполнено(УслугаДоговора.ПорядокОтражения) Тогда
							Нстр.ПорядокОтражения = УслугаДоговора.ПорядокОтражения;
						КонецЕсли;
						
						Сумма		= УслугаДоговора.ЦенаБезНДС * Количество;
						Если ЗначениеЗаполнено(УслугаДоговора.СтавкаНДС)  Тогда
							НДС = Сумма * CW_Финансы.ПолучитьСтавкуНДС(УслугаДоговора.СтавкаНДС)/100;
						Иначе
							НДС = 0;
						КонецЕсли; 
						
						Нстр.СтавкаНДС 	= УслугаДоговора.СтавкаНДС;
						Нстр.Цена 		= УслугаДоговора.ЦенаБезНДС;
						
						Если УслугаДоговора.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДССверху тогда
							Нстр.Сумма 			= УслугаДоговора.ЦенаБезНДС * Количество;
							ОбратныйПересчет 	= Ложь;
						Иначе //в сумме
							Нстр.Всего 			= УслугаДоговора.Цена * Количество;
							ОбратныйПересчет 	= Истина;
						КонецЕсли;
						
						Ставка = CW_Финансы.ПолучитьСтавкуНДС(УслугаДоговора.СтавкаНДС);
						
						Если ОбратныйПересчет Тогда
							
							Нстр.НДС 	= Нстр.Всего*(Ставка/(100+Ставка));
							Нстр.Сумма 	= Нстр.Всего - Нстр.НДС;
							Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
							
						Иначе
							
							Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
							Нстр.НДС 	= Нстр.Сумма*(Ставка/100);
							Нстр.Всего 	= Нстр.Сумма+Нстр.НДС;
							
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЕсли; 
				
				
			Иначе
				// --- 
				
				Если (СуммаУслуги <> 0) Тогда
					// --- 
					
					// на каждую г/п
					Если СН.ВариантРаспределения = 1 Тогда
						
						Если ОбратныйПересчет Тогда
							
							Нстр.Всего = СуммаУслуги;
							
						Иначе
							
							Нстр.Сумма = СуммаУслуги;
							
						КонецЕсли; 
						
						Если (РазделитьКоличествоУслугНаКоличествоГрузоперевозок) Тогда
							
							Нстр.Количество = Количество/Результат.Грузоперевозки.Количество();
							
						КонецЕсли; 
						
						// на все г/п
					ИначеЕсли СН.ВариантРаспределения = 0 Тогда 
						
						Если ОбратныйПересчет Тогда
							
							Нстр.Всего = СуммаУслуги/Результат.Грузоперевозки.Количество();
							_сф.Декремент(ОстатокРаспределения,Нстр.Всего);
							
						Иначе
							
							Нстр.Сумма = СуммаУслуги/Результат.Грузоперевозки.Количество();
							_сф.Декремент(ОстатокРаспределения,Нстр.Сумма);
							
						КонецЕсли; 
						
						Если (РазделитьКоличествоУслугНаКоличествоГрузоперевозок) Тогда
							
							Нстр.Количество = Количество/Результат.Грузоперевозки.Количество();
							
						КонецЕсли;
						
						Если Результат.Грузоперевозки.Количество()=Индекс Тогда
							
							_сф.Инкремент(?(ОбратныйПересчет,Нстр.Всего,Нстр.Сумма),ОстатокРаспределения);
							
						КонецЕсли; 
						
						// по параметру
					ИначеЕсли СН.ВариантРаспределения = 2 Тогда 
						
						Если ОбратныйПересчет Тогда
							
							Нстр.Всего = СуммаУслуги*СоответствиеЗначенийПараметра.Получить(Грузоперевозка)/БазаРаспределенияПоПараметру;
							_сф.Декремент(ОстатокРаспределения,Нстр.Всего);
							
						Иначе
							
							Нстр.Сумма = СуммаУслуги*СоответствиеЗначенийПараметра.Получить(Грузоперевозка)/БазаРаспределенияПоПараметру;
							_сф.Декремент(ОстатокРаспределения,Нстр.Сумма);
							
						КонецЕсли; 
						
						Если (РаспределитьКоличествоПророрциональноПараметру) Тогда
							
							Нстр.Количество = Количество*СоответствиеЗначенийПараметра.Получить(Грузоперевозка)/БазаРаспределенияПоПараметру;
							
						КонецЕсли; 
						
						Если Результат.Грузоперевозки.Количество()=Индекс Тогда
							
							_сф.Инкремент(?(ОбратныйПересчет,Нстр.Всего,Нстр.Сумма),ОстатокРаспределения);
							
						КонецЕсли; 
						
						// по выручке
					ИначеЕсли (СН.ВариантРаспределения = 3) Тогда 
						
						ВыручкаПоГрузоперевозке = СоответствиеВыручки.Получить(Грузоперевозка);
						Если (ВыручкаПоГрузоперевозке = Неопределено) Тогда
							Продолжить;
						КонецЕсли; 
						Если (ВыручкаПоГрузоперевозке = 0) Тогда
							Продолжить;
						КонецЕсли; 
						
						Если ОбратныйПересчет Тогда
							
							Нстр.Всего = СуммаУслуги*СоответствиеВыручки.Получить(Грузоперевозка)/БазаРаспределенияПоВыручке;
							_сф.Декремент(ОстатокРаспределения,Нстр.Всего);
							
						Иначе
							
							Нстр.Сумма = СуммаУслуги*СоответствиеВыручки.Получить(Грузоперевозка)/БазаРаспределенияПоВыручке;
							_сф.Декремент(ОстатокРаспределения,Нстр.Сумма);
							
						КонецЕсли; 
						
						Если Результат.Грузоперевозки.Количество()=Индекс Тогда
							
							_сф.Инкремент(?(ОбратныйПересчет,Нстр.Всего,Нстр.Сумма),ОстатокРаспределения);
							
						КонецЕсли; 
						
					КонецЕсли; 
					
					Если ОбратныйПересчет Тогда
						
						Нстр.НДС 	= Нстр.Всего*(Ставка/(100+Ставка));
						Нстр.Сумма 	= Нстр.Всего - Нстр.НДС;
						Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
						
					Иначе
						
						Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
						Нстр.НДС 	= Нстр.Сумма*(Ставка/100);
						Нстр.Всего 	= Нстр.Сумма+Нстр.НДС;
						
					КонецЕсли; 
					
					ПересчитатьСтрокуНаСерере(Нстр.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
					
				КонецЕсли; 
			КонецЕсли;
			
			// ---------------------------------------------------------------------------- 
			
			// устанавливаем представление
			Если СН.ВариантПредставления = 0 Тогда
				
				ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
				
				ПараметрыШаблона.Номенклатура 	= Нстр.Номенклатура;
				ПараметрыШаблона.Объект 		= Объект;
				ПараметрыШаблона.Дата 			= Объект.Дата;
				ПараметрыШаблона.Договор 		= Объект.Договор;
				ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
				ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
				
				CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(Нстр, ПараметрыШаблона); 
				
			Иначе
				
				Представление = СН.Представление;
				Если Найти(Представление,"%")  <> 0 Тогда
					
					// это шаблон
					Нстр.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(Представление,Объект,Нстр);
					
				Иначе
					
					Нстр.Представление = Представление;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			// заполнение покупателя и договора
			СтрокаТЧ = Нстр;
			
			Если СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда
				// --- 
				_ПодставитьПодразделение(СтрокаТЧ);	
				
				Если ТребоватьЗаполненияПокупателя Тогда
					СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(СтрокаТЧ.ПолучитьИдентификатор());
					СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
					
					Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
						СтрокаТЧ.Покупатель 		 = СтруктураДанныхСтроки.Покупатель;
					КонецЕсли;
					Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
						СтрокаТЧ.ДоговорПокупателя 	 = СтруктураДанныхСтроки.ДоговорПокупателя;
					КонецЕсли;
					Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
						СтрокаТЧ.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
					КонецЕсли;
					Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
						СтрокаТЧ.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(СтрокаТЧ.ПолучитьИдентификатор());
				СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
				
				Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
					СтрокаТЧ.Покупатель 		 = СтруктураДанныхСтроки.Покупатель;
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
					СтрокаТЧ.ДоговорПокупателя 	 = СтруктураДанныхСтроки.ДоговорПокупателя;
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
					СтрокаТЧ.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
				КонецЕсли;
				Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
					СтрокаТЧ.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
				КонецЕсли;
				
			КонецЕсли; 
			
			Если (ЗначениеЗаполнено(СН.Подразделение)) Тогда
				
				СтрокаТЧ.Подразделение = СН.Подразделение;
				
			Иначе
				
				_ПодставитьПодразделение(СтрокаТЧ);
				
			КонецЕсли; 
			
			// --- 
			
		КонецЦикла; 
		// --- 
		ОбновитьИтогиПоУслугам();
		ЗаполнитьДополнительныеКолонкиТабличнойЧасти();
		
		
		#Область Динамический_вывод_дополнительных_колонок
		
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
		
		#КонецОбласти			
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры 

#КонецОбласти 

#Область УдалениеВедомых 

&НаКлиенте
Процедура ВедомыйСчет_Удалить(Команда)
	
	УдалитьВедомый("Счет");	
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомыйСчетКорректировочный_Удалить(Команда)
	
	УдалитьВедомый("СчетКорректировочный");	
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомыйДокумент_Удалить(Команда)
	// --- 
	
	УдалитьВедомый("Документ");	
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВедомыйСчетФактура_Удалить(Команда)
	
	УдалитьВедомый("СчетФактура");
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура УдалитьВедомый(ВидВедомого)
	// --- 
	
	//Если (ЭтаФорма.Модифицированность) Тогда
	//	
	//	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаЗаписиДляУдаленияВедомых",ЭтотОбъект, Новый Структура("ВидВедомого",ВидВедомого)); 
	//	ПоказатьВопрос(ПОВ,"Документ необходимо записать. 
	//				   |Продолжить?", РежимДиалогаВопрос.ДаНет); 
	//				   
	//Иначе
	//	
	//	ВыполнитьУдалениеВедомого(ВидВедомого);
	//	
	//КонецЕсли; 
	
	ВыполнитьУдалениеВедомого(ВидВедомого);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписиДляУдаленияВедомых(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ=КодВозвратаДиалога.Да) Тогда
		
		Записать();
		ВыполнитьУдалениеВедомого(ДополнительныеПараметры.ВидВедомого)
		
	КонецЕсли;
		
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУдалениеВедомого(ВидВедомого)
	// --- 
	
	Если (ВидВедомого = "Документ") Тогда 
		
		ТекстВопроса = "Ведомый документ поступления будет отвязан и помечен на удаление. 
				   |Продолжить?";
				   
	ИначеЕсли (ВидВедомого = "СчетФактура") Тогда 
		
		ТекстВопроса = "Ведомый счёт-фактура поступления будет отвязан и помечен на удаление.
				   |Продолжить?";
				   
	ИначеЕсли (ВидВедомого = "Счет") или ВидВедомого = "СчетКорректировочный" Тогда 
		
		ТекстВопроса = "Ведомый счёт поступления будет отвязан и помечен на удаление.
				   |Продолжить?";
		
	КонецЕсли; 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУдаленияВедомых",ЭтотОбъект, Новый Структура("ВидВедомого",ВидВедомого)); 
	ПоказатьВопрос(ПОВ,ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУдаленияВедомых(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		
		ВыполнитьНепосредственноеУдалениеВедомых(ДополнительныеПараметры.ВидВедомого);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ВыполнитьНепосредственноеУдалениеВедомых(ВидВедомого)
	// --- 
	
	Если (ВидВедомого = "Счет") Тогда
		
		Ответ = _УдалитьВедомыйСчет();
		
	ИначеЕсли (ВидВедомого = "СчетКорректировочны") Тогда 
		
		Ответ = _УдалитьВедомыйСчетКорректировочный();
		
	ИначеЕсли (ВидВедомого = "Документ") Тогда 
		
		Ответ = _УдалитьВедомый();
		
	ИначеЕсли (ВидВедомого = "СчетФактура") Тогда 
		
		Ответ = _УдалитьВедомыйСчетФактуру();
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

// --- 
&НаСервере
Функция _УдалитьВедомыйСчет()
	// --- 
	
	Если (НЕ Объект.ВедомыйСчет.ПометкаУдаления) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ведомый = Объект.ВедомыйСчет.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);	
	КонецЕсли; 
	// --- 
	Объект.ВедомыйСчет = Неопределено;
	
	// --- 
КонецФункции

&НаСервере
Функция _УдалитьВедомыйСчетКорректировочный()
	// --- 
	
	Если (НЕ Объект.ВедомыйСчетКорректировочный.ПометкаУдаления) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ведомый = Объект.ВедомыйСчетКорректировочный.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);	
	КонецЕсли; 
	// --- 
	Объект.ВедомыйСчетКорректировочный = Неопределено;
	
	// --- 
КонецФункции

&НаСервере
Функция _УдалитьВедомый()
	// --- 
	
	Если (НЕ Объект.ВедомыйДокумент.ПометкаУдаления) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ведомый = Объект.ВедомыйДокумент.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);	
	КонецЕсли;
	// --- 
	Объект.ВедомыйДокумент = Неопределено;
	Объект.ВедомыйСчетФактура = Неопределено;
	
	// --- 
КонецФункции

&НаСервере
Функция _УдалитьВедомыйСчетФактуру()
	// --- 
	
	Если (НЕ Объект.ВедомыйСчетФактура.ПометкаУдаления) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ведомый = Объект.ВедомыйСчетФактура.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);	
	КонецЕсли;
	// --- 
	Объект.ВедомыйСчетФактура = Неопределено;
	
	// --- 
КонецФункции

#КонецОбласти 

#Область ОтображениеШапки 

&НаКлиенте
Процедура ОтображениеШапки(Команда)
	
	_ОтображениеШапки(); 
	
КонецПроцедуры

&НаСервере
Процедура _ОтображениеШапки()
	// --- 
	
	Элементы.ГруппаШапка.Видимость = (НЕ Элементы.ГруппаШапка.Видимость);
	Элементы.ОтображениеШапкиУслуги.Заголовок = ?(Элементы.ГруппаШапка.Видимость," Развернуть"," Свернуть");
	Элементы.ОтображениеШапкиУслугиКорректировка.Заголовок = ?(Элементы.ГруппаШапка.Видимость," Развернуть"," Свернуть");
	Элементы.ОтображениеШапкиУслуги.Картинка = ?(Элементы.ГруппаШапка.Видимость,БиблиотекаКартинок.CW_Развернуть,БиблиотекаКартинок.CW_Свернуть);
	Элементы.ОтображениеШапкиУслугиКорректировка.Картинка = ?(Элементы.ГруппаШапка.Видимость,БиблиотекаКартинок.CW_Развернуть,БиблиотекаКартинок.CW_Свернуть);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ПроверкаПоБюджету 

&НаКлиенте
Процедура ПроверитьДокументПоБюджету(Команда)
	
	Если (ЭтаФорма.Модифицированность) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаЗаписиДляПроверкиПоБюджету",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Документ был изменён. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьПроверкуПоБюджету();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписиДляПроверкиПоБюджету(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ=КодВозвратаДиалога.Да) Тогда
		
		Записать();
		ВыполнитьПроверкуПоБюджету();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ВыполнитьПроверкуПоБюджету()
	// --- 
	
	ОткрытьФорму("Отчет.CW_ПроверкаДокументаПоступленияПоБюджету.Форма.ФормаОтчета",_сф.ст_Создать("Документ:Ссылка",Объект.Ссылка));
	
	// --- 
КонецПроцедуры


#КонецОбласти 

#Область ОчисткаТабличнойЧасти

&НаКлиенте
Процедура ОчиститьТабличнуюЧастьУслуг(Команда)
	
	Если Объект.Услуги.Количество() <> 0 Тогда 
		
		массВидимыхСтрок = Новый Массив;
		массСкрытыхСтрок = Новый Массив;
		Для Каждого строкаУслуги Из Объект.Услуги Цикл
			Если Элементы.Услуги.ПроверитьСтроку(строкаУслуги.ПолучитьИдентификатор()) Тогда 
				массВидимыхСтрок.Добавить(строкаУслуги);
			Иначе 
				массСкрытыхСтрок.Добавить(строкаУслуги);
			КонецЕсли;
		КонецЦикла;
		
		Если массВидимыхСтрок.Количество() = Объект.Услуги.Количество() Тогда 
			
			// нет отбора
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиУслугДляОчистки",ЭтотОбъект); 
			ПоказатьВопрос(ПОВ,"Очистить табличную часть Услуги?", РежимДиалогаВопрос.ОКОтмена);
			
		Иначе 
			
			// установлен какой-то отбор
			сз = Новый СписокЗначений;
			сз.Добавить("Все", "Очистить - все строки ("+Объект.Услуги.Количество()+")");
			сз.Добавить("Видимые", "С учетом отбора - видимые ("+массВидимыхСтрок.Количество()+")");
			сз.Добавить("Скрытые", "С учетом отбора - скрытые ("+массСкрытыхСтрок.Количество()+")");
			ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВариантаОчистки",ЭтотОбъект, Новый Структура("массВидимыхСтрок,массСкрытыхСтрок",массВидимыхСтрок,массСкрытыхСтрок)); 
			СЗ.ПоказатьВыборЭлемента(ПОВ,"РежимОчистки");
			
		КонецЕсли;
		
	Иначе 
		
		_УФК.ВывестиПредупреждение("Табличная часть ""Услуги"" уже пустая.");
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОчисткиУслугДляОчистки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.ОК) Тогда
		
		Объект.Услуги.Очистить();
		ОбновитьИтогиПоУслугам();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ОбработкаВыбораВариантаОчистки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда 
		
		Если Ответ.Значение = "Все" Тогда 
			
			Объект.Услуги.Очистить();
			ОбновитьИтогиПоУслугам();
			
		ИначеЕсли Ответ.Значение = "Видимые" Тогда 
			
			Для Каждого строкаУслуги Из ДополнительныеПараметры.массВидимыхСтрок Цикл
				Объект.Услуги.Удалить(строкаУслуги);
			КонецЦикла;
			ОбновитьИтогиПоУслугам();
			_УФК.ВывестиПредупреждение("Отключите отбор, чтобы увидеть, что осталось.");
			
		ИначеЕсли Ответ.Значение = "Скрытые" Тогда 
			
			Для Каждого строкаУслуги Из ДополнительныеПараметры.массСкрытыхСтрок Цикл
				Объект.Услуги.Удалить(строкаУслуги);
			КонецЦикла;
			ОбновитьИтогиПоУслугам();
			_УФК.ВывестиПредупреждение("Невидимые строки удалены.");
			
		КонецЕсли;
		
	КонецЕсли;
			
	// --- 
КонецПроцедуры
  

#КонецОбласти 

#Область УстановкаСальдоВзаиморасчетов 

&НаКлиенте
Процедура УстановитьСальдоВзаиморасчетовБУ(Команда)
	Объект.СальдоВзаиморасчетовБУ = Объект.Услуги.Итог("Всего");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСальдоВзаиморасчетовОУ(Команда)
	Объект.СальдоВзаиморасчетовОЗ = Объект.Услуги.Итог("Всего");
КонецПроцедуры

#КонецОбласти 

#Область АвтоматическийПодборСчетов 

&НаКлиенте
Процедура АвтоматическийПодборСчетов()
	// --- 
	
	Если (Объект.Проведен) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОтменыПроведения",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Автоматический подбор счетов возможен только для непроведённого документа. Отменить проведение?",РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьАвтоматическийПодборСчетов();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОтменыПроведения(ОтветПользователя, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПользователя = КодВозвратаДиалога.Да) Тогда
		
		Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.ОтменаПроведения));
		ВыполнитьАвтоматическийПодборСчетов();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ВыполнитьАвтоматическийПодборСчетов()
	// --- 
	
	// показываем форму выбора даты подбора
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВариантаПодбора",ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДатыПодбораСчетов",,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВариантаПодбора(ВариантВыбораДатыПодбора, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВариантВыбораДатыПодбора <> Неопределено) Тогда
		
		Результат = _ВыполнитьПодборСчетов(ВариантВыбораДатыПодбора);
		Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
			
			ОбновитьНомераДокументовНаСервере();
			_УправлениеЭлементамиФормы();
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Результат));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ВыполнитьПодборСчетов(ВариантПодбора)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");

	Ответ = ДокументОбъект.АвтоматическийПодборСчетов(ВариантПодбора); 
	
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");    
	
	Возврат(Ответ);
	
КонецФункции
 
#КонецОбласти 

#Область ЗаполнениеПоДокументу

&НаКлиенте
Процедура ЗаполнитьПоДокументуПоставщика(Команда)
	
	СтруктураОтбора = Новый Структура("Договор",Объект.Договор);
							
	СтруктураПараметровВыбора = Новый Структура;
	СтруктураПараметровВыбора.Вставить("РежимВыбора", 			Истина);
	СтруктураПараметровВыбора.Вставить("МножественныйВыбор", 	Истина);
	СтруктураПараметровВыбора.Вставить("Отбор", 				СтруктураОтбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораДокументаДляЗаполнения",ЭтотОбъект); 
	
	ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаВыбора",СтруктураПараметровВыбора,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДокументаДляЗаполнения(РезультатВыбора, ДополнительныеПараметры) Экспорт 

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаВыбораДокументаДляЗаполненияНаСервере(РезультатВыбора);
	
КонецПроцедуры  

&НаСервере
Процедура ОбработкаВыбораДокументаДляЗаполненияНаСервере(РезультатВыбора)
	
	Для Каждого ДокументСсылка из РезультатВыбора Цикл
		ДобавитьСтрокиДокумента(ДокументСсылка);
	КонецЦикла; 
	
	ЗаполнитьДополнительныеКолонкиТабличнойЧасти();
	ОбновитьНомераДокументовНаСервере();
	_УправлениеЭлементамиФормы();
	
	#Область Динамический_вывод_дополнительных_колонок
	
	_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиДокумента(Документ)
	
	ЗаполнятьАктируемыйСчет = (Документ.ПредъявленСчет И НЕ Документ.ПредъявленАкт) 
		И (Объект.ПредъявленАкт И НЕ Объект.ПредъявленСчет);
	
	Если ЗаполнятьАктируемыйСчет 
		и НЕ Объект.СписокСчетов Тогда
		Объект.СписокСчетов = Истина;
		Если ЗначениеЗаполнено(Объект.Счет) Тогда
			Для каждого СтрокаУслуг Из Объект.Услуги Цикл
				СтрокаУслуг.Счет = Объект.Счет;		
			КонецЦикла; 	
		КонецЕсли; 
	КонецЕсли; 

	Для каждого СтрокаДокумента Из Документ.Услуги Цикл
		
		НоваяСтрока = Объект.Услуги.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
		
		Если ЗаполнятьАктируемыйСчет Тогда
			НоваяСтрока.Счет = Документ;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда 
			НоваяСтрока.Подразделение = ПодразделениеПользователя;
		КонецЕсли;
		
	КонецЦикла; 

	
КонецПроцедуры
 
#КонецОбласти 

#Область МножественноеРедактирование

&НаКлиенте
Процедура УслугиПередНачаломИзменения(Элемент, Отказ)
	
	Если (НЕ ЭтаФорма.ТолькоПросмотр) Тогда
		
		Если (Элементы.Услуги.ВыделенныеСтроки.Количество() > 1) Тогда
			
			Если (Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиСпособУчетаНДС ИЛИ
				Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиПодразделение) Тогда
				
				Отказ = Истина;
				// --- 
				МножественноеРедактирование();
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура МножественноеРедактирование()
	// --- 
	
	Если (Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиСпособУчетаНДС) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораМножественногоЗначения",ЭтотОбъект, Новый Структура("Реквизит","СпособУчетаНДС")); 
		ОткрытьФорму("Перечисление.СпособыУчетаНДС.ФормаВыбора",,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли (Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиПодразделение) Тогда 
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораМножественногоЗначения",ЭтотОбъект, Новый Структура("Реквизит","Подразделение")); 
		ОткрытьФорму("Справочник.ПодразделенияОрганизаций.ФормаВыбора",,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораМножественногоЗначения(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		_ПроизвестиМножественноеРедактирование(Ответ, ДополнительныеПараметры.Реквизит);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПроизвестиМножественноеРедактирование(Значение, Реквизит)
	// --- 
	
	Для каждого Стр Из Элементы.Услуги.ВыделенныеСтроки Цикл
		
		СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Стр);
		// --- 
		Если (Реквизит = "Подразделение") Тогда
			
			Если (СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
				СтрокаТЧ[Реквизит] = Значение;		
			КонецЕсли; 
			
		ИначеЕсли (Реквизит = "СпособУчетаНДС") Тогда 
			
			Если (СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
				СтрокаТЧ[Реквизит] = Значение;		
			КонецЕсли;  
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецФункции

#КонецОбласти 



Процедура ЗаполнитьДополнительныеКолонкиТабличнойЧасти()
	
	ИспользютсяФинансовыеСтатусы 		= ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок");
	
	СвойстваГрузоперевозок = ПолучитьДанныеПоГрузоперевозокам();
	
	Для каждого СтрокаТаблицы Из Объект.Услуги Цикл
		
		Если Объект.Корректировка Тогда
			СтрокаТаблицы.НадписьПередКорректировкой 	= "до корректировки";
			СтрокаТаблицы.НадписьДоКорректировки 		= "до изменения";
			СтрокаТаблицы.НадписьПослеКорректировки 	= "после изменения";
		КонецЕсли;
		
		СтруктураСвойств = СвойстваГрузоперевозок.Получить(СтрокаТаблицы.Грузоперевозка);
		Если СтруктураСвойств <> Неопределено Тогда
			
			СтруктураСвойств.Свойство("ПометкаУдаления", 	СтрокаТаблицы.ГрузоперевозкаУдалена);
			
			Если ИспользютсяФинансовыеСтатусы Тогда
				СтруктураСвойств.Свойство("КартинкаФинансовыйСтатус",	СтрокаТаблицы.КартинкаФинансовыйСтатус);
			КонецЕсли;
		
			Если СтруктураСвойств.Свойство("Заблокирована") Тогда
				Если СтруктураСвойств.Заблокирована Тогда
					СтрокаТаблицы.БлокГП = АдресЗамок;
				Иначе
					СтрокаТаблицы.БлокГП = Неопределено;
				КонецЕсли;
			КонецЕсли;
			
		Конецесли;
		 
		СтрокаТаблицы.УчетПриложенийПоДоговору = CW_УчетПриложенийДоговоровСервер.ПолучитьПризнакУчетаПриложенийПоДоговору(СтрокаТаблицы.ДоговорПокупателя);
		
	КонецЦикла; 
	
КонецПроцедуры
// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КурсВалютыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораКурса",ЭтотОбъект, Новый Структура()); 
	ПФ = Новый Структура("ПользовательскийКурс,Курс,Кратность,ДатаКурса,Валюта,РасчетыВУЕ",Объект.УЕ_ПользовательскийКурс,Объект.УЕ_Курс,Объект.УЕ_Кратность,_ДатаКурса(),Объект.Валюта,ВзаиморасчетыВУЕ);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаКурсаДляУсловныхЕдиниц",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКурса(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Объект.УЕ_ПользовательскийКурс = Ответ.ПользовательскийКурс;
		Если (Объект.УЕ_ПользовательскийКурс) Тогда
			Объект.УЕ_Курс = Ответ.Курс;
			Объект.УЕ_Кратность = Ответ.Кратность;
		Иначе
			Объект.УЕ_Курс = 1;
			Объект.УЕ_Кратность = 1;
		КонецЕсли;
		// --- 
		_СформироватьКурс();
				
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#Область Корректировки

&НаКлиенте
Процедура УслугиКорректировкаКоличествоПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.УслугиКорректировка.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаЦенаПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.УслугиКорректировка.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаСуммаПриИзменении(Элемент)
	
	_УслугиСуммаПриИзменении(Элементы.УслугиКорректировка.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.УслугиКорректировка.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаНДСПриИзменении(Элемент)
	
	ТД = Элементы.УслугиКорректировка.ТекущиеДанные;
	
	Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
		ТД.Всего = ТД.Сумма + ТД.НДС;
	Иначе
		ТД.Сумма = ТД.Всего - ТД.НДС;
		ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	КонецЕсли;
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаВсегоПриИзменении(Элемент)
	
	ТД = Элементы.УслугиКорректировка.ТекущиеДанные;
	
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
	ТД.НДС = ТД.Всего*Ставка/(1+Ставка);
	ТД.Сумма = ТД.Всего - ТД.НДС;
	ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПерезаполнитьПоКорректируемомуДокументу(Команда)
	
	_ПерезаполнитьПоКорректируемомуДокументу();
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры

&НаСервере
Процедура _ПерезаполнитьПоКорректируемомуДокументу()
	// --- 
	
	ЗаполнитьЗначенияСвойств(Объект,Объект.КорректируемыйДокумент,"Организация,Контрагент,Договор,Валюта,Продавец,ПредъявленСФ");
	// ---
	Объект.Услуги.Загрузить(Объект.КорректируемыйДокумент.Услуги.Выгрузить());
	Для каждого Стр Из Объект.Услуги Цикл
		
		Стр.Представление_ДоКорректировки 	= Стр.Представление;
		Стр.Количество_ДоКорректировки 		= Стр.Количество;
		Стр.Цена_ДоКорректировки 			= Стр.Цена;
		Стр.Сумма_ДоКорректировки 			= Стр.Сумма;
		Стр.СтавкаНДС_ДоКорректировки 		= Стр.СтавкаНДС;
		Стр.НДС_ДоКорректировки 			= Стр.НДС;
		Стр.Всего_ДоКорректировки 			= Стр.Всего;     
		
		Если Объект.ПоказатьРубли Тогда
			Стр.Цена_ДоКорректировкиРег		= Стр.ЦенаРег;
			Стр.Сумма_ДоКорректировкиРег	= Стр.Суммарег;
			Стр.Цена_ДоКорректировкиРег		= Стр.НДСРег;
			Стр.Всего_ДоКорректировкиРег	= Стр.ВсегоРег;     
		КонецЕсли;
		
		Стр.Покупатель_ДоКорректировки 			= Стр.Покупатель;
		Стр.ДоговорПокупателя_ДоКорректировки 	= Стр.ДоговорПокупателя;
		Стр.ПриложениеКДоговору_ДоКорректировки = Стр.ПриложениеКДоговору;
		
	КонецЦикла; 
	
	Если Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
		ИсправлениеПолучитьНомерНаСервере();
	КонецЕсли;
	
	ОбновитьНомераДокументовНаСервере();
	
	Модифицированность=Истина;
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	_УслугиПредставлениеНачалоВыбора(Элементы.УслугиКорректировка.ТекущаяСтрока);
	Элементы.УслугиКорректировка.ТекущийЭлемент = Элементы.УслугиКорректировкаПорядокОтражения;
	Элементы.УслугиКорректировка.ТекущийЭлемент = Элементы.УслугиКорректировкаПредставление;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.УслугиКорректировка.ТекущиеДанные.ЭтоДобавленнаяСтрока = ЛОЖЬ Тогда
		Если Поле = Элементы.УслугиКорректировкаГрузоперевозкаЗаказ Тогда 
			
			СтандартнаяОбработка = Ложь;
			
			Попытка
				ПоказатьЗначение(,_Заказ(Элементы.УслугиКорректировка.ТекущиеДанные.Грузоперевозка));
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			
		ИначеЕсли (Поле = Элементы.УслугиКорректировкаГрузоперевозка) Тогда 
			
			СтандартнаяОбработка = Ложь;
			// --- 
			Попытка
				ПоказатьЗначение(,Элементы.УслугиКорректировка.ТекущиеДанные.Грузоперевозка);
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПриИзменении(Элемент)
	
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры


#КонецОбласти
  

#Область ОграничениеУслугПоДоговору

&НаКлиенте
Процедура УслугиНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Не ПустаяСтрока(Текст) и ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
		ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре( Элементы.Услуги.ТекущиеДанные.ПорядокОтражения);
		Элемент.РежимВыбораИзСписка  = ИспользуетсяОгранчиениеУслуг;	
		Если ИспользуетсяОгранчиениеУслуг Тогда 
			Если Элемент.СписокВыбора.Количество()> 0 Тогда
				Элемент.СписокВыбора.Очистить();
			КонецЕсли;
			
			Элемент.СписокВыбора.ЗагрузитьЗначения(_УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору));   
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Обновить_Количесто_Из_параметра

&НаКлиенте
Процедура Команда_ОбновитьКоличество(Команда)
	
	ОбновитьКоличествоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоНаСервере()
	
	_УФС.ОбработатьтаблицуУслугНаСервере(Объект.Услуги, УстановитьЗначениеНольЗначениеПараметраНеУстановлено);
	
	Модифицированность = истина;
	
КонецПроцедуры

#КонецОбласти 

#Область Настройка_динамических_колонок

&НаКлиенте
Процедура НастройкаКолонок(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаЗначений"	, ПолучитьДанныеДляПередачи());
	ПараметрыФормы.Вставить("СписокСПометками"		, Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы"		, "Дополнительные колонки");
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораСпискаПараметров", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораИзСписка",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&наСервере
Функция ПолучитьДанныеДляПередачи()
	
	Возврат ПоместитьВоВременноеХранилище(СписокДополнительныхКолонок);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораСпискаПараметров(Результат, ДопПараметры) Экспорт
 
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ОбработатьРезультатВыбораКолонок(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыбораКолонок(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		СписокКолонок = ПолучитьИзВременногоХранилища(Результат);
		
		СписокДополнительныхКолонок.Очистить();
		СписокВыбранныеКолонки.Очистить();
		
		Для Каждого ЭлементСписка из СписокКолонок Цикл
			СписокДополнительныхКолонок.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, ЭлементСписка.Пометка);
			Если ЭлементСписка.Пометка Тогда
				СписокВыбранныеКолонки.Добавить(ЭлементСписка.Значение);	
			КонецЕсли;
		КонецЦикла;
		
		_УФС.ДополнитьДинамическиеКолонки(ЭтаФорма);
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
		
	КонецЕсли;
	
	УстановитьВидимостьКнопкиОбновленияЗначений();
                                 
КонецПроцедуры

&наСервере
Функция ПолучитьСтруктуруПараметровДляПередачи()
	
	СоответствиеПараметров = Неопределено;
	Если СписокДоступныхПараметров.Количество() > 0 Тогда
		СоответствиеПараметров = СписокДоступныхПараметров[0].Значение ;
	КонецЕсли;

	СтуктураПараметров = Новый Структура;
	СтуктураПараметров.Вставить("Объект"				, Объект);
	СтуктураПараметров.Вставить("ТаблицаДокумента"		, Объект.Услуги);
	СтуктураПараметров.Вставить("ВыбранныеКолонки"		, СписокВыбранныеКолонки.ВыгрузитьЗначения());
	СтуктураПараметров.Вставить("СоответствиеПараметров", СоответствиеПараметров);
	СтуктураПараметров.Вставить("мГрузоперевозки"		, Объект.Услуги.Выгрузить().ВыгрузитьКолонку("Грузоперевозка"));
	
	Возврат СтуктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура НастройкаКолонок_ОбновитьЗначения(Команда)
	
	ОбновлитьЗначенияПараметровнаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновлитьЗначенияПараметровнаСервере()
	
	_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьКнопкиОбновленияЗначений()
	
	Элементы.УслугиНастройкаКолонок_ОбновитьЗначения.Видимость = СписокВыбранныеКолонки.Количество() > 0;
	
КонецПроцедуры

#КонецОбласти

#Область Изменение_Состава_цены

&НаКлиенте
Процедура ЦенаСНДС(Команда)
	
	Если Объект.Услуги.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбИзмененииСоставаЦены", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Данные табличной части будут пересчитаны. Продолжить?" , Режим, 0);
		
	Иначе
		
		Объект.ЦенаСНДС = не Объект.ЦенаСНДС;
		ОбработатьИзменениеФлагаЦенаСНДС();
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеФлагаЦенаСНДС()
	
	ОбработатьИзменениеСоставаЦены();
	ПересчитатьДанныеСтрокНаСервере(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбИзмененииСоставаЦены(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	Объект.ЦенаСНДС = не Объект.ЦенаСНДС;
	ОбработатьИзменениеСоставаЦены();

	ПересчитатьДанныеСтрокНаСервере(Истина);

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСоставаЦены()
	
	ТекстЗаголовкаЦены 	= "Цена";
	ШрифтЗаголовка 		= Новый Шрифт();
	ЦенаСНДС 			= Объект.ЦенаСНДС;
	
	Если ЦенаСНДС Тогда
		ТекстЗаголовкаЦены 	= ТекстЗаголовкаЦены + " (с НДС)";
		ШрифтЗаголовка 		= Новый Шрифт(, , Истина);
	КонецЕсли;
	
	Элементы.УслугиЦена.Заголовок 		=  ТекстЗаголовкаЦены;
	Элементы.УслугиЦена.ШрифтЗаголовка 	=  ШрифтЗаголовка;
	
	Элементы.УслугиКорректировкаГруппаЦена.Заголовок 	  =  ТекстЗаголовкаЦены;
	Элементы.УслугиКорректировкаГруппаЦена.ШрифтЗаголовка =  ШрифтЗаголовка;
	
	Элементы.УслугиЦенаСНДС.Пометка 				= ЦенаСНДС;
	Элементы.УслугиКорректировкаЦенаСНДС.Пометка 	= ЦенаСНДС;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДанныеСтрокНаСервере(ТолькоЦена)
	
	ЦенаСНДС = Объект.ЦенаСНДС;
	
	Для Каждого СтрокаУслуги из Объект.Услуги Цикл
		ПересчитатьСтрокуНаСерере(СтрокаУслуги.ПолучитьИдентификатор(), ЦенаСНДС, ТолькоЦена);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокуНаСерере(ИдентификаторСтроки, ЦенаСНДС, ТолькоЦена=Ложь, ПризнакКорр="", Повторить = Истина)
	
	ТекущаяСтрока = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекСтавкаНДС  = CW_Финансы.ПолучитьСтавкуНДС(ТекущаяСтрока["СтавкаНДС"+ПризнакКорр]);
	
	Если ТолькоЦена Тогда
		Если ЦенаСНДС Тогда   
			ТекущаяСтрока["Цена"+ПризнакКорр] = _сф.БезопасноРазделить(ТекущаяСтрока["Всего"+ПризнакКорр],ТекущаяСтрока["Количество"+ПризнакКорр]);	
		Иначе
			ТекущаяСтрока["Цена"+ПризнакКорр] = _сф.БезопасноРазделить(ТекущаяСтрока["Сумма"+ПризнакКорр],ТекущаяСтрока["Количество"+ПризнакКорр]);	
		КонецЕсли; 
		
	Иначе
		
		Если ЦенаСНДС Тогда
			ТекущаяСтрока["Всего"+ПризнакКорр] 	= ТекущаяСтрока["Цена"+ПризнакКорр] * ТекущаяСтрока["Количество"+ПризнакКорр];
			ТекущаяСтрока["НДС"+ПризнакКорр] 	= ТекущаяСтрока["Всего"+ПризнакКорр] * ТекСтавкаНДС/(100 + ТекСтавкаНДС); 
			ТекущаяСтрока["Сумма"+ПризнакКорр] 	= ТекущаяСтрока["Всего"+ПризнакКорр] - ТекущаяСтрока["НДС"+ПризнакКорр];
		Иначе
			ТекущаяСтрока["Сумма"+ПризнакКорр] 	= ТекущаяСтрока["Цена"+ПризнакКорр] * ТекущаяСтрока["Количество"+ПризнакКорр];
			ТекущаяСтрока["НДС"+ПризнакКорр] 	= ТекущаяСтрока["Сумма"+ПризнакКорр] * ТекСтавкаНДС/100;
			ТекущаяСтрока["Всего"+ПризнакКорр] 	= ТекущаяСтрока["Сумма"+ПризнакКорр] + ТекущаяСтрока["НДС"+ПризнакКорр];	
		КонецЕсли;
		
	КонецЕсли;       
	
	Если Объект.ПоказатьРубли Тогда
		ПересчитатьВРегламентированнуюВалютуСтрокуНаСерере(ИдентификаторСтроки); 
	Конецесли;
	
КонецПроцедуры   

Процедура ПересчитатьВРегламентированнуюВалютуСтрокуНаСерере(ИдентификаторСтроки, ОчиститьСуммы = Ложь)    
	
	ТекущаяСтрока = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);     
	
	Если Объект.Корректировка Тогда
		КоррПолеДо 		= "_ДоКорректировки";	
		КоррПолеПеред	= "_ПередКорректировкой";	
	КонецЕсли;
	
	Если ОчиститьСуммы Тогда
		ТекущаяСтрока.ЦенаРег 	= 0;
		ТекущаяСтрока.СуммаРег	= 0;
		ТекущаяСтрока.НДСРег 	= 0;
		ТекущаяСтрока.ВсегоРег 	= 0; 
		
	Иначе
		Если Объект.УЕ_ПользовательскийКурс Тогда
			ДанныеКурса = Новый Структура;
			ДанныеКурса.Вставить("Курс", Объект.УЕ_Курс);
			ДанныеКурса.Вставить("Кратность", Объект.УЕ_Кратность);
		Иначе
			ДанныеКурса = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта, Объект.Дата);
		КонецЕсли;
		
		ТекущаяСтрока.ЦенаРег 	= CW_Финансы.ПересчитатьИзВалютыВВалюту(ТекущаяСтрока.Цена, 	Объект.Валюта, ВалютаРегламентированногоУчета, ДанныеКурса.Курс,1, ДанныеКурса.Кратность, 1);	
		ТекущаяСтрока.СуммаРег 	= CW_Финансы.ПересчитатьИзВалютыВВалюту(ТекущаяСтрока.Сумма, 	Объект.Валюта, ВалютаРегламентированногоУчета, ДанныеКурса.Курс,1, ДанныеКурса.Кратность, 1);	
		ТекущаяСтрока.НДСРег 	= CW_Финансы.ПересчитатьИзВалютыВВалюту(ТекущаяСтрока.НДС, 		Объект.Валюта, ВалютаРегламентированногоУчета, ДанныеКурса.Курс,1, ДанныеКурса.Кратность, 1);	
		ТекущаяСтрока.ВсегоРег  = ТекущаяСтрока.СуммаРег + ТекущаяСтрока.НДСРег;
		
	КонецЕсли;
	
КонецПроцедуры   



#КонецОбласти

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры



#КонецОбласти

//Подсистема.СтатусыДокументов
&НаКлиенте
Процедура СтатусДокументаИзменить(Команда)
	
	CW_СтатусыДокументовКлиент.ОткрытьФормуРедактированияСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДанныхСтатуса(Результат, ДополнительныеПараметры) Экспорт
	
	CW_СтатусыДокументовКлиент.ОбработатьИзменениеДанныхСтатуса(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаИстория(Команда)
	
	CW_СтатусыДокументовКлиент.ПоказатьИсториюСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.ОткрытьСтатусДокумента(ЭтаФорма,Элемент, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаАвтоПодбор(ЭтаФорма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	CW_СтатусыДокументовКлиент.ПриИзмененииСтатусаДокумента(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеИзменениеСтатусДокументаНаСервере()
	
	CW_СтатусыДокументовСервер.ПолучитьТекущийСтатусДокумента(Объект, ЭтаФорма);

КонецПроцедуры
//Подсистема.СтатусыДокументов


//Подистема.CW_ПланированиеДДС
&НаСервере
Процедура ОбновитьЗаголовокСтраницы()
	
	CW_ПланированиеДДССервер.ОбновитьЗаголовокСтраницыЗаявок(Элементы, Объект.Ссылка);
	
КонецПроцедуры
//Подистема.CW_ПланированиеДДС


//Подсистема.УчетПриложенийДоговоров
&НаКлиенте
Процедура УслугиДоговорПокупателяПриИзменении(Элемент)
	CW_УчетПриложенийДоговоровКлиентСервер.ПриИзмененеииДоговораВСтрокеТабличнойЧасти(ЭтаФорма, "Услуги", "ДоговорПокупателя");
КонецПроцедуры

&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	_ОбработатьИзменениеДоговора();
КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров

//Таблица формы УслугиКорректировка
&НаКлиенте
Процедура УслугиКорректировка_ПереформироватьПредставление(Команда)
	
	_ПереформироватьПредставлениеУслуг(Элементы.УслугиКорректировка.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.УслугиКорректировка.ТекущиеДанные;
		ТекущиеДанные.ЭтоДобавленнаяСтрока = Истина;
		ТекущиеДанные.Количество = 1;
		
		Если Копирование Тогда
			ТекущиеДанные.Представление_ДоКорректировки = "";
			ТекущиеДанные.Количество_ДоКорректировки	= 0;
			ТекущиеДанные.Цена_ДоКорректировки			= 0;
			ТекущиеДанные.Сумма_ДоКорректировки			= 0;
			ТекущиеДанные.НДС_ДоКорректировки  			= 0;
			ТекущиеДанные.Всего_ДоКорректировки			= 0;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаНоменклатураПриИзменении(Элемент)
	_УслугиНоменклатураПриИзменении(Элементы.УслугиКорректировка.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре(Элементы.Услуги.ТекущиеДанные.ПорядокОтражения);	
	Если Не ИспользуетсяОгранчиениеУслуг Тогда
		
		ВыбранноеЗначение = Элементы.Услуги.ТекущиеДанные.Номенклатура;	
		_УФК.ВыбратьНоменклатуру(ВыбранноеЗначение,Элемент,ДанныеВыбора,СтандартнаяОбработка);
		
	Иначе

		СписокЗначений = Новый СписокЗначений;
		Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
			МассивУслуг =  _УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору);
			СписокЗначений.ЗагрузитьЗначения(МассивУслуг);
		КонецЕсли; 
		
		Если СписокЗначений.Количество() = 0 Тогда
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст   		= "Не определен список услуг по договору!";
			Сообщение.ПутьКДанным  	= "Объект";
			Сообщение.Поле    		= "Договор";
			Сообщение.Сообщить();
			
		Конецесли;
		
		ДанныеВыбора = СписокЗначений;
		СтандартнаяОбработка = Ложь;
		
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) и ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
		ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре( Элементы.Услуги.ТекущиеДанные.ПорядокОтражения);
		Элемент.РежимВыбораИзСписка  = ИспользуетсяОгранчиениеУслуг;	
		Если ИспользуетсяОгранчиениеУслуг Тогда 
			Если Элемент.СписокВыбора.Количество()> 0 Тогда
				Элемент.СписокВыбора.Очистить();
			КонецЕсли;
			
			Элемент.СписокВыбора.ЗагрузитьЗначения(_УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору));   
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные 	= Элементы.УслугиКорректировка.ТекущиеДанные;
	Отказ 			= ТекущиеДанные.ЭтоДобавленнаяСтрока = ЛОЖЬ;
	
	Если Отказ Тогда
		ПоказатьПредупреждение(,"Удаляемая строка есть в корректируемом документе. Удаление запрещено!",30, "Ошибка удаления строки");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПорядокОтраженияПриИзменении(Элемент)
	ПриИзмененииУслугиКорректировкаПорядокОтражения();
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПорядокОтраженияОчистка(Элемент, СтандартнаяОбработка)
	ПриИзмененииУслугиКорректировкаПорядокОтражения();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииУслугиКорректировкаПорядокОтражения(Строка = Неопределено)
		
	Если Строка = Неопределено Тогда
		Стр = Элементы.УслугиКорректировка.ТекущиеДанные;
	Иначе
		Стр = Объект.УслугиКорректировка.НайтиПоИдентификатору(Строка);
	КонецЕсли;	
		
	// очистили значение
	Если Стр.ПорядокОтражения.Пустая() Тогда
		Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты");
	КонецЕсли; 
	
	ТребоватьЗаполненияПокупателя = _ДС().ПД.ТребоватьЗаполненияПокупателяДляПорядокаОтраженияЗатратыВРасходах;
	
	_ПриИзмененииУслугиПорядокОтражения(?(Строка = Неопределено, Элементы.УслугиКорректировка.ТекущаяСтрока, Строка));
	
	Если (Стр.ПорядокОтражения <> ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты")) Тогда
		Если (Элементы.УслугиСпособУчетаНДС.Видимость) Тогда
			Стр.СпособУчетаНДС = Неопределено;	
		КонецЕсли; 
		
		СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(Стр.ПолучитьИдентификатор());
		СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
		
		Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
			Стр.Покупатель 		 = СтруктураДанныхСтроки.Покупатель;
		КонецЕсли;
		Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
			Стр.ДоговорПокупателя 	 = СтруктураДанныхСтроки.ДоговорПокупателя;
		КонецЕсли;
		Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
			Стр.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
		КонецЕсли;
		Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
			Стр.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
		КонецЕсли;
		
	Иначе
		Если ТребоватьЗаполненияПокупателя Тогда
			СтруктураПараметров 	= ПодготовитьДанныеДляПолученияДанныхпокупателя(Стр.ПолучитьИдентификатор());
			СтруктураДанныхСтроки 	= ПолучитьДанныеПокупателя(СтруктураПараметров);
			
			
			Если СтруктураДанныхСтроки.Свойство("Покупатель") Тогда
				Стр.Покупатель 		 = СтруктураДанныхСтроки.Покупатель;
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("ДоговорПокупателя") Тогда
				Стр.ДоговорПокупателя 	 = СтруктураДанныхСтроки.ДоговорПокупателя;
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("ПриложениеКДоговору") Тогда
				Стр.ПриложениеКДоговору = СтруктураДанныхСтроки.ПриложениеКДоговору;
			КонецЕсли;
			Если СтруктураДанныхСтроки.Свойство("УчетПриложений") Тогда
				Стр.УчетПриложенийПоДоговору = СтруктураДанныхСтроки.УчетПриложений;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры
//Таблица формы УслугиКорректировка

//Получение параметров для строки "Покупатель", "Договор", "Приложение"
&НаСервере
Функция ПодготовитьДанныеДляПолученияДанныхпокупателя(ИдентифкаторСтроки)
	
	СтрокаТекущая = Объект.Услуги.НайтиПоИдентификатору(ИдентифкаторСтроки);
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", 		Объект.Организация);
	Результат.Вставить("Контрагент", 		СтрокаТекущая.Грузоперевозка.Клиент);
	Результат.Вставить("Объект", 			СтрокаТекущая.Грузоперевозка);
	Результат.Вставить("Заказ", 			СтрокаТекущая.Грузоперевозка.Заказ);
	Результат.Вставить("ЭтоВариантБюджета", ЛОЖЬ);
	Результат.Вставить("УчетПриложений", 	ЛОЖЬ);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПокупателя(СтруктураПараметров)
	
	Покупатель = CW_Финансы.ВернутьПлательщика(СтруктураПараметров);
	СтруктураПараметров.Вставить("Покупатель", Покупатель);
	
	ПолучитьДоговорПокупателя(СтруктураПараметров);
	ПолучитьПриложениеПоДоговору(СтруктураПараметров);
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("Покупатель",				СтруктураПараметров.Покупатель);
	
	Если СтруктураПараметров.Свойство("ДоговорПокупателя") Тогда
		ДанныеСтроки.Вставить("ДоговорПокупателя",		СтруктураПараметров.ДоговорПокупателя);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ПриложениеКДоговору") Тогда
		ДанныеСтроки.Вставить("ПриложениеКДоговору",		СтруктураПараметров.ПриложениеКДоговору);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("УчетПриложений") Тогда
		ДанныеСтроки.Вставить("УчетПриложений",			СтруктураПараметров.УчетПриложений);
	КонецЕсли;
	
	Возврат ДанныеСтроки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПолучитьДоговорПокупателя(СтруктураПараметров)
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Объект) Тогда
		Возврат;
	КонецЕсли; 
	
	НайденныйДоговор = ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка");
	
	ПараметрДоговора = Константы.CW_ПараметрДоговораПлательщика.Получить();
	Если Не ПараметрДоговора.Пустая() Тогда
		
		НайденныйДоговор = ПолучитьЗначениеПараметра(СтруктураПараметров.Объект, ПараметрДоговора, ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка"));
		
		Если Не ЗначениеЗаполнено(НайденныйДоговор) Тогда
			Если СтруктураПараметров.Свойство("Заказ") Тогда
				Если ЗначениеЗаполнено(СтруктураПараметров.Заказ) Тогда
					НайденныйДоговор = ПолучитьЗначениеПараметра(СтруктураПараметров.Заказ, ПараметрДоговора, ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка"))
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НайденныйДоговор) Тогда
			Если НайденныйДоговор.Владелец <> СтруктураПараметров.Покупатель ИЛИ
				НайденныйДоговор.Организация <> СтруктураПараметров.Организация Тогда
				
				НайденныйДоговор = ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка");
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(НайденныйДоговор)  Тогда
		ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");
		НайденныйДоговор = CW_Документы.ПолучитьПоследнийДоговор(СтруктураПараметров.Покупатель, СтруктураПараметров.Организация, ВидДоговора);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ДоговорПокупателя", НайденныйДоговор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьПриложениеПоДоговору(СтруктураПараметров)
	
	Если НЕ ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам") Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Объект) Тогда
		Возврат;
	КонецЕсли; 

	Если НЕ СтруктураПараметров.ДоговорПокупателя.ИспользуютсяПриложения Тогда
		Возврат;
	КонецЕсли;
	
	НайденноеПриложение = ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка");
	
	СтруктураПараметров.УчетПриложений = Истина;
	
	ПараметрПриложенияДоговора = Константы.CW_ПараметрПриложенияДоговора.Получить();
	Если Не ПараметрПриложенияДоговора.Пустая() Тогда
		
		НайденноеПриложение = ПолучитьЗначениеПараметра(СтруктураПараметров.Объект, ПараметрПриложенияДоговора, ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка"));
		
		Если НайденноеПриложение.Пустая() Тогда
			Если СтруктураПараметров.Свойство("Заказ") Тогда
				Если ЗначениеЗаполнено(СтруктураПараметров.Заказ) Тогда
					НайденноеПриложение = ПолучитьЗначениеПараметра(СтруктураПараметров.Заказ, ПараметрПриложенияДоговора, ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка"))
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не НайденноеПриложение.Пустая() Тогда
			Если НайденноеПриложение.Договор <> СтруктураПараметров.ДоговорПокупателя  Тогда
				НайденноеПриложение = ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка");
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
	Если НайденноеПриложение.Пустая() Тогда
		
		Запрос = Новый Запрос;
		запрос.Текст = "ВЫБРАТЬ
		               |	CW_ПриложенияКДоговорам.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.CW_ПриложенияКДоговорам КАК CW_ПриложенияКДоговорам
		               |ГДЕ
		               |	CW_ПриложенияКДоговорам.Договор = &Договор
		               |	И CW_ПриложенияКДоговорам.ПометкаУдаления = ЛОЖЬ
		               |	И (CW_ПриложенияКДоговорам.СрокДействия > &Текущаядата
		               |			ИЛИ CW_ПриложенияКДоговорам.СрокДействия = &ПустаяДата)";
		
		Запрос.УстановитьПараметр("Договор", 		СтруктураПараметров.ДоговорПокупателя);
		Запрос.УстановитьПараметр("Текущаядата", 	ТекущаяДата());
		Запрос.УстановитьПараметр("ПустаяДата", 	Дата(1,1,1));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			НайденноеПриложение = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;

	СтруктураПараметров.Вставить("ПриложениеКДоговору", НайденноеПриложение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПараметра(ВладелецПараметров, Параметр, ПустоеЗначение)
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ВладелецПараметров)  = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
		               |	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
		               |	CW_ХарактеристикиГрузоперевозок.Значение КАК Значение
		               |ИЗ
		               |	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
		               |ГДЕ
		               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка = &ВладелецПараметров
		               |	И CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр";
	КонецЕсли;
	
	Если ТипЗнч(ВладелецПараметров)  = Тип("СправочникСсылка.CW_Заказы") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ХарактеристикиЗаказов.Параметр КАК Параметр,
		               |	CW_ХарактеристикиЗаказов.Значение КАК Значение
		               |ИЗ
		               |	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
		               |ГДЕ
		               |	CW_ХарактеристикиЗаказов.Заказ = &ВладелецПараметров
		               |	И CW_ХарактеристикиЗаказов.Параметр = &Параметр";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВладелецПараметров", ВладелецПараметров);
	Запрос.УстановитьПараметр("Параметр", 			Параметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат ПустоеЗначение;
	
КонецФункции
//Получение параметров для строки "Покупатель", "Договор", "Приложение"

&НаКлиенте
Процедура ФормироватьВедомыеДатойДокументаПриИзменении(Элемент)
	_СформироватьКурс();   
	
	// необходимо обновить параметры учётной политики и параметры договора
	_СформироватьОбщиеПараметры("ПараметрыДоговора,УчетнаяПолитика");

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если Объект.Ссылка.Пустая() Тогда
		РедактированиеАктированныхСчетов = CW_ПраваДоступа.ПравоДоступно("РазрешитьРедактированиеВходящихАктированныхСчетов");
		Если Объект.ПредъявленАкт и Объект.ПредъявленСчет и Не РедактированиеАктированныхСчетов Тогда
			ПоказатьПредупреждение(, "Недостаточно прав для записи пакетного документа!");
			Отказ = истина;
			Возврат ;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ПредъявленСчет Тогда
		Если НЕ ЗначениеЗаполнено(Объект.НомерСчета) или Не ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте правильность заполнения реквизитов счета.",,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	Если Объект.ПредъявленАкт Тогда
		Если Не ЗначениеЗаполнено(Объект.НомерАкта) или Не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте правильность заполнения реквизитов акта.",,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	Если Объект.ПредъявленСФ Тогда
		
		мПроверяемыеРеквизиты = новый Массив;
		мПроверяемыеРеквизиты.Добавить("ДатаСФ");
		Если Объект.Корректировка и Объект.ВидОперацииКорректировки <> ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
			мПроверяемыеРеквизиты.Добавить("НомерСФ");
		КонецЕсли;
		
		ЕстьПустые = ложь;
		Для Каждого ИмяРеквизита из мПроверяемыеРеквизиты Цикл
			Если Не ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда
				ЕстьПустые = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьПустые Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проверьте правильность заполнения реквизитов с/ф.",,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		ПоказатьПредупреждение(,"Проверьте правильность заполнения реквизитов первичных документов");
	КонецЕсли;

КонецПроцедуры  

&НаСервере                                     
// Проверяет факт того, что по договору с поставщиком наша организация выполняет обязательства налогового агента по НДС
Процедура ПроверитьУчетныйДоговорПоставщикаНаНА(Отказ)
	
	Если Не Объект.Договор.БухгалтерскийУчет 
		И НЕ Объект.Договор.УчетныйДоговор.УчетАгентскогоНДС Тогда
		Возврат;
	КонецЕсли;  
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПорядокОтражения", ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление"));
	
	мСтроки = Объект.Услуги.НайтиСтроки(Отбор);
	Если мСтроки.Количество() > 0 
		и Объект.Договор.ВалютаДоговора <> ВалютаРегламентированногоУчета Тогда   
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область Первичные_документы

&НаКлиенте
Процедура ПервичныеДокументыУстановитьВсе(Команда)
	
	УстановитьФлагиПервичныхДокументовНаКлиенте(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыСнятьВсе(Команда)
	
	УстановитьФлагиПервичныхДокументовНаКлиенте(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагиПервичныхДокументовНаКлиенте(Флаг)
	
	Если РедактированиеФинансов_Расходы_Счета Тогда
		Объект.ПредъявленСчет 	= Флаг;
		ПредъявленСчетПриИзмененииНаКлиенте();
	КонецЕсли;
	
	Если РедактированиеФинансов_Расходы_Акты Тогда
		Объект.ПредъявленАкт 	= Флаг;
		Объект.ПредъявленСФ 	= Флаг;
		ПредъявленАктПриИзмененииНаКлиенте();
	КонецЕсли;
	
	ПервичныеДокументыУправлениеЭлементамиФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПредъявленСчетПриИзменении(Элемент)
	
	ПредъявленСчетПриИзмененииНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ПредъявленСчетПриИзмененииНаКлиенте()

	//Взаиморасчеты по документу
	Элементы.Команда_ВзаиморасчетыПоДокументу.Видимость  =  Объект.ПредъявленСчет;
	Элементы.Команда_ВзаиморасчетыПоДокументу1.Видимость =  Объект.ПредъявленСчет;
	//Взаиморасчеты по документу
	
	Если Объект.ПредъявленСчет Тогда
		Объект.СписокСчетов = Ложь;
		Если Не ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
			Объект.ДатаСчета = Объект.Дата;
		КонецЕсли;
	Иначе
		Объект.СпособЗачетаАвансовОЗ = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать");
		Если Не СохранятьРеквизитыПервичныхДокументов Тогда
			Объект.ДатаСчета  = Неопределено;
			Объект.НомерСчета = Неопределено;
		КонецЕсли;
	КонецЕсли; 
	
	УстановитьОписаниеСрокаОплаты();
	ПервичныеДокументыУправлениеЭлементамиФормы();
	ОбновитьНомераДокументовНаСервере();

КонецПроцедуры 

&НаКлиенте
Процедура ПредъявленАктПриИзменении(Элемент)
	
	ПредъявленАктПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредъявленАктПриИзмененииНаКлиенте()
	
	Если Объект.ПредъявленАкт Тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
			Объект.ДатаАкта = Объект.Дата;
		КонецЕсли;		
		
		СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметров.Дата 				= Объект.Дата;
		СтруктураПараметров.Договор 			= Объект.Договор;
		СтруктураПараметров.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
		
		ПараметрыДоговора			= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "ПорядокЗачетаАвансов");
		Объект.СпособЗачетаАвансов	= ПараметрыДоговора.ПорядокЗачетаАвансов;
		
	Иначе
		Объект.СпособЗачетаАвансов = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать");	
		Объект.ПредъявленСФ = Ложь;
		
		Если Не СохранятьРеквизитыПервичныхДокументов Тогда
			Объект.ДатаАкта   	= Неопределено;
			Объект.НомерАкта 	= Неопределено;
		КонецЕсли; 
		
	КонецЕсли; 
	
	УстановитьОписаниеСрокаОплаты();
	ПервичныеДокументыУправлениеЭлементамиФормы();
	ОбновитьНомераДокументовНаСервере();
	
КонецПроцедуры 

&НаКлиенте
Процедура ЭтоУниверсальныйДокументПриИзменении(Элемент)
	ОбновитьНомераДокументовНаСервере();
КонецПроцедуры


	
&НаКлиенте
Процедура ПредъявленСФПриИзменении(Элемент)
	
	ПредъявленСФПриИзмененииНаКлиенте();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПредъявленСФПриИзмененииНаКлиенте()
	
	Если Объект.ПредъявленСФ Тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаСФ) Тогда
			Если ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
				Объект.ДатаСФ = Объект.ДатаАкта;
			Иначе
				Объект.ДатаСФ = Объект.Дата;
			КонецЕсли;
		КонецЕсли;
		Если Объект.КодСпособаПолученияСФ = 0 Тогда
			Объект.КодСпособаПолученияСФ = 1;
		КонецЕсли;
	Иначе
		Если Не СохранятьРеквизитыПервичныхДокументов Тогда
			ДатаСФ  = Неопределено;
			НомерСФ = Неопределено
		КонецЕсли;
	КонецЕсли;
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
	ОбновитьНомераДокументовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	
	НомерСчетаПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаОчистка(Элемент, СтандартнаяОбработка)
	
	НомерСчетаПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзмененииНаКлиенте()
	
	Если ЗначениеЗаполнено(Объект.НомерСчета) Тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
			Объект.ДатаСчета = Объект.Дата;
		КонецЕсли;
	Иначе
		Объект.ДатаСчета = Дата(1,1,1);
	КонецЕсли;
	
	ДатаСчетаПриИзмененииНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ДатаСчетаПриИзменении(Элемент)
	
	ДатаСчетаПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСчетаОчистка(Элемент, СтандартнаяОбработка)
	
	ДатаСчетаПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСчетаПриИзмененииНаКлиенте()
	
	Если ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
		УстановитьОписаниеСрокаОплаты();		
	КонецЕсли;
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
	ОбновитьНомераДокументовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыВремяСчета(Команда)
	
	Если не ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата счета!",,"ДатаСчета", "Объект");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НачальнаяДата",	Объект.ДатаСчета);
	ДополнительныеПараметры.Вставить("ИмяРеквизита", 	"ДатаСчета");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияВремени",ЭтотОбъект, ДополнительныеПараметры); 
	
	ПоказатьВводДаты(ОписаниеОповещения,Объект.ДатаСчета,"Время счёта",ЧастиДаты.Время);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыВремяАкта(Команда)
	
	Если не ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата счета!",,"ДатаСчета", "Объект");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("НачальнаяДата",	Объект.ДатаАкта);
	ДополнительныеПараметры.Вставить("ИмяРеквизита", 	"ДатаАкта");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияВремени",ЭтотОбъект, ДополнительныеПараметры); 
	
	ПоказатьВводДаты(ОписаниеОповещения,Объект.ДатаАкта,"Время акта",ЧастиДаты.Время);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияВремени(ВведенноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВведенноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСтрокой	 = Формат(Объект[ДополнительныеПараметры.ИмяРеквизита],"ДФ=yyyyMMdd");
	ВремяСтрокой = Формат(ВведенноеЗначение,"ДФ=HHmmss");

	Объект[ДополнительныеПараметры.ИмяРеквизита] = Дата(ДатаСтрокой+ВремяСтрокой);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыДатаСчета(Команда)
	
	
	Объект.ДатаСчета = Объект.Дата;
	
	//УстановитьСрокОплатыНаСервере();
	
	ОбновитьНомераДокументовНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыДатаАкта(Команда)
	
	Объект.НомерАкта 	= Объект.НомерСчета;
	Объект.ДатаАкта 	= ?(ЗначениеЗаполнено(Объект.ДатаСчета),  Объект.ДатаСчета,  Объект.Дата);
	
	ОбновитьНомераДокументовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыДатаСчетФактуры(Команда)
	
	Если Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
		ИсправлениеПолучитьНомерНаСервере();
	Иначе
		Объект.НомерСФ 	= ?(Объект.ПредъявленАкт,	Объект.НомерАкта,	Объект.НомерСчета);
	КонецЕсли;

	Объект.ДатаСФ 	= ?(Объект.ПредъявленАкт,	Объект.ДатаАкта,	Объект.Дата);
	
	ОбновитьНомераДокументовНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансовОЗПриИзменении(Элемент)
	
	СпособЗачетаАвансовОЗПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура СпособЗачетаАвансовОЗПриИзмененииНаСервере()
	
	// очистили значение
	Если Не ЗначениеЗаполнено(Объект.СпособЗачетаАвансовОЗ) Тогда
		Объект.СпособЗачетаАвансовОЗ = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать"); 
	КонецЕсли; 
	
	// если не по документу, то очищаем таблицу зачета авансов
	Если Объект.СпособЗачетаАвансовОЗ <> ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.ПоДокументу") Тогда
		Объект.ЗачетАвансовОЗ.Очистить();
	КонецЕсли; 
	
	// регенерация формы
	_УправлениеЭлементамиФормы();	
	
	// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();

КонецПроцедуры

&НаСервере
Процедура УстановитьОписаниеСрокаОплаты()
	
	Текст = "<не установлен>";
	
	Если ЗначениеЗаполнено(_СрокОплаты) Тогда
		Текст = Формат(_СрокОплаты,"ДФ=dd.MM.yyyy");
		Если СокрЛП(_СрокОплатыОписание) <> "" Тогда
			Текст = Текст + " ("+СокрЛП(_СрокОплатыОписание)+")";
		КонецЕсли; 
	Иначе
		Если Не _СрокОплатыРучноеРедактирование Тогда
			Текст = "<авто>";
		КонецЕсли; 
	КонецЕсли;	
	
	СрокОплаты = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура СрокОплатыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыСрокаОплаты = Новый Структура;
	ПараметрыФормыСрокаОплаты.Вставить("Документ", 				Объект.Ссылка); 
	
	ПараметрыФормыСрокаОплаты.Вставить("ДатаОплаты",			_СрокОплаты);
	ПараметрыФормыСрокаОплаты.Вставить("Описание",				_СрокОплатыОписание);
	ПараметрыФормыСрокаОплаты.Вставить("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзменениеСрокаОплаты",ЭтотОбъект); 

	ОткрытьФорму("ОбщаяФорма.CW_СрокОплаты", ПараметрыФормыСрокаОплаты,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСрокаОплаты(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыбора.Свойство("ДатаОплаты",   		 _СрокОплаты);
	РезультатВыбора.Свойство("Описание",  			 _СрокОплатыОписание);
	РезультатВыбора.Свойство("РучноеРедактирование", _СрокОплатыРучноеРедактирование); 
	
	Если Не РезультатВыбора.РучноеРедактирование Тогда
		УстановитьСрокОплатыНаСервере();
	Иначе
		ЗаписатьСрокОплатыДокумента();  
		УстановитьОписаниеСрокаОплаты();             
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыУстановитьСрокОплаты(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Документ не записан!");
		Возврат;
	КонецЕсли;
	
	УстановитьСрокОплатыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСрокОплатыНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ссылка"		, Объект.Ссылка);
	СтруктураПараметров.Вставить("Договор"		, Объект.Договор);
	
	//Подсистема.УчетПриложенийДоговоров
	Если ЗначениеЗаполнено( Объект.ПриложениеКДоговору) Тогда
		СтруктураПараметров.Вставить("Договор"		, Объект.ПриложениеКДоговору);
	КонецЕсли;
	//Подсистема.УчетПриложенийДоговоров
	
	СтруктураПараметров.Вставить("Дата"			, Объект.Дата);
	СтруктураПараметров.Вставить("ДатаСчета"	, Объект.ДатаСчета);
	СтруктураПараметров.Вставить("ЕстьСчет"		, Объект.ПредъявленСчет);
	СтруктураПараметров.Вставить("ЕстьАкт"		, Объект.ПредъявленАкт);
	
	ДатаОплаты = CW_Документы.РассчитатьСрокОплаты(СтруктураПараметров);
	
	ПараметрыСрокаОплаты = Новый Структура;
	ПараметрыСрокаОплаты.Вставить("Счет", 		Объект.Ссылка);
	ПараметрыСрокаОплаты.Вставить("ДатаОплаты", ДатаОплаты);
	ПараметрыСрокаОплаты.Вставить("Описание", 	"");
	
	РегистрыСведений.CW_СрокиОплатыСчетов.ЗаписатьСрокОплатыДокумента(ПараметрыСрокаОплаты); 
	
	ПорядокРасчета = _ДС().ПД.УсловияОплаты.ПорядокРасчета;
	Если Не Объект.ПредъявленСчет и Объект.ПредъявленАкт 
		и ПорядокРасчета = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыВозвратаАкта") Тогда
		
		мСвязанныеСчета = Документы.CW_РасходыПоГрузоперевозке.ПолучитьСвязанныеСчета(Объект.Ссылка);
		Для каждого СвязанныйСчет из мСвязанныеСчета Цикл  
			
			ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(СвязанныйСчет);
			Если НЕ ДанныеСрокаОплаты.РучноеРедактирование Тогда
				РегистрыСведений.CW_СрокиОплатыСчетов.ЗаписатьСрокОплатыДокумента(Новый Структура("Счет,ДатаОплаты,Описание",СвязанныйСчет,ДатаОплаты,"")); 
			КонецЕсли; 
			
		КонецЦикла;
	КонецЕсли;

	ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(Объект.Ссылка);
	
	ДанныеСрокаОплаты.Свойство("ДатаОплаты",			_СрокОплаты);
	ДанныеСрокаОплаты.Свойство("Описание",				_СрокОплатыОписание);
	ДанныеСрокаОплаты.Свойство("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
	
	УстановитьОписаниеСрокаОплаты();

КонецПроцедуры

&НаКлиенте
Процедура ПланОплатыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "План оплаты можно установить только для записанного документа.");
	Иначе
		
		Представление = "Счёт №"+СокрЛП(Объект.НомерСчета)+" от "+Формат(Объект.ДатаСчета,"ДФ=dd.MM.yyyy")+" ("+Строка(Объект.Контрагент)+")";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияПланаОплаты",ЭтотОбъект); 
		
		ПараметрыФормыПланаОплаты = Новый Структура;
		ПараметрыФормыПланаОплаты.Вставить("Документ", Объект.Ссылка);
		ПараметрыФормыПланаОплаты.Вставить("ПредставлениеДокумента", Представление);
	
		ОткрытьФорму("ОбщаяФорма.CW_ПлановыйСрокОплаты",ПараметрыФормыПланаОплаты,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПланаОплаты(Ответ, ДополнительныеПараметры) Экспорт
	
	УстановитьОписаниеПланОплаты();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОписаниеПланОплаты()
	
	Текст = "<не задан>";

	ДанныеПланаОплаты = CW_Документы.ПолучитьПланОплаты(Объект.Ссылка);
	Если Не ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) и НЕ ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
		Текст = "<...>";	
	ИначеЕсли ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) Тогда
		Текст = Формат(ДанныеПланаОплаты.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
		Текст = Текст + " ("+СокрЛП(ДанныеПланаОплаты.Примечание)+")";
	КонецЕсли; 
	
	ПланОплаты = Текст;
	
	ОбновитьНомераДокументовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерАктаПриИзменении(Элемент)
	
	ИзменениеНомераАктаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерАктаОчистка(Элемент, СтандартнаяОбработка)
	
	ИзменениеНомераАктаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеНомераАктаНаКлиенте()
	
	Если ЗначениеЗаполнено(Объект.НомерАкта) и не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
		Объект.ДатаАкта = Объект.Дата;	
	КонецЕсли;
	
	ОбновитьНомераДокументовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаАктаПриИзменении(Элемент)
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	ОбновитьНомераДокументовНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансовПриИзменении(Элемент)
	
	СпособЗачетаАвансовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СпособЗачетаАвансовПриИзмененииНаСервере()
	
	// очистили значение
	Если Не ЗначениеЗаполнено(Объект.СпособЗачетаАвансов) Тогда
		Объект.СпособЗачетаАвансов = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать"); 
	КонецЕсли; 
	
	// если не по документу, то очищаем таблицу зачета авансов
	Если Объект.СпособЗачетаАвансов <> ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.ПоДокументу") Тогда
		Объект.ЗачетАвансов.Очистить();
	КонецЕсли; 
	
	// регенерация формы
	_УправлениеЭлементамиФормы();	
	
	//// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений;
	Список.Добавить("список","Выбор из списка");
	
	// если ведется оперативный учет задолженности
	Если ОперативныйУчет И НЕ ВводОстатковОЗ Тогда
		Список.Добавить("подбор","Подбор неактированных");
	КонецЕсли; 

	ДополнительныеПараметры = Новый Структура("Элемент", Элемент);

	ОписаниеОповещения = Новый ОписаниеОповещения("ПакетДокументовОбработатьВыборВариантаПодбораСчета",ЭтотОбъект, ДополнительныеПараметры); 
	Если Список.Количество() = 1 Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Список[0]);
	Иначе
		ПоказатьВыборИзМеню(ОписаниеОповещения, Список, Элемент);
	КонецЕсли; 
		
КонецПроцедуры


&НаКлиенте
Процедура ПакетДокументовОбработатьВыборВариантаПодбораСчета(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыбора.Значение = "подбор" Тогда
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация", 		Объект.Организация);
		СтруктураОтбора.Вставить("Контрагент", 			Объект.Контрагент);
		СтруктураОтбора.Вставить("Договор", 			Объект.Договор);
		СтруктураОтбора.Вставить("Валюта", 				Объект.Валюта);
		СтруктураОтбора.Вставить("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
		
		ПараметрыФормыПодбора = Новый Структура;
		ПараметрыФормыПодбора.Вставить("Дата",		Объект.Дата);
		ПараметрыФормыПодбора.Вставить("Документ",	Объект.Ссылка);
		ПараметрыФормыПодбора.Вставить("Отбор",		СтруктураОтбора);
		
		ОткрытьФорму("ОбщаяФорма.CW_ПодборНеактированныхСчетов",ПараметрыФормыПодбора,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли РезультатВыбора.Значение = "список" Тогда 
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Контрагент", 				Объект.Контрагент);
		СтруктураОтбора.Вставить("Договор", 				Объект.Договор);
		СтруктураОтбора.Вставить("ПриложениеКДоговору", 	Объект.ПриложениеКДоговору);;
		СтруктураОтбора.Вставить("ПредъявленСчет", 			Истина);
		СтруктураОтбора.Вставить("ПредъявленАкт", 			Ложь);
		СтруктураОтбора.Вставить("ПредъявленСФ", 			Ложь);
		
		// во всех остальных случаях
		ПараметрыФормыПодбора = Новый Структура;
		ПараметрыФормыПодбора.Вставить("РежимВыбора",	Истина);
		ПараметрыФормыПодбора.Вставить("Отбор",		СтруктураОтбора);
		
		ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаВыбора",ПараметрыФормыПодбора,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСчетовПриИзменении(Элемент)
	
	Если Объект.СписокСчетов Тогда
		Объект.Счет = Неопределено;
	КонецЕсли; 
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	ОбновитьНомераДокументовНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыПодборСчетов(Команда)
	
	АвтоматическийПодборСчетов();

КонецПроцедуры

&НаКлиенте
Процедура НомерСФПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.НомерСФ) И НЕ ЗначениеЗаполнено(Объект.ДатаСФ) Тогда
		Объект.ДатаСФ = ?(ЗначениеЗаполнено(Объект.ДатаАкта),Объект.ДатаАкта,Объект.Дата);
	КонецЕсли;
	ОбновитьНомераДокументовНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДатаСФПриИзменении(Элемент)
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	ОбновитьНомераДокументовНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСписокКодовОпераций()
	
	ИспользоватьКоды2015 = Ложь;
	Если Объект.Дата >= '20150101' Тогда 
		ИспользоватьКоды2015 = Истина;
	КонецЕсли;

	ДатаЗаполнения = Объект.Дата;
	Если  Объект.ПредъявленСФ И ЗначениеЗаполнено(Объект.ДатаСФ) Тогда
		ДатаЗаполнения = Объект.ДатаСФ;
	КонецЕсли; 
	
	CW_БухгалтерияЭкспедитораСерверПереопределяемый.ЗаполнитьСписокКодовВидовОпераций(
		ПредопределенноеЗначение("Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры"), 
		Элементы.КодВидаОперации.СписокВыбора,
		ДатаЗаполнения);
		
КонецПроцедуры
	
&НаСервере
Процедура ПервичныеДокументыПриСозданииНаСервере()
	
	РедактированиеФинансов_Расходы_Счета 	= CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Счета");
	РедактированиеФинансов_Расходы_Акты	 	= CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Акты");
	
	РаздельныйУчетНДСНаСчете19 			= CW_БухгалтерияЭкспедитораСерверПереопределяемый.РаздельныйУчетНДСНаСчете19(Объект.Организация, Объект.Дата);
	ПлательщикНДС 						= УчетнаяПолитика.ПлательщикНДС(Объект.Организация, Объект.Дата);
	ПоставщикРезидентТаможенногоСоюза	= CW_БухгалтерияЭкспедитораСерверПереопределяемый.КонтрагентРезидентТаможенногоСоюза(Объект.Контрагент);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Договор", 			Объект.Договор);
	СтруктураПараметров.Вставить("ПриложениеКДоговору",	Объект.ПриложениеКДоговору);
	
	УчетныйДоговор = CW_Финансы.ПолучитьУчетныйДоговор(СтруктураПараметров);

	Если ЗначениеЗаполнено(УчетныйДоговор) Тогда
		СвойстваДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетныйДоговор, "ВидДоговора,НДСПоСтавкам4и2,ВидАгентскогоДоговора");
		НДСИсчисляетсяНалоговымАгентом = СвойстваДоговора.ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.РеализацияТоваров;
	Иначе
		НДСИсчисляетсяНалоговымАгентом = Ложь;
	КонецЕсли;

	УстановитьОписаниеСрокаОплаты();
	УстановитьОписаниеПланОплаты();
	
	УстановитьПривилегированныйРежим(Истина);
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	УстановитьПривилегированныйРежим(Ложь);
	
	СрокОплатыДоступен = 	ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы 
							Или ГруппаПользователя.РедактированиеСроковОплатыИсходящихСчетов
							Или ГруппаПользователя.ПолныеПрава;
	ПланОплатыДоступен = 	ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы 
							Или ГруппаПользователя.РедактированиеФинансов_Доходы_Счета
							Или ГруппаПользователя.ПолныеПрава;
							
	// если формирование ведомых документов установлено датой ведущего документа,
	// то время акта не требуется и кнопку для определения времени можно скрыть
	Если Объект.ФормироватьВедомыеДатойДокумента Тогда
		Элементы.ПервичныеДокументыВремяАкта.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаСчет.Доступность 			= РедактированиеФинансов_Расходы_Счета;
	Элементы.ГруппаАктСчетФактура.Доступность 	= РедактированиеФинансов_Расходы_Акты;
	
	КонтрольДокументовПоСумме = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"КонтрольВходящихДокументовПоСумме");
	Если КонтрольДокументовПоСумме = Неопределено Тогда
		КонтрольДокументовПоСумме = Ложь;
	КонецЕсли; 
	Элементы.ГруппаКонтрольнаяСумма.Видимость = КонтрольДокументовПоСумме;
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПервичныеДокументыУправлениеЭлементамиФормы()
	
	Элементы.ПервичныеДокументыКоманднаяПанель.Видимость	= ВалютаРегламентированногоУчетаРубль и НЕ Объект.Корректировка;
	Элементы.ПервичныеДокументыКоманднаяПанель.Видимость	= ВалютаРегламентированногоУчетаРубль и НЕ Объект.Корректировка;
	
	
	Элементы.ГруппаАктСчетФактура.Видимость	= ВалютаРегламентированногоУчетаРубль;
	Элементы.ГруппаКнопки.Видимость 		= ВалютаРегламентированногоУчетаРубль;
	
	// счет
	Элементы.ПредъявленСчет.Доступность 	= РедактированиеФинансов_Расходы_Счета;
	Элементы.НомерСчета.ТолькоПросмотр 		= НЕ Объект.ПредъявленСчет и НЕ РедактированиеФинансов_Расходы_Счета;
	Элементы.ДатаСчета.ТолькоПросмотр		= НЕ Объект.ПредъявленСчет и НЕ РедактированиеФинансов_Расходы_Счета;
	Элементы.ПервичныеДокументыДатаСчета.Доступность = Объект.ПредъявленСчет и РедактированиеФинансов_Расходы_Счета;
	
	Элементы.ПервичныеДокументыВремяСчета.Доступность = РедактированиеФинансов_Расходы_Счета 
														и НЕ (Объект.ПредъявленСчет 
																И Объект.СпособЗачетаАвансовОЗ = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.Автоматически") 
																И НачалоДня(Объект.ДатаСчета)=НачалоДня(Объект.Дата));

	Элементы.СрокОплаты.Доступность =  РедактированиеФинансов_Расходы_Счета И Объект.ПредъявленСчет И СрокОплатыДоступен; 	
	Элементы.ПервичныеДокументыУстановитьСрокОплаты.Доступность = РедактированиеФинансов_Расходы_Счета И Объект.ПредъявленСчет И СрокОплатыДоступен; 
	
	Элементы.ПервичныеДокументыУстановитьСрокОплаты.Видимость = РедактированиеФинансов_Расходы_Счета И НЕ Объект.Ссылка.Пустая(); 
	Элементы.СпособЗачетаАвансовОЗ.Видимость = РедактированиеФинансов_Расходы_Счета И Объект.ПредъявленСчет И ОперативныйУчет;
	
	Если ВалютаРегламентированногоУчетаРубль тогда
		СтруктураПараметровБухУчета = Новый Структура;
		СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
		СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
		
		ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);
		
		Элементы.ПредъявленАкт.Доступность	= ВалютаРегламентированногоУчетаРубль и НЕ Объект.Корректировка;
	
		// акт
		Элементы.НомерАкта.ТолькоПросмотр	= НЕ РедактированиеФинансов_Расходы_Акты И НЕ Объект.ПредъявленАкт;
		Элементы.ДатаАкта.ТолькоПросмотр 	= НЕ РедактированиеФинансов_Расходы_Акты И НЕ Объект.ПредъявленАкт;
		Элементы.ПервичныеДокументыВремяАкта.Доступность = РедактированиеФинансов_Расходы_Акты И Объект.ПредъявленАкт;
		Элементы.ПервичныеДокументыДатаАкта.Доступность  = РедактированиеФинансов_Расходы_Акты И Объект.ПредъявленАкт;
		Элементы.СпособЗачетаАвансов.Видимость = РедактированиеФинансов_Расходы_Акты И Объект.ПредъявленАкт И ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет И НЕ Объект.Корректировка;
		Элементы.Счет.ТолькоПросмотр = НЕ РедактированиеФинансов_Расходы_Акты И НЕ Объект.ПредъявленАкт;
		Элементы.СписокСчетов.Доступность = РедактированиеФинансов_Расходы_Акты И Объект.ПредъявленАкт;
		Элементы.ГруппаАктирование.Видимость = РедактированиеФинансов_Расходы_Акты И НЕ Объект.ПредъявленСчет;
		Элементы.Счет.Видимость = РедактированиеФинансов_Расходы_Акты И НЕ Объект.СписокСчетов; 
		
		//AFR23-3305
		Элементы.ПервичныеДокументыПодборСчетов.Видимость = Не Объект.Корректировка;
		//AFR23-3305
		
		Элементы.ЭтоУниверсальныйДокумент.Доступность = РедактированиеФинансов_Расходы_Акты И Объект.ПредъявленАкт;
		
		// с/ф 
		Если Объект.КорректируемыйДокумент.ПредъявленСФ Тогда
			Элементы.ПредъявленСФ.Доступность = Ложь;
		Иначе
			Элементы.ПредъявленСФ.Доступность = Объект.ПредъявленАкт и РедактированиеФинансов_Расходы_Акты и Не Объект.Корректировка;
		КонецЕсли;
		
		Элементы.НомерСФ.ТолькоПросмотр = Не РедактированиеФинансов_Расходы_Акты И НЕ Объект.ПредъявленСФ;
		Элементы.ДатаСФ.ТолькоПросмотр 	= Не РедактированиеФинансов_Расходы_Акты И НЕ Объект.ПредъявленСФ;
		Элементы.ПервичныеДокументыДатаСчетФактуры.Доступность 	= РедактированиеФинансов_Расходы_Акты И Объект.ПредъявленСФ;
		Элементы.Продавец.ТолькоПросмотр 		= Не РедактированиеФинансов_Расходы_Акты;
		Элементы.Продавец.Видимость 			= РедактированиеФинансов_Расходы_Акты И Объект.ПредъявленСФ И НЕ Объект.Корректировка;
		Элементы.КодСпособаПолученияСФ.Видимость 	= РедактированиеФинансов_Расходы_Акты И Объект.ПредъявленСФ;
		
		Элементы.ГруппаДопРеквизитыСчф.Видимость = РедактированиеФинансов_Расходы_Акты И Объект.ПредъявленСФ И НЕ Объект.Корректировка;
		// --- 
		Элементы.КодВидаОперации.Видимость = РедактированиеФинансов_Расходы_Акты и Объект.ПредъявленСФ; // И НЕ Объект.Корректировка;
		Элементы.КодВидаОперации.Доступность = РедактированиеФинансов_Расходы_Акты;
		
		Элементы.ПервичныеДокументыВремяАкта.Доступность = РедактированиеФинансов_Расходы_Акты и
															НЕ ( Объект.ПредъявленАкт 
																 И Объект.СпособЗачетаАвансов = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.Автоматически")
																 И НачалоДня(Объект.ДатаАкта)=НачалоДня(Объект.Дата));
		
		Элементы.ГруппаПолучение.Видимость = Объект.ПредъявленСФ;
		
		Элементы.НДСПредъявленКВычету.Видимость  = УчетНДСКлиентСервер.Версия(Объект.Дата) > 1 
													И НЕ Объект.Корректировка
													И Не РаздельныйУчетНДСНаСчете19
													И Не ПоставщикРезидентТаможенногоСоюза
													И ПлательщикНДС
													И НЕ НДСИсчисляетсяНалоговымАгентом;

		
	КонецЕсли;
	
	// план оплаты
	Элементы.ПланОплаты.Видимость = РедактированиеФинансов_Расходы_Счета И Объект.ПредъявленСчет И ОперативныйУчет И ПланОплатыДоступен;
	
	// срок оплаты
	Элементы.СрокОплаты.Видимость = РедактированиеФинансов_Расходы_Счета И  Объект.ПредъявленСчет И СрокОплатыДоступен; 
	Элементы.ПервичныеДокументыУстановитьСрокОплаты.Видимость = РедактированиеФинансов_Расходы_Счета И  Объект.ПредъявленСчет И СрокОплатыДоступен И НЕ  Объект.Корректировка;
	
	Элементы.УслугиГруппаСчет.Видимость = Объект.СписокСчетов; 
	
	//AFR23-3305
	Элементы.УслугиКорректировкаГруппаСчет.Видимость = Объект.СписокСчетов и Объект.Корректировка; 
	//AFR23-3305
	
	Если Объект.ПредъявленСчет И НЕ Объект.ПредъявленАкт Тогда
		Элементы.ГруппаКонтрольнаяСумма.Доступность = РедактированиеФинансов_Расходы_Счета;
	Иначе
		Элементы.ГруппаКонтрольнаяСумма.Доступность = РедактированиеФинансов_Расходы_Акты;
	КонецЕсли; 

	//Исправления
	Элементы.НомерИсправления.Доступность 			= РедактированиеФинансов_Расходы_Акты И Объект.ПредъявленСФ;
	//Исправления
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	ОбновитьНомераДокументовНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПродавецПриИзменении(Элемент)
	
	ОбновитьНомераДокументовНаСервере();

КонецПроцедуры

#КонецОбласти

//Исправления
&НаКлиенте
Процедура ВидОперацииКорректировкиПриИзменении(Элемент)
	
	ВидОперацииКорректировкиПриИзмененииНаСервере();
	
КонецПроцедуры   

&НаСервере
Процедура ВидОперацииКорректировкиПриИзмененииНаСервере()
	
	Если Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") Тогда
		Объект.НомерИсправления = 0;
	Иначе
		ИсправлениеПолучитьНомерНаСервере();
	КонецЕсли;   
	
	ОбновитьНомераДокументовНаСервере();
	
	УстановитьВидимостьЭлементовИсправления();
	
КонецПроцедуры

&НаСервере
Процедура ИсправлениеПолучитьНомерНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_РасходыПоГрузоперевозке.Ссылка) КАК Ссылка
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке КАК CW_РасходыПоГрузоперевозке
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозке.КорректируемыйДокумент = &КорректируемыйДокумент
	               |	И CW_РасходыПоГрузоперевозке.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("КорректируемыйДокумент", Объект.КорректируемыйДокумент);
	Запрос.УстановитьПараметр("Ссылка",	Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ВсегоИсправлений = 0;
	Если Выборка.Следующий() Тогда
		ВсегоИсправлений = Выборка.Ссылка;
	КонецЕсли;
	
	ВсегоИсправлений = ВсегоИсправлений + 1;
	
	Объект.НомерСФ = Объект.КорректируемыйДокумент.НомерСФ; 
	Объект.ДатаСФ  = ТекущаяДата(); 
	
	Объект.НомерИсправления  = ВсегоИсправлений; 
	
	ОбновитьНомераДокументовНаСервере();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовИсправления()

	Элементы.ГруппаОперацияИсправления.Видимость  	= Объект.Корректировка;
	Элементы.НомерИсправления.Видимость 			= Объект.Корректировка и Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки"); 
	
	ПоказатьПередКорректировкой = НужноПоказатьПередКорректировкой();
	
	Элементы.УслугиКорректировкаНадписьПередКорректировкой.Видимость		= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаПредставление_ПередКорректировкой.Видимость	= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаКоличество_ПередКорректировкой.Видимость	= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаЦена_ПередКорректировкой.Видимость 			= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаСумма_ПередКорректировкой.Видимость 		= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаСтавкаНДС_ПередКорректировкой.Видимость 	= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаНДС_ПередКорректировкой.Видимость 			= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаВсего_ПередКорректировкой.Видимость 		= ПоказатьПередКорректировкой;  
	
	Элементы.УслугиКорректировкаВсего_ПередКорректировкойРег.Видимость 		= ПоказатьПередКорректировкой и Объект.ПоказатьРубли;  
	Элементы.УслугиКорректировкаНДС_ПередКорректировкойРег.Видимость 		= ПоказатьПередКорректировкой и Объект.ПоказатьРубли;  
	Элементы.УслугиКорректировкаСумма_ПередКорректировкойРег.Видимость 		= ПоказатьПередКорректировкой и Объект.ПоказатьРубли;  
	Элементы.УслугиКорректировкаЦена_ПередКорректировкойРег.Видимость 		= ПоказатьПередКорректировкой и Объект.ПоказатьРубли;  
	
	Элементы.УслугиКорректировкаПокупатель_ПередКорректировкой.Видимость 			= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаДоговорПокупателя_ПередКорректировкой.Видимость		= ПоказатьПередКорректировкой;
	Элементы.УслугиКорректировкаПриложениеКДоговору_ПередКорректировкой.Видимость 	= ПоказатьПередКорректировкой;
	
	Элементы.УслугиКорректировкаСтавкаНДС.Доступность = Не (Объект.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение")); 	

КонецПроцедуры      

&НаСервере
Функция НужноПоказатьПередКорректировкой() 

	Возврат CW_Документы.НужноПоказатьПередКорректировкой(Объект)
	
КонецФункции

&НаКлиенте
Процедура НомерИсправленияПриИзменении(Элемент)
	ОбновитьНомераДокументовНаСервере();
КонецПроцедуры
//Исправления

&НаКлиенте
Процедура УслугиПередУдалением(Элемент, Отказ)
	
	Если ЗапрашиватьПодтверждениеПриУдаленииСтрок Тогда
		
		Отказ = Истина;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("мИдентифкаторы", Элементы.Услуги.ВыделенныеСтроки);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУдаленииСтроки", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, "Удалить выделенные строки?", Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУдаленииСтроки(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ПродолжитьУдалениеНаСервере(ДополнительныеПараметры.мИдентифкаторы);
	
КонецПроцедуры

&наСервере
Процедура ПродолжитьУдалениеНаСервере(мИдентифкаторы)
	
	Для каждого ИдентификаторСтроки из мИдентифкаторы Цикл
		УдаляемаяСтрока = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		Объект.Услуги.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиКорректировкаДоговорПокупателяПриИзменении(Элемент)
	
	CW_УчетПриложенийДоговоровКлиентСервер.ПриИзмененеииДоговораВСтрокеТабличнойЧасти(ЭтаФорма, "УслугиКорректировка", "ДоговорПокупателя");

КонецПроцедуры

&НаКлиенте
Процедура СуммаПоПервичномуДокументуПриИзменении(Элемент)
	ОбновитьИтогиПоУслугам();
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПодбор(Команда)
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", 			Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", 	Ложь);
	
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуНаСервере(ВыбранноеЗначение)
	
	НоваяСтрока = Объект.Услуги.Добавить();
	НоваяСтрока.Грузоперевозка = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если  ИсточникВыбора.ИмяФормы = "Справочник.CW_Грузоперевозки.Форма.ФормаСписка" Тогда
		ДобавитьСтрокуНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

//ГрупповоеКопирование
&НаКлиенте
Процедура ГрупповоеКопирование(Команда)
	ВыделенныеСтроки = Элементы.Услуги.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Тогда
		ПоказатьПредупреждение(, "Не выбранони одной строки для копирования",60);
		Возврат;
	КонецЕсли;
	
	ГрупповоеКопированиеНаСервере(ВыделенныеСтроки);
КонецПроцедуры  

&НаСервере
Процедура ГрупповоеКопированиеНаСервере(ВыделенныеСтроки)
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		
		СтрокаУслуги = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		НоваяСтрока = Объект.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуги);
		
	КонецЦикла;
	
КонецПроцедуры
//ГрупповоеКопирование


&НаКлиенте
Процедура РассчитатьПлановуюДатуОплаты(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Документ не записан!");
		Возврат;
	КонецЕсли;
	
	Успешно = РассчитатьПлановуюДатуОплатыНаСервере();
	Если не Успешно Тогда
		ПоказатьПредупреждение(,"Не удалось получить срок оплаты документа");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РассчитатьПлановуюДатуОплатыНаСервере(ПроверитьНаличиеПлановойдаты = ложь, ПоказыватьОповещения = истина)
	
	ПлатежныйКалендарь 	= CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "ПлатежныйКалендарь");
	Если Не ЗначениеЗаполнено(ПлатежныйКалендарь)  Тогда  
		Если ПоказыватьОповещения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В учетной политике организации не выбран платежный календарь!");
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;   
	
	Если ПроверитьНаличиеПлановойдаты Тогда
		ДанныеПланаОплаты = CW_Документы.ПолучитьПланОплаты(Объект.Ссылка);
		Если ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПлановаяДата = CW_Документы.ПолучитьПлановыйСрокОплаты(Объект.Ссылка, ПлатежныйКалендарь);
	Если ПлановаяДата = Неопределено Тогда
		Если ПоказыватьОповещения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен платежный календарь!");
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Если ПлановаяДата = Дата(1,1,1) Тогда
		//Ничего делать не нужно
		Возврат Истина;
	КонецЕсли;
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("Счет", 			Объект.Ссылка);
	СтруктураПараметров.Вставить("ПлановаяДата", 	ПлановаяДата);
	СтруктураПараметров.Вставить("Описание", 		"");
	
	РегистрыСведений.CW_ПланОплатыВходящихСчетов.ЗаписатьПланОплатыДокумента(СтруктураПараметров);

	УстановитьОписаниеПланОплаты();

	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьОстатокЗадолженностиПоДокументу(Счет)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОперативнаяКредиторскаяЗадолженность.Счет КАК Счет,
	               |	ОперативнаяКредиторскаяЗадолженность.Всего_ВалютаОстаток КАК Всего_ВалютаОстаток
	               |ИЗ
	               |	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Остатки(&ДатаСреза, Счет = &Счет) КАК ОперативнаяКредиторскаяЗадолженность
	               |ГДЕ
	               |	ОперативнаяКредиторскаяЗадолженность.Всего_ВалютаОстаток <> 0";
	
	Запрос.УстановитьПараметр("ДатаСреза", 	ТекущаяДата());
	Запрос.УстановитьПараметр("Счет", 		Счет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Функция ПолучитьОграничениеУслугПоНоменклатуре(ПорядокОтражения=Неопределено)

	ИспользуетсяОгранчиениеУслуг = Ложь; 
	
	Если ОграничиватьУслугиПоДоговорам Тогда
		
		ИспользуетсяОгранчиениеУслуг = ?(ЗначениеЗаполнено(Объект.Договор), Объект.Договор.ОграничиватьНоменклатуру, Ложь);
		Если НеОграничиватьУслугиПоПеревыставлению и  ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление") Тогда
			ИспользуетсяОгранчиениеУслуг = Ложь;	
		КонецЕсли;    
		
	КонецЕсли;
	
	Возврат ИспользуетсяОгранчиениеУслуг;
	
КонецФункции



&НаКлиенте
Процедура ПоказатьРублиПриИзменении(Элемент)
	ПоказатьРублиПриИзмененииНаСервере();   
КонецПроцедуры     

&НаСервере
Процедура ПоказатьРублиПриИзмененииНаСервере() 
	
	Для Каждого СтрокаТаблицы из Объект.Услуги Цикл
		ПересчитатьВРегламентированнуюВалютуСтрокуНаСерере(СтрокаТаблицы.ПолучитьИдентификатор(), Не Объект.ПоказатьРубли);
	КонецЦикла; 
	
	УстановитьВидимостьЭлементовРег();
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовРег()
	
	Элементы.УслугиГруппаСуммыРег.Видимость 		= Объект.ПоказатьРубли и Не Объект.Корректировка;    
	Элементы.УслугиКорректировкаГруппаРег.Видимость = Объект.ПоказатьРубли и Объект.Корректировка;    
	
КонецПроцедуры



&НаКлиенте
Процедура УслугиЦенаРегПриИзменении(Элемент)
	 ТекущаяСтрока = Элементы.Услуги.ТекущаяСтрока;
	 ПересчитатьСтрокуРубНаСерере(ТекущаяСтрока, "ЦенаРег");   
КонецПроцедуры
 
&НаКлиенте
Процедура УслугиСуммаРегПриИзменении(Элемент)
	 ТекущаяСтрока = Элементы.Услуги.ТекущаяСтрока;
	 ПересчитатьСтрокуРубНаСерере(ТекущаяСтрока, "СуммаРег");   
КонецПроцедуры

&НаКлиенте
Процедура УслугиНДСРегПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Услуги.ТекущаяСтрока;
	ПересчитатьСтрокуРубНаСерере(ТекущаяСтрока, "НДСРег");
КонецПроцедуры

 &НаКлиенте
 Процедура УслугиВсегоРегПриИзменении(Элемент)  
	 ТекущаяСтрока = Элементы.Услуги.ТекущаяСтрока;
	 ПересчитатьСтрокуРубНаСерере(ТекущаяСтрока, "ВсегоРег");
КонецПроцедуры      

//Корректировка
&НаКлиенте
Процедура УслугиКорректировкаЦенаРегПриИзменении(Элемент)
	 ТекущаяСтрока = Элементы.УслугиКорректировка.ТекущаяСтрока;
	 ПересчитатьСтрокуРубНаСерере(ТекущаяСтрока, "ЦенаРег");   
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаСуммаРегПриИзменении(Элемент)
	 ТекущаяСтрока = Элементы.УслугиКорректировка.ТекущаяСтрока;
	 ПересчитатьСтрокуРубНаСерере(ТекущаяСтрока, "СуммаРег");   
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаНДСРегПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.УслугиКорректировка.ТекущаяСтрока;
	ПересчитатьСтрокуРубНаСерере(ТекущаяСтрока, "НДСРег");
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаВсегоРегПриИзменении(Элемент)
	 ТекущаяСтрока = Элементы.УслугиКорректировка.ТекущаяСтрока;
	 ПересчитатьСтрокуРубНаСерере(ТекущаяСтрока, "ВсегоРег");
КонецПроцедуры
//Корректировка


&НаСервере
Процедура ПересчитатьСтрокуРубНаСерере(ИдентификаторСтроки, ИмяПоля) 
	
	ТекущаяСтрока 	= Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки); 
	СтавкаНДС 		= CW_Финансы.ПолучитьСтавкуНДС(ТекущаяСтрока.СтавкаНДС);
	
	Если ИмяПоля = "ЦенаРег" Тогда        
		
		Если Объект.ЦенаСНДС Тогда
			НДСВЦене 				= CW_Финансы.РассчитатьСуммуНДС(ТекущаяСтрока.ЦенаРег, Истина, Объект.ЦенаСНДС, СтавкаНДС); 
			ТекущаяСтрока.СуммаРег 	= ТекущаяСтрока.Количество * (ТекущаяСтрока.ЦенаРег - НДСВЦене); 
		Иначе
			ТекущаяСтрока.СуммаРег 	= ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаРег; 
		КонецЕсли;
		
		ТекущаяСтрока.НДСРег 	= CW_Финансы.РассчитатьСуммуНДС(ТекущаяСтрока.СуммаРег, Истина, Ложь, СтавкаНДС);
		ТекущаяСтрока.ВсегоРег 	= ТекущаяСтрока.СуммаРег + ТекущаяСтрока.НДСРег;
		
	КонецЕсли;
	
	Если ИмяПоля = "СуммаРег" Тогда      
		ТекущаяСтрока.НДСРег 	= CW_Финансы.РассчитатьСуммуНДС(ТекущаяСтрока.СуммаРег, Истина, ложь, СтавкаНДС);
		
		Если Объект.ЦенаСНДС Тогда  
			ТекущаяСтрока.ВсегоРег 	= ТекущаяСтрока.СуммаРег + ТекущаяСтрока.НДСРег;
			ТекущаяСтрока.ЦенаРег 	= ?(ТекущаяСтрока.Количество = 0, 0, ТекущаяСтрока.ВсегоРег / ТекущаяСтрока.Количество);
		Иначе
			ТекущаяСтрока.ЦенаРег 	= ?(ТекущаяСтрока.Количество = 0, 0, ТекущаяСтрока.СуммаРег / ТекущаяСтрока.Количество);
			ТекущаяСтрока.ВсегоРег 	= ТекущаяСтрока.СуммаРег + ТекущаяСтрока.НДСРег;
		КонецЕсли;
		
	КонецЕсли;  
	
	Если ИмяПоля = "НДСРег" Тогда   
		ТекущаяСтрока.СуммаРег 	= ТекущаяСтрока.ВсегоРег - ТекущаяСтрока.НДСРег;
		Если Объект.ЦенаСНДС Тогда  
			ТекущаяСтрока.ЦенаРег 	= ?(ТекущаяСтрока.Количество = 0, 0, ТекущаяСтрока.ВсегоРег / ТекущаяСтрока.Количество);
		Иначе
			ТекущаяСтрока.ЦенаРег 	= ?(ТекущаяСтрока.Количество = 0, 0, ТекущаяСтрока.СуммаРег / ТекущаяСтрока.Количество);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля = "ВсегоРег" Тогда 
		ТекущаяСтрока.НДСРег 	= CW_Финансы.РассчитатьСуммуНДС(ТекущаяСтрока.ВсегоРег, Истина, Истина, СтавкаНДС);
		ТекущаяСтрока.СуммаРег 	= ТекущаяСтрока.ВсегоРег - ТекущаяСтрока.НДСРег; 
		
		Если Объект.ЦенаСНДС Тогда  
			ТекущаяСтрока.ЦенаРег 	= ?(ТекущаяСтрока.Количество = 0, 0, ТекущаяСтрока.ВсегоРег / ТекущаяСтрока.Количество);
		Иначе
			ТекущаяСтрока.ЦенаРег 	= ?(ТекущаяСтрока.Количество = 0, 0, ТекущаяСтрока.СуммаРег / ТекущаяСтрока.Количество);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры 

//Взаиморасчеты по документу
&НаКлиенте
Процедура Команда_ВзаиморасчетыПоДокументу(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда   
		Возврат;
	КонецЕсли;   
	
	ВариантАналитикиКорректировки = ПолучитьЗначениеУчетнойПолитики();
	
	ДокументОтчета = ПолучитьДокументОтчета(Объект.Ссылка, ВариантАналитикиКорректировки);
	Если ДокументОтчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	CW_ВзаиморасчетыПоДокументуКлиент.ОткрытьФормуОтчетаВзаиморасчетыПоДокументу(ЭтаФорма, ДокументОтчета, "КРЕДИТОРСКАЯ");
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьДокументОтчета(ОбъектСсылка, ВариантАналитикиКорректировки) 
	
	Если Не ОбъектСсылка.Корректировка Тогда
		Возврат ОбъектСсылка;
	КонецЕсли;     
	
	Если ВариантАналитикиКорректировки = 1 Тогда
		Возврат ОбъектСсылка;
	КонецЕсли;
	                                       
	Если Объект.КорректируемыйДокумент.Корректировка Тогда
		Возврат ПолучитьДокументОтчета(Объект.КорректируемыйДокумент, ВариантАналитикиКорректировки); 
	КонецЕсли;
	
	Возврат  Объект.КорректируемыйДокумент;
	
КонецФункции  

&НаСервере
Функция ПолучитьЗначениеУчетнойПолитики() 
	
	//корректируемый документ(0), документ корректировки(1)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УчетнаяПолитикаСрезПоследних.АналитикаКорректировкиОперативнойЗадолженности КАК АналитикаКорректировки
	               |ИЗ
	               |	РегистрСведений.CW_УчетнаяПолитика.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК CW_УчетнаяПолитикаСрезПоследних"; 
	
	Запрос.УстановитьПараметр("ДатаСреза", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.АналитикаКорректировки;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
//Взаиморасчеты по документу
 
//Заполнить Из Файла Excel
&НаКлиенте
Процедура ЗаполнитьИзФайлаExcel(Команда)
	
	ОткрытьФормуЗагрузкиДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗагрузкиДокумента(ВнешниеДанные = Неопределено, ОчиститьТаблицу = Ложь) Экспорт
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Дата", 		Объект.Дата);
	ДанныеДокумента.Вставить("Организация", Объект.Организация); 
	ДанныеДокумента.Вставить("ЦенаСНДС", 	Объект.ЦенаСНДС); 
	
	АдресТаблицыДокумента = ПолучитьАдресТаблицыДокумента();
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ДанныеДокумента", 			ДанныеДокумента);
	ПараметрыОбработки.Вставить("АдресТаблицыДокумента", 	АдресТаблицыДокумента);  
	ПараметрыОбработки.Вставить("ВнешниеДанные", 			ВнешниеДанные);  
	ПараметрыОбработки.Вставить("Контрагент", 				Объект.Контрагент);  
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("АдресТаблицыДокумента", 	АдресТаблицыДокумента);
	ДополнительныеПараметры.Вставить("ОчиститьТаблицу", 		ОчиститьТаблицу);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьЗаполнениеТаблицы", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.CW_ЗагрузкаТабличнойЧастиДокументаРасходыПоГрузоперевозкеИзФайла.Форма", ПараметрыОбработки, ЭтаФорма,,,,Оповещение);

КонецПроцедуры      

&НаСервере
Функция ПолучитьАдресТаблицыДокумента()
	
	Возврат ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
КонецФункции   

&НаКлиенте
Процедура ЗавершитьЗаполнениеТаблицы(Результат, ДополнительныеПараметры) Экспорт
	
	ЗавершитьЗаполнениеТаблицыНаСервере(ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьЗаполнениеТаблицыНаСервере(ДополнительныеПараметры)
	
	ТаблицаДокумента = ПолучитьИзВременногоХранилища(ДополнительныеПараметры.АдресТаблицыДокумента);
	Если ТаблицаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	КэшНеЗаменятьПредставлениеНоменклатуры 							= НеЗаменятьПредставлениеНоменклатуры;
	КэшРазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки 	= РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки;	
	РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки 		= Ложь;
	
	Если ДополнительныеПараметры.ОчиститьТаблицу Тогда
		Объект.Услуги.Очистить();
	КонецЕсли;
	
	Для Каждого СтрокаУслуг из ТаблицаДокумента Цикл    
		
		НоваяСтрока =  Объект.Услуги.Добавить(); 
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУслуг);
		Если Не ПустаяСтрока(СтрокаУслуг.Представление) Тогда
			НеЗаменятьПредставлениеНоменклатуры = Истина;
		Иначе
			НеЗаменятьПредставлениеНоменклатуры = КэшНеЗаменятьПредставлениеНоменклатуры;
		КонецЕсли; 
		
		ИдентификаторСтроки = НоваяСтрока.ПолучитьИдентификатор();
		
		_УслугиГрузоперевозкаПриИзменении(ИдентификаторСтроки);
		
	КонецЦикла;
	
	НеЗаменятьПредставлениеНоменклатуры = КэшНеЗаменятьПредставлениеНоменклатуры;
	РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки = КэшРазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки;	
	
КонецПроцедуры
//Заполнить Из Файла Excel

//Подсистема.CW_ЭлектронныйОбменДанными
&НаКлиенте
Процедура ПроверитьКонтрагентаПоБазеЛКК() 
	
	ИННКонтрагента = ПолучитьИННКонтрагента(Объект.Контрагент);  
	
	CW_ЭлектронныйОбменДаннымиКлиент.ПроверитьКонтрагентаПоБазеЛКК(ЭтаФорма, ИННКонтрагента);
	
КонецПроцедуры   

&НаКлиенте
Процедура ГипрессылкаПолучитьНажатие(Элемент)

	CW_ЭлектронныйОбменДаннымиКлиент.ПолучитьДокументПоставщика(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ГипрессылкаПодробнееНажатие(Элемент)
	
	CW_ЭлектронныйОбменДаннымиКлиент.ОбработатьСсылкуПодробнее();

КонецПроцедуры

&НаКлиенте
Процедура ОбменДокументамиЗакрыть(Команда)
	
	CW_ЭлектронныйОбменДаннымиКлиент.СкрытьГруппуОбменДокументами(ЭтаФорма);  
	
КонецПроцедуры
//--Подсистема.CW_ЭлектронныйОбменДанными

//Подсистема.Бюджетирование 
&НаКлиенте
Процедура УслугиСтатьяБюджетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;   
	
	ТекущаяСтрока = Элементы.Услуги.ТекущаяСтрока;
	
	ПараметрыФормыВыбора = ПолучитьПараметрыФормыВыбора(ТекущаяСтрока);
		
    ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаВыбора", ПараметрыФормыВыбора, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаСтатьяБюджетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	
	ТекущаяСтрока = Элементы.УслугиКорректировка.ТекущаяСтрока;
	
	ПараметрыФормыВыбора = ПолучитьПараметрыФормыВыбора(ТекущаяСтрока);
		
    ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаВыбора", ПараметрыФормыВыбора, Элемент); 

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыВыбора(ТекущаяСтрока)
	
	НастройкиОтбора = CW_Бюджетирование.ПолучитьЗначенияПараметровОтбора("CW_ПараметрыОтбораРасходов");   
	
	СтрокаТекущая 	= Объект.Услуги.НайтиПоИдентификатору(ТекущаяСтрока);   

	ФиксированныеНастройкиОтбора = новый Структура;		
	ФиксированныеНастройкиОтбора.Вставить("Владелец", 				СтрокаТекущая.Грузоперевозка);	
	ФиксированныеНастройкиОтбора.Вставить("ВидСтатьиПланирования", 	ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы"));

	ПользовательскиеНастройкиОтбора = Новый Структура; 
	
	ВерсияБюджета = Константы.CW_ВерсияСтатьиБюджетаДляОтбора.Получить();
	ПользовательскиеНастройкиОтбора.Вставить("ВерсияБюджета", ВерсияБюджета);
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	Для Каждого КлючЗначение из НастройкиОтбора Цикл  
		Если Не КлючЗначение.Значение Тогда
			Продолжить;
		КонецЕсли;   
		
		РеквизитОбъекта = ?(КлючЗначение.Ключ = "СуммаВсего","Всего",КлючЗначение.Ключ);
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта(РеквизитОбъекта, МетаданныеОбъекта) Тогда
			ПользовательскиеНастройкиОтбора.Вставить(КлючЗначение.Ключ, Объект[РеквизитОбъекта]);
		КонецЕсли; 
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТекущая, РеквизитОбъекта) Тогда
			ПользовательскиеНастройкиОтбора.Вставить(КлючЗначение.Ключ, СтрокаТекущая[РеквизитОбъекта]);
		КонецЕсли;   
	КонецЦикла; 
	
	Если НастройкиОтбора["СтатьяИспользуетсяОднократно"] Тогда
		ПользовательскиеНастройкиОтбора.Вставить("ИспользуетсяВДокументах", Ложь);
	КонецЕсли;
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("ДокументДоходов",		Объект.Ссылка);
	ПараметрыФормыВыбора.Вставить("Владелец",				СтрокаТекущая.Грузоперевозка);
	ПараметрыФормыВыбора.Вставить("ВидСтатьиПланироваия",	ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы"));
	ПараметрыФормыВыбора.Вставить("ФиксированныеНастройкиОтбора", 		ФиксированныеНастройкиОтбора);
	ПараметрыФормыВыбора.Вставить("ПользовательскиеНастройкиОтбора", 	ПользовательскиеНастройкиОтбора); 
	
	Возврат ПараметрыФормыВыбора;	
	
КонецФункции


&НаКлиенте
Процедура БюджетЗаполнитьСтатьи(Команда)

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПолученияСтатейБюджета", ЭтотОбъект); 
	
	CW_БюджетированиеКлиент.ЗаполнитьСтатьиБюджета(ЭтаФорма, ОповещениеОЗавершении);
	
КонецПроцедуры 

&НаКлиенте 
Процедура ПослеПолученияСтатейБюджета(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		ПослеПолученияСтатейБюджетаНаСервере(РезультатВыполнения.АдресРезультата);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка при подборе статей бюджета");  
		
	КонецЕсли;  
	
КонецПроцедуры  

&НаСервере
Процедура ПослеПолученияСтатейБюджетаНаСервере(АдресРезультата) 
	
	ТаблцицаСтатейБюджета = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(ТаблцицаСтатейБюджета) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	//переносим в документ
	Для Каждого СтрокаТаблицы из ТаблцицаСтатейБюджета Цикл
		СтрокаУслуги = Объект.Услуги.НайтиПоИдентификатору(СтрокаТаблицы.ИдентификаторСтроки);
		СтрокаУслуги.СтатьяБюджета = СтрокаТаблицы.СтатьяБюджета;
	КонецЦикла;
	
КонецПроцедуры  


&НаКлиенте
Процедура БюджетЗаполнитьСтатьиСОтбором(Команда)
	
	ПараметрыПодбора = ПолучитьПараметрыПодбораСтатейБюджета(Элементы.Услуги.ВыделенныеСтроки); 
	Если ПараметрыПодбора = Неопределено Тогда
		ПоказатьПредупреждение(,"Для выделенных строк уже указаны статьи бюджета!"); 
		Возврат;
	КонецЕсли; 
	
	CW_ЗаполнениеДокументовКлиент.ПередНачаломЗаполненияДокумента(ПараметрыПодбора);
	
КонецПроцедуры   

&НаКлиенте
Функция ПолучитьПараметрыПодбораСтатейБюджета(Знач ВыделенныеСтроки)
	
	СписокГрузоперевозок = Новый СписокЗначений;
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);   
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Грузоперевозка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СписокГрузоперевозок.НайтиПоЗначению(СтрокаТаблицы.Грузоперевозка) = Неопределено Тогда
			СписокГрузоперевозок.Добавить(СтрокаТаблицы.Грузоперевозка);
		КонецЕсли;
	КонецЦикла;  
	
	Если СписокГрузоперевозок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяТабличнойЧасти = "Услуги";
	
	ДополлнительныеПараметры = Новый Структура;
	ДополлнительныеПараметры.Вставить("ИмяТабличнойЧасти", 	ИмяТабличнойЧасти);
	ДополлнительныеПараметры.Вставить("ВыделенныеСтроки",	ВыделенныеСтроки);
	
  	Оповещение 	= Новый ОписаниеОповещения("ЗаполнитьПодобранныеСтатьиБюджета", ЭтотОбъект, ДополлнительныеПараметры);
	
	ПараметрыЗаполнения = CW_ЗаполнениеДокументовКлиент.НоваяСтруктураПараметровЗаполнения(); 
	
	ПараметрыЗаполнения.Отбор.Вставить("Организация", 	Объект.Организация);
	ПараметрыЗаполнения.Отбор.Вставить("ВидСтатьи", 	ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы"));
	ПараметрыЗаполнения.Отбор.Вставить("Владелец", 		СписокГрузоперевозок);

	ПараметрыЗаполнения.ПустаяСсылка 			= ПредопределенноеЗначение("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ПустаяСсылка");
	ПараметрыЗаполнения.Форма 					= ЭтаФорма;
	ПараметрыЗаполнения.ИмяТабличнойЧасти 		= ИмяТабличнойЧасти;
	ПараметрыЗаполнения.ИмяМакета 				= "СхемаПодбораСтатейБюджета";
	ПараметрыЗаполнения.Оповещение 				= Оповещение; 
	ПараметрыЗаполнения.ОчищатьТабличнуюЧасть	= ложь; 
	
	Возврат ПараметрыЗаполнения;  
	
КонецФункции     

&НаКлиенте
Процедура ЗаполнитьПодобранныеСтатьиБюджета(Результат, ДополлнительныеПараметры) Экспорт
	
	Если Результат = Неопределено 
		или Не ЭтоАдресВременногоХранилища(Результат) Тогда
		Модифицированность = Ложь;
		Возврат;
	КонецЕсли;
	
	РезультатЗаполнения = ЗаполнитьПодобранныеСтатьиБюджетаНаСервере(Результат, ДополлнительныеПараметры);
	
	Если Не ПустаяСтрока(РезультатЗаполнения) Тогда
		ПоказатьПредупреждение(, РезультатЗаполнения);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ЗаполнитьПодобранныеСтатьиБюджетаНаСервере(АдресТаблицы, ДополлнительныеПараметры)  
	
	ТаблицаСтатейБюджета = ПолучитьИзВременногоХранилища(АдресТаблицы);
	Если ТипЗнч(ТаблицаСтатейБюджета) = Тип("ТаблицаЗначений") Тогда 
		Если ТаблицаСтатейБюджета.Количество() = 0 Тогда
			Возврат "Не удалось получить статьи бюджета!";
		КонецЕсли;  
		
		Для Каждого ИдентификаторСтроки из ДополлнительныеПараметры.ВыделенныеСтроки Цикл
			СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки); 
			
			Отбор = Новый Структура;
			Отбор.Вставить("Владелец", СтрокаТаблицы.Грузоперевозка);
			
			НайденныеСтроки = ТаблицаСтатейБюджета.НайтиСтроки(Отбор);   
			Если НайденныеСтроки.Количество() = 1 Тогда
				СтрокаТаблицы.СтатьяБюджета = НайденныеСтроки[0].СтатьяБюджета;	
			КонецЕсли;
			
		КонецЦикла;
		
		Модифицированность = Истина;
		
	Иначе
		Возврат "Не удалось получить данные для заполнения статей бюджета!";
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции 



&НаКлиенте
Процедура БюджетСоздатьСтатьи(Команда)  
	
	ПараметрыСтатейБюджета = ПолучитьПараметрыСозданияСтатейБюджета(Элементы.Услуги.ВыделенныеСтроки); 
	Если ПараметрыСтатейБюджета = Неопределено Тогда
		ПоказатьПредупреждение(,"Для выделенных строк уже указаны статьи бюджета!");
		Возврат;
	КонецЕсли;

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьСозданиеСтатейБюджета", ЭтотОбъект, ПараметрыСтатейБюджета);
	ПоказатьВопрос(Оповещение, "Для выделенных строк с незаполненной статьей бюджета будут созданы новые статьи. Продолжить?", Режим, 0);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьПараметрыСозданияСтатейБюджета(Знач ВыделенныеСтроки)
	
	ДанныеОбъекта = Новый Структура("Дата,ДатаКурса,Организация,Контрагент,Договор,ПриложениеКДоговору,Валюта,УЕ_ПользовательскийКурс,УЕ_Кратность,УЕ_Курс");
	
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект); 
	
	Если Объект.ПредъявленАкт Тогда
		ДанныеОбъекта.ДатаКурса = Объект.ДатаАкта;  
	ИначеЕсли Объект.ПредъявленСчет Тогда
		ДанныеОбъекта.ДатаКурса = Объект.ДатаСчета;
	Иначе
		ДанныеОбъекта.ДатаКурса = Объект.Дата;
	КонецЕсли;   
	
	ДанныеСтрок = Новый Массив;
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки); 
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтатьяБюджета) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтроки = Новый Структура("ИдентификаторСтроки,Грузоперевозка,Номенклатура,ПорядокОтражения,Количество,Цена,Сумма,СтавкаНДС,НДС,Всего", ИдентификаторСтроки);
		
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаТаблицы); 
		
		ДанныеСтрок.Добавить(ДанныеСтроки);
	КонецЦикла; 

	Если ДанныеСтрок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСтатейБюджета = Новый Структура;
	ПараметрыСтатейБюджета.Вставить("ДанныеОбъекта",		 ДанныеОбъекта);
	ПараметрыСтатейБюджета.Вставить("ДанныеСтрок", 			 ДанныеСтрок);
	ПараметрыСтатейБюджета.Вставить("ВидСтатьиПланирования", ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы"));
	
	Возврат ПараметрыСтатейБюджета;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьСозданиеСтатейБюджета(Результат, ПараметрыСтатейБюджета) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 
	
	ПослеВыбораВерсииБюджета = Новый ОписаниеОповещения("ПослеВыбораВерсииБюджета", ЭтотОбъект, ПараметрыСтатейБюджета);
	
	ОткрытьФорму("Справочник.CW_ВерсииБюджетов.ФормаВыбора",,ЭтаФорма,,,,ПослеВыбораВерсииБюджета, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораВерсииБюджета(ВерсияБюджета, ПараметрыСтатейБюджета) Экспорт
	
	Если ВерсияБюджета = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	ВыделенныеСтроки = Элементы.Услуги.ВыделенныеСтроки;

	ВладельцыБюжета = ПолучитьМассвВладельцевБюджета(ВыделенныеСтроки);
	Если CW_Бюджетирование.БюджетУтвержден(ВерсияБюджета, ВладельцыБюжета) Тогда
		ПоказатьПредупреждение(,"По заказу (грузоперевозке) заблокирован бюджет! Формирование статей невозможно!");
		Возврат;
	КонецЕсли;

	ПараметрыСтатейБюджета.Вставить("ВерсияБюджета", ВерсияБюджета);
	
	ДопоплнительныеПараметры = Новый Структура;
	ДопоплнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ПослеСозданияСтатейБюджета", ЭтотОбъект, ДопоплнительныеПараметры);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Форма", 					ЭтотОбъект); 
	СтруктураПараметров.Вставить("Оповещение", 				Оповещение); 
	СтруктураПараметров.Вставить("ПараметрыСтатейБюджета", 	ПараметрыСтатейБюджета); 

	CW_БюджетированиеКлиент.СоздатьСтатьиБюжета(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияСтатейБюджета(РезультатВыполнения, ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		ЗаполнитьСтатьиБюджетаВСтроках(РезультатВыполнения.АдресРезультата);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения);  
		
	КонецЕсли; 
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьСтатьиБюджетаВСтроках(АдресРезультата) 
	
	СоответствиеСтатейБюджета = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Для Каждого КлючЗначение из СоответствиеСтатейБюджета Цикл
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(КлючЗначение.Ключ);
		СтрокаТаблицы.СтатьяБюджета = КлючЗначение.Значение;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассвВладельцевБюджета(ВыделенныеСтроки) 
	
	ВладельцыБюжета = Новый Массив;
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл  
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ВладельцыБюжета.Найти(СтрокаТаблицы.Грузоперевозка) = Неопределено Тогда
			ВладельцыБюжета.Добавить(СтрокаТаблицы.Грузоперевозка);
		КонецЕсли; 
		Если ЗначениеЗаполнено(СтрокаТаблицы.Грузоперевозка.Заказ) 
			и ВладельцыБюжета.Найти(СтрокаТаблицы.Грузоперевозка.Заказ) = Неопределено Тогда  
			ВладельцыБюжета.Добавить(СтрокаТаблицы.Грузоперевозка.Заказ);
		Конецесли;
	КонецЦикла;   
	
	Возврат ВладельцыБюжета;
	
КонецФункции
	

&НаКлиенте
Процедура БюджетОбновитьСтатьи(Команда)  
	
	ДанныеСтатейБюджета = ПолучитьПараметрыДляОбновленияСтатейБюджета(Элементы.Услуги.ВыделенныеСтроки);	
	Если ДанныеСтатейБюджета = Неопределено Тогда
		ПоказатьПредупреждение(,"Для выделенных строк не указаны статьи бюджета!");
		Возврат;
	КонецЕсли;        
	
	ДопоплнительныеПараметры = Новый Структура;
	ДопоплнительныеПараметры.Вставить("ДанныеСтатейБюджета", ДанныеСтатейБюджета);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьОбновлениеСтатейБюджета", ЭтотОбъект, ДопоплнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Для статей бюджета выделенных строк будут обновлены реквизиты. Продолжить?", Режим, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбновлениеСтатейБюджета(Результат, ДопоплнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;  

	Оповещение = Новый ОписаниеОповещения("ПослеОбновленияСтатейБюджета", ЭтотОбъект, ДопоплнительныеПараметры);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Форма",				ЭтотОбъект); 
	ПараметрыПроцедуры.Вставить("Оповещение",			Оповещение); 
	ПараметрыПроцедуры.Вставить("ДанныеСтатейБюджета", 	ДопоплнительныеПараметры.ДанныеСтатейБюджета);
	
	CW_БюджетированиеКлиент.ОбновитьСтатьиБюджета(ПараметрыПроцедуры);
	
КонецПроцедуры    

&НаКлиенте
Процедура ПослеОбновленияСтатейБюджета(РезультатВыполнения, ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов")); 
		
		Элементы.Услуги.Обновить();
		
		ПоказатьОповещениеПользователя("Статьи бюджета",,"Обновлены данные статей бюджета");
	
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения);  
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыДляОбновленияСтатейБюджета(Знач ВыделенныеСтроки)
	
	ДанныеСтатейБюджета = Новый Соответствие;
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки); 
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.СтатьяБюджета) Тогда
			Продолжить;
		КонецЕсли;   
		
		ДанныеСтатьи = ДанныеСтатейБюджета.Получить(СтрокаТаблицы.СтатьяБюджета);
		Если ДанныеСтатьи = Неопределено Тогда
			ДанныеСтатьи = Новый Структура("Контрагент,Договор,ПриложениеКДоговору,Валюта,Курс,Кратность,Номенклатура,ПорядокОтражения,СтавкаНДС,Количество,Цена,Сумма,СуммаНДС,СуммаВсего");
		КонецЕсли;
	
		ЗаполнитьЗначенияСвойств(ДанныеСтатьи, СтрокаТаблицы);                     
		
		ДанныеСтатьи.Вставить("Контрагент",Объект.Контрагент);
		ДанныеСтатьи.Вставить("Договор",Объект.Договор);  
		ДанныеСтатьи.Вставить("Валюта",Объект.Валюта);  
		ДанныеСтатьи.Вставить("ПриложениеКДоговору",Объект.ПриложениеКДоговору); 
		ДанныеСтатьи.Вставить("СуммаНДС",СтрокаТаблицы.НДС);
		ДанныеСтатьи.Вставить("СуммаВсего",СтрокаТаблицы.Всего);  
		
		// определим курс и кратность 
		Курс = 1;
		Кратность = 1;   
		ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();  
		Если Объект.Валюта <> ВалютаРегламентированногоУчета Тогда 
			Контракт = ?(ЗначениеЗаполнено(Объект.ПриложениеКДоговору),Объект.ПриложениеКДоговору, Объект.Договор);
			Если Объект.УЕ_ПользовательскийКурс Тогда
				Курс = Объект.УЕ_Курс;
				Кратность = Объект.УЕ_Кратность;
			Иначе
				Если (Объект.ПредъявленАкт) Тогда
					ДатаКурса = Объект.ДатаАкта;
				Иначе
					Если (Объект.ПредъявленСчет) Тогда 
						ДатаКурса = Объект.ДатаСчета;
					Иначе
						ДатаКурса = Объект.Дата;
					КонецЕсли;
				КонецЕсли; 
				СтруктураКурсаВалюты = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,ДатаКурса);
				Курс = СтруктураКурсаВалюты.Курс;
				Кратность = СтруктураКурсаВалюты.Кратность;
			КонецЕсли;
		КонецЕсли;
 		ДанныеСтатьи.Вставить("Курс",Курс);
 		ДанныеСтатьи.Вставить("Кратность",Кратность);
		
		ДанныеСтатейБюджета.Вставить(СтрокаТаблицы.СтатьяБюджета, ДанныеСтатьи);
	КонецЦикла; 

	Если ДанныеСтатейБюджета.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ДанныеСтатейБюджета;
	
КонецФункции                  

&НаКлиенте
Процедура БюджетОчиститьСтатьи(Команда)  
	ВыделенныеСтроки = Элементы.Услуги.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;                                                                                   
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Режим = РежимДиалогаВопрос.ДаНет;                                                            
	Оповещение = Новый ОписаниеОповещения("ПродолжитьОчисткуСтатейБюджетаПоСтрокам", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Статьи бюджета в выделенных строках будут очищены. Продолжить?", Режим, 0);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПродолжитьОчисткуСтатейБюджетаПоСтрокам(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	БюджетОчиститьСтатьиНаСервере(ДополнительныеПараметры.ВыделенныеСтроки);

КонецПроцедуры  

&НаСервере
Процедура БюджетОчиститьСтатьиНаСервере(ВыделенныеСтроки)   
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаТаблицы.СтатьяБюджета = ПредопределенноеЗначение("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ПустаяСсылка");
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОчистка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = ложь;

КонецПроцедуры


//---Подсистема.Бюджетирование