///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет разделы, в которых доступна команда вызова дополнительных обработок.
// В разделы необходимо добавить метаданные тех разделов,
// в которых размещены команды вызова.
// Для начальной страницы указать ДополнительныеОтчетыИОбработкиКлиентСервер.ИмяНачальнойСтраницы.
//
// Параметры:
//   Разделы - Массив из ОбъектМетаданных - метаданные раздела (подсистемы).
//           - Массив из Строка - для начальной страницы.
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	Если ОбщегоНазначенияБП.ЭтоПростойИнтерфейс() Тогда
		// Очистим список от ранее добавленных разделов, т.к. в простом интерфейсе их может не быть
		Разделы.Очистить();
		
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсДокументы);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсДеньги);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсТовары);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсКонтрагенты);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсЛиды);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсИмущество);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсЗарплата);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсСотрудники);
	Иначе
		Разделы.Добавить(Метаданные.Подсистемы.Руководителю);
		Разделы.Добавить(Метаданные.Подсистемы.БанкИКасса);
		Разделы.Добавить(Метаданные.Подсистемы.Продажи);
		Разделы.Добавить(Метаданные.Подсистемы.Покупки);
		Разделы.Добавить(Метаданные.Подсистемы.Склад);
		Разделы.Добавить(Метаданные.Подсистемы.Производство);
		Разделы.Добавить(Метаданные.Подсистемы.ОСИНМА);
		Разделы.Добавить(Метаданные.Подсистемы.ЗарплатаИКадры);
		Разделы.Добавить(Метаданные.Подсистемы.Операции);
		Разделы.Добавить(Метаданные.Подсистемы.Справочники);
	КонецЕсли;
	
КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных отчетов.
// В Разделы необходимо добавить метаданные тех разделов, 
// в которых размещены команды вызова.
// Для начальной страницы указать ДополнительныеОтчетыИОбработкиКлиентСервер.ИмяНачальнойСтраницы.
//
// Параметры:
//   Разделы - Массив из ОбъектМетаданных - метаданные раздела (подсистемы).
//           - Массив из Строка - для начальной страницы.
//
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	Если ОбщегоНазначенияБП.ЭтоПростойИнтерфейс() Тогда
		// Очистим список от ранее добавленных разделов, т.к. в простом интерфейсе их может не быть
		Разделы.Очистить();
		
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсДокументы);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсДеньги);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсТовары);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсКонтрагенты);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсЛиды);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсИмущество);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсЗарплата);
		Разделы.Добавить(Метаданные.Подсистемы.ПростойИнтерфейсСотрудники);
	Иначе
		Разделы.Добавить(Метаданные.Подсистемы.Руководителю);
		Разделы.Добавить(Метаданные.Подсистемы.БанкИКасса);
		Разделы.Добавить(Метаданные.Подсистемы.Продажи);
		Разделы.Добавить(Метаданные.Подсистемы.Покупки);
		Разделы.Добавить(Метаданные.Подсистемы.Склад);
		Разделы.Добавить(Метаданные.Подсистемы.Производство);
		Разделы.Добавить(Метаданные.Подсистемы.ОСИНМА);
		Разделы.Добавить(Метаданные.Подсистемы.ЗарплатаИКадры);
		Разделы.Добавить(Метаданные.Подсистемы.Операции);
		Разделы.Добавить(Метаданные.Подсистемы.Отчеты);
		Разделы.Добавить(Метаданные.Подсистемы.Справочники);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
