
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	ВедетсяУчетШинТранспортногоСредства = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетШинТранспортногоСредства");
	Элементы.ГруппаШиныТС.Видимость		= ВедетсяУчетШинТранспортногоСредства;
	
	ОбновитьДанныеРегистрационныхЗнаков();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеРегистрационныхЗнаков()
	
	РегистрационныйЗнак = РегистрыСведений.CW_РегистрацонныеЗнакиАвтомобилей.ПолучитьПредставлениеГосНомераТранспортногоСредства(Объект.Дата, Объект.ТранспортноеСредство);

КонецПроцедуры


&НаСервере
Процедура ЗаполнитьИнформациюОТранспортномСредстве()
	
	ДатаСреза = ?(ЗначениеЗаполнено(Объект.Дата), Новый Граница(Объект.Дата, ВидГраницы.Исключая), ТекущаяДата());
	
	//---
	//Регистрационный знак
	ОбновитьДанныеРегистрационныхЗнаков();

	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза"			, ДатаСреза);
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.ТранспортноеСредство);
	
	// ---
	// СОСТОЯНИЕ ТС
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СостоянияТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_СостоянияТССрезПоследних.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.CW_СостоянияТС.СрезПоследних(&ДатаСреза, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_СостоянияТССрезПоследних";
	
	
	РезультатЗапросаСостояние = Запрос.Выполнить();
	ВыборкаСостояние = РезультатЗапросаСостояние.Выбрать();
	Если ВыборкаСостояние.Следующий() Тогда
		ТекущееСостояние = ВыборкаСостояние.Состояние;
	КонецЕсли;
	
	// ---
	// Пробег ТС
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПробегТСОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	СУММА(CW_ПробегТСОбороты.ПробегОборот) КАК Пробег,
	               |	СУММА(CW_ПробегТСОбороты.ПробегСГрузомОборот) КАК ПробегСГрузом,
	               |	СУММА(CW_ПробегТСОбороты.ПробегПорожнийОборот) КАК ПробегПорожний
	               |ИЗ
	               |	РегистрНакопления.CW_ПробегТС.Обороты(, , Период, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_ПробегТСОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ПробегТСОбороты.ТранспортноеСредство";
	
	РезультатЗапросаПробегТС = Запрос.Выполнить();
	ВыборкаПробегТС = РезультатЗапросаПробегТС.Выбрать();
	Если ВыборкаПробегТС.Следующий() Тогда
		Пробег 			= ВыборкаПробегТС.Пробег;
		ПробегСГрузом 	= ВыборкаПробегТС.ПробегСГрузом;
		ПробегПорожний 	= ВыборкаПробегТС.ПробегПорожний;
	КонецЕсли;
	
	
	_ОбновитьОстаткиТоплива();
	_ОбновитьШинытранспортногоСредства();

КонецПроцедуры

&НаСервере
Процедура _ОбновитьОстаткиТоплива()
	
	// ---
	// ТОПЛИВО ТС
	ДатаСреза = ?(ЗначениеЗаполнено(Объект.Дата), Новый Граница(Объект.Дата, ВидГраницы.Исключая), ТекущаяДата());
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза"			, ДатаСреза);
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.ТранспортноеСредство);
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ТопливоТСОстатки.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_ТопливоТСОстатки.Топливо КАК Топливо,
	|	СУММА(CW_ТопливоТСОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.CW_ТопливоТС.Остатки(&ДатаСреза, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_ТопливоТСОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ТопливоТСОстатки.ТранспортноеСредство,
	|	CW_ТопливоТСОстатки.Топливо";
	
	РезультатЗапросаТопливоТС = Запрос.Выполнить();
	
	Объект.ТопливоТранспортногоСредства.Загрузить(РезультатЗапросаТопливоТС.Выгрузить());

КонецПроцедуры

&НаСервере
Процедура _ОбновитьШинытранспортногоСредства()
	
	ВедетсяУчетШинТранспортногоСредства = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетШинТранспортногоСредства");
	
	Если Не ВедетсяУчетШинТранспортногоСредства Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСреза = ?(ЗначениеЗаполнено(Объект.Дата), Новый Граница(Объект.Дата, ВидГраницы.Исключая), ТекущаяДата());
	
	// ---
	// ШИНЫ ТС
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза"			, ДатаСреза);
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.ТранспортноеСредство);
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ШиныТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_ШиныТССрезПоследних.МестоУстановкиШины КАК МестоУстановкиШины,
	|	CW_ШиныТССрезПоследних.Шина КАК Шина
	|ИЗ
	|	РегистрСведений.CW_ШиныТС.СрезПоследних(&ДатаСреза, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_ШиныТССрезПоследних";
	
	РезультатЗапросаШины = Запрос.Выполнить();
	
	Объект.ШиныТранспортногоСредства.Загрузить(РезультатЗапросаШины.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ЗаполнитьИнформациюОТранспортномСредстве();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаткиТоплива(Команда)
	_ОбновитьОстаткиТоплива();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьШинытранспортногоСредства(Команда)
	_ОбновитьШинытранспортногоСредства();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
		
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры



#КонецОбласти