#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		НастройкиПараметров = CW_Бюджетирование.ПолучитьНастройкиПараметровЗаполнения();  
		Если НастройкиПараметров.МассивПараметов.Количество() > 0 Тогда
			ЗначенияПараметров = CW_Бюджетирование.ПолучитьЗначенияПараметров(ДанныеЗаполнения.Владелец, НастройкиПараметров.МассивПараметов); 
			Для Каждого Параметр из НастройкиПараметров.МассивПараметов Цикл
				ИмяРеквизита 		= НастройкиПараметров.СоответствиеРеквизитов.Получить(Параметр);  
				Если ИмяРеквизита = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ЭтотОбъект[ИмяРеквизита] = ЗначенияПараметров.Получить(Параметр); 
			КонецЦикла;
		КонецЕсли;   
		
		ПорядокОтржаенияПоУмочанию = ПолучитьСоответствиеПорядкаОтржаенияПоУмочанию();
		
		СоответствиеИмениНастройкиВидуСтатьи = ПолучитьСоответствиеИмениНастройкиВидуСтатьи();
		ИмяНастройки = СоответствиеИмениНастройкиВидуСтатьи.Получить(ДанныеЗаполнения.ВидСтатьиПланирования);
		
		ПорядокОтражения = CW_Настройки.ПолучитьНастройкуПользователя(, ИмяНастройки);
		Если Не ЗначениеЗаполнено(ПорядокОтражения) Тогда
			ПорядокОтражения = ПорядокОтржаенияПоУмочанию.Получить(ДанныеЗаполнения.ВидСтатьиПланирования);	
		КонецЕсли;  
		
		СоответствиеИмениРеквизитаВидуСтатьи = ПолучитьСоответствиеИмениРеквизитаВидуСтатьи();
		ИмяРеквизита = СоответствиеИмениРеквизитаВидуСтатьи.Получить(ДанныеЗаполнения.ВидСтатьиПланирования); 
		
		ЭтотОбъект[ИмяРеквизита] = ПорядокОтражения;
		
	КонецЕсли;  
		
КонецПроцедуры    

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВариантНаценки = ПредопределенноеЗначение("Перечисление.CW_ВариантыНаценки.Нет")
		ИЛИ ВариантНаценки = ПредопределенноеЗначение("Перечисление.CW_ВариантыНаценки.ПустаяСсылка") Тогда
		
		Индекс = ПроверяемыеРеквизиты.Найти("ЗначениеНаценки");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
 
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;
	
	// дополнительно проверяем уникальность 
	//УДАЛЕНО по заявке AFR-250272 
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	//               |ГДЕ
	//               |	CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ
	//               |	И CW_ПлановыеСтатьиЗатратИДоходов.Контрагент = &Контрагент
	//               |	И CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура = &Номенклатура
	//               |	И CW_ПлановыеСтатьиЗатратИДоходов.Валюта = &Валюта
	//               |	И CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС = &СтавкаНДС
	//               |	И CW_ПлановыеСтатьиЗатратИДоходов.Организация = &Организация
	//               |	И CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец
	//               |	И CW_ПлановыеСтатьиЗатратИДоходов.Ссылка <> &Ссылка
	//               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
	//               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = &ВидСтатьиПланирования";

	//_сф.ст_ДобавитьСвойства(Запрос.Параметры,"Владелец,Ссылка,Организация,Контрагент,Номенклатура,Валюта,СтавкаНДС,ВерсияБюджета,ВидСтатьиПланирования",ЭтотОбъект);  
	//
	//РезультатЗапроса = Запрос.Выполнить();   
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Отказ = Истина;
	//	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"СовпадающаяСтатья", Выборка.Ссылка);
	//	
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Статья бюджета с заданными измерениями уже введена.");
	//	Возврат;
	//КонецЕсли; 
	//УДАЛЕНО по заявке AFR-250272 

	// ---------------------------------------------------------------------------- 
	
	Если ВидСтатьиПланирования=Перечисления.CW_ВидыСтатейПланирования.Доходы Тогда 
		стрДоходовЗатрат = "доходов";
	ИначеЕсли ВидСтатьиПланирования=Перечисления.CW_ВидыСтатейПланирования.Расходы Тогда 
		стрДоходовЗатрат = "затрат";
	Иначе 
		стрДоходовЗатрат="?доходов?затрат?";
	КонецЕсли;
	
	стр = "Статья " + стрДоходовЗатрат  
		+ ?(ЗначениеЗаполнено(Номенклатура), " "+СокрЛП(Номенклатура)+",", "")
		+ ?(ЗначениеЗаполнено(Контрагент), " "+СокрЛП(Контрагент)+",", "")
		+ " " + Формат(СуммаВсего, "ЧДЦ=2") + " " + Валюта;
		
	_сф.УстановитьЗначение(Наименование, стр);
	
КонецПроцедуры


Функция ПолучитьСоответствиеИмениНастройкиВидуСтатьи()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"), 	"ОсновнойПорядокОтраженияДоходовСтатейБюджета");
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы"), 	"ОсновнойПорядокОтраженияРасходовСтатейБюджета");
	
	Возврат Соответствие;
	
КонецФункции  

Функция ПолучитьСоответствиеПорядкаОтржаенияПоУмочанию()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"), 	ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы"), 	ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"));
	
	Возврат Соответствие;
	
КонецФункции  

Функция ПолучитьСоответствиеИмениРеквизитаВидуСтатьи()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы"), 	"ПорядокОтраженияДоходов");
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы"), 	"ПорядокОтраженияРасходов");
	
	Возврат Соответствие;
	
КонецФункции

Процедура ОчиститьПоказатели() Экспорт 
	
	Сумма = 0;
	СуммаНДС = 0;
	СуммаВсего = 0;
	
	СуммаРуб = 0;
	СуммаНДСРуб = 0;
	СуммаВсегоРуб = 0;
	
КонецПроцедуры  


//УСТАРЕЛА. Слеудет использовать CW_Бюджетирование.ПересчитатьСтатьюБюджетаПоКурсу
Процедура ПересчитатьПоТекущемуКурсу() Экспорт 
	
	CW_Бюджетирование.ПересчитатьСтатьюБюджетаПоКурсу(ЭтотОбъект);	
	
КонецПроцедуры
 
//УСТАРЕЛА. Слеудет использовать CW_Бюджетирование.ПересчитатьСтатьюБюджетаПоКурсу
Процедура ПересчитатьПоКурсуНаДату(Знач ДатаКурса) Экспорт   
	
	CW_Бюджетирование.ПересчитатьСтатьюБюджетаПоКурсу(ЭтотОбъект, , ДатаКурса);	

КонецПроцедуры
 
//УСТАРЕЛА. Слеудет использовать CW_Бюджетирование.ПересчитатьСтатьюБюджетаПоКурсу
Процедура ПересчитатьПоКурсу() Экспорт 
	
	CW_Бюджетирование.ПересчитатьСтатьюБюджетаПоКурсу(ЭтотОбъект);	

КонецПроцедуры

#КонецЕсли

