#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ДокументРезультат.Очистить();
	
	//Получаем схему из макета
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Если ДетализироватьПоПериодам Тогда
		СхемаКомпоновкиДанных.НаборыДанных.ОсновнойНабор.Запрос = ПолучитьТекстЗапроса();
	КонецЕсли;
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	ЗаполнитьПоляВСоответствииСоСпискомИнтервалов(СхемаКомпоновкиДанных, КомпоновщикНастроек);
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	
	ТекущийРодитель = КомпоновщикНастроек.Настройки.Структура;
	Для Каждого СтрокаГруппировки из Группировка Цикл
		Если Не СтрокаГруппировки.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(СтрокаГруппировки.Поле);
		ПолеГруппировки.Использование = Истина;
		
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(СтрокаГруппировки.Поле);
		ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		ЭлементПорядка.Использование = Истина;
		
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование=Истина;
		НоваяГруппировка.Имя = СтрокаГруппировки.Представление;
		НоваяГруппировка.Использование = Истина;
		
		Если СтрокаГруппировки.Поле = "ДокументВзаиморасчетов" Тогда
			ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ПериодЗадолженности");
			ПолеГруппировки.Использование = Истина;
			
			ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("СрокОплаты");
			ПолеГруппировки.Использование = Истина;
			
			Если ВыводитьПланОплатыДокументов Тогда
				ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ПлановаяДатаОплаты");
				ПолеГруппировки.Использование = Истина;
			КонецЕсли;
			Если ВыводитьДатуВозвратаДокументов Тогда
				ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ДатаВозвратаДокументов");
				ПолеГруппировки.Использование = Истина;
			КонецЕсли;
			Если ВыводитьСтатусДокументов Тогда
				ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("СтатусДокумента");
				ПолеГруппировки.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ТекущийРодитель = НоваяГруппировка.Структура;
	КонецЦикла;
	
	
	УстановитьПараметрыЗапроса(КомпоновщикНастроек.Настройки, СхемаКомпоновкиДанных);
	
КонецПроцедуры

Функция ПолучитьТекстЗапроса()
	
	КоличествоИнтервалов = Интервалы.Количество();
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Организация КАК Организация,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Контрагент КАК Контрагент,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Договор КАК Договор,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Валюта КАК Валюта,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет КАК ДокументВзаиморасчетов,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК ОстатокДолгаВал0,
	|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.ВсегоОстаток КАК ОстатокДолгаРуб0
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Остатки(&Период, ) КАК CW_ОперативнаяКредиторскаяЗадолженностьОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	Для Индекс = 1 По КоличествоИнтервалов Цикл
		
		ТекстЗапроса = ТекстЗапроса +"
		|ВЫБРАТЬ
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.Организация КАК Организация,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.Контрагент КАК Контрагент,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.Договор КАК Договор,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.ПриложениеКДоговору КАК ПриложениеКДоговору,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.Валюта КАК Валюта,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.Счет КАК Счет,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.Всего_ВалютаПриход - CW_ОперативнаяКредиторскаяЗадолженностьОбороты.Всего_ВалютаРасход КАК УвеличениеДолгаВал"+Индекс+",
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.ВсегоПриход - CW_ОперативнаяКредиторскаяЗадолженностьОбороты.ВсегоРасход КАК УвеличениеДолга"+Индекс+"
		|ПОМЕСТИТЬ ВТ_Обороты"+Индекс+"
		|ИЗ
		|	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Обороты(&НачалоИнтервала"+Индекс+", &КонецИнтервала"+Индекс+", Период, ) КАК CW_ОперативнаяКредиторскаяЗадолженностьОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса +"
	|ВЫБРАТЬ
	|	ВТ_Остатки.Организация КАК Организация,
	|	ВТ_Остатки.Контрагент КАК Контрагент,
	|	ВТ_Остатки.Договор КАК Договор,
	|	ВТ_Остатки.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	ВТ_Остатки.Валюта КАК Валюта,
	|	ВТ_Остатки.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,";
	
	Для Индекс = 1 По КоличествоИнтервалов Цикл
		
		ТекстЗапроса = ТекстЗапроса +"
		|	ЕСТЬNULL(ВТ_Обороты"+Индекс+".УвеличениеДолгаВал"+Индекс+", 0) КАК УвеличениеДолгаВал"+Индекс+",
		|	ЕСТЬNULL(ВТ_Обороты"+Индекс+".УвеличениеДолга"+Индекс+", 0) КАК УвеличениеДолга"+Индекс+",";
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса +"
	|	ВТ_Остатки.ОстатокДолгаВал0 КАК ОстатокДолгаВал0,
	|	ВТ_Остатки.ОстатокДолгаРуб0 КАК ОстатокДолгаРуб0
	|ПОМЕСТИТЬ ВТ_ОстаткиИОбороты
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки";
	
	Для Индекс = 1 По КоличествоИнтервалов Цикл
		
		ТекстЗапроса = ТекстЗапроса +"
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Обороты"+Индекс+" КАК ВТ_Обороты"+Индекс+"
		|		ПО ВТ_Остатки.Организация = ВТ_Обороты"+Индекс+".Организация
		|			И ВТ_Остатки.Контрагент = ВТ_Обороты"+Индекс+".Контрагент
		|			И ВТ_Остатки.Договор = ВТ_Обороты"+Индекс+".Договор
		|			И ВТ_Остатки.ПриложениеКДоговору = ВТ_Обороты"+Индекс+".ПриложениеКДоговору
		|			И ВТ_Остатки.Валюта = ВТ_Обороты"+Индекс+".Валюта
		|			И ВТ_Остатки.ДокументВзаиморасчетов = ВТ_Обороты"+Индекс+".Счет";
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса +"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиИОбороты.Организация КАК Организация,
	|	ВТ_ОстаткиИОбороты.Контрагент КАК Контрагент,
	|	ВТ_ОстаткиИОбороты.Договор КАК Договор,
	|	ВТ_ОстаткиИОбороты.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	ВТ_ОстаткиИОбороты.Валюта КАК Валюта,
	|	ВТ_ОстаткиИОбороты.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,";
	
	Для Индекс = 1 По КоличествоИнтервалов Цикл
		ТекстПоля 	= "ВТ_ОстаткиИОбороты.ОстатокДолгаРуб0";
		ТекстПоля2 	= "ВТ_ОстаткиИОбороты.ОстатокДолгаВал0";
		Для ПодИндекс = 1 По Индекс Цикл
			ТекстПоля = ТекстПоля + " - ВТ_ОстаткиИОбороты.УвеличениеДолга" + ПодИндекс;
			ТекстПоля2 = ТекстПоля2 + " - ВТ_ОстаткиИОбороты.УвеличениеДолгаВал" + ПодИндекс;
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ТекстПоля + " КАК ОстатокДолгаРуб"+Индекс+"," + Символы.ПС;
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ТекстПоля2+ " КАК ОстатокДолгаВал"+Индекс+"," + Символы.ПС;
		
		//ТекстЗапроса = ТекстЗапроса +"
		//| "+ТекстПоля+" КАК ОстатокДолгаРуб"+Индекс+",";
		//
		//ТекстЗапроса = ТекстЗапроса +"
		//| "+ТекстПоля2+" КАК ОстатокДолгаВал"+Индекс+",";
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса +"
	|	ВТ_ОстаткиИОбороты.ОстатокДолгаВал0 КАК ОстатокДолгаВал0,
	|	ВТ_ОстаткиИОбороты.ОстатокДолгаРуб0 КАК ОстатокДолгаРуб0
	|ПОМЕСТИТЬ ВТ_ОстаткиПоПериодам
	|ИЗ
	|	ВТ_ОстаткиИОбороты КАК ВТ_ОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиПоПериодам.Организация КАК Организация,
	|	ВТ_ОстаткиПоПериодам.Контрагент КАК Контрагент,
	|	ВТ_ОстаткиПоПериодам.Договор КАК Договор,
	|	ВТ_ОстаткиПоПериодам.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	ВТ_ОстаткиПоПериодам.Валюта КАК Валюта,
	|	ВТ_ОстаткиПоПериодам.ДокументВзаиморасчетов КАК ДокументВзаиморасчетов,
	|	ЕСТЬNULL(CW_СтатусыДокументовСрезПоследних.СтатусДокумента, НЕОПРЕДЕЛЕНО) КАК СтатусДокумента,
	|	ЕСТЬNULL(CW_СрокиОплатыСчетов.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокОплаты,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(CW_СрокиОплатыСчетов.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РАЗНОСТЬДАТ(CW_СрокиОплатыСчетов.ДатаОплаты, &Период, ДЕНЬ) > 0
	|					ТОГДА РАЗНОСТЬДАТ(CW_СрокиОплатыСчетов.ДатаОплаты, &Период, ДЕНЬ)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ПериодЗадолженности,
	|	CW_ПланОплатыВходящихСчетов.ПлановаяДата КАК ПлановаяДатаОплаты,
	|	CW_ПризнакНаличияОригиналовДокументов.ДатаПолучения КАК ДатаВозвратаДокументов,
	|	CW_МенеджерыПродажКлиентовСрезПоследних.МенеджерПродаж КАК МенеджерПродаж,";
	
	Для Индекс = 1 По КоличествоИнтервалов Цикл
		ТекстПоля = "	ВТ_ОстаткиПоПериодам.ОстатокДолгаРуб" + (Индекс - 1) + " - ВТ_ОстаткиПоПериодам.ОстатокДолгаРуб" + Индекс + " КАК ОстатокДолгаРуб" + Индекс + ",";
		ТекстПоля2= "	ВТ_ОстаткиПоПериодам.ОстатокДолгаВал" + (Индекс - 1) + " - ВТ_ОстаткиПоПериодам.ОстатокДолгаВал" + Индекс + " КАК ОстатокДолгаВал" + Индекс + ",";
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ТекстПоля + Символы.ПС;
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ТекстПоля2 + Символы.ПС;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса +"
	|	ВТ_ОстаткиПоПериодам.ОстатокДолгаРуб" + КоличествоИнтервалов + " КАК ОстатокДолгаРуб" + (КоличествоИнтервалов + 1) + ", 
	|	ВТ_ОстаткиПоПериодам.ОстатокДолгаВал" + КоличествоИнтервалов + " КАК ОстатокДолгаВал" + (КоличествоИнтервалов + 1) + ", 
	|	ВТ_ОстаткиПоПериодам.ОстатокДолгаВал0 КАК ОстатокДолгаВал,
	|	ВТ_ОстаткиПоПериодам.ОстатокДолгаРуб0 КАК ОстатокДолгаРуб
	|ИЗ
	|	ВТ_ОстаткиПоПериодам КАК ВТ_ОстаткиПоПериодам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СтатусыДокументов.СрезПоследних КАК CW_СтатусыДокументовСрезПоследних
	|		ПО ВТ_ОстаткиПоПериодам.ДокументВзаиморасчетов = CW_СтатусыДокументовСрезПоследних.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПланОплатыВходящихСчетов КАК CW_ПланОплатыВходящихСчетов
	|		ПО ВТ_ОстаткиПоПериодам.ДокументВзаиморасчетов = CW_ПланОплатыВходящихСчетов.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СрокиОплатыСчетов КАК CW_СрокиОплатыСчетов
	|		ПО ВТ_ОстаткиПоПериодам.ДокументВзаиморасчетов = CW_СрокиОплатыСчетов.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_МенеджерыПродажКлиентов.СрезПоследних КАК CW_МенеджерыПродажКлиентовСрезПоследних
	|		ПО ВТ_ОстаткиПоПериодам.Контрагент = CW_МенеджерыПродажКлиентовСрезПоследних.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПризнакНаличияОригиналовДокументов КАК CW_ПризнакНаличияОригиналовДокументов
	|		ПО ВТ_ОстаткиПоПериодам.ДокументВзаиморасчетов = CW_ПризнакНаличияОригиналовДокументов.ДокументСсылка";
	
	
	Возврат ТекстЗапроса;
	
	
КонецФункции

Процедура УстановитьПараметрыЗапроса(Настройки, Схема)
	
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("Период", НачалоДня(ДатаОтчета) , Настройки.ПараметрыДанных);
	
	Если Не ДетализироватьПоПериодам Тогда
		Возврат;
	КонецЕсли;
	
	Сутки = 60 * 60 * 24;
	
	ТабИнтервалы = Новый ТаблицаЗначений;
	ТабИнтервалы.Колонки.Добавить("ИмяИнтервала");
	ТабИнтервалы.Колонки.Добавить("НомерИнтервала");
	ТабИнтервалы.Колонки.Добавить("НачалоИнтервала");
	ТабИнтервалы.Колонки.Добавить("КонецИнтервала");
	
	ДатаКон = ?(ДатаОтчета = '00010101', ТекущаяДатаСеанса(), ДатаОтчета);
	Интервалы.Сортировать("Значение Возр");
	Индекс = 1;
	Первый = Истина;
	ПредыдущееЗначение = 0;
	Для Каждого Интервал Из Интервалы Цикл
		НоваяСтрока = ТабИнтервалы.Добавить();
		НоваяСтрока.ИмяИнтервала    = Интервал.Представление;
		НоваяСтрока.НомерИнтервала  = Индекс;
		Если Первый Тогда  
			НоваяСтрока.НачалоИнтервала = НачалоДня(ДатаКон) - Интервал.Значение * Сутки;
			НоваяСтрока.КонецИнтервала  = КонецДня(ДатаКон);
			ПредыдущееЗначение = Интервал.Значение;
			Первый = Ложь;
		Иначе
			НоваяСтрока.НачалоИнтервала = НачалоДня(ДатаКон) - Интервал.Значение * Сутки;
			НоваяСтрока.КонецИнтервала  = КонецДня(ДатаКон)  - (ПредыдущееЗначение + 1) * Сутки;
			ПредыдущееЗначение = Интервал.Значение;
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Для каждого СтрокаИнтервала из ТабИнтервалы Цикл
		ИмяПараметра = "НачалоИнтервала" + СтрокаИнтервала.НомерИнтервала;
		Параметр = Схема.Параметры.Найти(ИмяПараметра);
		Если Параметр = Неопределено Тогда
			Параметр = Схема.Параметры.Добавить();
			Параметр.Имя = ИмяПараметра;
		КонецЕсли;
		
		ИмяПараметра = "КонецИнтервала" + СтрокаИнтервала.НомерИнтервала;
		Параметр = Схема.Параметры.Найти(ИмяПараметра);
		Если Параметр = Неопределено Тогда
			Параметр = Схема.Параметры.Добавить();
			Параметр.Имя = ИмяПараметра;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаИнтервала из ТабИнтервалы Цикл
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоИнтервала" + СтрокаИнтервала.НомерИнтервала, СтрокаИнтервала.НачалоИнтервала , 	Настройки.ПараметрыДанных);
		CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецИнтервала" + СтрокаИнтервала.НомерИнтервала, 	СтрокаИнтервала.КонецИнтервала , 	Настройки.ПараметрыДанных);
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьПоляВСоответствииСоСпискомИнтервалов(Схема, КомпоновщикНастроек)
	
	КоличествоПолейПериодов = Схема.НаборыДанных.ОсновнойНабор.Поля.Количество() - 15;
	Для Индекс = 1 По КоличествоПолейПериодов Цикл
		ПолеДляУдаления = Схема.НаборыДанных.ОсновнойНабор.Поля.Найти("ОстатокДолгаРуб" + Индекс);
		Если ПолеДляУдаления <> Неопределено Тогда
			Схема.НаборыДанных.ОсновнойНабор.Поля.Удалить(ПолеДляУдаления);
		КонецЕсли; 
		ПолеДляУдаления = Схема.НаборыДанных.ОсновнойНабор.Поля.Найти("ОстатокДолгаВал" + Индекс);
		Если ПолеДляУдаления <> Неопределено Тогда
			Схема.НаборыДанных.ОсновнойНабор.Поля.Удалить(ПолеДляУдаления);
		КонецЕсли; 
	КонецЦикла;
	
	Схема.ПоляИтога.Очистить();
	
	ПолеИтога = Схема.ПоляИтога.Добавить();
	ПолеИтога.ПутьКДанным = "ОстатокДолгаРуб";
	ПолеИтога.Выражение   = "Сумма(ОстатокДолгаРуб)";
	
	ПолеИтога = Схема.ПоляИтога.Добавить();
	ПолеИтога.ПутьКДанным = "ОстатокДолгаВал";
	ПолеИтога.Выражение   = "Сумма(ОстатокДолгаВал)";	
	
	
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	
	ПапкаСПолями = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ПапкаСПолями.Заголовок = НСтр("ru = 'Задолженность'");
	
	Если ВыводитьСуммыВРублях Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПапкаСПолями, "ОстатокДолгаРуб");
	КонецЕсли;
	Если ВыводитьСуммыВВалюте Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПапкаСПолями, "ОстатокДолгаВал");
	КонецЕсли;
	
	ПапкаСПолями = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ПапкаСПолями.Заголовок = НСтр("ru = 'Общая задолженность по срокам долга'");
	Индекс = 1;
	ЗначениеПоследнего = 0;
	Для Каждого Интервал Из Интервалы Цикл
		
		ПапкаСПолямиИнтевал = ПапкаСПолями.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		ПапкаСПолямиИнтевал.Заголовок = Интервал.Представление;
		
		Если ВыводитьСуммыВРублях Тогда
			ИмяПоля = "ОстатокДолгаРуб" + Индекс;
			Поле = Схема.НаборыДанных.ОсновнойНабор.Поля.Найти(ИмяПоля);
			Если Поле = Неопределено Тогда
				Поле = Схема.НаборыДанных.ОсновнойНабор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			КонецЕсли;
			Поле.Поле        = ИмяПоля;
			Поле.ПутьКДанным = ИмяПоля;
			Поле.Заголовок   = "RUB";
			Поле.ТипЗначения = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0));
			БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "Формат", "ЧЦ=15; ЧДЦ=2");
			БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "МинимальнаяШирина", 15);
			БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "МаксимальнаяШирина", 15);
			Поле.ОграничениеИспользования.Группировка = Ложь;
			Поле.ОграничениеИспользованияРеквизитов.Группировка = Ложь;
			
			ПолеИтога = Схема.ПоляИтога.Добавить();
			ПолеИтога.ПутьКДанным = ИмяПоля;
			ПолеИтога.Выражение   = "Сумма(" + ИмяПоля + ")";
			
			БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПапкаСПолямиИнтевал, ИмяПоля);
			
		КонецЕсли;
		
		Если ВыводитьСуммыВВалюте Тогда
			ИмяПоля = "ОстатокДолгаВал" + Индекс;
			Поле = Схема.НаборыДанных.ОсновнойНабор.Поля.Найти(ИмяПоля);
			Если Поле = Неопределено Тогда
				Поле = Схема.НаборыДанных.ОсновнойНабор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			КонецЕсли;
			Поле.Поле        = ИмяПоля;
			Поле.ПутьКДанным = ИмяПоля;
			Поле.Заголовок   = "ВАЛ";
			Поле.ТипЗначения = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0));
			БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "Формат", "ЧЦ=15; ЧДЦ=2");
			БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "МинимальнаяШирина", 15);
			БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "МаксимальнаяШирина", 15);
			Поле.ОграничениеИспользования.Группировка = Ложь;
			Поле.ОграничениеИспользованияРеквизитов.Группировка = Ложь;
			
			ПолеИтога = Схема.ПоляИтога.Добавить();
			ПолеИтога.ПутьКДанным = ИмяПоля;
			ПолеИтога.Выражение   = "Сумма(" + ИмяПоля + ")";
			
			БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПапкаСПолямиИнтевал, ИмяПоля);
		КонецЕсли;
		
		
		Индекс = Индекс + 1;
		ЗначениеПоследнего = Интервал.Значение;
		
	КонецЦикла;
	
	ПапкаСПолямиИнтевал = ПапкаСПолями.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ПапкаСПолямиИнтевал.Заголовок  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Свыше %1 дней'"), Формат(ЗначениеПоследнего,"ЧГ=0"));
	
	Если ВыводитьСуммыВРублях Тогда
		ИмяПоля = "ОстатокДолгаРуб" + Индекс;
		Поле = Схема.НаборыДанных.ОсновнойНабор.Поля.Найти(ИмяПоля);
		Если Поле = Неопределено Тогда
			Поле = Схема.НаборыДанных.ОсновнойНабор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		КонецЕсли;
		Поле.Поле        = ИмяПоля;
		Поле.ПутьКДанным = ИмяПоля;	
		Поле.Заголовок   = "RUB";
		Поле.ТипЗначения = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0));
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "Формат", "ЧЦ=15; ЧДЦ=2");
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "МинимальнаяШирина", 15);
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "МаксимальнаяШирина", 15);
		
		ПолеИтога = Схема.ПоляИтога.Добавить();
		ПолеИтога.ПутьКДанным = ИмяПоля;
		ПолеИтога.Выражение   = "Сумма(" + ИмяПоля + ")";
		
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПапкаСПолямиИнтевал, ИмяПоля);
	КонецЕсли;
	
	Если ВыводитьСуммыВВалюте Тогда
		ИмяПоля = "ОстатокДолгаВал" + Индекс;
		Поле = Схема.НаборыДанных.ОсновнойНабор.Поля.Найти(ИмяПоля);
		Если Поле = Неопределено Тогда
			Поле = Схема.НаборыДанных.ОсновнойНабор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		КонецЕсли;
		Поле.Поле        = ИмяПоля;
		Поле.ПутьКДанным = ИмяПоля;	
		Поле.Заголовок   = "ВАЛ";
		Поле.ТипЗначения = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0));
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "Формат", "ЧЦ=15; ЧДЦ=2");
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "МинимальнаяШирина", 15);
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(Поле.Оформление, "МаксимальнаяШирина", 15);
		
		ПолеИтога = Схема.ПоляИтога.Добавить();
		ПолеИтога.ПутьКДанным = ИмяПоля;
		ПолеИтога.Выражение   = "Сумма(" + ИмяПоля + ")";
		
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(ПапкаСПолямиИнтевал, ИмяПоля);
	КонецЕсли;
	
	
КонецПроцедуры
#КонецЕсли