 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВозвращениеФакт = Неопределено;
	Параметры.Свойство("ВозвращениеФакт", ВозвращениеФакт);   
	ВозвращениеФакт = ?(ВозвращениеФакт = Неопределено, дата(1,1,1), ВозвращениеФакт);
	
	//Текущая дата(0), Дата фактического возвращения(1)
	Элементы.ВариантПодстановкиДаты.СписокВыбора.Добавить(0, "Текущая дата ("+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")+")");
	Элементы.ВариантПодстановкиДаты.СписокВыбора.Добавить(1, "Дата фактического возвращения ("+Формат(ВозвращениеФакт,"ДФ=dd.MM.yyyy")+")");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЭтаФорма.Закрыть(ВариантПодстановкиДаты);
	
КонецПроцедуры

