
Функция ПолучитьСчетаУчетаРасчетов(Знач Организация, Знач Валюта, Знач ВУсловныхЕдиницах = Ложь, Знач Период=Неопределено, Знач ПоставщикПокупатель = Ложь) Экспорт
	
	СчетУчета = Неопределено;
	
	ПрефиксПоля = ?(ПоставщикПокупатель, "Поставщики_", "Клиенты_");
	Датасреза 	= ?(Период = Неопределено, ТекущаяДата(), Период);
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УчетнаяПолитикаСрезПоследних.Организация КАК Организация,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Поставщики_Рубли КАК Поставщики_Рубли,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Поставщики_Валюта КАК Поставщики_Валюта,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Поставщики_УЕ КАК Поставщики_УЕ,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Клиенты_Рубли КАК Клиенты_Рубли,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Клиенты_Валюта КАК Клиенты_Валюта,
	               |	CW_УчетнаяПолитикаСрезПоследних.СчетРасчетов_Клиенты_УЕ КАК Клиенты_УЕ
	               |ИЗ
	               |	РегистрСведений.CW_УчетнаяПолитика.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК CW_УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		
		Если ВУсловныхЕдиницах Тогда
			СчетУчета = Выборка[ПрефиксПоля+"УЕ"];
		Иначе
			
			Если Валюта = ВалютаРегламентированногоУчета Тогда
				СчетУчета = Выборка[ПрефиксПоля+"Рубли"];
			Иначе
				СчетУчета = Выборка[ПрефиксПоля+"Валюта"];
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат СчетУчета; 
	
КонецФункции

Функция ПолучитьСведенияОбОрганизацииНаАнглийскомЯзыке(Организация, ДатаСреза = Неопределено) Экспорт
	
	Результат = Новый Структура("НаименованиеОрганизации,ДолжностьРуководителя,АдресОрганизации", Неопределено, Неопределено, Неопределено);
	
	ДатаСреза = ?(ДатаСреза = Неопределено, ТекущаяДата(), ДатаСреза);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УчетнаяПолитикаСрезПоследних.Организация КАК Организация,
	               |	CW_УчетнаяПолитикаСрезПоследних.НаименованиеОрганизацииАнгл КАК НаименованиеОрганизации,
	               |	CW_УчетнаяПолитикаСрезПоследних.ДолжностьРуководителяОрганизацииАнгл КАК ДолжностьРуководителя,
	               |	CW_УчетнаяПолитикаСрезПоследних.АдресОрганизацииАнгл КАК АдресОрганизации
	               |ИЗ
	               |	РегистрСведений.CW_УчетнаяПолитика.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК CW_УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", 		ДатаСреза);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		 ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
