
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПараметрДляПроверкиЗначенияПоУсловиюНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПараметрДляПроверкиЗначенияПоУсловиюНаСервере()   
	
	Элементы.НоменклатураЗаменыПоУсловию.Доступность = ЗначениеЗаполнено(Запись.ПараметрДляПроверкиЗаменыПоУсловию);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрДляПроверкиЗначенияПоУсловиюПриИзменении(Элемент)  
	
	Если Не ЗначениеЗаполнено(Запись.ПараметрДляПроверкиЗаменыПоУсловию) Тогда
		Запись.НоменклатураЗаменыПоУсловию = Неопределено;
	КонецЕсли;   
	
	ПараметрДляПроверкиЗначенияПоУсловиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрДляПроверкиЗначенияПоУсловиюНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	ДоступныеПараметры = ПолучитьСписокДоступныхПараметров();      
	
    СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", ДоступныеПараметры);
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Отбор", СтруктураОтбора);
	ПараметрыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", ПараметрыВыбора, Элемент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокДоступныхПараметров()
	Возврат ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСписокПараметровПоТипуЗначения(Тип("Булево"));
КонецФункции