
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Период = ТекущаяДата();
	ПоказатьСкрытьНастройку = истина;
	НастройкаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	ПоказатьСкрытьНастройку = Не ПоказатьСкрытьНастройку;
	НастройкаНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура НастройкаНаСервере()
	
		Элементы.ГруппаНастроки.Видимость  = ПоказатьСкрытьНастройку;
		Элементы.ФормаНастройка.Пометка    = ПоказатьСкрытьНастройку;
		
КонецПроцедуры
