
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АгентскийДоговорНаЗакупку", АгентскийДоговорНаЗакупку);
	Параметры.Свойство("АгентскийДоговорНаПродажу", АгентскийДоговорНаПродажу);
	Параметры.Свойство("ДоговорДляВыявленияФинансовогоРезультата", ДоговорДляВыявленияФинансовогоРезультата);
	
	// возможность редактирования связанных договоров
	Элементы.АгентскийДоговорНаЗакупку.ТолькоПросмотр = НЕ РольДоступна("ПолныеПрава");
	Элементы.АгентскийДоговорНаПродажу.ТолькоПросмотр = НЕ РольДоступна("ПолныеПрава");
	
	Элементы.ДоговорДляВыявленияФинансовогоРезультата.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	СтруктураДоговора = Новый Структура;
	СтруктураДоговора.Вставить("АгентскийДоговорНаЗакупку", АгентскийДоговорНаЗакупку);
	СтруктураДоговора.Вставить("АгентскийДоговорНаПродажу", АгентскийДоговорНаПродажу);
	СтруктураДоговора.Вставить("ДоговорДляВыявленияФинансовогоРезультата", ДоговорДляВыявленияФинансовогоРезультата);
	
	ЭтаФорма.Закрыть(СтруктураДоговора);
	
КонецПроцедуры
