#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция НаименованиеУчетногоДоговора(ДоговорОбъект) Экспорт 
	// --- 
	
	Наименование = "Служебный (Дог.№"+СокрЛП(ДоговорОбъект.НомерДоговора)+" от "+Формат(ДоговорОбъект.ДатаДоговора,"ДФ=dd.MM.yyyy; ДП=<...>")+")";
	Возврат(Наименование);
	
	// --- 
КонецФункции

Функция НаименованиеУчетногоДоговораСКомитентом(ДоговорОбъект) Экспорт 
	// --- 
	
	Наименование = "Служебный с комитентом (Дог.№"+СокрЛП(ДоговорОбъект.НомерДоговора)+" от "+Формат(ДоговорОбъект.ДатаДоговора,"ДФ=dd.MM.yyyy; ДП=<...>")+")";
	Возврат(Наименование);
	
	// --- 
КонецФункции

Функция НаименованиеУчетногоДоговораВыявленияРезультата(ДоговорОбъект) Экспорт 
	// --- 
	
	Наименование = "Служебный для выявления результата (Дог.№"+СокрЛП(ДоговорОбъект.НомерДоговора)+" от "+Формат(ДоговорОбъект.ДатаДоговора,"ДФ=dd.MM.yyyy; ДП=<...>")+")";
	Возврат(Наименование);
	
	// --- 
КонецФункции  

Процедура УстановитьИспользованиеПриложенийВДоговорах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоговорыПоГрузоперевозкам.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ДоговорыПоГрузоперевозкам.ИспользуютсяПриложения = ИСТИНА"; 
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДоговорОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДоговорОбъект.УчитыватьПриложенияВДокументах = Истина;
		ДоговорОбъект.ОбменДанными.Загрузка = Истина;
		ДоговорОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
