#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтотОбъект.БухгалтерскийУчет Тогда		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("БухгалтерскийУчет"));
	КонецЕсли;
	
	CW_Документы.ПроверитьСоответствиедоговораУчетному(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ВалютаДоговора) Тогда 
		ВалютаДоговора = CW_Настройки.ВалютаРегламентированногоУчета();
	КонецЕсли; 
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДатаСоздания = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НастройкаБухгалтерскийУчет = CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"УстанавливатьДляНовыхДоговоровБУ");
	
	УчетныйДоговор 								= Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ДоговорДляВыявленияФинансовогоРезультата 	= Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	АгентскийДоговорНаЗакупку	= Неопределено;
	АгентскийДоговорНаПродажу	= Неопределено;
	
	БухгалтерскийУчет 			= НастройкаБухгалтерскийУчет;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	//ВРЕМЕННО!!!
	ЭтотОбъект.ПодставлятьПодписиИПечатьПриЭлектроннойРассылке = ЭтотОбъект.ПодписьИПечатьАкты 
	или ЭтотОбъект.ПодписьИПечатьСчета
	или ЭтотОбъект.ПодписьИПечатьОтчетаЭкспедитора;
	//ВРЕМЕННО!!!
	
	Закрыт = (ДатаЗакрытия <> Дата(1,1,1));
	
	Если (ЭтотОбъект.БухгалтерскийУчет) Тогда
					
		Если ДополнительныеСвойства.Свойство("ПроверитьУчетныйДоговор") Тогда
			Если ДополнительныеСвойства.ПроверитьУчетныйДоговор Тогда
				СтруктураОтвета =  ИспользуетсяВДругихДоговорахПоГрузоперевозкам();
				Если СтруктураОтвета.Отказ Тогда                            
					СтрокаДоговоров = СтрСоединить(СтруктураОтвета.МассивДоговоров,",");					
					ОбщегоНазначения.СообщитьПользователю("Учетный договор уже используется в договорах по грузоперевозкам: "+ СтрокаДоговоров,ЭтотОбъект, "УчетныйДоговор",, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	
	ЕстьПроведенныеДокументы = Ложь;
	ДополнительныеСвойства.Свойство("ЕстьПроведенныеДокументы",ЕстьПроведенныеДокументы);
	Если (ЕстьПроведенныеДокументы <> Неопределено) Тогда
		Если (ЕстьПроведенныеДокументы) Тогда
			
			Если (Организация <> Ссылка.Организация
				ИЛИ Владелец <> Ссылка.Владелец
				ИЛИ ВидДоговора <> Ссылка.ВидДоговора
				ИЛИ ВалютаДоговора <> Ссылка.ВалютаДоговора
				ИЛИ ВзаиморасчетыВУЕ <> Ссылка.ВзаиморасчетыВУЕ) Тогда
				
				Отказ = Истина;
				Сообщить("По договору существуют проведённые документы. Изменение реквизитов договора запрещено.");
				
			КонецЕсли; 
			
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры

Функция ИспользуетсяВДругихДоговорахПоГрузоперевозкам()
	
	СтруктураОтвета = Новый Структура("Отказ,МассивДоговоров", Ложь, Неопределено);  
	
	//Для версии КОРП
	Если ВариантыПриложений.ЭтоВерсияКОРП() Тогда
		Возврат СтруктураОтвета;
	КонецЕсли;
	//Для версии КОРП
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоговорыПоГрузоперевозкам.УчетныйДоговор = &УчетныйДоговор
	               |	И CW_ДоговорыПоГрузоперевозкам.Ссылка <> &Ссылка
	               |	И НЕ CW_ДоговорыПоГрузоперевозкам.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("УчетныйДоговор", УчетныйДоговор);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	МассивДоговоров = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	СтруктураОтвета.Вставить("Отказ", Истина);
	СтруктураОтвета.Вставить("МассивДоговоров", МассивДоговоров);
	
	Возврат СтруктураОтвета;

КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	// проверяем, есть ли по договору действующие параметры
	// если нет - создаем на дату договора
	Если ДатаДоговора = Дата(1,1,1) Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыДоговоров.Договор
	               |ИЗ
	               |	РегистрСведений.CW_ПараметрыДоговоров КАК CW_ПараметрыДоговоров
	               |ГДЕ
	               |	 CW_ПараметрыДоговоров.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Ссылка); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	// параметров не нашли, создаем новые датой договора
	Если НЕ Выборка.Следующий() Тогда
		
		Запись = РегистрыСведений.CW_ПараметрыДоговоров.СоздатьМенеджерЗаписи();
		Запись.Период     = ДатаДоговора;
		Запись.Договор    = Ссылка;
		
		Запись.ПорядокЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
		Если (НЕ ЭтотОбъект.БухгалтерскийУчет) Тогда
			Запись.ПорядокЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
		КонецЕсли; 
		
		// порядок оформления с\ф устанавливаем в зависимости от настроек пользователя 
		Запись.ПродавецПоСФСвояОрганизация = CW_Настройки.ПолучитьНастройкуПользователя(,"ПродавецПоСФСвояОрганизация");
		
		// Порядок заполнения расчетно платежных документов для с\ф
		Если ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			Запись.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ 	= Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.Автоматически;
			ПорядокЗачетаАвансовОЗ 							= CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"СпособЗачетаАвнасовИсходящихДокументов");
		Иначе
			Запись.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ 	= Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.НеУчитывать;
			ПорядокЗачетаАвансовОЗ 							= CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"СпособЗачетаАвнасовВходящихДокументов");
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ПорядокЗачетаАвансовОЗ) Тогда
			Запись.ПорядокЗачетаАвансовОЗ = ПорядокЗачетаАвансовОЗ;
		КонецЕсли;
			
		РегистрыСведений.CW_ПараметрыДоговоров._ЗаполнитьРеквизитыОрганизацииРус(Запись);
		РегистрыСведений.CW_ПараметрыДоговоров._ЗаполнитьРеквизитыОрганизацииАнгл(Запись, ВалютаДоговора);
		РегистрыСведений.CW_ПараметрыДоговоров._ЗаполнитьРеквизитыКонтрагента(Запись, "Рус");
		РегистрыСведений.CW_ПараметрыДоговоров._ЗаполнитьРеквизитыКонтрагента(Запись, "Англ");
		
		//Получим настрйоки пользователя
		ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
		СтруктураНастроекПользователя 	= CW_Настройки.ПолучитьНастройкиПользователя();
		
		ОсновнойПорядокОтраженияДоходов 	= Неопределено;
		ОсновнойПорядокОтраженияРасходов 	= Неопределено;
		
		СтруктураНастроекПользователя.Свойство("ОсновнойПорядокОтраженияДоходов"	, ОсновнойПорядокОтраженияДоходов);
		СтруктураНастроекПользователя.Свойство("ОсновнойПорядокОтраженияРасходов"	, ОсновнойПорядокОтраженияРасходов);
		
		Если Не ЗначениеЗаполнено(ОсновнойПорядокОтраженияДоходов) тогда
			Если ВалютаРегламентированногоУчетаРубль Тогда
				ОсновнойПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
			Иначе
				ОсновнойПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОсновнойПорядокОтраженияРасходов) тогда
			Если ВалютаРегламентированногоУчетаРубль Тогда
				ОсновнойПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
			Иначе
				ОсновнойПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам;
			КонецЕсли;
		КонецЕсли;
		
		Запись.ОсновнойПорядокОтраженияДоходов = ОсновнойПорядокОтраженияДоходов;
		Запись.ОсновнойПорядокОтраженияРасходов = ОсновнойПорядокОтраженияРасходов;
		
		Если Не ВалютаРегламентированногоУчетаРубль Тогда
			Запись.ЯзыкПечатиДокументов 			= 1;
			Запись.ВыводитьРеквизитыПриПечатиАкта 	= Ложь;
			Запись.СкрыватьКолонкиНДСвТЧСчета 		= Истина;
		КонецЕсли;
		
		Запись.Записать();
		
	КонецЕсли; 
	
	
	Если (НЕ УчетныйДоговор.Пустая()) Тогда
		
		Если (УчетныйДоговор.ПометкаУдаления <> ПометкаУдаления) Тогда
			
			об = УчетныйДоговор.ПолучитьОбъект();
			об.УстановитьПометкуУдаления(ПометкаУдаления);
			
		КонецЕсли; 
		
	КонецЕсли; 

	Если (НЕ ДоговорДляВыявленияФинансовогоРезультата.Пустая()) Тогда
		
		Если (ДоговорДляВыявленияФинансовогоРезультата.ПометкаУдаления <> ПометкаУдаления) Тогда
			
			об = ДоговорДляВыявленияФинансовогоРезультата.ПолучитьОбъект();
			об.УстановитьПометкуУдаления(ПометкаУдаления);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если (НЕ ЭтоНовый() И ПометкаУдаления) Тогда
		
		// очищаем записи регистра "последние договоры"
		НЗ = РегистрыСведений.CW_ПоследниеИспользованныеДоговоры.СоздатьНаборЗаписей();
		НЗ.Отбор.Организация.Значение = Организация;
		НЗ.Отбор.Организация.Использование = Истина;
		НЗ.Отбор.Контрагент.Значение = Владелец;
		НЗ.Отбор.Контрагент.Использование = Истина;
		НЗ.Отбор.ВидДоговора.Значение = ВидДоговора;
		НЗ.Отбор.ВидДоговора.Использование = Истина;
		НЗ.Прочитать();
		МассивУдаляемых = Новый Массив;
		Для каждого Стр Из НЗ Цикл
			Если (Стр.Договор = Ссылка) Тогда
				МассивУдаляемых.Добавить(Стр);
			КонецЕсли; 
		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(НЗ,МассивУдаляемых);
		НЗ.Записать(Истина);
		
	КонецЕсли; 
	
	// --- 
	
	// проверяем агентские договоры
	Если (ЗначениеЗаполнено(АгентскийДоговорНаЗакупку)) Тогда
		Если (АгентскийДоговорНаЗакупку.ПометкаУдаления <> ПометкаУдаления) Тогда
			об = АгентскийДоговорНаЗакупку.ПолучитьОбъект();
			об.УстановитьПометкуУдаления(ПометкаУдаления);
		КонецЕсли; 
	КонецЕсли;
	Если (ЗначениеЗаполнено(АгентскийДоговорНаПродажу)) Тогда
		Если (АгентскийДоговорНаПродажу.ПометкаУдаления <> ПометкаУдаления) Тогда
			об = АгентскийДоговорНаПродажу.ПолучитьОбъект();
			об.УстановитьПометкуУдаления(ПометкаУдаления);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры


  
#КонецЕсли