
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВводЛогинаПароля", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаЛогинПароль", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьВводЛогинаПароля(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Ответ.ИзменилсяЛогин Тогда
		CW_РегистрацияПрограммыСервер.ДополнитьРасширенныеНастройкиМодуля(0);
		Оповестить("ВыполненаАктивацияПрограммы");
	КонецЕсли;
	
КонецПроцедуры 
