
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр 			= НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеНастроекМониторинга");
	ИспользованиеДинамическихПараметров = ПолучитьФункциональнуюОпцию("CW_ИспользованиеДинамическихПараметров");  
	
	ДляРедактирования = Неопределено;
	Параметры.Свойство("ДляРедактирования", ДляРедактирования);
	
	Пользователь 				= CW_Настройки.Пользователь();
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(Пользователь,Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(Пользователь);
	Если (ГруппаПользователя.ПолныеПрава) Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли;    
	УстановитьПривилегированныйРежим(Ложь);
	
	Список.Параметры.УстановитьЗначениеПараметра("НеИспользуютсяДинамическиеПараметры", Не ИспользованиеДинамическихПараметров);
	Список.Параметры.УстановитьЗначениеПараметра("Группа",					ГруппаПользователя);
	Список.Параметры.УстановитьЗначениеПараметра("ДляРедактирования", 		(ДляРедактирования=ИСТИНА));
	Список.Параметры.УстановитьЗначениеПараметра("АдминистраторСистемы",	ЭтоПолноправныйПользователь);
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьНаименованияСвязанныхПараметров(Команда)
	
	CW_МониторинговыеПараметрыКлиент.ОбновитьНаименованияСвязанныхПараметров(ЭтаФорма);

КонецПроцедуры   


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти
 