#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// при вводе на основании расходов
Функция Услуги_СформироватьПоДокументуДоходов(Документ,Договор) Экспорт 
	// --- 
	
	Ответ = _сф.ст_Создать("ТаблицаУслуг,Продавец,Код,Предупреждение");
	Ответ.Код=0;
	Ответ.Предупреждение="";
	
	// если документ не проведен, то предупреждаем
	Если НЕ Документ.Проведен Тогда
		
		Ответ.Код=1;
		Ответ.Предупреждение="Для ввода на основании документа в условных единицах документ должен быть проведен."; 
		Возврат(Ответ);
		
	Иначе
		
		ТаблицаУслуг = Документ.Услуги.Выгрузить();
		CW_Финансы.ДобавитьКолонкиБазовойВалюты(ТаблицаУслуг);
		
		// --- 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	CW_ДоходыПоГрузоперевозкам.НомерСтроки КАК НомерСтроки,
		               |	CW_ДоходыПоГрузоперевозкам.Всего КАК Всего_Рег,
		               |	CW_ДоходыПоГрузоперевозкам.Сумма КАК Сумма_Рег,
		               |	CW_ДоходыПоГрузоперевозкам.НДС КАК НДС_Рег
		               |ИЗ
		               |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
		               |ГДЕ
		               |	CW_ДоходыПоГрузоперевозкам.Регистратор = &Регистратор
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСтроки";
		Запрос.УстановитьПараметр("Регистратор", Документ);
		ТЗ = Запрос.Выполнить().Выгрузить();
		// --- 
		Если (ТЗ.Количество() <> 0) Тогда
			Для Индекс=0 По ТаблицаУслуг.Количество()-1 Цикл
				
				ЗаполнитьЗначенияСвойств(ТаблицаУслуг[Индекс],ТЗ[Индекс]);
				
			КонецЦикла; 
		КонецЕсли; 
		
		//
		// определяем продавца
		Продавец = Неопределено;
		ТЗ_Перевыставление = ТаблицаУслуг.Скопировать(Новый Структура("ПорядокОтражения",Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление));
		Если (ТЗ_Перевыставление.Количество() = ТаблицаУслуг.Количество()) Тогда
			// проверяем продавца
			Для каждого Стр Из ТЗ_Перевыставление Цикл
				ПродавецПоСтроке = Неопределено;		
				Если (НЕ Стр.ДокументРасходов.Продавец.Пустая()) Тогда
					ПродавецПоСтроке = Стр.ДокументРасходов.Продавец;
				Иначе
					ПродавецПоСтроке = Стр.ДокументРасходов.Контрагент;
				КонецЕсли; 
				Если (Продавец = Неопределено) Тогда
					Продавец = ПродавецПоСтроке;
				Иначе
					Если (ПродавецПоСтроке <> Продавец) Тогда
						Продавец = Неопределено;
						Прервать;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла; 
			
		КонецЕсли; 
		
		Ответ.Продавец = Продавец;
		Ответ.ТаблицаУслуг = ТаблицаУслуг;
		Возврат(Ответ);
		
	КонецЕсли; 
	
		// --- 
КонецФункции
	
// пересчет валютных сумм
Процедура Услуги_ПересчитатьИзВалютыРегламентированногоУчета(ТаблицаУслуг,СтруктураКурса) Экспорт  
	
	Для каждого Стр Из ТаблицаУслуг Цикл
		Стр.Всего = _сф.БезопасноРазделить(Стр.Всего_Рег * СтруктураКурса.Кратность,СтруктураКурса.Курс);
		Стр.НДС = _сф.БезопасноРазделить(Стр.НДС_Рег * СтруктураКурса.Кратность,СтруктураКурса.Курс);
		Стр.Сумма = Стр.Всего - Стр.НДС;
		Стр.Цена = _сф.БезопасноРазделить(Стр.Сумма,Стр.Количество);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если (ВидФормы = "ФормаСписка") Тогда
		
		СтандартнаяОбработка = Ложь;
		РежимПростойФормы = CW_Настройки.ПолучитьНастройкуПользователя(,"ПростаяФормаСпискаРасходов") ;
		Если (РежимПростойФормы) Тогда
			ВыбраннаяФорма = "ФормаСпискаПростаяУправляемая";
		Иначе
			ВыбраннаяФорма = "ФормаСпискаУправляемая";
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// для документов Расходов смотрим на зачтённые авансы, причём только на списания с р/счёта
Функция ПолучитьТаблицу_ПлатёжноРасчётныеДокументы_дляСФ(РасходыСсылка, ЗачетАвансов=Неопределено) Экспорт 
	
	СтруктураОтвета = Новый Структура("Код, ОписаниеОшибки", 0, "");
	
	Если Неопределено=ЗачетАвансов Тогда 
		// передана только ссылка (подразумеваем, что документ проведён)
		з = Новый Запрос(
			"выбрать РАЗЛИЧНЫЕ 
			|	докРасходыЗачетАвансов.ДокументАванса.НомерВходящегоДокумента КАК НомерДокумента,
			|	докРасходыЗачетАвансов.ДокументАванса.ДатаВходящегоДокумента КАК ДатаДокумента
			|из 
			|	документ.CW_РасходыПоГрузоперевозке.ЗачетАвансов КАК докРасходыЗачетАвансов
			|где 
			|	докРасходыЗачетАвансов.Ссылка = &РасходыСсылка
			|	И докРасходыЗачетАвансов.ДокументАванса Ссылка Документ.СписаниеСРасчетногоСчета"
		);
	Иначе 
		// передана таб.часть ЗачетАвансов - это делаем перед записью документа, когда последние изменения ещё не записаны по ссылке 
		з = Новый Запрос(
			"ВЫБРАТЬ тз.ДокументАванса, тз.НомерСтроки ПОМЕСТИТЬ вт ИЗ &тзЗачетАвансов КАК тз;
			|выбрать РАЗЛИЧНЫЕ 
			|	вт.ДокументАванса.НомерВходящегоДокумента КАК НомерДокумента,
			|	вт.ДокументАванса.ДатаВходящегоДокумента КАК ДатаДокумента
			|из 
			|	вт КАК вт
			|где 
			|	вт.ДокументАванса Ссылка Документ.СписаниеСРасчетногоСчета"
		);
		з.УстановитьПараметр("тзЗачетАвансов", ЗачетАвансов.Выгрузить());
	КонецЕсли;		
	з.УстановитьПараметр("РасходыСсылка", РасходыСсылка);
	тз = з.Выполнить().Выгрузить();
	
	СтруктураОтвета.Вставить("ПлатёжноРасчётныеДокументы", тз);
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПолучитьСчетНаОплатуПоставщика(СсылкаНаДокумент) Экспорт
	
	Если СсылкаНаДокумент.СписокСчетов Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если СсылкаНаДокумент.ПредъявленСчет Тогда
		Возврат СсылкаНаДокумент.ВедомыйСчет;
	ИначеЕсли СсылкаНаДокумент.ПредъявленАкт Тогда
		Возврат ПолучитьСчетНаОплатуПоставщика(СсылкаНаДокумент.Счет);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСвязанныеСчета(СсылкаНаДокумент) Экспорт
	
	Если Не СсылкаНаДокумент.СписокСчетов Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаДокумент.Счет);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Счет КАК Счет
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	мСвязанныеСчета = Новый Массив;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Счет) 
			и мСвязанныеСчета.Найти(Выборка.Счет) = Неопределено Тогда
			мСвязанныеСчета.Добавить(Выборка.Счет);                                                        
		КонецЕсли;
	КонецЦикла;
	
	Возврат мСвязанныеСчета;
	
КонецФункции

//Шаблоны стандартных писем
Процедура ДополнитьМакросыОбъекта(ДеревоМакросов) Экспорт
	
	ГруппаМакросов = ДеревоМакросов.Строки.Добавить();  
	ГруппаМакросов.ИндексКартинки 	= 0;
	ГруппаМакросов.Значение 		= "";
	ГруппаМакросов.Представление 	= "Расходы по грузоперевозке";
	ГруппаМакросов.ЭтоГруппа 		= Истина;
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[НомерСчета]",	"Номер счета",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаСчета]",	"Дата счета",	2);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[НомерАкта]",	"Номер акта",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаАкта]",	"Дата акта",	2);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[НомерСчетаФактуры]",	"Номер Счета-фактуры",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаСчетаФактуры]",	"Дата Счета-фактуры",	2);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СрокОплаты]",	"Срок оплаты",	2);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ПланОплаты]",	"План оплаты",	2);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[НомерДоговора]",	"Номер договора",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаДоговора]",	"Дата договора",	2);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ВалютаДоговора]",	"Валюта договора",	5);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[НомерПриложения]",		"Номер приложения",		4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаПриложения]",		"Дата приложения",		2);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ВалютаПриложения]",	"Валюта приложения",	5);

	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ОрганизацияСокр]",		"Организация (сокращенное)",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ОрганизацияПолн]",		"Организация (полное)",			4);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Клиент]",	"Клиент",	4);
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов") Тогда 
		ДобавитьСтрокуМакросов(ГруппаМакросов, "[СтатусДокумента]",				"Статус документа",	4);
		ДобавитьСтрокуМакросов(ГруппаМакросов, "[СтатусДокументаКомментарий]",	"Статус документа - комментарий",	4);
	КонецЕсли; 	
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СписокГрузоперевозок]",	"Список грузоперевозок",	9);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СписокЗаказов]",			"Список заказов",			9);
	
	ГруппаПараметров = ГруппаМакросов.Строки.Добавить();  
	ГруппаПараметров.ИндексКартинки = 0;
	ГруппаПараметров.Значение 		= "";
	ГруппаПараметров.Представление 	= "Параметры грузоперевозок";
	ГруппаПараметров.ЭтоГруппа 		= Истина;
	
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ДополнитьМакросыПараметровГрузоперевозок(ГруппаПараметров);
	
КонецПроцедуры 

Процедура ДобавитьСтрокуМакросов(ГруппаМакросов, Значение, Представление, ИндексКартинки)
	
	СтрокаМакроса = ГруппаМакросов.Строки.Добавить();
	СтрокаМакроса.ИндексКартинки 	= ИндексКартинки;
	СтрокаМакроса.Значение 			= Значение;
	СтрокаМакроса.Представление 	= Представление;
	СтрокаМакроса.ЭтоГруппа 		= Ложь;
	
КонецПроцедуры
	

Процедура ПолучитьОписаниеМакросов(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если ДополнительныеПараметры <> Неопределено 
		и ДополнительныеПараметры.Корректировка Тогда
		
		Результат.Вставить("[ДатаАкта]", 	"Источник.ВедомыйДокументКорректировки.Дата");
		Результат.Вставить("[НомерАкта]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник.ВедомыйДокументКорректировки)");
		
		Результат.Вставить("[ДатаСчета]", 	"Источник.ДатаСчета");
		Результат.Вставить("[НомерСчета]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник, ""НомерСчета"", ""ДатаСчета"")");  
		
	Иначе
		
		Результат.Вставить("[ДатаАкта]", 	"Источник.ДатаАкта");
		Результат.Вставить("[НомерАкта]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник, ""НомерАкта"", ""ДатаАкта"")");
		
		// документ Доходов может сам себе быть счётом, а может ссылаться на другой документ Доходов
		Если ДополнительныеПараметры <> Неопределено  
			и НЕ ДополнительныеПараметры.ФормируетсяСчет И ДополнительныеПараметры.ФормируетсяАкт И ДополнительныеПараметры.ЕстьСчет Тогда
			
			Результат.Вставить("[ДатаСчета]", 	"Источник.Счет.ДатаСчета");
			Результат.Вставить("[НомерСчета]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник.Счет, ""НомерСчета"", ""ДатаСчета"")");
			
		Иначе
			
			Результат.Вставить("[ДатаСчета]", 	"Источник.ДатаСчета");
			Результат.Вставить("[НомерСчета]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник, ""НомерСчета"", ""ДатаСчета"")");
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Результат.Вставить("[ДатаСчетаФактуры]", 	"Источник.ДатаСФ");
	Результат.Вставить("[НомерСчетаФактуры]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник, ""НомерСФ"", ""ДатаСФ"")");
	
	Результат.Вставить("[СрокОплаты]", 	    "CW_Документы.ПолучитьСрокОплаты(Источник).ДатаОплаты");
	Результат.Вставить("[ПланОплаты]", 	    "CW_Документы.ПолучитьПланОплаты(Источник).Дата");
	
	Результат.Вставить("[ВалютаДоговора]", 	"Источник.Договор.ВалютаДоговора");
	Результат.Вставить("[ДатаДоговора]", 	"Источник.Договор.ДатаДоговора");
	Результат.Вставить("[НомерДоговора]", 	"Источник.Договор.НомерДоговора");
	Результат.Вставить("[Клиент]", 			"Источник.Контрагент.НаименованиеПолное");
	
	Результат.Вставить("[СписокГрузоперевозок]", 	"МенеджерОбъектаШаблона.ПолучитьСписокГрузоперевозок(Источник)");
	Результат.Вставить("[СписокЗаказов]", 			"МенеджерОбъектаШаблона.ПолучитьСписокЗаказов(Источник)");
	
	Результат.Вставить("[НомерПриложения]", 	"Источник.ПриложениеКДоговору.НомерДокумента");
	Результат.Вставить("[ДатаПриложения]", 		"Источник.ПриложениеКДоговору.ДатаДокумента");
	Результат.Вставить("[ВалютаПриложения]", 	"Источник.ПриложениеКДоговору.ВалютаДоговора");
	
	Результат.Вставить("[ОрганизацияСокр]",	"");
	Результат.Вставить("[ОрганизацияПолн]",	"");
	
	Результат.Вставить("[ОрганизацияСокр]",	"Справочники.Организации.НаименованияНаДату(Источник.Организация,Источник.Дата).СокращенноеНаименование");
	Результат.Вставить("[ОрганизацияПолн]",	"Справочники.Организации.НаименованияНаДату(Источник.Организация,Источник.Дата).ПолноеНаименование");
	
	Результат.Вставить("[СтатусДокумента]",	           "РегистрыСведений.CW_СтатусыДокументов.ПолучитьДанныеСтатусаДокумента(Источник).СтатусДокумента");
	Результат.Вставить("[СтатусДокументаКомментарий]", "РегистрыСведений.CW_СтатусыДокументов.ПолучитьДанныеСтатусаДокумента(Источник).Комментарий");
	
	Результат.Вставить("[ФИООтправителя]", "CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(НастройкиПользователя.ФИО, Источник.Дата)");

	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ОписаниеМакросовПараметровГрузоперевозок(Результат);
	
КонецПроцедуры    

Функция ПараметрыОписанияМакросов(ОбъектШаблона) Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("Корректировка",		ОбъектШаблона.Корректировка) ;
	Структура.Вставить("ФормируетсяСчет", 	ОбъектШаблона.ПредъявленСчет);
	Структура.Вставить("ФормируетсяАкт", 	ОбъектШаблона.ПредъявленАкт);
	Структура.Вставить("ЕстьСчет", 			ЗначениеЗаполнено(ОбъектШаблона.Счет));
	
	Возврат Структура;
	
КонецФункции      

Функция ПолучитьСписокГрузоперевозок(Источник) Экспорт
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабличнаяЧастьУслуги.Грузоперевозка КАК Грузоперевозка
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК ТабличнаяЧастьУслуги
	               |ГДЕ
	               |	ТабличнаяЧастьУслуги.Ссылка = &Источник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТабличнаяЧастьУслуги.Грузоперевозка";
	
	Запрос.УстановитьПараметр("Источник", Источник); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Грузоперевозка);
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, ", ");
	
КонецФункции
 
Функция ПолучитьСписокЗаказов(Источник) Экспорт
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабличнаяЧастьУслуги.Грузоперевозка.Заказ КАК Заказ
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК ТабличнаяЧастьУслуги
	               |ГДЕ
	               |	ТабличнаяЧастьУслуги.Ссылка = &Источник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТабличнаяЧастьУслуги.Грузоперевозка.Заказ";
	
	Запрос.УстановитьПараметр("Источник", Источник); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Заказ);
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, ", ");
	
КонецФункции
 
Функция ПолучитьЗначениеПараметра(Источник, ИдентификаторПараметра,  ПолучаемоеЗначение = "Значение", СоответствиеПараметров) Экспорт

	ПараметрСсылка = СоответствиеПараметров.Получить(ИдентификаторПараметра);
	Если ПараметрСсылка = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	МассивГрузоперевозок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабличнаяЧастьУслуги.Грузоперевозка КАК Грузоперевозка
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК ТабличнаяЧастьУслуги
	               |ГДЕ
	               |	ТабличнаяЧастьУслуги.Ссылка = &Источник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТабличнаяЧастьУслуги.Грузоперевозка";
	
	Запрос.УстановитьПараметр("Источник", Источник); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивГрузоперевозок.Добавить(Выборка.Грузоперевозка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка,
	               |	ЕСТЬNULL(ПараметрыГрузоперевозок.Значение, ЕСТЬNULL(ПараметрыЗаказов.Значение, НЕОПРЕДЕЛЕНО)) КАК Значение,
	               |	ЕСТЬNULL(ПараметрыГрузоперевозок.ЗначениеПлан, ЕСТЬNULL(ПараметрыЗаказов.ЗначениеПлан, НЕОПРЕДЕЛЕНО)) КАК ЗначениеПлан,
	               |	ЕСТЬNULL(ПараметрыГрузоперевозок.ЗначениеФакт, ЕСТЬNULL(ПараметрыЗаказов.ЗначениеФакт, НЕОПРЕДЕЛЕНО)) КАК ЗначениеФакт
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК ПараметрыГрузоперевозок
	               |		ПО CW_Грузоперевозки.Ссылка = ПараметрыГрузоперевозок.Грузоперевозка
	               |			И (ПараметрыГрузоперевозок.Параметр = &Параметр)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиЗаказов КАК ПараметрыЗаказов
	               |		ПО CW_Грузоперевозки.Заказ = ПараметрыЗаказов.Заказ
	               |			И (ПараметрыЗаказов.Параметр = &Параметр)
	               |ГДЕ
	               |	CW_Грузоперевозки.Ссылка В(&МассивГрузоперевозок)";
	
	Запрос.УстановитьПараметр("МассивГрузоперевозок", 	МассивГрузоперевозок);
	Запрос.УстановитьПараметр("Параметр", 				ПараметрСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Массив = новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗначениеПараметра = Выборка[ПолучаемоеЗначение];
		Если Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Массив.Найти(ЗначениеПараметра) = Неопределено Тогда
			Массив.Добавить(ЗначениеПараметра);
		конецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, ", ");

КонецФункции
//---Шаблоны стандартных писем


#КонецЕсли
