#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
  
Перем ДС Экспорт;

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = CW_Документы.ПрефиксОрганизации(Организация);	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Неопределено;
	
	СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
	СпособЗачетаАвансовОЗ = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
	КодСпособаПолученияСФ = 1;
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
	
	// состав пакета
	НастройкиПользователя = CW_Настройки.ПолучитьНастройкиПользователя();
	Если CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Счета") Тогда
		ПредъявленСчет = НастройкиПользователя.Расходы_ПредъявленСчет;
	КонецЕсли; 
	Если CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Акты") Тогда
		ПредъявленАкт = НастройкиПользователя.Расходы_ПредъявленАкт;
		ПредъявленСФ  = НастройкиПользователя.Расходы_ПредъявленСчетФактура;
	КонецЕсли; 
	// состав пакета
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		// только шапка
		// происходит при добавлении из формы элемента спр.CW_ДоговорыПоГрузоперевозкам
		Если ДанныеЗаполнения.Свойство("Договор") Тогда 
			Организация = ДанныеЗаполнения.Договор.Организация;
			Контрагент  = ДанныеЗаполнения.Договор.Владелец;
			Договор     = ДанныеЗаполнения.Договор; 
			
			Если ДанныеЗаполнения.Свойство("Валюта") Тогда
				Валюта      = ДанныеЗаполнения.Валюта;        
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("КорректируемыйДокумент") Тогда
			
			Корректировка = Истина;
			КорректируемыйДокумент = ДанныеЗаполнения.КорректируемыйДокумент;
				
			//Исправления
			ВидОперацииКорректировки = КорректируемыйДокумент.ВидОперацииКорректировки;
			Если НЕ ЗначениеЗаполнено(ВидОперацииКорректировки) Тогда
				ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение");
			Конецесли;
			
			Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
				НомерСФ 			= КорректируемыйДокумент.НомерСФ;
				ДатаСФ 				= КорректируемыйДокумент.ДатаСФ;
				НомерИсправления 	= КорректируемыйДокумент.НомерИсправления + 1;
			конецЕсли;
			//Исправления   
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,КорректируемыйДокумент,"Организация,Контрагент,Договор,ПриложениеКДоговору,Валюта,Продавец,ПредъявленСчет,ПредъявленАкт,ПредъявленСФ,ЭтоУниверсальныйДокумент,ЦенаСНДС");
			
			//AFR23-3305  от 01.02.2023
			ИсключаяСвойства = "";
			Если ДанныеЗаполнения.КорректируемыйДокумент.ПредъявленАкт Тогда
				СписокСчетов = Ложь; 
				ИсключаяСвойства = "Счет";
			КонецЕсли;
			//AFR23-3305  от 01.02.2023   
			
			ПоказатьРубли =  КорректируемыйДокумент.ПоказатьРубли;
			
			Для Каждого КорректируемаяСтрока Из КорректируемыйДокумент.Услуги Цикл
				
				НоваяСтрока = Услуги.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КорректируемаяСтрока,,ИсключаяСвойства); //Свойство счет исключено из заполнения по заявке: AFR23-3305  от 01.02.2023 
	
				НоваяСтрока.Представление_ДоКорректировки 	= КорректируемаяСтрока.Представление;
				НоваяСтрока.Количество_ДоКорректировки 		= КорректируемаяСтрока.Количество;
				НоваяСтрока.Цена_ДоКорректировки 			= КорректируемаяСтрока.Цена;
				НоваяСтрока.Сумма_ДоКорректировки 			= КорректируемаяСтрока.Сумма;
				НоваяСтрока.СтавкаНДС_ДоКорректировки 		= КорректируемаяСтрока.СтавкаНДС;
				НоваяСтрока.НДС_ДоКорректировки 			= КорректируемаяСтрока.НДС;
				НоваяСтрока.Всего_ДоКорректировки 			= КорректируемаяСтрока.Всего;
				
				НоваяСтрока.Покупатель_ДоКорректировки 			= КорректируемаяСтрока.Покупатель;
				НоваяСтрока.ДоговорПокупателя_ДоКорректировки 	= КорректируемаяСтрока.ДоговорПокупателя;
				НоваяСтрока.ПриложениеКДоговору_ДоКорректировки = КорректируемаяСтрока.ПриложениеКДоговору;
				
				НоваяСтрока.Представление_ПередКорректировкой 	= КорректируемаяСтрока.Представление_ДоКорректировки;
				НоваяСтрока.Количество_ПередКорректировкой 		= КорректируемаяСтрока.Количество_ДоКорректировки;
				НоваяСтрока.Цена_ПередКорректировкой 			= КорректируемаяСтрока.Цена_ДоКорректировки;
				НоваяСтрока.Сумма_ПередКорректировкой 			= КорректируемаяСтрока.Сумма_ДоКорректировки;
				НоваяСтрока.СтавкаНДС_ПередКорректировкой 		= КорректируемаяСтрока.СтавкаНДС_ДоКорректировки;
				НоваяСтрока.НДС_ПередКорректировкой 			= КорректируемаяСтрока.НДС_ДоКорректировки;
				НоваяСтрока.Всего_ПередКорректировкой 			= КорректируемаяСтрока.Всего_ДоКорректировки;  
				
				Если ПоказатьРубли Тогда
					НоваяСтрока.Цена_ДоКорректировкиРег		= КорректируемаяСтрока.ЦенаРег;
					НоваяСтрока.Сумма_ДоКорректировкиРег	= КорректируемаяСтрока.СуммаРег;
					НоваяСтрока.НДС_ДоКорректировкиРег		= КорректируемаяСтрока.НДСРег;
					НоваяСтрока.Всего_ДоКорректировкиРег	= КорректируемаяСтрока.ВсегоРег;
					
					НоваяСтрока.Цена_ПередКорректировкойРег		= КорректируемаяСтрока.Цена_ДоКорректировкиРег;
					НоваяСтрока.Сумма_ПередКорректировкойРег	= КорректируемаяСтрока.Сумма_ДоКорректировкиРег;
					НоваяСтрока.НДС_ПередКорректировкойРег		= КорректируемаяСтрока.НДС_ДоКорректировкиРег;
					НоваяСтрока.Всего_ПередКорректировкойРег	= КорректируемаяСтрока.Всего_ДоКорректировкиРег;  
				КонецЕсли;
				
				НоваяСтрока.Покупатель_ПередКорректировкой 			= КорректируемаяСтрока.Покупатель_ДоКорректировки;
				НоваяСтрока.ДоговорПокупателя_ПередКорректировкой 	= КорректируемаяСтрока.ДоговорПокупателя_ДоКорректировки;
				НоваяСтрока.ПриложениеКДоговору_ПередКорректировкой = КорректируемаяСтрока.ПриложениеКДоговору_ДоКорректировки;
				
			КонецЦикла; 
			
		КонецЕсли; 
		
		Возврат;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	// ввод акта к ранее зарегистрированному счету
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументОбъект.CW_РасходыПоГрузоперевозке") ИЛИ 
		 ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") 
	Тогда
		
		// проверяем, что, в документе должен стоять только флажок счета
		Документ = ДанныеЗаполнения;
		Если (Документ.ПредъявленАкт ИЛИ Документ.ПредъявленСФ) И НЕ Документ.ПредъявленСчет Тогда
			
			//Сообщить(("Ввод на основании предусмотрен для затратных документов
			//			   |в которых среди перечня предоставленных первичных документов
			//			   |указан только счет!", 10);
			СтандартнаяОбработка = Ложь;
			Возврат;
		Иначе
			
			// заполняем
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,Документ,,"ВедомыйСчет,ВедомыйДокумент,ВедомыйСчетФактура,Дата");
			Для каждого КорректируемаяСтрока Из Документ.Услуги Цикл
				
				Нстр = Услуги.Добавить();
				ЗаполнитьЗначенияСвойств(Нстр,КорректируемаяСтрока);
				
			КонецЦикла; 
			
			СохранитьДату = CW_Настройки.ПолучитьНастройкуПользователя(,"УстанавливатьДатуАктаРавнойДатеСчетаПриВводеНаОснованииРасходы");

			
			// номер документа очистим 
			Номер = "";
			
			// укажем, что получили только акт
			ПредъявленСчет = Ложь;
			НомерСчета = "";
			ДатаСчета = Дата(1,1,1);
			
			ПредъявленАкт = Истина;
			ПредъявленСФ = НастройкиПользователя.Расходы_ПредъявленСчетФактура;
			
			// ссылаемся на счет
			Счет = Документ;
			
			// установим дату и время документа
			Если СохранитьДату тогда
				Дата = ДанныеЗаполнения.Дата;
			КонецЕсли;
			
			СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
			СтруктураПараметров.Дата 				= ЭтотОбъект.Дата;
			СтруктураПараметров.Договор 			= ЭтотОбъект.Договор;
			СтруктураПараметров.ПриложениеКДоговору = ЭтотОбъект.ПриложениеКДоговору;
			
			СтруктураПараметровДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "ПорядокЗачетаАвансов");
			
			ЭтотОбъект.СпособЗачетаАвансов = СтруктураПараметровДоговора.ПорядокЗачетаАвансов;
			
			// установим дату и время акта
			Если Не ЗначениеЗаполнено(ДатаАкта) Тогда
				ДатаАкта = Дата;
				Если (ПредъявленСФ) Тогда
					ДатаСФ = ДатаАкта;
				КонецЕсли; 
			Иначе
				ДатаСтрокой = Формат(ДатаАкта,"ДФ=yyyyMMdd");
				ВремяСтрокой = Формат(Дата,"ДФ=HHmmss");
				ДатаАкта = Дата(ДатаСтрокой+ВремяСтрокой);
			КонецЕсли;
			
			// попробуем "угадать" номер акта
			Если Не ЗначениеЗаполнено(НомерАкта) Тогда
				НомерАкта = Документ.НомерСчета;
				Если (ПредъявленСФ) Тогда
					НомерСФ = НомерАкта;
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// сбрасываем параметры, подлежащие определению для нового документа
	ВедомыйСчет = Документы.СчетНаОплатуПоставщика.ПустаяСсылка();
	ВедомыйДокумент = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	ВедомыйСчетФактура = Документы.СчетФактураПолученный.ПустаяСсылка();
	Ответственный = CW_Настройки.Пользователь();
	ЗачетАвансов.Очистить();
	ЗачетАвансовОЗ.Очистить();
	
	// учитываем опции, установленные у пользователя
	НП = CW_Настройки.ПолучитьНастройкиПользователя();
	УстанавливатьТекущееВремя = НП.ПриКопированниУстанавливатьТекущееВремя;
	Если (УстанавливатьТекущееВремя = Неопределено) Тогда
		УстанавливатьТекущееВремя = Ложь;
	КонецЕсли; 
	Если (УстанавливатьТекущееВремя) Тогда
		Дата = CW_Документы.РабочееВремя();
	КонецЕсли; 
	ОчищатьСведенияПервичныхДокументов = НП.ОчищатьСведенияОПервичныхДокументахПриКопированииРасходов;
	Если (ОчищатьСведенияПервичныхДокументов = Неопределено) Тогда
		ОчищатьСведенияПервичныхДокументов = Ложь;
	КонецЕсли; 
	
	Если (ОчищатьСведенияПервичныхДокументов) Тогда
		
		ПредъявленСчет = Ложь;
		НомерСчета = "";
		ДатаСчета = Дата(1,1,1);
		// --- 
		ПредъявленАкт = Ложь;
		НомерАкта = "";
		ДатаАкта = Дата(1,1,1);
		// --- 
		ПредъявленСФ = Ложь;
		НомерСФ = "";
		ДатаСФ = Дата(1,1,1);	
		
		ДатаПолучения = Дата(1,1,1);
		
	КонецЕсли; 
	
	Если (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Счета")) Тогда
		
		ПредъявленСчет = Ложь;
		НомерСчета = "";
		ДатаСчета = Дата(1,1,1);
		
	КонецЕсли; 
	
	Если (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Акты")) Тогда
		
		ПредъявленАкт = Ложь;
		НомерАкта = "";
		ДатаАкта = Дата(1,1,1);
		// --- 
		ПредъявленСФ = Ложь;
		НомерСФ = "";
		ДатаСФ = Дата(1,1,1);
		
		ДатаПолучения = Дата(1,1,1);
		
	КонецЕсли; 
	
	ПлатёжноРасчётныеДокументы.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если (ОбменДанными.Загрузка) Тогда Возврат; КонецЕсли;
	// --- 
	ПроверяемыеРеквизиты.Очистить();
	
	флОшибка = Ложь;
	МассивСообщений = Новый Массив;
	
	Для Каждого Стр Из Услуги Цикл
		
		Если CW_Настройки.ПолучитьНастройкуПользователя(, "ПроверятьНоменклатурнуюГруппу") Тогда
			Если НЕ ЗначениеЗаполнено(Стр.Номенклатура.НоменклатурнаяГруппа) Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("У номенклатуры в строке " + Стр.НомерСтроки + " отсутствует номенклатурная группа!");
			КонецЕсли;
		КонецЕсли;	
		
		ГП = Стр.Грузоперевозка;
		ТП = Стр.Грузоперевозка.ТипПеревозки;
		Если ЗначениеЗаполнено(ТП) Тогда
			Если (ТП.КонтрольЗаполненияКлиентаРасходы И НЕ ЗначениеЗаполнено(ГП.Клиент)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Клиент""");
				флОшибка = Истина;
			КонецЕсли; 
			
			Если (ТП.КонтрольЗаполненияТипоразмераРасходы И НЕ ЗначениеЗаполнено(ГП.Типоразмер)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Типоразмер контейнера""");
				флОшибка = Истина;
			КонецЕсли; 
			
			Если (ТП.КонтрольЗаполненияГрузаРасходы И Константы.CW_Мониторинг_Груз.Получить() И НЕ ЗначениеЗаполнено(ГП.Груз)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Груз""");
				флОшибка = Истина;
			КонецЕсли; 
			
			Если (ТП.КонтрольЗаполненияМаршрутаРасходы И Константы.CW_Мониторинг_Маршрут.Получить() И НЕ ЗначениеЗаполнено(ГП.Маршрут)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Маршрут""");
				флОшибка = Истина;
			КонецЕсли; 
						
			Если (ТП.КонтрольЗаполненияМенеджераПродажРасходы И Константы.CW_Мониторинг_МенеджерПродаж.Получить() И НЕ ЗначениеЗаполнено(ГП.МенеджерПродаж)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Менеджер продаж""");
				флОшибка = Истина;
			КонецЕсли; 
						
			Если (ТП.КонтрольЗаполненияОперативногоМенеджераРасходы И Константы.CW_Мониторинг_ОперативныйМенеджер.Получить() И НЕ ЗначениеЗаполнено(ГП.ОперативныйМенеджер)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Оперативный менеджер""");
				флОшибка = Истина;
			КонецЕсли; 
			
			Отбор = Новый Структура("КонтрольЗаполненияРасходы", Истина);
			КонтроллируемыеПараметры = ТП.ПараметрыГрузоперевозки.Выгрузить(Отбор);
			СоответствиеСвойствПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
			Для Каждого СтрП Из КонтроллируемыеПараметры Цикл
				флПараметрНезаполнен = Ложь;
				ОтборПоПараметру = Новый Структура("Параметр", СтрП.Параметр);
				СтрокаПараметра = _сф.к_НайтиСтроку(ГП.ПараметрыГрузоперевозки, ОтборПоПараметру);
				СП = СоответствиеСвойствПараметров.Получить(СтрП.Параметр);
				Если (СтрокаПараметра = Неопределено) Тогда
					флПараметрНезаполнен = Истина;
				Иначе
					Если (СП.ЭтоКонтрольнаяДата) Тогда
						Если (НЕ ЗначениеЗаполнено(СтрокаПараметра.ЗначениеФакт)) Тогда
							флПараметрНезаполнен = Истина;
						КонецЕсли; 
					Иначе
						Если (НЕ ЗначениеЗаполнено(СтрокаПараметра.Значение)) Тогда
							флПараметрНезаполнен = Истина;
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли; 
				
				Если (флПараметрНезаполнен) Тогда
					МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный параметр """ + СП.Наименование + """");
					флОшибка = Истина;
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 

	КонецЦикла;	
	
	Если флОшибка Тогда
		Для Каждого Стр Из МассивСообщений Цикл
			Сообщить(Стр, СтатусСообщения.Внимание);
		КонецЦикла; 
		
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РучнаяКорректировка Тогда
		Возврат; 
	КонецЕсли; 
	
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"СтатусПроведенияДоПроведения", Проведен);
	
	//Для версии КОРП 
	ВестиУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для версии КОРП 
	
	// проверка прав
	ПроведениеРазрешено = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов");
	Если (Корректировка) Тогда
		ПроведениеРазрешено = ПроведениеРазрешено И CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Корректировки");
	КонецЕсли; 
	Если (НЕ ПроведениеРазрешено) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недостаточно прав на проведение документа!",,,,Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьСоответствиеБухгалтескогоУчетаДогововров(Отказ);
	
	Если Отказ тогда
		Возврат;
	Конецесли;
	
	// обмен данными
	Если (ОбменДанными.Загрузка) Тогда
		Возврат; 
	КонецЕсли;
	
	ВедетсяУчетПриложений = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");
	Если ЗначениеЗаполнено(ПриложениеКДоговору) и ВедетсяУчетПриложений Тогда
		ОбъектПараметров = ПриложениеКДоговору;
	Иначе
		ОбъектПараметров = Договор;
	КонецЕсли;
	
	ТребуетсяЗаполнениеПокупателя = CW_Настройки.ПолучитьЗначениеПараметраДоговора(Дата, ОбъектПараметров, 
									"ТребоватьЗаполненияПокупателяДляПорядокаОтраженияЗатратыВРасходах");
	
	//Подситема.СтатусыДокументов
	СтатусДокумента = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента", СтатусДокумента);
	
	СтатусДокументаПроводитьПоБухгалтерскомуУчету = CW_СтатусыДокументовСервер.ПолучитьПризнакПроведенияПоБухгалтерскомуУчету(Ссылка, СтатусДокумента);
	//Подситема.СтатусыДокументов

	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор",					Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	СтруктураПараметровБухУчета.Вставить("ВедетсяУчетПриложений",	ВедетсяУчетПриложений);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	
	ПровестиПоБухгалтерскомуУчету = СтатусДокументаПроводитьПоБухгалтерскомуУчету и ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет;
	
	// контроль услуг по договору     
	Если ПолучитьФункциональнуюОпцию("CW_ОграничиватьУслугиПоДоговорам") и Договор.ОграничиватьНоменклатуру Тогда	
		
		ДатаДокумента = Дата;
		Если ПредъявленАкт 
			и ЗначениеЗаполнено(ДатаАкта) Тогда
			ДатаДокумента = ДатаАкта;  
		ИначеЕсли ПредъявленСчет  
			и ЗначениеЗаполнено(ДатаСчета)Тогда
			ДатаДокумента = ДатаСчета;  
		КонецЕсли;      
		
		АдресУслуг = _УФС.ОбновитьСписокУслугПоДоговору(ДатаДокумента, Договор);  
		
		Если ЭтоАдресВременногоХранилища(АдресУслуг) Тогда
			ТаблицаУслугДоговора 	= ПолучитьИзВременногоХранилища(АдресУслуг);
			МассивУслугДоговора 	= ТаблицаУслугДоговора.ВыгрузитьКолонку("Номенклатура"); 
			
			ИсключитьПеревыставление = Константы.CW_НеОграничиватьСписокУслугПриПеревыставленииЗатрат.Получить();
			МассивУслугДокумента 	 = ПолучитьМассивУслугДокумента(ИсключитьПеревыставление);
			
			CW_Документы.ПроверитьСоответствиеУслугПоДоговору(МассивУслугДоговора, МассивУслугДокумента, Отказ);
			
		КонецЕсли;
		
		Если Отказ тогда
			Возврат;
		Конецесли;
		
	КонецЕсли;		
	
	// не перепроводим при восстановлении последовательности
	ВосстановлениеПоследовательности = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ПроведенВХронологическойПоследовательности");
	Если (ВосстановлениеПоследовательности <> Неопределено) Тогда
		Если (ВосстановлениеПоследовательности) Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	// контроль порядка отражения
	Если ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет Тогда
		CW_Финансы.ПредупреждениеПоСхемеУчетаПеревыставленияПоСтавкам(ЭтотОбъект);	
	КонецЕсли; 
	
	// контроль наличия общих параметров
	Если (НЕ ЗаполненыОбщиеПараметры()) Тогда 
		СформироватьОбщиеПараметры(,Ложь); 
	КонецЕсли; 
	
	// если изменились даты начала ведения учета, то обновим соответствующие флаги
	// (при условии того, что в документе указана организация и договор)
	Если ЗначениеЗаполнено(Организация) и ЗначениеЗаполнено(Организация) Тогда
		Если ВводОстатковБУ <> ДополнительныеСвойства.УП.ВводОстатковБУ Тогда
			ВводОстатковБУ = ДополнительныеСвойства.УП.ВводОстатковБУ;	
		КонецЕсли; 
		Если ВводОстатковОЗ <> ДополнительныеСвойства.УП.ВводОстатковОЗ Тогда
			ВводОстатковОЗ = ДополнительныеСвойства.УП.ВводОстатковОЗ;	
		КонецЕсли; 	
	Иначе
		ВводОстатковБУ = Ложь;
		ВводОстатковОЗ = Ложь;
	КонецЕсли; 
	
	// фиксируем режим записи
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"РежимЗаписи",РежимЗаписи);
	
	// проверка распроведения счетов с актами и оплатами
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ЭтоСчет 	= ПредъявленСчет;
		ЭтоАкт 		= Не ПредъявленСчет и (ПредъявленАкт или ПредъявленСФ);
		ЭтоПакет 	= ПредъявленСчет и (ПредъявленАкт или ПредъявленСФ);
		
		// получим значение базовой валюты
		БазоваяВалютаРубль = Константы.CW_ВалютаРегламентированногоУчетаРубль.Получить();
		
		ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов");
		
		РедактированиеСчета 				= CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Счета");
		РедактированиеАктированныхСчетов 	= CW_ПраваДоступа.ПравоДоступно("РазрешитьРедактированиеВходящихАктированныхСчетов") 	И РедактированиеСчета;
		РедактированиеОплаченныхСчетов 		= CW_ПраваДоступа.ПравоДоступно("РазрешитьРедактированиеВходящихОплаченныхСчетов") 		И РедактированиеСчета;
		
		// проверяем, ведётся ли оперативная задолженность
		//Если ДС.УП.ОЗ и НЕ ЭтоПакет Тогда
		Если ДС.УП.ОЗ Тогда
			
			Если Корректировка и ПравоРедактирования Тогда
				ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Корректировки");
			КонецЕсли;
			
			Если ЭтоАкт И ПравоРедактирования Тогда
				ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Акты");
			Конецесли;
			
			Если ПравоРедактирования И ЭтоСчет и РедактированиеСчета и БазоваяВалютаРубль Тогда
				
				Если Не РедактированиеАктированныхСчетов и ПравоРедактирования Тогда
					// проверяем, что нет сформированных актов
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	CW_СоответствиеАктовВходящимСчетам.Акт КАК Акт
					|ИЗ
					|	РегистрСведений.CW_СоответствиеАктовВходящимСчетам КАК CW_СоответствиеАктовВходящимСчетам
					|ГДЕ
					|	CW_СоответствиеАктовВходящимСчетам.Счет = &Счет";
					
					Запрос.УстановитьПараметр("Счет", Ссылка);
					РезультатЗапроса = Запрос.Выполнить();
					
					ПравоРедактирования = РезультатЗапроса.Пустой();
				КонецЕсли;
				
				Если Не РедактированиеОплаченныхСчетов и ПравоРедактирования Тогда
					// проверяем, нет ли оплат
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					|	CW_ОплатаВходящихДокументов.ДокументОплаты КАК ДокументОплаты
					|ИЗ
					|	РегистрСведений.CW_ОплатаВходящихДокументов КАК CW_ОплатаВходящихДокументов
					|ГДЕ
					|	CW_ОплатаВходящихДокументов.Документ = &Документ";
					Запрос.УстановитьПараметр("Документ", Ссылка);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ПравоРедактирования = РезультатЗапроса.Пустой();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ПравоРедактирования Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				ТекстСообщения = "Недостаточно прав для отмены проведения документа!";
			КонецЕсли;
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				ТекстСообщения = "Недостаточно прав для проведения документа!";
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// сформируем представление
	СформироватьПредставлениеДокумента();
	
	// для документов в у.е., в случае если установлена опция ввода документа в рублевом эквиваленте,
	// рассчитаем пользовательский курс как соотношение рублевого и валютного эквивалента документа  
	Если ПоказатьРубли Тогда                                                                       
		
		// получим кратность валюты на дату акта
		СК = CW_Финансы.ПолучитьКурсВалюты(Валюта,ДатаАкта);
		УЕ_Кратность = СК.Кратность;
  		
		УЕ_ПользовательскийКурс = Истина;
		УЕ_Курс = ?(Услуги.Итог("Всего")= 0,1,Окр(Услуги.Итог("ВсегоРег")/(Услуги.Итог("Всего")*УЕ_Кратность),4,РежимОкругления.Окр15как20));  
	КонецЕсли;
	
	// фиксируем сумму Всего и сумму НДС
	Если (НЕ Корректировка) Тогда
		СуммаДокумента 	= _сф.Итог(Услуги,"Всего");
		СуммаНДС		= _сф.Итог(Услуги,"НДС");	
	Иначе
		пСуммаДокумента = 0;
		пСуммаНДС = 0;
		
		Для каждого Стр Из Услуги Цикл
			_сф.Инкремент(пСуммаДокумента,Стр.Всего - Стр.Всего_ДоКорректировки);
			_сф.Инкремент(пСуммаНДС,Стр.НДС - Стр.НДС_ДоКорректировки);
		КонецЦикла; 
		
		СуммаДокумента = пСуммаДокумента;
		СуммаНДС = пСуммаНДС;
	КонецЕсли; 
	
	// ответственный
	_сф.УстановитьЕслиНезаполнено(Ответственный,CW_Настройки.Пользователь()); 
	
	// список контейнеров
	мГП = _сф.м_СоздатьИзКолонкиТЗ(Услуги.Выгрузить(,"Грузоперевозка"),"Грузоперевозка");
	нСписокГП  = _сф.м_Представление(мГП,",");
	Если нСписокГП <> СписокКонтейнеров Тогда
		СписокКонтейнеров = СтрЗаменить(нСписокГП,",",", ");
	КонецЕсли; 
	
	// Контроль срока договора / приложения   
	СтруктураПараметров = CW_Документы.ПустаяСтруктураКонтроляСрокаДействияДоговора(); 
	СтруктураПараметров.КонтролироватьСрокДоговоров 	= ДС.НП.КонтролироватьСрокДоговоров;
	СтруктураПараметров.КонтролироватьСрокПриложения 	= ДС.НП.КонтролироватьСрокДействияПриложения; 
	
	CW_Документы.ПроверитьСрокДействияДоговора(ЭтотОбъект, СтруктураПараметров, Отказ);
	
	// для подстановки последнего договора записываем его в регистр
	CW_Документы.ЗаписатьПоследнийДоговор(Договор);
	
	// аналогично по строкам таб.части
	ТаблицаДоговоровКлиентов = _сф.т_СкопироватьСвернуть(Услуги.Выгрузить(),"ДоговорПокупателя");
	Для Каждого СтрокаДоговора Из ТаблицаДоговоровКлиентов Цикл
		CW_Документы.ЗаписатьПоследнийДоговор(СтрокаДоговора.ДоговорПокупателя);
	КонецЦикла;
	
	Если (ПредъявленСчет) Тогда
		Счет = Неопределено;
		СписокСчетов = Ложь;
	КонецЕсли; 
	
	// перезаполняем счета задолженности
	СтруктураСчетов = CW_Финансы.СтруктураСчетовРасчетов_Поставщики(Дата,Организация); 
	
	мЗатраты = Новый Массив;
	мЗатраты.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Затраты);
	мЗатраты.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы);   

	ВремУслуги = Услуги.Выгрузить();
	ВремУслуги.Свернуть("ПорядокОтражения");

	ЕстьПеревыставление = Ложь;
	ЕстьСобственные = Ложь;
	
	Если ВремУслуги.Количество() = 1 Тогда
		//Во всех строках что-то одно
		СтрокаТаблицы = ВремУслуги[0];
		Если мЗатраты.Найти(СтрокаТаблицы.ПорядокОтражения) <> Неопределено	Тогда
			ЕстьСобственные = истина;       
		Иначе
			ЕстьПеревыставление = Истина;
		КонецЕсли;   
	ИначеЕсли ВремУслуги.Количество() = 2 Тогда  
		мПорядокОтражения = ВремУслуги.ВыгрузитьКолонку("ПорядокОтражения");   
		
		Если мПорядокОтражения.Найти(Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) <> Неопределено Тогда 
			ЕстьСобственные = истина;       
		КонецЕсли;  
		Если мПорядокОтражения.Найти(Перечисления.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы) <> Неопределено Тогда 
			ЕстьСобственные = истина;       
		КонецЕсли;  
		
		Если мПорядокОтражения.Найти(Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление) <> Неопределено Тогда 
			ЕстьПеревыставление = истина;       
		КонецЕсли;  
		Если мПорядокОтражения.Найти(Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам) <> Неопределено Тогда 
			ЕстьПеревыставление = истина;       
		КонецЕсли;  
	Иначе
		ЕстьСобственные = истина;       
		ЕстьПеревыставление = Истина;
	КонецЕсли;
	
	
	Для каждого Стр Из Услуги Цикл
		Если (НЕ СписокСчетов) Тогда
			Стр.Счет = Неопределено;
		КонецЕсли; 
		
		Стр.СчетЗадолженности = CW_Финансы.ОпределитьСчетУчетаРасходов(Стр,СтруктураСчетов,Валюта <> ДС.КО.ВалютарегламентированногоУчета,Договор.ВзаиморасчетыВУЕ);
		
		Если Стр.СтатьяЗатрат.Пустая() Тогда
   			Стр.СтатьяЗатрат = Стр.Номенклатура.СтатьяЗатрат;
  		КонецЕсли; 
	КонецЦикла; 
	
	// синхронизация времени счета
	Если (ПредъявленСчет) Тогда
		Если (НачалоДня(ДатаСчета)=НачалоДня(Дата)) Тогда
			ДатаСчета = Дата;
		КонецЕсли; 	
	КонецЕсли; 
	
	// синхронизация времени акта
	Если (ПредъявленАкт) Тогда
		Если (НачалоДня(ДатаАкта)=НачалоДня(Дата)) Тогда
			ДатаАкта = Дата;
		КонецЕсли; 	
		Если (НачалоДня(ДатаСФ)=НачалоДня(Дата)) Тогда
			ДатаСФ = Дата;
		КонецЕсли; 	
	КонецЕсли; 
	
	НП = CW_Настройки.ПолучитьНастройкиПользователя();
	БлокироватьПриОтличиеДатыАкта = НП.БлокироватьПриОтличиеДатыАкта;
	Если (БлокироватьПриОтличиеДатыАкта = Неопределено) Тогда
		БлокироватьПриОтличиеДатыАкта = Ложь;
	КонецЕсли; 
	Если (БлокироватьПриОтличиеДатыАкта И ПредъявленАкт И РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
		Если (НачалоДня(ДатаАкта) <> НачалоДня(Дата)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата акта отличается от даты документа.",,"ДатаАкта", "Объект", Отказ);
		КонецЕсли; 
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// создание/удаление ведомых
	ФормироватьСчет = Ложь;
	ФормироватьАкт = Ложь;
	ФормироватьСчётФактура = Ложь;
	
	Если (РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		Если (НЕ Корректировка) Тогда
			
			// СЧЁТ
			Если (ПредъявленСчет И ДС.УП.ФормироватьСчетаПоставщикаНаОплату И ПровестиПоБухгалтерскомуУчету) Тогда
				
				Если ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет Тогда
					
					ФормироватьСчет = Истина;
					НоваяДата = ?(ФормироватьВедомыеДатойДокумента,Дата,ДатаСчета);
					
					ТребуетсяСозданиеВедомого = Ложь;
					Если (ВедомыйСчет.Пустая()) Тогда
						ТребуетсяСозданиеВедомого = Истина;
					КонецЕсли; 
					Если (НЕ ТребуетсяСозданиеВедомого) Тогда
						Если (НЕ _СФ.ОбъектБДСуществует(ВедомыйСчет)) Тогда
							ТребуетсяСозданиеВедомого = Истина;
						КонецЕсли; 
					КонецЕсли; 
					
					Если (ТребуетсяСозданиеВедомого ИЛИ НоваяДата <> ВедомыйСчет.Дата) Тогда
						
						// создаем
						Если (ТребуетсяСозданиеВедомого) Тогда
							Ведомый = Документы.СчетНаОплатуПоставщика.СоздатьДокумент();
							Ведомый.Контрагент 	= Контрагент;
							Ведомый.Комментарий = "Сформировано автоматически (CW) документом ""Расходы по грузоперевозке"" №"+Номер+" от "+СокрЛП(Дата);
						Иначе
							Ведомый = ВедомыйСчет.ПолучитьОбъект(); 
							
							Если Год(Ведомый.Дата) <> Год(НоваяДата) Тогда
								Ведомый.Номер = "";	
							КонецЕсли;
							
						КонецЕсли; 
						
						Ведомый.Дата 					= НоваяДата;
						Ведомый.ОбменДанными.Загрузка	= Истина;
						Ведомый.ПометкаУдаления 		= Ложь;
						Ведомый.Организация 			= Организация;
						
						Ведомый.СуммаВключаетНДС		= ЦенаСНДС;
						
						//Для версии КОРП
						Если ВестиУчетПоПодразделениям Тогда
							Ведомый.ПодразделениеОрганизации = ПодразделениеОрганизации;
						КонецЕсли;
						//Для версии КОРП     
						
						Ведомый.Комментарий = "Сформировано автоматически (CW) документом ""Расходы по грузоперевозке"" №"+Строка(Номер)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");
						
						CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,Ведомый);
						Ведомый.Записать();
						ВедомыйСчет = Ведомый.Ссылка;
						
							
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли; 
			
			// АКТА И СФ
			Если (ПредъявленАкт ИЛИ ПредъявленСФ) Тогда
				
				Если ПровестиПоБухгалтерскомуУчету Тогда
					
					ФормироватьАкт = Истина;
					НоваяДата = ?(ФормироватьВедомыеДатойДокумента,Дата,?(ПредъявленАкт,ДатаАкта,ДатаСФ));
					
					ТребуетсяСозданиеВедомого = Ложь;
					Если (ВедомыйДокумент.Пустая()) Тогда
						ТребуетсяСозданиеВедомого = Истина;
					КонецЕсли; 
					Если (НЕ ТребуетсяСозданиеВедомого) Тогда
						Если (НЕ _СФ.ОбъектБДСуществует(ВедомыйДокумент)) Тогда
							ТребуетсяСозданиеВедомого = Истина;
						КонецЕсли; 
					КонецЕсли; 
					Если (НЕ ЭтоНовый() И НЕ ТребуетсяСозданиеВедомого) Тогда
						
						// проверяем, не связан ли он уже с другим ведущим
						Ведущий = CW_Документы.ПолучитьВедущийДокумент(ВедомыйДокумент);
						Если (Ведущий = Неопределено ИЛИ Ведущий <> Ссылка) Тогда
							
							ТребуетсяСозданиеВедомого = Истина;
							ВедомыйДокумент = Неопределено;
							ВедомыйСчетФактура = Неопределено;
							
						КонецЕсли; 
						
					КонецЕсли; 
					
					// создаём/перезаполняем
					Если (ТребуетсяСозданиеВедомого ИЛИ НоваяДата <> ВедомыйДокумент.Дата ИЛИ ВедомыйДокумент.ПометкаУдаления) Тогда
						
						// создаем
						Если (ТребуетсяСозданиеВедомого) Тогда
							Ведомый = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
						Иначе
							Ведомый = ВедомыйДокумент.ПолучитьОбъект();
							
							Если Год(Ведомый.Дата) <> Год(НоваяДата) Тогда
								Ведомый.Номер = "";	
							КонецЕсли;
							
						КонецЕсли; 
						// --- 
						Ведомый.Дата 					= НоваяДата;
						Ведомый.ОбменДанными.Загрузка	= Истина;
						Ведомый.ПометкаУдаления 		= Ложь;
						Ведомый.Организация 			= Организация;
						
						Ведомый.ЭтоУниверсальныйДокумент = ЭтоУниверсальныйДокумент;  
						
						//Для версии КОРП
						Если ВестиУчетПоПодразделениям Тогда
							Ведомый.ПодразделениеОрганизации = ПодразделениеОрганизации;
						КонецЕсли;
						//Для версии КОРП

						CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,Ведомый);
						Ведомый.СчетНаОплатуПоставщика = Документы.CW_РасходыПоГрузоперевозке.ПолучитьСчетНаОплатуПоставщика(Ссылка);
						Ведомый.Записать();
						ВедомыйДокумент = Ведомый.Ссылка;
						
					КонецЕсли; 
					
					Если (ПредъявленСФ) Тогда
						
						ФормироватьСчётФактура = Истина;
						
						НоваяДатаСФ = ?(ФормироватьВедомыеДатойДокумента,Дата,ДатаСФ);
						
						Если ЗначениеЗаполнено(ДатаПолучения) Тогда
							НоваяДатаПолучения = ДатаПолучения;
						Иначе
							НоваяДатаПолучения = КонецДня(НоваяДатаСФ);
						КонецЕсли;

						
						//// если по каким-то причинам ссылка на счет-фактуру не была записана в ведущий документ
						//Если (ВедомыйСчетФактура.Пустая()) Тогда
						//	ВедомыйСФ = CW_Финансы.НайтиПолученнуюСчетФактуру(ВедомыйДокумент);
						//	Если (ВедомыйСФ <> Неопределено) Тогда
						//		ВедомыйСчетФактура = ВедомыйСФ;
						//	КонецЕсли;
						//КонецЕсли; 
						
						// получем для ведомого документа с\ф
						ВедомыйСФ = CW_Финансы.НайтиПолученнуюСчетФактуру(ВедомыйДокумент, ВедомыйДокумент.ПометкаУдаления);
						
						// в случае, если по каким-то причинам полученный с\ф не совпадает с документом,
						// прописанным в соответствующем реквизите ведущего документа, то
						// помечаем на удаление документ, прописанный в реквизите документа и 
						// перезаписываем его на вновь найденный
						Если ВедомыйСФ <> ВедомыйСчетФактура Тогда
							Если ЗначениеЗаполнено(ВедомыйСчетФактура) Тогда
								ТмпВедомый = ВедомыйСчетФактура.ПолучитьОбъект();
								ТмпВедомый.УстановитьПометкуУдаления(Истина);
							КонецЕсли;
						КонецЕсли;
						ВедомыйСчетФактура = ВедомыйСФ;
						
						// проверяем, что с\ф по текущему документу
						Если (НЕ ВедомыйСчетФактура.Пустая()) Тогда
							Если (ВедомыйСчетФактура.ДокументОснование <> ВедомыйДокумент) Тогда
								ВедомыйСчетФактура = Документы.СчетФактураПолученный.ПустаяСсылка();
							КонецЕсли; 	
						КонецЕсли; 
						
						// счет-фактура отсутствует
						Если (ВедомыйСчетФактура.Пустая()) Тогда
							НовыйСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
						Иначе
							НовыйСФ = ВедомыйСчетФактура.ПолучитьОбъект();	
							Если (НовыйСФ.ПометкаУдаления) Тогда
								НовыйСФ.УстановитьПометкуУдаления(Ложь);
							КонецЕсли;   
							
							Если Год(НовыйСФ.Дата) <> Год(НоваяДатаПолучения) Тогда
								НовыйСФ.Номер = "";	
							КонецЕсли;
						КонецЕсли;
						
						// перезаполняем реквизиты счета-фактуры
						НовыйСФ.ВидСчетаФактуры			= Перечисления.ВидСчетаФактурыПолученного.НаПоступление;
						НовыйСФ.Организация 			= Организация;
						НовыйСФ.Контрагент 				= Контрагент;
						НовыйСФ.Дата 					= НоваяДатаПолучения;
						НовыйСФ.НомерВходящегоДокумента = НомерСФ;
						НовыйСФ.ДатаВходящегоДокумента = ДатаСФ;
						
						НовыйСФ.НДСПредъявленКВычету 	= НДСПредъявленКВычету;
						
						Если НовыйСФ.ДокументыОснования.Найти(ВедомыйДокумент, "ДокументОснование") = Неопределено Тогда
							СтрокаДокументыОснования = НовыйСФ.ДокументыОснования.Добавить();
							СтрокаДокументыОснования.ДокументОснование = ВедомыйДокумент;
						КонецЕсли;
						
						НовыйСФ.ДокументОснование = ВедомыйДокумент;
						
						Если (НЕ НовыйСФ.ЭтоНовый()) Тогда
							НовыйСФ.ОпределениеПараметровСчетаФактуры();	
						КонецЕсли; 
						
						Если (ЗначениеЗаполнено(КодВидаОперации)) Тогда
							
							НовыйСФ.КодВидаОперации = КодВидаОперации;
							
						Иначе
							
							Если ((НовыйСФ.Дата >= Дата(2016,07,1) И ЕстьСобственные И ЕстьПеревыставление)) Тогда
								
								НовыйСФ.КодВидаОперации = "15";
								
							Иначе
								
								НовыйСФ.КодВидаОперации = "01";
								ТаблицаКодов = _сф.т_Создать("Код");
								Если (ЕстьСобственные) Тогда
									
									Нстр = ТаблицаКодов.Добавить();
									Нстр.Код = "01";
									
								КонецЕсли; 
								Если (ЕстьПеревыставление) Тогда
									
									Нстр = ТаблицаКодов.Добавить();
									Нстр.Код = ДС.УП.КодВидаОперацииДляВходящихСчетовФактур;
									
								КонецЕсли; 
								ТаблицаКодов.Свернуть("Код");
								НовыйСФ.КодВидаОперации = _сф.м_Представление(ТаблицаКодов.ВыгрузитьКолонку("Код"),";");
								
							КонецЕсли; 
							
						КонецЕсли; 
						
						НовыйСФ.КодСпособаПолучения = КодСпособаПолученияСФ;
						НовыйСФ.ОбменДанными.Загрузка = Истина;
						
						CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,НовыйСФ);
						Отказ = CW_Документы.ПроверкаНомера(НовыйСФ, РежимЗаписиДокумента.Запись, ЭтотОбъект,Ложь);
						
						Если Отказ Тогда 
							Возврат; 
						КонецЕсли;
						
						// прописываем ссылку на счет-фактуру в ведущий документ
						ВедомыйСчетФактура = НовыйСФ.Ссылка;
						
					Иначе
						Если (НЕ ВедомыйСчетФактура.Пустая()) Тогда
							ВедомыйСФ = ВедомыйСчетФактура.ПолучитьОбъект();
							_сф.ст_УстановитьСвойство(ВедомыйСФ.ДополнительныеСвойства,"СообщитьОбИзмененииРеквизитов",Ложь);
							ВедомыйСФ.УстановитьПометкуУдаления(Истина);
						КонецЕсли; 
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;  
		
		Если (Корректировка) Тогда
			
			
			// СЧЁТ
			Если (ПредъявленСчет И ДС.УП.ФормироватьСчетаПоставщикаНаОплату) Тогда
				
				Если ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет Тогда
					
					ФормироватьСчет = Истина;
					НоваяДата = ?(ФормироватьВедомыеДатойДокумента,Дата,ДатаСчета);
					
					ТребуетсяСозданиеВедомого = Ложь;
					Если (ВедомыйСчетКорректировочный.Пустая()) Тогда
						ТребуетсяСозданиеВедомого = Истина;
					КонецЕсли; 
					Если (НЕ ТребуетсяСозданиеВедомого) Тогда
						Если (НЕ _СФ.ОбъектБДСуществует(ВедомыйСчетКорректировочный)) Тогда
							ТребуетсяСозданиеВедомого = Истина;
						КонецЕсли; 
					КонецЕсли; 
					
					Если (ТребуетсяСозданиеВедомого ИЛИ НоваяДата <> ВедомыйСчетКорректировочный.Дата И ПровестиПоБухгалтерскомуУчету) Тогда
						
						// создаем
						Если (ТребуетсяСозданиеВедомого) Тогда
							Ведомый = Документы.СчетНаОплатуПоставщика.СоздатьДокумент();
							Ведомый.Контрагент 	= Контрагент;
							Ведомый.Комментарий = "Сформировано автоматически (CW) документом ""Расходы по грузоперевозке"" №"+Номер+" от "+СокрЛП(Дата);
						Иначе
							Ведомый = ВедомыйСчетКорректировочный.ПолучитьОбъект();  
							
							Если Год(Ведомый.Дата) <> Год(НоваяДата) Тогда
								Ведомый.Номер = "";	
							КонецЕсли;
						КонецЕсли; 
						
						Ведомый.Дата 					= НоваяДата;
						Ведомый.ОбменДанными.Загрузка	= Истина;
						Ведомый.ПометкаУдаления 		= Ложь;
						Ведомый.Организация 			= Организация; 
						
						Ведомый.СуммаВключаетНДС		= ЦенаСНДС;
						
						//Для версии КОРП
						Если ВестиУчетПоПодразделениям Тогда
							Ведомый.ПодразделениеОрганизации = ПодразделениеОрганизации;
						КонецЕсли;
						//Для версии КОРП
						
						Ведомый.Комментарий = "Сформировано автоматически (CW) документом ""Расходы по грузоперевозке"" №"+Строка(Номер)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");
						
						CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,Ведомый);
						Ведомый.Записать();
						ВедомыйСчетКорректировочный = Ведомый.Ссылка;
						
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли; 
			
			
			Если (ПредъявленАкт ИЛИ ПредъявленСФ) Тогда
				
				Если ПровестиПоБухгалтерскомуУчету Тогда
					
					// формируем ведомую корректировку поступления
					НоваяДата = ?(ФормироватьВедомыеДатойДокумента, Дата, ДатаАкта);
					
					ТребуетсяСозданиеВедомого = Ложь;
					Если (ВедомыйДокументКорректировки.Пустая()) Тогда
						ТребуетсяСозданиеВедомого = Истина;
					КонецЕсли; 
					Если (НЕ ТребуетсяСозданиеВедомого) Тогда
						Если (НЕ _СФ.ОбъектБДСуществует(ВедомыйДокументКорректировки)) Тогда
							ТребуетсяСозданиеВедомого = Истина;
						КонецЕсли; 
					КонецЕсли; 
					Если (НЕ ЭтоНовый() И НЕ ТребуетсяСозданиеВедомого) Тогда
						
						// проверяем, не связан ли он уже с другим ведущим
						Ведущий = CW_Документы.ПолучитьВедущийДокумент(ВедомыйДокументКорректировки);
						Если (Ведущий = Неопределено ИЛИ Ведущий <> Ссылка) Тогда
							
							ТребуетсяСозданиеВедомого = Истина;
							ВедомыйДокумент = Неопределено;
							ВедомыйСчетФактура = Неопределено;
							
						КонецЕсли; 
						
					КонецЕсли; 
					
					// создаём/перезаполняем
					Если (ТребуетсяСозданиеВедомого ИЛИ НоваяДата <> ВедомыйДокумент.Дата ИЛИ ВедомыйДокумент.ПометкаУдаления) Тогда
						
						// создаем
						Если (ТребуетсяСозданиеВедомого) Тогда
							Ведомый = Документы.КорректировкаПоступления.СоздатьДокумент();	
						Иначе
							Ведомый = ВедомыйДокументКорректировки.ПолучитьОбъект();
							Если Год(Ведомый.Дата) <> Год(НоваяДата) Тогда
								Ведомый.Номер = "";	
							КонецЕсли;
							
						КонецЕсли; 
						// --- 
						Ведомый.Дата 					= НоваяДата;
						Ведомый.ОбменДанными.Загрузка	= Истина;
						Ведомый.ПометкаУдаления 		= Ложь;
						Ведомый.Организация 			= Организация;
						
						Ведомый.ЭтоУниверсальныйДокумент = ЭтоУниверсальныйДокумент;
	
						//Для версии КОРП
						Если ВестиУчетПоПодразделениям Тогда
							Ведомый.ПодразделениеОрганизации = ПодразделениеОрганизации;
						КонецЕсли;
						//Для версии КОРП  
						
						НомерДатаВходящего = ПолучитьНомерИДатуВходящегоПоступления();
						Ведомый.ДатаВходящегоДокумента 	= НомерДатаВходящего.ДатаАкта;
						Ведомый.НомерВходящегоДокумента = НомерДатаВходящего.НомерАкта;  
						
						// формирование представления номера для документа "Корректировка поступления"
						Если ВидОперацииКорректировки = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда  
							Если КорректируемыйДокумент.Корректировка Тогда
								ИсправляемыйБухгалтерскийДокумент = КорректируемыйДокумент.ВедомыйДокументКорректировки;	
							Иначе
								ИсправляемыйБухгалтерскийДокумент = КорректируемыйДокумент.ВедомыйДокумент;	
							КонецЕсли;
							
							НомерПредставления 	= ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(
							ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсправляемыйБухгалтерскийДокумент, "Номер"), Истина, Ложь); 
							Ведомый.ПредставлениеНомера = Строка(НомерПредставления) + " (испр. " + НомерИсправления + ")";
						Иначе
							Если НЕ ЗначениеЗаполнено(Ведомый.Номер) Тогда
								Ведомый.УстановитьНовыйНомер();	
							КонецЕсли;
							
							Ведомый.ПредставлениеНомера = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Ведомый.Номер, Истина, Ложь);
						КонецЕсли;
						
						
						// в случае, если корректировочному документу оформляется с/ф, то запишем реквизиты корректируемой с/ф
						Если ПредъявленСФ Тогда 
							НомерДатаВходящего = ПолучитьНомерИДатуВходящегоСчетФактуры();
							Ведомый.НомерИсходногоДокумента  = НомерДатаВходящего.НомерСФ; 
							Ведомый.ДатаИсходногоДокумента   = НомерДатаВходящего.ДатаСФ; 
						КонецЕсли;
						
						
						CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,Ведомый);
						
						Ведомый.Комментарий = "Сформировано автоматически (CW) документом ""Расходы по грузоперевозке"" №"+Строка(Номер)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");
						
						Ведомый.Записать();
						ВедомыйДокументКорректировки = Ведомый.Ссылка;
						
					КонецЕсли; 
					
					// --- 
					
					Если (ПредъявленСФ) Тогда
						
						ТребуетсяСозданиеСФ = Ложь;
						Если (НЕ ЗначениеЗаполнено(ВедомыйСчетФактураКорректировочный)) Тогда
							ТребуетсяСозданиеСФ=Истина;
						КонецЕсли; 
						Если (НЕ ТребуетсяСозданиеВедомого) Тогда
							Если (НЕ _СФ.ОбъектБДСуществует(ВедомыйСчетФактураКорректировочный)) Тогда
								ТребуетсяСозданиеВедомого = Истина;
							КонецЕсли; 
						КонецЕсли;
						Если (ТребуетсяСозданиеСФ ИЛИ ДатаСФ <> ВедомыйСчетФактураКорректировочный.Дата ИЛИ ВедомыйСчетФактураКорректировочный.ПометкаУдаления) Тогда
							
							Если (ТребуетсяСозданиеСФ) Тогда
								Ведомый = Документы.СчетФактураПолученный.СоздатьДокумент();
							Иначе
								Ведомый = ВедомыйСчетФактураКорректировочный.ПолучитьОбъект();  
								Если Год(Ведомый.Дата) <> Год(?(ЗначениеЗаполнено(ДатаПолучения), ДатаПолучения, Дата)) Тогда
									Ведомый.Номер = "";	
								КонецЕсли;
								
							КонецЕсли; 
							
							Ведомый.ВидСчетаФактуры			= Перечисления.ВидСчетаФактурыПолученного.Корректировочный;
							
							Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
								Ведомый.Дата 				= ?(ЗначениеЗаполнено(ДатаПолучения), ДатаПолучения, Дата); 
								Ведомый.ДатаИсправления		= ДатаСФ;
								Ведомый.НомерИсправления	= НомерИсправления;
								Ведомый.ВидСчетаФактуры		= Перечисления.ВидСчетаФактурыПолученного.Корректировочный;
							Иначе
								Ведомый.Дата				= ?(ЗначениеЗаполнено(ДатаПолучения), ДатаПолучения, КонецДня(ДатаСФ));
								//Ведомый.Номер 				= НомерСФ;
							КонецЕсли;
							
							НомерДатаВходящего = ПолучитьНомерИДатуВходящегоСчетФактуры();
							Ведомый.ДатаВходящегоДокумента 	= НомерДатаВходящего.ДатаСФ;
							Ведомый.НомерВходящегоДокумента = НомерДатаВходящего.НомерСФ;   
							
							Ведомый.ДокументыОснования.Очистить();
					
							Ведомый.Организация	 			= Организация;
							Ведомый.Контрагент	 			= Контрагент;
							
							//КодВидаОперации
							Если ЗначениеЗаполнено(КодВидаОперации) Тогда
								Ведомый.КодВидаОперации = КодВидаОперации;  
								Ведомый.КодВидаОперацииНаУменьшение = КодВидаОперации;  
							Иначе
								Если Ведомый.Дата >= Дата(2016,07,1) И ЕстьСобственные И ЕстьПеревыставление Тогда
									Ведомый.КодВидаОперации = "15";
									Ведомый.КодВидаОперацииНаУменьшение = "18";  
								Иначе
									
									Ведомый.КодВидаОперации = "01";
									Ведомый.КодВидаОперацииНаУменьшение = "18";  
									
									мКоды = Новый Массив;
									Если ЕстьСобственные Тогда  
										мКоды.Добавить("01");
									КонецЕсли; 
									
									Если ЕстьПеревыставление Тогда 
										мКоды.Добавить(ДС.УП.КодВидаОперацииДляВходящихСчетовФактур);
									КонецЕсли; 
									
									Ведомый.КодВидаОперации = СтрСоединить(мКоды,";");
									
								КонецЕсли; 
							КонецЕсли; 
							//КодВидаОперации
	
							CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,Ведомый);
							
							Ведомый.Комментарий = "Сформировано автоматически (CW) документом ""Расходы по грузоперевозке"" №"+Строка(Номер)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");
							
							Ведомый.ПометкаУдаления 		= Ложь;
							Ведомый.ОбменДанными.Загрузка	= Истина;
							Ведомый.Записать();
							
							ВедомыйСчетФактураКорректировочный = Ведомый.Ссылка;
							
						КонецЕсли; 
						
						
					КонецЕсли; 
					
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// пометка удаления для неиспользуемых ведомых
	Если (НЕ Корректировка) Тогда
		Если (НЕ ФормироватьСчет И ЗначениеЗаполнено(ВедомыйСчет) И НЕ ВедомыйСчет.ПометкаУдаления) Тогда
			
			Ведомый = ВедомыйСчет.ПолучитьОбъект();
			Ведомый.УстановитьПометкуУдаления(Истина);
			
		КонецЕсли; 
		Если (НЕ ФормироватьАкт И ЗначениеЗаполнено(ВедомыйДокумент) И НЕ ВедомыйДокумент.ПометкаУдаления) Тогда
			
			Ведомый = ВедомыйДокумент.ПолучитьОбъект();
			Ведомый.УстановитьПометкуУдаления(Истина);
			
		КонецЕсли; 
		Если (НЕ ФормироватьСчётФактура И ЗначениеЗаполнено(ВедомыйСчетФактура) И НЕ ВедомыйСчетФактура.ПометкаУдаления) Тогда
			
			Ведомый = ВедомыйСчетФактура.ПолучитьОбъект();
			Ведомый.УстановитьПометкуУдаления(Истина);
			
		КонецЕсли; 
	Иначе
		Если (НЕ ФормироватьСчет И ЗначениеЗаполнено(ВедомыйСчет) И НЕ ВедомыйСчет.ПометкаУдаления) Тогда
			
			Ведомый = ВедомыйСчетКорректировочный.ПолучитьОбъект();
			Ведомый.УстановитьПометкуУдаления(Истина);
			
		КонецЕсли; 
		Если (НЕ ПредъявленАкт И ЗначениеЗаполнено(ВедомыйДокументКорректировки) И НЕ ВедомыйДокументКорректировки.ПометкаУдаления) Тогда
			
			Ведомый = ВедомыйДокументКорректировки.ПолучитьОбъект();
			Ведомый.УстановитьПометкуУдаления(Истина);
			
		КонецЕсли; 
		Если (НЕ ПредъявленСФ И ЗначениеЗаполнено(ВедомыйСчетФактураКорректировочный) И НЕ ВедомыйСчетФактураКорректировочный.ПометкаУдаления) Тогда
			
			Ведомый = ВедомыйСчетФактураКорректировочный.ПолучитьОбъект();
			Ведомый.УстановитьПометкуУдаления(Истина);
			
		КонецЕсли; 
	КонецЕсли; 
	
	#Область ПроверкаЗаполненияРеквизитов
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		НалоговыйАгент = ПараметрыБухгалтерскогоУчета.УчетныйДоговор.УчетАгентскогоНДС;
		РазрешитьПроведениеДокументовБезГрузоперевозок 	= CW_ПраваДоступа.ПравоДоступно("РазрешитьПроведениеДокументовБезГрузоперевозок");
		КонтролироватьСтрокиСНулевойСуммой 				= CW_Настройки.ПолучитьНастройкуПользователя(,"КонтролироватьСтрокиСНулевойСуммой");
		
		// проверка реквизитов
		Если Организация.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана организация!",,"Организация", "Объект", Отказ);
		КонецЕсли; 
		Если Контрагент.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан контрагент!",,"Контрагент", "Объект", Отказ);
		КонецЕсли; 
		Если Договор.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан договор контрагента!",,"Договор", "Объект", Отказ);
		КонецЕсли; 
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			Если ПредъявленСчет Тогда
				Если СокрЛП(НомерСчета)="" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан номер счета!",,"НомерСчета", "Объект", Отказ);
				КонецЕсли;
				Если ДатаСчета = Дата(1,1,1) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата счета!",,"ДатаСчета", "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
			Если ПредъявленАкт Тогда
				Если СокрЛП(НомерАкта)="" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан номер акта!",,"НомерАкта", "Объект", Отказ);
				КонецЕсли;
				Если ДатаАкта = Дата(1,1,1) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата акта!",,"ДатаАкта", "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
			Если ПредъявленСФ Тогда
				Если СокрЛП(НомерСФ)="" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан номер  счета-фактуры!",,"НомерСФ", "Объект", Отказ);
				КонецЕсли;
				Если ДатаСФ = Дата(1,1,1) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата счета-фактуры!",,"ДатаСФ", "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
			
			Для каждого СтрокаУслуг Из Услуги Цикл
				
				ИндексСтроки = Услуги.Индекс(СтрокаУслуг);
				
				Если ДС.УП.ОЗ Тогда
					Если СписокСчетов Тогда
						Если (Дата >= ДС.УП.ДатаНачалаВеденияУчетаОЗ) Тогда
							Если СтрокаУслуг.Счет.Пустая() Тогда
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан актируемый счет!",,"Услуги["+ИндексСтроки+"].Счет", "Объект", Отказ);
							КонецЕсли; 
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли; 
				
				Если Не РазрешитьПроведениеДокументовБезГрузоперевозок Тогда
					Если (СтрокаУслуг.Грузоперевозка.Пустая()) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана грузоперевозка!",,"Услуги["+ИндексСтроки+"].Грузоперевозка", "Объект", Отказ);
					КонецЕсли; 
				КонецЕсли; 
				
				Если СтрокаУслуг.Номенклатура.Пустая() Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана номенклатура услуги!",,"Услуги["+ИндексСтроки+"].Номенклатура", "Объект", Отказ);
				КонецЕсли;
				
				Если ПолучитьФункциональнуюОпцию("CW_ОтображатьСтатьюЗатратВДокументахПоРасходамДоходам") Тогда
					Если СтрокаУслуг.СтатьяЗатрат.Пустая() и СтрокаУслуг.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты") Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана статья затрат!",,"Услуги["+ИндексСтроки+"].СтатьяЗатрат", "Объект", Отказ);
					КонецЕсли;                                                                                     
				КонецЕсли;
				
				Если (НЕ Корректировка) Тогда
					Если (СтрокаУслуг.Количество = 0) и КонтролироватьСтрокиСНулевойСуммой Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана количество!",,"Услуги["+ИндексСтроки+"].Количество", "Объект", Отказ);
					КонецЕсли;
					
					Если (СтрокаУслуг.Цена = 0) и КонтролироватьСтрокиСНулевойСуммой Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана цена!",,"Услуги["+ИндексСтроки+"].Цена", "Объект", Отказ);
					КонецЕсли;
					
					Если (СтрокаУслуг.Сумма = 0) и КонтролироватьСтрокиСНулевойСуммой Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана сумма!",,"Услуги["+ИндексСтроки+"].Сумма", "Объект", Отказ);
					КонецЕсли;
					
					Если СтрокаУслуг.СтавкаНДС.Пустая() Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана ставка НДС!",,"Услуги["+ИндексСтроки+"].СтавкаНДС", "Объект", Отказ);
					КонецЕсли;
					
					Если (НалоговыйАгент И СтрокаУслуг.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Должна быть указана ставка ""Без НДС""",,"Услуги["+ИндексСтроки+"].СтавкаНДС", "Объект", Отказ);
					КонецЕсли; 
					
					Если (СтрокаУслуг.НДС = 0) И 
						(СтрокаУслуг.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС) И
						(СтрокаУслуг.СтавкаНДС <> Перечисления.СтавкиНДС.НДС0) И 
						КонтролироватьСтрокиСНулевойСуммой Тогда
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана сумма НДС",,"Услуги["+ИндексСтроки+"].СтавкаНДС", "Объект", Отказ);
					КонецЕсли;
					
					Если (СтрокаУслуг.Всего = 0) И КонтролироватьСтрокиСНулевойСуммой Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана сумма всего",,"Услуги["+ИндексСтроки+"].Всего", "Объект", Отказ);
					КонецЕсли;
					
				КонецЕсли; 
				Если СтрокаУслуг.ПорядокОтражения.Пустая() Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан порядок отражения",,"Услуги["+ИндексСтроки+"].ПорядокОтражения", "Объект", Отказ);
				Иначе
					
					Если (СтрокаУслуг.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты и ТребуетсяЗаполнениеПокупателя)
						ИЛИ СтрокаУслуг.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление 
						ИЛИ СтрокаУслуг.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам Тогда
						
						Если СтрокаУслуг.Покупатель.Пустая() Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан покупатель!",,"Услуги["+ИндексСтроки+"].Покупатель", "Объект", Отказ);
						КонецЕсли;
						Если СтрокаУслуг.ДоговорПокупателя.Пустая() Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан договор покупателя!",,"Услуги["+ИндексСтроки+"].ДоговорПокупателя", "Объект", Отказ);
						КонецЕсли;
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли; // для режима записи "Проведение" 
		
		// проверка корректности ввода остатков
		Если (ВводОстатковБУ) Тогда
			
			// проверяем, курс по взаиморасчетам
			Если Валюта <> CW_Настройки.ВалютаРегламентированногоУчета() 
				И Договор.ВзаиморасчетыВУЕ И (КурсВзаиморасчетовБУ = 0)
				И (ПредъявленАкт Или ПредъявленСФ) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан курс взаиморасчётов по бухгалтерскому учету!",,"КурсВалюты", "ЭтаФорма", Отказ);
			КонецЕсли;	
			
		КонецЕсли; 
		
		Если (ВводОстатковОЗ) Тогда
			
			// проверяем, курс по взаиморасчетам
			Если  (СальдоВзаиморасчетовОЗ <> 0)
				И (Валюта <> CW_Настройки.ВалютаРегламентированногоУчета()) 
				И (КурсВзаиморасчетовОЗ = 0) 
				И (ПредъявленСчет)	Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан курс ввода остатков для оперативного учета задолженности!",,"КурсВалюты", "ЭтаФорма", Отказ);
							
			КонецЕсли;	
			
		КонецЕсли; 
		
	КонецЕсли; // проверка реквизитов для не помеченных на удаление документов
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	#КонецОбласти 
	
	#Область ЗачетАвансов 
	
	Если (НЕ ДС.УП.ОЗ) Тогда
		
		СпособЗачетаАвансовОЗ=Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
		ЗачетАвансовОЗ.Очистить();
		
	КонецЕсли; 
	
	Если (НЕ Корректировка) Тогда
		
		// заполнение ТЧ "ЗачетАвансаОЗ"
		Если (СпособЗачетаАвансовОЗ = Перечисления.СпособыЗачетаАвансов.Автоматически 
			И ДС.УП.ОЗ
			И РежимЗаписи=РежимЗаписиДокумента.Проведение
			И ПредъявленСчет) Тогда
			
			Если ДатаСчета <> Дата Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При ведении учета оперативной задолженности и автоматическом зачете авансов (ОУ) дата документа должна совпадать с датой счета",,"Дата", "Объект");
			КонецЕсли; 
			
			ДатаПодбораАвансов = Новый Граница(МоментВремени(),ВидГраницы.Исключая);
			ЗаполнитьТаблицуАвансовОЗ(ДатаПодбораАвансов);
			
		ИначеЕсли (СпособЗачетаАвансовОЗ = Перечисления.СпособыЗачетаАвансов.НеЗачитывать) Тогда 
			ЗачетАвансовОЗ.Очистить();		 
		КонецЕсли; 
		
		// заполнение ТЧ "ЗачетАванса"
		Если СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически
			И РежимЗаписи=РежимЗаписиДокумента.Проведение 
			И ПредъявленАкт 
			Тогда
			
			Если (НачалоДня(ДатаАкта) <> НачалоДня(Дата)) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При автоматическом зачете авансов (БУ) дата документа должна совпадать с датой акта",,"Дата", "Объект");
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ВедомыйДокумент) Тогда
				ЗаполнитьТаблицуАвансов(Новый Граница(ВедомыйДокумент.МоментВремени(),ВидГраницы.Исключая));
			Иначе
				ЗаполнитьТаблицуАвансов(Новый Граница(ДатаАкта,ВидГраницы.Исключая));
			КонецЕсли;
			
		ИначеЕсли (СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать) Тогда 
			ЗачетАвансов.Очистить();		 
			
		КонецЕсли;	
		
		// заполнение таб.части "Платёжно-расчётные документы с/ф"
		Если ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.Автоматически 
			И РежимЗаписи=РежимЗаписиДокумента.Проведение 
			И ПредъявленСФ
		Тогда 
			Ответ = Документы.CW_РасходыПоГрузоперевозке.ПолучитьТаблицу_ПлатёжноРасчётныеДокументы_дляСФ(ЭтотОбъект.Ссылка, ЗачетАвансов);
			Если Ответ.Код = 0 Тогда
				ЭтотОбъект.ПлатёжноРасчётныеДокументы.Загрузить(Ответ.ПлатёжноРасчётныеДокументы);
			Иначе 
				Сообщить(Ответ.ОписаниеОшибки);
			КонецЕсли;
			
		ИначеЕсли ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.НеУчитывать Тогда  
			ЭтотОбъект.ПлатёжноРасчётныеДокументы.Очистить();
			
		КонецЕсли;
	КонецЕсли; 
	
	#КонецОбласти 
	
КонецПроцедуры

Функция ПолучитьМассивУслугДокумента(ИсключитьПеревыставление) 
	
	МассивУслуг = Новый Массив;                               
	
	Для Каждого СтрокаУслуг из Услуги Цикл                    
		Если ИсключитьПеревыставление и СтрокаУслуг.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление") Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивУслуг.Найти(СтрокаУслуг.Номенклатура) = Неопределено Тогда
			МассивУслуг.Добавить(СтрокаУслуг.Номенклатура);	
		КонецЕсли;
		
	КонецЦикла;      
	
	Возврат МассивУслуг;
	
КонецФункции


Процедура ПриЗаписи(Отказ) Экспорт
	
	// обмен данными
	Если (ОбменДанными.Загрузка) Тогда Возврат; КонецЕсли;
	Если (РучнаяКорректировка) Тогда Возврат; КонецЕсли; 
	
	// не перепроводим при восстановлении последовательности
	ВосстановлениеПоследовательности = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ПроведенВХронологическойПоследовательности");
	
	Если (ВосстановлениеПоследовательности <> Неопределено) Тогда
		Если (ВосстановлениеПоследовательности) Тогда
			
			Возврат;
			
		КонецЕсли; 
	КонецЕсли; 
	
	//Для версии КОРП 
	ВестиУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для версии КОРП 

	// контроль наличия общих параметров
	Если (НЕ ЗаполненыОбщиеПараметры()) Тогда СформироватьОбщиеПараметры(,Ложь); КонецЕсли; 
	
	// определяем, что делать с подчинённым документом
	РежимЗаписи = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"РежимЗаписи");
	
	//Подситема.СтатусыДокументов
	ИспользуютсяСтатусыДокументов = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов");
	Если ИспользуютсяСтатусыДокументов И
		Не ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
		//В случае если используются статусы документа и проведение не из формы, тов ДС статуса нет
		ДанныеСтатуса = РегистрыСведений.CW_СтатусыДокументов.ПолучитьДанныеСтатусаДокумента(Ссылка);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СтатусДокумента", ДанныеСтатуса.СтатусДокумента);
	КонецЕсли;

	СтатусДокумента = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента", СтатусДокумента);
	
	СтатусДокументаПроводитьПоБухгалтерскомуУчету = CW_СтатусыДокументовСервер.ПолучитьПризнакПроведенияПоБухгалтерскомуУчету(Ссылка, СтатусДокумента);
	//Подситема.СтатусыДокументов

	ВедетсяУчетПриложенийПоДоговорам = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");

	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор",					Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	СтруктураПараметровБухУчета.Вставить("ВедетсяУчетПриложений",	ВедетсяУчетПриложенийПоДоговорам);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	
	
	ПровестиПоБухгалтерскомуУчету = СтатусДокументаПроводитьПоБухгалтерскомуУчету и ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет;
	
	// ЗАПИСЬ
	Если (РежимЗаписи = РежимЗаписиДокумента.Запись) Тогда
		ПроверитьСтатусВедомых(РежимЗаписи);
	КонецЕсли;
	
	// ОТМЕНА ПРОВЕДЕНИЯ
	Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		Если (НЕ Корректировка) Тогда
			
			// проверяем возможность отмены проведения
			Если (НЕ ПроверитьЗакрытиеГрузоперевозок()) Тогда
				Сообщить("В документе присутствуют закрытие грузоперевозки. Операция отменена.",СтатусСообщения.Важное);
				Отказ = Истина;
				Возврат;
			КонецЕсли; 
		КонецЕсли; 
				
		ПроверитьСтатусВедомых(РежимЗаписи);
		
		// удаляем движения
		Для каждого Набор Из Движения Цикл
			
			Набор.Прочитать();
			Набор.Очистить();
			
		КонецЦикла;
		Движения.Записать();
		
	КонецЕсли;
	
	// ПРОВЕДЕНИЕ
	Если (РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
		
		Счета = CW_Конфигурация.ПланСчетов(); 
		
		Если ЗначениеЗаполнено(ПриложениеКДоговору) Тогда
			Если ЗначениеЗаполнено(ПриложениеКДоговору.ДатаЗакрытия) И (КонецДня(ПриложениеКДоговору.ДатаЗакрытия) <= Дата) Тогда
				Отказ = Истина;
				Сообщить(Ссылка);
				Сообщить("Проведение документа позднее даты закрытия приложения к договору с контрагентом невозможно!");
				Возврат;
			КонецЕсли; 
		КонецЕсли; 

		Если ЗначениеЗаполнено(Договор.ДатаЗакрытия) И (КонецДня(Договор.ДатаЗакрытия) <= Дата) Тогда
			Отказ = Истина;
			Сообщить(Ссылка);
			Сообщить("Проведение документа позднее даты закрытия договора с контрагентом невозможно!");
			Возврат;
		КонецЕсли; 
		
		ОчищатьДвижения = Истина;
		// удаляем собственные движения	
		Если (ПредъявленАкт ИЛИ ПредъявленСФ) И ПровестиПоБухгалтерскомуУчету Тогда
			
			Если (НЕ Корректировка) Тогда
				ПроверяемыйДокумент = ВедомыйДокумент;
			Иначе
				ПроверяемыйДокумент = ВедомыйДокументКорректировки;
			КонецЕсли; 
			
			Если (НЕ ПроверяемыйДокумент.РучнаяКорректировка) Тогда
				
				ОчищатьДвижения = Истина;
				
			Иначе 
				
				СтатусПроведенияДоПроведения = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"СтатусПроведенияДоПроведения",Ложь);
				Если (НЕ СтатусПроведенияДоПроведения) Тогда
					Сообщить(Ссылка);
					Сообщить("Ведомый документ содержит признак ручной корректировки. Проведение заблокировано.");
					Отказ = Истина;
					Возврат;
				Иначе	
					
					Сообщить("Внимание! У ведомого документа "+Строка(ПроверяемыйДокумент)+" установлен признак ручной корректировки движений!");
					ОчищатьДвижения = Ложь;
					// ничего не делаем
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (ОчищатьДвижения) Тогда
			
			Для каждого Набор Из Движения Цикл
				
				Набор.Прочитать();
				Набор.Очистить();
				
			КонецЦикла;
			Движения.Записать();
			
		Иначе
			
			Возврат;
			
		КонецЕсли; 
		
		Если (НЕ Корректировка) Тогда
			
			//проверяем на ввод начальных остатков...
			ДатаНачалаВеденияУчета = CW_Настройки.ПолучитьДатуНачалаВеденияУчета(Организация);
			Если НЕ ДатаНачалаВеденияУчета = Неопределено Тогда
				РежимВводначальныхОстатков = Ложь;		
				Если Дата < ДатаНачалаВеденияУчета Тогда		
					РежимВводначальныхОстатков = Истина;
				Иначе
					РежимВводначальныхОстатков = Ложь;
				КонецЕсли;	
			Иначе
				РежимВводначальныхОстатков = Ложь;	
			КонецЕсли;
			Если РежимВводначальныхОстатков Тогда
				Если Договор.ВзаиморасчетыВУЕ Тогда
					
					ПроверятьКурс = Ложь;
					Для каждого Стр Из Услуги Цикл
						Если (Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление ИЛИ Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам) И Стр.ВводОстатков Тогда
							ПроверятьКурс = Истина;	
							Прервать;
						КонецЕсли; 
					КонецЦикла;
					
					Если ПроверятьКурс Тогда
						Если КурсВзаиморасчетовБУ = 0 Тогда
							Сообщить("Курс у.е. не заполнен! см.вкладу ""Дополнительно"".");
							Отказ = Истина;
							Возврат;
						КонецЕсли;	
					КонецЕсли; 
					
				КонецЕсли;	
			КонецЕсли; 
			
		КонецЕсли; 
		
		// заполняем ведомые
		Если (НЕ Корректировка) Тогда
			
			Если ПровестиПоБухгалтерскомуУчету Тогда
				
				// ведомый счёт
				Если (ПредъявленСчет И ДС.УП.ФормироватьСчетаПоставщикаНаОплату) Тогда
					
					ВедомыйОбъект = ВедомыйСчет.ПолучитьОбъект();
					ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления); 
					
					Если Год(ВедомыйОбъект.Дата) <> Год(?(ФормироватьВедомыеДатойДокумента,Дата,ДатаСчета)) Тогда
						ВедомыйОбъект.Номер = "";	
					КонецЕсли;
					
					
					// --- 
					ВедомыйОбъект.Организация 			= Организация;
					ВедомыйОбъект.Дата 					=?(ФормироватьВедомыеДатойДокумента,Дата,ДатаСчета);
					ВедомыйОбъект.Контрагент 			= Контрагент;
					ВедомыйОбъект.ДоговорКонтрагента 	= ПараметрыБухгалтерскогоУчета.УчетныйДоговор;
					ВедомыйОбъект.ВалютаДокумента 		= ПараметрыБухгалтерскогоУчета.УчетныйДоговор.ВалютаВзаиморасчетов; 
					
					ВедомыйОбъект.СуммаВключаетНДС 		= ЦенаСНДС;
					
					СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(ВедомыйОбъект.ВалютаДокумента, ВедомыйОбъект.Дата);
					ВедомыйОбъект.КурсВзаиморасчетов 		= СтруктураКурса.Курс;
					ВедомыйОбъект.КратностьВзаиморасчетов 	= СтруктураКурса.Кратность;
					
					//Для версии КОРП
					Если ВестиУчетПоПодразделениям Тогда
						ВедомыйОбъект.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП
					
					// --- 
					РасчетныйСчет = ДС.ПД.РасчетныйСчет;
					Если (НЕ ЗначениеЗаполнено(РасчетныйСчет)) Тогда
						ВедомыйОбъект.БанковскийСчетКонтрагента = Неопределено;
					Иначе
						ВедомыйОбъект.БанковскийСчетКонтрагента = РасчетныйСчет;
					КонецЕсли;
					// --- 
					ВедомыйОбъект.НомерВходящегоДокумента = НомерСчета;
					ВедомыйОбъект.ДатаВходящегоДокумента = ДатаСчета;
					// --- 
					ВедомыйОбъект.СуммаДокумента = Услуги.Итог("Всего");
					// --- 
					ЕстьТовары = (Документы.СчетНаОплатуПоставщика.ПустаяСсылка().Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено);
					Если (ЕстьТовары) Тогда
						
						ВедомыйОбъект.Товары.Очистить();
						Для каждого СтрокаУслуги Из Услуги Цикл
							
							Нстр = ВедомыйОбъект.Товары.Добавить();
							Нстр.Номенклатура = СтрокаУслуги.Номенклатура;
							Нстр.Содержание = СокрЛП(СтрокаУслуги.Представление);
							Нстр.СтавкаНДС = СтрокаУслуги.СтавкаНДС;
							Нстр.Количество = СтрокаУслуги.Количество;
							
							Если ЦенаСНДС Тогда
								Нстр.Цена = СтрокаУслуги.Цена - СтрокаУслуги.НДС/?(СтрокаУслуги.Количество=0,1,СтрокаУслуги.Количество); 
							Иначе
								Нстр.Цена = СтрокаУслуги.Цена; 
							КонецЕсли; 
							
							Нстр.Сумма = СтрокаУслуги.Сумма;
							Нстр.СуммаНДС = СтрокаУслуги.НДС; 
							
							Если ЦенаСНДС Тогда
								Нстр.Сумма 		= Нстр.Сумма + Нстр.СуммаНДС;
							КонецЕсли;
							
						КонецЦикла; 
						
					Иначе
						ВедомыйОбъект.Услуги.Очистить();
						Для каждого СтрокаУслуги Из Услуги Цикл
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							Нстр.Номенклатура = СтрокаУслуги.Номенклатура;
							Нстр.Содержание = СокрЛП(СтрокаУслуги.Представление);
							Нстр.СтавкаНДС = СтрокаУслуги.СтавкаНДС;
							Нстр.Количество = СтрокаУслуги.Количество;  
							
							Если ЦенаСНДС Тогда
								Нстр.Цена = СтрокаУслуги.Цена - СтрокаУслуги.НДС/?(СтрокаУслуги.Количество=0,1,СтрокаУслуги.Количество); 
							Иначе
								Нстр.Цена = СтрокаУслуги.Цена;  
							КонецЕсли;
						
							Нстр.Сумма = СтрокаУслуги.Сумма;
							Нстр.СуммаНДС = СтрокаУслуги.НДС;  
							
							Если ЦенаСНДС Тогда
								Нстр.Сумма 		= Нстр.Сумма + Нстр.СуммаНДС;
							КонецЕсли;
							
						КонецЦикла; 
					КонецЕсли; 
					
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъект);
					ВедомыйОбъект.ОбменДанными.Загрузка = Ложь;
					ВедомыйОбъект.Записать(РежимЗаписи);
					
					// пропишем срок оплаты, если это предусмотрено настройками типовой БП
					ИспользоватьПланирование = ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейПоставщикам");
					Если ИспользоватьПланирование Тогда
						ЗаписьРегистра = РегистрыСведений.CW_СрокиОплатыСчетов.СоздатьМенеджерЗаписи();
						ЗаписьРегистра.Счет = Ссылка;
						ЗаписьРегистра.Прочитать();   
						Если ЗаписьРегистра.Выбран() Тогда 
							СрокиОплатыДокументов.ЗаписатьСрокОплатыДокумента(ВедомыйСчет, ЗаписьРегистра.ДатаОплаты);
						КонецЕсли;
					КонецЕсли;
					
					// Если для целей оперативного учета задолженности документ проводится в режиме ввода остатков,
					// то принудительно пропишем статус ведомого счета (при проведении в обычном режиме статус не прописываем,
					// т.к. он будет определен типовой конфигурацией на момент записи документа)  
					
					
					СтруктураНастроек  = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Организация, Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская, Дата); 
					
					Если СтруктураНастроек["ВедетсяОперативныйУчет"] Тогда
						РежимВводНачальныхОстатков = СтруктураНастроек["ВводОстатков"];
						Если РежимВводНачальныхОстатков Тогда
							
							// статус оплаты
							СтатусОплаты = Перечисления.СтатусОплатыСчета.НеОплачен;
							Если СальдоВзаиморасчетовОЗ <= 0 Тогда
								СтатусОплаты = Перечисления.СтатусОплатыСчета.Оплачен;
							Иначе
								Если СальдоВзаиморасчетовОЗ < Услуги.Итог("Всего") Тогда
									СтатусОплаты = Перечисления.СтатусОплатыСчета.ОплаченЧастично;
								КонецЕсли; 
							КонецЕсли; 
							
							// статус отгрузки
							СтатусОтгрузки = ?(ПредъявленАкт,Перечисления.СтатусыОтгрузки.Отгружен,Перечисления.СтатусыОтгрузки.НеОтгружен);
							
							МассивДокументов = Новый Массив;
							МассивДокументов.Добавить(ВедомыйОбъект.Ссылка);
							
							// пишем в регистр
							СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
							СтатусыДокумента.Статус            		= СтатусОплаты;
							СтатусыДокумента.ДополнительныйСтатус	= СтатусОтгрузки;
							РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокументов(МассивДокументов, СтатусыДокумента);
						КонецЕсли; // это режим ввода остатков 
					КонецЕсли; // по организации ведется учет оперативной задолженности
					
				// формировать счет не требуется	
				Иначе
					Если (НЕ ВедомыйСчет.Пустая()) Тогда
						
						ПометитьНаУдаление(ВедомыйСчет);
						
					КонецЕсли; 
				КонецЕсли; // требуется формировать счет 
				
				//ведомые акт и счёт-фактура
				Если (ПредъявленАкт ИЛИ ПредъявленСФ) Тогда
					
					ВедомыйОбъект = ВедомыйДокумент.ПолучитьОбъект();  
					
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ЗависимоеПроведение",Истина);
					
					НоваяДата = ?(ФормироватьВедомыеДатойДокумента,Дата,?(ПредъявленАкт,ДатаАкта,ДатаСФ));
					
					Если Год(ВедомыйОбъект.Дата) <> Год(НоваяДата) Тогда
						ВедомыйОбъект.Номер = "";	
					КонецЕсли;
					
					//ВедомыйОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент(); // тмп
					ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
					ВедомыйОбъект.Организация = Организация;
					ВедомыйОбъект.Дата = НоваяДата;
					
					ВедомыйОбъект.ЭтоУниверсальныйДокумент = ЭтоУниверсальныйДокумент;  
					
					//Для версии КОРП
					Если ВестиУчетПоПодразделениям Тогда
						ВедомыйОбъект.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП
					
					Если (ПредъявленАкт) Тогда
						НомерВходящего = НомерАкта;
						ДатаВходящего = ДатаАкта;
					Иначе
						НомерВходящего = НомерСФ;
						ДатаВходящего = ДатаСФ;
					КонецЕсли;  
					
					НДСВключатьВСтоимость = Ложь;
					Если ДС.УП.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
						СтавкаНалогообложенияПриУСН = ПолучитьСтавкуНалогообложенияПриУСН();	
						ИндексСтавкиНДС = НастройкиСистемыНалогообложенияФормы.ИндексСтавкиНДСПоЗначению(СтавкаНалогообложенияПриУСН);	
						НДСВключатьВСтоимость = (ИндексСтавкиНДС < 2);
					КонецЕсли;
					
					ВедомыйОбъект.НомерВходящегоДокумента = НомерВходящего;
					ВедомыйОбъект.ДатаВходящегоДокумента = ДатаВходящего;
					ВедомыйОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
					ВедомыйОбъект.Контрагент = Контрагент;
					ВедомыйОбъект.ДоговорКонтрагента = ПараметрыБухгалтерскогоУчета.УчетныйДоговор;
					ВедомыйОбъект.СуммаВключаетНДС = Ложь;
					ВедомыйОбъект.СчетНаОплатуПоставщика = Документы.CW_РасходыПоГрузоперевозке.ПолучитьСчетНаОплатуПоставщика(Ссылка);
					ВедомыйОбъект.НДСВключенВСтоимость = НДСВключатьВСтоимость;
					//ВедомыйОбъект.НДСНеВыделять = НДСВключатьВСтоимость;  
					ВедомыйОбъект.ВалютаДокумента = ?(ПоказатьРубли, ДС.КО.ВалютаРегламентированногоУчета, Валюта);
					ВедомыйОбъект.Ответственный = Ответственный;
					ВедомыйОбъект.Комментарий = "Сформировано автоматически (CW) документом ""Расходы по грузоперевозке"" №"+Строка(Номер)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");
					
					Если (Валюта = ДС.КО.ВалютаРегламентированногоУчета) Тогда
						ВедомыйОбъект.КурсВзаиморасчетов = 1;
						ВедомыйОбъект.КратностьВзаиморасчетов = 1;
					Иначе
						
						Если УЕ_ПользовательскийКурс Тогда
							СК = Новый Структура("Курс,Кратность",УЕ_Курс,УЕ_Кратность);
						Иначе
							СК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(НоваяДата, Новый Структура("Валюта", Валюта));
						КонецЕсли; 
						//Если ДополнительныеСвойства.УП.УчитыватьКурсыВалютАвансовДляБазыНДС
						//	И ЗачетАвансов.Количество()>0
						//Тогда 
						//	СК = ПриведённыйКурсСУчётомВалютныхАвансов(СК);
						//КонецЕсли;
						// --- 
						ВедомыйОбъект.КурсВзаиморасчетов = СК.Курс;
						ВедомыйОбъект.КратностьВзаиморасчетов = СК.Кратность;
					КонецЕсли;	
					
					СчетУчетаСПоставщиком = ДС.УП.СчетРасчетов_Поставщики_Рубли;
					СчетУчетСПоставщикомВВалюте = ДС.УП.СчетРасчетов_Поставщики_Валюта;
					СчетУчетСПоставщикомВУЕ = ДС.УП.СчетРасчетов_Поставщики_УЕ;
					
					Если (Валюта = ДС.КО.ВалютаРегламентированногоУчета) Тогда
						Если СчетУчетаСПоставщиком.Родитель = Счета.РасчетыСПоставщикамиИПодрядчиками Тогда			
							ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = СчетУчетаСПоставщиком; // 60.01
							ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = Счета.РасчетыПоАвансамВыданным; // 60.02
						Иначе
							ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = СчетУчетаСПоставщиком; 
							ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = СчетУчетаСПоставщиком;
						КонецЕсли;
					Иначе
						Если Договор.ВзаиморасчетыВУЕ Тогда
							Если СчетУчетаСПоставщиком.Родитель = Счета.РасчетыСПоставщикамиИПодрядчиками Тогда			
								ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = Счета.РасчетыСПоставщикамиУЕ; // 62.31
								ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = Счета.РасчетыПоАвансамВыданнымУЕ; // 62.32
							Иначе
								ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = СчетУчетСПоставщикомВУЕ; 
								ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = СчетУчетСПоставщикомВУЕ;
							КонецЕсли;
						ИначеЕсли СчетУчетСПоставщикомВВалюте.Родитель = Счета.РасчетыСПоставщикамиИПодрядчиками Тогда			
							ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = СчетУчетСПоставщикомВВалюте; // 
							ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = Счета.РасчетыПоАвансамВыданнымВал; // 60.02
						Иначе
							ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = СчетУчетСПоставщикомВВалюте; 
							ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = СчетУчетСПоставщикомВВалюте;
						КонецЕсли;
					КонецЕсли;	
					
					// способ зачета авансов переопределяется в подписке
					ВедомыйОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
					ОсновноеПодразделение = ДС.УП.ОсновноеПодразделение;
					
					// определим, требуется ли заполнение колонки для УСН
					ТребуетсяЗаполнениеОтраженияВУСН = (ДС.УП.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная 
														или ДС.УП.СистемаНалогообложения = Перечисления.СистемыНалогообложения.АУСН)
														И ДС.УП.ОбъектНалогообложенияУСН = Перечисления.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы;
														
					ЕстьЗатраты = Ложь;
					ЕстьПеревыставление = Ложь;
					ГруппировкаЗатратПоПодразделениям = ДС.УП.ГруппировкаЗатратПоПодразделениям;
					
					Если (ПараметрыБухгалтерскогоУчета.УчетныйДоговор.УчетАгентскогоНДС) Тогда
						ВедомыйОбъект.СуммаВключаетНДС = Ложь;
					КонецЕсли; 
					
					ВедомыйОбъект.Услуги.Очистить();
					ВедомыйОбъект.АгентскиеУслуги.Очистить();
					
					Для каждого СтрТЧ Из Услуги Цикл
						
						// получаем вид деятельности статьи затрат:
						ВидДеятельностиНУ = СтрТЧ.СтатьяЗатрат.ВидДеятельностиДляНалоговогоУчетаЗатрат;
						
						// затраты
						Если СтрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда 
							
							ЕстьЗатраты = Истина;
							
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							Нстр.Номенклатура 	= СтрТЧ.Номенклатура;
							Нстр.Содержание 	= СокрЛП(СтрТЧ.Представление);
							Нстр.Количество 	= СтрТЧ.Количество;  
							
							Если ЦенаСНДС Тогда 
								Если ПоказатьРубли Тогда
									Нстр.Цена = СтрТЧ.ЦенаРег - СтрТЧ.НДСРег/?(СтрТЧ.Количество=0,1,СтрТЧ.Количество); 
								Иначе
									Нстр.Цена = СтрТЧ.Цена - СтрТЧ.НДС/?(СтрТЧ.Количество=0,1,СтрТЧ.Количество); 
								Конецесли;
							Иначе
								Нстр.Цена = ?(ПоказатьРубли, СтрТЧ.ЦенаРег, СтрТЧ.Цена);
							КонецЕсли;
							
							Нстр.СуммаНДС = ?(ПоказатьРубли, СтрТЧ.НДСРег, СтрТЧ.НДС);
							
							Если (НЕ ПараметрыБухгалтерскогоУчета.УчетныйДоговор.УчетАгентскогоНДС) Тогда
								Нстр.СтавкаНДС 	= СтрТЧ.СтавкаНДС;
								Нстр.Сумма 		=  ?(ПоказатьРубли, СтрТЧ.СуммаРег, СтрТЧ.Сумма);
							Иначе
								
								// для собственных накручиваем 18% (20%) сверху
								Нстр.Сумма 		= ?(ПоказатьРубли, СтрТЧ.ВсегоРег, СтрТЧ.Всего);
								
								Нстр.СтавкаНДС 	= CW_БухгалтерияЭкспедитораДляРоссииСервер.СтавкаНДСПоВидуСтавки(Перечисления.ВидыСтавокНДС.Общая, ВедомыйОбъект.дата);
								СтавкуНДСЧислом = CW_Финансы.ПолучитьКоэффициентСтавкиНДС(Перечисления.ВидыСтавокНДС.Общая, ВедомыйОбъект.дата);
								Нстр.СуммаНДС 	= Нстр.Сумма * СтавкуНДСЧислом;
								
								Нстр.Цена 		= Нстр.Сумма/Нстр.Количество;
							КонецЕсли;
							
							Нстр.СчетЗатрат 	= Счета.ОсновноеПроизводство; // 20.01
							Нстр.СчетЗатратНУ 	= Счета.ОсновноеПроизводство; // 20.01
							Нстр.Субконто1 		= СтрТЧ.Номенклатура.НоменклатурнаяГруппа;
							Нстр.Субконто2 		= СтрТЧ.СтатьяЗатрат;
							Нстр.СубконтоНУ1 	= СтрТЧ.Номенклатура.НоменклатурнаяГруппа;
							Нстр.СубконтоНУ2 	= СтрТЧ.СтатьяЗатрат;
							Нстр.СчетУчетаНДС 	= Счета.НДСпоПриобретеннымУслугам; // 19.04
							
							
							//AFR-250327 от 25.07.2025 16:37:23
							Если ВариантыПриложений.ЭтоВерсияКОРП() 
								И Не ДС.УП.ГруппировкаЗатратПоПодразделениям Тогда
								Нстр.ПодразделениеЗатрат = ?(ЗначениеЗаполнено(ПодразделениеОрганизации),ПодразделениеОрганизации,ДС.УП.ОсновноеПодразделение);	
							ИначеЕсли ВариантыПриложений.ЭтоВерсияПРОФ()  
								И Не ДС.УП.ГруппировкаЗатратПоПодразделениям Тогда
								Нстр.ПодразделениеЗатрат = ДС.УП.ОсновноеПодразделение;  
							Иначе
								Нстр.ПодразделениеЗатрат = СтрТЧ.Подразделение;	
							КонецЕсли;
							//---AFR-250327 от 25.07.2025 16:37:23
							
							
							Если (ДС.УП.РаздельныйУчетНДСНаСчете19) Тогда
								Если (НЕ СтрТЧ.СпособУчетаНДС.Пустая()) Тогда
									Нстр.СпособУчетаНДС = СтрТЧ.СпособУчетаНДС;
								Иначе
									СтруктураПараметров = Новый Структура;
									СтруктураПараметров.Вставить("Дата"					, Дата);
									СтруктураПараметров.Вставить("Организация"			, Организация);
									СтруктураПараметров.Вставить("Номенклатура"			, Нстр.Номенклатура);
									СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, Нстр.Номенклатура.НоменклатурнаяГруппа);
									
									Нстр.СпособУчетаНДС = CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров, Ложь);
								КонецЕсли;	
							КонецЕсли; 
							
							Если ТребуетсяЗаполнениеОтраженияВУСН Тогда
								Если ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения Тогда
									Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.Принимаются;
								ИначеЕсли ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения Тогда 
									Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.НеПринимаются;
								ИначеЕсли ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты Тогда 
									Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.Распределяются;
								КонецЕсли; 
							КонецЕсли; 
						КонецЕсли;
						
						// Прочие затраты
						Если СтрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы Тогда 
							
							ЕстьЗатраты = Истина;
							
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							Нстр.Номенклатура 	= СтрТЧ.Номенклатура;
							Нстр.Содержание 	= СокрЛП(СтрТЧ.Представление);
							Нстр.Количество 	= СтрТЧ.Количество;  
							
							Если ЦенаСНДС Тогда 
								Если ПоказатьРубли Тогда
									Нстр.Цена = СтрТЧ.ЦенаРег - СтрТЧ.НДСРег/?(СтрТЧ.Количество=0,1,СтрТЧ.Количество); 
								Иначе
									Нстр.Цена = СтрТЧ.Цена - СтрТЧ.НДС/?(СтрТЧ.Количество=0,1,СтрТЧ.Количество); 
								Конецесли;
							Иначе
								Нстр.Цена = ?(ПоказатьРубли, СтрТЧ.ЦенаРег, СтрТЧ.Цена);
							КонецЕсли;
							
							Нстр.СуммаНДС = ?(ПоказатьРубли, СтрТЧ.НДСРег, СтрТЧ.НДС);
							
							Если (НЕ ПараметрыБухгалтерскогоУчета.УчетныйДоговор.УчетАгентскогоНДС) Тогда
								Нстр.СтавкаНДС	= СтрТЧ.СтавкаНДС;
								Нстр.Сумма 		= ?(ПоказатьРубли, СтрТЧ.СуммаРег, СтрТЧ.Сумма);
							Иначе
								
								// для собственных накручиваем 18% (20%) сверху
								Нстр.Сумма 		= СтрТЧ.Всего;
								
								Нстр.СтавкаНДС 	= CW_БухгалтерияЭкспедитораДляРоссииСервер.СтавкаНДСПоВидуСтавки(Перечисления.ВидыСтавокНДС.Общая, ВедомыйОбъект.дата);
								СтавкуНДСЧислом = CW_Финансы.ПолучитьКоэффициентСтавкиНДС(Перечисления.ВидыСтавокНДС.Общая, ВедомыйОбъект.дата);
								Нстр.СуммаНДС 	= Нстр.Сумма * СтавкуНДСЧислом;
								
								Нстр.Цена 		= Нстр.Сумма/Нстр.Количество;
							КонецЕсли;
							
							Нстр.СчетЗатрат 	= Счета.ПрочиеРасходы; // 91.02
							Нстр.СчетЗатратНУ 	= Счета.ПрочиеРасходы; // 91.02
							Нстр.Субконто1 		= СтрТЧ.ПрочиеРасходы;
							Нстр.Субконто2 		= СтрТЧ.Номенклатура;
							Нстр.СубконтоНУ1 	= СтрТЧ.ПрочиеРасходы;
							Нстр.СубконтоНУ2 	= СтрТЧ.Номенклатура;
							Нстр.СчетУчетаНДС 	= Счета.НДСпоПриобретеннымУслугам; // 19.04
							
							
							//AFR-250327 от 25.07.2025 16:37:23
							Если ВариантыПриложений.ЭтоВерсияКОРП() 
								И Не ДС.УП.ГруппировкаЗатратПоПодразделениям Тогда
								Нстр.ПодразделениеЗатрат = ?(ЗначениеЗаполнено(ПодразделениеОрганизации),ПодразделениеОрганизации,ДС.УП.ОсновноеПодразделение);	
							ИначеЕсли ВариантыПриложений.ЭтоВерсияПРОФ()  
								И Не ДС.УП.ГруппировкаЗатратПоПодразделениям Тогда
								Нстр.ПодразделениеЗатрат = ДС.УП.ОсновноеПодразделение;  
							Иначе
								Нстр.ПодразделениеЗатрат = СтрТЧ.Подразделение;	
							КонецЕсли;
							//---AFR-250327 от 25.07.2025 16:37:23

							
							Если (ДС.УП.РаздельныйУчетНДСНаСчете19) Тогда
								Если (НЕ СтрТЧ.СпособУчетаНДС.Пустая()) Тогда
									Нстр.СпособУчетаНДС = СтрТЧ.СпособУчетаНДС;
								Иначе
									СтруктураПараметров = Новый Структура;
									СтруктураПараметров.Вставить("Дата"					, Дата);
									СтруктураПараметров.Вставить("Организация"			, Организация);
									СтруктураПараметров.Вставить("Номенклатура"			, Нстр.Номенклатура);
									СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, Нстр.Номенклатура.НоменклатурнаяГруппа);
									
									Нстр.СпособУчетаНДС = CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров, Ложь);
								КонецЕсли;	
							КонецЕсли; 
							
							Если ТребуетсяЗаполнениеОтраженияВУСН Тогда
								Если ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения Тогда
									Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.Принимаются;
								ИначеЕсли ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения Тогда 
									Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.НеПринимаются;
								ИначеЕсли ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты Тогда 
									Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.Распределяются;
								КонецЕсли; 
							КонецЕсли; 
						КонецЕсли;
						
						// перевыставление 
						Если СтрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление ИЛИ СтрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам Тогда // процент
							
							ЕстьПеревыставление = Истина;
							
							Нстр = ВедомыйОбъект.АгентскиеУслуги.Добавить();
							Нстр.Номенклатура 	= СтрТЧ.Номенклатура;
							Нстр.Содержание 	= СокрЛП(СтрТЧ.Представление);
							Нстр.Количество 	= СтрТЧ.Количество;
							Нстр.Цена 			= ?(ПоказатьРубли, СтрТЧ.ЦенаРег, СтрТЧ.Цена);
							Нстр.СуммаНДС 		= ?(ПоказатьРубли, СтрТЧ.НДСРег,  СтрТЧ.НДС);
							
							Если (НЕ ПараметрыБухгалтерскогоУчета.УчетныйДоговор.УчетАгентскогоНДС) Тогда
								Нстр.СтавкаНДС 	= СтрТЧ.СтавкаНДС;
								Нстр.Сумма 		= ?(ПоказатьРубли, СтрТЧ.СуммаРег, СтрТЧ.Сумма);
							Иначе
								//Нстр.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
								//// --- 
								//Нстр.Сумма = СтрТЧ.Всего;
								//Нстр.СуммаНДС = Нстр.Сумма*0.18;
								//Нстр.Цена = Нстр.Сумма/Нстр.Количество;
								
								Нстр.СтавкаНДС 	= СтрТЧ.СтавкаНДС;
								Нстр.Сумма 		= ?(ПоказатьРубли, СтрТЧ.СуммаРег, СтрТЧ.Сумма);
							КонецЕсли; 
							
							Нстр.Контрагент = СтрТЧ.Покупатель;
							
							АгентскийДоговорКонтрагента = СтрТЧ.ДоговорПокупателя.АгентскийДоговорНаЗакупку;
							Если ВедетсяУчетПриложенийПоДоговорам и ЗначениеЗаполнено(СтрТЧ.ПриложениеКДоговору) Тогда
								АгентскийДоговорКонтрагента = СтрТЧ.ПриложениеКДоговору.АгентскийДоговорНаЗакупку;
							КонецЕсли;
								
							Если (НЕ ЗначениеЗаполнено(АгентскийДоговорКонтрагента)) Тогда
								СтруктураДоговора = Новый Структура;
								СтруктураДоговора.Вставить("Договор", 				СтрТЧ.ДоговорПокупателя); 
								СтруктураДоговора.Вставить("ПриложениеКДоговору", 	СтрТЧ.ПриложениеКДоговору); 
								
								АгентскийДоговорКонтрагента = CW_Финансы.СоздатьАгентскийДоговор(СтруктураДоговора); 
							КонецЕсли; 
							
							Если ЗначениеЗаполнено(АгентскийДоговорКонтрагента) Тогда
								
								Нстр.ДоговорКонтрагента = АгентскийДоговорКонтрагента;
								
								ВалютныйДоговор = АгентскийДоговорКонтрагента.Валютный;
								ОплатаВВалюте = АгентскийДоговорКонтрагента.ОплатаВВалюте;
								
								Нстр.СчетРасчетов = ПолучитьСчетРасчетовДляАгентскогоДоговора(ВалютныйДоговор, стрТЧ.ПорядокОтражения, ОплатаВВалюте, Счета);
							КонецЕсли;
							
							
	
						КонецЕсли; 
					КонецЦикла; 
					
					// устанавливаем свойства для обработки в подписках
					ВедомыйОбъект.ДополнительныеСвойства.Вставить("Постановление735", ДС.УП.ТребованияПостановления735);
					ВедомыйОбъект.ДополнительныеСвойства.Вставить("УчитыватьКурсыВалютАвансовДляБазыНДС", ДополнительныеСвойства.УП.УчитыватьКурсыВалютАвансовДляБазыНДС);
					
					ВедомыйОбъект.ОбменДанными.Загрузка = Ложь;
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъект);
					
					// при записи документа отработают подписки и скорректируются движения 
					// в зависимости от логики дополнительного модуля 
					ВедомыйОбъект.Записать(РежимЗаписи);
				Иначе
					Если (НЕ ВедомыйДокумент.Пустая()) Тогда
						ПометитьНаУдаление(ВедомыйДокумент);
					КонецЕсли;
				КонецЕсли;	
				
			// по договору не ведется бухгалтерский учет или принимать к учету не требуется	
			Иначе
				Если (НЕ ВедомыйСчет.Пустая()) Тогда
					ПометитьНаУдаление(ВедомыйСчет);
				КонецЕсли; 
				Если (НЕ ВедомыйДокумент.Пустая()) Тогда
					ПометитьНаУдаление(ВедомыйДокумент);
				КонецЕсли; 
			КонецЕсли; // по договору не ведется бухгалтерский учет и статус документа предполагает проведение по учету
		КонецЕсли; // это не корректировка 
		
		Если (Корректировка) Тогда
			
			Если ПровестиПоБухгалтерскомуУчету Тогда
				
				// ведомый счёт
				Если (ПредъявленСчет И ДС.УП.ФормироватьСчетаПоставщикаНаОплату) Тогда
					
					ВедомыйОбъект = ВедомыйСчетКорректировочный.ПолучитьОбъект();
					ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления); 
					
					Если Год(ВедомыйОбъект.Дата) <> Год(?(ФормироватьВедомыеДатойДокумента,Дата,ДатаСчета)) Тогда
						ВедомыйОбъект.Номер = "";	
					КонецЕсли;
					// --- 
					ВедомыйОбъект.Организация 		= Организация;
					ВедомыйОбъект.Дата 				= ?(ФормироватьВедомыеДатойДокумента,Дата,ДатаСчета);
					ВедомыйОбъект.Контрагент 		= Контрагент;
					ВедомыйОбъект.ДоговорКонтрагента 	= ПараметрыБухгалтерскогоУчета.УчетныйДоговор;
					ВедомыйОбъект.ВалютаДокумента 		= ПараметрыБухгалтерскогоУчета.УчетныйДоговор.ВалютаВзаиморасчетов;
					ВедомыйОбъект.СуммаВключаетНДС 		= ЦенаСНДС;
					
					//Для версии КОРП
					Если ВестиУчетПоПодразделениям Тогда
						ВедомыйОбъект.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП
					
					// --- 
					РасчетныйСчет = ДС.ПД.РасчетныйСчет;
					Если (НЕ ЗначениеЗаполнено(РасчетныйСчет)) Тогда
						ВедомыйОбъект.БанковскийСчетКонтрагента = Неопределено;
					Иначе
						ВедомыйОбъект.БанковскийСчетКонтрагента = РасчетныйСчет;
					КонецЕсли;
					// --- 
					ВедомыйОбъект.НомерВходящегоДокумента = НомерСчета;
					ВедомыйОбъект.ДатаВходящегоДокумента  = ДатаСчета;
					// --- 
					ВедомыйОбъект.СуммаДокумента = Услуги.Итог("Всего");
					// --- 
					ЕстьТовары = (Документы.СчетНаОплатуПоставщика.ПустаяСсылка().Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено);
					Если (ЕстьТовары) Тогда
						
						ВедомыйОбъект.Товары.Очистить();
						Для каждого СтрокаУслуги Из Услуги Цикл
							
							Если СтрокаУслуги.Количество <> СтрокаУслуги.Количество_ДоКорректировки ИЛИ
								СтрокаУслуги.Цена <> СтрокаУслуги.Цена_ДоКорректировки  ИЛИ
								СтрокаУслуги.Сумма <> СтрокаУслуги.Сумма_ДоКорректировки  ИЛИ
								СтрокаУслуги.НДС <> СтрокаУслуги.НДС_ДоКорректировки  Тогда
								
								Нстр = ВедомыйОбъект.Товары.Добавить();
								Нстр.Номенклатура 	= СтрокаУслуги.Номенклатура;
								Нстр.Содержание 	= СокрЛП(СтрокаУслуги.Представление);
								Нстр.СтавкаНДС	 	= СтрокаУслуги.СтавкаНДС;
								
								Нстр.Количество = СтрокаУслуги.Количество - СтрокаУслуги.Количество_ДоКорректировки;    
								
								Если ПоказатьРубли Тогда
									Нстр.Цена 		= СтрокаУслуги.ЦенаРег  - СтрокаУслуги.Цена_ДоКорректировкиРег;
									Нстр.Сумма 		= СтрокаУслуги.СуммаРег - СтрокаУслуги.Сумма_ДоКорректировкиРег;
									Нстр.СуммаНДС 	= СтрокаУслуги.НДСРег   - СтрокаУслуги.НДС_ДоКорректировкиРег;  
								Иначе
									Нстр.Цена 		= СтрокаУслуги.Цена - СтрокаУслуги.Цена_ДоКорректировки;
									Нстр.Сумма 		= СтрокаУслуги.Сумма - СтрокаУслуги.Сумма_ДоКорректировки;
									Нстр.СуммаНДС 	= СтрокаУслуги.НДС - СтрокаУслуги.НДС_ДоКорректировки;  
								КонецЕсли;
								
								Если ЦенаСНДС Тогда
									Нстр.Сумма 		= Нстр.Сумма + Нстр.СуммаНДС;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла; 
						
					Иначе
						ВедомыйОбъект.Услуги.Очистить();
						Для каждого СтрокаУслуги Из Услуги Цикл
							Если СтрокаУслуги.Количество <> СтрокаУслуги.Количество_ДоКорректировки ИЛИ
								СтрокаУслуги.Цена <> СтрокаУслуги.Цена_ДоКорректировки  ИЛИ
								СтрокаУслуги.Сумма <> СтрокаУслуги.Сумма_ДоКорректировки  ИЛИ
								СтрокаУслуги.НДС <> СтрокаУслуги.НДС_ДоКорректировки  Тогда
								
								Нстр = ВедомыйОбъект.Услуги.Добавить();
								Нстр.Номенклатура 	= СтрокаУслуги.Номенклатура;
								Нстр.Содержание 	= СокрЛП(СтрокаУслуги.Представление);
								Нстр.СтавкаНДС		= СтрокаУслуги.СтавкаНДС;
								
								Нстр.Количество = СтрокаУслуги.Количество - СтрокаУслуги.Количество_ДоКорректировки; 
								
								Если ПоказатьРубли Тогда
									Нстр.Цена 		= СтрокаУслуги.ЦенаРег  - СтрокаУслуги.Цена_ДоКорректировкиРег;
									Нстр.Сумма 		= СтрокаУслуги.СуммаРег - СтрокаУслуги.Сумма_ДоКорректировкиРег;
									Нстр.СуммаНДС 	= СтрокаУслуги.НДСРег   - СтрокаУслуги.НДС_ДоКорректировкиРег;  
								Иначе
									Нстр.Цена 		= СтрокаУслуги.Цена 	- СтрокаУслуги.Цена_ДоКорректировки;
									Нстр.Сумма 		= СтрокаУслуги.Сумма 	- СтрокаУслуги.Сумма_ДоКорректировки;
									Нстр.СуммаНДС 	= СтрокаУслуги.НДС 		- СтрокаУслуги.НДС_ДоКорректировки; 
								КонецЕсли;
								
								Если ЦенаСНДС Тогда
									Нстр.Сумма = Нстр.Сумма + Нстр.СуммаНДС;
								КонецЕсли;
								
							КонецЕсли;
						КонецЦикла; 
					КонецЕсли; 
					
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъект);
					ВедомыйОбъект.ОбменДанными.Загрузка = Ложь;
					ВедомыйОбъект.Записать(РежимЗаписи);      
					
					// пропишем срок оплаты, если это предусмотрено настройками типовой БП
					ИспользоватьПланирование = ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейПоставщикам");
					Если ИспользоватьПланирование Тогда
						ЗаписьРегистра = РегистрыСведений.CW_СрокиОплатыСчетов.СоздатьМенеджерЗаписи();
						ЗаписьРегистра.Счет = Ссылка;
						ЗаписьРегистра.Прочитать();   
						Если ЗаписьРегистра.Выбран() Тогда 
							СрокиОплатыДокументов.ЗаписатьСрокОплатыДокумента(ВедомыйСчетКорректировочный, ЗаписьРегистра.ДатаОплаты);
						КонецЕсли;
					КонецЕсли;
					
					// Если для целей оперативного учета задолженности документ проводится в режиме ввода остатков,
					// то принудительно пропишем статус ведомого счета (при проведении в обычном режиме статус не прописываем,
					// т.к. он будет определен типовой конфигурацией на момент записи документа) 
					
					СтруктураНастроек  = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Организация, Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская, Дата); 

					Если СтруктураНастроек["ВедетсяОперативныйУчет"] Тогда
						РежимВводНачальныхОстатков = СтруктураНастроек["ВводОстатков"];
						Если РежимВводНачальныхОстатков Тогда
							
							// статус оплаты
							СтатусОплаты = Перечисления.СтатусОплатыСчета.НеОплачен;
							Если СальдоВзаиморасчетовОЗ <= 0 Тогда
								СтатусОплаты = Перечисления.СтатусОплатыСчета.Оплачен;
							Иначе
								Если СальдоВзаиморасчетовОЗ < Услуги.Итог("Всего") Тогда
									СтатусОплаты = Перечисления.СтатусОплатыСчета.ОплаченЧастично;
								КонецЕсли; 
							КонецЕсли; 
							
							// статус отгрузки
							СтатусОтгрузки = ?(ПредъявленАкт,Перечисления.СтатусыОтгрузки.Отгружен,Перечисления.СтатусыОтгрузки.НеОтгружен);
							
							МассивДокументов = Новый Массив;
							МассивДокументов.Добавить(ВедомыйОбъект.Ссылка);
							
							// пишем в регистр
							СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
							СтатусыДокумента.Статус            		= СтатусОплаты;
							СтатусыДокумента.ДополнительныйСтатус	= СтатусОтгрузки;
							РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокументов(МассивДокументов, СтатусыДокумента);
						КонецЕсли; // это режим ввода остатков 
					КонецЕсли; // по организации ведется учет оперативной задолженности
					
				// формировать счет не требуется	
				Иначе
					Если (НЕ ВедомыйСчетКорректировочный.Пустая()) Тогда
						
						ПометитьНаУдаление(ВедомыйСчетКорректировочный);
						
					КонецЕсли; 
				КонецЕсли; // требуется формировать счет 
	
				Если (ПредъявленАкт) Тогда
					
					ВедомыйОбъект = ВедомыйДокументКорректировки.ПолучитьОбъект();
					
					Если Год(ВедомыйОбъект.Дата) <> Год(Дата) Тогда
						ВедомыйОбъект.Номер = "";	
					КонецЕсли;
		
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ЗависимоеПроведение",Истина);
					
					ВедомыйОбъект.Организация 	= Организация;
					//Для версии КОРП
					Если ВестиУчетПоПодразделениям Тогда
						ВедомыйОбъект.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП
					
					ВедомыйОбъект.Дата 					= ?(ФормироватьВедомыеДатойДокумента, Дата, ДатаАкта);
					ВедомыйОбъект.ВидОперации 			= ВидОперацииКорректировки;
					ВедомыйОбъект.КорректироватьБУиНУ 	= Истина;
					ВедомыйОбъект.КорректироватьНДС 	= Истина;
					ВедомыйОбъект.ДокументПоступления 	= ?(КорректируемыйДокумент.Корректировка, КорректируемыйДокумент.ВедомыйДокументКорректировки, КорректируемыйДокумент.ВедомыйДокумент); 
					
					ВедомыйОбъект.НомерВходящегоДокумента = НомерАкта;
					ВедомыйОбъект.ДатаВходящегоДокумента  = ДатаАкта;
					
					ВедомыйОбъект.НомерИсходногоДокумента 	= КорректируемыйДокумент.НомерАкта;
					ВедомыйОбъект.ДатаИсходногоДокумента 	= КорректируемыйДокумент.ДатаАкта;
					
					Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
						ВедомыйОбъект.НомерИсправления 	= НомерИсправления; 
						ВедомыйОбъект.ДатаИсправления 	= Дата;
					КонецЕсли;
					
					ВедомыйОбъект.СтатьяПрочихДоходовИРасходов 	= ДС.УП.СтатьяПрочихДоходовИРасходовДляКорректировок;
					ВедомыйОбъект.Контрагент 					= Контрагент;
					ВедомыйОбъект.ДоговорКонтрагента 			= ПараметрыБухгалтерскогоУчета.УчетныйДоговор;
					ВедомыйОбъект.ВалютаДокумента 				= Валюта;
					
					ВедомыйОбъект.Услуги.Очистить();
					ВедомыйОбъект.АгентскиеУслуги.Очистить();
					ИндексСтрокиСобственных = 0;
					ИндексСтрокиАгентских = 0;
					
					Если КорректируемыйДокумент.Корректировка Тогда
						ТаблицаУслугСобственных = КорректируемыйДокумент.ВедомыйДокументКорректировки.Услуги.Выгрузить();
						ТаблицаУслугАгентских 	= КорректируемыйДокумент.ВедомыйДокументКорректировки.АгентскиеУслуги.Выгрузить();
					Иначе
						ТаблицаУслугСобственных = КорректируемыйДокумент.ВедомыйДокумент.Услуги.Выгрузить();
						ТаблицаУслугАгентских 	= КорректируемыйДокумент.ВедомыйДокумент.АгентскиеУслуги.Выгрузить();
					КонецЕсли;
					
					МаксИндексСтрокиСобственных = ТаблицаУслугСобственных.Количество()-1;
					МаксИндексСтрокиАгентских 	= ТаблицаУслугАгентских.Количество()-1;
					
					ОсновнаяСистемаНалогообложения 	= Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат["ОсновнаяСистемаНалогообложения"];
					ОсобыйПорядокНалогообложения	= Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат["ОсобыйПорядокНалогообложения"];
					
					ТребуетсяЗаполнениеОтраженияВУСН = (ДС.УП.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная И 
														ДС.УП.ОбъектНалогообложенияУСН = Перечисления.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы);
					
					ЗаполнитьПередКорректировкой = CW_Документы.НужноПоказатьПередКорректировкой(ЭтотОбъект);
					
					Для каждого Стр Из Услуги Цикл
						
						Если (Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
							
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							// --- 
							Нстр.ЕстьВДокументеПоступления = Не Стр.ЭтоДобавленнаяСтрока;
							Нстр.Номенклатура = Стр.Номенклатура;
							// --- 
							Нстр.СодержаниеДоИзменения = СокрЛП(Стр.Представление_ДоКорректировки);
							Нстр.Содержание = СокрЛП(Стр.Представление);
							// --- 
							Нстр.КоличествоДоИзменения = Стр.Количество_ДоКорректировки;
							Нстр.Количество = Стр.Количество;
							// --- 
							Нстр.ЦенаДоИзменения 	= ?(ПоказатьРубли, Стр.Цена_ДоКорректировкиРег, Стр.Цена_ДоКорректировки);
							Нстр.Цена 				= ?(ПоказатьРубли, Стр.ЦенаРег, Стр.Цена);
							// --- 
							Нстр.СуммаДоИзменения 	= ?(ПоказатьРубли, Стр.Сумма_ДоКорректировкиРег, Стр.Сумма_ДоКорректировки);
							Нстр.Сумма 				= ?(ПоказатьРубли, Стр.СуммаРег, Стр.Сумма);
							// --- 
							Нстр.СтавкаНДСДоИзменения 	= Стр.СтавкаНДС_ДоКорректировки;
							Нстр.СтавкаНДС 				= Стр.СтавкаНДС;
							// --- 
							Нстр.СуммаНДСДоИзменения 	= ?(ПоказатьРубли, Стр.НДС_ДоКорректировкиРег,Стр.НДС_ДоКорректировки);
							Нстр.СуммаНДС 				= ?(ПоказатьРубли, Стр.НДСРег, Стр.НДС);     
							
							Если ЗаполнитьПередКорректировкой Тогда
								Нстр.КоличествоДоКорректировки 	= Стр.Количество_ПередКорректировкой;    
								
								Нстр.ЦенаДоКорректировки 		= ?(ПоказатьРубли, Стр.Цена_ПередКорректировкойРег, 	Стр.Цена_ПередКорректировкой);
								Нстр.СуммаДоКорректировки 		= ?(ПоказатьРубли, Стр.Сумма_ПередКорректировкойРег, 	Стр.Сумма_ПередКорректировкой);
								Нстр.СуммаНДСДоКорректировки 	= ?(ПоказатьРубли, Стр.НДС_ПередКорректировкойРег, 		Стр.НДС_ПередКорректировкой);
							КонецЕсли;
							
							Если ИндексСтрокиСобственных <= МаксИндексСтрокиСобственных Тогда
								
								// остальные реквизиты берём из соответствующей строки ведомого корректируемого документа
								СтрокаДокументаПоступления = ТаблицаУслугСобственных[ИндексСтрокиСобственных];
								_сф.Инкремент(ИндексСтрокиСобственных);
								// --- 
								ЗаполнитьЗначенияСвойств(Нстр,СтрокаДокументаПоступления,"СчетЗатрат,ПодразделениеЗатрат,Субконто1,Субконто2,Субконто3,СчетЗатратНУ,СубконтоНУ1,СубконтоНУ2,СубконтоНУ3,СчетУчетаНДС,ОтражениеВУСН,СпособУчетаНДС");
							Иначе
								
								Нстр.СчетЗатрат 	= Счета.ОсновноеПроизводство; // 20.01
								Нстр.Субконто1 		= Стр.Номенклатура.НоменклатурнаяГруппа;
								Нстр.Субконто2 		= Стр.СтатьяЗатрат;
								
								Нстр.СчетЗатратНУ 	= Счета.ОсновноеПроизводство; // 20.01
								Нстр.СубконтоНУ1 	= Стр.Номенклатура.НоменклатурнаяГруппа;
								Нстр.СубконтоНУ2 	= Стр.СтатьяЗатрат;
								
								Нстр.СчетУчетаНДС 	= Счета.НДСпоПриобретеннымУслугам; // 19.04
								
								
								//AFR-250327 от 25.07.2025 16:37:23
								Если ВариантыПриложений.ЭтоВерсияКОРП() 
									И Не ДС.УП.ГруппировкаЗатратПоПодразделениям Тогда
									Нстр.ПодразделениеЗатрат = ?(ЗначениеЗаполнено(ПодразделениеОрганизации),ПодразделениеОрганизации,ДС.УП.ОсновноеПодразделение);	
								ИначеЕсли ВариантыПриложений.ЭтоВерсияПРОФ()  
									И Не ДС.УП.ГруппировкаЗатратПоПодразделениям Тогда
									Нстр.ПодразделениеЗатрат = ДС.УП.ОсновноеПодразделение;  
								Иначе
									Нстр.ПодразделениеЗатрат = Стр.Подразделение;	
								КонецЕсли;
								//---AFR-250327 от 25.07.2025 16:37:23
								
								Если (ДС.УП.РаздельныйУчетНДСНаСчете19) Тогда
									Если (НЕ Стр.СпособУчетаНДС.Пустая()) Тогда
										Нстр.СпособУчетаНДС = Стр.СпособУчетаНДС;
									Иначе
										СтруктураПараметров = Новый Структура;
										СтруктураПараметров.Вставить("Дата"					, Дата);
										СтруктураПараметров.Вставить("Организация"			, Организация);
										СтруктураПараметров.Вставить("Номенклатура"			, Нстр.Номенклатура);
										СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, Нстр.Номенклатура.НоменклатурнаяГруппа);
										
										Нстр.СпособУчетаНДС = CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров, Ложь);
									КонецЕсли;	
								КонецЕсли; 
								
								Если ТребуетсяЗаполнениеОтраженияВУСН Тогда
									Если ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения Тогда
										Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.Принимаются;
									ИначеЕсли ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения Тогда 
										Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.НеПринимаются;
									ИначеЕсли ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты Тогда 
										Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.Распределяются;
									КонецЕсли; 
								КонецЕсли; 
								
							КонецЕсли;
							
						ИначеЕсли (Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы) Тогда
							
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							// --- 
							Нстр.ЕстьВДокументеПоступления = Не Стр.ЭтоДобавленнаяСтрока;
							Нстр.Номенклатура = Стр.Номенклатура;
							// --- 
							Нстр.СодержаниеДоИзменения = СокрЛП(Стр.Представление_ДоКорректировки);
							Нстр.Содержание = СокрЛП(Стр.Представление);
							// --- 
							Нстр.КоличествоДоИзменения = Стр.Количество_ДоКорректировки;
							Нстр.Количество = Стр.Количество;
							// --- 
							Нстр.ЦенаДоИзменения 	= ?(ПоказатьРубли, Стр.Цена_ДоКорректировкиРег, Стр.Цена_ДоКорректировки);
							Нстр.Цена 				= ?(ПоказатьРубли, Стр.ЦенаРег, Стр.Цена);
							// --- 
							Нстр.СуммаДоИзменения 	= ?(ПоказатьРубли, Стр.Сумма_ДоКорректировкиРег, Стр.Сумма_ДоКорректировки);
							Нстр.Сумма 				= ?(ПоказатьРубли, Стр.СуммаРег, Стр.Сумма);
							// --- 
							Нстр.СтавкаНДСДоИзменения 	= Стр.СтавкаНДС_ДоКорректировки;
							Нстр.СтавкаНДС 				= Стр.СтавкаНДС;
							// --- 
							Нстр.СуммаНДСДоИзменения 	= ?(ПоказатьРубли, Стр.НДС_ДоКорректировкиРег, Стр.НДС_ДоКорректировки);
							Нстр.СуммаНДС 				= ?(ПоказатьРубли, Стр.НДСРег, Стр.НДС);
							
							Если ЗаполнитьПередКорректировкой Тогда
								Нстр.КоличествоДоКорректировки 	= Стр.Количество_ПередКорректировкой;
								Нстр.ЦенаДоКорректировки 		= ?(ПоказатьРубли, Стр.Цена_ПередКорректировкойРег,  Стр.Цена_ПередКорректировкой);
								Нстр.СуммаДоКорректировки 		= ?(ПоказатьРубли, Стр.Сумма_ПередКорректировкойРег, Стр.Сумма_ПередКорректировкой);
								Нстр.СуммаНДСДоКорректировки 	= ?(ПоказатьРубли, Стр.НДС_ПередКорректировкойРег,   Стр.НДС_ПередКорректировкой);
							КонецЕсли;
	
							Если ИндексСтрокиСобственных <= МаксИндексСтрокиСобственных Тогда
								
								// остальные реквизиты берём из соответствующей строки ведомого корректируемого документа
								СтрокаДокументаПоступления = ТаблицаУслугСобственных[ИндексСтрокиСобственных];
								_сф.Инкремент(ИндексСтрокиСобственных);
								// --- 
								ЗаполнитьЗначенияСвойств(Нстр,СтрокаДокументаПоступления,"СчетЗатрат,ПодразделениеЗатрат,Субконто1,Субконто2,Субконто3,СчетЗатратНУ,СубконтоНУ1,СубконтоНУ2,СубконтоНУ3,СчетУчетаНДС,ОтражениеВУСН,СпособУчетаНДС");
							Иначе
								
								Нстр.СчетЗатрат 	= Счета.ПрочиеРасходы; // 91.02
								Нстр.Субконто1 		= Стр.ПрочиеРасходы;
								Нстр.Субконто2 		= Стр.Номенклатура;
								
								Нстр.СчетЗатратНУ 	= Счета.ПрочиеРасходы; // 91.02
								Нстр.СубконтоНУ1 	= Стр.ПрочиеРасходы;
								Нстр.СубконтоНУ2 	= Стр.Номенклатура;
								
								Нстр.СчетУчетаНДС 	= Счета.НДСпоПриобретеннымУслугам; // 19.04
								
								//AFR-250327 от 25.07.2025 16:37:23
								Если ВариантыПриложений.ЭтоВерсияКОРП() 
									И Не ДС.УП.ГруппировкаЗатратПоПодразделениям Тогда
									Нстр.ПодразделениеЗатрат = ?(ЗначениеЗаполнено(ПодразделениеОрганизации),ПодразделениеОрганизации,ДС.УП.ОсновноеПодразделение);	
								ИначеЕсли ВариантыПриложений.ЭтоВерсияПРОФ()  
									И Не ДС.УП.ГруппировкаЗатратПоПодразделениям Тогда
									Нстр.ПодразделениеЗатрат = ДС.УП.ОсновноеПодразделение;  
								Иначе
									Нстр.ПодразделениеЗатрат = СтрТЧ.Подразделение;	
								КонецЕсли;
								//---AFR-250327 от 25.07.2025 16:37:23
								
								Если (ДС.УП.РаздельныйУчетНДСНаСчете19) Тогда
									Если (НЕ Стр.СпособУчетаНДС.Пустая()) Тогда
										Нстр.СпособУчетаНДС = Стр.СпособУчетаНДС;
									Иначе
										СтруктураПараметров = Новый Структура;
										СтруктураПараметров.Вставить("Дата"					, Дата);
										СтруктураПараметров.Вставить("Организация"			, Организация);
										СтруктураПараметров.Вставить("Номенклатура"			, Нстр.Номенклатура);
										СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, Нстр.Номенклатура.НоменклатурнаяГруппа);
										
										Нстр.СпособУчетаНДС = CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров, Ложь);
									КонецЕсли;	
								КонецЕсли; 
								
								Если ТребуетсяЗаполнениеОтраженияВУСН Тогда
									Если ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения Тогда
										Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.Принимаются;
									ИначеЕсли ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения Тогда 
										Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.НеПринимаются;
									ИначеЕсли ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты Тогда 
										Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.Распределяются;
									КонецЕсли; 
								КонецЕсли; 
								
							КонецЕсли;
							
						Иначе
							
							Нстр = ВедомыйОбъект.АгентскиеУслуги.Добавить();
							// --- 
							Нстр.ЕстьВДокументеПоступления = Не Стр.ЭтоДобавленнаяСтрока;
							Нстр.Номенклатура = Стр.Номенклатура;
							// --- 
							Нстр.СодержаниеДоИзменения = СокрЛП(Стр.Представление_ДоКорректировки);
							Нстр.Содержание = СокрЛП(Стр.Представление);
							// --- 
							Нстр.КоличествоДоИзменения = Стр.Количество_ДоКорректировки;
							Нстр.Количество = Стр.Количество;
							// --- 
							Нстр.ЦенаДоИзменения 	= ?(ПоказатьРубли, Стр.Цена_ДоКорректировкиРег, Стр.Цена_ДоКорректировки);
							Нстр.Цена 				= ?(ПоказатьРубли, Стр.ЦенаРег, Стр.Цена);
							// --- 
							Нстр.СуммаДоИзменения 	= ?(ПоказатьРубли, Стр.Сумма_ДоКорректировкиРег, Стр.Сумма_ДоКорректировки);
							Нстр.Сумма 				= ?(ПоказатьРубли, Стр.СуммаРег, Стр.Сумма);
							// --- 
							Нстр.СтавкаНДСДоИзменения = Стр.СтавкаНДС_ДоКорректировки;
							Нстр.СтавкаНДС = Стр.СтавкаНДС;
							// --- 
							Нстр.СуммаНДСДоИзменения 	= ?(ПоказатьРубли, Стр.НДС_ДоКорректировкиРег, Стр.НДС_ДоКорректировки);
							Нстр.СуммаНДС 				= ?(ПоказатьРубли, Стр.НДСРег, Стр.НДС);
							
							Если ЗаполнитьПередКорректировкой Тогда
								Нстр.КоличествоДоКорректировки 	= Стр.Количество_ПередКорректировкой;
								Нстр.ЦенаДоКорректировки 		= ?(ПоказатьРубли, Стр.Цена_ПередКорректировкойРег, Стр.Цена_ПередКорректировкой);
								Нстр.СуммаДоКорректировки 		= ?(ПоказатьРубли, Стр.Сумма_ПередКорректировкойРег, Стр.Сумма_ПередКорректировкой);
								Нстр.СуммаНДСДоКорректировки 	= ?(ПоказатьРубли, Стр.НДС_ПередКорректировкойРег, Стр.НДС_ПередКорректировкой);
							КонецЕсли;
	
							Если ИндексСтрокиАгентских <= МаксИндексСтрокиАгентских Тогда
								
								СтрокаДокументаПоступления = ТаблицаУслугАгентских[ИндексСтрокиАгентских];
								_сф.Инкремент(ИндексСтрокиАгентских);
								// --- 
								ЗаполнитьЗначенияСвойств(Нстр,СтрокаДокументаПоступления,"СчетРасчетов,Контрагент,ДоговорКонтрагента");
								
							Иначе
								// это перевыставление по ставкам
								Нстр.Контрагент 			= Стр.Покупатель;
								Нстр.СтавкаНДСДоИзменения 	= Стр.СтавкаНДС_ДоКорректировки;
								Нстр.СодержаниеДоИзменения  = СокрЛП(Стр.Представление);
								
								АгентскийДоговорКонтрагента = Стр.ДоговорПокупателя.АгентскийДоговорНаПродажу;
								Если ВедетсяУчетПриложенийПоДоговорам и ЗначениеЗаполнено(Стр.ПриложениеКДоговору) Тогда
									АгентскийДоговорКонтрагента = Стр.ПриложениеКДоговору.АгентскийДоговорНаПродажу;
								КонецЕсли;
								
								Если НЕ ЗначениеЗаполнено(АгентскийДоговорКонтрагента) Тогда
									
									СтруктураДоговора = Новый Структура;
									СтруктураДоговора.Вставить("Договор", 				Стр.ДоговорПокупателя); 
									СтруктураДоговора.Вставить("ПриложениеКДоговору", 	Стр.ПриложениеКДоговору); 
									
									АгентскийДоговорКонтрагента = CW_Финансы.СоздатьАгентскийДоговор(СтруктураДоговора,Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком); 
								КонецЕсли;
								Нстр.ДоговорКонтрагента = АгентскийДоговорКонтрагента;
								
								Если (АгентскийДоговорКонтрагента <> Неопределено) Тогда
									
									// определяем счёт расчётов
									ВалютныйДоговор = АгентскийДоговорКонтрагента.Валютный;
									ОплатаВВалюте = АгентскийДоговорКонтрагента.ОплатаВВалюте;
									// --- 
									Нстр.СчетРасчетов = ПолучитьСчетРасчетовДляАгентскогоДоговора(ВалютныйДоговор, Стр.ПорядокОтражения, ОплатаВВалюте, Счета);
									
								КонецЕсли; 
								
								
							КонецЕсли;
							
							
						КонецЕсли; 
						
					КонецЦикла; 
					
					// --- 
					ВедомыйОбъект.ОбменДанными.Загрузка = Ложь;
					// --- 
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъект);
					// --- 
					ВедомыйОбъект.Записать(РежимЗаписи);
					
					
				КонецЕсли; 
								
			Иначе
				
				Если (НЕ ВедомыйДокументКорректировки.Пустая()) Тогда
					
					ПометитьНаУдаление(ВедомыйДокументКорректировки);
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

Функция ПолучитьСчетРасчетовДляАгентскогоДоговора(ВалютныйДоговор, ПорядокОтражения, ОплатаВВалюте, Счета)
	
	Если (ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление) Тогда
		
		Если НЕ ВалютныйДоговор Тогда
			СчетРасчетов = Счета.РасчетыСПрочимиПоставщикамиИПодрядчиками; // 76.05
		Иначе
			Если (ОплатаВВалюте) Тогда
				СчетРасчетов = Счета.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал; // 76.25
			Иначе
				СчетРасчетов = Счета.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ; // 76.35
			КонецЕсли; 
		КонецЕсли; 
		
	Иначе 
		
		Если НЕ ВалютныйДоговор Тогда
			СчетРасчетов = Счета.РасчетыСПрочимиПокупателямиИЗаказчиками; // 76.06
		Иначе
			Если (ОплатаВВалюте) Тогда
				СчетРасчетов = Счета.РасчетыСПрочимиПокупателямиИЗаказчикамиВал; // 76.26
			Иначе
				СчетРасчетов = Счета.РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ; // 76.36
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СчетРасчетов;
	
КонецФункции

Функция ПроверитьСоответствиеБухгалтескогоУчетаДогововров(Отказ)
	
		СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор",					Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчетаПоставщика = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УслугиОбъекта.НомерСтроки КАК НомерСтроки,
	               |	УслугиОбъекта.ПорядокОтражения КАК ПорядокОтражения,
	               |	УслугиОбъекта.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	УслугиОбъекта.ПриложениеКДоговору КАК ПриложениеКДоговору
	               |ПОМЕСТИТЬ ВТ_ТаблицаОбъекта
	               |ИЗ
	               |	&УслугиОбъекта КАК УслугиОбъекта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаОбъекта.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ТаблицаОбъекта.ПорядокОтражения КАК ПорядокОтражения,
	               |	ВТ_ТаблицаОбъекта.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	ВТ_ТаблицаОбъекта.ПриложениеКДоговору КАК ПриложениеКДоговору
	               |ИЗ
	               |	ВТ_ТаблицаОбъекта КАК ВТ_ТаблицаОбъекта
	               |ГДЕ
	               |	ВТ_ТаблицаОбъекта.ПорядокОтражения В(&мПорядокОтражения)";
	
	мПорядокОтражения = Новый Массив;
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление"));
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам"));
	
	Запрос.УстановитьПараметр("УслугиОбъекта", 		ЭтотОбъект.Услуги.Выгрузить());	
	Запрос.УстановитьПараметр("мПорядокОтражения", 	мПорядокОтражения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезкльтатыПроверки = Новый Соответствие;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураПараметровБухУчета = Новый Структура;
			СтруктураПараметровБухУчета.Вставить("Договор",					Выборка.ДоговорПокупателя);
			СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Выборка.ПриложениеКДоговору);
			
			РезультатПроверки = РезкльтатыПроверки.Получить(Выборка.ДоговорПокупателя); 
			Если РезультатПроверки = Неопределено Тогда
				ПараметрыБухгалтерскогоУчетаПокупателя = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
				
				РезультатПроверки = ПараметрыБухгалтерскогоУчетаПоставщика.БухгалтерскийУчет = ПараметрыБухгалтерскогоУчетаПокупателя.БухгалтерскийУчет;
				РезкльтатыПроверки.Вставить(Выборка.ДоговорПокупателя, РезультатПроверки);
			КонецЕсли;
			
			Если НЕ РезультатПроверки Тогда
				
				ИмяПоляТаблицы = "ДоговорПокупателя";
				Если ЗначениеЗаполнено(Выборка.ПриложениеКДоговору) Тогда
					ИмяПоляТаблицы = "ПриложениеКДоговору";
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Признак ведения БУ не соответствует договору поставщика!",,"Услуги["+(Выборка.НомерСтроки-1)+"]."+ИмяПоляТаблицы, "Объект", Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// контроль загрузки
	Если (ОбменДанными.Загрузка) Тогда 
		Возврат; 
	КонецЕсли;
	Если (РучнаяКорректировка) Тогда 
		Возврат; 
	КонецЕсли; 
	
	// не перепроводим при восстановлении последовательности
	ВосстановлениеПоследовательности = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ПроведенВХронологическойПоследовательности");
	Если (ВосстановлениеПоследовательности <> Неопределено) Тогда
		Если (ВосстановлениеПоследовательности) Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	// контроль наличия общих параметров   
	CW_БухгалтерияЭкспедитораСервер.УстановитьОбщиеПараметрыПроведенияДокументов();
	
	Если НЕ ЗаполненыОбщиеПараметры() Тогда 
		СформироватьОбщиеПараметры(,Ложь); 
	КонецЕсли; 
	
	//Подситема.СтатусыДокументов
	ИспользуютсяСтатусыДокументов = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов");
	Если ИспользуютсяСтатусыДокументов И
		Не ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
		//В случае если используются статусы документа и проведение не из формы, тов ДС статуса нет
		ДанныеСтатуса = РегистрыСведений.CW_СтатусыДокументов.ПолучитьДанныеСтатусаДокумента(Ссылка);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СтатусДокумента", ДанныеСтатуса.СтатусДокумента);
	КонецЕсли;
	
	СтатусДокумента = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента", СтатусДокумента);
	
	СтатусДокументаПроводитьПоБухгалтерскомуУчету = CW_СтатусыДокументовСервер.ПолучитьПризнакПроведенияПоБухгалтерскомуУчету(Ссылка, СтатусДокумента);
	//Подситема.СтатусыДокументов
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор",					Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	
	ПровестиПоБухгалтерскомуУчету = ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет и СтатусДокументаПроводитьПоБухгалтерскомуУчету;

	// для счетов и ОУ
	Если (НЕ (ПредъявленАкт ИЛИ ПредъявленСФ) ИЛИ НЕ ПровестиПоБухгалтерскомуУчету) Тогда
		Если (НЕ Корректировка) Тогда
			CW_Подписки.СформироватьДвиженияДляРасходов(Ссылка,Отказ,ДополнительныеСвойства);
		Иначе
			CW_Подписки.СформироватьДвиженияДляКорректировкиРасходов(Ссылка,Отказ,ДополнительныеСвойства);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроверитьСтатусВедомых(РежимЗаписи)
	
	Если (НЕ Корректировка) Тогда
		Если (НЕ ВедомыйДокумент.Пустая()) Тогда
			Если (ПредъявленАкт) Тогда
				СинхронизироватьПометкуУдаления(ВедомыйДокумент, РежимЗаписи);
			Иначе
				ПометитьНаУдаление(ВедомыйДокумент);
			КонецЕсли; 
		КонецЕсли; 
		
		Если (НЕ ВедомыйСчет.Пустая()) Тогда
			Если (ПредъявленСчет) Тогда
				СинхронизироватьПометкуУдаления(ВедомыйСчет, РежимЗаписи);
			Иначе
				ПометитьНаУдаление(ВедомыйСчет);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Если (Корректировка) Тогда
		Если (НЕ ВедомыйДокументКорректировки.Пустая()) Тогда
			Если (ПредъявленАкт) Тогда
				СинхронизироватьПометкуУдаления(ВедомыйДокументКорректировки, РежимЗаписи);
			Иначе
				ПометитьНаУдаление(ВедомыйДокументКорректировки);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура СинхронизироватьПометкуУдаления(Документ, РежимЗаписи)
	
	Если Документ.ПометкаУдаления <> ПометкаУдаления Тогда
		ВедомыйОбъект = Документ.ПолучитьОбъект();
		_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
		ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	Иначе
		ВедомыйОбъект = Документ.ПолучитьОбъект();
		_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
		ВедомыйОбъект.Записать(РежимЗаписи); 
	КонецЕсли;   
	
	
КонецПроцедуры

Процедура ПометитьНаУдаление(Документ)
	
	Если Документ.ПометкаУдаления <> Истина Тогда
		
		ВедомыйОбъект = Документ.ПолучитьОбъект();
		_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
		ВедомыйОбъект.УстановитьПометкуУдаления(Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура СформироватьОбщиеПараметры(Знач СписокПараметров = Неопределено,ИнтерактивныйРежим = Истина) Экспорт 
	// получаем параметры договора и константы, помещаем в доп. свойства
	
	CW_ОбщиеПараметры.СформироватьОбщиеПараметры(ЭтотОбъект,СписокПараметров,ИнтерактивныйРежим);
	ДС = ДополнительныеСвойства;
	
КонецПроцедуры

// проверка общих параметров
Функция ЗаполненыОбщиеПараметры() Экспорт 
	// --- 
	
	Возврат(CW_ОбщиеПараметры.ОбщиеПараметрыЗаполнены(ЭтотОбъект));
	
	// --- 
КонецФункции

Процедура ЗаполнитьТаблицуАвансов(ДатаПодбораАвансов) Экспорт 
	// --- 
	
	ЗаполнитьАвансы(ДатаПодбораАвансов,Истина, Ложь);

	// --- 
КонецПроцедуры

Процедура ЗаполнитьТаблицуАвансовОЗ(ДатаПодбораАвансов) Экспорт 
	// --- 
	
	ЗаполнитьАвансы(ДатаПодбораАвансов,Ложь,Истина);
	
	// --- 
КонецПроцедуры

Процедура ЗаполнитьАвансы(ДатаПодбораАвансов,БУ,ОЗ)
	// --- 
	
	Если (БУ) Тогда
		
		ТЧ = ЗачетАвансов;
		
	Иначе
		
		ТЧ = ЗачетАвансовОЗ;
		
	КонецЕсли; 
	
	ДС = ДополнительныеСвойства;
	Счета = CW_Конфигурация.ПланСчетов();
	// --- 
	ТЧ.Очистить();
	// --- 	
	УслугиПоПорядкуОтражения = Услуги.Выгрузить();
	УслугиПоПорядкуОтражения.Свернуть("ПорядокОтражения", "Всего");
	// --- 
	// определяем счета авансов
	Если (Валюта = ДС.КО.ВалютаРегламентированногоУчета) Тогда
		
		СчетРасчетов = ДС.УП.СчетРасчетов_Поставщики_Рубли;
		Если СчетРасчетов = Счета.РасчетыСПоставщиками Тогда
			
			СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданным;						
			СчетАвансовПоВозмещаемым = Счета.РасчетыПоАвансамВыданным;
			
		КонецЕсли; 
		
	Иначе
		
		// Валюта
		Если (НЕ Договор.ВзаиморасчетыВУЕ) Тогда
			СчетРасчетов = ДС.УП.СчетРасчетов_Поставщики_Валюта;
			Если СчетРасчетов = Счета.РасчетыСПоставщикамиВал Тогда
				СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданнымВал;						
				СчетАвансовПоВозмещаемым = Счета.РасчетыПоАвансамВыданнымВал;
			КонецЕсли;
		КонецЕсли;
		
		// УЕ
		Если (Договор.ВзаиморасчетыВУЕ) Тогда
			СчетРасчетов = ДС.УП.СчетРасчетов_Поставщики_УЕ;
			Если СчетРасчетов = Счета.РасчетыСПоставщикамиУЕ Тогда
				СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданнымУЕ;						
				СчетАвансовПоВозмещаемым = Счета.РасчетыПоАвансамВыданнымУЕ;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если (Истина) Тогда
		
		ПараметрыТА = Новый Структура("Дата,Договор,ПриложениеКДоговору,ОЗ,РаздельныйУчетЗаполженности,Акт,ПереплатаКакАванс");
		// --- 
		ПараметрыТА.Дата = ДатаПодбораАвансов;
		ПараметрыТА.Договор = Договор;
		ПараметрыТА.ОЗ = ДС.УП.ОЗ;
		ПараметрыТА.Акт = Ссылка;
		
		ПараметрыТА.РаздельныйУчетЗаполженности = ДС.УП.РаздельныйУчетОперативнойИБухгалтерскойЗадолженности;
		ПараметрыТА.ПереплатаКакАванс 			= ДС.УП.УчитыватьПереплатыПоДокументамКакАванс;
		
		//Подсистема  УчетПриложенийДоговоров
		ПараметрыТА.ПриложениеКДоговору = ПриложениеКДоговору;
		//Подсистема  УчетПриложенийДоговоров
		
		// --- 
		ТЗ_Услуги = Услуги.Выгрузить();
		Если (ПараметрыТА.ОЗ) Тогда
			Если (НЕ СписокСчетов) Тогда
				Если (ЗначениеЗаполнено(Счет)) Тогда
					ТЗ_Услуги.ЗаполнитьЗначения(Счет,"Счет");
				Иначе
					ТЗ_Услуги.ЗаполнитьЗначения(Ссылка,"Счет");
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		Если (БУ) Тогда
			ТаблицаАвансов = CW_Финансы.ТаблицаАвансов(ПараметрыТА,ТЗ_Услуги,ТЧ.Выгрузить(),ЗачетАвансовОЗ.Выгрузить());	
		ИначеЕсли (ОЗ) Тогда 
			ТаблицаАвансов = CW_Финансы.ТаблицаАвансовДляОЗ(ПараметрыТА,ТЗ_Услуги,ТЧ.Выгрузить());	
		КонецЕсли; 
		
		ТолькоПоПлатежкамСчетов = ПараметрыТА.ОЗ и НЕ ПараметрыТА.РаздельныйУчетЗаполженности;
		//ДС.ПД.АвтоматическиЗачитыватьТолькоПлатежкиПоСчету;
		
		// --- 
		СуммаАванса = _сф.Итог(ТаблицаАвансов,"Аванс");
		СуммаРаспределения = _сф.Итог(УслугиПоПорядкуОтражения,"Всего");
		ОстатокРаспределения = Мин(СуммаРаспределения,СуммаАванса);
		ОстаткиЗачетаПоАктированию = Новый СписокЗначений;
		Для каждого Стр Из ТаблицаАвансов Цикл
			
			Если ОстатокРаспределения <= 0 Тогда
				Прервать; 
			КонецЕсли;
			
			Если (БУ И ТолькоПоПлатежкамСчетов И Стр.ПризнакОплатыСчетовДокумента <> Истина) Тогда
				Продолжить;
			КонецЕсли; 
			
			Нстр = ТЧ.Добавить();
			// --- 
			Нстр.ДокументАванса = Стр.ДокументАванса;
			Нстр.ДокументОплаты = Стр.ДокументОплаты;
			Нстр.СчетАванса = Стр.СчетАванса;
			Нстр.СчетЗадолженности = Стр.СчетЗадолженности;
			// --- 
			Если (БУ) Тогда
				Нстр.Счет = Стр.Счет;
				Если (ТолькоПоПлатежкамСчетов) Тогда
					ОстатокЗадолженности = ОстаткиЗачетаПоАктированию.НайтиПоЗначению(Стр.Счет);
					Если (ОстатокЗадолженности = Неопределено) Тогда
						ОстатокЗадолженности = ОстаткиЗачетаПоАктированию.Добавить(Стр.Счет, Формат(Стр.Задолженность,"ЧН=; ЧГ="));
					КонецЕсли;
					НезачтенноеАктированноеСальдо = Число(ОстатокЗадолженности.Представление);
					Нстр.СуммаЗачета = Мин(ОстатокРаспределения,Стр.Аванс,НезачтенноеАктированноеСальдо);
					ОстатокЗадолженности.Представление = Формат(НезачтенноеАктированноеСальдо-Нстр.СуммаЗачета,"ЧН=; ЧГ=");
				Иначе
					Нстр.СуммаЗачета = Мин(ОстатокРаспределения,Стр.Аванс);
				КонецЕсли; 
			Иначе
				Нстр.СуммаЗачета = Мин(ОстатокРаспределения,Стр.Аванс);
			КонецЕсли; 
			// --- 
			_сф.Декремент(ОстатокРаспределения,Нстр.СуммаЗачета);
			Если (Нстр.СуммаЗачета = 0) Тогда
				ТЧ.Удалить(Нстр);
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
	
	// сформируем текстовое представление платежки в ТЧ зачета авансов
	// ---------------------------------------------------------------------------- 
	Для Каждого Стр Из ТЧ Цикл
		
		Попытка
			
			Если (БУ) Тогда
				
				Если НЕ Стр.ДокументАванса.НомерВходящегоДокумента = "" Тогда
					ВхНомер = Строка(Стр.ДокументАванса.НомерВходящегоДокумента);
				Иначе
					ВхНомер = "";
				КонецЕсли;	
				
				Если НЕ Стр.ДокументАванса.ДатаВходящегоДокумента = Дата("00010101") Тогда
					ВхДата = Строка(Формат(Стр.ДокументАванса.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy"));
				Иначе
					ВхДата = "";
				КонецЕсли;
				
				Если ВхНомер = "" ИЛИ ВхДата = "" Тогда
					Стр.ПредставлениеДокументаАванса = "Не задан!" ;
				Иначе
					Стр.ПредставлениеДокументаАванса = "№" + ВхНомер + " от " + ВхДата;
				КонецЕсли;	 
				
			ИначеЕсли (ОЗ) Тогда 
				
				Стр.ПредставлениеДокументаАванса = Стр.ДокументОплаты.ПредставлениеДокумента;
				
			КонецЕсли; 
			
		Исключение
			
			Стр.ПредставлениеДокументаАванса = "№" + Строка(Стр.ДокументАванса.Номер) + " от " + Строка(Стр.ДокументАванса.Дата);
			
		КонецПопытки	
		
	КонецЦикла;	
	
	
	// --- 
КонецПроцедуры

Процедура СформироватьПредставлениеДокумента()
	
	мПредставления = Новый Массив;
	Если ПредъявленСчет Тогда 
		ПредставлениеСчета 	= "Счет №";
		Если Корректировка Тогда
			ПредставлениеСчета 	= "Кор.счет №";
		КонецЕсли;
		
		ПредставлениеНомераСчета = НомерСчета;	   
		ПредставлениеДатыСчета 	 = Формат(ДатаСчета, "ДФ=dd.MM.yyyy");
		
		мПредставления.Добавить(ПредставлениеСчета + ПредставлениеНомераСчета+" от "+ПредставлениеДатыСчета);
	КонецЕсли;    
	
	ЭтоУПД = ПредъявленАкт и ЭтоУниверсальныйДокумент;
	
	Если НЕ ЭтоУПД Тогда
		Если ПредъявленАкт Тогда 
			ПредставлениеАкта 	= "Акт №";
			Если Корректировка Тогда
				ПредставлениеАкта 	= "Кор.акт №";
			КонецЕсли; 
			
			ПредставлениеНомераАкта = НомерАкта;	   
			ПредставлениеДатыАкта 	= Формат(ДатаАкта, "ДФ=dd.MM.yyyy");			
			
			мПредставления.Добавить(ПредставлениеАкта + ПредставлениеНомераАкта+" от "+ПредставлениеДатыАкта); 
		КонецЕсли;    
		
		Если ПредъявленСФ Тогда 
			
			ПредставлениеСчетаФактуры 	= "С/ф №";
			Если Корректировка Тогда
				ПредставлениеСчетаФактуры 	= "Кор.с/ф №";
			КонецЕсли; 
			
			ПредставлениеНомераСчетаФактуры 		= НомерСФ;	   
			ПредставлениеДатыСчетаФактуры 			= Формат(ДатаСФ, "ДФ=dd.MM.yyyy");			
			
			ПредставлениеИсправленияСчетаФактуры 	= "";
			Если ЗначениеЗаполнено(НомерИсправления) 
				И ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
				ПредставлениеИсправленияСчетаФактуры  =  " (испр. "+Формат(НомерИсправления, "ЧГ=0")+")";
			КонецЕсли;    
	
			мПредставления.Добавить(ПредставлениеСчетаФактуры + ПредставлениеНомераСчетаФактуры + ПредставлениеИсправленияСчетаФактуры + " от "+ПредставлениеДатыСчетаФактуры); 

		КонецЕсли;          
	КонецЕсли;   
	
	Если ЭтоУПД Тогда 
		
		ВидУПД = "УПД";
		Если Корректировка и ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") Тогда
			ВидУПД = "УКД";	
		КонецЕсли;
		
		ПредставлениеИсправленияУПД = "";
		Если ПредъявленСФ Тогда  
			СтатусУПД 				= "(1)";
			ПредставлениеНомераУПД	= " №"+ НомерСФ;
			ПредставлениеДатыУПД 	= ?(ДатаСФ = Дата(1,1,1), "<...>",	Формат(ДатаСФ,"ДФ=dd.MM.yyyy"));
			
			Если ЗначениеЗаполнено(НомерИсправления) 
				И ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
				ПредставлениеИсправленияУПД  =  " (испр. "+Формат(НомерИсправления, "ЧГ=0")+")";
			КонецЕсли;  
			
		Иначе
			СтатусУПД 				= "(2)";
			ПредставлениеНомераУПД	= " №"+ НомерАкта;
			ПредставлениеДатыУПД 	= ?(ДатаАкта = Дата(1,1,1), "<...>", Формат(ДатаАкта,"ДФ=dd.MM.yyyy"));
		КонецЕсли;  
		
		ПредставлениеУПД = ВидУПД + СтатусУПД + ПредставлениеНомераУПД + ПредставлениеИсправленияУПД + " от "+ ПредставлениеДатыУПД;
		
		мПредставления.Добавить(ПредставлениеУПД);
		
	КонецЕсли;
	
	Если мПредставления.Количество() = 0 Тогда 
		мПредставления.Добавить("<"+ЭтотОбъект+">");
	КонецЕсли; 
	
	ПредставлениеДокумента = СтрСоединить(мПредставления,"; ");
	
КонецПроцедуры

Функция ПроверитьЗакрытиеГрузоперевозок() Экспорт 
	// --- 
	
	Возврат(CW_Мониторинг.ПроверитьЗакрытиеГрузоперевозок(ЭтотОбъект));
	
	// --- 
КонецФункции

Функция ПроверкаНомера(Документ, РежимЗаписи, Отказ) Экспорт
	
	Попытка
		Документ.Записать(РежимЗаписи);
	Исключение
		Сообщить(ОписаниеОшибки() + "Ведомый документ " + Документ + " записать не удалось!");
		
		Отказ = Истина;
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

//УСТАРЕЛА. Следует использовать функцию АвтоматическийПодборСчетов(ВариантПодбора)
Функция ВыполнитьАвтоматическийПодборСчетов(ВариантПодбора) Экспорт
	
	Объект = ЭтотОбъект;
	
	СтруктураНастроек  = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Объект.Организация, Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская, Объект.Дата); 
	
	ИспользуетсяОперативнаяЗадолженность = СтруктураНастроек["ВедетсяОперативныйУчет"];
	РежимВводначальныхОстатков_ОЗ 		 = СтруктураНастроек["ВводОстатков"];
	
	НастройкиОперативногоУчета = СтруктураНастроек["НастройкиОперативногоУчета"]; 
	КонтрольНоменклатуры 		= НастройкиОперативногоУчета["КонтрольНоменклатуры"];
	КонтрольПорядкаОтражения 	= НастройкиОперативногоУчета["КонтрольПорядкаОтражения"];
	КонтрольНДС 				= НастройкиОперативногоУчета["КонтрольНДС"];
	
	Если НЕ ИспользуетсяОперативнаяЗадолженность Тогда
		
		Возврат _УФКС.Ответ(1,"Не используется оперативная задолжненность");
		
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_АктированиеВходящихСчетовОстатки.Счет,
	               |	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток КАК Всего,
	               |	ЛОЖЬ КАК ЕстьСтроки,
	               |	CW_АктированиеВходящихСчетовОстатки.Грузоперевозка,
	               |	CW_АктированиеВходящихСчетовОстатки.Номенклатура,
	               |	CW_АктированиеВходящихСчетовОстатки.ПорядокОтражения,
	               |	CW_АктированиеВходящихСчетовОстатки.СтавкаНДС
	               |ИЗ
	               |	РегистрНакопления.CW_АктированиеВходящихСчетов.Остатки(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Контрагент = &Контрагент
	               |				И Договор = &Договор
	               |				И Грузоперевозка = &Грузоперевозка
	               |				И ВЫБОР
	               |					КОГДА &Номенклатура = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ Номенклатура = &Номенклатура
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &ПорядокОтражения = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ПорядокОтражения = &ПорядокОтражения
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &СтавкаНДС = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ СтавкаНДС = &СтавкаНДС
	               |				КОНЕЦ) КАК CW_АктированиеВходящихСчетовОстатки
	               |ГДЕ
	               |	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток > 0";
	Если (ВариантПодбора = 0) Тогда
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Иначе
		Запрос.УстановитьПараметр("Период", Объект.ДатаАкта);
	КонецЕсли; 
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Договор", Объект.Договор); 
	// --- 
	ТЗУслуги = Объект.Услуги.Выгрузить();
	ТЗУслуги.Колонки.Добавить("СчетПодобран");
	ТЗУслуги.ЗаполнитьЗначения(Ложь,"СчетПодобран");
	
	// --- 
	
	ТаблицаОстатковАктирования = Неопределено;
	// --- 
	
	Для каждого СтрокаДокумента Из ТЗУслуги Цикл
		
		Запрос.УстановитьПараметр("Грузоперевозка", СтрокаДокумента.Грузоперевозка); 
		Запрос.УстановитьПараметр("Номенклатура", ?(КонтрольНоменклатуры,СтрокаДокумента.Номенклатура,Неопределено)); 	
		Запрос.УстановитьПараметр("ПорядокОтражения", ?(КонтрольПорядкаОтражения,СтрокаДокумента.ПорядокОтражения,Неопределено)); 	
		Запрос.УстановитьПараметр("СтавкаНДС", ?(КонтрольНДС,СтрокаДокумента.СтавкаНДС,Неопределено)); 	
		// --- 
		
		Отбор = Новый Структура;
		Отбор.Вставить("Грузоперевозка",СтрокаДокумента.Грузоперевозка);
		Если (КонтрольНоменклатуры) Тогда
			Отбор.Вставить("Номенклатура",СтрокаДокумента.Номенклатура);
		КонецЕсли; 
		Если (КонтрольПорядкаОтражения) Тогда
			Отбор.Вставить("ПорядокОтражения",СтрокаДокумента.ПорядокОтражения);
		КонецЕсли; 
		Если (КонтрольНДС) Тогда
			Отбор.Вставить("СтавкаНДС",СтрокаДокумента.СтавкаНДС);
		КонецЕсли; 
		
		// --- 
		
		ПоДаннымЗапроса = Ложь;
		
		Если (ТаблицаОстатковАктирования = Неопределено) Тогда
			ТЗ = Запрос.Выполнить().Выгрузить();
			ПоДаннымЗапроса = Истина;
			ТаблицаОстатковАктирования = ТЗ.СкопироватьКолонки();	
		Иначе
			// пробуем найти
			ТЗ = ТаблицаОстатковАктирования.НайтиСтроки(Отбор);
			Если (ТЗ.Количество() = 0) Тогда
				ТЗ = Запрос.Выполнить().Выгрузить();
				ПоДаннымЗапроса = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
		Если (ПоДаннымЗапроса) Тогда
			
			МассивУдаления = Новый Массив;
			Для каждого Стр Из ТЗ Цикл
				Если (Стр.Счет.Пустая()) Тогда
					МассивУдаления.Добавить(Стр);
				КонецЕсли; 
			КонецЦикла; 
			_сф.к_УдалитьЭлементыПоМассиву(ТЗ,МассивУдаления);
			
			// --- 
			
			// переносим в таблицу остатков
			Для каждого Стр Из ТЗ Цикл
				Нстр = ТаблицаОстатковАктирования.Добавить();
				ЗаполнитьЗначенияСвойств(Нстр,Стр);
			КонецЦикла; 
			
		КонецЕсли; 
		
		// --- 
		
		КоличествоСтрок = ТЗ.Количество();
		Если (КоличествоСтрок = 1) Тогда
			
			// подставляем счет
			Если (СтрокаДокумента.Всего <= ТЗ[0].Всего) Тогда
				
				СтрокаДокумента.Счет = ТЗ[0].Счет;
				СтрокаДокумента.СчетПодобран = Истина;
				// --- 
				_сф.Декремент(ТЗ[0].Всего,СтрокаДокумента.Всего);
				
			КонецЕсли; 
			
		ИначеЕсли (КоличествоСтрок > 1) Тогда 
			
			// анализируем, ищем строку
			СчетПодобран = Ложь;
			Для каждого СтрокаТЗ Из ТЗ Цикл
				
				Если (СчетПодобран) Тогда
					Прервать;
				КонецЕсли; 
				Отбор = Новый Структура("Грузоперевозка,Номенклатура",СтрокаДокумента.Грузоперевозка,СтрокаДокумента.Номенклатура);
				УдовлетворяющиеСтроки = _сф.к_НайтиСтроки(СтрокаТЗ.Счет.Услуги,Отбор);
				Если (УдовлетворяющиеСтроки.Количество()<>0) Тогда
					
					Для каждого Стр Из УдовлетворяющиеСтроки Цикл
						
						Если (Стр.Всего >= СтрокаДокумента.Всего) Тогда
							СтрокаТЗ.ЕстьСтроки = Истина;
						КонецЕсли; 
						
						Если (Стр.Всего = СтрокаДокумента.Всего) Тогда
							
							СтрокаДокумента.Счет = СтрокаТЗ.Счет;
							СтрокаДокумента.СчетПодобран = Истина;
							_сф.Декремент(СтрокаТЗ.Всего,СтрокаДокумента.Всего);
							СчетПодобран = Истина;
							Продолжить;
							
						КонецЕсли; 
						
					КонецЦикла; 
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			Если (НЕ СчетПодобран) Тогда
				
				// берем первую строку из таблицы с соответствующими строками
				ЕстьСтроки = Ложь;
				Для каждого Стр Из ТЗ Цикл
					
					Если (Стр.ЕстьСтроки) Тогда
						ЕстьСтроки = Истина;
						Прервать;
					КонецЕсли; 
					
				КонецЦикла; 
				
				Если (ЕстьСтроки) Тогда
					
					// подставляем счет
					Для каждого Стр Из ТЗ Цикл
						
						Если (Стр.ЕстьСтроки) Тогда
							
							Если (Стр.Всего >= СтрокаДокумента.Всего) Тогда
								
								СтрокаДокумента.Счет = Стр.Счет;
								СтрокаДокумента.СчетПодобран = Истина;	
								// --- 
								_сф.Декремент(Стр.Всего, СтрокаДокумента.Всего);
								
							КонецЕсли; 
							
						КонецЕсли; 
						
					КонецЦикла; 
					
				Иначе
					
					Если (ТЗ[0].Всего >= СтрокаДокумента.Всего) Тогда
						
						СтрокаДокумента.Счет = ТЗ[0].Счет;
						СтрокаДокумента.СчетПодобран = Истина;
						// --- 
						_сф.Декремент(ТЗ[0].Всего,СтрокаДокумента.Всего);
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// анализируем и переносим найденные счета в 
	КоличествоНеподобранных = ТЗУслуги.Скопировать(Новый Структура("СчетПодобран",Ложь)).Количество();
	
	КолонкаСчетов = ТЗУслуги.Скопировать(,"Счет");
	КолонкаСчетов.Свернуть("Счет");
	Счета = КолонкаСчетов.ВыгрузитьКолонку("Счет");
	
	Если (Счета.Количество()=1 И КоличествоНеподобранных = 0) Тогда
		
		Объект.СписокСчетов = Ложь;
		Объект.Счет = Счета[0];
		
	Иначе
		
		Объект.СписокСчетов = Истина;
		Объект.Счет = Документы.CW_ДоходыПоГрузоперевозке.ПустаяСсылка();
		// --- 
		// переносим в ТЧ
		ВТЧ = Объект.Услуги.Выгрузить();
		ВТЧ.ЗагрузитьКолонку(ТЗУслуги.ВыгрузитьКолонку("Счет"),"Счет");
		Объект.Услуги.Загрузить(ВТЧ);
		
	КонецЕсли; 
	// --- 
	ТекстСообщения = "";
	Если (КоличествоНеподобранных=0) Тогда
		ТекстСообщения = "Счета подобраны.";
	Иначе
		ТекстСообщения = "Для "+Строка(КоличествоНеподобранных)+" строк(и) подобрать счета не удалось.";
	КонецЕсли; 
	Ответ = _УФКС.Ответ(,ТекстСообщения);
	
	Возврат(Ответ);
	
	// --- 
КонецФункции

Функция АвтоматическийПодборСчетов(ВариантПодбора) Экспорт

	Если ВариантПодбора = 0 Тогда
		ДатаСреза = ТекущаяДата();
	Иначе
		ДатаСреза = ДатаАкта;
	КонецЕсли;     
	
	СтруктураНастроек  = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Организация, Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская, ДатаСреза); 
	
	Если Не СтруктураНастроек["ВедетсяОперативныйУчет"] Тогда
		ВызватьИсключение "Не используется оперативная задолжненность";	
	КонецЕсли;

	НастройкиОперативногоУчета = СтруктураНастроек["НастройкиОперативногоУчета"]; 
	КонтрольНоменклатуры 		= НастройкиОперативногоУчета["КонтрольНоменклатуры"];
	КонтрольПорядкаОтражения 	= НастройкиОперативногоУчета["КонтрольПорядкаОтражения"];
	КонтрольНДС 				= НастройкиОперативногоУчета["КонтрольНДС"];
	
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаУслуг.Грузоперевозка КАК Грузоперевозка,
	|	ТаблицаУслуг.Номенклатура КАК Номенклатура,
	|	ТаблицаУслуг.ПорядокОтражения КАК ПорядокОтражения,
	|	ТаблицаУслуг.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	&ТаблицаУслуг КАК ТаблицаУслуг";
	
	Запрос.УстановитьПараметр("ТаблицаУслуг", Услуги.Выгрузить());
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДанныеДокумента.Грузоперевозка КАК Грузоперевозка
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента"; 
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивГрузоперевозок = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	
	ЗапросАктирование = Новый Запрос;
	ЗапросАктирование.Текст = "ВЫБРАТЬ
	|	CW_АктированиеВходящихСчетовОстатки.Грузоперевозка КАК Грузоперевозка,
	|	CW_АктированиеВходящихСчетовОстатки.Номенклатура КАК Номенклатура,
	|	CW_АктированиеВходящихСчетовОстатки.ПорядокОтражения КАК ПорядокОтражения,
	|	CW_АктированиеВходящихСчетовОстатки.СтавкаНДС КАК СтавкаНДС,
	|	CW_АктированиеВходящихСчетовОстатки.Счет КАК Счет,
	|	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток КАК Всего
	|ИЗ
	|	РегистрНакопления.CW_АктированиеВходящихСчетов.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И Договор = &Договор
	|				И Грузоперевозка В (&Грузоперевозки)   
	|				//УСЛОВИЕ_Номенклатура
	|				//УСЛОВИЕ_ПорядокОтражения 
	|				//УСЛОВИЕ_СтавкаНДС
	|				И Счет <> ЗНАЧЕНИЕ(Документ.CW_ДоходыПоГрузоперевозке.ПустаяСсылка)) КАК CW_АктированиеВходящихСчетовОстатки
	|ГДЕ
	|	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток > 0";  
	
	ЗапросАктирование.УстановитьПараметр("Период", 			ДатаСреза);
	ЗапросАктирование.УстановитьПараметр("Организация", 	Организация);
	ЗапросАктирование.УстановитьПараметр("Контрагент", 		Контрагент);
	ЗапросАктирование.УстановитьПараметр("Договор", 		Договор);   
	ЗапросАктирование.УстановитьПараметр("Грузоперевозки", 	МассивГрузоперевозок); 
	
	Если КонтрольНоменклатуры Тогда   
		
		ЗапросАктирование.Текст = СтрЗаменить(ЗапросАктирование.Текст, "//УСЛОВИЕ_Номенклатура", "И Номенклатура В (&Номенклатура)");	
	
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента";
		
		РезультатЗапроса = Запрос.Выполнить();
		МассивНоменклатуры = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		ЗапросАктирование.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	КонецЕсли;   
	
	Если КонтрольПорядкаОтражения Тогда   
		ЗапросАктирование.Текст = СтрЗаменить(ЗапросАктирование.Текст, "//УСЛОВИЕ_ПорядокОтражения", "И ПорядокОтражения В (&ПорядокОтражения)");	
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеДокумента.ПорядокОтражения КАК ПорядокОтражения
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента";
		
		РезультатЗапроса = Запрос.Выполнить();
		МассивПорядокОтражения = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПорядокОтражения"); 
		
		ЗапросАктирование.УстановитьПараметр("ПорядокОтражения", МассивПорядокОтражения);
	КонецЕсли;   
	
	Если КонтрольНДС Тогда
		ЗапросАктирование.Текст = СтрЗаменить(ЗапросАктирование.Текст, "//УСЛОВИЕ_СтавкаНДС", "И СтавкаНДС В (&СтавкаНДС)");	
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеДокумента.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента"; 
		
		РезультатЗапроса = Запрос.Выполнить();
		МассивСтавкаНДС = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СтавкаНДС"); 
		
		ЗапросАктирование.УстановитьПараметр("СтавкаНДС", МассивСтавкаНДС);
	КонецЕсли;
	
	РезультатЗапроса = ЗапросАктирование.Выполнить();
	ТаблицаСчетов = РезультатЗапроса.Выгрузить(); 
	ТаблицаСчетов.Колонки.Добавить("Выбран", Новый ОписаниеТипов("Булево"));
	ТаблицаСчетов.Сортировать("Всего ВОЗР");
	
	Подобрано = 0;
	
	Для Каждого СтрокаУслуг из Услуги Цикл
	
		ОтборСтрок = Новый Структура; 
		ОтборСтрок.Вставить("Выбран", 			Ложь); 
		ОтборСтрок.Вставить("Грузоперевозка", 	СтрокаУслуг.Грузоперевозка); 
		ОтборСтрок.Вставить("Всего", 			СтрокаУслуг.Всего); 
		
		Если КонтрольНоменклатуры Тогда
			ОтборСтрок.Вставить("Номенклатура", 	СтрокаУслуг.Номенклатура);
		КонецЕсли;
		Если КонтрольПорядкаОтражения Тогда
			ОтборСтрок.Вставить("ПорядокОтражения", СтрокаУслуг.ПорядокОтражения);
		КонецЕсли;
		Если КонтрольНДС Тогда
			ОтборСтрок.Вставить("СтавкаНДС", 		СтрокаУслуг.СтавкаНДС);
		КонецЕсли;  
		
		
		Пока Истина Цикл
			
			НайденныеСтроки = ТаблицаСчетов.НайтиСтроки(ОтборСтрок); 
			Если НайденныеСтроки.Количество() = 0 Тогда 
				Если ОтборСтрок.Свойство("СтавкаНДС") Тогда
					ОтборСтрок.Удалить("СтавкаНДС");  
				КонецЕсли;
				Если ОтборСтрок.Свойство("ПорядокОтражения") Тогда
					ОтборСтрок.Удалить("ПорядокОтражения");   
				КонецЕсли;
				Если ОтборСтрок.Свойство("Номенклатура") Тогда
					ОтборСтрок.Удалить("Номенклатура");   
				КонецЕсли;
				Если ОтборСтрок.Свойство("Всего") Тогда
					ОтборСтрок.Удалить("Всего");   
				КонецЕсли;
			КонеЦЕсли;
			
			Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл 
				Если НайденнаяСтрока.Всего >= СтрокаУслуг.Всего Тогда
					
					СтрокаУслуг.Счет 		= НайденнаяСтрока.Счет; 
					НайденнаяСтрока.Всего 	= НайденнаяСтрока.Всего - СтрокаУслуг.Всего;
					
					Подобрано = Подобрано + 1;  
					
					Если НайденнаяСтрока.Всего = 0 Тогда
						НайденнаяСтрока.Выбран = Истина;
					КонецЕсли;   
					
					Прервать;
					
				КонецЕсли;
			КонецЦикла;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;  
	
	НеПодобрано = Услуги.Количество() - Подобрано;
	
	Если НеПодобрано = 0 Тогда
		ТекстСообщения = "Счета подобраны.";  

		// если во всех строках подобрали только один счет, то пропишем его в шапку
		ТЗСчетов = Услуги.Выгрузить();
		ТЗСчетов.Свернуть("Счет");
		Если ТЗСчетов.Количество() = 1 Тогда
			СписокСчетов = Ложь; 
			Счет = ТЗСчетов[0]["Счет"];
		КонецЕсли;		
		
	Иначе
		ТекстСообщения = "Для "+Строка(НеПодобрано)+" строк(и) подобрать счета не удалось.";
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Код", 0);
	Ответ.Вставить("ОписаниеОшибки",ТекстСообщения);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьНомерИДатуВходящегоСчетФактуры()
	
	Структура = Новый Структура;
	
	Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
		Структура.Вставить("НомерСФ", КорректируемыйДокумент.НомерСФ);
		Структура.Вставить("ДатаСФ",  КорректируемыйДокумент.ДатаСФ); 
	Иначе
		Структура.Вставить("НомерСФ", НомерСФ);
		Структура.Вставить("ДатаСФ",  ДатаСФ); 
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции 

Функция ПолучитьНомерИДатуВходящегоПоступления() 
	
	Структура = Новый Структура;
	
	Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
		Структура.Вставить("НомерАкта", КорректируемыйДокумент.НомерАкта);
		Структура.Вставить("ДатаАкта",  КорректируемыйДокумент.ДатаАкта); 
	Иначе
		Структура.Вставить("НомерАкта", НомерАкта);
		Структура.Вставить("ДатаАкта",  ДатаАкта); 
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции 

Функция ПолучитьСтавкуНалогообложенияПриУСН()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ДатаСреза", 		ДатаАкта);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиУчетаНДССрезПоследних.СтавкаНалогообложенияПриУСН КАК СтавкаНалогообложенияПриУСН
	|ИЗ
	|	РегистрСведений.НастройкиУчетаНДС.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК НастройкиУчетаНДССрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиУчетаНДССрезПоследних.Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтавкаНалогообложенияПриУСН;
	КонецЕсли;
	
КонецФункции


#КонецЕсли