#Область СлужебныйПрограммныйИнтерфейс

// Проверяет, является ли текущий пользователь ИБ неразделенным.
//
// Возвращаемое значение:
//   Булево
//
Функция ЭтоНеразделенныйПользовательИБ() Экспорт
	
	Если ПользователиИнформационнойБазы.ТекущийПользователь().РазделениеДанных.Количество() > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПравоИзмененияНастройкиПользователейИПрав() Экспорт
	
	Возврат ПравоДоступа("Просмотр", Метаданные.Обработки.ПанельАдминистрированияБСП.Команды.НастройкиПользователейИПрав);
	
КонецФункции

#КонецОбласти