
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Обмен",Обмен);
	Список.Параметры.УстановитьЗначениеПараметра("Обмен",?(Обмен.Пустая(),Неопределено,Обмен));
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Если Обмен.Пустая() Тогда
		
		Элементы.Источник_УИД.Заголовок = "Идентификатор (УИД)";
		Элементы.Источник_УИД.Видимость = Истина;
		// --- 
		Элементы.Источник_СИ.Заголовок = "Идентификатор (Строковый)";
		Элементы.Источник_СИ.Видимость = Истина;
		
	Иначе
		
		Если Обмен.ИспользуетсяUID Тогда
			
			Элементы.Источник_УИД.Заголовок = "Идентификатор";
			Элементы.Источник_УИД.Видимость = Истина;
			// --- 
			Элементы.Источник_СИ.Видимость = Ложь;
			
		Иначе
			
			Элементы.Источник_УИД.Видимость = Ложь;
			// --- 
			Элементы.Источник_СИ.Заголовок = "Идентификатор";
			Элементы.Источник_СИ.Видимость = Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОбменПриИзменении(Элемент)
	
	_ОтборОбменПриИзменении();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура _ОтборОбменПриИзменении()
	// --- 
	
	Если Обмен.Пустая() Тогда
		
		Значение = Неопределено;
		
	Иначе
		
		Значение = Обмен;
		
	КонецЕсли; 
	Список.Параметры.УстановитьЗначениеПараметра("Обмен",Значение);
	
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры