
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.СхемаКомпоновки));
		
КонецПроцедуры


&НаКлиенте
Процедура ДоступныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДоступноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока);
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Поле",		ДоступноеПоле.Поле);
	СтруктураОтвета.Вставить("Заголовок",	ДоступноеПоле.Заголовок);
	СтруктураОтвета.Вставить("ТипЗначения",	ДоступноеПоле.ТипЗначения);

	ЭтаФорма.Закрыть(СтруктураОтвета);
	
КонецПроцедуры

