
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Документ = ПараметрКоманды;
	// --- 
	
	ПФ = Новый Структура("Адрес,Ссылка",_АдресТаблицыГрузоперевозок(Документ),Документ);
	ОткрытьФорму("ОбщаяФорма.CW_ЗакрытыеГрузоперевозкиПоДокументу",ПФ);
	
КонецПроцедуры

&НаСервере
Функция _АдресТаблицыГрузоперевозок(Документ)
	// --- 
	
	Таблица = CW_Мониторинг.ТаблицаЗакрытыхГрузоперевозок(Документ);
	Возврат(ПоместитьВоВременноеХранилище(Таблица,Документ.УникальныйИдентификатор()));
	
	// --- 
КонецФункции
 