&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнтервалОбновления = 60;
	// --- 
	Параметры.Свойство("ОтборПоВладельцу",ВладелецЗадания);
	// --- 
	_ОбновитьСписокРегламентныхЗаданий();
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// подключаем обработчик ожидания
	ПодключитьОбработчикОжидания("ОбновлениеСпискаРегламентныхЗаданий",ИнтервалОбновления,Ложь);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Обновить(Команда)
	
	_ОбновитьСписокРегламентныхЗаданий();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеСпискаРегламентныхЗаданий()
	// --- 
	
	_ОбновитьСписокРегламентныхЗаданий();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбновитьСписокРегламентныхЗаданий()
	// --- 
	
	Перем ТекущийИдентификатор;
	
	УстановитьПривилегированныйРежим(Истина);
	// ----------------------------------------------------------------------------
	
	Если Элементы.СписокРегламентныхЗаданий.ТекущаяСтрока <> Неопределено Тогда
		
		ТекущийИдентификатор = СписокРегламентныхЗаданий.НайтиПоИдентификатору(Элементы.СписокРегламентныхЗаданий.ТекущаяСтрока).Идентификатор;
		
	КонецЕсли; 
		
	ИдентификаторыВыделенныхСтрок = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.СписокРегламентныхЗаданий.ВыделенныеСтроки Цикл
		ИдентификаторыВыделенныхСтрок.Добавить(СписокРегламентныхЗаданий.НайтиПоИдентификатору(ВыделеннаяСтрока).Идентификатор);
	КонецЦикла;
	
	// --- 
	Для каждого Стр Из СписокРегламентныхЗаданий Цикл
		
		УдалитьИзВременногоХранилища(Стр.АдресРЗ);
		
	КонецЦикла; 
	
	СписокРегламентныхЗаданий.Очистить();
	
	// --- 
	
	КоллекцияРегламентныхЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	
	ОтборПоВладельцу = Ложь;
	Если ТипЗнч(ВладелецЗадания) <> Тип("Неопределено") Тогда
		
		Попытка
			
			Если ЗначениеЗаполнено(ВладелецЗадания) Тогда
				
				ОтборПоВладельцу = Истина;
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	CW_РегламентныеЗадания.ИдентификаторЗадания
				|ИЗ
				|	РегистрСведений.CW_РегламентныеЗадания КАК CW_РегламентныеЗадания
				|ГДЕ
				|	CW_РегламентныеЗадания.Объект = &Объект";
				Запрос.УстановитьПараметр("Объект", ВладелецЗадания);
				МассивЗаданий = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторЗадания");
								
			КонецЕсли; 
			
		Исключение
			
			ОтборПоВладельцу = Ложь;
			
		КонецПопытки; 
		
	КонецЕсли; 
	
	Для Каждого РегламентноеЗадание из КоллекцияРегламентныхЗаданий Цикл
		
		Если ОтборПоВладельцу Тогда
			
			Если МассивЗаданий.Найти(РегламентноеЗадание.УникальныйИдентификатор) = Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		// --- 
		НоваяСтрока = СписокРегламентныхЗаданий.Добавить();
		НоваяСтрока.Метаданные 			= РегламентноеЗадание.Метаданные.Представление();
		НоваяСтрока.Наименование 		= РегламентноеЗадание.Наименование;
		НоваяСтрока.Ключ 				= РегламентноеЗадание.Ключ;
		НоваяСтрока.Расписание 			= РегламентноеЗадание.Расписание;
		НоваяСтрока.Пользователь 		= РегламентноеЗадание.ИмяПользователя;
		НоваяСтрока.Предопределенное 	= РегламентноеЗадание.Предопределенное;
		НоваяСтрока.Использование 		= РегламентноеЗадание.Использование;
		НоваяСтрока.Идентификатор 		= РегламентноеЗадание.УникальныйИдентификатор;
		НоваяСтрока.АдресРЗ 			= ПоместитьВоВременноеХранилище(РегламентноеЗадание,УникальныйИдентификатор);
		
		
		ПоследнееЗадание = РегламентноеЗадание.ПоследнееЗадание;
		Если ПоследнееЗадание <> Неопределено Тогда
			НоваяСтрока.Выполнялось = ПоследнееЗадание.Начало;
			НоваяСтрока.Состояние = ПоследнееЗадание.Состояние;
		КонецЕсли;
		// --- 
		
	КонецЦикла;
	
	Если ТекущийИдентификатор <> Неопределено Тогда
		
		Строки = СписокРегламентныхЗаданий.НайтиСтроки(Новый Структура("Идентификатор",ТекущийИдентификатор));
		Если Строки.Количество() > 0 Тогда
			
			Элементы.СписокРегламентныхЗаданий.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
			
		КонецЕсли; 
						
	КонецЕсли;
	// --- 
	Если ИдентификаторыВыделенныхСтрок.Количество() > 0 Тогда
		Элементы.СписокРегламентныхЗаданий.ВыделенныеСтроки.Очистить();
	КонецЕсли;
	// --- 
	Для Каждого Идентификатор из ИдентификаторыВыделенныхСтрок Цикл
		Строки = СписокРегламентныхЗаданий.НайтиСтроки(Новый Структура("Идентификатор",Идентификатор));
		Если Строки.Количество() > 0 Тогда
			Элементы.СписокРегламентныхЗаданий.ВыделенныеСтроки.Добавить(Строки[0].ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;	
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СписокРегламентныхЗаданийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаОткрытияРЗ",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура("ИдентификаторРЗ",СписокРегламентныхЗаданий.НайтиПоИдентификатору(ВыбраннаяСтрока).Идентификатор);
	ОткрытьФорму("Обработка.CW_КонсольЗаданий.Форма.ФормаРегламентногоЗадания",ПараметрыФормы,,,,,ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОткрытияРЗ(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда

		Если Ответ.Код <> 0 Тогда
			
			Сообщить(Ответ.ОписаниеОшибки);
			
		Иначе
			
			_ОбновитьСписокРегламентныхЗаданий();
			
		КонецЕсли; 
		
	Иначе
		
		_ОбновитьСписокРегламентныхЗаданий();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура СписокРегламентныхЗаданийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	// сначала проверяем, не является ли 
	СтрокаСписка = СписокРегламентныхЗаданий.НайтиПоИдентификатору(Элементы.СписокРегламентныхЗаданий.ТекущаяСтрока);
	Если СтрокаСписка.Предопределенное=Истина Тогда
		
		_УФК.ВывестиПредупреждение("Нелья удалить предопределённое задание!");
		Возврат;
		
	КонецЕсли; 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУдаленияРЗ",ЭтотОбъект, Новый Структура("СтрокаСписка",СтрокаСписка)); 
	ПоказатьВопрос(ПОВ,"Вы уверены?", РежимДиалогаВопрос.ДаНет) ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУдаленияРЗ(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ=КодВозвратаДиалога.Да) Тогда
		
		Ответ = _УдалитьЗадание(ДополнительныеПараметры.СтрокаСписка.Идентификатор);
		Если Ответ.Код <> 0 Тогда
			
			Сообщить(Ответ.ОписаниеОшибки);
						
		Иначе
			
			_ОбновитьСписокРегламентныхЗаданий();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _УдалитьЗадание(Идентификатор)
	// --- 
	
	Попытка
		
		РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Идентификатор));
		РЗ.Удалить();
		
		Возврат(_УФКС.Ответ(0));
		
	Исключение
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 	
	
	// --- 
КонецФункции

&НаКлиенте
Процедура СписокРегламентныхЗаданийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияРЗ",ЭтотОбъект); 	
	ПараметрыФормы = Новый Структура("ИдентификаторРЗ","");
	ОткрытьФорму("Обработка.CW_КонсольЗаданий.Форма.ФормаРегламентногоЗадания",ПараметрыФормы,,,,,ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияРЗ(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда

		Если Ответ.Код <> 0 Тогда
			
			Сообщить(Ответ.ОписаниеОшибки);
			
		Иначе
			
			_ОбновитьСписокРегламентныхЗаданий();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура Запустить(Команда)
	
	Ответ = _ЗапуститьРЗ(СписокРегламентныхЗаданий.НайтиПоИдентификатору(Элементы.СписокРегламентныхЗаданий.ТекущаяСтрока).Идентификатор);
	Если Ответ.Код <> 0 Тогда
		
		_УФК.ВывестиПредупреждение("Ошибка: "+Ответ.ОписаниеОшибки);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ЗапуститьРЗ(Идентификатор)
	// --- 
	
	УстановитьПривилегированныйРежим(Истина);
	
	РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Идентификатор));
	Попытка
		
		МассивПараметров = РЗ.Параметры;
		Если (МассивПараметров.Количество()=0) Тогда
			ПараметрыВызова = "";
		Иначе
			ПараметрыВызова = "";
			Индекс = 0;
			Для каждого Стр Из МассивПараметров Цикл
				Если (ПараметрыВызова <> "") Тогда
					ПараметрыВызова = ПараметрыВызова+",";
				КонецЕсли; 
				ПараметрыВызова = ПараметрыВызова+"МассивПараметров["+Формат(Индекс,"ЧРГ=; ЧН=; ЧГ=")+"]";
				_сф.Инкремент(Индекс);
			КонецЦикла;
		КонецЕсли; 
		// ---  
		Выполнить(РЗ.Метаданные.ИмяМетода+"("+ПараметрыВызова+");");
		Возврат(_УФКС.Ответ());
		
	Исключение
	    Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СистемныеСообщения(Команда)
	
	ОткрытьФорму("Справочник.CW_СистемныеСообщения.ФормаСписка");
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СнятьОтбор(Команда)
	
	ВладелецЗадания = Неопределено;
	_ОбновитьСписокРегламентныхЗаданий();
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецЗаданияПриИзменении(Элемент)
	
	_ОбновитьСписокРегламентныхЗаданий();
	
КонецПроцедуры
 

 
  