#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПолучитьРуководствоПользователя(ПараметрыПроцедуры, АдерсРезультата) Экспорт
	
	ДанныеАутентификации = CW_МониторПорталаПоддержкиСервер.ДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ДанныеАутентификации = Неопределено Тогда
		ВызватьИсключение "Не указаны данные аутентификации пользователя на FTP-сервере";
	КонецЕсли;
	
	ПараметрыFTPПодключения = CW_РаботаСFTPРесурсами.ПолучитьПустуюСтруктуруНастроекFTP();   
	ПараметрыFTPПодключения.Логин  = ДанныеАутентификации.Логин;
	ПараметрыFTPПодключения.Пароль = ДанныеАутентификации.Пароль;
	
	CW_РаботаСFTPРесурсами.ЗаполнитьНастройкиFTPРесурса(ПараметрыFTPПодключения);	
	
	FTPСоединение = CW_РаботаСFTPРесурсами.ПодключитьсяКFTPРесурсу(ПараметрыFTPПодключения);
	Если FTPСоединение = Неопределено Тогда
		ВызватьИсключение  "Не удалось подключиться к ftp ресурсу!";
	КонецЕсли;
	
	Каталог = "/Guide";
	FTPСоединение.УстановитьТекущийКаталог(Каталог);
	
	Если FTPСоединение.НайтиФайлы("UserGuide_AF8.pdf").Количество() = 0 тогда
		ВызватьИсключение "На ftp ресурсе не найден файл руководства пользователя!";
	КонецЕсли;
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("pdf");
	FTPСоединение.Получить("UserGuide_AF8.pdf",ВременныйФайл);
	
	ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременныйФайл), АдерсРезультата);
	
КонецПроцедуры

#КонецЕсли