
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСпискаЗначений 					= Параметры.АдресСпискаЗначений;
	СписокСПометками 						= Параметры.СписокСПометками;
	Заголовок 								= Параметры.ЗаголовокФормы;
	
	Элементы.СписокВыбораПометка.Видимость 			= СписокСПометками;
	Элементы.ГруппаКнопокПометок.Видимость  		= СписокСПометками;
	Элементы.СписокВыбора.ПоложениеКоманднойПанели 	= ?(СписокСПометками,ПоложениеКоманднойПанелиЭлементаФормы.Авто,ПоложениеКоманднойПанелиЭлементаФормы.Нет);
	
	Если ЭтоАдресВременногоХранилища(АдресСпискаЗначений) Тогда
		мЗначенияСписка = ПолучитьИзВременногоХранилища(АдресСпискаЗначений);
		Для Каждого ЭлементСписка из мЗначенияСписка Цикл
			СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление,ЭлементСписка.Пометка,ЭлементСписка.Картинка);
		КонецЦикла;
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	АдресВыбранногоЗначения = ПолучитьАдресВыбранногоЗначения(ВыбраннаяСтрока);
	ЭтаФорма.Закрыть(АдресВыбранногоЗначения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеСписка(Команда)
	
	АдресВыбранногоЗначения = ПолучитьАдресВыбранногоЗначения(Элементы.СписокВыбора.ТекущаяСтрока);
	ЭтаФорма.Закрыть(АдресВыбранногоЗначения);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресВыбранногоЗначения(ВыбраннаяСтрока)
	
	СтруктураОтвета = Новый Структура("Пометка,Значение,Представление",Ложь,Неопределено,Неопределено);
	
	Если СписокСПометками Тогда
		Адрес = ПоместитьВоВременноеХранилище(СписокВыбора);
	Иначе
		//только выбранная строка
		ЗаполнитьЗначенияСвойств(СтруктураОтвета, СписокВыбора[ВыбраннаяСтрока]);
		Адрес =  ПоместитьВоВременноеХранилище(СтруктураОтвета)
	КонецЕсли;
	
	Возврат Адрес;
	
КонецФункции
