
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеОтбора = ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.Счет"); 
	УстановитьОтборСтрок();
	
КонецПроцедуры   

&НаКлиенте
Процедура ЗначениеОтбораПриИзменении(Элемент)
	УстановитьОтборСтрок();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСтрок()
	
	Структура = новый Структура;
	Структура.Вставить("ВидДокументаКомплекта", ЗначениеОтбора);
	
	ОтборСтрок = Новый ФиксированнаяСтруктура(Структура);
	
	Элементы.СоставКомплекта.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомплектаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока и НЕ Копирование Тогда
		ТекущиеДанные = Элементы.СоставКомплекта.ТекущиеДанные;
		ТекущиеДанные.ВидДокументаКомплекта = ЗначениеОтбора;
	КонецЕсли;
	
КонецПроцедуры



