
Функция ПолучитьОчереднойНомер(Знач Объект, Знач ИмяОбъекта) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Если ИмяОбъекта = "CW_ДоговорыПоГрузоперевозкам" Тогда
		Если НЕ ПолучитьФункциональнуюОпцию("CW_АвтоматическаяНумерацияДоговоровСПокупателями") Тогда
			Возврат "";
		КонецЕсли;
		
		ДлинаРеквизита 		= Метаданные.Справочники.CW_ДоговорыПоГрузоперевозкам.Реквизиты["НомерДоговора"].Тип.КвалификаторыСтроки.Длина;
		
		МенеджерРегистра 	= РегистрыСведений.CW_НумерацияДоговоров;
		Нумератор 		 	= Константы.CW_НумераторДоговоров.Получить();
		ПрефиксНомера	 	= Константы.CW_ШаблонНомераДоговораСПокупателем.Получить();
		ДлинаЧисловойЧасти	= Константы.CW_ДлинаЧисловойЧастиНомераДоговора.Получить();
		
		Организация 	= Объект.Организация;
		ДатаОбъекта		= Объект.ДатаДоговора;
		ТекущийНомер	= Объект.НомерДоговора;
		
	ИначеЕсли ИмяОбъекта = "CW_ПриложенияКДоговорам" Тогда

		Если НЕ ПолучитьФункциональнуюОпцию("CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями") Тогда
			Возврат "";
		КонецЕсли;
		
		ДлинаРеквизита 		= Метаданные.Справочники.CW_ПриложенияКДоговорам.Реквизиты["НомерДокумента"].Тип.КвалификаторыСтроки.Длина;

		МенеджерРегистра 	= РегистрыСведений.CW_НумерацияПриложений;
		Нумератор 		 	= Константы.CW_НумераторПриложений.Получить();
		ПрефиксНомера 	 	= Константы.CW_ШаблонНомераПриложенияКДоговоруСПокупателем.Получить();
		ДлинаЧисловойЧасти	= Константы.CW_ДлинаЧисловойЧастиНомераПриложения.Получить();
		
		ОбъектДоговор 	= Объект.Договор;
		Организация 	= ОбъектДоговор.Организация;
		ДатаОбъекта		= Объект.ДатаДокумента;
		ТекущийНомер	= Объект.НомерДокумента;
		
		СтруктураПараметров.Вставить("Договор", ОбъектДоговор);
		
	Иначе
		
		Возврат ""
		
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(Нумератор)) Тогда
		
		// пытаемся сформировать наименование
		ОбработкаОбъект = _ПО.ПолучитьОбработку(Нумератор);
		// Параметры:
		// ТекущийОбъект - объект заказа
		// Обработка - сама обработка нумерации
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Объект", 				Объект);
		СтруктураПараметров.Вставить("Нумератор", 			Нумератор);
		СтруктураПараметров.Вставить("МаксДлинаРеквизита", 	ДлинаРеквизита);
		
		НовыйНомер = ОбработкаОбъект.ПолучитьНовыйНомер(СтруктураПараметров);
		ОбработкаОбъект = Неопределено;
		
		Возврат НовыйНомер;
		
	Иначе
		
		УстановитьПрефиксОрганизации	= СтрНайти(ПрефиксНомера,"[ОР]") > 0;
		УстановитьПрефиксМесяца 		= СтрНайти(ПрефиксНомера,"[ММ]") > 0;
		УстановитьПрефиксГодаПолный		= СтрНайти(ПрефиксНомера,"[ГГГГ]") > 0;
		УстановитьПрефиксГодаКраткий	= СтрНайти(ПрефиксНомера,"[ГГ]") > 0;
		
		Если УстановитьПрефиксОрганизации Тогда
			ПрефиксОрганизации = "";
			Если ЗначениеЗаполнено(Организация) Тогда
				ПрефиксацияОбъектовСобытия.ПриОпределенииПрефиксаОрганизации(Организация, ПрефиксОрганизации);
				Если ПрефиксОрганизации = Ложь Тогда
					ПрефиксОрганизации = "";
				КонецЕсли;
			Иначе
				ПрефиксОрганизации = "00";
			КонецЕсли;
			
			ПрефиксНомера = СтрЗаменить(ПрефиксНомера, "[ОР]", ПрефиксОрганизации);
		КонецЕсли;

		Если УстановитьПрефиксГодаПолный Тогда
			Если ЗначениеЗаполнено(ДатаОбъекта) Тогда
				ПрефиксГода = Формат(ДатаОбъекта,"ДФ=yyyy");
			Иначе
				ПрефиксГода = "0000";
			КонецЕсли;
			ПрефиксНомера = СтрЗаменить(ПрефиксНомера, "[ГГГГ]", ПрефиксГода);
		КонецЕсли;
		
		Если УстановитьПрефиксГодаКраткий Тогда
			Если ЗначениеЗаполнено(ДатаОбъекта) Тогда
				ПрефиксГода = Формат(ДатаОбъекта,"ДФ=yy");
			Иначе
				ПрефиксГода = "00";
			КонецЕсли;
			ПрефиксНомера = СтрЗаменить(ПрефиксНомера, "[ГГ]", ПрефиксГода);
		КонецЕсли;
		
		Если УстановитьПрефиксМесяца Тогда
			Если ЗначениеЗаполнено(ДатаОбъекта) Тогда
				ПрефиксМесяца = Формат(ДатаОбъекта,"ДФ=MM");
			Иначе
				ПрефиксМесяца = "00";
			КонецЕсли;
			ПрефиксНомера = СтрЗаменить(ПрефиксНомера, "[ММ]", ПрефиксМесяца);
		КонецЕсли;
		
		СтруктураПараметров.Вставить("ПрефиксНомера", ПрефиксНомера);
		
		ПоследнийНомер 	 = МенеджерРегистра.ПолучитьПоследнийНомер(СтруктураПараметров);
		НовыйНомер		 = ПоследнийНомер + 1;
		НовыйНомерСтрока = Формат(НовыйНомер, "ЧГ=0");
		
		СтруктураПараметров.Вставить("Номер", НовыйНомер);
		МенеджерРегистра.ЗаписатьПоследнийНомер(СтруктураПараметров);
		
		Если СтрДлина(ПрефиксНомера) + ДлинаЧисловойЧасти > ДлинаРеквизита Тогда
			  ДлинаЧисловойЧасти = ДлинаРеквизита - СтрДлина(ПрефиксНомера);
		  КонецЕсли;
		  
		НовыйНомерСтрока = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(НовыйНомерСтрока, ДлинаЧисловойЧасти, "0", "Слева");

		Возврат ПрефиксНомера+НовыйНомерСтрока;
		
	КонецЕсли;
	
КонецФункции
	
Функция ПолучитьИмяОбъкетаМетаданных(Объект) Экспорт
	Возврат Объект.Ссылка.Метаданные().Имя;
КонецФункции
	