
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

Процедура ЗаполнениеТаблицДокументаПриОбновлении() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаРегистров.Ссылка
		|ИЗ
		|	Документ.CW_КорректировкаРегистров КАК КорректировкаРегистров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CW_КорректировкаРегистров.ТаблицаРегистровНакопления КАК КорректировкаРегистровТаблицаРегистровНакопления
		|		ПО (КорректировкаРегистровТаблицаРегистровНакопления.Ссылка = КорректировкаРегистров.Ссылка)
		|			И (КорректировкаРегистровТаблицаРегистровНакопления.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CW_КорректировкаРегистров.ТаблицаРегистровСведений КАК КорректировкаРегистровТаблицаРегистровСведений
		|		ПО (КорректировкаРегистровТаблицаРегистровСведений.Ссылка = КорректировкаРегистров.Ссылка)
		|			И (КорректировкаРегистровТаблицаРегистровСведений.НомерСтроки = 1)
		|ГДЕ
		|	КорректировкаРегистровТаблицаРегистровНакопления.Ссылка ЕСТЬ NULL 
		|	И КорректировкаРегистровТаблицаРегистровСведений.Ссылка ЕСТЬ NULL 
		|	И КорректировкаРегистров.ПометкаУдаления = ЛОЖЬ";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
    МетаданныеДокумента = Метаданные.Документы.КорректировкаРегистров;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		НужноЗаписывать = Ложь;
		Для Каждого МетаданныеРегистра Из МетаданныеДокумента.Движения Цикл

			//Регистр     = Регистры.Добавить();
			РегистрИмя = МетаданныеРегистра.Имя;
			ПолноеИмя   = МетаданныеРегистра.ПолноеИмя();

			ПозицияТочки = Найти(ПолноеИмя, ".");
			ТипРегистра  = Лев(ПолноеИмя, ПозицияТочки - 1);

			ТипРегистра = ТипРегистра;

			ДокОбъект.Движения[РегистрИмя].Прочитать();
			Если ДокОбъект.Движения[РегистрИмя].Количество()> 0 Тогда
				Если ТипРегистра = "РегистрНакопления" Тогда
					НовСтр = ДокОбъект.ТаблицаРегистровНакопления.Добавить();
					НовСтр.Имя = РегистрИмя;
					НужноЗаписывать = Истина;
				ИначеЕсли ТипРегистра = "РегистрСведений" Тогда
					НовСтр = ДокОбъект.ТаблицаРегистровСведений.Добавить();
				    НовСтр.Имя = РегистрИмя;
					НужноЗаписывать = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
				
		Если НужноЗаписывать Тогда
			
			ДокОбъект.ОбменДанными.Загрузка = Истина;
			ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
			ДокОбъект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		
			ДокОбъект.Записать();

		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли