
Функция ПолучитьСтатусУтвержденияВерсииБюджета(ОбъектБюджета, ВерсияБюджета) Экспорт
	
	Результат = Новый Структура("Период,Утвреждена", Дата(1,1,1), Ложь);
	
	Если ОбъектБюджета.Пустая() Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ИсторияУтверждениеБюджетовСрезПоследних.Период КАК Период,
	               |	CW_ИсторияУтверждениеБюджетовСрезПоследних.Пользователь КАК Пользователь,
	               |	CW_ИсторияУтверждениеБюджетовСрезПоследних.ПризнакУтверждения КАК Утвреждена
	               |ИЗ
	               |	РегистрСведений.CW_ИсторияУтверждениеБюджетов.СрезПоследних(
	               |			&ДатаСреза,
	               |			Объект = &ОбъектБюджета
	               |				И ВерсияБюджета = &ВерсияБюджета) КАК CW_ИсторияУтверждениеБюджетовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", 		ТекущаяДата());
	Запрос.УстановитьПараметр("ОбъектБюджета", 	ОбъектБюджета);
	Запрос.УстановитьПараметр("ВерсияБюджета", 	ВерсияБюджета);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
