
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Макет") Тогда
		ВывестиТабличныйДокументНаФорму(Параметры.Макет);
	КонецЕсли;  
	Если Параметры.Свойство("КонтактнаяИнформация") Тогда
		ДанныеКонтактнойИнформации = Новый ФиксированнаяСтруктура(Параметры.КонтактнаяИнформация);	
	КонецЕсли;
	Если Параметры.Свойство("ДанныеЗаполнения") Тогда     
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ДанныеЗаполнения);
	КонецЕсли;
	
	Если ПараметрыДокументовЭПД = Неопределено Тогда
		CW_ОбменГИСЭПДДополнительный.УстановитьПараметрыТиповДокументовЭПД(ЭтотОбъект); 
	КонецЕсли;
	
	Если ТипЗнч(ДоступныеТипыДокументовЭПД) = Тип("ФиксированныйМассив") 
		И Параметры.Ключ.Пустая() 
		и ДоступныеТипыДокументовЭПД.Количество() = 1 Тогда
		Объект.ТипДокументаЭПД = ДоступныеТипыДокументовЭПД[0];
	КонецЕсли;   
	
	Если Не Объект.ТипДокументаЭПД.Пустая() Тогда
		ТипДокументаЭПДПриИзмененииНаСервере();  
	КонецЕсли;   
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьФункцииДокумента(ИмяФункции)
	
	Область = ТабличныйДокумент.Область("ТитулГрузоотправителяФункция");
	Область.Значение = ИмяФункции;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	CW_ОбменГИСЭПДДополнительный.УстановитьПараметрыТиповДокументовЭПД(ЭтотОбъект); 
	
	ДокументЭПД = CW_ОбменГИСЭПДДополнительный.ПолучитьСвязанныйДокументЭПД(Объект.Ссылка);
	
	ИнформацияПоПрефиксамТитула = CW_ОбменГИСЭПДПереопределяемый.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	ПрефиксТитула 				= ИнформацияПоПрефиксамТитула.ВПрограмме;
	
	УстановитьДанныеОбъекта(ТекущийОбъект);
	
КонецПроцедуры  

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	CW_ОбменГИСЭПДДополнительный.ДобавитьСвязанныйДокументЭПД(Объект.Ссылка, ДокументЭПД);
	
КонецПроцедуры


&НаСервере
Процедура УстановитьДанныеОбъекта(ТекущийОбъект)
	
	ДанныеКонтактнойИнформации 		= ТекущийОбъект.ДанныеКонтактнойИнформации.Получить();
	ХранимыйДокумент 				= ТекущийОбъект.ХранилищеМакета.Получить(); 
	
	ВывестиТабличныйДокументНаФорму(ХранимыйДокумент);

КонецПроцедуры

&НаСервере
Процедура ВывестиТабличныйДокументНаФорму(ХранимыйДокумент)
	
	Если ТипЗнч(ХранимыйДокумент) = Тип("ТабличныйДокумент") Тогда
		ТабличныйДокумент = ХранимыйДокумент;
		ТабличныйДокумент.ОтображатьГруппировки = Истина;  
		ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(0);  
	КонецЕсли;
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1") Тогда 
		ОбработатьИзменнениеОбластиПоДоверенностиГрузоотправителя_ЭЗЗ_Титул1(); 
	КонецЕсли;
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2") Тогда 
		ОбработатьИзменнениеОбластиВариантПоДоверенностиЗаПеревозчика_ЭЗЗ_Титул2(); 
	КонецЕсли;  
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда 
		ОбработатьИзменнениеОбластиПоДоверенностиГрузоотправителя_ЭТрН_Титул1(); 
		ОбработатьИзменнениеОбластиТитулГрузоотправителяЭкспедитор_ЭТрН_Титул1();
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда 
		//	ОбработатьИзменнениеОбластиПоДоверенностиГрузоотправителя_ЭТрН_Титул1(); 
			УстановитьДоступностьОбластиГрузоплучатель_ЭТрН_Титул1();
		//	ОбработатьИзменнениеОбластиТитулГрузоотправителяЭкспедитор_ЭТрН_Титул1();
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Наименование = СокрЛП(Объект.ТипДокументаЭПД) + " - " + СокрЛП(Объект.ТекущийТитул);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 

	Если ЗначениеЗаполнено(ТекущийОбъект.ВидДокумента) = Ложь Тогда
		ТекущийОбъект.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ТекущийОбъект.ТипДокументаЭПД);
	КонецЕсли;
	
	ТекущийОбъект.ХранилищеМакета = Новый ХранилищеЗначения(ТабличныйДокумент, Новый СжатиеДанных(9));
	ТекущийОбъект.ДанныеКонтактнойИнформации = Новый ХранилищеЗначения(ДанныеКонтактнойИнформации, Новый СжатиеДанных(9));
	
	ЗаписатьЗначенияРеквизитовДокументаЭПД(ТекущийОбъект);
	
КонецПроцедуры   

&НаСервере
Процедура ЗаписатьЗначенияРеквизитовДокументаЭПД(ТекущийОбъект)

	ИнформацияПоПрефиксамТитула = CW_ОбменГИСЭПДПереопределяемый.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	ПрефиксТитула = ИнформацияПоПрефиксамТитула.ВПрограмме;
	
	ИмяДокумента 				= ПолучитьИмяДокументаПоТипу();
	ОбластиАдресов 				= CW_ОбменГИСЭПДСерверВызовСервера.СписокОбластейАдресов(Объект.ТекущийТитул);
	ОбластиБулево				= CW_ОбменГИСЭПДСерверВызовСервера.СписокОбластейТипБлево(Объект.ТекущийТитул);  
	ОбластиСтроковыеЗначения	= CW_ОбменГИСЭПДСерверВызовСервера.СписокОбластейСтроковыеЗначения(Объект.ТекущийТитул);  
	
	ТаблицаЗначенийРеквизитов	= CW_ОбменГИСЭПДДополнительный.ПолучитьПустуюТаблицуЗначенийРеквизитов();  
	
	Если НужноЗаписатьПараметрыТранспортногоСредства() Тогда
		ЗаписатьХранимыеДанныеПараметрыТранспортногоСредства(ТаблицаЗначенийРеквизитов, ИмяДокумента);
	КонецЕсли;
	Если НужноЗаписатьТраспортноеСредство() Тогда
		ЗаписатьХранимыеДанныеТраспортного(ТаблицаЗначенийРеквизитов, ИмяДокумента, ПрефиксТитула);
	КонецЕсли; 
	
	Если НужноЗаписатьВодителя() Тогда
		ЗаписатьХранимыеДанныеВодителя(ТаблицаЗначенийРеквизитов, ИмяДокумента, ПрефиксТитула);
	КонецЕсли;   
	Если НужноЗаписатьГруз() Тогда
		ЗаписатьХранимыеДанныеГруз(ТаблицаЗначенийРеквизитов, ИмяДокумента, ПрефиксТитула);
	КонецЕсли;   
	Если НужноЗаписатьМедработика() Тогда
		ЗаписатьХранимыеДанныеМедработика(ТаблицаЗначенийРеквизитов, ИмяДокумента, ПрефиксТитула, "ШтатныйМедработник");
		ЗаписатьХранимыеДанныеМедработика(ТаблицаЗначенийРеквизитов, ИмяДокумента, ПрефиксТитула, "СтороннийМедработник");
	КонецЕсли;

	ИменаТаблицХранимыеДанные  = Новый Массив;
	
	Для Каждого Область из ТабличныйДокумент.Области Цикл
		Если СтрНайти(Область.Имя, ПрефиксТитула) = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущийОбъект, Область.Имя) Тогда 
			ТекущийОбъект[Область.Имя] = Область.Значение;                                              
		КонецЕсли; 
		
		ИмяОбластиБезПрефикса = CW_ОбменГИСЭПДСерверВызовСервера.ИмяОбластиБезПрефикса(Область.Имя); 
		
		Если ОбластиБулево.Найти(ИмяОбластиБезПрефикса) <> Неопределено Тогда
			
			ЗначениеРеквизита 	= (Область.Значение = "V"); 
			
			ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
			ДанныеСтроки.ИмяРеквизита 			= Область.Имя;; 
			ДанныеСтроки.ЗначениеРеквизита 		= ЗначениеРеквизита;
			
			ПривОбластьИмя 	= CW_ОбменГИСЭПДДополнительный.ПривестиИмяОбласти(Область.Имя);
			ЧастиИмени 		= СтрРазделить(ПривОбластьИмя, "_"); 
			Если ЧастиИмени.Количество() = 3 Тогда    
				ДанныеСтроки.ИмяТабличнойЧасти 		= ЧастиИмени[0]; 
				ДанныеСтроки.НомерСтрокиРеквизита	= ЧастиИмени[2];  
				ДанныеСтроки.ИмяРеквизита			= CW_ОбменГИСЭПДДополнительный.ВостановитьПриведенноеИмяРеквизита(ЧастиИмени[1]); 
			КонецЕсли; 
			
			ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки);
			
		ИначеЕсли ОбластиАдресов.Найти(ИмяОбластиБезПрефикса) <> Неопределено Тогда  
			
			Если ТипЗнч(ДанныеКонтактнойИнформации) = Тип("ФиксированнаяСтруктура") 
				и ДанныеКонтактнойИнформации.Свойство(Область.Имя) Тогда
				
				ДанныеАдреса = ДанныеКонтактнойИнформации[Область.Имя];  
				Для Каждого КлючЗначение из ДанныеАдреса.СтруктураРеквизитовАдреса Цикл 
					ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
					ДанныеСтроки.ЗначениеРеквизита 		= КлючЗначение.Значение;
					
					ПривОбластьИмя 	= CW_ОбменГИСЭПДДополнительный.ПривестиИмяОбласти(КлючЗначение.Ключ);
					ЧастиИмени 		= СтрРазделить(ПривОбластьИмя, "_"); 
					Если ЧастиИмени.Количество() = 3 Тогда   
						ДанныеСтроки.ИмяТабличнойЧасти 		= ЧастиИмени[0]; 
						ДанныеСтроки.ИмяРеквизита 			= CW_ОбменГИСЭПДДополнительный.ВостановитьПриведенноеИмяРеквизита(ЧастиИмени[1]); 
						ДанныеСтроки.НомерСтрокиРеквизита	= ЧастиИмени[2]; 
					Иначе
						ДанныеСтроки.ИмяРеквизита 			= ЧастиИмени[0]; 
					КонецЕсли; 
					
					ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки);
				КонецЦикла; 
				
			КонецЕсли; 
			
		ИначеЕсли СтрНайти(Область.Имя, "ХранимыеДанныеСторонаПодписавшаяДокумент") > 0 Тогда 
			
			ПривОбластьИмя	= CW_ОбменГИСЭПДДополнительный.ПривестиИмяОбласти(Область.Имя);	
			ЧастиИмени 		= СтрРазделить(ПривОбластьИмя, "_"); 
			Если ЧастиИмени.Количество() > 2 Тогда 
				Если ИменаТаблицХранимыеДанные.Найти(ЧастиИмени[0]) = Неопределено Тогда
					ИменаТаблицХранимыеДанные.Добавить(ЧастиИмени[0]); 
				КонецЕсли;
			КонецЕсли; 
			
			ХранимыеДанные = ПолучитьХранимыеДанныеСторонаПодписавшаяДокумент(ИмяДокумента, Область);
			Если ХранимыеДанные <> Неопределено Тогда
				//Запись состава хранимых данных
				Для Каждого СтрокаДанных из ХранимыеДанные.Данные Цикл   
					ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
					ДанныеСтроки.ИмяРеквизита 			= СтрокаДанных.Имя; 
					ДанныеСтроки.ЗначениеРеквизита 		= СтрокаДанных.Значение;
					
					Если ЧастиИмени.Количество() > 2 Тогда 
						ДанныеСтроки.ИмяТабличнойЧасти 		= ЧастиИмени[0]; 
						ДанныеСтроки.НомерСтрокиРеквизита	= ЧастиИмени[2];  
					КонецЕсли; 
					
					ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки);  
				КонецЦикла; 
				//---Запись состава хранимых данных
			КонецЕсли; 
			
			//Запись хранимых данных
			ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
			ДанныеСтроки.ИмяРеквизита 			= Область.Имя; 
			ДанныеСтроки.ЗначениеРеквизита 		= ХранимыеДанные;
			
			Если ЧастиИмени.Количество() > 2 Тогда 
				ДанныеСтроки.ИмяТабличнойЧасти 		= ЧастиИмени[0]; 
				ДанныеСтроки.ИмяРеквизита			= CW_ОбменГИСЭПДДополнительный.ВостановитьПриведенноеИмяРеквизита(ЧастиИмени[1]); 
				ДанныеСтроки.НомерСтрокиРеквизита	= ЧастиИмени[2];  
			КонецЕсли; 
			
			ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки);  
			//--Запись хранимых данных
		Иначе
			
			ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
			ДанныеСтроки.ИмяРеквизита 		= Область.Имя; 
			
			Если ОбластиСтроковыеЗначения.Найти(ИмяОбластиБезПрефикса) = Неопределено Тогда 
				ДанныеСтроки.ЗначениеРеквизита	= Область.Значение;   
			Иначе
				СтроковыеЗначенияЭПД = Новый Структура;
				СтроковыеЗначенияЭПД.Вставить("Тип", 			Тип("СправочникСсылка.СтроковыеЗначенияЭПД"));
				СтроковыеЗначенияЭПД.Вставить("Наименование", 	СокрЛП(Область.Значение));
				
				ДанныеСтроки.ЗначениеРеквизита	= СтроковыеЗначенияЭПД;   
			КонецЕсли;
			
			ПривОбластьИмя 	= CW_ОбменГИСЭПДДополнительный.ПривестиИмяОбласти(Область.Имя);
			ЧастиИмени 		= СтрРазделить(ПривОбластьИмя, "_"); 
			Если ЧастиИмени.Количество() > 2  Тогда 
				ДанныеСтроки.ИмяТабличнойЧасти 		= ЧастиИмени[0]; 
				ДанныеСтроки.ИмяРеквизита			= CW_ОбменГИСЭПДДополнительный.ВостановитьПриведенноеИмяРеквизита(ЧастиИмени[1]); 
				ДанныеСтроки.НомерСтрокиРеквизита	= ЧастиИмени[2];  
			КонецЕсли; 
			
			ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки);
			
		КонецЕсли;  
		
	КонецЦикла; 
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1") Тогда 
		ОбластьГрузоотправитель = ТабличныйДокумент.Области.Найти("СсылкаТитулГрузоотправителяГрузоотправитель");
		Если ОбластьГрузоотправитель <> Неопределено Тогда
			ТекущийОбъект.Организация 	= ОбластьГрузоотправитель.Значение	
		КонецЕсли;  
		
		ОбластьВариантПоДоверенности = ТабличныйДокумент.Области.Найти("ВариантПоДоверенностиЗаГрузоотправителя"); 
		Если ОбластьВариантПоДоверенности <> Неопределено Тогда
			Если ОбластьВариантПоДоверенности.Значение = "V" Тогда
				ОбластьСоставитель = ТабличныйДокумент.Области.Найти("СсылкаТитулГрузоотправителяСоставитель");
				Если ОбластьСоставитель <> Неопределено Тогда
					ТекущийОбъект.Организация 	= ОбластьСоставитель.Значение	
				КонецЕсли;  
			КонецЕсли;                                        
		КонецЕсли;   
	КонецЕсли;
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2") Тогда 
		ОбластьВариантПоДоверенности = ТабличныйДокумент.Области.Найти("ВариантПоДоверенностиЗаПеревозчика"); 
		Если ОбластьВариантПоДоверенности <> Неопределено Тогда
			Если ОбластьВариантПоДоверенности.Значение = "V" Тогда
				ОбластьСоставитель = ТабличныйДокумент.Области.Найти("СсылкаТитулПеревозчикаСоставитель");
				Если ОбластьСоставитель <> Неопределено Тогда
					ТекущийОбъект.Организация 	= ОбластьСоставитель.Значение	
				КонецЕсли;  
			КонецЕсли;                                        
		КонецЕсли;   
	КонецЕсли;  
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда 
		ОбластьГрузоотправитель = ТабличныйДокумент.Области.Найти("СсылкаТитулГрузоотправителяГрузоотправитель");
		Если ОбластьГрузоотправитель <> Неопределено Тогда
			ТекущийОбъект.Организация 	= ОбластьГрузоотправитель.Значение	
		КонецЕсли;  
		
		ОбластьВариантПоДоверенности = ТабличныйДокумент.Области.Найти("ВариантПоДоверенности"); 
		Если ОбластьВариантПоДоверенности <> Неопределено Тогда
			Если ОбластьВариантПоДоверенности.Значение = "V" Тогда
				ОбластьСоставитель = ТабличныйДокумент.Области.Найти("СсылкаТитулГрузоотправителяСоставитель");
				Если ОбластьСоставитель <> Неопределено Тогда
					ТекущийОбъект.Организация 	= ОбластьСоставитель.Значение	
				КонецЕсли;  
			КонецЕсли;                                        
		КонецЕсли;   
	КонецЕсли;     

	УдалитьСтрокиСПустымЗначением(ТаблицаЗначенийРеквизитов);

	ТекущийОбъект.ЗначенияРеквизитовДокументовЭПД = Новый ХранилищеЗначения(ТаблицаЗначенийРеквизитов,	Новый СжатиеДанных(9));
	
КонецПроцедуры
    
&НаСервере
Процедура УдалитьПустыеХранимыеДанныеСторонаПодписавшаяДокумент(ТаблицаЗначенийРеквизитов)
	
	УдаляемыеСтроки = Новый Соответствие;
	
	ОтборХранимыеДанные = Новый Структура;
	ОтборХранимыеДанные.Вставить("Имя", "ХранимыеДанныеСторонаПодписавшаяДокумент"); 
	
	ВремТаблицаЗначенийРеквизитов = ТаблицаЗначенийРеквизитов.Скопировать(); 
	
	//Удаляем из исходной таблицы все строки по именам табличных частей
	ТабличныеЧасти = ВремТаблицаЗначенийРеквизитов.Скопировать(ОтборХранимыеДанные); 
	ТабличныеЧасти.Свернуть("ИмяТабличнойЧасти");
	Для Каждого СтрокаТаблицы из ТабличныеЧасти Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИмяТабличнойЧасти", СтрокаТаблицы.ИмяТабличнойЧасти);
		
		УдаляемыеСтроки = ТаблицаЗначенийРеквизитов.НайтиСтроки(СтруктураОтбора);
		Для Каждого УдаляемаяСтрока из УдаляемыеСтроки Цикл
			ТаблицаЗначенийРеквизитов.Удалить(УдаляемаяСтрока);	
		КонецЦикла;
	КонецЦикла;
	//---Удаляем из исходной таблицы все строки по именам табличных частей 
	
	//Подготовка таблиц по данным строк
	ПодготовленныеТаблицы = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы из ТабличныеЧасти Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИмяТабличнойЧасти", СтрокаТаблицы.ИмяТабличнойЧасти); 
		
		ТаблицаРеквизитов = ВремТаблицаЗначенийРеквизитов.Скопировать(СтруктураОтбора);
		ТаблицаРеквизитов.Свернуть("Имя");
		
		ТаблицаНомераСтрок = ВремТаблицаЗначенийРеквизитов.Скопировать(СтруктураОтбора);
		ТаблицаНомераСтрок.Свернуть("НомерСтрокиТЧ");
		
		ТаблицаЗначений = Новый ТаблицаЗначений;
		Для каждого СтрокаТаблицыРеквизитов из ТаблицаРеквизитов Цикл
			ТаблицаЗначений.Колонки.Добавить(СтрокаТаблицыРеквизитов.Имя);	
		КонецЦикла;  
		
		Для Каждого СтрокаНомеров из ТаблицаНомераСтрок Цикл    
			СтруктураОтбора.Вставить("НомерСтрокиТЧ", СтрокаНомеров.НомерСтрокиТЧ); 
			
			НоваяСтрока = ТаблицаЗначений.Добавить();
			
			НайденныеСтроки = ВремТаблицаЗначенийРеквизитов.НайтиСтроки(СтруктураОтбора);
			Для Каждого СтрокаДанных из НайденныеСтроки Цикл
				НоваяСтрока[СтрокаДанных.Имя] = СтрокаДанных.Значение;	
			КонецЦикла;
		КонецЦикла;
		
		ПодготовленныеТаблицы.Вставить(СтрокаТаблицы.ИмяТабличнойЧасти, ТаблицаЗначений);  
	КонецЦикла;  
	//---Подготовка таблиц по данным строк
	
	//Удаление пустых строк
	Для Каждого СтрокаТаблицы из ТабличныеЧасти Цикл   
		ТаблицаЗначений = ПодготовленныеТаблицы.Получить(СтрокаТаблицы.ИмяТабличнойЧасти);
		
		УдаляемыеСтроки = Новый Массив;
		Для Каждого СтрокаТаблицыЗначений из ТаблицаЗначений Цикл
			Если ТипЗнч(СтрокаТаблицыЗначений.ХранимыеДанныеСторонаПодписавшаяДокумент) <> тип("Структура") Тогда   
				УдаляемыеСтроки.Добавить(СтрокаТаблицыЗначений);	
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого УдаляемаяСтрока из УдаляемыеСтроки Цикл
			ТаблицаЗначений.Удалить(УдаляемаяСтрока);	
		КонецЦикла;
		
		ПодготовленныеТаблицы.Вставить(СтрокаТаблицы.ИмяТабличнойЧасти, ТаблицаЗначений);  
	КонецЦикла;
	//---Удаление пустых строк   
	
	//Запись данных таблиц в исходную таблицу
	Для Каждого СтрокаТаблицы из ТабличныеЧасти Цикл   
		ТаблицаЗначений = ПодготовленныеТаблицы.Получить(СтрокаТаблицы.ИмяТабличнойЧасти);
		Если ТаблицаЗначений.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;   
		
		Для Индекс=0 по ТаблицаЗначений.Количество()-1 Цикл 
			Для Каждого Колонка из ТаблицаЗначений.Колонки Цикл
				СтрокаТаблицыЗначений = ТаблицаЗначений[Индекс];
				
				НоваяСтрока = ТаблицаЗначенийРеквизитов.Добавить();
				НоваяСтрока.ИмяТабличнойЧасти 	= СтрокаТаблицы.ИмяТабличнойЧасти; 
				НоваяСтрока.Имя					= Колонка.Имя; 
				НоваяСтрока.Значение 			= СтрокаТаблицыЗначений[Колонка.Имя];
				НоваяСтрока.НомерСтрокиТЧ		= Индекс+1;  
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	//Запись данных таблиц в исходную таблицу
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиСПустымЗначением(ТаблицаЗначенийРеквизитов)
	
	УдаляемыеСтроки = Новый Соответствие;
	
	ОтборХранимыеДанные = Новый Структура;
	ОтборХранимыеДанные.Вставить("ИмяРеквизита", "ХранимыеДанныеСторонаПодписавшаяДокумент"); 
	
	ВремТаблицаЗначенийРеквизитов = ТаблицаЗначенийРеквизитов.Скопировать(); 
	
	//Удаляем из исходной таблицы все строки по именам табличных частей
	ТабличныеЧасти = ВремТаблицаЗначенийРеквизитов.Скопировать(ОтборХранимыеДанные); 
	ТабличныеЧасти.Свернуть("ИмяТабличнойЧасти");
	Для Каждого СтрокаТаблицы из ТабличныеЧасти Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИмяТабличнойЧасти", СтрокаТаблицы.ИмяТабличнойЧасти);
		
		УдаляемыеСтроки = ТаблицаЗначенийРеквизитов.НайтиСтроки(СтруктураОтбора);
		Для Каждого УдаляемаяСтрока из УдаляемыеСтроки Цикл
			ТаблицаЗначенийРеквизитов.Удалить(УдаляемаяСтрока);	
		КонецЦикла;
	КонецЦикла;
	//---Удаляем из исходной таблицы все строки по именам табличных частей 
	
	//Подготовка таблиц по данным строк
	ПодготовленныеТаблицы = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы из ТабличныеЧасти Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИмяТабличнойЧасти", СтрокаТаблицы.ИмяТабличнойЧасти); 
		
		ТаблицаРеквизитов = ВремТаблицаЗначенийРеквизитов.Скопировать(СтруктураОтбора);
		ТаблицаРеквизитов.Свернуть("ИмяРеквизита");
		
		ТаблицаНомераСтрок = ВремТаблицаЗначенийРеквизитов.Скопировать(СтруктураОтбора);
		ТаблицаНомераСтрок.Свернуть("НомерСтрокиРеквизита");
		
		ТаблицаЗначений = Новый ТаблицаЗначений;
		Для каждого СтрокаТаблицыРеквизитов из ТаблицаРеквизитов Цикл
			ТаблицаЗначений.Колонки.Добавить(СтрокаТаблицыРеквизитов.ИмяРеквизита);	
		КонецЦикла;  
		
		Для Каждого СтрокаНомеров из ТаблицаНомераСтрок Цикл    
			СтруктураОтбора.Вставить("НомерСтрокиРеквизита", СтрокаНомеров.НомерСтрокиРеквизита); 
			
			НоваяСтрока = ТаблицаЗначений.Добавить();
			
			НайденныеСтроки = ВремТаблицаЗначенийРеквизитов.НайтиСтроки(СтруктураОтбора);
			Для Каждого СтрокаДанных из НайденныеСтроки Цикл
				НоваяСтрока[СтрокаДанных.ИмяРеквизита] = СтрокаДанных.ЗначениеРеквизита;	
			КонецЦикла;
		КонецЦикла;
		
		ПодготовленныеТаблицы.Вставить(СтрокаТаблицы.ИмяТабличнойЧасти, ТаблицаЗначений);  
	КонецЦикла;  
	//---Подготовка таблиц по данным строк
	
	//Удаление пустых строк
	Для Каждого СтрокаТаблицы из ТабличныеЧасти Цикл   
		ТаблицаЗначений = ПодготовленныеТаблицы.Получить(СтрокаТаблицы.ИмяТабличнойЧасти);
		
		УдаляемыеСтроки = Новый Массив;
		Для Каждого СтрокаТаблицыЗначений из ТаблицаЗначений Цикл
			Если ТипЗнч(СтрокаТаблицыЗначений.ХранимыеДанныеСторонаПодписавшаяДокумент) <> тип("Структура") Тогда   
				УдаляемыеСтроки.Добавить(СтрокаТаблицыЗначений);	
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого УдаляемаяСтрока из УдаляемыеСтроки Цикл
			ТаблицаЗначений.Удалить(УдаляемаяСтрока);	
		КонецЦикла;
		
		ПодготовленныеТаблицы.Вставить(СтрокаТаблицы.ИмяТабличнойЧасти, ТаблицаЗначений);  
	КонецЦикла;
	//---Удаление пустых строк   
	
	//Запись данных таблиц в исходную таблицу
	Для Каждого СтрокаТаблицы из ТабличныеЧасти Цикл   
		ТаблицаЗначений = ПодготовленныеТаблицы.Получить(СтрокаТаблицы.ИмяТабличнойЧасти);
		Если ТаблицаЗначений.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;   
		
		Для Каждого Колонка из ТаблицаЗначений.Колонки Цикл
			Для Индекс=0 по ТаблицаЗначений.Количество()-1 Цикл
				СтрокаТаблицыЗначений = ТаблицаЗначений[Индекс];
				
				ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
				ДанныеСтроки.ИмяТабличнойЧасти 		= СтрокаТаблицы.ИмяТабличнойЧасти; 
				ДанныеСтроки.НомерСтрокиРеквизита	= Индекс+1;  
				ДанныеСтроки.ИмяРеквизита			= Колонка.Имя; 
				ДанныеСтроки.ЗначениеРеквизита 		= СтрокаТаблицыЗначений[Колонка.Имя];
				
				ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки);  
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	//Запись данных таблиц в исходную таблицу
	
КонецПроцедуры

&НаСервере
Функция НужноЗаписатьПараметрыТранспортногоСредства()  
	
	МассивТитулов = Новый Массив;
	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1"));

	Возврат МассивТитулов.Найти(Объект.ТекущийТитул) <> Неопределено;
	
КонецФункции 

&НаСервере
Функция НужноЗаписатьВодителя()  
	
	МассивТитулов = Новый Массив;
	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2"));
	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1"));
 	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1"));
 	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_1"));

	Возврат МассивТитулов.Найти(Объект.ТекущийТитул) <> Неопределено;
	
КонецФункции  

&НаСервере
Функция НужноЗаписатьТраспортноеСредство()  
	
	МассивТитулов = Новый Массив;
	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2"));
	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1"));
 	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1"));
 	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_1"));

	Возврат МассивТитулов.Найти(Объект.ТекущийТитул) <> Неопределено;
	
КонецФункции 

&НаСервере
Функция НужноЗаписатьГруз()  
	
	МассивТитулов = Новый Массив;
	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1"));
  	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_1"));

	Возврат МассивТитулов.Найти(Объект.ТекущийТитул) <> Неопределено;
	
КонецФункции 


&НаСервере
Функция НужноЗаписатьМедработика() 
	
	МассивТитулов = Новый Массив;
 	МассивТитулов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул2"));

	Возврат МассивТитулов.Найти(Объект.ТекущийТитул) <> Неопределено;
	
КонецФункции 

&НаСервере
Функция ПолучитьХранимыеДанныеСторонаПодписавшаяДокумент(ИмяДокумента, Область)
	
	Если Не ЗначениеЗаполнено(Область.Значение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыСтороныПодписавшейДокумент = ПараметрыСтороныПодписавшейДокумент(); 
	ЗначенияРеквизитов 		= ПараметрыСтороныПодписавшейДокумент["ЗначенияРеквизитов"];
	ПредставленияРеквизитов = ПараметрыСтороныПодписавшейДокумент["ПредставленияРеквизитов"];
	
	ИННКонтрагента =  ПолучитьИНН(Область.Значение); 
	Если СтрДлина(ИННКонтрагента) = 12 Тогда
		ЗначенияРеквизитов.ФЛ_ИНН = ИННКонтрагента;
		ЗначенияРеквизитов.ЮЛ_ИНН  = "";
	ИначеЕсли СтрДлина(ИННКонтрагента) <= 10 Тогда
		ЗначенияРеквизитов.ФЛ_ИНН = "";
		ЗначенияРеквизитов.ЮЛ_ИНН = ИННКонтрагента;	
	КонецЕсли;   
	
	//Запись хранимых данных
	ХранимыеДанные = СтруктураХранимыхДанных();
	ХранимыеДанные.ГруппаДанных = "СторонаПодписавшаяДокумент";
	ХранимыеДанные.Тип 			= "СторонаПодписавшаяДокумент";
	ХранимыеДанные.ИмяОбъекта 	= "Документ."+ИмяДокумента;
	
	Для Каждого КлючЗначение из ЗначенияРеквизитов Цикл
		СтрокаДанных = ХранимыеДанные.Данные.Добавить();    
		СтрокаДанных.Имя			= КлючЗначение.Ключ;
		СтрокаДанных.Представление 	= ПредставленияРеквизитов.Получить(КлючЗначение.Ключ);
		СтрокаДанных.Значение 		= КлючЗначение.Значение;
	КонецЦикла; 
	
	Возврат ХранимыеДанные;

КонецФункции

&НаСервере
Функция ПараметрыСтороныПодписавшейДокумент()
	
	ЗначенияРеквизитов = Новый Структура;
	ЗначенияРеквизитов.Вставить("ИнострЛицоБезУчетаВидУдостоверения");
	ЗначенияРеквизитов.Вставить("ИнострЛицоБезУчетаДатаВыдачиУдостоверения");
	ЗначенияРеквизитов.Вставить("ИнострЛицоБезУчетаИдентификатор");
	ЗначенияРеквизитов.Вставить("ИнострЛицоБезУчетаИныеСведения");
	ЗначенияРеквизитов.Вставить("ИнострЛицоБезУчетаНаименование");
	ЗначенияРеквизитов.Вставить("ИнострЛицоБезУчетаНомерУдостоверения");
	ЗначенияРеквизитов.Вставить("ИнострЛицоБезУчетаСтатусИО_ИГ");
	ЗначенияРеквизитов.Вставить("ИнострЛицоБезУчетаСтрана");
	ЗначенияРеквизитов.Вставить("НадписьПоясненияНекорректногоИНН");
	ЗначенияРеквизитов.Вставить("ОрганВластиВыдавшийДокумент");
	ЗначенияРеквизитов.Вставить("РФИлиНет");
	ЗначенияРеквизитов.Вставить("ФЛ_ИНН");
	ЗначенияРеквизитов.Вставить("ЮЛ_ИНН	");   
	
	//Сторона подписавшая документ  
	ПредставленияРеквизитов = Новый Соответствие;
	ПредставленияРеквизитов.Вставить("РФИлиНет",									"РФИли нет");
	ПредставленияРеквизитов.Вставить("НадписьПоясненияНекорректногоИНН",			"");
	ПредставленияРеквизитов.Вставить("ОрганВластиВыдавшийДокумент",					"Наименование госоргана");
	ПредставленияРеквизитов.Вставить("ИнострЛицоБезУчетаСтатусИО_ИГ",				"Идентификация статуса");
	ПредставленияРеквизитов.Вставить("ИнострЛицоБезУчетаСтрана",					"Страна");
	ПредставленияРеквизитов.Вставить("ИнострЛицоБезУчетаНаименование",				"Наименование (ФИО)");
	ПредставленияРеквизитов.Вставить("ИнострЛицоБезУчетаИдентификатор",				"Идентификатор иностранной лица");
	ПредставленияРеквизитов.Вставить("ИнострЛицоБезУчетаВидУдостоверения",			"Вид документа");
	ПредставленияРеквизитов.Вставить("ИнострЛицоБезУчетаНомерУдостоверения",		"Номер документа");
	ПредставленияРеквизитов.Вставить("ИнострЛицоБезУчетаДатаВыдачиУдостоверения",	"Дата выдачи документа");
	ПредставленияРеквизитов.Вставить("ИнострЛицоБезУчетаИныеСведения",				"Иные сведения");
	ПредставленияРеквизитов.Вставить("ЮЛ_ИНН",	"ИНН организации, состоящей на учете в налоговом органе");
	ПредставленияРеквизитов.Вставить("ФЛ_ИНН",	"ИНН физического лица, в том числе индивидуального предпринимателя");
	
	Структура = Новый Структура;
	Структура.Вставить("ЗначенияРеквизитов",	 	ЗначенияРеквизитов);
	Структура.Вставить("ПредставленияРеквизитов", 	ПредставленияРеквизитов);

	Возврат Структура;

КонецФункции

&НаСервере
Функция ПустаяСтруктураДанныхСтроки()
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("ИмяТабличнойЧасти", 		"");
	ДанныеСтроки.Вставить("НомерСтрокиРеквизита", 	0);
	ДанныеСтроки.Вставить("ИмяРеквизита", 			"");
	ДанныеСтроки.Вставить("ЗначениеРеквизита", 		Неопределено);
	
	Возврат ДанныеСтроки;

КонецФункции

&НаСервере
Процедура ЗаписатьЗначениеОбластиВТаблицу(Таблица, ДанныеСтроки)
	
	НоваяСтрока = Таблица.Добавить(); 
	НоваяСтрока.Титул 					= Объект.ТекущийТитул;
	НоваяСтрока.ИмяТабличнойЧасти 		= ДанныеСтроки.ИмяТабличнойЧасти; 
	НоваяСтрока.НомерСтрокиРеквизита	= ДанныеСтроки.НомерСтрокиРеквизита;  
	НоваяСтрока.ИмяРеквизита 			= ДанныеСтроки.ИмяРеквизита; 
	НоваяСтрока.ЗначениеРеквизита 		= ДанныеСтроки.ЗначениеРеквизита;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьХранимыеДанныеПараметрыТранспортногоСредства(ТаблицаЗначенийРеквизитов, ИмяДокумента)

	ОбластиХранимыхДанных = Новый Массив;
	ОбластиХранимыхДанных.Добавить("ТитулГрузоотправителяПараметрыТранспортногоСредстваТип"); 
	ОбластиХранимыхДанных.Добавить("ТитулГрузоотправителяПараметрыТранспортногоСредстваГрузоподъемность"); 
	ОбластиХранимыхДанных.Добавить("ТитулГрузоотправителяПараметрыТранспортногоСредстваВместимость");
	ОбластиХранимыхДанных.Добавить("ТитулГрузоотправителяПараметрыТранспортногоСредстваТипПогрузки");
	ОбластиХранимыхДанных.Добавить("ТитулГрузоотправителяПараметрыТранспортногоСредстваТипКузова");
	ОбластиХранимыхДанных.Добавить("ТитулГрузоотправителяПараметрыТранспортногоСредстваИныеПараметры");
	
	ПредставленияРеквизитов = Новый Соответствие; 
	ПредставленияРеквизитов.Вставить("Тип",					"Тип");    
	ПредставленияРеквизитов.Вставить("ТипПогрузки",			"Тип погрузки");
	ПредставленияРеквизитов.Вставить("Вместимость",			"Вместимость, м3");
	ПредставленияРеквизитов.Вставить("ТипКузова",			"Тип кузова");
	ПредставленияРеквизитов.Вставить("Грузоподъемность",	"Грузоподъемность, т");
	ПредставленияРеквизитов.Вставить("ИныеПараметры",		"Другие необходимые параметры");
	
	ХранимыеДанные = СтруктураХранимыхДанных();
	ХранимыеДанные.ГруппаДанных = "ТитулГрузоотправителяПараметрыТранспортногоСредства"; 
	ХранимыеДанные.Тип 			= "ПараметрыТранспортногоСредства"; 
	ХранимыеДанные.ИмяОбъекта 	= "Документ."+ИмяДокумента; 
	
	Для Каждого ИмяОбласти из ОбластиХранимыхДанных Цикл
		Область = ТабличныйДокумент.Области.Найти(ИмяОбласти);
		Если Область = Неопределено Тогда 
			Продолжить;
		КонецЕсли; 
		
		ИмяРеквизита = СтрЗаменить(ИмяОбласти, "ТитулГрузоотправителяПараметрыТранспортногоСредства", ""); 
		
		НоваяСтрока = ХранимыеДанные.Данные.Добавить();
		НоваяСтрока.Имя 			= ИмяРеквизита;
		НоваяСтрока.Представление 	= ПредставленияРеквизитов.Получить(ИмяРеквизита);
		НоваяСтрока.Значение 		= Область.Значение;
	КонецЦикла;   
	
	УдалитьПустыеХранимыеДанныеСторонаПодписавшаяДокумент(ХранимыеДанные.Данные);
	
	Если ХранимыеДанные.Данные.Количество() > 0 Тогда
		ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
		ДанныеСтроки.ИмяРеквизита 			= "ХранимыеДанныеТитулГрузоотправителяПараметрыТранспортногоСредства"; 
		ДанныеСтроки.ЗначениеРеквизита 		= ХранимыеДанные;
		
		ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьХранимыеДанныеВодителя(ТаблицаЗначенийРеквизитов, ИмяДокумента, ПрефиксТитула)
	
	ПредставленияРеквизитов = Новый Соответствие; 
	ПредставленияРеквизитов.Вставить("Фамилия",		"Фамилия");    
	ПредставленияРеквизитов.Вставить("Имя",			"Имя");
	ПредставленияРеквизитов.Вставить("Отчество",	"Отчество");
	ПредставленияРеквизитов.Вставить("ФЛ_ИНН",		"ИНН");
	ПредставленияРеквизитов.Вставить("НомерВУ",		"Номер ВУ");
	ПредставленияРеквизитов.Вставить("СерияВУ",		"Серия ВУ");
	ПредставленияРеквизитов.Вставить("ДатаВыдачиВУ","Дата выдачи ВУ");
	ПредставленияРеквизитов.Вставить("Телефон",		"Телефон");

	ХранимыеДанные = СтруктураХранимыхДанных();
	ХранимыеДанные.ГруппаДанных = "Водитель"; 
	ХранимыеДанные.Тип 			= "Водитель"; 
	ХранимыеДанные.ИмяОбъекта 	= "Документ."+ИмяДокумента; 
	
	ИменаОбластейРеквизитов = ПолучимтьИменаОбластейРеквизитовВодителя();
	Для Каждого ИмяОбласти из ИменаОбластейРеквизитов Цикл
		Область = ТабличныйДокумент.Области.Найти(ПрефиксТитула+ИмяОбласти);
		Если Область = Неопределено Тогда 
			Продолжить;
		КонецЕсли; 
		
		ПривОбластьИмя 	= CW_ОбменГИСЭПДДополнительный.ПривестиИмяОбласти(Область.Имя);
		ЧастиИмени 		= СтрРазделить(ПривОбластьИмя, "_");
		ИмяРеквизита 	= CW_ОбменГИСЭПДДополнительный.ВостановитьПриведенноеИмяРеквизита(ЧастиИмени[1]);	
		
		НоваяСтрока = ХранимыеДанные.Данные.Добавить();
		НоваяСтрока.Имя 			= ИмяРеквизита;
		НоваяСтрока.Представление 	= ПредставленияРеквизитов.Получить(ИмяРеквизита);
		НоваяСтрока.Значение 		= Область.Значение;
	КонецЦикла;   
	
	//Табличные части
	ИменаОбластейТабличныхЧастей = ПолучитьИменаОбластейТабличныхЧастейВодителей();
	Для Каждого ИмяОбласти из ИменаОбластейТабличныхЧастей Цикл
		Область = ТабличныйДокумент.Области.Найти(ПрефиксТитула+ИмяОбласти);
		Если Область = Неопределено Тогда 
			Продолжить;
		КонецЕсли; 
		
		НоваяСтрока = ХранимыеДанные.Данные.Добавить();
		НоваяСтрока.Имя 			= "Телефон";
		НоваяСтрока.Представление 	= ПредставленияРеквизитов.Получить("Телефон");
		НоваяСтрока.Значение 		= Область.Значение;
		
		НоваяСтрока.ИмяТабличнойЧасти 	= "ВодительНомераТелефонов";
		НоваяСтрока.НомерСтрокиТЧ 		= 1;
		
	КонецЦикла;   
	//---Табличные части
	
	УдалитьПустыеХранимыеДанныеСторонаПодписавшаяДокумент(ХранимыеДанные.Данные);
	
	Если ХранимыеДанные.Данные.Количество() > 0 Тогда
		ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
		ДанныеСтроки.ИмяТабличнойЧасти		= ПрефиксТитула+"Водители";
		ДанныеСтроки.ИмяРеквизита			= "ХранимыеДанныеВодитель"; 
		ДанныеСтроки.ЗначениеРеквизита		= ХранимыеДанные;
		ДанныеСтроки.НомерСтрокиРеквизита	= 1;
		
		ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИменаОбластейТабличныхЧастейВодителей()

	ОбластиХранимыхДанных = Новый Массив;

	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда 
	ОбластиХранимыхДанных.Добавить("ВодительНомераТелефонов_Телефон_1");
    КонецЕсли;
	
	Возврат ОбластиХранимыхДанных;

КонецФункции

&НаСервере
Функция ПолучимтьИменаОбластейРеквизитовВодителя()
	
	ОбластиХранимыхДанных = Новый Массив;
	ОбластиХранимыхДанных.Добавить("Водители_Фамилия_1"); 
	ОбластиХранимыхДанных.Добавить("Водители_Имя_1"); 
	ОбластиХранимыхДанных.Добавить("Водители_Отчество_1");
	ОбластиХранимыхДанных.Добавить("Водители_ФЛ_ИНН_1");
	ОбластиХранимыхДанных.Добавить("Водители_НомерВУ_1");
	ОбластиХранимыхДанных.Добавить("Водители_СерияВУ_1");
	ОбластиХранимыхДанных.Добавить("Водители_ДатаВыдачиВУ_1"); 
	
	Возврат ОбластиХранимыхДанных;

КонецФункции

&НаСервере
Процедура ЗаписатьХранимыеДанныеТраспортного(ТаблицаЗначенийРеквизитов, ИмяДокумента, ПрефиксТитула)
	
	ПредставленияРеквизитов = ПолучитьСоответствиеПредставленийРеквизитовТранспортногоСредства();

	ХранимыеДанные = СтруктураХранимыхДанных();
	ХранимыеДанные.ГруппаДанных = ПрефиксТитула +"ТранспортноеСредство"; 
	ХранимыеДанные.Тип 			= "ТранспортноеСредство"; 
	ХранимыеДанные.ИмяОбъекта 	= "Документ."+ИмяДокумента; 
	
	ОбластиРеквизитыТС = ПолучитьИменаОбластейРеквизитовТранспортногоСредства();
	Для Каждого ИмяОбласти из ОбластиРеквизитыТС Цикл
		Область = ТабличныйДокумент.Области.Найти(ПрефиксТитула+ИмяОбласти);
		Если Область = Неопределено Тогда 
			Продолжить;
		КонецЕсли; 
		ИмяРеквизита = СтрЗаменить(ИмяОбласти, "ТранспортноеСредство", "");
		
		НоваяСтрока = ХранимыеДанные.Данные.Добавить();
		НоваяСтрока.Имя 			= ИмяРеквизита;
		НоваяСтрока.Представление 	= ПредставленияРеквизитов.Получить(ИмяРеквизита);
		НоваяСтрока.Значение 		= Область.Значение;
	КонецЦикла; 
	
	ОбластиТабличныеЧасти = ПолучитьИменаОбластейТабличныхЧастейТраспортногоСредства();
	Для Каждого ИмяОбласти из ОбластиТабличныеЧасти Цикл
		Область = ТабличныйДокумент.Области.Найти(ПрефиксТитула+ИмяОбласти);
		Если Область = Неопределено Тогда 
			Продолжить;
		КонецЕсли;   
		
		ЗначениеОбласти = Область.Значение; 
		
		Если СтрНайти(ИмяОбласти, "ХранимыеДанныеСторонаПодписавшаяДокумент") > 0 Тогда 
			ЗначениеОбласти = ПолучитьХранимыеДанныеСторонаПодписавшаяДокумент(ИмяДокумента, Область); 
		КонецЕсли;   
		
		ЧастиИмени 			= СтрРазделить(ИмяОбласти, "_");
		ИмяРеквизита 		= ЧастиИмени[1];
		ИмяТабличнойЧасти 	= ЧастиИмени[0];
		НомерСтрокиТЧ 		= Число(ЧастиИмени[2]);
	
		НоваяСтрока = ХранимыеДанные.Данные.Добавить();
		НоваяСтрока.Имя 				= ИмяРеквизита;
		НоваяСтрока.Представление 		= ПредставленияРеквизитов.Получить(ИмяРеквизита);
		НоваяСтрока.Значение 			= ЗначениеОбласти; 
		НоваяСтрока.ИмяТабличнойЧасти 	= ИмяТабличнойЧасти;
		НоваяСтрока.НомерСтрокиТЧ 		= НомерСтрокиТЧ;  
		
	КонецЦикла;
	
	УдалитьПустыеХранимыеДанныеСторонаПодписавшаяДокумент(ХранимыеДанные.Данные);
	
	ХранимыеДанныеПрицепа = ПолучитьХранимыеДанныеПрицепа(ТаблицаЗначенийРеквизитов, ИмяДокумента, ПрефиксТитула);
	Если ХранимыеДанныеПрицепа.Данные.Количество() > 0 Тогда
		ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
		ДанныеСтроки.ИмяТабличнойЧасти		= ПрефиксТитула + "Прицепы";
		ДанныеСтроки.ИмяРеквизита			= "ХранимыеДанныеПрицеп"; 
		ДанныеСтроки.ЗначениеРеквизита		= ХранимыеДанныеПрицепа;
		ДанныеСтроки.НомерСтрокиРеквизита	= 1;
		
		ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки); 
		
		Для Каждого Строкатаблицы из ХранимыеДанныеПрицепа.Данные Цикл
			НоваяСтрока = ХранимыеДанные.Данные.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строкатаблицы);  
			Если ПустаяСтрока(НоваяСтрока.ИмяТабличнойЧасти) Тогда
				НоваяСтрока.ИмяТабличнойЧасти = "Прицепы";
			КонецЕсли;
			НоваяСтрока.НомерСтрокиТЧ 		= 1;  
		КонецЦикла;
		
		НоваяСтрока = ХранимыеДанные.Данные.Добавить();
		НоваяСтрока.Имя 				= "ХранимыеДанныеПрицеп";
		НоваяСтрока.Представление 		= "";
		НоваяСтрока.Значение 			= ХранимыеДанныеПрицепа; 
		НоваяСтрока.ИмяТабличнойЧасти 	= "Прицепы";
		НоваяСтрока.НомерСтрокиТЧ 		= 1;  
		
	КонецЕсли;
	
	Если ХранимыеДанные.Данные.Количество() > 0 Тогда
		ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
		ДанныеСтроки.ИмяРеквизита 			= "ХранимыеДанные"+ПрефиксТитула+"ТранспортноеСредство"; 
		ДанныеСтроки.ЗначениеРеквизита 		= ХранимыеДанные;
		
		ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИменаОбластейТабличныхЧастейТраспортногоСредства()
	
	ОбластиТабличныеЧасти = Новый Массив;    
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда 
		ОбластиТабличныеЧасти.Добавить("ОснованияВладенияТС_ИдентификаторСтроки_1");
		ОбластиТабличныеЧасти.Добавить("ОснованияВладенияТС_НаименованиеДокумента_1");
		ОбластиТабличныеЧасти.Добавить("ОснованияВладенияТС_НомерДокумента_1");
		ОбластиТабличныеЧасти.Добавить("ОснованияВладенияТС_ДатаДокумента_1");
		ОбластиТабличныеЧасти.Добавить("ОснованияВладенияТС_ДополнительныеСведения_1");
		
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияТСРеквизитыСторон_ХранимыеДанныеСторонаПодписавшаяДокумент_1");
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтроки_1");
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтрокиРодителя_1");
		
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтроки_2");
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтрокиРодителя_2");
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияТСРеквизитыСторон_ХранимыеДанныеСторонаПодписавшаяДокумент_2");
		
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтроки_3");
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтрокиРодителя_3");
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияТСРеквизитыСторон_ХранимыеДанныеСторонаПодписавшаяДокумент_3"); 
		
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_ИдентификаторСтроки_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешенияНомер_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешенияДата_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешенияСрокДействия_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешенияВид_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешенияОрганВласти_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_МаршрутДвижения_1");
		
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешениеНомер_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешениеДата_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешениеСрокДействия_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешениеВид_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешениеОрганВласти_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешениеМаршрутТекст_1");
		ОбластиТабличныеЧасти.Добавить("СпециальныеУсловияДвижения_СпециальноеРазрешениеМаршрутМашиночитаемый_1");
	КонецЕсли;
	
	Возврат ОбластиТабличныеЧасти;

КонецФункции

&НаСервере
Функция ПолучитьИменаОбластейРеквизитовТранспортногоСредства()

	ОбластиРеквизиты = Новый Массив;
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда 
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоРегистрационныйНомер");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоТип");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоМарка");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоГрузоподъемность");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоВместимость");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоТипВладения");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоVIN");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоНомерСТС");   
	КонецЕсли;

	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1") Тогда 
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоТип");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоМарка");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоМодель");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоРегистрационныйНомер");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоИнвентарныйНомер");
	КонецЕсли;	  
	
	Возврат ОбластиРеквизиты;

КонецФункции

&НаСервере
Функция ПолучитьСоответствиеПредставленийРеквизитовТранспортногоСредства()
	
	ПредставленияРеквизитов = Новый Соответствие; 
	ПредставленияРеквизитов.Вставить("РегистрационныйНомер",	"Регистрационный номер");    
	ПредставленияРеквизитов.Вставить("ИнвентарныйНомер",		"Инвентарный номер");    
	ПредставленияРеквизитов.Вставить("Тип",						"Тип");
	ПредставленияРеквизитов.Вставить("Марка",					"Марка");
	ПредставленияРеквизитов.Вставить("Модель",					"Модель");
	ПредставленияРеквизитов.Вставить("Грузоподъемность",		"Грузоподъемность, т");
	ПредставленияРеквизитов.Вставить("Вместимость",				"Вместимость, м3");
	ПредставленияРеквизитов.Вставить("ТипВладения",				"Тип владения");
	ПредставленияРеквизитов.Вставить("VIN",						"VIN");
	ПредставленияРеквизитов.Вставить("НомерСТС",				"Номер СТС");
	
	ПредставленияРеквизитов.Вставить("НаименованиеДокумента",	"Наименование документа");
	ПредставленияРеквизитов.Вставить("НомерДокумента",			"Номер документа");
	ПредставленияРеквизитов.Вставить("ДатаДокумента",			"Дата документа");
	ПредставленияРеквизитов.Вставить("ДополнительныеСведения",	"Дополнительные сведения");
	
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешениеНомер",					"Номер");
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешениеДата",					"Дата");
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешениеСрокДействия",			"Срок действия");
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешениеВид",					"Вид");
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешениеОрганВласти",			"Орган власти");
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешениеМаршрутТекст",			"Маршрут (текст)");
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешениеМаршрутМашиночитаемый",	"Маршрут (машиночитаемый)");
	
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешенияНомер",					"Номер");
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешенияДата",					"Дата");
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешенияСрокДействия",			"Срок действия");
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешенияВид",					"Вид");
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешенияОрганВласти",			"Орган власти");
	ПредставленияРеквизитов.Вставить("СпециальноеРазрешенияМаршрутДвижения",		"Маршрут (текст)");
	
	Возврат ПредставленияРеквизитов;

КонецФункции

&НаСервере
Функция ПолучитьХранимыеДанныеПрицепа(ТаблицаЗначенийРеквизитов, ИмяДокумента, ПрефиксТитула)
	
	ПредставленияРеквизитов = ПолучитьПредставленияРеквизитовПрицепа();

	ХранимыеДанные = СтруктураХранимыхДанных();
	ХранимыеДанные.ГруппаДанных = "Прицеп"; 
	ХранимыеДанные.Тип 			= "Прицеп"; 
	ХранимыеДанные.ИмяОбъекта 	= "Документ."+ИмяДокумента; 
	
	ОбластиРеквизиты = ПолучитьИменаОбластейРеквизитовПрицепа();
	Для Каждого ИмяОбласти из ОбластиРеквизиты Цикл
		Область = ТабличныйДокумент.Области.Найти(ПрефиксТитула+ИмяОбласти);
		Если Область = Неопределено Тогда 
			Продолжить;
		КонецЕсли; 
		
		ЧастиИмени		= СтрРазделить(ИмяОбласти, "_");
		ИмяРеквизита 	= ЧастиИмени[1];
		
		НоваяСтрока = ХранимыеДанные.Данные.Добавить();
		НоваяСтрока.Имя 			= ИмяРеквизита;
		НоваяСтрока.Представление 	= ПредставленияРеквизитов.Получить(ИмяРеквизита);
		НоваяСтрока.Значение 		= Область.Значение;
	КонецЦикла;
	
	ОбластиТабличныеЧасти = ПолучитьИменаОбластейТабличныхЧастейПрицепа();
	Для Каждого ИмяОбласти из ОбластиТабличныеЧасти Цикл
		Область = ТабличныйДокумент.Области.Найти(ПрефиксТитула+ИмяОбласти);
		Если Область = Неопределено Тогда 
			Продолжить;
		КонецЕсли;   
		
		ЗначениеОбласти = Область.Значение; 
		
		Если СтрНайти(ИмяОбласти, "ХранимыеДанныеСторонаПодписавшаяДокумент") > 0 Тогда 
			ЗначениеОбласти = ПолучитьХранимыеДанныеСторонаПодписавшаяДокумент(ИмяДокумента, Область);
		КонецЕсли;   
		
		ЧастиИмени 			= СтрРазделить(ИмяОбласти, "_");
		ИмяРеквизита 		= ЧастиИмени[1];
		ИмяТабличнойЧасти 	= ЧастиИмени[0];
		НомерСтрокиТЧ 		= Число(ЧастиИмени[2]);
	
		НоваяСтрока = ХранимыеДанные.Данные.Добавить();
		НоваяСтрока.Имя 				= ИмяРеквизита;
		НоваяСтрока.Представление 		= ПредставленияРеквизитов.Получить(ИмяРеквизита);
		НоваяСтрока.Значение 			= ЗначениеОбласти; 
		НоваяСтрока.ИмяТабличнойЧасти 	= ИмяТабличнойЧасти;
		НоваяСтрока.НомерСтрокиТЧ 		= НомерСтрокиТЧ;  
		
	КонецЦикла;

	УдалитьПустыеХранимыеДанныеСторонаПодписавшаяДокумент(ХранимыеДанные.Данные);
	
	Возврат ХранимыеДанные;
	
КонецФункции

&НаСервере
Функция ПолучитьИменаОбластейТабличныхЧастейПрицепа()
	
	ОбластиТабличныеЧасти = Новый Массив;
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда 
		ОбластиТабличныеЧасти.Добавить("ОснованияВладенияПрицепом_ИдентификаторСтроки_1"); 
		ОбластиТабличныеЧасти.Добавить("ОснованияВладенияПрицепом_НаименованиеДокумента_1");
		ОбластиТабличныеЧасти.Добавить("ОснованияВладенияПрицепом_НомерДокумента_1");
		ОбластиТабличныеЧасти.Добавить("ОснованияВладенияПрицепом_ДатаДокумента_1");
		ОбластиТабличныеЧасти.Добавить("ОснованияВладенияПрицепом_ДополнительныеСведения_1");  
		
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияПрицепомРеквизитыСторон_ИдентификаторСтроки_1");    
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияПрицепомРеквизитыСторон_ИдентификаторСтрокиРодителя_1");    
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияПрицепомРеквизитыСторон_ХранимыеДанныеСторонаПодписавшаяДокумент_1"); 
		
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияПрицепомРеквизитыСторон_ИдентификаторСтроки_2");    
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияПрицепомРеквизитыСторон_ИдентификаторСтрокиРодителя_2");    
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияПрицепомРеквизитыСторон_ХранимыеДанныеСторонаПодписавшаяДокумент_2"); 
		
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияПрицепомРеквизитыСторон_ИдентификаторСтроки_3");    
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияПрицепомРеквизитыСторон_ИдентификаторСтрокиРодителя_3");    
		ОбластиТабличныеЧасти.Добавить("ОснованиеВладенияПрицепомРеквизитыСторон_ХранимыеДанныеСторонаПодписавшаяДокумент_3");
	КонецЕсли; 
	
	Возврат ОбластиТабличныеЧасти;
	
КонецФункции

&НаСервере
Функция ПолучитьИменаОбластейРеквизитовПрицепа()

	ОбластиРеквизиты = Новый Массив;
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда 
		ОбластиРеквизиты.Добавить("Прицепы_ИдентификаторСтроки_1");
		ОбластиРеквизиты.Добавить("Прицепы_РегистрационныйНомер_1");
		ОбластиРеквизиты.Добавить("Прицепы_Тип_1");
		ОбластиРеквизиты.Добавить("Прицепы_Марка_1");
		ОбластиРеквизиты.Добавить("Прицепы_Грузоподъемность_1");
		ОбластиРеквизиты.Добавить("Прицепы_Вместимость_1");
		ОбластиРеквизиты.Добавить("Прицепы_ТипВладения_1");
		ОбластиРеквизиты.Добавить("Прицепы_НомерСТС_1");
		ОбластиРеквизиты.Добавить("Прицепы_VIN_1");    
	КонецЕсли;
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1") Тогда 
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоПрицепы_ТитулОформлениеТранспортноеСредствоРегистрационныйНомер_1");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоПрицепы_ТитулОформлениеТранспортноеСредствоМарка_1");
		ОбластиРеквизиты.Добавить("ТранспортноеСредствоПрицепы_ТитулОформлениеТранспортноеСредствоМодель_1");
	КонецЕсли;	  

	Возврат ОбластиРеквизиты;

КонецФункции

&НаСервере
Функция ПолучитьПредставленияРеквизитовПрицепа()
	
	ПредставленияРеквизитов = Новый Соответствие; 
	ПредставленияРеквизитов.Вставить("РегистрационныйНомер",	"Регистрационный номер");    
	ПредставленияРеквизитов.Вставить("Тип",						"Тип");
	ПредставленияРеквизитов.Вставить("Марка",					"Марка");
	ПредставленияРеквизитов.Вставить("Модель",					"Модель");
	ПредставленияРеквизитов.Вставить("Грузоподъемность",		"Грузоподъемность, т");
	ПредставленияРеквизитов.Вставить("Вместимость",				"Вместимость, м3");
	ПредставленияРеквизитов.Вставить("ТипВладения",				"Тип владения");
	ПредставленияРеквизитов.Вставить("VIN",						"VIN");
	ПредставленияРеквизитов.Вставить("НомерСТС",				"Номер СТС");
	
	ПредставленияРеквизитов.Вставить("НаименованиеДокумента",	"Наименование документа");
	ПредставленияРеквизитов.Вставить("НомерДокумента",			"Номер документа");
	ПредставленияРеквизитов.Вставить("ДатаДокумента",			"Дата документа");
	ПредставленияРеквизитов.Вставить("ДополнительныеСведения",	"Дополнительные сведения");   
	
	Возврат ПредставленияРеквизитов;

КонецФункции

&НаСервере
Процедура ЗаписатьХранимыеДанныеГруз(ТаблицаЗначенийРеквизитов, ИмяДокумента, ПрефиксТитула)
	
	ПредставленияРеквизитов = Новый Соответствие; 
	ПредставленияРеквизитов.Вставить("ОтгрузочноеНаименованиеГруза",	"Наименование груза");    
	ПредставленияРеквизитов.Вставить("ВидТары",							"Вид тары");
	ПредставленияРеквизитов.Вставить("СпособУпаковки",					"Способ упаковки");
	ПредставленияРеквизитов.Вставить("КодТоварнойНоменклатуры",			"Код товарной номенклатуры");
	ПредставленияРеквизитов.Вставить("Плотность",						"Плотность");
	
	ТаблицаХранимыхДанных	= Новый ТаблицаЗначений;
	ТаблицаХранимыхДанных.Колонки.Добавить("ИмяТабличнойЧасти");
	ТаблицаХранимыхДанных.Колонки.Добавить("ИмяРеквизита");
	ТаблицаХранимыхДанных.Колонки.Добавить("НомерСтроки");
	ТаблицаХранимыхДанных.Колонки.Добавить("Значение");
	
	Для Каждого Область из ТабличныйДокумент.Области Цикл
		Если СтрНачинаетсяС(Область.Имя, ПрефиксТитула+"Грузы")
			ИЛИ СтрНачинаетсяС(Область.Имя, ПрефиксТитула+"ОписаниеГруза") Тогда  
			
			ЧастиИмени = СтрРазделить(Область.Имя, "_");  
			
			ПредставлениеРеквизита = ПредставленияРеквизитов.Получить(ЧастиИмени[1]);   
			Если ПредставлениеРеквизита = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаХранимыхДанных.Добавить();
			НоваяСтрока.ИмяТабличнойЧасти 	= ЧастиИмени[0];
			НоваяСтрока.ИмяРеквизита 		= ЧастиИмени[1];
			НоваяСтрока.НомерСтроки 		= ЧастиИмени[2];  
			НоваяСтрока.Значение 			= Область.Значение;   
			
		КонецЕсли;
	КонецЦикла;  
	
	ТаблицаНомераСтрок = ТаблицаХранимыхДанных.Скопировать();
	ТаблицаНомераСтрок.Свернуть("НомерСтроки"); 
	
	Для Каждого СтрокаТаблицы из ТаблицаНомераСтрок Цикл  
		
		Отбор = Новый Структура;
		Отбор.Вставить("НомерСтроки",СтрокаТаблицы.НомерСтроки);
		
		НайденныеСтроки = ТаблицаХранимыхДанных.НайтиСтроки(Отбор);
	
		ХранимыеДанные = СтруктураХранимыхДанных();
		ХранимыеДанные.ГруппаДанных = "Груз"; 
		ХранимыеДанные.Тип 			= "Груз"; 
		ХранимыеДанные.ИмяОбъекта 	= "Документ."+ИмяДокумента; 
		
		Для Каждого СтрокаХранимыхДанных из НайденныеСтроки Цикл
			НоваяСтрока = ХранимыеДанные.Данные.Добавить();
			НоваяСтрока.Имя 			= СтрокаХранимыхДанных.ИмяРеквизита;
			НоваяСтрока.Представление 	= ПредставленияРеквизитов.Получить(СтрокаХранимыхДанных.ИмяРеквизита);
			НоваяСтрока.Значение 		= СтрокаХранимыхДанных.Значение;
		КонецЦикла;
		
		УдалитьПустыеХранимыеДанныеСторонаПодписавшаяДокумент(ХранимыеДанные.Данные);
		
		Если ХранимыеДанные.Данные.Количество() > 0 Тогда
			ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
			ДанныеСтроки.ИмяРеквизита 			= "ХранимыеДанныеГруз"; 
			ДанныеСтроки.ЗначениеРеквизита 		= ХранимыеДанные;
			ДанныеСтроки.ИмяТабличнойЧасти 		= НайденныеСтроки[0].ИмяТабличнойЧасти;  
			ДанныеСтроки.НомерСтрокиРеквизита 	= СтрокаТаблицы.НомерСтроки;  
			
			ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьХранимыеДанныеМедработика(ТаблицаЗначенийРеквизитов, ИмяДокумента, ПрефиксТитула, ИмяГруппы)

	ОбластиХранимыхДанных = Новый Массив;
	ОбластиХранимыхДанных.Добавить("МедорганизацияНаименование"); 
	ОбластиХранимыхДанных.Добавить("Фамилия"); 
	ОбластиХранимыхДанных.Добавить("Имя"); 
	ОбластиХранимыхДанных.Добавить("Отчество");
	ОбластиХранимыхДанных.Добавить("Должность");
	ОбластиХранимыхДанных.Добавить("ЛицензияСерия");     
	ОбластиХранимыхДанных.Добавить("ЛицензияНомер");     
	ОбластиХранимыхДанных.Добавить("ЛицензияДатаВыдачи");     
	ОбластиХранимыхДанных.Добавить("ЛицензияСрокОкончания");     
	
	ПредставленияРеквизитов = Новый Соответствие; 
	ПредставленияРеквизитов.Вставить("МедорганизацияНаименование", "Наименование мед.органиазции"); 
	ПредставленияРеквизитов.Вставить("Фамилия", "Фамилия"); 
	ПредставленияРеквизитов.Вставить("Имя", "Имя"); 
	ПредставленияРеквизитов.Вставить("Отчество", "Отчество");
	ПредставленияРеквизитов.Вставить("Должность", "Должность");
	ПредставленияРеквизитов.Вставить("ЛицензияСерия","Лицензия серия");     
	ПредставленияРеквизитов.Вставить("ЛицензияНомер", "Лицензия номер");     
	ПредставленияРеквизитов.Вставить("ЛицензияДатаВыдачи", "Лицензия дата выдачи");     
	ПредставленияРеквизитов.Вставить("ЛицензияСрокОкончания","Лицензия срок окончания");     
	
	ХранимыеДанные = СтруктураХранимыхДанных();
	ХранимыеДанные.ГруппаДанных = ПрефиксТитула+ИмяГруппы; 
	ХранимыеДанные.Тип 			= ИмяГруппы; 
	ХранимыеДанные.ИмяОбъекта 	= "Документ."+ИмяДокумента; 
	
	Для Каждого ИмяОбласти из ОбластиХранимыхДанных Цикл
		Область = ТабличныйДокумент.Области.Найти(ПрефиксТитула+ИмяГруппы+ИмяОбласти);
		Если Область = Неопределено Тогда 
			Продолжить;
		КонецЕсли; 
		
		НоваяСтрока = ХранимыеДанные.Данные.Добавить();
		НоваяСтрока.Имя 			= ИмяОбласти;
		НоваяСтрока.Представление 	= ПредставленияРеквизитов.Получить(ИмяОбласти);
		НоваяСтрока.Значение 		= Область.Значение;
	КонецЦикла;
	
	УдалитьПустыеХранимыеДанныеСторонаПодписавшаяДокумент(ХранимыеДанные.Данные);
	
	Если ХранимыеДанные.Данные.Количество() > 0 Тогда
		ДанныеСтроки = ПустаяСтруктураДанныхСтроки();
		ДанныеСтроки.ИмяРеквизита 			= "ХранимыеДанные"+ПрефиксТитула+ИмяГруппы; 
		ДанныеСтроки.ЗначениеРеквизита 		= ХранимыеДанные;
		
		ЗаписатьЗначениеОбластиВТаблицу(ТаблицаЗначенийРеквизитов, ДанныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СтруктураХранимыхДанных()
	
	ТипСтрока = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(255));
	ТипЧисло = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10));
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Имя",				 ТипСтрока);
	Данные.Колонки.Добавить("Представление",	 ТипСтрока);
	Данные.Колонки.Добавить("Значение");
	Данные.Колонки.Добавить("ИмяТабличнойЧасти", ТипСтрока);
	Данные.Колонки.Добавить("НомерСтрокиТЧ",	 ТипЧисло);

	СтрукутраХранимыхДанных = Новый Структура;     
	СтрукутраХранимыхДанных.Вставить("ГруппаДанных", 	"");
	СтрукутраХранимыхДанных.Вставить("Тип", 			"");
	СтрукутраХранимыхДанных.Вставить("ИмяОбъекта",		"");
	СтрукутраХранимыхДанных.Вставить("Контрагент",		Неопределено);
	СтрукутраХранимыхДанных.Вставить("Данные",			Данные);
	
	Возврат СтрукутраХранимыхДанных;	
	
КонецФункции  


&НаКлиенте
Процедура ТипДокументаЭПДПриИзменении(Элемент)
	ТипДокументаЭПДПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипДокументаЭПДПриИзмененииНаСервере()
	
	Объект.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Объект.ТипДокументаЭПД);
	
	CW_ОбменГИСЭПДДополнительный.УстановитьСписокВыбораТитула(ЭтотОбъект);

	ИмяДокументаПоТипу = CW_ОбменГИСЭПДПереопределяемый.ИмяДокументаПоТипу(Объект.ТипДокументаЭПД);
	
	ДоступныеТипы = Новый Массив;
	ДоступныеТипы.Добавить(Тип("ДокументСсылка."+ИмяДокументаПоТипу));
	
	ОграничениеТипа = Новый ОписаниеТипов(ДоступныеТипы);
	
	Элементы.ДокументЭПД.ОграничениеТипа = ОграничениеТипа;   
	
	Если ДокументЭПД = Неопределено Тогда
		ДокументЭПД = ОграничениеТипа.ПривестиЗначение(Неопределено);  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийТитулПриИзменении(Элемент)
	
	ТекущийТитулПриИзмененииНаСервере(); 
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда
		ОбработатьИзменнениеОбластиГрузоотправительЯвляетсяГрузополучателем_ЭТрН_Титул1();
		ОбработатьИзменнениеОбластиЛицоОсуществляющееПогрузкуЯвляетсяГрузоотправителем_ЭТрН_Титул1();	
		ОбработатьИзменнениеОбластиВариантОснованияПолномочий_ЭТрН_Титул1(); 
	КонецЕсли;   
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1") Тогда
		ТекущийТитулПриИзменении_ОбработатьИзменнениеОбласти_ЭПЛ_Титул1();
	КонецЕсли;   
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул2") Тогда
		ТекущийТитулПриИзменении_ОбработатьИзменнениеОбласти_ЭПЛ_Титул2();
	КонецЕсли;   
	
КонецПроцедуры 

&НаСервере
Процедура ТекущийТитулПриИзмененииНаСервере()    
	
	ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
	Если ТипЗнч(ПараметрыДокументаЭПД) = Тип("ФиксированнаяСтруктура") тогда 
		
		ИнформацияПоПрефиксамТитула = CW_ОбменГИСЭПДПереопределяемый.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
		ПрефиксТитула = ИнформацияПоПрефиксамТитула.ВПрограмме;
		
		ИмяМакета 	= ПараметрыДокументаЭПД["Макеты"].Получить(Объект.ТекущийТитул); 
		Макет 		= CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьМакетЭлектронногоПеревозочногоДокумента(ИмяМакета);    
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Макет); 
		
		ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(0);  
		
		Для каждого Область из ТабличныйДокумент.Области Цикл
			Если СтрНачинаетсяС(Область.Имя, "УдалитьСтроку") Тогда
				Область.Гиперссылка = Ложь;
				Область.Текст = "";  
			КонецЕсли; 
		КонецЦикла;   
		
		Если Объект.ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1 Тогда
			ОбластьТитулГрузоотправителяЗаказДата = ТабличныйДокумент.Область("ТитулГрузоотправителяЗаказДата");
			ОбластьТитулГрузоотправителяЗаказДата.Значение = ТекущаяДатаСеанса();  
			
			АдресаПунктовПогрузкиИВыгрузкиНомерПп = ТабличныйДокумент.Область("ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_НомерПп_1");
			АдресаПунктовПогрузкиИВыгрузкиНомерПп.Значение = 1;  
			
			ОбработатьИзменнениеОбластиПоДоверенностиГрузоотправителя_ЭЗЗ_Титул1();
			
			УстановитьФункцииДокумента("Заказ");
		КонецЕсли; 
		
		Если Объект.ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1 Тогда
			ОбработатьИзменнениеОбластиПоДоверенностиГрузоотправителя_ЭТрН_Титул1(); 
			ОбработатьИзменнениеОбластиТитулГрузоотправителяЭкспедитор_ЭТрН_Титул1();
		КонецЕсли;  
		Если Объект.ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2 Тогда
			ОбработатьИзменнениеОбластиВариантПоДоверенностиЗаПеревозчика_ЭЗЗ_Титул2();
		КонецЕсли;   
		

		CW_ОбменГИСЭПДДополнительный.УстановитьИдентификаторыСтрок(Объект.ТекущийТитул, ТабличныйДокумент, "_1");
		CW_ОбменГИСЭПДДополнительный.УстановитьИдентификаторыСтрок(Объект.ТекущийТитул, ТабличныйДокумент, "_2");
		CW_ОбменГИСЭПДДополнительный.УстановитьИдентификаторыСтрок(Объект.ТекущийТитул, ТабличныйДокумент, "_3");
		
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Элементы.ТабличныйДокумент.Защита Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") = 1 И Область.Текст <> "" Тогда
		ДобавитьСтроку();
		Возврат;
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") = 1 И Область.Текст <> "" Тогда
		УдалитьСтроку();
		Возврат;
	КонецЕсли;    
	
	ИмяОбластиБезПрефикса = CW_ОбменГИСЭПДСерверВызовСервера.ИмяОбластиБезПрефикса(Область.Имя);  
	
	мОбластиБулево	= CW_ОбменГИСЭПДСерверВызовСервера.СписокОбластейТипБлево(Объект.ТекущийТитул);
	Если мОбластиБулево.Найти(ИмяОбластиБезПрефикса) <> Неопределено Тогда
		Область.Значение = ?(ПустаяСтрока(Область.значение), "V", ""); 
	КонецЕсли;  
	
	мОбластиАдресов	= CW_ОбменГИСЭПДСерверВызовСервера.СписокОбластейАдресов(Объект.ТекущийТитул);    
	Если мОбластиАдресов.Найти(ИмяОбластиБезПрефикса) <> Неопределено Тогда
		//Нужно показать форму ввода адреса
		ВводАдреса(Область.Имя);
		Возврат;
	КонецЕсли; 
	
	СпискиВыбора = CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьСпискиВыбораЗначенияТекущегоТитула(Объект.ТекущийТитул);
	
	СписокВыбора = СпискиВыбора.Получить(ИмяОбластиБезПрефикса); 
	Если СписокВыбора = Неопределено 
		И (ИмяОбластиБезПрефикса = "ТитулГрузоотправителяГрузыПунктыПогрузкиВыгрузки_ПунктПогрузки"
		или ИмяОбластиБезПрефикса = "ТитулГрузоотправителяГрузыПунктыПогрузкиВыгрузки_ПунктВыгрузки") Тогда 
		СписокВыбора = ПолучитьсписокАдресовПунктов();
	КонецЕсли;
	
	Если СписокВыбора <> Неопределено Тогда
		ТекущийЭлементСписка = СписокВыбора.НайтиПоЗначению(Область.Значение);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяОбласти", Область.Имя);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзСписка", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элемент); 
		Возврат;
	КонецЕсли;  
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1") Тогда 
		
		Если Область.Имя = "ВариантПоДоверенностиЗаГрузоотправителя" Тогда
			ОбработатьИзменнениеОбластиПоДоверенностиГрузоотправителя_ЭЗЗ_Титул1();
			Модифицированность = Истина;
		КонецЕсли;  
		
		Если СтрНачинаетсяС(Область.Имя, "ТитулГрузоотправителяГрузы_ВидТары") Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ИмяОбласти", Область.Имя);
			
			Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзСправочника", ЭтотОбъект, ДополнительныеПараметры);
			
			ОткрытьФорму("Справочник.КлассификаторУпаковкиЭПД.ФормаВыбора", ,ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;  
		
	КонецЕсли;
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2") Тогда 
		
		Если Область.Имя = "ВариантПоДоверенностиЗаПеревозчика" Тогда
			ОбработатьИзменнениеОбластиВариантПоДоверенностиЗаПеревозчика_ЭЗЗ_Титул2();
			Модифицированность = Истина;   
		КонецЕсли;     
		
		Если Область.Имя = "СсылкаТитулПеревозчикаВалютаСтоимости" Тогда   
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ИмяОбласти", Область.Имя);
			
			Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзСправочника", ЭтотОбъект, ДополнительныеПараметры);
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("РежимВыбора", 		Истина);
			СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", 	Истина);
			СтруктураПараметров.Вставить("МножественныйВыбор", 	Ложь);
			
			ОткрытьФорму("Справочник.Валюты.ФормаВыбора", СтруктураПараметров ,ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);    
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда 
		
		Если Область.Имя = "ВариантПоДоверенности"	Тогда
			ОбработатьИзменнениеОбластиПоДоверенностиГрузоотправителя_ЭТрН_Титул1();
			Модифицированность = Истина;
		КонецЕсли;  
		Если Область.Имя = "ТитулГрузоотправителяЭкспедитор"	Тогда
			ОбработатьИзменнениеОбластиТитулГрузоотправителяЭкспедитор_ЭТрН_Титул1();
			Модифицированность = Истина;
		КонецЕсли;  
		Если Область.Имя = "ГрузоотправительЯвляетсяГрузополучателем"	Тогда
			ОбработатьИзменнениеОбластиГрузоотправительЯвляетсяГрузополучателем_ЭТрН_Титул1();
			Модифицированность = Истина;
		КонецЕсли;  
		
	КонецЕсли;  
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	
	Если Элементы.ТабличныйДокумент.Защита Тогда
		Возврат;
	КонецЕсли; 
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1") Тогда 
		Если СтрНачинаетсяС(Область.Имя, "ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_ВладелецПунктаПогрузкиНаименование") Тогда
			ЧастиИмени  = СтрРазделить(Область.Имя,"_");
			ТекИндекс 	= "_"+ЧастиИмени[2];
			
			ОбластьИННИмя = "ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_ВладелецПунктаПогрузкиИНН"+ТекИндекс;	
			
			ОбластьИНН = ТабличныйДокумент.Области.Найти(ОбластьИННИмя);  
			Если ОбластьИНН <> Неопределено Тогда
				ОбластьИНН.ЗНачение = ПолучитьИНН(Область.Значение);
			КонецЕсли;
			
			ЭтаФорма.Модифицированность = Истина;
			
		КонецЕсли;
	КонецЕсли;  
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда 
		Если СтрНачинаетсяС(Область.Имя, "ТитулГрузоотправителяСведенияОбОпасныхГрузах_СсылкаДОПОГ") Тогда
			ЧастиИмени  = СтрРазделить(Область.Имя,"_");
			ТекИндекс 	= "_"+ЧастиИмени[2];
			
			ОбластьИмяНомерООН = "ТитулГрузоотправителяСведенияОбОпасныхГрузах_НомерООН"+ТекИндекс;	
			
			ОбластьНомерООН = ТабличныйДокумент.Области.Найти(ОбластьИмяНомерООН);  
			Если ОбластьНомерООН <> Неопределено Тогда
				ОбластьНомерООН.ЗНачение = ПолучитьКодЭлементаНаСервере(Область.Значение);
			КонецЕсли;
			
			ЭтаФорма.Модифицированность = Истина;
			
		КонецЕсли;  
		
	КонецЕсли;  
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьИзменнениеОбластиПоДоверенностиГрузоотправителя_ЭЗЗ_Титул1()
	
	Типы = Новый Массив;
	
	ОбластьПоДоверенности = ТабличныйДокумент.Области.Найти("ВариантПоДоверенностиЗаГрузоотправителя");
	Если ОбластьПоДоверенности.значение = "V" Тогда
		ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
		ИмяМакета 	= ПараметрыДокументаЭПД["Макеты"].Получить(Объект.ТекущийТитул); 
		Макет 		= CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьМакетЭлектронногоПеревозочногоДокумента(ИмяМакета);    
		
		ОбластьПреемник 	= ТабличныйДокумент.Область("ПриемникДоверенности");	
		
		ОбластьСоставитель	= ТабличныйДокумент.Области.Найти("Составитель");   
		Если ОбластьСоставитель <> Неопределено Тогда
			ОбластьСоставитель	= Макет.Область("Составитель");   
			ТабличныйДокумент.ВставитьОбласть(ОбластьСоставитель, ОбластьПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		//ОбластьДоверенность	= ТабличныйДокумент.Области.Найти("Доверенность");   
		//Если ОбластьДоверенность <> Неопределено Тогда
		//	ОбластьДоверенность	= Макет.Область("Доверенность");   
		//	ТабличныйДокумент.ВставитьОбласть(ОбластьДоверенность, ОбластьПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		//КонецЕсли;
		
		//ОбластьДоверенность = ТабличныйДокумент.Области.Найти("ДоверенностьСостав");
		//ОбластьДоверенность.Сгруппировать();          
		
		Типы.Добавить(Тип("СправочникСсылка.Контрагенты"));	
	Иначе
		ОбластьСоставитель	= ТабличныйДокумент.Области.Найти("Составитель");   
		Если ОбластьСоставитель <> Неопределено Тогда
			ТабличныйДокумент.УдалитьОбласть(ОбластьСоставитель, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		ОбластьДоверенность	= ТабличныйДокумент.Области.Найти("Доверенность");   
		Если ОбластьДоверенность <> Неопределено Тогда
			ТабличныйДокумент.УдалитьОбласть(ОбластьДоверенность, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		Типы.Добавить(Тип("СправочникСсылка.Организации"));	
	КонецЕсли;
	
	ОбластьГрузоотправитель = ТабличныйДокумент.Области.Найти("СсылкаТитулГрузоотправителяГрузоотправитель");
	ОбластьГрузоотправитель.ТипЗначения = Новый ОписаниеТипов(Типы);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменнениеОбластиВариантПоДоверенностиЗаПеревозчика_ЭЗЗ_Титул2()
	
	Типы = Новый Массив;
	
	ОбластьПоДоверенности = ТабличныйДокумент.Области.Найти("ВариантПоДоверенностиЗаПеревозчика");
	Если ОбластьПоДоверенности.значение = "V" Тогда
		ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
		ИмяМакета 	= ПараметрыДокументаЭПД["Макеты"].Получить(Объект.ТекущийТитул); 
		Макет 		= CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьМакетЭлектронногоПеревозочногоДокумента(ИмяМакета);    
		
		ОбластьПреемник 	= ТабличныйДокумент.Область("ПриемникДоверенности");	
		
		ОбластьСоставитель	= ТабличныйДокумент.Области.Найти("Составитель");   
		Если ОбластьСоставитель <> Неопределено Тогда
			ОбластьСоставитель	= Макет.Область("Составитель");   
			ТабличныйДокумент.ВставитьОбласть(ОбластьСоставитель, ОбластьПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		ОбластьДоверенность	= ТабличныйДокумент.Области.Найти("Доверенность");   
		Если ОбластьДоверенность <> Неопределено Тогда
			ОбластьДоверенность	= Макет.Область("Доверенность"); 
			ТабличныйДокумент.ВставитьОбласть(ОбластьДоверенность, ОбластьПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		ОбластьДоверенность = ТабличныйДокумент.Области.Найти("ДоверенностьСостав");
		ОбластьДоверенность.Сгруппировать();          
		
		ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(0);  
		
	Иначе
		ОбластьСоставитель	= ТабличныйДокумент.Области.Найти("Составитель");   
		Если ОбластьСоставитель <> Неопределено Тогда
			ТабличныйДокумент.УдалитьОбласть(ОбластьСоставитель, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		ОбластьДоверенность	= ТабличныйДокумент.Области.Найти("Доверенность");   
		Если ОбластьДоверенность <> Неопределено Тогда
			ТабличныйДокумент.УдалитьОбласть(ОбластьДоверенность, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменнениеОбластиПоДоверенностиГрузоотправителя_ЭТрН_Титул1()
	
	Типы = Новый Массив;
	
	ОбластьПоДоверенности = ТабличныйДокумент.Области.Найти("ВариантПоДоверенности");
	Если ОбластьПоДоверенности.значение = "V" Тогда
		ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
		ИмяМакета 	= ПараметрыДокументаЭПД["Макеты"].Получить(Объект.ТекущийТитул); 
		Макет 		= CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьМакетЭлектронногоПеревозочногоДокумента(ИмяМакета);    
		
		ОбластьПреемник 	= ТабличныйДокумент.Область("ПриемникДоверенности");	
		
		ОбластьДоверенность	= ТабличныйДокумент.Области.Найти("Доверенность"); 
		Если ОбластьДоверенность = Неопределено Тогда
			ОбластьДоверенность	= Макет.Область("Доверенность");   
			ТабличныйДокумент.ВставитьОбласть(ОбластьДоверенность, ОбластьПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		ОбластьСоставитель	= ТабличныйДокумент.Области.Найти("Составитель");   
		Если ОбластьСоставитель = Неопределено Тогда
			ОбластьСоставитель	= Макет.Область("Составитель");   
			ТабличныйДокумент.ВставитьОбласть(ОбластьСоставитель, ОбластьПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		ОбластьДоверенность = ТабличныйДокумент.Области.Найти("ДоверенностьСостав");
		ОбластьДоверенность.Сгруппировать();          
		
		Типы.Добавить(Тип("СправочникСсылка.Контрагенты"));	
	Иначе
		
		ОбластьДоверенность	= ТабличныйДокумент.Области.Найти("Доверенность");   
		Если ОбластьДоверенность <> Неопределено Тогда
			ТабличныйДокумент.УдалитьОбласть(ОбластьДоверенность, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		ОбластьСоставитель	= ТабличныйДокумент.Области.Найти("Составитель");   
		Если ОбластьСоставитель <> Неопределено Тогда
			ТабличныйДокумент.УдалитьОбласть(ОбластьСоставитель, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		Типы.Добавить(Тип("СправочникСсылка.Организации"));	
	КонецЕсли;
	
	ОбластьГрузоотправитель = ТабличныйДокумент.Области.Найти("СсылкаТитулГрузоотправителяГрузоотправитель");
	ОбластьГрузоотправитель.ТипЗначения = Новый ОписаниеТипов(Типы);
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработатьИзменнениеОбластиГрузоотправительЯвляетсяГрузополучателем_ЭТрН_Титул1()
	
	Типы = Новый Массив;   
	
	ОбластьЯвляетсяГрузополучателем = ТабличныйДокумент.Области.Найти("ГрузоотправительЯвляетсяГрузополучателем");
	Если ОбластьЯвляетсяГрузополучателем.значение = "V" Тогда
		Типы.Добавить(Тип("СправочникСсылка.Организации"));	
		
		ОбластьГрузоотправитель = ТабличныйДокумент.Области.Найти("СсылкаТитулГрузоотправителяГрузоотправитель"); 
		Грузоотправитель = ОбластьГрузоотправитель.Значение;
		
	Иначе
		Типы.Добавить(Тип("СправочникСсылка.Контрагенты"));	
		
		Грузоотправитель = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	КонецЕсли;   
	
	ОбластьГрузополучатель = ТабличныйДокумент.Области.Найти("СсылкаТитулГрузоотправителяГрузополучатель");
	ОбластьГрузополучатель.ТипЗначения 	= Новый ОписаниеТипов(Типы);  
	ОбластьГрузополучатель.Значение 	= Грузоотправитель;
	
	ОбластьИмя = "ПредставлениеТитулГрузоотправителяГрузополучательАдресДоставки";

	ОбластьАдресДоставки = ТабличныйДокумент.Области.Найти(ОбластьИмя); 
	Если Не ЗначениеЗаполнено(ОбластьАдресДоставки.Значение) Тогда 
		ДанныеАдреса = ПолучитьФактическийНаСервере(Грузоотправитель);
		
		ДополнительныеПараметры = Новый Структура;               
		ДополнительныеПараметры.Вставить("ОбластьИмя", ОбластьИмя);  
		
		Оповещение = Новый ОписаниеОповещения("ВводАдреса_Завершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ВыполнитьОбработкуОповещения(Оповещение, ДанныеАдреса);
		
	Конецесли;

	УстановитьДоступностьОбластиГрузоплучатель_ЭТрН_Титул1();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьОбластиГрузоплучатель_ЭТрН_Титул1()
	
	ОбластьЯвляетсяГрузополучателем = ТабличныйДокумент.Области.Найти("ГрузоотправительЯвляетсяГрузополучателем");
	УстановитьЗащиту = (ОбластьЯвляетсяГрузополучателем.значение = "V");
	
	ОбластьГрузополучатель = ТабличныйДокумент.Области.Найти("СсылкаТитулГрузоотправителяГрузополучатель");
	ОбластьГрузополучатель.Защита 	= УстановитьЗащиту;   
	ОбластьГрузополучатель.ЦветФона = ?(УстановитьЗащиту, Новый Цвет, Новый Цвет(255, 255, 192));

КонецПроцедуры    
 
&НаСервере
Процедура ОбработатьИзменнениеОбластиТитулГрузоотправителяЭкспедитор_ЭТрН_Титул1()
	
	ОбластьЭкспедитор = ТабличныйДокумент.Области.Найти("ТитулГрузоотправителяЭкспедитор");
	Если ОбластьЭкспедитор.значение = "V" Тогда 
		
		ОбластьЯвляетсяЭкспедитором	= ТабличныйДокумент.Области.Найти("ЯвляетсяЭкспедитором");   
		Если ОбластьЯвляетсяЭкспедитором = Неопределено Тогда
			ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
			ИмяМакета 	= ПараметрыДокументаЭПД["Макеты"].Получить(Объект.ТекущийТитул); 
			Макет 		= CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьМакетЭлектронногоПеревозочногоДокумента(ИмяМакета);    
			
			ОбластьПреемник 	= ТабличныйДокумент.Область("ПриемникЯвляетсяЭкспедитором");	
			
			ОбластьЯвляетсяЭкспедитором	= Макет.Область("ЯвляетсяЭкспедитором");   
			ТабличныйДокумент.ВставитьОбласть(ОбластьЯвляетсяЭкспедитором, ОбластьПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		ОбластьСоставДоговораНаВыполнениеУслуг = ТабличныйДокумент.Области.Найти("СоставДоговораНаВыполнениеУслуг");
		ОбластьСоставДоговораНаВыполнениеУслуг.Сгруппировать();          
		
		ОбластьСоставОснованияРасчетов = ТабличныйДокумент.Области.Найти("СоставОснованияРасчетов");
		ОбластьСоставОснованияРасчетов.Сгруппировать();          
		
	Иначе
		
		ОбластьДоверенность	= ТабличныйДокумент.Области.Найти("ЯвляетсяЭкспедитором");   
		Если ОбластьДоверенность <> Неопределено Тогда
			ТабличныйДокумент.УдалитьОбласть(ОбластьДоверенность, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ОбработатьИзменнениеОбластиЛицоОсуществляющееПогрузкуЯвляетсяГрузоотправителем_ЭТрН_Титул1()

	ОбластьЛицоОсуществляющееПогрузку = ТабличныйДокумент.Области.Найти("ТитулГрузоотправителяЛицоОсуществляющееПогрузкуЯвляетсяГрузоотправителем");
	Если ОбластьЛицоОсуществляющееПогрузку.значение = "2" Тогда 
		ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
		ИмяМакета 	= ПараметрыДокументаЭПД["Макеты"].Получить(Объект.ТекущийТитул); 
		Макет 		= CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьМакетЭлектронногоПеревозочногоДокумента(ИмяМакета);    
		
		ОбластьПреемник	= ТабличныйДокумент.Область("ПриемникИноеЛицо");	
		
		ОбластьИноеЛицо	= Макет.Область("ИноеЛицо");   
		ТабличныйДокумент.ВставитьОбласть(ОбластьИноеЛицо, ОбластьПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		
		ОбластьСоставОснование = ТабличныйДокумент.Области.Найти("СоставОснование");
		ОбластьСоставОснование.Сгруппировать();          
		
		ОбластьСоставРаботникЛица = ТабличныйДокумент.Области.Найти("СоставРаботникЛица");
		ОбластьСоставРаботникЛица.Сгруппировать();  

	Иначе
		ОбластьИноеЛицо	= ТабличныйДокумент.Области.Найти("ИноеЛицо");   
		Если ОбластьИноеЛицо <> Неопределено Тогда
			ТабличныйДокумент.УдалитьОбласть(ОбластьИноеЛицо, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменнениеОбластиВариантОснованияПолномочий_ЭТрН_Титул1()
	
	ОбластьВариантОснованияПолномочий = ТабличныйДокумент.Области.Найти("ВариантОснованияПолномочий"); 
	Если ОбластьВариантОснованияПолномочий <> Неопределено Тогда
		ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
		ИмяМакета 	= ПараметрыДокументаЭПД["Макеты"].Получить(Объект.ТекущийТитул); 
		Макет 		= CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьМакетЭлектронногоПеревозочногоДокумента(ИмяМакета);    
		
		
		//Удаляем области
		ОбластьОснованиеТекст	= ТабличныйДокумент.Области.Найти("ОснованиеТекст");   
		Если ОбластьОснованиеТекст <> Неопределено Тогда
			ТабличныйДокумент.УдалитьОбласть(ОбластьОснованиеТекст, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли; 
		
		ОбластьОснованиеДокумент	= ТабличныйДокумент.Области.Найти("ОснованиеДокумент");   
		Если ОбластьОснованиеДокумент <> Неопределено Тогда
			ТабличныйДокумент.УдалитьОбласть(ОбластьОснованиеДокумент, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		//---Удаляем области
		
		ОбластьПреемник	= ТабличныйДокумент.Область("ПриемникОснование");	
	
		Если ОбластьВариантОснованияПолномочий.Значение = 0 Тогда 
			ОбластьОснованиеТекст = Макет.Область("ОснованиеТекст");   
			ТабличныйДокумент.ВставитьОбласть(ОбластьОснованиеТекст, ОбластьПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		Иначе   
			ОбластьОснованиеДокумент = Макет.Область("ОснованиеДокумент");   
			ТабличныйДокумент.ВставитьОбласть(ОбластьОснованиеДокумент, ОбластьПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;  
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТекущийТитулПриИзменении_ОбработатьИзменнениеОбласти_ЭПЛ_Титул1()
	
	МассивИменОбластей = Новый Массив;
	МассивИменОбластей.Добавить("ТитулОформлениеПризнакНачалаРейса");
	МассивИменОбластей.Добавить("ТитулОформлениеСведенияОВидеПеревозки");
	МассивИменОбластей.Добавить("ТитулОформлениеВидКоммерческойПеревозки");
	МассивИменОбластей.Добавить("ВариантМедосмотр");
	МассивИменОбластей.Добавить("ВариантТехконтроль");
	МассивИменОбластей.Добавить("ВариантПоказанияОдометра");
	МассивИменОбластей.Добавить("ТитулОформлениеПризнакФормированияПутевогоЛистаНаОдинДень");
	
	Для Каждого ИмяОбласти из МассивИменОбластей Цикл
		ТекущаяОбласть = ТабличныйДокумент.Области.Найти(ИмяОбласти);
		Если ТекущаяОбласть <> Неопределено Тогда
			ОбработатьИзменнениеОбласти_ЭПЛ_Титул1(ТекущаяОбласть);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ТекущийТитулПриИзменении_ОбработатьИзменнениеОбласти_ЭПЛ_Титул2()
	
	МассивИменОбластей = Новый Массив;
	МассивИменОбластей.Добавить("ВариантМедработник");
	
	Для Каждого ИмяОбласти из МассивИменОбластей Цикл
		ТекущаяОбласть = ТабличныйДокумент.Области.Найти(ИмяОбласти);
		Если ТекущаяОбласть <> Неопределено Тогда
			ОбработатьИзменнениеОбласти_ЭПЛ_Титул2(ТекущаяОбласть);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьИзменнениеОбласти_ЭПЛ_Титул1(ТекущаяОбласть)
	
	ТипСмещения	= "ПоВертикали"; 
	
	Если ТекущаяОбласть.Имя = "ТитулОформлениеПризнакФормированияПутевогоЛистаНаОдинДень" Тогда 
		
		ИмяВставляемаяОбласть	= "ДатаИспользования";
		ИмяУдаляемаяОбласть		= "НачалоОкончаниеИспользования";
		
		Если ТекущаяОбласть.Значение = "1" Тогда  
			ИмяВставляемаяОбласть	= "ДатаИспользования";
			ИмяУдаляемаяОбласть		= "НачалоОкончаниеИспользования";
			
			ВставитьОбластьТабличногоДокумента(ИмяВставляемаяОбласть, ТипСмещения);
			УдалитьОбластьТабличногоДокумента(ИмяУдаляемаяОбласть, ТипСмещения);
		ИначеЕсли ТекущаяОбласть.Значение = "2" Тогда 
			ИмяВставляемаяОбласть	= "НачалоОкончаниеИспользования";
			ИмяУдаляемаяОбласть		= "ДатаИспользования";
			
			ВставитьОбластьТабличногоДокумента(ИмяВставляемаяОбласть, ТипСмещения);
			УдалитьОбластьТабличногоДокумента(ИмяУдаляемаяОбласть, ТипСмещения);   
		Иначе
			УдалитьОбластьТабличногоДокумента("ДатаИспользования", 				ТипСмещения);
			УдалитьОбластьТабличногоДокумента("НачалоОкончаниеИспользования", 	ТипСмещения);
		КонецЕсли;  
		
		Возврат; 
		
	КонецЕсли;  
	
	Если ТекущаяОбласть.Имя = "ТитулОформлениеПризнакНачалаРейса" Тогда
		ИмяОбласти	= "ПредыдущийПутевойЛист";
		Значение 	= "2";
	КонецЕсли;
	
	Если ТекущаяОбласть.Имя = "ТитулОформлениеСведенияОВидеПеревозки" Тогда
		ИмяОбласти	= "ВидКоммерческойПеревозки";
		Значение 	= "КП";
	КонецЕсли;
	
	Если ТекущаяОбласть.Имя = "ТитулОформлениеВидКоммерческойПеревозки" Тогда
		ИмяОбласти			= "Адреса";
		Значение 			= "ПГ"; 
		ИмяОбластиГруппа	= "СоставАдреса";
	КонецЕсли;
	
	Если ТекущаяОбласть.Имя = "ВариантМедосмотр" Тогда
		ИмяОбласти	= "СторонняяМедорганизация"; 
		ТипСмещения	= "ПоГоризонтали";	
		Значение 	= "Сторонняя организация";
	КонецЕсли;
	
	Если ТекущаяОбласть.Имя = "ВариантТехконтроль" Тогда
		ИмяОбласти	= "СторонняяТехконтроль";  
		ТипСмещения	= "ПоГоризонтали";	
		Значение 	= "Сторонняя организация";
	КонецЕсли;   
	
	Если ТекущаяОбласть.Имя = "ВариантПоказанияОдометра" Тогда
		ИмяОбласти	= "СторонняяПоказанияОдометра";  
		ТипСмещения	= "ПоГоризонтали";	
		Значение 	= "Сторонняя организация";
	КонецЕсли;  
	
	Если ТекущаяОбласть.Значение = Значение Тогда 
		ВставитьОбластьТабличногоДокумента(ИмяОбласти, ТипСмещения);
	Иначе
		УдалитьОбластьТабличногоДокумента(ИмяОбласти, ТипСмещения);
	КонецЕсли; 
	
	Если ИмяОбластиГруппа <> Неопределено Тогда
		ОбластьСостав = ТабличныйДокумент.Области.Найти(ИмяОбластиГруппа); 
		Если ОбластьСостав <> Неопределено Тогда
			ОбластьСостав.Сгруппировать();          
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущаяОбласть.Имя = "ТитулОформлениеСведенияОВидеПеревозки" Тогда 
		Область = ТабличныйДокумент.Области.Найти("ТитулОформлениеВидКоммерческойПеревозки"); 
		Если Область = Неопределено Тогда
			ИмяОбласти	= "Адреса";
			УдалитьОбластьТабличногоДокумента(ИмяОбласти, ТипСмещения);
		Иначе
			ОбработатьИзменнениеОбласти_ЭПЛ_Титул1(Область);	
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменнениеОбласти_ЭПЛ_Титул2(ТекущаяОбласть)
	
	ТипСмещения	= "ПоВертикали"; 
	
	Если ТекущаяОбласть.Имя = "ВариантМедработник" Тогда 
		
		Если ТекущаяОбласть.Значение = 0 Тогда  
			ИмяВставляемаяОбласть	= "ШтатныйМедработник";
			ИмяУдаляемаяОбласть		= "СтороннийМедработник";  
			ИмяОбластиГруппа 		= "СоставШтатныйМедработник";
			
			ВставитьОбластьТабличногоДокумента(ИмяВставляемаяОбласть, ТипСмещения);
			УдалитьОбластьТабличногоДокумента(ИмяУдаляемаяОбласть, ТипСмещения); 
		КонецЕсли;  
		
		Если ТекущаяОбласть.Значение = 1 Тогда 
			ИмяВставляемаяОбласть	= "СтороннийМедработник";
			ИмяУдаляемаяОбласть		= "ШтатныйМедработник";       
			ИмяОбластиГруппа 		= "СоставСтороннийМедработник";
			
			ВставитьОбластьТабличногоДокумента(ИмяВставляемаяОбласть, ТипСмещения);
			УдалитьОбластьТабличногоДокумента(ИмяУдаляемаяОбласть, ТипСмещения);   
		КонецЕсли;  
		
		Если ИмяОбластиГруппа <> Неопределено Тогда
			ОбластьСостав = ТабличныйДокумент.Области.Найти(ИмяОбластиГруппа); 
			Если ОбластьСостав <> Неопределено Тогда
				ОбластьСостав.Сгруппировать();          
			КонецЕсли;
		КонецЕсли;
		
		ПоказатьУровеньГруппировокСтрокНаСервере(0);
		
	КонецЕсли;  
	
КонецПроцедуры


&НаСервере
Процедура ВставитьОбластьТабличногоДокумента(Знач ИмяВставляемаяОбласть, Знач ИмяТипаСмещения)
	
	ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
	ИмяМакета 	= ПараметрыДокументаЭПД["Макеты"].Получить(Объект.ТекущийТитул); 
	Макет 		= CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьМакетЭлектронногоПеревозочногоДокумента(ИмяМакета);    
	
	//ВставляемаяОбласть	= Макет.Область(ИмяВставляемаяОбласть); 
	
	ВремТаблДок 		= Макет.ПолучитьОбласть(ИмяВставляемаяОбласть);

	CW_ОбменГИСЭПДДополнительный.УстановитьИдентификаторыСтрок(Объект.ТекущийТитул, ВремТаблДок, "_1");
	CW_ОбменГИСЭПДДополнительный.УстановитьИдентификаторыСтрок(Объект.ТекущийТитул, ВремТаблДок, "_2");
	CW_ОбменГИСЭПДДополнительный.УстановитьИдентификаторыСтрок(Объект.ТекущийТитул, ВремТаблДок, "_3");
	
	ВставляемаяОбласть	= ВремТаблДок.Область(ИмяВставляемаяОбласть); 
	
	
	ИмяОбластьПреемник	 = "Приемник" + ИмяВставляемаяОбласть;
	
	ОбластьПреемник		= ТабличныйДокумент.Область(ИмяОбластьПреемник);
	ТипСмещения			= ТипСмещенияТабличногоДокумента[ИмяТипаСмещения];
	
	Если ТабличныйДокумент.Области.Найти(ИмяВставляемаяОбласть) = Неопределено Тогда
		ТабличныйДокумент.ВставитьОбласть(ВставляемаяОбласть, ОбластьПреемник, ТипСмещения);
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура УдалитьОбластьТабличногоДокумента(Знач ИмяОбласти, Знач ИмяТипаСмещения)
	
	ТипСмещения			= ТипСмещенияТабличногоДокумента[ИмяТипаСмещения];
	
	ВставляемаяОбласть	= ТабличныйДокумент.Области.Найти(ИмяОбласти);   
	Если ВставляемаяОбласть <> Неопределено Тогда
		ТабличныйДокумент.УдалитьОбласть(ВставляемаяОбласть, ТипСмещения);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораИзСписка(РезультатВыбора, ДополнительныеПараметры) ЭКспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Область = ТабличныйДокумент.Области.Найти(ДополнительныеПараметры.ИмяОбласти);
	Область.Значение = РезультатВыбора.Значение;
	
	Если СтрНачинаетсяС(ДополнительныеПараметры.ИмяОбласти, 
		"ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_Операция") Тогда
		
		ИндексПоказателя	= ИндексПоказателя(ДополнительныеПараметры.ИмяОбласти);    
		Постфикс 			= СтрокаСИндексомПоказателя(ИндексПоказателя);
		
		ОбластьНумерацииСтрок = ТабличныйДокумент.Область("ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_НомерПп"+Постфикс);
		ОбластьНумерацииСтрок.Значение = Строка(ИндексПоказателя);
		
		ЗащитаОбласти 		= (РезультатВыбора.Значение = "Выгрузка");
		ЦветФонаОбласти 	= ?(РезультатВыбора.Значение = "Выгрузка", Новый Цвет(255,255,255), Новый Цвет(255,255,192));
		ЗначениеОбласти		= "";
		
		ОбластьНаименование = ТабличныйДокумент.Область("ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_ВладелецПунктаПогрузкиНаименование"+Постфикс);
		ОбластьНаименование.Защита 		= ЗащитаОбласти;
		ОбластьНаименование.ЦветФона 	= ЦветФонаОбласти;
		ОбластьНаименование.Значение	= ЗначениеОбласти;
		
		ОбластьИНН 			= ТабличныйДокумент.Область("ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_ВладелецПунктаПогрузкиИНН"+Постфикс);
		ОбластьИНН.Защита	= ЗащитаОбласти;
		ОбластьИНН.ЦветФона = ЦветФонаОбласти;
		ОбластьИНН.Значение	= ЗначениеОбласти;
	КонецЕсли;
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1") Тогда 
		
		Если ДополнительныеПараметры.ИмяОбласти = "ТитулГрузоотправителяЛицоОсуществляющееПогрузкуЯвляетсяГрузоотправителем" Тогда
			ОбработатьИзменнениеОбластиЛицоОсуществляющееПогрузкуЯвляетсяГрузоотправителем_ЭТрН_Титул1();	
			ОбработатьИзменнениеОбластиВариантОснованияПолномочий_ЭТрН_Титул1(); 
		КонецЕсли;
	
		Если ДополнительныеПараметры.ИмяОбласти = "ВариантОснованияПолномочий" Тогда
			ОбработатьИзменнениеОбластиВариантОснованияПолномочий_ЭТрН_Титул1(); 
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1") Тогда 
		ОбработатьИзменнениеОбласти_ЭПЛ_Титул1(Область);
	КонецЕсли; 
	
	Если Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул2") Тогда 
		ОбработатьИзменнениеОбласти_ЭПЛ_Титул2(Область);
	КонецЕсли; 
	
	Модифицированность = Истина;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеВыбораИзСправочника(РезультатВыбора, ДополнительныеПараметры) ЭКспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	Если СтрНачинаетсяС(ДополнительныеПараметры.ИмяОбласти, "ТитулГрузоотправителяГрузы_ВидТары") Тогда
		
		КодЭлемента = ПолучитьКодЭлементаНаСервере(РезультатВыбора);
		
		Область = ТабличныйДокумент.Области.Найти(ДополнительныеПараметры.ИмяОбласти);  
		Если Область <> Неопределено Тогда
			Область.Значение = КодЭлемента;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ИмяОбласти = "СсылкаТитулПеревозчикаВалютаСтоимости"  Тогда
		
		Область = ТабличныйДокумент.Области.Найти(ДополнительныеПараметры.ИмяОбласти);  
		Если Область <> Неопределено Тогда
			Область.Значение = РезультатВыбора;
			
			ДанныеВалюты = ПолучитьКодНаименованиеВалюты(РезультатВыбора);   
			
			ОбластьКодВалюты = ТабличныйДокумент.Области.Найти("ТитулПеревозчикаКодВалютыСтоимости");  
			Если ОбластьКодВалюты <> Неопределено Тогда
				ОбластьКодВалюты.Значение = ДанныеВалюты.Код;
			Конецесли;
			
			ОбластьНаименованиеВалюты = ТабличныйДокумент.Области.Найти("ТитулПеревозчикаНаименованиеВалютыСтоимости");  
			Если ОбластьНаименованиеВалюты <> Неопределено Тогда
				ОбластьНаименованиеВалюты.Значение = ДанныеВалюты.Наименование;
			Конецесли;
		КонецЕсли;
		
	КонецЕсли;
	
	
	Модифицированность = Истина;
	
КонецПроцедуры 


&НаСервере
Функция ПолучитьМассивИменОбластейМногострочнойЧасти(Знач ВремТаблДок)
	
	МассивИменОбластей = Новый Массив;
	Для Каждого Область из ВремТаблДок.Области Цикл
		Если СтрНачинаетсяС(Область.Имя, "МногострочнаяЧасть") 
			Или СтрНачинаетсяС(Область.Имя, "УдалитьСтроку") Тогда
			Продолжить;
		Конецесли;
		ИмяОбластиБезПрефикса = CW_ОбменГИСЭПДСерверВызовСервера.ИмяОбластиБезПрефикса(Область.Имя);  
		МассивИменОбластей.Добавить(ИмяОбластиБезПрефикса);
	КонецЦикла;
	
	Возврат МассивИменОбластей;
	
КонецФункции  

&НаСервере
Процедура ДобавитьСтроку()  
	
	ИмяТекОбласти = Элементы.ТабличныйДокумент.ТекущаяОбласть.Имя;    
	
	Если СтрНайти(ИмяТекОбласти, "ДобавитьСтроку") Тогда
		ИмяОбластиПреемника 	= СтрЗаменить(ИмяТекОбласти, "ДобавитьСтроку", 	"");
		ИмяОбластиПреемника 	= СтрЗаменить(ИмяОбластиПреемника, "Значок", 	"");
		
		ЧастиОбласти 			= СтрРазделить(ИмяОбластиПреемника,"_");
		
		ИмяГруппы 				= ЧастиОбласти[0];
		ИмяОбластиПреемника 	= "ДобавлениеСтроки" + ИмяОбластиПреемника;
	КонецЕсли;    
	
	ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
	ИмяМакета 	= ПараметрыДокументаЭПД["Макеты"].Получить(Объект.ТекущийТитул); 
	Макет 		= CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьМакетЭлектронногоПеревозочногоДокумента(ИмяМакета);    
	
	НачИндекс 		= "_1";
	
	ВремТаблДок 		= Макет.ПолучитьОбласть();
	ИскомаяОбластьМнЧ 	= ВремТаблДок.Области.Найти("МногострочнаяЧасть" + ИмяГруппы);
	
	ВремТаблДок 		= ВремТаблДок.ПолучитьОбласть(ИскомаяОбластьМнЧ.Верх, , 
	ИскомаяОбластьМнЧ.Верх + ВысотаМногострочнойЧасти(ИмяГруппы, Макет) - 1, );
	
	ПреИндекс_Число = ИндексПоказателя(ИмяОбластиПреемника);
	ПреИндекс = СтрокаСИндексомПоказателя(ПреИндекс_Число);
	
	НовИндекс_Число = ПреИндекс_Число + 1;
	НовИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число);
	
	НачПостфикс = ИмяГруппы + НачИндекс;
	ПреПостфикс = ИмяГруппы + ПреИндекс;
	НовПостфикс = ИмяГруппы + НовИндекс;  
	
	МассивИменОбластей = ПолучитьМассивИменОбластейМногострочнойЧасти(ВремТаблДок);
	
	Для каждого ИмяОбласти Из МассивИменОбластей Цикл
		
		НачИмяОбл = ИмяОбласти + НачИндекс;
		НовИмяОбл = ИмяОбласти + НовИндекс;
		
		ОбластьЯчейки = ВремТаблДок.Области[НачИмяОбл];
		ОбластьЯчейки.Имя = НовИмяОбл;
		
		Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
			ОбластьЯчейки.Очистить();
		КонецЕсли; 
		
		Если ИмяОбласти = "ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_НомерПп" Тогда
			ОбластьЯчейки.Значение = Строка(НовИндекс_Число);	
		КонецЕсли;
		
	КонецЦикла; 
	
	CW_ОбменГИСЭПДДополнительный.УстановитьИдентификаторыСтрок(Объект.ТекущийТитул, ВремТаблДок, НовИндекс);  
	
	ДопИндексы 			= CW_ОбменГИСЭПДДополнительный.ПолучитьДополнительныеИндексыОбластейТитула();
	СтрокаДопИндексы 	= ДопИндексы.Получить(Объект.ТекущийТитул);
	Если СтрокаДопИндексы <> Неопределено Тогда 
		ДопМассив = СтрРазделить(СтрокаДопИндексы,";");
		Для Каждого ДопИндекс из ДопМассив Цикл  
			ЧастиСтроки = СтрРазделить(ДопИндекс, "_", Ложь); 
			Если ЧастиСтроки.Количество() = 2 Тогда
				ТекИндекс = "_"+ЧастиСтроки[0]+НовИндекс;	
			Иначе
				ТекИндекс = ДопИндекс;
			КонецЕсли;
			CW_ОбменГИСЭПДДополнительный.УстановитьИдентификаторыСтрок(Объект.ТекущийТитул, ВремТаблДок, ТекИндекс,,НовИндекс); 
		КонецЦикла;
	КонецЕсли;
	
	Обл = ВремТаблДок.Область("УдалитьСтроку" + НачПостфикс);
	Обл.Имя = "УдалитьСтроку" + НовПостфикс;
	
	Обл = ВремТаблДок.Область("УдалитьСтроку" + НовПостфикс);
	Обл.Гиперссылка = Истина;
	Обл.Текст = "х";
	Если НовИндекс_Число = 2 Тогда
		Обл = ТабличныйДокумент.Области.Найти("УдалитьСтроку" + ПреПостфикс);
		Обл.Гиперссылка = Истина;
		Обл.Текст = "х";
	КонецЕсли; 
	
	Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтроку" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтроку" + НовПостфикс;   
	
	Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтрокуЗначок" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтрокуЗначок" + НовПостфикс;
	
	ОблПреемник = ТабличныйДокумент.Области.Найти(ИмяОбластиПреемника);  
	ОблПреемник.Имя = "ДобавлениеСтроки" + НовПостфикс;
	
	ВремТаблДок.Область("МногострочнаяЧасть" + ИмяГруппы).Имя = "";
	
	ВставляемаяОбласть = ВремТаблДок.Область(1, , ВремТаблДок.ВысотаТаблицы, ); 
	
	ТабличныйДокумент.ВставитьОбласть(ВставляемаяОбласть, ОблПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку()
	
	ИмяТекОбласти 	= Элементы.ТабличныйДокумент.ТекущаяОбласть.Имя;
	
	ЧастиОбласти	= СтрРазделить(ИмяТекОбласти,"_");
	ИмяГруппы		= ЧастиОбласти[0];
	
	ДополнительныеПараметры = новый Структура;
	ДополнительныеПараметры.Вставить("ИмяОбласти",	ИмяТекОбласти); 
	ДополнительныеПараметры.Вставить("ИмяГруппы",	ИмяГруппы); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = НСтр("ru='Удалить выбранную строку?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСтрокуНаСервере(ДополнительныеПараметры);  
	
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаСервере
Процедура УдалитьСтрокуНаСервере(ДополнительныеПараметры)
	
	ИмяГруппы 	= СтрЗаменить(ДополнительныеПараметры.ИмяГруппы, "УдалитьСтроку", "");
	
	ТекИндекс_Число = ИндексПоказателя(ДополнительныеПараметры.ИмяОбласти);
	ТекИндекс 		= СтрокаСИндексомПоказателя(ТекИндекс_Число);
	ТекПостфикс 	= ИмяГруппы + ТекИндекс;
	
	ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
	ИмяМакета 	= ПараметрыДокументаЭПД["Макеты"].Получить(Объект.ТекущийТитул); 
	Макет 		= CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьМакетЭлектронногоПеревозочногоДокумента(ИмяМакета);    
	
	ВремТаблДок 		= Макет.ПолучитьОбласть();
	ИскомаяОбластьМнЧ 	= ВремТаблДок.Области.Найти("МногострочнаяЧасть" + ИмяГруппы);
	
	ВремТаблДок 		= ВремТаблДок.ПолучитьОбласть(ИскомаяОбластьМнЧ.Верх, , 
	ИскомаяОбластьМнЧ.Верх + ВысотаМногострочнойЧасти(ИмяГруппы, Макет) - 1, );
	
	ЧастиИмени = СтрРазделить(ДополнительныеПараметры.ИмяОбласти, "_"); 
	ИмяПервойГрафы = ЧастиИмени[0]; 
	
	ОблДобавлениеСтроки = ТабличныйДокумент.Области.Найти("ДобавлениеСтроки" + ТекПостфикс);  
	
	ОбластиАдресов = CW_ОбменГИСЭПДСерверВызовСервера.СписокОбластейАдресов(Объект.ТекущийТитул); 
	Для Каждого ИмяОбласти из ОбластиАдресов Цикл   
		Если СтрНачинаетсяС(ИмяОбласти, ПрефиксТитула + ИмяГруппы) Тогда
			КонтактнаяИнформация = Новый Структура(ДанныеКонтактнойИнформации);
			КонтактнаяИнформация.Удалить(ИмяОбласти+ТекИндекс);  
			ДанныеКонтактнойИнформации = Новый ФиксированнаяСтруктура(КонтактнаяИнформация);
		КонецЕсли;
	КонецЦикла;
	
	// Удаляется последняя строка.
	Если ОблДобавлениеСтроки <> Неопределено Тогда
		
		ПреИндекс_Число = ТекИндекс_Число - 1;
		ПреИндекс 		= СтрокаСИндексомПоказателя(ПреИндекс_Число);
		ПреПостфикс		= ИмяГруппы + ПреИндекс;
		
		ОблУдаляемогоПоказателя = ТабличныйДокумент.Область(ИмяПервойГрафы + ТекИндекс);
		
		ВерхУдОбласти = ОблУдаляемогоПоказателя.Верх;
		НизУдОбласти  = ОблДобавлениеСтроки.Верх - 1;
		
		УдаляемаяОбласть = ТабличныйДокумент.Область(ВерхУдОбласти, , НизУдОбласти, );
		ТабличныйДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали); 
		
		Обл = ТабличныйДокумент.Области.Найти("ДобавлениеСтроки" + ТекПостфикс);
		Обл.Имя = "ДобавлениеСтроки" + ПреПостфикс;
		Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтроку" + ТекПостфикс);
		Обл.Имя = "ДобавитьСтроку" + ПреПостфикс;
		Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтрокуЗначок" + ТекПостфикс);
		Обл.Имя = "ДобавитьСтрокуЗначок" + ПреПостфикс;
		
		Если ПреИндекс_Число = 1 Тогда
			Обл = ТабличныйДокумент.Область("УдалитьСтроку" + ПреПостфикс);
			Обл.Гиперссылка = Ложь;
			Обл.Текст = "";
		КонецЕсли;    
		
	Иначе 
		
		НовИндекс_Число = ТекИндекс_Число + 1;
		НовИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число);
		
		ОблУдаляемогоПоказателя = ТабличныйДокумент.Область(ИмяПервойГрафы + ТекИндекс);
		ОблСледующегоПоказателя = ТабличныйДокумент.Область(ИмяПервойГрафы + НовИндекс);
		
		ВерхУдОбласти = ОблУдаляемогоПоказателя.Верх;
		НизУдОбласти  = ОблСледующегоПоказателя.Верх - 1;
		
		УдаляемаяОбласть 	= ТабличныйДокумент.Область(ВерхУдОбласти, , НизУдОбласти, );  
		
		ВремТаблДок 		= ТабличныйДокумент.ПолучитьОбласть(ВерхУдОбласти, ,НизУдОбласти, );
		МассивИменОбластей 	= ПолучитьМассивИменОбластейМногострочнойЧасти(ВремТаблДок);
		
		ТабличныйДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
		
		НовИндекс_Число = ТекИндекс_Число;
		
		// Реиндексация имен областей текущей многострочной части после удаления строки.  
		Пока ТабличныйДокумент.Области.Найти(ИмяПервойГрафы 
			+ СтрокаСИндексомПоказателя(НовИндекс_Число + 1)) <> Неопределено Цикл
			
			ПреИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число + 1);
			НовИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число);
			
			Для каждого ОбластьИмя Из МассивИменОбластей Цикл
				
				ПреИмяОбл = ОбластьИмя + ПреИндекс;
				НовИмяОбл = ОбластьИмя + НовИндекс;
				
				ОбластьЯчейки = ТабличныйДокумент.Области[ПреИмяОбл];
				ОбластьЯчейки.Имя = НовИмяОбл;  
				
				Если СтрНачинаетсяС(ОбластьЯчейки.Имя, "ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_НомерПп") Тогда
					
					ИндексПоказателя = ИндексПоказателя(ОбластьЯчейки.Имя);    
					
					Постфикс = СтрокаСИндексомПоказателя(ИндексПоказателя);
					
					ОбластьНумерацииСтрок = ТабличныйДокумент.Область("ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_НомерПп"+Постфикс);
					ОбластьНумерацииСтрок.Значение = Строка(ИндексПоказателя);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ПреПостфикс = ИмяГруппы + ПреИндекс;
			НовПостфикс = ИмяГруппы + НовИндекс;
			
			Обл = ТабличныйДокумент.Области.Найти("УдалитьСтроку" + ПреПостфикс);
			Обл.Имя = "УдалитьСтроку" + НовПостфикс;  
			
			НовИндекс_Число = НовИндекс_Число + 1;
			
		КонецЦикла;
		
		ПреИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число);
		НовИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число - 1);
		
		ПреПостфикс = ИмяГруппы + ПреИндекс;
		НовПостфикс = ИмяГруппы + НовИндекс;
		
		Обл = ТабличныйДокумент.Области.Найти("ДобавлениеСтроки" + ПреПостфикс);
		Обл.Имя = "ДобавлениеСтроки" + НовПостфикс;
		Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтроку" + ПреПостфикс);
		Обл.Имя = "ДобавитьСтроку" + НовПостфикс;
		Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтрокуЗначок" + ПреПостфикс);
		Обл.Имя = "ДобавитьСтрокуЗначок" + НовПостфикс;
		
		НовИмяТекОбл = ИмяПервойГрафы + ТекИндекс;
		Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Области[НовИмяТекОбл];
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Функция ИндексПоказателя(Знач ИмяОбласти) 
	
	МассивСтрок = СтрРазделить(ИмяОбласти, "_");
	
	КолСтрок = МассивСтрок.Количество();
	
	Если КолСтрок = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексСтрока = МассивСтрок[КолСтрок - 1];
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИндексСтрока) Тогда
		Возврат Число(ИндексСтрока);
	КонецЕсли;
	
КонецФункции   

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаСИндексомПоказателя(Знач Индекс) 
	
	Если ТипЗнч(Индекс) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат "_" + Формат(Индекс, "ЧГ=");
	
КонецФункции


&НаСервере
Функция ВысотаМногострочнойЧасти(ИмяГруппы, ТаблДок = Неопределено)
	
	Если ТаблДок = Неопределено Тогда
		ПараметрыДокументаЭПД = ПараметрыДокументовЭПД.Получить(Объект.ТипДокументаЭПД); 
		ИмяМакета 	= ПараметрыДокументаЭПД["Макеты"].Получить(Объект.ТекущийТитул); 
		ТаблДок 	= CW_ОбменГИСЭПДСерверВызовСервера.ПолучитьМакетЭлектронногоПеревозочногоДокумента(ИмяМакета);    
	КонецЕсли;
	
	ИскомаяОбласть1 = ТаблДок.Области.Найти("МногострочнаяЧасть" + ИмяГруппы); 
	
	Для каждого ИскомаяОбласть2 Из ТаблДок.Области Цикл  
		Если СтрНачинаетсяС(ИскомаяОбласть2.Имя, "ДобавлениеСтроки" + ИмяГруппы) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИскомаяОбласть2.Верх - ИскомаяОбласть1.Верх;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокАдресовПунктов()
	
	СписокЗначений = Новый СписокЗначений;
	
	Для Каждого Область из ТабличныйДокумент.Области Цикл
		Если СтрНайти(Область.Имя, ПрефиксТитула) =  0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяС(Область.Имя, "ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_ПредставлениеАдресПунктаПогрузки") Тогда
			ИндексСтроки 	= ИндексПоказателя(Область.Имя);
			СтрокаСИндексом = СтрокаСИндексомПоказателя(ИндексСтроки);
			
			ОбластьСНомером = ТабличныйДокумент.Области.Найти("ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_НомерПп"+СтрокаСИндексом);
			Если ОбластьСНомером <> Неопределено Тогда
				СписокЗначений.Добавить(ОбластьСНомером.Значение,СокрЛП(Область.Значение)); 
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции 

&НаКлиенте
Процедура ВводАдреса(ОбластьИмя) 
	
	Если ТипЗнч(ДанныеКонтактнойИнформации) = Тип("ФиксированнаяСтруктура") 
		и ДанныеКонтактнойИнформации.Свойство(ОбластьИмя) Тогда
		ДанныеАдреса = ДанныеКонтактнойИнформации[ОбластьИмя];  
		
		КонтактнаяИнформацияАдреса 	= ДанныеАдреса.КонтактнаяИнформация;
		СтруктураРеквизитовАдреса 	= ДанныеАдреса.СтруктураАдреса;
	Иначе
		СтруктураРеквизитовАдреса 	= CW_ОбменГИСЭПДСерверВызовСервера.ПустаяСтруктураАдерса(); 
		КонтактнаяИнформацияАдреса 	= ОбменСГИСЭПДВызовСервера.КонтактнаяИнформацияВXML(СтруктураРеквизитовАдреса,,
		ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
	КонецЕсли;
	
	ПараметрыФормыВводаАдреса = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(
	ОбменСГИСЭПДВызовСервера.ВидФактическийАдресКонтрагента(), 
	КонтактнаяИнформацияАдреса);
	
	ДополнительныеПараметры = Новый Структура;               
	ДополнительныеПараметры.Вставить("ОбластьИмя", ОбластьИмя);  
	
	Оповещение = Новый ОписаниеОповещения("ВводАдреса_Завершение", ЭтотОбъект, ДополнительныеПараметры);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормыВводаАдреса, ЭтаФорма, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводАдреса_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ОбластьДокумента = ТабличныйДокумент.Область(ДополнительныеПараметры.ОбластьИмя);
		Если ОбластьДокумента <> Неопределено тогда
			ОбластьДокумента.Значение = Результат.Представление;
		КонецЕсли;
		
		РезультатЗначение = ?(Результат.Свойство("Значение"), Результат.Значение, Результат.Адрес);	
		
		СтруктураПараметров = Новый Структура("БезПредставлений, ПроверитьАдрес, КодыАдреса", Ложь, Истина, Истина);
		СтруктураАдреса = CW_ОбменГИСЭПДСерверВызовСервера.СведенияОбАдресе(РезультатЗначение, СтруктураПараметров);
		
		ОбластьИмя		= CW_ОбменГИСЭПДСерверВызовСервера.ИмяОбластиБезПрефикса(ДополнительныеПараметры.ОбластьИмя);
		ИндексСтроки	= ИндексПоказателя(ДополнительныеПараметры.ОбластьИмя);
		СтрокаСИндексом = СтрокаСИндексомПоказателя(ИндексСтроки);
		
		СтруктураРеквизитовАдреса = ПолучитьРеквизитыАдреса(СтруктураАдреса, ОбластьИмя, СтрокаСИндексом);
		СтруктураРеквизитовАдреса.Вставить(ДополнительныеПараметры.ОбластьИмя, Результат.Представление);
		
		КонтактнаяИнформация = Новый Структура;
		Если ТипЗнч(ДанныеКонтактнойИнформации) = Тип("ФиксированнаяСтруктура") Тогда
			КонтактнаяИнформация = Новый Структура(ДанныеКонтактнойИнформации); 
		КонецЕсли;
		
		ДанныеАдреса = Новый Структура;
		ДанныеАдреса.Вставить("КонтактнаяИнформация", 		Результат.КонтактнаяИнформация);
		ДанныеАдреса.Вставить("СтруктураАдреса",			СтруктураАдреса); 
		ДанныеАдреса.Вставить("СтруктураРеквизитовАдреса",	СтруктураРеквизитовАдреса); 
		
		КонтактнаяИнформация.Вставить(ДополнительныеПараметры.ОбластьИмя, ДанныеАдреса);
		
		ДанныеКонтактнойИнформации = Новый ФиксированнаяСтруктура(КонтактнаяИнформация);
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры        

&НаСервере
Функция ПолучитьРеквизитыАдреса(СтруктураАдреса, ИмяЭлемента, ИндексСтроки="") 
	
	Префикс = СтрЗаменить(ИмяЭлемента, "Представление", "");
	
	СтруктураДанныеАдреса = Новый Структура;   
	
	Если СтруктураАдреса.ТипАдреса = "ВСвободнойФорме"
		Или ЗначениеЗаполнено(СтруктураАдреса.Территория) Тогда
		СтруктураДанныеАдреса.Вставить(Префикс + "Представление" + ИндексСтроки, СтруктураАдреса.Представление);
		СтруктураДанныеАдреса.Вставить(Префикс + "КодСтраны"  + ИндексСтроки, СтруктураАдреса.КодСтраны);	
	Иначе	
		СтруктураДанныеАдреса.Вставить(Префикс + "Индекс" + ИндексСтроки, СтруктураАдреса.Индекс);
		СтруктураДанныеАдреса.Вставить(Префикс + "КодРегиона" + ИндексСтроки, СтруктураАдреса.КодРегиона);
		СтруктураДанныеАдреса.Вставить(Префикс + "Город" + ИндексСтроки, СтруктураАдреса.Город + ?(СтруктураАдреса.ГородТипКраткий = "", "", " ") + СтруктураАдреса.ГородТипКраткий);
		СтруктураДанныеАдреса.Вставить(Префикс + "Район" + ИндексСтроки, СтруктураАдреса.Район + ?(СтруктураАдреса.РайонТипКраткий = "", "", " ") + СтруктураАдреса.РайонТипКраткий);
		СтруктураДанныеАдреса.Вставить(Префикс + "НаселенныйПункт" + ИндексСтроки, СтруктураАдреса.НаселенныйПункт + ?(СтруктураАдреса.НаселенныйПунктТипКраткий = "", "", " ") + СтруктураАдреса.НаселенныйПунктТипКраткий);
		СтруктураДанныеАдреса.Вставить(Префикс + "Улица" + ИндексСтроки, СтруктураАдреса.Улица + ?(СтруктураАдреса.УлицаТипКраткий = "", "", " ") + СтруктураАдреса.УлицаТипКраткий);
		СтруктураДанныеАдреса.Вставить(Префикс + "Дом" + ИндексСтроки, СтруктураАдреса.Здание.Номер);
		Если СтруктураАдреса.Корпуса.Количество() > 0 Тогда
			СтруктураДанныеАдреса.Вставить(Префикс + "Корпус" + ИндексСтроки, СтруктураАдреса.Корпуса[0].Номер);
		КонецЕсли;	
	КонецЕсли;    
	
	Возврат СтруктураДанныеАдреса;
	
КонецФункции

&НаСервере
Функция ПолучитьФактическийНаСервере(ЗначениеОтбора)
	
	Если ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.Организации") Тогда
		ВидАдреса = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;	
	Иначе
		ВидАдреса = CW_ОбменГИСЭПДПереопределяемый.ВидФактическийАдресКонтрагента();	
	КонецЕсли;
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЗначениеОтбора, ВидАдреса,,Ложь); 
	Результат = Новый Структура("Вид,Значение,КонтактнаяИнформация,Представление");
	
	Если ТаблицаКИ.Количество() > 0 Тогда
		Результат = Новый Структура("Вид,Значение,КонтактнаяИнформация,Представление");
		Результат.Вид 			= ТаблицаКИ[0].Вид;
		Результат.Значение 		= ТаблицаКИ[0].Значение;
		Результат.Представление = ТаблицаКИ[0].Представление;  
		Результат.КонтактнаяИнформация = ТаблицаКИ[0].ЗначенияПолей;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезконтекста
Функция ПолучитьИНН(Контрагент)
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат Контрагент.ИНН;
	Конецесли; 
	
	Возврат "";
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКодЭлементаНаСервере(ВыбранныйЭлемент)
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ВыбранныйЭлемент)) Тогда
		Возврат ВыбранныйЭлемент.Код;                                               
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКодНаименованиеВалюты(Валюта)
	
	ДанныеВалюты = Новый Структура;
	ДанныеВалюты.Вставить("Код", 			Валюта.Код);
	ДанныеВалюты.Вставить("Наименование", 	Валюта.Наименование);
	
	Возврат ДанныеВалюты;
	
КонецФункции

&НаСервере
Процедура ПоказатьУровеньГруппировокСтрокНаСервере(Индекс)
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(Индекс);  
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяДокументаПоТипу()
	
	Возврат CW_ОбменГИСЭПДПереопределяемый.ИмяДокументаПоТипу(Объект.ТипДокументаЭПД);
	
КонецФункции

&НаКлиенте
Процедура СоздатьЗаполнитьЭПД(Команда) 
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, "Перпед заполнением ЭПД необходимо записать элемент!");
		Возврат;
	КонецЕсли;

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьСозданиеДокументаЭПД", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Будет заполнен документ ЭПД. Продолжить?", Режим, 0);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПродолжитьСозданиеДокументаЭПД(Результат, ДоолнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

  	ИмяДокумента = ПолучитьИмяДокументаПоТипу();
	Если ИмяДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	РезультатВыполнения =  НачатьЗаполнениеЭПДНаСервереВФоне(ДокументЭПД); 
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеЗаполненияЭПД", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнениеЭПДНаСервереВФоне(ЭлектронныйПеревозочныйДокумент)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне		= Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне    = ложь;  
	
	ПараметрыПроцедуры = ПодготовитьПараметрыПроцедуры(ЭлектронныйПеревозочныйДокумент);  
	Если ПараметрыПроцедуры = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ОбменГИСЭПДДополнительный.ЗаполнитьЭПД" ,ПараметрыПроцедуры, ПараметрыВыполнения);  	
	
КонецФункции  

&НаСервере
Функция ПодготовитьПараметрыПроцедуры(ЭлектронныйПеревозочныйДокумент)
	
	ПараметрыПроцедуры = Новый Структура; 
	
	тОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаЗначенийРеквизитов = тОбъект.ЗначенияРеквизитовДокументовЭПД.Получить();
	Если ТипЗнч(ТаблицаЗначенийРеквизитов) <> Тип("ТаблицаЗначений") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекущийШагТитула = ТекущийШагТитула();  
	ТекущийШаг = ТекущийШагТитула.Получить(Объект.ТекущийТитул); 
	ТекущийШаг = ?(ТекущийШаг=Неопределено, "", ТекущийШаг);
	
	ПараметрыПроцедуры.Вставить("Дата",	ТекущаяДата());
	ПараметрыПроцедуры.Вставить("Организация",	Объект.Организация);
	ПараметрыПроцедуры.Вставить("СсылкаТитулГрузоотправителяГрузоотправитель",	Объект.СсылкаТитулГрузоотправителяГрузоотправитель);
	ПараметрыПроцедуры.Вставить("СсылкаТитулГрузоотправителяПеревозчик", 		Объект.СсылкаТитулГрузоотправителяПеревозчик);
	ПараметрыПроцедуры.Вставить("СсылкаТитулГрузоотправителяПеревозчик", 		Объект.СсылкаТитулГрузоотправителяПеревозчик);
	ПараметрыПроцедуры.Вставить("ТипДокументаЭПД", 	Объект.ТипДокументаЭПД);
	ПараметрыПроцедуры.Вставить("ЭлектронныйПеревозочныйДокумент", ЭлектронныйПеревозочныйДокумент);
	ПараметрыПроцедуры.Вставить("ТекущийШаг", 	ТекущийШаг); 
	
	ВерсияТитула = Новый Структура;
	ВерсияТитула.Вставить("Титул",				Объект.ТекущийТитул);
	ВерсияТитула.Вставить("НомерВерсии",		"");
	ВерсияТитула.Вставить("ИдентификаторФайла",	"");
	ВерсияТитула.Вставить("ВерсияТитула", 		0);   
	ВерсияТитула.Вставить("ДатаВерсии", 		Дата(1,1,1));   
	
	ПараметрыПроцедуры.Вставить("ВерсияТитула", 	ВерсияТитула);        
	ПараметрыПроцедуры.Вставить("ПрефиксТитула", 	ПрефиксТитула);        
	
	ПараметрыПроцедуры.Вставить("ТаблицаЗначенийРеквизитов", ТаблицаЗначенийРеквизитов);  
	
	Возврат ПараметрыПроцедуры;
	
КонецФункции    

&НаСервере
Функция ТекущийШагТитула()
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1"), "Оформление");
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2"), "Подтвреждение");
	Соответствие.Вставить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1"), "Оформление");
	
	Возврат Соответствие;
	
КонецФункции

&НаКлиенте 
Процедура ПослеЗаполненияЭПД(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		ПослеЗаполненияЭПДНаСервере(РезультатВыполнения.АдресРезультата);   
		
		ПоказатьЗначение(, ДокументЭПД);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования документов");  
		
	КонецЕсли;  
	
КонецПроцедуры  

&НаСервере
Процедура ПослеЗаполненияЭПДНаСервере(АдресРезультата)
	
	ЗаполненныйДокумент = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	CW_ОбменГИСЭПДДополнительный.ДобавитьСвязанныйДокументЭПД(Объект.Ссылка, ЗаполненныйДокумент);
	ДокументЭПД = CW_ОбменГИСЭПДДополнительный.ПолучитьСвязанныйДокументЭПД(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭПД(Команда)   

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗаполнениеЭПД", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Данные документа будут перезаполнены. 
							   |Продолжить?", Режим, 0);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПродолжитьЗаполнениеЭПД(Результата, ДополнительныеПараметры) Экспорт
    Если Результата = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 
	
	РезультатВыполнения =  ПродолжитьЗаполнениеЭПДВФонеНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПолученияДанныхЭПД", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 	
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьИдентификаторОбъектаМетаданных(ТипПараметраКоманды)

	Возврат ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипПараметраКоманды);
	
КонецФункции

&НаСервере     
Функция ПродолжитьЗаполнениеЭПДВФонеНаСервере() 
	
	ТипОбъекта = ПолучитьИдентификаторОбъектаМетаданных(ТипЗнч(Объект.ОбъектОснование));
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне    = ложь;   
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("ТипДокументаЭПД", Объект.ТипДокументаЭПД);
	РезультатВыбора.Вставить("ТекущийТитул", 	Объект.ТекущийТитул);
	РезультатВыбора.Вставить("ТипОбъекта",  	ТипОбъекта);
	РезультатВыбора.Вставить("ДокументЭПД", 	Объект.Ссылка);

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПараметрКоманды", Объект.ОбъектОснование);
	ПараметрыПроцедуры.Вставить("РезультатВыбора", РезультатВыбора);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ОбменГИСЭПДДополнительный.ПолучитьДанныеДокументаЭПД" ,ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции    

&НаКлиенте 
Процедура ПослеПолученияДанныхЭПД(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		РезультатВыполненя = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		Если ТипЗнч(РезультатВыполненя) <> тип("Структура") Тогда
			Возврат;
		КонецЕсли;   
		
		ВывестиТабличныйДокументНаФорму(РезультатВыполненя.Макет);
		ДанныеКонтактнойИнформации = Новый ФиксированнаяСтруктура(РезультатВыполненя.КонтактнаяИнформация);	
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования документов");  
		
	КонецЕсли;  
	
КонецПроцедуры



  