
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПоказатьВопрос(Новый ОписаниеОповещения("Ответ",ЭтотОбъект,ПараметрКоманды),"Внимание, связь текущего документа и транспортного сообщения будет разорвана!" + Символы.ПС + "Продолжить?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура Ответ(Ответ,Основание) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		 ОбработкаКомандыНаСервере(Основание)	
	КонецЕсли; 	
КонецПроцедуры
 
&НаСервере
Процедура ОбработкаКомандыНаСервере(Основание)
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_ТранспортноеСообщениеВходящееОснования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.CW_DT_ТранспортноеСообщениеВходящее.Основания КАК CW_DT_ТранспортноеСообщениеВходящееОснования
		|ГДЕ
		|	CW_DT_ТранспортноеСообщениеВходящееОснования.Основание = &Основание";
	Запрос.УстановитьПараметр("Основание", Основание);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Сообщить("Связанные сообщения не обнаружены!");
	Иначе 
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОБ = Выборка.Ссылка.ПолучитьОбъект();
			ОБ.Основания.Удалить(ОБ.Основания.Найти(Основание));
			ОБ.Записать();
			Сообщить("Успешно отвязано " + ОБ);
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры

