#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМетаданныеПодписки(ЭлементПодписки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Метаданное КАК Метаданное
	               |ИЗ
	               |	Справочник.CW_ВнешниеПодписки.ИсточникиПодписки КАК CW_ВнешниеПодпискиИсточникиПодписки
	               |ГДЕ
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭлементПодписки);
	
	МассивМетаданных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Метаданное");
	
	Возврат МассивМетаданных;
	
КонецФункции

Функция ПолучитьДанныеВнешнейПдписки(ОбработкаПодписки) Экспорт
	
	СтруктураДанных = Новый Структура("ВидПодписки, МетаданныеПодписки, Версия",Перечисления.CW_ВидыВнешнихПодписок.ПустаяСсылка(), Новый массив, "");
	
	ВнешняяОбработка 	= _ПО.ПолучитьОбработку(ОбработкаПодписки);
	
	Попытка 
		СтруктураДанныхПодписки = ВнешняяОбработка.Информация();
		
		Если  СтруктураДанныхПодписки.Свойство("ИмяВидаПодписки") Тогда
			СтруктураДанных.ВидПодписки =  Перечисления.CW_ВидыВнешнихПодписок[СтруктураДанныхПодписки.ИмяВидаПодписки];
		КонецЕсли;
		
		Если  СтруктураДанныхПодписки.Свойство("МетаданныеПодписки") Тогда
			Для каждого МетаданноеПодписки из СтруктураДанныхПодписки.МетаданныеПодписки Цикл
				СтруктураДанных.МетаданныеПодписки.добавить(CW_Обмены_ПИ.МетаданноеКонфигурации(МетаданноеПодписки));
			КонецЦикла;
		КонецЕсли;
		
		Если  СтруктураДанныхПодписки.Свойство("Версия") Тогда
			СтруктураДанных.Версия = СтруктураДанныхПодписки.Версия;
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецЕсли
