
Процедура ДополнитьДанныеТиповПеревозокНаСервере() Экспорт
	
	Запрос = Новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ 
	|	CW_ТипыПеревозок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ТипыПеревозок КАК CW_ТипыПеревозок
	|ГДЕ
	|	CW_ТипыПеревозок.СлужебныйВыполненПереход = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектТипПеревозоки = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектТипПеревозоки.СлужебныйВыполненПереход = Истина;
		
		//Параметры грузоперевозок
		Для Каждого СтрокаГрупп из ОбъектТипПеревозоки.ГруппыПараметровГрузоперевозки Цикл
			
			Если СтрокаГрупп.Наименование <> "Корень" тогда
				Если Не ЗначениеЗаполнено(СтрокаГрупп.ИдентификаторГруппы) Тогда 
					СтрокаГрупп.ИдентификаторГруппы = Новый УникальныйИдентификатор;
				КонецЕсли;
			КонецЕсли;
			
			мИдентифкаторВедомых =  ЗначениеИзСтрокиВнутр(СтрокаГрупп.ИдентификаторыВедомых);
			Для каждого ПодчиненныйЭлемент Из мИдентифкаторВедомых Цикл
				
				Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда  
					ПодчиненныйЭлементОбъект = ПодчиненныйЭлемент.ПолучитьОбъект();
					Если ПодчиненныйЭлементОбъект = Неопределено Тогда
						Продолжить;
					КонецЕсли;                                                                                            
				Конецесли;
				
				ЭтоГруппа = ТипЗнч(ПодчиненныйЭлемент) = Тип("Число");
				Если ЭтоГруппа Тогда
					ОтборПоИдентификаторуГруппы = Новый Структура("Идентификатор",ПодчиненныйЭлемент);
					мСтроки = ОбъектТипПеревозоки.ГруппыПараметровГрузоперевозки.НайтиСтроки(ОтборПоИдентификаторуГруппы);
				Иначе
					ОтборПоПараметру = Новый Структура("Параметр",ПодчиненныйЭлемент);
					мСтроки = ОбъектТипПеревозоки.ПараметрыГрузоперевозки.НайтиСтроки(ОтборПоПараметру);
				КонецЕсли;
				
				Порядок = мИдентифкаторВедомых.Найти(ПодчиненныйЭлемент);
				Порядок = ?(Порядок = Неопределено,0, Порядок);
	
				Для Каждого СтрокаМассива из мСтроки Цикл
					Если СтрокаМассива.ИдентификаторВладельца <> СтрокаГрупп.ИдентификаторГруппы Тогда
						СтрокаМассива.ИдентификаторВладельца = СтрокаГрупп.ИдентификаторГруппы;
					КонецЕсли;
					СтрокаМассива.Порядок = Порядок;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		//Параметры заявок
		Для Каждого СтрокаГрупп из ОбъектТипПеревозоки.ГруппыПараметровЗаявки Цикл
			
			Если СтрокаГрупп.Наименование <> "Корень" тогда
				Если Не ЗначениеЗаполнено(СтрокаГрупп.ИдентификаторГруппы) Тогда 
					СтрокаГрупп.ИдентификаторГруппы = Новый УникальныйИдентификатор;
				КонецЕсли;
			КонецЕсли;
			
			мИдентифкаторВедомых =  ЗначениеИзСтрокиВнутр(СтрокаГрупп.ИдентификаторыВедомых);
			Для каждого ПодчиненныйЭлемент Из мИдентифкаторВедомых Цикл
				
				Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда  
					ПодчиненныйЭлементОбъект = ПодчиненныйЭлемент.ПолучитьОбъект();
					Если ПодчиненныйЭлементОбъект = Неопределено Тогда
						Продолжить;
					КонецЕсли;                                                                                            
				Конецесли;
				
				ЭтоГруппа = ТипЗнч(ПодчиненныйЭлемент) = Тип("Число");
				Если ЭтоГруппа Тогда
					ОтборПоИдентификаторуГруппы = Новый Структура("Идентификатор",ПодчиненныйЭлемент);
					мСтроки = ОбъектТипПеревозоки.ГруппыПараметровЗаявки.НайтиСтроки(ОтборПоИдентификаторуГруппы);
				Иначе
					ОтборПоПараметру = Новый Структура("Параметр",ПодчиненныйЭлемент);
					мСтроки = ОбъектТипПеревозоки.ПараметрыЗаявки.НайтиСтроки(ОтборПоПараметру);
				КонецЕсли;
				
				Порядок = мИдентифкаторВедомых.Найти(ПодчиненныйЭлемент);
				Порядок = ?(Порядок = Неопределено,0, Порядок);
				
				Для Каждого СтрокаМассива из мСтроки Цикл
					Если СтрокаМассива.ИдентификаторВладельца <> СтрокаГрупп.ИдентификаторГруппы Тогда
						СтрокаМассива.ИдентификаторВладельца = СтрокаГрупп.ИдентификаторГруппы;
					КонецЕсли;
					СтрокаМассива.Порядок = Порядок;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		//Параметры Заказов
		Для Каждого СтрокаГрупп из ОбъектТипПеревозоки.ГруппыПараметровЗаказа Цикл
			
			Если СтрокаГрупп.Наименование <> "Корень" тогда
				Если Не ЗначениеЗаполнено(СтрокаГрупп.ИдентификаторГруппы) Тогда 
					СтрокаГрупп.ИдентификаторГруппы = Новый УникальныйИдентификатор;
				КонецЕсли;
			КонецЕсли;
			
			мИдентифкаторВедомых =  ЗначениеИзСтрокиВнутр(СтрокаГрупп.ИдентификаторыВедомых);
			Для каждого ПодчиненныйЭлемент Из мИдентифкаторВедомых Цикл
				
				Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда  
					ПодчиненныйЭлементОбъект = ПодчиненныйЭлемент.ПолучитьОбъект();
					Если ПодчиненныйЭлементОбъект = Неопределено Тогда
						Продолжить;
					КонецЕсли;                                                                                            
				Конецесли;
				
				ЭтоГруппа = ТипЗнч(ПодчиненныйЭлемент) = Тип("Число");
				Если ЭтоГруппа Тогда
					ОтборПоИдентификаторуГруппы = Новый Структура("Идентификатор",ПодчиненныйЭлемент);
					мСтроки = ОбъектТипПеревозоки.ГруппыПараметровЗаказа.НайтиСтроки(ОтборПоИдентификаторуГруппы);
				Иначе
					ОтборПоПараметру = Новый Структура("Параметр",ПодчиненныйЭлемент);
					мСтроки = ОбъектТипПеревозоки.ПараметрыЗаказа.НайтиСтроки(ОтборПоПараметру);
				КонецЕсли;
				
				Порядок = мИдентифкаторВедомых.Найти(ПодчиненныйЭлемент);
				Порядок = ?(Порядок = Неопределено,0, Порядок);
				
				Для Каждого СтрокаМассива из мСтроки Цикл
					Если СтрокаМассива.ИдентификаторВладельца <> СтрокаГрупп.ИдентификаторГруппы Тогда
						СтрокаМассива.ИдентификаторВладельца = СтрокаГрупп.ИдентификаторГруппы;
					КонецЕсли;
					СтрокаМассива.Порядок = Порядок;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ОбъектТипПеревозоки.ОбменДанными.Загрузка = Истина;
		ОбъектТипПеревозоки.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
