// Заполняет основные сведения о библиотеке или основной конфигурации.
// 
// Параметры:
//  Описание - Структура:
//
//   * Имя                 - Строка - имя подсисетмы, например, "CW_БухгалтерияЭкспедитора".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
Процедура ПриДобавленииПодсистем(ОписаниеПодсистем) Экспорт
	
	ОписаниеПодсистем.Вставить("CW_ДоходыНерезидентов", "8.3.5.9");
	
КонецПроцедуры  
  
Процедура  ПолучитьШаблоныТекстовHTTPЗапросов(Результат) Экспорт

	Результат.Вставить("inc_disable",		"/%1/hs/inc/disable");  
	Результат.Вставить("inc_reginfo",		"/%1/hs/inc/reginfo");  
	Результат.Вставить("inc_used",			"/%1/hs/inc/used");  
	Результат.Вставить("inc_rates",			"/%1/hs/inc/rates");  
	Результат.Вставить("inc_info",			"/%1/hs/inc/info");  
	Результат.Вставить("inc_activation",	"/%1/hs/inc/activation");    
	Результат.Вставить("inc_autoinvoice",	"/%1/hs/inc/autoinvoice");    
	
КонецПроцедуры  


//Профиль доступа 
Процедура ОбновитьПрофилиПользователей(ПараметрыПроцедуры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПолучитьФункциональнуюОпцию("CW_ДоходыНерезидентовИспользуется") Тогда  
		
		Модуль_CW_ДоходыНерезидентовСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_ДоходыНерезидентовСервер");
		Профиль = Модуль_CW_ДоходыНерезидентовСервер.СоздатьПрофильДоступа();
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РегистрСведенийCW_ПараметрыПользователей.Пользователь КАК Пользователь,
		|	ЕСТЬNULL(ГруппыДоступа.Ссылка, НЕОПРЕДЕЛЕНО) КАК ПерсональнаяГруппаДоступа
		|ИЗ
		|	РегистрСведений.CW_ПараметрыПользователей КАК РегистрСведенийCW_ПараметрыПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|		ПО РегистрСведенийCW_ПараметрыПользователей.Пользователь = ГруппыДоступа.Пользователь
		|			И (ГруппыДоступа.Профиль = &Профиль)
		|ГДЕ
		|	РегистрСведенийCW_ПараметрыПользователей.Группа = &Группа"; 
		
		Запрос.УстановитьПараметр("Группа", 	ПараметрыПроцедуры.ГруппаПользователей);
		Запрос.УстановитьПараметр("Профиль", 	Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл  
			
			Если ЗначениеЗаполнено(Выборка.ПерсональнаяГруппаДоступа) тогда
				ОбъектГруппаДоступа = Выборка.ПерсональнаяГруппаДоступа.ПолучитьОбъект();
				ОбъектГруппаДоступа.ПометкаУдаления = Ложь;   
			Иначе
				ОбъектГруппаДоступа = Справочники.ГруппыДоступа.СоздатьЭлемент();
				ОбъектГруппаДоступа.Родитель     	= Справочники.ГруппыДоступа.РодительПерсональныхГруппДоступа();
				ОбъектГруппаДоступа.Наименование 	= "Сервис ""Доходы нерезидентов""";
				ОбъектГруппаДоступа.Профиль 		= Профиль;
				ОбъектГруппаДоступа.Пользователь 	= Выборка.Пользователь;
				ОбъектГруппаДоступа.Комментарий 	= "Обеспечивает доступ к данным сервиса ""Доходы нерезидентов""";    
			КонецЕсли; 
			
			ОбъектГруппаДоступа.Пользователи.Очистить(); 
			
			Если ПараметрыПроцедуры.ДоходыНерезидентов Тогда
				ОбъектГруппаДоступа.Пользователи.Добавить().Пользователь = Выборка.Пользователь;
			КонецЕсли;	
			
			ОбъектГруппаДоступа.Записать();
			
		КонецЦикла; 
		
	КонецЕсли;   
	
КонецПроцедуры

Функция СоздатьПрофильДоступа() Экспорт
	
	ИдентификаторПрофиля = CW_ДоходыНерезидентовСервер.ПолучитьИдентификаторПрофиляГруппыДоступа();
	
	СсылкаПрофиль = Справочники.ПрофилиГруппДоступа.НайтиПоРеквизиту("ИдентификаторПоставляемыхДанных", ИдентификаторПрофиля);  
	Если СсылкаПрофиль.Пустая() Тогда
		ИдентификаторОбъектаМетаданныхРоль = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Роли.CW_ДоходыНерезидентовИспользованиеСервиса);
		
		// создаем новый профиль доступа
		НовыйПрофиль = Справочники.ПрофилиГруппДоступа.СоздатьЭлемент();
		НовыйПрофиль.Наименование = "Сервис ""Доходы нерезидентов""";
		НовыйПрофиль.Комментарий  = "Доступ к сервису ""Доходы нерезидентов"""; 
		НовыйПрофиль.ИдентификаторПоставляемыхДанных =  ИдентификаторПрофиля;
		
		НоваяСтрока 		= НовыйПрофиль.Роли.Добавить();
		НоваяСтрока.Роль 	= ИдентификаторОбъектаМетаданныхРоль; 
		
		СтрокаНазначение = НовыйПрофиль.Назначение.Добавить();
		СтрокаНазначение.ТипПользователей = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		
		НовыйПрофиль.Записать(); 
		
		СсылкаПрофиль = НовыйПрофиль.Ссылка;
		
	КонецЕсли; 
	
	Возврат СсылкаПрофиль;
	
КонецФункции   

Функция ПолучитьИдентификаторПрофиляГруппыДоступа() Экспорт

	Возврат Новый УникальныйИдентификатор("9150fcf6-1914-466e-8b8f-415e2dbbfdb6");
	
КонецФункции  
//Профиль доступа     

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Форма.ИспользуетсяСервисДоходыНерезидентов = ПолучитьФункциональнуюОпцию("CW_ДоходыНерезидентовИспользуется");
	
КонецПроцедуры

//Реклама
Процедура УстановитьПоказыватьРекламуПриСтартеПользователя(ЗначениеФлага, ИмяПользователя = Неопределено) Экспорт

	КлючОбъекта = ВРег("CW_ДоходыНерезидентовПоказРекламы");
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "", ЗначениеФлага,, ИмяПользователя);

КонецПроцедуры

Функция ПоказыватьРекламуПриСтартеПользователя(ИмяПользователя = Неопределено) Экспорт

	КлючОбъекта = ВРег("CW_ДоходыНерезидентовПоказРекламы");

	Результат = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,"",, ИмяПользователя);
	
	Если ТипЗнч(Результат) <> Тип("Булево") Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьНастройкуПоказаРекламы(ИмяПользователя = Неопределено) Экспорт
	
	КлючОбъекта = ВРег("CW_ДоходыНерезидентовПоказРекламы");

	ХранилищеОбщихНастроек.Удалить(КлючОбъекта,"", ИмяПользователя);
	
КонецПроцедуры
//Реклама



Процедура ПолучитьСчетНаПродлениеПодписки(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("software",		XMLСтрока(ПараметрыПроцедуры.ПрограммныйПродукт));
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(ПараметрыПроцедуры.РегистрационныйНомер));
	СтруктураJSON.Вставить("rateid",		XMLСтрока(ПараметрыПроцедуры.ИдентифкаторТарифа));
	СтруктураJSON.Вставить("startdate",		XMLСтрока(ПараметрыПроцедуры.ДатаНачала));
	СтруктураJSON.Вставить("months",		XMLСтрока(ПараметрыПроцедуры.КоличествоМесяцев));	
	СтруктураJSON.Вставить("count",			XMLСтрока(ПараметрыПроцедуры.Количество));	
	СтруктураJSON.Вставить("email",			XMLСтрока(ПараметрыПроцедуры.АдресПолучателя));

	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_paymentinvoice", СтруктураJSON);

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");   
	Если Ответ = Неопределено Тогда  
		КодСостояния	= 503;
		ТекстСостояния 	= "Сервис временно недоступен";
	Иначе
		КодСостояния	= Ответ.КодСостояния;
		ТекстСостояния 	= Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("КодСостояния",	КодСостояния);
	СтруктураОтвета.Вставить("ТекстСостояния",	ТекстСостояния);
	
	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресРезультата);
	
КонецПроцедуры

Функция ПолучитьРегистрационнуюИнформациюСервиса() Экспорт
	
	СтруктураОтвет 			= Новый Структура;
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("service",	"ДоходыНерезидентов");
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("inc_reginfo", СтруктураJSON);
	
	Если ПараметрыHTTPЗапроса.УказаныРегистрационныеДанные Тогда
		
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET"); 
		
		Если Ответ = Неопределено Тогда 
			ЗаписьЖурналаРегистрации("CW_ДоходыНерезидентов", УровеньЖурналаРегистрации.Ошибка,,,"Отсутствует интернет-соединение!",);
		Иначе
			
			Сообщение = Ответ.ПолучитьТелокакСтроку();
			
			Если Ответ.КодСостояния <> 200 Тогда    
				Если ПустаяСтрока(Сообщение) Тогда
					ОписаниеКодовСостояний 	= CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
					Сообщение = "Код ошибки: "+ Ответ.КодСостояния +" - "+ ОписаниеКодовСостояний.Получить(Ответ.КодСостояния); 
				КонецЕсли;  
				ЗаписьЖурналаРегистрации("Доходы нерезидента", УровеньЖурналаРегистрации.Ошибка,,,Сообщение,);
			Иначе
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(Сообщение);  
				
				СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
				ЧтениеJSON.Закрыть(); 
				
				СтруктураОтвет.Вставить("ДатаНачала", 		XMLЗначение(Тип("Дата"),	СтруктураJSON.ДатаНачала));
				СтруктураОтвет.Вставить("ДатаОкончания", 	XMLЗначение(Тип("Дата"),	СтруктураJSON.ДатаОкончания));
				СтруктураОтвет.Вставить("РегНомер",			XMLЗначение(Тип("Строка"),	СтруктураJSON.РегНомер));	
				СтруктураОтвет.Вставить("НазваниеКомпании",	XMLЗначение(Тип("Строка"),	СтруктураJSON.НазваниеКомпании));	
				СтруктураОтвет.Вставить("ТекущийТариф",		XMLЗначение(Тип("Строка"),	СтруктураJSON.ТекущийТариф));	
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураОтвет;
		
КонецФункции

//Создание дополнительных реквизитов
Процедура СоздатьРеквизиты2023Кв4() Экспорт  
	
	МакетСоставаПоказателей = Отчеты.РегламентированныйОтчетДоходыИностраннымОрганизациям.ПолучитьМакет("СпискиВыбора2023Кв4");
	
	КоллекцияСписковВыбора = Новый Соответствие;
	Для Каждого Область Из МакетСоставаПоказателей.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
			ВерхОбласти = Область.Верх;
			НизОбласти = Область.Низ;
			ТаблСписка = Новый ТаблицаЗначений;
			ТаблСписка.Колонки.Добавить("Код",,,
			МакетСоставаПоказателей.Область(ВерхОбласти, 1, ВерхОбласти, 1).ШиринаКолонки);
			ТаблСписка.Колонки.Добавить("Название",,,
			МакетСоставаПоказателей.Область(ВерхОбласти, 2, ВерхОбласти, 2).ШиринаКолонки);
			Для НомСтр = ВерхОбласти По НизОбласти Цикл
				КодПоказателя = СокрП(МакетСоставаПоказателей.Область(НомСтр, 1).Текст);
				Если КодПоказателя <> "###" Тогда
					НовСтрока = ТаблСписка.Добавить();
					НовСтрока.Код = КодПоказателя;
					НовСтрока.Название = СокрП(МакетСоставаПоказателей.Область(НомСтр, 2).Текст);
				КонецЕсли;
			КонецЦикла;
			КоллекцияСписковВыбора.Вставить(Область.Имя, ТаблСписка);
		КонецЕсли;
	КонецЦикла;  
	
	ИменаДополнительныхРеквизитов = Новый Структура; 
	ИменаДополнительныхРеквизитов.Вставить("ПризнакНаличияВедомостиБанковскогоКонтроля", 		СвойстваПризнакНаличияВедомостиБанковскогоКонтроля(КоллекцияСписковВыбора));
	ИменаДополнительныхРеквизитов.Вставить("НомерВедомостиБанковскогоКонтроля", 				СвойстваНомерВедомостиБанковскогоКонтроля());
	ИменаДополнительныхРеквизитов.Вставить("КодДохода", 										СвойстваКодДохода(КоллекцияСписковВыбора));
	ИменаДополнительныхРеквизитов.Вставить("СимволДохода", 										СвойстваСимволДохода(КоллекцияСписковВыбора));
	ИменаДополнительныхРеквизитов.Вставить("ОснованиеОсвобожденияОтИсчисленияИУдержанияНалога", СвойстваОснованиеОсвобожденияОтИсчисленияИУдержанияНалога(КоллекцияСписковВыбора));
	
	Для Каждого КлючЗначение из ИменаДополнительныхРеквизитов Цикл   
		
		ДанныеДопРеквизита = КлючЗначение.Значение;
		
		НайденнаяСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", КлючЗначение.Ключ);  
		УстановитьСсылкуНового = ложь;
		Если НайденнаяСсылка.Пустая() Тогда 
			ДополнительныеРеквизитыОбъект =  ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
			НайденнаяСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(Новый УникальныйИдентификатор); 
			УстановитьСсылкуНового = Истина;
		Иначе
			ДополнительныеРеквизитыОбъект =  НайденнаяСсылка.ПолучитьОбъект();
		КонецЕсли; 
		
		ЗаполнитьЗначенияСвойств(ДополнительныеРеквизитыОбъект, ДанныеДопРеквизита); 
		
		Если ТипЗнч(ДанныеДопРеквизита.Значения) = Тип("ТаблицаЗначений")
			и ДанныеДопРеквизита.Значения.Количество() > 0 Тогда
			
			Для Каждого СтрокаТаблицы из ДанныеДопРеквизита.Значения Цикл   
				
				СтрокаТаблицыКод = ?(ПустаяСтрока(СтрокаТаблицы.Код), "<Пустое значение>", СтрокаТаблицы.Код);
				
				СсылкаЗначенияСвойствОбъектов  = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТаблицыКод,,,НайденнаяСсылка); 
				Если Не СсылкаЗначенияСвойствОбъектов.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				
				ОбъектЗначенияСвойствОбъектов =  Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
				ОбъектЗначенияСвойствОбъектов.Владелец 				= НайденнаяСсылка;
				ОбъектЗначенияСвойствОбъектов.Наименование			= СтрокаТаблицыКод;
				ОбъектЗначенияСвойствОбъектов.ПолноеНаименование 	= СтрокаТаблицы.Название;
				ОбъектЗначенияСвойствОбъектов.Записать();	
				
			КонецЦикла; 
			
		КонецЕсли;    
		
		Если УстановитьСсылкуНового Тогда
			ДополнительныеРеквизитыОбъект.УстановитьСсылкуНового(НайденнаяСсылка);
		КонецЕсли;
		
		ДополнительныеРеквизитыОбъект.Записать();   
		
		
		СсылкаНаборСвойств 	= ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ДоговорыКонтрагентов");	
		НаборСвойств		= СсылкаНаборСвойств.ПолучитьОбъект();
		
		НайденнаяСтрока = НаборСвойств.ДополнительныеРеквизиты.Найти(ДополнительныеРеквизитыОбъект.Ссылка, "Свойство");
		Если НайденнаяСтрока = Неопределено Тогда
			НайденнаяСтрока =  НаборСвойств.ДополнительныеРеквизиты.Добавить();
			НайденнаяСтрока.Свойство =  ДополнительныеРеквизитыОбъект.Ссылка;
		КонецЕсли;
		
		НайденнаяСтрока.ПометкаУдаления = Ложь;
		
		НаборСвойств.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция СвойстваПризнакНаличияВедомостиБанковскогоКонтроля(КоллекцияСписковВыбора)

	ТаблицаЗначений = КоллекцияСписковВыбора["ПризнакиДаНет"];   
	
	НовыйУникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	НовыйУникальныйИдентификатор = СтрЗаменить(НовыйУникальныйИдентификатор, "-", "");
	Имя = "ПризнакНаличияВедомостиБанковскогоКонтроля_"+НовыйУникальныйИдентификатор;
	
	Структура = Новый Структура;
	Структура.Вставить("Заголовок", 				"Признак наличия ведомости банковского контроля");   
	Структура.Вставить("Наименование", 				"Признак наличия ведомости банковского контроля");   
	Структура.Вставить("ИдентификаторДляФормул", 	"ПризнакНаличияВедомостиБанковскогоКонтроля");   
	Структура.Вставить("Подсказка", 				"Признак наличия ведомости банковского контроля");   
	Структура.Вставить("Комментарий", 				"Признак наличия ведомости банковского контроля");   
	Структура.Вставить("Виден",						Истина);
	Структура.Вставить("Доступен",					Истина);
	Структура.Вставить("Имя", 						Имя);   
	Структура.Вставить("ТипЗначения", 				Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));
	Структура.Вставить("ВидСвойств",				ПредопределенноеЗначение("Перечисление.ВидыСвойств.ДополнительныеРеквизиты"));
	Структура.Вставить("НаборСвойств",				ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ДоговорыКонтрагентов"));
	Структура.Вставить("Значения",					ТаблицаЗначений);
	Структура.Вставить("ДополнительныеЗначенияИспользуются", Истина);
	
	Возврат Структура; 
	
КонецФункции

Функция СвойстваНомерВедомостиБанковскогоКонтроля()  
	
	НовыйУникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	НовыйУникальныйИдентификатор = СтрЗаменить(НовыйУникальныйИдентификатор, "-", "");
	Имя = "НомерВедомостиБанковскогоКонтроля_"+НовыйУникальныйИдентификатор;
	
	Структура = Новый Структура;
	Структура.Вставить("Заголовок", 				"Номер ведомости банковского контроля");   
	Структура.Вставить("Наименование", 				"Номер ведомости банковского контроля");   
	Структура.Вставить("ИдентификаторДляФормул", 	"НомерВедомостиБанковскогоКонтроля");   
	Структура.Вставить("Подсказка", 				"Номер ведомости банковского контроля в формате: 99999999/9999/9999/9/9");   
	Структура.Вставить("Комментарий", 				"Номер ведомости банковского контроля в формате: 99999999/9999/9999/9/9");   
	Структура.Вставить("Виден",						Истина);
	Структура.Вставить("Доступен",					Истина);
	Структура.Вставить("Имя", 						Имя);   
	Структура.Вставить("ТипЗначения", 				Новый ОписаниеТипов("Строка"));
	Структура.Вставить("ВидСвойств",				ПредопределенноеЗначение("Перечисление.ВидыСвойств.ДополнительныеРеквизиты"));
	Структура.Вставить("НаборСвойств",				ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ДоговорыКонтрагентов"));
	Структура.Вставить("Значения",					Неопределено);
	Структура.Вставить("ДополнительныеЗначенияИспользуются", Ложь);
	
	Возврат Структура; 
	
КонецФункции

Функция СвойстваОснованиеОсвобожденияОтИсчисленияИУдержанияНалога(КоллекцияСписковВыбора)
	
	ТаблицаЗначений = КоллекцияСписковВыбора["ОснованияОсвобожденияОтУплНал"];
	
	НовыйУникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	НовыйУникальныйИдентификатор = СтрЗаменить(НовыйУникальныйИдентификатор, "-", "");
	Имя = "ОснованиеОсвобожденияОтИсчисленияИУдержанияНалога_"+НовыйУникальныйИдентификатор;

	Структура = Новый Структура;
	Структура.Вставить("Заголовок", 				"Основание освобождения от исчисления и удержания налога");   
	Структура.Вставить("Наименование", 				"Основание освобождения от исчисления и удержания налога");   
	Структура.Вставить("ИдентификаторДляФормул", 	"ОснованиеОсвобожденияОтИсчисленияИУдержанияНалога");   
	Структура.Вставить("Подсказка", 				"Основание освобождения от исчисления и удержания налога");   
	Структура.Вставить("Комментарий", 				"Основание освобождения от исчисления и удержания налога");   
	Структура.Вставить("Виден",						Истина);
	Структура.Вставить("Доступен",					Истина);
	Структура.Вставить("Имя", 						Имя);   
	Структура.Вставить("ТипЗначения", 				Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));
	Структура.Вставить("ВидСвойств",				ПредопределенноеЗначение("Перечисление.ВидыСвойств.ДополнительныеРеквизиты"));
	Структура.Вставить("НаборСвойств",				ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ДоговорыКонтрагентов"));
	Структура.Вставить("Значения",					ТаблицаЗначений);
	Структура.Вставить("ДополнительныеЗначенияИспользуются", Истина);
	
	Возврат Структура; 
	
КонецФункции

Функция СвойстваКодДохода(КоллекцияСписковВыбора)
	
	ТаблицаЗначений = КоллекцияСписковВыбора["КодыДоходаПодр42"];

	НовыйУникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	НовыйУникальныйИдентификатор = СтрЗаменить(НовыйУникальныйИдентификатор, "-", "");
	Имя = "КодДохода_"+НовыйУникальныйИдентификатор;
	
	Структура = Новый Структура;
	Структура.Вставить("Заголовок", 				"Код дохода");   
	Структура.Вставить("Наименование", 				"Код дохода");   
	Структура.Вставить("ИдентификаторДляФормул", 	"КодДохода");   
	Структура.Вставить("Подсказка", 				"Код дохода");   
	Структура.Вставить("Комментарий", 				"Код дохода");   
	Структура.Вставить("Виден",						Истина);
	Структура.Вставить("Доступен",					Истина);
	Структура.Вставить("Имя", 						Имя);   
	Структура.Вставить("ТипЗначения", 				Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));
	Структура.Вставить("ВидСвойств",				ПредопределенноеЗначение("Перечисление.ВидыСвойств.ДополнительныеРеквизиты"));
	Структура.Вставить("НаборСвойств",				ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ДоговорыКонтрагентов"));
	Структура.Вставить("Значения",					ТаблицаЗначений);
	Структура.Вставить("ДополнительныеЗначенияИспользуются", Истина);
	
	Возврат Структура; 

КонецФункции     

Функция СвойстваСимволДохода(КоллекцияСписковВыбора)
	
	ТаблицаЗначений = КоллекцияСписковВыбора["СимволыДохода"];

	НовыйУникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	НовыйУникальныйИдентификатор = СтрЗаменить(НовыйУникальныйИдентификатор, "-", "");
	Имя = "СимволДохода_"+НовыйУникальныйИдентификатор;
	
	Структура = Новый Структура;
	Структура.Вставить("Заголовок", 				"Символ дохода");   
	Структура.Вставить("Наименование", 				"Символ дохода");   
	Структура.Вставить("ИдентификаторДляФормул", 	"СимволДохода");   
	Структура.Вставить("Подсказка", 				"Символ дохода");   
	Структура.Вставить("Комментарий", 				"Символ дохода");   
	Структура.Вставить("Виден",						Истина);
	Структура.Вставить("Доступен",					Истина);
	Структура.Вставить("Имя", 						Имя);   
	Структура.Вставить("ТипЗначения", 				Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));
	Структура.Вставить("ВидСвойств",				ПредопределенноеЗначение("Перечисление.ВидыСвойств.ДополнительныеРеквизиты"));
	Структура.Вставить("НаборСвойств",				ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_ДоговорыКонтрагентов"));
	Структура.Вставить("Значения",					ТаблицаЗначений);
	Структура.Вставить("ДополнительныеЗначенияИспользуются", Истина);
	
	Возврат Структура; 

КонецФункции  
//Создание дополнительных реквизитов

Процедура МониторПоддержкиПолучитьИнформацию(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	СервисИспользуется = Константы.CW_ДоходыНерезидентовИспользуется.Получить();
	
	ДанныеСервиса = Новый Структура;
	ДанныеСервиса.Вставить("Используется",   			СервисИспользуется); 
	ДанныеСервиса.Вставить("Ошибка", 					Ложь);	
	ДанныеСервиса.Вставить("СоответствуетМинимальной", 	Ложь);	
	ДанныеСервиса.Вставить("ИгнорироватьМинимальнуюВерсию",		Ложь);	
	ДанныеСервиса.Вставить("ИгнорироватьРекомендуемуюВервсию", 	Ложь);	
	ДанныеСервиса.Вставить("МинимальнаяВерсия", 			"<...>");	
	ДанныеСервиса.Вставить("РекомендуемаяВерсия", 			"<...>");	
	ДанныеСервиса.Вставить("Тариф", 						"<...>");	
	ДанныеСервиса.Вставить("ДатаНачала", 					"<...>");	
	ДанныеСервиса.Вставить("ДатаОкончания", 				"<...>");	
	ДанныеСервиса.Вставить("АвтоматическиВыписыватьСчета",	Ложь); 
	
	Если СервисИспользуется Тогда
		Результат = СведенияСервисеДоходыНерезидентов();
		
		Если Результат = Неопределено или Результат.КодСостояния <> 200 Тогда
			ДанныеСервиса.Вставить("Ошибка", Истина);
		Иначе
			ДанныеСервиса.Вставить("МинимальнаяВерсия", 				Результат.МинимальнаяВерсия);	
			ДанныеСервиса.Вставить("РекомендуемаяВерсия", 				Результат.РекомендуемаяВерсия);	
			ДанныеСервиса.Вставить("СоответствуетМинимальной", 			Результат.СоответствуетМинимальной);	
			ДанныеСервиса.Вставить("ИгнорироватьМинимальнуюВерсию", 	Результат.ИгнорироватьМинимальнуюВерсию);	
			ДанныеСервиса.Вставить("ИгнорироватьРекомендуемуюВервсию", 	Результат.ИгнорироватьРекомендуемуюВервсию);	
			ДанныеСервиса.Вставить("АвтоматическиВыписыватьСчета", 		Результат.АвтоматическиВыписыватьСчета);	
			
			ДанныеСервиса.Вставить("Тариф", 			Результат.Тариф);	
			ДанныеСервиса.Вставить("ДатаНачала", 		Результат.ДатаНачала);	
			ДанныеСервиса.Вставить("ДатаОкончания", 	Результат.ДатаОкончания);	
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ДанныеСервиса, АдресРезультата);
	
КонецПроцедуры

Функция СведенияСервисеДоходыНерезидентов() Экспорт
	
	Результат = Новый Структура;   
	Результат.Вставить("КодСостояния",				Неопределено);
	Результат.Вставить("МинимальнаяВерсия",			"<...>"); 
	Результат.Вставить("РекомендуемаяВерсия",		"<...>"); 
	Результат.Вставить("Тариф",			 			"<...>"); 
	Результат.Вставить("ДатаНачала",				"<...>"); 
	Результат.Вставить("ДатаОкончания",	 			"<...>"); 
 	Результат.Вставить("Состояние",	 				"<...>"); 
	Результат.Вставить("СоответствуетМинимальной",			Ложь); 
    Результат.Вставить("ИгнорироватьМинимальнуюВерсию",		Ложь); 
	Результат.Вставить("ИгнорироватьРекомендуемуюВервсию",	Ложь); 
 	Результат.Вставить("АвтоматическиВыписыватьСчета",		Ложь); 

	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	Если ПустаяСтрока(РегистрационныйНомер) Тогда
		Результат.Вставить("КодСостояния",	403);
		Результат.Вставить("Состояние",		"Программный продукт не зарегистрирован!");
		Возврат Результат;
	КонецЕсли;
	
	versionaf = CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы(); 
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("versionaf",	XMLСтрока(versionaf));
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер)); 

	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("inc_info", СтруктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат.Вставить("КодСостояния", Ответ.КодСостояния);
	
	Если Ответ.КодСостояния = 200 Тогда
		
		Тело = Ответ.ПолучитьТелоКакСтроку();  
		
		СтруктураОтветJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);
		
		Результат.Вставить("МинимальнаяВерсия",			XMLЗначение(тип("Строка"), 	СтруктураОтветJSON.minversionaf)); 
		Результат.Вставить("РекомендуемаяВерсия",		XMLЗначение(тип("Строка"), 	СтруктураОтветJSON.recversionaf)); 
		Результат.Вставить("Тариф",			 			XMLЗначение(тип("Строка"), 	СтруктураОтветJSON.rate)); 
		Результат.Вставить("ДатаНачала",				XMLЗначение(тип("Дата"), 	СтруктураОтветJSON.startdate)); 
		Результат.Вставить("ДатаОкончания",	 			XMLЗначение(тип("Дата"), 	СтруктураОтветJSON.enddate)); 
		Результат.Вставить("СоответствуетМинимальной",	XMLЗначение(тип("Булево"), 	СтруктураОтветJSON.respondmin)); 
		
		Результат.Вставить("ИгнорироватьМинимальнуюВерсию",		XMLЗначение(тип("Булево"), 	СтруктураОтветJSON.ignoreminversionaf));	
		Результат.Вставить("ИгнорироватьРекомендуемуюВервсию", 	XMLЗначение(тип("Булево"), 	СтруктураОтветJSON.ignorerecversionaf));	
		Результат.Вставить("АвтоматическиВыписыватьСчета",		XMLЗначение(Тип("Булево"),	СтруктураОтветJSON.autoinvoice));  
		
	КонецЕсли;
	
	Возврат Результат;   
	
КонецФункции


Процедура ОбновитьДанныеАвтоматическойВыпискиСчетов(ПараметрыПроцедуры, АдресРезультата) Экспорт

	Результат = Новый Структура;
	
	СервисИспользуется = Константы.CW_ДоходыНерезидентовИспользуется.Получить();
	
	Если СервисИспользуется Тогда 
		
		РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
		Если ПустаяСтрока(РегистрационныйНомер) Тогда
			Результат.Вставить("КодСостояния",	403);
			Результат.Вставить("Состояние",		"Программный продукт не зарегистрирован!");
		Иначе
			
			versionaf = CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы(); 
			
			СтруктураJSON = Новый Структура;
			СтруктураJSON.Вставить("regnumber",		XMLСтрока(РегистрационныйНомер)); 
			СтруктураJSON.Вставить("autoinvoice",	XMLСтрока(ПараметрыПроцедуры.Значение)); 
			
			ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("inc_autoinvoice", СтруктураJSON);
			
			Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");
			Результат.Вставить("КодСостояния", 	Ответ.КодСостояния);
			Результат.Вставить("Состояние", 	Ответ.ПолучитьтелоКакСтроку());
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры  



