&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НачалоПериода",Отчет.НачалоПериода);
	Параметры.Свойство("КонецПериода",Отчет.КонецПериода);
	
	Если ЗначениеЗаполнено(Отчет.НачалоПериода) И ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		СформироватьПриОткрытии = Истина;
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.НастройкиОтчета.Пометка = Истина;
	
	Если НЕ ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Отчет.НачалоПериода = '20120101';
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Отчет.КонецПериода = ТекущаяДата();	
	КонецЕсли; 
	
	Если СформироватьПриОткрытии Тогда
		СкрытьНастройки();
		СформироватьОтчет_Сервер();
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура НастройкиОтчета(Команда)
	
	Если Элементы.НастройкиОтчета.Пометка Тогда
		СкрытьНастройки();
	Иначе
		ПоказатьНастройки();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()
	
	Элементы.ГруппаНастройки.Видимость = Ложь;
	Элементы.НастройкиОтчета.Пометка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки()
	
	Элементы.ГруппаНастройки.Видимость = Истина;
	Элементы.НастройкиОтчета.Пометка = Истина;
	
КонецПроцедуры
	
// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыбПериодНажатие(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = Отчет.НачалоПериода;
	Диалог.Период.ДатаОкончания = Отчет.КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	
	Если ОтветПериод <> Неопределено Тогда
		Отчет.НачалоПериода = НачалоДня(ОтветПериод.ДатаНачала);
		Отчет.КонецПериода  = КонецДня(ОтветПериод.ДатаОкончания);
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	СкрытьНастройки();
	СформироватьОтчет_Сервер();
		
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет_Сервер()
	
	ЭтаФорма.Результат.Очистить();
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СформироватьОтчет(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если (Элемент.ТекущаяОбласть.Лево > 4) Тогда
		
		СтандартнаяОбработка = Ложь;
		// --- 
		ПФ = Новый Структура("Касса,НачалоПериода,КонецПериода",Расшифровка,Отчет.НачалоПериода,Отчет.КонецПериода);
		ОткрытьФорму("Отчет.CW_ОтчетПоКассе.Форма",ПФ);
		
	КонецЕсли;  
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 


