
&НаКлиенте
Процедура РедактироватьФормулу(Команда)
	
	ПараметрыРедактирования = Новый Структура;
	ПараметрыРедактирования.Вставить("Формула"				, Объект.ФормулаРасчета);
	ПараметрыРедактирования.Вставить("НаименованиеФормулы"	, Объект.Наименование);
	
	Оповещение = Новый ОписаниеОповещения("ИзменитьФормулуЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CW_РедактированиеФормулыРасчетаНормыРасходаТоплива", ПараметрыРедактирования, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормулуЗавершение(РезультатРедактирования, ДополнительныеПараметры) Экспорт 
	
	Если РезультатРедактирования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ФормулаРасчета = РезультатРедактирования.ФормулаРасчета Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.ФормулаРасчета = РезультатРедактирования.ФормулаРасчета;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФормулуПоУмолчанию(Команда)
	Объект.ФормулаРасчета = "0.01 *((НормаРасходаТопливаНаПробег + НормаРасходаНаМассуПрицепа* ВесПрицепа) * ПробегАвтомобиля + НормаРасходаНаТранспортнуюРаботу * (ВесГруза * ПробегАвтомобиляСГрузом)) * (1 +0.01 * (ИндивидуальныйКоэффициент + КоэффициентУсловий + КоэффициентТемпературы))";
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти