
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)  
	
	
	СтруктураПисьма = ПодготовитьДанныеПисьма();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураПисьма", СтруктураПисьма);
	
	ОткрытьФорму("Обработка.CW_ОтправкаПочты.Форма", ПараметрыФормы);

КонецПроцедуры  


&НаСервере
Функция ПодготовитьДанныеПисьма()   
	
	ИнформциюОСистеме 		= ПолучитьИнформциюОСистеме();  
	НастройкиПользователя 	= CW_Настройки.ПолучитьНастройкиПользователя();
	
	СтруктураПисьма 			= _ЭП.СтруктураПисьма();
	СтруктураПисьма.Отправитель = НастройкиПользователя.УчетнаяЗаписьЭлектроннойПочты;

	_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели,"buhexp@coralway.ru");
	
	стрКав = """";
	ТекстПисьма = "<html>
	|<head></head>
	|<body>
	|<div>Регистрационный номер: <b>" + ИнформциюОСистеме.РегистрационныйНомер + "</b></div>
	|<div>Организация: <b>" + ИнформциюОСистеме.Организация + " ИНН: " + ИнформциюОСистеме.ИНН + "</b></div>
	|<div>Релиз модуля "+ стрКав + ИнформциюОСистеме.НаименованиеМодуля + стрКав + ": <b>" + ИнформциюОСистеме.ВерсияМодуля + "</b></div>
	|<div>Релиз конфигурации " + стрКав + ИнформциюОСистеме.НаименованиеОсновнойПоставки + стрКав + ": <b>" + ИнформциюОСистеме.ВерсияОсновнойПоставки +  "</b></div>
	|<div>Релиз платформы " +стрКав +"1С:Предприятие " + Лев(ИнформциюОСистеме.ВерсияПриложения, 3) + стрКав + ": <b>" + ИнформциюОСистеме.ВерсияПриложения + "</b></div>
	|<div><br></div>
	|<div><br></div>
	|<div>Вопрос по программе или описание возникшей ситуации:</div>
	|<div><br></div>
	|<div><br></div>
	|<div>"	+ НастройкиПользователя.Должность + "</div>
	|<div><b>" 	+ ?(ПустаяСтрока(НастройкиПользователя.ФИО), СокрЛП(ПараметрыСеанса.ТекущийПользователь), НастройкиПользователя.ФИО) + "</b></div>
	|<div>Телефон: "+ НастройкиПользователя.СлужебныйТелефон + "</div>
	|<div>E-mail: "	+ НастройкиПользователя.УчетнаяЗаписьЭлектроннойПочты.ПочтовыйАдрес+"</div>
	|</body>
	|</html>";
	
	СтруктураТекста = Новый Структура;
	СтруктураТекста.Вставить("Текст", ТекстПисьма); 
	СтруктураТекста.Вставить("ТипТекста", "HTML"); 
	
	СтруктураПисьма.Тексты.Добавить(СтруктураТекста);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураПисьма, Новый УникальныйИдентификатор);
	
КонецФункции


&НаСервере
Функция ПолучитьИнформциюОСистеме()  
	
	Структура = Новый Структура;  
	
	//Даные ключа
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	Организация 			= CW_ПроверкаЛицензии.ПолучитьНазваниеОрганизации();
	//Даные ключа                                                                 
	
	ИНН = ПолучитьИННОрганизации(Организация);
	
	//Наименвоание и версии поставки
	НаименованиеМодуля  			= CW_ВерсииПодсистемСервер.ИмяТекущейКонфигурации(); 
	ВерсияМодуля					= CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы();
	
	НаименованиеОсновнойПоставки 	= СокрЛП(Метаданные.Синоним);
	ВерсияОсновнойПоставки 			= CW_ВерсииПодсистемСервер.ТекущаяВерсияБухгалтерияПредприятия();
	//Наименвоание и версии поставки

	СистемнаяИнформация = Новый СистемнаяИнформация;
	ВерсияПриложения 		= СистемнаяИнформация.ВерсияПриложения;    

	Структура.Вставить("РегистрационныйНомер", 			РегистрационныйНомер);
	Структура.Вставить("Организация", 					Организация);
	Структура.Вставить("ИНН", 							ИНН);
	Структура.Вставить("НаименованиеМодуля", 			НаименованиеМодуля);
	Структура.Вставить("ВерсияМодуля", 					ВерсияМодуля);
	Структура.Вставить("НаименованиеОсновнойПоставки", 	НаименованиеОсновнойПоставки);
	Структура.Вставить("ВерсияОсновнойПоставки", 		ВерсияОсновнойПоставки);
	Структура.Вставить("ВерсияПриложения", 				ВерсияПриложения);
	
	Возврат Структура;
	
КонецФункции  

&НаСервере
Функция ПолучитьИННОрганизации(НаименованиеОрагниазции)
	
	СтрИНН = "<>";
	
	СправочникСсылка = Справочники.Организации.НайтиПоНаименованию(НаименованиеОрагниазции, Истина);
	Если СправочникСсылка.Пустая() Тогда
		СправочникСсылка = Справочники.Организации.НайтиПоРеквизиту("НаименованиеСокращенное", НаименованиеОрагниазции);  
	КонецЕсли;
	Если СправочникСсылка.Пустая() Тогда
		СправочникСсылка = Справочники.Организации.НайтиПоРеквизиту("НаименованиеПолное", НаименованиеОрагниазции);
	КонецЕсли;   
	
	Если СправочникСсылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Организации.ИНН КАК ИНН
		|ИЗ
		|	Справочник.Организации КАК Организации
		|
		|СГРУППИРОВАТЬ ПО
		|	Организации.ИНН";  
		
		РезультатЗапроса = Запрос.Выполнить();
		мИНН = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ИНН");   
		СтрИНН = СтрСоединить(мИНН, ";");	
	Иначе
		СтрИНН = СправочникСсылка.ИНН;	
	КонецЕсли;   
	
	Возврат СтрИНН;
	
КонецФункции