		
Функция ПодключитьсяКРесурусуОбновлений(Логин, Пароль) Экспорт
	
	ПараметрыFTPПодключения = CW_РаботаСFTPРесурсами.ПолучитьПустуюСтруктуруНастроекFTP();   
	ПараметрыFTPПодключения.Логин  = Логин;
	ПараметрыFTPПодключения.Пароль = Пароль;
	
	CW_РаботаСFTPРесурсами.ЗаполнитьНастройкиFTPРесурса(ПараметрыFTPПодключения);	
	
	FTPСоединение = CW_РаботаСFTPРесурсами.ПодключитьсяКFTPРесурсу(ПараметрыFTPПодключения);
	
	Возврат  FTPСоединение;
	
КонецФункции

Функция ПодключитьсяКСерверуПроверкиНаличияОбновлений(ПараметрыПодключения) Экспорт
	
	Попытка
		Соединение = Новый HTTPСоединение(ПараметрыПодключения.АдресРесурса);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат  Соединение;
	
КонецФункции

Функция ПолучитьМассивФайловИсправленийНаРесурсе(FTPСоединение) Экспорт
	
	Возврат FTPСоединение.НайтиФайлы("*.zip");

КонецФункции

Функция ПолучитьУстановлнныеИсправления() Экспорт
	
	УстановленныеРасширения = Новый Соответствие;
	
	УстановитьПривилегированныйРежим(Истина);
	ВсеРасширения = РасширенияКонфигурации.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого Расширение Из ВсеРасширения Цикл
		Если Не ЭтоИсправление(Расширение) и Не СтрНачинаетсяС(Расширение.Имя,"AF_") Тогда
			Продолжить;
		КонецЕсли;    
		
		УстановленныеРасширения.Вставить(Расширение.Имя, Расширение.Версия);
		
	КонецЦикла; 
	
	Возврат  УстановленныеРасширения;
	
КонецФункции 

Функция ЭтоИсправление(Расширение) Экспорт
	
	Возврат Расширение.Назначение = Метаданные.СвойстваОбъектов.НазначениеРасширенияКонфигурации.Исправление
		И СтрНачинаетсяС(Расширение.Имя, "AF");
	
КонецФункции 
	
Функция ЭтоДополнение(Расширение) Экспорт
	
	Возврат Расширение.Назначение = Метаданные.СвойстваОбъектов.НазначениеРасширенияКонфигурации.Дополнение
		И СтрНачинаетсяС(Расширение.Имя, "AF");
	
КонецФункции

	
Функция ЭтоУдаляемоеИсправление(Расширение, ТекущаяВерсия) Экспорт
	
	СтруктураСвойств= СвойстваИсправления(Расширение.Имя);
	Если ТипЗнч(СтруктураСвойств) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтруктураСвойств.Свойство("DeleteIn") Тогда
		РезультатСравнения = СравнитьВерсии(ТекущаяВерсия, СтруктураСвойств.DeleteIn); 
		Возврат РезультатСравнения >= 0;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СравнитьВерсии(ТекущаяВерсия, ВерсияКонфигурации)  
	
	СтрокаВерсии1	= ?(ПустаяСтрока(СтрокаВерсии1),	"0.0.0.0", СтрокаВерсии1);
	СтрокаВерсии2 	= ?(ПустаяСтрока(СтрокаВерсии2), 	"0.0.0.0", СтрокаВерсии2);
	
	Версия1 = СтрРазделить(СтрокаВерсии1, ".");
	Версия2 = СтрРазделить(СтрокаВерсии2, ".");
	
	Результат = 0;
	Для Разряд = 0 По 3 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Результат;	

КонецФункции // СравнитьВерсии()


// Зачитывает свойства исправления из макета. Имя макет должно совпадать с именем исправления.
// Формат макеты XML. Соответствует XDTO пакету ErrorFix.
//
Функция СвойстваИсправления(ИмяИсправления) Экспорт
	
	Если Метаданные.ОбщиеМакеты.Найти(ИмяИсправления) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		СтрокаJSON = ПолучитьОбщийМакет(ИмяИсправления).ПолучитьТекст(); 
	Исключение
		Возврат Неопределено;
	КонецПопытки; 
	
	Возврат ПолучитьСтруктуруСвойствИсправления(СтрокаJSON);
	
КонецФункции

Функция ПолучитьСтруктуруСвойствИсправления(СтрокаJSON)
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);  
		
		ОбъектJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();   
		Возврат ОбъектJSON;
	Исключение
		Возврат Новый Структура;
	КонецПопытки;	
	
КонецФункции

Функция ПолучитьДанныеИсправления(ЧтениеZip, ВременныйКаталог, ПроверятьПрименимость = Истина)Экспорт

	ДанныеРасширения = Новый Структура("Версия,ОписаниеРасширения,УдаляемыеРасширения,ИсправлениеСовместимо","","",Новый Массив,Ложь);
	
	ФайлМанифеста = ЧтениеZip.Элементы.Найти("Manifest.json"); 
	Если ФайлМанифеста = Неопределено Тогда
		Возврат ДанныеРасширения;
	КонецЕсли;
	
	//Если ОбщегоНазначения.РежимОтладки() Тогда
	//	Возврат ДанныеРасширения;
	//КонецЕсли;   
	
 	ИсправлениеСовместимо 	= Истина;      
	ВерсияСвоместима 		= Истина;  
	
	Попытка
		ЧтениеZip.Извлечь(ФайлМанифеста, ВременныйКаталог);
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ВременныйКаталог + ФайлМанифеста.Имя);
		СтрокаJSON = ТекстовыйДокумент.ПолучитьТекст();
		
		СтруктураСвойств = ПолучитьСтруктуруСвойствИсправления(СтрокаJSON);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение НСтр("ru = 'Ошибка при чтении файла манифеста исправления'") + ":" + Символы.ПС + ТекстОшибки;
	КонецПопытки;  
	
	Если СтруктураСвойств.Свойство("PatchVersion") Тогда
		ДанныеРасширения.Вставить("Версия", СтруктураСвойств.PatchVersion);
	КонецЕсли; 
	
	Если СтруктураСвойств.Свойство("Description") Тогда
		ДанныеРасширения.Вставить("ОписаниеРасширения", СтруктураСвойств.Description);
	КонецЕсли;
	
	УдаляемыеРасширения = Новый Массив; 
	Если СтруктураСвойств.Свойство("Withdraw") Тогда
		УдаляемыеРасширения = СтруктураСвойств.Withdraw;	
	КонецЕсли;
	
	ДанныеРасширения.Вставить("УдаляемыеРасширения", УдаляемыеРасширения);

	Если ПроверятьПрименимость Тогда     
		
		ИменаДоступныхПодсистем = Новый Массив;
		Если СтруктураСвойств.Свойство("Configuration") Тогда
			ИменаДоступныхПодсистем = СтруктураСвойств.Configuration;	
		КонецЕсли;
		
		ПодсистемаБухгалтерияЭкспедитора = CW_ОбновлениеКонфигурацииСервер.ПодсистемаБухгалтерияЭкспедитора();
		
		ИменаТекущихПодсистем = Новый Массив;
		ИменаТекущихПодсистем.Добавить(ПодсистемаБухгалтерияЭкспедитора.Имя);
		ИменаТекущихПодсистем.Добавить(Метаданные.Имя);  
		
		//обе текущие подсистемы должны быть в списке доступных для исправления   
		Если ИменаДоступныхПодсистем.Количество() = 1 Тогда
			//в исправлении указана только одна подсистема, ее и ищем в массиве текущих  
			Подсистема = ИменаДоступныхПодсистем[0];
			Если ИменаТекущихПодсистем.Найти(Подсистема) = Неопределено Тогда
				ИсправлениеСовместимо 	= Ложь;      
			КонецЕсли;
		Иначе 
			//В исправлении указано нескольок подсистем, значит все текущие должны быть в списке
			Для Каждого Подсистема из ИменаТекущихПодсистем Цикл
				Если ИменаДоступныхПодсистем.Найти(Подсистема) = Неопределено Тогда
					ИсправлениеСовместимо 	= Ложь;      
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;  
		
		мВесрии 		= Новый Массив;
		ТекущаяВерсия 	= СокрЛП(CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы());  
		Если СтруктураСвойств.Свойство("Target") Тогда
			мВесрии = СтруктураСвойств.Target;	
		КонецЕсли;
		
		ВерсияСвоместима = мВесрии.Найти(ТекущаяВерсия) <> Неопределено;

	КонецЕсли;
	
	ДанныеРасширения.Вставить("ИсправлениеСовместимо", ИсправлениеСовместимо и ВерсияСвоместима);
	
	Возврат ДанныеРасширения;
	
КонецФункции

Функция ИзвлечьИсправлениеИзАрхива(Знач ПомещенныйФайл, ВызыватьИсключение = Ложь, ПроверятьПрименимость = Истина) Экспорт
	
	ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
	Данные = Неопределено;
	ТекстОшибки = "";
	Попытка
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПомещенныйФайл); // ДвоичныеДанные
		ДвоичныеДанные.Записать(ИмяАрхива);
		
		ИсправлениеНайдено = Ложь;
		АрхивыПатчей = Новый Массив;
		ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог("Патчи");
		ЧтениеZip = Новый ЧтениеZipФайла(ИмяАрхива);
		Для Каждого ЭлементАрхива Из ЧтениеZip.Элементы Цикл
			Если ЭлементАрхива.Расширение = "cfe" Тогда
				ИсправлениеНайдено = Истина;
				Прервать;  
			КонецЕсли;
		КонецЦикла;
		
		Если Не ИсправлениеНайдено Тогда
			ЧтениеZip.Закрыть();
			ФайловаяСистема.УдалитьВременныйФайл(ВременныйКаталог);
			ФайловаяСистема.УдалитьВременныйФайл(ИмяАрхива);
			Возврат Неопределено;
		КонецЕсли;
		
		Если Не ИсправлениеНайдено Тогда
			Если ВызыватьИсключение Тогда
				ВызватьИсключение НСтр("ru = 'Файл не является исправлением.'");
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		// Проверка применимости.
		ДанныеРасширения = ПолучитьДанныеИсправления(ЧтениеZip, ВременныйКаталог, ПроверятьПрименимость);
		Если Не ДанныеРасширения.ИсправлениеСовместимо Тогда
			Если ВызыватьИсключение Тогда
				ВызватьИсключение НСтр("ru = 'Исправление не применимо для данной версии конфигурации.'");
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;  
		
		ЧтениеZip.Извлечь(ЭлементАрхива, ВременныйКаталог);
		ЧтениеZip.Закрыть();
		
		ПолноеИмяИсправления = ВременныйКаталог + ЭлементАрхива.Имя;
		Данные = Новый ДвоичныеДанные(ПолноеИмяИсправления);
		
		ФайловаяСистема.УдалитьВременныйФайл(ИмяАрхива);
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
	Исключение
		ФайловаяСистема.УдалитьВременныйФайл(ИмяАрхива);
		Если ИсправлениеНайдено Тогда
			ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		КонецЕсли;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Результат = Новый Структура;
	Если ЭлементАрхива <> Неопределено Тогда
		Результат.Вставить("ИмяПатча", ЭлементАрхива.Имя);
	Иначе
		Результат.Вставить("ИмяПатча", "");
	КонецЕсли;
	
	Результат.Вставить("ИмяИсправления", 		СтрЗаменить(Результат.ИмяПатча,".cfe",""));
	Результат.Вставить("Данные", 				Данные);
	Результат.Вставить("Версия", 				ДанныеРасширения.Версия);
	Результат.Вставить("ОписаниеРасширения", 	ДанныеРасширения.ОписаниеРасширения);
	Результат.Вставить("УдаляемыеРасширения", 	ДанныеРасширения.УдаляемыеРасширения);
	Результат.Вставить("ТекстОшибки", 			ТекстОшибки);
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьРасширения(ИменаРасширений) Экспорт
	
	Для Каждого ИмяРасширения из ИменаРасширений Цикл
		ОтборРасширений = Новый Структура("Имя", ИмяРасширения);
		ВсеРасширения = РасширенияКонфигурации.Получить(ОтборРасширений);
		
		Для Каждого Расширение из ВсеРасширения Цикл
			Попытка
				Расширение.Удалить();
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось удалить отключенное исправление ""%1"" по причине:
				|
				|%2'"), Расширение.Имя, КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Исправления.Удаление'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
				ВызватьИсключение ТекстОшибки;
			КонецПопытки;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры



Функция ПолучитьДанныеТекущейВресии(НоваяВерсия) Экспорт
	
	ТекущаяВерсия 	= ?(ЗначениеЗаполнено(НоваяВерсия), НоваяВерсия, СокрЛП(CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы()));
	
	мСоставВерсии	= СтрРазделить(ТекущаяВерсия,".");
	ПоследняЦифра 	= мСоставВерсии[мСоставВерсии.Количество()-1];
	
	ПозТочки		= СтрНайти(ТекущаяВерсия,".",,,3);
	КаталогВерсии	= Лев(ТекущаяВерсия,ПозТочки)+"X";
	
	Результат = Новый Структура;
	Результат.Вставить("ТекущаяВерсия", 	ТекущаяВерсия); 
	Результат.Вставить("ПоследняЦифра", 	"*."+ПоследняЦифра); 
	Результат.Вставить("КаталогВерсии", 	"/"+КаталогВерсии+"/"); 
	Результат.Вставить("КаталогИсправлений","/Patch/"); 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивФайловИсправлений(FTPСоединение, НоваяВерсия = "") Экспорт 
	
	СтруктураДанныхВерсии = ПолучитьДанныеТекущейВресии(НоваяВерсия);
	
	Попытка
		МассивФайлов = FTPСоединение.НайтиФайлы(СтруктураДанныхВерсии.КаталогВерсии, СтруктураДанныхВерсии.ПоследняЦифра, Истина);
	Исключение
		Возврат Новый Массив;
	КонецПопытки;
	
	Если МассивФайлов.Количество() = 0 Тогда
		Возврат МассивФайлов;
	КонецЕсли;
	
	FTPФайл = МассивФайлов[0];
	КаталогИсправлений = FTPФайл.ПолноеИмя+СтруктураДанныхВерсии.КаталогИсправлений;
	
	МассивФайлов = FTPСоединение.НайтиФайлы(КаталогИсправлений);
	Если МассивФайлов.Количество() = 0 Тогда
		//Нет такого каталога
		Возврат МассивФайлов;
	КонецЕсли;
	
	FTPСоединение.УстановитьТекущийКаталог(КаталогИсправлений);
	МассивФайлов = CW_ИсправленияКонфигурации.ПолучитьМассивФайловИсправленийНаРесурсе(FTPСоединение);
	
	Возврат МассивФайлов;
	
КонецФункции

//Автоматическая загрузка исправлений
Функция РасписаниеЗаданияУстановкиИсправлений() Экспорт
	
	Задание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(
		Метаданные.РегламентныеЗадания.CW_ПолучениеИУстановкаИсправленийКонфигурации);
	Если Задание <> Неопределено Тогда
		Возврат Задание.Расписание;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 

Функция РасписаниеЗаданияУстановкиДополнений() Экспорт
	
	Задание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(
		Метаданные.РегламентныеЗадания.CW_ПолучениеИУстановкаДополненийКонфигурации);
	Если Задание <> Неопределено Тогда
		Возврат Задание.Расписание;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции


Процедура УстановитьРасписаниеЗаданияУстановкиИсправлений(Знач Расписание) Экспорт
	
	ПериодПовтораВТечениеДня = Расписание.ПериодПовтораВТечениеДня;
	Если ПериодПовтораВТечениеДня > 0 И ПериодПовтораВТечениеДня < 3600 Тогда
		ВызватьИсключение НСтр("ru = 'Интервал автоматической установки не может быть чаще, чем один раз в час.'");
	КонецЕсли;
	
	РегламентныеЗаданияСервер.УстановитьРасписаниеРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.CW_ПолучениеИУстановкаИсправленийКонфигурации,
		Расписание);

КонецПроцедуры   
	
Процедура УстановитьРасписаниеЗаданияУстановкиДополнений(Знач Расписание) Экспорт
	
	ПериодПовтораВТечениеДня = Расписание.ПериодПовтораВТечениеДня;
	Если ПериодПовтораВТечениеДня > 0 И ПериодПовтораВТечениеДня < 3600 Тогда
		ВызватьИсключение НСтр("ru = 'Интервал автоматической установки не может быть чаще, чем один раз в час.'");
	КонецЕсли;
	
	РегламентныеЗаданияСервер.УстановитьРасписаниеРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.CW_ПолучениеИУстановкаДополненийКонфигурации,
		Расписание);

КонецПроцедуры

	
	// Изменяет значение настройки автоматической загрузки и установки исправлений.
// Перед вызовом метода необходимо проверить доступность загрузки исправлений
// см. ДоступнаАвтоматическаяЗагрузкаИсправлений. Если автоматическая
// загрузка исправлений не доступна, будет вызвано исключение. 
//
// Параметры:
//	ЗначениеНастройки - Булево - если Истина, автоматическая загрузка будет включена.
//
// Пример:
//	Если ПолучениеОбновленийПрограммы.ДоступнаАвтоматическаяЗагрузкаИсправлений() Тогда
//		ПолучениеОбновленийПрограммы.ВключитьОтключитьАвтоматическуюУстановкуИсправлений(Истина);
//	КонецЕсли;
//
Процедура ВключитьОтключитьАвтоматическуюУстановкуИсправлений(Знач ЗначениеНастройки) Экспорт
	
	ЗначениеНастройки = (ЗначениеНастройки = Истина);
	Константы.CW_ЗагружатьИУстанавливатьИсправленияАвтоматически.Установить(ЗначениеНастройки);
	РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.CW_ПолучениеИУстановкаИсправленийКонфигурации,
		(ЗначениеНастройки И CW_МониторПорталаПоддержкиСервер.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки()));
	
КонецПроцедуры 
	
Процедура ВключитьОтключитьАвтоматическуюУстановкуДополнений(Знач ЗначениеНастройки) Экспорт
	
	ЗначениеНастройки = (ЗначениеНастройки = Истина);
	Константы.CW_ЗагружатьИУстанавливатьДополненияАвтоматически.Установить(ЗначениеНастройки);
	РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.CW_ПолучениеИУстановкаДополненийКонфигурации,
		(ЗначениеНастройки И CW_МониторПорталаПоддержкиСервер.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки()));
	
КонецПроцедуры

Функция ПолучитьПустуюТаблицуИсправлений() Экспорт
	
	ТаблицаИсправлений = Новый ТаблицаЗначений;
	ТаблицаИсправлений.Колонки.Добавить("Отметка", 		Новый ОписаниеТипов("Булево"));
	ТаблицаИсправлений.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ТаблицаИсправлений.Колонки.Добавить("Описание", 	Новый ОписаниеТипов("Строка"));
	ТаблицаИсправлений.Колонки.Добавить("АдресФайла", 	Новый ОписаниеТипов("Строка"));
	ТаблицаИсправлений.Колонки.Добавить("Размер", 		Новый ОписаниеТипов("Число"));
	ТаблицаИсправлений.Колонки.Добавить("Удаляемые", 	Новый ОписаниеТипов("Строка"));
	ТаблицаИсправлений.Колонки.Добавить("Версия", 		Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаИсправлений;
	
КонецФункции

Функция ПолучитьФайлыССервера(Логин, Пароль) Экспорт
	
	FTPСоединение = CW_ИсправленияКонфигурации.ПодключитьсяКРесурусуОбновлений(Логин, Пароль);
	Если FTPСоединение = Неопределено Тогда
		//Не удалось подключиться к серверу
		Возврат Неопределено;
	КонецЕсли;

	Исправления = ПолучитьПустуюТаблицуИсправлений();
	
	МассивФайлов = CW_ИсправленияКонфигурации.ПолучитьМассивФайловИсправлений(FTPСоединение);
	Если МассивФайлов.Количество() = 0 тогда
		Возврат Исправления;
	КонецЕсли;
	
	УстановленныеРасширения  = CW_ИсправленияКонфигурации.ПолучитьУстановлнныеИсправления();

	Для Каждого ФайлFTP из МассивФайлов Цикл
		
		ТекущаяВерсия = УстановленныеРасширения.Получить(ФайлFTP.ИмяБезРасширения);  
		
		ВременныйФайл = ПолучитьИмяВременногоФайла("");
		FTPСоединение.Получить(ФайлFTP.Имя,ВременныйФайл);
		ДвоичныеДанные 	= Новый ДвоичныеДанные(ВременныйФайл);
		АдресФайла 		= ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ИсправлениеИзАрхива = CW_ИсправленияКонфигурации.ИзвлечьИсправлениеИзАрхива(АдресФайла);
		Если ИсправлениеИзАрхива <> Неопределено Тогда
			ИмяИсправления 			= ИсправлениеИзАрхива.ИмяПатча;
			Данные 					= ИсправлениеИзАрхива.Данные;  
			
			УдаляемыеРасширения = ИсправлениеИзАрхива.УдаляемыеРасширения;
			Если ТипЗнч(УдаляемыеРасширения) <> тип("Массив") Тогда
				УдаляемыеРасширения = Новый Массив;
			КонецЕсли;   
			
			РезультатСравнения = УстанавливаетсяАктуальнаяВерсия(ТекущаяВерсия, ИсправлениеИзАрхива.Версия);
			Если РезультатСравнения < 0 Тогда   
				Если ТекущаяВерсия <> Неопределено Тогда
					УдаляемыеРасширения.Добавить(ФайлFTP.ИмяБезРасширения);	
				КонецЕсли;
				
				СтрокаИсправления = Исправления.Добавить();
				СтрокаИсправления.Отметка		= Истина;
				СтрокаИсправления.Наименование	= ФайлFTP.ИмяБезРасширения;
				СтрокаИсправления.Описание		= ИсправлениеИзАрхива.ОписаниеРасширения;
				СтрокаИсправления.Удаляемые 	= СтрСоединить(УдаляемыеРасширения,";");
				СтрокаИсправления.АдресФайла 	= ПоместитьВоВременноеХранилище(ИсправлениеИзАрхива.Данные, Новый УникальныйИдентификатор);
				СтрокаИсправления.Размер   		= ФайлFTP.Размер();
				СтрокаИсправления.Версия		= ИсправлениеИзАрхива.Версия;
			КонецЕсли;
			
		КонецЕсли;
		
		УдалитьФайлы(ВременныйФайл);
		
	КонецЦикла;
	
	Возврат Исправления;

КонецФункции     

Функция УстанавливаетсяАктуальнаяВерсия(СтрокаВерсии1, СтрокаВерсии2) Экспорт
	
	СтрокаВерсии1	= ?(ПустаяСтрока(СтрокаВерсии1), "0.0", СтрокаВерсии1);
	СтрокаВерсии2 	= ?(ПустаяСтрока(СтрокаВерсии2), "0.0", СтрокаВерсии2);
	
	Версия1 = СтрРазделить(СтрокаВерсии1, ".");
	Версия2 = СтрРазделить(СтрокаВерсии2, ".");
	
	Результат = 0;
	Для Разряд = 0 По 1 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Процедура ПолучениеИУстановкаИсправленийКонфигурации() Экспорт
	
	ДанныеАутентификации = CW_МониторПорталаПоддержкиСервер.ДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ДанныеАутентификации = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТабИсправления = CW_ИсправленияКонфигурации.ПолучитьФайлыССервера(ДанныеАутентификации.Логин, ДанныеАутентификации.Пароль);	
	Если ТабИсправления = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	ЗагрузитьПолученныеИсправления(ТабИсправления);
	
КонецПроцедуры

Процедура ПолучениеИУстановкаДополненийКонфигурации() Экспорт
	
	ДанныеАутентификации = CW_МониторПорталаПоддержкиСервер.ДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ДанныеАутентификации = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("АдресРесурса", 	CW_ИсправленияКонфигурации.СерверПроверкиНаличияДопонений());  

	Соединение = CW_ИсправленияКонфигурации.ПодключитьсяКСерверуПроверкиНаличияОбновлений(ПараметрыПодключения);
	Если Соединение = Неопределено Тогда
		//Не удалось подключиться к серверу
		ЗаписьЖурналаРегистрации("Получение дополнений",,,,"Не удалось подключиться к серверу");
		Возврат;
	КонецЕсли;                                             
	
	АдресРесурса = CW_ИсправленияКонфигурации.АдресРесурсаПроверкиНаличияДопонений() + 
			CW_ИсправленияКонфигурации.ИмяZIPфайлаШаблонаДополнений();
			
	ЛокальныйПуть = КаталогВременныхФайлов()+CW_ИсправленияКонфигурации.ИмяZIPфайлаШаблонаДополнений();  
	                    
	Ошибка = CW_ИсправленияКонфигурации.ПолучитьФайлССервера(АдресРесурса, ЛокальныйПуть, Соединение);  
	Если Ошибка <> "" Тогда  
		ЗаписьЖурналаРегистрации("Получение дополнений",,,,Ошибка);
		Возврат;
	КонецЕсли; 
	
	ТаблицаДоступныхДополнений = CW_ИсправленияКонфигурации.ОбработатьZIPФайлДополнений(ЛокальныйПуть);
	
	ЗагрузитьДополненияКонфигурации(ТаблицаДоступныхДополнений, ДанныеАутентификации.Логин, ДанныеАутентификации.Пароль);

КонецПроцедуры  

Процедура ЗагрузитьДополненияКонфигурации(ТаблицаДоступныхДополнений, Логин, Пароль)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор 	= Новый Структура("Отметка", Истина);
	мСтроки = ТаблицаДоступныхДополнений.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаИсправления из мСтроки Цикл   
		
		АдресРесурса  = СтрокаИсправления.АдресФайла; 
		ИмяZIPФайла   = CW_ИсправленияКонфигурации.ПолучитьИмяФайлаИзПути(АдресРесурса);
		ЛокальныйПуть = КаталогВременныхФайлов()+ИмяZIPФайла;  
		
		FTPСоединение = CW_ИсправленияКонфигурации.ПодключитьсяКРесурусуОбновлений(Логин, Пароль);
		Если FTPСоединение = Неопределено Тогда
			//Не удалось подключиться к серверу
			ЗаписьЖурналаРегистрации("Получение дополнений",,,,"Не удалось подключиться к серверу");
			Продолжить;;
		КонецЕсли;                                             
		
		Ошибка = CW_ИсправленияКонфигурации.ПолучитьФайлССервера(АдресРесурса, ЛокальныйПуть, FTPСоединение);  
		Если Ошибка <> "" Тогда
			ЗаписьЖурналаРегистрации("Получение дополнений",,,,Ошибка);
		Продолжить;
		КонецЕсли;    
		
		ФайлАрхива = Новый Файл(ЛокальныйПуть);
		Если ФайлАрхива.Существует()Тогда    
			
			ИмяФайлаЗагрузки = CW_ИсправленияКонфигурации.РаспаковатьАрхив(ЛокальныйПуть, ФайлАрхива.ИмяБезРасширения+".cfe");
			
			//Удаляем одноименное раширение, если есть
			мУдаляемые = Новый Массив;
			мУдаляемые.Добавить(ФайлАрхива.ИмяБезРасширения);
			CW_ИсправленияКонфигурации.УдалитьРасширения(мУдаляемые);
			//Удаляем одноименное раширение, если есть
			
			Попытка
				ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайлаЗагрузки);
				
				Расширение = РасширенияКонфигурации.Создать();
				
				Справочники.ВерсииРасширений.ОтключитьПредупрежденияБезопасности(Расширение);
				Справочники.ВерсииРасширений.ОтключитьИспользованиеОсновныхРолейДляВсехПользователей(Расширение);
				
				Расширение.БезопасныйРежим = Ложь;
				Расширение.ИспользуетсяВРаспределеннойИнформационнойБазе = Истина;
				Расширение.Записать(ДвоичныеДанные); 
			Исключение
			КонецПопытки; 
			
			УдалитьФайлы(ИмяФайлаЗагрузки);
			
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьПолученныеИсправления(Исправления)
	
	Отбор 	= Новый Структура("Отметка", Истина);
	мСтроки = Исправления.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаИсправления из мСтроки Цикл
		
		Если ЗначениеЗаполнено(СтрокаИсправления.Удаляемые) Тогда
			мУдаляемые = СтрРазделить(СтрокаИсправления.Удаляемые,";", Ложь);
			CW_ИсправленияКонфигурации.УдалитьРасширения(мУдаляемые);
		КонецЕсли;
		
		Попытка
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтрокаИсправления.АдресФайла);
			
			Расширение = РасширенияКонфигурации.Создать();
			Справочники.ВерсииРасширений.ОтключитьПредупрежденияБезопасности(Расширение);
			Справочники.ВерсииРасширений.ОтключитьИспользованиеОсновныхРолейДляВсехПользователей(Расширение);
			Расширение.БезопасныйРежим = Ложь;
			Расширение.ИспользуетсяВРаспределеннойИнформационнойБазе = Истина;
			Расширение.Записать(ДвоичныеДанные);
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
//Автоматическая загрузка исправлений


//Дополенения 
Функция СерверПроверкиНаличияДопонений() Экспорт
	Возврат "www.coralway.ru";
КонецФункции 

Функция СерверЗагрузкиОбновлений() Экспорт

	Возврат  "ftp.coralway.ru";

КонецФункции

Функция АдресРесурсаПроверкиНаличияДопонений() Экспорт   

	ИмяКонфигурации = CW_ОбновлениеКонфигурацииСервер.ПолучитьКороткоеИмяКонфигурации();
	Если ИмяКонфигурации = "" Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "/products/programs_cw/"+ИмяКонфигурации+"/CurrentVersion/"; 
	
КонецФункции 

Функция АдресРесурсаДополнений() Экспорт
	
	Возврат "/Extension/";
	
КонецФункции   

Функция ИмяZIPфайлаШаблонаДополнений() Экспорт
	
	Возврат "Extension.zip";
	
КонецФункции

Функция ИмяфайлаШаблонаДополнений() Экспорт
	
	Возврат "Extension.xml";
	
КонецФункции

Функция ПолучитьФайлССервера(Адрес, ЛокальныйПуть, Соединение) Экспорт      
	
	Попытка
		Соединение.Получить(Адрес, ЛокальныйПуть);
	Исключение
		Возврат КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат "";
	
КонецФункции  


Функция ОбработатьZIPФайлДополнений(ЛокальныйПуть) Экспорт
	
	ТаблицаЗначений = ВыполнитьЗагрузкуСпискаДополнений(ЛокальныйПуть);
	
	Если ТаблицаЗначений <> Неопределено Тогда
		ТаблицаДоступныхОбновлений = ПолучитьТаблицуДоступныхДополнений(ТаблицаЗначений);
	КонецЕсли;   
	
	Возврат ТаблицаДоступныхОбновлений;
	
КонецФункции

Функция ВыполнитьЗагрузкуСпискаДополнений(ПутьКФайлуАрхива)  
	
	ИмяФайлаЗагрузки = РаспаковатьАрхив(ПутьКФайлуАрхива, ИмяфайлаШаблонаДополнений());

	Файл = Новый Файл(ИмяФайлаЗагрузки);
	Файл.Существует();
	
	
	Попытка      
		
		ТаблицаЗначений = ПустаяТаблицаРасширений();
		
		ТаблицаЗначений.Колонки.Добавить("ВерсияРазряд1",	Новый ОписаниеТипов("Число"));  
		ТаблицаЗначений.Колонки.Добавить("ВерсияРазряд2",	Новый ОписаниеТипов("Число"));  
		
		ТаблицаЗначений.Колонки.Добавить("ВерсияМодуля",	Новый ОписаниеТипов("Строка"));  
		ТаблицаЗначений.Колонки.Добавить("ВерсияБП",		Новый ОписаниеТипов("Строка"));  
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяФайлаЗагрузки);

		Свойства = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ФабрикаXDTO.Тип("ftp://ftp.coralway.ru/Extension", "af8"));   
		Для Каждого Свойства_extension из  Свойства.extension Цикл   
			мДоступныеКонфигурации = Новый Массив;  
			
			ИмяРасширения		= Свойства_extension.name;
			Версия 				= Свойства_extension.version; 
			
			мВерсия = СтрРазделить(Версия, ".");    
			ВерсияРазряд1 = Число(мВерсия[0]);
			ВерсияРазряд2 = Число(мВерсия[1]);
			
			Описание			= Свойства_extension.description;
			АдресФайла 			= Свойства_extension.file;   
			Размер 				= Свойства_extension.size;  
			ВерсияБП 			= Свойства_extension.targetacc;  
			
			мВерсияБП = СтрРазделить(ВерсияБП, ".");    
			ВерсияБПРазряд1 = Число(мВерсияБП[0]);
			ВерсияБПРазряд2 = Число(мВерсияБП[1]);
			ВерсияБПРазряд3 = Число(мВерсияБП[2]);
			ВерсияБПРазряд4 = Число(мВерсияБП[3]);
			
			мВесрииМодуля = новый Массив;
			Если ТипЗнч(Свойства_extension.Target) = Тип("СписокXDTO") Тогда
				Для Каждого ВерсияМодуля Из Свойства_extension.Target Цикл 
					мВесрииМодуля.Добавить(ВерсияМодуля);
				КонецЦикла;
			КонецЕсли;
			Если ТипЗнч(Свойства_extension.Target) = Тип("Строка") Тогда
				мВесрииМодуля.Добавить(Свойства_extension.Target);
			КонецЕсли;
			
			Для Каждого ВерсияМодуля из мВесрииМодуля Цикл
				
				НоваяСтрока = ТаблицаЗначений.Добавить();  
				
				НоваяСтрока.Отметка 		= Истина;
				НоваяСтрока.Наименование 	= ИмяРасширения;
				НоваяСтрока.Версия 			= Версия; 
				НоваяСтрока.Описание 		= Описание;
				НоваяСтрока.АдресФайла 		= АдресФайла;
				НоваяСтрока.Размер 			= Размер;
				НоваяСтрока.ВерсияБП 		= ВерсияБП;  
				НоваяСтрока.ВерсияМодуля 	= ВерсияМодуля;  
				
				НоваяСтрока.ВерсияРазряд1	= ВерсияРазряд1;
				НоваяСтрока.ВерсияРазряд2	= ВерсияРазряд2;
				
			КонецЦикла;
			
		КонецЦикла; 
		
		ЧтениеXML.Закрыть();
		УдалитьФайлы(ИмяФайлаЗагрузки);
		
	Исключение
		
		ЧтениеXML.Закрыть();
		УдалитьФайлы(ИмяФайлаЗагрузки);
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Возврат ТаблицаЗначений;	
	
КонецФункции

Функция РаспаковатьАрхив(Знач ПутьКФайлуАрхива, Знач ИмяФайла) Экспорт
	
	ФайлАрхива = Новый Файл(ПутьКФайлуАрхива);
	Если ФайлАрхива.Существует()Тогда    
		ИмяФайлаЗагрузки  = ФайлАрхива.Путь + ИмяФайла;  
		Попытка 
			ЧтениеZip = Новый ЧтениеZipФайла(ПутьКФайлуАрхива);
			ЧтениеZip.ИзвлечьВсе(ФайлАрхива.Путь, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		Исключение
		КонецПопытки;   
		УдалитьФайлы(ПутьКФайлуАрхива);
	КонецЕсли;  
	
	Возврат ИмяФайлаЗагрузки;

КонецФункции // ВыполнитьЗагрузкуСпискаОбновлений()

Функция ПолучитьТаблицуДоступныхДополнений(ТаблицаЗначений)   
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗагружаемыеРасширения = Справочники.CW_ОбязательныеРасширения.ПолучитьЗагружаемыеРасширения();
	
	ТаблицаДоступныхРасширений = ПустаяТаблицаРасширений();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВерсияМодуля", СокрЛП(CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы()));
	
	ТаблицаДоступныеПоВерсии = ТаблицаЗначений.Скопировать(Отбор);   
	
	ТаблицаДоступныеПоВерсии.Колонки.Добавить("ДоступноБП",	 		Новый ОписаниеТипов("Булево"));
	ТаблицаДоступныеПоВерсии.Колонки.Добавить("ТребуетсяЗагрузка", 	Новый ОписаниеТипов("Булево"));
	
	ТаблицаДоступныеПоВерсии.Сортировать("Наименование ВОЗР, ВерсияРазряд1 УБЫВ, ВерсияРазряд2 УБЫВ");
	
	мДополнения = Новый Массив;
	Массив = ТаблицаДоступныеПоВерсии.ВыгрузитьКолонку("Наименование");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мДополнения, Массив, Истина);
	
	ТекущаяВерсияБП = CW_ВерсииПодсистемСервер.ТекущаяВерсияБухгалтерияПредприятия(); 
	
	Для Каждого ИмяДополнения из мДополнения Цикл  
		
		
		Отбор = новый Структура;
		Отбор.Вставить("Наименование", ИмяДополнения);
		
		мСтроки = ТаблицаДоступныеПоВерсии.НайтиСтроки(Отбор);
		Для Каждого СтрокаТаблицы из мСтроки Цикл 
			
			Если ЗагружаемыеРасширения.Найти(ИмяДополнения) = Неопределено Тогда
				СтрокаТаблицы.ТребуетсяЗагрузка = Ложь;
				Продолжить;
			КонецЕсли;
			
			РезультатСравнения			= СравнитьВерсии(ТекущаяВерсияБП, СтрокаТаблицы.ВерсияБП);  
			СтрокаТаблицы.ДоступноБП 	= РезультатСравнения >= 0;  
			СтрокаТаблицы.ТребуетсяЗагрузка = Истина;
			
			мРасширения = РасширенияКонфигурации.Получить(Новый Структура("Имя",ИмяДополнения)); 
			Если мРасширения.Количество() > 0 Тогда
				СтрокаТаблицы.ТребуетсяЗагрузка = СтрокаТаблицы.Версия <> мРасширения[0].Версия;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;   
	
	Для Каждого ИмяДополнения из мДополнения Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Наименование", 		ИмяДополнения);
		Отбор.Вставить("ДоступноБП",		Истина); 
		
		мСтроки = ТаблицаДоступныеПоВерсии.НайтиСтроки(Отбор);
		Если мСтроки.Количество() > 0 Тогда  
			СтрокаТаблицы = мСтроки[0];
			Если СтрокаТаблицы.ТребуетсяЗагрузка Тогда
				НоваяСтрока = ТаблицаДоступныхРасширений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  
	
	Возврат ТаблицаДоступныхРасширений;
	
КонецФункции   

Функция ПустаяТаблицаРасширений()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ТаблицаЗначений.Колонки.Добавить("Отметка",			Новый ОписаниеТипов("Булево"));
	ТаблицаЗначений.Колонки.Добавить("Наименование",	Новый ОписаниеТипов("Строка"));  
	ТаблицаЗначений.Колонки.Добавить("Версия",			Новый ОписаниеТипов("Строка"));  
	ТаблицаЗначений.Колонки.Добавить("Описание",		Новый ОписаниеТипов("Строка"));
	ТаблицаЗначений.Колонки.Добавить("АдресФайла",		Новый ОписаниеТипов("Строка"));
	ТаблицаЗначений.Колонки.Добавить("Размер",			Новый ОписаниеТипов("Число")); 
	
	Возврат ТаблицаЗначений; 
	
КонецФункции

Функция ПолучитьИмяФайлаИзПути(Знач ПутьФайла) Экспорт
	
	ИмяФайла = СтрЗаменить(ПутьФайла, "/","\");
	Пока Истина Цикл    
		
		ПозСлеш = СтрНайти(ИмяФайла, "\");
		Если ПозСлеш > 0 Тогда
			ИмяФайла = Сред(ИмяФайла, ПозСлеш+1); 
		Иначе
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат ИмяФайла;

КонецФункции
