
Функция ПолучитьВложенныеФункцииФормулы() Экспорт
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.Идентификатор КАК Идентификатор
	               |ИЗ
	               |	Справочник.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета КАК CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Идентификатор);	
	КонецЦикла; 
	
	Возврат Массив;
	
КонецФункции   

Функция ПолучитьСоответствиеФункций() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.Идентификатор КАК Идентификатор,
	               |	CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета КАК CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл  
		Соответствие.Вставить(Выборка.Идентификатор, Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат Соответствие;
	
КонецФункции 
