
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Основание = Параметры.Основание;
	Дата = Основание.Дата;
	// --- 
	Элементы.Договор.ПараметрыВыбора = _УФКС.СформироватьПараметрыВыбораПоля(Новый Структура("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком));
	// --- 
	ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
	// --- 
	// получаем контрагента организации из доходов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СоответствиеОрганизацийКонтрагентам.Организация,
	|	CW_СоответствиеОрганизацийКонтрагентам.Контрагент
	|ИЗ
	|	РегистрСведений.CW_СоответствиеОрганизацийКонтрагентам КАК CW_СоответствиеОрганизацийКонтрагентам
	|ГДЕ
	|	CW_СоответствиеОрганизацийКонтрагентам.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Основание.Организация);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если (ТЗ.Количество() <> 0) Тогда
		
		Контрагент = ТЗ[0].Контрагент;
		
		// определяем организацию
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_СоответствиеОрганизацийКонтрагентам.Организация,
		               |	CW_СоответствиеОрганизацийКонтрагентам.Контрагент
		               |ИЗ
		               |	РегистрСведений.CW_СоответствиеОрганизацийКонтрагентам КАК CW_СоответствиеОрганизацийКонтрагентам
		               |ГДЕ
		               |	CW_СоответствиеОрганизацийКонтрагентам.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Основание.Контрагент);
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если (ТЗ.Количество() <> 0) Тогда
			
			Организация = ТЗ[0].Организация;
			
			// устанавливаем отбор и пробуем подставить договор
			Элементы.Договор.ПараметрыВыбора = _УФКС.СформироватьПараметрыВыбораПоля(Новый Структура("Организация,Владелец,ВидДоговора",Организация,Контрагент,Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком));
			// --- 
			Договор = CW_Документы.ПолучитьПоследнийДоговор(Контрагент, Организация, Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
			
		КонецЕсли; 
		
	КонецЕсли;  
	
	//Подсистема.УчетПриложенийДоговоров
	ДанныеОбъекта = Новый Структура("Договор", Договор);
	CW_УчетПриложенийДоговоровСервер.УстановитьПараметрФункциональнойОпции(ЭтаФорма, ДанныеОбъекта);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаКлиенте
Процедура КонтагентПриИзменении(Элемент)
	
	Элементы.Договор.ПараметрыВыбора = _УФКС.СформироватьПараметрыВыбораПоля(Новый Структура("Владелец,ВидДоговора",Контрагент,ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком")));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПродолжить(Команда)
	
	ПараметрыЗакрытия = Новый Структура("Основание,Дата,Контрагент,Договор,ПорядокОтражения",Основание,Дата,Контрагент,Договор,ПорядокОтражения);

	//Подсистема.УчетПриложенийДоговоров
	ПараметрыЗакрытия.Вставить("ПриложениеКДоговору", ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	//Подсистема.УчетПриложенийДоговоров
	ДанныеОбъекта = Новый Структура("Договор", Договор);
	CW_УчетПриложенийДоговоровСервер.УстановитьПараметрФункциональнойОпции(ЭтаФорма, ДанныеОбъекта);
	//Подсистема.УчетПриложенийДоговоров
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры




