//@skip-check module-empty-method
Процедура ОбработкаЗаполненияЭТрН(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	ОбменСГИСЭПДБП.ОбработкаЗаполненияЭПД(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

//@skip-check module-empty-method
Процедура ОбработкаЗаполненияЭСВ(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
Процедура ОбработкаЗаполненияЭЗН(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
Процедура ОбработкаЗаполненияЭЗЗ(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	ОбменСГИСЭПДБП.ОбработкаЗаполненияЭПД(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

//@skip-check module-empty-method
Процедура ОбработкаЗаполненияЭПЛ(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
Процедура ОбработкаЗаполненияЭДФ(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
Процедура ОбработкаЗаполненияЭПЭ(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	ОбменСГИСЭПДБП.ОбработкаЗаполненияЭПД(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

//@skip-check module-empty-method
Процедура ОбработкаЗаполненияЭЭР(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
Процедура ОбработкаЗаполненияЭСР(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
КонецПроцедуры

//@skip-check module-empty-method
Процедура ПриСозданииНаСервереФормыСпискаЭПД(Форма, Отказ, СтандартнаяОбработка) Экспорт
		
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		
		МобильныйКлиентБПФормаОбъекта.НастроитьФорму(Форма);
	
		Предупреждение = МобильныйКлиентБПФормаОбъекта.СоздатьПредупреждениеОбОграничениях(Форма,
			"Работа с электронными перевозочными документами доступна версии для компьютера");
		
		Элементы = Форма.Элементы;
		МобильныйКлиентБПФормаОбъекта.ВстроитьЭлементФормыВГруппаМКФормаВажное(Элементы, Предупреждение);
		МобильныйКлиентБПФормаОбъекта.СкрытьПрочиеЭлементыФормы(Форма);
		
	КонецЕсли;

КонецПроцедуры

//@skip-check module-empty-method
Процедура СписокПриПолученииДанныхНаСервереФормыСпискаЭПД(ИмяЭлемента, Настройки, СтрокиСписка) Экспорт
КонецПроцедуры

// Обработчик события получения входящего титула ЭПД.
//
// Параметры:
//   ДокументСсылка - ДокументСсылка.ЭлектроннаяТранспортнаяНакладная -
//			- ДокументСсылка.ЭлектроннаяСопроводительнаяВедомость -
//          - ДокументСсылка.ЭлектронныйЗаказНаряд - документ ЭПД.
//   ПолученныйТитул - ПеречислениеСсылка.ТипыЭлементовРегламентаЭДО - полученный титул документа.
//   ЭтоИсправление - Булево - признак исправления титула
//
//@skip-check module-empty-method
Процедура СобытиеПолучениеТитулаЭПД(ДокументСсылка, ПолученныйТитул, ЭтоИсправление) Экспорт
КонецПроцедуры

Функция ИмяПечатнойФормыЭТрН(ДатаДокумента) Экспорт

	Возврат "Документ.ЭлектроннаяТранспортнаяНакладная.ПФ_MXL_ТранспортнаяНакладная2116"
		
КонецФункции

Функция ИмяПечатнойФормыЭПЛ(ДатаДокумента) Экспорт

	Возврат "Документ.ЭлектронныйПутевойЛист.ПФ_MXL_ПутевойЛист"
		
КонецФункции

Функция ВидФактическийАдресКонтрагента() Экспорт
	
	Возврат ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента");
	
КонецФункции

Функция ИмяТипаБанковскиеСчетаОрганизации() Экспорт
	
	Возврат "СправочникСсылка.БанковскиеСчета";
	
КонецФункции

Функция ИмяТипаСтраны() Экспорт
	
	Возврат "СправочникСсылка.СтраныМира";
	
КонецФункции

// Получить реквизиты договора.
// 
// Параметры:
//  СсылкаНаДоговор Ссылка на договор
//  Результат - Структура 
// 		* Наименование 	- строка
// 		* Номер 	- строка
// 		* Дата 	- дата
Процедура ПолучитьРеквизитыДоговора(СсылкаНаДоговор, Результат) Экспорт
	ОбменСГИСЭПДБП.ПолучитьРеквизитыДоговора(СсылкаНаДоговор, Результат);
КонецПроцедуры
	
