&НаКлиенте
Функция ВыполнитьДействие(УФ, СтруктураДействия, ПроцедураОбратногоВызова = Неопределено) Экспорт 
	
	ИмяКоманды = СтруктураДействия.Команда;
	Параметры = СтруктураДействия.Параметры;
	// --- 
	Отладка = УФ.Отладка;
	Если (Отладка) Тогда
		Сообщить("Клиент: """+ИмяКоманды+"""");
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	Если (ИмяКоманды = "/ОткрытьЛибоРедактировать") Тогда
		
		Возврат(ОткрытьЛибоРедактировать(УФ,Параметры,ПроцедураОбратногоВызова));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОповеститьОбИзменении") Тогда
		
		Для каждого Элемент Из Параметры Цикл
			
			ОповеститьОбИзменении(Элемент);
			
		КонецЦикла; 
		// --- 
		Возврат(Неопределено);
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ДиалогПодтвержденияНастройки") Тогда
		
		ОткрытьФорму("ОбщаяФорма.CW_ДиалогПодтвержденияНастройкиЖурнала",Новый Структура("СтруктураНастройки",Параметры.СтруктураНастройки),,Истина,,,Параметры.ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат(Неопределено); 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/РежимЕкселя") Тогда
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Журналы","сервер",ИмяКоманды));
		
	// ---------------------------------------------------------------------------- 	
	ИначеЕсли (ИмяКоманды = "/Обновить") Тогда 
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Журналы","сервер",ИмяКоманды));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ДиалогПодтвержденияПометкиУдаления") Тогда 
		
		Возврат(ДиалогПодтвержденияПометкиУдаления(УФ,Параметры, ПроцедураОбратногоВызова));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОтборПоЗначению") Тогда 
		
		Если (НЕ УФ.Журнал_РежимНастройки) Тогда
			
			// проксируется на сервер
			Возврат(_УФКС.СД("Журналы","сервер",ИмяКоманды));	
			
		КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/СброситьСортировку") Тогда 
		
		Если (НЕ УФ.Журнал_РежимНастройки) Тогда
			
			// проксируется на сервер
			Возврат(_УФКС.СД("Журналы","сервер",ИмяКоманды));
			
		КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОтборПоСпискуЗначений") Тогда 
		
		Если (НЕ УФ.Журнал_РежимНастройки) Тогда
			
			// определяем текущую колонку
			ТекущийЭлемент = УФ.Элементы.Журнал.ТекущийЭлемент;
			Если (ТекущийЭлемент <> Неопределено) Тогда
				Если Найти(ТекущийЭлемент.Имя, "Журнал_") <> 0 Тогда
					ИмяКолонки = СтрЗаменить(ТекущийЭлемент.Имя, "Журнал_", "");
					Возврат(_УФКС.СД("Журналы","сервер","/ОтборПоСпискуЗначенийПараметрыДиалога",ИмяКолонки)); 
				Иначе
					Возврат(Неопределено);
				КонецЕсли;
			Иначе
				Возврат(Неопределено);
			КонецЕсли;
			
		КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОтборПоПериоду") Тогда 
		
		Если (НЕ УФ.Журнал_РежимНастройки) Тогда
			
			Возврат(ОтборПоПериодуДиалог(УФ,Параметры, ПроцедураОбратногоВызова));
			
		КонецЕсли;  
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/Выбрать") Тогда 
		
		Возврат(Выбрать(УФ)); 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОтборПоСпискуЗначенийДиалог") Тогда 
		
		Если (НЕ УФ.Журнал_РежимНастройки) Тогда
			Возврат(ОтборПоСпискуЗначенийДиалог(УФ,Параметры, ПроцедураОбратногоВызова)); 	
		КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОтборКонтейнеровПоТексту") Тогда 
		
		Возврат(ОтборКонтейнеровПоТекстуДиалог(УФ,ПроцедураОбратногоВызова)); 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОчиститьЗначения") Тогда 
		
		Возврат(ОчиститьЗначения_ЗадатьВопрос(УФ, ПроцедураОбратногоВызова));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОтборИСортировка") Тогда 
		
		Возврат(ОтборИСортировка_Диалог(УФ, ПроцедураОбратногоВызова));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОтборПоСтатусам") Тогда 
		
		Возврат(УстановитьОтборПоСтатусам(УФ,ПроцедураОбратногоВызова));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОтборПоФинансовымСтатусам") Тогда 
		
		Возврат(УстановитьОтборПоФинансовымСтатусам(УФ,ПроцедураОбратногоВызова));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОтключитьОтбор") Тогда 
		
		Возврат(ОтключитьОтбор(УФ));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/СортироватьПоВозрастанию") Тогда 
		
		Возврат(СортировкаКолонки_ОпределитьНужныйПорядокПоНажатию(УФ,"Возр"));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/СортироватьПоУбыванию") Тогда 
		
		Возврат(СортировкаКолонки_ОпределитьНужныйПорядокПоНажатию(УФ,"Убыв"));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/Раскрасить") Тогда 
		
		Возврат(Раскрасить_Диалог(УФ, ПроцедураОбратногоВызова));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/СуммаВыделенныхЯчеек") Тогда 
		
		Возврат(СуммаВыделенныхЯчеек(УФ));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/СохранитьНастройку") Тогда 
		
		Возврат(СохранитьНастройку_Диалог(УФ,ПроцедураОбратногоВызова));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ЗагрузитьНастройку") Тогда 
		
		Возврат(ЗагрузитьНастройку_Диалог(УФ,ПроцедураОбратногоВызова));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/УстановитьТекстСтатуснойСтроки") Тогда 
		
		 Возврат(УстановитьТекстСтатуснойСтроки(УФ));
		 
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/УстановитьЗаголовкиКолонок") Тогда 
		
		 Возврат(УстановитьЗаголовкиКолонок(УФ));
		 
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/Предупреждение") Тогда 
		
		_УФК.ВывестиПредупреждение(Параметры);
		Возврат(Неопределено);
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/НастройкаСписка") Тогда 
		
		Если (Параметры = Неопределено) Тогда
			// проксируется на сервер
			Возврат(_УФКС.СД("Журналы","сервер",ИмяКоманды));
		Иначе
			Возврат(НастройкаСписка_Диалог(УФ, Параметры,ПроцедураОбратногоВызова)); 	
		КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ФормированиеДокументовПоБюджету") Тогда 
		
		Возврат(СформироватьДокументыПоБюджету(УФ)); 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ДобавитьДинамическийПараметр") Тогда 
		
		Возврат(ДобавитьДинамическийПараметр(УФ,ПроцедураОбратногоВызова)); 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/УдалитьДинамическийПараметр") Тогда 
		
		Возврат(УдалитьДинамическийПараметр(УФ,ПроцедураОбратногоВызова)); 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ПересчитатьДинамическиеПараметры") Тогда 
		
		// проксируется на сервер
		Возврат(_УФКС.СД("Журналы","сервер",ИмяКоманды));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ФинансовыйОтчет") Тогда 
		
		Если (Параметры = Неопределено) Тогда
			Возврат(_УФКС.СД("Журналы","сервер","/ФинансовыйОтчетПараметры"));
		Иначе
			Возврат(ФинансовыйОтчет(Параметры));
		КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ПодключитьГрузоперевозки") Тогда 
		
		Возврат(ПодключитьГрузоперевозки(УФ, ПроцедураОбратногоВызова)); 
		
	// ---------------------------------------------------------------------------- 
	Иначе 
		
		Сообщить("Клиент: неизвестная команда """+ИмяКоманды+"""");
		Возврат(Неопределено);
		
	КонецЕсли;
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Функция УстановитьЗаголовкиКолонок(УФ) Экспорт 
	
	Для каждого СтрокаОписанияКолонки Из УФ.Журнал_ОписаниеКолонок Цикл
		
		Попытка
			ИмяКолонки = "Журнал"+"_"+СтрокаОписанияКолонки.Имя;	
		Исключение
		    Продолжить;
		КонецПопытки; 
		
		КолонкаЭлемент = УФ.Элементы.Найти(ИмяКолонки);
		
		Если (КолонкаЭлемент <> Неопределено) Тогда
			
			КолонкаЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
			КолонкаЭлемент.Заголовок          = СтрокаОписанияКолонки.Заголовок;
			КолонкаЭлемент.ОтображатьВШапке   = Истина;
			
			Если строкаОписанияКолонки.Сортировка = УФ.Перечисления_CW_ПорядокСортировки_ПоВозрастанию Тогда
				
				КолонкаЭлемент.Заголовок     = " "+СтрокаОписанияКолонки.Заголовок; // NB! меняя только картинку, не вызываем обновления формы, приходится также трогать заголовок
				КолонкаЭлемент.КартинкаШапки = БиблиотекаКартинок.CW_СортировкаAZ;
				
			ИначеЕсли СтрокаОписанияКолонки.Сортировка = УФ.Перечисления_CW_ПорядокСортировки_ПоУбыванию Тогда 
				
				КолонкаЭлемент.Заголовок     = " "+СтрокаОписанияКолонки.Заголовок; // NB! меняя только картинку, не вызываем обновления формы, приходится также трогать заголовок
				КолонкаЭлемент.КартинкаШапки = БиблиотекаКартинок.CW_СортировкаZA;
				
			Иначе
				
				КолонкаЭлемент.КартинкаШапки = Новый Картинка;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(Неопределено);
	
КонецФункции

&НаКлиенте
Функция УстановитьТекстСтатуснойСтроки(УФ) Экспорт 
	
	НовыйТекстСтатуснойСтроки = "Количество: "+Формат(УФ.Журнал_КоличествоДоступныхСтрок, "ЧЦ=15; ЧДЦ=0; ЧН=; ЧГ=");
	Если УФ.Журнал_КоличествоВыделенныхСтрок > 1 Тогда
		НовыйТекстСтатуснойСтроки = НовыйТекстСтатуснойСтроки + "; выделено: "+Формат(УФ.Журнал_КоличествоВыделенныхСтрок,"ЧЦ=15; ЧДЦ=0; ЧН=; ЧГ=");
	КонецЕсли; 
	Если СокрЛП(УФ.Журнал_РасшифровкаОтбора) <> "" Тогда
		НовыйТекстСтатуснойСтроки = НовыйТекстСтатуснойСтроки + УФ.Журнал_РасшифровкаОтбора;
	КонецЕсли; 
	УФ.Журнал_ТекстСтатуснойСтроки = НовыйТекстСтатуснойСтроки;
	
	// если вызвано из формы Заказа
	Если (УФ.Объект.Свойство("Ссылка")) Тогда 
		УФ.Элементы.СтраницаЖурналГрузоперевозок.Заголовок = "Грузоперевозки ("+Формат(УФ.Журнал_КоличествоДоступныхСтрок,"ЧДЦ=; ЧН=; ЧГ=")+")";
	КонецЕсли;
	
	Возврат(Неопределено);
	
КонецФункции

// --- 

&НаКлиенте
Процедура ЖурналПередНачаломДобавления(УФ, Элемент, Отказ, Копирование, Родитель, Группа) Экспорт 
	
	Журнал_Данные = УФ.Журнал_Данные;
	Элементы = УФ.Элементы;
	
	Отказ = Истина;
	
	// необходимо проверить права на создание/копирование г/п
	Если (НЕ CW_Журналы_Сервер.ЕстьПравоСоздания(УФ.ИмяФормы)) Тогда
		
		_УФК.ВывестиПредупреждение("Недостаточно прав.");
		Возврат;
		
	КонецЕсли; 
	
	Если Копирование Тогда
		
		ТекущийОбъект = Журнал_Данные.НайтиПоИдентификатору(Элементы.Журнал.ТекущаяСтрока)["ссылка"];
		Если ТекущийОбъект = Неопределено Тогда
			_УФК.ВывестиПредупреждение("Не выделена грузоперевозка!",,"Предупреждение");
			Возврат;
		КонецЕсли; 
		
		ПараметрыФормы = Новый Структура("ЗначениеКопирования", ТекущийОбъект);
		ПараметрыФормы.Вставить("ОчищатьФактическиеДаты", Ложь);
		ПараметрыФормы.Вставить("НеРассчитыватьСтатусыПриЗаписи", Истина);
		Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
			ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаОбъекта", ПараметрыФормы, Элемент);
		ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
			ОткрытьФорму("Справочник.CW_Заявки.ФормаОбъекта", ПараметрыФормы, Элемент);
		ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
			ОткрытьФорму("Справочник.CW_Заказы.ФормаОбъекта", ПараметрыФормы, Элемент);
		КонецЕсли; 
		
	Иначе
		
		// создание нового
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("НеРассчитыватьСтатусыПриЗаписи", Истина);
		
		// если вызвано из Заказа, то заполняем реквизиты по Заказу
		ссылкаЗаказ = Неопределено;
		Если (ЭтоФормаЗаявки(УФ)) Тогда
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Заявка", УФ.Объект.Ссылка));
		КонецЕсли; 
		Если (ЭтоФормаЗаказа(УФ)) Тогда
			Если УФ.Объект.Свойство("Ссылка", ссылкаЗаказ) Тогда 
				// вызов из формы справочника Заказы
				Если НЕ ЗначениеЗаполнено(ссылкаЗаказ) Тогда 
					// заказ новый, либо изменён
					Отказ = Истина;
					_УФК.ВывестиПредупреждение("Заказ необходимо записать!");
					Возврат;
				КонецЕсли;
				// добавим структуру данных заполнения только ссылку на Заказ -- чтобы не переключеть лишний раз в серверный режим
				//  грузоперевозка сама возьмёт значения реквизитов в обработке заполнения
				ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Заказ", ссылкаЗаказ));
				
			КонецЕсли;	
		КонецЕсли; 
		
		// --- 
		
		Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
			ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаОбъекта", ПараметрыФормы, Элемент);
		ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
			ОткрытьФорму("Справочник.CW_Заявки.ФормаОбъекта", ПараметрыФормы, Элемент);
		ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
			ОткрытьФорму("Справочник.CW_Заказы.ФормаОбъекта", ПараметрыФормы, Элемент);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

#Область ОчисткаПометкаУдаления 

&НаКлиенте
Функция ЗадатьВопросыОчиститьЛибоПометитьНаУдаление(УФ, ПроцедураОбратногоВызова) Экспорт 
	
	Журнал_СтруктураНастроек = УФ.Журнал_СтруктураНастроек;
	Элементы = УФ.Элементы;
	// --- 
	Отказ = Истина;
	РежимУдаления = Истина;
	
	Если (РежимУдаления) Тогда
		
		// помечаем выделенные на удаление
		Если Элементы.Журнал.ВыделенныеСтроки.Количество() <> 1 Тогда
			ТекстВопроса = "Изменить пометку удаления для выделенных объектов ("+Строка(Элементы.Журнал.ВыделенныеСтроки.Количество())+")?";
		Иначе
			ТекстВопроса = "Изменить пометку удаления?";
		КонецЕсли;
		ПОВ = Новый ОписаниеОповещения("ОбработкаРезультатаВопросаОбУдалении",ЭтотОбъект,Новый Структура("УФ,ПОВ",УФ,ПроцедураОбратногоВызова));
		ПоказатьВопрос(ПОВ, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура ОбработкаРезультатаВопросаОбУдалении(Ответ,ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ=КодВозвратаДиалога.Да) Тогда
		
		// проверяем, что выделенные г/п не содержат бюджетов и не включены в документы
		МассивГрузоперевозок = ПолучитьМассивВыделенныхГрузоперевозок(ДополнительныеПараметры.УФ);
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ПроверитьВозможностьПометкиУдаления",МассивГрузоперевозок));
		
		//ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ИзменитьПометкуУдаления",МассивГрузоперевозок));
		
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

&НаКлиенте
Процедура ЖурналПриАктивизацииЯчейки(УФ, Элемент) Экспорт 
	
	НовоеКоличествоВыделенныхСтрок = УФ.Элементы.Журнал.ВыделенныеСтроки.Количество();
	Если УФ.Журнал_КоличествоВыделенныхСтрок <> НовоеКоличествоВыделенныхСтрок Тогда
		УФ.Журнал_КоличествоВыделенныхСтрок = НовоеКоличествоВыделенныхСтрок;
		УстановитьТекстСтатуснойСтроки(УФ);
	КонецЕсли; 
			
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПриАктивизацииПоля(УФ, Элемент) Экспорт 
	
	Элементы = УФ.Элементы;
	Журнал_ОписаниеКолонок = УФ.Журнал_ОписаниеКолонок;
	
	Если (Элементы.Журнал.ТекущийЭлемент = Неопределено) Тогда
		Возврат;
	КонецЕсли; 
	
	ИмяКолонки = СтрЗаменить(Элементы.Журнал.ТекущийЭлемент.Имя, "Журнал_", "");
	// --- 
	ОтборУстановлен = Ложь;
	ОтборПоПериоду = Ложь;
	СуммаДоступна = Ложь;
	Сортировка = УФ.Перечисления_CW_ПорядокСортировки_Нет;
	
	СвойстваКолонки = УФ.Журнал_СписокСвойствКолонок.НайтиПоЗначению(ИмяКолонки);
	Если (СвойстваКолонки <> Неопределено) Тогда
		
		СтрокаКолонки = Журнал_ОписаниеКолонок.НайтиПоИдентификатору(Число(СвойстваКолонки.Представление));
		Если (СтрокаКолонки <> Неопределено) Тогда
			
			Если СтрокаКолонки.УстановленОтбор Тогда
				ОтборУстановлен = Истина;
			КонецЕсли; 
			
			Если СтрокаКолонки.ТипЗначения.Типы()[0] = Тип("Дата") Тогда
				ОтборПоПериоду = Истина;
			КонецЕсли;
			
			Если СтрокаКолонки.ТипЗначения.Типы()[0] = Тип("Число") Тогда
				СуммаДоступна = Истина;
			КонецЕсли; 
			
			Сортировка = СтрокаКолонки.Сортировка; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если (НЕ ЭтоФормаЗаказа(УФ) И НЕ ЭтоФормаЗаявки(УФ)) Тогда
		
		Элементы.ЖурналОтборПоЗначению.Пометка = ОтборУстановлен;
		
	КонецЕсли; 
	
	Если (НЕ ЭтоФормаЗаказа(УФ) И НЕ ЭтоФормаЗаявки(УФ)) Тогда
		
		Элементы.ЖурналОтборПоПериоду.Доступность = ОтборПоПериоду;
		
	КонецЕсли; 
	
	Элементы.ЖурналСуммаВыделенныхЯчеек.Доступность = СуммаДоступна;

	Если Сортировка=УФ.Перечисления_CW_ПорядокСортировки_Нет Тогда
		Элементы.ЖурналСортироватьПоВозрастанию.Пометка=Ложь;
		Элементы.ЖурналСортироватьПоУбыванию.Пометка=Ложь;
	ИначеЕсли Сортировка=УФ.Перечисления_CW_ПорядокСортировки_ПоВозрастанию Тогда 
		Элементы.ЖурналСортироватьПоВозрастанию.Пометка=Истина;
		Элементы.ЖурналСортироватьПоУбыванию.Пометка=Ложь;
	ИначеЕсли Сортировка=УФ.Перечисления_CW_ПорядокСортировки_ПоУбыванию Тогда 
		Элементы.ЖурналСортироватьПоВозрастанию.Пометка=Ложь;
		Элементы.ЖурналСортироватьПоУбыванию.Пометка=Истина;
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Функция ЭтоФормаЗаказа(УФ)
	// --- 
	
	Если УФ.ИмяФормы = "Справочник.CW_Заказы.Форма.ФормаЭлемента" Тогда
		
		Возврат(Истина);
		
	Иначе
		
		Возврат(Ложь);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаКлиенте
Функция ЭтоФормаЗаявки(УФ)
	// --- 
	
	Если УФ.ИмяФормы = "Справочник.CW_Заявки.Форма.ФормаЭлемента" Тогда
		
		Возврат(Истина);
		
	Иначе
		
		Возврат(Ложь);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

  
&НаКлиенте
Функция ЭтоФормаЖурналаГрузоперевозок(УФ)
	// --- 
	
	Возврат(УФ.ИмяФормы = "Обработка.CW_ЖурналГрузоперевозок.Форма.Форма");
	
	// --- 
КонецФункции

&НаКлиенте
Функция ЭтоФормаЖурналаЗаявок(Знач УФ)
	// --- 
	
	Возврат(УФ.ИмяФормы = "Обработка.CW_ЖурналЗаявок.Форма.Форма");
	
	// --- 
КонецФункции

&НаКлиенте
Функция ЭтоФормаЖурналаЗаказов(Знач УФ)
	// --- 
	
	Возврат(УФ.ИмяФормы = "Обработка.CW_ЖурналЗаказов.Форма.Форма");
	
	// --- 
КонецФункции
// ---------------------------------------------------------------------------- 

#Область ПометкаУдаления

&НаКлиенте
Функция ДиалогПодтвержденияПометкиУдаления(УФ,Параметры, ПроцедураОбратногоВызова)
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияПометкиУдаления",ЭтотОбъект, Новый Структура("Грузоперевозки,ПОВ",Параметры.Грузоперевозки,ПроцедураОбратногоВызова)); 
	ПоказатьВопрос(ПОВ,Параметры.ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,"Предупреждение");
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаПодтвержденияПометкиУдаления(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ИзменитьПометкуУдаления",ДополнительныеПараметры.Грузоперевозки));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ОтборСортировка 

&НаКлиенте
Функция ОтборИСортировка_Диалог(УФ, ПроцедураОбратногоВызова)
	
	АдресНастроекКомпоновщик 	= ПоместитьВоВременноеХранилище(УФ.Журнал_КомпоновщикНастроек.Настройки, УФ.УникальныйИдентификатор);
	ВыводитьАрхивные 			= ?(ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ), Истина, УФ.ВыводитьАрхивные);
	
	// открываем форму настройки отбора и сортировки
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияОтбораИСортировки",ЭтотОбъект,Новый Структура("УФ,ПОВ",УФ,ПроцедураОбратногоВызова));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновки", 			УФ.Журнал_СхемаКомпоновки);	
	ПараметрыФормы.Вставить("НастройкиКомпоновщика", 	АдресНастроекКомпоновщик);	
	ПараметрыФормы.Вставить("ВыводитьАрхивные", 		ВыводитьАрхивные);	

	ОткрытьФорму("ОбщаяФорма.CW_ЖурналГрузоперевозок_НастройкаОтбора",ПараметрыФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияОтбораИСортировки(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ДополнительныеПараметры.УФ.Журнал_ТекущаяНастройка = Неопределено;
	ДополнительныеПараметры.УФ.Журнал_КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(Ответ.АдресНастроек));
	
	Если (НЕ ЭтоФормаЗаказа(ДополнительныеПараметры.УФ) И НЕ ЭтоФормаЗаявки(ДополнительныеПараметры.УФ)) Тогда
		ДополнительныеПараметры.УФ.ВыводитьАрхивные = Ответ.ВыводитьАрхивные;
	КонецЕсли;        
	
	Если (НЕ ДополнительныеПараметры.УФ.Журнал_РежимНастройки) Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ОбновитьДанныеПриИзмененииОтбора"));	
	КонецЕсли;      
	
	
КонецПроцедуры
  

&НаКлиенте
Функция ОтключитьОтбор(УФ)
	
	УФ.Журнал_ТекущаяНастройка = Неопределено;
	УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	Если (НЕ УФ.Журнал_РежимНастройки) Тогда
		Возврат(_УФКС.СД("Журналы","сервер","/ОбновитьДанныеПриИзмененииОтбора"));	
	КонецЕсли; 
	
КонецФункции

#Область ОтборПоСтатусам 

&НаКлиенте
Функция УстановитьОтборПоСтатусам(УФ, ПроцедураОбратногоВызова)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("УФ", 	УФ);
	ДополнительныеПараметры.Вставить("ПОВ", ПроцедураОбратногоВызова);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаИзменениеОтбораПоСтатусам",ЭтотОбъект,ДополнительныеПараметры);
	
	АдресНастроекОтбора = ПоместитьВоВременноеХранилище(УФ.Журнал_СтруктураНастроек["ОтборПоСтатусам"]);
	ВыводитьАрхивные 	= ?(ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ),Истина,УФ.ВыводитьАрхивные);
	
	ПараметрыФормыОтбора = Новый Структура;
	ПараметрыФормыОтбора.Вставить("АдресНастроекОтбора", АдресНастроекОтбора);
	ПараметрыФормыОтбора.Вставить("ВыводитьАрхивные",	 ВыводитьАрхивные);
	ПараметрыФормыОтбора.Вставить("ИмяФормыИсточника",	 УФ.ИмяФормы);

	ОткрытьФорму("ОбщаяФорма.CW_ФормаОтбораПоСтатусам",ПараметрыФормыОтбора,УФ,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзменениеОтбораПоСтатусам(Ответ, ДополнительныеПараметры) Экспорт 

	Если (Ответ <> Неопределено) Тогда
		
		ДополнительныеПараметры.УФ.Журнал_СтруктураНастроек["ОтборПоСтатусам"] = Ответ.Список;
		//Если (НЕ ЭтоФормаЗаказа(ДополнительныеПараметры.УФ) И НЕ ЭтоФормаЗаявки(ДополнительныеПараметры.УФ)) Тогда
		//	ДополнительныеПараметры.УФ.ВыводитьАрхивные = Ответ.ВыводитьАрхивные;
		//КонецЕсли; 
		ДополнительныеПараметры.УФ.Журнал_ТекущаяНастройка = Неопределено;
		Если (ЭтоФормаЖурналаГрузоперевозок(ДополнительныеПараметры.УФ)) Тогда
			ДополнительныеПараметры.УФ.Журнал_НастройкаИзменена = Истина;
		КонецЕсли; 
		Если (НЕ ДополнительныеПараметры.УФ.Журнал_РежимНастройки) Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/УстановитьОтборПоСтатусам"));
		КонецЕсли; 
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Функция УстановитьОтборПоФинансовымСтатусам(УФ, ПроцедураОбратногоВызова)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("УФ", 	УФ);
	ДополнительныеПараметры.Вставить("ПОВ", ПроцедураОбратногоВызова);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаИзменениеОтбораПоФинансовымСтатусам",ЭтотОбъект,ДополнительныеПараметры);
	
	АдресНастроекОтбора = ПоместитьВоВременноеХранилище(УФ.Журнал_СтруктураНастроек["ОтборПоФинансовымСтатусам"]);
	ВыводитьАрхивные 	= ?(ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ),Истина,УФ.ВыводитьАрхивные);
	
	ПараметрыФормыОтбора = Новый Структура;
	ПараметрыФормыОтбора.Вставить("АдресНастроекОтбора", АдресНастроекОтбора);
	ПараметрыФормыОтбора.Вставить("ИмяФормыИсточника",	 УФ.ИмяФормы);

	ОткрытьФорму("ОбщаяФорма.CW_ФормаОтбораПоФинансовымСтатусам",ПараметрыФормыОтбора,УФ,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзменениеОтбораПоФинансовымСтатусам(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если (Ответ <> Неопределено) Тогда
		
		ДополнительныеПараметры.УФ.Журнал_СтруктураНастроек["ОтборПоФинансовымСтатусам"] = Ответ.Список;

		ДополнительныеПараметры.УФ.Журнал_ТекущаяНастройка = Неопределено;
		Если (ЭтоФормаЖурналаГрузоперевозок(ДополнительныеПараметры.УФ)) Тогда
			ДополнительныеПараметры.УФ.Журнал_НастройкаИзменена = Истина;
		КонецЕсли; 
		Если (НЕ ДополнительныеПараметры.УФ.Журнал_РежимНастройки) Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/УстановитьОтборПоФинансовымСтатусам"));
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти 

&НаКлиенте
Функция СортировкаКолонки_ОпределитьНужныйПорядокПоНажатию(УФ, ПорядокНажатый)
	
	Если ПорядокНажатый = "Возр" Тогда
		
		Если УФ.Элементы.ЖурналСортироватьПоВозрастанию.Пометка Тогда
			УФ.Элементы.ЖурналСортироватьПоВозрастанию.Пометка=Ложь;
			Возврат(_УФКС.СД("Журналы","сервер","/СортировкаКолонки","Нет"));
		Иначе
			УФ.Элементы.ЖурналСортироватьПоВозрастанию.Пометка=Истина;
			УФ.Элементы.ЖурналСортироватьПоУбыванию.Пометка=Ложь;
			Возврат(_УФКС.СД("Журналы","сервер","/СортировкаКолонки","Возр"));
		КонецЕсли;
		
	ИначеЕсли ПорядокНажатый = "Убыв" Тогда
		
		Если УФ.Элементы.ЖурналСортироватьПоУбыванию.Пометка Тогда
			УФ.Элементы.ЖурналСортироватьПоУбыванию.Пометка=Ложь;
			Возврат(_УФКС.СД("Журналы","сервер","/СортировкаКолонки","Нет"));
		Иначе
			УФ.Элементы.ЖурналСортироватьПоУбыванию.Пометка=Истина;
			УФ.Элементы.ЖурналСортироватьПоВозрастанию.Пометка=Ложь;
			Возврат(_УФКС.СД("Журналы","сервер","/СортировкаКолонки","Убыв"));
		КонецЕсли;
		
	КонецЕсли; 
	
КонецФункции

#Область ОтборПоПериоду


&НаКлиенте
Функция ОтборПоПериодуДиалог(УФ,Параметры, ПроцедураОбратногоВызова)
	// --- 
	
	// пытаемся найти границы периода в текущем отборе
	
	// определяем поле компоновки данных
	ИмяКолонки = СтрЗаменить(УФ.Элементы.Журнал.ТекущийЭлемент.Имя, "Журнал_", "");
	Строки = УФ.Журнал_ОписаниеКолонок.НайтиСтроки(Новый Структура("Имя",ИмяКолонки));
	СтрокаКолонки = Строки[0];
	СтрокаПоляКомпоновки = СтрокаКолонки.СтрокаПоляКомпоновки;
	
	// анализируем свойства колонки
	ТребуетсяУточнениеОтбора = Ложь;
	Если (СтрокаКолонки.КонтрольнаяДатаГрузоперевозки И НЕ СтрокаКолонки.КонтрольнаяДатаПлан И НЕ СтрокаКолонки.КонтрольнаяДатаФакт) Тогда
		
		ТребуетсяУточнениеОтбора = Истина; 
		
	КонецЕсли; 
	// --- 
	Если (ТребуетсяУточнениеОтбора) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаУточненияВариантаОтбора",ЭтотОбъект, Новый Структура("УФ,СтрокаПоляКомпоновки,ПроцедураОбратногоВызова",УФ,СтрокаПоляКомпоновки,ПроцедураОбратногоВызова)); 
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(1,"Фактическое значение");
		СписокВыбора.Добавить(2,"Плановое значение");
		СписокВыбора.Добавить(3,"Любое значение");
		СписокВыбора.ПоказатьВыборЭлемента(ПОВ,"Выберите вариант отбора");
		
	Иначе
		
		ПоказатьДиалогВыбораПериода(УФ,СтрокаПоляКомпоновки,ПроцедураОбратногоВызова);
		
	КонецЕсли; 
	
	// --- 
		
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаУточненияВариантаОтбора(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ.Значение = 1 ИЛИ Ответ.Значение = 2) Тогда
			
			// дорабатываем поле компоновки
			СтрокаПоляКомпоновки = ДополнительныеПараметры.СтрокаПоляКомпоновки;
			СтрокаПоляКомпоновки = СтрЗаменить(СтрокаПоляКомпоновки,"]","");
			Если (Ответ.Значение = 1) Тогда
				СтрокаПоляКомпоновки = СтрокаПоляКомпоновки + "_ЗначениеФакт";
			Иначе
				СтрокаПоляКомпоновки = СтрокаПоляКомпоновки + "_ЗначениеПлан";
			КонецЕсли; 
			СтрокаПоляКомпоновки = СтрокаПоляКомпоновки + "]";
			// --- 
			ПоказатьДиалогВыбораПериода(ДополнительныеПараметры.УФ,СтрокаПоляКомпоновки,ДополнительныеПараметры.ПроцедураОбратногоВызова);
			
		Иначе
			
			ПоказатьДиалогВыбораПериода(ДополнительныеПараметры.УФ,ДополнительныеПараметры.СтрокаПоляКомпоновки,ДополнительныеПараметры.ПроцедураОбратногоВызова);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ПоказатьДиалогВыбораПериода(УФ,СтрокаПоляКомпоновкиДанных,ПроцедураОбратногоВызова)
	// --- 
	
	НачалоПериода = Дата(1,1,1);
	ИдентификаторСтрокиНачалаПериода = Неопределено;
	КонецПериода =  Дата(1,1,1);
	ИдентификаторСтрокиКонцаПериода = Неопределено;

	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(СтрокаПоляКомпоновкиДанных);
	ПравоеЗначение = СтрЗаменить(СтрокаПоляКомпоновкиДанных,"_ЗначениеПлан","");
	ПравоеЗначение = СтрЗаменить(СтрокаПоляКомпоновкиДанных,"_ЗначениеФакт","");
	// --- 
	Для каждого СтрокаОтбора Из УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если (ТипЗнч(СтрокаОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")) Тогда
			
			ЛевоеЗначение = Строка(СтрокаОтбора.ЛевоеЗначение);
			ЛевоеЗначение = СтрЗаменить(ЛевоеЗначение,"_ЗначениеПлан","");
			ЛевоеЗначение = СтрЗаменить(ЛевоеЗначение,"_ЗначениеФакт","");
			
			// Строка(СтрокаОтбора.ЛевоеЗначение)
			Если (ЛевоеЗначение = ПравоеЗначение) Тогда
				
				Если (СтрокаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно) Тогда
					
					НачалоПериода = СтрокаОтбора.ПравоеЗначение;
					ИдентификаторСтрокиНачалаПериода = УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.ПолучитьИдентификаторПоОбъекту(СтрокаОтбора);
					
				ИначеЕсли (СтрокаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно) Тогда 
					
					КонецПериода = СтрокаОтбора.ПравоеЗначение; 
					ИдентификаторСтрокиКонцаПериода = УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.ПолучитьИдентификаторПоОбъекту(СтрокаОтбора);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПериодаОтбора",ЭтотОбъект, Новый Структура("УФ,Полекомпоновки,ИСНП,ИСКП,ПОВ",УФ,ПолеКомпоновки,ИдентификаторСтрокиНачалаПериода,ИдентификаторСтрокиКонцаПериода,ПроцедураОбратногоВызова)); 
	Если (КонецПериода <> Дата(1,1,1)) Тогда
		КонецПериода = КонецДня(КонецПериода);
	КонецЕсли; 
	Период = Новый СтандартныйПериод(НачалоДня(НачалоПериода),КонецПериода);
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогПериода.Период = Период;
	ДиалогПериода.Показать(ПОВ);
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ОбработкаВыбораПериодаОтбора(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		УФ = ДополнительныеПараметры.УФ;
		
		Если (Ответ.ДатаНачала = Дата(1,1,1)) Тогда
			
			// удаляем строку отбора
			Если (ДополнительныеПараметры.ИСНП <> Неопределено) Тогда
				
				СтрокаОтбора = УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(ДополнительныеПараметры.ИСНП);
				УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(СтрокаОтбора);
				
			КонецЕсли; 			
			
		Иначе
			
			Если (ДополнительныеПараметры.ИСНП <> Неопределено) Тогда
				СтрокаОтбора = УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(ДополнительныеПараметры.ИСНП);
			Иначе
				СтрокаОтбора = УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				СтрокаОтбора.ЛевоеЗначение = ДополнительныеПараметры.ПолеКомпоновки;
				СтрокаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			КонецЕсли; 
			
			СтрокаОтбора.ПравоеЗначение = НачалоДня(Ответ.ДатаНачала);
			СтрокаОтбора.Использование = Истина;
			
		КонецЕсли;
		// --- 
		Если (Ответ.ДатаОкончания = Дата(1,1,1)) Тогда
			
			// удаляем строку отбора
			Если (ДополнительныеПараметры.ИСКП <> Неопределено) Тогда
				
				СтрокаОтбора = УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(ДополнительныеПараметры.ИСКП);
				УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(СтрокаОтбора);
				
			КонецЕсли; 			
			
		Иначе
			
			Если (ДополнительныеПараметры.ИСКП <> Неопределено) Тогда
				СтрокаОтбора = УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(ДополнительныеПараметры.ИСКП);
			Иначе
				СтрокаОтбора = УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				СтрокаОтбора.ЛевоеЗначение = ДополнительныеПараметры.ПолеКомпоновки;
				СтрокаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			КонецЕсли; 
			
			СтрокаОтбора.ПравоеЗначение = КонецДня(Ответ.ДатаОкончания);
			СтрокаОтбора.Использование = Истина;
			
		КонецЕсли; 
		
		// --- 
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ОбновитьДанныеПриИзмененииОтбора"));
		
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

#Область ОтборПоСпискуЗначений 

&НаКлиенте
Функция ПолучитьОписаниеОповещенияТекущегоМодуля(ДополнительныеПараметры) Экспорт
	
	Возврат Новый ОписаниеОповещения("ОбработкаИзмененияОтбораПоСпискуЗначений",ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Функция ОтборПоСпискуЗначенийДиалог(УФ,ПараметрыФормы, ПроцедураОбратногоВызова)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияОтбораПоСпискуЗначений",ЭтотОбъект,Новый Структура("УФ,ПОВ,ПараметрыФормы",УФ,ПроцедураОбратногоВызова,ПараметрыФормы));
	ОткрытьФорму("ОбщаяФорма.CW_ЖурналГрузоперевозок_ОтборПоСпискуЗначений", ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияОтбораПоСпискуЗначений(ОтборПоСписку, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (ОтборПоСписку <> Неопределено) Тогда
		
		Отб = ДополнительныеПараметры.УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отб.Использование = Истина;
		Мас = ДополнительныеПараметры.УФ.Журнал_ОписаниеКолонок.НайтиСтроки(Новый Структура("Имя", ДополнительныеПараметры.ПараметрыФормы.Имяколонки));
		Если Мас.Количество() = 1 Тогда
			
			Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Мас[0].СтрокаПоляКомпоновки);
			Отб.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Отб.ПравоеЗначение = ОтборПоСписку;
			// --- 
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ОбновитьДанныеПриИзмененииОтбора"));
			
		Иначе
			
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","клиент","/Предупреждение","Не удалось наложить отбор!"));
			
		КонецЕсли;	
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

#Область ОтборПоТексту 

&НаКлиенте
Функция ОтборКонтейнеровПоТекстуДиалог(УФ,ПроцедураОбратногоВызова)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияОтбораПоТексту",ЭтотОбъект,Новый Структура("УФ,ПОВ",УФ,ПроцедураОбратногоВызова));
	
	ПараметрыФормы  = Новый Структура;
	ПоказатьНастройки = ЭтоФормаЖурналаГрузоперевозок(УФ) или ЭтоФормаЖурналаЗаявок(УФ) или ЭтоФормаЖурналаЗаказов(УФ);
	ПараметрыФормы.Вставить("ПоказатьНастройки",ПоказатьНастройки);
	
	Если ЭтоФормаЗаказа(УФ) или ЭтоФормаЗаявки(УФ) Тогда
		ПараметрыФормы.Вставить("ОбъектСсылка", УФ.Объект.Ссылка);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.CW_ЖурналГрузоперевозок_ОтборКонтейнеровПоТексту",ПараметрыФормы,УФ,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияОтбораПоТексту(ОтборПоТексту, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (ОтборПоТексту <> Неопределено) Тогда
		
		Сп = Новый Массив; 
		УчестьОтбор = Ложь; 
		УчестьСтатусы = Ложь;
		
		ОтборПоТексту.Свойство("НастройкиОтбора", Сп);
		ОтборПоТексту.Свойство("УчестьОтбор", УчестьОтбор);
		ОтборПоТексту.Свойство("УчестьСтатусы", УчестьСтатусы);
		
		Если (НЕ УчестьОтбор) Тогда
			ДополнительныеПараметры.УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		КонецЕсли;	
		
		Отб = ДополнительныеПараметры.УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отб.Использование = Истина;
		Отб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		Отб.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		СписокОтбора = Новый СписокЗначений;
		СписокОтбора.ЗагрузитьЗначения(Сп);
		Отб.ПравоеЗначение = СписокОтбора;
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ОбновитьДанныеПриИзмененииОтбора",Новый Структура("ОбновлятьОтборПоСтатусам,ОбновлятьОтборПоФинансовымСтатусам",УчестьСтатусы,УчестьСтатусы)));
		
	КонецЕсли;	
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

#КонецОбласти 

#Область Раскраска 

&НаКлиенте
Функция Раскрасить_Диалог(УФ,ПроцедураОбратногоВызова)
	
	Элементы = УФ.Элементы;
	Журнал_Данные = УФ.Журнал_Данные;
	
	МассивСсылок = Новый Массив;
	Для каждого Стр Из Элементы.Журнал.ВыделенныеСтроки Цикл
		Если НЕ ТипЗнч(Стр) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда 
			МассивСсылок.Добавить(Журнал_Данные.НайтиПоИдентификатору(Стр).Ссылка);
		КонецЕсли;
	КонецЦикла; 
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат(Неопределено);
	КонецЕсли; 

	// дадим выбрать цвет
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияРаскраски",ЭтотОбъект,Новый Структура("УФ,ПОВ,МассивСсылок",УФ,ПроцедураОбратногоВызова,МассивСсылок));
	ОткрытьФорму("Справочник.CW_Цвета.Форма.ФормаВыбора",,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияРаскраски(Результат, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Результат <> Неопределено) Тогда
		
		Параметры = Новый Структура("МассивСсылок, ЭлементСправочникаЦвета", ДополнительныеПараметры.МассивСсылок, Результат);
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/РаскраситьУстановкаЦветаИОформления",Параметры));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

#Область Эксель

&НаКлиенте
Функция ОткрытьЛибоРедактировать(УФ, ВыбраннаяСтрока, ПроцедураОбратногоВызова) Экспорт 
	
	Элементы = УФ.Элементы;
	Журнал_СтруктураНастроек = УФ.Журнал_СтруктураНастроек;
	
	РежимОткрытия = Истина;
	
	Если (Журнал_СтруктураНастроек["РежимЕкселя"]) Тогда  
		
		// проверяем, что колонка редактируется
		ИмяКолонки = НРег(СтрЗаменить(Элементы.Журнал.ТекущийЭлемент.Имя,"Журнал_",""));
		ПараметрыКолонки = ПараметрыКолонки(УФ, ИмяКолонки);
		Если (ПараметрыКолонки = Неопределено) Тогда
			Возврат(Неопределено);
		КонецЕсли; 
		Если (ПараметрыКолонки.РежимПрямогоРедактирования) Тогда
			
			МассивВыделенных = ПолучитьМассивВыделенныхГрузоперевозок(УФ);
			
			Если НЕ ПараметрыКолонки.РежимМножественногоРедактирования И МассивВыделенных.Количество() > 1 Тогда
				
				РежимОткрытия = Ложь;
				_УФК.ВывестиПредупреждение("Множественное редактирование невозможно.");
				
			Иначе
				
				Отказ = Ложь;
				Если ПараметрыКолонки.ИспользованиеОтбора Тогда
					СтруктураПараметров = новый Структура;
					СтруктураПараметров.Вставить("ОбъектХарактеристики"				, ПараметрыКолонки.ОбъектХарактеристики);
					СтруктураПараметров.Вставить("МассивСсылок"						, МассивВыделенных);
					СтруктураПараметров.Вставить("ЭтоФормаЖурналаГрузоперевозок"	, ЭтоФормаЖурналаГрузоперевозок(УФ));
					СтруктураПараметров.Вставить("ЭтоФормаЖурналаЗаявок"			, ЭтоФормаЖурналаЗаявок(УФ));
					СтруктураПараметров.Вставить("ЭтоФормаЖурналаЗаказов"			, ЭтоФормаЖурналаЗаказов(УФ));
					СтруктураПараметров.Вставить("ЭтоФормаЗаказа"					, ЭтоФормаЗаказа(УФ));
					
					Отказ = CW_Журналы_Сервер.ПроверитьНаличиеОтбора(СтруктураПараметров);
				КонецЕсли;  
				
				РежимОткрытия = Ложь;
				Если Не Отказ Тогда
					Возврат(ПроизвестиРедактирование(ПроцедураОбратногоВызова,УФ,МассивВыделенных, ПараметрыКолонки));	
				Иначе
					_УФК.ВывестиПредупреждение("Множественное редактирование невозможно.
												|Необходимо, чтобы значения реквзитов отбора параметра ("+ПараметрыКолонки.Заголовок+") были идентичными!");
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;

	Если (РежимОткрытия) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", УФ.Журнал_Данные.НайтиПоИдентификатору(ВыбраннаяСтрока)["ссылка"]);
		ПараметрыФормы.Вставить("НеРассчитыватьСтатусыПриЗаписи", Истина);
		
		Если (ЭтоФормаЖурналаГрузоперевозок(УФ)) Тогда
			ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаОбъекта", ПараметрыФормы, Элементы.Журнал);
		ИначеЕсли (ЭтоФормаЗаказа(УФ)) Тогда 
			ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаОбъекта", ПараметрыФормы, Элементы.Журнал);
		ИначеЕсли (ЭтоФормаЗаявки(УФ)) Тогда 
			ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаОбъекта", ПараметрыФормы, Элементы.Журнал);
		ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
			ОткрытьФорму("Справочник.CW_Заявки.ФормаОбъекта", ПараметрыФормы, Элементы.Журнал,,,,,РежимОткрытияОкнаФормы.Независимый);
		ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
			ОткрытьФорму("Справочник.CW_Заказы.ФормаОбъекта", ПараметрыФормы, Элементы.Журнал,,,,,РежимОткрытияОкнаФормы.Независимый);
		КонецЕсли; 
				
	КонецЕсли;
	
	Возврат(Неопределено);
	
КонецФункции

#КонецОбласти 

#Область ОчисткаЗначений 

&НаКлиенте
Функция ОчиститьЗначения_ЗадатьВопрос(УФ, ПроцедураОбратногоВызова)
	
	Элементы = УФ.Элементы;
	Журнал_ОписаниеКолонок = УФ.Журнал_ОписаниеКолонок;
	
	// очищаем
	ИмяКолонки = НРег(СтрЗаменить(Элементы.Журнал.ТекущийЭлемент.Имя,"Журнал_",""));
	НайденныеКолонки = Журнал_ОписаниеКолонок.НайтиСтроки(Новый Структура("Имя",ИмяКолонки));
	
	Если (НайденныеКолонки.Количество() <> 0) Тогда
		
		ПараметрыКолонки = НайденныеКолонки[0];
		
		Если ПараметрыКолонки.РежимПрямогоРедактирования Тогда
			
			ПОВ_Очистка = Новый ОписаниеОповещения("ОбработкаОчисткиЗначений",ЭтотОбъект,Новый Структура("ПОВ,УФ,ПараметрыКолонки",ПроцедураОбратногоВызова, УФ, ПараметрыКолонки));
			
			ПОВ_ВопросОбОчистке = Новый ОписаниеОповещения("ОбработкаОтветаОбОчисткеЗначений",ЭтотОбъект,Новый Структура("ПОВ",ПОВ_Очистка));
	
			Если Элементы.Журнал.ВыделенныеСтроки.Количество() = 1 Тогда
				ТекстВопроса = "Очистить значение для выделенного объекта?";
			Иначе
				ТекстВопроса = "Очистить значение для выделенных объектов ("+Строка(Элементы.Журнал.ВыделенныеСтроки.Количество())+")?";
			КонецЕсли; 
			
			ПоказатьВопрос(ПОВ_ВопросОбОчистке, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат(Неопределено);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОтветаОбОчисткеЗначений(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ=КодВозвратаДиалога.Да Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ);
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОчисткиЗначений(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,ПроизвестиРедактирование(ДополнительныеПараметры.ПОВ,ДополнительныеПараметры.УФ,ПолучитьМассивВыделенныхГрузоперевозок(ДополнительныеПараметры.УФ), ДополнительныеПараметры.ПараметрыКолонки, Истина));
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

&НаКлиенте
Функция ПолучитьМассивВыделенныхГрузоперевозок(УФ)
	
	Массив = Новый Массив;
	Для каждого ИдентификаторСтроки Из УФ.Элементы.Журнал.ВыделенныеСтроки Цикл   
		
		СтрокаТекущая =  УФ.Журнал_Данные.НайтиПоИдентификатору(ИдентификаторСтроки);
		//РаботаСАрхивомОбъектов  
		Если CW_АрхивОбъектовСервер.ВАрхиве(СтрокаТекущая.Ссылка) Тогда
			Продолжить;
		КонецЕсли ;     
		//РаботаСАрхивомОбъектов   
		
		Массив.Добавить(СтрокаТекущая.Ссылка);  
		
	КонецЦикла;

	Возврат Массив;
	
КонецФункции    


&НаКлиенте
Функция ПараметрыКолонки(УФ, ИмяКолонки)
	
	массСтрокОписанияКолонки = УФ.Журнал_ОписаниеКолонок.НайтиСтроки(Новый Структура("Имя", ИмяКолонки));
	Если (массСтрокОписанияКолонки.Количество() <> 0) Тогда
		Возврат(массСтрокОписанияКолонки[0]);
	Иначе
		Возврат(Неопределено);
	КонецЕсли; 
	
КонецФункции

#Область Редактирование 

&НаКлиенте
Функция ПроизвестиРедактирование(ПроцедураОбратногоВызова,Форма,МассивСсылок, ПараметрыКолонки, РежимОчистки=Ложь)
	
	Если Не ЭтоФормаЗаказа(Форма) и Не ЭтоФормаЗаявки(Форма) Тогда
		Форма.АктивноРедактированиеВРежимеExcel = Истина;             
	КонецЕсли;
	
	ЭтоПараметр = (ПараметрыКолонки.ПараметрГрузоперевозки ИЛИ ПараметрыКолонки.КонтрольнаяДатаГрузоперевозки);
	ЭтоРеквизит = (НЕ ЭтоПараметр);
	
	Если (ЭтоПараметр) Тогда
		// если это параметр грузоперевозки
		ВыбраннаяФорма 			= Неопределено;
		ТолькоПросмотрПарамера 	= CW_Журналы_Сервер.ТолькоПросмотрПараметра(ПараметрыКолонки.ОбъектХарактеристики);

		СвойстваПараметра = CW_Мониторинг.СтруктураСвойствПараметра(ПараметрыКолонки.ОбъектХарактеристики);
		ПОВ = Новый ОписаниеОповещения("ОбработатьРезультатРедактированияПараметра",ЭтотОбъект, Новый Структура("УФ,ПОВ,ВидОперации,СвойстваПараметра,МассивСсылок,Параметр",Форма,ПроцедураОбратногоВызова,"Параметр",СвойстваПараметра,МассивСсылок,ПараметрыКолонки.ОбъектХарактеристики));
		
		Если (НЕ РежимОчистки) Тогда
			
			АдресОбъекта = Неопределено;
			Если МассивСсылок.Количество() > 0 Тогда   
				ВыделеннаяСтрока = Форма.Журнал_Данные.НайтиПоИдентификатору(Форма.Элементы.Журнал.ТекущаяСтрока);
				АдресОбъекта = CW_Журналы_Сервер.АдресОбъекта(ВыделеннаяСтрока.ссылка, Форма.УникальныйИдентификатор)
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Режим", 					"РедактированиеСписка");
			ПараметрыФормы.Вставить("Параметр", 				ПараметрыКолонки.ОбъектХарактеристики);
			ПараметрыФормы.Вставить("АдресСвойствПараметра", 	ПоместитьВоВременноеХранилище(СвойстваПараметра,Форма.УникальныйИдентификатор));
			ПараметрыФормы.Вставить("РедактируемыеОбъекты", 	МассивСсылок);
			ПараметрыФормы.Вставить("РежимОчистки", 			РежимОчистки);
			ПараметрыФормы.Вставить("ТолькоПросмотр", 			ТолькоПросмотрПарамера);
			ПараметрыФормы.Вставить("АдресОбъекта", 			АдресОбъекта);
			// --- 
			Если СвойстваПараметра.ИспользоватьФормуВыбораОбъекта тогда
				
				Если Не ТолькоПросмотрПарамера Тогда
					ВыбраннаяФорма = СвойстваПараметра.ИмяФормыВыбора;
					
					ПараметрыФормы.Вставить("РежимВыбора"		, Истина);
					ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
					
					Если СвойстваПараметра.ИспользуютсяДополнительныеЗначения Тогда
						ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец",ПараметрыКолонки.ОбъектХарактеристики));
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				Если СвойстваПараметра.ИспользуетсяВнешняяОбработкаПередНачаломИзменения Тогда
					
					СтруктураПараметров = _ПО.ПолучитьИмяФормыНаСервере(ПараметрыКолонки.ОбъектХарактеристики, АдресОбъекта);
					ВыбраннаяФорма 		= "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";

					ОбработчикНеИспользуется = Ложь;
					Если СтруктураПараметров.Свойство("НеИспользуется") Тогда
						ОбработчикНеИспользуется = СтруктураПараметров.НеИспользуется;
					КонецЕсли;
					
					Если СтруктураПараметров.Свойство("ТолькоПросмотр") Тогда
						Если  НЕ ПараметрыФормы.ТолькоПросмотр Тогда
							ПараметрыФормы.ТолькоПросмотр =  СтруктураПараметров.ТолькоПросмотр;
						КонецЕсли;
					КонецЕсли;
					
					Если СтруктураПараметров.Свойство("ПодключаемыйОбъект") Тогда
						ПараметрыФормы.Вставить("ПодключаемыйОбъект",СтруктураПараметров.ПодключаемыйОбъект);
					КонецЕсли; 
					
					Если ОбработчикНеИспользуется ИЛИ 
						СтруктураПараметров.РежимОткрытия = 1 Тогда
						ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
				    ИначеЕсли	СтруктураПараметров.РежимОткрытия = 0 Тогда
						ВыбраннаяФорма = СтруктураПараметров.ИмяФормы;
					КонецЕсли;
					
				Иначе
					ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
				КонецЕсли;

			КонецЕсли;
			
			Если ВыбраннаяФорма <> Неопределено Тогда
				ОткрытьФорму(ВыбраннаяФорма, ПараметрыФормы,Форма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
	
			Возврат(Неопределено);
			
		ИначеЕсли (РежимОчистки) Тогда
			
			СтруктураЗначения = Новый Структура;
			СтруктураЗначения.Вставить("Параметр",     ПараметрыКолонки.ОбъектХарактеристики);
			СтруктураЗначения.Вставить("РежимОчистки", Истина);
			СтруктураЗначения.Вставить("Значение",     Неопределено);
			// --- 
			ВыполнитьОбработкуОповещения(ПОВ,СтруктураЗначения);
			Возврат(Неопределено);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	// --- 
	
	Если (ЭтоРеквизит) Тогда
		
		// редактирование реквизитов
		ИмяРеквизита = СтрЗаменить(ПараметрыКолонки.СтрокаПоляКомпоновки, "Ссылка.", "");
		ПОВ = Новый ОписаниеОповещения("ОбработатьРезультатРедактированияПараметра",ЭтотОбъект, Новый Структура("УФ,ПОВ,ВидОперации,МассивСсылок",Форма,ПроцедураОбратногоВызова,"Реквизит",МассивСсылок));
		ПОВ_ИзменениеРеквизита = Новый ОписаниеОповещения("ОбработкаИзмененияЗначенияРеквизита",ЭтотОбъект, Новый Структура("УФ,ПОВ,ПОВ_Редактирования,ИмяРеквизита,РежимОчистки",Форма,ПроцедураОбратногоВызова,ПОВ,ИмяРеквизита,РежимОчистки));
		
		Если (НЕ РежимОчистки) Тогда
			
			СтруктураТаблицы = CW_Журналы_Сервер.ИмяТаблицыПоОписаниюТипов(ПараметрыКолонки.ТипЗначения);
			
			ВыделеннаяСтрока = Форма.Журнал_Данные.НайтиПоИдентификатору(Форма.Элементы.Журнал.ТекущаяСтрока);
			ЗначениеПоля 	 = ВыделеннаяСтрока[ПараметрыКолонки.Имя]; 
			
			Если ЗначениеЗаполнено(СтруктураТаблицы.ИмяТаблицы) тогда
				//Ссылка
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("РежимВыбора", Истина);
				ПараметрыФормы.Вставить("МножественыйВыбор", Ложь);
				
				ПараметрыФормы.Вставить("ТекущаяСтрока", ЗначениеПоля);
				
				ОткрытьФорму(СтруктураТаблицы.ИмяТаблицы+".ФормаВыбора",ПараметрыФормы,,,,,ПОВ_ИзменениеРеквизита,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе
				//Примитивынй
				Если СтруктураТаблицы.ТипРеквизита = тип("Строка") Тогда 
					ПоказатьВводСтроки(ПОВ_ИзменениеРеквизита,ЗначениеПоля,ПараметрыКолонки.Заголовок,,Истина);
				Иначе
					ПоказатьВводЗначения(ПОВ_ИзменениеРеквизита,ЗначениеПоля,ПараметрыКолонки.Заголовок, СтруктураТаблицы.ТипРеквизита); 
				КонецЕсли;
			КонецЕсли;
			
			Возврат(Неопределено);
			
		КонецЕсли;
			
		Если (РежимОчистки) Тогда
			
			ВыполнитьОбработкуОповещения(ПОВ_ИзменениеРеквизита,Неопределено);
			Возврат(Неопределено);
			
		КонецЕсли; 
		
	КонецЕсли; 
	 	
КонецФункции



&НаКлиенте
Процедура ОбработкаИзмененияЗначенияРеквизита(НовоеЗначениеРеквизита,ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если НовоеЗначениеРеквизита <> Неопределено ИЛИ ДополнительныеПараметры.РежимОчистки Тогда
		
		СтруктураЗначения=Новый Структура;
		СтруктураЗначения.Вставить("Реквизит",     ДополнительныеПараметры.ИмяРеквизита);
		СтруктураЗначения.Вставить("РежимОчистки", ДополнительныеПараметры.РежимОчистки);
		СтруктураЗначения.Вставить("Значение",     НовоеЗначениеРеквизита);
		// --- 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ_Редактирования,СтруктураЗначения);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ОбработатьРезультатРедактированияПараметра(СтруктураЗначения, ДополнительныеПараметры) Экспорт 

	Если (СтруктураЗначения <> Неопределено) Тогда 
		
		Если ТипЗнч(СтруктураЗначения) <> Тип("Структура") Тогда
			//В случае если ответ форме не имеет тип структура, поместим его в структуру для последующей обработки
			СтруктураЗначения = _ПО.ПолучитьСтруктуруОтветаВнешнейФормы(СтруктураЗначения, ДополнительныеПараметры.Параметр);
		КонецЕсли;

		Параметры = Новый Структура("МассивСсылок, ВидОперации, СтруктураЗначения, СписокВедомых, СписокАдресовЗначенийПараметров");
		Параметры.МассивСсылок = ДополнительныеПараметры.МассивСсылок;
		Параметры.ВидОперации = ДополнительныеПараметры.ВидОперации;
		Параметры.СтруктураЗначения = СтруктураЗначения;
		Если (ДополнительныеПараметры.Свойство("СвойстваПараметра") <> Ложь) Тогда
			Параметры.СписокВедомых = ДополнительныеПараметры.СвойстваПараметра.СписокВедомых.ВыгрузитьЗначения();
		КонецЕсли; 
		
		Если ДополнительныеПараметры.УФ.СписокАдресовЗначенийПараметров.Количество() > 0 Тогда
			Параметры.Вставить("СписокАдресовЗначенийПараметров", ДополнительныеПараметры.УФ.СписокАдресовЗначенийПараметров);	
		КонецЕсли;  
		
		//По зявке AFR-240470 от 26.11.2024 
		МассивУдаляемых = Новый Массив;
		Для Каждого ПроверяемаяСсылка из Параметры.МассивСсылок Цикл 
			
			Если ТипЗнч(ПроверяемаяСсылка) = Тип("СправочникСсылка.CW_Заявки") Тогда 
				Продолжить;
			КонецЕсли; 
			
			ДатуЗакрытияМониторинга = CW_Мониторинг.ПолучитьДатуЗакрытияМониторинга(ПроверяемаяСсылка);
			Если ДатуЗакрытияМониторинга <> Дата(1,1,1) Тогда
				МассивУдаляемых.Добавить(ПроверяемаяСсылка);   
				Сообщить("Для "+СокрЛП(ПроверяемаяСсылка)+" установлена блокировка (логистических) мониторинговых параметров. Изменения значения параметра не возможно!");
			КонецЕсли;
		КонецЦикла;   
		
		Для Каждого УдаляемаяСсылка из МассивУдаляемых Цикл
			Параметры.МассивСсылок.Удалить(Параметры.МассивСсылок.Найти(УдаляемаяСсылка));			
		КонецЦикла;
		//---по зявке AFR-240470 от 26.11.2024 
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ПроизвестиРедактирование", Параметры));
		
		ОповещениеООбновитьСтатусыОбъектов = Новый ОписаниеОповещения("ОбновитьСтатусыОбъектов", ДополнительныеПараметры.УФ, ДополнительныеПараметры);
		ВыполнитьОбработкуОповещения(ОповещениеООбновитьСтатусыОбъектов, Истина);
		
		Оповестить("ОбновитьДеревоПараметровГрузоперевозкиПоЗаказу", ДополнительныеПараметры.МассивСсылок);
		
	КонецЕсли;
	
	Если Не ЭтоФормаЗаказа(ДополнительныеПараметры.УФ) 
		и Не ЭтоФормаЗаявки(ДополнительныеПараметры.УФ) Тогда
		ДополнительныеПараметры.УФ.АктивноРедактированиеВРежимеExcel = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область СуммаВыделенных 

&НаКлиенте
Функция СуммаВыделенныхЯчеек(УФ)
	
	Элементы = УФ.Элементы;
	Журнал_Данные = УФ.Журнал_Данные;
	
	СуммаЗначений 			= 0;
	МинимальноеЗначение 	= Неопределено;
	МаксимальноеЗначение 	= Неопределено;
	
	Для каждого Стр Из Элементы.Журнал.ВыделенныеСтроки Цикл
		
		СтрокаЖурнала 	= Журнал_Данные.НайтиПоИдентификатору(Стр);
		ЗначениеЯчейки	= СтрокаЖурнала[СтрЗаменить(Элементы.Журнал.ТекущийЭлемент.Имя,"Журнал_","")];
		
		Если ТипЗнч(ЗначениеЯчейки)=Тип("Число") Тогда
			_сф.Инкремент(СуммаЗначений,ЗначениеЯчейки);
		КонецЕсли; 
		
		Если  МинимальноеЗначение = Неопределено Тогда
			МинимальноеЗначение = ЗначениеЯчейки;
		Иначе
			МинимальноеЗначение = ?(ЗначениеЯчейки < МинимальноеЗначение, ЗначениеЯчейки, МинимальноеЗначение); 
		КонецЕсли;
		
		Если  МаксимальноеЗначение = Неопределено Тогда
			МаксимальноеЗначение = ЗначениеЯчейки;
		Иначе
			МаксимальноеЗначение = ?(ЗначениеЯчейки > МаксимальноеЗначение, ЗначениеЯчейки, МаксимальноеЗначение); 
		КонецЕсли;
		
	КонецЦикла; 
	
	КоличествоЗначений  =  Элементы.Журнал.ВыделенныеСтроки.Количество();
	СреднееЗначение		= ?(КоличествоЗначений=0,0, СуммаЗначений/КоличествоЗначений);
	
	СтркутраПараметров = Новый Структура;
	СтркутраПараметров.Вставить("КоличествоЗначений"	, КоличествоЗначений);
	СтркутраПараметров.Вставить("СреднееЗначение"		, СреднееЗначение);
	СтркутраПараметров.Вставить("МинимальноеЗначение"	, МинимальноеЗначение);
	СтркутраПараметров.Вставить("МаксимальноеЗначение"	, МаксимальноеЗначение);
	СтркутраПараметров.Вставить("СуммаЗначений"			, СуммаЗначений);
	
	
	ОткрытьФорму("ОбщаяФорма.CW_ВычислитьЗначениеЖурнала",СтркутраПараметров,УФ,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
Конецфункции

&НаКлиенте
Процедура ОбработкаПоказаСуммы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область НастройкаСписка

&НаКлиенте
Функция НастройкаСписка_Диалог(УФ, ПараметрыФормы, ПроцедураОбратногоВызова)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияНастройкиСписка",ЭтотОбъект,Новый Структура("УФ,ПОВ",УФ,ПроцедураОбратногоВызова));
	Попытка
		ПараметрыФормы.Вставить("ИмяФормыИсточника",УФ.ИмяФормы);
		ОткрытьФорму("ОбщаяФорма.CW_ЖурналГрузоперевозок_НастройкаКолонок", ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Исключение
	    Возврат(_УФКС.СД("Журналы","клиент","/Предупреждение","Ошибка чтения настроек журнала"));
	КонецПопытки; 
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияНастройкиСписка(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		Если ЭтоФормаЖурналаГрузоперевозок(ДополнительныеПараметры.УФ) 
			ИЛИ ЭтоФормаЖурналаЗаявок(ДополнительныеПараметры.УФ) 
			ИЛИ ЭтоФормаЖурналаЗаказов(ДополнительныеПараметры.УФ) Тогда
			ДополнительныеПараметры.УФ.Журнал_НастройкаИзменена = Истина;
		КонецЕсли; 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ВосстановитьНастройкуСписка",Ответ));
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ИменныеНастройки 

&НаКлиенте
Функция СохранитьНастройку_Диалог(УФ,ПроцедураОбратногоВызова)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаСохраненияНастроек",ЭтотОбъект,Новый Структура("ПОВ",ПроцедураОбратногоВызова));
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
		КлючОбъекта = "ОбработкаОбъект.CW_ЖурналГрузоперевозок";
	ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
		КлючОбъекта = "ОбработкаОбъект.CW_ЖурналЗаявок";
	ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
		КлючОбъекта = "ОбработкаОбъект.CW_ЖурналЗаказов";
	КонецЕсли; 
	ПараметрыФормы = Новый Структура("КлючОбъекта,РежимОткрытия,РежимВыбора,ИмяФормыВладельца",КлючОбъекта,"Сохранение",Истина,УФ.ИмяФормы);
	ОткрытьФорму("Справочник.CW_НастройкиПользователей.Форма.ФормаУправленияНастройками", ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаСохраненияНастроек(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/СохранитьНастройку",Ответ));
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Функция ЗагрузитьНастройку_Диалог(УФ,ПроцедураОбратногоВызова)
	
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
		КлючОбъекта = "ОбработкаОбъект.CW_ЖурналГрузоперевозок";
	ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
		КлючОбъекта = "ОбработкаОбъект.CW_ЖурналЗаявок";
	ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
		КлючОбъекта = "ОбработкаОбъект.CW_ЖурналЗаказов";
	КонецЕсли;
	ПараметрыФормы = Новый Структура("КлючОбъекта,РежимОткрытия,РежимВыбора,ИмяФормыВладельца",КлючОбъекта,"Загрузка",Истина,УФ.ИмяФормы);
	ПОВ = Новый ОписаниеОповещения("ОбработкаЗагрузкиНастроек",ЭтотОбъект,Новый Структура("ПОВ",ПроцедураОбратногоВызова));
	ОткрытьФорму("Справочник.CW_НастройкиПользователей.Форма.ФормаУправленияНастройками", ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаЗагрузкиНастроек(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ЗагрузитьНастройку",Ответ));
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Функция ФинансовыйОтчет(ПараметрыФормы)
	
	ОткрытьФорму("Отчет.CW_ФинансовыйОтчет.Форма.ФормаОтчета", ПараметрыФормы);
	Возврат(Неопределено);
	
КонецФункции

// --- 

&НаКлиенте
Функция СформироватьДокументыПоБюджету(УФ)
	
	МассивГП = Новый Массив;
	Для каждого Стр Из УФ.Элементы.Журнал.ВыделенныеСтроки Цикл
		
		МассивГП.Добавить(УФ.Журнал_Данные.НайтиПоИдентификатору(Стр).ссылка);
		
	КонецЦикла; 
	// --- 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Грузоперевозки", МассивГП);
	ПараметрыФормы.Вставить("УИД",УФ.УникальныйИдентификатор);
	ПараметрыФормы.Вставить("ВидДоговора",ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
	ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаЗаполненияПоБюджету", ПараметрыФормы);
	Возврат(Неопределено);
	
КонецФункции

// --- 

#Область ДобавлениеГрузоперевозокВЗаказ 

&НаКлиенте
Функция ПодключитьГрузоперевозки(УФ,ПроцедураОбратногоВызова)
	
	ПОВ_ВыборГрузоперевозок = Новый ОписаниеОповещения("ВыборПодключаемыхГрузоперевозок",ЭтотОбъект,Новый Структура("УФ,ПОВ",УФ,ПроцедураОбратногоВызова));
	Если (НЕ ЗначениеЗаполнено(УФ.Объект.Ссылка)) Тогда 
		
		// заказ новый
		ПОВ_ВопросСохранения = Новый ОписаниеОповещения("ОбработкаВопросаСохраненияЗаказа",ЭтотОбъект,Новый Структура("УФ,ПОВ_ВыборГрузоперевозок", УФ,ПОВ_ВыборГрузоперевозок));
		ПоказатьВопрос(ПОВ_ВопросСохранения,"Перед добавлением новой Грузоперевозки Заказ будет записан. Продолжить?", РежимДиалогаВопрос.ОКОтмена);  
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ПОВ_ВыборГрузоперевозок);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВопросаСохраненияЗаказа(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.ОК) Тогда
		
		ДополнительныеПараметры.УФ.Записать();
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ_ВыборГрузоперевозок);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыборПодключаемыхГрузоперевозок(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораГрузоперевозок",ЭтотОбъект,Новый Структура("УФ,ПОВ",ДополнительныеПараметры.УФ,ДополнительныеПараметры.ПОВ));
	// --- 
	ПараметрыФормы = Новый Структура;
	Отбор =  Новый Структура("Заказ", ПредопределенноеЗначение("Справочник.CW_Заказы.ПустаяСсылка"));
	Если (ЗначениеЗаполнено(ДополнительныеПараметры.УФ.Объект.Клиент)) Тогда
		ПараметрыФормы.Вставить("Клиент",ДополнительныеПараметры.УФ.Объект.Клиент);
	КонецЕсли; 
	ПараметрыФормы.Вставить("Отбор",Отбор);
	// ДополнительныеПараметры.УФ.Объект.Клиент
	ПараметрыФормы.Вставить("МножественныйВыбор", 	Истина);
	ПараметрыФормы.Вставить("РежимВыбора",			Истина);
	// --- 
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора", ПараметрыФормы, ДополнительныеПараметры.УФ.Элементы.Журнал,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ОбработкаВыбораГрузоперевозок(Грузоперевозки, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Грузоперевозки <> Неопределено) Тогда 
		
		Если (ТипЗнч(Грузоперевозки)<>Тип("Массив")) Тогда 
			СсылкаГП = Грузоперевозки;
			масс = Новый Массив();
			масс.Добавить(СсылкаГП);
		Иначе
			масс = Грузоперевозки;
		КонецЕсли;
		// --- 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ПодключитьГрузоперевозки",масс));
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

#КонецОбласти 

// --- 

&НаКлиенте
Функция Выбрать(УФ)
	// --- 
	
	МассивВыбранных = Новый Массив;
	Для каждого Стр Из УФ.Элементы.Журнал.ВыделенныеСтроки Цикл
		
		МассивВыбранных.Добавить(УФ.Журнал_Данные.НайтиПоИдентификатору(Стр).ссылка);
		
	КонецЦикла; 
	УФ.Закрыть(МассивВыбранных);
	
	// --- 
КонецФункции

#Область ДинамическиеПараметры 

&НаКлиенте
Функция ДобавитьДинамическийПараметр(УФ, ПроцедураОбратногоВызова)
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияДинамическогоПараметра",ЭтотОбъект,Новый Структура("УФ,ПОВ",УФ,ПроцедураОбратногоВызова));
	ПФ = Новый Структура("Отбор",Новый Структура("ДинамическийПараметр",Истина));
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаДобавленияДинамическогоПараметра(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		МассивВыбранных = Новый Массив;
		Для каждого Стр Из ДополнительныеПараметры.УФ.Элементы.Журнал.ВыделенныеСтроки Цикл
			
			МассивВыбранных.Добавить(ДополнительныеПараметры.УФ.Журнал_Данные.НайтиПоИдентификатору(Стр).ссылка);
			
		КонецЦикла; 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/ДобавитьДинамическийПараметр",Новый Структура("Параметр,Грузоперевозки",Ответ,МассивВыбранных)));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Функция УдалитьДинамическийПараметр(УФ,ПроцедураОбратногоВызова)
	// --- 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаУдаленияДинамическогоПараметра",ЭтотОбъект,Новый Структура("УФ,ПОВ",УФ,ПроцедураОбратногоВызова));
	ПФ = Новый Структура("Отбор",Новый Структура("ДинамическийПараметр",Истина));
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаУдаленияДинамическогоПараметра(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		МассивВыбранных = Новый Массив;
		Для каждого Стр Из ДополнительныеПараметры.УФ.Элементы.Журнал.ВыделенныеСтроки Цикл
			
			МассивВыбранных.Добавить(ДополнительныеПараметры.УФ.Журнал_Данные.НайтиПоИдентификатору(Стр).ссылка);
			
		КонецЦикла; 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ,_УФКС.СД("Журналы","сервер","/УдалитьДинамическийПараметр",Новый Структура("Параметр,Грузоперевозки",Ответ,МассивВыбранных)));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

#КонецОбласти 