
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ЗаголовокФормы", 		ЭтаФорма.Заголовок);
	Параметры.Свойство("ДатаОплаты", 			ДатаОплаты);
	Параметры.Свойство("Комментарий", 			Комментарий);
	Параметры.Свойство("ВводСрокаОплаты", 		ВводСрокаОплаты);
	Параметры.Свойство("РучноеРедактирование", 	РучноеРедактирование);
	
	Элементы.РучноеРедактирование.Видимость = ВводСрокаОплаты;
	
	Если ВводСрокаОплаты Тогда
		Элементы.ДатаОплаты.Доступность = РучноеРедактирование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДатаОплаты", 			 ДатаОплаты);
	СтруктураДанных.Вставить("Комментарий", 		 Комментарий);
	СтруктураДанных.Вставить("РучноеРедактирование", РучноеРедактирование);
	
	ЭтаФорма.Закрыть(СтруктураДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура РучноеРедактированиеПриИзменении(Элемент)
	
	Элементы.ДатаОплаты.Доступность = РучноеРедактирование;
	
	Если Не РучноеРедактирование Тогда
		ДатаОплаты = Неопределено;
	КонецЕсли;

КонецПроцедуры
