&После("УстановитьДоступностьЭлементовЭЭР")
Процедура САБ_УстановитьДоступностьЭлементовЭЭР(Форма)
	
	САБ_ПоднятьСсылкиЭЭРНаФорму(Форма);
	
КонецПроцедуры

Процедура САБ_ПоднятьСсылкиЭЭРНаФорму(Форма)
	
	Если Форма.СтруктураРеквизитов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивВерсий = Неопределено;
	Если Не Форма.СтруктураРеквизитов.Свойство("ТитулЭкспедитора", МассивВерсий)
		Или МассивВерсий = Неопределено
		Или МассивВерсий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураТитула = МассивВерсий[МассивВерсий.ВГраница()];
	Элементы = Форма.Элементы;
	
	СсылкаДоговор = Неопределено;
	СтруктураТитула.Свойство("СсылкаТитулЭкспедитораДоговор", СсылкаДоговор);
	Если ЗначениеЗаполнено(СсылкаДоговор)
		И Не ЗначениеЗаполнено(Форма.СсылкаТитулЭкспедитораДоговор) Тогда
		Форма.СсылкаТитулЭкспедитораДоговор = СсылкаДоговор;
		ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элементы.СсылкаТитулЭкспедитораДоговор, Форма);
	КонецЕсли;
	
	СсылкаГО = Неопределено;
	СтруктураТитула.Свойство("СсылкаТитулЭкспедитораГрузоотправитель", СсылкаГО);
	Если Не ЗначениеЗаполнено(СсылкаГО) Тогда
		СтруктураТитула.Свойство("ТитулЭкспедитораГрузы__1__СсылкаГрузоотправитель", СсылкаГО);
	КонецЕсли;
	Если ЗначениеЗаполнено(СсылкаГО)
		И Не ЗначениеЗаполнено(Форма.СсылкаТитулЭкспедитораГрузоотправитель) Тогда
		Форма.СсылкаТитулЭкспедитораГрузоотправитель = СсылкаГО;
		ПараметрыЗаполнения = Новый Структура("АдресВСвободнойФорме", Истина);
		ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(
			Элементы.СсылкаТитулЭкспедитораГрузоотправитель, Форма, , , ПараметрыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры