// Содержимое модуля отличается в версиях ПРОФ и КОРП.
// В версии ПРОФ отсутствует:
// - тело экспортных процедур (остаются только сигнатуры методов)
// - неэкспортные процедуры и все функции.
// Поэтому не допускается реализация в модуле экспортных функций: вместо них следует использовать процедуры с возвращаемым параметром.

#Область ПрограммныйИнтерфейс

// Открывает форму списка документа "ОбесценениеВнеоборотныхАктивов"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
//   ОткрытыеФормы - Соответствие - коллекция открытых форм для предотвращения повторного открытия
Процедура ОткрытьВОкнеФормыОбесценениеВнеоборотныхАктивов(Форма, ОткрытыеФормы) Экспорт
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ОбесценениеВнеоборотныхАктивов.ФормаСписка",
		Форма, , , ОткрытыеФормы);
	
КонецПроцедуры

// Открывает форму списка документа "УсловияОплатыПоступления"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
//   ОткрытыеФормы - Соответствие - коллекция открытых форм для предотвращения повторного открытия
Процедура ОткрытьВОкнеФормыУсловияОплатыПоступления(Форма, ОткрытыеФормы) Экспорт
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.УсловияОплатыПоступления.ФормаСписка",
		Форма, , , ОткрытыеФормы);
	
КонецПроцедуры

// Открывает форму документа "ОбесценениеЗапасов"
//
// Параметры:
//   Форма - Форма - форма-владелец открываемой формы
//   СтруктураПараметров - Структура - параметры для инициализации открываемой формы
Процедура ОткрытьОбесценениеЗапасов(Форма, СтруктураПараметров) Экспорт
	
	ОткрытьФорму("Документ.ОбесценениеЗапасов.ФормаОбъекта", СтруктураПараметров, Форма);
	
КонецПроцедуры


#КонецОбласти