Функция ПланСчетов() Экспорт 
	// --- 
	
	Если (КонфигурацияДляРФ()) Тогда
		Возврат(ПланыСчетов["Хозрасчетный"]);
	ИначеЕсли (КонфигурацияДляРК()) Тогда 
		Возврат(ПланыСчетов["Типовой"]);
	КонецЕсли; 
	
	// --- 
КонецФункции

Функция ВидыСубконто() Экспорт 
	// --- 
	
	Если (КонфигурацияДляРФ()) Тогда
		Возврат(ПланыВидовХарактеристик["ВидыСубконтоХозрасчетные"]);	
	ИначеЕсли (КонфигурацияДляРК()) Тогда 
		Возврат(ПланыВидовХарактеристик["ВидыСубконтоТиповые"]);
	КонецЕсли; 
	
	// --- 
КонецФункции

Функция РегистрБухгалтерии() Экспорт 
	// --- 
	
	Если (КонфигурацияДляРФ()) Тогда
		Возврат(РегистрыБухгалтерии["Хозрасчетный"]);
	ИначеЕсли (КонфигурацияДляРК()) Тогда
		Возврат(РегистрыБухгалтерии["Типовой"]);
	КонецЕсли; 
	
	// --- 
КонецФункции
  
// ---------------------------------------------------------------------------- 

Функция КонфигурацияДляРФ() Экспорт 
	
	Возврат  (ВариантыПриложений.ЭтоВерсияПРОФ() или ВариантыПриложений.ЭтоВерсияКОРП()) и НЕ ВариантыПриложений.ЭтоБазоваяВерсия();
	
КонецФункции

Функция КонфигурацияДляРК() Экспорт 
	// --- 
	
	Возврат(Метаданные.Имя = "БухгалтерияДляКазахстана");
	
	// --- 
КонецФункции
  
  