
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДС.Добавить(Новый Структура);
	// --- 
	ЗачетБУ = Параметры.ЗачетБУ;
	ЗачетОЗ = Параметры.ЗачетОЗ;
	// --- 
	СуммаПоСобственным = Параметры.СуммаСобственных;
	СуммаПоПеревыставляемым = Параметры.СуммаПеревыставляемых;
	Валюта = Параметры.Валюта;
	// --- 
	ЕстьРазделение = (Параметры.СчетАвансовПоСобственным <> Параметры.СчетАвансовПоПеревыставляемым);
	Элементы.ИтогоПоСобственным.Видимость = ЕстьРазделение;
	Элементы.ИтогоПоПеревыставляемым.Видимость = ЕстьРазделение;
	
	// --- 
	Элементы.ДеревоЗачетаАванс.Заголовок = "Аванс, "+Строка(Валюта);
	Элементы.ДеревоЗачетаЗачтено.Заголовок = "Зачтено, "+Строка(Валюта);
	
	// --- 
	ОЗ = Параметры.ОЗ и НЕ Параметры.РаздельныйУчетЗаполженности;

	Элементы.ДеревоЗачетаГруппаАктируемыйСчет.Видимость = (ОЗ И ЗачетБУ);
	//Элементы.ДеревоЗачетаПоСчету.Видимость = (ОЗ И ЗачетБУ);
	//Элементы.ДеревоЗачетаАктируемыйСчет.Видимость = (ОЗ И ЗачетБУ);
	Элементы.ДеревоЗачетаВидимостьДанныхАктирования.Видимость = (ОЗ И ЗачетБУ);
	Элементы.ДеревоЗачетаЗадолженность.Видимость = (ОтображатьДанныеАктирования);
	
	// читаем параметры
	_СформироватьДерево(Параметры);
	
КонецПроцедуры

Функция _ДС()
	// --- 
	
	Возврат(ДС[0].Значение);
	
	// --- 
КонецФункции

&НаСервере
Процедура _СформироватьДерево(ПФ)
	// --- 
	
	// формируем соответствие
	ПС = Новый Соответствие;
	ПС.Вставить(ПФ.СчетАвансовПоСобственным,Новый Структура("Собственный",Истина));
	Если ПФ.СчетАвансовПоПеревыставляемым <> ПФ.СчетАвансовПоСобственным Тогда
		ПС.Вставить(ПФ.СчетАвансовПоПеревыставляемым,Новый Структура("Собственный",Ложь));
	КонецЕсли; 
	
	// --- 
	_ДС().Вставить("ПС",ПС);
	// ---------------------------------------------------------------------------- 
	
	ТаблицаАвансов = ПолучитьИзВременногоХранилища(ПФ.ТаблицаАвансов);
	
	// формируем представление
	Для каждого Стр Из ТаблицаАвансов Цикл
		
		Попытка
			
			Если (ЗачетБУ) Тогда
				
				вхНомер = Стр.ДокументАванса.НомерВходящегоДокумента;
				вхДата = Стр.ДокументАванса.ДатаВходящегоДокумента;
				Если (НЕ ЗначениеЗаполнено(вхНомер) ИЛИ НЕ ЗначениеЗаполнено(вхДата)) Тогда
					Стр.ПредставлениеДокументаАванса = Строка(Стр.ДокументАванса);
				Иначе
					Стр.ПредставлениеДокументаАванса = "П/п №"+ СокрЛП(вхНомер)+" от "+Формат(вхДата,"ДФ=dd.MM.yyyy");	
				КонецЕсли; 
				
			Иначе 
				
				Стр.ПредставлениеДокументаАванса = Стр.ДокументОплаты.ПредставлениеДокумента;
				
			КонецЕсли; 
			
		Исключение
			
			Стр.ПредставлениеДокументаАванса = "<...>";
			
		КонецПопытки; 
		
	КонецЦикла; 
	
	// группируем по счету аванса
	ТЗС = ТаблицаАвансов.Скопировать(,"СчетАванса");
	ТЗС.Свернуть("СчетАванса");
	МассивСчетовАванса = ТЗС.ВыгрузитьКолонку("СчетАванса");
	Для каждого СчетАванса Из МассивСчетовАванса Цикл
		
		Нстр = ДеревоЗачета.ПолучитьЭлементы().Добавить();
		// ---------------------------------------------------------------------------- 
		Нстр.ЭтоСчетАванса = Истина;
		Нстр.ЭтоГруппа =Истина;
		Нстр.ЭтоСчет = Ложь;
		Нстр.ИндексКартинки = 0;
		Нстр.СчетАванса = СчетАванса;
		Если ЕстьРазделение Тогда
			
			Если ПС.Получить(СчетАванса).Собственный Тогда
				
				Нстр.Представление = "Собственные услуги"+" ("+Строка(СчетАванса.Код)+")";
				
			Иначе
				
				Нстр.Представление = "Перевыставляемые услуги"+" ("+Строка(СчетАванса.Код)+")";
				
			КонецЕсли; 
			
		Иначе
			
			Нстр.Представление = Строка(СчетАванса.Код);
			
		КонецЕсли; 
		
		// --- 
		
		ТаблицаПоСчетуАванса = ТаблицаАвансов.Скопировать(_сф.ст_Отбор("СчетАванса",СчетАванса));
		Если (ТаблицаПоСчетуАванса.Колонки.Найти("Дата")=Неопределено) Тогда
			_сф.т_ДобавитьКолонку(ТаблицаПоСчетуАванса,"Дата",,Дата(1,1,1));	
		КонецЕсли; 
		Для каждого Стр Из ТаблицаПоСчетуАванса Цикл
			
			Если (ЗачетОЗ) Тогда
				Стр.Дата = Стр.ДокументОплаты.Дата;
			Иначе
				Стр.Дата = Стр.ДокументАванса.Дата;
			КонецЕсли; 
			
		КонецЦикла; 
		Если (ЗачетОЗ) Тогда
			ТаблицаПоСчетуАванса.Сортировать("ПризнакОплатыСчетовДокумента Убыв, Дата Возр");
		Иначе
			ТаблицаПоСчетуАванса.Сортировать("ПризнакОплатыСчетовДокумента Убыв, ПоСчету Убыв, Дата Возр");	
		КонецЕсли; 
		Нстр.Аванс = ТаблицаПоСчетуАванса.Итог("Аванс");
		Нстр.Зачтено = ТаблицаПоСчетуАванса.Итог("Зачтено");
		// --- 
		Для каждого СтрокаАванса Из ТаблицаПоСчетуАванса Цикл
			
			Пстр = Нстр.ПолучитьЭлементы().Добавить();
			// ----------------------------------------------------------------------------  
			Пстр.ЭтоСчетАванса = Ложь;
			Пстр.ЭтоГруппа = Ложь; // ОЗ
			Пстр.ЭтоСчет = Ложь;
			Пстр.ИндексКартинки = 1;
			Пстр.СчетАванса = СчетАванса;
			Пстр.СчетЗадолженности = СтрокаАванса.СчетЗадолженности;
			Пстр.Представление = СтрокаАванса.ПредставлениеДокументаАванса;
			Пстр.ДокументАванса = СтрокаАванса.ДокументАванса;
			Пстр.ДокументОплаты = СтрокаАванса.ДокументОплаты;
			Если (НЕ ЗачетОЗ) Тогда
				Пстр.ПризнакОплатыСчетовДокумента = СтрокаАванса.ПризнакОплатыСчетовДокумента;
				Пстр.ПоСчету = СтрокаАванса.ПоСчету;
				Пстр.Счет = СтрокаАванса.Счет;
				Если (ЗначениеЗаполнено(Пстр.Счет)) Тогда
					Пстр.ПредставлениеСчета = Пстр.Счет.ПредставлениеДокумента;	
				КонецЕсли; 
				Пстр.Задолженность = СтрокаАванса.Задолженность;	
			КонецЕсли; 
			Пстр.Аванс = СтрокаАванса.Аванс;
			Пстр.Зачтено = СтрокаАванса.Зачтено;
			
		КонецЦикла; 
		
		
	КонецЦикла; 
	
	// --- 
	_ОбновитьИтоги();
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ДеревоЗачетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// открываем документы
	Если Поле = Элементы.ДеревоЗачетаПредставление Тогда
		
		СтандартнаяОбработка = Ложь;
		// --- 
		Если НЕ Элементы.ДеревоЗачета.ТекущиеДанные.ЭтоСчетАванса Тогда
						
			Попытка
				
				Если (Элементы.ДеревоЗачета.ТекущиеДанные.ЭтоСчет) Тогда
					
					ПоказатьЗначение(,Элементы.ДеревоЗачета.ТекущиеДанные.Счет);
					
				Иначе
					
					ПоказатьЗначение(,Элементы.ДеревоЗачета.ТекущиеДанные.ДокументАванса);
					
				КонецЕсли; 
				
			Исключение
			    //ОписаниеОшибки()
			КонецПопытки; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
	// зачёт
	Если Поле = Элементы.ДеревоЗачетаАванс ИЛИ Поле = Элементы.ДеревоЗачетаЗадолженность Тогда 
		
		Если (НЕ Элементы.ДеревоЗачета.ТекущиеДанные.ЭтоСчетАванса) Тогда
			
			ТД = Элементы.ДеревоЗачета.ТекущиеДанные;
			
			// проверяем, переносим 
			Если ЕстьРазделение Тогда
				
				Если _ДС().ПС.Получить(ТД.СчетАванса).Собственный Тогда
					
					УчитыватьСобственные = Истина;
					УчитыватьПеревыставляемые = Ложь;
					
				Иначе
					
					УчитыватьСобственные = Ложь;
					УчитыватьПеревыставляемые = Истина;
					
				КонецЕсли; 
				
			Иначе
				
				УчитыватьСобственные = Истина;
				УчитыватьПеревыставляемые = Истина;
				
			КонецЕсли; 
			ОстатокЗачета = ?(УчитыватьСобственные,ОстатокПоСобственным,0) + ?(УчитыватьПеревыставляемые,ОстатокПоПеревыставляемым,0);
			Если (ОЗ И ЗачетБУ И ТД.ПоСчету) Тогда
				ДоступноКЗачету = Мин(ТД.Аванс,ТД.Задолженность) - ТД.Зачтено;
			Иначе
				ДоступноКЗачету = ТД.Аванс - ТД.Зачтено;
			КонецЕсли; 
			// --- 
			Если ОстатокЗачета <= ДоступноКЗачету Тогда
				
				ТД.Зачтено = ТД.Зачтено + ОстатокЗачета;
				
			Иначе
				
				ТД.Зачтено = ДоступноКЗачету;
				
			КонецЕсли; 
			
			// --- 
			_ОбновитьИтоги();
			
		Иначе
			
			// верхний уровень
			ЗаполнитьДляСчетаАванса(Элементы.ДеревоЗачета.ТекущиеДанные.СчетАванса);
			_ОбновитьИтоги();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоЗачетаЗачтеноПриИзменении(Элемент)
	
	ТД = Элементы.ДеревоЗачета.ТекущиеДанные;
	
	Если ТД.Зачтено = 0 Тогда
			
			_ОбновитьИтоги();
			
		Иначе
			
			_ОбновитьИтоги(Ложь);
			// проверяем, что сумма зачета не превышает остаток распределения
			Если ЕстьРазделение Тогда
				
				Если _ДС().ПС.Получить(ТД.СчетАванса).Собственный Тогда
					
					Остаток = ОстатокПоСобственным;
					
				Иначе
					
					Остаток = ОстатокПоПеревыставляемым;
					
				КонецЕсли; 
				
			Иначе
				
				Остаток = ОстатокПоСобственным+ОстатокПоПеревыставляемым;
				
			КонецЕсли; 
			
			Если ТД.Зачтено > ТД.Аванс Тогда
				
				Остаток = Остаток + (ТД.Зачтено - ТД.Аванс);
				ТД.Зачтено = ТД.Аванс;
				
			КонецЕсли; 
			
			Если Остаток < 0 Тогда
				
				ТД.Зачтено = ТД.Зачтено + Остаток;
				
			КонецЕсли; 
			
			// --- 
			_ОбновитьИтоги();
			
		КонецЕсли; 
		
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьИтоги(Выводить=Истина)
	// --- 
	
	ЗачтеноПоСобственным = 0;
	ЗачтеноПоПеревыставляемым = 0;
	
	ПС = _ДС().ПС;
	
	Для каждого СтрГруппа Из ДеревоЗачета.ПолучитьЭлементы() Цикл
		
		ЗачтеноПоГруппе = 0;
		
		Для каждого Стр Из СтрГруппа.ПолучитьЭлементы() Цикл
			
			Если ПС.Получить(Стр.СчетАванса).Собственный Тогда
				
				_сф.Инкремент(ЗачтеноПоСобственным,Стр.Зачтено);
				
			Иначе
				
				_сф.Инкремент(ЗачтеноПоПеревыставляемым,Стр.Зачтено);
				
			КонецЕсли; 
			_сф.Инкремент(ЗачтеноПоГруппе,Стр.Зачтено);
			
		КонецЦикла; 
		
		СтрГруппа.Зачтено = ЗачтеноПоГруппе;
		
	КонецЦикла; 
	
	ОстатокПоСобственным = СуммаПоСобственным - ЗачтеноПоСобственным;
	ОстатокПоПеревыставляемым = СуммаПоПеревыставляемым - ЗачтеноПоПеревыставляемым;
	
	// ---------------------------------------------------------------------------- 
	
	Если Выводить Тогда
		
		Если ЕстьРазделение Тогда
			
			Элементы.ИтогоПоСобственным.Заголовок 	= "Зачтено по собственным: "+Формат(ЗачтеноПоСобственным,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Валюта)+
			?(ОстатокПоСобственным <> 0,";  Остаток по документу: "+Формат(ОстатокПоСобственным,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Валюта),""); 
			Элементы.ИтогоПоПеревыставляемым.Заголовок 	= "Зачтено по перевыставляемым: "+Формат(ЗачтеноПоПеревыставляемым,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Валюта)+
			?(ОстатокПоПеревыставляемым <> 0,";  Остаток по документу: "+Формат(ОстатокПоПеревыставляемым,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Валюта),"");
			
		КонецЕсли; 
		
		Элементы.ИтогоПоДокументу.Заголовок = "Зачтено: "+Формат(ЗачтеноПоСобственным+ЗачтеноПоПеревыставляемым,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Валюта)
		+?((ОстатокПоСобственным+ОстатокПоПеревыставляемым) <> 0,";  Остаток по документу: "+Формат(ОстатокПоСобственным+ОстатокПоПеревыставляемым,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Валюта),""); 
		
		
	КонецЕсли; 
	
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура КомандаОчистить(Команда)
	
	Для каждого СтрГруппа Из ДеревоЗачета.ПолучитьЭлементы() Цикл
		
		Для каждого Стр Из СтрГруппа.ПолучитьЭлементы() Цикл
			
			Стр.Зачтено = 0;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	_ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Для каждого СтрГруппа Из ДеревоЗачета.ПолучитьЭлементы() Цикл
		
		ЗаполнитьДляСчетаАванса(СтрГруппа.СчетАванса);
		
	КонецЦикла;
	
	_ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДляСчетаАванса(СчетАванса)
	// --- 
	
	Для каждого СтрГруппа Из ДеревоЗачета.ПолучитьЭлементы() Цикл
		
		Если СтрГруппа.СчетАванса = СчетАванса Тогда
			// --- 
			
			Если ЕстьРазделение Тогда
				
				Если _ДС().ПС.Получить(СчетАванса).Собственный Тогда
					
					Остаток = ОстатокПоСобственным;
					
				Иначе
					
					Остаток = ОстатокПоПеревыставляемым;
					
				КонецЕсли;
				
			Иначе
				
				Остаток = ОстатокПоСобственным + ОстатокПоПеревыставляемым;
				
			КонецЕсли; 
			
			Если Остаток <> 0 Тогда
				
				ОстаткиЗачетаПоАктированию = Новый СписокЗначений;
				
				Для каждого Стр Из СтрГруппа.ПолучитьЭлементы() Цикл
					
					Если (ОЗ И ЗачетБУ) Тогда
						ОстатокЗадолженности = ОстаткиЗачетаПоАктированию.НайтиПоЗначению(Стр.Счет);
						Если (ОстатокЗадолженности = Неопределено) Тогда
							ОстатокЗадолженности = ОстаткиЗачетаПоАктированию.Добавить(Стр.Счет, Формат(Стр.Задолженность,"ЧН=; ЧГ="));
						КонецЕсли;
						НезачтенноеАктированноеСальдо = Число(ОстатокЗадолженности.Представление);
						Дельта = Мин(Стр.Аванс,НезачтенноеАктированноеСальдо) - Стр.Зачтено;
						ОстатокЗадолженности.Представление = Формат(НезачтенноеАктированноеСальдо-Дельта,"ЧН=; ЧГ=");
					Иначе
						Дельта = Стр.Аванс - Стр.Зачтено;	
					КонецЕсли; 
					Прибавка = Мин(Дельта,Остаток);
					Стр.Зачтено = Стр.Зачтено + Прибавка;
					Остаток = Остаток - Прибавка;
					// --- 
					Если Остаток = 0 Тогда
						
						Прервать;
						
					КонецЕсли; 
					
				КонецЦикла; 
				
			КонецЕсли;
			
			
			// --- 
		КонецЕсли; 
		
	КонецЦикла;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЭтаФорма.Закрыть(_ПолучитьАдресТаблицы());
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресТаблицы()
	// --- 
	
	ТаблицаАвансов = _сф.т_Создать("ДокументОплаты,ДокументАванса,Счет,ПредставлениеДокументаАванса,СчетЗадолженности,СчетАванса,СуммаЗачета");
	
	Для каждого СтрГруппа Из ДеревоЗачета.ПолучитьЭлементы() Цикл
		
		Для каждого Стр Из СтрГруппа.ПолучитьЭлементы() Цикл
			
			Если Стр.Зачтено <> 0 Тогда
				
				// добавляем
				Нстр = ТаблицаАвансов.Добавить();
				// ---------------------------------------------------------------------------- 
				Нстр.ДокументАванса = Стр.ДокументАванса;
				Нстр.ПредставлениеДокументаАванса = Стр.Представление;
				Нстр.СчетАванса = Стр.СчетАванса;
				Нстр.СчетЗадолженности = Стр.СчетЗадолженности;
				Нстр.Счет = Стр.Счет;
				Нстр.СуммаЗачета = Стр.Зачтено;
				Нстр.ДокументОплаты = Стр.ДокументОплаты;
				
			КонецЕсли; 
			
			
		КонецЦикла; 
		
	КонецЦикла;
	
	Возврат(ПоместитьВоВременноеХранилище(ТаблицаАвансов,ЭтаФорма.УникальныйИдентификатор));
	
	// --- 
КонецФункции

&НаКлиенте
Процедура КомандаОткрыть(Команда)
	
	Если Элементы.ДеревоЗачета.ТекущиеДанные <> Неопределено Тогда
		
		Попытка
			
			Если (ЗачетОЗ) Тогда
				
				Если ЗначениеЗаполнено(Элементы.ДеревоЗачета.ТекущиеДанные.ДокументОплаты) Тогда
					
					ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Элементы.ДеревоЗачета.ТекущиеДанные.ДокументОплаты));
					//ПоказатьЗначение(,Элементы.ДеревоЗачета.ТекущиеДанные.Документ);
					
				КонецЕсли; 
				
			Иначе
				
				Если (Элементы.ДеревоЗачета.ТекущийЭлемент = Элементы.ДеревоЗачетаАктируемыйСчет) Тогда
					
					Если ЗначениеЗаполнено(Элементы.ДеревоЗачета.ТекущиеДанные.Счет) Тогда
						
						ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Элементы.ДеревоЗачета.ТекущиеДанные.Счет));
						
					КонецЕсли; 
					
				Иначе
					
					Если ЗначениеЗаполнено(Элементы.ДеревоЗачета.ТекущиеДанные.ДокументАванса) Тогда
						
						ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Элементы.ДеревоЗачета.ТекущиеДанные.ДокументАванса));
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьДанныхАктирования(Команда)
	
	ОтображатьДанныеАктирования = (НЕ ОтображатьДанныеАктирования);
	Элементы.ДеревоЗачетаЗадолженность.Видимость = ОтображатьДанныеАктирования;
	
КонецПроцедуры
 

 