#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("УстановитьКонстантуПриОбновленииИнформационнойБазы");
	
КонецПроцедуры

// Записывает значение константы при обновлении ИБ
//
Процедура УстановитьКонстантуПриОбновленииИнформационнойБазы() Экспорт
	
	МенеджерКонстанты = СоздатьМенеджерЗначения();
	
	ЗначениеКонстанты = Константы.ИспользуетсяАУСН.Получить()
		И Не Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить();
	
	МенеджерКонстанты.Значение = ЗначениеКонстанты;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
