&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагенты = _сф.ст_ПолучитьСвойство(Параметры,"Контрагенты");
	Владелец = _сф.ст_ПолучитьСвойство(Параметры,"Владелец");
	// --- 
	Для каждого Элемент Из Контрагенты Цикл
		
		_ДобавитьКонтрагента(Элемент);
		
	КонецЦикла; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Записать(Команда)
	
	ЭтаФорма.Закрыть(_ПолучитьМассивКонтрагентов());
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьМассивКонтрагентов()
	// --- 
	
	Возврат(ТаблицаКонтрагентов.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура ТаблицаКонтрагентовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораКонтрагента",ЭтотОбъект); 
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",Новый Структура("РежимВыбора",Истина),,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКонтрагента(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Ответ = _ДобавитьКонтрагента(Ответ,Истина);
		Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
			
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ДобавитьКонтрагента(Элемент,Контроль=Ложь)
	// --- 
	
	Если Контроль Тогда
		
		Если _сф.к_НайтиСтроку(ТаблицаКонтрагентов,_сф.ст_Отбор("Ссылка",Элемент)) <> Неопределено Тогда
			
			Возврат(_УФКС.Ответ(1,"Контрагент уже добавлен."));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Нстр = ТаблицаКонтрагентов.Добавить();
	Нстр.Ссылка = Элемент;
	Нстр.Код = Элемент.Код;
	Нстр.Наименование = Элемент.Наименование;
	Нстр.ПолноеНаименование = Элемент.НаименованиеПолное;
	Нстр.ИНН = Элемент.ИНН;
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТаблицаКонтрагентовПередУдалением(Элемент, Отказ)
	
	// проверяем, что контрагент не используется в строках бюджета
	Ответ = _ПроверкаВозможностиУдаленияКонтрагента(Элементы.ТаблицаКонтрагентов.ТекущиеДанные.Ссылка);
	Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
		
		_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПроверкаВозможностиУдаленияКонтрагента(Элемент)
	// --- 
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.CW_Заказы") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка
		               |ИЗ
		               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
		               |ГДЕ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец.Заказ = &Владелец
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Владелец", Владелец);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка
		               |ИЗ
		               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
		               |ГДЕ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Владелец", Владелец);
		
	КонецЕсли; 
	Запрос.УстановитьПараметр("Контрагент", Элемент); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() <> 0 Тогда
		
		Возврат(_УФКС.Ответ(1,"Контрагент используется в бюджете. Удаление контрагента из списка невозможно."));
		
	Иначе
		
		Возврат(_УФКС.Ответ());
		
	КонецЕсли;  
	
	// --- 
КонецФункции
 
