
Процедура ПеревестиИзвлечьОбъектыИзАрхива(ФормаВладелец, МассивСсылок, Архив, ПереводитьГрузоперевозки = Ложь) Экспорт
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("МассивСсылок", 				МассивСсылок);	
	ПараметрыВыполнения.Вставить("Архив", 						Архив);	
	ПараметрыВыполнения.Вставить("ПереводитьГрузоперевозки", 	ПереводитьГрузоперевозки);	
	
	ЗапуститьВФоне 		= МассивСсылок.Количество()> 10;
	РезультатВыполнения = CW_АрхивОбъектовСервер.ПродолжитьПеревестиИзвлечьОбъектыИзАрхиваНаСервереВФоне(ПараметрыВыполнения, ЗапуститьВФоне);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	ПараметрыОжидания.ВыводитьОкноОжидания = ЗапуститьВФоне;   
	
	ДополнительныеПараметры = новый Структура;
	ДополнительныеПараметры.Вставить("Архив",			Архив);
	ДополнительныеПараметры.Вставить("ФормаВладелец", 	ФормаВладелец);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатРаботыСАрхивом", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры 

Процедура ОбработатьРезультатРаботыСАрхивом(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		Если ЭтоФормаЖурналаГрузоперевозок(ДополнительныеПараметры.ФормаВладелец) 
			ИЛИ ЭтоФормаЖурналаЗаказов(ДополнительныеПараметры.ФормаВладелец)
			ИЛИ ЭтоФормаЖурналаЗаявок(ДополнительныеПараметры.ФормаВладелец) Тогда 
			
			Оповестить("ПереводИзвлечениеИзАрхива");
			
		Иначе
			ЭлементыФормы 	= ДополнительныеПараметры.ФормаВладелец.Элементы;  
			
			Список = ЭлементыФормы.Найти("Список");
			Если Список <> Неопределено Тогда
				Список.Обновить();
			Иначе    
				ДополнительныеПараметры.ФормаВладелец.Прочитать();
			Конецесли;   
			
		КонецЕсли;  
		
		CW_АрхивОбъектовКлиентСервер.УстановитьДоступностьЭлементовФормы(ДополнительныеПараметры.ФормаВладелец, ДополнительныеПараметры.Архив);
		
		ТекстОповещения = ?(ДополнительныеПараметры.Архив, "Перевод в архив","Извлечение из архива");
		ПоказатьОповещениеПользователя(ТекстОповещения,,"Завершено");
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось перевести/извелчь из архива!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка работы с объектами");   
		
	КонецЕсли;
	
КонецПроцедуры     

Функция ЭтоФормаЖурналаГрузоперевозок(Форма)
	
	Возврат Форма.ИмяФормы = "Обработка.CW_ЖурналГрузоперевозок.Форма.Форма";
	
КонецФункции

Функция ЭтоФормаЖурналаЗаявок(Форма)
	
	Возврат Форма.ИмяФормы = "Обработка.CW_ЖурналЗаявок.Форма.Форма";
	
КонецФункции

Функция ЭтоФормаЖурналаЗаказов(Форма)
	
	Возврат Форма.ИмяФормы = "Обработка.CW_ЖурналЗаказов.Форма.Форма";
	
КонецФункции


