#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПолучитьТаблицуДокументов", Истина);
	
КонецПроцедуры

Функция ЗапуститьПолучениеТаблицыДокументовВФоне(ПараметрыОбновления, УникальныйИдентификатор, ОжидатьВыполненияЗадания) Экспорт

	// Возможно, что фоновое задание было запущено раньше, 
	// пользователь дал команду его отменить, однако задание не отменено.
	// В таком случае не следует запускать задание повторно - следует дождаться его выполнения.
	// Мы можем отследить ситуацию только, если все это происходит в одной форме.
	// Потому что подсистема ДлительныеОперации не умеет устанавливать ключ фонового задания.
	Если ФоновоеЗаданиеПолучениеТаблицыДокументов() Тогда
		// Надо ждать
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗаданияПолучениеТаблицыДокументов();
	Если НЕ ОжидатьВыполненияЗадания Тогда
		ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0; // Возвращать управление сразу
	КонецЕсли;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ИсправитьДокументыПриИзмененииНастроекСт54НК.ПолучитьТаблицуДокументов",
		ПараметрыОбновления,
		ПараметрыВыполненияВФоне);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

Процедура ПолучитьТаблицуДокументов(Параметры, ВременноеХранилищеРезультата) Экспорт
		
	СчетаПрочиеДоходыИРасходы = Новый Массив;
	СчетаПрочиеДоходыИРасходы.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеДоходы);
	СчетаПрочиеДоходыИРасходы.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
	
	Исправления = Параметры.Исправления Или Параметры.НачалоПериода > НастройкиУчетаНалогаНаПрибыльФормыКлиентСервер.ДатаИзмененияСт54НК_425ФЗ_28_11_2025();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоДня(Параметры.НачалоПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода",  Новый Граница(КонецДня(Параметры.КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",   Параметры.Организация);
	Запрос.УстановитьПараметр("Возвраты",      Параметры.Возвраты);
	Запрос.УстановитьПараметр("Исправления",   Исправления);
	Запрос.УстановитьПараметр("Корректировки", Параметры.Корректировки);
	
	Запрос.УстановитьПараметр("СчетаПрочиеДоходыИРасходы", СчетаПрочиеДоходыИРасходы);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	|	СУММА(ХозрасчетныйОбороты.СуммаНУОборотДт) КАК СуммаОборотДт,
	|	СУММА(ХозрасчетныйОбороты.СуммаНУОборотКт) КАК СуммаОборотКт
	|ПОМЕСТИТЬ ДокументыПереносаПрибылиИУбытка
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В (&СчетаПрочиеДоходыИРасходы), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы), Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|		ПО ХозрасчетныйОбороты.Субконто1 = ПрочиеДоходыИРасходы.Ссылка
	|ГДЕ
	|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрибыльУбытокПрошлыхЛет)
	|	И (ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			ИЛИ ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления
	|			ИЛИ ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя)
	|	И (ХозрасчетныйОбороты.СуммаНУОборотДт <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаНУОборотКт <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка КАК Ссылка,
	|	КорректировкаРеализации.Дата КАК Дата,
	|	Истина Как Пометка,
	|	КорректировкаРеализации.Проведен КАК Проведен,
	|	КорректировкаРеализации.ВидОперации КАК ВидОперации,
	|	КорректировкаРеализации.Организация КАК Организация,
	|	КорректировкаРеализации.Номер КАК Номер,
	|	КорректировкаРеализации.Контрагент КАК Контрагент,
	|	КорректировкаРеализации.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументыПереносаПрибылиИУбытка.СуммаОборотДт КАК СуммаОборотДт,
	|	ДокументыПереносаПрибылиИУбытка.СуммаОборотКт КАК СуммаОборотКт
	|ИЗ
	|	ДокументыПереносаПрибылиИУбытка КАК ДокументыПереносаПрибылиИУбытка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ПО ДокументыПереносаПрибылиИУбытка.Регистратор = КорректировкаРеализации.Ссылка
	|ГДЕ
	|	(НЕ КорректировкаРеализации.Ссылка ЕСТЬ NULL)
	|	И (&Корректировки
	|				И КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|			ИЛИ &Исправления
	|				И НЕ КорректировкаРеализации.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка,
	|	КорректировкаПоступления.Дата,
	|	Истина Как Пометка,
	|	КорректировкаПоступления.Проведен,
	|	КорректировкаПоступления.ВидОперации,
	|	КорректировкаПоступления.Организация,
	|	КорректировкаПоступления.Номер,
	|	КорректировкаПоступления.Контрагент,
	|	КорректировкаПоступления.ДоговорКонтрагента,
	|	ДокументыПереносаПрибылиИУбытка.СуммаОборотДт,
	|	ДокументыПереносаПрибылиИУбытка.СуммаОборотКт
	|ИЗ
	|	ДокументыПереносаПрибылиИУбытка КАК ДокументыПереносаПрибылиИУбытка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|		ПО ДокументыПереносаПрибылиИУбытка.Регистратор = КорректировкаПоступления.Ссылка
	|ГДЕ
	|	(НЕ КорректировкаПоступления.Ссылка ЕСТЬ NULL)
	|	И (&Корректировки
	|				И КорректировкаПоступления.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение)
	|			ИЛИ &Исправления
	|				И НЕ КорректировкаПоступления.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателя.Ссылка,
	|	ВозвратТоваровОтПокупателя.Дата,
	|	Истина Как Пометка,
	|	ВозвратТоваровОтПокупателя.Проведен,
	|	ВозвратТоваровОтПокупателя.ВидОперации,
	|	ВозвратТоваровОтПокупателя.Организация,
	|	ВозвратТоваровОтПокупателя.Номер,
	|	ВозвратТоваровОтПокупателя.Контрагент,
	|	ВозвратТоваровОтПокупателя.ДоговорКонтрагента,
	|	ДокументыПереносаПрибылиИУбытка.СуммаОборотДт,
	|	ДокументыПереносаПрибылиИУбытка.СуммаОборотКт
	|ИЗ
	|	ДокументыПереносаПрибылиИУбытка КАК ДокументыПереносаПрибылиИУбытка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|		ПО ДокументыПереносаПрибылиИУбытка.Регистратор = ВозвратТоваровОтПокупателя.Ссылка
	|ГДЕ
	|	(НЕ ВозвратТоваровОтПокупателя.Ссылка ЕСТЬ NULL)
	|	И &Возвраты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Параметры.Свойство("КоличествоДокументов")
		И Параметры.КоличествоДокументов Тогда
		Результат = Результат.Количество();
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, ВременноеХранилищеРезультата);
	
КонецПроцедуры

Функция ЗаменитьДвиженияДокументов(МассивДокументов) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СообщениеОбОшибке", Неопределено);
	Результат.Вставить("МассивДокументовСОшибками", Новый Массив);
	
	Для каждого Документ Из МассивДокументов Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
				ЭлементБлокировки  = Блокировка.Добавить("Документ.ВозвратТоваровОтПокупателя");
				РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Дата, Организация, Сделка");
				ДокументОснование  = РеквизитыДокумента.Сделка;
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
				ЭлементБлокировки  = Блокировка.Добавить("Документ.КорректировкаПоступления");
				РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Дата, Организация, ДокументПоступления");
				ДокументОснование  = УчетНДСПереопределяемый.ПолучитьИсправляемыйДокументПоступления(РеквизитыДокумента.ДокументПоступления, Истина);
			ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				ЭлементБлокировки  = Блокировка.Добавить("Документ.КорректировкаРеализации");
				РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Дата, Организация, ДокументРеализации");
				ДокументОснование  = УчетНДСПереопределяемый.ПолучитьИсправляемыйДокументРеализации(РеквизитыДокумента.ДокументРеализации, Истина);
			Иначе
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Документ);
			Блокировка.Заблокировать();
				
			ПроводкиДокумента = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
			ПроводкиДокумента.Отбор.Регистратор.Установить(Документ);
			ПроводкиДокумента.Прочитать();
			
			ДатаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата");
			СкорректироватьПроводкиДокумента(ПроводкиДокумента, ДатаОснования);
				
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПроводкиДокумента);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Результат.МассивДокументовСОшибками.Добавить(Документ);
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Не удалось обработать документ %1 по причине: %2'"),
					Документ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(
				Документ, , ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СкорректироватьПроводкиДокумента(Проводки, ДатаОснования)
	
	Если Проводки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СчетаПрочиеДоходыИРасходы = Новый Массив;
	СчетаПрочиеДоходыИРасходы.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеДоходы);
	СчетаПрочиеДоходыИРасходы.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
	
	Период      = Проводки[0].Период;
	Организация = Проводки[0].Организация;
	СчетаВыручкиСебестоимости = НалоговыйУчет.СчетаВыручкиСебестоимости(Период, Организация);
	
	СторонаКоррСчета = Новый Соответствие;
	СторонаКоррСчета.Вставить("Дт", "Кт");
	СторонаКоррСчета.Вставить("Кт", "Дт");
	
	ДопПроводкиБУ = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	ФинРезультатНУ = 0;
	Для Каждого Проводка Из Проводки Цикл
		
		Если Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ПрочиеДоходы 
			И Проводка.СуммаНУКт > 0 Тогда
			СторонаСчета = "Кт";
			ФинРезультатНУ = ФинРезультатНУ + Проводка.СуммаНУКт;
		ИначеЕсли Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ПрочиеРасходы 
			И Проводка.СуммаНУДт > 0 Тогда
			СторонаСчета = "Дт";
			ФинРезультатНУ = ФинРезультатНУ - Проводка.СуммаНУДт;
		Иначе
			Продолжить;
		КонецЕсли;
		
		КоррСчет = Проводка["Счет" + СторонаКоррСчета.Получить(СторонаСчета)];
		Если Проводка.Сумма = 0 И
			(СчетаВыручкиСебестоимости.Выручка[КоррСчет] <> Неопределено 
			ИЛИ СчетаВыручкиСебестоимости.СебестоимостьПродаж[КоррСчет] <> Неопределено) Тогда
			//Если это возврат товаров от покупателя
			Проводка.Период = ДатаОснования;
			Проводка["СуммаНУ" + СторонаКоррСчета.Получить(СторонаСчета)] = - Проводка["СуммаНУ" + СторонаСчета];
			Проводка["СуммаНУ" + СторонаСчета] = 0;
			Проводка.Содержание = "Корректировка доходов и расходов в периоде возникновения ошибки";
			
		ИначеЕсли ТипЗнч(Проводки[0].Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			
			НоваяПроводка = ДопПроводкиБУ.Добавить();
			НоваяПроводка.Период = ДатаОснования;
			ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка, , "Период, КоличествоДт, КоличествоКт, Сумма, СуммаНУДт, СуммаНУКт");
			
			НоваяПроводка.СчетДт = Проводка.СчетКт;
			НоваяПроводка.СчетКт = Проводка.СчетДт;
			
			Для Каждого Субконто Из Проводка["Субконто" + СторонаКоррСчета.Получить(СторонаСчета)] Цикл
				НоваяПроводка["Субконто" + СторонаСчета].Вставить(Субконто.Ключ, Субконто.Значение);
			КонецЦикла;
			
			Если СторонаСчета = "Кт" Тогда
				НоваяПроводка.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
			Иначе
				НоваяПроводка.СчетКт = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД;
			Конецесли;
			
			РеализуемыеАктивы = Проводка["Субконто" + СторонаСчета].РеализуемыеАктивы;
			Если ЗначениеЗаполнено(РеализуемыеАктивы)
				И ТипЗнч(РеализуемыеАктивы) = Тип("СправочникСсылка.Номенклатура") Тогда
				НоменклатурнаяГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеализуемыеАктивы, "НоменклатурнаяГруппа");
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка["Счет" + СторонаКоррСчета.Получить(СторонаСчета)], 
					НоваяПроводка["Субконто" + СторонаКоррСчета.Получить(СторонаСчета)], "НоменклатурныеГруппы", НоменклатурнаяГруппа);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка["Счет" + СторонаКоррСчета.Получить(СторонаСчета)], 
					НоваяПроводка["Субконто" + СторонаКоррСчета.Получить(СторонаСчета)], "Номенклатура", РеализуемыеАктивы);
			КонецЕсли;
			
			НоваяПроводка["СуммаНУ" + СторонаКоррСчета.Получить(СторонаСчета)] = - Проводка["СуммаНУ" + СторонаСчета];
			
			// Непосредственно корректировка проводок
			Проводка["СуммаНУ" + СторонаСчета] = 0;
			
		Иначе
			//Это корректировка корректировка поступления
			НоваяПроводка = ДопПроводкиБУ.Добавить();
			НоваяПроводка.Период = ДатаОснования;
			ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка, , "Период, КоличествоДт, КоличествоКт, Сумма, СуммаНУДт, СуммаНУКт");
			
			Для Каждого Субконто Из Проводка["Субконто" + СторонаКоррСчета.Получить(СторонаСчета)] Цикл
				НоваяПроводка["Субконто" + СторонаКоррСчета.Получить(СторонаСчета)].Вставить(Субконто.Ключ, Субконто.Значение);
			КонецЦикла;
			
			Если СторонаСчета = "Кт" Тогда
				НоваяПроводка.СчетКт = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД;
			Иначе
				НоваяПроводка.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
			Конецесли;
			
			РеализуемыеАктивы = Проводка["Субконто" + СторонаСчета].РеализуемыеАктивы;
			Если ЗначениеЗаполнено(РеализуемыеАктивы)
				И ТипЗнч(РеализуемыеАктивы) = Тип("СправочникСсылка.Номенклатура") Тогда
				НоменклатурнаяГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеализуемыеАктивы, "НоменклатурнаяГруппа");
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка["Счет" + СторонаСчета], 
					НоваяПроводка["Субконто" + СторонаСчета], "НоменклатурныеГруппы", НоменклатурнаяГруппа);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка["Счет" + СторонаСчета], 
					НоваяПроводка["Субконто" + СторонаСчета], "Номенклатура", РеализуемыеАктивы);
			КонецЕсли;
			
			НоваяПроводка["СуммаНУ" + СторонаСчета] = Проводка["СуммаНУ" + СторонаСчета];
			
			// Непосредственно корректировка проводок
			Проводка["СуммаНУ" + СторонаСчета] = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ДопПроводка Из ДопПроводкиБУ Цикл
		НоваяПроводка = Проводки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяПроводка, ДопПроводка);
		Для Каждого Субконто Из ДопПроводка.СубконтоДт Цикл
			НоваяПроводка.СубконтоДт.Вставить(Субконто.Ключ, Субконто.Значение);
		КонецЦикла;
		Для Каждого Субконто Из ДопПроводка.СубконтоКт Цикл
			НоваяПроводка.СубконтоКт.Вставить(Субконто.Ключ, Субконто.Значение);
		КонецЦикла;
	КонецЦикла;
		
	Проводка 				= Проводки.Добавить();
	Проводка.Период       	= ДатаОснования;
	Проводка.Организация  	= Организация;
	Проводка.Содержание   	= "Финансовый результат корректировки";
	
	Если ФинРезультатНУ > 0 Тогда
		Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ПрибыльУбытокОтПродаж;
		Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ПрибылиИУбытки", Перечисления.ПрибылиИУбытки.ПрибыльУбытокОтПродаж);
		Множитель = 1;
	Иначе
		Проводка.СчетДт = ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПрибылиИУбытки", Перечисления.ПрибылиИУбытки.ПрибыльУбытокОтПродаж);
		Проводка.СчетКт = ПланыСчетов.Хозрасчетный.ПрибыльУбытокОтПродаж;
		Множитель = -1;
	КонецЕсли;
	
	Проводка.СуммаНУДт = ФинРезультатНУ * Множитель;
	Проводка.СуммаНУКт = ФинРезультатНУ * Множитель;
	
КонецПроцедуры

Функция КлючФоновогоЗаданияПолучениеТаблицыДокументов()
	
	Возврат "ПолучитьТаблицуДокументовПриИзмененииНастроекСт54НК";
	
КонецФункции

Функция НаименованиеФоновогоЗаданияПолучениеТаблицыДокументов()
	
	Возврат НСтр("ru = 'Получение документов, движения которых требуют корректировки при изменении настроек применения ст. 54 НК РФ'");
	
КонецФункции

Функция ФоновоеЗаданиеПолучениеТаблицыДокументов()
	
	КлючФоновогоЗадания = КлючФоновогоЗаданияПолучениеТаблицыДокументов();
	
	ВыполняющиесяФоновоеЗаданиеЗаполненияМонитора = ФоновыеЗадания.ПолучитьФоновыеЗадания(
		Новый Структура("Ключ, Состояние", КлючФоновогоЗадания, СостояниеФоновогоЗадания.Активно));
	Если ВыполняющиесяФоновоеЗаданиеЗаполненияМонитора.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли