&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокДоступныхОбъектов();
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Элементы.ИдентификаторОбъекта.СписокВыбора.Количество() > 0  и Не ЗначениеЗаполнено(Объект.ИдентификаторОбъекта) Тогда 
			ЭлементСписка 		= Элементы.ИдентификаторОбъекта.СписокВыбора.Получить(0);
			Объект.ИдентификаторОбъекта = ЭлементСписка.Значение;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Настройки = Параметры.ЗначениеКопирования.ХранилищеОтбора.Получить();   
		Если Настройки <> Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ГруппаУсловия.Видимость = НЕ Объект.Предопределенный;
	
	Если НЕ Объект.Предопределенный Тогда
		ИнициализацияКопоновщика();
	КонецЕсли;
	
	УстановитьВидимостьКонтрольнойДаты();
	
	УстановитьЗначениеПустойСсылкиОбъектаСтатуса();
	
	//Определяем необходимость расскарски
	УстановитьВидимостьГруппыЦветов();

КонецПроцедуры

&НаСервере
Функция УстановитьВидимостьКонтрольнойДаты()
	
	мТипыПоОпциям 		= ПолучитьМассивТиповПоОпциям();
	ТипИдентификатора 	= ТипЗнч(Объект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
	
	ИспользуетсяМаксимальноеЗначениеКонтрольнойДаты = мТипыПоОпциям.Найти(ТипИдентификатора) <> Неопределено;
	Элементы.КонтрольнаяДата.Видимость 				= ИспользуетсяМаксимальноеЗначениеКонтрольнойДаты И НЕ Объект.Предопределенный;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивТиповПоОпциям()
	
	Результат = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("CW_РассчитыватьЛогистическийСтатусГрузоперевозкиПоНаиболшейКонтрольнойДате") Тогда
		Результат.Добавить(Тип("СправочникСсылка.CW_Грузоперевозки"));
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("CW_РассчитыватьЛогистическийСтатусЗаказаПоНаиболшейКонтрольнойДате") Тогда
		Результат.Добавить(Тип("СправочникСсылка.CW_Заказы"));
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("CW_РассчитыватьЛогистическийСтатусЗявкиПоНаиболшейКонтрольнойДате") Тогда
		Результат.Добавить(Тип("СправочникСсылка.CW_Заявки"));
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	CW_ЛогистическиеСтатусыКлиент.УстановитьВидимостьВариантаУсловий(ЭтаФорма, ЗначениеПустойСсылки);

КонецПроцедуры


&НаСервере
Процедура УстановитьЗначениеПустойСсылкиОбъектаСтатуса()
	
	ЗначениеПустойСсылки = Объект.ИдентификаторОбъекта.ЗначениеПустойСсылки;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГруппыЦветов()
	
	МеханизмРаскраски = ПредопределенноеЗначение("Перечисление.CW_МеханизмыРаскраскиСписковМониторинга.НеРаскрашивать");
	
	СоответствиеИменКонстант = Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеИменКонстантМеханимаРасскраски();
	ИмяКонстанты = СоответствиеИменКонстант.Получить(ТипЗнч(Объект.ИдентификаторОбъекта.ЗначениеПустойСсылки));
	Если ИмяКонстанты <> Неопределено Тогда
		МеханизмРаскраски 		= Константы[ИмяКонстанты].Получить();
	КонецЕсли;   
	
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь, Истина);
	
	Элементы.ЦветСтрок.Видимость 						= МеханизмРаскраски = ПредопределенноеЗначение("Перечисление.CW_МеханизмыРаскраскиСписковМониторинга.ЦветаСтатусов");
	Элементы.ГруппаЦветСтрокНеИспользуется.Видимость 	= НЕ МеханизмРаскраски = ПредопределенноеЗначение("Перечисление.CW_МеханизмыРаскраскиСписковМониторинга.ЦветаСтатусов");

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЦветСтрок = Неопределено Тогда
		ТекущийОбъект.ХранилищеЦвета = Неопределено;
	Иначе
		ТекущийОбъект.ХранилищеЦвета = Новый ХранилищеЗначения(ЦветСтрок);
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресКартинки);
	Иначе
		ДвоичныеДанные = Неопределено;
	КонецЕсли;
	
	ТекущийОбъект.ХранилищеКартинки = Новый ХранилищеЗначения(ДвоичныеДанные);
	ТекущийОбъект.СсылкаКартинки 	= ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "ХранилищеКартинки");
	
	Если Не Объект.Предопределенный Тогда
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		Если Настройки.Отбор.Элементы.Количество() = 0 Тогда
			//Отбор не указан
			Настройки = Неопределено;
		КонецЕсли;
		
		ТекущийОбъект.ХранилищеОтбора 	= Новый ХранилищеЗначения(Настройки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Предопределенный Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяМаксимальноеЗначениеКонтрольнойДаты Тогда
		Если Не ЗначениеЗаполнено(Объект.КонтрольнаяДата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана контрольная дата!",,"КонтрольнаяДата","Объект", Отказ);
		КонецЕсли;
	Иначе
		Если КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо настроить условия установки статуса!",,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЦветСтрок 		=  ТекущийОбъект.ХранилищеЦвета.Получить();
	
	ДанныеКартинки 	=  ТекущийОбъект.ХранилищеКартинки.Получить();
	АдресКартинки 	=  ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
	
	Если Не Объект.Предопределенный Тогда
		Настройки 		=  ТекущийОбъект.ХранилищеОтбора.Получить();
		Если Настройки <> Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ИнициализацияКопоновщика()
	
	СоответствиеИменМакетов = Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеИмениМакетаТипуЗначения();
	
	ИмяМакета = СоответствиеИменМакетов.Получить(ТипЗнч(Объект.ИдентификаторОбъекта.ЗначениеПустойСсылки));
	
	//Если нет макета отбора. то отбор не используем
	Элементы.ГруппаУсловия.Видимость = ИмяМакета <> Неопределено;
	
	Если ИмяМакета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	тОбъект 	= РеквизитФормыВЗначение("Объект");
	СхемаОтбора = тОбъект.ПолучитьМакет(ИмяМакета);
	
	СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаОтбора,ЭтаФорма.УникальныйИдентификатор);

	НастройкиФильтр = КомпоновщикНастроек.Настройки;
	АдресНастроек = ПоместитьВоВременноеХранилище(НастройкиФильтр,ЭтаФорма.УникальныйИдентификатор);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(АдресНастроек));
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторОбъектаПриИзменении(Элемент)
	
	ИнициализацияКопоновщика();
	УстановитьВидимостьГруппыЦветов();
	УстановитьЗначениеПустойСсылкиОбъектаСтатуса();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхОбъектов()
	
	мИдентификаторы = Новый Массив;
	
	КартиникТипаЗначения = Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеКартикиТипуЗначения();
	
	мДоступныеТипы = Метаданные.ОпределяемыеТипы.CW_ОбъектыЛогистическихСтатусов.Тип.Типы();
	Для Каждого ТипВладельца из мДоступныеТипы Цикл
		
		КартинкаПоТипу 	= КартиникТипаЗначения.Получить(ТипВладельца);
		КартинкаПоТипу 	= ?(КартинкаПоТипу = Неопределено, БиблиотекаКартинок.CW_ГруппаДокументов, КартинкаПоТипу);
		
		Идентификатор 	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипВладельца);
		
		Элементы.ИдентификаторОбъекта.СписокВыбора.Добавить(Идентификатор,,,КартинкаПоТипу);
		
		мИдентификаторы.Добавить(Идентификатор);
	КонецЦикла;
	
	Элементы.ИдентификаторОбъекта.Доступность =  мДоступныеТипы.Количество() > 1;

КонецПроцедуры

//Выбор картинки
&НаКлиенте
Процедура ВыбратьПиктограмму(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо записать элемент справочника");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикОкончанияВыбораПиктограммы",ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораКартинки",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОкончанияВыбораПиктограммы(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено ИЛи РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикОкончанияВыбораПиктограммыНаСервере(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ОбработчикОкончанияВыбораПиктограммыНаСервере(РезультатВыбора)
	
	ДанныеКартинки = ПолучитьИзВременногоХранилища(РезультатВыбора);
	АдресКартинки = ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПиктограмму(Команда)
	
	АдресКартинки = "";
	
КонецПроцедуры
//Выбор картинки

&НаКлиенте
Процедура ЦветСтрокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборЦвета", ЭтотОбъект);
	
	Диалог = Новый ДиалогВыбораЦвета; 
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборЦвета(ВыбранныйЦвет, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЦвет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЦветСтрок = ВыбранныйЦвет;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветСтрокОчистка(Элемент, СтандартнаяОбработка)
	
	ЦветСтрок = Неопределено;
		
КонецПроцедуры


//Настройка отборов
&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПослеУдаления(Элемент)
	CW_ЛогистическиеСтатусыКлиент.УстановитьВидимостьВариантаУсловий(ЭтаФорма, ЗначениеПустойСсылки);
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	CW_ЛогистическиеСтатусыКлиент.ОтборыПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	
	CW_ЛогистическиеСтатусыКлиент.ОтборыПриИзменении(ЭтаФорма, Элемент, ЗначениеПустойСсылки);

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломИзменения(Элемент, Отказ)
	
	CW_ЛогистическиеСтатусыКлиент.ОтборыПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);	

КонецПроцедуры

&НаСервере
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив; 
	СписокПолей.Добавить("Ссылка.Код");
	СписокПолей.Добавить("Ссылка.Предопределенный");
	СписокПолей.Добавить("Ссылка.ВерсияДанных");
	СписокПолей.Добавить("Ссылка.ИмяПредопределенныхДанных");
	СписокПолей.Добавить("Ссылка.СлужебныйВыполненПереход");
	
	МетаданныеОбъекта 			= ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Объект.ИдентификаторОбъекта);
	МассивИменТабличныхЧастей 	= ПолучитьМассивИменТабличныхЧастей(МетаданныеОбъекта);
	
	Для Каждого ИмяТабличнойЧасти из МассивИменТабличныхЧастей Цикл
		ИмяПоля = "Ссылка."+ИмяТабличнойЧасти;
		СписокПолей.Добавить(ИмяПоля);
	КонецЦикла;
	
	Если ТипЗнч(ЗначениеПустойСсылки) = Тип("СправочникСсылка.CW_Заказы") Тогда
		СписокПолей.Добавить("Грузоперевозка.Код");
		СписокПолей.Добавить("Грузоперевозка.Предопределенный");
		СписокПолей.Добавить("Грузоперевозка.ВерсияДанных");
		СписокПолей.Добавить("Грузоперевозка.ИмяПредопределенныхДанных");
		СписокПолей.Добавить("Грузоперевозка.СлужебныйВыполненПереход");
		
		МетаданныеОбъекта = Метаданные.Справочники.CW_Грузоперевозки;
		МассивИменТабличныхЧастей 	= ПолучитьМассивИменТабличныхЧастей(МетаданныеОбъекта);
		Для Каждого ИмяТабличнойЧасти из МассивИменТабличныхЧастей Цикл
			ИмяПоля = "Грузоперевозка."+ИмяТабличнойЧасти;
			СписокПолей.Добавить(ИмяПоля);
		КонецЦикла;
	КонецЕсли;

	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаСервере
Функция ПолучитьМассивИменТабличныхЧастей(МетаданныеОбъекта)
	
	МассивИмен = Новый Массив;
	
	Для Каждого ТабличаняЧасть из МетаданныеОбъекта.ТабличныеЧасти Цикл
		МассивИмен.Добавить(ТабличаняЧасть.Имя);
	КонецЦикла;
	
	Возврат МассивИмен;
	
КонецФункции


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписьЛогистическогоСтатуса");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьКонстаны_МеханизмРаскраски" Тогда
		УстановитьВидимостьГруппыЦветов();
	КонецЕсли;
	
КонецПроцедуры
//Настройка отборов
