
Функция ПолучитьСоответствияИменРеквизитов() Экспорт
	
	РеквизитыКоносамента = Перечисления.CW_РеквизитыКоносамента;
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(РеквизитыКоносамента.НомерКоносамента, "Наименование");
	Соответствие.Вставить(РеквизитыКоносамента.ДатаКоносамента, "Дата");
	Соответствие.Вставить(РеквизитыКоносамента.Букинг, "Букинг");
	Соответствие.Вставить(РеквизитыКоносамента.ВидКоносамента, "ВидКоносамента");
	Соответствие.Вставить(РеквизитыКоносамента.ТипКоносамента, "ТипКоносамента");
	Соответствие.Вставить(РеквизитыКоносамента.Организация, "Организация");
	Соответствие.Вставить(РеквизитыКоносамента.Линия, "Линия");
	Соответствие.Вставить(РеквизитыКоносамента.Судно, "Судно");
	Соответствие.Вставить(РеквизитыКоносамента.Рейс, "Рейс");
	Соответствие.Вставить(РеквизитыКоносамента.ДоговорСКлиентом, "Договор");
	Соответствие.Вставить(РеквизитыКоносамента.ПортОтправки, "ПортОтправки");
	Соответствие.Вставить(РеквизитыКоносамента.ТерминалОтправки, "ТерминалОтправки");
	Соответствие.Вставить(РеквизитыКоносамента.ПортВыгрузки, "ПортВыгрузки");
	Соответствие.Вставить(РеквизитыКоносамента.ТерминалВыгрузки, "ТерминалВыгрузки");
	Соответствие.Вставить(РеквизитыКоносамента.ПортПерегрузки, "ПортПерегрузки");
	Соответствие.Вставить(РеквизитыКоносамента.ТерминалПерегрузки, "ТерминалПерегрузки");
	Соответствие.Вставить(РеквизитыКоносамента.Отправитель, "Отправитель");
	Соответствие.Вставить(РеквизитыКоносамента.Получатель, "Получатель");
	Соответствие.Вставить(РеквизитыКоносамента.Извещать, "Извещать");
	Соответствие.Вставить(РеквизитыКоносамента.Доставка, "Доставка"); 
	Соответствие.Вставить(РеквизитыКоносамента.ДатаПогрузкиНаСудно, "ДатаПогрузкиНаСудно"); 
	
	
	//Реквизиты табичной части
	Соответствие.Вставить(РеквизитыКоносамента.Упаковка, 			"СтрокаТаблицы.Упаковка");
	Соответствие.Вставить(РеквизитыКоносамента.КоличествоУпаковок,  "СтрокаТаблицы.КоличествоУпаковок");
	Соответствие.Вставить(РеквизитыКоносамента.Пломба, 				"СтрокаТаблицы.Пломба");
	Соответствие.Вставить(РеквизитыКоносамента.ОписаниеГруза, 		"СтрокаТаблицы.ОписаниеГруза");
	Соответствие.Вставить(РеквизитыКоносамента.ВесТары, 			"СтрокаТаблицы.ВесТары");
	Соответствие.Вставить(РеквизитыКоносамента.ВесНетто, 			"СтрокаТаблицы.ВесНетто");
	Соответствие.Вставить(РеквизитыКоносамента.Объем, 				"СтрокаТаблицы.Объем");
	
	Возврат Соответствие;
	
КонецФункции

