#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьПоследнийНомерЗаказа(Префикс) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НумерацияЗаказов.ПрефиксЗаказа КАК ПрефиксЗаказа,
	               |	CW_НумерацияЗаказов.Номер КАК Номер
	               |ИЗ
	               |	РегистрСведений.CW_НумерацияЗаказов КАК CW_НумерацияЗаказов
	               |ГДЕ
	               |	CW_НумерацияЗаказов.ПрефиксЗаказа = &Префикс";
	
	Запрос.УстановитьПараметр("Префикс", СокрЛП(Префикс));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		 Возврат Выборка.Номер;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Процедура ЗаписатьПоследнийНомерЗаказа(Префикс,НомерЗаказа) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запись = РегистрыСведений.CW_НумерацияЗаказов.СоздатьМенеджерЗаписи();
	Запись.ПрефиксЗаказа 	= СокрЛП(Префикс);
	Запись.Номер			=  НомерЗаказа;
	
	Запись.Записать(Истина);
	
КонецПроцедуры
#КонецЕсли