#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	Если (НЕ ЭтоГруппа) Тогда
		
		СтрНаименование = Строка(ФизическоеЛицо);
		//Если (ЗначениеЗаполнено(Должность)) Тогда
		//	_сф.стр_Добавить(СтрНаименование," ("+Строка(Должность)+")");
		//КонецЕсли; 
		Наименование = СтрНаименование;
		
	// --- 
	
	Если (НЕ Ссылка.Пустая()) Тогда
		
		Если (ПометкаУдаления) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CW_КонтактнаяИнформация.Ссылка
			|ИЗ
			|	Справочник.CW_КонтактнаяИнформация КАК CW_КонтактнаяИнформация
			|ГДЕ
			|	CW_КонтактнаяИнформация.ПометкаУдаления = ЛОЖЬ
			|	И CW_КонтактнаяИнформация.Владелец = &Владелец";
			Запрос.УстановитьПараметр("Владелец", Ссылка);
			ТЗ = Запрос.Выполнить().Выгрузить();
			Для каждого Стр Из ТЗ Цикл
				
				КИО = Стр.Ссылка.ПолучитьОбъект();
				КИО.УстановитьПометкуУдаления(Истина);
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецЕсли