#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ПростойИнтерфейсКлиент.ПараметрыОткрытияЗависимыхФорм(ПараметрыВыполненияКоманды.Источник);
	ПараметрыОткрытия.Вставить("РабочийРежим", Истина);
	ПараметрыОткрытия.Вставить("ИмяФормы", "Форма");
	Если Не ЗначениеЗаполнено(ПараметрыОткрытия.Организация) Тогда
		ПараметрыОткрытия.Организация = ОсновнаяОрганизация();
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ЕдиныйНалоговыйСчетЛичныйКабинет.Форма.ФормаДлительнаяОперация",
		ПараметрыОткрытия,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОсновнаяОрганизация()
	
	Возврат ЕдиныйНалоговыйСчетЛичныйКабинет.ОсновнаяОрганизация();
	
КонецФункции

#КонецОбласти
