
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИмяФормата",   	ИмяФормата);   
	Параметры.Свойство("ВключитьXLSX", 	ВключитьXLSX); 
	Параметры.Свойство("ИмяФайла", 		ИмяФайла); 
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеФайловогоАрхива") Тогда
		Элементы.ВариантСохранения.СписокВыбора.Добавить("Присоединить", "Прикрепить к документу");
	КонецЕсли;

	Элементы.ВариантСохранения.СписокВыбора.Добавить("СохранитьВПапку", "Сохранить в папку на компьютер");
	
	ВариантСохранения = Элементы.ВариантСохранения.СписокВыбора.Получить(0).Значение;	
	
	ЗаполнитьСписокДоступныхФорматов();
	УстановитьДоступностьПапкиДляСохранения();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхФорматов()  
	
	СписокФорматов.Добавить("PDF",	"Документ PDF (.pdf)", Ложь, БиблиотекаКартинок.ФорматPDF);
	
	Если ИмяФормата = "HTML" Тогда
		СписокФорматов.Добавить("RTF",	"Текст в формате RTF (.rtf)", Ложь, БиблиотекаКартинок.ФорматWord);
	КонецЕсли;
	
	Если ИмяФормата = "MXL" Тогда
		СписокФорматов.Добавить("DOCX",	"Документ Word 2007 (.docx)", 	Ложь, БиблиотекаКартинок.ФорматWord2007);  
		
		Если ВключитьXLSX Тогда
			СписокФорматов.Добавить("XLSX",	"Документ Excel 2007 (.xlsx)", 	Ложь, БиблиотекаКартинок.ФорматExcel2007); 
		КонецЕсли; 
		
		СписокФорматов.Добавить("MXL",	"Табличный документ (.mxl)"	, 	Ложь, БиблиотекаКартинок.ФорматMXL);
	КонецЕсли; 
	
	СписокФорматов.Добавить("HTML",	"Веб-страница (.html)|*.htm", Ложь, БиблиотекаКартинок.ФорматHTML);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяПапкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если Не ПустаяСтрока(КаталогДляСохранения) Тогда
		ДиалогВыбораПапки.Каталог = КаталогДляСохранения;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КаталогДляСохраненияНачалоВыбораЗавершение", ЭтотОбъект);
	ДиалогВыбораПапки.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура КаталогДляСохраненияНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено
		И ВыбранныеФайлы.Количество()>0 Тогда
		КаталогДляСохранения = ВыбранныеФайлы.Получить(0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСохраненияПриИзменении(Элемент)
	
	УстановитьДоступностьПапкиДляСохранения();
	
КонецПроцедуры              

&НаСервере
Процедура УстановитьДоступностьПапкиДляСохранения()
	
	Элементы.КаталогДляСохранения.Видимость	= (ВариантСохранения = "СохранитьВПапку"); 
	
	Если ПолучитьФункциональнуюОпцию("CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив") Тогда
		Элементы.ТипДокумента.Видимость =  (ВариантСохранения = "Присоединить");           
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ЗапрашиватьТипФайлаПриДобавленииВАрхив()
	
	Возврат ПолучитьФункциональнуюОпцию("CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив");	

КонецФункции



&НаКлиенте
Процедура Сохранить(Команда)
	
	ЗапрашиватьТипВложенногоФайла = ЗапрашиватьТипФайлаПриДобавленииВАрхив(); 
	
	#Если Не ВебКлиент Тогда
		Если ВариантСохранения = "СохранитьВПапку" И ПустаяСтрока(КаталогДляСохранения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо указать папку!'"),,"ВыбраннаяПапка");
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	#Если Не ВебКлиент Тогда
		Если ВариантСохранения = "Присоединить" 
			И ТипДокумента.Пустая() и ЗапрашиватьТипВложенногоФайла Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать тип документа архива!'"),,"ТипДокумента");
			Возврат;
		КонецЕсли;  
	#Иначе
		Если ВариантСохранения = "Присоединить" 
			И ТипДокумента.Пустая() и ЗапрашиватьТипВложенногоФайла Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Необходимо выбрать тип документа архива!'"));
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	ФорматыСохранения = Новый Массив;
	
	Для Каждого ВыбранныйФормат Из СписокФорматов Цикл
		Если ВыбранныйФормат.Пометка Тогда
			ФорматыСохранения.Добавить(ВыбранныйФормат.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ФорматыСохранения.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Необходимо указать как минимум один из предложенных форматов.'"));
		Возврат;
	КонецЕсли;

	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("ВариантСохранения", 		ВариантСохранения);
	РезультатВыбора.Вставить("КаталогДляСохранения",	КаталогДляСохранения);
	РезультатВыбора.Вставить("ФорматыСохранения",		ФорматыСохранения);
	РезультатВыбора.Вставить("ТипДокумента",			ТипДокумента);
	РезультатВыбора.Вставить("ИмяФайла",				ИмяФайла);
	
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры


&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки) 
	
	Настройки.Удалить("СписокФорматов");
	
	ВыбранныеФорматы = Новый Массив;
	Для каждого ЭлементСписка из СписокФорматов Цикл
		Если ЭлементСписка.Пометка Тогда
			ВыбранныеФорматы.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Настройки.Вставить("ВыбранныеФорматы", 	ВыбранныеФорматы);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ВыбранныеФорматы = Настройки.Получить("ВыбранныеФорматы");
	
	ВыбраныФорматы = Ложь;
	Если ВыбранныеФорматы <> Неопределено Тогда
		Для Каждого ВыбранныйФормат из ВыбранныеФорматы Цикл
			ЭлементСписка = СписокФорматов.НайтиПоЗначению(ВыбранныйФормат);
			Если ЭлементСписка <> Неопределено Тогда
				ЭлементСписка.Пометка = Истина;
				ВыбраныФорматы = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;  
	
	Если Не ВыбраныФорматы Тогда
		ЭлементСписка = СписокФорматов.НайтиПоЗначению("PDF");	
		Если ЭлементСписка <> Неопределено Тогда
			ЭлементСписка.Пометка = Истина;
		КонецЕсли;
	КонецЕсли;

	УстановитьДоступностьПапкиДляСохранения();
	
КонецПроцедуры
	
