#Если ТолстыйКлиент Тогда

Процедура Переформировать(ЭтаФорма=Неопределено) Экспорт
	Если ЭтаФорма=Неопределено Тогда
		ЭтаФорма = ЭтотОбъект.ПолучитьФорму();
	КонецЕсли;
	
	Элементы = ЭтаФорма.ЭлементыФормы;
	ОсновнаяПанель = Элементы.Панель;
	ИмяОткрытогоРегистра = ОсновнаяПанель.ТекущаяСтраница.Имя;
	ОсновнаяПанель.Видимость = Ложь;
	//Сначала поудаляем все страницы
	ОсновнаяПанель.Страницы.Очистить();
	Рамка = Новый Рамка(ТипРамкиЭлементаУправления.ЧертаСверху);

	Если (Не ДокументСсылка = Неопределено) И (Не ДокументСсылка.Пустая()) Тогда	
		//Начинаем добавлять страницы и сразу их заполнять
		Для Каждого Движение Из ДокументСсылка.Метаданные().Движения Цикл
			СинонимРегистра = Движение.Синоним; ИмяРегистра = Движение.Имя;
			Если (Метаданные.РегистрыНакопления.Индекс(Движение)>=0) Тогда
				ВидРегистра = "Накопления"
			ИначеЕсли (Метаданные.РегистрыСведений.Индекс(Движение)>=0) Тогда
				ВидРегистра = "Сведений"
			ИначеЕсли  Метаданные.РегистрыРасчета.Индекс(Движение)>=0 Тогда
				ВидРегистра = "Расчета"
			ИначеЕсли  Метаданные.РегистрыБухгалтерии.Индекс(Движение)>=0 Тогда
				ВидРегистра = "Бухгалтерии"
			КонецЕсли;			
			
			ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.Страницы.Добавить(ИмяРегистра,СинонимРегистра);	
			Таблица=Элементы.Добавить(Тип("ТабличноеПоле"),"ТабДок_"+ИмяРегистра,Истина,ОсновнаяПанель);
			Действие= Новый Действие("ТаблицаВыбор");
			Таблица.УстановитьДействие("Выбор",Действие);
			Таблица.Лево=0;
			Таблица.Верх=26;
			Таблица.Ширина=ОсновнаяПанель.Ширина-4;
			Таблица.Высота=ОсновнаяПанель.Высота-27;				
			Таблица.ТолькоПросмотр=Истина;								
			Таблица.ЧередованиеЦветовСтрок	=	Истина;
			Таблица.Рамка=Рамка;
			Таблица.ГоризонтальныеЛинии	= Истина;   
			Таблица.ВертикальныеЛинии = Ложь;			
			Таблица.РежимВыделенияСтроки = РежимВыделенияСтрокиТабличногоПоля.Строка;
			
			Панель =  Элементы.Добавить(Тип("КоманднаяПанель"),"КоманднаяПанель"+Таблица.Имя, Истина,ОсновнаяПанель);
			Панель.Лево=0;
			Панель.Верх=0;
			Панель.Ширина=ОсновнаяПанель.Ширина-4;
			Панель.Высота=25;	
			Панель.ИсточникДействий = Таблица;
			Панель.Автозаполнение = Истина;
			
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель, ГраницаЭлементаУправления.Лево);			
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Право,ОсновнаяПанель, ГраницаЭлементаУправления.Право);
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Верх,Панель, ГраницаЭлементаУправления.Верх);
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Низ,ОсновнаяПанель, ГраницаЭлементаУправления.Верх);			
			
			//Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Право,ОсновнаяПанель, ГраницаЭлементаУправления.Право);
			//Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Низ,ОсновнаяПанель, ГраницаЭлементаУправления.Низ);			
			Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель, ГраницаЭлементаУправления.Лево);			
			Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Право,ОсновнаяПанель, ГраницаЭлементаУправления.Право);
			Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Низ,ОсновнаяПанель, ГраницаЭлементаУправления.Низ);			
			Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Верх,Панель, ГраницаЭлементаУправления.Низ);
			
			//Теперь заполним таблицы данными
			Тип= Новый Массив();
			ТипСписка="Регистр"+ВидРегистра+"НаборЗаписей."+ИмяРегистра;
			Тип.Добавить(Тип(ТипСписка));
			ОписаниеТипов= Новый ОписаниеТипов(Тип);
			Таблица.ТипЗначения=ОписаниеТипов;
			Таблица.СоздатьКолонки();
			Если ВидРегистра = "Накопления" Тогда
				Таблица.Подвал = Истина;
				Для Каждого Ресурс Из Движение.Ресурсы Цикл
					ИмяРесурса = Ресурс.Имя;
					Таблица.Колонки[ИмяРесурса].ОтображатьИтогиВПодвале = Истина;
					Таблица.Колонки[ИмяРесурса].ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложение.Право;
				КонецЦикла;	
			КонецЕсли;	
			Таблица.Колонки["Регистратор"].Видимость=Ложь;
			Таблица.Значение.Отбор.Регистратор.Установить(ДокументСсылка,Истина);
			Таблица.Значение.Прочитать();
			ОсновнаяПанель.ТекущаяСтраница.Заголовок = ОсновнаяПанель.ТекущаяСтраница.Заголовок+" "+Таблица.Значение.Количество();
			//Удалим страницы с пустыми таблицами
			Если Таблица.Значение.Количество()=0 Тогда
				ОсновнаяПанель.Страницы.Удалить(ОсновнаяПанель.Страницы.Индекс(ОсновнаяПанель.ТекущаяСтраница));
			КонецЕсли;
		КонецЦикла;	
		Если ОсновнаяПанель.Страницы.Количество()>1 Then
			ОсновнаяПанель.Видимость = Истина;
		КонецЕсли;			
	КонецЕсли;	
    ТекСтраница = ОсновнаяПанель.Страницы.Найти(ИмяОткрытогоРегистра);
	ОсновнаяПанель.Страницы.Удалить(0);
	Если ТекСтраница = Неопределено Тогда
		ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.Страницы[0];	
	Иначе 
		ОсновнаяПанель.ТекущаяСтраница=ТекСтраница;		
	КонецЕсли;
	Если (ЭтаФорма<>Неопределено) и Не ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Открыть();
	КонецЕсли;		
КонецПроцедуры


Процедура СформироватьОтчет(ЭтаФорма=Неопределено) Экспорт 
	Если ЭтаФорма=Неопределено Тогда
		ЭтаФорма = ЭтотОбъект.ПолучитьФорму();
	КонецЕсли;
	Элементы = ЭтаФорма.Элементы;
	ОсновнаяПанель = Элементы.Панель;
	ИмяОткрытогоРегистра = ОсновнаяПанель.ТекущаяСтраница.Имя;
	ОсновнаяПанель.Видимость = Ложь;
	//Сначала поудаляем все страницы
	ОсновнаяПанель.Страницы.Очистить();
	Рамка = Новый Рамка(ТипРамкиЭлементаУправления.ЧертаСверху);

	Если (Не ДокументСсылка = Неопределено) И (Не ДокументСсылка.Пустая()) Тогда	
		//Начинаем добавлять страницы и сразу их заполнять
		Для Каждого Движение Из ДокументСсылка.Метаданные().Движения Цикл
			СинонимРегистра = Движение.Синоним; ИмяРегистра = Движение.Имя;
			Если (Метаданные.РегистрыНакопления.Индекс(Движение)>=0) Тогда
				ВидРегистра = "Накопления"
			ИначеЕсли (Метаданные.РегистрыСведений.Индекс(Движение)>=0) Тогда
				ВидРегистра = "Сведений"
			ИначеЕсли  Метаданные.РегистрыРасчета.Индекс(Движение)>=0 Тогда
				ВидРегистра = "Расчета"
			ИначеЕсли  Метаданные.РегистрыБухгалтерии.Индекс(Движение)>=0 Тогда
				ВидРегистра = "Бухгалтерии"
			КонецЕсли;			
			
			ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.Страницы.Добавить(ИмяРегистра,СинонимРегистра);	
			Таблица=Элементы.Добавить(Тип("ТабличноеПоле"),"ТабДок_"+ИмяРегистра,Истина,ОсновнаяПанель);
			Действие= Новый Действие("ТаблицаВыбор");
			Таблица.УстановитьДействие("Выбор",Действие);
			Таблица.Лево=0;
			Таблица.Верх=26;
			Таблица.Ширина=ОсновнаяПанель.Ширина-4;
			Таблица.Высота=ОсновнаяПанель.Высота-27;				
			Таблица.ТолькоПросмотр=Истина;								
			Таблица.ЧередованиеЦветовСтрок	=	Истина;
			Таблица.Рамка=Рамка;
			Таблица.ГоризонтальныеЛинии	= Истина;   
			Таблица.ВертикальныеЛинии = Ложь;			
			Таблица.РежимВыделенияСтроки = РежимВыделенияСтрокиТабличногоПоля.Строка;
			
			Панель =  Элементы.Добавить(Тип("КоманднаяПанель"),"КоманднаяПанель"+Таблица.Имя, Истина,ОсновнаяПанель);
			Панель.Лево=0;
			Панель.Верх=0;
			Панель.Ширина=ОсновнаяПанель.Ширина-4;
			Панель.Высота=25;	
			Панель.ИсточникДействий = Таблица;
			Панель.Автозаполнение = Истина;
			
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель, ГраницаЭлементаУправления.Лево);			
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Право,ОсновнаяПанель, ГраницаЭлементаУправления.Право);
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Верх,Панель, ГраницаЭлементаУправления.Верх);
			Панель.УстановитьПривязку(ГраницаЭлементаУправления.Низ,ОсновнаяПанель, ГраницаЭлементаУправления.Верх);			
			
			//Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Право,ОсновнаяПанель, ГраницаЭлементаУправления.Право);
			//Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Низ,ОсновнаяПанель, ГраницаЭлементаУправления.Низ);			
			Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Лево,ОсновнаяПанель, ГраницаЭлементаУправления.Лево);			
			Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Право,ОсновнаяПанель, ГраницаЭлементаУправления.Право);
			Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Низ,ОсновнаяПанель, ГраницаЭлементаУправления.Низ);			
			Таблица.УстановитьПривязку(ГраницаЭлементаУправления.Верх,Панель, ГраницаЭлементаУправления.Низ);
			
			//Теперь заполним таблицы данными
			Тип= Новый Массив();
			ТипСписка="Регистр"+ВидРегистра+"НаборЗаписей."+ИмяРегистра;
			Тип.Добавить(Тип(ТипСписка));
			ОписаниеТипов= Новый ОписаниеТипов(Тип);
			Таблица.ТипЗначения=ОписаниеТипов;
			Таблица.СоздатьКолонки();
			Если ВидРегистра = "Накопления" Тогда
				Таблица.Подвал = Истина;
				Для Каждого Ресурс Из Движение.Ресурсы Цикл
					ИмяРесурса = Ресурс.Имя;
					Таблица.Колонки[ИмяРесурса].ОтображатьИтогиВПодвале = Истина;
					Таблица.Колонки[ИмяРесурса].ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложение.Право;
				КонецЦикла;	
			КонецЕсли;	
			Таблица.Колонки["Регистратор"].Видимость=Ложь;
			Таблица.Значение.Отбор.Регистратор.Установить(ДокументСсылка,Истина);
			Таблица.Значение.Прочитать();
			ОсновнаяПанель.ТекущаяСтраница.Заголовок = ОсновнаяПанель.ТекущаяСтраница.Заголовок+" "+Таблица.Значение.Количество();
			//Удалим страницы с пустыми таблицами
			Если Таблица.Значение.Количество()=0 Тогда
				ОсновнаяПанель.Страницы.Удалить(ОсновнаяПанель.Страницы.Индекс(ОсновнаяПанель.ТекущаяСтраница));
			КонецЕсли;
		КонецЦикла;	
		Если ОсновнаяПанель.Страницы.Количество()>1 Then
			ОсновнаяПанель.Видимость = Истина;
		КонецЕсли;			
	КонецЕсли;	
    ТекСтраница = ОсновнаяПанель.Страницы.Найти(ИмяОткрытогоРегистра);
	ОсновнаяПанель.Страницы.Удалить(0);
	Если ТекСтраница = Неопределено Тогда
		ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.Страницы[0];	
	Иначе 
		ОсновнаяПанель.ТекущаяСтраница=ТекСтраница;		
	КонецЕсли;
	Если (ЭтаФорма<>Неопределено) и Не ЭтаФорма.Открыта() Тогда
		ЭтаФорма.Открыть();
	КонецЕсли;		
КонецПроцедуры	
#КонецЕсли
