//см.CW_ОбновлениеКонфигурацииСервер.ПриДобавленииОбработчиков()
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт  
	
	//НачальноеЗаполнение
	//НоваяСтрока = Обработчики.Добавить();
	//НоваяСтрока.ИмяОбработчика  	= "CW_ОбменГИСЭПДСлужебный.<>";  
	//НоваяСтрока.Версия 				= "*";
	//НоваяСтрока.ИмяПодсистемы 		= "CW_ОбменГИСЭПД";
	//НоваяСтрока.НачальноеЗаполнение	= Истина;
	//НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	//НоваяСтрока.РежимВыполнения		= "Оперативно";
	//НоваяСтрока.ОчередьВыполнения	= 1;
	//НоваяСтрока.Наименование		= "<>";
	//НоваяСтрока.Комментарий			= "<>";   
	
КонецПроцедуры 

