
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСписка = Параметры.АдресСписка;
	
	Если ЭтоАдресВременногоХранилища(АдресСписка) Тогда
		мСписокКоманд = ПолучитьИзВременногоХранилища(АдресСписка);
		
		Для Каждого ЭлементСписка из мСписокКоманд Цикл
			СписокКоманд.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКомандВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	АдресСписка = ПолучитьАдресСтроки(ВыбраннаяСтрока);
	
	ЭтаФорма.Закрыть(АдресСписка);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСтроки(ВыбраннаяСтрока)
	
	СтруктураОтвета = Новый Структура("Значение,Представление",Неопределено,Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураОтвета, СписокКоманд[ВыбраннаяСтрока]);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураОтвета);
	
КонецФункции