#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрежнийВидРаздела = Истина;
	Обработки.ПанелиПростойИнтерфейс.СохранитьНастройкуИспользоватьПилотныйРазделБухгалтерия(Ложь);
	
	УправлениеФормой(ЭтотОбъект);
	
	Элементы.ГруппаПилот.Видимость = Не ОбщегоНазначения.ЭтоМобильныйКлиент();
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеУчетнойПолитики" Тогда
		Если МобильныйКлиентБПКлиент.ЭтоМобильныйКлиент() Тогда
			АктуализироватьМКШапкаФормы();
		Иначе
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ЗаписатьСтатистикуПереходовПоСсылке(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрежнийВидРазделаПриИзменении(Элемент)
	
	Если Не ПрежнийВидРаздела Тогда
		Закрыть();
		ОткрытьФорму("Обработка.ПанелиПростойИнтерфейс.Форма.ПанельБухгалтерияПилот", , , , Окно);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НаписатьРазработчикам(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	РаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	ПараметрыДляЗаполненияФормы = ПараметрыДляЗаполненияФормы();
	ФункциональныеОпции = ПараметрыДляЗаполненияФормы.ФункциональныеОпции;
	ПраваОбъектов = ПараметрыДляЗаполненияФормы.ПраваОбъектов;
	
	Элементы.АнализУчетаПоУСН.Видимость             = ФункциональныеОпции.ИспользуетсяУСН;
	Элементы.РасходыУСН.Видимость                   = ФункциональныеОпции.ИспользуетсяУСН;
	
	Элементы.РегистрыНалоговогоУчета.Видимость      = ФункциональныеОпции.ИспользуетсяОСНО;
	Элементы.АнализУчетаПоНалогуНаПрибыль.Видимость = ФункциональныеОпции.ИспользуетсяОСНО;
	
	Элементы.РегламентныеОперацииНДС.Видимость       = ФункциональныеОпции.ИспользуетсяНДС;
	Элементы.ОтражениеДОППВДекларации.Видимость      = ФункциональныеОпции.ВедетсяУчетИмпортаТоваров;
	Элементы.АнализУчетаПоНДС.Видимость              = ФункциональныеОпции.ИспользуетсяНДС;
	Элементы.НаличиеСчетовФактур.Видимость           = ФункциональныеОпции.ИспользуетсяНДС;
	
	Элементы.ГруппаПрослеживаемость.Видимость = ФункциональныеОпции.ВестиУчетПрослеживаемыхТоваров;
	
	Элементы.ИнвентаризацияОС.Видимость             = ФункциональныеОпции.ВедетсяУчетОС;
	
	Элементы.АвизоПрочиеИсходящие.Видимость =
		ФункциональныеОпции.ВестиУчетПоПодразделениям И ПраваОбъектов.ЕстьПравоПросмотрАвизоПрочееИсходящие;
	Элементы.АвизоПрочиеВходящие.Видимость =
		ФункциональныеОпции.ВестиУчетПоПодразделениям И ПраваОбъектов.ЕстьПравоПросмотрАвизоПрочееВходящие;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыДляЗаполненияФормы()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ФункциональныеОпции", ФункциональныеОпцииФормы());
	Результат.Вставить("ПраваОбъектов", ПраваОбъектовФормы());
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ФункциональныеОпцииФормы()
	
	ФункциональныеОпции = Новый Структура;
	ФункциональныеОпции.Вставить("ИспользуетсяУСН",
		ПолучитьФункциональнуюОпцию("ИспользуетсяУСН"));
	ФункциональныеОпции.Вставить("ИспользуетсяНДС",
		ПолучитьФункциональнуюОпцию("ИспользуетсяОСНО") ИЛИ ПолучитьФункциональнуюОпцию("ИспользуетсяНДФЛИП")
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользуетсяУСНСНДС"));
	ФункциональныеОпции.Вставить("ИспользуетсяОСНО",
		ПолучитьФункциональнуюОпцию("ИспользуетсяОСНО"));
	ФункциональныеОпции.Вставить("ВестиУчетПрослеживаемыхТоваров",
		ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров"));
	ФункциональныеОпции.Вставить("ВедетсяУчетОС",
		ПолучитьФункциональнуюОпцию("ВедетсяУчетОсновныхСредств"));
	ФункциональныеОпции.Вставить("ВестиУчетПоПодразделениям",
		ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям"));
	ФункциональныеОпции.Вставить("ВедетсяУчетИмпортаТоваров",
		ПолучитьФункциональнуюОпцию("ВедетсяУчетИмпортаТоваров"));
	
	Возврат ФункциональныеОпции;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПраваОбъектовФормы()
	
	ПраваОбъектов = Новый Структура;
	
	ЕстьПравоПросмотрАвизоПрочееИсходящие =
		ОбщегоНазначенияБП.ЕстьПравоДоступаКОбъекту("Документ.АвизоПрочееИсходящее", "Просмотр");
	ПраваОбъектов.Вставить("ЕстьПравоПросмотрАвизоПрочееИсходящие", ЕстьПравоПросмотрАвизоПрочееИсходящие);
	
	ЕстьПравоПросмотрАвизоПрочееВходящие =
		ОбщегоНазначенияБП.ЕстьПравоДоступаКОбъекту("Документ.АвизоПрочееВходящее", "Просмотр");
	ПраваОбъектов.Вставить("ЕстьПравоПросмотрАвизоПрочееВходящие", ЕстьПравоПросмотрАвизоПрочееВходящие);
	
	Возврат ПраваОбъектов;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикОткрытияФормы(ПараметрыФормы, ПараметрыВыполненияКоманды) Экспорт

	ВариантыОтчетовКлиент.ПоказатьПанельОтчетов(ПараметрыВыполненияКоманды.ПутьКПодсистеме, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПисьма = РаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
	ПараметрыПисьма.Получатель = "bp@1c.ru";
	ПараметрыПисьма.Тема = НСтр("ru = 'Отзыв о разделе Бухгалтерия'");
	
	ОтправкаПочтовыхСообщенийКлиент.ДополнитьПараметрыПисьмаДляОтправкиЛегкойПочтой(ПараметрыПисьма);
	
	РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыПисьма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСтатистикуПереходовПоСсылке(НавигационнаяСсылка)
	Если ЗначениеЗаполнено(НавигационнаяСсылка) Тогда
		ИмяКлючевойОперации = СтрШаблон("СтатистикаБП.ПанельБухгалтерия.ПереходПоСсылке.%1", НавигационнаяСсылка);
		СтатистикаПоПоказателямКлиентСервер.ДобавитьСобытие(ИмяКлючевойОперации);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаБухгалтерскийУчет,
		"ЖурналОпераций");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаОтчеты,
		"ОборотноСальдоваяВедомость,ОборотноСальдоваяВедомостьПоСчету,АнализСчета,АнализСубконто,КарточкаСчета,ОборотыСчета,ОтчетПоПроводкам");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаАнализУчета);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаЗакрытиеПериода,
		"ОбщаяКомандаЗакрытиеМесяца");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаДоходыИРасходы,
		"НоменклатурныеГруппы,СтатьиЗатрат,ПрочиеДоходыИРасходы,ДоходыБудущихПериодов,РасходыБудущихПериодов");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаИнвентаризация,
		"ИнвентаризацияТоваровНаСкладе");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаЛеваяКолонка);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаСредняяКолонка);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаПраваяКолонка);
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьМКШапкаФормы()
	
	УправлениеФормой(ЭтотОбъект);
	
	МобильныйКлиентБПФормаПанели.АктуализироватьСвойстваНедоступныхГрупп(ЭтотОбъект, "ГруппаПрослеживаемость");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПланСчетовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
	ПараметрыОткрытия.Заголовок = Элемент.Заголовок;
	ПараметрыОткрытия.ИмяФормы = "ПланСчетов.Хозрасчетный.ФормаСписка";

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия);
	
	ЗаписатьСтатистикуПереходовПоСсылке("e1cib/command/ОбщаяКоманда.ПланСчетов");
	
КонецПроцедуры

&НаКлиенте
Процедура КорреспонденцииСчетовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
	ПараметрыОткрытия.Заголовок = Элемент.Заголовок;
	ПараметрыОткрытия.ИмяФормы = "РегистрСведений.КорреспонденцииСчетов.ФормаСписка";

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия);
	
	ЗаписатьСтатистикуПереходовПоСсылке("e1cib/list/РегистрСведений.КорреспонденцииСчетов");
	
КонецПроцедуры

&НаКлиенте
Процедура СправкиРасчетыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ПараметрыВыполненияКоманды = Новый Структура("ПутьКПодсистеме", "Отчеты.СправкиРасчеты");
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
	ПараметрыОткрытия.Заголовок = Элемент.Заголовок;
	ПараметрыОткрытия.ОбработчикОткрытияФормы = Новый ОписаниеОповещения("ОбработчикОткрытияФормы",
		ЭтотОбъект, ПараметрыВыполненияКоманды);

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия);
	
	ЗаписатьСтатистикуПереходовПоСсылке("e1cib/command/ОбщаяКоманда.ПанельОтчетовСправкиРасчеты");
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрыУчетаМалыхПредприятийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыполненияКоманды = Новый Структура("ПутьКПодсистеме",
		"Отчеты.РегистрыБУСубъектовМалогоПредпринимательства");
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
	ПараметрыОткрытия.Заголовок = Элемент.Заголовок;
	ПараметрыОткрытия.ОбработчикОткрытияФормы = Новый ОписаниеОповещения("ОбработчикОткрытияФормы",
		ЭтотОбъект, ПараметрыВыполненияКоманды);

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия);
	
	ЗаписатьСтатистикуПереходовПоСсылке("e1cib/command/ОбщаяКоманда.ПанельОтчетовРегистрыБУСубъектовМалогоПредпринимательства");

КонецПроцедуры

&НаКлиенте
Процедура РегистрыНалоговогоУчетаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыполненияКоманды = Новый Структура("ПутьКПодсистеме",
		"Отчеты.НалогНаПрибыль");
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
	ПараметрыОткрытия.Заголовок = Элемент.Заголовок;
	ПараметрыОткрытия.ОбработчикОткрытияФормы = Новый ОписаниеОповещения("ОбработчикОткрытияФормы",
		ЭтотОбъект, ПараметрыВыполненияКоманды);

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия);
	
	ЗаписатьСтатистикуПереходовПоСсылке("e1cib/command/ОбщаяКоманда.ПанельОтчетовРегистрыНалоговогоУчета");
		
КонецПроцедуры
