
#Область Служебные

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Параметры передаваемые при открытии формы:
	// - ПодключаемыйОбъект - ссылка на подключаемый объект;
	// - Метод 				- имя выполняемого метода
	// - ИмяФормы 			- имя формы объекта;
	
	//Получение имени объекта, в случае елси из формы отчета нужно открывать дополнительные формы этого же объекта
	ПолучитьИмяОбъектаОтчета();

	
	_ВосстановитьСеансовуюНастройку();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИмяОбъектаОтчета()
	
	ИмяОбъекта = СокрЛП(РеквизитФормыВЗначение("Отчет"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//Проверка завершения работы, 
	//исключающая серверные вызовы при закрытии формы.
	Если Не ЗавершениеРаботы Тогда
		_СохранитьСеансовуюНастройку();
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область открытие_дополнительной_Формы

&НаКлиенте
Процедура ОткрытьДополнительнуюФорму(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияДополнительнойФормы",ЭтотОбъект); 

	ОткрытьФорму("ВнешнийОтчет."+ИмяОбъекта+".Форма.ДополнительнаяФормаОтчета",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДополнительнойФормы(Ответ, ДополнительныеПараметры) Экспорт
	
	ПоказатьПредупреждение(,"Дополнительная форма закрыта");
	
КонецПроцедуры

#КонецОбласти

#Область Сохранение_восстановление_сеансовой_настройки

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			Если СеансоваяНастройка.Свойство("Настройки") Тогда
				АдресНастроек = ПоместитьВоВременноеХранилище(СеансоваяНастройка.Настройки);
			КонецЕсли;
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Настройки"		, Новый Структура);
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

#КонецОбласти

#Область Формирование_отчета

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	СтруктураНастроек 	= Новый Структура("АдресНастроек", АдресНастроек);
	ОтчетОбъект 		= РеквизитФормыВЗначение("Отчет");
	
	Возврат  ОтчетОбъект.СформироватьОтчет(СтруктураНастроек);
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Ответ = СформироватьОтчетНаСервере();
	
	//Обрабатываем ответ
	Результат = Ответ.Результат;
	
	Если Ответ.ОписаниеОшибки <> "" Тогда
		ПоказатьПредупреждение(,Ответ.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Сохранение_Пользовательских_Настроек_Отчета

&НаСервере
//Функция ПолучитьСтруктуруНасторйкиОтчета()
//
// Функция возвращает структуру настроек, 
//	которые будут записаны в справочник "CW_НастройкиПользователей";
//
// ВНИМАНИЕ! Для каждого отчета стуктура индивидуальна!
//
Функция ПолучитьСтруктуруНасторйкиОтчета()
	
	СтруктураНастройки = Новый Структура;
	
	//Структура сохраняемых настроек текущего отчета
	СтруктураНастройки.Вставить("ПолеНастройки"	, ПолеНастройки);
	СтруктураНастройки.Вставить("ПолеТаблицы"	, ПолеТаблицы.Выгрузить());
	
	Возврат СтруктураНастройки;
	
КонецФункции

//Процедура  ЗагрузитьНастройкиОтчетаНаСервере(НастройкаСсылка)
//
//	Параметры функции 
//		НастрйокаСсылка - ссылка на элемент справочника "CW_НастройкиПользователей", из которго
//						  будет загружена настройка;
//
// ВНИМАНИЕ! Для каждого отчета процедура индивидуальна!
//
&НаСервере
Процедура ЗагрузитьНастройкиОтчетаНаСервере(НастройкаСсылка)
	
	СтруктураНастроек = Справочники.CW_НастройкиПользователей.ЗагрузитьНастройку(НастройкаСсылка);
	
	//Восстановление настроек текущего отчета
	Если СтруктураНастроек.Свойство("ПолеНастройки") Тогда
		ПолеНастройки = СтруктураНастроек.ПолеНастройки;
	КонецЕсли;
	Если СтруктураНастроек.Свойство("ПолеТаблицы") Тогда
		ПолеТаблицы.Загрузить(СтруктураНастроек.ПолеТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//Процедура ЗаписатьНастройкуОтчета(Ответ, ДополнительныеПараметры) Экспорт
//	Параметры процедуры:
//  - СтруктураОтвета -  Структура со полями: НастройкаСсылка и НеВосстанавливатьОтбор;
//		 *НастройкаСсылка 			- ссылка на элемент справочника "CW_НастройкиПользователей",
//								   		из которого будет восстановлена текущая отчета; 
//		 *НеВосстанавливатьОтбор  	- в текущем контексте не используется, значение всегда "ложь";	
//
//	- ДополнительныеПараметры 	-  Дополнительные параметры, с которыми была открыта 
//								   форма управления настройками 
//							       (см. модуль общей команды "CW_СохранитьНастройку")
//                                            
Процедура ОткрытьНастройкуОтчета(СтруктураОтвета, ДополнительныеПараметры) Экспорт
	
	Если СтруктураОтвета <> Неопределено Тогда
		ЗагрузитьнастройкиОтчетаНаСервере(СтруктураОтвета.НастройкаСсылка);
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
//Процедура ЗаписатьНастройкуОтчета(Ответ, ДополнительныеПараметры) Экспорт
//	Параметры процедуры:
//  - ЭлементНастройки 			-  ссылка на элемент справочника "CW_НастройкиПользователей",
//								   в который будет записана текущая настройка отчета;
//	- ДополнительныеПараметры 	-  Дополнительные параметры, с которыми была открыта 
//								   форма управления настройками 
//							       (см. модуль общей команды "CW_СохранитьНастройку")
//
Процедура ЗаписатьНастройкуОтчета(ЭлементНастройки, ДополнительныеПараметры) Экспорт
	
	Если ЭлементНастройки <> Неопределено Тогда
		ЗаписатьНастройкиНаСервере(ЭлементНастройки);
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере(ЭлементНастройки)
	
	СтруктураНастроекОтчета = ПолучитьСтруктуруНасторйкиОтчета();
	Справочники.CW_НастройкиПользователей.СохранитьНастройку(ЭлементНастройки, СтруктураНастроекОтчета); 

КонецПроцедуры

#Конецобласти
