
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр = (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеОбъектовСлежения"));
	
	// кэшируем свойства параметров
	_ОбновитьСвойстваПараметров();
	
	// --- 
	
	_ОбновитьУсловноеОформлениеПараметров();
	
	// --- 
	
	_УправлениеЭлементамиФормы();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	//ХранениеПолногоЗначения
	Для Каждого СтрокаОбъекта из ТекущийОбъект.ПараметрыГрузоперевозки Цикл  
		ДобавитьСохраняемоеПолноеЗначение(СтрокаОбъекта.Параметр, СтрокаОбъекта.ХранилищеДанных.Получить());
	КонецЦикла;
	//---ХранениеПолногоЗначения

КонецПроцедуры

&НаСервере
Процедура _ОбновитьСвойстваПараметров()
	// --- 
	
	КартаПравПараметров = CW_ПраваДоступа.НаборПравДляПараметров();
	АдресКартыПравПараметров = ПоместитьВоВременноеХранилище(КартаПравПараметров, ЭтаФорма.УникальныйИдентификатор);
	// --- 
	КартаСвойствПараметров = _БЭ.ПолучитьСоответствиеСвойствПараметров();
	АдресКартыСвойствПараметров = ПоместитьВоВременноеХранилище(КартаСвойствПараметров, ЭтаФорма.УникальныйИдентификатор);
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	// ...
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПараметрыГрузоперевозкиПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ПараметрыГрузоперевозки.ТекущиеДанные;
	УдалитьСохраняемоеПолноеЗначение(ТекущиеДанные.Параметр);
	
КонецПроцедуры     



#Область ДобавлениеПараметров 

&НаКлиенте
Процедура ПараметрыГрузоперевозкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПараметра",ЭтотОбъект); 
	
	ПарамерыФормыВыбора = Новый Структура;
	ПарамерыФормыВыбора.Вставить("ВыборГруппИЭлементов"	, ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПарамерыФормыВыбора.Вставить("Множественныйвыбор"	, Истина);
	ПарамерыФормыВыбора.Вставить("Отбор"				, Новый Структура("ЭтоКонтрольнаяДата",Ложь)); // ограничиваем только контрольные даты
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПарамерыФормыВыбора,Элемент,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПараметра(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> Неопределено Тогда
		
		Если ТипЗнч(Ответ) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
			Ответ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответ);
		КонецЕсли;
		
		Для каждого Параметр из Ответ Цикл
			Если _ПараметрЯвляетсяГруппой(Параметр) Тогда
				МассивДобавляемых = _ЭлементыГруппыПараметров(Параметр);
				Для каждого ДобавляемыйПараметр из  МассивДобавляемых Цикл
					// проверяем, что параметр новый
					Если ДобавляемыйПараметрНовый(ДобавляемыйПараметр) Тогда
						ИдентификаторДобавленнойСтроки = _ДобавитьПараметр(ДобавляемыйПараметр);
					КонецЕсли;
				КонецЦикла;
			Иначе
				// проверяем, что параметр новый
				Если ДобавляемыйПараметрНовый(Параметр) Тогда
					ИдентификаторДобавленнойСтроки = _ДобавитьПараметр(Параметр);
				КонецЕсли;
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПараметрЯвляетсяГруппой(Параметр)
	// --- 
	
	Возврат(Параметр.ЭтоГруппа);
	
	// --- 
КонецФункции

&НаСервере
Функция _ЭлементыГруппыПараметров(ГруппаПараметров)
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.Ссылка В ИЕРАРХИИ(&Ссылка)
	               |	И CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", ГруппаПараметров);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат(ТЗ.ВыгрузитьКолонку("Ссылка"));
	
	// --- 
КонецФункции

&НаКлиенте
Функция ДобавляемыйПараметрНовый(Параметр)
	// --- 
	
	Отбор = Новый Структура("Параметр",Параметр);
	СтрокиПараметра = Объект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
	Возврат(СтрокиПараметра.Количество()=0);
	
	// --- 
КонецФункции

&НаСервере
Функция _ДобавитьПараметр(Параметр)
	
	// добавляем в ТЧ параметров
	СтрокаПараметра = Объект.ПараметрыГрузоперевозки.Добавить();
	СтрокаПараметра.Параметр = Параметр;

	//ХранениеПолногоЗначения
	ДобавитьСохраняемоеПолноеЗначение(СтрокаПараметра.Параметр);
	//---ХранениеПолногоЗначения

	_ОбновитьУсловноеОформлениеПараметров();

	Возврат Неопределено;
	
КонецФункции

#КонецОбласти 

#Область РедактированиеПараметров 

&НаКлиенте
Процедура ПараметрыГрузоперевозкиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	Идентификатор = Элементы.ПараметрыГрузоперевозки.ТекущаяСтрока;
	СтрокаТЧ = Объект.ПараметрыГрузоперевозки.НайтиПоИдентификатору(Идентификатор);
	// ---------------------------------------------------------------------------- 
	
	Параметр = Элемент.ТекущиеДанные.Параметр;
	
	// --- 
	ПараметрТолькоПросмотр = _ТолькоПросмотр(Параметр);
	СвойстваПараметра = _БЭ.СтруктураСвойствПараметра(Параметр);	
	Если (СвойстваПараметра.Ведомый) Тогда
		
		// проверяем ведущие на заполненность
		Результат = _ПроверитьЗаполнениеВедущих(Параметр,СвойстваПараметра.СписокВедущих);
		Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
			
			_УФК.ВывестиПредупреждение("Данный параметр является зависимым!");
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли; 
	Если (СвойстваПараметра.ДинамическийПараметр) Тогда
		
		_УФК.ВывестиПредупреждение("Динамические параметры не редактируются");
		Возврат;
		
	КонецЕсли;
	// --- 
	
	АдресОбъекта   =  _АдресОбъекта();
	ВыбраннаяФорма = Неопределено;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим", 					"РедактированиеОбъекта");
	ПараметрыФормы.Вставить("Параметр", 				Параметр);
	ПараметрыФормы.Вставить("АдресСвойствПараметра", 	ПоместитьВоВременноеХранилище(СвойстваПараметра,ЭтаФорма.УникальныйИдентификатор));
	ПараметрыФормы.Вставить("АдресОбъекта", 			АдресОбъекта);
	ПараметрыФормы.Вставить("ТолькоПросмотр", 			ПараметрТолькоПросмотр);
	ПараметрыФормы.Вставить("Значение", 				СтрокаТЧ.Значение);
	
	//ХранениеПолногоЗначения  
	Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда
		Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда
			ПолноеЗначение = СохраняемоеПолноеЗначение.Получить(Параметр);
		КонецЕсли;
		ПолноеЗначение = ?(ПолноеЗначение=Неопределено, СтрокаТЧ.Значение, ПолноеЗначение);
		
		ПараметрыФормы.Вставить("ПолноеЗначение", ПолноеЗначение);
	КонецЕсли;
	//---ХранениеПолногоЗначения
	
	// ---                                          	
	ПОВ = Новый ОписаниеОповещения("ОбработатьИзменениеПараметра",ЭтотОбъект,Новый Структура("СвойстваПараметра,Параметр",СвойстваПараметра,Параметр));
	
	Если СвойстваПараметра.ИспользоватьФормуВыбораОбъекта тогда
		
		Если Не ПараметрТолькоПросмотр Тогда
			ВыбраннаяФорма = СвойстваПараметра.ИмяФормыВыбора;
			
			ПараметрыФормы.Вставить("РежимВыбора"		,         Истина);
			ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",         Истина);
			
			Если СвойстваПараметра.ИспользуютсяДополнительныеЗначения Тогда
				ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец",Параметр));
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Если СвойстваПараметра.ИспользуетсяВнешняяОбработкаПередНачаломИзменения Тогда
			СтруктураПараметров = _ПО.ПолучитьИмяФормыНаСервере(Параметр, АдресОбъекта);
			ВыбраннаяФорма 		= "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
			
			ОбработчикНеИспользуется = Ложь;
			Если СтруктураПараметров.Свойство("НеИспользуется") Тогда
				ОбработчикНеИспользуется = СтруктураПараметров.НеИспользуется;
			КонецЕсли;

			Если СтруктураПараметров.Свойство("ТолькоПросмотр") Тогда
				Если  НЕ ПараметрыФормы.ТолькоПросмотр Тогда
					ПараметрыФормы.ТолькоПросмотр =  СтруктураПараметров.ТолькоПросмотр;
				КонецЕсли;
			КонецЕсли;
			
			Если СтруктураПараметров.Свойство("ПодключаемыйОбъект") Тогда
				ПараметрыФормы.Вставить("ПодключаемыйОбъект",СтруктураПараметров.ПодключаемыйОбъект);
			КонецЕсли; 
			
			Если ОбработчикНеИспользуется ИЛИ 
				СтруктураПараметров.РежимОткрытия = 1 Тогда
				ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
			ИначеЕсли	СтруктураПараметров.РежимОткрытия = 0 Тогда
				ВыбраннаяФорма = СтруктураПараметров.ИмяФормы;
			КонецЕсли;
					
		Иначе
			ВыбраннаяФорма = "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаРедактирования";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыбраннаяФорма <> Неопределено Тогда
		ОткрытьФорму(ВыбраннаяФорма, ПараметрыФормы,ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция _АдресОбъекта()
	
	ТаблицаПараметров = Объект.ПараметрыГрузоперевозки.Выгрузить();
	ТаблицаПараметров.Колонки.Добавить("ХранилищеДанных"); 
	ТаблицаПараметров.Очистить(); 
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого СтрокаТаблицы из ТОбъект.ПараметрыГрузоперевозки Цикл
		НоваяСтрока = ТаблицаПараметров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы); 
		
		НоваяСтрока.ХранилищеДанных = Новый ХранилищеЗначения(СтрокаТаблицы.ХранилищеДанных.Получить());
	КонецЦикла;
	
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Ссылка", 			Объект);
	СтруктураОбъекта.Вставить("ТаблицаПараметров", 	ТаблицаПараметров); 
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураОбъекта,ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция _ТолькоПросмотр(Параметр)
	// --- 
	
	ТолькоПросмотр = Истина;
	
	НаборПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	Попытка
		
		ТолькоПросмотр = (НЕ НаборПрав["п_"+_сф.КлючПоСсылке(Параметр)].Редактирование);
		
	Исключение
		ТолькоПросмотр = Истина;
	КонецПопытки; 
	
	Возврат(ТолькоПросмотр);
	
	// --- 
КонецФункции

&НаСервере
Функция _ПроверитьЗаполнениеВедущих(Параметр,СписокВедущих)
	// --- 
	
	// контроллируем заполнение и единство
	ФлагОшибки = Ложь;
	ТекстОшибки = "";
	Для каждого ВедущийПГ Из СписокВедущих Цикл
		
		// проверяем параметр у переданных объектов
		МассивНепустыхЗначений = Новый Массив;
		
		ВедущийПараметр = ВедущийПГ.Значение;
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,"Параметр",ВедущийПараметр);
		Если СтрокаПараметра = Неопределено Тогда
			
			ЗначениеПараметра = Неопределено;
			
		Иначе
			
			ЗначениеПараметра = СтрокаПараметра.Значение;
			
		КонецЕсли; 
		Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			
			_сф.м_ДобавитьУникально(МассивНепустыхЗначений,ЗначениеПараметра);
			
		Иначе
			
			ФлагОшибки = Истина;
			ТекстОшибки = "";
			
		КонецЕсли; 
		
		
		// теперь если нет ошибки считаем количество
		// если не 1, то выдаём ошибку
		Если НЕ ФлагОшибки Тогда
			
			Если МассивНепустыхЗначений.Количество() <> 1 Тогда
				
				ФлагОшибки = Истина;
				ТекстОшибки = ""
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если ФлагОшибки Тогда
			
			// тут необходимо закрыть форму и вернуть описание ошибки
			ТекстОшибки = "Условия отбора для выбранного параметра ("""+Параметр.Наименование+""") требуют, чтобы было задано значение параметра """+ВедущийПараметр.Наименование+""".";
			Возврат(_УФКС.Ответ(1,ТекстОшибки));
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

// --- 

&НаКлиенте
Процедура ОбработатьИзменениеПараметра(Ответ,ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если ТипЗнч(Ответ) <> Тип("Структура") И ТипЗнч(Ответ) <> Тип("Массив") Тогда
			//В случае если ответ форме не имеет тип структура, поместим его в структуру для последующей обработки
			Ответ = _ПО.ПолучитьСтруктуруОтветаВнешнейФормы(Ответ, ДополнительныеПараметры.Параметр);
		КонецЕсли;
		
		Если ТипЗнч(Ответ) <> Тип("Массив") Тогда
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Ответ);
		Иначе
			МассивПараметров = Ответ;
		КонецЕсли;
		
		Для каждого ОтветСтруктура из МассивПараметров Цикл
			
			Если (ОтветСтруктура.ПараметрИзменен) Тогда
				
				Если (ДополнительныеПараметры.СвойстваПараметра = Неопределено) Тогда
					СписокВедомых = Неопределено;
				Иначе	
					СписокВедомых = ДополнительныеПараметры.СвойстваПараметра.СписокВедомых;
				КонецЕсли; 
				// --- 
				Ответ = ОбновитьПараметрНаСервере(ОтветСтруктура, СписокВедомых);	
				Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
					
					ЭтаФорма.Модифицированность = Истина;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаСервере
Функция ОбновитьПараметрНаСервере(СтруктураПараметра, СписокВедомых)
	
	Параметр = СтруктураПараметра.Параметр;
	
	КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	СП = КартаСвойств.Получить(Параметр);
	КартаПрав = ПолучитьИзВременногоХранилища(АдресКартыПравПараметров);
	НП = КартаПрав["п_"+_сф.КлючПоСсылке(Параметр)];
	
	СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,Новый Структура("Параметр",Параметр));
	Если СтруктураПараметра.Значение <> Неопределено Тогда
		СтрокаПараметра.Значение = СтруктураПараметра.Значение;
	КонецЕсли; 
	Если СП.ЭтоКонтрольнаяДата Тогда
		Если СтрокаПараметра.ЗначениеПлан <> Неопределено Тогда
			СтрокаПараметра.ЗначениеПлан = СтруктураПараметра.ЗначениеПлан;
		КонецЕсли;
		Если СтрокаПараметра.ЗначениеФакт <> Неопределено Тогда
			СтрокаПараметра.ЗначениеФакт = СтруктураПараметра.ЗначениеФакт;
		КонецЕсли;
	КонецЕсли; 
	Если СтрокаПараметра.Примечание <> Неопределено Тогда
		СтрокаПараметра.Примечание = СтруктураПараметра.Примечание;
	КонецЕсли; 
	
	//ХранениеПолногоЗначения  
	Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда    
		Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда 
			ДобавитьСохраняемоеПолноеЗначение(Параметр, СтруктураПараметра.ПолноеЗначение);
		КонецЕсли;
	КонецЕсли;
	//---ХранениеПолногоЗначения
	
	Ответ = _УФКС.Ответ();
	Возврат Ответ;
	
КонецФункции

#КонецОбласти 


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Запись данных харнилища занчений по строкам 
	Для Каждого ЭлементСписка из СписокАдресовЗначенийПараметров Цикл
		
		//ДанныеПоАдресу - тип "Структура("Параметр, ТаблицаДанных")
		ДанныеПоАдресу = ЭлементСписка.Значение;
		
		Отбор = Новый Структура("Параметр", ДанныеПоАдресу.Параметр);
		мСтроки = ТекущийОбъект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
		Если мСтроки.Количество() > 0 Тогда
			//Предполагаем что строка будет только одна
			СтрокаДанных = мСтроки[0]; 
			СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(ДанныеПоАдресу.ДанныеДляХранения);	
		КонецЕсли;
		
	КонецЦикла;
	
	//ХранениеПолногоЗначения 
	Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда 
		Для Каждого КлючЗначение из СохраняемоеПолноеЗначение Цикл
			Отбор = Новый Структура("Параметр", КлючЗначение.Ключ);
			НайденныеСтроки = ТекущийОбъект.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				//Предполагаем что строка будет только одна
				СтрокаДанных = НайденныеСтроки[0];   
				СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(КлючЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//---ХранениеПолногоЗначения
	
	
КонецПроцедуры


// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаПерезаполнитьПараметрыВедомых(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияПерезаписиПараметров",ЭтотОбъект, Новый Структура()); 
	ПоказатьВопрос(ПОВ,"Прописать параметры в связанные объекты отслеживаемого оборудования и грузоперевозки?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаПодтвержденияПерезаписиПараметров(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			Записать();
			_ПерезаполнитьПараметрыВедомых();
			
		КонецЕсли;  
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаСервере
Процедура _ПерезаполнитьПараметрыВедомых()
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОтслеживаемоеОборудование.Ссылка
	               |ИЗ
	               |	Справочник.CW_ОтслеживаемоеОборудование КАК CW_ОтслеживаемоеОборудование
	               |ГДЕ
	               |	CW_ОтслеживаемоеОборудование.ВариантСлежения = &ВариантСлежения";
	Запрос.УстановитьПараметр("ВариантСлежения", Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	// --- 
	Для каждого Стр Из ТЗ Цикл
		
		ОтслеживаемоеОборудованиеОбъект = Стр.Ссылка.ПолучитьОбъект();
		// --- 
		Для каждого СтрокаПараметраОборудования Из Объект.ПараметрыГрузоперевозки Цикл
			
			СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ОтслеживаемоеОборудованиеОбъект,СтрокаПараметраОборудования.Параметр);
			Если (СтрокаПараметра = Неопределено) Тогда
				
				СтрокаПараметра = ОтслеживаемоеОборудованиеОбъект.ПараметрыГрузоперевозки.Добавить();
				СтрокаПараметра.Параметр = СтрокаПараметраОборудования.Параметр;
				
			КонецЕсли; 
			СтрокаПараметра.Значение = СтрокаПараметраОборудования.Значение;
			СтрокаПараметра.Примечание = СтрокаПараметраОборудования.Примечание;
			
		КонецЦикла; 
		// --- 
		ОтслеживаемоеОборудованиеОбъект.Записать();
		
	КонецЦикла;

	
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.ОтслеживаемоеОборудование.ВариантСлежения = &ВариантСлежения";
	Запрос.УстановитьПараметр("ВариантСлежения", Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить();
	// --- 
	Для каждого Стр Из ТЗ Цикл
		
		ГрузоперевозкаОбъект = Стр.Ссылка.ПолучитьОбъект();
		// --- 
		Для каждого СтрокаПараметраОборудования Из Объект.ПараметрыГрузоперевозки Цикл
			
			СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ГрузоперевозкаОбъект,СтрокаПараметраОборудования.Параметр);
			Если (СтрокаПараметра = Неопределено) Тогда
				
				СтрокаПараметра = ГрузоперевозкаОбъект.ПараметрыГрузоперевозки.Добавить();
				СтрокаПараметра.Параметр = СтрокаПараметраОборудования.Параметр;
				
			КонецЕсли; 
			СтрокаПараметра.Значение = СтрокаПараметраОборудования.Значение;
			СтрокаПараметра.Примечание = СтрокаПараметраОборудования.Примечание;
			
		КонецЦикла; 
		// --- 
		ГрузоперевозкаОбъект.Записать();
		
	КонецЦикла;
	 
	
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ОбновитьУсловноеОформлениеПараметров()
	// --- 
	
	СвойстваПараметров = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
	// --- 
	
	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	Для каждого Стр Из Объект.ПараметрыГрузоперевозки Цикл
		
		Если (Стр.Параметр.ДинамическийПараметр) Тогда
			
			УО = _УФС.ДобавитьПростоеУсловноеОформление(ЭтаФорма,"Объект.ПараметрыГрузоперевозки.Параметр",,Стр.Параметр,"ПараметрыГрузоперевозкиЗначение","Текст",Стр.Параметр.Формула);
			
		Иначе
			
			ФорматВывода = Стр.Параметр.ФорматВывода;
			Если (ФорматВывода = "") Тогда
				
				СвойстваПараметра = СвойстваПараметров.Получить(Стр.Параметр);
				Если (СвойстваПараметра = Неопределено) Тогда
					КартаСвойств = ПолучитьИзВременногоХранилища(АдресКартыСвойствПараметров);
					СвойстваПараметра = КартаСвойств.Получить(Стр.Параметр);
				КонецЕсли;
				ТипЗначенияПараметра = СвойстваПараметра.ТипЗначения;
				ТипПараметра = СвойстваПараметра.ТипЗначения.Типы()[0];
				Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
					
					Если (НЕ СвойстваПараметра.КонтрольнаяДатаИспользуетВремя) Тогда
						ФорматВывода = "ДФ=dd.MM.yyyy";
					Иначе
						ФорматВывода = "ДФ='dd.MM.yyyy HH:mm'";
					КонецЕсли; 
					
				Иначе
					
					Если (ТипПараметра = Тип("Булево") ИЛИ ТипПараметра = Тип("Дата") ИЛИ ТипПараметра=Тип("Число")) Тогда
						
						Если ТипПараметра = Тип("Дата") Тогда
							
							ФорматВывода = "";
							ЧастьДаты = ТипЗначенияПараметра.КвалификаторыДаты.ЧастиДаты;
							Если ЧастьДаты = ЧастиДаты.Дата Тогда
								
								// формат дат по умолчанию
								ФорматВывода = "ДФ=dd.MM.yyyy";
								
							ИначеЕсли ЧастьДаты = ЧастиДаты.Время Тогда 
								
								// формат дат по умолчанию
								ФорматВывода = "ДФ=HH:mm:ss";
								
							ИначеЕсли ЧастьДаты = ЧастиДаты.ДатаВремя Тогда 
								
								// формат дат по умолчанию
								ФорматВывода = "ДЛФ=";
								
							КонецЕсли;
							
						КонецЕсли; 
						
					КонецЕсли; 					
					
				КонецЕсли;  
			КонецЕсли; 
			Если (ФорматВывода <> "") Тогда
				УО = _УФС.ДобавитьПростоеУсловноеОформление(ЭтаФорма,"Объект.ПараметрыГрузоперевозки.Параметр",,Стр.Параметр,"ПараметрыГрузоперевозкиЗначение","Формат",ФорматВывода);
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ПараметрИзменен") Тогда
		
		_ОбновитьСвойстваПараметров();
		
	КонецЕсли;
	
КонецПроцедуры

//ХранениеПолногоЗначения
&НаСервере
Процедура ДобавитьСохраняемоеПолноеЗначение(Параметр, ХранимоеЗначение=Неопределено)
	
	Если Не CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда   
		Возврат
    КонецЕсли;
	
	Соответствие = Новый Соответствие;
	Если ТипЗнч(СохраняемоеПолноеЗначение) = Тип("ФиксированноеСоответствие") Тогда
		Соответствие = Новый Соответствие(СохраняемоеПолноеЗначение);                                             
	КонецЕсли;
	
	Соответствие.Вставить(Параметр, ХранимоеЗначение);
	СохраняемоеПолноеЗначение = Новый ФиксированноеСоответствие(Соответствие);
	
КонецПроцедуры  

&НаСервере
Процедура УдалитьСохраняемоеПолноеЗначение(Параметр)
	
	Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр) Тогда
		Соответствие = Новый Соответствие(СохраняемоеПолноеЗначение);
		Соответствие.Удалить(Параметр); 
		СохраняемоеПолноеЗначение = Новый ФиксированноеСоответствие(Соответствие);
	КонецЕсли;
	
КонецПроцедуры
//---ХранениеПолногоЗначения


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
