
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	ОбновитьСписокОрганизаций();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ОповещатьФормуПодключения Тогда
		Оповестить("БизнесСеть_РегистрацияОрганизаций",, ВладелецФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "БизнесСеть_РегистрацияОрганизаций" Тогда
		ОбновитьСписокОрганизаций();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодключенныеОрганизации

&НаКлиенте
Процедура ПодключенныеОрганизацииПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПодключенныеОрганизации.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаПодключить.Доступность = ТекущиеДанные.СтатусПодключения <> 0;
	Элементы.ФормаОтключить.Доступность = ТекущиеДанные.СтатусПодключения = 0;
	Элементы.ДекорацияТребуетсяПовторноеПодключение.Видимость = ТекущиеДанные.ТребуетсяПовторноеПодключение; 
	
	Если ТекущиеДанные.СтатусПодключения = 1 Тогда
		Элементы.ДекорацияОрганизацияНеПодключена.Видимость = Истина;
		
		Подстрока1 = СтрШаблон("Для подключения %1 требуется отправка ", Элементы.ПодключенныеОрганизации.ТекущиеДанные.Организация);
		Подстрока2 = Новый ФорматированнаяСтрока(НСтр("ru='Заявления'"), , , , "ЗаявлениеНаПереключение");
		
		Предложение1 = Новый ФорматированнаяСтрока(
		Подстрока1,
		Подстрока2);
		
		Элементы.ДекорацияОрганизацияНеПодключена.Заголовок = Предложение1;
	Иначе
		Элементы.ДекорацияОрганизацияНеПодключена.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключить(Команда)
	
	ТекущиеДанные = Элементы.ПодключенныеОрганизации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ТекущиеДанные.Организация;
	ТребуетсяПовторноеПодключение = ТекущиеДанные.ТребуетсяПовторноеПодключение;
	ПодключитьОрганизациюНаСервере(Организация, ТребуетсяПовторноеПодключение);
	
КонецПроцедуры

&НаКлиенте
Процедура Отключить(Команда)
	
	ТекущиеДанные = Элементы.ПодключенныеОрганизации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ТекущиеДанные.Организация;
	СписокОрганизаций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
	
	Отказ = Ложь;
	БизнесСетьВызовСервера.ОтключитьОрганизации(СписокОрганизаций, Отказ);
	ОбновитьСписокОрганизаций();
	ОповещатьФормуПодключения = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокОрганизаций()
	
	ПодключенныеОрганизации.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодключенныеОрганизации", БизнесСеть.ПодключенныеОрганизации());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Организация КАК Организация,
	|	Организации.ТребуетсяПовторноеПодключение КАК ТребуетсяПовторноеПодключение
	|ПОМЕСТИТЬ ПодключенныеОрганизации
	|ИЗ
	|	&ПодключенныеОрганизации КАК Организации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПодключенныеОрганизации.Организация ЕСТЬ NULL
	|				ТОГДА ""Не подключена""
	|			КОГДА ПодключенныеОрганизации.ТребуетсяПовторноеПодключение
	|				ТОГДА ""Требуется повторное подключение""
	|			ИНАЧЕ ""Подключена""
	|		КОНЕЦ КАК СТРОКА(50)) КАК Пояснение,
	|	ВЫБОР
	|		КОГДА ПодключенныеОрганизации.Организация ЕСТЬ NULL
	|				ИЛИ ПодключенныеОрганизации.ТребуетсяПовторноеПодключение
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусПодключения,
	|	ЕСТЬNULL(ПодключенныеОрганизации.ТребуетсяПовторноеПодключение, ЛОЖЬ) КАК ТребуетсяПовторноеПодключение
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодключенныеОрганизации КАК ПодключенныеОрганизации
	|		ПО Организации.Ссылка = ПодключенныеОрганизации.Организация
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления";
	
	Организации = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаОрганизации Из Организации Цикл
		Если СтрокаОрганизации.СтатусПодключения = 2
			И Не СтрокаОрганизации.ТребуетсяПовторноеПодключение
			И СервисСверкиРасчетов.ОрганизацияЗарегистрированаПодИнымЛогиномИТС(СтрокаОрганизации.Организация) Тогда
			СтрокаОрганизации.Пояснение = НСтр("ru = 'Требуется отправка заявления'");
			СтрокаОрганизации.СтатусПодключения = 1;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Организации, ПодключенныеОрганизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОрганизацияЗарегистрированаРанееОбработкаНавигационнойСсылки(Элемент,НавигационнаяСсылкаФорматированнойСтроки,СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "НастройкиИнтернетПоддержки" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыВыполненияКоманды = Новый Структура;
		ПараметрыВыполненияКоманды.Вставить("Окно",Неопределено);
		ПараметрыВыполненияКоманды.Вставить("Источник",ЭтотОбъект);
		НастройкиПрограммыБИПКлиент.ОткрытьНастройкиИнтернетПоддержкаИСервисы(ПараметрыВыполненияКоманды);
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЗаявлениеНаПереключение" Тогда
		СтандартнаяОбработка = Ложь;
		ТекстВопроса = ТекстВопросаПереходаВБизнесСеть();
		Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияПереходаВБизнесСеть", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодключитьОрганизациюНаСервере(Организация, ТребуетсяПовторноеПодключение)
	
	Если ТребуетсяПовторноеПодключение Тогда
		СписокОрганизаций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
		Отказ = Ложь;
		БизнесСетьВызовСервера.ОтключитьОрганизации(СписокОрганизаций, Отказ);
	КонецЕсли;
	
	РезультатПодключенияОрганизациюКСервису = СервисСверкиРасчетовМенеджерОбмена.РезультатПодключенияОрганизациюКСервису(Организация);
	Если Не ЗначениеЗаполнено(РезультатПодключенияОрганизациюКСервису.ТекстОшибки) Тогда
		ОбновитьСписокОрганизаций();
		ОповещатьФормуПодключения = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОрганизацияНеПодключенаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЗаявлениеНаПереключение" Тогда
		СтандартнаяОбработка = Ложь;
		ТекстВопроса = ТекстВопросаПереходаВБизнесСеть();
		Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияПереходаВБизнесСеть", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОРазделеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ЗаявлениеНаПереключение" Тогда
		СтандартнаяОбработка = Ложь;
		ТекстВопроса = ТекстВопросаПереходаВБизнесСеть();
		Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияПереходаВБизнесСеть", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЛогинИТС()
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Логин = СервисСверкиРасчетовПереключениеЛогинаИТС.ПолучитьИдентификаторИТС();
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		ДанныеАутентификации = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
		Логин = ДанныеАутентификации.Логин;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
		
	Возврат Логин;
	
КонецФункции

&НаКлиенте
Функция ТекстВопросаПереходаВБизнесСеть()

	ПолужирныйШрифт = Новый Шрифт(, , Истина);
	
	ЛогинИТС = ПолучитьЛогинИТС();
	
	Возврат Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока(
		НСтр("ru = 'Заявление отправляется через 1С:Бизнес-сеть. Открыть сайт?'"), ПолужирныйШрифт),
		Символы.ПС + Символы.ПС,
		НСтр("ru = '1. Войдите под логином интернет-поддержки: '"),
		Новый ФорматированнаяСтрока(ЛогинИТС, ПолужирныйШрифт),
		Символы.ПС,
		НСтр("ru = '2. Подайте заявление по инструкции на сайте'"),
		Символы.ПС,
		НСтр("ru = '3. Дождитесь обработки заявления - до '"),
		Новый ФорматированнаяСтрока(НСтр("ru = '2 рабочих дней'"), ПолужирныйШрифт),
		Символы.ПС + Символы.ПС,
		НСтр("ru = 'После обработки заявления повторите попытку подключения'"));
	
КонецФункции

&НаКлиенте
Процедура ПослеПодтвержденияПереходаВБизнесСеть(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	АдресХранилищаОрганизации = ПоместитьДанныеОрганизацииВХранилище(Элементы.ПодключенныеОрганизации.ТекущиеДанные.Организация);
	ДанныеОрганизации = ПолучитьИзВременногоХранилища(АдресХранилищаОрганизации );
	БизнесСетьСлужебныйКлиент.ОткрытьСтраницуРегистрацииОрганизации(ДанныеОрганизации);
	ОповещатьФормуПодключения = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеОрганизацииВХранилище(ТекущаяОрганизация)
	
	Возврат ПоместитьВоВременноеХранилище(
			БизнесСеть.ДанныеОрганизацииВBase64(ТекущаяОрганизация), УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти