////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции, общие для всех форм отчета.
// Модуль заполняется только при сохранении отчета как внешнего отчета.
// В таком отчете невозможно сохранить модуль менеджера, и его требуется
// перенести в модуль объекта.
// Обращение к процедурам и функциям модулей осуществляется через функцию,
// возвращающую ссылку на доступный модуль отчета.
// см. РегламентированнаяОтчетностьВызовСервера.ОтчетОбъект
// 
////////////////////////////////////////////////////////////////////////////////
#Область СлужебныеПроцедурыИФункции
#Область ИнтеграцияСОблачнойОтчетностью

// Функция определяет отображение кнопки "Заполнить" в облачной отчетности
// 
// Параметры:
//  ИДРедакцииОтчета - Строка
// 
// Возвращаемое значение:
//  Булево - Релизована поддержка заполнения в облачной отчетности
Функция РелизованаПоддержкаЗаполненияВОблачнойОтчетности(ИДРедакцииОтчета) Экспорт
	
	МассивПоддерживаемых = Новый Массив(); // Массив Из Строка
	МассивПоддерживаемых.Добавить("ФормаОтчета2017Кв3");
	МассивПоддерживаемых.Добавить("ФормаОтчета2011Кв4");
	
	
	Возврат МассивПоддерживаемых.Найти(ИДРедакцииОтчета) <> Неопределено;
	
КонецФункции

// Функция определяет отображение кнопки "Расшифровать" в облачной отчетности
//
// Параметры:
//  ИДРедакцииОтчета - Строка
//  
// Возвращаемое значение:
//   Булево 
Функция РелизованаПоддержкаРасшифровкиВОблачнойОтчетности(ИДРедакцииОтчета) Экспорт

	МассивПоддерживаемых = Новый Массив(); // Массив Из Строка
	
	Возврат МассивПоддерживаемых.Найти(ИДРедакцииОтчета) <> Неопределено;

КонецФункции

#КонецОбласти
#КонецОбласти
