#Область СлужебныйПрограммныйИнтерфейс

#Область ЗаполнениеКодовМаркировкиВФормеПроверки

// Добавляет возвможные варианты заполнения
// Параметры:
// Форма - ФормаКлиентскогоПриложения:
//	* ПроверкаНеПоДокументу - Булево
//	* РазрешитьЗагрузкуПоОрдерам - Булево
// ВариантыЗаполнения - СписокЗначений из Строка - возвращаемое значение
Процедура ПриОпределенииВариантовЗаполненияКодовМаркировки(Форма, ВариантыЗаполнения) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Параметры:
// Форма - ФормаКлиентскогоПриложения:
// ВариантЗаполнения - Строка
// ПараметрыОбработкиТСД - Структура
Процедура ПриОбработкеВариантаЗаполненияКодовМаркировки(Форма, ВариантЗаполнения, ПараметрыОбработкиТСД) Экспорт

	Возврат;
	
КонецПроцедуры

#КонецОбласти

#Область ОткрытиеФормыПроверкиИПодбора

// Заполняет специфичные параметры открытия форм проверки и подбора маркируемой продукции в зависимости от точки вызова
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма из которой происходит открытие формы проверки и подбора
//  Параметры - (См. ПроверкаИПодборПродукцииИСКлиент.ПараметрыОткрытияФормыПроверкиИПодбора)
//
Процедура ПриУстановкеПараметровОткрытияФормыПроверкиИПодбора(Форма, Параметры) Экспорт

	Параметры.ИмяРеквизитаДокументОснование = "";
	ЭтоИсходящий = Ложь;
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ПоступлениеТоваровУслуг") Тогда
		
		Параметры.ИмяРеквизитаКонтрагент = "Контрагент";
		Параметры.ЕГАИС  = Истина;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Ложь;
		Параметры.РежимПодбораСуществующихУпаковок = Ложь;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.РеализацияТоваровУслуг") Тогда
		
		Параметры.ЕГАИС  = Истина;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Ложь;
		ЭтоИсходящий 	 = Истина;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.КорректировкаРеализации") Тогда
		
		Параметры.ЕГАИС  = Истина;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Ложь;
        ЭтоИсходящий 	 = Истина;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ВозвратТоваровОтПокупателя") Тогда
		
		Параметры.ЕГАИС  = Истина;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Ложь;

	ИначеЕсли  ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ПередачаТоваров") Тогда
		
		Параметры.ЕГАИС  = Истина;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Ложь;
        ЭтоИсходящий 	 = Истина;
		
	КонецЕсли;
	
	//БгосИС 2.0.7
	//Для исходящих документов, из которых возможна отправка УПД с сырьем ГИС МТ и в табличной части присутствует сырье, 
	//необходимо переопределить имя открываемой формы ("СопоставлениеСырья"), чтобы дать возможность пользователю настроить
	//сопоставление отправляемой номенклатуры и сырья.
	Если ЭтоИсходящий Тогда
		ВидыПродукцииСырье = КонструкторИСМПКлиентСервер.ВидыПродукцииСырьеГИСМТ();
	    Если ВидыПродукцииСырье.Количество() Тогда
	        Для Каждого СтрокаТовары Из Форма.Объект.Товары Цикл
	            Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(СтрокаТовары.ВидПродукцииИС) Тогда
	                Параметры.ИмяФормыПроверки = "СопоставлениеСырья";
	                Прервать;
	            КонецЕсли;
	        КонецЦикла;
	    КонецЕсли;
	КонецЕсли;
	//Конец БгосИС 2.0.7
	
КонецПроцедуры

// Выполняет специфичные действия после закрытия форм проверки и подбора маркируемой продукции в зависимости от точки вызова
//
// Параметры:
//  РезультатЗакрытия - Произвольный - результат закрытия формы проверки и подбора
//  ДополнительныеПараметры - Структура - определяет источник вызова:
//   * Форма - ФормаКлиентскогоПриложения - форма из которой происходил вызов.
//
Процедура ПриЗакрытииФормыПроверкиИПодбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ДополнительныеПараметры.Форма.Прочитать();
	
КонецПроцедуры

// Выполняет специфичные действия перед открытием форм проверки и подбора маркируемой продукции в зависимости от точки вызова
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения       - форма из которой происходит открытие формы проверки и подбора
//  ПараметрыОткрытияФормыПроверки - Структура - параметры открытия формы проверки и подбора для формы-источника
//  ПараметрыФормыПроверки         - Структура - подготовленные параметры открытия формы проверки и подбора
//  Отказ                          - Булево    - отказ от открытия формы
//
Процедура ПередОткрытиемФормыПроверкиПодбора(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыФормыПроверки, Отказ) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

