
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьТекстРекомендаций();
	
	МобильныйКлиентАдаптацияФормы();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	Если НавигационнаяСсылкаФорматированнойСтроки = "НастройкиНалоговОтчетов" Тогда
		СтандартнаяОбработка = Ложь;
		ТарификацияБПКлиент.ПерейтиВНастройкиНДСОрганизации();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = ТарификацияБПКлиентСервер.ИмяДействияОплатаСервиса() Тогда
		СтандартнаяОбработка = Ложь;
		ТарификацияБПКлиент.ОткрытьФормуОплатыСервиса();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьТекстРекомендаций()
	
	Элементы.ОписаниеЗаголовок.Заголовок = НСтр("ru = 'В программе используется раздельный учет НДС, который не входит в ваш тариф.
		|Возможность проведения документов заблокирована.'");
	
	ТекстРекомендаций = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Восстановить возможность проведения документов можно, отключив использование раздельного учета НДС в <a href=""НастройкиНалоговОтчетов"">Настройках налогов и отчетов</a>'"));
	
	Элементы.ОписаниеФункциональность.Заголовок = ТекстРекомендаций;
	
	ТекстРекомендаций = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Если же эта возможность вам действительно нужна, <a href=""%1"">перейдите на другой тариф</a>'"),
		ТарификацияБПКлиентСервер.ИмяДействияОплатаСервиса());
	
	Элементы.ОписаниеТариф.Заголовок = ТекстРекомендаций;
	
КонецПроцедуры

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаКартинкаОписание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
