
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВосстановитьСеансовуюНастройку();
	
	ТранспортныеСообщенияВходящие.Параметры.УстановитьЗначениеПараметра("Организация",Получатель);
	ТранспортныеСообщенияВходящие.Параметры.УстановитьЗначениеПараметра("СостояниеОбмена",Перечисления.CW_DT_СостоянияОбмена.ПустаяСсылка());
	ТранспортныеСообщенияИсходящие.Параметры.УстановитьЗначениеПараметра("Организация",Получатель);
	ТранспортныеСообщенияИсходящие.Параметры.УстановитьЗначениеПараметра("СостояниеОбмена",Перечисления.CW_DT_СостоянияОбмена.ПустаяСсылка());
	
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_ПрофилиОбмена.Организация КАК Организация
		|ИЗ
		|	Справочник.CW_DT_ПрофилиОбмена КАК CW_DT_ПрофилиОбмена
		|ГДЕ
		|	НЕ CW_DT_ПрофилиОбмена.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_DT_ПрофилиОбмена.Организация";
	Элементы.Получатель.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация"));
	ЗаполнитьДеревоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСеансовуюНастройку()
	СтруктураНастройки = ХранилищеСистемныхНастроек.Загрузить("CWDT.МенеджерСообщений.Форма","Сеансовая");
	Если СтруктураНастройки <> Неопределено Тогда
		СтруктураНастройки.Свойство("Получатель",Получатель);
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СохранитьСеансовуюНастройку()
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Получатель",Получатель);
	ХранилищеСистемныхНастроек.Сохранить("CWDT.МенеджерСообщений.Форма","Сеансовая",СтруктураНастройки);
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьНовыеСообщения(Команда)
	ОткрытьФорму("Обработка.CW_DT_МенеджерСообщений.Форма.ФормаНовыхСообщений",Новый Структура("Получатель",Получатель),,,,,Новый ОписаниеОповещения("ВходящиеОбновить",ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеОбновить(Рез,ДП) Экспорт
	Возврат;
	//Если Рез = Истина Тогда
		Элементы.ТранспортныеСообщенияВходящие.Обновить();
	//КонецЕсли;
	ОбновитьКоличествоПолученных();
	ПерейтиВПолученные();
КонецПроцедуры
 
&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	ТранспортныеСообщенияИсходящие.Параметры.УстановитьЗначениеПараметра("Организация",Получатель);
	ТранспортныеСообщенияВходящие.Параметры.УстановитьЗначениеПараметра("Организация",Получатель);
	ОбновитьКоличествоПолученных();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСообщенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.CW_DT_ЗагрузкаРасходов.Форма",Новый Структура("ТранспортноеСообщение",ВыбраннаяСтрока),,ВыбраннаяСтрока); 	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСообщенияЗагруженныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.CW_DT_ЗагрузкаРасходов.Форма",Новый Структура("ТранспортноеСообщение",ВыбраннаяСтрока),,ВыбраннаяСтрока); 	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоНаСервере()

	Входящие = ДеревоДействий.ПолучитьЭлементы().Добавить();
	Входящие.Представление		= "Входящие";
	Входящие.Направление		= "Входящие";
	
	Полученные = Входящие.ПолучитьЭлементы().Добавить();
	Полученные.Представление	= "Полученные";
	Полученные.Направление		= "Входящие";
	Полученные.СостояниеОбмена	= Перечисления.CW_DT_СостоянияОбмена.Получен;
	ИдентификаторВетвиПолученные= Полученные.ПолучитьИдентификатор();
	
	Загруженные = Входящие.ПолучитьЭлементы().Добавить();
	Загруженные.Представление	= "Загруженные";
	Загруженные.Направление		= "Входящие";
	Загруженные.СостояниеОбмена = Перечисления.CW_DT_СостоянияОбмена.Загружен;
	
	Исходящие = ДеревоДействий.ПолучитьЭлементы().Добавить();
	Исходящие.Представление		= "Исходящие";
	Исходящие.Направление		= "Исходящие";
	
	Созданные = Исходящие.ПолучитьЭлементы().Добавить();
	Созданные.Представление		= "Созданные";
	Созданные.Направление		= "Исходящие";
	Созданные.СостояниеОбмена	= Перечисления.CW_DT_СостоянияОбмена.Создан;
	
	Отправленные = Исходящие.ПолучитьЭлементы().Добавить();
	Отправленные.Представление	= "Отправленные";
	Отправленные.Направление	= "Исходящие";
	Отправленные.СостояниеОбмена= Перечисления.CW_DT_СостоянияОбмена.Отправлен;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДерево(Команда)
	ЗаполнитьДеревоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДействийПриАктивизацииСтроки(Элемент)
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат;КонецЕсли; 
	ЭтаФорма["ТранспортныеСообщения"+ТД.Направление].Параметры.УстановитьЗначениеПараметра("СостояниеОбмена",ТД.СостояниеОбмена);
	Если НЕ Элементы.ГруппаНаправленияОбмена.ТекущаяСтраница = Элементы["Группа" + ТД.Направление] Тогда
		Элементы.ГруппаНаправленияОбмена.ТекущаяСтраница = Элементы["Группа" + ТД.Направление];		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСообщенияВходящиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Обработка.CW_DT_ЗагрузкаРасходов.Форма",Новый Структура("ТранспортноеСообщение",ВыбраннаяСтрока),,ВыбраннаяСтрока,,,Новый ОписаниеОповещения("ВходящиеОбновить",ЭтаФорма));СтандартнаяОбработка = Ложь; 		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоПолученных()
	КоличествоПолученных = КоличествоПолученных(Получатель);
	Полученные = ДеревоДействий.НайтиПоИдентификатору(ИдентификаторВетвиПолученные);
	Полученные.Представление = ?(КоличествоПолученных,"Полученные (" + Формат(КоличествоПолученных,"ЧГ=0") + ")","Полученные");
	Полученные.Жирный = КоличествоПолученных;
КонецПроцедуры

&НаСервереБезКонтекста
Функция КоличествоПолученных(Организация)
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_DT_ТранспортноеСообщениеВходящее.Ссылка) КАК Количество
		|ИЗ
		|	Документ.CW_DT_ТранспортноеСообщениеВходящее КАК CW_DT_ТранспортноеСообщениеВходящее
		|ГДЕ
		|	CW_DT_ТранспортноеСообщениеВходящее.СостояниеОбмена = ЗНАЧЕНИЕ(Перечисление.CW_DT_СостоянияОбмена.Получен)
		|	И CW_DT_ТранспортноеСообщениеВходящее.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();Выборка.Следующий();
	Возврат Выборка.Количество
КонецФункции

&НаКлиенте
Процедура ПерейтиВПолученные()
	Элементы.ДеревоДействий.ТекущаяСтрока = ИдентификаторВетвиПолученные;	
КонецПроцедуры
 

&НаСервере
Процедура РучнаяОтправкаНаСервере()
	CW_DT.ОтправкаТранспортныхСообщений();
КонецПроцедуры


&НаКлиенте
Процедура РучнаяОтправка(Команда)
	РучнаяОтправкаНаСервере();
	Элементы.ТранспортныеСообщенияИсходящие.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если НЕ ЗавершениеРаботы Тогда
		СохранитьСеансовуюНастройку();
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьКоличествоПолученных();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "CWDT.МенеджерСообщений.ОбновитьВходящие" Тогда 
		ОбновитьКоличествоПолученных();
		Элементы.ТранспортныеСообщенияВходящие.Обновить();
		ПерейтиВПолученные();		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТранспортныеСообщенияИсходящиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
 