Процедура ВывестиПредупреждение(Текст,ПроцедураОбратногоВызова=Неопределено) Экспорт 
	
	ТекстПредупреждения 	= "";
	ЗаголовокПредупреждения = "";
	
	Если (ТипЗнч(Текст) = Тип("Структура")) Тогда
		
		Текст.Свойство("Текст",		ТекстПредупреждения);
		Текст.Свойство("Заоловок",	ЗаголовокПредупреждения);
		
	Иначе
		ТекстПредупреждения = Текст;
	КонецЕсли; 
	
	ПоказатьПредупреждение(ПроцедураОбратногоВызова,ТекстПредупреждения,,ЗаголовокПредупреждения);
	
КонецПроцедуры

Процедура ВыбратьНоменклатуру(ТекущееЗначение, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт 
	// --- 
	
	Если ЗначениеЗаполнено(ТекущееЗначение) = Ложь Тогда
		
		СтандартнаяОбработка = Ложь;
		// --- 
		ПФ = Новый Структура("ТекущаяСтрока",_УФС.КаталогУслуг());
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПФ,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 	
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыбратьКлиента(ТекущееЗначение, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт 
	// --- 
	
	Если (НЕ ЗначениеЗаполнено(ТекущееЗначение)) Тогда
		
		СтандартнаяОбработка=Ложь;
		// --- 
		ПФ = Новый Структура("ТекущаяСтрока",_УФС.КаталогКлиентов());
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",ПФ,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПоставщика(ТекущееЗначение, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт 
	// --- 
	
	Если (НЕ ЗначениеЗаполнено(ТекущееЗначение)) Тогда
		
		СтандартнаяОбработка=Ложь;
		// --- 
		ПФ = Новый Структура("ТекущаяСтрока",_УФС.КаталогПоставщиков());
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",ПФ,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОткрытьКонтактнуюИнформацию(КИ) Экспорт 
	// --- 
	
	ПараметрыОткрытия = _УФС.ПараметрыОткрытияКонтактнойИнформации(КИ);
	Если (ПараметрыОткрытия <> Неопределено) Тогда
		
		Действие = ПараметрыОткрытия.Действие;
		// --- 
		Если (Действие = "ЗапуститьПриложение") Тогда
			
			ЗапуститьПриложение(ПараметрыОткрытия.СтрокаКоманды,,Ложь);
			
		ИначеЕсли (Действие = "ОткрытьФорму") Тогда 
			
			ОткрытьФорму(ПараметрыОткрытия.ИмяФормы,ПараметрыОткрытия.ПараметрыФормы);
			
		ИначеЕсли (Действие = "ПоказатьСообщение") Тогда 
			
			ВывестиПредупреждение(ПараметрыОткрытия.ТекстСообщения);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры


Процедура ОткрытьСписокФайловОбъекта(ЭтаФорма, ОбъектАрхива) Экспорт
	
	ПараметрыФормы = Новый Структура("ОбъектАрхива", ОбъектАрхива);
	ОткрытьФорму("Справочник.CW_ОбъектыАрхива.Форма.ФайлыОбъекта", ПараметрыФормы, ЭтаФорма, Истина,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры    

#Область СохранениепользователскихНастроек

Функция ПолучитьКлючьОбъектаПоИмениИсточника(Источник) Экспорт
	
	ИмяФормы 	= Источник.ИмяФормы;
	
	мДанныеФормы = СтрРазделить(ИмяФормы,".");
	Если мДанныеФормы.Количество() > 0 Тогда
		ТипОъекта = мДанныеФормы[0];	
	КонецЕсли;
	Если мДанныеФормы.Количество() > 1 Тогда
		ИмяОбъекта = мДанныеФормы[1];	
	КонецЕсли;

	ТипОъекта  = ?(ЗначениеЗаполнено(ТипОъекта)	 , СокрЛП(ТипОъекта), "ВнешнийОбъект");
	ИмяОбъекта = ?(ЗначениеЗаполнено(ИмяОбъекта) , СокрЛП(ИмяОбъекта), ИмяФормы);
	
	Возврат ТипОъекта+"."+СокрЛП(ИмяОбъекта);

КонецФункции
	

#КонецОбласти

//Наличие прикрепленных файлов
Процедура АдресКартинкиФайловНажати(Форма, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка  = Ложь;     
	
	Если Форма.Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Перед добавлением файлов необходимо записать объект");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ОбъектАрхива", Форма.Объект.Ссылка);
	ОткрытьФорму("Справочник.CW_ОбъектыАрхива.Форма.ФайлыОбъекта", ПараметрыФормы, Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура АдресКартинкиФайловПеретаскивание(Форма, ПараметрыПеретаскивания, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если Форма.Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Перед добавлением файлов необходимо записать объект");
		Возврат;
	КонецЕсли;

	ПомещаемыеФайлы = Новый Массив;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		Для Каждого ПомещаемыйФайл из ПараметрыПеретаскивания.Значение Цикл
			ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ПомещаемыйФайл.Файл.ПолноеИмя));
		КонецЦикла;
	Иначе
		ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ПараметрыПеретаскивания.Значение.Файл.ПолноеИмя));
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма",		Форма);
	ДополнительныеПараметры.Вставить("ОбъектАрхива",Форма.Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПомещенияФайла", ЭтотОбъект, ДополнительныеПараметры); 
	НачатьПомещениеФайлов(ОписаниеОповещения, ПомещаемыеФайлы, Ложь, Форма.УникальныйИдентификатор);
	
КонецПроцедуры

Процедура ОбработкаПомещенияФайла(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт 
	
	ЗапрашиватьТипФайлаПриДобавленииВАрхив = _УФС.ЗапрашиватьТипФайлаПриДобавленииВАрхив();
	
	ПараметрыВыбора = новый Структура;
	ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);
	
	ДополнительныеПараметры.Вставить("ПомещенныеФайлы", ПомещенныеФайлы);
	ДополнительныеПараметры.Вставить("ЗапрашиватьТипФайлаПриДобавленииВАрхив", ЗапрашиватьТипФайлаПриДобавленииВАрхив);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПомещениеФалов", ЭтотОбъект, ДополнительныеПараметры);
	
	Если ЗапрашиватьТипФайлаПриДобавленииВАрхив Тогда
		ОткрытьФорму("Справочник.CW_ТипыДокументовФайловогоАрхива.ФормаВыбора",ПараметрыВыбора,ДополнительныеПараметры.Форма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения,Неопределено);
	КонецЕсли;

КонецПроцедуры

Процедура ПродолжитьПомещениеФалов(РезультатВыбора, ДополнительныеПараметры)Экспорт
	
	Если РезультатВыбора <> Неопределено 
		Или НЕ ДополнительныеПараметры.ЗапрашиватьТипФайлаПриДобавленииВАрхив Тогда
		
		_УФС.ПрикрепитьФайлы(ДополнительныеПараметры.ОбъектАрхива, ДополнительныеПараметры.ПомещенныеФайлы, РезультатВыбора);
		_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ДополнительныеПараметры.Форма);
		
		//Только в этом случае обновляется строка в списке журнала 
		ДополнительныеПараметры.Форма.ОповеститьОЗаписиНового(ДополнительныеПараметры.Форма.Объект.Ссылка);
		
	Иначе
		
		ПоказатьПредупреждение(,"Не выбран тип документа. Добавление файла отменено!");
		
	Конецесли;
	
КонецПроцедуры
//Наличие прикрепленных файлов
