
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ЭтоАкт(ПараметрКоманды) Тогда
		ВызватьИсключение "Вызов отчета предусмотрен исключительно для актов!";
	КонецЕсли;

	
	Отбор = ПолучитьСтруктуруОтбора(ПараметрКоманды);
	
	мГруппировки 	= ПолучитьГруппировкиОтчета(ТипЗнч(ПараметрКоманды));
	мПоказатели		= ПолучитьПоказателиОтчета(ТипЗнч(ПараметрКоманды));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВнешнийВызов", 	Истина);
	
	Если Отбор.Количество() > 0 Тогда
		ПараметрыФормы.Вставить("ДанныеОтбора", 	Отбор);
	КонецЕсли;

	ПараметрыФормы.Вставить("Группировки", 		мГруппировки);
	ПараметрыФормы.Вставить("Показатели", 		мПоказатели);
	ПараметрыФормы.Вставить("НачалоПериода", 	Дата(1,1,1));
	ПараметрыФормы.Вставить("КонецПериода", 	Дата(1,1,1));
	
	ОткрытьФорму("Отчет.CW_ВедомостьНезавершенногоПроизводства.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры  

&НаСервере
Функция ЭтоАкт(ПараметрКоманды)

	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		Возврат ПараметрКоманды.ПредъявленАкт;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруОтбора(ПараметрКоманды)

	Отбор = новый Структура;
	
	//ДокументСсылка.CW_РасходыПоГрузоперевозке, ДокументСсылка.CW_СписаниеЗатратНаРеализацию
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_СписаниеЗатратНаРеализацию") Тогда
		
		Отбор.Вставить("Организация",					ПараметрКоманды.Организация);
		Отбор.Вставить("ПодразделениеОрганизации",		ПараметрКоманды.ПодразделениеОрганизации);
		Отбор.Вставить("Покупатель",					ПараметрКоманды.ДокументОснование.Контрагент);
		Отбор.Вставить("ДоговорПокупателя",				ПараметрКоманды.ДокументОснование.Договор);
		
		Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям") и ЗначениеЗаполнено(ПараметрКоманды.ДокументОснование.ПриложениеКДоговору) Тогда
			Отбор.Вставить("ПриложениеКДоговоруПокупателя",	ПараметрКоманды.ДокументОснование.ПриложениеКДоговору);
		КонецЕсли;
		
		ТаблицаЗатрат = ПараметрКоманды.Затраты.Выгрузить(); 
		
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "Грузоперевозка", 		ПредопределенноеЗначение("Справочник.CW_Грузоперевозки.ПустаяСсылка"));
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "Контрагент", 			ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "Договор", 				ПредопределенноеЗначение("Справочник.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка"));
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "ПриложениеКДоговору", 	ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка"));
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "Номенклатура", 			ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "СтатьяЗатрат", 			ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка"));
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "Подразделение", 			ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка"));
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "Валюта", 				ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
		
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "ДокументРасходов", 		ПредопределенноеЗначение("Документ.CW_РасходыПоГрузоперевозке.ПустаяСсылка"));
		
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "ПорядокОтражения", 		ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПустаяСсылка"));
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "СтавкаНДС", 				ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка"));
		ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, "СпособУчетаНДС", 		ПредопределенноеЗначение("Перечисление.СпособыУчетаНДС.ПустаяСсылка"));
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		Отбор.Вставить("ДокументРасходов",	ПараметрКоманды);
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		
		Отбор.Вставить("Грузоперевозка",	ПараметрКоманды);

	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Заказы") Тогда
		
		МассивГрузоперевозок = Справочники.CW_Заказы.ПолучитьМассивГрузоперевозокЗаказа(ПараметрКоманды);  
		
		СписокЗначений = новый СписокЗначений;
		СписокЗначений.ЗагрузитьЗначения(МассивГрузоперевозок);

		Отбор.Вставить("Грузоперевозка", СписокЗначений);
		
	КонецЕсли;
	
	Возврат Отбор;
	
КонецФункции

&НаСервере
Процедура ДобавитьОтборВСтруктуру(Отбор, ТаблицаЗатрат, ИмяПоля, ПустаяСылка)
	
	Массив = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Массив, ТаблицаЗатрат.ВыгрузитьКолонку(ИмяПоля), Истина);
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(Массив, ПустаяСылка);
	Если Массив.Количество() > 0 тогда
		СписокЗначений = новый СписокЗначений;
		СписокЗначений.ЗагрузитьЗначения(Массив);
		Отбор.Вставить(ИмяПоля,СписокЗначений);
	КонецЕсли;

КонецПроцедуры
	
&НаСервере
Функция ПолучитьГруппировкиОтчета(ТипПараметра)
	
	МассивГруппировок = Новый Массив;
	
	Если ТипПараметра = Тип("ДокументСсылка.CW_СписаниеЗатратНаРеализацию") Тогда
		МассивГруппировок.Добавить("Валюта");
		МассивГруппировок.Добавить("Контрагент");
		МассивГруппировок.Добавить("ДокументРасходов");
		МассивГруппировок.Добавить("Номенклатура");
	ИначеЕсли ТипПараметра = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		МассивГруппировок.Добавить("Контрагент");
		МассивГруппировок.Добавить("ДокументРасходов");
		МассивГруппировок.Добавить("Номенклатура");
		МассивГруппировок.Добавить("Грузоперевозка");
	ИначеЕсли ТипПараметра = Тип("СправочникСсылка.CW_Грузоперевозки") 
		или  ТипПараметра = Тип("СправочникСсылка.CW_Заказы") Тогда
		МассивГруппировок.Добавить("Грузоперевозка");
	КонецЕсли;
	
	Возврат МассивГруппировок;
	
КонецФункции

&НаСервере
Функция ПолучитьПоказателиОтчета(ТипПараметра)
	
	мПоказатели = новый Массив;
	Если ТипПараметра = Тип("ДокументСсылка.CW_СписаниеЗатратНаРеализацию") Тогда
		
		мПоказатели.Добавить("Всего"); 
		
	Иначе
		
		мПоказатели.Добавить("Количество"); 
		мПоказатели.Добавить("Сумма"); 
		мПоказатели.Добавить("НДС"); 
		мПоказатели.Добавить("Всего"); 
		мПоказатели.Добавить("СуммаВал"); 
		мПоказатели.Добавить("НДСВал"); 
		мПоказатели.Добавить("ВсегоВал"); 
		
	КонецЕсли;
	
	Возврат мПоказатели;
	
КонецФункции