
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Параметр",				Параметр);
	Параметры.Свойство("Значение",				Значение);
	Параметры.Свойство("ЭтоКонтрольнаяДата", 	ЭтоКонтрольнаяДата);
	
	Параметры.Свойство("ЗначениеПлан",	ЗначениеПланДата);
	Параметры.Свойство("ЗначениеПлан",	ЗначениеПланВремя);
	Параметры.Свойство("ЗначениеФакт",	ЗначениеФактДата);
	Параметры.Свойство("ЗначениеФакт",	ЗначениеФактВремя);
	Параметры.Свойство("Примечание",		Примечание);
	
	Параметры.Свойство("ПоказатьВремя",		 ПоказатьВремя);

	Элементы.ГруппаЗначение.Видимость 			= Не ЭтоКонтрольнаяДата;
	Элементы.ГруппаКонтрольнаяДата.Видимость 	= ЭтоКонтрольнаяДата;
	
	Элементы.ЗначениеФактВремя.Видимость = ПоказатьВремя и ЭтоКонтрольнаяДата;
	Элементы.ЗначениеПланВремя.Видимость = ПоказатьВремя и ЭтоКонтрольнаяДата;
	
	ЭтаФорма.Заголовок = Строка(Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)    
	
	ПараметрыЗакрытия = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
	ПараметрыЗакрытия.Параметр		= Параметр;
	ПараметрыЗакрытия.Примечание	= Примечание;
	
	ТекущееЗначение = Значение;
	Если ЭтоКонтрольнаяДата Тогда
		
		СтрокаДата 	 = Формат(ЗначениеПланДата,"ДФ=yyyyMMdd");
		СтрокаВремя  = Формат(ЗначениеПланВремя,"ДФ=HHmm");
		Если ПустаяСтрока(СтрокаДата) Тогда
			ЗначениеПлан = Дата(1,1,1);
		Иначе
			ЗначениеПлан = Дата(СтрокаДата+СтрокаВремя);
		КонецЕсли;
		ПараметрыЗакрытия.ЗначениеПлан = ЗначениеПлан;
		
		СтрокаДата 	 = Формат(ЗначениеФактДата,"ДФ=yyyyMMdd");
		СтрокаВремя  = Формат(ЗначениеФактВремя,"ДФ=HHmm");
		
		Если ПустаяСтрока(СтрокаДата) Тогда
			ЗначениеФакт = Дата(1,1,1);
		Иначе
			ЗначениеФакт = Дата(СтрокаДата+СтрокаВремя);
		КонецЕсли;
		ПараметрыЗакрытия.ЗначениеФакт = ЗначениеФакт;
		
		ТекущееЗначение = ?(ЗначениеЗаполнено(ЗначениеФакт), ЗначениеФакт, ЗначениеПлан);
	КонецЕсли;
	
	ПараметрыЗакрытия.Значение = ТекущееЗначение;

	ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиДату(Команда)
	
	ЗначениеФактДата 	= ЗначениеПланДата;
	ЗначениеФактВремя 	= ЗначениеПланВремя;
	
КонецПроцедуры
