
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	Элементы.ПриложениеКДоговору.Видимость = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;

КонецПроцедуры
