
Процедура ДополнительныеХарактеристикиПриИзменении(Форма) Экспорт
	
	Форма.ЗаписатьПараметрыВРегистр = Истина;
	
КонецПроцедуры

Процедура ПараметрНачалоВыбора(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ЭтоГруппа", 				Ложь);
	СтруктураОтбора.Вставить("ДинамическийПараметр", 	Ложь);
	СтруктураОтбора.Вставить("ЭтоКонтрольнаяДата", 		Ложь);
	СтруктураОтбора.Вставить("ПометкаУдаления", 		Ложь);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", СтруктураПараметров, Элемент);
	
КонецПроцедуры

Процедура ПередНачаломДобавления(Отказ, Копирование) Экспорт
	
	Если Копирование Тогда
		Отказ = истина;
		ПоказатьПредупреждение(, "Копирование строк не допускается!");
	КонецЕсли;
	
КонецПроцедуры