
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВыгрузкуСведенийОДоходах", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ДоходыНерезидентовВыгрузка",, ПараметрыВыполненияКоманды.Источник,,,,ОписаниеОповещения); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ПродолжитьВыгрузкуСведенийОДоходах(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	
	РезультатВыполнения =  НачатьВыгрузкуСведенийОДоходахВФоне(РезультатВыбора);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ПараметрыВыполненияКоманды.Источник);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьВыгрузкуСведенийОДоходах", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры  

&НаСервере
Функция НачатьВыгрузкуСведенийОДоходахВФоне(ПарамтерыПроцеудры) 
	
	СведенияОДоходах = новый Массив;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыНерезидентовСведенияОДоходах.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ДоходыНерезидентовСведенияОДоходах КАК CW_ДоходыНерезидентовСведенияОДоходах
	               |ГДЕ
	               |	CW_ДоходыНерезидентовСведенияОДоходах.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ДоходыНерезидентовСведенияОДоходах.Организация = &Организация
	               |	И CW_ДоходыНерезидентовСведенияОДоходах.Приказ = &Приказ
	               |	И CW_ДоходыНерезидентовСведенияОДоходах.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";   
	
	ДатаОкончания = ?(ПарамтерыПроцеудры.ДатаОкончания = Дата(1,1,1), Дата(2999,12,31), ПарамтерыПроцеудры.ДатаОкончания);
	
	Запрос.УстановитьПараметр("Организация", 		ПарамтерыПроцеудры.Организация);
	Запрос.УстановитьПараметр("Приказ",				ПарамтерыПроцеудры.Приказ);
	Запрос.УстановитьПараметр("ДатаНачала", 		ПарамтерыПроцеудры.ДатаНачала);  
	Запрос.УстановитьПараметр("ДатаОкончания", 		ДатаОкончания);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаписи = РезультатЗапроса.Выбрать();
	пока ВыборкаЗаписи.Следующий() Цикл
		СведенияОДоходах.Добавить(ВыборкаЗаписи.Ссылка);
	КонецЦикла;  
	
	ПарамтерыПроцеудры.Вставить("СведенияОДоходах", СведенияОДоходах); 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Выгрузка сведений о доходах";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ДоходыНерезидентовДополнительный.ЗаполнитьРегламентированныйОтчет", ПарамтерыПроцеудры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыгрузкуСведенийОДоходах(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда      
		
		РегламентированныйОтчет = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		Если РегламентированныйОтчет = Неопределено Тогда
			ПоказатьПредупреждение(, "Сервис ""Доходы нерезидентов"" не доступен!");
			Возврат;
		КонецЕсли;    
	
		ПоказатьЗначение(, РегламентированныйОтчет);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось заполнить регламентированный отчет!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка заполнения регламентированного отчета");
	КонецЕсли;
	
КонецПроцедуры



