#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПараметрыДанных.Видимость = Ложь;
	Элементы.ВыпискаИзФайлаСРасширением.Видимость = Истина;
	Элементы.ВыпискаИзФайлаБезРасширения.Видимость = Ложь;
	
	ЭтоВебКлиент = ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент();
	РасширениеРаботыСФайламиПодключено = Не ЭтоВебКлиент;
	
	Организация       = Параметры.Организация;
	ДатаНачала        = Параметры.ДатаНачала;
	ДатаОкончания     = Параметры.ДатаОкончания;
	УИДВладельцаФормы = Параметры.УИДВладельцаФормы;
	ЭтоЦифровойСчет   = Ложь;
	
	Если Параметры.Свойство("БанковскийСчет") Тогда
		Если ЗначениеЗаполнено(Параметры.БанковскийСчет) Тогда
			Элементы.ПараметрыДанных.Видимость = Истина;
			ШаблонЗаголовка = НСтр("ru = '%1 %2 %3с %4 по %5.'");
			Элементы.ПараметрыДанных.Заголовок = СтрШаблон(
				ШаблонЗаголовка, Элементы.ПараметрыДанных.Заголовок,
				Параметры.БанковскийСчет.Наименование,
				Символы.ПС,
				Формат(ДатаНачала, "ДФ=dd.MM.yyyy"),
				Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"));
			БанковскийСчет = Параметры.БанковскийСчет;
			ЭтоЦифровойСчет = Справочники.БанковскиеСчета.ЭтоЦифровойСчет(БанковскийСчет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ШаблонФильтра                        = НСтр("ru = 'Текстовый файл (*.txt)|*.txt|Файл xml (*.xml)|*.xml'");
	ДиалогВыбора.Фильтр                  = ШаблонФильтра;
	ДиалогВыбора.Заголовок               = НСтр("ru = 'Выберите файл для загрузки выписки из банка'");
	ДиалогВыбора.ПредварительныйПросмотр = Ложь;
	ДиалогВыбора.Расширение              = "txt";
	ДиалогВыбора.МножественныйВыбор      = Ложь;
	
	Попытка
		Оповещение = Новый ОписаниеОповещения("ВыборФайлаДляВыгрузкиЗавершение", ЭтотОбъект);
		ДиалогВыбора.Показать(Оповещение);
	Исключение
		ПодключитьОбработчикОжидания("Подключаемый_ПодключитьРасширениеРаботыСФайламиИПрочитатьФайл", 0.1, Истина);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Кодировка = Неопределено;
	
	Если ЭтоЦифровойСчет Тогда
		ОбменСБанкомКлиент.ЗагрузитьВыбранныйФайл(ПолноеИмяФайла, ЭтотОбъект, Кодировка, "ЦифровойСчет");
	Иначе
		ОбменСБанкомКлиент.ЗагрузитьВыбранныйФайл(ПолноеИмяФайла, ЭтотОбъект, Кодировка, "Универсальная");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьИПрочитатьФайлФайл(Команда)
	
	ОбновитьВыпискуЧерезФайл();
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеОбработчики

&НаКлиенте
Процедура Подключаемый_ПодключитьРасширениеРаботыСФайламиИПрочитатьФайл() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрочитатьФайлЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботы1СПредприятия(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПрочитатьФайлВыпискиНаКлиенте(ОписаниеФайла, Кодировка = Неопределено, РежимЗагрузки = "") Экспорт
	
	ДлительнаяОперация = ЗагрузитьБанковскуюВыпискуНаСервере(ОписаниеФайла, Кодировка, РежимЗагрузки);
	
	Если ДлительнаяОперация.Свойство("ОшибкаВДанных") Тогда
		Если ДлительнаяОперация.ОшибкаВДанных = "НетДанныПоОстаткам" Тогда
			ПоказатьПредупреждение(,
				НСтр("ru = 'Не удалось записать данные из файла. В выписке нет данных по остаткам'"));
		ИначеЕсли ДлительнаяОперация.ОшибкаВДанных = "ОшибкаЗагрузкиПоСчету" Тогда
			ПоказатьПредупреждение(,
				НСтр("ru = 'Не удалось записать данные из файла. Выбранный счет не найден в файле'"));
		ИначеЕсли ДлительнаяОперация.ОшибкаВДанных = "ОшибкаЗагрузкиПоНачальнойДате" Тогда
			ПоказатьПредупреждение(,
				НСтр("ru = 'Не удалось записать данные из файла. Начальная дата не совпадает с датой начала из файла'"));
		ИначеЕсли ДлительнаяОперация.ОшибкаВДанных = "ВыпискаНеРаспознана" Тогда
			ПоказатьПредупреждение(,
				НСтр("ru = 'Не удалось записать данные из файла. Выписка не распознана'"));
		КонецЕсли;
	Иначе
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ТекстСообщения = НСтр("ru = 'Загрузка выписки из банка'");
		Обработчик = Новый ОписаниеОповещения("ПослеЗагрузкиБанковскойВыпискиВФоне", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиБанковскойВыпискиВФоне(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда // задание было отменено
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		РезультатЗагрузки = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ЗакрытьФорму", ЭтотОбъект),
			НСтр("ru = 'Заполнены служебные регистры данными из выписки. Отчет будет переформирован'"));
	ИначеЕсли ДлительнаяОперация.Статус = "Ошибка" Тогда
		СообщитьОбОшибкеДлительнойОперации(ДлительнаяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОшибкеДлительнойОперации(ДлительнаяОперация)
	
	ШаблонСообщения = НСтр("ru = 'При выполнении операции произошла ошибка:
							|%1
							|Подробности в журнале регистрации.'");
	Если ЗначениеЗаполнено(ДлительнаяОперация.КраткоеПредставлениеОшибки) Тогда
		СообщениеОбОшибке = СтрШаблон(ШаблонСообщения, ДлительнаяОперация.КраткоеПредставлениеОшибки);
	Иначе
		СообщениеОбОшибке = СтрШаблон(ШаблонСообщения, ДлительнаяОперация.ПодробноеПредставлениеОшибки);
	КонецЕсли;
	
	ПоказатьПредупреждение(, СообщениеОбОшибке);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВыпискуНаСоответствиеОтбораПоСчету(Выписки)
	
	Если Выписки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивСчетов         = Новый Массив;
	РаспознанныеВыписки  = Выписки.РаспознанныеВыписки;
	ТаблицаДанныхИзБанка = Выписки.Выписки;
	
	Для каждого РаспознаннаяВыписка Из РаспознанныеВыписки Цикл
		ВладелецСчета = РаспознаннаяВыписка.Значение.ВладелецСчета;
		МассивСчетов.Добавить(ВладелецСчета.БанковскийСчет);
	КонецЦикла;
	
	Для каждого ДанныеИзБанка Из ТаблицаДанныхИзБанка Цикл
		ДатаНачалаИзВыписки = ДанныеИзБанка.Значение.НачалоПериода;
		ТаблицаОстатков = ДанныеИзБанка.Значение.Сальдо;
	КонецЦикла;
	
	НайденныйБанковскийСчет = МассивСчетов.Найти(БанковскийСчет);
	
	Если НайденныйБанковскийСчет = Неопределено Тогда
		Возврат "ОшибкаЗагрузкиПоСчету";
	ИначеЕсли ТаблицаОстатков.Количество() = 0 Тогда
		Возврат "НетДанныПоОстаткам";
	ИначеЕсли ДатаНачалаИзВыписки > ДатаНачала Тогда
		Возврат "ОшибкаЗагрузкиПоНачальнойДате";
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму(Результат) Экспорт
	
	ЭтотОбъект.Закрыть();
	Оповестить("СверкаБанковскойВыписки_ПереформироватьОтчет", УИДВладельцаФормы);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьБанковскуюВыпискуНаСервере(ОписаниеФайла, Кодировка, РежимЗагрузки)
	
	СтруктураПараметров = Новый Структура;
	
	Если РасширениеРаботыСФайламиПодключено
		И ТипЗнч(ОписаниеФайла) = Тип("ОписаниеПереданногоФайла")
		И ЗначениеЗаполнено(ОписаниеФайла.ПолноеИмя) Тогда
		СтруктураПараметров.Вставить("ФайлЗагрузки", ОписаниеФайла.ПолноеИмя);
	Иначе
		СтруктураПараметров.Вставить("ФайлЗагрузки", ОписаниеФайла.Имя);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("АдресХранилищаРаспознанныеДанныеИзБанка",
		ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));
	СтруктураПараметров.Вставить("Кодировка", ?(РежимЗагрузки = "ЦифровойСчет", "UTF-8", Кодировка));
	СтруктураПараметров.Вставить("РежимЗагрузки", РежимЗагрузки);
	Если Не ПустаяСтрока(ОписаниеФайла.Хранение) Тогда
		СтруктураПараметров.Вставить("ДвоичныеДанные", ПолучитьИзВременногоХранилища(ОписаниеФайла.Хранение));
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ДвоичныеДанные") Тогда
		ИмяФайла = ПолучитьИмяВременногоФайла();
		СтруктураПараметров.ДвоичныеДанные.Записать(ИмяФайла);
	КонецЕсли;
	
	СведенияОВладельцеБанковскогоСчетаИзКонтекста = Новый Структура;
	СведенияОВладельцеБанковскогоСчетаИзКонтекста.Вставить("Организация",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация));
	СведенияОВладельцеБанковскогоСчетаИзКонтекста.Вставить("БанковскийСчетОрганизации",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(БанковскийСчет));
	Настройки = Новый Структура("Кодировка", Кодировка);
	Если РежимЗагрузки = "ЦифровойСчет" Тогда
		Выписки = ЗагрузкаВыпискиПоБанковскомуСчету.РаспознанныеДанныеИзБанкаЦР(
			ИмяФайла, Настройки, СведенияОВладельцеБанковскогоСчетаИзКонтекста);
	Иначе
		Выписки = ЗагрузкаВыпискиПоБанковскомуСчету.РаспознанныеДанныеИзБанка(
			ИмяФайла, Настройки, СведенияОВладельцеБанковскогоСчетаИзКонтекста);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ОшибкаВДанных", ПроверитьВыпискуНаСоответствиеОтбораПоСчету(Выписки));
	
	Если СтруктураПараметров.ОшибкаВДанных = "НетДанныПоОстаткам" Тогда
		СтруктураПараметров.Вставить("ОшибкаВДанных", "НетДанныПоОстаткам");
		Возврат СтруктураПараметров;
	ИначеЕсли СтруктураПараметров.ОшибкаВДанных = "ОшибкаЗагрузкиПоСчету" Тогда
		СтруктураПараметров.Вставить("ОшибкаВДанных", "ОшибкаЗагрузкиПоСчету");
		Возврат СтруктураПараметров;
	ИначеЕсли СтруктураПараметров.ОшибкаВДанных = "ОшибкаЗагрузкиПоНачальнойДате" Тогда
		СтруктураПараметров.Вставить("ОшибкаВДанных", "ОшибкаЗагрузкиПоНачальнойДате");
		Возврат СтруктураПараметров;
	ИначеЕсли СтруктураПараметров.ОшибкаВДанных = Неопределено Тогда
		СтруктураПараметров.Вставить("ОшибкаВДанных", "ВыпискаНеРаспознана");
		Возврат СтруктураПараметров;
	КонецЕсли;
	
	РезультатЗагрузки = ЗаписатьДанныеВРегистры(Выписки);
	
	Возврат РезультатЗагрузки;
	
КонецФункции

&НаСервере
Функция ЗаписатьДанныеВРегистры(Выписки)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РаспознанныеДанныеИзБанка", Выписки);
	СтруктураПараметров.Вставить("ИсточникЗагрузки", Перечисления.ИсточникиЗагрузкиБанковскихВыписок.Файл);
	СтруктураПараметров.Вставить("ОтключитьПроверкуЗапретаРедактирования", Истина);
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Запись в регистры банковских выписок");
	НастройкиЗапуска.ЗапуститьВФоне = Истина;
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.КлиентБанк.ФоноваяЗаписьВРегистрыБанковскихВыписок",
		СтруктураПараметров,
		НастройкиЗапуска);
		
	Возврат Результат
	
КонецФункции

&НаКлиенте
Процедура ВыборФайлаДляВыгрузкиЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		
		ПолноеИмяФайла = ВыбранныеФайлы.Получить(0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлЗавершение(ПодключеноРасширениеРаботыСФайлами, ДополнительныеПараметры) Экспорт
	
	РасширениеРаботыСФайламиПодключено = ПодключеноРасширениеРаботыСФайлами;
	ЗагрузкаУстановитьВидимостьЭлементовВыбораФайлов(ЭтотОбъект);
	Если РасширениеРаботыСФайламиПодключено И Не ЭтоВебКлиент Тогда
		Если Не ПустаяСтрока(ПолноеИмяФайла) Тогда
			РежимЗагрузки = "";
			Если ЭтоЦифровойСчет Тогда
				РежимЗагрузки = "ЦифровойСчет";
			ИначеЕсли Не ЗначениеЗаполнено(БанковскийСчет) И ЗначениеЗаполнено(Организация) Тогда
				РежимЗагрузки = "Универсальная";
			КонецЕсли;
			ОбменСБанкомКлиент.ЗагрузитьВыбранныйФайл(ПолноеИмяФайла, ЭтотОбъект, Неопределено, РежимЗагрузки);
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗагрузкаУстановитьВидимостьЭлементовВыбораФайлов(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ВыпискаИзФайлаСРасширением.Видимость = Форма.РасширениеРаботыСФайламиПодключено;
	Элементы.ВыпискаИзФайлаБезРасширения.Видимость = НЕ Форма.РасширениеРаботыСФайламиПодключено;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбновитьВыпискуЧерезФайл()
	
	РежимЗагрузки = "";
	Если ЭтоЦифровойСчет Тогда
		РежимЗагрузки = "ЦифровойСчет";
	ИначеЕсли Не ЗначениеЗаполнено(БанковскийСчет) И ЗначениеЗаполнено(Организация) Тогда
		РежимЗагрузки = "Универсальная";
	КонецЕсли;
	
	Если РасширениеРаботыСФайламиПодключено Тогда
		Попытка
			РасширениеРаботыСФайламиПодключено = Ждать ПодключитьРасширениеРаботыСФайламиАсинх();
		Исключение
			РасширениеРаботыСФайламиПодключено = Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если РасширениеРаботыСФайламиПодключено И ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		// Файл определен - можно начинаем чтение
		ОбменСБанкомКлиент.ЗагрузитьВыбранныйФайл(
			ПолноеИмяФайла, ЭтотОбъект, Неопределено, РежимЗагрузки);
	Иначе
		// Файл не определен - запросим файл у пользователя
		Если РежимЗагрузки = "" Тогда
			ОбменСБанкомКлиент.ВыбратьИЗагрузитьФайл(ЭтотОбъект, Неопределено);
		Иначе
			ОбменСБанкомКлиент.ВыбратьИЗагрузитьФайл(ЭтотОбъект,, РежимЗагрузки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

