#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ЕстьЗаписиПоИзмерению(ВидДоговора, ИмяИзмерения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_НастройкаЗависмыхУслуг."+ИмяИзмерения+" КАК ИмяИзмерения
	               |ИЗ
	               |	РегистрСведений.CW_НастройкаЗависмыхУслуг КАК CW_НастройкаЗависмыхУслуг
	               |ГДЕ
	               |	CW_НастройкаЗависмыхУслуг.Договор.ВидДоговора = &ВидДоговора";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура УдадитьЗаписиРегистра(ВидДоговора, ИмяПоля) Экспорт
	
	Если ИмяПоля = "Клиент" Тогда
		ИмяСправочника = "Контрагенты";
	ИначеЕсли ИмяПоля = "Груз" Тогда
		ИмяСправочника = "CW_Грузы";
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НастройкаЗависмыхУслуг.Договор КАК Договор,
	               |	CW_НастройкаЗависмыхУслуг.УслугаДокумента КАК УслугаДокумента,
	               |	CW_НастройкаЗависмыхУслуг.Клиент КАК Клиент,
	               |	CW_НастройкаЗависмыхУслуг.Груз КАК Груз,
	               |	CW_НастройкаЗависмыхУслуг.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.CW_НастройкаЗависмыхУслуг КАК CW_НастройкаЗависмыхУслуг
	               |ГДЕ
	               |	CW_НастройкаЗависмыхУслуг.Договор.ВидДоговора = &ВидДоговора
	               |	И CW_НастройкаЗависмыхУслуг."+ИмяПоля+" <> ЗНАЧЕНИЕ(Справочник."+ИмяСправочника+".ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.CW_НастройкаЗависмыхУслуг.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры
#КонецЕсли