#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьЗначенияПреопределенныхЭлементов() Экспорт
	
	МакетСтандартнаяНастройка = ПолучитьМакет("СтандартнаяНастройка");
	
	//Имя	Наименование	Вид ТС	НаличиеКузова	НаличиеРефрижиратора
	// 1	3				4		5				6
	
	Для Стр = 2 по МакетСтандартнаяНастройка.ВысотаТаблицы Цикл
		
		ИмяЭлемента				= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C1").Текст);
		НаименованиеЭлемента	= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C3").Текст);
		ВидТС					= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C4").Текст);
		НаличиеКузова			= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C5").Текст);
		НаличиеРефрижиратора	= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C6").Текст);
		
		Попытка
			СпрОбъект 									= Справочники.CW_ТипыТранспортныхСредств[ИмяЭлемента].ПолучитьОбъект();
			СпрОбъект.Наименование 						= НаименованиеЭлемента;
			СпрОбъект.ВидТС 							= Перечисления.CW_ВидыТС[ВидТС];
			СпрОбъект.НаличиеКузоваИлиЦистерны 			= Вычислить(НаличиеКузова);
			СпрОбъект.НаличиеРефрижираторнойУстановки 	= Вычислить(НаличиеРефрижиратора);
				
			СпрОбъект.Записать();
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
