&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборДинамическогоСписка();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьОтборДинамическогоСписка();

КонецПроцедуры

&НаСервере
Процедура УстановитьКакОсновнойНаСервере()
	
	Объект.ОсновнойВариантПредставления = Элементы.ГруппыУслугПодробно.ТекущаяСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКакОсновной(Команда)
	УстановитьКакОсновнойНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСписка()
	
	ВариантыПредставленияУслуг.Отбор.Элементы.Очистить();
	
	Отбор					= ВариантыПредставленияУслуг.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Владелец");
	Отбор.ПравоеЗначение	= Объект.Ссылка;
	Отбор.Использование		= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыУслугПодробноПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Необходимо записать элемент!");
		Отказ = истина;
	КонецЕсли;
	
КонецПроцедуры



