
Процедура НайтиСсылкиПоМассиву(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ВсеСсылки = НайтиПоСсылкам(ПараметрыПроцедуры.МассивСсылок);   
	ВсеСсылки.Колонки.Вставить(0,"ИндексКартинки", Новый ОписаниеТипов("Число"));
	
	Для Каждого СтрокаТаблицы из ВсеСсылки Цикл
		
		Если Метаданные.Справочники.Найти(СтрокаТаблицы.Метаданные.Имя) <> Неопределено Тогда
			
			ИндексКартинки = 3;
			
			Если СтрокаТаблицы.Данные.ПометкаУдаления Тогда
				ИндексКартинки = ИндексКартинки+1;
			КонецЕсли;
			
			СтрокаТаблицы.ИндексКартинки = ИндексКартинки;
			
		ИначеЕсли Метаданные.ПланыВидовХарактеристик.Найти(СтрокаТаблицы.Метаданные.Имя) <> Неопределено Тогда
			
			ИндексКартинки = 17;
			
			Если СтрокаТаблицы.Данные.ПометкаУдаления Тогда
				ИндексКартинки = ИндексКартинки+1;
			КонецЕсли;
			
			СтрокаТаблицы.ИндексКартинки = ИндексКартинки;
			
			
		ИначеЕсли Метаданные.Документы.Найти(СтрокаТаблицы.Метаданные.Имя) <> Неопределено  Тогда  
			
			ИндексКартинки = 12;
			
			Если СтрокаТаблицы.Данные.ПометкаУдаления Тогда
				ИндексКартинки = ИндексКартинки+1;
			ИначеЕсли СтрокаТаблицы.Данные.Проведен Тогда
				ИндексКартинки = ИндексКартинки+2; 
			КонецЕсли;
			
			СтрокаТаблицы.ИндексКартинки = ИндексКартинки;
			
		ИначеЕсли Метаданные.РегистрыСведений.Найти(СтрокаТаблицы.Метаданные.Имя) <> Неопределено  Тогда  
			СтрокаТаблицы.ИндексКартинки = 26; 
		Иначе
			СтрокаТаблицы.ИндексКартинки = 11; 
		КонецЕсли;
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ВсеСсылки, АдресРезультата);

КонецПроцедуры  

Процедура ОчиститьСсылки(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	МассивСсылок = ПараметрыПроцедуры.МассивСсылок;
	
	ТаблицаСсылок = НайтиПоСсылкам(МассивСсылок); 
	Для Каждого СтрокаТаблицы из ТаблицаСсылок Цикл
		
		Если Метаданные.Справочники.Найти(СтрокаТаблицы.Метаданные.Имя) <> Неопределено 
			ИЛИ Метаданные.Документы.Найти(СтрокаТаблицы.Метаданные.Имя) <> Неопределено  
			ИЛИ Метаданные.ПланыВидовХарактеристик.Найти(СтрокаТаблицы.Метаданные.Имя) <> Неопределено Тогда
			
			ЗаписатьОбъект = Ложь;
			ДанныеОбъект = СтрокаТаблицы.Данные.ПолучитьОбъект();
			
			Для Каждого Реквизит из СтрокаТаблицы.Метаданные.Реквизиты Цикл
				Если Реквизит.Тип.СодержитТип(ТипЗнч(СтрокаТаблицы.Ссылка)) Тогда
					Если ДанныеОбъект[Реквизит.Имя] = СтрокаТаблицы.Ссылка Тогда
						ДанныеОбъект[Реквизит.Имя] = Неопределено; 
						ЗаписатьОбъект = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;  
			
			Для Каждого ТабличнаяЧасть из СтрокаТаблицы.Метаданные.ТабличныеЧасти Цикл 
				Для Каждого РеквизитТабличнойЧасти из ТабличнаяЧасть.Реквизиты Цикл
					Если РеквизитТабличнойЧасти.Тип.СодержитТип(ТипЗнч(СтрокаТаблицы.Ссылка)) Тогда  
						мСтрокиКУдалению = новый Массив;
						Для каждого СтрокаТаблицыОбъекта из  ДанныеОбъект[ТабличнаяЧасть.Имя] Цикл
							Если СтрокаТаблицыОбъекта[РеквизитТабличнойЧасти.Имя] = СтрокаТаблицы.Ссылка Тогда 
								мСтрокиКУдалению.Добавить(СтрокаТаблицыОбъекта);
							КонецЕсли;
						КонецЦикла; 
						Для каждого УдаляемаяСтрока из мСтрокиКУдалению Цикл
							ДанныеОбъект[ТабличнаяЧасть.Имя].Удалить(УдаляемаяСтрока);
							ЗаписатьОбъект = Истина;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;   
			
			Если ЗаписатьОбъект тогда   
				ДанныеОбъект.ОбменДанными.загрузка = истина;
				ДанныеОбъект.Записать();
			КонецЕсли; 
		КонецЕсли;  
		
		Если Метаданные.РегистрыСведений.Найти(СтрокаТаблицы.Метаданные.Имя) <> Неопределено  Тогда  
			
			ЗаписьРегистра = РегистрыСведений[СтрокаТаблицы.Метаданные.Имя].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтрокаТаблицы.Данные); 
			ЗаписьРегистра.Прочитать();
			Если ЗаписьРегистра.Выбран() Тогда  
				ЗаписьРегистра.Удалить();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
