&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресЭлектроннойПочты", АдресЭлектроннойПочты);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметры(Команда)  
	
	Если Не ПроверитьАдерс() Тогда
		Возврат;	
	КонецЕсли;
	
	КодСостояния = CW_РаботаСВнешнимиРесурсамиСервер.ПроверитьПодключениеНаСервере();
	
	Если КодСостояния <> 200 Тогда
		ОписаниеКодовСостояний = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка подклчюения! Код: "+Строка(КодСостояния)+" - " + ОписаниеКодовСостояний.Получить(КодСостояния);
		Сообщение.Сообщить();
		
		ПоказатьПредупреждение(,"Не удалось подключиться");
	Иначе
		Ответ = ИзменитьАдресЭлектроннойПочтыНаСервере(); 
		Если Ответ.КодСостояния = 200 Тогда  
			ЭтаФорма.Закрыть(АдресЭлектроннойПочты);
		Иначе
			ПоказатьПредупреждение(,Ответ.Тело,,"Изменение адреса электронной почты серииса"); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ПроверитьАдерс()
	
	Если Не ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда   
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать адрес электронной почты",,"АдресЭлектроннойПочты");
		Возврат ложь;
	КонецЕсли;
	
	мАдреса = СтрРазделить(АдресЭлектроннойПочты,"@"); 
	Если мАдреса.Количество() <> 2 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать только один адрес электронной почты",,"АдресЭлектроннойПочты");
		Возврат ложь;
	КонецЕсли;

    Возврат Истина;
	
КонецФункции

&НаСервере
Функция ИзменитьАдресЭлектроннойПочтыНаСервере()  
	
	Структура = Новый Структура;

	РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("email",		XMLСтрока(АдресЭлектроннойПочты));                 
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_changemail", СтруктураJSON);
	
	HTTPОтвет = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");  
	Если HTTPОтвет = Неопределено Тогда
		Структура.Вставить("КодСостояния", 	533);	
		Структура.Вставить("Тело",			"Отсутствует интернет-соединение");	
	Иначе
		Структура.Вставить("КодСостояния", 	HTTPОтвет.КодСостояния);	
		Структура.Вставить("Тело",			HTTPОтвет.ПолучитьТелоКакСтроку());	
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции
