
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВопросаВыбора",ЭтотОбъект, ПараметрыВыполненияКоманды.Источник); 
	
	Если КлючУстановлен() Тогда
		ПоказатьВопрос(ОписаниеОповещения,"Вы уверены, что хотите сменить ключ?"+Символы.ПС+"Это действие необратимо!",РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения,КодВозвратаДиалога.Да); 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаВыбора(Ответ, Форма) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьРегистрациюМодуля", ЭтотОбъект, Форма);
	ОткрытьФорму("ОбщаяФорма.CW_ПолучениеЛицензионногоКлюча",,Форма,,,,ОписаниеОповещения);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьРегистрациюМодуля(Ответ, Форма) Экспорт
	
	Если Ответ = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Оповестить("ВыполненаАктивацияПрограммы");
	
	ТекстПредупрежедния = ?(Ответ.Код = 0, "Регистрационный ключ успешно установлен!",Ответ.ОписаниеОшибки);
	ПоказатьПредупреждение(, ТекстПредупрежедния,,"Регистрация модуля");   
	
КонецПроцедуры   

&НаСервере
Функция КлючУстановлен()
   Возврат  CW_ПроверкаЛицензии.КлючУстановлен();
КонецФункции   

&НаСервере
Функция ПолучитьДанныеСтраницыЛицензииНаСервере()   
	
	Возврат CW_РегистрацияПрограммыСервер.ПолучитьДанныеСтраницыЛицензии();
	
КонецФункции

