
Процедура ПриЗаписи(Отказ)
	
	УстановитьПраваГруппПользователей();

КонецПроцедуры

Процедура УстановитьПраваГруппПользователей()
	
	УстановитьПривилегированныйРежим(Истина);
	
	мИменаРеквизитов = Новый Массив;
	мИменаРеквизитов.Добавить("ДоступенБлокПланированияДДС");
	мИменаРеквизитов.Добавить("ВводЗаявокНаРасходБДДС");
	мИменаРеквизитов.Добавить("ВводПлановыхПоступленийБДДС");
	мИменаРеквизитов.Добавить("ВводПлановыхПоступленийБДДС");
	мИменаРеквизитов.Добавить("РольФинансовогоКонтролера");   
	мИменаРеквизитов.Добавить("РольКазначея");   
	
	Справочники.CW_ГруппыПользователей.УстановитьЗначениеистинаДляПолныхПрав(мИменаРеквизитов, Значение, Значение);
	
КонецПроцедуры
