//Отбор по списку номеров
&НаКлиенте
Процедура ПродолжитьОтобрПоСпискуНомеров(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	Конецесли;
	
	УстановитьОтборСписка(РезультатВыбора);

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписка(РезультатВыбора)
	
	СписокОтбора = Новый СписокЗначений;
	СписокОтбора.ЗагрузитьЗначения(РезультатВыбора.МассивНомеров); 
	
	ИмяполяКомпоновки = РезультатВыбора.ИмяРеквизита; 
	
	ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	Если ТипЗнч(ПользовательскийОтбор) = Тип("ОтборКомпоновкиДанных") Тогда 
		ЭлементПользовательскогоОтбора =  ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементПользовательскогоОтбора.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных(ИмяполяКомпоновки);    
		ЭлементПользовательскогоОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;    
		ЭлементПользовательскогоОтбора.ПравоеЗначение	= СписокОтбора;    
		ЭлементПользовательскогоОтбора.Использование	= Истина;    
		ЭлементПользовательскогоОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
		ЭлементПользовательскогоОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры  
//Отбор по списку номеров
