
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = CW_РеестрыНДС0Сервер.ПоказыватьРекламуПриСтартеПользователя();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("СсылкаНаРесурс") Тогда
		ТекстHTMLДокумента = Параметры.СсылкаНаРесурс;
	Иначе
		МакетHTML = ПолучитьОбщийМакет("CW_РеестрыНДС0РекламныйБаннер");
		ТекстHTMLДокумента =   МакетHTML.ПолучитьТекст();
	КонецЕсли;
	
	HTMLДокумент =	ТекстHTMLДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура НеПоказыватьПриСтартеПриИзменении(Элемент)
	
	НеПоказыватьПриСтартеПриИзмененииНаСервере();   
	
КонецПроцедуры

&НаСервере
Процедура НеПоказыватьПриСтартеПриИзмененииНаСервере()
	
	CW_РеестрыНДС0Сервер.УстановитьПоказыватьРекламуПриСтартеПользователя(НеПоказыватьПриСтарте);	
	
КонецПроцедуры

&НаКлиенте
Процедура HTMLДокументПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ИмяФайла = "https://www.coralway.ru/products/688";
	#Если Вебклиент Тогда 
		ПерейтиПоНавигационнойСсылке(ИмяФайла);
	#Иначе
		ЗапуститьПриложение(ИмяФайла);
	#КонецЕсли	
	
КонецПроцедуры
