
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыводитьАрхивные") Тогда 
		ВыводитьАрхивные 		= Параметры.ВыводитьАрхивные;
	КонецЕсли;
	Элементы.ВыводитьАрхивные.Видимость = Параметры.Свойство("ВыводитьАрхивные");
	
	
	АдресИсточникаНастроек 	= Параметры.СхемаКомпоновки;
	АдресНастроек 			= Параметры.НастройкиКомпоновщика;
	
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресИсточникаНастроек));
	КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(АдресНастроек));
	
	//Работа с буфером обмена
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена());
	//Работа с буфером обмена
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОграничение(ИмяПоля)
	
	//Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	//Ограничение = Элементы.ДоступныеПоля.ОграниченияИспользования.Добавить();
	//Ограничение.Доступность = Ложь;
	//Ограничение.Поле = Поле;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// --- 
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки(Элемент)
	
	//ТД = Элемент.ТекущиеДанные;
	//
	//Если (ТД <> Неопределено) Тогда
	//	
	//	Доступно = Ложь;
	//	Для Каждого СтрОтбора из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//		Если (ТипЗнч(СтрОтбора) <> Тип("ГруппаЭлементовОтбораКомпоновкиДанных")) Тогда
	//			Если СтрОтбора.ЛевоеЗначение = ТД.ЛевоеЗначение И ТипЗнч(СтрОтбора.ПравоеЗначение) = Тип("Строка") Тогда 
	//				Доступно = Истина;
	//			КонецЕсли;	
	//		КонецЕсли; 
	//		
	//	КонецЦикла;	
	//	
	//	Элементы.КомпоновщикНастроекНастройкиОтборСформироватьСписок.Доступность = Доступно;
	//	
	//КонецЕсли; 
	
	ПроверитьВозможностьУстановитьОтборПоСписку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)  
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ВыводитьАрхивные", 	ВыводитьАрхивные);
	ПараметрыЗакрытия.Вставить("АдресНастроек", 	ПоместитьВоВременноеХранилище(КомпоновщикНастроек.Настройки,АдресНастроек));
	
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписок(Команда)
	
	СтрокаСписка = "";
	ПОВ = Новый ОписаниеОповещения("ОбработкаВводаСписка", ЭтотОбъект); 
	ПоказатьВводСтроки(ПОВ, СтрокаСписка, "Введите список значений", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаСписка(СтрокаСписка, ДопПараметры) Экспорт
	
	Если СтрокаСписка <> Неопределено Тогда
		спЗначений = ПолучитьСписок(СтрокаСписка);
		Если спЗначений.Количество() > 0 Тогда
			ТД = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные;
			Для Каждого СтрОтбора из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
				Если СтрОтбора.ЛевоеЗначение = ТД.ЛевоеЗначение И ТипЗнч(СтрОтбора.ПравоеЗначение) = Тип("Строка") Тогда 
					СтрОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
					СтрОтбора.ПравоеЗначение = спЗначений;
					СтрОтбора.Использование  = Истина;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

//-----------------------------------------------------

&НаКлиенте
Функция ПолучитьСписок(Список)
	
	Разделители = ПолучитьРазделитили();
	спЗначений = Новый СписокЗначений;
	ДлТекста = СтрДлина(Список);
	ВыхТекст = "";
	Для Инк = 1 по ДлТекста Цикл
		Если Разделители.Найти(Сред(Список, Инк, 1)) = Неопределено Тогда
			ВыхТекст = ВыхТекст + Сред(Список, Инк, 1);	
		Иначе
			Если ЗначениеЗаполнено(ВыхТекст) Тогда
				спЗначений.Добавить(СокрЛП(ВыхТекст));
				ВыхТекст = "";
			КонецЕсли;	
		КонецЕсли; 
	КонецЦикла;	
	Если ЗначениеЗаполнено(ВыхТекст) Тогда
		спЗначений.Добавить(СокрЛП(ВыхТекст));
		ВыхТекст = "";
	КонецЕсли;
	
	Возврат спЗначений;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРазделитили();
	
	мас = Новый Массив;
	мас.Добавить(";");
	мас.Добавить(".");
	мас.Добавить(",");
	//мас.Добавить(" ");	
	мас.Добавить(Символы.ВК);
	мас.Добавить(Символы.ВТаб);
	мас.Добавить(Символы.ПС);
	мас.Добавить(Символы.ПФ);
	мас.Добавить(Символы.Таб); 
	
	Возврат мас;
	
КонецФункции	

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	
	//ТД = Элемент.ТекущиеДанные;
	//Если (ТД = Неопределено) Тогда
	//	Возврат;		
	//КонецЕсли;
	//
	//Доступно = Ложь;
	//Для Каждого СтрОтбора из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//	Если (ТипЗнч(СтрОтбора) <> Тип("ГруппаЭлементовОтбораКомпоновкиДанных")) Тогда
	//		Если СтрОтбора.ЛевоеЗначение = ТД.ЛевоеЗначение И ТипЗнч(СтрОтбора.ПравоеЗначение) = Тип("Строка") Тогда 
	//			Доступно = Истина;
	//		КонецЕсли;	
	//	КонецЕсли;
	//КонецЦикла;	
	//
	//Элементы.КомпоновщикНастроекНастройкиОтборСформироватьСписок.Доступность = Доступно;
	
	ПроверитьВозможностьУстановитьОтборПоСписку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьУстановитьОтборПоСписку()
	// --- 
	
	Идентификатор = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока;
	Доступно = Ложь;
	Если (Идентификатор <> Неопределено) Тогда
		
		ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Идентификатор);
		Если (ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")) Тогда
			
			Если (ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("Строка")) Тогда
				Доступно = Истина;
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли; 
	Элементы.КомпоновщикНастроекНастройкиОтборСформироватьСписок.Доступность = Доступно;
	
	// --- 
КонецПроцедуры

//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.КомандаБуфераОбменаВставить.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуфераОбменаВставить(Команда)
	
	КоличествоСтрок = БуфераОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция БуфераОбменаВставитьНаСервере()
	
	Возврат CW_РаботаСБуферомОбмена.УстановитьОтборКомпановщикаПоБуферуОбмена(КомпоновщикНастроек);

КонецФункции
//Работа с буфером обмена

  
