
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВерсииПодсистем  = CW_ВерсииПодсистемСервер.УстановленныеВерсииПодсистем();
	Если ВерсииПодсистем.Свойство("CW_ОбменГИСЭПД") Тогда
		ВерсияПодсистемы = ВерсииПодсистем.CW_ОбменГИСЭПД;
	КонецЕсли;      
	
	ВерсияПодсистемы 	= ?(ВерсияПодсистемы = Неопределено, "Не установлена", ВерсияПодсистемы);
	Заголовок 			= Заголовок + " (версия "+СокрЛП(ВерсияПодсистемы)+")"; 

	Результат = CW_ОбменГИСЭПДСервер.ПолучитьРегистрационнуюИнформациюСервиса();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Результат);
	
	Если КонецДня(ТекущаяДата()) <= ДатаОкончания 
		И НачалоДня(ТекущаяДата()) >= ДатаНачала Тогда
		Статус = "Действует";
		ЦветТекстаНадписи = WebЦвета.Зеленый;
	Иначе
		Статус = "Не оформлена";
		ЦветТекстаНадписи = WebЦвета.Красный;
	КонецЕсли;

	Элементы.Статус.ЦветТекста = ЦветТекстаНадписи;   
	
	Элементы.Группа3.Видимость = Не РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована();
	
КонецПроцедуры 


