&НаСервере
Функция ПолучитьАэропортыИзФТП(Отказ);
	
	ДанныеАутентификации = CW_МониторПорталаПоддержкиСервер.ДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ДанныеАутентификации = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указаны данные аутентификации пользователя на FTP-сервере",,,,Отказ);
	КонецЕсли;    
	
	ПараметрыFTPПодключения = CW_РаботаСFTPРесурсами.ПолучитьПустуюСтруктуруНастроекFTP();   
	ПараметрыFTPПодключения.Логин  = ДанныеАутентификации.Логин;
	ПараметрыFTPПодключения.Пароль = ДанныеАутентификации.Пароль;
	
	CW_РаботаСFTPРесурсами.ЗаполнитьНастройкиFTPРесурса(ПараметрыFTPПодключения);	
	
	FTPСоединение = CW_РаботаСFTPРесурсами.ПодключитьсяКFTPРесурсу(ПараметрыFTPПодключения);
	
	Если FTPСоединение = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить соединение с FTP-сервером",,,,Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Каталог = "/Reference/Airports";
	FTPСоединение.УстановитьТекущийКаталог(Каталог);
	
	Если FTPСоединение.НайтиФайлы("Airports.mxl").Количество() = 0 тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("mxl");
	FTPСоединение.Получить("Airports.mxl",ВременныйФайл);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ВременныйФайл);
	
	УдалитьФайлы(ВременныйФайл);
	
	Возврат ТабличныйДокумент;
КонецФункции

&НаСервере
Функция ИмяЗначенияПеречисления(Значение) Экспорт
      
      ОбъектМетаданных = Значение.Метаданные();
      
      ИндексЗначения = Перечисления[ОбъектМетаданных.Имя].Индекс(Значение);
      
      Возврат ОбъектМетаданных.ЗначенияПеречисления[ИндексЗначения].Имя;
      
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// заполнение из макета
	Макет = ПолучитьАэропортыИзФТП(Отказ);
	Если Отказ Тогда Возврат КонецЕсли;
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл                          
		НовСтрока = ТаблицаЗагрузки.Добавить();
		НовСтрока.Наименование = Макет.Область(НомерСтроки, 3).Текст;
		Если ЗначениеЗаполнено(Справочники.CW_Аэропорты.НайтиПоНаименованию(НовСтрока.Наименование)) Тогда
			НовСтрока.ЕстьВБазе = Истина;
		КонецЕсли;
		НовСтрока.НаименованиеАнгл = Макет.Область(НомерСтроки, 4).Текст;
		НовСтрока.Страна = ВРег(Макет.Область(НомерСтроки, 8).Текст);
		НовСтрока.ЧасовойПояс = Макет.Область(НомерСтроки, 7).Текст;  
		НовСтрока.ГеографическиеКоординаты = Макет.Область(НомерСтроки, 11).Текст + "; " + Макет.Область(НомерСтроки, 12).Текст;
		НовСтрока.КодИАТА = ВРег(Макет.Область(НомерСтроки, 1).Текст);
		НовСтрока.КодИКАО = ВРег(Макет.Область(НомерСтроки, 2).Текст);
		НовСтрока.ISOкод = ВРег(Макет.Область(НомерСтроки, 10).Текст);
		НовСтрока.Телефон = Макет.Область(НомерСтроки, 13).Текст;
		НовСтрока.Факс = Макет.Область(НомерСтроки, 14).Текст;
		НовСтрока.Email = Макет.Область(НомерСтроки, 15).Текст;
		НовСтрока.Сайт = Макет.Область(НомерСтроки, 16).Текст;
		НовСтрока.Город = Макет.Область(НомерСтроки, 5).Текст;
	КонецЦикла;
	УО = ЭтаФорма.УсловноеОформление; 
	УО.Элементы.Очистить(); 
	ЭлементУО = УО.Элементы.Добавить(); 

	Оформляемоеполе = ЭлементУО.Поля.Элементы.Добавить(); 
	Оформляемоеполе.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗагрузки"); 
	Оформляемоеполе.Использование = ИСТИНА; 


	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаЗагрузки.ЕстьВБазе"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФОна",WebЦвета.СветлоЗеленый); 
	// а не расставить ли флажки по умолчанию? пометить, если линия не найдена / не помечать, если уже есть
	_УправлениеЭлементамиФормы();
КонецПроцедуры

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	колВоВыделенных = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	Элементы.НадписьИтого.Заголовок = "Выделено "+колВоВыделенных+" из "+ТаблицаЗагрузки.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормыКлиент()
	
	колВоВыделенных = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	Элементы.НадписьИтого.Заголовок = "Выделено "+колВоВыделенных+" из "+ТаблицаЗагрузки.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагрузкиПометкаПриИзменении(Элемент)
	
	фл = Элементы.ТаблицаЗагрузки.ТекущиеДанные.Пометка;
	Для Каждого ИдСтроки Из Элементы.ТаблицаЗагрузки.ВыделенныеСтроки Цикл
		СтрокаДФК = ТаблицаЗагрузки.НайтиПоИдентификатору(ИдСтроки);
		СтрокаДФК.Пометка = фл;
	КонецЦикла;
	
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры


&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для Каждого строкаКоллекции  Из ТаблицаЗагрузки Цикл
		строкаКоллекции.Пометка = Ложь;
	КонецЦикла;
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого строкаКоллекции  Из ТаблицаЗагрузки Цикл
		строкаКоллекции.Пометка = Истина;
	КонецЦикла;
	УправлениеЭлементамиФормыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	// строки к загрузке
	колВоВыделенных = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
	Если колВоВыделенных=0 Тогда 
		_УФК.ВывестиПредупреждение("Не отмечено ни одной строки");
		Возврат;
	КонецЕсли;
	
	// поиск существующих по наименованию
	Ответ = _ПроверитьСуществованиеЗагружаемыхАэропортов();
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда 
		
		// добавим без дополнительных вопросов
		ВыполнитьЗагрузкуАэропортов();
		
	Иначе 
		// часть линий найдена
		сз = Новый СписокЗначений;
		сз.Добавить(КодВозвратаДиалога.Да,         "Перезаписать все");
		сз.Добавить(КодВозвратаДиалога.Пропустить, "Пропустить найденные"); //"Пропустить существующие"//"Добавить только новые"
		сз.Добавить(КодВозвратаДиалога.Отмена,     "Отмена");
		// --- 
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаПерезаписиАэропортов",ЭтотОбъект, Новый Структура("Ответ",Ответ)); 
		// --- 
		ПоказатьВопрос(ПОВ,
			"В справочнике уже существуют аэропорты :"+Ответ.ОписаниеОшибки
			+ Символы.ПС + "Перезаписать существующие элементы справочника Аэропорты?",
			сз);
		
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаПерезаписиАэропортов(КодВозврата, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если КодВозврата = КодВозвратаДиалога.Да Тогда 
		
		// добавляем все
		ВыполнитьЗагрузкуАэропортов();
		
	ИначеЕсли КодВозврата = КодВозвратаДиалога.Пропустить Тогда 
		
		// снимем отметки у найденных
		Для Каждого наим Из ДополнительныеПараметры.Ответ.НайденныеНаименования Цикл
			масс = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка, Наименование", Истина, наим));
			Для Каждого СтрокаДФК Из масс Цикл
				СтрокаДФК.Пометка = Ложь;
			КонецЦикла;
		КонецЦикла;
		ВыполнитьЗагрузкуАэропортов();
		
	Иначе 
		
		// отмена
		Возврат;
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ВыполнитьЗагрузкуАэропортов()
	// --- 
	
	// создание новых
	Ответ = _ЗагрузитьАэропорты();
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда 
		ЭтаФорма.ОповеститьОЗаписиНового(Ответ.Ссылка);
		_УФК.ВывестиПредупреждение("Добавлено/изменено аэропортов: "+Ответ.КоличествоДобавлено);
	Иначе 
		_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПроверитьСуществованиеЗагружаемыхАэропортов()
		
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаЗагрузки.Наименование КАК НаименованиеИзКоллекции
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	&ТаблицаЗагрузки КАК ТаблицаЗагрузки
		|ГДЕ
		|	ТаблицаЗагрузки.Пометка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	CW_Аэропорты.Наименование КАК НаименованиеИзСправочника,
		|	вт.НаименованиеИзКоллекции
		|ИЗ
		|	Справочник.CW_Аэропорты КАК CW_Аэропорты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО CW_Аэропорты.Наименование = вт.НаименованиеИзКоллекции"
	);
	з.УстановитьПараметр("ТаблицаЗагрузки", ТаблицаЗагрузки.Выгрузить(Новый Структура("Пометка", Истина)));
	тз = з.Выполнить().Выгрузить();	
	
	Если тз.Количество()=0 Тогда                                   
		Возврат _УФКС.Ответ();
		
	Иначе 
		КоличествоУжеСуществует = тз.Количество();
		ОтображатьNПервых = 8;
		стр="";
		Для ы=0 По Мин(КоличествоУжеСуществует, ОтображатьNПервых)-1 Цикл
			СтрокаТЗ = тз[ы];
			стр = стр + Символы.ПС + тз[ы].НаименованиеИзСправочника;
		КонецЦикла;
		Если КоличествоУжеСуществует>ОтображатьNПервых Тогда 
			стр = стр + Символы.ПС + "и ещё "+(КоличествоУжеСуществует-ОтображатьNПервых)+"...";
		КонецЕсли;
		
		СтруктураОтвета = _УФКС.Ответ(КоличествоУжеСуществует, стр);
		СтруктураОтвета.Вставить("НайденныеНаименования", тз.ВыгрузитьКолонку("НаименованиеИзКоллекции"));
		Возврат СтруктураОтвета;
	
	КонецЕсли;
	
	
КонецФункции

&НаСервере
Функция _ЗагрузитьАэропорты()
	
	Ответ = _УФКС.Ответ();
	Ответ.Вставить("Ссылка", Справочники.CW_Аэропорты.ПустаяСсылка()); // достаточно вернуть хотя бы одну ссылку
	Ответ.Вставить("КоличествоДобавлено", 0);

	массСтрок = ТаблицаЗагрузки.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для Каждого строкаДФК Из массСтрок Цикл
		об = Справочники.CW_Аэропорты.НайтиПоНаименованию(строкаДФК.Наименование);
		Если ЗначениеЗаполнено(об) Тогда
			об = об.ПолучитьОбъект();
		Иначе
			об = Справочники.CW_Аэропорты.СоздатьЭлемент();		
		КонецЕсли;
		об.Наименование = строкаДФК.Наименование;
		об.НаименованиеАнгл = строкаДФК.НаименованиеАнгл;
		Страна = ПроверитьСтрану(строкаДФК.Страна);
		об.Страна = Страна.Ссылка;
		об.ЧасовойПояс = строкаДФК.ЧасовойПояс;
		об.ГеографическиеКоординатыАэропорта = строкаДФК.ГеографическиеКоординаты;
		об.КодИАТА = строкаДФК.КодИАТА;
		об.КодИКАО = строкаДФК.КодИКАО;
		об.Город = строкаДФК.Город;
		об.ISOкод = строкаДФК.ISOкод;
		об.Телефон = строкаДФК.Телефон;
		об.Факс = строкаДФК.Факс;
		об.Email = строкаДФК.Email;
		об.Сайт = строкаДФК.Сайт;
		Попытка
			об.Записать();
			Ответ.КоличествоДобавлено = Ответ.КоличествоДобавлено + 1;
		Исключение
			Возврат _УФКС.Ответ(1, ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПроверитьСтрану(НаименованиеСтраны)
	
	НайденнаяСсылка = Справочники.СтраныМира.НайтиПоНаименованию(НаименованиеСтраны);
	
	Если НайденнаяСсылка.Пустая() Тогда
		
		РезультатДанныеКлассификатора = Справочники.СтраныМира.ДанныеКлассификатораСтранМираПоНаименованию(НаименованиеСтраны);
		
		Если РезультатДанныеКлассификатора <> Неопределено Тогда
			
			ОбъектСтрана = Справочники.СтраныМира.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(ОбъектСтрана, РезультатДанныеКлассификатора);
			ОбъектСтрана.Записать();
			
			НайденнаяСсылка = ОбъектСтрана.Ссылка;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат НайденнаяСсылка;
	
КонецФункции
