
Функция ОбщийМодуль(Имя) Экспорт
	
	Возврат ОбщегоНазначения.ОбщийМодуль(Имя);
	
КонецФункции    

процедура ЗаполнитьСписокКартинок(СписокКартинок) Экспорт
	
	Список = CW_ОбщегоНазначенияПовторноеИспользование.ПолучитьСписокКартинок();  
	Для Каждого ЭлементСпика из Список Цикл
		СписокКартинок.Добавить(ЭлементСпика.Значение, ЭлементСпика.Представление,Ложь,  ЭлементСпика.Картинка);
	КонецЦикла;
	
КонецПроцедуры

// Определяет режим эксплуатации информационной базы файловый (Истина) или серверный (Ложь).
// При проверке используется СтрокаСоединенияИнформационнойБазы, которую можно указать явно.
//
// Параметры:
//  СтрокаСоединенияИнформационнойБазы - Строка - параметр используется, если
//                 нужно проверить строку соединения не текущей информационной базы.
//
// Возвращаемое значение:
//  Булево - Истина, если файловая.
//
Функция ИнформационнаяБазаФайловая(Знач СтрокаСоединенияИнформационнойБазы = "") Экспорт
	
	Если ПустаяСтрока(СтрокаСоединенияИнформационнойБазы) Тогда
		СтрокаСоединенияИнформационнойБазы =  СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;   
	
	Возврат СтрНайти(ВРег(СтрокаСоединенияИнформационнойБазы), "FILE=") = 1;
	
КонецФункции 


