
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	КлючОбъекта 				= Этаформа.ИмяФормы;
	ПользовательОбщихНастроек 	= "ПользовательОбщихНастроек";
	
	Параметры.Свойство("РежимФормы", РежимФормы);  //Режим формы: 0-сохранение, 1-выбор   
	
	Если Параметры.Свойство("Настройки") Тогда
		СохраняемыеНастройки = Новый ФиксированноеСоответствие(Параметры.Настройки);
	КонецЕсли;
	
	Элементы.ИмяНастройки.Видимость 					= (РежимФормы = 0);  
	Элементы.ФормаСохранитьНастройку.Видимость 			= (РежимФормы = 0);
	Элементы.ДоступностьНастройки.Видимость 			= (РежимФормы = 0);

	Элементы.ФормаВыбратьНастройку.Видимость 			= (РежимФормы = 1);

	Элементы.ФормаВыбратьНастройку.КнопкаПоУмолчанию  	= (РежимФормы = 1);
	Элементы.ФормаСохранитьНастройку.КнопкаПоУмолчанию  = (РежимФормы = 0);

	СоответствиеНастроекОбщие = Новый ФиксированноеСоответствие(Новый Соответствие);
	
	//Общие настройки
	ПолучитьОбщиеНастройки();
	//Общие настройки
	
	//Личные настройки
	СоответствиеНастроекЛичные = Новый ФиксированноеСоответствие(Новый Соответствие);
	Настройки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, "НастройкиКолонок");
	Если ТипЗнч(Настройки) = Тип("Соответствие") Тогда
		СоответствиеНастроекЛичные = Новый ФиксированноеСоответствие(Настройки);	 
		Для Каждого КлючЗначение из СоответствиеНастроекЛичные Цикл
			СписокНастроекЛичные.Добавить(КлючЗначение.Ключ);
			СписокНастроек.Добавить(КлючЗначение.Ключ,,,БиблиотекаКартинок.CW_Пользователь);
		КонецЦикла;  
	КонецЕсли;  
	//Личные настройки 
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьОбщиеНастройки()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, "НастройкиКолонок",,ПользовательОбщихНастроек);
	Если ТипЗнч(Настройки) = Тип("Соответствие") Тогда
		СоответствиеНастроекОбщие = Новый ФиксированноеСоответствие(Настройки);	 
		Для Каждого КлючЗначение из СоответствиеНастроекОбщие Цикл
			СписокНастроекОбщие.Добавить(КлючЗначение.Ключ);
			СписокНастроек.Добавить(КлючЗначение.Ключ,,,БиблиотекаКартинок.CW_Люди);
		КонецЦикла;  
	КонецЕсли;

КонецПроцедуры 


&НаКлиенте
Процедура СохранитьНастройку(Команда)

	СохранитьНастройкуНаСервере();    
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкуНаСервере() 
	
	Если ДоступностьНастройки = 1 Тогда 
		УстановитьПривилегированныйРежим(Истина);
		
		ИмяПользователя = ПользовательОбщихНастроек;
		Настройки = Новый Соответствие(СоответствиеНастроекОбщие);
	Иначе
		ИмяПользователя = ИмяПользователя();
		Настройки = Новый Соответствие(СоответствиеНастроекЛичные);
	КонецЕсли;

	ДанныеНастроек 		= Новый Соответствие(СохраняемыеНастройки);
	ХранилищеЗначения 	= Новый ХранилищеЗначения(ДанныеНастроек);
	
	Настройки.Вставить(ИмяНастройки, ХранилищеЗначения); 

	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "НастройкиКолонок", Настройки, , ИмяПользователя);
	
КонецПроцедуры  

&НаКлиенте
Процедура УдалитьНастройку(Команда)   
	
	ТекущаяСтрока = Элементы.СписокНастроек.ТекущаяСтрока; 
	ЭлементСписка = СписокНастроек.Получить(ТекущаяСтрока); 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьУдалениеНастройки", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Удалить выбранную настройку ("+СокрЛП(ЭлементСписка.Значение)+")", Режим, 0);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПродолжитьУдалениеНастройки(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	УдалитьНастройкуНаСервере(ДополнительныеПараметры.ТекущаяСтрока);  

КонецПроцедуры 

&НаСервере
Процедура УдалитьНастройкуНаСервере(ВыбраннаяСтрока)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЭлементСписка 	= СписокНастроек.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ИмяПользователя = ИмяПользователя();
	Настройки 		= Новый Соответствие(СоответствиеНастроекЛичные);  
	ДанныеНастроек 	= Настройки.Получить(ЭлементСписка.Значение);
	
	Если ДанныеНастроек = Неопределено Тогда
		ИмяПользователя = ПользовательОбщихНастроек;
		Настройки 		= Новый Соответствие(СоответствиеНастроекОбщие);  
		ДанныеНастроек 	= Настройки.Получить(ЭлементСписка.Значение);
	КонецЕсли;  
	
	Если ДанныеНастроек = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Настройки.Удалить(ЭлементСписка.Значение);
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "НастройкиКолонок", Настройки,, ИмяПользователя);
	
	СписокНастроек.Удалить(ЭлементСписка);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьНастройку(Команда)   
	
	ТекущаяСтрока = Элементы.СписокНастроек.ТекущаяСтрока;
	ДанныеНастроек = ВыбратьНастройкуНаСервере(ТекущаяСтрока); 
	ЭтаФорма.Закрыть(ДанныеНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	
	ДанныеНастроек = ВыбратьНастройкуНаСервере(ВыбраннаяСтрока);
	ЭтаФорма.Закрыть(ДанныеНастроек);
	
КонецПроцедуры

&НаСервере
Функция ВыбратьНастройкуНаСервере(ВыбраннаяСтрока) 
	
	ЭлементСписка = СписокНастроек.НайтиПоИдентификатору(ВыбраннаяСтрока); 
	
	ХранилищеНастройки 	= СоответствиеНастроекЛичные.Получить(ЭлементСписка.Значение);  
	Если ХранилищеНастройки = Неопределено Тогда
		ХранилищеНастройки 	= СоответствиеНастроекОбщие.Получить(ЭлементСписка.Значение);  
	КонецЕсли; 
	
	Если ХранилищеНастройки = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Настройка = ХранилищеНастройки.Получить();
	
	ВыбраннаяНастройка = Новый Структура;
	ВыбраннаяНастройка.Вставить("ИмяНастройки", ЭлементСписка.Значение);
	ВыбраннаяНастройка.Вставить("Настройка", 	Настройка);
	
	Возврат ВыбраннаяНастройка;
	
КонецФункции



