
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВключитьВозможностьРедактировать = Параметры.ВключитьВозможностьРедактировать;
	АдресТаблицДокумента             = Параметры.АдресТаблицДокумента;
	ТаблицыДокумента                 = ПолучитьИзВременногоХранилища(АдресТаблицДокумента);
	
	ДокументыОбОтгрузке.Загрузить(ТаблицыДокумента.ТаблицаДокументовОбОтгрузке);
	ДокументыОснования.ЗагрузитьЗначения(ТаблицыДокумента.ТаблицаДокументовОснований);
	
	Если ДокументыОснования.Количество() > 0 Тогда
		ЭлементСписка = ДокументыОснования.Получить(0);
		
		ДатаДокументаОснования = ЭлементСписка.Значение.ДатаСчетаФактуры;
	Иначе
		ДатаДокументаОснования = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент Тогда
		СтруктураВозврата = ПриЗакрытииНаСервере();
		ОповеститьОВыборе(СтруктураВозврата);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И (Модифицированность ИЛИ ПеренестиВДокумент) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность И НЕ ПеренестиВДокумент Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПеренестиВДокументЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
	Если ПеренестиВДокумент И НЕ Отказ Тогда
		Отказ = ЕстьОшибкиЗаполнения();
	КонецЕсли;
	
	Если Отказ Тогда
		ПеренестиВДокумент = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактироватьПриИзменении(Элемент)
	
	Элементы.ДокументыОбОтгрузке.Доступность = ВключитьВозможностьРедактировать;  
	Элементы.ДокументыОбОтгрузкеЗаполнить.Доступность = ВключитьВозможностьРедактировать;  
	
	Если ВключитьВозможностьРедактировать Тогда
		ЗаполнитьОтгрузочныеДокументы();
	Иначе
		ДокументыОбОтгрузке.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПеренестиВДокумент = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	ПеренестиВДокумент = Ложь;
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры  

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ДокументыОбОтгрузке.Очистить();
	ЗаполнитьОтгрузочныеДокументы();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьОтгрузочныеДокументы()  
	
	Если ДокументыОснования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	мОснования = ДокументыОснования.ВыгрузитьЗначения();
	
	ТаблицаДокументов = Новый ТаблицаЗначений;  
	ТаблицаДокументов.Колонки.Добавить("НаименованиеДокумента", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблицаДокументов.Колонки.Добавить("НомерСтрокиНачало", 	Новый ОписаниеТипов("Число"));
	ТаблицаДокументов.Колонки.Добавить("НомерСтрокиКонец", 		Новый ОписаниеТипов("Число"));
	ТаблицаДокументов.Колонки.Добавить("НомерДокумента", 		Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(40)));
	ТаблицаДокументов.Колонки.Добавить("ДатаДокумента", 		Новый ОписаниеТипов("Дата"));
	
	Для Каждого Основание Из мОснования Цикл  
		
		ПредыдущийДокумент = Неопределено;
		Для Каждого СтрокаТаблицы из Основание.Услуги Цикл
			
			Если ПредыдущийДокумент <> СтрокаТаблицы.ДокументРасходов Тогда
				НомерСтрокиНачало = СтрокаТаблицы.НомерСтроки;   
				ПредыдущийДокумент = СтрокаТаблицы.ДокументРасходов;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаДокументов.Добавить();   
			
			Если Основание.ЭтоУниверсальныйДокумент Тогда
				НоваяСтрока.НаименованиеДокумента 		= "Универсальный передаточный документ";	
			Иначе
				НоваяСтрока.НаименованиеДокумента 		= "Акт";	
			КонецЕсли;
			
			НоваяСтрока.НомерСтрокиНачало 		= НомерСтрокиНачало;	
			НоваяСтрока.НомерСтрокиКонец 		= СтрокаТаблицы.НомерСтроки;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДокументРасходов) Тогда
				НоваяСтрока.НомерДокумента 			= CW_Документы.ПолучитьНомерНаПечать(СтрокаТаблицы.ДокументРасходов, "НомерАкта");	
				НоваяСтрока.ДатаДокумента 			= СтрокаТаблицы.ДокументРасходов.ДатаАкта;	    
			Иначе
				НоваяСтрока.НомерДокумента 			= CW_Документы.ПолучитьНомерНаПечать(Основание, "НомерАкта");	
				НоваяСтрока.ДатаДокумента 			= Основание.ДатаАкта;	    
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла; 
	
	Запрос = новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДокументов.НаименованиеДокумента КАК НаименованиеДокумента,
	               |	ТаблицаДокументов.НомерСтрокиНачало КАК НомерСтрокиНачало,
	               |	ТаблицаДокументов.НомерСтрокиКонец КАК НомерСтрокиКонец,
	               |	ТаблицаДокументов.НомерДокумента КАК НомерДокумента,
	               |	ТаблицаДокументов.ДатаДокумента КАК ДатаДокумента
	               |ПОМЕСТИТЬ ВТ_ТаблицаДокументов
	               |ИЗ
	               |	&ТаблицаДокументов КАК ТаблицаДокументов";
	
	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	Запрос.Выполнить();

	
	Если ДатаДокументаОснования >= Дата(2024,10,1) Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВТ_ТаблицаДокументов.НаименованиеДокумента КАК НаименованиеДокумента,
		               |	ВТ_ТаблицаДокументов.НомерДокумента КАК НомерДокумента,
		               |	ВТ_ТаблицаДокументов.ДатаДокумента КАК ДатаДокумента
		               |ИЗ
		               |	ВТ_ТаблицаДокументов КАК ВТ_ТаблицаДокументов
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ_ТаблицаДокументов.НаименованиеДокумента,
		               |	ВТ_ТаблицаДокументов.НомерДокумента,
		               |	ВТ_ТаблицаДокументов.ДатаДокумента";   
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокументОтгрузки  = ДокументыОбОтгрузке.Добавить();
			ДокументОтгрузки.НаименованиеДокумента 	= Выборка.НаименованиеДокумента;
			ДокументОтгрузки.НомерДокумента 		= Выборка.НомерДокумента;
			ДокументОтгрузки.ДатаДокумента 			= Выборка.ДатаДокумента;
		КонецЦикла; 
	
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ТаблицаДокументов.НомерСтрокиНачало КАК НомерСтрокиНачало,
	               |	МАКСИМУМ(ВТ_ТаблицаДокументов.НомерСтрокиКонец) КАК НомерСтрокиКонец,
	               |	ВТ_ТаблицаДокументов.НомерДокумента КАК НомерДокумента,
	               |	ВТ_ТаблицаДокументов.ДатаДокумента КАК ДатаДокумента
	               |ИЗ
	               |	ВТ_ТаблицаДокументов КАК ВТ_ТаблицаДокументов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ТаблицаДокументов.НомерСтрокиНачало,
	               |	ВТ_ТаблицаДокументов.НомерДокумента,
	               |	ВТ_ТаблицаДокументов.ДатаДокумента
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтрокиНачало";  
	
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокументОтгрузки  = ДокументыОбОтгрузке.Добавить();
			ДокументОтгрузки.НаименованиеДокумента 	= "Реализация (акт, накладная, УПД)";
			ДокументОтгрузки.НомераСтрок 			= Формат(Выборка.НомерСтрокиНачало, "ЧГ=0")+"-"+Формат(Выборка.НомерСтрокиКонец, "ЧГ=0");
			ДокументОтгрузки.НомерДокумента 		= Выборка.НомерДокумента;
			ДокументОтгрузки.ДатаДокумента 			= Выборка.ДатаДокумента;
		КонецЦикла;   
		
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПриЗакрытииНаСервере()
	
	СтруктураВозврата = Новый Структура();
	
	Если ПеренестиВДокумент Тогда
		СтруктураВозврата.Вставить("ОтредактированыДокументыОтгрузки", ВключитьВозможностьРедактировать);
		ТаблицаДокументовОбОтгрузке = ДокументыОбОтгрузке.Выгрузить();
		АдресТаблицыОтгрузочныхДокументов = ПоместитьВоВременноеХранилище(ТаблицаДокументовОбОтгрузке, УникальныйИдентификатор);
		СтруктураВозврата.Вставить("АдресТаблицыОтгрузочныхДокументов", АдресТаблицыОтгрузочныхДокументов);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Функция ЕстьОшибкиЗаполнения()
	
	Отказ = Ложь;
	Для Индекс = 0 По ДокументыОбОтгрузке.Количество() - 1 Цикл
		
		СтрокаТаблицы = ДокументыОбОтгрузке[Индекс];
		
		Если ДатаДокументаОснования < Дата(2021,10,1) Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НомераСтрок) Тогда
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке %1 не указаны номера строк.'"),
				Индекс + 1);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"ДокументыОбОтгрузке["+Индекс+"].НомераСтрок",
				,
				Отказ);                                     
			КонецЕсли;                                      
		КонецЕсли;
			
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НомерДокумента) Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке %1 не указан номер документа.'"),
				Индекс + 1);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"ДокументыОбОтгрузке["+Индекс+"].НомерДокумента",
				,
				Отказ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаДокумента) Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке %1 не указана дата документа.'"),
				Индекс + 1);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"ДокументыОбОтгрузке["+Индекс+"].ДатаДокумента",
				,
				Отказ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НаименованиеДокумента) Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке %1 не указано наименование документа.'"),
				Индекс + 1);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"ДокументыОбОтгрузке["+Индекс+"].НаименованиеДокумента",
				,
				Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ВопросПеренестиВДокументЗавершение(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокумент = Истина;
		Закрыть();
	ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		ПеренестиВДокумент = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти