//Активация
Функция ПроверитьИспользованиеСервиса(ЗапросСервера = Ложь) Экспорт
	
	Используется = Константы.CW_ОбменГИСЭПДИспользуется.Получить(); 
	Если Не Используется Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	Результат = CW_БухгалтерияЭкспедитораСервер.ПроверитьНаличиеПодписки(РегистрационныйНомер, "AF");  
	Если Результат.КодСостояния <> 200 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КонтрольноеСвойство	 = ПолучитьКонтрольноеСвойство();
	ОбязательныеСвойства = ПолучитьМассивСвойств();
	
	ХранилищеНастроек 			= Константы.CW_ОбменГИСЭПДДополнительныеНастройки.Получить(); 
	ФиксированноеСоответствие	= ХранилищеНастроек.Получить();  
	Если ФиксированноеСоответствие = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Соответствие = Новый Соответствие(ФиксированноеСоответствие); 
	
	Если Используется Тогда
		Для Каждого Свойство из ОбязательныеСвойства Цикл
			ЗначениеСвойства = Соответствие.Получить(Свойство);   
			Если ЗначениеСвойства = Неопределено Тогда
				Возврат Ложь;
			КонеЦесли;
		КонецЦикла;            
	КонецЕсли;
	
	Ключ = Соответствие.Получить(КонтрольноеСвойство);
	СтруктураJSON = РасшифроватьКлюч(Ключ);
	
	ОбновитьКлюч = Ложь;
	Если XMLЗначение(Тип("Дата"), СтруктураJSON.datereceipt) < НачалоДня(ТекущаяДата()) Тогда
		//Проверяем один раз в день
		Результат = ПолучитьСведенияОСервисе();  
		Если Результат <> Неопределено Тогда
			ОбновитьКлюч = Истина;  
			СтруктураJSON = РасшифроватьКлюч(Результат.key);
		КонецЕсли;
	КонецЕсли;
	
	//Проверяем стуктуру ключа
	Если XMLЗначение(Тип("Строка"), СтруктураJSON.regnumber) <> РегистрационныйНомер Тогда
		Возврат Ложь;
	КонецЕсли;
	Если XMLЗначение(Тип("Дата"), СтруктураJSON.enddate) < НачалоДня(XMLЗначение(Тип("Дата"), СтруктураJSON.datereceipt)) Тогда
		Возврат Ложь;
	КонецЕсли; 
	Если XMLЗначение(Тип("Булево"), СтруктураJSON.use) <> Истина Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	Если ОбновитьКлюч Тогда
		СтрокаBase64 = ЗашифроватьНовыйКлюч(СтруктураJSON);
		Соответствие.Вставить(КонтрольноеСвойство, СтрокаBase64);  
		
		ФиксированноеСоответствие	= Новый ФиксированноеСоответствие(Соответствие); 
		Константы.CW_ОбменГИСЭПДДополнительныеНастройки.Установить(Новый ХранилищеЗначения(ФиксированноеСоответствие)); 
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСведенияОСервисе()
	
	РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	Если ПустаяСтрока(РегистрационныйНомер) Тогда 
		Возврат Неопределено
	КонецЕсли;
	
	КонтрольноеСвойство = ПолучитьКонтрольноеСвойство();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("service",		"ESD");
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("esd_used", СтруктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");   
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ответ.КодСостояния = 200 Тогда    
		СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);  
		
		СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();  
		
		Возврат СтруктураJSON;
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗавершитьПодклчюениеПодписки(ПараметрыПроцедуры) Экспорт
	
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("Успешно", Ложь);
	
	КонтрольноеСвойство = ПолучитьКонтрольноеСвойство();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(ПараметрыПроцедуры.РегистрационныйНомер));
	СтруктураJSON.Вставить("service",	"ESD");
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("esd_activation", СтруктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");   
	
	Если Ответ = Неопределено Тогда
		
		СтруктураОтвет.Вставить("Сообщение", 	"Отсутствует интернет-соединение!");
		
	Иначе
		
		СтруктураОтвет.Вставить("Успешно",	Ответ.КодСостояния = 200);
		
		Если Ответ.КодСостояния = 200 Тогда   
			
			СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СтрокаJSON);  
			
			СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();     
			
			ЗаписатьКлюч(СтруктураJSON.key);
			Константы.CW_ОбменГИСЭПДИспользуется.Установить(Истина);
			
		Иначе  
			
			Сообщение = Ответ.ПолучитьТелокакСтроку();
			Если ПустаяСтрока(Сообщение) Тогда
				ОписаниеКодовСостояний 	= CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
				Сообщение = "Код ошибки: "+ Ответ.КодСостояния +" - "+ ОписаниеКодовСостояний.Получить(Ответ.КодСостояния); 
			КонецЕсли; 
			
		КонецЕсли; 
		
		СтруктураОтвет.Вставить("Сообщение", Сообщение);
		
	КонецЕсли;    
	
	Возврат СтруктураОтвет;
	
КонецФункции   

Функция ВыполнитьОтключениеСервиса() Экспорт
	
	СтруктураОтвет = Новый Структура;
	СтруктураОтвет.Вставить("Успешно", Ложь);
	
	РегистрационныйНомер		= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("service",		"ESD");
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("esd_disable", СтруктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");   
	
	Если Ответ = Неопределено Тогда
		СтруктураОтвет.Вставить("Сообщение", 	"Отсутствует интернет-соединение!");
	Иначе
		
		СтруктураОтвет.Вставить("Успешно",	Ответ.КодСостояния = 200);
		
		Если Ответ.КодСостояния = 200 Тогда    
			СтрокаJSON = Ответ.ПолучитьТелоКакСтроку();
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СтрокаJSON);  
			
			СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();  
			
			ЗаписатьКлюч(СтруктураJSON.key);
			
			Константы.CW_ОбменГИСЭПДИспользуется.Установить(Ложь);
			
		Иначе  
			
			Сообщение = Ответ.ПолучитьТелокакСтроку();
			Если ПустаяСтрока(Сообщение) Тогда
				ОписаниеКодовСостояний 	= CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
				Сообщение = "Код ошибки: "+ Ответ.КодСостояния +" - "+ ОписаниеКодовСостояний.Получить(Ответ.КодСостояния); 
			КонецЕсли; 
			
		КонецЕсли; 
		
		СтруктураОтвет.Вставить("Сообщение", Сообщение);
		
	КонецЕсли;    
	
	Возврат СтруктураОтвет;
	
КонецФункции

Процедура ЗаписатьКлюч(Знач Ключ)
	
	КонтрольноеСвойство = ПолучитьКонтрольноеСвойство();
	
	МассивСвойств 	= ПолучитьМассивСвойств();
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(КонтрольноеСвойство, Ключ);  
	
	Для Индекс = 0 По МассивСвойств.ВГраница() Цикл   
		
		ПотокВПамяти 	  = Новый ПотокВПамяти;  
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(Сред(Ключ, Индекс+1));  
		ТекстовыйДокумент.Записать(ПотокВПамяти);
		ДвоичныеДанные 	= ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
		
		Свойсттво 			= МассивСвойств.Получить(Индекс);
		ЗначениеСвойства 	= Base64Строка(ДвоичныеДанные);
		Соответствие.Вставить(Свойсттво, ЗначениеСвойства);  
	КонецЦикла;
	
	ФиксированноеСоответствие = Новый ФиксированноеСоответствие(Соответствие); 
	
	Константы.CW_ОбменГИСЭПДДополнительныеНастройки.Установить(Новый ХранилищеЗначения(ФиксированноеСоответствие));
	
КонецПроцедуры

Функция РасшифроватьКлюч(Знач Ключ)
	
	ДвоичныеДанные 		= Base64Значение(Ключ);  
	ПотокВПамяти 		= ДвоичныеДанные.ОткрытьПотокДляЧтения();
	ТекстовыйДокумент 	= Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ПотокВПамяти);
	
	СтрокаJSON = ТекстовыйДокумент.ПолучитьТекст();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);  
	
	//СтруктураJSON: regnumber, service,id,enddate,use,datereceipt
	СтруктураJSON = ПрочитатьJSON(ЧтениеJSON); 
	ЧтениеJSON.Закрыть();  
	
	Возврат СтруктураJSON;
	
КонецФункции 

Функция ЗашифроватьНовыйКлюч(Знач СтруктураJSON)
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);	  
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураJSON);
	
	СтрокаJSON = ЗаписьJSON.Закрыть(); 
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(СтрокаJSON);    
	
	ПотокВПамяти = Новый ПотокВПамяти;
	ТекстовыйДокумент.Записать(ПотокВПамяти);
	
	ДвоичныеДанные 	= ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();
	СтрокаBase64 	= Base64Строка(ДвоичныеДанные);
	
	Возврат СтрокаBase64;
	
КонецФункции

Функция ПолучитьКонтрольноеСвойство()
	
	Возврат "80b58106-9e02-4329-8f72-1ec8a0446b16";
	
КонецФункции 

Функция ПолучитьМассивСвойств()
	
	Массив = Новый Массив;
	Массив.Добавить("7155fcf5-1914-466e-8b8f-415e2dbbfdb6");
	Массив.Добавить("54b04fc6-04ab-4e71-a097-f2aa1841f922");
	Массив.Добавить("65f69387-c047-4564-b829-416544ad54fa");
	
	Возврат Массив; 
	
КонецФункции

Функция ПодсистемаИспользуется() Экспорт
	
	Возврат ПроверитьИспользованиеСервиса();
	
КонецФункции   
//Активация  

//Перенаправляемые процедуры
Процедура ПолучитьПечатнуюФормуСчета(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьПечатнуюФормуСчета(ПараметрыПроцедуры, АдресРезультата);
	
КонецПроцедуры

Процедура ПолучитьПечатнуюФормуАкта(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	CW_ОбщийМодульЛичныйКабинетСервер.ПолучитьПечатнуюФормуАкта(ПараметрыПроцедуры, АдресРезультата);
	
КонецПроцедуры   

Процедура ВыполнитьОтменуСчетов(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	CW_ОбщийМодульЛичныйКабинетСервер.ВыполнитьОтменуСчетов(ПараметрыПроцедуры, АдресРезультата);
	
КонецПроцедуры
//Перенаправляемые процедуры

Функция ПолучитьДоступныеТипыДокументовЭДО() Экспорт
	
	ТипыДокументовЭПД = Новый Массив;
	ТипыДокументовЭПД.Добавить(Перечисления.ТипыДокументовЭДО.ЭЗЗ);
	ТипыДокументовЭПД.Добавить(Перечисления.ТипыДокументовЭДО.ЭТрН);
	ТипыДокументовЭПД.Добавить(Перечисления.ТипыДокументовЭДО.ЭПЛ);
	//ТипыДокументовЭПД.Добавить(Перечисления.ТипыДокументовЭДО.ЭСВ);
	
	Возврат ТипыДокументовЭПД;
	
КонецФункции   

Функция ПолучитьСтруктуруПараметровДокументовЭПД(Знач ТипыДокументовЭПД) Экспорт
	
	ТипыЭлементовРегламентаЭДО = Перечисления.ТипыЭлементовРегламентаЭДО;
	
	Настройки = Новый Соответствие;     
	
	Для Каждого ТипДокумента из ТипыДокументовЭПД Цикл
		
		Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭЗЗ") Тогда  
			ПараметрыДокументаЭПД = СтруктураПараметровЭЗЗ(ТипДокумента, ТипыЭлементовРегламентаЭДО);
			
			Настройки.Вставить(ТипДокумента, ПараметрыДокументаЭПД);
		КонецЕсли;     
		
		Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭТрН") Тогда  
			ПараметрыДокументаЭПД = СтруктураПараметровЭТрН(ТипДокумента, ТипыЭлементовРегламентаЭДО);
			
			Настройки.Вставить(ТипДокумента, ПараметрыДокументаЭПД);
		КонецЕсли;
		
		Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭПЛ") Тогда  
			ПараметрыДокументаЭПД = СтруктураПараметровЭПЛ(ТипДокумента, ТипыЭлементовРегламентаЭДО);
			
			Настройки.Вставить(ТипДокумента, ПараметрыДокументаЭПД);
		КонецЕсли; 
		
		Если ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭСВ") Тогда  
			ПараметрыДокументаЭПД = СтруктураПараметровЭСВ(ТипДокумента, ТипыЭлементовРегламентаЭДО);
			
			Настройки.Вставить(ТипДокумента, ПараметрыДокументаЭПД);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Настройки;
	
КонецФункции

Функция СтруктураПараметровЭТрН(Знач ТипДокумента, Знач ТипыЭлементовРегламентаЭДО)
	
	ЭТрН_Титулы = Новый Массив;
	ЭТрН_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1);
	//ЭТрН_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул2);   
	//ЭТрН_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул3);   
	//ЭТрН_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул4);   
	
	ЭТрН_Макеты = Новый Соответствие;
	ЭТрН_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1, "ЭТрН_Титул1");
	//ЭТрН_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул2, "ЭТрН_Титул2");   
	//ЭТрН_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул3, "ЭТрН_Титул3");
	//ЭТрН_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул4, "ЭТрН_Титул4");   
	
	ЭТрН_Макеты_Настройки = Новый Соответствие;
	ЭТрН_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1, "Настройки_ЭТрН_Титул1");
	//ЭТрН_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул2, "Настройки_ЭТрН_Титул2");   
	//ЭТрН_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул3, "Настройки_ЭТрН_Титул3");
	//ЭТрН_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭТрН_Титул4, "Настройки_ЭТрН_Титул4");   
	
	ПараметрыДокументаЭПД = Новый Структура;
	ПараметрыДокументаЭПД.Вставить("Титулы", 	Новый ФиксированныйМассив(ЭТрН_Титулы)); 
	ПараметрыДокументаЭПД.Вставить("Макеты", 	Новый ФиксированноеСоответствие(ЭТрН_Макеты)); 
	ПараметрыДокументаЭПД.Вставить("Настройки", Новый ФиксированноеСоответствие(ЭТрН_Макеты_Настройки)); 
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыДокументаЭПД);

КонецФункции

Функция СтруктураПараметровЭЗЗ(Знач ТипДокумента, Знач ТипыЭлементовРегламентаЭДО)
	
	ЭЗЗ_Титулы = Новый Массив;
	ЭЗЗ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1);
	ЭЗЗ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2);   
	
	ЭЗЗ_Макеты = Новый Соответствие;
	ЭЗЗ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1, "ЭЗЗ_Титул1");
	ЭЗЗ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2, "ЭЗЗ_Титул2");   
	
	ЭЗЗ_Макеты_Настройки = Новый Соответствие;
	ЭЗЗ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1, "Настройки_ЭЗЗ_Титул1");
	ЭЗЗ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2, "Настройки_ЭЗЗ_Титул2");   
	
	ПараметрыДокументаЭПД = Новый Структура;
	ПараметрыДокументаЭПД.Вставить("Титулы", 	Новый ФиксированныйМассив(ЭЗЗ_Титулы)); 
	ПараметрыДокументаЭПД.Вставить("Макеты", 	Новый ФиксированноеСоответствие(ЭЗЗ_Макеты)); 
	ПараметрыДокументаЭПД.Вставить("Настройки", Новый ФиксированноеСоответствие(ЭЗЗ_Макеты_Настройки)); 
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыДокументаЭПД);

КонецФункции

Функция СтруктураПараметровЭПЛ(Знач ТипДокумента, Знач ТипыЭлементовРегламентаЭДО)
	
	ЭПЛ_Титулы = Новый Массив;
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1);
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул2);   
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул3);   
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул4);   
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул5);   
	
	ЭПЛ_Макеты = Новый Соответствие;
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1, "ЭПЛ_Титул1");
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул2, "ЭПЛ_Титул2");   
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул3, "ЭПЛ_Титул3");
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул4, "ЭПЛ_Титул4");   
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул5, "ЭПЛ_Титул5");   
	
	ЭПЛ_Макеты_Настройки = Новый Соответствие;
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1, "Настройки_ЭПЛ_Титул1");
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул2, "Настройки_ЭПЛ_Титул2");   
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул3, "Настройки_ЭПЛ_Титул3");
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул4, "Настройки_ЭПЛ_Титул4");   
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул5, "Настройки_ЭПЛ_Титул5");   
	
	ПараметрыДокументаЭПД = Новый Структура;
	ПараметрыДокументаЭПД.Вставить("Титулы", 	Новый ФиксированныйМассив(ЭПЛ_Титулы)); 
	ПараметрыДокументаЭПД.Вставить("Макеты", 	Новый ФиксированноеСоответствие(ЭПЛ_Макеты)); 
	ПараметрыДокументаЭПД.Вставить("Настройки", Новый ФиксированноеСоответствие(ЭПЛ_Макеты_Настройки)); 
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыДокументаЭПД);

КонецФункции      

Функция СтруктураПараметровЭСВ(Знач ТипДокумента, Знач ТипыЭлементовРегламентаЭДО)
	
	ЭПЛ_Титулы = Новый Массив;
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_1);
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_2);   
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_3);   
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_4);   
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_5);   
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул2_1);   
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул2_2);   
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул3_1);   
	ЭПЛ_Титулы.Добавить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул3_2);   
	
	ЭПЛ_Макеты = Новый Соответствие;
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_1, "ЭСВ_Титул1_1");
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_2, "ЭСВ_Титул1_2");   
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_3, "ЭСВ_Титул1_3");
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_4, "ЭСВ_Титул1_4");
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_5, "ЭСВ_Титул1_5");
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул2_1, "ЭСВ_Титул2_1");
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул2_2, "ЭСВ_Титул2_2");
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул3_1, "ЭСВ_Титул3_1");
	ЭПЛ_Макеты.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул3_2, "ЭСВ_Титул3_2");
	
	ЭПЛ_Макеты_Настройки = Новый Соответствие;
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_1, "Настройки_ЭСВ_Титул1_1");
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_2, "Настройки_ЭСВ_Титул1_2");   
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_3, "Настройки_ЭСВ_Титул1_3");
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_4, "Настройки_ЭСВ_Титул1_4");
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_5, "Настройки_ЭСВ_Титул1_5");
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул2_1, "Настройки_ЭСВ_Титул2_1");
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул2_2, "Настройки_ЭСВ_Титул2_2");
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул3_1, "Настройки_ЭСВ_Титул3_1");
	ЭПЛ_Макеты_Настройки.Вставить(ТипыЭлементовРегламентаЭДО.ЭСВ_Титул3_2, "Настройки_ЭСВ_Титул3_2");

	ПараметрыДокументаЭПД = Новый Структура;
	ПараметрыДокументаЭПД.Вставить("Титулы", 	Новый ФиксированныйМассив(ЭПЛ_Титулы)); 
	ПараметрыДокументаЭПД.Вставить("Макеты", 	Новый ФиксированноеСоответствие(ЭПЛ_Макеты)); 
	ПараметрыДокументаЭПД.Вставить("Настройки", Новый ФиксированноеСоответствие(ЭПЛ_Макеты_Настройки)); 
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыДокументаЭПД);

КонецФункции 



Функция ПолучитьМассивСвойствСтруктуры(ТипДокумента, ТекущийТитул) Экспорт
	
	Макет = CW_ОбменГИСЭПДПереопределяемый.МакетСоответствийИменРеквизитов(ТипДокумента);
	
	ИнформацияПоПрефиксамТитула = CW_ОбменГИСЭПДПереопределяемый.ПрефиксТитулаПоЭлементуРегламентаЭДО(ТекущийТитул);
	ПрефиксТитула = ИнформацияПоПрефиксамТитула.ВПрограмме;
	
	Массив = Новый Массив;
	
	ОбластьМакета = Макет.ПолучитьОбласть(ПрефиксТитула); 
	Для Строка = 1 по ОбластьМакета.ВысотаТаблицы Цикл 
		ИмяРеквизита = СокрЛП(ОбластьМакета.Область(Строка, 1, Строка, 1).Текст);
		ИмяРеквизита = СтрЗаменить(ИмяРеквизита, ".", "_");
		
		Массив.Добавить(ИмяРеквизита);	
	КонецЦикла; 
	
	Возврат Массив;
	
КонецФункции

Функция ЗаписываемыеПоляПоТитулу(Титул)

	ДанныеПолей = Новый Массив;
	
	Если Титул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1 Тогда
		ДанныеПолей.Добавить("ТитулГрузоотправителяЗаказДата");
		ДанныеПолей.Добавить("ТитулГрузоотправителяЗаявленныеДатаВремяПодачи");
		ДанныеПолей.Добавить("ТитулГрузоотправителяФункция");
		ДанныеПолей.Добавить("СсылкаТитулГрузоотправителяГрузоотправитель");
		ДанныеПолей.Добавить("СсылкаТитулГрузоотправителяГрузополучатель");
		ДанныеПолей.Добавить("СсылкаТитулГрузоотправителяПеревозчик");
		ДанныеПолей.Добавить("СсылкаТитулГрузоотправителяСоставитель");
		ДанныеПолей.Добавить("ВариантПоДоверенностиЗаГрузоотправителя");
	КонецЕсли; 
	
	Возврат ДанныеПолей;
	
КонецФункции   

Функция ПустаяСтруктураАдерса() Экспорт
	
	СтруктураРеквизитовАдреса = Новый Структура;
	СтруктураРеквизитовАдреса.Вставить("Индекс", "");
	СтруктураРеквизитовАдреса.Вставить("КодРегиона", "");
	СтруктураРеквизитовАдреса.Вставить("Город", "");
	СтруктураРеквизитовАдреса.Вставить("Район", "");
	СтруктураРеквизитовАдреса.Вставить("НаселенныйПункт", "");
	СтруктураРеквизитовАдреса.Вставить("Улица", "");
	СтруктураРеквизитовАдреса.Вставить("Дом", "");
	СтруктураРеквизитовАдреса.Вставить("Корпус", ""); 
	
	Возврат СтруктураРеквизитовАдреса;
	
КонецФункции

Функция ПолучитьРеквизитыУчастника(Участник, ПрефиксРеквизитов, ПрефиксТитула = Неопределено) Экспорт
	
	ПостфиксТелефоны = "НомераТелефонов";
	ПостфиксЭлПочта = "АдресаЭлектроннойПочты";
	
	ЕстьТелефоны = Ложь;
	ЕстьЭлПочта = Ложь;
	Если ПрефиксРеквизитов <> "Заказчик" Тогда
		ЕстьТелефоны = Истина;
		ЕстьЭлПочта = Истина;
	КонецЕсли;
	
	ПрефиксПодчиненныхТаблиц = "";
	Если ПрефиксТитула <> Неопределено И СтрНачинаетсяС(ПрефиксРеквизитов, ПрефиксТитула) = Ложь Тогда
		ПрефиксПодчиненныхТаблиц = ПрефиксТитула;
	КонецЕсли;
	
	РеквизитыУчастника = CW_ОбменГИСЭПДПереопределяемый.ПолучитьРеквизитыУчастника(Участник, Ложь);
	
	ПрефиксКонтактов = "";
	ПрефиксАдреса = "";
	Если ПрефиксРеквизитов = "ТитулФрахтователяФрахтователь"
		Или ПрефиксРеквизитов = "ТитулФрахтователяФрахтовщик"
		Или ПрефиксРеквизитов = "ТитулФрахтователяСоставитель"
		Или ПрефиксРеквизитов = "ТитулФрахтовщикаСоставитель" Тогда
		Если РеквизитыУчастника.Свойство("ЮЛ_ИНН") И ЗначениеЗаполнено(РеквизитыУчастника.ЮЛ_ИНН) Тогда
			ПрефиксКонтактов = "ЮЛ";
			ПрефиксАдреса = "ЮЛ";
		Иначе
			ПрефиксКонтактов = "ФЛ";
			ПрефиксАдреса = Неопределено;
		КонецЕсли;
	ИначеЕсли ПрефиксРеквизитов = "ТитулФрахтовщикаФрахтовщик"
		Или ПрефиксРеквизитов = "ТитулПеревозчикаПеревозчик"
		Или ПрефиксРеквизитов = "ТитулПеревозчикаГрузоотправитель"
		Или ПрефиксРеквизитов = "ТитулПеревозчикаГрузополучатель"
		Или ПрефиксРеквизитов = "ТитулПеревозчикаЛицоОсуществляющееПогрузку"
		Или ПрефиксРеквизитов = "ТитулПеревозчикаЛицоОсуществляющееПриемку"
		Или ПрефиксРеквизитов = "ДопТитулПеревозчикаПеревозчик"
		Или ПрефиксРеквизитов = "ДопТитулПеревозчикаГрузоотправитель"
		Или ПрефиксРеквизитов = "ДопТитулПеревозчикаГрузополучатель"
		Или ПрефиксРеквизитов = "ДопТитулПеревозчикаЛицоОсуществляющееПогрузку"
		Или ПрефиксРеквизитов = "ДопТитулПеревозчикаЛицоОсуществляющееПриемку" Тогда
		Если (РеквизитыУчастника.Свойство("ЮЛ_ИНН") И ЗначениеЗаполнено(РеквизитыУчастника.ЮЛ_ИНН))
			ИЛИ (РеквизитыУчастника.Свойство("ЮЛ_КПП") И ЗначениеЗаполнено(РеквизитыУчастника.ЮЛ_КПП)) Тогда
			ПрефиксКонтактов = "ЮЛ";
			ПрефиксАдреса = "ЮЛ";
		Иначе
			ПрефиксКонтактов = "ИП";
			ПрефиксАдреса = Неопределено;
		КонецЕсли;	
	КонецЕсли;
	
	СтруктураДляЗаполнения = Новый Структура;
	Для Каждого КиЗ Из РеквизитыУчастника Цикл
		Если КиЗ.Ключ <> ПостфиксТелефоны И КиЗ.Ключ <> ПостфиксЭлПочта Тогда
			Если СтрНачинаетсяС(КиЗ.Ключ, "Адрес") И ПрефиксАдреса <> Неопределено Тогда
				КороткоеИмя = ПрефиксАдреса + КиЗ.Ключ;	
			Иначе
				КороткоеИмя = КиЗ.Ключ
			КонецЕсли;
			МассивЧастей = СтрРазделить(ПрефиксРеквизитов, "_");
			ИмяРеквизита = МассивЧастей[МассивЧастей.ВГраница()] + КороткоеИмя;
			СтруктураДляЗаполнения.Вставить(ИмяРеквизита, КиЗ.Значение);
		КонецЕсли;
	КонецЦикла;
	
    Возврат СтруктураДляЗаполнения;
	
КонецФункции

Процедура УстановитьПараметрыТиповДокументовЭПД(Форма) Экспорт
	
	ТипыДокументовЭПД = CW_ОбменГИСЭПДДополнительный.ПолучитьДоступныеТипыДокументовЭДО(); 
	СтруктураПараметрыДокументовЭПД = CW_ОбменГИСЭПДДополнительный.ПолучитьСтруктуруПараметровДокументовЭПД(ТипыДокументовЭПД);
	
	Форма.ПараметрыДокументовЭПД 		= Новый ФиксированноеСоответствие(СтруктураПараметрыДокументовЭПД);
	Форма.ДоступныеТипыДокументовЭПД 	= Новый ФиксированныйМассив(ТипыДокументовЭПД);
	
	Форма.Элементы.ТипДокументаЭПД.СписокВыбора.ЗагрузитьЗначения(ТипыДокументовЭПД);

КонецПроцедуры


Процедура УстановитьСписокВыбораТитула(Форма) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементыФормы.ТекущийТитул.СписокВыбора.Очистить();   
	Если Форма.ПараметрыДокументовЭПД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДокументаЭПД = Форма.ПараметрыДокументовЭПД.Получить(Форма.Объект.ТипДокументаЭПД); 
	Если ТипЗнч(ПараметрыДокументаЭПД) = Тип("ФиксированнаяСтруктура") тогда   
		ЭлементыФормы.ТекущийТитул.СписокВыбора.ЗагрузитьЗначения(Новый Массив(ПараметрыДокументаЭПД["Титулы"]));
	КонецЕсли; 
	
КонецПроцедуры 

Процедура ЗаполнитьДоступныеТипыОбъектов(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Элементы.ТипОбъекта.СписокВыбора.Очистить();
	
	Массив = Метаданные.ОпределяемыеТипы.CW_ОбменГИСЭПД_ОснованияЭПД.Тип.Типы();

	Если Не ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокаСобственногоТранспорта") Тогда
		Массив.Удалить(Тип("ДокументСсылка.CW_ПутевойЛист"));                               
	КонецЕсли;
	
	Идентификаторы = ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(Массив);
	Для Каждого КлючЗначение из Идентификаторы Цикл
		Элементы.ТипОбъекта.СписокВыбора.Добавить(КлючЗначение.Значение);
	КонецЦикла;

КонецПроцедуры  

Функция ПолучитьСхемуКомпоновкиДанных(ИдентификаторОбъектаМетаданных) Экспорт
	
	Схема = ПолучитьОбщийМакет("CW_ОбменГИСЭПДСхемаОтбора");  
	НаборДанных = Схема.НаборыДанных.Получить(0);              
	НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "//ТипОбъекта", ИдентификаторОбъектаМетаданных.ПолноеИмя); 
	
	ПолеСсылка = НаборДанных.Поля[0];
	ПолеСсылка.Заголовок = ИдентификаторОбъектаМетаданных.Синоним;
	
	Возврат Схема;

КонецФункции

Процедура ПолучитьДанныеДокументаЭПД(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	ПараметрКоманды	= ПараметрыПроцедуры.ПараметрКоманды;;
	РезультатВыбора	= ПараметрыПроцедуры.РезультатВыбора; 

	КонтактнаяИнформация = Новый Структура;
	
	ИмяДокумента 			= CW_ОбменГИСЭПДПереопределяемый.ИмяДокументаПоТипу(РезультатВыбора.ТипДокументаЭПД);
	ТипыДокументовЭПД 		= CW_ОбменГИСЭПДДополнительный.ПолучитьДоступныеТипыДокументовЭДО(); 
	ПараметрыДокументовЭПД 	= CW_ОбменГИСЭПДДополнительный.ПолучитьСтруктуруПараметровДокументовЭПД(ТипыДокументовЭПД);
	ВидДокумента 			= ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(РезультатВыбора.ТипДокументаЭПД);
	
	ПараметрыДокументаЭПД 	= ПараметрыДокументовЭПД.Получить(РезультатВыбора.ТипДокументаЭПД);
	ИмяМакета 				= ПараметрыДокументаЭПД["Макеты"].Получить(РезультатВыбора.ТекущийТитул); 
	МакетЭПД 				= Справочники.CW_ОбменГИСЭПДПроформыТитуловЭПД.ПолучитьМакет(ИмяМакета);
	
	ИнформацияПоПрефиксамТитула = CW_ОбменГИСЭПДПереопределяемый.ПрефиксТитулаПоЭлементуРегламентаЭДО(РезультатВыбора.ТекущийТитул);
	ПрефиксТитула 				= ИнформацияПоПрефиксамТитула.ВПрограмме;

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(МакетЭПД); 
	
	Для Каждого Область из ТабличныйДокумент.Области Цикл
		Если СтрНайти(Область.Имя, "Титул") > 0
			И СтрНайти(Область.Имя, "ИдентификаторСтроки") = 0 Тогда
			Область.Значение = Область.ТипЗначения.ПривестиЗначение(Неопределено);
		КонецЕсли;
	КонецЦикла;    
	
	УстановитьИдентификаторыСтрок(РезультатВыбора.ТекущийТитул, ТабличныйДокумент, "_1"); 
	УстановитьИдентификаторыСтрок(РезультатВыбора.ТекущийТитул, ТабличныйДокумент, "_2"); 
	УстановитьИдентификаторыСтрок(РезультатВыбора.ТекущийТитул, ТабличныйДокумент, "_3"); 

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ТекущийТитул", 		РезультатВыбора.ТекущийТитул);
	ДанныеЗаполнения.Вставить("ТипДокументаЭПД", 	РезультатВыбора.ТипДокументаЭПД);
	ДанныеЗаполнения.Вставить("ВидДокумента", 		ВидДокумента);
	ДанныеЗаполнения.Вставить("ОбъектОснование", 	ПараметрКоманды); 
	
	РезультатВыполненя = Новый Структура;
	РезультатВыполненя.Вставить("Макет", 				ТабличныйДокумент);
	РезультатВыполненя.Вставить("КонтактнаяИнформация", КонтактнаяИнформация);  
	РезультатВыполненя.Вставить("ДанныеЗаполнения", 	ДанныеЗаполнения);  
	
	//Получаем Соответствие реквизитов  
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ОбменГИСЭПДНастройкиЗаполненияЭПД КАК CW_ОбменГИСЭПДНастройкиЗаполненияЭПД
	|ГДЕ
	|	CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.ТипДокументаЭПД = &ТипДокументаЭПД
	|	И CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.ТекущийТитул = &ТекущийТитул
	|	И CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.ТипОбъекта = &ТипОбъекта
	|	И CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.ПометкаУдаления = ЛОЖЬ
	|	И CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.Основная = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТипДокументаЭПД", 	РезультатВыбора.ТипДокументаЭПД);
	Запрос.УстановитьПараметр("ТекущийТитул", 		РезультатВыбора.ТекущийТитул);
	Запрос.УстановитьПараметр("ТипОбъекта", 		РезультатВыбора.ТипОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		ПоместитьВоВременноеХранилище(РезультатВыполненя, АдресРезультата); 
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.ИмяОбласти КАК ИмяОбласти,
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.АлгоритмЗаполнения КАК АлгоритмЗаполнения
	|ИЗ
	|	РегистрСведений.CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД КАК CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД
	|ГДЕ
	|	CW_ОбменГИСЭПДЗначенияНастроекЗаполненияЭПД.НастройкаЗаполнения = &НастройкаЗаполнения";  
	
	Запрос.УстановитьПараметр("НастройкаЗаполнения", Выборка.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПоместитьВоВременноеХранилище(РезультатВыполненя, АдресРезультата); 
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитов	= Новый Структура;  

	мОбластиАдресов		= CW_ОбменГИСЭПДСерверВызовСервера.СписокОбластейАдресов(РезультатВыбора.ТекущийТитул);    
	
	ПолнаяТаблицаНастроек = РезультатЗапроса.Выгрузить(); 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяТабличнойЧасти", "");
	ТаблицаНастроек = ПолнаяТаблицаНастроек.НайтиСтроки(Отбор); 
	
	Для Каждого СтрокаТаблицы из ТаблицаНастроек Цикл      
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.АлгоритмЗаполнения) Тогда
			Продолжить;
		Конецесли;   
		
		ИмяОбласти = СтрокаТаблицы.ИмяОбласти; 
		
		ВычисляемаяФункция = ПолучитьВычисляемуюФункциюЯчейки(ПараметрКоманды, РезультатВыбора.ТипОбъекта, СтрокаТаблицы.АлгоритмЗаполнения);
		Если ВычисляемаяФункция = Неопределено Тогда
			Продолжить;
		КонецЕсли;    
		
		Если ВычисляемаяФункция.ВозвращаемоеЗначение = Перечисления.CW_ОбменГИСЭПДВидыРезультатов.ЗначениеРеквизита Тогда
			
			ПараметрыФункции = Новый Структура;
			ПараметрыФункции.Вставить("ВычисляемаяФункция", ВычисляемаяФункция);
			ПараметрыФункции.Вставить("ПараметрКоманды",	ПараметрКоманды);
			ПараметрыФункции.Вставить("ТипОбъекта",			РезультатВыбора.ТипОбъекта); 
			
			ЗначениеЯчейки = ВычислитьЗначениеЯчейки(ПараметрыФункции);
			
			Область = ТабличныйДокумент.Области.Найти(ИмяОбласти);
			Если Область <> Неопределено Тогда 
				
				Если ЗначениеЗаполнено(ЗначениеЯчейки) Тогда
					
					Область.Значение = ЗначениеЯчейки;
					
					ИмяОбластиБезПрефикса = ИмяОбластиБезПрефикса(Область.Имя);
					Если мОбластиАдресов.Найти(ИмяОбластиБезПрефикса) <> Неопределено Тогда 
						
						ИндексСтроки	= ИндексПоказателя(Область.Имя);
						СтрокаСИндексом = СтрокаСИндексомПоказателя(ИндексСтроки);  
						
						Если ТипЗнч(ЗначениеЯчейки) = Тип("Строка") Тогда  
							Если СтрНачинаетсяС(ЗначениеЯчейки, "<КонтактнаяИнформация xmlns") Тогда
								КонтактнаяИнформацияАдреса = ЗначениеЯчейки;
							Иначе
								ПараметрыАдреса = РаботаСАдресами.РазложитьПредставлениеАдресаПоПолям(ЗначениеЯчейки);
								КонтактнаяИнформацияАдреса = ОбменСГИСЭПДВызовСервера.КонтактнаяИнформацияВXML(
									ПараметрыАдреса,
									ЗначениеЯчейки,
									ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
							КонецЕсли;
						КонецЕсли;
						
						СтруктураПараметров = Новый Структура("БезПредставлений, ПроверитьАдрес, КодыАдреса", Ложь, Истина, Истина);
						СтруктураАдреса = CW_ОбменГИСЭПДСерверВызовСервера.СведенияОбАдресе(КонтактнаяИнформацияАдреса, СтруктураПараметров);
						
						СтруктураРеквизитовАдреса = ПолучитьРеквизитыАдреса(СтруктураАдреса, ИмяОбластиБезПрефикса, СтрокаСИндексом);
						СтруктураРеквизитовАдреса.Вставить(Область.Имя, СтруктураАдреса.Представление);   
						
						ДанныеАдреса = Новый Структура;
						ДанныеАдреса.Вставить("КонтактнаяИнформация", 		КонтактнаяИнформацияАдреса);
						ДанныеАдреса.Вставить("СтруктураАдреса",			СтруктураАдреса); 
						ДанныеАдреса.Вставить("СтруктураРеквизитовАдреса",	СтруктураРеквизитовАдреса); 
						
						КонтактнаяИнформация.Вставить(Область.Имя, ДанныеАдреса);  
						
						Область.Значение = СтруктураАдреса.Представление;
						
					КонецЕсли;
					
					ЗначенияРеквизитов.Вставить(ИмяОбласти, Область.Значение);  

				КонецЕсли;

			КонецЕсли; 
			
		КонецЕсли;
		
		Если ВычисляемаяФункция.ВозвращаемоеЗначение = Перечисления.CW_ОбменГИСЭПДВидыРезультатов.ТабличнаяЧасть Тогда
			
			ОтборМногострочнаяЧасть = Новый Структура;
			ОтборМногострочнаяЧасть.Вставить("ИмяТабличнойЧасти", ИмяОбласти);
			
			НайденныеСтроки = ПолнаяТаблицаНастроек.НайтиСтроки(ОтборМногострочнаяЧасть);
			Если НайденныеСтроки.Количество() =0 Тогда 
				//Неправильная настройка
				Продолжить;
			КонецЕсли;  
			
			ПараметрыФункции = Новый Структура;
			ПараметрыФункции.Вставить("ВычисляемаяФункция", ВычисляемаяФункция);
			ПараметрыФункции.Вставить("ПараметрКоманды",	ПараметрКоманды);
			ПараметрыФункции.Вставить("ТипОбъекта",			РезультатВыбора.ТипОбъекта); 
			
			МассивСтрок = ПолучитьМассивСтрок(ПараметрыФункции);
			
			Для Индекс = 0 по МассивСтрок.ВГраница() Цикл
				
				Если Индекс > 0 Тогда
					ДобавитьСтроку(РезультатВыбора.ТекущийТитул, ТабличныйДокумент, Индекс, ИмяОбласти, МакетЭПД);  
				КонецЕсли;
				
				НовыйПараметрКоманды = МассивСтрок.Получить(Индекс);
				
				Для каждого СтрокаМногострочнойЧасти из НайденныеСтроки Цикл   
					
					НовыйТипОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(НовыйПараметрКоманды));
					НомерСтроки 	=  Индекс + 1;
					НоваяВычисляемаяФункция = ПолучитьВычисляемуюФункциюЯчейки(НовыйПараметрКоманды, НовыйТипОбъекта, СтрокаМногострочнойЧасти.АлгоритмЗаполнения, НомерСтроки);
					Если НоваяВычисляемаяФункция = Неопределено Тогда
						Продолжить;
					КонецЕсли;    
					
					НовыеПараметрыФункции = Новый Структура;
					НовыеПараметрыФункции.Вставить("ВычисляемаяФункция", 	НоваяВычисляемаяФункция);
					НовыеПараметрыФункции.Вставить("ПараметрКоманды",		НовыйПараметрКоманды);
					НовыеПараметрыФункции.Вставить("ТипОбъекта",			НовыйТипОбъекта); 
					НовыеПараметрыФункции.Вставить("НомерСтроки",			Индекс+1); 
					
					ЗначениеЯчейки = ВычислитьЗначениеЯчейки(НовыеПараметрыФункции); 
					
					ДопИндекс 		= "";
					НовИндекс 		= СтрокаСИндексомПоказателя(Индекс+1);
					
					ПривОбластьИмя 	= ПривестиИмяОбласти(СтрокаМногострочнойЧасти.ИмяОбласти);
					ЧастиИмени 		= СтрРазделить(ПривОбластьИмя, "_");   
					Если ЧастиИмени.Количество() = 4 Тогда
						ДопИндекс = "_"+ЧастиИмени[2]; 
					КонецЕсли;
					
					ИмяРеквизита 	= ВостановитьПриведенноеИмяРеквизита(ЧастиИмени[1]);
					НовИмяОбласти 	= ЧастиИмени[0]+"_"+ИмяРеквизита+ДопИндекс+ НовИндекс;
					
					Область = ТабличныйДокумент.Области.Найти(НовИмяОбласти);
					Если Область <> Неопределено Тогда
						Если ЗначениеЗаполнено(ЗначениеЯчейки) Тогда
							
							Область.Значение = ЗначениеЯчейки;  
							
							ИмяОбластиБезПрефикса = ИмяОбластиБезПрефикса(Область.Имя);
							Если мОбластиАдресов.Найти(ИмяОбластиБезПрефикса) <> Неопределено Тогда  
								
								ИндексСтроки	= ИндексПоказателя(Область.Имя);
								СтрокаСИндексом = СтрокаСИндексомПоказателя(ИндексСтроки);
								
								Если ТипЗнч(ЗначениеЯчейки) = Тип("Строка") Тогда  
									Если СтрНачинаетсяС(ЗначениеЯчейки, "<КонтактнаяИнформация xmlns") Тогда
										КонтактнаяИнформацияАдреса = ЗначениеЯчейки;
									Иначе
										ПараметрыАдреса = РаботаСАдресами.РазложитьПредставлениеАдресаПоПолям(ЗначениеЯчейки);
										КонтактнаяИнформацияАдреса = ОбменСГИСЭПДВызовСервера.КонтактнаяИнформацияВXML(
										ПараметрыАдреса,
										ЗначениеЯчейки,
										ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"));
									КонецЕсли;
								КонецЕсли;
								
								СтруктураПараметров = Новый Структура("БезПредставлений, ПроверитьАдрес, КодыАдреса", Ложь, Истина, Истина);
								СтруктураАдреса = CW_ОбменГИСЭПДСерверВызовСервера.СведенияОбАдресе(КонтактнаяИнформацияАдреса, СтруктураПараметров);
								
								СтруктураРеквизитовАдреса = ПолучитьРеквизитыАдреса(СтруктураАдреса, ИмяОбластиБезПрефикса, СтрокаСИндексом);
								СтруктураРеквизитовАдреса.Вставить(Область.Имя, СтруктураАдреса.Представление);
								
								ДанныеАдреса = Новый Структура;
								ДанныеАдреса.Вставить("КонтактнаяИнформация", 		КонтактнаяИнформацияАдреса);
								ДанныеАдреса.Вставить("СтруктураАдреса",			СтруктураАдреса); 
								ДанныеАдреса.Вставить("СтруктураРеквизитовАдреса",	СтруктураРеквизитовАдреса); 
								
								КонтактнаяИнформация.Вставить(Область.Имя, ДанныеАдреса);  
								
								Область.Значение = СтруктураАдреса.Представление;
							КонецЕсли; 
							
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЦикла; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЦикла;  
	
	Если РезультатВыбора.ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1 Тогда
		АдресаПунктовПогрузкиИВыгрузкиНомерПп = ТабличныйДокумент.Область("ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_НомерПп_1");
		АдресаПунктовПогрузкиИВыгрузкиНомерПп.Значение = 1;  
	КонецЕсли;

	РезультатВыполненя.Вставить("Макет", 				ТабличныйДокумент);
	РезультатВыполненя.Вставить("КонтактнаяИнформация", КонтактнаяИнформация);  
	
	Для Каждого КлючЗначение из ЗначенияРеквизитов Цикл
		Если ТипЗнч(КлючЗначение.Значение) = Тип("СправочникСсылка.Организации") Тогда
			РезультатВыполненя.ДанныеЗаполнения.Вставить("Организация", КлючЗначение.Значение);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(РезультатВыполненя, АдресРезультата);
	
КонецПроцедуры    

Процедура ДобавитьСтроку(ТекущийТитул, ТабличныйДокумент, Знач Индекс, Знач ИмяГруппы, Знач Макет) 
	
	ИнформацияПоПрефиксамТитула = CW_ОбменГИСЭПДПереопределяемый.ПрефиксТитулаПоЭлементуРегламентаЭДО(ТекущийТитул);
	ПрефиксТитула 				= ИнформацияПоПрефиксамТитула.ВПрограмме;  

	ИмяГруппы 			= СтрЗаменить(ИмяГруппы, ПрефиксТитула,""); 
	НомерСтрокиИндекс 	= СтрокаСИндексомПоказателя(Индекс);
	ИмяОбластиПреемника	= "ДобавлениеСтроки" + ИмяГруппы+НомерСтрокиИндекс;
	
	НачИндекс 			= "_1";
	
	ВремТаблДок 		= Макет.ПолучитьОбласть();
	ИскомаяОбластьМнЧ 	= ВремТаблДок.Области.Найти("МногострочнаяЧасть" + ИмяГруппы);
	
	ВремТаблДок 		= ВремТаблДок.ПолучитьОбласть(ИскомаяОбластьМнЧ.Верх, , 
									ИскомаяОбластьМнЧ.Верх + ВысотаМногострочнойЧасти(ИмяГруппы, Макет) - 1, );
	
	ПреИндекс_Число = ИндексПоказателя(ИмяОбластиПреемника);
	ПреИндекс = СтрокаСИндексомПоказателя(ПреИндекс_Число);
	
	НовИндекс_Число = ПреИндекс_Число + 1;
	НовИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число);
	
	НачПостфикс = ИмяГруппы + НачИндекс;
	ПреПостфикс = ИмяГруппы + ПреИндекс;
	НовПостфикс = ИмяГруппы + НовИндекс;  

	МассивИменОбластей = ПолучитьМассивИменОбластейМногострочнойЧасти(ВремТаблДок);
	Для каждого ОбластьИмя Из МассивИменОбластей Цикл
		
		НачИмяОбл = ОбластьИмя + НачИндекс;
		НовИмяОбл = ОбластьИмя + НовИндекс;
	            
		ОбластьЯчейки = ВремТаблДок.Области[НачИмяОбл];
		ОбластьЯчейки.Имя = НовИмяОбл;
		
		Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
			ОбластьЯчейки.Очистить();
		КонецЕсли; 
		
		Если ОбластьИмя = "ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_НомерПп" Тогда
			ОбластьЯчейки.Значение = Строка(НовИндекс_Число);	
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьИдентификаторыСтрок(ТекущийТитул, ВремТаблДок, НовИндекс); 
	
	Обл = ВремТаблДок.Область("УдалитьСтроку" + НачПостфикс);
	Обл.Имя = "УдалитьСтроку" + НовПостфикс;
	
	Обл = ВремТаблДок.Область("УдалитьСтроку" + НовПостфикс);
	Обл.Гиперссылка = Истина;
	Обл.Текст = "х";
	Если НовИндекс_Число = 2 Тогда
		Обл = ТабличныйДокумент.Области.Найти("УдалитьСтроку" + ПреПостфикс);
		Обл.Гиперссылка = Истина;
		Обл.Текст = "х";
	КонецЕсли; 
	
	Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтроку" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтроку" + НовПостфикс;   
	
	Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтрокуЗначок" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтрокуЗначок" + НовПостфикс;
	
	ОблПреемник = ТабличныйДокумент.Области.Найти(ИмяОбластиПреемника);  
	ОблПреемник.Имя = "ДобавлениеСтроки" + НовПостфикс;
	
	ВремТаблДок.Область("МногострочнаяЧасть" + ИмяГруппы).Имя = "";
	
	ВставляемаяОбласть = ВремТаблДок.Область(1, , ВремТаблДок.ВысотаТаблицы, ); 
	
	ТабличныйДокумент.ВставитьОбласть(ВставляемаяОбласть, ОблПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
	
КонецПроцедуры  

Функция ПолучитьДополнительныеИндексыОбластейТитула() Экспорт
	
	ДопИндексы = Новый Соответствие;
	ДопИндексы.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1,	 "_2;_1_1;_2_1"); 
	ДопИндексы.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2,	 "_2;_3;_1_1;_2_1;_3_1;"); 
	ДопИндексы.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1, "_2;_3"); 
	ДопИндексы.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1,	 "_2;_3"); 
	ДопИндексы.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул3,	 "_2;_3"); 
	ДопИндексы.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул3,	 "_2;_3");

	Возврат ДопИндексы;  
	
КонецФункции

Функция ПолучитьРеквизитыАдреса(СтруктураАдреса, ИмяЭлемента, ИндексСтроки="") 
	
	Префикс = СтрЗаменить(ИмяЭлемента, "Представление", "");
	
	СтруктураДанныеАдреса = Новый Структура;   
	
	Если СтруктураАдреса.ТипАдреса = "ВСвободнойФорме"
		Или ЗначениеЗаполнено(СтруктураАдреса.Территория) Тогда
		СтруктураДанныеАдреса.Вставить(Префикс + "Представление" + ИндексСтроки, СтруктураАдреса.Представление);
		СтруктураДанныеАдреса.Вставить(Префикс + "КодСтраны"  + ИндексСтроки, СтруктураАдреса.КодСтраны);	
	Иначе	
		СтруктураДанныеАдреса.Вставить(Префикс + "Индекс" + ИндексСтроки, СтруктураАдреса.Индекс);
		СтруктураДанныеАдреса.Вставить(Префикс + "КодРегиона" + ИндексСтроки, СтруктураАдреса.КодРегиона);
		СтруктураДанныеАдреса.Вставить(Префикс + "Город" + ИндексСтроки, СтруктураАдреса.Город + ?(СтруктураАдреса.ГородТипКраткий = "", "", " ") + СтруктураАдреса.ГородТипКраткий);
		СтруктураДанныеАдреса.Вставить(Префикс + "Район" + ИндексСтроки, СтруктураАдреса.Район + ?(СтруктураАдреса.РайонТипКраткий = "", "", " ") + СтруктураАдреса.РайонТипКраткий);
		СтруктураДанныеАдреса.Вставить(Префикс + "НаселенныйПункт" + ИндексСтроки, СтруктураАдреса.НаселенныйПункт + ?(СтруктураАдреса.НаселенныйПунктТипКраткий = "", "", " ") + СтруктураАдреса.НаселенныйПунктТипКраткий);
		СтруктураДанныеАдреса.Вставить(Префикс + "Улица" + ИндексСтроки, СтруктураАдреса.Улица + ?(СтруктураАдреса.УлицаТипКраткий = "", "", " ") + СтруктураАдреса.УлицаТипКраткий);
		СтруктураДанныеАдреса.Вставить(Префикс + "Дом" + ИндексСтроки, СтруктураАдреса.Здание.Номер);
		Если СтруктураАдреса.Корпуса.Количество() > 0 Тогда
			СтруктураДанныеАдреса.Вставить(Префикс + "Корпус" + ИндексСтроки, СтруктураАдреса.Корпуса[0].Номер);
		КонецЕсли;	
	КонецЕсли;    
	
	Возврат СтруктураДанныеАдреса;
	
КонецФункции

Процедура УстановитьИдентификаторыСтрок(ТекущийТитул, ОбластьПоиска, Знач ТекущийИндекс, 
	Знач ОбластьПоискаРодителя=Неопределено, Знач ИндексСтрокиРодителя="") Экспорт
	
	ИменаОблатейРодителей 	= СоответствиеИменаОбластейРодителей(ТекущийТитул); 
	ОбластьПоискаРодителя 	= ?(ОбластьПоискаРодителя=Неопределено, ОбластьПоиска, ОбластьПоискаРодителя);
	ИндексСтрокиРодителя 	= ?(ПустаяСтрока(ИндексСтрокиРодителя), ТекущийИндекс, ИндексСтрокиРодителя);
	
	МассивИменОбластейБезПрефиксов = ПолучитьМассивИменОбластейМногострочнойЧасти(ОбластьПоиска); 
	
	ИдентификаторыОбластейРодителей = Новый Соответствие;
	
	//Сначала установим идентифкаторы первичных строк   
	Для каждого ИмяОбластиБезПрефикса Из МассивИменОбластейБезПрефиксов Цикл
		
		ЧастиИмени = СтрРазделить(ИмяОбластиБезПрефикса, "_"); 
		Если ЧастиИмени.Найти("ИдентификаторСтроки") = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		ИдентификаторОбласти = Строка(Новый УникальныйИдентификатор);
		
		Область = ОбластьПоиска.Области.Найти(ИмяОбластиБезПрефикса+ТекущийИндекс); 
		Если Область <> Неопределено Тогда
			Область.Значение = ИдентификаторОбласти;     
			ИдентификаторыОбластейРодителей.Вставить(ИмяОбластиБезПрефикса+ТекущийИндекс, ИдентификаторОбласти);
		КонецЕсли;
	КонецЦикла;
	
	//Установим удентификаторы областей родителей 
	Для каждого ИмяОбластиБезПрефикса Из МассивИменОбластейБезПрефиксов Цикл 
		
		ЧастиИмени = СтрРазделить(ИмяОбластиБезПрефикса, "_"); 
		Если ЧастиИмени.Найти("ИдентификаторСтрокиРодителя") = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		ИмяОбластиРодителя = ИменаОблатейРодителей.Получить(ИмяОбластиБезПрефикса); 
		Если ИмяОбластиРодителя <> Неопределено Тогда 
			ИдентификаторОбластиРодителя = ИдентификаторыОбластейРодителей.Получить(ИмяОбластиРодителя+ИндексСтрокиРодителя);
			Если ИдентификаторОбластиРодителя <> Неопределено Тогда
				Область = ОбластьПоиска.Области.Найти(ИмяОбластиБезПрефикса+ТекущийИндекс); 
				Если Область <> Неопределено Тогда
					Область.Значение = ИдентификаторОбластиРодителя;
				КонецЕсли;                                   
			КонецЕсли;                                   
		КонецЕсли; 
		
	КонецЦикла;  

КонецПроцедуры 

Функция СоответствиеИменаОбластейРодителей(ТекущийТитул)
	
	Соответствие = Новый Соответствие;
  	Если ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1 Тогда
		Соответствие.Вставить("ТитулГрузоотправителяРеквизитыСторонПодтвержденияПолномочий_ИдентификаторСтрокиРодителя_1", 					
			"ТитулГрузоотправителяУполномоченныеЛица_ИдентификаторСтроки");     
		
		Соответствие.Вставить("ТитулГрузоотправителяРеквизитыСторонПодтвержденияПолномочий_ИдентификаторСтрокиРодителя_2", 					
			"ТитулГрузоотправителяУполномоченныеЛица_ИдентификаторСтроки");     
		
		Соответствие.Вставить("ТитулГрузоотправителяГрузыПунктыПогрузкиВыгрузки_ИдентификаторСтрокиРодителя",
			"ТитулГрузоотправителяГрузы_ИдентификаторСтроки"); 
		
		Соответствие.Вставить("ТитулГрузоотправителяСтороныДоговораНаВыполнениеУслуг_ИдентификаторСтрокиРодителя_1", 					
			"ТитулГрузоотправителяГрузы_ИдентификаторСтроки");        
		Соответствие.Вставить("ТитулГрузоотправителяСтороныДоговораНаВыполнениеУслуг_ИдентификаторСтрокиРодителя_2", 					
			"ТитулГрузоотправителяГрузы_ИдентификаторСтроки");        
		
	КонецЕсли;  
		
	Если ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2 Тогда 
		Соответствие.Вставить("ТитулПеревозчикаВодительНомераТелефонов_ИдентификаторСтрокиРодителя", 					
			"ТитулПеревозчикаВодители_ИдентификаторСтроки"); 
		
		Соответствие.Вставить("ТитулПеревозчикаОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтрокиРодителя",
			"ТитулПеревозчикаОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтроки"); 
		
		Соответствие.Вставить("ТитулПеревозчикаОснованияВладенияПрицепом_ИдентификаторСтрокиРодителя", 					
			"ТитулПеревозчикаПрицепы_ИдентификаторСтроки");
		
 		Соответствие.Вставить("ТитулПеревозчикаОснованияВладенияПрицепомРеквизитыСторон_ИдентификаторСтрокиРодителя",	
			"ТитулПеревозчикаОснованияВладенияПрицепомРеквизитыСторон_ИдентификаторСтроки"); 
	КонецЕсли;  
	
	Если ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭТрН_Титул1 Тогда 
		Соответствие.Вставить("ТитулГрузоотправителяПереченьМаркировокГруза_ИдентификаторСтрокиРодителя", 					
			"ТитулГрузоотправителяГрузы_ИдентификаторСтроки");
		
		Соответствие.Вставить("ТитулГрузоотправителяИдентификационныеНомераУчетныхЕдиниц_ИдентификаторСтрокиРодителя",
			"ТитулГрузоотправителяГрузы_ИдентификаторСтроки");
		
		Соответствие.Вставить("ТитулГрузоотправителяСведенияОбОпасныхГрузах_ИдентификаторСтрокиРодителя", 					
			"ТитулГрузоотправителяГрузы_ИдентификаторСтроки");
		
		Соответствие.Вставить("ТитулГрузоотправителяСведенияОКонтейнерах_ИдентификаторСтрокиРодителя",	
			"ТитулГрузоотправителяГрузы_ИдентификаторСтроки");  
		
		Соответствие.Вставить("ТитулГрузоотправителяИдентификационныеНомераКонтейнеров_ИдентификаторСтрокиРодителя",	
			"ТитулГрузоотправителяСведенияОКонтейнерах_ИдентификаторСтроки");
		
 		Соответствие.Вставить("ТитулГрузоотправителяРеквизитыСторонСопроводительныхДокументов_ИдентификаторСтрокиРодителя_1",	
			"ТитулГрузоотправителяСопроводительныеДокументы_ИдентификаторСтроки");
 		Соответствие.Вставить("ТитулГрузоотправителяРеквизитыСторонСопроводительныхДокументов_ИдентификаторСтрокиРодителя_2",	
			"ТитулГрузоотправителяСопроводительныеДокументы_ИдентификаторСтроки");
 		Соответствие.Вставить("ТитулГрузоотправителяРеквизитыСторонСопроводительныхДокументов_ИдентификаторСтрокиРодителя_3",	
			"ТитулГрузоотправителяСопроводительныеДокументы_ИдентификаторСтроки");
		
 		Соответствие.Вставить("ТитулГрузоотправителяРеквизитыСторонСертификатовУдостоверений_ИдентификаторСтрокиРодителя_1",	
			"ТитулГрузоотправителяСертификатыУдостоверения_ИдентификаторСтроки"); 
 		Соответствие.Вставить("ТитулГрузоотправителяРеквизитыСторонСертификатовУдостоверений_ИдентификаторСтрокиРодителя_2",	
			"ТитулГрузоотправителяСертификатыУдостоверения_ИдентификаторСтроки"); 
 		Соответствие.Вставить("ТитулГрузоотправителяРеквизитыСторонСертификатовУдостоверений_ИдентификаторСтрокиРодителя_3",	
			"ТитулГрузоотправителяСертификатыУдостоверения_ИдентификаторСтроки"); 
		
 		Соответствие.Вставить("ТитулГрузоотправителяРеквизитыСторонДокументаПодтверждающегоОтгрузку_ИдентификаторСтрокиРодителя_1",	
			"ТитулГрузоотправителяДокументыПодтверждающиеОтгрузку_ИдентификаторСтроки"); 
 		Соответствие.Вставить("ТитулГрузоотправителяРеквизитыСторонДокументаПодтверждающегоОтгрузку_ИдентификаторСтрокиРодителя_2",	
			"ТитулГрузоотправителяДокументыПодтверждающиеОтгрузку_ИдентификаторСтроки"); 
 		Соответствие.Вставить("ТитулГрузоотправителяРеквизитыСторонДокументаПодтверждающегоОтгрузку_ИдентификаторСтрокиРодителя_3",	
			"ТитулГрузоотправителяДокументыПодтверждающиеОтгрузку_ИдентификаторСтроки"); 
		
 		Соответствие.Вставить("ТитулГрузоотправителяВодительНомераТелефонов_ИдентификаторСтрокиРодителя",	
			"ТитулГрузоотправителяВодители_ИдентификаторСтроки"); 
		
 		Соответствие.Вставить("ТитулГрузоотправителяСведенияОПутевыхЛистах_ИдентификаторСтрокиРодителя",	
			"ТитулГрузоотправителяВодители_ИдентификаторСтроки");  
		
	 	Соответствие.Вставить("ТитулГрузоотправителяПутевойЛистРеквизитыСторон_ИдентификаторСтрокиРодителя",	
			"ТитулГрузоотправителяСведенияОПутевыхЛистах_ИдентификаторСтроки"); 
		                       
	 	Соответствие.Вставить("ТитулГрузоотправителяОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтрокиРодителя",	
			"ТитулГрузоотправителяОснованияВладенияТС_ИдентификаторСтроки"); 
		              		   	         
	 	Соответствие.Вставить("ТитулГрузоотправителяОснованияВладенияПрицепом_ИдентификаторСтрокиРодителя",	
			"ТитулГрузоотправителяПрицепы_ИдентификаторСтроки"); 
            
		Соответствие.Вставить("ТитулГрузоотправителяОснованиеВладенияПрицепомРеквизитыСторон_ИдентификаторСтрокиРодителя",	
			"ТитулГрузоотправителяОснованияВладенияПрицепом_ИдентификаторСтроки"); 

	КонецЕсли;  
	
	Если ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул1 Тогда   
		
		Соответствие.Вставить("ТитулОформлениеВодительНомераТелефонов_ИдентификаторСтрокиРодителя", 					
			"ТитулОформлениеВодители_ИдентификаторСтроки");
		
		Соответствие.Вставить("ТитулОформлениеТранспортноеСредствоОснованиеВладенияПрицепомРеквизитыСторон_ИдентификаторСтрокиРодителя",
			"ТитулОформлениеТранспортноеСредствоОснованияВладенияПрицепом_ИдентификаторСтроки");
		                        
		Соответствие.Вставить("ТитулОформлениеТранспортноеСредствоОснованияВладенияПрицепом_ИдентификаторСтрокиРодителя", 					
			"ТитулОформлениеТранспортноеСредствоПрицепы_ИдентификаторСтроки");
		                         
		Соответствие.Вставить("ТитулОформлениеТранспортноеСредствоОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтрокиРодителя",	
			"ТитулОформлениеТранспортноеСредствоОснованияВладенияТС_ИдентификаторСтроки");  
	КонецЕсли;  
	
	Если ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_Титул3 Тогда  
		
		Соответствие.Вставить("ТитулВыпускТранспортноеСредствоОснованиеВладенияПрицепомРеквизитыСторон_ИдентификаторСтрокиРодителя", 					
			"ТитулВыпускТранспортноеСредствоОснованияВладенияПрицепом_ИдентификаторСтроки"); 
		                        
		Соответствие.Вставить("ТитулВыпускТранспортноеСредствоОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтрокиРодителя",
			"ТитулВыпускТранспортноеСредствоОснованияВладенияТС_ИдентификаторСтроки"); 
		
		Соответствие.Вставить("ТитулВыпускТранспортноеСредствоОснованияВладенияПрицепом_ИдентификаторСтрокиРодителя", 					
			"ТитулВыпускТранспортноеСредствоПрицепы_ИдентификаторСтроки");
		
	КонецЕсли; 
	
	Если ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭСВ_Титул1_1 Тогда  
		
		Соответствие.Вставить("ТитулПеревозчикаМаркировка_ИдентификаторСтрокиРодителя", 					
			"ТитулПеревозчикаОписаниеГруза_ИдентификаторСтроки"); 
		
		Соответствие.Вставить("ТитулПеревозчикаНомераКонтейнеров_ИдентификаторСтрокиРодителя", 					
			"ТитулПеревозчикаСведенияОКонтейнерах_ИдентификаторСтроки"); 
		
		Соответствие.Вставить("ТитулПеревозчикаВодительНомераТелефонов_ИдентификаторСтрокиРодителя", 					
			"ТитулПеревозчикаВодители_ИдентификаторСтроки"); 
		
		Соответствие.Вставить("ТитулГрузоотправителяОснованияВладенияПрицепом_ИдентификаторСтрокиРодителя", 					
			"ТитулПеревозчикаПрицепыПрицепы_ИдентификаторСтроки"); 
		
		Соответствие.Вставить("ТитулПеревозчикаОснованиеВладенияПрицепомРеквизитыСторон_ИдентификаторСтрокиРодителя", 					
			"ТитулПеревозчикаОснованияВладенияПрицепом_ИдентификаторСтроки"); 
		
	КонецЕсли;  
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьМассивИменОбластейМногострочнойЧасти(Знач ВремТаблДок)
	
	МассивИменОбластей = Новый Массив;
	Для Каждого Область из ВремТаблДок.Области Цикл
		Если СтрНачинаетсяС(Область.Имя, "МногострочнаяЧасть") 
			Или СтрНачинаетсяС(Область.Имя, "УдалитьСтроку") Тогда
			Продолжить;
		Конецесли;
		ИмяОбластиБезПрефикса = ИмяОбластиБезПрефикса(Область.Имя);  
		МассивИменОбластей.Добавить(ИмяОбластиБезПрефикса);
	КонецЦикла;

	Возврат МассивИменОбластей;

КонецФункции 

Функция ИндексПоказателя(Знач ИмяОбласти) 
	
	МассивСтрок = СтрРазделить(ИмяОбласти, "_");
	
	КолСтрок = МассивСтрок.Количество();
	
	Если КолСтрок = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексСтрока = МассивСтрок[КолСтрок - 1];
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИндексСтрока) Тогда
		Возврат Число(ИндексСтрока);
	КонецЕсли;
	
КонецФункции   

Функция СтрокаСИндексомПоказателя(Знач Индекс) 
	
	Если ТипЗнч(Индекс) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат "_" + Формат(Индекс, "ЧГ=");
	
КонецФункции

Функция ИмяОбластиБезПрефикса(Знач ОбластьИмя) Экспорт
	
	ДопИндекс	= "";   
	
	ПривОбластьИмя 	= ПривестиИмяОбласти(ОбластьИмя);
	ЧастиИмени 		= СтрРазделить(ПривОбластьИмя,"_"); 
	Если ЧастиИмени.Количество() > 1 Тогда    
		ИмяРеквизита = ВостановитьПриведенноеИмяРеквизита(ЧастиИмени[1]);
		ОбластьИмя   = ЧастиИмени[0] + "_" + ИмяРеквизита;	
	КонецЕсли;
	
	Если ЧастиИмени.Количество() = 4 Тогда
		ОбластьИмя = ОбластьИмя + "_"+ЧастиИмени[2]; 
	КонецЕсли;
	
	Возврат ОбластьИмя;

КонецФункции  

Функция СтруктураИменОбластейУИД(ТекущийТитул)
	
	Соответствие = Новый Соответствие;
	
	Если ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул1") Тогда 
		
		//УполномоченныеЛица    
		ДеревоУполномоченныеЛица = СоздатьДеревоИдентификаторов();
		
		СтрокаУполномоченныеЛица = ДеревоУполномоченныеЛица.Строки.Добавить();
		СтрокаУполномоченныеЛица.ИдентификаторСтроки 	= "ТитулГрузоотправителяУполномоченныеЛица_ИдентификаторСтроки";
		
		СтрокаПодтвержденияПолномочий = СтрокаУполномоченныеЛица.Строки.Добавить();
		СтрокаПодтвержденияПолномочий.ИдентификаторСтроки 			= "ТитулГрузоотправителяРеквизитыСторонПодтвержденияПолномочий_ИдентификаторСтроки";
		СтрокаПодтвержденияПолномочий.ИдентификаторСтрокиРодителя 	= "ТитулГрузоотправителяРеквизитыСторонПодтвержденияПолномочий_ИдентификаторСтрокиРодителя";
		
		Соответствие.Вставить("УполномоченныеЛица", ДеревоУполномоченныеЛица);
		//---УполномоченныеЛица  
		
		//АдресаПунктовПогрузкиИВыгрузки
		ДеревоАдресаПунктов = СоздатьДеревоИдентификаторов();
		
		СтрокаАдреса = ДеревоАдресаПунктов.Строки.Добавить();
		СтрокаАдреса.ИдентификаторСтроки 	= "ТитулГрузоотправителяАдресаПунктовПогрузкиИВыгрузки_ИдентификаторСтроки";
		
		Соответствие.Вставить("АдресаПунктовПогрузкиИВыгрузки", ДеревоАдресаПунктов);
		//---АдресаПунктовПогрузкиИВыгрузки
		
		//Грузы
		ДеревоГрузы = СоздатьДеревоИдентификаторов();
		
		СтрокаГрузы = ДеревоГрузы.Строки.Добавить();
		СтрокаГрузы.ИдентификаторСтроки 	= "ТитулГрузоотправителяГрузы_ИдентификаторСтроки";
		
		СтрокаПунктыПогрузкиВыгрузки = СтрокаГрузы.Строки.Добавить();
		СтрокаПунктыПогрузкиВыгрузки.ИдентификаторСтроки 			= "ТитулГрузоотправителяГрузыПунктыПогрузкиВыгрузки_ИдентификаторСтроки";
		СтрокаПунктыПогрузкиВыгрузки.ИдентификаторСтрокиРодителя 	= "ТитулГрузоотправителяГрузыПунктыПогрузкиВыгрузки_ИдентификаторСтрокиРодителя";
		
		СтрокаСтороныДоговор = СтрокаГрузы.Строки.Добавить();
		СтрокаСтороныДоговор.ИдентификаторСтроки 			= "ТитулГрузоотправителяСтороныДоговораНаВыполнениеУслуг_ИдентификаторСтроки";
		СтрокаСтороныДоговор.ИдентификаторСтрокиРодителя 	= "ТитулГрузоотправителяСтороныДоговораНаВыполнениеУслуг_ИдентификаторСтрокиРодителя";
		
		Соответствие.Вставить("ОписаниеГруза", ДеревоГрузы);
		//---Грузы    
		
		//Договор       
		ДеревоДоговор = СоздатьДеревоИдентификаторов();
		
		СтрокаДоговор = ДеревоДоговор.Строки.Добавить();
		СтрокаДоговор.ИдентификаторСтроки 	= "ТитулГрузоотправителяДоговорРеквизитыСторон_ИдентификаторСтроки";
		
		Соответствие.Вставить("Договор", ДеревоДоговор);
		//---Договор       
	КонецЕсли;
	
	Если ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЗЗ_Титул2") Тогда  
		
		//Довереннность
		ДеревоДовереннность = СоздатьДеревоИдентификаторов();
		СтрокаДовереннность = ДеревоДовереннность.Строки.Добавить();
		СтрокаДовереннность.ИдентификаторСтроки 	= "ТитулПеревозчикаСоставительДоверенностьРеквизитыСторон_ИдентификаторСтроки";
		
		Соответствие.Вставить("ТитулПеревозчикаСоставительДоверенность_ХранимыеДанныеСторонаПодписавшаяДокумент", ДеревоДовереннность);
	
		//Телефоны
		ДеревоТелефоны = СоздатьДеревоИдентификаторов();
		СтрокаТелефоны = ДеревоТелефоны.Строки.Добавить();
		СтрокаТелефоны.ИдентификаторСтрокиРодителя 	= "ТитулПеревозчикаВодительНомераТелефонов_ИдентификаторСтрокиРодителя";

		Соответствие.Вставить("ТитулПеревозчикаВодительНомераТелефонов_Телефон_1", ДеревоТелефоны);
	
		//ОснованияВладенияТС
		ДеревоОснованияВладенияТС = СоздатьДеревоИдентификаторов();
		СтрокаОснованияВладенияТС = ДеревоОснованияВладенияТС.Строки.Добавить();
		СтрокаОснованияВладенияТС.ИдентификаторСтроки 			= "ТитулПеревозчикаОснованияВладенияТС_ИдентификаторСтроки";
		СтрокаОснованияВладенияТС.ИдентификаторСтрокиРодителя 	= "ТитулПеревозчикаОснованияВладенияТС_ИдентификаторСтрокиРодителя";
		
		СтрокаРеквизитыСторон = СтрокаОснованияВладенияТС.Строки.Добавить();
		СтрокаРеквизитыСторон.ИдентификаторСтроки 			= "ТитулПеревозчикаОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтроки";
		СтрокаРеквизитыСторон.ИдентификаторСтрокиРодителя 	= "ТитулПеревозчикаОснованиеВладенияТСРеквизитыСторон_ИдентификаторСтрокиРодителя";
		
		Соответствие.Вставить("ТитулПеревозчикаОснованияВладенияТС_ЗаполнитьОснованиеВладенияТСРеквизитыСторон_1", ДеревоОснованияВладенияТС);
	
		//Прицеп
		ДеревоПрицеп = СоздатьДеревоИдентификаторов();
		СтрокаПрицеп = ДеревоПрицеп.Строки.Добавить();
		СтрокаПрицеп.ИдентификаторСтроки 			= "ТитулПеревозчикаПрицепы_ИдентификаторСтроки";
		СтрокаПрицеп.ИдентификаторСтрокиРодителя 	= "ТитулПеревозчикаПрицепы_ИдентификаторСтрокиРодителя";
		
		СтрокаСтрокаОснованияВладенияПрицепом = СтрокаПрицеп.Строки.Добавить();
		СтрокаСтрокаОснованияВладенияПрицепом.ИдентификаторСтроки 			= "ТитулПеревозчикаОснованияВладенияПрицепомТС_ИдентификаторСтроки";
		СтрокаСтрокаОснованияВладенияПрицепом.ИдентификаторСтрокиРодителя 	= "ТитулПеревозчикаОснованияВладенияПрицепом_ИдентификаторСтрокиРодителя";
		
		СтрокаРеквизитыСторон = СтрокаСтрокаОснованияВладенияПрицепом.Строки.Добавить();
		СтрокаРеквизитыСторон.ИдентификаторСтроки 			= "ТитулПеревозчикаОснованияВладенияПрицепомРеквизитыСторон_ИдентификаторСтроки";
		СтрокаРеквизитыСторон.ИдентификаторСтрокиРодителя 	= "ТитулПеревозчикаОснованияВладенияПрицепомРеквизитыСторон_ИдентификаторСтрокиРодителя";
		
		Соответствие.Вставить("ТитулПеревозчикаОснованияВладенияПрицепом__ЗаполнитьОснованиеВладенияТСРеквизитыСторон_1", ДеревоОснованияВладенияТС);

		//СпециальныеУсловияДвижения
		ДеревоСпециальныеУсловияДвижения = СоздатьДеревоИдентификаторов();
		СтрокаСпециальныеУсловияДвижения = ДеревоСпециальныеУсловияДвижения.Строки.Добавить();
		СтрокаСпециальныеУсловияДвижения.ИдентификаторСтроки 			= "ТитулПеревозчикаСпециальныеУсловияДвижения_ИдентификаторСтроки";
		СтрокаСпециальныеУсловияДвижения.ИдентификаторСтрокиРодителя 	= "ТитулПеревозчикаСпециальныеУсловияДвижения_ИдентификаторСтрокиРодителя";

		Соответствие.Вставить("СпециальныеУсловияДвижения", ДеревоОснованияВладенияТС);
		
	КонецЕсли;
	
	Возврат Соответствие;
	
КонецФункции

Функция СоздатьДеревоИдентификаторов()
	
	ДеревоОбластей = Новый ДеревоЗначений;
	ДеревоОбластей.Колонки.Добавить("ИдентификаторСтроки");
	ДеревоОбластей.Колонки.Добавить("ИдентификаторСтрокиРодителя");

	Возврат ДеревоОбластей;

КонецФункции

Процедура УстановитьУИДДляСтроки(ТабДокумент, Строки, НачИндекс) 
	
	Для Каждого Строка из Строки Цикл  
		
		ИмяОбласти = Строка.ИдентификаторСтроки + НачИндекс;
		Область =  ТабДокумент.Области.Найти(ИмяОбласти); 
		Если Область <> Неопределено Тогда
			Область.Значение = Строка(Новый УникальныйИдентификатор); 
			
			Если ЗначениеЗаполнено(Строка.ИдентификаторСтрокиРодителя) Тогда 
				ИмяОбластиРодитель	= Строка.Родитель.ИдентификаторСтроки + НачИндекс;
				
				ОбластьВладелец 	= ТабДокумент.Области.Найти(ИмяОбластиРодитель); 
				Если ОбластьВладелец <> Неопределено Тогда
					НовИмяОбласти = Строка.ИдентификаторСтрокиРодителя + НачИндекс;
					НовОбласть 	= ТабДокумент.Области.Найти(НовИмяОбласти); 
					Если НовОбласть <> Неопределено Тогда
						НовОбласть.Значение 	= ОбластьВладелец.Значение;      
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
		Если Строка.Строки.Количество() > 0 Тогда
			УстановитьУИДДляСтроки(ТабДокумент, Строка.Строки, НачИндекс);	
		КонецЕсли;   
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВысотаМногострочнойЧасти(ИмяГруппы, ТаблДок = Неопределено) Экспорт
	
	ИскомаяОбласть1 = ТаблДок.Области.Найти("МногострочнаяЧасть" + ИмяГруппы); 
	
	Для каждого ИскомаяОбласть2 Из ТаблДок.Области Цикл  
		Если СтрНачинаетсяС(ИскомаяОбласть2.Имя, "ДобавлениеСтроки" + ИмяГруппы) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат ИскомаяОбласть2.Верх - ИскомаяОбласть1.Верх;
	
КонецФункции

Функция ПолучитьВычисляемуюФункциюЯчейки(ПараметрКоманды, ТипОбъекта, ЗначениеЯчейки, НомерСтроки=Неопределено) Экспорт

	Для Каждого СтрокаТаблицы из ЗначениеЯчейки.ФункцииЗначения Цикл 
		
		Если НомерСтроки <> Неопределено Тогда 
			
			ЧетнаяСтрока = (НомерСтроки%2 = 0);
			Если СтрокаТаблицы.ОтборПоНомеруСтроки = "Четные"
				И НЕ ЧетнаяСтрока Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаТаблицы.ОтборПоНомеруСтроки = "Нечетные"
				И ЧетнаяСтрока Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Успешно = УсловиеОтбораВыполняется(ПараметрКоманды, ТипОбъекта, СтрокаТаблицы.ХранилищеОтбора);
		Если Успешно Тогда 
			Возврат СтрокаТаблицы.ФункцияЗначения;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции   

Функция ПолучитьМассивСтрок(ПараметрыФункции) Экспорт 
	
	НастройкиОтбора = ПараметрыФункции.ВычисляемаяФункция.ХранилищеНастроек.Получить();   
	
	СоответствиеОбщегоМакетаПоИмени = CW_КлючевыеПоказателиСервер.ПолучитьСоответствиеИмениМакета();
	ИмяМакета	= СоответствиеОбщегоМакетаПоИмени.Получить(ПараметрыФункции.ВычисляемаяФункция.ИмяМакета);
	Схема		= ПолучитьОбщийМакет(ИмяМакета);
	
	АдресСхемы 	= ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор);
	
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек); 
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
	Для Каждого СтрокаНастроек из НастройкиОтбора Цикл
		ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		НовыеПараметрыФункции = Новый Структура; 
		НовыеПараметрыФункции.Вставить("ВычисляемаяФункция", 	СтрокаНастроек.Значение);
		НовыеПараметрыФункции.Вставить("ПараметрКоманды",		ПараметрыФункции.ПараметрКоманды);
		НовыеПараметрыФункции.Вставить("ТипОбъекта",			ПараметрыФункции.ТипОбъекта); 
		
		ПравоеЗначение = ВычислитьЗначениеЯчейки(НовыеПараметрыФункции); 
		Если ТипЗнч(ПравоеЗначение)= Тип("Структура") Тогда
			ПравоеЗначение = ПравоеЗначение.Значение;	
		КонецЕсли;
		
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(СтрокаНастроек.ПутьКДанным);
		ЭлементОтбора.ВидСравнения 		= СтрокаНастроек.ВидСравнения;
		ЭлементОтбора.ПравоеЗначение 	= ПравоеЗначение;
		ЭлементОтбора.Использование 	= Истина;
		
	КонецЦикла;

	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ПроцессорВыводаРезультата 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
	ПроцессорВыводаРезультата.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных); 
	
	Массив = Новый Массив;
	
	Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл
		Для Индекс = 1 по ПараметрыФункции.ВычисляемаяФункция.Множитель Цикл
			Массив.Добавить(СтрокаТаблицы.Ссылка);	
		КонецЦикла;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции   

Функция УсловиеОтбораВыполняется(ПараметрКоманды, ТипОбъекта, ХранилищеОтбора)
	
	СхемаКомпоновкиДанных 	= CW_ОбменГИСЭПДДополнительный.ПолучитьСхемуКомпоновкиДанных(ТипОбъекта);
	Настройки 				= СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	НастройкиОтбора 		= ХранилищеОтбора.Получить();
	Если НастройкиОтбора <> Неопределено Тогда
		_УФС.СкопироватьОтбор(НастройкиОтбора.Отбор, Настройки.Отбор);
	КонецЕсли;
	
	ЭлементОтбора 					= Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ПараметрКоманды;
	ЭлементОтбора.Использование	 	= Истина;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	Результат = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);  
	
	Возврат Результат.Количество() > 0;
	
КонецФункции

Функция ВычислитьЗначениеЯчейки(ПараметрыФункции) Экспорт 
	
	ВычисляемаяФункция 	= ПараметрыФункции.ВычисляемаяФункция;  
	
	//Аргументы функций
	ПараметрКоманды = ПараметрыФункции.ПараметрКоманды;  
	
	НомерСтроки = 1;
	Если ПараметрыФункции.Свойство("НомерСтроки") Тогда
		НомерСтроки 	= ПараметрыФункции.НомерСтроки;    
	КонецЕсли;
	
	//Реквизит / свойство(0)  
	Если ВычисляемаяФункция.СпособПолученияЗначения = 0 Тогда 
		Возврат ПолучитьЗначениеПараметраОбъекта(ПараметрыФункции);  
	КонецЕсли;
	
	//Фиксированное значение(2)
	Если ВычисляемаяФункция.СпособПолученияЗначения = 1 Тогда
		Возврат ВычисляемаяФункция.Значение; 
	КонецЕсли;    
	
	//Формула(3)	
	Если ВычисляемаяФункция.СпособПолученияЗначения = 2 Тогда
		
		ДанныеФормулы 		= ПолучитьДанныеДляРасчетаФункции(ВычисляемаяФункция.ТекстФормулы, ПараметрыФункции);
		ПоказателиФормулы	= ДанныеФормулы.ПоказателиФормулы; 
		
		Попытка    
			Возврат Вычислить(ДанныеФормулы.Формула);
		Исключение 
		КонецПопытки;  
		
	КонецЕсли;    
	
КонецФункции   

Функция ПолучитьДанныеДляРасчетаФункции(Знач Формула, Знач ПараметрыФункции) 
	
	СтрокаЦифр 			= "0123456789"; 
	
	ПоказателиФормулы 	= Новый Структура; 
	ПоказателиФормулы.Вставить("ПараметрКоманды", ПараметрыФункции.ПараметрКоманды);
	
	МассивПоказателей 		= CW_ОбменГИСЭПДПовторноеИспользование.ПолучитьВложенныеФункцииФормулы();
	СоответствиеФункций 	= CW_ОбменГИСЭПДПовторноеИспользование.ПолучитьСоответствиеФункций();
	
	РазделителиФормулы 		= " +-/*?=<>()," + Символы.ВК + Символы.ВТаб + Символы.НПП + Символы.ПС + Символы.ПФ + Символы.Таб;
	ЗарезервированныеСлова 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("ЦЕЛ,INT,ОКР,ROUND,МАКС,MAX,МИН,MIN,И,ИЛИ,НЕ,OR,AND,NOT");
	
	Слова = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Формула, РазделителиФормулы);
	Для Каждого Слово Из Слова Цикл
		// Это число
		Если СтрНайти(СтрокаЦифр, СтрЗаменить(Слово, ".", "")) > 0 Тогда
			Продолжить;
		КонецЕсли;
		// Это зарезервированное слово.
		Если ЗарезервированныеСлова.Найти(ВРег(Слово)) <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;     
		// Это должен быть другая функция 
		мСлова = СтрРазделить(Слово, ".", Ложь);
		Если мСлова.Количество() > 1 Тогда  
			//Если это вложенная функция, то всегда начинается с ее имени
			Слово = мСлова[0];
		КонецЕсли;
		Если МассивПоказателей.Найти(Слово) <> Неопределено 
			и ПоказателиФормулы.Свойство(Слово) = Ложь Тогда  
			
			ВложеннаяФункция = СоответствиеФункций.Получить(Слово); 
			
			ПараметрыФункции.Вставить("ВычисляемаяФункция", ВложеннаяФункция);
			
			ЗначениеВложеннойФункции = ВычислитьЗначениеЯчейки(ПараметрыФункции);
			Если ТипЗнч(ЗначениеВложеннойФункции)= Тип("Структура") Тогда
				ЗначениеВложеннойФункции = ЗначениеВложеннойФункции.Значение;	
			КонецЕсли;
			
			ПоказателиФормулы.Вставить(Слово, ЗначениеВложеннойФункции);  
			
			Формула = СтрЗаменить(Формула, Слово , "ПоказателиФормулы."+Слово);
		КонецЕсли; 
		
	КонецЦикла;
	
	ДанныеДляРасчета = Новый Структура;
	ДанныеДляРасчета.Вставить("Формула", 			Формула);
	ДанныеДляРасчета.Вставить("ПоказателиФормулы", 	ПоказателиФормулы);
	
	Возврат ДанныеДляРасчета;
	
КонецФункции  

Функция ПолучитьЗначениеПараметраОбъекта(ПараметрыФункции) Экспорт

	ПолучатьХранимыеДанные 	= ложь;
	ПутьКДанным 			= ПараметрыФункции.ВычисляемаяФункция.ПутьКДанным;
	ЗначениеСвойства 		= ВыполнитьСКД(ПараметрыФункции, ПутьКДанным);   
	
	Если СтрЗаканчиваетсяНа(ПараметрыФункции.ВычисляемаяФункция.ПутьКДанным, "]") Тогда
		ПозНачала		= СтрНайти(ПараметрыФункции.ВычисляемаяФункция.ПутьКДанным, "[", НаправлениеПоиска.СКонца);
		ПутьКДанным		= Лев(ПараметрыФункции.ВычисляемаяФункция.ПутьКДанным, ПозНачала-2); 
		ОбъектПараметра	= ВыполнитьСКД(ПараметрыФункции, ПутьКДанным);
		
		ИдентификаторПараметра 	= Сред(ПараметрыФункции.ВычисляемаяФункция.ПутьКДанным, ПозНачала);
		ИдентификаторПараметра	= СтрЗаменить(ИдентификаторПараметра, "]", "");
		ИдентификаторПараметра	= СтрЗаменить(ИдентификаторПараметра, "[", "");  
		
		МониторинговыйПараметр = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.НайтиПоРеквизиту("Идентификатор",ИдентификаторПараметра); 
		
		Если Не МониторинговыйПараметр.Пустая() Тогда
			ПолучатьХранимыеДанные = МониторинговыйПараметр.ИспользоватьФормуВводаАдреса 
			или МониторинговыйПараметр.СохранятьПолноеЗначениеПараметра;	
			
			Если ПолучатьХранимыеДанные Тогда
				ЗначениеСвойства = ПолучитьХранимыеДанные(ОбъектПараметра, МониторинговыйПараметр);	
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат ЗначениеСвойства;
	
КонецФункции

Функция ВыполнитьСКД(Знач ПараметрыФункции, Знач ПутьКДанным)
	
	
	Схема = CW_ОбменГИСЭПДДополнительный.ПолучитьСхемуКомпоновкиДанных(ПараметрыФункции.ТипОбъекта);
	
	НаборДанных = Схема.НаборыДанных.Получить(0);
	НаборДанных.Запрос = СтрЗаменить(НаборДанных.Запрос, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ 1"); 
	
	АдресСхемы 	= ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор);
	
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
	ПолеВыбор = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных")); 
	ПолеВыбор.Поле 			= Новый ПолеКомпоновкиДанных(ПутьКДанным); 
	ПолеВыбор.Использование = Истина; 
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= ПараметрыФункции.ПараметрКоманды;
	ЭлементОтбора.Использование 	= Истина;   
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроек.Настройки, ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ПроцессорВыводаРезультата 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
	ПроцессорВыводаРезультата.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных); 
	
	ЧастиПоля = СтрРазделить(ПутьКДанным, ".");
	Если ЧастиПоля.Количество() = 1 Тогда
		Колонка = ТаблицаЗначений.Колонки[0];
	Иначе
		Колонка = ТаблицаЗначений.Колонки[1];
	КонецЕсли;    
	
	Если ТаблицаЗначений.Количество() = 1 Тогда
		Возврат ТаблицаЗначений[0][Колонка.Имя];
	КонецЕсли;
	
	Типы = Колонка.ТипЗначения.Типы();
	Если Типы.Найти(Тип("Null")) <> Неопределено Тогда
		Типы.Удалить(Типы.Найти(Тип("Null")));	
	КонецЕсли;                       
	
	ОписаниеТипов = Новый ОписаниеТипов(Типы);
	
	Возврат ОписаниеТипов.ПривестиЗначение(Неопределено);

КонецФункции  

Функция ПолучитьХранимыеДанные(ОбъектПараметра, Параметр) Экспорт

	Если ТипЗнч(ОбъектПараметра) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда 
		ИмяРегистра	= "CW_ХарактеристикиГрузоперевозок";  
		Условие		= "И Характеристики.Грузоперевозка = &ОбъектПараметра";
	КонецЕсли;  
	Если ТипЗнч(ОбъектПараметра) = Тип("СправочникСсылка.CW_Заказы") Тогда
		ИмяРегистра = "CW_ХарактеристикиЗаказов";
		Условие		= "И Характеристики.Заказ = &ОбъектПараметра";
	КонецЕсли;  
	Если ТипЗнч(ОбъектПараметра) = Тип("СправочникСсылка.CW_Заявки") Тогда
		ИмяРегистра = "CW_ХарактеристикиЗаявок";
		Условие		= "И Характеристики.Заявка = &ОбъектПараметра";
	КонецЕсли;  
	Если ТипЗнч(ОбъектПараметра) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") 
		или ТипЗнч(ОбъектПараметра) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
		ИмяРегистра = "CW_ХарактеристикиДоговоровИПриложений";
		Условие		= "И Характеристики.Объект = &ОбъектПараметра";
	КонецЕсли;  
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ОбъектПараметра", 	ОбъектПараметра);
	Запрос.УстановитьПараметр("Параметр", 			Параметр);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Характеристики.ХранилищеДанных КАК ХранилищеДанных
	|ИЗ
	|	РегистрСведений."+ИмяРегистра+" КАК Характеристики
	|ГДЕ
	|	Характеристики.Параметр = &Параметр 
	|	"+Условие;  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ХранимыеДанные = Выборка.ХранилищеДанных.Получить();
		Если ХранимыеДанные <> Неопределено Тогда
			Возврат ХранимыеДанные;
		Конецесли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьСвязанныйДокументЭПД(ЭПД) Экспорт
	
	Возврат РегистрыСведений.CW_ОбменГИСЭПДСвязанныеДокументыЭПД.ПолучитьСвязанныйДокументЭПД(ЭПД);
	
КонецФункции 

Процедура ДобавитьСвязанныйДокументЭПД(ЭПД, СвязанныйЭПД) Экспорт
	
	РегистрыСведений.CW_ОбменГИСЭПДСвязанныеДокументыЭПД.ДобавитьЗаписьВРегистр(ЭПД, СвязанныйЭПД);
	
КонецПроцедуры

Функция ПолучитьПустуюТаблицуЗначенийРеквизитов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗначенияРеквизитовДокументовЭПД.Титул КАК Титул,
	|	ЗначенияРеквизитовДокументовЭПД.НомерВерсии КАК НомерВерсии,
	|	ЗначенияРеквизитовДокументовЭПД.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ЗначенияРеквизитовДокументовЭПД.НомерСтрокиРеквизита КАК НомерСтрокиРеквизита,
	|	ЗначенияРеквизитовДокументовЭПД.ИмяРеквизита КАК ИмяРеквизита,
	|	НЕОПРЕДЕЛЕНО КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.ЗначенияРеквизитовДокументовЭПД КАК ЗначенияРеквизитовДокументовЭПД";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура СформироватьАлгоритмыЗаполненияРеквизитовЭПД(ПараметрыПроцедуры, АдресРезультата) Экспорт  
	
	Результат = Новый Структура;
	
	СоответствиеРезультатов = Новый Соответствие;
	СоответствиеРезультатов.Вставить("ЗначениеРеквизита", 	Перечисления.CW_ОбменГИСЭПДВидыРезультатов.ЗначениеРеквизита);
	СоответствиеРезультатов.Вставить("ТабличнаяЧасть", 		Перечисления.CW_ОбменГИСЭПДВидыРезультатов.ТабличнаяЧасть);
	
	МакетИменПолей = Справочники.CW_ОбменГИСЭПДНастройкиЗаполненияЭПД.ПолучитьМакет("СоответствиеИменПолей");
	ОбластьТитула  = МакетИменПолей.ПолучитьОбласть(ПараметрыПроцедуры.ИмяОбласти); 
	
	//Подготовка таблицы настроек по макету
	ТаблицаНастроек = Новый ТаблицаЗначений;
	ТаблицаНастроек.Колонки.Добавить("ИмяОбласти",				Новый ОписаниеТипов("Строка"));
	ТаблицаНастроек.Колонки.Добавить("ЗаголовокОбласти", 		Новый ОписаниеТипов("Строка"));
	ТаблицаНастроек.Колонки.Добавить("ТипЗначения",				Неопределено);
	ТаблицаНастроек.Колонки.Добавить("ВозвращаемоеЗначение",	Новый ОписаниеТипов("ПеречислениеСсылка.CW_ОбменГИСЭПДВидыРезультатов"));
	ТаблицаНастроек.Колонки.Добавить("Обязательное",			Новый ОписаниеТипов("Булево"));
	ТаблицаНастроек.Колонки.Добавить("ОписаниеЗначения",		Новый ОписаниеТипов("Строка"));
	ТаблицаНастроек.Колонки.Добавить("Комментарий",				Новый ОписаниеТипов("Строка"));
	
	Для НомерСтроки = 1 по ОбластьТитула.ВысотаТаблицы Цикл
		НоваяСтрока = ТаблицаНастроек.Добавить();
		НоваяСтрока.ИмяОбласти 			 = СокрЛП(ОбластьТитула.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);	
		НоваяСтрока.ЗаголовокОбласти	 = СокрЛП(ОбластьТитула.Область(НомерСтроки, 3, НомерСтроки, 3).Текст);	
		НоваяСтрока.ВозвращаемоеЗначение = СоответствиеРезультатов.Получить(СокрЛП(ОбластьТитула.Область(НомерСтроки, 4, НомерСтроки, 4).Текст));
		НоваяСтрока.Обязательное 		 = (ВРег(СокрЛП(ОбластьТитула.Область(НомерСтроки, 5, НомерСтроки, 5).Текст)) = "ДА");	
		НоваяСтрока.ОписаниеЗначения	 = СокрЛП(ОбластьТитула.Область(НомерСтроки, 6, НомерСтроки, 6).Текст);	
		НоваяСтрока.Комментарий	 		 = СокрЛП(ОбластьТитула.Область(НомерСтроки, 7, НомерСтроки, 7).Текст);	
		
		ОписаниеТипаЗначения = СокрЛП(ОбластьТитула.Область(НомерСтроки, 2, НомерСтроки, 2).Текст); 
		Если Не ПустаяСтрока(ОписаниеТипаЗначения) Тогда
			МассивИменТипов = СтрРазделить(ОписаниеТипаЗначения,";");
			
			Типы = Новый Массив;
			Для Каждого ИмяТипа из МассивИменТипов Цикл
				Типы.Добавить(Тип(ИмяТипа));	
			КонецЦикла;
			
			НоваяСтрока.ТипЗначения = Новый ОписаниеТипов(Типы);
		КонецЕсли;
		
	КонецЦикла;   
	
	РодительТипДокумента = ПолучитьРодителяАлгоритмовЗаполненияЭПД(
		СокрЛП(ПараметрыПроцедуры.ТипДокументаЭПД), 
		ПараметрыПроцедуры.ТипОбъекта);
	
	РодительТекущийТитул = ПолучитьРодителяАлгоритмовЗаполненияЭПД(
		СокрЛП(ПараметрыПроцедуры.ТекущийТитул), 
		ПараметрыПроцедуры.ТипОбъекта,
		РодительТипДокумента);
		
	//Формирование элементов справочника   
	Для Каждого СтрокаНастроек из ТаблицаНастроек Цикл 
		СсылкаАлгоритмы = Справочники.CW_ОбменГИСЭПДАлгоритмыЗаполненияРеквизитовЭПД.НайтиПоНаименованию(СокрЛП(СтрокаНастроек.ЗаголовокОбласти), Истина, РодительТекущийТитул);
		Если Не СсылкаАлгоритмы.Пустая() Тогда 
			АлгоритмыОбъект =  СсылкаАлгоритмы.ПолучитьОбъект(); 
		Иначе
			АлгоритмыОбъект = Справочники.CW_ОбменГИСЭПДАлгоритмыЗаполненияРеквизитовЭПД.СоздатьЭлемент();
			АлгоритмыОбъект.Родитель	 = РодительТекущийТитул;
			АлгоритмыОбъект.Наименование = СокрЛП(СтрокаНастроек.ЗаголовокОбласти);
			
		КонецЕсли;
		
		АлгоритмыОбъект.ТипОбъекта 						= ПараметрыПроцедуры.ТипОбъекта;
		АлгоритмыОбъект.ВозвращаемоеЗначение			= СтрокаНастроек.ВозвращаемоеЗначение;
		АлгоритмыОбъект.ОписаниеВозвращаемогоЗначения	= СтрокаНастроек.ОписаниеЗначения; 
		АлгоритмыОбъект.Комментарий						= СтрокаНастроек.Комментарий; 
		АлгоритмыОбъект.Записать();    
		
		Результат.Вставить(СтрокаНастроек.ИмяОбласти, АлгоритмыОбъект.Ссылка);
	КонецЦикла;   
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Функция ПолучитьРодителяАлгоритмовЗаполненияЭПД(Знач Наименование, Знач ТипОбъекта, Знач ТекущийРодитель=Неопределено)
	
	НайденныйРодитель = Справочники.CW_ОбменГИСЭПДАлгоритмыЗаполненияРеквизитовЭПД.НайтиПоНаименованию(Наименование, Истина, ТекущийРодитель);
	Если Не НайденныйРодитель.Пустая() Тогда
		Возврат НайденныйРодитель;
	КонецЕсли;
	
	РодительОбъект = Справочники.CW_ОбменГИСЭПДАлгоритмыЗаполненияРеквизитовЭПД.СоздатьГруппу();
	РодительОбъект.Наименование = Наименование;
	РодительОбъект.ТипОбъекта 	= ТипОбъекта;
	РодительОбъект.Родитель 	= ТекущийРодитель;
	РодительОбъект.Записать();
	
	Возврат РодительОбъект.Ссылка;
	
КонецФункции


Процедура ЗаполнитьЭПД(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ИмяДокументаПоТипу = CW_ОбменГИСЭПДПереопределяемый.ИмяДокументаПоТипу(ПараметрыПроцедуры.ТипДокументаЭПД);
	
	Если ЗначениеЗаполнено(ПараметрыПроцедуры.ЭлектронныйПеревозочныйДокумент) Тогда
		ОбъектЭПД = ПараметрыПроцедуры.ЭлектронныйПеревозочныйДокумент.ПолучитьОбъект(); 
	Иначе
		ОбъектЭПД = Документы[ИмяДокументаПоТипу].СоздатьДокумент();
	КонецЕсли; 
	
	ОбъектЭПД.Дата 			= ПараметрыПроцедуры.Дата;
	ОбъектЭПД.Организация 	= ПараметрыПроцедуры.Организация;
	ОбъектЭПД.ТекущийТитул 	= ПараметрыПроцедуры.ВерсияТитула.Титул;
	ОбъектЭПД.ТекущийШаг 	= ПараметрыПроцедуры.ТекущийШаг;  
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектЭПД, "СсылкаТитулГрузоотправителяГрузоотправитель") Тогда
		ОбъектЭПД.СсылкаТитулГрузоотправителяГрузоотправитель = ПараметрыПроцедуры.СсылкаТитулГрузоотправителяГрузоотправитель;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектЭПД, "СсылкаТитулГрузоотправителяПеревозчик") Тогда
		ОбъектЭПД.СсылкаТитулГрузоотправителяПеревозчик = ПараметрыПроцедуры.СсылкаТитулГрузоотправителяПеревозчик;
	КонецЕсли;
	
	ПрефиксХранимыхДанных 	= "ХранимыеДанные";
	
	СтруктураРеквизитов 	= новый Структура;   
	
	Для Каждого СтрокаТаблицы из ПараметрыПроцедуры.ТаблицаЗначенийРеквизитов Цикл 
		
		Если СтрНайти(СтрокаТаблицы.ИмяРеквизита, "Ссылка" ) > 0 Тогда
			ЗаполнитьРеквизитыПоСсылке(СтрокаТаблицы, 
				СтруктураРеквизитов, 
				СтрокаТаблицы.ЗначениеРеквизита, 
				ПараметрыПроцедуры.ПрефиксТитула);
		КонецЕсли; 
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектЭПД, СтрокаТаблицы.ИмяРеквизита) Тогда
			ОбъектЭПД[СтрокаТаблицы.ИмяРеквизита] = СтрокаТаблицы.ЗначениеРеквизита;	
		КонецЕсли;
		
		ЧастиИмени = Новый Массив;    
		Если Не ПустаяСтрока(СтрокаТаблицы.ИмяТабличнойЧасти) Тогда
			ЧастиИмени.Добавить(СтрокаТаблицы.ИмяТабличнойЧасти);      
		КонецЕсли;
		Если СтрокаТаблицы.НомерСтрокиРеквизита > 0 Тогда
			ЧастиИмени.Добавить(СтрокаТаблицы.НомерСтрокиРеквизита);
		КонецЕсли;
		ЧастиИмени.Добавить(СтрокаТаблицы.ИмяРеквизита);
		
		НовыйКлюч 		= СтрСоединить(ЧастиИмени, "__");	
		НовоеЗначение 	= СтрокаТаблицы.ЗначениеРеквизита;   
		
		Если СтрНайти(СтрокаТаблицы.ИмяРеквизита, ПрефиксХранимыхДанных) > 0 Тогда
			Если ТипЗнч(НовоеЗначение) = Тип("Структура") Тогда
				СсылкаХранимыеДанные = ПолучитьСсылкуНаХранимыеДанные(НовоеЗначение);
				СтруктураРеквизитов.Вставить(НовыйКлюч, СсылкаХранимыеДанные); 
				
				Если СтрНайти(НовыйКлюч, "СторонаПодписавшаяДокумент") > 0 Тогда
					Для Каждого Строка из СсылкаХранимыеДанные.Данные Цикл     
						НовыйКлючХранимыхДанных = СтрокаТаблицы.ИмяТабличнойЧасти+"__"+СтрокаТаблицы.НомерСтрокиРеквизита+"__"+Строка.Имя;		
						СтруктураРеквизитов.Вставить(НовыйКлючХранимыхДанных, Строка.Значение);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;  
		ИначеЕсли ТипЗнч(НовоеЗначение) = Тип("Структура") Тогда
			Если  НовоеЗначение.Свойство("Тип")
				и НовоеЗначение.Тип = Тип("СправочникСсылка.СтроковыеЗначенияЭПД") Тогда
				СсылкаСтроковыеЗначенияЭПД = Справочники.СтроковыеЗначенияЭПД.НайтиПоНаименованию(НовоеЗначение.Наименование,Истина);
				Если СсылкаСтроковыеЗначенияЭПД.Пустая() Тогда
					ОбъектСтроковыеЗначенияЭПД = Справочники.СтроковыеЗначенияЭПД.СоздатьЭлемент();
					ОбъектСтроковыеЗначенияЭПД.Наименование = НовоеЗначение.Наименовани;
					ОбъектСтроковыеЗначенияЭПД.Записать();
					СсылкаСтроковыеЗначенияЭПД =  ОбъектСтроковыеЗначенияЭПД.Ссылка;  
				КонецЕсли;   
				СтруктураРеквизитов.Вставить(НовыйКлюч, СсылкаСтроковыеЗначенияЭПД);  
			КонецЕсли;
		Иначе
			СтруктураРеквизитов.Вставить(НовыйКлюч, НовоеЗначение);
		КонецЕсли;  
		
	КонецЦикла;
	
	ОбъектЭПД.ДополнительныеСвойства.Вставить("ВерсияТитула", 			ПараметрыПроцедуры.ВерсияТитула);
	ОбъектЭПД.ДополнительныеСвойства.Вставить("СтруктураРеквизитов", 	СтруктураРеквизитов);
	ОбъектЭПД.Записать(); 
	
	
	ПоместитьВоВременноеХранилище(ОбъектЭПД.Ссылка, АдресРезультата)
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоСсылке(СтрокаТаблицы, КонтейнерРеквизитов, ЗначениеРеквизита, ПрефиксТитула) 
	
	ПрефиксРеквизитов = СтрЗаменить(СтрокаТаблицы.ИмяРеквизита, "Ссылка", "");   
	
	Если ТипЗнч(ЗначениеРеквизита) = ОбменСГИСЭПДКлиентСервер.ПолучитьТипОрганизация()
		Или ТипЗнч(ЗначениеРеквизита) = ОбменСГИСЭПДКлиентСервер.ПолучитьТипКонтрагент() Тогда
		ЗаполнитьРеквизитыУчастника(ЗначениеРеквизита, ПрефиксРеквизитов, 
			СтрокаТаблицы, КонтейнерРеквизитов, ПрефиксТитула);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет реквизиты участника.
// 
// Параметры:
//  Участник - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - Участник
//  ПрефиксРеквизитов - Строка - Префикс реквизитов
//  КонтейнерРеквизитов - Структура, ДанныеФормыЭлементКоллекции - Контейнер реквизитов
//  Форма - ФормаКлиентскогоПриложения 
//  ПрефиксТитула - Неопределено, Строка - Префикс титула
Процедура ЗаполнитьРеквизитыУчастника(Участник, ПрефиксРеквизитов, СтрокаТаблицы, КонтейнерРеквизитов, ПрефиксТитула=Неопределено) 
	
	ПостфиксТелефоны = "НомераТелефонов";
	ПостфиксЭлПочта = "АдресаЭлектроннойПочты";
	
	ЕстьТелефоны = Ложь;
	ЕстьЭлПочта = Ложь;
	Если ПрефиксРеквизитов <> "Заказчик" Тогда
		ЕстьТелефоны = Истина;
		ЕстьЭлПочта = Истина;
	КонецЕсли;
	
	ПрефиксПодчиненныхТаблиц = "";
	Если ПрефиксТитула <> Неопределено И СтрНачинаетсяС(ПрефиксРеквизитов, ПрефиксТитула) = Ложь Тогда
		ПрефиксПодчиненныхТаблиц = ПрефиксТитула;
	КонецЕсли;
	
	#Если Сервер Тогда
		МодульОбменСГИСЭПД = ОбменСГИСЭПД;
	#Иначе
		МодульОбменСГИСЭПД = ОбменСГИСЭПДВызовСервера;
	#КонецЕсли
	
	РеквизитыУчастника = МодульОбменСГИСЭПД.ПолучитьРеквизитыУчастника(Участник, Ложь);
	
	ПрефиксКонтактов = "";
	ПрефиксАдреса = "";
	Если ПрефиксРеквизитов = "ТитулФрахтователяФрахтователь"
		Или ПрефиксРеквизитов = "ТитулФрахтователяФрахтовщик"
		Или ПрефиксРеквизитов = "ТитулФрахтователяСоставитель"
		Или ПрефиксРеквизитов = "ТитулФрахтовщикаСоставитель" Тогда
		Если РеквизитыУчастника.Свойство("ЮЛ_ИНН") И ЗначениеЗаполнено(РеквизитыУчастника.ЮЛ_ИНН) Тогда
			ПрефиксКонтактов = "ЮЛ";
			ПрефиксАдреса = "ЮЛ";
		Иначе
			ПрефиксКонтактов = "ФЛ";
			ПрефиксАдреса = Неопределено;
		КонецЕсли;
	ИначеЕсли ПрефиксРеквизитов = "ТитулФрахтовщикаФрахтовщик"
		Или ПрефиксРеквизитов = "ТитулПеревозчикаПеревозчик"
		Или ПрефиксРеквизитов = "ТитулПеревозчикаГрузоотправитель"
		Или ПрефиксРеквизитов = "ТитулПеревозчикаГрузополучатель"
		Или ПрефиксРеквизитов = "ТитулПеревозчикаЛицоОсуществляющееПогрузку"
		Или ПрефиксРеквизитов = "ТитулПеревозчикаЛицоОсуществляющееПриемку"
		Или ПрефиксРеквизитов = "ДопТитулПеревозчикаПеревозчик"
		Или ПрефиксРеквизитов = "ДопТитулПеревозчикаГрузоотправитель"
		Или ПрефиксРеквизитов = "ДопТитулПеревозчикаГрузополучатель"
		Или ПрефиксРеквизитов = "ДопТитулПеревозчикаЛицоОсуществляющееПогрузку"
		Или ПрефиксРеквизитов = "ДопТитулПеревозчикаЛицоОсуществляющееПриемку" Тогда
		Если (РеквизитыУчастника.Свойство("ЮЛ_ИНН") И ЗначениеЗаполнено(РеквизитыУчастника.ЮЛ_ИНН))
			ИЛИ (РеквизитыУчастника.Свойство("ЮЛ_КПП") И ЗначениеЗаполнено(РеквизитыУчастника.ЮЛ_КПП)) Тогда
			ПрефиксКонтактов = "ЮЛ";
			ПрефиксАдреса = "ЮЛ";
		Иначе
			ПрефиксКонтактов = "ИП";
			ПрефиксАдреса = Неопределено;
		КонецЕсли;	
	КонецЕсли;
	
	СтруктураДляЗаполнения = Новый Структура;
	Для Каждого КиЗ Из РеквизитыУчастника Цикл
		Если КиЗ.Ключ <> ПостфиксТелефоны И КиЗ.Ключ <> ПостфиксЭлПочта Тогда
			Если СтрНачинаетсяС(КиЗ.Ключ, "Адрес") И ПрефиксАдреса <> Неопределено Тогда
				КороткоеИмя = ПрефиксАдреса + КиЗ.Ключ;	
			Иначе
				КороткоеИмя = КиЗ.Ключ
			КонецЕсли;   
			
			Если Не ПустаяСтрока(СтрокаТаблицы.ИмяТабличнойЧасти) Тогда
				ИмяРеквизита = СтрокаТаблицы.ИмяТабличнойЧасти +"__"+ СтрокаТаблицы.НомерСтрокиРеквизита + "__" + ПрефиксРеквизитов + КороткоеИмя ; 
			Иначе
				ИмяРеквизита = ПрефиксРеквизитов + КороткоеИмя;
			КонецЕсли; 
			
			СтруктураДляЗаполнения.Вставить(ИмяРеквизита, КиЗ.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(КонтейнерРеквизитов) = Тип("Структура") Тогда
		Для Каждого КиЗ Из СтруктураДляЗаполнения Цикл
			КонтейнерРеквизитов.Вставить(КиЗ.Ключ, КиЗ.Значение);	
		КонецЦикла;	
	Иначе
		ЗаполнитьЗначенияСвойств(КонтейнерРеквизитов, СтруктураДляЗаполнения);
	КонецЕсли;
	
	Если ЕстьТелефоны = Истина И РеквизитыУчастника.Свойство(ПостфиксТелефоны) Тогда
		НомерСтроки = 0;
		Для Каждого Телефон Из РеквизитыУчастника[ПостфиксТелефоны] Цикл
			НомерСтроки = НомерСтроки + 1;
			КонтейнерРеквизитов.Вставить(ПрефиксПодчиненныхТаблиц + ПрефиксРеквизитов + ПрефиксКонтактов + ПостфиксТелефоны 
			+ "__" + НомерСтроки + "__Телефон", Телефон);
		КонецЦикла;
	КонецЕсли;

	Если ЕстьЭлПочта = Истина И РеквизитыУчастника.Свойство(ПостфиксЭлПочта) Тогда
		НомерСтроки = 0;
		Для Каждого АдресЭлектроннойПочты Из РеквизитыУчастника[ПостфиксЭлПочта] Цикл
			НомерСтроки = НомерСтроки + 1;
			КонтейнерРеквизитов.Вставить(ПрефиксПодчиненныхТаблиц + ПрефиксРеквизитов + ПрефиксКонтактов + ПостфиксЭлПочта 
			+ "__" + НомерСтроки + "__АдресЭлектроннойПочты", АдресЭлектроннойПочты);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСсылкуНаХранимыеДанные(ХранимыеДанные) 
	
	ПрефиксХранимыхДанных 	= "ХранимыеДанные";     
	
	ВремДанные = ХранимыеДанные.Данные.Скопировать(); 
	ВремДанные.Очистить();
	
	Для Каждого СтрокаТЧ Из ХранимыеДанные.Данные Цикл  
		Если СтрНайти(СтрокаТЧ.Имя, ПрефиксХранимыхДанных) > 0 Тогда 
			Если ТипЗнч(СтрокаТЧ.Значение) = Тип("Структура") Тогда 
				СсылкаХранимыеДанные = ПолучитьСсылкуНаХранимыеДанные(СтрокаТЧ.Значение); 
				
				НоваяСтрока = ВремДанные.Добавить();	
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);	
				НоваяСтрока.Значение = СсылкаХранимыеДанные;
			КонецЕсли;   
			
			Если СтрНайти(СтрокаТЧ.Имя, "СторонаПодписавшаяДокумент") > 0 Тогда
				Для Каждого Строка из СсылкаХранимыеДанные.Данные Цикл  
					НоваяСтрока = ВремДанные.Добавить();	
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);	
					
					НоваяСтрока.ИмяТабличнойЧасти = СтрокаТЧ.ИмяТабличнойЧасти;
					НоваяСтрока.НомерСтрокиТЧ     = СтрокаТЧ.НомерСтрокиТЧ; 
				КонецЦикла;
			КонецЕсли;
		Иначе
			НоваяСтрока = ВремДанные.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);	
		КонецЕсли;
	КонецЦикла; 
	ХранимыеДанные.Данные = ВремДанные;
	
	
	МассивРеквизитов = Новый Массив;
	Для Каждого СтрокаТЧ Из ХранимыеДанные.Данные Цикл  
		Если СтрокаТЧ.ИмяТабличнойЧасти = "" Тогда
			СтруктураРеквизита = Новый Структура;
			СтруктураРеквизита.Вставить("Имя", 				СтрокаТЧ.Имя);
			СтруктураРеквизита.Вставить("Значение", 		СтрокаТЧ.Значение);
			СтруктураРеквизита.Вставить("Представление", 	СтрокаТЧ.Представление);
			
			МассивРеквизитов.Добавить(СтруктураРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	НаименованиеХранимыхДанных = ОбменСГИСЭПД.ПредставлениеХранимыхДанныхЭПД(МассивРеквизитов, ХранимыеДанные.ИмяОбъекта, ХранимыеДанные.ГруппаДанных);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХранимыеДанныеЭПД.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХранимыеДанныеЭПД КАК ХранимыеДанныеЭПД
	|ГДЕ
	|	ХранимыеДанныеЭПД.Наименование = &Наименование
	|	И ХранимыеДанныеЭПД.ГруппаДанных = &ГруппаДанных";  
	
	Запрос.УстановитьПараметр("Наименование", НаименованиеХранимыхДанных);
	Запрос.УстановитьПараметр("ГруппаДанных", ХранимыеДанные.ГруппаДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	ОбъектХранимыеДанныеЭПД = Справочники.ХранимыеДанныеЭПД.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ОбъектХранимыеДанныеЭПД, ХранимыеДанные, ,"Данные"); 
	
	Для Каждого СтруктураСтроки из ХранимыеДанные.Данные Цикл
		НоваяСтрока = ОбъектХранимыеДанныеЭПД.Данные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураСтроки); 
	КонецЦикла; 
	
	ОбъектХранимыеДанныеЭПД.Записать();
	
	Возврат ОбъектХранимыеДанныеЭПД.Ссылка;
	
КонецФункции

  
Функция ПривестиИмяОбласти(Знач ОбластьИмя) Экспорт
	
	ПриведенныеИменаРеквизитов = ПриведенныеИменаРеквизитов();
	
	НовОбластьИмя = ОбластьИмя;
	Для Каждого КлючЗначение из ПриведенныеИменаРеквизитов Цикл
		НовОбластьИмя = СтрЗаменить(НовОбластьИмя, КлючЗначение.Значение, КлючЗначение.Ключ);	
	КонецЦикла;  
	
	Возврат НовОбластьИмя;
	
КонецФункции  

Функция ВостановитьПриведенноеИмяРеквизита(Знач ПриведенноеИмяРеквизита) Экспорт
	
	ПриведенныеИменаРеквизитов = CW_ОбменГИСЭПДДополнительный.ПриведенныеИменаРеквизитов();
	
	НовИмяРеквизита = ПриведенныеИменаРеквизитов.Получить(ПриведенноеИмяРеквизита);
	НовИмяРеквизита = ?(НовИмяРеквизита = Неопределено, ПриведенноеИмяРеквизита, НовИмяРеквизита);
	
	Возврат НовИмяРеквизита;

КонецФункции

Функция ПриведенныеИменаРеквизитов() Экспорт

	Именареквизитов = Новый Соответствие;
	Именареквизитов.Вставить("ФЛИНН", 	"ФЛ_ИНН");
	Именареквизитов.Вставить("ИПИНН", 	"ИП_ИНН");
	Именареквизитов.Вставить("ЮЛИНН", 	"ЮЛ_ИНН");
	Именареквизитов.Вставить("ЮЛКПП", 	"ЮЛ_КПП");
	Именареквизитов.Вставить("ЮЛОГРН", 	"ЮЛ_ОГРН");
	
	Возврат Именареквизитов;
	
КонецФункции  
