#Область ПрограммныйИнтерфейс

Процедура ПараметрыТранспортаНачалоВыбора(Форма, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	
	НастройкиКомпоновкиФормы = Новый НастройкиКомпоновкиДанных;
 
	ЭлементОтбора = НастройкиКомпоновкиФормы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Тип");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = "ПараметрыТранспортногоСредства";
	ЭлементОтбора.Использование = Истина; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки",      НастройкиКомпоновкиФормы);
	ПараметрыФормы.Вставить("ГруппаДанных",                "ТитулГрузоотправителяПараметрыТранспортногоСредства");
	ПараметрыФормы.Вставить("Тип",                         "ПараметрыТранспортногоСредства");
	ПараметрыФормы.Вставить("ИмяОбъекта",                  "Документ.ЭлектронныйЗаказЗаявка");
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОписаниеОповещения = НОвый ОписаниеОповещения("ВыборТранспортногоСредстваЗавершение", ЭтотОбъект, Форма);
	 
	ОткрытьФорму("Справочник.ХранимыеДанныеЭПД.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
КонецПроцедуры   

Процедура ПараметрыТранспортаСоздание(Форма, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = НОвый ОписаниеОповещения("СозданиеТранспортногоСредстваЗавершение", ЭтотОбъект, Форма);
	ОткрытьФорму("Документ.ЭлектронныйЗаказЗаявка.Форма.ПараметрыТранспортногоСредства",,ЭтотОбъект,,,,ОписаниеОповещения);
КонецПроцедуры

Процедура УстановитьМобильноеПриложение(Форма) Экспорт
	Если НЕ ОбменСГИСЭПДБПВызовСервера.ИспользуетсяОбменЭлектроннымиДокументами() Тогда
		ВопросНастройкаЭДО(Форма);
	Иначе
		ПодключитьПриложение(Форма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыборТранспортногоСредстваЗавершение(ПараметрыТранспортногоСредстваЗначение, Форма) Экспорт 
	Если ПараметрыТранспортногоСредстваЗначение = Неопределено 
		ИЛИ Форма.ПараметрыТранспортногоСредства = ПараметрыТранспортногоСредстваЗначение Тогда
		
		Возврат;
	КонецЕсли;

	Форма.ПараметрыТранспортногоСредства = ПараметрыТранспортногоСредстваЗначение;
	Форма.Модифицированность = Истина;
КонецПроцедуры 


Процедура СозданиеТранспортногоСредстваЗавершение(ПараметрыТранспортногоСредстваЗначение, Форма) Экспорт
	Если НЕ ЗначениеЗаполнено(ПараметрыТранспортногоСредстваЗначение) 
		ИЛИ НЕ ПараметрыТранспортногоСредстваЗначение.Свойство("ДанныеЗаполненияРеквизитовФормы") Тогда
		
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ГруппаДанных","ТитулГрузоотправителяПараметрыТранспортногоСредства");
	ДанныеЗаполнения.Вставить("Тип", "ПараметрыТранспортногоСредства");
	ДанныеЗаполнения.Вставить("ИмяОбъекта", "Документ.ЭлектронныйЗаказЗаявка");
	ДанныеЗаполнения.Вставить("ДанныеЗаполненияРеквизитовФормы", ПараметрыТранспортногоСредстваЗначение.ДанныеЗаполненияРеквизитовФормы);
	
	Форма.ПараметрыТранспортногоСредства = ОбменСГИСЭПДБПВызовСервера.СоздатьХранимыеДанныеЭПД(ДанныеЗаполнения);
	Форма.Модифицированность = Истина;
КонецПроцедуры 

Асинх Процедура ВопросНастройкаЭДО(Форма)
	Если НЕ ЭлектронноеВзаимодействиеБПВызовСервера.ЕстьПравоНастройкиЭДО() Тогда
		ТекстСообщения = НСтр("ru = 'Недостаточно прав для настройки обмена электронными документами. Обратитесь к администратору.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ТекстВопроса = НСтр("ru = 'Для подключения мобильного приложения необходима настройка ЭДО. Продолжить?'");
	Результат = Ждать ВопросАсинх(ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПодключитьЭДО(Форма);
	КонецЕсли;
КонецПроцедуры

Процедура ПодключитьЭДО(Форма)
	ПараметрыСозданияЗаписи = СинхронизацияЭДОКлиент.НовыеПараметрыСозданияУчетнойЗаписи();
	ПараметрыСозданияЗаписи.СпособыОбмена.Добавить(ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезСервис1СЭДО"));
	ПараметрыСозданияЗаписи.ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодключитьЭДОЗавершение", ЭтотОбъект, Форма);
	СинхронизацияЭДОКлиент.СоздатьУчетнуюЗапись(ПараметрыСозданияЗаписи);
КонецПроцедуры 

Процедура ПодключитьЭДОЗавершение(Результат, Форма) Экспорт
	Если НЕ ОбменСГИСЭПДБПВызовСервера.ИспользуетсяОбменЭлектроннымиДокументами() Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьПриложение(Форма);
КонецПроцедуры

Процедура ПодключитьПриложение(Форма)
	Если ОбменСГИСЭПДБПВызовСервера.ЕстьПодключенныеМобильныеПриложения() Тогда
		СервисВзаимодействияМПЭПДКлиент.ОткрытьФормуСпискаМП(Форма);
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Идентификатор", "");
		ПараметрыФормы.Вставить("УчетнаяЗаписьЭДО", "");
		ПараметрыФормы.Вставить("Организация", "");
		
		СервисВзаимодействияМПЭПДКлиент.ОткрытьФормуПользователяМобильногоУстройства(ПараметрыФормы, Форма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
