
Процедура НачатьОбновлениеМодуля(Форма) Экспорт      
	
	ПараметрыПродолжения = CW_ОбновлениеКонфигурацииСервер.ОбновлениеПриостановлено();  
	ПараметрыПродолжения.Вставить("Форма", Форма);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьКонтрольЛегальностиОбновления", CW_ОбновлениеКонфигурацииКлиент, ПараметрыПродолжения);
	
	Если ПараметрыПродолжения.Приостановлено Тогда    
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, ПараметрыПродолжения.Результат);
	Иначе
		ОткрытьФорму("Обработка.CW_КонтрольЛегальностиОбновленияМодуля.Форма.КонтрольЛегальностиОбновления",,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);     
	КонецЕсли;
	
КонецПроцедуры      

Процедура ОбновитьИнтерфейсПрограммыПослеОбновления() Экспорт
	
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	
КонецПроцедуры    

Процедура ПервыйЗапускКонфигурации() Экспорт
	
	ОписаниеОповещения = новый ОписаниеОповещения("ЗавершитьНачальноеЗаполнение", CW_ОбновлениеКонфигурацииКлиент);
	ОткрытьФорму("ОбщаяФорма.CW_ПрогрессПервогоЗапуска",,,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры
