
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если СтрНайти(ПараметрыВыполненияКоманды.Источник.ИмяФормы, "Документ") <> 0 Тогда
		ОткрытьФорму("Документ."+_Метаданные(ПараметрКоманды)+".ФормаСписка",Новый Структура("ТекущаяСтрока",ПараметрКоманды),,Истина);
	ИначеЕсли СтрНайти(ПараметрыВыполненияКоманды.Источник.ИмяФормы, "Справочник") <> 0 Тогда
		ОткрытьФорму("Справочник."+_Метаданные(ПараметрКоманды)+".ФормаСписка",Новый Структура("ТекущаяСтрока",ПараметрКоманды),,Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция _Метаданные(Параметр)
	// --- 
	
	Возврат(Параметр.Метаданные().Имя);
	
	// --- 
КонецФункции
 