&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодОтчета = НачалоКвартала(ТекущаяДата());
	УстановитьПредставлениеПериода();	            
	ПродолжитьИзменениеКварталаНаСервере();
	РежимВыгрузкиВОтчетПриИзмененииНаСервере();    
	
	//Для Версии КОРП                              
	ЭтоВерсияКОРП = ВариантыПриложений.ЭтоВерсияКОРП();
	Элементы.ГруппаОбособленныеПодразделения.Видимость = ЭтоВерсияКОРП;
	//Для Версии КОРП                              
	
	СоответствиеДействующиеПриказы = CW_РеестрыНДС0СерверВызовСервера.ПолучитьДействующиеПриказы();
	ДействующиеПриказы = Новый ФиксированноеСоответствие(СоответствиеДействующиеПриказы);
	
	СоответствиеПриложений = CW_РеестрыНДС0Дополнительный.ПолучитьСоответствиеПриложенияИмениФормыОтчета();
	СоответствиеПриложенийОтчета = Новый ФиксированноеСоответствие(СоответствиеПриложений);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьМассивОбособленныхПодразделений()
	
	Массив = Новый Массив;
	
	Для Каждого ЭлементСписка из ОбособленныеПодразделения Цикл
		Если Не ЭлементСписка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Массив.Добавить(ЭлементСписка.Значение);
	КонецЦикла;

	Возврат Массив;
	
КонецФункции


&НаСервере
Процедура УстановитьПредставлениеПериода()
	
	ПериодОтчетаСтрока = Формат(ПериодОтчета,"ДФ='к ""квартал"" гггг ""г.""'");
	
КонецПроцедуры

&НаКлиенте
Процедура КвраталНазад(Команда)   
	
	ОбработатьИзменениеКварталаНаСервере("НАЗАД");
	
КонецПроцедуры

&НаКлиенте
Процедура КварталВперед(Команда)
	
	ОбработатьИзменениеКварталаНаСервере("ВПЕРЕД");
	
КонецПроцедуры   

&НаСервере
Процедура ОбработатьИзменениеКварталаНаСервере(Направление)  
	
	Если Направление = "НАЗАД" Тогда
		ПериодОтчета = НачалоКвартала(ПериодОтчета) - 1;
	ИначеЕсли Направление = "ВПЕРЕД" Тогда
		ПериодОтчета = КонецКвартала(ПериодОтчета) + 1;
	КонецЕсли;
	
	ПродолжитьИзменениеКварталаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПродолжитьИзменениеКварталаНаСервере()
	
	ПериодОтчета = НачалоКвартала(ПериодОтчета);
	
	УстановитьПредставлениеПериода();  
	
	Если ЭтоВерсияКОРП Тогда
		ЗаполнитьСписокОбособленныхПодразделений();
	КонецЕсли;
	
	ВидТранспортаПриИзмененииНаСервере();
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСписокОбособленныхПодразделений()
	
	ОбособленныеПодразделения.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CW_РеестрыНДС0ЗаписиРеестра.Организация КАК Организация
	|ИЗ
	|	Справочник.CW_РеестрыНДС0ЗаписиРеестра КАК CW_РеестрыНДС0ЗаписиРеестра
	|ГДЕ
	|	CW_РеестрыНДС0ЗаписиРеестра.ПериодОтчета = &ПериодОтчета
	|	И CW_РеестрыНДС0ЗаписиРеестра.ПометкаУдаления = ЛОЖЬ
	|	И CW_РеестрыНДС0ЗаписиРеестра.ПодтверждениеНДС = ЗНАЧЕНИЕ(Перечисление.CW_РеестрыНДС0СтатусыЗаписиРеестра.Подтвержден)
	|	И CW_РеестрыНДС0ЗаписиРеестра.Организация.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация
	|АВТОУПОРЯДОЧИВАНИЕ"; 
	
	Запрос.УстановитьПараметр("ПериодОтчета", 			ПериодОтчета);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", 	Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбособленныеПодразделения.Добавить(Выборка.Организация,,Истина);
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура ВидТранспортаПриИзменении(Элемент)
	ВидТранспортаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидТранспортаПриИзмененииНаСервере()
	
	ФормированиеВозможно = Ложь;
	
	Приказ = Неопределено;
	
	Если ЗначениеЗаполнено(ВидТранспорта) Тогда
		Приказ 					= ДействующиеПриказы.Получить(ВидТранспорта);
		ПриложениеПриказа 		= ПолучитьПриложениеПриказа();
		ФормированиеВозможно 	= CW_РеестрыНДС0Дополнительный.ФормаРеестраДоступнаДляВыгрузки(ПриложениеПриказа);
	КонецЕсли;
	
	Элементы.ГруппаРежимВыгрузки.Доступность	= ФормированиеВозможно и ЗначениеЗаполнено(ВидТранспорта);   
	Элементы.ФормаВыгрузить.Доступность 		= ФормированиеВозможно и ЗначениеЗаполнено(ВидТранспорта);   
	Элементы.ПриложениеПриказа.Доступность 		= ФормированиеВозможно и ЗначениеЗаполнено(ВидТранспорта);  
	Элементы.ДекорацияПредупреждение.Видимость  = Не ФормированиеВозможно и ЗначениеЗаполнено(ВидТранспорта);   

КонецПроцедуры  

&НаКлиенте
Процедура Выгрузить(Команда)   
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана организация",,"Организация",,Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидТранспорта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрано приложение",,"ВидТранспорта",,Отказ);
	КонецЕсли;   
	
	Если Не ЗначениеЗаполнено(ПриложениеПриказа) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить приложение",,"ПриложениеПриказа",,Отказ);
	КонецЕсли;   
	
	Если РежимВыгрузки = 1 и Не ЗначениеЗаполнено(РегламентированныйОтчет) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран регламентированный отчет",,"РегламентированныйОтчет",,Отказ);
	КонецЕсли;
	                                              
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ВыбранныеОбособленныеПодразделения = Новый Массив;
	Если ЭтоВерсияКОРП Тогда
		ВыбранныеОбособленныеПодразделения = ПолучитьМассивОбособленныхПодразделений();
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("ПериодОтчета",				ПериодОтчета);
	Ответ.Вставить("Организация", 				Организация);
	Ответ.Вставить("ОбособленныеПодразделения",	ВыбранныеОбособленныеПодразделения);
	Ответ.Вставить("Приложение",				ПриложениеПриказа);
	Ответ.Вставить("РежимВыгрузки",				РежимВыгрузки);
	Ответ.Вставить("РегламентированныйОтчет",	РегламентированныйОтчет);
	Ответ.Вставить("ПоказатьОтчет",				Истина);
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьПриложениеПриказа()
	
	Возврат CW_РеестрыНДС0Сервер.ПолучитьПриложениеПриказа(Приказ, ВидТранспорта);
	
КонецФункции

&НаКлиенте
Процедура РежимВыгрузкиВОтчетПриИзменении(Элемент)
	РежимВыгрузкиВОтчетПриИзмененииНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура РежимВыгрузкиВФайлПриИзменении(Элемент)
	РежимВыгрузкиВОтчетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РежимВыгрузкиВОтчетПриИзмененииНаСервере()
	
	Элементы.РегламентированныйОтчет.Доступность = (РежимВыгрузки = 1);

КонецПроцедуры

&НаКлиенте
Процедура РегламентированныйОтчетНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	ИсточникОтчета = СоответствиеПриложенийОтчета.Получить(ПриложениеПриказа);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация",		Организация); 
	СтруктураОтбора.Вставить("ДатаНачала",		ПериодОтчета); 
	СтруктураОтбора.Вставить("ИсточникОтчета",	ИсточникОтчета);  
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РежимВыбора", 		Истина);
	СтруктураПараметров.Вставить("ЗакрыватьприВыборе", 	Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", 	Ложь);  
	СтруктураПараметров.Вставить("ТекущаяСтрока", 		РегламентированныйОтчет);  
	СтруктураПараметров.Вставить("Отбор", 				СтруктураОтбора);  
	
	ОткрытьФорму("ОбщаяФорма.CW_ВыборРегламентированногоОтчета", СтруктураПараметров, Элемент);

КонецПроцедуры    

&НаКлиенте
Процедура ПриложениеПриказаПриИзменении(Элемент)
	ПриложениеПриказаПриИзмененииНаСервере();
КонецПроцедуры  

&НаСервере
Процедура ПриложениеПриказаПриИзмененииНаСервере()
	
	МассивДоступнаВыгрузка 		= CW_РеестрыНДС0СерверВызовСервера.МассивВыгрузкаДоступна();
	ЗаполнениеОтчетаДоступно 	= МассивДоступнаВыгрузка.Найти(ПриложениеПриказа) <> Неопределено;
	
	Элементы.Группа3.Доступность = ЗаполнениеОтчетаДоступно;
	
	Если Не ЗаполнениеОтчетаДоступно тогда
		РежимВыгрузки = 0;	
		РежимВыгрузкиВОтчетПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере() 
	
	//Для Версии КОРП            
	Если ЭтоВерсияКОРП Тогда
		ЗаполнитьСписокОбособленныхПодразделений();
	КонецЕсли;
	//Для Версии КОРП 
	
КонецПроцедуры




