
&НаСервере
Процедура СтандартнаяНастройкаНаСервере()
	
	Справочники.CW_ПоказателиРасчетаРасходаТоплива.ЗаполнитьНачальныеНастрокиРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартнаяНастройка(Команда)
	
	СтандартнаяНастройкаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("УчитыватьПогрешностьИзмеренияОстаткаТоплива", ПолучитьФункциональнуюОпцию("CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива"));
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти