#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМенеджераКлиента(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_МенеджерыПродажКлиентовСрезПоследних.МенеджерПродаж КАК МенеджерПродаж
	               |ИЗ
	               |	РегистрСведений.CW_МенеджерыПродажКлиентов.СрезПоследних(&ДатаСреза, Контрагент = &Контрагент) КАК CW_МенеджерыПродажКлиентовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза"	, ?(ЗначениеЗаполнено(СтруктураПараметров.ДатаСреза),СтруктураПараметров.ДатаСреза , ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент"	, СтруктураПараметров.Контрагент);
	
	Выборка  = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МенеджерПродаж;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
#КонецЕсли