#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Реестр платежей";
	СтруктураОписания.Описание 					= "Реестр платежей";
	
	СтруктураОписания.Версия					= "3.2.8.1";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.15.8";
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления
	
	Возврат СтруктураОписания;

КонецФункции  

Процедура Регистрация(Ссылка) Экспорт
	
	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_РеестрПлатежей");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "Реестр платежей"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		

	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);

КонецПроцедуры

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	Возврат Истина;
	
КонецФункции


//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления

Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт
	
	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	КонецЕсли;
	
	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();

	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхСчета", Истина);
	Если КоличествоЭксземпляров <> Неопределено Тогда 
		РезультатПечати.Параметры.Количество = КоличествоЭксземпляров;
		РезультатПечати.Параметры.Печать 	 = (КоличествоЭксземпляров <> 0);  
	Иначе
		РезультатПечати.Параметры.Количество = 2;
		РезультатПечати.Параметры.Печать 	 = Истина;  
	КонецЕсли;  

	ПодписьИПечать = Ложь; 
	НастройкиПечати.Свойство("ПодписьИПечать",ПодписьИПечать);
	
	ДляРассылки = Ложь; 
	НастройкиПечати.Свойство("ДляРассылки",ДляРассылки);
	
	Номер 			= СсылкаНаОбъект.Номер;
	ДатаРеестра 	= СсылкаНаОбъект.Дата;
	Организация 	= СсылкаНаОбъект.Организация;
	РасчетныйСчет 	= СсылкаНаОбъект.СчетОрганизации;
	Валюта 			= СсылкаНаОбъект.Валюта;
	
	// ---------------------------------------------------------------------------- 
	// формируем представление
	ПредставлениеДокумента     = "Реестр платежей №"    + Номер+" от "  + Формат(ДатаРеестра,"ДФ=dd.MM.yyyy");
	
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(ПредставлениеДокумента));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НомерДокумента",	Номер);
	ПараметрыПроцедуры.Вставить("ДатаДокумента",	ДатаРеестра);
	
	РезультатПечати.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы
	
	// ---------------------------------------------------------------------------- 
	// формируем печатную форму
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	//Компановка печатной формы
	//Получаем схему из макета
	СхемаКомпоновкиДанных = ПолучитьМакет("МакетРеестраПлатежей");
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СсылкаРеестрПлатежей", 	СсылкаНаОбъект);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаРеестра", 			ДатаРеестра);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация",			Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("РасчетныйСчет",			РасчетныйСчет);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Валюта", 				Валюта);
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	ТабличныйДокумент.Очистить();
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);   
	//Компановка печатной формы
	
	ТабличныйДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	
	РезультатПечати.Вставить("ОтображатьГруппировки", Ложь);
	РезультатПечати.ПечатнаяФорма = ТабличныйДокумент;
	
    Возврат РезультатПечати;
	
КонецФункции
#КонецЕсли