
Процедура ПередЗаписью(Отказ)
	
	Если Предопределенный Тогда
		ПроверитьСменуРодителяПредпоределенногоЭлемента();
	КонецЕсли;
	
КонецПроцедуры    

Процедура ПроверитьСменуРодителяПредпоределенногоЭлемента()
	
	РодителиПредопределенных = ПолучитьСоответствиеРодителей();
	
	РодительЭлемента = РодителиПредопределенных.Получить(Ссылка);  
	
	Если Родитель <> РодительЭлемента Тогда
		ВызватьИсключение "Запрещено менять иерархию предопределенных элементов!";
	КонецЕсли;
	
КонецПроцедуры  

Функция ПолучитьСоответствиеРодителей()
	
	ЯчейкиПриложений = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений;
	
	СоответствиеРодителей = Новый Соответствие; 
	
	//РеестрНДС2021Кв2
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2021Кв2, 			   ЯчейкиПриложений.ПустаяСсылка());
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение07, ЯчейкиПриложений.РеестрНДС2021Кв2);
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение08, ЯчейкиПриложений.РеестрНДС2021Кв2);
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение09, ЯчейкиПриложений.РеестрНДС2021Кв2);
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение10, ЯчейкиПриложений.РеестрНДС2021Кв2);
	//--РеестрНДС2021Кв2
	
	//РеестрНДС2024Кв2
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2024Кв2, 			   ЯчейкиПриложений.ПустаяСсылка());
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение06, ЯчейкиПриложений.РеестрНДС2024Кв2);
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение07, ЯчейкиПриложений.РеестрНДС2024Кв2);
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение08, ЯчейкиПриложений.РеестрНДС2024Кв2);
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение09, ЯчейкиПриложений.РеестрНДС2024Кв2);
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение10, ЯчейкиПриложений.РеестрНДС2024Кв2);
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение11, ЯчейкиПриложений.РеестрНДС2024Кв2);
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение12, ЯчейкиПриложений.РеестрНДС2024Кв2);
	//--РеестрНДС2024Кв2
	
	//РеестрНДС2025Кв2
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2025Кв2, 			   ЯчейкиПриложений.ПустаяСсылка());
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение06, ЯчейкиПриложений.РеестрНДС2025Кв2);
	//--РеестрНДС2025Кв2 
	
	//РеестрНДС2025Кв2_ЕД715_1035
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2025Кв2_ЕД715_1035,   ЯчейкиПриложений.ПустаяСсылка());
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение07, ЯчейкиПриложений.РеестрНДС2025Кв2_ЕД715_1035);
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение08, ЯчейкиПриложений.РеестрНДС2025Кв2_ЕД715_1035);
	СоответствиеРодителей.Вставить(ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение09, ЯчейкиПриложений.РеестрНДС2025Кв2_ЕД715_1035);
	//--РеестрНДС2025Кв2_ЕД715_1035

	
	Возврат СоответствиеРодителей;

КонецФункции
