
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресНастроек) Тогда
		Настройки =  ПолучитьИзВременногоХранилища(Параметры.АдресНастроек);
		Если Настройки <> Неопределено Тогда
			ПараметрыВнешнейКоманды.Загрузить(Настройки);
			
			Для Каждого СтрокаПараметров из ПараметрыВнешнейКоманды Цикл
				
				Если ЭтоАдресВременногоХранилища(СтрокаПараметров.АдресГруппДоступа) Тогда
					
					МассивЗначений = ПолучитьИзВременногоХранилища(СтрокаПараметров.АдресГруппДоступа);
					Если МассивЗначений <> Неопределено Тогда
						СтрокаПараметров.ГруппыДоступа.ЗагрузитьЗначения(МассивЗначений);
					КонецЕсли;
					
				КонецЕсли;
				
				Если  СтрокаПараметров.ГруппыДоступа.Количество() = 0 Тогда
					СтрокаПараметров.ГруппыДоступа.Добавить(Справочники.CW_ГруппыПользователей.Администраторы);
					Модифицированность = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
			
		ОбновитьКартинкиСтрок();
		
		// выбираем из списка
		Если СписокКартинок.Количество() = 0 Тогда
			_ЗаполнитьСписокКартинок();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокТаблиныхЧастейОбъекта(МетаданныеКонфигурации, ИмяФормыОбъкта)
	
	ВыбраннаяФорма = ПолучитьФорму(СокрЛП(МетаданныеКонфигурации) + ".Форма." + ИмяФормыОбъкта);

	МассивИменФорм = Новый Массив;
	Для Каждого ЭлементФормы из ВыбраннаяФорма.Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = тип("ТаблицаФормы") Тогда
			МассивИменФорм.Добавить(ЭлементФормы.Имя);	
		КонецЕсли;
	КонецЦикла;

	Возврат МассивИменФорм;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокФормОбъекта(МетаданныеКонфигурации)
	
	Метаданное = ПолучитьОбъктМетаданных(МетаданныеКонфигурации);
	
	Если Метаданное = Неопределено тогда
		Возврат новый Массив;
	КонецЕсли;
	
	МассивИменФорм = Новый Массив;
	
	Для каждого ФормаОбъекта из Метаданное.Формы Цикл
		МассивИменФорм.Добавить(ФормаОбъекта.Имя);
	КонецЦикла;
	
	Возврат МассивИменФорм;
	
КонецФункции


&НаСервере
Функция ПолучитьОбъктМетаданных(МетаданныеКонфигурации)
	
	МассивТиповДанных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(МетаданныеКонфигурации,".");
	
	ТипДанных = ""; ВидДанных = "";
	Если  МассивТиповДанных.Количество() > 0 Тогда
		ТипДанных = МассивТиповДанных[0];	
	КонецЕсли;
	Если  МассивТиповДанных.Количество() > 1 Тогда
		ВидДанных = МассивТиповДанных[1];	
	КонецЕсли;
	
	Если ТипДанных = "" или ВидДанных = "" тогда
		Возврат Неопределено;
	конецЕсли;
	
	Если ТипДанных = "Документ" Тогда
		Метаданное =	Метаданные.Документы[ВидДанных];
	ИначеЕсли ТипДанных = "Справочник" Тогда
		Метаданное =	Метаданные.Справочники[ВидДанных];
	ИначеЕсли ТипДанных = "Обработка" Тогда
		Метаданное =	Метаданные.Обработки[ВидДанных];
	КонецЕсли;
	
	Возврат Метаданное;
	
КонецФункции

&НаКлиенте
Процедура ПараметрыВнешнейКомандыИмяТабличнойЧастиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПараметрыВнешнейКоманды.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ИмяФормыОбъкта) тогда
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана форма объекта метаданных конфигуарции!";
		Сообщение.Сообщить();
		
		СтандартнаяОбработка = Ложь;
		Возврат;
		
	КонецЕсли;
	
	МассивИментабличныхЧастей = ПолучитьСписокТаблиныхЧастейОбъекта(ТекущиеДанные.МетаданныеКонфигурации, ТекущиеДанные.ИмяФормыОбъкта);
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивИментабличныхЧастей);
		
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВнешнейКомандыИмяФормыОбъктаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ПараметрыВнешнейКоманды.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.МетаданныеКонфигурации) тогда
		
		СтандартнаяОбработка = Ложь;
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран объект метаданных конфигуарции!";
		Сообщение.Сообщить();
		
	КонецЕсли;	
	
	МассивИментабличныхЧастей = ПолучитьСписокФормОбъекта(ТекущиеДанные.МетаданныеКонфигурации);
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивИментабличныхЧастей);

КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	
	Если Не Проверитьдубли() Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);	
		ПоказатьВопрос(Оповещение,	"Не рекомендуется вызов команды из разных разделов формы!
									|Продолжить?",РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЭтаФорма.Закрыть(ПолучитьАдресНастроекКоманды());
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	
	ЭтаФорма.Закрыть(ПолучитьАдресНастроекКоманды());


КонецПроцедуры

&НаСервере
Функция Проверитьдубли() 
	
	ВремТаблица = ПараметрыВнешнейКоманды.Выгрузить();
	ВремТаблица.Свернуть("МетаданныеКонфигурации,ИмяФормыОбъкта","");
	
	Возврат ВремТаблица.Количество() = ПараметрыВнешнейКоманды.Количество();
	
КонецФункции

&наСервере
Функция ПолучитьАдресНастроекКоманды()
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрыВнешнейКоманды.Выгрузить());
	
КонецФункции

#Область Выбор_пиктограммы_команды

&НаКлиенте
Процедура ОбработкаВыбораПиктограммы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		ТекущаяСтрока = Элементы.ПараметрыВнешнейКоманды.ТекущаяСтрока;
		_ОбработатьВыборКартинки(Ответ.Значение, ТекущаяСтрока);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура ВыборКартинкиИзКоллекции(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПиктограммы",ЭтотОбъект); 
	СписокКартинок.ПоказатьВыборЭлемента(ПОВ,"Выберите пиктограмму");
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборКартинкиОчистить(Команда)
	
	ТекущаяСтрока = Элементы.ПараметрыВнешнейКоманды.ТекущаяСтрока;
	
	_ОбработатьВыборКартинки("", ТекущаяСтрока);
	
КонецПроцедуры


&НаСервере
Процедура _ЗаполнитьСписокКартинок()
	
	СписокКартинок.Очистить();
	CW_ОбщегоНазначения.ЗаполнитьСписокКартинок(СписокКартинок); 
	
КонецПроцедуры

&НаСервере
Функция _ОбработатьВыборКартинки(тИмяКартинки, ИдентификаторСтроки)
	
	СтрокаКоманды = ПараметрыВнешнейКоманды.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ЗначениеЗаполнено(тИмяКартинки) Тогда
		Картинка = БиблиотекаКартинок[тИмяКартинки]; 
	Иначе
		Картинка = Новый Картинка;
	КонецЕсли;
	
	СтрокаКоманды.ИмяКартинки 	= тИмяКартинки;
	СтрокаКоманды.Картинка 		= ПоместитьВоВременноеХранилище(Картинка,ЭтаФорма);
	
	Модифицированность = истина;
	
КонецФункции

&наСервере
Процедура ОбновитьКартинкиСтрок()
	
	Для Каждого СтрокаПараметров Из  ПараметрыВнешнейКоманды Цикл
		Если ЗначениеЗаполнено(СтрокаПараметров.ИмяКартинки) Тогда
			Картинка = БиблиотекаКартинок[СтрокаПараметров.ИмяКартинки]; 
		Иначе
			Картинка = Новый Картинка;
		КонецЕсли;
		СтрокаПараметров.Картинка = ПоместитьВоВременноеХранилище(Картинка,ЭтаФорма);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область Выбор_грппы_пользователй

&НаКлиенте
Процедура ПараметрыВнешнейКомандыГруппыДоступаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ИдентификаторСтроки = Элементы.ПараметрыВнешнейКоманды.ТекущаяСтрока;
	
	ПараметрыФормы 		= Новый Структура("АдресСписка", ПолучитьАдресСпискаПользователей(ИдентификаторСтроки));
	ОписаниеОповещения = новый ОписаниеОповещения("ПриЗакрытиФормыВыбораГруппыПользователей", ЭтаФорма, ИдентификаторСтроки);
	
	ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.Форма.ФормаСпискаГрупПользователей",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСпискаПользователей(ИдентификаторСтроки)
	
	СтрокаТекущая = ПараметрыВнешнейКоманды.НайтиПоИдентификатору(ИдентификаторСтроки);

	Возврат ПоместитьВоВременноеХранилище(СтрокаТекущая.ГруппыДоступа.ВыгрузитьЗначения());
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытиФормыВыбораГруппыПользователей(Результат, ИдентификаторСтроки) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьРезультаВыбораГруппыПользователей(Результат, ИдентификаторСтроки);
		Модифицированность = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультаВыбораГруппыПользователей(Результат, ИдентификаторСтроки)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		СтрокаТекущая = ПараметрыВнешнейКоманды.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		мВыбранныеЗначения = ПолучитьИзВременногоХранилища(Результат);	
		
		СтрокаТекущая.ГруппыДоступа.ЗагрузитьЗначения(мВыбранныеЗначения);
		
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти
