
Процедура ПолучитьСписокДокументов(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ТаблицаДокументов = ПараметрыПроцедуры.ТаблицаДокументов;

	мПорядокОтражения = Новый Массив;
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыПоГрузоперевозкам.Контрагент КАК Контрагент,
	               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов КАК ДокументДоходов,
	               |	СУММА(CW_ДоходыПоГрузоперевозкам.Всего) КАК СуммаРеализацииРуб,
	               |	СУММА(ВЫБОР
	               |			КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяССЫЛКА)
	               |				ТОГДА ВЫБОР
	               |						КОГДА CW_ДоходыПоГрузоперевозкам.Договор.ВзаиморасчетыВУЕ
	               |							ТОГДА CW_ДоходыПоГрузоперевозкам.Всего
	               |						ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Всего_Валюта
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору.ВзаиморасчетыВУЕ
	               |						ТОГДА CW_ДоходыПоГрузоперевозкам.Всего
	               |					ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Всего_Валюта
	               |				КОНЕЦ
	               |		КОНЕЦ) КАК СуммаРеализации,
	               |	ВЫБОР
	               |		КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяССЫЛКА)
	               |			ТОГДА ВЫБОР
	               |					КОГДА CW_ДоходыПоГрузоперевозкам.Договор.ВзаиморасчетыВУЕ
	               |						ТОГДА &ВалютаРегламентированногоУчета
	               |					ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору.ВзаиморасчетыВУЕ
	               |					ТОГДА &ВалютаРегламентированногоУчета
	               |				ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Валюта
	               |ПОМЕСТИТЬ ВТ_Доходы
	               |ИЗ
	               |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Организация = &Организация
	               |	И CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяАкт = ИСТИНА
	               |	И CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяСчетФактура = ИСТИНА
	               |	И CW_ДоходыПоГрузоперевозкам.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |	И CW_ДоходыПоГрузоперевозкам.ПорядокОтражения В(&мПорядокОтражения)
	               |	И (CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ВедомыйДокумент <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	               |			ИЛИ CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ВедомыйДокументКорректировки <> ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка))
                   |	//УСЛОВИЕ_ПЕРИОД
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ДоходыПоГрузоперевозкам.Контрагент,
	               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов,
	               |	ВЫБОР
	               |		КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору = ЗНАЧЕНИЕ(Справочник.CW_ПриложенияКДоговорам.ПустаяССЫЛКА)
	               |			ТОГДА ВЫБОР
	               |					КОГДА CW_ДоходыПоГрузоперевозкам.Договор.ВзаиморасчетыВУЕ
	               |						ТОГДА &ВалютаРегламентированногоУчета
	               |					ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА CW_ДоходыПоГрузоперевозкам.ПриложениеКДоговору.ВзаиморасчетыВУЕ
	               |					ТОГДА &ВалютаРегламентированногоУчета
	               |				ИНАЧЕ CW_ДоходыПоГрузоперевозкам.Валюта
	               |			КОНЕЦ
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Доходы.Контрагент КАК Контрагент,
	               |	ВТ_Доходы.ДокументДоходов КАК ДокументДоходов,
	               |	ВТ_Доходы.СуммаРеализации КАК СуммаРеализации,
	               |	ВТ_Доходы.СуммаРеализацииРуб КАК СуммаРеализацииРуб,
	               |	ВТ_Доходы.Валюта КАК Валюта
	               |ИЗ
	               |	ВТ_Доходы КАК ВТ_Доходы
	               |ГДЕ
	               |	ВТ_Доходы.СуммаРеализации <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_РеестрыНДС0ЗаписиРеестра.ДокументДоходов КАК ДокументДоходов,
	               |	CW_РеестрыНДС0ЗаписиРеестра.Ссылка КАК ЗаписьРеестра,
	               |	CW_РеестрыНДС0ЗаписиРеестра.НалоговаяБаза КАК НалоговаяБаза,
	               |	CW_РеестрыНДС0ЗаписиРеестра.ТребуетсяЗаполнение КАК ТребуетсяЗаполнение
	               |ИЗ
	               |	Справочник.CW_РеестрыНДС0ЗаписиРеестра КАК CW_РеестрыНДС0ЗаписиРеестра
	               |ГДЕ
	               |	CW_РеестрыНДС0ЗаписиРеестра.ПометкаУдаления = ЛОЖЬ
	               |	И CW_РеестрыНДС0ЗаписиРеестра.ДокументДоходов В
	               |			(ВЫБРАТЬ
	               |				ВТ_Доходы.ДокументДоходов КАК ДокументДоходов
	               |			ИЗ
	               |				ВТ_Доходы КАК ВТ_Доходы)
	               |	И CW_РеестрыНДС0ЗаписиРеестра.ПодтверждениеНДС <> ЗНАЧЕНИЕ(Перечисление.CW_РеестрыНДС0СтатусыЗаписиРеестра.НеПодтвержден)
	               |ИТОГИ
	               |	СУММА(НалоговаяБаза),
	               |	МАКСИМУМ(ТребуетсяЗаполнение)
	               |ПО
	               |	ДокументДоходов";
	
	Если ПараметрыПроцедуры.ВариантПериода = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ПЕРИОД", "И CW_ДоходыПоГрузоперевозкам.Период МЕЖДУ &НачалоПериода И &КонецПериода");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ПЕРИОД", "И CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ДатаАкта МЕЖДУ &НачалоПериода И &КонецПериода");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", 		ПараметрыПроцедуры.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 		ПараметрыПроцедуры.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",  		ПараметрыПроцедуры.Организация);    
	Запрос.УстановитьПараметр("мПорядокОтражения",  мПорядокОтражения);    
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет(); 
	
	//1. Доходы
	РезультатДоходы = ПакетРезультатовЗапроса[1];  
	
	//2. Реестры
	РезультатРеестры = ПакетРезультатовЗапроса[2];
    ВыборкаРеестры = РезультатРеестры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаДоходы = РезультатДоходы.Выбрать();
	Пока ВыборкаДоходы.Следующий() Цикл   
		
		ВедомыйВедущий  = CW_РеестрыНДС0СерверВызовСервера.ПолучитьВедомыйВедущийДокумент(ВыборкаДоходы.ДокументДоходов);
		
		НоваяСтрока = ТаблицаДокументов.Добавить(); 
		
		НоваяСтрока.Контрагент 		= ВыборкаДоходы.Контрагент;  
		НоваяСтрока.ДокументДоходов = ВыборкаДоходы.ДокументДоходов; 
		
		НоваяСтрока.ВедомыйДокумент = ВедомыйВедущий.ВедомыйДокумент; 
		              
		НоваяСтрока.СуммаРеализации = CW_РеестрыНДС0Дополнительный.ПересчитатьСуммуРеализации(ВыборкаДоходы.СуммаРеализации, ВыборкаДоходы.СуммаРеализацииРуб, ВыборкаДоходы.Валюта, ВыборкаДоходы.ДокументДоходов);
 
		СтруктураОтбора = Новый Структура("ДокументДоходов",  ВыборкаДоходы.ДокументДоходов);
		
		ВыборкаРеестры.Сбросить();
		Если ВыборкаРеестры.НайтиСледующий(СтруктураОтбора) Тогда
			
			НоваяСтрока.НалоговаяБаза 		= ВыборкаРеестры.НалоговаяБаза;  
			НоваяСтрока.ТребуетсяЗаполнение = ВыборкаРеестры.ТребуетсяЗаполнение;  
			
			ВыборкаДетали = ВыборкаРеестры.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				НоваяСтрока.ЗаписиРеестра.Добавить(ВыборкаДетали.ЗаписьРеестра);
			КонецЦикла;
			
		КонецЕсли; 
		
		НоваяСтрока.Отклонение = НоваяСтрока.СуммаРеализации - НоваяСтрока.НалоговаяБаза ;  
		
	КонецЦикла;    
	
	ПоместитьВоВременноеХранилище(ТаблицаДокументов, АдресРезультата);
	
КонецПроцедуры

Процедура СформироватьЗаписиРеестровНДС(ПараметрыПроцедуры, АдресРезультата) Экспорт   

	ТаблицаДокументов = ПараметрыПроцедуры.ТаблицаДокументов; 
	
	Отбор   = Новый Структура("Выбор", Истина);
	мСтроки = ТаблицаДокументов.НайтиСтроки(Отбор);

	Для Каждого СтрокаТаблицы из мСтроки Цикл
		
		УдалитьЗаписиРеестров(СтрокаТаблицы.ЗаписиРеестра); 
		
		СписокВидыТранспорта = CW_РеестрыНДС0Дополнительный.ПолучитьСписокПриложенийПоДокументу(СтрокаТаблицы.ДокументДоходов);  
		МассивВидыТранспорта = СписокВидыТранспорта.ВыгрузитьЗначения();
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВедущийДокумент", 				СтрокаТаблицы.ДокументДоходов);
		СтруктураПараметров.Вставить("ВедомыйДокумент", 				СтрокаТаблицы.ВедомыйДокумент);
		СтруктураПараметров.Вставить("ВидыТранспорта", 					МассивВидыТранспорта);   
  		СтруктураПараметров.Вставить("ВариантПериодаПодтверждения", 	ПараметрыПроцедуры.ВариантПериодаПодтверждения);   
		СтруктураПараметров.Вставить("ПериодПодтверждения", 			ПараметрыПроцедуры.ПериодПодтверждения);   

		CW_РеестрыНДС0Дополнительный.СформироватьЗаписьРеестраНДС(СтруктураПараметров);	
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаДокументов, АдресРезультата);
	
КонецПроцедуры   

Процедура УдалитьЗаписиРеестров(СписокЗаписиРеестра) 
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ЭлементСписка из СписокЗаписиРеестра Цикл
		ЗаписьРеестраСсылка = ЭлементСписка.Значение;  
		
		ОбъектЗаписьРеестра = ЗаписьРеестраСсылка.ПолучитьОбъект(); 
		Если ОбъектЗаписьРеестра <> Неопределено Тогда
			Если Не ОбъектЗаписьРеестра.Заблокирован Тогда
				ОбъектЗаписьРеестра.Удалить();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


