
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РедактированиеЗапрещено = РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.РедактированиеОбъектаЗапрещено(Тип("СправочникСсылка.CW_ФинансовыеСтатусы"));

	ЭтаФорма.ТолькоПросмотр = РедактированиеЗапрещено;
	ЭтаФорма.ТолькоПросмотр = (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеНастроекМониторинга"));
	
	УстановитьЗначениеПустойСсылкиОбъектаСтатуса();
	
	Если НЕ Объект.Предопределенный Тогда
		ИнициализацияКопоновщика();
	КонецЕсли;    
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Настройки = Параметры.ЗначениеКопирования.ХранилищеОтбора.Получить();   
		Если Настройки <> Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ГруппаУсловия.Видимость = НЕ Объект.Предопределенный;

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресКартинки);
	Иначе
		ДвоичныеДанные = Неопределено;
	КонецЕсли;
	
	ТекущийОбъект.ХранилищеКартинки = Новый ХранилищеЗначения(ДвоичныеДанные);
	ТекущийОбъект.СсылкаКартинки 	= ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "ХранилищеКартинки");
	
	Если Не Объект.Предопределенный Тогда
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		ТекущийОбъект.ХранилищеОтбора 	= Новый ХранилищеЗначения(Настройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДанныеКартинки 	=  ТекущийОбъект.ХранилищеКартинки.Получить();
	АдресКартинки 	=  ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
	
	Если Не Объект.Предопределенный Тогда
		Настройки 		=  ТекущийОбъект.ХранилищеОтбора.Получить();
		Если Настройки <> Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если Объект.Предопределенный Тогда
		Возврат;
	КонецЕсли;
	
	Если КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() = 0 Тогда
		Отказ = истина;
		ПоказатьПредупреждение(, "Необходимо настроить условия установки статуса!",,"Ошибка записи статуса");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПустойСсылкиОбъектаСтатуса()
	
	ЗначениеПустойСсылки = Объект.ИдентификаторОбъекта.ЗначениеПустойСсылки;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	CW_ФинансовыеСтатусыКлиент.УстановитьВидимостьВариантаУсловий(ЭтаФорма, ЗначениеПустойСсылки);

КонецПроцедуры

//Выбор картинки
&НаКлиенте
Процедура ВыбратьПиктограмму(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо записать элемент справочника");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикОкончанияВыбораПиктограммы",ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораКартинки",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОкончанияВыбораПиктограммы(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено ИЛи РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикОкончанияВыбораПиктограммыНаСервере(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ОбработчикОкончанияВыбораПиктограммыНаСервере(РезультатВыбора)
	
	ДанныеКартинки = ПолучитьИзВременногоХранилища(РезультатВыбора);
	АдресКартинки = ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПиктограмму(Команда)
	
	АдресКартинки = "";
	
КонецПроцедуры
//Выбор картинки

//Настройка отборов
&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПослеУдаления(Элемент)
	
	CW_ФинансовыеСтатусыКлиент.УстановитьВидимостьВариантаУсловий(ЭтаФорма, ЗначениеПустойСсылки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	CW_ФинансовыеСтатусыКлиент.ОтборыПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	
	CW_ФинансовыеСтатусыКлиент.ОтборыПриИзменении(ЭтаФорма, Элемент, ЗначениеПустойСсылки);

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломИзменения(Элемент, Отказ)
	
	CW_ФинансовыеСтатусыКлиент.ОтборыПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);	

КонецПроцедуры

&НаСервере
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив; 
	СписокПолей.Добавить("Ссылка.Код");
	СписокПолей.Добавить("Ссылка.Предопределенный");
	СписокПолей.Добавить("Ссылка.ВерсияДанных");
	СписокПолей.Добавить("Ссылка.ИмяПредопределенныхДанных");
	СписокПолей.Добавить("Ссылка.СлужебныйВыполненПереход");
	
	МетаданныеОбъекта 			= ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Объект.ИдентификаторОбъекта);
	МассивИменТабличныхЧастей 	= ПолучитьМассивИменТабличныхЧастей(МетаданныеОбъекта);
	
	Для Каждого ИмяТабличнойЧасти из МассивИменТабличныхЧастей Цикл
		ИмяПоля = "Ссылка."+ИмяТабличнойЧасти;
		СписокПолей.Добавить(ИмяПоля);
	КонецЦикла;
	
	Если ТипЗнч(ЗначениеПустойСсылки) = Тип("СправочникСсылка.CW_Заказы") Тогда
		СписокПолей.Добавить("Грузоперевозка.Код");
		СписокПолей.Добавить("Грузоперевозка.Предопределенный");
		СписокПолей.Добавить("Грузоперевозка.ВерсияДанных");
		СписокПолей.Добавить("Грузоперевозка.ИмяПредопределенныхДанных");
		СписокПолей.Добавить("Грузоперевозка.СлужебныйВыполненПереход");
		
		МетаданныеОбъекта = Метаданные.Справочники.CW_Грузоперевозки;
		МассивИменТабличныхЧастей 	= ПолучитьМассивИменТабличныхЧастей(МетаданныеОбъекта);
		Для Каждого ИмяТабличнойЧасти из МассивИменТабличныхЧастей Цикл
			ИмяПоля = "Грузоперевозка."+ИмяТабличнойЧасти;
			СписокПолей.Добавить(ИмяПоля);
		КонецЦикла;
	КонецЕсли;

	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаСервере
Функция ПолучитьМассивИменТабличныхЧастей(МетаданныеОбъекта)
	
	МассивИмен = Новый Массив;
	
	Для Каждого ТабличаняЧасть из МетаданныеОбъекта.ТабличныеЧасти Цикл
		МассивИмен.Добавить(ТабличаняЧасть.Имя);
	КонецЦикла;
	
	Возврат МассивИмен;
	
КонецФункции
//Настройка отборов


&НаСервере
Процедура ИнициализацияКопоновщика()
	
	СоответствиеИменМакетов = Справочники.CW_ФинансовыеСтатусы.ПолучитьСоответствиеИмениМакетаТипуЗначения();
	
	ИмяМакета = СоответствиеИменМакетов.Получить(ТипЗнч(Объект.ИдентификаторОбъекта.ЗначениеПустойСсылки));
	
	//Если нет макета отбора. то отбор не используем
	Элементы.ГруппаУсловия.Видимость = ИмяМакета <> Неопределено;
	
	Если ИмяМакета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	тОбъект 	= РеквизитФормыВЗначение("Объект");
	СхемаОтбора = тОбъект.ПолучитьМакет(ИмяМакета);
	
	СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаОтбора,ЭтаФорма.УникальныйИдентификатор);

	НастройкиФильтр = КомпоновщикНастроек.Настройки;
	АдресНастроек = ПоместитьВоВременноеХранилище(НастройкиФильтр,ЭтаФорма.УникальныйИдентификатор);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(АдресНастроек));
	
КонецПроцедуры


// ---------------------------------------------------------------------------- 

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти



