#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ПростойИнтерфейсПокупки", , Истина);
	
	ОткрытьФорму(
		"Обработка.ПанелиПростойИнтерфейс.Форма.ПанельПокупки",,
		ПараметрыВыполненияКоманды.Источник,
		"Обработка.ПанелиПростойИнтерфейс.Форма.ПанельПокупки" + ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", ""),
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти