
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВремТаблица = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы);
	ТаблицаЗначений.Загрузить(ВремТаблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийПередУдалением(Элемент, Отказ)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	ВыполнитьВыборЗначения(ВыбраннаяСтрока);
	
КонецПроцедуры 

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаЗначений.ТекущаяСтрока;
  	ВыполнитьВыборЗначения(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыборЗначения(ВыбраннаяСтрока)
	
	СтрокаТекущая = ТаблицаЗначений.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Ответ = Новый Структура;
	Ответ.Вставить("id", 	СтрокаТекущая.id);
	Ответ.Вставить("name", 	СтрокаТекущая.name);
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры


