Функция ПолучитьКартинкуТабличногоДокумента(ТабличныйДокумент,  Знач ИмяКартинки) Экспорт
	
	ИндексКартинки 	= 0;  
	Картинка = СуществуетКартикаМакета(ТабличныйДокумент, ИмяКартинки);
	Пока Картинка <> Неопределено Цикл          
		ИндексКартинки 	= ИндексКартинки + 1;
		ИмяКартинки 	= ИмяКартинки + Формат(ИндексКартинки, "ЧГ=0");
		Картинка 		= СуществуетКартикаМакета(ТабличныйДокумент, ИмяКартинки);  
	КонецЦикла;
	
	Рисунок = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Рисунок.Имя 				= Имякартинки; 
	Рисунок.РазмерКартинки 		= РазмерКартинки.Пропорционально; 
	
	Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Точечная,1);
	Рисунок.Линия = Линия; 

	Рисунок.ГраницаСверху = Истина;
	Рисунок.ГраницаСлева  = Истина;
	Рисунок.ГраницаСнизу  = Истина;
	Рисунок.ГраницаСправа = Истина;  
	
	Рисунок.ВыводитьНаПечать 	= Истина;  
	
	Рисунок.ЦветФона = новый Цвет;

	Возврат Рисунок;
	
КонецФункции 

Процедура УстановитьРазмерыКартинкиXML(Рисунок, Знач ИмяКартинки) Экспорт
	
	Если Рисунок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеРазмеров = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьРазмерыКартинок(); 
	Если ДанныеРазмеров = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ШиринаВысота = ДанныеРазмеров[ИмяКартинки]; 
	
	Если ДанныеРазмеров <> Неопределено 
		и  ШиринаВысота.Высота <> 0 и ШиринаВысота.Ширина <> 0 Тогда
		Рисунок.Ширина  = ШиринаВысота.Ширина;       
		Рисунок.Высота  = ШиринаВысота.Высота;
	КонецЕсли;
	
КонецПроцедуры   

Процедура ИзменитьМасштабКартинкиXML(ТабличныйДокумент, ИмяКартинки, ИсходныеРазмеры, Масштаб) Экспорт
	
	Масштаб = ?(Масштаб = 0,  100, Масштаб);
	
	Рисунок = СуществуетКартикаМакета(ТабличныйДокумент, ИмяКартинки);  
	Если Рисунок <> Неопределено Тогда
		Рисунок.Ширина  = ИсходныеРазмеры.Ширина / 100 * Масштаб;;       
		Рисунок.Высота  = ИсходныеРазмеры.Высота / 100 * Масштаб;
	КонецЕсли;
	
КонецПроцедуры 

Функция СуществуетКартикаМакета(Макет, ИмяКартинки) Экспорт
	
	Попытка
		Возврат Макет.Рисунки[ИмяКартинки];
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

