&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ФактическиПолученныеЗатратыНаДату = ТекущаяДата();  
	Отчет.ФактическиеДокументы = "АКТЫ";
	Отчет.ВерсияБюджета = ПредопределенноеЗначение("Справочник.CW_ВерсииБюджетов.Основная");
	Отчет.ПорядокРасчетаРублевогоЭквивалентаПлановыхСтатейЗатрат = 1;
	
	ПоказатьСкрытьНастройки = Истина;
	Если Параметры.Свойство("ПоказатьСкрытьНастройки") Тогда
		ПоказатьСкрытьНастройки = Параметры.ПоказатьСкрытьНастройки;
	КонецЕсли;
	ПоказатьСкрытьНастройкиНаСервере(); 
	
	Если Не ЗначениеЗаполнено(Параметры.КлючВарианта) Тогда
		ЭтаФорма.УстановитьТекущийВариант("Основной");
	КонецЕсли;  
	
	ЗаполнитьСписокВариантов(); 
	
	Если Параметры.Свойство("НастрокиКомпоновщика") Тогда 
		АдресНастроекКомпановщика = ПоместитьВоВременноеХранилище(Параметры.НастрокиКомпоновщика, УникальныйИдентификатор);
	КонецЕсли;
	
	//Работа с буфером обмена
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена());
	//Работа с буфером обмена	

КонецПроцедуры   

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоАдресВременногоХранилища(АдресНастроекКомпановщика) тогда
		НастройкиКомпановщика = ПолучитьИзВременногоХранилища(АдресНастроекКомпановщика);
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпановщика);   
		ЭтаФорма.СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьСкрытьНастройки(Команда)
	
	ПоказатьСкрытьНастройки = Не ПоказатьСкрытьНастройки;
	ПоказатьСкрытьНастройкиНаСервере();   
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьНастройкиНаСервере()
	
	Элементы.ГруппаНастройкиОтчета.Видимость = ПоказатьСкрытьНастройки;
	Элементы.ФормаПоказатьСкрытьНастройки.Пометка = ПоказатьСкрытьНастройки;

КонецПроцедуры   

//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.КомандаБуфераОбменаВставить.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуфераОбменаВставить(Команда)
	КоличествоСтрок = БуфераОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БуфераОбменаВставитьНаСервере()
	
	Возврат CW_РаботаСБуферомОбмена.УстановитьОтборКомпановщикаПоБуферуОбмена(Отчет.КомпоновщикНастроек);

КонецФункции
//Работа с буфером обмена

&НаСервере
Процедура ЗаполнитьСписокВариантов()
	
	ТекущийКлючВарианта = ЭтаФорма.КлючТекущегоВарианта;
	
	ИдентификаторОтчет = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ОтчетОбъект.CW_ОжидаемыеЗатраты"));
	
	ОтборОтчеты = Новый Массив;
	ОтборОтчеты.Добавить(ИдентификаторОтчет);
	ПараметрыПоиска 	= Новый Структура("Отчеты,ПометкаУдаления,ТолькоЛичные", ОтборОтчеты, Ложь, Ложь);
	ТаблицаВариантов 	= ВариантыОтчетов.ТаблицаВариантовОтчетов(ПараметрыПоиска);
	
	//Удаляем ранее добавленные кнопки и команды
	Если ТипЗнч(ДобавленныеКнопки) = Тип("ФиксированныйМассив") Тогда
		Для Каждого ИмяКнопки из ДобавленныеКнопки Цикл
			КнопкаВарианта = ЭтаФорма.Элементы.Найти(ИмяКнопки);  
			ЭтаФорма.Элементы.Удалить(КнопкаВарианта);  
		КонецЦикла;
	КонецЕсли;
	Если ТипЗнч(ДобавленныеКоманды) = Тип("ФиксированныйМассив") Тогда
		Для Каждого ИмяКоманды из ДобавленныеКоманды Цикл
			КомандаФормы = ЭтаФорма.Команды.Найти(ИмяКоманды);  
			ЭтаФорма.Команды.Удалить(КомандаФормы);
		КонецЦикла;
	КонецЕсли;
	//---Удаляем ранее добавленные кнопки и команды
	
	МассивКнопок = Новый Массив;
	МассивКоманд = Новый Массив; 
	
	СоответствиеВариантыОтчета = новый Соответствие;
	СоответствиеИмяКнопки = новый Соответствие;
	
	Для Каждого СтрокаВариантОтчета из ТаблицаВариантов Цикл 
		
		Если СтрокаВариантОтчета.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяВарианта = СтрЗаменить(СтрокаВариантОтчета.КлючВарианта,"-", "_"); 
		ИмяКнопки 	= "ВариантОтчетаКнопкаФормы_"+СокрЛП(ИмяВарианта); 
		ИмяКоманды 	= "ВариантОтчетаКоманда_"+СокрЛП(ИмяВарианта); 
		
		КомандаФормы = ЭтаФорма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = СтрокаВариантОтчета.Наименование;
		КомандаФормы.Действие  = "ПодключаемыйВариантОтчета"; // наименование клиентской процедуры
		
		МассивКоманд.Добавить(ИмяКоманды);  
	
		//Добавляем новую кнопку 
		КнопкаВарианта = ЭтаФорма.Элементы.Добавить(
			ИмяКнопки, 
			Тип("КнопкаФормы"), 
			Элементы.ГруппаПользовательскиеВариантыОтчета);
		
		КнопкаВарианта.Вид 			= ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаВарианта.ИмяКоманды 	= ИмяКоманды;
		КнопкаВарианта.Заголовок  	= СтрокаВариантОтчета.Наименование;
		КнопкаВарианта.Пометка    	= (ТекущийКлючВарианта = СтрокаВариантОтчета.КлючВарианта); 
		
		МассивКнопок.Добавить(ИмяКнопки);  
		
		СоответствиеВариантыОтчета.Вставить(ИмяКоманды, СтрокаВариантОтчета.КлючВарианта);
		СоответствиеИмяКнопки.Вставить(ИмяКоманды, ИмяКнопки);  
		
	КонецЦикла;   
	
	ДобавленныеКнопки = Новый ФиксированныйМассив(МассивКнопок);
	ДобавленныеКоманды = Новый ФиксированныйМассив(МассивКоманд);
	
	ВариантыОтчета = Новый ФиксированноеСоответствие(СоответствиеВариантыОтчета);
	КнопкиОтчета = Новый ФиксированноеСоответствие(СоответствиеИмяКнопки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииВариантаНаСервере(Настройки) 
	
	ЗаполнитьСписокВариантов();   
	
КонецПроцедуры    

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)

	ЗаполнитьСписокВариантов(); 
	
КонецПроцедуры

//Подключаемые команды
&НаКлиенте
Процедура ПодключаемыйВариантОтчета(Команда)
	
	КлючВарианта = ВариантыОтчета.Получить(Команда.Имя);
	КлючВарианта = ?(КлючВарианта=Неопределено, "Основной", КлючВарианта); 
	
	ТекущаяКнопка = КнопкиОтчета.Получить(Команда.Имя);
	
	ЭтаФорма.УстановитьТекущийВариант(КлючВарианта);
	
	Для Каждого ИмяКнопки из ДобавленныеКнопки Цикл
		ЭтаФорма.Элементы[ИмяКнопки].Пометка = (ИмяКнопки = ТекущаяКнопка);
	КонецЦикла;
	
	ЭтаФорма.СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);

КонецПроцедуры   
//---Подключаемые команды

