#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПолучитьСписокРеквизитовШапкиДляВыводаНаФорму(СоответствиеПараметров, СписокДополнительныхКолонок) Экспорт
	
	//Стандартные реквизиты 
	//Код
	СоответствиеПараметров.Вставить("ршг_Код", 		Новый Структура("ЭтоПараметр,Значение,Представление", Ложь, "Код", "Код"));
	СписокДополнительныхКолонок.Добавить("ршг_Код",	"Код", Ложь);
	
	//Наименование
	СоответствиеПараметров.Вставить("ршг_Наименование", 		Новый Структура("ЭтоПараметр,Значение,Представление", Ложь, "Наименование", "Наименование"));
	СписокДополнительныхКолонок.Добавить("ршг_Наименование",	"Наименование", Ложь);
	//---Стандартные реквизиты
	
	Для Каждого Реквизит из Метаданные.Справочники.CW_Грузоперевозки.Реквизиты Цикл
		ПредставлениеПараметра = СокрЛП(Реквизит.Синоним);
		
		Если СтрНайти(ПредставлениеПараметра,"служебное") = 0 Тогда
			СоответствиеПараметров.Вставить("ршг_"+Реквизит.имя, Новый Структура("ЭтоПараметр,Значение,Представление", Ложь, Реквизит.имя, ПредставлениеПараметра));
			СписокДополнительныхКолонок.Добавить("ршг_"+Реквизит.имя,	ПредставлениеПараметра, Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьБюджетИзГрузоперевозки(ПараметрыПроцедуры, АдресРезультат) Экспорт
	
	Если ПараметрыПроцедуры.КопироватьСтатьиРасходов и ПараметрыПроцедуры.КопироватьСтатьиДоходов Тогда
		ВидыСтатей = 0;
	Иначе
		ВидыСтатей = ?(ПараметрыПроцедуры.КопироватьСтатьиРасходов, 1, 2);
	КонецЕсли;
	
	ЗапросСуществующиеСтатьи = Новый Запрос;
	ЗапросСуществующиеСтатьи.УстановитьПараметр("Владелец",			ПараметрыПроцедуры.Ссылка);
	ЗапросСуществующиеСтатьи.УстановитьПараметр("ВерсияБюджета",	ПараметрыПроцедуры.ВыбранныеВерсии);
	
	ЗапросСуществующиеСтатьи.Текст = "ВЫБРАТЬ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК ПлановаяСтатья,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета КАК ВерсияБюджета,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования КАК ВидСтатьиПланирования,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент КАК Контрагент,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура КАК Номенклатура,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Валюта КАК Валюта,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС КАК СтавкаНДС,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Организация КАК Организация
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета В(&ВерсияБюджета)";
	
	
	Плательщик = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	Если ПараметрыПроцедуры.ЗаполнятьПлательщика Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Объект"				, ПараметрыПроцедуры.Ссылка);
		СтруктураПараметров.Вставить("ЭтоВариантБюджета"	, Ложь);
		СтруктураПараметров.Вставить("Контрагент"			, ПараметрыПроцедуры.Клиент);
		
		Плательщик = CW_Финансы.ВернутьПлательщика(СтруктураПараметров);
	КонецЕсли; 

	//перезаполнить(0), дополнить(1)
	Если ПараметрыПроцедуры.ПорядокЗаполненияБюджета = 0 Тогда 
		
		//Удаляем версии бюджета текущей грузоперевозки по виду статьи       
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
		               |ГДЕ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета В (&ВерсияБюджета)
		               |	//УсловиеВидаСтатьи";
		
		Запрос.УстановитьПараметр("Владелец", 		ПараметрыПроцедуры.Ссылка);
		Запрос.УстановитьПараметр("ВерсияБюджета",	ПараметрыПроцедуры.ВыбранныеВерсии);
		
		Если ВидыСтатей = 1 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеВидаСтатьи", "И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = Значение(Перечисление.CW_ВидыСтатейПланирования.Расходы)");	
		КонецЕсли;                
		Если ВидыСтатей = 2 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеВидаСтатьи", "И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = Значение(Перечисление.CW_ВидыСтатейПланирования.Доходы)");	
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтатьяОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Попытка
				СтатьяОбъект.Удалить();
			Исключение
				СтатьяОбъект.УстановитьПометкуУдаления(Истина);
			КонецПопытки;
		КонецЦикла;
		
		ЗапросСуществующиеСтатьи.Текст = СтрЗаменить(ЗапросСуществующиеСтатьи.Текст,"ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ 0");
		
	КонецЕсли;
	
	РезультатЗапроса 			= ЗапросСуществующиеСтатьи.Выполнить();
	ВыборкаСуществующиеСтатьи	= РезультатЗапроса.Выбрать();
	
	//Копируемые статьи
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК ПлановаяСтатья,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования КАК ВидСтатьиПланирования,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета КАК ВерсияБюджета,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент КАК Контрагент,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура КАК Номенклатура,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Валюта КАК Валюта,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС КАК СтавкаНДС,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Организация КАК Организация
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Грузоперевозка
	               |	//УсловиеВидаСтатьи
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета В(&ВыбранныеВерсии)
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Грузоперевозка",		ПараметрыПроцедуры.Грузоперевозка);
	Запрос.УстановитьПараметр("ВыбранныеВерсии",	ПараметрыПроцедуры.ВыбранныеВерсии); 
	
	Если ВидыСтатей = 1 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеВидаСтатьи", "И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = Значение(Перечисление.CW_ВидыСтатейПланирования.Расходы)");	
	КонецЕсли;                
	Если ВидыСтатей = 2 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеВидаСтатьи", "И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = Значение(Перечисление.CW_ВидыСтатейПланирования.Доходы)");	
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаОбъектыКопирования = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаОбъектыКопирования.Следующий() Цикл
		ВыборкаСуществующиеСтатьи.Сбросить();
		
		СтруктураПоиска = Новый Структура("Контрагент,Номенклатура,Валюта,СтавкаНДС,Организация,ВидСтатьиПланирования,ВерсияБюджета");
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаОбъектыКопирования);
		
		Если ПараметрыПроцедуры.ЗаполнятьПлательщика и ВыборкаОбъектыКопирования.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда
			СтруктураПоиска.Вставить("Контрагент", Плательщик);
		КонецЕсли;
		
		Если ВыборкаСуществующиеСтатьи.НайтиСледующий(СтруктураПоиска) Тогда
			
			Если НЕ ПараметрыПроцедуры.ПерезаполнятьСуществующиеСтатьи Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтатья = ВыборкаСуществующиеСтатьи.ПлановаяСтатья.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(НоваяСтатья, ВыборкаОбъектыКопирования);
			
		Иначе
			НоваяСтатья = ВыборкаОбъектыКопирования.ПлановаяСтатья.Скопировать();
		КонецЕсли;
		
	
		НоваяСтатья.Владелец = ПараметрыПроцедуры.Ссылка;
		Если ПараметрыПроцедуры.ЗаполнятьПлательщика И ВыборкаОбъектыКопирования.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда
			НоваяСтатья.Контрагент = Плательщик;
		КонецЕсли; 
		CW_Бюджетирование.ПересчитатьСтатьюБюджетаПоКурсу(НоваяСтатья);	
		Попытка
			НоваяСтатья.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки; 
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодключаемыеКоманды_ЗаполнитьБюджет(ПараметрыПроцедуры, АдресРезультата = Неопределено) Экспорт
	
	Обработка 	= _ПО.ПолучитьОбработку(ПараметрыПроцедуры.Обработка);
	Ответ 		= Обработка.ЗаполнитьБюджет(ПараметрыПроцедуры);
	
	ПоместитьВоВременноеХранилище(Ответ, АдресРезультата);

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.CW_Представление;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    Поля.Добавить("CW_Представление");

КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	

КонецПроцедуры

//Шаблоны стандартных писем  
Процедура ДополнитьМакросыОбъекта(ДеревоМакросов) Экспорт   
	
	ГруппаМакросов = ДеревоМакросов.Строки.Добавить();  
	ГруппаМакросов.ИндексКартинки 	= 0;
	ГруппаМакросов.Значение 		= "";
	ГруппаМакросов.Представление 	= "Грузоперевозка";
	ГруппаМакросов.ЭтоГруппа 		= Истина;
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Грузоперевозка]", 		"Грузоперевозка", 		4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Заказ]", 				"Заказ",				4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Заявка]", 				"Заявка",				4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаГрузоперевозки]", 	"Дата грузоперевозки", 	2); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ТипПеревозки]", 		"Тип перевозки",		4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Контрагент]", 			"Контрагент",			4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[МенеджерПродаж]", 		"Менеджер продаж",		4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ОперативныйМенеджер]", "Оперативный менеджер",	4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Груз]", 				"Груз",					4);  			
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Типоразмер]", 			"Типоразмер",			4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Маршрут]", 			"Маршрут",				4); 
	
	ГруппаПараметров = ГруппаМакросов.Строки.Добавить();  
	ГруппаПараметров.ИндексКартинки = 0;
	ГруппаПараметров.Значение 		= "";
	ГруппаПараметров.Представление 	= "Параметры";
	ГруппаПараметров.ЭтоГруппа 		= Истина;
	
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ДополнитьМакросыПараметровГрузоперевозок(ГруппаПараметров);
	
КонецПроцедуры 

Процедура ДобавитьСтрокуМакросов(ГруппаМакросов, Значение, Представление, ИндексКартинки)
	
	СтрокаМакроса = ГруппаМакросов.Строки.Добавить();
	СтрокаМакроса.ИндексКартинки 	= ИндексКартинки;
	СтрокаМакроса.Значение 			= Значение;
	СтрокаМакроса.Представление 	= Представление;
	СтрокаМакроса.ЭтоГруппа 		= Ложь;
	
КонецПроцедуры


Процедура ПолучитьОписаниеМакросов(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	
	Результат.Вставить("[Грузоперевозка]", 		"Источник.CW_Представление");
	Результат.Вставить("[Заказ]", 				"Источник.Заказ");
	Результат.Вставить("[Заявка]", 				"Источник.Заявка");
	Результат.Вставить("[ДатаГрузоперевозки]", 	"Источник.ДатаСделкиФ");
	Результат.Вставить("[Контрагент]", 			"Источник.Клиент");
	Результат.Вставить("[ТипПеревозки]", 		"Источник.ТипПеревозки");
	Результат.Вставить("[МенеджерПродаж]", 		"Источник.МенеджерПродаж");
	Результат.Вставить("[ОперативныйМенеджер]", "Источник.ОперативныйМенеджер");
	Результат.Вставить("[Груз]",				"Источник.Груз");
	Результат.Вставить("[Типоразмер]", 			"Источник.Типоразмер");
	Результат.Вставить("[Маршрут]",				"Источник.Маршрут");

	Результат.Вставить("[ФИООтправителя]", "CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(НастройкиПользователя.ФИО, Источник.ДатаСделкиФ)");
	
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ОписаниеМакросовПараметровГрузоперевозок(Результат);
	
КонецПроцедуры

Функция ПолучитьЗначениеПараметра(Источник, ИдентификаторПараметра,  ПолучаемоеЗначение = "Значение", СоответствиеПараметров) Экспорт
	
	Параметр = СоответствиеПараметров.Получить(ИдентификаторПараметра);
	Если Параметр = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПараметрыГрузоперевозок.Значение КАК Значение,
	|	ПараметрыГрузоперевозок.ЗначениеПлан КАК ЗначениеПлан,
	|	ПараметрыГрузоперевозок.ЗначениеФакт КАК ЗначениеФакт
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК ПараметрыГрузоперевозок
	|ГДЕ
	|	ПараметрыГрузоперевозок.Грузоперевозка = &Грузоперевозка
	|	И ПараметрыГрузоперевозок.Параметр = &Параметр";
	
	Запрос.УстановитьПараметр("Грузоперевозка",	Источник);
	Запрос.УстановитьПараметр("Параметр",		Параметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеПараметра = Выборка[ПолучаемоеЗначение];
	КонецЕсли;
	
	Возврат ЗначениеПараметра;

КонецФункции

//---Шаблоны стандартных писем

#КонецЕсли


