//см.CW_ОбновлениеКонфигурацииСервер.ПриДобавленииОбработчиков()
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт  
	
	//ПриКаждомОбновлении
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_ЛичныйКабинетКлиентаСлужебный.ЛичныйКабинетУдалитьНастройкуРекламы";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_ЛичныйКабинетКлиента";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 3;
	НоваяСтрока.Наименование		= "Удалить настройку рекламы личного кабинета";
	НоваяСтрока.Комментарий			= "Сбрасывает настройку отображения рекламы личного кабинета";
	//---ПриКаждомОбновлении

	////Версия 8.3.0.0
	//НоваяСтрока = Обработчики.Добавить();
	//НоваяСтрока.ИмяОбработчика  		= "CW_ЛичныйКабинетКлиентаСлужебный.<...>";  
	//НоваяСтрока.Версия 				= "8.3.0.0";
	//НоваяСтрока.ИмяПодсистемы 		= "CW_ЛичныйКабинетКлиента";
	//НоваяСтрока.НачальноеЗаполнение	= Ложь;
	//НоваяСтрока.ПриКаждомОбновлении	= Истина;
	//НоваяСтрока.РежимВыполнения		= "Оперативно";
	//НоваяСтрока.ОчередьВыполнения		= 9;
	//НоваяСтрока.Наименование			= "<>";
	//НоваяСтрока.Комментарий			= "<>";   
	////Версия 8.3.0.0
	
	
КонецПроцедуры   

//Обязательные процедуры при переходе на каждый релиз
Процедура ЛичныйКабинетУдалитьНастройкуРекламы(АдресРезультата=Неопределено) Экспорт
	
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитора.CW_ЛичныйКабинетКлиента") Тогда
		CW_ОбщийМодульЛичныйКабинетСервер.УдалитьНастройкуПоказаРекламы(); 
	КонецЕсли;
	
КонецПроцедуры   
//Обязательные процедуры при переходе на каждый релиз

