#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьХарактиристикиОбъекта(Объект) Экспорт

Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ХарактеристикиДоговоровИПриложений.Параметр КАК Параметр,
	               |	CW_ХарактеристикиДоговоровИПриложений.Значение КАК Значение,
	               |	ВЫБОР
	               |		КОГДА CW_ХарактеристикиДоговоровИПриложений.Параметр.ЭтоКонтрольнаяДата
	               |			ТОГДА 2
	               |		КОГДА CW_ХарактеристикиДоговоровИПриложений.Параметр.ДинамическийПараметр
	               |			ТОГДА 3
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ИндексКартинки,
	               |	CW_ХарактеристикиДоговоровИПриложений.Порядок КАК Порядок,
	               |	CW_ХарактеристикиДоговоровИПриложений.Параметр.ОграниченСпискомЗначений КАК ОграниченСпискомЗначений
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиДоговоровИПриложений КАК CW_ХарактеристикиДоговоровИПриложений
	               |ГДЕ
	               |	CW_ХарактеристикиДоговоровИПриложений.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Процедура ЗаписатьЗначенияПараметровВРегистр(Объект, ДополнительныеХарактеристики) Экспорт
	
	НаборПараметров = РегистрыСведений.CW_ХарактеристикиДоговоровИПриложений.СоздатьНаборЗаписей();
	НаборПараметров.Отбор.Объект.Установить(Объект);
	
	Для Каждого СтрокаПараметров из ДополнительныеХарактеристики Цикл
		СтрокаНабора = НаборПараметров.Добавить();
		СтрокаНабора.Объект 	= Объект;
		СтрокаНабора.Параметр 	= СтрокаПараметров.Параметр;
		СтрокаНабора.Значение 	= СтрокаПараметров.Значение;
		
		СтрокаНабора.Порядок    = ДополнительныеХарактеристики.Индекс(СтрокаПараметров);
	КонецЦикла;
	
	НаборПараметров.Записать(Истина);
	
КонецПроцедуры

#КонецЕсли