
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.АдресСхемы));
	
	// убираем системные поля  
	Для каждого ПолеВыбора Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл 
		Если ПолеВыбора.Папка ИЛИ ПолеВыбора.Таблица Тогда
			ДобавитьОграничение(Строка(ПолеВыбора.Поле)); 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОграничение(ИмяПоля)
	
	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Ограничение = Элементы.ДоступныеПоля.ОграниченияИспользования.Добавить();
	Ограничение.Доступность = Ложь;
	Ограничение.Поле = Поле;
	
КонецПроцедуры


&НаКлиенте
Процедура ДоступныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДоступноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока);
	
	ПозТочки 		= СтрНайти(ДоступноеПоле.Поле, ".");
	ВыбранноеПоле 	= Сред(ДоступноеПоле.Поле,ПозТочки+1);
	
	ЭтаФорма.Закрыть(ВыбранноеПоле);
	
КонецПроцедуры

