
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформлениеСписка();

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСписка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Цвета.Ссылка КАК Ссылка,
	               |	CW_Цвета.ХранилищеЦвета КАК ХранилищеЦвета
	               |ИЗ
	               |	Справочник.CW_Цвета КАК CW_Цвета"; 
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Цвет = Выборка.ХранилищеЦвета.Получить();  
		Если Цвет <> Неопределено Тогда     
			
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();    
			
			ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Список.Ссылка");
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение 	= Выборка.Ссылка;
			ЭлементОтбора.Использование 	= Истина; 
			
			ПолеУсловногоОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеУсловногоОформления.Поле 			= Новый ПолеКомпоновкиДанных("Ссылка");
			ПолеУсловногоОформления.Использование 	= Истина;
			
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Цвет);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

//Внешние подклчюаемые команды
&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры
//Внешние подклчюаемые команды
