&НаСервере
Функция ВыполнитьДействие(УФ, СтруктураДействия) Экспорт 
	
	ИмяКоманды = СтруктураДействия.Команда;
	Параметры = СтруктураДействия.Параметры;

	Отладка = УФ.Отладка;
	Если (Отладка) Тогда
		Сообщить("Сервер: """+ИмяКоманды+"""");
	КонецЕсли; 
	
	Если (ИмяКоманды = "/ВыполнитьДействие") Тогда 
		
		// если вдруг понадобится выполнить серверное действие с возвратом на клиента
		Возврат(Параметры);
		
	#Область Общие
	
	ИначеЕсли (ИмяКоманды = "/ИнициализацияФормы") Тогда 
		
		// если вдруг понадобится выполнить серверное действие с возвратом на клиента
		Возврат(ИнициализацияФормы(УФ));
		
	ИначеЕсли (ИмяКоманды = "/Заголовок") Тогда 
		
		// если вдруг понадобится выполнить серверное действие с возвратом на клиента
		Возврат(УстановитьЗаголовок(УФ));
	
	ИначеЕсли (ИмяКоманды = "/ПраваДоступа") Тогда 
		
		// если вдруг понадобится выполнить серверное действие с возвратом на клиента
		Возврат(ПраваДоступа(УФ));
		
	ИначеЕсли (ИмяКоманды = "/УправлениеЭлементамиФормы") Тогда 
		
		Возврат(УправлениеЭлементамиФормы(УФ)); 
		
	ИначеЕсли (ИмяКоманды = "/ОтборДокументовФинансовогоРезультата") Тогда 
		
		Возврат(ОтборДокументовФинансовогоРезультата(УФ)); 
		
	ИначеЕсли (ИмяКоманды = "/ПроверитьНомерКонтейнера") Тогда 
		
		Возврат(ПроверитьНомерКонтейнера(УФ));
		
	#КонецОбласти
	
	#Область Параметры
	
	ИначеЕсли (ИмяКоманды = "/ДеревоПараметровОбновить") Тогда 
		
		Возврат(ДеревоПараметровОбновить(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ЗаполнитьПараметрыИзТипаПеревозки") Тогда 
		
		Возврат(ЗаполнитьПараметрыИзТипаПеревозки(УФ,?(Параметры=Неопределено,Ложь,Параметры)));
		
	ИначеЕсли (ИмяКоманды = "/УдалитьНетиповыеПараметры") Тогда 
		
		Возврат(УдалитьНетиповыеПараметры(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ЗаполнитьПредопределенныеПараметры") Тогда 
		
		Возврат(ЗаполнитьПредопределенныеПараметры(УФ)); 
	
	ИначеЕсли (ИмяКоманды = "/ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита") Тогда 
		
		Возврат(ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(УФ,Параметры));
		
	ИначеЕсли (ИмяКоманды = "/ЗафиксироватьНачальныйПорядокПараметров") Тогда 
		
		Возврат(ЗафиксироватьНачальныйПорядокПараметров(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ЗафиксироватьКонечныйПорядокПараметров") Тогда 
		
		Возврат(ЗафиксироватьКонечныйПорядокПараметров(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ПроверитьПорядокПараметров") Тогда 
		
		Возврат(ПроверитьПорядокПараметров(УФ));
		
	ИначеЕсли (ИмяКоманды = "/ДеревоПараметровОбновитьПараметр") Тогда 
		
		Возврат(ДеревоПараметровОбновитьПараметр(УФ,Параметры));
		
	ИначеЕсли (ИмяКоманды = "/ДеревоПараметровУдалитьПараметр") Тогда 
		
		Возврат(ДеревоПараметровУдалитьПараметр(УФ,Параметры));
		
	#КонецОбласти
		
	#Область Бюджет
		
	ИначеЕсли (ИмяКоманды = "/БюджетИнициализация") Тогда 
		
		Возврат(БюджетИнициализация(УФ)); 
		
	ИначеЕсли (ИмяКоманды = "/БюджетОбновитьТаблицу") Тогда 
		
		Возврат(ОбновитьТаблицуБюджетов(УФ)); 
		
	ИначеЕсли (ИмяКоманды = "/БюджетРасходыОбновить") Тогда 
		
		Возврат(БюджетОбновить(УФ,Истина,Ложь)); 
		
	ИначеЕсли (ИмяКоманды = "/БюджетРасходыОбновитьИтоги") Тогда 
		
		Возврат(БюджетОбновитьИтоги(УФ,Истина,Ложь)); 
		
	ИначеЕсли (ИмяКоманды = "/БюджетДоходыОбновить") Тогда 
		
		Возврат(БюджетОбновить(УФ,Ложь,Истина)); 
		
	ИначеЕсли (ИмяКоманды = "/БюджетДоходыОбновитьИтоги") Тогда 
		
		Возврат(БюджетОбновитьИтоги(УФ,Ложь,Истина)); 
		
	ИначеЕсли (ИмяКоманды = "/БюджетОбновить") Тогда 
		
		Возврат(БюджетОбновить(УФ,Истина,Истина)); 
		
	ИначеЕсли (ИмяКоманды = "/БюджетУдалить") Тогда 
		
		Возврат(БюджетУдалить(УФ,Параметры)); 
		
	ИначеЕсли (ИмяКоманды = "/БюджетКонтрагентыПолучить") Тогда 
		
		Возврат(БюджетКонтрагентыПолучить(УФ)); 
		
	ИначеЕсли (ИмяКоманды = "/БюджетКонтрагентыУстановить") Тогда 
		
		Возврат(БюджетКонтрагентыУстановить(УФ,Параметры)); 
		
	ИначеЕсли (ИмяКоманды = "/БюджетЗаполнитьОбработкиЗаполнения") Тогда 
		
		Возврат(БюджетЗаполнитьОбработкиЗаполнения(УФ)); 
		
	ИначеЕсли (ИмяКоманды = "/БюджетЗаполнитьДоходыПоРасходам") Тогда 
		
		Возврат(БюджетЗаполнитьДоходыПоРасходам(УФ, Параметры)); 
		
	ИначеЕсли (ИмяКоманды = "/ПересчетСтатейБюджетаПоКурсу") Тогда 
		
		Возврат(ПересчетСтатейБюджетаПоКурсу(УФ,Параметры)); 
		
	#КонецОбласти
	
	#Область Финансы
	
	ИначеЕсли (ИмяКоманды = "/ФинансыОбновить") Тогда 
		
		Возврат(ФинансыОбновить(УФ,Истина,Истина,Истина)); 
	
	ИначеЕсли (ИмяКоманды = "/ФинансыРасходыОбновить") Тогда 
		
		Возврат(ФинансыОбновить(УФ,Истина,Ложь,Ложь)); 
		
	ИначеЕсли (ИмяКоманды = "/ФинансыТранспортОбновить") Тогда 
		
		Возврат(ФинансыОбновить(УФ,Ложь,Ложь,Истина)); 

	ИначеЕсли (ИмяКоманды = "/ФинансыРезультатОбновить") Тогда 
		
		Возврат(ФинансыОбновить(УФ,Ложь,Ложь,Ложь)); 
		
	ИначеЕсли (ИмяКоманды = "/ФинансыРасходыОбновитьИтоги") Тогда 
		
		Возврат(ФинансыОбновитьИтоги(УФ)); 
		
	ИначеЕсли (ИмяКоманды = "/ФинансыДоходыОбновить") Тогда 
		
		Возврат(ФинансыОбновить(УФ,Ложь,Истина,Ложь)); 
		
	ИначеЕсли (ИмяКоманды = "/ФинансыДоходыОбновитьИтоги") Тогда 
		
		Возврат(ФинансыОбновитьИтоги(УФ)); 
		
	ИначеЕсли (ИмяКоманды = "/ФинансыУдалить") Тогда 
		
		Возврат(ФинансыУдалить(УФ,Параметры)); 
	
	#КонецОбласти 
	
	#Область Декларации
	
	ИначеЕсли (ИмяКоманды = "/ДекларацииОбновить") Тогда 
		
		Возврат(ДекларацииОбновить(УФ)); 
	
	#КонецОбласти
	
	#Область Связи

	ИначеЕсли (ИмяКоманды = "/ОтборСвязей") Тогда 
		
		Возврат(ОтборСвязей(УФ)); 

	#КонецОбласти 
	
	ИначеЕсли (ИмяКоманды = "/ОбновитьДатуЗакрытия") Тогда 
		
		Возврат(ОбновитьДатуЗакрытия(УФ));
		
	Иначе 
		
		Сообщить("Сервер: неизвестная команда """+ИмяКоманды+"""");
		Возврат(Неопределено);
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ФормаГрузоперевозки(УФ)
	// --- 
	
	Возврат( УФ.ИмяФормы = "Справочник.CW_Грузоперевозки.Форма.ФормаЭлемента" );
	
	// --- 
КонецФункции

&НаСервере
Функция ФормаЗаказа(УФ)
	// --- 
	
	Возврат( УФ.ИмяФормы = "Справочник.CW_Заказы.Форма.ФормаЭлемента" );
	
	// --- 
КонецФункции

&НаСервере
Функция ФормаЗаявки(УФ)
	// --- 
	
	Возврат( УФ.ИмяФормы = "Справочник.CW_Заявки.Форма.ФормаЭлемента" );
	
	// --- 
КонецФункции

&НаСервере
Функция ИнициализацияФормы(УФ)
	// --- 
	
	Объект = УФ.Объект;
	Если (Объект.Ссылка.Пустая()) Тогда
		УФ.Модифицированность = Истина;
	КонецЕсли; 
	// --- 
	СеансоваяНастройка = _УФС.ЗагрузитьСеансовыеНастройки(УФ);
	Если (СеансоваяНастройка <> Неопределено) Тогда
		
		СеансоваяНастройка.Свойство("ФинансыРасходыОтображатьПостатейно",УФ.ФинансыРасходыОтображатьПостатейно);
		УФ.Элементы.Форма_ФинансыРасходыОтобразитьСтатьи.Пометка = УФ.ФинансыРасходыОтображатьПостатейно;
		
		СеансоваяНастройка.Свойство("ФинансыДоходыОтображатьПостатейно",УФ.ФинансыДоходыОтображатьПостатейно);
		УФ.Элементы.Форма_ФинансыДоходыОтобразитьСтатьи.Пометка = УФ.ФинансыДоходыОтображатьПостатейно;
		
		СеансоваяНастройка.Свойство("ФинансыТранспортОтображатьПостатейно",УФ.ФинансыТранспортОтображатьПостатейно);
		УФ.Элементы.Форма_ФинансыТранспортОтобразитьСтатьи.Пометка = УФ.ФинансыТранспортОтображатьПостатейно;
		
	КонецЕсли;
	
	// инициализация формы грузоперевозки
	Если (ФормаГрузоперевозки(УФ)) Тогда
		
		_сф.УстановитьЕслиНезаполнено(Объект.ДатаСделкиФ,ТекущаяДата());
		// --- 
		//УФ.Элементы.Представление.КнопкаОткрытия = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМониторингаОборудования");
		// --- 
		Пользователь=CW_Настройки.Пользователь();
		НП = CW_Настройки.ПолучитьНастройкиПользователя(Пользователь);
		// --- 
		УФ.ВРУ = CW_Настройки.ВалютаРегламентированногоУчета(); 
		УФ.ПроверятьНомерКонтейнера = НП.ПроверятьНомерКонтейнера;
		УФ.ОтображениеФинансовогоРезультата = НП.ОтображениеФинРез;
		УФ.ВыводитьРезультатВВалютеДокументов = НП.ВыводитьФинансовыйРезультатВВалютеДокументов;
		УФ.КонтролироватьПросрочкуПлановыхДат = НП.КонтролироватьПросрочкуПлановыхДат;
		УФ.ПоказыватьКоличествоПараметров = НП.ПоказыватьКоличествоПараметровВГруппах;
		// --- 
		УФ.Элементы.СтраницаДекларации.Видимость = (Константы.CW_ВедетсяУчетДТ.Получить());
		УФ.Элементы.СтраницаСвязи.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеМеханизмаСвязейГрузоперевозок");
		
		// заполнение при копировании
		Если (УФ.ОбъектКопирования.Пустая()) Тогда
			
			Если (Объект.Ссылка.Пустая() И НЕ Объект.ТипПеревозки.Пустая()) Тогда
				
				ЗаполнитьПараметрыИзТипаПеревозки(УФ);
				
			КонецЕсли;
			
		КонецЕсли; 
		
		// --- 
		ПроверитьНомерКонтейнера(УФ);
		ОбновитьДатуЗакрытия(УФ);
		ПраваДоступа(УФ);
		БюджетИнициализация(УФ);
		ОтборДокументовФинансовогоРезультата(УФ);
		Если (УФ.Элементы.СтраницаСвязи.Видимость) Тогда
			ОтборСвязей(УФ);	
		КонецЕсли; 
		ЗаполнитьПредопределенныеПараметры(УФ);
		УправлениеЭлементамиФормы(УФ);
		
		// обязательные реквизиты
		//УФ.Элементы.Клиент.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеКлиент");
		УФ.Элементы.Клиент.АвтоОтметкаНезаполненного = Объект.ТипПеревозки.КонтрольЗаполненияКлиента;
		// --- 
		УФ.Элементы.Груз.Видимость = Константы.CW_Мониторинг_Груз.Получить();
		УФ.Элементы.Груз.АвтоОтметкаНезаполненного = Объект.ТипПеревозки.КонтрольЗаполненияГруза;
		// --- 
		УФ.Элементы.Маршрут.Видимость = Константы.CW_Мониторинг_Маршрут.Получить();
		УФ.Элементы.Маршрут.АвтоОтметкаНезаполненного = Объект.ТипПеревозки.КонтрольЗаполненияМаршрута;
		// --- 
		УФ.Элементы.ОперативныйМенеджер.Видимость = Константы.CW_Мониторинг_ОперативныйМенеджер.Получить();
		УФ.Элементы.ОперативныйМенеджер.АвтоОтметкаНезаполненного = Объект.ТипПеревозки.КонтрольЗаполненияОперативногоМенеджера;
		// --- 
		УФ.Элементы.МенеджерПродаж.Видимость = Константы.CW_Мониторинг_МенеджерПродаж.Получить();
		УФ.Элементы.МенеджерПродаж.АвтоОтметкаНезаполненного = Объект.ТипПеревозки.КонтрольЗаполненияМенеджераПродаж;
		
		// --- 
		Элемент = УФ.Элементы.БюджетТекущаяВерсия;
		Элемент.РедактированиеТекста=Ложь;
		Элемент.РежимВыбораИзСписка=Ложь;
		Элемент.КнопкаВыбора=Истина;
		Элемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		Элемент.КнопкаВыпадающегоСписка=Ложь;
		Элемент.СписокВыбора.Очистить();
		// --- 
		Элемент.ИсторияВыбораПриВводе=ИсторияВыбораПриВводе.НеИспользовать;
		
		// --- 
		
		ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());
		Если (ГруппаПользователя.ОграничениеПоТипамГрузоперевозок) Тогда
			
			УФ.Элементы.ТипПеревозки.РежимВыбораИзСписка=Истина;
			УФ.Элементы.ТипПеревозки.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
			УФ.Элементы.ТипПеревозки.ИсторияВыбораПриВводе=ИсторияВыбораПриВводе.НеИспользовать;
			// --- 
			УФ.Элементы.ТипПеревозки.СписокВыбора.Очистить();
			МассивДоступныхТипов = Новый Массив;
			Для каждого Стр Из ГруппаПользователя.ДоступныеТипыГрузоперевозок Цикл
				УФ.Элементы.ТипПеревозки.СписокВыбора.Добавить(Стр.ТипГрузоперевозки);
				МассивДоступныхТипов.Добавить(Стр.ТипГрузоперевозки);
			КонецЦикла; 
			
			Если (НЕ Объект.ТипПеревозки.Пустая()) Тогда
				Если (МассивДоступныхТипов.Найти(Объект.ТипПеревозки) = Неопределено) Тогда
					УФ.Элементы.ТипПеревозки.Доступность = Ложь;
				КонецЕсли; 	
			КонецЕсли; 
			
		КонецЕсли; 
		
		//УстановитьЗаголовок(УФ);
		
	// Инициализация формы заказа
	ИначеЕсли (ФормаЗаказа(УФ)) Тогда 
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаСделкиФ) Тогда
			Объект.ДатаСделкиФ=ТекущаяДата();
		КонецЕсли; 
		
		Пользователь=CW_Настройки.Пользователь();
		НП = CW_Настройки.ПолучитьНастройкиПользователя(Пользователь);
		// --- 
		УФ.КонтролироватьПросрочкуПлановыхДат = НП.КонтролироватьПросрочкуПлановыхДат;
	
		УФ.ОтображениеФинансовогоРезультата = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(), "ОтображениеФинРез");
		УФ.ВыводитьРезультатВВалютеДокументов = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(), "ВыводитьФинансовыйРезультатВВалютеДокументов");
		УФ.ВРУ = CW_Настройки.ВалютаРегламентированногоУчета();
		
		//УФ.Элементы.Заявка.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаявок");
		// ---------------------------------------------------------------------------- 
		УФ.Элементы.СтраницаДекларации.Видимость = (Константы.CW_ВедетсяУчетДТ.Получить());
		
		Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования")) Тогда 
			БюджетИнициализация(УФ);
		Иначе 
			УФ.Элементы.СтраницаБюджет.Видимость = Ложь;
			УФ.Элементы.Форма_ФинансыРасходыДобавитьПоБюджету.Видимость = Ложь;
			УФ.Элементы.Форма_ФинансыДоходыДобавитьПоБюджету.Видимость = Ложь;
		КонецЕсли;
		
		ПраваДоступа(УФ);
		ОтборДокументовФинансовогоРезультата(УФ);
		УправлениеЭлементамиФормы(УФ); 
		
		// --- 
		
		ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());
		Если (ГруппаПользователя.ОграничениеПоТипамГрузоперевозок) Тогда
			
			УФ.Элементы.ТипПеревозки.РежимВыбораИзСписка=Истина;
			УФ.Элементы.ТипПеревозки.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
			УФ.Элементы.ТипПеревозки.ИсторияВыбораПриВводе=ИсторияВыбораПриВводе.НеИспользовать;
			// --- 
			УФ.Элементы.ТипПеревозки.СписокВыбора.Очистить();
			МассивДоступныхТипов = Новый Массив;
			Для каждого Стр Из ГруппаПользователя.ДоступныеТипыГрузоперевозок Цикл
				УФ.Элементы.ТипПеревозки.СписокВыбора.Добавить(Стр.ТипГрузоперевозки);
				МассивДоступныхТипов.Добавить(Стр.ТипГрузоперевозки);
			КонецЦикла; 
			
			Если (НЕ Объект.ТипПеревозки.Пустая()) Тогда
				Если (МассивДоступныхТипов.Найти(Объект.ТипПеревозки) = Неопределено) Тогда
					Если (НЕ Объект.Ссылка.Пустая()) Тогда
						УФ.ТолькоПросмотр = Истина;	
					КонецЕсли; 
				КонецЕсли;	
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (НЕ ГруппаПользователя.ПолныеПрава) Тогда
			
			Если (НЕ ГруппаПользователя.ПравоРедактироватьНомерЗаказа) Тогда
				
				УФ.Элементы.Наименование.Доступность = Ложь;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		// --- 
		
		Элемент = УФ.Элементы.БюджетТекущаяВерсия;
		Элемент.РедактированиеТекста=Ложь;
		Элемент.РежимВыбораИзСписка=Ложь;
		Элемент.КнопкаВыбора=Истина;
		Элемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		Элемент.КнопкаВыпадающегоСписка=Ложь;
		Элемент.СписокВыбора.Очистить();
		// --- 
		Элемент.ИсторияВыбораПриВводе=ИсторияВыбораПриВводе.НеИспользовать;
		
		// --- 
		
	КонецЕсли; 
	
	// --- 
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(УФ);
	
	// --- 
КонецФункции

&НаСервере
Функция УстановитьЗаголовок(УФ)
	// --- 
	
	Если (ЗначениеЗаполнено(УФ.Объект.Ссылка)) Тогда
		
		ТекстЗаголовка = "";
		Если (ЗначениеЗаполнено(УФ.Объект.CW_Представление)) Тогда
			ТекстЗаголовка = СокрЛП(УФ.Объект.CW_Представление);
		КонецЕсли; 
		ТекстСтатуса = Строка(УФ.ЛогистическийСтатус);
		
		Если (ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок")) Тогда
			Если CW_ФинансовыеСтатусыСервер.ФинансовыеСтатусыДоступныДляОбъкта(ТипЗнч(УФ.Объект.Ссылка)) Тогда
				
				СоответствиеПервогоСтатуса 	= Справочники.CW_ФинансовыеСтатусы.ПолучитьСоответствиеНеопредленногоСтатуса();
				ПервыйСтатус 				= СоответствиеПервогоСтатуса.Получить(ТипЗнч(УФ.Объект.Ссылка));
				СтрокаФинансовогоСтатуса    = Строка(ПервыйСтатус);
				
				ТекстСтатуса = ТекстСтатуса + " / "+СтрокаФинансовогоСтатуса;
			КонецЕсли;
		КонецЕсли; 
		
		ТекстЗаголовка = ТекстЗаголовка+ " ("+ТекстСтатуса+")";
		// --- 
		УФ.Заголовок = ТекстЗаголовка;
		
	Иначе
		
		Если (ЗначениеЗаполнено(УФ.Объект.CW_Представление)) Тогда
			
			УФ.Заголовок = "Новая грузоперевозка: "+УФ.Объект.CW_Представление;
			
		Иначе
			
			УФ.Заголовок = "Новая грузоперевозка";
			
		КонецЕсли; 
		
	КонецЕсли; 	
	
	// --- 
КонецФункции
 
&НаСервере
Функция ПолучитьСтруктуруРедактируемыхРеквизитовШапки(ЭтоГрузоперевозка) Экспорт
	
	СтркутураРеквизитовШапки = Новый Структура;
	
	Если ЭтоГрузоперевозка Тогда
		СтркутураРеквизитовШапки.Вставить("Представление"		, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_Представление"));
		СтркутураРеквизитовШапки.Вставить("Типоразмер"			, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_Типоразмер"));
		СтркутураРеквизитовШапки.Вставить("Заказ"				, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_Заказ"));
	КонецЕсли;
	
	СтркутураРеквизитовШапки.Вставить("Код"					, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_Код"));
	СтркутураРеквизитовШапки.Вставить("ДатаСделкиФ"			, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_ДатаСделкиФ"));
	СтркутураРеквизитовШапки.Вставить("ТипПеревозки"		, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_ТипПеревозки"));
	СтркутураРеквизитовШапки.Вставить("МенеджерПродаж"		, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_МенеджерПродаж"));
	СтркутураРеквизитовШапки.Вставить("ОперативныйМенеджер"	, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_ОперативныйМенеджер"));
	СтркутураРеквизитовШапки.Вставить("Клиент"				, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_Клиент"));
	СтркутураРеквизитовШапки.Вставить("Маршрут"				, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_Маршрут"));
	СтркутураРеквизитовШапки.Вставить("Груз"				, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_Груз"));
	СтркутураРеквизитовШапки.Вставить("Заявка"				, CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок_Заявка"));
	
	Возврат СтркутураРеквизитовШапки;
	
КонецФункции

// Управляет видимостью и доступностью элементов форм "Грузоперевозка" и "Заказ"
// в зависимости от прав пользователя
&НаСервере
Функция ПраваДоступа(УФ)
	
	БлокироватьОбъекты 	= CW_АрхивОбъектовСервер.БлокироватьОбъектыПриПереводеВАрхив(); 
	Архив	= УФ.Объект.Архив и БлокироватьОбъекты;
	
	// получим права
	ПравоЗакрытияМониторинга = CW_ПраваДоступа.ПравоДоступно("БлокировкаМониторинга");
	ПравоОтменыЗакрытияМониторинга = CW_ПраваДоступа.ПравоДоступно("ОтменаБлокировкиМониторинга");
	ДобавлениеГрузоперевозок = CW_ПраваДоступа.ПравоДоступно("ДобавлениеГрузоперевозок");
	ПросмотрБюджетов = CW_ПраваДоступа.ПравоДоступно("ПросмотрБюджетов");
	ПросмотрФинансов = CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов");
	ПросмотрРасходов = CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Расходы");
	ПросмотрДоходов = CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Доходы");
	ПравоАнализаЭкономики = CW_ПраваДоступа.ПравоДоступно("АнализЭкономикиГрузоперевозок"); 
	ЕстьПравоРедактированиеОсновныхСвойствГрузоперевозок = CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок");
	
	
	ИспользуетсяБлокировка = УФ.ИспользуетсяБлокировкаМониторинга;
	БлокировкаМониторинга = Ложь;
	Если (ИспользуетсяБлокировка) Тогда
		БлокировкаМониторинга = ЗначениеЗаполнено(УФ.ДатаБлокировкиМониторинга);
	КонецЕсли; 
	
	// форма грузоперевозки
	Если (ФормаГрузоперевозки(УФ)) Тогда
		
		УФ.ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());
		Если (УФ.ГруппаПользователя.ПолныеПрава) Тогда
			УФ.ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
		КонецЕсли;
		
		Если ЕстьПравоРедактированиеОсновныхСвойствГрузоперевозок Тогда
			СтркутураРеквизитовШапки = ПолучитьСтруктуруРедактируемыхРеквизитовШапки(истина);
		КонецЕсли;
		
		ТолькоПросмотрШапки =  (НЕ ЕстьПравоРедактированиеОсновныхСвойствГрузоперевозок  ИЛИ БлокировкаМониторинга);
		Если Не ТолькоПросмотрШапки Тогда
			
			//по списку реквизитов
			Для Каждого ЭлементСтркутуры из СтркутураРеквизитовШапки Цикл
				УФ.Элементы[ЭлементСтркутуры.Ключ].ТолькоПросмотр = Не ЭлементСтркутуры.Значение;
			КонецЦикла;
		КонецЕсли;
		
		УФ.Элементы.ГруппаШапка.ТолькоПросмотр = ТолькоПросмотрШапки;
		УФ.Элементы.Заказ.ТолькоПросмотр = (НЕ ДобавлениеГрузоперевозок ИЛИ БлокировкаМониторинга);
		УФ.Элементы.ПерезаполнитьРеквизитыШапкиПоЗаказу.Доступность = Не УФ.Элементы.Заказ.ТолькоПросмотр и НЕ Архив;
		
		Если (ИспользуетсяБлокировка) Тогда
			ВидимостьКнопки = ПравоЗакрытияМониторинга;
			Если (БлокировкаМониторинга)  Тогда
				ВидимостьКнопки = ПравоОтменыЗакрытияМониторинга;
			КонецЕсли; 
			ВидимостьКнопки = ВидимостьКнопки И НЕ ЗначениеЗаполнено(УФ.Объект.Заказ);
			УФ.Элементы.ИзменитьДатуБлокировкиГрузоперевозок.Видимость = ВидимостьКнопки;
		КонецЕсли; 
		
		// параметры
		УФ.Элементы.ДПГ.ИзменятьСоставСтрок = (НЕ БлокировкаМониторинга);
		УФ.Элементы.ДПГ_ПерезаполнитьПараметрыПоШаблону.Доступность = (НЕ БлокировкаМониторинга) и НЕ Архив;
		//УФ.Элементы.ГруппаШапка.ТолькоПросмотр = (БлокировкаМониторинга);
		УФ.Элементы.ПерезаполнитьРеквизитыШапкиПоЗаказу.Доступность = (НЕ БлокировкаМониторинга) и НЕ Архив;
		УФ.Элементы.Форма_ПроверитьНомерГрузоперевозки.Доступность = (НЕ БлокировкаМониторинга) и НЕ Архив;
		
		УФ.Элементы.ДеревоПараметровРедактировать.Доступность 			= НЕ БлокировкаМониторинга и НЕ Архив;
		УФ.Элементы.ДПГДПГ_ДобавитьГруппу.Доступность 					= НЕ БлокировкаМониторинга и НЕ Архив;
		УФ.Элементы.ДПГКонтекстноеМенюСтрока_Вставить.Доступность		= НЕ БлокировкаМониторинга и НЕ Архив;
		УФ.Элементы.ДПГКонтекстноеМенюСтрока_Вырезать.Доступность		= НЕ БлокировкаМониторинга и НЕ Архив;
		УФ.Элементы.ДПГКонтекстноеМенюДПГ_ДобавитьГруппу.Доступность	= НЕ БлокировкаМониторинга и НЕ Архив;
		УФ.Элементы.ДПГКонтекстноеМенюИзменить.Доступность				= НЕ БлокировкаМониторинга и НЕ Архив;

		//УФ.ТолькоПросмотр = БлокировкаМониторинга;
		//УФ.Элементы.Комментарий.ТолькоПросмотр = Ложь;
		
		// закладка бюджетов
		УФ.Элементы.СтраницаБюджет.Доступность = (ПросмотрБюджетов И ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования"));
		Если (УФ.Элементы.СтраницаБюджет.Доступность) Тогда
			
			ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеБюджетов");
			Если НЕ ПравоРедактирования Тогда
				
				УФ.Элементы.БюджетРасходы.ИзменятьСоставСтрок = Ложь;
				УФ.Элементы.БюджетРасходы.ТолькоПросмотр = Истина;
				// --- 
				УФ.Элементы.БюджетДоходы.ИзменятьСоставСтрок = Ложь;
				УФ.Элементы.БюджетДоходы.ТолькоПросмотр = Истина;
				
				УФ.Элементы.БюджетДоходы.ТолькоПросмотр = Истина;
				
			КонецЕсли; 
			
			УФ.Элементы.БюджетДоходыФорма_БюджетДоходыПересчитатьПоКурсу.Доступность  = ПравоРедактирования или НЕ Архив;
			УФ.Элементы.БюджетДоходыФорма_БюджетЗаполнитьРасходыПоДоходам.Доступность = ПравоРедактирования или НЕ Архив;
			
			УФ.Элементы.БюджетРасходыФорма_БюджетЗаполнитьДоходыПоРасходам.Доступность = ПравоРедактирования или НЕ Архив;
			УФ.Элементы.БюджетРасходыФорма_БюджетРасходыПересчитатьПоКурсу.Доступность = ПравоРедактирования или НЕ Архив;

		КонецЕсли; 
		
		// закладка финансов
		УФ.Элементы.СтраницаФинансы.Доступность = ПросмотрФинансов;
		Если (УФ.Элементы.СтраницаФинансы.Доступность) Тогда
			
			УФ.Элементы.ГруппаРасходы.Видимость = ПросмотрРасходов;
			Если (ПросмотрРасходов) Тогда
				
				ПравоРедактирования_Расходы = (CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Счета") ИЛИ CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Акты"));
				УФ.РедактированиеРасходов = ПравоРедактирования_Расходы;
				Если (НЕ ПравоРедактирования_Расходы) Тогда
					
					УФ.Элементы.ФинансыРасходы.ИзменятьСоставСтрок = Ложь;
					УФ.Элементы.ФинансыРасходы.ТолькоПросмотр = Истина;
					// --- 
					УФ.Элементы.Форма_ФинансыРасходыДобавитьПоБюджету.Доступность = НЕ Архив;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			УФ.Элементы.ГруппаДоходы.Видимость = ПросмотрДоходов;
			Если (ПросмотрДоходов) Тогда
				
				ПравоРедактирования_Доходы = (CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Счета") ИЛИ CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Акты"));
				УФ.РедактированиеДоходов = ПравоРедактирования_Доходы;
				Если (НЕ ПравоРедактирования_Доходы) Тогда
					
					УФ.Элементы.ФинансыДоходы.ИзменятьСоставСтрок = Ложь;
					УФ.Элементы.ФинансыДоходы.ТолькоПросмотр = Истина;
					// --- 
					УФ.Элементы.Форма_ФинансыДоходыДобавитьПоБюджету.Доступность = НЕ Архив;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			// фин.результат список
			УФ.Элементы.ГруппаФинансовыйРезультатСписок.Видимость = (ПросмотрРасходов И ПросмотрДоходов) И ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
			// игого и закрытие г/п
			УФ.Элементы.ГруппаПодвалФинансов.Видимость = (ПросмотрРасходов И ПросмотрДоходов);
			
		КонецЕсли;
		УФ.Элементы.СтраницаСвязи.Доступность = (УФ.Элементы.СтраницаСвязи.Видимость И CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок"));
		УФ.Элементы.СтраницаСвязи.ТолькоПросмотр = (БлокировкаМониторинга);
		
		// управление доступностью отчетов
		УФ.Элементы.Форма_ОтчетПоГрузоперевозке.Видимость = (ПросмотрРасходов И ПросмотрДоходов и ПравоАнализаЭкономики);
		УФ.Элементы.Форма_ОтчетНеперевыставленныеЗатраты.Видимость = (ПросмотрРасходов И ПросмотрДоходов);
		УФ.Элементы.Форма_ОтчетПланФакторныйАнализБюджета.Видимость = (ПросмотрРасходов И ПросмотрДоходов И ПросмотрБюджетов и ПравоАнализаЭкономики);
		УФ.Элементы.Форма_ОтчетАнализПрибыли.Видимость = (ПросмотрРасходов И ПросмотрДоходов И ПросмотрБюджетов и ПравоАнализаЭкономики);
		УФ.Элементы.ФормаОбщаяКомандаCW_ОтчетВедомостьНеперевыставленныхЗатрат.Видимость = (ПросмотрРасходов И ПросмотрДоходов);
		УФ.Элементы.ФормаФорма_ОтчетНеактированныеВходящиеСчета.Видимость = ПросмотрРасходов;
		УФ.Элементы.ФормаФорма_ОтчетНеактированныеИсходящиеСчета.Видимость = ПросмотрДоходов;
		
	// форма заказа
	ИначеЕсли (ФормаЗаказа(УФ)) Тогда
		
		ЕстьПравоРедактированиеОсновныхСвойствГрузоперевозок = CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок");
		
		Если ЕстьПравоРедактированиеОсновныхСвойствГрузоперевозок Тогда
			СтркутураРеквизитовШапки = ПолучитьСтруктуруРедактируемыхРеквизитовШапки(Ложь);
		КонецЕсли;
		
		ТолькоПросмотрШапки =  (НЕ ЕстьПравоРедактированиеОсновныхСвойствГрузоперевозок  ИЛИ БлокировкаМониторинга);
		
		Если Не ТолькоПросмотрШапки Тогда
			//По списку реквизитов
			Для Каждого ЭлементСтркутуры из СтркутураРеквизитовШапки Цикл
				УФ.Элементы[ЭлементСтркутуры.Ключ].ТолькоПросмотр = Не ЭлементСтркутуры.Значение;
			КонецЦикла;
		КонецЕсли;
		
		// реквизиты шапки
		УФ.Элементы.ГруппаШапка.ТолькоПросмотр = ТолькоПросмотрШапки;
		
		// г/п
		УФ.Элементы.Журнал.ИзменятьСоставСтрок = (CW_ПраваДоступа.ПравоДоступно("ДобавлениеГрузоперевозок") И НЕ БлокировкаМониторинга);
		
		// параметры
		УФ.Элементы.ДПГ.ИзменятьСоставСтрок = (НЕ БлокировкаМониторинга);
		УФ.Элементы.ДПГ_ПерезаполнитьПараметрыПоШаблону.Доступность = (НЕ БлокировкаМониторинга)  и НЕ Архив;
		
		УФ.Элементы.ЖурналДобавитьГрузоперевозокиСписком.Доступность 	= НЕ БлокировкаМониторинга и НЕ Архив;
		УФ.Элементы.ДПГДПГ_ДобавитьГруппу.Доступность 					= НЕ БлокировкаМониторинга и НЕ Архив;
		УФ.Элементы.ДеревоПараметровРедактировать.Доступность 			= НЕ БлокировкаМониторинга и НЕ Архив;
		
		Если (ИспользуетсяБлокировка) Тогда
			ВидимостьКнопки = ПравоЗакрытияМониторинга;
			Если (БлокировкаМониторинга) Тогда
				ВидимостьКнопки = ПравоОтменыЗакрытияМониторинга;
			КонецЕсли; 
			УФ.Элементы.ИзменитьДатуБлокировкиГрузоперевозок.Видимость = ВидимостьКнопки;
		КонецЕсли; 
		
		// закладка бюджетов
		ПросмотрБюджетов = CW_ПраваДоступа.ПравоДоступно("ПросмотрБюджетов");
		УФ.Элементы.СтраницаБюджет.Доступность = ПросмотрБюджетов И ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования");
		Если УФ.Элементы.СтраницаБюджет.Доступность Тогда
			
			ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеБюджетов");
			Если НЕ ПравоРедактирования Тогда
				
				УФ.Элементы.БюджетРасходы.ИзменятьСоставСтрок 	= Ложь;
				УФ.Элементы.БюджетРасходы.ТолькоПросмотр 		= Истина;
				// --- 
				УФ.Элементы.БюджетДоходы.ИзменятьСоставСтрок 	= Ложь;
				УФ.Элементы.БюджетДоходы.ТолькоПросмотр 		= Истина;
				
				УФ.Элементы.БюджетРасходыДерево.ИзменятьСоставСтрок = Ложь;
				УФ.Элементы.БюджетРасходыДерево.ТолькоПросмотр 		= Истина;
				// --- 
				УФ.Элементы.БюджетДоходыДерево.ИзменятьСоставСтрок 	= Ложь;
				УФ.Элементы.БюджетДоходыДерево.ТолькоПросмотр 		= Истина;
				
			КонецЕсли; 
			
			УФ.Элементы.БюджетРасходыФорма_БюджетЗаполнитьДоходыПоРасходам.Доступность 	= ПравоРедактирования или Архив;
			УФ.Элементы.БюджетРасходыФорма_БюджетРасходыПересчитатьПоКурсу.Доступность	= ПравоРедактирования или Архив;
			
			УФ.Элементы.БюджетДоходыФорма_БюджетЗаполнитьРасходыПоДоходам.Доступность 	= ПравоРедактирования или Архив;
			УФ.Элементы.БюджетДоходыФорма_БюджетДоходыПересчитатьПоКурсу.Доступность 	= ПравоРедактирования или Архив;
			
			УФ.Элементы.БюджетРасходыФорма_БюджетЗаполнитьДоходыПоРасходам.Доступность 	= ПравоРедактирования или Архив;
			УФ.Элементы.БюджетРасходыФорма_БюджетРасходыПересчитатьПоКурсу.Доступность	= ПравоРедактирования или Архив;
			
			УФ.Элементы.БюджетДоходыФорма_БюджетЗаполнитьРасходыПоДоходам.Доступность 	= ПравоРедактирования или Архив;
			УФ.Элементы.БюджетДоходыФорма_БюджетДоходыПересчитатьПоКурсу.Доступность 	= ПравоРедактирования или Архив;
			
			
			УФ.Элементы.БюджетРасходыФорма_БюджетРасходыДеревоПересчитатьПоКурсу.Доступность 	= ПравоРедактирования или Архив;
			УФ.Элементы.Форма_БюджетЗаполнитьДоходыПоРасходамДерево.Доступность 				= ПравоРедактирования или Архив;

			УФ.Элементы.БюджетДоходыДеревоФорма_БюджетЗаполнитьРасходыПоДоходамДерево.Доступность 	= ПравоРедактирования или Архив;
			УФ.Элементы.БюджетДоходыФорма_БюджетДоходыДеревоПересчитатьПоКурсу.Доступность 			= ПравоРедактирования или Архив;

		КонецЕсли;
		
		// закладка финансов
		УФ.Элементы.СтраницаФинансы.Доступность = CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов");
		УФ.ПросмотрРасходов = CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Расходы");
		УФ.ПросмотрДоходов = CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Доходы");
		Если УФ.Элементы.СтраницаФинансы.Доступность Тогда
			
			УФ.Элементы.ГруппаРасходы.Видимость = УФ.ПросмотрРасходов;
			Если (УФ.ПросмотрРасходов) Тогда
				
				ПравоРедактирования_Расходы = (CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Счета") ИЛИ CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Акты"));
				УФ.РедактированиеРасходов = ПравоРедактирования_Расходы;
				Если (НЕ ПравоРедактирования_Расходы) Тогда
					
					УФ.Элементы.ФинансыРасходы.ИзменятьСоставСтрок = Ложь;
					УФ.Элементы.ФинансыРасходы.ТолькоПросмотр = Истина;
					// --- 
					УФ.Элементы.Форма_ФинансыРасходыДобавитьПоБюджету.Доступность = Ложь;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			// --- 
			
			УФ.Элементы.ГруппаДоходы.Видимость = УФ.ПросмотрДоходов;
			Если (УФ.ПросмотрДоходов) Тогда
				
				ПравоРедактирования_Доходы = (CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Счета") ИЛИ CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Акты"));
				УФ.РедактированиеДоходов = ПравоРедактирования_Доходы;
				Если (НЕ ПравоРедактирования_Доходы) Тогда
					
					УФ.Элементы.ФинансыДоходы.ИзменятьСоставСтрок = Ложь;
					УФ.Элементы.ФинансыДоходы.ТолькоПросмотр = Истина;
					// --- 
					УФ.Элементы.Форма_ФинансыДоходыДобавитьПоБюджету.Доступность = Ложь;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			// --- 
			
			// фин.результат список
			УФ.Элементы.ГруппаФинансовыйРезультатСписок.Видимость = (УФ.ПросмотрРасходов И УФ.ПросмотрДоходов) И ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
			// игого и закрытие г/п
			УФ.Элементы.ГруппаПодвалФинансов.Видимость = (УФ.ПросмотрРасходов И УФ.ПросмотрДоходов);
			
			// --- 
			
		КонецЕсли;
		
		// управление доступностью отчетов
		УФ.Элементы.Форма_ОтчетПоГрузоперевозке.Видимость = (ПросмотрРасходов И ПросмотрДоходов и ПравоАнализаЭкономики);
		УФ.Элементы.Форма_ОтчетНеперевыставленныеЗатраты.Видимость = (ПросмотрРасходов И ПросмотрДоходов);
		УФ.Элементы.Форма_ОтчетПланФакторныйАнализБюджета.Видимость = (ПросмотрРасходов И ПросмотрДоходов И ПросмотрБюджетов и ПравоАнализаЭкономики);
		УФ.Элементы.Форма_ОтчетАнализПрибыли.Видимость = (ПросмотрРасходов И ПросмотрДоходов И ПросмотрБюджетов и ПравоАнализаЭкономики);
		УФ.Элементы.ФормаОбщаяКомандаCW_ОтчетВедомостьНеперевыставленныхЗатрат.Видимость = (ПросмотрРасходов И ПросмотрДоходов);
		УФ.Элементы.ФормаФорма_ОтчетНеактированныеВходящиеСчета.Видимость = ПросмотрРасходов;
		УФ.Элементы.ФормаФорма_ОтчетНеактированныеИсходящиеСчета.Видимость = ПросмотрДоходов;
	
	КонецЕсли; // анализ формы "Грузоперевозка" или "Заказ" 
	
КонецФункции
 
&НаСервере
Функция УправлениеЭлементамиФормы(УФ)
	// --- 
	
	Если (ФормаГрузоперевозки(УФ)) Тогда
		
		УФ.Элементы.Примечание.Видимость = (ЗначениеЗаполнено(УФ.Объект.Примечание));
		УФ.Элементы.ДеревоПараметровОтображениеКомментария.Пометка = УФ.Элементы.Примечание.Видимость;
		// --- 
		
		Этоновый = УФ.Объект.Ссылка.Пустая();
		УФ.Элементы.СтраницаФинансы.Видимость = (НЕ Этоновый И УФ.Элементы.СтраницаФинансы.Доступность);
		УФ.Элементы.СтраницаСвязи.Видимость = (НЕ Этоновый И УФ.Элементы.СтраницаСвязи.Доступность);
		Если (УФ.Элементы.СтраницаФинансы.Видимость) Тогда
			УФ.Элементы.ГруппаЗакрытиеФинансов.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокировкиФинансов");
		КонецЕсли; 
		УФ.Элементы.СтраницаБюджет.Видимость = (НЕ Этоновый И УФ.Элементы.СтраницаБюджет.Доступность);
		// --- 
		УФ.Элементы.ФормаГруппаОтчеты.Видимость = (НЕ Этоновый);
		// --- 
		//УФ.Элементы.ФормаОбщаяКомандаCW_Печать.Видимость = (НЕ Этоновый);
		// --- 
		Если (НЕ Этоновый) Тогда
			
			ОбновитьДатуЗакрытия(УФ);
			// --- 
			УФ.ВыявлениеРезультата.Параметры.УстановитьЗначениеПараметра("Аналитика",УФ.Объект.Ссылка);
			_УФС.ДобавитьОтбор(УФ.ВыявлениеРезультата.Отбор,"Аналитика",,УФ.Объект.Ссылка);
			
		//	УФ.Элементы.ГруппаФинансовыйРезультатСписок.Видимость = (УФ.Объект.Заказ.Пустая());
			
		КонецЕсли; 
		
		Если (УФ.Элементы.СтраницаФинансы.Видимость) Тогда
			
			УФ.Элементы.Форма_ФинансыРасходыОтобразитьСтатьи.Пометка 	= УФ.ФинансыРасходыОтображатьПостатейно;
			УФ.Элементы.Форма_ФинансыДоходыОтобразитьСтатьи.Пометка 	= УФ.ФинансыДоходыОтображатьПостатейно;
			УФ.Элементы.Форма_ФинансыТранспортОтобразитьСтатьи.Пометка	= УФ.ФинансыТранспортОтображатьПостатейно;
			
		КонецЕсли; 
		
		Если (УФ.Объект.ТипПеревозки.ВидПеревозки=Перечисления.CW_ВидыПеревозок.Контейнер) Тогда
			
			УФ.Элементы.Типоразмер.Видимость=Истина;
			УФ.Элементы.Представление.Заголовок="Контейнер";
			
		ИначеЕсли (УФ.Объект.ТипПеревозки.ВидПеревозки=Перечисления.CW_ВидыПеревозок.Прочее) Тогда 
			
			УФ.Элементы.Типоразмер.Видимость=Ложь;
			УФ.Элементы.Представление.Заголовок="Представление";
			
		Иначе
			
			УФ.Элементы.Типоразмер.Видимость=Ложь;
			УФ.Элементы.Представление.Заголовок="Представление";
			
		КонецЕсли; 
		
		Если (УФ.Элементы.СтраницаБюджет.Доступность) Тогда
			
			УФ.Элементы.Форма_БюджетКонтрагенты.Видимость = (Константы.CW_ОграничиватьВыборКонтрагентовПоБюджету.Получить() 
			И CW_ПраваДоступа.ПравоДоступно("НоминированиеКонтрагентовПоБюджету")
			И УФ.Объект.Заказ.Пустая());
			Если УФ.Элементы.Форма_БюджетКонтрагенты.Видимость Тогда
				
				УФ.Элементы.Форма_БюджетКонтрагенты.Заголовок = "Контрагенты"+?(УФ.Объект.КонтрагентыПоБюджету.Количество()=0,""," ("+Строка(УФ.Объект.КонтрагентыПоБюджету.Количество())+")");
				
			КонецЕсли;
			
		КонецЕсли;
		
		//ОборудованиеПривязано = (ЗначениеЗаполнено(УФ.Объект.ОтслеживаемоеОборудование));
		//Если Не УФ.Элементы.Представление.ТолькоПросмотр Тогда
		//	УФ.Элементы.Представление.ТолькоПросмотр = ОборудованиеПривязано;
		//КонецЕсли;
		//Если НЕ	УФ.Элементы.Типоразмер.ТолькоПросмотр Тогда
		//	УФ.Элементы.Типоразмер.ТолькоПросмотр = ОборудованиеПривязано;
		//КонецЕсли;
		
		// отметка комментарий
		Если СокрЛП(УФ.Объект.Комментарий) = "" Тогда
			
			УФ.Элементы.СтраницаКомментарий.Заголовок = "Комментарий";
			
		Иначе
			
			УФ.Элементы.СтраницаКомментарий.Заголовок = "Комментарий (*)";
			
		КонецЕсли; 
		
	ИначеЕсли (ФормаЗаказа(УФ)) Тогда 
		
		Этоновый = УФ.Объект.Ссылка.Пустая();
		
		УФ.Элементы.Примечание.Видимость = (ЗначениеЗаполнено(УФ.Объект.Примечание));

		УФ.Элементы.СтраницаФинансы.Видимость = НЕ Этоновый И УФ.Элементы.СтраницаФинансы.Доступность;
		Если (УФ.Элементы.СтраницаФинансы.Видимость) Тогда
			УФ.Элементы.ГруппаЗакрытиеФинансов.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокировкиФинансов");
		КонецЕсли;
		УФ.Элементы.СтраницаЖурналГрузоперевозок.Видимость = НЕ Этоновый;
		УФ.Элементы.СтраницаБюджет.Видимость = НЕ Этоновый И УФ.Элементы.СтраницаБюджет.Доступность;
		///УФ.Элементы.ФормаОбщаяКомандаCW_Печать.Видимость = НЕ Этоновый;
		УФ.Элементы.ФормаГруппаОтчеты.Видимость = НЕ Этоновый;
		// --- 
		Если НЕ Этоновый Тогда
			
			ОбновитьДатуЗакрытия(УФ);
			
		КонецЕсли; 
		
		Если УФ.Элементы.СтраницаФинансы.Видимость Тогда
			
			УФ.Элементы.РасходыНоменклатура.Видимость 					= УФ.ФинансыРасходыОтображатьПостатейно;
			УФ.Элементы.ДоходыНоменклатура.Видимость 					= УФ.ФинансыДоходыОтображатьПостатейно;
			УФ.Элементы.Форма_ФинансыТранспортОтобразитьСтатьи.Пометка	= УФ.ФинансыТранспортОтображатьПостатейно;
		
		КонецЕсли; 
		
		// --- 	
		
		Если УФ.Элементы.СтраницаБюджет.Доступность Тогда
			
			УФ.Элементы.Форма_БюджетКонтрагенты.Видимость = (Константы.CW_ОграничиватьВыборКонтрагентовПоБюджету.Получить() И CW_ПраваДоступа.ПравоДоступно("НоминированиеКонтрагентовПоБюджету"));
			Если УФ.Элементы.Форма_БюджетКонтрагенты.Видимость Тогда
				
				УФ.Элементы.Форма_БюджетКонтрагенты.Заголовок = "Контрагенты"+?(УФ.Объект.КонтрагентыПоБюджету.Количество()=0,""," ("+Строка(УФ.Объект.КонтрагентыПоБюджету.Количество())+")");
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		// --- 
		
		Если СокрЛП(УФ.Объект.Комментарий) = "" Тогда
			
			УФ.Элементы.СтраницаКомментарий.Заголовок = "Комментарий";
			
		Иначе
			
			УФ.Элементы.СтраницаКомментарий.Заголовок = "Комментарий *";
			
		КонецЕсли;
		
		// ---   
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция ОбновитьДатуЗакрытия(УФ)
	// --- 
	БлокироватьОбъекты 	= CW_АрхивОбъектовСервер.БлокироватьОбъектыПриПереводеВАрхив(); 
	Архив	= УФ.Объект.Архив и БлокироватьОбъекты;
	
	УФ.ДатаЗакрытия = CW_Мониторинг.ПолучитьДатуЗакрытия(УФ.Объект.Ссылка);
	Если УФ.ДатаЗакрытия = Дата(1,1,1) Тогда
		
		Текст = "Дата блокировки:  <Нет>";
		УФ.Элементы.ВыявлениеРезультата.ТолькоПросмотр = Ложь;
		
	Иначе
		
		Текст = "Дата блокировки:  "+Формат(УФ.ДатаЗакрытия,"ДФ=dd.MM.yyyy");
		УФ.Элементы.ВыявлениеРезультата.ТолькоПросмотр = Истина;
		
	КонецЕсли; 
	УФ.Элементы.НадписьЗакрытие.Заголовок = Текст;
	
	// определяем видимость кнопки редактирования закрытия
	Если (ФормаГрузоперевозки(УФ)) Тогда
		ВидимостьЗакрытия = CW_ПраваДоступа.ПравоДоступно("ЗакрытиеГрузоперевозок") И УФ.Объект.Заказ.Пустая();
	Иначе
		ВидимостьЗакрытия = CW_ПраваДоступа.ПравоДоступно("ЗакрытиеГрузоперевозок");
	КонецЕсли; 
	
	Если ВидимостьЗакрытия Тогда
		Если (НЕ CW_ПраваДоступа.ПравоДоступно("ОтменаЗакрытияГрузоперевозок")) И УФ.ДатаЗакрытия <> Дата(1,1,1) Тогда
			ВидимостьЗакрытия = Ложь;
		КонецЕсли;
	КонецЕсли; 
	УФ.Элементы.Форма_ИзменитьДатуЗакрытия.Видимость = ВидимостьЗакрытия;
	
	// блокируем создание документов
	ДатаЗакрытияУстановлена = (УФ.ДатаЗакрытия <> Дата(1,1,1));
	// --- 
	Если (УФ.РедактированиеРасходов) Тогда
		УФ.Элементы.ФинансыРасходы.ТолькоПросмотр = (ДатаЗакрытияУстановлена);
		УФ.Элементы.ФинансыРасходы.ИзменятьСоставСтрок = (НЕ ДатаЗакрытияУстановлена);
		УФ.Элементы.Форма_ФинансыРасходыДобавитьПоБюджету.Доступность = (НЕ ДатаЗакрытияУстановлена) и Не Архив;;	
	КонецЕсли; 
	// --- 
	Если (УФ.РедактированиеДоходов) Тогда
		УФ.Элементы.ФинансыДоходы.ТолькоПросмотр = (ДатаЗакрытияУстановлена);
		УФ.Элементы.ФинансыДоходы.ИзменятьСоставСтрок = (НЕ ДатаЗакрытияУстановлена);
		УФ.Элементы.Форма_ФинансыДоходыДобавитьПоБюджету.Доступность = (НЕ ДатаЗакрытияУстановлена) и Не Архив;
	КонецЕсли; 
	
	Если (ФормаЗаказа(УФ)) Тогда
		Если (УФ.ГрузоперевозкиИнициализированы) Тогда
			Возврат(_УФКС.СД("Журналы","сервер","/Обновить"));
		Иначе
			Возврат(Неопределено);
		КонецЕсли; 
	ИначеЕсли (ФормаГрузоперевозки(УФ)) Тогда 
		Возврат(_УФКС.СД("Грузоперевозки","клиент","/ФормаЗаписать"));
	Иначе
		Возврат(Неопределено);
	КонецЕсли; 
	
	// --- 
КонецФункции
 
&НаСервере
Функция ЗаполнитьПараметрыИзТипаПеревозки(УФ,Перезаполнить=Ложь)
	// --- 
	
	Если (Перезаполнить) Тогда
		
		УФ.Объект.ПараметрыГрузоперевозки.Загрузить(УФ.Объект.ТипПеревозки.ПараметрыГрузоперевозки.Выгрузить());
		
	Иначе
		
		// интеллектуальный алгоритм - добавляем только новые параметры
		Для каждого СтрокаПараметра Из УФ.Объект.ТипПеревозки.ПараметрыГрузоперевозки Цикл
			
			Параметр = СтрокаПараметра.Параметр;
			// --- 
			СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(УФ.Объект,Параметр);
			Если (СтрокаПараметра = Неопределено) Тогда
				
				Нстр = УФ.Объект.ПараметрыГрузоперевозки.Добавить();
				Нстр.Параметр = Параметр;
				Нстр.Значение = Параметр.ТипЗначения.ПривестиЗначение(Неопределено); 
	
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция ЗаполнитьПредопределенныеПараметры(УФ)
	// --- 
	
	Если (УФ.Объект.Ссылка.Пустая()) Тогда
		
		МассивПроверяемыхРеквизитов = _сф.м_СоздатьИзСтроки("Клиент,Маршрут,ТипПеревозки,Груз,Типоразмер");
		Для каждого Реквизит Из МассивПроверяемыхРеквизитов Цикл
			Если (ЗначениеЗаполнено(УФ.Объект[Реквизит])) Тогда
				ПП = CW_Мониторинг.ПолучитьПредопределенныеПараметры(УФ.Объект[Реквизит],Реквизит);
				Если (_УФКС.ВыполненоУспешно(ПП)) Тогда
					CW_Мониторинг.ДобавитьПредопределенныеПараметры(УФ.Объект,ПП.Параметры);
				КонецЕсли; 
			КонецЕсли; 	
		КонецЦикла;
		
	КонецЕсли; 	
	
	// --- 
КонецФункции

&НаСервере
Функция ПроверитьНомерКонтейнера(УФ)
	// --- 
	
	Если УФ.Объект.ТипПеревозки.ВидПеревозки=Перечисления.CW_ВидыПеревозок.Контейнер И УФ.ПроверятьНомерКонтейнера Тогда
		
		УФ.ОшибкаНомераКонтейнера = (НЕ CW_Мониторинг.НомерКонтейнераКорректный(УФ.Объект.CW_Представление));
		
	Иначе
		
		УФ.ОшибкаНомераКонтейнера=Ложь;		
		
	КонецЕсли;
	
	// --- 
КонецФункции

&НаСервере
Функция УдалитьНетиповыеПараметры(УФ)
	// --- 
	
	// удаляем только те, на которые есть права редактирования (!!!)
	// добавляем все
	НаборПрав = УФ.ПраваНаПараметры[0].Значение;
	// --- 
	
	ПараметрыТипа = УФ.Объект.ТипПеревозки.ПараметрыГрузоперевозки;
	МассивПараметровДляУдаления = Новый Массив;
	Для каждого Стр Из УФ.Объект.ПараметрыГрузоперевозки Цикл
		
		Если _сф.к_НайтиСтроку(ПараметрыТипа,"Параметр",Стр.Параметр) = Неопределено Тогда
			
			СтруктураПрав = НаборПрав["п_"+_сф.КлючПоСсылке(Стр.Параметр)];
			
			Если СтруктураПрав.Редактирование Тогда
				
				МассивПараметровДляУдаления.Добавить(Стр);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	_сф.к_УдалитьЭлементыПоМассиву(УФ.Объект.ПараметрыГрузоперевозки,МассивПараметровДляУдаления);
	
	// теперь добавляем те параметры, которых не хватает
	Для каждого Стр Из ПараметрыТипа Цикл
		
		Если _сф.к_НайтиСтроку(УФ.Объект.ПараметрыГрузоперевозки,"Параметр",Стр.Параметр) = Неопределено Тогда
			
			Нстр = УФ.Объект.ПараметрыГрузоперевозки.Добавить();
			Нстр.Параметр = Стр.Параметр;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ДеревоПараметровОбновить(УФ);
	
	Возврат(_УФКС.СД("Грузоперевозки","клиент","/ДеревоПараметровРазвернутьВсе"));
	
	// --- 
КонецФункции

&НаСервере
Функция ДеревоПараметровОбновить(УФ)
	// --- 
	
	Элементы=УФ.Элементы;
	Объект = УФ.Объект;
	// --- 
	
	СоответствиеСвойствПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
	
	// сохраняем
	УФ.ТребуетсяВосстановитьСостояниеСвертки=Истина;
	Если (Элементы.ДеревоПараметров.ТекущаяСтрока) <> Неопределено Тогда
		
		СтрокаДерева = УФ.ДеревоПараметров.НайтиПоИдентификатору(Элементы.ДеревоПараметров.ТекущаяСтрока);
		
		Если СтрокаДерева.ИндексКартинки = 0 Тогда
			
			ТекущаяГруппа = СтрокаДерева.Параметр;
			ТекущийПараметр = Неопределено;
			
		Иначе
			
			ТекущаяГруппа = СтрокаДерева.Параметр.Родитель;
			ТекущийПараметр = СтрокаДерева.Параметр;	 
			
		КонецЕсли; 
		
	Иначе
		
		ТекущаяГруппа = Неопределено;
		ТекущийПараметр = Неопределено;
		
	КонецЕсли; 
	
	// очищаем дерево
	УФ.ДеревоПараметров.ПолучитьЭлементы().Очистить();
	
	// получаем права на параметры
	УФ.ПраваНаПараметры.Очистить();
	УФ.ПраваНаПараметры.Добавить(CW_ПраваДоступа.НаборПравДляПараметров());
	НаборПрав = УФ.ПраваНаПараметры[0].Значение;
	// --- 
	
	ТЗ = _сф.т_Создать("Параметр,Значение,Родитель,ЗначениеПлан,ЗначениеФакт,Примечание");
	МассивДинамическихПараметров = Новый Массив;
	СоответствиеСвойствПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
	Для каждого Стр Из Объект.ПараметрыГрузоперевозки Цикл
		СП = СоответствиеСвойствПараметров.Получить(Стр.Параметр);
		Если (СП.ДинамическийПараметр) Тогда
			УФ.ЕстьДинамическиеПараметры = Истина;
			МассивДинамическихПараметров.Добавить(Стр.Параметр);
		КонецЕсли; 
	КонецЦикла; 
	Если (УФ.ЕстьДинамическиеПараметры) Тогда
		
		// пересчитываем и показываем
		ТаблицаДП = CW_Мониторинг.ДинамическиеПараметрыОбъекта(УФ.Объект,СоответствиеСвойствПараметров,МассивДинамическихПараметров,Объект.ПараметрыГрузоперевозки.Выгрузить());
		
	КонецЕсли; 
	// --- 
	Для каждого Стр Из Объект.ПараметрыГрузоперевозки Цикл
		
		СП = СоответствиеСвойствПараметров.Получить(Стр.Параметр);
		Если (СП.ДинамическийПараметр) Тогда
			
			// берем значения из таблицы динамических параметров
			Отбор = Новый Структура("Параметр",Стр.Параметр);
			СтрокаПараметра = _сф.к_НайтиСтроку(ТаблицаДП, Отбор);
			Если (СтрокаПараметра <> Неопределено) Тогда
				Стр.Значение = СтрокаПараметра.Значение;
			КонецЕсли; 
			
		КонецЕсли; 
		
		// проверяем на право просмотра
		СтруктураПрав = НаборПрав["п_"+_сф.КлючПоСсылке(Стр.Параметр)];
		Если (СтруктураПрав.Просмотр) Тогда
			
			Нстр = ТЗ.Добавить();
			Нстр.Параметр = Стр.Параметр;
			Нстр.Значение = Стр.Значение;
			Нстр.Примечание = Стр.Примечание;
			Нстр.ЗначениеПлан = Стр.ЗначениеПлан;
			Нстр.ЗначениеФакт = Стр.ЗначениеФакт;
			Нстр.Родитель = СП.Родитель;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
	Родители = ТЗ.Скопировать(,"Родитель");
	МассивРодителей = Новый Массив;
	Для каждого Стр Из ТЗ Цикл
		
		_сф.м_ДобавитьУникально(МассивРодителей,Стр.Родитель);
		
	КонецЦикла; 
	
	// --- 
	Родители.Свернуть("Родитель");
	Родители.ЗагрузитьКолонку(МассивРодителей,"Родитель");
	
	ТДата = ТекущаяДата();
	
	// формируем дерево
	Для каждого Стр Из Родители Цикл
		
		Нстр = УФ.ДеревоПараметров.ПолучитьЭлементы().Добавить();
		Нстр.Параметр_Представление = ?(Строка(Стр.Родитель)="","<без группы>",Строка(Стр.Родитель));
		Нстр.Параметр = Стр.Родитель;
		Нстр.ЭтоГруппа = Истина;
		Нстр.ИндексКартинки=0;
		
		// выбираем параметры по родителю
		КоличествоПараметров = 0;
		ТЗП = ТЗ.Скопировать(Новый Структура("Родитель",Стр.Родитель));
		Для каждого СтрокаПараметра Из ТЗП Цикл
			
			Если ЗначениеЗаполнено(СтрокаПараметра.Параметр)  Тогда
				
				пстр = нстр.ПолучитьЭлементы().Добавить();
				ДеревоПараметровОбновитьСтрокуДереваПоСтрокеПараметра(УФ,СоответствиеСвойствПараметров,пстр,СтрокаПараметра);
				_сф.Инкремент(КоличествоПараметров);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		ДеревоПараметровОбновитьПредставлениеГруппы(УФ,Нстр);
		//Если (УФ.ПоказыватьКоличествоПараметров) Тогда
		//	Нстр.Параметр_Представление = ?(Строка(Стр.Родитель)="","<без группы>",Строка(Стр.Родитель))+" ("+Строка(КоличествоПараметров)+")";
		//Иначе
		//	Нстр.Параметр_Представление = ?(Строка(Стр.Родитель)="","<без группы>",Строка(Стр.Родитель));
		//КонецЕсли; 
		
	КонецЦикла;
	
	// пробуем восстановить текущую строку
	Если (ТекущаяГруппа <> Неопределено) Тогда
		
		Для каждого Стр Из УФ.ДеревоПараметров.ПолучитьЭлементы() Цикл
			
			Если Стр.Параметр = ТекущаяГруппа Тогда
				
				Если (ТекущийПараметр <> Неопределено) Тогда
					
					// пробуем найти в дочерних
					Для каждого СтрП Из Стр.ПолучитьЭлементы() Цикл
						
						Если (СтрП.Параметр = ТекущийПараметр) Тогда
							
							Элементы.ДеревоПараметров.ТекущаяСтрока = СтрП.ПолучитьИдентификатор();
							Возврат(Неопределено);
							
						КонецЕсли; 
						
					КонецЦикла; 
					
				Иначе
					
					Элементы.ДеревоПараметров.ТекущаяСтрока = Стр.ПолучитьИдентификатор();
					Возврат(Неопределено);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция ДеревоПараметровОбновитьПараметр(УФ,Параметры)
	// --- 
	
	СтруктураПараметра = _сф.ст_ПолучитьСвойство(Параметры,"СтруктураПараметра");
	СписокВедомых = _сф.ст_ПолучитьСвойство(Параметры,"СписокВедомых");
	
	Элементы=УФ.Элементы;
	Объект = УФ.Объект;
	// --- 
	
	СоответствиеСвойствПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
	
	// пробуем найти 
	ЭтоНовый = Ложь;
	СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,_сф.ст_Отбор("Параметр",СтруктураПараметра.Параметр));
	Если СтрокаПараметра = Неопределено Тогда
		ЭтоНовый=Истина;
		СтрокаПараметра = Объект.ПараметрыГрузоперевозки.Добавить();
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(СтрокаПараметра,СтруктураПараметра);
	СП = СоответствиеСвойствПараметров.Получить(СтрокаПараметра.Параметр);
	Если СП.ЭтоКонтрольнаяДата Тогда
		СтрокаПараметра.Значение = ?(СтрокаПараметра.ЗначениеФакт <> Дата(1,1,1),СтрокаПараметра.ЗначениеФакт,СтрокаПараметра.ЗначениеПлан);
	КонецЕсли; 
	
	// отражаем изменения/ добавляем в дерево
	Если НЕ ЭтоНовый Тогда
		
		Для каждого СтрокаГруппы Из УФ.ДеревоПараметров.ПолучитьЭлементы() Цикл
			
			Если СтрокаГруппы.Параметр = СтрокаПараметра.Параметр.Родитель Тогда
				
				Для каждого СтрокаЭлемента Из СтрокаГруппы.ПолучитьЭлементы() Цикл
					
					Если СтрокаЭлемента.Параметр = СтрокаПараметра.Параметр Тогда
						
						ДеревоПараметровОбновитьСтрокуДереваПоСтрокеПараметра(УФ,СоответствиеСвойствПараметров,СтрокаЭлемента,СтрокаПараметра);
						// пересчитываем динамические параметры
						ПересчитатьДинамическиеПараметры(УФ,СтрокаПараметра.Параметр);
						Продолжить;
						
					КонецЕсли; 
					
				КонецЦикла; 
				Продолжить;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	Иначе
		
		// необходимо добавить группу/параметр
		// проверяем наличие группы
		СтрокаГруппыПараметра = Неопределено;
		Для каждого СтрокаГруппы Из УФ.ДеревоПараметров.ПолучитьЭлементы() Цикл
			
			Если СтрокаГруппы.Параметр = СтрокаПараметра.Параметр.Родитель Тогда
				
				СтрокаГруппыПараметра = СтрокаГруппы;
				Продолжить;
				
			КонецЕсли;
			
		КонецЦикла; 
		Если СтрокаГруппыПараметра = Неопределено Тогда
			
			// добавляем
			// определяем, куда добавлять
			Родители = Объект.ПараметрыГрузоперевозки.Выгрузить(,"Параметр");
			Родители.Колонки.Добавить("Родитель");
			Родители.Колонки.Добавить("Код");
			Для каждого Стр Из Родители Цикл
				
				Стр.Родитель = Стр.Параметр.Родитель;
				Стр.Код = Стр.Родитель.Код;
				
			КонецЦикла; 
			Родители.Свернуть("Родитель,Код");
			Родители.Сортировать("Код Возр");
			// --- 
			Родитель = СП.Родитель;
			Отбор = _сф.ст_Отбор("Родитель",Родитель);
			СтрокаТекущейГруппы = _сф.к_ПервыйЭлемент(Родители.НайтиСтроки(Отбор));
			ИндексГруппы = Родители.Индекс(СтрокаТекущейГруппы);
			// --- 
			СтрокаГруппыПараметра = УФ.ДеревоПараметров.ПолучитьЭлементы().Вставить(ИндексГруппы);
			
			СтрокаГруппыПараметра.Параметр_Представление = ?(Строка(Родитель)="","<без группы>",Строка(Родитель));
			СтрокаГруппыПараметра.Параметр = Родитель;
			СтрокаГруппыПараметра.ЭтоГруппа = Истина;
			СтрокаГруппыПараметра.ИндексКартинки=0;
			
		КонецЕсли; 
		
		// теперь добавляем к строке родителя строку параметра
		СтрокаДерева = СтрокаГруппыПараметра.ПолучитьЭлементы().Добавить();		
		ДеревоПараметровОбновитьСтрокуДереваПоСтрокеПараметра(УФ,СоответствиеСвойствПараметров,СтрокаДерева,СтрокаПараметра);
		Элементы.ДеревоПараметров.ТекущаяСтрока = СтрокаДерева.ПолучитьИдентификатор();
		// пересчитываем динамические параметры
		ПересчитатьДинамическиеПараметры(УФ,СтрокаПараметра.Параметр);
		
		//Если (УФ.ПоказыватьКоличествоПараметров) Тогда
			
		ДеревоПараметровОбновитьПредставлениеГруппы(УФ,СтрокаГруппыПараметра);
			
		//КонецЕсли;
		
	КонецЕсли; 
	
	Если (СписокВедомых <> Неопределено И СтруктураПараметра.ПараметрИзменен) Тогда
		
		Для каждого ВП Из СписокВедомых Цикл
			
			СтрокаПараметра = _сф.к_НайтиСтроку(Объект.ПараметрыГрузоперевозки,"Параметр",ВП.Значение);
			Если СтрокаПараметра <> Неопределено Тогда
				
				СтрокаПараметра.Значение = Неопределено;
				СтрокаПараметра.Примечание = "";
				
				// теперь находим в дереве и обновляем
				СтрокаЭлемента = НайтиПараметрВДереве(УФ,СтрокаПараметра.Параметр);
				ДеревоПараметровОбновитьСтрокуДереваПоСтрокеПараметра(УФ,СоответствиеСвойствПараметров,СтрокаЭлемента,СтрокаПараметра);
				// пересчитываем динамические параметры
				ПересчитатьДинамическиеПараметры(УФ,СтрокаПараметра.Параметр);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Процедура ДеревоПараметровОбновитьСтрокуДереваПоСтрокеПараметра(УФ,СоответствиеСвойствПараметров,СтрокаДерева,СтрокаПараметра)
	
	ТДата = ТекущаяДата();
	СП = СоответствиеСвойствПараметров.Получить(СтрокаПараметра.Параметр);
	// --- 
	ЭтоКонтрольнаяДата = СП.ЭтоКонтрольнаяДата;
	ДинамическийПараметр = СП.ДинамическийПараметр;
	ТипПеревозки = УФ.Объект.ТипПеревозки;
	
	// --- 
	СтрокаДерева.Параметр = СтрокаПараметра.Параметр;
	СтрокаДерева.Параметр_Представление = СП.Наименование;
	СтрокаДерева.Значение = СтрокаПараметра.Значение;
	СтрокаДерева.Примечание = СтрокаПараметра.Примечание;
	// --- 
	
	// контроль заполнения
	СтрокаКонтроляЗаполненияПараметра = ТипПеревозки.ПараметрыГрузоперевозки.Найти(СтрокаПараметра.Параметр,"Параметр");
	Если (СтрокаКонтроляЗаполненияПараметра <> Неопределено) Тогда
		
		СтрокаДерева.КонтрольЗаполнения = СтрокаКонтроляЗаполненияПараметра.КонтрольЗаполнения;
		
	КонецЕсли; 
	ТекущееЗначениеКонтроляЗаполнения = СтрокаДерева.ЗначениеНезаполнено;
	Если (ЭтоКонтрольнаяДата) Тогда
		
		СтрокаДерева.ЗначениеНезаполнено = (СтрокаДерева.КонтрольЗаполнения И НЕ ЗначениеЗаполнено(СтрокаПараметра.ЗначениеФакт));
		
	Иначе
		
		СтрокаДерева.ЗначениеНезаполнено = (СтрокаДерева.КонтрольЗаполнения И НЕ ЗначениеЗаполнено(СтрокаПараметра.Значение));
		
	КонецЕсли; 
	Если (ТекущееЗначениеКонтроляЗаполнения <> СтрокаДерева.ЗначениеНезаполнено) Тогда
		
		ЗначениеНеЗаполнено = Ложь;
		// требуется проверить отметку контроля заполнения у родителя
		СтрокаРодителя = СтрокаДерева.ПолучитьРодителя();
		Для каждого Стр Из СтрокаРодителя.ПолучитьЭлементы() Цикл
			
			Если (Стр.КонтрольЗаполнения И Стр.ЗначениеНезаполнено) Тогда
				
				ЗначениеНеЗаполнено = Истина;
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		СтрокаРодителя.ЗначениеНезаполнено = ЗначениеНеЗаполнено;
		
	КонецЕсли; 
	
	// формат вывода 
	ТипЗначенияПараметра = СП.ТипЗначения;
	ТипПараметра = СП.ТипЗначения.Типы()[0];
	// --- 
	Если (ЭтоКонтрольнаяДата) Тогда
		
		Если СП.ФорматВывода <> "" Тогда
			СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,СП.ФорматВывода);
		Иначе
			
			Если (НЕ СП.КонтрольнаяДатаИспользуетВремя) Тогда
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,"ДФ=dd.MM.yyyy");
			Иначе
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,"ДФ='dd.MM.yyyy HH:mm'");
			КонецЕсли; 
			
		КонецЕсли; 
		
	Иначе
		
		Если (ТипПараметра = Тип("Булево") ИЛИ ТипПараметра = Тип("Дата") ИЛИ ТипПараметра=Тип("Число")) Тогда
			
			Если (СП.ФорматВывода <> "") Тогда
				
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,СП.ФорматВывода);
				
			Иначе
				
				СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение);
				
				Если ТипПараметра = Тип("Дата") Тогда
					
					ФорматВывода = "";
					ЧастьДаты = ТипЗначенияПараметра.КвалификаторыДаты.ЧастиДаты;
					Если ЧастьДаты = ЧастиДаты.Дата Тогда
						
						// формат дат по умолчанию
						ФорматВывода = "ДФ=dd.MM.yyyy";
						
					ИначеЕсли ЧастьДаты = ЧастиДаты.Время Тогда 
						
						// формат дат по умолчанию
						ФорматВывода = "ДФ=HH:mm:ss";
						
					ИначеЕсли ЧастьДаты = ЧастиДаты.ДатаВремя Тогда 
						
						// формат дат по умолчанию
						ФорматВывода = "ДЛФ=";
						
					КонецЕсли;
					
					СтрокаДерева.Значение_Представление = Формат(СтрокаДерева.Значение,ФорматВывода);
					
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе
			
			СтрокаДерева.Значение_Представление = Строка(СтрокаДерева.Значение);
			
		КонецЕсли; 					
		
	КонецЕсли; 
	
	// статус план/факт
	Если (ЭтоКонтрольнаяДата) Тогда
		
		Если СтрокаПараметра.ЗначениеФакт <> Дата(1,1,1) Тогда
			
			СтрокаДерева.ПланФакт=Истина;
			СтрокаДерева.ПланПросрочен=Ложь;
			
		Иначе
			
			СтрокаДерева.ПланФакт=Ложь;
			
			Если (СтрокаПараметра.ЗначениеПлан <> Дата(1,1,1)) И (СтрокаПараметра.ЗначениеПлан - НачалоДня(ТДата) <= СП.ЛимитПросрочкиКонтрольнойДаты * 60*60*24) Тогда
				СтрокаДерева.ПланПросрочен=Истина;
			Иначе	
				СтрокаДерева.ПланПросрочен=Ложь;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// картинка
	Если (ЭтоКонтрольнаяДата) Тогда
		СтрокаДерева.ИндексКартинки = 2;
	ИначеЕсли (ДинамическийПараметр) Тогда
		СтрокаДерева.ИндексКартинки = 3;
	Иначе
		СтрокаДерева.ИндексКартинки = 1;
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаСервере
Функция ПересчитатьДинамическиеПараметры(УФ,ИзменившийсяПараметр=Неопределено)
	// --- 
	
	Если (УФ.ЕстьДинамическиеПараметры) Тогда
		
		// пересчитываем и показываем
		СоответствиеСвойствПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
		ТаблицаДП = CW_Мониторинг.ДинамическиеПараметрыОбъекта(УФ.Объект,СоответствиеСвойствПараметров,,УФ.Объект.ПараметрыГрузоперевозки.Выгрузить());
		Для каждого Стр Из ТаблицаДП Цикл
			
			// в ТЧ
			Отбор = Новый Структура("Параметр",Стр.Параметр);
			СтрокаПараметра = _сф.к_НайтиСтроку(УФ.Объект.ПараметрыГрузоперевозки,Отбор);
			Если (СтрокаПараметра <> Неопределено) Тогда
				СтрокаПараметра.Значение = Стр.Значение;
				
				// в дереве
				Для каждого СтрокаГруппы Из УФ.ДеревоПараметров.ПолучитьЭлементы() Цикл
					
					Если СтрокаГруппы.Параметр = СтрокаПараметра.Параметр.Родитель Тогда
						
						Для каждого СтрокаЭлемента Из СтрокаГруппы.ПолучитьЭлементы() Цикл
							
							Если СтрокаЭлемента.Параметр = СтрокаПараметра.Параметр Тогда
								
								ДеревоПараметровОбновитьСтрокуДереваПоСтрокеПараметра(УФ,СоответствиеСвойствПараметров,СтрокаЭлемента,СтрокаПараметра);
								Продолжить;
								
							КонецЕсли; 
							
						КонецЦикла; 
						Продолжить;
						
					КонецЕсли; 
					
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;
	
	// --- 
КонецФункции

&НаСервере
Функция НайтиПараметрВДереве(УФ,Параметр)
	// --- 
	
	Для каждого Группа Из УФ.ДеревоПараметров.ПолучитьЭлементы() Цикл
		
		Если Группа.Параметр = Параметр.Родитель Тогда
			
			Для каждого ЭлементГруппы Из Группа.ПолучитьЭлементы() Цикл
				
				Если ЭлементГруппы.Параметр = Параметр Тогда
					
					Возврат(ЭлементГруппы);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецФункции

&НаСервере
Функция ДеревоПараметровОбновитьПредставлениеГруппы(УФ,СтрокаГруппы)
	// --- 
	
	СтрокаГруппы.Параметр_Представление = ?(Строка(СтрокаГруппы.Параметр)="","<без группы>",Строка(СтрокаГруппы.Параметр))+" ("+Строка(СтрокаГруппы.ПолучитьЭлементы().Количество())+")";
	ЕстьНезаполненные = Ложь;
	ЕстьКонтроллируемые = Ложь;
	Элементы = СтрокаГруппы.ПолучитьЭлементы();
	Для каждого Элемент Из Элементы Цикл
		Если (Элемент.ЗначениеНезаполнено И Элемент.КонтрольЗаполнения) Тогда
			ЕстьНезаполненные = Истина;
			ЕстьКонтроллируемые = Истина;
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	СтрокаГруппы.ЗначениеНезаполнено = ЕстьНезаполненные;
	СтрокаГруппы.КонтрольЗаполнения = ЕстьКонтроллируемые;
	
	// --- 
КонецФункции

&НаСервере
Функция ДеревоПараметровУдалитьПараметр(УФ,Параметры)
	// --- 
	
	Параметр = _сф.ст_ПолучитьСвойство(Параметры,"Параметр");
	СписокВедомых = _сф.ст_ПолучитьСвойство(Параметры,"СписокВедомых");
	
	СтрокаПараметра = _сф.к_НайтиСтроку(УФ.Объект.ПараметрыГрузоперевозки,_сф.ст_Отбор("Параметр",Параметр));
	УдалитьПараметрИзДерева(УФ,СтрокаПараметра.Параметр);
	УФ.Объект.ПараметрыГрузоперевозки.Удалить(СтрокаПараметра);
	// --- 
	Если СписокВедомых <> Неопределено Тогда
		
		Для каждого ВП Из СписокВедомых Цикл
			
			СтрокаПараметра = _сф.к_НайтиСтроку(УФ.Объект.ПараметрыГрузоперевозки,"Параметр",ВП.Значение);
			Если СтрокаПараметра <> Неопределено Тогда
				
				УдалитьПараметрИзДерева(УФ,СтрокаПараметра.Параметр);
				УФ.Объект.ПараметрыГрузоперевозки.Удалить(СтрокаПараметра);
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция УдалитьПараметрИзДерева(УФ,Параметр)
	// --- 
	
	// удаляем из дерева
	СтрокаЭлемента = НайтиПараметрВДереве(УФ,Параметр);
	СтрокаГруппы = СтрокаЭлемента.ПолучитьРодителя();
	
	ЭлементыГруппы = СтрокаГруппы.ПолучитьЭлементы();
	ЭлементыГруппы.Удалить(ЭлементыГруппы.Индекс(СтрокаЭлемента));
	
	// проверяем количество оставшихся
	Если (ЭлементыГруппы.Количество()=0) Тогда
		
		// удаляем
		ЭлементыДерева = УФ.ДеревоПараметров.ПолучитьЭлементы();
		ЭлементыДерева.Удалить(ЭлементыДерева.Индекс(СтрокаГруппы));
		
	Иначе
		
		ДеревоПараметровОбновитьПредставлениеГруппы(УФ,СтрокаГруппы);
		УФ.Элементы.ДеревоПараметров.ТекущаяСтрока = СтрокаГруппы.ПолучитьИдентификатор();
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция ЗаполнитьПредопределенныеЗначенияПараметровДляРеквизита(УФ,Параметры)
	// --- 
	
	
	Ответ = ПолучитьПредопределенныеПараметры(УФ,Параметры);
	Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
		//СохранитьСостояниеСвертки();
		СП = ПолучитьПредопределенныеПараметры(УФ,Параметры);
		Если (_УФКС.ВыполненоУспешно(СП)) Тогда
			Результат = ДобавитьПредопределенныеПараметры(УФ,СП.Параметры);
			Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
				Возврат(_УФКС.СД("Грузоперевозки","сервер","/ДеревоПараметровОбновить"));
				//ВосстановитьСостояниеСвертки();
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция ПолучитьПредопределенныеПараметры(УФ,Параметры)
	// --- 
	
	Возврат(CW_Мониторинг.ПолучитьПредопределенныеПараметры(Параметры.ЗначениеРеквизита,Параметры.ИмяРеквизита,УФ.УникальныйИдентификатор));
	
	// --- 
КонецФункции

&НаСервере
Функция ДобавитьПредопределенныеПараметры(УФ,АдресПараметров)
	// --- 
	
	Возврат(CW_Мониторинг.ДобавитьПредопределенныеПараметры(УФ.Объект,АдресПараметров));
	
	// --- 
КонецФункции

&НаСервере
Функция ЗафиксироватьНачальныйПорядокПараметров(УФ)
	// --- 
	
	// фиксируем порядок элементов
	УФ.НачальныйПорядокПараметров.Очистить();
	Для каждого Стр Из УФ.ДеревоПараметров.ПолучитьЭлементы() Цикл
		
		Для каждого СтрП Из Стр.ПолучитьЭлементы() Цикл
			
			УФ.НачальныйПорядокПараметров.Добавить(СтрП.Параметр);
			
		КонецЦикла; 
		
	КонецЦикла;
	
	// --- 
КонецФункции

&НаСервере
Функция ЗафиксироватьКонечныйПорядокПараметров(УФ)
	// --- 
	
	// фиксируем порядок элементов
	УФ.КонечныйПорядокПараметров.Очистить();
	Для каждого Стр Из УФ.ДеревоПараметров.ПолучитьЭлементы() Цикл
		
		Для каждого СтрП Из Стр.ПолучитьЭлементы() Цикл
			
			УФ.КонечныйПорядокПараметров.Добавить(СтрП.Параметр);
			
		КонецЦикла; 
		
	КонецЦикла;
	
	// --- 
КонецФункции

&НаСервере
Функция ПроверитьПорядокПараметров(УФ)
	// --- 
	
	Попытка
		
		Объект = УФ.Объект;
		
		ТребуетсяПерезаполнение = Ложь;
		
		// создаём копию ТЧ параметров
		ТПараметров = Объект.ПараметрыГрузоперевозки.Выгрузить();
		ТПараметров.Колонки.Добавить("Индекс");
		Индекс = 0;
		Для каждого Стр Из ТПараметров Цикл
			
			_сф.Инкремент(Индекс);
			// --- 
			Стр.Индекс = Индекс;
			
		КонецЦикла; 
		
		// сопоставляем начальный слепок с конечным
		ТСопоставления = _сф.т_Создать("Параметр,НВИ,КВИ,ИТЧ,ПН,ПУ");
		Индекс = 0;
		Для каждого Стр Из УФ.НачальныйПорядокПараметров Цикл
			
			_сф.Инкремент(Индекс);
			// --- 
			Нстр = ТСопоставления.Добавить();
			Нстр.Параметр = Стр.Значение;
			Нстр.НВИ = Индекс;
			Нстр.КВИ = 0;
			Нстр.ПН = Ложь;
			Нстр.ПУ = Ложь;
			Нстр.ИТЧ = 0;
			
		КонецЦикла; 
		Индекс = 0;
		Для каждого Стр Из УФ.КонечныйПорядокПараметров Цикл
			
			_сф.Инкремент(Индекс);
			// --- 
			
			// пробуем спозиционироваться на строку
			СтрокаПараметра = _сф.к_НайтиСтроку(ТСопоставления,_сф.ст_Отбор("Параметр",Стр.Значение));
			Если СтрокаПараметра = Неопределено Тогда
				
				// добавляем как новую
				Нстр = ТСопоставления.Добавить();
				Нстр.Параметр = Стр.Значение;
				Нстр.НВИ = 0;
				Нстр.КВИ = Индекс;
				Нстр.ПН = Истина;
				Нстр.ПУ = Ложь;
				Нстр.ИТЧ = 0;
				
			Иначе
				
				СтрокаПараметра.КВИ = Индекс;
				
			КонецЕсли; 
			
		КонецЦикла; 
		// помечаем удаленные (КВИ=0)
		Для каждого Стр Из ТСопоставления Цикл
			
			Если Стр.КВИ = 0 Тогда
				
				Стр.ПУ = Истина;
				
			КонецЕсли; 
			
		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоОтбору(ТСопоставления,_сф.ст_Отбор("ПУ",Истина));
		// --- 
		ТСопоставления.Сортировать("НВИ Возр");
		// делаем нумерацию новых, новые идут в конце
		ИндексНовых = _сф.Количество(ТСопоставления.Скопировать(_сф.ст_Отбор("ПН",Ложь)))+1;
		Для каждого Стр Из ТСопоставления Цикл
			
			Если Стр.ПН Тогда
				
				Стр.НВИ = ИндексНовых;
				ИндексНовых = ИндексНовых +1;
				
			КонецЕсли; 
			
		КонецЦикла; 
		// --- 
		Для каждого Стр Из ТСопоставления Цикл
			
			Если Стр.НВИ <> Стр.КВИ Тогда
				
				ТребуетсяПерезаполнение = Истина;
				// --- 
				
				// ищем НВИ = тек КВИ
				СтрокаНВИ = _сф.к_НайтиСтроку(ТСопоставления,_сф.ст_Отбор("НВИ",Стр.КВИ));
				// индекс ТЧ для Параметра
				ИТЧ = ТПараметров.Индекс(_сф.к_НайтиСтроку(ТПараметров,_сф.ст_Отбор("Параметр",СтрокаНВИ.Параметр)))+1;
				// устанавливаем
				_сф.к_НайтиСтроку(ТПараметров,_сф.ст_Отбор("Параметр",Стр.Параметр)).Индекс = ИТЧ;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		ТПараметров.Сортировать("Индекс Возр");
		
		// ---------------------------------------------------------------------------- 
		
		Если ТребуетсяПерезаполнение Тогда
			
			Объект.ПараметрыГрузоперевозки.Загрузить(ТПараметров);
			
		КонецЕсли; 
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки; 
	
КонецФункции

#Область Бюджет 

&НаСервере
Функция БюджетИнициализация(УФ)
	// --- 
	
	ИспользованиеБюджетов = ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования");
	// --- 
	УФ.Элементы.СтраницаБюджет.Видимость = ИспользованиеБюджетов;
	УФ.Элементы.Форма_ФинансыРасходыДобавитьПоБюджету.Видимость = ИспользованиеБюджетов;
	УФ.Элементы.Форма_ФинансыДоходыДобавитьПоБюджету.Видимость = ИспользованиеБюджетов;
	
	Если (ИспользованиеБюджетов) Тогда 
		
		УФ.Перечисления_CW_ВидыСтатейПланирования_Расходы = Перечисления.CW_ВидыСтатейПланирования.Расходы;
		УФ.Перечисления_CW_ВидыСтатейПланирования_Доходы = Перечисления.CW_ВидыСтатейПланирования.Доходы;
		
	КонецЕсли;
	
	// ---------------------------------------------------------------------------- 
	Возврат(Неопределено);
	
	// --- 
КонецФункции

&НаСервере
Функция ОбновитьТаблицуБюджетов(УФ)
	// --- 
	
	Если (УФ.Объект.Ссылка.Пустая()) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	
	Если (ТипЗнч(УФ.Объект.Ссылка)=Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам")) Тогда
		
		Если (ЗначениеЗаполнено(УФ.Объект.ВариантБюджета)) Тогда
			ОбъектВКоторомУтверждаетсяБюджет = УФ.Объект.ВариантБюджета;
		Иначе
			Возврат(Неопределено);
		КонецЕсли; 
		
	Иначе
		
		Если (ФормаГрузоперевозки(УФ)) Тогда
			Если ЗначениеЗаполнено(УФ.Объект.Заказ) Тогда 
				ОбъектВКоторомУтверждаетсяБюджет = УФ.Объект.Заказ;
			Иначе 
				ОбъектВКоторомУтверждаетсяБюджет = УФ.Объект.Ссылка;
			КонецЕсли;
		Иначе
			ОбъектВКоторомУтверждаетсяБюджет = УФ.Объект.Ссылка;
		КонецЕсли; 
		
	КонецЕсли; 
	
	тз = CW_Бюджетирование._ПолучитьТаблицуИспользованияВерсийБюджета(ОбъектВКоторомУтверждаетсяБюджет);
	Если (НЕ ЗначениеЗаполнено(УФ.БюджетТекущаяВерсия)) Тогда
		
		Если тз.Количество()>0 Тогда 
			УФ.БюджетТекущаяВерсия = тз[0].ВерсияБюджета;
			УФ.БюджетУтвержден     = тз[0].ЭтоУтвержденнаяВерсия;
		КонецЕсли;
		
	КонецЕсли; 
	
	УФ.БюджетВерсии.Загрузить(тз);
	
	// --- 
КонецФункции
 
&НаСервере
Функция БюджетОбновить(УФ,Расходы,Доходы)
	// --- 
	БлокироватьОбъекты 	= CW_АрхивОбъектовСервер.БлокироватьОбъектыПриПереводеВАрхив(); 
	Архив	= УФ.Объект.Архив и БлокироватьОбъекты;
	
	Элементы = УФ.Элементы;
	Объект = УФ.Объект;
	// --- 
	
	Если (УФ.БюджетТекущаяВерсия.Пустая()) Тогда
		ОбновитьТаблицуБюджетов(УФ);
	КонецЕсли; 
	
	Если (ФормаГрузоперевозки(УФ)) Тогда
		Ответ = CW_Бюджетирование._ПолучитьТаблицыБюджета_ПоГрузоперевозке(Объект.Ссылка, Объект.Заказ, УФ.БюджетТекущаяВерсия, Неопределено, Расходы, Доходы);
	ИначеЕсли (ФормаЗаявки(УФ)) Тогда 
		Ответ = CW_Бюджетирование._ПолучитьТаблицыБюджета_ПоГрузоперевозке(Объект.Ссылка, Неопределено, УФ.БюджетТекущаяВерсия, Объект.ВариантБюджета, Расходы, Доходы);
	ИначеЕсли (ФормаЗаказа(УФ)) Тогда 
		Ответ = CW_Бюджетирование._ПолучитьТаблицыБюджета_ПоЗаказу(Объект.Ссылка, УФ.БюджетТекущаяВерсия,Расходы, Доходы);
	КонецЕсли; 
	
	Если (Расходы) Тогда 
		УФ.БюджетРасходы.Загрузить(Ответ.тзЗатраты);
		Если (ФормаЗаказа(УФ)) Тогда 
			БюджетРасходыДерево = УФ.РеквизитФормыВЗначение("БюджетРасходыДерево");
			БюджетРасходыДерево.Строки.Очистить();
			ЗаполнитьДеревоЗначений(Ответ.ВыборкаЗатраты, БюджетРасходыДерево);
			УФ.ЗначениеВРеквизитФормы(БюджетРасходыДерево, "БюджетРасходыДерево");
		КонецЕсли;
	КонецЕсли;
	
	Если (Доходы) Тогда 
		УФ.БюджетДоходы.Загрузить(Ответ.тзДоходы);
		Если (ФормаЗаказа(УФ)) Тогда 
			БюджетДоходыДерево = УФ.РеквизитФормыВЗначение("БюджетДоходыДерево");
			БюджетДоходыДерево.Строки.Очистить();
			ЗаполнитьДеревоЗначений( Ответ.ВыборкаДоходы, БюджетДоходыДерево);
			УФ.ЗначениеВРеквизитФормы(БюджетДоходыДерево, "БюджетДоходыДерево");
		КонецЕсли;
	КонецЕсли;
	
	УФ.БюджетУтвержден = Ответ.БюджетУтвержден;
	
	// добавим в список выбора, если там ещё нет текущей версии
	Если (УФ.БюджетДоходы.Количество() <> 0 ИЛИ УФ.БюджетРасходы.Количество() <> 0) Тогда 
		
		строкаТЗ = _сф.к_НайтиСтроку(УФ.БюджетВерсии, "ВерсияБюджета", УФ.БюджетТекущаяВерсия);
		Если (строкаТЗ = Неопределено) Тогда 
			строкаТЗ = УФ.БюджетВерсии.Добавить();
		КонецЕсли;
		строкаТЗ.ЭтоУтвержденнаяВерсия = УФ.БюджетУтвержден;
		
	КонецЕсли;
	
	// ---------------------------------------------------------------------------- 
	
	// обновление итогов
	БюджетОбновитьИтоги(УФ,Расходы,Доходы);
	
	// управление доступностью
	Если (УФ.БюджетУтвержден) Тогда 
		
		// если бюджет утверждён, не даём его изменять
		Элементы.БюджетДоходы.ИзменятьСоставСтрок 	= Ложь;
		Элементы.БюджетРасходы.ИзменятьСоставСтрок 	= Ложь;
		
		Элементы.БюджетРасходыФорма_БюджетЗаполнитьДоходыПоРасходам.Доступность 		= Не Архив;
		Элементы.БюджетДоходыФорма_БюджетЗаполнитьРасходыПоДоходам.Доступность 			= Не Архив;
		
		Элементы.БюджетДоходыФорма_БюджетДоходыПересчитатьПоКурсу.Доступность 		= Не Архив;
		Элементы.БюджетРасходыФорма_БюджетРасходыПересчитатьПоКурсу.Доступность 	= Не Архив;

		
		Если (ФормаЗаказа(УФ)) Тогда 
			Элементы.БюджетДоходыДерево.ИзменятьСоставСтрок 	= Ложь;
			Элементы.БюджетРасходыДерево.ИзменятьСоставСтрок 	= Ложь;
			
			Элементы.Форма_БюджетЗаполнитьДоходыПоРасходамДерево.Доступность 					= Не Архив;
			Элементы.БюджетДоходыДеревоФорма_БюджетЗаполнитьРасходыПоДоходамДерево.Доступность  = Не Архив;
			
			Элементы.БюджетДоходыФорма_БюджетДоходыДеревоПересчитатьПоКурсу.Доступность 	= Не Архив;
			Элементы.БюджетРасходыФорма_БюджетРасходыДеревоПересчитатьПоКурсу.Доступность   = Не Архив;
			
		КонецЕсли;
		
		Элементы.СтатусУтверждения.Заголовок = _ПолучитьТексЗаголовкаСтатусаУтвержденияБюджета(УФ);	
		
	Иначе 
		
		// если бюджет не утверждён, изменять его можно
		Элементы.БюджетДоходы.ИзменятьСоставСтрок = Истина;
		Элементы.БюджетРасходы.ИзменятьСоставСтрок = Истина; 
		
		Элементы.БюджетРасходыФорма_БюджетЗаполнитьДоходыПоРасходам.Доступность 		= Не Архив;
		Элементы.БюджетДоходыФорма_БюджетЗаполнитьРасходыПоДоходам.Доступность 			= Не Архив;
		
		Элементы.БюджетДоходыФорма_БюджетДоходыПересчитатьПоКурсу.Доступность 		= Не Архив;
		Элементы.БюджетРасходыФорма_БюджетРасходыПересчитатьПоКурсу.Доступность 	= Не Архив;
	
		Если (ФормаЗаказа(УФ)) Тогда
			Элементы.БюджетДоходыДерево.ИзменятьСоставСтрок 	= Истина;
			Элементы.БюджетРасходыДерево.ИзменятьСоставСтрок 	= Истина;
			
			Элементы.Форма_БюджетЗаполнитьДоходыПоРасходамДерево.Доступность 					= Не Архив;
			Элементы.БюджетДоходыДеревоФорма_БюджетЗаполнитьРасходыПоДоходамДерево.Доступность  = Не Архив;
			
			Элементы.БюджетДоходыФорма_БюджетДоходыДеревоПересчитатьПоКурсу.Доступность 	= Не Архив;
			Элементы.БюджетРасходыФорма_БюджетРасходыДеревоПересчитатьПоКурсу.Доступность   = Не Архив;
		КонецЕсли;
		
		Элементы.СтатусУтверждения.Заголовок = "Не утвержден";	
	
	КонецЕсли;
	
	// --- 
КонецФункции

&НаСервере
процедура ЗаполнитьДеревоЗначений(Источник, Приемник)
	
	Пока Источник.Следующий() Цикл //Грузоперевозки
		
		СтрокаДерева 				= Приемник.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, Источник);
		СтрокаДерева.Контрагент 	= Источник.грузоперевозка;
		СтрокаДерева.Пиктограмма 	= 0;
		
		Детали = Источник.Выбрать();
		
		Пока Детали.Следующий() Цикл  //Детали
			
			СтрокаДетали = СтрокаДерева.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДетали, Детали);
			СтрокаДетали.Пиктограмма 	= 3;
			
		КонецЦикла; //Детали
		
	КонецЦикла;//Грузоперевозки
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьТексЗаголовкаСтатусаУтвержденияБюджета(УФ) Экспорт
	
	Объект = УФ.Объект;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ИсторияУтверждениеБюджетовСрезПоследних.Период КАК Дата,
	               |	CW_ИсторияУтверждениеБюджетовСрезПоследних.Пользователь КАК Пользователь
	               |ИЗ
	               |	РегистрСведений.CW_ИсторияУтверждениеБюджетов.СрезПоследних(
	               |			,
	               |			Объект = &Объект
	               |				И ВерсияБюджета = &ВерсияБюджета
	               |				И ПризнакУтверждения = ИСТИНА) КАК CW_ИсторияУтверждениеБюджетовСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";  
	
	Если ФормаЗаявки(УФ) Тогда
		Запрос.УстановитьПараметр("ВерсияБюджета", Объект.ВариантБюджета);
	Иначе
		Запрос.УстановитьПараметр("ВерсияБюджета", УФ.БюджетТекущаяВерсия);
	КонецЕсли;
	
	Если ФормаГрузоперевозки(УФ) Тогда
		Если Объект.Заказ.Пустая() Тогда
			Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
		Иначе
			Запрос.УстановитьПараметр("Объект", Объект.Заказ);
		КонецЕсли; 
	Иначе
		Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат "Утвержден "+Формат(Выборка.Дата,"ДФ=dd.MM.yyyy")+" ("+Строка(Выборка.Пользователь)+")";
	КонецЕсли;
	
	Возврат "Утвержден";
		
КонецФункции

&НаСервере
Функция БюджетОбновитьИтоги(УФ,флОбновлятьЗатраты=Истина, флОбновлятьДоходы=Истина)
	
	// обновление итогов
	ФорматВывода = "ЧЦ=15; ЧДЦ=2; ЧН=";
	// --- 
	ИсключатьВнутриХолдинговые = CW_Настройки.ПолучитьНастройкуПользователя(,"ИсключатьВнутрихолдинговыеВзаиморасчеты"); 
	Если (ИсключатьВнутриХолдинговые = Неопределено) Тогда
		ИсключатьВнутриХолдинговые = Ложь;		                                           
	КонецЕсли; 
	// --- 
	ВыводитьРезультатВБазовойВалюте = Истина;
	ВыводитьРасходыВБазовойВалюте = Истина;
	ВыводитьДоходыВБазовойВалюте = Истина;
	
	Если (УФ.ВыводитьРезультатВВалютеДокументов) Тогда
		
		// проверяем, что все документы в одной валюте
		ОбщаяВалюта = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");;
		ВалютыРасходов = УФ.БюджетРасходы.Выгрузить(,"Валюта");
		ВалютыРасходов.Свернуть("Валюта"); 
		ВалютыДоходов = УФ.БюджетДоходы.Выгрузить(,"Валюта");
		ВалютыДоходов.Свернуть("Валюта");
		
		Если (ВалютыРасходов.Количество()=1) Тогда
			ВалютаРасходов = ВалютыРасходов[0].Валюта;
			ВыводитьРасходыВБазовойВалюте = Ложь;
		Иначе
			ВалютаРасходов = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");;
		КонецЕсли; 
		
		Если (ВалютыДоходов.Количество()=1) Тогда
			ВалютаДоходов = ВалютыДоходов[0].Валюта;
			ВыводитьДоходыВБазовойВалюте = Ложь;
		Иначе
			ВалютаДоходов = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");;
		КонецЕсли; 
		
		Если (ВалютаРасходов = ВалютаДоходов И НЕ ВалютаРасходов.Пустая()) Тогда
			ВыводитьРезультатВБазовойВалюте=Ложь;
			ОбщаяВалюта = ВалютаРасходов;
		ИначеЕсли (ВалютаРасходов.Пустая() И НЕ ВалютаДоходов.Пустая() И ВалютыРасходов.Количество()=0) Тогда 
			ВыводитьРезультатВБазовойВалюте=Ложь;
			ОбщаяВалюта = ВалютаДоходов;
		ИначеЕсли (НЕ ВалютаРасходов.Пустая() И ВалютаДоходов.Пустая() И ВалютыДоходов.Количество()=0) Тогда 
			ВыводитьРезультатВБазовойВалюте=Ложь;
			ОбщаяВалюта = ВалютаРасходов;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если (флОбновлятьЗатраты) Тогда 
		
		Если (ВыводитьРасходыВБазовойВалюте) Тогда
			УФ.Элементы.БюджетРасходыИтого.Заголовок = 
			"Расходы: "+Формат(УФ.БюджетРасходы.Итог("СуммаВсегоРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ)
			+", расходы без НДС: "+Формат(УФ.БюджетРасходы.Итог("СуммаРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ);
		Иначе
			УФ.Элементы.БюджетРасходыИтого.Заголовок = 
			"Расходы: "+Формат(УФ.БюджетРасходы.Итог("СуммаВсего"),ФорматВывода)+" "+Строка(ВалютаРасходов)
			+", расходы без НДС: "+Формат(УФ.БюджетРасходы.Итог("Сумма"),ФорматВывода)+" "+Строка(ВалютаРасходов);
		КонецЕсли; 
		
		Если ФормаЗаказа(УФ) Тогда
			Если УФ.ВариантГруппировкиБюджетаРасходыДерево Тогда
				ЭлементыДерева = УФ.БюджетРасходыДерево.ПолучитьЭлементы();
				УФ.Элементы.ГруппаБюджетЗатраты.Заголовок = "Расходы ("+ЭлементыДерева.Количество()+")";
			Иначе
				УФ.Элементы.ГруппаБюджетЗатраты.Заголовок = "Расходы ("+УФ.БюджетРасходы.Количество()+")";
			КонецЕсли;
		Иначе
			УФ.Элементы.ГруппаБюджетЗатраты.Заголовок = "Расходы ("+УФ.БюджетРасходы.Количество()+")";
		КонецЕсли;
		
	КонецЕсли;
	
	Если (флОбновлятьДоходы) Тогда 
		
		Если (ВыводитьДоходыВБазовойВалюте) Тогда
			УФ.Элементы.БюджетДоходыИтого.Заголовок = 
			"Доходы: "+Формат(УФ.БюджетДоходы.Итог("СуммаВсегоРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ)
			+", доходы без НДС: "+Формат(УФ.БюджетДоходы.Итог("СуммаРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ);
		Иначе
			УФ.Элементы.БюджетДоходыИтого.Заголовок = 
			"Доходы: "+Формат(УФ.БюджетДоходы.Итог("СуммаВсего"),ФорматВывода)+" "+Строка(ВалютаДоходов)
			+", доходы без НДС: "+Формат(УФ.БюджетДоходы.Итог("Сумма"),ФорматВывода)+" "+Строка(ВалютаДоходов);
		КонецЕсли; 
		
		Если ФормаЗаказа(УФ) Тогда
			Если УФ.ВариантГруппировкиБюджетаДоходыДерево  Тогда
				ЭлементыДерева = УФ.БюджетДоходыДерево.ПолучитьЭлементы();
				УФ.Элементы.ГруппаБюджетДоходы.Заголовок = "Доходы ("+ЭлементыДерева.Количество()+")";
			Иначе
				УФ.Элементы.ГруппаБюджетДоходы.Заголовок = "Доходы ("+УФ.БюджетДоходы.Количество()+")";
			КонецЕсли;
		Иначе
			УФ.Элементы.ГруппаБюджетДоходы.Заголовок = "Доходы ("+УФ.БюджетДоходы.Количество()+")";
		КонецЕсли;
		
	КонецЕсли;
	
	Если (ВыводитьРезультатВБазовойВалюте) Тогда
			УФ.Элементы.БюджетФинансовыйРезультатИтого.Заголовок = 
			"Прибыль: "+Формат(УФ.БюджетДоходы.Итог("СуммаВсегоРуб") - УФ.БюджетРасходы.Итог("СуммаВсегоРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ)
			+", прибыль без НДС: "+Формат(УФ.БюджетДоходы.Итог("СуммаРуб") - УФ.БюджетРасходы.Итог("СуммаРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ);
		Иначе
			УФ.Элементы.БюджетФинансовыйРезультатИтого.Заголовок = 
			"Прибыль: "+Формат(УФ.БюджетДоходы.Итог("СуммаВсего") - УФ.БюджетРасходы.Итог("СуммаВсего"),ФорматВывода)+" "+Строка(ОбщаяВалюта)
			+", прибыль без НДС: "+Формат(УФ.БюджетДоходы.Итог("Сумма") - УФ.БюджетРасходы.Итог("Сумма"),ФорматВывода)+" "+Строка(ОбщаяВалюта);
			
		КонецЕсли;
		
	// ---------------------------------------------------------------------------- 
		
	Если (ИсключатьВнутриХолдинговые) Тогда
		
		КонтрагентыХолдинга = CW_Финансы.ПолучитьКонтрагентовХолдинга(); 
		
		ТЗ_Расходы = УФ.БюджетРасходы.Выгрузить();
		МассивУдаляемых = Новый Массив;
		Для каждого Стр Из ТЗ_Расходы Цикл
			
			Если (КонтрагентыХолдинга.Найти(Стр.Контрагент) <> Неопределено) Тогда
				МассивУдаляемых.Добавить(Стр);
			КонецЕсли; 
			
		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(ТЗ_Расходы,МассивУдаляемых);
		// --- 
		ТЗ_Доходы = УФ.БюджетДоходы.Выгрузить();
		МассивУдаляемых = Новый Массив;
		Для каждого Стр Из ТЗ_Доходы Цикл
			
			Если (КонтрагентыХолдинга.Найти(Стр.Контрагент) <> Неопределено) Тогда
				МассивУдаляемых.Добавить(Стр);
			КонецЕсли; 
			
		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(ТЗ_Доходы,МассивУдаляемых);
		
		// --- 
		
		Если (ВыводитьРасходыВБазовойВалюте) Тогда
			УФ.Элементы.БюджетРасходыИтого.Заголовок = 
			"Расходы: "+Формат(ТЗ_Расходы.Итог("СуммаВсегоРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ)
			+", расходы без НДС: "+Формат(ТЗ_Расходы.Итог("СуммаРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ);
		Иначе
			УФ.Элементы.БюджетРасходыИтого.Заголовок = 
			"Расходы: "+Формат(ТЗ_Расходы.Итог("СуммаВсего"),ФорматВывода)+" "+Строка(ВалютаРасходов)
			+", расходы без НДС: "+Формат(ТЗ_Расходы.Итог("Сумма"),ФорматВывода)+" "+Строка(ВалютаРасходов);
		КонецЕсли; 
		
		// --- 
		
		Если (ВыводитьДоходыВБазовойВалюте) Тогда
			УФ.Элементы.БюджетДоходыИтого.Заголовок = 
			"Доходы: "+Формат(ТЗ_Доходы.Итог("СуммаВсегоРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ)
			+", доходы без НДС: "+Формат(ТЗ_Доходы.Итог("СуммаРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ);
		Иначе
			УФ.Элементы.БюджетДоходыИтого.Заголовок = 
			"Доходы: "+Формат(ТЗ_Доходы.Итог("СуммаВсего"),ФорматВывода)+" "+Строка(ВалютаДоходов)
			+", доходы без НДС: "+Формат(ТЗ_Доходы.Итог("Сумма"),ФорматВывода)+" "+Строка(ВалютаДоходов);
		КонецЕсли; 
		
		// --- 
		
		Если (ВыводитьРезультатВБазовойВалюте) Тогда
			УФ.Элементы.БюджетФинансовыйРезультатИтого.Заголовок = 
			"Прибыль: "+Формат(ТЗ_Доходы.Итог("СуммаВсегоРуб") - ТЗ_Расходы.Итог("СуммаВсегоРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ)
			+", прибыль без НДС: "+Формат(ТЗ_Доходы.Итог("СуммаРуб") - ТЗ_Расходы.Итог("СуммаРуб"),ФорматВывода)+" "+Строка(УФ.ВРУ);
		Иначе
			УФ.Элементы.БюджетФинансовыйРезультатИтого.Заголовок = 
			"Прибыль: "+Формат(ТЗ_Доходы.Итог("СуммаВсего") - ТЗ_Расходы.Итог("СуммаВсего"),ФорматВывода)+" "+Строка(ОбщаяВалюта)
			+", прибыль без НДС: "+Формат(ТЗ_Доходы.Итог("Сумма") - ТЗ_Расходы.Итог("Сумма"),ФорматВывода)+" "+Строка(ОбщаяВалюта);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция БюджетУдалить(УФ,Параметры)
	// --- 
	
	Если (ФормаГрузоперевозки(УФ) ИЛИ ФормаЗаявки(УФ)) Тогда
		
		СтатьяСсылка = Параметры;
		
		ЭтоРасходы = (СтатьяСсылка.ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Расходы);
		ЭтоДоходы = (СтатьяСсылка.ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Доходы);
		
		Попытка
			УстановитьПривилегированныйРежим(Истина);
			об = СтатьяСсылка.ПолучитьОбъект();
			об.Удалить();
		Исключение
			Возврат(_УФКС.СД("Грузоперевозки","клиент","/Предупреждение","Ошибка удаления: "+ОписаниеОшибки()));
		КонецПопытки; 
		
	Иначе
		
		Отбор = Параметры;
		// --- 
		
		ЭтоРасходы = (Отбор.ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Расходы);
		ЭтоДоходы = (Отбор.ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Доходы);
		
		Попытка
			
			УстановитьПривилегированныйРежим(Истина);
			НачатьТранзакцию();       
			тз=CW_Бюджетирование._ПолучитьТаблицуБюджетаДляРедактированияИзЗаказа(Отбор,?(Отбор.Свойство("Грузоперевозка"), Отбор.Грузоперевозка,Неопределено));
			Для Каждого строкаТЗ Из тз Цикл 
				об = строкаТЗ.СтатьяСсылка.ПолучитьОбъект();
				об.Удалить();
			КонецЦикла;
			ЗафиксироватьТранзакцию();
			
		Исключение
			Возврат(_УФКС.СД("Грузоперевозки","клиент","/Предупреждение","Ошибка удаления: "+ОписаниеОшибки()));
		КонецПопытки; 
		
	КонецЕсли; 
	
	БюджетОбновить(УФ,ЭтоРасходы,ЭтоДоходы);
	
	// --- 
КонецФункции

&НаСервере
Функция БюджетКонтрагентыПолучить(УФ)
	// --- 
	
	Возврат(_УФКС.СД("Грузоперевозки","клиент","/БюджетКонтрагенты",УФ.Объект.КонтрагентыПоБюджету.Выгрузить().ВыгрузитьКолонку("Контрагент")));
	
	// --- 
КонецФункции

&НаСервере
Функция БюджетКонтрагентыУстановить(УФ,Параметры)
	// --- 
	
	УФ.Объект.КонтрагентыПоБюджету.Очистить();
	// --- 
	Для каждого Стр Из Параметры Цикл
		
		Нстр = УФ.Объект.КонтрагентыПоБюджету.Добавить();
		Нстр.Контрагент = Стр;
		
	КонецЦикла; 
	УФ.Элементы.Форма_БюджетКонтрагенты.Заголовок = "Контрагенты"+?(УФ.Объект.КонтрагентыПоБюджету.Количество()=0,""," ("+Строка(УФ.Объект.КонтрагентыПоБюджету.Количество())+")");
	
	Возврат(_УФКС.СД("Грузоперевозки","клиент","/ФормаЗаписать"));
	
	// --- 
КонецФункции

&НаСервере
Функция БюджетЗаполнитьОбработкиЗаполнения(УФ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъекты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	               |ГДЕ
	               |	CW_ПодключаемыеОбъекты.ТипВнешнегоОбъекта = Значение(Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка)
	               |	И CW_ПодключаемыеОбъекты.Вид = &Вид
	               |	И CW_ПодключаемыеОбъекты.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ПодключаемыеОбъекты.НеИспользуется = ЛОЖЬ";
	Запрос.УстановитьПараметр("Тип", "Обработка");
	Запрос.УстановитьПараметр("Вид", "ЗаполнениеБюджета");

	МассивОбработок = Новый Массив;
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из ТЗ Цикл
		
		СО = Новый Структура("Обработка,Интерактив",Стр.Ссылка,Ложь);
		Отбор = Новый Структура("ТипФормы","ФормаНастроекЗаполнения");
		СтрокаФормы = _сф.к_НайтиСтроку(Стр.Ссылка.ФормыОбъекта,Отбор);
		Если (СтрокаФормы <> Неопределено) Тогда
			
			СО.Интерактив = Истина;
			
		КонецЕсли; 
		МассивОбработок.Добавить(СО);
		
	КонецЦикла; 
	Если (МассивОбработок.Количество()=0) Тогда
		
		Возврат(_УФКС.СД("Грузоперевозки","клиент","/Предупреждение","Обработок заполнения не обнаружено"));
	Иначе
		Ответ = _УФКС.Ответ();
		Ответ.Вставить("Обработки",МассивОбработок);
		Возврат(_УФКС.СД("Грузоперевозки","клиент","/Предупреждение",Ответ));
		Возврат(Ответ);
	КонецЕсли; 
	
КонецФункции

&НаСервере 
Функция БюджетЗаполнитьДоходыПоРасходам(УФ,Параметры) Экспорт
	
	Если (УФ.БюджетУтвержден) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	
	// Параметры - массив
	МассивСтатей = Новый Массив;
	Если (ФормаГрузоперевозки(УФ) ИЛИ ФормаЗаявки(УФ)) или Параметры.РежимДерево Тогда
		
		Для каждого Статья Из Параметры.МассивСсылок Цикл   		
			МассивСтатей.Добавить(Статья);
		КонецЦикла; 
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
		               |ГДЕ
		               |	CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = &ВидСтатьиПланирования
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.Контрагент = &Контрагент
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура = &Номенклатура
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.Валюта = &Валюта
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС = &СтавкаНДС
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.Организация = &Организация
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.Владелец.Заказ = &Заказ
		               |	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ
		               |	И ВЫБОР
		               |			КОГДА &ГрузоперевозкаВыбрана
		               |				ТОГДА CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Грузоперевозка
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ";
		
		Для каждого СтруктураПараметров Из Параметры.МассивСсылок Цикл
			
			Если Параметры.ДоходыВРасходы Тогда
				СтруктураПараметров.Вставить("ВидСтатьиПланирования",Перечисления.CW_ВидыСтатейПланирования.Доходы);
			Иначе
				СтруктураПараметров.Вставить("ВидСтатьиПланирования",Перечисления.CW_ВидыСтатейПланирования.Расходы);
			КонецЕсли;
			
			ТЗСтатей = _сф.ВыполнитьЗапрос(Запрос, СтруктураПараметров);
			Для каждого Стр Из ТЗСтатей Цикл
				МассивСтатей.Добавить(Стр.Ссылка);
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// теперь получаем таблицу данных по найденным статья
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец КАК Владелец,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент КАК Контрагент,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура КАК Номенклатура,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Валюта КАК Валюта,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС КАК СтавкаНДС,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Сумма КАК Сумма,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СуммаНДС КАК СуммаНДС,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсего КАК СуммаВсего,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СуммаРуб КАК СуммаРуб,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СуммаНДСРуб КАК СуммаНДСРуб,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсегоРуб КАК СуммаВсегоРуб,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Организация КАК Организация,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета КАК ВерсияБюджета,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования КАК ВидСтатьиПланирования,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец.Владелец.Контрагент КАК КонтрагентВладельца,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Комментарий КАК Комментарий,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Кратность КАК Кратность,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ТипКурсаВалюты КАК ТипКурсаВалюты,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Количество КАК Количество,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Цена КАК Цена,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ЦенаРуб КАК ЦенаРуб,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ВариантНаценки КАК ВариантНаценки,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ЗначениеНаценки КАК ЗначениеНаценки,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ЦенаСНДС КАК ЦенаСНДС,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.УчитыватьНДСВСебестоимости КАК УчитыватьНДСВСебестоимости,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.КонтрольнаяДатаКурсаДляПроверки КАК КонтрольнаяДатаКурсаДляПроверки
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка В(&Ссылки)";
	
	Запрос.УстановитьПараметр("Ссылки", МассивСтатей);    
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из ТЗ Цикл
		
		ЭтоВариантБюджета = ТипЗнч(Стр.Владелец) = Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Объект"				, Стр.Владелец);
		СтруктураПараметров.Вставить("ЭтоВариантБюджета"	, ЭтоВариантБюджета);
		
		Если ЭтоВариантБюджета Тогда
			СтруктураПараметров.Вставить("Контрагент"			, Стр.КонтрагентВладельца);
		Иначе
			СтруктураПараметров.Вставить("Контрагент"			, Стр.Владелец.Клиент);
		КонецЕсли;
	
		Стр.Контрагент = CW_Финансы.ВернутьПлательщика(СтруктураПараметров);
		
	КонецЦикла; 
	
	Если Параметры.ДоходыВРасходы Тогда
		ТЗ.ЗаполнитьЗначения(Перечисления.CW_ВидыСтатейПланирования.Расходы,"ВидСтатьиПланирования");
	Иначе
		ТЗ.ЗаполнитьЗначения(Перечисления.CW_ВидыСтатейПланирования.Доходы,"ВидСтатьиПланирования");
	КонецЕсли;
	
	ТЗ.Свернуть("Владелец,ВидСтатьиПланирования,ВерсияБюджета,Организация,Контрагент,Валюта,Номенклатура,СтавкаНДС,ПорядокОтраженияРасходов,Комментарий,ЕдиницаИзмерения,Кратность,ТипКурсаВалюты,Цена, ЦенаРуб,ВариантНаценки,ЗначениеНаценки,ЦенаСНДС,УчитыватьНДСВСебестоимости,КонтрольнаяДатаКурсаДляПроверки","Количество,Сумма,СуммаНДС,СуммаВсего,СуммаРуб,СуммаНДСРуб,СуммаВсегоРуб");
	
	мВалютыТЗ 	= ТЗ.ВыгрузитьКолонку("Валюта");
	мВалюты 	= Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мВалюты, мВалютыТЗ, Истина);
	
	СоответствиеКурсовВалют = Новый Соответствие;
	
	Для Каждого Валюта из мВалюты Цикл
		ДанныеКурса = CW_Финансы.ПолучитьКурсВалюты(Валюта, ТекущаяДата());
		СоответствиеКурсовВалют.Вставить(Валюта, ДанныеКурса);
	КонецЦикла;

	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка
	|ИЗ
	|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	|ГДЕ
	|	CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
	|	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = &ВидСтатьиПланирования
	|	И CW_ПлановыеСтатьиЗатратИДоходов.Контрагент = &Контрагент
	|	И CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура = &Номенклатура
	|	И CW_ПлановыеСтатьиЗатратИДоходов.Валюта = &Валюта
	|	И CW_ПлановыеСтатьиЗатратИДоходов.СтавкаНДС = &СтавкаНДС
	|	И CW_ПлановыеСтатьиЗатратИДоходов.Организация = &Организация
	|	И CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец";
	
	Попытка
		
		НачатьТранзакцию();
		
		Для каждого Стр Из ТЗ Цикл
			
			УчитыватьНДСВСебестоимости = Ложь;
			Если Параметры.ДоходыВРасходы Тогда
				УчитыватьНДСВСебестоимости = CW_Настройки.ПараметрУчетнойПолитики(ТекущаяДата(), Стр.Организация, "УчитыватьНДСВСебестоимости");
			Иначе 
				УчитыватьНДСВСебестоимости = Ложь;
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Владелец", Стр.Владелец); 
			Запрос.УстановитьПараметр("ВерсияБюджета", Стр.ВерсияБюджета);
			Запрос.УстановитьПараметр("ВидСтатьиПланирования", Стр.ВидСтатьиПланирования);
			Запрос.УстановитьПараметр("Контрагент", Стр.Контрагент);
			Запрос.УстановитьПараметр("Номенклатура", Стр.Номенклатура);
			Запрос.УстановитьПараметр("Валюта", Стр.Валюта);
			Запрос.УстановитьПараметр("СтавкаНДС", Стр.СтавкаНДС);
			Запрос.УстановитьПараметр("Организация", Стр.Организация); 

			СтатьяСсылка = _сф.ВыполнитьЗапрос(Запрос,,Истина,"Ссылка",Неопределено);
			Если (СтатьяСсылка <>  Неопределено) Тогда
				Статья = СтатьяСсылка.ПолучитьОбъект();
				Если (Статья.ПометкаУдаления) Тогда
					Статья.УстановитьПометкуУдаления(Ложь);
				КонецЕсли; 
			Иначе
				Статья = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьЭлемент();
			КонецЕсли;    
			
			ИсключаяСвойства = "";
			Если Стр.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда
				ИсключаяСвойства = "ВариантНаценки,ЗначениеНаценки";                                                                                         
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Статья,Стр,,ИсключаяСвойства);
			
			Статья.УчитыватьНДСВСебестоимости = УчитыватьНДСВСебестоимости;
	
			Если Стр.ПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление Тогда
				Статья.ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление;
			ИначеЕсли Стр.ПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда
				Статья.ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
			ИначеЕсли Стр.ПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам Тогда
				Статья.ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам;
			КонецЕсли;
			
			ДанныеКурса = СоответствиеКурсовВалют.Получить(Стр.Валюта);
			Статья.Курс 		= ДанныеКурса.Курс;
			Статья.Кратность 	= ДанныеКурса.Кратность; 
			Статья.Количество = ?(Статья.Количество = 0,1,Статья.Количество);
			
			//Применяем наценку если есть   
			ТребуетсяПересчетСуммовыхПоказателей = Статья.УчитыватьНДСВСебестоимости <> Стр.УчитыватьНДСВСебестоимости;
			Если Стр.ВариантНаценки = ПредопределенноеЗначение("Перечисление.CW_ВариантыНаценки.Процент") Тогда
				Статья.СуммаВсего = Статья.СуммаВсего + (Окр(Статья.СуммаВсего/100 * Стр.ЗначениеНаценки, 2));
				ТребуетсяПересчетСуммовыхПоказателей = Истина;
			КонецЕсли;
			
			Если Стр.ВариантНаценки = ПредопределенноеЗначение("Перечисление.CW_ВариантыНаценки.Сумма") Тогда
				Статья.СуммаВсего = Статья.СуммаВсего +  Стр.ЗначениеНаценки;
				ТребуетсяПересчетСуммовыхПоказателей = Истина;
			КонецЕсли;  
			//Конец применения наценки
			
			
			// в случае, если перенос статей осуществляется из заявки, 
			// то анализируем вариант изменения валюты
			Если ФормаЗаявки(УФ) Тогда
				
				// перенос осуществляется с изменением валюты, указанной в варианте бюджета
				Если Параметры.ВариантВалютыБюджета = 1 Тогда
					
					Валюта 		= Параметры.Объект.Валюта;
					Курс 		= Параметры.Объект.Курс;	
					Кратность 	= Параметры.Объект.Кратность;
					
					Если Валюта.Пустая() Тогда
						Валюта 		= ВалютаРегламентированногоУчета;
						Курс 		= 1;
						Кратность 	= 1;
					КонецЕсли;
					
					Статья.Валюта 		= Валюта;	
					Статья.Курс 		= Курс;	
					Статья.Кратность 	= Кратность;	
					
					Статья.СуммаВсего 	= Окр(Статья.СуммаВсегоРуб / (Статья.Курс/Статья.Кратность), 2);   
					ТребуетсяПересчетСуммовыхПоказателей = Истина;
					
				КонецЕсли;
			КонецЕсли; // перенос осуществляется из формы заявки
			
			
			Если ТребуетсяПересчетСуммовыхПоказателей Тогда
				СтавкаНДСПроцент = CW_Финансы.ПолучитьСтавкуНДС(Статья.СтавкаНДС); 
				
				// расчет валютных показателей
				Статья.СуммаНДС = Окр(Статья.СуммаВсего * СтавкаНДСПроцент / (100 + СтавкаНДСПроцент),2); 
				Если УчитыватьНДСВСебестоимости Тогда
					Статья.Сумма = Статья.СуммаВсего;
				Иначе
					Статья.Сумма = Статья.СуммаВсего - Статья.СуммаНДС;
				КонецЕсли; 
				
				Если Статья.ЦенаСНДС Тогда
					Статья.Цена = Окр(Статья.СуммаВсего/Статья.Количество,2);
				Иначе
					Статья.Цена = Окр(Статья.Сумма/Статья.Количество,2);
				КонецЕсли;
				
				// расчет рублевых показателей
				Статья.СуммаВсегоРуб 	= Окр(Статья.СуммаВсего * Статья.Курс / ?(Статья.Кратность=0,1, Статья.Кратность), 2);
				Статья.СуммаНДСРуб		= Окр(Статья.СуммаВсегоРуб * СтавкаНДСПроцент/(100+СтавкаНДСПроцент),2);
				
				Если УчитыватьНДСВСебестоимости Тогда    
					Статья.СуммаРуб 		= Статья.СуммаВсегоРуб ;
				Иначе
					Статья.СуммаРуб 		= Статья.СуммаВсегоРуб - Статья.СуммаНДСРуб;
				КонецЕсли; 
				
				Если Статья.ЦенаСНДС Тогда
					Статья.ЦенаРуб = Окр(Статья.СуммаВсегоРуб/Статья.Количество,2);
				Иначе
					Статья.ЦенаРуб = Окр(Статья.СуммаРуб/Статья.Количество,2);
				КонецЕсли;
				
			КонецЕсли;   
			
			Статья.Записать(); 
			
			//AFR-260062  
			ИспользуетсяПрогнозированиеДДСПоБюджету = ПолучитьФункциональнуюОпцию("CW_ИспользуетсяПрогнозированиеДДСПоБюджету"); 
			Если ИспользуетсяПрогнозированиеДДСПоБюджету
				И ТипЗнч(Статья.Владелец) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
				ПараметрыРасчета = Новый Структура;
				ПараметрыРасчета.Вставить("ВариантПрогноза", 			Статья.ВариантПрогноза);
				ПараметрыРасчета.Вставить("Владелец", 					Статья.Владелец);
				ПараметрыРасчета.Вставить("ПрогнозКонтрольнаяДата", 	Статья.ПрогнозКонтрольнаяДата);
				ПараметрыРасчета.Вставить("ПрогнозКоличествоДней", 		Статья.ПрогнозКоличествоДней);
				ПараметрыРасчета.Вставить("ПрогнозКоличествоДнейПлан", 	Статья.ПрогнозКоличествоДнейПлан);
				
				ПараметрыРасчета.Вставить("ПрогнозДата",	 			Дата(1,1,1));
				ПараметрыРасчета.Вставить("ДатаНачалаПеревозки", 		Статья.Владелец.ДатаСделкиФ);
				
				ПрогнозДата = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.РассчитатьПрогнозОплатыСтатьиБюджета(ПараметрыРасчета); 
				РегистрыСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета.ЗаписатьПрогнозОплаты(Статья.Ссылка, ПрогнозДата);
			КонецЕсли;
			//---AFR-260062

			
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		Если (ТранзакцияАктивна()) Тогда
			
			ОтменитьТранзакцию();
			Сообщить(ОписаниеОшибки());
			
		КонецЕсли; 
		
	КонецПопытки; 
	
	Если Параметры.ДоходыВРасходы Тогда
		 Ответ = _УФКС.СД("Грузоперевозки","сервер","/БюджетРасходыОбновить");
	Иначе
		 Ответ = _УФКС.СД("Грузоперевозки","сервер","/БюджетДоходыОбновить");
	КонецЕсли;
	
	Возврат Ответ;
	
	// --- 
КонецФункции

&НаСервере
Функция ПересчетСтатейБюджетаПоКурсу(УФ,Параметры)
	// --- 
	
	Если (УФ.БюджетУтвержден) Тогда
		
		Возврат(Неопределено);
		
	КонецЕсли; 
	
	ВидСтатьиБюджета = Параметры.ВидСтатьиБюджета;
	ДатаКурса = Параметры.ДатаКурса;
	ВРУ = CW_Настройки.ВалютаРегламентированногоУчета();
	Если (НЕ ФормаЗаявки(УФ)) Тогда
		Объект = УФ.Объект.Ссылка;
	Иначе
		Объект = УФ.Объект.ВариантБюджета;
	КонецЕсли; 
	
	// --- 
	
	Если (ФормаЗаказа(УФ)) Тогда
		
		Если Значениезаполнено(Параметры.Грузоперевозка) Тогда
			МассивГП = Новый Массив;
			МассивГП.Добавить(Параметры.Грузоперевозка);
		Иначе
			МассивГП = CW_Мониторинг.ГрузоперевозкиЗаказа(Объект);
		КонецЕсли;
		
	Иначе
		
		МассивГП = Новый Массив;
		МассивГП.Добавить(Объект);
		
	КонецЕсли;
	// --- 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияРасходов
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Владелец В(&Владельцы)
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = &ВидСтатьи
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.Валюта <> &ВРУ";
	Запрос.УстановитьПараметр("Владельцы", МассивГП);
	Запрос.УстановитьПараметр("ВерсияБюджета", УФ.БюджетТекущаяВерсия);
	Запрос.УстановитьПараметр("ВидСтатьи", ВидСтатьиБюджета); 
	Запрос.УстановитьПараметр("ВРУ", ВРУ);
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для каждого Стр Из ТЗ Цикл
		
		Статья = Стр.Ссылка.ПолучитьОбъект();
		Статья.ПересчитатьПоКурсуНаДату(ДатаКурса); 
		
		Если Параметры.Свойство("ТипКурсаВалюты") Тогда
			Статья.ТипКурсаВалюты = Параметры.ТипКурсаВалюты;
		КонецЕсли;
		
		Статья.Записать();
		
	КонецЦикла; 
	
	// --- 
	Если (ВидСтатьиБюджета = Перечисления.CW_ВидыСтатейПланирования.Доходы) Тогда
		
		Возврат(_УФКС.СД("Грузоперевозки","сервер","/БюджетДоходыОбновить"));
		
	ИначеЕсли (ВидСтатьиБюджета = Перечисления.CW_ВидыСтатейПланирования.Расходы) Тогда
		
		Возврат(_УФКС.СД("Грузоперевозки","сервер","/БюджетРасходыОбновить"));
		
	КонецЕсли; 
	
	// --- 
КонецФункции

#КонецОбласти 

#Область Финансы 

&НаСервере
Функция ФинансыОбновить(УФ,	Расходы,	Доходы,	Транспорт)
	// --- 
	
	Если (Расходы) Тогда
		ФинансыРасходыОбновить(УФ);	
	КонецЕсли; 
	
	Если (Доходы) Тогда
		ФинансыДоходыОбновить(УФ);	
	КонецЕсли; 
	
	Если Транспорт  Тогда
		ФинансыТранспортОбновить(УФ);	
	КонецЕсли;
	
	ФинансыРезультатОбновить(УФ);
	// --- 
	ФинансыОбновитьИтоги(УФ);
	
	// --- 
КонецФункции
 
&НаСервере
Функция ФинансыОбновитьИтоги(УФ)
	// --- 
	
	ИспользованиеБлокаСобственногоТранспорта = ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокаСобственногоТранспорта");
	
	ФорматВывода = "ЧЦ=15; ЧДЦ=2; ЧН=";
	// --- 
	Сп = Новый СписокЗначений;
	Если (ФормаГрузоперевозки(УФ)) Тогда
		Сп.Добавить(УФ.Объект.Ссылка);
	Иначе
		гп = CW_Мониторинг.ГрузоперевозкиЗаказа(УФ.Объект.Ссылка);
		Для каждого стр  Из гп Цикл
			сп.Добавить(стр);
		КонецЦикла; 
	КонецЕсли; 
	
	ФинРез = CW_Финансы.ПолучитьФинРез(Сп,УФ.ОтображениеФинансовогоРезультата);
	
	СчетаАкты = "";
	Если (УФ.ОтображениеФинансовогоРезультата=0) Тогда
		СчетаАкты = " (по актам)";
		
	// добавлено CW (КС)..
	//--------------------
	ИначеЕсли (УФ.ОтображениеФинансовогоРезультата = 2) Тогда
		СчетаАкты = " (по план. начис.)";
		
	ИначеЕсли (УФ.ОтображениеФинансовогоРезультата = 3) Тогда
		СчетаАкты = " (по актам и план. начис.)";
	
	// конец изменений	
		
	Иначе
		СчетаАкты = " (по счетам)";
	КонецЕсли; 
	
	// Прибыль
	ВыводитьРезультатВБазовойВалюте = Истина;
	ВыводитьРасходыВБазовойВалюте = Истина;
	ВыводитьДоходыВБазовойВалюте = Истина;
	Если (УФ.ВыводитьРезультатВВалютеДокументов) Тогда
		
		// проверяем, что все документы в одной валюте
		ОбщаяВалюта = Справочники.Валюты.ПустаяСсылка();
		ВалютыРасходов = УФ.ФинансыРасходы.Выгрузить(,"Валюта");
		ВалютыРасходов.Свернуть("Валюта"); 
		ВалютыДоходов = УФ.ФинансыДоходы.Выгрузить(,"Валюта");
		ВалютыДоходов.Свернуть("Валюта");
		
		Если ИспользованиеБлокаСобственногоТранспорта и ФормаГрузоперевозки(УФ) Тогда
			ВалютыТранспорт = УФ.ФинансыТранспорт.Выгрузить(,"Валюта");
			ВалютыТранспорт.Свернуть("Валюта");
		КонецЕсли;
		
		Если (ВалютыРасходов.Количество()=1) Тогда
			ВалютаРасходов = ВалютыРасходов[0].Валюта;
			ВыводитьРасходыВБазовойВалюте = Ложь;
		Иначе
			ВалютаРасходов = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли; 
		
		Если (ВалютыДоходов.Количество()=1) Тогда
			ВалютаДоходов = ВалютыДоходов[0].Валюта;
			ВыводитьДоходыВБазовойВалюте = Ложь;
		Иначе
			ВалютаДоходов = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли;
		
		Если ИспользованиеБлокаСобственногоТранспорта и ФормаГрузоперевозки(УФ) Тогда
			Если (ВалютыТранспорт.Количество()=1) Тогда
				ВалютаТранспорт = ВалютыТранспорт[0].Валюта;
				ВыводитьтранспортВБазовойВалюте = Ложь;
			Иначе
				ВалютаТранспорт = Справочники.Валюты.ПустаяСсылка();
			КонецЕсли; 
		КонецЕсли;
	
		Если (ВалютаРасходов = ВалютаДоходов  И НЕ ВалютаРасходов.Пустая()) Тогда
			ВыводитьРезультатВБазовойВалюте=Ложь;
			ОбщаяВалюта = ВалютаРасходов;
		ИначеЕсли (ВалютаРасходов.Пустая()  И НЕ ВалютаДоходов.Пустая() И ВалютыРасходов.Количество()=0) Тогда 
			ВыводитьРезультатВБазовойВалюте=Ложь;
			ОбщаяВалюта = ВалютаДоходов;
		ИначеЕсли (НЕ ВалютаРасходов.Пустая() И ВалютаДоходов.Пустая() И ВалютыДоходов.Количество()=0) Тогда 
			ВыводитьРезультатВБазовойВалюте=Ложь;
			ОбщаяВалюта = ВалютаРасходов;
		КонецЕсли; 
		
	КонецЕсли;
	
	// ---------------------------------------------------------------------------- 
	
	Если (ВыводитьРасходыВБазовойВалюте) Тогда
		
		// Расходы
		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога , "Расходы"+СчетаАкты+": " + Формат(ФинРез.Итог("РасходыВсего"), ФорматВывода) + " " + Строка(УФ.ВРУ));
		_сф.стр_Добавить(ТекстИтога , ", " + "расходы без НДС: " + Формат(ФинРез.Итог("РасходыСумма"), ФорматВывода) + " " + Строка(УФ.ВРУ));
		
	Иначе
		
		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога , "Расходы"+СчетаАкты+": " + Формат(ФинРез.Итог("РасходыВсегоВалюта"), ФорматВывода) + " " + Строка(ВалютаРасходов));
		
	КонецЕсли; 
	УФ.Элементы.РасходыИтого.Заголовок = ТекстИтога;
	
	// --- 
	
	Если (ВыводитьДоходыВБазовойВалюте) Тогда
		
		// Доходы
		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога, "Доходы"+СчетаАкты+": " + Формат(ФинРез.Итог("ДоходыВсего"), ФорматВывода) + " " + Строка(УФ.ВРУ));
		_сф.стр_Добавить(ТекстИтога, ", " + "доходы без НДС: " + Формат(ФинРез.Итог("ДоходыСумма"), ФорматВывода) + " " + Строка(УФ.ВРУ));
		
	Иначе
		
		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога, "Доходы"+СчетаАкты+": " + Формат(ФинРез.Итог("ДоходыВсегоВалюта"), ФорматВывода) + " " + Строка(ВалютаДоходов));
		
	КонецЕсли; 
	УФ.Элементы.ДоходыИтого.Заголовок = ТекстИтога;
	
	// --- 
	Если ФормаГрузоперевозки(УФ) Тогда
		
		Если ИспользованиеБлокаСобственногоТранспорта Тогда
			
			Если (ВыводитьДоходыВБазовойВалюте) Тогда
				
				// Транспорт
				ТекстИтога = "";
				_сф.стр_Добавить(ТекстИтога, "транспортные расходы: " + Формат(ФинРез.Итог("ТранспортВсего"), ФорматВывода) + " " + Строка(УФ.ВРУ));
				_сф.стр_Добавить(ТекстИтога, ", " + "транспорт без НДС: " + Формат(ФинРез.Итог("ТранспортСумма"), ФорматВывода) + " " + Строка(УФ.ВРУ));
				
			Иначе
				
				ТекстИтога = "";
				_сф.стр_Добавить(ТекстИтога, "транспортные расходы: " + Формат(ФинРез.Итог("ТранспортВсегоВалюта"), ФорматВывода) + " " + Строка(ВалютаТранспорт));
				
			КонецЕсли; 
			УФ.Элементы.ФинансыТранспортИтого.Заголовок = ТекстИтога;
			
		КонецЕсли;
		
	КонецЕсли;

	// --- 
	
	Если (ВыводитьРезультатВБазовойВалюте) Тогда
		
		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога, "Прибыль"+СчетаАкты+": " + Формат(ФинРез.Итог("ПрибыльВсего") - ?(ИспользованиеБлокаСобственногоТранспорта,ФинРез.Итог("ТранспортВсего"),0), ФорматВывода) + " " + Строка(УФ.ВРУ));
		_сф.стр_Добавить(ТекстИтога, ", "+"прибыль без НДС: " + Формат(ФинРез.Итог("ПрибыльСумма") - ?(ИспользованиеБлокаСобственногоТранспорта,ФинРез.Итог("ТранспортСумма"),0), ФорматВывода) + " " + Строка(УФ.ВРУ));
		
	Иначе
		
		ТекстИтога = "";
		_сф.стр_Добавить(ТекстИтога, "Прибыль"+СчетаАкты+": " + Формат(ФинРез.Итог("ПрибыльВсегоВалюта")- ?(ИспользованиеБлокаСобственногоТранспорта,ФинРез.Итог("ТранспортВсегоВалюта"),0), ФорматВывода) + " " + Строка(ОбщаяВалюта));
		
	КонецЕсли; 
	УФ.Элементы.ФинансовыйРезультатИтого.Заголовок = ТекстИтога;	
	
	// --- 
КонецФункции

&НаСервере
Функция ФинансыРасходыОбновить(УФ)
	// --- 
	
	Если (CW_Конфигурация.КонфигурацияДляРФ()) Тогда
		
		// формируем ТЗ затрат
		Если (ФормаГрузоперевозки(УФ)) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	CW_РасходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
			               |	CW_РасходыПоГрузоперевозкам.Контрагент КАК Контрагент,
			               |	CW_РасходыПоГрузоперевозкам.Договор КАК Договор,
			               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов КАК Документ,
			               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредставлениеДокумента КАК ПредставлениеДокумента,
			               |	CW_РасходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
			               |	CW_РасходыПоГрузоперевозкам.Валюта КАК Валюта,
			               |	НЕ CW_РасходыПоГрузоперевозкам.ЭтоАкт КАК ЭтоСчет,
			               |	CW_РасходыПоГрузоперевозкам.Всего_Валюта КАК ВсегоВал,
			               |	CW_РасходыПоГрузоперевозкам.Всего КАК Всего,
			               |	CW_РасходыПоГрузоперевозкам.Сумма КАК Сумма,
			               |	CW_РасходыПоГрузоперевозкам.НДС КАК НДС,
			               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов.Дата КАК Дата,
			               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов.Организация КАК Организация,
			               |	CW_ОтсутствующиеОригиналыДокументов.Документ КАК ДокументБезОригиналов,
			               |	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток КАК НеактированныйОстаток,
			               |	ЕСТЬNULL(CW_СтатусыДокументовСрезПоследних.СтатусДокумента, НЕОПРЕДЕЛЕНО) КАК СтатусДокумента,
			               |	ЕСТЬNULL(CW_НаличиеФайловАрхиваПоОбъектам.Признак, ЛОЖЬ) КАК Файлы
			               |ПОМЕСТИТЬ ВТ
			               |ИЗ
			               |	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ОтсутствующиеОригиналыДокументов КАК CW_ОтсутствующиеОригиналыДокументов
			               |		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_ОтсутствующиеОригиналыДокументов.Документ
			               |			И CW_РасходыПоГрузоперевозкам.Контрагент = CW_ОтсутствующиеОригиналыДокументов.Контрагент
			               |			И CW_РасходыПоГрузоперевозкам.Договор = CW_ОтсутствующиеОригиналыДокументов.Договор
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.CW_АктированиеВходящихСчетов.Остатки(&ТД, Грузоперевозка = &Грузоперевозка) КАК CW_АктированиеВходящихСчетовОстатки
			               |		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_АктированиеВходящихСчетовОстатки.Счет
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СтатусыДокументов.СрезПоследних КАК CW_СтатусыДокументовСрезПоследних
			               |		ПО (CW_РасходыПоГрузоперевозкам.ДокументРасходов = (ВЫРАЗИТЬ(CW_СтатусыДокументовСрезПоследних.Документ КАК Документ.CW_РасходыПоГрузоперевозке)))
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_НаличиеФайловАрхиваПоОбъектам КАК CW_НаличиеФайловАрхиваПоОбъектам
			               |		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_НаличиеФайловАрхиваПоОбъектам.Объект
			               |ГДЕ
			               |	CW_РасходыПоГрузоперевозкам.Грузоперевозка = &Грузоперевозка
			               |	И CW_РасходыПоГрузоперевозкам.Регистратор.ПометкаУдаления = ЛОЖЬ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ.Грузоперевозка КАК Грузоперевозка,
			               |	ВТ.Контрагент КАК Контрагент,
			               |	ВТ.Договор КАК Договор,
			               |	ВТ.Документ КАК Документ,
			               |	ВТ.ПредставлениеДокумента КАК ПредставлениеДокумента,
			               |	ВТ.Номенклатура КАК Номенклатура,
			               |	ВТ.Валюта КАК Валюта,
			               |	ВТ.ЭтоСчет КАК ЭтоСчет,
			               |	ВТ.ВсегоВал КАК ВсегоВал,
			               |	ВТ.Всего КАК Всего,
			               |	ВТ.Сумма КАК Сумма,
			               |	ВТ.НДС КАК НДС,
			               |	ВТ.Дата КАК Дата,
			               |	ВТ.Организация КАК Организация,
			               |	ВЫБОР
			               |		КОГДА ЕСТЬNULL(ВТ.ДокументБезОригиналов, ИСТИНА) = ИСТИНА
			               |			ТОГДА ИСТИНА
			               |		ИНАЧЕ ЛОЖЬ
			               |	КОНЕЦ КАК ОригиналыПредоставлены,
			               |	ВТ.НеактированныйОстаток КАК НеактированныйОстаток,
			               |	ВТ.СтатусДокумента КАК СтатусДокумента,
			               |	ВТ.Файлы КАК Файлы
			               |ИЗ
			               |	ВТ КАК ВТ
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ВТ.Контрагент,
			               |	ВТ.Договор,
			               |	ВТ.Документ,
			               |	ВТ.Номенклатура,
			               |	ВТ.Валюта,
			               |	ВТ.Грузоперевозка,
			               |	ВТ.ЭтоСчет";
			Запрос.УстановитьПараметр("Грузоперевозка", УФ.Объект.Ссылка);
			Запрос.УстановитьПараметр("ТД", ТекущаяДата()); 
			ТЗ = Запрос.Выполнить().Выгрузить();
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	CW_РасходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
			               |	CW_РасходыПоГрузоперевозкам.Контрагент КАК Контрагент,
			               |	CW_РасходыПоГрузоперевозкам.Договор КАК Договор,
			               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов КАК Документ,
			               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредставлениеДокумента КАК ПредставлениеДокумента,
			               |	CW_РасходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
			               |	CW_РасходыПоГрузоперевозкам.Валюта КАК Валюта,
			               |	НЕ CW_РасходыПоГрузоперевозкам.ЭтоАкт КАК ЭтоСчет,
			               |	CW_РасходыПоГрузоперевозкам.Всего_Валюта КАК ВсегоВал,
			               |	CW_РасходыПоГрузоперевозкам.Всего КАК Всего,
			               |	CW_РасходыПоГрузоперевозкам.Сумма КАК Сумма,
			               |	CW_РасходыПоГрузоперевозкам.НДС КАК НДС,
			               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов.Дата КАК Дата,
			               |	CW_РасходыПоГрузоперевозкам.ДокументРасходов.Организация КАК Организация,
			               |	CW_ОтсутствующиеОригиналыДокументов.Документ КАК ДокументБезОригиналов,
			               |	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток КАК НеактированныйОстаток,
			               |	ЕСТЬNULL(CW_СтатусыДокументовСрезПоследних.СтатусДокумента, НЕОПРЕДЕЛЕНО) КАК СтатусДокумента,
			               |	ЕСТЬNULL(CW_НаличиеФайловАрхиваПоОбъектам.Признак, ЛОЖЬ) КАК Файлы
			               |ПОМЕСТИТЬ ВТ
			               |ИЗ
			               |	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ОтсутствующиеОригиналыДокументов КАК CW_ОтсутствующиеОригиналыДокументов
			               |		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_ОтсутствующиеОригиналыДокументов.Документ
			               |			И CW_РасходыПоГрузоперевозкам.Контрагент = CW_ОтсутствующиеОригиналыДокументов.Контрагент
			               |			И CW_РасходыПоГрузоперевозкам.Договор = CW_ОтсутствующиеОригиналыДокументов.Договор
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.CW_АктированиеВходящихСчетов.Остатки(
			               |				&ТД,
			               |				Грузоперевозка В
			               |					(ВЫБРАТЬ
			               |						Справочник.CW_Грузоперевозки.Ссылка
			               |					ИЗ
			               |						Справочник.CW_Грузоперевозки
			               |					ГДЕ
			               |						Справочник.CW_Грузоперевозки.Заказ = &Ссылка)) КАК CW_АктированиеВходящихСчетовОстатки
			               |		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_АктированиеВходящихСчетовОстатки.Счет
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СтатусыДокументов.СрезПоследних КАК CW_СтатусыДокументовСрезПоследних
			               |		ПО (CW_РасходыПоГрузоперевозкам.ДокументРасходов = (ВЫРАЗИТЬ(CW_СтатусыДокументовСрезПоследних.Документ КАК Документ.CW_РасходыПоГрузоперевозке)))
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_НаличиеФайловАрхиваПоОбъектам КАК CW_НаличиеФайловАрхиваПоОбъектам
			               |		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_НаличиеФайловАрхиваПоОбъектам.Объект
			               |ГДЕ
			               |	CW_РасходыПоГрузоперевозкам.Грузоперевозка В
			               |			(ВЫБРАТЬ
			               |				Справочник.CW_Грузоперевозки.Ссылка
			               |			ИЗ
			               |				Справочник.CW_Грузоперевозки
			               |			ГДЕ
			               |				Справочник.CW_Грузоперевозки.Заказ = &Ссылка)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ.Грузоперевозка КАК Грузоперевозка,
			               |	ВТ.Контрагент КАК Контрагент,
			               |	ВТ.Договор КАК Договор,
			               |	ВТ.Документ КАК Документ,
			               |	ВТ.ПредставлениеДокумента КАК ПредставлениеДокумента,
			               |	ВТ.Номенклатура КАК Номенклатура,
			               |	ВТ.Валюта КАК Валюта,
			               |	ВТ.ЭтоСчет КАК ЭтоСчет,
			               |	ВТ.ВсегоВал КАК ВсегоВал,
			               |	ВТ.Всего КАК Всего,
			               |	ВТ.Сумма КАК Сумма,
			               |	ВТ.НДС КАК НДС,
			               |	ВТ.Дата КАК Дата,
			               |	ВТ.Организация КАК Организация,
			               |	ВЫБОР
			               |		КОГДА ЕСТЬNULL(ВТ.ДокументБезОригиналов, ИСТИНА) = ИСТИНА
			               |			ТОГДА ИСТИНА
			               |		ИНАЧЕ ЛОЖЬ
			               |	КОНЕЦ КАК ОригиналыПредоставлены,
			               |	ВТ.НеактированныйОстаток КАК НеактированныйОстаток,
			               |	ВТ.СтатусДокумента КАК СтатусДокумента,
			               |	ВТ.Файлы КАК Файлы
			               |ИЗ
			               |	ВТ КАК ВТ
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ВТ.Контрагент,
			               |	ВТ.Договор,
			               |	ВТ.Документ,
			               |	ВТ.Номенклатура,
			               |	ВТ.Валюта,
			               |	ВТ.Грузоперевозка,
			               |	ВТ.ЭтоСчет";
			Запрос.УстановитьПараметр("Ссылка", ?(ЗначениеЗаполнено(УФ.Объект.Ссылка), УФ.Объект.Ссылка, Неопределено));
			Запрос.УстановитьПараметр("ТД", ТекущаяДата()); 
			ТЗ = Запрос.Выполнить().Выгрузить();
			
		КонецЕсли; 
		
		// анализируем, надо ли разворачивать постатейно
		Если (УФ.ФинансыРасходыОтображатьПостатейно) Тогда
			ТЗ.Свернуть("Контрагент,Организация,Документ,Дата,ПредставлениеДокумента,Валюта,Номенклатура,ЭтоСчет,ОригиналыПредоставлены,ПредставлениеДокумента,СтатусДокумента,Файлы","ВсегоВал,Всего,Сумма,НДС,НеактированныйОстаток");
		Иначе
			ТЗ.Свернуть("Контрагент,Организация,Документ,Дата,ПредставлениеДокумента,Валюта,ЭтоСчет,ОригиналыПредоставлены,ПредставлениеДокумента,СтатусДокумента,Файлы","ВсегоВал,Всего,Сумма,НДС,НеактированныйОстаток");
		КонецЕсли; 
		ТЗ.Сортировать("Дата Возр");
		УФ.Элементы.РасходыНоменклатура.Видимость = УФ.ФинансыРасходыОтображатьПостатейно;
		
		УФ.ФинансыРасходы.Загрузить(ТЗ);
		
		// количество документов
		ТЗД = ТЗ.Скопировать(,"Документ");
		ТЗД.Свернуть("Документ");
		КоличествоЗатратных = ТЗД.Количество();
		УФ.Элементы.ГруппаРасходы.Заголовок = "Расходы"+?(КоличествоЗатратных=0,""," ("+Строка(КоличествоЗатратных)+")");
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	Если (CW_Конфигурация.КонфигурацияДляРК()) Тогда
		
		// формируем ТЗ затрат
		Если (ФормаГрузоперевозки(УФ)) Тогда
			
			Запрос = Новый Запрос;
			
			// отредактировано CW (КС)..
			//--------------------------
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	CW_РасходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
			|	CW_РасходыПоГрузоперевозкам.Контрагент КАК Контрагент,
			|	CW_РасходыПоГрузоперевозкам.Договор КАК Договор,
			|	CW_РасходыПоГрузоперевозкам.ДокументРасходов КАК Документ,
			|	CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредставлениеДокумента КАК ПредставлениеДокумента,
			|	CW_РасходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
			|	CW_РасходыПоГрузоперевозкам.Валюта КАК Валюта,
			|	НЕ CW_РасходыПоГрузоперевозкам.ЭтоАкт КАК ЭтоСчет,
			|	CW_РасходыПоГрузоперевозкам.Всего_Валюта КАК ВсегоВал,
			|	CW_РасходыПоГрузоперевозкам.Всего КАК Всего,
			|	CW_РасходыПоГрузоперевозкам.Сумма КАК Сумма,
			|	CW_РасходыПоГрузоперевозкам.НДС КАК НДС,
			|	CW_РасходыПоГрузоперевозкам.ДокументРасходов.Дата КАК Дата,
			|	CW_РасходыПоГрузоперевозкам.ДокументРасходов.Организация КАК Организация,
			|	CW_ОтсутствующиеОригиналыДокументов.Документ КАК ДокументБезОригиналов,
			|	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток КАК НеактированныйОстаток,
			|	ЕСТЬNULL(CW_СтатусыДокументовСрезПоследних.СтатусДокумента, НЕОПРЕДЕЛЕНО) КАК СтатусДокумента,
			|	CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПлановоеНачисление КАК ПлановоеНачисление
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ОтсутствующиеОригиналыДокументов КАК CW_ОтсутствующиеОригиналыДокументов
			|		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_ОтсутствующиеОригиналыДокументов.Документ
			|			И CW_РасходыПоГрузоперевозкам.Контрагент = CW_ОтсутствующиеОригиналыДокументов.Контрагент
			|			И CW_РасходыПоГрузоперевозкам.Договор = CW_ОтсутствующиеОригиналыДокументов.Договор
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.CW_АктированиеВходящихСчетов.Остатки(&ТД, Грузоперевозка = &Грузоперевозка) КАК CW_АктированиеВходящихСчетовОстатки
			|		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_АктированиеВходящихСчетовОстатки.Счет
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СтатусыДокументов.СрезПоследних КАК CW_СтатусыДокументовСрезПоследних
			|		ПО (CW_РасходыПоГрузоперевозкам.ДокументРасходов = (ВЫРАЗИТЬ(CW_СтатусыДокументовСрезПоследних.Документ КАК Документ.CW_РасходыПоГрузоперевозке)))
			|ГДЕ
			|	CW_РасходыПоГрузоперевозкам.Грузоперевозка = &Грузоперевозка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	CW_РасходыПоГрузоперевозкамПлан.Грузоперевозка,
			|	CW_РасходыПоГрузоперевозкамПлан.Контрагент,
			|	CW_РасходыПоГрузоперевозкамПлан.Договор,
			|	CW_РасходыПоГрузоперевозкамПлан.ДокументРасходов,
			|	CW_РасходыПоГрузоперевозкамПлан.ДокументРасходов.ПредставлениеДокумента,
			|	CW_РасходыПоГрузоперевозкамПлан.Номенклатура,
			|	CW_РасходыПоГрузоперевозкамПлан.Валюта,
			|	НЕ CW_РасходыПоГрузоперевозкамПлан.ЭтоАкт,
			|	CW_РасходыПоГрузоперевозкамПлан.Всего_Валюта,
			|	CW_РасходыПоГрузоперевозкамПлан.Всего,
			|	CW_РасходыПоГрузоперевозкамПлан.Сумма,
			|	CW_РасходыПоГрузоперевозкамПлан.НДС,
			|	CW_РасходыПоГрузоперевозкамПлан.ДокументРасходов.Дата,
			|	CW_РасходыПоГрузоперевозкамПлан.ДокументРасходов.Организация,
			|	NULL,
			|	0,
			|	CW_РасходыПоГрузоперевозкамПлан.ДокументРасходов.ПлановоеНачисление
			|ИЗ
			|	РегистрНакопления.CW_РасходыПоГрузоперевозкамПлан КАК CW_РасходыПоГрузоперевозкамПлан
			|ГДЕ
			|	CW_РасходыПоГрузоперевозкамПлан.Грузоперевозка = &Грузоперевозка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Грузоперевозка,
			|	ВТ.Контрагент,
			|	ВТ.Договор,
			|	ВТ.Документ,
			|	ВТ.ПредставлениеДокумента,
			|	ВТ.Номенклатура,
			|	ВТ.Валюта,
			|	ВТ.ЭтоСчет,
			|	ВТ.ВсегоВал,
			|	ВТ.Всего,
			|	ВТ.Сумма,
			|	ВТ.НДС,
			|	ВТ.Дата,
			|	ВТ.Организация,
			|	ВТ.СтатусДокумента,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ.ДокументБезОригиналов, ИСТИНА) = ИСТИНА
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ОригиналыПредоставлены,
			|	ВТ.НеактированныйОстаток,
			|	ВТ.ПлановоеНачисление
			|ИЗ
			|	ВТ КАК ВТ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВТ.Контрагент,
			|	ВТ.Договор,
			|	ВТ.Документ,
			|	ВТ.Номенклатура,
			|	ВТ.Валюта,
			|	ВТ.Грузоперевозка,
			|	ВТ.ЭтоСчет";
			Запрос.УстановитьПараметр("Грузоперевозка", УФ.Объект.Ссылка);
			Запрос.УстановитьПараметр("ТД", ТекущаяДата()); 
			ТЗ = Запрос.Выполнить().Выгрузить();
			
		Иначе
			
			Запрос = Новый Запрос;
			
			// отредактировано CW (КС)..
			//--------------------------
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	CW_РасходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
			|	CW_РасходыПоГрузоперевозкам.Контрагент КАК Контрагент,
			|	CW_РасходыПоГрузоперевозкам.Договор КАК Договор,
			|	CW_РасходыПоГрузоперевозкам.ДокументРасходов КАК Документ,
			|	CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредставлениеДокумента КАК ПредставлениеДокумента,
			|	CW_РасходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
			|	CW_РасходыПоГрузоперевозкам.Валюта КАК Валюта,
			|	Не CW_РасходыПоГрузоперевозкам.ЭтоАкт КАК ЭтоСчет,
			|	CW_РасходыПоГрузоперевозкам.Всего_Валюта КАК ВсегоВал,
			|	CW_РасходыПоГрузоперевозкам.Всего КАК Всего,
			|	CW_РасходыПоГрузоперевозкам.Сумма КАК Сумма,
			|	CW_РасходыПоГрузоперевозкам.НДС КАК НДС,
			|	CW_РасходыПоГрузоперевозкам.ДокументРасходов.Дата КАК Дата,
			|	CW_РасходыПоГрузоперевозкам.ДокументРасходов.Организация КАК Организация,
			|	CW_ОтсутствующиеОригиналыДокументов.Документ КАК ДокументБезОригиналов,
			|	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток КАК НеактированныйОстаток,
			|	ЕСТЬNULL(CW_СтатусыДокументовСрезПоследних.СтатусДокумента, НЕОПРЕДЕЛЕНО) КАК СтатусДокумента,
			|	CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПлановоеНачисление КАК ПлановоеНачисление
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ОтсутствующиеОригиналыДокументов КАК CW_ОтсутствующиеОригиналыДокументов
			|		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_ОтсутствующиеОригиналыДокументов.Документ
			|			И CW_РасходыПоГрузоперевозкам.Контрагент = CW_ОтсутствующиеОригиналыДокументов.Контрагент
			|			И CW_РасходыПоГрузоперевозкам.Договор = CW_ОтсутствующиеОригиналыДокументов.Договор
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.CW_АктированиеВходящихСчетов.Остатки(
			|				&ТД,
			|				Грузоперевозка В
			|					(ВЫБРАТЬ
			|						Справочник.CW_Грузоперевозки.Ссылка
			|					ИЗ
			|						Справочник.CW_Грузоперевозки
			|					ГДЕ
			|						Справочник.CW_Грузоперевозки.Заказ = &Ссылка)) КАК CW_АктированиеВходящихСчетовОстатки
			|		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_АктированиеВходящихСчетовОстатки.Счет
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СтатусыДокументов.СрезПоследних КАК CW_СтатусыДокументовСрезПоследних
			|		ПО (CW_РасходыПоГрузоперевозкам.ДокументРасходов = (ВЫРАЗИТЬ(CW_СтатусыДокументовСрезПоследних.Документ КАК Документ.CW_РасходыПоГрузоперевозке)))
			|ГДЕ
			|	CW_РасходыПоГрузоперевозкам.Грузоперевозка В
			|			(ВЫБРАТЬ
			|				Справочник.CW_Грузоперевозки.Ссылка
			|			ИЗ
			|				Справочник.CW_Грузоперевозки
			|			ГДЕ
			|				Справочник.CW_Грузоперевозки.Заказ = &Ссылка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	CW_РасходыПоГрузоперевозкамПлан.Грузоперевозка,
			|	CW_РасходыПоГрузоперевозкамПлан.Контрагент,
			|	CW_РасходыПоГрузоперевозкамПлан.Договор,
			|	CW_РасходыПоГрузоперевозкамПлан.ДокументРасходов,
			|	CW_РасходыПоГрузоперевозкамПлан.ДокументРасходов.ПредставлениеДокумента,
			|	CW_РасходыПоГрузоперевозкамПлан.Номенклатура,
			|	CW_РасходыПоГрузоперевозкамПлан.Валюта,
			|	CW_РасходыПоГрузоперевозкамПлан.ЭтоСчет,
			|	CW_РасходыПоГрузоперевозкамПлан.Всего_Валюта,
			|	CW_РасходыПоГрузоперевозкамПлан.Всего,
			|	CW_РасходыПоГрузоперевозкамПлан.Сумма,
			|	CW_РасходыПоГрузоперевозкамПлан.НДС,
			|	CW_РасходыПоГрузоперевозкамПлан.ДокументРасходов.Дата,
			|	CW_РасходыПоГрузоперевозкамПлан.ДокументРасходов.Организация,
			|	NULL,
			|	0,
			|	CW_РасходыПоГрузоперевозкамПлан.ДокументРасходов.ПлановоеНачисление
			|ИЗ
			|	РегистрНакопления.CW_РасходыПоГрузоперевозкамПлан КАК CW_РасходыПоГрузоперевозкамПлан
			|ГДЕ
			|	CW_РасходыПоГрузоперевозкамПлан.Грузоперевозка В
			|			(ВЫБРАТЬ
			|				Справочник.CW_Грузоперевозки.Ссылка
			|			ИЗ
			|				Справочник.CW_Грузоперевозки
			|			ГДЕ
			|				Справочник.CW_Грузоперевозки.Заказ = &Ссылка)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Грузоперевозка,
			|	ВТ.Контрагент,
			|	ВТ.Договор,
			|	ВТ.Документ,
			|	ВТ.ПредставлениеДокумента,
			|	ВТ.Номенклатура,
			|	ВТ.Валюта,
			|	ВТ.ЭтоСчет,
			|	ВТ.ВсегоВал,
			|	ВТ.Всего,
			|	ВТ.Сумма,
			|	ВТ.НДС,
			|	ВТ.Дата,
			|	ВТ.Организация,
			|	ВТ.СтатусДокумента,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ.ДокументБезОригиналов, ИСТИНА) = ИСТИНА
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ОригиналыПредоставлены,
			|	ВТ.НеактированныйОстаток,
			|	ВТ.ПлановоеНачисление
			|ИЗ
			|	ВТ КАК ВТ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВТ.Контрагент,
			|	ВТ.Договор,
			|	ВТ.Документ,
			|	ВТ.Номенклатура,
			|	ВТ.Валюта,
			|	ВТ.Грузоперевозка,
			|	ВТ.ЭтоСчет";
			Запрос.УстановитьПараметр("Ссылка", ?(ЗначениеЗаполнено(УФ.Объект.Ссылка), УФ.Объект.Ссылка, Неопределено));
			Запрос.УстановитьПараметр("ТД", ТекущаяДата()); 
			ТЗ = Запрос.Выполнить().Выгрузить();
			
		КонецЕсли; 
		
		// отредактировано CW (КС)..
		//--------------------------
		// анализируем, надо ли разворачивать постатейно
		Если (УФ.ФинансыРасходыОтображатьПостатейно) Тогда
			ТЗ.Свернуть("Контрагент,Организация,Документ,Дата,ПредставлениеДокумента,Валюта,Номенклатура,ЭтоСчет,ОригиналыПредоставлены,ПредставлениеДокумента,СтатусДокумента,ПлановоеНачисление","ВсегоВал,Всего,Сумма,НДС,НеактированныйОстаток");
		Иначе
			ТЗ.Свернуть("Контрагент,Организация,Документ,Дата,ПредставлениеДокумента,Валюта,ЭтоСчет,ОригиналыПредоставлены,ПредставлениеДокумента,СтатусДокумента,ПлановоеНачисление","ВсегоВал,Всего,Сумма,НДС,НеактированныйОстаток");
		КонецЕсли; 
		ТЗ.Сортировать("Дата Возр");
		УФ.Элементы.РасходыНоменклатура.Видимость = УФ.ФинансыРасходыОтображатьПостатейно;
		
		УФ.ФинансыРасходы.Загрузить(ТЗ);
		
		// количество документов
		ТЗД = ТЗ.Скопировать(,"Документ");
		ТЗД.Свернуть("Документ");
		КоличествоЗатратных = ТЗД.Количество();
		УФ.Элементы.ГруппаРасходы.Заголовок = "Расходы"+?(КоличествоЗатратных=0,""," ("+Строка(КоличествоЗатратных)+")");
		
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Процедура ФинансыТранспортОбновить(УФ)
	
	ЭтоФормаГрузоперевозки 	= ФормаГрузоперевозки(УФ);
	ЭтоФормаЗаказа			= ФормаЗаказа(УФ);
	
	Если ЭтоФормаГрузоперевозки ИЛИ ЭтоФормаЗаказа Тогда
		
		ИспользованиеБлокаСобственногоТранспорта 		= ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокаСобственногоТранспорта");
		
		УФ.Элементы.ГруппаФинансыТранспорт.Видимость 	= ИспользованиеБлокаСобственногоТранспорта;
		
		Если ЭтоФормаГрузоперевозки Тогда
			УсловиеОтбора = "Грузоперевозка = &ОбъектОтбора";
		КонецЕсли;
		Если ЭтоФормаЗаказа Тогда
			УсловиеОтбора = "Грузоперевозка.Заказ = &ОбъектОтбора";
		КонецЕсли;
		
		// формируем ТЗ затрат
		Если ИспользованиеБлокаСобственногоТранспорта Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.ПутевойЛист КАК ПутевойЛист,
			               |	CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.ДокументРасходов КАК ДокументРасходов,
			               |	CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.Номенклатура КАК Номенклатура,
			               |	CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.СтатьяЗатрат КАК СтатьяЗатрат,
			               |	CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.Валюта КАК Валюта,
			               |	НЕ CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.ЭтоАкт КАК ЭтоСчет,
			               |	СУММА(CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.ВсегоОборот) КАК Всего,
			               |	СУММА(CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.СуммаОборот) КАК Сумма,
			               |	СУММА(CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.НДСОборот) КАК НДС,
			               |	СУММА(CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.Всего_ВалютаОборот) КАК ВсегоВал
			               |ИЗ
			               |	РегистрНакопления.CW_РасходыПоГрузоперевозкамТранспортныхСредств.Обороты(, , Период, "+УсловиеОтбора+") КАК CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.ДокументРасходов,
			               |	CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.ПутевойЛист,
			               |	CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.Номенклатура,
			               |	CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.СтатьяЗатрат,
			               |	CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.Валюта,
			               |	CW_РасходыПоГрузоперевозкамтранспортныхСредствОбороты.ЭтоАкт";
			
			Запрос.УстановитьПараметр("ОбъектОтбора", УФ.Объект.Ссылка);
			                                                                       
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				
				УФ.Элементы.ГруппаФинансыТранспорт.Видимость = Ложь;
				Возврат;
				
			КонецЕсли;
			
			ТЗ = РезультатЗапроса.Выгрузить();
			
			// анализируем, надо ли разворачивать постатейно
			Если (УФ.ФинансыТранспортОтображатьПостатейно) Тогда
				ТЗ.Свернуть("ПутевойЛист,ДокументРасходов,Номенклатура,СтатьяЗатрат,Валюта,ЭтоСчет","Всего,Сумма,Сумма,НДС,ВсегоВал");
			Иначе
				ТЗ.Свернуть("ПутевойЛист,ДокументРасходов,СтатьяЗатрат,Валюта,ЭтоСчет","Всего,Сумма,Сумма,НДС,ВсегоВал");
			КонецЕсли; 
			ТЗ.Сортировать("ПутевойЛист Возр");
			
			УФ.Элементы.ФинансыТранспортНоменклатура.Видимость = УФ.ФинансыТранспортОтображатьПостатейно;
			
			УФ.ФинансыТранспорт.Загрузить(ТЗ);
			
			// количество документов
			ТЗД = ТЗ.Скопировать(,"ДокументРасходов");
			ТЗД.Свернуть("ДокументРасходов");
			КоличествоЗатратных = ТЗД.Количество();
			УФ.Элементы.ГруппаФинансыТранспорт.Заголовок = "Транспорт "+?(КоличествоЗатратных=0,""," ("+Строка(КоличествоЗатратных)+")");
			
		КонецЕсли; 		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ФинансыДоходыОбновить(УФ)
	
	Если (ФормаГрузоперевозки(УФ)) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	CW_ДоходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
		               |	CW_ДоходыПоГрузоперевозкам.Контрагент КАК Контрагент,
		               |	CW_ДоходыПоГрузоперевозкам.Договор КАК Договор,
		               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов КАК Документ,
		               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ПредставлениеДокумента КАК ПредставлениеДокумента,
		               |	CW_ДоходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
		               |	CW_ДоходыПоГрузоперевозкам.Валюта КАК Валюта,
		               |	НЕ CW_ДоходыПоГрузоперевозкам.ЭтоАкт КАК ЭтоСчет,
		               |	CW_ДоходыПоГрузоперевозкам.Всего_Валюта КАК ВсегоВал,
		               |	CW_ДоходыПоГрузоперевозкам.Всего КАК Всего,
		               |	CW_ДоходыПоГрузоперевозкам.Сумма КАК Сумма,
		               |	CW_ДоходыПоГрузоперевозкам.НДС КАК НДС,
		               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Дата КАК Дата,
		               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Организация КАК Организация,
		               |	CW_ОтсутствующиеОригиналыДокументов.Документ КАК ДокументБезОригиналов,
		               |	CW_АктированиеИсходящихСчетовОстатки.ВсегоОстаток КАК НеактированныйОстаток,
		               |	ЕСТЬNULL(CW_НаличиеФайловАрхиваПоОбъектам.Признак, ЛОЖЬ) КАК Файлы,
		               |	ЕСТЬNULL(CW_СтатусыДокументовСрезПоследних.СтатусДокумента, НЕОПРЕДЕЛЕНО) КАК СтатусДокумента
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ОтсутствующиеОригиналыДокументов КАК CW_ОтсутствующиеОригиналыДокументов
		               |		ПО CW_ДоходыПоГрузоперевозкам.ДокументДоходов = CW_ОтсутствующиеОригиналыДокументов.Документ
		               |			И CW_ДоходыПоГрузоперевозкам.Контрагент = CW_ОтсутствующиеОригиналыДокументов.Контрагент
		               |			И CW_ДоходыПоГрузоперевозкам.Договор = CW_ОтсутствующиеОригиналыДокументов.Договор
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.CW_АктированиеИсходящихСчетов.Остатки(&ТД, Грузоперевозка = &Грузоперевозка) КАК CW_АктированиеИсходящихСчетовОстатки
		               |		ПО CW_ДоходыПоГрузоперевозкам.ДокументДоходов = CW_АктированиеИсходящихСчетовОстатки.Счет
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_НаличиеФайловАрхиваПоОбъектам КАК CW_НаличиеФайловАрхиваПоОбъектам
		               |		ПО CW_ДоходыПоГрузоперевозкам.ДокументДоходов = CW_НаличиеФайловАрхиваПоОбъектам.Объект
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СтатусыДокументов.СрезПоследних КАК CW_СтатусыДокументовСрезПоследних
		               |		ПО (CW_ДоходыПоГрузоперевозкам.ДокументДоходов = (ВЫРАЗИТЬ(CW_СтатусыДокументовСрезПоследних.Документ КАК Документ.CW_ДоходыПоГрузоперевозке)))
		               |ГДЕ
		               |	CW_ДоходыПоГрузоперевозкам.Грузоперевозка = &Грузоперевозка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Грузоперевозка КАК Грузоперевозка,
		               |	ВТ.Контрагент КАК Контрагент,
		               |	ВТ.Договор КАК Договор,
		               |	ВТ.Документ КАК Документ,
		               |	ВТ.ПредставлениеДокумента КАК ПредставлениеДокумента,
		               |	ВТ.Номенклатура КАК Номенклатура,
		               |	ВТ.Валюта КАК Валюта,
		               |	ВТ.ЭтоСчет КАК ЭтоСчет,
		               |	ВТ.ВсегоВал КАК ВсегоВал,
		               |	ВТ.Всего КАК Всего,
		               |	ВТ.Сумма КАК Сумма,
		               |	ВТ.НДС КАК НДС,
		               |	ВТ.Дата КАК Дата,
		               |	ВТ.Организация КАК Организация,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ВТ.ДокументБезОригиналов, ИСТИНА) = ИСТИНА
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК ОригиналыПредоставлены,
		               |	ВТ.НеактированныйОстаток КАК НеактированныйОстаток,
		               |	ВТ.Файлы КАК Файлы,
		               |	ВТ.СтатусДокумента КАК СтатусДокумента
		               |ИЗ
		               |	ВТ КАК ВТ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ВТ.Контрагент,
		               |	ВТ.Договор,
		               |	ВТ.Документ,
		               |	ВТ.Номенклатура,
		               |	ВТ.Валюта,
		               |	ВТ.Грузоперевозка,
		               |	ВТ.ЭтоСчет";
		Запрос.УстановитьПараметр("Грузоперевозка", УФ.Объект.Ссылка);
		Запрос.УстановитьПараметр("ТД", ТекущаяДата());
		ТЗ = Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	CW_ДоходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
		               |	CW_ДоходыПоГрузоперевозкам.Контрагент КАК Контрагент,
		               |	CW_ДоходыПоГрузоперевозкам.Договор КАК Договор,
		               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов КАК Документ,
		               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ПредставлениеДокумента КАК ПредставлениеДокумента,
		               |	CW_ДоходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
		               |	CW_ДоходыПоГрузоперевозкам.Валюта КАК Валюта,
		               |	НЕ CW_ДоходыПоГрузоперевозкам.ЭтоАкт КАК ЭтоСчет,
		               |	CW_ДоходыПоГрузоперевозкам.Всего_Валюта КАК ВсегоВал,
		               |	CW_ДоходыПоГрузоперевозкам.Всего КАК Всего,
		               |	CW_ДоходыПоГрузоперевозкам.Сумма КАК Сумма,
		               |	CW_ДоходыПоГрузоперевозкам.НДС КАК НДС,
		               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Дата КАК Дата,
		               |	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Организация КАК Организация,
		               |	CW_ОтсутствующиеОригиналыДокументов.Документ КАК ДокументБезОригиналов,
		               |	CW_АктированиеИсходящихСчетовОстатки.ВсегоОстаток КАК НеактированныйОстаток,
		               |	ЕСТЬNULL(CW_НаличиеФайловАрхиваПоОбъектам.Признак, ЛОЖЬ) КАК Файлы,
		               |	ЕСТЬNULL(CW_СтатусыДокументовСрезПоследних.СтатусДокумента, НЕОПРЕДЕЛЕНО) КАК СтатусДокумента
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ОтсутствующиеОригиналыДокументов КАК CW_ОтсутствующиеОригиналыДокументов
		               |		ПО CW_ДоходыПоГрузоперевозкам.ДокументДоходов = CW_ОтсутствующиеОригиналыДокументов.Документ
		               |			И CW_ДоходыПоГрузоперевозкам.Контрагент = CW_ОтсутствующиеОригиналыДокументов.Контрагент
		               |			И CW_ДоходыПоГрузоперевозкам.Договор = CW_ОтсутствующиеОригиналыДокументов.Договор
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.CW_АктированиеИсходящихСчетов.Остатки(
		               |				&ТД,
		               |				Грузоперевозка В
		               |					(ВЫБРАТЬ
		               |						Справочник.CW_Грузоперевозки.Ссылка
		               |					ИЗ
		               |						Справочник.CW_Грузоперевозки
		               |					ГДЕ
		               |						Справочник.CW_Грузоперевозки.Заказ = &Ссылка)) КАК CW_АктированиеИсходящихСчетовОстатки
		               |		ПО CW_ДоходыПоГрузоперевозкам.ДокументДоходов = CW_АктированиеИсходящихСчетовОстатки.Счет
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_НаличиеФайловАрхиваПоОбъектам КАК CW_НаличиеФайловАрхиваПоОбъектам
		               |		ПО CW_ДоходыПоГрузоперевозкам.ДокументДоходов = CW_НаличиеФайловАрхиваПоОбъектам.Объект
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СтатусыДокументов.СрезПоследних КАК CW_СтатусыДокументовСрезПоследних
		               |		ПО (CW_ДоходыПоГрузоперевозкам.ДокументДоходов = (ВЫРАЗИТЬ(CW_СтатусыДокументовСрезПоследних.Документ КАК Документ.CW_ДоходыПоГрузоперевозке)))
		               |ГДЕ
		               |	CW_ДоходыПоГрузоперевозкам.Грузоперевозка В
		               |			(ВЫБРАТЬ
		               |				Справочник.CW_Грузоперевозки.Ссылка
		               |			ИЗ
		               |				Справочник.CW_Грузоперевозки
		               |			ГДЕ
		               |				Справочник.CW_Грузоперевозки.Заказ = &Ссылка)
		               |	И CW_ДоходыПоГрузоперевозкам.Регистратор.ПометкаУдаления = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Грузоперевозка КАК Грузоперевозка,
		               |	ВТ.Контрагент КАК Контрагент,
		               |	ВТ.Договор КАК Договор,
		               |	ВТ.Документ КАК Документ,
		               |	ВТ.ПредставлениеДокумента КАК ПредставлениеДокумента,
		               |	ВТ.Номенклатура КАК Номенклатура,
		               |	ВТ.Валюта КАК Валюта,
		               |	ВТ.ЭтоСчет КАК ЭтоСчет,
		               |	ВТ.ВсегоВал КАК ВсегоВал,
		               |	ВТ.Всего КАК Всего,
		               |	ВТ.Сумма КАК Сумма,
		               |	ВТ.НДС КАК НДС,
		               |	ВТ.Дата КАК Дата,
		               |	ВТ.Организация КАК Организация,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ВТ.ДокументБезОригиналов, ИСТИНА) = ИСТИНА
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК ОригиналыПредоставлены,
		               |	ВТ.НеактированныйОстаток КАК НеактированныйОстаток,
		               |	ВТ.Файлы КАК Файлы,
		               |	ВТ.СтатусДокумента КАК СтатусДокумента
		               |ИЗ
		               |	ВТ КАК ВТ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ВТ.Контрагент,
		               |	ВТ.Договор,
		               |	ВТ.Документ,
		               |	ВТ.Номенклатура,
		               |	ВТ.Валюта,
		               |	ВТ.Грузоперевозка,
		               |	ВТ.ЭтоСчет";
		Запрос.УстановитьПараметр("Ссылка", ?(ЗначениеЗаполнено(УФ.Объект.Ссылка), УФ.Объект.Ссылка, Неопределено));
		Запрос.УстановитьПараметр("ТД", ТекущаяДата());
		ТЗ = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли; 
	
	// анализируем, надо ли разворачивать постатейно
	Если (УФ.ФинансыДоходыОтображатьПостатейно) Тогда
		ТЗ.Свернуть("Контрагент,Организация,Документ,Дата,ПредставлениеДокумента,Валюта,Номенклатура,ЭтоСчет,ОригиналыПредоставлены,ПредставлениеДокумента,Файлы,СтатусДокумента","ВсегоВал,Всего,Сумма,НДС,НеактированныйОстаток");
	Иначе
		ТЗ.Свернуть("Контрагент,Организация,Документ,Дата,ПредставлениеДокумента,Валюта,ЭтоСчет,ОригиналыПредоставлены,ПредставлениеДокумента,Файлы,СтатусДокумента","ВсегоВал,Всего,Сумма,НДС,НеактированныйОстаток");
	КонецЕсли; 
	ТЗ.Сортировать("Дата Возр");
	УФ.Элементы.ДоходыНоменклатура.Видимость = УФ.ФинансыДоходыОтображатьПостатейно;
	
	УФ.ФинансыДоходы.Загрузить(ТЗ);
	
	// количество документов
	ТЗД = ТЗ.Скопировать(,"Документ");
	ТЗД.Свернуть("Документ");
	КоличествоДоходных = ТЗД.Количество();
	УФ.Элементы.ГруппаДоходы.Заголовок = "Доходы"+?(КоличествоДоходных=0,""," ("+Строка(КоличествоДоходных)+")");
	
КонецФункции

&НаСервере
Функция ФинансыРезультатОбновить(УФ)
	
	Если (УФ.Объект.Ссылка.Пустая()) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументCW_ЗакрытиеГрузоперевозки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.CW_ЗакрытиеГрузоперевозки КАК ДокументCW_ЗакрытиеГрузоперевозки
		|ГДЕ
		|	ДокументCW_ЗакрытиеГрузоперевозки.Аналитика = &Аналитика
		|	И ДокументCW_ЗакрытиеГрузоперевозки.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Аналитика", УФ.Объект.Ссылка);
	ТЗРез = Запрос.Выполнить().Выгрузить();
	
	УФ.Элементы.ГруппаФинансовыйРезультатСписок.Заголовок = "Результат" + ?(ТЗРез.Количество() = 0, "", " (" + ТЗРез.Количество() + ")");
	
КонецФункции

&НаСервере
Функция ОтборДокументовФинансовогоРезультата(УФ)
	
	УФ.ВыявлениеРезультата.Параметры.УстановитьЗначениеПараметра("Аналитика",УФ.Объект.Ссылка);
	УФ.ВыявлениеРезультата.Отбор.Элементы.Очистить();
	_УФС.ДобавитьОтбор(УФ.ВыявлениеРезультата.Отбор,"Аналитика",,УФ.Объект.Ссылка);
	
КонецФункции

&НаСервере
Функция ФинансыУдалить(УФ,Параметры)
	
	Попытка
		Объект = Параметры.ПолучитьОбъект();
		Объект.УстановитьПометкуУдаления(НЕ Объект.ПометкаУдаления);
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
	ФинансыОбновить(УФ,Истина, Истина,Ложь);
	
КонецФункции
  
#КонецОбласти 

#Область Декларации

&НаСервере
Функция ДекларацииОбновить(УФ)
	
	// формируем ТЗ затрат
	Если (ФормаГрузоперевозки(УФ)) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	CW_ДТГрузоперевозок.РасчетДТ.Код КАК Код,
		               |	CW_ДТГрузоперевозок.ПроектДТ.НомерГТД КАК НомерГТД,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Клиент КАК Клиент,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Импортер КАК Импортер,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Страна КАК Страна,
		               |	CW_ДТГрузоперевозок.Номенклатура,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Валюта КАК Валюта,
		               |	CW_ДТГрузоперевозок.РасчетДТ,
		               |	CW_ДТГрузоперевозок.ПроектДТ,
		               |	СУММА(CW_ДТГрузоперевозок.Количество) КАК Количество,
		               |	СУММА(CW_ДТГрузоперевозок.ВсегоРуб) КАК ВсегоРуб,
		               |	СУММА(CW_ДТГрузоперевозок.НетарифкаРуб) КАК НетарифкаРуб,
		               |	СУММА(CW_ДТГрузоперевозок.ПошлинаРуб) КАК ПошлинаРуб,
		               |	СУММА(CW_ДТГрузоперевозок.СезСпецПошлинаРуб) КАК СезСпецПошлинаРуб,
		               |	СУММА(CW_ДТГрузоперевозок.АнтидемпинговаяПошлинаРуб) КАК АнтидемпинговаяПошлинаРуб,
		               |	СУММА(CW_ДТГрузоперевозок.НДСРуб) КАК НДСРуб
		               |ИЗ
		               |	РегистрСведений.CW_ДТГрузоперевозок КАК CW_ДТГрузоперевозок
		               |ГДЕ
		               |	CW_ДТГрузоперевозок.Грузоперевозка = &Грузоперевозка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	CW_ДТГрузоперевозок.ПроектДТ,
		               |	CW_ДТГрузоперевозок.РасчетДТ,
		               |	CW_ДТГрузоперевозок.Номенклатура,
		               |	CW_ДТГрузоперевозок.РасчетДТ.Код,
		               |	CW_ДТГрузоперевозок.ПроектДТ.НомерГТД,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Клиент,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Импортер,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Страна,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Валюта";
		Запрос.УстановитьПараметр("Грузоперевозка", УФ.Объект.Ссылка);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	CW_ДТГрузоперевозок.РасчетДТ.Код КАК Код,
		               |	CW_ДТГрузоперевозок.ПроектДТ.НомерГТД КАК НомерГТД,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Клиент КАК Клиент,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Импортер КАК Импортер,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Страна КАК Страна,
		               |	CW_ДТГрузоперевозок.Номенклатура,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Валюта КАК Валюта,
		               |	CW_ДТГрузоперевозок.РасчетДТ,
		               |	CW_ДТГрузоперевозок.ПроектДТ,
		               |	СУММА(CW_ДТГрузоперевозок.Количество) КАК Количество,
		               |	СУММА(CW_ДТГрузоперевозок.ВсегоРуб) КАК ВсегоРуб,
		               |	СУММА(CW_ДТГрузоперевозок.НетарифкаРуб) КАК НетарифкаРуб,
		               |	СУММА(CW_ДТГрузоперевозок.ПошлинаРуб) КАК ПошлинаРуб,
		               |	СУММА(CW_ДТГрузоперевозок.СезСпецПошлинаРуб) КАК СезСпецПошлинаРуб,
		               |	СУММА(CW_ДТГрузоперевозок.АнтидемпинговаяПошлинаРуб) КАК АнтидемпинговаяПошлинаРуб,
		               |	СУММА(CW_ДТГрузоперевозок.НДСРуб) КАК НДСРуб
		               |ИЗ
		               |	РегистрСведений.CW_ДТГрузоперевозок КАК CW_ДТГрузоперевозок
		               |ГДЕ
		               |	CW_ДТГрузоперевозок.Грузоперевозка.Заказ = &Заказ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	CW_ДТГрузоперевозок.ПроектДТ,
		               |	CW_ДТГрузоперевозок.РасчетДТ,
		               |	CW_ДТГрузоперевозок.Номенклатура,
		               |	CW_ДТГрузоперевозок.РасчетДТ.Код,
		               |	CW_ДТГрузоперевозок.ПроектДТ.НомерГТД,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Клиент,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Импортер,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Страна,
		               |	CW_ДТГрузоперевозок.ПроектДТ.Валюта";

		Запрос.УстановитьПараметр("Заказ", ?(ЗначениеЗаполнено(УФ.Объект.Ссылка), УФ.Объект.Ссылка, Неопределено));
		ТЗ = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли; 
	
	УФ.Декларации.Загрузить(ТЗ);
			
КонецФункции

#КонецОбласти

#Область Связи

&НаСервере
Функция ОтборСвязей(УФ)
	
	Если (НЕ УФ.Объект.Ссылка.Пустая()) Тогда
		
		УФ.ВедущиеГрузоперевозки.Отбор.Элементы.Очистить();
		_УФС.ДобавитьОтбор(УФ.ВедущиеГрузоперевозки.Отбор,"Грузоперевозка",,УФ.Объект.Ссылка);	
		// --- 
		УФ.ВедомыеГрузоперевозки.Отбор.Элементы.Очистить();
		_УФС.ДобавитьОтбор(УФ.ВедомыеГрузоперевозки.Отбор,"ГрузоперевозкаРодитель",,УФ.Объект.Ссылка);
		
	КонецЕсли; 
	
КонецФункции

#КонецОбласти 

&НаСервере
Процедура _СохранитьЗначение(ИмяНастройки, Настройка) Экспорт
	
	ХранилищеСистемныхНастроек.Сохранить("Грузоперевозки", ИмяНастройки, Настройка);
	
КонецПроцедуры	

Функция ПолучитьСведенияПоГрузоперевозкам(МассивГрузоперевозок) Экспорт
	
	Запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка,
	               |	CW_Грузоперевозки.ПометкаУдаления КАК ПометкаУдаления,
	               |	ВЫБОР
	               |		КОГДА CW_Грузоперевозки.Заказ = ЗНАЧЕНИЕ(Справочник.CW_Заказы.ПустаяСсылка)
	               |			ТОГДА ВЫБОР
	               |					КОГДА CW_ЗакрытиеФинансов.ДатаЗакрытия ЕСТЬ NULL
	               |						ТОГДА ЛОЖЬ
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА CW_ЗакрытиеФинансовЗаказ.ДатаЗакрытия ЕСТЬ NULL
	               |					ТОГДА ЛОЖЬ
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Заблокирована,
	               |	ЕСТЬNULL(CW_ЗначенияФинансовыхСтатусовОбъектов.ФинансовыйСтатус.СсылкаКартинки, """") КАК КартинкаФинансовыйСтатус
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
	               |		ПО CW_Грузоперевозки.Ссылка = CW_ЗакрытиеФинансов.Аналитика
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансовЗаказ
	               |		ПО CW_Грузоперевозки.Заказ = CW_ЗакрытиеФинансовЗаказ.Аналитика
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ЗначенияФинансовыхСтатусовОбъектов КАК CW_ЗначенияФинансовыхСтатусовОбъектов
	               |		ПО CW_Грузоперевозки.Ссылка = CW_ЗначенияФинансовыхСтатусовОбъектов.ОбъектСтатуса
	               |ГДЕ
	               |	CW_Грузоперевозки.Ссылка В(&МассивГрузоперевозок)";
	
	Запрос.УстановитьПараметр("МассивГрузоперевозок", МассивГрузоперевозок);
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	
	СвойстваГрузоперевозок = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураСвойств = новый Структура("ПометкаУдаления, Заблокирована, КартинкаФинансовыйСтатус", Выборка.ПометкаУдаления, Выборка.Заблокирована, Выборка.КартинкаФинансовыйСтатус);
		
		СвойстваГрузоперевозок.Вставить(Выборка.Ссылка, СтруктураСвойств);
		
	КонецЦикла;
	
	Возврат СвойстваГрузоперевозок;
	
КонецФункции

Функция ПолучитьСтруктуруИтоговДинамическогоСписка(форма, ИмяТаблицы) Экспорт
	
	ЭлементФормы 	= форма.Элементы[ИмяТаблицы];  
	ИмяКолонки 		= ЭлементФормы.ТекущийЭлемент.Имя;  
	ТаблицаФормы 	= форма[ИмяТаблицы];   
	
	Если ИмяТаблицы = "ОтчетЭкспедитора" Тогда 
		//Динамический список   
		
		мДоступныеКолонки = новый Массив; 
		мДоступныеКолонки.Добавить("Сумма");
		мДоступныеКолонки.Добавить("СуммаНДС");
		мДоступныеКолонки.Добавить("Всего");
		
		ИмяКолонки 	= СтрЗаменить(ЭлементФормы.ТекущийЭлемент.Имя, "ОтчетЭкспедитора", "");  
		
		Если мДоступныеКолонки.Найти(ИмяКолонки) = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли; 
		
	КонецЕсли;	
	
	Если ТипЗнч(ТаблицаФормы) = Тип("ДинамическийСписок") Тогда
		ДанныеИтогов = CW_БухгалтерияЭкспедитораСерверПереопределяемый.ИтогиДинамическогоСписка(Форма.ОтчетЭкспедитора, ИмяКолонки);
		СуммаЗначений = ДанныеИтогов[ИмяКолонки];   
	КонецЕсли;
	
	Если ТипЗнч(СуммаЗначений) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;   
	
	СтркутраПараметров = Новый Структура;
	СтркутраПараметров.Вставить("КоличествоЗначений", 	ЭлементФормы.ВыделенныеСтроки.Количество());
	СтркутраПараметров.Вставить("СуммаЗначений", 		СуммаЗначений);
	
	СтркутраПараметров.Вставить("МаксимальноеЗначениеПоказать",	Ложь);
	СтркутраПараметров.Вставить("МинимальноеЗначениеПоказать", 	Ложь);
	СтркутраПараметров.Вставить("СреднееЗначениеПоказать", 		Ложь);
	
	Возврат СтркутраПараметров

КонецФункции
