
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура саб_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МакетДокумента 		= Обработки.CW_КонтрольЛегальностиОбновленияМодуля.ПолучитьМакет("УсловияРаспространенияОбновлений");
	ТекстПредупреждения = МакетДокумента.ПолучитьТекст();

	СтандартныйПрефикс = ПолучитьНавигационнуюСсылкуИнформационнойБазы() + "/";
	ЭтоВебКлиент = СтрНайти(СтандартныйПрефикс, "http://") > 0;
	Если ЭтоВебКлиент Тогда
		КодЛокализации = ТекущийКодЛокализации();
		СтандартныйПрефикс = СтандартныйПрефикс + КодЛокализации + "/";
	КонецЕсли;   
    
	CW_ОбновлениеКонфигурацииСервер.ПодготовитьСписокОбновляемыхПодсистем(ЭтаФорма, СтандартнаяОбработка);
	#Вставка
	ЭтаФорма.Элементы.ПодтверждениеБулево.Видимость = Истина;
	#КонецВставки
КонецПроцедуры

&НаСервере
&Вместо("КомандаПродолжитьНаСервере")
Функция саб_КомандаПродолжитьНаСервере()
	Отказ = Ложь;
	CW_РегистрацияПрограммыСервер.ОбработатьПодтверждениеЛегальностьОбновления(ЭтаФорма, Отказ);
	Отказ = Ложь;
	Возврат Отказ;
КонецФункции
