// ---------------------------------------------------------------------------- 
// МОНИТОРИНГ
// ---------------------------------------------------------------------------- 

#Область Нумерация

Функция ПолучитьНомерГрузоперевозкиНаПечать(Грузоперевозка) Экспорт

	НумерацияВПределахЗаказа = Константы.CW_АвтоматическаяНумерацияВПределахЗаказа.Получить();	
	
	КодПеревозки  = Грузоперевозка.Код;
	ПрефиксЗаказа = "";	
	Если НумерацияВПределахЗаказа Тогда 
		ПозицияТире   			= СтрНайти(Грузоперевозка.Код, "-");
		КодПеревозки  			= Сред(Грузоперевозка.Код, ПозицияТире+1);
		ПрефиксЗаказа 			= Лев(Грузоперевозка.Код, ПозицияТире); 
		ПрефиксЗаказаБезТире 	= Лев(Грузоперевозка.Код, ПозицияТире-1); 
		
		Попытка
			ПрефиксЗаказаБезТире = Число(ПрефиксЗаказаБезТире);
		Исключение
			ПрефиксЗаказаБезТире = СокрЛП(ПрефиксЗаказаБезТире);   
		КонецПопытки; 
		
		Если ТипЗнч(ПрефиксЗаказаБезТире)= Тип("Число")
			и ПрефиксЗаказаБезТире = 0 Тогда
			ПрефиксЗаказа = "";	
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		НомерПеревозки = Число(КодПеревозки);
	Исключение
		НомерПеревозки = СокрЛП(КодПеревозки);   
	КонецПопытки; 
	
	Возврат СтрШаблон("%1%2", ПрефиксЗаказа, Формат(НомерПеревозки,"ЧГ=0"));   
	
КонецФункции


#КонецОбласти 

#Область Параметры 


Функция ПолучитьИндексПиктограммыПараметра(Ссылка) Экспорт

	Возврат ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьИндексПиктограммыПараметра(Ссылка);
	
КонецФункции   

Функция СтрокаПараметра(Объект,Параметр) Экспорт 
	// --- 
	
	ИмяТЧ = ТабличнаяЧастьПараметровОбъекта(Объект);
	Если ИмяТЧ <> Неопределено Тогда
		СтрокаПараметра = _сф.к_НайтиСтроку(Объект[ИмяТЧ],Новый Структура("Параметр",Параметр));
	КонецЕсли;
	Возврат(СтрокаПараметра);
	
	// --- 
КонецФункции
Функция ТабличнаяЧастьПараметровОбъекта(Объект) Экспорт 
	
	ИмяТЧ = Неопределено;
	
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("Структура") Тогда
		Если  Объект.Свойство("ТаблицаПараметров") Тогда
			ИмяТЧ = "ТаблицаПараметров";
		КонецЕсли;
	Иначе
		//тут проверяем ссылку
		ТипСсылкиОбъекта = ТипЗнч(Объект.Ссылка);
		Если ТипСсылкиОбъекта = Тип("СправочникСсылка.CW_Заявки") Тогда
			ИмяТЧ = "ПараметрыЗаявки";
		ИначеЕсли ТипСсылкиОбъекта = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			ИмяТЧ = "ПараметрыГрузоперевозки";
		ИначеЕсли ТипСсылкиОбъекта = Тип("СправочникСсылка.CW_Заказы") Тогда
			ИмяТЧ = "ПараметрыЗаказа";
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ИмяТЧ;
	
КонецФункции
Функция ПараметрГрузоперевозки(Грузоперевозка, Параметр) Экспорт 
	// --- 
	
	СтрокаПГ = _сф.к_НайтиСтроку(Грузоперевозка.ПараметрыГрузоперевозки,"Параметр",Параметр);
	Если (СтрокаПГ=Неопределено) Тогда
		
		Возврат(Неопределено);
		
	Иначе
		
		Возврат(СтруктураПараметраГрузоперевозки(СтрокаПГ));
		
	КонецЕсли; 
	
	// --- 
КонецФункции
Функция СтруктураПараметраГрузоперевозки(СтрокаПараметра) Экспорт 

	СтруктураПараметра = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
	СтруктураПараметра.Параметр		= СтрокаПараметра.Параметр;
	СтруктураПараметра.Значение 	= СтрокаПараметра.Значение;
	СтруктураПараметра.ЗначениеПлан = СтрокаПараметра.ЗначениеПлан;
	СтруктураПараметра.ЗначениеФакт = СтрокаПараметра.ЗначениеФакт;
	СтруктураПараметра.Примечание 	= СтрокаПараметра.Примечание;
	
	Возврат СтруктураПараметра;
	
	// --- 
КонецФункции
Функция СтруктураСвойствПараметра(Параметр) Экспорт 
	
	Ответ = _сф.ст_Создать("Ведомый,СписокВедущих,Ведущий,СписокВедомых,СписокВедомыхСтрокой,ДинамическийПараметр,ИспользуетсяВнешняяОбработкаПередНачаломИзменения,ИспользоватьФормуВыбораОбъекта, ИмяФормыВыбора, ИспользуютсяДополнительныеЗначения,СохранятьПолноеЗначениеПараметра");
	
	Ответ.Ведомый = Параметр.ЭтоВедомыйПараметр;
	Ответ.ДинамическийПараметр = Параметр.ДинамическийПараметр;
	СписокВедущих = Новый СписокЗначений;
	Для каждого СтрОтбора Из Параметр.ПараметрыОтбора.Выгрузить(_сф.ст_Отбор("ИспользоватьПГ",Истина)) Цикл
		Если (СписокВедущих.НайтиПоЗначению(СтрОтбора.Значение) = Неопределено) Тогда
			СписокВедущих.Добавить(СтрОтбора.Значение);
		КонецЕсли; 
	КонецЦикла;
	Ответ.СписокВедущих = СписокВедущих;

	СписокВедомых = Новый СписокЗначений;
	ЗаполнитьСписокВедомыхПараметров(Параметр, СписокВедомых);
	Ответ.Ведущий = (СписокВедомых.Количество() <> 0);
	Ответ.СписокВедомых = СписокВедомых;
	Ответ.СписокВедомыхСтрокой = _сф.сп_Представление(СписокВедомых,",",Ложь);
	
	Ответ.ИспользуетсяВнешняяОбработкаПередНачаломИзменения = Параметр.ИспользуетсяОбработкаПередНачаломВыбора;
	Ответ.ИспользоватьФормуВыбораОбъекта 					= Параметр.ИспользоватьФормуВыбораОбъекта;
	Ответ.ИспользуютсяДополнительныеЗначения 				= Параметр.ИспользуютсяДополнительныеЗначения;
	Ответ.СохранятьПолноеЗначениеПараметра = CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(Параметр);
	
	Если Параметр.ИспользоватьФормуВыбораОбъекта Тогда   
		ИмяМетаданного 			= Параметр.ТипЗначения.ПривестиЗначение().Метаданные().ПолноеИмя();
		Ответ.ИмяФормыВыбора 	= ИмяМетаданного+".ФормаВыбора";    
	КонецЕсли;   
	
	Возврат(Ответ);
	
КонецФункции

Функция ПолучитьСоответствиеСвойствПараметров() Экспорт 
	Возврат(CW_Мониторинг_ПИ.ПолучитьСоответствиеСвойствПараметров());
КонецФункции

Процедура ЗаполнитьСписокВедомыхПараметров(Параметр, СписокПараметров)
	
	// рекурсивная функция получение списка зависимых параметров
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_ПараметрыГрузоперевозок.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПараметрыОтбора КАК CW_ПараметрыГрузоперевозок
	|ГДЕ
	|	CW_ПараметрыГрузоперевозок.Значение = &Значение
	|	И CW_ПараметрыГрузоперевозок.ИспользоватьПГ = ИСТИНА";
	
	Запрос.УстановитьПараметр("Значение", Параметр);
	ТаблицаВедомыхПГ = Запрос.Выполнить().Выгрузить();
	ТаблицаВедомыхПГ.Свернуть("Ссылка");
	
	Для каждого Стр Из ТаблицаВедомыхПГ Цикл
		Если СписокПараметров.НайтиПоЗначению(Стр.Ссылка) = Неопределено Тогда
			СписокПараметров.Добавить(Стр.Ссылка);
			ЗаполнитьСписокВедомыхПараметров(Стр.Ссылка, СписокПараметров);
		КонецЕсли; 
	КонецЦикла; 
		
КонецПроцедуры

#КонецОбласти 

#Область Статусы 

Функция ВыполнитьПроверкуДополнительногоКонтроля(НастройкиОтбора, Грузоперевозка) Экспорт
	
	Если НастройкиОтбора = неопределено тогда
		возврат ложь;
	КонецЕсли;
	
	////Копию создаетм только в случае, если у переданной грузоперевозки не заполнена ссылка,
	////т.е. она еще незаписана.
	////СоздатьКопию = НЕ ЗначениеЗаполнено(Грузоперевозка.Ссылка);
	//СоздатьКопию = Истина;
	//
	//// Если определяется статус для новой (еще не записанной грузоперевозки),
	//// то для корректного определения статуса (в случае если в элементе справочника 
	//// статуса установлена опция "контроль по дополнительным параметрам"), необходимо
	//// чтобы значения параметров были записаны в регистр "CW_ХарактеристикиГрузоперевозок",
	//// (т.к. контроль осуществляется с использованием компановщика). Для новой грузоперевозки
	//// это условие не реализуемо, поэтому временно создадим копию грузоперевозки, определим ее 
	//// статус, вернем его (статус) для вновь создаваемой грузоперевозки, а временную копию 
	//// грузоперевозки удалим.  
	//
	//// для блокировки очистки значений параметров грузоперевозки (в процедуре объекта "ПриКопировании()"),
	//// установим дополнительное свойство, которое будет потом проанализировано в процедуре объекта "ПриКопировании()" 
	////
	////Безуслованя копия грузоперевозки, так как на момент расчета статуса, ГП может быть еще не записана,
	////это исклчючить необходимость повторной записи
	//Если СоздатьКопию Тогда
	//	Если ТипЗнч(Грузоперевозка)=Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
	//		ОбъектКопирования = Грузоперевозка.ПолучитьОбъект();
	//	Иначе
	//		ОбъектКопирования = Грузоперевозка;
	//	КонецЕсли;
	//	
	//	_сф.ст_УстановитьСвойство(ОбъектКопирования.ДополнительныеСвойства,"ИгнорироватьОбработкуКопирования",Истина);
	//	
	//	КопияГрузоперевозки = ОбъектКопирования.Скопировать();
	//	
	//	_сф.ст_УстановитьСвойство(КопияГрузоперевозки.ДополнительныеСвойства,"ВременныйОбъект",Истина);
	//	
	//	КопияГрузоперевозки.Записать();
	//	
	//Иначе
	//	КопияГрузоперевозки = Грузоперевозка;
	//КонецЕсли;

	
	СхемаКомпоновкиДанных 	= ПолучитьОбщийМакет("CW_СхемаОтбораГрузоперевозок");
	Настройки 				= СхемаКомпоновкиДанных.НастройкиПоУмолчанию;

	_УФС.СкопироватьОтбор(НастройкиОтбора.Отбор, Настройки.Отбор);
	
	ДобавитьСсылкуВОтбор = ПроверитьНаличиеСсылкиВОтборе(Настройки.Отбор.Элементы);
	//Для Каждого ЭлементОтбора Из Настройки.Отбор.Элементы Цикл
	//	Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка") Тогда
	//		ДобавитьСсылкуВОтбор = Ложь;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
	Если ДобавитьСсылкуВОтбор Тогда
		ЭлементОтбора 					= Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Грузоперевозка.Ссылка;
		ЭлементОтбора.Использование	 	= Истина;
	КонецЕсли;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	Результат = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ЗначениеВозврата = Результат.Количество() > 0;
	
	//// перед возвратом удалим временную грузоперевозку (если ее создавали для нового объекта)
	////в случае если создавали копию
	//Если СоздатьКопию и КопияГрузоперевозки <> Неопределено Тогда
	//	УстановитьПривилегированныйРежим(Истина);	
	//	КопияГрузоперевозки.Удалить();	
	//	УстановитьПривилегированныйРежим(Ложь);	
	//КонецЕсли; 
	
	Возврат  ЗначениеВозврата;
	
КонецФункции

Функция ПроверитьНаличиеСсылкиВОтборе(ЭлементыОбора)
	
	Для Каждого ЭлементОтбора Из ЭлементыОбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Возврат ПроверитьНаличиеСсылкиВОтборе(ЭлементОтбора.Элементы);
		Иначе
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка") Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат истина;
	
КонецФункции

#КонецОбласти 



  
#Область ДинамическиеПараметры 

Процедура CW_ПересчетДинамическихПараметров() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеДинамическихПараметров") = Ложь) Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрДатыСледующегоОбновления = Константы.CW_ПараметрДатыЕжедневногоОбновления.Получить();
	Если (НЕ ЗначениеЗаполнено(ПараметрДатыСледующегоОбновления)) Тогда
		УстановитьПараметрДатыЕжедневногоОбновления();	
		ПараметрДатыСледующегоОбновления = Константы.CW_ПараметрДатыЕжедневногоОбновления.Получить();
	КонецЕсли; 
	
	СоответствиеСвойствПараметров = _БЭ.ПолучитьСоответствиеСвойствПараметров();
	
	Таймер = _сф.Таймер_Старт();
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЗакрытиеМониторинга.Аналитика КАК ГрузопереовзкаСсылка
	               |ПОМЕСТИТЬ ВТ_ЗаблокированныеПоМониторигу
	               |ИЗ
	               |	РегистрСведений.CW_ЗакрытиеМониторинга КАК CW_ЗакрытиеМониторинга
	               |ГДЕ
	               |	CW_ЗакрытиеМониторинга.Аналитика ССЫЛКА Справочник.CW_Грузоперевозки
	               |	И CW_ЗакрытиеМониторинга.ДатаЗакрытия < &НачалоТекущегоДня
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ГрузопереовзкаСсылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Исключения
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.Архив
	               |	И НЕ CW_Грузоперевозки.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВТ_ЗаблокированныеПоМониторигу.ГрузопереовзкаСсылка КАК ГрузопереовзкаСсылка
	               |				ИЗ
	               |					ВТ_ЗаблокированныеПоМониторигу КАК ВТ_ЗаблокированныеПоМониторигу)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ЗаблокированныеПоМониторигу.ГрузопереовзкаСсылка
	               |ИЗ
	               |	ВТ_ЗаблокированныеПоМониторигу КАК ВТ_ЗаблокированныеПоМониторигу";
	
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДата()));
	
	//Получаем грузоперевозки, которые не обрабатываем
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	               |ГДЕ
	               |	CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр
	               |	И CW_ХарактеристикиГрузоперевозок.Значение < &Значение
	               |	И НЕ CW_ХарактеристикиГрузоперевозок.Грузоперевозка В
	               |				(ВЫБРАТЬ
	               |					ВТ_Исключения.Ссылка КАК Ссылка
	               |				ИЗ
	               |					ВТ_Исключения КАК ВТ_Исключения)";

	Запрос.УстановитьПараметр("Параметр", ПараметрДатыСледующегоОбновления);
	Запрос.УстановитьПараметр("Значение", КонецДня(ТекущаяДата())+1); 
	
	Выборка 					= Запрос.Выполнить().Выбрать();
	КоличествоГрузоперевозок 	= Выборка.Количество();
	ЕстьОшибки 					= Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Ответ = ПересчитатьДинамическиеПараметрыОбъекта(Выборка.Грузоперевозка,СоответствиеСвойствПараметров);
		
		Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
			ЕстьОшибки = истина;
		КонецЕсли; 
		
	КонецЦикла; 
	
	_сф.Таймер_Стоп(Таймер);
	
	Если ЕстьОшибки Тогда
		
		ТекстСообщения = "Пересчет параметров:"+Символы.ПС;
		CW_Журнал.ЗаписатьСообщение("БЭ.ПересчетДинамическихПараметров","error",ТекстСообщения);
		
	Иначе
		
		ТекстСообщения = "Пересчет параметров завершен успешно."+Символы.ПС;
		ТекстСообщения = ТекстСообщения + "Количество грузоперевозк: "+Формат(КоличествоГрузоперевозок,"ЧДЦ=");
		
		Если (КоличествоГрузоперевозок <> 0) Тогда
			
			ТекстСообщения = ТекстСообщения+Символы.ПС;
			ТекстСообщения = ТекстСообщения + "Время пересчёта: "+ _сф.Таймер_Представление(Таймер,Истина)+Символы.ПС;
			ТекстСообщения = ТекстСообщения + "Скорость пересчёта: "+ Формат(Окр(КоличествоГрузоперевозок*1000/_сф.Таймер_Интервал(Таймер),2),"ЧДЦ=2; ЧГ=")+" шт/с";
			
		КонецЕсли; 
				
		CW_Журнал.ЗаписатьСообщение("БЭ.ПересчетДинамическихПараметров","info",ТекстСообщения);
		
	КонецЕсли; 
	
КонецПроцедуры
Функция ПересчитатьДинамическиеПараметрыОбъекта(Грузоперевозка, СоответствиеСвойствПараметров=Неопределено) Экспорт
	// --- 
	
	Если (СоответствиеСвойствПараметров = Неопределено) Тогда
		СоответствиеСвойствПараметров = ПолучитьСоответствиеСвойствПараметров();
	КонецЕсли; 
	
	// --- 
	
	Попытка
		
		ТаблицаПараметров = ДинамическиеПараметрыОбъекта(Грузоперевозка, СоответствиеСвойствПараметров);
		Для каждого Стр Из ТаблицаПараметров Цикл
			
			Запись = РегистрыСведений.CW_ХарактеристикиГрузоперевозок.СоздатьМенеджерЗаписи();
			// --- 
			Запись.Грузоперевозка = Грузоперевозка;
			Запись.Параметр = Стр.Параметр;
			Запись.Значение = Стр.Значение;
			// --- 
			Запись.Записать(Истина);
			
		КонецЦикла; 
		
	Исключение
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции
Функция ДинамическиеПараметрыОбъекта(Грузоперевозка, СоответствиеСвойствПараметров, МассивПараметров=Неопределено,ТаблицаПараметровГрузоперевозки=Неопределено) Экспорт
	// --- 
	
	ЕстьЕжедневные = Ложь;
	// --- 
	
	Если (ТаблицаПараметровГрузоперевозки = Неопределено) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ГрузоперевозкиПараметрыОбъекта.Параметр,
		|	CW_ГрузоперевозкиПараметрыОбъекта.Параметр.Идентификатор КАК Идентификатор,
		|	CW_ГрузоперевозкиПараметрыОбъекта.Значение,
		|	CW_ГрузоперевозкиПараметрыОбъекта.ЗначениеПлан,
		|	CW_ГрузоперевозкиПараметрыОбъекта.ЗначениеФакт,
		|	CW_ГрузоперевозкиПараметрыОбъекта.Параметр.ДинамическийПараметр КАК ДинамическийПараметр
		|ИЗ
		|	Справочник.CW_Грузоперевозки.ПараметрыГрузоперевозки КАК CW_ГрузоперевозкиПараметрыОбъекта
		|ГДЕ
		|	CW_ГрузоперевозкиПараметрыОбъекта.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Грузоперевозка.Ссылка);
		ТаблицаПараметровГрузоперевозки = Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		ТаблицаПараметровГрузоперевозки.Колонки.Добавить("Идентификатор");
		ТаблицаПараметровГрузоперевозки.Колонки.Добавить("ДинамическийПараметр");
		Для каждого Стр Из ТаблицаПараметровГрузоперевозки Цикл
			
			СвойстваПараметра = СоответствиеСвойствПараметров.Получить(Стр.Параметр);
			Стр.Идентификатор = СвойстваПараметра.Идентификатор;
			Стр.ДинамическийПараметр = СвойстваПараметра.ДинамическийПараметр;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если (МассивПараметров = Неопределено) Тогда
		
		Отбор = Новый Структура("ДинамическийПараметр",Истина);
		МассивПараметров = ТаблицаПараметровГрузоперевозки.Скопировать(Отбор,"Параметр").ВыгрузитьКолонку("Параметр");
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	// определяем порядок расчета 
	ТаблицаРанжирования = _сф.т_Создать("Параметр,Индекс");
	Для каждого Стр Из МассивПараметров Цикл
		
		Нстр = ТаблицаРанжирования.Добавить();
		Нстр.Параметр = Стр;
		Нстр.Индекс = 0;
		
		Если (НЕ ЕстьЕжедневные) Тогда
			СвойстваПараметра = СоответствиеСвойствПараметров.Получить(Стр);
			Если (СвойстваПараметра.ЕжедневныйПересчет) Тогда
				ЕстьЕжедневные = Истина;
			КонецЕсли; 	
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	Для каждого Стр Из ТаблицаРанжирования Цикл
		
		ОпределитьИндекс(СоответствиеСвойствПараметров, Стр.Параметр, Стр.Индекс);
		
	КонецЦикла; 
	// --- 
	ТаблицаРанжирования.Сортировать("Индекс Возр");
	
	// ---------------------------------------------------------------------------- 
	
	ТаблицаДП = Справочники.CW_Грузоперевозки.ПустаяСсылка().ПараметрыГрузоперевозки.Выгрузить();
	ЕстьЕжедневные = Ложь;
	Для каждого Стр Из ТаблицаРанжирования Цикл
		
		СП = СоответствиеСвойствПараметров.Получить(Стр.Параметр);
		Ответ = ВычислитьДинамическийПараметр(Стр.Параметр, Грузоперевозка, ТаблицаПараметровГрузоперевозки, ТаблицаДП);
		Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
			
			Нстр = ТаблицаДП.Добавить();
			Нстр.Параметр = Стр.Параметр;
			Если (НЕ ЕстьЕжедневные) Тогда
				Если (СП.ЕжедневныйПересчет) Тогда
					ЕстьЕжедневные = Истина;
				КонецЕсли; 
			КонецЕсли; 
			Нстр.Значение = Ответ.Результат;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если (ЕстьЕжедневные) Тогда
		
		// добавляем запись по дате следующего обновления
		ПараметрДатыСледующегоОбновления = Константы.CW_ПараметрДатыЕжедневногоОбновления.Получить();
		Если (НЕ ЗначениеЗаполнено(ПараметрДатыСледующегоОбновления)) Тогда
			УстановитьПараметрДатыЕжедневногоОбновления();	
			ПараметрДатыСледующегоОбновления = Константы.CW_ПараметрДатыЕжедневногоОбновления.Получить();
		КонецЕсли; 
		// пытаемся найти
		Отбор = Новый Структура("Параметр",ПараметрДатыСледующегоОбновления);
		Нстр = _сф.к_НайтиСтроку(ТаблицаДП,Отбор);
		Если (Нстр = Неопределено) Тогда
			Нстр = ТаблицаДП.Добавить();	
		КонецЕсли; 
		Нстр.Параметр = ПараметрДатыСледующегоОбновления;
		Нстр.Значение = НачалоДня(КонецДня(ТекущаяДата())+1);
		
	КонецЕсли; 
	
	Возврат(ТаблицаДП);
	
	// --- 
КонецФункции
Процедура УстановитьПараметрДатыЕжедневногоОбновления() Экспорт 
	// --- 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПДЕО = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.СоздатьЭлемент();
	// --- 
	ПДЕО.ТолькоПросмотр = Истина;
	ПДЕО.Служебный = Истина;
	ПДЕО.Наименование = "Дата планового обновления";
	ПДЕО.ЭтоКонтрольнаяДата = Ложь;
	// --- 
	ПДЕО.Записать();
	
	Константы.CW_ПараметрДатыЕжедневногоОбновления.Установить(ПДЕО.Ссылка);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// --- 
КонецПроцедуры
Функция СписокМакросовДинамическихПараметров() Экспорт 
	
	ТаблицаМакросов = Новый ТаблицаЗначений;
	ТаблицаМакросов.Колонки.Добавить("Макрос", 			Новый ОписаниеТипов("Строка"));
	ТаблицаМакросов.Колонки.Добавить("Описание", 		Новый ОписаниеТипов("Строка"));
	ТаблицаМакросов.Колонки.Добавить("Параметр",		Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок"));
	ТаблицаМакросов.Колонки.Добавить("ИндексКартинки", 	Новый ОписаниеТипов("Число"));
	
	//Реквизиты
	НоваяяСтрока =  ТаблицаМакросов.Добавить();
	НоваяяСтрока.Макрос    			= "{Ссылка}";
	НоваяяСтрока.Описание           = "Ссылка";
	НоваяяСтрока.Параметр           = Неопределено;
	НоваяяСтрока.ИндексКартинки     = 4;
	
	НоваяяСтрока =  ТаблицаМакросов.Добавить();
	НоваяяСтрока.Макрос    			= "{Клиент}";
	НоваяяСтрока.Описание           = "Клиент";
	НоваяяСтрока.Параметр           = Неопределено;
	НоваяяСтрока.ИндексКартинки     = 4;
	
	НоваяяСтрока =  ТаблицаМакросов.Добавить();
	НоваяяСтрока.Макрос    			= "{Груз}";
	НоваяяСтрока.Описание           = "Груз";
	НоваяяСтрока.Параметр           = Неопределено;
	НоваяяСтрока.ИндексКартинки     = 4;
		
	НоваяяСтрока =  ТаблицаМакросов.Добавить();
	НоваяяСтрока.Макрос    			= "{Маршрут}";
	НоваяяСтрока.Описание           = "Маршрут";
	НоваяяСтрока.Параметр           = Неопределено;
	НоваяяСтрока.ИндексКартинки     = 4;
	
	НоваяяСтрока =  ТаблицаМакросов.Добавить();
	НоваяяСтрока.Макрос    			= "{Типоразмер}";
	НоваяяСтрока.Описание           = "Типоразмер контейнера";
	НоваяяСтрока.Параметр           = Неопределено;
	НоваяяСтрока.ИндексКартинки     = 4;
	//Реквизиты
	
	//Параметры
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка,
	               |	CW_ПараметрыГрузоперевозок.Идентификатор КАК Идентификатор,
	               |	CW_ПараметрыГрузоперевозок.ДинамическийПараметр КАК ДинамическийПараметр,
	               |	CW_ПараметрыГрузоперевозок.ЭтоКонтрольнаяДата КАК ЭтоКонтрольнаяДата
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяяСтрока =  ТаблицаМакросов.Добавить();
		НоваяяСтрока.Макрос    			= "{%" +Выборка.Идентификатор+"%}";
		НоваяяСтрока.Описание           = Строка(Выборка.Ссылка);
		НоваяяСтрока.Параметр           = Выборка.Ссылка;
		
		Если Выборка.ДинамическийПараметр Тогда
			НоваяяСтрока.ИндексКартинки     = 3;
		ИначеЕсли Выборка.ЭтоКонтрольнаяДата Тогда
			НоваяяСтрока.ИндексКартинки     = 2;
		Иначе
			НоваяяСтрока.ИндексКартинки     = 1;
		КонецЕсли;
		
	КонецЦикла;
	//Параметры
	
	Возврат ТаблицаМакросов;
	
КонецФункции

// --- 
Процедура ОпределитьИндекс(СоответствиеСвойствПараметров,Параметр,Индекс)
	// --- 
	
	СП = СоответствиеСвойствПараметров.Получить(Параметр);
	Если (СП.ЕстьИспользуемыеПараметры) Тогда
		
		Для каждого ИспользуемыеПараметр Из СП.ИспользуемыеПараметры Цикл
			Если (ЗначениеЗаполнено(ИспользуемыеПараметр)) Тогда
				
				СИП = СоответствиеСвойствПараметров.Получить(ИспользуемыеПараметр);
				Если (СИП.ДинамическийПараметр) Тогда
					
					_сф.Инкремент(Индекс);
					ОпределитьИндекс(СоответствиеСвойствПараметров, ИспользуемыеПараметр, Индекс);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
Функция ВычислитьДинамическийПараметр(Параметр, Грузоперевозка, ТаблицаПараметров, ТаблицаРезультата)
	// --- 
	
	Формула = Параметр.ПодготовленнаяФормула;
	// --- 
	
	// анализируем формулу
	// определяем макросы, определяем значения, добавляем в массив переменных
	// подставляем вместо макросов элементы массива переменных
	МП = Новый Массив; // Массив переменных
	
	ТаблицаЗаменыРеквизитов = Новый Соответствие;
	ТаблицаЗаменыРеквизитов.Вставить("Дата","ДатаСделкиФ");
	// --- 
	
	СоответствиеПараметровГрузоперевозки = _сф.со_Создать("Идентификатор","",ТаблицаПараметров);
	
	ТипЗначенияПараметров = ПолучитьСоответствиеТиповЗначения(); 
	
	МакросыФормулы = _сф.стр_СписокМакросов(Формула,"{}");
	Для каждого Макрос Из МакросыФормулы Цикл
		
		ЗначениеПараметра = Неопределено;
		// ---------------------------------------------------------------------------- 
		
		// определяем, является реквизит параметром или реквизитом
		// если есть %%, то параметр
		Если (Найти(Макрос,"%")<>0) Тогда
			
			// это параметр
			Макрос = СтрЗаменить(Макрос,"%","");
			Если (Найти(Макрос,".") <>0 ) Тогда
				
				СтруктураМакроса = _сф.ст_СоздатьИзМаркированнойСтроки(Макрос,".","Идентификатор,Значение");
				ИдентификаторМакроса = СтруктураМакроса.Идентификатор;
				ЗначениеКД = СтруктураМакроса.Значение;
				
			Иначе
				
				ИдентификаторМакроса = Макрос;
				ЗначениеКД = Неопределено;
				
			КонецЕсли; 
			
			// пробуем получить из соответствия
			ДинамическийПараметр = Ложь;
			СтруктураЗначения = СоответствиеПараметровГрузоперевозки.Получить(ИдентификаторМакроса);
			Если (СтруктураЗначения <> Неопределено) Тогда
				
				ДинамическийПараметр = СтруктураЗначения.ДинамическийПараметр;
				Если (НЕ ДинамическийПараметр) Тогда
					Если (ЗначениеКД <> Неопределено) Тогда
						ЗначениеПараметра = СтруктураЗначения["Значение"+ЗначениеКД];
					Иначе
						ЗначениеПараметра = СтруктураЗначения["Значение"];
					КонецЕсли;	
				КонецЕсли; 
				
				Если (ДинамическийПараметр) Тогда
					
					// пробуем получить из таблицы динамических параметров
					Отбор = Новый Структура("Параметр",СтруктураЗначения.Параметр);
					СтрокаЗначения = _сф.к_НайтиСтроку(ТаблицаРезультата,Отбор);
					
					Если (СтрокаЗначения <> Неопределено) Тогда
						ЗначениеПараметра = СтрокаЗначения.Значение;
					КонецЕсли; 
					
				КонецЕсли; 
				
				Если ЗначениеПараметра = Неопределено Тогда
					ЗначениеПараметра = СтруктураЗначения.Параметр.ТипЗначения.ПривестиЗначение(ЗначениеПараметра);
				КонецЕсли; 
				
			Иначе
				ТипЗначенияПараметра 	= ТипЗначенияПараметров.Получить(ИдентификаторМакроса);
				Если ТипЗначенияПараметра <> Неопределено Тогда
					ЗначениеПараметра 	= ТипЗначенияПараметра.ПривестиЗначение();
				КонецЕсли;
			КонецЕсли; 

			
			Если (ЗначениеПараметра <> Неопределено) Тогда
				
				// получаем индекс добавляемой переменной
				МП.Добавить(ЗначениеПараметра);
				ИндексПеременной = МП.Количество()-1;
				СтрокаЗамены = "МП["+Формат(ИндексПеременной,"ЧДЦ=; ЧН=; ЧГ=")+"]";
				// --- 
				Формула = СтрЗаменить(Формула,_сф.стр_Обернуть(_сф.стр_Обернуть(Макрос,"%%"),"{}"),СтрокаЗамены);
				
			КонецЕсли; 
			
		Иначе
			
			// это реквизит
			// пробуем найти по таблице замены
			Соответствие = ТаблицаЗаменыРеквизитов.Получить(Макрос);
			Если (Соответствие = Неопределено) Тогда
				
				Соответствие = Макрос;
				
			КонецЕсли; 
			// --- 
			Формула = СтрЗаменить(Формула,_сф.стр_Обернуть(Макрос,"{}"),"Грузоперевозка."+Соответствие);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// формируем таблицу замены функций
	// ---------------------------------------------------------------------------- 
	СЗ = Новый Соответствие;
	СЗ.Вставить("РазностьДат(","ДП_РазностьДат(");
	//СЗ.Вставить("ПлановоеЗначение(","ПлановоеЗначениеКонтрольнойДаты(Грузоперевозка,");
	Для каждого Стр Из СЗ Цикл
		
		Формула = СтрЗаменить(Формула,Стр.Ключ,Стр.Значение);
		
	КонецЦикла; 
	
	Результат = Неопределено;
	Текст = "Результат = "+ Формула;
	
	Попытка
		Выполнить(текст);	
	Исключение
	    Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
	Ответ = _УФКС.Ответ();
	Ответ.Вставить("Результат",Результат);
	Возврат(Ответ);
	
	// --- 
КонецФункции
Функция ДП_РазностьДат(Дата1,Дата2)
	// --- 
	
	Разность = НачалоДня(Дата1)-НачалоДня(Дата2);
	Возврат(Цел(Разность/(60*60*24)));
	
	// --- 
КонецФункции

Функция ПолучитьСоответствиеТиповЗначения()
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.ТипЗначения КАК ТипЗначения,
	               |	CW_ПараметрыГрузоперевозок.Идентификатор КАК Идентификатор
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Идентификатор, Выборка.ТипЗначения);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область ПредопределённыеПараметры 

Функция ВидСубъекта(ИмяПеречисления) Экспорт
	
	Возврат Перечисления.CW_ВидыСубъектовСвязанныхПараметров[ИмяПеречисления]; 
	
КонецФункции
Функция ПолучитьПредопределенныеПараметры(Субъект,ИмяРеквизита, ИдентификаторФормы=Неопределено) Экспорт 
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПредопределенныеЗначенияПараметров.Параметр КАК Параметр,
	               |	CW_ПредопределенныеЗначенияПараметров.Значение КАК Значение,
	               |	CW_ПредопределенныеЗначенияПараметров.ДобавлятьАвтоматически КАК Добавлять,
	               |	CW_ПредопределенныеЗначенияПараметров.ПерезаполнятьАвтоматически КАК Перезаполнять,
	               |	CW_ПредопределенныеЗначенияПараметров.ДляГрузоперевозок КАК ДляГрузоперевозок,
	               |	CW_ПредопределенныеЗначенияПараметров.ДляЗаявок КАК ДляЗаявок,
	               |	CW_ПредопределенныеЗначенияПараметров.ДляЗаказов КАК ДляЗаказов
	               |ИЗ
	               |	РегистрСведений.CW_ПредопределенныеЗначенияПараметров КАК CW_ПредопределенныеЗначенияПараметров
	               |ГДЕ
	               |	CW_ПредопределенныеЗначенияПараметров.ВидСубъекта = &ВидСубъекта
	               |	И CW_ПредопределенныеЗначенияПараметров.Субъект = &Субъект";
	
	Запрос.УстановитьПараметр("ВидСубъекта"	, ВидСубъекта(ИмяРеквизита));
	Запрос.УстановитьПараметр("Субъект"		, Субъект); 

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Ответ = _УФКС.Ответ();
		Если (ИдентификаторФормы <> Неопределено) Тогда
			
			Ответ.Вставить("Параметры",ПоместитьВоВременноеХранилище(РезультатЗапроса.Выгрузить(),ИдентификаторФормы));
			
		Иначе
			
			Ответ.Вставить("Параметры",РезультатЗапроса.Выгрузить());
			
		КонецЕсли; 
		Возврат(Ответ);
		
	Иначе
		Возврат(_УФКС.Ответ(1));
	КонецЕсли; 
	
	// --- 
КонецФункции
Функция ДобавитьПредопределенныеПараметры(Объект,АдресПараметров) Экспорт 
	// --- 
	
	Если (ЭтоАдресВременногоХранилища(АдресПараметров)) Тогда
		ТЗПараметров = ПолучитьИзВременногоХранилища(АдресПараметров);
	Иначе
		ТЗПараметров = АдресПараметров;
	КонецЕсли; 
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_Заявки") Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ДляЗаявок", Истина);
	ИначеЕсли   ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ДляГрузоперевозок", Истина);
	ИначеЕсли   ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.CW_Заказы") Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ДляЗаказов", Истина);
	КонецЕсли; 
	
	МассивПараметров = ТЗПараметров.НайтиСтроки(Отбор);
	
	ЕстьИзменения 			= Ложь;
	ИмяТЧ 					= ТабличнаяЧастьПараметровОбъекта(Объект);
	
	Если (ТипЗнч(Объект[ИмяТЧ])=Тип("ТаблицаЗначений")) Тогда
		ТаблицаПараметровГП = Объект[ИмяТЧ];
	Иначе
		ТаблицаПараметровГП = Объект[ИмяТЧ].Выгрузить();
	КонецЕсли; 
	
	Для каждого Стр Из МассивПараметров Цикл
		
		СтрокаПараметра = _сф.к_НайтиСтроку(ТаблицаПараметровГП,"Параметр",Стр.Параметр);
		Если (СтрокаПараметра = Неопределено) Тогда
			
			Если (Стр.Добавлять) Тогда
				СтрокаПараметра = ТаблицаПараметровГП.Добавить();
				СтрокаПараметра.Параметр = Стр.Параметр;
				СтрокаПараметра.Значение = Стр.Значение;
				ЕстьИзменения = Истина;
			КонецЕсли; 
			
		Иначе
			
			Если (Стр.Перезаполнять) или Не ЗначениеЗаполнено(СтрокаПараметра.Значение) Тогда // условие "или" по AFR-250093 от 06.03.2025 20:19:03
				                         
				СтрокаПараметра.Значение = Стр.Значение;
				ЕстьИзменения = Истина;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если (ЕстьИзменения) Тогда
		Объект[ИмяТЧ].Загрузить(ТаблицаПараметровГП);
	КонецЕсли; 
	
	Возврат(_УФКС.Ответ(?(ЕстьИзменения,0,1)));
	
	// --- 
КонецФункции

#КонецОбласти

#Область БлокировкаГрузоперевозок

Функция ПолучитьДатуЗакрытия(Аналитика) Экспорт 
	// --- 
	
	Объект = Аналитика;
	
	Если ТипЗнч(Аналитика) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		
		Если НЕ Аналитика.Заказ.Пустая() Тогда
			
			Объект = Аналитика.Заказ;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_ЗакрытиеФинансов.ДатаЗакрытия
	|ИЗ
	|	РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
	|ГДЕ
	|	CW_ЗакрытиеФинансов.Аналитика = &Аналитика";
	Запрос.УстановитьПараметр("Аналитика", Объект);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 0 Тогда
		
		Возврат(Дата(1,1,1));
		
	Иначе
		
		Возврат(_сф.к_ПервыйЭлемент(ТЗ).ДатаЗакрытия);
		
	КонецЕсли; 
	
	// --- 
КонецФункции
Функция УстановитьДатуЗакрытия(Аналитика, Дата) Экспорт 
	// --- 
	
	Попытка
		
		НЗ = РегистрыСведений.CW_ЗакрытиеФинансов.СоздатьНаборЗаписей();
		_сф.УстановитьОтбор(НЗ.Отбор,"Аналитика",Аналитика);
		Если Дата = Дата(1,1,1) Тогда
			
			НЗ.Записать(Истина);
			
		Иначе
			
			Запись = НЗ.Добавить();
			Запись.Аналитика = Аналитика;
			Запись.ДатаЗакрытия = Дата;
			НЗ.Записать(Истина);
			
		КонецЕсли;
		
	Исключение
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	// --- 
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции
  
Функция ПроверитьЗакрытиеГрузоперевозок(Объект,ВыводитьРасшифровку=Ложь) Экспорт 
	// --- 
	
	Если (НЕ ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокировкиФинансов")) Тогда
		
		Возврат(Истина);
		
	КонецЕсли; 
	
	//Грузоперевозки = Объект.Услуги.Выгрузить(,"Грузоперевозка");
	//Грузоперевозки.Свернуть("Грузоперевозка");
	//_сф.т_ДобавитьКолонки(Грузоперевозки,"Аналитика");
	//Для каждого Стр Из Грузоперевозки Цикл
	//	Если Стр.Грузоперевозка.Заказ.Пустая() Тогда
	//		Стр.Аналитика = Стр.Грузоперевозка;
	//	Иначе
	//		Стр.Аналитика = Стр.Грузоперевозка.Заказ;
	//	КонецЕсли; 
	//КонецЦикла; 
	//ТЗАналитики = Грузоперевозки.Скопировать(,"Аналитика");
	//ТЗАналитики.Свернуть("Аналитика");
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	//               |	CW_ЗакрытиеФинансов.ДатаЗакрытия
	//               |ИЗ
	//               |	РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
	//               |ГДЕ
	//               |	CW_ЗакрытиеФинансов.Аналитика В(&Аналитика)";
	//Запрос.УстановитьПараметр("Аналитика", ТЗАналитики.ВыгрузитьКолонку("Аналитика"));
	//ТЗ = Запрос.Выполнить().Выгрузить();
	//Если ТЗ.Количество() = 0 Тогда
	//	
	//	Возврат(Истина);
	//	
	//Иначе
	//	
	//	Если ВыводитьРасшифровку Тогда
	//		
	//		Сообщить("");
	//		Возврат(Ложь);
	//		
	//	Иначе
	//		
	//		Возврат(Ложь);
	//		
	//	КонецЕсли; 
	//	
	//	
	//КонецЕсли; 
	
	тГрузоперевозки = Объект.Услуги.Выгрузить();
	мГрузопереовзки = тГрузоперевозки.ВыгрузитьКолонку("Грузоперевозка");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_Грузоперевозки.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА CW_Грузоперевозки.Заказ = ЗНАЧЕНИЕ(Справочник.CW_заказы.ПустаяСсылка)
	|			ТОГДА CW_Грузоперевозки.Ссылка
	|		ИНАЧЕ CW_Грузоперевозки.Заказ
	|	КОНЕЦ КАК Аналитика
	|ПОМЕСТИТЬ ВТ_Аналитика
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.Ссылка В(&мГрузопереовзки)";
	
	Запрос.УстановитьПараметр("мГрузопереовзки", мГрузопереовзки);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_ЗакрытиеФинансов.ДатаЗакрытия КАК ДатаЗакрытия
	|ИЗ
	|	РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
	|ГДЕ
	|	CW_ЗакрытиеФинансов.Аналитика В
	|			(ВЫБРАТЬ
	|				ВТ_Аналитика.Аналитика
	|			ИЗ
	|				ВТ_Аналитика КАК ВТ_Аналитика)";
	
	РезультатЗапроса =	Запрос.Выполнить();
	
	Возврат  РезультатЗапроса.Пустой();

	
	// --- 
КонецФункции
Функция ТаблицаЗакрытыхГрузоперевозок(Объект) Экспорт 
	// --- 
	
	Грузоперевозки = Объект.Услуги.Выгрузить(,"Грузоперевозка");
	Грузоперевозки.Свернуть("Грузоперевозка");
	_сф.т_ДобавитьКолонки(Грузоперевозки,"Аналитика,Заказ,ДатаЗакрытия");
	Для каждого Стр Из Грузоперевозки Цикл
		Стр.Заказ = Стр.Грузоперевозка.Заказ;
		Стр.ДатаЗакрытия = Дата(1,1,1);
		Если Стр.Грузоперевозка.Заказ.Пустая() Тогда
			Стр.Аналитика = Стр.Грузоперевозка;
		Иначе
			Стр.Аналитика = Стр.Грузоперевозка.Заказ;
		КонецЕсли; 
	КонецЦикла; 
	ТЗАналитики = Грузоперевозки.Скопировать(,"Аналитика");
	ТЗАналитики.Свернуть("Аналитика");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЗакрытиеФинансов.ДатаЗакрытия,
	               |	CW_ЗакрытиеФинансов.Аналитика
	               |ИЗ
	               |	РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
	               |ГДЕ
	               |	CW_ЗакрытиеФинансов.Аналитика В(&Аналитика)";
	Запрос.УстановитьПараметр("Аналитика", ТЗАналитики.ВыгрузитьКолонку("Аналитика"));
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		
		Отбор = Новый Структура("Аналитика",Стр.Аналитика);
		Строки = Грузоперевозки.НайтиСтроки(Отбор);
		Для каждого СтрГп Из Строки Цикл
			
			СтрГп.ДатаЗакрытия = Стр.ДатаЗакрытия;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	_сф.к_УдалитьЭлементыПоОтбору(Грузоперевозки,_сф.ст_Отбор("ДатаЗакрытия",Дата(1,1,1)));
	
	Возврат(Грузоперевозки);
	
	// --- 
КонецФункции
Функция ТаблицаЗакрытыхПоАналитике(МассивАналитик) Экспорт 
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ЗакрытиеФинансов.Аналитика,
	|	CW_ЗакрытиеФинансов.ДатаЗакрытия
	|ИЗ
	|	РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
	|ГДЕ
	|	CW_ЗакрытиеФинансов.Аналитика В(&Аналитика)";
	Запрос.УстановитьПараметр("Аналитика", МассивАналитик);
	Возврат(Запрос.Выполнить().Выгрузить());
	
	// --- 
КонецФункции

// закрытие мониторинга
Функция ПолучитьДатуЗакрытияМониторинга(Аналитика) Экспорт 
	// --- 
	
	Объект = Аналитика;
	
	Если ТипЗнч(Аналитика) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		
		Если НЕ Аналитика.Заказ.Пустая() Тогда
			
			Объект = Аналитика.Заказ;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ЗакрытиеМониторинга.ДатаЗакрытия
	               |ИЗ
	               |	РегистрСведений.CW_ЗакрытиеМониторинга КАК CW_ЗакрытиеМониторинга
	               |ГДЕ
	               |	CW_ЗакрытиеМониторинга.Аналитика = &Аналитика";
	Запрос.УстановитьПараметр("Аналитика", Объект);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 0 Тогда
		
		Возврат(Дата(1,1,1));
		
	Иначе
		
		Возврат(_сф.к_ПервыйЭлемент(ТЗ).ДатаЗакрытия);
		
	КонецЕсли; 
	
	// --- 
КонецФункции
Функция УстановитьДатуЗакрытияМониторинга(Аналитика, Дата) Экспорт 
	// --- 
	
	Попытка
		
		НЗ = РегистрыСведений.CW_ЗакрытиеМониторинга.СоздатьНаборЗаписей();
		_сф.УстановитьОтбор(НЗ.Отбор,"Аналитика",Аналитика);
		Если Дата = Дата(1,1,1) Тогда
			
			НЗ.Записать(Истина);
			
		Иначе
			
			Запись = НЗ.Добавить();
			Запись.Аналитика = Аналитика;
			Запись.ДатаЗакрытия = Дата;
			НЗ.Записать(Истина);
			
		КонецЕсли;
		
	Исключение
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	// --- 
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции


#КонецОбласти

#Область Прочее

Функция НомерКонтейнераКорректный(НомерКонтейнера) Экспорт
	// Возвращаемое значение: Истина - если номер корректный, Ложь - в противном случае
	
	Если СтрДлина(СокрЛП(НомерКонтейнера)) <> 11 Тогда
        Возврат Ложь;
    КонецЕсли;
    Для Ном = 1 по 4 Цикл
        КодСимволаИзСтроки = КодСимвола(НомерКонтейнера,Ном);
        Если (КодСимволаИзСтроки < 65) или (КодСимволаИзСтроки > 90) Тогда
            Возврат Ложь;
        КонецЕсли; 
    КонецЦикла;
    Для Ном = 5 по 11 Цикл
        КодСимволаИзСтроки = КодСимвола(НомерКонтейнера,Ном);
        Если (КодСимволаИзСтроки < 48) или (КодСимволаИзСтроки > 57) Тогда
            Возврат Ложь;
        КонецЕсли; 
    КонецЦикла;
    
    // сформируем таблицу кодировки символов...
    //-----------------------------------------
    СтрСимволов = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
    ТЗ = Новый ТаблицаЗначений;
    ТЗ.Колонки.Добавить("Символ");
    ТЗ.Колонки.Добавить("Значение");
    Сдвиг = -1;
    Для к = 1 по СтрДлина(СтрСимволов) Цикл
        СтрТЗ = ТЗ.Добавить();
        СтрТЗ.Символ = Сред(СтрСимволов,к,1);
        СтрТЗ.Значение = 10 + к + Сдвиг; 
        Сдвиг = Сдвиг + ?((к = 1) или (к = 11) или (к = 21),1,0);
    КонецЦикла;
    
    // расчитываем сумму по алгоритму...
    //----------------------------------
    Сумма = 0;
    Для к = 1 по 4 Цикл
        СтрТЗ = ТЗ.Найти(Сред(НомерКонтейнера,к,1),"Символ");
        Сумма = Сумма + Число(СтрТЗ.Значение) * Pow(2,к - 1);
    КонецЦикла;
    Для к = 5 по 10 Цикл
        Сумма = Сумма + Число(Сред(НомерКонтейнера,к,1)) * Pow(2,к - 1);
    КонецЦикла;
    
    // получим остаток от деления и 
    // сравним его с контрольной цифрой...
    //------------------------------------
    ОстатокОтДеления = Сумма % 11;
	Если (ОстатокОтДеления = 10) Тогда
		ОстатокОтДеления = 0;
	КонецЕсли; 
    Если ОстатокОтДеления <> Число(Сред(НомерКонтейнера,11,1)) Тогда
        Возврат Ложь;
    Иначе
        Возврат Истина;
    КонецЕсли; 
    
КонецФункции // НомерКонтейнераКорректный()
Функция ГрузоперевозкиЗаказа(Заказ,ТолькоНепомеченные=Истина) Экспорт 
	// --- 
	
	Если (НЕ ЗначениеЗаполнено(Заказ)) Тогда
		Возврат(Новый Массив);		
	КонецЕсли; 
	// ---------------------------------------------------------------------------- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_Грузоперевозки.Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.Заказ = &Заказ
	               |	И ВЫБОР
	               |			КОГДА &Пометка = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ CW_Грузоперевозки.ПометкаУдаления = ЛОЖЬ
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Пометка", ?(ТолькоНепомеченные,Ложь,Неопределено)); 
	// --- 
	Возврат(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	// --- 
КонецФункции
// --- 
Процедура ОбновитьКоличествоГрузоперевозокПоЗаказу(Заказ) Экспорт 
	// --- 
	
	Грузоперевозки = ГрузоперевозкиЗаказа(Заказ,Истина);
	// ---------------------------------------------------------------------------- 
	Запись = РегистрыСведений.CW_КоличествоГрузоперевозокПоЗаказам.СоздатьМенеджерЗаписи();
	// --- 
	Запись.Заказ = Заказ;
	Запись.Количество = Грузоперевозки.Количество();
	// --- 
	Запись.Записать(Истина);
	
	// --- 
КонецПроцедуры

Функция ПродолжитьЗаполнениеПредставленийНаСервереВФоне(МассивПредставлений, ДополнительныеПараметры)  Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Заполнение представлений грузоперевозок заказа";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("МассивГрузоперевозок", ДополнительныеПараметры.Грузоперевозки);
	ПараметрыПроцедуры.Вставить("МассивПредставлений", 	МассивПредставлений);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_Мониторинг.ОбновитьПредставлениеГрузоперевозок",ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции 

Процедура ОбновитьПредставлениеГрузоперевозок(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	ГраницаМассива = ПараметрыПроцедуры.МассивПредставлений.Количество() -1;
	
	СоответствиеПредставлений = Новый Соответствие;
	
	Для Индекс = 0 По ГраницаМассива Цикл
		
		Представление 	= ПараметрыПроцедуры.МассивПредставлений[Индекс];
		Грузоперевозка 	= ПараметрыПроцедуры.МассивГрузоперевозок[Индекс];
		
		ГрузоперевозкаОбъект = Грузоперевозка.ПолучитьОбъект();
		ГрузоперевозкаОбъект.CW_Представление 	= Представление;
		ГрузоперевозкаОбъект.Наименование 		= Представление;
		ГрузоперевозкаОбъект.Записать();
		
		СоответствиеПредставлений.Вставить(Грузоперевозка, Представление);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(СоответствиеПредставлений, АдресРезультата);
	
КонецПроцедуры     

Процедура ОбновитьПредставленияНаФорме(Форма, ВыделенныеСтроки, АдресРезультата) Экспорт
	
	Журнал_Данные = Форма.Журнал_Данные;
	
	СтрокаЖурнала = Журнал_Данные[0];
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаЖурнала, "ссылкаcw_представление") Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеПредставлений = ПолучитьИзВременногоХранилища(АдресРезультата);
	Для Каждого ИдентифкаторСтроки из ВыделенныеСтроки Цикл
		СтрокаЖурнала = Журнал_Данные.НайтиПоИдентификатору(ИдентифкаторСтроки);
		СтрокаЖурнала["ссылкаcw_представление"] =  СоответствиеПредставлений.Получить(СтрокаЖурнала.Ссылка);
	КонецЦикла;
	
КонецПроцедуры



#КонецОбласти 