&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Аналитика",Аналитика);
	Параметры.Свойство("ДатаЗакрытия",ДатаЗакрытия);
	ПереданнаяДата = ДатаЗакрытия;
	
	// --- 
	
	// определяем права
	ПравоЗакрытия = CW_ПраваДоступа.ПравоДоступно("БлокировкаМониторинга");
	ПравоОтменыЗакрытия = CW_ПраваДоступа.ПравоДоступно("ОтменаБлокировкиМониторинга");
	
	Если НЕ ПравоЗакрытия Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ФормаОК.Видимость = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОК(Команда)
	
	Ответ = _УстановитьДатуЗакрытия();
	Если _УФКС.ВыполненоУспешно(Ответ) Тогда
		
		ЭтаФорма.Закрыть(_УФКС.Ответ());
		
	Иначе
		
		_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _УстановитьДатуЗакрытия()
	// --- 
	
	Возврат(CW_Мониторинг.УстановитьДатуЗакрытияМониторинга(Аналитика,ДатаЗакрытия));
	
	// --- 
КонецФункции


&НаКлиенте
Процедура Сегодня(Команда)
	
	ДатаЗакрытия = ТекущаяДата();
	
КонецПроцедуры


&НаКлиенте
Процедура Очистить(Команда)
	
	Если (ПравоОтменыЗакрытия) Тогда
		ДатаЗакрытия = Дата(1,1,1);	
	Иначе
		_УФК.ВывестиПредупреждение("Недостаточно прав для отмены закрытия.");
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаЗакрытияПриИзменении(Элемент)
	
	Если ДатаЗакрытия = Дата(1,1,1) И ДатаЗакрытия <> ПереданнаяДата Тогда
		
		Если НЕ ПравоОтменыЗакрытия Тогда
			
			ДатаЗакрытия = ПереданнаяДата;
			_УФК.ВывестиПредупреждение("Недостаточно прав для отмены закрытия.");
			Возврат;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры
 
