
#Область ОсновныеСобытияФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	ИмяНастроек 		= "Настойки_CW_ОперацииМСФО";
	СтруктураНастройки 	= Обработки.CW_ОперацииМСФО.ПолучитьНастройки(ИмяНастроек);
	
	Если СтруктураНастройки <> Неопределено Тогда
		НастройкиМСФО.Добавить(СтруктураНастройки);
	КонецЕсли;
	
	_УстановитьПараметрыФункциональныхОпцийФормы();
	
	ВалютаРегламентированногоУчетаРубль 						= ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	КонтролироватьПолучениеОригиналовОтПоставщиков 				= ПолучитьФункциональнуюОпцию("CW_КонтролироватьПолучениеОригиналовОтПоставщиков");	
	
	ПравоРедактированияНомераДокумента 	= CW_ПраваДоступа.ПравоДоступно("РедактированиеНомераДокументаРасходыПоГрузоперевозкам");
	Элементы.Номер.ТолькоПросмотр 		=  НЕ ПравоРедактированияНомераДокумента;
	
	ОграничиватьУслугиПоДоговорам		= ПолучитьФункциональнуюОпцию("CW_ОграничиватьУслугиПоДоговорам");
	НачальнаяДатаДокумента 				= Объект.Дата;
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП
	
	
	Если ОграничиватьУслугиПоДоговорам Тогда
		УстанавливатьЦенуВЗависимостиОтГруза 	= ПолучитьФункциональнуюОпцию("CW_УстанавливатьЦенуВЗависимостиОтГруза");
		УстанавливатьЦенуВЗависимостиОтКлиента 	= ПолучитьФункциональнуюОпцию("CW_УстановкаЦенНоменклатурыВЗависимостиОтКлиента");
	КонецЕсли;
	
	
	// проверим на копирование
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Копия = Параметры.ЗначениеКопирования;
	КонецЕсли;	
	
	ЕстьОграниченияПоСпискуУслуг 	= Ложь; //по договору
	АдресУслугПоДоговору 			= "";
	
	// проверка лицензии
	Элементы.ГруппаИнфо.Видимость = Ложь;
	
	ОтображатьКомментарийДоговора = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОтображатьКомментарийДоговораВФормеВводаДокументовПоБюджету");
	
	УстановитьЗаголовокНадписиКомментарияДоговора();
	
	//Услуги по договру
	ОбновитьУслугиПоПротоколуНаСервере();
	
	Основание = _сф.ст_ПолучитьСвойство(Параметры,"Основание");
	Если Основание <> Неопределено Тогда
		
		Если (ТипЗнч(Основание) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда
			
			// проверяем, что онованием является счет
			Если НЕ (Основание.ПредъявленСчет И НЕ (Основание.ПредъявленАкт ИЛИ Основание.ПредъявленСФ)) Тогда
				
				ФлагОтменыОткрытия = Истина;
				ТекстОтменыОткрытия = "Ввод на основании доступен только для неактированного счёта!";
				Возврат;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (ТипЗнч(Основание) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
			
			// режим ввода на основании
			РежимВводаНаОсновании = Истина;
			ДокументОснование = Основание;
			Возврат;
			
		КонецЕсли; 
		
		Если (ТипЗнч(Основание)=Тип("СправочникСсылка.CW_Грузоперевозки")) Тогда
			
			// добавляем строку
			Нстр = Объект.Услуги.Добавить();
			Нстр.Грузоперевозка = Основание;
			// --- 
			_ОбновитьСтатусПометокУдаления();
			
		КонецЕсли; 
		
		Если (ТипЗнч(Основание)=Тип("СправочникСсылка.CW_Заказы")) Тогда
			
			// добавляем строку
			МассивГП = CW_Мониторинг.ГрузоперевозкиЗаказа(Основание);
			Для каждого ГП Из МассивГП Цикл
				
				Нстр = Объект.Услуги.Добавить();
				Нстр.Грузоперевозка = ГП;
				
			КонецЦикла; 
			
			_ОбновитьСтатусПометокУдаления();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// заполнение по бюджету
	АдресПараметровЗаполнения = _сф.ст_ПолучитьСвойство(Параметры,"АдресПараметровЗаполнения");
	Если (АдресПараметровЗаполнения <> Неопределено) Тогда
		
		СЗ = ПолучитьИзВременногоХранилища(АдресПараметровЗаполнения);
		ЗаполнитьЗначенияСвойств(Объект,СЗ,,"Услуги");
		// --- 
		Для каждого Стр Из СЗ.Услуги Цикл
			
			Нстр = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,Стр);
			
		КонецЦикла;
		
		_ОбновитьСтатусПометокУдаления();
		// 
		КомментарийЗаполнения = Неопределено;
		СЗ.Свойство("КомментарийЗаполнения",КомментарийЗаполнения);
		
	КонецЕсли; 
	
	_ИнициализацияФормы();
	ОбработатьИзменениеСоставаЦены();

	УстановитьУсловноеОформление();
	
	//Срок оплаты
	Если Не Параметры.Ключ.Пустая() Тогда
		ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(Параметры.Ключ);
		
		ДанныеСрокаОплаты.Свойство("ДатаОплаты",			_СрокОплаты);
		ДанныеСрокаОплаты.Свойство("Описание",				_СрокОплатыОписание);
		ДанныеСрокаОплаты.Свойство("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
		
		УстановитьОписаниеСрокаОплаты();	
	КонецЕсли; 
	//Срок оплаты
	
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ЦенаСНДС 		= CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ВДокументахЦенаСНДС");
		Объект.Валюта 			= Константы.ВалютаРегламентированногоУчета.Получить();
		Объект.Организация		= CW_Настройки.ОсновнаяОрганизация();
		Объект.Ответственный	= Пользователи.ТекущийПользователь();
		
		Если ВестиУчетПоПодразделениям и Не ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда
			Объект.ПодразделениеОрганизации = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ПодразделениеПользователя");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			_СформироватьОбщиеПараметры("УчетнаяПолитика");
		КонецЕсли;
		
	КонецЕсли;
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка);
	//Подсистема.СтатусыДокументов
	
	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.ОригиналыДокументов
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка );
	//Подсистема.УчетПриложенийДоговоров
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	//Внешние подклчюаемые команды

	ПервичныеДокументыПриСозданииНаСервере();

	#Область Динамический_вывод_дополнительных_колонок
	
	_УФС.ОбновитьСписокДополнительныхКолонокФормы(ЭтаФорма, "CW_РасходыПоГрузоперевозке");
	УстановитьВидимостьКнопкиОбновленияЗначений();
	
	
	//Обновляем динамические колонки параметров ГП
	Если Объект.Услуги.Количество() > 0 Тогда
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	КонецЕсли;
	
	#КонецОбласти
	

	
КонецПроцедуры

&НаСервере
Процедура _УстановитьПараметрыФункциональныхОпцийФормы()
	
	ПараметрыФункциональныхОпций = Новый Структура("CW_Пользователь", CW_Настройки.Пользователь());
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФункциональныхОпций);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// проверим на копирование
	Если ЗначениеЗаполнено(Копия) Тогда
		// проверим грузоперевозки
		Блок = _ПроверитьБлок();
		Если (Блок) Тогда
			Объект.Услуги.Очистить();
			_УФК.ВывестиПредупреждение("Документ содержит блокированые грузоперевозки." + Символы.ПС + "Табличная часть очищена.");
		КонецЕсли;		
		
		ОбновитьИтогиПоУслугам();
		ОбновитьИтогиПоАвансам();	
		ОбновитьИтогиПоАктированию();
	КонецЕсли;	
	
	
	Если (ЗначениеЗаполнено(КомментарийЗаполнения)) Тогда
		
		Сообщить(КомментарийЗаполнения);		
		
	КонецЕсли;
	
	Если ФлагОтменыОткрытия Тогда
		
		_УФК.ВывестиПредупреждение(ТекстОтменыОткрытия);
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	Если (РежимВводаНаОсновании) Тогда
		
		ПодключитьОбработчикОжидания("ДиалогВводаНаОсновании",0.1,Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов

	// для новых сохраняем срок оплаты
	Если (Объект.Ссылка.Пустая()) Тогда
		
		_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"СрокОплаты"						,_СрокОплаты);
		_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"СрокОплатыОписание"				,_СрокОплатыОписание);
		_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"СрокОплатыРучноеРедактирование"	,_СрокОплатыРучноеРедактирование);
		
	КонецЕсли;
	
	// признак интерактивного режима
	_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"ИнтерактивныйРежим",Истина);
	
	// тут перенесём доп. свойства в дополнительные свойства объекта
	_сф.ст_ДобавитьСвойства(ТекущийОбъект.ДополнительныеСвойства,"*",_ДС());
	ТекущийОбъект.ДС = ТекущийОбъект.ДополнительныеСвойства;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	_ОбновитьНомераДокументов();
	// --- 
	_УправлениеЭлементамиФормы();
	// --- 
	_ОбновитьСтатусПометокУдаления();
	_ОбновитьНадписиКорректировок();
	// --- 
	НачальнаяДатаДокумента = Объект.Дата;

	//Срок оплаты
	Если _СрокОплатыРучноеРедактирование и ЗначениеЗаполнено(_СрокОплаты) Тогда
		ЗаписатьСрокОплатыДокумента();  
	КонецЕсли;
	
	РасчитатьСрокОплатыДокумента();
	//Срок оплаты
	
	//Подсистема.СтатусыДокументов
	CW_СтатусыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.СтатусыДокументов
	
	//Подсистема.ОригиналыДокументов
	CW_ОригиналыДокументовСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	//Подсистема.ОригиналыДокументов

	_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами
	
	//Срок оплаты
	ДанныеСрокаОплаты = CW_Документы.ПолучитьСрокОплаты(Объект.Ссылка);
	ДанныеСрокаОплаты.Свойство("ДатаОплаты",			_СрокОплаты);
	ДанныеСрокаОплаты.Свойство("Описание",				_СрокОплатыОписание);
	ДанныеСрокаОплаты.Свойство("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
	
	УстановитьОписаниеСрокаОплаты();
	//Срок оплаты
	
	ОповеститьОбИзменении(Объект.Ссылка);
	_УправлениеЭлементамиФормы();
	
	Если (НЕ Объект.Корректировка) Тогда
		
		Если (ЗначениеЗаполнено(Объект.ВедомыйСчет)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйСчет);
		КонецЕсли;
		Если (ЗначениеЗаполнено(Объект.ВедомыйДокумент)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйДокумент);
		КонецЕсли; 
		Если (ЗначениеЗаполнено(Объект.ВедомыйСчетФактура)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйСчетФактура);
		КонецЕсли; 
		
	Иначе
		
		Если (ЗначениеЗаполнено(Объект.ВедомыйДокументКорректировки)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйДокументКорректировки);
		КонецЕсли; 
		Если (ЗначениеЗаполнено(Объект.ВедомыйСчетФактураКорректировочный)) Тогда
			ОповеститьОбИзменении(Объект.ВедомыйСчетФактураКорректировочный);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ВыполненаЗаписьДокумента") Тогда
		
		Прочитать();
		_УправлениеЭлементамиФормы();
		
	ИначеЕсли ИмяСобытия = "ОбновитьСписокУслугПоПротоколу" Тогда
		
		ОбновитьУслугиПоПротоколуНаСервере();
		
	ИначеЕсли ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
		
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	ИначеЕсли ИмяСобытия = "ОбновитьКоментарийДоговораНаФрме" Тогда
		
		УстановитьЗаголовокНадписиКомментарияДоговора();
		
	ИначеЕсли ИмяСобытия = "ОбновитьАдресУслугДоговора" Тогда
		
		ОбработатьОповещениеИзмененияСпискаУслуг() ;
		
	ИначеЕсли ИмяСобытия = "Запись_CW_Грузоперевозки" Тогда
		
		#Область Динамический_вывод_дополнительных_колонок
		
		ОбновитьЗначенияПараметровГрузоперевозокнаСервере();
		
		#КонецОбласти
		
	//Подсистема.СтатусыДокументов
	ИначеЕсли ИмяСобытия = "Изменение_СтатусДокумента" Тогда
		
		ОбработатьОповещениеИзменениеСтатусДокументаНаСервере();
	//Подсистема.СтатусыДокументов
	
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияПараметровГрузоперевозокнаСервере()
	
	Если Объект.Услуги.Количество() > 0 Тогда
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	КонецЕсли;
	
КонецПроцедуры	


&НаСервере
Процедура ОбработатьОповещениеИзмененияСпискаУслуг()
	
	АдресУслугПоДоговору = "";
	Если ОграничиватьУслугиПоДоговорам Тогда
		ЕстьОграниченияПоСпискуУслуг =?(ЗначениеЗаполнено(Объект.Договор), Объект.Договор.ОграничиватьНоменклатуру, Ложь);
		Если ЕстьОграниченияПоСпискуУслуг тогда  
			
			ДатаДокумента = Объект.Дата;
			Если Объект.ПредъявленСчет 
				И ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
				ДатаДокумента = Объект.ДатаСчета;  
			КонецЕсли;      
			
			АдресУслугПоДоговору = _УФС.ОбновитьСписокУслугПоДоговору(ДатаДокумента, Объект.Договор, ЭтаФорма);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	мВыбранныеКолонки = Новый Массив;
	
	Для Каждого ЭлементСписка из СписокДополнительныхКолонок Цикл
		Если ЭлементСписка.Пометка Тогда
			мВыбранныеКолонки.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Настройка = Новый Структура;
	Настройка.Вставить("ВыбранныеКолонки"	, мВыбранныеКолонки);
	
	ХранилищеСистемныхНастроек.Сохранить(ЭтаФорма.ИмяФормы, "CW_РасходыПоГрузоперевозке",Настройка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	ЗаполнитьДобавленныеКолонкиТаблиц("Услуги");
	
	//ДатыЗапретаИзменения
	//Проверяем дату запрета по документам БУ
	мОбъектыПроверки = ПолучитьМассивОбъектовДляПроверки();
	Для Каждого ЭлементМассива из мОбъектыПроверки Цикл
		//Есть ведомые документы, проверяем дату запрета редактирования БП
		ОбъектМассива = ЭлементМассива.ПолучитьОбъект();
		Разрешено = ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ОбъектМассива);
		Если не Разрешено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//ДатыЗапретаИзменения

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОбъектовДляПроверки()
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ВедомыйДокумент) Тогда
		Результат.Добавить(Объект.ВедомыйДокумент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчетФактура) Тогда
		Результат.Добавить(Объект.ВедомыйСчетФактура);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчет) Тогда
		Результат.Добавить(Объект.ВедомыйСчет);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйДокументКорректировки) Тогда
		Результат.Добавить(Объект.ВедомыйДокументКорректировки);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВедомыйСчетФактураКорректировочный) Тогда
		Результат.Добавить(Объект.ВедомыйСчетФактураКорректировочный);
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

&НаСервере
Процедура ОбновитьУслугиПоПротоколуНаСервере()
	
	Если ОграничиватьУслугиПоДоговорам и ЗначениеЗаполнено(Объект.Договор) Тогда
		ЕстьОграниченияПоСпискуУслуг =?(ЗначениеЗаполнено(Объект.Договор), Объект.Договор.ОграничиватьНоменклатуру, Ложь);
		
		Если ЕстьОграниченияПоСпискуУслуг Тогда
			ДатаДокумента = Объект.Дата;
			Если Объект.ПредъявленСчет 
				И ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
				ДатаДокумента = Объект.ДатаСчета;  
			КонецЕсли;      
			АдресУслугПоДоговору = _УФС.ОбновитьСписокУслугПоДоговору(ДатаДокумента, Объект.Договор, ЭтаФорма);
		КонецЕсли;
		
	КонецЕсли;
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.УслугиНоменклатура);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияПоСпискуУслуг);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);

КонецПроцедуры

&наСервере
Процедура УстановитьЗаголовокНадписиКомментарияДоговора()
	
	КомментарийДоговора = ?(Объект.Договор.Пустая(),"", СокрЛП(Объект.Договор.Комментарий));
	
	Элементы.НадписьКомментарийДоговора.Видимость = ОтображатьКомментарийДоговора и ЗначениеЗаполнено(КомментарийДоговора);
	Элементы.НадписьКомментарийДоговора.Заголовок = КомментарийДоговора;
	
КонецПроцедуры


#КонецОбласти 

#Область ИнициализацияФормы 

&НаСервере
Процедура _ИнициализацияФормы()
	
	// заполнение данных
	_СформироватьОбщиеПараметры();
	_ПроверитьРежимВводаОстатков();
	_СформироватьКурс();
	_ОбновитьНомераДокументов();
	
	// --- 
	Если (Объект.Ссылка.Пустая()) Тогда
		
		Объект.Ответственный = Неопределено;
		
	КонецЕсли; 
	// --- 
	
	// для документов "счет" обновим таблицу связанных актов и оплат
	ВыводитьСвязанныеАктыОплаты = (НЕ Объект.Ссылка.Пустая()); 
	ВыводитьСвязанныеАктыОплаты = (ВыводитьСвязанныеАктыОплаты И НЕ (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ));
	ВыводитьСвязанныеАктыОплаты = (ВыводитьСвязанныеАктыОплаты И НЕ Объект.Корректировка);
	Если (ВыводитьСвязанныеАктыОплаты) Тогда
		_ОбновитьАкты();
		_ОбновитьОплаты();
    КонецЕсли; 
	
	// проверяем на закрытие (кроме корректировки)
	Если (НЕ РеквизитФормыВЗначение("Объект").ПроверитьЗакрытиеГрузоперевозок() И НЕ Объект.Корректировка) Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ГруппаИнфо.Видимость = Истина;
		Элементы.ДекорацияИнфо.Заголовок = "Документ доступен только для просмотра, т.к. содержит блокированные грузоперевозки!";
		// --- 
		Элементы.УслугиИзменить.Доступность = Ложь;
		Элементы.УслугиУслуги_ПереформироватьПредставление.Доступность = Ложь;
		// --- 
		Элементы.ЗачетАвансов.ТолькоПросмотр = Истина;
		Элементы.ЗачетАвансовОЗ.ТолькоПросмотр = Истина;
		// --- 
		Элементы.ЗачетАвансовЗаполнитьАвансы.Доступность = Ложь;
		Элементы.ЗачетАвансовОЗ_Заполнить.Доступность = Ложь;
		// --- 
		Элементы.ЗачетАвансовАвансы_Открыть.Доступность = Ложь;
		Элементы.ЗачетАвансовОЗ_Открыть.Доступность = Ложь;
		// --- 
		Элементы.ЗачетАвансовУдалить.Доступность = Ложь;
		Элементы.ЗачетАвансовОЗ_Удалить.Доступность = Ложь;
		// --- 
		Элементы.ЗачетАвансовАвансы_Очистить.Доступность = Ложь;
		Элементы.ЗачетАвансовОЗ_Очистить.Доступность = Ложь;
		
	КонецЕсли; 
	
	//// видимость доп.действий
	//СписокДействий = _СписокДействий();
	//Если (СписокДействий.Количество() = 0) Тогда
	//	Элементы.ФормаВнешниеДействия.Видимость = Ложь;
	//КонецЕсли; 
	
	// права
	Если ЭтотОбъект.ТолькоПросмотр = Ложь Тогда
		_ПраваДоступа();
	КонецЕсли; 
	
	// обновляем итоговые строки табличных частей 
	ОбновлятьИтоги = (НЕ Объект.Корректировка);
	Если (ОбновлятьИтоги) Тогда
		ОбновитьИтогиПоУслугам();
		ОбновитьИтогиПоАвансам();
		_ОбновитьОплаты();	
	КонецЕсли; 
	
	
	// маркеры блокированных грузоперевозок
	АдресДефис = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.CW_ЭлементСписка, ЭтаФорма.УникальныйИдентификатор);
	АдресЗамок = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.CW_Замок, ЭтаФорма.УникальныйИдентификатор);
	ПометитьГрузоперевозки();
	
	Элементы.УслугиЕИ.Видимость = _ДС().НП.ОтображатьЕИ;
	Элементы.УслугиКорректировкаЕИ.Видимость = _ДС().НП.ОтображатьЕИ;
	
	//КонтрольДокументовПоСумме = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"КонтрольВходящихДокументовПоСумме");
	структураНастройкиПользователя = CW_Настройки.ПолучитьНастройкиПользователя();    
	ПодразделениеПользователя = структураНастройкиПользователя.ПодразделениеПользователя;
	КонтрольДокументовПоСумме = структураНастройкиПользователя.КонтрольВходящихДокументовПоСумме;
	
	//// регенерация формы
	//МассивИсключаемых = Новый Массив;
	//МассивИсключаемых.Добавить("Объект.Услуги.Грузоперевозка");
	//МассивИсключаемых.Добавить("Объект.Услуги.Номенклатура");
	//МассивИсключаемых.Добавить("Объект.Услуги.СтатьяЗатрат");
	//МассивИсключаемых.Добавить("Объект.Услуги.Подразделение");
	//_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма, МассивИсключаемых);
	// --- 
	_УправлениеЭлементамиФормы();
	_ОбновитьСтатусПометокУдаления();
	_ОбновитьНадписиКорректировок();
	
	//Элементы.ФинСтатус.Видимость = _ДС().НП.ВыводитьФинансовыйСтатусВДокументах;
	
	// --- 
	
	Элементы.ПредставлениеАкта.Видимость 			= ВалютаРегламентированногоУчетаРубль;
	Элементы.ПредставлениеСчетаФактуры.Видимость 	= ВалютаРегламентированногоУчетаРубль;
	
КонецПроцедуры
 

&НаСервере
Процедура _ПраваДоступа()
	ПравоРедактирования = (CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Счета") 
						ИЛИ CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Акты"));
						
	Если (Объект.Корректировка) Тогда
		
		ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Корректировки");
		
	КонецЕсли; 
						
	ПравоПросмотраБухгалтерскихОбъектов = CW_ПраваДоступа.ДоступныОбъектыБухгалтерии();
	Элементы.ГруппаКорректируемыйДокумент.Видимость = Объект.Корректировка;
	Элементы.ГруппаВедомыеДокументы.Видимость = ПравоПросмотраБухгалтерскихОбъектов И НЕ Объект.Корректировка;
	Элементы.ГруппаВедомыеДокументыКорректировки.Видимость = ПравоПросмотраБухгалтерскихОбъектов И Объект.Корректировка;
	Элементы.ФормироватьВедомыеДатойДокумента.Видимость = (НЕ Объект.Корректировка);
	
	
	// получим значение базовой валюты
	БазоваяВалютаРубль = Константы.CW_ВалютаРегламентированногоУчетаРубль.СоздатьМенеджерЗначения();
	БазоваяВалютаРубль.Прочитать();
	
	// Проверяем, не пакетный ли документ. Проверку выполняем только если базовая валюта "Рубль",
	// т.к. для иных базовых валют акты не используются.						
	Если (НЕ Объект.Ссылка.Пустая() И ПравоРедактирования и БазоваяВалютаРубль.Значение) Тогда
	
		Если (НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Акты")) Тогда
			
			Пакетный = Ложь;
			// проверяем, что он не пакетный
			Если (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ) Тогда
				
				Пакетный = Истина;
				
			КонецЕсли; 
			
			Актированный = Ложь;
			Если (НЕ Пакетный) Тогда
				
				// проверяем, что нет сформированных актов
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				               |	CW_СоответствиеАктовВходящимСчетам.Акт
				               |ИЗ
				               |	РегистрСведений.CW_СоответствиеАктовВходящимСчетам КАК CW_СоответствиеАктовВходящимСчетам
				               |ГДЕ
				               |	CW_СоответствиеАктовВходящимСчетам.Счет = &Счет";
				Запрос.УстановитьПараметр("Счет", Объект.Ссылка);
				ТЗ = Запрос.Выполнить().Выгрузить();
				Если (ТЗ.Количество() <> 0) Тогда
					
					Актированный = Истина;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			Если (Пакетный ИЛИ Актированный) Тогда
				
				ПравоРедактирования = Ложь;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
						
	Если (НЕ ПравоРедактирования ИЛИ ЭтаФорма.ТолькоПросмотр) Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		// --- 
		Элементы.УслугиОчиститьТабличнуюЧастьУслуг.Видимость = Ложь;
		Элементы.УслугиУслуги_ГрупповоеРедактирование.Видимость = Ложь;
		Элементы.УслугиИзменить.Доступность = Ложь;
		Элементы.УслугиУслуги_ПереформироватьПредставление.Доступность = Ложь;
		
	КонецЕсли; 
	

	Элементы.УслугиСтавкаНДС.Доступность = CW_ПраваДоступа.ПравоДоступно("РедактированиеСтавкиНДС");
	

КонецПроцедуры

&НаСервере
Процедура _ПроверитьРежимВводаОстатков()
	
	//---------------------------------------------------------------------
	// начало ведения бухгалтерского учета с применением дополнительного модуля
	//---------------------------------------------------------------------
	
	// контроль параметров учетной политики можно осуществить только при условии того, 
	// что в документе были заполнены организация и договор
	Если _ДС().Свойство("УП") Тогда
		ВводОстатковБУ = _ДС().УП.ВводОстатковБУ;
		ДатаНачалаВеденияУчетаБУ = _ДС().УП.ДатаНачалаВеденияУчетаБУ;
		
		РаздельныйУчетЗаполженности = _ДС().УП.РаздельныйУчетОперативнойИБухгалтерскойЗадолженности;
		ПереплатаКакАванс 			= _ДС().УП.УчитыватьПереплатыПоДокументамКакАванс;
		
		ОперативныйУчет = _ДС().УП.ОЗ;
		ВводОстатковОЗ = _ДС().УП.ВводОстатковОЗ;
		ДатаНачалаВеденияУчетаОЗ = _ДС().УП.ДатаНачалаВеденияУчетаОЗ;
	Иначе
		ВводОстатковБУ = Дата(1,1,1);
		ДатаНачалаВеденияУчетаБУ = Дата(1,1,1);
		
		РаздельныйУчетЗаполженности = Истина;
		ПереплатаКакАванс 			= Ложь;

		ОперативныйУчет = Ложь;
		ВводОстатковОЗ = Ложь;
		ДатаНачалаВеденияУчетаОЗ = Дата(1,1,1);
	КонецЕсли;

	//// если режим ввода остатков, то формируем заголовки 
	//Если ВводОстатковБУ Тогда
	//	Элементы.УслугиВводОстатков.Заголовок = "Не перевыставлены на "+Формат(ДатаНачалаВеденияУчетаБУ,"ДФ=dd.MM.yyyy");
	//	Элементы.ГруппаНачальныеОстаткиБУ.Заголовок = "Сальдо по бухгалтерскому учёту на "+Формат(ДатаНачалаВеденияУчетаБУ,"ДФ=dd.MM.yyyy");
	//КонецЕсли; 
	
	// если по каким-то причинам режим ввода остатков БУ по документу отличается от текущей ситуации
	Если Объект.ВводОстатковБУ <> ВводОстатковБУ Тогда
		Объект.ВводОстатковБУ = ВводОстатковБУ;
	КонецЕсли; 
	
	//---------------------------------------------------------------------
	// начало ведения учета оперативной кредиторской задолженности в модуле 
	//---------------------------------------------------------------------
	
	//ОперативныйУчет = _ДС().УП.ОЗ;
	//ВводОстатковОЗ = _ДС().УП.ВводОстатковОЗ;
	//ДатаНачалаВеденияУчетаОЗ = _ДС().УП.ДатаНачалаВеденияУчетаОЗ;
	
	// если режим ввода остатков, то формируем заголовки 
	//Если ВводОстатковОЗ Тогда
	//	Элементы.ГруппаНачальныеОстаткиОЗ.Заголовок = "Сальдо по оперативному учёту на "+Формат(ДатаНачалаВеденияУчетаОЗ,"ДФ=dd.MM.yyyy");
	//	Элементы.УслугиНеактированноеСальдо.Заголовок = "Неактированное сальдо на "+Формат(ДатаНачалаВеденияУчетаОЗ,"ДФ=dd.MM.yyyy");
	//КонецЕсли; 
	//
	// если по каким-то причинам режим ввода остатков ОЗ по документу отличается от текущей ситуации
	Если Объект.ВводОстатковОЗ <> ВводОстатковОЗ Тогда
		Объект.ВводОстатковОЗ = ВводОстатковОЗ;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ПроверитьБлок()
	// --- 
	
	Блок = Ложь;
	Для Каждого Стр из Копия.Услуги Цикл
		Если НЕ ПроверитьГрузоперевозку(?(ЗначениеЗаполнено(Стр.Грузоперевозка.Заказ), Стр.Грузоперевозка.Заказ, Стр.Грузоперевозка)) Тогда 
			Блок = Истина;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат(Блок);
	
	// --- 
КонецФункции

&НаСервере
Процедура ПометитьГрузоперевозки()
	
	Для Каждого Стр из Объект.Услуги Цикл
		Попытка
			Если ПроверитьГрузоперевозку(?(ЗначениеЗаполнено(Стр.Грузоперевозка.Заказ), Стр.Грузоперевозка.Заказ, Стр.Грузоперевозка)) Тогда
				//Стр.БлокГП = АдресДефис;
				Стр.БлокГП = Неопределено;
			Иначе
				Стр.БлокГП = АдресЗамок;
			КонецЕсли;	
		исключение
			Стр.БлокГП = Неопределено;
		КонецПопытки;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Функция ПроверитьГрузоперевозку(ГП)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ЗакрытиеФинансов.Аналитика
		|ИЗ
		|	РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
		|ГДЕ
		|	CW_ЗакрытиеФинансов.Аналитика = &Аналитика";
	Запрос.УстановитьПараметр("Аналитика", ГП);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ?(ТЗ.Количество() = 0, Истина, Ложь);
	
КонецФункции	


&НаСервере
Функция _ПризнакБлокировки(ПроверяемыйОбъект)
	// --- 
	
	Блок = Ложь;
	Для Каждого Стр из ПроверяемыйОбъект.Услуги Цикл
		Если НЕ ПроверитьГрузоперевозку(?(ЗначениеЗаполнено(Стр.Грузоперевозка.Заказ), Стр.Грузоперевозка.Заказ, Стр.Грузоперевозка)) Тогда 
			Блок = Истина;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат(Блок);
	
	// --- 
КонецФункции

#КонецОбласти 

#Область ОбщиеПараметры 

Функция _ДС()
	Возврат(ДС[0].Значение);
КонецФункции

&НаСервере
Процедура _СформироватьОбщиеПараметры(СписокПараметров=Неопределено)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.СформироватьОбщиеПараметры(СписокПараметров);
	
	Если СписокПараметров = Неопределено Тогда
		ДС.Очистить();
		ДС.Добавить(ДокументОбъект.ДополнительныеСвойства);
	Иначе
		
		СоответствиеПарамеров = Новый Соответствие;
		СоответствиеПарамеров.Вставить("ПараметрыДоговора","ПД");
		СоответствиеПарамеров.Вставить("Константы","КО");
		СоответствиеПарамеров.Вставить("УчетнаяПолитика","УП");
		СоответствиеПарамеров.Вставить("НастройкиПользователя","НП");
		
		МассивПараметров = _сф.м_СоздатьИзСтроки(СписокПараметров,",");
		
		ДСС = _ДС();
		
		Для каждого Параметр Из МассивПараметров Цикл
			
			Ключ = СоответствиеПарамеров.Получить(Параметр);
			_сф.ст_УстановитьСвойство(ДСС,Ключ,ДокументОбъект.ДополнительныеСвойства[Ключ]);
			
		КонецЦикла; 
		
		ДС.Очистить();
		ДС.Добавить(ДСС);
		
	КонецЕсли; 
	
	_ПроверитьРежимВводаОстатков();
	
КонецПроцедуры

#КонецОбласти 

#Область УправлениеЭлементамиФормы

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	Если (Объект.Корректировка) Тогда
		
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Контрагент.ТолькоПросмотр = Истина;
		Элементы.Договор.ТолькоПросмотр = Истина;
		// --- 
		Элементы.ГруппаВводНаОсновании.Видимость = Ложь;
		
	КонецЕсли; 
	
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);
	
	ЗачетАвансовБУ = ((Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ) И ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет);
	ЗачетАвансовОЗ = (Объект.ПредъявленСчет И _ДС().УП.ОЗ);
	
	// шапка
	Элементы.КурсВалюты.Видимость = (НЕ Объект.Валюта.Пустая() И Объект.Валюта <> _ДС().КО.ВалютаРегламентированногоУчета);
//	Элементы.КурсВалюты.КнопкаВыбора = (Объект.Договор.ВзаиморасчетыВУЕ);
//	Элементы.КурсВалюты.ТолькоПросмотр = НЕ Объект.Договор.ВзаиморасчетыВУЕ;
	
	// видимость закладок
	Элементы.СтраницаУслуги.Видимость = (НЕ Объект.Корректировка);
	Элементы.СтраницаАкты.Видимость = (Объект.ПредъявленСчет) И (НЕ Объект.Ссылка.Пустая()) И НЕ (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ) И (НЕ Объект.Ссылка.Пустая()) И НЕ Объект.Корректировка и ВалютаРегламентированногоУчетаРубль;
	Элементы.СтраницаУслугиКорректировка.Видимость = (Объект.Корректировка);
	Элементы.СтраницаОплаты.Видимость = (НЕ Объект.Ссылка.Пустая() И _ДС().УП.ОЗ И Объект.ПредъявленСчет И НЕ Объект.Корректировка);
	Элементы.СтраницаЗачетАвансов.Видимость = (Объект.СпособЗачетаАвансов=Перечисления.СпособыЗачетаАвансов.ПоДокументу И ЗачетАвансовБУ);
	Элементы.СтраницаЗачетАвансовОЗ.Видимость = (Объект.СпособЗачетаАвансовОЗ=Перечисления.СпособыЗачетаАвансов.ПоДокументу И ЗачетАвансовОЗ);
	Элементы.СтраницаПлатёжноРасчётныеДокументы.Видимость = 
		Объект.ПредъявленСФ И
		(Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.ПоДокументу)
	;
	Элементы.ПлатёжноРасчётныеДокументы.ТолькоПросмотр = НЕ (Объект.ПредъявленСФ И (Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ=Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.ПоДокументу));
	
	// заголовки закладок
	Элементы.СтраницаКомментарий.Заголовок = " Комментарий" +?(ЗначениеЗаполнено(Объект.Комментарий)," (*)","");
	Элементы.СтраницаУслуги.Заголовок = " Услуги (" +Объект.Услуги.Количество() + ")";
	Элементы.СтраницаАкты.Заголовок = " Акты (" +ТаблицаАктов.Количество() + ")";
	Элементы.СтраницаЗачетАвансов.Заголовок = " Зачет бух. авансов (" +Объект.ЗачетАвансов.Количество() + ")";
	Элементы.СтраницаЗачетАвансовОЗ.Заголовок = " Зачет упр. авансов (" +Объект.ЗачетАвансовОЗ.Количество() + ")";
	Элементы.СтраницаПлатёжноРасчётныеДокументы.Заголовок = " Платёжно-расчётные документы с/ф (" + Объект.ПлатёжноРасчётныеДокументы.Количество() + ")";
	Элементы.СтраницаОплаты.Заголовок = " Оплаты (" +ТаблицаОплат.Количество() + ")";
	
	// ведомый счет
	Элементы.ВедомыйСчет_Удалить.Видимость = НЕ Объект.ВедомыйСчет.Пустая() И НЕ (Объект.ПредъявленСчет);
	Элементы.ГруппаДействияСВедомымСчетом.Видимость = НЕ Объект.ВедомыйСчет.Пустая() И (Элементы.ВедомыйСчет_Удалить.Видимость);
	
	// ведомый документ
	Элементы.ВедомыйДокумент_Движения.Видимость = (НЕ Объект.ВедомыйДокумент.Пустая()) И (Объект.ВедомыйДокумент.Проведен);
	Элементы.ВедомыйДокумент_Удалить.Видимость = НЕ Объект.ВедомыйДокумент.Пустая() И НЕ (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ);
	Элементы.ГруппаДействияСВедомым.Видимость = НЕ Объект.ВедомыйДокумент.Пустая() И (Элементы.ВедомыйДокумент_Движения.Видимость ИЛИ Элементы.ВедомыйДокумент_Удалить.Видимость);
	// ведомый с/ф
	Элементы.ВедомыйСчетФактура_Движения.Видимость = (НЕ Объект.ВедомыйСчетФактура.Пустая()) И (Объект.ВедомыйСчетФактура.Проведен);
	Элементы.ВедомыйСчетФактура_Удалить.Видимость = НЕ Объект.ВедомыйСчетФактура.Пустая() И НЕ Объект.ПредъявленСФ;
	Элементы.ГруппаДействияСВедомойСчетФактурой.Видимость = НЕ Объект.ВедомыйСчетФактура.Пустая() И (Элементы.ВедомыйСчетФактура_Движения.Видимость ИЛИ Элементы.ВедомыйСчетФактура_Удалить.Видимость);
	
	// ввод остатков
	Элементы.ГруппаНачальныеОстаткиБУ.Видимость = ВводОстатковБУ  И (Объект.ПредъявленАкт ИЛИ Объект.ПредъявленСФ);
	Элементы.ГруппаНачальныеОстаткиОЗ.Видимость = ВводОстатковОЗ И Объект.ПредъявленСчет;
	
	// таблица услуг
	Элементы.УслугиВсего.ТолькоПросмотр = (НЕ _ДС().НП.ОбратныйПересчетВДокументах);
	
	Элементы.ИтогоПоОплатамСчета.Видимость = Объект.ПредъявленСчет;
	Элементы.ИтогоПоОплатамАкта.Видимость = Ложь;
	
	//// кнопки нижней панели и меню "Действия"
	//  Элементы.ФормаОбщаяКомандаCW_Печать.Видимость = (НЕ Объект.Ссылка.Пустая());
	//Элементы.ФормаОбщаяКомандаCW_ФайлыАрхива.Видимость = Константы.CW_ИспользованиеФайловогоАрхива.Получить();
	
	// итоговые строки табличных частей
	ОбновитьИтогиПоУслугам();
	ОбновитьИтогиПоАвансам();
//	ОбновитьИтогиПоАктированию();
	ОбновитьИтогиПоОплатам();
	
	Попытка
		РаздельныйУчетВходящегоНДС = _ДС().УП.РаздельныйУчетНДСНаСчете19;	
	Исключение
	    РаздельныйУчетВходящегоНДС = Ложь;
	КонецПопытки; 
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

#Область ПакетДокументов 

&НаСервере
Функция _ДокументСодержитБлокированныеГП()
	Возврат НЕ РеквизитФормыВЗначение("Объект").ПроверитьЗакрытиеГрузоперевозок();	
КонецФункции

// --- 

&НаСервере
Процедура _ОбновитьНомераДокументов()
	
	// счет предоставлен
	Если Объект.ПредъявленСчет Тогда
		
		ПредставлениеСчета = "Счёт №"+СокрЛП(Объект.НомерСчета)+" от "+Формат(Объект.ДатаСчета,"ДФ=dd.MM.yyyy");
		
		//План оплаты
		ПредставлениеСрокаОплаты = "";
		ДанныеПланаОплаты = CW_Документы.ПолучитьПланОплаты(Объект.Ссылка);
		Если Не ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) и НЕ ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
			ПредставлениеСрокаОплаты = ", План оплаты: <...>";
		ИначеЕсли ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) Тогда
			ПредставлениеСрокаОплаты = ", План оплаты: "+Формат(ДанныеПланаОплаты.Дата,"ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Если Не ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
			ПредставлениеСрокаОплаты = ПредставлениеСрокаОплаты + " ("+СокрЛП(ДанныеПланаОплаты.Примечание)+")";
		КонецЕсли; 
		//План оплаты
		
		ПредставлениеСчета = ПредставлениеСчета + ПредставлениеСрокаОплаты;
		
	// счет не предоставлен
	Иначе
		ПредставлениеСчета = "<Счёт не предоставлен>";
	КонецЕсли; 
	
	// предоставлен акт 
	Если Объект.ПредъявленАкт Тогда
		
		ПредставлениеАкта = "Акт №"+СокрЛП(Объект.НомерАкта)+" от "+Формат(Объект.ДатаАкта,"ДФ=dd.MM.yyyy");
		
		Если (НЕ Объект.Корректировка) Тогда
			Если Объект.СписокСчетов Тогда
				Если Не ВводОстатковОЗ Тогда
					_сф.стр_Добавить(ПредставлениеАкта,"  к списку счетов");
				КонецЕсли;
			Иначе
				Если НЕ Объект.ПредъявленСчет Тогда
					Если Объект.Счет.Пустая() Тогда
						_сф.стр_Добавить(ПредставлениеАкта,"  к счёту <не указан>");
					Иначе
						_сф.стр_Добавить(ПредставлениеАкта,"  к счёту №"+Строка(Объект.Счет.НомерСчета)+" от "+Формат(Объект.Счет.ДатаСчета,"ДФ=dd.MM.yyyy"));
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли; 
		
	// акт предоставлен	
	Иначе
		ПредставлениеАкта = "<Акт не предоставлен>";
	КонецЕсли; 
	
	
	// с/ф предоставлена 
	Если Объект.ПредъявленСФ Тогда
		ПредставлениеСчетаФактуры = "С/ф №"+СокрЛП(Объект.НомерСФ)+" от "+Формат(Объект.ДатаСФ,"ДФ=dd.MM.yyyy");
		Если Не Объект.Продавец.Пустая() Тогда
			ПредставлениеСчетаФактуры = ПредставлениеСчетаФактуры + "  продавец " + Объект.Продавец;
		КонецЕсли;
		
	// с/ф не предоставлена 
	Иначе
		ПредставлениеСчетаФактуры = "<С/ф не предоставлен>";
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СформироватьКурс()
	// --- 
	
	Если НЕ Объект.Валюта.Пустая() И (Объект.Валюта <> _ДС().КО.ВалютаРегламентированногоУчета) Тогда
		
		Если (НЕ Объект.УЕ_ПользовательскийКурс) Тогда
			СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,_ДатаВозникновенияЗадолженности());
			ТекущийКурс = СК.Курс;	
		Иначе
			СК = Новый Структура("Курс,Кратность",Объект.УЕ_Курс,Объект.УЕ_Кратность);
		КонецЕсли; 
		// --- 
		КурсВалюты = Строка(Объект.Валюта)+" = "+Формат(СК.Курс,"ЧЦ=15; ЧДЦ=4; ЧГ=");
		Если СК.Кратность <> 1 Тогда
			
			_сф.стр_Добавить(КурсВалюты,"/"+Формат(СК.Кратность,"ЧЦ=10; ЧГ="));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДатаКурса()
	// --- 
	
	Если (Объект.ПредъявленАкт) Тогда
		
		Возврат(Объект.ДатаАкта);
		
	ИначеЕсли (Объект.ПредъявленСчет) Тогда 
		
		Возврат(Объект.ДатаСчета);
		
	Иначе
		
		Возврат(Объект.Дата);
		
	КонецЕсли; 
	
	// --- 
КонецФункции
 

&НаСервере
Функция _ДатаВозникновенияЗадолженности()
	
	Если ЗначениеЗаполнено(Объект.ДатаСчета) И Объект.ПредъявленСчет Тогда
		Возврат(Объект.ДатаСчета);		
	Иначе
		Возврат(Объект.Дата);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаписатьСрокОплатыДокумента() 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Счет", 					Объект.Ссылка);
	СтруктураПараметров.Вставить("ДатаОплаты", 				_СрокОплаты);
	СтруктураПараметров.Вставить("Описание", 				_СрокОплатыОписание);
	СтруктураПараметров.Вставить("РучноеРедактирование", 	_СрокОплатыРучноеРедактирование);

	РегистрыСведений.CW_СрокиОплатыСчетов.ЗаписатьСрокОплатыДокумента(СтруктураПараметров); 

КонецПроцедуры


&НаСервере
Процедура РасчитатьСрокОплатыДокумента()

	Если Объект.Ссылка.Пустая() или _СрокОплатыРучноеРедактирование Тогда
		//или ЗначениеЗаполнено(_СрокОплаты) Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокРасчетаСрокаОплаты = _ДС().ПД.УсловияОплаты.ПорядокРасчета; 
	Если Объект.ПредъявленСчет и Не Объект.ПредъявленАкт 
		и ПорядокРасчетаСрокаОплаты = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ОтсрочкаОтДатыВозвратаАкта") Тогда
		Возврат;
	Конецесли;	
	
	СтруктураДанных = CW_Документы.ПодготовитьДанныеДляРасчетаСрокаОплаты(Объект);
	_СрокОплаты 	= CW_Документы.РассчитатьСрокОплаты(СтруктураДанных);
	
	ЗаписатьСрокОплатыДокумента();
	
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеДаты 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	_ДатаПриИзменении();
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если (_ГодИзменился()) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаИзмененияГода",ЭтотОбъект, Новый Структура()); 
		ПоказатьВопрос(ПОВ,"Дата документа перенесена в другой год."+Символы.ПС+ 
		"Документу будет присвоен новый номер."+Символы.ПС+ 
		"Продолжить?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВопросаИзмененияГода(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			// присваевам новый номер
			_ОбработатьИзменениеГода();
			
		Иначе
			
			// восстанавливаем дату по ссылке
			_ВосстановитьДатуДокумента();
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбработатьИзменениеГода()
	// --- 
	
	НачальнаяДатаДокумента = Объект.Дата;
	// --- 
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	// --- 
	_ДатаПриИзменении();
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _ВосстановитьДатуДокумента()
	// --- 
	
	Объект.Дата = НачальнаяДатаДокумента;
	
	// --- 
КонецПроцедуры
 

&НаСервере
Функция _ГодИзменился()
	// --- 
	
	Возврат(Год(Объект.Дата) <> Год(НачальнаяДатаДокумента));
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура ДатаОчистка(Элемент, СтандартнаяОбработка)
	_ДатаПриИзменении();
КонецПроцедуры

&НаСервере
Процедура _ДатаПриИзменении()
	
	// если очистили дату, то принудительно 
	// устанавливаем текущую дату
	Если Объект.Дата = Дата(1,1,1) Тогда
		ДатаСтрокой = Формат(ТекущаяДата(),"ДФ=yyyyMMdd");
		ВремяСтрокой = Формат(ТекущаяДата(),"ДФ=HHmmss");
		Объект.Дата = Дата(ДатаСтрокой+ВремяСтрокой);
	КонецЕсли;
	
	// необходимо обновить параметры учётной политики и параметры договора
	_СформироватьОбщиеПараметры("ПараметрыДоговора,УчетнаяПолитика");
	
	// и курс валюты
	_СформироватьКурс();
	_ПроверитьРежимВводаОстатков();
	
	// пересчитаем принудительно срок оплаты
	РасчитатьСрокОплатыДокумента();
	
	// регенерация формы 
	_ОбновитьНомераДокументов();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеОрганизации 

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	_ОрганизацияПриИзменении();
	// --- 
	Если СокрЛП(Объект.Номер) <> "" И НЕ Объект.Организация.Пустая() Тогда
		
		// проверяем, нужно ли менять
		Если _НужноУстановитьНовыйНомер() Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУстановкиНовогоНомера",ЭтотОбъект); 
			ПоказатьВопрос(ПОВ,"Установить новый номер?", РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУстановкиНовогоНомера(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ=КодВозвратаДиалога.Да Тогда
		
		_УстановитьНовыйНомер();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _НужноУстановитьНовыйНомер()
	// --- 
	
	Если Объект.Организация.Префикс = "" Тогда
		
		Возврат(Ложь);
		
	КонецЕсли; 

	ДлинаПрефикса = СтрДлина(Объект.Организация.Префикс);
	Если Лев(СокрЛП(Объект.Номер),ДлинаПрефикса) <> Объект.Организация.Префикс Тогда
		
		Возврат(Истина);
		
	КонецЕсли; 
	
	Возврат(Ложь);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ОрганизацияПриИзменении()
	// --- 
	
	_СформироватьОбщиеПараметры("УчетнаяПолитика");
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _УстановитьНовыйНомер()
	// --- 
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(Документ,"Объект");
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеКонтрагента 

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	_УФК.ВыбратьПоставщика(Объект.Контрагент,Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	_КонтрагентПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура _КонтрагентПриИзменении()
	
	// если очистили контрагента, то очищаем и договор
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Договор = Неопределено;
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) И (Объект.Договор.Владелец = Объект.Контрагент) Тогда 
		// нечего менять
	Иначе 
		Объект.Договор = CW_Документы.ПолучитьПоследнийДоговор(Объект.Контрагент, Объект.Организация, Перечисления.ВидыДоговоровКонтрагентов.Прочее);
		_ОбработатьИзменениеДоговора();
	КонецЕсли;
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииКонтрагентаНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

#КонецОбласти 

#Область ИзменениеДоговора 

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	Отбор = Новый Структура("Владелец,Организация,ВидДоговора",Объект.Контрагент,Объект.Организация,ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Прочее"));
	ПараметрыФормы = Новый Структура("Отбор,РежимВыбора",Отбор,Истина);
	// --- 
	ОткрытьФорму("Справочник.CW_ДоговорыПоГрузоперевозкам.ФормаВыбора",ПараметрыФормы,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	_ОбработатьИзменениеДоговора();
	
КонецПроцедуры

&НаСервере
Процедура _ОбработатьИзменениеДоговора()
	
	_СформироватьОбщиеПараметры();

	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		Возврат;		
	КонецЕсли;
	
	//Подсистема.УчетПриложенийДоговоров
	Объект.Валюта = CW_УчетПриложенийДоговоровСервер.ПолучитьВалютуПриложенияДОговора(Объект.ПриложениеКДоговору, Объект.Договор);
	//Подсистема.УчетПриложенийДоговоров
	
	Объект.ЗачетАвансов.Очистить();
	Объект.ПлатёжноРасчётныеДокументы.Очистить();
	_ПараметрыДоговора = _ДС().ПД;
	
	Если НЕ Объект.Договор.Пустая() Тогда
		СтруктураПараметровБухУчета = Новый Структура;
		СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
		СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
		
		ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);
	
		ВзаиморасчетыВУЕ		= ПараметрыБухгалтерскогоУчета.ВзаиморасчетыВУЕ;	
		
		Если ЗначениеЗаполнено(_ПараметрыДоговора.ПорядокЗачетаАвансов) Тогда
			Объект.СпособЗачетаАвансов = _ПараметрыДоговора.ПорядокЗачетаАвансов;
		КонецЕсли;

		Если ЗначениеЗаполнено(_ПараметрыДоговора.ПорядокЗачетаАвансовОЗ) Тогда
			Объект.СпособЗачетаАвансовОЗ = _ПараметрыДоговора.ПорядокЗачетаАвансовОЗ;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(_ПараметрыДоговора.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ) Тогда
			Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = _ПараметрыДоговора.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ;
		Иначе
			Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.НеУчитывать;
		КонецЕсли;
		
		Если (НЕ ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
			Объект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
		КонецЕсли; 
		
		Объект.ЭтоУниверсальныйДокумент = _ПараметрыДоговора.ИспользуетсяУниверсальныйДокумент;
	
		РасчитатьСрокОплатыДокумента();
		_СформироватьКурс();
		
	КонецЕсли; 
	
	АдресУслугПоДоговору = "";
	Если ОграничиватьУслугиПоДоговорам Тогда
		ЕстьОграниченияПоСпискуУслуг =?(ЗначениеЗаполнено(Объект.Договор), Объект.Договор.ОграничиватьНоменклатуру, Ложь);
		
		Если ЕстьОграниченияПоСпискуУслуг тогда
			ДатаДокумента = Объект.Дата;
			Если Объект.ПредъявленСчет 
				И ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
				ДатаДокумента = Объект.ДатаСчета;  
			КонецЕсли;      
			АдресУслугПоДоговору = _УФС.ОбновитьСписокУслугПоДоговору(ДатаДокумента, Объект.Договор, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.УслугиНоменклатура);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияПоСпискуУслуг);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииДоговораНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
	УстановитьЗаголовокНадписиКомментарияДоговора();
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

#КонецОбласти 

//Подсистема.ОригиналыДокументов
&НаКлиенте
Процедура ОригиналыПредоставленыПриИзменении(Элемент)
	
	ОригиналыПредоставленыПриИзмененииНаСервере();
	
КонецПроцедуры

&Насервере
Процедура ОригиналыПредоставленыПриИзмененииНаСервере()
	
	CW_ОригиналыДокументовСервер.ОригиналыПредоставленыПриИзмененииНаСервере(ЭтаФорма) ;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвратаНажатие(Элемент, СтандартнаяОбработка)
	
	CW_ОригиналыДокументовКлиент.ОткрытьФормуВводаДаты(ЭтаФорма,СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(НоваяДата, Параметры) Экспорт
	
	Если НЕ НоваяДата = Неопределено Тогда
		ОбработатьИзменениедатыВозвратаОригиналовДокументов(НоваяДата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениедатыВозвратаОригиналовДокументов(НоваяДата)
	
	CW_ОригиналыДокументовСервер.ОбработатьИзменениедатыВозвратаОригиналовДокументов(ЭтаФорма, НоваяДата);

КонецПроцедуры
//Подсистема.ОригиналыДокументов



#Область ИзменениеКомментария 

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	_УправлениеЭлементамиФормы();
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// УСЛУГИ
// ---------------------------------------------------------------------------- 

#Область УслугиОбщиеСобытия 

&НаКлиенте
Процедура УслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция _Заказ(Грузоперевозка)
	// --- 
	
	Возврат(Грузоперевозка.Заказ);
	
	// --- 
КонецФункции

&НаСервереБезКонтекста
Функция _НоменклатурнаяГруппа(Номенклатура)
	// --- 
	
	Возврат(Номенклатура.НоменклатурнаяГруппа);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура УслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	_УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура УслугиГрузоперевозкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если _ГрузоперевозкаЗакрыта(ВыбранноеЗначение) Тогда
		
		СтандартнаяОбработка = Ложь;
		_УФК.ВывестиПредупреждение("Грузоперевозка блокирована для использования в документах!");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция _ГрузоперевозкаЗакрыта(ГП)
	// --- 
	
	ДатаЗакрытия = CW_Мониторинг.ПолучитьДатуЗакрытия(ГП);
	Если ДатаЗакрытия <> Дата(1,1,1) Тогда
		
		Возврат(Истина);
		
	Иначе
		
		Возврат(Ложь);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура УслугиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование Тогда
		// --- 
		
		Отказ = Истина;
		Модифицированность = истина;
		// --- 
		строкаУслуги = Объект.Услуги.Добавить();
		строкаУслуги.Количество = 1;
		
		ПорядокОтражения = _ДС().ПД.ОсновнойПорядокОтраженияРасходов;
		Если (ПорядокОтражения.Пустая()) Тогда
			ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты");
		КонецЕсли; 
		строкаУслуги.ПорядокОтражения = ПорядокОтражения;
		
		строкаУслуги.Подразделение = ПодразделениеПользователя;
		
		Элементы.Услуги.ТекущаяСтрока = строкаУслуги.ПолучитьИдентификатор();
		Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиГрузоперевозка;
		
		
		// --- 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	ОбновитьИтогиПоУслугам();
	ПометитьГрузоперевозки();
	
КонецПроцедуры

Процедура ОбновитьИтогиПоУслугам()
	//! ИтогоВсего
	
	// итоговая строка по табличной части "Услуги" 
	СВ = Строка(Объект.Валюта);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	Если (НЕ Объект.Корректировка) Тогда
		
		Элементы.СтраницаУслуги.Заголовок = " Услуги (" +Объект.Услуги.Количество() + ")";
		Если Объект.Услуги.Количество() = 0 Тогда
			ИтогоПоУслугам = "Сведения об услугах отсутствуют";
		Иначе
			ИтогоПоУслугам=	"Строк: "+Объект.Услуги.Количество()+
			";  Сумма: "+Формат(Объект.Услуги.Итог("Сумма"),ФЧ)+" "+СВ+ 
			";  НДС: "+Формат(Объект.Услуги.Итог("НДС"),ФЧ)+" "+СВ+
			";  Всего: "+Формат(Объект.Услуги.Итог("Всего"),ФЧ)+" " +СВ;
		КонецЕсли;
		
		Если (КонтрольДокументовПоСумме) Тогда
			Отклонение = 0;
			Если (Объект.СуммаПоПервичномуДокументу <> 0) Тогда
				Если (Объект.Услуги.Итог("Всего") <> Объект.СуммаПоПервичномуДокументу) Тогда
					Отклонение = Объект.СуммаПоПервичномуДокументу - Объект.Услуги.Итог("Всего");
					Если (Отклонение <> 0) Тогда
						ИтогоПоУслугам = ИтогоПоУслугам + "; Отклонение от контрольной суммы: "+Формат(Отклонение,ФЧ)+" " +СВ;	
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; 
			
			// управление цветом итоговой надписи при наличии отклонения от контрольной суммы
			Если Отклонение <> 0 Тогда
				Элементы.ИтогоПоУслугам.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
			Иначе
				Элементы.ИтогоПоУслугам.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
			КонецЕсли; 
		КонецЕсли; // выполняется котроль суммы документа
		
	Иначе
		
		//Элементы.СтраницаУслугиКорректировка.Заголовок = " Услуги (" +Объект.Услуги.Количество() + ")";
		Если Объект.Услуги.Количество() = 0 Тогда
			ИтогоПоУслугам_Корректировка = "Сведения об услугах отсутствуют";
		Иначе
			ИтогоПоУслугам_Корректировка =	"Строк: "+Объект.Услуги.Количество()+
			";  Сумма: "+Формат(Объект.Услуги.Итог("Сумма")-Объект.Услуги.Итог("Сумма_ДоКорректировки"),ФЧ)+" "+СВ+ 
			";  НДС: "+Формат(Объект.Услуги.Итог("НДС")-Объект.Услуги.Итог("НДС_ДоКорректировки"),ФЧ)+" "+СВ+
			";  Всего: "+Формат(Объект.Услуги.Итог("Всего")-Объект.Услуги.Итог("Всего_ДоКорректировки"),ФЧ)+" " +СВ;
		КонецЕсли;
		
	КонецЕсли;
						
КонецПроцедуры

&НаСервере
Процедура _ОбновитьСтатусПометокУдаления()
	
	ЗаполнитьДобавленныеКолонкиТаблиц("Услуги");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц(ИмяТабличнойЧасти)
	
	
	МассивГрузоперевозок 	= Объект[ИмяТабличнойЧасти].Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	СвойстваГрузоперевозок 	= CW_Грузоперевозки_Сервер.ПолучитьСведенияПоГрузоперевозкам(МассивГрузоперевозок);
	
	Для каждого СтрокаДокумента Из Объект[ИмяТабличнойЧасти] Цикл
		
		СтруктураСвойств = СвойстваГрузоперевозок.Получить(СтрокаДокумента.Грузоперевозка);
		
		Если СтруктураСвойств <> Неопределено Тогда
			СтруктураСвойств.Свойство("ПометкаУдаления",СтрокаДокумента.ГрузоперевозкаУдалена);
		Конецесли;
		
		
	КонецЦикла;
	
	ПараметрыОбъекта = Неопределено;
	ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(ЭтаФорма, ПараметрыОбъекта);
	
	Если ПустаяСтрока(ИмяТабличнойЧасти) ИЛИ ИмяТабличнойЧасти = "Услуги" Тогда
		
		Для Каждого СтрокаТаблицы Из Объект.Услуги Цикл
			ЗаполнитьДобавленныеКолонкиСтрокиТаблицыУслуги(СтрокаТаблицы, ПараметрыОбъекта);
		КонецЦикла;
		
		CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьНачальныеСвойстваСубконтоТаблицы(
		Объект.Услуги, ПараметрыУстановкиСвойствСубконто(ЭтотОбъект));
		
	КонецЕсли;
	
	
КонецПроцедуры



#КонецОбласти 

#Область УслугиРеквизиты

&НаКлиенте
Процедура УслугиГрузоперевозкаПриИзменении(Элемент)
	
	_УслугиГрузоперевозкаПриИзменении(Элементы.Услуги.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _УслугиГрузоперевозкаПриИзменении(Строка)
	// --- 
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	
	ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
	
	ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
	ПараметрыШаблона.Объект 		= Объект;
	ПараметрыШаблона.Дата 			= Объект.Дата;
	ПараметрыШаблона.Договор 		= Объект.Договор;
	ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
	ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
	
	CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
	
	// --- 
	Если СтрокаТЧ.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда
		
		СтруктураПараметровКлиента = Новый Структура;
		СтруктураПараметровКлиента.Вставить("Объект"			, СтрокаТЧ.Грузоперевозка);
		СтруктураПараметровКлиента.Вставить("ЭтоВариантБюджета"	, Ложь);
		СтруктураПараметровКлиента.Вставить("Контрагент"		, СтрокаТЧ.Грузоперевозка.Клиент);
		
		КлиентПлат = CW_Финансы.ВернутьПлательщика(СтруктураПараметровКлиента);
		Если ЗначениеЗаполнено(СтрокаТЧ.Грузоперевозка.Клиент) И КлиентПлат <> СтрокаТЧ.Покупатель Тогда
			
			СтрокаТЧ.Покупатель =  КлиентПлат;//СтрокаТЧ.Грузоперевозка.Клиент;
			Если (НЕ СтрокаТЧ.Покупатель.Пустая()) Тогда
				
				ДоговорГП = ДоговорГрузоперевозки(СтрокаТЧ.Грузоперевозка, СтрокаТЧ.Покупатель);
				Если (ДоговорГП = Неопределено) Тогда
					СтрокаТЧ.ДоговорПокупателя = ПоследнийДоговорКонтрагента(СтрокаТЧ.Покупатель, Объект.Организация, ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
				Иначе
					СтрокаТЧ.ДоговорПокупателя = ДоговорГП;
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	Иначе
		
		_ПодставитьПодразделение(СтрокаТЧ);
		
	КонецЕсли; 
	
	_ОбновитьСтатусПометокУдаления();
	
	#Область Динамический_вывод_дополнительных_колонок
	
	_УФС.ОбновитьЗначенияПараметровГрузоперевозкиПоСтроке(СтрокаТЧ, ПолучитьСтруктуруПараметровДляПередачи());	
	
	#КонецОбласти
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ПодставитьПодразделение(СтрокаТЧ)
	// --- 
	
	Если (НЕ _ДС().УП.ГруппировкаЗатратПоПодразделениям) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если (НЕ СтрокаТЧ.Подразделение.Пустая()) Тогда
			
		Возврат;
			
	КонецЕсли; 
	
	Если (НЕ СтрокаТЧ.Грузоперевозка.Пустая()) Тогда
		
		ПараметрПодразделения = Константы.CW_ПараметрПодразделенияЗатрат.Получить();
		Если (НЕ ПараметрПодразделения.Пустая()) Тогда
			
			Отбор = Новый Структура("Параметр",ПараметрПодразделения);
			СтрокаПараметра = _сф.к_НайтиСтроку(СтрокаТЧ.Грузоперевозка.ПараметрыГрузоперевозки,Отбор);
			Если (СтрокаПараметра <> Неопределено) Тогда
				
				Если (ЗначениеЗаполнено(СтрокаПараметра.Значение)) Тогда
					
					СтрокаТЧ.Подразделение = СтрокаПараметра.Значение;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	_УслугиНоменклатураПриИзменении(Элементы.Услуги.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _УслугиНоменклатураПриИзменении(Строка)
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	
	//Заполняем счета МСФО
	Если НастройкиМСФО.Количество() > 0 Тогда
		ЭлементСписка 		= НастройкиМСФО.Получить(0);
		СтруктураНастроек 	= ЭлементСписка.Значение;
		
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			Если Не ЗначениеЗаполнено(СтрокаТЧ.СчетЗатрат) и СтруктураНастроек.Свойство("СчетУчетаЗатрат") Тогда
				
				СтрокаТЧ.СчетЗатрат = СтруктураНастроек.СчетУчетаЗатрат;
				
				CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоСтрокиПриИзмененииСчета(
				ЭтотОбъект, СтрокаТЧ, ПараметрыУстановкиСвойствСубконто(ЭтотОбъект));
				
				ПараметрыОбъекта = Неопределено;
				ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(ЭтаФорма, ПараметрыОбъекта);
				
				ЗаполнитьДобавленныеКолонкиСтрокиТаблицыУслуги(СтрокаТЧ, ПараметрыОбъекта);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда 
		
		Если _ДС().НП.ПодставлятьСтавкуНДС Тогда
			
			// пересчет суммовых показателей осуществляем, только при изменении ставки НДС
			СтавкаНДСНоменклаутры =  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(СтрокаТЧ.Номенклатура, Объект.Дата);
			Если СтрокаТЧ.СтавкаНДС <> СтавкаНДСНоменклаутры Тогда
				СтрокаТЧ.СтавкаНДС = СтавкаНДСНоменклаутры;
				
				ТД = СтрокаТЧ;
				ТД.Сумма = ТД.Цена * ТД.Количество;
				ТД.НДС = ТД.Сумма * CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
				ТД.Всего = ТД.Сумма + ТД.НДС;
				
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
	// пробуем переформировать представление номенклатуры
	ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
	
	ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
	ПараметрыШаблона.Объект 		= Объект;
	ПараметрыШаблона.Дата 			= Объект.Дата;
	ПараметрыШаблона.Договор 		= Объект.Договор;
	ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
	ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
	
	CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
	
	// установка цены номенклатуры
	ТД = СтрокаТЧ;
	Если ТД.Цена = 0  Тогда
		
		ТипЦен = _ДС().ПД.ТипЦен;
		Если НЕ ТипЦен.Пустая() Тогда
			
			СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,_ДатаВозникновенияЗадолженности());
			Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура, ТипЦен, _ДатаВозникновенияЗадолженности(), Объект.Валюта, СК.Курс,СК.Кратность);
			Если Цена <> 0 Тогда
				
				Если ТипЦен.ЦенаВключаетНДС Тогда
					Если ЗначениеЗаполнено(ТД.СтавкаНДС) И ЗначениеЗаполнено(ТД.Количество) Тогда
						ТД.Всего = Цена*ТД.Количество;
						Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
						ТД.НДС = ТД.Всего*Ставка/(1+Ставка);
						ТД.Сумма = ТД.Всего - ТД.НДС;
						ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
					Иначе
						Если ЗначениеЗаполнено(ТД.СтавкаНДС) Тогда
							Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
							ТД.Цена = Цена/(1+Ставка);
						КонецЕсли; 
					КонецЕсли; 
				Иначе
					Если ЗначениеЗаполнено(ТД.СтавкаНДС) И ЗначениеЗаполнено(ТД.Количество) Тогда
						ТД.Цена = Цена;
						ТД.Сумма = ТД.Цена * ТД.Количество;
						ТД.НДС = ТД.Сумма * CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
						ТД.Всего = ТД.Сумма + ТД.НДС;
					Иначе
						
						ТД.Цена = Цена;
					КонецЕсли; 
				КонецЕсли;
				
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	ПересчитатьСтрокуНаСерере(СтрокаТЧ.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЕстьОграниченияПоСпискуУслуг Тогда
		
		ВыбранноеЗначение = Элементы.Услуги.ТекущиеДанные.Номенклатура;	
		_УФК.ВыбратьНоменклатуру(ВыбранноеЗначение,Элемент,ДанныеВыбора,СтандартнаяОбработка);
		
	ИначеЕсли Элемент.СписокВыбора.Количество() = 0 Тогда
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст   		= "Не определен список услуг по договору!";
		Сообщение.ПутьКДанным  	= "Объект";
		Сообщение.Поле    		= "Договор";
		Сообщение.Сообщить();
		
	Конецесли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	_УслугиПредставлениеНачалоВыбора(Элементы.Услуги.ТекущаяСтрока);
	Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиПорядокОтражения;
	Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиПредставление;
	
КонецПроцедуры

&НаСервере
Процедура _УслугиПредставлениеНачалоВыбора(Строка)
	// --- 
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	
	ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
	
	ПараметрыШаблона.Номенклатура 	= СтрокаТЧ.Номенклатура;
	ПараметрыШаблона.Объект 		= Объект;
	ПараметрыШаблона.Дата 			= Объект.Дата;
	ПараметрыШаблона.Договор 		= Объект.Договор;
	ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
	ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
	
	CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаТЧ, ПараметрыШаблона); 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ПереформироватьПредставлениеУслуг(Знач Строки)
	// --- 
	
	Для каждого Идентификатор Из Строки Цикл
		
		_УслугиПредставлениеНачалоВыбора(Идентификатор);
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
 

&НаКлиенте
Процедура Услуги_ПереформироватьПредставление(Команда)
	
	_ПереформироватьПредставлениеУслуг(Элементы.Услуги.ВыделенныеСтроки);
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура УслугиСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// ---------------------------------------------------------------------------- 
	
	Вариант = Неопределено;
	
	Список = Новый СписокЗначений;
	Список.Добавить("список","Выбор из списка");
	
	// если ведется оперативный учет задолженности
	
	Если (ОперативныйУчет И НЕ ВводОстатковОЗ) Тогда
		
		Список.Добавить("подбор","Подбор неактированных");
		
	КонецЕсли; 
	
	ПОВ = Новый ОписаниеОповещения("ВыполнитьПодборСчета",ЭтотОбъект, Новый Структура("Элемент", Элемент)); 
	Если (Список.Количество()=1) Тогда
		
		Вариант = Список[0];
		ВыполнитьОбработкуОповещения(ПОВ, Вариант);
		
	Иначе
		
		ПоказатьВыборИзМеню(ПОВ,Список,Элемент);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПодборСчета(Вариант, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Вариант <> Неопределено) Тогда
		
		Вариант = Вариант.Значение;
		
	КонецЕсли; 
	
	Если (Вариант = "подбор") Тогда
		
		ТД=Элементы.Услуги.ТекущиеДанные;
		ПФ = Новый Структура("Дата,Документ,Отбор",Объект.Дата,Объект.Ссылка,Новый Структура("Организация,Контрагент,Договор,Валюта,Грузоперевозка,ПорядокОтражения,Номенклатура,СтавкаНДС",Объект.Организация,Объект.Контрагент,Объект.Договор,Объект.Валюта,ТД.Грузоперевозка,ТД.ПорядокОтражения,ТД.Номенклатура,ТД.СтавкаНДС));
		ОткрытьФорму("ОбщаяФорма.CW_ПодборНеактированныхСчетов",ПФ,ДополнительныеПараметры.Элемент);
		
	ИначеЕсли (Вариант = "список") Тогда 
		
		ПФ = Новый Структура("Отбор,РежимВыбора",Новый Структура("Контрагент,Договор,ПредъявленСчет,ПредъявленАкт,ПредъявленСФ",Объект.Контрагент,Объект.Договор,Истина,Ложь,Ложь),Истина);
		ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаВыбора",ПФ,ДополнительныеПараметры.Элемент);
				
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПФ_ВыборНеактированногоСчетаДляСтроки()
	// --- 
	
	//ПФ = Новый Структура("Дата,Документ,Отбор",Объект.Дата,Объект.Ссылка,Новый Структура("Организация,Контрагент,Договор,Валюта,Грузоперевозка,ПорядокОтражения,Номенклатура,СтавкаНДС",Объект.Организация,Объект.Контрагент,Объект.Договор,Объект.Валюта,ТД.Грузоперевозка,ТД.ПорядокОтражения,ТД.Номенклатура,ТД.СтавкаНДС));
	//Возврат(ПФ);
	
	// --- 
КонецФункции

// --- 

&НаКлиенте
Процедура УслугиПокупательПриИзменении(Элемент)
	
	_УслугиПокупательПриИзменении(Элементы.Услуги.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _УслугиПокупательПриИзменении(Строка)
	// --- 
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	Если НЕ СтрокаТЧ.Покупатель.Пустая() Тогда
		
		ДоговорГП = ДоговорГрузоперевозки(СтрокаТЧ.Грузоперевозка, СтрокаТЧ.Покупатель);
		Если (ДоговорГП = Неопределено) Тогда
			СтрокаТЧ.ДоговорПокупателя = ПоследнийДоговорКонтрагента(СтрокаТЧ.Покупатель, Объект.Организация, ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
		Иначе
			СтрокаТЧ.ДоговорПокупателя = ДоговорГП;
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура УслугиДоговорПокупателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	Отбор = Новый Структура("Владелец,Организация,ВидДоговора");
	Отбор.Владелец = Элементы.Услуги.ТекущиеДанные.Покупатель;
	Отбор.Организация = Объект.Организация;
	Отбор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");
	ПараметрыФормы = Новый Структура("Отбор,РежимВыбора",Отбор,Истина);
	// --- 
	ОткрытьФорму("Справочник.CW_ДоговорыПоГрузоперевозкам.ФормаВыбора",ПараметрыФормы,Элемент);
	
КонецПроцедуры


// --- 


&НаСервере
Процедура _ПриИзмененииУслугиПорядокОтражения(Строка)
	// --- 
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Строка);
	Если (СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
		_ПодставитьПодразделение(СтрокаТЧ);	
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Дата"					, Объект.Дата);
			СтруктураПараметров.Вставить("Организация"			, Объект.Организация);
			СтруктураПараметров.Вставить("Номенклатура"			, СтрокаТЧ.Номенклатура);
			СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа);
			
			СтрокаТЧ.СпособУчетаНДС = CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров);
			
		КонецЕсли;	
	Иначе
		СтрокаТЧ.Подразделение = Неопределено;
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

&НаСервереБезКонтекста
Функция ПокупательПоГрузоперевозке(Грузоперевозка)
	
	СтруктураПараметровКлиента = Новый Структура;
	СтруктураПараметровКлиента.Вставить("Объект"				, Грузоперевозка);
	СтруктураПараметровКлиента.Вставить("ЭтоВариантБюджета"		, Ложь);
	СтруктураПараметровКлиента.Вставить("Контрагент"			, Грузоперевозка.Клиент);
	
	Возврат CW_Финансы.ВернутьПлательщика(СтруктураПараметровКлиента);
	
КонецФункции
  
&НаСервереБезКонтекста
Функция ПоследнийДоговорКонтрагента(Контрагент,Организация,ВидДоговора)
	// --- 
	
	Возврат(CW_Документы.ПолучитьПоследнийДоговор(Контрагент,Организация,ВидДоговора));
	
	// --- 
КонецФункции

// --- 

&НаСервереБезКонтекста
Функция ДоговорГрузоперевозки(Грузоперевозка,Плательщик)
	// --- 
	
	Если (НЕ ЗначениеЗаполнено(Грузоперевозка)) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	ПараметрДоговора = Константы.CW_ПараметрДоговораПлательщика.Получить();
	Если (ПараметрДоговора.Пустая()) Тогда
		Возврат(Неопределено);
	КонецЕсли; 
	
	Отбор = Новый Структура("Параметр",ПараметрДоговора);
	СтрокаПараметра = _сф.к_НайтиСтроку(Грузоперевозка.ПараметрыГрузоперевозки,Отбор);
	Если (СтрокаПараметра = Неопределено) Тогда
		Возврат(Справочники.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка());
	Иначе
		Если (СтрокаПараметра.Значение.Владелец = Плательщик) Тогда
			Возврат(СтрокаПараметра.Значение);
		Иначе
			Возврат(Справочники.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка());
		КонецЕсли; 
	КонецЕсли; 
	
	// --- 
КонецФункции

#КонецОбласти 

#Область УслугиСуммы 

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	//Если Элементы.Услуги.ТекущиеДанные.Количество = 0 Тогда
	//	Элементы.Услуги.ТекущиеДанные.Количество = 1;
	//КонецЕсли; 
	
	ПересчитатьСтрокуНаСерере(Элементы.Услуги.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.Услуги.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.Услуги.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаВсегоПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
	ТД.НДС = ТД.Всего*Ставка/(1+Ставка);
	ТД.Сумма = ТД.Всего - ТД.НДС;
	ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаНДСПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	
	Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
		ТД.Всего = ТД.Сумма + ТД.НДС;
	Иначе
		ТД.Сумма = ТД.Всего - ТД.НДС;
		ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	КонецЕсли;
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	
	_УслугиСуммаПриИзменении(Элементы.Услуги.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _УслугиСуммаПриИзменении(Строка)
	// --- 
	
	ТД = Объект.Услуги.НайтиПоИдентификатору(Строка);
	ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС);
	ТД.НДС = CW_Финансы.РассчитатьСуммуНДС(ТД.Сумма, Истина, Ложь, Ставка);
	ТД.Всего = ТД.Сумма + ТД.НДС;
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
	// --- 
КонецПроцедуры


// --- 

&НаКлиенте
Процедура УслугиОУ_ВсегоПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
	ТД.ОЗ_НДС = ТД.ОЗ_Всего*Ставка/(1+Ставка);
	ТД.ОЗ_Сумма = ТД.ОЗ_Всего - ТД.ОЗ_НДС;

КонецПроцедуры

&НаКлиенте
Процедура УслугиОУ_НДСПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	
	Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
		ТД.ОЗ_Всего = ТД.ОЗ_Сумма + ТД.ОЗ_НДС;
	Иначе
		ТД.ОЗ_Сумма = ТД.ОЗ_Всего - ТД.ОЗ_НДС;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УслугиОУ_СуммаПриИзменении(Элемент)
	
	ТД = Элементы.Услуги.ТекущиеДанные;
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
	
	ТД.ОЗ_НДС = ТД.ОЗ_Сумма*Ставка;
	ТД.ОЗ_Всего = ТД.ОЗ_Сумма + ТД.ОЗ_НДС;
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура Услуги_ГрупповоеРедактирование(Команда)
	
	// если нет выделенных строк
	Если Элементы.Услуги.ВыделенныеСтроки.Количество() = 0 Тогда
		Предупреждение("Для групповой обработки необходимо выделить строки!",10,"Предупреждение");
		Возврат;
	КонецЕсли; 
	
	// параметры для открываемой формы
	ПФ = Новый Структура();
	ПФ.Вставить("Организация", Объект.Организация);
	ПФ.Вставить("ДатаДокумента", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	ПФ.Вставить("Строк", Элементы.Услуги.ВыделенныеСтроки.Количество());
	ПФ.Вставить("Док", "Расходы");
	
	// передадим имя реквизита (колонки) на котором установлен курсор и его значение
	#Область ОбластьТекущаяКолонка
	
		// вырезаем из имени реквизита название таблицы (первые 6 символов это слово "Услуги")
		ИмяРеквизитаТабличнойЧасти = Сред(Элементы.Услуги.ТекущийЭлемент.Имя,7);
		
		// если реквизит "Покупатель" или "ДоговорПокупателя",
		// то в процедуру передаем как "Покупатель"
		Если ИмяРеквизитаТабличнойЧасти = "Покупатель" или ИмяРеквизитаТабличнойЧасти = "ДоговорПокупателя" Тогда
			ПФ.Вставить("ТекущийРеквизит","Покупатель");
			ПФ.Вставить("ТекущееЗначение",Элементы.Услуги.ТекущиеДанные["Покупатель"]);
			ПФ.Вставить("ТекущееЗначениеДополнительное",Элементы.Услуги.ТекущиеДанные["ДоговорПокупателя"]);
		Иначе
			ПФ.Вставить("ТекущийРеквизит",ИмяРеквизитаТабличнойЧасти);
			ПФ.Вставить("ТекущееЗначение",Элементы.Услуги.ТекущиеДанные[ИмяРеквизитаТабличнойЧасти]);
			ПФ.Вставить("ТекущееЗначениеДополнительное",Неопределено);
		КонецЕсли; 
	#КонецОбласти 
	
	ПФ.Вставить("ЦенаСНДС"						, Объект.ЦенаСНДС);

	// открываем диалог для выбора действия	
	ПОВ = Новый ОписаниеОповещения("ОбработатьГрупповоеРедактирование", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаГрупповогоРедактированияТЧ", ПФ, Этаформа,,,, ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьГрупповоеРедактирование(Ответ, ДопПар) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Ответ.Реквизит) Тогда
		Возврат;		
	Иначе	
		Реквизит = Ответ.Реквизит;
	КонецЕсли;
	
	мВС = Элементы.Услуги.ВыделенныеСтроки;
	КолСтр = мВС.Количество();
	Распределять = Ложь;
	Разница = 0;
	Если Ответ.Свойство("Распределить") Тогда
		Если Ответ.Распределить Тогда
			Распределять = Истина;
			Сумма = Окр(_сф.БезопасноРазделить(Ответ.Значение,КолСтр), 2,1);
			Разница = Ответ.Значение - Сумма * КолСтр;
		Иначе
			Сумма = Ответ.Значение;
		КонецЕсли;
	КонецЕсли;	
	
	Для Каждого ВСтр из мВС Цикл 
		Стр = Объект.Услуги.НайтиПоИдентификатору(ВСтр);
		
		Если Реквизит = "Номенклатура" Тогда
			Стр.Номенклатура = Ответ.Значение;
			_УслугиНоменклатураПриИзменении(ВСтр);
			
		ИначеЕсли Реквизит = "СтатьяЗатрат" Тогда
			
			Стр.СтатьяЗатрат = Ответ.Значение;
			
		ИначеЕсли Реквизит = "Клиент / Договор" Тогда
			Если Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление") Тогда
				Стр.Покупатель = Ответ.Значение;
				Стр.ДоговорПокупателя = Ответ.Договор;
			Иначе
				Стр.Покупатель = Неопределено;
				Стр.ДоговорПокупателя = Неопределено;
			КонецЕсли; 
		ИначеЕсли Реквизит = "Количество" Тогда
			Стр.Количество = Ответ.Значение;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС);
		ИначеЕсли Реквизит = "Цена" Тогда
			Стр.Цена = Сумма;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС);
		ИначеЕсли Реквизит = "Сумма" Тогда
			Стр.Сумма = Сумма;
			Стр.Цена = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
			Стр.НДС = CW_Финансы.РассчитатьСуммуНДС(Стр.Сумма, Истина, Ложь, Ставка);
			Стр.Всего = Стр.Сумма + Стр.НДС;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Ставка НДС" Тогда
			Стр.СтавкаНДС = Ответ.Значение;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС);
		ИначеЕсли Реквизит = "Сумма НДС" Тогда
			Стр.НДС = Сумма;
			Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
				Стр.Всего = Стр.Сумма + Стр.НДС;
			Иначе
				Стр.Сумма = Стр.Всего - Стр.НДС;
				Стр.Цена  = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			КонецЕсли;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Всего" Тогда
			Стр.Всего = Сумма;
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100;
			Стр.НДС   = Стр.Всего * Ставка / (1 + Ставка);
			Стр.Сумма = Стр.Всего - Стр.НДС;
			Стр.Цена  = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Представление" Тогда
			ДополнитьПредставление 	= Ложь;
			Если Ответ.Свойство("Дополнять") Тогда
				ДополнитьПредставление = Ответ.Дополнять;
			КонецЕсли;
			
			Если ДополнитьПредставление Тогда
				Стр.Представление = Стр.Представление + СокрП(Ответ.Значение);
			Иначе
				Стр.Представление = СокрЛП(Ответ.Значение);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
	Если Распределять И Разница <> 0 Тогда
		Если Реквизит = "Цена" Тогда
			Стр.Цена = Сумма + Разница;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС);
		ИначеЕсли Реквизит = "Сумма" Тогда
			Стр.Сумма = Сумма + Разница;
			Стр.Цена = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
			Стр.НДС = CW_Финансы.РассчитатьСуммуНДС(Стр.Сумма, Истина, Ложь, Ставка);
			Стр.Всего = Стр.Сумма + Стр.НДС;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Сумма НДС" Тогда
			Стр.НДС = Сумма + Разница;
			Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
				Стр.Всего = Стр.Сумма + Стр.НДС;
			Иначе
				Стр.Сумма = Стр.Всего - Стр.НДС;
				Стр.Цена  = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			КонецЕсли;
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		ИначеЕсли Реквизит = "Всего" Тогда
			Стр.Всего = Сумма + Разница;
			Ставка = CW_Финансы.ПолучитьСтавкуНДС(Стр.СтавкаНДС)/100;
			Стр.НДС   = Стр.Всего * Ставка / (1 + Ставка);
			Стр.Сумма = Стр.Всего - Стр.НДС;
			Стр.Цена  = _сф.БезопасноРазделить(Стр.Сумма, Стр.Количество);
			ПересчитатьСтрокуНаСерере(ВСтр,Объект.ЦенаСНДС, Истина);
		КонецЕсли;	
	КонецЕсли;	
	
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры	
	
#КонецОбласти 

// ---------------------------------------------------------------------------- 
// ЗАЧЕТ АВАНСОВ
// ---------------------------------------------------------------------------- 

#Область ЗачетАвансов

&НаКлиенте
Процедура ЗачетАвансовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовПриИзменении(Элемент)
	ОбновитьИтогиПоАвансам();
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовОЗПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	ЗаполнитьАвансы(Команды.Найти("ЗаполнитьАвансы"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	// --- 
	ЗаполнитьАвансы(Команды.Найти("ЗаполнитьАвансы"));
	
КонецПроцедуры

&НаКлиенте
Процедура Авансы_Очистить(Команда)
	
	Если (Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов) Тогда
		Объект.ЗачетАвансов.Очистить();
	ИначеЕсли (Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ) Тогда 
		Объект.ЗачетАвансовОЗ.Очистить();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Авансы_Открыть(Команда)
	
	Если (Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов) Тогда
		Если Элементы.ЗачетАвансов.ТекущиеДанные <> Неопределено Тогда
			
			Попытка
				
				ПоказатьЗначение(,Элементы.ЗачетАвансов.ТекущиеДанные.ДокументАванса);
				
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			
		КонецЕсли; 
	ИначеЕсли (Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ) Тогда 
		Если Элементы.ЗачетАвансовОЗ.ТекущиеДанные <> Неопределено Тогда
			
			Попытка
				
				ПоказатьЗначение(,Элементы.ЗачетАвансовОЗ.ТекущиеДанные.ДокументАванса);
				
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбновитьИтогиПоАвансам()
	// --- 
	
	СВ = Строка(Объект.Валюта);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	Если Объект.ЗачетАвансов.Количество() = 0 Тогда
		ИтогоПоАвансам = "Нет зачтённых авансов";
	Иначе
		ИтогоПоАвансам=	"Зачтено:  "+Формат(Объект.ЗачетАвансов.Итог("СуммаЗачета"),ФЧ)+" "+СВ;
	КонецЕсли;
	Если Объект.ЗачетАвансов.Итог("СуммаЗачета") > Объект.Услуги.Итог("Всего") Тогда
		
		Элементы.ИтогоПоАвансам.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		
	Иначе
		
		Элементы.ИтогоПоАвансам.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		
	КонецЕсли; 
	// --- 
	Если Объект.ЗачетАвансовОЗ.Количество() = 0 Тогда
		ИтогоПоАвансамОЗ = "Нет зачтённых авансов";
	Иначе
		ИтогоПоАвансамОЗ =	"Зачтено:  "+Формат(Объект.ЗачетАвансовОЗ.Итог("СуммаЗачета"),ФЧ)+" "+СВ;
	КонецЕсли;
	Если Объект.ЗачетАвансовОЗ.Итог("СуммаЗачета") > Объект.Услуги.Итог("Всего") Тогда
		
		Элементы.ИтогоПоАвансамОЗ.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
		
	Иначе
		
		Элементы.ИтогоПоАвансамОЗ.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ЗаполнениеАвансов

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	
	Если (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов) Тогда
		
		ПроверяемыйДокумент = Объект.ВедомыйДокумент;
		ТЧ = Объект.ЗачетАвансов;
		
	ИначеЕсли (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ) Тогда 
		
		ПроверяемыйДокумент = Объект.Ссылка; 
		ТЧ = Объект.ЗачетАвансовОЗ;
		
	КонецЕсли; 
	
	Если ПроверяемыйДокумент.Пустая() Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаОтветаЗаписиПриЗаполненииАвансов",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Документ не записан! Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьЗачетАвансов();
		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаЗаписиПриЗаполненииАвансов(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ВыполнитьЗачетАвансов();
	Иначе
		Возврат;
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗачетАвансов()
	// --- 
	
	Если (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов) Тогда
		
		ПроверяемыйДокумент = Объект.ВедомыйДокумент;
		ТЧ = Объект.ЗачетАвансов;
		
	ИначеЕсли (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ) Тогда 
		
		ПроверяемыйДокумент = Объект.Ссылка; 
		ТЧ = Объект.ЗачетАвансовОЗ;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	БУ = (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансов);
	ОЗ = (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗачетАвансовОЗ);
	
	ПФ = _ПараметрыФормыПодбораАвансов(БУ, ОЗ);
	Если ПФ.Количество = 0 Тогда
		
		_УФК.ВывестиПредупреждение("Доступных авансов не найдено.");
		ТЧ.Очистить();
		Возврат;
		
	КонецЕсли; 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаЗаполненияАвансов",ЭтотОбъект, Новый Структура("БУ,ОЗ",БУ,ОЗ)); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаЗачетаАвансов",ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаполненияАвансов(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		_ЗагрузитьРезультатПодбораАванса(Ответ,ДополнительныеПараметры.БУ,ДополнительныеПараметры.ОЗ);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПараметрыФормыПодбораАвансов(БУ,ОЗ)
	// --- 
	
	ПФ = Новый Структура("Документ,ЗачетБУ,ЗачетОЗ,Валюта,СуммаСобственных,СуммаПеревыставляемых,ТаблицаАвансов,СчетАвансовПоСобственным,СчетАвансовПоПеревыставляемым,Количество,ОЗ,РаздельныйУчетЗаполженности");
	// ---------------------------------------------------------------------------- 
	ПФ.Документ = Документы.CW_РасходыПоПриобретениям.ПустаяСсылка();
	ПФ.ЗачетБУ = БУ;
	ПФ.ЗачетОЗ = ОЗ;
	ПФ.Валюта = Объект.Валюта;
	ПФ.РаздельныйУчетЗаполженности = РаздельныйУчетЗаполженности;
	// ---------------------------------------------------------------------------- 
	
	//Для версии КОРП
	Если ВестиУчетПоПодразделениям Тогда
		ПФ.Вставить("ВестиУчетПоПодразделениям"	, ВестиУчетПоПодразделениям);	
		ПФ.Вставить("ПодразделениеОрганизации"	, Объект.ПодразделениеОрганизации);	
	КонецЕсли;
	//Для версии КОРП
	
	ПараметрыТА 		= Новый Структура("Дата,Договор,ПриложениеКДоговору,ОЗ,РаздельныйУчетЗаполженности,Акт,ПереплатаКакАванс");
	ПараметрыТА.Договор = Объект.Договор;
	ПараметрыТА.ОЗ 		= ОперативныйУчет;
	ПараметрыТА.Акт 	= Объект.Ссылка;
	ПараметрыТА.РаздельныйУчетЗаполженности = РаздельныйУчетЗаполженности;
	ПараметрыТА.ПереплатаКакАванс 			= ПереплатаКакАванс;
	
	//Для версии КОРП
	Если ВестиУчетПоПодразделениям Тогда
		ПараметрыТА.Вставить("ВестиУчетПоПодразделениям"	, ВестиУчетПоПодразделениям);	
		ПараметрыТА.Вставить("ПодразделениеОрганизации"		, Объект.ПодразделениеОрганизации);	
	КонецЕсли;
	//Для версии КОРП

	
	Услуги = Объект.Услуги.Выгрузить();
	Если (ОперативныйУчет) Тогда
		Если (НЕ Объект.СписокСчетов) Тогда
			Если (ЗначениеЗаполнено(Объект.Счет)) Тогда
				Услуги.ЗаполнитьЗначения(Объект.Счет,"Счет");
			Иначе
				Услуги.ЗаполнитьЗначения(Объект.Ссылка,"Счет");
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	// --- 
	
	Если (БУ) Тогда
		
		ПараметрыТА.Дата = Новый Граница(Объект.ВедомыйДокумент.Дата,ВидГраницы.Исключая);
		ТаблицаАвансов = CW_Финансы.ТаблицаАвансов(ПараметрыТА,Услуги,Объект.ЗачетАвансов.Выгрузить(), Объект.ЗачетАвансовОЗ.Выгрузить());
		
	ИначеЕсли (ОЗ) Тогда 
		
		ПараметрыТА.Дата = Новый Граница(Объект.ДатаСчета,ВидГраницы.Исключая);
		ТаблицаАвансов = CW_Финансы.ТаблицаАвансовДляОЗ(ПараметрыТА,Услуги,Объект.ЗачетАвансовОЗ.Выгрузить());
		
	КонецЕсли; 
	
	// --- 
	Услуги.Свернуть("ПорядокОтражения", "Всего");
	ПФ.СуммаСобственных = _сф.Итог(Услуги,"Всего");
	ПФ.СуммаПеревыставляемых = 0;
	
	// счета расчета по возмещаемым
	// --- 
	Счет_Рубли = _ДС().УП.СчетРасчетов_Поставщики_Рубли;
	Счет_Валюта = _ДС().УП.СчетРасчетов_Поставщики_Валюта;
	Счет_УЕ = _ДС().УП.СчетРасчетов_Поставщики_УЕ;
	// --- 
	ВРУ = _ДС().КО.ВалютаРегламентированногоУчета;
	// --- 
	Счета = CW_Конфигурация.ПланСчетов();
	
	// определяем счета
	Если Объект.Валюта=ВРУ Тогда
		// --- 
		ПФ.СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданным;
		Если Счет_Рубли=Счета.РасчетыСПоставщиками Тогда
			ПФ.СчетАвансовПоПеревыставляемым = Счета.РасчетыПоАвансамВыданным;
		Иначе
			ПФ.СчетАвансовПоПеревыставляемым = Счет_Рубли;
		КонецЕсли;
		// --- 
	Иначе
		Если Объект.Договор.ВзаиморасчетыВУЕ Тогда
			// --- 
			ПФ.СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданнымУЕ;
			Если Счет_УЕ = Счета.РасчетыСПоставщикамиУЕ Тогда
				ПФ.СчетАвансовПоПеревыставляемым = Счета.РасчетыПоАвансамВыданнымУЕ;
			Иначе
				ПФ.СчетАвансовПоПеревыставляемым = Счет_УЕ;
			КонецЕсли; 
			// --- 
		Иначе 
			// --- 
			ПФ.СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданнымВал;
			Если Счет_Валюта = Счета.РасчетыСПоставщикамиВал Тогда
				ПФ.СчетАвансовПоПеревыставляемым = Счета.РасчетыПоАвансамВыданнымВал;
			Иначе
				ПФ.СчетАвансовПоПеревыставляемым = Счет_Валюта;
			КонецЕсли; 
			// --- 
		КонецЕсли;	
	КонецЕсли; 
	
	
	ПФ.ТаблицаАвансов = ПоместитьВоВременноеХранилище(ТаблицаАвансов,ЭтаФорма.УникальныйИдентификатор);
	ПФ.Количество = ТаблицаАвансов.Количество();
	// --- 
	ПФ.ОЗ = _ДС().УП.ОЗ;
	
	Возврат(ПФ);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ЗагрузитьРезультатПодбораАванса(Адрес,БУ,ОЗ)
	// --- 
	
	Попытка
		
		Если (БУ) Тогда
			Объект.ЗачетАвансов.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
		ИначеЕсли (ОЗ) Тогда 
			Объект.ЗачетАвансовОЗ.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
		КонецЕсли; 
		
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 


#Область ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ

&НаКлиенте
Процедура ЗаполнитьПлатёжноРасчётныеДокументы(Команда)
	
	Если НЕ Объект.Проведен Тогда 
		ПоказатьПредупреждение(Неопределено, "Чтобы автоматически заполнить список платёжно-расчётных документов"
		                                     "по счёта-фактуре документ должен быть проведён!");
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = ПредопределенноеЗначение("Перечисление.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.ПоДокументу") Тогда 
		ПоказатьПредупреждение(Неопределено, "Ручное заполнение платёжно-расчётных длкументов для счёта-фактуры доступно, если выбрать порядок заполнения ""По документу""");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда
		оо = Новый ОписаниеОповещения("ОбработкаВопросаЗаписи_ЗаполнитьПлатёжноРасчётныеДокументы", ЭтотОбъект); 
		ПоказатьВопрос(оо,"Документ был изменён. Записать?", РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьПлатёжноРасчётныеДокументыПродолжение();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписи_ЗаполнитьПлатёжноРасчётныеДокументы(Ответ, ДополнительныеПараметры) Экспорт 

	Если Ответ=КодВозвратаДиалога.Да Тогда
		Записать();
		ЗаполнитьПлатёжноРасчётныеДокументыПродолжение();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлатёжноРасчётныеДокументыПродолжение()
	
	_ЗаполнитьПлатёжноРасчётныеДокументыНаСервере();
	
	Если Объект.ПлатёжноРасчётныеДокументы.Количество() = 0 Тогда 
		ПоказатьПредупреждение(Неопределено, "Зачтенных авансов по документам ""Списание с расчетного счета"" не обнаружено!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьПлатёжноРасчётныеДокументыНаСервере()

	Ответ = Документы.CW_РасходыПоГрузоперевозке.ПолучитьТаблицу_ПлатёжноРасчётныеДокументы_дляСФ(Объект.Ссылка);
	Если Ответ.Код = 0 Тогда
		Объект.ПлатёжноРасчётныеДокументы.Загрузить(Ответ.ПлатёжноРасчётныеДокументы);
		_УправлениеЭлементамиФормы();
	Иначе 
		Сообщить(Ответ.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// ОПЛАТЫ
// ---------------------------------------------------------------------------- 

#Область Оплаты

&НаКлиенте
Процедура Оплаты_Открыть(Команда)
	
	ОткрытьОплату();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОплатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьОплату();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОплату()
	// --- 
	
	Попытка
		
		ПоказатьЗначение(,Элементы.ТаблицаОплат.ТекущиеДанные.ДокументОплаты);
		
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки;
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура Оплаты_Обновить(Команда)
	
	_ОбновитьОплаты();
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьОплаты()
	// --- 
	
	Если (ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ОплатаВходящихДокументов.Период КАК Дата,
		|	CW_ОплатаВходящихДокументов.ДокументОплаты КАК ДокументОплаты,
		|	CW_ОплатаВходящихДокументов.СчетЗадолженности,
		|	CW_ОплатаВходящихДокументов.Всего,
		|	CW_ОплатаВходящихДокументов.ПризнакАкта КАК ПризнакОплатыАкта,
		|	ВЫБОР
		|		КОГДА CW_ОплатаВходящихДокументов.Регистратор = CW_ОплатаВходящихДокументов.Документ
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПризнакСобственныхДвижений,
		|	CW_ОплатаВходящихДокументов.Регистратор
		|ИЗ
		|	РегистрСведений.CW_ОплатаВходящихДокументов КАК CW_ОплатаВходящихДокументов
		|ГДЕ
		|	CW_ОплатаВходящихДокументов.Документ = &Документ
		|	И CW_ОплатаВходящихДокументов.ПризнакАкта = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПризнакОплатыАкта,
		|	CW_ОплатаВходящихДокументов.Регистратор.МоментВремени";
		Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
		// --- 
		ТЗ = Запрос.Выполнить().Выгрузить();
		// --- 
		//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	CW_ОплатаВходящихДокументов.Период КАК Дата,
		//|	CW_ОплатаВходящихДокументов.ДокументОплаты КАК ДокументОплаты,
		//|	CW_ОплатаВходящихДокументов.СчетЗадолженности,
		//|	CW_ОплатаВходящихДокументов.Всего,
		//|	CW_ОплатаВходящихДокументов.ПризнакАкта КАК ПризнакОплатыАкта,
		//|	ВЫБОР
		//|		КОГДА CW_ОплатаВходящихДокументов.Регистратор = CW_ОплатаВходящихДокументов.ДокументБУ
		//|			ТОГДА ИСТИНА
		//|		ИНАЧЕ ЛОЖЬ
		//|	КОНЕЦ КАК ПризнакСобственныхДвижений,
		//|	CW_ОплатаВходящихДокументов.Регистратор
		//|ИЗ
		//|	РегистрСведений.CW_ОплатаВходящихДокументов КАК CW_ОплатаВходящихДокументов
		//|ГДЕ
		//|	CW_ОплатаВходящихДокументов.ДокументБУ = &Документ
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	ПризнакОплатыАкта,
		//|	CW_ОплатаВходящихДокументов.Регистратор.МоментВремени";
		//Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
		//ТЗ2 = Запрос.Выполнить().Выгрузить();
		//Для каждого Стр Из ТЗ2 Цикл
		//	Нстр = ТЗ.Добавить();
		//	ЗаполнитьЗначенияСвойств(Нстр,Стр);
		//КонецЦикла; 
		
		_сф.т_ДобавитьКолонку(ТЗ,"Операция");
		_сф.т_ДобавитьКолонку(ТЗ,"Представление");
		Для каждого Стр Из ТЗ Цикл
			
			Стр.Представление = Стр.ДокументОплаты.ПредставлениеДокумента;
			// --- 
			Если (ТипЗнч(Стр.Регистратор) <> Тип("ДокументСсылка.CW_РасходыПоПриобретениям")) Тогда
				Стр.Операция = "Оплата";
			Иначе
				Стр.Операция = "Зачёт";
			КонецЕсли; 
			
		КонецЦикла; 
		
		ТаблицаОплат.Загрузить(ТЗ);
		//ОбновитьИтогиПоОплатам();
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

Процедура ОбновитьИтогиПоОплатам()
	
	СуммаДокумента = Объект.Услуги.Итог("Всего");
	СуммаОплатыСчета = 0;
	СуммаОплатыАкта = 0;
	Для каждого Стр Из ТаблицаОплат Цикл
		Если (Стр.ПризнакОплатыАкта) Тогда
			СуммаОплатыАкта = СуммаОплатыАкта + Стр.Всего;
		Иначе
			СуммаОплатыСчета = СуммаОплатыСчета + Стр.Всего;
		КонецЕсли; 
	КонецЦикла; 
	// --- 
	ИтогоПоОплатамСчета = "Оплачено по счёту: ";
	ИтогоПоОплатамCчета = ИтогоПоОплатамСчета+Формат(СуммаОплатыСчета,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Объект.Валюта);
	// --- 
	ИтогоПоОплатамАкта = "Оплачено по акту: ";
	ИтогоПоОплатамАкта = ИтогоПоОплатамАкта+Формат(СуммаОплатыАкта,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Объект.Валюта);
	
	АхтунгДляСчета = Ложь;
	Если (СуммаОплатыСчета < СуммаДокумента) Тогда
		АхтунгДляСчета = Истина;
		ИтогоПоОплатамСчета = ИтогоПоОплатамСчета + "; Долг "+Формат(СуммаДокумента - СуммаОплатыСчета,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Объект.Валюта);
	ИначеЕсли (СуммаОплатыСчета > СуммаДокумента) Тогда 
		АхтунгДляСчета = Истина;
		ИтогоПоОплатамСчета = ИтогоПоОплатамСчета + "; Переплата "+Формат(СуммаОплатыСчета - СуммаДокумента,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Объект.Валюта);
	КонецЕсли; 
	Если (АхтунгДляСчета) Тогда
		Элементы.ИтогоПоОплатамСчета.ЦветТекста = ЦветаСтиля.CW_ЦветПлан;
	Иначе 
		Элементы.ИтогоПоОплатамСчета.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	КонецЕсли; 
	// --- 
	АхтунгДляАкта = Ложь;
	Если (СуммаОплатыАкта < СуммаДокумента) Тогда
		АхтунгДляАкта = Истина;
		ИтогоПоОплатамАкта = ИтогоПоОплатамАкта + "; Долг "+Формат(СуммаДокумента - СуммаОплатыАкта,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Объект.Валюта);
	ИначеЕсли (СуммаОплатыАкта > СуммаДокумента) Тогда 
		АхтунгДляАкта = Истина;
		ИтогоПоОплатамАкта = ИтогоПоОплатамАкта + "; Переплата "+Формат(СуммаОплатыАкта - СуммаДокумента,"ЧЦ=15; ЧДЦ=2; ЧН=")+" "+Строка(Объект.Валюта);
	КонецЕсли; 
	Если (АхтунгДляАкта) Тогда
		Элементы.ИтогоПоОплатамАкта.ЦветТекста = ЦветаСтиля.CW_ЦветПлан;
	Иначе 
		Элементы.ИтогоПоОплатамАкта.ЦветТекста = ЦветаСтиля.ЦветТекстаПоля;
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти 

// ---------------------------------------------------------------------------- 
// АКТЫ
// ---------------------------------------------------------------------------- 

#Область Акты

Процедура ОбновитьИтогиПоАктированию()
	
	СВ = Строка(Объект.Валюта);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	
	ИтогоПоАктам = 	"Всего: "+Формат(ТаблицаАктов.Итог("Всего"),ФЧ)+" "+СВ;
	НеАктировано = Объект.Услуги.Итог("Всего")-ТаблицаАктов.Итог("Всего");
	Если НеАктировано <> 0 Тогда
		ИтогоПоАктам = ИтогоПоАктам + ";  Не актировано: "+Формат(НеАктировано,ФЧ)+" "+СВ;
		//Элементы.ИтогоПоАктам.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
	Иначе
		//Элементы.ИтогоПоАктам.ЦветТекста = ЦветаСтиля.ЦветТекстаКнопки;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Акты_Обновить(Команда)
	
	_ОбновитьАкты();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьАкты()
	
	Если НЕ Объект.ПредъявленСчет Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_СоответствиеАктовВходящимСчетам.Акт,
	               |	CW_СоответствиеАктовВходящимСчетам.СчетУчетаЗадолженности,
	               |	CW_СоответствиеАктовВходящимСчетам.Сумма,
	               |	CW_СоответствиеАктовВходящимСчетам.НДС,
	               |	CW_СоответствиеАктовВходящимСчетам.Всего,
	               |	""                              "" КАК Номер,
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК Дата,
	               |	CW_СоответствиеАктовВходящимСчетам.Акт.ПредставлениеДокумента КАК Представление
	               |ИЗ
	               |	РегистрСведений.CW_СоответствиеАктовВходящимСчетам КАК CW_СоответствиеАктовВходящимСчетам
	               |ГДЕ
	               |	CW_СоответствиеАктовВходящимСчетам.Счет = &Счет";
	Запрос.УстановитьПараметр("Счет", Объект.Ссылка);
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	Для каждого Стр Из ТЗ Цикл
		Стр.Номер = СокрЛП(?(Стр.Акт.ПредъявленАкт,Стр.Акт.НомерАкта,Стр.Акт.НомерСФ));
		Стр.Дата = ?(Стр.Акт.ПредъявленАкт,Стр.Акт.ДатаАкта,Стр.Акт.ДатаСФ);
		Стр.Представление = ?(Стр.Акт.ПредъявленАкт,"Акт №","С/ф №")+Строка(Стр.Номер)+" от "+Формат(Стр.Дата,"ДФ=dd.MM.yyyy");
	КонецЦикла; 
	ТЗ.Сортировать("Дата Возр");
	
	ТаблицаАктов.Загрузить(ТЗ);
	Для Каждого СтрТА из ТаблицаАктов Цикл
		СтрТА.Картинка = БиблиотекаКартинок.CW_ПроведенныйДокумент;
	КонецЦикла;	
	
	ТА = ТЗ.Скопировать(,"Акт");
	ТА.Свернуть("Акт");
	КоличествоАктов = ТА.Количество();
	Элементы.СтраницаАкты.Заголовок = "Акты"+?(КоличествоАктов=0,""," ("+Строка(КоличествоАктов)+")");
	
КонецПроцедуры


&НаКлиенте
Процедура Акты_Открыть(Команда)
	
	 ОткрытьАкт();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАктовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьАкт();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАкт()
	// --- 
	
	Попытка
		
		ПоказатьЗначение(,Элементы.ТаблицаАктов.ТекущиеДанные.Акт);
		
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки;
	
	// --- 
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 
// КОМАНДЫ
// ---------------------------------------------------------------------------- 

#Область ВводНаОсновании

&НаКлиенте
Процедура ДиалогВводаНаОсновании() Экспорт 
	// --- 
	
	ПоказатьДиалогВводаНаОсновании();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ПоказатьДиалогВводаНаОсновании()
	// --- 
	
	ПОВ_ОтказОткрытия = Новый ОписаниеОповещения("ЗакрытьФорму",ЭтотОбъект);
	ПОВ = Новый ОписаниеОповещения("ОбработкаРезультатаВводаНаОсновании",ЭтотОбъект, Новый Структура("ПОВ_ОтказОткрытия",ПОВ_ОтказОткрытия)); 
	ПФ = Новый Структура("Основание",ДокументОснование);
	ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.Форма.ФормаВводаНаОснованииУправляемая",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ОбработкаРезультатаВводаНаОсновании(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Отказ = Ложь;
	Если (Ответ = Неопределено) Тогда
		
		Отказ = Истина;
		
	Иначе
		
		Результат = _ОбработатьВводНаОсновании(Ответ);
		Если (НЕ _УФКС.ВыполненоУспешно(Результат)) Тогда
			
			Отказ = Истина;
			
		Иначе
			
			_ИнициализацияФормы();
			
			#Область Динамический_вывод_дополнительных_колонок
			
			//Обновляем динамические колонки параметров ГП
			Если Объект.Услуги.Количество() > 0 Тогда
				_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
			КонецЕсли;
			
			#КонецОбласти
		
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если (Отказ) Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ПОВ_ОтказОткрытия);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ОбработатьВводНаОсновании(Знач Ответ)
	// --- 
	
	ЭтаФорма.Модифицированность=Истина;
	Объект.Дата = Ответ.Дата;
	Объект.Контрагент = Ответ.Контрагент;
	Объект.Договор = Ответ.Договор;
	Объект.Организация = Объект.Договор.Организация;
	Объект.Валюта = Объект.Договор.ВалютаДоговора;
	
	//Для версии КОРП
	Если ВестиУчетПоПодразделениям Тогда
		Объект.ПодразделениеОрганизации = Ответ.Основание.ПодразделениеОрганизации;
	КонецЕсли;
	//Для версии КОРП
	
	// --- 
	_СформироватьОбщиеПараметры();
	// --- 
	
	РасчитатьСрокОплатыДокумента();
	
	Объект.СпособЗачетаАвансовОЗ = _ДС().ПД.ПорядокЗачетаАвансовОЗ;
	Объект.СпособЗачетаАвансов = _ДС().ПД.ПорядокЗачетаАвансов;
	
	// --- 
	
	Объект.ПредъявленСчет = Ответ.Основание.ФормируетсяСчет;
	//Объект.НомерСчета = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация,Номер", Ответ.Основание.Организация,Ответ.Основание.НомерСчета));
	Объект.НомерСчета = CW_Документы.ПолучитьНомерНаПечать(Ответ.Основание, "НомерСчета", "ДатаСчета");
	ОБъект.ДатаСчета = Ответ.Основание.ДатаСчета;
	// --- 
	Объект.ПредъявленАкт = Ответ.Основание.ФормируетсяАкт;
	//Объект.НомерАкта = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация,Номер", Ответ.Основание.Организация,Ответ.Основание.НомерАкта));
	Объект.НомерАкта = CW_Документы.ПолучитьНомерНаПечать(Ответ.Основание, "НомерАкта", "ДатаАкта");
	ОБъект.ДатаАкта = Ответ.Основание.ДатаАкта;
	// --- 
	Объект.ПредъявленСФ = Ответ.Основание.ФормируетсяСчетФактура;
	//Объект.НомерСФ = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация,Номер", Ответ.Основание.Организация,Ответ.Основание.НомерСчетаФактуры));
	Объект.НомерСФ = CW_Документы.ПолучитьНомерНаПечать(Ответ.Основание, "НомерСчетаФактуры", "ДатаСчетаФактуры");
	ОБъект.ДатаСФ = Ответ.Основание.ДатаСчетаФактуры;
	
	// --- 
	
	ПорядокОтражения = Ответ.ПорядокОтражения;
	Если (НЕ ЗначениеЗаполнено(ПорядокОтражения)) Тогда
		ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление;
	КонецЕсли; 
	ДатаИсточника = ДокументОснование.Дата;
	ВалютаИсточника = ДокументОснование.Валюта;
	
	НачальнаяДатаДокумента  = Объект.Дата;
	ВзаиморасчетыВУЕ		= Объект.Договор.ВзаиморасчетыВУЕ;	
	
	СостояниеДокумента 		= ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	// --- 
	
	//
	Ответ = Документы.CW_РасходыПоГрузоперевозке.Услуги_СформироватьПоДокументуДоходов(ДокументОснование,Объект.Договор);
	Если Ответ.Код <> 0 Тогда
		
		Возврат(_УФКС.Ответ(1));
		
	Иначе
		
		Объект.Продавец = Ответ.Продавец;
		ТаблицаУслуг = Ответ.ТаблицаУслуг; // в валюте и рублях
		
		// анализируем
		ПересчетЧерезРубли = Ложь;
		// если валюта документов одинаковая
		Если (ВалютаИсточника = Объект.Валюта) Тогда
			
			// если рубли
			Если (Объект.Валюта = _ДС().КО.ВалютаРегламентированногоУчета) Тогда
				
				ПересчетЧерезРубли = Ложь;
				
			Иначе
				
				// проверяем даты документов и порядок отражения
				Если (ПорядокОтражения=Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам) Тогда
					
					ПересчетЧерезРубли = Ложь;
					
				ИначеЕсли (ПорядокОтражения=Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление) Тогда 
					
					// проверяем даты
					Если (НачалоДня(Объект.Дата)=НачалоДня(ДатаИсточника)) Тогда
						
						ПересчетЧерезРубли = Ложь;
						
					Иначе
						
						ПересчетЧерезРубли = Истина;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		Иначе
			
			ПересчетЧерезРубли = Истина;
			
		КонецЕсли; 
		
		Если (ПересчетЧерезРубли) Тогда
			
			СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,Объект.Дата);
			Документы.CW_РасходыПоГрузоперевозке.Услуги_ПересчитатьИзВалютыРегламентированногоУчета(ТаблицаУслуг,СК);
			
		КонецЕсли; 
		
		ТаблицаУслуг.Колонки.Удалить(ТаблицаУслуг.Колонки.Найти("ПорядокОтражения"));
		ТаблицаУслуг.Колонки.Добавить("ПорядокОтражения");
		ТаблицаУслуг.ЗаполнитьЗначения(ПорядокОтражения,"ПорядокОтражения");
		Если (ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
			ТаблицаУслуг.Колонки.Добавить("Покупатель");
			ТаблицаУслуг.ЗаполнитьЗначения(ДокументОснование.Контрагент,"Покупатель");
			ТаблицаУслуг.Колонки.Добавить("ДоговорПокупателя");
			ТаблицаУслуг.ЗаполнитьЗначения(ДокументОснование.Договор,"ДоговорПокупателя");
		КонецЕсли; 
		
		//	
		//	// если надо формируем новое представление
		//	флЗановоФормироватьПредставлениеПриПеревыставленииЗатрат = CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат");
		//	Если флЗановоФормироватьПредставлениеПриПеревыставленииЗатрат Тогда
		//		
		//		Документы.CW_ДоходыПоГрузоперевозке.Услуги_СформироватьПредставлениеНоменклатуры(ТаблицаУслуг,Объект.Договор,Объект,флЗановоФормироватьПредставлениеПриПеревыставленииЗатрат);
		//		
		//	КонецЕсли; 
		//	
		//	// --- 
		Объект.Услуги.Загрузить(ТаблицаУслуг);
		
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());

		Возврат(_УФКС.Ответ());
		
	КонецЕсли; 
	//
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму(Ответ,ДополнительныеПараметры) Экспорт
	// --- 
	
	Закрыть();
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ФормаДокументCW_ДоходыПоГрузоперевозкеСоздатьНаОсновании(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Объект.Ссылка);
	ПараметрыФормы.Вставить("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаДокументCW_РасходыПоГрузоперевозкеСоздатьНаОсновании(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Объект.Ссылка);
	ПараметрыФормы.Вставить("Основание"			, Объект.Ссылка);
	ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры



#КонецОбласти 

#Область ПодборГрузоперевозок 

&НаКлиенте
Процедура Подбор(Команда)
	
	Если Объект.Валюта.Пустая() Тогда
		
		_УФК.ВывестиПредупреждение("Не указана валюта документа");
		Возврат;
		
	КонецЕсли; 
	
	// формируем параметры
	ПОВ = Новый ОписаниеОповещения("ОбработкаПодбора",ЭтотОбъект);
	ПФ = _ПараметрыФормыПодбора();
	ОткрытьФорму("ОбщаяФорма.CW_ФормаПодбора",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбора(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		_ОбработатьПодбор(Результат);
		ДобавитьЗависимуюУслугу();
		
		// обновим итоги табличных частей на форме
		ОбновитьИтогиПоУслугам();
		_ОбновитьСтатусПометокУдаления();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗависимуюУслугу()
	
	//Проверим и при необходимости добавим дополнительную услугу
	CW_Подписки.ДобавитьДополнительнуюУслугу(Объект);
	
КонецПроцедуры


&НаСервере
Функция _ПараметрыФормыПодбора()
	// --- 
	ДатаДокумента = Объект.Дата;
	Если Объект.ПредъявленСчет 
		и ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
		ДатаДокумента = Объект.ДатаСчета;  
	КонецЕсли;

	ДатаДокумента = ?(ДатаДокумента = Дата(1,1,1), ТекущаяДата(), ДатаДокумента);
	
	ПФ = Новый Структура("Договор,Валюта,ТипДокумента,Грузоперевозки,РаздельныйУчетВходящегоНДС,ГруппировкаЗатратПоПодразделениям,ДатаДокумента");
	// --- 
	ПФ.Договор 			= Объект.Договор;
	ПФ.ДатаДокумента 	= ДатаДокумента;
	ПФ.Валюта 			= Объект.Валюта;
	ПФ.ТипДокумента 	= РеквизитФормыВЗначение("Объект").Метаданные().Имя;
	// --- 
	Попытка
		РаздельныйУчетВходящегоНДС = _ДС().УП.РаздельныйУчетНДСНаСчете19;	
	Исключение
	    РаздельныйУчетВходящегоНДС = Ложь;
	КонецПопытки; 
	ПФ.РаздельныйУчетВходящегоНДС = (РаздельныйУчетВходящегоНДС И CW_ПраваДоступа.ПравоДоступно("РедактированиеСпособаУчетаНДС"));
	// --- 
	Попытка
		ГруппировкаЗатратПоПодразделениям = _ДС().УП.ГруппировкаЗатратПоПодразделениям;
	Исключение
	    ГруппировкаЗатратПоПодразделениям = Ложь;
	КонецПопытки; 
	ПФ.ГруппировкаЗатратПоПодразделениям = ГруппировкаЗатратПоПодразделениям;
	// --- 
	ПФ.Грузоперевозки = _сф.м_СоздатьИзКолонкиТЗ(Объект.Услуги.Выгрузить(),"Грузоперевозка");
	// --- 
	Возврат(ПФ);
	
	// --- 
КонецФункции

&НаСервере
Процедура _ОбработатьПодбор(Результат)
	// --- 
	
	Если Результат.Вариант = "Грузоперевозка" Тогда
		
		Нстр = Объект.Услуги.Добавить();
		Нстр.Грузоперевозка = Результат.Грузоперевозка;
		Нстр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		Нстр.Количество = 1;
		// --- 
		_ПодставитьПодразделение(Нстр);
		// --- 
		ОбновитьИтогиПоУслугам();
		_ОбновитьСтатусПометокУдаления();
		
	ИначеЕсли Результат.Вариант = "Бюджет" Тогда
		
		Если (Результат.Свойство("КомментарийЗаполнения")) Тогда
			Сообщить(Результат.КомментарийЗаполнения); 
		КонецЕсли; 
		ТЗУслуг = ПолучитьИзВременногоХранилища(Результат.Строки);
		Если (Результат.ПерезаполнитьДокумент) Тогда
			Объект.Услуги.Очистить();
		КонецЕсли; 		
		Для каждого Стр Из ТЗУслуг Цикл
			
			Нстр = Объект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,Стр);
			// заполнение покупателя и договора
			СтрокаТЧ = Нстр;
			Если СтрокаТЧ.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда
				
				СтруктураПараметровКлиента = Новый Структура;
				СтруктураПараметровКлиента.Вставить("Объект"				, СтрокаТЧ.Грузоперевозка);
				СтруктураПараметровКлиента.Вставить("ЭтоВариантБюджета"		, Ложь);
				СтруктураПараметровКлиента.Вставить("Контрагент"			, СтрокаТЧ.Грузоперевозка.Клиент);
				
				КлиентПлат = CW_Финансы.ВернутьПлательщика(СтруктураПараметровКлиента);
				Если ЗначениеЗаполнено(СтрокаТЧ.Грузоперевозка.Клиент) И КлиентПлат <> СтрокаТЧ.Покупатель Тогда
					
					СтрокаТЧ.Покупатель = КлиентПлат;
					// пробуем получить договор
					СтрокаТЧ.ДоговорПокупателя = CW_Документы.ПолучитьПоследнийДоговор(СтрокаТЧ.Покупатель, Объект.Организация, Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
					
				КонецЕсли; 
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) И (СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты ИЛИ СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.ПустаяСсылка()) Тогда	
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Дата"					, Объект.Дата);
				СтруктураПараметров.Вставить("Организация"			, Объект.Организация);
				СтруктураПараметров.Вставить("Номенклатура"			, СтрокаТЧ.Номенклатура);
				СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, СтрокаТЧ.Номенклатура.НоменклатурнаяГруппа);
				
				СтрокаТЧ.СпособУчетаНДС = CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров);
				
			КонецЕсли; 
			// --- 
			_ПодставитьПодразделение(СтрокаТЧ);
			// --- 
			
		КонецЦикла;
		// --- 
		ОбновитьИтогиПоУслугам();
		_ОбновитьСтатусПометокУдаления();
		
	ИначеЕсли Результат.Вариант = "ГрузоперевозкиИНоменклатура" Тогда
		
		СН = Результат.СтруктураНоменклатуры;
		
		// определяем вариант представления
		// 0 - получаем шаблон
		// 1 - используем полученный шаблон
		
		// определяем вариант суммы
		// 0 - по цене номенклатуры
		// 1 - фиксированное значение
		// 2 - фиксированное значение цены
		// для фиксированных значений необходимо прочитать саму сумму и признак того, что сумма с НДС
		
		// режим распределения суммы
		// 0 - на все г/п
		// 1 - на каждую г/п
		// 2 - пропорционально параметру
		// 3 - пропорционально выручке
		
		// порядок получения количества
		// 0 - из параметра грузоперевозки
		// 1 - фиксированная сумма
		
		СуммаУслуги = 0;
		РазделитьКоличествоУслугНаКоличествоГрузоперевозок 	= _сф.ст_ПолучитьСвойство(СН,"РазделитьКоличествоУслугНаКоличествоГрузоперевозок");
		РаспределитьКоличествоПророрциональноПараметру 		= _сф.ст_ПолучитьСвойство(СН,"РаспределитьКоличествоПророрциональноПараметру");
		ПорядокПолученияКоличества 							= _сф.ст_ПолучитьСвойство(СН,"ПорядокПолученияКоличества");
		
		Если ПорядокПолученияКоличества = 1 Тогда
			Количество = _сф.ст_ПолучитьСвойство(СН,"Количество");
			Если (Количество = Неопределено) Тогда
				Количество = 1;
			КонецЕсли;
		Иначе
			
			Если РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки тогда
				
				//получаем количество из параметров ГП
				КоличествоПоГрузоперевозкам = Новый Соответствие;
				Для каждого Грузоперевозка Из Результат.Грузоперевозки Цикл
					
					//Получаем количество из Параметра
					ЗначениеПараметра   = 0;
					СтруктураПараметров = Новый Структура("ТипПеревозки,Номенклатура,ЕдиницаИзмерения", Грузоперевозка.ТипПеревозки,СН.Номенклатура,СН.Номенклатура.ЕдиницаИзмерения);		
					НайденныйПараметр 	= CW_Документы.ПолучитьПараметрДляПодстановкиЗначенияВКоличество(СтруктураПараметров);
					
					Если НайденныйПараметр <> Неопределено Тогда
						//Получаем только первое значение
						СтрокаПараметраГП = Грузоперевозка.ПараметрыГрузоперевозки.Найти(НайденныйПараметр, "Параметр");
						
						Если СтрокаПараметраГП <> Неопределено Тогда
							ЗначениеПараметра = СтрокаПараметраГП.Значение;
						КонецЕсли;
						
					КонецЕсли;	
					
					Если Не УстановитьЗначениеНольЗначениеПараметраНеУстановлено и Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
						ЗначениеПараметра = 1;
					КонецЕсли;
					
					КоличествоПоГрузоперевозкам.Вставить(Грузоперевозка,ЗначениеПараметра);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;

		ОбратныйПересчет = Ложь;
		Если НЕ ЗначениеЗаполнено(СН.СтавкаНДС) Тогда
			
			СуммаУслуги = 0;
			
		Иначе
			
			Если СН.ВариантОпределенияСуммы =1 Тогда
				
				СуммаУслуги 		= СН.Всего;
				ОбратныйПересчет 	= СН.СуммаВключаетНДС;  
				
			ИначеЕсли СН.ВариантОпределенияСуммы = 2 Тогда
				
				ЦенаУслуги 			= СН.Цена;
				ОбратныйПересчет 	= СН.ЦенаВключаетНДС; 
				
			ИначеЕсли Не ЕстьОграниченияПоСпискуУслуг Тогда
				
				// получаем сумму из типа цены
				ТипЦен = _ДС().ПД.ТипЦен;
				Если НЕ ТипЦен.Пустая() Тогда
					
					СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта,_ДатаВозникновенияЗадолженности());
					Цена = Ценообразование.ПолучитьЦенуНоменклатуры(СН.Номенклатура, ТипЦен, _ДатаВозникновенияЗадолженности(), Объект.Валюта, СК.Курс,СК.Кратность);
					ОбратныйПересчет = ТипЦен.ЦенаВключаетНДС;
					СуммаУслуги = Цена*Количество;
					
				Иначе
					
					ОбратныйПересчет = Ложь;
					СуммаУслуги = 0;
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли; 
		
		// пропорционально выручке
		Если (СуммаУслуги <> 0 И СН.ВариантРаспределения = 3) Тогда
			
			Грузоперевозки = Результат.Грузоперевозки;
			ОпределениеВыручки = _сф.ст_ПолучитьСвойство(СН,"ОпределениеВыручки");
			УчитыватьСуммыНеактированныхСчетов = _сф.ст_ПолучитьСвойство(СН,"УчитыватьСуммыНеактированныхСчетов");
			// --- 
			
			// по счетам
			Если (ОпределениеВыручки = 0) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка,
				|	CW_ДоходыПоГрузоперевозкам.Всего
				|ИЗ
				|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
				|ГДЕ
				|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяСчет = ИСТИНА
				|	И CW_ДоходыПоГрузоперевозкам.Грузоперевозка В(&Грузоперевозки)";
				Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозки);
				ТЗ = Запрос.Выполнить().Выгрузить();
				ТЗ.Свернуть("Грузоперевозка","Всего");
				
			КонецЕсли; 
			
			// по актам
			Если (ОпределениеВыручки = 1) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка,
				|	CW_ДоходыПоГрузоперевозкам.Всего
				|ИЗ
				|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
				|ГДЕ
				|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяАкт = ИСТИНА
				|	И CW_ДоходыПоГрузоперевозкам.Грузоперевозка В(&Грузоперевозки)";
				Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозки);
				ТЗ = Запрос.Выполнить().Выгрузить();
				ТЗ.Свернуть("Грузоперевозка","Всего");
				
				Если (УчитыватьСуммыНеактированныхСчетов) Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					               |	CW_АктированиеИсходящихСчетов.Грузоперевозка,
					               |	CW_АктированиеИсходящихСчетов.Валюта,
					               |	CW_АктированиеИсходящихСчетов.Счет.ДатаСчета КАК ДатаСчета,
					               |	ВЫБОР
					               |		КОГДА CW_АктированиеИсходящихСчетов.ВидДвижения = &Приход
					               |			ТОГДА CW_АктированиеИсходящихСчетов.Всего
					               |		ИНАЧЕ -CW_АктированиеИсходящихСчетов.Всего
					               |	КОНЕЦ КАК Всего_Валюта,
					               |	0 КАК Всего
					               |ИЗ
					               |	РегистрНакопления.CW_АктированиеИсходящихСчетов КАК CW_АктированиеИсходящихСчетов
					               |ГДЕ
					               |	CW_АктированиеИсходящихСчетов.Грузоперевозка В(&Грузоперевозки)";
					Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозки);
					ТЗ2 = Запрос.Выполнить().Выгрузить();
					ТЗ2.Свернуть("Грузоперевозка,Валюта","Всего_Валюта,Всего");
					Для каждого Стр Из ТЗ2 Цикл
						
						Если (ТЗ2.Всего_Валюта > 0) Тогда
							
							КВ = CW_Финансы.ПолучитьКурсВалюты(Стр.Валюта,Стр.ДатаСчета);
							Стр.Всего = CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Всего_Валюта,Стр.Валюта,CW_Настройки.ВалютаРегламентированногоУчета(),КВ.Курс,1,КВ.Кратность,1); 
							// --- 
							Отбор = Новый Структура("Грузоперевозка",Стр.Грузоперевозка);
							СтрокаГП = _сф.к_НайтиСтроку(ТЗ,Отбор);
							Если (СтрокаГП <> Неопределено) Тогда
								
								_сф.Инкремент(СтрокаГП.Всего,Стр.Всего);
								
							КонецЕсли; 
							
						КонецЕсли; 
						
					КонецЦикла; 
					// --- 
					
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			БазаРаспределенияПоВыручке = ТЗ.Итог("Всего");
			СоответствиеВыручки = _сф.со_Создать("Грузоперевозка","Всего",ТЗ);
			// --- 
			ОстатокРаспределения = СуммаУслуги;
			
		КонецЕсли;	
		
		// распределение по параметру
		Если (СуммаУслуги <> 0 И СН.ВариантРаспределения = 2) Тогда 
			
			// считаем общую сумму 
			ТР = _сф.т_Создать("Грузоперевозка,Значение");
			Для каждого Грузоперевозка Из Результат.Грузоперевозки Цикл
				
				СтрокаПараметра = _сф.к_НайтиСтроку(Грузоперевозка.ПараметрыГрузоперевозки,_сф.ст_Отбор("Параметр",СН.ПараметрРаспределения));
				Если СтрокаПараметра = Неопределено Тогда
					
					Значение = 0;
					
				Иначе
					
					Значение = Число(СтрокаПараметра.Значение);
					
				КонецЕсли; 
				
				Нстр = ТР.Добавить();
				Нстр.Грузоперевозка = Грузоперевозка;
				Нстр.Значение = Значение;
				
			КонецЦикла; 
			
			БазаРаспределенияПоПараметру = _сф.Итог(ТР,"Значение");
			СоответствиеЗначенийПараметра = _сф.со_Создать("Грузоперевозка","Значение",ТР);
			
			Если БазаРаспределенияПоПараметру = 0 Тогда
				
				СуммаУслуги = 0;
				
			КонецЕсли; 
			
		КонецЕсли;
		
		// проверяем вариант распределения
		Если СН.ВариантРаспределения = 0 ИЛИ СН.ВариантРаспределения = 2 Тогда
			
			ОстатокРаспределения = СуммаУслуги;
			
		КонецЕсли; 
		
		
		
		Ставка = CW_Финансы.ПолучитьСтавкуНДС(СН.СтавкаНДС);
		
		// ЗАПОЛНЯЕМ
		// ---------------------------------------------------------------------------- 
		Индекс=0;
		Для каждого Грузоперевозка Из Результат.Грузоперевозки Цикл
			
			_сф.Инкремент(Индекс);
			
			Нстр = Объект.Услуги.Добавить();
			Нстр.Грузоперевозка 	= Грузоперевозка;
			Нстр.Номенклатура 		= СН.Номенклатура;
			Нстр.СтатьяЗатрат 		= СН.СтатьяЗатрат;
			Нстр.ПорядокОтражения 	= СН.ПорядокОтраженияРасходов;
			Нстр.СтавкаНДС 			= СН.СтавкаНДС;
			
			// --- 
			Если ПорядокПолученияКоличества = 0 Тогда
				Количество = КоличествоПоГрузоперевозкам.Получить(Грузоперевозка);
				//ВРЕМЕННО УДАЛЕНО
				//Если Количество = 0 Тогда
				//	Сообщение = новый СообщениеПользователю;
				//	Сообщение.Текст = "По грузоперевозке "+Строка(Грузоперевозка)+" не удалось получить количество услуги!";
				//	Сообщение.ПутьКДанным  = "Объект";
				//	Сообщение.Поле    = "Услуги["+Нстр.ПолучитьИдентификатор()+"].Количество";
				//	Сообщение.Сообщить();
				//конецЕсли;
			КонецЕсли;
			
			Нстр.Количество = Количество;
			Если СН.ВариантОпределенияСуммы = 2 Тогда  
				
				Если ОбратныйПересчет Тогда
					Нстр.Всего 	= ЦенаУслуги * Количество;
					Нстр.НДС 	= Нстр.Всего*(Ставка/(100+Ставка));
					Нстр.Сумма 	= Нстр.Всего - Нстр.НДС;
					Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма, Нстр.Количество);
				Иначе
					Нстр.Цена 	= ЦенаУслуги; 
					Нстр.Сумма 	= ЦенаУслуги * Количество;
					Нстр.НДС 	= Нстр.Сумма * (Ставка/100);
					Нстр.Всего 	= Нстр.Сумма + Нстр.НДС;
				КонецЕсли;  
				
				ПересчитатьСтрокуНаСерере(Нстр.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
				
			ИначеЕсли ЕстьОграниченияПоСпискуУслуг и СН.ВариантОпределенияСуммы = 0  Тогда
				
				Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда 
					
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("АдресУслугПоДоговору"						, АдресУслугПоДоговору);
					СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтГруза"		, УстанавливатьЦенуВЗависимостиОтГруза);
					СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтКлиента"	, УстанавливатьЦенуВЗависимостиОтКлиента);
					
					СтруктураПараметров.Вставить("Номенклатура"							, СН.Номенклатура);
					Если УстанавливатьЦенуВЗависимостиОтГруза Тогда
						СтруктураПараметров.Вставить("Груз" , Грузоперевозка.Груз);
					КонецЕсли;
					Если УстанавливатьЦенуВЗависимостиОтКлиента тогда
						
						СтруктураПараметровКлиента = Новый Структура;
						СтруктураПараметровКлиента.Вставить("Объект"				, Грузоперевозка);
						СтруктураПараметровКлиента.Вставить("ЭтоВариантБюджета"		, Ложь);
						СтруктураПараметровКлиента.Вставить("Контрагент"			, Грузоперевозка.Клиент);
						
						тПокупатель = CW_Финансы.ВернутьПлательщика(СтруктураПараметровКлиента);
						
						СтруктураПараметров.Вставить("Клиент", тПокупатель);
					КонецЕсли;
					
					УслугаДоговора = _УФС.ПолучитьУслугуДоговораПоПараметрам(СтруктураПараметров);	

					Если УслугаДоговора <> Неопределено Тогда 				   
						
						Если ЗначениеЗаполнено(УслугаДоговора.ПорядокОтражения) Тогда
							Нстр.ПорядокОтражения = УслугаДоговора.ПорядокОтражения;
						КонецЕсли;
						
						Сумма		= УслугаДоговора.ЦенаБезНДС * Количество;
						Если ЗначениеЗаполнено(УслугаДоговора.СтавкаНДС)  Тогда
							НДС = Сумма * CW_Финансы.ПолучитьСтавкуНДС(УслугаДоговора.СтавкаНДС)/100;
						Иначе
							НДС = 0;
						КонецЕсли; 
						
						Нстр.СтавкаНДС 	= УслугаДоговора.СтавкаНДС;
						Нстр.Цена 		= УслугаДоговора.ЦенаБезНДС;
						
						Если УслугаДоговора.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДССверху тогда
							Нстр.Сумма 			= УслугаДоговора.ЦенаБезНДС * Количество;
							ОбратныйПересчет 	= Ложь;
						Иначе //в сумме
							Нстр.Всего 			= УслугаДоговора.Цена * Количество;
							ОбратныйПересчет 	= Истина;
						КонецЕсли;
						
						Ставка = CW_Финансы.ПолучитьСтавкуНДС(УслугаДоговора.СтавкаНДС);
						
						Если ОбратныйПересчет Тогда
							
							Нстр.НДС 	= Нстр.Всего*(Ставка/(100+Ставка));
							Нстр.Сумма 	= Нстр.Всего - Нстр.НДС;
							Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
							
						Иначе
							
							Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
							Нстр.НДС 	= Нстр.Сумма*(Ставка/100);
							Нстр.Всего 	= Нстр.Сумма+Нстр.НДС;
							
						КонецЕсли; 
						
					КонецЕсли; 

				КонецЕсли; 

				
			Иначе
				// --- 
				
				Если (СуммаУслуги <> 0) Тогда
					// --- 
					
					// на каждую г/п
					Если СН.ВариантРаспределения = 1 Тогда
						
						Если ОбратныйПересчет Тогда
							
							Нстр.Всего = СуммаУслуги;
							
						Иначе
							
							Нстр.Сумма = СуммаУслуги;
							
						КонецЕсли; 
						
						Если (РазделитьКоличествоУслугНаКоличествоГрузоперевозок) Тогда
							
							Нстр.Количество = Количество/Результат.Грузоперевозки.Количество();
							
						КонецЕсли; 
						
						// на все г/п
					ИначеЕсли СН.ВариантРаспределения = 0 Тогда 
						
						Если ОбратныйПересчет Тогда
							
							Нстр.Всего = СуммаУслуги/Результат.Грузоперевозки.Количество();
							_сф.Декремент(ОстатокРаспределения,Нстр.Всего);
							
						Иначе
							
							Нстр.Сумма = СуммаУслуги/Результат.Грузоперевозки.Количество();
							_сф.Декремент(ОстатокРаспределения,Нстр.Сумма);
							
						КонецЕсли; 
						
						Если (РазделитьКоличествоУслугНаКоличествоГрузоперевозок) Тогда
							
							Нстр.Количество = Количество/Результат.Грузоперевозки.Количество();
							
						КонецЕсли;
						
						Если Результат.Грузоперевозки.Количество()=Индекс Тогда
							
							_сф.Инкремент(?(ОбратныйПересчет,Нстр.Всего,Нстр.Сумма),ОстатокРаспределения);
							
						КонецЕсли; 
						
						// по параметру
					ИначеЕсли СН.ВариантРаспределения = 2 Тогда 
						
						Если ОбратныйПересчет Тогда
							
							Нстр.Всего = СуммаУслуги*СоответствиеЗначенийПараметра.Получить(Грузоперевозка)/БазаРаспределенияПоПараметру;
							_сф.Декремент(ОстатокРаспределения,Нстр.Всего);
							
						Иначе
							
							Нстр.Сумма = СуммаУслуги*СоответствиеЗначенийПараметра.Получить(Грузоперевозка)/БазаРаспределенияПоПараметру;
							_сф.Декремент(ОстатокРаспределения,Нстр.Сумма);
							
						КонецЕсли; 
						
						Если (РаспределитьКоличествоПророрциональноПараметру) Тогда
							
							Нстр.Количество = Количество*СоответствиеЗначенийПараметра.Получить(Грузоперевозка)/БазаРаспределенияПоПараметру;
							
						КонецЕсли; 
						
						Если Результат.Грузоперевозки.Количество()=Индекс Тогда
							
							_сф.Инкремент(?(ОбратныйПересчет,Нстр.Всего,Нстр.Сумма),ОстатокРаспределения);
							
						КонецЕсли; 
						
						// по выручке
					ИначеЕсли (СН.ВариантРаспределения = 3) Тогда 
						
						ВыручкаПоГрузоперевозке = СоответствиеВыручки.Получить(Грузоперевозка);
						Если (ВыручкаПоГрузоперевозке = Неопределено) Тогда
							Продолжить;
						КонецЕсли; 
						Если (ВыручкаПоГрузоперевозке = 0) Тогда
							Продолжить;
						КонецЕсли; 
						
						Если ОбратныйПересчет Тогда
							
							Нстр.Всего = СуммаУслуги*СоответствиеВыручки.Получить(Грузоперевозка)/БазаРаспределенияПоВыручке;
							_сф.Декремент(ОстатокРаспределения,Нстр.Всего);
							
						Иначе
							
							Нстр.Сумма = СуммаУслуги*СоответствиеВыручки.Получить(Грузоперевозка)/БазаРаспределенияПоВыручке;
							_сф.Декремент(ОстатокРаспределения,Нстр.Сумма);
							
						КонецЕсли; 
						
						Если Результат.Грузоперевозки.Количество()=Индекс Тогда
							
							_сф.Инкремент(?(ОбратныйПересчет,Нстр.Всего,Нстр.Сумма),ОстатокРаспределения);
							
						КонецЕсли; 
						
					КонецЕсли; 
					
					Если ОбратныйПересчет Тогда
						
						Нстр.НДС 	= Нстр.Всего*(Ставка/(100+Ставка));
						Нстр.Сумма 	= Нстр.Всего - Нстр.НДС;
						Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
						
					Иначе
						
						Нстр.Цена 	= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
						Нстр.НДС 	= Нстр.Сумма*(Ставка/100);
						Нстр.Всего 	= Нстр.Сумма+Нстр.НДС;
						
					КонецЕсли; 
					
					ПересчитатьСтрокуНаСерере(Нстр.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);

				КонецЕсли; 
			КонецЕсли;
			
			// ---------------------------------------------------------------------------- 
			
			// устанавливаем представление
			Если СН.ВариантПредставления = 0 Тогда
				
				ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
				
				ПараметрыШаблона.Номенклатура 	= Нстр.Номенклатура;
				ПараметрыШаблона.Объект 		= Объект;
				ПараметрыШаблона.Дата 			= Объект.Дата;
				ПараметрыШаблона.Договор 		= Объект.Договор;
				ПараметрыШаблона.ВидДоговора 	= Объект.Договор.ВидДоговора;
				ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
				
				CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(Нстр, ПараметрыШаблона); 
				
			Иначе
				
				Представление = СН.Представление;
				Если Найти(Представление,"%")  <> 0 Тогда
					
					// это шаблон
					Нстр.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(Представление,Объект,Нстр);
					
				Иначе
					
					Нстр.Представление = Представление;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			// заполнение покупателя и договора
			СтрокаТЧ = Нстр;
			Если СтрокаТЧ.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда
				
				СтруктураПараметровКлиента = Новый Структура;
				СтруктураПараметровКлиента.Вставить("Объект"				, СтрокаТЧ.Грузоперевозка);
				СтруктураПараметровКлиента.Вставить("ЭтоВариантБюджета"		, Ложь);
				СтруктураПараметровКлиента.Вставить("Контрагент"			, СтрокаТЧ.Грузоперевозка.Клиент);
				
				КлиентПлат = CW_Финансы.ВернутьПлательщика(СтруктураПараметровКлиента);
				СтрокаТЧ.Покупатель = КлиентПлат;
				Если ЗначениеЗаполнено(СтрокаТЧ.Покупатель) Тогда
					
					СтрокаТЧ.Покупатель = КлиентПлат;
					ДоговорГП = ДоговорГрузоперевозки(СтрокаТЧ.Грузоперевозка, СтрокаТЧ.Покупатель);
					Если (ДоговорГП = Неопределено) Тогда
						СтрокаТЧ.ДоговорПокупателя = ПоследнийДоговорКонтрагента(СтрокаТЧ.Покупатель, Объект.Организация, ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
					Иначе
						СтрокаТЧ.ДоговорПокупателя = ДоговорГП;
					КонецЕсли; 
					
				КонецЕсли; 
				
			Иначе
				// --- 
				_ПодставитьПодразделение(СтрокаТЧ);	
				
			КонецЕсли; 
			
			Если (ЗначениеЗаполнено(СН.Подразделение)) Тогда
				
				СтрокаТЧ.Подразделение = СН.Подразделение;
				
			Иначе
				
				_ПодставитьПодразделение(СтрокаТЧ);
				
			КонецЕсли; 
			
			// --- 
			
		КонецЦикла; 
		// --- 
		ОбновитьИтогиПоУслугам();
		_ОбновитьСтатусПометокУдаления();
		
		
		#Область Динамический_вывод_дополнительных_колонок
		
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
		
		#КонецОбласти			
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область УдалениеВедомых 

&НаКлиенте
Процедура ВедомыйСчет_Удалить(Команда)
	
	УдалитьВедомый("Счет");	
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомыйДокумент_Удалить(Команда)
	// --- 
	
	УдалитьВедомый("Документ");	
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВедомыйСчетФактура_Удалить(Команда)
	
	УдалитьВедомый("СчетФактура");
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура УдалитьВедомый(ВидВедомого)
	// --- 
	
	//Если (ЭтаФорма.Модифицированность) Тогда
	//	
	//	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаЗаписиДляУдаленияВедомых",ЭтотОбъект, Новый Структура("ВидВедомого",ВидВедомого)); 
	//	ПоказатьВопрос(ПОВ,"Документ необходимо записать. 
	//				   |Продолжить?", РежимДиалогаВопрос.ДаНет); 
	//				   
	//Иначе
	//	
	//	ВыполнитьУдалениеВедомого(ВидВедомого);
	//	
	//КонецЕсли; 
	
	ВыполнитьУдалениеВедомого(ВидВедомого);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписиДляУдаленияВедомых(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ=КодВозвратаДиалога.Да) Тогда
		
		Записать();
		ВыполнитьУдалениеВедомого(ДополнительныеПараметры.ВидВедомого)
		
	КонецЕсли;
		
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьУдалениеВедомого(ВидВедомого)
	// --- 
	
	Если (ВидВедомого = "Документ") Тогда 
		
		ТекстВопроса = "Ведомый документ поступления будет отвязан и помечен на удаление. 
				   |Продолжить?";
				   
	ИначеЕсли (ВидВедомого = "СчетФактура") Тогда 
		
		ТекстВопроса = "Ведомый счёт-фактура поступления будет отвязан и помечен на удаление.
				   |Продолжить?";
				   
	ИначеЕсли (ВидВедомого = "Счет") Тогда 
		
		ТекстВопроса = "Ведомый счёт поступления будет отвязан и помечен на удаление.
				   |Продолжить?";
		
	КонецЕсли; 
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУдаленияВедомых",ЭтотОбъект, Новый Структура("ВидВедомого",ВидВедомого)); 
	ПоказатьВопрос(ПОВ,ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУдаленияВедомых(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		
		ВыполнитьНепосредственноеУдалениеВедомых(ДополнительныеПараметры.ВидВедомого);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ВыполнитьНепосредственноеУдалениеВедомых(ВидВедомого)
	// --- 
	
	Если (ВидВедомого = "Счет") Тогда
		
		Ответ = _УдалитьВедомыйСчет();
		
	ИначеЕсли (ВидВедомого = "Документ") Тогда 
		
		Ответ = _УдалитьВедомый();
		
	ИначеЕсли (ВидВедомого = "СчетФактура") Тогда 
		
		Ответ = _УдалитьВедомыйСчетФактуру();
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

// --- 

&НаСервере
Функция _УдалитьВедомыйСчет()
	// --- 
	
	Если (НЕ Объект.ВедомыйСчет.ПометкаУдаления) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ведомый = Объект.ВедомыйСчет.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);	
	КонецЕсли; 
	// --- 
	Объект.ВедомыйСчет = Неопределено;
	
	// --- 
КонецФункции

&НаСервере
Функция _УдалитьВедомый()
	// --- 
	
	Если (НЕ Объект.ВедомыйДокумент.ПометкаУдаления) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ведомый = Объект.ВедомыйДокумент.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);	
	КонецЕсли;
	// --- 
	Объект.ВедомыйДокумент = Неопределено;
	Объект.ВедомыйСчетФактура = Неопределено;
	
	// --- 
КонецФункции

&НаСервере
Функция _УдалитьВедомыйСчетФактуру()
	// --- 
	
	Если (НЕ Объект.ВедомыйСчетФактура.ПометкаУдаления) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Ведомый = Объект.ВедомыйСчетФактура.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);	
	КонецЕсли;
	// --- 
	Объект.ВедомыйСчетФактура = Неопределено;
	
	// --- 
КонецФункции

#КонецОбласти 

#Область ОтображениеШапки 

&НаКлиенте
Процедура ОтображениеШапки(Команда)
	
	_ОтображениеШапки(); 
	
КонецПроцедуры

&НаСервере
Процедура _ОтображениеШапки()
	// --- 
	
	Элементы.ГруппаШапка.Видимость = (НЕ Элементы.ГруппаШапка.Видимость);
	Элементы.ОтображениеШапкиУслуги.Заголовок = ?(Элементы.ГруппаШапка.Видимость," Развернуть"," Свернуть");
	Элементы.ОтображениеШапкиУслугиКорректировка.Заголовок = ?(Элементы.ГруппаШапка.Видимость," Развернуть"," Свернуть");
	Элементы.ОтображениеШапкиУслуги.Картинка = ?(Элементы.ГруппаШапка.Видимость,БиблиотекаКартинок.CW_Развернуть,БиблиотекаКартинок.CW_Свернуть);
	Элементы.ОтображениеШапкиУслугиКорректировка.Картинка = ?(Элементы.ГруппаШапка.Видимость,БиблиотекаКартинок.CW_Развернуть,БиблиотекаКартинок.CW_Свернуть);
	
	// --- 
КонецПроцедуры

#КонецОбласти 

#Область ПроверкаПоБюджету 

&НаКлиенте
Процедура ПроверитьДокументПоБюджету(Команда)
	
	Если (ЭтаФорма.Модифицированность) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаЗаписиДляПроверкиПоБюджету",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Документ был изменён. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьПроверкуПоБюджету();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаЗаписиДляПроверкиПоБюджету(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ=КодВозвратаДиалога.Да) Тогда
		
		Записать();
		ВыполнитьПроверкуПоБюджету();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ВыполнитьПроверкуПоБюджету()
	// --- 
	
	ОткрытьФорму("Отчет.CW_ПроверкаДокументаПоступленияПоБюджету.Форма.ФормаОтчета",_сф.ст_Создать("Документ:Ссылка",Объект.Ссылка));
	
	// --- 
КонецПроцедуры


#КонецОбласти 

#Область ОчисткаТабличнойЧасти

&НаКлиенте
Процедура ОчиститьТабличнуюЧастьУслуг(Команда)
	
	Если Объект.Услуги.Количество() <> 0 Тогда 
		
		массВидимыхСтрок = Новый Массив;
		массСкрытыхСтрок = Новый Массив;
		Для Каждого строкаУслуги Из Объект.Услуги Цикл
			Если Элементы.Услуги.ПроверитьСтроку(строкаУслуги.ПолучитьИдентификатор()) Тогда 
				массВидимыхСтрок.Добавить(строкаУслуги);
			Иначе 
				массСкрытыхСтрок.Добавить(строкаУслуги);
			КонецЕсли;
		КонецЦикла;
		
		Если массВидимыхСтрок.Количество() = Объект.Услуги.Количество() Тогда 
			
			// нет отбора
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиУслугДляОчистки",ЭтотОбъект); 
			ПоказатьВопрос(ПОВ,"Очистить табличную часть Услуги?", РежимДиалогаВопрос.ОКОтмена);
			
		Иначе 
			
			// установлен какой-то отбор
			сз = Новый СписокЗначений;
			сз.Добавить("Все", "Очистить - все строки ("+Объект.Услуги.Количество()+")");
			сз.Добавить("Видимые", "С учетом отбора - видимые ("+массВидимыхСтрок.Количество()+")");
			сз.Добавить("Скрытые", "С учетом отбора - скрытые ("+массСкрытыхСтрок.Количество()+")");
			ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВариантаОчистки",ЭтотОбъект, Новый Структура("массВидимыхСтрок,массСкрытыхСтрок",массВидимыхСтрок,массСкрытыхСтрок)); 
			СЗ.ПоказатьВыборЭлемента(ПОВ,"РежимОчистки");
			
		КонецЕсли;
		
	Иначе 
		
		_УФК.ВывестиПредупреждение("Табличная часть ""Услуги"" уже пустая.");
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОчисткиУслугДляОчистки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.ОК) Тогда
		
		Объект.Услуги.Очистить();
		ОбновитьИтогиПоУслугам();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ОбработкаВыбораВариантаОчистки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда 
		
		Если Ответ.Значение = "Все" Тогда 
			
			Объект.Услуги.Очистить();
			ОбновитьИтогиПоУслугам();
			
		ИначеЕсли Ответ.Значение = "Видимые" Тогда 
			
			Для Каждого строкаУслуги Из ДополнительныеПараметры.массВидимыхСтрок Цикл
				Объект.Услуги.Удалить(строкаУслуги);
			КонецЦикла;
			ОбновитьИтогиПоУслугам();
			_УФК.ВывестиПредупреждение("Отключите отбор, чтобы увидеть, что осталось.");
			
		ИначеЕсли Ответ.Значение = "Скрытые" Тогда 
			
			Для Каждого строкаУслуги Из ДополнительныеПараметры.массСкрытыхСтрок Цикл
				Объект.Услуги.Удалить(строкаУслуги);
			КонецЦикла;
			ОбновитьИтогиПоУслугам();
			_УФК.ВывестиПредупреждение("Невидимые строки удалены.");
			
		КонецЕсли;
		
	КонецЕсли;
			
	// --- 
КонецПроцедуры
  

#КонецОбласти 

#Область УстановкаСальдоВзаиморасчетов 

&НаКлиенте
Процедура УстановитьСальдоВзаиморасчетовБУ(Команда)
	Объект.СальдоВзаиморасчетовБУ = Объект.Услуги.Итог("Всего");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСальдоВзаиморасчетовОУ(Команда)
	Объект.СальдоВзаиморасчетовОЗ = Объект.Услуги.Итог("Всего");
КонецПроцедуры

#КонецОбласти 

#Область АвтоматическийПодборСчетов 

&НаКлиенте
Процедура АвтоматическийПодборСчетов()
	// --- 
	
	Если (Объект.Проведен) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОтменыПроведения",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Автоматический подбор счетов возможен только для непроведённого документа. Отменить проведение?",РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьАвтоматическийПодборСчетов();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОтменыПроведения(ОтветПользователя, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПользователя = КодВозвратаДиалога.Да) Тогда
		
		Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.ОтменаПроведения));
		ВыполнитьАвтоматическийПодборСчетов();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
&НаКлиенте
Процедура ВыполнитьАвтоматическийПодборСчетов()
	// --- 
	
	// показываем форму выбора даты подбора
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораВариантаПодбора",ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДатыПодбораСчетов",,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВариантаПодбора(ВариантВыбораДатыПодбора, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВариантВыбораДатыПодбора <> Неопределено) Тогда
		
		Результат = _ВыполнитьПодборСчетов(ВариантВыбораДатыПодбора);
		Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
			
			_ОбновитьНомераДокументов();
			_УправлениеЭлементамиФормы();
			_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Результат));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ВыполнитьПодборСчетов(ВариантПодбора)
	// --- 
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Ответ = ДокументОбъект.ВыполнитьАвтоматическийПодборСчетов(ВариантПодбора);
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	// --- 
	Возврат(Ответ);
	
	// --- 
КонецФункции
 
#КонецОбласти 

#Область ЗаполнениеПоДокументу

&НаКлиенте
Процедура ЗаполнитьПоДокументуПоставщика(Команда)
	
	ПФ = Новый Структура("Отбор,РежимВыбора", Новый Структура("Договор",Объект.Договор), Истина);
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДокументаДляЗаполнения",ЭтотОбъект); 
	ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаВыбора",ПФ,ЭтаФорма,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДокументаДляЗаполнения(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		_ДобавитьСтрокиДокумента(Ответ);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ДобавитьСтрокиДокумента(Документ)
	// --- 
	
	ЗаполнятьАктируемыйСчет = ((Документ.ПредъявленСчет И НЕ Документ.ПредъявленАкт) И (Объект.ПредъявленАкт И НЕ Объект.ПредъявленСчет));
	Если (ЗаполнятьАктируемыйСчет) Тогда
		Если (НЕ Объект.СписокСчетов) Тогда
			Объект.СписокСчетов = Истина;
			Если (ЗначениеЗаполнено(Объект.Счет)) Тогда
				Для каждого Стр Из Объект.Услуги Цикл
					Стр.Счет = Объект.Счет;		
				КонецЦикла; 	
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	// --- 
	Для каждого Стр Из Документ.Услуги Цикл
		
		строкаУслуги = Объект.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(строкаУслуги, Стр);
		Если (ЗаполнятьАктируемыйСчет) Тогда
			строкаУслуги.Счет = Документ;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(строкаУслуги.Подразделение) Тогда 
			строкаУслуги.Подразделение = ПодразделениеПользователя;
		КонецЕсли;
		
	КонецЦикла; 
	// --- 
	_ОбновитьСтатусПометокУдаления();
	_ОбновитьНомераДокументов();
	_УправлениеЭлементамиФормы();
	
	#Область Динамический_вывод_дополнительных_колонок
	
	_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	
	#КонецОбласти
	
	// --- 
КонецПроцедуры
 
#КонецОбласти 

#Область МножественноеРедактирование

&НаКлиенте
Процедура УслугиПередНачаломИзменения(Элемент, Отказ)
	
	Если (НЕ ЭтаФорма.ТолькоПросмотр) Тогда
		
		Если (Элементы.Услуги.ВыделенныеСтроки.Количество() > 1) Тогда
			
			Если (Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиСпособУчетаНДС ИЛИ
				Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиПодразделение) Тогда
				
				Отказ = Истина;
				// --- 
				МножественноеРедактирование();
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура МножественноеРедактирование()
	// --- 
	
	Если (Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиСпособУчетаНДС) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораМножественногоЗначения",ЭтотОбъект, Новый Структура("Реквизит","СпособУчетаНДС")); 
		ОткрытьФорму("Перечисление.СпособыУчетаНДС.ФормаВыбора",,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли (Элементы.Услуги.ТекущийЭлемент = Элементы.УслугиПодразделение) Тогда 
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораМножественногоЗначения",ЭтотОбъект, Новый Структура("Реквизит","Подразделение")); 
		ОткрытьФорму("Справочник.ПодразделенияОрганизаций.ФормаВыбора",,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораМножественногоЗначения(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		_ПроизвестиМножественноеРедактирование(Ответ, ДополнительныеПараметры.Реквизит);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПроизвестиМножественноеРедактирование(Значение, Реквизит)
	// --- 
	
	Для каждого Стр Из Элементы.Услуги.ВыделенныеСтроки Цикл
		
		СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(Стр);
		// --- 
		Если (Реквизит = "Подразделение") Тогда
			
			Если (СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
				СтрокаТЧ[Реквизит] = Значение;		
			КонецЕсли; 
			
		ИначеЕсли (Реквизит = "СпособУчетаНДС") Тогда 
			
			Если (СтрокаТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
				СтрокаТЧ[Реквизит] = Значение;		
			КонецЕсли;  
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецФункции

#КонецОбласти 

#Область Корректировки

&НаСервере
Процедура _ОбновитьНадписиКорректировок()
	// --- 
	
	Для каждого Стр Из Объект.Услуги Цикл
		
		Стр.НадписьДоКорректировки = "до изменения";
		Стр.НадписьПослеКорректировки = "после изменения";
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

#КонецОбласти 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КурсВалютыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораКурса",ЭтотОбъект, Новый Структура()); 
	ПФ = Новый Структура("ПользовательскийКурс,Курс,Кратность,ДатаКурса,Валюта,РасчетыВУЕ",Объект.УЕ_ПользовательскийКурс,Объект.УЕ_Курс,Объект.УЕ_Кратность,_ДатаКурса(),Объект.Валюта,ВзаиморасчетыВУЕ);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаКурсаДляУсловныхЕдиниц",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКурса(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Объект.УЕ_ПользовательскийКурс = Ответ.ПользовательскийКурс;
		Если (Объект.УЕ_ПользовательскийКурс) Тогда
			Объект.УЕ_Курс = Ответ.Курс;
			Объект.УЕ_Кратность = Ответ.Кратность;
		Иначе
			Объект.УЕ_Курс = 1;
			Объект.УЕ_Кратность = 1;
		КонецЕсли;
		// --- 
		_СформироватьКурс();
				
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

#Область Корректировки

&НаКлиенте
Процедура УслугиКорректировкаКоличествоПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.УслугиКорректировка.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаЦенаПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.УслугиКорректировка.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаСуммаПриИзменении(Элемент)
	
	_УслугиСуммаПриИзменении(Элементы.УслугиКорректировка.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСтрокуНаСерере(Элементы.УслугиКорректировка.ТекущиеДанные.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаНДСПриИзменении(Элемент)
	
	ТД = Элементы.УслугиКорректировка.ТекущиеДанные;
	
	Если НЕ _ДС().НП.ОбратныйПересчетВДокументах Тогда
		ТД.Всего = ТД.Сумма + ТД.НДС;
	Иначе
		ТД.Сумма = ТД.Всего - ТД.НДС;
		ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	КонецЕсли;
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаВсегоПриИзменении(Элемент)
	
	ТД = Элементы.УслугиКорректировка.ТекущиеДанные;
	
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(ТД.СтавкаНДС)/100;
	ТД.НДС = ТД.Всего*Ставка/(1+Ставка);
	ТД.Сумма = ТД.Всего - ТД.НДС;
	ТД.Цена = _сф.БезопасноРазделить(ТД.Сумма,ТД.Количество);
	
	ПересчитатьСтрокуНаСерере(ТД.ПолучитьИдентификатор(),Объект.ЦенаСНДС, Истина);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПерезаполнитьПоКорректируемомуДокументу(Команда)
	
	_ПерезаполнитьПоКорректируемомуДокументу();
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры

&НаСервере
Процедура _ПерезаполнитьПоКорректируемомуДокументу()
	// --- 
	
	ЗаполнитьЗначенияСвойств(Объект,Объект.КорректируемыйДокумент,"Организация,Контрагент,Договор,Валюта,Продавец");
	// ---
	Объект.Услуги.Загрузить(Объект.КорректируемыйДокумент.Услуги.Выгрузить());
	Для каждого Стр Из Объект.Услуги Цикл
		
		Стр.Представление_ДоКорректировки = Стр.Представление;
		Стр.Количество_ДоКорректировки = Стр.Количество;
		Стр.Цена_ДоКорректировки = Стр.Цена;
		Стр.Сумма_ДоКорректировки = Стр.Сумма;
		Стр.СтавкаНДС_ДоКорректировки = Стр.СтавкаНДС;
		Стр.НДС_ДоКорректировки = Стр.НДС;
		Стр.Всего_ДоКорректировки = Стр.Всего;
		
	КонецЦикла; 
	Модифицированность=Истина;
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	_УслугиПредставлениеНачалоВыбора(Элементы.УслугиКорректировка.ТекущаяСтрока);
	Элементы.УслугиКорректировка.ТекущийЭлемент = Элементы.УслугиКорректировкаПорядокОтражения;
	Элементы.УслугиКорректировка.ТекущийЭлемент = Элементы.УслугиКорректировкаПредставление;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.УслугиКорректировкаГрузоперевозкаЗаказ Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		Попытка
			ПоказатьЗначение(,_Заказ(Элементы.УслугиКорректировка.ТекущиеДанные.Грузоперевозка));
		Исключение
			//ОписаниеОшибки()
		КонецПопытки; 
		
	ИначеЕсли (Поле = Элементы.УслугиКорректировкаГрузоперевозка) Тогда 
		
		СтандартнаяОбработка = Ложь;
		// --- 
		Попытка
			ПоказатьЗначение(,Элементы.УслугиКорректировка.ТекущиеДанные.Грузоперевозка);
		Исключение
			//ОписаниеОшибки()
		КонецПопытки; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКорректировкаПриИзменении(Элемент)
	
	ОбновитьИтогиПоУслугам();
	
КонецПроцедуры


#КонецОбласти
  

#Область ОграничениеУслугПоДоговору

&НаКлиенте
Процедура УслугиНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЕстьОграниченияПоСпискуУслуг Тогда
//		СтандартнаяОбработка	= Ложь;
		ДанныеВыбора			= Новый СписокЗначений;
		
		Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда 
			ДанныеВыбора.ЗагрузитьЗначения(_УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору));
		Иначе
			ДанныеВыбора.Добавить(Неопределено);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Обновить_Количесто_Из_параметра

&НаКлиенте
Процедура Команда_ОбновитьКоличество(Команда)
	
	ОбновитьКоличествоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоНаСервере()
	
	_УФС.ОбработатьтаблицуУслугНаСервере(Объект.Услуги, УстановитьЗначениеНольЗначениеПараметраНеУстановлено);
	
	Модифицированность = истина;
	
КонецПроцедуры

#КонецОбласти 

#Область Настройка_динамических_колонок

&НаКлиенте
Процедура НастройкаКолонок(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаЗначений"	, ПолучитьДанныеДляПередачи());
	ПараметрыФормы.Вставить("СписокСПометками"		, Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы"		, "Дополнительные колонки");
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораСпискаПараметров", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораИзСписка",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&наСервере
Функция ПолучитьДанныеДляПередачи()
	
	Возврат ПоместитьВоВременноеХранилище(СписокДополнительныхКолонок);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораСпискаПараметров(Результат, ДопПараметры) Экспорт
 
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ОбработатьРезультатВыбораКолонок(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыбораКолонок(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		СписокКолонок = ПолучитьИзВременногоХранилища(Результат);
		
		СписокДополнительныхКолонок.Очистить();
		СписокВыбранныеКолонки.Очистить();
		
		Для Каждого ЭлементСписка из СписокКолонок Цикл
			СписокДополнительныхКолонок.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, ЭлементСписка.Пометка);
			Если ЭлементСписка.Пометка Тогда
				СписокВыбранныеКолонки.Добавить(ЭлементСписка.Значение);	
			КонецЕсли;
		КонецЦикла;
		
		_УФС.ДополнитьДинамическиеКолонки(ЭтаФорма);
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
		
	КонецЕсли;
	
	УстановитьВидимостьКнопкиОбновленияЗначений();
                                 
КонецПроцедуры

&наСервере
Функция ПолучитьСтруктуруПараметровДляПередачи()
	
	СоответствиеПараметров = Неопределено;
	Если СписокДоступныхПараметров.Количество() > 0 Тогда
		СоответствиеПараметров = СписокДоступныхПараметров[0].Значение ;
	КонецЕсли;

	СтуктураПараметров = Новый Структура;
	СтуктураПараметров.Вставить("Объект"				, Объект);
	СтуктураПараметров.Вставить("ТаблицаДокумента"		, Объект.Услуги);
	СтуктураПараметров.Вставить("ВыбранныеКолонки"		, СписокВыбранныеКолонки.ВыгрузитьЗначения());
	СтуктураПараметров.Вставить("СоответствиеПараметров", СоответствиеПараметров);
	СтуктураПараметров.Вставить("мГрузоперевозки"		, Объект.Услуги.Выгрузить().ВыгрузитьКолонку("Грузоперевозка"));
	
	Возврат СтуктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура НастройкаКолонок_ОбновитьЗначения(Команда)
	
	ОбновлитьЗначенияПараметровнаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновлитьЗначенияПараметровнаСервере()
	
	_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьКнопкиОбновленияЗначений()
	
	Элементы.УслугиНастройкаКолонок_ОбновитьЗначения.Видимость = СписокВыбранныеКолонки.Количество() > 0;
	
КонецПроцедуры

#КонецОбласти

#Область Изменение_Состава_цены

&НаКлиенте
Процедура ЦенаСНДС(Команда)
	
	Если Объект.Услуги.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбИзмененииСоставаЦены", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Данные табличной части будут пересчитаны. Продолжить?" , Режим, 0);
		
	Иначе
		
		Объект.ЦенаСНДС = не Объект.ЦенаСНДС;
		ОбработатьИзменениеСоставаЦены();
		ПересчитатьДанныеСтрокНаСервере(Истина);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбИзмененииСоставаЦены(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	Объект.ЦенаСНДС = не Объект.ЦенаСНДС;
	ОбработатьИзменениеСоставаЦены();

	ПересчитатьДанныеСтрокНаСервере(Истина);

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСоставаЦены()
	
	ТекстЗаголовкаЦены 	= "Цена";
	ШрифтЗаголовка 		= Новый Шрифт();
	ЦенаСНДС 			= Объект.ЦенаСНДС;
	
	Если ЦенаСНДС Тогда
		ТекстЗаголовкаЦены 	= ТекстЗаголовкаЦены + " (с НДС)";
		ШрифтЗаголовка 		= Новый Шрифт(, , Истина);
	КонецЕсли;
	
	Элементы.УслугиЦена.Заголовок 		=  ТекстЗаголовкаЦены;
	Элементы.УслугиЦена.ШрифтЗаголовка 	=  ШрифтЗаголовка;
	
	Элементы.УслугиКорректировкаГруппаЦена.Заголовок 	  =  ТекстЗаголовкаЦены;
	Элементы.УслугиКорректировкаГруппаЦена.ШрифтЗаголовка =  ШрифтЗаголовка;
	
	//Элементы.УслугиЦенаСНДС.Пометка 				= ЦенаСНДС;
//	Элементы.УслугиКорректировкаЦенаСНДС.Пометка 	= ЦенаСНДС;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДанныеСтрокНаСервере(ТолькоЦена)
	
	ЦенаСНДС = Объект.ЦенаСНДС;
	
	Для Каждого СтрокаУслуги из Объект.Услуги Цикл
		ПересчитатьСтрокуНаСерере(СтрокаУслуги.ПолучитьИдентификатор(), ЦенаСНДС, ТолькоЦена);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокуНаСерере(ИдентификаторСтроки, ЦенаСНДС, ТолькоЦена=Ложь, ПризнакКорр="", Повторить = Истина)
	
	Если Объект.Корректировка и Повторить Тогда
		ПересчитатьСтрокуНаСерере(ИдентификаторСтроки, ЦенаСНДС, ТолькоЦена,"_ДоКорректировки", Ложь);
	КонецЕсли;

	ТекущаяСтрока = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекСтавкаНДС  = CW_Финансы.ПолучитьСтавкуНДС(ТекущаяСтрока["СтавкаНДС"+ПризнакКорр]);
	
	Если ТолькоЦена Тогда
		Если ЦенаСНДС Тогда
			ТекущаяСтрока["Цена"+ПризнакКорр] = _сф.БезопасноРазделить(ТекущаяСтрока["Всего"+ПризнакКорр],ТекущаяСтрока["Количество"+ПризнакКорр]);	
		Иначе
			ТекущаяСтрока["Цена"+ПризнакКорр] = _сф.БезопасноРазделить(ТекущаяСтрока["Сумма"+ПризнакКорр],ТекущаяСтрока["Количество"+ПризнакКорр]);	
		КонецЕсли;
	Иначе
		
		Если ЦенаСНДС Тогда
			РасчетнаяСтавкаНДС 	= (ТекСтавкаНДС +?(ЦенаСНДС,100,0))/100;
			ЦенаБезНДС 			= ТекущаяСтрока["Цена"+ПризнакКорр] / РасчетнаяСтавкаНДС;
		Иначе
			ЦенаБезНДС = ТекущаяСтрока["Цена"+ПризнакКорр];
		КонецЕсли;
		
		ТекущаяСтрока["Сумма"+ПризнакКорр] 	= ЦенаБезНДС 								* ТекущаяСтрока["Количество"+ПризнакКорр];
		ТекущаяСтрока["НДС"+ПризнакКорр] 	= Окр(ТекущаяСтрока["Сумма"+ПризнакКорр] 	* ТекСтавкаНДС/100,2,1);
		ТекущаяСтрока["Всего"+ПризнакКорр] 	= ТекущаяСтрока["Сумма"+ПризнакКорр] 		+ ТекущаяСтрока["НДС"+ПризнакКорр];
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область МСФО

&НаКлиенте
Процедура УслугиСчетЗатратПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	Для Сч = 1 По 3 Цикл
		ТекущиеДанные["Субконто"+ Сч] = Неопределено;
	КонецЦикла;
	
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоСтрокиПриИзмененииСчета(
		ЭтотОбъект, ТекущиеДанные, ПараметрыУстановкиСвойствСубконто(ЭтотОбъект));
	
	ПараметрыОбъекта = Неопределено;
	ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(ЭтаФорма, ПараметрыОбъекта);
	
	ЗаполнитьДобавленныеКолонкиСтрокиТаблицыУслуги(ТекущиеДанные, ПараметрыОбъекта);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(Знач Форма, ПараметрыОбъекта)

	Объект = Форма.Объект;
	
	Если ТипЗнч(ПараметрыОбъекта) <> Тип("Структура") Тогда
		ПараметрыОбъекта = Новый Структура;
	КонецЕсли;
	
	ПараметрыОбъекта.Вставить("СуммаВключаетНДС", Ложь);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДобавленныеКолонкиСтрокиТаблицыУслуги(СтрокаТаблицы, Знач ПараметрыОбъекта)
	
	УчетПоПодразделениям = Неопределено;
	Если СтрокаТаблицы.Свойство("СчетЗатрат") Тогда
		
		СвойстваСчетаБУ = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетЗатрат);
		
		УчетПоПодразделениям = СвойстваСчетаБУ.УчетПоПодразделениям;
		
	КонецЕсли;
	
	Если УчетПоПодразделениям <> Неопределено Тогда
		СтрокаТаблицы.ПодразделениеЗатратДоступность = УчетПоПодразделениям;
	КонецЕсли;
	
КонецПроцедуры



&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыУстановкиСвойствСубконто(Форма)

	Результат = CW_БухгалтерскийУчетКлиентСерверМСФО.ПараметрыУстановкиСвойствСубконтоПоШаблону(
		"УслугиСубконто", "УслугиПодразделение", "Субконто", "ПодразделениеЗатрат", "СчетЗатрат");
		
	Результат.ПоляОбъекта.Вставить("ПодразделениеДоступность", "ПодразделениеЗатратДоступность");
	
	Результат.ЗначенияПоУмолчанию.Вставить(
		ПредопределенноеЗначение("ПланВидовХарактеристик.CW_ВидыСубконтоМСФО.СтатьиЗатрат"),
		ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.СтатьиЗатрат.ПрочиеЗатраты"));
	Результат.ЗначенияПоУмолчанию.Вставить(
		ПредопределенноеЗначение("ПланВидовХарактеристик.CW_ВидыСубконтоМСФО.ПрочиеДоходыИРасходы"),
		ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ПрочиеВнереализационныеДоходыРасходы"));
	
	Результат.ДопРеквизиты.Вставить("Организация", Форма.Объект.Организация);
	Результат.СкрыватьСубконто = Ложь;
	
	Возврат Результат;

КонецФункции




#КонецОбласти


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры


#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()

	// Субконто БУ и НУ
	// Первое субконто не скрываем, чтобы не мигала колонка в разных строках.
	
	Для Сч = 1 По 3 Цикл
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиСубконто" + Сч);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Услуги.Субконто" + Сч + "Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
	КонецЦикла;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиПодразделениеЗатрат");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Услуги.ПодразделениеЗатратДоступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Субконто БУ
	// Первое субконто не скрываем, чтобы не мигала колонка в разных строках.
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиСубконто1");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Услуги.Субконто1Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Услуги.Субконто2Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Услуги.Субконто3Доступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не требуется>'"));
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	
	//УчитыватьНДС
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиСчетНДС");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Услуги.УчитыватьНДС", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиУчитыватьНДС");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Услуги.УчитыватьНДС", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не учитывается'"));

	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УслугиУчитыватьНДС");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Услуги.УчитыватьНДС", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Учитывается'"));
	
КонецПроцедуры


&НаСервере
Процедура УслугиУчитыватьНДСПриИзмененииНаСервере(Идентификатор)
	
	СтрокаУслуг = Объект.Услуги.НайтиПоИдентификатору(Идентификатор);
	
	Если Не СтрокаУслуг.УчитыватьНДС Тогда
		СтрокаУслуг.СчетНДС = Неопределено;
	Иначе
		//Заполняем счета МСФО
		Если НастройкиМСФО.Количество() > 0 Тогда
			
			ЭлементСписка 		= НастройкиМСФО.Получить(0);
			СтруктураНастроек 	= ЭлементСписка.Значение;
			
			Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
				Если Не ЗначениеЗаполнено(СтрокаУслуг.СчетНДС) и СтруктураНастроек.Свойство("СчетУчетаНДС") Тогда
					СтрокаУслуг.СчетНДС = СтруктураНастроек.СчетУчетаНДС;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУчитыватьНДСПриИзменении(Элемент)
	УслугиУчитыватьНДСПриИзмененииНаСервере(Элементы.Услуги.ТекущаяСтрока);
КонецПроцедуры


//Подсистема.СтатусыДокументов
&НаКлиенте
Процедура СтатусДокументаИзменить(Команда)
	
	CW_СтатусыДокументовКлиент.ОткрытьФормуРедактированияСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеДанныхСтатуса(Результат, ДополнительныеПараметры) Экспорт
	
	CW_СтатусыДокументовКлиент.ОбработатьИзменениеДанныхСтатуса(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаИстория(Команда)
	
	CW_СтатусыДокументовКлиент.ПоказатьИсториюСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.ОткрытьСтатусДокумента(ЭтаФорма,Элемент, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	CW_СтатусыДокументовКлиент.СтатусДокументаАвтоПодбор(ЭтаФорма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	CW_СтатусыДокументовКлиент.ПриИзмененииСтатусаДокумента(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОповещениеИзменениеСтатусДокументаНаСервере()
	
	CW_СтатусыДокументовСервер.ПолучитьТекущийСтатусДокумента(Объект, ЭтаФорма);

КонецПроцедуры
//Подсистема.СтатусыДокументов


//Подсистема.УчетПриложенийДоговоров
&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	_ОбработатьИзменениеДоговора();
КонецПроцедуры
//Подсистема.УчетПриложенийДоговоров

//Первичные документы

&НаКлиенте
Процедура ПредъявленСчетПриИзменении(Элемент)
	
	ПредъявленСчетПриИзмененииНаКлиенте();
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредъявленСчетПриИзмененииНаКлиенте()
	
	Если Объект.ПредъявленСчет Тогда
		Если Объект.ДатаСчета = Дата(1,1,1) Тогда
			Объект.ДатаСчета = Объект.Дата;
			УстановитьСрокОплатыНаСервере();
		КонецЕсли;
	Иначе
		Объект.ДатаСчета  = Дата(1,1,1);
		Объект.НомерСчета = "";
		
		Объект.СпособЗачетаАвансовОЗ = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать");
	КонецЕсли; 
	
	_ОбновитьНомераДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	
	НомерСчетаПриИзмененииНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаОчистка(Элемент, СтандартнаяОбработка)
	
	НомерСчетаПриИзмененииНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзмененииНаКлиенте()
	
	Если ЗначениеЗаполнено(Объект.НомерСчета) Тогда
		Если Не ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
			Объект.ДатаСчета = Объект.ДатаСчета;
			УстановитьСрокОплатыНаСервере();
		КонецЕсли;
	Иначе
		Объект.ДатаСчета = Дата(1,1,1);
	КонецЕсли;
	
	_ОбновитьНомераДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСчетаПриИзменении(Элемент)
	
	ДатаСчетаПриИзмененииНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ДатаСчетаОчистка(Элемент, СтандартнаяОбработка)
	
	ДатаСчетаПриИзмененииНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ДатаСчетаПриИзмененииНаКлиенте()
	
	Если ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
		УстановитьСрокОплатыНаСервере();		
	КонецЕсли;
	_ОбновитьНомераДокументов();
	
	ПервичныеДокументыУправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыВремяСчета(Команда)
	
	ДополнительныеПараметры = Новый Структура("НачальнаяДата", Объект.ДатаСчета);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияДатыСчета",ЭтотОбъект, ДополнительныеПараметры); 
	ПоказатьВводДаты(ОписаниеОповещения,Объект.ДатаСчета,"Время счёта",ЧастиДаты.Время);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияДатыСчета(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// переносим введённое время в дату акта
	ДатаСчетаСтрокой 	= Формат(ДополнительныеПараметры.НачальнаяДата,"ДФ=yyyyMMdd");
	ВремяСчетаСтрокой 	= Формат(РезультатВыбора,"ДФ=HHmmss");
	
	Объект.ДатаСчета = Дата(ДатаСчетаСтрокой+ВремяСчетаСтрокой);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыДатаСчета(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Документ не записан!");
		Возврат;
	КонецЕсли;
	
	Объект.ДатаСчета = Объект.Дата;
	
	УстановитьСрокОплатыНаСервере();
	
	_ОбновитьНомераДокументов();

КонецПроцедуры

&НаСервере
Процедура УстановитьСрокОплатыНаСервере()

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ссылка"		, Объект.Ссылка);
	СтруктураПараметров.Вставить("Договор"		, Объект.Договор);
	СтруктураПараметров.Вставить("Дата"			, Объект.Дата);
	СтруктураПараметров.Вставить("ДатаСчета"	, Объект.ДатаСчета);
	СтруктураПараметров.Вставить("ЕстьСчет"		, Объект.ПредъявленСчет);
	СтруктураПараметров.Вставить("ЕстьАкт"		, Ложь);
	
	//Подсистема.УчетПриложенийДоговоров
	Если ЗначениеЗаполнено(Объект.ПриложениеКДоговору) Тогда
		СтруктураПараметров.Вставить("Договор"		, Объект.ПриложениеКДоговору);
	КонецЕсли;
	//Подсистема.УчетПриложенийДоговоров
	
	ДатаОплаты = CW_Документы.РассчитатьСрокОплаты(СтруктураПараметров);
	
	ПараметрыСрокаОплаты = Новый Структура;
	ПараметрыСрокаОплаты.Вставить("Счет", 		Объект.Ссылка);
	ПараметрыСрокаОплаты.Вставить("ДатаОплаты", ДатаОплаты);
	ПараметрыСрокаОплаты.Вставить("Описание", 	"");
	
	CW_Документы.УстановитьСрокОплаты(ПараметрыСрокаОплаты);
	
	УстановитьОписаниеСрокаОплаты();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОписаниеСрокаОплаты()
	
	Текст = "<не установлен>";
	
	Если ЗначениеЗаполнено(_СрокОплаты) Тогда
		Текст = Формат(_СрокОплаты,"ДФ=dd.MM.yyyy");
		Если СокрЛП(_СрокОплатыОписание) <> "" Тогда
			Текст = Текст + " ("+СокрЛП(_СрокОплатыОписание)+")";
		КонецЕсли; 
	Иначе
		Если Не _СрокОплатыРучноеРедактирование Тогда
			Текст = "<авто>";
		КонецЕсли; 
	КонецЕсли;	
	
	СрокОплаты = Текст;
			
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансовОЗПриИзменении(Элемент)
	
	СпособЗачетаАвансовОЗПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СпособЗачетаАвансовОЗПриИзмененииНаСервере()
	
	// очистили значение
	Если Не ЗначениеЗаполнено(Объект.СпособЗачетаАвансовОЗ) Тогда
		Объект.СпособЗачетаАвансовОЗ = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать"); 
	КонецЕсли; 
	
	// если не по документу, то очищаем таблицу зачета авансов
	Если Объект.СпособЗачетаАвансовОЗ <> ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.ПоДокументу") Тогда
		Объект.ЗачетАвансовОЗ.Очистить();
	КонецЕсли; 
	
	// регенерация формы
	_УправлениеЭлементамиФормы();	
	
	// регенерируем форму
	ПервичныеДокументыУправлениеЭлементамиФормы();

КонецПроцедуры


&НаКлиенте
Процедура СрокОплатыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыСрокаОплаты = Новый Структура;
	ПараметрыФормыСрокаОплаты.Вставить("Документ", 				Объект.Ссылка); 
	
	ПараметрыФормыСрокаОплаты.Вставить("ДатаОплаты",			_СрокОплаты);
	ПараметрыФормыСрокаОплаты.Вставить("Описание",				_СрокОплатыОписание);
	ПараметрыФормыСрокаОплаты.Вставить("РучноеРедактирование",	_СрокОплатыРучноеРедактирование);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзменениеСрокаОплаты",ЭтотОбъект); 

	ОткрытьФорму("ОбщаяФорма.CW_СрокОплаты", ПараметрыФормыСрокаОплаты,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСрокаОплаты(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыбора.Свойство("ДатаОплаты",   		 _СрокОплаты);
	РезультатВыбора.Свойство("Описание",  			 _СрокОплатыОписание);
	РезультатВыбора.Свойство("РучноеРедактирование", _СрокОплатыРучноеРедактирование);

	УстановитьОписаниеСрокаОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыСрокОплаты(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Документ не записан!");
		Возврат;
	КонецЕсли;
	
	УстановитьСрокОплатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПланОплатыНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "План оплаты можно установить только для записанного документа.");
	Иначе
		
		Представление = "Счёт №"+СокрЛП(Объект.НомерСчета)+" от "+Формат(Объект.ДатаСчета,"ДФ=dd.MM.yyyy")+" ("+Строка(Объект.Контрагент)+")";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияПланаОплаты",ЭтотОбъект); 
		
		ПараметрыФормыПланаОплаты = Новый Структура;
		ПараметрыФормыПланаОплаты.Вставить("Документ", Объект.Ссылка);
		ПараметрыФормыПланаОплаты.Вставить("ПредставлениеДокумента", Представление);
	
		ОткрытьФорму("ОбщаяФорма.CW_ПлановыйСрокОплаты",ПараметрыФормыПланаОплаты,ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПланаОплаты(Ответ, ДополнительныеПараметры) Экспорт
	
	УстановитьОписаниеПланОплаты();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОписаниеПланОплаты()
	
	Текст = "<не установлен>";

	ДанныеПланаОплаты = CW_Документы.ПолучитьПланОплаты(Объект.Ссылка);
	Если Не ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) и НЕ ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
		Текст = "<...>";
	ИначеЕсли ЗначениеЗаполнено(ДанныеПланаОплаты.Дата) Тогда
		Текст = Формат(ДанныеПланаОплаты.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДанныеПланаОплаты.Примечание) Тогда
		Текст = Текст + " ("+СокрЛП(ДанныеПланаОплаты.Примечание)+")";
	КонецЕсли; 
	
	ПланОплаты = Текст;

	_ОбновитьНомераДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ПервичныеДокументыПриСозданииНаСервере()
	
	РедактированиеФинансов_Расходы_Счета 	= CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Расходы_Счета");
	
	// план оплаты определяем всегда, но визуализируем только при предъявлении счета 
	// и ведения оперативной задолженности
	УстановитьОписаниеПланОплаты();;
	
	// добавлено CW (КС)..
	//--------------------
	УстановитьОписаниеСрокаОплаты();
	
		
	УстановитьПривилегированныйРежим(Истина);
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	УстановитьПривилегированныйРежим(Ложь);
	
	СрокОплатыДоступен = 	ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы 
							Или ГруппаПользователя.РедактированиеСроковОплатыИсходящихСчетов
							Или ГруппаПользователя.ПолныеПрава;
	ПланОплатыДоступен = 	ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы 
							Или ГруппаПользователя.РедактированиеФинансов_Доходы_Счета
							Или ГруппаПользователя.ПолныеПрава;
							
	// если формирование ведомых документов установлено датой ведущего документа,
	// то время акта не требуется и кнопку для определения времени можно скрыть
	Элементы.ПервичныеДокументыВремяСчета.Видимость = Объект.ФормироватьВедомыеДатойДокумента;
	
	Элементы.ГруппаСчет.Доступность 	= РедактированиеФинансов_Расходы_Счета;
	
	КонтрольДокументовПоСумме = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"КонтрольВходящихДокументовПоСумме");
	Если КонтрольДокументовПоСумме = Неопределено Тогда
		КонтрольДокументовПоСумме = Ложь;
	КонецЕсли; 
	Элементы.ГруппаКонтрольнаяСумма.Видимость = КонтрольДокументовПоСумме;
	
	Элементы.ГруппаКонтрольнаяСумма.Доступность =Объект.ПредъявленСчет и РедактированиеФинансов_Расходы_Счета;
	
	ПервичныеДокументыУправлениеЭлементамиФормы();

	
	
КонецПроцедуры

&НаСервере
Процедура ПервичныеДокументыУправлениеЭлементамиФормы()
	
	// счет
	Элементы.ПредъявленСчет.Доступность = РедактированиеФинансов_Расходы_Счета;
	Элементы.НомерСчета.ТолькоПросмотр 	= НЕ Объект.ПредъявленСчет ИЛИ НЕ РедактированиеФинансов_Расходы_Счета;
	Элементы.ДатаСчета.ТолькоПросмотр 	= НЕ Объект.ПредъявленСчет ИЛИ НЕ РедактированиеФинансов_Расходы_Счета;
	Элементы.ПервичныеДокументыДатаСчета.Доступность = Объект.ПредъявленСчет И РедактированиеФинансов_Расходы_Счета;
	Элементы.СрокОплаты.Доступность = Объект.ПредъявленСчет И СрокОплатыДоступен; 	
	Элементы.ПервичныеДокументыСрокОплаты.Доступность 	= Объект.ПредъявленСчет И СрокОплатыДоступен; 
	Элементы.СпособЗачетаАвансовОЗ.Видимость = Объект.ПредъявленСчет И ОперативныйУчет И НЕ Объект.Корректировка;
	
	// план оплаты
	Элементы.ПланОплаты.Видимость = Объект.ПредъявленСчет И ОперативныйУчет И ПланОплатыДоступен И НЕ Объект.Корректировка;
	
	// срок оплаты
	Элементы.СрокОплаты.Видимость = Объект.ПредъявленСчет И СрокОплатыДоступен И НЕ Объект.Корректировка; 
	Элементы.ПервичныеДокументыСрокОплаты.Видимость = Объект.ПредъявленСчет И СрокОплатыДоступен И НЕ Объект.Корректировка;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьВедомыеДатойДокументаПриИзменении(Элемент)
	
	// необходимо обновить параметры учётной политики и параметры договора
	_СформироватьОбщиеПараметры("ПараметрыДоговора,УчетнаяПолитика");

КонецПроцедуры

//Первичные документы