Процедура ЗаполнитьПризнкСтрокиПриложений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеестрыНДС0СоответствиеЗаполненияСтрок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_РеестрыНДС0СоответствиеЗаполненияСтрок КАК CW_РеестрыНДС0СоответствиеЗаполненияСтрок
	               |ГДЕ
	               |	CW_РеестрыНДС0СоответствиеЗаполненияСтрок.ЭтоГруппа = ЛОЖЬ"; 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.получитьОбъект();
		СпрОбъект.ПризнакСтроки = Перечисления.CW_РеестрыНДС0ПризнакСтрокиПриложения.ОсновнаяСтрока;
		СпрОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры  

Процедура УдалитьСоответствиеНалогооблагаемойБазыПоДОполнительнымСтрокамКНДФорма1155115() Экспорт
	
	ПустоеЗначениеЯчейки	= ПредопределенноеЗначение("Справочник.CW_РеестрыНДС0АлгоритмыЗаполненияЯчеекОтчета.ПустаяСсылка");
	ЯчейкиПриложений 		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений;  
	
	мПриложенияПриказа = Новый Массив;
	мПриложенияПриказа.Добавить(ЯчейкиПриложений.РеестрНДС2021Кв2_Приложение10);
	мПриложенияПриказа.Добавить(ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение09);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоответствиеСтрок.Ссылка КАК Ссылка,
	               |	СоответствиеСтрок.НомерСтроки КАК НомерСтроки,
	               |	СоответствиеСтрок.ЯчейкаОтчета КАК ЯчейкаОтчета
	               |ИЗ
	               |	Справочник.CW_РеестрыНДС0СоответствиеЗаполненияСтрок.НастройкиСтрок КАК СоответствиеСтрок
	               |ГДЕ
	               |	СоответствиеСтрок.ЯчейкаОтчета.ЯчейкаНалоговаяБаза = ИСТИНА
	               |	И СоответствиеСтрок.Ссылка.ПриложениеПриказа В(&мПриложенияПриказа)
	               |	И СоответствиеСтрок.Ссылка.ПризнакСтроки = ЗНАЧЕНИЕ(Перечисление.CW_РеестрыНДС0ПризнакСтрокиПриложения.ДополнительнаяСтрока)";
	
	Запрос.УстановитьПараметр("мПриложенияПриказа", мПриложенияПриказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СоответствиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НайденнаяСтрока = СоответствиеОбъект.НастройкиСтрок.Найти(Выборка.ЯчейкаОтчета, "ЯчейкаОтчета");
		Если НайденнаяСтрока <> Неопределено Тогда
			НайденнаяСтрока.ЗначениеЯчейки = ПустоеЗначениеЯчейки; 
		КонецЕсли;  
		
		СоответствиеОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСоответствиеЗаполненияСтрок(ПриказФНС, ВидТранспорта) Экспорт
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1  
	               |	CW_РеестрыНДС0СоответствиеЗаполненияСтрок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_РеестрыНДС0СоответствиеЗаполненияСтрок КАК CW_РеестрыНДС0СоответствиеЗаполненияСтрок
	               |ГДЕ
	               |	CW_РеестрыНДС0СоответствиеЗаполненияСтрок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_РеестрыНДС0СоответствиеЗаполненияСтрок.Основная = ИСТИНА
	               |	И CW_РеестрыНДС0СоответствиеЗаполненияСтрок.ПризнакСтроки = ЗНАЧЕНИЕ(Перечисление.CW_РеестрыНДС0ПризнакСтрокиПриложения.ОсновнаяСтрока)
	               |	И CW_РеестрыНДС0СоответствиеЗаполненияСтрок.Приказ = &ПриказФНС
	               |	И CW_РеестрыНДС0СоответствиеЗаполненияСтрок.Приложение = &ВидТранспорта";
	
	Запрос.УстановитьПараметр("ПриказФНС", 		ПриказФНС);
	Запрос.УстановитьПараметр("ВидТранспорта", 	ВидТранспорта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции


Процедура СкопироватьСоответствияПоПриказу() Экспорт
	
	Приказы = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений;
	
	ПриказИсточник = Приказы.РеестрНДС2024Кв2;
	ПриказПриемник = Приказы.РеестрНДС2025Кв2_ЕД715_1035;       
	
	СоответствиеФорм = Новый Соответствие;
	СоответствиеФорм.Вставить(Приказы.РеестрНДС2024Кв2_Приложение07, Приказы.РеестрНДС2025Кв2_Приложение07);
	СоответствиеФорм.Вставить(Приказы.РеестрНДС2024Кв2_Приложение08, Приказы.РеестрНДС2025Кв2_Приложение08);
	СоответствиеФорм.Вставить(Приказы.РеестрНДС2024Кв2_Приложение09, Приказы.РеестрНДС2025Кв2_Приложение09);
	
	мПриложенияПриказа = Новый Массив;
	мПриложенияПриказа.Добавить(Приказы.РеестрНДС2024Кв2_Приложение07);
	мПриложенияПриказа.Добавить(Приказы.РеестрНДС2024Кв2_Приложение08);
	мПриложенияПриказа.Добавить(Приказы.РеестрНДС2024Кв2_Приложение09);
	
	//Родитель
	НоваяГруппа = Справочники.CW_РеестрыНДС0СоответствиеЗаполненияСтрок.СоздатьГруппу();
	НоваяГруппа.Наименование = СокрЛП(ПриказПриемник);
	НоваяГруппа.Записать();
	
	Родитель = НоваяГруппа.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_РеестрыНДС0СоответствиеЗаполненияСтрок.Ссылка КАК Ссылка,
	|	CW_РеестрыНДС0СоответствиеЗаполненияСтрок.ПриложениеПриказа КАК ПриложениеПриказа
	|ИЗ
	|	Справочник.CW_РеестрыНДС0СоответствиеЗаполненияСтрок КАК CW_РеестрыНДС0СоответствиеЗаполненияСтрок
	|ГДЕ
	|	CW_РеестрыНДС0СоответствиеЗаполненияСтрок.ПризнакСтроки = Значение(Перечисление.CW_РеестрыНДС0ПризнакСтрокиПриложения.ОсновнаяСтрока) 
	|	И CW_РеестрыНДС0СоответствиеЗаполненияСтрок.Приказ = &Приказ
	|	И CW_РеестрыНДС0СоответствиеЗаполненияСтрок.ПриложениеПриказа В(&мПриложенияПриказа)";
	
	Запрос.УстановитьПараметр("Приказ", ПриказИсточник);
	Запрос.УстановитьПараметр("мПриложенияПриказа", мПриложенияПриказа);    
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовыйОбъект = СкопироватьЭлемент(Выборка.Ссылка, ПриказПриемник, Родитель, СоответствиеФорм);
		
		ДополнительныеСтроки = Новый Соответствие;
		
		Для каждого СтрокаТаблицы из НовыйОбъект.ДополнительныеСтроки Цикл 
			СсылкаНовогоДополнительнойСтроки = Справочники.CW_РеестрыНДС0СоответствиеЗаполненияСтрок.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ДополнительныеСтроки.Вставить(СсылкаНовогоДополнительнойСтроки, СтрокаТаблицы.СоответствияЗаполненияСтрок);
			
			СтрокаТаблицы.СоответствияЗаполненияСтрок = СсылкаНовогоДополнительнойСтроки;
		КонецЦикла;
		
		НовыйОбъект.Записать(); 
		
		Для Каждого КлючЗначение из ДополнительныеСтроки Цикл
			ДополнительнаяСтрока = СкопироватьЭлемент(КлючЗначение.Значение, ПриказПриемник, Родитель, СоответствиеФорм);
			ДополнительнаяСтрока.УстановитьСсылкуНового(КлючЗначение.Ключ);
			ДополнительнаяСтрока.Записать();	
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СкопироватьЭлемент(Знач КопируемаяСсылка, Знач ПриказПриемник, Знач Родитель, Знач СоответствиеФорм)
	
	НовыйОбъект = КопируемаяСсылка.Скопировать();
	НовыйОбъект.Родитель			= Родитель;
	НовыйОбъект.Наименование		= СокрЛП(НовыйОбъект.Приложение)+" ("+СокрЛП(ПриказПриемник)+")";
	НовыйОбъект.Приказ 				= ПриказПриемник;
	НовыйОбъект.ПриложениеПриказа 	= СоответствиеФорм.Получить(КопируемаяСсылка.ПриложениеПриказа);     
	
	Возврат НовыйОбъект;
	
КонецФункции

