//Чтение файла
Процедура ЗагрузитьФайлВТабличныйДокумент(ПараметрыЗагрузки, АдресРезультата) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ДвоичныеДанныеФайла = ПараметрыЗагрузки.ХранилищеДанныхФайла.Получить();
	Если ДвоичныеДанныеФайла = Неопределено Тогда
		ПоместитьВоВременноеХранилище(ТабличныйДокумент, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	МакетЗаголовка  = Обработки.CW_ЗагрузкаПараметровГрузоперевозокИзФайла.ПолучитьМакет(ПараметрыЗагрузки.ИмяМакетаЗаголовка);
	РасширениеФайла = ПараметрыЗагрузки.РасширениеФайла;

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	
	ДанныеФайла = Новый ТабличныйДокумент;
	
	Попытка
		ДанныеФайла.Прочитать(ИмяВременногоФайла);
	Исключение
		ВызватьИсключение НСтр("ru = 'Ошибка чтения файла. Формат файла не поддерживается.'");	
	КонецПопытки;
	
	Если ПараметрыЗагрузки.Свойство("ПараметрыПрикладнойЗагрузки")
		И ПараметрыЗагрузки.ПараметрыПрикладнойЗагрузки.Свойство("ТолькоПоследнийЛист") 
		И ПараметрыЗагрузки.ПараметрыПрикладнойЗагрузки.ТолькоПоследнийЛист 
		И ДанныеФайла.Области.Количество() > 1 Тогда
		ОбластиКУдалению = Новый Массив;
		// Все кроме последней области подготовим к удалению
		Для НомерОбласти = 1 По ДанныеФайла.Области.Количество() - 1 Цикл
			ОбластиКУдалению.Добавить(ДанныеФайла.Области[НомерОбласти - 1]);
		КонецЦикла;
		// Удаляем области
		Для Каждого ОбластьКУдалению Из ОбластиКУдалению Цикл
			ДанныеФайла.УдалитьОбласть(ОбластьКУдалению);
		КонецЦикла;
	КонецЕсли;
	
	// Разгруппируем все объединенные ячейки. Работа с такими ячейками не поддерживается.
	ДанныеФайла.Область().Разъединить();
	
	// Скопируем значения ячеек, чтобы избавиться от форматирования исходного файла.
	НомераКолонокЧисло = Новый Массив;  
	КолонкаКоличество = Неопределено;
	Для НомерКолонки = 1 По ДанныеФайла.ШиринаТаблицы Цикл
		Для НомерСтроки = 1 По ДанныеФайла.ВысотаТаблицы Цикл 
			ТекстОбласти = ДанныеФайла.Область(НомерСтроки, НомерКолонки).Текст;
			
			Область = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Если НомерСтроки = 1 Тогда
				//Строказаголовков записывается в виде текста
				Область.Текст = ТекстОбласти;	
			Иначе
				Область.СодержитЗначение 	= Истина;
				Область.ТипЗначения 		= Новый ОписаниеТипов("Строка"); 
				Область.Значение 			= Область.ТипЗначения.ПривестиЗначение(ТекстОбласти);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	УдалитьВременныйФайл(ИмяВременногоФайла);

	УдалитьПустыеКолонки(ТабличныйДокумент, 1);
	УдалитьПустыеСтроки(ТабличныйДокумент);

	ПрорисоватьГраницыЯчеек(ТабличныйДокумент);
	
	// Раздвинем первую строку табличного документа. В первой строке всегда выводим заголовки с выбором реквизитов.
	ПерваяСтрока = ТабличныйДокумент.Область(1, ,1);
	ТабличныйДокумент.ВставитьОбласть(ПерваяСтрока, , ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	ТабличныйДокумент.ВставитьОбласть(ПерваяСтрока, , ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	ТекстНезаполненногоЗаголовкаПарамтера   = "Выбрать параметр";
	ТекстНезаполненногоЗаголовкаДействия 	= "Выбрать действие";
	
	// Попытаемся сопоставить заголовки таблицы файла с колонками, обрабатываемыми при загрузке.
	ОбластьЗаголовок = МакетЗаголовка.ПолучитьОбласть("Заголовок"); 
	ОбластьЗаголовок.Параметры.ИмяРеквизита 	= ТекстНезаполненногоЗаголовкаПарамтера;
	ОбластьЗаголовок.Параметры.Действие 		= ТекстНезаполненногоЗаголовкаДействия;
	
	СопоставленныеКолонки = Новый Массив;
	Для НомерКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл    
		
		ОбластьЯчеекЗаголовок = ОбластьЗаголовок.Область(1, 1, 2, 1); 
		
		ТекущаяОбласть = ТабличныйДокумент.Область(1, НомерКолонки, 2, НомерКолонки);
		ТекущаяОбласть.ПараметрРасшифровки = "НеЗагружать";
		ТекущаяОбласть.ЦветФона = ОбластьЗаголовок.ТекущаяОбласть.ЦветФона;
	
		ИмяПараметра = "ИмяРеквизита" + НомерКолонки;
		ЯчейкаЗаголовка = ТабличныйДокумент.Область(1, НомерКолонки, 2, НомерКолонки);
		ТабличныйДокумент.ВставитьОбласть(ОбластьЯчеекЗаголовок, ЯчейкаЗаголовка, ТипСмещенияТабличногоДокумента.БезСмещения, Истина);
		
	КонецЦикла;
	
	// Оформляем полученный табличный документ.
	Область = ТабличныйДокумент.Область(1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);
	Область.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
	Область.ШиринаКолонки    = 20;
	Область.Отступ           = 1;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	Область.Обвести(Линия, Линия, Линия, Линия);

	ТабличныйДокумент.ФиксацияСверху 	= 2;
	ТабличныйДокумент.ФиксацияСлева 	= 0;
	
	// Особая высота для первой строки.
	ПерваяСтрока = ТабличныйДокумент.Область(1, , 2);
	ПерваяСтрока.ВысотаСтроки = ОбластьЗаголовок.ТекущаяОбласть.ВысотаСтроки;  
	
	СнятьЗащитуЯчеек(ТабличныйДокумент);

	РассчитатьШиринуКолонокТабличногоДокумента(ТабличныйДокумент);
	
	ПоместитьВоВременноеХранилище(ТабличныйДокумент, АдресРезультата);
	
КонецПроцедуры  

Процедура УдалитьВременныйФайл(ПолноеИмяФайла)
	
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		УдалитьФайлы(ПолноеИмяФайла)
	Исключение
	КонецПопытки
	
КонецПроцедуры

Процедура УдалитьПустыеКолонки(ТабличныйДокумент, НачинатьСоСтроки = 3) Экспорт
	
	ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы;
	ШиринаТаблицы = ТабличныйДокумент.ШиринаТаблицы;
	
	ПустыеКолонки = Новый Массив;
	
	Для НомерКолонки = 1 По ШиринаТаблицы Цикл
		
		ВсеЯчейкиПустые = Истина;
		Для НомерСтроки = НачинатьСоСтроки По ВысотаТаблицы Цикл
			
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Если Не ПустаяСтрока(Ячейка.Текст) Тогда
				ВсеЯчейкиПустые = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВсеЯчейкиПустые Тогда
			ПустыеКолонки.Добавить(НомерКолонки);
		КонецЕсли;
		
	КонецЦикла;
	
	ВГраница = ПустыеКолонки.ВГраница();
	Для Индекс = 0 По ВГраница Цикл
		
		НомерКолонки = ПустыеКолонки[ВГраница - Индекс];
		Область = ТабличныйДокумент.Область(, НомерКолонки, , НомерКолонки);
		ТабличныйДокумент.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоВертикали);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьПустыеСтроки(ТабличныйДокумент)
	
	ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы;
	ШиринаТаблицы = ТабличныйДокумент.ШиринаТаблицы;
	
	ПустыеСтроки = Новый Массив;
	
	Для НомерСтроки = 1 По ВысотаТаблицы Цикл
		
		ВсеЯчейкиПустые = Истина;
		Для НомерКолонки = 1 По ШиринаТаблицы Цикл
			
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Если Не ПустаяСтрока(Ячейка.Текст) Тогда
				ВсеЯчейкиПустые = Ложь;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВсеЯчейкиПустые Тогда
			ПустыеСтроки.Добавить(НомерСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
	ВГраница = ПустыеСтроки.ВГраница();
	Для Индекс = 0 По ВГраница Цикл
		
		НомерСтроки = ПустыеСтроки[ВГраница - Индекс];
		Область = ТабличныйДокумент.Область(НомерСтроки, , НомерСтроки);
		ТабличныйДокумент.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоВертикали);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрорисоватьГраницыЯчеек(ТабличныйДокумент)
	
	ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы;
	ШиринаТаблицы = ТабличныйДокумент.ШиринаТаблицы;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	
	Для НомерСтроки = 1 По ВысотаТаблицы Цикл
		
		Для НомерКолонки = 1 По ШиринаТаблицы Цикл
			
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Ячейка.Обвести(Линия, Линия, Линия, Линия);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры  

Процедура СнятьЗащитуЯчеек(ТабличныйДокумент, НачинатьСоСтроки = 3) Экспорт
	
	ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы;
	ШиринаТаблицы = ТабличныйДокумент.ШиринаТаблицы;
	
	ПустыеКолонки = Новый Массив;
	
	Для НомерКолонки = 1 По ШиринаТаблицы Цикл
		
		ВсеЯчейкиПустые = Истина;
		Для НомерСтроки = НачинатьСоСтроки По ВысотаТаблицы Цикл
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Ячейка.Защита 	= Ложь;
			Ячейка.ЦветФона = ЦветаСтиля.ПравоРедактированияФон
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
//Чтение файла

Процедура РассчитатьШиринуКолонокТабличногоДокумента(ТабличныйДокумент) Экспорт
	
	Для Колонка = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ОбластьКолонка 		= ТабличныйДокумент.Область(1, Колонка, ТабличныйДокумент.ВысотаТаблицы, Колонка);
		ОбластьЗаголовок 	= ТабличныйДокумент.Область(3, Колонка, 3, Колонка); 
		
		ШиринаКолонки  = 0;
		Для Строка = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
			Область = ТабличныйДокумент.Область(Строка, Колонка, Строка, Колонка);
			ШиринаКолонки = Макс(ШиринаКолонки, СтрДлина(СокрЛП(Область.Текст)));
			Если ШиринаКолонки > 40 Тогда
				ШиринаКолонки = 40;
			КонецЕсли;
		Конеццикла;  
		
		ОбластьКолонка.ШиринаКолонки = ШиринаКолонки;
	КонецЦикла;

КонецПроцедуры   




