
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ОбновлениеКонфигурацииСервер.ПриСозданииНаСервере(ЭтаФорма, Параметры, Отказ, СтандартнаяОбработка);	
	
	ИндикаторОбновления = CW_ОбновлениеКонфигурацииСервер.ПолучитьПоложениеИндикатораОбновления();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ИндикаторОбновления.МаксимальноеЗначение = ТаблицаОбработчиков.Количество() + ИндикаторОбновления;

	ПодключитьОбработчикОжидания("НачатьВыполнениеобработчиков", 0.1, Истина);
	
КонецПроцедуры    

&НаКлиенте
Процедура НачатьВыполнениеобработчиков() Экспорт 
	
	ВремяНачалаОбновления 	= ДатаСеанса(); 
	ТребуетсяПерезапуск 	= Ложь;   
	
	Для Каждого СтрокаТаблицы из ТаблицаОбработчиков Цикл    
		
		РезульатВыполнения = CW_ОбновлениеКонфигурацииСлужебный.ВыполнитьЗаданиеНаСервере(СтрокаТаблицы.ИмяОбработчика);  
		Если РезульатВыполнения.Состояние = "Ошибка" Тогда
			ПодключитьОбработчикОжидания("ЗавершитьВыполнениеОбработчиковОшибка", 1, Истина);
			Возврат;
		КонецЕсли; 
		
		Результат 			= ПолучитьИзВременногоХранилища(РезульатВыполнения.АдресРезультата);
		Если ТипЗнч(Результат) = Тип("Структура") Тогда 
			
			Результат.Свойство("ТребуетсяПерезапуск", ТребуетсяПерезапуск);
			ТребуетсяПерезапуск = ?(ТребуетсяПерезапуск = Неопределено, Ложь, ТребуетсяПерезапуск);   
			
			ИндикаторОбновления = ИндикаторОбновления + 1; 
			ОбновитьОтображениеДанных(Элементы.ИндикаторОбновления);   
			Если ТребуетсяПерезапуск Тогда
				Прервать;                     
			КонецЕсли;
		КонецЕсли;  
		
		ИндикаторОбновления = ИндикаторОбновления + 1; 
		ОбновитьОтображениеДанных(Элементы.ИндикаторОбновления);    
		
	КонецЦикла; 
	
	Если ТребуетсяПерезапуск Тогда
		CW_ОбновлениеКонфигурацииСервер.ПриостановитьОбновление(ИндикаторОбновления);
		ЗавершитьРаботуСистемы(Ложь, Истина); 
	Иначе
		ПодключитьОбработчикОжидания("ЗавершитьВыполнениеОбработчиковУспешно", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ДатаСеанса()
	 Возврат  ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура ЗавершитьВыполнениеОбработчиковУспешно() Экспорт 
	
	ЭтаФорма.Закрыть("Успешно");
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВыполнениеОбработчиковОшибка() Экспорт 
	
	ЭтаФорма.Закрыть("Ошибка");
	
КонецПроцедуры 

	
&НаКлиенте
Процедура ТехническаяИнформацияНажатие(Элемент)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЗапускатьНеВФоне", Истина);
	ПараметрыОтбора.Вставить("ДатаНачала", ВремяНачалаОбновления);
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ПараметрыОтбора);
	
КонецПроцедуры
