#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьСписокДоступныхМакросов(ОбъектШаблона) Экспорт
	
	ДеревоМакросов = ПустоеДеревоМакросов();
	
	МенеджерОбъетаШаблона = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ОбъектШаблона.ЗначениеПустойСсылки); 
	
	Попытка   
		//Метода может и не быть
		МенеджерОбъетаШаблона.ДополнитьМакросыОбъекта(ДеревоМакросов);
	Исключение
	КонецПопытки; 
	
	ГруппаМакросов = ДеревоМакросов.Строки.Добавить();  
	ГруппаМакросов.ИндексКартинки 	= 0;
	ГруппаМакросов.Значение 		= "";
	ГруппаМакросов.Представление 	= "Отправитель";
	ГруппаМакросов.ЭтоГруппа 		= Истина;
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Отправитель]", 		"Отправитель",			4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ФИООтправителя]", 		"ФИО отправителя",		4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ФамилияОтправителя]", 	"Фамилия отправителя",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ИмяОтправителя]", 		"Имя отправителя",		4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ОтчествоОтправителя]", "Отчество отправителя",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДолжностьОтправителя]", "Должность отправителя",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СлужебныйТелефонОтправителя]", "Служебный телефон отправителя",4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[E-mailОтправителя]", 	"E-mail адрес отправителя",	4);
	
	Возврат ДеревоМакросов;
	
КонецФункции 

Функция ПустоеДеревоМакросов() Экспорт
	
	ДеревоМакросов = Новый ДеревоЗначений;
	ДеревоМакросов.Колонки.Добавить("ИндексКартинки", 	Новый ОписаниеТипов("Число"));
	ДеревоМакросов.Колонки.Добавить("Значение", 		Новый ОписаниеТипов("Строка"));
	ДеревоМакросов.Колонки.Добавить("Представление", 	Новый ОписаниеТипов("Строка"));
	ДеревоМакросов.Колонки.Добавить("ЭтоГруппа", 		Новый ОписаниеТипов("Булево"));
	
	Возврат ДеревоМакросов;
	
КонецФункции

Процедура ДобавитьСтрокуМакросов(ГруппаМакросов, Значение, Представление, ИндексКартинки)
	
	СтрокаМакроса = ГруппаМакросов.Строки.Добавить();
	СтрокаМакроса.ИндексКартинки 	= ИндексКартинки;
	СтрокаМакроса.Значение 			= Значение;
	СтрокаМакроса.Представление 	= Представление;
	СтрокаМакроса.ЭтоГруппа 		= Ложь;
	
КонецПроцедуры

Функция ПолучитьОписаниеМакросов(ИдентификаторОбъектаМетаданных, ДополнительныеПараметры) Экспорт
	
	Результат = Новый Соответствие;   
	
	//Описание общих макросов
	Результат.Вставить("[Отправитель]", 				"НастройкиПользователя.УчетнаяЗаписьЭлектроннойПочты.ИмяОтправителя");
	Результат.Вставить("[СлужебныйТелефонОтправителя]",	"НастройкиПользователя.СлужебныйТелефон");
	Результат.Вставить("[E-mailОтправителя]", 			"НастройкиПользователя.УчетнаяЗаписьЭлектроннойПочты.ПочтовыйАдрес");
	
	Результат.Вставить("[ФамилияОтправителя]",		"ДанныеФизическогоЛица.Фамилия");
	Результат.Вставить("[ИмяОтправителя]",			"ДанныеФизическогоЛица.Имя");
	Результат.Вставить("[ОтчествоОтправителя]",		"ДанныеФизическогоЛица.Отчество");
	Результат.Вставить("[ДолжностьОтправителя]",	"НастройкиПользователя.Должность");
	//---Описание общих макросов
	
	МенеджерОбъетаШаблона = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ИдентификаторОбъектаМетаданных.ЗначениеПустойСсылки);
	Попытка
		МенеджерОбъетаШаблона.ПолучитьОписаниеМакросов(Результат, ДополнительныеПараметры);
	Исключение   
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

//Служебные процедуры
Процедура ЗаполнитьШаблонHTML() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ШаблоныСтандартныхПисем.Ссылка КАК Ссылка,
	|	CW_ШаблоныСтандартныхПисем.ТелоHTML КАК ТелоHTML
	|ИЗ
	|	Справочник.CW_ШаблоныСтандартныхПисем КАК CW_ШаблоныСтандартныхПисем";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.ТелоHTML) Тогда
			ТОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
			
			ФорматированныйДокумент = Новый ФорматированныйДокумент;
			ФорматированныйДокумент.Добавить(Выборка.Ссылка.Тело);
			
			Вложения  = Новый Структура;
			ТекстHTML = "";
			ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
			
			ТОбъект.ТелоHTML = ТекстHTML;
			ТОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьИдентифкаторыШаблона() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ШаблоныСтандартныхПисем.Ссылка КАК Ссылка,
	               |	CW_ШаблоныСтандартныхПисем.ОбъектШаблона КАК ОбъектШаблона,
	               |	CW_ШаблоныСтандартныхПисем.УдалитьОбъектШаблона КАК УдалитьОбъектШаблона
	               |ИЗ
	               |	Справочник.CW_ШаблоныСтандартныхПисем КАК CW_ШаблоныСтандартныхПисем";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.ОбъектШаблона) Тогда
			
			мСтроки 	= СтрРазделить(Выборка.УдалитьОбъектШаблона,".", Ложь);
			ИмяТипа 	= мСтроки[0]+"Ссылка."+мСтроки[1];
			ТипОбъекта	= Тип(ИмяТипа);
			
			ИдентифкаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
			
			ТОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
			ТОбъект.ОбъектШаблона = ИдентифкаторОбъекта; 
			ТОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
//Служебные процедуры

#КонецЕсли
