
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТекущийПрофиль", ТекущийПрофиль);
	Параметры.Свойство("СхемаКомпоновки", СхемаКомпоновки);
	Параметры.Свойство("АдресНастроек", АдресНастроек);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	ПредыдущийКомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));	
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если Настройки <> Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		ПредыдущийКомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОграничение(ИмяПоля)
	
	//Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	//Ограничение = Элементы.ДоступныеПоля.ОграниченияИспользования.Добавить();
	//Ограничение.Доступность = Ложь;
	//Ограничение.Поле = Поле;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// --- 
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки(Элемент)
	
	ПроверитьВозможностьУстановитьОтборПоСписку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ЭтаФорма.Закрыть(ПоместитьВоВременноеХранилище(КомпоновщикНастроек.Настройки,АдресНастроек));
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписок(Команда)
	
	СтрокаСписка = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВводаСписка", ЭтотОбъект); 
	ПоказатьВводСтроки(ОписаниеОповещения, СтрокаСписка, "Введите список значений", , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаСписка(СтрокаСписка, ДопПараметры) Экспорт
	
	Если СтрокаСписка <> Неопределено Тогда
		спЗначений = ПолучитьСписок(СтрокаСписка);
		Если спЗначений.Количество() > 0 Тогда
			ТД = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные;
			Для Каждого СтрОтбора из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
				Если СтрОтбора.ЛевоеЗначение = ТД.ЛевоеЗначение И ТипЗнч(СтрОтбора.ПравоеЗначение) = Тип("Строка") Тогда 
					СтрОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
					СтрОтбора.ПравоеЗначение = спЗначений;
					СтрОтбора.Использование  = Истина;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписок(Список)
	
	Разделители = ПолучитьРазделитили();
	спЗначений = Новый СписокЗначений;
	ДлТекста = СтрДлина(Список);
	ВыхТекст = "";
	Для Инк = 1 по ДлТекста Цикл
		Если Разделители.Найти(Сред(Список, Инк, 1)) = Неопределено Тогда
			ВыхТекст = ВыхТекст + Сред(Список, Инк, 1);	
		Иначе
			Если ЗначениеЗаполнено(ВыхТекст) Тогда
				спЗначений.Добавить(СокрЛП(ВыхТекст));
				ВыхТекст = "";
			КонецЕсли;	
		КонецЕсли; 
	КонецЦикла;	
	Если ЗначениеЗаполнено(ВыхТекст) Тогда
		спЗначений.Добавить(СокрЛП(ВыхТекст));
		ВыхТекст = "";
	КонецЕсли;
	
	Возврат спЗначений;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРазделитили();
	
	мас = Новый Массив;
	мас.Добавить(";");
	мас.Добавить(".");
	мас.Добавить(",");
	//мас.Добавить(" ");	
	мас.Добавить(Символы.ВК);
	мас.Добавить(Символы.ВТаб);
	мас.Добавить(Символы.ПС);
	мас.Добавить(Символы.ПФ);
	мас.Добавить(Символы.Таб); 
	
	Возврат мас;
	
КонецФункции	

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	
	//ТД = Элемент.ТекущиеДанные;
	//Если (ТД = Неопределено) Тогда
	//	Возврат;		
	//КонецЕсли;
	//
	//Доступно = Ложь;
	//Для Каждого СтрОтбора из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//	Если (ТипЗнч(СтрОтбора) <> Тип("ГруппаЭлементовОтбораКомпоновкиДанных")) Тогда
	//		Если СтрОтбора.ЛевоеЗначение = ТД.ЛевоеЗначение И ТипЗнч(СтрОтбора.ПравоеЗначение) = Тип("Строка") Тогда 
	//			Доступно = Истина;
	//		КонецЕсли;	
	//	КонецЕсли;
	//КонецЦикла;	
	//
	//Элементы.КомпоновщикНастроекНастройкиОтборСформироватьСписок.Доступность = Доступно;
	
	ПроверитьВозможностьУстановитьОтборПоСписку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьУстановитьОтборПоСписку()
	// --- 
	
	Идентификатор = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока;
	Доступно = Ложь;
	Если (Идентификатор <> Неопределено) Тогда
		
		ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Идентификатор);
		Если (ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")) Тогда
			
			Если (ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("Строка")) Тогда
				Доступно = Истина;
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли; 
	Элементы.КомпоновщикНастроекНастройкиОтборСформироватьСписок.Доступность = Ложь;
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаДобавленияОтбора", ЭтотОбъект);  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", 	СхемаКомпоновки);
	ПараметрыФормы.Вставить("Режим", 					"Отбор");
	ПараметрыФормы.Вставить("ИсключенныеПоля", 			ПолучитьЗапрещенныеПоля());
	ПараметрыФормы.Вставить("ТекущаяСтрока", 			Неопределено);  
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	
КонецПроцедуры  

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля() Экспорт
	
	СписокПолей = Новый Массив;
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");

	СписокПолей.Добавить("Документ.Услуги"); 
	СписокПолей.Добавить("Документ.ДополнительныеРеквизиты");
	СписокПолей.Добавить("Документ.Дата"); 
	СписокПолей.Добавить("Документ.Организация"); 
 	СписокПолей.Добавить("Документ.Контрагент"); 

	СписокПолей.Добавить("Документ.ЗачетАвансов");
	СписокПолей.Добавить("Документ.ЗачетАвансовОЗ");
	СписокПолей.Добавить("Документ.ПлатёжноРасчётныеДокументы");
	СписокПолей.Добавить("Документ.ДокументыОбОтгрузке");
	СписокПолей.Добавить("Документ.СуммаДокумента");
	СписокПолей.Добавить("Документ.Валюта");

	СписокПолей.Добавить("Документ.ДокументыВознаграждения"); 
	СписокПолей.Добавить("Документ.ВсегоСуммаВсего"); 
	СписокПолей.Добавить("Документ.ВалютаДокумента"); 

	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаДобавленияОтбора(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено или РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;   
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(РезультатВыбора.Поле);
	ЭлементОтбора.Использование = Истина; 
	
	Если Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока <> Неопределено Тогда
		Элементы.КомпоновщикНастроекНастройкиОтбор.Развернуть(Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока);  
	КонецЕсли;
	
КонецПроцедуры  


