
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ПередВводомПинКода;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуПродолжить(Команда)  
	
	Если НомерШага = 0 Тогда
		Ответ = CW_РегистрацияПрограммыСервер.ПолучитьПинкодДоступа(РегистрационныйНомер,,2);	
		
		Если Ответ.КодСостояния = 200 Тогда
			УстановитьЗаголовокНадписи();
			Элементы.Страницы.ТекущаяСтраница = Элементы.ВводПинКода;   
			НомерШага = НомерШага + 1;
		Иначе
			//Ошибка
		КонецЕсли;
		
	Иначе  
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("РегистрационныйНомер", РегистрационныйНомер);
		СтруктураПараметров.Вставить("ПинКод", 				 ПинКод);
		СтруктураПараметров.Вставить("Событие", 			 2);
		
		Успешно =  CW_РегистрацияПрограммыСервер.ПроверитьВведенныйПинКод(СтруктураПараметров);   
		Если Не Успешно Тогда
			ПоказатьПредупреждение(, "Введен некорректный пин-код");
			Возврат;
		КонецЕсли;    
		
		ЭтаФорма.Закрыть(СтруктураПараметров);
		
	КонецЕсли;
	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	CW_РегистрацияПрограммыКлиент.ПолучитьРегистрационныйНомер(ЭтаФорма); 
	
	Если ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		Результат	= CW_РегистрацияПрограммыСервер.ПолучитьЭлектронныйАдресРегистрации(РегистрационныйНомер);  
		ЭлектронныйАдрес 	= Результат.af_email;   
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить("На электронный адрес ");
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ЭлектронныйАдрес, Новый Шрифт(,,Истина)));
		МассивСтрок.Добавить(", указанный при регистрации модуля, будет направлен пин-код для подключения к сервису.");
		МассивСтрок.Добавить(" Если у Вас нет доступа к указанному адресу, обратитесь в службу технической поддержки "); 
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("buhexp@coralway.ru", Новый Шрифт(,,Истина)));
		
		Элементы.НадписьПередВводомПинкода.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНеПолучилНажатие(Элемент)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("Если у Вас нет доступа к почтовому ящику, указанному при ");
	МассивСтрок.Добавить("приобретении программы ""Бухгалтерия экспедитора 8"", то "); 
	МассивСтрок.Добавить("Вам необходимо направить запрос на адрес ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("buhexp@coralway.ru", Новый Шрифт(,,Истина)));
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить("на смену электронного адреса владельца программы. ");
	МассивСтрок.Добавить("В запросе Вам необходимо указать название компании, ");
	МассивСтрок.Добавить("регистрационный номер программы, ФИО и должность сотрудника ");
	МассивСтрок.Добавить("компании для обратной связи.");
	
	ТекстПредупреждения = Новый ФорматированнаяСтрока(МассивСтрок);
	
	ПоказатьПредупреждение(,ТекстПредупреждения,,"");

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокНадписи()
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить("На электронный адрес ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ЭлектронныйАдрес,Новый Шрифт(,,Истина)));
	МассивСтрок.Добавить(" отправлен пин-код для подключения к сервису. ");
	МассивСтрок.Добавить("Введите полученный пин-код и нажмите кнопку ""Продолжить""");
	МассивСтрок.Добавить(Символы.ПС);
	
	Элементы.Информация.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);

КонецПроцедуры
