#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыЗаполнения = ПростойИнтерфейсКлиент.ПараметрыОткрытияЗависимыхФорм(ПараметрыВыполненияКоманды.Источник);
	ПараметрыЗаполнения.НачалоПериода = НачалоКвартала(ПараметрыЗаполнения.Период);
	
	ПараметрыФормы = Новый Структура("ПараметрыЗаполненияФормы", ПараметрыЗаполнения);
	
	ОткрытьФорму("Отчет.ЖурналУчетаСчетовФактур.Форма",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти