&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	СписокПриказов = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.ПолучитьСписокПриказов(); 
	Элементы.Приказ.СписокВыбора.ЗагрузитьЗначения(СписокПриказов.ВыгрузитьЗначения()); 
	
	Если Элементы.Приказ.СписокВыбора.Количество() = 1 Тогда 
		Объект.Приказ = Элементы.Приказ.СписокВыбора.Получить(0);
		Элементы.Приказ.ТолькоПросмотр = Истина;
	КонецЕсли;  
	
	УстановитьСписокВыбораПриложенийНаСервере();
	УстановитьВидимостьДополнительныхСтрок();
	
КонецПроцедуры    

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьДополнительныеКолонки();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьДополнительныеКолонки();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеКолонки()
	
	Для Каждого СтрокаНастроек из Объект.НастройкиСтрок Цикл
		СтрокаНастроек.ЯчейкаНалоговаяБаза = СтрокаНастроек.ЯчейкаОтчета.ЯчейкаНалоговаяБаза;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриказПриИзменении(Элемент) 
	
	УстановитьСписокВыбораПриложенийНаСервере();
	ПриказПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораПриложенийНаСервере()
	
	МассивПриложений = CW_РеестрыНДС0Сервер.ПолучитьСписокВыбораВидаТранспортаПоПриказу(Объект.Приказ); 
	Элементы.Приложение.СписокВыбора.ЗагрузитьЗначения(МассивПриложений);
	
КонецПроцедуры
	
	
&НаСервере
Процедура ПриказПриИзмененииНаСервере()  
	
	Если Элементы.Приложение.СписокВыбора.Количество() = 1 Тогда
		СтрокаСписка = Элементы.Приложение.СписокВыбора.Получить(0);
		Объект.Приложение = СтрокаСписка.Значение;
	КонецЕсли;
	
	Если Объект.Приложение.Пустая() Тогда
		Объект.НастройкиСтрок.Очистить();
		Объект.ДополнительныеСтроки.Очистить();   
	Иначе
		ПриложениеПриИзмененииНаСервере();
	КонецЕсли;   
	
КонецПроцедуры


&НаКлиенте
Процедура НастройкиСтрокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры   

&НаКлиенте
Процедура НастройкиСтрокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры 

&НаКлиенте
Процедура ПриложениеПриИзменении(Элемент)
	ПриложениеПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриложениеПриИзмененииНаСервере() 
	
	Объект.ПриложениеПриказа = CW_РеестрыНДС0Сервер.ПолучитьПриложениеПриказа(Объект.Приказ, Объект.Приложение);
	Если Объект.ПриложениеПриказа.Пустая() Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.НастройкиСтрок.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Ссылка КАК ЯчейкаОтчета,
	               |	CW_РеестрыНДС0ЯчейкиПриложений.ИмяЯчейки КАК ИмяЯчейки,
	               |	CW_РеестрыНДС0ЯчейкиПриложений.НомерКолонки КАК НомерКолонки,
	               |	CW_РеестрыНДС0ЯчейкиПриложений.ЯчейкаНалоговаяБаза КАК ЯчейкаНалоговаяБаза
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений КАК CW_РеестрыНДС0ЯчейкиПриложений
	               |ГДЕ
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Родитель = &Родитель
	               |	И CW_РеестрыНДС0ЯчейкиПриложений.ЭтоГруппа = ЛОЖЬ
	               |	И CW_РеестрыНДС0ЯчейкиПриложений.ЯчейкаНумерации = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_РеестрыНДС0ЯчейкиПриложений.Код
	               |АВТОУПОРЯДОЧИВАНИЕ";   
	
	Запрос.УстановитьПараметр("Родитель", Объект.ПриложениеПриказа);   
	
	РезультатЗапроса = Запрос.Выполнить(); 

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.НастройкиСтрок.Добавить();
		НоваяСтрока.ЯчейкаОтчета 		= Выборка.ЯчейкаОтчета;
		НоваяСтрока.ЯчейкаНалоговаяБаза = Выборка.ЯчейкаНалоговаяБаза;
	КонецЦикла;  
	
	УстановитьВидимостьДополнительныхСтрок();
	
КонецПроцедуры  


&НаКлиенте
Процедура ДополнительныеСтрокиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда  
		
		СтандартнаяОбработка = Ложь;     
		
		ТекущаяСтрока = Элементы.ДополнительныеСтроки.ТекущаяСтрока;   
		СтрокаТекущая = Объект.ДополнительныеСтроки.НайтиПоИдентификатору(ТекущаяСтрока);

		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВводУсловия", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВводСтроки(ОписаниеОповещения, СтрокаТекущая.УсловиеВыполнения,"Введите текст условия выполнения",0, Истина);
		
	КонецЕсли;
	

КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВводУсловия(Строка, ДополнительныеПараметры) Экспорт 
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТекущая = Объект.ДополнительныеСтроки.НайтиПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
	СтрокаТекущая.УсловиеВыполнения = Строка;
	
КонецПроцедуры

&наСервере
Функция УстановитьВидимостьДополнительныхСтрок()
	
	Элементы.ГруппаДополнительнаяНастрйока.Видимость = Объект.ПриложениеПриказа.ИспользуютсяДополнительныеСтроки 
				И Объект.ПризнакСтроки = ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0ПризнакСтрокиПриложения.ОсновнаяСтрока");
	
КонецФункции

&НаКлиенте
Процедура ПризнакСтрокиПриИзменении(Элемент) 
	
	УстановитьВидимостьДополнительныхСтрок(); 
	
КонецПроцедуры



