&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НазначениеСтатуса", НазначениеСтатуса);
	Параметры.Свойство("ЗаголовокФормы",	ЭтаФорма.Заголовок);
	
	МассивСтатусов = Неопределено;
	Параметры.Свойство("МассивСтатусов",	МассивСтатусов);
	
	МассивПараметров = Новый Массив();
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Владелец", НазначениеСтатуса));
	
	Если МассивСтатусов <> Неопределено Тогда
		Если МассивСтатусов.Количество() > 0 Тогда
			
			МассивСсылок = Новый ФиксированныйМассив(МассивСтатусов);
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", МассивСсылок));
			
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	Элементы.СтатусДокумента.ПараметрыВыбора = ПараметрыВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	//ПроводитьПоБухгалтерскомуУчету = ПолучитьПризнакПроведенияСтатусаНаСервере(СтатусДокумента);
	//Элементы.ГруппаПредупреждение.Видимость = ПроводитьПоБухгалтерскомуУчету;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьПризнакПроведенияСтатусаНаСервере(ВыбранныйСтатус)
	Возврат ВыбранныйСтатус.ПроводитьПоБухгалтерскомуУчету;
КонецФункции


&НаКлиенте
Процедура УстановитьСтатусОбъектов(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Установить для выбранных документов статус """+Строка(СтатусДокумента)+""".", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("СтатусДокумента",					СтатусДокумента);
	СтруктураПараметров.Вставить("Комментарий",						Комментарий);
	
	ЭтаФорма.Закрыть(СтруктураПараметров);

КонецПроцедуры