#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	// Описание стандартной структуры подключаемой обработки (обязательно)
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.1"); 
	
	// Описание типа и вида обработки (обязательно)
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиПечатнаяФорма();
	
	// Название печатной формы для пользователя, то как он будет ее видеть при вызове (обязательно)
	СтруктураОписания.Наименование 				= "Пример внешней команды для журналов";
	
	// Служебное описание подключаемой формы для специалиста по настройке (опционально) 
	СтруктураОписания.Описание 					= "Пример внешней печатной формы"; 
	
	// Номер версии подключаемой обработки, определяет разработчик (опционально).
	// Номер версии указывается для возможности определения различий при повторном подключении измененной обработки
	СтруктураОписания.Версия					= "3.2.0.0";     
	
	// Минимальная версия конфигурации модуля для которой может быть использована данная обработка (опционально).
	// Минимальная версия конфигурации модуля указывается с целью исключения ошибок в работе обработки, 
	// при ее подключении в БД с более ранними релизами модуля
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.15.8";
	
	// Включает возможность просмотра истории внесения изменений в подключаемую обработку (опционально).
	// Для просмотра истории в модуле объекта должна быть добавлена функция ПолучитьМакетИсторииИзменений(),
	// возвращающая макет с описанием истории изменения
	СтруктураОписания.ИсторияИзменений	= Истина;
	
	//Возможность использования отдельной формы настроек (опционально). 
	//Отдельная форма настроек должна позволять параметризировать в пользовательском режиме работу алгоритмов обработки.
	СтруктураОписания.Настройка 		= Истина;
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыНастроекОбъекта(СтруктураОписания, "ФормаНастроекОбъекта"); // указываем имя формы настроек
	
	// Указывается функция, в которой описывается объекты к которым подключается печатная форма (обязательно) 
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	// Описание макросов (может быть более одного) для использовании в шаблоне представления в форме вывода на печать (опционально).
	// Все функции получения значения макроса должны быть описаны в модуле объекта подключаемой обработки  
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерСчета]", "Номер счета", "ПолучитьНомерСчета(ПараметрыПроцедуры)");	
	
	Возврат СтруктураОписания;
	
КонецФункции


// функция, осуществляющая регистрацию печатной формы для перечисленных объектов метаданных
Процедура Регистрация(Ссылка) Экспорт
	
	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_ДоходыПоГрузоперевозке");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "Акт"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		

	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);

КонецПроцедуры

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	Используется = Истина;
	
	Если ПодключаемыйОбъект <> Неопределено Тогда
		Если Не ПодключаемыйОбъект.НеИспользуется  Тогда
			
			//Условия использования внешней печатной формы 
			//в зависимости от неких параметров
			
			Используется = Не СсылкаНаОбъект.ПометкаУдаления;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Используется
	
КонецФункции

Функция ПолучитьМакетИсторииИзменений() Экспорт 
	
	Возврат ПолучитьМакет("ИсторияИзменений");
	
КонецФункции

// Методы макросов
Функция ПолучитьНомерСчета(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.СсылкаНаДокумент.НомерСчета);
	
КонецФункции
//Методы макросов

Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт

	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	КонецЕсли; 

	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();

	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхАкта", Истина);
	Если КоличествоЭксземпляров <> Неопределено Тогда 
		РезультатПечати.Параметры.Количество = КоличествоЭксземпляров;
		РезультатПечати.Параметры.Печать 	 = (КоличествоЭксземпляров <> 0);  
	Иначе
		РезультатПечати.Параметры.Количество = 2;
		РезультатПечати.Параметры.Печать 	 = Истина;  
	КонецЕсли;  
	
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(СсылкаНаОбъект.ПредставлениеДокумента));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("СсылкаНаДокумент", СсылкаНаОбъект);
	
	РезультатПечати.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы
	
	// ---------------------------------------------------------------------------- 
	
	// код зполнения печатной формы

	// ---------------------------------------------------------------------------- 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет 			= ПолучитьМакет("МакетПечатнойФормы");
	ОбластьМакета 	= Макет.ПолучитьОбласть("ОбластьМакета");
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	РезультатПечати.ПечатнаяФорма = ТабличныйДокумент;
	
    Возврат РезультатПечати;
	
КонецФункции
#КонецЕсли