&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяСервера		= Константы.CW_ЛичныйКабинетИмяСервера.Получить();
	Порт			= Константы.CW_ЛичныйКабинетПортСервера.Получить();
	ИмяБазыДанных	= Константы.CW_ЛичныйКабинетИмяБазыДанных.Получить();
	ЗащищенноеСоединение = Константы.CW_ЛичныйКабинетЗащищенноеСоединение.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	КодСостояния = CW_РаботаСВнешнимиРесурсамиСервер.ПроверитьПодключениеНаСервере();
	Элементы.СоединениеУспешно.Видимость = КодСостояния = 200;
	
	Если КодСостояния <> Неопределено Тогда
		ОписаниеКодовСостояний = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();
		Если КодСостояния = 200 Тогда
			ПоказатьПредупреждение(,"Успешное подключение");
		Иначе    
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка подклчюения! Код: "+Строка(КодСостояния)+" - " + ОписаниеКодовСостояний.Получить(КодСостояния);
			Сообщение.Сообщить();
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,"Не удалось подключиться");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗащищенноеСоединениеПриИзменении(Элемент)
	
	Порт = ?(ЗащищенноеСоединение, 443, 80);
	
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьПараметры(Команда)
	
	КодСостояния = CW_РаботаСВнешнимиРесурсамиСервер.ПроверитьПодключениеНаСервере();
	
	Если КодСостояния <> 200 Тогда
		ОписаниеКодовСостояний = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка подклчюения! Код: "+Строка(КодСостояния)+" - " + ОписаниеКодовСостояний.Получить(КодСостояния);
		Сообщение.Сообщить();
		
		ПоказатьПредупреждение(,"Не удалось подключиться");
	Иначе
		ИзменитьПараметрыНаСервере();
		ПоказатьПредупреждение(,"Параметры подклчюения к сервису изменены!",,"Изменение параметров сервера серииса");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПараметрыНаСервере()
	
	Константы.CW_ЛичныйКабинетИмяСервера.Установить(ИмяСервера);
	Константы.CW_ЛичныйКабинетПортСервера.Установить(Порт);
	Константы.CW_ЛичныйКабинетИмяБазыДанных.Установить(ИмяБазыДанных);
	Константы.CW_ЛичныйКабинетЗащищенноеСоединение.Установить(ЗащищенноеСоединение);
	
КонецПроцедуры


