
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФОрмыПродленияПодписки", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.CW_ДоходыНерезидентовПродлениеПодписки", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФОрмыПродленияПодписки(Результат, ДополнительныеПараметры) Экспорт
	
	Оповестить("Запись_СчетДоходыНерезидентов");
	
КонецПроцедуры

