/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// КлассификацияЗадолженности: По дебиторской и кредиторской задолженности рассчитываются остатки с учетом сроков.
// Результаты расчётов фиксируются в регистрах классификации по срокам.
//
#Область ПрограммныйИнтерфейс

// Возвращает рассчитанные данные задолженности по срокам
//
// Параметры:
//  КонтекстОперации - Структура:
//   * Организации - Массив из СправочникСсылка.Организации
//   * НачалоПериода - Дата
//   * КонецПериода - Граница
//   * КонецПериодаДата - Дата
//   * ДатаНачалаКраткосрочногоПериода - Дата
//   * ДатаОкончанияКраткосрочногоПериода - Дата
//   * ДатаНачалаДолгосрочногоПериода - Дата
//
// Возвращаемое значение:
//  см. НовыйДанныеЗадолженности
//
Функция ДанныеЗадолженностиПоСрокам(КонтекстОперации) Экспорт
	
	РасчетныеДанные = Новый Структура;
	КонтекстРасчетаОбязательств = КонтекстРасчетаДисконтированногоОбязательства(КонтекстОперации);
	РасчетныеДанные.Вставить("РасчетыПоАренде",    РасчетПоказателейБалансаПоОбязательствам.ИсходныеДанныеПоАренднымОбязательствам(КонтекстРасчетаОбязательств));
	РасчетныеДанные.Вставить("РасчетыПоРассрочке", РасчетПоказателейБалансаПоОбязательствам.ИсходныеДанныеЗадолженностиСРассрочкой(КонтекстРасчетаОбязательств, Ложь));
	
	ДанныеЗадолженности = НовыйДанныеЗадолженности();
	ДанныеЗадолженности.РасходыБудущихПериодов            = РасходыБудущихПериодовПоСрокам(КонтекстОперации);
	ДанныеЗадолженности.ДебиторскаяЗадолженностьПоСрокам  = ДебиторскаяЗадолженностьПоСрокам(КонтекстОперации, РасчетныеДанные);
	ДанныеЗадолженности.КредиторскаяЗадолженностьПоСрокам = КредиторскаяЗадолженностьПоСрокам(КонтекстОперации, РасчетныеДанные);
	
	Возврат ДанныеЗадолженности;
	
КонецФункции

// Конструктор параметра "ПараметрыСвязиВременнойТаблицыРасчеты" функции "ДополнитьЗапросДаннымиПоСрокамОплаты"
// Содержит имя временной таблицы и ключевые поля, которые используются для соединения с другой таблицей
//
// Возвращаемое значение:
//  Структура
//   * ИмяТаблицы - Строка - имя временной таблицы
//   * ИмяПоляСчет - Строка
//   * ИмяПоляОрганизация - Строка
//   * ИмяПоляДоговор - Строка
//   * ИмяПоляДокумент - Строка
//
Функция НовыйПараметрыСвязиВременнойТаблицыРасчеты() Экспорт
	
	ПараметрыСвязи = Новый Структура;
	ПараметрыСвязи.Вставить("ИмяТаблицы",         "");
	ПараметрыСвязи.Вставить("ИмяПоляСчет",        "");
	ПараметрыСвязи.Вставить("ИмяПоляОрганизация", "");
	ПараметрыСвязи.Вставить("ИмяПоляДоговор",     "");
	ПараметрыСвязи.Вставить("ИмяПоляДокумент",    "");
	
	Возврат ПараметрыСвязи;
	
КонецФункции

// Конструктор коллекции, описывающий контекст запроса
//
// Возвращаемое значение:
//  Структура:
//   * ПараметрыЗапроса - Структура
//   * ОпределитьСроки - Булево
//   * ВременныеТаблицы - Массив из Строка - имена временных таблиц
//
Функция НовыйКонтекстЗапросаОстаткиЗадолженности() Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ПараметрыЗапроса", Новый Структура); // набираются параметры запроса
	Контекст.Вставить("ОпределитьСроки",  Ложь);
	Контекст.Вставить("ВременныеТаблицы", Новый Массив);
	Возврат Контекст;
	
КонецФункции

// Дополняет текст запроса сведениями о сроках оплаты
//
// Параметры:
//  ТекстЗапроса - Строка - текст запроса
//  ПараметрыСвязи - см.НовыйПараметрыСвязиВременнойТаблицыРасчеты - указаны имя временной таблицы и поля соединения
//  ПараметрыЗапроса - см. ПараметрыЗапроса из см. НовыйКонтекстЗапросаОстаткиЗадолженности
//
Процедура ДополнитьЗапросДаннымиПоСрокамОплаты(ТекстЗапроса, ПараметрыСвязи, ПараметрыЗапроса) Экспорт
	
	СхемаЗапроса = Новый СхемаЗапроса;

	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ОписаниеЗапроса = СхемаЗапроса.ПакетЗапросов[0];
	Оператор = ОписаниеЗапроса.Операторы[0];
	
	ИсточникРасчеты = Оператор.Источники[0];
	
	ИсточникДанныеПервичныхДокументов = Оператор.Источники.Добавить("РегистрСведений.ДанныеПервичныхДокументов", "ДанныеПервичныхДокументов");
	УсловиеДанныеПервичныхДокументов = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
	                                   "[ИмяТаблицы].[ИмяПоляОрганизация] = ДанныеПервичныхДокументов.Организация И [ИмяТаблицы].[ИмяПоляДокумент] = ДанныеПервичныхДокументов.Документ",
	                                   ПараметрыСвязи);
	ИсточникРасчеты.Соединения.Добавить(ИсточникДанныеПервичныхДокументов, УсловиеДанныеПервичныхДокументов);
	
	ИсточникДоговоры = Оператор.Источники.Добавить("Справочник.ДоговорыКонтрагентов", "ДоговорыКонтрагентов");
	УсловиеДоговоры = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
	                                   "[ИмяТаблицы].[ИмяПоляДоговор] = ДоговорыКонтрагентов.Ссылка",
	                                   ПараметрыСвязи);
	ИсточникРасчеты.Соединения.Добавить(ИсточникДоговоры,УсловиеДоговоры);
	
	ИсточникСрокиОплатыДокументов = Оператор.Источники.Добавить("РегистрСведений.СрокиОплатыДокументов", "СрокиОплатыДокументов");
	УсловиеСрокиОплатыДокументов = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
	                                   "[ИмяТаблицы].[ИмяПоляОрганизация] = СрокиОплатыДокументов.Организация И [ИмяТаблицы].[ИмяПоляДокумент] = СрокиОплатыДокументов.Документ",
	                                   ПараметрыСвязи);
	ИсточникРасчеты.Соединения.Добавить(ИсточникСрокиОплатыДокументов,УсловиеСрокиОплатыДокументов);
	
	ДобавитьПолеЗапроса(ОписаниеЗапроса,
	                    Оператор,
	                    "ДатаРегистратора",
	                    "ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1))");
	
	ДобавитьПолеЗапроса(ОписаниеЗапроса,
	                    Оператор,
	                    "ЕстьДокументРасчетов",
	                    "НЕ ДанныеПервичныхДокументов.ДатаРегистратора ЕСТЬ NULL");
	
	ДобавитьПолеЗапроса(ОписаниеЗапроса,
	                    Оператор,
	                    "СрокОплаты",
	                    "ВЫБОР
	                    |	КОГДА (ДоговорыКонтрагентов.ВидДоговора В (&ВидыДоговоровПоставщиков)
	                    |				И &ИспользуютсяСрокиОплатыПоставщикам
	                    |			ИЛИ ДоговорыКонтрагентов.ВидДоговора В (&ВидыДоговоровПокупателей)
	                    |				И &ИспользуютсяСрокиОплатыПокупателей)
	                    |			И СрокиОплатыДокументов.СрокОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	                    |		ТОГДА СрокиОплатыДокументов.СрокОплаты
	                    |	КОГДА ДоговорыКонтрагентов.УстановленСрокОплаты
	                    |			И ДоговорыКонтрагентов.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	                    |		ТОГДА ДоговорыКонтрагентов.ДатаОплаты
	                    |	КОГДА НЕ ДанныеПервичныхДокументов.ДатаРегистратора ЕСТЬ NULL
	                    |			И ВЫБОР
	                    |				КОГДА ДоговорыКонтрагентов.УстановленСрокОплаты
	                    |					ТОГДА ДоговорыКонтрагентов.СрокОплаты
	                    |				КОГДА ДоговорыКонтрагентов.ВидДоговора В (&ВидыДоговоровПокупателей)
	                    |					ТОГДА &СрокОплатыПокупателей
	                    |				КОГДА ДоговорыКонтрагентов.ВидДоговора В (&ВидыДоговоровПоставщиков)
	                    |					ТОГДА &СрокОплатыПоставщикам
	                    |				ИНАЧЕ 0
	                    |			КОНЕЦ <> 0
	                    |		ТОГДА ДОБАВИТЬКДАТЕ(ДанныеПервичныхДокументов.ДатаРегистратора, ДЕНЬ, ВЫБОР
	                    |					КОГДА ДоговорыКонтрагентов.УстановленСрокОплаты
	                    |						ТОГДА ДоговорыКонтрагентов.СрокОплаты
	                    |					КОГДА ДоговорыКонтрагентов.ВидДоговора В (&ВидыДоговоровПокупателей)
	                    |						ТОГДА &СрокОплатыПокупателей
	                    |					КОГДА ДоговорыКонтрагентов.ВидДоговора В (&ВидыДоговоровПоставщиков)
	                    |						ТОГДА &СрокОплатыПоставщикам
	                    |					ИНАЧЕ 0
	                    |				КОНЕЦ)
	                    |	ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                    |КОНЕЦ");

	ДобавитьПолеЗапроса(ОписаниеЗапроса,
	                    Оператор,
	                    "ИсточникСрокаОплаты",
	                    "ВЫБОР
	                    |	КОГДА (ДоговорыКонтрагентов.ВидДоговора В (&ВидыДоговоровПоставщиков)
	                    |				И &ИспользуютсяСрокиОплатыПоставщикам
	                    |			ИЛИ ДоговорыКонтрагентов.ВидДоговора В (&ВидыДоговоровПокупателей)
	                    |				И &ИспользуютсяСрокиОплатыПокупателей)
	                    |			И СрокиОплатыДокументов.СрокОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	                    |		ТОГДА СрокиОплатыДокументов.Документ
	                    |	КОГДА ДоговорыКонтрагентов.УстановленСрокОплаты
	                    |			И ДоговорыКонтрагентов.ДатаОплаты <> ДАТАВРЕМЯ(1, 1, 1)
	                    |		ТОГДА ДоговорыКонтрагентов.Ссылка
	                    |	КОГДА НЕ ДанныеПервичныхДокументов.ДатаРегистратора ЕСТЬ NULL
	                    |			И ВЫБОР
	                    |				КОГДА ДоговорыКонтрагентов.УстановленСрокОплаты
	                    |					ТОГДА ДоговорыКонтрагентов.СрокОплаты
	                    |				ИНАЧЕ 0
	                    |			КОНЕЦ <> 0
	                    |		ТОГДА ДоговорыКонтрагентов.Ссылка
	                    |	КОГДА НЕ ДанныеПервичныхДокументов.ДатаРегистратора ЕСТЬ NULL
	                    |			И ВЫБОР
	                    |				КОГДА ДоговорыКонтрагентов.ВидДоговора В (&ВидыДоговоровПокупателей)
	                    |					ТОГДА &СрокОплатыПокупателей
	                    |				КОГДА ДоговорыКонтрагентов.ВидДоговора В (&ВидыДоговоровПоставщиков)
	                    |					ТОГДА &СрокОплатыПоставщикам
	                    |				ИНАЧЕ 0
	                    |			КОНЕЦ <> 0
	                    |		ТОГДА ""Настройка сроков оплаты""
	                    |	ИНАЧЕ НЕОПРЕДЕЛЕНО
	                    |КОНЕЦ");
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();

	ПараметрыЗапроса.Вставить("ИспользуютсяСрокиОплатыПокупателей", ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейОтПокупателей"));
	ПараметрыЗапроса.Вставить("ВидыДоговоровПокупателей",  БухгалтерскиеОтчеты.ВидыДоговоровПокупателей());
	ПараметрыЗапроса.Вставить("СрокОплатыПокупателей", Константы.СрокОплатыПокупателей.Получить());
	ПараметрыЗапроса.Вставить("ИспользуютсяСрокиОплатыПоставщикам", ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейПоставщикам"));
	ПараметрыЗапроса.Вставить("ВидыДоговоровПоставщиков", БухгалтерскиеОтчеты.ВидыДоговоровПоставщиков());
	ПараметрыЗапроса.Вставить("СрокОплатыПоставщикам", Константы.СрокОплатыПоставщикам.Получить());
	
КонецПроцедуры

// Устанавливает последовательность полей в запросе
//
// Возвращаемое значение:
//  Строка
//
Функция ШаблонТекстаЗапросаРасчеты() Экспорт
	
	Возврат
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет,
	|	НЕОПРЕДЕЛЕНО КАК Субконто1,
	|	НЕОПРЕДЕЛЕНО КАК Субконто2,
	|	НЕОПРЕДЕЛЕНО КАК Субконто3,
	|	0 КАК ОстатокБУ,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРегистратора,
	|	ЛОЖЬ КАК ЕстьДокументРасчетов,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашенияБУ,
	|	НЕОПРЕДЕЛЕНО КАК ИсточникСрокаПогашения
	|ПОМЕСТИТЬ ИмяТаблицыРасчеты
	|ГДЕ
	|	ЛОЖЬ";
	
КонецФункции

// Определяет наборы параметров счетов, которые участвуют в динамическом формировании запроса, используемый для классификации задолженности
//
// Параметры:
//  ВидЗадолженности - ПеречислениеСсылка.ВидыЗадолженности
//  СписокВидовСубконто - см.СписокВидовСубконто
//
// Возвращаемое значение:
//  см. НовыйНаборыСчетов
//
Функция НаборыСчетовКлассификацииЗадолженности(ВидЗадолженности, СписокВидовСубконто) Экспорт
	
	НаборыСчетов = НовыйНаборыСчетов();
	
	СчетаНалогов = СчетаНалогов();
	СчетаСоциальногоСтрахования = СчетаСоциальногоСтрахования();
	
	ВидСчетаЗадолженности = ВидСчета.Активный;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		ВидСчетаЗадолженности = ВидСчета.Пассивный;
	КонецЕсли;

	ИмяВТ = "РасчетыСКонтрагентамиПоДоговорам";
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаКонтрагентыДоговорыДокументы", СписокВидовСубконто, "СубконтоКонтрагентыДоговорыДокументы");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаКонтрагентыДоговоры", СписокВидовСубконто, "СубконтоКонтрагентыДоговоры");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
		СтрокаНабора.СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ВекселяПолученные); // 62.03
	КонецЕсли;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		СтрокаНабора.СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ВекселяВыданные); // 60.03
	КонецЕсли;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаКонтрагентыДоговоры", СписокВидовСубконто, "СубконтоКонтрагентыДоговоры");
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыНДСНалоговогоАгента)); // 76.НА
	КонецЕсли;
	
	ИмяВТ = "АПРасчетыПоДокументамРасчетов";
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаКонтрагентыДоговорыДокументы", СписокВидовСубконто, "СубконтоКонтрагентыДоговорыДокументы");
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;

	ИмяВТ = "РасчетыПрочие";
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаКонтрагенты", СписокВидовСубконто, "СубконтоКонтрагенты");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаКонтрагентыЦенныеБумаги", СписокВидовСубконто, "СубконтоКонтрагентыЦенныеБумаги");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаКонтрагентыДоговорыЦенныеБумаги", СписокВидовСубконто, "СубконтоКонтрагентыДоговорыЦенныеБумаги");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;

	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаКонтрагенты", СписокВидовСубконто, "СубконтоКонтрагенты");
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаУчредители", СписокВидовСубконто, "СубконтоУчредители");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;

	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаРаботники", СписокВидовСубконто, "СубконтоРаботники");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаРаботники", СписокВидовСубконто, "СубконтоРаботники");
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаБезУчетаАналитики", СписокВидовСубконто);
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаНалогов.СчетаБезДетализации); // 68 пассивный
	КонецЕсли;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаБезУчетаАналитики", СписокВидовСубконто);
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	Если ЗаполнениеБухгалтерскойОтчетности.УчетНа70ВедетсяСводно() Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)); // 70
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаНалогов.СчетаАПБезДетализации); // 68 без учета субконто
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаСоциальногоСтрахования.СчетаАПБезДетализации); // 69 без учета субконто
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаСвернутоеСальдо", СписокВидовСубконто);
	СтрокаНабора.ДополнитьСчетами = Ложь;
	СтрокаНабора.УчитыватьСостояниеРасчетов = Ложь;
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоИсполнительнымДокументамРаботников)); // 76.41
	КонецЕсли;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаВидыПлатежей", СписокВидовСубконто, "СубконтоВидыПлатежей");
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	СтрокаНабора.ДополнитьСчетами = Ложь;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаНалогов.СчетаПоВидамПлатежей); // 68 по видам платежей
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаСоциальногоСтрахования.СчетаПоВидамПлатежей); // 69 по видам платежей
	
	Возврат НаборыСчетов;
	
КонецФункции

// Определяет наборы параметров счетов, которые участвуют в динамическом формировании запроса, используемый для расшифровки классификации задолженности.
// Счет может быть отнесен только к одному набору. В случае, если счет соответствует критериям нескольких наборов, ему присваивается тот, который содержит наибольшее количество субконто.
//
// Параметры:
//  ВидЗадолженности - ПеречислениеСсылка.ВидыЗадолженности
//  СписокВидовСубконто - см.СписокВидовСубконто
//  УчитыватьДокументыРасчетов - Булево - Истина, когда необходимо рассчитать остатки с детализацией до документов расчетов
//
// Возвращаемое значение:
//  см. НовыйНаборыСчетов
//
Функция НаборыСчетовРазвернуто(ВидЗадолженности, СписокВидовСубконто, УчитыватьДокументыРасчетов = Ложь) Экспорт
	
	НаборыСчетов = НовыйНаборыСчетов();
	
	СчетаНалогов = СчетаНалогов();
	СчетаСоциальногоСтрахования = СчетаСоциальногоСтрахования();
	
	Префикс = "";
	ВидСчетаЗадолженности = ВидСчета.Активный;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
		Префикс = "ДЗ";
		ВидСчетаЗадолженности = ВидСчета.Активный;
	ИначеЕсли ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		Префикс = "КЗ";
		ВидСчетаЗадолженности = ВидСчета.Пассивный;
	КонецЕсли;
	
	ИмяВТ = "РасчетыСКонтрагентамиПоДоговорам";
	Если УчитыватьДокументыРасчетов Тогда
		СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("СчетаКонтрагентыДоговорыДокументы%1", Префикс), СписокВидовСубконто, "СубконтоКонтрагентыДоговорыДокументы");
		СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	КонецЕсли;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("СчетаКонтрагентыДоговоры%1", Префикс), СписокВидовСубконто, "СубконтоКонтрагентыДоговоры");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
		СтрокаНабора.СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ВекселяПолученные); // 62.03
	КонецЕсли;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		СтрокаНабора.СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ВекселяВыданные); // 60.03
	КонецЕсли;

	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("АПСчетаКонтрагентыДоговоры%1", Префикс), СписокВидовСубконто, "СубконтоКонтрагентыДоговоры");
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыНДСНалоговогоАгента)); // 76.НА
	КонецЕсли;
	
	// Авансы выданные
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
		ИмяВТ = "Авансы";
		СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("СчетаКонтрагентыДоговорыДокументыПоВидамАктива%1", Префикс), СписокВидовСубконто, "СубконтоКонтрагентыДоговорыДокументы");
		СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
		СтрокаНабора.ДополнитьСчетами = Ложь;
		СтрокаНабора.ВидСчета = ВидСчета.Активный;
		СтрокаНабора.СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным); // 60.02
		СтрокаНабора.СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымВал); // 60.22
		СтрокаНабора.СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымУЕ);    // 60.32
	КонецЕсли;
	
	ИмяВТ = "РасчетыПрочие";
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("СчетаКонтрагенты%1", Префикс), СписокВидовСубконто, "СубконтоКонтрагенты");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;

	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("СчетаКонтрагентыЦенныеБумаги%1", Префикс), СписокВидовСубконто, "СубконтоКонтрагентыЦенныеБумаги");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ,  СтрШаблон("СчетаКонтрагентыДоговорыЦенныеБумаги%1", Префикс), СписокВидовСубконто, "СубконтоКонтрагентыДоговорыЦенныеБумаги");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("АПСчетаКонтрагенты%1", Префикс), СписокВидовСубконто, "СубконтоКонтрагенты");
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("СчетаУчредители%1", Префикс), СписокВидовСубконто, "СубконтоУчредители");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;

	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("СчетаРаботники%1", Префикс), СписокВидовСубконто, "СубконтоРаботники");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("АПСчетаРаботники%1", Префикс), СписокВидовСубконто, "СубконтоРаботники");
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("СчетаНазначениеЦСДоговоры%1", Префикс), СписокВидовСубконто, "СубконтоНазначениеЦСДоговоры");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;

	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("СчетаДоходыБПКонтрагентыДоговоры%1", Префикс), СписокВидовСубконто, "СубконтоДоходыБПКонтрагентыДоговоры");
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;

	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("СчетаБезУчетаАналитики%1", Префикс), СписокВидовСубконто);
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаНалогов.СчетаБезДетализации); // 68 пассивный
	КонецЕсли;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("АПСчетаБезУчетаАналитики%1", Префикс), СписокВидовСубконто);
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	Если ЗаполнениеБухгалтерскойОтчетности.УчетНа70ВедетсяСводно() Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)); // 70
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаНалогов.СчетаАПБезДетализации); // 68 без учета субконто
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаСоциальногоСтрахования.СчетаАПБезДетализации); // 69 без учета субконто
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("АПСчетаСвернутоеСальдо%1", Префикс), СписокВидовСубконто);
	СтрокаНабора.ДополнитьСчетами = Ложь;
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоИсполнительнымДокументамРаботников)); // 76.41
	КонецЕсли;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, СтрШаблон("АПСчетаВидыПлатежей%1", Префикс), СписокВидовСубконто, "СубконтоВидыПлатежей");
	СтрокаНабора.ДополнитьСчетами = Ложь;
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаНалогов.СчетаПоВидамПлатежей); // 68 по видам платежей
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаСоциальногоСтрахования.СчетаПоВидамПлатежей); // 69 по видам платежей
	
	Возврат НаборыСчетов;
КонецФункции

// Определяет наборы параметров счетов, которые участвуют в динамическом формировании запроса, используемый для заполнения баланса.
// Счет может быть отнесен только к одному набору. В случае, если счет соответствует критериям нескольких наборов, ему присваивается тот, который содержит наибольшее количество субконто.
//
// Параметры:
//  ВидЗадолженности - ПеречислениеСсылка.ВидыЗадолженности
//  СписокВидовСубконто - см.СписокВидовСубконто
//  ЭтоБаланс - Булево
//
// Возвращаемое значение:
//  см. НовыйНаборыСчетов
//
Функция НаборыСчетовБаланса(ВидЗадолженности, СписокВидовСубконто, ЭтоБаланс = Истина) Экспорт
	
	НаборыСчетов = НовыйНаборыСчетов();
	
	СчетаНалогов = СчетаНалогов();
	СчетаСоциальногоСтрахования = СчетаСоциальногоСтрахования();
	
	ВидСчетаЗадолженности = ВидСчета.Активный;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
		ВидСчетаЗадолженности = ВидСчета.Активный;
	ИначеЕсли ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		ВидСчетаЗадолженности = ВидСчета.Пассивный;
	КонецЕсли;
	
	ИмяВТ = "Расчеты";

	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаКонтрагентыДоговоры", СписокВидовСубконто, "СубконтоКонтрагентыДоговоры");
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыНДСНалоговогоАгента)); // 76.НА
	КонецЕсли;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ,"АПСчетаКонтрагенты", СписокВидовСубконто, "СубконтоКонтрагенты");
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаРаботники", СписокВидовСубконто, "СубконтоРаботники");
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;

	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаБезУчетаАналитики", СписокВидовСубконто);
	СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаНалогов.СчетаБезДетализации); // 68 пассивный
	КонецЕсли;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаБезУчетаАналитики", СписокВидовСубконто);
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	Если ЗаполнениеБухгалтерскойОтчетности.УчетНа70ВедетсяСводно() Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда)); // 70
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаНалогов.СчетаАПБезДетализации); // 68 без учета субконто
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаСоциальногоСтрахования.СчетаАПБезДетализации); // 69 без учета субконто
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаСвернутоеСальдо", СписокВидовСубконто);
	СтрокаНабора.ДополнитьСчетами = Ложь;
	СтрокаНабора.УчитыватьСостояниеРасчетов = Ложь;
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоИсполнительнымДокументамРаботников)); // 76.41
	КонецЕсли;
	
	СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "АПСчетаВидыПлатежей", СписокВидовСубконто, "СубконтоВидыПлатежей");
	СтрокаНабора.ДополнитьСчетами = Ложь;
	СтрокаНабора.ВидСчета = ВидСчета.АктивноПассивный;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаНалогов.СчетаПоВидамПлатежей); // 68 по видам платежей
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, СчетаСоциальногоСтрахования.СчетаПоВидамПлатежей); // 69 по видам платежей
	
	// Детализация по активным/пассивным счетам используется для расчета сальдированного оборота,
	// который отражается в пояснениях баланса по задолженности
	Если Не ЭтоБаланс Тогда
		СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаКонтрагентыДоговоры", СписокВидовСубконто, "СубконтоКонтрагентыДоговоры");
		СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;

		СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаКонтрагенты", СписокВидовСубконто, "СубконтоКонтрагенты");
		СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;

		СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаРаботники", СписокВидовСубконто, "СубконтоРаботники");
		СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
	КонецЕсли;
	
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
		
		ИмяВТ = "Авансы";
		СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаКонтрагентыДоговорыПоВидамАктива", СписокВидовСубконто, "СубконтоКонтрагентыДоговоры");
		СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
		СтрокаНабора.ДополнитьСчетами = Ложь;
		СтрокаНабора.ВидСчета = ВидСчета.Активный;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным)); // 60.02
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымВал)); // 60.22
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокаНабора.СписокСчетов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымУЕ));    // 60.32
		
		ИмяВТ = "РасчетыПоСтрахованию";
		СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаКонтрагентыРБПпоВидамАктива", СписокВидовСубконто, "СубконтоКонтрагентыРБП");
		СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;
		
		ИмяВТ = "РасходыБудущихПериодов";
		СтрокаНабора = ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, "СчетаРБПпоВидамАктива", СписокВидовСубконто, "СубконтоРасходыБудущихПериодов");
		СтрокаНабора.ВидСчета = ВидСчетаЗадолженности;

	КонецЕсли;
		
	Возврат НаборыСчетов;
КонецФункции

// Заполняет наборы счетами и формирует таблицу счетов
//
// Параметры:
//  НаборыСчетов - см. НовыйНаборыСчетов
//  СписокСчетов - Массив из ПланСчетовСсылка.Хозрасчетный
//  ТаблицаСчетов - см.НовыйТаблицаСчетов
//  ИсключитьВалютные -Булево
//  УчитыватьПорядокСубконто -Булево
//
Процедура ЗаполнитьНаборыСчетами(НаборыСчетов, СписокСчетов, ТаблицаСчетов = Неопределено, ИсключитьВалютные = Ложь, УчитыватьПорядокСубконто = Ложь) Экспорт
	
	ИспользуетсяВалютныйУчет = БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет();
	
	СчетаСУказаннымНабором = Новый ТаблицаЗначений;
	СчетаСУказаннымНабором.Колонки.Добавить("ИмяНабора", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	СчетаСУказаннымНабором.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	// Список счетов из таблицы НаборыСчетов перенесем в таблицу СчетаСУказаннымНабором,
	// из набора очистим список счетов.
	// Это необходимо, чтобы в наборе были только те счета, которые необходимы для дальнейшей обработки.
	// Например, если счет 70 не указан в детализации инвентаризации расчетов 
	// и для него нет необходимости получать дату возникновения, тогда его совсем не обрабатываем
	Для Каждого Набор Из НаборыСчетов Цикл
		Для Каждого Счет Из Набор.СписокСчетов Цикл
			СтрокаТаблицы = СчетаСУказаннымНабором.Добавить();
			СтрокаТаблицы.ИмяНабора = Набор.ИмяНабора;
			СтрокаТаблицы.Счет = Счет;
		КонецЦикла;
		Набор.СписокСчетов.Очистить();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаНаборыСчетов", НаборыСчетов);
	Запрос.УстановитьПараметр("СчетаСУказаннымНабором", СчетаСУказаннымНабором);
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаНаборыСчетов.ВидСчета КАК ВидСчета,
	|	ТаблицаНаборыСчетов.ИмяНабора КАК ИмяНабора,
	|	ТаблицаНаборыСчетов.ВидСубконто1 КАК ВидСубконто1,
	|	ТаблицаНаборыСчетов.ВидСубконто2 КАК ВидСубконто2,
	|	ТаблицаНаборыСчетов.ВидСубконто3 КАК ВидСубконто3,
	|	ТаблицаНаборыСчетов.КоличествоСубконто КАК КоличествоСубконто,
	|	ТаблицаНаборыСчетов.ДополнитьСчетами КАК ДополнитьСчетами
	|ПОМЕСТИТЬ НаборыСчетов
	|ИЗ
	|	&ТаблицаНаборыСчетов КАК ТаблицаНаборыСчетов
	|ГДЕ
	|	ТаблицаНаборыСчетов.ДополнитьСчетами
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаСУказаннымНабором.ИмяНабора КАК ИмяНабора,
	|	СчетаСУказаннымНабором.Счет КАК Счет
	|ПОМЕСТИТЬ ПрисвоенныеКНаборам
	|ИЗ
	|	&СчетаСУказаннымНабором КАК СчетаСУказаннымНабором
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланСчетовХозрасчетный.Ссылка КАК Счет,
	|	ПланСчетовХозрасчетный.Код КАК Код,
	|	ПланСчетовХозрасчетный.Вид КАК ВидСчета,
	|	ПланСчетовХозрасчетный.Порядок КАК Порядок,
	|	ПланСчетовХозрасчетный.Валютный КАК Валютный
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК ПланСчетовХозрасчетный
	|ГДЕ
	|	ПланСчетовХозрасчетный.Ссылка В(&СписокСчетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланСчетовХозрасчетный.Ссылка,
	|	ПланСчетовХозрасчетный.Вид,
	|	ПланСчетовХозрасчетный.Код,
	|	ПланСчетовХозрасчетный.Порядок,
	|	ПланСчетовХозрасчетный.Валютный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счета.Счет КАК Счет,
	|	Счета.ВидСчета КАК ВидСчета,
	|	ХозрасчетныйВидыСубконто.ВидСубконто КАК ВидСубконто,
	|	ХозрасчетныйВидыСубконто.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ СчетаСубконто
	|ИЗ
	|	Счета КАК Счета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|		ПО Счета.Счет = ХозрасчетныйВидыСубконто.Ссылка
	|ГДЕ
	|	НЕ ХозрасчетныйВидыСубконто.ТолькоОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидСчета,
	|	ВидСубконто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаСубконто.Счет КАК Счет
	|ПОМЕСТИТЬ СчетаЕстьВидыСубконто
	|ИЗ
	|	СчетаСубконто КАК СчетаСубконто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборыСчетов.ИмяНабора КАК ИмяНабора,
	|	СчетаСубконто.Счет КАК Счет,
	|	СУММА(1) КАК КоличествоСовпадающихСубконто
	|ПОМЕСТИТЬ СчетаВсеНаборы
	|ИЗ
	|	СчетаСубконто КАК СчетаСубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборыСчетов КАК НаборыСчетов
	|		ПО СчетаСубконто.ВидСчета = НаборыСчетов.ВидСчета
	|			И (СчетаСубконто.ВидСубконто = НаборыСчетов.ВидСубконто1
	|					И &УчитыватьПорядок1
	|				ИЛИ СчетаСубконто.ВидСубконто = НаборыСчетов.ВидСубконто2
	|					И &УчитыватьПорядок2
	|				ИЛИ СчетаСубконто.ВидСубконто = НаборыСчетов.ВидСубконто3
	|					И &УчитыватьПорядок3)
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборыСчетов.ИмяНабора,
	|	СчетаСубконто.Счет
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) = МАКСИМУМ(НаборыСчетов.КоличествоСубконто)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаВсеНаборы.Счет КАК Счет,
	|	СчетаВсеНаборы.КоличествоСовпадающихСубконто КАК КоличествоСовпадающихСубконто,
	|	МАКСИМУМ(СчетаВсеНаборы.ИмяНабора) КАК ИмяНабора
	|ПОМЕСТИТЬ СчетаНаборы
	|ИЗ
	|	СчетаВсеНаборы КАК СчетаВсеНаборы
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаВсеНаборы.Счет,
	|	СчетаВсеНаборы.КоличествоСовпадающихСубконто
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаНаборы.Счет КАК Счет,
	|	МАКСИМУМ(СчетаНаборы.КоличествоСовпадающихСубконто) КАК КоличествоСубконто
	|ПОМЕСТИТЬ МаксимальноеКоличествоСубконто
	|ИЗ
	|	СчетаНаборы КАК СчетаНаборы
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаНаборы.Счет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаНаборы.ИмяНабора КАК ИмяНабора,
	|	СчетаНаборы.Счет КАК Счет,
	|	ИСТИНА КАК СчетСДетализацией
	|ПОМЕСТИТЬ НайденныеНаборы
	|ИЗ
	|	СчетаНаборы КАК СчетаНаборы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальноеКоличествоСубконто КАК МаксимальноеКоличествоСубконто
	|		ПО СчетаНаборы.Счет = МаксимальноеКоличествоСубконто.Счет
	|			И СчетаНаборы.КоличествоСовпадающихСубконто = МаксимальноеКоличествоСубконто.КоличествоСубконто
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаборыСчетов.ИмяНабора,
	|	Счета.Счет,
	|	СчетаЕстьВидыСубконто.Счет ЕСТЬ NULL
	|ИЗ
	|	Счета КАК Счета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборыСчетов КАК НаборыСчетов
	|		ПО Счета.ВидСчета = НаборыСчетов.ВидСчета
	|			И (НаборыСчетов.КоличествоСубконто = 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаНаборы КАК СчетаНаборы
	|		ПО Счета.Счет = СчетаНаборы.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаЕстьВидыСубконто КАК СчетаЕстьВидыСубконто
	|		ПО Счета.Счет = СчетаЕстьВидыСубконто.Счет
	|ГДЕ
	|	СчетаНаборы.Счет ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ПрисвоенныеКНаборам.Счет ЕСТЬ NULL
	|			ТОГДА ПрисвоенныеКНаборам.ИмяНабора
	|		ИНАЧЕ НайденныеНаборы.ИмяНабора
	|	КОНЕЦ КАК ИмяНабора,
	|	НЕ НайденныеНаборы.СчетСДетализацией
	|		И ПрисвоенныеКНаборам.Счет ЕСТЬ NULL КАК ИсключитьИзНабора,
	|	НайденныеНаборы.Счет КАК Счет,
	|	Счета.Код КАК Код,
	|	Счета.Порядок КАК Порядок,
	|	Счета.Валютный КАК Валютный
	|ИЗ
	|	НайденныеНаборы КАК НайденныеНаборы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПрисвоенныеКНаборам КАК ПрисвоенныеКНаборам
	|		ПО НайденныеНаборы.Счет = ПрисвоенныеКНаборам.Счет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Счета КАК Счета
	|		ПО НайденныеНаборы.Счет = Счета.Счет
	|ИТОГИ ПО
	|	ИмяНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НаборыСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СчетаСубконто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СчетаНаборы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимальноеКоличествоСубконто";
	
	Если УчитыватьПорядокСубконто Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УчитыватьПорядок1", "СчетаСубконто.НомерСтроки = 1");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УчитыватьПорядок2", "СчетаСубконто.НомерСтроки = 2");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УчитыватьПорядок3", "СчетаСубконто.НомерСтроки = 3");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УчитыватьПорядок1", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УчитыватьПорядок2", "ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УчитыватьПорядок3", "ИСТИНА");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаНабор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЗаполнитьТаблицуСчетов = ТаблицаСчетов <> Неопределено;
	
	Пока ВыборкаНабор.Следующий() Цикл
		
		// по отбору должна быть найдена одна строка
		СтрокаНаборы = НаборыСчетов.Найти(ВыборкаНабор.ИмяНабора, "ИмяНабора");
		// теоретически, не должно быть случая, когда СтрокаНаборы = Неопределено,
		// но для предотвращения потенциальных ошибок добавлена соответствующая проверка.
		Если СтрокаНаборы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ВыборкаСчет = ВыборкаНабор.Выбрать();
		Пока ВыборкаСчет.Следующий() Цикл
			Если ИсключитьВалютные И Не ИспользуетсяВалютныйУчет И ВыборкаСчет.Валютный Тогда
				Продолжить;
			КонецЕсли;
			
			// при классификации задолженности в закрытии месяца исключаются счета, которые не определены по видам субконто или не предопределены заранее
			Если УчитыватьПорядокСубконто И ВыборкаСчет.ИсключитьИзНабора Тогда
				Продолжить;
			КонецЕсли;

			СтрокаНаборы.СписокСчетов.Добавить(ВыборкаСчет.Счет);
			Если ЗаполнитьТаблицуСчетов Тогда
				СтрокаСчет = ТаблицаСчетов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСчет, ВыборкаСчет, "Счет, Код, Порядок");
				ЗаполнитьЗначенияСвойств(СтрокаСчет, СтрокаНаборы, "ВидСчета, ВидСубконто1, ВидСубконто2, ВидСубконто3, ИмяНабора, УчитыватьСостояниеРасчетов");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗаполнитьТаблицуСчетов Тогда
		ТаблицаСчетов.Сортировать("Порядок");
	КонецЕсли;

КонецПроцедуры

// Конструктор таблицы счетов
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция НовыйТаблицаСчетов() Экспорт

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Счет",             Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Таблица.Колонки.Добавить("ВидСчета",         Новый ОписаниеТипов("ВидСчета"));
	Таблица.Колонки.Добавить("Код",              ОбщегоНазначения.ОписаниеТипаСтрока(Метаданные.ПланыСчетов.Хозрасчетный.ДлинаКода));
	Таблица.Колонки.Добавить("Порядок",          ОбщегоНазначения.ОписаниеТипаСтрока(Метаданные.ПланыСчетов.Хозрасчетный.ДлинаПорядка));
	Таблица.Колонки.Добавить("ИмяНабора",        ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Таблица.Колонки.Добавить("ВидСубконто1",     Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные"));
	Таблица.Колонки.Добавить("ВидСубконто2",     Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные"));
	Таблица.Колонки.Добавить("ВидСубконто3",     Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные"));
	Таблица.Колонки.Добавить("КодГруппы",        ОбщегоНазначения.ОписаниеТипаСтрока(10));
	Таблица.Колонки.Добавить("УчитыватьСостояниеРасчетов", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Долгосрочный", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ЭтоСчетАренды", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ЭтоКорректирующийСчет", Новый ОписаниеТипов("Булево")); // например, НДС с авансов, резервы по сомнительным долгам
	
	Возврат Таблица;
		
КонецФункции

// Формирует временную таблицу счетов с необходимой детализацией
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  ТаблицаСчетов - см. НовыйТаблицаСчетов
//  ИмяВременнойТаблицы - Строка
//
Процедура СоздатьВременныеТаблицыСчетов(МенеджерВременныхТаблиц, ТаблицаСчетов, ИмяВременнойТаблицы = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаСчетов", ТаблицаСчетов);

	Запрос.УстановитьПараметр("СчетаДолгосрочныеПоУмолчанию", СчетаДолгосрочныеПоУмолчанию());
	
	// Разделение по видам активов применяется только к счету 60, как и в балансе
	СчетаУчетаАвансов = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаУчетаАвансов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаУчетаАвансов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымВал));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаУчетаАвансов, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымУЕ));

	Запрос.УстановитьПараметр("СчетаУчетаАвансовВыданных", СчетаУчетаАвансов);
	Запрос.УстановитьПараметр("СчетОбъектовРезервов", СчетаОбъектовРезервов());
	Запрос.УстановитьПараметр("СчетаУчетаРБП", СчетаУчетаРБП());
	Запрос.УстановитьПараметр("СчетаУчетаНМА", БухгалтерскийУчет.СчетаУчетаНазначенияИспользованияНМА());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаСчетов.Счет КАК Счет,
	|	ТаблицаСчетов.Код КАК Код,
	|	ТаблицаСчетов.Порядок КАК Порядок,
	|	ТаблицаСчетов.ВидСчета КАК ВидСчета,
	|	ТаблицаСчетов.КодГруппы КАК КодГруппы,
	|	ТаблицаСчетов.ВидСубконто1 КАК ВидСубконто1,
	|	ТаблицаСчетов.ВидСубконто2 КАК ВидСубконто2,
	|	ТаблицаСчетов.ВидСубконто3 КАК ВидСубконто3,
	|	ТаблицаСчетов.УчитыватьСостояниеРасчетов КАК УчитыватьСостояниеРасчетов,
	|	ТаблицаСчетов.Счет В (&СчетаДолгосрочныеПоУмолчанию) КАК Долгосрочный,
	|	ТаблицаСчетов.ЭтоСчетАренды КАК ЭтоСчетАренды,
	|	ТаблицаСчетов.Счет В (&СчетаУчетаРБП) КАК ЭтоСчетРБП,
	|	ТаблицаСчетов.Счет В (&СчетаУчетаНМА) КАК ЭтоСчетНМА,
	|	ТаблицаСчетов.Счет В (&СчетаУчетаАвансовВыданных) КАК ЭтоСчетАвансов,
	|	ТаблицаСчетов.Счет В (&СчетОбъектовРезервов) КАК ЭтоСчетОбъектовРезервов,
	|	ТаблицаСчетов.ЭтоКорректирующийСчет КАК ЭтоКорректирующийСчет
	|ПОМЕСТИТЬ СчетаПоВидамНаборов
	|ИЗ
	|	&ТаблицаСчетов КАК ТаблицаСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счета.Счет КАК Счет,
	|	Счета.Код КАК Код,
	|	Счета.Порядок КАК Порядок,
	|	Счета.ВидСчета КАК ВидСчета,
	|	Счета.КодГруппы КАК КодГруппы,
	|	Счета.УчитыватьСостояниеРасчетов КАК УчитыватьСостояниеРасчетов,
	|	Счета.Долгосрочный КАК Долгосрочный,
	|	Счета.ЭтоСчетАренды КАК ЭтоСчетАренды,
	|	Счета.ЭтоСчетРБП КАК ЭтоСчетРБП,
	|	Счета.ЭтоСчетНМА КАК ЭтоСчетНМА,
	|	Счета.ЭтоСчетАвансов КАК ЭтоСчетАвансов,
	|	Счета.ЭтоСчетОбъектовРезервов КАК ЭтоСчетОбъектовРезервов,
	|	Счета.ЭтоКорректирующийСчет КАК ЭтоКорректирующийСчет,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВидыСубконто.НомерСтроки = 1
	|					И (ВидыСубконто.ВидСубконто = Счета.ВидСубконто1
	|						ИЛИ ВидыСубконто.ВидСубконто = Счета.ВидСубконто2
	|						ИЛИ ВидыСубконто.ВидСубконто = Счета.ВидСубконто3)
	|				ТОГДА ВидыСубконто.ВидСубконто
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|		КОНЕЦ) КАК ВидСубконто1,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВидыСубконто.НомерСтроки = 2
	|					И (ВидыСубконто.ВидСубконто = Счета.ВидСубконто1
	|						ИЛИ ВидыСубконто.ВидСубконто = Счета.ВидСубконто2
	|						ИЛИ ВидыСубконто.ВидСубконто = Счета.ВидСубконто3)
	|				ТОГДА ВидыСубконто.ВидСубконто
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|		КОНЕЦ) КАК ВидСубконто2,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВидыСубконто.НомерСтроки = 3
	|					И (ВидыСубконто.ВидСубконто = Счета.ВидСубконто1
	|						ИЛИ ВидыСубконто.ВидСубконто = Счета.ВидСубконто2
	|						ИЛИ ВидыСубконто.ВидСубконто = Счета.ВидСубконто3)
	|				ТОГДА ВидыСубконто.ВидСубконто
	|			ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|		КОНЕЦ) КАК ВидСубконто3
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	СчетаПоВидамНаборов КАК Счета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидыСубконто
	|		ПО Счета.Счет = ВидыСубконто.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Счета.Счет,
	|	Счета.Код,
	|	Счета.Порядок,
	|	Счета.ВидСчета,
	|	Счета.КодГруппы,
	|	Счета.УчитыватьСостояниеРасчетов,
	|	Счета.Долгосрочный,
	|	Счета.ЭтоСчетАренды,
	|	Счета.ЭтоСчетРБП,
	|	Счета.ЭтоСчетНМА,
	|	Счета.ЭтоСчетАвансов,
	|	Счета.ЭтоСчетОбъектовРезервов,
	|	Счета.ЭтоКорректирующийСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СчетаПоВидамНаборов";
	
	Если Не ПустаяСтрока(ИмяВременнойТаблицы) Тогда
		ТочкаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(ТекстЗапроса, "Счета");
		ТочкаЗапроса.Запрос.ТаблицаДляПомещения = ИмяВременнойТаблицы;
		ТекстЗапроса = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует временную таблицу остатков задолженности по бухгалтерскому учету
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  Период - Дата, МоментВремениСУточнениемПериода
//  Организации - Массив из СправочникСсылка.Организации
//  СчетаРасчетов - Массив из ПланСчетовСсылка.Хозрасчетный
//  ИмяВременнойТаблицы - Строка
//
Процедура СоздатьВременныеТаблицыЗадолженностиОстаткиБУ(МенеджерВременныхТаблиц, Период, Организации, СчетаРасчетов, ИмяВременнойТаблицы = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("Период", Новый Граница(Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетаРасчетов", СчетаРасчетов);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто1) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто2) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто3,
	|	ХозрасчетныйОстатки.СуммаОстаток КАК Остаток,
	|	ХозрасчетныйОстатки.СуммаОстатокДт КАК ОстатокДт,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК ОстатокКт
	|ПОМЕСТИТЬ ОстаткиБУ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&СчетаРасчетов), , Организация В (&Организации)) КАК ХозрасчетныйОстатки";

	Если Не ПустаяСтрока(ИмяВременнойТаблицы) Тогда
		ТочкаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(ТекстЗапроса, "ОстаткиБУ");
		ТочкаЗапроса.Запрос.ТаблицаДляПомещения = ИмяВременнойТаблицы;
		ТекстЗапроса = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
КонецПроцедуры

// Возвращает текст запроса по остаткам бухгалтерского учета по переданным наборам счетов
//
// Параметры:
//  НаборыСчетов - см. НовыйНаборыСчетов
//  КонтекстЗапроса - см.НовыйКонтекстЗапросаОстаткиЗадолженности
//  ВидЗадолженности - ПеречислениеСсылка.ВидыЗадолженности
//
// Возвращаемое значение:
//  Строка
//
Функция ТекстЗапросаОстаткиЗадолженности(НаборыСчетов, КонтекстЗапроса, ВидЗадолженности) Экспорт
	
	СхемаЗапроса = Новый СхемаЗапроса;
	
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто1) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто2) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто3,
	|	ХозрасчетныйОстатки.СуммаОстатокДт КАК ОстатокДт,
	|	ХозрасчетныйОстатки.СуммаОстатокКт КАК ОстатокКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&СписокСчетов), &ВидыСубконто, Организация В (&Организации)) КАК ХозрасчетныйОстатки";
	
	ЗапросЭталон = СхемаЗапроса.ПакетЗапросов[0];
	ЗапросЭталон.УстановитьТекстЗапроса(ШаблонТекстаЗапроса);

	Для Каждого Набор Из НаборыСчетов Цикл
		
		Если Не ЗначениеЗаполнено(Набор.СписокСчетов) Тогда
			Продолжить;
		КонецЕсли;
		
		ТочкаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(СхемаЗапроса, Набор.ИмяВТ);
		Если ТочкаЗапроса = Неопределено Тогда
			
			ОписаниеЗапроса = СхемаЗапроса.ПакетЗапросов.Добавить();
			
			ОписаниеЗапроса.УстановитьТекстЗапроса(ШаблонТекстаЗапроса);
			ОписаниеЗапроса.ТаблицаДляПомещения = Набор.ИмяВТ;
			Оператор = ОписаниеЗапроса.Операторы.Добавить(ЗапросЭталон.Операторы[0]);
			Источник = Оператор.Источники[0];
			
			ТочкаЗапроса = СхемыЗапросов.НовыйТочкаЗапроса(СхемаЗапроса, ОписаниеЗапроса, Оператор, Источник);
			
			КонтекстЗапроса.ВременныеТаблицы.Добавить(Набор.ИмяВТ);
			
		Иначе
			ТочкаЗапроса.Вставить("Оператор", ТочкаЗапроса.Запрос.Операторы.Добавить(ЗапросЭталон.Операторы[0]));
			ТочкаЗапроса.Вставить("Источник", ТочкаЗапроса.Оператор.Источники[0]);
		КонецЕсли;
		
		УстановитьПараметрыИПоляОстатки(Набор, ТочкаЗапроса, ВидЗадолженности);
	КонецЦикла;
	
	// Удалим первый (эталонный) пакет запросов
	СхемаЗапроса.ПакетЗапросов.Удалить(0);
	// Удалим первый оператор
	Для Каждого ПакетЗапроса Из СхемаЗапроса.ПакетЗапросов Цикл
		ПакетЗапроса.Операторы.Удалить(0);
	КонецЦикла;
		
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

// Создает временные таблицы расчетов, распределенные по срокам, указанным в документе "ИнвентаризацияРасчетовСКонтрагентами"
//
// Параметры:
//  Запрос - Запрос
//  ТаблицаСчетов - см. НовыйТаблицаСчетов
//                - Неопределено
//
Процедура СоздатьВременныеТаблицыРаспределенныеДанныеПоИнвентаризацииРасчетов(Запрос, ТаблицаСчетов = Неопределено) Экспорт
	
	// Данные инвентаризации за последние два года сопоставляются с остатками БУ.
	// Находится жесткая связь по аналитике, то есть аналитика задолженности БУ с заданной детализацией должна полностью совпадать с аналитикой инвентаризации.
	// Отбираются все данные, которые сопоставлены с инвентаризацией. Остаток БУ распределяется согласно подтвержденным суммам и срокам(от самого дальнего срока к самому раннему).
	// Признак "ЗаписыватьВРегистр" устанавливается:
	// - для всех счетов, у которых указан источник срока погашения.
	// - для активно-пассивных счетов, если есть документ расчетов и заполнена дата погашения.
	
	СоздатьВременныеТаблицыИнвентаризацияРасчетовДетализация(Запрос, ТаблицаСчетов);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнвентаризацияРасчетов.Организация КАК Организация,
	|	ИнвентаризацияРасчетов.СчетРасчетов КАК СчетРасчетов,
	|	ИнвентаризацияРасчетов.Субконто1 КАК Субконто1,
	|	ИнвентаризацияРасчетов.Субконто2 КАК Субконто2,
	|	ИнвентаризацияРасчетов.Субконто3 КАК Субконто3
	|ПОМЕСТИТЬ СовпадающаяАналитика
	|ИЗ
	|	ИнвентаризацияРасчетов КАК ИнвентаризацияРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнвентаризацияРасчетов.Организация,
	|	ИнвентаризацияРасчетов.СчетРасчетов,
	|	ИнвентаризацияРасчетов.Субконто1,
	|	ИнвентаризацияРасчетов.Субконто2,
	|	ИнвентаризацияРасчетов.Субконто3
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СчетРасчетов,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.Организация КАК Организация,
	|	Расчеты.Счет КАК Счет,
	|	Расчеты.Субконто1 КАК Субконто1,
	|	Расчеты.Субконто2 КАК Субконто2,
	|	Расчеты.Субконто3 КАК Субконто3,
	|	Расчеты.ДатаРегистратора КАК ДатаРегистратора,
	|	Расчеты.ДатаПогашенияБУ КАК ДатаПогашенияБУ,
	|	Расчеты.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|	Расчеты.ЕстьДокументРасчетов
	|			И СчетаНаборов.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|			И Расчеты.ДатаПогашенияБУ <> ДАТАВРЕМЯ(1, 1, 1)
	|		ИЛИ Расчеты.ИсточникСрокаПогашения <> НЕОПРЕДЕЛЕНО
	|		ИЛИ Расчеты.ДатаПогашенияБУ >= &ДатаНачалаДолгосрочногоПериода
	|		ИЛИ ИнвентаризацияРасчетов.Организация ЕСТЬ НЕ NULL  КАК ЗаписыватьВРегистр,
	|	Расчеты.ЕстьДокументРасчетов КАК ЕстьДокументРасчетов,
	|	Расчеты.ОстатокБУ КАК ОстатокБУ,
	|	ЕСТЬNULL(ИнвентаризацияРасчетов.Подтверждено, 0) КАК Подтверждено,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияРасчетов.Организация ЕСТЬ НЕ NULL 
	|				И СовпадающаяАналитика.Организация ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА Расчеты.ОстатокБУ < ЕСТЬNULL(ИнвентаризацияРасчетов.Подтверждено, 0)
	|						ТОГДА Расчеты.ОстатокБУ
	|					ИНАЧЕ ИнвентаризацияРасчетов.Подтверждено
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПодтвержденоОстатокБУ,
	|	ВЫБОР
	|		КОГДА Расчеты.ОстатокБУ < ЕСТЬNULL(ИнвентаризацияРасчетов.Подтверждено, 0)
	|			ТОГДА 0
	|		ИНАЧЕ Расчеты.ОстатокБУ - ЕСТЬNULL(ИнвентаризацияРасчетов.Подтверждено, 0)
	|	КОНЕЦ КАК НеПодтвержденоОстатокБУ,
	|	ЕСТЬNULL(ИнвентаризацияРасчетов.Субконто1, НЕОПРЕДЕЛЕНО) КАК Субконто1Инвентаризация,
	|	ЕСТЬNULL(ИнвентаризацияРасчетов.Субконто2, НЕОПРЕДЕЛЕНО) КАК Субконто2Инвентаризация,
	|	ЕСТЬNULL(ИнвентаризацияРасчетов.Субконто3, НЕОПРЕДЕЛЕНО) КАК Субконто3Инвентаризация,
	|	ЕСТЬNULL(ИнвентаризацияРасчетов.ДатаВозникновения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВозникновенияИнвентаризация,
	|	ЕСТЬNULL(ИнвентаризацияРасчетов.ДатаПогашения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПогашенияИнвентаризация,
	|	ЕСТЬNULL(ИнвентаризацияРасчетов.Ссылка, ЗНАЧЕНИЕ(Документ.ИнвентаризацияРасчетовСКонтрагентами.ПустаяСсылка)) КАК ДокументИнвентаризации,
	|	ИнвентаризацияРасчетов.Организация ЕСТЬ НЕ NULL  КАК ПоИнвентаризацииРасчетов,
	|	СовпадающаяАналитика.Организация ЕСТЬ НЕ NULL  КАК СовпадающиеЗаписи
	|ПОМЕСТИТЬ РасчетыСУчетомИнвентаризации
	|ИЗ
	|	Расчеты КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИнвентаризацияРасчетов КАК ИнвентаризацияРасчетов
	|			ЛЕВОЕ СОЕДИНЕНИЕ СовпадающаяАналитика КАК СовпадающаяАналитика
	|			ПО ИнвентаризацияРасчетов.Организация = СовпадающаяАналитика.Организация
	|				И ИнвентаризацияРасчетов.СчетРасчетов = СовпадающаяАналитика.СчетРасчетов
	|				И ИнвентаризацияРасчетов.Субконто1 = СовпадающаяАналитика.Субконто1
	|				И ИнвентаризацияРасчетов.Субконто2 = СовпадающаяАналитика.Субконто2
	|				И ИнвентаризацияРасчетов.Субконто3 = СовпадающаяАналитика.Субконто3
	|		ПО Расчеты.Организация = ИнвентаризацияРасчетов.Организация
	|			И Расчеты.Счет = ИнвентаризацияРасчетов.СчетРасчетов
	|			И Расчеты.Субконто1 = ИнвентаризацияРасчетов.Субконто1
	|			И Расчеты.Субконто2 = ИнвентаризацияРасчетов.Субконто2
	|			И Расчеты.Субконто3 = ИнвентаризацияРасчетов.Субконто3
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаНаборов КАК СчетаНаборов
	|		ПО Расчеты.Счет = СчетаНаборов.Счет
	|ГДЕ
	|	(НЕ Расчеты.Счет В (&СчетаИсключитьБезДатыПогашения)
	|			ИЛИ ИнвентаризацияРасчетов.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСУчетомИнвентаризации.Организация КАК Организация,
	|	РасчетыСУчетомИнвентаризации.Счет КАК Счет,
	|	РасчетыСУчетомИнвентаризации.Субконто1 КАК Субконто1,
	|	РасчетыСУчетомИнвентаризации.Субконто2 КАК Субконто2,
	|	РасчетыСУчетомИнвентаризации.Субконто3 КАК Субконто3,
	|	РасчетыСУчетомИнвентаризации.ДатаРегистратора КАК ДатаРегистратора,
	|	РасчетыСУчетомИнвентаризации.ДатаПогашенияБУ КАК ДатаПогашенияБУ,
	|	РасчетыСУчетомИнвентаризации.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|	РасчетыСУчетомИнвентаризации.ЗаписыватьВРегистр КАК ЗаписыватьВРегистр,
	|	РасчетыСУчетомИнвентаризации.ОстатокБУ КАК ОстатокБУ,
	|	РасчетыСУчетомИнвентаризации.Подтверждено КАК Подтверждено,
	|	РасчетыСУчетомИнвентаризации.ДатаВозникновенияИнвентаризация КАК ДатаВозникновенияИнвентаризация,
	|	РасчетыСУчетомИнвентаризации.ДатаПогашенияИнвентаризация КАК ДатаПогашенияИнвентаризация,
	|	РасчетыСУчетомИнвентаризации.ДокументИнвентаризации КАК ДокументИнвентаризации
	|ИЗ
	|	РасчетыСУчетомИнвентаризации КАК РасчетыСУчетомИнвентаризации
	|ГДЕ
	|	РасчетыСУчетомИнвентаризации.СовпадающиеЗаписи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСУчетомИнвентаризации.Организация,
	|	РасчетыСУчетомИнвентаризации.Счет,
	|	РасчетыСУчетомИнвентаризации.Субконто1,
	|	РасчетыСУчетомИнвентаризации.Субконто2,
	|	РасчетыСУчетомИнвентаризации.Субконто3,
	|	РасчетыСУчетомИнвентаризации.ДатаРегистратора,
	|	РасчетыСУчетомИнвентаризации.ДатаПогашенияБУ,
	|	РасчетыСУчетомИнвентаризации.ИсточникСрокаПогашения,
	|	РасчетыСУчетомИнвентаризации.ЗаписыватьВРегистр,
	|	РасчетыСУчетомИнвентаризации.ОстатокБУ,
	|	РасчетыСУчетомИнвентаризации.Подтверждено,
	|	РасчетыСУчетомИнвентаризации.ДатаВозникновенияИнвентаризация,
	|	РасчетыСУчетомИнвентаризации.ДатаПогашенияИнвентаризация,
	|	РасчетыСУчетомИнвентаризации.ДокументИнвентаризации
	|ИЗ
	|	РасчетыСУчетомИнвентаризации КАК РасчетыСУчетомИнвентаризации
	|ГДЕ
	|	РасчетыСУчетомИнвентаризации.ПоИнвентаризацииРасчетов
	|	И РасчетыСУчетомИнвентаризации.НеПодтвержденоОстатокБУ <> 0
	|	И НЕ РасчетыСУчетомИнвентаризации.СовпадающиеЗаписи
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	РасчетыСУчетомИнвентаризации.ДатаВозникновенияИнвентаризация УБЫВ,
	|	РасчетыСУчетомИнвентаризации.ДатаПогашенияИнвентаризация УБЫВ";
	
	ДанныеРаспределения = Запрос.Выполнить().Выгрузить();
	
	// Таблица, в которую будут добавлены строки с расcчитанными величинами
	ТаблицаРасчетная = ДанныеРаспределения.СкопироватьКолонки("Организация, Счет, Субконто1, Субконто2, Субконто3");
	ТаблицаРасчетная.Колонки.Добавить("ДатаВозникновения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаРасчетная.Колонки.Добавить("ДатаПогашения",     ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаРасчетная.Колонки.Добавить("ИсточникСрокаПогашения", Новый ОписаниеТипов(ТипыИсточниковСроковПогашения()));
	ТаблицаРасчетная.Колонки.Добавить("ЗаписыватьВРегистр", Новый ОписаниеТипов("Булево"));
	ТаблицаРасчетная.Колонки.Добавить("СуммаРасчетная",    БухгалтерскийУчетКлиентСервер.ТипСумма());
	
	ПересчитатьОстаткиСовпадающейАналитикиВИнвентаризацииРасчетов(ТаблицаРасчетная, ДанныеРаспределения);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаРасчетная.Организация КАК Организация,
	|	ТаблицаРасчетная.Счет КАК Счет,
	|	ТаблицаРасчетная.Субконто1 КАК Субконто1,
	|	ТаблицаРасчетная.Субконто2 КАК Субконто2,
	|	ТаблицаРасчетная.Субконто3 КАК Субконто3,
	|	ТаблицаРасчетная.ДатаВозникновения КАК ДатаВозникновения,
	|	ТаблицаРасчетная.ДатаПогашения КАК ДатаПогашения,
	|	ТаблицаРасчетная.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|	ТаблицаРасчетная.ЗаписыватьВРегистр КАК ЗаписыватьВРегистр,
	|	ТаблицаРасчетная.СуммаРасчетная КАК СуммаРасчетная
	|ПОМЕСТИТЬ РаспределенныеДанные
	|ИЗ
	|	&ТаблицаРасчетная КАК ТаблицаРасчетная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСУчетомИнвентаризации.Организация КАК Организация,
	|	РасчетыСУчетомИнвентаризации.Счет КАК Счет,
	|	РасчетыСУчетомИнвентаризации.Субконто1 КАК Субконто1,
	|	РасчетыСУчетомИнвентаризации.Субконто2 КАК Субконто2,
	|	РасчетыСУчетомИнвентаризации.Субконто3 КАК Субконто3,
	|	РасчетыСУчетомИнвентаризации.ДатаРегистратора КАК ДатаВозникновения,
	|	РасчетыСУчетомИнвентаризации.ДатаПогашенияБУ КАК ДатаПогашения,
	|	РасчетыСУчетомИнвентаризации.ДатаРегистратора = ДАТАВРЕМЯ(1, 1, 1)
	|		И РасчетыСУчетомИнвентаризации.ДатаПогашенияБУ <> ДАТАВРЕМЯ(1, 1, 1) КАК НайтиДатуВозникновения,
	|	РасчетыСУчетомИнвентаризации.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|	РасчетыСУчетомИнвентаризации.ЗаписыватьВРегистр КАК ЗаписыватьВРегистр,
	|	РасчетыСУчетомИнвентаризации.ОстатокБУ КАК ОстатокДолга
	|ПОМЕСТИТЬ РасчетыПоСрокамПогашения
	|ИЗ
	|	РасчетыСУчетомИнвентаризации КАК РасчетыСУчетомИнвентаризации
	|ГДЕ
	|	НЕ РасчетыСУчетомИнвентаризации.ПоИнвентаризацииРасчетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСУчетомИнвентаризации.Организация,
	|	РасчетыСУчетомИнвентаризации.Счет,
	|	РасчетыСУчетомИнвентаризации.Субконто1,
	|	РасчетыСУчетомИнвентаризации.Субконто2,
	|	РасчетыСУчетомИнвентаризации.Субконто3,
	|	РасчетыСУчетомИнвентаризации.ДатаВозникновенияИнвентаризация,
	|	РасчетыСУчетомИнвентаризации.ДатаПогашенияИнвентаризация,
	|	РасчетыСУчетомИнвентаризации.ДатаВозникновенияИнвентаризация = ДАТАВРЕМЯ(1, 1, 1)
	|		И РасчетыСУчетомИнвентаризации.ДатаПогашенияИнвентаризация <> ДАТАВРЕМЯ(1, 1, 1),
	|	ВЫБОР
	|		КОГДА РасчетыСУчетомИнвентаризации.ПоИнвентаризацииРасчетов
	|			ТОГДА РасчетыСУчетомИнвентаризации.ДокументИнвентаризации
	|		ИНАЧЕ РасчетыСУчетомИнвентаризации.ИсточникСрокаПогашения
	|	КОНЕЦ,
	|	РасчетыСУчетомИнвентаризации.ЗаписыватьВРегистр,
	|	РасчетыСУчетомИнвентаризации.ОстатокБУ
	|ИЗ
	|	РасчетыСУчетомИнвентаризации КАК РасчетыСУчетомИнвентаризации
	|ГДЕ
	|	РасчетыСУчетомИнвентаризации.ПодтвержденоОстатокБУ <> 0
	|	И РасчетыСУчетомИнвентаризации.НеПодтвержденоОстатокБУ = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределенныеДанные.Организация,
	|	РаспределенныеДанные.Счет,
	|	РаспределенныеДанные.Субконто1,
	|	РаспределенныеДанные.Субконто2,
	|	РаспределенныеДанные.Субконто3,
	|	РаспределенныеДанные.ДатаВозникновения,
	|	РаспределенныеДанные.ДатаПогашения,
	|	РаспределенныеДанные.ДатаВозникновения = ДАТАВРЕМЯ(1, 1, 1),
	|	РаспределенныеДанные.ИсточникСрокаПогашения,
	|	РаспределенныеДанные.ЗаписыватьВРегистр,
	|	РаспределенныеДанные.СуммаРасчетная
	|ИЗ
	|	РаспределенныеДанные КАК РаспределенныеДанные
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СовпадающаяАналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РаспределенныеДанные";
	
	Запрос.УстановитьПараметр("ТаблицаРасчетная", ТаблицаРасчетная);
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует текст запроса по остаткам по счетам дебиторской задолженности с учетом сроков
//
// Возвращаемое значение:
//  Строка - текст запроса
//
Функция ТекстЗапросаКлассифицированныеОстаткиДебиторскойЗадолженности() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Организация КАК Организация,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамРасходовБудущихПериодов.Субконто1) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ КлассификацияПоСрокамРасходовБудущихПериодов.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамРасходовБудущихПериодов.Субконто2) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ КлассификацияПоСрокамРасходовБудущихПериодов.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамРасходовБудущихПериодов.Субконто3) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ КлассификацияПоСрокамРасходовБудущихПериодов.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.СуммаКраткосрочная КАК СуммаКраткосрочная,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.СуммаДолгосрочная КАК СуммаДолгосрочная
	|ПОМЕСТИТЬ КлассификацияРасходовБудущихПериодовПоСрочности
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамРасходовБудущихПериодов КАК КлассификацияПоСрокамРасходовБудущихПериодов
	|ГДЕ
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Активность
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.Организация В(&Организации)
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.Счет В(&СчетаРасчетовДебиторскойЗадолженности)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация КАК Организация,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто1) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто2) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|					И ТИПЗНАЧЕНИЯ(КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто3) В (&ТипыДокументовРасчетов)
	|				ИЛИ УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто3) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаВозникновения КАК ДатаВозникновения,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаПогашения КАК ДатаПогашения,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ОстатокДолга КАК ОстатокДолга,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.РезервПоСомнительнымДолгам КАК РезервПоСомнительнымДолгам,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.НДСАвансов КАК НДСАвансов,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.УровеньДетализации КАК УровеньДетализации,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения
	|ПОМЕСТИТЬ КлассификацияЗадолженности
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамОтдельныхВидовЗадолженности КАК КлассификацияПоСрокамОтдельныхВидовЗадолженности
	|ГДЕ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Активность
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация В(&Организации)
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ВидЗадолженности = &ВидЗадолженностиДебиторская
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет В (&СчетаРасчетовДебиторскойЗадолженности, &СчетаРезервов, &СчетаНДСАвансовВыданных)
	|	И ВЫБОР
	|			КОГДА КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет В (&СчетаУчетаАвансовВыданных)
	|					И &РазделятьАвансыПоВидамАктивов
	|					И ВЫРАЗИТЬ(КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВидАктива В (&ИсключаемыеВидыАктивовАвансов)
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазницаВеличин.Организация КАК Организация,
	|	РазницаВеличин.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	МАКСИМУМ(РазницаВеличин.ДатаВозникновения) КАК ДатаВозникновения,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|					ТОГДА ВЫБОР
	|							КОГДА СУММА(РазницаВеличин.ОстатокДт) > СУММА(РазницаВеличин.ОстатокКт)
	|								ТОГДА СУММА(РазницаВеличин.ОстатокДт) - СУММА(РазницаВеличин.ОстатокКт)
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ СУММА(РазницаВеличин.ОстатокДт)
	|			КОНЕЦ < 0
	|			ТОГДА ВЫБОР
	|					КОГДА Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|						ТОГДА ВЫБОР
	|								КОГДА СУММА(РазницаВеличин.ОстатокДт) > СУММА(РазницаВеличин.ОстатокКт)
	|									ТОГДА СУММА(РазницаВеличин.ОстатокДт) - СУММА(РазницаВеличин.ОстатокКт)
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					ИНАЧЕ СУММА(РазницаВеличин.ОстатокДт)
	|				КОНЕЦ
	|		КОГДА ВЫБОР
	|				КОГДА Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|					ТОГДА ВЫБОР
	|							КОГДА СУММА(РазницаВеличин.ОстатокДт) > СУММА(РазницаВеличин.ОстатокКт)
	|								ТОГДА СУММА(РазницаВеличин.ОстатокДт) - СУММА(РазницаВеличин.ОстатокКт)
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ СУММА(РазницаВеличин.ОстатокДт)
	|			КОНЕЦ > СУММА(РазницаВеличин.ОстатокРаспределенный)
	|			ТОГДА ВЫБОР
	|					КОГДА Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|						ТОГДА ВЫБОР
	|								КОГДА СУММА(РазницаВеличин.ОстатокДт) > СУММА(РазницаВеличин.ОстатокКт)
	|									ТОГДА СУММА(РазницаВеличин.ОстатокДт) - СУММА(РазницаВеличин.ОстатокКт)
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					ИНАЧЕ СУММА(РазницаВеличин.ОстатокДт)
	|				КОНЕЦ - СУММА(РазницаВеличин.ОстатокРаспределенный)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокБУ
	|ПОМЕСТИТЬ ДолгБУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиБУ.Организация КАК Организация,
	|		ОстаткиБУ.Счет КАК Счет,
	|		ОстаткиБУ.Субконто1 КАК Субконто1,
	|		ОстаткиБУ.Субконто2 КАК Субконто2,
	|		ОстаткиБУ.Субконто3 КАК Субконто3,
	|		ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВозникновения,
	|		ОстаткиБУ.ОстатокДт КАК ОстатокДт,
	|		ОстаткиБУ.ОстатокКт КАК ОстатокКт,
	|		0 КАК ОстатокРаспределенный
	|	ИЗ
	|		ОстаткиБУ КАК ОстаткиБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|			ПО ОстаткиБУ.Организация = ДанныеПервичныхДокументов.Организация
	|				И ОстаткиБУ.Субконто3 = ДанныеПервичныхДокументов.Документ
	|	ГДЕ
	|		ОстаткиБУ.Счет В(&СчетаРасчетовСПокупателями)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиБУ.Организация,
	|		ОстаткиБУ.Счет,
	|		ОстаткиБУ.Субконто1,
	|		ОстаткиБУ.Субконто2,
	|		ОстаткиБУ.Субконто3,
	|		ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)),
	|		ОстаткиБУ.ОстатокДт,
	|		ОстаткиБУ.ОстатокКт,
	|		0
	|	ИЗ
	|		ОстаткиБУ КАК ОстаткиБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|			ПО ОстаткиБУ.Организация = ДанныеПервичныхДокументов.Организация
	|				И ОстаткиБУ.Субконто3 = ДанныеПервичныхДокументов.Документ
	|	ГДЕ
	|		ОстаткиБУ.Счет В(&СчетаУчетаАвансовВыданных)
	|		И ВЫБОР
	|				КОГДА &РазделятьАвансыПоВидамАктивов
	|						И ВЫРАЗИТЬ(ОстаткиБУ.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВидАктива В (&ИсключаемыеВидыАктивовАвансов)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиБУ.Организация,
	|		ОстаткиБУ.Счет,
	|		ОстаткиБУ.Субконто1,
	|		ОстаткиБУ.Субконто2,
	|		ОстаткиБУ.Субконто3,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		ОстаткиБУ.ОстатокДт,
	|		ОстаткиБУ.ОстатокКт,
	|		0
	|	ИЗ
	|		ОстаткиБУ КАК ОстаткиБУ
	|	ГДЕ
	|		ОстаткиБУ.Счет В(&СчетаПрочиеДебиторскойЗадолженности)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет,
	|		КлассификацияЗадолженности.Субконто1,
	|		КлассификацияЗадолженности.Субконто2,
	|		КлассификацияЗадолженности.Субконто3,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		0,
	|		0,
	|		СУММА(КлассификацияЗадолженности.ОстатокДолга)
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет,
	|		КлассификацияЗадолженности.Субконто1,
	|		КлассификацияЗадолженности.Субконто2,
	|		КлассификацияЗадолженности.Субконто3) КАК РазницаВеличин
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДебиторскойЗадолженности КАК Счета
	|		ПО РазницаВеличин.Счет = Счета.Счет
	|
	|СГРУППИРОВАТЬ ПО
	|	РазницаВеличин.Организация,
	|	РазницаВеличин.Счет,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто3
	|	КОНЕЦ,
	|	Счета.ВидСчета,
	|	Счета.ВидСубконто1,
	|	Счета.ВидСубконто2,
	|	Счета.ВидСубконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Дебиторская) КАК ВидЗадолженности,
	|	Расчеты.Организация КАК Организация,
	|	Расчеты.Счет КАК СчетРасчетов,
	|	Хозрасчетный.Наименование КАК СчетНаименование,
	|	Расчеты.Субконто1 КАК Субконто1Задолженности,
	|	Расчеты.Субконто2 КАК Субконто2Задолженности,
	|	Расчеты.Субконто3 КАК Субконто3Задолженности,
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаВозникновения, ДЕНЬ) КАК ДатаВозникновенияЗадолженности,
	|	Расчеты.ДатаПогашения КАК ДатаПогашенияЗадолженности,
	|	Расчеты.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода КАК Долгосрочный,
	|	СУММА(Расчеты.ОстатокДолга) КАК ОстатокДолга,
	|	СУММА(Расчеты.РезервПоСомнительнымДолгам) КАК РезервПоСомнительнымДолгам,
	|	СУММА(Расчеты.НДСАвансов) КАК НДСАвансов,
	|	МАКСИМУМ(Расчеты.ИсточникСрокаПогашения) КАК ИсточникСрокаПогашения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДолгБУ.Организация КАК Организация,
	|		ДолгБУ.Счет КАК Счет,
	|		ДолгБУ.Субконто1 КАК Субконто1,
	|		ДолгБУ.Субконто2 КАК Субконто2,
	|		ДолгБУ.Субконто3 КАК Субконто3,
	|		ДолгБУ.ДатаВозникновения КАК ДатаВозникновения,
	|		ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашения,
	|		ДолгБУ.ОстатокБУ КАК ОстатокДолга,
	|		0 КАК РезервПоСомнительнымДолгам,
	|		0 КАК НДСАвансов,
	|		НЕОПРЕДЕЛЕНО КАК ИсточникСрокаПогашения
	|	ИЗ
	|		ДолгБУ КАК ДолгБУ
	|	ГДЕ
	|		ДолгБУ.ОстатокБУ <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет,
	|		КлассификацияЗадолженности.Субконто1,
	|		КлассификацияЗадолженности.Субконто2,
	|		КлассификацияЗадолженности.Субконто3,
	|		КлассификацияЗадолженности.ДатаВозникновения,
	|		КлассификацияЗадолженности.ДатаПогашения,
	|		КлассификацияЗадолженности.ОстатокДолга,
	|		КлассификацияЗадолженности.РезервПоСомнительнымДолгам,
	|		КлассификацияЗадолженности.НДСАвансов,
	|		КлассификацияЗадолженности.ИсточникСрокаПогашения
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияПоСрокамРасходовБудущихПериодов.Организация,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.Счет,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.Субконто1,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.Субконто2,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.Субконто3,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.ДатаНачалаСписания,
	|		ВЫБОР
	|			КОГДА КлассификацияПоСрокамРасходовБудущихПериодов.ДатаОкончанияСписания >= &ДатаНачалаДолгосрочногоПериода
	|				ТОГДА ДОБАВИТЬКДАТЕ(&ДатаНачалаДолгосрочногоПериода, ДЕНЬ, -1)
	|			ИНАЧЕ КлассификацияПоСрокамРасходовБудущихПериодов.ДатаОкончанияСписания
	|		КОНЕЦ,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.СуммаКраткосрочная,
	|		0,
	|		0,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		КлассификацияРасходовБудущихПериодовПоСрочности КАК КлассификацияПоСрокамРасходовБудущихПериодов
	|	ГДЕ
	|		КлассификацияПоСрокамРасходовБудущихПериодов.СуммаКраткосрочная <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияПоСрокамРасходовБудущихПериодов.Организация,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.Счет,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.Субконто1,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.Субконто2,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.Субконто3,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.ДатаНачалаСписания,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.ДатаОкончанияСписания,
	|		КлассификацияПоСрокамРасходовБудущихПериодов.СуммаДолгосрочная,
	|		0,
	|		0,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		КлассификацияРасходовБудущихПериодовПоСрочности КАК КлассификацияПоСрокамРасходовБудущихПериодов
	|	ГДЕ
	|		КлассификацияПоСрокамРасходовБудущихПериодов.СуммаДолгосрочная <> 0) КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|		ПО Расчеты.Счет = Хозрасчетный.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Счет,
	|	Хозрасчетный.Наименование,
	|	Расчеты.Субконто1,
	|	Расчеты.Субконто2,
	|	Расчеты.Субконто3,
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаВозникновения, ДЕНЬ),
	|	Расчеты.ДатаПогашения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Расчеты.ДатаПогашения < &ДатаНачалаДолгосрочногоПериода, ЛОЖЬ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ";

	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует текст запроса по остаткам по счетам кредиторской задолженности с учетом сроков
//
// Возвращаемое значение:
//  Строка - текст запроса
//
Функция ТекстЗапросаКлассифицированныеОстаткиКредиторскойЗадолженности() Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация КАК Организация,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто1) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто2) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|				И ТИПЗНАЧЕНИЯ(КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто3) В (&ТипыДокументовРасчетов)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто3) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ КлассификацияПоСрокамОтдельныхВидовЗадолженности.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаВозникновения КАК ДатаВозникновения,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ДатаПогашения КАК ДатаПогашения,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ОстатокДолга КАК ОстатокДолга,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.НДСАвансов КАК НДСАвансов,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ПроцентыПоРассрочке КАК ПроцентыПоРассрочке,
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения
	|ПОМЕСТИТЬ КлассификацияЗадолженности
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамОтдельныхВидовЗадолженности КАК КлассификацияПоСрокамОтдельныхВидовЗадолженности
	|ГДЕ
	|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Активность
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация В(&Организации)
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Счет В (&СчетаРасчетовКредиторскойЗадолженности, &СчетаНДСАвансовПолученных, &СчетаПроцентовПоРассрочке)
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ВидЗадолженности = &ВидЗадолженностиКредиторская
	|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериодаДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлассификацияЗадолженности.Организация КАК Организация,
	|	КлассификацияЗадолженности.Субконто1 КАК Субконто1,
	|	КлассификацияЗадолженности.Субконто2 КАК Субконто2
	|ПОМЕСТИТЬ АналитикаРассрочки
	|ИЗ
	|	КлассификацияЗадолженности КАК КлассификацияЗадолженности
	|ГДЕ
	|	КлассификацияЗадолженности.ПроцентыПоРассрочке <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	КлассификацияЗадолженности.Организация,
	|	КлассификацияЗадолженности.Субконто1,
	|	КлассификацияЗадолженности.Субконто2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Субконто1,
	|	Субконто2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазницаВеличин.Организация КАК Организация,
	|	РазницаВеличин.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	МАКСИМУМ(РазницаВеличин.ДатаВозникновения) КАК ДатаВозникновения,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|					ТОГДА ВЫБОР
	|							КОГДА СУММА(РазницаВеличин.ОстатокДт) < СУММА(РазницаВеличин.ОстатокКт)
	|									ИЛИ НЕ Счета.УчитыватьСостояниеРасчетов
	|								ТОГДА СУММА(РазницаВеличин.ОстатокКт) - СУММА(РазницаВеличин.ОстатокДт)
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ СУММА(РазницаВеличин.ОстатокКт)
	|			КОНЕЦ < 0
	|			ТОГДА ВЫБОР
	|					КОГДА Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|						ТОГДА ВЫБОР
	|								КОГДА СУММА(РазницаВеличин.ОстатокДт) < СУММА(РазницаВеличин.ОстатокКт)
	|										ИЛИ НЕ Счета.УчитыватьСостояниеРасчетов
	|									ТОГДА СУММА(РазницаВеличин.ОстатокКт) - СУММА(РазницаВеличин.ОстатокДт)
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					ИНАЧЕ СУММА(РазницаВеличин.ОстатокКт)
	|				КОНЕЦ
	|		КОГДА ВЫБОР
	|				КОГДА Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|					ТОГДА ВЫБОР
	|							КОГДА СУММА(РазницаВеличин.ОстатокДт) < СУММА(РазницаВеличин.ОстатокКт)
	|									ИЛИ НЕ Счета.УчитыватьСостояниеРасчетов
	|								ТОГДА СУММА(РазницаВеличин.ОстатокКт) - СУММА(РазницаВеличин.ОстатокДт)
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ СУММА(РазницаВеличин.ОстатокКт)
	|			КОНЕЦ > СУММА(РазницаВеличин.ОстатокРаспределенный)
	|			ТОГДА ВЫБОР
	|					КОГДА Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|						ТОГДА ВЫБОР
	|								КОГДА СУММА(РазницаВеличин.ОстатокДт) < СУММА(РазницаВеличин.ОстатокКт)
	|									ТОГДА СУММА(РазницаВеличин.ОстатокКт) - СУММА(РазницаВеличин.ОстатокДт)
	|								ИНАЧЕ 0
	|							КОНЕЦ
	|					ИНАЧЕ СУММА(РазницаВеличин.ОстатокКт)
	|				КОНЕЦ - СУММА(РазницаВеличин.ОстатокРаспределенный)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокБУ
	|ПОМЕСТИТЬ ДолгБУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиБУ.Организация КАК Организация,
	|		ОстаткиБУ.Счет КАК Счет,
	|		ОстаткиБУ.Субконто1 КАК Субконто1,
	|		ОстаткиБУ.Субконто2 КАК Субконто2,
	|		ВЫБОР
	|			КОГДА НЕ АналитикаРассрочки.Организация ЕСТЬ NULL
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ ОстаткиБУ.Субконто3
	|		КОНЕЦ КАК Субконто3,
	|		ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВозникновения,
	|		ОстаткиБУ.ОстатокДт КАК ОстатокДт,
	|		ОстаткиБУ.ОстатокКт КАК ОстатокКт,
	|		0 КАК ОстатокРаспределенный
	|	ИЗ
	|		ОстаткиБУ КАК ОстаткиБУ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|			ПО ОстаткиБУ.Организация = ДанныеПервичныхДокументов.Организация
	|				И ОстаткиБУ.Субконто3 = ДанныеПервичныхДокументов.Документ
	|			ЛЕВОЕ СОЕДИНЕНИЕ АналитикаРассрочки КАК АналитикаРассрочки
	|			ПО ОстаткиБУ.Организация = АналитикаРассрочки.Организация
	|				И ОстаткиБУ.Субконто1 = АналитикаРассрочки.Субконто1
	|				И ОстаткиБУ.Субконто2 = АналитикаРассрочки.Субконто2
	|	ГДЕ
	|		ОстаткиБУ.Счет В (&СчетаРасчетовСПоставщиками, &СчетаУчетаАвансовПолученных)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиБУ.Организация,
	|		ОстаткиБУ.Счет,
	|		ОстаткиБУ.Субконто1,
	|		ОстаткиБУ.Субконто2,
	|		ОстаткиБУ.Субконто3,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		ОстаткиБУ.ОстатокДт,
	|		ОстаткиБУ.ОстатокКт,
	|		0
	|	ИЗ
	|		ОстаткиБУ КАК ОстаткиБУ
	|	ГДЕ
	|		ОстаткиБУ.Счет В(&СчетаПрочиеКредиторскойЗадолженности)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет,
	|		КлассификацияЗадолженности.Субконто1,
	|		КлассификацияЗадолженности.Субконто2,
	|		КлассификацияЗадолженности.Субконто3,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		0,
	|		0,
	|		СУММА(КлассификацияЗадолженности.ОстатокДолга)
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет,
	|		КлассификацияЗадолженности.Субконто1,
	|		КлассификацияЗадолженности.Субконто2,
	|		КлассификацияЗадолженности.Субконто3) КАК РазницаВеличин
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаКредиторскойЗадолженности КАК Счета
	|		ПО РазницаВеличин.Счет = Счета.Счет
	|
	|СГРУППИРОВАТЬ ПО
	|	РазницаВеличин.Организация,
	|	РазницаВеличин.Счет,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто2
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РазницаВеличин.Субконто3
	|	КОНЕЦ,
	|	Счета.ВидСчета,
	|	Счета.УчитыватьСостояниеРасчетов,
	|	Счета.ВидСубконто1,
	|	Счета.ВидСубконто2,
	|	Счета.ВидСубконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Кредиторская) КАК ВидЗадолженности,
	|	Расчеты.Организация КАК Организация,
	|	Расчеты.Счет КАК СчетРасчетов,
	|	Хозрасчетный.Наименование КАК СчетНаименование,
	|	Расчеты.Субконто1 КАК Субконто1Задолженности,
	|	Расчеты.Субконто2 КАК Субконто2Задолженности,
	|	Расчеты.Субконто3 КАК Субконто3Задолженности,
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаВозникновения, ДЕНЬ) КАК ДатаВозникновенияЗадолженности,
	|	Расчеты.ДатаПогашения КАК ДатаПогашенияЗадолженности,
	|	Расчеты.Счет В (&СчетаДолгосрочныеПоУмолчанию)
	|			И МАКСИМУМ(Расчеты.ДатаПогашения) = ДАТАВРЕМЯ(1, 1, 1)
	|		ИЛИ МАКСИМУМ(Расчеты.ДатаПогашения) >= &ДатаНачалаДолгосрочногоПериода КАК Долгосрочный,
	|	СУММА(Расчеты.ОстатокДолга) КАК ОстатокДолга,
	|	СУММА(Расчеты.НДСАвансов) КАК НДСАвансов,
	|	СУММА(Расчеты.ПроцентыПоРассрочке) КАК ПроцентыПоРассрочке,
	|	МАКСИМУМ(Расчеты.ИсточникСрокаПогашения) КАК ИсточникСрокаПогашения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДолгБУ.Организация КАК Организация,
	|		ДолгБУ.Счет КАК Счет,
	|		ДолгБУ.Субконто1 КАК Субконто1,
	|		ДолгБУ.Субконто2 КАК Субконто2,
	|		ДолгБУ.Субконто3 КАК Субконто3,
	|		ДолгБУ.ДатаВозникновения КАК ДатаВозникновения,
	|		ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашения,
	|		ДолгБУ.ОстатокБУ КАК ОстатокДолга,
	|		0 КАК НДСАвансов,
	|		0 КАК ПроцентыПоРассрочке,
	|		НЕОПРЕДЕЛЕНО КАК ИсточникСрокаПогашения
	|	ИЗ
	|		ДолгБУ КАК ДолгБУ
	|	ГДЕ
	|		ДолгБУ.ОстатокБУ <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КлассификацияЗадолженности.Организация,
	|		КлассификацияЗадолженности.Счет,
	|		КлассификацияЗадолженности.Субконто1,
	|		КлассификацияЗадолженности.Субконто2,
	|		КлассификацияЗадолженности.Субконто3,
	|		КлассификацияЗадолженности.ДатаВозникновения,
	|		КлассификацияЗадолженности.ДатаПогашения,
	|		КлассификацияЗадолженности.ОстатокДолга,
	|		КлассификацияЗадолженности.НДСАвансов,
	|		КлассификацияЗадолженности.ПроцентыПоРассрочке,
	|		КлассификацияЗадолженности.ИсточникСрокаПогашения
	|	ИЗ
	|		КлассификацияЗадолженности КАК КлассификацияЗадолженности) КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|		ПО Расчеты.Счет = Хозрасчетный.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Счет,
	|	Хозрасчетный.Наименование,
	|	Расчеты.Субконто1,
	|	Расчеты.Субконто2,
	|	Расчеты.Субконто3,
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаВозникновения, ДЕНЬ),
	|	Расчеты.ДатаПогашения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Расчеты.ДатаПогашения < &ДатаНачалаДолгосрочногоПериода, ЛОЖЬ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ";

	Возврат ТекстЗапроса;

КонецФункции

// Формирует временную таблицу задолженности по данным классификации задолженности по срокам
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  Период - Дата
//  Организации - Массив из СправочникСсылка.Организации
//  ВидЗадолженности - ПеречислениеСсылка.ВидыЗадолженности
//
Процедура СоздатьВременныеТаблицыЗадолженностьПоСрочности(МенеджерВременныхТаблиц, Период, Организации, ВидЗадолженности) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
	Запрос.УстановитьПараметр("ДатаНачалаДолгосрочногоПериода", КонецМесяца(ДобавитьМесяц(Период, 12)) + 1);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификацияПоСрокам.Организация КАК Организация,
	|	КлассификацияПоСрокам.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокам.Субконто1) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокам.Субконто1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокам.Субконто2) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокам.Субконто2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокам.Субконто3) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокам.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто3,
	|	ВЫБОР
	|		КОГДА КлассификацияПоСрокам.Субконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КлассификацияПоСрокам.Субконто1
	|		КОГДА КлассификацияПоСрокам.Субконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КлассификацияПоСрокам.Субконто2
	|		КОГДА КлассификацияПоСрокам.Субконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КлассификацияПоСрокам.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ КАК Договор,
	|	КлассификацияПоСрокам.ВидЗадолженности КАК ВидЗадолженности,
	|	КлассификацияПоСрокам.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода КАК БолееГода,
	|	КлассификацияПоСрокам.ДатаПогашения < &ДатаНачалаДолгосрочногоПериода КАК МенееГода,
	|	КлассификацияПоСрокам.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
	|		И КлассификацияПоСрокам.ДатаПогашения < &КонецПериода КАК Просроченная,
	|	СУММА(КлассификацияПоСрокам.ОстатокДолга) КАК ОстатокДолга,
	|	СУММА(КлассификацияПоСрокам.РезервПоСомнительнымДолгам) КАК РезервПоСомнительнымДолгам,
	|	СУММА(КлассификацияПоСрокам.НДСАвансов) КАК НДСАвансов,
	|	СУММА(КлассификацияПоСрокам.ПроцентыПоРассрочке) КАК ПроцентыПоРассрочке
	|ПОМЕСТИТЬ КлассификацияПоСрокамЗадолженности
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамОтдельныхВидовЗадолженности КАК КлассификацияПоСрокам
	|ГДЕ
	|	КлассификацияПоСрокам.Активность
	|	И КлассификацияПоСрокам.Организация В(&Организации)
	|	И КлассификацияПоСрокам.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлассификацияПоСрокам.ВидЗадолженности = &ВидЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	КлассификацияПоСрокам.Организация,
	|	КлассификацияПоСрокам.Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокам.Субконто1) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокам.Субконто1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокам.Субконто2) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокам.Субконто2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокам.Субконто3) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокам.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КлассификацияПоСрокам.Субконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КлассификацияПоСрокам.Субконто1
	|		КОГДА КлассификацияПоСрокам.Субконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КлассификацияПоСрокам.Субконто2
	|		КОГДА КлассификацияПоСрокам.Субконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА КлассификацияПоСрокам.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|	КОНЕЦ,
	|	КлассификацияПоСрокам.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода,
	|	КлассификацияПоСрокам.ДатаПогашения < &ДатаНачалаДолгосрочногоПериода,
	|	КлассификацияПоСрокам.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
	|		И КлассификацияПоСрокам.ДатаПогашения < &КонецПериода,
	|	КлассификацияПоСрокам.ВидЗадолженности";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует временную таблицу расходов будущих периодов по данным классификации задолженности по срокам
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  Период - Дата
//  Организации - Массив из СправочникСсылка.Организации
//
Процедура СоздатьВременныеТаблицыРасходыБудущихПериодовПоСрочности(МенеджерВременныхТаблиц, Период, Организации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Организация КАК Организация,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамРасходовБудущихПериодов.Субконто1) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамРасходовБудущихПериодов.Субконто2) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокамРасходовБудущихПериодов.Субконто3) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто3,
	|	ВЫБОР
	|		КОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто1
	|		КОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто2
	|		КОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА КлассификацияПоСрокамРасходовБудущихПериодов.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяРБП,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.ДатаОкончанияСписания < &КонецПериода КАК Просроченная,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.СуммаКраткосрочная КАК СуммаКраткосрочная,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.СуммаДолгосрочная КАК СуммаДолгосрочная,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	КлассификацияПоСрокамРасходовБудущихПериодов.ДатаОкончанияСписания КАК ДатаОкончанияСписания
	|ПОМЕСТИТЬ КлассификацияПоСрокамРБП
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамРасходовБудущихПериодов КАК КлассификацияПоСрокамРасходовБудущихПериодов
	|ГДЕ
	|	КлассификацияПоСрокамРасходовБудущихПериодов.Активность
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.Организация В(&Организации)
	|	И КлассификацияПоСрокамРасходовБудущихПериодов.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует временную таблицу остатков задолженности по расходам будущих периодов, классифицированных по срокам
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  Период - Дата, МоментВремениСУточнениемПериода
//  Организации - Массив из СправочникСсылка.Организации
//  СчетаРасчетов - Массив из ПланСчетовСсылка.Хозрасчетный
//  ИмяВременнойТаблицы - Строка
//  ЭтоБаланс - Ложь - формируется таблица с полной детализацей
//            - Истина - формируется таблица, сводная по счетам
//
Процедура СоздатьВременныеТаблицыКлассифицированныеРасходыБудущихПериодов(МенеджерВременныхТаблиц, Период, Организации, СчетаРасчетов, ИмяВременнойТаблицы, ЭтоБаланс = Истина) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период", Новый Граница(Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("СчетаРасчетов",СчетаРасчетов);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	ТекстыЗапросов = Новый Массив;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ОстаткиБУ") <> Неопределено Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ОстаткиБУ.Организация КАК Организация,
		|	ОстаткиБУ.Счет КАК Счет,
		|	ОстаткиБУ.Субконто1 КАК Субконто1,
		|	ОстаткиБУ.Субконто2 КАК Субконто2,
		|	ОстаткиБУ.Субконто3 КАК Субконто3,
		|	ВЫБОР
		|		КОГДА ОстаткиБУ.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ОстаткиБУ.Субконто1
		|		КОГДА ОстаткиБУ.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ОстаткиБУ.Субконто2
		|		КОГДА ОстаткиБУ.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ОстаткиБУ.Субконто3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
		|	КОНЕЦ КАК СтатьяРБП,
		|	ОстаткиБУ.ОстатокДт КАК Остаток,
		|	0 КАК ОстатокДолгосрочнойЧасти,
		|	0 КАК ОстатокПросроченнойЧасти
		|ПОМЕСТИТЬ ВТ_РБП
		|ИЗ
		|	ОстаткиБУ КАК ОстаткиБУ
		|ГДЕ
		|	ОстаткиБУ.Счет В(&СчетаРасчетов)";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Организация КАК Организация,
		|	ХозрасчетныйОстатки.Счет КАК Счет,
		|	ВЫБОР
		|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто1) <> &ПустойУникальныйИдентификатор
		|			ТОГДА ХозрасчетныйОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто1,
		|	ВЫБОР
		|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто2) <> &ПустойУникальныйИдентификатор
		|			ТОГДА ХозрасчетныйОстатки.Субконто2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто2,
		|	ВЫБОР
		|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) <> &ПустойУникальныйИдентификатор
		|			ТОГДА ХозрасчетныйОстатки.Субконто3
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто3,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ХозрасчетныйОстатки.Субконто1
		|		КОГДА ХозрасчетныйОстатки.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ХозрасчетныйОстатки.Субконто2
		|		КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ХозрасчетныйОстатки.Субконто3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
		|	КОНЕЦ КАК СтатьяРБП,
		|	ХозрасчетныйОстатки.СуммаОстаток КАК Остаток,
		|	0 КАК ОстатокДолгосрочнойЧасти,
		|	0 КАК ОстатокПросроченнойЧасти
		|ПОМЕСТИТЬ ВТ_РБП
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&СчетаРасчетов), , Организация В (&Организации)) КАК ХозрасчетныйОстатки";
	КонецЕсли;
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("КлассификацияПоСрокамРБП") <> Неопределено Тогда
		ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	КлассификацияПоСрокам.Организация КАК Организация,
		|	КлассификацияПоСрокам.Счет КАК Счет,
		|	КлассификацияПоСрокам.Субконто1 КАК Субконто1,
		|	КлассификацияПоСрокам.Субконто2 КАК Субконто2,
		|	КлассификацияПоСрокам.Субконто3 КАК Субконто3,
		|	КлассификацияПоСрокам.СтатьяРБП КАК СтатьяРБП,
		|	0 КАК Остаток,
		|	КлассификацияПоСрокам.СуммаДолгосрочная КАК ОстатокДолгосрочнойЧасти,
		|	ВЫБОР
		|		КОГДА КлассификацияПоСрокам.Просроченная
		|			ТОГДА КлассификацияПоСрокам.СуммаДолгосрочная + КлассификацияПоСрокам.СуммаКраткосрочная
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстатокПросроченнойЧасти
		|ИЗ
		|	КлассификацияПоСрокамРБП КАК КлассификацияПоСрокам
		|ГДЕ
		|	КлассификацияПоСрокам.СуммаДолгосрочная <> 0
		|	И КлассификацияПоСрокам.Счет В(&СчетаРасчетов)");
	КонецЕсли;

	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.ТекстОбъединитьВсе());

	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ВТ_РБП.Организация КАК Организация,
	|	ВТ_РБП.Счет КАК Счет,
	|	ВТ_РБП.Субконто1 КАК Субконто1,
	|	ВТ_РБП.Субконто2 КАК Субконто2,
	|	ВТ_РБП.Субконто3 КАК Субконто3,
	|	ВТ_РБП.СтатьяРБП КАК СтатьяРБП,
	|	ИСТИНА КАК Актив,
	|	СтатьиРБП.ВидАктива КАК ВидАктива,
	|	СУММА(ВТ_РБП.Остаток) КАК Остаток,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_РБП.ОстатокДолгосрочнойЧасти) < 0
	|				ИЛИ СУММА(ВТ_РБП.Остаток) < 0
	|			ТОГДА 0
	|		КОГДА СУММА(ВТ_РБП.ОстатокДолгосрочнойЧасти) < СУММА(ВТ_РБП.Остаток)
	|			ТОГДА СУММА(ВТ_РБП.ОстатокДолгосрочнойЧасти)
	|		ИНАЧЕ СУММА(ВТ_РБП.Остаток)
	|	КОНЕЦ КАК ОстатокДолгосрочнойЧасти,
	|	ВЫБОР
	|		КОГДА СУММА(ВТ_РБП.ОстатокПросроченнойЧасти) < 0
	|				ИЛИ СУММА(ВТ_РБП.Остаток) < 0
	|			ТОГДА 0
	|		КОГДА СУММА(ВТ_РБП.ОстатокПросроченнойЧасти) < СУММА(ВТ_РБП.Остаток)
	|			ТОГДА СУММА(ВТ_РБП.ОстатокПросроченнойЧасти)
	|		ИНАЧЕ СУММА(ВТ_РБП.Остаток)
	|	КОНЕЦ КАК ОстатокПросроченнойЧасти
	|ПОМЕСТИТЬ ВТ_РасчетныеСуммыРБП
	|ИЗ
	|	ВТ_РБП КАК ВТ_РБП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РасходыБудущихПериодов КАК СтатьиРБП
	|		ПО ВТ_РБП.СтатьяРБП = СтатьиРБП.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РБП.Организация,
	|	ВТ_РБП.Счет,
	|	ВТ_РБП.Субконто1,
	|	ВТ_РБП.Субконто2,
	|	ВТ_РБП.Субконто3,
	|	ВТ_РБП.СтатьяРБП,
	|	СтатьиРБП.ВидАктива");

	ИмяЗаменяемойТаблицы = "ВТ_РасчетныеСуммыРБП";
	
	Если ЭтоБаланс Тогда
		ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
		|	Данные.Организация КАК Организация,
		|	Данные.Счет КАК Счет,
		|	Данные.Актив КАК Актив,
		|	Данные.ВидАктива КАК РасходыБудущихПериодов,
		|	ЛОЖЬ КАК БолееГода,
		|	Данные.Сальдо КАК Сальдо
		|ПОМЕСТИТЬ РБП
		|ИЗ
		|	(ВЫБРАТЬ
		|		РБП.Организация КАК Организация,
		|		РБП.Счет КАК Счет,
		|		РБП.Актив КАК Актив,
		|		РБП.ВидАктива КАК ВидАктива,
		|		ЛОЖЬ КАК БолееГода,
		|		СУММА(РБП.Остаток) - СУММА(РБП.ОстатокДолгосрочнойЧасти) КАК Сальдо
		|	ИЗ
		|		ВТ_РасчетныеСуммыРБП КАК РБП
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РБП.Организация,
		|		РБП.Счет,
		|		РБП.Актив,
		|		РБП.ВидАктива
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(РБП.Остаток) - СУММА(РБП.ОстатокДолгосрочнойЧасти) <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РБП.Организация,
		|		РБП.Счет,
		|		РБП.Актив,
		|		РБП.ВидАктива,
		|		ИСТИНА,
		|		СУММА(РБП.ОстатокДолгосрочнойЧасти)
		|	ИЗ
		|		ВТ_РасчетныеСуммыРБП КАК РБП
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РБП.Организация,
		|		РБП.Счет,
		|		РБП.Актив,
		|		РБП.ВидАктива
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(РБП.ОстатокДолгосрочнойЧасти) <> 0) КАК Данные");
		
		ИмяЗаменяемойТаблицы = "РБП";
	КонецЕсли;

	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	ТочкаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(ТекстЗапроса, ИмяЗаменяемойТаблицы);
	ТочкаЗапроса.Запрос.ТаблицаДляПомещения = ИмяВременнойТаблицы;
	Запрос.Текст = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
	Запрос.Выполнить();
	
	ВременныеТаблицы = Новый Массив;
	ВременныеТаблицы.Добавить("ВТ_РБП");
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ВТ_РасчетныеСуммыРБП") <> Неопределено Тогда
		ВременныеТаблицы.Добавить("ВТ_РасчетныеСуммыРБП");
	КонецЕсли;
	
	ОбщегоНазначенияБП.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц, ВременныеТаблицы);
	
КонецПроцедуры

// Формирует временную таблицу остатков авансовых платежей, классифицированных по срокам
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  Период - Дата, МоментВремениСУточнениемПериода
//  Организации - Массив из СправочникСсылка.Организации
//  СчетаРасчетов - Массив из ПланСчетовСсылка.Хозрасчетный
//  ИмяВременнойТаблицы - Строка
//  ЭтоБаланс - Ложь - формируется таблица с полной детализацией
//            - Истина - формируется таблица, сводная по счетам
//
Процедура СоздатьВременныеТаблицыКлассифицированныеАвансыВыданные(МенеджерВременныхТаблиц, Период, Организации, СчетаРасчетов, ИмяВременнойТаблицы, ЭтоБаланс = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период", Новый Граница(Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("СчетаРасчетов", СчетаРасчетов);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	ТекстыЗапросов = Новый Массив;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ОстаткиБУ") <> Неопределено Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ОстаткиБУ.Организация КАК Организация,
		|	ОстаткиБУ.Счет КАК Счет,
		|	ОстаткиБУ.Субконто1 КАК Субконто1,
		|	ОстаткиБУ.Субконто2 КАК Субконто2,
		|	ОстаткиБУ.Субконто3 КАК Субконто3,
		|	ВЫБОР
		|		КОГДА ОстаткиБУ.Субконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ОстаткиБУ.Субконто1
		|		КОГДА ОстаткиБУ.Субконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ОстаткиБУ.Субконто2
		|		КОГДА ОстаткиБУ.Субконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ОстаткиБУ.Субконто3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|	КОНЕЦ КАК Договор,
		|	ОстаткиБУ.ОстатокДт КАК ОстатокДт,
		|	ОстаткиБУ.ОстатокКт КАК ОстатокКт,
		|	0 КАК ОстатокДолгосрочнойЧасти,
		|	0 КАК ОстатокПросроченнойЧасти
		|ПОМЕСТИТЬ ВТ_Авансы
		|ИЗ
		|	ОстаткиБУ КАК ОстаткиБУ
		|ГДЕ
		|	ОстаткиБУ.Счет В(&СчетаРасчетов)";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Организация КАК Организация,
		|	ХозрасчетныйОстатки.Счет КАК Счет,
		|	ВЫБОР
		|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто1) <> &ПустойУникальныйИдентификатор
		|			ТОГДА ХозрасчетныйОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто1,
		|	ВЫБОР
		|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто2) <> &ПустойУникальныйИдентификатор
		|			ТОГДА ХозрасчетныйОстатки.Субконто2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто2,
		|	ВЫБОР
		|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) <> &ПустойУникальныйИдентификатор
		|			ТОГДА ХозрасчетныйОстатки.Субконто3
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто3,
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.Субконто1 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ХозрасчетныйОстатки.Субконто1
		|		КОГДА ХозрасчетныйОстатки.Субконто2 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ХозрасчетныйОстатки.Субконто2
		|		КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Справочник.ДоговорыКонтрагентов
		|			ТОГДА ХозрасчетныйОстатки.Субконто3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|	КОНЕЦ КАК Договор,
		|	ХозрасчетныйОстатки.СуммаОстатокДт КАК ОстатокДт,
		|	ХозрасчетныйОстатки.СуммаОстатокКт КАК ОстатокКт,
		|	0 КАК ОстатокДолгосрочнойЧасти,
		|	0 КАК ОстатокПросроченнойЧасти
		|ПОМЕСТИТЬ ВТ_Авансы
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&СчетаРасчетов), , Организация В (&Организации)) КАК ХозрасчетныйОстатки";
		
	КонецЕсли;
	ТекстыЗапросов.Добавить(ТекстЗапроса);

	Если МенеджерВременныхТаблиц.Таблицы.Найти("КлассификацияПоСрокамЗадолженности") <> Неопределено Тогда
		ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	КлассификацияПоСрокам.Организация КАК Организация,
		|	КлассификацияПоСрокам.Счет КАК Счет,
		|	КлассификацияПоСрокам.Субконто1 КАК Субконто1,
		|	КлассификацияПоСрокам.Субконто2 КАК Субконто2,
		|	КлассификацияПоСрокам.Субконто3 КАК Субконто3,
		|	КлассификацияПоСрокам.Договор КАК Договор,
		|	0 КАК ОстатокДт,
		|	0 КАК ОстатокКт,
		|	ВЫБОР
		|		КОГДА КлассификацияПоСрокам.БолееГода
		|			ТОГДА КлассификацияПоСрокам.ОстатокДолга
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстатокДолгосрочнойЧасти,
		|	ВЫБОР
		|		КОГДА КлассификацияПоСрокам.Просроченная
		|			ТОГДА КлассификацияПоСрокам.ОстатокДолга
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстатокПросроченнойЧасти
		|ИЗ
		|	КлассификацияПоСрокамЗадолженности КАК КлассификацияПоСрокам
		|ГДЕ
		|	КлассификацияПоСрокам.Счет В(&СчетаРасчетов)");
	КонецЕсли;

	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.ТекстОбъединитьВсе());
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ВТ_Авансы.Организация КАК Организация,
	|	ВТ_Авансы.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_Авансы.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_Авансы.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА Счета.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_Авансы.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	ВТ_Авансы.Договор КАК Договор,
	|	Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|		ИЛИ Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|			И Счета.УчитыватьСостояниеРасчетов
	|			И СУММА(ВТ_Авансы.ОстатокДт) > СУММА(ВТ_Авансы.ОстатокКт) КАК Актив,
	|	ДоговорыКонтрагентов.ВидАктива КАК ВидАктива,
	|	ВЫБОР
	|		КОГДА Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|				ИЛИ Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|					И Счета.УчитыватьСостояниеРасчетов
	|					И СУММА(ВТ_Авансы.ОстатокДт) > СУММА(ВТ_Авансы.ОстатокКт)
	|			ТОГДА СУММА(ВТ_Авансы.ОстатокДт) - СУММА(ВТ_Авансы.ОстатокКт)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Остаток,
	|	ВЫБОР
	|		КОГДА Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(ВТ_Авансы.ОстатокДт) > СУММА(ВТ_Авансы.ОстатокКт)
	|						ТОГДА СУММА(ВТ_Авансы.ОстатокДт) - СУММА(ВТ_Авансы.ОстатокКт)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ СУММА(ВТ_Авансы.ОстатокДт)
	|	КОНЕЦ КАК ОстатокДт,
	|	ВЫБОР
	|		КОГДА Счета.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
	|			ТОГДА ВЫБОР
	|					КОГДА СУММА(ВТ_Авансы.ОстатокДт) < СУММА(ВТ_Авансы.ОстатокКт)
	|						ТОГДА СУММА(ВТ_Авансы.ОстатокКт) - СУММА(ВТ_Авансы.ОстатокДт)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ СУММА(ВТ_Авансы.ОстатокКт)
	|	КОНЕЦ КАК ОстатокКт,
	|	СУММА(ВТ_Авансы.ОстатокДолгосрочнойЧасти) КАК ОстатокДолгосрочнойЧасти,
	|	СУММА(ВТ_Авансы.ОстатокПросроченнойЧасти) КАК ОстатокПросроченнойЧасти
	|ПОМЕСТИТЬ ВТ_РасчетныеСуммыАвансов
	|ИЗ
	|	ВТ_Авансы КАК ВТ_Авансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Счета КАК Счета
	|		ПО ВТ_Авансы.Счет = Счета.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВТ_Авансы.Договор = ДоговорыКонтрагентов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Авансы.Организация,
	|	ВТ_Авансы.Счет,
	|	ВТ_Авансы.Субконто1,
	|	ВТ_Авансы.Субконто2,
	|	ВТ_Авансы.Субконто3,
	|	Счета.ВидСчета,
	|	Счета.ВидСубконто1,
	|	Счета.ВидСубконто2,
	|	Счета.ВидСубконто3,
	|	Счета.УчитыватьСостояниеРасчетов,
	|	ВТ_Авансы.Договор,
	|	ДоговорыКонтрагентов.ВидАктива");
	
	ИмяЗаменяемойТаблицы = "ВТ_РасчетныеСуммыАвансов";
	
	Если ЭтоБаланс Тогда
		ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
		|	Данные.Организация КАК Организация,
		|	Данные.Счет КАК Счет,
		|	Данные.Актив КАК Актив,
		|	Данные.ВидАктива КАК АвансыВыданные,
		|	ЛОЖЬ КАК БолееГода,
		|	Данные.Сальдо КАК Сальдо
		|ПОМЕСТИТЬ АвансыВыданные
		|ИЗ
		|	(ВЫБРАТЬ
		|		Авансы.Организация КАК Организация,
		|		Авансы.Счет КАК Счет,
		|		Авансы.Актив КАК Актив,
		|		Авансы.ВидАктива КАК ВидАктива,
		|		ЛОЖЬ КАК БолееГода,
		|		СУММА(Авансы.Остаток) - СУММА(Авансы.ОстатокДолгосрочнойЧасти) КАК Сальдо
		|	ИЗ
		|		ВТ_РасчетныеСуммыАвансов КАК Авансы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Авансы.Организация,
		|		Авансы.Счет,
		|		Авансы.Актив,
		|		Авансы.ВидАктива
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(Авансы.Остаток) - СУММА(Авансы.ОстатокДолгосрочнойЧасти) <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Авансы.Организация,
		|		Авансы.Счет,
		|		Авансы.Актив,
		|		Авансы.ВидАктива,
		|		ИСТИНА,
		|		СУММА(Авансы.ОстатокДолгосрочнойЧасти)
		|	ИЗ
		|		ВТ_РасчетныеСуммыАвансов КАК Авансы
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Авансы.Организация,
		|		Авансы.Счет,
		|		Авансы.Актив,
		|		Авансы.ВидАктива
		|	
		|	ИМЕЮЩИЕ
		|		СУММА(Авансы.ОстатокДолгосрочнойЧасти) <> 0) КАК Данные");
		
		ИмяЗаменяемойТаблицы = "АвансыВыданные";
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	ТочкаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(ТекстЗапроса, ИмяЗаменяемойТаблицы);
	ТочкаЗапроса.Запрос.ТаблицаДляПомещения = ИмяВременнойТаблицы;
	Запрос.Текст = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
	Запрос.Выполнить();
	
	ВременныеТаблицы = Новый Массив;
	ВременныеТаблицы.Добавить("ВТ_Авансы");
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ВТ_РасчетныеСуммыАвансов") <> Неопределено Тогда
		ВременныеТаблицы.Добавить("ВТ_РасчетныеСуммыАвансов");
	КонецЕсли;
	
	ОбщегоНазначенияБП.УничтожитьВременныеТаблицы(МенеджерВременныхТаблиц, ВременныеТаблицы);
	
КонецПроцедуры

// Формирует временную таблицу остатков арендных обязательств, классифицированных по срокам
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  Период - Дата
//  Организации - Массив из СправочникСсылка.Организации
//  СчетаРасчетов - Массив из ПланСчетовСсылка.Хозрасчетный
//  ИмяВременнойТаблицы - Строка
//  ЭтоБаланс - Ложь - формируется таблица с полной детализацией
//            - Истина - формируется сводная по счетам таблица
//
Процедура СоздатьВременныеТаблицыКлассифицированныеРасчетыПоАренде(МенеджерВременныхТаблиц, Период, Организации, СчетаРасчетов, ИмяВременнойТаблицы, ЭтоБаланс = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("СчетаРасчетов", СчетаРасчетов);
	Запрос.УстановитьПараметр("ДатаНачалаДолгосрочногоПериода", КонецМесяца(ДобавитьМесяц(Период, 12)) + 1);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КлассификацияПоСрокам.Организация КАК Организация,
	|	КлассификацияПоСрокам.Счет КАК СчетРасчетов,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокам.Субконто1) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокам.Субконто1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокам.Субконто2) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокам.Субконто2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КлассификацияПоСрокам.Субконто3) <> &ПустойУникальныйИдентификатор
	|			ТОГДА КлассификацияПоСрокам.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто3,
	|	СУММА(ВЫБОР
	|			КОГДА КлассификацияПоСрокам.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Дебиторская)
	|				ТОГДА КлассификацияПоСрокам.ОстатокДолга - КлассификацияПоСрокам.НДСАвансов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК АвансыПоАренде,
	|	СУММА(ВЫБОР
	|			КОГДА КлассификацияПоСрокам.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Кредиторская)
	|					И КлассификацияПоСрокам.ДатаПогашения < &ДатаНачалаДолгосрочногоПериода
	|				ТОГДА КлассификацияПоСрокам.ОстатокДолга
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КраткосрочноеОбязательство,
	|	СУММА(ВЫБОР
	|			КОГДА КлассификацияПоСрокам.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Кредиторская)
	|					И КлассификацияПоСрокам.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода
	|				ТОГДА КлассификацияПоСрокам.ОстатокДолга
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгосрочноеОбязательство,
	|	СУММА(ВЫБОР
	|			КОГДА КлассификацияПоСрокам.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Кредиторская)
	|				ТОГДА КлассификацияПоСрокам.ОстатокДолга
	|		КОНЕЦ) КАК Обязательство
	|ИЗ
	|	РегистрСведений.КлассификацияПоСрокамОтдельныхВидовЗадолженности КАК КлассификацияПоСрокам
	|ГДЕ
	|	КлассификацияПоСрокам.Активность
	|	И КлассификацияПоСрокам.Организация В(&Организации)
	|	И КлассификацияПоСрокам.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КлассификацияПоСрокам.Счет В(&СчетаРасчетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	КлассификацияПоСрокам.Организация,
	|	КлассификацияПоСрокам.Счет,
	|	КлассификацияПоСрокам.Субконто1,
	|	КлассификацияПоСрокам.Субконто2,
	|	КлассификацияПоСрокам.Субконто3";
	
	ТочкаЗапроса = СхемыЗапросов.НайтиЗапросРезультата(ТекстЗапроса);
	ТочкаЗапроса.Запрос.ТаблицаДляПомещения = ИмяВременнойТаблицы;
	ТекстЗапроса = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();

КонецПроцедуры

// Формирует временную таблицу остатков НДС с авансов, распределенных по объектам учета авансов
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  КлассифицироватьАктивыОбязательства - Булево - см. КлассифицироватьАктивыОбязательстваПоСрокамВБалансе
//  Период - Дата, МоментВремениСУточнениемПериода
//  Организации - Массив из СправочникСсылка.Организации
//  ВидСчетФактуры - ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные
//  ИмяВременнойТаблицы - Строка
//
Процедура СоздатьВременныеТаблицыНДСАвансов(МенеджерВременныхТаблиц, КлассифицироватьАктивыОбязательства, Период, Организации, ВидСчетФактуры, ИмяВременнойТаблицы) Экспорт
	
	Если КлассифицироватьАктивыОбязательства Тогда
		СоздатьВременныеТаблицыКлассифицированныеНДСАвансов(МенеджерВременныхТаблиц, ИмяВременнойТаблицы);
	Иначе
		СоздатьВременныеТаблицыРаспределенныеНДСАвансов(МенеджерВременныхТаблиц, Период, Организации, ВидСчетФактуры, ИмяВременнойТаблицы);
	КонецЕсли;
	
КонецПроцедуры

// Формирует временную таблицу остатков НДС с авансов с учетом данных классификации задолженности по срокам, сгруппированную по видам актива.
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  ИмяВременнойТаблицы - Строка
//
Процедура СоздатьВременныеТаблицыКлассифицированныеНДСАвансов(МенеджерВременныхТаблиц, ИмяВременнойТаблицы) Экспорт

	Если МенеджерВременныхТаблиц.Таблицы.Найти("КлассификацияПоСрокамЗадолженности") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	КлассификацияПоСрокам.Организация КАК Организация,
	|	КлассификацияПоСрокам.Счет КАК СчетРасчетов,
	|	КлассификацияПоСрокам.Субконто1 КАК Субконто1,
	|	КлассификацияПоСрокам.Субконто2 КАК Субконто2,
	|	КлассификацияПоСрокам.Субконто3 КАК Субконто3,
	|	НЕ Счета.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный) КАК Актив,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВидАктива, ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляАвансов.ПустаяСсылка)) КАК ВидАктива,
	|	КлассификацияПоСрокам.БолееГода КАК БолееГода,
	|	КлассификацияПоСрокам.Просроченная КАК Просроченная,
	|	КлассификацияПоСрокам.НДСАвансов КАК Сальдо
	|ПОМЕСТИТЬ НДСАвансов
	|ИЗ
	|	КлассификацияПоСрокамЗадолженности КАК КлассификацияПоСрокам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Счета
	|		ПО КлассификацияПоСрокам.Счет = Счета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО КлассификацияПоСрокам.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	КлассификацияПоСрокам.НДСАвансов <> 0
	|	И НЕ КлассификацияПоСрокам.Счет В (&СчетаАрендныхПлатежей)";
	
	Если Не ПустаяСтрока(ИмяВременнойТаблицы) Тогда
		ТочкаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(ТекстЗапроса, "НДСАвансов");
		ТочкаЗапроса.Запрос.ТаблицаДляПомещения = ИмяВременнойТаблицы;
		ТекстЗапроса = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	// Арендные платежи (без учета НДС) уменьшают обязательство после принятия к учету объекта аренды.
	// Для понимания, какая часть суммы НДС относится к авансовым платежам,
	// в регистре "Классификация по срокам задолженности" эта сумма отражена отдельной записью по счету 76.07.2
	Запрос.УстановитьПараметр("СчетаАрендныхПлатежей", ПланыСчетов.Хозрасчетный.СчетаАрендныхПлатежей());
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует временную таблицу остатков резервов по сомнительным долгам, распределенных по объектам расчетов
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  КлассифицироватьАктивыОбязательства - Булево - см. КлассифицироватьАктивыОбязательстваПоСрокамВБалансе
//  Период - Дата, МоментВремениСУточнениемПериода
//  Организации - Массив из СправочникСсылка.Организации
//  ИмяВременнойТаблицы - Строка
//
Процедура СоздатьВременныеТаблицыРезервыПоСомнительнымДолгам(МенеджерВременныхТаблиц, КлассифицироватьАктивыОбязательства, Период, Организации, ИмяВременнойТаблицы) Экспорт
	
	Если КлассифицироватьАктивыОбязательства Тогда
		СоздатьВременныеТаблицыКлассифицированныеРезервыПоСомнительнымДолгам(МенеджерВременныхТаблиц, ИмяВременнойТаблицы);
	Иначе
		СоздатьВременныеТаблицыРаспределенныеРезервыПоСомнительнымДолгам(МенеджерВременныхТаблиц, Период, Организации, ИмяВременнойТаблицы);
	КонецЕсли;
	
КонецПроцедуры

// Формирует временную таблицу резервов по сомнительным долгам с учетом данных классификации задолженности по срокам, сгруппированную по видам актива.
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  ИмяВременнойТаблицы - Строка
//
Процедура СоздатьВременныеТаблицыКлассифицированныеРезервыПоСомнительнымДолгам(МенеджерВременныхТаблиц, ИмяВременнойТаблицы) Экспорт
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("КлассификацияПоСрокамЗадолженности") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	КлассификацияПоСрокам.Организация КАК Организация,
	|	КлассификацияПоСрокам.Счет КАК СчетРасчетов,
	|	КлассификацияПоСрокам.Субконто1 КАК Субконто1,
	|	КлассификацияПоСрокам.Субконто2 КАК Субконто2,
	|	КлассификацияПоСрокам.Субконто3 КАК Субконто3,
	|	ИСТИНА КАК Актив,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВидАктива, ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляАвансов.ПустаяСсылка)) КАК ВидАктива,
	|	КлассификацияПоСрокам.БолееГода КАК БолееГода,
	|	КлассификацияПоСрокам.Просроченная КАК Просроченная,
	|	КлассификацияПоСрокам.РезервПоСомнительнымДолгам КАК Сальдо
	|ПОМЕСТИТЬ Резервы
	|ИЗ
	|	КлассификацияПоСрокамЗадолженности КАК КлассификацияПоСрокам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО КлассификацияПоСрокам.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	КлассификацияПоСрокам.РезервПоСомнительнымДолгам <> 0";
	
	Если Не ПустаяСтрока(ИмяВременнойТаблицы) Тогда
		ТочкаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(ТекстЗапроса, "Резервы");
		ТочкаЗапроса.Запрос.ТаблицаДляПомещения = ИмяВременнойТаблицы;
		ТекстЗапроса = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует временную таблицу остатков процентов по рассрочке, распределенных по объектам расчетов
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  КлассифицироватьАктивыОбязательства - Булево - см. КлассифицироватьАктивыОбязательстваПоСрокамВБалансе
//  Период - Дата, МоментВремениСУточнениемПериода
//  Организации - Массив из СправочникСсылка.Организации
//  ИмяВременнойТаблицы - Строка
//
Процедура СоздатьВременныеТаблицыПроцентыПоРассрочке(МенеджерВременныхТаблиц, КлассифицироватьАктивыОбязательства, Период, Организации, ИмяВременнойТаблицы) Экспорт

	Если КлассифицироватьАктивыОбязательства Тогда
		СоздатьВременныеТаблицыКлассифицированныеПроцентыПоРассрочке(МенеджерВременныхТаблиц, ИмяВременнойТаблицы);
	Иначе
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Период", Новый Граница(Период, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Организации", Организации);
		Запрос.УстановитьПараметр("СчетаПроцентовПоРассрочке", ПланыСчетов.Хозрасчетный.СчетаПроцентовПоРассрочке());
		Запрос.УстановитьПараметр("СчетаЗадолженностиСРассрочкой", РасчетПоказателейБалансаПоОбязательствам.СчетаЗадолженностиСРассрочкой());
		Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
		СубконтоКонтрагентыДоговоры = Новый Массив;
		СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
		Запрос.УстановитьПараметр("СубконтоКонтрагентыДоговоры", СубконтоКонтрагентыДоговоры);
		
		ТекстыЗапросов = Новый Массив;
		ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто1) <> &ПустойУникальныйИдентификатор
		|			ТОГДА ХозрасчетныйОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто1,
		|	ВЫБОР
		|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто2) <> &ПустойУникальныйИдентификатор
		|			ТОГДА ХозрасчетныйОстатки.Субконто2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто2,
		|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК Сальдо
		|ПОМЕСТИТЬ Проценты
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&СчетаПроцентовПоРассрочке), &СубконтоКонтрагентыДоговоры, Организация В (&Организации)) КАК ХозрасчетныйОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОстатки.Организация,
		|	ВЫБОР
		|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто1) <> &ПустойУникальныйИдентификатор
		|			ТОГДА ХозрасчетныйОстатки.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто2) <> &ПустойУникальныйИдентификатор
		|			ТОГДА ХозрасчетныйОстатки.Субконто2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Субконто1,
		|	Субконто2");
		
		Если МенеджерВременныхТаблиц.Таблицы.Найти("ОбъектыРассрочки") = Неопределено Тогда
			ТекстыЗапросов.Добавить(
			"ВЫБРАТЬ
			|	Остатки.Организация КАК Организация,
			|	МАКСИМУМ(Остатки.Счет) КАК Счет,
			|	ВЫБОР
			|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Остатки.Субконто1) <> &ПустойУникальныйИдентификатор
			|			ТОГДА Остатки.Субконто1
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК Контрагент,
			|	ВЫБОР
			|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Остатки.Субконто2) <> &ПустойУникальныйИдентификатор
			|			ТОГДА Остатки.Субконто2
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК Договор,
			|	ЛОЖЬ КАК БолееГода,
			|	СУММА(Остатки.СуммаОстаток) КАК ОстатокДолга
			|ПОМЕСТИТЬ ОбъектыРассрочки
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(
			|			&Период,
			|			Счет В (&СчетаЗадолженностиСРассрочкой),
			|			&СубконтоКонтрагентыДоговоры,
			|			(Организация, Субконто1, Субконто2) В
			|				(ВЫБРАТЬ
			|					Проценты.Организация,
			|					Проценты.Субконто1,
			|					Проценты.Субконто2
			|				ИЗ
			|					Проценты)) КАК Остатки
			|
			|СГРУППИРОВАТЬ ПО
			|	Остатки.Организация,
			|	Остатки.Субконто1,
			|	Остатки.Субконто2
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Организация,
			|	Контрагент,
			|	Договор");
		КонецЕсли;
	
		ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	Проценты.Организация КАК Организация,
		|	ЕСТЬNULL(ОбъектыРассрочки.Счет, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПроцентыПоРассрочке)) КАК СчетРасчетов,
		|	Проценты.Субконто1 КАК Субконто1,
		|	Проценты.Субконто2 КАК Субконто2,
		|	НЕОПРЕДЕЛЕНО КАК Субконто3,
		|	ЕСТЬNULL(ОбъектыРассрочки.БолееГода, ЛОЖЬ) КАК БолееГода,
		|	ЛОЖЬ КАК Просроченная,
		|	Проценты.Сальдо КАК Сальдо
		|ПОМЕСТИТЬ ПроцентыПоРассрочке
		|ИЗ
		|	Проценты КАК Проценты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъектыРассрочки КАК ОбъектыРассрочки
		|		ПО Проценты.Организация = ОбъектыРассрочки.Организация
		|			И Проценты.Субконто1 = ОбъектыРассрочки.Контрагент
		|			И Проценты.Субконто2 = ОбъектыРассрочки.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Проценты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОбъектыРассрочки");
		
		ТекстЗапроса = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
		
		Если Не ПустаяСтрока(ИмяВременнойТаблицы) Тогда
			ТочкаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(ТекстЗапроса, "ПроцентыПоРассрочке");
			ТочкаЗапроса.Запрос.ТаблицаДляПомещения = ИмяВременнойТаблицы;
			ТекстЗапроса = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.Выполнить();
	КонецЕсли;
		
КонецПроцедуры

// Формирует временную таблицу процентов по рассрочке с учетом данных классификации задолженности по срокам
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  ИмяВременнойТаблицы - Строка
//
Процедура СоздатьВременныеТаблицыКлассифицированныеПроцентыПоРассрочке(МенеджерВременныхТаблиц, ИмяВременнойТаблицы) Экспорт

	Если МенеджерВременныхТаблиц.Таблицы.Найти("КлассификацияПоСрокамЗадолженности") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	КлассификацияПоСрокам.Организация КАК Организация,
	|	КлассификацияПоСрокам.Счет КАК СчетРасчетов,
	|	КлассификацияПоСрокам.Субконто1 КАК Субконто1,
	|	КлассификацияПоСрокам.Субконто2 КАК Субконто2,
	|	КлассификацияПоСрокам.Субконто3 КАК Субконто3,
	|	ЛОЖЬ КАК Актив,
	|	КлассификацияПоСрокам.БолееГода КАК БолееГода,
	|	КлассификацияПоСрокам.Просроченная КАК Просроченная,
	|	КлассификацияПоСрокам.ПроцентыПоРассрочке КАК Сальдо
	|ПОМЕСТИТЬ ПроцентыПоРассрочке
	|ИЗ
	|	КлассификацияПоСрокамЗадолженности КАК КлассификацияПоСрокам
	|ГДЕ
	|	КлассификацияПоСрокам.ПроцентыПоРассрочке <> 0";
	
	Если Не ПустаяСтрока(ИмяВременнойТаблицы) Тогда
		ТочкаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(ТекстЗапроса, "ПроцентыПоРассрочке");
		ТочкаЗапроса.Запрос.ТаблицаДляПомещения = ИмяВременнойТаблицы;
		ТекстЗапроса = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
КонецПроцедуры

// Возвращает типы объектов, которые являются источниками для нахождения срока погашения
//
// Возвращаемое значение:
//  Массив из Тип
//
Функция ТипыИсточниковСроковПогашения() Экспорт
	
	Типы = Новый Массив;
	Типы.Добавить(Тип("СправочникСсылка.ДоговорыКонтрагентов"));
	Типы.Добавить(Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг"));
	Типы.Добавить(Тип("ДокументСсылка.ПередачаНМА"));
	Типы.Добавить(Тип("ДокументСсылка.ПередачаОС"));
	Типы.Добавить(Тип("ДокументСсылка.ПоступлениеДопРасходов"));
	Типы.Добавить(Тип("ДокументСсылка.ПоступлениеНМА"));
	Типы.Добавить(Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	Типы.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	Типы.Добавить(Тип("ДокументСсылка.ИнвентаризацияРасчетовСКонтрагентами"));
	
	Возврат Типы;
	
КонецФункции

Функция СписокВидовСубконто() Экспорт
	
	ВидыСубконто = Новый Структура;
	
	СубконтоКонтрагенты = Новый Массив;
	СубконтоКонтрагенты.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Вставить("СубконтоКонтрагенты", СубконтоКонтрагенты);

	СубконтоКонтрагентыДоговоры = Новый Массив;
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ВидыСубконто.Вставить("СубконтоКонтрагентыДоговоры", СубконтоКонтрагентыДоговоры);
	
	СубконтоКонтрагентыЦенныеБумаги = Новый Массив;
	СубконтоКонтрагентыЦенныеБумаги.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыЦенныеБумаги.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги);
	ВидыСубконто.Вставить("СубконтоКонтрагентыЦенныеБумаги", СубконтоКонтрагентыЦенныеБумаги);
	
	СубконтоКонтрагентыДоговорыДокументы = Новый Массив;
	СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	ВидыСубконто.Вставить("СубконтоКонтрагентыДоговорыДокументы", СубконтоКонтрагентыДоговорыДокументы);
	
	СубконтоКонтрагентыДоговорыЦенныеБумаги = Новый Массив;
	СубконтоКонтрагентыДоговорыЦенныеБумаги.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыДоговорыЦенныеБумаги.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	СубконтоКонтрагентыДоговорыЦенныеБумаги.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги);
	ВидыСубконто.Вставить("СубконтоКонтрагентыДоговорыЦенныеБумаги", СубконтоКонтрагентыДоговорыЦенныеБумаги);
	
	СубконтоКонтрагентыРБП = Новый Массив;
	СубконтоКонтрагентыРБП.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыРБП.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);
	ВидыСубконто.Вставить("СубконтоКонтрагентыРБП", СубконтоКонтрагентыРБП);
	
	СубконтоРасходыБудущихПериодов = Новый Массив;
	СубконтоРасходыБудущихПериодов.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);
	ВидыСубконто.Вставить("СубконтоРасходыБудущихПериодов", СубконтоРасходыБудущихПериодов);

	СубконтоВидыПлатежей = Новый Массив;
	СубконтоВидыПлатежей.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет);
	ВидыСубконто.Вставить("СубконтоВидыПлатежей", СубконтоВидыПлатежей);

	СубконтоРаботники = Новый Массив;
	СубконтоРаботники.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций);
	ВидыСубконто.Вставить("СубконтоРаботники", СубконтоРаботники);

	СубконтоУчредители = Новый Массив;
	СубконтоУчредители.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Учредители);
	ВидыСубконто.Вставить("СубконтоУчредители", СубконтоУчредители);
	
	СубконтоНазначениеЦСДоговоры = Новый Массив;
	СубконтоНазначениеЦСДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначениеЦелевыхСредств);
	СубконтоНазначениеЦСДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ВидыСубконто.Вставить("СубконтоНазначениеЦСДоговоры", СубконтоНазначениеЦСДоговоры);

	СубконтоДоходыБПКонтрагентыДоговоры = Новый Массив;
	СубконтоДоходыБПКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДоходыБудущихПериодов);
	СубконтоДоходыБПКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоДоходыБПКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ВидыСубконто.Вставить("СубконтоДоходыБПКонтрагентыДоговоры", СубконтоДоходыБПКонтрагентыДоговоры);
	
	Возврат ВидыСубконто;
	
КонецФункции

// Возвращает список видов активов для авансов, которые не относятся к дебиторской задолженности
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыАктивовДляАвансов
//
Функция ВидыАктивовАвансовНеОтносящиесяКДебиторскойЗадолженности() Экспорт
	
	ИсключаемыеВидыАктивовАвансов = Новый Массив;
	ИсключаемыеВидыАктивовАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.Запасы);
	ИсключаемыеВидыАктивовАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.ИнвестиционнаяНедвижимость);
	ИсключаемыеВидыАктивовАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.НематериальныеАктивы);
	ИсключаемыеВидыАктивовАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.ПрочиеВнеоборотные);
	ИсключаемыеВидыАктивовАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.ОсновныеСредства);
	ИсключаемыеВидыАктивовАвансов.Добавить(Перечисления.ВидыАктивовДляАвансов.ПрочиеОборотные);

	Возврат ИсключаемыеВидыАктивовАвансов;
		
КонецФункции

// Определяет наличие проведенной регламентной операции "Классификация задолженности по срокам" за заданный период в случае,
// когда настройка разделения активов и обязательств по данным инвентаризации включена более поздним числом
// 
// Параметры:
//  Период - Дата
//  Организация - СправочникСсылка.Организации
//  НастройкаВключена - см. УчетнаяПолитика.КлассифицироватьАктивыОбязательстваПоСрокам
//
// Возвращаемое значение:
//  Булево
//
Функция КлассифицироватьАктивыОбязательстваПоСрокамВБалансе(Период, Организация, НастройкаВключена = Ложь) Экспорт
	
	КлассифицироватьАктивыОбязательства = УчетнаяПолитика.КлассифицироватьАктивыОбязательстваПоСрокам(Период, Организация);
	
	Если КлассифицироватьАктивыОбязательства Тогда
		Возврат Истина;
	КонецЕсли;

	Если НастройкаВключена Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.КлассификацияПоСрокамОтдельныхВидовЗадолженности КАК КлассификацияПоСрокамОтдельныхВидовЗадолженности
		|ГДЕ
		|	КлассификацияПоСрокамОтдельныхВидовЗадолженности.Активность
		|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.Организация = &Организация
		|	И КлассификацияПоСрокамОтдельныхВидовЗадолженности.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	КлассификацияПоСрокамРасходовБудущихПериодов.Регистратор
		|ИЗ
		|	РегистрСведений.КлассификацияПоСрокамРасходовБудущихПериодов КАК КлассификацияПоСрокамРасходовБудущихПериодов
		|ГДЕ
		|	КлассификацияПоСрокамРасходовБудущихПериодов.Активность
		|	И КлассификацияПоСрокамРасходовБудущихПериодов.Организация = &Организация
		|	И КлассификацияПоСрокамРасходовБудущихПериодов.ПериодРасчета МЕЖДУ &НачалоПериода И &КонецПериода";
		
		Запрос.УстановитьПараметр("Организация",   Организация);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
		Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(Период));
		
		Возврат Не Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область Счета

// Возвращает список счетов, участвующих в классификации дебиторской задолженности по срокам погашения
// на основании данных актов инвентаризации расчетов
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаИнвентаризацииРасчетовДебиторская() Экспорт
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	ВидыСчетов.Добавить(ВидСчета.Активный);
	
	СчетаРасчетов = Новый Массив;
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.ВыполненныеЭтапыПоНезавершеннымРаботам);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСУчредителями);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);

	СчетаИсключения = Новый Массив;
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРозничнымиПокупателями); // 62.Р
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам); // 76.АВ
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.КорректировкаРасчетовПрошлогоПериода); // 76.К
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыНДСНалоговогоАгента); // 76.НА
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке); // 76.ОТ
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоИсполнительнымДокументамРаботников); // 76.41 отнесен к кредиторской задолженности
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, ПланыСчетов.Хозрасчетный.СчетаРасчетовПоАренде()); // 76.07, 76.27, 76.37
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, ПланыСчетов.Хозрасчетный.СчетаПроцентовПоРассрочке()); // 76.08, 76.28, 76.38
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, БухгалтерскийУчет.СчетаУчетаНазначенияИспользованияНМА()); // 76.18
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, СчетаУчетаРБП()); // 76.01.2, 76.01.9, 97

	Возврат СчетаВИерархии(СчетаРасчетов, ВидыСчетов, СчетаИсключения);
	
КонецФункции

// Возвращает список счетов, участвующих в классификации кредиторской задолженности по срокам
// на основании данных актов инвентаризации расчетов
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаИнвентаризацииРасчетовКредиторская() Экспорт
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	ВидыСчетов.Добавить(ВидСчета.Пассивный);
	
	СчетаРасчетов = Новый Массив;
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСУчредителями);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);
	
	СчетаИсключения = Новый Массив;
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным); // 76.ВА
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ТопливныеКарты); // 76.15
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.КорректировкаРасчетовПрошлогоПериода); // 76.К
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыНДСНалоговогоАгента); // 76.НА
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, ПланыСчетов.Хозрасчетный.СчетаРасчетовПоАренде()); // 76.07, 76.27, 76.37
	// Проценты по долгосрочным кредитам и займама
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымКредитам); // 67.02
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымЗаймам); // 67.04
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПроцентыПроцентыПоДолгосрочнымДолговымЦеннымБумагам); // 67.06
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымКредитамВал); // 67.22
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымЗаймамВал); // 67.24
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПроцентыПоДолгосрочнымДолговымЦеннымБумагамВал); // 67.26
	
	Возврат СчетаВИерархии(СчетаРасчетов, ВидыСчетов, СчетаИсключения);
	
КонецФункции

// Возвращает список счетов, участвующих в классификации дебиторской задолженности
// на основании сроков оплаты
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаРасчетовСПокупателями() Экспорт
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	ВидыСчетов.Добавить(ВидСчета.Активный);

	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиВал);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиУЕ);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ);
	
	Возврат СчетаВИерархии(Счета, ВидыСчетов);
	
КонецФункции

// Возвращает список счетов, участвующих в классификации кредиторской задолженности
// на основании сроков оплаты
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаРасчетовСПоставщиками() Экспорт
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	ВидыСчетов.Добавить(ВидСчета.Пассивный);
	
	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиВал);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиУЕ);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ);
	
	Возврат СчетаВИерархии(Счета, ВидыСчетов);
	
КонецФункции

// Возвращает список счетов, участвующих в расчетах остатков дебиторской задолженности
//
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаРасчетовДебиторскаяЗадолженность() Экспорт
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	ВидыСчетов.Добавить(ВидСчета.Активный);
	
	СчетаРасчетов = Новый Массив;
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.ВыполненныеЭтапыПоНезавершеннымРаботам);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНалогам);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСУчредителями);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);
	
	СчетаИсключения = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, ПланыСчетов.Хозрасчетный.СчетаПроцентовПоРассрочке());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, СчетаУчетаРБП());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, БухгалтерскийУчет.СчетаУчетаНазначенияИспользованияНМА());
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетНалогаНаПрибыль);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НДСпоЭкспортуКВозмещению);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоИсполнительнымДокументамРаботников);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыНДСНалоговогоАгента);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, ПланыСчетов.Хозрасчетный.СчетаРасчетовПоАренде());
	
	Счета = СчетаВИерархии(СчетаРасчетов, ВидыСчетов, СчетаИсключения);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, ПланыСчетов.Хозрасчетный.СчетаРасчетовПоАренде());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, СчетаУчетаРБП());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, БухгалтерскийУчет.СчетаУчетаНазначенияИспользованияНМА());

	Возврат Счета;
	
КонецФункции

// Возвращает список счетов, участвующих в расчетах остатков кредиторской задолженности
//
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаРасчетовКредиторскаяЗадолженность() Экспорт
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	ВидыСчетов.Добавить(ВидСчета.Пассивный);
	
	СчетаРасчетов = Новый Массив;
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНалогам);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСУчредителями);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.ЦелевоеФинансирование);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.ДоходыПолученныеВСчетБудущихПериодов);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.БезвозмездныеПоступления);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.ПредстоящиеПоступленияПоНедостачамВыявленнымЗаПрошлыеГоды);
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РазницаМеждуСуммойПодлежащейВзысканиюСВиновныхЛицИБалансовойСтоимостьюПоНедостачамЦенностей);
	
	СчетаИсключения = Новый Массив;
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетНалогаНаПрибыль);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, ПланыСчетов.Хозрасчетный.СчетаРасчетовПоАренде());
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным);

	Счета = СчетаВИерархии(СчетаРасчетов, ВидыСчетов, СчетаИсключения);

	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, ПланыСчетов.Хозрасчетный.СчетаРасчетовПоАренде());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, СчетаКредитовЗаймов());
	
	Возврат Счета;
	
КонецФункции

// Возвращает список счетов, на которых отражены объекты резервов по сомнительным долгам
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаОбъектовРезервов() Экспорт
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	ВидыСчетов.Добавить(ВидСчета.Активный);
	
	Счета = Новый Массив;
	
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);     // 60
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);      // 62
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами); // 76
		
	СчетаИсключения = Новый Массив;
	// 76.АВ - Это контрпассивный счет
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам);
	
	// 76.ОТ относится к строке баланса 1220
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке);
	
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.РасчетыНДСНалоговогоАгента);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.КорректировкаРасчетовПрошлогоПериода);
	
	// 76.07, 76.27, 76.37 Счета аренды
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, ПланыСчетов.Хозрасчетный.СчетаРасчетовПоАренде());
	// 76.08, 76.28, 76.38 - Это контрпассивные счет
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, ПланыСчетов.Хозрасчетный.СчетаПроцентовПоРассрочке());
	
	// 76.18
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеПравНаИспользованиеРезультатовИнтеллектуальнойДеятельности);
	
	СчетаОбъектовРезервов = СчетаВИерархии(Счета, ВидыСчетов, СчетаИсключения);
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиТабличное.СчетаПоСубконто(СчетаОбъектовРезервов, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);

КонецФункции

// Возвращает список счетов учета авансов выданных
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаУчетаАвансовВыданных() Экспорт
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	ВидыСчетов.Добавить(ВидСчета.Активный);

	СчетаАвансов = Новый Массив;

	Счета = Новый Массив;
	
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);    // 60
	
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками);    // 76.05
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал); // 76.25
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ);  // 76.35
	
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);    // 76.09
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал); // 76.29
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ);  // 76.39
	
	СчетаАвансов = СчетаВИерархии(Счета, ВидыСчетов);
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиТабличное.СчетаПоСубконто(СчетаАвансов, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
КонецФункции

// Возвращает список счетов учета авансов полученных
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаУчетаАвансовПолученных() Экспорт
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	ВидыСчетов.Добавить(ВидСчета.Пассивный);
	
	СчетаАвансов = Новый Массив;

	Счета = Новый Массив;
	
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);    // 62
	
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками);    // 76.06
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал); // 76.26
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ);  // 76.36
	
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);    // 76.09
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал); // 76.29
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ);  // 76.39
	
	СчетаАвансов = СчетаВИерархии(Счета, ВидыСчетов);
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиТабличное.СчетаПоСубконто(СчетаАвансов, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
КонецФункции

// Возвращает список счетов расходов будущих периодов
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаУчетаРБП() Экспорт
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.Активный);
	
	СчетаУчетаРБП = Новый Массив;
	СчетаУчетаРБП.Добавить(ПланыСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников);
	СчетаУчетаРБП.Добавить(ПланыСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования);
	СчетаУчетаРБП.Добавить(ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
	
	Возврат ЗаполнениеБухгалтерскойОтчетностиТабличное.СчетаПоСубконто(СчетаВИерархии(СчетаУчетаРБП, ВидыСчетов), ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);

КонецФункции

// Возвращает список счетов кредитов и займов
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаКредитовЗаймов() Экспорт

	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	ВидыСчетов.Добавить(ВидСчета.Пассивный);

	Счета = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам));
	
	Возврат СчетаВИерархии(Счета, ВидыСчетов);
	
КонецФункции

// Возвращает список счетов долгосрочных кредитов и займов
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаДолгосрочныхКредитовЗаймов() Экспорт

	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.Пассивный);

	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ДолгосрочныеКредиты);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймы);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ДолгосрочныеДолговыеЦенныеБумаги);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ДолгосрочныеКредитыВал);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймыВал);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ДолгосрочныеДолговыеЦенныеБумагиВал);
	
	Возврат СчетаВИерархии(Счета, ВидыСчетов);
	
КонецФункции

// Возвращает список счетов, которые по умолчанию отражаются в показателях долгосрочной задолженности в балансе и в пояснениях к балансу
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаДолгосрочныеПоУмолчанию() Экспорт
	
	Счета = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, СчетаДолгосрочныхКредитовЗаймов());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.БезвозмездныеПоступления));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПредстоящиеПоступленияПоНедостачамВыявленнымЗаПрошлыеГоды));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счета, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РазницаМеждуСуммойПодлежащейВзысканиюСВиновныхЛицИБалансовойСтоимостьюПоНедостачамЦенностей));
	
	Возврат Счета;
	
КонецФункции

// Возвращает список счетов, отражаемых в разделе баланса дебиторской задолженности свернуто по счету
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаСвернутоеСальдоКредиторская() Экспорт
	
	Счета = Новый Массив;
	Счета.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоИсполнительнымДокументамРаботников);
	
	Возврат Счета;
		
КонецФункции

// Возвращает счета по переданному списку условных кодов
//
// Параметры:
//  СписокСчетов - Массив из ПланСчетовСсылка.Хозрасчетный
//  ВидыСчетов - Массив из ВидСчета
//  СписокСчетовИсключений - Массив из ПланСчетовСсылка.Хозрасчетный
//                         - Неопределено
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаИзСписка(СписокСчетов, ВидыСчетов, СписокСчетовИсключений = Неопределено) Экспорт

	// Счета из списка
	Счета = ЗаполнениеБухгалтерскойОтчетности.СчетаИзСписка(СписокСчетов);

	// Счета исключения
	СчетаИсключения = ЗаполнениеБухгалтерскойОтчетности.СчетаИзСписка(СписокСчетовИсключений);
	
	Возврат СчетаВИерархии(Счета, ВидыСчетов, СчетаИсключения);
	
КонецФункции

// Возвращает счета с подчиненными по переданному списку
//
// Параметры:
//  Счета - Массив из ПланСчетовСсылка.Хозрасчетный
//  ВидыСчетов - Массив из ВидСчета
//  СчетаИсключения - Массив из ПланСчетовСсылка.Хозрасчетный
//
// Возвращаемое значение:
//  Массив из ПланСчетовСсылка.Хозрасчетный
//
Функция СчетаВИерархии(Счета, ВидыСчетов, СчетаИсключения = Неопределено) Экспорт
	
	Если СчетаИсключения = Неопределено Тогда
		СчетаИсключения = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счета", Счета);
	Запрос.УстановитьПараметр("ВидыСчетов", ВидыСчетов);
	Запрос.УстановитьПараметр("СчетаИсключения", СчетаИсключения);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&Счета)
	|	И Хозрасчетный.Вид В(&ВидыСчетов)
	|	И НЕ Хозрасчетный.Ссылка В ИЕРАРХИИ (&СчетаИсключения)
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|
	|УПОРЯДОЧИТЬ ПО
	|	Хозрасчетный.Код";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйДанныеЗадолженности()

	РасчетныеДанные = Новый Структура;
	РасчетныеДанные.Вставить("РасходыБудущихПериодов",            НовыйТаблицаРасходыБудущихПериодов());
	РасчетныеДанные.Вставить("ДебиторскаяЗадолженностьПоСрокам",  НовыйРасчетЗадолженности());
	РасчетныеДанные.Вставить("КредиторскаяЗадолженностьПоСрокам", НовыйРасчетЗадолженности());
	
	Возврат РасчетныеДанные;
		
КонецФункции

Функция НовыйРасчетЗадолженности()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Таблица.Колонки.Добавить("Субконто1");
	Таблица.Колонки.Добавить("Субконто2");
	Таблица.Колонки.Добавить("Субконто3");
	Таблица.Колонки.Добавить("ВидЗадолженности", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗадолженности"));
	Таблица.Колонки.Добавить("ДатаВозникновения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Таблица.Колонки.Добавить("ДатаПогашения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Таблица.Колонки.Добавить("УровеньДетализации", ОбщегоНазначения.ОписаниеТипаЧисло(1, , ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("ОстатокДолга", БухгалтерскийУчетКлиентСервер.ТипСумма());
	Таблица.Колонки.Добавить("РезервПоСомнительнымДолгам", БухгалтерскийУчетКлиентСервер.ТипСумма());
	Таблица.Колонки.Добавить("НДСАвансов", БухгалтерскийУчетКлиентСервер.ТипСумма());
	Таблица.Колонки.Добавить("ПроцентыПоРассрочке", БухгалтерскийУчетКлиентСервер.ТипСумма());
	Таблица.Колонки.Добавить("ИсточникСрокаПогашения", Новый ОписаниеТипов(ТипыИсточниковСроковПогашения()));
	
	Возврат Таблица;
	
КонецФункции

Функция СчетаНалогов()
	
	СчетаРасчетов = Новый Структура;

	СчетаПоВидамПлатежей = БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПрочиеНалогиИСборы); // 68.10
	СчетаРасчетов.Вставить("СчетаПоВидамПлатежей", СчетаПоВидамПлатежей);

	СчетаИсключения = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетНалогаНаПрибыль)); // 68.04.2
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.НДСпоЭкспортуКВозмещению)); // 68.22
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, СчетаПоВидамПлатежей);
	
	СчетаБезДетализации = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаБезДетализации, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.НДСНалоговогоАгента)); // 68.32
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаБезДетализации, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.НДСТаможенныйСоюзКУплате)); // 68.42
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаБезДетализации, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.АкцизТаможенныйСоюзКУплате)); // 68.43
	СчетаРасчетов.Вставить("СчетаБезДетализации", СчетаБезДетализации);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключения, СчетаБезДетализации);

	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	СчетаАПБезДетализации = СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоНалогам, ВидыСчетов, СчетаИсключения);
	СчетаРасчетов.Вставить("СчетаАПБезДетализации", СчетаАПБезДетализации);

	Возврат СчетаРасчетов;
	
КонецФункции

Функция СчетаСоциальногоСтрахования()
	
	СчетаРасчетов = Новый Структура;

	СчетаПоВидамПлатежей = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаПоВидамПлатежей, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПФР_доп)); // 69.02.3
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаПоВидамПлатежей, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПФР_доп_шахтеры)); // 69.02.4
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаПоВидамПлатежей, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПФР_ДОБР_орг)); // 69.05.1
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаПоВидамПлатежей, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПФР_ДОБР_сотр)); // 69.05.2
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаПоВидамПлатежей, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ФСС_СтраховойГод)); // 69.06.4
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаПоВидамПлатежей, БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ)); // 69.11
	СчетаРасчетов.Вставить("СчетаПоВидамПлатежей", СчетаПоВидамПлатежей);

	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	СчетаАПБезДетализации = СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию, ВидыСчетов, СчетаПоВидамПлатежей);
	СчетаРасчетов.Вставить("СчетаАПБезДетализации", СчетаАПБезДетализации);

	Возврат СчетаРасчетов;
		
КонецФункции

#Область ДебиторскаяЗадолженность

Функция КонтекстРасчетаДебиторская()
	
	КонтекстРасчета = Новый Структура;
	КонтекстРасчета.Вставить("ВидЗадолженности", Перечисления.ВидыЗадолженности.Дебиторская);
	
	СчетаИнвентаризацииРасчетов = СчетаИнвентаризацииРасчетовДебиторская();
	СчетаРасчетовСПокупателями = СчетаРасчетовСПокупателями();
	СчетаУчетаАвансов = СчетаУчетаАвансовВыданных();
	СчетаОбъектовРезервов = СчетаОбъектовРезервов();
	
	СчетаКлассификации = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаКлассификации, СчетаИнвентаризацииРасчетов);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаКлассификации, СчетаРасчетовСПокупателями);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаКлассификации, СчетаУчетаАвансов);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаКлассификации, СчетаОбъектовРезервов);

	// Список счетов, у которых дата погашения может быть получена только из инвентаризации расчетов и нет корректирующих величин
	СчетаСоСроками = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаСоСроками, СчетаРасчетовСПокупателями);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаСоСроками, СчетаУчетаАвансов);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаСоСроками, СчетаОбъектовРезервов);
	СчетаИсключитьБезДатыПогашения = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключитьБезДатыПогашения, СчетаКлассификации);
	Для Каждого Счет Из СчетаСоСроками Цикл
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СчетаИсключитьБезДатыПогашения, Счет);
	КонецЦикла;
	
	КонтекстРасчета.Вставить("ВидЗадолженности", Перечисления.ВидыЗадолженности.Дебиторская);
	КонтекстРасчета.Вставить("СчетаИнвентаризацииРасчетов", СчетаИнвентаризацииРасчетов);
	КонтекстРасчета.Вставить("СчетаУчетаАвансов", СчетаУчетаАвансов);
	КонтекстРасчета.Вставить("СчетаКлассификации", СчетаКлассификации);
	КонтекстРасчета.Вставить("СчетаИсключитьБезДатыПогашения", СчетаИсключитьБезДатыПогашения);

	Возврат КонтекстРасчета;

КонецФункции

Функция ДебиторскаяЗадолженностьПоСрокам(КонтекстОперации, РасчетныеДанные)
	
	Организации = КонтекстОперации.Организации;
	КонецПериодаДата = КонтекстОперации.КонецПериодаДата;

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СоздатьВременныеТаблицыАвансыПоАренде(МенеджерВременныхТаблиц, РасчетныеДанные.РасчетыПоАренде.АрендныеОбязательства);
	
	КонтекстРасчета = КонтекстРасчетаДебиторская();
	
	СоздатьВременныеТаблицыРаспределеннаяЗадолженностьПоСрокам(МенеджерВременныхТаблиц, КонтекстОперации, КонтекстРасчета);
	
	// Объекты авансов
	СоздатьВременныеТаблицыОбъектыАвансов(МенеджерВременныхТаблиц, КонтекстРасчета.СчетаУчетаАвансов);
	
	// НДС с авансов, распределенный по объектам авансов
	СоздатьВременныеТаблицыРаспределенныеНДСАвансов(МенеджерВременныхТаблиц, КонецПериодаДата, Организации, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СФПолученные);
		
	// Объекты резервов по сомнительным долгам
	СоздатьВременныеТаблицыОбъектыРезервовПоСомнительнымДолгам(МенеджерВременныхТаблиц, СчетаОбъектовРезервов());
	
	// Резервы по сомнительным долгам, распределенные по объектам резервов
	СоздатьВременныеТаблицыРаспределенныеРезервыПоСомнительнымДолгам(МенеджерВременныхТаблиц, КонецПериодаДата, Организации);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачалаДолгосрочногоПериода", КонтекстОперации.ДатаНачалаДолгосрочногоПериода);
	Запрос.Текст = ТекстЗапросаОбъединитьВсеРасчетыДебиторская();

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТекстЗапросаДебиторскаяЗадолженностьПоСрокам(КонтекстЗапроса, ИмяПоместить, ОбщиеПараметры)
	
	// Для остатков расчетов получаем дату погашения по срокам оплаты, указанных в договорах или документах расчетах
	ТекстыЗапросов = Новый Массив;
	ТекстЗапроса = ШаблонТекстаЗапросаРасчеты();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыРасчеты", ИмяПоместить);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	ВременныеТаблицы = КонтекстЗапроса.ВременныеТаблицы;
	Если ВременныеТаблицы.Найти("РасчетыСКонтрагентамиПоДоговорам") <> Неопределено Тогда
		
		Если КонтекстЗапроса.ОпределитьСроки Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Расчеты.Организация КАК Организация,
			|	Расчеты.Счет КАК Счет,
			|	Расчеты.Субконто1 КАК Субконто1,
			|	Расчеты.Субконто2 КАК Субконто2,
			|	Расчеты.Субконто3 КАК Субконто3,
			|	Расчеты.ОстатокДт КАК ОстатокБУ
			|ИЗ
			|	РасчетыСКонтрагентамиПоДоговорам КАК Расчеты
			|ГДЕ
			|	Расчеты.Счет В(&СчетаРасчетовСПокупателями)
			|	И Расчеты.ОстатокДт <> 0";
			
			ПараметрыСвязи = НовыйПараметрыСвязиВременнойТаблицыРасчеты();
			ПараметрыСвязи.ИмяТаблицы =         "Расчеты";
			ПараметрыСвязи.ИмяПоляСчет =        "Счет";
			ПараметрыСвязи.ИмяПоляОрганизация = "Организация";
			ПараметрыСвязи.ИмяПоляДоговор =     "Субконто2";
			ПараметрыСвязи.ИмяПоляДокумент =    "Субконто3";
			
			ДополнитьЗапросДаннымиПоСрокамОплаты(ТекстЗапроса, ПараметрыСвязи, КонтекстЗапроса.ПараметрыЗапроса);
			ТекстыЗапросов.Добавить(ТекстЗапроса);
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Расчеты.Организация КАК Организация,
			|	Расчеты.Счет КАК Счет,
			|	Расчеты.Субконто1 КАК Субконто1,
			|	Расчеты.Субконто2 КАК Субконто2,
			|	Расчеты.Субконто3 КАК Субконто3,
			|	Расчеты.ОстатокДт КАК ОстатокБУ,
			|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратора,
			|	НЕ ДанныеПервичныхДокументов.ДатаРегистратора ЕСТЬ NULL КАК ЕстьДокументРасчетов,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашенияБУ,
			|	НЕОПРЕДЕЛЕНО КАК ИсточникСрокаПогашения
			|ИЗ
			|	РасчетыСКонтрагентамиПоДоговорам КАК Расчеты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
			|		ПО Расчеты.Организация = ДанныеПервичныхДокументов.Организация
			|			И Расчеты.Субконто3 = ДанныеПервичныхДокументов.Документ
			|ГДЕ
			|	НЕ Расчеты.Счет В (&СчетаРасчетовСПокупателями)
			|	И Расчеты.ОстатокДт <> 0";
			ТекстыЗапросов.Добавить(ТекстЗапроса);
			КонтекстЗапроса.ПараметрыЗапроса.Вставить("СчетаРасчетовСПокупателями", СчетаРасчетовСПокупателями());
		Иначе
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Расчеты.Организация КАК Организация,
			|	Расчеты.Счет КАК Счет,
			|	Расчеты.Субконто1 КАК Субконто1,
			|	Расчеты.Субконто2 КАК Субконто2,
			|	Расчеты.Субконто3 КАК Субконто3,
			|	Расчеты.ОстатокДт КАК ОстатокБУ,
			|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратора,
			|	НЕ ДанныеПервичныхДокументов.ДатаРегистратора ЕСТЬ NULL КАК ЕстьДокументРасчетов,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашенияБУ,
			|	НЕОПРЕДЕЛЕНО КАК ИсточникСрокаПогашения
			|ИЗ
			|	РасчетыСКонтрагентамиПоДоговорам КАК Расчеты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
			|		ПО Расчеты.Организация = ДанныеПервичныхДокументов.Организация
			|			И Расчеты.Субконто3 = ДанныеПервичныхДокументов.Документ
			|ГДЕ
			|	Расчеты.ОстатокДт <> 0";
			ТекстыЗапросов.Добавить(ТекстЗапроса);
		КонецЕсли;
		
	КонецЕсли;

	Если ВременныеТаблицы.Найти("Авансы") <> Неопределено Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Авансы.Организация КАК Организация,
		|	Авансы.Счет КАК Счет,
		|	Авансы.Субконто1 КАК Субконто1,
		|	ВЫРАЗИТЬ(Авансы.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Субконто2,
		|	Авансы.Субконто3 КАК Субконто3,
		|	Авансы.ОстатокДт КАК ОстатокБУ,
		|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратора,
		|	НЕ ДанныеПервичныхДокументов.ДатаРегистратора ЕСТЬ NULL КАК ЕстьДокументРасчетов,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашенияБУ,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникСрокаПогашения
		|ИЗ
		|	Авансы КАК Авансы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|		ПО Авансы.Организация = ДанныеПервичныхДокументов.Организация
		|			И Авансы.Субконто3 = ДанныеПервичныхДокументов.Документ
		|ГДЕ
		|	Авансы.ОстатокДт <> 0
		|	И &РазделятьАвансыПоВидамАктивов";
		
		РазделятьАвансыПоВидамАктивов = РегламентированнаяОтчетность.АвансыРазделеныПоВидамАктивов(ОбщиеПараметры.Организация, ОбщиеПараметры.КонецПериодаДата);
		Если РазделятьАвансыПоВидамАктивов Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РазделятьАвансыПоВидамАктивов", "НЕ ВЫРАЗИТЬ(Авансы.Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВидАктива В (&ИсключаемыеВидыАктивовАвансов)");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РазделятьАвансыПоВидамАктивов", "ИСТИНА");
		КонецЕсли;
		
		КонтекстЗапроса.ПараметрыЗапроса.Вставить("ИсключаемыеВидыАктиваАвансов", ВидыАктивовАвансовНеОтносящиесяКДебиторскойЗадолженности());

		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЕсли;

	Если ВременныеТаблицы.Найти("РасчетыПрочие") <> Неопределено Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Расчеты.Организация КАК Организация,
		|	Расчеты.Счет КАК Счет,
		|	Расчеты.Субконто1 КАК Субконто1,
		|	Расчеты.Субконто2 КАК Субконто2,
		|	Расчеты.Субконто3 КАК Субконто3,
		|	Расчеты.ОстатокДт КАК ОстатокБУ,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРегистратора,
		|	ЛОЖЬ КАК ЕстьДокументРасчетов,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашенияБУ,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникСрокаПогашения
		|ИЗ
		|	РасчетыПрочие КАК Расчеты
		|ГДЕ
		|	Расчеты.ОстатокДт <> 0";
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	Возврат СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.ТекстОбъединитьВсе());
	
КонецФункции

Функция ТекстЗапросаОбъединитьВсеРасчетыДебиторская()

	Возврат
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Дебиторская) КАК ВидЗадолженности,
	|	Расчеты.Организация КАК Организация,
	|	Расчеты.Счет КАК Счет,
	|	Расчеты.Субконто1 КАК Субконто1,
	|	Расчеты.Субконто2 КАК Субконто2,
	|	Расчеты.Субконто3 КАК Субконто3,
	|	Расчеты.ДатаВозникновения КАК ДатаВозникновения,
	|	Расчеты.ДатаПогашения КАК ДатаПогашения,
	|	МАКСИМУМ(Расчеты.ИсточникСрокаПогашения) КАК ИсточникСрокаПогашения,
	|	МАКСИМУМ(Расчеты.ЗаписыватьВРегистр) КАК ЗаписыватьВРегистр,
	|	МАКСИМУМ(Расчеты.УровеньДетализации) КАК УровеньДетализации,
	|	СУММА(Расчеты.ОстатокДолга) КАК ОстатокДолга,
	|	СУММА(Расчеты.ОстатокРезерва) КАК РезервПоСомнительнымДолгам,
	|	СУММА(Расчеты.ОстатокНДС) КАК НДСАвансов
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоСрокамПогашения.Организация КАК Организация,
	|		РасчетыПоСрокамПогашения.Счет КАК Счет,
	|		РасчетыПоСрокамПогашения.Субконто1 КАК Субконто1,
	|		РасчетыПоСрокамПогашения.Субконто2 КАК Субконто2,
	|		РасчетыПоСрокамПогашения.Субконто3 КАК Субконто3,
	|		РасчетыПоСрокамПогашения.ДатаВозникновения КАК ДатаВозникновения,
	|		РасчетыПоСрокамПогашения.ДатаПогашения КАК ДатаПогашения,
	|		РасчетыПоСрокамПогашения.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|		РасчетыПоСрокамПогашения.ЗаписыватьВРегистр КАК ЗаписыватьВРегистр,
	|		0 КАК УровеньДетализации,
	|		РасчетыПоСрокамПогашения.ОстатокДолга КАК ОстатокДолга,
	|		0 КАК ОстатокРезерва,
	|		0 КАК ОстатокНДС
	|	ИЗ
	|		РасчетыПоСрокамПогашения КАК РасчетыПоСрокамПогашения
	|	ГДЕ
	|		РасчетыПоСрокамПогашения.ОстатокДолга > 0
	|		И НЕ РасчетыПоСрокамПогашения.НайтиДатуВозникновения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыДатаВозникновенияПоРегистратору.Организация,
	|		РасчетыДатаВозникновенияПоРегистратору.Счет,
	|		РасчетыДатаВозникновенияПоРегистратору.Субконто1,
	|		РасчетыДатаВозникновенияПоРегистратору.Субконто2,
	|		РасчетыДатаВозникновенияПоРегистратору.Субконто3,
	|		РасчетыДатаВозникновенияПоРегистратору.ДатаВозникновения,
	|		РасчетыДатаВозникновенияПоРегистратору.ДатаПогашения,
	|		РасчетыДатаВозникновенияПоРегистратору.ИсточникСрокаПогашения,
	|		РасчетыДатаВозникновенияПоРегистратору.ЗаписыватьВРегистр,
	|		0,
	|		РасчетыДатаВозникновенияПоРегистратору.ОстатокДолга,
	|		0,
	|		0
	|	ИЗ
	|		РасчетыДатаВозникновенияПоРегистратору КАК РасчетыДатаВозникновенияПоРегистратору
	|	ГДЕ
	|		РасчетыДатаВозникновенияПоРегистратору.ОстатокДолга > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыПоСомнительнымДолгам.Организация,
	|		РезервыПоСомнительнымДолгам.СчетРасчетов,
	|		РезервыПоСомнительнымДолгам.Субконто1,
	|		РезервыПоСомнительнымДолгам.Субконто2,
	|		РезервыПоСомнительнымДолгам.Субконто3,
	|		РезервыПоСомнительнымДолгам.ДатаВозникновения,
	|		РезервыПоСомнительнымДолгам.ДатаПогашения,
	|		НЕОПРЕДЕЛЕНО,
	|		ИСТИНА,
	|		РезервыПоСомнительнымДолгам.УровеньДетализации,
	|		0,
	|		РезервыПоСомнительнымДолгам.Сальдо,
	|		0
	|	ИЗ
	|		РезервыПоСомнительнымДолгам КАК РезервыПоСомнительнымДолгам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСАвансов.Организация,
	|		НДСАвансов.СчетРасчетов,
	|		НДСАвансов.Субконто1,
	|		НДСАвансов.Субконто2,
	|		НДСАвансов.Субконто3,
	|		НДСАвансов.ДатаВозникновения,
	|		НДСАвансов.ДатаПогашения,
	|		НЕОПРЕДЕЛЕНО,
	|		ИСТИНА,
	|		0,
	|		0,
	|		0,
	|		НДСАвансов.Сальдо
	|	ИЗ
	|		НДСАвансов КАК НДСАвансов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АвансыАренды.Организация,
	|		АвансыАренды.Счет,
	|		АвансыАренды.Контрагент,
	|		АвансыАренды.ДоговорКонтрагента,
	|		НЕОПРЕДЕЛЕНО,
	|		АвансыАренды.ДатаВозникновения,
	|		АвансыАренды.ДатаПогашения,
	|		НЕОПРЕДЕЛЕНО,
	|		ИСТИНА,
	|		0,
	|		АвансыАренды.АвансыПоАренде,
	|		0,
	|		АвансыАренды.НДСсПлатежей
	|	ИЗ
	|		АвансыАренды КАК АвансыАренды) КАК Расчеты
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Счет,
	|	Расчеты.Субконто1,
	|	Расчеты.Субконто2,
	|	Расчеты.Субконто3,
	|	Расчеты.ДатаПогашения,
	|	Расчеты.ДатаВозникновения
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Расчеты.ЗаписыватьВРегистр) = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	ДатаВозникновения,
	|	ДатаПогашения";
		
КонецФункции

#КонецОбласти

#Область КредиторскаяЗадолженность

Функция КонтекстРасчетаКредиторская()
	
	КонтекстРасчета = Новый Структура;
	КонтекстРасчета.Вставить("ВидЗадолженности", Перечисления.ВидыЗадолженности.Кредиторская);
	
	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	ВидыСчетов.Добавить(ВидСчета.Пассивный);
	КонтекстРасчета.Вставить("ВидыСчетов", ВидыСчетов);
	
	СчетаНДСАвансов = Новый Массив;
	СчетаНДСАвансов.Добавить(ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам);
	
	СчетаИнвентаризацииРасчетов = СчетаИнвентаризацииРасчетовКредиторская();
	СчетаРасчетовСПоставщиками = СчетаРасчетовСПоставщиками();
	СчетаУчетаАвансов = СчетаУчетаАвансовПолученных();
	СчетаКредитовЗаймов = СчетаДолгосрочныхКредитовЗаймов();
	
	СчетаКлассификации = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаКлассификации, СчетаИнвентаризацииРасчетов);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаКлассификации, СчетаРасчетовСПоставщиками);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаКлассификации, СчетаУчетаАвансов);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаКлассификации, СчетаКредитовЗаймов);

	// Список счетов, у которых дата погашения может быть получена только из инвентаризации расчетов и нет корректирующих величин
	СчетаСоСроками = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаСоСроками, СчетаРасчетовСПоставщиками);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаСоСроками, СчетаУчетаАвансов);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаСоСроками, СчетаКредитовЗаймов);
	СчетаИсключитьБезДатыПогашения = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаИсключитьБезДатыПогашения, СчетаКлассификации);
	Для Каждого Счет Из СчетаСоСроками Цикл
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СчетаИсключитьБезДатыПогашения, Счет);
	КонецЦикла;
	
	КонтекстРасчета.Вставить("СчетаИнвентаризацииРасчетов", СчетаИнвентаризацииРасчетов);
	КонтекстРасчета.Вставить("СчетаУчетаАвансов", СчетаУчетаАвансов);
	КонтекстРасчета.Вставить("СчетаКредитовЗаймов", СчетаКредитовЗаймов);
	КонтекстРасчета.Вставить("СчетаКлассификации", СчетаКлассификации);
	КонтекстРасчета.Вставить("СчетаИсключитьБезДатыПогашения", СчетаИсключитьБезДатыПогашения);

	Возврат КонтекстРасчета;
	
КонецФункции

Функция КредиторскаяЗадолженностьПоСрокам(КонтекстОперации, РасчетныеДанные)

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СоздатьВременныеТаблицыАрендныеОбязательства(МенеджерВременныхТаблиц, РасчетныеДанные.РасчетыПоАренде.АрендныеОбязательства, КонтекстОперации);
	СоздатьВременныеТаблицыЗадолженностьВРассрочку(МенеджерВременныхТаблиц, РасчетныеДанные.РасчетыПоРассрочке, КонтекстОперации);
	
	КонтекстРасчета= КонтекстРасчетаКредиторская();

	СоздатьВременныеТаблицыРаспределеннаяЗадолженностьПоСрокам(МенеджерВременныхТаблиц, КонтекстОперации, КонтекстРасчета);
	
	// Объекты авансов
	СоздатьВременныеТаблицыОбъектыАвансов(МенеджерВременныхТаблиц, КонтекстРасчета.СчетаУчетаАвансов);
	
	// НДС с авансов, распределенный по объектам авансов
	СоздатьВременныеТаблицыРаспределенныеНДСАвансов(МенеджерВременныхТаблиц, КонтекстОперации.КонецПериодаДата, КонтекстОперации.Организации, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СФВыданные);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачалаДолгосрочногоПериода", КонтекстОперации.ДатаНачалаДолгосрочногоПериода);
	Запрос.Текст = ТекстЗапросаОбъединитьВсеРасчетыКредиторская();

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ТекстЗапросаКредиторскаяЗадолженностьПоСрокам(КонтекстЗапроса, ИмяПоместить, МенеджерВременныхТаблиц = Неопределено)
	
	// Для остатков расчетов получаем дату погашения по срокам оплаты, указанных в договорах или документах расчетов
	ТекстыЗапросов = Новый Массив;
	ТекстЗапроса = ШаблонТекстаЗапросаРасчеты();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицыРасчеты", ИмяПоместить);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	ВременныеТаблицы = КонтекстЗапроса.ВременныеТаблицы;
	Если ВременныеТаблицы.Найти("РасчетыСКонтрагентамиПоДоговорам") <> Неопределено Тогда
		
		Если КонтекстЗапроса.ОпределитьСроки Тогда
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Расчеты.Организация КАК Организация,
			|	Расчеты.Счет КАК Счет,
			|	Расчеты.Субконто1 КАК Субконто1,
			|	Расчеты.Субконто2 КАК Субконто2,
			|	Расчеты.Субконто3 КАК Субконто3,
			|	Расчеты.ОстатокКт КАК ОстатокБУ
			|ИЗ
			|	РасчетыСКонтрагентамиПоДоговорам КАК Расчеты
			|ГДЕ
			|	Расчеты.Счет В(&СчетаРасчетовСПоставщиками)
			|	И Расчеты.ОстатокКт <> 0";
			
			Если МенеджерВременныхТаблиц <> Неопределено И МенеджерВременныхТаблиц.Таблицы.Найти("ЗадолженностьВРассрочку") <> Неопределено Тогда
				ТекстЗапроса = 
				"ВЫБРАТЬ
				|	Расчеты.Организация КАК Организация,
				|	Расчеты.Счет КАК Счет,
				|	Расчеты.Субконто1 КАК Субконто1,
				|	Расчеты.Субконто2 КАК Субконто2,
				|	Расчеты.Субконто3 КАК Субконто3,
				|	Расчеты.ОстатокКт КАК ОстатокБУ
				|ИЗ
				|	РасчетыСКонтрагентамиПоДоговорам КАК Расчеты
				|		ЛЕВОЕ СОЕДИНЕНИЕ АналитикаРассрочки КАК АналитикаРассрочки
				|		ПО Расчеты.Организация = АналитикаРассрочки.Организация
				|			И Расчеты.Счет = АналитикаРассрочки.Счет
				|			И Расчеты.Субконто1 = АналитикаРассрочки.Контрагент
				|			И Расчеты.Субконто2 = АналитикаРассрочки.ДоговорКонтрагента
				|ГДЕ
				|	Расчеты.Счет В(&СчетаРасчетовСПоставщиками)
				|	И Расчеты.ОстатокКт <> 0
				|	И АналитикаРассрочки.Организация ЕСТЬ NULL";
			КонецЕсли;
			ПараметрыСвязи = НовыйПараметрыСвязиВременнойТаблицыРасчеты();
			ПараметрыСвязи.ИмяТаблицы =         "Расчеты";
			ПараметрыСвязи.ИмяПоляСчет =        "Счет";
			ПараметрыСвязи.ИмяПоляОрганизация = "Организация";
			ПараметрыСвязи.ИмяПоляДоговор =     "Субконто2";
			ПараметрыСвязи.ИмяПоляДокумент =    "Субконто3";
			
			ДополнитьЗапросДаннымиПоСрокамОплаты(ТекстЗапроса, ПараметрыСвязи, КонтекстЗапроса.ПараметрыЗапроса);
		Иначе
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Расчеты.Организация КАК Организация,
			|	Расчеты.Счет КАК Счет,
			|	Расчеты.Субконто1 КАК Субконто1,
			|	Расчеты.Субконто2 КАК Субконто2,
			|	Расчеты.Субконто3 КАК Субконто3,
			|	Расчеты.ОстатокКт КАК ОстатокБУ,
			|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратора,
			|	НЕ ДанныеПервичныхДокументов.ДатаРегистратора ЕСТЬ NULL КАК ЕстьДокументРасчетов,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашенияБУ,
			|	НЕОПРЕДЕЛЕНО КАК ИсточникСрокаПогашения
			|ИЗ
			|	РасчетыСКонтрагентамиПоДоговорам КАК Расчеты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
			|		ПО Расчеты.Организация = ДанныеПервичныхДокументов.Организация
			|			И Расчеты.Субконто3 = ДанныеПервичныхДокументов.Документ
			|ГДЕ
			|	Расчеты.Счет В(&СчетаРасчетовСПоставщиками)
			|	И Расчеты.ОстатокКт <> 0";
		КонецЕсли;
		
		ТекстыЗапросов.Добавить(ТекстЗапроса);

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Расчеты.Организация КАК Организация,
		|	Расчеты.Счет КАК Счет,
		|	Расчеты.Субконто1 КАК Субконто1,
		|	Расчеты.Субконто2 КАК Субконто2,
		|	Расчеты.Субконто3 КАК Субконто3,
		|	Расчеты.ОстатокКт КАК ОстатокБУ,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРегистратора,
		|	ЛОЖЬ КАК ЕстьДокументРасчетов,
		|	ВЫБОР
		|		КОГДА &ОпределитьСроки
		|			ТОГДА ЕСТЬNULL(ДоговорыКонтрагентов.СрокДействия, ДАТАВРЕМЯ(1, 1, 1))
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаПогашенияБУ,
		|	ВЫБОР
		|		КОГДА &ОпределитьСроки
		|				И ДоговорыКонтрагентов.Ссылка ЕСТЬ НЕ NULL 
		|				И ДоговорыКонтрагентов.СрокДействия <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДоговорыКонтрагентов.Ссылка
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ИсточникСрокаПогашения
		|ИЗ
		|	РасчетыСКонтрагентамиПоДоговорам КАК Расчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО Расчеты.Субконто2 = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	Расчеты.Счет В(&СчетаКредитовЗаймов)
		|	И Расчеты.ОстатокКт <> 0";
		ТекстыЗапросов.Добавить(ТекстЗапроса);

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Расчеты.Организация КАК Организация,
		|	Расчеты.Счет КАК Счет,
		|	Расчеты.Субконто1 КАК Субконто1,
		|	Расчеты.Субконто2 КАК Субконто2,
		|	Расчеты.Субконто3 КАК Субконто3,
		|	Расчеты.ОстатокКт КАК ОстатокБУ,
		|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратора,
		|	НЕ ДанныеПервичныхДокументов.ДатаРегистратора ЕСТЬ NULL КАК ЕстьДокументРасчетов,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашенияБУ,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникСрокаПогашения
		|ИЗ
		|	РасчетыСКонтрагентамиПоДоговорам КАК Расчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|		ПО Расчеты.Организация = ДанныеПервичныхДокументов.Организация
		|			И Расчеты.Субконто3 = ДанныеПервичныхДокументов.Документ
		|ГДЕ
		|	НЕ Расчеты.Счет В (&СчетаРасчетовСПоставщиками, &СчетаКредитовЗаймов)
		|	И Расчеты.ОстатокКт <> 0";
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
		//ПараметрыЗапроса формируются в зависимости от объединяемых текстов запросов. Параметр "СчетаКредитовЗаймов" может принимать различные значения.
		//Например, при классификации задолженности учитываются только долгосрочные кредиты и займы.
		//Поэтому данный параметр задается в контексте вызова. Если параметр не задан, он считается необязательным.
		Если Не КонтекстЗапроса.ПараметрыЗапроса.Свойство("СчетаКредитовЗаймов") Тогда
			КонтекстЗапроса.ПараметрыЗапроса.Вставить("СчетаКредитовЗаймов", Новый Массив);
		КонецЕсли;
		КонтекстЗапроса.ПараметрыЗапроса.Вставить("СчетаРасчетовСПоставщиками", СчетаРасчетовСПоставщиками());
		КонтекстЗапроса.ПараметрыЗапроса.Вставить("ОпределитьСроки", КонтекстЗапроса.ОпределитьСроки);
		
	КонецЕсли;

	Если ВременныеТаблицы.Найти("РасчетыПрочие") <> Неопределено Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Расчеты.Организация КАК Организация,
		|	Расчеты.Счет КАК Счет,
		|	Расчеты.Субконто1 КАК Субконто1,
		|	Расчеты.Субконто2 КАК Субконто2,
		|	Расчеты.Субконто3 КАК Субконто3,
		|	Расчеты.ОстатокКт КАК ОстатокБУ,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРегистратора,
		|	ЛОЖЬ КАК ЕстьДокументРасчетов,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашенияБУ,
		|	НЕОПРЕДЕЛЕНО КАК ИсточникСрокаПогашения
		|ИЗ
		|	РасчетыПрочие КАК Расчеты
		|ГДЕ
		|	Расчеты.ОстатокКт <> 0";
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Возврат СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.ТекстОбъединитьВсе());

КонецФункции

Функция ТекстЗапросаОбъединитьВсеРасчетыКредиторская()

	Возврат 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Кредиторская) КАК ВидЗадолженности,
	|	Расчеты.Организация КАК Организация,
	|	Расчеты.Счет КАК Счет,
	|	Расчеты.Субконто1 КАК Субконто1,
	|	Расчеты.Субконто2 КАК Субконто2,
	|	Расчеты.Субконто3 КАК Субконто3,
	|	Расчеты.ДатаВозникновения КАК ДатаВозникновения,
	|	Расчеты.ДатаПогашения КАК ДатаПогашения,
	|	МАКСИМУМ(Расчеты.ИсточникСрокаПогашения) КАК ИсточникСрокаПогашения,
	|	МАКСИМУМ(Расчеты.ЗаписыватьВРегистр) КАК ЗаписыватьВРегистр,
	|	СУММА(Расчеты.ОстатокДолга) КАК ОстатокДолга,
	|	СУММА(Расчеты.ОстатокНДС) КАК НДСАвансов,
	|	СУММА(Расчеты.ПроцентыПоРассрочке) КАК ПроцентыПоРассрочке
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоСрокамПогашения.Организация КАК Организация,
	|		РасчетыПоСрокамПогашения.Счет КАК Счет,
	|		РасчетыПоСрокамПогашения.Субконто1 КАК Субконто1,
	|		РасчетыПоСрокамПогашения.Субконто2 КАК Субконто2,
	|		РасчетыПоСрокамПогашения.Субконто3 КАК Субконто3,
	|		РасчетыПоСрокамПогашения.ДатаВозникновения КАК ДатаВозникновения,
	|		РасчетыПоСрокамПогашения.ДатаПогашения КАК ДатаПогашения,
	|		РасчетыПоСрокамПогашения.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|		РасчетыПоСрокамПогашения.ЗаписыватьВРегистр КАК ЗаписыватьВРегистр,
	|		РасчетыПоСрокамПогашения.ОстатокДолга КАК ОстатокДолга,
	|		0 КАК ОстатокНДС,
	|		0 КАК ПроцентыПоРассрочке
	|	ИЗ
	|		РасчетыПоСрокамПогашения КАК РасчетыПоСрокамПогашения
	|	ГДЕ
	|		РасчетыПоСрокамПогашения.ОстатокДолга > 0
	|		И НЕ РасчетыПоСрокамПогашения.НайтиДатуВозникновения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыДатаВозникновенияПоРегистратору.Организация,
	|		РасчетыДатаВозникновенияПоРегистратору.Счет,
	|		РасчетыДатаВозникновенияПоРегистратору.Субконто1,
	|		РасчетыДатаВозникновенияПоРегистратору.Субконто2,
	|		РасчетыДатаВозникновенияПоРегистратору.Субконто3,
	|		РасчетыДатаВозникновенияПоРегистратору.ДатаВозникновения,
	|		РасчетыДатаВозникновенияПоРегистратору.ДатаПогашения,
	|		РасчетыДатаВозникновенияПоРегистратору.ИсточникСрокаПогашения,
	|		РасчетыДатаВозникновенияПоРегистратору.ЗаписыватьВРегистр,
	|		РасчетыДатаВозникновенияПоРегистратору.ОстатокДолга,
	|		0,
	|		0
	|	ИЗ
	|		РасчетыДатаВозникновенияПоРегистратору КАК РасчетыДатаВозникновенияПоРегистратору
	|	ГДЕ
	|		РасчетыДатаВозникновенияПоРегистратору.ОстатокДолга > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСАвансов.Организация,
	|		НДСАвансов.СчетРасчетов,
	|		НДСАвансов.Субконто1,
	|		НДСАвансов.Субконто2,
	|		НДСАвансов.Субконто3,
	|		НДСАвансов.ДатаВозникновения,
	|		НДСАвансов.ДатаПогашения,
	|		НЕОПРЕДЕЛЕНО,
	|		ИСТИНА,
	|		0,
	|		НДСАвансов.Сальдо,
	|		0
	|	ИЗ
	|		НДСАвансов КАК НДСАвансов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АрендныеОбязательства.Организация,
	|		АрендныеОбязательства.Счет,
	|		АрендныеОбязательства.Контрагент,
	|		АрендныеОбязательства.ДоговорКонтрагента,
	|		НЕОПРЕДЕЛЕНО,
	|		АрендныеОбязательства.ДатаВозникновения,
	|		АрендныеОбязательства.ДатаПогашения,
	|		НЕОПРЕДЕЛЕНО,
	|		ИСТИНА,
	|		АрендныеОбязательства.Обязательство,
	|		0,
	|		0
	|	ИЗ
	|		АрендныеОбязательства КАК АрендныеОбязательства
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗадолженностьВРассрочку.Организация,
	|		ЗадолженностьВРассрочку.Счет,
	|		ЗадолженностьВРассрочку.Контрагент,
	|		ЗадолженностьВРассрочку.ДоговорКонтрагента,
	|		НЕОПРЕДЕЛЕНО,
	|		ЗадолженностьВРассрочку.ДатаВозникновения,
	|		ЗадолженностьВРассрочку.ДатаПогашения,
	|		НЕОПРЕДЕЛЕНО,
	|		ИСТИНА,
	|		ЗадолженностьВРассрочку.НоминальнаяВеличина,
	|		0,
	|		ЗадолженностьВРассрочку.ПроцентыПоРассрочке
	|	ИЗ
	|		ЗадолженностьВРассрочку КАК ЗадолженностьВРассрочку) КАК Расчеты
	|
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.Организация,
	|	Расчеты.Счет,
	|	Расчеты.Субконто1,
	|	Расчеты.Субконто2,
	|	Расчеты.Субконто3,
	|	Расчеты.ДатаПогашения,
	|	Расчеты.ДатаВозникновения
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(Расчеты.ЗаписыватьВРегистр) = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	ДатаВозникновения,
	|	ДатаПогашения";

КонецФункции

#КонецОбласти

Процедура СоздатьВременныеТаблицыРаспределеннаяЗадолженностьПоСрокам(МенеджерВременныхТаблиц, КонтекстОперации, КонтекстРасчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организации",      КонтекстОперации.Организации);
	Запрос.УстановитьПараметр("КонецПериода",     КонтекстОперации.КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаДата", КонтекстОперации.КонецПериодаДата);
	Запрос.УстановитьПараметр("НачалоПредыдущегоПериода", ДобавитьМесяц(НачалоГода(КонтекстОперации.КонецПериодаДата), -12));
	Запрос.УстановитьПараметр("ДатаНачалаДолгосрочногоПериода", КонтекстОперации.ДатаНачалаДолгосрочногоПериода);
	Запрос.УстановитьПараметр("ВидЗадолженности", КонтекстРасчета.ВидЗадолженности);
	Запрос.УстановитьПараметр("СчетаИнвентаризацииРасчетов", КонтекстРасчета.СчетаИнвентаризацииРасчетов);
	Запрос.УстановитьПараметр("СчетаИсключитьБезДатыПогашения", КонтекстРасчета.СчетаИсключитьБезДатыПогашения);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("ТипыДокументовРасчетов", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами.ТипЗначения.Типы());
	
	// Счета, по которым есть детализированные записи в документах Инвентаризации расчетов с контрагентами за заданный период
	СчетаИнвентаризацииРасчетовДетализация = СчетаИнвентаризацииРасчетовДетализация(Запрос);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КонтекстРасчета.СчетаКлассификации, СчетаИнвентаризацииРасчетовДетализация);

	СписокВидовСубконто = СписокВидовСубконто();
	ТаблицаСчетов = НовыйТаблицаСчетов();
	НаборыСчетов = НаборыСчетовКлассификацииЗадолженности(КонтекстРасчета.ВидЗадолженности, СписокВидовСубконто);
	ЗаполнитьНаборыСчетами(НаборыСчетов, КонтекстРасчета.СчетаКлассификации, ТаблицаСчетов, Истина, Истина);
	
	КонтекстРасчета.СчетаКлассификации = Новый Массив;
	// Обход по наборам для заполнения счетами параметров запроса
	Для Каждого Набор Из НаборыСчетов Цикл
		Запрос.УстановитьПараметр(Набор.ИмяНабора, Набор.СписокСчетов);
		// переопределение списка счетов классификации после определения наборов
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КонтекстРасчета.СчетаКлассификации, Набор.СписокСчетов);
	КонецЦикла;
	Запрос.УстановитьПараметр("СчетаКлассификации", КонтекстРасчета.СчетаКлассификации);
	
	Для Каждого ВидыСубконто Из СписокВидовСубконто Цикл
		Запрос.УстановитьПараметр(ВидыСубконто.Ключ, ВидыСубконто.Значение);
	КонецЦикла;
	
	// Остатки задолженности по счетам, которые участвуют в классификации задолженности по срокам погашения
	КонтекстЗапроса = НовыйКонтекстЗапросаОстаткиЗадолженности();
	КонтекстЗапроса.ОпределитьСроки = Истина;
	Запрос.Текст = ТекстЗапросаОстаткиЗадолженности(НаборыСчетов, КонтекстЗапроса, КонтекстРасчета.ВидЗадолженности);
	Запрос.Выполнить();
	СкорректироватьОстаткиСУчетомДетализацииБаланса(МенеджерВременныхТаблиц, КонтекстРасчета.ВидЗадолженности);
	
	ИмяВременнойТаблицы = "Расчеты";
	Если КонтекстРасчета.ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
		Запрос.Текст = ТекстЗапросаДебиторскаяЗадолженностьПоСрокам(КонтекстЗапроса, ИмяВременнойТаблицы, КонтекстОперации);
	ИначеЕсли КонтекстРасчета.ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		КонтекстЗапроса.ПараметрыЗапроса.Вставить("СчетаКредитовЗаймов", КонтекстРасчета.СчетаКредитовЗаймов); // в классификации задолженности участвуют только долгосрочные кредиты и займы
		Запрос.Текст = ТекстЗапросаКредиторскаяЗадолженностьПоСрокам(КонтекстЗапроса, ИмяВременнойТаблицы, МенеджерВременныхТаблиц);
	КонецЕсли;
	
	Для Каждого Параметр Из КонтекстЗапроса.ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	Запрос.Выполнить();
	
	// Необходима для отбора детальных записей в инвентаризации расчетов
	СоздатьВременнуюТаблицуАналитика(Запрос, ИмяВременнойТаблицы);
	
	// По инвентаризации расчетов с контрагентами определяются даты погашения
	СоздатьВременныеТаблицыРаспределенныеДанныеПоИнвентаризацииРасчетов(Запрос, ТаблицаСчетов);

	// Определяется дата возникновения по тем объектам, у которых она не определена ранее
	СоздатьВременныеТаблицыРаспределенныеДанныеПоДатамВозникновения(Запрос);
	
КонецПроцедуры

Процедура СоздатьВременнуюТаблицуАналитика(Запрос, ИмяВременнойТаблицы)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВременнаяТаблица.Организация КАК Организация,
	|	ВременнаяТаблица.Счет КАК Счет,
	|	ВременнаяТаблица.Субконто1 КАК Субконто1,
	|	ВременнаяТаблица.Субконто2 КАК Субконто2,
	|	ВременнаяТаблица.Субконто3 КАК Субконто3
	|ПОМЕСТИТЬ Аналитика
	|ИЗ
	|	&ВременнаяТаблица КАК ВременнаяТаблица";
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&ВременнаяТаблица", ИмяВременнойТаблицы);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВременныеТаблицыИнвентаризацияРасчетовДетализация(Запрос, ТаблицаСчетов)
	
	Если ТаблицаСчетов = Неопределено Тогда
		ТаблицаСчетов = НовыйТаблицаСчетов();
	КонецЕсли;
	Запрос.УстановитьПараметр("ТаблицаСчетов", ТаблицаСчетов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаСчетов.Счет КАК Счет,
	|	ТаблицаСчетов.Код КАК Код,
	|	ТаблицаСчетов.КодГруппы КАК КодГруппы,
	|	ТаблицаСчетов.Порядок КАК Порядок,
	|	ТаблицаСчетов.ВидСчета КАК ВидСчета,
	|	ТаблицаСчетов.ВидСубконто1 КАК ВидСубконто1,
	|	ТаблицаСчетов.ВидСубконто2 КАК ВидСубконто2,
	|	ТаблицаСчетов.ВидСубконто3 КАК ВидСубконто3
	|ПОМЕСТИТЬ СчетаНаборов
	|ИЗ
	|	&ТаблицаСчетов КАК ТаблицаСчетов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентаризацияРасчетов.Ссылка КАК Ссылка,
	|	ИнвентаризацияРасчетов.Дата КАК Дата,
	|	ИнвентаризацияРасчетов.Организация КАК Организация,
	|	ИнвентаризацияРасчетовДетальныеЗаписи.СчетРасчетов КАК СчетРасчетов,
	|	ВЫБОР
	|		КОГДА СчетаНаборов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|				ИЛИ УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ИнвентаризацияРасчетовДетальныеЗаписи.Субконто1) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ИнвентаризацияРасчетовДетальныеЗаписи.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА СчетаНаборов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|				ИЛИ УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ИнвентаризацияРасчетовДетальныеЗаписи.Субконто2) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ИнвентаризацияРасчетовДетальныеЗаписи.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА СчетаНаборов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|				ИЛИ УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ИнвентаризацияРасчетовДетальныеЗаписи.Субконто3) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ИнвентаризацияРасчетовДетальныеЗаписи.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	ИнвентаризацияРасчетовДетальныеЗаписи.Подтверждено КАК Подтверждено,
	|	ИнвентаризацияРасчетовДетальныеЗаписи.ДатаВозникновения КАК ДатаВозникновения,
	|	ИнвентаризацияРасчетовДетальныеЗаписи.ДатаПогашения КАК ДатаПогашения
	|ПОМЕСТИТЬ ВсеДетальныеЗаписи
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовСКонтрагентами.ДетальныеЗаписи КАК ИнвентаризацияРасчетовДетальныеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияРасчетовСКонтрагентами КАК ИнвентаризацияРасчетов
	|		ПО ИнвентаризацияРасчетовДетальныеЗаписи.Ссылка = ИнвентаризацияРасчетов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаНаборов КАК СчетаНаборов
	|		ПО ИнвентаризацияРасчетовДетальныеЗаписи.СчетРасчетов = СчетаНаборов.Счет
	|ГДЕ
	|	ИнвентаризацияРасчетов.Проведен
	|	И ИнвентаризацияРасчетов.Дата МЕЖДУ &НачалоПредыдущегоПериода И &КонецПериодаДата
	|	И ИнвентаризацияРасчетов.Организация В(&Организации)
	|	И ИнвентаризацияРасчетов.ДетализироватьЗадолженность
	|	И ИнвентаризацияРасчетовДетальныеЗаписи.ВидЗадолженности = &ВидЗадолженности
	|	И ИнвентаризацияРасчетовДетальныеЗаписи.СчетРасчетов В(&СчетаИнвентаризацииРасчетов)
	|	И ИнвентаризацияРасчетовДетальныеЗаписи.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И (ИнвентаризацияРасчетов.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&КонецПериодаДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериодаДата, ДЕНЬ)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ИнвентаризацияРасчетовДетальныеЗаписи.Субконто3) В (&ТипыДокументовРасчетов)
	|			ИЛИ ИнвентаризацияРасчетовДетальныеЗаписи.ДатаПогашения >= &КонецПериодаДата)
	|	И ИнвентаризацияРасчетовДетальныеЗаписи.Подтверждено > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СчетРасчетов,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеДетальныеЗаписи.Ссылка КАК Ссылка,
	|	ВсеДетальныеЗаписи.Ссылка.Дата КАК Дата,
	|	ВсеДетальныеЗаписи.Ссылка.Организация КАК Организация,
	|	ВсеДетальныеЗаписи.СчетРасчетов КАК СчетРасчетов,
	|	ВсеДетальныеЗаписи.Субконто1 КАК Субконто1,
	|	ВсеДетальныеЗаписи.Субконто2 КАК Субконто2,
	|	ВсеДетальныеЗаписи.Субконто3 КАК Субконто3,
	|	ВсеДетальныеЗаписи.Подтверждено КАК Подтверждено,
	|	ВсеДетальныеЗаписи.ДатаВозникновения КАК ДатаВозникновения,
	|	ВсеДетальныеЗаписи.ДатаПогашения КАК ДатаПогашения
	|ПОМЕСТИТЬ ДетальныеЗаписи
	|ИЗ
	|	Аналитика КАК Аналитика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеДетальныеЗаписи КАК ВсеДетальныеЗаписи
	|		ПО Аналитика.Организация = ВсеДетальныеЗаписи.Организация
	|			И Аналитика.Счет = ВсеДетальныеЗаписи.СчетРасчетов
	|			И Аналитика.Субконто1 = ВсеДетальныеЗаписи.Субконто1
	|			И Аналитика.Субконто2 = ВсеДетальныеЗаписи.Субконто2
	|			И Аналитика.Субконто3 = ВсеДетальныеЗаписи.Субконто3
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СчетРасчетов,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ДетальныеЗаписи.Дата) КАК Дата,
	|	ДетальныеЗаписи.Организация КАК Организация,
	|	ДетальныеЗаписи.СчетРасчетов КАК СчетРасчетов,
	|	ДетальныеЗаписи.Субконто1 КАК Субконто1,
	|	ДетальныеЗаписи.Субконто2 КАК Субконто2,
	|	ДетальныеЗаписи.Субконто3 КАК Субконто3
	|ПОМЕСТИТЬ МаксимальныеДаты
	|ИЗ
	|	ДетальныеЗаписи КАК ДетальныеЗаписи
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеЗаписи.Организация,
	|	ДетальныеЗаписи.Субконто1,
	|	ДетальныеЗаписи.Субконто2,
	|	ДетальныеЗаписи.Субконто3,
	|	ДетальныеЗаписи.СчетРасчетов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СчетРасчетов,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ДетальныеЗаписи.Ссылка) КАК Ссылка,
	|	ДетальныеЗаписи.Дата КАК Дата,
	|	ДетальныеЗаписи.Организация КАК Организация,
	|	ДетальныеЗаписи.СчетРасчетов КАК СчетРасчетов,
	|	ДетальныеЗаписи.Субконто1 КАК Субконто1,
	|	ДетальныеЗаписи.Субконто2 КАК Субконто2,
	|	ДетальныеЗаписи.Субконто3 КАК Субконто3
	|ПОМЕСТИТЬ ПоследниеДокументы
	|ИЗ
	|	МаксимальныеДаты КАК МаксимальныеДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДетальныеЗаписи КАК ДетальныеЗаписи
	|		ПО МаксимальныеДаты.Организация = ДетальныеЗаписи.Организация
	|			И МаксимальныеДаты.СчетРасчетов = ДетальныеЗаписи.СчетРасчетов
	|			И МаксимальныеДаты.Субконто1 = ДетальныеЗаписи.Субконто1
	|			И МаксимальныеДаты.Субконто2 = ДетальныеЗаписи.Субконто2
	|			И МаксимальныеДаты.Субконто3 = ДетальныеЗаписи.Субконто3
	|			И МаксимальныеДаты.Дата = ДетальныеЗаписи.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеЗаписи.Дата,
	|	ДетальныеЗаписи.Организация,
	|	ДетальныеЗаписи.СчетРасчетов,
	|	ДетальныеЗаписи.Субконто1,
	|	ДетальныеЗаписи.Субконто2,
	|	ДетальныеЗаписи.Субконто3
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СчетРасчетов,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДетальныеЗаписи.Ссылка КАК Ссылка,
	|	ДетальныеЗаписи.Дата КАК Дата,
	|	ДетальныеЗаписи.Организация КАК Организация,
	|	ДетальныеЗаписи.СчетРасчетов КАК СчетРасчетов,
	|	ДетальныеЗаписи.Субконто1 КАК Субконто1,
	|	ДетальныеЗаписи.Субконто2 КАК Субконто2,
	|	ДетальныеЗаписи.Субконто3 КАК Субконто3,
	|	ДетальныеЗаписи.Подтверждено КАК Подтверждено,
	|	ДетальныеЗаписи.ДатаВозникновения КАК ДатаВозникновения,
	|	ДетальныеЗаписи.ДатаПогашения КАК ДатаПогашения
	|ПОМЕСТИТЬ ИнвентаризацияРасчетов
	|ИЗ
	|	ПоследниеДокументы КАК ПоследниеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДетальныеЗаписи КАК ДетальныеЗаписи
	|		ПО ПоследниеДокументы.Организация = ДетальныеЗаписи.Организация
	|			И ПоследниеДокументы.СчетРасчетов = ДетальныеЗаписи.СчетРасчетов
	|			И ПоследниеДокументы.Субконто1 = ДетальныеЗаписи.Субконто1
	|			И ПоследниеДокументы.Субконто2 = ДетальныеЗаписи.Субконто2
	|			И ПоследниеДокументы.Субконто3 = ДетальныеЗаписи.Субконто3
	|			И ПоследниеДокументы.Ссылка = ДетальныеЗаписи.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВсеДетальныеЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимальныеДаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПоследниеДокументы";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция СчетаИнвентаризацииРасчетовДетализация(Запрос)
	
	Счета = Новый Массив;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияРасчетовДетальныеЗаписи.СчетРасчетов КАК СчетРасчетов
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовСКонтрагентами КАК ИнвентаризацияРасчетовСКонтрагентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИнвентаризацияРасчетовСКонтрагентами.ДетальныеЗаписи КАК ИнвентаризацияРасчетовДетальныеЗаписи
	|		ПО ИнвентаризацияРасчетовСКонтрагентами.Ссылка = ИнвентаризацияРасчетовДетальныеЗаписи.Ссылка
	|ГДЕ
	|	ИнвентаризацияРасчетовСКонтрагентами.Проведен
	|	И ИнвентаризацияРасчетовСКонтрагентами.Дата МЕЖДУ &НачалоПредыдущегоПериода И &КонецПериодаДата
	|	И ИнвентаризацияРасчетовСКонтрагентами.Организация В(&Организации)
	|	И ИнвентаризацияРасчетовСКонтрагентами.ДетализироватьЗадолженность
	|	И ИнвентаризацияРасчетовДетальныеЗаписи.ВидЗадолженности = &ВидЗадолженности
	|	И ИнвентаризацияРасчетовДетальныеЗаписи.СчетРасчетов В(&СчетаИнвентаризацииРасчетов)
	|	И ВЫБОР
	|			КОГДА ИнвентаризацияРасчетовСКонтрагентами.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&КонецПериодаДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериодаДата, ДЕНЬ)
	|				ТОГДА ИСТИНА
	|			КОГДА ТИПЗНАЧЕНИЯ(ИнвентаризацияРасчетовДетальныеЗаписи.Субконто3) В (&ТипыДокументовРасчетов)
	|					И ИнвентаризацияРасчетовДетальныеЗаписи.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ИнвентаризацияРасчетовДетальныеЗаписи.ДатаПогашения >= &КонецПериодаДата
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнвентаризацияРасчетовДетальныеЗаписи.СчетРасчетов";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Счета.Добавить(Выборка.СчетРасчетов);
	КонецЦикла;
	
	Возврат Счета;
КонецФункции

Процедура ПересчитатьОстаткиСовпадающейАналитикиВИнвентаризацииРасчетов(ТаблицаРасчетная, ДанныеРаспределения)
	
	Если Не ЗначениеЗаполнено(ДанныеРаспределения) Тогда
		Возврат;
	КонецЕсли;
	
	КолонкиГруппировки = "Организация, Счет, Субконто1, Субконто2, Субконто3, ДатаРегистратора, ДатаПогашенияБУ, ИсточникСрокаПогашения";
	
	// Данные по остаткам бухгалтерского учета
	КолонкиТаблицы = СтрШаблон("%1, %2", КолонкиГруппировки, "ОстатокБУ");

	ДанныеРасчетаБУ = ДанныеРаспределения.Скопировать(,КолонкиТаблицы);
	ДанныеРасчетаБУ.Свернуть(КолонкиТаблицы);
	
	Для Каждого СтрокаГруппировки Из ДанныеРасчетаБУ Цикл
		Отбор = Новый Структура(КолонкиГруппировки);
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаГруппировки);
		
		ОстатокБУ = СтрокаГруппировки.ОстатокБУ;
		
		СтрокиТаблицы = ДанныеРаспределения.НайтиСтроки(Отбор);

		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			
			СуммаРасчетная = Мин(СтрокаТаблицы.Подтверждено, ОстатокБУ);
			
			СтрокаРасчетная = ТаблицаРасчетная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРасчетная, СтрокаТаблицы, "Организация, Счет, Субконто1, Субконто2, Субконто3");
			СтрокаРасчетная.ДатаВозникновения = ?(ЗначениеЗаполнено(СтрокаТаблицы.ДатаРегистратора), СтрокаТаблицы.ДатаРегистратора, СтрокаТаблицы.ДатаВозникновенияИнвентаризация);
			СтрокаРасчетная.ДатаПогашения = СтрокаТаблицы.ДатаПогашенияИнвентаризация;
			СтрокаРасчетная.ИсточникСрокаПогашения = СтрокаТаблицы.ДокументИнвентаризации;
			СтрокаРасчетная.ЗаписыватьВРегистр = Истина;
			СтрокаРасчетная.СуммаРасчетная = СуммаРасчетная;
			ОстатокБУ = ОстатокБУ - СуммаРасчетная;
			
			Если ОстатокБУ = 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		// В Инвентаризации расчетов могут быть указаны суммы меньше, чем фактические остатки,
		// поэтому добавляем остаток за вычетом подтвержденных сумм по инвентаризации.
		Если ОстатокБУ > 0 Тогда
			СтрокаРасчетная = ТаблицаРасчетная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРасчетная, СтрокаГруппировки, "Организация, Счет, Субконто1, Субконто2, Субконто3,ИсточникСрокаПогашения");
			СтрокаРасчетная.ДатаВозникновения = СтрокаГруппировки.ДатаРегистратора;
			СтрокаРасчетная.ДатаПогашения = СтрокаГруппировки.ДатаПогашенияБУ;
			СтрокаРасчетная.ЗаписыватьВРегистр = Истина;
			СтрокаРасчетная.СуммаРасчетная = ОстатокБУ;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьВременныеТаблицыРаспределенныеДанныеПоДатамВозникновения(Запрос)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоСрокамПогашения.Организация КАК Организация,
	|	РасчетыПоСрокамПогашения.Счет КАК Счет,
	|	РасчетыПоСрокамПогашения.Субконто1 КАК Субконто1,
	|	РасчетыПоСрокамПогашения.Субконто2 КАК Субконто2,
	|	РасчетыПоСрокамПогашения.Субконто3 КАК Субконто3,
	|	РасчетыПоСрокамПогашения.ДатаВозникновения КАК ДатаВозникновения,
	|	РасчетыПоСрокамПогашения.ДатаПогашения КАК ДатаПогашения,
	|	РасчетыПоСрокамПогашения.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|	РасчетыПоСрокамПогашения.ЗаписыватьВРегистр КАК ЗаписыватьВРегистр,
	|	РасчетыПоСрокамПогашения.ОстатокДолга КАК ОстатокДолга
	|ПОМЕСТИТЬ ОбъектыРасчетовБезДатыВозникновения
	|ИЗ
	|	РасчетыПоСрокамПогашения КАК РасчетыПоСрокамПогашения
	|ГДЕ
	|	РасчетыПоСрокамПогашения.НайтиДатуВозникновения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	ДатаВозникновения,
	|	ДатаПогашения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Период КАК ДатаРегистратора,
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА СчетаНаборов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|				ИЛИ УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОбороты.Субконто1) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ХозрасчетныйОбороты.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА СчетаНаборов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|				ИЛИ УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОбороты.Субконто2) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ХозрасчетныйОбороты.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА СчетаНаборов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка)
	|				ИЛИ УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОбороты.Субконто3) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ХозрасчетныйОбороты.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	ВЫБОР
	|		КОГДА &ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Кредиторская)
	|			ТОГДА -1 * ХозрасчетныйОбороты.СуммаОборот
	|		ИНАЧЕ ХозрасчетныйОбороты.СуммаОборот
	|	КОНЕЦ КАК СуммаОборот
	|ПОМЕСТИТЬ ПериодыДвижений
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПредыдущегоПериода,
	|			&КонецПериода,
	|			День,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ОбъектыРасчетовБезДатыВозникновения.Счет
	|				ИЗ
	|					ОбъектыРасчетовБезДатыВозникновения КАК ОбъектыРасчетовБезДатыВозникновения),
	|			,
	|			Организация В (&Организации),
	|			,
	|			) КАК ХозрасчетныйОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаНаборов КАК СчетаНаборов
	|		ПО ХозрасчетныйОбороты.Счет = СчетаНаборов.Счет
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Кредиторская)
	|			ТОГДА -1 * ХозрасчетныйОбороты.СуммаОборот
	|		ИНАЧЕ ХозрасчетныйОбороты.СуммаОборот
	|	КОНЕЦ > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыРасчетов.Организация КАК Организация,
	|	ОбъектыРасчетов.Счет КАК Счет,
	|	ОбъектыРасчетов.Субконто1 КАК Субконто1,
	|	ОбъектыРасчетов.Субконто2 КАК Субконто2,
	|	ОбъектыРасчетов.Субконто3 КАК Субконто3
	|ПОМЕСТИТЬ ОбъектыРасчетовНайденыДвижения
	|ИЗ
	|	ОбъектыРасчетовБезДатыВозникновения КАК ОбъектыРасчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодыДвижений КАК ПериодыДвижений
	|		ПО ОбъектыРасчетов.Организация = ПериодыДвижений.Организация
	|			И ОбъектыРасчетов.Счет = ПериодыДвижений.Счет
	|			И ОбъектыРасчетов.Субконто1 = ПериодыДвижений.Субконто1
	|			И ОбъектыРасчетов.Субконто2 = ПериодыДвижений.Субконто2
	|			И ОбъектыРасчетов.Субконто3 = ПериодыДвижений.Субконто3
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Организация КАК Организация,
	|	ОбъектыРасчетов.Счет КАК Счет,
	|	ОбъектыРасчетов.Субконто1 КАК Субконто1,
	|	ОбъектыРасчетов.Субконто2 КАК Субконто2,
	|	ОбъектыРасчетов.Субконто3 КАК Субконто3,
	|	ОбъектыРасчетов.ДатаВозникновения КАК ДатаВозникновения,
	|	ОбъектыРасчетов.ДатаПогашения КАК ДатаПогашения,
	|	ОбъектыРасчетов.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|	ОбъектыРасчетов.ЗаписыватьВРегистр КАК ЗаписыватьВРегистр,
	|	ОбъектыРасчетов.ОстатокДолга КАК ОстатокДолга,
	|	НЕ ОбъектыРасчетовНайденыДвижения.Организация ЕСТЬ NULL КАК ЕстьОбороты
	|ПОМЕСТИТЬ ОбъектыРасчетовДвижения
	|ИЗ
	|	ОбъектыРасчетовБезДатыВозникновения КАК ОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъектыРасчетовНайденыДвижения КАК ОбъектыРасчетовНайденыДвижения
	|		ПО ОбъектыРасчетов.Организация = ОбъектыРасчетовНайденыДвижения.Организация
	|			И ОбъектыРасчетов.Счет = ОбъектыРасчетовНайденыДвижения.Счет
	|			И ОбъектыРасчетов.Субконто1 = ОбъектыРасчетовНайденыДвижения.Субконто1
	|			И ОбъектыРасчетов.Субконто2 = ОбъектыРасчетовНайденыДвижения.Субконто2
	|			И ОбъектыРасчетов.Субконто3 = ОбъектыРасчетовНайденыДвижения.Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыДвижений.Организация КАК Организация,
	|	ПериодыДвижений.Счет КАК Счет,
	|	ПериодыДвижений.Субконто1 КАК Субконто1,
	|	ПериодыДвижений.Субконто2 КАК Субконто2,
	|	ПериодыДвижений.Субконто3 КАК Субконто3,
	|	ПериодыДвижений.ДатаРегистратора КАК ДатаРегистратора,
	|	ПериодыДвижений.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	ПериодыДвижений КАК ПериодыДвижений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыРасчетовНайденыДвижения КАК ОбъектыРасчетовНайденыДвижения
	|		ПО ПериодыДвижений.Организация = ОбъектыРасчетовНайденыДвижения.Организация
	|			И ПериодыДвижений.Счет = ОбъектыРасчетовНайденыДвижения.Счет
	|			И ПериодыДвижений.Субконто1 = ОбъектыРасчетовНайденыДвижения.Субконто1
	|			И ПериодыДвижений.Субконто2 = ОбъектыРасчетовНайденыДвижения.Субконто2
	|			И ПериодыДвижений.Субконто3 = ОбъектыРасчетовНайденыДвижения.Субконто3
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	ДатаРегистратора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРасчетовДвижения.Организация КАК Организация,
	|	ОбъектыРасчетовДвижения.Счет КАК Счет,
	|	ОбъектыРасчетовДвижения.Субконто1 КАК Субконто1,
	|	ОбъектыРасчетовДвижения.Субконто2 КАК Субконто2,
	|	ОбъектыРасчетовДвижения.Субконто3 КАК Субконто3,
	|	ОбъектыРасчетовДвижения.ДатаВозникновения КАК ДатаВозникновения,
	|	ОбъектыРасчетовДвижения.ДатаПогашения КАК ДатаПогашения,
	|	ОбъектыРасчетовДвижения.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|	ОбъектыРасчетовДвижения.ЗаписыватьВРегистр КАК ЗаписыватьВРегистр,
	|	ОбъектыРасчетовДвижения.ОстатокДолга КАК ОстатокДолга
	|ИЗ
	|	ОбъектыРасчетовДвижения КАК ОбъектыРасчетовДвижения
	|ГДЕ
	|	ОбъектыРасчетовДвижения.ЕстьОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	ДатаПогашения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРасчетовНайденыДвижения.Организация КАК Организация,
	|	ОбъектыРасчетовНайденыДвижения.Счет КАК Счет,
	|	ОбъектыРасчетовНайденыДвижения.Субконто1 КАК Субконто1,
	|	ОбъектыРасчетовНайденыДвижения.Субконто2 КАК Субконто2,
	|	ОбъектыРасчетовНайденыДвижения.Субконто3 КАК Субконто3
	|ИЗ
	|	ОбъектыРасчетовНайденыДвижения КАК ОбъектыРасчетовНайденыДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3";
	
	Результат = Запрос.ВыполнитьПакет();
	ПоследнийИндекс = Результат.ВГраница();

	ВыборкаГруппировки = Результат[ПоследнийИндекс].Выбрать();
	
	ТаблицаЗадолженность = Результат[ПоследнийИндекс - 1].Выгрузить();
	ТаблицаЗадолженность.Индексы.Добавить("Организация, Счет, Субконто1, Субконто2, Субконто3");
	
	ВыборкаДвижения = Результат[ПоследнийИндекс - 2].Выбрать();
	
	ТаблицаРаспределения = ТаблицаЗадолженность.СкопироватьКолонки();
	
	КолонкиГруппировок = "Организация, Счет, Субконто1, Субконто2, Субконто3";
	
	Пока ВыборкаГруппировки.Следующий() Цикл
		
		Отбор = Новый Структура(КолонкиГруппировок);
		ЗаполнитьЗначенияСвойств(Отбор, ВыборкаГруппировки);
		СтрокиЗадолженности = ТаблицаЗадолженность.НайтиСтроки(Отбор);
		
		ВыборкаДвижения.Сбросить();
		
		ОстатокОборота = 0;
		ДатаВозникновения = Дата(1,1,1);
		
		Для Каждого СтрокаЗадолженность Из СтрокиЗадолженности Цикл
			
			ОстатокДолга = СтрокаЗадолженность.ОстатокДолга;
			
			Если ОстатокОборота > 0 Тогда
				СтрокаТаблицы = ТаблицаРаспределения.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаЗадолженность);
				СтрокаТаблицы.ОстатокДолга = Мин(ОстатокДолга, ОстатокОборота);
				СтрокаТаблицы.ДатаВозникновения = ДатаВозникновения;
				ОстатокДолга = ОстатокДолга - СтрокаТаблицы.ОстатокДолга;
				ОстатокОборота = ОстатокОборота - СтрокаТаблицы.ОстатокДолга;
			КонецЕсли;
			
			Если ОстатокДолга > 0 Тогда
				Пока ВыборкаДвижения.НайтиСледующий(Отбор) Цикл
					СтрокаТаблицы = ТаблицаРаспределения.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаЗадолженность);
					СтрокаТаблицы.ОстатокДолга = Мин(ОстатокДолга, ВыборкаДвижения.СуммаОборот);
					СтрокаТаблицы.ДатаВозникновения = ВыборкаДвижения.ДатаРегистратора;
					ДатаВозникновения = ВыборкаДвижения.ДатаРегистратора;
					ОстатокДолга = ОстатокДолга - СтрокаТаблицы.ОстатокДолга;
					ОстатокОборота = ВыборкаДвижения.СуммаОборот - СтрокаТаблицы.ОстатокДолга;
					Если ОстатокДолга = 0 Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ОстатокДолга > 0 Тогда
				СтрокаТаблицы = ТаблицаРаспределения.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаЗадолженность);
				СтрокаТаблицы.ОстатокДолга = ОстатокДолга;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаРаспределения.Организация КАК Организация,
	|	ТаблицаРаспределения.Счет КАК Счет,
	|	ТаблицаРаспределения.Субконто1 КАК Субконто1,
	|	ТаблицаРаспределения.Субконто2 КАК Субконто2,
	|	ТаблицаРаспределения.Субконто3 КАК Субконто3,
	|	ТаблицаРаспределения.ДатаВозникновения КАК ДатаВозникновения,
	|	ТаблицаРаспределения.ДатаПогашения КАК ДатаПогашения,
	|	ТаблицаРаспределения.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|	ТаблицаРаспределения.ЗаписыватьВРегистр КАК ЗаписыватьВРегистр,
	|	ТаблицаРаспределения.ОстатокДолга КАК ОстатокДолга
	|ПОМЕСТИТЬ ЗадолженностьРаспределенная
	|ИЗ
	|	&ТаблицаРаспределения КАК ТаблицаРаспределения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРасчетовДвижения.Организация КАК Организация,
	|	ОбъектыРасчетовДвижения.Счет КАК Счет,
	|	ОбъектыРасчетовДвижения.Субконто1 КАК Субконто1,
	|	ОбъектыРасчетовДвижения.Субконто2 КАК Субконто2,
	|	ОбъектыРасчетовДвижения.Субконто3 КАК Субконто3,
	|	ОбъектыРасчетовДвижения.ДатаВозникновения КАК ДатаВозникновения,
	|	ОбъектыРасчетовДвижения.ДатаПогашения КАК ДатаПогашения,
	|	ОбъектыРасчетовДвижения.ИсточникСрокаПогашения КАК ИсточникСрокаПогашения,
	|	ОбъектыРасчетовДвижения.ЗаписыватьВРегистр КАК ЗаписыватьВРегистр,
	|	ОбъектыРасчетовДвижения.ОстатокДолга КАК ОстатокДолга
	|ПОМЕСТИТЬ РасчетыДатаВозникновенияПоРегистратору
	|ИЗ
	|	ОбъектыРасчетовДвижения КАК ОбъектыРасчетовДвижения
	|ГДЕ
	|	НЕ ОбъектыРасчетовДвижения.ЕстьОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадолженностьРаспределенная.Организация,
	|	ЗадолженностьРаспределенная.Счет,
	|	ЗадолженностьРаспределенная.Субконто1,
	|	ЗадолженностьРаспределенная.Субконто2,
	|	ЗадолженностьРаспределенная.Субконто3,
	|	ЗадолженностьРаспределенная.ДатаВозникновения,
	|	ЗадолженностьРаспределенная.ДатаПогашения,
	|	ЗадолженностьРаспределенная.ИсточникСрокаПогашения,
	|	ЗадолженностьРаспределенная.ЗаписыватьВРегистр,
	|	ЗадолженностьРаспределенная.ОстатокДолга
	|ИЗ
	|	ЗадолженностьРаспределенная КАК ЗадолженностьРаспределенная";
	
	Запрос.УстановитьПараметр("ТаблицаРаспределения", ТаблицаРаспределения);
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Предназначена для корректировки остатков по активно-пассивным счетам с учетом детализации в балансе.
// В акте инвентаризации есть возможность указать полную аналитику по счету, по ней дату погашения и фактический остаток.
// При этом в балансе отражены расчеты до определенной детализации.
// Например, по счету 76.05 в акте инвентаризации указана дата погашения по конкретному поступлению товаров.
// При классификации по срокам учитывается данный документ. Но в баланс уже должны попасть свернутые данные по договору.
// Поэтому корректируем остатки в случае расхождений свернутых остатков с учетом документов расчетов и свернутых остатков с учетом договоров.
Процедура СкорректироватьОстаткиСУчетомДетализацииБаланса(МенеджерВременныхТаблиц, ВидЗадолженности)

	ВидыСчетов = Новый Массив;
	ВидыСчетов.Добавить(ВидСчета.АктивноПассивный);
	
	РасчетыСДебиторамиИКредиторами = СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами, ВидыСчетов);
	КорректировочныеСчетаДетализацияДоДоговоров = ЗаполнениеБухгалтерскойОтчетностиТабличное.СчетаПоСубконто(
													РасчетыСДебиторамиИКредиторами,
													ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами); 
	КорректировочныеСчетаДетализацияДоДоговоров = ЗаполнениеБухгалтерскойОтчетностиТабличное.СчетаПоСубконто(
													КорректировочныеСчетаДетализацияДоДоговоров,
													ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КорректировочныеСчетаДетализацияДоДоговоров", КорректировочныеСчетаДетализацияДоДоговоров);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АПРасчетыПоДокументамРасчетов.Организация КАК Организация,
	|	АПРасчетыПоДокументамРасчетов.Счет КАК Счет,
	|	АПРасчетыПоДокументамРасчетов.Субконто1 КАК Субконто1,
	|	АПРасчетыПоДокументамРасчетов.Субконто2 КАК Субконто2,
	|	НЕОПРЕДЕЛЕНО КАК Субконто3,
	|	ВЫБОР
	|		КОГДА СУММА(АПРасчетыПоДокументамРасчетов.ОстатокДт) > СУММА(АПРасчетыПоДокументамРасчетов.ОстатокКт)
	|			ТОГДА СУММА(АПРасчетыПоДокументамРасчетов.ОстатокДт) - СУММА(АПРасчетыПоДокументамРасчетов.ОстатокКт)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокДт,
	|	ВЫБОР
	|		КОГДА СУММА(АПРасчетыПоДокументамРасчетов.ОстатокДт) < СУММА(АПРасчетыПоДокументамРасчетов.ОстатокКт)
	|			ТОГДА СУММА(АПРасчетыПоДокументамРасчетов.ОстатокКт) - СУММА(АПРасчетыПоДокументамРасчетов.ОстатокДт)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокКт,
	|	СУММА(АПРасчетыПоДокументамРасчетов.ОстатокДт) <> ВЫБОР
	|			КОГДА СУММА(АПРасчетыПоДокументамРасчетов.ОстатокДт) > СУММА(АПРасчетыПоДокументамРасчетов.ОстатокКт)
	|				ТОГДА СУММА(АПРасчетыПоДокументамРасчетов.ОстатокДт) - СУММА(АПРасчетыПоДокументамРасчетов.ОстатокКт)
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|		ИЛИ СУММА(АПРасчетыПоДокументамРасчетов.ОстатокКт) <> ВЫБОР
	|			КОГДА СУММА(АПРасчетыПоДокументамРасчетов.ОстатокДт) < СУММА(АПРасчетыПоДокументамРасчетов.ОстатокКт)
	|				ТОГДА СУММА(АПРасчетыПоДокументамРасчетов.ОстатокКт) - СУММА(АПРасчетыПоДокументамРасчетов.ОстатокДт)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НеобходимоСкорректировать
	|ПОМЕСТИТЬ СгруппированныеРасчетыПоДоговорам
	|ИЗ
	|	АПРасчетыПоДокументамРасчетов КАК АПРасчетыПоДокументамРасчетов
	|ГДЕ
	|	АПРасчетыПоДокументамРасчетов.Счет В(&КорректировочныеСчетаДетализацияДоДоговоров)
	|
	|СГРУППИРОВАТЬ ПО
	|	АПРасчетыПоДокументамРасчетов.Организация,
	|	АПРасчетыПоДокументамРасчетов.Счет,
	|	АПРасчетыПоДокументамРасчетов.Субконто1,
	|	АПРасчетыПоДокументамРасчетов.Субконто2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АПРасчетыПоДокументамРасчетов.Организация КАК Организация,
	|	АПРасчетыПоДокументамРасчетов.Счет КАК Счет,
	|	АПРасчетыПоДокументамРасчетов.Субконто1 КАК Субконто1,
	|	АПРасчетыПоДокументамРасчетов.Субконто2 КАК Субконто2,
	|	АПРасчетыПоДокументамРасчетов.Субконто3 КАК Субконто3,
	|	АПРасчетыПоДокументамРасчетов.ОстатокДт КАК ОстатокДт,
	|	АПРасчетыПоДокументамРасчетов.ОстатокКт КАК ОстатокКт,
	|	ЕСТЬNULL(СгруппированныеРасчетыПоДоговорам.НеобходимоСкорректировать, ЛОЖЬ) КАК НеобходимоСкорректировать
	|ПОМЕСТИТЬ РасчетыСПолнойДетализацией
	|ИЗ
	|	АПРасчетыПоДокументамРасчетов КАК АПРасчетыПоДокументамРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ СгруппированныеРасчетыПоДоговорам КАК СгруппированныеРасчетыПоДоговорам
	|		ПО АПРасчетыПоДокументамРасчетов.Организация = СгруппированныеРасчетыПоДоговорам.Организация
	|			И АПРасчетыПоДокументамРасчетов.Счет = СгруппированныеРасчетыПоДоговорам.Счет
	|			И АПРасчетыПоДокументамРасчетов.Субконто1 = СгруппированныеРасчетыПоДоговорам.Субконто1
	|			И АПРасчетыПоДокументамРасчетов.Субконто2 = СгруппированныеРасчетыПоДоговорам.Субконто2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПолнойДетализацией.Организация КАК Организация,
	|	РасчетыСПолнойДетализацией.Счет КАК Счет,
	|	РасчетыСПолнойДетализацией.Субконто1 КАК Субконто1,
	|	РасчетыСПолнойДетализацией.Субконто2 КАК Субконто2,
	|	РасчетыСПолнойДетализацией.Субконто3 КАК Субконто3,
	|	РасчетыСПолнойДетализацией.ОстатокДт КАК ОстатокДт,
	|	РасчетыСПолнойДетализацией.ОстатокКт КАК ОстатокКт,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратора
	|ИЗ
	|	РасчетыСПолнойДетализацией КАК РасчетыСПолнойДетализацией
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО РасчетыСПолнойДетализацией.Организация = ДанныеПервичныхДокументов.Организация
	|			И РасчетыСПолнойДетализацией.Субконто3 = ДанныеПервичныхДокументов.Документ
	|ГДЕ
	|	РасчетыСПолнойДетализацией.НеобходимоСкорректировать
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	ДатаРегистратора УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СгруппированныеРасчетыПоДоговорам.Организация КАК Организация,
	|	СгруппированныеРасчетыПоДоговорам.Счет КАК Счет,
	|	СгруппированныеРасчетыПоДоговорам.Субконто1 КАК Субконто1,
	|	СгруппированныеРасчетыПоДоговорам.Субконто2 КАК Субконто2,
	|	СгруппированныеРасчетыПоДоговорам.ОстатокДт КАК ОстатокДт,
	|	СгруппированныеРасчетыПоДоговорам.ОстатокКт КАК ОстатокКт
	|ИЗ
	|	СгруппированныеРасчетыПоДоговорам КАК СгруппированныеРасчетыПоДоговорам
	|ГДЕ
	|	СгруппированныеРасчетыПоДоговорам.НеобходимоСкорректировать
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Счет,
	|	Субконто1,
	|	Субконто2";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ПоследнийИндекс = ПакетЗапросов.ВГраница();
	
	ДанныеСгруппированные = ПакетЗапросов[ПоследнийИндекс].Выгрузить();
	ДанныеРаспределения = ПакетЗапросов[ПоследнийИндекс - 1].Выгрузить();

	ТаблицаРасчетная = Новый ТаблицаЗначений;
	ТаблицаРасчетная.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаРасчетная.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ТаблицаРасчетная.Колонки.Добавить("Субконто1", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаРасчетная.Колонки.Добавить("Субконто2", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаРасчетная.Колонки.Добавить("Субконто3", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами.ТипЗначения);
	ТаблицаРасчетная.Колонки.Добавить("ОстатокДт", БухгалтерскийУчетКлиентСервер.ТипСумма());
	ТаблицаРасчетная.Колонки.Добавить("ОстатокКт", БухгалтерскийУчетКлиентСервер.ТипСумма());
	
	ПересчитатьОстаткиСгруппированнойАналитики(ТаблицаРасчетная, ДанныеСгруппированные, ДанныеРаспределения);
	
	Запрос.УстановитьПараметр("ТаблицаРасчетная", ТаблицаРасчетная);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРасчетная.Организация КАК Организация,
	|	ТаблицаРасчетная.Счет КАК Счет,
	|	ТаблицаРасчетная.Субконто1 КАК Субконто1,
	|	ТаблицаРасчетная.Субконто2 КАК Субконто2,
	|	ТаблицаРасчетная.Субконто3 КАК Субконто3,
	|	ТаблицаРасчетная.ОстатокДт КАК ОстатокДт,
	|	ТаблицаРасчетная.ОстатокКт КАК ОстатокКт
	|ПОМЕСТИТЬ РаспределенныеДанные
	|ИЗ
	|	&ТаблицаРасчетная КАК ТаблицаРасчетная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПолнойДетализацией.Организация КАК Организация,
	|	РасчетыСПолнойДетализацией.Счет КАК Счет,
	|	РасчетыСПолнойДетализацией.Субконто1 КАК Субконто1,
	|	РасчетыСПолнойДетализацией.Субконто2 КАК Субконто2,
	|	РасчетыСПолнойДетализацией.Субконто3 КАК Субконто3,
	|	РасчетыСПолнойДетализацией.ОстатокДт КАК ОстатокДт,
	|	РасчетыСПолнойДетализацией.ОстатокКт КАК ОстатокКт
	|ПОМЕСТИТЬ СкорректированныеРасчетыСКонтрагентами
	|ИЗ
	|	РасчетыСПолнойДетализацией КАК РасчетыСПолнойДетализацией
	|ГДЕ
	|	НЕ РасчетыСПолнойДетализацией.НеобходимоСкорректировать
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределенныеДанные.Организация,
	|	РаспределенныеДанные.Счет,
	|	РаспределенныеДанные.Субконто1,
	|	РаспределенныеДанные.Субконто2,
	|	РаспределенныеДанные.Субконто3,
	|	РаспределенныеДанные.ОстатокДт,
	|	РаспределенныеДанные.ОстатокКт
	|ИЗ
	|	РаспределенныеДанные КАК РаспределенныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СгруппированныеРасчетыПоДоговорам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасчетыСПолнойДетализацией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РаспределенныеДанные";
	
	Запрос.Выполнить();
	
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкорректированныеРасчетыСКонтрагентами.Организация КАК Организация,
		|	СкорректированныеРасчетыСКонтрагентами.Счет КАК Счет,
		|	СкорректированныеРасчетыСКонтрагентами.Субконто1 КАК Субконто1,
		|	СкорректированныеРасчетыСКонтрагентами.Субконто2 КАК Субконто2,
		|	СкорректированныеРасчетыСКонтрагентами.Субконто3 КАК Субконто3,
		|	СкорректированныеРасчетыСКонтрагентами.ОстатокДт КАК ОстатокДт,
		|	0 КАК ОстатокКт
		|ДОБАВИТЬ РасчетыСКонтрагентамиПоДоговорам
		|ИЗ
		|	СкорректированныеРасчетыСКонтрагентами КАК СкорректированныеРасчетыСКонтрагентами
		|ГДЕ
		|	СкорректированныеРасчетыСКонтрагентами.ОстатокДт <> 0";
		Запрос.Выполнить();
	ИначеЕсли ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкорректированныеРасчетыСКонтрагентами.Организация КАК Организация,
		|	СкорректированныеРасчетыСКонтрагентами.Счет КАК Счет,
		|	СкорректированныеРасчетыСКонтрагентами.Субконто1 КАК Субконто1,
		|	СкорректированныеРасчетыСКонтрагентами.Субконто2 КАК Субконто2,
		|	СкорректированныеРасчетыСКонтрагентами.Субконто3 КАК Субконто3,
		|	0 КАК ОстатокДт,
		|	СкорректированныеРасчетыСКонтрагентами.ОстатокКт КАК ОстатокКт
		|ДОБАВИТЬ РасчетыСКонтрагентамиПоДоговорам
		|ИЗ
		|	СкорректированныеРасчетыСКонтрагентами КАК СкорректированныеРасчетыСКонтрагентами
		|ГДЕ
		|	СкорректированныеРасчетыСКонтрагентами.ОстатокКт <> 0";
		Запрос.Выполнить();
	КонецЕсли;
		
КонецПроцедуры

Процедура ПересчитатьОстаткиСгруппированнойАналитики(ТаблицаРасчетная, ДанныеСгруппированные, ДанныеРаспределения)
	
	Если Не ЗначениеЗаполнено(ДанныеРаспределения) Тогда
		Возврат;
	КонецЕсли;
	
	КолонкиГруппировки = "Организация, Счет, Субконто1, Субконто2";
	
	Для Каждого СтрокаГруппировки Из ДанныеСгруппированные Цикл
		Отбор = Новый Структура(КолонкиГруппировки);
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаГруппировки);
		
		ОстатокДт = СтрокаГруппировки.ОстатокДт;
		ОстатокКт = СтрокаГруппировки.ОстатокКт;
		
		СтрокиТаблицы = ДанныеРаспределения.НайтиСтроки(Отбор);

		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			
			СуммаРасчетнаяДт = Мин(СтрокаТаблицы.ОстатокДт, ОстатокДт);
			СуммаРасчетнаяКт = Мин(СтрокаТаблицы.ОстатокКт, ОстатокКт);
			
			СтрокаРасчетная = ТаблицаРасчетная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРасчетная, СтрокаТаблицы, "Организация, Счет, Субконто1, Субконто2, Субконто3");
			СтрокаРасчетная.ОстатокДт = СуммаРасчетнаяДт;
			СтрокаРасчетная.ОстатокКт = СуммаРасчетнаяКт;
			
			ОстатокДт = ОстатокДт - СуммаРасчетнаяДт;
			ОстатокКт = ОстатокКт - СуммаРасчетнаяКт;
			
			Если ОстатокДт = 0 И ОстатокКт = 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#Область РезервыПоСомнительнымДолгам

Процедура СоздатьВременныеТаблицыОбъектыРезервовПоСомнительнымДолгам(МенеджерВременныхТаблиц, СчетаОбъектовРезервов)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоСрокамПогашения.Организация КАК Организация,
	|	РасчетыПоСрокамПогашения.Счет КАК Счет,
	|	РасчетыПоСрокамПогашения.Субконто1 КАК Субконто1,
	|	РасчетыПоСрокамПогашения.Субконто2 КАК Субконто2,
	|	РасчетыПоСрокамПогашения.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НДСАвансов.Сальдо, 0) > 0
	|				И РасчетыПоСрокамПогашения.ОстатокДолга - ЕСТЬNULL(НДСАвансов.Сальдо, 0) > 0
	|			ТОГДА РасчетыПоСрокамПогашения.ОстатокДолга - ЕСТЬNULL(НДСАвансов.Сальдо, 0)
	|		ИНАЧЕ РасчетыПоСрокамПогашения.ОстатокДолга
	|	КОНЕЦ КАК ОстатокДолга,
	|	РасчетыПоСрокамПогашения.ДатаВозникновения КАК ДатаВозникновения,
	|	РасчетыПоСрокамПогашения.ДатаПогашения КАК ДатаПогашения
	|ПОМЕСТИТЬ ОбъектыРезервов
	|ИЗ
	|	РасчетыПоСрокамПогашения КАК РасчетыПоСрокамПогашения
	|		ЛЕВОЕ СОЕДИНЕНИЕ НДСАвансов КАК НДСАвансов
	|		ПО РасчетыПоСрокамПогашения.Организация = НДСАвансов.Организация
	|			И РасчетыПоСрокамПогашения.Счет = НДСАвансов.СчетРасчетов
	|			И РасчетыПоСрокамПогашения.Субконто1 = НДСАвансов.Субконто1
	|			И РасчетыПоСрокамПогашения.Субконто2 = НДСАвансов.Субконто2
	|			И РасчетыПоСрокамПогашения.Субконто3 = НДСАвансов.Субконто3
	|			И РасчетыПоСрокамПогашения.ДатаВозникновения = НДСАвансов.ДатаВозникновения
	|			И РасчетыПоСрокамПогашения.ДатаПогашения = НДСАвансов.ДатаПогашения
	|ГДЕ
	|	РасчетыПоСрокамПогашения.Счет В(&СчетаОбъектовРезервов)
	|	И РасчетыПоСрокамПогашения.ОстатокДолга > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	ДатаВозникновения,
	|	ДатаПогашения";

	Запрос.УстановитьПараметр("СчетаОбъектовРезервов", СчетаОбъектовРезервов);
	Запрос.Выполнить();
		
КонецПроцедуры

Процедура СоздатьВременныеТаблицыРаспределенныеРезервыПоСомнительнымДолгам(МенеджерВременныхТаблиц, Период, Организации, ИмяВременнойТаблицы = "")
	
	// Объекты резервов
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ОбъектыРезервов") = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОстаткиБУ.Организация КАК Организация,
		|	ОстаткиБУ.Счет КАК Счет,
		|	ОстаткиБУ.Субконто1 КАК Субконто1,
		|	ОстаткиБУ.Субконто2 КАК Субконто2,
		|	ОстаткиБУ.Субконто3 КАК Субконто3,
		|	ОстаткиБУ.СуммаОстатокДт КАК ОстатокДолга,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВозникновения,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашения
		|ПОМЕСТИТЬ ОбъектыРезервов
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&СчетаОбъектовРезервов), &СубконтоКонтрагентыДоговорыДокументы, Организация В (&Организации)) КАК ОстаткиБУ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Субконто1,
		|	Субконто2,
		|	Субконто3";
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("Организации", Организации);
		
		СчетаОбъектовРезервов = КлассификацияЗадолженности.СчетаОбъектовРезервов();
		Запрос.УстановитьПараметр("СчетаОбъектовРезервов", СчетаОбъектовРезервов);
		
		СубконтоКонтрагентыДоговорыДокументы = Новый Массив;
		СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
		СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
		Запрос.УстановитьПараметр("СубконтоКонтрагентыДоговорыДокументы", СубконтоКонтрагентыДоговорыДокументы);
		
		Запрос.Выполнить();
	КонецЕсли;
	
	// Резервы по сомнительным долгам
	СчетаРезервов = БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам);
	
	Дата = ЗаполнениеБухгалтерскойОтчетности.ПривестиКДате(Период);
	ДатаНачалаДолгосрочногоПериода = КонецМесяца(ДобавитьМесяц(Дата, 12)) + 1;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации",      Организации);
	Запрос.УстановитьПараметр("КонецПериода",     Новый Граница(Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетаРезервов", СчетаРезервов);
	Запрос.УстановитьПараметр("ДатаНачалаДолгосрочногоПериода", ДатаНачалаДолгосрочногоПериода);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	СубконтоКонтрагентыДоговорыДокументы = Новый Массив;
	СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	Запрос.УстановитьПараметр("СубконтоКонтрагентыДоговорыДокументы", СубконтоКонтрагентыДоговорыДокументы);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты) КАК Субконто1,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Субконто2,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ХозрасчетныйОстатки.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	СУММА(-1 * ХозрасчетныйОстатки.СуммаОстаток) КАК ОстатокРезерва,
	|	(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Субконто1ПустаяСсылка,
	|	(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК Субконто2ПустаяСсылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) = &ПустойУникальныйИдентификатор КАК Субконто3ПустаяСсылка
	|ПОМЕСТИТЬ ВсеРезервы
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&СчетаРезервов), &СубконтоКонтрагентыДоговорыДокументы, Организация В (&Организации)) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Организация,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты),
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов),
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) = &ПустойУникальныйИдентификатор
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ХозрасчетныйОстатки.Субконто3
	|	КОНЕЦ,
	|	(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	(ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) = &ПустойУникальныйИдентификатор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеРезервы.Организация КАК Организация,
	|	ВсеРезервы.Субконто1 КАК Субконто1,
	|	ВсеРезервы.Субконто2 КАК Субконто2,
	|	ВсеРезервы.Субконто3 КАК Субконто3,
	|	ВсеРезервы.ОстатокРезерва КАК ОстатокРезерва,
	|	ОбъектыРезервов.Счет КАК СчетРасчетов,
	|	ОбъектыРезервов.Субконто1 КАК Субконто1Задолженность,
	|	ОбъектыРезервов.Субконто2 КАК Субконто2Задолженность,
	|	ОбъектыРезервов.Субконто3 КАК Субконто3Задолженность,
	|	ОбъектыРезервов.ДатаВозникновения КАК ДатаВозникновения,
	|	ОбъектыРезервов.ДатаПогашения КАК ДатаПогашения,
	|	ОбъектыРезервов.ОстатокДолга КАК ОстатокДолга,
	|	ВЫБОР
	|		КОГДА ВсеРезервы.Субконто1ПустаяСсылка
	|				И ВсеРезервы.Субконто2ПустаяСсылка
	|				И ВсеРезервы.Субконто3ПустаяСсылка
	|			ТОГДА 0
	|		КОГДА ВсеРезервы.Субконто2ПустаяСсылка
	|				И ВсеРезервы.Субконто3ПустаяСсылка
	|			ТОГДА 1
	|		КОГДА ВсеРезервы.Субконто3ПустаяСсылка
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК УровеньДетализации,
	|	НЕ ОбъектыРезервов.Организация ЕСТЬ NULL КАК НайденОбъектРасчетов
	|ПОМЕСТИТЬ РезервыВсеУровниРаспределения
	|ИЗ
	|	ВсеРезервы КАК ВсеРезервы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъектыРезервов КАК ОбъектыРезервов
	|		ПО ВсеРезервы.Организация = ОбъектыРезервов.Организация
	|			И ВсеРезервы.Субконто1 = ОбъектыРезервов.Субконто1
	|			И (НЕ ВсеРезервы.Субконто1ПустаяСсылка)
	|			И (ВсеРезервы.Субконто2 = ОбъектыРезервов.Субконто2
	|				ИЛИ ВсеРезервы.Субконто2ПустаяСсылка)
	|			И (ВсеРезервы.Субконто3 = ОбъектыРезервов.Субконто3
	|				ИЛИ ВсеРезервы.Субконто3ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыВсеУровниРаспределения.Организация КАК Организация,
	|	РезервыВсеУровниРаспределения.СчетРасчетов КАК СчетРасчетов,
	|	РезервыВсеУровниРаспределения.Субконто1Задолженность КАК Субконто1Задолженность,
	|	РезервыВсеУровниРаспределения.Субконто2Задолженность КАК Субконто2Задолженность,
	|	РезервыВсеУровниРаспределения.Субконто3Задолженность КАК Субконто3Задолженность,
	|	РезервыВсеУровниРаспределения.ДатаВозникновения КАК ДатаВозникновения,
	|	РезервыВсеУровниРаспределения.ДатаПогашения КАК ДатаПогашения,
	|	МАКСИМУМ(РезервыВсеУровниРаспределения.УровеньДетализации) КАК УровеньДетализации
	|ПОМЕСТИТЬ ОбъектыРезервовМаксимальныеУровни
	|ИЗ
	|	РезервыВсеУровниРаспределения КАК РезервыВсеУровниРаспределения
	|ГДЕ
	|	РезервыВсеУровниРаспределения.НайденОбъектРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	РезервыВсеУровниРаспределения.Организация,
	|	РезервыВсеУровниРаспределения.СчетРасчетов,
	|	РезервыВсеУровниРаспределения.Субконто1Задолженность,
	|	РезервыВсеУровниРаспределения.Субконто2Задолженность,
	|	РезервыВсеУровниРаспределения.Субконто3Задолженность,
	|	РезервыВсеУровниРаспределения.ДатаВозникновения,
	|	РезервыВсеУровниРаспределения.ДатаПогашения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СчетРасчетов,
	|	Субконто1Задолженность,
	|	Субконто2Задолженность,
	|	Субконто3Задолженность,
	|	ДатаВозникновения,
	|	ДатаПогашения,
	|	УровеньДетализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыВсеУровниРаспределения.Организация КАК Организация,
	|	РезервыВсеУровниРаспределения.Субконто1 КАК Субконто1,
	|	РезервыВсеУровниРаспределения.Субконто2 КАК Субконто2,
	|	РезервыВсеУровниРаспределения.Субконто3 КАК Субконто3,
	|	РезервыВсеУровниРаспределения.ОстатокРезерва КАК ОстатокРезерва,
	|	РезервыВсеУровниРаспределения.СчетРасчетов КАК СчетРасчетов,
	|	РезервыВсеУровниРаспределения.Субконто1Задолженность КАК Субконто1Задолженность,
	|	РезервыВсеУровниРаспределения.Субконто2Задолженность КАК Субконто2Задолженность,
	|	РезервыВсеУровниРаспределения.Субконто3Задолженность КАК Субконто3Задолженность,
	|	РезервыВсеУровниРаспределения.ДатаВозникновения КАК ДатаВозникновения,
	|	РезервыВсеУровниРаспределения.ДатаПогашения КАК ДатаПогашения,
	|	РезервыВсеУровниРаспределения.ОстатокДолга КАК ОстатокДолга,
	|	РезервыВсеУровниРаспределения.УровеньДетализации КАК УровеньДетализации,
	|	РезервыВсеУровниРаспределения.НайденОбъектРасчетов КАК НайденОбъектРасчетов
	|ПОМЕСТИТЬ РезервыРаспределенныеПоОбъектам
	|ИЗ
	|	РезервыВсеУровниРаспределения КАК РезервыВсеУровниРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбъектыРезервовМаксимальныеУровни КАК ОбъектыРезервовМаксимальныеУровни
	|		ПО РезервыВсеУровниРаспределения.Организация = ОбъектыРезервовМаксимальныеУровни.Организация
	|			И РезервыВсеУровниРаспределения.СчетРасчетов = ОбъектыРезервовМаксимальныеУровни.СчетРасчетов
	|			И РезервыВсеУровниРаспределения.Субконто1Задолженность = ОбъектыРезервовМаксимальныеУровни.Субконто1Задолженность
	|			И РезервыВсеУровниРаспределения.Субконто2Задолженность = ОбъектыРезервовМаксимальныеУровни.Субконто2Задолженность
	|			И РезервыВсеУровниРаспределения.Субконто3Задолженность = ОбъектыРезервовМаксимальныеУровни.Субконто3Задолженность
	|			И РезервыВсеУровниРаспределения.ДатаВозникновения = ОбъектыРезервовМаксимальныеУровни.ДатаВозникновения
	|			И РезервыВсеУровниРаспределения.ДатаПогашения = ОбъектыРезервовМаксимальныеУровни.ДатаПогашения
	|			И РезервыВсеУровниРаспределения.УровеньДетализации = ОбъектыРезервовМаксимальныеУровни.УровеньДетализации
	|ГДЕ
	|	РезервыВсеУровниРаспределения.НайденОбъектРасчетов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезервыВсеУровниРаспределения.Организация,
	|	РезервыВсеУровниРаспределения.Субконто1,
	|	РезервыВсеУровниРаспределения.Субконто2,
	|	РезервыВсеУровниРаспределения.Субконто3,
	|	РезервыВсеУровниРаспределения.ОстатокРезерва,
	|	РезервыВсеУровниРаспределения.СчетРасчетов,
	|	РезервыВсеУровниРаспределения.Субконто1Задолженность,
	|	РезервыВсеУровниРаспределения.Субконто2Задолженность,
	|	РезервыВсеУровниРаспределения.Субконто3Задолженность,
	|	РезервыВсеУровниРаспределения.ДатаВозникновения,
	|	РезервыВсеУровниРаспределения.ДатаПогашения,
	|	РезервыВсеУровниРаспределения.ОстатокДолга,
	|	РезервыВсеУровниРаспределения.УровеньДетализации,
	|	РезервыВсеУровниРаспределения.НайденОбъектРасчетов
	|ИЗ
	|	РезервыВсеУровниРаспределения КАК РезервыВсеУровниРаспределения
	|ГДЕ
	|	НЕ РезервыВсеУровниРаспределения.НайденОбъектРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыРаспределенныеПоОбъектам.Организация КАК Организация,
	|	РезервыРаспределенныеПоОбъектам.Субконто1 КАК Субконто1,
	|	РезервыРаспределенныеПоОбъектам.Субконто2 КАК Субконто2,
	|	РезервыРаспределенныеПоОбъектам.Субконто3 КАК Субконто3,
	|	СУММА(1) КАК КоличествоЗаписей
	|ПОМЕСТИТЬ СовпадающаяАналитикаРезервы
	|ИЗ
	|	РезервыРаспределенныеПоОбъектам КАК РезервыРаспределенныеПоОбъектам
	|ГДЕ
	|	РезервыРаспределенныеПоОбъектам.НайденОбъектРасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	РезервыРаспределенныеПоОбъектам.Организация,
	|	РезервыРаспределенныеПоОбъектам.Субконто1,
	|	РезервыРаспределенныеПоОбъектам.Субконто2,
	|	РезервыРаспределенныеПоОбъектам.Субконто3
	|
	|ИМЕЮЩИЕ
	|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РезервыРаспределенныеПоОбъектам.СчетРасчетов) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РезервыРаспределенныеПоОбъектам.ДатаВозникновения) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РезервыРаспределенныеПоОбъектам.ДатаПогашения) > 1)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыРаспределенныеПоОбъектам.Организация КАК Организация,
	|	РезервыРаспределенныеПоОбъектам.Субконто1 КАК Субконто1,
	|	РезервыРаспределенныеПоОбъектам.Субконто2 КАК Субконто2,
	|	РезервыРаспределенныеПоОбъектам.Субконто3 КАК Субконто3,
	|	РезервыРаспределенныеПоОбъектам.ОстатокРезерва КАК ОстатокРезерва,
	|	РезервыРаспределенныеПоОбъектам.СчетРасчетов КАК СчетРасчетов,
	|	РезервыРаспределенныеПоОбъектам.Субконто1Задолженность КАК Субконто1Задолженность,
	|	РезервыРаспределенныеПоОбъектам.Субконто2Задолженность КАК Субконто2Задолженность,
	|	РезервыРаспределенныеПоОбъектам.Субконто3Задолженность КАК Субконто3Задолженность,
	|	РезервыРаспределенныеПоОбъектам.ДатаВозникновения КАК ДатаВозникновения,
	|	РезервыРаспределенныеПоОбъектам.ДатаПогашения КАК ДатаПогашения,
	|	РезервыРаспределенныеПоОбъектам.ОстатокДолга КАК ОстатокДолга,
	|	НЕ СовпадающаяАналитика.КоличествоЗаписей ЕСТЬ NULL КАК СовпадающиеЗаписи,
	|	РезервыРаспределенныеПоОбъектам.УровеньДетализации КАК УровеньДетализации
	|ПОМЕСТИТЬ РезервыПоОбъектам
	|ИЗ
	|	РезервыРаспределенныеПоОбъектам КАК РезервыРаспределенныеПоОбъектам
	|		ЛЕВОЕ СОЕДИНЕНИЕ СовпадающаяАналитикаРезервы КАК СовпадающаяАналитика
	|		ПО РезервыРаспределенныеПоОбъектам.Организация = СовпадающаяАналитика.Организация
	|			И РезервыРаспределенныеПоОбъектам.Субконто1 = СовпадающаяАналитика.Субконто1
	|			И РезервыРаспределенныеПоОбъектам.Субконто2 = СовпадающаяАналитика.Субконто2
	|			И РезервыРаспределенныеПоОбъектам.Субконто3 = СовпадающаяАналитика.Субконто3
	|ГДЕ
	|	РезервыРаспределенныеПоОбъектам.НайденОбъектРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыПоОбъектам.Организация КАК Организация,
	|	РезервыПоОбъектам.Субконто1 КАК Субконто1,
	|	РезервыПоОбъектам.Субконто2 КАК Субконто2,
	|	РезервыПоОбъектам.Субконто3 КАК Субконто3,
	|	РезервыПоОбъектам.СчетРасчетов КАК СчетРасчетов,
	|	РезервыПоОбъектам.Субконто1Задолженность КАК Субконто1Задолженность,
	|	РезервыПоОбъектам.Субконто2Задолженность КАК Субконто2Задолженность,
	|	РезервыПоОбъектам.Субконто3Задолженность КАК Субконто3Задолженность,
	|	РезервыПоОбъектам.ДатаВозникновения КАК ДатаВозникновения,
	|	РезервыПоОбъектам.ДатаПогашения КАК ДатаПогашения,
	|	РезервыПоОбъектам.УровеньДетализации КАК УровеньДетализации,
	|	РезервыПоОбъектам.ОстатокДолга КАК ОстатокДолга,
	|	0 КАК ОстатокРезерва
	|ИЗ
	|	РезервыПоОбъектам КАК РезервыПоОбъектам
	|ГДЕ
	|	РезервыПоОбъектам.СовпадающиеЗаписи
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	ДатаВозникновения,
	|	ДатаПогашения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РезервыПоОбъектам.Организация КАК Организация,
	|	РезервыПоОбъектам.Субконто1 КАК Субконто1,
	|	РезервыПоОбъектам.Субконто2 КАК Субконто2,
	|	РезервыПоОбъектам.Субконто3 КАК Субконто3,
	|	РезервыПоОбъектам.ОстатокРезерва КАК ОстатокРезерва
	|ИЗ
	|	РезервыПоОбъектам КАК РезервыПоОбъектам
	|ГДЕ
	|	РезервыПоОбъектам.СовпадающиеЗаписи";
	
	Результат = Запрос.ВыполнитьПакет();
	КоличествоПакетов = Результат.ВГраница();

	ТаблицаГруппировки = Результат[КоличествоПакетов].Выгрузить();
	ТаблицаРаспределения = Результат[КоличествоПакетов-1].Выгрузить();
	
	НераспределенныеРезервы = ТаблицаРаспределения.СкопироватьКолонки("Организация, Субконто1, Субконто2, Субконто3");
	НераспределенныеРезервы.Колонки.Добавить("Остаток", БухгалтерскийУчетКлиентСервер.ТипСумма());

	РаспределитьПоФИФО(ТаблицаГруппировки, ТаблицаРаспределения, НераспределенныеРезервы, "ОстатокРезерва", "ОстатокДолга");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаРаспределения.Организация КАК Организация,
	|	ТаблицаРаспределения.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаРаспределения.Субконто1Задолженность КАК Субконто1Задолженность,
	|	ТаблицаРаспределения.Субконто2Задолженность КАК Субконто2Задолженность,
	|	ТаблицаРаспределения.Субконто3Задолженность КАК Субконто3Задолженность,
	|	ТаблицаРаспределения.ДатаВозникновения КАК ДатаВозникновения,
	|	ТаблицаРаспределения.ДатаПогашения КАК ДатаПогашения,
	|	ТаблицаРаспределения.УровеньДетализации КАК УровеньДетализации,
	|	ТаблицаРаспределения.ОстатокРезерва КАК ОстатокРезерва
	|ПОМЕСТИТЬ РезервыРаспределенные
	|ИЗ
	|	&ТаблицаРаспределения КАК ТаблицаРаспределения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРезервы.Организация КАК Организация,
	|	ТаблицаРезервы.Субконто1 КАК Субконто1,
	|	ТаблицаРезервы.Субконто2 КАК Субконто2,
	|	ТаблицаРезервы.Субконто3 КАК Субконто3,
	|	ТаблицаРезервы.Остаток КАК Остаток
	|ПОМЕСТИТЬ НераспределенныеРезервы
	|ИЗ
	|	&ТаблицаРезервы КАК ТаблицаРезервы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Резервы.Организация КАК Организация,
	|	Резервы.СчетРасчетов КАК СчетРасчетов,
	|	Резервы.Субконто1Задолженность КАК Субконто1,
	|	Резервы.Субконто2Задолженность КАК Субконто2,
	|	Резервы.Субконто3Задолженность КАК Субконто3,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВидАктива, ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляАвансов.ПустаяСсылка)) КАК ВидАктива,
	|	Резервы.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода КАК БолееГода,
	|	Резервы.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
	|		И Резервы.ДатаПогашения <= &Дата КАК Просроченная,
	|	Резервы.ДатаВозникновения КАК ДатаВозникновения,
	|	Резервы.ДатаПогашения КАК ДатаПогашения,
	|	Резервы.УровеньДетализации КАК УровеньДетализации,
	|	Резервы.ОстатокРезерва КАК Сальдо
	|ПОМЕСТИТЬ РезервыПоСомнительнымДолгам
	|ИЗ
	|	(ВЫБРАТЬ
	|		РезервыПоОбъектам.Организация КАК Организация,
	|		РезервыПоОбъектам.СчетРасчетов КАК СчетРасчетов,
	|		РезервыПоОбъектам.Субконто1Задолженность КАК Субконто1Задолженность,
	|		РезервыПоОбъектам.Субконто2Задолженность КАК Субконто2Задолженность,
	|		РезервыПоОбъектам.Субконто3Задолженность КАК Субконто3Задолженность,
	|		РезервыПоОбъектам.ДатаВозникновения КАК ДатаВозникновения,
	|		РезервыПоОбъектам.ДатаПогашения КАК ДатаПогашения,
	|		РезервыПоОбъектам.УровеньДетализации КАК УровеньДетализации,
	|		ВЫБОР
	|			КОГДА РезервыПоОбъектам.ОстатокРезерва > РезервыПоОбъектам.ОстатокДолга
	|				ТОГДА РезервыПоОбъектам.ОстатокДолга
	|			ИНАЧЕ РезервыПоОбъектам.ОстатокРезерва
	|		КОНЕЦ КАК ОстатокРезерва
	|	ИЗ
	|		РезервыПоОбъектам КАК РезервыПоОбъектам
	|	ГДЕ
	|		НЕ РезервыПоОбъектам.СовпадающиеЗаписи
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыРаспределенные.Организация,
	|		РезервыРаспределенные.СчетРасчетов,
	|		РезервыРаспределенные.Субконто1Задолженность,
	|		РезервыРаспределенные.Субконто2Задолженность,
	|		РезервыРаспределенные.Субконто3Задолженность,
	|		РезервыРаспределенные.ДатаВозникновения,
	|		РезервыРаспределенные.ДатаПогашения,
	|		РезервыРаспределенные.УровеньДетализации,
	|		РезервыРаспределенные.ОстатокРезерва
	|	ИЗ
	|		РезервыРаспределенные КАК РезервыРаспределенные
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РезервыПоОбъектам.Организация,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
	|		РезервыПоОбъектам.Субконто1,
	|		РезервыПоОбъектам.Субконто2,
	|		РезервыПоОбъектам.Субконто3,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		0,
	|		РезервыПоОбъектам.ОстатокРезерва - РезервыПоОбъектам.ОстатокДолга
	|	ИЗ
	|		РезервыПоОбъектам КАК РезервыПоОбъектам
	|	ГДЕ
	|		НЕ РезервыПоОбъектам.СовпадающиеЗаписи
	|		И РезервыПоОбъектам.ОстатокРезерва > РезервыПоОбъектам.ОстатокДолга
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РезервыРаспределенныеПоОбъектам.Организация,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
	|		РезервыРаспределенныеПоОбъектам.Субконто1,
	|		РезервыРаспределенныеПоОбъектам.Субконто2,
	|		РезервыРаспределенныеПоОбъектам.Субконто3,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		0,
	|		РезервыРаспределенныеПоОбъектам.ОстатокРезерва
	|	ИЗ
	|		РезервыРаспределенныеПоОбъектам КАК РезервыРаспределенныеПоОбъектам
	|	ГДЕ
	|		НЕ РезервыРаспределенныеПоОбъектам.НайденОбъектРасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НераспределенныеРезервы.Организация,
	|		ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РезервыПоСомнительнымДолгам),
	|		НераспределенныеРезервы.Субконто1,
	|		НераспределенныеРезервы.Субконто2,
	|		НераспределенныеРезервы.Субконто3,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		0,
	|		НераспределенныеРезервы.Остаток
	|	ИЗ
	|		НераспределенныеРезервы КАК НераспределенныеРезервы) КАК Резервы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Резервы.Субконто2Задолженность = ДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВсеРезервы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОбъектыРезервов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РезервыВсеУровниРаспределения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОбъектыРезервовМаксимальныеУровни
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РезервыРаспределенныеПоОбъектам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СовпадающаяАналитикаРезервы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РезервыПоОбъектам";

	Запрос.УстановитьПараметр("ТаблицаРаспределения", ТаблицаРаспределения);
	Запрос.УстановитьПараметр("ТаблицаРезервы", НераспределенныеРезервы);

	Если Не ПустаяСтрока(ИмяВременнойТаблицы) Тогда
		ТочкаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(ТекстЗапроса, "РезервыПоСомнительнымДолгам");
		ТочкаЗапроса.Запрос.ТаблицаДляПомещения = ИмяВременнойТаблицы;
		ТекстЗапроса = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура РаспределитьПоФИФО(ТаблицаГруппировки, ТаблицаРаспределения, ТаблицаОстаточная, КолонкаРасчета, КолонкаСравнения)
	
	КолонкиГруппировок = "Организация, Субконто1, Субконто2, Субконто3";

	Для Каждого СтрокаГруппировки Из ТаблицаГруппировки Цикл
		
		Отбор = Новый Структура(КолонкиГруппировок);
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаГруппировки);
		
		СтрокиТаблицы = ТаблицаРаспределения.НайтиСтроки(Отбор);
		
		СуммаРаспределения = СтрокаГруппировки[КолонкаРасчета];
		
		Для Каждого СтрокаТаблица Из СтрокиТаблицы Цикл
			
			СтрокаТаблица[КолонкаРасчета] = Мин(СтрокаТаблица[КолонкаСравнения], СуммаРаспределения);
			
			СуммаРаспределения = СуммаРаспределения - СтрокаТаблица[КолонкаРасчета];
		КонецЦикла;
		
		Если СуммаРаспределения > 0 Тогда
			СтрокаРезерва = ТаблицаОстаточная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезерва, СтрокаГруппировки, "Организация, Субконто1, Субконто2, Субконто3");
			СтрокаРезерва.Остаток = СуммаРаспределения;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область НДСАвансов

Процедура СоздатьВременныеТаблицыОбъектыАвансов(МенеджерВременныхТаблиц, СчетаУчетаАвансов)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыПоСрокамПогашения.Организация КАК Организация,
	|	РасчетыПоСрокамПогашения.Счет КАК Счет,
	|	РасчетыПоСрокамПогашения.Субконто1 КАК Субконто1,
	|	РасчетыПоСрокамПогашения.Субконто2 КАК Субконто2,
	|	РасчетыПоСрокамПогашения.Субконто3 КАК Субконто3,
	|	РасчетыПоСрокамПогашения.ОстатокДолга КАК ОстатокДолга,
	|	РасчетыПоСрокамПогашения.ДатаВозникновения КАК ДатаВозникновения,
	|	РасчетыПоСрокамПогашения.ДатаПогашения КАК ДатаПогашения
	|ПОМЕСТИТЬ ОбъектыАвансов
	|ИЗ
	|	РасчетыПоСрокамПогашения КАК РасчетыПоСрокамПогашения
	|ГДЕ
	|	РасчетыПоСрокамПогашения.Счет В(&СчетаУчетаАвансов)
	|	И РасчетыПоСрокамПогашения.ОстатокДолга > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	ДатаВозникновения,
	|	ДатаПогашения";
	
	Запрос.УстановитьПараметр("СчетаУчетаАвансов", СчетаУчетаАвансов);
	Запрос.Выполнить();
		
КонецПроцедуры

Процедура СоздатьВременныеТаблицыРаспределенныеНДСАвансов(МенеджерВременныхТаблиц, Период, Организации, ВидСчетФактуры, ИмяВременнойТаблицы = "")
	
	// Объекты учета авансов
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ОбъектыАвансов") = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОстаткиБУ.Организация КАК Организация,
		|	ОстаткиБУ.Счет КАК Счет,
		|	ОстаткиБУ.Субконто1 КАК Субконто1,
		|	ОстаткиБУ.Субконто2 КАК Субконто2,
		|	ОстаткиБУ.Субконто3 КАК Субконто3,
		|	&Остаток КАК ОстатокДолга,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВозникновения,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашения
		|ПОМЕСТИТЬ ОбъектыАвансов
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&СчетаУчетаАвансов), &СубконтоКонтрагентыДоговорыДокументы, Организация В (&Организации)) КАК ОстаткиБУ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Субконто1,
		|	Субконто2,
		|	Субконто3";
		
		Если ВидСчетФактуры = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СФПолученные Тогда
			СчетаУчетаАвансов = СчетаУчетаАвансовВыданных();
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Остаток", "ОстаткиБУ.СуммаОстатокДт");
		Иначе
			СчетаУчетаАвансов =  СчетаУчетаАвансовПолученных();
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Остаток", "ОстаткиБУ.СуммаОстатокКт");
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("Организации", Организации);
		Запрос.УстановитьПараметр("СчетаУчетаАвансов", СчетаУчетаАвансов);
		
		СубконтоКонтрагентыДоговорыДокументы = Новый Массив;
		СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
		СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
		СубконтоКонтрагентыДоговорыДокументы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
		Запрос.УстановитьПараметр("СубконтоКонтрагентыДоговорыДокументы", СубконтоКонтрагентыДоговорыДокументы);
		
		Запрос.Выполнить();
	КонецЕсли;
	
	// НДС с авансов
	Дата = ЗаполнениеБухгалтерскойОтчетности.ПривестиКДате(Период);
	ДатаНачалаДолгосрочногоПериода = КонецМесяца(ДобавитьМесяц(Дата, 12)) + 1;
	ЗнакЧисла = 1;
	Если ВидСчетФактуры = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СФПолученные Тогда
		СчетНДСАвансов = ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным;
		СчетаНДСАвансов = БухгалтерскийУчетПовтИсп.СчетаВИерархии(СчетНДСАвансов);
		ЗнакЧисла = - 1;
	Иначе
		СчетНДСАвансов = ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам;
		СчетаНДСАвансов = БухгалтерскийУчетПовтИсп.СчетаВИерархии(СчетНДСАвансов);
	КонецЕсли;
	
	СубконтоКонтрагентыСФ = Новый Массив;
	СубконтоКонтрагентыСФ.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СубконтоКонтрагентыСФ.Добавить(ВидСчетФактуры);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("Период", Новый Граница(Период, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетаНДСАвансов", СчетаНДСАвансов);
	Запрос.УстановитьПараметр("СубконтоКонтрагентыСФ", СубконтоКонтрагентыСФ);
	Запрос.УстановитьПараметр("СчетНДСАвансов", СчетНДСАвансов);
	Запрос.УстановитьПараметр("ДатаНачалаДолгосрочногоПериода", ДатаНачалаДолгосрочногоПериода);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЗнакЧисла", ЗнакЧисла);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());

	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	|	ХозрасчетныйОстатки.Субконто2 КАК СчетФактура,
	|	СУММА(&ЗнакЧисла * ХозрасчетныйОстатки.СуммаОстаток) КАК ОстатокНДС
	|ПОМЕСТИТЬ ОстаткиНДСАвансов
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В (&СчетаНДСАвансов), &СубконтоКонтрагентыСФ, Организация В (&Организации)) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Организация,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТИПЗНАЧЕНИЯ(ОстаткиНДСАвансов.СчетФактура) КАК ТипДокумента
	|ИЗ
	|	ОстаткиНДСАвансов КАК ОстаткиНДСАвансов
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОстаткиНДСАвансов.СчетФактура) <> &ПустойУникальныйИдентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиНДСАвансов.СчетФактура КАК Документ
	|ИЗ
	|	ОстаткиНДСАвансов КАК ОстаткиНДСАвансов
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОстаткиНДСАвансов.СчетФактура) <> &ПустойУникальныйИдентификатор";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПоследнийИндекс = Результат.ВГраница();
	ВыборкаПоТипамДокументов = Результат[ПоследнийИндекс - 1].Выбрать();
	
	СписокДокументов = Результат[ПоследнийИндекс].Выгрузить().ВыгрузитьКолонку("Документ");
	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);

	ТекстыЗапросов = Новый Массив;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОстаткиНДСАвансов.Организация КАК Организация,
	|	ОстаткиНДСАвансов.Контрагент КАК Субконто1,
	|	ЕСТЬNULL(КонтрагентыДоговорыСФ.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Субконто2,
	|	ОстаткиНДСАвансов.СчетФактура КАК Субконто3,
	|	ОстаткиНДСАвансов.ОстатокНДС КАК ОстатокНДС
	|ПОМЕСТИТЬ НДСАвансов
	|ИЗ
	|	ОстаткиНДСАвансов КАК ОстаткиНДСАвансов
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыДоговорыСФ КАК КонтрагентыДоговорыСФ
	|		ПО ОстаткиНДСАвансов.СчетФактура = КонтрагентыДоговорыСФ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыАвансов.Организация КАК Организация,
	|	ОбъектыАвансов.Субконто1 КАК Субконто1,
	|	ОбъектыАвансов.Субконто2 КАК Субконто2,
	|	ОбъектыАвансов.Субконто3 КАК Субконто3,
	|	СУММА(ОбъектыАвансов.ОстатокДолга) КАК ИтогоОстатокДолга
	|ПОМЕСТИТЬ СовпадающаяАналитика
	|ИЗ
	|	ОбъектыАвансов КАК ОбъектыАвансов
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыАвансов.Организация,
	|	ОбъектыАвансов.Субконто1,
	|	ОбъектыАвансов.Субконто2,
	|	ОбъектыАвансов.Субконто3
	|
	|ИМЕЮЩИЕ
	|	(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектыАвансов.Счет) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектыАвансов.ДатаВозникновения) > 1
	|		ИЛИ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъектыАвансов.ДатаПогашения) > 1)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСАвансов.Организация КАК Организация,
	|	ЕСТЬNULL(ОбъектыАвансов.Счет, &СчетНДСАвансов) КАК СчетРасчетов,
	|	НДСАвансов.Субконто1 КАК Субконто1,
	|	НДСАвансов.Субконто2 КАК Субконто2,
	|	НДСАвансов.Субконто3 КАК Субконто3,
	|	ЕСТЬNULL(ОбъектыАвансов.ДатаВозникновения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВозникновения,
	|	ЕСТЬNULL(ОбъектыАвансов.ДатаПогашения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПогашения,
	|	ЕСТЬNULL(ОбъектыАвансов.ОстатокДолга, 0) КАК ОстатокДолга,
	|	НДСАвансов.ОстатокНДС КАК ОстатокНДС,
	|	НЕ СовпадающаяАналитика.Организация ЕСТЬ NULL КАК СовпадающиеЗаписи,
	|	ЕСТЬNULL(СовпадающаяАналитика.ИтогоОстатокДолга, 0) КАК ИтогоОстатокДолга,
	|	НЕ ОбъектыАвансов.Организация ЕСТЬ NULL КАК НайденОбъектРасчетов
	|ПОМЕСТИТЬ НДСАвансовПоОбъектам
	|ИЗ
	|	НДСАвансов КАК НДСАвансов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъектыАвансов КАК ОбъектыАвансов
	|			ЛЕВОЕ СОЕДИНЕНИЕ СовпадающаяАналитика КАК СовпадающаяАналитика
	|			ПО ОбъектыАвансов.Организация = СовпадающаяАналитика.Организация
	|				И ОбъектыАвансов.Субконто1 = СовпадающаяАналитика.Субконто1
	|				И ОбъектыАвансов.Субконто2 = СовпадающаяАналитика.Субконто2
	|				И ОбъектыАвансов.Субконто3 = СовпадающаяАналитика.Субконто3
	|		ПО НДСАвансов.Организация = ОбъектыАвансов.Организация
	|			И НДСАвансов.Субконто1 = ОбъектыАвансов.Субконто1
	|			И НДСАвансов.Субконто2 = ОбъектыАвансов.Субконто2
	|			И НДСАвансов.Субконто3 = ОбъектыАвансов.Субконто3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НДСАвансов";
	
	// Авансовые платежи (с НДС) могут быть отражены на счетах расчетов аренды.
	// Эти платежи уменьшают арендное обязательство в балансе.
	// Следовательно, их необходимо исключить из общего расчета - они учитываются при классификации расчетов по аренде.
	// Договоры аренды переданы в таблице "ОбъектыАвансовАренды" МенеджерВременныхТаблиц
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ОбъектыАвансовАренды") <> Неопределено Тогда
		СхемаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(ТекстЗапроса, "НДСАвансовПоОбъектам");
		ОператорСхемы = СхемаЗапроса.Запрос.Операторы[0];
		
		ИсточникРасчеты = ОператорСхемы.Источники[0];
		
		ИсточникОбъектыАвансовАренды = ОператорСхемы.Источники.Добавить(Тип("ОписаниеВременнойТаблицыСхемыЗапроса"), "ОбъектыАвансовАренды");
		ИсточникОбъектыАвансовАренды.Источник.ДоступныеПоля.Добавить("Контрагент");
		ИсточникОбъектыАвансовАренды.Источник.ДоступныеПоля.Добавить("ДоговорКонтрагента");
		
		УсловиеОбъектыАвансовАренды =
			"НДСАвансов.Субконто1 = ОбъектыАвансовАренды.Контрагент И НДСАвансов.Субконто2 = ОбъектыАвансовАренды.ДоговорКонтрагента";
		ИсточникРасчеты.Соединения.Добавить(ИсточникОбъектыАвансовАренды, УсловиеОбъектыАвансовАренды);
		ОператорСхемы.Отбор.Добавить("ОбъектыАвансовАренды.Контрагент ЕСТЬ NULL");
		
		ТекстЗапроса = СхемаЗапроса.Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	НДСАвансовПоОбъектам.Организация КАК Организация,
	|	НДСАвансовПоОбъектам.СчетРасчетов КАК СчетРасчетов,
	|	НДСАвансовПоОбъектам.Субконто1 КАК Субконто1,
	|	НДСАвансовПоОбъектам.Субконто2 КАК Субконто2,
	|	НДСАвансовПоОбъектам.Субконто3 КАК Субконто3,
	|	НДСАвансовПоОбъектам.ДатаВозникновения КАК ДатаВозникновения,
	|	НДСАвансовПоОбъектам.ДатаПогашения КАК ДатаПогашения,
	|	НДСАвансовПоОбъектам.ОстатокДолга КАК ОстатокДолга,
	|	НДСАвансовПоОбъектам.ИтогоОстатокДолга КАК ИтогоОстатокДолга,
	|	0 КАК ОстатокНДС
	|ИЗ
	|	НДСАвансовПоОбъектам КАК НДСАвансовПоОбъектам
	|ГДЕ
	|	НДСАвансовПоОбъектам.СовпадающиеЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НДСАвансовПоОбъектам.Организация КАК Организация,
	|	НДСАвансовПоОбъектам.Субконто1 КАК Субконто1,
	|	НДСАвансовПоОбъектам.Субконто2 КАК Субконто2,
	|	НДСАвансовПоОбъектам.Субконто3 КАК Субконто3,
	|	НДСАвансовПоОбъектам.ОстатокНДС КАК ОстатокНДС
	|ИЗ
	|	НДСАвансовПоОбъектам КАК НДСАвансовПоОбъектам
	|ГДЕ
	|	НДСАвансовПоОбъектам.СовпадающиеЗаписи");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	ДополнитьТекстЗапросаПоДоговорамСчетовФактур(Запрос, ВыборкаПоТипамДокументов, СписокДокументов);

	Результат = Запрос.ВыполнитьПакет();
	КоличествоПакетов = Результат.ВГраница();

	ТаблицаГруппировки = Результат[КоличествоПакетов].Выгрузить();
	ТаблицаРаспределения = Результат[КоличествоПакетов-1].Выгрузить();

	РаспределитьПропорционально(ТаблицаГруппировки, ТаблицаРаспределения, "ОстатокНДС", "ОстатокДолга","ИтогоОстатокДолга");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаРаспределения.Организация КАК Организация,
	|	ТаблицаРаспределения.СчетРасчетов КАК СчетРасчетов,
	|	ТаблицаРаспределения.Субконто1 КАК Субконто1,
	|	ТаблицаРаспределения.Субконто2 КАК Субконто2,
	|	ТаблицаРаспределения.Субконто3 КАК Субконто3,
	|	ТаблицаРаспределения.ДатаВозникновения КАК ДатаВозникновения,
	|	ТаблицаРаспределения.ДатаПогашения КАК ДатаПогашения,
	|	ТаблицаРаспределения.ОстатокНДС КАК ОстатокНДС
	|ПОМЕСТИТЬ НДСРаспределенный
	|ИЗ
	|	&ТаблицаРаспределения КАК ТаблицаРаспределения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДС.Организация КАК Организация,
	|	НДС.СчетРасчетов КАК СчетРасчетов,
	|	НДС.Субконто1 КАК Субконто1,
	|	НДС.Субконто2 КАК Субконто2,
	|	НДС.Субконто3 КАК Субконто3,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВидАктива, ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляАвансов.ПустаяСсылка)) КАК ВидАктива,
	|	НДС.ДатаПогашения >= &ДатаНачалаДолгосрочногоПериода КАК БолееГода,
	|	НДС.ДатаПогашения <> ДАТАВРЕМЯ(1, 1, 1)
	|		И НДС.ДатаПогашения <= &Дата КАК Просроченная,
	|	НДС.ДатаВозникновения КАК ДатаВозникновения,
	|	НДС.ДатаПогашения КАК ДатаПогашения,
	|	НДС.ОстатокНДС КАК Сальдо
	|ПОМЕСТИТЬ НДСАвансов
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДСАвансовПоОбъектам.Организация КАК Организация,
	|		НДСАвансовПоОбъектам.СчетРасчетов КАК СчетРасчетов,
	|		НДСАвансовПоОбъектам.Субконто1 КАК Субконто1,
	|		НДСАвансовПоОбъектам.Субконто2 КАК Субконто2,
	|		НДСАвансовПоОбъектам.Субконто3 КАК Субконто3,
	|		НДСАвансовПоОбъектам.ДатаВозникновения КАК ДатаВозникновения,
	|		НДСАвансовПоОбъектам.ДатаПогашения КАК ДатаПогашения,
	|		НДСАвансовПоОбъектам.ОстатокНДС КАК ОстатокНДС
	|	ИЗ
	|		НДСАвансовПоОбъектам КАК НДСАвансовПоОбъектам
	|	ГДЕ
	|		НЕ НДСАвансовПоОбъектам.СовпадающиеЗаписи
	|		И НДСАвансовПоОбъектам.НайденОбъектРасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСАвансовПоОбъектам.Организация,
	|		&СчетНДСАвансов,
	|		НДСАвансовПоОбъектам.Субконто1,
	|		НДСАвансовПоОбъектам.Субконто3,
	|		НЕОПРЕДЕЛЕНО,
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		ДАТАВРЕМЯ(1, 1, 1),
	|		НДСАвансовПоОбъектам.ОстатокНДС
	|	ИЗ
	|		НДСАвансовПоОбъектам КАК НДСАвансовПоОбъектам
	|	ГДЕ
	|		НЕ НДСАвансовПоОбъектам.НайденОбъектРасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСРаспределенный.Организация,
	|		НДСРаспределенный.СчетРасчетов,
	|		НДСРаспределенный.Субконто1,
	|		НДСРаспределенный.Субконто2,
	|		НДСРаспределенный.Субконто3,
	|		НДСРаспределенный.ДатаВозникновения,
	|		НДСРаспределенный.ДатаПогашения,
	|		НДСРаспределенный.ОстатокНДС
	|	ИЗ
	|		НДСРаспределенный КАК НДСРаспределенный) КАК НДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО НДС.Субконто2 = ДоговорыКонтрагентов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СчетРасчетов,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	ДатаВозникновения,
	|	ДатаПогашения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОбъектыАвансов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОстаткиНДСАвансов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СовпадающаяАналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НДСАвансовПоОбъектам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КонтрагентыДоговорыСФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НДСРаспределенный";

	
	Если Не ПустаяСтрока(ИмяВременнойТаблицы) Тогда
		ТочкаЗапроса = СхемыЗапросов.НайтиЗапросСозданияТаблицы(ТекстЗапроса, "НДСАвансов");
		ТочкаЗапроса.Запрос.ТаблицаДляПомещения = ИмяВременнойТаблицы;
		ТекстЗапроса = ТочкаЗапроса.Схема.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаРаспределения", ТаблицаРаспределения);

	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаПоДоговорамСчетовФактур(ИсходныйЗапрос, ТипыДокументов, СписокДокументов)
	
	СоздательВременнойТаблицы =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка) КАК Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК Договор
		|ПОМЕСТИТЬ КонтрагентыДоговорыСФ
		|ГДЕ
		|	ЛОЖЬ";
	
	ШаблонДополнения =
		"ВЫБРАТЬ
		|	ВидДокумента.Организация КАК Организация,
		|	ВидДокумента.Ссылка КАК Ссылка,
		|	ВидДокумента.Контрагент КАК Контрагент,
		|	ВидДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ИЗ
		|	&ПолноеИмяДокумента КАК ВидДокумента
		|ГДЕ
		|	ВидДокумента.Ссылка В(&СписокДокументов)
		|";
	
	ШаблонИндексирование = 
		"
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|";
	
	ТекстыПодзапросов = Новый Массив;
	ТекстыПодзапросов.Добавить(СоздательВременнойТаблицы);
	
	Пока ТипыДокументов.Следующий() Цикл
		Если ЗначениеЗаполнено(ТипыДокументов.ТипДокумента) Тогда
			МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипыДокументов.ТипДокумента);
			Если МетаданныеДокумента <> Неопределено Тогда
				Если ДокументСодержитНужныеРеквизиты(МетаданныеДокумента) Тогда
					ТекстыПодзапросов.Добавить(СтрЗаменить(ШаблонДополнения, "&ПолноеИмяДокумента", МетаданныеДокумента.ПолноеИмя()));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = СтрШаблон("%1 %2", СтрСоединить(ТекстыПодзапросов, ОбщегоНазначения.ТекстОбъединитьВсе()), ШаблонИндексирование);
	
	ИсходныйЗапрос.Текст = ТекстЗапроса + ИсходныйЗапрос.Текст;
	
КонецПроцедуры

Функция ДокументСодержитНужныеРеквизиты(МетаданныеДокумента)

	Возврат МетаданныеДокумента.Реквизиты.Найти("Организация") <> Неопределено
			И МетаданныеДокумента.Реквизиты.Найти("Контрагент") <> Неопределено
			И МетаданныеДокумента.Реквизиты.Найти("ДоговорКонтрагента") <> Неопределено;
	
КонецФункции

Процедура РаспределитьПропорционально(ТаблицаГруппировки, ТаблицаРаспределения, КолонкаРасчета, КолонкаЧислитель, КолонкаЗнаменатель)
	
	КолонкиГруппировок = "Организация, Субконто1, Субконто2, Субконто3";

	Для Каждого СтрокаГруппировки Из ТаблицаГруппировки Цикл
		
		Отбор = Новый Структура(КолонкиГруппировок);
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаГруппировки);
		
		СтрокиТаблицы = ТаблицаРаспределения.НайтиСтроки(Отбор);
		
		СуммаРаспределения = СтрокаГруппировки[КолонкаРасчета];
		
		Для Каждого СтрокаТаблица Из СтрокиТаблицы Цикл
			
			СтрокаТаблица[КолонкаРасчета] = Окр(СтрокаГруппировки[КолонкаРасчета] * (СтрокаТаблица[КолонкаЧислитель] / СтрокаТаблица[КолонкаЗнаменатель]), 2);

			СуммаРаспределения = СуммаРаспределения - СтрокаТаблица[КолонкаРасчета];
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область РасчетыПоАрендеИРассрочке

Функция КонтекстРасчетаДисконтированногоОбязательства(КонтекстОперации)

	КонтекстРасчета = РасчетПоказателейБалансаПоОбязательствам.НовыйКонтекстРасчета();
	КонтекстРасчета.КонецПериода = КонтекстОперации.КонецПериодаДата;
	КонтекстРасчета.КонецПериодаДата = КонтекстОперации.КонецПериодаДата;
	КонтекстРасчета.Организации = КонтекстОперации.Организации;
	КонтекстРасчета.ИспользуетсяВалютныйУчет = БухгалтерскийУчетПереопределяемый.ИспользоватьВалютныйУчет();
	КонтекстРасчета.ЕстьДисконтирование = УчетнаяПолитика.ПоддерживаетсяДисконтированиеОбязательств();
	Возврат КонтекстРасчета;
	
КонецФункции

Процедура СоздатьВременныеТаблицыАвансыПоАренде(МенеджерВременныхТаблиц, АрендныеОбязательства)
	
	// Арендное обязательство очищено от НДС. Поэтому при уменьшении обязательства на сумму аванса, аванс также должен быть очищен от НДС.
	// В регистр "Классификация по срокам отдельных видов задолженности" делается запись суммы арендного обязательства, уменьшенного на сумму аванса без НДС.
	// Сумма НДС должна быть отражена также в регистре. Поэтому для его хранения используем счет 76.07.2
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Организация КАК Организация,
	|	Таблица.Счет КАК Счет,
	|	Таблица.Контрагент КАК Контрагент,
	|	Таблица.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Таблица.ДатаПогашения КАК ДатаПогашения,
	|	Таблица.ОстатокПоАрендеДт КАК АвансыПоАренде,
	|	Таблица.НДСсПлатежей КАК НДСсПлатежей,
	|	Таблица.ДолгосрочноеОбязательство КАК ДолгосрочноеОбязательство,
	|	Таблица.КраткосрочноеОбязательство КАК КраткосрочноеОбязательство,
	|	Таблица.ЭтоАванс КАК ЭтоАванс
	|ПОМЕСТИТЬ АрендныеОбязательства
	|ИЗ
	|	&ТаблицаАрендныеОбязательства КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АрендныеОбязательства.Организация КАК Организация,
	|	АрендныеОбязательства.Контрагент КАК Контрагент,
	|	АрендныеОбязательства.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ОбъектыАвансовАренды
	|ИЗ
	|	АрендныеОбязательства КАК АрендныеОбязательства
	|ГДЕ
	|	АрендныеОбязательства.НДСсПлатежей <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АрендныеОбязательства.Организация КАК Организация,
	|	АрендныеОбязательства.Счет КАК Счет,
	|	АрендныеОбязательства.Контрагент КАК Контрагент,
	|	АрендныеОбязательства.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВозникновения,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашения,
	|	АрендныеОбязательства.АвансыПоАренде КАК АвансыПоАренде,
	|	АрендныеОбязательства.НДСсПлатежей КАК НДСсПлатежей
	|ПОМЕСТИТЬ АвансыАренды
	|ИЗ
	|	АрендныеОбязательства КАК АрендныеОбязательства
	|ГДЕ
	|	АрендныеОбязательства.ЭтоАванс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АрендныеОбязательства.Организация,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АрендныеПлатежи),
	|	АрендныеОбязательства.Контрагент,
	|	АрендныеОбязательства.ДоговорКонтрагента,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	0,
	|	АрендныеОбязательства.НДСсПлатежей
	|ИЗ
	|	АрендныеОбязательства КАК АрендныеОбязательства
	|ГДЕ
	|	НЕ АрендныеОбязательства.ЭтоАванс
	|	И АрендныеОбязательства.НДСсПлатежей <> 0";
	
	Запрос.УстановитьПараметр("ТаблицаАрендныеОбязательства", АрендныеОбязательства);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВременныеТаблицыАрендныеОбязательства(МенеджерВременныхТаблиц, АрендныеОбязательства, КонтекстОперации)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Организация КАК Организация,
	|	Таблица.Счет КАК Счет,
	|	Таблица.Контрагент КАК Контрагент,
	|	Таблица.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Таблица.ДатаПогашения КАК ДатаПогашения,
	|	Таблица.ДолгосрочноеОбязательство КАК ДолгосрочноеОбязательство,
	|	Таблица.КраткосрочноеОбязательство КАК КраткосрочноеОбязательство
	|ПОМЕСТИТЬ ВТАрендныеОбязательства
	|ИЗ
	|	&ТаблицаАрендныеОбязательства КАК Таблица
	|ГДЕ
	|	НЕ Таблица.ЭтоАванс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТАрендныеОбязательства.Организация КАК Организация,
	|	ВТАрендныеОбязательства.Счет КАК Счет,
	|	ВТАрендныеОбязательства.Контрагент КАК Контрагент,
	|	ВТАрендныеОбязательства.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВозникновения,
	|	ВЫБОР
	|		КОГДА ВТАрендныеОбязательства.ДатаПогашения > &ДатаОкончанияКраткосрочногоПериода
	|			ТОГДА &ДатаОкончанияКраткосрочногоПериода
	|		ИНАЧЕ ВТАрендныеОбязательства.ДатаПогашения
	|	КОНЕЦ КАК ДатаПогашения,
	|	ВТАрендныеОбязательства.КраткосрочноеОбязательство КАК Обязательство
	|ПОМЕСТИТЬ АрендныеОбязательства
	|ИЗ
	|	ВТАрендныеОбязательства КАК ВТАрендныеОбязательства
	|ГДЕ
	|	ВТАрендныеОбязательства.КраткосрочноеОбязательство <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТАрендныеОбязательства.Организация,
	|	ВТАрендныеОбязательства.Счет,
	|	ВТАрендныеОбязательства.Контрагент,
	|	ВТАрендныеОбязательства.ДоговорКонтрагента,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ВТАрендныеОбязательства.ДатаПогашения,
	|	ВТАрендныеОбязательства.ДолгосрочноеОбязательство
	|ИЗ
	|	ВТАрендныеОбязательства КАК ВТАрендныеОбязательства
	|ГДЕ
	|	ВТАрендныеОбязательства.ДолгосрочноеОбязательство <> 0";

	Запрос.УстановитьПараметр("ДатаОкончанияКраткосрочногоПериода", КонтекстОперации.ДатаОкончанияКраткосрочногоПериода);
	Запрос.УстановитьПараметр("ТаблицаАрендныеОбязательства", АрендныеОбязательства);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВременныеТаблицыЗадолженностьВРассрочку(МенеджерВременныхТаблиц, ДанныеРассрочки, КонтекстОперации)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Организация КАК Организация,
	|	Таблица.Счет КАК Счет,
	|	Таблица.Контрагент КАК Контрагент,
	|	Таблица.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Таблица.ЕстьГрафикПлатежей КАК ЕстьГрафикПлатежей,
	|	Таблица.ДатаВозникновения КАК ДатаВозникновения,
	|	Таблица.ДатаПогашения КАК ДатаПогашения,
	|	Таблица.НоминальнаяДолгосрочнаяВеличина КАК НоминальнаяДолгосрочнаяВеличина,
	|	Таблица.НоминальнаяКраткосрочнаяВеличина КАК НоминальнаяКраткосрочнаяВеличина,
	|	Таблица.КраткосрочноеОбязательство КАК КраткосрочноеОбязательство,
	|	Таблица.ДолгосрочноеОбязательство КАК ДолгосрочноеОбязательство,
	|	Таблица.ПроцентыПоРассрочке КАК ПроцентыПоРассрочке
	|ПОМЕСТИТЬ ВТЗадолженностьВРассрочку
	|ИЗ
	|	&ТаблицаЗадолженностьВРассрочку КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Организация КАК Организация,
	|	Таблица.Счет КАК Счет,
	|	Таблица.Контрагент КАК Контрагент,
	|	Таблица.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Таблица.ПроцентыПоРассрочке КАК ПроцентыПоРассрочке
	|ПОМЕСТИТЬ ВТОстаточныеПроценты
	|ИЗ
	|	&ТаблицаОстаточныеПроценты КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТЗадолженностьВРассрочку.Организация КАК Организация,
	|	ВТЗадолженностьВРассрочку.Счет КАК Счет,
	|	ВТЗадолженностьВРассрочку.Контрагент КАК Контрагент,
	|	ВТЗадолженностьВРассрочку.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ АналитикаРассрочки
	|ИЗ
	|	ВТЗадолженностьВРассрочку КАК ВТЗадолженностьВРассрочку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗадолженностьВРассрочку.Организация КАК Организация,
	|	ВТЗадолженностьВРассрочку.Счет КАК Счет,
	|	ВТЗадолженностьВРассрочку.Контрагент КАК Контрагент,
	|	ВТЗадолженностьВРассрочку.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТЗадолженностьВРассрочку.ДатаВозникновения КАК ДатаВозникновения,
	|	ВЫБОР
	|		КОГДА ВТЗадолженностьВРассрочку.ДатаПогашения > &ДатаОкончанияКраткосрочногоПериода
	|			ТОГДА &ДатаОкончанияКраткосрочногоПериода
	|		ИНАЧЕ ВТЗадолженностьВРассрочку.ДатаПогашения
	|	КОНЕЦ КАК ДатаПогашения,
	|	ВЫБОР
	|		КОГДА ВТЗадолженностьВРассрочку.ЕстьГрафикПлатежей
	|			ТОГДА ВТЗадолженностьВРассрочку.ПроцентыПоРассрочке
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТЗадолженностьВРассрочку.НоминальнаяДолгосрочнаяВеличина < ВТЗадолженностьВРассрочку.ПроцентыПоРассрочке
	|					ТОГДА ВТЗадолженностьВРассрочку.ПроцентыПоРассрочке - ВТЗадолженностьВРассрочку.НоминальнаяДолгосрочнаяВеличина
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ПроцентыПоРассрочке,
	|	ВТЗадолженностьВРассрочку.НоминальнаяКраткосрочнаяВеличина КАК НоминальнаяВеличина
	|ПОМЕСТИТЬ ЗадолженностьВРассрочку
	|ИЗ
	|	ВТЗадолженностьВРассрочку КАК ВТЗадолженностьВРассрочку
	|ГДЕ
	|	(ВТЗадолженностьВРассрочку.НоминальнаяКраткосрочнаяВеличина <> 0
	|			ИЛИ ВТЗадолженностьВРассрочку.КраткосрочноеОбязательство <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТЗадолженностьВРассрочку.Организация,
	|	ВТЗадолженностьВРассрочку.Счет,
	|	ВТЗадолженностьВРассрочку.Контрагент,
	|	ВТЗадолженностьВРассрочку.ДоговорКонтрагента,
	|	ВТЗадолженностьВРассрочку.ДатаВозникновения,
	|	ВТЗадолженностьВРассрочку.ДатаПогашения,
	|	ВЫБОР
	|		КОГДА ВТЗадолженностьВРассрочку.ЕстьГрафикПлатежей
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТЗадолженностьВРассрочку.НоминальнаяДолгосрочнаяВеличина < ВТЗадолженностьВРассрочку.ПроцентыПоРассрочке
	|					ТОГДА ВТЗадолженностьВРассрочку.НоминальнаяДолгосрочнаяВеличина
	|				ИНАЧЕ ВТЗадолженностьВРассрочку.ПроцентыПоРассрочке
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВТЗадолженностьВРассрочку.НоминальнаяДолгосрочнаяВеличина
	|ИЗ
	|	ВТЗадолженностьВРассрочку КАК ВТЗадолженностьВРассрочку
	|ГДЕ
	|	(ВТЗадолженностьВРассрочку.НоминальнаяДолгосрочнаяВеличина <> 0
	|			ИЛИ ВТЗадолженностьВРассрочку.ДолгосрочноеОбязательство <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТОстаточныеПроценты.Организация,
	|	ВТОстаточныеПроценты.Счет,
	|	ВТОстаточныеПроценты.Контрагент,
	|	ВТОстаточныеПроценты.ДоговорКонтрагента,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ВТОстаточныеПроценты.ПроцентыПоРассрочке,
	|	0
	|ИЗ
	|	ВТОстаточныеПроценты КАК ВТОстаточныеПроценты";

	Запрос.УстановитьПараметр("ДатаОкончанияКраткосрочногоПериода", КонтекстОперации.ДатаОкончанияКраткосрочногоПериода);
	Запрос.УстановитьПараметр("ТаблицаЗадолженностьВРассрочку", ДанныеРассрочки.ЗадолженностьВРассрочку);
	Запрос.УстановитьПараметр("ТаблицаОстаточныеПроценты", ДанныеРассрочки.ОстаточныеПроцентыпоРассрочке);
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область РасходыБудущихПериодов

Функция РасходыБудущихПериодовПоСрокам(КонтекстОперации)
	
	ТаблицаРБП = НовыйТаблицаРасходыБудущихПериодов();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации",        КонтекстОперации.Организации);
	Запрос.УстановитьПараметр("НачалоМесяца",       КонтекстОперации.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",       КонтекстОперации.КонецПериода);
	Запрос.УстановитьПараметр("СчетаУчетаРБП",      СчетаУчетаРБП());
	Запрос.УстановитьПараметр("ВидыРБП",            ВидыРБП());
	Запрос.УстановитьПараметр("СчетаУчетаНМА",      БухгалтерскийУчет.СчетаУчетаНазначенияИспользованияНМА());
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто1) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто2) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто3,
	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК Сумма,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА ХозрасчетныйОстатки.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяРБП
	|ПОМЕСТИТЬ ОстаткиРБП
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&СчетаУчетаРБП), , Организация В (&Организации)) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Организация,
	|	ХозрасчетныйОстатки.Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто1) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто2) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА ХозрасчетныйОстатки.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРБП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ХозрасчетныйОстатки.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто1) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто2) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субконто3,
	|	СУММА(ХозрасчетныйОстатки.СуммаОстаток) КАК Сумма,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Субконто1 ССЫЛКА Справочник.НазначенияИспользованияНМА
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА ХозрасчетныйОстатки.Субконто2 ССЫЛКА Справочник.НазначенияИспользованияНМА
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Справочник.НазначенияИспользованияНМА
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НазначенияИспользованияНМА.ПустаяСсылка)
	|	КОНЕЦ КАК НазначениеИспользования
	|ПОМЕСТИТЬ ОстаткиНМА
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериода, Счет В (&СчетаУчетаНМА), , Организация В (&Организации)) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Организация,
	|	ХозрасчетныйОстатки.Счет,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто1) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто2) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ХозрасчетныйОстатки.Субконто3) <> &ПустойУникальныйИдентификатор
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.Субконто1 ССЫЛКА Справочник.НазначенияИспользованияНМА
	|			ТОГДА ХозрасчетныйОстатки.Субконто1
	|		КОГДА ХозрасчетныйОстатки.Субконто2 ССЫЛКА Справочник.НазначенияИспользованияНМА
	|			ТОГДА ХозрасчетныйОстатки.Субконто2
	|		КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Справочник.НазначенияИспользованияНМА
	|			ТОГДА ХозрасчетныйОстатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НазначенияИспользованияНМА.ПустаяСсылка)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НазначениеИспользования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиРБП.Организация КАК Организация,
	|	ОстаткиРБП.Счет КАК Счет,
	|	ОстаткиРБП.Субконто1 КАК Субконто1,
	|	ОстаткиРБП.Субконто2 КАК Субконто2,
	|	ОстаткиРБП.Субконто3 КАК Субконто3,
	|	ОстаткиРБП.Сумма КАК Сумма,
	|	ОстаткиРБП.СтатьяРБП КАК СтатьяРБП,
	|	СтатьиРБП.СпособПризнанияРасходов КАК СпособПризнанияРасходов,
	|	СтатьиРБП.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	СтатьиРБП.ДатаОкончанияСписания КАК ДатаОкончанияСписания
	|ИЗ
	|	ОстаткиРБП КАК ОстаткиРБП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РасходыБудущихПериодов КАК СтатьиРБП
	|		ПО ОстаткиРБП.СтатьяРБП = СтатьиРБП.Ссылка
	|ГДЕ
	|	СтатьиРБП.ВидРБП В(&ВидыРБП)
	|	И СтатьиРБП.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовДляРБП.ДебиторскаяЗадолженность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНМА.Организация,
	|	ОстаткиНМА.Счет,
	|	ОстаткиНМА.Субконто1,
	|	ОстаткиНМА.Субконто2,
	|	ОстаткиНМА.Субконто3,
	|	ОстаткиНМА.Сумма,
	|	ОстаткиНМА.НазначениеИспользования,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыПризнанияРасходов.ПоКалендарнымДням),
	|	НазначенияИспользования.ДатаНачалаСписания,
	|	НазначенияИспользования.ДатаОкончанияСписания
	|ИЗ
	|	ОстаткиНМА КАК ОстаткиНМА
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НазначенияИспользованияНМА КАК НазначенияИспользования
	|		ПО ОстаткиНМА.НазначениеИспользования = НазначенияИспользования.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = ТаблицаРБП.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		
		ДатаОчередногоСписания = КонтекстОперации.ДатаНачалаКраткосрочногоПериода;
		Если КонтекстОперации.ДатаНачалаКраткосрочногоПериода < Выборка.ДатаНачалаСписания Тогда
			ДатаОчередногоСписания = Выборка.ДатаНачалаСписания;
		КонецЕсли;
		
		Если Выборка.СпособПризнанияРасходов = Перечисления.СпособыПризнанияРасходов.ПоКалендарнымДням
			Или Выборка.СпособПризнанияРасходов = Перечисления.СпособыПризнанияРасходов.ПоМесяцам Тогда
			ДоляДолгосрочногоПериода = ДоляВОстаткеАктива(
					Выборка.Сумма,
					Выборка.СпособПризнанияРасходов,
					КонтекстОперации.ДатаНачалаДолгосрочногоПериода,
					ДатаОчередногоСписания,
					Выборка.ДатаОкончанияСписания);
					
			СтрокаТаблицы.КоличествоМесяцевДней = Окр(ДоляДолгосрочногоПериода.Знаменатель, 5);
			СтрокаТаблицы.КоличествоМесяцевДнейДолгосрочногоПериода = Окр(ДоляДолгосрочногоПериода.Числитель, 5);
			СтрокаТаблицы.СуммаДолгосрочная = ДоляДолгосрочногоПериода.Сумма;
			СтрокаТаблицы.СуммаКраткосрочная = Выборка.Сумма - ДоляДолгосрочногоПериода.Сумма;
		Иначе
			Если Выборка.ДатаОкончанияСписания >= КонтекстОперации.ДатаНачалаДолгосрочногоПериода Тогда
				СтрокаТаблицы.СуммаДолгосрочная = Выборка.Сумма;
			Иначе
				СтрокаТаблицы.СуммаКраткосрочная = Выборка.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРБП;

КонецФункции

Функция НовыйТаблицаРасходыБудущихПериодов()
	
	КвалификаторыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Таблица.Колонки.Добавить("Субконто1");
	Таблица.Колонки.Добавить("Субконто2");
	Таблица.Колонки.Добавить("Субконто3");
	Таблица.Колонки.Добавить("ДатаНачалаСписания", Новый ОписаниеТипов("Дата",,,КвалификаторыДаты));
	Таблица.Колонки.Добавить("ДатаОкончанияСписания", Новый ОписаниеТипов("Дата",,,КвалификаторыДаты));
	Таблица.Колонки.Добавить("СпособПризнанияРасходов", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыПризнанияРасходов"));
	Таблица.Колонки.Добавить("КоличествоМесяцевДней", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("КоличествоМесяцевДнейДолгосрочногоПериода", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Сумма", БухгалтерскийУчетКлиентСервер.ТипСумма());
	Таблица.Колонки.Добавить("СуммаКраткосрочная", БухгалтерскийУчетКлиентСервер.ТипСумма());
	Таблица.Колонки.Добавить("СуммаДолгосрочная", БухгалтерскийУчетКлиентСервер.ТипСумма());
	
	Возврат Таблица;
		
КонецФункции

Функция НовыйПротоколРасчета()
	
	ПротоколРасчета = Новый Структура;
	ПротоколРасчета.Вставить("Числитель",   0);
	ПротоколРасчета.Вставить("Знаменатель", 0);
	ПротоколРасчета.Вставить("Доля", 0);
	ПротоколРасчета.Вставить("Сумма", 0);
	
	Возврат ПротоколРасчета;
	
КонецФункции

Функция ДоляВОстаткеАктива(Остаток, Способ, Знач ДатаРасчета, Знач НачалоПериода, Знач КонецПериода)
	
	ПротоколРасчета = НовыйПротоколРасчета();
	
	НачалоПериода = НачалоДня(НачалоПериода);
	КонецПериода  = НачалоДня(КонецПериода);
	ДатаРасчета = НачалоДня(ДатаРасчета);
	
	Если НачалоПериода > КонецПериода
		Или Не ЗначениеЗаполнено(НачалоПериода) Или Не ЗначениеЗаполнено(КонецПериода) Тогда
		Возврат ПротоколРасчета;
	КонецЕсли;
	
	Если Способ = Перечисления.СпособыПризнанияРасходов.ПоКалендарнымДням Тогда
		
		ПротоколРасчета.Знаменатель = ОбщегоНазначенияБПКлиентСервер.РазностьДат(НачалоПериода, КонецДня(КонецПериода) + 1, Перечисления.Периодичность.День);
		
		Если ДатаРасчета <= КонецПериода Тогда
			ПротоколРасчета.Числитель = ОбщегоНазначенияБПКлиентСервер.РазностьДат(ДатаРасчета, КонецДня(КонецПериода) + 1, Перечисления.Периодичность.День);
		КонецЕсли;
		
	ИначеЕсли Способ = Перечисления.СпособыПризнанияРасходов.ПоМесяцам Тогда
		
		ПорядокПризнанияРасходов = РасходыБудущихПериодов.ПорядокПризнанияРасходовПоМесяцам(НачалоПериода, КонецПериода);
		ПротоколРасчета.Знаменатель = ПорядокПризнанияРасходов.ВсегоКоличествоМесяцев;
		
		// Часть срока, которая может быть выражена в календарных месяцах (целом числе месяцев)
		Если ДатаРасчета < ПорядокПризнанияРасходов.КонецПериодаЦелыхМесяцев Тогда
			ПротоколРасчета.Числитель = (Год(ПорядокПризнанияРасходов.КонецПериодаЦелыхМесяцев) - Год(ДатаРасчета)) * 12 
			+ Месяц(ПорядокПризнанияРасходов.КонецПериодаЦелыхМесяцев) - Месяц(ДатаРасчета) + 1;
		КонецЕсли;
		
		НецелыйМесяц = ПорядокПризнанияРасходов.НецелыеМесяцы.Найти(НачалоМесяца(КонецПериода), "Месяц");
		
		Если НецелыйМесяц <> Неопределено И ДатаРасчета <= КонецПериода Тогда
			ПротоколРасчета.Числитель = ПротоколРасчета.Числитель + НецелыйМесяц.Вес;
		КонецЕсли;
		
	КонецЕсли;
	
	ПротоколРасчета.Доля = ?(ПротоколРасчета.Знаменатель = 0, 0, Окр(ПротоколРасчета.Числитель / ПротоколРасчета.Знаменатель, 5));
	ПротоколРасчета.Сумма = КоллекцииСумм.ДоляСуммы(Остаток, ПротоколРасчета.Числитель, ПротоколРасчета.Знаменатель);
	
	Возврат ПротоколРасчета;
	
КонецФункции

// Определяет список видов расходов будущих периодов, которые участвуют в классификации дебиторской задолженности
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыРБП
//
Функция ВидыРБП()
	
	Виды = Новый Массив;
	Виды.Добавить(Перечисления.ВидыРБП.Прочие);
	Виды.Добавить(Перечисления.ВидыРБП.ОсвоениеПриродныхРесурсов);
	Виды.Добавить(Перечисления.ВидыРБП.УбыткиОтРеализацииАмортизируемогоИмущества);
	Виды.Добавить(Перечисления.ВидыРБП.ДолгосрочноеСтрахованиеЖизни);
	Виды.Добавить(Перечисления.ВидыРБП.СтрахованиеНаОплатуМедицинскихРасходов);
	Виды.Добавить(Перечисления.ВидыРБП.СтрахованиеНаСлучайСмертиИУтратыРаботоспособности);
	Виды.Добавить(Перечисления.ВидыРБП.ПрочиеВидыСтрахования);
	
	Возврат Виды;
	
КонецФункции

#КонецОбласти

Процедура ДобавитьПолеЗапроса(ОписаниеЗапроса, Оператор, Псевдоним, Выражение)

	Индекс = ОписаниеЗапроса.Колонки.Количество();
	Оператор.ВыбираемыеПоля.Добавить(Выражение);
	ОписаниеЗапроса.Колонки[Индекс].Псевдоним = Псевдоним;
		
КонецПроцедуры

Функция НовыйНаборыСчетов()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяНабора",        ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	#Область Отборы
	// Отборы для присваивания счету ИмяНабора
	Таблица.Колонки.Добавить("ВидСчета",           Новый ОписаниеТипов("ВидСчета"));
	Таблица.Колонки.Добавить("ВидСубконто1",       Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные"));
	Таблица.Колонки.Добавить("ВидСубконто2",       Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные"));
	Таблица.Колонки.Добавить("ВидСубконто3",       Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные"));
	Таблица.Колонки.Добавить("КоличествоСубконто", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	Таблица.Колонки.Добавить("ДополнитьСчетами",   Новый ОписаниеТипов("Булево"));
	#КонецОбласти
	
	#Область ПараметрыЗапроса
	// Параметры для конструирования запроса
	Таблица.Колонки.Добавить("ИмяПараметраВидыСубконто",   Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("СписокСчетов",               Новый ОписаниеТипов("Массив"));
	Таблица.Колонки.Добавить("ИмяВТ",                      Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("УчитыватьСостояниеРасчетов", Новый ОписаниеТипов("Булево"));
	#КонецОбласти

	Возврат Таблица;
КонецФункции

Функция ДобавитьСтрокуНабораСчетов(НаборыСчетов, ИмяВТ, ИмяНабора, СписокВидовСубконто, ИмяПараметраВидыСубконто = "")
	
	СтрокаНабора = НаборыСчетов.Добавить();
	СтрокаНабора.ИмяНабора = ИмяНабора;
	СтрокаНабора.ИмяВТ = ИмяВТ;
	СтрокаНабора.ИмяПараметраВидыСубконто = ИмяПараметраВидыСубконто;
	СтрокаНабора.ДополнитьСчетами = Истина;
	СтрокаНабора.УчитыватьСостояниеРасчетов = Истина;
	
	Если ИмяПараметраВидыСубконто <> "" Тогда 
		Если СписокВидовСубконто.Свойство(ИмяПараметраВидыСубконто) = Неопределено Тогда
			ИмяПроцедуры = "КлассификацияЗадолженности.ДобавитьСтрокуНабораСчетов";
			ВызватьИсключение СтрШаблон(НСтр("ru = 'В функции %1 не найдены Виды субконто по переданному имени'"),
					ИмяПроцедуры);
		Иначе
			СписокСубконто = СписокВидовСубконто[ИмяПараметраВидыСубконто];
			КоличествоСубконто = СписокСубконто.Количество();
			Для НомерСубконто = 1 По КоличествоСубконто Цикл
				СтрокаНабора[СтрШаблон("ВидСубконто%1", НомерСубконто)] = СписокСубконто[НомерСубконто -1];
			КонецЦикла;
			СтрокаНабора.КоличествоСубконто = КоличествоСубконто;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаНабора;
	
КонецФункции

Процедура УстановитьПараметрыИПоляОстатки(Набор, ТочкаЗапроса, ВидЗадолженности)
	
	ПараметрыТекстовВыражений = Новый Структура;
	ПараметрыТекстовВыражений.Вставить("ИмяСпискаСчетов", СтрШаблон("&%1", Набор.ИмяНабора));
	ПараметрыТекстовВыражений.Вставить("ИмяВидовСубконто",  "");
	Если ЗначениеЗаполнено(Набор.ИмяПараметраВидыСубконто) Тогда
		ПараметрыТекстовВыражений.Вставить("ИмяВидовСубконто",  СтрШаблон("&%1",  Набор.ИмяПараметраВидыСубконто));
	КонецЕсли;
	
	ИндексПараметраУсловиеСчета = 1;
	ИндексПараметраСубконто = 2;
	
	Если ЗначениеЗаполнено(ПараметрыТекстовВыражений.ИмяСпискаСчетов) Тогда
		ИмяПараметраСчет = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку("Счет В ([ИмяСпискаСчетов])", ПараметрыТекстовВыражений);
		ТочкаЗапроса.Источник.Источник.Параметры[ИндексПараметраУсловиеСчета].Выражение = Новый ВыражениеСхемыЗапроса(ИмяПараметраСчет);
	КонецЕсли;
	
	ИмяПараметраВидыСубконто = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку("[ИмяВидовСубконто]", ПараметрыТекстовВыражений);
	ТочкаЗапроса.Источник.Источник.Параметры[ИндексПараметраСубконто].Выражение = Новый ВыражениеСхемыЗапроса(ИмяПараметраВидыСубконто);
	
	Если Не ЗначениеЗаполнено(Набор.ВидСубконто1) Тогда
		Выражение = "НЕОПРЕДЕЛЕНО";
		СхемыЗапросов.УстановитьВыражение(ТочкаЗапроса, "Субконто1", Выражение);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Набор.ВидСубконто2) Тогда
		Выражение = "НЕОПРЕДЕЛЕНО";
		СхемыЗапросов.УстановитьВыражение(ТочкаЗапроса, "Субконто2", Выражение);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Набор.ВидСубконто3) Тогда
		Выражение = "НЕОПРЕДЕЛЕНО";
		СхемыЗапросов.УстановитьВыражение(ТочкаЗапроса, "Субконто3", Выражение);
	КонецЕсли;
	
	Если ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская Тогда 

		Выражение = "ХозрасчетныйОстатки.СуммаОстатокДт";
		Если Не Набор.УчитыватьСостояниеРасчетов Тогда
			Выражение = "ХозрасчетныйОстатки.СуммаОстаток";
		КонецЕсли;
		СхемыЗапросов.УстановитьВыражение(ТочкаЗапроса, "ОстатокДт", Выражение);
		
		Выражение = "0";
		Если СтрНачинаетсяС(Набор.ИмяВТ, "АПРасчетыПоДокументамРасчетов") Тогда
			Выражение = "ХозрасчетныйОстатки.СуммаОстатокКт";
		КонецЕсли;
		СхемыЗапросов.УстановитьВыражение(ТочкаЗапроса, "ОстатокКт", Выражение);
		
	ИначеЕсли ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская Тогда
		
		Выражение = "0";
		Если СтрНачинаетсяС(Набор.ИмяВТ, "АПРасчетыПоДокументамРасчетов") Тогда
			Выражение = "ХозрасчетныйОстатки.СуммаОстатокДт";
		КонецЕсли;
		СхемыЗапросов.УстановитьВыражение(ТочкаЗапроса, "ОстатокДт", Выражение);
		
		Выражение = "ХозрасчетныйОстатки.СуммаОстатокКт";
		Если Не Набор.УчитыватьСостояниеРасчетов Тогда
			Выражение = "-1 * ХозрасчетныйОстатки.СуммаОстаток";
		КонецЕсли;
		СхемыЗапросов.УстановитьВыражение(ТочкаЗапроса, "ОстатокКт", Выражение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
