#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	МассивВладельцев = ПараметрКоманды.Получить();
	Если ТипЗнч(МассивВладельцев) <> тип("Массив") Тогда
		ВызватьИсключение "Передан неправильный параметр";
	КонецЕсли;
	Если МассивВладельцев.Количество() = 0 Тогда
		ВызватьИсключение "Не передан параметр команды";
	КонецЕсли;
	
	ПоГрузоперевозкам = Ложь;
	Если ТипЗнч(МассивВладельцев[0]) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		мВладелец = МассивВладельцев;  
		ПоГрузоперевозкам = Истина;
	ИначеЕсли ТипЗнч(МассивВладельцев[0]) = Тип("СправочникСсылка.CW_Заказы") Тогда
		мВладелец = Справочники.CW_Заказы.ПолучитьМассивГрузоперевозокЗаказа(МассивВладельцев);
		ПоГрузоперевозкам = Истина;
	ИначеЕсли ТипЗнч(МассивВладельцев[0]) = Тип("СправочникСсылка.CW_Заявки") Тогда 
		мВладелец = ПолучитьВариантыБюджетаПоЗаявке(МассивВладельцев);
	КонецЕсли;
	
	ЗаголовокОтчета = "АНАЛИЗ БЮДЖЕТА"; 
	
	//Параметры вывода
	СтркутураПараметров = Новый Структура;
	СтркутураПараметров.Вставить("Заголовок", ЗаголовокОтчета);
	
	CW_Отчеты.УстановитьПараметрыВыводаКомпоновкиДанных(КомпоновщикНастроек.Настройки, СтркутураПараметров);
	
	мПорядокОтражения 	= ПолучитьПорядокОтражения();   
	
	
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ВариантГруппировки", 	СокрЛП(ВариантГруппировки),	КомпоновщикНастроек.Настройки.ПараметрыДанных);
	
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("Владелец", мВладелец, КомпоновщикНастроек.Настройки.ПараметрыДанных);
	
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ВерсияБюджета",		ВерсияБюджета, 						КомпоновщикНастроек.Настройки.ПараметрыДанных);
	
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("ПорядокОтражения", 	ПорядокОтражения,	КомпоновщикНастроек.Настройки.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("мПорядокОтражения", 	мПорядокОтражения, 	КомпоновщикНастроек.Настройки.ПараметрыДанных);
	
КонецПроцедуры

Функция ПолучитьПорядокОтражения()
	
	мПорядокОтражения = Новый Массив;
	
	Если ПорядокОтражения = 1 Тогда
		мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
		мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"));
		мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));
		мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы"));
	ИначеЕсли  ПорядокОтражения = 2 Тогда
		мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление"));
		мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление"));
		мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам"));
		мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам"));
	КонецЕсли;
	
	Возврат мПорядокОтражения;
	
КонецФункции

Функция ПолучитьВариантыБюджетаПоЗаявке(МассивЗаявок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_Заявки.ВариантБюджета КАК ВариантБюджета
	               |ИЗ
	               |	Справочник.CW_Заявки КАК CW_Заявки
	               |ГДЕ
	               |	CW_Заявки.Ссылка В(&МассивЗаявок)"; 
	
	Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ВариантБюджета");
	
	
КонецФункции

#КонецЕсли