
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИмяИсправления",		ИмяИсправления);
	Параметры.Свойство("ТекстОписанияСтрока",	ТекстОписанияСтрока);
	
	ЗаголовокОписания 	= Новый ФорматированнаяСтрока("Описание исправления: "+ИмяИсправления);
	СтрокаОписания 		= Новый ФорматированнаяСтрока(ТекстОписанияСтрока);
	
	ЭлементДокумента = ТекстОписания.Добавить(ЗаголовокОписания);
	ЭлементДокумента.Шрифт = Новый Шрифт(,,Истина);
	
	ТекстОписания.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ТекстОписания.Добавить(,ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	
	ТекстОписания.Добавить(СтрокаОписания);
	
КонецПроцедуры
