#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПроверитьКорректностьНомера(ТекстНомера, НомерРегион) Экспорт
	
	КорректныеСимволыЧисло	= "0123456789";
	
	Если НомерРегион тогда
		КорректныеСимволыАнгл	= "QWERTYUIOPASDFGHJKLZXCVBNM";
		КорректныеСимволыРус    = "УКЕНХВАРОСМТ";
	КонецЕсли; 	
	
	ПроверяемыйНомер 	= СокрЛП(ТекстНомера);
	
	КорректныеДанные 	= Истина;
	
	ЕстьРусСимволы 		= Ложь;
	ЕстьАнглСимволы 	= Ложь;
	ЕстьЧисло			= Ложь;
	
	Для Поз = 1 по СтрДлина(ПроверяемыйНомер) Цикл
		
		тСиммвол = Сред(ПроверяемыйНомер,Поз,1);
		
		Если СтрНайти(КорректныеСимволыЧисло,тСиммвол) <> 0 тогда
			ЕстьЧисло = истина;
		КонецЕсли;
		Если СтрНайти(КорректныеСимволыАнгл,тСиммвол) <> 0 тогда
			ЕстьАнглСимволы = истина;
		КонецЕсли;
		Если СтрНайти(КорректныеСимволыРус,тСиммвол) <> 0 тогда
			ЕстьРусСимволы = истина;
		КонецЕсли;

	КонецЦикла;

	Если НомерРегион Тогда
		РазныеСимволы 		= ЕстьАнглСимволы и ЕстьРусСимволы; 
		КорректныеДанные 	= ЕстьЧисло и (ЕстьАнглСимволы или ЕстьРусСимволы) и НЕ РазныеСимволы;
	Иначе
		КорректныеДанные = ЕстьЧисло и НЕ ЕстьАнглСимволы и НЕ ЕстьРусСимволы;
	КонецЕсли;
	
	
	Возврат КорректныеДанные;
	
КонецФункции

#КонецЕсли
