
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСтраницуИнформации();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтраницуИнформации()
	
	// формируем закладку "Информация"	
	УстановитьПривилегированныйРежим(Истина);     
	
	ВерсияКонфигурации  = Неопределено;
	
	ИмяОсновнойПодсистемы 	= CW_ВерсииПодсистемСервер.ИмяОсновнойПодсистемы();  
	ОписаниеПодсистем 		= Новый Структура;
	CW_ВерсииПодсистемСервер.ПриДобавленииПодсистем(ОписаниеПодсистем);
	
	ОписаниеПодсистем.Свойство(ИмяОсновнойПодсистемы, ВерсияКонфигурации);  
	
	ТО = "";
	_сф.стр_Добавить(ТО,"Бухгалтерия экспедитора 8"+" ("+СокрЛП(ВерсияКонфигурации)+")"+Символы.ПС);
	_сф.стр_Добавить(ТО,"Copyright © ООО ""КОРАЛ ВЭЙ"", 2000-" + Формат(ТекущаяДата(),"ДФ=yyyy") + Символы.ПС);
	_сф.стр_Добавить(ТО,"Все права защищены"+Символы.ПС);
	Элементы.НадписьОписаниеКонфигурации.Заголовок = ТО;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперсылкаНаСайтНажатие(Элемент)
	
	#Если Вебклиент Тогда 
		ПерейтиПоНавигационнойСсылке("https://www.coralway.ru/products/36");
	#Иначе
		ЗапуститьПриложение("https://www.coralway.ru/products/36");
	#КонецЕсли
	
КонецПроцедуры
