
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимВыбора = Истина;
	ЗакрыватьПриВыборе = Истина;
	Параметр = Параметры.Параметр;
	Заголовок = Строка(Параметр);
	ДоступныеЗначения.Загрузить(Параметр.ДоступныеЗначения.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЗначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыполнитьВыбор(Элементы.ДоступныеЗначения.ТекущиеДанные.ДоступноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	Если (Элементы.ДоступныеЗначения.ТекущиеДанные <> Неопределено) Тогда
		
		ВыполнитьВыбор(Элементы.ДоступныеЗначения.ТекущиеДанные.ДоступноеЗначение);
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьВыбор(Значение)
	// --- 
	
	ЭтаФорма.Закрыть(Значение);
	
	// --- 
КонецПроцедуры
  