
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПользовательскийКурс",ПользовательскийКурс);
	Параметры.Свойство("Курс"		,Курс);
	Параметры.Свойство("Кратность"	,Кратность);
	// --- 
	Параметры.Свойство("ДатаКурса"	,ДатаКурса);
	Параметры.Свойство("Валюта"		,Валюта);
	Параметры.Свойство("РасчетыВУЕ"	,РасчетыВУЕ);
	
	// --- 
	Если (Курс = 0) Тогда
		_ОбновитьКурсНаДату();
	КонецЕсли; 
	Если (Кратность=0) Тогда
		Кратность = 1;
	КонецЕсли; 
	// --- 
	Если (ПользовательскийКурс) Тогда
		СелекторКурса = 1;
	Иначе
		СелекторКурса = 0;
	КонецЕсли; 
	// --- 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьКурсНаДату()
	// --- 
	
	СК = CW_Финансы.ПолучитьКурсВалюты(Валюта,ДатаКурса);
	Курс = СК.Курс;
	Кратность = СК.Кратность;
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Элементы.Курс.Видимость = (ПользовательскийКурс);
	Элементы.Кратность.Видимость = (ПользовательскийКурс);
	
	// --- 
КонецПроцедуры


&НаКлиенте
Процедура СелекторКурсаПриИзменении(Элемент)
	
	ПользовательскийКурс = (СелекторКурса = 1);
	Если (ПользовательскийКурс) Тогда
		_ОбновитьКурсНаДату();
	КонецЕсли; 
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаОК(Команда)
	
	СтруктураОтвета = Новый Структура("ПользовательскийКурс,Курс,Кратность",ПользовательскийКурс,Курс,Кратность);
	ЭтаФорма.Закрыть(СтруктураОтвета);
	
КонецПроцедуры



&НаКлиенте
Процедура ПослеВводаДатыкурса(Ответ, Параметры) Экспорт
	
	Если НЕ Ответ = Неопределено Тогда
		СК = CW_Финансы.ПолучитьКурсВалюты(Валюта, Ответ);
		Курс = СК.Курс;	
		Кратность = СК.Кратность;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не РасчетыВУЕ Тогда
		СтандартнаяОбработка = Ложь;
		
		Оповещение 		= Новый ОписаниеОповещения("ПослеВводаДатыкурса", ЭтотОбъект , Параметры);
		ПараметрыФормы 	= новый Структура("ДатаКурса",ДатаКурса);
		ОткрытьФорму("ОбщаяФорма.CW_ФормаКалендаря", ПараметрыФормы,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
	КонецЕсли;
	
КонецПроцедуры
