#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаписатьСтатусВРегистр(ПланированиеДДС, Статус) Экспорт
	
	Отбор =  Новый Структура("ПланированиеДДС", ПланированиеДДС);
	СтруктураСтатуса = РегистрыСведений.CW_СтатусыПланированиеДДС.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	
	Если СтруктураСтатуса.Статус <> Статус Тогда
		
		ЗаписьРегистра = РегистрыСведений.CW_СтатусыПланированиеДДС.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Период = ТекущаяДата();
		ЗаписьРегистра.ПланированиеДДС = ПланированиеДДС;
		ЗаписьРегистра.Статус = Статус;
		
		ЗаписьРегистра.Записать(истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтатусПланированияДДС(ПланированиеДДС, ДатаСреза=Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатусыПланированиеДДССрезПоследних.ПланированиеДДС КАК ПланированиеДДС,
	               |	CW_СтатусыПланированиеДДССрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.CW_СтатусыПланированиеДДС.СрезПоследних(&ДатаСреза, ПланированиеДДС = &ПланированиеДДС) КАК CW_СтатусыПланированиеДДССрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", 			ДатаСреза);
	Запрос.УстановитьПараметр("ПланированиеДДС", 	ПланированиеДДС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Перечисление.CW_СтатусыПланированияДДС.План");
	
КонецФункции

#КонецЕсли