
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДоходыРасходы", ДоходыРасходы);
	
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Команда)
	
	СтруктураОтбора = ПолучитьСтруктуруОтбораНаСервере();
	ЭтаФорма.Закрыть(СтруктураОтбора);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОтбораНаСервере()
	
	СоответствиеИменРеквизитов = ПолучитьСоответствиеИменРеквизитов();
	
	ИмяРеквизита = СоответствиеИменРеквизитов.Получить(ВарианитПоиска);
	Если ИмяРеквизита = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	мНомера = Новый Массив;
	
	Для НомерСтроки = 1 по ТекстыНомеров.КоличествоСтрок() Цикл
		ВведенныйНомер = ТекстыНомеров.ПолучитьСтроку(НомерСтроки);
		мНомера.Добавить(ВведенныйНомер);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизита",	ИмяРеквизита);
	Результат.Вставить("МассивНомеров", мНомера);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеИменРеквизитов()
	
	Результат = Новый Соответствие;
	Результат.Вставить(0, "НомерСчета"); 
	Результат.Вставить(1, "НомерАкта");   
	
	Если ДоходыРасходы тогда
		Результат.Вставить(2, "НомерСчетаФактуры"); 
	Иначе
		Результат.Вставить(2, "НомерСФ"); 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
