#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьШаблронУслуги(ПараметрыОтбора) Экспорт
	
	мДоговора = Новый Массив;
	мДоговора.Добавить(Справочники.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка());
	
	Если ПараметрыОтбора.ДоговорУказан Тогда
		мДоговора.Добавить(ПараметрыОтбора.ДоговорПоГрузоперевозке);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ШаблоныУслуг.Договор КАК Договор,
	               |	CW_ШаблоныУслуг.Номенклатура КАК Номенклатура,
	               |	CW_ШаблоныУслуг.Шаблон КАК Шаблон,
	               |	CW_ШаблоныУслуг.ШаблонАнглийский КАК ШаблонАнглийский
	               |ИЗ
	               |	РегистрСведений.CW_ШаблоныУслуг КАК CW_ШаблоныУслуг
	               |ГДЕ
	               |	CW_ШаблоныУслуг.Договор В(&мДоговора)
	               |	И ВЫБОР
	               |			КОГДА &УказанДоговор
	               |				ТОГДА ВЫБОР
	               |						КОГДА &СПостащиком
	               |							ТОГДА CW_ШаблоныУслуг.РасходнаяСтатья
	               |						ИНАЧЕ CW_ШаблоныУслуг.ДоходнаяСтатья
	               |					КОНЕЦ
	               |			ИНАЧЕ CW_ШаблоныУслуг.ДоходнаяСтатья
	               |		КОНЕЦ
	               |	И CW_ШаблоныУслуг.Номенклатура = &Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Договор УБЫВ";
	
	Запрос.УстановитьПараметр("мДоговора"		, мДоговора);
	Запрос.УстановитьПараметр("Номенклатура"	, ПараметрыОтбора.Номенклатура);
	Запрос.УстановитьПараметр("УказанДоговор"	, ПараметрыОтбора.ДоговорУказан);
	Запрос.УстановитьПараметр("СПостащиком"		, ПараметрыОтбора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено; 
	
КонецФункции

#КонецЕсли