
Процедура ПолучитьСписокДоходов(ПарамтерыПроцедуры, АдресРезультата) Экспорт
	
	Если ПарамтерыПроцедуры.Свойство("ТаблицаДокументов") Тогда
		ТаблицаДокументов = ПарамтерыПроцедуры.ТаблицаДокументов; 
	КонецЕсли;
	
	CW_ДоходыНерезидентовДополнительный.ЗаполнитьТаблицуДокументов(ПарамтерыПроцедуры, ТаблицаДокументов);
	
	ПоместитьВоВременноеХранилище(ТаблицаДокументов, АдресРезультата);
	
КонецПроцедуры

Процедура СформироватьСведенияОДоходах(ПарамтерыПроцедуры, АдресРезультата) Экспорт   
	
	ТаблицаДокументов = ПарамтерыПроцедуры.ТаблицаДокументов;
	
	Отбор   = Новый Структура("Выбор", Истина);
	мСтроки = ТаблицаДокументов.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаТаблицы из мСтроки Цикл
		
		Если СтрокаТаблицы.СписокДоходов.Количество() > 0 Тогда
			УдалитьСведенияОДоходах(СтрокаТаблицы.СписокДоходов);  
			СтрокаТаблицы.СписокДоходов  = Неопределено;
		КонецЕсли;                                                      
		
		Структура = Новый Структура("Период,Контрагент,ДоговорКонтрагента,Документ,Валюта,СуммаПоДокументу");
		ЗаполнитьЗначенияСвойств(Структура,СтрокаТаблицы);   
		Структура.Вставить("Приказ", 		ПарамтерыПроцедуры.Приказ);	
		Структура.Вставить("Организация", 	ПарамтерыПроцедуры.Организация);	
		
		СведенияОДоходах = CW_ДоходыНерезидентовДополнительный.СформироватьСведенияОДоходах(Структура);    
		
		СписокДоходов = Новый Массив;
		СписокДоходов.Добавить(СведенияОДоходах);
		
		СтрокаТаблицы.СписокДоходов  = Новый ФиксированныйМассив(СписокДоходов);    
		СтрокаТаблицы.СуммаДоходов 	 = СведенияОДоходах.СуммаДохода;
		СтрокаТаблицы.Отклонение 	 = СтрокаТаблицы.СуммаПоДокументу - СтрокаТаблицы.СуммаДоходов;
		СтрокаТаблицы.ТребуетсяЗаполнение = (СтрокаТаблицы.Отклонение <> 0);
		СтрокаТаблицы.Выбор = (СтрокаТаблицы.Отклонение <> 0);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаДокументов, АдресРезультата);
	
КонецПроцедуры   

Процедура УдалитьСведенияОДоходах(СписокДоходов)    
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого СведенияОДоходах из  СписокДоходов Цикл
		СведенияОДоходахОбъект = СведенияОДоходах.ПолучитьОбъект(); 
		Если СведенияОДоходахОбъект <> Неопределено Тогда
			СведенияОДоходахОбъект.Удалить();
		КонецЕсли;                                    
	КонецЦикла; 
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


