
Процедура ОбновитьНаличиеДополнительныхСоглашений(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	ЕстьДополнительныеСоглашения = CW_УчетПриложенийДоговоровСервер.ПолучитьФлагНаличияПриложений(Объект.Ссылка);
	Форма.Элементы.ИспользуютсяПриложения.Доступность = Не ЕстьДополнительныеСоглашения;

КонецПроцедуры

Процедура УчетПриложенийПриИзменении(Форма) Экспорт
	
	Форма.Элементы.СтраницаПриложения.Видимость 			= Форма.Объект.ИспользуютсяПриложения; 
	Форма.Элементы.УчитыватьПриложенияВДокументах.Видимость = Форма.Объект.ИспользуютсяПриложения;
	
КонецПроцедуры

Процедура ПриИзмененеииДоговораВСтрокеТабличнойЧасти(Форма, ИмяТаблицы, ИмяРеквизитаДоговор = "") Экспорт
	
	Элементы 		= Форма.Элементы;
	
	ИмяРеквизита 	= ?(ИмяРеквизитаДоговор = "", "Договор", ИмяРеквизитаДоговор); 
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	ТекущиеДанные.УчетПриложенийПоДоговору = CW_УчетПриложенийДоговоровСервер.ПолучитьПризнакУчетаПриложенийПоДоговору(ТекущиеДанные[ИмяРеквизита]);
	
КонецПроцедуры

Процедура ПриИзмененеииКонтрагентаВСтрокеТабличнойЧасти(Форма, ИмяТаблицы) Экспорт
	
	Элементы = Форма.Элементы;
	
	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
	ТекущиеДанные.УчетПриложенийПоДоговору = Ложь;
	ТекущиеДанные.ПриложениеКДоговору = Неопределено;
	
КонецПроцедуры

	
