
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеОтбора", 	ПараметрКоманды);
	ПараметрыФормы.Вставить("Отбор", 			Новый Структура("Документ", ПараметрКоманды));
	
	ОткрытьФорму("РегистрСведений.CW_СтатусыДокументов.Форма.ФормаСпискаИстория", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры
