#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьСоставРеестраПлатежей(РеестрПлатежей, СоставРеестра) Экспорт
	
	Набор = РегистрыСведений.CW_СоставРеестраПлатежей.СоздатьНаборЗаписей();
	Набор.Отбор.РеестрПлатежей.Установить(РеестрПлатежей);
	Набор.Прочитать();
	Набор.Очистить();
	
	Для Каждого ПлатежноеПоручение из СоставРеестра Цикл
		СтрокаНабора = Набор.Добавить();
		СтрокаНабора.РеестрПлатежей 	= РеестрПлатежей; 
		СтрокаНабора.ПлатежноеПоручение = ПлатежноеПоручение; 
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

Функция ПроверитьНаличиеПлатеюныхПоручениеПоОбъекту(РеестрПлатежей) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоставРеестраПлатежей.РеестрПлатежей КАК РеестрПлатежей,
	               |	CW_СоставРеестраПлатежей.ПлатежноеПоручение КАК ПлатежноеПоручение
	               |ИЗ
	               |	РегистрСведений.CW_СоставРеестраПлатежей КАК CW_СоставРеестраПлатежей
	               |ГДЕ
	               |	CW_СоставРеестраПлатежей.РеестрПлатежей = &РеестрПлатежей";
	
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьСуммуПлатежныхПорученийОбъекта(РеестрПлатежей) Экспорт
		
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоставРеестраПлатежей.РеестрПлатежей КАК РеестрПлатежей,
	               |	СУММА(ПлатежныеДокументы.СуммаДокумента) КАК СуммаДокумента
	               |ИЗ
	               |	РегистрСведений.CW_СоставРеестраПлатежей КАК CW_СоставРеестраПлатежей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежныеДокументы
	               |		ПО CW_СоставРеестраПлатежей.ПлатежноеПоручение = ПлатежныеДокументы.Ссылка
	               |ГДЕ
	               |	CW_СоставРеестраПлатежей.РеестрПлатежей = &РеестрПлатежей
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_СоставРеестраПлатежей.РеестрПлатежей";
	
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаДокумента;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьМассивПлатежныхПорученийОбъекта(РеестрПлатежей) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоставРеестраПлатежей.ПлатежноеПоручение КАК ПлатежноеПоручение
	               |ИЗ
	               |	РегистрСведений.CW_СоставРеестраПлатежей КАК CW_СоставРеестраПлатежей
	               |ГДЕ
	               |	CW_СоставРеестраПлатежей.РеестрПлатежей = &РеестрПлатежей";
	
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ПлатежноеПоручение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьУдалениеПлатежныхПорученийОбъекта(РеестрПлатежей, СоставРеестра=Неопределено) Экспорт
	
	Если СоставРеестра = Неопределено Тогда
		СоставРеестра = ПолучитьМассивПлатежныхПорученийОбъекта(РеестрПлатежей);
	КонецЕсли;
	
	Для Каждого ПлатежноеПоручение из СоставРеестра Цикл
		ПлатежноеПоручениеОбъект = ПлатежноеПоручение.ПолучитьОбъект();
		ПлатежноеПоручениеОбъект.УстановитьПометкуУдаления(Истина);
		
		Запись = РегистрыСведений.CW_СоставРеестраПлатежей.СоздатьМенеджерЗаписи();
		Запись.РеестрПлатежей 		= РеестрПлатежей;
		Запись.ПлатежноеПоручение 	= ПлатежноеПоручение;
		
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли