&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.Документ) <> Тип("СписокЗначений") Тогда
		Представление = "Счёт №"+СокрЛП(Параметры.Документ.НомерСчета)+" от "+Формат(Параметры.Документ.ДатаСчета,"ДФ=dd.MM.yyyy")+" ("+Строка(Параметры.Документ.Контрагент)+")";
		СписокДокументов.Добавить(Параметры.Документ, Представление);  
	Иначе 
		Для Каждого ЭлементСписка из Параметры.Документ Цикл
			СписокДокументов.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
	КонецЕсли; 
	
	Если СписокДокументов.Количество() = 1 Тогда   
		ЭлементСписка 	  = СписокДокументов.Получить(0);
		ДанныеПланаОплаты = CW_Документы.ПолучитьПланОплаты(ЭлементСписка.Значение);   
		ДанныеПланаОплаты.Свойство("Дата", 			Дата);	
		ДанныеПланаОплаты.Свойство("Примечание", 	Примечание);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЗаписатьНаСервере();
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()   
	
	СоответствиеИмениРегистраТипуДокумента = ПолучитьСоответствиеИмениРегистраТипуДокумента();
	
	Для Каждого ЭлементСписка из СписокДокументов Цикл
		
		ПолноеИмяРегистра = СоответствиеИмениРегистраТипуДокумента.Получить(ТипЗнч(ЭлементСписка.Значение));
		Если ПолноеИмяРегистра = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяРегистра);
		
		СтруктураСрокаОплаты = Новый Структура;
		СтруктураСрокаОплаты.Вставить("Счет",			ЭлементСписка.Значение);
		СтруктураСрокаОплаты.Вставить("ПлановаяДата",	Дата);
		СтруктураСрокаОплаты.Вставить("Описание",		Примечание);
		
		Менеджер.ЗаписатьПланОплатыДокумента(СтруктураСрокаОплаты);
		
	КонецЦикла;
	
КонецПроцедуры
 
&НаСервере
Функция ПолучитьСоответствиеИмениРегистраТипуДокумента()
	
	Соответствие = новый Соответствие;
	
	Соответствие.Вставить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"), "РегистрСведений.CW_ПланОплатыВходящихСчетов");
	Соответствие.Вставить(Тип("ДокументСсылка.CW_РасходыПоПриобретениям"),  "РегистрСведений.CW_ПланОплатыВходящихСчетов");
	
	Соответствие.Вставить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"),  	 "РегистрСведений.CW_ПланОплатыИсходящихСчетов");
	Соответствие.Вставить(Тип("ДокументСсылка.CW_РеализацияПрочихТоваровУслуг"), "РегистрСведений.CW_ПланОплатыИсходящихСчетов");
	
	Возврат Соответствие;
	
КонецФункции
