
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборПоГруппеПользователя();   
	

	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("CW_ГруппаПользователя", 	ГруппаПользователя);
	СтруктураПараметров.Вставить("CW_Пользователь", 		ПараметрыСеанса.ТекущийПользователь);
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураПараметров);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("CW_Пользователь", ПараметрыСеанса.ТекущийПользователь);  
	
	Элементы.Файлы.Видимость = ПолучитьФункциональнуюОпцию("CW_ОтображатьКолонкуФайлыВСпискеЗаявки", СтруктураПараметров);

	//Подсистема.ЛогистическиеСтатусы
	ИспользоватьЛогистическиеСтатусыЗаявок = ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыЗаявок");
	
	Элементы.КартинкаСтатуса.Видимость = ИспользоватьЛогистическиеСтатусыЗаявок;
	Элементы.ЛогистическийСтатус.Видимость = ИспользоватьЛогистическиеСтатусыЗаявок;
	
	Если ИспользоватьЛогистическиеСтатусыЗаявок Тогда
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_Заявки"));
		МеханизмРаскраски 	 = Константы.CW_МеханизмРаскраскиСпискаЗаявок.Получить();
		
		CW_ЛогистическиеСтатусыСервер.ПриСозданииФормыСпискаНаСервере(ЭтаФорма, "Список", ИдентификаторОбъекта, МеханизмРаскраски, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	//Подсистема.ЛогистическиеСтатусы

	УстановитьПараметрыыДинамическогоСписка();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоГруппеПользователя()
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	Если  ГруппаПользователя = ПредопределенноеЗначение("Справочник.CW_ГруппыПользователей.Администраторы") 
		ИЛИ ГруппаПользователя.ПолныеПрава  Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиГруппы  = ГруппаПользователя.ХранилищеФильтраЗаявок.Получить();
	
	Если НастройкиГруппы <> Неопределено Тогда
		Список.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиГруппы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьАрхивныеПриИзменении(Элемент)
	
	УстановитьПараметрыыДинамическогоСписка();
	Элементы.Список.Обновить();	

КонецПроцедуры   

&НаСервере
Процедура УстановитьПараметрыыДинамическогоСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьАрхивные", ПоказатьАрхивные);
	
КонецПроцедуры

