
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры
	//струПараметрыФормыОтправкиПисьма = Новый Структура("СтруктураПисьма, Событие");
	//.Событие         = Новый Структура("Контрагент, ОбъектСобытия", Док.Контрагент, Док);
	//.СтруктураПисьма = _ЭП.СтруктураПисьма();
	//СП = Новый Структура;
	//СП.Вставить("Кодировка","UTF-8");
	//СП.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Обычная);
	//СП.Вставить("Категории", "");
	//// --- 
	//СП.Вставить("Отправитель",Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка()); // учетная запись ЭП (!!!)
	//// адреса - массив из структур адреса (Адрес-ОтображаемоеИмя)
	//СП.Вставить("ОбратныеАдреса",Новый Массив); // необязательный
	//СП.Вставить("Получатели",Новый Массив);
	//СП.Вставить("Получатели_Копии",Новый Массив);
	//СП.Вставить("Получатели_СкрытыеКопии",Новый Массив);
	//// --- 
	//СП.Вставить("Тема","");
	//СП.Вставить("Тексты",Новый Массив); // значение - структура Текст-ТипТекста-Кодировка
	//СП.Вставить("Вложения",Новый Массив); // значение - структура ИмяФайла-ТипАдреса-Адрес
	
	ТекстПисьма = Параметры.СтруктураПисьма.Тексты[0].Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	СтруктураОтвета = Новый Структура("Код, ОписаниеОшибки", 0, "");
	СтруктураОтвета.Вставить("ОткрыватьСтандартнуюФормуОтправкиПочты", ОткрыватьСтандартнуюФормуОтправкиПочты);
	Закрыть(СтруктураОтвета);
КонецПроцедуры
