#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


//СлужебныеПроцедуры
Процедура УдилитьПустыеЗаписиРегистра() Экспорт
	
	мЗаписиКдалению = Новый Массив;
	
	Набор = РегистрыСведений.CW_ПраваДоступаДляСтатейДДС.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	Для Каждого ЗаписьНабора из Набор Цикл
		Если НЕ ЗаписьНабора.УДАЛИТЬПросмотр и Не ЗаписьНабора.Использование Тогда
			мЗаписиКдалению.Добавить(ЗаписьНабора);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЗаписьНабора Из мЗаписиКдалению Цикл
		Набор.Удалить(ЗаписьНабора);
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры
//СлужебныеПроцедуры
#КонецЕсли