#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьНастройкиУчетаОперативнойЗадолженности(Знач Организация, Знач ВидЗадолженности, Знач Период=Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли;  
	
	СтруктураНастроек = ПолучитьПустуюСтруктруНастроек();
	
	//НачалоВеденияОперативногоУчета
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НачалоВеденияОперативногоУчета.ВидОперативнойЗадолженности КАК ВидЗадолженности,
	               |	CW_НачалоВеденияОперативногоУчета.ДатаНачалаВеденияУчета КАК ДатаНачалаВеденияУчета
	               |ИЗ
	               |	РегистрСведений.CW_НачалоВеденияОперативногоУчета КАК CW_НачалоВеденияОперативногоУчета
	               |ГДЕ
	               |	CW_НачалоВеденияОперативногоУчета.Организация = &Организация
	               |	И CW_НачалоВеденияОперативногоУчета.ВидОперативнойЗадолженности = &ВидЗадолженности";
	
	Запрос.УстановитьПараметр("Период",		 		Период);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ВидЗадолженности", 	ВидЗадолженности);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураНастроек.ВедетсяОперативныйУчет = Период >= Выборка.ДатаНачалаВеденияУчета;
		СтруктураНастроек.НачалоВеденияУчета	 = Выборка.ДатаНачалаВеденияУчета;
		СтруктураНастроек.ВводОстатков 			 = (Период < Выборка.ДатаНачалаВеденияУчета);
		
		Если Период < Выборка.ДатаНачалаВеденияУчета Тогда
			Период = Выборка.ДатаНачалаВеденияУчета; 
		КонецЕсли;
	КонецЕсли;
	//---НачалоВеденияОперативногоУчета  
	
	
	//НастройкиУчетаОперативнойЗадолженности
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_НастройкиУчетаОперативнойЗадолженностиСрезПоследних.ВидОперативнойЗадолженности КАК ВидОперативнойЗадолженности,
	|	CW_НастройкиУчетаОперативнойЗадолженностиСрезПоследних.Период КАК Период,
	|	CW_НастройкиУчетаОперативнойЗадолженностиСрезПоследних.КонтрольНоменклатуры КАК КонтрольНоменклатуры,
	|	CW_НастройкиУчетаОперативнойЗадолженностиСрезПоследних.КонтрольПорядкаОтражения КАК КонтрольПорядкаОтражения,
	|	CW_НастройкиУчетаОперативнойЗадолженностиСрезПоследних.КонтрольНДС КАК КонтрольНДС,
	|	CW_НастройкиУчетаОперативнойЗадолженностиСрезПоследних.КонтрольОстатков КАК КонтрольОстатков,
	|	CW_НастройкиУчетаОперативнойЗадолженностиСрезПоследних.РаздельныйУчетОперативнойИБухгалтерскойЗадолженности КАК РаздельныйУчет,
	|	CW_НастройкиУчетаОперативнойЗадолженностиСрезПоследних.УчитыватьПереплатыПоДокументамКакАванс КАК УчитыватьПереплатыПоДокументамКакАванс
	|ИЗ
	|	РегистрСведений.CW_НастройкиУчетаОперативнойЗадолженности.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ВидОперативнойЗадолженности = &ВидЗадолженности) КАК CW_НастройкиУчетаОперативнойЗадолженностиСрезПоследних";
	
	Запрос.УстановитьПараметр("Период",		 		Период);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ВидЗадолженности", 	ВидЗадолженности);   
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураНастроек["НастройкиОперативногоУчета"], Выборка);  
	Иначе
		СтруктураНастроек.НастройкиОперативногоУчета.РаздельныйУчет = Истина;	
	КонецЕсли;
	//НастройкиУчетаОперативнойЗадолженности
	
	Возврат СтруктураНастроек;
	
КонецФункции    

Функция ПолучитьПустуюСтруктруНастроек()

	НастройкиОперативногоУчета = Новый Структура;     
	НастройкиОперативногоУчета.Вставить("Период", Дата(1,1,1));
	НастройкиОперативногоУчета.Вставить("КонтрольНоменклатуры", Ложь );
	НастройкиОперативногоУчета.Вставить("КонтрольПорядкаОтражения", Ложь);
	НастройкиОперативногоУчета.Вставить("КонтрольНДС", Ложь);
	НастройкиОперативногоУчета.Вставить("КонтрольОстатков", Ложь);
	НастройкиОперативногоУчета.Вставить("РаздельныйУчет", Ложь);
	НастройкиОперативногоУчета.Вставить("УчитыватьПереплатыПоДокументамКакАванс", Ложь);
	
	Структура = Новый Структура;     
	Структура.Вставить("ВедетсяОперативныйУчет", 		Ложь);
	Структура.Вставить("НачалоВеденияУчета", 			Дата(1,1,1)); 
	Структура.Вставить("ВводОстатков", 					Ложь); 
	Структура.Вставить("НастройкиОперативногоУчета",	НастройкиОперативногоУчета); 
	
	Возврат Структура;
	
КонецФункции

Процедура ОбработатьКассовыеДокументы(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	Если ПараметрыПроцедуры.ВидОперативнойЗадолженности =  ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.ПустаяСсылка") Тогда
		ПоместитьВоВременноеХранилище(Неопределено, АдресРезультата);
	КонецЕсли;
	
	Если ПараметрыПроцедуры.ВидОперативнойЗадолженности =  ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Кредиторская") Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_Оплата.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CW_Оплата КАК CW_Оплата
		|		ПО СписаниеСРасчетногоСчета.Ссылка = CW_Оплата.Основание
		|ГДЕ
		|	СписаниеСРасчетногоСчета.Организация = &Организация
		|	И СписаниеСРасчетногоСчета.Дата >= &ДатаНачала
		|	И СписаниеСРасчетногоСчета.ПометкаУдаления = ЛОЖЬ";
		
	КонецЕсли;
	
	Если ПараметрыПроцедуры.ВидОперативнойЗадолженности =  ПредопределенноеЗначение("Перечисление.CW_ВидыОперативнойЗадолженности.Дебиторская") Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_Оплата.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CW_Оплата КАК CW_Оплата
		|		ПО ПоступлениеНаРасчетныйСчет.Ссылка = CW_Оплата.Основание
		|ГДЕ
		|	ПоступлениеНаРасчетныйСчет.Организация = &Организация
		|	И ПоступлениеНаРасчетныйСчет.Дата >= &ДатаНачала
		|	И ПоступлениеНаРасчетныйСчет.ПометкаУдаления = ЛОЖЬ";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", ПараметрыПроцедуры.Организация);
	Запрос.УстановитьПараметр("ДатаНачала",  ПараметрыПроцедуры.Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВедомыйОплата = Выборка.Ссылка.ПолучитьОбъект();
		ВедомыйОплата.Основание 			= Неопределено;
		
		Если ВедомыйОплата.Проведен Тогда
			ВедомыйОплата.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		
		ВедомыйОплата.ПометкаУдаления 		= Истина;
		ВедомыйОплата.ОбменДанными.Загрузка = истина;
		ВедомыйОплата.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Истина, АдресРезультата);
	
КонецПроцедуры

#КонецЕсли