&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	////В качестве параметров формы передается структура со свойствами:
	//		- ПодключаемыйОбъект 	- ссылка на справочник "Подключаемые объекты";
	//		- ОбъектНазначения 		- Объект документа из которого выполнен вызов;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИзФормы(Команда)
	
	//ЭтаФорма.Закрыть();
	//
	////массив методов формы владельца, которые необходимо выполнить после закрытия формы внешней команды через обработку оповещения
	//МетодыФормыВладельца = Новый Массив;
	//МетодыФормыВладельца.Добавить("_УправлениеЭлементамиФормы()");
	//
	//ПараметрыОповещения = Новый Структура;
	//ПараметрыОповещения.Вставить("УникальныйИдентификатор"	, ВладелецФормы.УникальныйИдентификатор);
	//ПараметрыОповещения.Вставить("МетодыФормыВладельца"		, МетодыФормыВладельца);
	//
	//Оповестить("ВыполнитьМетодВладельца", ПараметрыОповещения);
	
КонецПроцедуры


// Процедура - Выполнить внешнюю команду
//
// Параметры:
//  СтруктураПараметров	 - 	 структура с параметрами:
//		- ПодключаемыйОбъект 	- ссылка на справочник "Подключаемые объекты";
//		- СсылкаНаОбъект 		- ссылка на документ;
//
&НаКлиенте
Процедура ПослеЗаписи(СтруктураПараметров, ПараметрыЗаписи) Экспорт
	
	Режим = РежимДиалогаВопрос.ДаНет;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, СтруктураПараметров);
	ПоказатьВопрос(Оповещение, "Продолжить выполнение операции?", Режим, 0);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, СтруктураПараметров) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	

КонецПроцедуры


