 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокДоступныхПараметров(Параметры.ВладелецСтатьи);
	
	Параметры.Свойство("ТипКурсаВалюты", 	ТипКурсаВалюты);
	Параметры.Свойство("КонтрольнаяДата", 	КонтрольнаяДата);
	Параметры.Свойство("Курс", 				Курс);
	Параметры.Свойство("Кратность", 		Кратность);
	
	Если ТипКурсаВалюты = 2 Тогда
		КонтрольВыбранногоПараметра();       
	КонецЕсли;

	УстановитьВидимостьЭлементов(); 
	
КонецПроцедуры   

&НаСервере
Процедура УстановитьВидимостьЭлементов() 
	
	Элементы.ГруппаКонтрольнаяДата.Видимость = (ТипКурсаВалюты = 2);
	Элементы.ГруппаФиксированный.Видимость 	 = (ТипКурсаВалюты = 1);
	
КонецПроцедуры

&НаСервере
Процедура КонтрольВыбранногоПараметра() 
	
	Если Не ЗначениеЗаполнено(КонтрольнаяДата) Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокДоступныхПараметров.НайтиПоЗначению(КонтрольнаяДата)	= Неопределено Тогда
		Элементы.КонтрольнаяДата.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
	Иначе
		Элементы.КонтрольнаяДата.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхПараметров(ВладелецСтатьи)
	
	МассивДоступныхПарамтеров = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.ПолучитьМассивДоступныхПарамтеровОбъекта(ВладелецСтатьи);	
	СписокДоступныхПараметров.ЗагрузитьЗначения(МассивДоступныхПарамтеров);

КонецПроцедуры     

&НаКлиенте
Процедура ТипКурсаВалютыПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура КонтрольнаяДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеОтбора = Новый Структура;
	ДанныеОтбора.Вставить("Ссылка", СписокДоступныхПараметров.ВыгрузитьЗначения());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ДанныеОтбора);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", ПараметрыФормы, Элемент, ,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольнаяДатаПриИзменении(Элемент)
	
	КонтрольВыбранногоПараметра();       
	
КонецПроцедуры  


&НаКлиенте
Процедура КомандаОК(Команда) 
	
	Если ПроверитьЗаполнениеРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("ТипКурсаВалюты",	ТипКурсаВалюты);
	РезультатВыбора.Вставить("КонтрольнаяДата",	КонтрольнаяДата);
	РезультатВыбора.Вставить("Курс",			Курс);
	РезультатВыбора.Вставить("Кратность", 		Кратность);
	
	ЭтаФорма.Закрыть(РезультатВыбора);
	
КонецПроцедуры    

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитов()
	
	Отказ = Ложь;
	Если ТипКурсаВалюты = 1 Тогда
		Если Не ЗначениеЗаполнено(Курс) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан курс валюты!",,,"Курс", Отказ);	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Кратность) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана кратность валюты!",,,"Кратность", Отказ);	
		КонецЕсли;
	КонецЕсли;
	
	Если ТипКурсаВалюты = 2 Тогда
		Если Не ЗначениеЗаполнено(КонтрольнаяДата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана контрольная дата!",,,"КонтрольнаяДата", Отказ);	
		КонецЕсли;
	КонецЕсли;  
	
	Возврат Отказ;
	
КонецФункции




