#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Дата = НачалоДня(Дата);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движение = Движения.CW_ПрайсыКонтрагентов.Добавить();
	// --- 
	Движение.Период = Дата;
	Движение.ВидКонтрагента = ВидКонтрагента;
	Движение.Контрагент = Контрагент;
	Движение.ТипПрайса = ТипПрайса;
	// --- 
	Движение.Прайс = Ссылка;
	Движение.ДействителенПо = ДействителенПо;
	
КонецПроцедуры

#КонецЕсли