
Процедура ЗаписатьПланОплатыДокумента(СтруктураПланаОплаты) Экспорт
	
	Описание = "";
	СтруктураПланаОплаты.Свойство("Описание", Описание); 	
	
	ЗаписьРегистра = РегистрыСведений.CW_ПланОплатыИсходящихСчетов.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Счет = СтруктураПланаОплаты.Счет;
	ЗаписьРегистра.Прочитать();
	
	Если ЗаписьРегистра.Выбран() 
		И Не ЗначениеЗаполнено(СтруктураПланаОплаты.ПлановаяДата) 
		И Не ЗначениеЗаполнено(Описание) Тогда
		//Если передана пустая дата и описание, просто удаляем запись регистра
		ЗаписьРегистра.Удалить();
		Возврат;
	КонецЕсли;
	
	ЗаписьРегистра.Счет 		= СтруктураПланаОплаты.Счет;
	ЗаписьРегистра.ПлановаяДата	= СтруктураПланаОплаты.ПлановаяДата; 
	ЗаписьРегистра.Описание		= Описание;
	
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры