
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборДинамическогоСписка();
	
	ЭтоНоваяГруппа = Параметры.Ключ.Пустая();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСписка()
	
	НоменклатураГруппыЗатрат.Отбор.Элементы.Очистить();
	
	НовЭлементОтбора = НоменклатураГруппыЗатрат.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ГруппаЗатрат"); 
	НовЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
	НовЭлементОтбора.Использование 		= Истина; 
	НовЭлементОтбора.ПравоеЗначение 	= Объект.Ссылка;
	НовЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураГруппыЗатратПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Модифицированность или ЭтоНоваяГруппа Тогда
		Отказ = истина;
		ПоказатьПредупреждение(,"Для добавления номенклатуры необходимо записать элемент!");
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтоНоваяГруппа = Ложь;
	УстановитьОтборДинамическогоСписка();
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
