
Процедура ВыполнитьРасчетЛогистическихСтатусов(ПараметрыПроцедуры, АдресРезульата) Экспорт
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("НачалоОбработки", ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.ДатаСделкиФ МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", 	ПараметрыПроцедуры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ПараметрыПроцедуры.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	КоличествоПеревозок = 0;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		РасчетСтатусов_ЗаписатьЛогистическийСтатусОбъекта(Выборка.Ссылка);
		КоличествоПеревозок = КоличествоПеревозок + 1;
	КонецЦикла;
	
	СтруктураОтвета.Вставить("КонецОбработки", 	ТекущаяДата());
	СтруктураОтвета.Вставить("Обработано", 		КоличествоПеревозок);

	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресРезульата);
	
КонецПроцедуры

Функция РасчетСтатусов_ЗаписатьЛогистическийСтатусОбъекта(ИдентификаторОбъекта)
	
	//Определяем по наиболее старшей дате только для грузоперевозок
	ЛогистическийСтатус = РасчетСтатусов_ОпределитьЛогистическийСтатусОбъектаПоДате(ИдентификаторОбъекта);
	
	//Запишем данные в регистр
	РегистрыСведений.CW_ЗначенияЛогистическихСтатусовОбъектов.ЗаписатьЛогистическийСтатусОбъекта(ИдентификаторОбъекта, ЛогистическийСтатус);

КонецФункции

Функция РасчетСтатусов_ОпределитьЛогистическийСтатусОбъектаПоДате(ИдентификаторОбъекта)
	
	СоответствиеНеопредленногоСтатуса 	= Справочники.CW_ЛогистическиеСтатусы.ПолучитьСоответствиеНеопредленногоСтатуса();
	СтатусНеопределен 					= СоответствиеНеопредленногоСтатуса.Получить(ТипЗнч(ИдентификаторОбъекта));
	
	ИндентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ИдентификаторОбъекта));
	
	МассивПараметров 				= Новый Массив;
	СоответствиеСтатусовПараметрам 	= Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка,
	               |	CW_ПараметрыГрузоперевозок.Идентификатор КАК Идентификатор,
	               |	CW_ПараметрыГрузоперевозок.ИдентификаторПлан КАК ИдентификаторПлан,
	               |	CW_ПараметрыГрузоперевозок.ИдентификаторФакт КАК ИдентификаторФакт
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПараметров = РезультатЗапроса.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЛогистическиеСтатусы.Ссылка КАК Ссылка,
	               |	CW_ЛогистическиеСтатусы.ХранилищеОтбора КАК ХранилищеОтбора
	               |ИЗ
	               |	Справочник.CW_ЛогистическиеСтатусы КАК CW_ЛогистическиеСтатусы
	               |ГДЕ
	               |	CW_ЛогистическиеСтатусы.ИдентификаторОбъекта = &ИндентификаторОбъекта
	               |	И CW_ЛогистическиеСтатусы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ИндентификаторОбъекта", ИндентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Настройка = Выборка.ХранилищеОтбора.Получить();
		
		Если Настройка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементОтбора из Настройка.Отбор.Элементы Цикл
			
			Если ЭлементОтбора.ВидСравнения <> ВидСравненияКомпоновкиДанных.Заполнено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаПоля = СокрЛП(ЭлементОтбора.ЛевоеЗначение);//Ссылка.[(кд) Выявление прибыли_ЗначениеФакт]
			
			ПозНачала = СтрНайти(СтрокаПоля,"[");
			
			СтрИдПараметра 	= Сред(СтрокаПоля,ПозНачала+1);
			ПозКонца  		= СтрНайти(СтрИдПараметра, "]");
			идПараметра 	= Лев(СтрИдПараметра,ПозКонца-1);
			
			Отбор = Новый Структура("ИдентификаторФакт", идПараметра);
			мСтроки = ТаблицаПараметров.НайтиСтроки(Отбор);
			Если мСтроки.Количество() = 0 Тогда
				Отбор = Новый Структура("ИдентификаторПлан", идПараметра);
				мСтроки = ТаблицаПараметров.НайтиСтроки(Отбор);
				Если мСтроки.Количество() = 0 Тогда
					Отбор = Новый Структура("Идентификатор", идПараметра);
					мСтроки = ТаблицаПараметров.НайтиСтроки(Отбор);
				КонецЕсли;
			КонецЕсли;
			
			Если мСтроки.Количество() = 0 Тогда
				//Нет такого
				Продолжить;
			КонецЕсли;
			
			Параметр = мСтроки[0].Ссылка;
			
			СоответствиеСтатусовПараметрам.Вставить(Параметр, Выборка.Ссылка);
			
			Если МассивПараметров.Найти(Параметр) = Неопределено Тогда
				МассивПараметров.Добавить(Параметр);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Определяем статус
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ХарактеристикиГрузоперевозок.Параметр КАК Параметр,
	               |	CW_ХарактеристикиГрузоперевозок.ЗначениеФакт КАК ЗначениеФакт
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	               |ГДЕ
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка = &Грузоперевозка
	               |	И CW_ХарактеристикиГрузоперевозок.Параметр В(&мПараметры)
	               |	И CW_ХарактеристикиГрузоперевозок.ЗначениеФакт <> &ЗначениеФакт
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗначениеФакт УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Грузоперевозка", ИдентификаторОбъекта);
	Запрос.УстановитьПараметр("мПараметры", 	МассивПараметров);
	Запрос.УстановитьПараметр("ЗначениеФакт", 	Дата(1,1,1));
	
	РезультатЗапрос = Запрос.Выполнить();
	Выборка = РезультатЗапрос.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекущийСтатус = СоответствиеСтатусовПараметрам.Получить(Выборка.Параметр);
		Если ТекущийСтатус <> Неопределено Тогда
			Возврат ТекущийСтатус;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтатусНеопределен;

КонецФункции
