#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Проверяет корректность заполнения обязательных реквизитов справочника
//
// Параметры
// ---------
//  Нет
//
// Возвращаемое значение
// ---------------------
//   Истина - есть ошибки заполнения, Ложь - ошибок не найдено
//
Функция ЕстьОшибкиЗаполненияРеквизитов()
	
	Отказ = Ложь;

	// для группы проверку не осуществляем
	Если ЭтотОбъект.ЭтоГруппа Тогда
		Возврат Ложь;
	КонецЕсли;  
	
	МассивТиповДвигателей = Новый Массив;
	МассивТиповДвигателей.Добавить(Перечисления.CW_ТипыДвигателейТС.Бензиновый);
	МассивТиповДвигателей.Добавить(Перечисления.CW_ТипыДвигателейТС.Газовый);
	МассивТиповДвигателей.Добавить(Перечисления.CW_ТипыДвигателейТС.Дизельный);
	
	Если МассивТиповДвигателей.Найти(ТипДвигателяТС) <> Неопределено Тогда
		
		Если ВидыТоплива.Количество() = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнены виды топлива!";
			Сообщение.ПутьКДанным 	= "Объект";
			Сообщение.Поле 			= "ВидыТоплива";
			Сообщение.Сообщить();
			
			Отказ = истина;
			
		Иначе
			//Может есть строки но все пустые
			
			ЕстьЗаполненные = Ложь;
			Для Каждого СтрокаВидаТоплива из ВидыТоплива Цикл
				Если ЗначениеЗаполнено(СтрокаВидаТоплива.Топливо) Тогда
					ЕстьЗаполненные = истина;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ЕстьЗаполненные Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не заполнены виды топлива!";
				Сообщение.ПутьКДанным 	= "Объект";
				Сообщение.Поле 			= "ВидыТоплива";
				Сообщение.Сообщить();
				
				Отказ = истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции // ЕстьОшибкиЗаполненияРеквизитов()

Процедура ПередЗаписью(Отказ)
	
	// в режиме обмена оставляем все как есть
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// проверим на наличие ошибок заполнения
	Если ЕстьОшибкиЗаполненияРеквизитов() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры
#КонецЕсли