#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьБлокировкуБюджета(Объект, ВерсияБюджета) Экспорт
		
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_УтверждениеБюджетов.Объект КАК Объект,
	               |	CW_УтверждениеБюджетов.ВерсияБюджета КАК ВерсияБюджета
	               |ИЗ
	               |	РегистрСведений.CW_УтверждениеБюджетов КАК CW_УтверждениеБюджетов
	               |ГДЕ
	               |	CW_УтверждениеБюджетов.Объект = &Объект
	               |	И CW_УтверждениеБюджетов.ВерсияБюджета = &ВерсияБюджета";  
	
	Запрос.УстановитьПараметр("Объект", 		Объект);
	Запрос.УстановитьПараметр("ВерсияБюджета", 	ВерсияБюджета); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
	
#КонецЕсли
