
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ПроверитьНаличиеУчетнойЗаписи() Тогда
		ПоказатьПредупреждение(, "В настройках текущего пользователя не задана учетная запись электронной почты!");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПечатныеФормыПодготовлены",	Ложь); 
	ПараметрыФормы.Вставить("ДанныеДляЗаполненияШаблона", 	ПараметрКоманды);  
	
	ДополнитьПараметрыОтправки(ПараметрыФормы, ПараметрКоманды);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаОтправкиДокументов", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеУчетнойЗаписи()
	
	УчетнуюЗапись = _ЭП.ПолучитьУчетнуюЗаписьТекущегоПользователя();
	Возврат УчетнуюЗапись <> Неопределено; 

КонецФункции

&НаСервере
Процедура ДополнитьПараметрыОтправки(ПараметрыФормы, ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		Если ПараметрКоманды.ФормируетсяАкт Тогда
			Шаблон		= ПараметрКоманды.Договор.ШаблонПисьмаДляОтправкиАктов;
			Получатели 	= ПараметрКоманды.Договор.ЭлектронныйАдресДляОтправкиАктов;
			Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
				Шаблон = ПараметрКоманды.Договор.ОсновнойШаблонПисьма;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
				Шаблон = Константы.CW_ШаблонПисьмаАкта.Получить();	
			КонецЕсли;
		ИначеЕсли ПараметрКоманды.ФормируетсяСчет Тогда 
			Шаблон		= ПараметрКоманды.Договор.ШаблонПисьмаДляОтправкиСчетов;
			Получатели 	= ПараметрКоманды.Договор.ЭлектронныйАдресДляОтправкиСчетов;
			Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
				Шаблон =  ПараметрКоманды.Договор.ОсновнойШаблонПисьма;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
				Шаблон = Константы.CW_ШаблонПисьмаСчета.Получить();	
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрКоманды.ФормируетсяАкт и ПараметрКоманды.ФормируетсяСчет 
			И ПараметрКоманды.Договор.ЭлектронныйАдресДляОтправкиАктов <> ПараметрКоманды.Договор.ЭлектронныйАдресДляОтправкиСчетов Тогда
			Получатели = ПараметрКоманды.Договор.ЭлектронныйАдресДляОтправкиАктов+";"+ПараметрКоманды.Договор.ЭлектронныйАдресДляОтправкиСчетов;	
		КонецЕсли;
		
	КонецЕсли;  
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		Шаблон 		= ПараметрКоманды.Договор.ОсновнойШаблонПисьма;
		Получатели 	= ПараметрКоманды.Договор.ЭлектронныйАдресДляДокументов;
	КонецЕсли;  
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
		Шаблон 		= ПараметрКоманды.Договор.ШаблонПисьмаДляОтправкиОтчетаЭкспедитора;
		Получатели 	= ПараметрКоманды.Договор.ЭлектронныйАдресДляОтправкиОтчетаЭкспедитора;
	КонецЕсли;  
	
	
	МассивПолучатели 	= Новый Массив;
	Получатели 			= СтрЗаменить(Получатели, ",", ";"); //на случай, если адреса разделилил запятыми
	мПолучатели 		= СтрРазделить(Получатели, ";");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПолучатели, мПолучатели, Истина);

	ПараметрыФормы.Вставить("ШаблонПисьма",	Шаблон);
	ПараметрыФормы.Вставить("Получатели", 	СтрСоединить(МассивПолучатели, ";"));

КонецПроцедуры
