
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыПродленияПодписки", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.CW_ОбменГИСЭПДПродлениеПодписки", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПродленияПодписки(Результат, ДополнительныеПараметры) Экспорт
	
	Оповестить("Запись_СчетОбменГИСЭПД");
	
КонецПроцедуры

