#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	CW_УчетСобственногоТранспортаСервер.ПодготовитьДвженияКПроведению(ЭтотОбъект);
	
	МассивИменРегистров = CW_УчетСобственногоТранспортаСервер.ПолучитьИспользуемыеРегистры(ЭтотОбъект);
	
	ДанныеДляПроведения = ПодготовитьДанныеДляПроведения(МассивИменРегистров);
	
	CW_УчетСобственногоТранспортаСервер.ЗарегистрироватьДвиженияДокумента(Движения,ДанныеДляПроведения,МассивИменРегистров);	
		
КонецПроцедуры

Функция ПодготовитьДанныеДляПроведения(МассивИменРегистров)
	
	ДанныеДляПроведения 		= CW_УчетСобственногоТранспортаСервер.ПодготовитьТаблицыДанныхДляПроведения(МассивИменРегистров);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДействиеСоЗначениемПараметра", "Изменить");
	
	
	мОтобранныеСтроки =  УстанавливаемыеПараметрыТС.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаПараметров из мОтобранныеСтроки Цикл
		
		Если СтрокаПараметров.ПараметрТранпортногоСредства <> ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.РегистрационныйЗнак Тогда
			НоваяСтрокаПараметров 								= ДанныеДляПроведения.CW_ПараметрыТС.Добавить();
			НоваяСтрокаПараметров.Период 						= Дата;
			НоваяСтрокаПараметров.ТранспортноеСредство 			= ТранспортноеСредство;
			НоваяСтрокаПараметров.ПараметрТранпортногоСредства 	= СтрокаПараметров.ПараметрТранпортногоСредства;
			НоваяСтрокаПараметров.Значение 						= СтрокаПараметров.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

#КонецЕсли