&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("АдресОбъекта") Тогда
		Отказ = истина;
	КонецЕсли;
	
	Если Не Отказ и Не ЭтоАдресВременногоХранилища(Параметры.АдресОбъекта) Тогда
		Отказ = истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	АдресОбъекта 				= Параметры.АдресОбъекта;
	СтруктураОбъекта 			= ПолучитьИзВременногоХранилища(Параметры.АдресОбъекта) ;
	Объект.ПодключаемыйОбъект 	= Параметры.ПодключаемыйОбъект;
	СтруктураНастроек 			= _ПО.ПолучитьНастройкиОбработки(Объект.ПодключаемыйОбъект);
	
	Параметр 			= Параметры.Параметр;
	ЭтаФорма.Заголовок 	= Строка("Массовое редактирование параметров");
	
	Если Параметр.ДинамическийПараметр Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	СтруктураДанныхХранилища = новый Структура;
	СтруктураДанныхХранилища.Вставить("СсылкаНаОбъект"			, СтруктураОбъекта.Ссылка);
	СтруктураДанныхХранилища.Вставить("ПараметрХранилищаДанных"	, СтруктураНастроек.ПараметрХранилищаДанных);
	
	ТЗ	= Новый ТаблицаЗначений;
	СтруктураКолонкаПараметр = Новый Структура;
	
	Для Каждого СтрокаТаблицы Из СтруктураНастроек.МножествоПараметров Цикл
		ИмяКолонки = "п_" + Строка(СтрокаТаблицы.ПараметрМножественногоЗаполнения.Код);
		ТЗ.Колонки.Добавить(ИмяКолонки, СтрокаТаблицы.ПараметрМножественногоЗаполнения.ТипЗначения, Строка(СтрокаТаблицы.ПараметрМножественногоЗаполнения));
		СтруктураКолонкаПараметр.Вставить(ИмяКолонки, СтрокаТаблицы.ПараметрМножественногоЗаполнения);	
	КонецЦикла;   
	
	СтруктураИмяКолонкиПараметр = новый ФиксированнаяСтруктура(СтруктураКолонкаПараметр);
	
	ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(ТЗ, "ТаблицаПараметров", "ТаблицаПараметровФорма");
	
	Для Каждого ИмяРеквизита из МассивИменДобавленныхРеквизитов Цикл
		 СтруктураИмяКолонкиПараметр.Свойство(ИмяРеквизита, ЭтаФорма[ИмяРеквизита]);
	КонецЦикла;
	
	////получение ТаблицыЗначений из ХранилищаЗначений, если есть
	ТаблицаИзХранилища = ПолучитьЗначениеИзХранилищаДанных(СтруктураДанныхХранилища);
	Если ЗначениеЗаполнено(ТаблицаИзХранилища) И ТипЗнч(ТаблицаИзХранилища) = Тип("ТаблицаЗначений") Тогда
		ТаблицаПараметров.Загрузить(ТаблицаИзХранилища);
	//Иначе
	//	ПереченьПараметров 	= СтруктураНастроек.МножествоПараметров.ВыгрузитьКолонку("ПараметрМножественногоЗаполнения");
	//	ИмяТабличнойЧасти 	= CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(СтруктураОбъекта.Ссылка);
	////	ПолучитьДанныеПараметров(ПереченьПараметров, СтруктураОбъекта.Ссылка[ИмяТабличнойЧасти].Выгрузить());
	КонецЕсли;
	ТаблицаИзХранилища = Неопределено;
	ТЗ = Неопределено;
	СтруктураНастроек.МножествоПараметров = Неопределено;
	
КонецПроцедуры

&НаСервере 
Процедура ПолучитьДанныеПараметров(МассивПараметров, ПараметрыГрузоперевозки)
	СформированнаяТаблица = Новый ТаблицаЗначений;
	СформированнаяТаблица.Добавить(); //В новой таблице нет ни строк, ни колонок. Колонки заполнятся в цикле, по необходимым параметрам
	//Без добавления строки некуда "заполнитьЗначения" в колонки.
	Для каждого Параметр из МассивПараметров Цикл
		НайденнаяСтрока = ПараметрыГрузоперевозки.Найти(Параметр, "Параметр"); 
		Если НайденнаяСтрока <> Неопределено Тогда			
			СформированнаяТаблица.Колонки.Добавить("п_"+СокрЛП(Параметр.Код), Параметр.ТипЗначения, Параметр.Наименование);
			СформированнаяТаблица.ЗаполнитьЗначения(НайденнаяСтрока.Значение, "п_"+СокрЛП(Параметр.Код)); 
		КонецЕсли;
	КонецЦикла;
	ТаблицаПараметров.Загрузить(СформированнаяТаблица);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеИзХранилищаДанных(СтуруктураПараметров)
	
	ИмяТабличнойЧасти 			= CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(СтуруктураПараметров.СсылкаНаОбъект);
	Если ТипЗнч(СтуруктураПараметров.СсылкаНаОбъект) = Тип("ДанныеФормыСтруктура") Тогда
		дфТабличнаяЧастьОбъекта 	= СтуруктураПараметров.СсылкаНаОбъект.Ссылка[ИмяТабличнойЧасти];
	Иначе
		дфТабличнаяЧастьОбъекта 	= СтуруктураПараметров.СсылкаНаОбъект[ИмяТабличнойЧасти];
	КонецЕсли;

	ТабличнаяЧастьОбъекта 		= дфТабличнаяЧастьОбъекта.Выгрузить();
	
	НайденнаяСтрока =  ТабличнаяЧастьОбъекта.Найти(СтуруктураПараметров.ПараметрХранилищаДанных, "Параметр");
	
	Если НайденнаяСтрока <> Неопределено Тогда
		 Возврат  НайденнаяСтрока.ХранилищеДанных.Получить();
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

&НаСервере
Процедура ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(ТаблицаВКоде, ТаблицаРеквизит, ТаблицаПараметровФорма)
	
	МассивИменРеквизитов = Новый Массив;
	
    НовыеРеквизиты = Новый Массив;
	
	Для Каждого Колонка Из ТаблицаВКоде.Колонки Цикл
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ТаблицаРеквизит, Колонка.Заголовок)); 
		Если Колонка.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ДополнительныеЗначенияПараметровГрузоперевозок") Тогда
			НовыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок"), "" , Колонка.Заголовок));
			МассивИменРеквизитов.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;   
	
	МассивИменДобавленныхРеквизитов = Новый ФиксированныйМассив(МассивИменРеквизитов);
	
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	Для Каждого Колонка Из ТаблицаВКоде.Колонки Цикл 
		НовыйЭлемент = Элементы.Добавить(ТаблицаРеквизит + "_" + Колонка.Имя, Тип("ПолеФормы"), Элементы[ТаблицаПараметровФорма]);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = ТаблицаРеквизит + "." + Колонка.Имя; 
		
		Если Колонка.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ДополнительныеЗначенияПараметровГрузоперевозок") Тогда  
			НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", Колонка.Имя);  
			
			НовыйМассив = Новый Массив;
			НовыйМассив.Добавить(НоваяСвязь);  
			
			НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
			НовыйЭлемент.СвязиПараметровВыбора = НовыеСвязи;	
		КонецЕсли;  
		
		ДобавленныйПараметр = Неопределено;
		СтруктураИмяКолонкиПараметр.Свойство(Колонка.Имя, ДобавленныйПараметр);
		
		Если ДобавленныйПараметр <> Неопределено И 
			ДобавленныйПараметр.ОграниченСпискомЗначений Тогда
			НовыйЭлемент.РежимВыбораИзСписка = истина;
			
			ДоступныеЗначения = ДобавленныйПараметр.ДоступныеЗначения.ВыгрузитьКолонку("ДоступноеЗначение");
			НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(ДоступныеЗначения);
		КонецЕсли; 
		
	КонецЦикла;  
 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормы()
	
	ТабПараметров = ЭтаФорма.ТаблицаПараметров;
	
	СтруктДанныхДляРеквизита = ПолучитьСтруктуруДанныхДляХранения();
	НовыйПараметр = Истина;
	Для Каждого Эл из ЭтаФорма.ВладелецФормы.СписокАдресовЗначенийПараметров Цикл
		Если Эл.Представление = Строка(СтруктДанныхДляРеквизита.Параметр.УникальныйИдентификатор()) Тогда
			Эл.Значение = СтруктДанныхДляРеквизита;
			НовыйПараметр = Ложь;	
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НовыйПараметр Тогда
		ЭтаФорма.ВладелецФормы.СписокАдресовЗначенийПараметров.Добавить(СтруктДанныхДляРеквизита, Строка(СтруктДанныхДляРеквизита.Параметр.УникальныйИдентификатор()));
	КонецЕсли;
	
	МассивОтвета = Новый Массив;
	МассивОтвета = ЗаполнитьМассивОтвета(МассивОтвета, ТабПараметров);

	ЭтаФорма.Закрыть(МассивОтвета);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруДанныхДляХранения()
	
	СтруктураДанныхДляХранения = Новый Структура;
	СтруктураДанныхДляХранения.Вставить("Параметр"			, СтруктураНастроек.ПараметрХранилищаДанных);
	СтруктураДанныхДляХранения.Вставить("ДанныеДляХранения"	, ТаблицаПараметров);
	
	Возврат СтруктураДанныхДляХранения;
	
КонецФункции

&НаСервере
Функция ЗаполнитьМассивОтвета(МассивСтруктурОтвета, ТабПараметров)
	
	ФормаСправочника 			= ПолучитьИзВременногоХранилища(АдресОбъекта).Ссылка;
	ИмяТабличнойЧасти 			= CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(ФормаСправочника);
	ИсходнаяТаблицаПараметров 	= ФормаСправочника[ИмяТабличнойЧасти].Выгрузить();
	
	ТаблицаПараметровПерезаполнения = ДанныеФормыВЗначение(ТабПараметров, Тип("ТаблицаЗначений"));
	
	ИндексКолонки = 0;
	Для Каждого КолонкаПараметр из ТаблицаПараметровПерезаполнения.Колонки Цикл 
		Если ТаблицаПараметровПерезаполнения.Количество() > 0 Тогда
			СтрокаПерезаполнения = ТаблицаПараметровПерезаполнения[0]; 
			ЗначениеПараметраПерезаполнения = СтрокаПерезаполнения[ИндексКолонки]; 
		Иначе
			ЗначениеПараметраПерезаполнения = "";
		Конецесли;
	
		ЗаменяемыйПараметр 				= СтруктураИмяКолонкиПараметр[КолонкаПараметр.Имя];
		СтрокаПодЗамену 				= ИсходнаяТаблицаПараметров.Найти(ЗаменяемыйПараметр, "Параметр");
			Если СтрокаПодЗамену <> Неопределено Тогда
				Если ЗначениеЗаполнено(ЗаменяемыйПараметр) Тогда
					
					СтруктураОтвета = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
					СтруктураОтвета.Параметр 		= ЗаменяемыйПараметр;
					СтруктураОтвета.ПараметрИзменен	= Истина;    
					СтруктураОтвета.Значение 		= ЗначениеПараметраПерезаполнения;    
					
					МассивСтруктурОтвета.Добавить(СтруктураОтвета);
				КонецЕсли;
			КонецЕсли;
		ИндексКолонки = ИндексКолонки+1;
	КонецЦикла;
	Возврат МассивСтруктурОтвета;
КонецФункции

&НаКлиенте
Процедура КомандаОК(Команда)

	ОбработатьЗакрытиеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ЭтаФорма.ВладелецФормы.СписокАдресовЗначенийПараметров) Тогда
		ПолучитьТаблицуХранилищаСРеквизитаФормы(ЭтаФорма.ВладелецФормы.СписокАдресовЗначенийПараметров);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьТаблицуХранилищаСРеквизитаФормы(ЭлементФормыВладельца)
	Для Каждого Эл Из ЭлементФормыВладельца Цикл
		Если СтруктураНастроек.ПараметрХранилищаДанных = Эл.Значение.Параметр Тогда
			ТаблицаПараметров.Загрузить(Эл.Значение.ДанныеДляХранения.выгрузить());
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)  
	
	Если ТаблицаПараметров.Количество() > 0  Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОчисткиТаблицыПараметров", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Таблица значений параметров будет очищена. 
		                           |Продолжить?", Режим, 0);
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопросаОчисткиТаблицыПараметров(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ТаблицаПараметров.Очистить();

КонецПроцедуры
