
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьСписокОбработчиков();
	
КонецПроцедуры  

&НаСервере
Процедура ПодготовитьСписокОбработчиков() 
	
	ТекущаяВерсия = "0.0.0.0";    
	
	CW_ОбновлениеКонфигурацииСервер.ПриДобавленииОбработчиковОбновления();  
	
	//Получаем список всех обработчиков доступных для запуска.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбработчикиОбновления.ИмяОбработчика КАК ИмяОбработчика,
	               |	CW_ОбработчикиОбновления.ИмяПодсистемы КАК ИмяПодсистемы,
	               |	CW_ОбработчикиОбновления.ОчередьВыполнения КАК ОчередьВыполнения,
	               |	CW_ОбработчикиОбновления.Версия КАК Версия
	               |ИЗ
	               |	РегистрСведений.CW_ОбработчикиОбновления КАК CW_ОбработчикиОбновления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ОбработчикиОбновления.НачальноеЗаполнение УБЫВ,
	               |	CW_ОбработчикиОбновления.ОчередьВыполнения
	               |АВТОУПОРЯДОЧИВАНИЕ";  
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ТаблицаОбработчиков.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ИндикаторПервогоЗапуска.МаксимальноеЗначение = ТаблицаОбработчиков.Количество();

	ПодключитьОбработчикОжидания("НачатьВыполнениеобработчиков", 0.1, Истина);
	
КонецПроцедуры    

&НаКлиенте
Процедура НачатьВыполнениеобработчиков() Экспорт 
	
	Для Каждого СтрокаТаблицы из ТаблицаОбработчиков Цикл    
		
		РезульатВыполнения = CW_ОбновлениеКонфигурацииСлужебный.ВыполнитьЗаданиеНаСервере(СтрокаТаблицы.ИмяОбработчика);  
		Если РезульатВыполнения.Состояние = "Ошибка" Тогда
			ПодключитьОбработчикОжидания("ЗавершитьВыполнениеОбработчиковОшибка", 1, Истина);
			Возврат;
		КонецЕсли; 
		
		Результат = ПолучитьИзВременногоХранилища(РезульатВыполнения.АдресРезультата);
		Если ТипЗнч(Результат) = Тип("Структура") Тогда 
			ИндикаторПервогоЗапуска = ИндикаторПервогоЗапуска + 1; 
			ОбновитьОтображениеДанных(Элементы.ИндикаторПервогоЗапуска);   
		КонецЕсли;  
		
		ИндикаторПервогоЗапуска = ИндикаторПервогоЗапуска + 1; 
		ОбновитьОтображениеДанных(Элементы.ИндикаторПервогоЗапуска);    
		
	КонецЦикла; 
	
	ПодключитьОбработчикОжидания("ЗавершитьВыполнениеОбработчиковУспешно", 1, Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьВыполнениеОбработчиковУспешно() Экспорт 
	
	ЭтаФорма.Закрыть("Успешно");
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВыполнениеОбработчиковОшибка() Экспорт 
	
	ЭтаФорма.Закрыть("Ошибка");
	
КонецПроцедуры 

