
Процедура ОткрытьФайл(ДанныеФайла) Экспорт
	
	Если ДанныеФайла.СпособХранения = 1 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗапускаПриложения", ЭтотОбъект);
		НачатьЗапускПриложения(Оповещение, ДанныеФайла.ИмяФайла);
		Возврат;
	КонецЕсли; 
	
	#Если Вебклиент Тогда 

		ДополнительныеПараметры = Новый Структура; 
		ДополнительныеПараметры.Вставить("ДанныеФайла", ДанныеФайла);
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеПодключениеРасширенияРаботыСФайлами", ЭтотОбъект, ДополнительныеПараметры);
		НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
		
	#Иначе

		ПродолжитьОткрытиеФайла(ДанныеФайла);
		
	#КонецЕсли
	
	
КонецПроцедуры 

Процедура ПродолжитьОткрытиеФайла(ДанныеФайла)
	
	Оповещение = Новый ОписаниеОповещения("ПослеПолученияКаталогаВременныхФайлов", ЭтотОбъект, ДанныеФайла);
	НачатьПолучениеКаталогаВременныхФайлов(Оповещение);
	
КонецПроцедуры 

Процедура ПослеПолученияКаталогаВременныхФайлов(КаталогВременныхФайлов, ДанныеФайла) Экспорт
	
	ИмяФайла = КаталогВременныхФайлов + ДанныеФайла.ИмяФайлаДляСохранения;
	
	Если ДанныеФайла.СсылкаНаДвоичныеДанныеФайла = Неопределено Тогда
		ПоказатьПредупреждение(, "Не удалось получить данные файла. Проверьте его существование в томе!");	
		Возврат;
	КонецЕсли;  
	
	Оповещение = Новый ОписаниеОповещения("ПослеПолученияФайлаССервера", ЭтотОбъект);
	НачатьПолучениеФайлаССервера(Оповещение, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла, ИмяФайла);
	
КонецПроцедуры 

Процедура ПослеПолученияФайлаССервера(ПолученныйФайл, ДополнительныеПараметры) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗапускаПриложения", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, ПолученныйФайл.ПолноеИмя);
	
КонецПроцедуры 

Процедура ПослеЗапускаПриложения(КодВозврата, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры 

Процедура СохранитьКак(ДанныеФайла) Экспорт  
	
	ПараметрыДиалогаПолученияФайлов = новый ПараметрыДиалогаПолученияФайлов;
	ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ПолноеИмяФайла 	= ДанныеФайла.ИмяФайлаДляСохранения;  
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьСохранениеФайла", CW_РаботаСФайламиСлужебныйКлиент, ДанныеФайла);
	
	ДиалогВыбораФайла.Показать(Оповещение);
	
КонецПроцедуры 

Процедура ПродолжитьСохранениеФайла(ВыбранныеФайлы, ДанныеФайла) Экспорт 
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеФайла.СсылкаНаДвоичныеДанныеФайла = Неопределено Тогда
		ПоказатьПредупреждение(, "Не удалось получить данные файла. Проверьте его существование в томе!");	
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФайла", CW_РаботаСФайламиСлужебныйКлиент);
	
	НачатьПолучениеФайлаССервера(Оповещение, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла, ВыбранныеФайлы[0]); 
	
КонецПроцедуры    

Процедура ПослеСохраненияФайла(ПолученныйФайл, ДополнительныеПараметры) Экспорт 

	Оповещение = Новый ОписаниеОповещения("ОткрытьСохраненыйФайл", CW_РаботаСФайламиСлужебныйКлиент,  ПолученныйФайл.ПолноеИмя);
	
	ПоказатьОповещениеПользователя("Файл сохранен", Оповещение, ПолученныйФайл.ПолноеИмя);
	
КонецПроцедуры 

Процедура ОткрытьСохраненыйФайл(ИмяФайла) Экспорт 

	#Если Вебклиент Тогда 
		ПерейтиПоНавигационнойСсылке(ИмяФайла);
	#Иначе
		ЗапуститьПриложение(ИмяФайла);
	#КонецЕсли
	
КонецПроцедуры


Процедура ЗавершениеПодключениеРасширенияРаботыСФайлами(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Подключено Тогда
		ПродолжитьОткрытиеФайла(ДополнительныеПараметры.ДанныеФайла);
	Иначе
		
		Если ДополнительныеПараметры.Свойство("УстановкаРасширения") Тогда
			ПоказатьПредупреждение(,"Не установлено расширение для работы с файлами");
			Возврат;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеНачатьУстановкуРасширенияРаботыСФайлами", ЭтотОбъект);
		НачатьУстановкуРасширенияРаботыСФайлами(ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершениеНачатьУстановкуРасширенияРаботыСФайлами(ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("УстановкаРасширения", истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеПодключениеРасширенияРаботыСФайлами", ЭтотОбъект, ДополнительныеПараметры);
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);
	
КонецПроцедуры



