&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	CW_ШаблоныДокументовСерверВызовСервера.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	РедактированиеМакросовДоступно 	= CW_ШаблоныДокументовСерверВызовСервера.ПолучитьПравоРедактированияШаблона(Объект.НазначениеШаблона.ЗначениеПустойСсылки, Объект.НазначениеШаблона); 

	Элементы.ПараметрыШаблонаИзменить.Видимость = РедактированиеМакросовДоступно;
	Элементы.ПараметрыШаблонаКонтекстноеМенюИзменить.Видимость = РедактированиеМакросовДоступно;
	
	УстановитьОтборСпискаПараметровШаблона();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СсылкаНаШаблон = Объект.Ссылка;
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
		СсылкаНаШаблон = Параметры.ЗначениеКопирования;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаШаблон) Тогда
		ДанныеШаблона = Справочники.CW_ОбщиеШаблоныДокументов.ДанныеШаблонаДокумента(СсылкаНаШаблон);
		Если ЗначениеЗаполнено(ДанныеШаблона.ТекстHTML) Тогда
			ФорматированныйДокумент.УстановитьHTML(ДанныеШаблона.ТекстHTML, ДанныеШаблона.Вложения);
		КонецЕсли;
	КонецЕсли;    
	
	УстановитьДоступностьЭлементовФормы();   
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()

	РедактированиеДоступно = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьПравоРедактированияШаблона(Объект.Ссылка, Объект.НазначениеШаблона);

	ТолькоПросмотр = Не РедактированиеДоступно; 
	
	Элементы.ПараметрыШаблона.Доступность  		 			= РедактированиеДоступно;
	Элементы.ФорматированныйДокумент.Доступность 			= РедактированиеДоступно;
	
	//Элементы.ПараметрыШаблонаИзменитьПараметр.Доступность 	= РедактированиеДоступно;
	//Элементы.ПараметрыШаблонаДобавитьПараметр.Доступность 	= РедактированиеДоступно;
	Элементы.ФормаЭкспортМакета.Доступность 				= РедактированиеДоступно;
	Элементы.ФормаИмпортМакета.Доступность 					= РедактированиеДоступно;
	Элементы.Комментарий.Доступность 						= РедактированиеДоступно;
	Элементы.ГруппаПараметры.Видимость 						= РедактированиеДоступно;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекстHTML = "";
	Вложения = Новый Структура;
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	
	СтруктураФорматированногоДокумента = Справочники.CW_ОбщиеШаблоныДокументов.ПустаяСтруктураШаблонаДокумента();
	СтруктураФорматированногоДокумента.ТекстHTML 	= ТекстHTML;
	СтруктураФорматированногоДокумента.Вложения		= Вложения;
	
	ТекущийОбъект.ХранилищеШаблона = Новый ХранилищеЗначения(СтруктураФорматированногоДокумента, Новый СжатиеДанных(9));
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)   
	
	СтандартнаяОбработка = Ложь;

	Если CW_ШаблоныДокументовСерверВызовСервера.ЭтоГруппаПараметров(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторПараметра = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИдентификаторПараметра(ВыбраннаяСтрока);
	ВставитьПараметр(ИдентификаторПараметра);

КонецПроцедуры 

&НаКлиенте
Процедура ПараметрыШаблонаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаПередНачаломИзменения(Элемент, Отказ)
	Отказ = Не РедактированиеМакросовДоступно;
КонецПроцедуры
	

&НаКлиенте
Процедура ВставитьПараметр(Значение)
	
	ЗакладкаНачала = Неопределено;
	ЗакладкаОкончания = Неопределено;
	Элементы.ФорматированныйДокумент.ПолучитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);

	ПозицияНачала = ФорматированныйДокумент.ПолучитьПозициюПоЗакладке(ЗакладкаНачала);
	ПозицияОкончания = ФорматированныйДокумент.ПолучитьПозициюПоЗакладке(ЗакладкаОкончания);
	
	Если ЗакладкаНачала <> ЗакладкаОкончания Тогда 
		ФорматированныйДокумент.Удалить(ЗакладкаНачала, ЗакладкаОкончания);
		Элементы.ФорматированныйДокумент.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаНачала);
	КонецЕсли;

	// Выделяем параметр в тексте договора жирным шрифтом и желтым фоном.
	Если ФорматированныйДокумент.Элементы.Количество() = 0 Тогда
		НовыйЭлементДокумента = ФорматированныйДокумент.Добавить(Значение, Тип("ТекстФорматированногоДокумента"));
	Иначе
		НовыйЭлементДокумента = ФорматированныйДокумент.Вставить(ЗакладкаНачала, Значение, Тип("ТекстФорматированногоДокумента"));
	КонецЕсли;

	Если Не СтрНачинаетсяС(Значение, "{Слово") Тогда
		НовыйЭлементДокумента.Шрифт = Новый Шрифт(НовыйЭлементДокумента.Шрифт, , , Истина, , );
	КонецЕсли;
	
	ПозицияОкончания = ПозицияНачала + СтрДлина(Значение);
	ЗакладкаОкончания = ФорматированныйДокумент.ПолучитьЗакладкуПоПозиции(ПозицияОкончания);
	Элементы.ФорматированныйДокумент.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);
	
	Модифицированность = Истина;
	
КонецПроцедуры   

&НаКлиенте
Процедура ФорматированныйДокументПриИзменении(Элемент)
	
	Модифицированность = Истина; 
	
	

КонецПроцедуры

&НаКлиенте
Процедура НазначениеШаблонаПриИзменении(Элемент)
	УстановитьОтборСпискаПараметровШаблона();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокПоказателейШаблона" Тогда
		УстановитьОтборСпискаПараметровШаблона();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборСпискаПараметровШаблона() 
	
	ПараметрыШаблона.Отбор.Элементы.Очистить();

	НовыйЭлементОтбора = ПараметрыШаблона.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НазначениеШаблона");
	НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение 	= Объект.НазначениеШаблона;
	НовыйЭлементОтбора.Использование 	= Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ЭкспортМакета(Команда) 
	
	ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭкспортМакетаЗавершение", ЭтотОбъект);
	ДиалогВыбораПапки.Показать(ОписаниеОповещения);   
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортМакетаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено
		И ВыбранныеФайлы.Количество()>0 Тогда

		КаталогДляСохранения	= ВыбранныеФайлы.Получить(0);    
		ОписаниеФайла 			= ПоместитьФайлыВоВременноеХранилищеНаСервере(); 
		
		#Если ВебКлиент Тогда
			ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
			ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
			
			НачатьПолучениеФайлаССервера(ОписаниеФайла.АдресВоВременномХранилище, ОписаниеФайла.Представление, ПараметрыДиалогаПолученияФайлов);
		#Иначе 
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("КаталогДляСохранения", КаталогДляСохранения);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьФайлыВКаталогЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
			КаталогДляСохранения = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогДляСохранения);
			
			ПолучаемыеФайлы = Новый Массив;
			
			ПолучаемыйФайл 			= Новый ОписаниеПередаваемогоФайла;
			ПолучаемыйФайл.Имя 		= ОписаниеФайла.Представление;
			ПолучаемыйФайл.Хранение = ОписаниеФайла.АдресВоВременномХранилище;
			
			ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
			
			НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, КаталогДляСохранения, Ложь);
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыВКаталогЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Если ПолученныеФайлы = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'При сохранении возникла ошибка'"));
	Иначе
		Состояние(НСтр("ru = 'Сохранение успешно завершено'"), , НСтр("ru = 'в папку:'") + " " + ДополнительныеПараметры.КаталогДляСохранения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПодготовитьHTMLНаОсновеФорматированногоДокумента(ИмяПапки, ИмяФайла)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	
	ТекстHTML = "";
	Вложения = Новый Структура();
	
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	
	ТекстовыйДокументHTML = Новый ТекстовыйДокумент;
	ТекстовыйДокументHTML.УстановитьТекст(ТекстHTML);
	// записываем документ во временную папку
	ТекстовыйДокументHTML.Записать(ПолноеИмяФайла, КодировкаТекста.UTF8);
	
	// Подготовим картинки
	ИмяПапкиКартинок = "_files";
	ПутьКПапкеКартинок = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + "_files";
	СоздатьКаталог(ПутьКПапкеКартинок);
	Для Каждого Картинка Из Вложения Цикл
		
		Картинка.Значение.Записать(ПутьКПапкеКартинок+ "\" + Картинка.Ключ + ".jpg");
		
	КонецЦикла;
	
	ВставитьКартинкиВHTML(ПолноеИмяФайла);
	
	УдалитьВременныйФайлНаСервер(ПутьКПапкеКартинок);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции    

&НаСервере
Функция СтруктураHTMLСКартинками(ТекстHTML)
	
	СтруктураHTML = Новый Структура();
	
	Вложения = Новый Структура();
	ТекстСДвоичнымиДанными = ТекстHTML;
	
	КоличествоВхождений = СтрЧислоВхождений(ТекстHTML, "data:image/");
	
	Для Сч = 1 По КоличествоВхождений Цикл
		// НачалоКартинкаВДвоичныхДанных - здесь начинается описание картинки в двоичных данных
		НачалоКартинкаВДвоичныхДанных = СтрНайти(ТекстСДвоичнымиДанными, "data:image/");
		// НачалоДвоичныхДанных - здесь начинаются закодированные двоичные данные
		НачалоДвоичныхДанных = СтрНайти(ТекстСДвоичнымиДанными, ";base64,") + 8;
		// КартинкаВДвоичныхДанных - Текст двоичных данных, который нужно заменить на картинку в виде пути
		КартинкаВДвоичныхДанных = Сред(ТекстСДвоичнымиДанными, НачалоКартинкаВДвоичныхДанных, НачалоДвоичныхДанных-НачалоКартинкаВДвоичныхДанных);
		// Отрезаем использованную подстроку, чтобы повторно в ней не искать
		ТекстСДвоичнымиДанными = Сред(ТекстСДвоичнымиДанными, НачалоДвоичныхДанных);
		// КонецДвоичныхДанных - здесь заканчиваются закодированные двоичные данные
		КонецДвоичныхДанных = СтрНайти(ТекстСДвоичнымиДанными, "='");
		Если КонецДвоичныхДанных = 0 Тогда
			КонецДвоичныхДанных = СтрНайти(ТекстСДвоичнымиДанными, "=""");
		КонецЕсли;
		// Непосредственно двоичные данные
		ДвоичныеДанные = Лев(ТекстСДвоичнымиДанными, КонецДвоичныхДанных);
		// Вставляем в виде вложения картинку
		Вложения.Вставить("image"+сч, Новый Картинка(Base64Значение(ДвоичныеДанные)));
		// Собрали текст для замены Картинки в двоичных данных, на картинку в виде вложения
		КартинкаВДвоичныхДанных = КартинкаВДвоичныхДанных + ДвоичныеДанные;
		// Отрезаем обработанную часть текста
		ТекстСДвоичнымиДанными = Сред(ТекстСДвоичнымиДанными, КонецДвоичныхДанных);
		// Меняем в тексте картинку в двоичных данных, на вложение.
		ТекстHTML = СтрЗаменить(ТекстHTML, КартинкаВДвоичныхДанных, "image"+сч);
	КонецЦикла;
	
	СтруктураHTML.Вставить("ТекстHTML", ТекстHTML);
	СтруктураHTML.Вставить("Вложения", Вложения);
	
	Возврат СтруктураHTML;
	
КонецФункции

&НаСервере
Процедура ВставитьКартинкиВHTML(ИмяФайлаHTML)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	ТекстHTML = ТекстовыйДокумент.ПолучитьТекст();
	
	ФайлHTML = Новый Файл(ИмяФайлаHTML);
	
	ИмяПапкиКартинок = "_files";
	ПутьКПапкеКартинок = СтрЗаменить(ФайлHTML.ПолноеИмя, ФайлHTML.Имя, ИмяПапкиКартинок);
	
	// ожидается, что в папке будут только картинки
	ФайлыКартинок = НайтиФайлы(ПутьКПапкеКартинок, "*");
	
	Для Каждого ФайлКартинки Из ФайлыКартинок Цикл
		КартинкаТекстом = Base64Строка(Новый ДвоичныеДанные(ФайлКартинки.ПолноеИмя));
		КартинкаТекстом = "data:image/" + Сред(ФайлКартинки.Расширение,2) + ";base64," + Символы.ПС + КартинкаТекстом;
		
		ТекстHTML = СтрЗаменить(ТекстHTML, ФайлКартинки.ИмяБезРасширения, КартинкаТекстом);
	КонецЦикла;
		
	ТекстовыйДокумент.УстановитьТекст(ТекстHTML);
	ТекстовыйДокумент.Записать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	
КонецПроцедуры


&НаСервере
Функция ПоместитьФайлыВоВременноеХранилищеНаСервере()
	
	Папка = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(Папка);
	
	// Указываем имя файла вложения
	ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СокрЛП(Объект.Наименование));
	
	ИмяФайла = СокрЛП(Объект) + ".htm";
	// Подготовим HTML документ на основе форматированного документа
	ПолноеИмяФайла = ПодготовитьHTMLНаОсновеФорматированногоДокумента(Папка, ИмяФайла);
	
	ДвоичныеДанные 				= Новый ДвоичныеДанные(ПолноеИмяФайла);
	ПутьВоВременномХранилище 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтотОбъект.УникальныйИдентификатор);   
	
	ОписаниеФайла = Новый Структура;
	ОписаниеФайла.Вставить("Представление", ИмяФайла);
	ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
	
	УдалитьВременныйФайлНаСервер(Папка);
	
	Возврат ОписаниеФайла;
	
КонецФункции

 &НаСервере
Процедура УдалитьВременныйФайлНаСервер(ИмяФайла)

	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;

	// Удалим временный файл.
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		СведенияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось удалить временный файл по причине: %1'"),
			ПодробноеПредставлениеОшибки(СведенияОбОшибке));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Сохранение текста документа.'", 
			ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ТекстСообщения);
	КонецПопытки;

КонецПроцедуры   

 &НаСервереБезКонтекста
Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения 	= Файл.ИмяБезРасширения;
	Расширение 			= Файл.Расширение;
	Папка 				= Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;
	
КонецФункции


&НаКлиенте
Процедура ИмпортМакета(Команда)
	
	ПараметрыДиалога	= Новый ПараметрыДиалогаПомещенияФайлов("Выберите макета", Ложь, "Веб-страница (.html)|*.htm"); 
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ЗавершитьПомещениеФайла", ЭтотОбъект);
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения,,,, ПараметрыДиалога, УникальныйИдентификатор);

КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьПомещениеФайла(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьПомещениеФайланаСервере(ОписаниеПомещенногоФайла.Адрес);
	
КонецПроцедуры    

&НаСервере
Процедура ЗавершитьПомещениеФайланаСервере(АдресФайла)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	ДанныеФайла.Записать(ИмяВременногоФайла); 
	
	ТекстовыйДокументHTML = Новый ТекстовыйДокумент;
	ТекстовыйДокументHTML.Прочитать(ИмяВременногоФайла, КодировкаТекста.UTF8);
	
	СтруктураHTML = СтруктураHTMLСКартинками(ТекстовыйДокументHTML.ПолучитьТекст());
	
	ФорматированныйДокумент.УстановитьHTML(СтруктураHTML.ТекстHTML, СтруктураHTML.Вложения);

	УдалитьВременныйФайлНаСервер(ИмяВременногоФайла);
	
КонецПроцедуры


&НаКлиенте
Процедура ПараметрыШаблонаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если CW_ШаблоныДокументовСерверВызовСервера.ЭтоГруппаПараметров(ПараметрыПеретаскивания.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторПараметра  = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИдентификаторПараметра(ПараметрыПеретаскивания.Значение); 
 	ПараметрыПеретаскивания.Значение = ИдентификаторПараметра;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ИмяМакроса = ПараметрыПеретаскивания.Значение;
	ПодключитьОбработчикОжидания("ОформитьВставленныйМакрос",0.1,Истина);   

КонецПроцедуры  

&НаКлиенте
Процедура ОформитьВставленныйМакрос()   
	
	ОформитьВставленныйМакросНаСервере();

КонецПроцедуры     

&НаСервере
Процедура ОформитьВставленныйМакросНаСервере()   
	
	НайденнаяОбласть = ФорматированныйДокумент.НайтиТекст(ИмяМакроса); 
	Пока НайденнаяОбласть <> Неопределено Цикл 
		
		Элементы.ФорматированныйДокумент.УстановитьГраницыВыделения(НайденнаяОбласть.ЗакладкаНачала, НайденнаяОбласть.ЗакладкаКонца);
		
		НайденнаяОбласть = ФорматированныйДокумент.НайтиТекст(ИмяМакроса, НайденнаяОбласть.ЗакладкаКонца); 
	
	КонецЦикла;
	ИмяМакроса = "";
	
КонецПроцедуры
