
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьРеквизитыДокументов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УслугиПоДоговоруГрузоперевозки.Ссылка КАК Ссылка,
	               |	CW_УслугиПоДоговоруГрузоперевозки.Договор.Владелец КАК Контрагент,
	               |	CW_УслугиПоДоговоруГрузоперевозки.Договор.Организация КАК Организация,
	               |	CW_УслугиПоДоговоруГрузоперевозки.Договор.ВалютаДоговора КАК ВалютаДокумента
	               |ИЗ
	               |	Документ.CW_УслугиПоДоговоруГрузоперевозки КАК CW_УслугиПоДоговоруГрузоперевозки"; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектУслугиПоДоговору = Выборка.Ссылка.ПолучитьОбъект();  
		ОбъектУслугиПоДоговору.Организация 		= Выборка.Организация;
		ОбъектУслугиПоДоговору.Контрагент 		= Выборка.Контрагент;
		ОбъектУслугиПоДоговору.ВалютаДокумента 	= Выборка.ВалютаДокумента;
		
		Если ОбъектУслугиПоДоговору.Проведен Тогда
			ОбъектУслугиПоДоговору.Записать(РежимЗаписиДокумента.Проведение);
		Иначе		
			ОбъектУслугиПоДоговору.Записать(РежимЗаписиДокумента.Запись);
		Конецесли;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти