#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	
	Дата = CW_Настройки.ТекущаяДатаПользователя();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)     
	
	Если НоменклатураПоДоговору.Количество() = 0 Тогда  
		ВызватьИсключение "Список услуг не заполнен!";
	КонецЕсли; 
	
	Движения.CW_УслугиПоДоговоруГрузоперевозки.Записывать = Истина;
	
	Движение 								= Движения.CW_УслугиПоДоговоруГрузоперевозки.Добавить();
	Движение.Период 						= НачалоДня(Дата);
	Движение.Договор 						= Договор;
	Движение.УслугиПоДоговруГрузоперевозки	= Ссылка;
	
КонецПроцедуры

#КонецЕсли
