#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция - Получить последний номер
//
// Получает последний записанный номер для указанного префикса
//
// Параметры:
//  Параметры	 - 	Структура("ПрефиксНомера",)  
// 
// Возвращаемое значение:
//   - число
//
Функция ПолучитьПоследнийНомер(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НумерацияДоговоров.ПрефиксНомера КАК ПрефиксНомера,
	               |	CW_НумерацияДоговоров.Номер КАК Номер
	               |ИЗ
	               |	РегистрСведений.CW_НумерацияДоговоров КАК CW_НумерацияДоговоров
	               |ГДЕ
	               |	CW_НумерацияДоговоров.ПрефиксНомера = &ПрефиксНомера";
	
	Запрос.УстановитьПараметр("ПрефиксНомера", Параметры.ПрефиксНомера);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		 Возврат Выборка.Номер;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Процедура - Записать последний номер
//
// Записывает текущий номер для указанного префикса
//
// Параметры:
//  Параметры	 - 	Структура("ПрефиксНомера,Номер",)  
//
Процедура ЗаписатьПоследнийНомер(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запись = РегистрыСведений.CW_НумерацияДоговоров.СоздатьМенеджерЗаписи();
	Запись.ПрефиксНомера 	= Параметры.ПрефиксНомера;
	Запись.Номер			= Параметры.Номер;
	
	Запись.Записать(Истина);
	
КонецПроцедуры
#КонецЕсли