#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаВыгрузкиДанных = Справочники.ТорговыеПредложения.ПолучитьМакет("СхемаВыгрузки");
	
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаВыгрузкиДанных, УникальныйИдентификатор);
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	
	Настройки = Неопределено;
	
	Если Параметры.Свойство("Настройки", Настройки) Тогда 
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(Настройки);
	Иначе 
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаВыгрузкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
	
	Элементы.ВыбраннаяНоменклатураХарактеристика.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		ПодключитьОбработчикОжидания("ВыгрузитьНоменклатуруПоОтбору",1,Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастроекКомпоновкиДанныхНастройки

&НаКлиенте
Процедура КомпоновщикНастроекКомпоновкиДанныхНастройкиОтборПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ОтключитьОбработчикОжидания("ВыгрузитьНоменклатуруПоОтбору");
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекКомпоновкиДанныхНастройкиОтборПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПодключитьОбработчикОжидания("ВыгрузитьНоменклатуруПоОтбору",1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекКомпоновкиДанныхНастройкиОтборПослеУдаления(Элемент)
	ПодключитьОбработчикОжидания("ВыгрузитьНоменклатуруПоОтбору",1,Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	Результат = КомпоновщикНастроекКомпоновкиДанных.Настройки;
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьНоменклатуруПоОтборуНаСервере()
	ВыбраннаяНоменклатура.Очистить();
	СхемаКомпоновки = Справочники.ТорговыеПредложения.ПолучитьМакет("СхемаВыгрузки");
	
	
	ТаблицаДанныеПакетаПредложений = Новый ТаблицаЗначений;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, КомпоновщикНастроекКомпоновкиДанных.Настройки,,,
	Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), Ложь);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,,);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаДанныеПакетаПредложений);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ВыбраннаяНоменклатура.Загрузить(ТаблицаДанныеПакетаПредложений);
	
	КоличествоЭлементов = ТаблицаДанныеПакетаПредложений.Количество();
	КоличествоВыбранныхЭлементов=?(КоличествоЭлементов > 1000, "> 1000", КоличествоЭлементов);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНоменклатуруПоОтбору()

ВыгрузитьНоменклатуруПоОтборуНаСервере();	

КонецПроцедуры // ВыгрузитьНоменклатуруПоОтбору()

#КонецОбласти
