#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);

КонецПроцедуры
	
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = CW_Документы.ПрефиксОрганизации(Организация);
	
КонецПроцедуры

// --- 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// --- 
	
КонецПроцедуры

// --- 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для каждого Стр Из ТаблицаКорректировки Цикл
		
		Движение = Движения.CW_ОплатыПокупателейУСН.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Стр);
		Движение.Период = Дата;
		Движение.ВидДвижения = ?(Стр.ВидДвижения=0,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецЕсли


