
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		Дата			  = ТекущаяДата();
		Организация       = ДанныеЗаполнения.Организация;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		РезультатЗапроса = ПолучитьДанныеДляЗаполненияТабличнойЧасти(ДанныеЗаполнения);
		Затраты.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.CW_НезавершенноеПроизводство.Записывать 	= Истина;
	
	Движения.CW_НезавершенноеПроизводство.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка КАК Ссылка,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.Организация КАК Организация,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.Дата КАК Период,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование КАК ДокументДоходов,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.НомерСтроки КАК НомерСтроки,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.СтавкаНДС КАК СтавкаНДС,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Номенклатура КАК Номенклатура,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Подразделение КАК Подразделение,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Количество КАК Количество,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Сумма КАК Сумма,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.НДС КАК НДС,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Всего КАК Всего,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Сумма_Валюта КАК Сумма_Валюта,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.НДС_Валюта КАК НДС_Валюта,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Всего_Валюта КАК Всего_Валюта,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование.Контрагент КАК Контрагент,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование.Договор КАК Договор,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование КАК ДокументРасходов,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование.Валюта КАК Валюта,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Покупатель КАК Покупатель,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.ПриложениеКДоговоруПокупателя КАК ПриложениеКДоговоруПокупателя
	               |ИЗ
	               |	Документ.CW_ВводОстатковНезавершенногоПроизводства.Затраты КАК CW_ВводОстатковНезавершенногоПроизводстваЗатраты
	               |ГДЕ
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.CW_НезавершенноеПроизводство.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляЗаполненияТабличнойЧасти(ДанныеЗаполнения) Экспорт
	
	ПорядокОтраженияДляНЗП 	= CW_УчетНЗПСервер.ПолучитьПорядокОтраженияДляУчетаВСоставеНЗП();
	мПорядокОтраженияЗатрат = ПорядокОтраженияДляНЗП["Расходы"];
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_РасходыПоГрузоперевозкеУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	CW_РасходыПоГрузоперевозкеУслуги.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Номенклатура КАК Номенклатура,
	               |	CW_РасходыПоГрузоперевозкеУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Подразделение КАК Подразделение,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Количество КАК Количество,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Покупатель КАК Покупатель,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ПриложениеКДоговору КАК ПриложениеКДоговоруПокупателя,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.Контрагент КАК Контрагент,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.Договор КАК Договор,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка КАК ДокументРасходов,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.Валюта КАК Валюта,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Сумма КАК Сумма_Валюта,
	               |	CW_РасходыПоГрузоперевозкеУслуги.НДС КАК НДС_Валюта,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Всего КАК Всего_Валюта,
	               |	CW_РасходыПоГрузоперевозкам.Сумма КАК Сумма,
	               |	CW_РасходыПоГрузоперевозкам.НДС КАК НДС,
	               |	CW_РасходыПоГрузоперевозкам.Всего КАК Всего
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
	               |		ПО CW_РасходыПоГрузоперевозкеУслуги.НомерСтроки = CW_РасходыПоГрузоперевозкам.НомерСтроки
	               |			И (CW_РасходыПоГрузоперевозкеУслуги.ПорядокОтражения В (&мПорядокОтражения))
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Регистратор
	               |	И CW_РасходыПоГрузоперевозкам.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор",		ДанныеЗаполнения.Ссылка);
	Запрос.УстановитьПараметр("мПорядокОтражения", 	мПорядокОтраженияЗатрат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента 			= Затраты.Итог("Всего");
	СуммаДокументаВалютная 	= Затраты.Итог("Всего_Валюта");
	
КонецПроцедуры
