
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПриказов = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.ПолучитьСписокПриказов();
	
	Элементы.ДатаНачала.Видимость 					= СписокПриказов.НайтиПоЗначению(Параметры.Ключ) <> Неопределено;
	Элементы.ДатаОкончания.Видимость 				= СписокПриказов.НайтиПоЗначению(Параметры.Ключ) <> Неопределено;
	Элементы.ПриложениеПоВидуТранспорта.Видимость 	= СписокПриказов.НайтиПоЗначению(Параметры.Ключ) = Неопределено и Объект.ЭтоГруппа;
	
	ТолькоПросмотр = (Параметры.ТолькоПросмотр = Истина);  // также может быть Неопределено
	
КонецПроцедуры       


&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)

	ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;

КонецПроцедуры
