
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьФинансовыеСтатусыГрузоперевозок = ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок");
	ИспользоватьФинансовыеСтатусыЗаказов		= ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыЗаказов");
	
	Если Не ИспользоватьФинансовыеСтатусыГрузоперевозок и Не ИспользоватьФинансовыеСтатусыЗаказов Тогда
		Элементы.ГруппаОтбор.Видимость = ложь;
		Элементы.Список.Видимость = ложь;
	Иначе
		ЗаполнитьСписокДоступныхОбъектов();
		УстановитьОтборСпискаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОтбораПриИзменении(Элемент)
	
	УстановитьОтборСпискаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаНаСервере()

	Список.Отбор.Элементы.Очистить();
	
	НовыйЭлемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение 		= Новый ПолеКомпоновкиДанных("ИдентификаторОбъекта");
	НовыйЭлемент.ВидСравнения  		= ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлемент.ПравоеЗначение   	= ЗначениеОтбора;
	НовыйЭлемент.Использование 		= Истина ;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхОбъектов()

	ДоступныеТипыПоОпциям	= CW_ФинансовыеСтатусыСервер.ПолучитьДоступныеТипыПоОпциям();
	КартиникТипаЗначения 	= Справочники.CW_ФинансовыеСтатусы.ПолучитьСоответствиеКартикиТипуЗначения();
	мДоступныеТипы 			= Метаданные.ОпределяемыеТипы.CW_ОбъектыФинансовыхСтатусов.Тип.Типы();
	
	Для Каждого ТипВладельца из мДоступныеТипы Цикл
		
		Если ДоступныеТипыПоОпциям.Найти(ТипВладельца) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КартинкаПоТипу 	= КартиникТипаЗначения.Получить(ТипВладельца);
		КартинкаПоТипу 	= ?(КартинкаПоТипу = Неопределено, БиблиотекаКартинок.CW_ГруппаДокументов, КартинкаПоТипу);
		
		Идентификатор 	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипВладельца);
		
		Элементы.ЗначениеОтбора.СписокВыбора.Добавить(Идентификатор,Идентификатор.Синоним,,КартинкаПоТипу);
		
	КонецЦикла;
	
	Элементы.ГруппаОтбор.Видимость =  Элементы.ЗначениеОтбора.СписокВыбора.Количество() > 1;
	
	ЭлементСписка  = Элементы.ЗначениеОтбора.СписокВыбора.Получить(0);
	ЗначениеОтбора = ЭлементСписка.Значение;
	
КонецПроцедуры


