#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура Добавить(Источник,Сообщение) Экспорт 
		// --- 
		
		УстановитьПривилегированныйРежим(Истина);
		
		Попытка
			
			НовоеСообщение = Справочники.CW_СистемныеСообщения.СоздатьЭлемент();
			НовоеСообщение.Дата = ТекущаяДата();
			НовоеСообщение.Источник = Источник;
			НовоеСообщение.Сообщение = Сообщение;
			НовоеСообщение.Записать();
			
			// --- 
			
			УчетнаяЗаписьСистемныхСообщений = Константы.УчетнаяЗаписьДляСистемныхСообщений.Получить();
			ПолучателиСистемныхСообщений = Константы.ЭлектронныеАдресаПолучателейСистемныхСообщений.Получить();
			
			Если (НЕ УчетнаяЗаписьСистемныхСообщений.Пустая()) И (НЕ СокрЛП(ПолучателиСистемныхСообщений)="") Тогда
				
				// --- 
				
				// формируем письмо
				
				СтруктураПисьма = _ЭП.СтруктураПисьма();
				СтруктураПисьма.Отправитель = УчетнаяЗаписьСистемныхСообщений.Наименование;
				СтруктураПисьма.Получатели = _сф.сп_СоздатьИзСтроки(СтрЗаменить(ПолучателиСистемныхСообщений,",",";"),";");
				// --- 
				СтруктураПисьма.Тема = "[БАЛ] "+НовоеСообщение.Источник;
				СтруктураПисьма.Тело = "Системное сообщение: "+ПолучитьНавигационнуюСсылку(НовоеСообщение.Ссылка)+Символы.ПС+НовоеСообщение.Сообщение;
				
				Ответ = _ЭП.ОтправитьПисьмо(СтруктураПисьма,УчетнаяЗаписьСистемныхСообщений);
				Если Ответ.Код <> 0 Тогда
					
					ЗаписьЖурналаРегистрации("ИБ.СистемноеСообщение",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки()+"; Сообщение:"+Сообщение);
					
				КонецЕсли; 
				
				// --- 
				
			КонецЕсли; 
			
		Исключение
			
			ЗаписьЖурналаРегистрации("ИБ.СистемноеСообщение",УровеньЖурналаРегистрации.Ошибка,,ОписаниеОшибки()+"; Сообщение:"+Сообщение);
			
		КонецПопытки; 
		
		
		// --- 
	КонецПроцедуры
	
#КонецЕсли
