#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	Наименование = Организация.Наименование + " - " + Контрагент.Наименование;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_ПрофилиОбмена.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.CW_DT_ПрофилиОбмена КАК CW_DT_ПрофилиОбмена
		|ГДЕ
		|	CW_DT_ПрофилиОбмена.Организация = &Организация
		|	И CW_DT_ПрофилиОбмена.Контрагент = &Контрагент
		|	И НЕ CW_DT_ПрофилиОбмена.ПометкаУдаления";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	Если Запрос.Выполнить().Выбрать().Количество()>1 Тогда
		Сообщить("Профиль обмена между участниками уже существует!");Отказ=Истина;Возврат;	
	КонецЕсли;
КонецПроцедуры

#КонецЕсли