#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ОбучениеДоступно() Экспорт
	
	Результат = ОбщегоНазначенияБП.ЭтоБизнесСтарт()
		И Не ОбщегоНазначения.ЭтоМобильныйКлиент()
		И ПравоДоступа("Использование", Метаданные.Обработки.ОбучениеРаботеВБизнесСтарт);
	Возврат Результат;
	
КонецФункции

Функция ПоказыватьПриЗапуске() Экспорт
	
	Результат = ОбучениеДоступно()
		И ОбщегоНазначенияБП.ЭтоПростойИнтерфейс()
		И ПрочитатьНастройку("Показывать", Ложь);
	Возврат Результат;
	
КонецФункции

Процедура СохранитьПричинуЗакрытия(ОписаниеПричины) Экспорт
	
	ОтправитьВМенеджерСервиса(ОписаниеПричины);
	СохранитьНастройку("Показывать", Ложь);
	
КонецПроцедуры

Процедура СохранитьНастройку(ИмяНастройки, ЗначениеНастройки) Экспорт
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		ИдентификаторНастройки(), ИмяНастройки, ЗначениеНастройки);
	
КонецПроцедуры

Функция ПрочитатьНастройку(ИмяНастройки, ЗначениеПоУмолчанию) Экспорт
	
	Результат = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		ИдентификаторНастройки(), ИмяНастройки, ЗначениеПоУмолчанию);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьВМенеджерСервиса(ОписаниеПричины)
	
	Если Не ОбщегоНазначения.РазделениеВключено() 
		Или Не ОбщегоНазначенияБП.ЭтоБизнесСтарт() Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = Пользователи.ТекущийПользователь().ИдентификаторПользователяСервиса;
	Данные = НовыйСтруктураОтвета();
	Данные.id = Новый УникальныйИдентификатор();
	Данные.user = Идентификатор;
	Данные.account = ПрограммныйИнтерфейсСервиса.АбонентЭтогоПриложения().Код;
	Данные.conf = Метаданные.ПодробнаяИнформация;
	Данные.zone = РаботаВМоделиСервиса.ЗначениеРазделителяСеанса();
	Данные.rejection = Ложь;
	Данные.type_survey = ИдентификаторНастройки(); 
	Данные.answer = ОписаниеПричины;
	
	УниверсальнаяИнтеграция.ОтправитьДанныеОбъектаПоПравилу("anketa_bp", Данные);
	
КонецПроцедуры

Функция НовыйСтруктураОтвета()
	
	Структура = Новый Структура();
	Структура.Вставить("id");
	Структура.Вставить("user");
	Структура.Вставить("account");
	Структура.Вставить("conf");
	Структура.Вставить("zone");
	Структура.Вставить("rejection");
	Структура.Вставить("type_survey");
	Структура.Вставить("answer");
	Возврат Структура;
	
КонецФункции

Функция ИдентификаторНастройки()
	Возврат "ОбучениеРаботеВБизнесСтарт";
КонецФункции

#КонецОбласти

#КонецЕсли
