&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	ВРУ	= Константы.ВалютаРегламентированногоУчета.Получить();
	Элементы.Рубли.Заголовок = Строка(ВРУ);

	Параметры.Свойство("ПараметрКоманды", ПараметрКоманды); 
	Если Не ПараметрКоманды.Пустая() Тогда
		ПланОплаты 	= истина;
		Валюта 		= Истина;
		Рубли 		= Истина;   
		
		СтрокаГруппировки = Группировки.Добавить(); 
		СтрокаГруппировки.ИмяПоля 		= "Валюта";
		СтрокаГруппировки.Представление	= "Валюта";
		СтрокаГруппировки.Сортировка 	= ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
		
		СтрокаГруппировки = Группировки.Добавить(); 
		СтрокаГруппировки.ИмяПоля 		= "Контрагент";
		СтрокаГруппировки.Представление	= "Контрагент";
		СтрокаГруппировки.Сортировка 	= ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
	КонецЕсли;
	
	// список доступных группировок
	СписокГруппировок.Очистить();
	СписокГруппировок.Добавить("Организация", "Организация", Ложь);
	СписокГруппировок.Добавить("Контрагент", "Контрагент", Ложь);
	СписокГруппировок.Добавить("Договор", "Договор", Ложь);
	СписокГруппировок.Добавить("Валюта", "Валюта", Ложь);
	СписокГруппировок.Добавить("СчетУчета", "Счет учета", Ложь);
	
	ЭтаФорма.АвтоОтображениеСостояния = РежимАвтоОтображенияСостояния.НеОтображать;
	
	// ---------------------------------------------------------------------------- 
	
	ОтборГП_СК = ПолучитьОбщийМакет("CW_СхемаЖурналаГрузоперевозокПоВыборке");
	ОтборГП_АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(ОтборГП_СК,ЭтаФорма.УникальныйИдентификатор);
	ОтборГП_ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ОтборГП_АдресСхемыКомпоновки);
	ОтборГП_КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	ОтборГП_КомпоновщикНастроек.Инициализировать(ОтборГП_ИсточникНастроек);
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	СрокОплатыДоступен = (ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы 
								Или ГруппаПользователя.РедактированиеСроковОплатыИсходящихСчетов);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НаДату = ТекущаяДата();
	
	_ИнициализацияНастроекКомпоновщикаДляОтбораГП();
	Если ПараметрКоманды.Пустая() Тогда
		_ВосстановитьСеансовуюНастройку(); 
	КонецЕсли;
	
	УстановитьСхему();
	ЗагрузитьНастройкиКомпановщика();   

	Если Не ПараметрКоманды.Пустая() Тогда
		УстановитьОтборКомпановщика();  
		СформироватьОтчет();
		ОбработатьОтчет();
	КонецЕсли;

	Элементы.ФормаНастройка.Пометка = Истина;
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры   

&НаСервере
Процедура УстановитьОтборКомпановщика()
	
	Компоновщик.Настройки.Отбор.Элементы.Очистить();
	
	ЭлементОбора = Компоновщик.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДокументВзаиморасчетов");
	ЭлементОбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОбора.ПравоеЗначение = ПараметрКоманды;
	ЭлементОбора.Использование 	= Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиКомпановщика()
	
	Компоновщик.ЗагрузитьНастройки(УстановитьНастройкиСКД());
	Компоновщик.РазвернутьАвтоПоля();

КонецПроцедуры



&НаСервере
Функция ПолучитьНастройки()
	
	Настройки = _сф.ст_Создать("НаДату,ПоПериодам,Периоды,ПланОплаты,ДатаВозвратаДокументов,ПланОплатыВыделятьПросрочку,Рубли,Валюта,Группировки,ВыводитьГрузоперевозки,ВыводитьЗаказы");
	Настройки.НаДату = НаДату;
	Настройки.ПоПериодам = ПоПериодам;
	Настройки.Периоды = Периоды.Выгрузить();
	Настройки.ПланОплаты = ПланОплаты;
	Настройки.ДатаВозвратаДокументов = ДатаВозвратаДокументов;
	Настройки.ПланОплатыВыделятьПросрочку = ПланОплатыВыделятьПросрочку;
	Настройки.Рубли = Рубли;
	Настройки.Валюта = Валюта;
	Настройки.Группировки = Группировки.Выгрузить();
	Настройки.ВыводитьГрузоперевозки = ВыводитьГрузоперевозки;
	Настройки.ВыводитьЗаказы = ВыводитьЗаказы;
	
	Возврат Настройки;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Элементы.ПланОплатыВыделятьПросрочку.Доступность = (ПланОплаты);
	Элементы.СсылкаОтборГрузоперевозок.Видимость = (ОтборПоГрузоперевозкам);
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ИнициализацияНастроекКомпоновщикаДляОтбораГП()
	// --- 
	
	ОтборГП_СК = ПолучитьИзВременногоХранилища(ОтборГП_АдресСхемыКомпоновки);
	ОтборГП_КомпоновщикНастроек.ЗагрузитьНастройки(ОтборГП_СК.НастройкиПоУмолчанию);
	// --- 
	// добавляем выбранное поле компоновки
	ОтборГП_КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	НовоеПоле = ОтборГП_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Заголовок = "Грузоперевозка";
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
	НовоеПоле.Использование = Истина;
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть = Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка    = Ложь;
	Иначе
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка    = Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка    = Истина;
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыводитьПриИзменении(Элемент)
	
	Если Элемент = Элементы.ВыводитьГрузоперевозки И ВыводитьГрузоперевозки Тогда
		ВыводитьЗаказы = Ложь;
	ИначеЕсли Элемент = Элементы.ВыводитьЗаказы И ВыводитьЗаказы Тогда
		ВыводитьГрузоперевозки = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("ПоПериодам", ПоПериодам);
			Периоды.Загрузить(СеансоваяНастройка.Периоды);
			СеансоваяНастройка.Свойство("ПланОплаты", ПланОплаты);
			СеансоваяНастройка.Свойство("ДатаВозвратаДокументов", ДатаВозвратаДокументов);
			СеансоваяНастройка.Свойство("ПланОплатыВыделятьПросрочку", ПланОплатыВыделятьПросрочку);
			СеансоваяНастройка.Свойство("Рубли", Рубли);
			СеансоваяНастройка.Свойство("Валюта", Валюта);
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			СеансоваяНастройка.Свойство("ВыводитьГрузоперевозки", ВыводитьГрузоперевозки);
			СеансоваяНастройка.Свойство("ВыводитьЗаказы", ВыводитьЗаказы);
			
			//Подсистема.СтатусыДокументов
			СеансоваяНастройка.Свойство("ВыводитьСтатусДокумента", ВыводитьСтатусДокумента);
			//Подсистема.СтатусыДокументов
			
			// Отбор
			НастройкиКД = "";
			СеансоваяНастройка.Свойство("Отбор", НастройкиКД);
			Компоновщик.Настройки.Отбор.Элементы.Очистить();
			Для Каждого СтрОтбор из НастройкиКД.Отбор.Элементы Цикл
				НовОтбор = Компоновщик.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовОтбор, СтрОтбор);
			КонецЦикла;	
			//  отбор г/п
			СеансоваяНастройка.Свойство("ОтборПоГрузоперевозкам", ОтборПоГрузоперевозкам);
			НастройкиКД_ОтборГП = "";
			СеансоваяНастройка.Свойство("ОтборПоГрузоперевозкам_Настройки", НастройкиКД_ОтборГП);
			Если (НастройкиКД_ОтборГП <> "") Тогда
				_УФС.СкопироватьОтбор(НастройкиКД_ОтборГП.Отбор,ОтборГП_КомпоновщикНастроек.Настройки.Отбор);
			КонецЕсли; 
			
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("ПоПериодам", ПоПериодам);
	СтруктураНастройки.Вставить("Периоды", Периоды.Выгрузить());
	СтруктураНастройки.Вставить("ПланОплаты", ПланОплаты);     
	СтруктураНастройки.Вставить("ДатаВозвратаДокументов", ДатаВозвратаДокументов);     
	СтруктураНастройки.Вставить("ПланОплатыВыделятьПросрочку", ПланОплатыВыделятьПросрочку);
	СтруктураНастройки.Вставить("Рубли", Рубли);
	СтруктураНастройки.Вставить("Валюта", Валюта);
	СтруктураНастройки.Вставить("Группировки", Группировки.Выгрузить());
	СтруктураНастройки.Вставить("ВыводитьГрузоперевозки", ВыводитьГрузоперевозки);
	СтруктураНастройки.Вставить("ВыводитьЗаказы", ВыводитьЗаказы);
	СтруктураНастройки.Вставить("Отбор", Компоновщик.ПолучитьНастройки());
	
	//Подсистема.СтатусыДокументов
	СтруктураНастройки.Вставить("ВыводитьСтатусДокумента", ВыводитьСтатусДокумента);
	//Подсистема.СтатусыДокументов

	// --- 
	СтруктураНастройки.Вставить("ОтборПоГрузоперевозкам", ОтборПоГрузоперевозкам);
	СтруктураНастройки.Вставить("ОтборПоГрузоперевозкам_Настройки", ОтборГП_КомпоновщикНастроек.Настройки);
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", Отчет.АдресСхемы);
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкиПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.ИмяПоля = "Валюта" Тогда
		Валюта = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("Статус");
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
	СписокПолей.Добавить("ДокументВзаиморасчетов");
	
	//Подсистема.СтатусыДокументов
	СписокПолей.Добавить("СтатусДокумента");
	//Подсистема.СтатусыДокументов

	Если Режим = "Группировка" Тогда
		//СписокПолей.Добавить("ДокументВзаиморасчетов");
		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(НаДату) Тогда
		_УФК.ВывестиПредупреждение("Не заполнена дата отчета!");
		Возврат;		
	КонецЕсли;		
	
	Если ПоПериодам И Периоды.Количество() = 0 Тогда
		_УФК.ВывестиПредупреждение("Не настроены периоды!");
		Возврат;		
	КонецЕсли;						
	
	Если НЕ Рубли И НЕ Валюта Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного показателя!");
		Возврат;		
	КонецЕсли;
	
	Если Группировки.Количество() = 0 Тогда
		_УФК.ВывестиПредупреждение("Не выбрано ни одной группировки!");
		Возврат;				
	КонецЕсли;	
	
	_Настройка(Истина);
	СформироватьОтчет();
	ОбработатьОтчет();
	#Если ТолстыйКлиент Тогда
		Результат.ПоказатьУровеньГруппировокСтрок(2);
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчет() Экспорт
	
	Результат.Очистить();
	
	Настройки = ПолучитьНастройки();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", КонецДня(Настройки.НаДату)+1);
	Запрос.Текст = СформироватьЗапрос();
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если (ОтборПоГрузоперевозкам) Тогда
		
		// анализируем документы результата
		// выбираем только доходы по г/п
		// и для каждого документа создаем соответствие с грузоперевозками
		
		СоответствиеГП = Новый Соответствие;
		// --- 
		тГП = _сф.т_Создать("ГП");
		МассивУдаляемых = Новый Массив;
		ТипДоходов = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке");
		Для каждого Стр Из Рез Цикл
			
			Если (ТипЗнч(Стр.ДокументВзаиморасчетов) <> ТипДоходов) Тогда
				
				МассивУдаляемых.Добавить(Стр);
				
			Иначе
				
				мГП=CW_Финансы.ГрузоперевозкиДокумента(Стр.ДокументВзаиморасчетов);
				_сф.м_УдалитьПустые(мГП);
				СоответствиеГП.Вставить(Стр.ДокументВзаиморасчетов,Новый Структура("мГП,Видимость",мГП,Ложь));
				// --- 
				Для каждого ГП Из мГП Цикл
					
					Нстр = тГП.Добавить();
					Нстр.ГП = ГП;
					
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(Рез, МассивУдаляемых);
		МассивУдаляемых.Очистить();
		
		// формируем набор записей по г/п
		тГП.Свернуть("ГП");
		// --- 
		Метаданное = CW_Обмены_ПИ.МетаданноеКонфигурации("Отчет.CW_ОперативнаяЗадолженностьКлиентов");
		Пользователь = CW_Настройки.Пользователь();
		// --- 
		НаборЗаписей = РегистрыСведений.CW_ВыборкиГрузоперевозок.СоздатьНаборЗаписей();
		_сф.УстановитьОтбор(НаборЗаписей.Отбор,"Пользователь",Пользователь);
		_сф.УстановитьОтбор(НаборЗаписей.Отбор,"Метаданное", Метаданное);
		Для каждого СтрГП Из тГП Цикл
			
			Запись = НаборЗаписей.Добавить();
			Запись.Пользователь = Пользователь;
			Запись.Метаданное = Метаданное;
			Запись.Грузоперевозка = СтрГП.ГП;
			
		КонецЦикла; 
		НаборЗаписей.Записать(Истина);
		
		// ---------------------------------------------------------------------------- 
		
		// выполняем запрос по записанным данным
		ОтборГП_ТаблицаРезультата = Новый ТаблицаЗначений;
		// --- 
		ОтборГП_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Пользователь",Пользователь);
		ОтборГП_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Метаданное",Метаданное);
		ОтборГП_НовыеНастройки = ОтборГП_КомпоновщикНастроек.Настройки;
		// --- 
		ОтборГП_КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		ОтборГП_ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ОтборГП_ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		// --- 
		ОтборГП_ПроцессорВывода.УстановитьОбъект(ОтборГП_ТаблицаРезультата);
		// --- 
		Попытка
			ОтборГП_СхемаКомпоновки = ПолучитьИзВременногоХранилища(ОтборГП_АдресСхемыКомпоновки);
			ОтборГП_МакетКомпоновкиДанных = ОтборГП_КомпоновщикМакета.Выполнить(ОтборГП_СхемаКомпоновки, ОтборГП_НовыеНастройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			ОтборГП_ПроцессорКомпоновки.Инициализировать(ОтборГП_МакетКомпоновкиДанных);
			ОтборГП_ПроцессорВывода.Вывести(ОтборГП_ПроцессорКомпоновки);
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат(Неопределено);
		КонецПопытки;
		
		СоответствиеНайденныхГП = Новый Соответствие;
		Для каждого Стр Из ОтборГП_ТаблицаРезультата Цикл
			
			СоответствиеНайденныхГП.Вставить(Стр.Ссылка,Истина);
			
		КонецЦикла; 
		// --- 
		Для каждого Стр Из Рез Цикл
			
			СДД = СоответствиеГП.Получить(Стр.ДокументВзаиморасчетов);
			ДокументСоответствует = Ложь;
			Для каждого ГП Из СДД.мГП Цикл
				
				СтрокаНайденного = СоответствиеНайденныхГП.Получить(ГП);
				Если (СтрокаНайденного <> Неопределено) Тогда
					ДокументСоответствует=Истина;
					СДД.Видимость = Истина;
					Прервать;
				КонецЕсли; 
				
			КонецЦикла;
			Если (НЕ ДокументСоответствует) Тогда
				
				МассивУдаляемых.Добавить(Стр);
				
			КонецЕсли; 
			
		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(Рез, МассивУдаляемых);
		МассивУдаляемых.Очистить();
		
		// --- 
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		
		// ---------------------------------------------------------------------------- 
		
	КонецЕсли; 
	
	ВНД = Новый Структура("ВНД", Рез);
	
	УстановитьСхему();
	СКД = ПолучитьИзВременногоХранилища(Отчет.АдресСхемы);
	
	НастройкиСКД = УстановитьНастройкиСКД();
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДР = Новый ДанныеРасшифровкиКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкиСКД, ДР);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВНД, ДР, Истина);
		
	Результат = Новый ТабличныйДокумент;
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Отчет.АдресРасшифровки = ПоместитьВоВременноеХранилище(ДР, ЭтаФорма.УникальныйИдентификатор);	
	
	// --- 
	_СохранитьСеансовуюНастройку();
		
КонецФункции

&НаСервере
Процедура ОбработатьОтчет() Экспорт
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "0:00:00", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "23:59:59", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Задолженность", "Задолженность", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "ВалОстаток", "Вал.", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "РубОстаток", Строка(ВРУ), ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "ВРУ", Строка(ВРУ));
	КорректироватьТаблицуРезультата(Результат, "Срок оплаты", ГоризонтальноеПоложение.Центр);
	КорректироватьТаблицуРезультата(Результат, "Дата передачи документов", ГоризонтальноеПоложение.Центр);
	КорректироватьТаблицуРезультата(Результат, "Период задолженности", ГоризонтальноеПоложение.Центр);
	КорректироватьТаблицуРезультата(Результат, "Просроченная задолженность", ГоризонтальноеПоложение.Центр);
	КорректироватьТаблицуРезультата(Результат, "Всего", ГоризонтальноеПоложение.Центр);
	КорректироватьТаблицуРезультата(Результат, "дней", ГоризонтальноеПоложение.Центр);
	Для Инд = 0 по Периоды.Количество() + 1 Цикл
		CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "ВалПериод" + Инд, "Вал.", ГоризонтальноеПоложение.Центр);
		CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "РубПериод" + Инд, Строка(ВРУ), ГоризонтальноеПоложение.Центр);		
	КонецЦикла;	
	КорректироватьТаблицуРезультата(Результат, "Плановая дата оплаты", ГоризонтальноеПоложение.Центр);
	КорректироватьТаблицуРезультата(Результат, " Х ", ГоризонтальноеПоложение.Центр);
	
	//Подсистема.СтатусыДокументов
	КорректироватьТаблицуРезультата(Результат, "Статус", ГоризонтальноеПоложение.Центр);
	//Подсистема.СтатусыДокументов

	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоВертикали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 1;
	
// ---------------------------------------------------------------------------- 

	Если ПланОплаты Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = СформироватьЗапрос();
		Запрос.УстановитьПараметр("Период", КонецДня(НаДату)+1);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Кооф = ?(Рубли И Валюта, 2, 1);
		КолПериод = ?(ПоПериодам И Периоды.Количество() > 0, Периоды.Количество() + 3, 1);
		
		ДР = ПолучитьДР();
		Сч = Результат.ФиксацияСверху + 1; 
		Об = Результат.Область(Сч, 1, Сч, 1); 
		
		ОбластьПлановаяДатаОплаты = Результат.НайтиТекст("Плановая дата оплаты");
		
		Если ОбластьПлановаяДатаОплаты <> Неопределено Тогда
			
			НомКол = ОбластьПлановаяДатаОплаты.Лево;
			Пока Об.Текст <> "ИТОГО:" Цикл
				Поле = ДР.Элементы[Об.Расшифровка].ПолучитьПоля()[0];
				Если Поле.Поле = "ДокументВзаиморасчетов" Тогда
					Н_Стр = ТЗ.Найти(Поле.Значение, "ДокументВзаиморасчетов");
					ОбХ = Результат.Область(Сч, НомКол, Сч, НомКол);
					ОбХ.Примечание.Текст = Н_Стр.ОписаниеОплаты;
				КонецЕсли;	
				Сч = Сч + 1;
				Об = Результат.Область(Сч, 1, Сч, 1);
			КонецЦикла;	
		КонецЕсли;	
		
	КонецЕсли;	
	
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры	

&НаСервере
Функция КорректироватьТаблицуРезультата(ТабДок, стрЧтоИщем, НовоеГоризонтальноеПоложение = Неопределено, МаксНомерСтрокиПоиска = Неопределено) 
	
	ПредНайденнаяОбласть = Неопределено;
	
	Если ЗначениеЗаполнено(МаксНомерСтрокиПоиска) Тогда 
		ГдеИскать = ТабДок.Область(1, , МаксНомерСтрокиПоиска,);
	Иначе 
		ГдеИскать = Неопределено;
	КонецЕсли;
	
	Пока Истина Цикл
	
		НайденнаяОбласть = ТабДок.НайтиТекст(стрЧтоИщем, ПредНайденнаяОбласть, ГдеИскать); 
		Если Неопределено = НайденнаяОбласть Тогда 
			Прервать;
		Иначе 
			ПредНайденнаяОбласть = НайденнаяОбласть;
		КонецЕсли;
			
		Если НЕ Неопределено = НовоеГоризонтальноеПоложение Тогда 
			НайденнаяОбласть.ГоризонтальноеПоложение = НовоеГоризонтальноеПоложение;
		КонецЕсли;
		
	КонецЦикла;

КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент) 
	
	//БухгалтерскиеОтчетыКлиент
	БухгалтерскиеОтчетыКлиент.НачатьРасчетСуммыВыделенныхЯчеек(
		Элементы.Результат,
		ЭтотОбъект,
		"Подключаемый_РезультатПриАктивизацииПодключаемый");
	//---БухгалтерскиеОтчетыКлиент
	
	Выд = Новый СписокЗначений;
    Для Каждого Область Из Результат.ВыделенныеОбласти Цикл
        Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
            Для ИндексСтрока = Область.Верх По Область.Низ Цикл
                Для ИндексКолонка = Область.Лево По Область.Право Цикл
					Попытка
						Выд.Добавить(Результат.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0")).Расшифровка);
                    Исключение
                    КонецПопытки;
                КонецЦикла;
            КонецЦикла;
        КонецЕсли;
	КонецЦикла;
	
	Выделенные = ПроверитьВыделенные(Выд);
	
КонецПроцедуры 

&НаКлиенте
Функция ПроверитьВыделенные(Выд)
	
	Рез = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Отчет.АдресРасшифровки) Тогда
		
		Рез = _ПроверитьВыделенные(Выд);
		
	КонецЕсли;	
	
	Возврат Рез;
	
КонецФункции	

&НаСервере
Функция _ПроверитьВыделенные(Выд)
	
	Рез = Новый СписокЗначений;
	РежимРасшифровки = "";
	
	Если ЗначениеЗаполнено(Отчет.АдресРасшифровки) Тогда
		ДР = ПолучитьДР();
		Для Каждого Стр из Выд Цикл
			Если Стр.Значение <> Неопределено Тогда
				Если ДР.Элементы[Стр.Значение].ПолучитьПоля()[0].Поле = "ПлановаяДатаОплаты" Тогда
					
					Попытка
						Род = ДР.Элементы[ДР.Элементы[Стр.Значение].ПолучитьРодителей()[0].Идентификатор].ПолучитьПоля()[0].Значение;                 
					Исключение
					КонецПопытки;	
					Если ТипЗнч(Род) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
						Рез.Добавить(Стр.Значение);	
					КонецЕсли;
					
				ИначеЕсли ДР.Элементы[Стр.Значение].ПолучитьПоля()[0].Поле = "СрокОплаты" Тогда
					
					Попытка
						Род = ДР.Элементы[ДР.Элементы[Стр.Значение].ПолучитьРодителей()[0].Идентификатор].ПолучитьПоля()[0].Значение;                 
					Исключение
					КонецПопытки;	
					Если ТипЗнч(Род) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
						Рез.Добавить(Стр.Значение);	
					КонецЕсли; 	
					
				КонецЕсли;
				
				РежимРасшифровки = ДР.Элементы[Стр.Значение].ПолучитьПоля()[0].Поле;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат Рез;
	
КонецФункции	

&НаСервере
Процедура _СформироватьДоступныеДействияОбработкиРасшифровки(ДоступныеДействия,ДопДействия)
	// --- 
	
	ДР = ПолучитьДР();
	// --- 
	
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	//ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
	
	Если Выделенные.Количество() > 0 Тогда
		Для Каждого Стр из Выделенные Цикл
			Попытка
				Стр.Значение = ДР.Элементы[ДР.Элементы[Стр.Значение].ПолучитьРодителей()[0].Идентификатор].ПолучитьПоля()[0].Значение;                 
			Исключение
				Возврат;
			КонецПопытки;	
		КонецЦикла;
		
		Если РежимРасшифровки = "ПлановаяДатаОплаты" Тогда
		
			ДопДействия.Добавить("ПлановаяДатаОплаты", "План оплаты");
		
		КонецЕсли; 
		
		Если РежимРасшифровки = "СрокОплаты" И СрокОплатыДоступен Тогда
		
			ДопДействия.Добавить("СрокОплаты" , "Срок оплаты");
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(Отчет.АдресРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет.АдресСхемы));
	// --- 
	ДоступныеДействия = Новый Массив();
	ДопДействия = Новый СписокЗначений;
	_СформироватьДоступныеДействияОбработкиРасшифровки(ДоступныеДействия, ДопДействия);
	// --- 
	ПараметрВыполненногоДействия = Неопределено; // настройки
		
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, ДопДействия, Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
			
			ПоказатьЗначение(,ПараметрВыполненногоДействия);    
			
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
			
			Компоновщик.ЗагрузитьНастройки(ПараметрВыполненногоДействия);
			Сформировать(ЭтаФорма.Команды.Найти("Сформировать"));
			
		ИначеЕсли ВыполненноеДействие = "ПлановаяДатаОплаты" Тогда
			
			Для Каждого ЭлементСписка из Выделенные Цикл
				ЭлементСписка.Представление = _ПредставлениеДокумента(ЭлементСписка.Значение); 
			КонецЦикла;
			
			СтруктураПараметров = Новый Структура("Документ", Выделенные);
			ОписаниеОповещения  = Новый ОписаниеОповещения("ОбработкаИзмененияПлановойДатыОплаты",ЭтотОбъект);  
			
			ОткрытьФорму("ОбщаяФорма.CW_ПлановыйСрокОплаты", СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		ИначеЕсли ВыполненноеДействие = "СрокОплаты" Тогда
			
			Для Каждого ЭлементСписка из Выделенные Цикл
				ЭлементСписка.Представление = _ПредставлениеДокумента(ЭлементСписка.Значение); 
			КонецЦикла;	
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Документ", 				Выделенные);
			
			Если Выделенные.Количество() = 1 Тогда
				ЭлементСписка 	  = Выделенные.Получить(0);	
				ДанныеСрокаОплаты =	CW_Документы.ПолучитьСрокОплаты(ЭлементСписка.Значение);
				
				СтруктураПараметров.Вставить("ДатаОплаты", 				ДанныеСрокаОплаты.ДатаОплаты);
				СтруктураПараметров.Вставить("Описание", 				ДанныеСрокаОплаты.Описание);
				СтруктураПараметров.Вставить("РучноеРедактирование", 	ДанныеСрокаОплаты.РучноеРедактирование);
				
			КонецЕсли;
			
			ОписаниеОповещения  = Новый ОписаниеОповещения("ОбработкаИзмененияСрокаОплаты",ЭтотОбъект, Выделенные); 
			
			ОткрытьФорму("ОбщаяФорма.CW_СрокОплаты", СтруктураПараметров,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 	
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПлановойДатыОплаты(РезультатОбработки, ДополнительныеПараметры) Экспорт 

	Если РезультатОбработки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Сформировать(ЭтаФорма.Команды.Найти("Сформировать"));
	
КонецПроцедуры
  
&НаКлиенте
Процедура ОбработкаИзмененияСрокаОплаты(РезультатОбработки, ДополнительныеПараметры) Экспорт 
	
	Если РезультатОбработки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьИзменениеСрокаОплатыНаСервере(РезультатОбработки, ДополнительныеПараметры);
	
	Сформировать(ЭтаФорма.Команды.Найти("Сформировать"));
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьИзменениеСрокаОплатыНаСервере(ДанныеСрокаОплаты, СписокДокументов)
	
	Для Каждого ЭлементСписка из СписокДокументов Цикл
		
		СтруктураПараметров  = Новый Структура;
		СтруктураПараметров.Вставить("Счет", ЭлементСписка.Значение);  
		
		СтруктураПараметров.Вставить("ДатаОплаты", 				ДанныеСрокаОплаты.ДатаОплаты);
		СтруктураПараметров.Вставить("Описание", 				ДанныеСрокаОплаты.Описание);
		СтруктураПараметров.Вставить("РучноеРедактирование", 	ДанныеСрокаОплаты.РучноеРедактирование);
		
		РегистрыСведений.CW_СрокиОплатыСчетов.ЗаписатьСрокОплатыДокумента(СтруктураПараметров);
		
	КонецЦикла;
	
КонецПроцедуры
  
&НаКлиенте
Процедура ОбработкаСобытияРасшифровки(РезПО, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если _УФКС.ВыполненоУспешно(РезПО) Тогда
		Сформировать(ЭтаФорма.Команды.Найти("Сформировать"));
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПредставлениеДокумента(Стр)
	// --- 
	
	Возврат("Счёт №" + СокрЛП(Стр.НомерСчета) + " от " + Формат(Стр.ДатаСчета, "ДФ=dd.MM.yyyy") + " (" + Строка(Стр.Контрагент) + "); ");
	
	// --- 
КонецФункции

&НаСервере
Функция ПолучитьДР()
	
    Возврат ПолучитьИзВременногоХранилища(Отчет.АдресРасшифровки);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("ПоПериодам", ПоПериодам);
//	Настройки.ДополнительныеСвойства.Вставить("Периоды", Периоды.Выгрузить());
	Настройки.ДополнительныеСвойства.Вставить("Периоды", Периоды);
	Настройки.ДополнительныеСвойства.Вставить("ПланОплаты", ПланОплаты);  
	Настройки.ДополнительныеСвойства.Вставить("ДатаВозвратаДокументов", ДатаВозвратаДокументов);  
	Настройки.ДополнительныеСвойства.Вставить("ПланОплатыВыделятьПросрочку", ПланОплатыВыделятьПросрочку);
	Настройки.ДополнительныеСвойства.Вставить("Рубли", Рубли);
	Настройки.ДополнительныеСвойства.Вставить("Валюта", Валюта);
//	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки.Выгрузить());
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); // ДанныеФормыКоллекция
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьГрузоперевозки", ВыводитьГрузоперевозки);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаказы", ВыводитьЗаказы);
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Компоновщик.Настройки);
	Настройки.ДополнительныеСвойства.Вставить("ИмяКомпоновщика", "Компоновщик");
	
	Настройки.ДополнительныеСвойства.Вставить("ОтборПоГрузоперевозкам", ОтборПоГрузоперевозкам);
	Настройки.ДополнительныеСвойства.Вставить("ИсточникКопирования", 		ОтборГП_КомпоновщикНастроек.Настройки);
	Настройки.ДополнительныеСвойства.Вставить("ИмяКомпоновщикаКопирования", "ОтборГП_КомпоновщикНастроек");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	Настройки.ДополнительныеСвойства.Очистить();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура НастроитьПериоды(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериодов",ЭтотОбъект); 
	Струк = Новый Структура("Периоды", Периоды);
	ОткрытьФорму("Отчет.CW_ОперативнаяЗадолженностьПередПоставщиками.Форма.ФормаНастроекПериодов", Струк,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериодов(Рез, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Рез <> Неопределено Тогда
		_ЗагрузитьПериоды(Рез);
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

&НаСервере
Процедура _ЗагрузитьПериоды(Рез)
	
	Периоды.Загрузить(Рез.Выгрузить());
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаСервере
Функция СформироватьЗапрос()
	
	Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Организация КАК Организация,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Контрагент КАК Контрагент,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Договор КАК Договор,
		//Подсистема.УчетПриложенийДоговоров
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.ПриложениеКДоговору КАК ПриложениеКДоговору,
		//Подсистема.УчетПриложенийДоговоров
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Валюта КАК Валюта,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.СчетУчета КАК СчетУчета,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет КАК ДокументВзаиморасчетов,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК ВалОстаток,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.ВсегоОстаток КАК РубОстаток,
		|	ЕСТЬNULL(CW_СрокиОплатыСчетов.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокОплаты,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(CW_СрокиОплатыСчетов.ДатаОплаты, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РАЗНОСТЬДАТ(CW_СрокиОплатыСчетов.ДатаОплаты, &Период, ДЕНЬ) > 0
		|					ТОГДА РАЗНОСТЬДАТ(CW_СрокиОплатыСчетов.ДатаОплаты, &Период, ДЕНЬ)
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК ПериодЗадолженности,
		|	CW_ПланОплатыИсходящихСчетов.ПлановаяДата КАК ПлановаяДатаОплаты,
		|	CW_ПланОплатыИсходящихСчетов.Описание КАК ОписаниеОплаты,
		|	CW_ПланОплатыИсходящихСчетов.ПлановаяДата КАК ПланируемаяДатаОплаты,
		|	CW_МенеджерыПродажКлиентовСрезПоследних.МенеджерПродаж КАК МенеджерПродаж,
		|	CW_ПризнакНаличияОригиналовДокументов.ДатаПолучения КАК ДатаВозвратаДокументов,
		//Подсистема.СтатусыДокументов
		|	ЕСТЬNULL(CW_СтатусыДокументов.СтатусДокумента, НЕОПРЕДЕЛЕНО) КАК СтатусДокумента
		//Подсистема.СтатусыДокументов
		|ИЗ
		|	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность.Остатки(&Период, ) КАК CW_ОперативнаяДебиторскаяЗадолженностьОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПланОплатыИсходящихСчетов КАК CW_ПланОплатыИсходящихСчетов
		|		ПО CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет = CW_ПланОплатыИсходящихСчетов.Счет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СрокиОплатыСчетов КАК CW_СрокиОплатыСчетов
		|		ПО CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет = CW_СрокиОплатыСчетов.Счет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_МенеджерыПродажКлиентов.СрезПоследних(&Период, ) КАК CW_МенеджерыПродажКлиентовСрезПоследних
		|		ПО CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Контрагент = CW_МенеджерыПродажКлиентовСрезПоследних.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПризнакНаличияОригиналовДокументов КАК CW_ПризнакНаличияОригиналовДокументов
		|		ПО CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет = CW_ПризнакНаличияОригиналовДокументов.ДокументСсылка
		//Подсистема.СтатусыДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СтатусыДокументов.СрезПоследних КАК CW_СтатусыДокументов
		|		ПО CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет = CW_СтатусыДокументов.Документ";
		//Подсистема.СтатусыДокументов
	
	Возврат Текст;	

КонецФункции	

&НаСервере
Процедура УстановитьСхему() 
	
	Настройки = ПолучитьНастройки();
	СКД = Новый СхемаКомпоновкиДанных;
	
    ИД = СКД.ИсточникиДанных.Добавить();
    ИД.Имя = "ИсточникДанных";
    ИД.ТипИсточникаДанных = "Local";
	
    НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
    НаборДанных.Имя = "ВНД";
	НаборДанных.ИмяОбъекта = "ВНД";
    НаборДанных.ИсточникДанных = "ИсточникДанных";
	
//-----------------------------------------------------------------------------------------------------------//	

	//Группировки
	НаборДанных.Поля.Очистить();
	
    НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Организация";
	НД_Поле.ПутьКДанным = "Организация";
	НД_Поле.Заголовок = "Организация";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	НД_Поле.Роль.Измерение = Истина;
	// --- 
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле 			= "МенеджерПродаж";
	НД_Поле.ПутьКДанным 	= "МенеджерПродаж";
	НД_Поле.Заголовок 		= "Менеджер продаж";
	НД_Поле.Роль.Измерение 	= Истина;
	НД_Поле.ТипЗначения 	= Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	// --- 
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Контрагент";
	НД_Поле.ПутьКДанным = "Контрагент";
	НД_Поле.Заголовок = "Контрагент";
	НД_Поле.Роль.Измерение = Истина;
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	// --- 
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Договор";
	НД_Поле.ПутьКДанным = "Договор";
	НД_Поле.Заголовок = "Договор";
	НД_Поле.Роль.Измерение = Истина;
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам");	
	
	//Подсистема.УчетПриложенийДоговоров
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ПриложениеКДоговору";
	НД_Поле.ПутьКДанным = "ПриложениеКДоговору";
	НД_Поле.Заголовок = "Приложение";
	НД_Поле.Роль.Измерение = Истина;
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ПриложенияКДоговорам");
	//Подсистема.УчетПриложенийДоговоров
	// --- 
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Валюта";
	НД_Поле.ПутьКДанным = "Валюта";
	НД_Поле.Заголовок = "Валюта";
	НД_Поле.Роль.Измерение = Истина;
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Валюты");
	// --- 
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "СчетУчета";
	НД_Поле.ПутьКДанным = "СчетУчета";
	НД_Поле.Заголовок = "Счет учета";
	НД_Поле.Роль.Измерение = Истина;
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный");	
	// --- 
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ДокументВзаиморасчетов";
	НД_Поле.ПутьКДанным = "ДокументВзаиморасчетов";
	НД_Поле.Заголовок = "Документ взаиморасчетов";
	НД_Поле.Роль.Измерение = Истина;
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("ДокументСсылка.CW_ДоходыПоГрузоперевозке");
	НД_Поле.ВыражениеПредставления = "CW_Отчеты.ПредставлениеДокументовВзаиморасчетовДляОперативныхОтчетов(ДокументВзаиморасчетов,&ВыводитьГрузоперевозки,&ВыводитьЗаказы)";		
	
	//Подсистема.СтатусыДокументов
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "СтатусДокумента";
	НД_Поле.ПутьКДанным = "СтатусДокумента";
	НД_Поле.Заголовок = "Статус";
	НД_Поле.Роль.Измерение = Истина;
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_СтатусыДокументов");
	//Подсистема.СтатусыДокументов

	// --- 
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ПланируемаяДатаОплаты";
    НД_Поле.ПутьКДанным = "ПланируемаяДатаОплаты";
	НД_Поле.Заголовок = "Планируемая дата оплаты";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Дата");
	
	// Реквизиты
    НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ВалОстаток";
    НД_Поле.ПутьКДанным = "ВалОстаток";
	НД_Поле.Заголовок = "Задолженность, Вал.";
	НД_Поле.Роль.Остаток=Истина;
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Число");
	НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
	НД_Поле.ОграничениеИспользования.Группировка = Истина;
	//НД_Поле.ОграничениеИспользования.Условие = Истина;
	
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "РубОстаток";
    НД_Поле.ПутьКДанным = "РубОстаток";
	НД_Поле.Заголовок = "Задолженность, ВРУ."; 
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Число");
	НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
	НД_Поле.ОграничениеИспользования.Группировка = Истина;
	//НД_Поле.ОграничениеИспользования.Условие = Истина;
	
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "СрокОплаты";
    НД_Поле.ПутьКДанным = "СрокОплаты";
	НД_Поле.Заголовок = "Срок оплаты";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Дата");
	НД_Поле.ОграничениеИспользования.Группировка = Истина;
	
    НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ПериодЗадолженности";
    НД_Поле.ПутьКДанным = "ПериодЗадолженности";
	НД_Поле.Заголовок = "Период задолженности";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("Число");
	НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=0; ЧН=-; ЧГ=0");	
	НД_Поле.ОграничениеИспользования.Группировка = Истина;
	
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле 			= "ПлановаяДатаОплаты";
    НД_Поле.ПутьКДанным 	= "ПлановаяДатаОплаты";
	НД_Поле.Заголовок 		= "Плановая дата оплаты";
	НД_Поле.ОграничениеИспользования.Группировка 	= Истина;	
	НД_Поле.ОграничениеИспользования.Условие 		= Истина;	
	
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле 			= "ДатаВозвратаДокументов";
    НД_Поле.ПутьКДанным 	= "ДатаВозвратаДокументов";
	НД_Поле.Заголовок 		= "Дата возврата (передачи) документов";
	НД_Поле.ОграничениеИспользования.Группировка 	= Истина;	
	НД_Поле.ОграничениеИспользования.Условие 		= Истина;		
//-----------------------------------------------------------------------------------------------------------//	

	// Вычисляемые поля (Периоды)
	СКД.ВычисляемыеПоля.Очистить();
	Если ПоПериодам И Периоды.Количество() > 0 Тогда
		
		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "ВалПериод0";
		Выч_Поле.Заголовок = "ВалПериод0";
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>0 Тогда Выбор Когда ВалОстаток > 0 Тогда ВалОстаток Иначе 0 Конец Иначе 0 Конец";
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;
		
		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "РубПериод0";
		Выч_Поле.Заголовок = "РубПериод0";
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>0 Тогда Выбор Когда РубОстаток > 0 Тогда РубОстаток Иначе 0 Конец Иначе 0 Конец";
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;
		
		Ном = 1;
		Для Каждого Интервал из Периоды Цикл
			
			Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
			Выч_Поле.ПутьКДанным = "ВалПериод" + Ном;
			Выч_Поле.Заголовок = "ВалПериод" + Ном;
			Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>=" + Интервал.НачДень + " И ПериодЗадолженности<=" + Интервал.КонДень + " Тогда Выбор Когда ВалОстаток > 0 Тогда ВалОстаток Иначе 0 Конец Иначе 0 Конец";
			Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
			Выч_Поле.ОграничениеИспользования.Группировка = Истина;
			Выч_Поле.ОграничениеИспользования.Условие = Истина;
			
			Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
			Выч_Поле.ПутьКДанным = "РубПериод" + Ном;
			Выч_Поле.Заголовок = "РубПериод" + Ном;
			Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>=" + Интервал.НачДень + " И ПериодЗадолженности<=" + Интервал.КонДень + " Тогда Выбор Когда РубОстаток > 0 Тогда РубОстаток Иначе 0 Конец Иначе 0 Конец";
			Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
			Выч_Поле.ОграничениеИспользования.Группировка = Истина;
			Выч_Поле.ОграничениеИспользования.Условие = Истина;			
			
			Ном = Ном + 1;
			
		КонецЦикла;	
		
		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "ВалПериод" + Ном;
		Выч_Поле.Заголовок = "ВалПериод" + Ном;
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>" + Интервал.КонДень + " Тогда Выбор Когда ВалОстаток > 0 Тогда ВалОстаток Иначе 0 Конец Иначе 0 Конец";
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;
		
		Выч_Поле = СКД.ВычисляемыеПоля.Добавить();
		Выч_Поле.ПутьКДанным = "РубПериод" + Ном;
		Выч_Поле.Заголовок = "РубПериод" + Ном;
		Выч_Поле.Выражение = "Выбор Когда ПериодЗадолженности>" + Интервал.КонДень + " Тогда Выбор Когда РубОстаток > 0 Тогда РубОстаток Иначе 0 Конец Иначе 0 Конец";
		Выч_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2");
		Выч_Поле.ОграничениеИспользования.Группировка = Истина;
		Выч_Поле.ОграничениеИспользования.Условие = Истина;	
		
	КонецЕсли;
		
//-----------------------------------------------------------------------------------------------------------//	

	//Ресурсы
	СКД.ПоляИтога.Очистить();
	
	//Поле_Ресурса = СКД.ПоляИтога.Добавить();
	//Поле_Ресурса.ПутьКДанным = "ВалОстаток";
	//Поле_Ресурса.Выражение = "ВалОстаток";
	//Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");
	
    Поле_Ресурса = СКД.ПоляИтога.Добавить();
    Поле_Ресурса.ПутьКДанным = "ВалОстаток";
	Поле_Ресурса.Выражение = "Сумма(ВалОстаток)";
	Поле_Ресурса.Группировки.Добавить("Валюта");
	
    Поле_Ресурса = СКД.ПоляИтога.Добавить();
    Поле_Ресурса.ПутьКДанным = "РубОстаток";
	Поле_Ресурса.Выражение = "Сумма(РубОстаток)";
	
	Поле_Ресурса = СКД.ПоляИтога.Добавить();
    Поле_Ресурса.ПутьКДанным = "СрокОплаты";
	Поле_Ресурса.Выражение = "СрокОплаты";
	Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");
	
    Поле_Ресурса = СКД.ПоляИтога.Добавить();
    Поле_Ресурса.ПутьКДанным = "ПериодЗадолженности";
	Поле_Ресурса.Выражение = "МАКСИМУМ(ПериодЗадолженности)";
	
	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ВалОстаток";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");
	
    Поле_Ресурса = СКД.ПоляИтога.Добавить();
    Поле_Ресурса.ПутьКДанным = "СрокОплаты";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");
	
    Поле_Ресурса = СКД.ПоляИтога.Добавить();
    Поле_Ресурса.ПутьКДанным = "ПериодЗадолженности";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");
	
	Если ПоПериодам И Периоды.Количество() > 0 Тогда
		//Поле_Ресурса = СКД.ПоляИтога.Добавить();
		//Поле_Ресурса.ПутьКДанным = "ВалПериод0";
		//Поле_Ресурса.Выражение = "ВалПериод0";
		//Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");
		
		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод0";
		Поле_Ресурса.Выражение = "Сумма(ВалПериод0)";
		Поле_Ресурса.Группировки.Добавить("Валюта");
		
		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод0";
		Поле_Ресурса.Выражение = """ Х """;
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");
		
		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод0";
		Поле_Ресурса.Выражение = "Сумма(РубПериод0)";
		
		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод0";
		Поле_Ресурса.Выражение = "Сумма(РубПериод0)";
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");
		
		Ном = 1;
		Для Каждого Интервал из Периоды Цикл
			//Поле_Ресурса = СКД.ПоляИтога.Добавить();
			//Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
			//Поле_Ресурса.Выражение = "ВалПериод" + Ном;
			//Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");
			
			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
			Поле_Ресурса.Выражение = "Сумма(ВалПериод" + Ном + ")";
			Поле_Ресурса.Группировки.Добавить("Валюта");
			
			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
			Поле_Ресурса.Выражение = """ Х """;
			Поле_Ресурса.Группировки.Добавить("ОбщийИтог");
			
			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
			//Поле_Ресурса.Выражение = "РубПериод" + Ном;
			Поле_Ресурса.Выражение =  "Сумма(РубПериод" + Ном + ")";
			
			Поле_Ресурса = СКД.ПоляИтога.Добавить();
			Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
			Поле_Ресурса.Выражение = "Сумма(РубПериод" + Ном + ")";
			Поле_Ресурса.Группировки.Добавить("ОбщийИтог");
			
			Ном = Ном + 1;
		КонецЦикла;
		
		//Поле_Ресурса = СКД.ПоляИтога.Добавить();
		//Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
		//Поле_Ресурса.Выражение = "ВалПериод" + Ном;
		//Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");
			
		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
		Поле_Ресурса.Выражение = "Сумма(ВалПериод" + Ном + ")";
		Поле_Ресурса.Группировки.Добавить("Валюта");
		
		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "ВалПериод" + Ном;
		Поле_Ресурса.Выражение = """ Х """ + Ном;
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");
		
		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
		Поле_Ресурса.Выражение = "Сумма(РубПериод" + Ном + ")";
		
		Поле_Ресурса = СКД.ПоляИтога.Добавить();
		Поле_Ресурса.ПутьКДанным = "РубПериод" + Ном;
		Поле_Ресурса.Выражение = "Сумма(РубПериод" + Ном + ")";
		Поле_Ресурса.Группировки.Добавить("ОбщийИтог");
		
	КонецЕсли;
	
	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ПлановаяДатаОплаты";
	Поле_Ресурса.Выражение = "ПлановаяДатаОплаты";
	Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");	
	
	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "ПлановаяДатаОплаты";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");	
	
	Поле_Ресурса = СКД.ПоляИтога.Добавить();
    Поле_Ресурса.ПутьКДанным = "ДатаВозвратаДокументов";
	Поле_Ресурса.Выражение = "ДатаВозвратаДокументов";
	Поле_Ресурса.Группировки.Добавить("ДокументВзаиморасчетов");
	
	Поле_Ресурса = СКД.ПоляИтога.Добавить();
    Поле_Ресурса.ПутьКДанным = "ДатаВозвратаДокументов";
	Поле_Ресурса.Выражение = """ Х """;
	Поле_Ресурса.Группировки.Добавить("ОбщийИтог");

	
//-----------------------------------------------------------------------------------------------------------//

	//Параметры
	СКД.Параметры.Очистить();
	
	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "Период";
	Пар.Заголовок = "На дату";
	Пар.ТипЗначения = Новый ОписаниеТипов("Дата");
	Пар.ВключатьВДоступныеПоля = Ложь;
	Пар.Значение = Ложь;

	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "ВыводитьГрузоперевозки";
	Пар.Заголовок = "Выводить грузоперевозки";
	Пар.ТипЗначения = Новый ОписаниеТипов("Булево");
	Пар.ВключатьВДоступныеПоля = Ложь;
	
	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "ВыводитьЗаказы";
	Пар.Заголовок = "Выводить заказы";
	Пар.ТипЗначения = Новый ОписаниеТипов("Булево");
	Пар.ВключатьВДоступныеПоля = Ложь;
	
	Пар = СКД.Параметры.Добавить();
	Пар.Имя = "ОтборГрузоперевозок";
	Пар.Заголовок = "Отбор грузоперевозок";
	Пар.ТипЗначения = Новый ОписаниеТипов("Строка");
	Пар.ВключатьВДоступныеПоля = Ложь;
	
	Отчет.АдресСхемы = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);	
	
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет.АдресСхемы));	
		
КонецПроцедуры	

&НаСервере
Функция УстановитьНастройкиСКД()
	
	СКД = ПолучитьИзВременногоХранилища(Отчет.АдресСхемы);
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	НастройкиСКД = Компоновщик.Настройки;
	Настройки = ПолучитьНастройки();
	
//-----------------------------------------------------------------------------------------------------------//

	НастройкиСКД.Порядок.Элементы.Очистить();
	 	
	// формируем структуру отчета по группировкам
	НастройкиСКД.Структура.Очистить();
	ТекущийРодитель = НастройкиСКД.Структура;
	
	Если ОбъединитьГруппировки Тогда   
		//Добавляем пустую группировку
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		
		Если (ДополнительнаяСортировка <> 0) Тогда
			
			ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Убыв;
			Если ПорядокСортировки = 1 тогда
				ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Возр;
			КонецЕсли;
	
			ВП = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ВП.Использование 	 = Истина;
			ВП.ТипУпорядочивания = ТипУпорядочивания;

			Если (ДополнительнаяСортировка = 1) Тогда
				ВП.Поле = Новый ПолеКомпоновкиДанных("РубОстаток");
			ИначеЕсли (ДополнительнаяСортировка = 2) Тогда
				ВП.Поле = Новый ПолеКомпоновкиДанных("ПериодЗадолженности");
			Иначе
				ВП.Поле = Новый ПолеКомпоновкиДанных("СрокОплаты");
			КонецЕсли; 
			
		КонецЕсли;

		
	КонецЕсли;

	
	Для Каждого Групп Из Настройки.Группировки Цикл
		Если Не ОбъединитьГруппировки Тогда
			НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Групп.ИмяПоля);
			ПолеГруппировки.Использование = Истина;
			// --- 
			НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			НовоеАвтоПолеВыбора.Использование = Истина;
			// --- 
			Если (ДополнительнаяСортировка <> 0) Тогда
				
				ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Убыв;
				Если ПорядокСортировки = 1 тогда
					ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Возр;
				КонецЕсли;
				
				ВП = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
				ВП.Использование 	 = Истина;
				ВП.ТипУпорядочивания = ТипУпорядочивания;
				
				Если (ДополнительнаяСортировка = 1) Тогда
					ВП.Поле = Новый ПолеКомпоновкиДанных("РубОстаток");
				ИначеЕсли (ДополнительнаяСортировка = 2) Тогда
					ВП.Поле = Новый ПолеКомпоновкиДанных("ПериодЗадолженности");
				Иначе
					ВП.Поле = Новый ПолеКомпоновкиДанных("СрокОплаты");
				КонецЕсли; 
				
			КонецЕсли;
			// --- 
			ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Групп.ИмяПоля);
			НС = ?(Групп.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию,НаправлениеСортировкиКомпоновкиДанных.Возр,НаправлениеСортировкиКомпоновкиДанных.Убыв);
			ЭлементПорядка.ТипУпорядочивания = НС;
			ЭлементПорядка.Использование = Истина;
			// --- 
			НоваяГруппировка.Имя = Групп.Представление;
			НоваяГруппировка.Использование = Истина;
			// --- 
			ТекущийРодитель = НоваяГруппировка.Структура;
		Иначе
			
			//Заполняем группировку полями группирвоки
			ПолеГруппировки 				= НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Поле 			= Новый ПолеКомпоновкиДанных(Групп.ИмяПоля);
			ПолеГруппировки.Использование 	= Истина;
			
			НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			НовоеАвтоПолеВыбора.Использование	= Истина;
			
			ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Групп.ИмяПоля);
			
			НС = ?(Групп.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию, НаправлениеСортировкиКомпоновкиДанных.Возр, НаправлениеСортировкиКомпоновкиДанных.Убыв);
			
			ЭлементПорядка.ТипУпорядочивания = НС;
			ЭлементПорядка.Использование = Истина;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	// Предопределенная группировка "ДокументВзаиморасчетов"
	Если Не ОбъединитьГруппировки Тогда
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		НоваяГруппировка.Использование = Истина;
		
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Использование 		= Истина;
		ПолеГруппировки.Поле 				= Новый ПолеКомпоновкиДанных("ДокументВзаиморасчетов");
		
		НовоеАвтоПолеВыбора 				= НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование 	= Истина;
		
		//Подсистема.СтатусыДокументов
		Если ВыводитьСтатусДокумента Тогда
			ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Использование = Истина;
			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("СтатусДокумента");
			
			НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			НовоеАвтоПолеВыбора.Использование = Истина;
		КонецЕсли;
		//Подсистема.СтатусыДокументов
		// --- 
		Если (ДополнительнаяСортировка <> 0) Тогда
			
			ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Убыв;
			Если ПорядокСортировки = 1 тогда
				ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Возр;
			КонецЕсли;
			
			ВП = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ВП.Использование 		= Истина;
			ВП.ТипУпорядочивания	= ТипУпорядочивания;
			Если (ДополнительнаяСортировка = 1) Тогда
				ВП.Поле = Новый ПолеКомпоновкиДанных("РубОстаток");
			ИначеЕсли (ДополнительнаяСортировка = 2) Тогда
				ВП.Поле = Новый ПолеКомпоновкиДанных("ПериодЗадолженности");
			Иначе
				ВП.Поле = Новый ПолеКомпоновкиДанных("СрокОплаты");
			КонецЕсли; 
			
		КонецЕсли;
		// --- 
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ДокументВзаиморасчетов");
		ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		ЭлементПорядка.Использование = Истина;
		НоваяГруппировка.Имя = "Документ взаиморасчетов";
		НоваяГруппировка.Использование = Истина;
		
	Иначе
		//Заполняем группировку полями группирвоки
		ПолеГруппировки 				= НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле 			= Новый ПолеКомпоновкиДанных("ДокументВзаиморасчетов");
		ПолеГруппировки.Использование 	= Истина;
		
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование	= Истина;
		
		//Подсистема.СтатусыДокументов
		Если ВыводитьСтатусДокумента Тогда
			ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Использование = Истина;
			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("СтатусДокумента");
			
			НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			НовоеАвтоПолеВыбора.Использование = Истина;
		КонецЕсли;
		//Подсистема.СтатусыДокументов

		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ДокументВзаиморасчетов");
		
	КонецЕсли;

		
//-----------------------------------------------------------------------------------------------------------//

	НастройкиСКД.Выбор.Элементы.Очистить();
	
	ГруппаВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаВП.Использование = Истина;
	ГруппаВП.Заголовок = "Задолженность";	
	ВП = ГруппаВП.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВП.Использование = Валюта;
	ВП.Заголовок = "ВалОстаток";
	ВП.Поле = Новый ПолеКомпоновкиДанных("ВалОстаток");
	ВП = ГруппаВП.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВП.Использование = Рубли;
	ВП.Заголовок = "РубОстаток";
	ВП.Поле = Новый ПолеКомпоновкиДанных("РубОстаток");

	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВП.Использование = Истина;
	ВП.Заголовок = "Срок оплаты";
	ВП.Поле = Новый ПолеКомпоновкиДанных("СрокОплаты");
	
	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВП.Использование = Истина;
	ВП.Заголовок = "Период задолженности";
	ВП.Поле = Новый ПолеКомпоновкиДанных("ПериодЗадолженности");
	
	//ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//ВП.Использование = Истина;
	//ВП.Заголовок = "Счет учёта";
	//ВП.Поле = Новый ПолеКомпоновкиДанных("СчетУчета");
	
	Если ПоПериодам И Периоды.Количество() > 0 Тогда
		ГруппаВП0 = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		ГруппаВП0.Использование = Истина;
		ГруппаВП0.Заголовок = "Просроченная задолженность";
		
		ГруппаВсего = ГруппаВП0.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		ГруппаВсего.Использование = Истина;
		ГруппаВсего.Заголовок = "Всего";
		
		ВП = ГруппаВсего.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВП.Использование = Валюта;
		ВП.Заголовок = "ВалПериод0";
		ВП.Поле = Новый ПолеКомпоновкиДанных("ВалПериод0");
		
		ВП = ГруппаВсего.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВП.Использование = Рубли;
		ВП.Заголовок = "РубПериод0";
		ВП.Поле = Новый ПолеКомпоновкиДанных("РубПериод0");
		
		Ном = 1;
		Для Каждого Интервал из Периоды Цикл
			ГруппаПериода = ГруппаВП0.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
			ГруппаПериода.Использование = Истина;
			ГруппаПериода.Заголовок = Интервал.Представление;
			
			ВП = ГруппаПериода.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВП.Использование = Валюта;
			ВП.Заголовок = "ВалПериод" + Ном;
			ВП.Поле = Новый ПолеКомпоновкиДанных("ВалПериод" + Ном);
			
			ВП = ГруппаПериода.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВП.Использование = Рубли;
			ВП.Заголовок = "РубПериод" + Ном;
			ВП.Поле = Новый ПолеКомпоновкиДанных("РубПериод" + Ном);
			
			Ном = Ном + 1;	
		КонецЦикла;	
		ГруппаПериода = ГруппаВП0.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		ГруппаПериода.Использование = Истина;
		ГруппаПериода.Заголовок = "Свыше " + Интервал.КонДень + " дней";
		
		ВП = ГруппаПериода.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВП.Использование = Валюта;
		ВП.Заголовок = "ВалПериод" + Ном;
		ВП.Поле = Новый ПолеКомпоновкиДанных("ВалПериод" + Ном);
		
		ВП = ГруппаПериода.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВП.Использование = Рубли;
		ВП.Заголовок = "РубПериод" + Ном;
		ВП.Поле = Новый ПолеКомпоновкиДанных("РубПериод" + Ном);
	КонецЕсли;
	
	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВП.Использование 	= ПланОплаты;
	ВП.Заголовок 		= "Плановая дата оплаты";
	ВП.Поле 			= Новый ПолеКомпоновкиДанных("ПлановаяДатаОплаты");
	
	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВП.Использование 	= ДатаВозвратаДокументов;
	ВП.Заголовок 		= "Дата передачи документов";
	ВП.Поле 			= Новый ПолеКомпоновкиДанных("ДатаВозвратаДокументов");  
	//-----------------------------------------------------------------------------------------------------------//
	
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Период", КонецДня(Настройки.НаДату));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьГрузоперевозки", Настройки.ВыводитьГрузоперевозки);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьЗаказы", Настройки.ВыводитьЗаказы);	
	Если (ОтборПоГрузоперевозкам) Тогда
		ОтборПоГрузоперевозкамПредставление = Строка(ОтборГП_КомпоновщикНастроек.Настройки.Отбор);
	Иначе
		ОтборПоГрузоперевозкамПредставление = "<не установлен>";
	КонецЕсли; 
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ОтборГрузоперевозок", ОтборПоГрузоперевозкамПредставление);	
	
//-----------------------------------------------------------------------------------------------------------//

	НастройкиСКД.УсловноеОформление.Элементы.Очистить();
	// --- 
	ЭлУО = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
	ЭлУО.Использование = Истина;
	ЭлПоле = ЭлУО.Поля.Элементы.Добавить();
	ЭлПоле.Использование = Истина;
	ЭлПоле.Поле 		 = Новый ПолеКомпоновкиДанных("СрокОплаты");
	ЭлПоле 	= ЭлУО.Поля.Элементы.Добавить();
	ЭлПоле.Использование = Истина;
	ЭлПоле.Поле = Новый ПолеКомпоновкиДанных("ПлановаяДатаОплаты");
	ЭлУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
	ЭлУО.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=Д");
	
	// --- 
	ЭлУО = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
	ЭлУО.Использование = Истина;
	ЭлПоле = ЭлУО.Поля.Элементы.Добавить();
	ЭлПоле.Использование = Истина;
	ЭлПоле.Поле = Новый ПолеКомпоновкиДанных("ДатаВозвратаДокументов");
	ЭлПоле = ЭлУО.Поля.Элементы.Добавить();
	ЭлПоле.Использование = Истина;
	ЭлПоле.Поле = Новый ПолеКомпоновкиДанных("ДатаВозвратаДокументов");
	ЭлУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
	ЭлУО.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=Д");
	
	Если ПланОплаты  И ПланОплатыВыделятьПросрочку Тогда
		
		УО = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
		УО.Использование = Истина;
		// --- 
		УО_Поле = УО.Поля.Элементы.Добавить();
		УО_Поле.Использование=Истина;
		УО_Поле.Поле = Новый ПолеКомпоновкиДанных("ПлановаяДатаОплаты");
		// --- 
		УО_Условие = УО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УО_Условие.Использование = Истина;
		УО_Условие.ЛевоеЗначение = УО_Поле.Поле;
		УО_Условие.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		УО_Условие.ПравоеЗначение = НаДату;
		// --- 
		УО.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.СветлоРозовый);
		//УО.Оформление.УстановитьЗначениеПараметра("СтильГраницы",Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2,Ложь));
		//УО.Оформление.УстановитьЗначениеПараметра("СтильГраницы.Сверху",Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2,Ложь));
		
	КонецЕсли; 
	
	// --- 
	ЭлУО = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
	ЭлУО.Использование = Истина;
	ЭлПоле = ЭлУО.Поля.Элементы.Добавить();
	ЭлПоле.Использование = Истина;
	ЭлПоле.Поле = Новый ПолеКомпоновкиДанных("ПериодЗадолженности");
	ЭлУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
	
//-----------------------------------------------------------------------------------------------------------//
	
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("МакетОформления"	, "CW_ОсновнойМакетСКД");
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок"		, "ОПЕРАТИВНАЯ ЗАДОЛЖЕННОСТЬ ПОКУПАТЕЛЕЙ");
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьЗаголовок", Истина);
	
//-----------------------------------------------------------------------------------------------------------//

	//Для Каждого СтрОтб из НастройкиСКД.Отбор.Элементы Цикл
	//	Если СтрОтб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПланируемаяДатаОплаты")	Тогда
	//		СтрОтб.ПравоеЗначение = Дата(СтрОтб.ПравоеЗначение);
	//	КонецЕсли;	
	//КонецЦикла;	

	Возврат НастройкиСКД;
	
КонецФункции	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если Валюта Тогда
		мас = Группировки.НайтиСтроки(Новый Структура("Представление", "Валюта"));
		Если мас.Количество() = 0 Тогда
			НГр = Группировки.Вставить(0);
			НГр.ИмяПоля = "Валюта";
			НГр.Представление = "Валюта";
			НГр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию"); 
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	
	Если Настройки.ДополнительныеСвойства.Свойство("Периоды") Тогда
		Если ТипЗнч(Настройки.ДополнительныеСвойства.Периоды) = Тип("ТаблицаЗначений") Тогда 
			Периоды.Загрузить(Настройки.ДополнительныеСвойства.Периоды); // ТаблицаЗначений
		Иначе
			Периоды.Загрузить(Настройки.ДополнительныеСвойства.Периоды.Выгрузить()); // ДанныеФормыКоллекция
		КонецЕсли;
	КонецЕсли;
	
	Если Настройки.ДополнительныеСвойства.Свойство("Группировки") Тогда
		Если ТипЗнч(Настройки.ДополнительныеСвойства.Группировки) = Тип("ТаблицаЗначений") Тогда 
			Группировки.Загрузить(Настройки.ДополнительныеСвойства.Группировки); // ТаблицаЗначений
		Иначе
			Группировки.Загрузить(Настройки.ДополнительныеСвойства.Группировки.Выгрузить()); // ДанныеФормыКоллекция
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланОплатыПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СсылкаОтборГрузоперевозокНажатие(Элемент)
	
	// открываем форму настройки отбора и сортировки
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияОтбораИСортировки",ЭтотОбъект);
	ПараметрыФормы = Новый Структура("СхемаКомпоновки,НастройкиКомпоновщика", ОтборГП_АдресСхемыКомпоновки ,ПоместитьВоВременноеХранилище(ОтборГП_КомпоновщикНастроек.Настройки, УникальныйИдентификатор));
	ОткрытьФорму("ОбщаяФорма.CW_ЖурналГрузоперевозок_НастройкаОтбора",ПараметрыФормы,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияОтбораИСортировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		ОтборГП_КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(Ответ.АдресНастроек));
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ОтборПоГрузоперевозкамПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

//БухгалтерскиеОтчетыКлиент
&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Результат, Элементы.Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры
//---БухгалтерскиеОтчетыКлиент
