#Область ОбработчикиСобытийФормы

&НаСервере
Процедура саб_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	саб_ДобавитьКомандуЗагрузкиЭПЭ();
	САБ_УстановитьТекстЗапросаСписка();
	САБ_ДобавитьЭлементыОтбораМенеджера();
	САБ_УстановкаПользователя();
	САБ_УстановитьПараметрОтбораМенеджера(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура саб_ЗагрузитьЭПЭИзXML(Команда)
	
	саб_ЗагрузкаЭПЭКлиент.ЗагрузитьЭПЭИзФайла(УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура САБ_ОтборОперативныйМенеджерПриИзменении(Элемент)
	
	САБ_УстановитьПараметрОтбораМенеджера(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура саб_ДобавитьКомандуЗагрузкиЭПЭ()
	
	Если Элементы.Найти("саб_ЗагрузитьЭПЭИзXML") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Команды.Найти("саб_ЗагрузитьЭПЭИзXML") = Неопределено Тогда
		КомандаЗагрузки = Команды.Добавить("саб_ЗагрузитьЭПЭИзXML");
		КомандаЗагрузки.Заголовок = НСтр("ru = 'Загрузить ЭПЭ из XML'");
		КомандаЗагрузки.Подсказка = НСтр("ru = 'Создать электронное поручение экспедитору по XML-файлу титула заказчика'");
		КомандаЗагрузки.Действие = "саб_ЗагрузитьЭПЭИзXML";
	КонецЕсли;
	
	ГруппаСоздать = Элементы.Найти("ГруппаСоздать");
	Если ГруппаСоздать = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КнопкаПеред = Элементы.Найти("СписокСоздатьЭЭР");
	Если КнопкаПеред = Неопределено Тогда
		КнопкаЗагрузки = Элементы.Добавить("саб_ЗагрузитьЭПЭИзXML", Тип("КнопкаФормы"), ГруппаСоздать);
	Иначе
		КнопкаЗагрузки = Элементы.Вставить("саб_ЗагрузитьЭПЭИзXML", Тип("КнопкаФормы"), ГруппаСоздать, КнопкаПеред);
	КонецЕсли;
	
	КнопкаЗагрузки.ИмяКоманды = "саб_ЗагрузитьЭПЭИзXML";
	КнопкаЗагрузки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	
КонецПроцедуры

&НаСервере
Процедура САБ_УстановитьТекстЗапросаСписка()
	
	Если Параметры.Свойство("ОтборДокументОснование") Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "РегистрСведений.РеестрЭПД";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = САБ_ТекстЗапросаСпискаЭПД();
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	Обработки.ЭлектронныеПеревозочныеДокументы.ЗаполнитьОбязательныеПараметрыЗапроса(Список.Параметры);
	САБ_УстановитьПараметрОтбораМенеджера(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура САБ_ДобавитьЭлементыОтбораМенеджера()
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, "ОтборОперативныйМенеджер") Тогда
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
			"ОтборОперативныйМенеджер",
			Новый ОписаниеТипов("СправочникСсылка.Пользователи")));
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	
	Если Элементы.Найти("ОтборОперативныйМенеджер") = Неопределено Тогда
		
		ГруппаОтборы = Элементы.Найти("ГруппаОтборыСписок");
		Если ГруппаОтборы = Неопределено Тогда
			ГруппаОтборы = ЭтотОбъект;
		КонецЕсли;
		
		ПолеОтбора = Элементы.Добавить("ОтборОперативныйМенеджер", Тип("ПолеФормы"), ГруппаОтборы);
		ПолеОтбора.Вид = ВидПоляФормы.ПолеВвода;
		ПолеОтбора.ПутьКДанным = "ОтборОперативныйМенеджер";
		ПолеОтбора.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеОтбора.КнопкаОчистки = Истина;
		ПолеОтбора.ПодсказкаВвода = НСтр("ru = 'Оперативный менеджер'");
		
	КонецЕсли;
	
	Элементы.ОтборОперативныйМенеджер.УстановитьДействие("ПриИзменении", "САБ_ОтборОперативныйМенеджерПриИзменении");
	
	Если Элементы.Найти("САБ_ОперативныйМенеджер") = Неопределено
		И Элементы.Найти("Список") <> Неопределено Тогда
		
		Колонка = Элементы.Добавить("САБ_ОперативныйМенеджер", Тип("ПолеФормы"), Элементы.Список);
		Колонка.Вид = ВидПоляФормы.ПолеВвода;
		Колонка.ПутьКДанным = "Список.САБ_ОперативныйМенеджер";
		Колонка.Заголовок = НСтр("ru = 'Оперативный менеджер'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура САБ_УстановкаПользователя()
	
	ВидитВсе = Пользователи.ЭтоПолноправныйПользователь()
		Или РольДоступна("САБ_ИзменениеОперативногоМенеджераЭПД");
	
	//Если ВидитВсе Тогда
	//	Элементы.ОтборОперативныйМенеджер.ТолькоПросмотр = Ложь;
	//Иначе
	//	ОтборОперативныйМенеджер = Пользователи.ТекущийПользователь();
	//	Элементы.ОтборОперативныйМенеджер.ТолькоПросмотр = Истина
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура САБ_УстановитьПараметрОтбораМенеджера(Форма)
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОтборОперативныйМенеджер") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСписка = Форма.Список.Параметры;
	
	Если ПараметрыСписка.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("САБ_ОтборМенеджерИспользуется")) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСписка.УстановитьЗначениеПараметра(
		"САБ_ОтборМенеджерИспользуется",
		ЗначениеЗаполнено(Форма.ОтборОперативныйМенеджер));
	ПараметрыСписка.УстановитьЗначениеПараметра(
		"САБ_ОперативныйМенеджер",
		Форма.ОтборОперативныйМенеджер);
	
КонецПроцедуры

&НаСервере
Функция САБ_ТекстЗапросаСпискаЭПД()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТИПЗНАЧЕНИЯ(РеестрЭПДПереопределяемый.Ссылка) КАК ТипСсылки,
	|	РеестрЭПДПереопределяемый.НомерДокументаИБ КАК НомерДокументаИБ,
	|	РеестрЭПДПереопределяемый.НомерЭПД КАК НомерЭПД,
	|	РеестрЭПДПереопределяемый.ДатаЭПД КАК ДатаЭПД,
	|	РеестрЭПДПереопределяемый.ДатаДокументаИБ КАК ДатаСоздания,
	|	РеестрЭПДПереопределяемый.Организация КАК Организация,
	|	РеестрЭПДПереопределяемый.Грузоотправитель КАК Грузоотправитель,
	|	РеестрЭПДПереопределяемый.Грузополучатель КАК Грузополучатель,
	|	РеестрЭПДПереопределяемый.Перевозчик КАК Перевозчик,
	|	РеестрЭПДПереопределяемый.ТекущийШаг КАК ТекущийШаг,
	|	РеестрЭПДПереопределяемый.ТекущийШагВыполнен КАК ТекущийШагВыполнен,
	|	РеестрЭПДПереопределяемый.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ЭТрН.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭТрН.САБ_ОперативныйМенеджер
	|		КОГДА ЭЗЗ.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭЗЗ.САБ_ОперативныйМенеджер
	|		КОГДА ЭЗН.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭЗН.САБ_ОперативныйМенеджер
	|		КОГДА ЭПЛ.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭПЛ.САБ_ОперативныйМенеджер
	|		КОГДА ЭДФ.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭДФ.САБ_ОперативныйМенеджер
	|		КОГДА ЭПЭ.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭПЭ.САБ_ОперативныйМенеджер
	|		КОГДА ЭЭР.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭЭР.САБ_ОперативныйМенеджер
	|		КОГДА ЭСР.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭСР.САБ_ОперативныйМенеджер
	|		КОГДА ЭСВ.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭСВ.САБ_ОперативныйМенеджер
	|	КОНЕЦ КАК САБ_ОперативныйМенеджер,
	|	РеестрЭПДПереопределяемый.Ссылка КАК Ссылка,
	|	СостоянияЭДПереопределяемый.СостояниеЭДО,
	|	СостоянияЭДПереопределяемый.ПредставлениеСостояния,
	|	РеестрЭПДПереопределяемый.Проведен,
	|	РеестрЭПДПереопределяемый.ПометкаУдаления,
	|	РеестрЭПДПереопределяемый.ТекущийШагМП,
	|	РеестрЭПДПереопределяемый.ИдентификаторЗаписиМП КАК ИдентификаторЗаписиМП,
	|	ВЫБОР
	|		КОГДА РеестрЭПДПереопределяемый.Организация = РеестрЭПДПереопределяемый.Перевозчик
	|			ТОГДА ИСТИНА
	|		КОГДА ТИПЗНАЧЕНИЯ(РеестрЭПДПереопределяемый.Ссылка) В (&МассивТиповДокументовСОграничениемШаговМП)
	|			И РеестрЭПДПереопределяемый.ТекущийШаг В (&МассивШаговДляПодключенияМП)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК МобильноеПриложениеДоступно,
	|	РеестрЭПДПереопределяемый.НаименованиеМП КАК МобильноеПриложение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РеестрЭПДПереопределяемый.ТекущийШагМП, """") В (&МассивШаговМПТребующихРеакцию)
	|			ТОГДА 6
	|		КОГДА ЕСТЬNULL(РеестрЭПДПереопределяемый.ТекущийШагМП, """") В (&МассивШаговМПТребующихРеакциюОтклонение)
	|			ТОГДА 7
	|		КОГДА РеестрЭПДПереопределяемый.ОжидаемПросмотрМП = ИСТИНА
	|			ТОГДА 1
	|		КОГДА РеестрЭПДПереопределяемый.МобильноеПриложение = """"
	|			ТОГДА 0
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КартинкаМобильноеПриложение,
	|	РеестрЭПДПереопределяемый.НаименованиеМП КАК МобильноеПриложениеБезГиперссылки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РеестрЭПДПереопределяемый.ТекущийШагМП, """") В (&МассивШаговМПТребующихРеакцию)
	|			ТОГДА 6
	|		КОГДА ЕСТЬNULL(РеестрЭПДПереопределяемый.ТекущийШагМП, """") В (&МассивШаговМПТребующихРеакциюОтклонение)
	|			ТОГДА 7
	|		КОГДА РеестрЭПДПереопределяемый.ОжидаемПросмотрМП = ИСТИНА
	|			ТОГДА 1
	|		КОГДА РеестрЭПДПереопределяемый.МобильноеПриложение = """"
	|			ТОГДА 0
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КартинкаМобильноеПриложениеБезГиперссылки,
	|	ВЫБОР
	|		КОГДА РеестрЭПДПереопределяемый.ПометкаУдаления
	|			ТОГДА 5
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК НестандартнаяКартинка,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(500)) КАК ДокументОснование
	|ИЗ
	|	РегистрСведений.РеестрЭПД КАК РеестрЭПДПереопределяемый
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияПоОбъектамУчетаЭДО КАК СостоянияЭДПереопределяемый
	|		ПО (СостоянияЭДПереопределяемый.СсылкаНаОбъект = РеестрЭПДПереопределяемый.Ссылка)}
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектроннаяТранспортнаяНакладная КАК ЭТрН
	|		ПО ЭТрН.Ссылка = РеестрЭПДПереопределяемый.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйЗаказЗаявка КАК ЭЗЗ
	|		ПО ЭЗЗ.Ссылка = РеестрЭПДПереопределяемый.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйЗаказНаряд КАК ЭЗН
	|		ПО ЭЗН.Ссылка = РеестрЭПДПереопределяемый.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйПутевойЛист КАК ЭПЛ
	|		ПО ЭПЛ.Ссылка = РеестрЭПДПереопределяемый.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДоговорФрахтования КАК ЭДФ
	|		ПО ЭДФ.Ссылка = РеестрЭПДПереопределяемый.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПоручениеЭкспедитору КАК ЭПЭ
	|		ПО ЭПЭ.Ссылка = РеестрЭПДПереопределяемый.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектроннаяЭкспедиторскаяРасписка КАК ЭЭР
	|		ПО ЭЭР.Ссылка = РеестрЭПДПереопределяемый.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектроннаяCкладскаяРасписка КАК ЭСР
	|		ПО ЭСР.Ссылка = РеестрЭПДПереопределяемый.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектроннаяСопроводительнаяВедомость КАК ЭСВ
	|		ПО ЭСВ.Ссылка = РеестрЭПДПереопределяемый.Ссылка
	|ГДЕ
	|	(НЕ &САБ_ОтборМенеджерИспользуется
	|		ИЛИ ВЫБОР
	|			КОГДА ЭТрН.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭТрН.САБ_ОперативныйМенеджер
	|			КОГДА ЭЗЗ.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭЗЗ.САБ_ОперативныйМенеджер
	|			КОГДА ЭЗН.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭЗН.САБ_ОперативныйМенеджер
	|			КОГДА ЭПЛ.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭПЛ.САБ_ОперативныйМенеджер
	|			КОГДА ЭДФ.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭДФ.САБ_ОперативныйМенеджер
	|			КОГДА ЭПЭ.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭПЭ.САБ_ОперативныйМенеджер
	|			КОГДА ЭЭР.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭЭР.САБ_ОперативныйМенеджер
	|			КОГДА ЭСР.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭСР.САБ_ОперативныйМенеджер
	|			КОГДА ЭСВ.Ссылка ЕСТЬ НЕ NULL ТОГДА ЭСВ.САБ_ОперативныйМенеджер
	|		КОНЕЦ = &САБ_ОперативныйМенеджер)
	|{ГДЕ
	|	РеестрЭПДПереопределяемый.ДатаЭПД КАК Дата,
	|	(РеестрЭПДПереопределяемый.ДатаЭПД >= &НачалоПериода)
	|	И (&КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	|	ИЛИ РеестрЭПДПереопределяемый.ДатаЭПД <= &КонецПериода)}";
	
КонецФункции

#КонецОбласти