#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Исправления = Истина;
	Корректировки = Истина;
	Возвраты = Истина;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Организация, НачалоПериода, КонецПериода, Возвраты, Корректировки, Исправления");
	
	Если НачалоПериода > НастройкиУчетаНалогаНаПрибыльФормыКлиентСервер.ДатаИзмененияСт54НК_425ФЗ_28_11_2025()
		И НЕ Исправления Тогда
		Исправления = Истина;
	КонецЕсли;
	
	ПравоРедактированияДокументов =
		ПравоДоступа("Изменение", Метаданные.Документы.ВозвратТоваровОтПокупателя)
			ИЛИ ПравоДоступа("Изменение", Метаданные.Документы.КорректировкаПоступления)
			ИЛИ ПравоДоступа("Изменение", Метаданные.Документы.КорректировкаРеализации);
	
	ПроверитьДатуЗапретаНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Организация) 
		И ЗначениеЗаполнено(НачалоПериода)
		И ЗначениеЗаполнено(КонецПериода) Тогда
		НачатьОбновлениеТаблицыДокументов();
	КонецЕсли;
	
	Если УстановленаДатаЗапрета Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьДатуЗапрета", 5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправленияПриИзменении(Элемент)
	НачатьОбновлениеТаблицыДокументов();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьДатуЗапрета()
	
	ПроверитьДатуЗапретаНаСервере();
	Если УстановленаДатаЗапрета Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьДатуЗапрета", 5, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДатуЗапретаНаСервере()
	
	УстановленаДатаЗапрета = ДатыЗапретаИзмененияБП.ЗапрещеноРедактированиеПериода(ДобавитьМесяц(НачалоПериода, -12), Организация);
	Элементы.ГруппаЗакрытыйПериод.Видимость = УстановленаДатаЗапрета;
	Элементы.ОбработатьДокументы.Доступность = НЕ УстановленаДатаЗапрета И ПравоРедактированияДокументов;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьТаблицуДокументов(ПараметрыОбновления, УникальныйИдентификатор)
		
	ДлительнаяОперация = Обработки.ИсправитьДокументыПриИзмененииНастроекСт54НК.ЗапуститьПолучениеТаблицыДокументовВФоне(
		ПараметрыОбновления, УникальныйИдентификатор, Истина);
		
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура НачатьОбновлениеТаблицыДокументов()
	
	// Параметры обернем в структуру для их передачи через механизм ДлительныеОперации.
	ПараметрыОбновления = Новый Структура();
	
	ПараметрыОбновления.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыОбновления.Вставить("КонецПериода",  КонецПериода);
	ПараметрыОбновления.Вставить("Организация",   Организация);
	ПараметрыОбновления.Вставить("Возвраты",      Возвраты);
	ПараметрыОбновления.Вставить("Исправления",   Исправления);
	ПараметрыОбновления.Вставить("Корректировки", Корректировки);
	
	ДлительнаяОперация = ОбновитьТаблицуДокументов(ПараметрыОбновления, УникальныйИдентификатор);
	ОжидатьЗавершенияДлительнойОперации(ДлительнаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершенияДлительнойОперации(ДлительнаяОперация)
	
	Если ДлительнаяОперация <> Неопределено Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеФоновогоЗаданияЗаполнения", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФоновогоЗаданияЗаполнения(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура")
		И (Результат.Свойство("Статус") И Результат.Статус = "Выполнено") Тогда
		
		ЗавершениеФоновогоЗаданияЗаполненияНаСервере(Результат.АдресРезультата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеФоновогоЗаданияЗаполненияНаСервере(АдресРезультата)
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресРезультата);
	ТаблицаДокументов.Загрузить(РезультатВыполнения);
	
	Если ДокументыИсключения.Количество() > 0 Тогда
		Для Каждого ДокументИсключение Из ДокументыИсключения Цикл
			НайденныеСтроки = ТаблицаДокументов.НайтиСтроки(Новый Структура("Ссылка", ДокументИсключение.Значение));
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ОбработатьДокументыНаСервере()
	
	ДокументыИсключения.Очистить();
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрокаДокумент Из ТаблицаДокументов Цикл
		Если СтрокаДокумент.Пометка Тогда
			МассивДокументов.Добавить(СтрокаДокумент.Ссылка);
		Иначе
			ДокументыИсключения.Добавить(СтрокаДокумент.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Обработки.ИсправитьДокументыПриИзмененииНастроекСт54НК.ЗаменитьДвиженияДокументов(МассивДокументов);
		
КонецФункции

&НаКлиенте
Процедура ОбработатьДокументы(Команда)
	
	Результат = ОбработатьДокументыНаСервере();
	Если Результат.МассивДокументовСОшибками.Количество() = 0
		И ДокументыИсключения.Количество() = 0 Тогда
		ПоказатьОповещениеПользователя("Документы успешно обработаны");
		Закрыть();
	Иначе
		НачатьОбновлениеТаблицыДокументов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометку(Значение)
	
	Для Каждого СтрокаДокумент Из ТаблицаДокументов Цикл
		СтрокаДокумент.Пометка = Значение;
	КонецЦикла;
	
КонецПРоцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьПометку(Ложь)
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьПометку(Истина)
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ТаблицаДокументов.ТекущиеДанные;
	Отказ = Истина;
	Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		Если Элемент.ТекущийЭлемент = Элементы.ТаблицаДокументовПометка Тогда
			ТекущиеДанные.Пометка = НЕ ТекущиеДанные.Пометка;
		Иначе
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Ссылка);
			Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
				ОткрытьФорму("Документ.ВозвратТоваровОтПокупателя.ФормаОбъекта", ПараметрыФормы, , , , , );
			ИначеЕсли ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
				ОткрытьФорму("Документ.КорректировкаПоступления.ФормаОбъекта", ПараметрыФормы, , , , , );
			ИначеЕсли ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				ОткрытьФорму("Документ.КорректировкаРеализации.ФормаОбъекта", ПараметрыФормы, , , , , );
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
