
&После("ОбработкаЗаполнения")
Процедура VMS_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Для каждого Запись Из ЭтотОбъект цикл 
		Запись.ВыводитьДополнениевШапкуСчета = Истина;
		Если ЗначениеЗаполнено(Запись.ДополнениеВШапкеСчета) тогда
			Запись.ДополнениеВШапкеСчета = "Дог. №%НомерДоговораПокупателя% от %ДатаДоговораПокупателя%" + Символы.ПС + Запись.ДополнениеВШапкеСчета;	
		Иначе
			Запись.ДополнениеВШапкеСчета = "Дог. №%НомерДоговораПокупателя% от %ДатаДоговораПокупателя%";
		КонецЕсли; 
		
		Запись.ПорядокЗачетаАвансовОЗ = Перечисления.СпособыЗачетаАвансов.ПоДокументу;
	КонецЦикла;
КонецПроцедуры
