
Процедура ПередНачаломВводаПредставлений(Форма, ПараметрыПроцедуры) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КоличествоПеревозок", ПараметрыПроцедуры.КоличествоСтрок);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма",				Форма); 
	ДополнительныеПараметры.Вставить("ПараметрыПроцедуры",	ПараметрыПроцедуры); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВводПредставлений", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВводаСпискаПредставлений", СтруктураПараметров, Форма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	      
КонецПроцедуры 

Процедура ПродолжитьВводПредставлений(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  CW_Мониторинг.ПродолжитьЗаполнениеПредставленийНаСервереВФоне(Ответ, ДополнительныеПараметры.ПараметрыПроцедуры);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ДополнительныеПараметры.Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = ?(ДополнительныеПараметры.ПараметрыПроцедуры.КоличествоСтрок > 5, Истина, Ложь);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗаполненияПредставлений", ДополнительныеПараметры.Форма, ДополнительныеПараметры.ПараметрыПроцедуры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

