
// Возвращает структуру с пустым значением полей, которая сохраняется 
// в реквизите Шаблон как ХранилищеЗначения.
//
Функция ПустаяСтруктураШаблонаДокумента() Экспорт

	Вложения = Новый Структура();

	Результат = Новый Структура();
	Результат.Вставить("ТекстHTML", "");
	Результат.Вставить("Вложения", 	Вложения);
	
	Возврат Результат;

КонецФункции

// Возвращает данные шаблона из хранилища.
//
Функция ДанныеШаблонаДокумента(ШаблонДокумента) Экспорт

	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ШаблонДокумента) Тогда
		ХранилищеШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонДокумента, "ХранилищеШаблона");
		Если ТипЗнч(ХранилищеШаблона) = Тип("ХранилищеЗначения") Тогда
			Результат = ХранилищеШаблона.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Если ШаблонДокумента.ИмяФормата = "HTML" Тогда
		Если ТипЗнч(Результат) <> Тип("Структура") Тогда
			Результат = ПустаяСтруктураШаблонаДокумента();
		КонецЕсли;    
	КонецЕсли;
	Если ШаблонДокумента.ИмяФормата = "MXL" Тогда
		Если ТипЗнч(Результат) <> Тип("ТабличныйДокумент") Тогда
			Результат = Новый ТабличныйДокумент;
		КонецЕсли;    
	КонецЕсли;

	Возврат Результат;

КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаЭлемента"
		И ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли; 
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда  
		// Для существующего элемента справочника открываем форму редактирования в соответстии с форматом макета.
		ВыбраннаяФорма = "ФормаРедактированияШаблона"+СокрЛП(Параметры.Ключ.ИмяФормата);;
		Возврат;
	КонецЕсли;
	
	ЭтоКопирование = Ложь;
	// Если элемент копируется, то имя макета получаем из копируемого элемента.
	Если Параметры.Свойство("ЗначениеКопирования")
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЭтоКопирование = Истина;
	КонецЕсли;

	Если НЕ ЭтоКопирование  Тогда
		Если Параметры.Свойство("ЗначенияЗаполнения") 
			И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
			Если Параметры.ЗначенияЗаполнения.Свойство("ИмяФормата") Тогда
				ИмяФормата = Параметры.ЗначенияЗаполнения.ИмяФормата;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоКопирование ИЛИ ЗначениеЗаполнено(ИмяФормата) Тогда
		ВыбраннаяФорма = "ФормаРедактированияШаблона"+СокрЛП(ИмяФормата);
	Иначе
		ВыбраннаяФорма = "ФормаЭлемента";
	КонецЕсли;
	
КонецПроцедуры
