
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Системное сообщение ("+Формат(Объект.Дата,"ДФ='yyyy.MM.dd HH:mm:ss'")+")";
	_ОбновитьСписокСсылок();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьСписокСсылок()
	// --- 
	
	СписокСсылок.Очистить();
	// --- 
	
	МассивСсылок = Объект.СписокСсылок.Выгрузить().ВыгрузитьКолонку("СсылкаСообщения");
	Если МассивСсылок.Количество() = 0 Тогда
		
		Элементы.СтраницаСсылки.Видимость = Ложь;
		
	Иначе
		
		Элементы.СтраницаСсылки.Видимость = Истина;
		
		МассивПредставлений = ПолучитьПредставленияНавигационныхСсылок(МассивСсылок);
		
		Для каждого ПС Из МассивПредставлений Цикл
			
			СписокСсылок.Добавить(ПС.НавигационнаяСсылка,ПС.Текст);
			
		КонецЦикла; 
		
	КонецЕсли; 
		
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СписокСсылокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Попытка
		
		СтрокаЭлемента = СписокСсылок.НайтиПоИдентификатору(Элементы.СписокСсылок.ТекущаяСтрока);
		ПерейтиПоНавигационнойСсылке(СтрокаЭлемента.Значение);
		
	Исключение
		
		_УФК.ВывестиПредупреждение(ОписаниеОшибки());
		
	КонецПопытки; 
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти