&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РазрешенныеОрганизации") 
		И ТипЗнч(Параметры.РазрешенныеОрганизации) = Тип("Массив") Тогда
		РазрешенныеОрганизации.ЗагрузитьЗначения(Параметры.РазрешенныеОрганизации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметры(Команда)  
	
	КодСостояния = CW_РаботаСВнешнимиРесурсамиСервер.ПроверитьПодключениеНаСервере();
	
	Если КодСостояния <> 200 Тогда
		ОписаниеКодовСостояний = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка подклчюения! Код: "+Строка(КодСостояния)+" - " + ОписаниеКодовСостояний.Получить(КодСостояния);
		Сообщение.Сообщить();
		
		ПоказатьПредупреждение(,"Не удалось подключиться");
	Иначе           
		
		МассивОрганизаций = РазрешенныеОрганизации.ВыгрузитьЗначения();
		
		Ответ = CW_ЭлектронныйОбменДаннымиВызовСервера.ИзменитьРазрешенныеОрагнизацииНаСервере(МассивОрганизаций); 
		Если Ответ.КодСостояния = 200 Тогда 
			
			Структура = Новый Структура;
			Структура.Вставить("РазрешенныеОрганизации", МассивОрганизаций);
			Структура.Вставить("Ошибки", Ошибки);
			
			ЭтаФорма.Закрыть(Структура);
		Иначе
			ПоказатьПредупреждение(,Ответ.Тело,,"Изменение списка органиазций"); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  


&НаКлиенте
Процедура РазрешенныеОрганизацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого ЗначениеВыбора из ВыбранноеЗначение Цикл
		Если РазрешенныеОрганизации.НайтиПоЗначению(ЗначениеВыбора) = Неопределено Тогда
			РазрешенныеОрганизации.Добавить(ЗначениеВыбора);	
		КонецЕсли;                   
	КонецЦикла;
	
КонецПроцедуры

