
&НаКлиенте
Процедура ИнтервалНачалоПриИзменении(Элемент)
	ПолучитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалКонецПриИзменении(Элемент)
	ПолучитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПриИзменении(Элемент)
	ПолучитьНаименование();
КонецПроцедуры

&НаСервере
Процедура ПолучитьНаименование()
	
	Объект.Наименование = "от "+Формат(Объект.ИнтервалНачало,"ЧДЦ=; ЧН=0; ЧГ=0")+" до "+Формат(Объект.ИнтервалКонец,"ЧДЦ=; ЧН=0; ЧГ=0")+" ("+Формат(Объект.Коэффициент ,"ЧДЦ=; ЧН=0; ЧГ=0") + " %)";
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПолучитьНаименование();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти