
#Область Форма

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	ВосстановитьСеансовуюНастройку();
	
	Если Параметры.Свойство("ТранспортноеСообщение",ТранспортноеСообщение) Тогда
		ПрочитатьТранспортноеСообщение(Отказ);
	Иначе 
		Элементы.ТранспортноеСообщение.Видимость = Истина;
	КонецЕсли; 
	
	ОбновитьСписокДополнительныхКолонокФормы(ЭтаФорма);
	
	Элементы.ГруппаСинхронизация.Ширина = 30;
	СтатусДокумента = Справочники.CW_СтатусыДокументов.ПолучитьСтатусНовогоОбъекта(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"));	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЗначенияУслуг();
	УслугиПоДоговру();
	Услуги_ЗаполнитьПроядокОтражения("");
	МожноФормировать(); 
	ИницализацияЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы Тогда
		СохранитьСеансовуюНастройку();
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ИницализацияЭлементовФормы()
	ПоказыватьСинхронизацию							= ЕстьОшибкиСинхронизации;
	Элементы.ГруппаСинхронизация.Видимость			= ПоказыватьСинхронизацию;
	Элементы.ФормаПоказыватьСинхронизацию.Пометка	= ПоказыватьСинхронизацию; 	
	Элементы.УслугиДополнительныеКолонки.Видимость	= ПоказыватьДопКолоноки;
	Элементы.Услуги_ПоказыватьДопКолоноки.Пометка	= ПоказыватьДопКолоноки;
	ПредставлениеПараметраРаспределения();
КонецПроцедуры
 

&НаСервере
Процедура ПрочитатьТранспортноеСообщение(Отказ)
	
	ОчиститьФорму();
	ЗаполнитьЗначенияСвойств(ЭтаФорма,ТранспортноеСообщение,"Организация,Контрагент,ПрофильОбмена");
	Нашли = ТранспортноеСообщение.Вложения.Найти("Finance");Если Нашли = Неопределено Тогда Возврат;КонецЕсли;
	
	ПолноеИмяФайла = CW_РаботаСФайламиСервер.ПолучитьПолноеИмяФайла(Нашли.ОбъектАрхива);
	
	CW_DT.ЗаполнитьФормуИзXML(ЭтаФорма, ПолноеИмяФайла, Отказ);
	ПолучитьСинхронизацию();
	НайтиДоговор();
	ПодобратьГрузоперевозки();
	
	ПодразделениеОрганизации = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ПодразделениеПользователя");	
	
	//Инициализация видимости элементов
	ПредставлениеСчета = ПредставлениеСчета(Счет);
	Элементы.ГруппаПродавец.Видимость		= НЕ ПродавецИдентификатор = "";
	Элементы.ПредставлениеСчета.Видимость	= НЕ ПредъявленСчет;
	Элементы.ГруппаСчет.Видимость			= НЕ ПредъявленСчет И НЕ СписокСчетов;
	Элементы.УникальныеСчета.Видимость		= СписокСчетов;
	Элементы.УслугиСчет.Видимость			= СписокСчетов;
	
	Элементы.ФормаСформировать.Заголовок	= ?(РасходыСсылка.Пустая(),"Сформировать","Обновить");	
	Заголовок = "Транспортное сообщение " + ТранспортноеСообщение.Номер + " от " + Формат(ТранспортноеСообщение.Дата,"ДФ=dd.MM.yyyy") + ": " + ?(РасходыСсылка.Пустая(),"Формирование","Обновление") + " расходов";
	
КонецПроцедуры



&НаСервере
Процедура ВосстановитьСеансовуюНастройку()
	СтруктураНастройки = ХранилищеСистемныхНастроек.Загрузить("CWDT.ЗагрузкаРасходов.Форма","Сеансовая");
	Если СтруктураНастройки <> Неопределено Тогда
		Попытка
			СтруктураНастройки.Свойство("ПараметрРаспределения",ПараметрРаспределения);
			СтруктураНастройки.Свойство("ПоказыватьДопКолоноки",ПоказыватьДопКолоноки);
			СтруктураНастройки.Свойство("Настройка_ФормироватьПредставлениеУслуги",Настройка_ФормироватьПредставлениеУслуги);
			СтруктураНастройки.Свойство("Настройка_ЗакрыватьОкноПослеФормирования",Настройка_ЗакрыватьОкноПослеФормирования);
			СтруктураНастройки.Свойство("Настройка_ОткрыватьСформированныйДокумент",Настройка_ОткрыватьСформированныйДокумент);
			СтруктураНастройки.Свойство("Настройка_ПроводитьСформированныйДокумент",Настройка_ПроводитьСформированныйДокумент);
		Исключение
		КонецПопытки;			
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СохранитьСеансовуюНастройку()
	СтруктураНастройки = Новый Структура();
	мВыбранныеКолонки = Новый Массив;
	Для Каждого ЭлементСписка Из СписокДополнительныхКолонок Цикл
		Если ЭлементСписка.Пометка Тогда
			мВыбранныеКолонки.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	СтруктураНастройки.Вставить("ВыбранныеКолонки",мВыбранныеКолонки);
	СтруктураНастройки.Вставить("ПараметрРаспределения",ПараметрРаспределения);
	СтруктураНастройки.Вставить("ПоказыватьДопКолоноки",ПоказыватьДопКолоноки);
	СтруктураНастройки.Вставить("Настройка_ФормироватьПредставлениеУслуги",Настройка_ФормироватьПредставлениеУслуги);
	СтруктураНастройки.Вставить("Настройка_ЗакрыватьОкноПослеФормирования",Настройка_ЗакрыватьОкноПослеФормирования);
	СтруктураНастройки.Вставить("Настройка_ОткрыватьСформированныйДокумент",Настройка_ОткрыватьСформированныйДокумент);
	СтруктураНастройки.Вставить("Настройка_ПроводитьСформированныйДокумент",Настройка_ПроводитьСформированныйДокумент);
	ХранилищеСистемныхНастроек.Сохранить("CWDT.ЗагрузкаРасходов.Форма","Сеансовая",СтруктураНастройки);
КонецПроцедуры


&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
КонецПроцедуры

#Область МожноФормировать

&НаКлиенте
Процедура МожноФормировать()
	
	ЕстьОшибкиСинхронизации();
	ЕстьОшибкиУслуг();
	
	//Отображение
	ЗаголовокГруппаСтраницаОсновное			= "Основное" + ?(ЕстьОшибкиОсновное,"!",".");
	ЗаголовокГруппаСтраницаНоменклатура		= "Номенклатура" + ?(ЕстьОшибкиНоменклатура,"!",".");
	ЗаголовокГруппаСтраницаГрузоперевозки	= "Грузоперевозки" + ?(ЕстьОшибкиГрузоперевозки,"!",".");
	
	//Элементы.ГруппаСтраницаГрузоперевозки.ЦветФона = ?(ЕстьОшибкиГрузоперевозки,Новый Цвет(255,210,200),Новый Цвет(255,255,255));
	
	
	Элементы.ФормаСформировать.Доступность = НЕ (ЕстьОшибкиСинхронизации ИЛИ ЕстьОшибкиУслуг);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьОшибкиСинхронизации()
	ЕстьОшибкиОсновное(); 	
	ЕстьОшибкиГрузоперевозки(); 	
	ЕстьОшибкиНоменклатура	= УникальнаяНоменклатура.НайтиСтроки(Новый Структура("Номенклатура",ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"))).Количество(); 
	ЕстьОшибкиСинхронизации = ЕстьОшибкиОсновное ИЛИ ЕстьОшибкиГрузоперевозки ИЛИ ЕстьОшибкиНоменклатура;
КонецПроцедуры

&НаКлиенте
Процедура ЕстьОшибкиОсновное()
	ЕстьОшибкиОсновное = Ложь;
	ЕстьОшибкиОсновное = ЕстьОшибкиОсновное ИЛИ Договор.Пустая();
	ЕстьОшибкиОсновное = ЕстьОшибкиОсновное ИЛИ НЕ Валюта = ВалютаСообщения;
	ЕстьОшибкиОсновное = ЕстьОшибкиОсновное ИЛИ УникальныеСчета.НайтиСтроки(Новый Структура("Счет",ПредопределенноеЗначение("Документ.CW_РасходыПоГрузоперевозке.ПустаяСсылка"))).Количество(); 
	Если НЕ ПредъявленСчет И НЕ СписокСчетов Тогда
		ЕстьОшибкиОсновное = ЕстьОшибкиОсновное ИЛИ Счет.Пустая();	
	КонецЕсли; 
	Если НЕ ПродавецИдентификатор = "" Тогда
		ЕстьОшибкиОсновное = ЕстьОшибкиОсновное ИЛИ Продавец.Пустая();	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЕстьОшибкиГрузоперевозки()
	ЕстьОшибкиГрузоперевозки = Ложь;
	ЕстьОшибкиГрузоперевозки = Грузоперевозки.НайтиСтроки(Новый Структура("ДоступенСписокГрузоперевозок,Грузоперевозка",Ложь,ПредопределенноеЗначение("Справочник.CW_Грузоперевозки.ПустаяСсылка"))).Количество();	
	Если НЕ ЕстьОшибкиГрузоперевозки Тогда
		Для Каждого Стр Из Грузоперевозки.НайтиСтроки(Новый Структура("ДоступенСписокГрузоперевозок",Истина)) Цикл
			Если НЕ Стр.СписокГрузоперевозок.Количество() Тогда
				ЕстьОшибкиГрузоперевозки = Истина;Прервать;
			КонецЕсли; 		
		КонецЦикла; 	
	КонецЕсли; 
КонецПроцедуры
 
&НаКлиенте
Процедура ЕстьОшибкиУслуг()
	ЕстьОшибкиУслуг = Ложь;
	Для Каждого Элемент Из Услуги.ПолучитьЭлементы() Цикл
		Если Элемент.Корень Тогда
			//ЕстьОшибкиУслуг = ЕстьОшибкиУслуг ИЛИ НЕ Элемент.Количество	= Элемент.КоличествоВетви;
			ЕстьОшибкиУслуг = ЕстьОшибкиУслуг ИЛИ НЕ Элемент.Сумма		= Элемент.СуммаВетви;
			ЕстьОшибкиУслуг = ЕстьОшибкиУслуг ИЛИ НЕ Элемент.НДС		= Элемент.НДСВетви;
			ЕстьОшибкиУслуг = ЕстьОшибкиУслуг ИЛИ НЕ Элемент.Всего		= Элемент.ВсегоВетви;
			Если ЕстьОшибкиУслуг Тогда Прервать;КонецЕсли; 
			Для Каждого Ветвь Из Элемент.ПолучитьЭлементы() Цикл
				Если Ветвь.Учитывать И (Ветвь.ПорядокОтражения.Пустая() ИЛИ (Ветвь.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление") И Ветвь.ДоговорПокупателя.Пустая())) Тогда
					ЕстьОшибкиУслуг = Истина;Прервать;
				КонецЕсли; 
			КонецЦикла; 
		Иначе 
			Если Элемент.ПорядокОтражения.Пустая() ИЛИ (Элемент.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление") И Элемент.ДоговорПокупателя.Пустая()) Тогда
				ЕстьОшибкиУслуг = Истина;Прервать;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти 

&НаСервере
Процедура НайтиДоговор()
	Если Договор.Пустая() И ЗначениеЗаполнено(ДоговорДата) И ЗначениеЗаполнено(ДоговорДата)  Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДоговорПоставщика(Организация,Контрагент,ДоговорНомер,ДоговорДата));	
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоговорПоставщика(Организация,Контрагент,ДоговорНомер,ДоговорДата)
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка,
		|	CW_ДоговорыПоГрузоперевозкам.ВалютаДоговора КАК Валюта
		|ИЗ
		|	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
		|ГДЕ
		|	CW_ДоговорыПоГрузоперевозкам.НомерДоговора = &ДоговорНомер
		|	И CW_ДоговорыПоГрузоперевозкам.ДатаДоговора = &ДоговорДата
		|	И CW_ДоговорыПоГрузоперевозкам.Владелец = &Контрагент
		|	И CW_ДоговорыПоГрузоперевозкам.Организация = &Организация
		|	И CW_ДоговорыПоГрузоперевозкам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)";
	Запрос.УстановитьПараметр("ДоговорДата",	ДоговорДата);
	Запрос.УстановитьПараметр("ДоговорНомер",	ДоговорНомер);
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Новый Структура("Договор,Валюта",Выборка.Ссылка,Выборка.Валюта) 
	Иначе 
		Возврат Новый Структура("Договор,Валюта") 
	КонецЕсли; 	
КонецФункции
 

&НаКлиенте
Процедура ПоказатьОшибки(Команда)
	//ПоказатьОшибки = НЕ ПоказатьОшибки;
	//Элементы.ФормаПоказатьОшибки.Пометка = ПоказатьОшибки;
	//СтруктураПоискаГрузоперевозки	= Новый Структура;
	//СтруктураПоискаНоменклатура		= Новый Структура;
	//Если ПоказатьОшибки Тогда
	//	СтруктураПоискаГрузоперевозки.Вставить("Ошибка",Истина);
	//	СтруктураПоискаНоменклатура.Вставить("Ошибка",Истина);
	//КонецЕсли; 
	//Элементы.Грузоперевозки.ОтборСтрок			= Новый ФиксированнаяСтруктура(СтруктураПоискаГрузоперевозки);
	//Элементы.УникальнаяНоменклатура.ОтборСтрок	= Новый ФиксированнаяСтруктура(СтруктураПоискаНоменклатура);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСинхронизацию(Команда)
	ПоказыватьСинхронизацию							= НЕ ПоказыватьСинхронизацию;
	Элементы.ГруппаСинхронизация.Видимость			= ПоказыватьСинхронизацию;
	Элементы.ФормаПоказыватьСинхронизацию.Пометка	= ПоказыватьСинхронизацию;
	Элементы.ГруппаСинхронизация.Ширина = 30;
КонецПроцедуры

&НаСервере
Процедура ОчиститьФорму()
	Грузоперевозки.Очистить();
	Услуги.ПолучитьЭлементы().Очистить();
	УникальнаяНоменклатура.Очистить();
	УникальныеСчета.Очистить();
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Новый Структура("Заголовок,ПрофильОбмена,Организация,Контрагент,РасходыСсылка,РасходыИдентификатор,Договор,ДоговорИдентификатор,Продавец,ПродавецИдентификатор,Счет,СчетИдентификатор,СписокСчетов,ПредъявленСчет,ПредъявленАкт,ПредъявленСФ,НомерСчета,НомерАкта,НомерСФ,ДатаСчета,ДатаАкта,ДатаСФ,Валюта,ВалютаСообщения,ПорядокОтражения,ДоговорДата,ДоговорНомер")); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВалютаДоговора(Договор)
	Возврат Договор.ВалютаДоговора
КонецФункции

&НаКлиенте
Процедура ЭлементПриИзменении(Элемент)
	МожноФормировать();
КонецПроцедуры

&НаКлиенте
Процедура ИтогиСтрокой()
	//ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Итоги = Новый Структура("Строк,СтрОб,Сумма,НДС,Всего",0,0,0,0,0); 
	Для Каждого Элемент Из Услуги.ПолучитьЭлементы() Цикл
		Если Элемент.Корень Тогда
			Для Каждого Ветвь Из Элемент.ПолучитьЭлементы() Цикл
				Если Ветвь.Учитывать Тогда
					Итоги.СтрОб	= Итоги.СтрОб + 1;	
				КонецЕсли; 
			КонецЦикла; 
		Иначе
			Итоги.СтрОб	= Итоги.СтрОб + 1;	
		КонецЕсли; 
		Итоги.Строк	= Итоги.Строк + 1;	
		Итоги.Сумма	= Итоги.Сумма + Элемент.Сумма;	
		Итоги.НДС	= Итоги.НДС	  + Элемент.НДС;	
		Итоги.Всего	= Итоги.Всего + Элемент.Всего;	
	КонецЦикла; 
	ИтогиПоДокументу	= "Строк: " + Итоги.Строк + "(" + Итоги.СтрОб + ")" + "; Сумма: " + Формат(Итоги.Сумма,"ЧДЦ=2; ЧН=0.00") + "; НДС: " + Формат(Итоги.НДС,"ЧДЦ=2; ЧН=0.00")+ "; Всего: " + Формат(Итоги.Всего,"ЧДЦ=2; ЧН=0.00") + " " + ВалютаСообщения + "; "; 	
	ТекущиеДанные		= Элементы.Услуги.ТекущиеДанные;
	Если ТекущиеДанные	= Неопределено Тогда 
		ИтогиСтрокой	= Новый ФорматированнаяСтрока(ИтогиПоДокументу);
	Иначе
		Если ТекущиеДанные.Корень Тогда
			СтрокаУслуг = ТекущиеДанные;	
		ИначеЕсли ТекущиеДанные.Ветвь Тогда 
			СтрокаУслуг = ТекущиеДанные.ПолучитьРодителя();
		Иначе 
			ИтогиСтрокой = Новый ФорматированнаяСтрока(ИтогиПоДокументу);Возврат;
		КонецЕсли; 

		Отклонения = Новый Структура("Сумма,НДС,Всего",0,0,0);
		
		Для Каждого Показатель Из Отклонения Цикл
			Отклонения[Показатель.Ключ] = СтрокаУслуг[Показатель.Ключ] - СтрокаУслуг[Показатель.Ключ+"Ветви"];	
		КонецЦикла; 
		
		Если Отклонения.Сумма ИЛИ Отклонения.НДС ИЛИ Отклонения.Всего Тогда
			ОтклоненияСтр = "";
			Для Каждого Показатель Из Отклонения Цикл
				Если Показатель.Значение Тогда
					ОтклоненияСтр = ОтклоненияСтр + Показатель.Ключ + ": " + Формат(Показатель.Значение,"ЧДЦ=2") + "; ";	
				КонецЕсли; 	
			КонецЦикла; 
			ИтогиСтрокой = Новый ФорматированнаяСтрока(Новый ФорматированнаяСтрока(ИтогиПоДокументу),Новый ФорматированнаяСтрока("["+ Лев(ОтклоненияСтр,СтрДлина(ОтклоненияСтр)-1)+"]",,WebЦвета.Красный));	
		Иначе
			ИтогиСтрокой = Новый ФорматированнаяСтрока(ИтогиПоДокументу);
		КонецЕсли; 
	КонецЕсли; 
	//Сообщить(ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаСообщенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
КонецПроцедуры

&НаКлиенте
Процедура СчетСинхронизацияПриИзменении(Элемент)
	ПредставлениеСчета = ПредставлениеСчета(Счет);
	МожноФормировать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеСчета(Счет)
	Возврат ?(Счет.Пустая(),"к счету <...>","к счету: № "+Счет.НомерСчета + " от " + Формат(Счет.ДатаСчета,"ДФ=dd.MM.yyyy"))		
КонецФункции

&НаКлиенте
Процедура ДоговорСинхронизацияПриИзменении(Элемент)
	Валюта = ВалютаДоговора(Договор);
	УслугиПоДоговру();
	МожноФормировать();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПоДоговру()
	Если Договор.Пустая()Тогда Возврат КонецЕсли; 
	Ответ = СвойстваДоговора(Договор,?(ПредъявленАкт,ДатаАкта,ДатаСчета));
	ЗаполнитьЗначенияСвойств(ЭтаФорма,Ответ,"ЕстьОграниченияПоСпискуУслуг,ПорядокОтражения");	
	УслугиПоДоговору.Очистить();
	Элементы.УникальнаяНоменклатураНоменклатура.СписокВыбора.Очистить();
	Если ЕстьОграниченияПоСпискуУслуг Тогда
		Для Каждого Стр Из Ответ.УслугиПоДоговору Цикл
			ЗаполнитьЗначенияСвойств(УслугиПоДоговору.Добавить(),Стр);
			Элементы.УникальнаяНоменклатураНоменклатура.СписокВыбора.Добавить(Стр.Номенклатура);
		КонецЦикла; 
		Элементы.УникальнаяНоменклатураНоменклатура.РежимВыбораИзСписка 	= Истина;
		Элементы.УникальнаяНоменклатураНоменклатура.ИсторияВыбораПриВводе	= ИсторияВыбораПриВводе.НеИспользовать;
	Иначе	
		Элементы.УникальнаяНоменклатураНоменклатура.РежимВыбораИзСписка 	= Ложь;
		Элементы.УникальнаяНоменклатураНоменклатура.ИсторияВыбораПриВводе	= ИсторияВыбораПриВводе.Авто;
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвойстваДоговора(Договор,Дата)
	Ответ	= Новый Структура("ЕстьОграниченияПоСпискуУслуг,ПорядокОтражения,УслугиПоДоговору");
	Запрос	= Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ДоговорыПоГрузоперевозкам.ОграничиватьНоменклатуру КАК ЕстьОграниченияПоСпискуУслуг,
		|	CW_ПараметрыДоговоровСрезПоследних.ОсновнойПорядокОтраженияРасходов КАК ПорядокОтражения
		|ИЗ
		|	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПараметрыДоговоров.СрезПоследних(&Дата, Договор = &Договор) КАК CW_ПараметрыДоговоровСрезПоследних
		|		ПО CW_ПараметрыДоговоровСрезПоследних.Договор = CW_ДоговорыПоГрузоперевозкам.Ссылка
		|ГДЕ
		|	CW_ДоговорыПоГрузоперевозкам.Ссылка = &Договор";
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Дата", Дата);
	Выборка = Запрос.Выполнить().Выбрать();Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Ответ,Выборка);
	Если Выборка.ЕстьОграниченияПоСпискуУслуг Тогда
		Запрос = Новый Запрос;Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	CW_УслугиПоДоговоруГрузоперевозкиСрезПоследних.Договор КАК Договор,
			|	CW_УслугиПоДоговоруГрузоперевозкиСрезПоследних.УслугиПоДоговруГрузоперевозки КАК УслугиПоДоговруГрузоперевозки
			|ПОМЕСТИТЬ ВТ_ТекущийДокумент
			|ИЗ
			|	РегистрСведений.CW_УслугиПоДоговоруГрузоперевозки.СрезПоследних(&Дата, Договор = &Договор) КАК CW_УслугиПоДоговоруГрузоперевозкиСрезПоследних
			|ГДЕ
			|	(CW_УслугиПоДоговоруГрузоперевозкиСрезПоследних.УслугиПоДоговруГрузоперевозки.СрокДействия >= &Дата
			|			ИЛИ CW_УслугиПоДоговоруГрузоперевозкиСрезПоследних.УслугиПоДоговруГрузоперевозки.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.Номенклатура КАК Номенклатура,
			|	МАКСИМУМ(CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.ПорядокОтражения) КАК ПорядокОтражения
			|ИЗ
			|	Документ.CW_УслугиПоДоговоруГрузоперевозки.НоменклатураПоДоговору КАК CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору
			|ГДЕ
			|	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.Ссылка В
			|			(ВЫБРАТЬ
			|				ВТ_ТекущийДокумент.УслугиПоДоговруГрузоперевозки КАК УслугиПоДоговруГрузоперевозки
			|			ИЗ
			|				ВТ_ТекущийДокумент КАК ВТ_ТекущийДокумент)
			|
			|СГРУППИРОВАТЬ ПО
			|	CW_УслугиПоДоговоруГрузоперевозкиНоменклатураПоДоговору.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номенклатура
			|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Дата",		Дата);
		Запрос.УстановитьПараметр("Договор",	Договор);
		Выборка = Запрос.Выполнить().Выбрать();
		Ответ.УслугиПоДоговору = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Строка = Новый Структура("Номенклатура,ПорядокОтражения");
			ЗаполнитьЗначенияСвойств(Строка,Выборка);
			Ответ.УслугиПоДоговору.Добавить(Строка); 			
		КонецЦикла; 
	КонецЕсли; 
	Возврат Ответ 
КонецФункции


&НаСервере
Процедура ПодобратьГрузоперевозки()
	Для Каждого СтрГрузоперевозки Из Грузоперевозки Цикл
		МассивРеквизитов = Новый Массив;
		МассивПараметров = Новый Массив; 
		СтрокиОтбора	 = СтрГрузоперевозки.Параметры.НайтиСтроки(Новый Структура("Отбор",Истина));
		Если СтрокиОтбора.Количество() Тогда //И НЕ СтрГрузоперевозки.Автосинхронизация
			Для Каждого Парам Из СтрокиОтбора Цикл
				Если ТипЗнч(Парам.Параметр) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
					МассивПараметров.Добавить(Новый Структура("Параметр,Значение,Идентификатор",Парам.Параметр,Парам.Значение,Парам.Идентификатор)); 		
				Иначе
					МассивРеквизитов.Добавить(Новый Структура("Реквизит,Значение,Идентификатор",XMLстрока(Парам.Параметр),Парам.Значение,Парам.Идентификатор)); 		
				КонецЕсли; 	
			КонецЦикла; 	
		КонецЕсли;
		
		Если МассивРеквизитов.Количество() ИЛИ МассивПараметров.Количество() Тогда
			Запрос = Новый Запрос;
			Подходит = 0;
			Если МассивРеквизитов.Количество() Тогда
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	CW_Грузоперевозки.Ссылка КАК Ссылка,
				|	1 КАК Подходит
				|ПОМЕСТИТЬ ВТ_СсылкаПодхоит
				|ИЗ
				|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
				|ГДЕ";
				Для Каждого Стр Из МассивРеквизитов Цикл
					Запрос.Текст = Запрос.Текст + "
					|	CW_Грузоперевозки." + Стр.Реквизит + " = &Значение" + Стр.Идентификатор;
					Запрос.Параметры.Вставить("Значение" + Стр.Идентификатор,Стр.Значение);
					Подходит = Подходит + 1;
				КонецЦикла;
				Если МассивПараметров.Количество() Тогда
					Для Каждого Стр Из МассивПараметров Цикл
						Запрос.Текст = Запрос.Текст + "
						|
						|ОБЪЕДИНИТЬ ВСЕ
						|
						|ВЫБРАТЬ
						|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка,
						|	1
						|ИЗ
						|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
						|ГДЕ
						|	CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр" + Стр.Идентификатор + " 
						|	И CW_ХарактеристикиГрузоперевозок.Значение = &Значение" + Стр.Идентификатор;
						Запрос.Параметры.Вставить("Параметр" + Стр.Идентификатор,Стр.Параметр);
						Запрос.Параметры.Вставить("Значение" + Стр.Идентификатор,Стр.Значение);
						Подходит = Подходит + 1;
					КонецЦикла;
				КонецЕсли; 
			Иначе 
				Стр = МассивПараметров[0];
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Ссылка,
				|	1 КАК Подходит
				|ПОМЕСТИТЬ ВТ_СсылкаПодхоит
				|ИЗ
				|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
				|ГДЕ
				|	CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр" + Стр.Идентификатор + " 
				|	И CW_ХарактеристикиГрузоперевозок.Значение = &Значение" + Стр.Идентификатор;
				Запрос.Параметры.Вставить("Параметр" + Стр.Идентификатор,Стр.Параметр);
				Запрос.Параметры.Вставить("Значение" + Стр.Идентификатор,Стр.Значение);
				Подходит = Подходит + 1;
				Для Сч = 1 По МассивПараметров.Количество()-1  Цикл
					Стр = МассивПараметров[Сч];
					Запрос.Текст = Запрос.Текст + "
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка,
					|	1
					|ИЗ
					|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
					|ГДЕ
					|	CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр" + Стр.Идентификатор + " 
					|	И CW_ХарактеристикиГрузоперевозок.Значение = &Значение" + Стр.Идентификатор;
					Запрос.Параметры.Вставить("Параметр" + Стр.Идентификатор,Стр.Параметр);
					Запрос.Параметры.Вставить("Значение" + Стр.Идентификатор,Стр.Значение);
					Подходит = Подходит + 1;
				КонецЦикла; 
			КонецЕсли; 
			
			Запрос.Текст = Запрос.Текст + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_СсылкаПодхоит.Ссылка КАК Ссылка,
			|	СУММА(ВТ_СсылкаПодхоит.Подходит) КАК Подходит
			|ИЗ
			|	ВТ_СсылкаПодхоит КАК ВТ_СсылкаПодхоит
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_СсылкаПодхоит.Ссылка
			|
			|ИМЕЮЩИЕ
			|	СУММА(ВТ_СсылкаПодхоит.Подходит) = &Подходит";
			Запрос.Параметры.Вставить("Подходит",Подходит);
			СтрГрузоперевозки.Отбор.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
			СтрГрузоперевозки.ДоступенОтбор = СтрГрузоперевозки.Отбор.Количество();
			Если СтрГрузоперевозки.Отбор.Количество() = 1 И НЕ СтрГрузоперевозки.Автосинхронизация Тогда СтрГрузоперевозки.Грузоперевозка = СтрГрузоперевозки.Отбор[0].Значение; КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 			
КонецПроцедуры

#КонецОбласти 

#Область Синхронизация

&НаСервере
Процедура ПолучитьСинхронизацию()
	ПолучитьСсылку(РасходыСсылка,ПрофильОбмена,РасходыИдентификатор,"Документ.CW_РасходыПоГрузоперевозке");	
	ПолучитьСсылку(Договор,ПрофильОбмена,ДоговорИдентификатор,"Справочник.CW_ДоговорыПоГрузоперевозкам");Валюта = ВалютаДоговора(Договор);	
	Если НЕ ПродавецИдентификатор = "" Тогда
		ПолучитьСсылку(Продавец,ПрофильОбмена,ПродавецИдентификатор,"Справочник.Контрагенты");	
	КонецЕсли; 
	Если НЕ СчетИдентификатор = "" Тогда
		ПолучитьСсылку(Счет,ПрофильОбмена,СчетИдентификатор,"Документ.CW_РасходыПоГрузоперевозке");	
	КонецЕсли; 
	Для Каждого Стр Из Грузоперевозки Цикл
		ПолучитьГрузоперевозку(Стр,ПрофильОбмена);	
	КонецЦикла; 
	Для Каждого Стр Из УникальнаяНоменклатура Цикл
		ПолучитьСсылку(Стр.Номенклатура,ПрофильОбмена,Стр.Идентификатор,"Справочник.Номенклатура");Стр.Автосинхронизация = ЗначениеЗаполнено(Стр.Номенклатура);
	КонецЦикла; 
	Если СписокСчетов Тогда
		Для Каждого Стр Из УникальныеСчета Цикл
			ПолучитьСсылку(Стр.Счет,ПрофильОбмена,Стр.Идентификатор,"Документ.CW_РасходыПоГрузоперевозке");Стр.Автосинхронизация = ЗначениеЗаполнено(Стр.Счет);
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьГрузоперевозку(Стр,ПрофильОбмена)
	Если Стр.ДоступенСписокГрузоперевозок ИЛИ НЕ Стр.Грузоперевозка.Пустая() Тогда Возврат КонецЕсли; 
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_Синхронизация.Ссылка
		|ИЗ
		|	РегистрСведений.CW_DT_Синхронизация КАК CW_DT_Синхронизация
		|ГДЕ
		|	CW_DT_Синхронизация.ПрофильОбмена = &ПрофильОбмена
		|	И CW_DT_Синхронизация.Идентификатор = &Идентификатор
		|	И CW_DT_Синхронизация.ТипМетаданных = &ТипМетаданных";
	Запрос.УстановитьПараметр("ПрофильОбмена",	ПрофильОбмена);
	Запрос.УстановитьПараметр("Идентификатор",	Стр.Идентификатор);
	Запрос.УстановитьПараметр("ТипМетаданных",	CW_Обмены_ПИ.МетаданноеКонфигурации("Справочник.CW_Грузоперевозки"));
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Количество() = 1 Тогда
			Если Выборка.Следующий() Тогда
				Стр.Грузоперевозка = Выборка.Ссылка;
				Стр.Автосинхронизация = Истина;
			КонецЕсли 
		Иначе 
			Пока Выборка.Следующий() Цикл
				нСтр = Стр.СписокГрузоперевозок.Добавить();нСтр.Грузоперевозка = Выборка.Ссылка;
			КонецЦикла;
			Стр.ДоступенСписокГрузоперевозок = Истина;
			Стр.Автосинхронизация = Истина;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьСсылку(Ссылка,ПрофильОбмена,Идентификатор,Тип)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_DT_Синхронизация.Ссылка
		|ИЗ
		|	РегистрСведений.CW_DT_Синхронизация КАК CW_DT_Синхронизация
		|ГДЕ
		|	CW_DT_Синхронизация.ПрофильОбмена = &ПрофильОбмена
		|	И CW_DT_Синхронизация.Идентификатор = &Идентификатор
		|	И CW_DT_Синхронизация.ТипМетаданных = &ТипМетаданных";
	Запрос.УстановитьПараметр("ПрофильОбмена",ПрофильОбмена);
	Запрос.УстановитьПараметр("Идентификатор",Идентификатор);
	Запрос.УстановитьПараметр("ТипМетаданных",CW_Обмены_ПИ.МетаданноеКонфигурации(Тип));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ссылка = Выборка.Ссылка
	КонецЕсли 
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСинхро(Команда)
	ЗаписатьСинхронизацию()
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСинхронизацию()
	ЗаписатьСсылку(Договор,ПрофильОбмена,ДоговорИдентификатор,"Справочник.CW_ДоговорыПоГрузоперевозкам",ДоговорПредставление);	
	Если НЕ РасходыИдентификатор = ""	Тогда ЗаписатьСсылку(РасходыСсылка,ПрофильОбмена,РасходыИдентификатор,"Документ.CW_РасходыПоГрузоперевозке");КонецЕсли;	
	Если НЕ ПродавецИдентификатор = ""	Тогда ЗаписатьСсылку(Продавец,ПрофильОбмена,ПродавецИдентификатор,"Справочник.Контрагенты",ПродавецПредставление);КонецЕсли; 
	Если НЕ СчетИдентификатор = ""		Тогда ЗаписатьСсылку(Счет,ПрофильОбмена,СчетИдентификатор,"Документ.CW_РасходыПоГрузоперевозке",СчетПредставление);КонецЕсли; 
	Для Каждого Стр Из УникальнаяНоменклатура Цикл
		Если Стр.Автосинхронизация Тогда Продолжить;КонецЕсли; 
		ЗаписатьСсылку(Стр.Номенклатура,ПрофильОбмена,Стр.Идентификатор,"Справочник.Номенклатура",Стр.Представление);	
	КонецЦикла;
	Для Каждого Стр Из Грузоперевозки Цикл
		Если Стр.Автосинхронизация Тогда Продолжить;КонецЕсли; 
		ЗаписатьСсылку(?(Стр.ДоступенСписокГрузоперевозок,Стр.СписокГрузоперевозок.Выгрузить().ВыгрузитьКолонку("Грузоперевозка"),Стр.Грузоперевозка),ПрофильОбмена,Стр.Идентификатор,"Справочник.CW_Грузоперевозки",Стр.Представление);	
	КонецЦикла; 
	Если СписокСчетов Тогда
		Для Каждого Стр Из УникальныеСчета Цикл
			Если Стр.Автосинхронизация Тогда Продолжить;КонецЕсли; 
			ЗаписатьСсылку(Стр.Счет,ПрофильОбмена,Стр.Идентификатор,"Документ.CW_РасходыПоГрузоперевозке",Стр.Представление);	
		КонецЦикла; 	
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьСсылку(Ссылка,ПрофильОбмена,Идентификатор,Тип,Представление = "")
	
	ТипМетаданных =  CW_Обмены_ПИ.МетаданноеКонфигурации(Тип);
	
	НЗ = РегистрыСведений.CW_DT_Синхронизация.СоздатьНаборЗаписей();
	НЗ.Отбор.ПрофильОбмена.Установить(ПрофильОбмена);
	НЗ.Отбор.Идентификатор.Установить(Идентификатор);
	НЗ.Отбор.ТипМетаданных.Установить(ТипМетаданных);
	НЗ.Прочитать();
	НЗ.Очистить();
	
	Если ТипЗнч(Ссылка) = Тип("Массив") Тогда
		Для Каждого Стр Из Ссылка Цикл
			Запись = НЗ.Добавить();
			Запись.ПрофильОбмена	= ПрофильОбмена;
			Запись.Идентификатор	= Идентификатор;
			Запись.Ссылка			= Стр;
			Запись.ТипМетаданных	= ТипМетаданных;
			Запись.Представление	= Представление;
		КонецЦикла; 
	ИначеЕсли НЕ Ссылка.Пустая() Тогда  
		Запись = НЗ.Добавить();
		Запись.ПрофильОбмена		= ПрофильОбмена;
		Запись.Идентификатор		= Идентификатор;
		Запись.Ссылка				= Ссылка;
		Запись.ТипМетаданных		= ТипМетаданных;
		Запись.Представление		= Представление;
	КонецЕсли; 
	
	НЗ.Записать(Истина);
	
КонецПроцедуры 


#КонецОбласти 

#Область Грузоперевозки

&НаКлиенте
Процедура ГрузоперевозкиГрузоперевозкаПриИзменении(Элемент)
	ОбновитьГрузоперевозкуУслуг(Элементы.Грузоперевозки.ТекущиеДанные);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияПараметровГрузоперевозок(Идентификатор=Неопределено)
	Если ПоказыватьДопКолоноки Тогда
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи(Идентификатор));
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТД = Элемент.ТекущиеДанные;
	Если Поле.Имя = "ГрузоперевозкиАвтосинхронизация" И ТД.Автосинхронизация Тогда ТД.Автосинхронизация = Ложь;КонецЕсли;
	Если ТД.Автосинхронизация Тогда Возврат 
	ИначеЕсли Поле.Имя = "ГрузоперевозкиДоступенОтбор" И ТД.ДоступенОтбор Тогда
		ОП = Новый ОписаниеОповещения("ОбработкаВыбораИзСписка",ЭтаФорма,ТД); 
		ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора",Новый Структура("РежимВыбора,МножественныйВыбор,Отбор",Истина,ТД.ДоступенСписокГрузоперевозок,Новый Структура("Ссылка",ТД.Отбор)),,,,,ОП,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	ИначеЕсли Поле.Имя = "ГрузоперевозкиДоступенСписокГрузоперевозок" Тогда 
		ТД.ДоступенСписокГрузоперевозок = НЕ ТД.ДоступенСписокГрузоперевозок;
		Если ТД.ДоступенСписокГрузоперевозок Тогда
			Если НЕ ТД.Грузоперевозка.Пустая() Тогда
				ТД.СписокГрузоперевозок.Добавить().Грузоперевозка = ТД.Грузоперевозка;
				СписокГрузоперевозок.Добавить().Грузоперевозка = ТД.Грузоперевозка;
			КонецЕсли; 
			ТД.Грузоперевозка = Неопределено;
			//Элементы.ГруппаСписокГрузоперевозокДляБлокировки.Доступность = Истина;
			ОбновитьГрузоперевозкуУслуг(ТД);
		Иначе
			//Элементы.ГруппаСписокГрузоперевозокДляБлокировки.Доступность = Ложь;
			ОбновитьГрузоперевозкуУслуг(ТД);
			ТД.СписокГрузоперевозок.Очистить();
			СписокГрузоперевозок.Очистить();
		КонецЕсли;
	КонецЕсли; 
	МожноФормировать();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораИзСписка(Рез,ТД) Экспорт
	Если НЕ Рез = Неопределено Тогда
		Если ТД.ДоступенСписокГрузоперевозок Тогда
			Для Каждого Стр Из Рез Цикл
				Если НЕ ТД.СписокГрузоперевозок.НайтиСтроки(Новый Структура("Грузоперевозка",Стр)).Количество() Тогда
					ТД.СписокГрузоперевозок.Добавить().Грузоперевозка = Стр;		
					СписокГрузоперевозок.Добавить().Грузоперевозка = Стр;		
				КонецЕсли; 
			КонецЦикла; 
			ОбновитьГрузоперевозкуУслуг(ТД);
		Иначе 
			ТД.Грузоперевозка = Рез;
			ОбновитьГрузоперевозкуУслуг(ТД);
		КонецЕсли; 
		МожноФормировать();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиПриАктивизацииСтроки(Элемент)
	Если Элементы.Грузоперевозки.ТекущиеДанные = Неопределено Тогда
	//	//Элементы.ГруппаСписокГрузоперевозок.Скрыть();
	Иначе
		Если Элементы.Грузоперевозки.ТекущиеДанные.ДоступенСписокГрузоперевозок Тогда
			СписокГрузоперевозок.Очистить();
			//Элементы.ГруппаСписокГрузоперевозокДляБлокировки.Доступность = НЕ Элементы.Грузоперевозки.ТекущиеДанные.Автосинхронизация;
			Для Каждого Стр Из Элементы.Грузоперевозки.ТекущиеДанные.СписокГрузоперевозок Цикл
				нСтр = СписокГрузоперевозок.Добавить();	нСтр.Грузоперевозка = Стр.Грузоперевозка;
			КонецЦикла; 
			//Элементы.ГруппаСписокГрузоперевозок.Показать();
		Иначе 
			//Элементы.ГруппаСписокГрузоперевозокДляБлокировки.Доступность = Ложь;
			СписокГрузоперевозок.Очистить();
			//Элементы.ГруппаСписокГрузоперевозок.Скрыть()
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокГрузоперевозок(Идентификатор)
	ТекущаяСтрока = Грузоперевозки.НайтиПоИдентификатору(Идентификатор);
	СписокГрузоперевозок.Загрузить(ТекущаяСтрока.СписокГрузоперевозок.Выгрузить());
КонецПроцедуры
 
&НаСервере
Процедура ВыгрузитьСписокГрузоперевозок(Идентификатор)
	ТекущаяСтрока = Грузоперевозки.НайтиПоИдентификатору(Идентификатор);
	ТекущаяСтрока.СписокГрузоперевозок.Загрузить(СписокГрузоперевозок.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура СписокГрузоперевозокПриИзменении(Элемент)
	//Если НЕ ЗаблокироватьГрузоперевозки Тогда
	//	ЗаблокироватьГрузоперевозки = Истина;
	//	Элементы.ГруппаГрузоперевозки.Доступность = НЕ ЗаблокироватьГрузоперевозки;
	//	Элементы.СписокГрузоперевозокГруппаКнопокОк.Доступность = ЗаблокироватьГрузоперевозки;
	//КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СписокГрузоперевозокОк(Команда)
	Результат = СписокГрузоперевозокЕстьОшибки();
	Если Результат = Неопределено Тогда
		//ЗаблокироватьГрузоперевозки = Ложь;
		//Элементы.ГруппаГрузоперевозки.Доступность = НЕ ЗаблокироватьГрузоперевозки;
		//Элементы.СписокГрузоперевозокГруппаКнопокОк.Доступность = ЗаблокироватьГрузоперевозки;
		ВыгрузитьСписокГрузоперевозок(Элементы.Грузоперевозки.ТекущаяСтрока);
		МожноФормировать();
		ОбновитьГрузоперевозкуУслуг(Элементы.Грузоперевозки.ТекущиеДанные);
	Иначе
		ПоказатьПредупреждение(,Результат);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция СписокГрузоперевозокЕстьОшибки()
	Если НЕ СписокГрузоперевозок.Количество() Тогда
		Возврат "Список пуст!"
	ИначеЕсли СписокГрузоперевозок.НайтиСтроки(Новый Структура("Грузоперевозка",Справочники.CW_Грузоперевозки.ПустаяСсылка())).Количество() Тогда 
		Возврат "Есть пустые строки!"
	Иначе
		Таб = СписокГрузоперевозок.Выгрузить();Таб.Свернуть("Грузоперевозка");
		Если НЕ Таб.Количество() = СписокГрузоперевозок.Количество() Тогда
			Возврат "Есть дубли грузоперевозок!"
		КонецЕсли; 
	КонецЕсли; 	
КонецФункции
 
&НаКлиенте
Процедура СписокГрузоперевозокОтмена(Команда)
	//ЗаблокироватьГрузоперевозки = Ложь;
	//Элементы.ГруппаГрузоперевозки.Доступность = НЕ ЗаблокироватьГрузоперевозки;
	//Элементы.СписокГрузоперевозокГруппаКнопокОк.Доступность = ЗаблокироватьГрузоперевозки;
	ЗагрузитьСписокГрузоперевозок(Элементы.Грузоперевозки.ТекущаяСтрока);
КонецПроцедуры

//&НаКлиенте
//Процедура ДоступенСписокГрузоперевозок()
//	ДоступенСписокГрузоперевозок = Грузоперевозки.НайтиСтроки(Новый Структура("ДоступенСписокГрузоперевозок",Истина)).Количество() 	
//КонецПроцедуры

&НаКлиенте
Процедура СписокГрузоперевозокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекущиеДанные = Элементы.Грузоперевозки.ТекущиеДанные;Если ТекущиеДанные = Неопределено Тогда Отказ = Истина; Возврат;КонецЕсли; 
	Отказ = НЕ ТекущиеДанные.ДоступенСписокГрузоперевозок;
КонецПроцедуры


#КонецОбласти 

#Область Номенклатура

&НаКлиенте
Процедура УникальнаяНоменклатураНоменклатураПриИзменении(Элемент)
	ОбновитьНоменклатуруУслуг(Элементы.УникальнаяНоменклатура.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УникальнаяНоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТД = Элемент.ТекущиеДанные;
	Если Поле.Имя = "УникальнаяНоменклатураАвтосинхронизация" И ТД.Автосинхронизация Тогда
		ТД.Автосинхронизация = Ложь;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область Счета

&НаКлиенте
Процедура УникальныеСчетаСчетПриИзменении(Элемент)
	ОбновитьСчетУслуг(Элементы.УникальныеСчета.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УникальныеСчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТД = Элемент.ТекущиеДанные;
	Если Поле.Имя = "УникальныеСчетаАвтосинхронизация" И ТД.Автосинхронизация Тогда
		ТД.Автосинхронизация = Ложь;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область Услуги

&НаКлиенте
Функция УслугиНайтиСтроки(Структура)
	Ответ = Новый Массив;
	Для Каждого Стр Из Услуги.ПолучитьЭлементы() Цикл
		Если Стр[Структура.Реквизит] = Структура.Значение Тогда
			Ответ.Добавить(Стр);		
		КонецЕсли; 		
	КонецЦикла; 	
	Возврат Ответ
КонецФункции

&НаСервереБезКонтекста
Функция ПокупательДоговор(Грузоперевозка,ПорядокОтражения,Организация)
	Ответ = Новый Структура("Покупатель,ДоговорПокупателя"); 
	Если ПорядокОтражения	= Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление И НЕ Грузоперевозка.Пустая() Тогда
		Ответ.Покупатель	= ПокупательПоГрузоперевозке(Грузоперевозка);
		Если НЕ Ответ.Покупатель = Неопределено Тогда
			Ответ.ДоговорПокупателя	= ДоговорГрузоперевозки(Грузоперевозка, Ответ.Покупатель);
			Если Ответ.ДоговорПокупателя = Неопределено Тогда
				Ответ.ДоговорПокупателя = ПоследнийДоговорКонтрагента(Ответ.Покупатель,Организация);
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ
КонецФункции

&НаСервереБезКонтекста
Функция ПокупательПоГрузоперевозке(Грузоперевозка)
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ХарактеристикиГрузоперевозок.Значение КАК Покупатель
		|ИЗ
		|	Константа.CW_ПараметрПлательщика КАК CW_ПараметрПлательщика,
		|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
		|ГДЕ
		|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка = &Грузоперевозка
		|	И CW_ХарактеристикиГрузоперевозок.Параметр = CW_ПараметрПлательщика.Значение
		|	И НЕ CW_ПараметрПлательщика.Значение = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.)
		|	И НЕ (ВЫРАЗИТЬ(CW_ХарактеристикиГрузоперевозок.Значение КАК Справочник.Контрагенты)) = ЗНАЧЕНИЕ(Справочник.Контрагенты.)";
	Запрос.УстановитьПараметр("Грузоперевозка", Грузоперевозка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_Грузоперевозки.Клиент КАК Клиент
		|ИЗ
		|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
		|ГДЕ
		|	CW_Грузоперевозки.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Грузоперевозка);
		Выборка = Запрос.Выполнить().Выбрать();Выборка.Следующий();
		Возврат Выборка.Клиент
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();Выборка.Следующий();
		Возврат Выборка.Покупатель
	КонецЕсли; 
	//Возврат CW_Финансы.ВернутьПлательщика(Новый Структура("Объект,ЭтоВариантБюджета,Контрагент",Грузоперевозка,Ложь,Грузоперевозка.Клиент));
КонецФункции

&НаСервереБезКонтекста
Функция ПоследнийДоговорКонтрагента(Контрагент,Организация)
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ПоследниеИспользованныеДоговоры.Договор КАК Договор
		|ИЗ
		|	РегистрСведений.CW_ПоследниеИспользованныеДоговоры КАК CW_ПоследниеИспользованныеДоговоры
		|ГДЕ
		|	CW_ПоследниеИспользованныеДоговоры.Контрагент = &Контрагент
		|	И CW_ПоследниеИспользованныеДоговоры.Организация = &Организация
		|	И CW_ПоследниеИспользованныеДоговоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();Выборка.Следующий();
	Возврат Выборка.Договор
	//Возврат CW_Документы.ПолучитьПоследнийДоговор(Контрагент,Организация,Перечисления.ВидыДоговоровКонтрагентов.СПокупателем)
КонецФункции

&НаСервереБезКонтекста
Функция ДоговорГрузоперевозки(Грузоперевозка,Плательщик)
	Запрос	= Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ХарактеристикиГрузоперевозок.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок,
		|	Константа.CW_ПараметрДоговораПлательщика КАК CW_ПараметрДоговораПлательщика
		|ГДЕ
		|	CW_ХарактеристикиГрузоперевозок.Грузоперевозка = &Грузоперевозка
		|	И CW_ХарактеристикиГрузоперевозок.Параметр = CW_ПараметрДоговораПлательщика.Значение
		|	И ВЫРАЗИТЬ(CW_ХарактеристикиГрузоперевозок.Значение КАК Справочник.CW_ДоговорыПоГрузоперевозкам).Владелец = &Плательщик";
	Запрос.УстановитьПараметр("Грузоперевозка",Грузоперевозка);
	Запрос.УстановитьПараметр("Плательщик",Плательщик);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Значение;
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура УслугиПорядокОтраженияПриИзменении(Элемент)
	ЗаполнитьЗначенияСвойств(Элементы.Услуги.ТекущиеДанные,ПокупательДоговор(Элементы.Услуги.ТекущиеДанные.Грузоперевозка,Элементы.Услуги.ТекущиеДанные.ПорядокОтражения,Организация));
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПокупательПриИзменении(Элемент)
	Элементы.Услуги.ТекущиеДанные.ДоговорПокупателя = ПоследнийДоговорКонтрагента(Элементы.Услуги.ТекущиеДанные.Покупатель,Организация);	
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура УслугиДоговорПокупателяПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	СвернутьРекурсивно(Услуги.ПолучитьЭлементы()); 
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРекурсивно(Ветви)
	Для Каждого Ветвь Из Ветви Цикл
		СвернутьРекурсивно(Ветвь.ПолучитьЭлементы());
		Элементы.Услуги.Свернуть(Ветвь.ПолучитьИдентификатор());
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	Для Каждого Стр Из Услуги.ПолучитьЭлементы() Цикл
		Элементы.Услуги.Развернуть(Стр.ПолучитьИдентификатор(),Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНоменклатуруУслуг(ТекущиеДанные)
	Для Каждого Стр Из УслугиНайтиСтроки(Новый Структура("Реквизит,Значение","НоменклатураИдентификатор",ТекущиеДанные.Идентификатор)) Цикл
		Стр.Номенклатура = ТекущиеДанные.Номенклатура;		
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСчетУслуг(ТекущиеДанные)
	Для Каждого Стр Из УслугиНайтиСтроки(Новый Структура("Реквизит,Значение","СчетИдентификатор",ТекущиеДанные.Идентификатор)) Цикл
		Стр.Счет = ТекущиеДанные.Счет;		
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГрузоперевозкуУслуг(ТекущиеДанные)
	ТекущиеДанные.Ошибка = ?(ТекущиеДанные.ДоступенСписокГрузоперевозок,НЕ ТекущиеДанные.СписокГрузоперевозок.Количество(),ТекущиеДанные.Грузоперевозка.Пустая());
	Для Каждого Стр Из УслугиНайтиСтроки(Новый Структура("Реквизит,Значение","ГрузоперевозкаИдентификатор",ТекущиеДанные.Идентификатор)) Цикл
		Ветви = Стр.ПолучитьЭлементы();Ветви.Очистить();
		Если ТекущиеДанные.ДоступенСписокГрузоперевозок Тогда
			Для Каждого Парам Из СписокВыбранныеКолонки Цикл Стр["_"+Парам.Значение] = Неопределено;КонецЦикла; 
			СтруктураВетви = Новый Структура("Ветвь,Учитывать,ПорядокОтражения",Истина,Истина,ПолучитьПорядокОтражения(Стр.Номенклатура)); 
			ЗаполнитьЗначенияСвойств(Стр,Новый Структура("Корень,Ветвь,ПорядокОтражения,Грузоперевозка,Покупатель,ДоговорПокупателя,КоличествоВетви,ЦенаВетви,НДСВетви,СуммаВетви,ВсегоВетви",Истина,Ложь)); 
			Для Каждого Эл Из ТекущиеДанные.СписокГрузоперевозок Цикл
				Ветвь = Ветви.Добавить();ЗаполнитьЗначенияСвойств(Ветвь,СтруктураВетви);
				Ветвь.Грузоперевозка = Эл.Грузоперевозка;ЗаполнитьЗначенияСвойств(Ветвь,ПокупательДоговор(Ветвь.Грузоперевозка,Ветвь.ПорядокОтражения,Организация));	
			КонецЦикла; 
		Иначе Стр.Грузоперевозка = ТекущиеДанные.Грузоперевозка; 
			Стр.ПорядокОтражения = ?(Стр.ПорядокОтражения.Пустая(),ПолучитьПорядокОтражения(Стр.Номенклатура),Стр.ПорядокОтражения);
			ЗаполнитьЗначенияСвойств(Стр,Новый Структура("Корень,Учитывать,КоличествоВетви,ЦенаВетви,НДСВетви,СуммаВетви,ВсегоВетви",Ложь,Истина)); 
			ЗаполнитьЗначенияСвойств(Стр,ПокупательДоговор(Стр.Грузоперевозка,Стр.ПорядокОтражения,Организация));	
		КонецЕсли; 		
	КонецЦикла;        
	Если ПоказыватьДопКолоноки Тогда
		ОбновитьЗначенияПараметровГрузоперевозок(ТекущиеДанные.Идентификатор);	
	КонецЕсли; 
	ИтогиСтрокой();
КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьЗначенияУслуг()
	Для Каждого Стр Из Грузоперевозки Цикл
		Стр.Ошибка = Истина;
		Если ЗначениеЗаполнено(Стр.Грузоперевозка) ИЛИ Стр.ДоступенСписокГрузоперевозок Тогда
			ОбновитьГрузоперевозкуУслуг(Стр)	
		КонецЕсли; 	
	КонецЦикла; 	
	Для Каждого Стр Из УникальнаяНоменклатура Цикл
		Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			ОбновитьНоменклатуруУслуг(Стр)	
		КонецЕсли; 
	КонецЦикла; 	
	Для Каждого Стр Из УникальныеСчета Цикл
		Если ЗначениеЗаполнено(Стр.Счет) Тогда
			ОбновитьСчетУслуг(Стр)	
		КонецЕсли; 
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриАктивизацииСтроки(Элемент)
	ИтогиСтрокой();
	//Сообщить(ТекущаяУниверсальнаяДатаВМиллисекундах()-Замер);
КонецПроцедуры

&НаКлиенте
Процедура УслугиУчитыватьПриИзменении(Элемент)
	Если НЕ Элементы.Услуги.ТекущиеДанные.Учитывать Тогда
		ОбнулитьЧисловыеПоказатели(Элементы.Услуги.ТекущиеДанные);
		Элементы.Услуги.ТекущиеДанные.Покупатель		= Неопределено;
		Элементы.Услуги.ТекущиеДанные.ДоговорПокупателя	= Неопределено;
		Элементы.Услуги.ТекущиеДанные.ПорядокОтражения	= Неопределено;
		РассчитатьКорень(Услуги.НайтиПоИдентификатору(Элементы.Услуги.ТекущиеДанные.ПолучитьРодителя().ПолучитьИдентификатор()));
	КонецЕсли; 
	ИтогиСтрокой();
КонецПроцедуры

#Область Расчет

&НаКлиенте
Процедура Услуги_РаспределитьРавномерно(Команда)
	Ответ = Новый Структура("ВариантРаспределения,ПараметрРаспределения",0);//,ПараметрРаспределения); 
	ВыборВарианта(Ответ,"")
КонецПроцедуры

&НаКлиенте
Процедура Услуги_РаспределитьПропроционально(Команда)
	Ответ = Новый Структура("ВариантРаспределения,ПараметрРаспределения",2,ПараметрРаспределения);//); 
	ВыборВарианта(Ответ,"")
КонецПроцедуры

&НаКлиенте
Процедура ВыборВарианта(Ответ,ДП)Экспорт
	Если НЕ Ответ = Неопределено Тогда
		Пересчитать = Новый Массив;
		Для Каждого Стр Из Элементы.Услуги.ВыделенныеСтроки Цикл
			Элемент = Услуги.НайтиПоИдентификатору(Стр);Если НЕ Элемент.Корень И НЕ Элемент.Ветвь Тогда Возврат;КонецЕсли; 
			Корень = Услуги.НайтиПоИдентификатору(?(Элемент.Корень,Элемент.ПолучитьИдентификатор(),Элемент.ПолучитьРодителя().ПолучитьИдентификатор()));
			Если Пересчитать.Найти(Корень) = Неопределено Тогда Пересчитать.Добавить(Корень);КонецЕсли; 
		КонецЦикла; 
		Для Каждого Корень Из Пересчитать Цикл
			Расчет(Ответ,Корень);	
			РассчитатьКорень(Корень);
			РаспределитьРазницу(Корень);
			РассчитатьКорень(Корень);
		КонецЦикла; 
		МожноФормировать();
		ИтогиСтрокой();
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура УслугиРасчетныеКолонкиПриИзменении(Элемент)
	РассчитатьКорень(Элементы.Услуги.ТекущиеДанные.ПолучитьРодителя()); 
	ИтогиСтрокой();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКорень(Корень)
	ЗаполнитьЗначенияСвойств(Корень,Новый Структура("КоличествоВетви,ЦенаВетви,НДСВетви,СуммаВетви,ВсегоВетви",0,0,0,0,0)); 
	Для Каждого Ветвь Из Корень.ПолучитьЭлементы() Цикл
		Если Ветвь.Учитывать Тогда
			Корень.КоличествоВетви	= Корень.КоличествоВетви + Ветвь.Количество;		
			Корень.ЦенаВетви		= Корень.ЦенаВетви + Ветвь.Цена;		
			Корень.СуммаВетви		= Корень.СуммаВетви + Ветвь.Сумма;		
			Корень.НДСВетви			= Корень.НДСВетви + Ветвь.НДС;		
			Корень.ВсегоВетви		= Корень.ВсегоВетви + Ветвь.Всего;		
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьРазницу(Корень)
	Ветви = Ветви(Корень);
	Если Ветви.Количество() Тогда
		Ветвь = Ветви[Ветви.Количество()-1];	
		Ветвь.Количество= Ветвь.Количество + Корень.Количество - Корень.КоличествоВетви;		
		Ветвь.Сумма		= Ветвь.Сумма + Корень.Сумма - Корень.СуммаВетви;		
		Ветвь.НДС		= Ветвь.НДС + Корень.НДС - Корень.НДСВетви;		
		Ветвь.Всего		= Ветвь.Всего + Корень.Всего - Корень.ВсегоВетви;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Расчет(Ответ,Корень)
	
	Ветви = Ветви(Корень);

	// вариант распределения суммы
	// 0 - на все г/п
	// 1 - на каждую г/п
	// 2 - пропорционально параметру
	// 3 - пропорционально выручке
	
	СуммаУслуги			= Корень.Всего;
	ОбратныйПересчет	= Истина;
	
	// распределение по параметру
	Если Ответ.ВариантРаспределения = 2 Тогда 
		Массив = Новый Массив;
		Для Каждого Ветвь Из Ветви Цикл
			Массив.Добавить(Ветвь.Грузоперевозка);
		КонецЦикла;
		
		База = ПолучитьБазуРаспределения(Массив,Ответ.ПараметрРаспределения);
		БазаРаспределенияПоПараметру	= База.БазаРаспределенияПоПараметру;
		СоответствиеЗначенийПараметра	= База.СоответствиеЗначенийПараметра;
		
		Если БазаРаспределенияПоПараметру = 0 Тогда
			СуммаУслуги = 0;
		КонецЕсли; 
	КонецЕсли;
	
	// проверяем вариант распределения
	Если Ответ.ВариантРаспределения = 0 ИЛИ Ответ.ВариантРаспределения = 2 Тогда
		ОстатокРаспределения = СуммаУслуги;
	КонецЕсли; 
	
	Ставка = CW_Финансы.ПолучитьСтавкуНДС(Корень.СтавкаНДС);
	
	// ЗАПОЛНЯЕМ
	Индекс=0;
	Для каждого Ветвь Из Ветви Цикл
		Индекс = Индекс + 1;
		Ветвь.Количество = Корень.Количество;
		
		Если СуммаУслуги Тогда
			// на все г/п
			Если Ответ.ВариантРаспределения = 0 Тогда 
				Если ОбратныйПересчет Тогда
					Ветвь.Всего = СуммаУслуги/Ветви.Количество();
					ОстатокРаспределения = ОстатокРаспределения - Ветвь.Всего;
				Иначе
					Ветвь.Сумма = СуммаУслуги/Ветви.Количество();
					ОстатокРаспределения = ОстатокРаспределения - Ветвь.Сумма;
				КонецЕсли; 
				Ветвь.Количество = Корень.Количество/Ветви.Количество();
				Если Ветви.Количество()=Индекс Тогда
					Если ОбратныйПересчет Тогда
						Ветвь.Всего	= Ветвь.Всего + ОстатокРаспределения;
					Иначе
						Ветвь.Сумма = Ветвь.Сумма + ОстатокРаспределения;	
					КонецЕсли; 
				КонецЕсли; 
			// по параметру
			ИначеЕсли Ответ.ВариантРаспределения = 2 Тогда 
				Если ОбратныйПересчет Тогда
					Ветвь.Всего = СуммаУслуги*СоответствиеЗначенийПараметра.Получить(Ветвь.Грузоперевозка)/БазаРаспределенияПоПараметру;
					ОстатокРаспределения = ОстатокРаспределения - Ветвь.Всего;
				Иначе
					Ветвь.Сумма = СуммаУслуги*СоответствиеЗначенийПараметра.Получить(Ветвь.Грузоперевозка)/БазаРаспределенияПоПараметру;
					ОстатокРаспределения = ОстатокРаспределения - Ветвь.Сумма;
				КонецЕсли; 
				Ветвь.Количество = Корень.Количество*СоответствиеЗначенийПараметра.Получить(Ветвь.Грузоперевозка)/БазаРаспределенияПоПараметру;
				Если Ветви.Количество()=Индекс Тогда
					Если ОбратныйПересчет Тогда
						Ветвь.Всего	= Ветвь.Всего + ОстатокРаспределения;
					Иначе
						Ветвь.Сумма = Ветвь.Сумма + ОстатокРаспределения;	
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; 
			Если ОбратныйПересчет Тогда
				Ветвь.НДС 	= Ветвь.Всего*(Ставка/(100+Ставка));
				Ветвь.Сумма = Ветвь.Всего-Ветвь.НДС;
				Ветвь.Цена 	= ?(Ветвь.Количество = 0,0,Ветвь.Сумма/Ветвь.Количество);
			Иначе
				Ветвь.Цена 	= ?(Ветвь.Количество = 0,0,Ветвь.Сумма/Ветвь.Количество);
				Ветвь.НДС 	= Ветвь.Сумма*(Ставка/100);
				Ветвь.Всего = Ветвь.Сумма+Ветвь.НДС;
			КонецЕсли; 
		Иначе ОбнулитьЧисловыеПоказатели(Ветвь);
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция Ветви(Корень)
	Ветви = Новый Массив;
	Для Каждого Ветвь Из Корень.ПолучитьЭлементы() Цикл
		Если Ветвь.Учитывать Тогда
			Ветви.Добавить(Ветвь);		
		КонецЕсли; 	
	КонецЦикла; 
	Возврат Ветви
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьБазуРаспределения(Грузоперевозки,Параметр)
	СоответствиеЗначенийПараметра	= Новый Соответствие;
	БазаРаспределенияПоПараметру	= 0;
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_Грузоперевозки.Ссылка КАК Грузоперевозка
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
		|ГДЕ
		|	CW_Грузоперевозки.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Грузоперевозка КАК Грузоперевозка,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(CW_ХарактеристикиГрузоперевозок.Значение, 0) КАК ЧИСЛО) КАК Значение
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
		|		ПО ВТ.Грузоперевозка = CW_ХарактеристикиГрузоперевозок.Грузоперевозка
		|			И (CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр)";
	Запрос.УстановитьПараметр("Ссылка", Грузоперевозки);
	Запрос.УстановитьПараметр("Параметр", Параметр);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеЗначенийПараметра.Вставить(Выборка.Грузоперевозка,Выборка.Значение);
		БазаРаспределенияПоПараметру = БазаРаспределенияПоПараметру+Выборка.Значение;
	КонецЦикла;
	Возврат Новый Структура("СоответствиеЗначенийПараметра,БазаРаспределенияПоПараметру",СоответствиеЗначенийПараметра,БазаРаспределенияПоПараметру) 
КонецФункции

&НаКлиенте
Процедура ОбнулитьЧисловыеПоказатели(Элемент)
	ЗаполнитьЗначенияСвойств(Элемент,Новый Структура("Количество,Цена,Сумма,НДС,Всего",0,0,0,0,0));
КонецПроцедуры


#КонецОбласти 

#Область ДопКолонки

&НаКлиенте
Процедура Услуги_ПоказыватьДопКолоноки(Команда)
	ПоказыватьДопКолоноки							= НЕ ПоказыватьДопКолоноки;
	Элементы.УслугиДополнительныеКолонки.Видимость	= ПоказыватьДопКолоноки;
	Элементы.Услуги_ПоказыватьДопКолоноки.Пометка	= ПоказыватьДопКолоноки;
	Если ПоказыватьДопКолоноки Тогда
		ОбновитьЗначенияПараметровГрузоперевозок();	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Услуги_НастройкаКолонок_ОбновитьЗначения(Команда)
	ОбновитьЗначенияПараметровнаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Услуги_НастройкаКолонок(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаЗначений",	ПоместитьВоВременноеХранилище(СписокДополнительныхКолонок));
	ПараметрыФормы.Вставить("СписокСПометками",		Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы",		"Дополнительные колонки");
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораСпискаПараметров", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораИзСписка",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораСпискаПараметров(Результат, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		ОбработатьРезультатВыбораКолонок(Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнитьДинамическиеКолонки(ФормаОбъекта)
	
    МассивДобавляемыхКолонокРезультатПоиска = Новый Массив;
	МассивУдаляемыхКолонокРезультатПоиска 	 = Новый Массив;
	
	мТипыРеквизитв = Новый Массив;
	мТипыРеквизитв.Добавить(Тип("Строка"));
	мТипыРеквизитв.Добавить(Тип("Число"));
	мТипыРеквизитв.Добавить(Тип("Дата"));
	мТипыРеквизитв.Добавить(Тип("Булево"));
	мТипыРеквизитв.Добавить(Справочники.ТипВсеСсылки());
	
	РеквизитыТаблицы = ФормаОбъекта.ПолучитьРеквизиты("Услуги");
	
	мРеквизитыТаблицы = Новый массив;
	Для Каждого Реквизит из РеквизитыТаблицы Цикл
		мРеквизитыТаблицы.Добавить(Реквизит.имя);
	КонецЦикла;

	СписокДобавляемыхДополнительныхКолонок = новый СписокЗначений;
	
	Для Каждого ЭлементСписка из ФормаОбъекта.СписокДополнительныхКолонок Цикл
		Если ЭлементСписка.Пометка тогда
			//РезультатПоиска
			Если мРеквизитыТаблицы.Найти("_"+ЭлементСписка.Значение) = Неопределено Тогда
				МассивДобавляемыхКолонокРезультатПоиска.Добавить(Новый РеквизитФормы("_"+ЭлементСписка.Значение, Новый ОписаниеТипов(мТипыРеквизитв), "Услуги",ЭлементСписка.Представление,Ложь));
			КонецЕсли;
			СписокДобавляемыхДополнительныхКолонок.Добавить(ЭлементСписка.Значение,ЭлементСписка.Представление,ЭлементСписка.Пометка); 
		Иначе
			УдаляемыйРеквизит = мРеквизитыТаблицы.Найти("_"+ЭлементСписка.Значение);
			Если УдаляемыйРеквизит <> Неопределено Тогда
				МассивУдаляемыхКолонокРезультатПоиска.Добавить("Услуги."+мРеквизитыТаблицы[УдаляемыйРеквизит]);
			КонецЕсли;
		КонецЕсли
	КонецЦикла;
	
	//РезультатПоиска
	ФормаОбъекта.ИзменитьРеквизиты(МассивДобавляемыхКолонокРезультатПоиска,МассивУдаляемыхКолонокРезультатПоиска);
	
	//Выводим на форме
	РасположениеКолонок = ФормаОбъекта.Элементы.Найти("УслугиДополнительныеКолонки");
	Если РасположениеКолонок = Неопределено тогда
		РасположениеКолонок = ФормаОбъекта.Элементы.Услуги;
	Конецесли;
	
	ВсегоКолонок = СписокДобавляемыхДополнительныхКолонок.Количество();
	Индекс = 0;
	
	СооветствиеГрупп = новый Соответствие;
	Для Индекс = 0 По  ВсегоКолонок Цикл
		Если Индекс%2 = 0 Тогда
			НайденныйЭлемент = ФормаОбъекта.Элементы.Найти("УслугиДополнительныеКолонки_"+Формат(Индекс,"ЧГ=0"));
			Если найденныйЭлемент <> Неопределено Тогда
				//Удаляем с формы
				ФормаОбъекта.Элементы.Удалить(НайденныйЭлемент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Для Индекс = 0 По  ВсегоКолонок Цикл
		Если Индекс%2 = 0 Тогда
			НайденныйЭлемент = ФормаОбъекта.Элементы.Найти("УслугиДополнительныеКолонки_"+Формат(Индекс,"ЧГ=0"));
			Если найденныйЭлемент = Неопределено Тогда
				
				нЭлемент 				= ФормаОбъекта.Элементы.Добавить("УслугиДополнительныеКолонки_"+Формат(Индекс,"ЧГ=0"), Тип("ГруппаФормы"), РасположениеКолонок); 
				нЭлемент.Группировка 	= ГруппировкаКолонок.Вертикальная; 
				нЭлемент.ТолькоПросмотр = истина;
			КонецЕсли;
			
			СооветствиеГрупп.Вставить(Индекс, нЭлемент); 
		КонецЕсли;
	КонецЦикла;

	Для Каждого ЭлементСписка  из ФормаОбъекта.СписокДополнительныхКолонок Цикл
		//РезультатПоиска_
		НайденныйЭлемент = ФормаОбъекта.Элементы.Найти("Услуги_"+ЭлементСписка.Значение);
		Если найденныйЭлемент <> Неопределено Тогда
			//Удаляем с формы
			ФормаОбъекта.Элементы.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	Индекс = 0;
	Для Каждого ЭлементСписка  из СписокДобавляемыхДополнительныхКолонок Цикл
		
		Если Индекс%2 = 0 Тогда
			РасположениеКолонок = СооветствиеГрупп.Получить(Индекс);
		КонецЕсли;
		
		Если ФормаОбъекта.Элементы.Найти("Услуги_"+ЭлементСписка.Значение) = Неопределено  тогда
			//РезультатПоиска
			нЭлемент 				= ФормаОбъекта.Элементы.Добавить("Услуги_"+ЭлементСписка.Значение, Тип("ПолеФормы"), РасположениеКолонок); 
			нЭлемент.Вид 			= ВидПоляФормы.ПолеВвода; 
			нЭлемент.ПутьКДанным 	= "Услуги."+"_"+ЭлементСписка.Значение;
			нЭлемент.ТолькоПросмотр = истина;
		Конецесли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокДополнительныхКолонокФормы(ФормаОбъекта) Экспорт
	ФормаОбъекта.СписокДополнительныхКолонок.Очистить();
	СоответствиеПараметров = Новый Соответствие;
	Справочники.CW_Грузоперевозки.ПолучитьСписокРеквизитовШапкиДляВыводаНаФорму(СоответствиеПараметров, ФормаОбъекта.СписокДополнительныхКолонок);
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучиьСписокПараметровДляВыводаНаФорму(СоответствиеПараметров, ФормаОбъекта.СписокДополнительныхКолонок);
	ФормаОбъекта.СписокДоступныхПараметров.Добавить(СоответствиеПараметров);	
	Настройки = ХранилищеСистемныхНастроек.Загрузить("CWDT.ЗагрузкаРасходов.Форма","Сеансовая");
	Если Настройки <> Неопределено Тогда
		Если Настройки.Свойство("ВыбранныеКолонки") Тогда
			ФормаОбъекта.СписокВыбранныеКолонки.ЗагрузитьЗначения(Настройки.ВыбранныеКолонки);
			Для Каждого ЭлементМассива из Настройки.ВыбранныеКолонки Цикл
				ЭлементСписка = ФормаОбъекта.СписокДополнительныхКолонок.НайтиПоЗначению(ЭлементМассива);
				Если ЭлементСписка <> Неопределено Тогда
					ЭлементСписка.Пометка = истина;
				КонецЕсли;
			КонецЦикла;
			ДополнитьДинамическиеКолонки(ФормаОбъекта);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатВыбораКолонок(Результат)
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		СписокКолонок = ПолучитьИзВременногоХранилища(Результат);
		СписокДополнительныхКолонок.Очистить();
		СписокВыбранныеКолонки.Очистить();
		Для Каждого ЭлементСписка из СписокКолонок Цикл
			СписокДополнительныхКолонок.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, ЭлементСписка.Пометка);
			Если ЭлементСписка.Пометка Тогда
				СписокВыбранныеКолонки.Добавить(ЭлементСписка.Значение);	
			КонецЕсли;
		КонецЦикла;
		ДополнитьДинамическиеКолонки(ЭтаФорма);
		_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметровДляПередачи(Идентификатор=Неопределено)
	
	мГрузоперевозки			= Новый Массив;
	ТаблицаДокумента		= Новый Массив;
	СоответствиеПараметров	= Неопределено;
	
	Если СписокДоступныхПараметров.Количество() Тогда
		СоответствиеПараметров = СписокДоступныхПараметров[0].Значение;
	КонецЕсли;
	
	Если Идентификатор=Неопределено Тогда
		ЭлементыУслуг = Услуги.ПолучитьЭлементы();	
	Иначе
		ЭлементыУслуг = Новый Массив;
		Для Каждого Элемент Из Услуги.ПолучитьЭлементы() Цикл
			Если Элемент.ГрузоперевозкаИдентификатор = Идентификатор Тогда ЭлементыУслуг.Добавить(Элемент);КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Для Каждого Элемент Из ЭлементыУслуг Цикл
		Если Элемент.Корень Тогда
			Для Каждого Ветвь Из Элемент.ПолучитьЭлементы() Цикл
				Если мГрузоперевозки.Найти(Ветвь.Грузоперевозка)=Неопределено Тогда мГрузоперевозки.Добавить(Ветвь.Грузоперевозка);КонецЕсли; 		
				ТаблицаДокумента.Добавить(Ветвь);		
			КонецЦикла; 
		Иначе 
			Если мГрузоперевозки.Найти(Элемент.Грузоперевозка)=Неопределено Тогда мГрузоперевозки.Добавить(Элемент.Грузоперевозка);КонецЕсли; 		
			ТаблицаДокумента.Добавить(Элемент);		
		КонецЕсли; 
	КонецЦикла; 

	Возврат Новый Структура("Объект,ВыбранныеКолонки,СоответствиеПараметров,ТаблицаДокумента,мГрузоперевозки",Объект,СписокВыбранныеКолонки.ВыгрузитьЗначения(),СоответствиеПараметров,ТаблицаДокумента,мГрузоперевозки);
	
КонецФункции

&НаСервере
Процедура ОбновитьЗначенияПараметровнаСервере()
	_УФС.ОбновитьЗначенияПараметровГрузоперевозок(ПолучитьСтруктуруПараметровДляПередачи());	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура Услуги_ЗаполнитьПроядокОтражения(Команда)
	Для Каждого Элемент Из Услуги.ПолучитьЭлементы() Цикл
		Если Элемент.Корень Тогда
			Для Каждого Ветвь Из Элемент.ПолучитьЭлементы() Цикл
				Если НЕ Ветвь.Учитывать Тогда Продолжить;КонецЕсли; 
				Ветвь.ПорядокОтражения = ПолучитьПорядокОтражения(Элемент.Номенклатура);
				ЗаполнитьЗначенияСвойств(Ветвь,ПокупательДоговор(Ветвь.Грузоперевозка,Ветвь.ПорядокОтражения,Организация));	
			КонецЦикла; 
		Иначе
			Элемент.ПорядокОтражения = ПолучитьПорядокОтражения(Элемент.Номенклатура);		
			ЗаполнитьЗначенияСвойств(Элемент,ПокупательДоговор(Элемент.Грузоперевозка,Элемент.ПорядокОтражения,Организация));	
		КонецЕсли; 
	КонецЦикла; 
	МожноФормировать();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПорядокОтражения(Номенклатура)
	Если НЕ ЕстьОграниченияПоСпискуУслуг Тогда
		Возврат ПорядокОтражения;
	КонецЕсли; 
	Нашли = УслугиПоДоговору.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
	Если Нашли.Количество() Тогда
		Возврат Нашли[0].ПорядокОтражения;
	Иначе 
		Возврат ПорядокОтражения;
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура Услуги_ГрупповоеРедактирование(Команда)
	ОткрытьФорму("Обработка.CW_DT_ЗагрузкаРасходов.Форма.ФормаГрупповогоРедактирования",,,,,,Новый ОписаниеОповещения("ГрупповоеРедактирование",ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеРедактирование(Ответ,ДП) Экспорт
	Если НЕ Ответ = Неопределено Тогда
		Для Каждого Стр Из Элементы.Услуги.ВыделенныеСтроки Цикл
			Элемент = Услуги.НайтиПоИдентификатору(Стр);Если НЕ Элемент.Учитывать ИЛИ Элемент.Корень Тогда Продолжить;КонецЕсли; 
			Если Элемент.Ветвь Тогда
				Если Ответ.КоличествоИзм Тогда
					Элемент.Количество = Ответ.Количество;		
				КонецЕсли; 
				Если Ответ.ПорядокОтраженияИзм Тогда
					Элемент.ПорядокОтражения = Ответ.ПорядокОтражения;
					Элемент.Покупатель = Неопределено;
					Элемент.ДоговорПокупателя = Неопределено;		
				КонецЕсли; 
				Если Ответ.ПокупательИзм И Элемент.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление") Тогда
					Элемент.Покупатель = Ответ.Покупатель;		
				КонецЕсли; 
				Если Ответ.ДоговорПокупателяИзм И Элемент.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление") Тогда
					Элемент.ДоговорПокупателя = Ответ.ДоговорПокупателя;		
				КонецЕсли; 
			ИначеЕсли НЕ Элемент.Корень Тогда 
				Если Ответ.ПорядокОтраженияИзм Тогда
					Элемент.ПорядокОтражения = Ответ.ПорядокОтражения;		
					Элемент.Покупатель = Неопределено;
					Элемент.ДоговорПокупателя = Неопределено;		
				КонецЕсли; 
				Если Ответ.ПокупательИзм И Элемент.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление") Тогда
					Элемент.Покупатель = Ответ.Покупатель;		
				КонецЕсли; 
				Если Ответ.ДоговорПокупателяИзм И Элемент.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление") Тогда
					Элемент.ДоговорПокупателя = Ответ.ДоговорПокупателя;		
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		
		//Для Каждого Элемент Из Услуги.ПолучитьЭлементы() Цикл
		//	Если Элемент.Корень Тогда
		//		Для Каждого Ветвь Из Элемент.ПолучитьЭлементы() Цикл
		//			Если НЕ Ветвь.Учитывать Тогда Продолжить;КонецЕсли; 
		//			//Ветвь.ПорядокОтражения = ПолучитьПорядокОтражения(Элемент.Номенклатура);
		//			//ЗаполнитьЗначенияСвойств(Ветвь,ПокупательДоговор(Ветвь.Грузоперевозка,Ветвь.ПорядокОтражения,Организация));	
		//		КонецЦикла; 
		//	Иначе
		//		//Элемент.ПорядокОтражения = ПолучитьПорядокОтражения(Элемент.Номенклатура);		
		//		//ЗаполнитьЗначенияСвойств(Элемент,ПокупательДоговор(Элемент.Грузоперевозка,Элемент.ПорядокОтражения,Организация));	
		//	КонецЕсли; 
		//КонецЦикла; 
	КонецЕсли; 		
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПараметраРаспределения()
	Элементы.Услуги_ПараметрРаспределения.Заголовок = ?(ПараметрРаспределения.Пустая(),"< ... >",Строка(ПараметрРаспределения));
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПараметраРаспределения(Ответ, ДП) Экспорт 
	Если НЕ Ответ = Неопределено Тогда
		ПараметрРаспределения = Ответ;
		ПредставлениеПараметраРаспределения();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Услуги_ПараметрРаспределения(Команда)
	ПОВ	= Новый ОписаниеОповещения("ОбработкаИзмененияПараметраРаспределения",ЭтотОбъект); 
	ПФ	= Новый Структура("Отбор",Новый Структура("ЭтоЧисло",Истина));
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


#КонецОбласти 

#Область ФормированиеРасходов

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
	ОП = Новый ОписаниеОповещения("ОтветСформировать",ЭтаФорма); 
	ПоказатьВопрос(ОП,"Сейчас будет " + ?(РасходыСсылка.Пустая(),"сформирован","обновлен") + " документ. Продолжить?",РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОтветСформировать(Ответ,ДП) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если СформироватьНаСервере() Тогда
			ЗаписатьСинхронизацию();
			Оповестить("CWDT.МенеджерСообщений.ОбновитьВходящие");
			Если Настройка_ОткрыватьСформированныйДокумент Тогда ПоказатьЗначение(,РасходыСсылка);КонецЕсли; 
			Если Настройка_ЗакрыватьОкноПослеФормирования Тогда Закрыть();КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	
	Если РасходыСсылка.Пустая() Тогда
		ОБ = Документы.CW_РасходыПоГрузоперевозке.СоздатьДокумент();
		СтатусДокумента = Справочники.CW_СтатусыДокументов.ПолучитьСтатусНовогоОбъекта(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"));	
	Иначе
		ОБ = РасходыСсылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Об,Документы.CW_РасходыПоГрузоперевозке.СоздатьДокумент(),,"ВедомыйСчет,ВедомыйДокумент,ВедомыйСчетФактура,Ссылка,Номер,Дата,Проведен,ПометкаУдаления");
		ОБ.Услуги.Очистить();
		ОБ.ЗачетАвансов.Очистить();
		ОБ.ЗачетАвансовОЗ.Очистить();
		ОБ.ПлатёжноРасчётныеДокументы.Очистить();
		СтатусДокумента = Неопределено;
	КонецЕсли; 
	
	ОБ.Дата				= ?(ПредъявленАкт,ДатаАкта,ДатаСчета);
	ОБ.Организация		= Организация;
	ОБ.Контрагент		= Контрагент;
	ОБ.Договор			= Договор;
	ОБ.Валюта			= Договор.ВалютаДоговора;
	
	ПД	= _БЭ.ПараметрыДоговора(ОБ.Дата, ОБ.Договор);
	УП	= CW_Настройки.ПараметрыУчетнойПолитики(ОБ.Дата,Организация);
	
	ОБ.СпособЗачетаАвансов		= ПД.ПорядокЗачетаАвансов;
	ОБ.СпособЗачетаАвансовОЗ	= ПД.ПорядокЗачетаАвансовОЗ;
	
	ВестиУчетПоПодразделениям	= Истина;//ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	
	ЗаполнитьЗначенияСвойств(ОБ,ЭтаФорма,"ПредъявленСчет,НомерСчета,ДатаСчета,ПредъявленАкт,НомерАкта,ДатаАкта,ПредъявленСФ,НомерСФ,ДатаСФ,Продавец,Счет,СписокСчетов,ПодразделениеОрганизации");
	
	Для Каждого Элемент Из Услуги.ПолучитьЭлементы() Цикл
		Если НЕ Элемент.Всего Тогда Продолжить; КонецЕсли; 
		Если Элемент.Корень Тогда
			Для Каждого Ветвь Из Элемент.ПолучитьЭлементы() Цикл
				Если НЕ Ветвь.Учитывать Тогда Продолжить;КонецЕсли; 
				нСтр = ОБ.Услуги.Добавить();
				ЗаполнитьЗначенияСвойств(нСтр,Ветвь,,?(Ветвь.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты,"Покупатель,ДоговорПокупателя",""));
				ЗаполнитьЗначенияСвойств(нСтр,Элемент,"СтавкаНДС,Номенклатура");
				СтатьяЗатратНоменклатуры(нСтр,УП.ОсновнаяСтатьяЗатрат);
				Если ВестиУчетПоПодразделениям И Ветвь.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда
					нСтр.Подразделение = ПодразделениеОрганизации;	
				КонецЕсли; 
				Если Настройка_ФормироватьПредставлениеУслуги Тогда
					CW_Шаблоны.УстановитьПредставлениеНоменклатуры(нСтр,ОБ.Договор,ОБ);
				КонецЕсли; 
			КонецЦикла; 
		Иначе
			нСтр = ОБ.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,Элемент,,?(Элемент.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты,"Покупатель,ДоговорПокупателя",""));
			СтатьяЗатратНоменклатуры(нСтр,УП.ОсновнаяСтатьяЗатрат);
			Если ВестиУчетПоПодразделениям И Элемент.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда
				нСтр.Подразделение = ПодразделениеОрганизации;	
			КонецЕсли; 
			Если Настройка_ФормироватьПредставлениеУслуги Тогда
				CW_Шаблоны.УстановитьПредставлениеНоменклатуры(нСтр,ОБ.Договор,ОБ);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	ОБ.ДополнительныеСвойства.Вставить("ЗаписьИзТранспортногоСообщения",Истина);
	ОБ.Комментарий = "Документ " + ?(РасходыСсылка.Пустая(),"сформирован","обновлен") + " " +Строка(ТекущаяДата()) + " (" + ТранспортноеСообщение + ")";
	
	Попытка
		ОБ.Записать(?(Настройка_ПроводитьСформированныйДокумент,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	Исключение
		Сообщить("Документ не " + ?(РасходыСсылка.Пустая(),"сформирован","обновлен") + "!");
		Возврат Ложь
	КонецПопытки; 
	
	Если РасходыСсылка.Пустая() Тогда РасходыСсылка = ОБ.Ссылка;КонецЕсли; 
	

	//Подсистема.СтатусыДокументов
	//Запишем первый и текущий статус
	ДанныеДляЗаписи = Новый Структура;
	ДанныеДляЗаписи.Вставить("Документ", 		ОБ.Ссылка);
	ДанныеДляЗаписи.Вставить("СтатусДокумента", СтатусДокумента);
	ДанныеДляЗаписи.Вставить("Автор", 			ПараметрыСеанса.ТекущийПользователь);
	
	РегистрыСведений.CW_СтатусыДокументов.ДобавитьЗаписьВРегистр(ДанныеДляЗаписи);
	//Подсистема.СтатусыДокументов
	
	ТС = ТранспортноеСообщение.ПолучитьОбъект();
	ТС.Основания.Очистить();
	ТС.Основания.Добавить().Основание = РасходыСсылка;
	ТС.СостояниеОбмена = Перечисления.CW_DT_СостоянияОбмена.Загружен;
	ТС.Записать();

	Элементы.ФормаСформировать.Заголовок = ?(РасходыСсылка.Пустая(),"Сформировать","Обновить");	
	
	Возврат Истина
	
КонецФункции

&НаСервереБезКонтекста
Процедура СтатьяЗатратНоменклатуры(СтрокаТЧ,ОсновнаяСтатьяЗатрат)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры
	|ГДЕ
	|	CW_СтатьиЗатратНоменклатуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТЧ.Номенклатура);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		СтрокаТЧ.СтатьяЗатрат = ОсновнаяСтатьяЗатрат;
	Иначе 
		Выборка = Результат.Выбрать();Выборка.Следующий();
		СтрокаТЧ.СтатьяЗатрат = Выборка.СтатьяЗатрат;
	КонецЕсли; 
КонецПроцедуры
 
#КонецОбласти  

/////////////////////////////ВРЕМЕННО
&НаСервере
Процедура ТранспортноеСообщениеПриИзмененииНаСервере()
	ПрочитатьТранспортноеСообщение(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСообщениеПриИзменении(Элемент)
	//Замер = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТранспортноеСообщениеПриИзмененииНаСервере();
	УслугиПоДоговру();
	ОбновитьЗначенияУслуг();
	ИтогиСтрокой();
	МожноФормировать();
	//Сообщить(ТекущаяУниверсальнаяДатаВМиллисекундах()-Замер);
КонецПроцедуры



#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти
 
