
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НазначениеСтатуса = ПолучитьНазначениеСтатусанаСервере(ПараметрКоманды[0]);
	
	Если НазначениеСтатуса = Неопределено Тогда
		ПоказатьПредупреждение(,"Неизвестное назначение статуса объекта!",,"Ошибка");
		Возврат;
	КонецЕсли;
	
	ЗаголовокФормы = "Изменение статуса объектов";
	Если ПараметрКоманды.Количество() = 1 Тогда
		ЗаголовокФормы = "Изменение статуса объекта";
	КонецЕсли;
	
	мСтатусы = ПолучитьМассивДоступныхСтатусов(ПараметрКоманды[0]);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивСсылок", ПараметрКоманды);
	ДополнительныеПараметры.Вставить("Источник", 	 ПараметрыВыполненияКоманды.Источник);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьУстановкуСтатусаОбъектов", ЭтотОбъект, ДополнительныеПараметры); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", 		ЗаголовокФормы);
	ПараметрыФормы.Вставить("НазначениеСтатуса",	НазначениеСтатуса);
	ПараметрыФормы.Вставить("МассивСтатусов", 		мСтатусы);
	
	ОткрытьФорму("РегистрСведений.CW_СтатусыДокументов.Форма.ГрупповоеИзменениеСтатуса", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДоступныхСтатусов(Ссылка)
	
	ГруппаПользователя	= CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	ПолныеПрава			= CW_ПраваДоступа.ЭтоПолноправныйПользователь() или ГруппаПользователя.ПолныеПрава ИЛИ ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	мСтатусы 			= Неопределено;
	
	Если Не ПолныеПрава Тогда
		
		ИмяОбъектаМетаданных	= CW_СтатусыДокументовСервер.ПолучитьИмяОбъектаМетаданных(Ссылка);
		мСтатусы 				= Справочники.CW_СтатусыДокументов.СтатусыОбъектаМетаданных(ИмяОбъектаМетаданных);

		УстановитьПривилегированныйРежим(Истина);
		мСтатусы  = РегистрыСведений.CW_ДоступностьСтатусовПоГруппамПользователей.ПолучитьМассиивДоступныхСтатусовГруппыПользователя(ГруппаПользователя, мСтатусы);
		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;
	
	Возврат мСтатусы;

КонецФункции

&НаСервере
Функция  ПолучитьНазначениеСтатусанаСервере(СсылкаОбъекта)
	
	Возврат Справочники.CW_НазначенияСтатусов.ПолучитьНазначениеСтатусовПоТипуОбъекрта(ТипЗнч(СсылкаОбъекта));
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьУстановкуСтатусаОбъектов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьУстановкуСтатусаОбъектовНаСервереВФоне(РезультатВыбора, ДополнительныеПараметры.МассивСсылок);
	
	ДополнительныеПараметрыФона = новый Структура;
	ДополнительныеПараметрыФона.Вставить("ТипОбъекта", ТипЗнч(ДополнительныеПараметры.МассивСсылок[0]));
	ДополнительныеПараметрыФона.Вставить("КоличествоОбъектов", ДополнительныеПараметры.МассивСсылок.Количество());
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ДополнительныеПараметры.Источник);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатУстановкиСтатусов", ЭтотОбъект, ДополнительныеПараметрыФона);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПродолжитьУстановкуСтатусаОбъектовНаСервереВФоне(РезультатВыбора, МассивСсылок)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Групповая установка статусов объектов";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("РезультатВыбора", 	РезультатВыбора);
	ПараметрыПроцедуры.Вставить("МассивСсылок", 	МассивСсылок);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_СтатусыДокументовСервер.ГрупповаяУстановкаСтатусовОбъектов",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатУстановкиСтатусов(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ОповеститьОбИзменении(ДополнительныеПараметры.ТипОбъекта);
		
		ПоказатьОповещениеПользователя("Изменен статус объектов",,"Изменено "+Формат(ДополнительныеПараметры.КоличествоОбъектов,"ЧГ=0")+" объектов");
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Статусы не изменены!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка установки статусов");
	КонецЕсли;
	
КонецПроцедуры


