
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды",	ПараметрКоманды);
	ДополнительныеПараметры.Вставить("Источник",		ПараметрыВыполненияКоманды.Источник);
	
	Режим = РежимДиалогаВопрос.ДаНетОтмена;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Удалить ранее прикрепленные файлы?", Режим, 0);	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено или Результат = КодВозвратаДиалога.Отмена Тогда
        Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("УдалитьФайлы", Результат = КодВозвратаДиалога.Да); 

	ПродолжитьВыборПриложенияДляКопирования(ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВыборПриложенияДляКопирования(ДополнительныеПараметры)
	
	МассивСсылок = ПолучитьМассивСсылок(ДополнительныеПараметры.ПараметрКоманды);
	Если МассивСсылок.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Нет доступных приложений для копирование файлов!");
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Ссылка", МассивСсылок);
	
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", 			Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", 	Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", 	Истина);
	
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборПриложения", ЭтотОбъект, ДополнительныеПараметры); 
	
	ОткрытьФорму("Справочник.CW_ПриложенияКДоговорам.ФормаВыбора", ПараметрыФормы, ДополнительныеПараметры.Источник,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСсылок(Ссылка)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПриложенияКДоговорам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ПриложенияКДоговорам КАК CW_ПриложенияКДоговорам
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_НаличиеФайловАрхиваПоОбъектам КАК CW_НаличиеФайловАрхиваПоОбъектам
	               |		ПО CW_ПриложенияКДоговорам.Ссылка = CW_НаличиеФайловАрхиваПоОбъектам.Объект
	               |			И (CW_НаличиеФайловАрхиваПоОбъектам.Признак = ИСТИНА)
	               |ГДЕ
	               |	CW_ПриложенияКДоговорам.Договор = &Договор
	               |	И CW_ПриложенияКДоговорам.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	Запрос.УстановитьПараметр("Договор", 	Ссылка.Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборПриложения(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.УдалитьФайлы Тогда
		ОчиститьФайлыТекущегоОбъектаНаСервере(ДополнительныеПараметры.ПараметрКоманды);
	КонецЕсли;

	КопироватьПрикрепленныеФайлыНаСервере(РезультатВыбора, ДополнительныеПараметры.ПараметрКоманды);
	
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ДополнительныеПараметры.Источник);

КонецПроцедуры

&НаСервере
Процедура ОчиститьФайлыТекущегоОбъектаНаСервере(ПараметрКоманды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыАрхива.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	               |ГДЕ
	               |	CW_ОбъектыАрхива.Объект = &ПараметрКоманды";
	
	Запрос.УстановитьПараметр("ПараметрКоманды", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		УдаляемыйОбъект	= Выборка.Ссылка.ПолучитьОбъект();
		Если УдаляемыйОбъект <> Неопределено Тогда
			УдаляемыйОбъект.Удалить();	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура КопироватьПрикрепленныеФайлыНаСервере(ИсточникФайлов, ПриемникФайлов) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыАрхива.Ссылка КАК Ссылка,
	               |	CW_ОбъектыАрхива.ЭтоГруппа КАК ЭтоГруппа,
	               |	CW_ОбъектыАрхива.Родитель КАК Родитель
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	               |ГДЕ
	               |	CW_ОбъектыАрхива.Объект = &ИсточникФайлов
	               |	И CW_ОбъектыАрхива.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоГруппа УБЫВ";
	
	Запрос.УстановитьПараметр("ИсточникФайлов", ИсточникФайлов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	СоответствиеГрупп = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			НовыйРодитель = СоздатьГруппу(Выборка.Ссылка, ПриемникФайлов);
			СоответствиеГрупп.Вставить(Выборка.Ссылка, НовыйРодитель);
			Продолжить;
		КонецЕсли;
		
		Если Не Выборка.Родитель.Пустая() Тогда
			
			НовыйРодитель = СоответствиеГрупп.Получить(Выборка.Родитель);
			Если НовыйРодитель = Неопределено Тогда
				НовыйРодитель = СоздатьГруппу(Выборка.Родитель, ПриемникФайлов);
				СоответствиеГрупп.Вставить(Выборка.Родитель, НовыйРодитель);
			КонецЕсли;
			
		КонецЕсли;  
		
	
		НовыйЭлемент = Выборка.Ссылка.Скопировать();
		НовыйЭлемент.Владелец 	= ПриемникФайлов;
		НовыйЭлемент.Объект 	= ПриемникФайлов;
		НовыйЭлемент.Родитель 	= НовыйРодитель;
		НовыйЭлемент.Записать();     
		
		ДвоичныеДанныеФайла = CW_РаботаСФайламиСервер.ДвоичныеДанныеФайла(Выборка.Ссылка);
		АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор);
		CW_РаботаСФайламиСервер.ЗаписатьФайлВТомХранения(НовыйЭлемент.Ссылка, АдресВХранилище, НовыйЭлемент.Том);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьГруппу(КопируемаяГруппа, ПриемникФайлов)
	
	НоваяГруппа = Справочники.CW_ОбъектыАрхива.СоздатьГруппу();
	НоваяГруппа.Наименование 	= КопируемаяГруппа.Наименование;
	НоваяГруппа.Владелец 		= ПриемникФайлов;
	НоваяГруппа.Объект 			= ПриемникФайлов;
	НоваяГруппа.Записать();
	
	Возврат НоваяГруппа.Ссылка;
	
КонецФункции

