#Область ПрограммныйИнтерфейс

// В процедуре нужно показать диалоговое окно для ввода штрихкода и передать полученные данные в описание оповещения.
//
// Параметры:
//  Оповещение - ОписаниеОповещения - процедура, которую нужно вызвать после ввода штрихкода.
//  СтандартнаяОбработка - Булево - признак дальнейшей стандартной обработки события.
Процедура ПоказатьВводШтрихкода(Оповещение, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ШтрихкодированиеНоменклатурыБПКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

// В процедуре необходимо реализовать алгоритм обработки
// 
// Параметры:
// 	Форма
// 	ОбработанныеДанные
// 	КэшированныеЗначения
Процедура ПослеОбработкиШтрихкодов(Форма, ОбработанныеДанные, КэшированныеЗначения) Экспорт
	
	СтруктураДействий = ОбработанныеДанные;
	
	ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования(Форма);
	Если ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ДопустимВидПродукции(ПараметрыСканирования, ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Алкогольная")) 
		И ОбработанныеДанные.МассивСтрокСАкцизнымиМарками.Количество() > 0 Тогда
		
		ШтрихкодированиеНоменклатурыЕГАИСКлиентПереопределяемый.ОткрытьФормуСчитыванияАкцизнойМаркиПриНеобходимости(Форма, СтруктураДействий);
	КонецЕсли;
	
КонецПроцедуры

// В процедуре необходимо реализовать открытие формы, в которой будет возможность сопоставить неизвестные штрихкоды с номенклатурой.
//
// Параметры:
//  НеизвестныеШтрихкоды - Массив - Штрихкоды для сопоставления.
//  ФормаВладелец - ФормаКлиентскогоПриложения - Форма владелец.
//  ОповещениеОЗакрытии - ОписаниеОповещения - Оповещение, которое должно быть вызвано после сопоставления номенклатуры.
Процедура ОткрытьФормуПодбораНоменклатурыПоШтрихкодам(НеизвестныеШтрихкоды, ФормаВладелец = Неопределено, ОповещениеОЗакрытии = Неопределено) Экспорт
	
	Если ТипЗнч(НеизвестныеШтрихкоды) = Тип("Массив")
		И НеизвестныеШтрихкоды.Количество() = 1 Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ШтрихкодДляРегистрации", НеизвестныеШтрихкоды[0].ШтрихКод);
		ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.ФормаЗаписи", ПараметрыФормы, ФормаВладелец, Новый УникальныйИдентификатор, , , ОповещениеОЗакрытии);
		
	ИначеЕсли ТипЗнч(НеизвестныеШтрихкоды) = Тип("Массив") Тогда
		ТекстСообщения = НСтр("ru = 'Не определены товары со штрих-кодами:'");
		Первый = Истина;
		Для Каждого НеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
			ТекстСообщения = Стршаблон("%1 %2 %3", ТекстСообщения, ?(Первый, "", ","), НеизвестныйШтрихкод.ШтрихКод);
			Первый = Ложь;
		КонецЦикла;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ВыполнитьОбработкуОповещения(ОповещениеОЗакрытии, Неопределено);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеОЗакрытии, Неопределено);
	КонецЕсли;
	
КонецПроцедуры
// В процедуре необходимо реализовать очистку коллекции штрихкодов, которые находятся в структуре кэшированные значения.
//
// Параметры:
//  ДанныеШтрихкодов - Соответствие - Данные штрихкодов.
//  КэшированныеЗначения - Структура - Содержит поля кэшируемых значений.
//
Процедура ОчиститьКэшированныеШтрихкоды(ДанныеШтрихкодов, КэшированныеЗначения) Экспорт
	
	КэшированныеЗначения.Штрихкоды.Очистить();
	
КонецПроцедуры

// В данной процедуре нужно переопределить параметры записи журнала регистрации при отказе ввода кода маркировки.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, для которой происходит обработка штрихкода.
//  СтруктураСообщения - Структура:
//   * ИмяСобытия - Строка - Имя события журнала регистрации.
//   * Уровень - Строка - Уровень журнала регистрации. Возможные уровни: "Информация", "Ошибка", "Предупреждение",
//        "Примечание".
//   * Данные - Произвольный - Данные журнала регистрации.
//   * СсылкаНаОбъект - ЛюбаяСсылка - Ссылка на объект, на основании которого будут полученные метаданные для записи
//        в журнал регистрации.
//   * КодМаркировки - Строка - Введенный код маркировки. Если значение кода не заполнено - ввод кода маркировки отменен
//        по инициативе пользователя.
Процедура ПриОпределенииИнформацииОбОтказеВводаКодаМаркиДляЖурналаРегистрации(Форма, СтруктураСообщения) Экспорт
	
	Возврат;

КонецПроцедуры

// Для РМК. При уточнении данных после сканирования штрихкода.
//  
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ОповещениеПриЗавершении - ОписаниеОповещения
Процедура ПриУточненииДанныхПослеСканированияШтрихкода(Форма, ОповещениеПриЗавершении) Экспорт
	
	ПоказатьПредупреждение(, НСтр("ru = 'Требуется уточнение данных. Обратитесь к администратору.'"));
	
КонецПроцедуры

#КонецОбласти
