//Процедуры и функции общего модуля используются 
//совместно с установленным расширеним "AF_AddEDI"  

//ОбщийМодуль.УчетНДС    
Процедура ДополнитьДанныеДляПечатиВедущимиДокументами(ДокументОснование, ДанныеДляПечати, ДанныеСчетаФактуры, НеподтверждениеНулевойСтавки=Ложь) Экспорт  
	
	ВедущийДокумент = ПолучитьСвязанныйДокументМодуля(ДокументОснование);
	Если ВедущийДокумент = Неопределено Тогда
		Возврат; 
	КонецЕсли;  
	
	Если ДанныеДляПечати.ТаблицаДокумента = Неопределено 
		ИЛИ ДанныеДляПечати.Реквизиты = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПустаяТаблицаДокумента = ДанныеДляПечати.ТаблицаДокумента.Скопировать();
	ПустаяТаблицаДокумента.Очистить();   
	
	ДанныеДляПечати.Реквизиты.Колонки.Добавить("ВедущийДокумент"); 
	ДанныеДляПечати.Реквизиты.Колонки.Добавить("ДоговорПоГрузоперевозке"); 
	ДанныеДляПечати.Реквизиты.Колонки.Добавить("ПараметрыВыводаРеальныхПродавцов"); 

	ДанныеДляПечати.Реквизиты.ЗаполнитьЗначения(ВедущийДокумент, 			"ВедущийДокумент");
	ДанныеДляПечати.Реквизиты.ЗаполнитьЗначения(ВедущийДокумент.Договор, 	"ДоговорПоГрузоперевозке");  
	
	ПараметрыВыводаРеальныхПродавцов = ПолучитьПараметрыВыводаРеальныхПродавцов(ВедущийДокумент, ДанныеСчетаФактуры);

	ДанныеДляПечати.Реквизиты.ЗаполнитьЗначения(ПараметрыВыводаРеальныхПродавцов, 	"ПараметрыВыводаРеальныхПродавцов");  
	
	ТаблицаДокумента = ПодготовитьТаблицуУслугДокумента(ВедущийДокумент, ТипЗнч(ДокументОснование), ПустаяТаблицаДокумента,  ДанныеДляПечати, НеподтверждениеНулевойСтавки); 
	Если ТаблицаДокумента <> Неопределено Тогда
		ДанныеДляПечати.Вставить("ТаблицаДокумента",	ТаблицаДокумента);
	КонецЕсли;
	
КонецПроцедуры   
 
Функция ПодготовитьДанныеШапкиСчетаФактуры1137_Стандартно(СтрокаТаблицыРеквизиты) Экспорт
	
	ВремРеквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыРеквизиты);
	Возврат Не ВремРеквизиты.Свойство("ВедущийДокумент");
		
КонецФункции

Функция ПодготовитьДанныеШапкиСчетаФактуры1137_Продолжиение(ВыборкаСФ, СтрокаТаблицыРеквизиты, ПлатежноРасчетныеДокументы, ДополнитьДаннымиУПД, ФормированиеЭД = Ложь) Экспорт

	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыРеквизиты);
	
	СведенияОЮрФизЛицах = Новый Соответствие; // для хранения ранее полученных сведений
	
	ДанныеШапки = Новый Структура;
	
	// Номер и дата
	Если ВыборкаСФ.УдалитьПрефиксыИзНомера Тогда
		Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаСФ.Номер, Истина, Ложь);
	Иначе
		Номер = ВыборкаСФ.Номер;
	КонецЕсли;
	
	// Дополняем номер индексом обособленного подразделения (при необходимости)
	Если ЗначениеЗаполнено(Реквизиты.ЦифровойИндексОбособленногоПодразделения)
		И ВыборкаСФ.ЭтоСчетФактураВыданный
		И ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) Тогда
		Номер = Номер + "/" + Реквизиты.ЦифровойИндексОбособленногоПодразделения;
	КонецЕсли;
	
	Если УчетНДСПереопределяемый.ЭтоСчетФактураНаАванс(ВыборкаСФ.ВидСчетаФактуры) Тогда
		// Методически неверно оформлять УПД в случае получения предварительной оплаты.
		ДополнитьДаннымиУПД = Ложь;
	КонецЕсли;
	
	ДанныеШапки.Вставить("Номер", СокрЛП(Номер));
	ДанныеШапки.Вставить("Дата", ВыборкаСФ.Дата);
	
	// Номер и дата исправления
	ДанныеШапки.Вставить("Исправление", ВыборкаСФ.Исправление);
	Если ВыборкаСФ.Исправление Тогда
		ДанныеШапки.Вставить("НомерИсправления", ВыборкаСФ.НомерИсправления);
		ДанныеШапки.Вставить("ДатаИсправления", ВыборкаСФ.ДатаИсправления);
	Иначе 	
		ДанныеШапки.Вставить("НомерИсправления", "--");
		ДанныеШапки.Вставить("ДатаИсправления", "--");
	КонецЕсли;

	ДанныеШапки.Вставить("Поставщик", Реквизиты.Поставщик);
	
	//AF_ЭДО 
	//СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Организация, ВыборкаСФ.ДатаСведений, , , , Истина);
	СведенияОбОрганизации = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Организация, ВыборкаСФ.ДатаСведений);
	//AF_ЭДО 

	СведенияОЮрФизЛицах.Вставить(Реквизиты.Организация, СведенияОбОрганизации);
	
	Если Реквизиты.СводныйСФКомиссияПоЗакупке Тогда
		
		СведенияОПоставщике = СведенияОбОрганизации;
		
		ДанныеШапки.Вставить("ПредставлениеПоставщика", Реквизиты.Поставщик);
		
		ДанныеШапки.Вставить("АдресПоставщика", Реквизиты.АдресПоставщика);
		
		ДанныеШапки.Вставить("ИННКППпоставщика", Реквизиты.ИННКППпоставщика);
		
	Иначе	
		
		СведенияОПоставщике = СведенияОЮрФизЛицах[Реквизиты.Поставщик];
		Если СведенияОПоставщике = Неопределено Тогда
			//AF_ЭДО 
			//СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Поставщик, ВыборкаСФ.ДатаСведений, , , , Истина);
			СведенияОПоставщике = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Поставщик, ВыборкаСФ.ДатаСведений);
			//AF_ЭДО 
			СведенияОЮрФизЛицах.Вставить(Реквизиты.Поставщик, СведенияОПоставщике);
		КонецЕсли;
		
		ДанныеШапки.Вставить("ПредставлениеПоставщика", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес продавца
		ДанныеШапки.Вставить("АдресПоставщика", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,"));
		
	КонецЕсли;
	
	ДанныеШапки.Вставить("ИННпоставщика", Реквизиты.ИННпоставщика);
	
	Если НЕ ВыборкаСФ.ЭтоСчетФактураВыданный И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры) Тогда
		КППпоставщика = ВыборкаСФ.КППСчетаФактуры;
	ИначеЕсли ВыборкаСФ.ЭтоСчетФактураВыданный
		И ЗначениеЗаполнено(ВыборкаСФ.КПППродавца) Тогда 
		КППпоставщика = ВыборкаСФ.КПППродавца;
	Иначе
		КПППоставщика = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПоставщика, ВыборкаСФ.ДатаСведений);
	КонецЕсли;
	
	ДанныеШапки.Вставить("КППпоставщика", КППпоставщика);
	
	// Наименование покупателя
	ДанныеШапки.Вставить("Покупатель", Реквизиты.Покупатель);
	
	Если Реквизиты.СводныйСФКомиссияПоПродаже Тогда
		
		ДанныеШапки.Вставить("ПредставлениеПокупателя", Реквизиты.Покупатель);
		
		ДанныеШапки.Вставить("АдресПокупателя", Реквизиты.АдресПокупателя);
		
		ДанныеШапки.Вставить("ИННКПППокупателя", Реквизиты.ИННКППпокупателя);
		
	Иначе
		
		СведенияОПокупателе = СведенияОЮрФизЛицах[Реквизиты.Покупатель];
		Если СведенияОПокупателе = Неопределено Тогда
			//AF_ЭДО 
			//СведенияОПокупателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Покупатель, ВыборкаСФ.ДатаСведений, , , , Истина);
			СведенияОПокупателе = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Покупатель, ВыборкаСФ.ДатаСведений);
			//AF_ЭДО 
			СведенияОЮрФизЛицах.Вставить(Реквизиты.Покупатель, СведенияОПокупателе);
		КонецЕсли;
		
		ДанныеШапки.Вставить("ПредставлениеПокупателя", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес покупателя
		ДанныеШапки.Вставить("АдресПокупателя", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,"));
			
	КонецЕсли;
	
	ДанныеШапки.Вставить("ИННпокупателя", Реквизиты.ИННпокупателя);
	
	Если ВыборкаСФ.ЭтоСчетФактураВыданный И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры) Тогда
		КППпокупателя = ВыборкаСФ.КППСчетаФактуры;
	Иначе
		КППпокупателя = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПокупателя, ВыборкаСФ.ДатаСведений);
	КонецЕсли;
	
	ДанныеШапки.Вставить("КППпокупателя", КППпокупателя);
	
	// Грузоотправитель
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитентаНаЗакупку Тогда
		Грузоотправитель = Неопределено;
		ПредставлениеГрузоотправителя = "--";
	ИначеЕсли Реквизиты.ЕстьТовары 
		И ЗначениеЗаполнено(Реквизиты.Грузоотправитель) Тогда
		Если ТипЗнч(Реквизиты.Грузоотправитель) = Тип("Строка") Тогда
			ПредставлениеГрузоотправителя = Реквизиты.Грузоотправитель;
		ИначеЕсли ТипЗнч(Реквизиты.Грузоотправитель) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			СведенияОГрузоотправителе = СведенияОЮрФизЛицах[Реквизиты.Грузоотправитель];
			Если СведенияОГрузоотправителе = Неопределено Тогда
				СведенияОГрузоотправителе = УчетНДСПереопределяемый.СведенияОПодразделенииОрганизации(Реквизиты.Грузоотправитель);
				СведенияОЮрФизЛицах.Вставить(Реквизиты.Грузоотправитель, СведенияОГрузоотправителе);
			КонецЕсли;
			ПредставлениеГрузоотправителя = СведенияОГрузоотправителе;
		Иначе
			СведенияОГрузоотправителе = СведенияОЮрФизЛицах[Реквизиты.Грузоотправитель];
			Если СведенияОГрузоотправителе = Неопределено Тогда
				//AF_ЭДО 
				//	СведенияОГрузоотправителе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузоотправитель, ВыборкаСФ.ДатаСведений, , , , Истина);
				СведенияОГрузоотправителе = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузоотправитель, ВыборкаСФ.ДатаСведений);
				//AF_ЭДО 
				СведенияОЮрФизЛицах.Вставить(Реквизиты.Грузоотправитель, СведенияОГрузоотправителе);
			КонецЕсли;
			ПредставлениеГрузоотправителя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузоотправителе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
		КонецЕсли;
		Грузоотправитель = Реквизиты.Грузоотправитель;	
	Иначе
		Грузоотправитель = Неопределено;
		ПредставлениеГрузоотправителя = "--";
	КонецЕсли;
	ДанныеШапки.Вставить("Грузоотправитель", Грузоотправитель);
	ДанныеШапки.Вставить("ПредставлениеГрузоотправителя", ПредставлениеГрузоотправителя);

	// Грузополучатель
	Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
		ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
		Грузополучатель = Неопределено;
		ПредставлениеГрузополучателя = "--";
	ИначеЕсли Реквизиты.ЕстьТовары 
		И ЗначениеЗаполнено(Реквизиты.Грузополучатель) Тогда
		Если ТипЗнч(Реквизиты.Грузополучатель) = Тип("Строка") Тогда
			ПредставлениеГрузополучателя = Реквизиты.Грузополучатель;
		Иначе
			СведенияОГрузополучателе = СведенияОЮрФизЛицах[Реквизиты.Грузополучатель];
			Если СведенияОГрузополучателе = Неопределено Тогда
				//AF_ЭДО 
				//СведенияОГрузополучателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузополучатель, ВыборкаСФ.ДатаСведений, , , , Истина);
				СведенияОГрузополучателе = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Грузополучатель, ВыборкаСФ.ДатаСведений);
				//AF_ЭДО 
				СведенияОЮрФизЛицах.Вставить(Реквизиты.Грузополучатель, СведенияОГрузополучателе);
			КонецЕсли;
			Если Реквизиты.АдресДоставки <> "" Тогда 
				СведенияОГрузополучателе.ПочтовыйАдрес = Реквизиты.АдресДоставки;
			КонецЕсли;
			ПредставлениеГрузополучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузополучателе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
		КонецЕсли;
		Грузополучатель = Реквизиты.Грузополучатель;
	Иначе
		Грузополучатель = Неопределено;
		ПредставлениеГрузополучателя = "--";
	КонецЕсли;
	ДанныеШапки.Вставить("Грузополучатель", Грузополучатель);
	ДанныеШапки.Вставить("ПредставлениеГрузополучателя", ПредставлениеГрузополучателя);
	
	// Платежно-расчетный документ
	ПоДокументу = "";
	АвансовыеСчетаФактурыТекст = "";
	Если ПлатежноРасчетныеДокументы <> Неопределено Тогда
		ТаблицаПлатежныхДокументов = ПлатежноРасчетныеДокументы.СкопироватьКолонки();
		Если ТипЗнч(ПлатежноРасчетныеДокументы) = Тип("ТаблицаЗначений") Тогда
			Отбор = Новый Структура("СчетФактура", ВыборкаСФ.СчетФактура);
			НайденныеСтроки = ПлатежноРасчетныеДокументы.НайтиСтроки(Отбор);
			РазделятьПоКонтрагентам = ТаблицаПлатежныхДокументов.Колонки.Найти("Контрагент") <> Неопределено;
			ПредыдущийКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
			Для каждого ДокументОплаты Из НайденныеСтроки Цикл
				Контрагент = ?(РазделятьПоКонтрагентам, ДокументОплаты.Контрагент, Справочники.Контрагенты.ПустаяСсылка());
				Если ЗначениеЗаполнено(ДокументОплаты.НомерДокумента)
					И ЗначениеЗаполнено(ДокументОплаты.ДатаДокумента) Тогда
					ЗаполнитьЗначенияСвойств(ТаблицаПлатежныхДокументов.Добавить(), ДокументОплаты);
					ПоДокументу = ПоДокументу + ?(Не ДокументОплаты.НомерСтроки = 1 И Контрагент <> ПредыдущийКонтрагент, "; ", ?(ПустаяСтрока(ПоДокументу), "",", ")) +
						ДокументОплаты.НомерДокумента + " от " + Формат(ДокументОплаты.ДатаДокумента, "ДЛФ='Д'");
				КонецЕсли;
				ПредыдущийКонтрагент = Контрагент;
				Если ЗначениеЗаполнено(ДокументОплаты.НомерСчетаФактурыНаАванс) Тогда
					АвансовыеСчетаФактурыНомерДата = СтрШаблон(НСтр("ru='№ %1 от %2, исправление № %3 от %4 '"),
						ДокументОплаты.НомерСчетаФактурыНаАванс, Формат(ДокументОплаты.ДатаСчетаФактурыНаАванс, "ДФ=dd.MM.yyyy"),
						ДокументОплаты.НомерИсправленияСчетаФактурыНаАванс, Формат(ДокументОплаты.ДатаИсправленияСчетаФактурыНаАванс, "ДФ=dd.MM.yyyy"));
					АвансовыеСчетаФактурыТекст = АвансовыеСчетаФактурыТекст 
						+ ?(Не ЗначениеЗаполнено(АвансовыеСчетаФактурыТекст), "", "; ") + АвансовыеСчетаФактурыНомерДата;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ПоДокументу) Тогда
		Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс
			ИЛИ ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАвансКомитента Тогда
			ПоДокументу = "-- от --";
		Иначе
			ПоДокументу = "   от   ";
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(АвансовыеСчетаФактурыТекст) Тогда
		АвансовыеСчетаФактурыТекст = "№   от   , исправление №   от   ";
	КонецЕсли;
	
	ДанныеШапки.Вставить("ТаблицаПлатежныхДокументов", ТаблицаПлатежныхДокументов);
	ДанныеШапки.Вставить("ПоДокументу", ПоДокументу);
	ДанныеШапки.Вставить("АвансовыеСчетаФактурыТекст", АвансовыеСчетаФактурыТекст);
	ДанныеШапки.Вставить("ПлатежноРасчетныеДокументы", ПлатежноРасчетныеДокументы);
	
	Валюта = ""; 
	ВалютаКод = "";
	ВалютаКурс = 0; 
	ВалютаКратность = 0;
	ВалютаНаименование = "";
	
	// Валюта
	Если ЗначениеЗаполнено(Реквизиты.Валюта) Тогда
		РеквизитыВалюты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Реквизиты.Валюта, "НаименованиеПолное,Код");
		СтруктураКурса  = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Реквизиты.Валюта, Реквизиты.ДатаОснования);
		
		Валюта             = РеквизитыВалюты.НаименованиеПолное + ", " + РеквизитыВалюты.Код;
		ВалютаНаименование = РеквизитыВалюты.НаименованиеПолное;
		ВалютаКод          = РеквизитыВалюты.Код;
		ВалютаКурс         = СтруктураКурса.Курс;
		ВалютаКратность    = СтруктураКурса.Кратность;
	КонецЕсли;
	
	ДанныеШапки.Вставить("Валюта", Реквизиты.Валюта);
	ДанныеШапки.Вставить("ВалютаНаименование", Валюта);
	ДанныеШапки.Вставить("ВалютаНаименованиеПолное", ВалютаНаименование);
	ДанныеШапки.Вставить("ВалютаКод", ВалютаКод);
	ДанныеШапки.Вставить("ВалютаКурс", ВалютаКурс);
	ДанныеШапки.Вставить("ВалютаКратность", ВалютаКратность);
	ДанныеШапки.Вставить("ИдентификаторГосКонтракта", ВыборкаСФ.ИдентификаторГосКонтракта);
	
	Если Реквизиты.Свойство("НДСИсчисляетсяНалоговымАгентом") Тогда
		НДСИсчисляетсяНалоговымАгентом = Реквизиты.НДСИсчисляетсяНалоговымАгентом = Истина
			И УчетНДС.ВедетсяУчетНДСПоФЗ335(ВыборкаСФ.Дата);
	Иначе
		НДСИсчисляетсяНалоговымАгентом = Ложь;
	КонецЕсли;
	
	ДанныеШапки.Вставить("НДСИсчисляетсяНалоговымАгентом", НДСИсчисляетсяНалоговымАгентом);
	
	// Сведения о комиссионере
	Если ВыборкаСФ.ЭтоСчетФактураВыданный 
		И (ТипЗнч(Реквизиты.Поставщик) = Тип("СправочникСсылка.Контрагенты")
		ИЛИ ТипЗнч(Реквизиты.Поставщик) = Тип("Строка"))
		И ТипЗнч(Реквизиты.Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		Комиссионер = Реквизиты.Организация;
	ИначеЕсли НЕ ВыборкаСФ.ЭтоСчетФактураВыданный 
		И ВыборкаСФ.Контрагент <> Реквизиты.Поставщик
		И ВыборкаСФ.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку Тогда
		Комиссионер = ВыборкаСФ.Контрагент;
	Иначе
		Комиссионер = Неопределено;
	КонецЕсли;
	
	СведенияОКомиссионере = Неопределено;
	Если ЗначениеЗаполнено(Комиссионер) Тогда
		ДанныеШапки.Вставить("Комиссионер", Комиссионер);
		
		СведенияОКомиссионере = СведенияОЮрФизЛицах[Комиссионер];
		Если СведенияОКомиссионере = Неопределено Тогда
			//AF_ЭДО 
			//СведенияОКомиссионере = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Комиссионер, ВыборкаСФ.ДатаСведений, , , , Истина);
			СведенияОКомиссионере = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Комиссионер, ВыборкаСФ.ДатаСведений);
			//AF_ЭДО 
			СведенияОЮрФизЛицах.Вставить(Комиссионер, СведенияОКомиссионере);
		КонецЕсли;
		КППКомиссионера = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "Составлен комиссионером (агентом): " 
			+ ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,")
			+ ", " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ЮридическийАдрес,")
			+ ", ИНН/КПП: " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь)
			+ ?(ЗначениеЗаполнено(КППКомиссионера), "/" + КППКомиссионера, ""));
	
	Иначе
		ДанныеШапки.Вставить("Комиссионер", Неопределено);
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "");
	КонецЕсли;
	
	// Данные комиссионера на стороне комитентов 
	Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
		
		Если Реквизиты.Свойство("Комиссионер") И ЗначениеЗаполнено(Реквизиты.Комиссионер) Тогда
			
			СведенияОКомиссионере = СведенияОЮрФизЛицах[Реквизиты.Комиссионер];
			Если СведенияОКомиссионере = Неопределено Тогда
				//AF_ЭДО 
				//СведенияОКомиссионере = 
				//	БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Комиссионер, ВыборкаСФ.ДатаСведений, , , , Истина);
				СведенияОКомиссионере = 
					CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Комиссионер, ВыборкаСФ.ДатаСведений);
				//AF_ЭДО 
				СведенияОЮрФизЛицах.Вставить(Реквизиты.Комиссионер, СведенияОКомиссионере);
			КонецЕсли;
			
			КППКомиссионера = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
			ПредставлениеКомиссионера =
				ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,");
			ПредставлениеКомиссионераНаПечать = ПредставлениеКомиссионера
			+ ", ИНН/КПП: " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь)
			+ ?(ЗначениеЗаполнено(КППКомиссионера), "/" + КППКомиссионера, "");
			
			Если Реквизиты.Свойство("СчетаФактурыКомиссионера") И ЗначениеЗаполнено(Реквизиты.СчетаФактурыКомиссионера) Тогда

				ДанныеШапки.ПредставлениеКомиссионера = 
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Выставлен комиссионеру %1, по счетам-фактурам %2'"),
					ПредставлениеКомиссионераНаПечать, Реквизиты.СчетаФактурыКомиссионера);
			
			Иначе
				ДанныеШапки.ПредставлениеКомиссионера = 
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Выставлен комиссионеру %1, по счету-фактуре № %2 от %3'"),
					ПредставлениеКомиссионераНаПечать, Реквизиты.НомерСФКомиссионера,
						Формат(Реквизиты.ДатаСФКоммиссионера, "ДФ=dd.MM.yyyy"));
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;

	// Данные для подвала
	Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
		
		ОрганизацияЭтоЮрЛицо = ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Реквизиты.Организация);
		
		// Получаем за один вызов данные по всем необходимым физлицам.
		СписокФизЛиц = Новый Массив;
		//AF_ЭДО
		//Если (ОрганизацияЭтоЮрЛицо ИЛИ ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата))
		//   И ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
		Если (ОрганизацияЭтоЮрЛицо ИЛИ УчетНДС.ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата))
			И ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
		//AF_ЭДО
			СписокФизЛиц.Добавить(ВыборкаСФ.Руководитель);
		КонецЕсли;
		Если ОрганизацияЭтоЮрЛицо
		   И ЗначениеЗаполнено(ВыборкаСФ.ГлавныйБухгалтер) Тогда
			СписокФизЛиц.Добавить(ВыборкаСФ.ГлавныйБухгалтер);
		КонецЕсли;
		Если ДополнитьДаннымиУПД Тогда
			Если Реквизиты.ЕстьТовары Тогда
				Кладовщик = ?(ЗначениеЗаполнено(Реквизиты.ОтпускПроизвел), Реквизиты.ОтпускПроизвел,
					ОтветственныеЛицаБП.ОтветственноеЛицоНаСкладе(Реквизиты.Склад, Реквизиты.ДатаОснования));
				Если ЗначениеЗаполнено(Кладовщик) Тогда
					СписокФизЛиц.Добавить(Кладовщик);
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Реквизиты.Исполнитель) Тогда
				СписокФизЛиц.Добавить(Реквизиты.Исполнитель);
			КонецЕсли;
			Если ЗначениеЗаполнено(Реквизиты.ОтветственныйЗаОформление) Тогда
				СписокФизЛиц.Добавить(Реквизиты.ОтветственныйЗаОформление);
			КонецЕсли; 
		КонецЕсли;
		Если СписокФизЛиц.Количество() > 0 Тогда
			ДанныеОтветственныхЛиц = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, СписокФизЛиц, ВыборкаСФ.ДатаСведений, Истина, Истина);
		Иначе
			ДанныеОтветственныхЛиц = Новый ТаблицаЗначений;
			ДанныеОтветственныхЛиц.Колонки.Добавить("ФизическоеЛицо");
		КонецЕсли;
		
		Если ОрганизацияЭтоЮрЛицо Тогда
			
			Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Реквизиты.Организация, ВыборкаСФ.Дата, Реквизиты.Подразделение);
			// Должность руководителя в организации.
			ДанныеШапки.Вставить("ДолжностьРуководителя", Руководители.РуководительДолжностьПредставление);
			Если ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица = ДанныеОтветственныхЛиц.Найти(ВыборкаСФ.Руководитель, "ФизическоеЛицо");
				ПредставлениеФизЛица = ?(ДанныеФизЛица = Неопределено, "", ДанныеФизЛица.Представление);
				ФизическоеЛицо       = ?(ДанныеФизЛица = Неопределено, Справочники.ФизическиеЛица.ПустаяСсылка(), ДанныеФизЛица.ФизическоеЛицо);
				СтруктураФИО         = ?(ДанныеФизЛица = Неопределено, Новый Структура("Фамилия, Имя, Отчество, Представление"), СтруктураФИО(ДанныеФизЛица));
				
				ДанныеШапки.Вставить("ФИОРуководителя", ПредставлениеФизЛица);
				ДанныеШапки.Вставить("Руководитель",    ФизическоеЛицо);
				ДанныеШапки.Вставить("РуководительФИО", СтруктураФИО);
				
				// Должность уполномоченного лица обладающего правом подписи за руководителя.
				Если Руководители.Руководитель = ВыборкаСФ.Руководитель 
					И НЕ ЗначениеЗаполнено(ДанныеФизЛица.Должность) Тогда
					ДанныеШапки.Вставить("РуководительДолжность", Руководители.РуководительДолжностьПредставление);
				Иначе
					ДанныеШапки.Вставить("РуководительДолжность", ДанныеФизЛица.Должность);
				КонецЕсли;
			Иначе 
				ДанныеШапки.Вставить("ФИОРуководителя", Руководители.РуководительПредставление);
				ДанныеШапки.Вставить("Руководитель",    Руководители.Руководитель);
				ДанныеШапки.Вставить("РуководительФИО", Руководители.РуководительФИО);
				ДанныеШапки.Вставить("РуководительДолжность", Руководители.РуководительДолжностьПредставление);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаСФ.ГлавныйБухгалтер) Тогда
				ДанныеФизЛица = ДанныеОтветственныхЛиц.Найти(ВыборкаСФ.ГлавныйБухгалтер, "ФизическоеЛицо");
				ПредставлениеФизЛица = ?(ДанныеФизЛица = Неопределено, "", ДанныеФизЛица.Представление);
				ФизическоеЛицо       = ?(ДанныеФизЛица = Неопределено, Справочники.ФизическиеЛица.ПустаяСсылка(), ДанныеФизЛица.ФизическоеЛицо);
				СтруктураФИО         = ?(ДанныеФизЛица = Неопределено, Новый Структура("Фамилия, Имя, Отчество, Представление"), СтруктураФИО(ДанныеФизЛица));
				
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", ПредставлениеФизЛица);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      ФизическоеЛицо);
				ДанныеШапки.Вставить("ГлавныйБухгалтерФИО",   СтруктураФИО);
			Иначе 
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтерПредставление);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      Руководители.ГлавныйБухгалтер);
				ДанныеШапки.Вставить("ГлавныйБухгалтерФИО",   Руководители.ГлавныйБухгалтерФИО);
			КонецЕсли;
		
		Иначе
			СтатусФизическогоЛица = Справочники.Организации.СтатусФизическогоЛицаНаДату(
				Реквизиты.Организация, ВыборкаСФ.Дата);
			Если СтатусФизическогоЛица = Перечисления.СтатусыФизическихЛиц.ИндивидуальныйПредприниматель Тогда
				Должность = НСтр("ru = 'Индивидуальный предприниматель'");
			Иначе
				Должность = "";
			КонецЕсли;
			ДанныеШапки.Вставить("ДолжностьРуководителя", Должность);
			ДанныеШапки.Вставить("Свидетельство", БухгалтерскийУчетПереопределяемый.СвидетельствоОРегистрации(
				СведенияОбОрганизации,
				ВыборкаСФ.Дата));
			
			//AF_ЭДО
			//Если ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата) 
			Если УчетНДС.ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата) 
			//AF_ЭДО
			   И ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица = ДанныеОтветственныхЛиц.Найти(ВыборкаСФ.Руководитель, "ФизическоеЛицо");
				СтруктураФИО         = ?(ДанныеФизЛица = Неопределено, Новый Структура("Фамилия, Имя, Отчество, Представление"), СтруктураФИО(ДанныеФизЛица));
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ?(ДанныеФизЛица = Неопределено, "", ДанныеФизЛица.Представление));
				ДанныеШапки.Вставить("ПБОЮЛФИО", СтруктураФИО);
				ДанныеШапки.Вставить("Руководитель",          ВыборкаСФ.Руководитель);
				
				// Должность уполномоченного лица обладающего правом подписи за руководителя.
				Если СведенияОбОрганизации.ИндивидуальныйПредприниматель = ВыборкаСФ.Руководитель 
					И НЕ ЗначениеЗаполнено(ДанныеФизЛица.Должность) Тогда
					ДанныеШапки.Вставить("РуководительДолжность", ДанныеШапки.ДолжностьРуководителя);
				Иначе
					ДанныеШапки.Вставить("РуководительДолжность", ДанныеФизЛица.Должность);
				КонецЕсли;
			Иначе
				СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СведенияОбОрганизации.ФИОФизлица);
				СтруктураФИО.Вставить("Представление", СведенияОбОрганизации.ФИОФизлица);
				
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "ФамилияИнициалыФизлица,"));
				ДанныеШапки.Вставить("ПБОЮЛФИО", СтруктураФИО);
				ДанныеШапки.Вставить("РуководительДолжность", ДанныеШапки.ДолжностьРуководителя);
				ДанныеШапки.Вставить("Руководитель", СведенияОбОрганизации.ИндивидуальныйПредприниматель);
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Если НЕ ТипЗнч(Реквизиты.Поставщик) = Тип("Строка")
			И НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Реквизиты.Поставщик) Тогда
			ДанныеШапки.Вставить("Свидетельство", БухгалтерскийУчетПереопределяемый.СвидетельствоОРегистрации(
				СведенияОПоставщике,
				ВыборкаСФ.Дата));
		КонецЕсли;
	КонецЕсли;
	
	Если Реквизиты.Свойство("БезвозмезднаяПередача") Тогда
		Если Реквизиты.БезвозмезднаяПередача И НЕ ЗначениеЗаполнено(Реквизиты.Покупатель) Тогда
			ДанныеШапки.Покупатель = Неопределено;
			ДанныеШапки.ПредставлениеПокупателя="--";
			// Адрес покупателя
			ДанныеШапки.АдресПокупателя="--";
			ДанныеШапки.ИННпокупателя="--";
		КонецЕсли;
	КонецЕсли;
	
	// Данные для универсального передаточного документа
	Если ДополнитьДаннымиУПД Тогда
		
		// Наименование экономического субъекта - составителя документа
		Если ЗначениеЗаполнено(Комиссионер) И СведенияОКомиссионере <> Неопределено Тогда
			ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,");
			ИННПоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь);
			КПППоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		Иначе
			ПредставлениеПоставщика = ДанныеШапки.ПредставлениеПоставщика;
			ИННПоставщика           = ДанныеШапки.ИННПоставщика;
			КПППоставщика           = ДанныеШапки.КПППоставщика;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КПППоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ПредставлениеПоставщика, ИННПоставщика, КПППоставщика);
		ИначеЕсли ЗначениеЗаполнено(ИННПоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ПредставлениеПоставщика, ИННПоставщика);
		Иначе
			ПредставлениеОрганизации = ПредставлениеПоставщика;
		КонецЕсли;
		ДанныеШапки.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		
		Если ЗначениеЗаполнено(ДанныеШапки.КППпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ДанныеШапки.ПредставлениеПокупателя, ДанныеШапки.ИННпокупателя, ДанныеШапки.КППпокупателя);
		ИначеЕсли ЗначениеЗаполнено(ДанныеШапки.ИННпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ДанныеШапки.ПредставлениеПокупателя, ДанныеШапки.ИННпокупателя);
		Иначе
			ПредставлениеКонтрагента = ДанныеШапки.ПредставлениеПокупателя;
		КонецЕсли;
		
		ДанныеШапки.Вставить("ПредставлениеКонтрагента", ПредставлениеКонтрагента);
		
		// Статус
		Если НЕ ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) Тогда
			СтатусУПД = 2;
			ДанныеШапки.Вставить("ПоДокументу",  "-- от --");
		Иначе
			СтатусУПД = 1;
		КонецЕсли;
		
		ДанныеШапки.Вставить("СтатусУПД", СтатусУПД);
		ДанныеШапки.Вставить("СопроводительныеДокументы", Реквизиты.СопроводительныеДокументы);
		
		ДанныеТранспортнаяНакладная = Новый Массив;
		
		Если Реквизиты.ПеревозкаАвтотранспортом И ЗначениеЗаполнено(Реквизиты.ДокументОснование) Тогда
			
			Если ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				СписокРеквизитов = Новый Структура("Дата, Номер", "ИсправляемыйДокументРеализации.Дата", "ИсправляемыйДокументРеализации.Номер");
			Иначе
				СписокРеквизитов = "Дата, Номер";
			КонецЕсли; 
			
			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Реквизиты.ДокументОснование, СписокРеквизитов);
			НомерОснования     = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыОснования.Номер, Истина, Ложь);
			
			ДанныеШапки.Вставить("ТранспортнаяНакладнаяДата",  РеквизитыОснования.Дата);
			ДанныеШапки.Вставить("ТранспортнаяНакладнаяНомер", НомерОснования);
			
			ПредставлениеТранспортнаяНакладная = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Транспортная накладная № %1 от %2'"),
				ДанныеШапки.ТранспортнаяНакладнаяНомер, 
				Формат(ДанныеШапки.ТранспортнаяНакладнаяДата, "ДЛФ=ДД"));

			ДанныеТранспортнаяНакладная.Добавить(ПредставлениеТранспортнаяНакладная);
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Реквизиты.Перевозчик) Тогда
			ДанныеШапки.Вставить("Перевозчик", Реквизиты.Перевозчик);
			
			ДанныеПеревозчик = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Перевозчик, ВыборкаСФ.ДатаСведений, , , , Истина);
			
			ПредставлениеПеревозчик = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Перевозчик %1'"),
				ДанныеПеревозчик.НаименованиеДляПечатныхФорм);
				
			ДанныеТранспортнаяНакладная.Добавить(ПредставлениеПеревозчик);
		Иначе
			ДанныеШапки.Вставить("Перевозчик", Неопределено);
		КонецЕсли;
		
		ДанныеШапки.Вставить("СведенияОТранспортировке", Реквизиты.СведенияОТранспортировкеИГрузе);
		
		Если ЗначениеЗаполнено(Реквизиты.СведенияОТранспортировкеИГрузе) Тогда
			ДанныеТранспортнаяНакладная.Добавить(Реквизиты.СведенияОТранспортировкеИГрузе);
		КонецЕсли; 
		
		
		ДанныеШапки.Вставить("ДанныеТранспортнаяНакладная", СтрСоединить(ДанныеТранспортнаяНакладная, ", "));
		
		// Номер
		Если СтатусУПД = 2 Тогда
			Если ТипЗнч(ВыборкаСФ.ДокументОснование) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
				ДанныеШапки.Номер = ДанныеШапки.Номер + "/" + ВыборкаСФ.НомерСтроки;
			КонецЕсли;
		КонецЕсли;
		
		ПередачаТоваровКомиссионеру = Реквизиты.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
			И ТипЗнч(Реквизиты.ДокументОснование) <> Тип("ДокументСсылка.ОтчетКомиссионераОПродажах");
		// По отчету комиссионера печатается УПД за поставщика (комиссионера).
		ПередачаТоваровКомитенту = ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ПередачаТоваров");
			
		БезПереходаПраваСобственности = ПередачаТоваровКомиссионеру ИЛИ ПередачаТоваровКомитенту;
			
		Если Реквизиты.Свойство("БезвозмезднаяПередача") Тогда
			Если Реквизиты.БезвозмезднаяПередача Тогда
				БезПереходаПраваСобственности = Ложь;
			КонецЕсли;
		КонецЕсли;
			
		// В соответствии с письмом ФНС России от 21.10.2013 N ММВ-20-3/96@ "Об отсутствии налоговых рисков при применении 
		// налогоплательщиками первичного документа, составленного на основе формы счета-фактуры", в УПД со статусом 2 при передаче
		// без перехода права собственности строки (2),(2а),(2б) и (6),(6а),(6б) не заполняются.
		
		Если БезПереходаПраваСобственности И СтатусУПД = 2 Тогда
			
			// Поставщик и Грузоотправитель
			Если ТипЗнч(ДанныеШапки.Грузоотправитель) = Тип("Строка") Тогда // "он же"
				ДанныеШапки.Грузоотправитель              = ДанныеШапки.Поставщик;
				ДанныеШапки.ПредставлениеГрузоотправителя = ДанныеШапки.ПредставлениеПоставщика 
					+ ?(ПустаяСтрока(ДанныеШапки.АдресПоставщика), "", ", ") + ДанныеШапки.АдресПоставщика;
			КонецЕсли;
			
			ДанныеШапки.Поставщик               = Неопределено; //
			ДанныеШапки.ПредставлениеПоставщика = "--";         // (2)
			ДанныеШапки.АдресПоставщика         = "--";         // (2а)
			ДанныеШапки.ИННПоставщика           = "--";         //
			ДанныеШапки.КПППоставщика           = "";           // (2б)
		
			// Покупатель и Грузополучатель
			Если ТипЗнч(ДанныеШапки.Грузополучатель) = Тип("Строка") Тогда // "он же"
				ДанныеШапки.Грузополучатель              = ДанныеШапки.Покупатель;
				ДанныеШапки.ПредставлениеГрузополучателя = ДанныеШапки.ПредставлениеПокупателя
					+ ?(ПустаяСтрока(ДанныеШапки.АдресПокупателя), "", ", ") + ДанныеШапки.АдресПокупателя;
			КонецЕсли;
			
			ДанныеШапки.Покупатель              = Неопределено; //
			ДанныеШапки.ПредставлениеПокупателя = "--";         // (6)
			ДанныеШапки.АдресПокупателя         = "--";         // (6а)
			ДанныеШапки.ИННПокупателя           = "--";         //
			ДанныеШапки.КПППокупателя           = "";           // (6б)
			
		КонецЕсли;
		
		// Основание передачи (сдачи)
		Основание = СокрП(Реквизиты.Основание);
		
		ДанныеШапки.Вставить("ОснованиеДата", Реквизиты.ОснованиеДата);
		ДанныеШапки.Вставить("ОснованиеНомер", Реквизиты.ОснованиеНомер);
		ДанныеШапки.Вставить("ОснованиеВид", Реквизиты.ВидДоговора);
		
		ФИОТоварПолучил = "";
		
		Если Реквизиты.Свойство("РежимЗаполненияОснованияПередачи") Тогда
			ПараметрыЗаполнения = Новый Структура("Основание, ОснованиеПередачи, ДокументОснование,
				|РежимЗаполненияОснованияПередачи, ДоверенностьВыдана, ДоверенностьДата, ДоверенностьНомер,
				|ОснованиеДата, ОснованиеНомер");
			
			ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, Реквизиты);
			
			ОснованияПередачи = Новый Массив;
			//AF_ЭДО
			//ЗаполнитьСписокОснований(ПараметрыЗаполнения, ОснованияПередачи);
			УчетНДС.ЗаполнитьСписокОснований(ПараметрыЗаполнения, ОснованияПередачи);
			//AF_ЭДО
		
			//AF_ЭДО
			//Основание = ОснованиеПередачиПоРежимуЗаполнения(ПараметрыЗаполнения);
			Основание = УчетНДС.ОснованиеПередачиПоРежимуЗаполнения(ПараметрыЗаполнения);
			//AF_ЭДО
		
			ДанныеШапки.Вставить("РежимЗаполненияОснованияПередачи", Реквизиты.РежимЗаполненияОснованияПередачи);
			ДанныеШапки.Вставить("ОснованияПередачи", ОснованияПередачи);
		ИначеЕсли ЗначениеЗаполнено(Реквизиты.ДоверенностьНомер)
			ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьДата)
			ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьВыдана) Тогда
				Доверенность = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'по доверенности №%1 от %2 выданной %3'"),
					Реквизиты.ДоверенностьНомер, Формат(Реквизиты.ДоверенностьДата, "ДЛФ=ДД"),
					Реквизиты.ДоверенностьВыдана);
				
				Основание = Основание + ?(ПустаяСтрока(Основание), "", "; ") + Доверенность;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Реквизиты.ДоверенностьНомер)
		ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьДата)
		ИЛИ ЗначениеЗаполнено(Реквизиты.ДоверенностьВыдана) Тогда
			ФИОТоварПолучил = Реквизиты.ДоверенностьЧерезКого;
		ИначеЕсли ЗначениеЗаполнено(Реквизиты.ДоверенностьЧерезКого) Тогда
			ФИОТоварПолучил = Реквизиты.ДоверенностьЧерезКого+?(ЗначениеЗаполнено(Реквизиты.ЗаЗаказчикаНаОсновании),", "+Реквизиты.ЗаЗаказчикаНаОсновании,"");
		КонецЕсли;
		
		ДанныеШапки.Вставить ("Основание",       Основание);
		ДанныеШапки.Вставить ("ФИОТоварПолучил", ФИОТоварПолучил);
		Если Реквизиты.Свойство("БанковскийСчетПродавца") Тогда
			ДанныеШапки.Вставить ("БанковскийСчетПродавца", Реквизиты.БанковскийСчетПродавца);
		КонецЕсли;
		
		Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
			
			// Товар (груз) передал / услуги, результаты работ, права сдал
			
			Если Реквизиты.ЕстьТовары Тогда
				
				ДанныеКладовщика = ДанныеОтветственныхЛиц.Найти(Кладовщик, "ФизическоеЛицо");
				Если Кладовщик = ДанныеШапки.Руководитель И НЕ ОрганизацияЭтоЮрЛицо Тогда
					
					ДанныеШапки.Вставить("Кладовщик",           ДанныеШапки.Руководитель);
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеШапки.РуководительДолжность);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеШапки.ФИОПБОЮЛ);
					ДанныеШапки.Вставить("КладовщикФИО",        ДанныеШапки.ПБОЮЛФИО);
					
				ИначеЕсли ДанныеКладовщика <> Неопределено Тогда
					ДанныеШапки.Вставить("Кладовщик", Кладовщик);
					
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеКладовщика.Должность);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеКладовщика.Представление);
					ДанныеШапки.Вставить("КладовщикФИО", СтруктураФИО(ДанныеКладовщика));
				Иначе
					ДанныеШапки.Вставить("Кладовщик", Справочники.ФизическиеЛица.ПустаяСсылка());
					
					ДанныеШапки.Вставить("ДолжностьКладовщика");
					ДанныеШапки.Вставить("ФИОКладовщика", "");
					ДанныеШапки.Вставить("КладовщикФИО", Новый Структура("Фамилия, Имя, Отчество, Представление"));
				КонецЕсли;
				
			Иначе
				
				Если ЗначениеЗаполнено(Реквизиты.Исполнитель) Тогда
					
					ДанныеИсполнителя = ДанныеОтветственныхЛиц.Найти(Реквизиты.Исполнитель, "ФизическоеЛицо");
					Если ДанныеИсполнителя = Неопределено Тогда
						ДанныеШапки.Вставить("Кладовщик", Справочники.ФизическиеЛица.ПустаяСсылка());
						
						ДанныеШапки.Вставить("ДолжностьКладовщика");
						ДанныеШапки.Вставить("ФИОКладовщика", "");
						ДанныеШапки.Вставить("КладовщикФИО", Новый Структура("Фамилия, Имя, Отчество, Представление"));
					Иначе
						ДанныеШапки.Вставить("Кладовщик",           Реквизиты.Исполнитель);
						ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеИсполнителя.Должность);
						ДанныеШапки.Вставить("ФИОКладовщика",       ?(ЗначениеЗаполнено(ДанныеИсполнителя.Представление), ДанныеИсполнителя.Представление, "")
							+ ?(ЗначениеЗаполнено(Реквизиты.ИсполнительНаОсновании), " ", "") + Реквизиты.ИсполнительНаОсновании);
						ДанныеШапки.Вставить("КладовщикФИО", СтруктураФИО(ДанныеИсполнителя));
					КонецЕсли;
					
				ИначеЕсли ОрганизацияЭтоЮрЛицо Тогда
					ДанныеШапки.Вставить("Кладовщик",           ДанныеШапки.Руководитель);
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеШапки.РуководительДолжность);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеШапки.ФИОРуководителя);
					ДанныеШапки.Вставить("КладовщикФИО",        ДанныеШапки.РуководительФИО);
				Иначе
					ДанныеШапки.Вставить("Кладовщик",           ДанныеШапки.Руководитель);
					ДанныеШапки.Вставить("ДолжностьКладовщика", ДанныеШапки.РуководительДолжность);
					ДанныеШапки.Вставить("ФИОКладовщика",       ДанныеШапки.ФИОПБОЮЛ);
					ДанныеШапки.Вставить("КладовщикФИО",        ДанныеШапки.ПБОЮЛФИО);
				КонецЕсли;
				
			КонецЕсли;
			
			// Ответственный за правильность оформления факта хозяйственной жизни
			Если ЗначениеЗаполнено(Реквизиты.ОтветственныйЗаОформление) Тогда
				ДанныеОтветственного        = ДанныеОтветственныхЛиц.Найти(Реквизиты.ОтветственныйЗаОформление, "ФизическоеЛицо");
				
				ДолжностьОтветственного     = ?(ДанныеОтветственного = Неопределено, "", ДанныеОтветственного.Должность);
				ПредставлениеОтветственного = ?(ДанныеОтветственного = Неопределено, "", ДанныеОтветственного.Представление);
				СтруктураФИО                = ?(ДанныеОтветственного = Неопределено, Новый Структура("Фамилия, Имя, Отчество, Представление"), СтруктураФИО(ДанныеОтветственного));
				
				ДанныеШапки.Вставить("ДолжностьОтветственного", ДолжностьОтветственного);
				ДанныеШапки.Вставить("ФИООтветственного",       ПредставлениеОтветственного);
				ДанныеШапки.Вставить("ОтветственныйФИО",        СтруктураФИО);
				ДанныеШапки.Вставить("ОтветственныйЗаОформление", Реквизиты.ОтветственныйЗаОформление);
				
			ИначеЕсли ОрганизацияЭтоЮрЛицо Тогда
				
				ДанныеШапки.Вставить("ДолжностьОтветственного", ДанныеШапки.РуководительДолжность);
				ДанныеШапки.Вставить("ФИООтветственного",       ДанныеШапки.ФИОРуководителя);
				ДанныеШапки.Вставить("ОтветственныйФИО",        ДанныеШапки.РуководительФИО);
				ДанныеШапки.Вставить("ОтветственныйЗаОформление", ДанныеШапки.Руководитель);
				
			Иначе
				
				ДанныеШапки.Вставить("ДолжностьОтветственного", ДанныеШапки.РуководительДолжность);
				ДанныеШапки.Вставить("ФИООтветственного",       ДанныеШапки.ФИОПБОЮЛ);
				ДанныеШапки.Вставить("ОтветственныйФИО",        ДанныеШапки.ПБОЮЛФИО);
				ДанныеШапки.Вставить("ОтветственныйЗаОформление", ДанныеШапки.Руководитель);
				
			КонецЕсли;
			
			// Дата отгрузки, передачи (сдачи)
			ШаблонДатыОтгрузкиПередачи = Формат(Реквизиты.ДатаОснования, "ДФ='« дд » %1 ММММ %2 гггг  %3'");
			
			ДлинаДаты = 30;
			ДобавитьСимволовСлева  = Окр((ДлинаДаты - СтрДлина(ШаблонДатыОтгрузкиПередачи))/2, 0);
			ДобавитьСимволовСправа = ДлинаДаты - СтрДлина(ШаблонДатыОтгрузкиПередачи) - ДобавитьСимволовСлева;
			
			ДатаОтгрузкиПередачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонДатыОтгрузкиПередачи, 
				СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", ДобавитьСимволовСлева),
				СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов(" ", ДобавитьСимволовСправа),
				НСтр("ru = 'года'"));
			
			ДанныеШапки.Вставить ("ДатаОтгрузкиПередачи", ДатаОтгрузкиПередачи);
			
		КонецЕсли;
	
	КонецЕсли;

	//AF_ЭДО   
	CW_ЭДО.ДополнитьСтруктураДанныеШапки(ДанныеШапки, Реквизиты, СведенияОЮрФизЛицах);
	//AF_ЭДО
	
	Возврат ДанныеШапки;

КонецФункции


Процедура ДополнитьСтруктураДанныеШапки(ДанныеШапки, Реквизиты, СведенияОЮрФизЛицах=Неопределено) Экспорт

	ДанныеШапки.Вставить("ВедущийДокумент", 					Реквизиты.ВедущийДокумент);
	ДанныеШапки.Вставить("ПараметрыВыводаРеальныхПродавцов",	Реквизиты.ПараметрыВыводаРеальныхПродавцов);

	УстановитьПредставлениеКомиссионера(ДанныеШапки, Реквизиты, СведенияОЮрФизЛицах);

КонецПроцедуры

Процедура УстановитьПредставлениеКомиссионера(ДанныеШапки, Реквизиты, СведенияОЮрФизЛицах=Неопределено)
	
	Если Реквизиты.ПараметрыВыводаРеальныхПродавцов.ВыводитьРеальныхПродавцов Тогда  
		
		СведенияОбОрганизация = СведенияОЮрФизЛицах[Реквизиты.Организация];
		КППОрганизация = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизация, "КПП,", Ложь);  
		
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", СокрЛП(Реквизиты.ПараметрыВыводаРеальныхПродавцов.ПредставлениеАгента)
		+ ": " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизация, "НаименованиеДляПечатныхФорм,")
		+ ", " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизация, "ЮридическийАдрес,")
				+ ", ИНН/КПП: " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизация, "ИНН,", Ложь)
				+ ?(ЗначениеЗаполнено(КППОрганизация), "/" + КППОрганизация, ""));
				
	Конецесли;
			
КонецПроцедуры

Функция ПолучитьПараметрыВыводаРеальныхПродавцов(ВедущийДокумент, ДанныеСчетаФактуры)  
	
	Структура = Новый Структура("ВыводитьРеальныхПродавцов,ПредставлениеАгента, Поставщики", Ложь, "", Новый Массив);                
	
	Если НЕ ВедущийДокумент.ФормируетсяСчетФактура 
		ИЛИ Не ЗначениеЗаполнено(ДанныеСчетаФактуры.СчетФактура) Тогда
		Возврат Структура;	
	КонецЕсли;
	
	// параметры договора
	СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметровДоговора.Дата 				= ВедущийДокумент.Дата;
	СтруктураПараметровДоговора.Договор 			= ВедущийДокумент.Договор;
	
	//ВариантВыводаСводнойСчетФактуры - 0 - своя органиазция; 1 - поставщки
	ПолучаемыеПараметры  	 = "ПродавецПоСФСвояОрганизация;ПредставлениеАгентаДляСчетаФактуры";
	ПараметрыДоговора		= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора, ПолучаемыеПараметры); 
	
	Если ПараметрыДоговора.ПродавецПоСФСвояОрганизация Тогда
		Возврат Структура;	
	КонецЕсли;

	мПорядокОтражения = Новый Массив;
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ВедущийДокумент
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.ПорядокОтражения В (&мПорядокОтражения)";
	
	Запрос.УстановитьПараметр("ВедущийДокумент", 	ВедущийДокумент);
	Запрос.УстановитьПараметр("мПорядокОтражения", 	мПорядокОтражения);  
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат Структура;	
	КонецЕсли;  

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫБОР
	               |		КОГДА CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов.Продавец
	               |		ИНАЧЕ CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов.Контрагент
	               |	КОНЕЦ КАК Поставщик
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ВедущийДокумент";
	
	Запрос.УстановитьПараметр("ВедущийДокумент", ВедущийДокумент);
	
	РезультатЗапроса 	= Запрос.Выполнить();
	Поставщики 			= РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Поставщик");
	
	Структура.Вставить("ВыводитьРеальныхПродавцов", 	Истина);
	Структура.Вставить("Поставщики", 			Поставщики);
	Структура.Вставить("ПредставлениеАгента", 	ПараметрыДоговора.ПредставлениеАгентаДляСчетаФактуры);
	
	Возврат Структура;
	
КонецФункции

Функция ПодготовитьТаблицуУслугДокумента(ДокументСсылка, ТипЗначениячОснования, ТаблицаДокумента, ДанныеДляПечати, НеподтверждениеНулевойСтавки)
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= ДокументСсылка.Дата;
	СтруктураПараметров.Договор 			= ДокументСсылка.Договор;
	СтруктураПараметров.ПриложениеКДоговору = ДокументСсылка.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);  
	
	Если ДокументСсылка.Корректировка и ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.СворачиватьПоГрузоперевозкам Тогда 
		Возврат ТаблицаДокумента;
	КонецЕсли;

	ДатаПостановления = ДокументСсылка.ВедомыйДокумент.Дата; 
	Если ДокументСсылка.Корректировка Тогда
		ДатаПостановления = ДокументСсылка.ВедомыйДокументКорректировки.Дата; 
	КонецЕсли;
	
	ИспользоватьПостановление1137 = CW_Настройки.ПараметрУчетнойПолитики(ДатаПостановления, ДокументСсылка.Организация, "СчетаФактурыПоПостановлению1137");
	Если ИспользоватьПостановление1137 = Неопределено Тогда
		ИспользоватьПостановление1137 = Ложь;
	КонецЕсли; 
	
	ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(ДатаПостановления);
	
	ЕстьКолонки_ПК = Ложь;
	РасчетыВУсловныхЕдиницах = ДокументСсылка.ВедомыйДокументКорректировки.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")
		И ДокументСсылка.Корректировка Тогда
		
		Если ДокументСсылка.ВидОперацииКорректировки = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки Тогда

			СтрокиКУдалению = Новый Массив;
			
			ТаблицаУслуг = CW_Финансы.ПолучитьУслугиДокументаКорректировки(ДокументСсылка); 
			ТаблицаУслуг.Колонки.Добавить("ПредставлениеГП");
			Для Каждого СтрокаТаблицы из ТаблицаУслуг Цикл
				СтрокаТаблицы.ПредставлениеГП = СокрЛП(СтрокаТаблицы.Грузоперевозка.CW_Представление);
				
				Если СтрокаТаблицы.Сумма = 0 Тогда
					СтрокиКУдалению.Добавить(СтрокаТаблицы);
				КонецЕсли;
				
			КонецЦикла; 
			
			Для Каждого УдаляемаяСтрока из СтрокиКУдалению Цикл
				ТаблицаУслуг.Удалить(УдаляемаяСтрока);	
			КонецЦикла;
			
		Иначе
			
			ЕстьКолонки_ПК 	= Истина;
			ТаблицаУслуг 	= CW_Финансы.ПолучитьУслугиДокумента(ДокументСсылка.КорректируемыйДокумент);
			
			_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПредставлениеГП",,"");
			_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Количество",,0);
			_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Цена",,0);
			_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Сумма",,0);
			_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_НДС",,0);
			_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Всего",,0);
			
			_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Цена_Рег",,0);
			_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Сумма_Рег",,0);
			_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_НДС_Рег",,0);
			_сф.т_ДобавитьКолонку(ТаблицаУслуг,"ПК_Всего_Рег",,0);  
			
			ТаблицаУслугПослеИзменения = CW_Финансы.ПолучитьУслугиДокументаКорректировки(ДокументСсылка);
			ТаблицаУслугПослеИзменения.Колонки.Добавить("ПредставлениеГП");
			Для Каждого СтрТУ из ТаблицаУслугПослеИзменения Цикл
				СтрТУ.ПредставлениеГП = СокрЛП(СтрТУ.Грузоперевозка.CW_Представление);
			КонецЦикла;
			
			Для Индекс = 0 По ТаблицаУслугПослеИзменения.Количество()-1  Цикл  
				
				НоваяСтрока = Ложь;
				СтрокаПослеИзменения	=  ТаблицаУслугПослеИзменения[Индекс];  
				
				Попытка
					СтрокаУслуг	=  ТаблицаУслуг[Индекс];
					СтрокаУслуг.СтавкаНДС_ДоКорректировки   = СтрокаУслуг.СтавкаНДС;	
					СтрокаУслуг.СтавкаНДС					= СтрокаПослеИзменения.СтавкаНДС;	
					
				Исключение
					СтрокаУслуг = ТаблицаУслуг.Добавить();
					
					ЗаполнитьЗначенияСвойств(СтрокаУслуг, СтрокаПослеИзменения); 
					
					СтрокаУслуг.Количество 	= 0;
					СтрокаУслуг.Цена		= 0;
					СтрокаУслуг.Сумма		= 0;
					СтрокаУслуг.НДС			= 0;
					СтрокаУслуг.Всего		= 0;
				КонецПопытки;
				
				СтрокаУслуг.ПК_Количество	= СтрокаПослеИзменения.Количество;
				СтрокаУслуг.ПК_Цена 		= СтрокаПослеИзменения.Цена;
				СтрокаУслуг.ПК_Сумма 		= СтрокаПослеИзменения.Сумма;
				СтрокаУслуг.ПК_НДС 			= СтрокаПослеИзменения.НДС;
				СтрокаУслуг.ПК_Всего 		= СтрокаПослеИзменения.Всего;
				СтрокаУслуг.ПК_Цена_Рег 	= СтрокаПослеИзменения.Цена_Рег;
				СтрокаУслуг.ПК_Сумма_Рег 	= СтрокаПослеИзменения.Сумма_Рег;
				СтрокаУслуг.ПК_НДС_Рег 		= СтрокаПослеИзменения.НДС_Рег;
				СтрокаУслуг.ПК_Всего_Рег 	= СтрокаПослеИзменения.Всего_Рег;
			КонецЦикла;	
			
			//Удаляем строки без изменений    
			УдаляемыеСтроки = Новый Массив;
			Для Каждого СтрокаУслуг из ТаблицаУслуг Цикл   
				Если СтрокаУслуг.ЭтоДобавленнаяСтрока Тогда
					Продолжить;
				КонецЕсли;
				// предполагаем, что изменения в корректировочных документах должны 
				// обязательно приводить к изменению показателей "Сумма" и "Всего"
				// (изменение "НДС" должны обязательно повлечь изменение "Сумма" или "Всего"),
				// в противном случае счетаем, что сторока не менялась
				Если СтрокаУслуг.Сумма_Рег = СтрокаУслуг.ПК_Сумма_Рег
					или СтрокаУслуг.Всего_Рег = СтрокаУслуг.ПК_Всего_Рег Тогда
					  УдаляемыеСтроки.Добавить(СтрокаУслуг);
				КонецЕсли;
			КонецЦикла;       
			
			Для Каждого УдаляемаяСтрока из УдаляемыеСтроки Цикл
				ТаблицаУслуг.Удалить(УдаляемаяСтрока);	
			КонецЦикла;
			//---Удаляем строки без изменений 
			
			
		КонецЕсли;	
	Иначе  
		
		ТаблицаУслуг = CW_Финансы.ПолучитьУслугиДокумента(ДокументСсылка);
		ТаблицаУслуг.Колонки.Добавить("ПредставлениеГП");
		ТаблицаУслуг.Колонки.Добавить("Ссылка"); 
		
		ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
		ДанныеКурса = CW_Финансы.ПолучитьКурсВалюты(ДокументСсылка.Валюта, ДокументСсылка.ДатаАкта);
	
		Для Каждого СтрокаУслуг из ТаблицаУслуг Цикл
			СтрокаУслуг.ПредставлениеГП = СокрЛП(СтрокаУслуг.Грузоперевозка.CW_Представление);
			СтрокаУслуг.Ссылка			= ДокументСсылка;
			
			Если НеподтверждениеНулевойСтавки Тогда
				
				ОбщаяСтавкаНДС 			= CW_БухгалтерияЭкспедитораДляРоссииСервер.СтавкаНДСПоВидуСтавки(Перечисления.ВидыСтавокНДС.Общая, ДокументСсылка.ВедомыйДокумент.Дата);
				ЗначениеОбщейСтавкиНДС 	= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ОбщаяСтавкаНДС);
				
				Если ДокументСсылка.Договор.ВзаиморасчетыВУЕ Тогда
					
					СуммаНДС = Окр(СтрокаУслуг.Всего_рег /100 * ЗначениеОбщейСтавкиНДС, 2); 
					СтрокаУслуг.Всего_рег 	= СтрокаУслуг.Всего_рег + СуммаНДС;
					СтрокаУслуг.Сумма 		= СтрокаУслуг.Всего_рег;
					
				Иначе  
					
					НалогооблагаемаяБаза = CW_Финансы.ПересчитатьИзВалютыВВалюту(
						СтрокаУслуг.Всего,
						ДокументСсылка.Валюта,
						ВалютаРегламентированногоУчета,
						ДанныеКурса.Курс,
						1,
						ДанныеКурса.Кратность,
						1);
					
					СуммаНДС = Окр(НалогооблагаемаяБаза / 100 * ЗначениеОбщейСтавкиНДС, 2); 
					
					СтрокаУслуг.Всего_рег 	= НалогооблагаемаяБаза + СуммаНДС;
					СтрокаУслуг.Сумма 		= НалогооблагаемаяБаза;
					
				КонецЕсли;
				
				Если ДокументСсылка.ЦенаСНДС тогда
					Цена = Окр(СтрокаУслуг.Всего_рег / ?(СтрокаУслуг.Количество=0,1, СтрокаУслуг.Количество), 2); 
				Иначе
					Цена = Окр(СтрокаУслуг.Сумма / ?(СтрокаУслуг.Количество=0,1, СтрокаУслуг.Количество), 2);
				КонецЕсли;
				
				СтрокаУслуг.СтавкаНДС 	= ОбщаяСтавкаНДС;   
				СтрокаУслуг.Цена		= Цена;
				СтрокаУслуг.НДС	 		= СуммаНДС;
				СтрокаУслуг.НДС_рег	 	= СуммаНДС;
				
			КонецЕсли;	
			
		КонецЦикла;	
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов) И ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.СворачиватьПоГрузоперевозкам Тогда
		ТЗ_Усл = ТаблицаУслуг.Скопировать();
		ТЗ_Ит  = ТаблицаУслуг.Скопировать();
		ТЗ_Ит.Очистить();
		ТЗ_ГП  = ТЗ_Усл.Скопировать();
		ТЗ_ГП.Свернуть("ПредставлениеГП");
		ТЗ_ГП.Колонки.Добавить("Представление");
		ТЗ_ГП.Колонки.Добавить("НомСтр");
		ТЗ_ГП.Колонки.Добавить("Итого");
		НомСтр = 0;
		Для Каждого Стр_ГП из ТЗ_ГП Цикл
			ТЗ_Отбор = ТЗ_Усл.Скопировать(Новый Структура("ПредставлениеГП", Стр_ГП.ПредставлениеГП));
			
			Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкамАнгл, ДокументСсылка, Неопределено, ТЗ_Отбор);
			ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкам, ДокументСсылка, Неопределено, ТЗ_Отбор) + " / " + CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкамАнгл, ДокументСсылка, Неопределено, ТЗ_Отбор);
			Иначе 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкам, ДокументСсылка, Неопределено, ТЗ_Отбор);
			КонецЕсли;
			Стр_ГП.НомСтр = НомСтр;
			Стр_ГП.Итого  = ТЗ_Отбор.Итог("Всего");
			
			CW_Печать.ПодготовитьТаблицуУслуг(ТЗ_Отбор, ДокументСсылка, ПараметрыДоговора, "акт", ДокументСсылка.Корректировка,,,Истина);
			Для Каждого Стр_Отбор из ТЗ_Отбор Цикл
				Стр_Ит = ТЗ_Ит.Добавить();
				ЗаполнитьЗначенияСвойств(Стр_Ит, Стр_Отбор);
			КонецЦикла;	
			НомСтр = НомСтр + 1 + ТЗ_Отбор.Количество();
		КонецЦикла;
		ТаблицаУслуг = ТЗ_Ит.Скопировать();
	Иначе	
		CW_Печать.ПодготовитьТаблицуУслуг(ТаблицаУслуг,ДокументСсылка,ПараметрыДоговора,"акт", ДокументСсылка.Корректировка,,,НЕ ЕстьКолонки_ПК);
	КонецЕсли;   
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВерсияПостановления1137",  ВерсияПостановления1137);
	ДополнительныеПараметры.Вставить("ЕстьКолонки_ПК", 			 ЕстьКолонки_ПК);
	
	СоответствиеКолонок = ПолучитьСоответствиеКолонокТаблицыДокументов(ТипЗначениячОснования, ДанныеДляПечати, ДополнительныеПараметры);
	Если СоответствиеКолонок = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаполнитьТаблицуДокумента(СоответствиеКолонок, ТаблицаДокумента, ТаблицаУслуг, ДокументСсылка, РасчетыВУсловныхЕдиницах);
	
	Возврат ТаблицаДокумента;
	
КонецФункции

Функция СтруктураФИО(СтрокаТаблицыЗначений)
	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество, Представление");
	ЗаполнитьЗначенияСвойств(СтруктураФИО, СтрокаТаблицыЗначений);
	Возврат СтруктураФИО;
КонецФункции

//AF_AddEDI вер. 4.01
Функция ПодготовитьДанныеШапкиКорректировочногоСчетаФактуры1137_Стандартно(СтрокаТаблицыРеквизиты) Экспорт
	
	ВремРеквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыРеквизиты);
	Возврат Не ВремРеквизиты.Свойство("ВедущийДокумент");
		
КонецФункции

Функция ПодготовитьДанныеШапкиКорректировочногоСчетаФактуры1137_Продолжиение(ВыборкаСФ, СтрокаТаблицыРеквизиты, ДополнитьДаннымиУПД) Экспорт

	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыРеквизиты);
	
	ДанныеШапки = Новый Структура;
	ТекстПустойПоказатель = "--";
	
	// Номер и дата
	Если ВыборкаСФ.Исправление И ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный Тогда
		Номер = ВыборкаСФ.НомерИсправляемогоКорректировочногоДокумента;
		ДанныеШапки.Вставить("Дата", ВыборкаСФ.ДатаИсправляемогоКорректировочногоДокумента);
	Иначе
		Если ВыборкаСФ.УдалитьПрефиксыИзНомера Тогда
			Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаСФ.Номер, Истина, Ложь);
		Иначе
			Номер = ВыборкаСФ.Номер;
		КонецЕсли;
		ДанныеШапки.Вставить("Дата", ВыборкаСФ.Дата);
	КонецЕсли;
	
	// Дополняем номер индексом обособленного подразделения (при необходимости)
	Если ЗначениеЗаполнено(Реквизиты.ЦифровойИндексОбособленногоПодразделения)
		И ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
		Номер = Номер + "/" + Реквизиты.ЦифровойИндексОбособленногоПодразделения;
	КонецЕсли;

	ДанныеШапки.Вставить("Номер", СокрЛП(Номер));
	
	// Номер и дата исправления
	ДанныеШапки.Вставить("Исправление", ВыборкаСФ.Исправление);
	Если ВыборкаСФ.Исправление Тогда
		Если ВыборкаСФ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный Тогда
			НомерИсправленияКорректировочного = ВыборкаСФ.НомерИсправления;
			ДатаИсправленияКорректировочного  = ВыборкаСФ.ДатаИсправления;
		Иначе
			НомерИсправленияКорректировочного = ВыборкаСФ.НомерИсправленияКорректировочного;
			ДатаИсправленияКорректировочного  = ВыборкаСФ.ДатаИсправленияКорректировочного;
		КонецЕсли;
	Иначе
		НомерИсправленияКорректировочного = "--";
		ДатаИсправленияКорректировочного  = '00010101';
	КонецЕсли;
	
	ДанныеШапки.Вставить("НомерИсправленияКорректировочного", НомерИсправленияКорректировочного);
	ДанныеШапки.Вставить("ДатаИсправленияКорректировочного",  ДатаИсправленияКорректировочного);
	
	ТаблицаРеквизитовОснований = Новый ТаблицаЗначений;
	ТаблицаРеквизитовОснований.Колонки.Добавить("НомерСчетаФактуры");
	ТаблицаРеквизитовОснований.Колонки.Добавить("ДатаСчетаФактуры");
	ТаблицаРеквизитовОснований.Колонки.Добавить("УчитыватьИсправлениеИсходногоДокумента");
	ТаблицаРеквизитовОснований.Колонки.Добавить("НомерИсправления");
	ТаблицаРеквизитовОснований.Колонки.Добавить("ДатаИсправления");
	
	ВыборкаОснования = ВыборкаСФ.Выбрать();
	Пока ВыборкаОснования.Следующий() Цикл
		
		НовоеОснование = ТаблицаРеквизитовОснований.Добавить();
		
		// Номер и дата исходного счета-фактуры
		Если ЗначениеЗаполнено(Реквизиты.ЦифровойИндексОбособленногоПодразделения)
			И ВыборкаСФ.ЭтоСчетФактураВыданный Тогда
			НовоеОснование.НомерСчетаФактуры = СокрЛП(ВыборкаОснования.НомерИсходногоДокумента) + "/" + Реквизиты.ЦифровойИндексОбособленногоПодразделения;
		Иначе
			НовоеОснование.НомерСчетаФактуры = СокрЛП(ВыборкаОснования.НомерИсходногоДокумента);
		КонецЕсли;
		
		НовоеОснование.ДатаСчетаФактуры  = ВыборкаОснования.ДатаИсходногоДокумента;
		
		НовоеОснование.УчитыватьИсправлениеИсходногоДокумента = ВыборкаОснования.УчитыватьИсправлениеИсходногоДокумента;
		// Номер и дата исправления исходного счета-фактуры
		Если ВыборкаОснования.УчитыватьИсправлениеИсходногоДокумента = Истина Тогда
			НовоеОснование.НомерИсправления = ВыборкаОснования.НомерИсправленияИсходногоДокумента;
			НовоеОснование.ДатаИсправления	 = ВыборкаОснования.ДатаИсправленияИсходногоДокумента;
		Иначе
			НовоеОснование.НомерИсправления = "--";
			НовоеОснование.ДатаИсправления	= '00010101';
		КонецЕсли;

		ИсходныйДокументСводныйКомиссионный = Ложь;
		ПараметрыСводногоСФПоКомиссии = Неопределено;
		
		// Ищем сводный комиссионный
		Если Не ДополнитьДаннымиУПД
			И ВыборкаСФ.ЭтоСчетФактураВыданный 
			И ВыборкаОснования.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный
			И ЗначениеЗаполнено(ВыборкаОснования.ИсходныйДокумент)
			И ВыборкаОснования.Количество() = 1 Тогда
			
				ИсходныйДокументСводныйКомиссионный = 
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаОснования.ИсходныйДокумент, "СводныйКомиссионный"); 
					
				Если ИсходныйДокументСводныйКомиссионный Тогда	
					ПараметрыСводногоСФПоКомиссии = 
						ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоПродаже(ВыборкаОснования.ИсходныйДокумент,
							Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию);
				КонецЕсли; 
				
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРеквизитовОснований.Свернуть("НомерСчетаФактуры,ДатаСчетаФактуры, УчитыватьИсправлениеИсходногоДокумента, НомерИсправления,ДатаИсправления");
	ДанныеШапки.Вставить("ТаблицаРеквизитовОснований", ТаблицаРеквизитовОснований);

	ДанныеШапки.Вставить("Поставщик", Реквизиты.Поставщик);
	
	// ИНН и КПП продавца
	ДанныеШапки.Вставить("ИННпродавца", Реквизиты.ИННпоставщика);
	
	Если НЕ ВыборкаСФ.ЭтоСчетФактураВыданный 
		И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры)
		И Реквизиты.Поставщик = ВыборкаСФ.Контрагент Тогда
		КППпоставщика = ВыборкаСФ.КППСчетаФактуры;
	Иначе
		КПППоставщика = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПоставщика, ВыборкаСФ.ДатаСведений);
	КонецЕсли;
	
	ДанныеШапки.Вставить("КППпродавца", УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПоставщика, ВыборкаСФ.ДатаСведений));

	Если ТипЗнч(Реквизиты.Поставщик) = Тип("Строка") Тогда
		
		ДанныеШапки.Вставить("НаименованиеПродавца", Реквизиты.Поставщик);
		ДанныеШапки.Вставить("АдресПродавца",        Реквизиты.АдресПоставщика);
		ДанныеШапки.Вставить("ИННКППпродавца",       Реквизиты.ИННКПППоставщика);
		
	Иначе
		
		//AF_ЭДО
		//СведенияОПоставщике = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Поставщик, ВыборкаСФ.ДатаСведений, , , , Истина);
		СведенияОПоставщике = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Поставщик, ВыборкаСФ.ДатаСведений);
		//AF_ЭДО
	
		ДанныеШапки.Вставить("НаименованиеПродавца",
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес продавца
		ДанныеШапки.Вставить("АдресПродавца",
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес,"));
			
		ДанныеШапки.Вставить("ИННКППпродавца",
			ДанныеШапки.ИННпродавца
			+ ?(ЗначениеЗаполнено(ДанныеШапки.КППпродавца), "/", "")
			+ ДанныеШапки.КППпродавца);
		
	КонецЕсли;
	
	Если Не ДополнитьДаннымиУПД
		И ИсходныйДокументСводныйКомиссионный 
		И ЕстьЗаполненныеЭлементыВСтруктуре(ПараметрыСводногоСФПоКомиссии) Тогда

		ДанныеШапки.Вставить("Покупатель", Реквизиты.Покупатель);
		ДанныеШапки.Вставить("НаименованиеПокупателя", ПараметрыСводногоСФПоКомиссии.ПредставлениеПокупателя);
		ДанныеШапки.Вставить("АдресПокупателя", ПараметрыСводногоСФПоКомиссии.АдресПокупателя);
		ДанныеШапки.Вставить("ИННКПППокупателя", ПараметрыСводногоСФПоКомиссии.ИННКПППокупателя);
		ДанныеШапки.Вставить("КППпокупателя", "");
		ДанныеШапки.Вставить("ИННпокупателя", "");
	
	Иначе
		//AF_ЭДО
		//СведенияОПокупателе = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Покупатель, ВыборкаСФ.ДатаСведений);
		СведенияОПокупателе = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Покупатель, ВыборкаСФ.ДатаСведений, , , , Истина);
		//AF_ЭДО
		
		// Наименование покупателя
		ДанныеШапки.Вставить("Покупатель", Реквизиты.Покупатель);
		ДанныеШапки.Вставить("НаименованиеПокупателя",
		ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "НаименованиеДляПечатныхФорм,"));
		
		// Адрес покупателя
		ДанныеШапки.Вставить("АдресПокупателя",
		ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,"));
		
		// ИНН и КПП покупателя
		ДанныеШапки.Вставить("ИННпокупателя", Реквизиты.ИННпокупателя);
		
		Если ВыборкаСФ.ЭтоСчетФактураВыданный
			И ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) 
			И Реквизиты.Покупатель = ВыборкаСФ.Контрагент
			И ЗначениеЗаполнено(ВыборкаСФ.КППСчетаФактуры) Тогда
			КППпокупателя = ВыборкаСФ.КППСчетаФактуры;
		Иначе
			КППпокупателя = УчетНДСБП.КППНаДату(Реквизиты.ОбособленноеПодразделениеПокупателя, ВыборкаСФ.ДатаСведений);
		КонецЕсли;
		
		ДанныеШапки.Вставить("КППпокупателя", КППпокупателя);
		
		ДанныеШапки.Вставить("ИННКППпокупателя",
		ДанныеШапки.ИННпокупателя
		+ ?(ЗначениеЗаполнено(ДанныеШапки.КППпокупателя), "/", "")
		+ ДанныеШапки.КППпокупателя);
		
	КонецЕсли;
	
	Валюта = ""; 
	ВалютаКод = "";
	ВалютаКурс = 0; 
	ВалютаКратность = 0;
	
	// Валюта
	Если ЗначениеЗаполнено(Реквизиты.Валюта) Тогда
		РеквизитыВалюты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Реквизиты.Валюта, "НаименованиеПолное,Код");
		СтруктураКурса  = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Реквизиты.Валюта, Реквизиты.ДатаОснования);
		
		Валюта             = РеквизитыВалюты.НаименованиеПолное + ", " + РеквизитыВалюты.Код;
		ВалютаНаименование = РеквизитыВалюты.НаименованиеПолное;
		ВалютаКод          = РеквизитыВалюты.Код;
		ВалютаКурс         = СтруктураКурса.Курс;
		ВалютаКратность    = СтруктураКурса.Кратность;
	КонецЕсли;
	
	ДанныеШапки.Вставить("Валюта", Реквизиты.Валюта);
	ДанныеШапки.Вставить("ВалютаНаименование", "Валюта: наименование, код " + Валюта);
	ДанныеШапки.Вставить("ВалютаНаименованиеБезЗаголовка", Валюта);
	ДанныеШапки.Вставить("ВалютаНаименованиеПолное", ВалютаНаименование);
	ДанныеШапки.Вставить("ВалютаКод", ВалютаКод);
	ДанныеШапки.Вставить("ВалютаКурс", ВалютаКурс);
	ДанныеШапки.Вставить("ВалютаКратность", ВалютаКратность);
	ДанныеШапки.Вставить("ИдентификаторГосКонтракта", ВыборкаСФ.ИдентификаторГосКонтракта);
	
	Если Реквизиты.Свойство("НДСИсчисляетсяНалоговымАгентом") Тогда
		НДСИсчисляетсяНалоговымАгентом = Реквизиты.НДСИсчисляетсяНалоговымАгентом = Истина
			И УчетНДС.ВедетсяУчетНДСПоФЗ335(ВыборкаСФ.Дата);
	Иначе
		НДСИсчисляетсяНалоговымАгентом = Ложь;
	КонецЕсли;
	
	ДанныеШапки.Вставить("НДСИсчисляетсяНалоговымАгентом", НДСИсчисляетсяНалоговымАгентом);
	
	// Сведения о комиссионере
	Если ВыборкаСФ.ЭтоСчетФактураВыданный 
		И (ТипЗнч(Реквизиты.Поставщик) = Тип("СправочникСсылка.Контрагенты")
		ИЛИ ТипЗнч(Реквизиты.Поставщик) = Тип("Строка"))
		И ТипЗнч(Реквизиты.Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		Комиссионер = Реквизиты.Организация;
	ИначеЕсли НЕ ВыборкаСФ.ЭтоСчетФактураВыданный 
		И ВыборкаСФ.Контрагент <> Реквизиты.Поставщик Тогда
		Комиссионер = ВыборкаСФ.Контрагент;
	Иначе
		Комиссионер = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комиссионер) Тогда
	    //AF_ЭДО
		//СведенияОКомиссионере = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Комиссионер, ВыборкаСФ.ДатаСведений, , , , Истина);
		СведенияОКомиссионере = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Комиссионер, ВыборкаСФ.ДатаСведений);
	    //AF_ЭДО
		КППКомиссионера = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "Составлен комиссионером (агентом): " 
			+ ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,")
			+ ", " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ЮридическийАдрес,")
			+ ", ИНН/КПП: " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь)
			+ ?(ЗначениеЗаполнено(КППКомиссионера), "/" + КППКомиссионера, ""));
	
	Иначе
	
		ДанныеШапки.Вставить("ПредставлениеКомиссионера", "");
	
	КонецЕсли;
	
	// Данные комиссионера на стороне комитентов
	Если ВыборкаСФ.ЭтоСчетФактураВыданный Тогда

		Если Реквизиты.Свойство("Комиссионер") И ЗначениеЗаполнено(Реквизиты.Комиссионер) Тогда
		    //AF_ЭДО
			//СведенияОКомиссионере = 
			//	БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Комиссионер, ВыборкаСФ.ДатаСведений, , , , Истина);
			СведенияОКомиссионере = 
				CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Комиссионер, ВыборкаСФ.ДатаСведений);
		    //AF_ЭДО
			
			КППКомиссионера = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
			ПредставлениеКомиссионера = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,");
			ПредставлениеКомиссионераНаПечать = ПредставлениеКомиссионера
			+ ", ИНН/КПП: " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь)
			+ ?(ЗначениеЗаполнено(КППКомиссионера), "/" + КППКомиссионера, "");

			ДанныеШапки.ПредставлениеКомиссионера = 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Выставлен комиссионеру %1, по корректировочному счету-фактуре № %2 от %3'"),
				ПредставлениеКомиссионераНаПечать, Реквизиты.НомерСФКомиссионера,
					Формат(Реквизиты.ДатаСФКомиссионера, "ДФ=dd.MM.yyyy"));

		КонецЕсли;
	КонецЕсли;
	
	// Данные для подвала
	Если ВыборкаСФ.ЭтоСчетФактураВыданный ИЛИ ДополнитьДаннымиУПД Тогда
		
		Если ТипЗнч(Реквизиты.Поставщик) = Тип("Строка") Тогда
			ОрганизацияДляРеквизитовПодвала = Реквизиты.Организация;
		Иначе
			ОрганизацияДляРеквизитовПодвала = Реквизиты.Поставщик;
		КонецЕсли;
		
		ОрганизацияЭтоЮрЛицо = ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(ОрганизацияДляРеквизитовПодвала);
		
		// Получаем за один вызов данные по всем необходимым физлицам.
		СписокФизЛиц = Новый Массив;
		//AF_ЭДО
		//Если (ОрганизацияЭтоЮрЛицо ИЛИ ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата) ИЛИ ДополнитьДаннымиУПД)
		Если (ОрганизацияЭтоЮрЛицо ИЛИ УчетНДС.ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата) ИЛИ ДополнитьДаннымиУПД)
		//AF_ЭДО
		И ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
			СписокФизЛиц.Добавить(ВыборкаСФ.Руководитель);
		КонецЕсли;
		Если ОрганизацияЭтоЮрЛицо
		   И ЗначениеЗаполнено(ВыборкаСФ.ГлавныйБухгалтер) Тогда
			СписокФизЛиц.Добавить(ВыборкаСФ.ГлавныйБухгалтер);
		КонецЕсли;
		Если ЗначениеЗаполнено(Реквизиты.ОтветственныйЗаОформление) Тогда
			СписокФизЛиц.Добавить(Реквизиты.ОтветственныйЗаОформление);
		КонецЕсли; 
		Если СписокФизЛиц.Количество() > 0 Тогда
			ДанныеОтветственныхЛиц = УчетЗарплаты.ДанныеФизическихЛиц(Реквизиты.Организация, СписокФизЛиц, ВыборкаСФ.Дата, Истина, Истина);
		Иначе
			ДанныеОтветственныхЛиц = Новый ТаблицаЗначений;
			ДанныеОтветственныхЛиц.Колонки.Добавить("ФизическоеЛицо");
		КонецЕсли;
		
		Если ОрганизацияЭтоЮрЛицо Тогда
			
			Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОрганизацияДляРеквизитовПодвала, ВыборкаСФ.Дата, Реквизиты.Подразделение);
			
			Если ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица        = ДанныеОтветственныхЛиц.Найти(ВыборкаСФ.Руководитель, "ФизическоеЛицо");
				ФизическоеЛицо       = ?(ДанныеФизЛица = Неопределено, Справочники.ФизическиеЛица.ПустаяСсылка(), ДанныеФизЛица.ФизическоеЛицо);
				ПредставлениеФизЛица = ?(ДанныеФизЛица = Неопределено, "", ДанныеФизЛица.Представление);
				СтруктураФИО = ?(ДанныеФизЛица = Неопределено, Новый Структура("Фамилия, Имя, Отчество, Представление"), СтруктураФИО(ДанныеФизЛица));
				ДанныеШапки.Вставить("ФИОРуководителя", ПредставлениеФизЛица);
				ДанныеШапки.Вставить("Руководитель",    ФизическоеЛицо);
				ДанныеШапки.Вставить("РуководительФИО", СтруктураФИО);
			Иначе 
				ДанныеШапки.Вставить("ФИОРуководителя", Руководители.РуководительПредставление);
				ДанныеШапки.Вставить("Руководитель",    Руководители.Руководитель);
				ДанныеШапки.Вставить("РуководительФИО", Руководители.РуководительФИО);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаСФ.ГлавныйБухгалтер) Тогда
				ДанныеФизЛица        = ДанныеОтветственныхЛиц.Найти(ВыборкаСФ.ГлавныйБухгалтер, "ФизическоеЛицо");
				ФизическоеЛицо       = ?(ДанныеФизЛица = Неопределено, Справочники.ФизическиеЛица.ПустаяСсылка(), ДанныеФизЛица.ФизическоеЛицо);
				ПредставлениеФизЛица = ?(ДанныеФизЛица = Неопределено, "", ДанныеФизЛица.Представление);
				СтруктураФИО = ?(ДанныеФизЛица = Неопределено, Новый Структура("Фамилия, Имя, Отчество, Представление"), СтруктураФИО(ДанныеФизЛица));
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", ПредставлениеФизЛица);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      ФизическоеЛицо);
				ДанныеШапки.Вставить("ГлавныйБухгалтерФИО",   СтруктураФИО);
			Иначе 
				ДанныеШапки.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтерПредставление);
				ДанныеШапки.Вставить("ГлавныйБухгалтер",      Руководители.ГлавныйБухгалтер);
				ДанныеШапки.Вставить("ГлавныйБухгалтерФИО",   Руководители.ГлавныйБухгалтерФИО);
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(СведенияОПоставщике) Тогда
				Свидетельство = БухгалтерскийУчетПереопределяемый.СвидетельствоОРегистрации(СведенияОПоставщике, ВыборкаСФ.Дата);
			ИначеЕсли Реквизиты.Свойство("Организация") Тогда
				СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Организация, Реквизиты.ДатаОснования, , , , Истина);
				Свидетельство = БухгалтерскийУчетПереопределяемый.СвидетельствоОРегистрации(СведенияОбОрганизации, ВыборкаСФ.Дата);
			КонецЕсли;
			
			ДанныеШапки.Вставить("Свидетельство", Свидетельство);
			
			//AF_ЭДО
			//Если ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата) 
			Если УчетНДС.ВедетсяУчетНДСПоФЗ81(ВыборкаСФ.Дата)
			//AF_ЭДО
			   И ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
				ДанныеФизЛица = ДанныеОтветственныхЛиц.Найти(ВыборкаСФ.Руководитель, "ФизическоеЛицо");
				СтруктураФИО   = ?(ДанныеФизЛица = Неопределено, Новый Структура("Фамилия, Имя, Отчество, Представление"), СтруктураФИО(ДанныеФизЛица));
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ?(ДанныеФизЛица = Неопределено, "", ДанныеФизЛица.Представление));
				ДанныеШапки.Вставить("ПБОЮЛФИО", ?(ДанныеФизЛица = Неопределено, Новый Структура("Фамилия, Имя, Отчество, Представление"), СтруктураФИО));
				ДанныеШапки.Вставить("Руководитель",  ВыборкаСФ.Руководитель);
			Иначе
				СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СведенияОПоставщике.ФИОФизлица);
				СтруктураФИО.Вставить("Представление", СведенияОПоставщике.ФИОФизлица);
				
				ДанныеШапки.Вставить("ФИОПБОЮЛ", ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "ФамилияИнициалыФизлица,"));
				ДанныеШапки.Вставить("ПБОЮЛФИО", СтруктураФИО);
				ДанныеШапки.Вставить("Руководитель", СведенияОПоставщике.ИндивидуальныйПредприниматель);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	// Данные для универсального передаточного документа
	Если ДополнитьДаннымиУПД Тогда
		
		// Наименование экономического субъекта - составителя документа
		Если ЗначениеЗаполнено(Комиссионер) И СведенияОКомиссионере <> Неопределено Тогда
			ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "НаименованиеДляПечатныхФорм,");
			ИННПоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь);
			КПППоставщика           = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		Иначе
			ПредставлениеПоставщика = ДанныеШапки.НаименованиеПродавца;
			ИННПоставщика           = ДанныеШапки.ИННПродавца;
			КПППоставщика           = ДанныеШапки.КПППродавца;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КПППоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ПредставлениеПоставщика, ИННПоставщика, КПППоставщика);
		ИначеЕсли ЗначениеЗаполнено(ИННПоставщика) Тогда
			ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ПредставлениеПоставщика, ИННПоставщика);
		Иначе
			ПредставлениеОрганизации = ПредставлениеПоставщика;
		КонецЕсли;
		ДанныеШапки.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		
		Если ЗначениеЗаполнено(ДанныеШапки.КППпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН/КПП %2/%3'"),
				ДанныеШапки.НаименованиеПокупателя, ДанныеШапки.ИННпокупателя, ДанныеШапки.КППпокупателя);
		ИначеЕсли ЗначениеЗаполнено(ДанныеШапки.ИННпокупателя) Тогда
			ПредставлениеКонтрагента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, ИНН %2'"),
				ДанныеШапки.НаименованиеПокупателя, ДанныеШапки.ИННпокупателя);
		Иначе
			ПредставлениеКонтрагента = ДанныеШапки.НаименованиеПокупателя;
		КонецЕсли;
		
		ДанныеШапки.Вставить("ПредставлениеКонтрагента", ПредставлениеКонтрагента);
		
		ДанныеШапки.Вставить("Основание", Реквизиты.Основание);
		ДанныеШапки.Вставить("ОснованиеДата", Реквизиты.ОснованиеДата);
		ДанныеШапки.Вставить("ОснованиеНомер", Реквизиты.ОснованиеНомер);
		ДанныеШапки.Вставить("ОснованиеВид", Реквизиты.ВидДоговора);
		ДанныеШапки.Вставить("ИныеСведения", Реквизиты.СопроводительныеДокументы);
		Если Реквизиты.Свойство("БанковскийСчетПродавца") Тогда
			ДанныеШапки.Вставить("БанковскийСчетПродавца", Реквизиты.БанковскийСчетПродавца);
		КонецЕсли;
		
		Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Реквизиты.Поставщик, ВыборкаСФ.Дата, Реквизиты.Подразделение);
		ДанныеШапки.Вставить("ДолжностьРуководителя", Руководители.РуководительДолжностьПредставление);
		Если ЗначениеЗаполнено(ВыборкаСФ.Руководитель) Тогда
			ДанныеФизЛица = ДанныеОтветственныхЛиц.Найти(ВыборкаСФ.Руководитель, "ФизическоеЛицо");
			СтруктураФИО = ?(ДанныеФизЛица = Неопределено, Новый Структура("Фамилия, Имя, Отчество, Представление"), СтруктураФИО(ДанныеФизЛица));
			
			ДанныеШапки.Вставить("ФИОРуководителяНакладная", ?(ДанныеФизЛица = Неопределено, "", ДанныеФизЛица.Представление));
			ДанныеШапки.Вставить("РуководительНакладнаяФИО", СтруктураФИО);

		Иначе 

			ДанныеШапки.Вставить("ФИОРуководителяНакладная", Руководители.РуководительПредставление);
			ДанныеШапки.Вставить("РуководительНакладнаяФИО", Руководители.РуководительФИО);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Реквизиты.ОтветственныйЗаОформление) Тогда
			ДанныеОтветственного        = ДанныеОтветственныхЛиц.Найти(Реквизиты.ОтветственныйЗаОформление, "ФизическоеЛицо");
			
			ДолжностьОтветственного     = ?(ДанныеОтветственного = Неопределено, "", ДанныеОтветственного.Должность);
			ПредставлениеОтветственного = ?(ДанныеОтветственного = Неопределено, "", ДанныеОтветственного.Представление);
			ОтветственныйФИО            = ?(ДанныеОтветственного = Неопределено, 
				Новый Структура("Фамилия, Имя, Отчество, Представление"), 
				СтруктураФИО(ДанныеОтветственного));
			
			ДанныеШапки.Вставить("ДолжностьОтветственного",   ДолжностьОтветственного);
			ДанныеШапки.Вставить("ФИООтветственного",         ПредставлениеОтветственного);
			ДанныеШапки.Вставить("ОтветственныйФИО",          ОтветственныйФИО);
			ДанныеШапки.Вставить("ОтветственныйЗаОформление", Реквизиты.ОтветственныйЗаОформление);
			
		ИначеЕсли ОрганизацияЭтоЮрЛицо Тогда
			
			ДанныеШапки.Вставить("ДолжностьОтветственного",   ДанныеШапки.ДолжностьРуководителя);
			ДанныеШапки.Вставить("ФИООтветственного",         ДанныеШапки.ФИОРуководителя);
			ДанныеШапки.Вставить("ОтветственныйФИО",          ДанныеШапки.РуководительФИО);
			ДанныеШапки.Вставить("ОтветственныйЗаОформление", ДанныеШапки.Руководитель);
			
		Иначе
			
			ДанныеШапки.Вставить("ДолжностьОтветственного",   ДанныеШапки.ДолжностьРуководителя);
			ДанныеШапки.Вставить("ФИООтветственного",         ДанныеШапки.ФИОПБОЮЛ);
			ДанныеШапки.Вставить("ОтветственныйФИО",          ДанныеШапки.ПБОЮЛФИО);
			ДанныеШапки.Вставить("ОтветственныйЗаОформление", ДанныеШапки.Руководитель);
			
		КонецЕсли;
		
		// Статус
		Если НЕ ЗначениеЗаполнено(ВыборкаСФ.ВидСчетаФактуры) Тогда
			СтатусУКД = 2;
		Иначе
			СтатусУКД = 1;
		КонецЕсли;
		
		ДанныеШапки.Вставить("СтатусУКД", СтатусУКД);
			
	КонецЕсли;
	
	//AF_ЭДО  
	СведенияОбОрганизации = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Реквизиты.Организация, ВыборкаСФ.ДатаСведений);
	СведенияОЮрФизЛицах = Новый Соответствие;
	СведенияОЮрФизЛицах.Вставить(Реквизиты.Организация, СведенияОбОрганизации);
	
	CW_ЭДО.ДополнитьСтруктураДанныеШапки(ДанныеШапки, Реквизиты, СведенияОЮрФизЛицах);
	//AF_ЭДО

	Возврат ДанныеШапки;

КонецФункции


Функция ПолучитьПараметрыСводногоСчетаФактурыКомиссияПоПродаже(СчетФактура, ВидСчетаФактуры)

	ПараметрыДляСводногоСФПоКомиссии = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажахПокупатели.Покупатель КАК Покупатель,
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель
		|		ИНАЧЕ ОтчетКомиссионераОПродажахПокупатели.Покупатель
		|	КОНЕЦ КАК Грузополучатель,
		|	МИНИМУМ(ОтчетКомиссионераОПродажахПокупатели.НомерСтроки) КАК НомерСтроки,
		|	ОтчетКомиссионераОПродажахПокупатели.НомерСФ КАК НомерСФ,
		|	ОтчетКомиссионераОПродажахПокупатели.ДатаСФ КАК ДатаСФ,
		|	ИСТИНА КАК ЭтоОтчетКомиссионера
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
		|ГДЕ
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ОтчетКомиссионераОПродажахПокупатели.СчетФактура = &СчетФактура
		|	И ОтчетКомиссионераОПродажахПокупатели.Ссылка.ВыписыватьСчетаФактурыСводно
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтчетКомиссионераОПродажахПокупатели.Покупатель,
		|	ОтчетКомиссионераОПродажахПокупатели.Ссылка.Дата,
		|	ВЫБОР
		|		КОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ОтчетКомиссионераОПродажахПокупатели.Ссылка.Грузополучатель
		|		ИНАЧЕ ОтчетКомиссионераОПродажахПокупатели.Покупатель
		|	КОНЕЦ,
		|	ОтчетКомиссионераОПродажахПокупатели.НомерСФ,
		|	ОтчетКомиссионераОПродажахПокупатели.ДатаСФ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Иначе
		//авансовый
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйАвансы.Контрагент КАК Покупатель,
		|	СчетФактураВыданныйАвансы.Ссылка.Дата КАК Дата,
		|	МИНИМУМ(СчетФактураВыданныйАвансы.НомерСтроки) КАК НомерСтроки,
		|	ЛОЖЬ КАК ЭтоОтчетКомиссионера
		|ИЗ
		|	Документ.СчетФактураВыданный.Авансы КАК СчетФактураВыданныйАвансы
		|ГДЕ
		|	СчетФактураВыданныйАвансы.Ссылка = &СчетФактура
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураВыданныйАвансы.Контрагент,
		|	СчетФактураВыданныйАвансы.Ссылка.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	КонецЕсли;	
			
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредставлениеПокупателя  = "";
	АдресПокупателя 		 = "";
	Грузополучатель 		 = "";
	ИННКПППокупателя 		 = "";
	СчетаФактурыКомиссионера = "";

	Пока Выборка.Следующий() Цикл
		
		СведенияОПокупателе = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Выборка.Покупатель, Выборка.Дата);
		
		ПредставлениеПокупателя = ?(ПустаяСтрока(ПредставлениеПокупателя), "", ПредставлениеПокупателя + ";") + 
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "НаименованиеДляПечатныхФорм,");
		
		АдресПокупателя = ?(ПустаяСтрока(АдресПокупателя), "", АдресПокупателя + ";") + 
			ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес,");
			
		Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда 			
			СведенияОГрузополучателе = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Выборка.Грузополучатель, Выборка.Дата);
			ПредставлениеГрузополучателя = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(
				СведенияОГрузополучателе, "НаименованиеДляПечатныхФорм,ПочтовыйАдрес,");
			
			Грузополучатель = 	?(ПустаяСтрока(Грузополучатель), "", Грузополучатель + ";") + ПредставлениеГрузополучателя;
		КонецЕсли;
		
		ИННКПППокупателя = 	?(ПустаяСтрока(ИННКПППокупателя), "", ИННКПППокупателя + ";") + 
			СведенияОПокупателе.ИНН + ?(ПустаяСтрока(СведенияОПокупателе.КПП), "", "/" + СведенияОПокупателе.КПП);
		
		Если Выборка.ЭтоОтчетКомиссионера Тогда
		
			СведениеСчетаФактуры = ?(ПустаяСтрока(Выборка.НомерСФ), "",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '№ %1 от %2'"),
				Выборка.НомерСФ, Формат(Выборка.ДатаСФ, "ДФ=dd.MM.yyyy")));
				
			СчетаФактурыКомиссионера = ?(ПустаяСтрока(СчетаФактурыКомиссионера), "", СчетаФактурыКомиссионера + ",")
			+ СведениеСчетаФактуры;

		Иначе
			СчетаФактурыКомиссионера = "";
		КонецЕсли;
			
	КонецЦикла;
		
	ПараметрыДляСводногоСФПоКомиссии.Вставить("ПредставлениеПокупателя",	ПредставлениеПокупателя);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("АдресПокупателя", 			АдресПокупателя);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("Грузополучатель", 			Грузополучатель);	
	ПараметрыДляСводногоСФПоКомиссии.Вставить("ИННКПППокупателя", 			ИННКПППокупателя);
	ПараметрыДляСводногоСФПоКомиссии.Вставить("СчетаФактурыКомиссионера",   СчетаФактурыКомиссионера);
	
	Возврат ПараметрыДляСводногоСФПоКомиссии;
	
КонецФункции

Функция ЕстьЗаполненныеЭлементыВСтруктуре(ПараметрыСводногоСФПоКомиссии)
	
	Если НЕ ЗначениеЗаполнено(ПараметрыСводногоСФПоКомиссии) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого ТекущийЭлемент Из ПараметрыСводногоСФПоКомиссии Цикл
		
		Если ЗначениеЗаполнено(ТекущийЭлемент.Значение) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
//AF_AddEDI вер. 4.01

//ОбщийМодуль.УчетНДС

//ОбщийМодуль.ОбменСКонтрагентамиБП
Функция ЗаполнитьОсновнуюЧастьУПД_2019_Стандартно(ДанныеШапки, Настройки) Экспорт
	
	Если Настройки.ТипДокумента <> ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.СчетФактура") Тогда
		Возврат истина;
	КонецЕсли;
	
	Если Не ДанныеШапки.Свойство("ВедущийДокумент") 
		ИЛИ НЕ ЗначениеЗаполнено(ДанныеШапки.ВедущийДокумент) Тогда
		Возврат Истина;
	КонецЕсли;    
	
	Если Не ДанныеШапки.Свойство("ПараметрыВыводаРеальныхПродавцов") Тогда
		Возврат Истина;
	КонецЕсли;
		
	Если НЕ ДанныеШапки.ПараметрыВыводаРеальныхПродавцов.ВыводитьРеальныхПродавцов Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции  

Функция СведенияОПоставщикахДляСводногоСчетаФактуры(Поставщики, Дата) Экспорт
	
	СведенияОПоставщиках = Новый Массив;
	Для Каждого Поставщик Из Поставщики Цикл
		СведенияОПоставщике = ОбменСКонтрагентамиБП.ПолучитьДанныеЮрФизЛица(Поставщик, Дата);
		Если ТипЗнч(Поставщик) = Тип("СправочникСсылка.Контрагенты") 
			И Поставщик.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			СведенияОПоставщике.ДатаПрисвоенияОГРН = СведенияОПоставщике.ДатаРегистрации;	
		КонецЕсли;
		
		СведенияОПоставщиках.Добавить(СведенияОПоставщике);
	КонецЦикла;
	
	Возврат СведенияОПоставщиках;
	
КонецФункции
//ОбщийМодуль.ОбменСКонтрагентамиБП


//СчетНаОплатуПокупателю
Процедура ПолучитьТаблицуСведенийСчетаНаОплату_Продолжение(ТаблицаСведений, МассивДокументов) Экспорт
	
	ДокументОснование = МассивДокументов[0];
	
	ВедущийДокумент = ПолучитьСвязанныйДокументМодуля(ДокументОснование);
	Если ВедущийДокумент = Неопределено Тогда
		Возврат; 
	КонецЕсли;   
	
	//Получение новой таблицы счета 
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= ВедущийДокумент.Дата;
	СтруктураПараметров.Договор 			= ВедущийДокумент.Договор;
	СтруктураПараметров.ПриложениеКДоговору = ВедущийДокумент.ПриложениеКДоговору;
	
	ПД = CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров); 
	
	ТаблицаУслуг = CW_Финансы.ПолучитьУслугиДокумента(ВедущийДокумент);
	
	ТаблицаУслуг.Колонки.Добавить("ПредставлениеГП");
	Для Каждого СтрокаУслуг из ТаблицаУслуг Цикл
		СтрокаУслуг.ПредставлениеГП = СокрЛП(СтрокаУслуг.Грузоперевозка.CW_Представление);  
		
		Если ВедущийДокумент.ЦенаСНДС Тогда
			СтрокаУслуг.Сумма = СтрокаУслуг.Сумма + СтрокаУслуг.НДС;	
		КонецЕсли;
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ПД.ВариантСверткиНоменклатурыДляСчетов) И ПД.ВариантСверткиНоменклатурыДляСчетов.СворачиватьПоГрузоперевозкам Тогда
		ТЗ_Усл = ТаблицаУслуг.Скопировать();
		ТЗ_Ит  = ТаблицаУслуг.Скопировать();
		ТЗ_Ит.Очистить();
		ТЗ_ГП  = ТЗ_Усл.Скопировать();
		ТЗ_ГП.Свернуть("ПредставлениеГП");
		ТЗ_ГП.Колонки.Добавить("Представление");
		ТЗ_ГП.Колонки.Добавить("НомСтр");
		ТЗ_ГП.Колонки.Добавить("Итого");
		НомСтр = 0;
		Для Каждого Стр_ГП из ТЗ_ГП Цикл
			ТЗ_Отбор = ТЗ_Усл.Скопировать(Новый Структура("ПредставлениеГП", Стр_ГП.ПредставлениеГП));
			
			Если ПД.ЯзыкПечатиДокументов = 1 Тогда 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПД.ВариантСверткиНоменклатурыДляСчетов.ШаблонСверткиПоГрузоперевозкамАнгл, ВедущийДокумент, Неопределено, ТЗ_Отбор);
			ИначеЕсли ПД.ЯзыкПечатиДокументов = 2 Тогда 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПД.ВариантСверткиНоменклатурыДляСчетов.ШаблонСверткиПоГрузоперевозкам, ВедущийДокумент, Неопределено, ТЗ_Отбор) + " / " + CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПД.ВариантСверткиНоменклатурыДляСчетов.ШаблонСверткиПоГрузоперевозкамАнгл, ВедущийДокумент, Неопределено, ТЗ_Отбор);
			Иначе 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПД.ВариантСверткиНоменклатурыДляСчетов.ШаблонСверткиПоГрузоперевозкам, ВедущийДокумент, Неопределено, ТЗ_Отбор);
			КонецЕсли;
			Стр_ГП.НомСтр = НомСтр;
			Стр_ГП.Итого  = ТЗ_Отбор.Итог("Всего");
			
			CW_Печать.ПодготовитьТаблицуУслуг(ТЗ_Отбор, ВедущийДокумент, ПД, "счет", ВедущийДокумент.Корректировка);
			Для Каждого Стр_Отбор из ТЗ_Отбор Цикл
				Стр_Ит = ТЗ_Ит.Добавить();
				ЗаполнитьЗначенияСвойств(Стр_Ит, Стр_Отбор);
			КонецЦикла;	
			НомСтр = НомСтр + 1 + ТЗ_Отбор.Количество();
		КонецЦикла;
		ТаблицаУслуг = ТЗ_Ит.Скопировать();
	Иначе	
		CW_Печать.ПодготовитьТаблицуУслуг(ТаблицаУслуг,ВедущийДокумент,ПД,"счет", ВедущийДокумент.Корректировка);
	КонецЕсли;	
	//Получение новой таблицы счета 
	
	СоответствиеКолонок = ПолучитьСоответствиеКолонокТаблицыДокументов(ТипЗнч(ДокументОснование));	
	Если СоответствиеКолонок = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ТаблицаДокумента = ТаблицаСведений[0].ТаблицаДокумента.Скопировать();
	ТаблицаДокумента.Очистить();
	
	ЗаполнитьТаблицуДокумента(СоответствиеКолонок, ТаблицаДокумента, ТаблицаУслуг, ВедущийДокумент);
	
	ТаблицаСведений[0].ТаблицаДокумента = ТаблицаДокумента;

КонецПроцедуры   
//СчетНаОплатуПокупателю   

Процедура ЗаполнитьТаблицуДокумента(СоответствиеКолонок, ТаблицаДокумента, ТаблицаУслуг, ДокументСсылка, РасчетыВУсловныхЕдиницах=Ложь)
	
	//Заполнение исходной таблицы документа
	Для Каждого СтрокаУслуг из ТаблицаУслуг Цикл
		
		НоваяСтрока = ТаблицаДокумента.Добавить(); 
		Для Каждого ЭлементСоответствия из СоответствиеКолонок Цикл        
			Если НЕ ПустаяСтрока(ЭлементСоответствия.Значение) Тогда
				НоваяСтрока[ЭлементСоответствия.Ключ] = Вычислить(ЭлементСоответствия.Значение);	
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	//Заполнение исходной таблицы документа

КонецПроцедуры 

Функция ПолучитьСвязанныйДокументМодуля(ДокументОснование) 
	
	Если НЕ Пользователи.РолиДоступны("БухгалтерияЭкспедитора,ПолныеПрава") Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ДоступныеТипы = ДоступныеТипыДокументаОснования(); 
	Если ДоступныеТипы.Найти(ТипЗнч(ДокументОснование)) = Неопределено Тогда
		Возврат Неопределено; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТь ПЕРВЫЕ 1
	|	CW_ДоходыПоГрузоперевозке.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозке.Проведен = Истина 
	|	//УсловиеВедомыйДокумент";
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеВедомыйДокумент", "И CW_ДоходыПоГрузоперевозке.ВедомыйДокумент = &ДокументОснование");	
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеВедомыйДокумент", "И CW_ДоходыПоГрузоперевозке.ВедомыйДокументКорректировки = &ДокументОснование");	
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеВедомыйДокумент", "И CW_ДоходыПоГрузоперевозке.ВедомыйСчетФактура = &ДокументОснование");	
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеВедомыйДокумент", "И CW_ДоходыПоГрузоперевозке.ВедомыйСчет = &ДокументОснование");	
	КонецЕсли;  
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапрсоа = Запрос.Выполнить();
	Выборка = РезультатЗапрсоа.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 

Функция ДоступныеТипыДокументаОснования()
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг")); 
	Массив.Добавить(Тип("ДокументСсылка.КорректировкаРеализации")); 

	Массив.Добавить(Тип("ДокументСсылка.СчетФактураВыданный")); 
	Массив.Добавить(Тип("ДокументСсылка.СчетНаОплатуПокупателю")); 
	
	Возврат Массив
	
КонецФункции 

Функция ПолучитьСоответствиеКолонокТаблицыДокументов(ТипЗнчОснования, ДанныеДляПечати=Неопределено, ДополнительныеПараметры=Неопределено)  
	
	Если ТипЗнчОснования = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Возврат ПолучитьСоответствиеКолонок_РеализацияТоваровУслуг(ДополнительныеПараметры, ДанныеДляПечати);	

	ИначеЕсли ТипЗнчОснования = Тип("ДокументСсылка.КорректировкаРеализации") Тогда  
		
       Если НужноПечататьОбычныйСчетФактуру(ДанныеДляПечати.Реквизиты[0].ВедущийДокумент) Тогда
			Возврат ПолучитьСоответствиеКолонок_РеализацияТоваровУслуг(ДополнительныеПараметры, ДанныеДляПечати);	
		Иначе
			Возврат ПолучитьСоответствиеКолонок_КорректировкаРеализации(ДополнительныеПараметры);	
		КонецЕсли;
				
	ИначеЕсли ТипЗнчОснования = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда

		Возврат ПолучитьСоответствиеКолонок_СчетНаОплатуПокупателю();	

	КонецЕсли;
	
	Возврат Неопределено;
 
КонецФункции   

Функция НужноПечататьОбычныйСчетФактуру(Ссылка)  
	
	ВидОперацииКорректировки = Ссылка.ВидОперацииКорректировки; 
	Если  ВидОперацииКорректировки.Пустая() Тогда
		ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение");
	КонецЕсли;   
	
	Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") Тогда  
		Возврат Ложь;  //Должно быть так со солов АПС, уверен, что к этому еще вернемся, так как это сделано под конкретный документ. 
		//Если Не Ссылка.КорректируемыйДокумент.Корректировка Тогда 
		//	Возврат Ложь;
		//Иначе
		//	Возврат НужноПечататьОбычныйСчетФактуру(Ссылка.КорректируемыйДокумент);	
		//КонецЕсли; 
	КонецЕсли;	
	
	Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда  
		Если Не Ссылка.КорректируемыйДокумент.Корректировка Тогда 
			Возврат Истина;  
		Иначе
			Возврат НужноПечататьОбычныйСчетФактуру(Ссылка.КорректируемыйДокумент);	
		КонецЕсли; 
	КонецЕсли;  
	
	Возврат Ложь;
	
КонецФункции



Функция ПолучитьСоответствиеКолонок_РеализацияТоваровУслуг(ДополнительныеПараметры, ДанныеДляПечати)
	
	Если ДополнительныеПараметры.ВерсияПостановления1137 >= 5 Тогда
		ТоварКодТНВЭД = "?(ЗначениеЗаполнено(СтрокаУслуг.Номенклатура.КодТНВЭД), СтрокаУслуг.Номенклатура.КодТНВЭД, ""--"")";
	КонецЕсли;   
	
	РасчетыВУсловныхЕдиницах = Ложь;
	Если ДанныеДляПечати <> Неопределено тогда
		РасчетыВУсловныхЕдиницах = ДанныеДляПечати.Реквизиты[0].РасчетыВУсловныхЕдиницах;	
	КонецЕсли;
	
	Соответствие = Новый Соответствие;     

	Соответствие.Вставить("Ссылка", 			"ДокументСсылка.ВедомыйДокумент");	
	Соответствие.Вставить("НомерТабЧасти", 		"3");
	
	Соответствие.Вставить("Товар", 				"СтрокаУслуг.Номенклатура");	
	Соответствие.Вставить("ТоварКод", 			"СтрокаУслуг.Номенклатура.Код");	
	Соответствие.Вставить("ТоварНаименование", 	"СтрокаУслуг.Представление");
	
	Соответствие.Вставить("ТоварКодТНВЭД", 		ТоварКодТНВЭД);	

	Соответствие.Вставить("СтранаПроисхождения", 	"");	
	Соответствие.Вставить("ПредставлениеСтраны", 	"");	
	Соответствие.Вставить("СтранаПроисхожденияКод", "");	
	Соответствие.Вставить("НомерГТД", 				"");
	Соответствие.Вставить("ПредставлениеГТД", 		"");	
	Соответствие.Вставить("РегистрационныйНомерТД", "");
	
	Соответствие.Вставить("ЕдиницаИзмерения", 				"ПредставлениеЕдиницыИзмерения(СтрокаУслуг).ЕдиницаИзмерения");	
	Соответствие.Вставить("ЕдиницаИзмеренияКод", 			"ПредставлениеЕдиницыИзмерения(СтрокаУслуг).Код");	
	Соответствие.Вставить("ЕдиницаИзмеренияНаименование", 	"ПредставлениеЕдиницыИзмерения(СтрокаУслуг).Наименование");	

	Соответствие.Вставить("Количество", 					"ПолучитьЗначениеПоля(СтрокаУслуг, ""Количество"")");	
	
	Если РасчетыВУсловныхЕдиницах Тогда
		Соответствие.Вставить("СуммаБезНДС", 	"СтрокаУслуг.Сумма_Рег");	
		Соответствие.Вставить("СуммаНДС", 		"СтрокаУслуг.НДС_Рег");
		Соответствие.Вставить("Всего", 			"СтрокаУслуг.Всего_Рег");	
		Соответствие.Вставить("Цена", 			"ПолучитьЗначениеПоля(СтрокаУслуг, ""Цена_Рег"")");
	Иначе
		Соответствие.Вставить("СуммаБезНДС", 	"СтрокаУслуг.Сумма");	
		Соответствие.Вставить("СуммаНДС", 		"СтрокаУслуг.НДС");
		Соответствие.Вставить("Всего", 			"СтрокаУслуг.Всего");	
		Соответствие.Вставить("Цена", 			"ПолучитьЗначениеПоля(СтрокаУслуг, ""Цена"")");
	КонецЕсли;
	
	Соответствие.Вставить("СуммаБезНДСРуб", "СтрокаУслуг.Сумма_Рег");
	Соответствие.Вставить("НДСРуб", 		"СтрокаУслуг.НДС_Рег");	
	Соответствие.Вставить("ВсегоРуб", 		"СтрокаУслуг.Всего_Рег");	
	
	Соответствие.Вставить("СтавкаНДС", 		"СтрокаУслуг.СтавкаНДС");
	
	Соответствие.Вставить("Акциз", 			"ЛОЖЬ");	
	Соответствие.Вставить("ЭтоКомиссия", 	"ЛОЖЬ");
	
	Соответствие.Вставить("КонтрагентСводныйСФ", 				"");	
	Соответствие.Вставить("ПериодичностьУслуги", 				"");	
	Соответствие.Вставить("ДатаОтгрузочногоДокумента", 			"ДокументСсылка.ДатаАкта");	
	Соответствие.Вставить("НомерОтгрузочногоДокумента", 		"CW_Документы.ПолучитьНомерНаПечать(ДокументСсылка, ""НомерАкта"", ""ДатаАкта"")");	
	Соответствие.Вставить("ИдентификаторСтрокиГосконтрактаЕИС", "");
	
	Возврат Соответствие;      
	
КонецФункции 

Функция ПолучитьСоответствиеКолонок_КорректировкаРеализации(ДополнительныеПараметры)
	
	Если ДополнительныеПараметры.ВерсияПостановления1137 >= 5 Тогда
		ТоварКодТНВЭД = "?(ЗначениеЗаполнено(СтрокаУслуг.Номенклатура.КодТНВЭД), СтрокаУслуг.Номенклатура.КодТНВЭД, ""--"")";
	КонецЕсли;
	
	ЕстьКолонки_ПК 				= Неопределено;
	ДополнительныеПараметры.Свойство("ЕстьКолонки_ПК", 			 ЕстьКолонки_ПК);   
	ЕстьКолонки_ПК 				= ?(ЕстьКолонки_ПК = Неопределено, Ложь, ЕстьКолонки_ПК);
	
	
	Соответствие = Новый Соответствие; 

	Соответствие.Вставить("Ссылка", 			"ДокументСсылка.ВедомыйДокументКорректировки");	
	Соответствие.Вставить("НомерТабЧасти", 		"3");

	Соответствие.Вставить("Товар", 						"СтрокаУслуг.Номенклатура");	
	Соответствие.Вставить("ТоварКод", 					"СтрокаУслуг.Номенклатура.Код");	
	Соответствие.Вставить("НаименованиеНоменклатуры", 	"СтрокаУслуг.Представление");
	
	Соответствие.Вставить("ТоварКодТНВЭД" , 			ТоварКодТНВЭД);	
	Соответствие.Вставить("ТоварКодТНВЭДДоИзменения", 	"");
	
	Соответствие.Вставить("НаименованиеЕдиницыИзмерения", 	"ПредставлениеЕдиницыИзмерения(СтрокаУслуг).Наименование");
	Соответствие.Вставить("ЕдиницаИзмеренияНаименование",	"ПредставлениеЕдиницыИзмерения(СтрокаУслуг).Наименование");
	Соответствие.Вставить("ЕдиницаИзмеренияКод",			"ПредставлениеЕдиницыИзмерения(СтрокаУслуг).Код");	  
	
	Соответствие.Вставить("СтавкаНДСДоИзменения", 		"СтрокаУслуг.СтавкаНДС_ДоКорректировки");	
	Соответствие.Вставить("СтавкаНДСПослеИзменения",	"СтрокаУслуг.СтавкаНДС");	
	Соответствие.Вставить("СтавкаНДС",					"СтрокаУслуг.СтавкаНДС");	
	
	Соответствие.Вставить("АкцизДоИзменения", 		"ЛОЖЬ");	
	Соответствие.Вставить("АкцизПослеИзменения", 	"ЛОЖЬ");	
		
	Соответствие.Вставить("ПредставлениеСтраныПосле", "");	
	Соответствие.Вставить("ПредставлениеСтраныДо", "");	
	
	Соответствие.Вставить("СтранаПроисхожденияКодПосле", "");	 
	Соответствие.Вставить("СтранаПроисхожденияКодДо", 	 "");
	
	Соответствие.Вставить("СтранаПроисхождения",	"");	
	Соответствие.Вставить("СтранаПроисхожденияДо", 	"");	

	Соответствие.Вставить("СтрокаДо", 		"Строка(""А (до изменения)"")");	
	Соответствие.Вставить("СтрокаПосле", 	"Строка(""Б (после изменения)"")");	 
	
	Соответствие.Вставить("СтрокаУвеличение", "Строка(""В (увеличение)"")");	
	Соответствие.Вставить("СтрокаУменьшение", "Строка(""Г (уменьшение)"")");
	
	Соответствие.Вставить("РегистрационныйНомерТДДо", 		"");	
	Соответствие.Вставить("РегистрационныйНомерТДПосле", 	"");	  
	
	Соответствие.Вставить("ИдентификаторСтрокиГосконтрактаЕИС", "");    
	
	
	Если ЕстьКолонки_ПК Тогда    
		
		Соответствие.Вставить("КоличествоДоИзменения", 		 	"ПолучитьЗначениеПоля(СтрокаУслуг, ""Количество"")");	
		Соответствие.Вставить("КоличествоПослеИзменения", 		"ПолучитьЗначениеПоля(СтрокаУслуг, ""ПК_Количество"")");
		
		Соответствие.Вставить("ЦенаДоИзменения", 				"?(РасчетыВУсловныхЕдиницах, ПолучитьЗначениеПоля(СтрокаУслуг, ""Цена_Рег""), 	ПолучитьЗначениеПоля(СтрокаУслуг, ""Цена""))");	
		Соответствие.Вставить("ЦенаПослеИзменения",				"?(РасчетыВУсловныхЕдиницах, ПолучитьЗначениеПоля(СтрокаУслуг, ""ПК_Цена_Рег""),ПолучитьЗначениеПоля(СтрокаУслуг, ""ПК_Цена""))");	
		
		Соответствие.Вставить("СтоимостьБезНДСДоИзменения",		"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.Сумма_Рег, СтрокаУслуг.Сумма)");	
		Соответствие.Вставить("СтоимостьБезНДСПослеИзменения",	"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.ПК_Сумма_Рег, СтрокаУслуг.ПК_Сумма)");	
		
		Соответствие.Вставить("СуммаНДСДоИзменения",			"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.НДС_Рег, СтрокаУслуг.НДС)");	
		Соответствие.Вставить("СуммаНДСПослеИзменения",			"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.ПК_НДС_Рег, СтрокаУслуг.ПК_НДС)");	
		
		Соответствие.Вставить("СтоимостьСНДСДоИзменения",		"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.Всего_Рег, СтрокаУслуг.Всего)");	
		Соответствие.Вставить("СтоимостьСНДСПослеИзменения",	"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.ПК_Всего_Рег, СтрокаУслуг.ПК_Всего)");
		
		
		СтрШаблонУвеличение = "?(%1<%2 ,%2-%1, 0)"; 
  		СтрШаблонУменьшение = "?(%1>%2 ,%1-%2, 0)"; 
		
		РазницаБезНДСУвеличение = СтрШаблон(СтрШаблонУвеличение,"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.Сумма_Рег, 	СтрокаУслуг.Сумма)",
																"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.ПК_Сумма_Рег, 	СтрокаУслуг.ПК_Сумма)");
		
		РазницаБезНДСУменьшение = СтрШаблон(СтрШаблонУменьшение,"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.Сумма_Рег, 	СтрокаУслуг.Сумма)",
																"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.ПК_Сумма_Рег, 	СтрокаУслуг.ПК_Сумма)");
		
  		РазницаНДСУвеличение = СтрШаблон(СтрШаблонУвеличение,	"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.НДС_Рег, 		СтрокаУслуг.НДС)",
																"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.ПК_НДС_Рег, 	СтрокаУслуг.ПК_НДС)");
		
  		РазницаНДСУменьшение = СтрШаблон(СтрШаблонУменьшение,	"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.НДС_Рег, 		СтрокаУслуг.НДС)",
																"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.ПК_НДС_Рег, 	СтрокаУслуг.ПК_НДС)");
		
  		РазницаСНДСУвеличение = СтрШаблон(СтрШаблонУвеличение,	"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.Всего_Рег, 	СтрокаУслуг.Всего)",
																"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.ПК_Всего_Рег, 	СтрокаУслуг.ПК_Всего)");
		
  		РазницаСНДСУменьшение = СтрШаблон(СтрШаблонУменьшение,	"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.Всего_Рег, 	СтрокаУслуг.Всего)",
																"?(РасчетыВУсловныхЕдиницах, СтрокаУслуг.ПК_Всего_Рег, 	СтрокаУслуг.ПК_Всего)");
		
		
	Иначе    
		
		Соответствие.Вставить("КоличествоДоИзменения", 			"ПолучитьЗначениеПоля(СтрокаУслуг, ""Количество_ДоКорректировки"")");	
		Соответствие.Вставить("КоличествоПослеИзменения",		"ПолучитьЗначениеПоля(СтрокаУслуг, ""Количество"")");	
		
		
		Соответствие.Вставить("ЦенаДоИзменения", 				"ПолучитьЗначениеПоля(СтрокаУслуг, ""Цена_ДоКорректировки"")");	
		Соответствие.Вставить("ЦенаПослеИзменения",				"ПолучитьЗначениеПоля(СтрокаУслуг, ""Цена"")");	
	
		Соответствие.Вставить("СтоимостьБезНДСДоИзменения",		"СтрокаУслуг.Сумма_ДоКорректировки");	
		Соответствие.Вставить("СтоимостьБезНДСПослеИзменения",	"СтрокаУслуг.Сумма");	
		
		Соответствие.Вставить("СуммаНДСДоИзменения",			"СтрокаУслуг.НДС_ДоКорректировки");	
		Соответствие.Вставить("СуммаНДСПослеИзменения",			"СтрокаУслуг.НДС");	
		
		Соответствие.Вставить("СтоимостьСНДСДоИзменения",		"СтрокаУслуг.Всего_ДоКорректировки");	
		Соответствие.Вставить("СтоимостьСНДСПослеИзменения",	"СтрокаУслуг.Всего");	
		
		РазницаБезНДСУвеличение = "?(СтрокаУслуг.Сумма_ДоКорректировки < СтрокаУслуг.Сумма, СтрокаУслуг.Сумма - СтрокаУслуг.Сумма_ДоКорректировки,0)"; 
		РазницаБезНДСУменьшение = "?(СтрокаУслуг.Сумма_ДоКорректировки > СтрокаУслуг.Сумма, СтрокаУслуг.Сумма_ДоКорректировки - СтрокаУслуг.Сумма,0)"; 
		
		РазницаНДСУвеличение = "?(СтрокаУслуг.НДС_ДоКорректировки < СтрокаУслуг.НДС, СтрокаУслуг.НДС - СтрокаУслуг.НДС_ДоКорректировки,0)"; 
		РазницаНДСУменьшение = "?(СтрокаУслуг.НДС_ДоКорректировки > СтрокаУслуг.НДС, СтрокаУслуг.НДС_ДоКорректировки - СтрокаУслуг.НДС,0)"; 
		
		РазницаСНДСУвеличение = "?(СтрокаУслуг.Всего_ДоКорректировки < СтрокаУслуг.Всего, СтрокаУслуг.Всего - СтрокаУслуг.Всего_ДоКорректировки,0)"; 
		РазницаСНДСУменьшение = "?(СтрокаУслуг.Всего_ДоКорректировки > СтрокаУслуг.Всего, СтрокаУслуг.Всего_ДоКорректировки - СтрокаУслуг.Всего,0)"; 
	КонецЕсли;  
	
	Соответствие.Вставить("РазницаБезНДСУвеличение",	РазницаБезНДСУвеличение);	
	Соответствие.Вставить("РазницаБезНДСУменьшение",	РазницаБезНДСУменьшение);
	
	Соответствие.Вставить("РазницаНДСУвеличение",		РазницаНДСУвеличение);	
	Соответствие.Вставить("РазницаНДСУменьшение",		РазницаНДСУменьшение);	
	
	Соответствие.Вставить("РазницаСНДСУвеличение",		РазницаСНДСУвеличение);	
	Соответствие.Вставить("РазницаСНДСУменьшение",		РазницаСНДСУменьшение);		
	
	Возврат Соответствие;  	
	
КонецФункции       

Функция ПолучитьСоответствиеКолонок_СчетНаОплатуПокупателю()
	
	Соответствие = Новый Соответствие;     
    Соответствие.Вставить("ТабличнаяЧасть", 			"ПредопределенноеЗначение(""Перечисление.ТабличныеЧастиДокументов.Товары"")");
	Соответствие.Вставить("НомерСтроки",				"ТаблицаУслуг.Индекс(СтрокаУслуг)+1");  
	
	Соответствие.Вставить("Номенклатура", 				"СтрокаУслуг.Номенклатура"); 
	Соответствие.Вставить("ЭтоУслуга", 					"СтрокаУслуг.Номенклатура.Услуга");  
	Соответствие.Вставить("НоменклатураАртикул", 		"СтрокаУслуг.Номенклатура.Артикул");
	Соответствие.Вставить("НоменклатураНаименование", 	"СтрокаУслуг.Представление");
	Соответствие.Вставить("Содержание", 				"СтрокаУслуг.Представление");  
	
	Соответствие.Вставить("ЕдиницаИзмерения", 					"СтрокаУслуг.Номенклатура.ЕдиницаИзмерения");
	Соответствие.Вставить("ЕдиницаИзмеренияКод", 				"СтрокаУслуг.Номенклатура.ЕдиницаИзмерения.Код");
	Соответствие.Вставить("ЕдиницаИзмеренияНаименование", 		"СтрокаУслуг.Номенклатура.ЕдиницаИзмерения.Наименование");
	Соответствие.Вставить("ЕдиницаИзмеренияНаименованиеПолное",	"СтрокаУслуг.Номенклатура.ЕдиницаИзмерения.НаименованиеПолное");
	
	Соответствие.Вставить("Коэффициент",				"0");    
	
	Соответствие.Вставить("Количество",		"СтрокаУслуг.Количество");
	Соответствие.Вставить("Цена",			"СтрокаУслуг.Цена");
	Соответствие.Вставить("Сумма",			"СтрокаУслуг.Сумма");
	Соответствие.Вставить("СуммаСкидки",	"0");
	Соответствие.Вставить("СтавкаНДС",		"СтрокаУслуг.СтавкаНДС");
	Соответствие.Вставить("СуммаНДС",		"СтрокаУслуг.НДС");
	
	Возврат Соответствие;      
	
КонецФункции 


Функция ПредставлениеЕдиницыИзмерения(СтрокаУслуг) 
	
	ДанныеЕдиницыИзмерения = Новый Структура("ЕдиницаИзмерения,Наименование,НаименованиеПолное,Код", 
		Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка(),"--","--","--"); 
	
	ЕдиницаИзмерения = СтрокаУслуг.Номенклатура.ЕдиницаИзмерения;
	Если СокрЛП(ЕдиницаИзмерения) = "-"  
		или Не ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда 
		Возврат ДанныеЕдиницыИзмерения;
	КонецЕсли;  
	
	ДанныеЕдиницыИзмерения.ЕдиницаИзмерения 	= ЕдиницаИзмерения;
	ДанныеЕдиницыИзмерения.Наименование 		= СокрЛП(ЕдиницаИзмерения.Наименование);
	ДанныеЕдиницыИзмерения.НаименованиеПолное 	= СокрЛП(ЕдиницаИзмерения.НаименованиеПолное);
	ДанныеЕдиницыИзмерения.Код 					= СокрЛП(ЕдиницаИзмерения.Код);
	
	Возврат ДанныеЕдиницыИзмерения;
	
КонецФункции 

Функция ПолучитьЗначениеПоля(СтрокаУслуг, ИмяПоля)
	
	ЕдиницаИзмерения = СтрокаУслуг.Номенклатура.ЕдиницаИзмерения;
	Если СокрЛП(ЕдиницаИзмерения) = "-"  
		или Не ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда 
		Возврат "--";
	КонецЕсли;   
	
	Возврат СтрокаУслуг[ИмяПоля];
	
КонецФункции


