&НаСервере
Процедура _УправлениеФормой()
	
	Элементы.ПодсчитатьРазмер.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры



&НаКлиенте
Процедура ПодсчитатьРазмер(Команда)
	
	_УФК.ВывестиПредупреждение(ПодсчитатьРазмер_Сервер());
	
КонецПроцедуры

&НаСервере
Функция ПодсчитатьРазмер_Сервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ОбъектыАрхива.Размер) КАК Размер
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК ОбъектыАрхива
	               |ГДЕ
	               |	ОбъектыАрхива.Том = &Том";
	Запрос.УстановитьПараметр("Том", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		// определяем размер
		Возврат(_сф.ф_ПриведенныйРазмер(?(Выборка.Размер = Null,0,Выборка.Размер)));
		
	КонецЕсли;  	
	
КонецФункции

&НаКлиенте
Процедура ПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выбор каталога";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.Путь = ДиалогОткрытияФайла.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	_УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УправлениеФормой();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
