
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Объект", ПодключаемыйОбъект);
	
	Если ЗначениеЗаполнено(ПодключаемыйОбъект) Тогда
		Настройки = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъект);
		Если Настройки <> Неопределено Тогда
			Настройки.Свойство("Параметр", Параметр);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНастройки();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Параметр", Параметр);
	
	_ПО.ЗаписатьНастройкиОбработки(ПодключаемыйОбъект, СтруктураНастройки); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрПриИзменении(Элемент)
	
	Отказ = Ложь;
	Если Не ПроверитьТипПараметра() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать параметр с типом занчения ""<Имя типа>""",,"Параметр",,Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Параметр = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьТипПараметра()
	Возврат Истина; //Параметр.ТипЗначения.СодержитТип(Тип(<ИмяТипа>));
КонецФункции


 