#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Расчет к акту";
	СтруктураОписания.Описание 					= "Расчет к акту";
	
	СтруктураОписания.Версия					= "3.2.8.2";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.15.8";
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерИсправления]", 			"Номер исправлния", 			"ПолучитьНомерИсправления(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления
	
	Возврат СтруктураОписания;
	
КонецФункции   

Процедура Регистрация(Ссылка) Экспорт
	
	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_ДоходыПоГрузоперевозке");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "Расчет к акту"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		

	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);

КонецПроцедуры

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметровДоговора.Дата 				= СсылкаНаОбъект.Дата;
	СтруктураПараметровДоговора.Договор 			= СсылкаНаОбъект.Договор;
	СтруктураПараметровДоговора.ПриложениеКДоговору = СсылкаНаОбъект.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора,"ТребуетсяРасчетКАкту");

	Возврат ПараметрыДоговора.ТребуетсяРасчетКАкту и СсылкаНаОбъект.ФормируетсяАкт;
	
КонецФункции

Функция ИспользованиеВКонтексте(КонтекстВызова) Экспорт 
	
	Использование = Ложь;
	
	Если ТипЗнч(КонтекстВызова) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
		СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметровДоговора.Дата 				= СсылкаНаОбъект.Дата;
		СтруктураПараметровДоговора.Договор 			= СсылкаНаОбъект.Договор;
		СтруктураПараметровДоговора.ПриложениеКДоговору = СсылкаНаОбъект.ПриложениеКДоговору;
		
		ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора,"ТребуетсяРасчетКАкту");
		
		Использование = ПараметрыДоговора.ТребуетсяРасчетКАкту и СсылкаНаОбъект.ФормируетсяАкт;
	
	КонецЕсли;
	
	Возврат Использование;
	
КонецФункции
// информация об обработке

//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьНомерИсправления(ПараметрыПроцедуры) Экспорт
	
	НомерИсправления  = ?(ЗначениеЗаполнено(ПараметрыПроцедуры.НомерИсправления), " (испр. "+Формат(ПараметрыПроцедуры.НомерИсправления,"ЧГ=0")+")","");
	Возврат СокрЛП(НомерИсправления);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления

Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт
	
	Ссылка = СсылкаНаОбъект;
	
	// настройки печати
	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	КонецЕсли;
	СоответствиеГоризонтальногоПоложения = ПолучитьСоответствиеГоризонтальногоПоложения();
	
	// параметры договора 
	СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметровДоговора.Дата 				= Ссылка.Дата;
	СтруктураПараметровДоговора.Договор 			= Ссылка.Договор;
	СтруктураПараметровДоговора.ПриложениеКДоговору = Ссылка.ПриложениеКДоговору;
	ПараметрыДоговора								= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора); 

	// в зависимости от языка вывода печатных форм, указанного в параметрах договора, 
	// определим на каком языке нужно получать данные 
	ПолучитьАнглДанные = ПараметрыДоговора.ЯзыкПечатиДокументов = 1 или ПараметрыДоговора.ЯзыкПечатиДокументов = 2;
	ПолучитьРусДанные  = ПараметрыДоговора.ЯзыкПечатиДокументов = 0 или ПараметрыДоговора.ЯзыкПечатиДокументов = 2;
	
	// получим структуру для описания результата печати и заполним ее
	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();
	
	// количество экземпляров
	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхАкта", Истина);  
	Если КоличествоЭксземпляров <> Неопределено Тогда 
		РезультатПечати.Параметры.Количество = КоличествоЭксземпляров;
		РезультатПечати.Параметры.Печать 	 = (КоличествоЭксземпляров <> 0);  
	Иначе
		РезультатПечати.Параметры.Количество = 2;
		РезультатПечати.Параметры.Печать 	 = Истина;  
	КонецЕсли;  
	
	// параметры для ведения бухгалтерского учета 
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				СсылкаНаОбъект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		СсылкаНаОбъект.ПриложениеКДоговору);
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, СсылкаНаОбъект.Дата);
	
	// Формирование представления печатной формы  
	#Область ФормированиеПредставленияПечатнойФормы 
	
	НомерДокумента = "";
	ДатаДокумента = Дата(1,1,1); 
	ВидДокументаРус = "";
	ВидДокументаАнгл = "";
	
	// Печатная форма всегда формируется к акту, но в качестве акта может выступать УПД.
	// В случае УПД, при наличии признака "с/ф" в качестве номера используем номер с/ф.  
	Если Ссылка.ЭтоУниверсальныйДокумент Тогда
		Если Ссылка.ФормируетсяСчетФактура Тогда
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерСчетаФактуры", "ДатаСчетаФактуры");
			ДатаДокумента = Ссылка.ДатаСчетаФактуры; 
			ВидДокументаАнгл = ?(ПолучитьАнглДанные,"UTD","");
			ВидДокументаРус = ?(ПолучитьРусДанные,"УПД","");
		КонецЕсли; 
	КонецЕсли;
		
	// Если не удалось получить номер для УПД, значит это УПД с видом "2" (акт)
	Если Не ЗначениеЗаполнено(НомерДокумента) Тогда
		НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерАкта", "ДатаАкта");
		ДатаДокумента = Ссылка.ДатаАкта;  
		ВидДокументаАнгл = ?(ПолучитьАнглДанные,"act","");
		ВидДокументаРус = ?(ПолучитьРусДанные,"акту","");
	КонецЕсли;

	// если по каким-то причинам не удалось получить номер или дату, 
	// то в качестве реквизитов используем номер и дату самого документа 
	Если Не ЗначениеЗаполнено(НомерДокумента) или Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "Номер", "Дата");
		ДатаДокумента = Ссылка.Дата;  
		ВидДокументаАнгл = ?(ПолучитьАнглДанные,"Act","");
		ВидДокументаРус = ?(ПолучитьРусДанные,"Акт","");
	КонецЕсли;
	
	// формируем представление
	ПредставлениеДокумента     = "Расчет к " + ВидДокументаРус + " №" 			+ НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
	ПредставлениеДокументаАнгл = "Calculation to " + ВидДокументаАнгл + " №" + НомерДокумента + " of  "+ Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
		
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(ПредставлениеДокумента));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НомерДокумента",	НомерДокумента);
	ПараметрыПроцедуры.Вставить("ДатаДокумента",	ДатаДокумента);
	ПараметрыПроцедуры.Вставить("НомерИсправления",	СсылкаНаОбъект.НомерИсправления);
	
	РезультатПечати.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	
	#КонецОбласти 
	// <--- Формирование представления печатной формы  
	
	// формируем печатную форму
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб=Истина;
	
	Макет = ПолучитьМакет("МакетРасчетКАкту");
	
	НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(Ссылка.Организация, ДатаДокумента);
	КППОрганизации 			= Справочники.Организации.КППНаДату(Ссылка.Организация, ДатаДокумента);
	
	НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент, ДатаДокумента);
	
	
	ОбластьОтсутп = Макет.ПолучитьОбласть("Отступ");
	
	//ИдентификаторДокумента
	ИспользуетсяЭлектронныйОбменДанными = Константы.CW_ИспользуетсяЭлектронныйОбменДанными.Получить();
	Если ИспользуетсяЭлектронныйОбменДанными Тогда
		ИдентификаторДокумента = СокрЛП(XMLСтрока(СсылкаНаОбъект));
		
		Если ПолучитьРусДанные Тогда
			ОбластьИдентификаторДокумента_Рус  = Макет.ПолучитьОбласть("ИдентификаторДокумента_Рус");
			ОбластьИдентификаторДокумента_Рус.Параметры.ИдентификаторДокумента = ИдентификаторДокумента;
			ТабличныйДокумент.Вывести(ОбластьИдентификаторДокумента_Рус);
		КонецЕсли;  
		Если ПолучитьАнглДанные Тогда
			ОбластьИдентификаторДокумента_Англ  = Макет.ПолучитьОбласть("ИдентификаторДокумента_Англ");
			ОбластьИдентификаторДокумента_Англ.Параметры.ИдентификаторДокумента = ИдентификаторДокумента;
			ТабличныйДокумент.Вывести(ОбластьИдентификаторДокумента_Англ);
		КонецЕсли;  
		
		ТабличныйДокумент.Вывести(ОбластьОтсутп);
	КонецЕсли;  
	//ИдентификаторДокумента
	
	
	// шапка
	Если ПолучитьРусДанные Тогда
		ОбластьШапка_рус  = Макет.ПолучитьОбласть("Шапка_Рус");
		
		Исполнитель = НаименованияОрганизации.НаименованиеДляПечатныхФорм;
		Если Не ЗначениеЗаполнено(Исполнитель) Тогда
			Исполнитель = НаименованияОрганизации.СокращенноеНаименование;
		КонецЕсли;
		
		ОбластьШапка_рус.Параметры.Исполнитель = Исполнитель;	
		
		ТабличныйДокумент.Вывести(ОбластьШапка_рус);
	КонецЕсли;
	
	Если ПолучитьАнглДанные Тогда
		ОбластьШапка_англ = Макет.ПолучитьОбласть("Шапка_Англ");
		ОбластьШапка_англ.Параметры.исполнитель_англ = CW_Настройки.ПараметрУчетнойПолитики(Ссылка.Дата, Ссылка.Организация, "НаименованиеОрганизацииАнгл");
		
		ТабличныйДокумент.Вывести(ОбластьШапка_англ);
	КонецЕсли;
	
	// шапка
	
	// верхняя часть
	Если ПолучитьРусДанные Тогда
		ОбластьВерхняяЧасть_рус  = Макет.ПолучитьОбласть("ВрехнаяЧасть_Рус");
		ОбластьВерхняяЧасть_рус.Параметры.НадписьАКТ_Рус = ПредставлениеДокумента;
		
		ТабличныйДокумент.Вывести(ОбластьВерхняяЧасть_рус);
	КонецЕсли;
	
	Если ПолучитьАнглДанные Тогда
		ОбластьВерхняяЧасть_Англ  = Макет.ПолучитьОбласть("ВрехнаяЧасть_Англ");
		ОбластьВерхняяЧасть_Англ.Параметры.НадписьАКТ_Англ = ПредставлениеДокументаАнгл;
		
		ТабличныйДокумент.Вывести(ОбластьВерхняяЧасть_Англ);
	КонецЕсли;
	// верхняя часть
	
	//Покупатель и договор      ПолноеНаименование, НаименованиеДляПечатныхФорм
	Если ПолучитьРусДанные Тогда
		Приложение     = "Договор №";
		
		Покупатель_Рус = НаименованияКонтрагента.НаименованиеДляПечатныхФорм;
		Если Не ЗначениеЗаполнено(Покупатель_Рус) Тогда
			Покупатель_Рус = НаименованияКонтрагента.СокращенноеНаименование;
		КонецЕсли;
		
		ОбластьПокупатель_рус  = Макет.ПолучитьОбласть("Покупатель_Рус");
		ОбластьПокупатель_рус.Параметры.Покупатель_Рус 	= ""+Покупатель_Рус;	
		ОбластьПокупатель_рус.Параметры.Договор_Рус 	= Приложение + Ссылка.Договор.НомерДоговора+" от "+Формат(Ссылка.Договор.ДатаДоговора, "ДФ=dd.MM.yyyy");	
		
		ТабличныйДокумент.Вывести(ОбластьПокупатель_рус);
	КонецЕсли;
	
	// дополнительно
	Если ПараметрыДоговора.ВыводитьДополнениевШапкуРасчетаАкта Тогда
		Если ПолучитьРусДанные Тогда
			ОбластьДополнительно_рус = Макет.ПолучитьОбласть("Дополнительно_Рус");
			ОбластьДополнительно_рус.Параметры.ДополнительноРус = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеРасчетаАкта, Ссылка, Неопределено, Ссылка.Услуги);
			
			ТабличныйДокумент.Вывести(ОбластьДополнительно_рус);
		КонецЕсли;
	КонецЕсли;	
	// дополнительно

	Если ПолучитьАнглДанные Тогда
		ТабличныйДокумент.Вывести(ОбластьОтсутп);
	КонецЕсли;
	
	Если ПолучитьАнглДанные Тогда
		ПриложениеАнгл = "Contract №";
		
		ОбластьПокупатель_англ = Макет.ПолучитьОбласть("Покупатель_Англ");
		ОбластьПокупатель_англ.Параметры.Покупатель_Англ = ""+ПараметрыДоговора.НаименованиеКонтрагентаАнгл;	
		ОбластьПокупатель_англ.Параметры.Договор_Англ 	= ПриложениеАнгл + Ссылка.Договор.НомерДоговора+" оf  "+Формат(Ссылка.Договор.ДатаДоговора, "Л=en; ДФ=dd.MM.yyyy");	
		
		ТабличныйДокумент.Вывести(ОбластьПокупатель_англ);
	КонецЕсли;
	//Покупатель и договор
	
	// дополнительно
	Если ПараметрыДоговора.ВыводитьДополнениевШапкуРасчетаАкта Тогда
		Если ПолучитьАнглДанные Тогда
			ОбластьДополнительно_англ = Макет.ПолучитьОбласть("Дополнительно_Англ");
			ОбластьДополнительно_англ.Параметры.ДополнительноАнгл = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеРасчетаАктаАнгл, Ссылка, Неопределено, Ссылка.Услуги);
			
			ТабличныйДокумент.Вывести(ОбластьДополнительно_англ);
		КонецЕсли;
	КонецЕсли;	
	// дополнительно
	
	ВариантСверткиНоменклатуры = ПараметрыДоговора.ВариантСверткиНоменклатурыДляРасчетаАкту;

	//Подготовка данных
	ТаблицаУслуг = CW_Финансы.ПолучитьУслугиДокумента(Ссылка);
	ТаблицаУслуг.Колонки.Добавить("ПредставлениеГП", 			Новый ОписаниеТипов("Строка"));
	ТаблицаУслуг.Колонки.Добавить("ИдентификаторСтрокиСвертки", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаУслуг.Колонки.Добавить("НомерСтрокиУслуг");
	
	//Подсистема.СверткаТабличныхЧастей
	СоответствиеДополнительныхПолей = CW_СверткаТабличныхЧастей.ДополнитьДополнительныеПоляСвертки(ТаблицаУслуг, ВариантСверткиНоменклатуры);
	//Подсистема.СверткаТабличныхЧастей
	
	//Определяекм общие шаблоны
	Если ЗначениеЗаполнено(ВариантСверткиНоменклатуры) Тогда
		мСтрокиОбщийШаблон =  ВариантСверткиНоменклатуры.НоменклатураСвертки.НайтиСтроки(Новый Структура("Номенклатура", Справочники.Номенклатура.ПустаяСсылка()));
		Если мСтрокиОбщийШаблон.Количество() > 0 Тогда
			СтрокаОбщегоШаблона = мСтрокиОбщийШаблон[0];	
		КонецЕсли;
		
		мСтрокиОбщийШаблонЗамены =  ВариантСверткиНоменклатуры.ТаблицаЗамены.НайтиСтроки(Новый Структура("ЗаменяемаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка()));
		Если мСтрокиОбщийШаблонЗамены.Количество() > 0 Тогда
			СтрокаОбщегоШаблонаЗамены = мСтрокиОбщийШаблонЗамены[0];	
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаУслуг из ТаблицаУслуг Цикл
		Если ЗначениеЗаполнено(ВариантСверткиНоменклатуры) Тогда
			//Замена
			мСтроки =  ВариантСверткиНоменклатуры.ТаблицаЗамены.НайтиСтроки(Новый Структура("ЗаменяемаяНоменклатура", СтрокаУслуг.Номенклатура));
			Если мСтроки.Количество() > 0 Тогда
				СтрокаЗамены = мСтроки[0];
			Иначе
				СтрокаЗамены = СтрокаОбщегоШаблонаЗамены;
			КонецЕсли;
			
			Если СтрокаЗамены <> Неопределено Тогда
				СтрокаУслуг.Номенклатура = СтрокаЗамены.Номенклатура;
				
				ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
				
				ПараметрыШаблона.Номенклатура 			= СтрокаУслуг.Номенклатура;
				ПараметрыШаблона.Объект 				= СсылкаНаОбъект;
				ПараметрыШаблона.Дата 					= СсылкаНаОбъект.Дата;
				ПараметрыШаблона.Договор 				= СсылкаНаОбъект.Договор;
				ПараметрыШаблона.ВидДоговора 			= СсылкаНаОбъект.Договор.ВидДоговора;
				ПараметрыШаблона.ПриложениеКДоговору 	= СсылкаНаОбъект.ПриложениеКДоговору;
				
				CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(СтрокаУслуг, ПараметрыШаблона); 
				
			КонецЕсли;

			//Шаблон Сверки
			мСтроки =  ВариантСверткиНоменклатуры.НоменклатураСвертки.НайтиСтроки(Новый Структура("Номенклатура", СтрокаУслуг.Номенклатура));
			Если мСтроки.Количество() > 0 Тогда
				СтрокаШаблона = мСтроки[0];
			Иначе
				СтрокаШаблона = СтрокаОбщегоШаблона;
			КонецЕсли;
			
			Если СтрокаШаблона <> Неопределено Тогда
				СтрокаУслуг.ИдентификаторСтрокиСвертки = СтрокаШаблона.ИдентификаторСтрокиСвертки;
				Если СтрокаШаблона.РежимСверткиСтроки = 1 Тогда
					СтрокаУслуг.НомерСтрокиУслуг = ТаблицаУслуг.Индекс(СтрокаУслуг)+1;
				КонецЕсли;
			Иначе
				СтрокаУслуг.НомерСтрокиУслуг = ТаблицаУслуг.Индекс(СтрокаУслуг)+1;
			КонецЕсли;
			
		Иначе
			СтрокаУслуг.ИдентификаторСтрокиСвертки = Неопределено
		КонецЕсли;
		
		СтрокаУслуг.ПредставлениеГП = СокрЛП(СтрокаУслуг.Грузоперевозка.CW_Представление);
	КонецЦикла;		
	
	ТаблицаИдентификаторов = ТаблицаУслуг.Скопировать(,"ИдентификаторСтрокиСвертки");
	ТаблицаИдентификаторов.Свернуть("ИдентификаторСтрокиСвертки");
	мИдентифкаторы = ТаблицаИдентификаторов.ВыгрузитьКолонку("ИдентификаторСтрокиСвертки");
	//Подготовка данных
	
	
	//Шапка таблицы
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы|Начало");
	
	ЗаголовокиШапкиТаблицы = ПолучитьЗаголовокиШапкиТаблицы(ПолучитьАнглДанные, ПолучитьРусДанные);
	
	ОбластьШапкаТаблицы.Параметры.ЗаголовокНаименованияУслуг = ЗаголовокиШапкиТаблицы.Получить("ЗаголовокНаименования"); 	
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	мВыводимыеКолонки = Новый Массив;
	Если Не СтрокаОбщегоШаблона <> Неопределено Тогда
		//Нет общего шаблона
		ТабНоменклатура = ТаблицаУслуг.Скопировать();
		ТабНоменклатура.Свернуть("Номенклатура");
		Для Каждого СтрокаНом из ТабНоменклатура Цикл
			
			мНоменклатураСвертки = ВариантСверткиНоменклатуры.НоменклатураСвертки.НайтиСтроки(Новый Структура("Номенклатура", СтрокаНом.Номенклатура));
			Если мНоменклатураСвертки.Количество() > 0 Тогда
				ИдентификаторСтрокиСверткиШапка = мНоменклатураСвертки[0].ИдентификаторСтрокиСвертки;
				
				мШаблоныДополнительныхКолонока = ВариантСверткиНоменклатуры.ШаблоныДополнительныхКолонок.НайтиСтроки(Новый Структура("ИдентификаторСтрокиСвертки", ИдентификаторСтрокиСверткиШапка));
				Для Каждого СтрокаШблонаДополнительныхКолонок из мШаблоныДополнительныхКолонока Цикл
					Если ЗначениеЗаполнено(СтрокаШблонаДополнительныхКолонок.Шаблон) Тогда
						мВыводимыеКолонки.Добавить(СтрокаШблонаДополнительныхКолонок.ИдентификаторСтрокиНаименований);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВариантСверткиНоменклатуры) Тогда
		НаименованияДополнительныхКолонок = ВариантСверткиНоменклатуры.НаименованияДополнительныхКолонок;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВариантСверткиНоменклатуры) Тогда
		Для Каждого ДанныеКолонки из НаименованияДополнительныхКолонок Цикл
			
			Если мВыводимыеКолонки.Найти(ДанныеКолонки.ИдентификаторСтрокиНаименований) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			облДопКолонка = Макет.ПолучитьОбласть("ШапкаТаблицы|ДопКолонка");
			
			ЗаголовокДопКолонки = "";
			Если ПолучитьРусДанные Тогда
				ЗаголовокДопКолонки = ДанныеКолонки.НаименованиеКолонки;
			КонецЕсли;
			Если ПолучитьАнглДанные Тогда
				ЗаголовокДопКолонки = ЗаголовокДопКолонки + "|"+ДанныеКолонки.НаименованиеКолонкиАнгл;
			КонецЕсли;
			
			мЗаголовки = СтрРазделить(ЗаголовокДопКолонки,"|",Ложь);
			
			облДопКолонка.Параметры.ДопКолонка = СтрСоединить(мЗаголовки," / "+Символы.ПС);
			
			облДопКолонка.ТекущаяОбласть.ШиринаКолонки  			= ДанныеКолонки.ШиринаКолонки;
			облДопКолонка.ТекущаяОбласть.ГоризонтальноеПоложение  	= ГоризонтальноеПоложение.Центр;
			
			ТабличныйДокумент.Присоединить(облДопКолонка);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьШапкаТаблицы_Конец = Макет.ПолучитьОбласть("ШапкаТаблицы|Конец");
	
	ОбластьШапкаТаблицы_Конец.Параметры.ЗаголовокЕдиниц     = ЗаголовокиШапкиТаблицы.Получить("ЗаголовокЕдиниц"); 
	ОбластьШапкаТаблицы_Конец.Параметры.ЗаголвокКоличество  = ЗаголовокиШапкиТаблицы.Получить("ЗаголвокКоличество"); 
	ОбластьШапкаТаблицы_Конец.Параметры.ЗаголовокЦена       = ЗаголовокиШапкиТаблицы.Получить("ЗаголовокЦена"); 
	ОбластьШапкаТаблицы_Конец.Параметры.ЗаголовокСумма      = ЗаголовокиШапкиТаблицы.Получить("ЗаголовокСумма"); 
	ОбластьШапкаТаблицы_Конец.Параметры.ЗаголовокСтавкаНДС  = ЗаголовокиШапкиТаблицы.Получить("ЗаголовокСтавкаНДС"); 
	ОбластьШапкаТаблицы_Конец.Параметры.ЗаголовокНДС        = ЗаголовокиШапкиТаблицы.Получить("ЗаголовокНДС"); 
	ОбластьШапкаТаблицы_Конец.Параметры.ЗаголовокВсего	    = ЗаголовокиШапкиТаблицы.Получить("ЗаголовокВсего"); 													
	
	ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицы_Конец);
	//Шапка таблицы

	
	//Вывод строк таблицы
	НомерПП = 1;
	РасчитыватьЦенуПослеСвертки 	= Ложь;
	СворачиватьПоДокументуРасходов 	= Ложь;
	Для Каждого ИдентификаторСтроки из мИдентифкаторы Цикл
		
		облСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы|Начало");
		
		Отбор = Новый Структура("ИдентификаторСтрокиСвертки", ИдентификаторСтроки);
		
		//Подсистема.СверткаТабличныхЧастей
		СтрокаДополнительныхПолей= СоответствиеДополнительныхПолей.Получить(ИдентификаторСтроки);
		СтрокаДополнительныхПолей = ?(СтрокаДополнительныхПолей = Неопределено, "", СтрокаДополнительныхПолей);
		//Подсистема.СверткаТабличныхЧастей

		СтрокаШаблона = Неопределено;
		
		Если ЗначениеЗаполнено(ВариантСверткиНоменклатуры) Тогда
			мСтрокиШаблона =  ВариантСверткиНоменклатуры.НоменклатураСвертки.НайтиСтроки(Отбор);
			Если мСтрокиШаблона.Количество() > 0 Тогда
				СтрокаШаблона = мСтрокиШаблона[0];	
				РасчитыватьЦенуПослеСвертки 	= СтрокаШаблона.РасчитыватьЦенуПослеСвертки;
				СворачиватьПоДокументуРасходов 	= СтрокаШаблона.СворачиватьПоДокументуРасходов;
			КонецЕсли;
		КонецЕсли;
		
		ТаблицаПоНоменклатуре = ТаблицаУслуг.Скопировать(Отбор); 
		
		СтрокаСвертки = "НомерСтрокиУслуг,Номенклатура,СтавкаНДС";
		Если НЕ РасчитыватьЦенуПослеСвертки Тогда 
			СтрокаСвертки = СтрокаСвертки + ",Цена";
		КонецЕсли;
		Если СворачиватьПоДокументуРасходов Тогда 
			СтрокаСвертки = СтрокаСвертки + ",ДокументРасходов";
		КонецЕсли;
		
		//Подсистема.СверткаТабличныхЧастей
		СтрокаСвертки = СтрокаСвертки + ?(ПустаяСтрока(СтрокаДополнительныхПолей),"",","+СтрокаДополнительныхПолей);
		//Подсистема.СверткаТабличныхЧастей
		
		ТаблицаГруппировки = ТаблицаПоНоменклатуре.Скопировать(, СтрокаСвертки);
		ТаблицаГруппировки.Свернуть(СтрокаСвертки);
		
		Для Каждого СтрокаГруппировки из ТаблицаГруппировки Цикл
			
			Отбор  = Новый Структура(СтрокаСвертки);
			
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаГруппировки);
			ТаблицаРасчетаСумм = ТаблицаПоНоменклатуре.Скопировать(Отбор);
			
			мСтрокиУслуг = ТаблицаУслуг.Найтистроки(Отбор);
			Если мСтрокиУслуг.Количество() > 0 Тогда
				НайденнаяСтрока = мСтрокиУслуг[0];
				ПредставлениеУслуги = НайденнаяСтрока.Представление;
			КонецЕсли;
			
			Если СтрокаШаблона <> Неопределено Тогда
				Если ПараметрыДоговора.ЯзыкПечатиДокументов = 0 Тогда
					Если ЗначениеЗаполнено(СтрокаШаблона.Шаблон) Тогда
						ПредставлениеУслуги = CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблона.Шаблон,Ссылка, ,ТаблицаРасчетаСумм);
					КонецЕсли;
				ИначеЕсли  ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
					Если ЗначениеЗаполнено(СтрокаШаблона.ШаблонАнглийский) Тогда
						ПредставлениеУслуги = CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблона.ШаблонАнглийский,Ссылка, , ТаблицаРасчетаСумм);
					КонецЕсли;
				ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
					Если ЗначениеЗаполнено(СтрокаШаблона.Шаблон) Тогда
						ТекстНаРусском 		= CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблона.Шаблон,Ссылка, 				, ТаблицаРасчетаСумм);
					КонецЕсли;
					Если ЗначениеЗаполнено(СтрокаШаблона.ШаблонАнглийский) Тогда
						ТекстНаАнглийском 	= CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблона.ШаблонАнглийский,Ссылка, 	, ТаблицаРасчетаСумм);
					КонецЕсли;
					
					мТексты = Новый Массив;
					Если Не ПустаяСтрока(ТекстНаРусском) Тогда
						мТексты.Добавить(ТекстНаРусском);
					КонецЕсли;
					Если Не ПустаяСтрока(ТекстНаАнглийском) Тогда
						мТексты.Добавить(ТекстНаАнглийском);
					КонецЕсли;
					
					ПредставлениеУслуги = СтрСоединить(мТексты," / ");
					
				КонецЕсли; 
			КонецЕсли;
			
			облСтрокаТаблицы.Параметры.Наименование = ПредставлениеУслуги;
			облСтрокаТаблицы.Параметры.Номер = НомерПП;
			
			ТабличныйДокумент.Вывести(облСтрокаТаблицы);
			НомерПП = НомерПП + 1;
			
			Если ЗначениеЗаполнено(ВариантСверткиНоменклатуры) Тогда
				Для Каждого ДанныеКолонки из НаименованияДополнительныхКолонок Цикл
					
					Если мВыводимыеКолонки.Найти(ДанныеКолонки.ИдентификаторСтрокиНаименований) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					Отбор = Новый Структура("ИдентификаторСтрокиСвертки,ИдентификаторСтрокиНаименований",ИдентификаторСтроки, ДанныеКолонки.ИдентификаторСтрокиНаименований);
					мСтрокиШаблонаДоп =  ВариантСверткиНоменклатуры.ШаблоныДополнительныхКолонок.НайтиСтроки(Отбор);
					Если мСтрокиШаблонаДоп.Количество() > 0 Тогда
						СтрокаШаблонаДоп = мСтрокиШаблонаДоп[0];	
					КонецЕсли;

					Если СтрокаШаблонаДоп <> Неопределено Тогда
						Если ПараметрыДоговора.ЯзыкПечатиДокументов = 0 Тогда
							ЗначениеДопКолонки = CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблонаДоп.Шаблон, Ссылка, ,ТаблицаРасчетаСумм);
						ИначеЕсли  ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
							ЗначениеДопКолонки = CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблонаДоп.ШаблонАнглийский, Ссылка, ,ТаблицаРасчетаСумм);
						ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
							ТекстР = CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблонаДоп.Шаблон, Ссылка, ,ТаблицаРасчетаСумм);
							ТекстА = CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблонаДоп.ШаблонАнглийский, Ссылка, ,ТаблицаРасчетаСумм);
							Если (СокрЛП(ТекстР) <> "") Тогда
								ЗначениеДопКолонки = ТекстР;
								Если (СокрЛП(ТекстА) <> "") Тогда
									_сф.стр_Добавить(ЗначениеДопКолонки, " / ");
								КонецЕсли; 
							КонецЕсли; 
							_сф.стр_Добавить(ЗначениеДопКолонки, ТекстА);
						КонецЕсли; 
					КонецЕсли;
					
					мЗначениеДопКолонки = СтрРазделить(ЗначениеДопКолонки,",", Ложь);
					
					облДопКолонка = Макет.ПолучитьОбласть("СтрокаТаблицы|ДопКолонка");
					облДопКолонка.Параметры.ЗначениеДопКолонки 	= СтрСоединить(мЗначениеДопКолонки,",");
					
					облДопКолонка.ТекущаяОбласть.ШиринаКолонки  		= ДанныеКолонки.ШиринаКолонки;
					облДопКолонка.ТекущаяОбласть.ГоризонтальноеПоложение  	= СоответствиеГоризонтальногоПоложения.Получить(ДанныеКолонки.ГоризонтальноеПоложение);
					
					ТабличныйДокумент.Присоединить(облДопКолонка);
					
				КонецЦикла;
			КонецЕсли; 
		
			облСтрокаТаблицыКонец = Макет.ПолучитьОбласть("СтрокаТаблицы|Конец");
			
			НоменклатураСтроки 	= СтрокаГруппировки.Номенклатура;
			ЕдиницаИзмерения 	= НоменклатураСтроки.ЕдиницаИзмерения;  
			
			Если СокрЛП(НоменклатураСтроки.ЕдиницаИзмерения.Наименование) = "-" Тогда
				облСтрокаТаблицыКонец.Параметры.Единица 	= "-";
				облСтрокаТаблицыКонец.Параметры.Количество 	= "-";
				облСтрокаТаблицыКонец.Параметры.Цена 		= "-";  
				
				облСтрокаТаблицыКонец.Параметры.Сумма 		= ТаблицаРасчетаСумм.Итог("Сумма");
				облСтрокаТаблицыКонец.Параметры.СуммаНДС	= ТаблицаРасчетаСумм.Итог("НДС");
				облСтрокаТаблицыКонец.Параметры.Итого		= ТаблицаРасчетаСумм.Итог("Всего");
				облСтрокаТаблицыКонец.Параметры.ставкаНДС	= СтрокаГруппировки.ставкаНДС;
				
			Иначе	
				
				Сумма = ТаблицаРасчетаСумм.Итог("Сумма");
				
				языки = Новый Массив;
				языки.Добавить(Справочники.CW_Языки.ru);
				языки.Добавить(Справочники.CW_Языки.en);
				
				ПереводЕдиницИзмерения = CW_ПереводыСервер.ПолучитьПереводы(ЕдиницаИзмерения, ,);
				
				
				Если ПараметрыДоговора.ЯзыкПечатиДокументов = 0 Тогда
					ЕдиницаИзмеренияПеревод =  ПереводЕдиницИзмерения.Получить(Справочники.CW_Языки.ru);
				ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
					ЕдиницаИзмеренияПеревод =  ПереводЕдиницИзмерения.Получить(Справочники.CW_Языки.en);
				ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
					ЕдиницаИзмеренияПеревод = ПереводЕдиницИзмерения.Получить(Справочники.CW_Языки.en) + "/" + ПереводЕдиницИзмерения.Получить(Справочники.CW_Языки.ru);
				КонецЕсли; 
				облСтрокаТаблицыКонец.Параметры.Единица 	= ЕдиницаИзмеренияПеревод;
				
				Если СтрокаШаблона <> Неопределено Тогда
					Если СтрокаШаблона.СуммированиеКоличества = Перечисления.CW_ВариантыСуммированияКоличества.Равно1 Тогда
						УслугиКоличество = 1;
					КонецЕсли; 
					Если СтрокаШаблона.СуммированиеКоличества = Перечисления.CW_ВариантыСуммированияКоличества.Суммировать Тогда
						УслугиКоличество = ТаблицаРасчетаСумм.Итог("Количество");
					КонецЕсли; 
					Если СтрокаШаблона.СуммированиеКоличества = Перечисления.CW_ВариантыСуммированияКоличества.КоличествоГП Тогда
						ТаблицаГрузоперевозок = ТаблицаРасчетаСумм.Скопировать(,"ПредставлениеГП");
						ТаблицаГрузоперевозок.Свернуть("ПредставлениеГП");
						УслугиКоличество = ТаблицаГрузоперевозок.Количество();
					КонецЕсли; 
					
					Если РасчитыватьЦенуПослеСвертки Тогда
						ЦенаПоСтроке = _сф.БезопасноРазделить(Сумма , УслугиКоличество);
					Иначе
						ЦенаПоСтроке = СтрокаГруппировки.Цена;
					КонецЕсли; 
				Иначе
					Отбор = Новый Структура("ИдентификаторСтрокиСвертки", ИдентификаторСтроки);
					мСтрокиУслуг = ТаблицаУслуг.Найтистроки(Отбор);
					Если мСтрокиУслуг.Количество() > 0 Тогда
						НайденнаяСтрока 	= мСтрокиУслуг[0];
						УслугиКоличество 	= НайденнаяСтрока.Количество;
						ЦенаПоСтроке 		= НайденнаяСтрока.Цена;
					КонецЕсли;
				КонецЕсли; 
				
				облСтрокаТаблицыКонец.Параметры.Цена 		= ЦенаПоСтроке;
				облСтрокаТаблицыКонец.Параметры.Количество 	= УслугиКоличество;  
				
				облСтрокаТаблицыКонец.Параметры.Сумма 		= Сумма;
				облСтрокаТаблицыКонец.Параметры.СуммаНДС	= ТаблицаРасчетаСумм.Итог("НДС");
				облСтрокаТаблицыКонец.Параметры.Итого		= ТаблицаРасчетаСумм.Итог("Всего");
				облСтрокаТаблицыКонец.Параметры.ставкаНДС	= СтрокаГруппировки.ставкаНДС;
				
			КонецЕсли;	
			
			ТабличныйДокумент.Присоединить(облСтрокаТаблицыКонец);
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Подвал таблицы
	НадписьИТОГО_рус = ""; 
	НадписьИТОГО_Англ = ""; 
	
	Если ПолучитьРусДанные и ПолучитьАнглДанные Тогда
		НадписьИТОГО_рус = "ИТОГО/TOTAL:";	
	Иначе
		Если ПолучитьРусДанные Тогда
			НадписьИТОГО_рус 	= "ИТОГО:";
		КонецЕсли;

		Если ПолучитьАнглДанные Тогда
			НадписьИТОГО_Англ 	= "TOTAL:";
		КонецЕсли;
	КонецЕсли;

	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы|Начало");
	ОбластьПодвалТаблицы.Параметры.НадписьИТОГО = НадписьИТОГО_рус +?(ПустаяСтрока(НадписьИТОГО_Англ),"",НадписьИТОГО_Англ);
	ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
	
	Если ЗначениеЗаполнено(ВариантСверткиНоменклатуры) Тогда
		Для Каждого ДанныеКолонки из НаименованияДополнительныхКолонок Цикл
			
			Если мВыводимыеКолонки.Найти(ДанныеКолонки.ИдентификаторСтрокиНаименований) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			облДопКолонка = Макет.ПолучитьОбласть("ПодвалТаблицы|ДопКолонка");
			облДопКолонка.ТекущаяОбласть.ШиринаКолонки = ДанныеКолонки.ШиринаКолонки;
			
			ТабличныйДокумент.Присоединить(облДопКолонка);
		КонецЦикла;
	КонецЕсли;
	
	облПодвалТаблицыКонец = Макет.ПолучитьОбласть("ПодвалТаблицы|Конец");
	облПодвалТаблицыКонец.Параметры.Сумма 		= ТаблицаУслуг.Итог("Сумма");
	облПодвалТаблицыКонец.Параметры.СуммаНДС 	= ТаблицаУслуг.Итог("НДС");
	облПодвалТаблицыКонец.Параметры.СуммаИТОГО 	= ТаблицаУслуг.Итог("Всего");
	
	ТабличныйДокумент.Присоединить(облПодвалТаблицыКонец);
	
	ТабличныйДокумент.Вывести(ОбластьОтсутп);
	//Подвал таблицы
	
	
	//----------------------
	// дополнительно
	Если ПараметрыДоговора.ВыводитьДополнениеВПодавлеРасчета Тогда
		Если ПолучитьРусДанные Тогда
			ОбластьДополнительно_рус = Макет.ПолучитьОбласть("Дополнительно_Рус");
			ОбластьДополнительно_рус.Параметры.ДополнительноРус = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеПодвалаРасчетаРус, Ссылка, Неопределено, Ссылка.Услуги);
			
			ТабличныйДокумент.Вывести(ОбластьДополнительно_рус);
		КонецЕсли;
	КонецЕсли;	    
	
	Если ПараметрыДоговора.ВыводитьДополнениеВПодавлеРасчета Тогда
		Если ПолучитьАнглДанные Тогда
			ОбластьДополнительно_англ = Макет.ПолучитьОбласть("Дополнительно_Англ");
			ОбластьДополнительно_англ.Параметры.ДополнительноАнгл = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеПодвалаРасчетаАнгл, Ссылка, Неопределено, Ссылка.Услуги);
			
			ТабличныйДокумент.Вывести(ОбластьДополнительно_англ);
		КонецЕсли;
	КонецЕсли;	
	// дополнительно

	
	// Получим структуру с данными по подписантам
	Подписанты = CW_Печать.ВернутьПодписантов(Ссылка, ПараметрыДоговора);
	
	ВыводитьПодписиИПечать = Ложь;
	
	Если ПараметрыДоговора.ВыводитьПодписьИПечатьРасчетКАкту Тогда
		
		ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
		
		// подписи, печать
		ВыводитьПодписиИПечать = НастройкиПечати.ПодписьИПечать ИЛИ НастройкиПечати.ДляРассылки;
		Если ВыводитьПодписиИПечать Тогда  
			ПечатьОрганизации  	= CW_Печать.ПолучитьПечатьОрганизации(Ссылка.Организация, НастройкиПечати.ПодключаемыйОбъект, Ссылка.ДатаАкта, Ложь);
			ПодписьРуководителя	= CW_Печать.ПолучитьПодписьСотрудника(Подписанты.Руководитель, Ложь);
		КонецЕсли;	
		
		ОбластьПодписи.Рисунки.ПечатьОрганизации.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		ОбластьПодписи.Рисунки.ПечатьОрганизации.ВыводитьНаПечать 	= Ложь;
		Если ВыводитьПодписиИПечать и ПечатьОрганизации <> Неопределено Тогда
			ОбластьПодписи.Рисунки.ПечатьОрганизации.ВыводитьНаПечать 	= Истина;
			ОбластьПодписи.Рисунки.ПечатьОрганизации.Картинка 			= Новый Картинка(ПечатьОрганизации);
		КонецЕсли;
		
		ОбластьПодписи.Рисунки.ПодписьРуководителя.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		ОбластьПодписи.Рисунки.ПодписьРуководителя.ВыводитьНаПечать 	= Ложь;
		Если ВыводитьПодписиИПечать и ПодписьРуководителя <> Неопределено Тогда
			ОбластьПодписи.Рисунки.ПодписьРуководителя.ВыводитьНаПечать 	= Истина;
			ОбластьПодписи.Рисунки.ПодписьРуководителя.Картинка 			= Новый Картинка(ПодписьРуководителя);
		КонецЕсли;
		//---подписи, печать
		
		Если ПолучитьРусДанные и ПолучитьАнглДанные Тогда
			ОбластьПодписи.Параметры.Исполнитель 			= "Исполнитель / Contractor";
			ОбластьПодписи.Параметры.Заказчик 				= "Заказчик / Customer";
			ОбластьПодписи.Параметры.ДолжностьИсполнителя 	= СокрЛП(Подписанты.РуководительДолжностьРус) + Символы.ПС + СокрЛП(Подписанты.РуководительДолжностьАнг);
			
			ОбластьПодписи.Параметры.ФИОИсполнителя 		= CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,Ссылка.Дата) 
			+ ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", "")
			+ Символы.ПС+ CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Подписанты.Руководитель)) 
			+ ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеАнг), " (" + Подписанты.РуководительОснованиеАнг + ")", "");
			
			ОбластьПодписи.Параметры.ДолжностьЗаказчика 	= ПараметрыДоговора.ДолжностьРуководителя+Символы.ПС+ПараметрыДоговора.ДолжностьРуководителяАнгл;
			
			ОбластьПодписи.Параметры.ФИОЗаказчика 			= CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.Руководитель,Ссылка.Дата) 
			+ ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснование), " (" + ПараметрыДоговора.РуководительКонтрагентаОснование + ")", "") 
			+ Символы.ПС+ CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.РуководительАнгл) + ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл), " (" + ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл + ")", "");;  
			
			ОбластьПодписи.Параметры.НадписьМП = "М.П."+Символы.ПС+"SEAL";
		Иначе
			Если ПолучитьРусДанные Тогда
				ОбластьПодписи.Параметры.Исполнитель 			= "Исполнитель";
				ОбластьПодписи.Параметры.Заказчик 				= "Заказчик";    
				ОбластьПодписи.Параметры.ДолжностьИсполнителя 	= Подписанты.РуководительДолжностьРус; 
				ОбластьПодписи.Параметры.ФИОИсполнителя 		= CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,Ссылка.Дата) + ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", "");
				ОбластьПодписи.Параметры.ДолжностьЗаказчика 	= ПараметрыДоговора.ДолжностьРуководителя;
				ОбластьПодписи.Параметры.ФИОЗаказчика 			= CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.Руководитель,Ссылка.Дата) + ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснование), " (" + ПараметрыДоговора.РуководительКонтрагентаОснование + ")", ""); 
				ОбластьПодписи.Параметры.НадписьМП 				= "М.П.";
			КонецЕсли;
			
			Если ПолучитьАнглДанные Тогда
				ОбластьПодписи.Параметры.Исполнитель 			= "Contractor";
				ОбластьПодписи.Параметры.Заказчик 				= "Customer";
				ОбластьПодписи.Параметры.ДолжностьИсполнителя 	= Подписанты.РуководительДолжностьАнг;
				ОбластьПодписи.Параметры.ФИОИсполнителя 		= CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Подписанты.Руководитель))
				
				+ ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеАнг), " (" + Подписанты.РуководительОснованиеАнг + ")", "");
				
				ОбластьПодписи.Параметры.ДолжностьЗаказчика 	= ПараметрыДоговора.ДолжностьРуководителяАнгл;
				
				ОбластьПодписи.Параметры.ФИОЗаказчика 			= CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.РуководительАнгл) 
				+ ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл), " (" + ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл + ")", "");
				
				ОбластьПодписи.Параметры.НадписьМП 				= "SEAL";
			КонецЕсли;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
	КонецЕсли;
	// подписи, печать

	//исполнитель документа
	Если Не Ссылка.Ответственный.Пустая() и ПараметрыДоговора.ВыводитьИсполнителяРасчетКАкту Тогда
		
		Если НЕ ВыводитьПодписиИПечать Тогда
			ОбластьРазделитель2 = Макет.ПолучитьОбласть("Разделитель");
			ТабличныйДокумент.Вывести(ОбластьРазделитель2);
			ТабличныйДокумент.Вывести(ОбластьРазделитель2);
		КонецЕсли;
		
		ТелефонИсполнителя 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Ответственный, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПользователя"),,Истина);		
		ИсполнительФизическоеЛицо 	= Ссылка.Ответственный.ФизическоеЛицо;
		
		Если ПолучитьРусДанные Тогда
			Если ИсполнительФизическоеЛицо.Пустая() Тогда
				Исполнитель_рус = "";
			Иначе
				Исполнитель_рус = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ИсполнительФизическоеЛицо);
			КонецЕсли;
			
			ОбластьИсполнитель_Рус = Макет.ПолучитьОбласть("Исполнитель_Рус");
			ОбластьИсполнитель_Рус.Параметры.Исполнитель 		= "Исп."+ Исполнитель_рус;
			ОбластьИсполнитель_Рус.Параметры.ТелефонИсполнителя = "Тел."+ ТелефонИсполнителя;
			
			ТабличныйДокумент.Вывести(ОбластьИсполнитель_Рус);
		КонецЕсли;
		
		Если ПолучитьАнглДанные Тогда
			Если ИсполнительФизическоеЛицо.Пустая() Тогда
				ИсполнительАнгл = "";
			Иначе
				ИсполнительАнгл =  CW_ПереводыСервер.ПолучитьПеревод(ИсполнительФизическоеЛицо, , Справочники.CW_Языки.en);
				
				ЧастиИмени 			= ФизическиеЛицаКлиентСервер.ЧастиИмени(ИсполнительАнгл);
				Исполнитель_Англ	= ЧастиИмени.Фамилия  + " " + ЧастиИмени.Имя;
			КонецЕсли;
			
			ОбластьИсполнитель_Англ = Макет.ПолучитьОбласть("Исполнитель_Англ");
			ОбластьИсполнитель_Англ.Параметры.Исполнитель_Англ 		  = "Exe." + Исполнитель_Англ;
			ОбластьИсполнитель_Англ.Параметры.ТелефонИсполнителя_Англ = "Tel." + ТелефонИсполнителя;	
			
			ТабличныйДокумент.Вывести(ОбластьИсполнитель_Англ);
		КонецЕсли;
		
	
	КонецЕсли;
	//исполнитель документа

	РезультатПечати.ПечатнаяФорма = ТабличныйДокумент;
	
	Возврат РезультатПечати;
	
КонецФункции

Функция ПолучитьЗаголовокиШапкиТаблицы(Знач ПолучитьАнглДанные, Знач ПолучитьРусДанные)
	
	Валюта = ?(СсылкаНаОбъект.Договор.ВзаиморасчетыВУЕ, CW_Настройки.ВалютаРегламентированногоУчета(), СсылкаНаОбъект.Валюта);
	ПредставлениеВалюты = CW_Настройки_ПИ.ПредставлениеВалютыНаРусском(Валюта);

	Разделитель = " / "+Символы.ПС; 
	
	Если ПолучитьРусДанные Тогда
		ЗаголовокНаименования 		= "Наименование работ,"+ Символы.ПС+"услуг"; 
		ЗаголовокЕдиниц 			= "Ед.";
		ЗаголвокКоличество 			= "Кол- во";
		ЗаголовокЦена     			= "Цена, "	+ Строка(ПредставлениеВалюты);
		ЗаголовокСумма              = "Сумма, "	+ Строка(ПредставлениеВалюты);
		ЗаголовокСтавкаНДС          = "Ставка НДС";
		ЗаголовокНДС                = "НДС, "	+ Строка(ПредставлениеВалюты);
		ЗаголовокВсего				= "Всего, "	+ Строка(ПредставлениеВалюты);										
	КонецЕсли;
	
	Если ПолучитьАнглДанные Тогда
		ЗаголовокНаименования 		= Строка(ЗаголовокНаименования) + "|"+"Description of work,"+ Символы.ПС+"service"; 
		ЗаголовокЕдиниц  			= Строка(ЗаголовокЕдиниц) 		+ "|"+ "Unit";
		ЗаголвокКоличество          = Строка(ЗаголвокКоличество) 	+ "|"+ "Q-ty";
		ЗаголовокЦена               = Строка(ЗаголовокЦена) 		+ "|"+ "Value, "+ Строка(Валюта);
		ЗаголовокСумма              = Строка(ЗаголовокСумма) 		+ "|"+ "Sum, "	+ Строка(Валюта);
		ЗаголовокСтавкаНДС          = Строка(ЗаголовокСтавкаНДС) 	+ "|"+ "VAT rate";
		ЗаголовокНДС                = Строка(ЗаголовокНДС) 			+ "|"+ "VAT amount, "		+ Строка(Валюта);
		ЗаголовокВсего				= Строка(ЗаголовокВсего) 		+ "|"+ "Total with VAT, "	+ Строка(Валюта);									
	КонецЕсли;
	
	мЗаголовокНаименования 	= СтрРазделить(ЗаголовокНаименования,"|",Ложь);
	мЗаголовокЕдиниц 		= СтрРазделить(ЗаголовокЕдиниц,"|",Ложь);
	мЗаголвокКоличество 	= СтрРазделить(ЗаголвокКоличество,"|",Ложь);
	мЗаголовокЦена 			= СтрРазделить(ЗаголовокЦена,"|",Ложь);
	мЗаголовокСумма	 		= СтрРазделить(ЗаголовокСумма,"|",Ложь);
	мЗаголовокСтавкаНДС 	= СтрРазделить(ЗаголовокСтавкаНДС,"|",Ложь);
	мЗаголовокНДС 			= СтрРазделить(ЗаголовокНДС,"|",Ложь);
	мЗаголовокВсего 		= СтрРазделить(ЗаголовокВсего,"|",Ложь);
	
	Результат = Новый Соответствие;
	Результат.Вставить("ЗаголовокНаименования", СтрСоединить(мЗаголовокНаименования, Разделитель));
	Результат.Вставить("ЗаголовокЕдиниц", 		СтрСоединить(мЗаголовокЕдиниц, Разделитель));
	Результат.Вставить("ЗаголвокКоличество", 	СтрСоединить(мЗаголвокКоличество, Разделитель));
	Результат.Вставить("ЗаголовокЦена", 		СтрСоединить(мЗаголовокЦена, Разделитель));
	Результат.Вставить("ЗаголовокСумма", 		СтрСоединить(мЗаголовокСумма, Разделитель));
	Результат.Вставить("ЗаголовокСтавкаНДС", 	СтрСоединить(мЗаголовокСтавкаНДС, Разделитель));
	Результат.Вставить("ЗаголовокНДС", 			СтрСоединить(мЗаголовокНДС, Разделитель));
	Результат.Вставить("ЗаголовокВсего", 		СтрСоединить(мЗаголовокВсего, Разделитель));
	
	Возврат Результат;

КонецФункции // Печать

Функция ПолучитьСоответствиеГоризонтальногоПоложения()
	
	Результат = Новый Соответствие;
	Результат.Вставить("Авто", 		ГоризонтальноеПоложение.Авто);
	Результат.Вставить("Лево", 		ГоризонтальноеПоложение.Лево);
	Результат.Вставить("ПоШирине", 	ГоризонтальноеПоложение.ПоШирине);
	Результат.Вставить("Право",		ГоризонтальноеПоложение.Право);
	Результат.Вставить("Центр", 	ГоризонтальноеПоложение.Центр);
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли