
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Объект", ПодключаемыйОбъект);
	
	ИспользоватьСтатьиДвиженияДенежныхСредств = ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиДвиженияДенежныхСредств");
	ИспользоватьСтатьиДвиженияДенежныхСредствСтарое	= ИспользоватьСтатьиДвиженияДенежныхСредств;
	
	Если  ЗначениеЗаполнено(ПодключаемыйОбъект) Тогда 
		
		ИмяНастроек = "Настойки_CW_ОперацииМСФО";
		Настройки 	= Обработки.CW_ОперацииМСФО.ПолучитьНастройки(ИмяНастроек);
		
		Если Настройки <> Неопределено Тогда
			Настройки.Свойство("ДатаНачалаВеденияУчетаМСФО"	, ДатаНачалаВеденияУчетаМСФО);

			//Расходы по ГП
			Настройки.Свойство("СчетУчетаПоставщиков"		, СчетУчетаПоставщиков);
			Настройки.Свойство("СчетАвансовПоставщиков"		, СчетАвансовПоставщиков);
			Настройки.Свойство("СчетУчетаЗатрат"			, СчетУчетаЗатрат);
			
			//Доходы по ГП
			Настройки.Свойство("СчетУчетаКлиентов"		, СчетУчетаКлиентов);
			Настройки.Свойство("СчетАвансовКлиентов"	, СчетАвансовКлиентов);
			Настройки.Свойство("СчетУчетаДоходов"		, СчетУчетаДоходов);
			Настройки.Свойство("ФинРезульат"			, ФинРезульат);
			
			Настройки.Свойство("СчетУчетаРасходыПоКурсовымРазницам" , СчетУчетаРасходыПоКурсовымРазницам);
			Настройки.Свойство("СчетУчетаДоходыПоКурсовымРазницам"	, СчетУчетаДоходыПоКурсовымРазницам);
			
			Настройки.Свойство("СчетУчетаРасходыПоНереализованнымКурсовымРазницам" , СчетУчетаРасходыПоНереализованнымКурсовымРазницам);
			Настройки.Свойство("СчетУчетаДоходыПоНереализованнымКурсовымРазницам"	, СчетУчетаДоходыПоНереализованнымКурсовымРазницам);

			
			Настройки.Свойство("СчетУчетаКонвертации"	, СчетУчетаКонвертации);
			Настройки.Свойство("Субконто1"	, Субконто1);
			Настройки.Свойство("Субконто2"	, Субконто2);
			Настройки.Свойство("Субконто3"	, Субконто3);
			
			Если  ФинРезульат Тогда
				Настройки.Свойство("СчетУчетаФинРезультата"	, СчетУчетаФинРезультата);
			КонецЕсли;
			
			//Дополнительные аналитики
			Если ЗначениеЗаполнено(СчетУчетаДоходов) Тогда
				ВедетсяУчетПоДоходамИРасходам = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.НаСчетеВедетсяУчетПоДоходамИРасходам(СчетУчетаДоходов);
				Если ВедетсяУчетПоДоходамИРасходам Тогда
					Настройки.Свойство("СчетУчетаДоходовАналитика"	, СчетУчетаДоходовАналитика);
				КонецЕсли;
			КонецЕсли;
			
			//Курсовые
			//Реализованные
			Если ЗначениеЗаполнено(СчетУчетаРасходыПоКурсовымРазницам) Тогда
				ВедетсяУчетПоСтатьямЗатра = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.НаСчетеВедетсяУчетПоДоходамИРасходам(СчетУчетаРасходыПоКурсовымРазницам);
				Если ВедетсяУчетПоСтатьямЗатра Тогда
					Настройки.Свойство("СчетУчетаРасходыПоКурсовымРазницамАналитика"	, СчетУчетаРасходыПоКурсовымРазницамАналитика);
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(СчетУчетаДоходыПоКурсовымРазницам) Тогда
				ВедетсяУчетПоСтатьямЗатрат = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.НаСчетеВедетсяУчетПоДоходамИРасходам(СчетУчетаДоходыПоКурсовымРазницам);
				Если ВедетсяУчетПоСтатьямЗатрат Тогда
					Настройки.Свойство("СчетУчетаДоходыПоКурсовымРазницамАналитика"	, СчетУчетаДоходыПоКурсовымРазницамАналитика);
				КонецЕсли;
			КонецЕсли;
			//Нереализованные
			Если ЗначениеЗаполнено(СчетУчетаРасходыПоНереализованнымКурсовымРазницам) Тогда
				ВедетсяУчетПоСтатьямЗатра = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.НаСчетеВедетсяУчетПоДоходамИРасходам(СчетУчетаРасходыПоНереализованнымКурсовымРазницам);
				Если ВедетсяУчетПоСтатьямЗатра Тогда
					Настройки.Свойство("СчетУчетаРасходыПоНереализованнымКурсовымРазницамАналитика"	, СчетУчетаРасходыПоНереализованнымКурсовымРазницамАналитика);
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(СчетУчетаДоходыПоНереализованнымКурсовымРазницам) Тогда
				ВедетсяУчетПоСтатьямЗатрат = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.НаСчетеВедетсяУчетПоДоходамИРасходам(СчетУчетаДоходыПоНереализованнымКурсовымРазницам);
				Если ВедетсяУчетПоСтатьямЗатрат Тогда
					Настройки.Свойство("СчетУчетаДоходыПоНереализованнымКурсовымРазницамАналитика"	, СчетУчетаДоходыПоНереализованнымКурсовымРазницамАналитика);
				КонецЕсли;
			КонецЕсли;

			
			//НДС
			Настройки.Свойство("СчетУчетаНДС"			, СчетУчетаНДС);
			Настройки.Свойство("СчетУчетаНДССубконто1"	, СчетУчетаНДССубконто1);
			Настройки.Свойство("СчетУчетаНДССубконто2"	, СчетУчетаНДССубконто2);
			Настройки.Свойство("СчетУчетаНДССубконто3"	, СчетУчетаНДССубконто3);

			
			//Подотчтные лица
			Настройки.Свойство("СчетУчетаРасчетовСПодотчетнымиЛицами"	, СчетУчетаРасчетовСПодотчетнымиЛицами);
			Настройки.Свойство("СчетАвансовПодотчетныхЛиц"				, СчетАвансовПодотчетныхЛиц);

			//Административные затраты
			Настройки.Свойство("СчетУчетаАдминистративныхЗатрат"		, СчетУчетаАдминистративныхЗатрат);
			
		КонецЕсли;
	КонецЕсли; 
	
	ТипДокумента = "Группа_ОбщиеСчетаУчета";
	ТипДокументаПриИзмененииНаСервере();
	ФормироватьФинРезультатпоКаждойСделкеПриИзмененииНаСервере();
	
	СчетПриИзмененииНаСервере();
	СчетУчетаНДСПриИзмененииНаСервере();
	
	УстановитьВидимостьПредупреждения();
	
	ОбработатьИзменениеСчетаДоходовНаСервере("СчетУчетаДоходов");
	ОбработатьИзменениеСчетаДоходовНаСервере("СчетУчетаРасходыПоКурсовымРазницам");
	ОбработатьИзменениеСчетаДоходовНаСервере("СчетУчетаДоходыПоКурсовымРазницам");
	ОбработатьИзменениеСчетаДоходовНаСервере("СчетУчетаДоходыПоНереализованнымКурсовымРазницам");
	ОбработатьИзменениеСчетаДоходовНаСервере("СчетУчетаРасходыПоНереализованнымКурсовымРазницам");

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредупреждения()
	
	Элементы.ГруппаПредупреждение.Видимость = Не ЗначениеЗаполнено(ДатаНачалаВеденияУчетаМСФО);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ДатаНачалаВеденияУчетаМСФОПриИзменении(Элемент)
	
	УстановитьМодифицированностьФормы();
	УстановитьВидимостьПредупреждения();
	
КонецПроцедуры

#Область Управление_Сохраненными_Настройками

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Отказ = Ложь;
	СохранитьНастройки(Отказ);
	
	Если Не отказ Тогда
		Модифицированность = Ложь;
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Отказ = Ложь;
	СохранитьНастройки(Отказ);
	
	Если Не отказ Тогда
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки(Отказ)
	
	СтруктураНастройки = новый Структура;

	СтруктураНастройки.Вставить("ДатаНачалаВеденияУчетаМСФО", ДатаНачалаВеденияУчетаМСФО);

	//Расходы по ГП
	СтруктураНастройки.Вставить("СчетУчетаПоставщиков"		, СчетУчетаПоставщиков);
	СтруктураНастройки.Вставить("СчетАвансовПоставщиков"	, СчетАвансовПоставщиков);
	СтруктураНастройки.Вставить("СчетУчетаЗатрат"			, СчетУчетаЗатрат);
	
	//Доходы по ГП
	СтруктураНастройки.Вставить("СчетУчетаКлиентов"			, СчетУчетаКлиентов);
	СтруктураНастройки.Вставить("СчетАвансовКлиентов"		, СчетАвансовКлиентов);
	
	СтруктураНастройки.Вставить("СчетУчетаДоходов"			, СчетУчетаДоходов);
	ВедетсяУчетПоДоходамИРасходам = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.НаСчетеВедетсяУчетПоДоходамИРасходам(СчетУчетаДоходов);
	Если ВедетсяУчетПоДоходамИРасходам Тогда
		СтруктураНастройки.Вставить("СчетУчетаДоходовАналитика"	, СчетУчетаДоходовАналитика);
	КонецЕсли;
	
	СтруктураНастройки.Вставить("ФинРезульат"				, ФинРезульат);
	Если  ФинРезульат Тогда
		СтруктураНастройки.Вставить("СчетУчетаФинРезультата", СчетУчетаФинРезультата);
	КонецЕсли;
	
	
	//Курсовые разницы
	//Реализованные курсовые разницы
	СтруктураНастройки.Вставить("СчетУчетаРасходыПоКурсовымРазницам", СчетУчетаРасходыПоКурсовымРазницам);
	ВедетсяУчетПоСтатьямЗатрат = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.НаСчетеВедетсяУчетПоДоходамИРасходам(СчетУчетаРасходыПоКурсовымРазницам);
	Если ВедетсяУчетПоСтатьямЗатрат Тогда
		СтруктураНастройки.Вставить("СчетУчетаРасходыПоКурсовымРазницамАналитика", СчетУчетаРасходыПоКурсовымРазницамАналитика);
	КонецЕсли;
	
	СтруктураНастройки.Вставить("СчетУчетаДоходыПоКурсовымРазницам", СчетУчетаДоходыПоКурсовымРазницам);
	ВедетсяУчетПоСтатьямЗатрат = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.НаСчетеВедетсяУчетПоДоходамИРасходам(СчетУчетаДоходыПоКурсовымРазницам);
	Если ВедетсяУчетПоСтатьямЗатрат Тогда
		СтруктураНастройки.Вставить("СчетУчетаДоходыПоКурсовымРазницамАналитика", СчетУчетаДоходыПоКурсовымРазницамАналитика);
	КонецЕсли;

	//Нереализованные курсовые разницы
	
	СтруктураНастройки.Вставить("СчетУчетаРасходыПоНереализованнымКурсовымРазницам", СчетУчетаРасходыПоНереализованнымКурсовымРазницам);
	ВедетсяУчетПоСтатьямЗатрат = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.НаСчетеВедетсяУчетПоДоходамИРасходам(СчетУчетаРасходыПоНереализованнымКурсовымРазницам);
	Если ВедетсяУчетПоСтатьямЗатрат Тогда
		СтруктураНастройки.Вставить("СчетУчетаРасходыПоНереализованнымКурсовымРазницамАналитика", СчетУчетаРасходыПоНереализованнымКурсовымРазницамАналитика);
	КонецЕсли;
	
	СтруктураНастройки.Вставить("СчетУчетаДоходыПоНереализованнымКурсовымРазницам", СчетУчетаДоходыПоНереализованнымКурсовымРазницам);
	ВедетсяУчетПоСтатьямЗатрат = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.НаСчетеВедетсяУчетПоДоходамИРасходам(СчетУчетаДоходыПоНереализованнымКурсовымРазницам);
	Если ВедетсяУчетПоСтатьямЗатрат Тогда
		СтруктураНастройки.Вставить("СчетУчетаДоходыПоНереализованнымКурсовымРазницамАналитика", СчетУчетаДоходыПоНереализованнымКурсовымРазницамАналитика);
	КонецЕсли;

	
	СтруктураНастройки.Вставить("СчетУчетаКонвертации"	, СчетУчетаКонвертации);
	СтруктураНастройки.Вставить("Субконто1"				, Субконто1);
	СтруктураНастройки.Вставить("Субконто2"				, Субконто2);
	СтруктураНастройки.Вставить("Субконто3"				, Субконто3);
	
	Если ИспользоватьСтатьиДвиженияДенежныхСредствСтарое <> ИспользоватьСтатьиДвиженияДенежныхСредств Тогда
		Константы.ИспользоватьСтатьиДвиженияДенежныхСредств.Установить(ИспользоватьСтатьиДвиженияДенежныхСредств);
	КонецЕсли;
	
	
	//НДС
	СтруктураНастройки.Вставить("СчетУчетаНДС"			, СчетУчетаНДС);
	СтруктураНастройки.Вставить("СчетУчетаНДССубконто1"	, СчетУчетаНДССубконто1);
	СтруктураНастройки.Вставить("СчетУчетаНДССубконто2"	, СчетУчетаНДССубконто2);
	СтруктураНастройки.Вставить("СчетУчетаНДССубконто3"	, СчетУчетаНДССубконто3);
	
	//Подотчтные лица
	СтруктураНастройки.Вставить("СчетУчетаРасчетовСПодотчетнымиЛицами"	, СчетУчетаРасчетовСПодотчетнымиЛицами);
	СтруктураНастройки.Вставить("СчетАвансовПодотчетныхЛиц"				, СчетАвансовПодотчетныхЛиц);
	
	//Административные затарты
	СтруктураНастройки.Вставить("СчетУчетаАдминистративныхЗатрат"		, СчетУчетаАдминистративныхЗатрат);
	
	
	ИмяНастроек = "Настойки_CW_ОперацииМСФО";
	Обработки.CW_ОперацииМСФО.ЗаписатьНастройки(ИмяНастроек,СтруктураНастройки,Отказ);
	
КонецПроцедуры

#Конецобласти

&НаСервере
Процедура ТипДокументаПриИзмененииНаСервере()
	
	Элементы.ГруппаНастрокиСчетов.ТекущаяСтраница = Элементы[ТипДокумента];
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	ТипДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаДоходовПриИзменении(Элемент)
	УстановитьМодифицированностьФормы();
	ОбработатьИзменениеСчетаДоходовНаСервере("СчетУчетаДоходов");
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСчетаДоходовНаСервере(ИмяСчета)
	
	УчетПоДоходамИРасходам = CW_БухгалтерскийУчетВызовСервераПовтИспМСФО.НаСчетеВедетсяУчетПоДоходамИРасходам(ЭтаФорма[ИмяСчета]);
	Элементы[ИмяСчета+"Аналитика"].Видимость 	= УчетПоДоходамИРасходам;
	
КонецПроцедуры 

&НаСервере
Процедура ФормироватьФинРезультатпоКаждойСделкеПриИзмененииНаСервере()
	Элементы.СчетУчетаФинРезультата.Видимость = ФинРезульат;
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьФинРезультатпоКаждойСделкеПриИзменении(Элемент)
	УстановитьМодифицированностьФормы();
	ФормироватьФинРезультатпоКаждойСделкеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаРасходыПоКурсовымРазницамПриИзменении(Элемент)
	УстановитьМодифицированностьФормы();
	ОбработатьИзменениеСчетаДоходовНаСервере("СчетУчетаРасходыПоКурсовымРазницам");
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаДоходыПоКурсовымРазницамПриИзменении(Элемент)
	УстановитьМодифицированностьФормы();
	ОбработатьИзменениеСчетаДоходовНаСервере("СчетУчетаДоходыПоКурсовымРазницам");
КонецПроцедуры


&НаКлиенте
Процедура УстановитьМодифицированность(Элемент)
	УстановитьМодифицированностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМодифицированностьФормы()
	Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Отказ = истина;
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Данные в форме изменены. Продолжить закрытие формы без сохранения?", Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();

КонецПроцедуры 

&НаКлиенте
Процедура ВключитьВыключитьУчетПоСтатьямДДС(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущаяСтраница", "ГруппаБанкКасса");
	ОткрытьФорму("Обработка.ФункциональностьПрограммы.Форма.ФормаФункциональностьПрограммы",
		ПараметрыФормы, 
		ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСубконтоПоСчетамНаСервере()
	
	//настройка в стадии разработки
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСубконтоПоСчетам(Команда)
	
	ПоказатьПредупреждение(,"Возможность настройки отключена. Обратитесь к разработчику.");
	
//	ЗаполнитьСубконтоПоСчетамНаСервере();
КонецПроцедуры


#Область МСФО_Модуль

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	УстановитьМодифицированностьФормы();
	СчетПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаНДСПриИзменении(Элемент)
	УстановитьМодифицированностьФормы();
	СчетУчетаНДСПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СчетПриИзмененииНаСервере()
	
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоШапкиПриИзмененииСчета(
	ЭтотОбъект, ЭтотОбъект, ПараметрыУстановкиСвойствСубконто(ЭтотОбъект,  "Субконто", "Субконто", "Подразделение", "", "СчетУчетаКонвертации"));
	
КонецПроцедуры

&НаСервере
Процедура СчетУчетаНДСПриИзмененииНаСервере()
	
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоШапкиПриИзмененииСчета(
	ЭтотОбъект, ЭтотОбъект, ПараметрыУстановкиСвойствСубконто(ЭтотОбъект,  "СчетУчетаНДССубконто", "СчетУчетаНДССубконто", "", "", "СчетУчетаНДС"));

КонецПроцедуры

&НаСервере
Функция ПараметрыУстановкиСвойствСубконто(Форма, ИмяСубконтоФормы, ИмяСубконтоОбъекта, ПодразделениеФормы, ПодразделениеОбъекта, ИмяСчетаОбъекта) Экспорт
	
	Результат = CW_БухгалтерскийУчетКлиентСерверМСФО.ПараметрыУстановкиСвойствСубконтоПоШаблону(
				ИмяСубконтоФормы  		,
				ПодразделениеФормы 		,
				ИмяСубконтоОбъекта		,
				ПодразделениеОбъекта	,
				ИмяСчетаОбъекта			);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Субконто1ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 1, "Субконто", "Субконто", "Подразделение", "", "СчетУчетаКонвертации");
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто2ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 2, "Субконто", "Субконто", "Подразделение", "", "СчетУчетаКонвертации");
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто3ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 3, "Субконто", "Субконто", "Подразделение", "", "СчетУчетаКонвертации");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаНДССубконто1ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 1,  "СчетУчетаНДССубконто", "СчетУчетаНДССубконто", "", "", "СчетУчетаНДС");
	
КонецПроцедуры


&НаКлиенте
Процедура СчетУчетаНДССубконто2ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 2, "СчетУчетаНДССубконто", "СчетУчетаНДССубконто", "", "", "СчетУчетаНДС");
	
КонецПроцедуры


&НаКлиенте
Процедура СчетУчетаНДССубконто3ПриИзменении(Элемент)
	
	ПриИзмененииСубконто(ЭтотОбъект, 3,  "СчетУчетаНДССубконто", "СчетУчетаНДССубконто", "", "", "СчетУчетаНДС");
	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииСубконто(Форма, НомерСубконто, ИмяСубконтоФормы, ИмяСубконтоОбъекта, ПодразделениеФормы, ПодразделениеОбъекта, ИмяСчетаОбъекта)
	
	УстановитьМодифицированностьФормы();
	CW_БухгалтерскийУчетКлиентСерверМСФО.УстановитьСвойстваСубконтоШапкиПриИзмененииСубконто(
		Форма, ЭтотОбъект, НомерСубконто, ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере(ИмяСубконтоФормы, ИмяСубконтоОбъекта, ПодразделениеФормы, ПодразделениеОбъекта, ИмяСчетаОбъекта));
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка, "Субконто", "Субконто", "Подразделение", "", "СчетУчетаКонвертации");
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка, "Субконто", "Субконто", "Подразделение", "", "СчетУчетаКонвертации");
	
КонецПроцедуры

&НаКлиенте
Процедура Субконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка, "Субконто", "Субконто", "Подразделение", "", "СчетУчетаКонвертации");
	
КонецПроцедуры


&НаКлиенте
Процедура СчетУчетаНДССубконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка, "СчетУчетаНДССубконто", "СчетУчетаНДССубконто", "", "", "СчетУчетаНДС");
	
КонецПроцедуры


&НаКлиенте
Процедура СчетУчетаНДССубконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка, "СчетУчетаНДССубконто", "СчетУчетаНДССубконто", "", "", "СчетУчетаНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаНДССубконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СубконтоНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка, "СчетУчетаНДССубконто", "СчетУчетаНДССубконто", "", "", "СчетУчетаНДС");
	
КонецПроцедуры


&НаКлиенте
Процедура СубконтоНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка, ИмяСубконтоФормы, ИмяСубконтоОбъекта, ПодразделениеФормы, ПодразделениеОбъекта, ИмяСчетаОбъекта)
	
	ДанныеОбъекта = CW_БухгалтерскийУчетКлиентСерверМСФО.ДанныеУстановкиПараметровСубконто(
		ЭтотОбъект, ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере(ИмяСубконтоФормы, ИмяСубконтоОбъекта, ПодразделениеФормы, ПодразделениеОбъекта, ИмяСчетаОбъекта));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыУстановкиСвойствСубконтоНаСервере(ИмяСубконтоФормы, ИмяСубконтоОбъекта, ПодразделениеФормы, ПодразделениеОбъекта, ИмяСчетаОбъекта)
	Возврат  ПараметрыУстановкиСвойствСубконто(ЭтотОбъект, ИмяСубконтоФормы, ИмяСубконтоОбъекта, ПодразделениеФормы, ПодразделениеОбъекта, ИмяСчетаОбъекта);
КонецФункции

&НаКлиенте
Процедура СчетУчетаРасчетовСПодотчетнымиЛицамиПриИзменении(Элемент)
	
	УстановитьМодифицированностьФормы();

КонецПроцедуры

&НаКлиенте
Процедура СчетАвансовПодотчетныхЛицПриИзменении(Элемент)
	
	УстановитьМодифицированностьФормы();

КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаАдминистративныхЗатратПриИзменении(Элемент)
	
	УстановитьМодифицированностьФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаРасходыПоНереализованнымКурсовымРазницамПриИзменении(Элемент)
	УстановитьМодифицированностьФормы();
	ОбработатьИзменениеСчетаДоходовНаСервере("СчетУчетаРасходыПоНереализованнымКурсовымРазницам");
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаДоходыПоНереализованнымКурсовымРазницамПриИзменении(Элемент)
	УстановитьМодифицированностьФормы();
	ОбработатьИзменениеСчетаДоходовНаСервере("СчетУчетаДоходыПоНереализованнымКурсовымРазницам");
КонецПроцедуры

#КонецОбласти






