#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Путевой лист (Форма №4-П)";
	СтруктураОписания.Описание 					= "Путевой лист (Форма №4-П),
	|утвержден ПРИКАЗОМ ГОСКОМСТАТА РОССИИ №78 от 28.11.1997 г.,
	|в редакции ПРИКАЗА МИНТРАНС РФ №368 от 11.09.2020 г., 
	|в редакции ПРИКАЗА МИНТРАНС РФ №159 от 05.05.2023 г.
	|действует с 01.01.2021 г.";
	
	СтруктураОписания.Версия					= "3.2.9.1";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.15.11";
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления
	
	Возврат СтруктураОписания;
	
КонецФункции

//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления

Процедура Регистрация(Ссылка) Экспорт
	
	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_ПутевойЛист");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "Путевой лист (Форма №4-П)"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		
	
	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);
	
КонецПроцедуры

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	Возврат Истина;
	
КонецФункции


//ПЕЧАТЬ
Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт
	
	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	КонецЕсли;
	
	ПечатьИнформациюПоГрузоперевозкам = Константы.CW_ПриПечатиПутевогоЛистаВыводитьИнформациюПоГрузоперевозкам.Получить();
	
	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();
	РезультатПечати.Параметры.Количество 	= 1;
	РезультатПечати.Параметры.Печать 	 	= Истина;  
	
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(СсылкаНаОбъект));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НомерДокумента",	СсылкаНаОбъект.Номер);
	ПараметрыПроцедуры.Вставить("ДатаДокумента",	СсылкаНаОбъект.Дата);
	
	РезультатПечати.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Макет = ПолучитьМакет("ПФ_MXL_ПЛ_4П");
	
	Область_ЛицеваяСторона 		= Макет.ПолучитьОбласть("Лицо"); 
	
	Если СсылкаНаОбъект.Дата < Дата(2023,01,09) Тогда
		ДействующийПриказ = "№78 от 28.11.1997";  
		Область = Область_ЛицеваяСторона.Область("Удостоверение_09_2023");
	Иначе
		Область = Область_ЛицеваяСторона.Область("Удостоверение_2019");
		ДействующийПриказ = "№159 от 05.05.2023";
	КонецЕсли;         
	
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	Область_ЛицеваяСторона.УдалитьОбласть(Область, Смещать);		
	
	Область_ЛицеваяСторона.Параметры.Приказ = ДействующийПриказ;
	
	
	Область_ОборотнаяСторона 	= Макет.ПолучитьОбласть("Оборот");
	
	Запрос_ЛицеваяСтрона = Новый Запрос;
	Запрос_ЛицеваяСтрона.Текст = "ВЫБРАТЬ
	|	CW_ПутевойЛист.Номер КАК Номер,
	|	CW_ПутевойЛист.Дата КАК ДатаВыписки,
	|	CW_ПутевойЛист.ВозвращениеПлан КАК СрокДействия,
	|	CW_ПутевойЛист.Организация КАК Организация,
	|	CW_ПутевойЛист.ТранспортноеСредство.ТипТранспортногоСредства КАК ТипТС,
	|	CW_ПутевойЛист.ТранспортноеСредство.Модель КАК МодельТС,
	|	CW_ПутевойЛист.ТранспортноеСредство.Модель.МаркаТС КАК МаркаТС,
	|	CW_ПутевойЛист.Водитель КАК Водитель,
	|	CW_ПутевойЛист.Водитель.Код КАК ВодительКод,
	|	CW_ПутевойЛист.ПробегПриВыезде КАК СпидометрВыезда,
	|	CW_ПутевойЛист.ВыездПлан КАК ВыездПлан,
	|	CW_ПутевойЛист.Прицеп.Модель КАК МодельПрицеп1,
	|	CW_ПутевойЛист.Прицеп.Модель.МаркаТС КАК МаркаПрицеп1,
	|	CW_ПутевойЛист.Сопровождающий КАК Сопровождающий,
	|	CW_ПутевойЛист.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_ПутевойЛист.Прицеп КАК Прицеп,
	|	CW_ПутевойЛист.Топливо КАК Топливо1,
	|	CW_ПутевойЛист.Топливо.Артикул КАК КодТоплива1,
	|	CW_ПутевойЛист.ОстатокТопливаПриВыезде КАК ОстатокПриВыезде1,
	|	CW_ПутевойЛист.Механик_Выезд КАК Механик,
	|	CW_ПутевойЛист.Медработник КАК Медработник,
	|	CW_ПутевойЛист.Диспетчер_Выезд КАК Диспетчер,
	|	CW_ПутевойЛист.Водитель КАК ВодительПринял,
	|	ВЫБОР
	|		КОГДА НЕ CW_ПутевойЛист.НесколькоВодителей
	|			ТОГДА CW_ПутевойЛист.Водитель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВодительСдал,
	|	CW_ПутевойЛист.Механик_Возвращение КАК ПринялМеханик,
	|	CW_ПутевойЛист.ВозвращениеПлан КАК ВозвращениеПлан
	|ПОМЕСТИТЬ ВТ_ПутевоцЛист
	|ИЗ
	|	Документ.CW_ПутевойЛист КАК CW_ПутевойЛист
	|ГДЕ
	|	CW_ПутевойЛист.Ссылка = &СсылкаНаОбъект
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство,
	|	Прицеп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_Параметры_ГаражныйНомер.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_Параметры_ГаражныйНомер.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ГаражныйНомер
	|ИЗ
	|	РегистрСведений.CW_ПараметрыТС.СрезПоследних(
	|			&ДатаСреза,
	|			ТранспортноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ_ПутевоцЛист.ТранспортноеСредство КАК ТранспортноеСредство
	|					ИЗ
	|						ВТ_ПутевоцЛист КАК ВТ_ПутевоцЛист
	|			
	|					ОБЪЕДИНИТЬ ВСЕ
	|			
	|					ВЫБРАТЬ
	|						ВТ_ПутевоцЛист.Прицеп
	|					ИЗ
	|						ВТ_ПутевоцЛист КАК ВТ_ПутевоцЛист)
	|				И ПараметрТранпортногоСредства = &Параметр_ГаражныйНомер) КАК CW_Параметры_ГаражныйНомер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_РегистрацонныеЗнакиАвтомобилейСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_РегистрацонныеЗнакиАвтомобилейСрезПоследних.РегистрационныйЗнак КАК Значение
	|ПОМЕСТИТЬ ВТ_РегНомер
	|ИЗ
	|	РегистрСведений.CW_РегистрацонныеЗнакиАвтомобилей.СрезПоследних(&ДатаСреза, ТранспортноеСредство В (&мТранспортноеСредство)) КАК CW_РегистрацонныеЗнакиАвтомобилейСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Физлицо,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ВУВодителя
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|			&ДатаСреза,
	|			Физлицо В
	|					(ВЫБРАТЬ
	|						ВТ_ПутевоцЛист.Водитель КАК Водитель
	|					ИЗ
	|						ВТ_ПутевоцЛист КАК ВТ_ПутевоцЛист)
	|				И ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.водительскоеУдостоверение)) КАК ДокументыФизическихЛицСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПутевоцЛист.Номер КАК Номер,
	|	ВТ_ПутевоцЛист.ДатаВыписки КАК ДатаВыписки,
	|	ВТ_ПутевоцЛист.СрокДействия КАК СрокДействия,
	|	ВТ_ПутевоцЛист.Организация КАК Организация,
	|	ВТ_ПутевоцЛист.МодельТС.ПолноеНаименование КАК МодельТС,
	|	ВТ_ПутевоцЛист.ТипТС КАК ТипТС,
	|	ВТ_ПутевоцЛист.МаркаТС КАК МаркаТС,
	|	ВТ_ПутевоцЛист.Водитель КАК Водитель,
	|	ВТ_ПутевоцЛист.ВодительКод КАК ВодительКод,
	|	ВТ_ПутевоцЛист.СпидометрВыезда КАК СпидометрВыезда,
	|	ВТ_ПутевоцЛист.ВыездПлан КАК ВыездПлан,
	|	ВТ_ПутевоцЛист.МодельПрицеп1.ПолноеНаименование КАК МодельПрицеп1,
	|	ВТ_ПутевоцЛист.МаркаПрицеп1 КАК МаркаПрицеп1,
	|	ВТ_ПутевоцЛист.Сопровождающий КАК Сопровождающий,
	|	ЕСТЬNULL(ВТ_ГаражныйНомер.Значение, """") КАК ТСГарНомер,
	|	ЕСТЬNULL(ВТ_ГаражныйНомер1.Значение, """") КАК ПрицепГарНомер1,
	|	ЕСТЬNULL(ВТ_РегНомер.Значение, """") КАК ТранспортноеСредствоГосНомер,
	|	ЕСТЬNULL(ВТ_РегНомер1.Значение, """") КАК ПрицепГосНомер1,
	|	ВТ_ПутевоцЛист.Топливо1 КАК Топливо1,
	|	ВТ_ПутевоцЛист.КодТоплива1 КАК КодТоплива1,
	|	ВТ_ПутевоцЛист.ОстатокПриВыезде1 КАК ОстатокПриВыезде1,
	|	ВТ_ПутевоцЛист.Механик КАК Механик,
	|	ВТ_ПутевоцЛист.Медработник КАК Медработник,
	|	ВТ_ПутевоцЛист.Диспетчер КАК Диспетчер,
	|	ВТ_ПутевоцЛист.ВодительПринял КАК ВодительПринял,
	|	ЕСТЬNULL(ВТ_ВУВодителя.Серия, """") КАК ВУ_Серия,
	|	ЕСТЬNULL(ВТ_ВУВодителя.Номер, """") КАК ВУ_Номер,
	|	ВТ_ВУВодителя.ДатаВыдачи КАК ВУ_ДатаВыдачи,
	|	ВТ_ПутевоцЛист.ВодительСдал КАК ВодительСдал,
	|	ВТ_ПутевоцЛист.ПринялМеханик КАК ПринялМеханик,
	|	ВТ_ПутевоцЛист.ВозвращениеПлан КАК ВозвращениеПлан,
	|	ВТ_ПутевоцЛист.Водитель.СтраховойНомерПФР КАК СтраховойНомерПФР
	|ИЗ
	|	ВТ_ПутевоцЛист КАК ВТ_ПутевоцЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГаражныйНомер КАК ВТ_ГаражныйНомер
	|		ПО ВТ_ПутевоцЛист.ТранспортноеСредство = ВТ_ГаражныйНомер.ТранспортноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГаражныйНомер КАК ВТ_ГаражныйНомер1
	|		ПО ВТ_ПутевоцЛист.Прицеп = ВТ_ГаражныйНомер1.ТранспортноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегНомер КАК ВТ_РегНомер
	|		ПО ВТ_ПутевоцЛист.ТранспортноеСредство = ВТ_РегНомер.ТранспортноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегНомер КАК ВТ_РегНомер1
	|		ПО ВТ_ПутевоцЛист.Прицеп = ВТ_РегНомер1.ТранспортноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВУВодителя КАК ВТ_ВУВодителя
	|		ПО ВТ_ПутевоцЛист.Водитель = ВТ_ВУВодителя.Физлицо";
	
	мТранспортноеСредство = новый Массив;
	мТранспортноеСредство.Добавить(СсылкаНаОбъект.ТранспортноеСредство);
	мТранспортноеСредство.Добавить(СсылкаНаОбъект.Прицеп);
	
	Запрос_ЛицеваяСтрона.УстановитьПараметр("ДатаСреза"					, СсылкаНаОбъект.Дата);		
	Запрос_ЛицеваяСтрона.УстановитьПараметр("СсылкаНаОбъект"			, СсылкаНаОбъект);		
	Запрос_ЛицеваяСтрона.УстановитьПараметр("Параметр_ГаражныйНомер"	, ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.ГаражныйНомер);	
	Запрос_ЛицеваяСтрона.УстановитьПараметр("мТранспортноеСредство"		, мТранспортноеСредство);
	
	РезультатЗапроса = Запрос_ЛицеваяСтрона.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Область_ЛицеваяСторона.Параметры, 	Выборка,,"Организация,Номер,Диспетчер,Механик,ВодительПринял,Медработник,ВодительСдал,ПринялМеханик");
		ЗаполнитьЗначенияСвойств(Область_ОборотнаяСторона.Параметры, Выборка);
		
		СведенияОПоставщике		= CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Выборка.Организация, Выборка.ДатаВыписки);
		ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике, "НаименованиеДляПечатныхФорм,ИНН,ЮридическийАдрес,Телефоны,ОГРН");
		НомерДокумента 			= CW_Документы.ПолучитьНомерНаПечать(СсылкаНаОбъект, "Номер", "Дата");
		
		Область_ЛицеваяСторона.Параметры.Организация 		= ПредставлениеПоставщика;
		Область_ЛицеваяСторона.Параметры.Номер 				= НомерДокумента;
		
		Область_ЛицеваяСторона.Параметры.ДатаВыезда_ДД 		= День(Выборка.ВыездПлан);
		Область_ЛицеваяСторона.Параметры.ДатаВыезда_ММММ 	= Месяц(Выборка.ВыездПлан);
		Область_ЛицеваяСторона.Параметры.ВремяВыезда_ЧЧ 	= Час(Выборка.ВыездПлан);
		Область_ЛицеваяСторона.Параметры.ВремяВыезда_ММ 	= Минута(Выборка.ВыездПлан);
		
		Область_ЛицеваяСторона.Параметры.ВыданоТоплива1 			= СсылкаНаОбъект.ТопливоВыдано.Итог("Объем");
		Область_ЛицеваяСторона.Параметры.ВыдатьКоличествоГорючего 	= СсылкаНаОбъект.ТопливоВыдано.Итог("Объем");
		
		Если СсылкаНаОбъект.Дата < Дата(2023,01,09) Тогда 
			НомерУдостоверенияВодителя = Выборка.ВУ_Серия + " " +Выборка.ВУ_Номер;
		Иначе
			НомерУдостоверенияВодителя = Выборка.ВУ_Серия + " " +Выборка.ВУ_Номер + " выдано "+?(Выборка.ВУ_ДатаВыдачи=Неопределено,"", Формат(Выборка.ВУ_ДатаВыдачи,"ДФ=dd.MM.yyyy"));	
			Область_ЛицеваяСторона.Параметры.СНИЛСВодителя = Выборка.СтраховойНомерПФР;
		КонецЕсли;
		
		Область_ЛицеваяСторона.Параметры.НомерУдостоверенияВодителя = НомерУдостоверенияВодителя;
		
		//Подписи
		Область_ЛицеваяСторона.Параметры.Диспетчер		 = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Выборка.Диспетчер));
		Область_ЛицеваяСторона.Параметры.Механик		 = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Выборка.Механик));
		Область_ЛицеваяСторона.Параметры.ВодительПринял	 = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Выборка.ВодительПринял));	
		Область_ЛицеваяСторона.Параметры.Медработник	 = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Выборка.Медработник));	
		Область_ЛицеваяСторона.Параметры.ПринялМеханик	 = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Выборка.ПринялМеханик));
		Область_ЛицеваяСторона.Параметры.ВодительСдал	 = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Выборка.ВодительСдал));
		
		//		Область_ОборотнаяСторона.Параметры.ПринялМеханик = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Выборка.ПринялМеханик));
		//		Область_ОборотнаяСторона.Параметры.ВодительСдал	 = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Выборка.ВодительСдал));	
		
		
	КонецЕсли;
	
	Если ПечатьИнформациюПоГрузоперевозкам Тогда
		Запрос_Грузоперевозки = Новый Запрос;
		Запрос_Грузоперевозки.Текст = "ВЫБРАТЬ
		|	CW_ПутевойЛистЭтапыМаршрута.АдресПогрузки КАК АдресПогрузки,
		|	CW_ПутевойЛистЭтапыМаршрута.КоличествоЕздок КАК КоличествоЕздок
		|ИЗ
		|	Документ.CW_ПутевойЛист.ЭтапыМаршрута КАК CW_ПутевойЛистЭтапыМаршрута
		|ГДЕ
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка = &СсылкаНаОбъект";
		
		Запрос_Грузоперевозки.УстановитьПараметр("СсылкаНаОбъект" , СсылкаНаОбъект);
		
		РезультаЗапроса = Запрос_Грузоперевозки.Выполнить();
		
		ТаблицаГрузоперевозок = РезультаЗапроса.Выгрузить();
		
		ОграничениеСтрок = Мин(ТаблицаГрузоперевозок.Количество()-1 , 2);
		
		Для Стр = 1 По ОграничениеСтрок Цикл
			Для Каждого Колонка из ТаблицаГрузоперевозок.Колонки Цикл
				Область_ЛицеваяСторона.Параметры[Колонка.Имя+Формат(Стр,"ЧДЦ=; ЧГ=0")] = ТаблицаГрузоперевозок[Стр][Колонка.Имя];
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПечатьИнформациюПоГрузоперевозкам Тогда
		Запрос_Грузоперевозки = Новый Запрос;
		Запрос_Грузоперевозки.Текст = "ВЫБРАТЬ
		|	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка.Клиент КАК Заказчик,
		|	CW_ПутевойЛистЭтапыМаршрута.КоличествоЕздок КАК КоличествоЕздок
		|ИЗ
		|	Документ.CW_ПутевойЛист.ЭтапыМаршрута КАК CW_ПутевойЛистЭтапыМаршрута
		|ГДЕ
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка = &СсылкаНаОбъект";
		
		Запрос_Грузоперевозки.УстановитьПараметр("СсылкаНаОбъект" , СсылкаНаОбъект);
		
		РезультаЗапроса = Запрос_Грузоперевозки.Выполнить();
		
		ТаблицаГрузоперевозок = РезультаЗапроса.Выгрузить();
		
		ОграничениеСтрок = Мин(ТаблицаГрузоперевозок.Количество()-1 , 2);
		
		Для Стр = 1 По ОграничениеСтрок Цикл
			Для Каждого Колонка из ТаблицаГрузоперевозок.Колонки Цикл
				Область_ОборотнаяСторона.Параметры[Колонка.Имя+Формат(Стр,"ЧДЦ=; ЧГ=0")] = ТаблицаГрузоперевозок[Стр][Колонка.Имя];
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(Область_ЛицеваяСторона);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабличныйДокумент.Вывести(Область_ОборотнаяСторона);
	
	
	РезультатПечати.ПечатнаяФорма = ТабличныйДокумент;
	
	Возврат РезультатПечати;
	
КонецФункции // Печать
#КонецЕсли