
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборДинамическогоСписка();
	
	//Подсистема.СогласованиеОбъктов
	CW_СогласованиеСервер.ПриСозданииНаСервереФормыСписка(ЭтаФорма, "СправочникСсылка.CW_ПриложенияКДоговорам", Отказ, СтандартнаяОбработка);
	//Подсистема.СогласованиеОбъктов

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Договор", Элемент.ТекущиеДанные.Договор);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.CW_ПриложенияКДоговорам.ФормаОбъекта", СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДействующиеПриИзменении(Элемент)
	УстановитьОтборДинамическогоСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСписка()
	
	ИспользоватьОтборДействующие	= ОтборДействующие <> 0;
	ОтборДействующиеНайден 			= Ложь;
	
	// Все(0), Действующие(2), Закрытые(1)
	Если ОтборДействующие = 1 Тогда
		ВидСравненияДействующие = ВидСравненияКомпоновкиДанных.Заполнено;
	Иначе
		ВидСравненияДействующие = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	КонецЕсли;
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДатаЗакрытия") Тогда
			ЭлементОтбора.ВидСравнения 		= ВидСравненияДействующие;
			ЭлементОтбора.Использование 	= ИспользоватьОтборДействующие;
			
			ОтборДействующиеНайден 			= Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОтборДействующиеНайден И ИспользоватьОтборДействующие Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДатаЗакрытия");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияДействующие;
		ЭлементОтбора.Использование 	= Истина;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

