
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	Если (Параметры.Свойство("ФизическоеЛицо")) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_КонтактыеЛица.Ссылка,
		|	CW_КонтактыеЛица.Владелец КАК Контрагент
		|ИЗ
		|	Справочник.CW_КонтактыеЛица КАК CW_КонтактыеЛица
		|ГДЕ
		|	CW_КонтактыеЛица.ЭтоГруппа = ЛОЖЬ
		|	И CW_КонтактыеЛица.ПометкаУдаления = ЛОЖЬ
		|	И CW_КонтактыеЛица.ФизическоеЛицо = &ФизическоеЛицо";
		Запрос.УстановитьПараметр("ФизическоеЛицо", Параметры.ФизическоеЛицо);
		ТЗ = Запрос.Выполнить().Выгрузить();
		ПерваяСтрока = _сф.к_ПервыйЭлемент(ТЗ);
		Если (ПерваяСтрока <> Неопределено) Тогда
			Объект.Владелец = ПерваяСтрока.Контрагент;
			Объект.КонтактноеЛицо = ПерваяСтрока.Ссылка;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если (Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.КонтактноеЛицо) И НЕ ЗначениеЗаполнено(Объект.Владелец)) Тогда
		Объект.Владелец = Объект.КонтактноеЛицо.Владелец;
	КонецЕсли; 
	Если (Объект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(Объект.Владелец) И ЗначениеЗаполнено(Объект.ОбъектСобытия)) Тогда
		
		Если (ТипЗнч(Объект.ОбъектСобытия)=Тип("СправочникСсылка.CW_Грузоперевозки")) Тогда
			Объект.Владелец = Объект.ОбъектСобытия.Клиент;
		ИначеЕсли (ТипЗнч(Объект.ОбъектСобытия)=Тип("СправочникСсылка.CW_Заказы")) Тогда 
			Объект.Владелец = Объект.ОбъектСобытия.Клиент;
		ИначеЕсли (ТипЗнч(Объект.ОбъектСобытия)=Тип("СправочникСсылка.CW_Заявки")) Тогда 
			Объект.Владелец = Объект.ОбъектСобытия.Контрагент;
		КонецЕсли; 
		
	КонецЕсли; 
	Если (Объект.Ссылка.Пустая()) Тогда
		Объект.Ответственный = CW_Настройки.Пользователь();
	КонецЕсли; 
	
	// --- 
	
	УправлениеЭлементамиФормы();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  
	
	Сообщение = ТекущийОбъект.ХранилищеСообщения.Получить();

КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.ХранилищеСообщения = Новый ХранилищеЗначения(Сообщение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОЗаписиНового(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.КонтактноеЛицо.Доступность = ЗначениеЗаполнено(Объект.Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПФ = Новый Структура("Контрагент",Объект.Владелец);
	ОткрытьФорму("Справочник.CW_КонтактыеЛица.Форма.ФормаВыбораКонтактногоЛица",ПФ,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	Объект.КонтактноеЛицо = Неопределено;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
  