&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьИзКлассификатора(Команда)
	
	Если ПроверитьЗаполнениеДанныхПоддержкиНаСервере() Тогда
		ОткрытьФорму("Справочник.CW_Линии.Форма.ФормаДобавленияИзКлассификатора", , Элементы.Список);	
	Иначе
		ОписаниеОпвещения = Новый ОписаниеОповещения("ПослеЗакрытияФораыВводаЛогинаИПароля", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.CW_ФормаЛогинПароль",,ЭтаФорма,,,, ОписаниеОпвещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФораыВводаЛогинаИПароля(Результат, ДополнительныеПараметры) Экспорт
	
	Если ПроверитьЗаполнениеДанныхПоддержкиНаСервере() Тогда
		ОткрытьФорму("Справочник.CW_Линии.Форма.ФормаДобавленияИзКлассификатора", , Элементы.Список);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеДанныхПоддержкиНаСервере() 
	
	Возврат CW_МониторПорталаПоддержкиСервер.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();

КонецФункции

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

//Внешние подклчюаемые команды
&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры
//Внешние подклчюаемые команды


