
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РегистрационныйНомер 				= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	ПредставлениеПрограммногоПродукта 	= "Бухгалтерия экспедитора 8";
	ПрограммныйПродукт					= "ESD";
	ПолучитьДанныеДляПродленияПодписки(); 
	
	УстановитьДоступныеСтранциыШаги();
	
	Если Не ЕстьПодпискаНаОсновнуюПоставку Тогда
		Элементы.ФормаОформитьПодписку.Видимость 	= Ложь;
		Элементы.ФормаДалее.Видимость 				= Ложь;
		Элементы.ФормаНазад.Видимость 				= Ложь;
		Элементы.ФормаОтмена.Видимость 				= Ложь;
		Элементы.ФормаЗакрыть.Видимость 			= Истина;
		
		Элементы.ДекорацияОшибка.Заголовок 			= "Для офромления подписки на сервис ""Обмен с 1С-ЭПД"" требуется действующая подписка на обновления модуля ""Бухгалтерия экспедитора 8""";
		Элементы.ГруппаСтраницы.ТекущаяСтраница   	= Элементы.ШагОшибка;   
	Иначе
		УстановитьДатуНачалаНаСервере();
		
		УстановитьВидимостьКнопок();
		ОбработатьШаг(); 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступныеСтранциыШаги()
	
	Массив = Новый Массив;
	Массив.Добавить("Шаг1");
	Массив.Добавить("Шаг2");
	Массив.Добавить("Шаг3");
	Массив.Добавить("Шаг4");
	Массив.Добавить("Шаг5");
	
	ДоступныеСтраницы = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры

&НаСервере
Процедура ДоступныеТарифыВыбранПриИзмененииНаСервере(ТекущаяСтрока)
	
	Для Каждого СтрокаТарифа из ДоступныеТарифы Цикл
		ИдентифкаторСтроки = СтрокаТарифа.ПолучитьИдентификатор();
		Если ИдентифкаторСтроки = ТекущаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТарифа.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеТарифыВыбранПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДоступныеТарифы.ТекущаяСтрока;
	ДоступныеТарифыВыбранПриИзмененииНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяПодпискаДатаНачалаПриИзменении(Элемент)
	
	НоваяПодпискаДатаНачалаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоМесяцевПриИзменении(Элемент)
	
	УстановитьДатуОкончанияПодписки();
	
КонецПроцедуры


&НаСервере
Процедура НоваяПодпискаДатаНачалаПриИзмененииНаСервере()     
	
	УстановитьВидимостьПредупрежденияОПересеченииПериодов();
	
	Если ДатаОкончания = Дата(1,1,1) или ДатаОкончания < НачалоДня(ТекущаяДата()) Тогда
		НоваяПодпискаДатаНачала = ТекущаяДата();
	КонецЕсли;
	
	УстановитьДатуОкончанияПодписки();   
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредупрежденияОПересеченииПериодов()
	
	Элементы.ГруппаПересечениеПериодов.Видимость  = НоваяПодпискаДатаНачала <= ДатаОкончания и ДатаОкончания <> Дата(1,1,1) и Не ТарифДемо;

КонецПроцедуры

&НаСервере
Процедура УстановитьДатуНачалаНаСервере()
	
	Если ДатаОкончания = Дата(1,1,1) или ДатаОкончания < НачалоДня(ТекущаяДата()) или ТарифДемо Тогда
		НоваяПодпискаДатаНачала = ТекущаяДата();
	Иначе
		Если НоваяПодпискаДатаНачала <= ДатаОкончания Тогда
			НоваяПодпискаДатаНачала = КонецДня(ДатаОкончания) + 1;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДатуОкончанияПодписки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуОкончанияПодписки()
	
	НоваяДатаОкончания 			= ДобавитьМесяц(НоваяПодпискаДатаНачала, КоличествоМесяцев);
	
	НоваяДатаОкончания 			= НачалоДня(НоваяДатаОкончания-1);
	НоваяПодпискаДатаОкончания 	= НоваяДатаОкончания;
	
	ВыполнитьПерерасчетОкончанияПодписки();
	
КонецПроцедуры


&НаСервере
Процедура ПолучитьДанныеДляПродленияПодписки()    

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("software", 	XMLСтрока(ПрограммныйПродукт));     
	СтруктураJSON.Вставить("сheckmain", XMLСтрока(Истина));     
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("esd_rates", СтруктураJSON);
 	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");  
	Если Ответ = Неопределено Тогда   
		ВызватьИсключение "Отсутствует интернте-соединение!";
	КонецЕсли;
	
	Если Ответ.КодСостояния = 200 Тогда  
		
		СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);   
		
		АдресПолучателя			= XMLЗначение(Тип("Строка"), СтруктураJSON.email);   
		ОсновнойАдресПолучателя = АдресПолучателя;
		
		ТекущийТариф = СтруктураJSON.currentrate;
		
		Организация	= XMLЗначение(Тип("Строка"), 	ТекущийТариф.customername);   
		ТарифID		= XMLЗначение(Тип("УникальныйИдентификатор"), ТекущийТариф.rateid);   
		Тариф		= XMLЗначение(Тип("Строка"), 	ТекущийТариф.ratename);   
		ТарифДемо	= XMLЗначение(Тип("Булево"), 	ТекущийТариф.ratedemo);   
		
		ДатаОкончания 	= XMLЗначение(Тип("Дата"),	 ТекущийТариф.enddate);   
		ЕстьПодпискаНаОсновнуюПоставку 	= XMLЗначение(Тип("Булево"), ТекущийТариф.access);   
		
		rates = СтруктураJSON.rates;
		
		ИдентифкаторМаксСтроки = Неопределено;
		МаксимальныйПериод = 0; 
		
		Для Каждого ДанныеТарифа из rates Цикл
			НоваяСтрока = ДоступныеТарифы.Добавить();
			НоваяСтрока.UID 				= XMLЗначение(Тип("УникальныйИдентификатор"), 	ДанныеТарифа.rateid);
			НоваяСтрока.Наименование		= XMLЗначение(Тип("Строка"), 	ДанныеТарифа.ratename);
			НоваяСтрока.Стоимость			= XMLЗначение(Тип("Число"), 	ДанныеТарифа.price);
			НоваяСтрока.СтоимостьПродления	= XMLЗначение(Тип("Число"), 	ДанныеТарифа.renewalprice);
			НоваяСтрока.Месяцев				= XMLЗначение(Тип("Число"),		ДанныеТарифа.months);
			НоваяСтрока.Пользователей		= XMLЗначение(Тип("Число"), 	ДанныеТарифа.users);
			
			НоваяСтрока.Выбран = НоваяСтрока.UID = ТарифID;
			
			МаксимальныйПериод = Макс(МаксимальныйПериод,НоваяСтрока.Месяцев);
			Если  МаксимальныйПериод = НоваяСтрока.Месяцев Тогда
				ИдентифкаторМаксСтроки = НоваяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ДатаОкончания.Видимость = ЗначениеЗаполнено(ТарифID);
	
	Если Не ЗначениеЗаполнено(ТарифID) и ЗначениеЗаполнено(ИдентифкаторМаксСтроки) Тогда
		ВыбраннаяСтрока = ДоступныеТарифы.НайтиПоИдентификатору(ИдентифкаторМаксСтроки);
		ВыбраннаяСтрока.Выбран = Истина;
	КонецЕсли;
	
	ДоступныеТарифы.Сортировать("Месяцев ВОЗР");

КонецПроцедуры


&НаКлиенте
Процедура ОформитьПодписку(Команда)
	
	Отказ = ложь;
	ПроверитьЗаполнениеРеквизитов(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения =  ПродолжитьФормированиеДокументовНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатОтправкиСчета", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПродолжитьФормированиеДокументовНаСервереВФоне()
	
	тДоступныеТарифы 	= РеквизитФормыВЗначение("ДоступныеТарифы");
	НайденнаяСтрока 	= тДоступныеТарифы.Найти(Истина, "Выбран");    
	
	НаименованиеФоновогоЗадания = "Продление подписки "+ПрограммныйПродукт;

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПрограммныйПродукт", 		ПрограммныйПродукт);
	ПараметрыПроцедуры.Вставить("РегистрационныйНомер", 	РегистрационныйНомер);
	
	ПараметрыПроцедуры.Вставить("ИдентифкаторТарифа", 		НайденнаяСтрока.UID);
	
	ПараметрыПроцедуры.Вставить("ДатаНачала", 				НоваяПодпискаДатаНачала);
	ПараметрыПроцедуры.Вставить("КоличествоМесяцев", 		КоличествоМесяцев);
	ПараметрыПроцедуры.Вставить("Количество", 				КоличествоМесяцев);
	
	ПараметрыПроцедуры.Вставить("АдресПолучателя", 			АдресПолучателя);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ОбменГИСЭПДСервер.ПолучитьСчетНаПродлениеПодписки",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатОтправкиСчета(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		СтруктураОтвета = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		Если СтруктураОтвета.КодСостояния = 200 Тогда
			
			мСтроки = Новый Массив;   
			
			мСтроки.Добавить("Счет на продление подписки был направлен на адрес(а): ");
			
			мСтроки.Добавить(Новый ФорматированнаяСтрока(СокрЛП(АдресПолучателя), Новый Шрифт(,,Истина)));
			мСтроки.Добавить(Символы.ПС);
			мСтроки.Добавить("После поступления оплаты, на адрес ");
			мСтроки.Добавить(Новый ФорматированнаяСтрока(СокрЛП(ОсновнойАдресПолучателя), Новый Шрифт(,,Истина)));  
			
			мСтроки.Добавить(" будет направлено соответствующее уведомление 
							 |об активации подписки с актом выполненных работ на оказанную услугу.");  
			
			мСтроки.Добавить(Символы.ПС);
			мСтроки.Добавить(Символы.ПС);
			мСтроки.Добавить("Логин и пароль доступа к сайту технической поддержки останутся прежними.");
			мСтроки.Добавить(Символы.ПС);
			мСтроки.Добавить(Символы.ПС);
			мСтроки.Добавить("В случае неоплаты счета в течении 5 (пяти) календарных дней, счет будет автоматически аннулирован. 
							|Если счет будет аннулирован, то на адрес: ");
			мСтроки.Добавить(Новый ФорматированнаяСтрока(СокрЛП(ОсновнойАдресПолучателя), Новый Шрифт(,,Истина)));
			мСтроки.Добавить(" будет направлено соответствующее уведомление.");

			ТекстСообщения = Новый ФорматированнаяСтрока(мСтроки);
			
			Элементы.ФормаОформитьПодписку.Видимость 	= Ложь;
			Элементы.ФормаДалее.Видимость 				= Ложь;
			Элементы.ФормаНазад.Видимость 				= Ложь;
			Элементы.ФормаОтмена.Видимость 				= Ложь;
			Элементы.ФормаЗакрыть.Видимость 			= Истина;

			Элементы.ДекорацияУспешно.Заголовок = ТекстСообщения;
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница   = Элементы.ШагУспешно;
			
		Иначе
			
			Элементы.ФормаОформитьПодписку.Видимость 	= Ложь;
			Элементы.ФормаДалее.Видимость 				= Ложь;
			Элементы.ФормаНазад.Видимость 				= Ложь;
			Элементы.ФормаОтмена.Видимость 				= Ложь;
			Элементы.ФормаЗакрыть.Видимость 			= Истина;

			Элементы.ДекорацияОшибка.Заголовок = СтруктураОтвета.ТекстСостояния+" 
												|Повторите попытку позднее.";
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница   = Элементы.ШагОшибка;
		
		КонецЕсли;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Ошибка отправки счета!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		Элементы.ДекорацияОшибка.Заголовок = "Не удалсь отправить запрос. 
											|Повторите попытку позднее.";
											
 		Элементы.ГруппаСтраницы.ТекущаяСтраница   = Элементы.ШагОшибка;
		
		Элементы.ФормаОформитьПодписку.Видимость 	= Ложь;
		Элементы.ФормаДалее.Видимость 				= Ложь;
		Элементы.ФормаНазад.Видимость 				= Ложь;
		Элементы.ФормаОтмена.Видимость 				= Ложь;
		Элементы.ФормаЗакрыть.Видимость 			= Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПолучениеСчета(Результат, ДополнительныеПараметры) Экспорт 
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если не ЗначениеЗаполнено(АдресПолучателя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан адрес(а) получаетля счета!",,"АдресПолучателя",, Отказ);
	КонецЕсли;
	
	тДоступныеТарифы 	= РеквизитФормыВЗначение("ДоступныеТарифы");
	
	НайденнаяСтрока 	= тДоступныеТарифы.Найти(Истина, "Выбран");
	Если НайденнаяСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран тариф!",,"ДоступныеТарифы",, Отказ);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НоваяПодпискаДатаНачала) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата начала подписки!",,"НоваяПодпискаДатаНачала",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

//Шаги
&НаСервере
Процедура ОбработатьШаг()  
	
	ИмяСтраницы = ДоступныеСтраницы[НомерШага];
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ИмяСтраницы];
	
	Если НомерШага = 2 Тогда
		
		тДоступныеТарифы = РеквизитФормыВЗначение("ДоступныеТарифы");
		НайденнаяСтрока = тДоступныеТарифы.Найти(Истина, "Выбран");
		Если НайденнаяСтрока = Неопределено Тогда
			НомерШага = 1;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ни один тариф!",,"ДоступныеТарифы");
			ОбработатьШаг();
			Возврат;
		КонецЕсли;
		
		КоличествоМесяцев = НайденнаяСтрока.Месяцев;
		УстановитьВидимостьПредупрежденияОПересеченииПериодов();
		
		УстановитьДатуОкончанияПодписки();  
		
	КонецЕсли; 
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Шаг5 Тогда
		Если Не ЗначениеЗаполнено(АдресПолучателя) Тогда
			НомерШага = НомерШага - 1;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан(ы) адерс(а) электронной почты",,"АдресПолучателя");
			ОбработатьШаг();
			Возврат;
		КонецЕсли;
		
		мПолучатели = СтрРазделить(АдресПолучателя, ";");
		
		мСтроки = Новый Массив;
		Для Каждого Получатель из мПолучатели Цикл
			мСтроки.Добавить(Новый ФорматированнаяСтрока(Получатель+";"));
			мСтроки.Добавить(Символы.ПС);
		КонецЦикла;
		
		Элементы.СписокАдресов.Заголовок = Новый ФорматированнаяСтрока(мСтроки);
	
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	НомерШага = НомерШага - 1;

	ОбработатьШаг();
	
	УстановитьВидимостьКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	НомерШага = НомерШага  + 1;

	ОбработатьШаг();
	
	УстановитьВидимостьКнопок();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопок()
	
	Элементы.ФормаДалее.Видимость 			= НомерШага <  (ДоступныеСтраницы.Количество() - 1);
	Элементы.ФормаДалее.КнопкаПоУмолчанию	= НомерШага <> (ДоступныеСтраницы.Количество() - 1);
	
	Элементы.ФормаНазад.Видимость 			= НомерШага > 0;
	
	Элементы.ФормаОформитьПодписку.Видимость 			= Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Шаг5;
	Элементы.ФормаОформитьПодписку.КнопкаПоУмолчанию 	= Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Шаг5; 
	
КонецПроцедуры
//Шаги  

&НаСервере
Процедура ВыполнитьПерерасчетОкончанияПодписки()    
	
	Если ТарифДемо или Не ЗначениеЗаполнено(ТарифID) 
		ИЛИ НоваяПодпискаДатаНачала > ДатаОкончания Тогда
		Элементы.ГруппаПерерасчет.Видимость = Ложь;
		Возврат;
	КонецЕсли;  
	
	ВремДоступныеТарифы		= ДоступныеТарифы.Выгрузить();  
	
	//НоваяПодпискаДатаОкончания
	ДнейВМеясяце 			= ПолучитьРазностьДатВДнях(НачалоМесяца(НоваяПодпискаДатаНачала), КонецМесяца(НоваяПодпискаДатаНачала));
	
	ПараметрыТекущегоТарифа	= ВремДоступныеТарифы.Найти(ТарифID, 	"UID");  
	СтоимостьДняТарифа		= ПараметрыТекущегоТарифа.Стоимость / ДнейВМеясяце; 

	ОстатокДней 			= ПолучитьРазностьДатВДнях(НоваяПодпискаДатаНачала, КонецДня(ДатаОкончания));
	СуммаОстаток			= Окр(СтоимостьДняТарифа * ОстатокДней, 2); 
	
	ПараметрыНовогоТарифа		= ВремДоступныеТарифы.Найти(Истина, 	"Выбран");           
	НовыйВидТарифа				= ПараметрыНовогоТарифа.Наименование;
	СтоимостьДняНовогоТарифа	= ПараметрыНовогоТарифа.Стоимость / ДнейВМеясяце;
	
	ДополнительныеДни 			= Цел(СуммаОстаток /СтоимостьДняНовогоТарифа);
	НоваяДатаОкончания 			= ДобавитьДниКДате(НоваяПодпискаДатаОкончания, ДополнительныеДни);  

	СтрДнейВМеясяце	= ЧислоПрописью(ДнейВМеясяце, , "день, дня, дней, м");   
	СтрДнейВМеясяце = СокрЛП(СтрЗаменить(СтрДнейВМеясяце, "00", ""));	
	ПозД 			= СтрНайти(СтрДнейВМеясяце, "д",НаправлениеПоиска.СКонца); 
	ДниМесПредмет 	= Сред(СтрДнейВМеясяце, ПозД);
	
	СтрОстатокДней	= ЧислоПрописью(ОстатокДней, , "день, дня, дней, м");   
	СтрОстатокДней  = СокрЛП(СтрЗаменить(СтрОстатокДней, "00", ""));	
	ПозД 			= СтрНайти(СтрОстатокДней, "д",НаправлениеПоиска.СКонца); 
	ОстДниПредмет 	= Сред(СтрОстатокДней, ПозД);
	
	СтрДополнительныеДни 	= ЧислоПрописью(ДополнительныеДни, , "день, дня, дней, м");
	СтрДополнительныеДни  	= СокрЛП(СтрЗаменить(СтрДополнительныеДни, "00", ""));	
	ПозД 					= СтрНайти(СтрДополнительныеДни, "д",НаправлениеПоиска.СКонца);
	ДопДниПредмет 			= Сред(СтрДополнительныеДни, ПозД); 
	
	Массив = Новый Массив;
	Массив.Добавить(Новый ФорматированнаяСтрока("Справочная информация"));
	Массив.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	Массив.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	Массив.Добавить(Новый ФорматированнаяСтрока("На момент оформления новой подписки ("+СокрЛП(НовыйВидТарифа)+") , срок действия предыдущей ("+СокрЛП(Тариф)+") еще не завершен (текущая подписка действует до "+Формат(ДатаОкончания, "ДФ=dd.MM.yyyy")+")"));
	Массив.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	Массив.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	Массив.Добавить(Новый ФорматированнаяСтрока("Расчет нового срока действия оформляемой подписки:"));  
	Массив.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	Массив.Добавить(Новый ФорматированнаяСтрока("Стоимость подписки на один месяц на тарифном плане "+СокрЛП(Тариф)+" составляет: "+Формат(ПараметрыТекущегоТарифа.Стоимость, "ЧДЦ=2")+" руб."));
	Массив.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	Массив.Добавить(Новый ФорматированнаяСтрока("Количество неиспользованных дней на текущем тарифном плане "+СокрЛП(Тариф)+" с "+ Формат(НоваяПодпискаДатаНачала, "ДФ=dd.MM.yyyy")+" по "+ Формат(ДатаОкончания, "ДФ=dd.MM.yyyy")+ " составляет "+Формат(ОстатокДней, "ЧДЦ=0; ЧГ=0")+" "+ОстДниПредмет+"."));
	Массив.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	Массив.Добавить(Новый ФорматированнаяСтрока("Остаток неиспользованной суммы на текущем тарифном плане "+СокрЛП(Тариф)+" равен "+Формат(ПараметрыТекущегоТарифа.Стоимость, "ЧДЦ=2") +" руб./ "+Формат(ДнейВМеясяце, "ЧДЦ=0; ЧГ=0")+" дней * " + Формат(ОстатокДней, "ЧДЦ=0; ЧГ=0") + " "+ОстДниПредмет+ " = "+Формат(СуммаОстаток, "ЧДЦ=2")+" руб."));
	Массив.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	Массив.Добавить(Новый ФорматированнаяСтрока("Стоимость одного дня использования сервиса на новом тарифном плане "+СокрЛП(НовыйВидТарифа)+" равна " + Формат(ПараметрыНовогоТарифа.Стоимость, "ЧДЦ=2") +" руб./ "+Формат(ДнейВМеясяце, "ЧДЦ=0; ЧГ=0")+" дней = "+Формат(Окр(СтоимостьДняНовогоТарифа,2), "ЧДЦ=2")+" руб.")); 
	Массив.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	Массив.Добавить(Новый ФорматированнаяСтрока("Количество дополнительных дней, которое будет добавлено к новому тарифному плану "+СокрЛП(НовыйВидТарифа)+ " составляет "+ Формат(СуммаОстаток, "ЧДЦ=2")+" руб. / "+Формат(Окр(СтоимостьДняНовогоТарифа,2), "ЧДЦ=2")+" руб. = "+Формат(ДополнительныеДни, "ЧГ=0")+" "+ДопДниПредмет));
	Массив.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
	Массив.Добавить(Новый ФорматированнаяСтрока("После поступления оплаты срок окончания подписки по новому тарифному плану "+СокрЛП(НовыйВидТарифа)+" будет установлен "+ Формат(НачалоДня(НоваяПодпискаДатаОкончания), "ДФ=dd.MM.yyyy") +  " + " +Формат(ДополнительныеДни, "ЧГ=0")+ " " + ДопДниПредмет +  " = " + Формат(НачалоДня(НоваяДатаОкончания), "ДФ=dd.MM.yyyy")));

	Элементы.НадписьПодробнее.Заголовок = новый ФорматированнаяСтрока(Массив);
	
	Элементы.ГруппаПерерасчет.Видимость = Истина;
	
КонецПроцедуры   

Функция ПолучитьРазностьДатВДнях(Дата1, Дата2)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РАЗНОСТЬДАТ(&Дата1, &Дата2, ДЕНЬ) + 1 КАК Дни";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);    
	
	РезудьтатЗапроса = Запрос.Выполнить();
	Выборка = РезудьтатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Дни;
	
КонецФункции

Функция ДобавитьДниКДате(Дата, Дней)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, &Дней) КАК НоваяДата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Дней", Дней);    
	
	РезудьтатЗапроса = Запрос.Выполнить();
	Выборка = РезудьтатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.НоваяДата;
	
КонецФункции
