
Функция ПолучитьДоступныеПараметры(Знач ГруппаПользователя = Неопределено) Экспорт

	Возврат РегистрыСведений.CW_ПраваДоступаДляПараметровМониторинга.ПолучитьДоступныеПараметры(ГруппаПользователя);
	 
КонецФункции  

Функция ПолучитьДоступностьПараметра(Параметр, ГруппаПользователя=Неопределено) Экспорт
	
	Возврат РегистрыСведений.CW_ПраваДоступаДляПараметровМониторинга.ПолучитьДоступностьПараметра(Параметр, ГруппаПользователя);
	
КонецФункции

Функция ПолучитьТипыОбъектыПараметров()
	
	МассивТипов = Новый Массив;  
	МассивТипов.Добавить(Тип("СправочникСсылка.CW_Коносаменты"));  
	
	Возврат МассивТипов;

КонецФункции     

Функция ЯвляетсяОбъектомПараметров(Знач Ссылка) Экспорт

	ТипыОбъектыПараметров =	ПолучитьТипыОбъектыПараметров();
	
	Возврат ТипыОбъектыПараметров.Найти(ТипЗнч(Ссылка)) <> Неопределено;
	
КонецФункции   

Функция ПолучитьИмяСправочникаМониторинговыхПараметров(Знач Владелец) Экспорт
	
	Если Метаданные.Справочники.CW_МониторинговыеПараметрыОбъектов.Владельцы.Содержит(Владелец.Метаданные()) Тогда
		Возврат "CW_МониторинговыеПараметрыОбъектов";
	КонецЕсли;
	
	Если Метаданные.Справочники.CW_МониторинговыеПараметрыТиповОбъектов.Владельцы.Содержит(Владелец.Метаданные()) Тогда
		Возврат "CW_МониторинговыеПараметрыТиповОбъектов";
	КонецЕсли;
	 
	ВызватьИсключение "Неправильный типв владельца монитринговых параматров!";

КонецФункции

Функция ПолучитьИмяСправочника(Знач Ссылка) Экспорт
	
	Возврат Ссылка.Метаданные().Имя;
	
КонецФункции

