
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = (НЕ CW_ПраваДоступа.ПравоДоступно("ПросмотрИсторииРедактирования"));
	Если Отказ Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Параметры.Свойство("Объект",Объект);
	Если ТипЗнч(Объект) <> Тип("Неопределено") Тогда
		
		Попытка
			
			Список.Параметры.УстановитьЗначениеПараметра("Идентификатор",Объект.УникальныйИдентификатор());			
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			
		КонецПопытки; 
		
	КонецЕсли; 

	
КонецПроцедуры
