
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		
		ВыбраннаяФорма = "ФормаЭлемента";
		
		Если Параметры.Свойство("Ключ") Тогда
			Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
				ВыбраннаяФорма = "ФормаЭлементаРеестра";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;     
	
	Поля.Добавить("ПериодОтчета");
	Поля.Добавить("ПодтверждениеНДС");
	Поля.Добавить("ПриложениеПриказа");
	Поля.Добавить("ПриложениеРеестра");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  

	Если Данные.ПодтверждениеНДС = Перечисления.CW_РеестрыНДС0СтатусыЗаписиРеестра.Подтвержден Тогда
		ПодтверждениеНДС = "Подтвержден";
	Иначе
		ПодтверждениеНДС = "Не подтврежден";
	КонецЕсли;
	
	Представление = СокрЛП(Данные.ПриложениеПриказа) +" ("+Данные.ПриложениеРеестра+")"+ " за " + Формат(Данные.ПериодОтчета,"ДФ='к ""квартал"" гггг ""г.""'")+ " / "+ПодтверждениеНДС;

КонецПроцедуры

Процедура УстановитьНумерациюСправочника() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РеестрыНДС0ЗаписиРеестра.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_РеестрыНДС0ЗаписиРеестра КАК CW_РеестрыНДС0ЗаписиРеестра";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписиРеестрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаписиРеестрОбъект.записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьИзменениеРеквитовОбъетов(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	Для Каждого ЗаписьРеестра из ПараметрыПроцедуры.Ссылки Цикл
		
		ЗаписьРеестраОбъект =  ЗаписьРеестра.ПолучитьОбъект();
		
		Для Каждого КлючЗначение из ПараметрыПроцедуры.ЗначенияРеквизитов Цикл
			ЗаписьРеестраОбъект[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЦикла;                                                         
		
		ЗаписьРеестраОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
