
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация  = CW_Настройки.ОсновнаяОрганизация(); 
	ПериодОтчета = НачалоКвартала(ТекущаяДата());  
	
	УстановитьПредставлениеПериода(); 
	ОбработатьИзменениеПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура КвраталНазад(Команда)   
	
	ОбработатьИзменениеКварталаНаСервере("НАЗАД");
	
КонецПроцедуры

&НаКлиенте
Процедура КварталВперед(Команда)
	
	ОбработатьИзменениеКварталаНаСервере("ВПЕРЕД");
	
КонецПроцедуры   

&НаСервере
Процедура ОбработатьИзменениеКварталаНаСервере(Направление)  
	
	Если Направление = "НАЗАД" Тогда
		ПериодОтчета = НачалоКвартала(ПериодОтчета) - 1;
	ИначеЕсли Направление = "ВПЕРЕД" Тогда
		ПериодОтчета = КонецКвартала(ПериодОтчета) + 1;
	КонецЕсли;
	
	ПериодОтчета = НачалоКвартала(ПериодОтчета);
	
	УстановитьПредставлениеПериода(); 
	ОбработатьИзменениеПериода();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьПредставлениеПериода()
	
	ПериодОтчетаСтрока = Формат(ПериодОтчета,"ДФ='к ""квартал"" гггг ""г.""'");
	
КонецПроцедуры       

&НаСервере
Процедура ОбработатьИзменениеПериода()
	
	СоответствиеДействующиеПриказы = CW_РеестрыНДС0СерверВызовСервера.ПолучитьДействующиеПриказы(ПериодОтчета);  
	ДействующиеПриказы = новый ФиксированноеСоответствие(СоответствиеДействующиеПриказы);
	
КонецПроцедуры   

&НаСервере
Процедура ПриложениеРеестраПриИзмененииНаСервере()

	Приказ 					= ДействующиеПриказы.Получить(ПриложениеРеестра);
	ПриложениеПриказа 		= CW_РеестрыНДС0Сервер.ПолучитьПриложениеПриказа(Приказ, ПриложениеРеестра);

КонецПроцедуры


&НаКлиенте
Процедура ПриложениеРеестраПриИзменении(Элемент)
	ПриложениеРеестраПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Создать(Команда)  
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", 			Организация);
	ЗначенияЗаполнения.Вставить("ПериодОтчета",	 		ПериодОтчета);
	ЗначенияЗаполнения.Вставить("Приказ", 				Приказ);
	ЗначенияЗаполнения.Вставить("ПриложениеПриказа", 	ПриложениеПриказа);     
	ЗначенияЗаполнения.Вставить("ПриложениеРеестра", 	ПриложениеРеестра);     
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения",  ЗначенияЗаполнения);
	
	Модифицированность = Ложь;
	Закрыть();   
	
	ОткрытьФорму("Справочник.CW_РеестрыНДС0ЗаписиРеестра.Форма.ФормаЭлементаРеестра", СтруктураПараметров, ВладелецФормы);
	
КонецПроцедуры



