&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	ПериодОтчета.ДатаНачала 	= НачалоМесяца(ТекущаяДата());
	ПериодОтчета.ДатаОкончания 	= КонецМесяца(ТекущаяДата());  
	ПоказательРубли 	= истина;  
	ПоказательВалюта 	= истина;   
	ПоказатьСкрытьНастройки = истина;
	
	Параметры.Свойство("ПараметрКоманды", ПараметрКоманды); 
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");

	Варианты = ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек;  
	Для Каждого Вариант из Варианты Цикл
		Элементы.КлючВарианта.СписокВыбора.Добавить(Вариант.Имя, Вариант.Представление);
	КонецЦикла;

	АдресСхемы = ПолучитьАдресСхемы();   

	Элементы.ПериодОтчета.Видимость = ВариантФормирования = 0;

	НастройкиНаСервере(); 
	
	//Работа с буфером обмена
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена());
	//Работа с буфером обмена	

КонецПроцедуры      

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоАдресВременногоХранилища(АдресНастроек) Тогда
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(АдресНастроек));  
	КонецЕсли; 
	
	Если ПараметрКоманды <> Неопределено Тогда
		МассивЭлементов = Новый Массив(ПараметрКоманды);
		Если МассивЭлементов.Количество() = 0 тогда
			Возврат;
		Конецесли;

		ВариантФормирования = 1;
		Элементы.ПериодОтчета.Видимость = ВариантФормирования = 0; 
		
		ПервыйЭлемент = МассивЭлементов[0];
		Если ТипЗнч(ПервыйЭлемент) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда    
			МассивЗначений = МассивЭлементов;
		ИначеЕсли  ТипЗнч(ПервыйЭлемент) = Тип("СправочникСсылка.CW_Заказы") Тогда
			МассивЗначений = ПолучитьМассивГрузоперевозокЗаказа(МассивЭлементов);	
		КонецЕсли;
		
		РезультатВыбора = новый Структура;
		РезультатВыбора.Вставить("Поле", "Грузоперевозка"); 
		
		ЭлементОтбора = ДобавитьЭлементОбора(РезультатВыбора);
		
		Если МассивЗначений.Количество() = 1 Тогда
			ЭлементОтбора.ПравоеЗначение = МассивЗначений[0];   
		Иначе
			СписокЗначений = Новый СписокЗначений;
			СписокЗначений.ЗагрузитьЗначения(МассивЗначений); 
			
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = СписокЗначений;
		КонецЕсли;
		
		СформироватьНаСервере(); 
		
		ПоказатьСкрытьНастройки = Ложь;
		НастройкиНаСервере(); 
		
		ВариантМодифицирован = Ложь;
		
	КонецЕсли;    
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьМассивГрузоперевозокЗаказа(МассивЗаказов)
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.Заказ В(&МассивЗаказов)";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ВариантФормированияПриИзменении(Элемент)  

	Элементы.ПериодОтчета.Видимость = ВариантФормирования = 0;
	
	Если ВариантФормирования = 1 Тогда    
		РезультатВыбора = новый Структура;
		РезультатВыбора.Вставить("Поле", "Грузоперевозка");
		ДобавитьЭлементОбора(РезультатВыбора);
	КонецЕсли;   
	
	ВариантМодифицирован = ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект);  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", 	АдресСхемы);
	ПараметрыФормы.Вставить("Режим", 					"Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", 			ПолучитьЗапрещенныеПоля());
	ПараметрыФормы.Вставить("ТекущаяСтрока", 			Неопределено);  
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры      

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено или РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;   
	
	НоваяСтрока = Группировки.Добавить();   
	НоваяСтрока.ИмяПоля 		=  РезультатВыбора.Поле;
	НоваяСтрока.Представление 	=  РезультатВыбора.Заголовок;
	НоваяСтрока.Сортировка 		= ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
	
КонецПроцедуры
 
&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаДобавленияОтбора", ЭтотОбъект);  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", 	АдресСхемы);
	ПараметрыФормы.Вставить("Режим", 					"Отбор");
	ПараметрыФормы.Вставить("ИсключенныеПоля", 			ПолучитьЗапрещенныеПоля());
	ПараметрыФормы.Вставить("ТекущаяСтрока", 			Неопределено);  
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияОтбора(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено или РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;   
	
	ДобавитьЭлементОбора(РезультатВыбора);
	
	ВариантМодифицирован = Ложь;
	ОтборИзменен = Истина;
	
КонецПроцедуры   

&НаКлиенте
Функция ДобавитьЭлементОбора(РезультатВыбора)
	
	ЭлементОтбора = ОтборПоГрузоперевозке();
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(РезультатВыбора.Поле);
	Конецесли;
	
	ЭлементОтбора.Использование = Истина; 
	
	Если Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока <> Неопределено Тогда
		Элементы.КомпоновщикНастроекНастройкиОтбор.Развернуть(Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока);  
	КонецЕсли;    
	
	Возврат ЭлементОтбора;

КонецФункции

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриИзменении(Элемент)
	ОтборИзменен = Истина;
	ВариантМодифицирован = Ложь;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("ПериодОтчета");
	СписокПолей.Добавить("ПрогнозДень");
	СписокПолей.Добавить("ПрогнозМесяц");
	СписокПолей.Добавить("ПрогнозКвартал");
	СписокПолей.Добавить("ПрогнозГод");    
	СписокПолей.Добавить("ВидСтатьи");   
	СписокПолей.Добавить("СуммаВал");    
	СписокПолей.Добавить("СуммаРуб");   
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаСервере
Функция ПолучитьАдресСхемы()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Возврат ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, УникальныйИдентификатор);  
	
КонецФункции

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)   
	
	Если ОтборИзменен Тогда
		НастройкиКомпановки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
		Настройки.Вставить("НастройкиКомпановки", НастройкиКомпановки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки.Получить("ПериодОтчета") = Неопределено тогда
		ПериодОтчета.ДатаНачала 	= НачалоМесяца(ТекущаяДата());
		ПериодОтчета.ДатаОкончания 	= КонецМесяца(ТекущаяДата());  
	КонецЕсли;  
	
	Если Настройки.Получить("ПоказательРубли") = Неопределено тогда
		ПоказательРубли 	= истина;  
	КонецЕсли;  
	
	Если Настройки.Получить("ПоказательВалюта") = Неопределено тогда
		ПоказательВалюта 	= истина;  
	КонецЕсли;
	
	КлючВарианта = Настройки.Получить("КлючВарианта"); 
	Если Не ЗначениеЗаполнено(КлючВарианта) Тогда
		КлючВарианта = Элементы.КлючВарианта.СписокВыбора.Получить(0).Значение;  
	Конецесли;
	
	НастройкиКомпановки = Настройки.Получить("НастройкиКомпановки");
	Если НастройкиКомпановки <> Неопределено тогда      
		АдресНастроек = ПоместитьВоВременноеХранилище(НастройкиКомпановки, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастройкиНаСервере() 
	
	Элементы.ГруппаНастройки.Видимость = ПоказатьСкрытьНастройки;
	Элементы.ФормаНастройки.Пометка = ПоказатьСкрытьНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)   
	
	ПоказатьСкрытьНастройки = Не ПоказатьСкрытьНастройки;
	НастройкиНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) 
	
	Если ВариантФормирования = 1 Тогда
		Если Не УстановленОтборПоГрузоперевозкам() Тогда
			ПоказатьПредупреждение(,"Не установлен отбор по грузопереовзкам!");	
			Возврат;
		КонецЕсли;
	КонецЕсли;  
	
	Если Не ПоказательВалюта
		И Не ПоказательРубли Тогда
			ПоказатьПредупреждение(,"Не установлен ни один показатель отчета!");
			Возврат;
	КонецЕсли;
	
	
	СформироватьНаСервере(); 

	ПоказатьСкрытьНастройки = Ложь;
	НастройкиНаСервере(); 
	
КонецПроцедуры    

&наКлиенте
Функция УстановленОтборПоГрузоперевозкам() 
	
	ЭлементОтбора = ОтборПоГрузоперевозке();
	Если ЭлементОтбора = Неопределено  или Не ЭлементОтбора.использование Тогда
		Возврат Ложь;
	КонецЕсли;     
	
	Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Возврат ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение);
	КонецЕсли;
	Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СписокЗначений") Тогда 
		Если ЭлементОтбора.ПравоеЗначение.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли; 
		ЭлементСписка = ЭлементОтбора.ПравоеЗначение[0];
		Возврат ЗначениеЗаполнено(ЭлементСписка.Значение);
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции   

&НаКлиенте
Функция ОтборПоГрузоперевозке()
	
	Для Каждого ЭлементОтбора из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Грузоперевозка") Тогда
			Возврат ЭлементОтбора;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;     
	
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()             

	СоответствиеНастроекОтчета = Новый Соответствие;   
	
	Показатели = Новый Соответствие;
	Показатели.Вставить("СуммаРуб", ПоказательРубли);
	Показатели.Вставить("СуммаВал", ПоказательВалюта);     
	
	СоответствиеНастроекОтчета.Вставить("ПериодОтчета",			ПериодОтчета);
	СоответствиеНастроекОтчета.Вставить("ВариантФормирования", 	ВариантФормирования);
	СоответствиеНастроекОтчета.Вставить("КлючВарианта", 		КлючВарианта);
	СоответствиеНастроекОтчета.Вставить("Показатели", 			Показатели);
	СоответствиеНастроекОтчета.Вставить("Группировки", 			Группировки.Выгрузить());
	СоответствиеНастроекОтчета.Вставить("ИсключитьВнутрихолдинговыеРасчеты", ИсключитьВнутрихолдинговыеРасчеты); 
	
	СоответствиеНастроекОтчета.Вставить("НастройкиКомпановщика", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Отчет.АдресНастроек = ПоместитьВоВременноеХранилище(СоответствиеНастроекОтчета, УникальныйИдентификатор);
	
	ЭтаФорма.СкомпоноватьРезультат();
	
КонецПроцедуры


//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.КомандаБуфераОбменаВставить.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуфераОбменаВставить(Команда)
	КоличествоСтрок = БуфераОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БуфераОбменаВставитьНаСервере()
	
	Возврат CW_РаботаСБуферомОбмена.УстановитьОтборКомпановщикаПоБуферуОбмена(Отчет.КомпоновщикНастроек);

КонецФункции    
//Работа с буфером обмена