
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
	
	ДанныеРегистрации = CW_МониторПорталаПоддержкиСервер.ПолучитьДанныеРегистрациии();
	
	//Автоматическая загрузка исправлений
	ЗагружатьИУстанавливатьИсправленияАвтоматически = Константы.CW_ЗагружатьИУстанавливатьИсправленияАвтоматически.Получить();
	Задание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(Метаданные.РегламентныеЗадания.CW_ПолучениеИУстановкаИсправленийКонфигурации);
	Если Задание <> Неопределено Тогда
		Элементы.ДекорацияЗагрузкаИсправленийРасписание.Заголовок =
		ИнтернетПоддержкаПользователейКлиентСервер.ПредставлениеРасписания(Задание.Расписание);
	КонецЕсли;
	Элементы.ДекорацияЗагрузкаИсправленийРасписание.Доступность = ЗагружатьИУстанавливатьИсправленияАвтоматически;
	//Автоматическая загрузка исправлений
	
	//Автоматическая загрузка Дополнений
	ЗагружатьИУстанавливатьДополненияАвтоматически = Константы.CW_ЗагружатьИУстанавливатьДополненияАвтоматически.Получить();
	Задание = РегламентныеЗаданияСервер.ПолучитьРегламентноеЗадание(Метаданные.РегламентныеЗадания.CW_ПолучениеИУстановкаДополненийКонфигурации);
	Если Задание <> Неопределено Тогда
		Элементы.ДекорацияЗагрузкаДополненийРасписание.Заголовок =
		ИнтернетПоддержкаПользователейКлиентСервер.ПредставлениеРасписания(Задание.Расписание);
	КонецЕсли;
	Элементы.ДекорацияЗагрузкаДополненийРасписание.Доступность = ЗагружатьИУстанавливатьДополненияАвтоматически;
	//Автоматическая загрузка Дополнений  
	
	Элементы.ДекорацияНазваниеПП.Заголовок = CW_ВерсииПодсистемСервер.ИмяТекущейКонфигурации();
	
	ДоступныеСервисы = CW_БухгалтерияЭкспедитораСервер.ПолучитьДоступныеСервисы(); 
	
	Для Каждого КлючЗначение из ДоступныеСервисы Цикл
		Элементы["Сервис"+КлючЗначение.Ключ].Видимость = КлючЗначение.Значение;	
	КонецЦикла;
	
	ОчиститьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьДанныеМонитораПоддержки", 0.1, Истина);
	
КонецПроцедуры


//Обновление данных формы
&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ОбновитьДанныеНаСервере();
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьДанныеМонитораПоддержки", 0.1, Истина);
	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьДанныеНаСервере()

	ДанныеРегистрации = CW_МониторПорталаПоддержкиСервер.ПолучитьДанныеРегистрациии();
	ОчиститьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьПопыткуПодключения(Команда)
	
	ОчиститьДанныеФормы();
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьДанныеМонитораПоддержки", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеФормы()
	
	ОчиститьДанныеФормыОбновления();
	
	Элементы.СтраницыАвторизация.ТекущаяСтраница 			= Элементы.СтраницаАвторизацияОжидание;
	Элементы.СтраницыПодпискаНаОбновление.ТекущаяСтраница 	= Элементы.СтраницаПодпискаНаОбновлениеОжидание;

	Элементы.КартинкаАвторизацияУспешно.Видимость 				= Истина;       
	Элементы.КартинкаАвторизацияОшибка.Видимость 				= Ложь;
	Элементы.КартинкаАвторизацияОтсутсвует.Видимость 			= Ложь;
	
	Элементы.КартинкаПодпискаНаОбновленияУспешно.Видимость 		= Истина;
	Элементы.КартинкаПодпискаНаОбновленияОтсутсвует.Видимость 	= Ложь;
	Элементы.КартинкаПодпискаНаОбновленияОшибка.Видимость 		= Ложь;   
	
КонецПроцедуры  


&НаСервере
Процедура ОчиститьДанныеФормыОбновления()
	
	Элементы.СтраницыОбновление.ТекущаяСтраница 			= Элементы.СтраницаОбновлениеОжидание;
	Элементы.КартинкаОбновлениеНеТребуется.Видимость 			= Истина;
	Элементы.КартинкаТребуетсяОбновление.Видимость 				= Ложь;
	Элементы.КартинкаНеУдалосьПолучитьОбновления.Видимость 		= Ложь;
	
	Элементы.ГруппаДоступноОбновление.Видимость 			= Ложь;
	Элементы.ГруппаНеУдалосьПолучитьОбновления.Видимость	= Ложь;

КонецПроцедуры
//Обновление данных формы

//Получение данных
&НаКлиенте
Процедура Подключаемый_ОбновитьДанныеМонитораПоддержки()
	
	CW_РаботаСВнешнимиРесурсамиСервер.СоздатьПараметрыПодключенияСервиса();

	НачатьПолучениеРегистрационныхДанных();
	НачатьПолучениеДанныхОПодпискахНаОбновление();
	НачатьПолучениеДанныхОбОбновлениях();
	НачатьПолучениеРезультатОбновления();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеРегистрационныхДанных()
	
	//Регистрационные данные
	РезультатВыполнения =  ОбновитьДанныеМонитораПоддержкиНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПолученияРегистрационныхДанных", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	//Регистрационные данные

КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеДанныхОПодпискахНаОбновление()

	//Подписка на обновления
	РезультатВыполнения =  ОбновитьДанныеПодпискинаОбновлениеНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПолученияДанныхОПодпискахНаОбновление", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	//Подписка на обновления

КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеДанныхОбОбновлениях()

	//Обновление конфигурации
	РезультатВыполнения =  ОбновитьИнформациюОбОбновленияхНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПолученияДанныхОбОбновлениях", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	//Обновление конфигурации

КонецПроцедуры

&НаСервере
Процедура НачатьПолучениеРезультатОбновления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбработчикиОбновления.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.CW_ОбработчикиОбновления КАК CW_ОбработчикиОбновления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ОбработчикиОбновления.Статус";  
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить(); 
	
	СтатусВыполнения = Неопределено;
	
	Отбор 	= Новый Структура("Статус", ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработчиковОбновления.Выполнен"));
	мСтроки = ТаблицаЗапроса.НайтиСтроки(Отбор);
	Если мСтроки.Количество() > 0 
		И ТаблицаЗапроса.Количество() = 1 Тогда
	    //Выполнены все
		СтатусВыполнения = "Успешно";
	КонецЕсли; 
	
	Если СтатусВыполнения = Неопределено Тогда
		Отбор 	= Новый Структура("Статус", ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработчиковОбновления.Ошибка"));
		мСтроки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если мСтроки.Количество() > 0 Тогда
			//Выполнены все
			СтатусВыполнения = "Ошибка";
		КонецЕсли; 
	КонецЕсли;  
	
	Элементы.КартинкаРезультатЗеленый.Видимость	= (СтатусВыполнения = "Успешно");   
	Элементы.КартинкаРезультатКрасный.Видимость	= (СтатусВыполнения = "Ошибка");
	Элементы.КартинкаРезультатЖелтый.Видимость	= (СтатусВыполнения = Неопределено);

	Элементы.КартинкаРезультатЗеленый1.Видимость	= (СтатусВыполнения = "Успешно");   
	Элементы.КартинкаРезультатКрасный1.Видимость	= (СтатусВыполнения = "Ошибка");
	Элементы.КартинкаРезультатЖелтый1.Видимость		= (СтатусВыполнения = Неопределено);
	
КонецПроцедуры
  


&НаСервере
Функция ОбновитьИнформациюОбОбновленияхНаСервереВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "МониторПорталаТехническойПоддержки.ПолучениеинформацииОбОбновлениях";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_МониторПорталаПоддержкиСервер.ПолучитьИнформациюОбОбновлениях",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Функция ОбновитьДанныеМонитораПоддержкиНаСервереВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "МониторПорталаТехническойПоддержки.ПолучениеРегистрационныхДанных";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_МониторПорталаПоддержкиСервер.ПодключитьсяКРесурусуОбновлений",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции


&НаСервере
Функция ОбновитьДанныеПодпискинаОбновлениеНаСервереВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "МониторПорталаТехническойПоддержки.ПолучениеДанныхОНаличииПодискиНаОбновления";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_МониторПорталаПоддержкиСервер.ПолучитьДанныеПодискиНаОбновления",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции



&НаКлиенте
Процедура ОбработатьРезультатПолученияРегистрационныхДанных(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибка;
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ДанныеМонитора = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		ОбновитьДанныеФормы(ДанныеМонитора);
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСодержимое;

	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		Элементы.КартинкаАвторизацияУспешно.Видимость 		= Ложь;
		Элементы.КартинкаАвторизацияОтсутсвует.Видимость 	= Ложь;
		Элементы.КартинкаАвторизацияОшибка.Видимость 		= Истина;
		Элементы.СтраницыАвторизация.ТекущаяСтраница = Элементы.СтраницаАвторизацияОшибка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПолученияДанныхОПодпискахНаОбновление(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Элементы.КартинкаПодпискаНаОбновленияОтсутсвует.Видимость 	= Ложь;
		Элементы.КартинкаПодпискаНаОбновленияУспешно.Видимость 		= Ложь;
		Элементы.КартинкаПодпискаНаОбновленияОшибка.Видимость 		= Истина;
		Элементы.КартинкаПодпискаНаОбновлениеКрасный.Видимость 		= Истина;
		Элементы.КартинкаПодпискаНаОбновлениеЗеленый.Видимость 		= Ложь;
		Элементы.КартинкаПодпискаНаОбновлениеЖелтый.Видимость 		= Ложь;
		
		Элементы.НадписьИнформацияОПодпискеНаОбновления.Заголовок = "Ошибка получения данных о подписке на обновления";
		Элементы.СтраницыПодпискаНаОбновление.ТекущаяСтраница 	= Элементы.СтраницаПодпискаНаОбновление;
		Элементы.ГруппаДоступноОбновление.Видимость 			= Истина;
		
		Элементы.ОбщаяКомандаCW_ЛичныйКабинетОткрытьСписокСчетовБЭ.Видимость	= Ложь;
		Элементы.ОформитьПодписку.Видимость 									= Ложь;
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ДанныеМонитора = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		ОбновитьДанныеФормы(ДанныеМонитора);
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСодержимое;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда         
		
		Элементы.КартинкаПодпискаНаОбновленияОтсутсвует.Видимость 	= Ложь;
		Элементы.КартинкаПодпискаНаОбновленияУспешно.Видимость 		= Ложь;
		Элементы.КартинкаПодпискаНаОбновленияОшибка.Видимость 		= Истина;
		
		Элементы.СтраницыПодпискаНаОбновление.ТекущаяСтраница = Элементы.СтраницыПодпискаНаОбновлениеОшибка;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПолученияДанныхОбОбновлениях(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Элементы.КартинкаНеУдалосьПолучитьОбновления.Видимость	= Истина;
		Элементы.КартинкаОбновлениеНеТребуется.Видимость 		= Ложь;
		Элементы.КартинкаТребуетсяОбновление.Видимость 			= Ложь;
		
		Элементы.ГруппаДоступноОбновление.Видимость 			= Ложь;
		Элементы.ГруппаНеУдалосьПолучитьОбновления.Видимость	= Истина;
		
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ДанныеМонитора = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		ОбновитьДанныеФормы(ДанныеМонитора);
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСодержимое;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда     
		
		Элементы.СтраницыОбновление.ТекущаяСтраница = Элементы.СтраницаОшибкаПриПолученииДанныхОбОбновлении;
		
		Элементы.КартинкаНеУдалосьПолучитьОбновления.Видимость	= Истина;
		Элементы.КартинкаОбновлениеНеТребуется.Видимость 		= Ложь;
		Элементы.КартинкаТребуетсяОбновление.Видимость 			= Ложь;
		
		Элементы.ГруппаДоступноОбновление.Видимость 			= Ложь;
		Элементы.ГруппаНеУдалосьПолучитьОбновления.Видимость	= Истина;
		
	КонецЕсли;
	
КонецПроцедуры
//Получение данных


&НаСервере
Процедура ОбновитьДанныеФормы(ДанныеМонитора, ИмяСервиса="")
	
	Элементы.ДекорацияВремя.Заголовок = "Данные на "+Формат(ТекущаяДата());
	
	Если ДанныеМонитора.Свойство("РегистрационныеДанные") Тогда
		ОбновитьНаФормеРазделРегистрационныеДанные(ДанныеМонитора);
	КонецЕсли;
	
	Если ДанныеМонитора.Свойство("ПодпискаНаОбновления") Тогда
		                        
		ОбновитьНаФормеРазделПодпискаНаОбновления(ДанныеМонитора);
		
	КонецЕсли;
	
	Если ДанныеМонитора.Свойство("ОбновленияВерсии") Тогда
		                 
		ОбновитьНаФормеРазделОбновленияВерсии(ДанныеМонитора);

	КонецЕсли;
	
	Если ИмяСервиса <> "" тогда                        
		Если ДанныеМонитора.Свойство(ИмяСервиса) Тогда 
			ОбновитьНаФормеРаздел(ДанныеМонитора[ИмяСервиса], ИмяСервиса);	
		КонецЕсли;
	КонецЕсли;
	

КонецПроцедуры 

&НаСервере
Процедура ОбновитьНаФормеРаздел(ДанныеСервиса, ИмяСервиса)
	
	Элементы[ИмяСервиса+"_Страницы"].ТекущаяСтраница				= Элементы[ИмяСервиса+"_СтраницаСодержание"]; 
	Элементы[ИмяСервиса+"_КартинкаОшибкаПолученияДанных"].Видимость	= ДанныеСервиса.Ошибка;
	Элементы[ИмяСервиса+"_ОшибкаАвторизации"].Видимость				= ДанныеСервиса.Ошибка;  
	Элементы[ИмяСервиса+"_ОшибкаАвторизацииОписание"].Видимость		= ДанныеСервиса.Ошибка;  
	
	Элементы[ИмяСервиса+"_КартинкаПодключен"].Видимость				= НЕ ДанныеСервиса.Ошибка;
	Элементы[ИмяСервиса+"_Совместимость"].Видимость					= НЕ ДанныеСервиса.Ошибка;
	Элементы[ИмяСервиса+"_ИнформацияОПодписке"].Видимость			= НЕ ДанныеСервиса.Ошибка;
	Элементы[ИмяСервиса+"_СписокСчетов"].Видимость					= НЕ ДанныеСервиса.Ошибка;
	
	Элементы["АвтоматическиВыписыватьСчета"+ИмяСервиса]	.Видимость  =  НЕ ДанныеСервиса.Ошибка; 
	
	Если ДанныеСервиса.Ошибка Тогда
		Возврат;	
	КонецЕсли;     
	
	ТарифУказан 		= ЗначениеЗаполнено(ДанныеСервиса.Тариф);
	СервисИспользуется 	= ДанныеСервиса.Используется;   
	
	ЭтаФорма["АвтоматическиВыписыватьСчета"+ИмяСервиса] 			= ДанныеСервиса.АвтоматическиВыписыватьСчета;
	
	Элементы[ИмяСервиса+"_КартинкаПодключен"].Видимость				= СервисИспользуется;
	Элементы[ИмяСервиса+"_КартинкаНеПодключен"].Видимость			= НЕ СервисИспользуется;
	Элементы[ИмяСервиса+"_ИнформацияОПодпискеПодключить"].Видимость	= НЕ СервисИспользуется;
	Элементы[ИмяСервиса+"_ИнформацияОПодписке"].Видимость			= СервисИспользуется;
	
	Элементы[ИмяСервиса+"_ИнформацияОПодпискеНаСервис"].Заголовок	= ТекстИнформацияОПодписке(ДанныеСервиса, СервисИспользуется);
	Элементы[ИмяСервиса+"_СписокСчетов"].Видимость 					= СервисИспользуется;
	
	Элементы[ИмяСервиса+"_ИнформацияОПодпискеКартинкаКрасный"].Видимость 	= СервисИспользуется;
	Элементы[ИмяСервиса+"_ИнформацияОПодпискеКартинкаЖелтый"].Видимость 	= НЕ СервисИспользуется;
	Элементы[ИмяСервиса+"_ИнформацияОПодпискеКартинкаЗеленый"].Видимость 	= НЕ СервисИспользуется;
	
	Элементы[ИмяСервиса+"_МинимальнаяВерсия"].Видимость		= СервисИспользуется и НЕ ДанныеСервиса.ИгнорироватьМинимальнуюВерсию и ТарифУказан;
	Элементы[ИмяСервиса+"_РекомендуемаяВерсия"].Видимость	= СервисИспользуется и НЕ ДанныеСервиса.ИгнорироватьРекомендуемуюВервсию;
	
	Элементы[ИмяСервиса+"_МинимальнаяКартинкаЗеленый"].Видимость	= СервисИспользуется и ДанныеСервиса.СоответствуетМинимальной;
	Элементы[ИмяСервиса+"_МинимальнаяКартинкаКрасный"].Видимость	= СервисИспользуется и НЕ ДанныеСервиса.СоответствуетМинимальной;
	
	Если СервисИспользуется Тогда  
		Элементы[ИмяСервиса+"_ИнформацияОПодпискеКартинкаКрасный"].Видимость 	= Не ТарифУказан;
		Элементы[ИмяСервиса+"_ИнформацияОПодпискеКартинкаЖелтый"].Видимость 	= ТарифУказан И КонецМесяца(ДанныеСервиса.ДатаОкончания) = КонецМесяца(ТекущаяДата());
		Элементы[ИмяСервиса+"_ИнформацияОПодпискеКартинкаЗеленый"].Видимость 	= ТарифУказан И КонецМесяца(ДанныеСервиса.ДатаОкончания) > КонецМесяца(ТекущаяДата());;
		
		Элементы[ИмяСервиса+"_КартинкаПодключен"].Видимость		= Элементы[ИмяСервиса+"_ИнформацияОПодпискеКартинкаЗеленый"].Видимость;
		Элементы[ИмяСервиса+"_КартинкаНеПодключен"].Видимость	= НЕ Элементы[ИмяСервиса+"_ИнформацияОПодпискеКартинкаЗеленый"].Видимость;
		
		Элементы[ИмяСервиса+"_МинимальнаяОписание"].Заголовок	= ТекстИнформацияСовместимостьМинимальная(ДанныеСервиса);
		Элементы[ИмяСервиса+"_РекомендуемаяОписание"].Заголовок	= ТекстИнформацияСовместимостьРекомендуемая(ДанныеСервиса);
	КонецЕсли;
	
	
КонецПроцедуры      



&НаСервереБезКонтекста
Функция ТекстИнформацияОПодписке(ДанныеМонитора, СервисИспользуется)
	мСтроки = Новый Массив;
	
	Если СервисИспользуется Тогда
		Если ДанныеМонитора.Тариф = "" Тогда
			мСтроки.Добавить(Новый ФорматированнаяСтрока("Нет данных о действующей подписке на сервис"));
		Иначе
			мСтроки.Добавить(Новый ФорматированнаяСтрока("Тариф: "));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(ДанныеМонитора.Тариф, Новый Шрифт(,,Истина)));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(" действует до: "));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(Формат(ДанныеМонитора.ДатаОкончания,"ДФ=dd.MM.yyyy"), Новый Шрифт(,,Истина)));
		КонецЕсли;
	Иначе
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Сервис не подключен"));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(мСтроки);	

КонецФункции  

&НаСервереБезКонтекста
Функция ТекстИнформацияСовместимостьМинимальная(ДанныеМонитора)

	Если ДанныеМонитора.Тариф = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Минимальная версия модуля ""Бухгалтерия экспедитора 8"": "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ДанныеМонитора.МинимальнаяВерсия, Новый Шрифт(,,Истина)));

	Возврат Новый ФорматированнаяСтрока(мСтроки);	
	
КонецФункции  

&НаСервереБезКонтекста
Функция ТекстИнформацияСовместимостьРекомендуемая(ДанныеМонитора)

	Если ДанныеМонитора.Тариф = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Рекомендуемая версия модуля ""Бухгалтерия экспедитора 8"": "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ДанныеМонитора.РекомендуемаяВерсия, Новый Шрифт(,,Истина)));

	Возврат Новый ФорматированнаяСтрока(мСтроки);	
	
КонецФункции

&НаСервере
Процедура ОбновитьНаФормеРазделОбновленияВерсии(Знач ДанныеМонитора)
	
	Перем ВерсияСоответствует, ОбновлениеКонфигурацииНеТребуется, РекомендуемаяВерсияБухгалтерии, СтруктураПараметров, ТекущаяВерсияБухгалтерии, ТребуетсяОбновлениеКонфигурации, ФайлПолучен;
	
	Элементы.СтраницыОбновление.ТекущаяСтраница = Элементы.СтраницаДоступноОбновление;
	
	ФайлПолучен = ДанныеМонитора.ОбновленияВерсии.НоваяВерсия <> Неопределено;
	
	Элементы.ГруппаНеУдалосьПолучитьОбновления.Видимость	= НЕ ФайлПолучен;
	Элементы.ГруппаДоступноОбновление.Видимость				= ФайлПолучен;
	
	//Обновление 
	ОбновлениеКонфигурацииНеТребуется = 
	Не ДанныеМонитора.ОбновленияВерсии.ЕстьОбновление 
	И Не ДанныеМонитора.ОбновленияВерсии.ЕстьДополнения
	И Не ДанныеМонитора.ОбновленияВерсии.ЕстьИсправление  
	И ФайлПолучен;   
	
	ТребуетсяОбновлениеКонфигурации	= 
	ДанныеМонитора.ОбновленияВерсии.ЕстьОбновление 
	ИЛИ ДанныеМонитора.ОбновленияВерсии.ЕстьИсправление 
	ИЛИ ДанныеМонитора.ОбновленияВерсии.ЕстьДополнения 
	И ФайлПолучен;
	
	Элементы.КартинкаОбновлениеНеТребуется.Видимость 		= ОбновлениеКонфигурацииНеТребуется;
	Элементы.КартинкаТребуетсяОбновление.Видимость			= ТребуетсяОбновлениеКонфигурации;
	Элементы.КартинкаНеУдалосьПолучитьОбновления.Видимость	= НЕ ФайлПолучен;
	
	Элементы.КартинкаНетОбновленийЗеленый.Видимость				= Не ДанныеМонитора.ОбновленияВерсии.ЕстьОбновление;
	Элементы.КартинкаИнформацияОбОбнолвенияхЖелтый.Видимость	= ДанныеМонитора.ОбновленияВерсии.ЕстьОбновление;
	
	Элементы.ГруппаОбратитесьКАдминистратору.Видимость 			= ДанныеМонитора.ОбновленияВерсии.ЕстьОбновление;
	
	Элементы.КартинкаНетИсправленийЗеленый.Видимость 			= НЕ ДанныеМонитора.ОбновленияВерсии.ЕстьИсправление;
	Элементы.КартинкаИнформацияОбИсправленияхЖелтый.Видимость 	= ДанныеМонитора.ОбновленияВерсии.ЕстьИсправление;
	
	Элементы.УстановитьИсправления.Видимость 					= ДанныеМонитора.ОбновленияВерсии.ЕстьИсправление;
	
	Если Не ДанныеМонитора.ОбновленияВерсии.ЕстьОбновление Тогда
		Элементы.ДекорацияИнформацияОбОбновленииКонфигурация.Заголовок = ТекстОбновлениеКонфигурацииНеТребуется(ДанныеМонитора.ОбновленияВерсии.ТекущаяВерсия) 
		
	КонецЕсли;
	
	Если ДанныеМонитора.ОбновленияВерсии.ЕстьОбновление Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Версия", 			ДанныеМонитора.ОбновленияВерсии.НоваяВерсия);
		СтруктураПараметров.Вставить("ТекущаяВерсия", 	ДанныеМонитора.ОбновленияВерсии.ТекущаяВерсия);
		
		Элементы.ДекорацияИнформацияОбОбновленииКонфигурация.Заголовок = ТекстОбновлениеКонфигурации(СтруктураПараметров);
		
	КонецЕсли;
	
	Элементы.ГруппаИнформацияОДополнениях.Видимость = ДанныеМонитора.ОбновленияВерсии.ЕстьДополнения <> Неопределено;
	Если ДанныеМонитора.ОбновленияВерсии.ЕстьДополнения <> Неопределено Тогда
		Элементы.КартинкаНетДополненийЗеленый.Видимость			= НЕ ДанныеМонитора.ОбновленияВерсии.ЕстьДополнения;
		Элементы.КартинкаИнформацияДополненийЖелтый.Видимость 	= ДанныеМонитора.ОбновленияВерсии.ЕстьДополнения;
		Элементы.УстановитьДополнения.Видимость 				= ДанныеМонитора.ОбновленияВерсии.ЕстьДополнения;
	КонецЕсли;
	
	//Версии БП
	РекомендуемаяВерсияБухгалтерии 	= CW_ВерсииПодсистемСервер.РекомендуемаяВерсияБухгалтерияПредприятия();
	ТекущаяВерсияБухгалтерии 		= CW_ВерсииПодсистемСервер.ТекущаяВерсияБухгалтерияПредприятия();
	ВерсияСоответствует 			= _БЭ.СравнитьВерсии(ТекущаяВерсияБухгалтерии, РекомендуемаяВерсияБухгалтерии); // _БЭ
	
	Элементы.КартинкаРекомнедуемаяВерсияБухгалтерияПредприятияЗеленый.Видимость = ВерсияСоответствует;
	Элементы.КартинкаРекомнедуемаяВерсияБухгалтерияПредприятияЖелтый.Видимость  = Не ВерсияСоответствует;
	
	Элементы.ДекорацияРекомнедуемаяВерсияБухгалтерияПредприятия.Заголовок = ТекстРекомендуемаяВерсия(ВерсияСоответствует,ТекущаяВерсияБухгалтерии, РекомендуемаяВерсияБухгалтерии); 
	//Версии БП
	
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Версия", 			ДанныеМонитора.ОбновленияВерсии.НоваяВерсия);
	СтруктураПараметров.Вставить("ТекущаяВерсия", 	ДанныеМонитора.ОбновленияВерсии.ТекущаяВерсия);
	
	Элементы.ДекорацияИнформацияОбОбновленииИсправления.Заголовок  = ТекстИсправления(СтруктураПараметров, ДанныеМонитора.ОбновленияВерсии.КоличествоИсправлений);
	Элементы.ДекорацияИнформацияОбОбновленииДополнения.Заголовок   = ТекстДополнения(СтруктураПараметров, ДанныеМонитора.ОбновленияВерсии.КоличествоДополнений);
	//Требуется обновление 
	
	УстановитьВидимостьРасписанийЗагрузкиРасширений();

КонецПроцедуры

&НаСервере
Процедура ОбновитьНаФормеРазделПодпискаНаОбновления(Знач ДанныеМонитора)
	
	Перем НужноОформитьПодписку;
	
	Элементы.СтраницыПодпискаНаОбновление.ТекущаяСтраница 	= Элементы.СтраницаПодпискаНаОбновление;
	Элементы.ГруппаДоступноОбновление.Видимость 			= Истина;

	АвтоматическиВыписыватьСчетаПодпискаНаОбновления 		= ДанныеМонитора.ПодпискаНаОбновления.АвтоматическиВыписыватьСчета; 
	
	НужноОформитьПодписку = ДанныеМонитора.ПодпискаНаОбновления.ПодпискаЗаканчивается 
	и Не ДанныеМонитора.ПодпискаНаОбновления.СледующаяОформлена и НЕ ДанныеМонитора.ПодпискаНаОбновления.ОшибкаПолученияДанных;
	
	Элементы.КартинкаПодпискаНаОбновленияУспешно.Видимость 		= НЕ НужноОформитьПодписку И НЕ ДанныеМонитора.ПодпискаНаОбновления.ОшибкаПолученияДанных;
	Элементы.КартинкаПодпискаНаОбновленияОтсутсвует.Видимость 	= НужноОформитьПодписку И НЕ ДанныеМонитора.ПодпискаНаОбновления.ОшибкаПолученияДанных;
	Элементы.КартинкаПодпискаНаОбновленияОшибка.Видимость 		= ДанныеМонитора.ПодпискаНаОбновления.ОшибкаПолученияДанных;
	
	Элементы.КартинкаПодпискаНаОбновлениеКрасный.Видимость 	= НЕ ДанныеМонитора.ПодпискаНаОбновления.ПодпискаФормлена  ИЛИ ДанныеМонитора.ПодпискаНаОбновления.ОшибкаПолученияДанных;
	Если ДанныеМонитора.ПодпискаНаОбновления.ПодпискаФормлена И 
		НЕ ДанныеМонитора.ПодпискаНаОбновления.ОшибкаПолученияДанных Тогда
		Элементы.КартинкаПодпискаНаОбновлениеЗеленый.Видимость	= НЕ ДанныеМонитора.ПодпискаНаОбновления.ПодпискаЗаканчивается;
		Элементы.КартинкаПодпискаНаОбновлениеЖелтый.Видимость  	= (ДанныеМонитора.ПодпискаНаОбновления.ПодпискаЗаканчивается и НЕ ДанныеМонитора.ПодпискаНаОбновления.СледующаяОформлена);
	Иначе
		Элементы.КартинкаПодпискаНаОбновлениеЗеленый.Видимость = Ложь;	
		Элементы.КартинкаПодпискаНаОбновлениеЖелтый.Видимость  = Ложь;	
	КонецЕсли;
	
	Элементы.НадписьИнформацияОПодпискеНаОбновления.Заголовок = ТекстПодпискиНаОбновление(ДанныеМонитора.ПодпискаНаОбновления);
	Элементы.ОформитьПодписку.Видимость 					= НужноОформитьПодписку;
	
	Элементы.ОбщаяКомандаCW_ЛичныйКабинетОткрытьСписокСчетовБЭ.Видимость = НЕ ДанныеМонитора.ПодпискаНаОбновления.ОшибкаПолученияДанных;

КонецПроцедуры

&НаСервере
Процедура ОбновитьНаФормеРазделРегистрационныеДанные(Знач ДанныеМонитора)
	
	Элементы.СтраницыАвторизация.ТекущаяСтраница 	= Элементы.СтраницаАвторизацияСодержание;
	
	Элементы.НадписьАвторизацияЛогинПароль.Заголовок 	= ТекстНадписиАвторизацияЛогинПароль(ДанныеМонитора.РегистрационныеДанные);															
	
	Элементы.КартинкаАвторизацияУспешно.Видимость = Ложь;
	Элементы.КартинкаАвторизацияОшибка.Видимость  = Ложь;
	
	Элементы.КартинкаАвторизацияЛогинПарольЗеленый.Видимость = Ложь;
	Элементы.КартинкаАвторизацияЛогинПарольКрасный.Видимость = Ложь;
	
	Если ДанныеМонитора.РегистрационныеДанные.АвторизацияВыполнена И 
		ДанныеМонитора.РегистрационныеДанные.ЛогинПолучен И 
		ДанныеМонитора.РегистрационныеДанные.ПарольПолучен Тогда
		
		Элементы.КартинкаАвторизацияУспешно.Видимость 			 = Истина;
		Элементы.КартинкаАвторизацияЛогинПарольЗеленый.Видимость = Истина;
	Иначе
		Элементы.КартинкаАвторизацияЛогинПарольКрасный.Видимость = Истина;
		Элементы.КартинкаАвторизацияОшибка.Видимость         	 = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ТекстОбновлениеКонфигурацииНеТребуется(ТекущаяВерсия)
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Обновление конфигурации", Новый Шрифт(,,Истина)));
	мСтроки.Добавить(Символы.ПС);
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Обновление конфигурации не требуется."));
	мСтроки.Добавить(Символы.ПС);
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Текущая версия конфигурации ""Бухгалтерия экспедитора 8"": "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ТекущаяВерсия,Новый Шрифт(,,Истина)));
	
	Возврат Новый ФорматированнаяСтрока(мСтроки);	
	
КонецФункции

&НаСервере
Функция ТекстОбновлениеКонфигурации(ОбновлениеКонфигурации)
	
	СтрокаURLНовоеВВерсии = CW_МониторПорталаПоддержкиСервер.ПолучитьURLНовойВерсии(ОбновлениеКонфигурации.ТекущаяВерсия);
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Обновление конфигурации", Новый Шрифт(,,Истина)));
	мСтроки.Добавить(Символы.ПС);
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Версия: "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ОбновлениеКонфигурации.Версия, Новый Шрифт(,,Истина)));
	мСтроки.Добавить(Новый ФорматированнаяСтрока("   "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Новое в версии",,,,СтрокаURLНовоеВВерсии));
	мСтроки.Добавить(Символы.ПС);
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Текущая версия конфигурации ""Бухгалтерия экспедитора 8"": "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ОбновлениеКонфигурации.ТекущаяВерсия, Новый Шрифт(,,Истина)));
	
	Возврат Новый ФорматированнаяСтрока(мСтроки);	
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстИсправления(ОбновлениеКонфигурации, КоличествоИсправлений)
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Исправления", Новый Шрифт(,,Истина)));
	мСтроки.Добавить(Символы.ПС);
	
	Если КоличествоИсправлений = 0 Тогда
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Исправление ошибок для версии "));
		мСтроки.Добавить(Новый ФорматированнаяСтрока(ОбновлениеКонфигурации.ТекущаяВерсия, Новый Шрифт(,,Истина)));
		мСтроки.Добавить(Новый ФорматированнаяСтрока(" "));
		мСтроки.Добавить(Новый ФорматированнаяСтрока("не требуется"));
	Иначе
		СтрокаURLИсправления = ПолучитьURLИсправлений(ОбновлениеКонфигурации.ТекущаяВерсия);
		
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Исправление ошибок для версии: "));
		мСтроки.Добавить(Новый ФорматированнаяСтрока(ОбновлениеКонфигурации.ТекущаяВерсия, Новый Шрифт(,,Истина)));
		мСтроки.Добавить(Символы.ПС);
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Исправляемые ошибки: "));
		мСтроки.Добавить(Новый ФорматированнаяСтрока(Строка(КоличествоИсправлений), Новый Шрифт(,,Истина)));
		мСтроки.Добавить(Новый ФорматированнаяСтрока("   "));
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Список исправлений",,,,СтрокаURLИсправления));
		
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(мСтроки);	
	
КонецФункции   

&НаСервереБезКонтекста
Функция ТекстДополнения(ОбновлениеКонфигурации, КоличествоДополнений)
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Дополнения", Новый Шрифт(,,Истина)));
	мСтроки.Добавить(Символы.ПС);
	
	Если КоличествоДополнений = 0 Тогда
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Новых дополнений для версии "));
		мСтроки.Добавить(Новый ФорматированнаяСтрока(ОбновлениеКонфигурации.ТекущаяВерсия, Новый Шрифт(,,Истина)));
		мСтроки.Добавить(Новый ФорматированнаяСтрока(" "));
		мСтроки.Добавить(Новый ФорматированнаяСтрока(" не обнаружено"));
	Иначе
	//	СтрокаURLИсправления = ПолучитьURLИсправлений(ОбновлениеКонфигурации.ТекущаяВерсия);
		
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Новые дополнения для версии: "));
		мСтроки.Добавить(Новый ФорматированнаяСтрока(ОбновлениеКонфигурации.ТекущаяВерсия, Новый Шрифт(,,Истина)));
		мСтроки.Добавить(Символы.ПС);
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Количество дополнений: "));
		мСтроки.Добавить(Новый ФорматированнаяСтрока(Строка(КоличествоДополнений), Новый Шрифт(,,Истина)));
	//	мСтроки.Добавить(Новый ФорматированнаяСтрока("   "));
	//	мСтроки.Добавить(Новый ФорматированнаяСтрока("Список исправлений",,,,СтрокаURLИсправления));
		
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(мСтроки);	
	
КонецФункции


&НаСервереБезКонтекста
Функция ТекстРекомендуемаяВерсия(ВерсияСоответствует,ТекущаяВерсияБухгалтерии, РекомендуемаяВерсияБухгалтерии)
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Текущая версия 1С:Бухгалтерия предприятия: "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ТекущаяВерсияБухгалтерии, Новый Шрифт(,,Истина)));
	мСтроки.Добавить(Символы.ПС);
	
	Если ВерсияСоответствует Тогда
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Соответствует рекомендуемой версии: "));
		мСтроки.Добавить(Новый ФорматированнаяСтрока(РекомендуемаяВерсияБухгалтерии, Новый Шрифт(,,Истина)));
	Иначе
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Не соответствует рекомендуемой версии: "));
		мСтроки.Добавить(Новый ФорматированнаяСтрока(РекомендуемаяВерсияБухгалтерии, Новый Шрифт(,,Истина)));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(мСтроки);	

КонецФункции

&НаСервереБезКонтекста
Функция ТекстПодпискиНаОбновление(ОписаниеПодпискиНаОбновление)
	
	Если ОписаниеПодпискиНаОбновление.ОшибкаПолученияДанных Тогда
		Возврат Новый ФорматированнаяСтрока("Ошибка авторизации");
	ИначеЕсли Не ОписаниеПодпискиНаОбновление.ПодпискаФормлена Тогда
		Возврат Новый ФорматированнаяСтрока("Действующей подписки не найдено");
	КонецЕсли;
	мСтроки = Новый Массив;
		
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Подписка на обновления модуля действует до: "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(Формат(ОписаниеПодпискиНаОбновление.ДатаОкончания,"ДФ=dd.MM.yyyy"), Новый Шрифт(,,Истина)));
	
	Возврат Новый ФорматированнаяСтрока(мСтроки);	

КонецФункции

&НаСервереБезКонтекста
Функция ТекстЛичныйКабинетИнформацияОПодписке(ОписаниеЛичныйКабинетКлиента)
	
	мСтроки = Новый Массив;
	
	Если ОписаниеЛичныйКабинетКлиента.ЛичныйКабинетИспользуется Тогда
		Если ОписаниеЛичныйКабинетКлиента.Тариф = "" Тогда
			мСтроки.Добавить(Новый ФорматированнаяСтрока("Нет данных о действующей подписке на сервис"));
		Иначе
			мСтроки.Добавить(Новый ФорматированнаяСтрока("Тариф: "));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(ОписаниеЛичныйКабинетКлиента.Тариф, Новый Шрифт(,,Истина)));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(" действует до: "));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(Формат(ОписаниеЛичныйКабинетКлиента.ДатаОкончания,"ДФ=dd.MM.yyyy"), Новый Шрифт(,,Истина)));
		КонецЕсли;
	Иначе
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Сервис не подключен"));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(мСтроки);	

КонецФункции   

&НаСервереБезКонтекста
Функция ТекстРеестрыНДС0ИнформацияОПодписке(РеестрыНДС0)
	
	мСтроки = Новый Массив;
	
	Если РеестрыНДС0.РеестрыНДС0Используется Тогда
		Если РеестрыНДС0.Тариф = "" Тогда
			мСтроки.Добавить(Новый ФорматированнаяСтрока("Нет данных о действующей подписке на сервис"));
		Иначе
			мСтроки.Добавить(Новый ФорматированнаяСтрока("Тариф: "));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(РеестрыНДС0.Тариф, Новый Шрифт(,,Истина)));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(" действует до: "));
			мСтроки.Добавить(Новый ФорматированнаяСтрока(Формат(РеестрыНДС0.ДатаОкончания,"ДФ=dd.MM.yyyy"), Новый Шрифт(,,Истина)));
		КонецЕсли;
	Иначе
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Сервис не подключен"));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(мСтроки);	

КонецФункции 


&НаСервереБезКонтекста
Функция ТекстЛичныйКабинетИнформацияОСовместимостиМинимальная(ОписаниеЛичныйКабинетКлиента)
	
	Если ОписаниеЛичныйКабинетКлиента.Тариф = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Минимальная версия модуля ""Бухгалтерия экспедитора 8"": "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ОписаниеЛичныйКабинетКлиента.МинимальнаяВерсия, Новый Шрифт(,,Истина)));

	Возврат Новый ФорматированнаяСтрока(мСтроки);	

КонецФункции

&НаСервереБезКонтекста
Функция ТекстЛичныйКабинетИнформацияОСовместимостиРекомендуемая(ОписаниеЛичныйКабинетКлиента)
	
	Если ОписаниеЛичныйКабинетКлиента.Тариф = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Рекомендуемая версия модуля ""Бухгалтерия экспедитора 8"": "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ОписаниеЛичныйКабинетКлиента.РекомендуемаяВерсия, Новый Шрифт(,,Истина)));

	Возврат Новый ФорматированнаяСтрока(мСтроки);	

КонецФункции

&НаСервереБезКонтекста
Функция ТекстРеестрыНДС0ИнформацияОСовместимостиМинимальная(ОписаниеЛичныйКабинетКлиента)
	
	Если ОписаниеЛичныйКабинетКлиента.Тариф = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Минимальная версия модуля ""Бухгалтерия экспедитора 8"": "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ОписаниеЛичныйКабинетКлиента.МинимальнаяВерсия, Новый Шрифт(,,Истина)));

	Возврат Новый ФорматированнаяСтрока(мСтроки);	

КонецФункции

&НаСервереБезКонтекста
Функция ТекстРеестрыНДС0ИнформацияОСовместимостиРекомендуемая(ОписаниеРеестрыНДС0)
	
	Если ОписаниеРеестрыНДС0.Тариф = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	мСтроки = Новый Массив;
	мСтроки.Добавить(Новый ФорматированнаяСтрока("Рекомендуемая версия модуля ""Бухгалтерия экспедитора 8"": "));
	мСтроки.Добавить(Новый ФорматированнаяСтрока(ОписаниеРеестрыНДС0.РекомендуемаяВерсия, Новый Шрифт(,,Истина)));

	Возврат Новый ФорматированнаяСтрока(мСтроки);	

КонецФункции


&НаСервереБезКонтекста
Функция ТекстНадписиАвторизацияЛогинПароль(СтруктураДанных)
	
	мСтроки = Новый Массив;
	
	Если СтруктураДанных.АвторизацияВыполнена Тогда 
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Авторизация выполнена успешно"));
	КонецЕсли;
	
	Если СтруктураДанных.ЛогинПолучен и СтруктураДанных.ПарольПолучен и НЕ СтруктураДанных.АвторизацияВыполнена Тогда 
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Ошибка авторизации"));
		мСтроки.Добавить(Символы.ПС);
		мСтроки.Добавить(Новый ФорматированнаяСтрока("По причине: Логин и/или пароль указаны неверно и/или отсутствует подписка"));
	КонецЕсли;
	
	Если Не СтруктураДанных.ЛогинПолучен или НЕ СтруктураДанных.ПарольПолучен  Тогда 
		мСтроки.Добавить(Новый ФорматированнаяСтрока("Ошибка авторизации"));
		мСтроки.Добавить(Символы.ПС);
		мСтроки.Добавить(Новый ФорматированнаяСтрока("По причине: Логин и/или пароль не указаны"));
	КонецЕсли;

	Возврат Новый ФорматированнаяСтрока(мСтроки);		
	
КонецФункции

&НаКлиенте
Процедура ОформитьПодписку(Команда)
	
	ПараметрыФормы = Новый Структура("ПрограммныйПродукт", "AF");
	ОткрытьФорму("ОбщаяФорма.CW_ФормаПродленияПодписки", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьURLИсправлений(Версия)
	
	ИмяВерсии = СтрЗаменить(Версия, ".", "_");

	ИмяКонфигурации = CW_ОбновлениеКонфигурацииСервер.ПолучитьКороткоеИмяКонфигурации();
	Если ИмяКонфигурации = "" Тогда
		Возврат ложь;
	КонецЕсли;
	
	Возврат "https://www.coralway.ru/products/programs_cw/"+ИмяКонфигурации+"/FixBugs/FixBugs%20AF8%20ver_"+ ИмяВерсии +".pdf";

КонецФункции

&НаКлиенте
Процедура УстановитьИсправления(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьИнформацииОбОбновленииКонфигуарции", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаПроверкиИсправлений",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьСервис(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродложитьПодключениеКСервису", ЭтотОбъект, Параметры);
	
	ПоказатьВопрос(Оповещение, "Будет выполнено подключение к сервису 
								|""Личный кабинет клиента"". Продолжить?", Режим, 0);
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьИнформацииОбОбновленииКонфигуарции(Результат, Параметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьДанныеФормыОбновления();
	
	НачатьПолучениеДанныхОбОбновлениях();
	
КонецПроцедуры

//Автоматическая загрузка исправлений

&НаКлиенте
Процедура ДекорацияЗагрузкаИсправленийРасписаниеНажатие(Элемент)
	
	Расписание = CW_ИсправленияКонфигурации.РасписаниеЗаданияУстановкиИсправлений();
	ДиалогРасписание = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПриИзмененииРасписанияУстановкиИсправлений",
		ЭтотОбъект);
	ДиалогРасписание.Показать(ОписаниеОповещения);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриИзмененииРасписанияУстановкиИсправлений(Расписание, Форма) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодПовтораВТечениеДня = Расписание.ПериодПовтораВТечениеДня;
	Если ПериодПовтораВТечениеДня > 0
		И ПериодПовтораВТечениеДня < 3600 Тогда
		ПоказатьПредупреждение(,
			НСтр("ru = 'Интервал автоматической установки не может быть чаще, чем один раз в час.'"));
		Возврат;
	КонецЕсли;
	
	CW_ИсправленияКонфигурации.УстановитьРасписаниеЗаданияУстановкиИсправлений(Расписание);
	
	Элементы.ДекорацияЗагрузкаИсправленийРасписание.Заголовок =
		ИнтернетПоддержкаПользователейКлиентСервер.ПредставлениеРасписания(Расписание);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяАвтоматическаяЗагрзукаИсправленийПриИзменении(Элемент)
	
	CW_ИсправленияКонфигурации.ВключитьОтключитьАвтоматическуюУстановкуИсправлений(ЗагружатьИУстанавливатьИсправленияАвтоматически);
	УстановитьВидимостьРасписанийЗагрузкиРасширений();
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗагружатьИУстанавливатьДополненияАвтоматическиПриИзменении(Элемент)
	
	CW_ИсправленияКонфигурации.ВключитьОтключитьАвтоматическуюУстановкуДополнений(ЗагружатьИУстанавливатьДополненияАвтоматически);
	УстановитьВидимостьРасписанийЗагрузкиРасширений();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРасписанийЗагрузкиРасширений()   
	
	Элементы.ДекорацияЗагрузкаИсправленийРасписание.Видимость =	ЗагружатьИУстанавливатьИсправленияАвтоматически;
	Элементы.ДекорацияЗагрузкаДополненийРасписание.Видимость = ЗагружатьИУстанавливатьДополненияАвтоматически;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗагрузкаДополненийРасписаниеНажатие(Элемент)
	
	Расписание = CW_ИсправленияКонфигурации.РасписаниеЗаданияУстановкиДополнений();
	ДиалогРасписание = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПриИзмененииРасписанияУстановкиДополнений",
		ЭтотОбъект);
	ДиалогРасписание.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРасписанияУстановкиДополнений(Расписание, Форма) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодПовтораВТечениеДня = Расписание.ПериодПовтораВТечениеДня;
	Если ПериодПовтораВТечениеДня > 0
		И ПериодПовтораВТечениеДня < 3600 Тогда
		ПоказатьПредупреждение(,
			НСтр("ru = 'Интервал автоматической установки не может быть чаще, чем один раз в час.'"));
		Возврат;
	КонецЕсли;
	
	CW_ИсправленияКонфигурации.УстановитьРасписаниеЗаданияУстановкиДополнений(Расписание);
	
	Элементы.ДекорацияЗагрузкаДополненийРасписание.Заголовок =
		ИнтернетПоддержкаПользователейКлиентСервер.ПредставлениеРасписания(Расписание);
	
КонецПроцедуры
//Автоматическая загрузка исправлений   

&НаКлиенте
Процедура АвтоматическиВыписыватьСчетаПодпискаНаОбновленияПриИзменении(Элемент)
	
	РезультатВыполнения =  ОбновитьДанныеАвтоматическойВыпискиСчетовНаСервереВФоне();   
	
	ДополнительныеПарамтеры = Новый Структура;
	ДополнительныеПарамтеры.Вставить("УстанавливаемоеЗначение", АвтоматическиВыписыватьСчетаПодпискаНаОбновления);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатИзмененияАвтоматическойВыпискиСчетов", ЭтотОбъект, ДополнительныеПарамтеры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ОбновитьДанныеАвтоматическойВыпискиСчетовНаСервереВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "ОбработатьРезультатИзмененияАвтоматическойВыпискиСчетов";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура; 
	ПараметрыПроцедуры.Вставить("Значение", АвтоматическиВыписыватьСчетаПодпискаНаОбновления);
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_МониторПорталаПоддержкиСервер.ОбновитьДанныеАвтоматическойВыпискиСчетов", ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции	
	
&НаКлиенте
Процедура ОбработатьРезультатИзмененияАвтоматическойВыпискиСчетов(РезультатВыполнения, ДополнительныеПарамтеры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда   
		Возврат; 
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ДанныеРезультата = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);  
		Если ДанныеРезультата = Неопределено Тогда 
			
			АвтоматическиВыписыватьСчетаПодпискаНаОбновления = Не ДополнительныеПарамтеры.УстанавливаемоеЗначение;
			
			ПоказатьПредупреждение(,"Не удалось изменить автоматическую выписку счетов.
			|Попробуйте позже.");
			
		Иначе   
			Если ДанныеРезультата.КодСостояния <> 200 Тогда
				АвтоматическиВыписыватьСчетаПодпискаНаОбновления= Не ДополнительныеПарамтеры.УстанавливаемоеЗначение ;
			КонецЕсли
		КонецЕсли
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		АвтоматическиВыписыватьСчетаПодпискаНаОбновления = Не ДополнительныеПарамтеры.УстанавливаемоеЗначение;
		
		ПоказатьПредупреждение(, 	"Не удалось изменить автоматическую выписку счетов.
		|Попробуйте позже.");
		
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура Надпись_ЛичныйКабинетКлиента_МониторПодержкиНажатие(Элемент) 
	
	СтруктураПараметров = ПолучитьСтруктуруПараметров();
	ОткрытьФорму("ОбщаяФорма.CW_ЛичныйКабинетКлиента_МониторПодержки", СтруктураПараметров,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Надпись_РеестрыНДС0_МониторПодержкиНажатие(Элемент)
	СтруктураПараметров = ПолучитьСтруктуруПараметров();
	ОткрытьФорму("ОбщаяФорма.CW_РеестрыНДС0_МониторПодержки", СтруктураПараметров,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Надпись_ДоходыНерезидентовНажатие(Элемент)
	СтруктураПараметров = ПолучитьСтруктуруПараметров();
	ОткрытьФорму("ОбщаяФорма.CW_ДоходыНерезидентов_МониторПодержки", СтруктураПараметров,ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров()
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РегистрационныйНомер", РегистрационныйНомер);
	
	Возврат СтруктураПараметров;
	
КонецФункции
