#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализируем реквизиты формы, которые будут передаваться
	// в качестве параметров команд, расположенных в данной панели
	Организация = Параметры.Организация;
	Период = Параметры.Период;
	
	ПараметрыОпции = Новый Структура;
	ПараметрыОпции.Вставить("Организация", Организация);
	ПараметрыОпции.Вставить("Период", Период);
	
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыОпции);
	
КонецПроцедуры

#КонецОбласти