
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды", ПараметрКоманды);
	ДополнительныеПараметры.Вставить("Источник", 		ПараметрыВыполненияКоманды.Источник);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПередНачаломКопированияПараметров", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Настройки группы пользователя будут скопированы из выбранного объекта. Продолжить?", Режим, 0);
	
КонецПроцедуры     


&НаКлиенте
Процедура ПередНачаломКопированияПараметров(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОпвещения = Новый ОписаниеОповещения("ПродолжитьКопированиеПараметров", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.CW_ГруппыПользователей.ФормаВыбора", , ДополнительныеПараметры.Источник,,,,ОписаниеОпвещения); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьКопированиеПараметров(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	НачатькопированиеНастроекНаСервере(ДополнительныеПараметры.ПараметрКоманды, РезультатВыбора);   
	
	Оповестить("КопированиеНастроек", ДополнительныеПараметры.ПараметрКоманды);
	
КонецПроцедуры  

&НаСервере
Процедура НачатькопированиеНастроекНаСервере(ПараметрКоманды, ИсточникНастроек)
	
	ПриемникНастроекОбъект = ПараметрКоманды.ПолучитьОбъект();
	
	МетаданныеИсточника = Метаданные.Справочники.CW_ГруппыПользователей;
	
	Для Каждого Реквизит из МетаданныеИсточника.Реквизиты Цикл 
		
		Если Реквизит.Тип = Новый ОписаниеТипов("ХранилищеЗначения") Тогда
			ПриемникНастроекОбъект[Реквизит.Имя] = Новый ХранилищеЗначения(ИсточникНастроек[Реквизит.Имя].Получить());	
		Иначе
			ПриемникНастроекОбъект[Реквизит.Имя] = ИсточникНастроек[Реквизит.Имя]; 
		КонецЕсли;
	КонецЦикла;    
	
	ПриемникНастроекОбъект.ДоступныеТипыГрузоперевозок.Загрузить(ИсточникНастроек.ДоступныеТипыГрузоперевозок.Выгрузить());
	
	ПриемникНастроекОбъект.ОбменДанными.Загрузка = истина;
	ПриемникНастроекОбъект.ЗаписатЬ();
	
	//подчиненные настройки 
	
	//CW_ДоступныеСправочникиПоГруппамПользователей
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	&ГруппаПользователяПриемник КАК ГруппаПользователя,
	|	CW_ДоступныеСправочникиПоГруппамПользователей.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных
	|ИЗ
	|	РегистрСведений.CW_ДоступныеСправочникиПоГруппамПользователей КАК CW_ДоступныеСправочникиПоГруппамПользователей
	|ГДЕ
	|	CW_ДоступныеСправочникиПоГруппамПользователей.ГруппаПользователя = &ГруппаПользователя"; 
	
	Запрос.УстановитьПараметр("ГруппаПользователя", 		ИсточникНастроек);
	Запрос.УстановитьПараметр("ГруппаПользователяПриемник", ПараметрКоманды); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Набор = РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.СоздатьНаборЗаписей();
		Набор.Отбор.ГруппаПользователя.Установить(ПараметрКоманды);
		Набор.Прочитать();
		Набор.Загрузить(РезультатЗапроса.Выгрузить());  
		Набор.Записать(Истина);                
	КонецЕсли;
	//--CW_ДоступныеСправочникиПоГруппамПользователей 
	
	
	//CW_ПраваДоступаДляСтатейДДС
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	&ГруппаПользователяПриемник КАК ГруппаПользователя,
	|	CW_ПраваДоступаДляСтатейДДС.СтатьяДДС КАК СтатьяДДС,
	|	CW_ПраваДоступаДляСтатейДДС.Использование КАК Использование
	|ИЗ
	|	РегистрСведений.CW_ПраваДоступаДляСтатейДДС КАК CW_ПраваДоступаДляСтатейДДС
	|ГДЕ
	|	CW_ПраваДоступаДляСтатейДДС.ГруппаПользователя = &ГруппаПользователя"; 
	
	Запрос.УстановитьПараметр("ГруппаПользователя", 		ИсточникНастроек);
	Запрос.УстановитьПараметр("ГруппаПользователяПриемник", ПараметрКоманды); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Набор = РегистрыСведений.CW_ПраваДоступаДляСтатейДДС.СоздатьНаборЗаписей();
		Набор.Отбор.ГруппаПользователя.Установить(ПараметрКоманды);
		Набор.Прочитать();
		Набор.Загрузить(РезультатЗапроса.Выгрузить());  
		Набор.Записать(Истина); 
	КонецЕсли;
	//--CW_ПраваДоступаДляСтатейДДС  
	
	//CW_ДоступностьСтатусовПоГруппамПользователей
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	&ГруппаПользователяПриемник КАК ГруппаПользователя,
	|	CW_ДоступностьСтатусовПоГруппамПользователей.СтатусДокумента КАК СтатусДокумента
	|ИЗ
	|	РегистрСведений.CW_ДоступностьСтатусовПоГруппамПользователей КАК CW_ДоступностьСтатусовПоГруппамПользователей
	|ГДЕ
	|	CW_ДоступностьСтатусовПоГруппамПользователей.ГруппаПользователя = &ГруппаПользователя"; 
	
	Запрос.УстановитьПараметр("ГруппаПользователя", 		ИсточникНастроек);
	Запрос.УстановитьПараметр("ГруппаПользователяПриемник", ПараметрКоманды); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Набор = РегистрыСведений.CW_ДоступностьСтатусовПоГруппамПользователей.СоздатьНаборЗаписей();
		Набор.Отбор.ГруппаПользователя.Установить(ПараметрКоманды);
		Набор.Прочитать();
		Набор.Загрузить(РезультатЗапроса.Выгрузить());  
		Набор.Записать(Истина); 
	КонецЕсли;
	//--CW_ДоступностьСтатусовПоГруппамПользователей
	
	//CW_ДоступноИнициацияСогласования
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	&ГруппаПользователяПриемник КАК ГруппаПользователей,
	|	CW_ДоступноИнициацияСогласования.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных,
	|	CW_ДоступноИнициацияСогласования.Доступно КАК Доступно
	|ИЗ
	|	РегистрСведений.CW_ДоступноИнициацияСогласования КАК CW_ДоступноИнициацияСогласования
	|ГДЕ
	|	CW_ДоступноИнициацияСогласования.ГруппаПользователей = &ГруппаПользователей"; 
	
	Запрос.УстановитьПараметр("ГруппаПользователей", 		ИсточникНастроек);
	Запрос.УстановитьПараметр("ГруппаПользователяПриемник", ПараметрКоманды); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Набор = РегистрыСведений.CW_ДоступноИнициацияСогласования.СоздатьНаборЗаписей();
		Набор.Отбор.ГруппаПользователей.Установить(ПараметрКоманды);
		Набор.Прочитать();
		Набор.Загрузить(РезультатЗапроса.Выгрузить());  
		Набор.Записать(Истина); 
	КонецЕсли;
	//--CW_ДоступноИнициацияСогласования 
	
	//CW_ШаблоныДокументовПраваДоступа
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	&ГруппаПользователяПриемник КАК ГруппаПользователя,
	|	CW_ШаблоныДокументовПраваДоступа.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных,
	|	CW_ШаблоныДокументовПраваДоступа.РедактированиеОбщегоШаблона КАК РедактированиеОбщегоШаблона,
	|	CW_ШаблоныДокументовПраваДоступа.РедактированиеШаблонаДокумента КАК РедактированиеШаблонаДокумента,
	|	CW_ШаблоныДокументовПраваДоступа.РедактированиеМакросовШаблона КАК РедактированиеМакросовШаблона
	|ИЗ
	|	РегистрСведений.CW_ШаблоныДокументовПраваДоступа КАК CW_ШаблоныДокументовПраваДоступа
	|ГДЕ
	|	CW_ШаблоныДокументовПраваДоступа.ГруппаПользователя = &ГруппаПользователя"; 
	
	Запрос.УстановитьПараметр("ГруппаПользователя", 		ИсточникНастроек);
	Запрос.УстановитьПараметр("ГруппаПользователяПриемник", ПараметрКоманды); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Набор = РегистрыСведений.CW_ШаблоныДокументовПраваДоступа.СоздатьНаборЗаписей();
		Набор.Отбор.ГруппаПользователя.Установить(ПараметрКоманды);
		Набор.Прочитать();
		Набор.Загрузить(РезультатЗапроса.Выгрузить());  
		Набор.Записать(Истина); 
	КонецЕсли;
	//--CW_ШаблоныДокументовПраваДоступа
	
КонецПроцедуры
