#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	// --- 
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// ---
//	НастройкиСКД.Выбор.Элементы.Очистить();
	НастройкиСКД.Структура.Очистить();
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	
	//Параметры вывода
	СтркутураПараметров = Новый Структура;
	СтркутураПараметров.Вставить("Заголовок"					, ВРег(МетаданныеОтчета.Синоним));
	СтркутураПараметров.Вставить("РасположениеРеквизитов"		, ?(Настройки.ОбъединитьГруппировки,РасположениеРеквизитовКомпоновкиДанных.Отдельно			, РасположениеРеквизитовКомпоновкиДанных.ВСпециальнойПозиции));
	СтркутураПараметров.Вставить("РасположениеГруппировки"		, ?(Настройки.ОбъединитьГруппировки,РасположениеГруппировкиКомпоновкиДанных.Конец			, Неопределено));
	СтркутураПараметров.Вставить("РасположениеПолейГруппировки"	, ?(Настройки.ОбъединитьГруппировки,РасположениеПолейГруппировкиКомпоновкиДанных.Отдельно	, Неопределено));
	СтркутураПараметров.Вставить("ТипЗаголовкаПолей"			, ?(Настройки.ОбъединитьГруппировки,ТипЗаголовкаПолейКомпоновкиДанных.Краткий				, Неопределено));
	
	CW_Отчеты.УстановитьПараметрыВыводаКомпоновкиДанных(НастройкиСКД, СтркутураПараметров);
	
	//Параметры данных
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("НачалоПериода"				, НачалоДня(Настройки.НачалоПериода), НастройкиСКД.ПараметрыДанных);
	CW_Отчеты.УстановитьЗначениеПараметраДанныхКомпоновкиДанных("КонецПериода"				, КонецДня(Настройки.КонецПериода)	, НастройкиСКД.ПараметрыДанных);
	
	//----
	//Выбранные поля
	мПоляОтчета = Настройки.Группировки.ВыгрузитьКолонку("ИмяПоля");
	CW_Отчеты.УстановитьВыбранныеПоляКомпоновкиДанных(НастройкиСКД 	, мПоляОтчета);	
	
	//----
	//Дополним выбранные поля выбранными показателями
//	CW_Отчеты.УстановитьПоказателиКомпоновкиДанных(НастройкиСКД 		, Настройки.Показатели);	
	
	
	//Выбранные поля
	// обрабатываем разделы и показатели
	Для каждого Поле Из НастройкиСКД.Выбор.Элементы Цикл
		Если ТипЗнч(Поле)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			// план-факт-отклонение
			Элемент = Настройки.Разделы.НайтиПоЗначению(Строка(Поле.Поле));
			Если Не Элемент = Неопределено Тогда
				Поле.Использование = Элемент.Пометка;
			КонецЕсли; 
			
			Если Поле.Использование Тогда
				// проходим по подчинённым элементам "расходы-доходы-прибыль"
				Для каждого ПодРаздел Из Поле.Элементы Цикл
					Если ТипЗнч(ПодРаздел)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
						ИмяПодраздела = СтрЗаменить(Строка(Подраздел.Поле),Строка(Поле.Поле)+".","");
						Если ПодРаздел.Использование Тогда
							// проходим по подчинённым элементам
							Для каждого Показатель Из ПодРаздел.Элементы Цикл
								ИмяПоля = СтрЗаменить(Строка(Показатель.Поле),Строка(Поле.Поле)+"."+ИмяПодраздела+"."+Строка(Поле.Поле)+ИмяПодраздела,"");
								Показатель.Использование = Настройки.Показатели.НайтиПоЗначению(ИмяПоля).Пометка;
							КонецЦикла;
						КонецЕсли; 
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		Иначе
			НастройкиСКД.Выбор.Элементы.Удалить(Поле);
		КонецЕсли; 
	КонецЦикла; 
	
	//----
	// формируем структуру отчета по группировкам
	CW_Отчеты.УстановитьГруппировкиОтчетаКомпановкиДанных(НастройкиСКД.Структура, Настройки.Группировки, Настройки.ОбъединитьГруппировки);
	
КонецПроцедуры

#КонецЕсли