
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры,
		"КлючСтроки,АдресТаблицыОбеспечительныеПлатежи,РазрешеноРедактироватьСуммуКОтражению");
		
	ТаблицаОбеспечительныеПлатежи = ПолучитьИзВременногоХранилища(АдресТаблицыОбеспечительныеПлатежи);
	
	ДокументОтраженияДОПП.ОбеспечительныеПлатежи.Очистить();
	ДокументОтраженияДОПП.ОбеспечительныеПлатежи.Загрузить(ТаблицаОбеспечительныеПлатежи);
	
	УстановитьУсловноеОформление();
	ЗаполнитьСписокВыбораКБК();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗавершениеРаботы И (Модифицированность ИЛИ ПеренестиВДокумент) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность И НЕ ПеренестиВДокумент Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемФормыЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
	КонецЕсли;
	
	Если ПеренестиВДокумент И НЕ Отказ Тогда
		Отказ = НЕ ПроверитьЗаполнениеНаКлиенте();
	КонецЕсли;
	
	Если Отказ Тогда
		ПеренестиВДокумент = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВДокумент Тогда
		
		СтруктураРезультат = ПриЗакрытииНаСервере();
		
		Оповестить("РедактированиеОбеспечительныхПлатежей", СтруктураРезультат, ЭтотОбъект.ВладелецФормы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицы

&НаКлиенте
Процедура ОбеспечительныеПлатежиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ДанныеСтроки = Элементы.ОбеспечительныеПлатежи.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		ДанныеСтроки.КлючСтроки = КлючСтроки;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбеспечительныеПлатежиКБКНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",       НСтр("ru = 'Выбор КБК'"));
	ПараметрыФормы.Вставить("ТаблицаЗначений", СписокКБК);
	
	ДанныеСтроки = Элементы.ОбеспечительныеПлатежи.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.КБК) Тогда
		ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура("Код", СокрЛП(ДанныеСтроки.КБК)));
	Иначе
		ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура("Код", КБКНДСПриВвозеТоваров));
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбеспечительныеПлатежиВыборКБКЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы",
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор, , ,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечительныеПлатежиОбеспечительныйПлатежВсегоПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.ОбеспечительныеПлатежи.ТекущиеДанные;
	ДанныеСтроки.ОбеспечительныйПлатежКОтражению = ДанныеСтроки.ОбеспечительныйПлатежВсего;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечительныеПлатежиОбеспечительныйПлатежКОтражениюПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.ОбеспечительныеПлатежи.ТекущиеДанные;
	ДанныеСтроки.КДоплате = ДанныеСтроки.НачисленоПриВвозе - ДанныеСтроки.ОбеспечительныйПлатежКОтражению;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПеренестиВДокумент = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Модифицированность = Ложь;
	ПеренестиВДокумент = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросПередЗакрытиемФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокумент = Истина;
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		ПеренестиВДокумент = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеНаКлиенте()
	
	Отказ = Ложь;
	ИмяСписка = НСтр("ru = 'Обеспечительные платежи'");
	
	Для Индекс = 0 По ДокументОтраженияДОПП.ОбеспечительныеПлатежи.Количество() - 1 Цикл
		
		СтрокаОбеспечительныеПлатежи = ДокументОтраженияДОПП.ОбеспечительныеПлатежи[Индекс];
		Префикс = "ДокументОтраженияДОПП.ОбеспечительныеПлатежи[%1]";
		Префикс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Префикс, Формат(Индекс, "ЧН=0; ЧГ="));
		
		Если Не ЗначениеЗаполнено(СтрокаОбеспечительныеПлатежи.КБК) Тогда
			Поле = Префикс + ".КБК";
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'КБК'"),
				Индекс + 1, ИмяСписка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Функция ПриЗакрытииНаСервере()
	
	ТаблицаОбеспечительныеПлатежи = ДокументОтраженияДОПП.ОбеспечительныеПлатежи.Выгрузить();
	АдресТаблицыОбеспечительныеПлатежи = ПоместитьВоВременноеХранилище(ТаблицаОбеспечительныеПлатежи, УникальныйИдентификатор);
	
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("КлючСтроки", КлючСтроки);
	СтруктураРезультат.Вставить("АдресТаблицыОбеспечительныеПлатежи", АдресТаблицыОбеспечительныеПлатежи);
	
	Возврат СтруктураРезультат;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОбеспечительныеПлатежиОбеспечительныйПлатежКОтражению");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"РазрешеноРедактироватьСуммуКОтражению", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораКБК()
	
	КБКРаздел4            = УчетНДСОтчетыПереопределяемый.СписокВыбораКБККосвенныеНалоги();
	КБКНДСПриВвозеТоваров = УчетНДСОтчетыПереопределяемый.КБКНДСПриВвозеТоваров();
	
	СписокКБК.Очистить();
	СписокКБК.Загрузить(КБКРаздел4);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечительныеПлатежиВыборКБКЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Элементы.ОбеспечительныеПлатежи.ТекущиеДанные;
	ДанныеСтроки.КБК = РезультатВыбора.Код;
	
КонецПроцедуры

#КонецОбласти
