
&НаКлиенте
Процедура СписокУслугПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если СписокУслуг.Количество()= 1 тогда
			Отказ = истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОграничиватьУслугиПоДоговорам 				= ПолучитьФункциональнуюОпцию("CW_ОграничиватьУслугиПоДоговорам");
	ИспользованиеСхемыПеревыставленияПоСтавкам 	= ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
	
	//Услуги по договру
	Если ОграничиватьУслугиПоДоговорам Тогда
		ЕстьОграниченияПоСпискуУслуг =?(ЗначениеЗаполнено(Запись.Договор), Запись.Договор.ОграничиватьНоменклатуру, Ложь);
		Если ЕстьОграниченияПоСпискуУслуг Тогда
			АдресУслугПоДоговору = _УФС.ОбновитьСписокУслугПоДоговору(ТекущаяДата(),Запись.Договор, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= ТекущаяДата();
	СтруктураПараметров.Договор 			= Запись.Договор;
	
	Если Запись.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком тогда
		
		ПараметрыДоговора			= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "ОсновнойПорядокОтраженияРасходов");
		ОсновнойПорядокОтражения	= ПараметрыДоговора.ОсновнойПорядокОтраженияРасходов;
		
		ЗависимыеУслугиУчитыватьГруз				= ПолучитьФункциональнуюОпцию("CW_ЗависимыеУслугиУчитыватьГрузПоВходящим");
		ЗависимыеУслугиУчитыватьКлиентаПоВходящим 	= ПолучитьФункциональнуюОпцию("CW_ЗависимыеУслугиУчитыватьКлиентаПоВходящим");
		
		Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление);
		Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Затраты);
		
		Если ИспользованиеСхемыПеревыставленияПоСтавкам Тогда
			Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам);
		КонецЕсли;	
	
	ИначеЕсли  Запись.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем тогда
		
		ПараметрыДоговора			= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "ОсновнойПорядокОтраженияДоходов");
		ОсновнойПорядокОтражения	= ПараметрыДоговора.ОсновнойПорядокОтраженияДоходов;
		
		ЗависимыеУслугиУчитыватьГруз 				= ПолучитьФункциональнуюОпцию("CW_ЗависимыеУслугиУчитыватьГрузПоИсходящим");
		ЗависимыеУслугиУчитыватьКлиентаПоВходящим 	= Ложь;
		
		Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление);
		Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга);
		
		Если ИспользованиеСхемыПеревыставленияПоСтавкам Тогда
			Элементы.СписокУслугПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам);
		КонецЕсли;		
	
	КонецЕсли;
		
	Если Параметры.Ключ.Пустой() Тогда
		НоваяСтрока 					= СписокУслуг.Добавить();
		НоваяСтрока.ПорядокОтражения 	= ОсновнойПорядокОтражения;
	Иначе
		ЗаполнитьДанныеСтроки();
	КонецЕсли;
	
	Элементы.Клиент.Видимость 	= ЗависимыеУслугиУчитыватьКлиентаПоВходящим;
	Элементы.Груз.Видимость 	= ЗависимыеУслугиУчитыватьГруз;
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.УслугаДокумента);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияПоСпискуУслуг);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.СписокУслугНоменклатура);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияПоСпискуУслуг);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСтроки()
	
	НоваяСтрока = СписокУслуг.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыСтроки(СтрокаТекущая)
	
	СтрокаТекущая.Сумма = СтрокаТекущая.Цена * СтрокаТекущая.Количество;
	СтрокаТекущая.НДС = СтрокаТекущая.Сумма * СтавкаНДС(СтрокаТекущая.СтавкаНДС)/100;
	СтрокаТекущая.Всего = СтрокаТекущая.Сумма + СтрокаТекущая.НДС;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугКоличествоПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.СписокУслуг.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура СписокУслугЦенаПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.СписокУслуг.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугСуммаПриИзменении(Элемент)
	
	СуммаПриИзменении(Элементы.СписокУслуг.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура СуммаПриИзменении(ТекущаяСтрока)
	
	СтрокаТекущая 		= СписокУслуг.НайтиПоИдентификатору(ТекущаяСтрока);
	
	СтрокаТекущая.Цена 	= _сф.БезопасноРазделить(СтрокаТекущая.Сумма,СтрокаТекущая.Количество);
	Ставка 				= CW_Финансы.ПолучитьСтавкуНДС(СтрокаТекущая.СтавкаНДС);
	СтрокаТекущая.НДС 	= CW_Финансы.РассчитатьСуммуНДС(СтрокаТекущая.Сумма, Истина, Ложь, Ставка);
	СтрокаТекущая.Всего = СтрокаТекущая.Сумма + СтрокаТекущая.НДС;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокУслугСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСуммыСтроки(Элементы.СписокУслуг.ТекущиеДанные);

КонецПроцедуры


&НаКлиенте
Процедура СписокУслугНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокУслуг.ТекущиеДанные;
	
	ТекущиеДанные.Всего = ТекущиеДанные.Сумма + ТекущиеДанные.НДС;

КонецПроцедуры


&НаКлиенте
Процедура СписокУслугВсегоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокУслуг.ТекущиеДанные;
	
	
	Ставка 				= СтавкаНДС(ТекущиеДанные.СтавкаНДС)/100;
	ТекущиеДанные.НДС 	= ТекущиеДанные.Всего*Ставка/(1+Ставка);
	ТекущиеДанные.Сумма = ТекущиеДанные.Всего - ТекущиеДанные.НДС;
	ТекущиеДанные.Цена 	= _сф.БезопасноРазделить(ТекущиеДанные.Сумма,ТекущиеДанные.Количество);

КонецПроцедуры

&НаКлиенте
Функция СтавкаНДС(Ставка)
	
	Возврат CW_Финансы.ПолучитьСтавкуНДС(Ставка);
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекущаяСтрока = СписокУслуг[0];
	
	ЗаполнитьЗначенияСвойств(Запись, ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугПередУдалением(Элемент, Отказ)
	
	Откза = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	//Услуги по договру
	Если ОграничиватьУслугиПоДоговорам Тогда
		ЕстьОграниченияПоСпискуУслуг =?(ЗначениеЗаполнено(Запись.Договор), Запись.Договор.ОграничиватьНоменклатуру, Ложь);
		Если ЕстьОграниченияПоСпискуУслуг Тогда
			АдресУслугПоДоговору = _УФС.ОбновитьСписокУслугПоДоговору(ТекущаяДата(),Запись.Договор, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.УслугаДокумента);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияПоСпискуУслуг);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.СписокУслугНоменклатура);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияПоСпискуУслуг);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокУслуг.ТекущиеДанные;
	ТекущиеДанные.СтавкаНДС =  ПолучитьСтавкуНДС(ТекущиеДанные.Номенклатура);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтавкуНДС(тНоменклатура)
	
	Возврат  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(тНоменклатура);
	
КонецФункции

&НаКлиенте
Процедура УслугаДокументаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЕстьОграниченияПоСпискуУслуг Тогда
	//	СтандартнаяОбработка	= Ложь;
		ДанныеВыбора			= Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(_УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору));
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура СписокУслугНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЕстьОграниченияПоСпискуУслуг Тогда
	//	СтандартнаяОбработка	= Ложь;
		ДанныеВыбора			= Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(_УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору));
	КонецЕсли;
	
КонецПроцедуры


