&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Аналитика     = ?(Параметры.Свойство("Заказ"), Параметры.Заказ, Параметры.Грузоперевозка);
	ВерсияБюджета = Параметры.ВерсияБюджета;
	Обработка     = Параметры.Обработка;
	
	СтавкаБезНДС = Перечисления.СтавкиНДС.БезНДС;
	Валюта       = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ПрочитатьНастройкиНаСервере();
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = _БЭ.ОсновнаяОрганизация();
	КонецЕсли;
	
	ЗагрузитьТЧ();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ЗаписатьНастройкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТЧ()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_ДТГрузоперевозок.ПроектДТ.НомерГТД КАК НомерГТД,
	|	CW_ДТГрузоперевозок.ПроектДТ.Клиент КАК Клиент,
	|	CW_ДТГрузоперевозок.Номенклатура КАК Номенклатура,
	|	CW_ДТГрузоперевозок.ПроектДТ,
	|	CW_ДТГрузоперевозок.РасчетДТ,
	|	CW_ДТГрузоперевозок.ПроектДТ.Импортер КАК Импортер,
	|	CW_ДТГрузоперевозок.ПроектДТ.Валюта КАК Валюта,
	|	CW_ДТГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	|	СУММА(CW_ДТГрузоперевозок.ВсегоРуб) КАК ВсегоРуб,
	|	СУММА(CW_ДТГрузоперевозок.НетарифкаРуб) КАК НетарифкаРуб,
	|	СУММА(CW_ДТГрузоперевозок.БрокерскиеУслугиРуб) КАК БрокерскиеУслугиРуб
	|ПОМЕСТИТЬ ВТ_Грузоперевозки
	|ИЗ
	|	РегистрСведений.CW_ДТГрузоперевозок КАК CW_ДТГрузоперевозок
	|ГДЕ
	|	CW_ДТГрузоперевозок.ПроектДТ.Аналитика = &Аналитика
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДТГрузоперевозок.ПроектДТ.НомерГТД,
	|	CW_ДТГрузоперевозок.ПроектДТ.Валюта,
	|	CW_ДТГрузоперевозок.ПроектДТ.Импортер,
	|	CW_ДТГрузоперевозок.ПроектДТ.Клиент,
	|	CW_ДТГрузоперевозок.Грузоперевозка,
	|	CW_ДТГрузоперевозок.Номенклатура,
	|	CW_ДТГрузоперевозок.РасчетДТ,
	|	CW_ДТГрузоперевозок.ПроектДТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Грузоперевозки.НомерГТД,
	|	ВТ_Грузоперевозки.Клиент,
	|	ВТ_Грузоперевозки.РасчетДТ,
	|	ВТ_Грузоперевозки.ПроектДТ КАК ПроектДТ,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДС,
	|	ВТ_Грузоперевозки.Импортер,
	|	ВТ_Грузоперевозки.Валюта,
	|	ВТ_Грузоперевозки.Грузоперевозка,
	|	СУММА(ВТ_Грузоперевозки.ВсегоРуб) КАК ВсегоРуб,
	|	СУММА(ВТ_Грузоперевозки.НетарифкаРуб) КАК НетарифкаРуб,
	|	ВТ_Грузоперевозки.БрокерскиеУслугиРуб
	|ИЗ
	|	ВТ_Грузоперевозки КАК ВТ_Грузоперевозки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Грузоперевозки.Валюта,
	|	ВТ_Грузоперевозки.РасчетДТ,
	|	ВТ_Грузоперевозки.НомерГТД,
	|	ВТ_Грузоперевозки.ПроектДТ,
	|	ВТ_Грузоперевозки.Грузоперевозка,
	|	ВТ_Грузоперевозки.Импортер,
	|	ВТ_Грузоперевозки.Клиент,
	|	ВТ_Грузоперевозки.БрокерскиеУслугиРуб
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроектДТ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Аналитика", Аналитика);
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	КешТаблицаДеклараций.Загрузить(ТЗ);
	
	ТЗ.Свернуть("НомерГТД,Клиент,Импортер,Валюта,ПроектДТ", "ВсегоРуб,НетарифкаРуб");
	
	ТаблицаДеклараций.Загрузить(ТЗ);
	
	Если ТаблицаДеклараций.Количество() = 1 Тогда
		ТаблицаДеклараций[0].Выбрана = Истина;
	КонецЕсли; 
	
//-------------------------------------------------------------------------------------------------------------------
		
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	Если НЕ _ПроверитьНастройки() Тогда
		Возврат;
	КонецЕсли;

	Отказ = Ложь;
	ЗаполнитьВыбранныйПроектНаСервере(Отказ);
	
	//Если НЕ Отказ Тогда
	//	ЗаполнитьСписокСтавокНДСНаСервере();
	//Иначе	
	//	Возврат;
	//КонецЕсли; 
	//
	//Если Не СписокСтавкиНДС.Количество() = 1 Тогда
	//	ПОВ =  Новый ОписаниеОповещения("ПослеВводаЗначенияСтавкиНДС", ЭтотОбъект);
	//	ПоказатьВводЗначения(ПОВ,  СтавкаНДС, "Выберите ставку НДС");
	//Иначе
	//	СтавкаНДС = СписокСтавкиНДС[0].Значение;
	//КонецЕсли; 
	//
	//Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
	//	Отказ = Истина;
	//КонецЕсли; 
	
	Если НЕ Отказ Тогда
		ЗаполнитьБюджетНаСервере();
	КонецЕсли; 
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияСтавкиНДС(ВыбЗнач, ДополнительныеПараметры) Экспорт
	
	Если Не ВыбЗнач = Неопределено Тогда
        СтавкаНДС = ВыбЗнач;
    КонецЕсли;
	
КонецПроцедуры


//-------------------------------------------------------------------------------------------------------------------

&НаСервере
Процедура ЗаполнитьВыбранныйПроектНаСервере(Отказ)
	
	Отбор = Новый Структура("Выбрана", Истина);
	НайденныеСтроки = ТаблицаДеклараций.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Сообщить("Не выбрана таможенная декларация!");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	ВыбранныйПроектДТ = НайденныеСтроки[0].ПроектДТ;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСтавокНДСНаСервере()
	
	Отбор = Новый Структура("ПроектДТ", ВыбранныйПроектДТ);
	ТаблицаСтавок = КешТаблицаДеклараций.Выгрузить(Отбор, "СтавкаНДС");
	ТаблицаСтавок.Свернуть("СтавкаНДС");
	
	Для каждого Стр Из ТаблицаСтавок Цикл
		СписокСтавкиНДС.Добавить(Стр.СтавкаНДС);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБюджетНаСервере()
	
	Отбор = Новый Структура("ПроектДТ", ВыбранныйПроектДТ);
	ТаблицаДляОбхода = КешТаблицаДеклараций.Выгрузить(Отбор); 
	ТаблицаДляОбхода.Свернуть("Грузоперевозка","ВсегоРуб, НетарифкаРуб, БрокерскиеУслугиРуб"); 

	УчитыватьНДСВСебестоимости = CW_Настройки.ПараметрУчетнойПолитики(ТекущаяДата(), Организация, "УчитыватьНДСВСебестоимости");
	
	Для Каждого Стр из ТаблицаДляОбхода Цикл
		
		// Там. платежи
		СтавкаНДСПроцент = _БЭ.ПолучитьСтавкуНДС(СтавкаНДС);
		СуммаВсего = Стр.ВсегоРуб;
		
		Если СуммаВсего = 0 Тогда
			Продолжить;
		КонецЕсли;   
		
		ДанныеКурса = CW_Финансы.ПолучитьКурсВалюты(Валюта.Валюта, ТекущаяДата());
		
		СуммаНДС = 0;
		Сумма    = СуммаВсего - СуммаНДС;

		Спр = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьЭлемент();
		Спр.Владелец                = Стр.Грузоперевозка;
		Спр.ВидСтатьиПланирования   = Перечисления.CW_ВидыСтатейПланирования.Расходы;
		Спр.Контрагент              = ТамПлатежи_Контрагент;
		Спр.ВерсияБюджета           = ВерсияБюджета;
		Спр.Валюта                  = Валюта;    
		Спр.УчитыватьНДСВСебестоимости = УчитыватьНДСВСебестоимости;    
		
		Спр.Курс					= ДанныеКурса.Курс;   
		Спр.Кратность				= ДанныеКурса.Кратность;   
		
		Спр.Организация             = Организация;
		Спр.Номенклатура            = ТамПлатежи_Номенклатура;
		Спр.ПорядокОтраженияРасходов= Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		Спр.Сумма                   = Сумма;
		Спр.СтавкаНДС               = СтавкаБезНДС;
		Спр.СуммаНДС                = СуммаНДС;
		Спр.СуммаВсего              = СуммаВсего;
		Спр.СуммаРуб                = Сумма;
		Спр.СуммаНДСРуб             = СуммаНДС;		
		Спр.СуммаВсегоРуб           = СуммаВсего;
		
		Попытка
			Спр.Записать();
		Исключение
		КонецПопытки;
		
		// Нетарифка
		Сумма = Стр.НетарифкаРуб;
		
		Если Сумма = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СуммаНДС   = 0;
		СуммаВсего = Сумма + СуммаНДС;
		
		Спр = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьЭлемент();
		Спр.Владелец                = Стр.Грузоперевозка;
		Спр.ВидСтатьиПланирования   = Перечисления.CW_ВидыСтатейПланирования.Расходы;
		Спр.Контрагент              = Нетарифка_Контрагент;
		Спр.ВерсияБюджета           = ВерсияБюджета;
		Спр.Валюта                  = Валюта; 
		
		Спр.Курс					= ДанныеКурса.Курс;   
		Спр.Кратность				= ДанныеКурса.Кратность; 
		
		Спр.Организация             = Организация;
		Спр.Номенклатура            = Нетарифка_Номенклатура;
		Спр.ПорядокОтраженияРасходов= Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		Спр.Сумма                   = Сумма;
		Спр.СтавкаНДС               = СтавкаБезНДС;
		Спр.СуммаНДС                = СуммаНДС;
		Спр.СуммаВсего              = СуммаВсего;
		Спр.СуммаРуб                = Сумма;
		Спр.СуммаНДСРуб             = СуммаНДС;		
		Спр.СуммаВсегоРуб           = СуммаВсего;
		
		Попытка
			Спр.Записать();
		Исключение
		КонецПопытки;
		
		// Брокерские услуги
		Сумма = Стр.БрокерскиеУслугиРуб;
		
		Если Сумма = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СуммаНДС   = 0;
		СуммаВсего = Сумма + СуммаНДС;
		
		Спр = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьЭлемент();
		Спр.Владелец                = Стр.Грузоперевозка;
		Спр.ВидСтатьиПланирования   = Перечисления.CW_ВидыСтатейПланирования.Расходы;
		Спр.Контрагент              = БрокерскиеУслуги_Контрагент;
		Спр.ВерсияБюджета           = ВерсияБюджета;
		Спр.Валюта                  = Валюта;  
		
		Спр.Курс					= ДанныеКурса.Курс;   
		Спр.Кратность				= ДанныеКурса.Кратность;   

		Спр.Организация             = Организация;
		Спр.Номенклатура            = БрокерскиеУслуги_Номенклатура;
		Спр.ПорядокОтраженияРасходов= Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		Спр.Сумма                   = Сумма;
		Спр.СтавкаНДС               = СтавкаБезНДС;
		Спр.СуммаНДС                = СуммаНДС;
		Спр.СуммаВсего              = СуммаВсего;
		Спр.СуммаРуб                = Сумма;
		Спр.СуммаНДСРуб             = СуммаНДС;		
		Спр.СуммаВсегоРуб           = СуммаВсего;
		
		Попытка
			Спр.Записать();
		Исключение
		КонецПопытки;


	КонецЦикла;	
	
КонецПроцедуры

//-------------------------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура ТаблицаДекларацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СнятьВыделение();
	Элемент.ТекущиеДанные.Выбрана = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДекларацийВыбранаПриИзменении(Элемент)
	
	СнятьВыделение();
	
	ТекСтрока = Элементы.ТаблицаДеклараций.ТекущиеДанные;
	ТекСтрока.Выбрана = Истина;

КонецПроцедуры

&НаСервере
Функция ПрочитатьНастройкиНаСервере()
	
	Настройки = _ПО.ПолучитьНастройки(Обработка);
	_сф.ст_ЗаполнитьСвойства(ЭтаФорма, _СписокНастроекСтрокой(), Настройки);
		
КонецФункции

&НаСервере
Функция ЗаписатьНастройкиНаСервере()
	
	Попытка
		Настройки = Новый Структура();
		_сф.ст_ДобавитьСвойства(Настройки, _СписокНастроекСтрокой(), ЭтаФорма);
		_ПО.ЗаписатьНастройки(Обработка, ,Настройки);
	    Возврат(Истина);
	Исключение
	    Возврат(Ложь);
	КонецПопытки; 
	
КонецФункции

&НаСервере
Функция _СписокНастроекСтрокой()
	
	СписокНастроек = "Нетарифка_Номенклатура,
					|Нетарифка_Контрагент,
					|ТамПлатежи_Контрагент,
					|ТамПлатежи_Номенклатура,
					|БрокерскиеУслуги_Контрагент,
					|БрокерскиеУслуги_Номенклатура,
					|Организация";
						
	Возврат(СтрЗаменить(СписокНастроек, Символы.ПС, ""));
	
КонецФункции	

&НаСервере
Функция _ПроверитьНастройки()
	
	Рез = Истина;
	
	Если НЕ ЗначениеЗаполнено(Нетарифка_Номенклатура) Тогда
		Сообщить("В настройках не заполнено значение ""Номенклатура <Нетарифка>""");
		Рез = Ложь;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Нетарифка_Контрагент) Тогда
		Сообщить("В настройках не заполнено значение ""Контрагент <Нетарифка>""");
		Рез = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТамПлатежи_Номенклатура) Тогда
		Сообщить("В настройках не заполнено значение ""Номенклатура <Там. платежи>""");
		Рез = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТамПлатежи_Контрагент) Тогда
		Сообщить("В настройках не заполнено значение ""Контрагент <Там. платежи>""");
		Рез = Ложь;
	КонецЕсли;
		
	Возврат Рез;
	
КонецФункции	

//-------------------------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура СнятьВыделение()
	
	Для Каждого Стр из ТаблицаДеклараций Цикл
		Стр.Выбрана = Ложь;
	КонецЦикла;
	
КонецПроцедуры






