
&НаКлиенте
Процедура РегламентныеЗадания(Команда)
	
	ПФ = Новый Структура();
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ПФ.Вставить("ОтборПоВладельцу",Элементы.Список.ТекущаяСтрока);
		
	КонецЕсли; 
	ОткрытьФорму("Обработка.CW_КонсольЗаданий.Форма.ФормаОбработки",ПФ);
	
КонецПроцедуры

&НаКлиенте
Процедура СистемныеСообщения(Команда)
	
	ПФ = Новый Структура();
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ОФ = ПолучитьОсновнойФильтр(Элементы.Список.ТекущаяСтрока);
		Если НЕ ОФ.Пустая() Тогда
			
			ПФ.Вставить("Фильтр",ОФ);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Форма = ПолучитьФорму("Справочник.CW_СистемныеСообщения.ФормаСписка",ПФ);
	Форма.Открыть();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьОсновнойФильтр(Обмен)
	// --- 
	
	Возврат(Обмен.ОсновнойФильтр);
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура МетаданныеКРегистрации(Команда)
	
	ПФ = Новый Структура();
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ПФ.Вставить("Обмен",Элементы.Список.ТекущаяСтрока);
		
	КонецЕсли; 
	Форма = ПолучитьФорму("РегистрСведений.CW_МетаданныеДляРегистрации.ФормаСписка",ПФ);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРегистрации(Команда)
	
	ПФ = Новый Структура();
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ПФ.Вставить("Обмен",Элементы.Список.ТекущаяСтрока);
		
	КонецЕсли; 
	Форма = ПолучитьФорму("РегистрСведений.CW_ТаблицаРегистрацииИзменений.ФормаСписка",ПФ);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияОбъектов(Команда)
	
	ПФ = Новый Структура();
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ПФ.Вставить("Обмен",Элементы.Список.ТекущаяСтрока);
		
	КонецЕсли; 
	Форма = ПолучитьФорму("РегистрСведений.CW_СинхронизацияОбъектов.ФормаСписка",ПФ);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторыДляВнешнихБД(Команда)
	
	ПФ = Новый Структура();
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ПФ.Вставить("Обмен",Элементы.Список.ТекущаяСтрока);
		
	КонецЕсли; 
	ОткрытьФорму("РегистрСведений.CW_ИдентификаторыОбъектовДляВнешнихБД.ФормаСписка",ПФ);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ИнтерактивнаяЗагрузка(Команда)
	
	Обмен = Элементы.Список.ТекущаяСтрока;       
	Если Обмен <> Неопределено Тогда
		
		ИмяФормыИЗ = _ИмяФормыИнтерактивнойЗагрузки(Обмен);
		Если (ИмяФормыИЗ <> Неопределено) Тогда
			ПФ = Новый Структура("Объект,Субъект",_ОбработкаОбмена(Обмен),Обмен);
			ОткрытьФорму(ИмяФормыИЗ,ПФ);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция _ОбработкаОбмена(Обмен)
	// --- 
	
	Возврат(Обмен.Обработка);
	
	// --- 
КонецФункции

&НаСервере
Функция _ИмяФормыИнтерактивнойЗагрузки(Обмен)
	// --- 
	
	Если (Обмен.Использование И Обмен.Загрузка) Тогда
		
		// подключаем обработку, вдруг ещё не подключена
		_ПО.ПодключитьОбработку(Обмен.Обработка);
		Возврат(_ПО.ПолучитьПолноеИмяФормыПоТипу(Обмен.Обработка,"ФормаИнтерактивнойЗагрузки"));
		
	Иначе
		
		Возврат(Неопределено);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти