
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Параметры.Свойство("Владелец", 			 			Владелец);
	Параметры.Свойство("ВариантПрогноза", 			 	ВариантПрогноза);
	Параметры.Свойство("ПрогнозКонтрольнаяДата", 	 	ПрогнозКонтрольнаяДата);
	Параметры.Свойство("ПрогнозКоличествоДней", 	 	ПрогнозКоличествоДней);
	Параметры.Свойство("ПрогнозКоличествоДнейПлан", 	ПрогнозКоличествоДнейПлан);
	Параметры.Свойство("ПрогнозДата", 					ПрогнозДата);  
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Элементы.ВариантПрогноза.СписокВыбора.Добавить(2, "фиксированная дата");
	КонецЕсли; 
	
	ЗаполнитьСписокДоступныхПараметров(Владелец); 
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьСписокДоступныхПараметров(ВладелецСтатьи)
	
	МассивДоступныхПарамтеров = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.ПолучитьМассивДоступныхПарамтеровОбъекта(ВладелецСтатьи);	
	СписокДоступныхПараметров.ЗагрузитьЗначения(МассивДоступныхПарамтеров);

КонецПроцедуры     

&НаКлиенте
Процедура ПрогнозКонтрольнаяДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеОтбора = Новый Структура;
	ДанныеОтбора.Вставить("Ссылка", СписокДоступныхПараметров.ВыгрузитьЗначения());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ДанныеОтбора);
	
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", ПараметрыФормы, Элемент, ,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрогнозКонтрольнаяДатаПриИзменении(Элемент)
	
	КонтрольВыбранногоПараметра();       

КонецПроцедуры  

&НаСервере
Процедура КонтрольВыбранногоПараметра() 
	
	Если Не ЗначениеЗаполнено(ПрогнозКонтрольнаяДата) Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокДоступныхПараметров.НайтиПоЗначению(ПрогнозКонтрольнаяДата)	= Неопределено Тогда
		Элементы.ПрогнозКонтрольнаяДата.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
	Иначе
		Элементы.ПрогнозКонтрольнаяДата.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	Отказ = Ложь;
	Если ВариантПрогноза = 1 и Не ЗначениеЗаполнено(ПрогнозКонтрольнаяДата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена контрольная дата",,"ПрогнозКонтрольнаяДата",,Отказ);
	КонецЕсли; 
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьПрогнозОплатыСтатьиБюджета();  

	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ВариантПрогноза", 		 	ВариантПрогноза);
	СтруктураОтвета.Вставить("ПрогнозКонтрольнаяДата", 	 	ПрогнозКонтрольнаяДата);
	СтруктураОтвета.Вставить("ПрогнозКоличествоДней", 	 	ПрогнозКоличествоДней);
	СтруктураОтвета.Вставить("ПрогнозКоличествоДнейПлан", 	ПрогнозКоличествоДнейПлан);
	СтруктураОтвета.Вставить("ПрогнозДата", 				ПрогнозДата); 
	
	ЭтаФорма.Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПрогнозаПриИзменении(Элемент)
	
	ВариантПрогнозаПриИзмененииНаСервере(); 
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры     

&НаСервере
Процедура УстановитьВидимостьЭлементов() 
	
	Элементы.ПрогнозКонтрольнаяДата.Видимость 		= ВариантПрогноза = 1;
	Элементы.ДекорацияПлюс.Видимость 				= ВариантПрогноза = 1;
	Элементы.ПрогнозКоличествоДней.Видимость 		= ВариантПрогноза = 1 или ВариантПрогноза = 0;
	Элементы.ДекорацияИли.Видимость 				= ВариантПрогноза = 1;
	Элементы.ПрогнозКоличествоДнейПлан.Видимость 	= ВариантПрогноза = 1;
	
	Элементы.ПрогнозаДата.Видимость 				= ВариантПрогноза = 2;  
	
КонецПроцедуры

&НаСервере
Процедура ВариантПрогнозаПриИзмененииНаСервере() 
	
	ПрогнозКонтрольнаяДата = Неопределено;
	ПрогнозКоличествоДней  = 0;
	ПрогнозКоличествоДнейПлан = 0;	

КонецПроцедуры

&НаСервере
Процедура РассчитатьПрогнозОплатыСтатьиБюджета() 
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам") Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаПеревозки = Владелец.ДатаСделкиФ;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ВариантПрогноза", 			ВариантПрогноза);
	ПараметрыРасчета.Вставить("Владелец", 					Владелец);
	ПараметрыРасчета.Вставить("ПрогнозКонтрольнаяДата", 	ПрогнозКонтрольнаяДата);
	ПараметрыРасчета.Вставить("ПрогнозКоличествоДней", 		ПрогнозКоличествоДней);
	ПараметрыРасчета.Вставить("ПрогнозКоличествоДнейПлан", 	ПрогнозКоличествоДнейПлан);
	
	ПараметрыРасчета.Вставить("ПрогнозДата",	 			ПрогнозДата);
	ПараметрыРасчета.Вставить("ДатаНачалаПеревозки", 		ДатаНачалаПеревозки);

	НовыйПрогнозДата = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.РассчитатьПрогнозОплатыСтатьиБюджета(ПараметрыРасчета); 
	Если НовыйПрогнозДата <> Неопределено 
		И НовыйПрогнозДата <> ПрогнозДата Тогда
		ПрогнозДата = НовыйПрогнозДата;   
	КонецЕсли;
	
КонецПроцедуры

