&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Показатели.Добавить("КоличествоОборот",	"Количество"); 
	Показатели.Добавить("СуммаОборот",		"Сумма"); 
	Показатели.Добавить("НДСОборот",		"НДС"); 
	Показатели.Добавить("ВсегоОборот",		"Всего"); 
	
	Показатели.Добавить("Сумма_ВалютаОборот",	"Сумма (вал.)"); 
	Показатели.Добавить("НДС_ВалютаОборот",		"НДС (вал.)"); 
	Показатели.Добавить("Всего_ВалютаОборот",	"Всего (вал.)"); 
	
	Параметры.Свойство("ВнешнийВызов", Отчет.ВнешнийВызов);
	Если Отчет.ВнешнийВызов Тогда
		Параметры.Свойство("НачалоПериода", НачалоПериода);
		Параметры.Свойство("КонецПериода", 	КонецПериода);
		
		Если Параметры.Свойство("Показатели") Тогда
			УстановитьВыбранныеПоказатели(Параметры.Показатели);
		КонецЕсли;
		
		Если Параметры.Свойство("Группировки") Тогда
			Группировки.Очистить();
			Для каждого ЭлементМассива Из Параметры.Группировки Цикл
				Нстр = Группировки.Добавить();
				Нстр.ИмяПоля 		= ЭлементМассива;
				Нстр.Представление 	= ЭлементМассива;
				Нстр.Сортировка 	= Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
			КонецЦикла; 
		КонецЕсли;
		
		Если Параметры.Свойство("ДанныеОтбора") Тогда
			АдресОтбора = ПоместитьВоВременноеХранилище(Параметры.ДанныеОтбора, УникальныйИдентификатор);
		КонецЕсли;
	Иначе
		НачалоПериода = НачалоМесяца(ТекущаяДата());
		КонецПериода  = КонецМесяца(ТекущаяДата());
	КонецЕсли;  
	
	//Работа с буфером обмена
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена());
	//Работа с буфером обмена
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	_ВосстановитьСтандартныеНастройки();
	
	_ВосстановитьСеансовуюНастройку();
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	УстановитьОтборНаСервере();

	Если Отчет.ВнешнийВызов Тогда
		Сформировать(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборНаСервере()
	
	Если ЭтоАдресВременногоХранилища(АдресОтбора) Тогда
		ДанныеОтбора = ПолучитьИзВременногоХранилища(АдресОтбора);
		Для каждого ЭлементСтруктуры из  ДанныеОтбора Цикл
			Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("СписокЗначений") Тогда
				тВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			Иначе
				тВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
			
			CW_БухгалтерскиеОтчетыКлиентСерверМСФО.ДобавитьОтбор(Отчет.КомпоновщикНастроек, ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение, тВидСравнения, Истина);
		КонецЦикла;
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Если Отчет.ВнешнийВызов Тогда
		Возврат;
	Конецесли;
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_РасходыНаРеализацию.ПолучитьМакет("Схема").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть = Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка    = Ложь;
	Иначе
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка    = Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка    = Истина;
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод;
	Диалог.Период.ДатаНачала = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПериод <> Неопределено) Тогда
		НачалоПериода = ОтветПериод.ДатаНачала;
		КонецПериода  = ОтветПериод.ДатаОкончания;
		//Период = ОтветПериод;
	КонецЕсли;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	Если Отчет.ВнешнийВызов Тогда
		Возврат;
	КонецЕсли;
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			
			// Отбор
			Если СеансоваяНастройка.Свойство("Отбор") Тогда
				Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
				Для Каждого СтрОтбор из СеансоваяНастройка.Отбор.Элементы Цикл
					НовОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЗаполнитьЗначенияСвойств(НовОтбор, СтрОтбор);
				КонецЦикла;	
			КонецЕсли;
			// Отбор
			
			//показатели
			мПоказатели = Неопределено;
			СеансоваяНастройка.Свойство("Показатели", мПоказатели);
			Если мПоказатели <> Неопределено Тогда
				УстановитьВыбранныеПоказатели(мПоказатели);
			КонецЕсли;
			//показатели
			
			СеансоваяНастройка.Свойство("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
			

		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВыбранныеПоказатели(мПоказатели)
	
	Для Каждого Показатель из мПоказатели Цикл
		ЭлементСписка = Показатели.НайтиПоЗначению(Показатель);
		Если ЭлементСписка <> Неопределено Тогда
			ЭлементСписка.Пометка = истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	Если Отчет.ВнешнийВызов Тогда
		Возврат;
	КонецЕсли;
	
	мВыбранныеПоказатели = ПолучитьВыбранныеПоказатели();

	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Группировки",	Группировки.Выгрузить());
	СтруктураНастройки.Вставить("Показатели",	мВыбранныеПоказатели);
	СтруктураНастройки.Вставить("Отбор", 		Отчет.КомпоновщикНастроек.Настройки.Отбор);
	
	СтруктураНастройки.Вставить("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);

	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВыбранныеПоказатели()
	
	мВыбранныеПоказатели = Новый Массив;
	Для каждого ЭлементСписка из Показатели Цикл
		Если ЭлементСписка.Пометка Тогда
			мВыбранныеПоказатели.Добавить(ЭлементСписка.Значение);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат мВыбранныеПоказатели;

КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда
		СписокПолей.Добавить("Регистратор");
		СписокПолей.Добавить("ПериодСекунда");
		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
		      
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если Не ПроверитьОтметкуПоказателей() Тогда
		ПоказатьПредупреждение(,"Не отмечено ни одного показателя!");
		Возврат;		
	КонецЕсли;
	
	Если Группировки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Не выбрано ни одной группировки!");
		Возврат;				
	КонецЕсли;	
	
	_Настройка(Истина);
	СформироватьОтчет();
	ОбработатьОтчет();
	
	Отчет.ВнешнийВызов = Ложь;
		
КонецПроцедуры

&НаКлиенте
Функция ПроверитьОтметкуПоказателей()
	
	Для Каждого ЭлементСписка из Показатели Цикл
		Если ЭлементСписка.Пометка Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура СформироватьОтчет()
		
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	
	// --- 
	_СохранитьСеансовуюНастройку();
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	
	мВыбранныеПоказатели = ПолучитьВыбранныеПоказатели();

	Настройки = Новый Структура;
	Настройки.Вставить("НачалоПериода", 			НачалоПериода);
	Настройки.Вставить("КонецПериода", 				КонецПериода);
	Настройки.Вставить("Группировки",				Группировки.Выгрузить());
	Настройки.Вставить("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
	Настройки.Вставить("Показатели",				мВыбранныеПоказатели);
	
	Возврат ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "0:00:00", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "23:59:59", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
	СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	
	ДоступныеДействия = Новый Массив();
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
	
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Если Отчет.ВнешнийВызов Тогда
		Возврат;
	КонецЕсли;

	Настройки.ДополнительныеСвойства.Вставить("Группировки", 	Группировки); // ДанныеФормыКоллекция
	Настройки.ДополнительныеСвойства.Вставить("Отбор", 			Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если Отчет.ВнешнийВызов Тогда
		Возврат;
	КонецЕсли;
	
	CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма,Настройки);
	
КонецПроцедуры

//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.КомандаБуфераОбменаВставить.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуфераОбменаВставить(Команда)
	КоличествоСтрок = БуфераОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БуфераОбменаВставитьНаСервере()
	
	Возврат CW_РаботаСБуферомОбмена.УстановитьОтборКомпановщикаПоБуферуОбмена(Отчет.КомпоновщикНастроек);

КонецФункции
//Работа с буфером обмена

