#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает значения связанных констант для простого и полного интерфейсов
// 
// Параметры:
//  Значение - Булево - значение константы
//  ОбменДаннымиЗагрузка - Булево - признак режима загрузки данных, отключения бизнес логики
//
Процедура УстановитьЗначенияСвязанныхКонстант(Значение, ОбменДаннымиЗагрузка = Ложь) Экспорт
	
	РежимТаксиИли77 = Константы.ИнтерфейсТакси.Получить() Или Константы.ИнтерфейсВерсии77.Получить();
	
	ОднаОрганизацияПолныйИнтерфейс = Константы.ВестиУчетПоОднойОрганизацииПолныйИнтерфейс.СоздатьМенеджерЗначения();
	ОднаОрганизацияПолныйИнтерфейс.Значение = РежимТаксиИли77 И Не Значение;
	ОднаОрганизацияПолныйИнтерфейс.ОбменДанными.Загрузка = ОбменДаннымиЗагрузка;
	ОднаОрганизацияПолныйИнтерфейс.Записать();
	
	НесколькоОрганизацийПолныйИнтерфейс = Константы.ВестиУчетПоНесколькимОрганизациямПолныйИнтерфейс.СоздатьМенеджерЗначения();
	НесколькоОрганизацийПолныйИнтерфейс.Значение = РежимТаксиИли77 И Значение;
	НесколькоОрганизацийПолныйИнтерфейс.ОбменДанными.Загрузка = ОбменДаннымиЗагрузка;
	НесколькоОрганизацийПолныйИнтерфейс.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
