&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("АдресОбъекта") Тогда
		Отказ = истина;
	КонецЕсли;
	
	Если Не Отказ и Не ЭтоАдресВременногоХранилища(Параметры.АдресОбъекта) Тогда
		Отказ = истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОбъекта 			= ПолучитьИзВременногоХранилища(Параметры.АдресОбъекта) ;
	Объект.ПодключаемыйОбъект 	= Параметры.ПодключаемыйОбъект;
	
	МассивПараметров = Неопределено;
	Настройки = _ПО.ПолучитьНастройкиОбработки(Объект.ПодключаемыйОбъект);
	Если (Настройки <> Неопределено) Тогда
		Настройки.Свойство("МассивПараметров", МассивПараметров);	
	КонецЕсли;
	
	Если МассивПараметров = Неопределено тогда
		Отказ = истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
 
   #Область ДобавлениеРеквизитовФормы
   
   // Массив для новых реквизитов
   ДобавляемыеРеквизиты	= Новый Массив;
   Для Каждого ЭлементСписка Из МассивПараметров Цикл	
	   // Опишем ревизиты формы
	   Реквизит = Новый РеквизитФормы("п_"+СокрЛП(ЭлементСписка.Код),ЭлементСписка.типЗначения,,СокрЛП(ЭлементСписка));
	   
	   // Для наглядности заполним массив после описания реквизитов формы
	   ДобавляемыеРеквизиты.Добавить(Реквизит);
	   
   КонецЦикла; 
   
   // Добавим новые реквизиты в форму
   ИзменитьРеквизиты(ДобавляемыеРеквизиты);
   
   #КонецОбласти
   
   #Область ДобавлениеЭлементовФормы
   
   Для Каждого ЭлементСписка Из МассивПараметров Цикл
	   // Элементы
	   НовыйЭлемент = Элементы.Добавить("п_"+СокрЛП(ЭлементСписка.Код), Тип("ПолеФормы"), );
	   НовыйЭлемент.ПутьКДанным			= "п_"+СокрЛП(ЭлементСписка.Код);
	   НовыйЭлемент.Вид					= ВидПоляФормы.ПолеВвода;
	   НовыйЭлемент.ТолькоПросмотр		= Ложь;
	   НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Верх;
   КонецЦикла; 
   
   #КонецОбласти
   
   #Область ЗаполнениеДанных
   
 	  ПолучитьДанныеПараметров(МассивПараметров,СтруктураОбъекта.ТаблицаПараметров);	
   
   #КонецОбласти
 
КонецПроцедуры

&НаСервере 
Процедура ПолучитьДанныеПараметров(МассивПараметров, ПараметрыГрузоперевозки)

	Для каждого Параметр из МассивПараметров Цикл
		
		НайденнаяСтрока = ПараметрыГрузоперевозки.Найти(Параметр, "Параметр"); 
		Если НайденнаяСтрока <> Неопределено Тогда
			ЗначениеПараметра = НайденнаяСтрока.Значение;
		КонецЕсли;
		
		ЭтаФорма["п_"+СокрЛП(Параметр.Код)] = ЗначениеПараметра;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	МассивОтвета = Новый Массив;
	МассивОтвета = ЗаполнитьМассивОтвета(МассивОтвета);

	ЭтаФорма.Закрыть(МассивОтвета);

КонецПроцедуры


&НаСервере
Функция ЗаполнитьМассивОтвета(МассивСтруктурОтвета)
	
	МассивПараметров = Неопределено;
	Настройки = _ПО.ПолучитьНастройкиОбработки(Объект.ПодключаемыйОбъект);
	Если (Настройки <> Неопределено) Тогда
		Настройки.Свойство("МассивПараметров", МассивПараметров);	
	КонецЕсли;
	
	Если МассивПараметров <> Неопределено тогда
		Для Каждого ЭлементСписка Из МассивПараметров Цикл	
			СтруктураОтвета = Новый Структура;
			
			СтруктураОтвета = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
			СтруктураОтвета.Параметр 		= ЭлементСписка;
			СтруктураОтвета.ПараметрИзменен	= Истина;    
			СтруктураОтвета.Значение 		= ЭтаФорма["п_"+СокрЛП(ЭлементСписка.Код)];    
			
			МассивСтруктурОтвета.Добавить(СтруктураОтвета);
			
		КонецЦикла
	КонецЕсли;
	
	Возврат МассивСтруктурОтвета;
	
КонецФункции

