
&НаКлиенте
Процедура ОбработкаПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Функция _УправлениеЭлементамиФормы()
	
	Элементы.ГруппаНастройка.Видимость = (Объект.Обработка.НастройкаСубъекта И НЕ Объект.Ссылка.Пустая());
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектКопирования = _сф.ст_ПолучитьСвойство(Параметры,"ЗначениеКопирования");
	// --- 
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	_УправлениеЭлементамиФормы();
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Процедура НастройкаСубъекта(Команда)
	
	ИмяФормыНастроек = _ИмяФормыНастроек();
	Если ИмяФормыНастроек <> Неопределено Тогда
		
		ПФ = Новый Структура("Объект,Субъект",Объект.Обработка,Объект.Ссылка);
		ОткрытьФорму(ИмяФормыНастроек,ПФ,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
		
КонецПроцедуры
 
&НаСервере
Функция _ИмяФормыНастроек()
	// --- 
	
	// подключаем обработку, вдруг ещё не подключена
	_ПО.ПодключитьОбработку(Объект.Обработка);
	Возврат(_ПО.ПолучитьПолноеИмяФормыПоТипу(Объект.Обработка,"ФормаНастроекСубъекта"));
	
	// --- 
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если (ЗначениеЗаполнено(ОбъектКопирования)) Тогда
		_сф.ст_УстановитьСвойство(ТекущийОбъект.ДополнительныеСвойства,"ОбъектКопированияСсылка",ОбъектКопирования);
	КонецЕсли; 
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти