
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТолькоПросмотр 			= НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеНастроекМониторинга");
	ИспользованиеДинамическихПараметров = ПолучитьФункциональнуюОпцию("CW_ИспользованиеДинамическихПараметров");
	
	ДляРедактирования = Неопределено;
	Параметры.Свойство("ДляРедактирования", ДляРедактирования);

	Пользователь 				= CW_Настройки.Пользователь();
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(Пользователь,Истина);
	ГруппаПользователя 			= CW_ПраваДоступа_ПИ.ГруппаПользователя(Пользователь);
	Если ГруппаПользователя.ПолныеПрава Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли;    
	
	Список.Параметры.УстановитьЗначениеПараметра("НеИспользуютсяДинамическиеПараметры", Не ИспользованиеДинамическихПараметров);
	Список.Параметры.УстановитьЗначениеПараметра("Группа",					ГруппаПользователя);
	Список.Параметры.УстановитьЗначениеПараметра("ДляРедактирования", 		ДляРедактирования=Истина);
	Список.Параметры.УстановитьЗначениеПараметра("АдминистраторСистемы", 	ЭтоПолноправныйПользователь);
	
КонецПроцедуры
