
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверитьВозмоностьЗаполненияДокумента();
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП
	
КонецПроцедуры  

&НаКлиенте
Процедура Заполнить(Команда)  
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);   
	Если Объект.Состав.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Табличная часть будет очищена. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ПараметрыУчетнойПолитики = CW_Настройки.ПараметрыУчетнойПолитики(Объект.Дата, Объект.Организация);
	Если Не ЗначениеЗаполнено(ПараметрыУчетнойПолитики.НЗППараметрДатаРеализации) Тогда
		ВызватьИсключение "В учетной подлитике не указан параметр ""Дата реализации""";	
	КонецЕсли;
	
	Запрос = Новый Запрос;   
	Запрос.Текст ="ВЫБРАТЬ
	|	ОстаткиНЗП.Организация КАК Организация,
	|	ОстаткиНЗП.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ОстаткиНЗП.Грузоперевозка КАК Грузоперевозка,
	|	ОстаткиНЗП.Контрагент КАК Контрагент,
	|	ОстаткиНЗП.Договор КАК Договор,
	|	ОстаткиНЗП.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	ОстаткиНЗП.ДокументРасходов КАК ДокументРасходов,
	|	ОстаткиНЗП.ПорядокОтражения КАК ПорядокОтражения,
	|	ОстаткиНЗП.СтавкаНДС КАК СтавкаНДС,
	|	ОстаткиНЗП.СпособУчетаНДС КАК СпособУчетаНДС,
	|	ОстаткиНЗП.Номенклатура КАК Номенклатура,
	|	ОстаткиНЗП.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ОстаткиНЗП.Подразделение КАК Подразделение,
	|	ОстаткиНЗП.Валюта КАК Валюта,
	|	ОстаткиНЗП.Покупатель КАК Покупатель,
	|	ОстаткиНЗП.ДоговорПокупателя КАК ДоговорПокупателя,
	|	ОстаткиНЗП.ПриложениеКДоговоруПокупателя КАК ПриложениеКДоговоруПокупателя,
	|	ОстаткиНЗП.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиНЗП.СуммаОстаток КАК СуммаОстаток,
	|	ОстаткиНЗП.НДСОстаток КАК НДСОстаток,
	|	ОстаткиНЗП.ВсегоОстаток КАК ВсегоОстаток,
	|	ОстаткиНЗП.Сумма_ВалютаОстаток КАК Сумма_ВалютаОстаток,
	|	ОстаткиНЗП.НДС_ВалютаОстаток КАК НДС_ВалютаОстаток,
	|	ОстаткиНЗП.Всего_ВалютаОстаток КАК Всего_ВалютаОстаток,
	|	ВЫРАЗИТЬ(CW_ХарактеристикиГрузоперевозок.Значение КАК ДАТА) КАК ЗначениеПараметра
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.CW_НезавершенноеПроизводство.Остатки(
	|		&Период, 
	|		Организация = &Организация
	|		//УСЛОВИЕ_Подразделение
	|									) КАК ОстаткиНЗП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	|		ПО ОстаткиНЗП.Грузоперевозка = CW_ХарактеристикиГрузоперевозок.Грузоперевозка
	|			И (CW_ХарактеристикиГрузоперевозок.Параметр = &ПараметрДатаРеализации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Организация КАК Организация,
	|	ВТ_Остатки.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ВТ_Остатки.Грузоперевозка КАК Грузоперевозка,
	|	ВТ_Остатки.Контрагент КАК Контрагент,
	|	ВТ_Остатки.Договор КАК Договор,
	|	ВТ_Остатки.ПриложениеКДоговору КАК ПриложениеКДоговору,
	|	ВТ_Остатки.ДокументРасходов КАК ДокументРасходов,
	|	ВТ_Остатки.ПорядокОтражения КАК ПорядокОтражения,
	|	ВТ_Остатки.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_Остатки.СпособУчетаНДС КАК СпособУчетаНДС,
	|	ВТ_Остатки.Номенклатура КАК Номенклатура,
	|	ВТ_Остатки.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_Остатки.Подразделение КАК Подразделение,
	|	ВТ_Остатки.Валюта КАК Валюта,
	|	ВТ_Остатки.Покупатель КАК Покупатель,
	|	ВТ_Остатки.ДоговорПокупателя КАК ДоговорПокупателя,
	|	ВТ_Остатки.ПриложениеКДоговоруПокупателя КАК ПриложениеКДоговоруПокупателя,
	|	ВТ_Остатки.КоличествоОстаток КАК Количество,
	|	ВТ_Остатки.СуммаОстаток КАК Сумма,
	|	ВТ_Остатки.НДСОстаток КАК НДС,
	|	ВТ_Остатки.ВсегоОстаток КАК Всего,
	|	ВТ_Остатки.Сумма_ВалютаОстаток КАК Сумма_Валюта,
	|	ВТ_Остатки.НДС_ВалютаОстаток КАК НДС_Валюта,
	|	ВТ_Остатки.Всего_ВалютаОстаток КАК Всего_Валюта
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|ГДЕ
	|	ВТ_Остатки.ЗначениеПараметра <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ВТ_Остатки.ЗначениеПараметра <= &Период";	

	
	ЭтоВерсияКОРП = ВариантыПриложений.ЭтоВерсияКОРП();
	Если ЭтоВерсияКОРП Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УСЛОВИЕ_Подразделение", "И ПодразделениеОрганизации = &ПодразделениеОрганизации");
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Период",						Объект.Дата);
	Запрос.УстановитьПараметр("Организация",				Объект.Организация);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации",	Объект.ПодразделениеОрганизации); 
	Запрос.УстановитьПараметр("ПараметрДатаРеализации",		ПараметрыУчетнойПолитики.НЗППараметрДатаРеализации); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Состав.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры   

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере() 
	
	ПроверитьВозмоностьЗаполненияДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозмоностьЗаполненияДокумента()
	
	Дата = ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), Объект.Дата);
	
	ПараметрыУчетнойПолитики		= CW_Настройки.ПараметрыУчетнойПолитики(Дата, Объект.Организация);  
	ВариантУчетаНЗПУчетнойПолитики	= ПараметрыУчетнойПолитики["ВариантУчетаНЗП"];
	
	ОтключеноУчетнойПолитикой = Ложь;
	
	ЧастиЗаголовка = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Организация) 
		И ВариантУчетаНЗПУчетнойПолитики <> ПредопределенноеЗначение("Перечисление.CW_ВариантУчетаНЗП.Автоматически") Тогда 
		
		КлючЗаписи = ПолучитьКлючЗаписи(ПараметрыУчетнойПолитики["Период"]);
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(КлючЗаписи);
		
		ЧастиЗаголовка.Добавить(
		НСтр("ru = 'Редактирование документа невозможно: ведение автоматического учета незавершенного производства отключено в <a href = """+СокрЛП(НавигационнаяСсылка)+""">учетной политике</a>.'"));
		
		ОтключеноУчетнойПолитикой = Истина;
		
	КонецЕсли;
	
	Элементы.ОтключеноУчетнойПолитикой.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(СтрСоединить(ЧастиЗаголовка));
	Элементы.ОтключеноУчетнойПолитикой.Видимость = ОтключеноУчетнойПолитикой;
	Элементы.Состав.Доступность 				 = НЕ ОтключеноУчетнойПолитикой;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписи(Знач Период)
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("Период", 		Период);
	ЗначенияКлюча.Вставить("Организация", 	Объект.Организация);
	
	Возврат РегистрыСведений.CW_УчетнаяПолитика.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции




