
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтказНаКлиенте = Не ЗначениеЗаполнено(Параметры.Формат);
	СсылкаНаОбъект = Параметры.СсылкаНаОбъект;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОтказНаКлиенте Тогда
		ПоказатьПредупреждение(,"Обработка не предназначена для непосредственного использования!", 5);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область РаботаСФайлом

&НаКлиенте
Процедура ФайлДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = "Загрузить табличный документ из файла";
	ДиалогВыбораФайла.Фильтр    = "Лист Excel (*.xls)|*.xls| Лист Excel (*.xlsx)|*.xlsx";
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ФайлДанных = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФайлНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОткрытьФайлНаСервере()
	
	Если Не ЗначениеЗаполнено(ФайлДанных) Тогда
		Возврат;
	КонецЕсли; 
	
	ВыбФайл = Новый Файл(ФайлДанных);
	Если НЕ ВыбФайл.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	#Если Не ВебКлиент Тогда
	ЗапуститьПриложение(ФайлДанных);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайла(Команда)
	
	ОчиститьСообщения();
	ТаблицаДанных.Очистить();
	
	ДанныеЗагружены = ЗаполнитьТаблицуДанныхИзExcel(ФайлДанных);
	
	Если ДанныеЗагружены Тогда
		Состояние("Идет синхронизация данных...");
		
		СинхронизироватьДанныеНаСервере(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
		АдресВоВременномХранилище = ПолучитьАдресВоВременномХранилище(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
		
		СтруктураПередачи = Новый  Структура;
		СтруктураПередачи.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
		СтруктураПередачи.Вставить("ТаможенныйСборРуб", ТаможенныйСборРуб);
		СтруктураПередачи.Вставить("Курс", Курс);
		СтруктураПередачи.Вставить("Дата", Дата);
		
		Оповестить("Справочник.РасчетыДТ.Изменение", СтруктураПередачи, ЭтаФорма);
		
		ОбработчикРезультата = Новый ОписаниеОповещения("ПослеЗавершенияПомещенияФайлаНаСервер", ЭтаФорма);
	
		МассивВладельцев = Новый Массив;
		МассивВладельцев.Добавить(СсылкаНаОбъект);
		
		ЗапрашиватьТипФайлаПриДобавленииВАрхив = CW_РаботаСФайламиСервер.ЗапрашиватьТипФайлаПриДобавленииВАрхив();
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("МассивВладельцев", МассивВладельцев);
		ДополнительныеПараметры.Вставить("ЗапрашиватьТипФайлаПриДобавленииВАрхив", ЗапрашиватьТипФайлаПриДобавленииВАрхив);  
		ДополнительныеПараметры.Вставить("ОбработчикРезультата", ОбработчикРезультата);  
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОбработкаПомещенияФайла", CW_РаботаСФайламиКлиент, ДополнительныеПараметры);
		
		НачатьПомещениеФайлаНаСервер(ОписаниеОповещенияОЗавершении,, ,, ФайлДанных, УникальныйИдентификатор);		
		
	КонецЕсли; 
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗавершенияПомещенияФайлаНаСервер(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	ЭтаФорма.Закрыть(); 
	
КонецПроцедуры

&НаСервере
Функция ИспользуетсяАрхив()
	Возврат ПолучитьФункциональнуюОпцию("CW_ИспользованиеФайловогоАрхива");
КонецФункции
 
&НаСервере
Функция ФайлДобавлен(ИмяФайла)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяФайла", ИмяФайла);
	Запрос.УстановитьПараметр("Объект",   СсылкаНаОбъект);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_ОбъектыАрхива.Ссылка
	|ИЗ
	|	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	|ГДЕ
	|	CW_ОбъектыАрхива.ПометкаУдаления = ЛОЖЬ
	|	И CW_ОбъектыАрхива.Объект = &Объект
	|	И CW_ОбъектыАрхива.ИмяФайла = &ИмяФайла";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции

&НаСервере
Функция ПолучитьАдресВоВременномХранилище(Адрес)

	
	ТаблицаДляПередачи = ТаблицаДанных.Выгрузить(,"КодТНВЭД,ОписаниеТовара,Номенклатура,СтранаПроисхождения,Цена,ЦенаИТС,Количество,КоличествоДоп,"
            			+"Сумма,ДопРасходы,ТаможеннаяСтоимость,ПошлинаПроцент,ПошлинаРуб,СезСпецПошлинаРуб,НДСПроцент,АнтидемпинговаяПошлинаРуб,"
						+"Всего,ВсегоРуб,НДСРуб, ЕдиницаИзмерения");
						
	Возврат ПоместитьВоВременноеХранилище(ТаблицаДляПередачи, Адрес);					
	
КонецФункции
    
#КонецОбласти 

#Область РаботаСExcel

&НаКлиенте
Функция ЗаполнитьТаблицуДанныхИзExcel(ИмяФайла, НомерЛистаExcel = 1)
	
	xlLastCell = 11;
	
	ВыбФайл = Новый Файл(ИмяФайла);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить("Файл не существует!");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = Excel.Sheets(НомерЛистаExcel);
	Исключение
		Сообщить("Ошибка. Возможно неверно указан номер листа книги Excel. Либо на компьютере не установлен Excel.");
		Возврат ложь;
	КонецПопытки;

	ActiveCell  = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount    = ActiveCell.Row;
	RowBegin    = 5;
	
	ColumnCount = ActiveCell.Column;
		
	ОбластьДанных = ExcelЛист.Range(ExcelЛист.Cells(RowBegin,1),ExcelЛист.Cells(RowCount,ColumnCount));
	Данные        = ОбластьДанных.Value.Выгрузить();
	
	СформироватьСтрокиТаблицыДанныхНаСервере(RowCount - RowBegin);
	ЗаполнитьТаблицуСоответствияКолонокНаСервере();
	
	Для каждого Строка Из СоответствиеКолонок Цикл
		Попытка
			ЗагрузитьКолонкуНаСервере(Данные[Строка.НомерКолонкиИсточник - 1],Строка.ИмяКолонкиПриемник);
		Исключение
			Сообщить("Не удалось загрузить колонку: <" + Строка.ИмяКолонкиПриемник + ">");
			Сообщить(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;	
	КонецЦикла; 
	
	// Получим курс и дату
	КурсИзФайла = ExcelЛист.Cells(2,9).Text;
	Курс        = ПолучитьЧислоИзСтроки(КурсИзФайла);
	
	ДатаИзФайла = ExcelЛист.Cells(1,1).Text;
	Дата        = ПолучитьДатуРасчета(ДатаИзФайла, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
	// Удалим пустые строки таблицы
	Индекс = ТаблицаДанных.Количество() - 1;
	
	Пока Индекс >= 0 Цикл
		Строка = ТаблицаДанных.Получить(Индекс);
		
		Если ЗначениеЗаполнено(Строка.ВсегоРуб) И
			НЕ ЗначениеЗаполнено(Строка.Сумма) Тогда
			ТаможенныйСборРуб = Строка.ВсегоРуб;  // В этой же колонке (после промежуточных итогов)
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.КодТНВЭД_ИзФайла) Тогда
			ТаблицаДанных.Удалить(Индекс);
		КонецЕсли;
		
		Индекс = Индекс - 1;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции 

&НаСервере
Процедура ЗагрузитьКолонкуНаСервере(ДанныеКолонки, ИмяКолонки)
	
	_ТаблицаДанных = РеквизитФормыВЗначение("ТаблицаДанных");
	_ДанныеКолонки = Новый Массив;
	
	Попытка
		Колонка = _ТаблицаДанных.Колонки[ИмяКолонки]; // Если колонка содержит тип - Число, то приведем все элементы массива в число
		Если Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			Для каждого Элемент Из ДанныеКолонки Цикл
				_ДанныеКолонки.Добавить(ПолучитьЧислоИзСтроки(Элемент)); 
			КонецЦикла; 
		ИначеЕсли ИмяКолонки = "КодТНВЭД_ИзФайла" Тогда // Уберем пробелы из кода	
			Для каждого Элемент Из ДанныеКолонки Цикл
				Элемент = СтрЗаменить(Элемент, " ", "");
				Элемент = СтрЗаменить(Элемент, Символ(160), "");
				_ДанныеКолонки.Добавить(Элемент); 
			КонецЦикла; 
		Иначе
			_ДанныеКолонки = ДанныеКолонки;
		КонецЕсли; 
		_ТаблицаДанных.ЗагрузитьКолонку(_ДанныеКолонки, Колонка);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	ЗначениеВРеквизитФормы(_ТаблицаДанных, "ТаблицаДанных");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСоответствияКолонокНаСервере()
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 6;
	НоваяСтрока.ИмяКолонкиПриемник   = "КодТНВЭД_ИзФайла";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 7;
	НоваяСтрока.ИмяКолонкиПриемник   = "ОписаниеТовара";
			
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 23;
	НоваяСтрока.ИмяКолонкиПриемник   = "Количество";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 22;
	НоваяСтрока.ИмяКолонкиПриемник   = "КоличествоДоп";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 13;
	НоваяСтрока.ИмяКолонкиПриемник   = "Сумма";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 16;
	НоваяСтрока.ИмяКолонкиПриемник   = "ДопРасходы";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 17;
	НоваяСтрока.ИмяКолонкиПриемник   = "ТаможеннаяСтоимость";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 19;
	НоваяСтрока.ИмяКолонкиПриемник   = "Страна_ИзФайла";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 24;
	НоваяСтрока.ИмяКолонкиПриемник   = "ПошлинаПроцент";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 25;
	НоваяСтрока.ИмяКолонкиПриемник   = "ПошлинаРуб";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 26;
	НоваяСтрока.ИмяКолонкиПриемник   = "СезСпецПошлинаРуб";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 31;
	НоваяСтрока.ИмяКолонкиПриемник   = "НДСРуб";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 33;
	НоваяСтрока.ИмяКолонкиПриемник   = "АнтидемпинговаяПошлинаРуб";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 35;
	НоваяСтрока.ИмяКолонкиПриемник   = "Всего";
	
	НоваяСтрока = СоответствиеКолонок.Добавить();
	НоваяСтрока.НомерКолонкиИсточник = 38;
	НоваяСтрока.ИмяКолонкиПриемник   = "ВсегоРуб";
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтрокиТаблицыДанныхНаСервере(КоличествоСтрок);
	
	Для К = 1 По КоличествоСтрок Цикл
		НоваяСтрока = ТаблицаДанных.Добавить();
	КонецЦикла; 
		
КонецПроцедуры

&НаСервере
Функция ПолучитьЧислоИзСтроки(ИсходнаяСтрока) Экспорт
	
	Попытка
		ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока, " ", "");
		ЧислоИзСтроки = Число(СокрЛП(ИсходнаяСтрока));
		Возврат ЧислоИзСтроки;
	Исключение
		МассивЧисел = Новый Массив; 		
		СтрокаЧисел = "";
		
		ПервыйРазделитель = Истина;
		Для Индекс = 1 По СтрДлина(СокрЛП(ИсходнаяСтрока)) Цикл
			
			Символ = Сред(ИсходнаяСтрока, Индекс, 1); // Перебираем все сиволы из нашей строки
			
			Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 
				ИЛИ КодСимвола(Символ) = 46 Тогда // Код нуля - 48, код 9-ки - 57, код "." - 46
				СтрокаЧисел = СтрокаЧисел + Символ;
			ИначеЕсли КодСимвола(Символ) = 44 И ПервыйРазделитель Тогда // Символ "," меняем на "." (только один раз)
				СтрокаЧисел = СтрокаЧисел + ".";
				ПервыйРазделитель = Ложь;
			ИначеЕсли СтрДлина(СтрокаЧисел) = 0 Тогда
				Продолжить;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрДлина(СтрокаЧисел) > 0 Тогда
			ЧислоИзСтроки = Число(СтрокаЧисел);
		Иначе
			ЧислоИзСтроки = 0;
		КонецЕсли;
		
		Возврат ЧислоИзСтроки;
		
	КонецПопытки; 

КонецФункции

&НаСервере
Функция ПолучитьДатуРасчета(ИсходнаяСтрока, УИД_ВладельцаФормы);
	
	Попытка
		МассивЧисел = Новый Массив; 		
		СтрокаЧисел = "";
		
		ПервыйРазделитель = Истина;
		Для Индекс = 1 По СтрДлина(СокрЛП(ИсходнаяСтрока)) Цикл
			
			Символ = Сред(ИсходнаяСтрока, Индекс, 1); // Перебираем все сиволы из нашей строки
			
			Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 
				ИЛИ КодСимвола(Символ) = 46 Тогда // Код нуля - 48, код 9-ки - 57, код "." - 46
				СтрокаЧисел = СтрокаЧисел + Символ;
			ИначеЕсли КодСимвола(Символ) = 44 И ПервыйРазделитель Тогда // Символ "," меняем на "." (только один раз)
				СтрокаЧисел = СтрокаЧисел + ".";
				ПервыйРазделитель = Ложь;
			ИначеЕсли СтрДлина(СтрокаЧисел) = 0 Тогда
				Продолжить;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрДлина(СтрокаЧисел) > 0 Тогда
			ДатаРасчета = Дата(СтрокаЧисел + " 00:00:00");
		Иначе
			ДатаРасчета = Неопределено;
		КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = УИД_ВладельцаФормы;
		Сообщение.Текст = "Не удалось одназначно идентифицировать дату расчета";
		Сообщение.Сообщить();
		ДатаРасчета = Неопределено;
		
	КонецПопытки;
		
	Возврат ДатаРасчета;
	
КонецФункции	
#КонецОбласти

#Область Синхронизация

&НаСервере
Процедура СинхронизироватьДанныеНаСервере(УИД_ВладельцаФормы)
	
	// Синхронизируем справочники и расчитываем показатели
	Для каждого Строка Из ТаблицаДанных Цикл
		Строка.КодТНВЭД            = ПолучитьКодТНВЭД(Строка, УИД_ВладельцаФормы);
		Строка.Номенклатура        = Номенклатура; 
		Строка.ЕдиницаИзмерения    = Строка.Номенклатура.ЕдиницаИзмерения;
		Строка.СтранаПроисхождения = ПолучитьСтрануПроисхождения(Строка, УИД_ВладельцаФормы);
		Строка.НДСПроцент          = СтавкаНДС;
		Строка.ЦенаИТС             = Строка.ТаможеннаяСтоимость / ?(Строка.Количество = 0, 1, Строка.Количество);
		Строка.Цена                = Строка.Сумма / ?(Строка.Количество = 0, 1, Строка.Количество);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКодТНВЭД(СтрокаТЗ, УИД_ВладельцаФормы)
	
	Если НЕ ЗначениеЗаполнено(СтрокаТЗ.КодТНВЭД_ИзФайла) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодТНВЭД_ИзФайла", Строка(СтрокаТЗ.КодТНВЭД_ИзФайла));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлассификаторТНВЭД.Ссылка
	|ИЗ
	|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|ГДЕ
	|	КлассификаторТНВЭД.ПометкаУдаления = ЛОЖЬ
	|	И КлассификаторТНВЭД.Код = &КодТНВЭД_ИзФайла";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	// Создаем новый из классификатора
	Данные = Справочники.КлассификаторТНВЭД.ТаблицаКлассификатораТНВЭД();
    Отбор  = Новый Структура("Код", Строка(СтрокаТЗ.КодТНВЭД_ИзФайла)); 
	НайденныеСтроки = Данные.НайтиСтроки(Отбор); 
	
	Если НайденныеСтроки.Количество() = 1 Тогда
		Строка0 = НайденныеСтроки[0];
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = УИД_ВладельцаФормы;
		Сообщение.Текст = "Не удалось одназначно идентифицировать код ТН ВЭД: <" + Строка(СтрокаТЗ.КодТНВЭД_ИзФайла) + "> в классификаторе кодов ТН ВЭД";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
		
	КодТНВЭД_Ссылка = Справочники.КлассификаторТНВЭД.СоздатьЭлемент();
	КодТНВЭД_Ссылка.Код                = Строка0.Код;
	КодТНВЭД_Ссылка.Наименование       = Строка0.Наименование;
	КодТНВЭД_Ссылка.НаименованиеПолное = СокрЛП(СтрокаТЗ.ОписаниеТовара);
	
	Попытка
		КодТНВЭД_Ссылка.Записать();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = УИД_ВладельцаФормы;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки; 
	
	Возврат КодТНВЭД_Ссылка.Ссылка;
	
	//// Создаем новый
	//КодТНВЭД_Ссылка = Справочники.CW_КодыТНВЭД.СоздатьЭлемент();
	//КодТНВЭД_Ссылка.Наименование = Строка(СтрокаТЗ.КодТНВЭД_ИзФайла);
	//КодТНВЭД_Ссылка.Описание     = СокрЛП(СтрокаТЗ.ОписаниеТовара);
	//КодТНВЭД_Ссылка.ОсновнаяНоменклатура = Номенклатура;
	//
	//Попытка
	//	КодТНВЭД_Ссылка.Записать();
	//Исключение
	//    Сообщение = Новый СообщениеПользователю;
	//	Сообщение.ИдентификаторНазначения = УИД_ВладельцаФормы;
	//	Сообщение.Текст = ОписаниеОшибки();
	//	Сообщение.Сообщить();
	//КонецПопытки; 
	//
	//Возврат КодТНВЭД_Ссылка.Ссылка;
	
КонецФункции

&НаСервере
Функция ПолучитьСтрануПроисхождения(СтрокаТЗ, УИД_ВладельцаФормы)
	
	Страна = СокрЛП(СтрокаТЗ.Страна_ИзФайла);
	
	Если НЕ ЗначениеЗаполнено(Страна) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Страна_ИзФайла", Страна);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтраныМира.Ссылка
	|ИЗ
	|	Справочник.СтраныМира КАК СтраныМира
	|ГДЕ
	|	СтраныМира.ПометкаУдаления = ЛОЖЬ
	|	И СтраныМира.Наименование = &Страна_ИзФайла";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	// Создаем новый из классификатора
	Данные = Справочники.СтраныМира.ТаблицаКлассификатора();
    Отбор  = Новый Структура("Наименование", ВРег(Страна)); 
	НайденныеСтроки = Данные.НайтиСтроки(Отбор); 
	
	Если НайденныеСтроки.Количество() = 1 Тогда
		Строка0 = НайденныеСтроки[0];
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = УИД_ВладельцаФормы;
		Сообщение.Текст = "Не удалось одназначно идентифицировать страну: <" + Страна + "> в классификаторе стран";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
		
	Страна_Ссылка = Справочники.СтраныМира.СоздатьЭлемент();
	Страна_Ссылка.Код                = Строка0.Код;
	Страна_Ссылка.Наименование       = Строка0.Наименование;
	Страна_Ссылка.НаименованиеПолное = Строка0.НаименованиеПолное;
	Страна_Ссылка.КодАльфа2          = Строка0.КодАльфа2;
	Страна_Ссылка.КодАльфа3          = Строка0.КодАльфа3;
	
	Попытка
		Страна_Ссылка.Записать();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.ИдентификаторНазначения = УИД_ВладельцаФормы;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки; 
	
	Возврат Страна_Ссылка.Ссылка;
	
КонецФункции

#КонецОбласти

