
&НаСервереБезКонтекста
Функция ПроверитьИдентификаторУчастника(Участник)
	Возврат CW_DT.ПроверитьИдентификаторУчастника(Участник)
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСпискиВыбора()
	Элементы.ПолучениеПараметровИдентификатор.СписокВыбора.Очистить();
	Элементы.ОтправкаПараметровИдентификатор.СписокВыбора.Очистить();
	Для Каждого Стр Из Объект.ИдентификаторыПараметров Цикл
		Элементы.ПолучениеПараметровИдентификатор.СписокВыбора.Добавить(Стр.Идентификатор);		
		Элементы.ОтправкаПараметровИдентификатор.СписокВыбора.Добавить(Стр.Идентификатор);
	КонецЦикла; 
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСпискиВыбора()
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторыПараметровПриИзменении(Элемент)
	ЗаполнитьСпискиВыбора();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = ПроверитьИдентификаторУчастника(ВыбранноеЗначение)
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = ПроверитьИдентификаторУчастника(ВыбранноеЗначение)
КонецПроцедуры
