&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВРУ	= Константы.ВалютаРегламентированногоУчета.Получить();
	Элементы.Рубли.Заголовок = Строка(ВРУ);  
	
	Параметры.Свойство("ПараметрКоманды", ПараметрКоманды); 
	Если Не ПараметрКоманды.Пустая() Тогда
		ВыводитьДокументыДвижения 	= истина;
		Валюта 		= Истина;
		Рубли 		= Истина; 
		
		НачалоПериода = ПараметрКоманды.Дата;
		КонецПериода = ТекущаяДата();
		
		СтрокаГруппировки = Группировки.Добавить(); 
		СтрокаГруппировки.ИмяПоля 		= "Валюта";
		СтрокаГруппировки.Представление	= "Валюта";
		СтрокаГруппировки.Сортировка 	= ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
		
		СтрокаГруппировки = Группировки.Добавить(); 
		СтрокаГруппировки.ИмяПоля 		= "Контрагент";
		СтрокаГруппировки.Представление	= "Контрагент";
		СтрокаГруппировки.Сортировка 	= ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
		
		СтрокаГруппировки = Группировки.Добавить(); 
		СтрокаГруппировки.ИмяПоля 		= "Документ";
		СтрокаГруппировки.Представление	= "Документ взаиморасчетов";
		СтрокаГруппировки.Сортировка 	= ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
	КонецЕсли;

	
	// список доступных группировок
	СписокГруппировок.Очистить();
	СписокГруппировок.Добавить("Организация", "Организация", Ложь);
	СписокГруппировок.Добавить("Контрагент", "Контрагент", Ложь);
	СписокГруппировок.Добавить("Договор", "Договор", Ложь);
	СписокГруппировок.Добавить("Валюта", "Валюта", Ложь);
	СписокГруппировок.Добавить("СчетУчета", "Счет учета", Ложь);
	СписокГруппировок.Добавить("Документ", "Документ взаиморасчетов", Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	_ВосстановитьСтандартныеНастройки();
		
	Если  ПараметрКоманды.Пустая() Тогда
		_ВосстановитьСеансовуюНастройку();  
		// период по умолчанию
		Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
			НачалоПериода = НачалоМесяца(ТекущаяДата());
			КонецПериода  = КонецМесяца(ТекущаяДата());
		КонецЕсли;	
	КонецЕсли;
	
	Если Не ПараметрКоманды.Пустая() Тогда
		УстановитьОтборКомпановщика();  
		СформироватьОтчет();
		ОбработатьОтчет();
	КонецЕсли;
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьОтборКомпановщика()
	
	Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	
	ЭлементОбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Документ");
	ЭлементОбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОбора.ПравоеЗначение = ПараметрКоманды;
	ЭлементОбора.Использование 	= Истина;
	
КонецПроцедуры

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_ВедомостьОперативныхВзаиморасчетовСПоставщиками.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;	
	
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть = Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка    = Ложь;
	Иначе
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка    = Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка    = Истина;
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод;
	Диалог.Период.ДатаНачала = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПериод <> Неопределено) Тогда
		НачалоПериода = ОтветПериод.ДатаНачала;
		КонецПериода  = ОтветПериод.ДатаОкончания;
		//Период = ОтветПериод;
	КонецЕсли;
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПриИзменении(Элемент)

	Если Элемент = Элементы.ВыводитьГрузоперевозки И ВыводитьГрузоперевозки Тогда
		ВыводитьЗаказы = Ложь;
	ИначеЕсли Элемент = Элементы.ВыводитьЗаказы И ВыводитьЗаказы Тогда
		ВыводитьГрузоперевозки = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			//СеансоваяНастройка.Свойство("НачалоПериода", НачалоПериода);
			//СеансоваяНастройка.Свойство("КонецПериода", КонецПериода);
			СеансоваяНастройка.Свойство("Рубли", Рубли);
			СеансоваяНастройка.Свойство("Валюта", Валюта);
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			СеансоваяНастройка.Свойство("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
			СеансоваяНастройка.Свойство("ВыводитьГрузоперевозки", ВыводитьГрузоперевозки);
			СеансоваяНастройка.Свойство("ВыводитьЗаказы", ВыводитьЗаказы);			
			// Отбор
			НастройкиКД = "";
			СеансоваяНастройка.Свойство("Отбор", НастройкиКД);
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			Для Каждого СтрОтбор из НастройкиКД.Отбор.Элементы Цикл
				НовОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовОтбор, СтрОтбор);
			КонецЦикла;	
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	//СтруктураНастройки.Вставить("НачалоПериода", НачалоПериода);
	//СтруктураНастройки.Вставить("КонецПериода", КонецПериода);
	СтруктураНастройки.Вставить("Рубли", Рубли);
	СтруктураНастройки.Вставить("Валюта", Валюта);
	СтруктураНастройки.Вставить("Группировки", Группировки.Выгрузить());
	СтруктураНастройки.Вставить("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
	СтруктураНастройки.Вставить("ВыводитьГрузоперевозки", ВыводитьГрузоперевозки);
	СтруктураНастройки.Вставить("ВыводитьЗаказы", ВыводитьЗаказы);
	СтруктураНастройки.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда
		СписокПолей.Добавить("ВалНачОстаток");
		СписокПолей.Добавить("ВалКонОстаток");
		СписокПолей.Добавить("ВалПриход");
		СписокПолей.Добавить("ВалРасход");
		СписокПолей.Добавить("РубНачОстаток");
		СписокПолей.Добавить("РубКонОстаток");
		СписокПолей.Добавить("РубПриход");
		СписокПолей.Добавить("РубРасход");
		СписокПолей.Добавить("ПериодСекунда");
		СписокПолей.Добавить("Регистратор");
		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
		
	Если НЕ Рубли И НЕ Валюта Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного показателя!");
		Возврат;		
	КонецЕсли;
	
	Если Группировки.Количество() = 0 Тогда
		_УФК.ВывестиПредупреждение("Не выбрано ни одной группировки!");
		Возврат;				
	КонецЕсли;	
	
	_Настройка(Истина);
	СформироватьОтчет();
	ОбработатьОтчет();
		
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
		
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	
	_СохранитьСеансовуюНастройку();
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	
	Настройки = _сф.ст_Создать("НачалоПериода,КонецПериода,Рубли,Валюта,Группировки,ВыводитьДокументыДвижения,ВыводитьГрузоперевозки,ВыводитьЗаказы");
	Настройки.НачалоПериода = НачалоПериода;
	Настройки.КонецПериода = КонецПериода;
	Настройки.Рубли = Рубли;
	Настройки.Валюта = Валюта;
	Настройки.Группировки = Группировки.Выгрузить();
	Настройки.ВыводитьДокументыДвижения = ВыводитьДокументыДвижения;
	Настройки.ВыводитьГрузоперевозки = ВыводитьГрузоперевозки;
	Настройки.ВыводитьЗаказы = ВыводитьЗаказы;
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор));
	
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "0:00:00", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "23:59:59", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сальдо на начало периода", "Сальдо на " + Формат(НачалоПериода,"ДФ=dd.MM.yy"), ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сальдо на конец периода", "Сальдо на " + Формат(КонецПериода,"ДФ=dd.MM.yy"), ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "ВалютнаяСумма", "Вал.", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "РублеваяСумма", Строка(ВРУ), ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "ВРУ", Строка(ВРУ));
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Начислено", "Начислено", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Оплачено", "Оплачено", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры	

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
	СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	
	ДоступныеДействия = Новый Массив();
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
	
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	//Настройки.ДополнительныеСвойства.Вставить("НачалоПериода", НачалоПериода);
	//Настройки.ДополнительныеСвойства.Вставить("КонецПериода", КонецПериода);
	Настройки.ДополнительныеСвойства.Вставить("Рубли", Рубли);
	Настройки.ДополнительныеСвойства.Вставить("Валюта", Валюта);
	//Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки.Выгрузить());
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); // ДанныеФормыКоллекция
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьДокументыДвижения", ВыводитьДокументыДвижения);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьГрузоперевозки", ВыводитьГрузоперевозки);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаказы", ВыводитьЗаказы);
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма,Настройки);

КонецПроцедуры
