
Функция ПолучитьРезультат(ОбъектНастроек, ВернутьМассив=Ложь) Экспорт 

	СоответствиеОбщегоМакетаПоИмени 	= CW_КлючевыеПоказателиСервер.ПолучитьСоответствиеИмениМакета();
	РеквизитыОтбораПоГруппеПользователя = CW_КлючевыеПоказателиСервер.ПолучитьСоответствиеИмениМакетаОтборуПоГруппеПользователя();
	ДебиторскаяЗадолженность 			= (ОбъектНастроек.ИмяМакета = "ДебиторскаяЗадолженность");
	
	ИмяМакета 	= СоответствиеОбщегоМакетаПоИмени.Получить(ОбъектНастроек.ИмяМакета);
	Схема 		= ПолучитьОбщийМакет(ИмяМакета);    
	
	НастройкиКомпоновки = ОбъектНастроек.ХранилищеНастроек.Получить(); 
	Если НастройкиКомпоновки = Неопределено Тогда    
		НастройкиКомпоновки = Схема.НастройкиПоУмолчанию; 
	КонецЕсли;
	
	Если Не ДебиторскаяЗадолженность Тогда
		РеквизитыОтбора 	= РеквизитыОтбораПоГруппеПользователя.Получить(ОбъектНастроек.ИмяМакета);
		ГруппаПользователя  = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
		
		ОтборПоГруппеПользователяИспользуется = ГруппаПользователя[РеквизитыОтбора.Используется];
		
		Если ГруппаПользователя = ПредопределенноеЗначение("Справочник.CW_ГруппыПользователей.Администраторы")
			ИЛИ ГруппаПользователя.ПолныеПрава Тогда
			ОтборПоГруппеПользователяИспользуется = Ложь;
		КонецЕсли;
		
		Если ОтборПоГруппеПользователяИспользуется Тогда
			НастройкиОтбораПоГруппе  = ГруппаПользователя[РеквизитыОтбора.ХранилищеНастроек].Получить();
			Если НастройкиОтбораПоГруппе <> Неопределено Тогда   
				_УФС.СкопироватьОтбор(НастройкиОтбораПоГруппе.Отбор, НастройкиКомпоновки.Отбор, Ложь);	
			КонецЕсли; 
		КонецЕсли;   
	КонецЕсли;
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 	= КомпоновщикМакета.Выполнить(Схема, НастройкиКомпоновки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	Коллекция = Новый ТаблицаЗначений;   
	
	ПроцессорВыводаРезультата 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
	ПроцессорВыводаРезультата.УстановитьОбъект(Коллекция);
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	Если ДебиторскаяЗадолженность Тогда
		Если Коллекция.Количество() > 0 Тогда
			СтрокаИтогов =  Коллекция[0];
			Возврат СтрокаИтогов[ОбъектНастроек.ИмяПоказателя];
		КонецЕсли;
	Иначе 
		Если ВернутьМассив Тогда
			Возврат Коллекция.ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
		
		Возврат Коллекция.Количество();  
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции       

Функция ПолучитьДебиторскуюЗапдолженность()
	
КонецФункции

