
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Владелец = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ) 

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() 
		или Родитель <> Ссылка.Родитель Тогда
			ИндексЭлемента = ПолучитьИндексЭлемента();                                    
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьИндексЭлемента()   
	
	ИндексЭлемента = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиКлючевыхПоказателей.ИндексЭлемента КАК ИндексЭлемента
	|ИЗ
	|	Справочник.CW_НастройкиКлючевыхПоказателей КАК НастройкиКлючевыхПоказателей
	|ГДЕ
	|	НастройкиКлючевыхПоказателей.Владелец = &Владелец
	|	И НастройкиКлючевыхПоказателей.Родитель = &Родитель
	|	И НастройкиКлючевыхПоказателей.ЭтоГруппа = &ЭтоГруппа
	|	И НастройкиКлючевыхПоказателей.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИндексЭлемента УБЫВ";  
	
	Запрос.УстановитьПараметр("Владелец", 	Владелец);  
	Запрос.УстановитьПараметр("Родитель", 	Родитель);
	Запрос.УстановитьПараметр("ЭтоГруппа", 	ЭтоГруппа);
	Запрос.УстановитьПараметр("Владелец", 	ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда  
		ИндексЭлемента =  Выборка.ИндексЭлемента;
	КонецЕсли;
	
	Возврат ИндексЭлемента + 1;
	
КонецФункции