
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Пользователь",  ПараметрКоманды); 
	ПараметрыФормы.Вставить("ВариантОтчета", "АктивностьПользователя"); 
	
    ОткрытьФорму("Отчет.CW_ЛичныйКабинетСтатистика.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
