
// Предназначена для конвертации mxl в pdf/xls на мобильном устройстве (мобильная платформа "не умеет" этого)
Функция ПолучитьФайлПечатнойФормыВТребуемомФормате(ПечатнаяФорма, Формат)
	
	Возврат МобильноеПриложениеПредприниматель.ПолучитьФайлПечатнойФормыВТребуемомФормате(ПечатнаяФорма, Формат);
	
КонецФункции

#Область СинхронизацияСРазбивкойСообщенийНаБолки

Функция ПодготовитьДанныеКПолучению(ИмяПланаОбмена, КодУзлаПланаОбмена, ДанныеМобильногоПриложения, РазмерЧастиФайла, ИдентификаторФоновогоЗадания, СообщениеОбОшибке)
	
	СообщениеОбОшибке = ТекстСообщенияНедоступностиСервиса();
	
КонецФункции

Функция ПолучитьРезультатПодготовкиДанныхКВыгрузке(ИдентификаторФоновогоЗадания, СообщениеОбОшибке)
	
	СообщениеОбОшибке 		= "";
	КоличествоЧастейФайла 	= "";
	ИдентификаторФайла    	= "";
	СостояниеЗадания    	= СостояниеФоновогоЗадания.Отменено;
	
	СообщениеОбОшибке = ТекстСообщенияНедоступностиСервиса();
	
	// Подготовим структуру - шаблон ответа операции
	ВозвращаемаяСтруктура = Новый Структура;
	ВозвращаемаяСтруктура.Вставить("СообщениеОбОшибке", 		СообщениеОбОшибке);
	ВозвращаемаяСтруктура.Вставить("ИдентификаторФайла", 		ИдентификаторФайла);
	ВозвращаемаяСтруктура.Вставить("КоличествоЧастейФайла", 	КоличествоЧастейФайла);
	ВозвращаемаяСтруктура.Вставить("СостоянияФоновогоЗадания", 	СостояниеЗадания);
	ВозвращаемаяСтруктура.Вставить("ЗаданиеЕщеВыполняется", 	СостояниеЗадания = СостояниеФоновогоЗадания.Активно);
	
	Возврат Новый ХранилищеЗначения(ВозвращаемаяСтруктура, Новый СжатиеДанных(9));
	
КонецФункции

Функция ВыгрузитьЧастьФайла(ИдентификаторФайла, НомерВыгружаемойЧастиФайла, ВсегоЧастей, СообщениеОбОшибке)
	
	СообщениеОбОшибке = ТекстСообщенияНедоступностиСервиса();
	
КонецФункции

Функция ВыгрузитьЧастьФайлаКакХранилищеЗначения(ИдентификаторФайла, НомерВыгружаемойЧастиФайла, ВсегоЧастей, СообщениеОбОшибке)
	
	СообщениеОбОшибке = ТекстСообщенияНедоступностиСервиса();
	
КонецФункции

Функция ПодтвердитьПолучениеДанных(ИдентификаторФайла, ПодтверждениеПолученияФайла, СообщениеОбОшибке)
	
	СообщениеОбОшибке = ТекстСообщенияНедоступностиСервиса();
	
КонецФункции

Функция Ping()
	Возврат "";
КонецФункции

#КонецОбласти

Функция ОпределитьНомерДокумента(ИмяПланаОбмена, КодУзлаПланаОбмена, ДанныеМобильногоПриложения, СообщениеОбОшибке)
	
	СообщениеОбОшибке = "";
	СообщениеОбменаСтрокаXML = ДанныеМобильногоПриложения.Получить();
	
	УзелОбмена = МобильноеПриложениеПредпринимательПереопределяемый.НайтиУзелОбмена(КодУзлаПланаОбмена);
	НомерБП = "";
	
	Если СообщениеОбменаСтрокаXML <> Неопределено Тогда
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СообщениеОбменаСтрокаXML);
		
		ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
		
		URIПространстваИмен = МобильноеПриложениеПредприниматель.URIПространстваИменПакетаXDTO();
		
		Пока ЧтениеXML.URIПространстваИмен = URIПространстваИмен Цикл
			
			ТипОбъектаXDTO	= ФабрикаXDTO.Тип(URIПространстваИмен, ЧтениеXML.Имя);
			ОбъектXDTO		= ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
			
			Если ОбъектXDTO.Тип().Имя = "СчетНаОплатуПокупателю" Тогда
				МобильноеПриложениеПредпринимательПереопределяемый.ЗаписатьСчетНаОплатуПокупателю(ОбъектXDTO, УзелОбмена, Ложь, НомерБП);
			ИначеЕсли ОбъектXDTO.Тип().Имя = "АктСверкиВзаиморасчетов" Тогда
				МобильноеПриложениеПредпринимательПереопределяемый.ЗаписатьАктСверкиВзаиморасчетов(ОбъектXDTO, УзелОбмена, Ложь, НомерБП);
			ИначеЕсли ОбъектXDTO.Тип().Имя = "РеализацияТоваровУслуг" Тогда
				ДопДействие = Ложь;
				МобильноеПриложениеПредпринимательПереопределяемый.ЗаписатьРеализацияТоваровУслуг(ОбъектXDTO, УзелОбмена, Ложь, НомерБП, ДопДействие);
				ОтветСтруктура = Новый Структура("ВыписанСчетФактура", ДопДействие);
				ДанныеМобильногоПриложения = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
			ИначеЕсли ОбъектXDTO.Тип().Имя = "Контрагент" Тогда
				МобильноеПриложениеПредпринимательПереопределяемый.ЗаписатьКонтрагента(ОбъектXDTO, УзелОбмена);
			ИначеЕсли ОбъектXDTO.Тип().Имя = "Договор" Тогда
				МобильноеПриложениеПредпринимательПереопределяемый.ЗаписатьДоговор(ОбъектXDTO, УзелОбмена);
			ИначеЕсли ОбъектXDTO.Тип().Имя = "Номенклатура" Тогда
				МобильноеПриложениеПредпринимательПереопределяемый.ЗаписатьНоменклатуру(ОбъектXDTO, УзелОбмена);
			КонецЕсли;
			
		КонецЦикла;
		
		ЧтениеСообщения.ЗакончитьЧтение();
		ЧтениеXML.Закрыть();
		
	КонецЕсли;
	
	Возврат НомерБП;
		
КонецФункции

Функция ПолучитьПечатнуюФорму(ИмяПечатнойФормы, ТипДокумента, Ссылка, ФорматФайла, СообщениеОбОшибке)
	
	ВызватьИсключение НСтр("ru='Не удалось сформировать печатную форму. Используйте новое мобильное приложение 1С:Бухгалтерия'");
	
КонецФункции

Функция ПолучитьСведенияОбОрганизации(ИНН, СообщениеОбОшибке)
	
	ИНН 		= СокрП(ИНН);
	ЭтоЮрЛицо   = (СтрДлина(ИНН) = 10);
	
	РеквизитыКонтрагента = Неопределено;
	РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(ИНН, ЭтоЮрЛицо);
	
	Если РезультатПроверки.СоответствуетТребованиям Тогда
		Если РезультатПроверки.ЭтоЮрЛицо Тогда
			СведенияОКонтрагенте = РаботаСКонтрагентами.СведенияОЮридическомЛицеПоИНН(ИНН);
			РеквизитыКонтрагента = Новый Структура("ОписаниеОшибки", "");
			Если ЗначениеЗаполнено(СведенияОКонтрагенте.ОписаниеОшибки) Тогда
				 РеквизитыКонтрагента.ОписаниеОшибки = СведенияОКонтрагенте.ОписаниеОшибки;
			ИначеЕсли ЗначениеЗаполнено(СведенияОКонтрагенте.ЕГРЮЛ) Тогда
				РеквизитыКонтрагента = СведенияОКонтрагенте.ЕГРЮЛ;
			Иначе
				ШаблонОписанияОшибки = НСтр("ru = 'Не удалось найти данные для заполнения реквизитов по ИНН %1.'");
				РеквизитыКонтрагента.ОписаниеОшибки = СтрШаблон(ШаблонОписанияОшибки, ИНН);
			КонецЕсли;
			РеквизитыКонтрагента.Вставить("ИНН", ИНН);
			Руководитель = Новый Структура("Фамилия, Имя, Отчество, Представление, ИНН, ДатаЗаписи, Должность");
			Если Не ЗначениеЗаполнено(РеквизитыКонтрагента.ОписаниеОшибки) Тогда
				Если ЗначениеЗаполнено(РеквизитыКонтрагента.Руководители) Тогда
					ЗаполнитьЗначенияСвойств(Руководитель, РеквизитыКонтрагента.Руководители[0]);
				Иначе
					Руководитель = Неопределено;
				КонецЕсли;
				РеквизитыКонтрагента.Вставить("Руководитель", Руководитель);
				РеквизитыКонтрагента.Вставить("КодОКВЭД",
					?(ЗначениеЗаполнено(РеквизитыКонтрагента.ВидДеятельности), РеквизитыКонтрагента.ВидДеятельности.Код, Неопределено));
				РеквизитыКонтрагента.Вставить("ЭтоОКВЭД2",  
					?(ЗначениеЗаполнено(РеквизитыКонтрагента.ВидДеятельности) И РеквизитыКонтрагента.ВидДеятельности.Классификатор = "ОКВЭД2", Истина, Ложь));
			КонецЕсли;
		Иначе
			РеквизитыКонтрагента = РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН(ИНН);
			РеквизитыКонтрагента.Вставить("КодОКВЭД",
				?(ЗначениеЗаполнено(РеквизитыКонтрагента.ВидДеятельности), РеквизитыКонтрагента.ВидДеятельности.Код, Неопределено));
			РеквизитыКонтрагента.Вставить("ЭтоОКВЭД2",  
				?(ЗначениеЗаполнено(РеквизитыКонтрагента.ВидДеятельности) И РеквизитыКонтрагента.ВидДеятельности.Классификатор = "ОКВЭД2", Истина, Ложь));
		КонецЕсли;
		
		РеквизитыКонтрагента.Вставить("ЮридическоеФизическоеЛицо", 
			?(РезультатПроверки.ЭтоЮрЛицо, "ЮридическоеЛицо", "ФизическоеЛицо"));
		
		Если ЗначениеЗаполнено(РеквизитыКонтрагента.ОписаниеОшибки) Тогда
			СообщениеОбОшибке = РеквизитыКонтрагента.ОписаниеОшибки;
		КонецЕсли;
	Иначе
		СообщениеОбОшибке = РезультатПроверки.ОписаниеОшибки;
	КонецЕсли;
	
	Возврат Новый ХранилищеЗначения(РеквизитыКонтрагента, Новый СжатиеДанных(9));
	
КонецФункции

Функция ПолучитьДосьеКонтрагента(ИНН, СообщениеОбОшибке)
	
	ИНН 		= СокрЛП(ИНН);
	ЭтоЮрЛицо   = (СтрДлина(ИНН) = 10);
	
	ДосьеКонтрагента = Новый Структура;
	РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(ИНН, ЭтоЮрЛицо);
	
	Если РезультатПроверки.СоответствуетТребованиям Тогда
		
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		АдресХранилища = ПоместитьВоВременноеХранилище("",);
		
		ПараметрыОтчета = Новый Структура;
		ПараметрыОтчета.Вставить("ИНН"              , ИНН);
		ПараметрыОтчета.Вставить("Контрагент"       , Контрагент);
		ПараметрыОтчета.Вставить("СостояниеДосье"   , "");
		ПараметрыОтчета.Вставить("СостояниеПроверки", "");
		
		ОписаниеОшибки = "Досье слишком большое или сервер сейчас перегружен, попробуйте поднее.";
		
		Для Шаг = 1 По 128 Цикл
			
			Отчеты.ДосьеКонтрагента.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
			ДанныеОтчета   = ПолучитьИзВременногоХранилища(АдресХранилища);
			
			//Если ошибка
			Если ДанныеОтчета.СостояниеДосье = "Завершено"
				И ДанныеОтчета.СостояниеПроверки = "Завершено" Тогда
				
				ОписаниеОшибки = ДанныеОтчета.ОписаниеОшибки;
				Прервать;
			КонецЕсли;
			
			//Если отчет сформирован
			Если ДанныеОтчета.СостояниеДосье = "СформированОтчет"
				И ДанныеОтчета.СостояниеПроверки = "СформированОтчет" Тогда
				
				ОписаниеОшибки = ДанныеОтчета.ОписаниеОшибки;
				Прервать;
			КонецЕсли;
			
			ПараметрыОтчета.Вставить("СостояниеДосье"   , ДанныеОтчета.СостояниеДосье);
			ПараметрыОтчета.Вставить("СостояниеПроверки", ДанныеОтчета.СостояниеПроверки);
			
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			
			ТаблицаРазделов = Новый ТаблицаЗначений;
			ТаблицаРазделов.Колонки.Добавить("ИмяРаздела");
			ТаблицаРазделов.Колонки.Добавить("Заголовок");
			ТаблицаРазделов.Колонки.Добавить("ТД");
			ТаблицаРазделов.Колонки.Добавить("КоличествоСтраниц");
			ТаблицаРазделов.Колонки.Добавить("НомерСтраницы");
						
			СтрокаРаздела = ТаблицаРазделов.Добавить();
			СтрокаРаздела.ИмяРаздела 	= "РезультатГлавное";
			СтрокаРаздела.Заголовок 	= "Главное";
			
			СтрокаРаздела = ТаблицаРазделов.Добавить();
			СтрокаРаздела.ИмяРаздела 	= "РезультатДанныеГосРеестров";
			СтрокаРаздела.Заголовок 	= ?(ДанныеОтчета.ЭтоЮридическоеЛицо, "Данные ЕГРЮЛ", "Данные ЕГРИП");
			
			СтрокаРаздела = ТаблицаРазделов.Добавить();
			СтрокаРаздела.ИмяРаздела 	= "РезультатБухгалтерскаяОтчетность";
			СтрокаРаздела.Заголовок 	= "Бухгалтерская отчетность";
			
			СтрокаРаздела = ТаблицаРазделов.Добавить();
			СтрокаРаздела.ИмяРаздела 	= "РезультатАнализОтчетности";
			СтрокаРаздела.Заголовок 	= "Анализ отчетности";
			
			СтрокаРаздела = ТаблицаРазделов.Добавить();
			СтрокаРаздела.ИмяРаздела 	= "РезультатФинансовыйАнализ";
			СтрокаРаздела.Заголовок 	= "Финансовый анализ";
			
			СтрокаРаздела = ТаблицаРазделов.Добавить();
			СтрокаРаздела.ИмяРаздела 	= "РезультатПроверки";
			СтрокаРаздела.Заголовок 	= "Проверки";
			
			КоличествоСтраниц = 0;
			
			ДанныеДосье    = ДанныеОтчета.ДанныеДосье;
			ДанныеПроверки = ДанныеОтчета.ДанныеПроверки;
				
			НаименованиеКонтрагента = ДанныеДосье.НаименованиеКонтрагента;
			
			Для Каждого Раздел Из ТаблицаРазделов Цикл
				
				Если ДанныеДосье.Свойство(Раздел.ИмяРаздела)
					ИЛИ ДанныеПроверки.Свойство(Раздел.ИмяРаздела) Тогда
					
					ИсходныйТабличныйДокумент = ?(ДанныеДосье.Свойство(Раздел.ИмяРаздела) , 
						ДанныеДосье[Раздел.ИмяРаздела], ДанныеПроверки[Раздел.ИмяРаздела]);
					ИсходныйТабличныйДокумент.АвтоМасштаб = Истина;
					
					//Развернем группировки
					Отбор = Новый Структура("ИмяДокумента", Раздел.ИмяРаздела);
					СтрокиТаблицы = ?(ДанныеДосье.Свойство(Раздел.ИмяРаздела), 
						ДанныеДосье.ОбластиРасшифровки.НайтиСтроки(Отбор), ДанныеПроверки.ОбластиРасшифровки.НайтиСтроки(Отбор));
					Для Каждого СтрокаОбласти Из СтрокиТаблицы Цикл
						НомерСтрокиЕще = СтрокаОбласти.ПерваяСтрока - 1;
						ИсходныйТабличныйДокумент.Область(НомерСтрокиЕще, , НомерСтрокиЕще).Видимость = Ложь;
						ИсходныйТабличныйДокумент.Область(СтрокаОбласти.ПерваяСтрока, , СтрокаОбласти.ПоследняяСтрока-1).Видимость = Истина;
					КонецЦикла;
					Раздел.ТД = ИсходныйТабличныйДокумент;
					Раздел.КоличествоСтраниц = ИсходныйТабличныйДокумент.КоличествоСтраниц();
					Раздел.НомерСтраницы = КоличествоСтраниц + 1;
					КоличествоСтраниц = КоличествоСтраниц + Раздел.КоличествоСтраниц;
				Иначе
					Раздел.КоличествоСтраниц = 0;
				КонецЕсли;
				
			КонецЦикла;
			
			ТабличныйДокумент = Новый ТабличныйДокумент;
			ТабличныйДокумент.АвтоМасштаб			= Истина;
			ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
			ТабличныйДокумент.ПолеСверху			= 10;
			ТабличныйДокумент.ПолеСнизу				= 10;
			ТабличныйДокумент.ПолеСлева          	= 5;
			ТабличныйДокумент.ПолеСправа         	= 5;
			
			Макет = ПланыОбмена.МобильноеПриложениеПредприниматель.ПолучитьМакет("МакетОглавление");
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.ЗаголовокОтчета = НСтр("ru='Досье контрагента '") + НаименованиеКонтрагента;
			ОбластьМакета.Параметры.ДатаОтчета		= Формат(ТекущаяДата(), "ДЛФ=ДД");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Разделитель");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("Содержание");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Для Каждого Раздел Из ТаблицаРазделов Цикл
				Если Раздел.КоличествоСтраниц = 0 Тогда
					Продолжить;
				КонецЕсли;
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				ОбластьМакета.Параметры.Заполнить(Раздел);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Отступ");
			ТабличныйДокумент.Вывести(ОбластьМакета);
						
			Для Каждого Раздел Из ТаблицаРазделов Цикл
				Если Раздел.КоличествоСтраниц = 0 Тогда
					Продолжить;
				КонецЕсли;
				Если Раздел.ИмяРаздела <> "РезультатГлавное" Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();					
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Разделитель");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ТабличныйДокумент.Вывести(Раздел.ТД);
			КонецЦикла;
			
			ИмяФайла = СтрШаблон(НСтр("ru='Досье контрагента %1'"), 
				ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеКонтрагента, "")) 
				+ ".pdf";
			КаталогВременныхФайлов = ОбменДаннымиПовтИсп.КаталогВременногоХранилищаФайлов();
			ПолноеИмяФайла         = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(КаталогВременныхФайлов, ИмяФайла);

			ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF);
			
			ДосьеКонтрагента.Вставить("Файл", Новый ДвоичныеДанные(ПолноеИмяФайла));
			ДосьеКонтрагента.Вставить("ИмяФайла", ИмяФайла);
			
			УдалитьФайлы(ПолноеИмяФайла);
		
		Иначе
			СообщениеОбОшибке = ДанныеОтчета.ОписаниеОшибки;
		КонецЕсли;
		
	Иначе
		СообщениеОбОшибке = РезультатПроверки.ОписаниеОшибки;
	КонецЕсли;
	
	Возврат Новый ХранилищеЗначения(ДосьеКонтрагента, Новый СжатиеДанных(9));
	
КонецФункции

Функция ПолучитьЗаполненныйАктСверки(ДанныеМобильногоПриложения)
	
	СообщениеОбменаСтрокаXML = ДанныеМобильногоПриложения.Получить();
	СтруктураПараметров = Неопределено;
	
	Результат = Новый Структура();
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ДанныеЗаполнения", Неопределено);
	Результат.Вставить("СообщениеОбОшибке","");
		
	Если СообщениеОбменаСтрокаXML <> Неопределено Тогда
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СообщениеОбменаСтрокаXML);
		URIПространстваИмен = МобильноеПриложениеПредприниматель.URIПространстваИменПакетаXDTO();
		
		Пока ЧтениеXML.Прочитать() Цикл
			
			ТипОбъектаXDTO	= ФабрикаXDTO.Тип(URIПространстваИмен, ЧтениеXML.Имя);
			ОбъектXDTO		= ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
			
			Если ОбъектXDTO.Тип().Имя = "АктСверкиВзаиморасчетов" Тогда
				
				СтруктураПараметров = МобильноеПриложениеПредпринимательПереопределяемый.ПолучитьРеквизитыАктСверкиВзаиморасчетов(ОбъектXDTO);
				
			КонецЕсли;
		КонецЦикла;
		
		ЧтениеXML.Закрыть();
	КонецЕсли;
	
	Если СтруктураПараметров = Неопределено Тогда
		
		Результат.СообщениеОбОшибке = НСтр("ru = 'Не корректные параметры заполнения.'");
		Возврат Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
		
	КонецЕсли;
	
	АдресХранилища 		= ПоместитьВоВременноеХранилище(Неопределено);
	Документы.АктСверкиВзаиморасчетов.ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища);
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") 
		ИЛИ НЕ СтруктураДанных.Успешно Тогда
		
		Результат.СообщениеОбОшибке = НСтр("ru = 'Не удалось получить данные для заполнения.'");
		Возврат Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
			
	КонецЕсли;
		
	Результат.Успешно = СтруктураДанных.Успешно;
	Результат.ДанныеЗаполнения = МобильноеПриложениеПредпринимательПереопределяемый.ПодготовитьСообщениеЗаполненияАктаСверки(СтруктураДанных);
	
	Возврат Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
	
КонецФункции

Функция ЗаписатьНастройкиДоставляемыхУведомлений(КодУзлаПланаОбмена, ПолучаетУведомления, ИдентификаторXDTO)
	
	СообщениеОбОшибке = "";
	
	УстановитьПривилегированныйРежим(Истина);
	УзелОбмена = ПланыОбмена.МобильноеПриложениеПредприниматель.НайтиПоКоду(КодУзлаПланаОбмена);

	Если УзелОбмена.Пустая() Тогда
		СообщениеОбОшибке = НСтр("ru='Ошибка синхронизации: не найден узел обмена данными'");
	Иначе
		УзелОбъект     = УзелОбмена.ПолучитьОбъект();
		УзелОбъект.ПолучаетPushУведомления = ПолучаетУведомления;
		ИдентификаторПодписчика = СериализаторXDTO.ПрочитатьXDTO(ИдентификаторXDTO);
		ДанныеИдентификатора    = Новый ХранилищеЗначения(ИдентификаторПодписчика, Новый СжатиеДанных(9));
		УзелОбъект.ИдентификаторПодписчикаУведомлений = ДанныеИдентификатора;
		
		Попытка
			УзелОбъект.Записать();
		Исключение
			СообщениеОбОшибке = ОписаниеОшибки();			
		КонецПопытки;
	КонецЕсли;
	
	Возврат СообщениеОбОшибке;
	
КонецФункции

Функция ТекстСообщенияНедоступностиСервиса()
	Возврат НСтр("ru='Сервис устарел и более недоступен. Используйте новое мобильное приложение 1С:Бухгалтерия'");
КонецФункции