&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	CW_РегистрацияПрограммыКлиент.ПолучитьРегистрационныйНомер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКлюч(Команда)  
	
	Если РежимПолученияКлюча = 1 Тогда
		Фильтр = "Лицензия CoralWay (*.lcw)|*.lcw";
		ПараметрыДиалога 	= Новый ПараметрыДиалогаПомещенияФайлов("Выберите помещаемый файл", Ложь, Фильтр);
		ОписаниеОповещения 	= Новый ОписаниеОповещения("ЗавершитьПомещениеФайла", ЭтотОбъект);
		
		НачатьПомещениеФайлаНаСервер(ОписаниеОповещения,,,, ПараметрыДиалога, УникальныйИдентификатор);
	Иначе    
		CW_РегистрацияПрограммыКлиент.ПолучитьКлючЧерезИнтернетПоддержку(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗавершитьПомещениеФайла(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Ответ = CW_РегистрацияПрограммыСервер.ОбработатьКлюч(РегистрационныйНомер, ОписаниеПомещенногоФайла.Адрес);
	Если Ответ.Код  = 0 Тогда   
		ЭтаФорма.Закрыть(Ответ);
	Иначе
		ПоказатьПредупреждение(, Ответ.ОписаниеОшибки); 
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)   
	
	Если ИмяСобытия = "РегистрационныйКлючЗагружен" Тогда
		ЭтаФорма.Закрыть(Параметр);
	КонецЕсли;
	
КонецПроцедуры