#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьПрофильДоступаНаСервере(Отказ) Экспорт
	
	Попытка
		СпрОбъект = Справочники.CW_ПрофилиДоступа.ПоУмолчанию.ПолучитьОбъект();
		
		СпрОбъект.ОбъектыДоступа.Очистить();
		СпрОбъект.ЗначенияДоступа.Очистить();
		
		//Добавляем объект доступа
		СтрокаОбъектыДоступа				= СпрОбъект.ОбъектыДоступа.Добавить();
		СтрокаОбъектыДоступа.ОбъектДоступа  = Перечисления.CW_ОбъектыДоступа.Справочник_Контрагенты;
		СтрокаОбъектыДоступа.ТипДоступа 	= Перечисления.CW_ТипыДоступа.Все;
		
		СтрокаОбъектыДоступа				= СпрОбъект.ОбъектыДоступа.Добавить();
		СтрокаОбъектыДоступа.ОбъектДоступа  = Перечисления.CW_ОбъектыДоступа.Справочник_ВерсииБюджетов;
		СтрокаОбъектыДоступа.ТипДоступа 	= Перечисления.CW_ТипыДоступа.Все;
		
		СпрОбъект.Записать();
	Исключение
		Отказ = истина;
	КонецПопытки;
	
КонецПроцедуры

#КонецЕсли
