&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УправлениеЭлементамиФормы();	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Отладка = Объект.Обработка.Отладка;
	Элементы.Настройка.Доступность = (Объект.Обработка.НастройкаСубъекта И НЕ Объект.Ссылка.Пустая());
	Элементы.ИнтерактивнаяЗагрузка.Доступность = (Объект.Загрузка);
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	ИмяФормыНастроек = _ИмяФормыНастроек();
	Если ИмяФормыНастроек <> Неопределено Тогда
		
		ПФ = Новый Структура("Объект,Субъект",Объект.Обработка,Объект.Ссылка);
		ОткрытьФорму(ИмяФормыНастроек,ПФ,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры



&НаСервере
Функция _ИмяФормыНастроек()
	// --- 
	
	// подключаем обработку, вдруг ещё не подключена
	_ПО.ПодключитьОбработку(Объект.Обработка);
	Возврат(_ПО.ПолучитьПолноеИмяФормыПоТипу(Объект.Обработка,"ФормаНастроекСубъекта"));
	
	// --- 
КонецФункции

&НаСервере
Функция _ИмяФормыИнтерактивнойЗагрузки()
	// --- 
	
	// подключаем обработку, вдруг ещё не подключена
	_ПО.ПодключитьОбработку(Объект.Обработка);
	Возврат(_ПО.ПолучитьПолноеИмяФормыПоТипу(Объект.Обработка,"ФормаИнтерактивнойЗагрузки"));
	
	// --- 
КонецФункции


&НаКлиенте
Процедура ОбработкаПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура ИнтерактивнаяЗагрузка(Команда)
	
	ИмяФормыИЗ = _ИмяФормыИнтерактивнойЗагрузки();
	Если ИмяФормыИЗ <> Неопределено Тогда
		
		ПФ = Новый Структура("Объект,Субъект",Объект.Обработка,Объект.Ссылка);
		ОткрытьФорму(ИмяФормыИЗ,ПФ);
		
	КонецЕсли; 
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти