#Область ПрограммныйИнтерфейс

#Область ПараметрыВыбора

// Устанавливает параметры выбора номенклатуры.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой нужно установить параметры выбора
//  ВидыПродукции - СправочникСсылка.ВидыПродукцииИС, Массив Из СправочникСсылка.ВидыПродукцииИС - Вид продукции.
//  ИмяПоляВвода - Строка - имя поля ввода номенклатуры.
Процедура УстановитьПараметрыВыбораНоменклатуры(Форма, ВидыПродукции = Неопределено, ИмяПоляВвода = "ТоварыНоменклатура") Экспорт
	
	//++ НЕ ГОСИС
	ПараметрыВыбора = Новый Массив;
	
	Для Каждого ПараметрВыбора Из Форма.Элементы[ИмяПоляВвода].ПараметрыВыбора Цикл
		Если ПараметрВыбора.Имя <> "Отбор.ВидПродукцииИС"
				И ПараметрВыбора.Имя <> "Отбор.АлкогольнаяПродукцияВоВскрытойТаре"
				И ПараметрВыбора.Имя <> "Отбор.ТипНоменклатуры" Тогда
			ПараметрыВыбора.Добавить(ПараметрВыбора);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ВидыПродукции) Тогда
		Если ТипЗнч(ВидыПродукции) = Тип("СправочникСсылка.ВидыПродукцииИС") Тогда
			ВидыПродукцииОтбора = Новый Массив;
			ВидыПродукцииОтбора.Добавить(ВидыПродукции);
		Иначе
			ВидыПродукцииОтбора = ВидыПродукции;
		КонецЕсли;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидПродукцииИС",  ВидыПродукцииОтбора));
	КонецЕсли;
	
	Форма.Элементы[ИмяПоляВвода].ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	//-- НЕ ГОСИС

КонецПроцедуры

#КонецОбласти

#КонецОбласти
