&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Список") <> Неопределено Тогда
		Параметры.Свойство("Список", Список);
	КонецЕсли;
	
	Для Каждого Стр из Список Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Значение) Тогда
			Стр.Представление = "<Неопределено>";
		Иначе
			Стр.Представление = Строка(Стр.Значение);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура кнОК(Команда)
	
	Рез = Новый СписокЗначений;
	Для Каждого Стр из Список Цикл
		Если Стр.Пометка Тогда
			Рез.Добавить(Стр.Значение);
			Если НЕ ЗначениеЗаполнено(Стр.Значение) Тогда
				Рез.Добавить(Неопределено);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	ЭтаФорма.Закрыть(Рез);
	
КонецПроцедуры

&НаКлиенте
Процедура кнОтмена(Команда)
	
	ЭтаФорма.Закрыть();	
	
КонецПроцедуры