&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийШаг	= 1;

	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	Параметры.Свойство("ИмяСервера", 			ИмяСервера);
	Параметры.Свойство("ПортСервера", 		 	Порт);
	Параметры.Свойство("ИмяБазыДанных", 		ИмяБазыДанных);
	Параметры.Свойство("ЗащищенноеСоединение", 	ЗащищенноеСоединение);

	УстановитьВидимостьЭлементов(200);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов(КодСостояния)
	//ТекущийШаг - следуюий шаг

	//Кнопки
	Элементы.ФормаПродолжить.Видимость			= ТекущийШаг  < 3;
	Элементы.ФормаЗавершитьАктивацию.Видимость 	= ТекущийШаг = 3 и КодСостояния = 200;
	
	Элементы.ФормаЗакрытьФорму.Видимость		= ТекущийШаг  < 3;
	
	//Группы
	Элементы.ПараметрыПодключения.Видимость			= ТекущийШаг  = 1 или ТекущийШаг  = 3;
	Элементы.ПараметрыПодключения.ТолькоПросмотр	= ТекущийШаг  = 1;
	
	Элементы.ВводПинКода.Видимость 					= ТекущийШаг  = 2;
	Элементы.ГруппаПроверкаПодключения.Видимость 	= ТекущийШаг  = 3;
	Элементы.ЗавершениеАктивации.Видимость 			= ТекущийШаг  = 4;
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьШагНаКлиенте(Команда)
	
	КодСостояния = СделатьШагНаСервере();
	УстановитьВидимостьЭлементов(КодСостояния);
	
	Если КодСостояния = Неопределено Тогда
		ПоказатьПредупреждение(,"Ошибка работы с интертент!");
		Возврат;
	КонецЕсли;
	
	Если ТекущийШаг = 3 и КодСостояния <> 200 Тогда
		ПоказатьПредупреждение(,"Введен неверный пин-код");
	КонецЕсли;
	
	ОписаниеКодовСостояний = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();
	
	Если ТекущийШаг = 4 Тогда  
		Если КодСостояния <> 200 Тогда
			ПоказатьПредупреждение(,"Код: "+Строка(КодСостояния)+" - " + ОписаниеКодовСостояний.Получить(КодСостояния));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция СделатьШагНаСервере()
	
	Если ТекущийШаг = 1 Тогда
		Ответ = ОбработатьПервыйШаг();
	КонецЕсли;
	
	Если ТекущийШаг = 2 Тогда
		Ответ =  ОбработатьВторойШаг();
		Если Ответ.КодСостояния = 200 Тогда
			ИмяСервера  			= "";
			Порт  					= 80;
			ЗащищенноеСоединение	= Ложь;
			ИмяБазыДанных 			= "";
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийШаг = 3 Тогда
		Ответ = ОбработатьТретийШаг();
	КонецЕсли;
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ответ.КодСостояния = 200 Тогда
		ТекущийШаг = ТекущийШаг + 1;
	КонецЕсли;
	
	Возврат Ответ.КодСостояния;
	
КонецФункции

&НаСервере
Функция ОбработатьПервыйШаг()
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("eventpin", 	XMLСтрока(0));
	СтруктураJSON.Вставить("count", 	XMLСтрока(1));
	СтруктураJSON.Вставить("mail", 		XMLСтрока(""));
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_sendpin", СтруктураJSON);

  	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET"); 
	Если Ответ = Неопределено Тогда
		ОписаниеКодовСостояний 	= CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
		Элементы.Информация.Заголовок ="Отсутствует интернет-соединение";
		Возврат Неопределено;
	КонецЕсли;
	

	Если  Ответ.КодСостояния = 200 Тогда
		mail = Ответ.Заголовки.Получить("mail");
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(Символы.ПС);
		МассивСтрок.Добавить("На электронный адрес ");
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(mail,Новый Шрифт(,,Истина)));
		МассивСтрок.Добавить(" отправлен пин-код для активации доступа к Сервису.");
		МассивСтрок.Добавить(Символы.ПС);
		МассивСтрок.Добавить(Символы.ПС);
		МассивСтрок.Добавить( Новый ФорматированнаяСтрока("Введите полученный пин-код в поле ввода и нажмите ""Продолжить""",Новый Шрифт(,,Истина)));
		МассивСтрок.Добавить(Символы.ПС);
		                      
		Элементы.Информация.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
		
	Иначе
		ОписаниеКодовСостояний 	= CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
		Элементы.Информация.Заголовок ="Код ответа: "+ Ответ.КодСостояния +" - "+ ОписаниеКодовСостояний.Получить(Ответ.КодСостояния);
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

&НаСервере
Функция ОбработатьВторойШаг()    
	
	Структура = Новый Структура;
	Структура.Вставить("РегистрационныйНомер",	XMLСтрока(РегистрационныйНомер));
	Структура.Вставить("ПинКод",	XMLСтрока(ПинКод));
	Структура.Вставить("Событие", 	XMLСтрока(0));
	
	Возврат CW_РегистрацияПрограммыСервер.ПроверитьВведенныйПинКод(Структура, Истина);

КонецФункции

&НаСервере
Функция ОбработатьТретийШаг()
	
	Ответ = ОтправитьДляОбработки("main_checkconnect");
	
	Если Ответ.КодСостояния = 200 Тогда
		//Проверка подключения к текущей базе по переданным параметрам
		Ответ = ОтправитьДляОбработки("lkk_changeparameters");
		Возврат Ответ;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ОтправитьДляОбработки(ИмяЗапроса)
	
	стрПинКод = СтрЗаменить(ПинКод,"-","");
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("servername",	XMLСтрока(ИмяСервера));		
	СтруктураJSON.Вставить("port",			XMLСтрока(Порт));
	СтруктураJSON.Вставить("ssl",			XMLСтрока(ЗащищенноеСоединение));
	СтруктураJSON.Вставить("basename",		XMLСтрока(ИмяБазыДанных));
	СтруктураJSON.Вставить("pin",  			XMLСтрока(стрПинКод));
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос(ИмяЗапроса, СтруктураJSON);

	Возврат CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST"); 
	
КонецФункции

&НаСервере
Функция ПроверитьПодключениеНаСервере()
	
	Ответ = ОтправитьДляОбработки("main_checkconnect");
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Ответ.КодСостояния;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	КодСостояния = ПроверитьПодключениеНаСервере();
	
	Элементы.СоединениеУспешно.Видимость = КодСостояния = 200;
	
	Если КодСостояния <> Неопределено Тогда
		ОписаниеКодовСостояний = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();
		Если КодСостояния = 200 Тогда
			ПоказатьПредупреждение(,"Успешное подключение");
		Иначе    
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка подклчюения! Код: "+Строка(КодСостояния)+" - " + ОписаниеКодовСостояний.Получить(КодСостояния);
			Сообщение.Сообщить();
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,"Не удалось подключиться");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьАктивацию(Команда)
	
	КодСостояния = СделатьШагНаСервере();
	Если КодСостояния = Неопределено Тогда
		ПоказатьПредупреждение(,"Ошибка работы с интертент!");
		Возврат;
	КонецЕсли;
	
	Если КодСостояния = 200 Тогда
		ЭтаФорма.Закрыть(Истина);
	Иначе
		
		Элементы.ГруппаЗавршение.Видимость =  Ложь;
		Элементы.ГруппаОшибка.Видимость =  Истина;
		
		ПоказатьПредупреждение(,"Не удалось завершить активацию Сервиса!",,"Ошибка активации Сервиса");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗащищенноеСоединениеПриИзменении(Элемент)

	Порт = ?(ЗащищенноеСоединение, 443, 80);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("РегистрационныйНомер", 	РегистрационныйНомер);
	СтруктураПараметров.Вставить("ПинКод", 					"");//передаем пустую строку, будут заблокирвоаны все активные
	СтруктураПараметров.Вставить("Событие", 				0);
	
	Успешно =  CW_РегистрацияПрограммыСервер.ПроверитьВведенныйПинКод(СтруктураПараметров);   
	CW_РегистрацияПрограммыСервер.ЗаблокироватьПинКод(СтруктураПараметров);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНеПолучилНажатие(Элемент)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("Если у Вас нет доступа к почтовому ящику, указанному при");
	МассивСтрок.Добавить("приобретении программы ""Бухгалтерия экспедитора 8"", то"); 
	МассивСтрок.Добавить("Вам необходимо направить запрос на адрес: ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("sale@coralway.ru", Новый Шрифт(,,Истина)));
	МассивСтрок.Добавить(" на смену электронного адреса владельца программы.");
	МассивСтрок.Добавить("В запросе Вам необходимо указать: название компании,");
	МассивСтрок.Добавить("регистрационный номер программы, ФИО и должность сотрудника");
	МассивСтрок.Добавить(" компании для обратной связи");
	
	ТекстПредупреждения = Новый ФорматированнаяСтрока(МассивСтрок);
	
	ПоказатьПредупреждение(,ТекстПредупреждения,,"Я не получил пин-код");

КонецПроцедуры

