
Процедура СоздатьОбсуждение(ДанныеОбсуждения) Экспорт
	
	ОтборОбсуждений = Новый ОтборОбсужденийСистемыВзаимодействия;
	ОтборОбсуждений.Ключ = ДанныеОбсуждения.ОбъектОбсуждения.УникальныйИдентификатор();
	
	Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(ДанныеОбсуждения.ОбъектОбсуждения.УникальныйИдентификатор());
	
	Если Обсуждение = Неопределено Тогда
		Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
		Обсуждение.Заголовок = ДанныеОбсуждения.ЗаголовокОбсуждения;
		Обсуждение.Ключ      = ДанныеОбсуждения.ОбъектОбсуждения.УникальныйИдентификатор();
	КонецЕсли;
	
	//Дополним обсуждение, на случае если изменился состав уастников
	Для Каждого Пользователь из ДанныеОбсуждения.Участники Цикл
		Участник =  СистемаВзаимодействия.ПолучитьИдентификаторПользователя(Пользователь.ИдентификаторПользователяИБ);
		Если НЕ Обсуждение.Участники.Содержит(Участник) Тогда
			Обсуждение.Участники.Добавить(Участник);
		КонецЕсли;
	КонецЦикла;     
	
	Обсуждение.Записать();
	
	мСообщения = ДанныеОбсуждения.Сообщения;
	Для Каждого НовоеСообщение из мСообщения Цикл
		Сообщение = СистемаВзаимодействия.СоздатьСообщение(Обсуждение.Идентификатор);
		Сообщение.Автор = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(НовоеСообщение.Автор.ИдентификаторПользователяИБ);
		
		Для Каждого Получатель из НовоеСообщение.Получатели Цикл
			Сообщение.Получатели.Добавить(СистемаВзаимодействия.ПолучитьИдентификаторПользователя(Получатель.ИдентификаторПользователяИБ));
		КонецЦикла;
		
		Сообщение.Текст =  НовоеСообщение.Текст;
		
		Сообщение.Действия.Добавить(ПолучитьНавигационнуюСсылку(ДанныеОбсуждения.ОбъектОбсуждения), "Открыть документ");
		Сообщение.Данные = НовоеСообщение.ДанныеДействие;
		
		Сообщение.Записать();

	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьОбсуждение(ОбъектОбсуждения) Экспорт
	
	Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(ОбъектОбсуждения.УникальныйИдентификатор());
	Если Обсуждение <> Неопределено Тогда
		
		ОтборСообщений = Новый ОтборСообщенийСистемыВзаимодействия;
		ОтборСообщений.Обсуждение = Обсуждение.Идентификатор;
		
		мСообщения = СистемаВзаимодействия.ПолучитьСообщения(ОтборСообщений);
		Для Каждого СообщениеОбсуждения из мСообщения Цикл
			СистемаВзаимодействия.УдалитьСообщение(СообщениеОбсуждения.Идентификатор);
		КонецЦикла;
		
		Обсуждение.Участники.Очистить();
	КонецЕсли;
	
КонецПроцедуры