
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Режим",Режим);
	Если (НЕ ЗначениеЗаполнено(Режим)) Тогда
		Режим="Номенклатура";		
	КонецЕсли; 
	Шаблон = Параметры.Шаблон;
	// --- 
	Если (Режим="Номенклатура") Тогда
		Макросы = CW_Шаблоны.СписокМакросовШаблоновНоменклатуры(Параметры.РасходнаяСтатья,Параметры.ДоходнаяСтатья);	
		Макросы = ПолучитьВнешниеМакросы(Макросы);
	ИначеЕсли (Режим="СтатусыОборудования") Тогда 
		Макросы = CW_Шаблоны.СписокМакросовШаблоновСтатусовОборудования();	
	КонецЕсли; 
	
	Для каждого Элемент Из Макросы Цикл
		
		Нстр = ТаблицаМакросов.Добавить();
		Нстр.Макрос = Элемент.Значение;
		Нстр.Описание = Элемент.Представление;
		
	КонецЦикла; 
	
	Попытка
		ДобавитьКомандыПеревода();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст  = "Не удалось создать кнопку ""Переводы"". Провертье корректность кодов справочника ""Языки""";
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьКомандыПеревода()
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Языки.Код КАК Код,
	               |	CW_Языки.Ссылка КАК Ссылка,
	               |	CW_Языки.Представление КАК Представление
	               |ИЗ
	               |	Справочник.CW_Языки КАК CW_Языки
	               |ГДЕ
	               |	НЕ CW_Языки.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("ИмяКоманды"	, "УстановитьПризнакПеревода_БезПеревода");
	ПараметрыКоманды.Вставить("Действие"	, "УстановитьПризнакПеревода");
	ПараметрыКоманды.Вставить("Заголовок"	, "<Без перевода>");
	//ПараметрыКоманды.Вставить("Картинка"	, Новый Картинка);
	
	ПараметрыКнопки = новый Структура;
	ПараметрыКнопки.Вставить("Имя"			, "Кнопка_БезПеревода");
	ПараметрыКнопки.Вставить("ИмяКоманды"	, "УстановитьПризнакПеревода_БезПеревода");
	ПараметрыКнопки.Вставить("Заголовок"	, "<Без перевода>");
	
	ДобавитьКнопкуПеревода(ПараметрыКоманды, ПараметрыКнопки);

	Пока Выборка.Следующий() Цикл
		
		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("ИмяКоманды"	, "УстановитьПризнакПеревода_"+Выборка.Код);
		ПараметрыКоманды.Вставить("Действие"	, "УстановитьПризнакПеревода");
		ПараметрыКоманды.Вставить("Заголовок"	, Выборка.Представление + " (" + СокрЛП(Выборка.Ссылка.Наименование) + ")");
		//ПараметрыКоманды.Вставить("Картинка"	, БиблиотекаКартинок.CW_Страны);
		//ПараметрыКоманды.Вставить("Картинка"	, Новый Картинка);
		
		ПараметрыКнопки = новый Структура;
		ПараметрыКнопки.Вставить("Имя"			, "Кнопка_" + Выборка.Код);
		ПараметрыКнопки.Вставить("ИмяКоманды"	, "УстановитьПризнакПеревода_"+Выборка.Код);
		ПараметрыКнопки.Вставить("Заголовок"	, );
		
		ДобавитьКнопкуПеревода(ПараметрыКоманды, ПараметрыКнопки);
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ДобавитьКнопкуПеревода(ПараметрыКоманды, ПараметрыКнопки)
	//Добавить кнопку "<Без переовда>"
	
	НоваяКомандаФормы = ЭтаФорма.Команды.Добавить(ПараметрыКоманды.ИмяКоманды);
	НоваяКомандаФормы.Действие 	= ПараметрыКоманды.Действие;
	НоваяКомандаФормы.Заголовок = ПараметрыКоманды.Заголовок;    
	//НоваяКомандаФормы.Картинка  = ПараметрыКоманды.Картинка;
	
	// создадим кнопку
	НовыйЭлемент        = Элементы.Добавить(ПараметрыКнопки.Имя 					,  	// Первый параметр - имя кнопки
	Тип("КнопкаФормы")																,  	// Второй параметр - тип элемента управления
	Элементы.ТаблицаМакросов.КоманднаяПанель.ПодчиненныеЭлементы.ГруппаПереводы	)	;	// Третий параметр - место расположения на форме
	
	НовыйЭлемент.Вид    		= ВидКнопкиФормы.ОбычнаяКнопка; // вид кнопки
	НовыйЭлемент.Заголовок  	= ПараметрыКнопки.Заголовок;
	НовыйЭлемент.ИмяКоманды 	= ПараметрыКнопки.ИмяКоманды;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнакПеревода(Команда)
	
	ТекущаяСтрока = Элементы.ТаблицаМакросов.ТекущаяСтрока; 
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КодЯзыка = СтрЗаменить(Команда.Имя,"УстановитьПризнакПеревода_",""); 
	Если не ЕстьСсылкаНаСправочник(КодЯзыка) Тогда
		КодЯзыка = "";	
	КонецЕсли;

	ПередНачаломВыбораМакроса(ТекущаяСтрока, КодЯзыка);
	
КонецПроцедуры

&НаСервере
Функция ЕстьСсылкаНаСправочник(КодЯзыка)
	
	СсылкаНаЭлемент = Справочники.CW_Языки.НайтиПоКоду(КодЯзыка);
	
	Возврат НЕ СсылкаНаЭлемент.Пустая();
	
КонецФункции

&НаКлиенте
Процедура ТаблицаМакросовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	ПередНачаломВыбораМакроса(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломВыбораМакроса(Знач ВыбраннаяСтрока, Знач КодЯзыка="")
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
	ДополнительныеПараметры.Вставить("КодЯзыка", КодЯзыка);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборЗначенияПараметра", ЭтотОбъект, ДополнительныеПараметры);
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Значение", 	"Значение");
	СписокВыбора.Добавить("План", 		"План");
	СписокВыбора.Добавить("Факт", 		"Факт");  
	
	Если ЭтоМакросКонтрольнойДаты(ВыбраннаяСтрока) Тогда
		СписокВыбора.ПоказатьВыборЭлемента(Оповещение, "Выберите значение контрольной даты");  
	Иначе
		ЭлементСписка = СписокВыбора.Получить(0);	
		ВыполнитьОбработкуОповещения(Оповещение, ЭлементСписка);
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьВыборЗначенияПараметра(ЭлементСписка, ДополнительныеПараметры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонеЦЕсли;
	
	Постфикс 	= ?(ЭлементСписка.Значение = "Значение", "", "."+ЭлементСписка.Значение);
	Макрос 		= ИмяМакроса(ДополнительныеПараметры.ВыбраннаяСтрока);
	
	ДобавитьМакрос(Макрос, ДополнительныеПараметры.КодЯзыка, Постфикс);

	
КонецПроцедуры
&НаСервере
Функция ИмяМакроса(ВыбраннаяСтрока)
	
	СтрокаТекущая = ТаблицаМакросов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Возврат СтрокаТекущая.Макрос;
	
КонецФункции

&НаСервере
Функция ЭтоМакросКонтрольнойДаты(ВыбраннаяСтрока)
	
	СтрокаТекущая = ТаблицаМакросов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Возврат СтрНачинаетсяС(НРег(СтрокаТекущая.Макрос), "(кд)");
	
КонецФункции

&НаКлиенте
Процедура ДобавитьМакрос(Макрос, КодЯзыка="", Постфикс="")
	
	Элементы.Шаблон.ВыделенныйТекст = "%"+Макрос+Постфикс+?(ЗначениеЗаполнено(КодЯзыка),"<"+КодЯзыка+">","")+"%";

	ЭтаФорма.ТекущийЭлемент = Элементы.ТаблицаМакросов;
	ЭтаФорма.ТекущийЭлемент = Элементы.Шаблон;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ТекстОшибки = "";
	Если Не ПроверитьСимволыНачалаИОкончанияПовтора(ТекстОшибки) Тогда
		ПоказатьПредупреждение(,ТекстОшибки,,"Ошибка формирования шаблона!");
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Шаблон);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВнешниеМакросы(Макросы)
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	CW_ПодключаемыеОбъекты.Ссылка КАК Обработка
		|ИЗ
		|	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
		|ГДЕ
		|	CW_ПодключаемыеОбъекты.Вид = &Вид
		|	И НЕ CW_ПодключаемыеОбъекты.ПометкаУдаления
		|	И CW_ПодключаемыеОбъекты.НеИспользуется = ЛОЖЬ";
	Запрос.УстановитьПараметр("Вид", "ВнешнийМакрос");
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 1 Тогда
		Обработка = ТЗ[0].Обработка;
	Иначе
		Возврат Макросы;
	КонецЕсли;	
	
	Структ = Новый Структура("Действие", "СписокМакросов");
	ПараметрыОбработки = Новый Структура("Объект,УИД", ПоместитьВоВременноеХранилище(Структ, ЭтаФорма.УникальныйИдентификатор), ЭтаФорма.УникальныйИдентификатор);
	
	ОбработкаОбъект = _ПО.ПолучитьОбработку(Обработка);
	Если (ОбработкаОбъект = Неопределено) Тогда
		Сообщить("Ошибка подключения внешней команды");
		Возврат(_УФКС.Ответ(1));
	КонецЕсли; 
	
	Попытка
		Ответ = ОбработкаОбъект.ВыполнитьКоманду(Обработка, ПараметрыОбработки);
	Исключение
	КонецПопытки; 
	
	Если Ответ <> Неопределено Тогда
		спДопМакросов = ПолучитьИзВременногоХранилища(Ответ.Адрес);
		
		Для Каждого СтрМакросов из спДопМакросов Цикл
			Макросы.Добавить(СтрМакросов.Значение, СтрМакросов.Представление);
		КонецЦикла;	
	КонецЕсли;	
	
	ОбработкаОбъект = Неопределено;
	
	Возврат Макросы;
	
КонецФункции	

&НаКлиенте
Процедура КомандаДобавитьПереводСтроки(Команда)
	
	Элементы.Шаблон.ВыделенныйТекст = "%НоваяСтрока%";

КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьНачалоПовторенияМакросов(Команда)
	
	Элементы.Шаблон.ВыделенныйТекст = "{";
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьОкончаниеПовторенияМакросов(Команда)
	
	Элементы.Шаблон.ВыделенныйТекст = "}";
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьСимволыНачалаИОкончанияПовтора(ТекстОшибки)
	
	ЕстьНачало 		= СтрНайти(Шаблон,"{") <> 0;
	ЕстьОкончание 	= СтрНайти(Шаблон,"}") <> 0;
	
	Если ЕстьНачало и Не ЕстьОкончание Тогда
		ТекстОшибки = "В тексте шаблона есть символ начала повтора ""{"" и нет символа окончания повтора ""}""";
	Иначеесли Не ЕстьНачало и ЕстьОкончание Тогда
		ТекстОшибки = "В тексте шаблона есть символ окончания повтора ""}"" и символа начала повтора ""{""";
	Иначе
		ТекстОшибки = "";
	КонецЕсли;
	
	Возврат ЕстьНачало = ЕстьОкончание;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьВариантГруппировкиПоГрузопереозвкам(Команда)
	
	Элементы.Шаблон.ВыделенныйТекст = "%ГрГП%}";
	
КонецПроцедуры