
//Служебные процедуры
Процедура ОбновитьСписокПодключаемыхОтчетовОбработок(ПараметрыПроцедуры=Неопределено, АдерсРезультата=Неопределено) Экспорт
	
	МассивВсехОбработок  = ПолучитьМассивВсехОбработок();
	//Обработки
	Для каждого Обработка Из Метаданные.Обработки Цикл 
		
		Если СтрНачинаетсяС(Обработка.Имя,"CW_") = ЛОЖЬ Тогда
			Продолжить;
		КонецЕсли;
		
		Ответ = ПроверитьДоступуностьОбработки(Обработка.Имя, Истина);
		Если Не Ответ.ПодключениеДоступно Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексВМассиве = МассивВсехОбработок.Найти(Обработка.Имя);
		Если ИндексВМассиве <> Неопределено Тогда
			МассивВсехОбработок.Удалить(ИндексВМассиве);
		КонецЕсли;
	
		ОбновитьИдентифкаторыПодключаемыхОбъектов(Обработка.Имя, Обработка.Синоним, ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОбработки"), Ответ.Версия);
	
	КонецЦикла; 
	
	//Отчеты
	МассивВсехОтчетов  = ПолучитьМассивВсехОтчетов();
	Для каждого Отчет Из Метаданные.Отчеты Цикл
		Если СтрНачинаетсяС(Отчет.Имя,"CW_") = ЛОЖЬ Тогда
			Продолжить;
		КонецЕсли;
		
		Ответ = ПроверитьДоступуностьОбработки(Отчет.Имя, Ложь);
		Если Не Ответ.ПодключениеДоступно Тогда
			Продолжить;
		КонецЕсли;
		
		ИндексВМассиве = МассивВсехОтчетов.Найти(Отчет.Имя);
		Если ИндексВМассиве <> Неопределено Тогда
			МассивВсехОтчетов.Удалить(ИндексВМассиве);
		КонецЕсли;
		
		ОбновитьИдентифкаторыПодключаемыхОбъектов(Отчет.Имя, Отчет.Синоним, ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОтчеты"), Ответ.Версия);
		
	КонецЦикла; 
	
	УдалитьОтсутствующиеОбъекты(МассивВсехОбработок, 	ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОбработки"));
	УдалитьОтсутствующиеОбъекты(МассивВсехОтчетов, 		ПредопределенноеЗначение("Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОтчеты"));
	
КонецПроцедуры

Функция ПолучитьМассивВсехОбработок()
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ИдентификаторыПодключаемыхОбъектов.Имя КАК Имя
	               |ИЗ
	               |	Справочник.CW_ИдентификаторыПодключаемыхОбъектов КАК CW_ИдентификаторыПодключаемыхОбъектов
	               |ГДЕ
	               |	CW_ИдентификаторыПодключаемыхОбъектов.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ИдентификаторыПодключаемыхОбъектов.Родитель = Значение(Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОбработки)";
	
	РезульатЗапроса = Запрос.Выполнить();
	
	Выборка = РезульатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Имя);
	КонецЦикла;
	
	Возврат Результат;          
	
КонецФункции

Функция ПолучитьМассивВсехОтчетов()
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ИдентификаторыПодключаемыхОбъектов.Имя КАК Имя
	               |ИЗ
	               |	Справочник.CW_ИдентификаторыПодключаемыхОбъектов КАК CW_ИдентификаторыПодключаемыхОбъектов
	               |ГДЕ
	               |	CW_ИдентификаторыПодключаемыхОбъектов.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ИдентификаторыПодключаемыхОбъектов.Родитель = Значение(Справочник.CW_ИдентификаторыПодключаемыхОбъектов.мдОтчеты)";
	
	РезульатЗапроса = Запрос.Выполнить();
	
	Выборка = РезульатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Имя);
	КонецЦикла;
	
	Возврат Результат;          
	
КонецФункции

Функция ПроверитьДоступуностьОбработки(ИмяОбработки, ОбработкаОтчет)
	
	Ответ = Новый Структура("ПодключениеДоступно", Ложь);
	
	Если ОбработкаОтчет Тогда
		Менеджер = Обработки[ИмяОбработки].Создать(); 
	Иначе
		Менеджер = Отчеты[ИмяОбработки].Создать();
	КонецЕсли;
	
	Попытка
		СтруктураОписания = Менеджер.Информация();
		
		Ответ.Вставить("ПодключениеДоступно", 	Истина);
		Ответ.Вставить("Версия", 				СтруктураОписания.Версия);
		
		Менеджер = Неопределено;
	Исключение
		Возврат Ответ;
	КонецПопытки; 
	
	Возврат Ответ;
	
КонецФункции

Процедура ОбновитьИдентифкаторыПодключаемыхОбъектов(ИмяОбработки, Синоним, Родитель, Версия)  Экспорт
	
	СпрСсылка = Справочники.CW_ИдентификаторыПодключаемыхОбъектов.НайтиПоРеквизиту("Имя", ИмяОбработки, Родитель);
	Если СпрСсылка.Пустая() Тогда 
		//если не нашли, то создаем	
		СпрОбъект = Справочники.CW_ИдентификаторыПодключаемыхОбъектов.СоздатьЭлемент();
		СпрОбъект.Имя 			= ИмяОбработки;
	Иначе
		СпрОбъект = СпрСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	//Обновляем реквизиты
	СпрОбъект.Наименование 	= Синоним;
	СпрОбъект.Версия 		= Версия;
	СпрОбъект.Родитель 		= Родитель;
	СпрОбъект.Записать();
	
КонецПроцедуры

Процедура УдалитьОтсутствующиеОбъекты(МассивВсехИдентифкаторов, Родитель)
	
	Для Каждого Имя из МассивВсехИдентифкаторов Цикл
		
		СпрСсылка = Справочники.CW_ИдентификаторыПодключаемыхОбъектов.НайтиПоРеквизиту("Имя", Имя, Родитель);
		Если Не СпрСсылка.Пустая() Тогда //если  нашли, то удаляем
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
			СпрОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Служебные процедуры