
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяСхемыЖурнала = Параметры.ИмяСхемыЖурнала;
	АдресОтбора 	= Параметры.АдресОтбора;
	
	Если ПустаяСтрока(ИмяСхемыЖурнала) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	СоответствиеЗначенияотбораСхеме = ПолучитьСоответствиеЗначенияотбораСхеме();
	ЗначениеОтбораСтатусов 			= СоответствиеЗначенияотбораСхеме.Получить(ИмяСхемыЖурнала);
	
	АдресИсточникаНастроек = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет(ИмяСхемыЖурнала),ЭтаФорма.УникальныйИдентификатор);
	НастройкиОтбора = Неопределено;
	Если ЭтоАдресВременногоХранилища(АдресОтбора) Тогда
		НастройкиОтбора = ПолучитьИзВременногоХранилища(АдресОтбора);
	КонецЕсли; 
	Если НастройкиОтбора = Неопределено Тогда
		НастройкиОтбора = КомпоновщикНастроек.Настройки;
	КонецЕсли; 
	
	АдресНастроек = ПоместитьВоВременноеХранилище(НастройкиОтбора,ЭтаФорма.УникальныйИдентификатор);
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресИсточникаНастроек));
	КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(АдресНастроек));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеЗначенияотбораСхеме()
	
	ИдентификаторЗаявка 		= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_Заявки"));
	ИдентификаторЗаказ 			= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_Заказы"));
	ИдентификаторГрузоперевозка = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_Грузоперевозки"));
	
	Результат = Новый Соответствие;
	Результат.Вставить("CW_СхемаЖурналаЗаявок", 		ИдентификаторЗаявка);
	Результат.Вставить("CW_СхемаЖурналаЗаказов", 		ИдентификаторЗаказ);
	Результат.Вставить("CW_СхемаЖурналаГрузоперевозок", ИдентификаторГрузоперевозка);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	
	Если КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() > 0 Тогда
		АдресВХранилище = ПоместитьВоВременноеХранилище(КомпоновщикНастроек.Настройки,АдресОтбора);
	КонецЕсли;
	
	ЭтаФорма.Закрыть(АдресВХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПравоеЗначение = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные.ПравоеЗначение;
	ИмяСправочника = ПолучитьИмяСправочникаДляОтбора(ПравоеЗначение);
	
	Если ИмяСправочника = "CW_ЛогистическиеСтатусы" или ИмяСправочника = "CW_ФинансовыеСтатусы" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
		ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
		ПараметрыФормы.Вставить("ЗначениеОтбора", 	  ЗначениеОтбораСтатусов);
		
		ОткрытьФорму("Справочник."+ИмяСправочника+".ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяСправочникаДляОтбора(ПравоеЗначение)
	
	Если ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений") Тогда
		мТипы =	ПравоеЗначение.ТипЗначения.Типы();
		Если мТипы.Количество() > 0 Тогда
			ТипПравоеЗначение =  мТипы[0]; 
		КонецЕсли;
	Иначе
		ТипПравоеЗначение = ТипЗнч(ПравоеЗначение);
	КонецЕсли;
	
	Если ТипПравоеЗначение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;  
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипПравоеЗначение);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;  
	
	Возврат ОбъектМетаданных.Имя
	
КонецФункции
