
#Область ПрограммныйИнтерфейс

// Возвращает массив приложений текущего пользователя с URL-адресами.
// Результат кэшируется на время сеанса.
//
// Возвращаемое значение:
//  ФиксированныйМассив из ФиксированнаяСтруктура, Неопределено - массив описаний приложений со свойствами:
//   * Код - Число - код приложения (область данных)
//   * Наименование - Строка
//   * АдресПриложения - Строка - URL приложения
//   * ИмяВидаПриложения - Строка - имя конфигурации (Метаданные.Имя)
//   * СостояниеПриложения - ПеречислениеСсылка.СостоянияПриложений
//
Функция ПриложенияПользователя() Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ВнешнийПрограммныйИнтерфейс") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МодульПрограммныйИнтерфейсСервиса = ОбщегоНазначения.ОбщийМодуль("ПрограммныйИнтерфейсСервиса");
	Абоненты = МодульПрограммныйИнтерфейсСервиса.Абоненты();
	
	Если Абоненты = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив;
		
	Для Каждого Абонент Из Абоненты Цикл
		
		СвойстваОтвета = Неопределено;
		Приложения = МодульПрограммныйИнтерфейсСервиса.ПриложенияАбонента(Абонент.Код, Ложь, СвойстваОтвета);
		Если ЗначениеЗаполнено(СвойстваОтвета.Сообщение) Тогда
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Синхронизация прочтения новостей'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,
				СвойстваОтвета.Сообщение);
		КонецЕсли;
		Если Приложения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Приложение Из Приложения Цикл
			Результат.Добавить(Новый ФиксированнаяСтруктура(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Приложение)));
		КонецЦикла;
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

#КонецОбласти
