
&НаКлиенте
Процедура ОК(Команда)
	
	ЭтаФорма.Закрыть(ПоместитьВоВременноеХранилище(Грузоперевозки,Адрес));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.Адрес;
	Грузоперевозки = ПолучитьИзВременногоХранилища(Адрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора",Новый Структура("РежимВыбора",Истина),Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
КонецПроцедуры
