
#Область ОбщегоНазначения

// установка значения с проверкой
Процедура УстановитьЗначение(Переменная,Значение) Экспорт 
	
	Если Переменная <> Значение Тогда
		
		Переменная = Значение;
		
	КонецЕсли; 
	
КонецПроцедуры

// проверяет на пустое значение
Функция ПустоеЗначение(Значение) Экспорт
	//Назначение: Проверяет, является ли значение пустым
	//ДатаСоздания: 20080101
	//Автор: 1С
	//Тестирована: Да
	//$Значение: Значение, заполенение которого надо проверить
	//$Результат: Истина - значение не заполнено, ложь - иначе.
	//Описание:
	//	Взято из типовых конфигураций
	Перем Результат, ТипЗначения;
	Результат = Ложь;
	ТипЗначения = ТипЗнч(Значение);

	// Сначала примитивные типы
	Если Значение = Неопределено Тогда
		Результат = Истина;
	ИначеЕсли Значение = NULL Тогда
		Результат = Истина;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Если стр_Сократить(Значение) = "" Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Если Значение = 0 Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Если Значение = Дата('00010101') Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Результат = Ложь; // Булево будем считать не пустым
		
	// Для остальных будем считать значение пустым, если оно равно
	// дефолтному значению своего типа
	Иначе
		Если Значение = Новый(ТипЗначения) Тогда
			Результат = Истина;
		КонецЕсли; 
	КонецЕсли; 

	Возврат Результат;
КонецФункции // обПусто

// проверяет на непустое значение
Функция НеПустоеЗначение(Объект) Экспорт
	//Назначение: Проверяет, является ли значение непустым
	//ДатаСоздания: 20080101
	//Автор: 1С
	//Тестирована: Да
	//$Значение: Значение, заполенение которого надо проверить
	//$Результат: Ложь - значение не заполнено, истина - иначе.

	Возврат НЕ ПустоеЗначение(Объект);
	
КонецФункции

// сравнивает значение со значение по ссылке
Функция РеквизитИзменен(Объект,Реквизит) Экспорт 
	
	Возврат(Объект[Реквизит]<>Объект.Ссылка[Реквизит]);
	
КонецФункции

// Обёртка над "ЗаполнитьЗначенияСвойств" 
Процедура Заполнить(Приемник,Источник,СписокСвойств=Неопределено,ИсключаяСвойства=Неопределено) Экспорт 
	
	ЗаполнитьЗначенияСвойств(Приемник,Источник,СписокСвойств,ИсключаяСвойства);
	
КонецПроцедуры

// установить значение переменной при выполнении условия
Процедура УстановитьПоУсловию(Переменная,Значение,Условие=Неопределено) Экспорт 
	// --- 
	
	Если Условие=Неопределено Тогда
		
		Если ЗначениеЗаполнено(Значение) Тогда
			
			Переменная = Значение;
			
		КонецЕсли;
		
	ИначеЕсли Условие=Истина Тогда 
		
		 Переменная = Значение;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// обёртка для сравнения с неопределено
Функция Определено(Значение) Экспорт 
	// --- 
	
	Возврат(Значение <> Неопределено);
	
	// --- 
КонецФункции

// установить, если пустое
Процедура УстановитьЕслиНезаполнено(Реквизит,Значение) Экспорт 
	// --- 
	
	Если (НЕ ЗначениеЗаполнено(Реквизит)) Тогда
		
		Реквизит = Значение;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// --- 

// получает значение через точку 
// пример ф(Объект,"Реквизит1.Подреквизит1")
Функция ЗначениеПоПутиДанных(Объект,Адрес) Экспорт 
	// --- 
	
	// определяем, является ли адрес составным
	Если Найти(Адрес,".") <> 0 Тогда
		
		// это составной
		
		СтекРеквизитов = м_СоздатьИзСтроки(Адрес,".");
		ТекущийОбъект = Объект;
		Значение = Неопределено;
		Для каждого Реквизит Из СтекРеквизитов Цикл
			
			Попытка
				
				ТекущийОбъект = ТекущийОбъект[Реквизит];
				
			Исключение
				
				ТекущийОбъект = Неопределено;
				Прервать;
				
			КонецПопытки; 
			
		КонецЦикла; 
		
		Значение = ТекущийОбъект;
		
	Иначе
		
		Попытка
			Значение = Объект[Адрес];
		Исключение
		    Значение = Неопределено;
		КонецПопытки;		
		
	КонецЕсли; 
	
	Возврат(Значение);
	
	// --- 
КонецФункции

// проверяет условие
Функция Условие(ЛевоеЗначение,ВидСравненияКД,ПравоеЗначение=Неопределено) Экспорт 
	// --- 
	
	Если ВидСравненияКД=ВидСравненияКомпоновкиДанных.Равно Тогда 
		
		Возврат( (ЛевоеЗначение = ПравоеЗначение) );
		
	ИначеЕсли  ВидСравненияКД=ВидСравненияКомпоновкиДанных.НеРавно Тогда
		
		Возврат( НЕ (ЛевоеЗначение = ПравоеЗначение) );
		
	ИначеЕсли ВидСравненияКД=ВидСравненияКомпоновкиДанных.Заполнено Тогда 
		
		Возврат(ЗначениеЗаполнено(ЛевоеЗначение));
		
	ИначеЕсли ВидСравненияКД=ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда 
		
		Возврат(НЕ ЗначениеЗаполнено(ЛевоеЗначение)); 
		
	ИначеЕсли ВидСравненияКД=ВидСравненияКомпоновкиДанных.Больше Тогда
		
		Возврат(ЛевоеЗначение > ПравоеЗначение);
		
	ИначеЕсли ВидСравненияКД=ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда 
		
		Возврат(ЛевоеЗначение >= ПравоеЗначение);
		
	ИначеЕсли ВидСравненияКД=ВидСравненияКомпоновкиДанных.Меньше Тогда 
		
		Возврат(ЛевоеЗначение < ПравоеЗначение);
		
	ИначеЕсли ВидСравненияКД=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда 
		
		Возврат(ЛевоеЗначение <= ПравоеЗначение);
		
	ИначеЕсли ВидСравненияКД=ВидСравненияКомпоновкиДанных.ВСписке Тогда 
		
		Возврат( (ПравоеЗначение.Найти(ЛевоеЗначение) <> Неопределено) );
		
	ИначеЕсли ВидСравненияКД=ВидСравненияКомпоновкиДанных.НеВСписке Тогда 
		
		Возврат( (ПравоеЗначение.Найти(ЛевоеЗначение) = Неопределено) );
		
	ИначеЕсли ВидСравненияКД=ВидСравненияКомпоновкиДанных.Содержит Тогда 
		
		Возврат(Найти(Строка(ЛевоеЗначение),ПравоеЗначение) <> 0 );
		
	ИначеЕсли ВидСравненияКД=ВидСравненияКомпоновкиДанных.НеСодержит Тогда 
		
		Возврат(Найти(Строка(ЛевоеЗначение),ПравоеЗначение) = 0 );
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// есть сервер или нет
Функция СервернаяБаза() Экспорт 
	// --- 
	
	ЕстьСервер = (Найти(СтрокаСоединенияИнформационнойБазы(),"Srvr") <> 0);
	Возврат(ЕстьСервер);
	
	// --- 
КонецФункции

// дополнительные свойства объекта
Функция ДС(Объект) Экспорт
	// --- 
	
	Возврат(Объект.ДополнительныеСвойства);
	
	// --- 
КонецФункции

// УИД ссылки
Функция УИД(Ссылка) Экспорт 
	// --- 
	
	Возврат(Ссылка.УникальныйИдентификатор());
	
	// --- 
КонецФункции
  
// УИД ссылки строкой
Функция УИДСтрокой(Ссылка) Экспорт 
	// --- 
	
	Возврат(Строка(Ссылка.УникальныйИдентификатор()));
	
	// --- 
КонецФункции

// возвращает уид строкой без дефисов
Функция КлючПоСсылке(Ссылка) Экспорт 
	// --- 
	
	Возврат(СтрЗаменить(УИДСтрокой(Ссылка),"-",""));
	
	// --- 
КонецФункции



Процедура УстановитьОтбор(Отбор,Поле,Значение) Экспорт 
	// --- 
	
	Отбор[Поле].Значение = Значение;
	Отбор[Поле].Использование = Истина;
	
	// --- 
КонецПроцедуры

// --- 

Функция Таймер_Старт() Экспорт 
	// --- 
	
	Таймер = ст_Создать("Запуск,Остановка");
	Таймер.Запуск = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Возврат(Таймер);
	
	// --- 
КонецФункции

Процедура Таймер_Стоп(Таймер) Экспорт 
	// --- 
	
	Таймер.Остановка = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
	// --- 
КонецПроцедуры

Функция Таймер_Интервал(Таймер) Экспорт 
	// --- 
	
	Возврат(Таймер.Остановка-Таймер.Запуск);
	
	// --- 
КонецФункции

Функция Таймер_Представление(Таймер,ВыводитьВСекундах=Истина) Экспорт 
	// --- 
	
	ДлительностьВМиллисекундах= Таймер_Интервал(Таймер);
	Если ВыводитьВСекундах Тогда
		
		Возврат(Формат(ДлительностьВМиллисекундах/1000,"ЧДЦ=3; ЧН=; ЧГ=")+" с");
		
	Иначе
		
		Возврат(Формат(ДлительностьВМиллисекундах,"ЧДЦ=0; ЧН=; ЧГ=")+" мс");
		
	КонецЕсли; 
	
	// --- 
КонецФункции


#КонецОбласти

#Область МатематическиеФункции

// модуль числа
Функция Модуль(А) Экспорт 
	
	Возврат(Макс(А,-А));
	
КонецФункции

// делит А на Б и возвращает 0, если Б = 0
Функция БезопасноРазделить(А,Б) Экспорт 
	
	Если Б=0 Тогда
		
		Возврат(0);
		
	Иначе
		
		Возврат(А/Б);
		
	КонецЕсли; 
	
КонецФункции

// процедура инкремента
Процедура Инкремент(Значение,ПрибавляемоеЗначение=1) Экспорт 
	
	Значение = Значение + ПрибавляемоеЗначение;
	
КонецПроцедуры

// процедура декремента
Процедура Декремент(Значение,ВычитаемоеЗначение=1) Экспорт 
	
	Значение = Значение - ВычитаемоеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область Строки

// аналог СтрЗаменить(Строка,Разделитель,Символы.ПС)
Функция стр_РазбитьНаСтроки(Строка,Разделитель=",") Экспорт 
	
	Возврат(СтрЗаменить(Строка,Разделитель,Символы.ПС));
	
КонецФункции

// получает строку, если задан разделитель - разбивает по нему и возвращает строку
Функция стр_ПолучитьСтроку(Строка,Разделитель=Неопределено,НомерСтроки) Экспорт 
	
	Если Разделитель=Неопределено Тогда
		
		Возврат(СтрПолучитьСтроку(Строка,НомерСтроки));
		
	Иначе
		
		Строки = стр_РазбитьНаСтроки(Строка,Разделитель);
		Возврат(СтрПолучитьСтроку(Строки,НомерСтроки));
		
	КонецЕсли; 
	
КонецФункции

// обёртка на СтрЧислоСтрок
Функция стр_ЧислоСтрок(МногострочнаяСтрока) Экспорт
	
	Возврат(СтрЧислоСтрок(МногострочнаяСтрока));
	
КонецФункции

// первая строка многострочной строки
Функция стр_ПерваяСтрока(МногострочнаяСтрока,Разделитель=Неопределено)
	// --- 
	
	Если Разделитель = Неопределено Тогда
		
		Возврат(СтрПолучитьСтроку(МногострочнаяСтрока,1));
		
	Иначе
		
		Возврат(СтрПолучитьСтроку(стр_РазбитьНаСтроки(МногострочнаяСтрока,Разделитель),1));
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// последняя строка многострочной строки
Функция стр_ПоследняяСтрока(МногострочнаяСтрока,Разделитель=Неопределено)
	// --- 
	
	Если Разделитель = Неопределено Тогда
		
		Возврат(СтрПолучитьСтроку(МногострочнаяСтрока,стр_ЧислоСтрок(МногострочнаяСтрока)));
		
	Иначе
		
		Строки = стр_РазбитьНаСтроки(МногострочнаяСтрока,Разделитель);
		Возврат(СтрПолучитьСтроку(Строки,стр_ЧислоСтрок(Строки)));		
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// обёртка над Сокр()
Функция стр_Сократить(Строка,Режим="ЛП") Экспорт 
	// --- 
	
	Если Режим="ЛП" Тогда
		
		Возврат(СокрЛП(Строка));
		
	ИначеЕсли Режим="Л" Тогда 
		
		 Возврат(СокрЛ(Строка));
		
	ИначеЕсли Режим="П" Тогда 
		
		 Возврат(СокрП(Строка));
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// обёртка над СтрЗаменить
Функция стр_Заменить(Строка,ПодстрокаПоиска,ПодстрокаЗамены="") Экспорт 
	// --- 
	
	Возврат(СтрЗаменить(Строка,ПодстрокаПоиска,ПодстрокаЗамены));
	
	// --- 
КонецФункции

// обёртка над СтрДлина
Функция стр_Длина(Строка) Экспорт 
	// --- 
	
	Возврат(СтрДлина(Строка));
	
	// --- 
КонецФункции

// обёртка над Лев,Прав
Функция стр_Подстрока(Строка,Режим,Аргумент1,Аргумент2=Неопределено) Экспорт 
	// --- 
	
	Если Режим = "Л" Тогда
		
		Возврат(Лев(Строка,Аргумент1));
		
	ИначеЕсли Режим = "П" Тогда 
		
		 Возврат(Прав(Строка,Аргумент1));
		 
	ИначеЕсли Режим = "С" Тогда 
		
		Если Аргумент2 = Неопределено Тогда
			
			Возврат(Сред(Строка,Аргумент1));
			
		Иначе
			
			Возврат(Сред(Строка,Аргумент1,Аргумент2));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// обёртка над Нрег,Врег и Трег
 Функция стр_Регистр(Строка,Режим) Экспорт 
 	// --- 
 	
 	Если Режим="В" Тогда
		
		Возврат(Врег(Строка));
		
	ИначеЕсли Режим="Н" Тогда 
		
		 Возврат(НРег(Строка));
		 
	ИначеЕсли Режим="Т"  Тогда 
		
		 Возврат(ТРег(Строка));
		
	КонецЕсли; 
 	
 	// --- 
 КонецФункции
 
// проверяет на только цифры (выдрано из БСП)
Функция стр_ТолькоЦифры(Знач СтрокаПроверки, Знач УчитыватьЛидирующиеНули = Истина, Знач УчитыватьПробелы = Истина) Экспорт
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаПроверки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ УчитыватьПробелы Тогда
		СтрокаПроверки = СтрЗаменить(СтрокаПроверки, " ", "");
	КонецЕсли;
	
	Если НЕ УчитыватьЛидирующиеНули Тогда
		НомерПервойЦифры = 0;
		Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
			НомерПервойЦифры = НомерПервойЦифры + 1;
			КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
			Если КодСимвола <> 48 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтрокаПроверки = Сред(СтрокаПроверки, НомерПервойЦифры);
	КонецЕсли;
	
	Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
		КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
		Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ТолькоЦифрыВСтроке()

// возвращает строку многострочной строки, удовлетворяющую подстроке поиска
Функция стр_НайтиСтроки(МногострочнаяСтрока,Подстрока) Экспорт 
	// --- 
	
	МассивПодстрок = Новый Массив;
	
	Для Счетчик=1 По стр_ЧислоСтрок(МногострочнаяСтрока) Цикл
		
		ТекущаяСтрока = стр_ПолучитьСтроку(МногострочнаяСтрока,,Счетчик);
		
		Если Найти(ТекущаяСтрока,Подстрока) <> 0 Тогда
			
			МассивПодстрок.Добавить(ТекущаяСтрока);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(МассивПодстрок);
	
	// --- 
КонецФункции

// конкатенация строк
Функция стр_Склеить(Строка1,Строка2) Экспорт 
	// --- 
	
	Возврат(Строка1 + Строка2);
	
	// --- 
КонецФункции

// добавление строки к строке
Процедура стр_Добавить(Строка1,Строка2) Экспорт 
	// --- 
	
	Строка1 = Строка1 + Строка2;
	
	// --- 
КонецПроцедуры

// функция возвращает массив макросов по заданному критерию
Функция стр_СписокМакросов(Шаблон,Критерий="[]") Экспорт 
	// --- 
	
	МассивМакросов = Новый Массив;
	
	// --- 
	СтрокаШаблона = "";
	// формируем однострочную строку
	Если стр_ЧислоСтрок(Шаблон) > 1 Тогда
		
		Для Счетчик=1 По стр_ЧислоСтрок(Шаблон) Цикл
			
			стр_Добавить(СтрокаШаблона,стр_ПолучитьСтроку(Шаблон,,Счетчик));
			
		КонецЦикла; 
		
	Иначе
		
		стр_Добавить(СтрокаШаблона,Шаблон);
		
	КонецЕсли;
	// --- 
	ОткрывающийСимволМакроса = стр_Подстрока(Критерий,"Л",1);
	ЗакрывающийСимволМакроса = стр_Подстрока(Критерий,"П",1);
	// ---
	флПродолжения=Истина;
	Пока флПродолжения Цикл
		
		// нашли открывающий
		ПозицияОткрывающегоСимвола = Найти(СтрокаШаблона,ОткрывающийСимволМакроса);
		Если ПозицияОткрывающегоСимвола <> 0 Тогда
			
			// обрезаем начало
			СтрокаШаблона = стр_Подстрока(СтрокаШаблона,"С",ПозицияОткрывающегоСимвола+1);
			//ищем закрывающий
			ПозицияЗакрывающегоСимвола = Найти(СтрокаШаблона,ЗакрывающийСимволМакроса);
			Если ПозицияЗакрывающегоСимвола <> 0 Тогда
				
				// выделяем макрос
				Макрос = стр_Подстрока(СтрокаШаблона,"Л",ПозицияЗакрывающегоСимвола-1);
				Макрос = стр_Заменить(Макрос,ОткрывающийСимволМакроса,"");
				Макрос = стр_Заменить(Макрос,ЗакрывающийСимволМакроса,"");
				МассивМакросов.Добавить(Макрос);
				// обрезаем строку
				СтрокаШаблона = стр_Подстрока(СтрокаШаблона,"С",ПозицияЗакрывающегоСимвола+1);
				
			Иначе
				
				флПродолжения=Ложь;
				
			КонецЕсли; 
			
		Иначе
			
			флПродолжения=Ложь;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
	Возврат(МассивМакросов);
	
	// --- 
КонецФункции

// оборачивает строку переданными символами
Функция стр_Обернуть(Строка,СимволыОбертки="") Экспорт 
	// --- 
	
	ОткрывающийСимвол = стр_Подстрока(СимволыОбертки,"Л",1);
	ЗакрывающийСимвол = стр_Подстрока(СимволыОбертки,"П",1);
	
	Возврат(ОткрывающийСимвол+Строка+ЗакрывающийСимвол);
	
	// --- 
КонецФункции

//Перевод из кирилицы в латиницу
Функция стр_Транслит(Стр) Экспорт
	
	Рез=СокрЛП(Стр); 
	СтрРус="АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ"; 
	СтрАнг="ABVGDEEZHZIYKLMNOPRSTUFHTSCHSHSCH Y EYUYA"; 
	КолСим="111111121111111111111112223111122"; 
	СтрРус=СтрРус+Нрег(СтрРус); 
	СтрАнг=СтрАнг+Нрег(СтрАнг); 
	КолСим=КолСим+КолСим; 
	Для сч = 1 по СтрДлина(СтрРус) Цикл 
		Место=1; 
		Для сч1=1 по сч-1 Цикл 
			Место=Место+Число(Сред(КолСим,сч1,1)); 
		КонецЦикла; 
		Рез = СтрЗаменить(Рез, Сред(СтрРус,сч,1), СокрЛП(Сред(СтрАнг,Место, 
		Число(Сред(КолСим,сч,1))))); 
	КонецЦикла; 
	Возврат Рез; 
	
КонецФункции

// Производит замену русских символов (схожих по написанию с латинскими) на латинские символов  
//
// Параметры
// ---------
//  <Стр>  - исходная строка, подлежащая замене
//
// Возвращаемое значение
// ---------------------
//  Строка с произведенными заменами
//
Функция стр_ЗаменитьСхожиеСимволыРусНаЛат(Стр) Экспорт

	СтрРус = "авекмнорстх";
	СтрЛат = "abekmhopctx";
	СтрРус = СтрРус + ВРег(СтрРус);
	СтрЛат = СтрЛат + ВРег(СтрЛат);
	
	Рез = Стр;
	ДлСтр = СтрДлина(СтрРус);
	Для сч = 1 по ДлСтр Цикл
		Рез = СтрЗаменить(Рез,Сред(СтрРус,сч,1),Сред(СтрЛат,сч,1));	
	КонецЦикла;
	Возврат Рез;
	
КонецФункции // стр_ЗаменитьСхожиеСимволыРусНаЛат()

// импортировано из БП
Функция стр_ДополнитьСтроку(Знач Строка, Знач ДлинаСтроки, Знач Символ = "0", Знач Режим = "Слева") Экспорт
	
	// Длина символа не должна превышать единицы.
	Символ = Лев(Символ, 1);
	
	// Удаляем крайние пробелы слева и справа строки.
	Строка = СокрЛП(Строка);
	
	КоличествоСимволовНадоДобавить = ДлинаСтроки - СтрДлина(Строка);
	
	Если КоличествоСимволовНадоДобавить > 0 Тогда
		
		СтрокаДляДобавления = стр_СформироватьСтрокуСимволов(Символ, КоличествоСимволовНадоДобавить);
		
		Если ВРег(Режим) = "СЛЕВА" Тогда
			
			Строка = СтрокаДляДобавления + Строка;
			
		ИначеЕсли ВРег(Режим) = "СПРАВА" Тогда
			
			Строка = Строка + СтрокаДляДобавления;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

// импортировано из БП
Функция стр_СформироватьСтрокуСимволов(Знач Символ, Знач ДлинаСтроки) Экспорт
	
	Результат = "";
	Для Счетчик = 1 По ДлинаСтроки Цикл
		Результат = Результат + Символ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#Область Даты

Функция РазностьДат(ДатаНач, ДатаКон) Экспорт 
Разность = ДатаКон - ДатаНач;
Разность = Цел(Разность/60); // количество минут
 
Часов = (Разность/60);
Минут = Разность - (Часов*60);
СтрокаРазности = Строка(Часов)+" ч. "+Строка(Минут)+" мин.";
Возврат СтрокаРазности;
КонецФункции

#КонецОбласти 

#Область Структуры

// создает структуру. если переданы поля, то создает поля
Функция ст_Создать(ИменаПолей="",Объект=Неопределено) Экспорт 
	
	Структура = Новый Структура;
	
	Если ИменаПолей <> "" Тогда
		
		Если Объект = Неопределено Тогда
			
			МассивПолей = м_СоздатьИзСтроки(ИменаПолей,",");
			Для каждого Элемент Из МассивПолей Цикл
				
				Структура.Вставить(Элемент,Неопределено);
				
			КонецЦикла;
			
		Иначе
			
			ст_ДобавитьСвойства(Структура,ИменаПолей,Объект);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат(Структура);
	
КонецФункции

// заполнение структуры по полям объекта
Процедура ст_ДобавитьСвойства(Структура,Свойства,Объект=Неопределено) Экспорт 
	// --- 
	
	// ИмяПоля:Реквизит.Подреквизит1.Подреквизит2,ИмяПоля2
	// 
	
	Свойства = СтрЗаменить(Свойства,Символы.ПС,"");
	
	Если Свойства = "*" Тогда
		
		 Если ТипЗнч(Объект)=Тип("Структура") Тогда
			 
			 Для каждого КлючЗначение Из Объект Цикл
				 
				 ст_УстановитьСвойство(Структура,КлючЗначение.Ключ,КлючЗначение.Значение);
				 
			 КонецЦикла; 
			 
		 КонецЕсли; 
		 
		 Если ТипЗнч(Объект)=Тип("ОбъектXDTO") Тогда
			 
			Для каждого Свойство Из Объект.Свойства() Цикл
				 
				 ст_УстановитьСвойство(Структура,Свойство.Имя,Объект[Свойство.Имя]);
				 
			 КонецЦикла;			 
			 
		 КонецЕсли; 
		
	 Иначе
		 
		 МассивСвойств = м_СоздатьИзСтроки(Свойства);
		 Для каждого Свойство Из МассивСвойств Цикл
			 
			 СтруктураСвойства = _СтруктураПоля(Свойство); 
			 ст_УстановитьСвойство(Структура,СтруктураСвойства.Ключ,?(СтруктураСвойства.Заполнение,ЗначениеПоПутиДанных(Объект,СтруктураСвойства.Адрес),Неопределено));
			 
		 КонецЦикла; 
		 
	 КонецЕсли;  
	
	// --- 
КонецПроцедуры

// заполнение структуры по полям объекта (без ст_УстановитьСвойство(), можно использовать для заполнения объектов)
Процедура ст_ЗаполнитьСвойства(Структура,Свойства,Объект) Экспорт 
	// --- 
	
	// ИмяПоля:Реквизит.Подреквизит1.Подреквизит2,ИмяПоля2
	// 
	
	Свойства = СтрЗаменить(Свойства,Символы.ПС,"");
	
	Если Свойства = "*" Тогда
		
		 Если ТипЗнч(Объект)=Тип("Структура") Тогда
			 
			 Для каждого КлючЗначение Из Объект Цикл
				 
				 Структура[КлючЗначение.Ключ]=КлючЗначение.Значение;
				 
			 КонецЦикла; 
			 
		 КонецЕсли; 
		
	 Иначе
		 
		 МассивСвойств = м_СоздатьИзСтроки(Свойства);
		 Для каждого Свойство Из МассивСвойств Цикл
			 
			 СтруктураСвойства = _СтруктураПоля(Свойство); 
			 Структура[СтруктураСвойства.Ключ]=ЗначениеПоПутиДанных(Объект,СтруктураСвойства.Адрес);
			 
		 КонецЦикла; 
		 
	 КонецЕсли;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

// возвращет структуру с отбором по одному полю
Функция ст_Отбор(Поле,Значение=Неопределено) Экспорт 
	// --- 
	
	Возврат(Новый Структура(Поле,Значение)); 
	
	// --- 
КонецФункции

// формирует структуру колонок таблицы, не заполняет
Функция ст_СоздатьИзТаблицы(Таблица) Экспорт
	
	Структура = Новый Структура;
	Для каждого Колонка Из Таблица.Колонки Цикл
		
		Структура.Вставить(Колонка.Имя,Неопределено);
		
	КонецЦикла; 
	
	Возврат(Структура);
	
КонецФункции

// устанавливает значение по ключу, если ключ отсутствует - создает
Процедура ст_УстановитьСвойство(Структура,Свойство,Значение) Экспорт 
	
	Если НЕ Структура.Свойство(Свойство) Тогда
		
		Структура.Вставить(Свойство,Значение);
		
	Иначе
		
		Структура[Свойство]=Значение;
		
	КонецЕсли; 
	
КонецПроцедуры

// возращает значение по ключу, если ключ не найден возвращает _неопределено_
Функция ст_ПолучитьСвойство(Структура,Свойство,ЗначениеПоУмолчанию=Неопределено) Экспорт 
	
	Если (Структура = Неопределено) Тогда
		Возврат(ЗначениеПоУмолчанию);
	КонецЕсли; 
	
	Если Структура.Свойство(Свойство) Тогда
		
		Возврат(Структура[Свойство]);
		
	Иначе
		
		Возврат(ЗначениеПоУмолчанию);
		
	КонецЕсли; 
	
КонецФункции

// удаляет свойство
Процедура ст_УдалитьСвойство(Структура,Свойство) Экспорт 
	
	Если Структура.Свойство(Свойство) Тогда
		
		Структура.Удалить(Свойство);
			
	КонецЕсли; 
	
КонецПроцедуры

Процедура ст_УдалитьСвойства(Структура,Свойства) Экспорт 
	// --- 
	
	Свойства = СтрЗаменить(Свойства,Символы.ПС,"");
	МассивСвойств = м_СоздатьИзСтроки(Свойства);
	Для каждого Свойство Из МассивСвойств Цикл
		
		ст_УдалитьСвойство(Структура,Свойство)
		
	КонецЦикла;	
	
	// --- 
КонецПроцедуры
  
// создает структуру из строки с разделителями
// пример ф("А:Б:В",":","Поле1,Поле2,Поле3") создаст {Поле1=А,Поле2=Б,Поле3=В}
Функция ст_СоздатьИзМаркированнойСтроки(Строка,Разделитель,Свойства) Экспорт 
	// --- 
	
	Структура = Новый Структура;
	
	МассивСвойств = м_СоздатьИзСтроки(Свойства);
	Строки = стр_РазбитьНаСтроки(Строка,Разделитель);
	ЧислоСтрок = стр_ЧислоСтрок(Строки);
	
	Индекс=1;
	Для каждого Свойство Из МассивСвойств Цикл
		
		// определяем значение
		Если Индекс > ЧислоСтрок Тогда
			
			Значение = "";
			
		Иначе
			
			Значение = стр_ПолучитьСтроку(Строки,,Индекс);
			
		КонецЕсли;
		
		Структура.Вставить(Свойство,Значение);
		
		// --- 
		Инкремент(Индекс);
		
	КонецЦикла; 
	
	Возврат(Структура);
	
	// --- 
КонецФункции
  
// возвращает копию структуры
Функция ст_Скопировать(Структура) Экспорт
//Назначение: Копирует структуру. Почему-то в 1С можно скопировать список, таблицу значений, дерево значений, но не структуру
//ДатаСоздания: 20070620
//Автор: Fixin
//Тестирована: Нет
	Перем Р;
	Р=Новый Структура();
	Для Каждого Эл ИЗ Структура Цикл
		Р.Вставить(Эл.Ключ, Эл.Значение);
	КонецЦикла;
	Возврат Р;
КонецФункции

// заполняет структуру по строке таблицы значений, ничего лишнего не создает
Процедура ст_ЗаполнитьПоСтрокеТаблицы(Структура,СтрокаТаблицы) Экспорт 
	
	ЗаполнитьЗначенияСвойств(Структура,СтрокаТаблицы);
	
КонецПроцедуры

// возвращает структуру переданного объекта
Функция ст_СформироватьСтруктуруОбъекта(Объект,ФормироватьПредставлениеТабличныхЧастей=Ложь) Экспорт 
	
	//Объект = Документы.РучнаяОперация.СоздатьДокумент();
	
	СтруктураОбъекта = Новый Структура;
	
	Для каждого Реквизит Из Объект.Метаданные().СтандартныеРеквизиты Цикл
		
		СтруктураОбъекта.Вставить(Реквизит,Объект[Реквизит]);
		
	КонецЦикла;
	
	Для каждого Реквизит Из Объект.Метаданные().Реквизиты Цикл
		
		СтруктураОбъекта.Вставить(Реквизит,Объект[Реквизит]);
		
	КонецЦикла; 
	
	// теперь, если требуется, сформируем таблицы значений для табличных частей
	Если ФормироватьПредставлениеТабличныхЧастей Тогда
		
		Для каждого ТабличнаяЧасть Из Объект.Метаданные().ТабличныеЧасти Цикл
			
			ТаблицаПредставления = Объект[ТабличнаяЧасть].Выгрузить();
			СтруктураОбъекта.Вставить(ТабличнаяЧасть,ТаблицаПредставления);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат(СтруктураОбъекта);
	
КонецФункции

// представление структуры
Функция ст_Представление(Структура,Разделитель=",") Экспорт 
	// --- 
	
	Представление = "";
	// --- 
	
	Для каждого КлючЗначение Из Структура Цикл
		
		Если Представление <> "" Тогда
			
			стр_Добавить(Представление,Разделитель);
			
		КонецЕсли; 
		
		стр_Добавить(Представление,""""+КлючЗначение.Ключ+"""=");
		стр_Добавить(Представление,Строка(КлючЗначение.Значение));
		
	КонецЦикла; 
	
	// --- 
	Возврат(Представление);
	
	// --- 
КонецФункции

// 
Процедура ст_Дополнить(Структура,СтруктураДополнения) Экспорт 
	// --- 
	
	
	
	// --- 
КонецПроцедуры
  

#КонецОбласти

#Область Массивы

// конструктор
Функция м_Создать(Адрес=Неопределено,Коллекция=Неопределено) Экспорт 
	
	Массив = Новый Массив;
	// --- 
	Если Адрес <> Неопределено И Коллекция <> Неопределено Тогда
		
		Для каждого Стр Из Коллекция Цикл
			
			Массив.Добавить(ЗначениеПоПутиДанных(Стр,Адрес));
			
		КонецЦикла; 
		
	КонецЕсли; 
	// --- 
	Возврат(Массив);
	
КонецФункции
 
// формирует массив по строке
Функция м_СоздатьИзСтроки(Строка,Разделитель=",") Экспорт
	
	Строки = стр_РазбитьНаСтроки(Строка,Разделитель);
	Массив = Новый Массив;
	
	Для Индекс=1 По стр_ЧислоСтрок(Строки) Цикл
		
		Массив.Добавить(СтрПолучитьСтроку(Строки,Индекс));
		
	КонецЦикла; 

	Возврат(Массив);
	
КонецФункции

// создает массив уникальных значений колонки ТЗ
Функция м_СоздатьИзКолонкиТЗ(ТаблицаЗначений,ИмяКолонки,Путь=Неопределено) Экспорт 
	
	Таблица = ТаблицаЗначений.Скопировать(,ИмяКолонки);
	Таблица.Свернуть(ИмяКолонки,"");
	
	Если Путь = Неопределено Тогда
		
		Возврат(Таблица.ВыгрузитьКолонку(ИмяКолонки));
		
	Иначе
		
		Таблица.Колонки.Добавить("ИтоговоеЗначение");
		
		Для каждого Стр Из Таблица Цикл
			
			Стр.ИтоговоеЗначение = ЗначениеПоПутиДанных(Стр[ИмяКолонки],Путь);
			
		КонецЦикла; 
		Таблица.Свернуть("ИтоговоеЗначение");
		Возврат(Таблица.ВыгрузитьКолонку("ИтоговоеЗначение"));
		
	КонецЕсли; 
	
КонецФункции

// добавляет в массив уникально
Процедура м_ДобавитьУникально(Массив,Значение) Экспорт
	
	Если Массив.Найти(Значение)=Неопределено Тогда
		
		Массив.Добавить(Значение);
		
	КонецЕсли; 
	
КонецПроцедуры

// копирует массив
Функция м_СкопироватьМассив(Массив) Экспорт
	
	//Назначение: Копирует массив. Почему-то в 1С можно скопировать список, таблицу значений, дерево значений, но не структуру
	//ДатаСоздания: 20070620
	//Автор: Fixin
	//Тестирована: Нет
	Рез=Новый Массив();
	Для Каждого Эл ИЗ Массив Цикл
		Рез.Добавить(Эл);
	КонецЦикла;
	Возврат Рез;
	
КонецФункции

// копирует только уникальные значения массива
Функция м_СкопироватьУникальныеЗначения(Массив) Экспорт
	
	НовыйМассив = Новый Массив;
	Для каждого Элемент Из Массив Цикл
		
		м_ДобавитьУникально(НовыйМассив,Элемент);
		
	КонецЦикла; 
	
	Возврат(НовыйМассив);
	
КонецФункции

// объединяет массивы
Функция м_ОбъединитьМассивы(М1,М2, флНовый=Истина) Экспорт
	
	//Назначение: Объединяет массивы
	//ДатаСоздания: 20070610
	//Автор: Fixin
	//Тестирована: Нет
	Если флНовый Тогда
		Получатель=м_СкопироватьМассив(М1);
	Иначе
		Получатель=М1;
	КонецЕсли;
	
	Для Каждого Эл ИЗ М2 Цикл
		
		м_ДобавитьУникально(Получатель,Эл);
		//Получатель.Добавить(Эл);
	КонецЦикла;
	
	Возврат Получатель;
	
КонецФункции

// возвращает пересечение массивов
Функция м_ПересечьМассивы(М1,М2) Экспорт
	
	Если М1.Количество() >= М2.Количество() Тогда
		
		БольшойМассив = М1;
		МалыйМассив = М2;
		
	Иначе
		
		БольшойМассив = М2;
		МалыйМассив = М1;
		
	КонецЕсли; 
	
	ВозвращаемыйМассив = Новый Массив;
	
	Для каждого Элемент Из МалыйМассив Цикл
		
		Если БольшойМассив.Найти(Элемент)=Неопределено Тогда
			
			м_ДобавитьУникально(ВозвращаемыйМассив, Элемент);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(ВозвращаемыйМассив);
	
КонецФункции

// массив в строку
Функция м_Представление(Массив,Разделитель=",",Реквизит=Неопределено) Экспорт 
	
	Представление = "";
	
	флИспользоватьРеквизит = ?(Реквизит=Неопределено,Ложь,Истина);
	
	Для каждого Стр Из Массив Цикл
		
		Если Представление <> "" Тогда
			
			Представление = Представление + Разделитель;
			
		КонецЕсли; 
		
		Представление = Представление + ?(флИспользоватьРеквизит, СокрЛП(Строка(Стр[Реквизит])), СокрЛП(Строка(Стр)));
		
	КонецЦикла;
	
	Возврат(Представление);
	
КонецФункции


Процедура м_УдалитьПустые(Массив) Экспорт 
	// --- 
	
	НовыйМассив = Новый Массив;
	Для каждого Стр Из Массив Цикл
		
		Если ЗначениеЗаполнено(Стр) Тогда
			
			НовыйМассив.Добавить(Стр);
			
		КонецЕсли; 
		
	КонецЦикла; 
	Массив = НовыйМассив;
	
	// --- 
КонецПроцедуры
  
#КонецОбласти

#Область СпискиЗначений

// создание списка
// СоответствиеРеквизитов: "Значение:Адрес1,Представление:Адрес2,Пометка:Адрес3", обязательно только значение
Функция сп_Создать(СоответствиеРеквизитов=Неопределено,Источник=Неопределено) Экспорт 
	
	Список = Новый СписокЗначений;
	// --- 
	Если Источник = Неопределено Тогда
		
		Возврат(Список);
		
	Иначе
		
		сп_Добавить(Список,СоответствиеРеквизитов,Источник);
		
	КонецЕсли; 
	// --- 
	Возврат(Список);
	
КонецФункции

// добавление элементов по коллекции
// см. сп_Создать
Функция сп_Добавить(Список,СоответствиеРеквизитов=Неопределено,Источник=Неопределено) Экспорт 
	// --- 
	
	Если СоответствиеРеквизитов = Неопределено Тогда
		
		Для каждого ЭлементКоллекции Из Источник Цикл
			
			Список.Добавить(ЭлементКоллекции);
			
		КонецЦикла; 
		
	Иначе
		
		МассивПолей = ПоляПоСтроке(СоответствиеРеквизитов);
		// анализируем
		АдресЗначения = "";
		АдресПредставления = "";
		АдресПометки = "";
		Для каждого Поле Из МассивПолей Цикл
			
			Если Поле.Заполнение Тогда
				
				Если Поле.Ключ = "Значение" Тогда
					
					АдресЗначения = Поле.Адрес;
					
				ИначеЕсли Поле.Ключ = "Представление" Тогда 
					
					АдресПредставления = Поле.Адрес; 
					
				ИначеЕсли Поле.Ключ = "Пометка" Тогда 
					
					АдресПометки = Поле.Адрес; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		// --- 
		Если АдресЗначения <> "" Тогда
			
			Для каждого ЭлементКоллекции Из Источник Цикл
				
				Список.Добавить(ЗначениеПоПутиДанных(ЭлементКоллекции,АдресЗначения),
				?(АдресПредставления <> "",ЗначениеПоПутиДанных(ЭлементКоллекции,АдресПредставления),Неопределено),
				?(АдресПометки <> "",ЗначениеПоПутиДанных(ЭлементКоллекции,АдресПометки),Неопределено));
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции
  
// ---------------------------------------------------------------------------- 

// формирование списка по строке
Функция сп_СоздатьИзСтроки(Строка,Разделитель=",",Пометка=Ложь) Экспорт 
	
	Строки = СтрЗаменить(Строка,Разделитель,Символы.ПС);
	Список = Новый СписокЗначений;
	
	Для Индекс=1 По СтрЧислоСтрок(Строки) Цикл
		
		Список.Добавить(СтрПолучитьСтроку(Строки,Индекс));
		
	КонецЦикла; 
	
	Если Пометка Тогда
		
		Список.ЗаполнитьПометки(Пометка);
		
	КонецЕсли; 
	
	Возврат(Список);
	
КонецФункции

// deprecated
// формирование списка из коллекции
Функция сп_СоздатьИзКоллекции(Коллекция, Реквизит = "", Пометка = Ложь) Экспорт 
	
	Список = Новый СписокЗначений;
	Для каждого Элемент Из Коллекция Цикл
		
		Если Реквизит="" Тогда
			
			Список.Добавить(Элемент);
			
		Иначе
			
			Если НеПустоеЗначение(Элемент[Реквизит]) Тогда
				
				Список.Добавить(Элемент[Реквизит]);
				
			КонецЕсли; 
			
		КонецЕсли; 
				
	КонецЦикла; 
	
	Если Пометка Тогда
		
		Список.ЗаполнитьПометки(Пометка);
		
	КонецЕсли; 
	
	Возврат(Список);
	
КонецФункции

// deprecated
// возвращает список значений из колонки таблицы значений
Функция сп_СоздатьИзКолонкиТЗ(ТаблицаЗначений,ИмяКолонки="") Экспорт 
			
	Таблица = ТаблицаЗначений.Скопировать(,ИмяКолонки);
	Таблица.Свернуть(ИмяКолонки,"");
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку(ИмяКолонки));
	
	Возврат(СписокЗначений);
	
КонецФункции

// deprecated
// формирует список из массива
Функция сп_СоздатьИзМассива(Массив) Экспорт 
	
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(Массив);
	Возврат(Список);
		
КонецФункции

// представление списка
Функция сп_Представление(Список,Разделитель=",",флИспользоватьПредставление=Истина, ЗначениеПометки=Неопределено) Экспорт 
	
	Представление = "";
	
	Если ЗначениеПометки = Неопределено Тогда
		
		Для каждого Стр Из Список Цикл
			
			Если Представление <> "" Тогда
				
				Представление = Представление + Разделитель;
				
			КонецЕсли; 
			
			Представление = Представление + ?(флИспользоватьПредставление,Стр.Представление,Строка(Стр.Значение));
			
		КонецЦикла;
		
	Иначе
		
		Для каждого Стр Из Список Цикл
			
			Если Стр.Пометка = ЗначениеПометки Тогда
				
				Если Представление <> "" Тогда
					
					Представление = Представление + Разделитель;
					
				КонецЕсли; 
				
				Представление = Представление + ?(флИспользоватьПредставление,Стр.Представление,Строка(Стр.Значение));
				
				
			КонецЕсли; 
						
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат(Представление);
	
КонецФункции

// объединение списков
Функция сп_ОбъединениеСписков(Список1,Список2) Экспорт 
	
	Список = Список1.Скопировать();
	
	Для каждого Элемент Из Список2 Цикл
		
		Если Список.НайтиПоЗначению(Элемент.Значение)=Неопределено Тогда
			
			Список.Добавить(Элемент.Значение,Элемент.Представление,Элемент.Пометка,Элемент.Картинка);
			
		КонецЕсли; 
		
	КонецЦикла; 	
	
	Возврат(Список);
	
КонецФункции

// добавляет в список, если значение в списке не найдено
Функция сп_ДобавитьУникально(Список, Значение, Представление="", Пометка=Ложь, _Картинка=Неопределено) Экспорт
//Назначение: Добавляет в список значение только если его нет в списке. 
//$Представление: Представление значения, если не задано, не указывается.
//$Возврат: Возвращает элемент списка существующего/найденного элемента
//Описание:
//	Проверить, что было добавление можно путем контроля размера списка до и после (если надо)
//Тест: 
//	//(выдает 1,2)
//	Список=Новый СписокЗначений();
//	ДобавитьВСписокУникально(Список, 1);
//	ДобавитьВСписокУникально(Список, 2, "Вася");
//	ДобавитьВСписокУникально(Список, 1);
//	Сообщить(бфКоллекции.СписокВСтроку(Список));
//ДатаСоздания: 20071204
//СтароеИмя: ДобавитьУникальноВСписокЗначений
//Тестирована: Да
//Автор: Fixin
//??? Как быть с картинкой в клиент-сервере
	Эл=Список.НайтиПоЗначению(Значение);
	Если Эл=Неопределено Тогда
		Если _Картинка=Неопределено Тогда
#Если Клиент Тогда
				Картинка=Новый Картинка();	
#Иначе
				Картинка=_Картинка;	
#КонецЕсли
		Иначе
			Картинка=_Картинка;	
		КонецЕсли;
		Эл=Список.Добавить(Значение, Представление, Пометка, Картинка);
	КонецЕсли;
	Возврат Эл;
КонецФункции

// создает новый список значений копированием из передаваемого помеченных элементов
Функция сп_СкопироватьПомеченныеЭлементы(Список, Пометка=истина) Экспорт
	
	//ДатаСоздания: 20080215
	//Тестирована: Да
	//Автор: Fixin
	//Назначение: Копирует список значений, в копии остаются только те элементы, которые были помечены в соответствии с Пометка
	Перем Р;
	Р=Новый СписокЗначений();
	
	Для Каждого Эл ИЗ Список Цикл
		Если Эл.Пометка=Пометка Тогда
			Р.Добавить(Эл.Значение, Эл.Представление, Эл.Пометка, Эл.Картинка);
		КонецЕсли;
	КонецЦикла;
	Возврат Р;
	
КонецФункции

// возвращает список с отмеченными или неотмечаенными элементами
Функция сп_ОтобратьПоПометке(Список,ЗначениеПометки) Экспорт 
	// --- 
	
	ИтоговыйСписок = Новый СписокЗначений;
	
	Для каждого ЭлементСписка Из Список Цикл
		
		Если ЭлементСписка.Пометка = ЗначениеПометки Тогда
			
			ИтоговыйСписок.Добавить(ЭлементСписка.Значение,ЭлементСписка.Представление,ЭлементСписка.Пометка,ЭлементСписка.Картинка);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(ИтоговыйСписок);
	
	// --- 
КонецФункции

#КонецОбласти

#Область Соответствия

// аналогично созданию ТЗ, 
// если колонок данных несколько, то они формируют структуру
Функция со_Создать(КолонкаИндекса=Неопределено,КолонкиДанных="",Источник=Неопределено) Экспорт
	
	Соответствие = Новый Соответствие;
	Если КолонкаИндекса <> Неопределено Тогда
		со_ДобавитьЭлементы(Соответствие,КолонкаИндекса,КолонкиДанных,Источник);		
	КонецЕсли; 
	
	Возврат(Соответствие);
КонецФункции

// добавляет элементы соотвествия из коллекции
Процедура со_ДобавитьЭлементы(Соответствие,РеквизитИндекса,КолонкиДанных="",Источник) Экспорт 
	// --- 
	
	МассивКолонокДанных = м_СоздатьИзСтроки(КолонкиДанных,",");
	ФормироватьСтруктуруДанных = (МассивКолонокДанных.Количество() > 1);
	
	// формируем структуру колонок данных
	Если ФормироватьСтруктуруДанных Тогда
		
		СоКД = Новый Соответствие;
		ШаблонСтруктуры = _сф.ст_Создать();
		Для каждого Свойство Из МассивКолонокДанных Цикл
			
			СтруктураСвойства = _СтруктураПоля(Свойство); 
			СоКД.Вставить(СтруктураСвойства.Ключ,СтруктураСвойства.Адрес);
			ШаблонСтруктуры.Вставить(СтруктураСвойства.Ключ);
			
		КонецЦикла; 
		
		Для каждого СтрокаИсточника Из Источник Цикл
			
			СД = ст_Скопировать(ШаблонСтруктуры);
			Для каждого ЭлементСоКД Из СоКД Цикл
				
				СД[ЭлементСоКД.Ключ]=ЗначениеПоПутиДанных(СтрокаИсточника,ЭлементСоКД.Значение);
				
			КонецЦикла; 
			Соответствие.Вставить(ЗначениеПоПутиДанных(СтрокаИсточника,РеквизитИндекса),СД);
			
		КонецЦикла;
		
	Иначе
		
		Для каждого ЭлементКоллекции Из Источник Цикл
			
			Если КолонкиДанных = "" Тогда
				
				Соответствие.Вставить(ЗначениеПоПутиДанных(ЭлементКоллекции,РеквизитИндекса),ЭлементКоллекции);
				
			Иначе
				
				Адрес = _СтруктураПоля(КолонкиДанных).Адрес;
				Соответствие.Вставить(ЗначениеПоПутиДанных(ЭлементКоллекции,РеквизитИндекса),ЗначениеПоПутиДанных(ЭлементКоллекции,Адрес));	
				
			КонецЕсли; 
			
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат
	
	// --- 
КонецПроцедуры

// получение значения с возможностью указать значение по-умолчанию
Функция со_Получить(Соответствие, Ключ, ЗначениеПоУмолчанию=Неопределено) Экспорт 
	// --- 
	
	Значение = Соответствие.Получить(Ключ);
	Если (Значение <> Неопределено) Тогда
		Возврат(Значение);
	Иначе
		Возврат(ЗначениеПоУмолчанию);
	КонецЕсли; 
	
	// --- 
КонецФункции
  

#КонецОбласти

#Область ТаблицыЗначений

// создает ТЗ с заданным набором колонок
// Источник: массив, коллекция, ТЗ, списокXDTO и прочие с возможностью перебора
// ИменаКолонок: "Колонка1:АдресДанных,Колонка2,Колонка3:"
Функция т_Создать(ИменаКолонок,Источник=Неопределено) Экспорт 
	
	Таблица = Новый ТаблицаЗначений;
	// --- 
	т_ДобавитьКолонки(Таблица,ИменаКолонок,Источник);
	// --- 
	Возврат(Таблица);
	
КонецФункции

// добавляет колонки таблицы и заполняет по коллекции
// см. т_Создать
Процедура т_ДобавитьКолонки(Таблица,ИменаКолонок,Источник=Неопределено) Экспорт
	
	МассивПолей = ПоляПоСтроке(ИменаКолонок);
	МассивИменПолей = м_Создать("Ключ",МассивПолей);	
	// --- 
	Для каждого ИмяПоля Из МассивИменПолей Цикл
		Таблица.Колонки.Добавить(ИмяПоля);
	КонецЦикла;
	// --- 
	
	Если Источник <> Неопределено Тогда
		
		Поля = со_Создать("Ключ",,МассивПолей);
		Для каждого ЭлементыКоллекции Из Источник Цикл
			
			Нстр = Таблица.Добавить();
			Для каждого СтрПоле Из Поля Цикл
				Поле = Поля.Получить(СтрПоле.Ключ);
				Если Поле.Заполнение Тогда
					Нстр[Поле.Ключ]=ЗначениеПоПутиДанных(ЭлементыКоллекции,Поле.Адрес);	
				КонецЕсли; 
				
			КонецЦикла; 
						
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

// --- 

// удаляет колонки из таблицы
Процедура т_УдалитьКолонки(Таблица,ИменаКолонок) Экспорт 
	// --- 
	
	МассивКолонок = м_СоздатьИзСтроки(ИменаКолонок,",");
	Для каждого Колонка Из МассивКолонок Цикл
		
		Таблица.Колонки.Удалить(Таблица.Колонки.Найти(Колонка));
		
	КонецЦикла;
	
	// --- 
КонецПроцедуры

// переименование колонок в таблице (СтароеИмя:НовоеИмя)
Процедура т_ПереименоватьКолонки(Таблица,СоответствиеИмен) Экспорт 
	// --- 
	
	Соответствия = м_СоздатьИзСтроки(СоответствиеИмен,",");
	Для каждого ЭлементСоответствия Из Соответствия Цикл
		
		// разбиваем на пары
		СтруктураСоответствия = ст_СоздатьИзМаркированнойСтроки(ЭлементСоответствия,":","СтароеИмя,НовоеИмя");
		Колонка = Таблица.Колонки.Найти(СтруктураСоответствия.СтароеИмя);
		Если Колонка <> Неопределено Тогда
			
			Колонка.Имя = СтруктураСоответствия.НовоеИмя;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

// ----------------------------------------------------------------------------  

// заполняет колонку по реквизиту другой колонки
Процедура т_ЗаполнитьКолонку(Таблица,ИмяКолонки,Путь) Экспорт 
	// --- 
	
	Для каждого Стр Из Таблица Цикл
		
		Стр[ИмяКолонки] = ЗначениеПоПутиДанных(Стр,Путь);
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

// функция (!) свертки таблицы значений, если передаются только колонки суммирования, то свертка идёт только по ним
Функция т_Свернуть(Таблица,КолонкиГруппировок="",КолонкиСуммирования="") Экспорт 
		
	Если стр_Сократить(КолонкиГруппировок)="" Тогда
		
		т_СвернутьПоКолонкамСуммирования(Таблица,КолонкиСуммирования);
		
	Иначе
		
		Таблица.Свернуть(КолонкиГруппировок,КолонкиСуммирования);
		
	КонецЕсли; 
		
	Возврат(Таблица);
	
КонецФункции

// сворачивает таблицу по всем оставшимся колонкам, кроме указанных
Процедура т_СвернутьПоКолонкамСуммирования(Таблица,КолонкиСуммирования) Экспорт 
	
	СписокКолонокТаблицы = сп_СоздатьИзКоллекции(Таблица.Колонки,"Имя",Истина);
	СписокКолонокСуммирования = сп_СоздатьИзСтроки(КолонкиСуммирования);
	
	Для каждого ЭлементСписка Из СписокКолонокТаблицы  Цикл
		
		 ЭлементСписка.Пометка = ?(СписокКолонокСуммирования.НайтиПоЗначению(ЭлементСписка.Значение)<>Неопределено,Ложь,Истина);
		
	КонецЦикла; 
	
	КолонкиГруппировок = сп_Представление(СписокКолонокТаблицы,",",Ложь,Истина);
	
	Таблица.Свернуть(КолонкиГруппировок,КолонкиСуммирования);
	
КонецПроцедуры

// добавляет колонки в таблицу

// добавляет колонку и заполняет, можно типизировать
Процедура т_ДобавитьКолонку(Таблица,ИмяКолонки,ОписаниеТипов=Неопределено,Значение=Неопределено) Экспорт 
	// --- 
	
	Таблица.Колонки.Добавить(ИмяКолонки,ОписаниеТипов);
	Если Значение <> Неопределено Тогда
		
		Таблица.ЗаполнитьЗначения(Значение,ИмяКолонки);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

Процедура т_ЗаполнитьЗначения(Таблица,ИмяКолонки,Значение) Экспорт 
	// --- 
	
	Таблица.ЗаполнитьЗначения(Значение,ИмяКолонки);
	
	// --- 
КонецПроцедуры

// формирует таблицу значений из элементов коллекции или реквизитов элементов коллекции
Функция т_СоздатьИзКоллекции(Коллекция, Реквизит="") Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	флФормироватьПоРеквизиту = ?(Реквизит="",Ложь,Истина);
	
	Если НЕ флФормироватьПоРеквизиту Тогда
		
		Таблица.Колонки.Добавить("Элемент");
		
	Иначе
		
		Таблица.Колонки.Добавить(Реквизит);
		
	КонецЕсли; 
	
	Для каждого Стр Из Коллекция Цикл
		
		Если флФормироватьПоРеквизиту Тогда
			
			Нстр = Таблица.Добавить();
			Нстр[Реквизит]=Стр[Реквизит];
			
		Иначе
			
			Нстр = Таблица.Добавить();
			Нстр["Элемент"]=Стр;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(Таблица);
	
КонецФункции

// формирует представление значений колонки таблицы
Функция т_ПредставлениеКолонки(Таблица,ИмяКолонки,Разделитель=",") Экспорт
	
	Представление = "";
	
	Для каждого Стр Из Таблица Цикл
		
		Если Представление <> "" Тогда
			
			Представление = Представление + Разделитель;
			
		КонецЕсли; 
		
		Представление = Представление + стр_Сократить(Стр[ИмяКолонки]);
		
	КонецЦикла; 
	
	Возврат(Представление);
	
КонецФункции

// ообъединяет таблицы по заданному набору колонок или целиком
Функция т_ОбъединитьТаблицы(Таблица1,Таблица2,НаборКолонок=Неопределено) Экспорт 
	
	// если в качестве набора колонок передано "неопределено", то формируется объединение колонок - 
	// если "" - формируется таблица только с общими колонками
	// если список через запятую - указанные колонки
	
	Если НаборКолонок = Неопределено Тогда
		
		СписокКолонок1 = сп_СоздатьИзКоллекции(Таблица1.Колонки,"Имя");
		СписокКолонок2 = сп_СоздатьИзКоллекции(Таблица2.Колонки,"Имя");
		
		СписокКолонок = сп_ОбъединениеСписков(СписокКолонок1,СписокКолонок2);
				
		Таблица = Новый ТаблицаЗначений;
		Для каждого Колонка Из СписокКолонок Цикл
			
			Таблица.Колонки.Добавить(Колонка.Значение);
			
		КонецЦикла; 
		
		Для каждого СтрокаТЗ Из Таблица1 Цикл
			
			Нстр = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,СтрокаТЗ);
			
		КонецЦикла; 
		Для каждого СтрокаТЗ Из Таблица2 Цикл
			
			Нстр = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,СтрокаТЗ);
			
		КонецЦикла; 
		
		Возврат(Таблица);
		
	ИначеЕсли НаборКолонок = "" Тогда
		
		СписокКолонок1 = сп_СоздатьИзКоллекции(Таблица1.Колонки,"Имя");
		СписокКолонок2 = сп_СоздатьИзКоллекции(Таблица2.Колонки,"Имя");
		
		СписокКолонок = Новый СписокЗначений; // здесь должна быть функция пересечения колонок
		
		Таблица = Новый ТаблицаЗначений;
		Для каждого Колонка Из СписокКолонок Цикл
			
			Таблица.Колонки.Добавить(Колонка.Значение);
			
		КонецЦикла;
		
		Для каждого СтрокаТЗ Из Таблица1 Цикл
			
			Нстр = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,СтрокаТЗ);
			
		КонецЦикла; 
		Для каждого СтрокаТЗ Из Таблица2 Цикл
			
			Нстр = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,СтрокаТЗ);
			
		КонецЦикла; 
		
		Возврат(Таблица);
		
	Иначе
		
		СписокКолонок = сп_СоздатьИзСтроки(НаборКолонок);		
		Таблица = Новый ТаблицаЗначений;
		Для каждого Колонка Из СписокКолонок Цикл
			
			Таблица.Колонки.Добавить(Колонка.Значение);
			
		КонецЦикла; 
		
		Для каждого СтрокаТЗ Из Таблица1 Цикл
			
			Нстр = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,СтрокаТЗ);
			
		КонецЦикла; 
		Для каждого СтрокаТЗ Из Таблица2 Цикл
			
			Нстр = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,СтрокаТЗ);
			
		КонецЦикла; 
		
		Возврат(Таблица);
				
	КонецЕсли; 
		
КонецФункции

// функция быстрого добавления строки таблицы, до 8 колонок
Функция т_ДобавитьСтроку(Таблица,Колонка1=Неопределено,Колонка2=Неопределено,Колонка3=Неопределено,Колонка4=Неопределено,Колонка5=Неопределено,Колонка6=Неопределено,Колонка7=Неопределено,Колонка8=Неопределено) Экспорт 
	// --- 
	
	СписокАргументов = Новый СписокЗначений;
	СписокАргументов.Добавить(Колонка1);
	СписокАргументов.Добавить(Колонка2);
	СписокАргументов.Добавить(Колонка3);
	СписокАргументов.Добавить(Колонка4);
	СписокАргументов.Добавить(Колонка5);
	СписокАргументов.Добавить(Колонка6);
	СписокАргументов.Добавить(Колонка7);
	СписокАргументов.Добавить(Колонка8);
	
	Нстр = Таблица.Добавить();
	
	Для каждого Колонка Из Таблица.Колонки Цикл
		
		Нстр[Колонка.Имя]=СписокАргументов[Таблица.Колонки.Индекс(Колонка)].Значение;
		
	КонецЦикла; 
	
	Возврат(Нстр);
	
	// --- 
КонецФункции

// группирует таблицу
Функция т_Сгруппировать(Таблица,РеквизитыГруппировки,Ресурсы) Экспорт 
	// --- 
	
	// формируем новую таблицу: реквизиты группировки - ресурсы
	МассивРеквизитовГруппировки = ПоляПоСтроке(РеквизитыГруппировки);
	МассивРесурсов = ПоляПоСтроке(Ресурсы);
	// --- 
	НоваяТаблица = т_Создать(РеквизитыГруппировки+","+Ресурсы,Таблица);
	// --- 
	КолонкиГруппировки = м_Представление(МассивРеквизитовГруппировки,",","Ключ");
	ТаблицаГруппировки = т_СкопироватьСвернуть(НоваяТаблица,КолонкиГруппировки);
	// добавляем колонку со значением
	т_ДобавитьКолонку(ТаблицаГруппировки,"Элементы");
	// --- 
	// теперь производим свертку
	ФормироватьСтруктуру = (Количество(МассивРесурсов)<>1);
	КолонкиРесурсов = м_Представление(МассивРесурсов,",","Ключ");
	Если ФормироватьСтруктуру Тогда
		
		Шаблон = ст_Создать(КолонкиРесурсов);
		
	КонецЕсли; 
	// --- 
	Отбор = ст_Создать(КолонкиГруппировки);
	// --- 
	Для каждого НаборИзмерений Из ТаблицаГруппировки Цикл
		
		ст_ЗаполнитьПоСтрокеТаблицы(Отбор,НаборИзмерений);
		Результат = к_НайтиСтроки(НоваяТаблица,Отбор);
		Элементы = м_Создать();
		Для каждого СтрокаРезультата Из Результат Цикл
			
			Если ФормироватьСтруктуру Тогда
				
				НовыйЭлемент = ст_Скопировать(Шаблон);
				ст_ЗаполнитьПоСтрокеТаблицы(НовыйЭлемент,СтрокаРезультата);
				Элементы.Добавить(НовыйЭлемент);
				
			Иначе
				
				Элементы.Добавить(СтрокаРезультата[КолонкиРесурсов]);
				
			КонецЕсли; 
			
		КонецЦикла; 
		НаборИзмерений.Элементы = Элементы;
		
	КонецЦикла; 
	
	// --- 
	
	Возврат(ТаблицаГруппировки);
	
	// --- 
КонецФункции

// копирует колонки и сворачивает по ним
Функция т_СкопироватьСвернуть(Таблица,Колонки,Отбор=Неопределено) Экспорт 
	// --- 
	
	НоваяТаблица = Таблица.Скопировать(Отбор,Колонки);
	НоваяТаблица.Свернуть(Колонки);
	Возврат(НоваяТаблица);
	
	// --- 
КонецФункции
  
#КонецОбласти

#Область Коллекции

// возвращает количество элементов коллекции
Функция Количество(Коллекция) Экспорт 
	
	Возврат(Коллекция.Количество());
	
КонецФункции

// универсальный итог, для ТЗ, списка и массива
Функция Итог(Коллекция, Реквизит="", ФорматИтога=Неопределено) Экспорт 
	// --- 
	
	Если ТипЗнч(Коллекция)=Тип("СписокЗначений") Тогда 
		
		Сумма = 0;
		Если Реквизит="" Тогда
			
			Для каждого Стр Из Коллекция Цикл
				
				Инкремент(Сумма, Стр.Значение);
				
			КонецЦикла;
			
		Иначе
			
			Для каждого Стр Из Коллекция Цикл
				
				Инкремент(Сумма, Стр.Значение[Реквизит]);
				
			КонецЦикла;
			
		КонецЕсли; 
		
		Результат = Сумма;
		
	ИначеЕсли ТипЗнч(Коллекция)=Тип("Массив") Тогда 
		
		Сумма = 0;
		Если Реквизит="" Тогда
			
			Для каждого Стр Из Коллекция Цикл
				
				Инкремент(Сумма, Стр);
				
			КонецЦикла; 
			
		Иначе
			
			Для каждого Стр Из Коллекция Цикл
				
				Инкремент(Сумма, Стр[Реквизит]);
				
			КонецЦикла; 
			
		КонецЕсли;
		
		Результат = Сумма; 
		
	Иначе
		
		// ТЗ или ТЧ
		Результат = Коллекция.Итог(Реквизит);
				
	КонецЕсли; 
	
	Если ФорматИтога <> Неопределено Тогда
		
		Возврат(Формат(Результат,ФорматИтога));
		
	Иначе
		
		Возврат(Результат); 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// обёртка над НайтиСтроки()
Функция к_НайтиСтроки(Коллекция,Отбор) Экспорт 
	
	Возврат(Коллекция.НайтиСтроки(Отбор));
	
КонецФункции

// возвращает первую строку из найденных по отбору строк
Функция к_НайтиСтроку(Коллекция,Знач Отбор,ЗначениеОтбора=Неопределено) Экспорт 
	
	Если ТипЗнч(Отбор) <> Тип("Структура") Тогда
		
		Отбор = ст_Отбор(Отбор,ЗначениеОтбора);
			
	КонецЕсли; 
	
	Возврат(к_ПервыйЭлемент(Коллекция.НайтиСтроки(Отбор)));
	
	// --- 
КонецФункции

// поиск элементов, удовлетворяющих критерию
Функция к_НайтиЭлементыПоУсловию(Коллекция,Реквизит,ВидСравненияКД=Неопределено,Значение=Неопределено) Экспорт 
	// --- 
	
	Если ВидСравненияКД = Неопределено Тогда
		
		ВидСравненияКД = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли; 
	// ---------------------------------------------------------------------------- 
	
	МассивНайденных = Новый Массив;
	// --- 
	Для каждого Элемент Из Коллекция Цикл
		
		ЛевоеЗначение = ЗначениеПоПутиДанных(Элемент,Реквизит);
		Если Условие(ЛевоеЗначение,ВидСравненияКД,Значение) Тогда
			
			МассивНайденных.Добавить(Элемент);
			
		КонецЕсли; 
		
	КонецЦикла; 
	// --- 
	Возврат(МассивНайденных);
	
	// --- 
КонецФункции

// возвращает первый элемент коллекции
Функция к_ПервыйЭлемент(Коллекция) Экспорт 
	
	Если Количество(Коллекция)=0 Тогда
		
		Возврат(Неопределено);
		
	Иначе
		
		Возврат(Коллекция[0]);
		
	КонецЕсли; 
	
КонецФункции

// возвращает последний элемент коллекции
Функция к_ПоследнийЭлемент(Коллекция) Экспорт 
	
	Если Количество(Коллекция)=0 Тогда
		
		Возврат(Неопределено);
		
	Иначе
		
		Возврат(Коллекция[Количество(Коллекция)-1]);
		
	КонецЕсли; 
	
КонецФункции

// удаляет элементы коллекции по переданному отбору (ТЗ,ДЗ,ТЧ)
Процедура к_УдалитьЭлементыПоОтбору(Коллекция,Отбор) Экспорт 
	
	Массив = Коллекция.НайтиСтроки(Отбор);
	к_УдалитьЭлементыПоМассиву(Коллекция,Массив);
	
КонецПроцедуры

// удаляет элементы коллекции по переданному массиву (ТЗ,ДЗ,ТЧ)
Процедура к_УдалитьЭлементыПоМассиву(Коллекция,Массив) Экспорт 
	
	Если Массив.Количество()=0 Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Для каждого Стр Из Массив Цикл
		
		Коллекция.Удалить(Стр);
		
	КонецЦикла;
	
КонецПроцедуры
  
#КонецОбласти

#Область Файлы

// разбивает имя файла на путь,имя и расширение
Функция ф_СтруктураФайла(Знач ПолноеИмя) Экспорт 
	// --- 
	
	СтруктураИмени = ст_Создать("Путь,Имя,Расширение");
	
	// сначала определяем, есть ли у файла путь
	// пробуем определить разделитель
	Разделитель = Неопределено;
	Если Найти(ПолноеИмя,"\") <> 0 Тогда
		
		Разделитель = "\";
		
	ИначеЕсли Найти(ПолноеИмя,"/") <> 0 Тогда 
		
		Разделитель = "/"; 
		
	КонецЕсли; 
	// --- 
	Если Разделитель=Неопределено Тогда
		
		// пути нет
		СтруктураИмени.Путь="";
		ИмяБезПути = ПолноеИмя;
		
		
	Иначе
		
		// определяем часть имени без пути
		ИмяБезПути = стр_ПоследняяСтрока(ПолноеИмя,Разделитель);
		СтруктураИмени.Путь = стр_Подстрока(ПолноеИмя,"Л",стр_Длина(ПолноеИмя)-стр_Длина(ИмяБезПути));
		
	КонецЕсли;  
	
	// --- 
	
	Строки = стр_РазбитьНаСтроки(ИмяБезПути,".");
	Если стр_ЧислоСтрок(Строки) =1 Тогда
		
		СтруктураИмени.Имя = Строки;
		СтруктураИмени.Расширение = "";
		
	Иначе
		
		СтруктураИмени.Расширение = стр_ПоследняяСтрока(Строки);
		СтруктураИмени.Имя = стр_Подстрока(ИмяБезПути,"Л",стр_Длина(ИмяБезПути)-стр_Длина(СтруктураИмени.Расширение)-1);
		
	КонецЕсли; 
	
	// --- 
	Возврат(СтруктураИмени);
	
	// --- 
КонецФункции

// test из test.txt
Функция ф_ИмяФайла(Знач ПолноеИмя) Экспорт 
	// --- 
	
	Возврат(ф_СтруктураФайла(ПолноеИмя).Имя);
	
	// --- 
КонецФункции

// расширение файла: txt из test.txt
Функция ф_РасширениеФайла(Знач ПолноеИмя) Экспорт 
	// --- 
	
	Возврат(ф_СтруктураФайла(ПолноеИмя).Расширение);	
	
	// --- 
КонецФункции

// возвращает короткое имя test.txt вместо C:\бла-бла\бла\test.txt
Функция ф_КороткоеИмяФайла(Знач ПолноеИмя) Экспорт 
	// --- 
	
	Возврат(ф_ИмяФайла(ПолноеИмя)+"."+ф_РасширениеФайла(ПолноеИмя));
	
	// --- 
КонецФункции

// возвращает разделитель в зависимости от типа системы (win/lin)
Функция ф_Разделитель() Экспорт 
	// --- 
	
	СИ = Новый СистемнаяИнформация;
	Тип = СИ.ТипПлатформы;
	
	Если Тип=ТипПлатформы.Windows_x86 ИЛИ Тип=ТипПлатформы.Windows_x86_64 Тогда
		
		Возврат("\");
		
	Иначе
		
		Возврат("/");
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// размер в человеческих единицах
Функция ф_ПриведенныйРазмер(Знач Размер) Экспорт 
	
	СписокЕдиниц = Новый СписокЗначений;
	СписокЕдиниц.Добавить("байт","Б");
	СписокЕдиниц.Добавить("килобайт","Кб");
	СписокЕдиниц.Добавить("мегабайт","Мб");
	СписокЕдиниц.Добавить("гигабайт","Гб");
	СписокЕдиниц.Добавить("терабайт","Тб");
	СписокЕдиниц.Добавить("петабайт","Пб");
	
	Разряд = 1;
	
	Пока 1 = 1 Цикл
		
		Результат = Размер/1024;
		Если Результат < 1024 Тогда
			СтрокаРазмера = Формат(Результат,"ЧЦ=10; ЧДЦ=1; ЧРГ=")+" "+СписокЕдиниц[Разряд-1].Представление;
			Возврат(СтрокаРазмера);
		Иначе
			Если Разряд = 6 Тогда
				СтрокаРазмера = Формат(Результат,"ЧЦ=10; ЧДЦ=1; ЧРГ=")+" "+СписокЕдиниц[Разряд-1].Представление;
				Возврат(СтрокаРазмера);
			Иначе
				Размер = Результат;
				Разряд = Разряд + 1;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
КонецФункции

#КонецОбласти

#Область НавигационныеСсылки

// обёртка
Функция нс_Получить(Ссылка,Внешняя=Ложь) Экспорт 
	// --- 
	
	Если Внешняя=Ложь Тогда
		
		Возврат(ПолучитьНавигационнуюСсылку(Ссылка));
		
	Иначе
		
		Возврат(ПолучитьНавигационнуюСсылкуИнформационнойБазы()+"#"+ПолучитьНавигационнуюСсылку(Ссылка));
		
	КонецЕсли; 	
	
	// --- 
КонецФункции

// обертка ссылки
Функция нс_Обернуть(Ссылка) Экспорт 
	// --- 
	
	Возврат(стр_Обернуть(нс_Получить(Ссылка),"{}"));
	
	// --- 
КонецФункции

// представление ссылки/ссылок
Функция нс_ПредставлениеСсылки(Ссылка) Экспорт 
	// --- 
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Ссылка);
	МассивПредставлений = ПолучитьПредставленияНавигационныхСсылок(МассивСсылок);
	Если МассивПредставлений <> Неопределено Тогда
		
		Возврат(к_ПервыйЭлемент(МассивПредставлений).Текст);
		
	Иначе
		
		Возврат("[...]");
		
	КонецЕсли; 
	
	// --- 
КонецФункции

#КонецОбласти

#Область Типы

// является ли тип ссылочным
Функция тип_Ссылочный(ПроверяемыйТип) Экспорт 
	// --- 
	
	Если ПроверяемыйТип = Неопределено Тогда
		
		Возврат(Ложь);
		
	ИначеЕсли ПроверяемыйТип = Тип("Строка") Тогда 
		
		 Возврат(Ложь);
		 
	ИначеЕсли ПроверяемыйТип = Тип("Число") Тогда 
		
		 Возврат(Ложь);
		 
	ИначеЕсли ПроверяемыйТип = Тип("Дата") Тогда 
		
		 Возврат(Ложь);
		 
	ИначеЕсли ПроверяемыйТип = Тип("Дата") Тогда 
		
		 Возврат(Ложь);	
	               		 
	Иначе
		 
		 Если Справочники.ТипВсеСсылки().СодержитТип(ПроверяемыйТип) Тогда
			 
			 Возврат(Истина);
			 
		 КонецЕсли;
		 
		  Если Документы.ТипВсеСсылки().СодержитТип(ПроверяемыйТип) Тогда
			 
			 Возврат(Истина);
			 
		 КонецЕсли;
		 
		  Если Перечисления.ТипВсеСсылки().СодержитТип(ПроверяемыйТип) Тогда
			 
			 Возврат(Истина);
			 
		 КонецЕсли;
		 
		  Если ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ПроверяемыйТип) Тогда
			 
			 Возврат(Истина);
			 
		 КонецЕсли;
		 
		  Если ПланыСчетов.ТипВсеСсылки().СодержитТип(ПроверяемыйТип) Тогда
			 
			 Возврат(Истина);
			 
		 КонецЕсли;
		 
		  Если ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ПроверяемыйТип) Тогда
			 
			 Возврат(Истина);
			 
		 КонецЕсли;
		 
	 КонецЕсли; 
	 
	 Возврат(Ложь);
	
	// --- 
КонецФункции

// возвращает тип реквизита объекта
Функция тип_ОпределитьТипРеквизита(Ссылка,ИмяРеквизита) Экспорт 
	// --- 
	
	МетаданныеСсылки = Ссылка.Метаданные();
	
	мдРеквизит = МетаданныеСсылки.Реквизиты.Найти(ИмяРеквизита);
	Если НЕ Неопределено=мдРеквизит Тогда 
		Возврат мдРеквизит.Тип;
	КонецЕсли;
	
	Для каждого Реквизит Из МетаданныеСсылки.СтандартныеРеквизиты Цикл
		
		Если Реквизит.Имя = ИмяРеквизита Тогда
			
			Возврат(Реквизит.Тип);
			
		КонецЕсли; 
		
	КонецЦикла; 
	//Для каждого Реквизит Из МетаданныеСсылки.Реквизиты Цикл
	//	
	//	Если Реквизит.Имя = ИмяРеквизита Тогда
	//		
	//		Возврат(Реквизит.Тип);
	//		
	//	КонецЕсли; 
	//	
	//КонецЦикла; 
	
	Возврат(Неопределено);
		
	// --- 
КонецФункции

#КонецОбласти

#Область Разное

Функция ОбъектБДСуществует(ТестоваяСсылка) Экспорт

    МД = Метаданные.НайтиПоТипу(ТипЗнч(ТестоваяСсылка));
    ИмяОбъекта = МД.Имя;
    ПолноеИмяОбъекта = МД.ПолноеИмя();

    Запрос = новый Запрос();
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   ИСТИНА КАК СсылкаБДСуществует
    |ИЗ
    |   " + ПолноеИмяОбъекта + " КАК " + ИмяОбъекта + "
    |ГДЕ
    |   " + ИмяОбъекта + ".Ссылка = &Cсылка";
    Запрос.УстановитьПараметр("Cсылка", ТестоваяСсылка);
    РезультатЗапроса = Запрос.Выполнить();

    Возврат Не РезультатЗапроса.Пустой();

КонецФункции

Функция НаборЗаписейПоРегистратору(Регистр,Регистратор) Экспорт 
	// --- 
	
	Набор = Регистр.СоздатьНаборЗаписей();
	УстановитьОтбор(Набор.Отбор,"Регистратор",Регистратор);
	Возврат(Набор);
	
	// --- 
КонецФункции

Функция ВыполнитьЗапрос(Запрос, ПараметрыЗапроса = Неопределено, ПерваяСтрока=Ложь, РеквизитПервойСтроки=Неопределено,ВозвращаемоеЗначениеНезаполненного=Неопределено) Экспорт 
	
	Если (ТипЗнч(Запрос)=Тип("Строка")) Тогда
		
		ЗапросОбъект = Новый Запрос(Запрос);
		
	Иначе
		
		ЗапросОбъект = Запрос;
		
	КонецЕсли; 
	
	Если (ПараметрыЗапроса <> Неопределено) Тогда
		
		Для каждого КлючЗначение Из ПараметрыЗапроса Цикл
			
			ЗапросОбъект.УстановитьПараметр(КлючЗначение.Ключ, ПараметрыЗапроса[КлючЗначение.Ключ]); 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	ТЗ = ЗапросОбъект.Выполнить().Выгрузить();
	Если (НЕ ПерваяСтрока) Тогда
		
		Возврат(ТЗ);
		
	Иначе
		
		СтрокаРезультата = к_ПервыйЭлемент(ТЗ);
		Если (СтрокаРезультата = Неопределено) Тогда
			
			Возврат(ВозвращаемоеЗначениеНезаполненного);
			
		Иначе
			
			Если (РеквизитПервойСтроки = Неопределено) Тогда
				
				Возврат(СтрокаРезультата);
				
			Иначе
				
				ЗначениеРеквизита = СтрокаРезультата[РеквизитПервойСтроки];
				// --- 
				Если (ВозвращаемоеЗначениеНезаполненного <> Неопределено) Тогда
					
					Если (НЕ ЗначениеЗаполнено(ЗначениеРеквизита)) Тогда
						
						Возврат(ВозвращаемоеЗначениеНезаполненного);
						
					КонецЕсли; 
					
				КонецЕсли; 
				// --- 
				Возврат(ЗначениеРеквизита);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецФункции
 

// ---------------------------------------------------------------------------- 

// ОБЩИЕ ДЛЯ ПОЛЕЙ

// вспомогательная
Функция _СтруктураПоля(Поле)
	// --- 
	
	// определяем, задано ли представление поля (то, что до :)
    Если Найти(Поле,":") <> 0 Тогда
		
		Ответ = ст_СоздатьИзМаркированнойСтроки(Поле,":","Ключ,Адрес,Заполнение");
		Ответ.Заполнение = (ЗначениеЗаполнено(Ответ.Адрес));
		
	Иначе
		
		Ответ = ст_Создать("Ключ,Адрес,Заполнение");
		Ответ.Ключ = Поле;
		Ответ.Адрес = Поле;
		Ответ.Заполнение = Истина;
		
	КонецЕсли; 
	
	Возврат(Ответ);
	
	// --- 
КонецФункции

// массив структур полей
Функция ПоляПоСтроке(ИменаПолей)
	// --- 
	
	МассивИменПолей = м_СоздатьИзСтроки(СтрЗаменить(ИменаПолей,Символы.ПС,""));
	МассивПолей = Новый Массив;
	Для каждого ИмяПоля Из МассивИменПолей Цикл
		
		МассивПолей.Добавить(_СтруктураПоля(ИмяПоля));
		
	КонецЦикла;
	// --- 
	Возврат(МассивПолей);
	
	// --- 
КонецФункции
  
#КонецОбласти
 