#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Лист согласования";
	СтруктураОписания.Описание 					= "Лист согласования";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.10.10";
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления
	
	Возврат СтруктураОписания;
	
КонецФункции

//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления

Функция Регистрация(Ссылка) Экспорт 
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить("Справочник.CW_ДоговорыПоГрузоперевозкам");
	МассивМетаданных.Добавить("Справочник.CW_ПриложенияКДоговорам");   
	МассивМетаданных.Добавить("Документ.CW_РасходыПоГрузоперевозке");   
	
	Возврат _ПО.ОбновитьРегистрациюПечатнойФормы(Ссылка,"Лист согласования",МассивМетаданных);
	
КонецФункции

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	СостояниеОбъекта = РегистрыСведений.CW_СостояниеСогласованияОбъекта.ПолучитьСостояниеОбъекта(СсылкаНаОбъект); 
	Если СостояниеОбъекта = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	мНедоступныеСтаусты = Новый Массив;
	мНедоступныеСтаусты.Добавить(ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Черновик"));
	мНедоступныеСтаусты.Добавить(ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Прервано"));
	мНедоступныеСтаусты.Добавить(ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.ПустаяСсылка"));
	
	Возврат ?(мНедоступныеСтаусты.Найти(СостояниеОбъекта) = Неопределено, Истина, Ложь);
	
КонецФункции

Функция ИспользованиеВКонтексте(КонтекстВызова) Экспорт 
	
	Возврат	Ложь;
	
КонецФункции

Функция ПечатнаяФорма(СтруктураПараметров = Неопределено) Экспорт
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = Новый Структура;
	КонецЕсли; 
	
	ПараметрыПечаты = Новый Структура("Представление,Параметры,ПечатнаяФорма");

	СтруктураПараметров.Вставить("ДляРассылки",		Ложь);
	СтруктураПараметров.Вставить("ПодписьИПечать",	Ложь);
	СтруктураПараметров.Вставить("Количество",		1);
	СтруктураПараметров.Вставить("Печать",			Истина);
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		ПредставлениеОбъекта = "Договора №"+СсылкаНаОбъект.НомерДоговора+" от "+Формат(СсылкаНаОбъект.ДатаДоговора, "ДЛФ=D");
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
		ПредставлениеОбъекта = "Приложения №"+СсылкаНаОбъект.НомерДокумента+" от "+Формат(СсылкаНаОбъект.ДатаДокумента, "ДЛФ=D");
	Иначе
		ПредставлениеОбъекта = "";
	КонецЕсли;
	
	ПараметрыПечаты.Параметры = СтруктураПараметров;
	
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	СтруктураПараметров.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	СтруктураПараметров.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП("Лист согласования " + ПредставлениеОбъекта));
	
	ПараметрыПроцедуры = Новый Структура;
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		ПараметрыПроцедуры.Вставить("НомерДокумента", СсылкаНаОбъект.НомерДоговора);
		ПараметрыПроцедуры.Вставить("ДатаДокумента",  СсылкаНаОбъект.ДатаДоговора);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
		ПараметрыПроцедуры.Вставить("НомерДокумента", СсылкаНаОбъект.НомерДокумента);
		ПараметрыПроцедуры.Вставить("ДатаДокумента",  СсылкаНаОбъект.ДатаДокумента);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		ПараметрыПроцедуры.Вставить("НомерДокумента", СсылкаНаОбъект.Номер);
		ПараметрыПроцедуры.Вставить("ДатаДокумента",  СсылкаНаОбъект.Дата);
	КонецЕсли;
	
	ПараметрыПечаты.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы

	
	// формируем печатную форму
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	Макет = ПолучитьМакет("CW_ПФ_MXL_ЛистСогласования");
	
	//Шапка печатной фомры
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	
	ДанныеШапки =	ПолучитьДанныеШапки(СсылкаНаОбъект);
	ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры, ДанныеШапки);
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабличныйДокумент.Вывести(ОбластьШапка);
	//Шапка печатной фомры
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МаршрутСогласования.Ссылка КАК ЭтапСогласования,
	               |	ГруппыСогласования.Пользователь.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ГруппыСогласования.Должность КАК Должность,
	               |	МаршрутСогласования.ПлановаяДата КАК ПлановаяДата,
	               |	МаршрутСогласования.ДатаСобытия КАК ДатаСобытия,
	               |	МаршрутСогласования.Событие КАК Событие,
	               |	МаршрутСогласования.Замечания КАК Комментарий
	               |ИЗ
	               |	Справочник.CW_ЭтапыСогласования.МаршрутСогласования КАК МаршрутСогласования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CW_ГруппыСогласования.СписокСотрудников КАК ГруппыСогласования
	               |		ПО МаршрутСогласования.ГруппаСогласования = ГруппыСогласования.Ссылка
	               |			И МаршрутСогласования.Пользователь = ГруппыСогласования.Пользователь
	               |ГДЕ
	               |	МаршрутСогласования.Ссылка.ОбъектСогласования = &ОбъектСогласования
	               |	И МаршрутСогласования.Событие <> ЗНАЧЕНИЕ(Перечисление.CW_СобытияСогласования.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаСобытия
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ОбъектСогласования", СсылкаНаОбъект);
	
	РезультатЗапрсоа = Запрос.Выполнить();
	Выборка = РезультатЗапрсоа.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
		
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ПараметрыПечаты.ПечатнаяФорма = ТабличныйДокумент;
	
	Возврат ПараметрыПечаты;
	
КонецФункции // Печать

Функция ПолучитьДанныеШапки(Знач ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		
		ПредставлениеОбъектаСогласования = "Договор №"+ПараметрКоманды.НомерДоговора+" от "+Формат(ПараметрКоманды.ДатаДоговора, "ДЛФ=D");
		НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(ПараметрКоманды.Организация, 	ТекущаяДата());
		НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(ПараметрКоманды.Владелец, 		ТекущаяДата());
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_ПриложенияКДоговорам") Тогда
		
		ДоговорВладелец = ПараметрКоманды.Договор;
		
		МассивЭлементов = Новый Массив;
		ПолучитьИерархию(ПараметрКоманды, МассивЭлементов);	

		МассивПредставлений = Новый Массив;
		Для Каждого ЭлементМассива из МассивЭлементов Цикл
			ВидДокумента = ?(ЗначениеЗаполнено(ЭлементМассива.ВидДокумента), ЭлементМассива.ВидДокумента, "Приложение");
			МассивПредставлений.Добавить(СокрЛП(ВидДокумента) + " №"+ЭлементМассива.НомерДокумента+" от "+Формат(ЭлементМассива.ДатаДокумента, "ДЛФ=D"));
		КонецЦикла;     
		МассивПредставлений.Добавить("договору №"+ДоговорВладелец.НомерДоговора+" от "+Формат(ДоговорВладелец.ДатаДоговора, "ДЛФ=D"));
	
		ПредставлениеОбъектаСогласования = СтрСоединить(МассивПредставлений, Символы.ПС +"к ");
		
		НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(ДоговорВладелец.Организация, 	ТекущаяДата());
		НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(ДоговорВладелец.Владелец, 		ТекущаяДата());  
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		ПредставлениеОбъектаСогласования = ""+ПараметрКоманды.ПредставлениеДокумента;
		НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(ПараметрКоманды.Организация,ПараметрКоманды.Дата);
		НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(ПараметрКоманды.Контрагент,ПараметрКоманды.Дата);
		
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ПредставлениеОбъектаСогласования", 	ПредставлениеОбъектаСогласования);
	СтруктураДанных.Вставить("ПредставлениеОрганизации", 			НаименованияОрганизации.НаименованиеДляПечатныхФорм);
	СтруктураДанных.Вставить("ПредставлениеКлиента", 				НаименованияКонтрагента.НаименованиеДляПечатныхФорм);
	
	Возврат СтруктураДанных;
		
КонецФункции  

Процедура ПолучитьИерархию(ПараметрКоманды, МассивЭлементов) 
	
	МассивЭлементов.Добавить(ПараметрКоманды);  
	
	Если ЗначениеЗаполнено(ПараметрКоманды.Родитель) Тогда
		ПолучитьИерархию(ПараметрКоманды.Родитель, МассивЭлементов);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли