
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.ИнициаторСогласования = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;   
	
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь);
	
	Если ЭтоПолноправныйПользователь = ЛОЖЬ 
		И Запись.ИнициаторСогласования <> ПараметрыСеанса.ТекущийПользователь Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли; 
	
	Элементы.ИнициаторСогласования.Доступность = ЭтоПолноправныйПользователь;
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(Запись.ИнициаторСогласования);
	
	мИдентификаторыОбъектов = РегистрыСведений.CW_ДоступноИнициацияСогласования.ПолучитьДоступныеОбъектыСогласования(ГруппаПользователя);
	Для Каждого ИдентификаторОбъекта из мИдентификаторыОбъектов Цикл
		Элементы.ИдентификаторОбъектаМетаданных.СписокВыбора.Добавить(ИдентификаторОбъекта);
	КонецЦикла;
	
КонецПроцедуры

