
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ДатаНовости = ТекущаяДата();  
		СписокПользователей.Добавить(ПредопределенноеЗначение("Справочник.CW_ВебПользователиЛКК.ПустаяСсылка"), "<Все пользователи>");  
	КонецЕсли;                               
	
	УстановитьДоступностьЭлементов();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)   
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда  
		Поле = ?(Язык = 0, "Тема_RU", "Тема_EN");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена тема!",,Поле, "Объект", Отказ);
	КонецЕсли;
	
	ХранилищеСодержания = Новый Структура;
	ХранилищеСодержания.Вставить("ru", ТекстHTML_RU);
	ХранилищеСодержания.Вставить("en", ТекстHTML_EN);   
	
	ТекущийОбъект.ХранилищеСодержания = Новый ХранилищеЗначения(ХранилищеСодержания);
	
	ТекущийОбъект.СписокПользователей.Очистить();
	Для Каждого ЭлементСписка из СписокПользователей Цикл
		НоваяСтрока = ТекущийОбъект.СписокПользователей.Добавить();
		НоваяСтрока.ПользовательЛКК = ЭлементСписка.Значение;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ХранилищеСодержания = ТекущийОбъект.ХранилищеСодержания.Получить();
	
	ТекстHTML_RU = ХранилищеСодержания.ru;
	ТекстHTML_EN = ХранилищеСодержания.en;

	//Пользователи   
	Для Каждого СтрокаТаблицы из ТекущийОбъект.СписокПользователей Цикл
		ПредставлениеПользователя = СокрЛП(СтрокаТаблицы.ПользовательЛКК);	
		Если СтрокаТаблицы.ПользовательЛКК.Пустая() Тогда
			ПредставлениеПользователя = "<Все пользователи>";	
		КонецЕсли;
		СписокПользователей.Добавить(СтрокаТаблицы.ПользовательЛКК, ПредставлениеПользователя);
	КонецЦикла;
	//Пользователи 	

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	ЛичныйКабинетУправлениеПрофилями = CW_ПраваДоступа.ПравоДоступно("ЛичныйКабинетУправлениеПрофилями"); 
	ЭтотОбъект.ТолькоПросмотр 					= НЕ ЛичныйКабинетУправлениеПрофилями;				
	Элементы.СписокПользователей.ТолькоПросмотр = НЕ ЛичныйКабинетУправлениеПрофилями;  
	Элементы.ТекстHTML_RU.ТолькоПросмотр 		= НЕ ЛичныйКабинетУправлениеПрофилями;  
	Элементы.ТекстHTML_EN.ТолькоПросмотр		= НЕ ЛичныйКабинетУправлениеПрофилями;  
	Элементы.ПользователиВсе.Доступность 		= ЛичныйКабинетУправлениеПрофилями;  
	Элементы.Язык.Доступность 					= ЛичныйКабинетУправлениеПрофилями;

КонецПроцедуры 

&НаСервере
Процедура 	УстановитьВидимостьЭлементов()
	
	Элементы.Тема_RU.Видимость 				= Язык = 0;
	Элементы.ГруппаСодержание_RU.Видимость 	= Язык = 0;
	Элементы.Тема_EN.Видимость 				= Язык = 1;
	Элементы.ГруппаСодержание_EN.Видимость 	= Язык = 1;

КонецПроцедуры

&НаКлиенте
Процедура ПользователиВсе(Команда)
	ПользователиВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПользователиВсеНаСервере()
	
	Если СписокПользователей.НайтиПоЗначению(ПредопределенноеЗначение("Справочник.CW_ВебПользователиЛКК.ПустаяСсылка")) = Неопределено Тогда
		СписокПользователей.Добавить(ПредопределенноеЗначение("Справочник.CW_ВебПользователиЛКК.ПустаяСсылка"), "<Все пользователи>");  
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЯзыкПриИзменении(Элемент)

	УстановитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Наименование = ?(ПустаяСтрока(Объект.Тема_RU), Объект.Тема_EN, Объект.Тема_RU); 

КонецПроцедуры

