#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// ---------------------------------------------------------------------------- 

// при вводе на основании расходов
Функция Услуги_СформироватьПоДокументуРасходов(Документ, Договор, ПриложениеКДоговору, ПорядокОтраженияЗатрат,ПорядокОтраженияДоходов) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,
	               |	CW_РасходыПоГрузоперевозкеУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Номенклатура КАК Номенклатура,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Представление КАК Представление,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Количество КАК Количество,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Цена КАК Цена,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Сумма КАК Сумма,
	               |	CW_РасходыПоГрузоперевозкеУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	CW_РасходыПоГрузоперевозкеУслуги.НДС КАК НДС,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Всего КАК Всего,
	               |	&ПорядокОтраженияДоходов КАК ПорядокОтражения,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Покупатель КАК Покупатель,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ВводОстатков КАК ВводОстатков,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Счет КАК Счет,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ОЗ_Всего КАК ОЗ_Всего,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ОЗ_НДС КАК ОЗ_НДС,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ОЗ_Сумма КАК ОЗ_Сумма,
	               |	CW_РасходыПоГрузоперевозкеУслуги.СчетЗадолженности КАК СчетЗадолженности,
	               |	CW_РасходыПоГрузоперевозкеУслуги.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Подразделение КАК Подразделение,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Представление_ДоКорректировки КАК Представление_ДоКорректировки,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Количество_ДоКорректировки КАК Количество_ДоКорректировки,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Цена_ДоКорректировки КАК Цена_ДоКорректировки,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Сумма_ДоКорректировки КАК Сумма_ДоКорректировки,
	               |	CW_РасходыПоГрузоперевозкеУслуги.СтавкаНДС_ДоКорректировки КАК СтавкаНДС_ДоКорректировки,
	               |	CW_РасходыПоГрузоперевозкеУслуги.НДС_ДоКорректировки КАК НДС_ДоКорректировки,
				   |	CW_РасходыПоГрузоперевозкеУслуги.Всего_ДоКорректировки КАК Всего_ДоКорректировки,
				   |	CW_РасходыПоГрузоперевозкеУслуги.ПриложениеКДоговору КАК ПриложениеКДоговору,
				   |	CW_РасходыПоГрузоперевозкеУслуги.ЭтоДобавленнаяСтрока КАК ЭтоДобавленнаяСтрока,
				   |	0 КАК Цена_Рег,
				   |	ЕСТЬNULL(CW_РасходыПоГрузоперевозкам.Сумма, 0) КАК Сумма_Рег,
				   |	ЕСТЬNULL(CW_РасходыПоГрузоперевозкам.НДС, 0) КАК НДС_Рег,
				   |	ЕСТЬNULL(CW_РасходыПоГрузоперевозкам.Всего, 0) КАК Всего_Рег,
				   |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка КАК ДокументРасходов
				   |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
	               |		ПО CW_РасходыПоГрузоперевозкеУслуги.Ссылка = CW_РасходыПоГрузоперевозкам.Регистратор
	               |			И CW_РасходыПоГрузоперевозкеУслуги.НомерСтроки = CW_РасходыПоГрузоперевозкам.НомерСтроки
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка
	               |	И CW_РасходыПоГрузоперевозкеУслуги.ПорядокОтражения = &ПорядокОтраженияЗатрат
	               |	И CW_РасходыПоГрузоперевозкеУслуги.ДоговорПокупателя = &ДоговорПокупателя
	               |	И CW_РасходыПоГрузоперевозкеУслуги.ПриложениеКДоговору = &ПриложениеКДоговору";
	
	Запрос.УстановитьПараметр("ПорядокОтраженияЗатрат",	ПорядокОтраженияЗатрат);
	Запрос.УстановитьПараметр("ПорядокОтраженияДоходов",ПорядокОтраженияДоходов);
	Запрос.УстановитьПараметр("ДоговорПокупателя",		Договор);
	Запрос.УстановитьПараметр("ПриложениеКДоговору",	ПриложениеКДоговору);
	Запрос.УстановитьПараметр("Ссылка",					Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВремТЗ = РезультатЗапроса.Выгрузить();
	
	Возврат ВремТЗ;
	
КонецФункции

// таблица по неперевыставленным
Функция Услуги_СформироватьПоНеперевыставленным(Дата,Договор) Экспорт 
	// --- 
	
	// --- 
	// возвращает РУБЛИ и пустую валюту
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ПеревыставлениеОстатки.Грузоперевозка,
	               |	CW_ПеревыставлениеОстатки.Номенклатура,
	               |	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СтатьяЗатрат,
	               |	ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление) КАК ПорядокОтражения,
	               |	CW_ПеревыставлениеОстатки.ДокументРасходов,
	               |	CW_ПеревыставлениеОстатки.ДокументРасходов.Контрагент КАК Поставщик,
	               |	CW_ПеревыставлениеОстатки.ДокументРасходов.Продавец КАК Продавец,
	               |	CW_ПеревыставлениеОстатки.СтавкаНДС,
	               |	CW_ПеревыставлениеОстатки.КоличествоОстаток КАК Количество,
	               |	0 КАК Цена,
	               |	0 КАК Сумма,
	               |	0 КАК НДС,
	               |	0 КАК Всего,
	               |	0 КАК Цена_Рег,
	               |	CW_ПеревыставлениеОстатки.СуммаОстаток КАК Сумма_Рег,
	               |	CW_ПеревыставлениеОстатки.НДСОстаток КАК НДС_Рег,
	               |	CW_ПеревыставлениеОстатки.ВсегоОстаток КАК Всего_Рег
	               |ИЗ
	               |	РегистрНакопления.CW_Перевыставление.Остатки(
	               |			&Период,
	               |			Контрагент = &Контрагент
	               |				И Договор = &Договор) КАК CW_ПеревыставлениеОстатки";
	Запрос.УстановитьПараметр("Период", Новый Граница(Дата,ВидГраницы.Исключая));
	_сф.ст_ДобавитьСвойства(Запрос.Параметры,"Договор:Ссылка,Контрагент:Владелец",Договор);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Колонки.Добавить("Представление");
	// --- 
	ТекстЗапроса = "ВЫБРАТЬ
	|	CW_СтатьиЗатратНоменклатуры.Номенклатура,
	|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры";
	СоответствиеСтатейЗатрат = _сф.со_Создать("Номенклатура","СтатьяЗатрат",_сф.ВыполнитьЗапрос(ТекстЗапроса));
	ОсновнаяСтатьяЗатрат = CW_Настройки.ПараметрУчетнойПолитики(Дата, Договор.Организация, "ОсновнаяСтатьяЗатрат");
	
	// --- 
	Для каждого Стр Из ТЗ Цикл
		
		Стр.Цена_Рег = _сф.БезопасноРазделить(Стр.Сумма_Рег,Стр.Количество);
		Стр.Цена = 0;
		// --- 
		Стр.СтатьяЗатрат   = _сф.со_Получить(СоответствиеСтатейЗатрат,Стр.Номенклатура,ОсновнаяСтатьяЗатрат);
		
	КонецЦикла; 
	// --- 
	Возврат(ТЗ);	 
	
	// --- 
КонецФункции

// таблица по неперевыставленным по ставкам
Функция Услуги_СформироватьПоНеперевыставленнымПоСтавкам(Дата,Договор) Экспорт 
	
	// --- 
	// возвращает РУБЛИ, но в валютных колонках, соответственно требует пересчёта в валюту документа !!!
	// --- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ПеревыставлениеПоСтавкамОстатки.Грузоперевозка,
	               |	CW_ПеревыставлениеПоСтавкамОстатки.Номенклатура,
	               |	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка) КАК СтатьяЗатрат,
	               |	ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам) КАК ПорядокОтражения,
	               |	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Поставщик,
	               |	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Продавец,
	               |	CW_ПеревыставлениеПоСтавкамОстатки.СтавкаНДС,
	               |	0 КАК Количество,
	               |	0 КАК Цена,
	               |	0 КАК Сумма,
	               |	0 КАК НДС,
	               |	0 КАК Всего,
	               |	0 КАК Цена_Рег,
	               |	CW_ПеревыставлениеПоСтавкамОстатки.СуммаОстаток КАК Сумма_Рег,
	               |	CW_ПеревыставлениеПоСтавкамОстатки.НДСОстаток КАК НДС_Рег,
	               |	CW_ПеревыставлениеПоСтавкамОстатки.ВсегоОстаток КАК Всего_Рег
	               |ИЗ
	               |	РегистрНакопления.CW_ПеревыставлениеПоСтавкам.Остатки(
	               |			&Период,
	               |			Контрагент = &Контрагент
	               |				И Договор = &Договор) КАК CW_ПеревыставлениеПоСтавкамОстатки
	               |ГДЕ
	               |	CW_ПеревыставлениеПоСтавкамОстатки.ВсегоОстаток > 0";
	Запрос.УстановитьПараметр("Период", Новый Граница(Дата,ВидГраницы.Исключая));
	_сф.ст_ДобавитьСвойства(Запрос.Параметры,"Договор:Ссылка,Контрагент:Владелец",Договор);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Колонки.Добавить("Представление");
	// --- 
	ТекстЗапроса = "ВЫБРАТЬ
	|	CW_СтатьиЗатратНоменклатуры.Номенклатура,
	|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры";
	СоответствиеСтатейЗатрат = _сф.со_Создать("Номенклатура","СтатьяЗатрат",_сф.ВыполнитьЗапрос(ТекстЗапроса));
	ОсновнаяСтатьяЗатрат = CW_Настройки.ПараметрУчетнойПолитики(Дата, Договор.Организация, "ОсновнаяСтатьяЗатрат");
	// --- 
	Для каждого Стр Из ТЗ Цикл
		
		Стр.Количество = 1;
		Стр.Цена_Рег = _сф.БезопасноРазделить(Стр.Сумма_Рег,Стр.Количество);
		Стр.Цена = 0;
		// --- 
		Стр.СтатьяЗатрат   = _сф.со_Получить(СоответствиеСтатейЗатрат,Стр.Номенклатура,ОсновнаяСтатьяЗатрат);
		
	КонецЦикла; 
	// --- 
	Возврат(ТЗ);	
	
КонецФункции

// --- 

// при выставлении при перевыставлении
Процедура Услуги_ДобавитьВознаграждение(ТаблицаУслуг,Договор,ПриложениеКДоговору, ПараметрыДоговора,Дата=Неопределено) Экспорт 
	// --- 
		
	НоменклатураВознаграждения = ПараметрыДоговора.Номенклатура;
	// --- 
	
	ТЗДляСвертки = _сф.т_Создать("Грузоперевозка,ДокументРасходов,Дата:ДокументРасходов.Дата",ТаблицаУслуг);
	ТЗДляСвертки.Свернуть("Грузоперевозка,ДокументРасходов,Дата");
	ТЗДляСвертки.Сортировать("Грузоперевозка Возр,Дата Возр");
	// --- 
	КопияУслуг = ТаблицаУслуг.Скопировать();
	
	// --- 
	ТекстЗапроса = "ВЫБРАТЬ
	|	CW_СтатьиЗатратНоменклатуры.Номенклатура,
	|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры";
	СоответствиеСтатейЗатрат = _сф.со_Создать("Номенклатура","СтатьяЗатрат",_сф.ВыполнитьЗапрос(ТекстЗапроса));
	ОсновнаяСтатьяЗатрат = CW_Настройки.ПараметрУчетнойПолитики(Дата, Договор.Организация, "ОсновнаяСтатьяЗатрат");
	// --- 
	
	// ПРОЦЕНТ - НА ВХОДЕ ВАЛЮТА ДОГОВОРА И РУБЛИ !!!
	Если ПараметрыДоговора.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ПроцентОтСуммы Тогда 
	
		Для каждого СтрокаСвертки Из ТЗДляСвертки Цикл
			
			Отбор = _сф.ст_Создать("Грузоперевозка,ДокументРасходов",СтрокаСвертки);
			УслугиПоГрузоперевозке = КопияУслуг.Скопировать(Отбор);
			БазаВознаграждения = УслугиПоГрузоперевозке.Итог("Всего_Рег");
			ВалютнаяБазаВознаграждения = УслугиПоГрузоперевозке.Итог("Всего");
			// --- 
			Нстр = ТаблицаУслуг.Добавить();
			// ----------------------------------------------------------------------------  
			Нстр.Грузоперевозка   = СтрокаСвертки.Грузоперевозка;
			Нстр.Номенклатура     = НоменклатураВознаграждения;
			Нстр.Представление    = НоменклатураВознаграждения.НаименованиеПолное + " " + СтрокаСвертки.Грузоперевозка.CW_Представление;
			Нстр.СтатьяЗатрат     = _сф.со_Получить(СоответствиеСтатейЗатрат,Нстр.Номенклатура,ОсновнаяСтатьяЗатрат);
			Нстр.ДокументРасходов = СтрокаСвертки.ДокументРасходов;
			Нстр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
			Нстр.Количество       = 1;
			Нстр.Всего       	  = ВалютнаяБазаВознаграждения*ПараметрыДоговора.РазмерАгентскогоВознаграждения/100;
			Нстр.СтавкаНДС        = ПараметрыДоговора.СтавкаНДС;
			Ставка				  = CW_Финансы.ПолучитьСтавкуНДС(Нстр.СтавкаНДС)/100;
			Нстр.НДС 	          = Нстр.Всего * Ставка/(1+Ставка);
			Нстр.Сумма            = Нстр.Всего - Нстр.НДС;
			Нстр.Цена             = _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
			Нстр.База	          = БазаВознаграждения;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	// ФИКСИРОВАННАЯ СУММА - НА ВХОДЕ ВАЛЮТА ДОГОВОРА
	Если ПараметрыДоговора.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ФиксированнаяСумма Тогда
		
		// формируем массив контейнеров, по которым необходимо проверить выставление вознаграждения
		ТЗК = ТаблицаУслуг.Скопировать(_сф.ст_Отбор("ПорядокОтражения",Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление),"Грузоперевозка"); 
		ТЗК.Свернуть("Грузоперевозка");
		МассивКонтейнеровДляПроверки = ТЗК.ВыгрузитьКолонку("Грузоперевозка");
		// --- 
		
		з = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ВознаграждениеПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
		|	CW_ВознаграждениеПоГрузоперевозкам.Всего_ВалютаОборот КАК ВсегоВалОборот
		|ИЗ
		|	РегистрНакопления.CW_ВознаграждениеПоГрузоперевозкам.Обороты(
		|			,
		|			&Дата2,
		|			,
		|			Контрагент = &Контрагент
		|				И Договор = &Договор
		|				И ПриложениеКДоговору = &ПриложениеКДоговору
		|				И Грузоперевозка В (&Грузоперевозки)) КАК CW_ВознаграждениеПоГрузоперевозкам"
		);
		з.УстановитьПараметр("Дата2", Новый Граница(Дата, ВидГраницы.Исключая));
		з.УстановитьПараметр("Контрагент", Договор.Владелец);
		з.УстановитьПараметр("Договор", Договор);
		з.УстановитьПараметр("ПриложениеКДоговору", ПриложениеКДоговору);
		з.УстановитьПараметр("Грузоперевозки",МассивКонтейнеровДляПроверки);
		// --- 
		РанееНачисленноеВознаграждение = з.Выполнить().Выгрузить();
		ТЗВ = РанееНачисленноеВознаграждение.Скопировать(,"Грузоперевозка");
		ТЗВ.Свернуть("Грузоперевозка");
		МассивКонтейнеровСВознаграждением = ТЗВ.ВыгрузитьКолонку("Грузоперевозка");
		
		// --- 
		
		Для каждого Стр Из МассивКонтейнеровДляПроверки Цикл
			
			Если Стр.Пустая() Тогда
				
				Продолжить;
				
			КонецЕсли; 
			
			Если МассивКонтейнеровСВознаграждением.Найти(Стр) = Неопределено Тогда
				
				БазаВознаграждения = 0;
				СуммаВознаграждения = ПараметрыДоговора.РазмерАгентскогоВознаграждения;
				// --- 
				
				// добавляем
				Нстр = ТаблицаУслуг.Добавить();
				// ---------------------------------------------------------------------------- 
				Нстр.Грузоперевозка		= Стр;
				Нстр.Номенклатура		= НоменклатураВознаграждения;
				Нстр.Представление		= НоменклатураВознаграждения.НаименованиеПолное + " " + Стр.CW_Представление;
				Нстр.СтатьяЗатрат		= _сф.со_Получить(СоответствиеСтатейЗатрат,Нстр.Номенклатура,ОсновнаяСтатьяЗатрат);
				Нстр.ДокументРасходов 	= Неопределено;
				Нстр.ПорядокОтражения  	= Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
				Нстр.Количество			= 1;
				Нстр.СтавкаНДС 			= ПараметрыДоговора.СтавкаНДС;
				Нстр.База	  			= БазаВознаграждения;
				// --- 
				Ставка					= CW_Финансы.ПолучитьСтавкуНДС(Нстр.СтавкаНДС)/100;
				Нстр.Всего				= СуммаВознаграждения;
				Нстр.НДС				= Нстр.Всего*Ставка/(1+Ставка);
				Нстр.Сумма            	= Нстр.Всего - Нстр.НДС;
				Нстр.Цена				= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// при выставлении отдельным документом
Функция Услуги_СформироватьВознаграждение(Дата,Договор,ПриложениеКДоговору, ПараметрыДоговора) Экспорт 
	
	// пустая ТЗ услуг
	ТаблицаУслуг = Документы.CW_ДоходыПоГрузоперевозке.ПустаяСсылка().Услуги.ВыгрузитьКолонки();
	// --- 
	НоменклатураВознаграждения = ПараметрыДоговора.Номенклатура;
	
	ВалютаРегламентированногоУчета 	= CW_Настройки.ВалютаРегламентированногоУчета();
	ВалютаДоговора 					= Договор.ВалютаДоговора;
	ТребуетсяПересчетВВалюту 		= ВалютаРегламентированногоУчета <> ВалютаДоговора;
	
	Если  ТребуетсяПересчетВВалюту Тогда
		КурсВалютыДоговора= CW_Финансы.ПолучитьКурсВалюты(ВалютаДоговора,Дата);
	КонецЕсли;
	
	// --- 
	ТекстЗапроса = "ВЫБРАТЬ
	|	CW_СтатьиЗатратНоменклатуры.Номенклатура,
	|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры";
	СоответствиеСтатейЗатрат = _сф.со_Создать("Номенклатура","СтатьяЗатрат",_сф.ВыполнитьЗапрос(ТекстЗапроса));
	ОсновнаяСтатьяЗатрат = CW_Настройки.ПараметрУчетнойПолитики(Дата, Договор.Организация, "ОсновнаяСтатьяЗатрат");
	// --- 
	
	// --- 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ПеревыставлениеОбороты.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ПеревыставлениеОбороты.Контрагент КАК Контрагент,
	               |	CW_ПеревыставлениеОбороты.Договор КАК Договор,
	               |	CW_ПеревыставлениеОбороты.ДокументРасходов КАК ДокументРасходов,
	               |	СУММА(ЕСТЬNULL(CW_ПеревыставлениеОбороты.ВсегоОборот, 0)) КАК отладкаВсегоРубОборот,
	               |	СУММА(ЕСТЬNULL(CW_ПеревыставлениеОбороты.ВсегоПриход, 0)) КАК отладкаВсегоРубПриход,
	               |	СУММА(ЕСТЬNULL(CW_ПеревыставлениеОбороты.ВсегоРасход, 0)) КАК отладкаВсегоРубРасход,
	               |	СУММА(ЕСТЬNULL(CW_ВознаграждениеПоГрузоперевозкамОбороты.БазаОборот, 0)) КАК отладкаБазаРубОборот,
	               |	СУММА(ЕСТЬNULL(CW_ПеревыставлениеОбороты.ВсегоРасход, 0) - ЕСТЬNULL(CW_ВознаграждениеПоГрузоперевозкамОбороты.БазаОборот, 0)) КАК СуммаВсегоРасходов,
	               |	СУММА(0) КАК Сумма,
	               |	СУММА(0) КАК Количество,
	               |	СУММА(0) КАК Цена
	               |ИЗ
	               |	РегистрНакопления.CW_Перевыставление.Обороты(
	               |			&Дата1,
	               |			&Дата2,
	               |			,
	               |			Контрагент = &Контрагент
	               |				И Договор = &Договор
	               |				И ПриложениеКДоговору = &ПриложениеКДоговору) КАК CW_ПеревыставлениеОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.CW_ВознаграждениеПоГрузоперевозкам.Обороты(
	               |				&Дата1,
	               |				&Дата2,
	               |				,
	               |				Контрагент = &Контрагент
	               |					И Договор = &Договор
	               |					И ПриложениеКДоговору = &ПриложениеКДоговору) КАК CW_ВознаграждениеПоГрузоперевозкамОбороты
	               |		ПО (CW_ВознаграждениеПоГрузоперевозкамОбороты.Контрагент = CW_ПеревыставлениеОбороты.Контрагент)
	               |			И (CW_ВознаграждениеПоГрузоперевозкамОбороты.Договор = CW_ПеревыставлениеОбороты.Договор)
	               |			И (CW_ВознаграждениеПоГрузоперевозкамОбороты.Грузоперевозка = CW_ПеревыставлениеОбороты.Грузоперевозка)
	               |			И (CW_ВознаграждениеПоГрузоперевозкамОбороты.ДокументРасходов = CW_ПеревыставлениеОбороты.ДокументРасходов)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ПеревыставлениеОбороты.Грузоперевозка,
	               |	CW_ПеревыставлениеОбороты.Контрагент,
	               |	CW_ПеревыставлениеОбороты.Договор,
	               |	CW_ПеревыставлениеОбороты.ДокументРасходов";
	Запрос.УстановитьПараметр("Контрагент", Договор.Владелец);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ПриложениеКДоговору", ПриложениеКДоговору);
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Дата2", Новый Граница(Дата,ВидГраницы.Исключая)); 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	// процент
	Если ПараметрыДоговора.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ПроцентОтСуммы Тогда 
		
		Для каждого Стр Из ТЗ Цикл
			
			БазаВознаграждения = Стр.СуммаВсегоРасходов; // всегда рубли
			
			Если ТребуетсяПересчетВВалюту Тогда
				БазаВознаграждения = CW_Финансы.ПересчитатьИзВалютыВВалюту(БазаВознаграждения,ВалютаРегламентированногоУчета,ВалютаДоговора,1,КурсВалютыДоговора.Курс,КурсВалютыДоговора.Кратность);
			КонецЕсли;
			
			СуммаВознаграждения = БазаВознаграждения * ПараметрыДоговора.РазмерАгентскогоВознаграждения/100;
			
			Если СуммаВознаграждения <> 0 Тогда
				
				// добавляем
				Нстр = ТаблицаУслуг.Добавить();
				// ---------------------------------------------------------------------------- 
				Нстр.Грузоперевозка		= Стр.Грузоперевозка;
				Нстр.Номенклатура		= НоменклатураВознаграждения;
				Нстр.Представление		= НоменклатураВознаграждения.НаименованиеПолное + " " + Стр.Грузоперевозка.CW_Представление;
				Нстр.СтатьяЗатрат		= _сф.со_Получить(СоответствиеСтатейЗатрат,Нстр.Номенклатура,ОсновнаяСтатьяЗатрат);
				Нстр.ДокументРасходов 	= Стр.ДокументРасходов;
				Нстр.ПорядокОтражения  	= Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
				Нстр.Количество			= 1;
				Нстр.СтавкаНДС 			= ПараметрыДоговора.СтавкаНДС;
				Нстр.База	  			= БазаВознаграждения;
				// --- 
				Ставка 					= CW_Финансы.ПолучитьСтавкуНДС(Нстр.СтавкаНДС)/100;
				Нстр.Всего				= СуммаВознаграждения;
				Нстр.НДС				= Нстр.Всего*Ставка/(1+Ставка);
				Нстр.Сумма            	= Нстр.Всего - Нстр.НДС;
				Нстр.Цена				= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;
	
	// фиксированная сумма
	Если ПараметрыДоговора.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ФиксированнаяСумма Тогда 
						
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	CW_ВознаграждениеПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка,
		|	CW_ВознаграждениеПоГрузоперевозкам.Всего_ВалютаОборот КАК Всего_ВалютаОборот
		|ИЗ
		|	РегистрНакопления.CW_ВознаграждениеПоГрузоперевозкам.Обороты(
		|			,
		|			&Дата2,
		|			,
		|			Контрагент = &Контрагент
		|				И Договор = &Договор
		|				И ПриложениеКДоговору = &ПриложениеКДоговору) КАК CW_ВознаграждениеПоГрузоперевозкам"
		);
		Запрос.УстановитьПараметр("Дата2", Новый Граница(Дата, ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Контрагент", Договор.Владелец);
		Запрос.УстановитьПараметр("Договор", Договор);
		Запрос.УстановитьПараметр("ПриложениеКДоговору", ПриложениеКДоговору);
		НачисленноеВознаграждение = Запрос.Выполнить().Выгрузить();
		НачисленноеВознаграждение.Индексы.Добавить("Грузоперевозка");
		// --- 
		ТЗ.ЗаполнитьЗначения(Неопределено, "ДокументРасходов");
		
		Для каждого Стр Из ТЗ Цикл
			
			// фиксированной суммой
			БазаВознаграждения = 0;
			СуммаВознаграждения = 0;
			Если Стр.СуммаВсегоРасходов > 0 Тогда 
				
				// начисляется один раз за грузоперевозку
				СтрНачисленноеВознаграждение = НачисленноеВознаграждение.Найти(Стр.Грузоперевозка, "Грузоперевозка");
				Если СтрНачисленноеВознаграждение = Неопределено Тогда 
					
					// еще не начисляли
					СуммаВознаграждения = ПараметрыДоговора.РазмерАгентскогоВознаграждения;
					// на случай повтора строк по одной и той же грузоперевозке в таблице заполнения, добавим строку в тзРанееНачисленноеВознаграждение (сворачивать исходную таблицу по грузоперевозке не хочется)
					НстрНачисленноеВознаграждение = НачисленноеВознаграждение.Добавить();
					НстрНачисленноеВознаграждение.Грузоперевозка = Стр.Грузоперевозка;
					НстрНачисленноеВознаграждение.Всего_ВалютаОборот = СуммаВознаграждения;
					
				КонецЕсли;
				
				Если СуммаВознаграждения <> 0 Тогда
					
					// добавляем
					Нстр = ТаблицаУслуг.Добавить();
					// ---------------------------------------------------------------------------- 
					Нстр.Грузоперевозка		= Стр.Грузоперевозка;
					Нстр.Номенклатура		= НоменклатураВознаграждения;
					Нстр.Представление		= НоменклатураВознаграждения.НаименованиеПолное + " " + Стр.Грузоперевозка.CW_Представление;
					Нстр.СтатьяЗатрат		= _сф.со_Получить(СоответствиеСтатейЗатрат,Нстр.Номенклатура,ОсновнаяСтатьяЗатрат);
					Нстр.ДокументРасходов 	= Стр.ДокументРасходов;
					Нстр.ПорядокОтражения  	= Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
					Нстр.Количество			= 1;
					Нстр.СтавкаНДС 			= ПараметрыДоговора.СтавкаНДС;
					Нстр.База	  			= БазаВознаграждения;
					// --- 
					Ставка 					= CW_Финансы.ПолучитьСтавкуНДС(Нстр.СтавкаНДС)/100;
					Нстр.Всего				= СуммаВознаграждения;
					Нстр.НДС				= Нстр.Всего*Ставка/(1+Ставка);
					Нстр.Сумма            	= Нстр.Всего - Нстр.НДС;
					Нстр.Цена				= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	// ---------------------------------------------------------------------------- 
	Возврат(ТаблицаУслуг);	
		
	// --- 
КонецФункции

// представление номенклатуры в таблице услуг
Процедура Услуги_СформироватьПредставлениеНоменклатуры(ТаблицаУслуг,Договор,Объект,ФормироватьЗаново) Экспорт 
	
	Для каждого Стр Из ТаблицаУслуг Цикл
		
		Если ФормироватьЗаново Тогда
			
			ПараметрыШаблона = CW_Шаблоны.ПолучитьПараметрШаблонаУслуг();
			
			ПараметрыШаблона.Номенклатура 	= Стр.Номенклатура;
			ПараметрыШаблона.Объект 		= Объект;
			ПараметрыШаблона.Дата 			= Объект.Дата;
			ПараметрыШаблона.Договор 		= Договор;
			ПараметрыШаблона.ВидДоговора 	= Договор.ВидДоговора;
			ПараметрыШаблона.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
			
			CW_Шаблоны.УстановитьПредставлениеНоменклатурыВСтроке(Стр, ПараметрыШаблона); 
			
		Иначе
			Если (ТаблицаУслуг.Колонки.Найти("ДокументРасходов") = Неопределено) Тогда
				Стр.Представление = СокрЛП(?(ЗначениеЗаполнено(Стр.Номенклатура.НаименованиеПолное),Стр.Номенклатура.НаименованиеПолное,Стр.Номенклатура.Наименование));
			Иначе
				Отбор = _сф.ст_Создать("Грузоперевозка,Номенклатура,СтавкаНДС,ПорядокОтражения,Покупатель,ДоговорПокупателя",Стр);
				
				Если ТипЗнч(Отбор.ПорядокОтражения) = Тип("ПеречислениеСсылка.CW_ПорядокОтраженияДоходов") Тогда
					Отбор.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.ПолучитьПорядокОтраженияЗатрат(Отбор.ПорядокОтражения);
				КонецЕсли;
				
				СтрокаВДокументе = _сф.к_НайтиСтроку(Стр.ДокументРасходов.Услуги,Отбор);
				
				Если СтрокаВДокументе <> Неопределено Тогда
					Стр.Представление = СтрокаВДокументе.Представление;
				Иначе
					Стр.Представление = СокрЛП(?(ЗначениеЗаполнено(Стр.Номенклатура.НаименованиеПолное),Стр.Номенклатура.НаименованиеПолное,Стр.Номенклатура.Наименование));
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры
  
// пересчет валютных сумм
Процедура Услуги_ПересчитатьИзВалютыРегламентированногоУчета(ТаблицаУслуг,СтруктураКурса) Экспорт  
	// --- 
	
	Для каждого Стр Из ТаблицаУслуг Цикл
		
		Стр.Всего = Окр(_сф.БезопасноРазделить(Окр(Стр.Всего_Рег,2) * СтруктураКурса.Кратность,СтруктураКурса.Курс),2);
		Стр.НДС = Окр(_сф.БезопасноРазделить(Окр(Стр.НДС_Рег,2) * СтруктураКурса.Кратность,СтруктураКурса.Курс),2);
		Стр.Сумма = Окр(Стр.Всего - Стр.НДС,2);
		Стр.Цена = Окр(_сф.БезопасноРазделить(Стр.Сумма,Стр.Количество),2);
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

// пересчет валютных сумм
Процедура Услуги_ПеренестиИзВалютыРегламентированногоУчета(ТаблицаУслуг) Экспорт  
	// --- 
	
	Для каждого Стр Из ТаблицаУслуг Цикл
		
		Стр.Всего = Стр.Всего_Рег;
		Стр.НДС = Стр.НДС_Рег;
		Стр.Сумма = Стр.Сумма_Рег;
		Стр.Цена = Стр.Цена_Рег;
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

// установка цен по протоколу согласования
Процедура Услуги_УстновитьЦенуУслугПоПротоколуСогласованияЦен(ТаблицаУслуг, Объект) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("CW_ОграничиватьУслугиПоДоговорам") тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Договор.ОграничиватьНоменклатуру Тогда
		Возврат;
	КонецЕсли;
	
	//есть ограничения
	УстанавливатьЦенуВЗависимостиОтГруза 	= ПолучитьФункциональнуюОпцию("CW_УстанавливатьЦенуВЗависимостиОтГруза");
	
	ДатаДокумента = Объект.Дата;
	Если Объект.ФормируетсяАкт 
		и ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
		ДатаДокумента = Объект.ДатаАкта;  
	ИначеЕсли Объект.ФормируетсяСчет 
		и ЗначениеЗаполнено(Объект.ДатаСчета) Тогда
		ДатаДокумента = Объект.ДатаСчета;  
	КонецЕсли;
	
	АдресУслугПоДоговору = _УФС.ОбновитьСписокУслугПоДоговору(ДатаДокумента, Объект.Договор);
	
	Если Не ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
		Возврат;
	КонецЕсли;
	
	УслугиПоДоговору = ПолучитьИзВременногоХранилища(АдресУслугПоДоговору);

	Для Каждого СтрокаУслуги из ТаблицаУслуг Цикл
		
		Если СтрокаУслуги.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("АдресУслугПоДоговору"						, АдресУслугПоДоговору);
		СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтГруза"		, УстанавливатьЦенуВЗависимостиОтГруза);
		СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтКлиента"	, Ложь);
		
		СтруктураПараметров.Вставить("Номенклатура"								, СтрокаУслуги.Номенклатура);
		Если УстанавливатьЦенуВЗависимостиОтГруза Тогда
			СтруктураПараметров.Вставить("Груз" , СтрокаУслуги.Грузоперевозка.Груз);
		КонецЕсли;
		
		УслугаДоговора = _УФС.ПолучитьУслугуДоговораПоПараметрам(СтруктураПараметров);
		
		Если  УслугаДоговора <> Неопределено Тогда
			
			СтрокаУслуги.СтавкаНДС		= УслугаДоговора.СтавкаНДС;
			
			Если УслугаДоговора.ЦенаБезНДС <> 0 Тогда
				СтрокаУслуги.Цена			= УслугаДоговора.ЦенаБезНДС;
			КонецЕсли;
			
			Ставка 						= CW_Финансы.ПолучитьСтавкуНДС(УслугаДоговора.СтавкаНДС);
			
			Если УслугаДоговора.ВариантРасчетаНДС = Перечисления.ВариантыРасчетаНДС.НДССверху тогда
				СтрокаУслуги.Сумма 		= УслугаДоговора.ЦенаБезНДС * СтрокаУслуги.Количество;
				
				СтрокаУслуги.Цена 	= _сф.БезопасноРазделить(СтрокаУслуги.Сумма,СтрокаУслуги.Количество);
				СтрокаУслуги.НДС 	= СтрокаУслуги.Сумма*(Ставка/100);
				СтрокаУслуги.Всего 	= СтрокаУслуги.Сумма+СтрокаУслуги.НДС;
				
			Иначе //в сумме
				СтрокаУслуги.Всего = УслугаДоговора.Цена * СтрокаУслуги.Количество;
				
				СтрокаУслуги.НДС 	= СтрокаУслуги.Всего*(Ставка/(100+Ставка));
				СтрокаУслуги.Сумма 	= СтрокаУслуги.Всего - СтрокаУслуги.НДС;
				СтрокаУслуги.Цена 	= _сф.БезопасноРазделить(СтрокаУслуги.Сумма,СтрокаУслуги.Количество);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если (ВидФормы = "ФормаСписка") Тогда
		
		СтандартнаяОбработка = Ложь;
		РежимПростойФормы = CW_Настройки.ПолучитьНастройкуПользователя(,"ПростаяФормаСпискаДоходов"); ;
		Если (РежимПростойФормы) Тогда
			ВыбраннаяФорма = "ФормаСпискаПростаяУправляемая";
		Иначе
			ВыбраннаяФорма = "ФормаСпискаУправляемая";
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

Функция ПолучитьТаблицу_ПлатёжноРасчётныеДокументы_дляСФ(ДоходыСсылка, ЗачетАвансов=Неопределено, Услуги=Неопределено) Экспорт 
	
	СтруктураОтвета = Новый Структура("Код, ОписаниеОшибки", 0, "");
	
	// собрать номера и даты документов из собственной табличной части Зачёт аванса
	// и для перевыставляемых услуг собрать номера и даты документов из перевыставляемых документов Расходов
	Запрос = Новый Запрос;
	
	Если Неопределено=ЗачетАвансов 
		ИЛИ Неопределено=Услуги Тогда 
		// задана только ссылка на Доходы (должен быть уже проведён)
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	влож.НомерДокумента КАК НомерДокумента,
		|	влож.ДатаДокумента КАК ДатаДокумента,
		|	влож.ПолеУпорядочивания КАК ПолеУпорядочивания,
		|	влож.НомерСчетаФактурыНаАванс КАК НомерСчетаФактурыНаАванс,
		|	влож.ДатаСчетаФактурыНаАванс КАК ДатаСчетаФактурыНаАванс,
		|	влож.НомерИсправленияСчетаФактурыНаАванс КАК НомерИсправленияСчетаФактурыНаАванс,
		|	влож.ДатаИсправленияСчетаФактурыНаАванс КАК ДатаИсправленияСчетаФактурыНаАванс
		|ИЗ
		|	(ВЫБРАТЬ
		|		1 КАК ПолеУпорядочивания,
		|		докДоходыЗачетАвансов.ДокументАванса.НомерВходящегоДокумента КАК НомерДокумента,
		|		докДоходыЗачетАвансов.ДокументАванса.ДатаВходящегоДокумента КАК ДатаДокумента,
		|		СчетФактураВыданныйНаАванс.ПредставлениеНомера КАК НомерСчетаФактурыНаАванс,
		|		СчетФактураВыданныйНаАванс.Дата КАК ДатаСчетаФактурыНаАванс,
		|		СчетФактураВыданныйИсправление.НомерИсправления КАК НомерИсправленияСчетаФактурыНаАванс,
		|		СчетФактураВыданныйИсправление.Дата КАК ДатаИсправленияСчетаФактурыНаАванс
		|	ИЗ
		|		Документ.CW_ДоходыПоГрузоперевозке.ЗачетАвансов КАК докДоходыЗачетАвансов
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданныйНаАванс
		|			ПО докДоходыЗачетАвансов.ДокументАванса = СчетФактураВыданныйНаАванс.ДокументОснование
		|				И (СчетФактураВыданныйНаАванс.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))
		|				И (СчетФактураВыданныйНаАванс.Исправление = ЛОЖЬ)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданныйИсправление
		|			ПО докДоходыЗачетАвансов.ДокументАванса = СчетФактураВыданныйИсправление.ДокументОснование
		|				И (СчетФактураВыданныйИсправление.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))
		|				И (СчетФактураВыданныйИсправление.Исправление = ИСТИНА)
		|	ГДЕ
		|		докДоходыЗачетАвансов.Ссылка = &ДоходыСсылка
		|		И докДоходыЗачетАвансов.ДокументАванса ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		2,
		|		докРасходыПлатёжноРасчётныеДокументы.НомерДокумента,
		|		докРасходыПлатёжноРасчётныеДокументы.ДатаДокумента,
		|		"""",
		|		ДАТАВРЕМЯ(1, 1, 1),
		|		"""",
		|		ДАТАВРЕМЯ(1, 1, 1)
		|	ИЗ
		|		Документ.CW_РасходыПоГрузоперевозке.ПлатёжноРасчётныеДокументы КАК докРасходыПлатёжноРасчётныеДокументы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК докДоходыУслуги
		|			ПО докРасходыПлатёжноРасчётныеДокументы.Ссылка = докДоходыУслуги.ДокументРасходов
		|				И (докДоходыУслуги.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление))
		|				И (докДоходыУслуги.Ссылка = &ДоходыСсылка)) КАК влож
		|
		|УПОРЯДОЧИТЬ ПО
		|	влож.ПолеУпорядочивания,
		|	влож.ДатаДокумента,
		|	влож.НомерДокумента"; 
		
		Запрос.УстановитьПараметр("ДоходыСсылка", ДоходыСсылка); 
		
	Иначе 
		// переданы таб.часть ЗачетАвансов и таб.часть Услуги - это делается до записи, когда по ссылке ещё не сохранены последние изменения
		Запрос.Текст =
		"ВЫБРАТЬ
		|	тз.ДокументАванса КАК ДокументАванса,
		|	тз.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ втЗачетАвансовВрем
		|ИЗ
		|	&тзЗачетАвансов КАК тз
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тз.ДокументАванса КАК ДокументАванса,
		|	тз.НомерСтроки КАК НомерСтроки,
		|	СчетФактураВыданныйНаАванс.ПредставлениеНомера КАК НомерСчетаФактурыНаАванс,
		|	СчетФактураВыданныйИсправление.Дата КАК ДатаИсправленияСчетаФактурыНаАванс,
		|	СчетФактураВыданныйНаАванс.Дата КАК ДатаСчетаФактурыНаАванс,
		|	СчетФактураВыданныйИсправление.НомерИсправления КАК НомерИсправленияСчетаФактурыНаАванс
		|ПОМЕСТИТЬ втЗачетАвансов
		|ИЗ
		|	втЗачетАвансовВрем КАК тз
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданныйНаАванс
		|		ПО тз.ДокументАванса = СчетФактураВыданныйНаАванс.ДокументОснование
		|			И (СчетФактураВыданныйНаАванс.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))
		|			И (СчетФактураВыданныйНаАванс.Исправление = ЛОЖЬ)
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданныйИсправление
		|		ПО тз.ДокументАванса = СчетФактураВыданныйИсправление.ДокументОснование
		|			И (СчетФактураВыданныйИсправление.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс))
		|			И (СчетФактураВыданныйИсправление.Исправление = ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тз.ПорядокОтражения КАК ПорядокОтражения,
		|	тз.ДокументРасходов КАК ДокументРасходов
		|ПОМЕСТИТЬ втУслуги
		|ИЗ
		|	&тзУслуги КАК тз
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	влож.НомерДокумента КАК НомерДокумента,
		|	влож.ДатаДокумента КАК ДатаДокумента,
		|	влож.ПолеУпорядочивания КАК ПолеУпорядочивания,
		|	влож.НомерСчетаФактурыНаАванс КАК НомерСчетаФактурыНаАванс,
		|	влож.ДатаСчетаФактурыНаАванс КАК ДатаСчетаФактурыНаАванс,
		|	влож.НомерИсправленияСчетаФактурыНаАванс КАК НомерИсправленияСчетаФактурыНаАванс,
		|	влож.ДатаИсправленияСчетаФактурыНаАванс КАК ДатаИсправленияСчетаФактурыНаАванс
		|ИЗ
		|	(ВЫБРАТЬ
		|		1 КАК ПолеУпорядочивания,
		|		вт.ДокументАванса.НомерВходящегоДокумента КАК НомерДокумента,
		|		вт.ДокументАванса.ДатаВходящегоДокумента КАК ДатаДокумента,
		|		вт.НомерСчетаФактурыНаАванс КАК НомерСчетаФактурыНаАванс,
		|		вт.ДатаИсправленияСчетаФактурыНаАванс КАК ДатаИсправленияСчетаФактурыНаАванс,
		|		вт.НомерИсправленияСчетаФактурыНаАванс КАК НомерИсправленияСчетаФактурыНаАванс,
		|		вт.ДатаСчетаФактурыНаАванс КАК ДатаСчетаФактурыНаАванс
		|	ИЗ
		|		втЗачетАвансов КАК вт
		|	ГДЕ
		|		вт.ДокументАванса ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		2,
		|		докРасходыПлатёжноРасчётныеДокументы.НомерДокумента,
		|		докРасходыПлатёжноРасчётныеДокументы.ДатаДокумента,
		|		"""",
		|		ДАТАВРЕМЯ(1, 1, 1),
		|		"""",
		|		ДАТАВРЕМЯ(1, 1, 1)
		|	ИЗ
		|		Документ.CW_РасходыПоГрузоперевозке.ПлатёжноРасчётныеДокументы КАК докРасходыПлатёжноРасчётныеДокументы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втУслуги КАК втУслуги
		|			ПО докРасходыПлатёжноРасчётныеДокументы.Ссылка = втУслуги.ДокументРасходов
		|				И (втУслуги.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление))) КАК влож
		|
		|УПОРЯДОЧИТЬ ПО
		|	влож.ПолеУпорядочивания,
		|	влож.ДатаДокумента,
		|	влож.НомерДокумента";   
		
		Запрос.УстановитьПараметр("тзЗачетАвансов", ЗачетАвансов.Выгрузить());
		Запрос.УстановитьПараметр("тзУслуги", Услуги.Выгрузить());
	КонецЕсли;	
	
	ПлатёжноРасчётныеДокументы = Запрос.Выполнить().Выгрузить();
	
	СтруктураОтвета.Вставить("ПлатёжноРасчётныеДокументы", ПлатёжноРасчётныеДокументы);
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПолучитьСчетНаОплатуПокупателю(СсылкаНаДокумент) Экспорт
	
	Если СсылкаНаДокумент.СписокСчетов Тогда 
		//По списку счетов не указывает счет-основание
		Возврат Неопределено;
	КонецЕсли;
	
	Если СсылкаНаДокумент.ФормируетсяСчет Тогда
		Возврат СсылкаНаДокумент.ВедомыйСчет;
	ИначеЕсли СсылкаНаДокумент.ФормируетсяАкт Тогда
		Возврат ПолучитьСчетНаОплатуПокупателю(СсылкаНаДокумент.Счет);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСвязанныеСчета(СсылкаНаДокумент) Экспорт
	
	Если Не СсылкаНаДокумент.СписокСчетов Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаДокумент.Счет);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Счет КАК Счет
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	мСвязанныеСчета = Новый Массив;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если ЗначениеЗаполнено(Выборка.Счет) 
			и мСвязанныеСчета.Найти(Выборка.Счет) = Неопределено Тогда
			мСвязанныеСчета.Добавить(Выборка.Счет);                                                        
		КонецЕсли;
	КонецЦикла;
	
	Возврат мСвязанныеСчета;
	
КонецФункции

//Шаблоны стандартных писем
Процедура ДополнитьМакросыОбъекта(ДеревоМакросов) Экспорт

	ГруппаМакросов = ДеревоМакросов.Строки.Добавить();  
	ГруппаМакросов.ИндексКартинки 	= 0;
	ГруппаМакросов.Значение 		= "";
	ГруппаМакросов.Представление 	= "Доходы по грузоперевозке";
	ГруппаМакросов.ЭтоГруппа 		= Истина;
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[НомерСчета]",	"Номер счета",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаСчета]",	"Дата счета",	2);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[НомерАкта]",	"Номер акта",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаАкта]",	"Дата акта",	2);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[НомерСчетаФактуры]",	"Номер Счета-фактуры",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаСчетаФактуры]",	"Дата Счета-фактуры",	2);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СрокОплаты]",	"Срок оплаты",	2);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ПланОплаты]",	"План оплаты",	2);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[НомерДоговора]",	"Номер договора",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаДоговора]",	"Дата договора",	2);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ВалютаДоговора]",	"Валюта договора",	5);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[НомерПриложения]",		"Номер приложения",		4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаПриложения]",		"Дата приложения",		2);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ВалютаПриложения]",	"Валюта приложения",	5);

	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ОрганизацияСокр]",		"Организация (сокращенное)",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ОрганизацияПолн]",		"Организация (полное)",			4);
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Клиент]",	"Клиент",	4);
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов") Тогда 
		ДобавитьСтрокуМакросов(ГруппаМакросов, "[СтатусДокумента]",				"Статус документа",	4);
		ДобавитьСтрокуМакросов(ГруппаМакросов, "[СтатусДокументаКомментарий]",	"Статус документа - комментарий",	4);
	КонецЕсли; 	
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СписокГрузоперевозок]",	"Список грузоперевозок",	9);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СписокЗаказов]",			"Список заказов",			9);
	
	ГруппаПараметров = ГруппаМакросов.Строки.Добавить();  
	ГруппаПараметров.ИндексКартинки = 0;
	ГруппаПараметров.Значение 		= "";
	ГруппаПараметров.Представление 	= "Параметры грузоперевозок";
	ГруппаПараметров.ЭтоГруппа 		= Истина;
	
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ДополнитьМакросыПараметровГрузоперевозок(ГруппаПараметров);
	
КонецПроцедуры 

Процедура ДобавитьСтрокуМакросов(ГруппаМакросов, Значение, Представление, ИндексКартинки)
	
	СтрокаМакроса = ГруппаМакросов.Строки.Добавить();
	СтрокаМакроса.ИндексКартинки 	= ИндексКартинки;
	СтрокаМакроса.Значение 			= Значение;
	СтрокаМакроса.Представление 	= Представление;
	СтрокаМакроса.ЭтоГруппа 		= Ложь;
	
КонецПроцедуры
	

Процедура ПолучитьОписаниеМакросов(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если ДополнительныеПараметры <> Неопределено 
		И ДополнительныеПараметры.Корректировка Тогда
		
		Результат.Вставить("[ДатаАкта]", 	"Источник.ВедомыйДокументКорректировки.Дата");
		Результат.Вставить("[НомерАкта]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник.ВедомыйДокументКорректировки)");
		
		Результат.Вставить("[ДатаСчета]", 	"Источник.ДатаСчета");
		Результат.Вставить("[НомерСчета]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник, ""НомерСчета"", ""ДатаСчета"")");  
		
	Иначе
		
		Результат.Вставить("[ДатаАкта]", 	"Источник.ДатаАкта");
		Результат.Вставить("[НомерАкта]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник, ""НомерАкта"", ""ДатаАкта"")");
		
		// документ Доходов может сам себе быть счётом, а может ссылаться на другой документ Доходов
		Если ДополнительныеПараметры <> Неопределено 
			И НЕ ДополнительныеПараметры.ФормируетсяСчет И ДополнительныеПараметры.ФормируетсяАкт И ДополнительныеПараметры.ЕстьСчет Тогда
			
			Результат.Вставить("[ДатаСчета]", 	"Источник.Счет.ДатаСчета");
			Результат.Вставить("[НомерСчета]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник.Счет, ""НомерСчета"", ""ДатаСчета"")");
			
		Иначе
			
			Результат.Вставить("[ДатаСчета]", 	"Источник.ДатаСчета");
			Результат.Вставить("[НомерСчета]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник, ""НомерСчета"", ""ДатаСчета"")");
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Результат.Вставить("[ДатаСчетаФактуры]", 	"Источник.ДатаСчетаФактуры");
	Результат.Вставить("[НомерСчетаФактуры]", 	"CW_Документы.ПолучитьНомерНаПечать(Источник, ""НомерСчетаФактуры"", ""ДатаСчетаФактуры"")");
	
	Результат.Вставить("[СрокОплаты]", 	    "CW_Документы.ПолучитьСрокОплаты(Источник).ДатаОплаты");
	Результат.Вставить("[ПланОплаты]", 	    "CW_Документы.ПолучитьПланОплаты(Источник).Дата");
	
	Результат.Вставить("[ВалютаДоговора]", 	"Источник.Договор.ВалютаДоговора");
	Результат.Вставить("[ДатаДоговора]", 	"Источник.Договор.ДатаДоговора");
	Результат.Вставить("[НомерДоговора]", 	"Источник.Договор.НомерДоговора");
	Результат.Вставить("[Клиент]", 			"Источник.Контрагент.НаименованиеПолное");
	
	Результат.Вставить("[СписокГрузоперевозок]", 	"МенеджерОбъектаШаблона.ПолучитьСписокГрузоперевозок(Источник)");
	Результат.Вставить("[СписокЗаказов]", 			"МенеджерОбъектаШаблона.ПолучитьСписокЗаказов(Источник)");
	
	Результат.Вставить("[НомерПриложения]", 	"Источник.ПриложениеКДоговору.НомерДокумента");
	Результат.Вставить("[ДатаПриложения]", 		"Источник.ПриложениеКДоговору.ДатаДокумента");
	Результат.Вставить("[ВалютаПриложения]", 	"Источник.ПриложениеКДоговору.ВалютаДоговора");
	
	Результат.Вставить("[ОрганизацияСокр]",	"");
	Результат.Вставить("[ОрганизацияПолн]",	"");
	
	Результат.Вставить("[ОрганизацияСокр]",	"Справочники.Организации.НаименованияНаДату(Источник.Организация,Источник.Дата).СокращенноеНаименование");
	Результат.Вставить("[ОрганизацияПолн]",	"Справочники.Организации.НаименованияНаДату(Источник.Организация,Источник.Дата).ПолноеНаименование");
	
	Результат.Вставить("[СтатусДокумента]",	           "РегистрыСведений.CW_СтатусыДокументов.ПолучитьДанныеСтатусаДокумента(Источник).СтатусДокумента");
	Результат.Вставить("[СтатусДокументаКомментарий]", "РегистрыСведений.CW_СтатусыДокументов.ПолучитьДанныеСтатусаДокумента(Источник).Комментарий");
	
	Результат.Вставить("[ФИООтправителя]", 				"CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(НастройкиПользователя.ФИО, Источник.Дата)");

	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ОписаниеМакросовПараметровГрузоперевозок(Результат);
	
КонецПроцедуры    

Функция ПараметрыОписанияМакросов(ОбъектШаблона) Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("Корректировка",		ОбъектШаблона.Корректировка) ;
	Структура.Вставить("ФормируетсяСчет", 	ОбъектШаблона.ФормируетсяСчет);
	Структура.Вставить("ФормируетсяАкт", 	ОбъектШаблона.ФормируетсяАкт);
	Структура.Вставить("ЕстьСчет", 			ЗначениеЗаполнено(ОбъектШаблона.Счет));
	
	Возврат Структура;
	
КонецФункции  

Функция ПолучитьСписокГрузоперевозок(Источник) Экспорт
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТабличнаяЧастьУслуги.Грузоперевозка КАК Грузоперевозка
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК ТабличнаяЧастьУслуги
	|ГДЕ
	|	ТабличнаяЧастьУслуги.Ссылка = &Источник
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабличнаяЧастьУслуги.Грузоперевозка";
	
	Запрос.УстановитьПараметр("Источник", Источник); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Грузоперевозка);
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, ", ");
	
КонецФункции

Функция ПолучитьСписокЗаказов(Источник) Экспорт
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабличнаяЧастьУслуги.Грузоперевозка.Заказ КАК Заказ
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК ТабличнаяЧастьУслуги
	               |ГДЕ
	               |	ТабличнаяЧастьУслуги.Ссылка = &Источник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТабличнаяЧастьУслуги.Грузоперевозка.Заказ";
	
	Запрос.УстановитьПараметр("Источник", Источник); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Заказ);
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, ", ");
	
КонецФункции

Функция ПолучитьЗначениеПараметра(Источник, ИдентификаторПараметра,  ПолучаемоеЗначение = "Значение", СоответствиеПараметров) Экспорт

	ПараметрСсылка = СоответствиеПараметров.Получить(ИдентификаторПараметра);
	Если ПараметрСсылка = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	МассивГрузоперевозок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабличнаяЧастьУслуги.Грузоперевозка КАК Грузоперевозка
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК ТабличнаяЧастьУслуги
	               |ГДЕ
	               |	ТабличнаяЧастьУслуги.Ссылка = &Источник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТабличнаяЧастьУслуги.Грузоперевозка";
	
	Запрос.УстановитьПараметр("Источник", Источник); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивГрузоперевозок.Добавить(Выборка.Грузоперевозка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка,
	               |	ЕСТЬNULL(ПараметрыГрузоперевозок.Значение, ЕСТЬNULL(ПараметрыЗаказов.Значение, НЕОПРЕДЕЛЕНО)) КАК Значение,
	               |	ЕСТЬNULL(ПараметрыГрузоперевозок.ЗначениеПлан, ЕСТЬNULL(ПараметрыЗаказов.ЗначениеПлан, НЕОПРЕДЕЛЕНО)) КАК ЗначениеПлан,
	               |	ЕСТЬNULL(ПараметрыГрузоперевозок.ЗначениеФакт, ЕСТЬNULL(ПараметрыЗаказов.ЗначениеФакт, НЕОПРЕДЕЛЕНО)) КАК ЗначениеФакт
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК ПараметрыГрузоперевозок
	               |		ПО CW_Грузоперевозки.Ссылка = ПараметрыГрузоперевозок.Грузоперевозка
	               |			И (ПараметрыГрузоперевозок.Параметр = &Параметр)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиЗаказов КАК ПараметрыЗаказов
	               |		ПО CW_Грузоперевозки.Заказ = ПараметрыЗаказов.Заказ
	               |			И (ПараметрыЗаказов.Параметр = &Параметр)
	               |ГДЕ
	               |	CW_Грузоперевозки.Ссылка В(&МассивГрузоперевозок)";
	
	Запрос.УстановитьПараметр("МассивГрузоперевозок", 	МассивГрузоперевозок);
	Запрос.УстановитьПараметр("Параметр", 				ПараметрСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Массив = новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗначениеПараметра = Выборка[ПолучаемоеЗначение];
		Если Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Массив.Найти(ЗначениеПараметра) = Неопределено Тогда
			Массив.Добавить(ЗначениеПараметра);
		конецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, ", ");

КонецФункции
//---Шаблоны стандартных писем

#КонецЕсли
