#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ДС Экспорт;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Неопределено;
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
	
	// чистим ссылки на ведомые документы
	ВедомыйДокумент 	= Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	ВедомыйСчет 		= Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
	ВедомыйСчетФактура 	= Документы.СчетФактураВыданный.ПустаяСсылка();
	
	// ввод на основании грузоперевозки
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Объект"				, ДанныеЗаполнения.Ссылка);
		СтруктураПараметров.Вставить("ЭтоВариантБюджета"	, Ложь);
		СтруктураПараметров.Вставить("Контрагент"			, ДанныеЗаполнения.Ссылка.Клиент);
		
		Контрагент = CW_Финансы.ВернутьПлательщика(СтруктураПараметров);
		ДанныеЗаполнения = Неопределено;
	КонецЕсли; 
	
	// состав пакета
	НастройкиПользователя = CW_Настройки.ПолучитьНастройкиПользователя();
	Если НастройкиПользователя = Неопределено Тогда
		НастройкиПользователя = Новый Структура("Доходы_ФормироватьСчет,Доходы_ФормироватьАкт,Доходы_ФормироватьСчетФактуру",Ложь,Ложь,Ложь);
	КонецЕсли;  
	
	Если CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Счета") Тогда
		ФормируетсяСчет	=	НастройкиПользователя.Доходы_ФормироватьСчет;
	КонецЕсли;   
	
	Если CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Акты") Тогда
		ФормируетсяАкт			= НастройкиПользователя.Доходы_ФормироватьАкт;
		ФормируетсяСчетФактура	= НастройкиПользователя.Доходы_ФормироватьСчетФактуру;
	КонецЕсли; 
	// состав пакета
	
	
	Если ДанныеЗаполнения = Неопределено Тогда 
		// вид операции
		ВидОперации = Перечисления.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг;
		// порядок зачета оперативных авансов
		СпособЗачетаАвансовОЗ = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
		Возврат;
	КонецЕсли;
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("КорректируемыйДокумент") Тогда
			
			Корректировка 			= Истина;
			КорректируемыйДокумент 	= ДанныеЗаполнения.КорректируемыйДокумент;
			
			//Исправления
			ВидОперацииКорректировки = КорректируемыйДокумент.ВидОперацииКорректировки;
			Если НЕ ЗначениеЗаполнено(ВидОперацииКорректировки) Тогда
				ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение");
			Конецесли;
			
			Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
				НомерСчетаФактуры	= КорректируемыйДокумент.НомерСчетаФактуры;
				ДатаСчетаФактуры	= КорректируемыйДокумент.ДатаСчетаФактуры;
				НомерИсправления 	= КорректируемыйДокумент.НомерИсправления + 1;
			конецЕсли;
			//Исправления
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,КорректируемыйДокумент,"Организация,Контрагент,Договор,ПриложениеКДоговору,Валюта,ФормируетсяСчет,ФормируетсяАкт,ФормируетсяСчетФактура,ЦенаСНДС");
			
			СопроводительныеДокументы = КорректируемыйДокумент.СопроводительныеДокументы;
			СведенияОТранспортировкеИГрузе = КорректируемыйДокумент.СведенияОТранспортировкеИГрузе;
			
			тДокументыРасходов = КорректируемыйДокумент.Услуги.Выгрузить().Скопировать(,"ПорядокОтражения,ДокументРасходов");   
			тДокументыРасходов.Свернуть("ПорядокОтражения,ДокументРасходов",); 
			
			Отбор = Новый Структура;
			Отбор.Вставить("ПорядокОтражения", Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление);
			
			мСтроки = тДокументыРасходов.НайтиСтроки(Отбор);
			
			мДокументыРасходов = Новый Массив;
			Для Каждого НайденнаяСтрока из мСтроки Цикл
				мДокументыРасходов.Добавить(НайденнаяСтрока.ДокументРасходов);	
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	CW_РасходыПоГрузоперевозке.КорректируемыйДокумент КАК КорректируемыйДокумент,
			               |	CW_РасходыПоГрузоперевозке.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.CW_РасходыПоГрузоперевозке КАК CW_РасходыПоГрузоперевозке
			               |ГДЕ
			               |	CW_РасходыПоГрузоперевозке.КорректируемыйДокумент В(&КорректируемыйДокумент)";
			
			Запрос.УстановитьПараметр("КорректируемыйДокумент", мДокументыРасходов); 
			
			РезультатЗапроса = Запрос.Выполнить();
			
			СоответствиеДокументов = новый Соответствие;
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				СоответствиеДокументов.Вставить(Выборка.КорректируемыйДокумент, Выборка.Ссылка);
			КонецЦикла; 
			
			//AFR23-3305  от 01.02.2023    
			ИсключаяСвойства = "";
			Если ДанныеЗаполнения.КорректируемыйДокумент.ФормируетсяАкт Тогда
				СписокСчетов = Ложь; 
				ИсключаяСвойства = "Счет";
			КонецЕсли;
			//AFR23-3305  от 01.02.2023
			
			Для каждого КорректируемаяСтрока Из КорректируемыйДокумент.Услуги Цикл 
				
				НоваяСтрока = Услуги.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, КорректируемаяСтрока,,ИсключаяСвойства); //Свойство счет исключено из заполнения по заявке: AFR23-3305  от 01.02.2023
				
				НоваяСтрока.Представление_ДоКорректировки 	= КорректируемаяСтрока.Представление;
				НоваяСтрока.Количество_ДоКорректировки 		= КорректируемаяСтрока.Количество;
				НоваяСтрока.Цена_ДоКорректировки 			= КорректируемаяСтрока.Цена;
				НоваяСтрока.Сумма_ДоКорректировки 			= КорректируемаяСтрока.Сумма;
				НоваяСтрока.СтавкаНДС_ДоКорректировки 		= КорректируемаяСтрока.СтавкаНДС;
				НоваяСтрока.НДС_ДоКорректировки 			= КорректируемаяСтрока.НДС;
				НоваяСтрока.Всего_ДоКорректировки 			= КорректируемаяСтрока.Всего;
				
				НоваяСтрока.РеестрыНДС0Приложение_ДоКорректировки = КорректируемаяСтрока.РеестрыНДС0Приложение;
				
				Если КорректируемаяСтрока.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление Тогда
					ДокументКорректировкиРасходов = СоответствиеДокументов.Получить(КорректируемаяСтрока.ДокументРасходов);
					Если ДокументКорректировкиРасходов <> Неопределено Тогда
						НоваяСтрока.ДокументРасходов = ДокументКорректировкиРасходов;
					КонецЕсли; 
				КонецЕсли;     
				
				НоваяСтрока.Представление_ПередКорректировкой 	= КорректируемаяСтрока.Представление_ДоКорректировки;
				НоваяСтрока.Количество_ПередКорректировкой 		= КорректируемаяСтрока.Количество_ДоКорректировки;
				НоваяСтрока.Цена_ПередКорректировкой 			= КорректируемаяСтрока.Цена_ДоКорректировки;
				НоваяСтрока.Сумма_ПередКорректировкой 			= КорректируемаяСтрока.Сумма_ДоКорректировки;
				НоваяСтрока.СтавкаНДС_ПередКорректировкой 		= КорректируемаяСтрока.СтавкаНДС_ДоКорректировки;
				НоваяСтрока.НДС_ПередКорректировкой 			= КорректируемаяСтрока.НДС_ДоКорректировки;
				НоваяСтрока.Всего_ПередКорректировкой 			= КорректируемаяСтрока.Всего_ДоКорректировки;
				
				НоваяСтрока.РеестрыНДС0Приложение_ПередКорректировкой = КорректируемаяСтрока.РеестрыНДС0Приложение_ПередКорректировкой;
		
			КонецЦикла; 
			
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ВводНаОсновании") Тогда
			
			Если Не ДанныеЗаполнения.Свойство("ТипОснования") Тогда
				ВызватьИсключение "Ошибка ввода на основании. Обратитесь к разработчику!";
				Возврат;
			КонецЕсли;	
			
			#Область Ввод_на_основании_CW_РасходыПоГрузоперевозке
			Если ДанныеЗаполнения.ТипОснования = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
				
				ВидОперации = ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг");
				
				Организация	= ДанныеЗаполнения.Организация;
				Дата		= ДанныеЗаполнения.ДатаДокумента;
				Контрагент	= ДанныеЗаполнения.Контрагент;
				Договор		= ДанныеЗаполнения.Договор;
				
				//Подсистема.УчетПриложенийДоговоров
				ПриложениеКДоговору 	= ДанныеЗаполнения.ПриложениеКДоговору;
				//Подсистема.УчетПриложенийДоговоров
				
				Если ЗначениеЗаполнено(ПриложениеКДоговору) Тогда
					Валюта =	ПриложениеКДоговору.ВалютаДоговора;
				Иначе
					Валюта = 	Договор.ВалютаДоговора;
				КонецЕсли;
				
				ВалютаИсточника = ДанныеЗаполнения.ДокументОснование.Валюта;
				ДатаИсточника	= ДанныеЗаполнения.ДокументОснование.Дата;
				
				//Для версии КОРП
				ВестиУчетПоПодразделениям	= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
				Если ВестиУчетПоПодразделениям Тогда
					ПодразделениеОрганизации = ДанныеЗаполнения.ДокументОснование.ПодразделениеОрганизации;
				КонецЕсли;
				//Для версии КОРП
				
				ФормируетсяСчет		= ДанныеЗаполнения.ДокументОснование.ПредъявленСчет И CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Счета");
				
				ФормируетсяАкт 	= ДанныеЗаполнения.ДокументОснование.ПредъявленАкт И CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Акты");
				
				Если ФормируетсяАкт Тогда
					ФормируетсяСчетФактура 		= ДанныеЗаполнения.ДокументОснование.ПредъявленСФ;
				Иначе
					ФормируетсяСчетФактура = Ложь;
				КонецЕсли; 
				
				Если ДанныеЗаполнения.ПервичныеДокументы = 1 Тогда
					Если ФормируетсяСчет Тогда 
						ДатаСчета = ДанныеЗаполнения.ДокументОснование.ДатаСчета; 
					КонецЕсли;
					Если ФормируетсяАкт Тогда 
						ДатаАкта = ДанныеЗаполнения.ДокументОснование.ДатаАкта; 
					КонецЕсли;
					Если ФормируетсяСчетФактура Тогда 
						ДатаСчетаФактуры = ДанныеЗаполнения.ДокументОснование.ДатаСФ; 
					КонецЕсли;
				Иначе
					//Тут можно предцсмотреть заполнение реквизитов
					//первичных документов из формы ввода на основании
				КонецЕсли;
				
				СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
				СтруктураПараметров.Дата 				= Дата;
				СтруктураПараметров.Договор 			= Договор;
				СтруктураПараметров.ПриложениеКДоговору = ПриложениеКДоговору;
				
				ПараметрыДоговора = CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
				СпособЗачетаАвансов		= ПараметрыДоговора.ПорядокЗачетаАвансов;
				ПорядокЗачетаАвансовОЗ 	= ПараметрыДоговора.ПорядокЗачетаАвансовОЗ;
				КодСпособаВыставления 	= ПараметрыДоговора.ОсновнойКодСпособаВыставленияСчетовФактур;
				
				ТаблицаУслуг = Документы.CW_ДоходыПоГрузоперевозке.Услуги_СформироватьПоДокументуРасходов(ДанныеЗаполнения.ДокументОснование,Договор,ПриложениеКДоговору, ДанныеЗаполнения.ПорядокОтраженияЗатрат,ДанныеЗаполнения.ПорядокОтраженияДоходов);
				
				// анализируем
				ПересчетЧерезРубли = Ложь;
				
				// если валюта документов одинаковая
				Если ВалютаИсточника = Валюта Тогда
					// если рубли
					Если Валюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
						ПересчетЧерезРубли = Ложь;
					Иначе
						
						// проверяем даты документов и порядок отражения
						Если  ДанныеЗаполнения.ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам Тогда
							ПересчетЧерезРубли = Ложь;
						ИначеЕсли  ДанныеЗаполнения.ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление Тогда 
							// проверяем даты
							Если НачалоДня(Дата)= НачалоДня(ДатаИсточника) Тогда
								ПересчетЧерезРубли = Ложь;
							Иначе
								ПересчетЧерезРубли = Истина;
							КонецЕсли; 
						КонецЕсли; 
						
					КонецЕсли; 
					
				Иначе
					ПересчетЧерезРубли = Истина;
				КонецЕсли; 
				
				// проверяем необходимость формировать вознаграждение		
				ТребуетсяВознаграждение = ДанныеЗаполнения.ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление И ПараметрыДоговора.АвтоматическийРасчетВознаграждения 
				И ПараметрыДоговора.МоментАвтоматическогоВыставленияВознаграждения = Перечисления.CW_МоментАвтоматическогоВыставленияВознаграждения.ПриПеревыставлении;
				
				Если ПересчетЧерезРубли Тогда
					СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(Валюта,?(ДатаАкта=Дата(1,1,1),Дата,ДатаАкта));
					Документы.CW_ДоходыПоГрузоперевозке.Услуги_ПересчитатьИзВалютыРегламентированногоУчета(ТаблицаУслуг,СтруктураКурса);
				КонецЕсли; 
				
				Если ТребуетсяВознаграждение Тогда
					ТаблицаУслуг.Колонки.Добавить("База");
					Документы.CW_ДоходыПоГрузоперевозке.Услуги_ДобавитьВознаграждение(ТаблицаУслуг,Договор,ПриложениеКДоговору, ПараметрыДоговора,Дата);
				КонецЕсли; 
				
				// если надо формируем новое представление
				флЗановоФормироватьПредставлениеПриПеревыставленииЗатрат = CW_Настройки.ПараметрУчетнойПолитики(Дата, Организация, "ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат");
				Если флЗановоФормироватьПредставлениеПриПеревыставленииЗатрат Тогда
					Документы.CW_ДоходыПоГрузоперевозке.Услуги_СформироватьПредставлениеНоменклатуры(ТаблицаУслуг,Договор,ЭтотОбъект,флЗановоФормироватьПредставлениеПриПеревыставленииЗатрат);
				КонецЕсли; 
				
				//Поставим цены из протокола согласования
				Документы.CW_ДоходыПоГрузоперевозке.Услуги_УстновитьЦенуУслугПоПротоколуСогласованияЦен(ТаблицаУслуг, ЭтотОбъект);		
				
				// --- 
				Услуги.Загрузить(ТаблицаУслуг);
				
				//Зависимые услуги
				CW_Подписки.ДобавитьДополнительнуюУслугу(ЭтотОбъект);
				//Зависимые услуги
				
			КонецЕсли; 
			#КонецОбласти
			
			#Область Ввод_на_основании_CW_ДоходыПоГрузоперевозке
			Если ДанныеЗаполнения.ТипОснования = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
				
				Если Не ДанныеЗаполнения.Свойство("РежимВвода") Тогда
					//Для ввода доходов предусмотрено два режима
					ВызватьИсключение "Ошибка ввода на основании. Обратитесь к разработчику!";
				КонецЕсли;
				
				СохранитьДату = CW_Настройки.ПолучитьНастройкуПользователя(,"УстанавливатьДатуАктаРавнойДатеСчетаПриВводеНаОснованииДоходы");
				
				РежимВводаНаОсновании = ДанныеЗаполнения.РежимВвода;
				
				ДокументОснование = ДанныеЗаполнения.ДокументОснование;
				
				// заполняем
				ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДокументОснование,,"ВедомыйСчет,ВедомыйДокумент,ВедомыйСчетФактура,Дата");
				
				СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
				СтруктураПараметров.Дата 				= Дата;
				СтруктураПараметров.Договор 			= Договор;
				СтруктураПараметров.ПриложениеКДоговору = ПриложениеКДоговору;
				
				СтрокаИменПараметров = 	"РазмерАгентскогоВознаграждения;ВариантРасчетаВознаграждения;СтавкаНДС;"+
										"ПорядокЗачетаАвансов;ПорядокЗачетаАвансовОЗ;Номенклатура;"+
										"АвтоматическийРасчетВознаграждения;МоментАвтоматическогоВыставленияВознаграждения;ОсновнойКодСпособаВыставленияСчетовФактур";
		
				ПараметрыДоговора 		= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров,СтрокаИменПараметров);
				СпособЗачетаАвансов 	= ПараметрыДоговора.ПорядокЗачетаАвансов;
				КодСпособаВыставления 	= ПараметрыДоговора.ОсновнойКодСпособаВыставленияСчетовФактур;

				
				Если СохранитьДату тогда
					Дата = ДокументОснование.Дата;
				КонецЕсли;
				
				// сбрасываем номер 
				Номер = "";
				
				Если РежимВводаНаОсновании = "СоздатьАкт" Тогда
					
					ВидОперации = Перечисления.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг;
	
					ФормируетсяСчет 	= Ложь;
					НомерСчета 			= "";
					ДатаСчета 			= Неопределено;
					
					ФормируетсяАкт		= Истина;
					НомерАкта 			= "";
					ДатаАкта 			= Неопределено;
					
					// --- 
					КопироватьНомер = CW_Настройки.ПолучитьНастройкуПользователя(,"КопироватьНомерПриВводеАктаНаОснованииСчета");
					Если КопироватьНомер=Неопределено Тогда
						КопироватьНомер = Ложь;
					КонецЕсли; 
					Если КопироватьНомер Тогда
						НомерАкта = ДокументОснование.НомерСчета;
						ДатаАкта = ТекущаяДата();
					КонецЕсли; 
					
					ФормируетсяСчетФактура = НастройкиПользователя.Доходы_ФормироватьСчетФактуру;
					НомерСчетаФактуры = "";
					ДатаСчетаФактуры = Дата(1,1,1);
					Если ФормируетсяСчетФактура Тогда
						
						КопироватьНомерДляСФ = CW_Настройки.ПолучитьНастройкуПользователя(,"КопироватьНомерПриВводеСчетаФактурыНаОснованииСчета");
						Если КопироватьНомерДляСФ = Неопределено Тогда
							КопироватьНомерДляСФ = Ложь;
						КонецЕсли; 
						Если КопироватьНомерДляСФ Тогда
							НомерСчетаФактуры = НомерАкта;
							ДатаСчетаФактуры = ДатаАкта;
						КонецЕсли; 
					КонецЕсли;
					
					// акт на основании счета
					Счет 			= ДокументОснование;
					СписокСчетов 	= Ложь;
					
					Услуги.Загрузить(ДокументОснование.Услуги.Выгрузить());
				КонецЕсли;
				
				Если РежимВводаНаОсновании = "СоздатьВознагражение" Тогда
					
					ВидОперации = Перечисления.CW_ВидыОперацийДоходыПоГрузоперевозке.ОтчетАгента;

					ФормируетсяСчет 	= ДокументОснование.ФормируетсяСчет;
					НомерСчета 			= "";
					ДатаСчета 			= Неопределено;
					
					ФормируетсяАкт 		= ДокументОснование.ФормируетсяАкт;
					НомерАкта 			= "";
					ДатаАкта 			= Неопределено;
					
					ФормируетсяСчетФактура 		= ДокументОснование.ФормируетсяСчетФактура;
					НомерСчетаФактуры 			= "";
					ДатаСчетаФактуры 			= Неопределено;
					
					ВедомыйДокумент 	= Неопределено;
					ВедомыйСчет 		= Неопределено;
					ВедомыйСчетФактура 	= Неопределено;
					
					мДокументы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОснование);
					ЗаполнитьТабличнуюЧастьВознаграждение(мДокументы, ПараметрыДоговора.Номенклатура, ПараметрыДоговора, ДокументОснование);
					
					
				КонецЕсли;
				
				//Зависимые услуги
				CW_Подписки.ДобавитьДополнительнуюУслугу(ЭтотОбъект);
				//Зависимые услуги

			Конецесли;
			#КонецОбласти
			
		КонецЕсли; 
	КонецЕсли; 
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
		
		//Проверим параметры договора
		СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметров.Дата 				= ДанныеЗаполнения.Дата;
		СтруктураПараметров.Договор 			= ДанныеЗаполнения.Договор;
		СтруктураПараметров.ПриложениеКДоговору = ДанныеЗаполнения.ПриложениеКДоговору;

		СтрокаИменПараметров = 	"РазмерАгентскогоВознаграждения;ВариантРасчетаВознаграждения;СтавкаНДС;"+
								"ПорядокЗачетаАвансов;ПорядокЗачетаАвансовОЗ;Номенклатура;"+
								"АвтоматическийРасчетВознаграждения;МоментАвтоматическогоВыставленияВознаграждения";
		
		ДанныеПараметровДоговора = CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, СтрокаИменПараметров);
		
		Если ДанныеПараметровДоговора.АвтоматическийРасчетВознаграждения и 
			ДанныеПараметровДоговора.МоментАвтоматическогоВыставленияВознаграждения = Перечисления.CW_МоментАвтоматическогоВыставленияВознаграждения.ОтдельнымДокументом Тогда
			//Заполняем вознаграждение экспедитора
			СформироватьВознаграждениеЭкспедитра(ДанныеЗаполнения,ДанныеПараметровДоговора);
		Иначе
			ВызватьИсключение "Ввод на основании доступен только для договоров с автоматическим расчетом вознаграждения и его вводом отдельным документом!";
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ВедомыйДокумент 			= Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	ВедомыйСчет 				= Документы.СчетНаОплатуПокупателю.ПустаяСсылка();
	ВедомыйСчетФактура 			= Документы.СчетФактураВыданный.ПустаяСсылка();
	ИдентификаторГосКонтракта 	= "";
	РабочиеДатаВремя 			= CW_Документы.РабочееВремя();
	ОтредактированыДокументыОтгрузки = Ложь;
	ДокументыОбОтгрузке.Очистить();
	
	
	ЗачетАвансов.Очистить();
	ЗачетАвансовОЗ.Очистить();
	ПлатёжноРасчётныеДокументы.Очистить();
	
	// ---------------------------------------------------------------------------- 
	
	НП = CW_Настройки.ПолучитьНастройкиПользователя();
	УстанавливатьТекущееВремя = НП.ПриКопированниУстанавливатьТекущееВремя;
	УстанавливатьТекущееВремя = ?(УстанавливатьТекущееВремя=Неопределено, Ложь, УстанавливатьТекущееВремя);
	
	Дата = ?(УстанавливатьТекущееВремя,РабочиеДатаВремя,НачалоДня(РабочиеДатаВремя));
	
	Если (CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Счета")) Тогда
		ФормируетсяСчет=НП.Доходы_ФормироватьСчет;
	Иначе
		ФормируетсяСчет = Ложь;
	КонецЕсли; 
	НомерСчета = "";
	ДатаСчета = Дата(1,1,1);
	
	// --- 
	
	Если (CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Акты")) Тогда
		
		ФормируетсяАкт=НП.Доходы_ФормироватьАкт;
		
		// --- 
		ФормируетсяСчетФактура=НП.Доходы_ФормироватьСчетФактуру;
		
	Иначе
		
		ФормируетсяАкт = Ложь;
		ФормируетсяСчетФактура = Ложь;
		
	КонецЕсли; 
	НомерАкта = "";
	ДатаАкта = Дата(1,1,1);
	НомерСчетаФактуры = "";
	ДатаСчетаФактуры = Дата(1,1,1);	
	
	Ответственный = Неопределено;
	
	//СрокОплаты = Дата(1,1,1);
	//СрокОплатыОписание = "";	
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПорядокПрисвоенияНомеров = CW_Настройки.ПараметрУчетнойПолитики(Дата,Организация,"ПорядокПрисвоенияНомеров");
	// --- 
	Если (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) Тогда
		Префикс = СокрЛП(Организация.Префикс)+Строка(Формат(Дата,"ДФ=ММ"))+ Строка(Формат(Дата,"ДФ=dd"))+"-";
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация) Тогда
		Префикс = CW_Документы.ПрефиксОрганизации(Организация);
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда 
		Префикс = CW_Документы.ПрефиксОрганизации(Организация);
	ИначеЕсли (ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда 
		
		// проверки
		Нумератор = CW_Настройки.ПараметрУчетнойПолитики(Дата,Организация,"ВнешнийНумератор");
		// --- 
		ОбработкаНумерации = _ПО.ПолучитьОбработку(Нумератор);
		ОбработкаНумерации.УстановитьНомерДокумента(ЭтотОбъект,СтандартнаяОбработка,Префикс);
		
	Иначе
		
		Префикс = CW_Документы.ПрефиксОрганизации(Организация);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// обмен данными
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	// контроль наличия общих параметров
	Если НЕ ЗаполненыОбщиеПараметры() Тогда 
		СформироватьОбщиеПараметры();
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Очистить();
	
	// получим необходимые права и опции пользователя
	РазрешитьПроведениеДокументовБезГрузоперевозок 	= CW_ПраваДоступа.ПравоДоступно("РазрешитьПроведениеДокументовБезГрузоперевозок");
	КонтролироватьСтрокиСНулевойСуммой 				= CW_Настройки.ПолучитьНастройкуПользователя(,"КонтролироватьСтрокиСНулевойСуммой");
	
	// проверка реквизитов
	флОшибка = Ложь;
	МассивСообщений = Новый Массив;
	
	Если Организация.Пустая() Тогда
		флОшибка = Истина;
		МассивСообщений.Добавить("Не указана организация!");
	КонецЕсли; 
	
	Если Контрагент.Пустая() Тогда
		флОшибка = Истина;
		МассивСообщений.Добавить("Не указан контрагент!");
	КонецЕсли; 
	
	Если Договор.Пустая() Тогда
		флОшибка = Истина;
		МассивСообщений.Добавить("Не указан договор контрагента!");
	КонецЕсли; 
	
	ДатаНачалаВеденияУчета = CW_Настройки.ПолучитьДатуНачалаВеденияУчета(Организация);
	
	Если НЕ ДатаНачалаВеденияУчета = Неопределено Тогда
		РежимВводНачальныхОстатков = Ложь;		
		Если Дата < ДатаНачалаВеденияУчета Тогда		
			РежимВводНачальныхОстатков = Истина;
		Иначе
			РежимВводНачальныхОстатков = Ложь;
		КонецЕсли;
	Иначе
		РежимВводНачальныхОстатков = Ложь;	
	КонецЕсли;
	
	Для каждого Стр Из Услуги Цикл
		
		Если Стр.Номенклатура.Пустая() Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не указана номенклатура услуги!");
		Иначе 
			Если ВидОперации = Перечисления.CW_ВидыОперацийДоходыПоГрузоперевозке.ОтчетАгента Тогда 
				// допустима только номенклатура агентского вознаграждения
				Если Стр.Номенклатура<>ДС.ПД.Номенклатура Тогда 
					флОшибка = Истина;
					МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг номенклатура отличается от указанной в параметрах договора услуги!");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если CW_Настройки.ПолучитьНастройкуПользователя(, "ПроверятьНоменклатурнуюГруппу") И Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга Тогда
			Если НЕ ЗначениеЗаполнено(Стр.Номенклатура.НоменклатурнаяГруппа) Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("У номенклатуры в строке " + Стр.НомерСтроки + " отсутствует номенклатурная группа!");
			КонецЕсли;
		КонецЕсли;	
		
		Если ПолучитьФункциональнуюОпцию("CW_ОтображатьСтатьюЗатратВДокументахПоРасходамДоходам") Тогда
			Если Стр.СтатьяЗатрат.Пустая() и Стр.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга") Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не указана статья затрат!");
			КонецЕсли;
		КонецЕсли;
	
		Если НЕ РазрешитьПроведениеДокументовБезГрузоперевозок Тогда
			
			Если РежимВводНачальныхОстатков Тогда
				Если Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление ИЛИ Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам Тогда
					Если НЕ ЗначениеЗаполнено(Стр.Грузоперевозка) Тогда
						флОшибка = Истина;
						МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не указана грузоперевозка!");
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если НЕ ЗначениеЗаполнено(Стр.Грузоперевозка) Тогда
					флОшибка = Истина;
					МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не указана грузоперевозка!");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Стр.ПорядокОтражения) Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не указан порядок отражения!");
		КонецЕсли;
		
		// проверим необходимость заполнения документа затрат
		флНеобходимДокументЗатрат = Ложь;
		
		// документ затрат требуется только для бухгалтерских документов (акт, с\ф)
		Если ФормируетсяАкт Тогда
			
			// перевыставление
			Если Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление Тогда 
				флНеобходимДокументЗатрат = Истина;	
				
			// отчет агента с автоматическим расчетом вознаграждения по договору
			Иначе 
				Если ДС.ПД.АвтоматическийРасчетВознаграждения = Истина И ВидОперации = Перечисления.CW_ВидыОперацийДоходыПоГрузоперевозке.ОтчетАгента Тогда 
					Если ДС.ПД.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ПроцентОтСуммы Тогда 
						Если Стр.Номенклатура = ДС.ПД.Номенклатура Тогда 
							флНеобходимДокументЗатрат = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
		Если флНеобходимДокументЗатрат И НЕ ЗначениеЗаполнено(Стр.ДокументРасходов) Тогда 
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не заполнен документ затрат!");
		КонецЕсли;

		// проверим заполнение реквизитов для ТЧ "Услуги"
		Если (НЕ Корректировка) Тогда
			
			Если Стр.Количество = 0 Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не указано количество!");
			КонецЕсли;
			
			Если Стр.Цена = 0 и КонтролироватьСтрокиСНулевойСуммой Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не указана цена!");
			КонецЕсли;
			
			Если Стр.Сумма = 0 и КонтролироватьСтрокиСНулевойСуммой Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не указана сумма!");
			КонецЕсли;
			
			Если Стр.СтавкаНДС.Пустая() Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не указана ставка НДС!");
			КонецЕсли;
			
			Если (Стр.НДС = 0) И 
				 (Стр.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС) И 
				 (Стр.СтавкаНДС <> Перечисления.СтавкиНДС.НДС0) И 
				 КонтролироватьСтрокиСНулевойСуммой
			Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не указана сумма НДС!");
			КонецЕсли;
			
			Если Стр.Всего = 0 и КонтролироватьСтрокиСНулевойСуммой Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы услуг не указана сумма всего!");
			КонецЕсли;
			
		КонецЕсли; 
		
		ГП = Стр.Грузоперевозка;
		ТП = Стр.Грузоперевозка.ТипПеревозки;
		Если ЗначениеЗаполнено(ТП) Тогда
			Если (ТП.КонтрольЗаполненияКлиентаДоходы И НЕ ЗначениеЗаполнено(ГП.Клиент)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Клиент""");
				флОшибка = Истина;
			КонецЕсли; 
			
			Если (ТП.КонтрольЗаполненияТипоразмераДоходы И НЕ ЗначениеЗаполнено(ГП.Типоразмер)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Типоразмер контейнера""");
				флОшибка = Истина;
			КонецЕсли; 
			
			Если (ТП.КонтрольЗаполненияГрузаДоходы И Константы.CW_Мониторинг_Груз.Получить() И НЕ ЗначениеЗаполнено(ГП.Груз)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Груз""");
				флОшибка = Истина;
			КонецЕсли; 
			
			Если (ТП.КонтрольЗаполненияМаршрутаДоходы И Константы.CW_Мониторинг_Маршрут.Получить() И НЕ ЗначениеЗаполнено(ГП.Маршрут)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Маршрут""");
				флОшибка = Истина;
			КонецЕсли; 
						
			Если (ТП.КонтрольЗаполненияМенеджераПродажДоходы И Константы.CW_Мониторинг_МенеджерПродаж.Получить() И НЕ ЗначениеЗаполнено(ГП.МенеджерПродаж)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Менеджер продаж""");
				флОшибка = Истина;
			КонецЕсли; 
						
			Если (ТП.КонтрольЗаполненияОперативногоМенеджераДоходы И Константы.CW_Мониторинг_ОперативныйМенеджер.Получить() И НЕ ЗначениеЗаполнено(ГП.ОперативныйМенеджер)) Тогда
				МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный реквизит ""Оперативный менеджер""");
				флОшибка = Истина;
			КонецЕсли; 
			
			Отбор = Новый Структура("КонтрольЗаполненияДоходы", Истина);
			КонтроллируемыеПараметры = ТП.ПараметрыГрузоперевозки.Выгрузить(Отбор);
			СоответствиеСвойствПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
			Для Каждого СтрП Из КонтроллируемыеПараметры Цикл
				флПараметрНезаполнен = Ложь;
				ОтборПоПараметру = Новый Структура("Параметр", СтрП.Параметр);
				СтрокаПараметра = _сф.к_НайтиСтроку(ГП.ПараметрыГрузоперевозки, ОтборПоПараметру);
				СП = СоответствиеСвойствПараметров.Получить(СтрП.Параметр);
				Если (СтрокаПараметра = Неопределено) Тогда
					флПараметрНезаполнен = Истина;
				Иначе
					Если (СП.ЭтоКонтрольнаяДата) Тогда
						Если (НЕ ЗначениеЗаполнено(СтрокаПараметра.ЗначениеФакт)) Тогда
							флПараметрНезаполнен = Истина;
						КонецЕсли; 
					Иначе
						Если (НЕ ЗначениеЗаполнено(СтрокаПараметра.Значение)) Тогда
							флПараметрНезаполнен = Истина;
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли; 
				
				Если (флПараметрНезаполнен) Тогда
					МассивСообщений.Добавить("У грузоперевозки в строке " + Стр.НомерСтроки + " не заполнен обязательный параметр """ + СП.Наименование + """");
					флОшибка = Истина;
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если флОшибка Тогда
		
		Для каждого Стр Из МассивСообщений Цикл
			Сообщить(Стр,СтатусСообщения.Внимание);
		КонецЦикла; 
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если (РучнаяКорректировка) Тогда 
		Возврат; 
	КонецЕсли; 

	//Для версии КОРП 
	ВестиУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для версии КОРП 
	
	//Подситема.СтатусыДокументов
	СтатусДокумента = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента", СтатусДокумента);
	
	СтатусДокументаПроводитьПоБухгалтерскомуУчету = CW_СтатусыДокументовСервер.ПолучитьПризнакПроведенияПоБухгалтерскомуУчету(Ссылка, СтатусДокумента);
	//Подситема.СтатусыДокументов
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 					Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",			ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	
	ПровестиПоБухгалтерскомуУчету = СтатусДокументаПроводитьПоБухгалтерскомуУчету и ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет;
	
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"СтатусПроведенияДоПроведения", Проведен);
	
	// проверка прав
	ПроведениеРазрешено = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов");
	Если (Корректировка) Тогда
		ПроведениеРазрешено = ПроведениеРазрешено И CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Корректировки");
	КонецЕсли; 
	Если (НЕ ПроведениеРазрешено) Тогда
		Отказ = Истина;
		Сообщить("Недостаточно прав на проведение документа!");
		Возврат;
	КонецЕсли; 
	
	//Контроль услуг по договору
	Если ПолучитьФункциональнуюОпцию("CW_ОграничиватьУслугиПоДоговорам") и Договор.ОграничиватьНоменклатуру Тогда	
		
		ДатаДокумента = Дата;
		Если ФормируетсяАкт 
			и ЗначениеЗаполнено(ДатаАкта) Тогда
			ДатаДокумента = ДатаАкта;  
		ИначеЕсли ФормируетсяСчет 
			и ЗначениеЗаполнено(ДатаСчета) Тогда
			ДатаДокумента = ДатаСчета;  
		КонецЕсли;
	
		АдресУслуг = _УФС.ОбновитьСписокУслугПоДоговору(ДатаДокумента, Договор);
		Если ЭтоАдресВременногоХранилища(АдресУслуг) Тогда
			ТаблицаУслугДоговора 	= ПолучитьИзВременногоХранилища(АдресУслуг);
			МассивУслугДоговора 	= ТаблицаУслугДоговора.ВыгрузитьКолонку("Номенклатура"); 
			
			ИсключитьПеревыставление = Константы.CW_НеОграничиватьСписокУслугПриПеревыставленииЗатрат.Получить();
			МассивУслугДокумента 	 = ПолучитьМассивУслугДокумента(ИсключитьПеревыставление);
			
			CW_Документы.ПроверитьСоответствиеУслугПоДоговору(МассивУслугДоговора, МассивУслугДокумента, Отказ);
			
		КонецЕсли;
		
		Если Отказ тогда
			Возврат;
		Конецесли;
		
	КонецЕсли;		
		
	// контроль загрузки
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	// не перепроводим при восстановлении последовательности
	ВосстановлениеПоследовательности = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ПроведенВХронологическойПоследовательности");
	Если (ВосстановлениеПоследовательности <> Неопределено) Тогда
		Если (ВосстановлениеПоследовательности) Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	Если (ПровестиПоБухгалтерскомуУчету) Тогда
		CW_Финансы.ПредупреждениеПоСхемеУчетаПеревыставленияПоСтавкам(ЭтотОбъект);	
	КонецЕсли; 
	
	// контроль наличия общих параметров
	Если НЕ ЗаполненыОбщиеПараметры() Тогда 
		СформироватьОбщиеПараметры(,Ложь); 
	КонецЕсли; 
	
	// если изменились даты начала ведения учета, то обновим соответствующие флаги
	// (при условии того, что в документе указана организация и договор)
	Если ЗначениеЗаполнено(Организация) и ЗначениеЗаполнено(Организация) Тогда
		Если ВводОстатковБУ <> ДополнительныеСвойства.УП.ВводОстатковБУ Тогда
			ВводОстатковБУ = ДополнительныеСвойства.УП.ВводОстатковБУ;	
		КонецЕсли; 
		Если ВводОстатковОЗ <> ДополнительныеСвойства.УП.ВводОстатковОЗ Тогда
			ВводОстатковОЗ = ДополнительныеСвойства.УП.ВводОстатковОЗ;	
		КонецЕсли; 	
	Иначе
		ВводОстатковБУ = Ложь;
		ВводОстатковОЗ = Ложь;
	КонецЕсли; 
	
	// фиксируем режим записи
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"РежимЗаписи",РежимЗаписи);
	
	// проверка распроведения счетов с актами и оплатами (только для базовой валюты "Рубль")
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ЭтоСчет 	= ФормируетсяСчет;
		ЭтоАкт 		= Не ФормируетсяСчет и (ФормируетсяАкт или ФормируетсяСчетФактура);
		ЭтоПакет 	= ФормируетсяСчет и (ФормируетсяАкт или ФормируетсяСчетФактура);
		
		// получим значение базовой валюты
		БазоваяВалютаРубль = Константы.CW_ВалютаРегламентированногоУчетаРубль.Получить();
		
		ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов");
		
		РедактированиеСчета 				= CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Счета");
		РедактированиеАктированныхСчетов 	= CW_ПраваДоступа.ПравоДоступно("РазрешитьРедактированиеИсходящихАктированныхСчетов") 	И РедактированиеСчета;
		РедактированиеОплаченныхСчетов 		= CW_ПраваДоступа.ПравоДоступно("РазрешитьРедактированиеИсходящихОплаченныхСчетов") 	И РедактированиеСчета;
		
		// проверяем, ведётся ли оперативная задолженность
	//	Если ДС.УП.ОЗ И НЕ ЭтоПакет Тогда
		Если ДС.УП.ОЗ Тогда
			
			Если Корректировка и ПравоРедактирования Тогда
				ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Корректировки");
			КонецЕсли;
			
			Если ЭтоАкт И ПравоРедактирования Тогда
				ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_Доходы_Акты");
			Конецесли;
			
			Если ПравоРедактирования И ЭтоСчет и РедактированиеСчета и БазоваяВалютаРубль Тогда
				
				Если Не РедактированиеАктированныхСчетов и ПравоРедактирования Тогда
					// проверяем, что нет сформированных актов
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	CW_СоответствиеАктовИсходящимСчетам.Акт КАК Акт
					|ИЗ
					|	РегистрСведений.CW_СоответствиеАктовИсходящимСчетам КАК CW_СоответствиеАктовИсходящимСчетам
					|ГДЕ
					|	CW_СоответствиеАктовИсходящимСчетам.Счет = &Счет";
					
					Запрос.УстановитьПараметр("Счет", Ссылка);
					РезультатЗапроса = Запрос.Выполнить();
					
					ПравоРедактирования = РезультатЗапроса.Пустой();
				КонецЕсли;
				
				Если Не РедактированиеОплаченныхСчетов и ПравоРедактирования Тогда
					// проверяем, нет ли оплат
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					|	CW_ОплатаИсходящихДокументов.ДокументОплаты КАК ДокументОплаты
					|ИЗ
					|	РегистрСведений.CW_ОплатаИсходящихДокументов КАК CW_ОплатаИсходящихДокументов
					|ГДЕ
					|	CW_ОплатаИсходящихДокументов.Документ = &Документ";
					Запрос.УстановитьПараметр("Документ", Ссылка);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ПравоРедактирования = РезультатЗапроса.Пустой();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ПравоРедактирования Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				ТекстСообщения = "Недостаточно прав для отмены проведения документа!";
			КонецЕсли;
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				ТекстСообщения = "Недостаточно прав для проведения документа!";
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;

	// контроль номенклатурной группы
	ЕстьОшибкиНоменклатурнойГруппы = Ложь;
	Для Каждого Стр Из Услуги Цикл
		Если стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга Тогда
			Если Стр.Номенклатура.НоменклатурнаяГруппа.Пустая() Тогда
				Если CW_Настройки.ПолучитьНастройкуПользователя(,"ПроверятьНоменклатурнуюГруппу") Тогда
					Сообщить("У номенклатуры в строке " + Стр.НомерСтроки + " отсутствует номенклатурная группа!", СтатусСообщения.Важное); 
					ЕстьОшибкиНоменклатурнойГруппы = Истина;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОшибкиНоменклатурнойГруппы Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	// Контроль срока договора/приложения 
	СтруктураПараметров = CW_Документы.ПустаяСтруктураКонтроляСрокаДействияДоговора(); 
	СтруктураПараметров.КонтролироватьСрокДоговоров 	= ДС.НП.КонтролироватьСрокДоговоров;
	СтруктураПараметров.КонтролироватьСрокПриложения 	= ДС.НП.КонтролироватьСрокДействияПриложения; 
	
	CW_Документы.ПроверитьСрокДействияДоговора(ЭтотОбъект, СтруктураПараметров, Отказ);
	
	
	// считаем суммы документа
	Если (НЕ Корректировка) Тогда
		
		СуммаДокумента = _сф.Итог(Услуги,"Всего");
		СуммаНДС = _сф.Итог(Услуги,"НДС");
		
	Иначе
		
		пСуммаДокумента = 0;
		пСуммаНДС = 0;
		// --- 
		Для каждого Стр Из Услуги Цикл
			
			_сф.Инкремент(пСуммаДокумента,Стр.Всего - Стр.Всего_ДоКорректировки);
			_сф.Инкремент(пСуммаНДС,Стр.НДС - Стр.НДС_ДоКорректировки);
			
		КонецЦикла; 
		// --- 
		СуммаДокумента = пСуммаДокумента;
		СуммаНДС = пСуммаНДС;
		
	КонецЕсли; 
	
	// проверка реквизитов ввода остатков для непомеченных на удаление
	Если (НЕ ПометкаУдаления) Тогда
		
		// признак ошибки
		флОшибка = Ложь;
		МассивСообщений = Новый Массив;
		
		// проверка корректности ввода остатков
		Если ВводОстатковБУ Тогда
			
			// проверяем, курс по взаиморасчетам
			Если (Договор.ВзаиморасчетыВУЕ И (КурсВзаиморасчетовБУ = 0) И
				((ФормируетсяАкт) Или (ФормируетсяСчетФактура)) И СальдоВзаиморасчетовБУ > 0) 	
			Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("Не указан курс взаиморасчётов по бухгалтерскому учету!");				
			КонецЕсли;	
			
		КонецЕсли; 
		
		Если ВводОстатковОЗ Тогда
			
			// проверяем, курс по взаиморасчетам (для валютных и у.е. взаиморасчетов)
			Если (СальдоВзаиморасчетовОЗ <> 0) И 
				(Валюта <> ДС.КО.ВалютаРегламентированногоУчета) И 
				(КурсВзаиморасчетовОЗ = 0) И
				(ФормируетсяСчет)  	
			Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("Не указан курс ввода остатков для оперативного учета задолженности!");				
			КонецЕсли;	
			
		КонецЕсли; 
		
		Если флОшибка Тогда
			
			Сообщить("Проверка перед записью " + ЭтотОбъект + ": ");
			Для каждого Стр Из МассивСообщений Цикл
				Сообщить(Стр,СтатусСообщения.Внимание);
			КонецЦикла; 
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли; 
		
	КонецЕсли; // проверка реквезитов ввода остатков
	
	// заполняем ответственного
	_сф.УстановитьЕслиНезаполнено(Ответственный,CW_Настройки.Пользователь());
	
	// формируем список контейнеров
	мГП = _сф.м_СоздатьИзКолонкиТЗ(Услуги.Выгрузить(,"Грузоперевозка"),"Грузоперевозка");
	нСписокГП  = _сф.м_Представление(мГП,",");
	Если нСписокГП <> СписокКонтейнеров Тогда
		СписокКонтейнеров = СтрЗаменить(нСписокГП,",",", ");
	КонецЕсли; 
			
	// для подстановки последнего договора записываем его в регистр
	CW_Документы.ЗаписатьПоследнийДоговор(Договор);
	
	НП = CW_Настройки.ПолучитьНастройкиПользователя();
	
	КонтроллироватьДатыПеревыставления = НП.ПредупреждатьОПеревыставленииРанееДокументовПоставщика;
	Если (КонтроллироватьДатыПеревыставления = Неопределено) Тогда
		КонтроллироватьДатыПеревыставления = Ложь;
	КонецЕсли; 
	КонтроллироватьДатыПеревыставления = КонтроллироватьДатыПеревыставления И ФормируетсяАкт И (РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение);
	СтаршаяДатаРасходов = Дата(1,1,1);
	
	// контроль логической целостности для счетов
	Если (ФормируетсяСчет) Тогда
		Счет = Неопределено;
		СписокСчетов = Ложь;
	КонецЕсли; 
	
	// перезаполняем счета задолженности
	СтруктураСчетов = CW_Финансы.СтруктураСчетовРасчетов_Клиенты(Дата,Организация,ДС);
	ЕстьПеревыставление = Ложь;
	ЕстьСобственные = Ложь;
	Для каждого Стр Из Услуги Цикл
		
		Если (НЕ СписокСчетов) Тогда
			Стр.Счет = Неопределено;
		КонецЕсли;
		
		Стр.СчетЗадолженности = CW_Финансы.ОпределитьСчетУчетаДоходов(Стр,СтруктураСчетов,Валюта <> ДС.КО.ВалютарегламентированногоУчета,Договор.ВзаиморасчетыВУЕ);
		
		Если (Стр.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга) Тогда
			ЕстьПеревыставление = Истина;
		Иначе
			ЕстьСобственные = Истина;
		КонецЕсли; 
		
		Если (КонтроллироватьДатыПеревыставления) Тогда
			
			Если (Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление) Тогда
				
				Если (Стр.ДокументРасходов.Дата > СтаршаяДатаРасходов) Тогда
					СтаршаяДатаРасходов = Стр.ДокументРасходов.Дата;
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// нумерация документов
	ПолитикаНумерации = ДС.УП.ПорядокПрисвоенияНомеров;
	
	// если номер документ пустой - устанавливаем
	Если (СокрЛП(Номер) = "") Тогда	
		УстановитьНовыйНомер();	
	КонецЕсли; 
	
	//Если (НЕ Ссылка.Пустая()) Тогда
	//	
	//	Если ЗначениеЗаполнено(УдалитьСрокОплаты) Тогда
	//		
	//		СтруктураДанных = Новый Структура("Счет,ДатаОплаты,Описание", Ссылка, УдалитьСрокОплаты, УдалитьСрокОплатыОписание);
	//		Ответ = CW_Документы.УстановитьСрокОплаты(СтруктураДанных);
	//		
	//		УдалитьСрокОплаты = Дата(1,1,1);
	//		УдалитьСрокОплатыОписание = "";
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли; 
	
	ФормироватьСчет = Ложь;
	ФормироватьАкт = Ложь;
	ФормироватьСчетФактуру = Ложь;
	
	// присвоение номеров и формирование ведомых документов
	Если (РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		// для внешнего нумератора
		Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда
			ОбработкаНумерации = _ПО.ПолучитьОбработку(ДС.УП.ВнешнийНумератор);
		КонецЕсли;
		
		// проверяем номера
		Если (НЕ ПроверкаНомеров(ПровестиПоБухгалтерскомуУчету)) Тогда 
			Отказ = Истина; 
			Возврат; 
		КонецЕсли;
		
		Если (НЕ Корректировка) Тогда
			
			// номер счета
			Если (ФормируетсяСчет) Тогда
				
				_сф.УстановитьЕслиНезаполнено(ДатаСчета,Дата);
				
				// синхронизация времени
				Если (НачалоДня(ДатаСчета) = НачалоДня(Дата)) Тогда
					ДатаСчета = Дата;
				КонецЕсли; 
				
				// формирование счета при условии того, что по договору ведется бухгалтерский учет
				Если ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет И ДС.УП.ФормироватьСчетаПокупателюНаОплату И ПровестиПоБухгалтерскомуУчету Тогда
					
					ФормироватьСчет = Истина;
					
					// если ссылка на документ "Счет" отсутствует, формирем новый документ,
					// иначе получаем ранее созданный
					Если ((ВедомыйСчет.Пустая()) ИЛИ (НЕ _СФ.ОбъектБДСуществует(ВедомыйСчет))) Тогда
						НовыйВедомыйСчет = Документы.СчетНаОплатуПокупателю.СоздатьДокумент(); 
						НовыйВедомыйСчет.Контрагент 	= Контрагент;
						НовыйВедомыйСчет.Комментарий 	= "Сформировано автоматически (CW) документом ""Доходы по грузоперевозке"" №"+Номер+" от "+СокрЛП(Дата);
					Иначе
						НовыйВедомыйСчет = ВедомыйСчет.ПолучитьОбъект();
						НовыйВедомыйСчет.ПометкаУдаления = Ложь;
					КонецЕсли; 
					
					НовыйВедомыйСчет.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСчетаПокупателю.ТоварыИУслуги");
	
					// заполняем реквизиты счета  
					НовыйВедомыйСчет.Организация = Организация;
					//Удалено чтобы исключить дублирование номеров документов
					//НовыйВедомыйСчет.ОбменДанными.Загрузка = Истина;
					НовыйВедомыйСчет.Дата = ДатаСчета;
					
					НовыйВедомыйСчет.СуммаВключаетНДС = ЦенаСНДС;
					
					//Для версии КОРП
					Если ВестиУчетПоПодразделениям Тогда
						НовыйВедомыйСчет.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП
					
					
					// присвоение номера счета
					Если (ЗначениеЗаполнено(НомерСчета)) Тогда
						НовыйВедомыйСчет.Номер = СокрЛП(НомерСчета);
					Иначе
						
						// для "сплошной" и "в пределах даты" ставим номер документа
						Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
							ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты Тогда
							
							НовыйВедомыйСчет.Номер = СокрЛП(Номер);
							НомерСчета = Номер;
							
						КонецЕсли; 
						
						// для независимой просто получаем номер
						Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда
							
							НовыйВедомыйСчет.УстановитьНовыйНомер();
							// --- 
							НомерСчета = НовыйВедомыйСчет.Номер;
							
						КонецЕсли;
						
						// внешний нумератор
						Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда
							
							ОбработкаНумерации.УстановитьНомерСчета(ЭтотОбъект, НовыйВедомыйСчет);
							
						КонецЕсли; 
						
					КонецЕсли; 
					
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,НовыйВедомыйСчет);
					
					// проверяем (пытаемся записать) на возможность записи документа с указанным номером,
					// если в процессе записи возникла ошибка, то выходим из процедуры
					Отказ = CW_Документы.ПроверкаНомера(НовыйВедомыйСчет, РежимЗаписиДокумента.Запись, ЭтотОбъект.Ссылка,Ложь);
					Если Отказ Тогда 
						Возврат; 
					КонецЕсли;
					
					// записываем ссылку на счет в документ
					ВедомыйСчет = НовыйВедомыйСчет.Ссылка;	
					
				// по договору не ведется бухгалтерский учет
				Иначе
					
					Если (НЕ ЗначениеЗаполнено(НомерСчета)) Тогда
						
						// для "сплошной" и "в пределах даты" ставим номер документа
						Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
							ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты Тогда
							НомерСчета = Номер;
						ИначеЕсли ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор Тогда
							
							ОбработкаНумерации.УстановитьНомерСчета(ЭтотОбъект);
							
						Иначе
							Сообщить("Автонумерация счетов для договоров без признака бухгалтерского учёта поддерживается только для типов нумерации ""Сплошная"" и ""В пределах даты""");
							Отказ = Истина;
							Возврат;
						КонецЕсли; // проверка на возможность автоматического присвоения номера 
					КонецЕсли; // номер счета не заполнен
				КонецЕсли; // проверка что по договору ведется БУ и нужно формировать счет
			КонецЕсли; // признак формирования счета установлен 
			
			// номер акта	
			Если (ФормируетсяАкт) Тогда
				
				_сф.УстановитьЕслиНезаполнено(ДатаАкта,Дата);
				
				// синхронизация времени
				Если (НачалоДня(ДатаАкта)=НачалоДня(Дата)) Тогда
					ДатаАкта = Дата;
				КонецЕсли;
				
				Если (ПровестиПоБухгалтерскомуУчету) Тогда
					
					ФормироватьАкт = Истина;
					
					ТребуетсяСозданиеВедомого = Ложь;
					Если (ВедомыйДокумент.Пустая()) Тогда
						ТребуетсяСозданиеВедомого = Истина;
					КонецЕсли; 
					
					Если (НЕ ТребуетсяСозданиеВедомого) Тогда
						Если (НЕ _СФ.ОбъектБДСуществует(ВедомыйДокумент)) Тогда
							ТребуетсяСозданиеВедомого = Истина;
						КонецЕсли; 
					КонецЕсли; 
					
					Если (НЕ ЭтоНовый() И НЕ ТребуетсяСозданиеВедомого) Тогда
						
						// проверяем, не связан ли он уже с другим ведущим
						Ведущий = CW_Документы.ПолучитьВедущийДокумент(ВедомыйДокумент);
						Если (Ведущий = Неопределено ИЛИ Ведущий <> Ссылка) Тогда
							ТребуетсяСозданиеВедомого = Истина;
							ВедомыйДокумент = Неопределено;
							ВедомыйСчетФактура = Неопределено;
						КонецЕсли; 
					КонецЕсли; 
					
					Если (ТребуетсяСозданиеВедомого) Тогда
						НовыйВедомый = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
					Иначе
						НовыйВедомый = ВедомыйДокумент.ПолучитьОбъект();
						НовыйВедомый.ПометкаУдаления = Ложь;
					КонецЕсли;
					
					НовыйВедомый.Организация = Организация;
					НовыйВедомый.ОбменДанными.Загрузка=Истина;
					НовыйВедомый.Организация = Организация;
					НовыйВедомый.Дата = ДатаАкта;   
					
					НовыйВедомый.ЭтоУниверсальныйДокумент = ЭтоУниверсальныйДокумент;     
					
					НовыйВедомый.СопроводительныеДокументы = СопроводительныеДокументы;
					НовыйВедомый.СведенияОТранспортировкеИГрузе = СведенияОТранспортировкеИГрузе;
					
					//Для версии КОРП 
					Если ВестиУчетПоПодразделениям Тогда
						НовыйВедомый.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП 
					
					Если (ЗначениеЗаполнено(НомерАкта)) Тогда
						НовыйВедомый.Номер = НомерАкта;
					Иначе
						
						// для "сплошной" и "в пределах даты" ставим номер документа
						Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
							ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты 
							Тогда
							
							НовыйВедомый.Номер = СокрЛП(Номер);
							НомерАкта = Номер;
							
						КонецЕсли; 
						
						// для независимой просто получаем номер
						Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация Тогда
							
							НовыйВедомый.УстановитьНовыйНомер();
							НомерАкта = НовыйВедомый.Номер;
							
						КонецЕсли;
						
						// внешний нумератор
						Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда
							
							ОбработкаНумерации.УстановитьНомерАкта(ЭтотОбъект, НовыйВедомый);

						КонецЕсли; 
						
					КонецЕсли; 
					
					// проверим на возможность записи акта с данным номером 
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,НовыйВедомый);
					Отказ = CW_Документы.ПроверкаНомера(НовыйВедомый, РежимЗаписиДокумента.Запись, ЭтотОбъект, Ложь);
					Если Отказ Тогда 
						Возврат; 
					КонецЕсли;
					ВедомыйДокумент = НовыйВедомый.Ссылка;
					
					// номер счета-фактуры 
					Если (ФормируетсяСчетФактура) Тогда
						
						ФормироватьСчетФактуру = Истина;
						
						// если по каким-то причинам ссылка на счет-фактуру не была записана в ведущий документ
						Если (ВедомыйСчетФактура.Пустая()) Тогда
							ВедомыйСФ = CW_Финансы.НайтиВыданнуюСчетФактуру(ВедомыйДокумент);
							Если (ВедомыйСФ <> Неопределено) Тогда
								ВедомыйСчетФактура = ВедомыйСФ;
							КонецЕсли; 
						КонецЕсли; 
						
						// счет-фактура отсутствует
						Если (ВедомыйСчетФактура.Пустая() ИЛИ (НЕ _СФ.ОбъектБДСуществует(ВедомыйСчетФактура))) Тогда
							_сф.УстановитьЕслиНезаполнено(ДатаСчетаФактуры,ДатаАкта);
							НовыйСФ = Документы.СчетФактураВыданный.СоздатьДокумент(); 
						Иначе
							НовыйСФ = ВедомыйСчетФактура.ПолучитьОбъект();	
							Если НовыйСФ.ПометкаУдаления Тогда
								НовыйСФ.УстановитьПометкуУдаления(Ложь);
							КонецЕсли;
						КонецЕсли;
						
						НовыйСФ.Ответственный = Ответственный;

						// перезаполняем реквизиты счета-фактуры
						НовыйСФ.ВидСчетаФактуры=Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;
						НовыйСФ.Организация = Организация;
						НовыйСФ.Дата 		= ДатаСчетаФактуры;
						НовыйСФ.Контрагент 	= Контрагент;
						
						НовыйСФ.ДокументыОснования.Очистить();
						НовыйСФ.ДокументыОснования.Добавить().ДокументОснование = ВедомыйДокумент;
						НовыйСФ.ДокументОснование = ВедомыйДокумент;
						
						НовыйСФ.Выставлен = Истина;
						НовыйСФ.ДатаВыставления = ДатаСчетаФактуры;
						НовыйСФ.КодСпособаВыставления = КодСпособаВыставления;
						НовыйСФ.ОпределениеПараметровСчетаФактурыНаРеализацию();
						
						НовыйСФ.ОтредактированыДокументыОтгрузки = ОтредактированыДокументыОтгрузки;
						НовыйСФ.ДокументыОбОтгрузке.Очистить();
						НовыйСФ.ДокументыОбОтгрузке.Загрузить(ДокументыОбОтгрузке.Выгрузить());
						
						НовыйСФ.ИдентификаторГосКонтракта = ИдентификаторГосКонтракта; 
						
						//Подписанты "которые используется для вывода в печатную форму "Счет-фактура" Заявка AFR-233619     
						СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
						СтруктураПараметровДоговора.Дата 				= ДатаСчетаФактуры;
						СтруктураПараметровДоговора.Договор 			= Договор;
						СтруктураПараметровДоговора.ПриложениеКДоговору = ПриложениеКДоговору;
						
						ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора);
						Подписанты 			= CW_Печать.ВернутьПодписантов(Ссылка, ПараметрыДоговора);
						
						НовыйСФ.Руководитель 		= Подписанты.Руководитель;
						НовыйСФ.ГлавныйБухгалтер 	= Подписанты.ГлБух; 
						//Заявка AFR-233619 
						
						// --- 
						Если (ЗначениеЗаполнено(КодВидаОперации)) Тогда
							
							НовыйСФ.КодВидаОперации = КодВидаОперации;
							
						Иначе
							
							Если (НовыйСФ.Дата >= Дата(2016,07,1) И ЕстьСобственные И ЕстьПеревыставление) Тогда
								
								НовыйСФ.КодВидаОперации = "15";
								
							Иначе
								
								
								НовыйСФ.КодВидаОперации = "01";
								
								мКоды = Новый Массив;
								Если ЕстьСобственные Тогда  
									мКоды.Добавить("01");
								КонецЕсли; 
								
								Если ЕстьПеревыставление Тогда 
									мКоды.Добавить(ДС.УП.КодВидаОперацииДляИсходящихСчетовФактур);
								КонецЕсли; 
				
								НовыйСФ.КодВидаОперации = СтрСоединить(мКоды, ";");
								
							КонецЕсли; 
							
						КонецЕсли; 
						// --- 
						//НовыйСФ.ОбменДанными.Загрузка=Истина;
						
						// установка номера счета-фактуры
						Если (ЗначениеЗаполнено(НомерСчетаФактуры)) Тогда
							НовыйСФ.Номер = НомерСчетаФактуры;
							
							// пытаемся опаределить номер счета фактруры в автоматическом режиме
						Иначе
							
							// для "сплошной" и "в пределах даты" ставим номер документа
							Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
								ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) 
								Тогда
								
								НомерСчетаФактуры = Номер;
								НовыйСФ.Номер = НомерСчетаФактуры;
								
							ИначеЕсли (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда 
								
								НовыйСФ.УстановитьНовыйНомер();
								НомерСчетаФактуры = НовыйСФ.Номер;
								
								// внешний нумератор
							ИначеЕсли (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда
								
								ОбработкаНумерации.УстановитьНомерСчетаФактуры(ЭтотОбъект, НовыйСФ);
								
							КонецЕсли; 
						КонецЕсли;  // присвоение номера счета-фактуры
						
						// если не удается записать документ с таким номером, то возвращаемся с ошибкой
						CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,НовыйСФ);
						Отказ = CW_Документы.ПроверкаНомера(НовыйСФ, РежимЗаписиДокумента.Запись, ЭтотОбъект,Ложь);
						Если Отказ Тогда 
							Возврат; 
						КонецЕсли;
						
						// прописываем ссылку на счет-фактуру в ведущий документ
						ВедомыйСчетФактура = НовыйСФ.Ссылка;
						
						// если счет-фактуру формировать не требуется
					Иначе
						
						Если (НЕ ВедомыйСчетФактура.Пустая()) Тогда
							ВедомыйСФ = ВедомыйСчетФактура.ПолучитьОбъект();
							_сф.ст_УстановитьСвойство(ВедомыйСФ.ДополнительныеСвойства,"СообщитьОбИзмененииРеквизитов",Ложь);
							ВедомыйСФ.УстановитьПометкуУдаления(Истина);
						КонецЕсли; 
						
					КонецЕсли; // проверка на необходимость формирования счета-фактуры 
					
				Иначе
					
					Если (НЕ ЗначениеЗаполнено(НомерАкта)) Тогда
						
						// для "сплошной" и "в пределах даты" ставим номер документа
						Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
							ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты Тогда
				
							НомерАкта = Номер;
							
						ИначеЕсли ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор Тогда
							
							ОбработкаНумерации.УстановитьНомерАкта(ЭтотОбъект);
					
						Иначе
							
							Сообщить("Автонумерация актов для договоров без признака бухгалтерского учёта поддерживается только для типов нумерации ""Сплошная"" и ""В пределах даты""");
							Отказ = Истина;
							Возврат;
							
						КонецЕсли; 
						
					КонецЕсли; 
					
					Если (ФормируетсяСчетФактура) Тогда
						
						_сф.УстановитьЕслиНезаполнено(ДатаСчетаФактуры,ДатаАкта);
						
						// установка номера счета-фактуры
						Если (НЕ ЗначениеЗаполнено(НомерСчетаФактуры)) Тогда
							
							// для "сплошной" и "в пределах даты" ставим номер документа
							Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
								ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) Тогда
								
								НомерСчетаФактуры = Номер;
								
							ИначеЕсли ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор Тогда
								
								ОбработкаНумерации.УстановитьНомерСчетаФактуры(ЭтотОбъект);
								
							КонецЕсли; 
							
						КонецЕсли;  // присвоение номера счета-фактуры
						
						Если (НЕ ВедомыйСчетФактура.Пустая()) Тогда
							ВедомыйСФ = ВедомыйСчетФактура.ПолучитьОбъект();
							_сф.ст_УстановитьСвойство(ВедомыйСФ.ДополнительныеСвойства,"СообщитьОбИзмененииРеквизитов",Ложь);
							ВедомыйСФ.УстановитьПометкуУдаления(Истина);
						КонецЕсли; 
						
					КонецЕсли;
					
					// если ведомый документ существует, то помечаем на удаление
					Если (НЕ ВедомыйДокумент.Пустая()) Тогда
						Ведомый = ВедомыйДокумент.ПолучитьОбъект();
						Ведомый.УстановитьПометкуУдаления(Истина);
					КонецЕсли; 
					
				КонецЕсли; 
				
				БлокироватьПриОтличиеДатыАкта = НП.БлокироватьПриОтличиеДатыАкта;
				Если (БлокироватьПриОтличиеДатыАкта = Неопределено) Тогда
					БлокироватьПриОтличиеДатыАкта = Ложь;
				КонецЕсли;
				
				Если БлокироватьПриОтличиеДатыАкта И ФормируетсяАкт И РежимЗаписи = РежимЗаписиДокумента.Проведение и ФормируетсяАкт Тогда
					Если (НачалоДня(ДатаАкта) <> НачалоДня(Дата)) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата акта отличается от даты документа. Проведение отменено.", ,,,Отказ);
						Возврат;
					КонецЕсли; 
				КонецЕсли; 
				
				// если акт не формируется
			Иначе
				
				// если ведомый документ существует, то помечаем на удаление
				Если (НЕ ВедомыйДокумент.Пустая()) Тогда
					Ведомый = ВедомыйДокумент.ПолучитьОбъект();
					Ведомый.УстановитьПометкуУдаления(Истина);
				КонецЕсли; 
				
			КонецЕсли; // проверка на необходимость формирования акта
			
		КонецЕсли; // это не корректировка
		
		Если (Корректировка) Тогда
			
			Если (ФормируетсяСчет) Тогда
				
				//----
				_сф.УстановитьЕслиНезаполнено(ДатаСчета,Дата);
				
				// синхронизация времени
				Если (НачалоДня(ДатаСчета) = НачалоДня(Дата)) Тогда
					ДатаСчета = Дата;
				КонецЕсли; 
				
				// формирование счета при условии того, что по договору ведется бухгалтерский учет
				Если (ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет И ДС.УП.ФормироватьСчетаПокупателюНаОплату и ПровестиПоБухгалтерскомуУчету) Тогда
					
					ФормироватьСчет = Истина;
					
					// если ссылка на документ "Счет" отсутствует, формирем новый документ,
					// иначе получаем ранее созданный
					Если ((ВедомыйСчетКорректировочный.Пустая()) ИЛИ (НЕ _СФ.ОбъектБДСуществует(ВедомыйСчетКорректировочный))) Тогда
						НовыйВедомыйСчетКорректировочный = Документы.СчетНаОплатуПокупателю.СоздатьДокумент();
						НовыйВедомыйСчетКорректировочный.Контрагент 	= Контрагент;
						НовыйВедомыйСчетКорректировочный.Комментарий 	= "Сформировано автоматически (CW) документом ""Доходы по грузоперевозке"" №"+Номер+" от "+СокрЛП(Дата);
					Иначе
						НовыйВедомыйСчетКорректировочный = ВедомыйСчетКорректировочный.ПолучитьОбъект();
						НовыйВедомыйСчетКорректировочный.ПометкаУдаления = Ложь;
					КонецЕсли; 
					
					НовыйВедомыйСчетКорректировочный.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСчетаПокупателю.ТоварыИУслуги");
	
					// заполняем реквизиты счета  
					НовыйВедомыйСчетКорректировочный.Организация = Организация;
					//Удалено чтобы исключить дублирование номеров документов
					//НовыйВедомыйСчет.ОбменДанными.Загрузка = Истина;
					НовыйВедомыйСчетКорректировочный.Дата = ДатаСчета;
					
					НовыйВедомыйСчетКорректировочный.СуммаВключаетНДС = ЦенаСНДС;
					
					//Для версии КОРП
					Если ВестиУчетПоПодразделениям Тогда
						НовыйВедомыйСчетКорректировочный.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП
					
					
					// присвоение номера счета
					Если (ЗначениеЗаполнено(НомерСчета)) Тогда
						НовыйВедомыйСчетКорректировочный.Номер = СокрЛП(НомерСчета);
					Иначе
						
						// для "сплошной" и "в пределах даты" ставим номер документа
						Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
							ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты Тогда
							
							НовыйВедомыйСчетКорректировочный.Номер = СокрЛП(Номер);
							НомерСчета = Номер;
							
						КонецЕсли; 
						
						// для независимой просто получаем номер
						Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда
							
							НовыйВедомыйСчетКорректировочный.УстановитьНовыйНомер();
							// --- 
							НомерСчета = НовыйВедомыйСчетКорректировочный.Номер;
							
						КонецЕсли;
						
						// внешний нумератор
						Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда
							
							ОбработкаНумерации.УстановитьНомерСчета(ЭтотОбъект, НовыйВедомыйСчетКорректировочный);
							
						КонецЕсли; 
						
					КонецЕсли; 
					
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,НовыйВедомыйСчетКорректировочный);
					
					// проверяем (пытаемся записать) на возможность записи документа с указанным номером,
					// если в процессе записи возникла ошибка, то выходим из процедуры
					Отказ = CW_Документы.ПроверкаНомера(НовыйВедомыйСчетКорректировочный, РежимЗаписиДокумента.Запись, ЭтотОбъект.Ссылка,Ложь);
					Если Отказ Тогда 
						Возврат; 
					КонецЕсли;
					
					// записываем ссылку на счет в документ
					ВедомыйСчетКорректировочный = НовыйВедомыйСчетКорректировочный.Ссылка;	
				КонецЕсли; // признак формирования счета установлен 
				
				//---
				
			КонецЕсли; // признак формирования счета установлен 
			
			Если (ФормируетсяАкт И ПровестиПоБухгалтерскомуУчету) Тогда
				
				_сф.УстановитьЕслиНезаполнено(ДатаАкта,Дата);
				
				// формируем ведомую корректировку поступления 
				НоваяДата = ?(ДатаАкта= Дата(1,1,1), Дата, ДатаАкта);
				
				ТребуетсяСозданиеВедомого = Ложь;
				Если (ВедомыйДокументКорректировки.Пустая()) Тогда
					ТребуетсяСозданиеВедомого = Истина;
				КонецЕсли; 
				Если (НЕ ТребуетсяСозданиеВедомого) Тогда
					Если (НЕ _СФ.ОбъектБДСуществует(ВедомыйДокументКорректировки)) Тогда
						ТребуетсяСозданиеВедомого = Истина;
					КонецЕсли; 
				КонецЕсли; 
				Если (НЕ ЭтоНовый() И НЕ ТребуетсяСозданиеВедомого) Тогда
					
					// проверяем, не связан ли он уже с другим ведущим
					Ведущий = CW_Документы.ПолучитьВедущийДокумент(ВедомыйДокументКорректировки);
					Если (Ведущий = Неопределено ИЛИ Ведущий <> Ссылка) Тогда
						
						ТребуетсяСозданиеВедомого = Истина;
						ВедомыйДокумент = Неопределено;
						ВедомыйСчетФактура = Неопределено;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
				// создаём/перезаполняем
				Если (ТребуетсяСозданиеВедомого ИЛИ НоваяДата <> ВедомыйДокумент.Дата ИЛИ ВедомыйДокумент.ПометкаУдаления) Тогда
					
					// создаем
					Если (ТребуетсяСозданиеВедомого) Тогда
						Ведомый = Документы.КорректировкаРеализации.СоздатьДокумент();
					Иначе
						Ведомый = ВедомыйДокументКорректировки.ПолучитьОбъект();
					КонецЕсли; 
					// --- 
					Ведомый.Дата 					= НоваяДата;
					Ведомый.ОбменДанными.Загрузка	= Истина;
					Ведомый.ПометкаУдаления 		= Ложь;
					Ведомый.Организация 			= Организация;
					
					Ведомый.ВидОперации 			= ВидОперацииКорректировки;
					
					Ведомый.ЭтоУниверсальныйДокумент = ЭтоУниверсальныйДокумент;
					
					//Для версии КОРП 
					Если ВестиУчетПоПодразделениям Тогда
						Ведомый.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП 
					
					Если (ЗначениеЗаполнено(НомерАкта)) Тогда
						Ведомый.Номер = НомерАкта;
					Иначе
						
						// для "сплошной" и "в пределах даты" ставим номер документа
						Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
							ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты 
							Тогда
							
							Ведомый.Номер = СокрЛП(Номер);
							НомерАкта = Номер;
							
						КонецЕсли; 
						
						// для независимой просто получаем номер
						Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация Тогда
							
							Ведомый.УстановитьНовыйНомер();
							НомерАкта = Ведомый.Номер;
							
						КонецЕсли;
						
						// внешний нумератор
						Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда
							
							ОбработкаНумерации.УстановитьНомерАкта(ЭтотОбъект, Ведомый);
							
						КонецЕсли; 
						
					КонецЕсли;
					
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,Ведомый);
					Ведомый.Записать();
					ВедомыйДокументКорректировки = Ведомый.Ссылка;
					
				КонецЕсли; 
				
				// ---------------------------------------------------------------------------- 
				
				Если (ФормируетсяСчетФактура) Тогда
					
					_сф.УстановитьЕслиНезаполнено(ДатаСчетаФактуры,Дата);
					
					ТребуетсяСозданиеСФ = Ложь;
					Если (НЕ ЗначениеЗаполнено(ВедомыйСчетФактураКорректировочный)) Тогда
						ТребуетсяСозданиеСФ=Истина;
					КонецЕсли; 
					Если (НЕ ТребуетсяСозданиеВедомого) Тогда
						Если (НЕ _СФ.ОбъектБДСуществует(ВедомыйСчетФактураКорректировочный)) Тогда
							ТребуетсяСозданиеВедомого = Истина;
						КонецЕсли; 
					КонецЕсли;
					
					//Если ТребуетсяСозданиеСФ ИЛИ ДатаСчетаФактуры <> ВедомыйСчетФактураКорректировочный.Дата ИЛИ ВедомыйСчетФактураКорректировочный.ПометкаУдаления Тогда
						
						Если ТребуетсяСозданиеСФ Тогда
							Ведомый = Документы.СчетФактураВыданный.СоздатьДокумент();
						Иначе
							Ведомый = ВедомыйСчетФактураКорректировочный.ПолучитьОбъект();
						КонецЕсли; 
						
						Ведомый.Ответственный 				= Ответственный;
						Ведомый.Организация 				= Организация;
						Ведомый.Контрагент 					= Контрагент;
						Ведомый.ИдентификаторГосКонтракта 	= ИдентификаторГосКонтракта;
						Ведомый.ВидСчетаФактуры 			= Перечисления.ВидСчетаФактурыВыставленного.Корректировочный;
						
						Если ЗначениеЗаполнено(КодВидаОперации) Тогда
							Ведомый.КодВидаОперации = КодВидаОперации;  
							Ведомый.КодВидаОперацииНаУменьшение = КодВидаОперации;  
						Иначе
							Если Ведомый.Дата >= Дата(2016,07,1) И ЕстьСобственные И ЕстьПеревыставление Тогда
								Ведомый.КодВидаОперации = "15";
								Ведомый.КодВидаОперацииНаУменьшение = "18";  
							Иначе
								
								Ведомый.КодВидаОперации = "01";
								Ведомый.КодВидаОперацииНаУменьшение = "18";  
								
								мКоды = Новый Массив;
								Если ЕстьСобственные Тогда  
									мКоды.Добавить("01");
								КонецЕсли; 
								
								Если ЕстьПеревыставление Тогда 
									мКоды.Добавить(ДС.УП.КодВидаОперацииДляИсходящихСчетовФактур);
								КонецЕсли; 
								
								Ведомый.КодВидаОперации = СтрСоединить(мКоды,";");
								
							КонецЕсли; 
						КонецЕсли; 	
						
						Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда   
							
							ДанныеИсходногоДокумента = ПолучитьНомерДатаИсходногоДокумента(КорректируемыйДокумент);  
							
							Ведомый.Дата 					= Дата; 
							Ведомый.НомерИсправления 		= НомерИсправления; 
							Ведомый.НомерИсходногоДокумента	= ДанныеИсходногоДокумента.НомерСчетаФактуры; 
							Ведомый.ДатаИсходногоДокумента	= ДанныеИсходногоДокумента.ДатаСчетаФактуры; 
							Ведомый.Исправление             = Истина; 
							
							Если КорректируемыйДокумент.Корректировка Тогда
								Ведомый.ИсправляемыйСчетФактура = КорректируемыйДокумент.ВедомыйСчетФактураКорректировочный;//
								Ведомый.НомерИсправляемогоКорректировочногоДокумента 	= КорректируемыйДокумент.ВедомыйСчетФактураКорректировочный.Номер;//
								Ведомый.ДатаИсправляемогоКорректировочногоДокумента 	= КорректируемыйДокумент.ВедомыйСчетФактураКорректировочный.Дата;//
							Иначе       
								Ведомый.ИсправляемыйСчетФактура = ДанныеИсходногоДокумента.ИсправляемыйДокумент.ВедомыйСчетФактура;//
								Ведомый.ВидСчетаФактуры 		= Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию; 
							КонецЕсли;   
							
						Иначе
							Ведомый.Дата				= ДатаСчетаФактуры;
							// установка номера счета-фактуры
							Если (ЗначениеЗаполнено(НомерСчетаФактуры)) Тогда
								Ведомый.Номер = НомерСчетаФактуры;
								// пытаемся опаределить номер счета фактруры в автоматическом режиме
							Иначе
								
								// для "сплошной" и "в пределах даты" ставим номер документа
								Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
									ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты 
									Тогда
									
									Ведомый.Номер 		= Номер;
									НомерСчетаФактуры 	= Номер;
									
								ИначеЕсли ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация Тогда 
									
									Ведомый.УстановитьНовыйНомер();
									НомерСчетаФактуры = Ведомый.Номер;
									
									// внешний нумератор
								ИначеЕсли (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда
									
									//Для внешнего нумератора, весь порялдок определения номера определяется в обработке нумератора, в том числе и для исправителных
									ОбработкаНумерации.УстановитьНомерСчетаФактуры(ЭтотОбъект, Ведомый);
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;	
						
						CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,Ведомый);
						
						//Подписанты "которые используется для вывода в печатную форму "Счет-фактура" Заявка AFR-233619     
						СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
						СтруктураПараметровДоговора.Дата 				= ДатаСчетаФактуры;
						СтруктураПараметровДоговора.Договор 			= Договор;
						СтруктураПараметровДоговора.ПриложениеКДоговору = ПриложениеКДоговору;
						
						ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора);
						Подписанты 			= CW_Печать.ВернутьПодписантов(Ссылка, ПараметрыДоговора);
						
						Ведомый.Руководитель 		= Подписанты.Руководитель;
						Ведомый.ГлавныйБухгалтер 	= Подписанты.ГлБух; 
						//Заявка AFR-233619 
			
						Ведомый.ОбменДанными.Загрузка=Истина;
						Ведомый.ПометкаУдаления = Ложь;
						Ведомый.Записать();
						
						ВедомыйСчетФактураКорректировочный = Ведомый.Ссылка;
						
					//КонецЕсли; 
					
				КонецЕсли; 

			КонецЕсли; 
			
		КонецЕсли;
		
		// представление документа
		Если НЕ Отказ Тогда  
			
			мПредставления = Новый Массив;
			Если ФормируетсяСчет Тогда   
				ПредставлениеСчета 	= "Счет №";
				Если Корректировка Тогда
					ПредставлениеСчета 	= "Кор.счет №";
				КонецЕсли;
				
				ПредставлениеНомераСчета = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Организация, НомерСчета, ДатаСчета));	   
				ПредставлениеДатыСчета 	 = Формат(ДатаСчета, "ДФ=dd.MM.yyyy");
				
				мПредставления.Добавить(ПредставлениеСчета + ПредставлениеНомераСчета+" от "+ПредставлениеДатыСчета);
			КонецЕсли;
			
			ЭтоУПД = ФормируетсяАкт и ЭтоУниверсальныйДокумент;
			
			Если Не ЭтоУПД Тогда
				Если ФормируетсяАкт Тогда 
					ПредставлениеАкта 	= "Акт №";
					Если Корректировка Тогда
						ПредставлениеАкта 	= "Кор.акт №";
					КонецЕсли; 
					
					ПредставлениеНомераАкта = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Организация, НомерАкта, ДатаАкта));	   
					ПредставлениеДатыАкта 	= Формат(ДатаАкта, "ДФ=dd.MM.yyyy");			
					
					мПредставления.Добавить(ПредставлениеАкта + ПредставлениеНомераАкта+" от "+ПредставлениеДатыАкта); 
					
					Если ФормируетсяСчетФактура Тогда  
						ПредставлениеСчетаФактуры 	= "С/ф №";
						Если Корректировка Тогда
							ПредставлениеСчетаФактуры 	= "Кор.с/ф №";
						КонецЕсли; 
						
						ПредставлениеНомераСчетаФактуры = CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Организация, НомерСчетаФактуры, ДатаСчетаФактуры));	   
						ПредставлениеДатыСчетаФактуры 	= Формат(ДатаСчетаФактуры, "ДФ=dd.MM.yyyy");
						
						ПредставлениеИсправленияСчетаФактуры = "";
						Если ЗначениеЗаполнено(НомерИсправления) 
							И ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
							ПредставлениеИсправленияСчетаФактуры  =  " (испр. "+Формат(НомерИсправления, "ЧГ=0")+")";
						КонецЕсли;    
					
						мПредставления.Добавить(ПредставлениеСчетаФактуры + ПредставлениеНомераСчетаФактуры + ПредставлениеИсправленияСчетаФактуры + " от "+ПредставлениеДатыСчетаФактуры); 
					КонецЕсли; 
				КонецЕсли;  
			КонецЕсли; 
			
			Если ЭтоУПД Тогда   
				
				ВидУПД = "УПД";
				Если Корректировка и ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение") Тогда
					ВидУПД = "УКД";	
				КонецЕсли;
				
				ПредставлениеИсправленияУПД = "";
				Если ФормируетсяСчетФактура Тогда  
					СтатусУПД 				= "(1)";
					ПредставлениеНомераУПД	= " №"+ CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Организация, НомерСчетаФактуры, ДатаСчетаФактуры));
					ПредставлениеДатыУПД 	= ?(ДатаСчетаФактуры = Дата(1,1,1),				  	"<...>",	Формат(ДатаСчетаФактуры,"ДФ=dd.MM.yyyy"));
					
					Если ЗначениеЗаполнено(НомерИсправления) 
						И ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
						ПредставлениеИсправленияУПД  =  " (испр. "+Формат(НомерИсправления, "ЧГ=0")+")";
					КонецЕсли;    
					
				Иначе
					СтатусУПД 				= "(2)";
					ПредставлениеНомераУПД	= " №"+ CW_Документы.ПолучитьНомерНаПечать(Новый Структура("Организация, Номер, Дата", Организация, НомерАкта, ДатаАкта));
					ПредставлениеДатыУПД 	= ?(ДатаАкта = Дата(1,1,1), "<...>",	Формат(ДатаАкта,"ДФ=dd.MM.yyyy"));
				КонецЕсли;  
				
				ПредставлениеУПД = ВидУПД + СтатусУПД + ПредставлениеНомераУПД + ПредставлениеИсправленияУПД+ " от "+ ПредставлениеДатыУПД;
				
				мПредставления.Добавить(ПредставлениеУПД);
				
			КонецЕсли;
		
			Если мПредставления.Количество() = 0 Тогда
				мПредставления.Добавить("<"+ЭтотОбъект+">");
			КонецЕсли;
			
			ПредставлениеДокумента = СтрСоединить(мПредставления, "; ");
		КонецЕсли; // формирование представления документа
		
	КонецЕсли; // запись, проведение и отмена проведения документа 
	
	Если (НЕ ФормироватьСчет И ЗначениеЗаполнено(ВедомыйСчет) И НЕ ВедомыйСчет.ПометкаУдаления) Тогда
		Ведомый = ВедомыйСчет.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);
	КонецЕсли; 
	Если (НЕ ФормироватьАкт И ЗначениеЗаполнено(ВедомыйДокумент) И НЕ ВедомыйДокумент.ПометкаУдаления) Тогда
		Ведомый = ВедомыйДокумент.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);
	КонецЕсли; 
	Если (НЕ ФормироватьСчетФактуру И ЗначениеЗаполнено(ВедомыйСчетФактура) И НЕ ВедомыйСчетФактура.ПометкаУдаления) Тогда
		Ведомый = ВедомыйСчетФактура.ПолучитьОбъект();
		Ведомый.УстановитьПометкуУдаления(Истина);
	КонецЕсли; 
	
	Если (КонтроллироватьДатыПеревыставления) Тогда
		
		Если (СтаршаяДатаРасходов > ДатаАкта) Тогда
			
			Отказ = Истина;
			Сообщить(ЭтотОбъект);
			Сообщить("В документы обнаружены перевыставляемые расходы, документы поступления по которым отражены позднее даты акта, указанной в документе.");
			Сообщить("Для корректного перевыставления расходов рекумендуем установить дату акта позднее "+Формат(СтаршаяДатаРасходов,"ДЛФ=")+"."); 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	#Область ЗачетАвансов 
	
	Если (НЕ Корректировка) Тогда
		
		// заполнение ТЧ "ЗачетАвансаОЗ"
		Если (СпособЗачетаАвансовОЗ = Перечисления.СпособыЗачетаАвансов.Автоматически 
			И ДС.УП.ОЗ
			И РежимЗаписи=РежимЗаписиДокумента.Проведение
			И ФормируетсяСчет) 
		Тогда
			
			Если (НачалоДня(ДатаСчета) <> НачалоДня(Дата)) Тогда
				Сообщить(Строка(ЭтотОбъект));
				Сообщить("При ведении учета оперативной задолженности и автоматическом зачете авансов (ОУ) дата документа должна совпадать с датой счета");
			КонецЕсли; 
			
			ДатаПодбораАвансов = Новый Граница(МоментВремени(),ВидГраницы.Исключая);
			ЗаполнитьТаблицуАвансовОЗ(ДатаПодбораАвансов);
			
		ИначеЕсли (СпособЗачетаАвансовОЗ = Перечисления.СпособыЗачетаАвансов.НеЗачитывать) Тогда 
			ЗачетАвансовОЗ.Очистить();		 
			
		КонецЕсли; 
		
		// заполнение ТЧ "ЗачетАванса"
		Если (СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически
			И РежимЗаписи=РежимЗаписиДокумента.Проведение 
			И (ФормируетсяАкт)) 
		Тогда
			
			Если (НачалоДня(ДатаАкта) <> НачалоДня(Дата)) Тогда
				Сообщить(Строка(ЭтотОбъект));
				Сообщить("При автоматическом зачете авансов (БУ) дата документа должна совпадать с датой акта");
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ВедомыйДокумент) Тогда
				ЗаполнитьТаблицуАвансов(Новый Граница(ВедомыйДокумент.МоментВремени(),ВидГраницы.Исключая));
			Иначе
				ЗаполнитьТаблицуАвансов(Новый Граница(ДатаАкта,ВидГраницы.Исключая));
			КонецЕсли;
			
		ИначеЕсли (СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать) Тогда 
			ЗачетАвансов.Очистить();		 
			
		КонецЕсли;
		
		// заполнение таб.части "Платёжно-расчётные документы с/ф"
		Если ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.Автоматически 
			И РежимЗаписи=РежимЗаписиДокумента.Проведение 
			И ФормироватьСчетФактуру
		Тогда 
			Ответ = Документы.CW_ДоходыПоГрузоперевозке.ПолучитьТаблицу_ПлатёжноРасчётныеДокументы_дляСФ(ЭтотОбъект.Ссылка, ЗачетАвансов, Услуги);
			Если Ответ.Код = 0 Тогда
				ЭтотОбъект.ПлатёжноРасчётныеДокументы.Загрузить(Ответ.ПлатёжноРасчётныеДокументы);
			Иначе 
				Сообщить(Ответ.ОписаниеОшибки);
			КонецЕсли;
			
		ИначеЕсли ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.НеУчитывать Тогда  
			ЭтотОбъект.ПлатёжноРасчётныеДокументы.Очистить();
			
		КонецЕсли;
		
	КонецЕсли; 
	
	#КонецОбласти 
	
КонецПроцедуры   

Функция ПолучитьНомерДатаИсходногоДокумента(ИсправляемыйДокумент)
	
	Если ИсправляемыйДокумент.Корректировка Тогда
		Возврат ПолучитьНомерДатаИсходногоДокумента(ИсправляемыйДокумент.КорректируемыйДокумент);
	Конецесли;            
	
	ДанныеИсходногоДокумента = Новый Структура;
	ДанныеИсходногоДокумента.Вставить("ИсправляемыйДокумент", 	ИсправляемыйДокумент);
	ДанныеИсходногоДокумента.Вставить("НомерСчетаФактуры", 		ИсправляемыйДокумент.НомерСчетаФактуры);
	ДанныеИсходногоДокумента.Вставить("ДатаСчетаФактуры", 		ИсправляемыйДокумент.ДатаСчетаФактуры);
	
	Возврат ДанныеИсходногоДокумента; 
		
КонецФункции

	
Функция ПолучитьМассивУслугДокумента(ИсключитьПеревыставление) 
	
	МассивУслуг = Новый Массив;                               
	
	Для Каждого СтрокаУслуг из Услуги Цикл                    
		Если ИсключитьПеревыставление и СтрокаУслуг.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление") Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивУслуг.Найти(СтрокаУслуг.Номенклатура) = Неопределено Тогда
			МассивУслуг.Добавить(СтрокаУслуг.Номенклатура);	
		КонецЕсли;
		
	КонецЦикла;

	Возврат МассивУслуг;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	// контроль загрузки
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Если (РучнаяКорректировка) Тогда 
		Возврат; 
	КонецЕсли; 
	
	// не перепроводим при восстановлении последовательности
	ВосстановлениеПоследовательности = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ПроведенВХронологическойПоследовательности");
	Если (ВосстановлениеПоследовательности <> Неопределено) Тогда
		Если (ВосстановлениеПоследовательности) Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	//Для версии КОРП 
	ВестиУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для версии КОРП 
	
	//Подситема.СтатусыДокументов
	ИспользуютсяСтатусыДокументов = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов");
	Если ИспользуютсяСтатусыДокументов И
		Не ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
		//В случае если используются статусы документа и проведение не из формы, тов ДС статуса нет
		ДанныеСтатуса = РегистрыСведений.CW_СтатусыДокументов.ПолучитьДанныеСтатусаДокумента(Ссылка);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СтатусДокумента", ДанныеСтатуса.СтатусДокумента);
	КонецЕсли;
	
	СтатусДокумента = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента", СтатусДокумента);
	
	СтатусДокументаПроводитьПоБухгалтерскомуУчету = CW_СтатусыДокументовСервер.ПолучитьПризнакПроведенияПоБухгалтерскомуУчету(Ссылка, СтатусДокумента);
	//Подситема.СтатусыДокументов
	
	// контроль наличия общих параметров
	Если НЕ ЗаполненыОбщиеПараметры() Тогда	
		СформироватьОбщиеПараметры(,Ложь); 
	КонецЕсли; 
	
	// определяем, что делать с подчинённым документом
	РежимЗаписи = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"РежимЗаписи");
	
	Если (РежимЗаписи = РежимЗаписиДокумента.Запись) Тогда
		ПроверитьСтатусВедомых();
		Возврат;
	КонецЕсли;  
	
	ВедетсяУчетПриложенийПоДоговорам = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	СтруктураПараметровБухУчета.Вставить("ВедетсяУчетПриложений",	ВедетсяУчетПриложенийПоДоговорам);
	
	ПараметрыБухгалтерскогоУчета  = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	ПровестиПоБухгалтерскомуУчету = ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет и СтатусДокументаПроводитьПоБухгалтерскомуУчету;
	
	Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		Если (НЕ Корректировка) Тогда
			
			// проверяем возможность отмены проведения
			Если НЕ ПроверитьЗакрытиеГрузоперевозок() Тогда
				
				Сообщить("В документе присутствуют закрытие грузоперевозки. Операция отменена.",СтатусСообщения.Важное);
				Отказ = Истина;
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли; 
		
		ПроверитьСтатусВедомых();
		
		// делаем отмену проведения ведомых документов
		Если (НЕ Корректировка) Тогда
			Если (НЕ ВедомыйДокумент.Пустая()) Тогда
				Если (НЕ ВедомыйДокумент.ПометкаУдаления) Тогда
					ВедомыйОбъект = ВедомыйДокумент.ПолучитьОбъект();
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
					ВедомыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
				КонецЕсли; 
			КонецЕсли;
		Иначе
			Если (НЕ ВедомыйДокументКорректировки.Пустая() и ВедомыйДокументКорректировки.ПометкаУдаления) Тогда
				ВедомыйОбъект = ВедомыйДокументКорректировки.ПолучитьОбъект();
				_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
				ВедомыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
			КонецЕсли; 
		КонецЕсли; 
		
		Для каждого Набор Из Движения Цикл
			Набор.Прочитать();
			Набор.Очистить();
		КонецЦикла;
		
		Движения.Записать();
		Возврат;
	КонецЕсли;
	
	Если (РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
		
		Если ЗначениеЗаполнено(ПриложениеКДоговору) Тогда
			Если ЗначениеЗаполнено(ПриложениеКДоговору.ДатаЗакрытия) И (КонецДня(ПриложениеКДоговору.ДатаЗакрытия) <= Дата) Тогда
				Отказ = Истина;
				Сообщить(Ссылка);
				Сообщить("Проведение документа позднее даты закрытия приложения к договору с контрагентом невозможно!");
				Возврат;
			КонецЕсли; 
		КонецЕсли; 

		Если ЗначениеЗаполнено(Договор.ДатаЗакрытия) И (КонецДня(Договор.ДатаЗакрытия) <= Дата) Тогда
			Отказ = Истина;
			Сообщить(Ссылка);
			Сообщить("Проведение документа позднее даты закрытия договора с контрагентом невозможно!");
			Возврат;
		КонецЕсли; 
		
		ОчищатьДвижения = Истина;
		
		// удаляем собственные движения	
		Если (ПровестиПоБухгалтерскомуУчету И ФормируетсяАкт) Тогда
			
			Если (НЕ Корректировка) Тогда
				ПроверяемыйДокумент = ВедомыйДокумент;
			Иначе
				ПроверяемыйДокумент = ВедомыйДокументКорректировки;
			КонецЕсли;
			
			Если (НЕ ПроверяемыйДокумент.РучнаяКорректировка) Тогда
				
				ОчищатьДвижения = Истина;
				
			Иначе 
				
				СтатусПроведенияДоПроведения = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"СтатусПроведенияДоПроведения",Ложь);
				Если (НЕ СтатусПроведенияДоПроведения) Тогда
					Сообщить(Ссылка);
					Сообщить("Ведомый документ содержит признак ручной корректировки. Проведение заблокировано.");
					Отказ = Истина;
					Возврат;
				Иначе	
					
					Сообщить("Внимание! У ведомого документа "+Строка(ПроверяемыйДокумент)+" установлен признак ручной корректировки движений!");
					ОчищатьДвижения = Ложь;
					// ничего не делаем
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (ОчищатьДвижения) Тогда
			Для каждого Набор Из Движения Цикл
				Набор.Прочитать();
				Набор.Очистить();
			КонецЦикла;
			Движения.Записать();
		Иначе
			Возврат;
		КонецЕсли; 
		
		Счета = CW_Конфигурация.ПланСчетов(); 
		
		Если (НЕ Корректировка) Тогда
			
			Если (ПровестиПоБухгалтерскомуУчету) Тогда
				
				//  формируем ведомый счет
				Если (ФормируетсяСчет И ДС.УП.ФормироватьСчетаПокупателюНаОплату) Тогда
					
					ВедомыйОбъектСчет = ВедомыйСчет.ПолучитьОбъект();
					ВедомыйОбъектСчет.УстановитьПометкуУдаления(ПометкаУдаления);
					// --- 
					ВедомыйОбъектСчет.Организация = Организация;
					ВедомыйОбъектСчет.Контрагент = Контрагент;
					ВедомыйОбъектСчет.ДоговорКонтрагента = ПараметрыБухгалтерскогоУчета.УчетныйДоговор;
					ВедомыйОбъектСчет.ОрганизацияПолучатель = Организация; 
					
					ВедомыйОбъектСчет.СуммаВключаетНДС = ЦенаСНДС;
					
					//Для версии КОРП
					Если ВестиУчетПоПодразделениям Тогда
						ВедомыйОбъектСчет.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП
					
					// --- 
					РасчетныйСчет = ДС.ПД.РасчетныйСчетОрганизации;
					Если (НЕ ЗначениеЗаполнено(РасчетныйСчет)) Тогда
						ВедомыйОбъектСчет.СтруктурнаяЕдиница = Организация.ОсновнойБанковскийСчет;
					Иначе
						ВедомыйОбъектСчет.СтруктурнаяЕдиница = РасчетныйСчет;
					КонецЕсли;	
					// --- 
					ВедомыйОбъектСчет.ВалютаДокумента = Валюта;
					// --- 
					ВедомыйОбъектСчет.Ответственный = Ответственный;
					ВедомыйОбъектСчет.Комментарий = "Сформировано автоматически (CW) документом ""Доходы по грузоперевозке"" №"+Строка(Номер)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");
					// --- 
					ВедомыйОбъектСчет.Руководитель = Руководитель;
					Если (ВедомыйОбъектСчет.Метаданные().Реквизиты.Найти("ЗаРуководителяНаОсновании") <> Неопределено) Тогда
						ВедомыйОбъектСчет.ЗаРуководителяНаОсновании = ЗаРуководителяПоПриказу;
					Иначе
						ВедомыйОбъектСчет.ЗаРуководителяПоПриказу = ЗаРуководителяПоПриказу;
					КонецЕсли; 
					// --- 
					ВедомыйОбъектСчет.ГлавныйБухгалтер = ГлавныйБухгалтер;
					Если (ВедомыйОбъектСчет.Метаданные().Реквизиты.Найти("ЗаГлавногоБухгалтераНаОсновании") <> Неопределено) Тогда
						ВедомыйОбъектСчет.ЗаГлавногоБухгалтераНаОсновании = ЗаГлавногоБухгалтераПоПриказу;
					Иначе
						ВедомыйОбъектСчет.ЗаГлавногоБухгалтераПоПриказу = ЗаГлавногоБухгалтераПоПриказу;
					КонецЕсли;
					// --- 
					Если Валюта = ДС.КО.ВалютаРегламентированногоУчета Тогда
						ВедомыйОбъектСчет.КурсВзаиморасчетов = 1;
						ВедомыйОбъектСчет.КратностьВзаиморасчетов = 1;
					Иначе
						СК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Валюта));
						ВедомыйОбъектСчет.КурсВзаиморасчетов = СК.Курс;
						ВедомыйОбъектСчет.КратностьВзаиморасчетов = СК.Кратность;
					КонецЕсли;
					// --- 
					ОсновноеПодразделение = Неопределено;
					// --- 
					ЕстьТовары = (Документы.СчетНаОплатуПокупателю.ПустаяСсылка().Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено);
					Если (ЕстьТовары) Тогда
						
						ВедомыйОбъектСчет.Товары.Очистить();
						Для каждого СтрТЧ Из Услуги Цикл
							
							Нстр = ВедомыйОбъектСчет.Товары.Добавить();
							// ---------------------------------------------------------------------------- 
							Нстр.Номенклатура = СтрТЧ.Номенклатура;
							Нстр.Содержание = СокрЛП(СтрТЧ.Представление);
							Нстр.Количество = СтрТЧ.Количество;
							Нстр.Цена 		= СтрТЧ.Цена;
							Нстр.Сумма 		= СтрТЧ.Сумма;
							Нстр.СтавкаНДС 	= СтрТЧ.СтавкаНДС;
							Нстр.СуммаНДС 	= СтрТЧ.НДС;    
							
							Если ЦенаСНДС Тогда
								Нстр.Сумма = Нстр.Сумма + Нстр.СуммаНДС; 
							КонецЕсли;

						КонецЦикла; 
						
					Иначе
						
						ВедомыйОбъектСчет.Услуги.Очистить();
						Для каждого СтрТЧ Из Услуги Цикл
							
							Нстр = ВедомыйОбъектСчет.Услуги.Добавить();
							// ---------------------------------------------------------------------------- 
							Нстр.Номенклатура 	= СтрТЧ.Номенклатура;
							Нстр.Содержание 	= СокрЛП(СтрТЧ.Представление);
							Нстр.Количество 	= СтрТЧ.Количество;
							Нстр.Цена 			= СтрТЧ.Цена;
							Нстр.Сумма 			= СтрТЧ.Сумма;  
							Нстр.СтавкаНДС 		= СтрТЧ.СтавкаНДС;
							Нстр.СуммаНДС 		= СтрТЧ.НДС; 
							
							Если ЦенаСНДС Тогда
								Нстр.Сумма = Нстр.Сумма + Нстр.СуммаНДС;  
							КонецЕсли;
							
						КонецЦикла; 
						
					КонецЕсли; 
					
					// --- 
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъектСчет);
					
					// s.anton@coralway.ru 2018-05-29 19:02:34 НАЧАЛО...
					// чтобы документ нормально вставал на регистрацию в ЭДО, при том, что его несколько раз записывают и в нужный момент не выглядит новым (немодифицированным)
					CW_Подписки.ПодготовитьДокументОбъектДляЭДО(ВедомыйОбъектСчет, Отказ, РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					// ... /s.anton@coralway.ru 2018-05-29 19:02:34 КОНЕЦ
					
					// пытаемся записать документ
					Отказ = CW_Документы.ПроверкаНомера(ВедомыйОбъектСчет, РежимЗаписиДокумента.Проведение, ЭтотОбъект.Ссылка,Ложь);
					Если Отказ Тогда 
						Возврат; 
					КонецЕсли;
					
					// пропишем срок оплаты, если это предусмотрено настройками типовой БП
					ИспользоватьПланирование = ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейОтПокупателей");
					Если ИспользоватьПланирование Тогда
						ЗаписьРегистра = РегистрыСведений.CW_СрокиОплатыСчетов.СоздатьМенеджерЗаписи();
						ЗаписьРегистра.Счет = Ссылка;
						ЗаписьРегистра.Прочитать();   
						Если ЗаписьРегистра.Выбран() Тогда 
							СрокиОплатыДокументов.ЗаписатьСрокОплатыДокумента(ВедомыйСчет, ЗаписьРегистра.ДатаОплаты);
						КонецЕсли;
					КонецЕсли;
					
					// Если для целей оперативного учета задолженности документ проводится в режиме ввода остатков,
					// то принудительно пропишем статус ведомого счета (при проведении в обычном режиме статус не прописываем,
					// т.к. он будет определен типовой конфигурацией на момент записи документа)
					СтруктураНастроек  = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Организация,Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская, Дата); 

					Если СтруктураНастроек["ВедетсяОперативныйУчет"] Тогда
						РежимВводНачальныхОстатков = СтруктураНастроек["ВводОстатков"];
						Если РежимВводНачальныхОстатков Тогда
							
							// статус оплаты
							СтатусОплаты = Перечисления.СтатусОплатыСчета.НеОплачен;
							Если СальдоВзаиморасчетовОЗ <= 0 Тогда
								СтатусОплаты = Перечисления.СтатусОплатыСчета.Оплачен;
							Иначе
								Если СальдоВзаиморасчетовОЗ < Услуги.Итог("Всего") Тогда
									СтатусОплаты = Перечисления.СтатусОплатыСчета.ОплаченЧастично;
								КонецЕсли; 
							КонецЕсли; 
							
							// статус отгрузки
							СтатусОтгрузки = ?(ФормируетсяАкт,Перечисления.СтатусыОтгрузки.Отгружен,Перечисления.СтатусыОтгрузки.НеОтгружен);
							
							МассивДокументов = Новый Массив;
							МассивДокументов.Добавить(ВедомыйОбъектСчет.Ссылка);
							
							// пишем в регистр
							СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
							СтатусыДокумента.Статус            		= СтатусОплаты;
							СтатусыДокумента.ДополнительныйСтатус	= СтатусОтгрузки;
							РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокументов(МассивДокументов,СтатусыДокумента);
						КонецЕсли; // это режим ввода остатков 
					КонецЕсли; // по организации ведется учет оперативной задолженности
					
				// если счет формировать не нужно, а ссылка на документ есть, 
				// то помечаем его на удаление
				Иначе
					Если (НЕ ВедомыйСчет.Пустая()) Тогда
						ПометитьНаУдаление(ВедомыйСчет);
					КонецЕсли; 
				КонецЕсли; // проверка на необходимость формирования счета покупателю		
				
				// формируем ведомый акт
				Если (ФормируетсяАкт) Тогда
					
					ВедомыйОбъект = ВедомыйДокумент.ПолучитьОбъект();
					ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
					
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ЗависимоеПроведение",Истина);
					
					// --- 
					ВедомыйОбъект.ВидОперации=Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
					ВедомыйОбъект.Организация = Организация;
					
					//Для версии КОРП
					Если ВестиУчетПоПодразделениям Тогда
						ВедомыйОбъект.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП
					
					ВедомыйОбъект.СопроводительныеДокументы = СопроводительныеДокументы;
					ВедомыйОбъект.СведенияОТранспортировкеИГрузе = СведенияОТранспортировкеИГрузе;
					
					ВедомыйОбъект.ВидЭлектронногоДокумента=Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот;
					
					ВедомыйОбъект.Контрагент = Контрагент;
					ВедомыйОбъект.ДоговорКонтрагента = ПараметрыБухгалтерскогоУчета.УчетныйДоговор;
					// --- 
					ВедомыйОбъект.СуммаВключаетНДС = Ложь;
					ВедомыйОбъект.ВалютаДокумента = Валюта;
					// --- 
					ВедомыйОбъект.СчетНаОплатуПокупателю = Документы.CW_ДоходыПоГрузоперевозке.ПолучитьСчетНаОплатуПокупателю(Ссылка);
					
					ВедомыйОбъект.БанковскийСчетОрганизации = Организация.ОсновнойБанковскийСчет;
					Если ЗначениеЗаполнено(ДС.ПД.РасчетныйСчетОрганизации) Тогда
						ВедомыйОбъект.БанковскийСчетОрганизации = ДС.ПД.РасчетныйСчетОрганизации; 
					КонецЕсли; 
					
					// --- 
					ВедомыйОбъект.Ответственный = Ответственный;
					// --- 
					ВедомыйОбъект.Руководитель = Руководитель;
					Если (ВедомыйОбъект.Метаданные().Реквизиты.Найти("ЗаРуководителяНаОсновании") <> Неопределено) Тогда
						ВедомыйОбъект.ЗаРуководителяНаОсновании = ЗаРуководителяПоПриказу;
					Иначе
						ВедомыйОбъект.ЗаРуководителяПоПриказу = ЗаРуководителяПоПриказу;
					КонецЕсли; 
					// --- 
					ВедомыйОбъект.ГлавныйБухгалтер = ГлавныйБухгалтер;
					Если (ВедомыйОбъект.Метаданные().Реквизиты.Найти("ЗаГлавногоБухгалтераНаОсновании") <> Неопределено) Тогда
						ВедомыйОбъект.ЗаГлавногоБухгалтераНаОсновании = ЗаГлавногоБухгалтераПоПриказу;
					Иначе
						ВедомыйОбъект.ЗаГлавногоБухгалтераПоПриказу = ЗаГлавногоБухгалтераПоПриказу;
					КонецЕсли;
					// --- 
					ВедомыйОбъект.Комментарий = "Сформировано автоматически (CW) документом ""Доходы по грузоперевозке"" №"+Строка(Номер)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");
					
					// устанавливаем счета расчетов по-умолчанию и определяем курс взаиморасчетов
					ПЗ = Новый Структура("СчетУчетаРасчетовСКонтрагентом,СчетУчетаРасчетовПоАвансам,КурсВзаиморасчетов,КратностьВзаиморасчетов");
					Если (Валюта = ДС.КО.ВалютаРегламентированногоУчета) Тогда
						
						ПЗ.СчетУчетаРасчетовСКонтрагентом = Счета.РасчетыСПокупателями; // 62.01
						ПЗ.СчетУчетаРасчетовПоАвансам = Счета.РасчетыПоАвансамПолученным; // 62.02
						// --- 
						ПЗ.КурсВзаиморасчетов = 1;
						ПЗ.КратностьВзаиморасчетов = 1;
						
					Иначе
						
						Если УЕ_ПользовательскийКурс Тогда
							СК = Новый Структура("Курс,Кратность",УЕ_Курс,УЕ_Кратность);
						Иначе
							СК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ВедомыйОбъект.Дата, Новый Структура("Валюта", Валюта));
						КонецЕсли;
						//Если ДополнительныеСвойства.УП.УчитыватьКурсыВалютАвансовДляБазыНДС
						//	И ЗачетАвансов.Количество()>0
						//Тогда 
						//	СК = ПриведённыйКурсСУчётомВалютныхАвансов(СК);
						//КонецЕсли;
						
						ПЗ.КурсВзаиморасчетов = СК.Курс;
						ПЗ.КратностьВзаиморасчетов = СК.Кратность;

						
						Контракт = ?(ЗначениеЗаполнено(ПриложениеКДоговору),ПриложениеКДоговору,Договор);
						Если (НЕ Контракт.ВзаиморасчетыВУЕ) Тогда
							ПЗ.СчетУчетаРасчетовСКонтрагентом = Счета.РасчетыСПокупателямиВал; // 62.01
							ПЗ.СчетУчетаРасчетовПоАвансам = Счета.РасчетыПоАвансамПолученнымВал; // 62.02
						Иначе
							ПЗ.СчетУчетаРасчетовСКонтрагентом = Счета.РасчетыСПокупателямиУЕ; // 62.31
							ПЗ.СчетУчетаРасчетовПоАвансам = Счета.РасчетыПоАвансамПолученнымУЕ; // 62.32
						КонецЕсли;
						
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(ВедомыйОбъект,ПЗ);
					
					// устанавливаем способ зачета авансов - не зачитывать
					// способ зачета будет переопределяться в подписке самого ведомого документа (!!!)
					ВедомыйОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
					
					// --- 
					ОсновноеПодразделение = Неопределено;
					// --- 
					ВедомыйОбъект.Услуги.Очистить();
					ВедомыйОбъект.АгентскиеУслуги.Очистить();
					// --- 
					ВД_ОсновнаяСистема = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат["ОсновнаяСистемаНалогообложения"];
					ВД_ЕНВД = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат["ОсобыйПорядокНалогообложения"];
					// --- 
					Для каждого СтрТЧ Из Услуги Цикл
						
						// собственная услуга
						Если (стрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга) Тогда
							
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							// ---------------------------------------------------------------------------- 
							Нстр.Номенклатура = СтрТЧ.Номенклатура;
							Нстр.Содержание = СокрЛП(СтрТЧ.Представление);
							Нстр.Количество = СтрТЧ.Количество;
							// --- 
							Если ЦенаСНДС Тогда
								Нстр.Цена = СтрТЧ.Цена - СтрТЧ.НДС/?(СтрТЧ.Количество=0,1,СтрТЧ.Количество);
							Иначе
								Нстр.Цена = СтрТЧ.Цена;
							КонецЕсли;    
							
							Нстр.Сумма 		= СтрТЧ.Сумма;
							Нстр.СтавкаНДС 	= СтрТЧ.СтавкаНДС;
							Нстр.СуммаНДС 	= СтрТЧ.НДС;
							Нстр.СчетУчетаНДСПоРеализации = Счета.Продажи_НДС; // 90.03
							
							// определяем счета реализации по ЕНВД/неЕНВД
							Если (СтрТЧ.СтатьяЗатрат.ВидДеятельностиДляНалоговогоУчетаЗатрат = ВД_ОсновнаяСистема) Тогда
								
								// не ЕНВД
								Нстр.СчетДоходов = Счета.ВыручкаНеЕНВД; // 90.01.1
								Нстр.Субконто = СтрТЧ.Номенклатура.НоменклатурнаяГруппа; // номенклатураня группа
								Нстр.СчетРасходов = Счета.СебестоимостьПродажНеЕНВД; // 90.02.1
								
							ИначеЕсли (СтрТЧ.СтатьяЗатрат.ВидДеятельностиДляНалоговогоУчетаЗатрат = ВД_ЕНВД) Тогда
								
								// ЕНВД
								Нстр.СчетДоходов = Счета.ВыручкаЕНВД; // 90.01.2
								Нстр.Субконто = СтрТЧ.Номенклатура.НоменклатурнаяГруппа; // номенклатураня группа
								Нстр.СчетРасходов = Счета.СебестоимостьПродажЕНВД; // 90.02.2
								
							Иначе
								
								// распределение - подумать
								
							КонецЕсли; 
							
							// --- 
						КонецЕсли;
						
						// Прочие доходы
						Если (стрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.ПрочиеДоходы) Тогда
							
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							// ---------------------------------------------------------------------------- 
							Нстр.Номенклатура = СтрТЧ.Номенклатура;
							Нстр.Содержание = СокрЛП(СтрТЧ.Представление);
							Нстр.Количество = СтрТЧ.Количество;
							// --- 
							
							Если ЦенаСНДС Тогда
								Нстр.Цена = СтрТЧ.Цена - СтрТЧ.НДС/?(СтрТЧ.Количество=0,1,СтрТЧ.Количество);
							Иначе
								Нстр.Цена = СтрТЧ.Цена;
							КонецЕсли;    

							Нстр.Сумма 		= СтрТЧ.Сумма;
							Нстр.СтавкаНДС 	= СтрТЧ.СтавкаНДС;
							Нстр.СуммаНДС 	= СтрТЧ.НДС;
							Нстр.СчетУчетаНДСПоРеализации = Счета.ПрочиеРасходы; // 91.02							
							// не ЕНВД
							Нстр.СчетДоходов 	= Счета.ПрочиеДоходы; // 91.01.1
							Нстр.Субконто		= СтрТЧ.ПрочиеДоходы; // ПрочиеДоходыИРасходы
							Нстр.СчетРасходов 	= Счета.ПрочиеРасходы; // 91.02.1
							
							// --- 
						КонецЕсли;
					
						// перевыставление
						Если (стрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление 
							ИЛИ стрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам) Тогда
							
							Нстр = ВедомыйОбъект.АгентскиеУслуги.Добавить();
							// ---------------------------------------------------------------------------- 
							Нстр.Номенклатура = СтрТЧ.Номенклатура;
							Нстр.Содержание = СокрЛП(СтрТЧ.Представление);
							Нстр.Количество = СтрТЧ.Количество;
							// --- 
							Если ДС.УП.СистемаНалогообложения=Перечисления.СистемыНалогообложения.Общая Тогда
								
								Нстр.Цена = СтрТЧ.Цена;
								Нстр.Сумма = СтрТЧ.Сумма;
								Нстр.СтавкаНДС = СтрТЧ.СтавкаНДС;
								Нстр.СуммаНДС = СтрТЧ.НДС;
								
							Иначе
								
								// УСН
								Нстр.Цена = СтрТЧ.Цена;
								Нстр.Сумма = СтрТЧ.Сумма;
								Нстр.СтавкаНДС = СтрТЧ.СтавкаНДС;
								Нстр.СуммаНДС = СтрТЧ.НДС;
								
							КонецЕсли; 
							// --- 
							
							Если (ЗначениеЗаполнено(СтрТЧ.ДокументРасходов)) Тогда
								
								Нстр.Контрагент = СтрТЧ.ДокументРасходов.Контрагент;
								
								АгентскийДоговорКонтрагента = СтрТЧ.ДокументРасходов.Договор.АгентскийДоговорНаПродажу;
								Если ВедетсяУчетПриложенийПоДоговорам 
									И ЗначениеЗаполнено(СтрТЧ.ДокументРасходов.ПриложениеКДоговору) Тогда
									АгентскийДоговорКонтрагента = СтрТЧ.ДокументРасходов.ПриложениеКДоговору.АгентскийДоговорНаПродажу;
								КонецЕсли;
								
								Если (НЕ ЗначениеЗаполнено(АгентскийДоговорКонтрагента)) Тогда
									
									СтруктураДоговора = Новый Структура;
									СтруктураДоговора.Вставить("Договор", 				СтрТЧ.ДокументРасходов.Договор); 
									СтруктураДоговора.Вставить("ПриложениеКДоговору", 	СтрТЧ.ДокументРасходов.ПриложениеКДоговору); 
									
									АгентскийДоговорКонтрагента = CW_Финансы.СоздатьАгентскийДоговор(СтруктураДоговора); 
								КонецЕсли; 
								Нстр.ДоговорКонтрагента = АгентскийДоговорКонтрагента;
								
							Иначе
								// это перевыставление по ставкам
								Нстр.Контрагент = Контрагент;
								
								АгентскийДоговорКонтрагента = ПараметрыБухгалтерскогоУчета.АгентскийДоговорНаПродажу;
								Если (НЕ ЗначениеЗаполнено(АгентскийДоговорКонтрагента)) Тогда
									
									СтруктураДоговора = Новый Структура;
									СтруктураДоговора.Вставить("Договор", 				Договор); 
									СтруктураДоговора.Вставить("ПриложениеКДоговору", 	ПриложениеКДоговору); 

									АгентскийДоговорКонтрагента = CW_Финансы.СоздатьАгентскийДоговор(СтруктураДоговора,Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
									ПараметрыБухгалтерскогоУчета.АгентскийДоговорНаПродажу = АгентскийДоговорКонтрагента;
								КонецЕсли;
								Нстр.ДоговорКонтрагента = АгентскийДоговорКонтрагента;
								
							КонецЕсли; 
							
							
							// --- 
							
							Если (АгентскийДоговорКонтрагента <> Неопределено) Тогда
								
								// определяем счёт расчётов
								ВалютныйДоговор = АгентскийДоговорКонтрагента.Валютный;
								ОплатаВВалюте = АгентскийДоговорКонтрагента.ОплатаВВалюте;
								// --- 
								Нстр.СчетРасчетов = ПолучитьСчетРасчетовДляАгентскогоДоговора(ВалютныйДоговор, стрТЧ.ПорядокОтражения, ОплатаВВалюте, Счета);
								
							КонецЕсли; 
							
						КонецЕсли; 
						
					КонецЦикла;
					// --- 
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"Постановление735",ДС.УП.ТребованияПостановления735);
					// --- 
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъект);
					
					// s.anton@coralway.ru 2018-05-29 19:02:34 НАЧАЛО...
					// чтобы документ нормально вставал на регистрацию в ЭДО, при том, что его несколько раз записывают и в нужный момент не выглядит новым (немодифицированным)
					ВедомыйОбъект.СуммаДокумента = 	  УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ВедомыйОбъект, "Товары")
													+ УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ВедомыйОбъект, "Услуги")
													+ УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДС(ВедомыйОбъект, "АгентскиеУслуги");
					
					CW_Подписки.ПодготовитьДокументОбъектДляЭДО(ВедомыйОбъект, Отказ, РежимЗаписи, РежимПроведенияДокумента.Неоперативный);
					// ... /s.anton@coralway.ru 2018-05-29 19:02:34 КОНЕЦ
					
					Отказ = CW_Документы.ПроверкаНомера(ВедомыйОбъект, РежимЗаписи, ЭтотОбъект.Ссылка,Ложь);
					Если Отказ Тогда 
						Возврат; 
					КонецЕсли;
					
				Иначе
					
					Если (НЕ ВедомыйДокумент.Пустая()) Тогда
						ПометитьНаУдаление(ВедомыйДокумент);	
					КонецЕсли; 
					
				КонецЕсли;
				
			Иначе
				
				Если (НЕ ВедомыйДокумент.Пустая()) Тогда
					
					ПометитьНаУдаление(ВедомыйДокумент);
					
				КонецЕсли; 
				
				Если (НЕ ВедомыйСчет.Пустая()) Тогда
					
					ПометитьНаУдаление(ВедомыйСчет);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (Корректировка) Тогда
			
			Если (ПровестиПоБухгалтерскомуУчету) Тогда
				
				//----
					Если (ФормируетсяСчет И ДС.УП.ФормироватьСчетаПокупателюНаОплату) Тогда
					
					ВедомыйОбъектСчет = ВедомыйСчетКорректировочный.ПолучитьОбъект();
					ВедомыйОбъектСчет.УстановитьПометкуУдаления(ПометкаУдаления);
					// --- 
					ВедомыйОбъектСчет.Организация = Организация;
					ВедомыйОбъектСчет.Контрагент = Контрагент;
					ВедомыйОбъектСчет.ДоговорКонтрагента = ПараметрыБухгалтерскогоУчета.УчетныйДоговор;
					ВедомыйОбъектСчет.ОрганизацияПолучатель = Организация;
					
					//Для версии КОРП
					Если ВестиУчетПоПодразделениям Тогда
						ВедомыйОбъектСчет.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП
					
					// --- 
					РасчетныйСчет = ДС.ПД.РасчетныйСчетОрганизации;
					Если (НЕ ЗначениеЗаполнено(РасчетныйСчет)) Тогда
						ВедомыйОбъектСчет.СтруктурнаяЕдиница = Организация.ОсновнойБанковскийСчет;
					Иначе
						ВедомыйОбъектСчет.СтруктурнаяЕдиница = РасчетныйСчет;
					КонецЕсли;	
					// --- 
					ВедомыйОбъектСчет.СуммаВключаетНДС = ЦенаСНДС;
					ВедомыйОбъектСчет.ВалютаДокумента = Валюта;
					// --- 
					ВедомыйОбъектСчет.Ответственный = Ответственный;
					ВедомыйОбъектСчет.Комментарий = "Сформировано автоматически (CW) документом ""Доходы по грузоперевозке"" №"+Строка(Номер)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");
					// --- 
					ВедомыйОбъектСчет.Руководитель = Руководитель;
					Если (ВедомыйОбъектСчет.Метаданные().Реквизиты.Найти("ЗаРуководителяНаОсновании") <> Неопределено) Тогда
						ВедомыйОбъектСчет.ЗаРуководителяНаОсновании = ЗаРуководителяПоПриказу;
					Иначе
						ВедомыйОбъектСчет.ЗаРуководителяПоПриказу = ЗаРуководителяПоПриказу;
					КонецЕсли; 
					// --- 
					ВедомыйОбъектСчет.ГлавныйБухгалтер = ГлавныйБухгалтер;
					Если (ВедомыйОбъектСчет.Метаданные().Реквизиты.Найти("ЗаГлавногоБухгалтераНаОсновании") <> Неопределено) Тогда
						ВедомыйОбъектСчет.ЗаГлавногоБухгалтераНаОсновании = ЗаГлавногоБухгалтераПоПриказу;
					Иначе
						ВедомыйОбъектСчет.ЗаГлавногоБухгалтераПоПриказу = ЗаГлавногоБухгалтераПоПриказу;
					КонецЕсли;
					// --- 
					Если Валюта = ДС.КО.ВалютаРегламентированногоУчета Тогда
						ВедомыйОбъектСчет.КурсВзаиморасчетов = 1;
						ВедомыйОбъектСчет.КратностьВзаиморасчетов = 1;
					Иначе
						СК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Валюта));
						ВедомыйОбъектСчет.КурсВзаиморасчетов = СК.Курс;
						ВедомыйОбъектСчет.КратностьВзаиморасчетов = СК.Кратность;
					КонецЕсли;
					// --- 
					ОсновноеПодразделение = Неопределено;
					// --- 
					ЕстьТовары = (Документы.СчетНаОплатуПокупателю.ПустаяСсылка().Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено);
					Если (ЕстьТовары) Тогда
						
						ВедомыйОбъектСчет.Товары.Очистить();
						Для каждого СтрТЧ Из Услуги Цикл
							
							Если СтрТЧ.Количество <> СтрТЧ.Количество_ДоКорректировки или
								СтрТЧ.Цена <> СтрТЧ.Цена_ДоКорректировки или
								СтрТЧ.Сумма <> СтрТЧ.Сумма_ДоКорректировки или
								СтрТЧ.НДС <> СтрТЧ.НДС_ДоКорректировки Тогда
								
								Нстр = ВедомыйОбъектСчет.Товары.Добавить();
								// ---------------------------------------------------------------------------- 
								Нстр.Номенклатура 	= СтрТЧ.Номенклатура;
								Нстр.Содержание 	= СокрЛП(СтрТЧ.Представление);
								Нстр.Количество 	= СтрТЧ.Количество - СтрТЧ.Количество_ДоКорректировки;
								Нстр.Цена 			= СтрТЧ.Цена - СтрТЧ.Цена_ДоКорректировки;
								Нстр.Сумма 			= СтрТЧ.Сумма - СтрТЧ.Сумма_ДоКорректировки;
								Нстр.СуммаНДС 		= СтрТЧ.НДС - СтрТЧ.НДС_ДоКорректировки;   
								Нстр.СтавкаНДС 		= СтрТЧ.СтавкаНДС;     
								
								Если ЦенаСНДС Тогда
									Нстр.Сумма 		= Нстр.Сумма + Нстр.СуммаНДС;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла; 
						
					Иначе
						
						ВедомыйОбъектСчет.Услуги.Очистить();
						Для каждого СтрТЧ Из Услуги Цикл
							Если СтрТЧ.Количество <> СтрТЧ.Количество_ДоКорректировки или
								СтрТЧ.Цена <> СтрТЧ.Цена_ДоКорректировки или
								СтрТЧ.Сумма <> СтрТЧ.Сумма_ДоКорректировки или
								СтрТЧ.НДС <> СтрТЧ.НДС_ДоКорректировки Тогда
								
								Нстр = ВедомыйОбъектСчет.Услуги.Добавить();
								// ---------------------------------------------------------------------------- 
								Нстр.Номенклатура = СтрТЧ.Номенклатура;
								Нстр.Содержание = СокрЛП(СтрТЧ.Представление);
								Нстр.Количество 	= СтрТЧ.Количество - СтрТЧ.Количество_ДоКорректировки;
								Нстр.Цена 			= СтрТЧ.Цена - СтрТЧ.Цена_ДоКорректировки;
								Нстр.Сумма 			= СтрТЧ.Сумма - СтрТЧ.Сумма_ДоКорректировки;
								Нстр.СуммаНДС 		= СтрТЧ.НДС - СтрТЧ.НДС_ДоКорректировки;
								Нстр.СтавкаНДС 		= СтрТЧ.СтавкаНДС;  
								
								Если ЦенаСНДС Тогда
									Нстр.Сумма 		= Нстр.Сумма + Нстр.СуммаНДС; 
								КонецЕсли;
								
								
							КонецЕсли;
							
						КонецЦикла; 
						
					КонецЕсли; 
						
					// --- 
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъектСчет);
					
					// пытаемся записать документ
					Отказ = CW_Документы.ПроверкаНомера(ВедомыйОбъектСчет, РежимЗаписиДокумента.Проведение, ЭтотОбъект.Ссылка,Ложь);
					Если Отказ Тогда 
						Возврат; 
					КонецЕсли;          
					
					ИспользоватьПланирование = ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеПлатежейОтПокупателей");
					Если ИспользоватьПланирование Тогда
						ЗаписьРегистра = РегистрыСведений.CW_СрокиОплатыСчетов.СоздатьМенеджерЗаписи();
						ЗаписьРегистра.Счет = Ссылка;
						ЗаписьРегистра.Прочитать();   
						Если ЗаписьРегистра.Выбран() Тогда 
							СрокиОплатыДокументов.ЗаписатьСрокОплатыДокумента(ВедомыйСчетКорректировочный, ЗаписьРегистра.ДатаОплаты);
						КонецЕсли;
					КонецЕсли;
					
					// Если для целей оперативного учета задолженности документ проводится в режиме ввода остатков,
					// то принудительно пропишем статус ведомого счета (при проведении в обычном режиме статус не прописываем,
					// т.к. он будет определен типовой конфигурацией на момент записи документа)  
					
					СтруктураНастроек  = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Организация,Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская, Дата); 
					
					Если СтруктураНастроек["ВедетсяОперативныйУчет"] Тогда
						РежимВводНачальныхОстатков = СтруктураНастроек["ВводОстатков"];
						Если РежимВводНачальныхОстатков Тогда
							
							// статус оплаты
							СтатусОплаты = Перечисления.СтатусОплатыСчета.НеОплачен;
							Если СальдоВзаиморасчетовОЗ <= 0 Тогда
								СтатусОплаты = Перечисления.СтатусОплатыСчета.Оплачен;
							Иначе
								Если СальдоВзаиморасчетовОЗ < Услуги.Итог("Всего") Тогда
									СтатусОплаты = Перечисления.СтатусОплатыСчета.ОплаченЧастично;
								КонецЕсли; 
							КонецЕсли; 
							
							// статус отгрузки
							СтатусОтгрузки = ?(ФормируетсяАкт,Перечисления.СтатусыОтгрузки.Отгружен,Перечисления.СтатусыОтгрузки.НеОтгружен);
							
							МассивДокументов = Новый Массив;
							МассивДокументов.Добавить(ВедомыйОбъектСчет.Ссылка);
							
							// пишем в регистр
							СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
							СтатусыДокумента.Статус            		= СтатусОплаты;
							СтатусыДокумента.ДополнительныйСтатус	= СтатусОтгрузки;
							РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокументов(МассивДокументов,СтатусыДокумента);
						КонецЕсли; // это режим ввода остатков 
					КонецЕсли; // по организации ведется учет оперативной задолженности
					
				// если счет формировать не нужно, а ссылка на документ есть, 
				// то помечаем его на удаление
				Иначе
					Если (НЕ ВедомыйСчет.Пустая()) Тогда
						ПометитьНаУдаление(ВедомыйСчет);
					КонецЕсли; 
				КонецЕсли; // проверка на необходимость формирования счета покупателю				
				
				//----
				
				Если (ФормируетсяАкт) Тогда
					
					ВедомыйОбъект = ВедомыйДокументКорректировки.ПолучитьОбъект();
					
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ЗависимоеПроведение",Истина);
					
					//ВедомыйОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент(); // тмп
					ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
					ВедомыйОбъект.Организация = Организация;
					
					//Для версии КОРП
					Если ВестиУчетПоПодразделениям Тогда
						ВедомыйОбъект.ПодразделениеОрганизации = ПодразделениеОрганизации;
					КонецЕсли;
					//Для версии КОРП
					
					ВедомыйОбъект.Контрагент 			= Контрагент;
					ВедомыйОбъект.ДоговорКонтрагента 	= ПараметрыБухгалтерскогоУчета.УчетныйДоговор;
					ВедомыйОбъект.ВалютаДокумента 		= Валюта;
		
					ВедомыйОбъект.Дата =  ?(ДатаАкта= Дата(1,1,1), Дата, ДатаАкта);
;
					ВедомыйОбъект.ВидОперации = ВидОперацииКорректировки;
					
					ВедомыйОбъект.ОтчетностьПодписана 	= Год(ЭтотОбъект.ДатаАкта) > Год(КорректируемыйДокумент.ДатаАкта);
					
					ВедомыйОбъект.КорректироватьБУиНУ 	= Истина;
					ВедомыйОбъект.КорректироватьНДС 	= Истина;
					
					ВедомыйОбъект.ДокументРеализации 			= ?(КорректируемыйДокумент.Корректировка,КорректируемыйДокумент.ВедомыйДокументКорректировки,КорректируемыйДокумент.ВедомыйДокумент); // или исправляемый ?
					ВедомыйОбъект.СтатьяПрочихДоходовИРасходов 	= ДС.УП.СтатьяПрочихДоходовИРасходовДляКорректировок;
					ВедомыйОбъект.НомерИсходногоДокумента 		= КорректируемыйДокумент.НомерАкта;
					ВедомыйОбъект.ДатаИсходногоДокумента 		= КорректируемыйДокумент.ДатаАкта;
					
					Если ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки") Тогда
						ВедомыйОбъект.НомерИсправления 	= НомерИсправления; 
					КонецЕсли;
					
					ВедомыйОбъект.Услуги.Очистить();
					ВедомыйОбъект.АгентскиеУслуги.Очистить();
					
					ИндексСтрокиСобственных = 0;
					ИндексСтрокиАгентских 	= 0;
					
					Если КорректируемыйДокумент.Корректировка Тогда
						ТаблицаУслугСобственных = КорректируемыйДокумент.ВедомыйДокументКорректировки.Услуги.Выгрузить();
						ТаблицаУслугАгентских 	= КорректируемыйДокумент.ВедомыйДокументКорректировки.АгентскиеУслуги.Выгрузить();
					Иначе
						ТаблицаУслугСобственных = КорректируемыйДокумент.ВедомыйДокумент.Услуги.Выгрузить();
						ТаблицаУслугАгентских 	= КорректируемыйДокумент.ВедомыйДокумент.АгентскиеУслуги.Выгрузить();
					КонецЕсли;
					
					МаксИндексСтрокиСобственных = ТаблицаУслугСобственных.Количество()-1;
					МаксИндексСтрокиАгентских 	= ТаблицаУслугАгентских.Количество()-1;
					
					ОсновнаяСистемаНалогообложения 	= Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат["ОсновнаяСистемаНалогообложения"];
					ОсобыйПорядокНалогообложения	= Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат["ОсобыйПорядокНалогообложения"];  
					
					ЗаполнитьПередКорректировкой = CW_Документы.НужноПоказатьПередКорректировкой(ЭтотОбъект);
					
					// --- 
					Для каждого Стр Из Услуги Цикл
						
						Если (Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга) Тогда
							
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							// --- 
							Нстр.ЕстьВДокументеРеализации = Не Стр.ЭтоДобавленнаяСтрока;
							Нстр.Номенклатура = Стр.Номенклатура;
							// --- 
							Нстр.СодержаниеДоИзменения = СокрЛП(Стр.Представление_ДоКорректировки);
							Нстр.Содержание = СокрЛП(Стр.Представление);
							// --- 
							Нстр.КоличествоДоИзменения = Стр.Количество_ДоКорректировки;
							Нстр.Количество = Стр.Количество;
							// --- 
							Нстр.ЦенаДоИзменения = Стр.Цена_ДоКорректировки;
							Нстр.Цена = Стр.Цена;
							// --- 
							Нстр.СуммаДоИзменения = Стр.Сумма_ДоКорректировки;
							Нстр.Сумма = Стр.Сумма;
							// --- 
							Нстр.СтавкаНДСДоИзменения = Стр.СтавкаНДС_ДоКорректировки;
							Нстр.СтавкаНДС = Стр.СтавкаНДС;
							// --- 
							Нстр.СуммаНДСДоИзменения = Стр.НДС_ДоКорректировки;
							Нстр.СуммаНДС = Стр.НДС;  
							
							Если ЗаполнитьПередКорректировкой Тогда
								Нстр.КоличествоДоКорректировки 	= Стр.Количество_ПередКорректировкой;
								Нстр.ЦенаДоКорректировки 		= Стр.Цена_ПередКорректировкой;
								Нстр.СуммаДоКорректировки 		= Стр.Сумма_ПередКорректировкой;
								Нстр.СуммаНДСДоКорректировки 	= Стр.НДС_ПередКорректировкой;
							КонецЕсли;
							
							Если ИндексСтрокиСобственных <= МаксИндексСтрокиСобственных Тогда
								
								// остальные реквизиты берём из соответствующей строки ведомого корректируемого документа
								СтрокаДокументаПоступления = ТаблицаУслугСобственных[ИндексСтрокиСобственных];
								_сф.Инкремент(ИндексСтрокиСобственных);
								// --- 
								ЗаполнитьЗначенияСвойств(Нстр,СтрокаДокументаПоступления,"Субконто,СчетДоходов,СчетРасходов,СчетУчетаНДСПоРеализации");
								
							Иначе
								Нстр.СчетУчетаНДСПоРеализации = Счета.Продажи_НДС; // 90.03
								// определяем счета реализации по ЕНВД/неЕНВД
								Если (Стр.СтатьяЗатрат.ВидДеятельностиДляНалоговогоУчетаЗатрат = ОсновнаяСистемаНалогообложения) Тогда
									
									// не ЕНВД
									Нстр.СчетДоходов 	= Счета.ВыручкаНеЕНВД; // 90.01.1
									Нстр.Субконто 		= Стр.Номенклатура.НоменклатурнаяГруппа; // номенклатураня группа
									Нстр.СчетРасходов 	= Счета.СебестоимостьПродажНеЕНВД; // 90.02.1
									
								ИначеЕсли (СтрТЧ.СтатьяЗатрат.ВидДеятельностиДляНалоговогоУчетаЗатрат = ОсобыйПорядокНалогообложения) Тогда
									
									// ЕНВД
									Нстр.СчетДоходов 	= Счета.ВыручкаЕНВД; // 90.01.2
									Нстр.Субконто 		= Стр.Номенклатура.НоменклатурнаяГруппа; // номенклатураня группа
									Нстр.СчетРасходов 	= Счета.СебестоимостьПродажЕНВД; // 90.02.2
									
								КонецЕсли;
								
							КонецЕсли;
							
						ИначеЕсли (Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.ПрочиеДоходы) Тогда
							
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							// --- 
							Нстр.ЕстьВДокументеРеализации = Не Стр.ЭтоДобавленнаяСтрока;
							Нстр.Номенклатура = Стр.Номенклатура;
							// --- 
							Нстр.СодержаниеДоИзменения = СокрЛП(Стр.Представление_ДоКорректировки);
							Нстр.Содержание = СокрЛП(Стр.Представление);
							// --- 
							Нстр.КоличествоДоИзменения = Стр.Количество_ДоКорректировки;
							Нстр.Количество = Стр.Количество;
							// --- 
							Нстр.ЦенаДоИзменения = Стр.Цена_ДоКорректировки;
							Нстр.Цена = Стр.Цена;
							// --- 
							Нстр.СуммаДоИзменения = Стр.Сумма_ДоКорректировки;
							Нстр.Сумма = Стр.Сумма;
							// --- 
							Нстр.СтавкаНДСДоИзменения = Стр.СтавкаНДС_ДоКорректировки;
							Нстр.СтавкаНДС = Стр.СтавкаНДС;
							// --- 
							Нстр.СуммаНДСДоИзменения = Стр.НДС_ДоКорректировки;
							Нстр.СуммаНДС = Стр.НДС;
							
							Если ЗаполнитьПередКорректировкой Тогда
								Нстр.КоличествоДоКорректировки 	= Стр.Количество_ПередКорректировкой;
								Нстр.ЦенаДоКорректировки 		= Стр.Цена_ПередКорректировкой;
								Нстр.СуммаДоКорректировки 		= Стр.Сумма_ПередКорректировкой;
								Нстр.СуммаНДСДоКорректировки 	= Стр.НДС_ПередКорректировкой;
							КонецЕсли;
							
							Если ИндексСтрокиСобственных <= МаксИндексСтрокиСобственных Тогда
								
								// остальные реквизиты берём из соответствующей строки ведомого корректируемого документа
								СтрокаДокументаПоступления = ТаблицаУслугСобственных[ИндексСтрокиСобственных];
								_сф.Инкремент(ИндексСтрокиСобственных);
								// --- 
								ЗаполнитьЗначенияСвойств(Нстр,СтрокаДокументаПоступления,"Субконто,СчетДоходов,СчетРасходов,СчетУчетаНДСПоРеализации");
								
							Иначе
								Нстр.СчетУчетаНДСПоРеализации = Счета.ПрочиеРасходы; // 91.02
								
								Нстр.СчетДоходов 	= Счета.ПрочиеДоходы; // 90.01.1
								Нстр.Субконто 		= Стр.ПрочиеДоходы; // номенклатураня группа
								Нстр.СчетРасходов 	= Счета.ПрочиеРасходы; // 90.02.1
								
							КонецЕсли;
							
						Иначе
							
							Нстр = ВедомыйОбъект.АгентскиеУслуги.Добавить();
							// --- 
							Нстр.ЕстьВДокументеРеализации = Не Стр.ЭтоДобавленнаяСтрока;
							Нстр.Номенклатура = Стр.Номенклатура;
							// --- 
							Нстр.СодержаниеДоИзменения = СокрЛП(Стр.Представление_ДоКорректировки);
							Нстр.Содержание = СокрЛП(Стр.Представление);
							// --- 
							Нстр.КоличествоДоИзменения = Стр.Количество_ДоКорректировки;
							Нстр.Количество = Стр.Количество;
							// --- 
							Нстр.ЦенаДоИзменения = Стр.Цена_ДоКорректировки;
							Нстр.Цена = Стр.Цена;
							// --- 
							Нстр.СуммаДоИзменения = Стр.Сумма_ДоКорректировки;
							Нстр.Сумма = Стр.Сумма;
							// --- 
							Нстр.СтавкаНДСДоИзменения = Стр.СтавкаНДС_ДоКорректировки;
							Нстр.СтавкаНДС = Стр.СтавкаНДС;
							// --- 
							Нстр.СуммаНДСДоИзменения = Стр.НДС_ДоКорректировки;
							Нстр.СуммаНДС = Стр.НДС;  
							
							Если ЗаполнитьПередКорректировкой Тогда
								Нстр.КоличествоДоКорректировки 	= Стр.Количество_ПередКорректировкой;
								Нстр.ЦенаДоКорректировки 		= Стр.Цена_ПередКорректировкой;
								Нстр.СуммаДоКорректировки 		= Стр.Сумма_ПередКорректировкой;
								Нстр.СуммаНДСДоКорректировки 	= Стр.НДС_ПередКорректировкой;
							КонецЕсли;
							
							Если ИндексСтрокиАгентских <= МаксИндексСтрокиАгентских Тогда
								
								СтрокаДокументаПоступления = ТаблицаУслугАгентских[ИндексСтрокиАгентских];
								_сф.Инкремент(ИндексСтрокиАгентских);
								// --- 
								ЗаполнитьЗначенияСвойств(Нстр,СтрокаДокументаПоступления,"СчетРасчетов,Контрагент,ДоговорКонтрагента");
								
							Иначе
								Если (ЗначениеЗаполнено(Стр.ДокументРасходов)) Тогда
									
									Нстр.Контрагент = Стр.ДокументРасходов.Контрагент;
									
									АгентскийДоговорКонтрагента = Стр.ДокументРасходов.Договор.АгентскийДоговорНаПродажу;
									Если ВедетсяУчетПриложенийПоДоговорам 
										И ЗначениеЗаполнено(Стр.ДокументРасходов.ПриложениеКДоговору) Тогда
										АгентскийДоговорКонтрагента = Стр.ДокументРасходов.ПриложениеКДоговору.АгентскийДоговорНаПродажу;
									КонецЕсли;
									
									Если НЕ ЗначениеЗаполнено(АгентскийДоговорКонтрагента) Тогда
										
										СтруктураДоговора = Новый Структура;
										СтруктураДоговора.Вставить("Договор", 				Стр.ДокументРасходов.Договор); 
										СтруктураДоговора.Вставить("ПриложениеКДоговору", 	Стр.ДокументРасходов.ПриложениеКДоговору); 
										
										АгентскийДоговорКонтрагента = CW_Финансы.СоздатьАгентскийДоговор(СтруктураДоговора); 
									КонецЕсли; 
									Нстр.ДоговорКонтрагента = АгентскийДоговорКонтрагента;
									
								Иначе
									// это перевыставление по ставкам
									Нстр.Контрагент = Контрагент;
									
									АгентскийДоговорКонтрагента = ПараметрыБухгалтерскогоУчета.АгентскийДоговорНаПродажу;
									Если НЕ ЗначениеЗаполнено(АгентскийДоговорКонтрагента) Тогда
										
										СтруктураДоговора = Новый Структура;
										СтруктураДоговора.Вставить("Договор", 				Договор); 
										СтруктураДоговора.Вставить("ПриложениеКДоговору", 	ПриложениеКДоговору); 
										
										АгентскийДоговорКонтрагента = CW_Финансы.СоздатьАгентскийДоговор(СтруктураДоговора,Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком); 
										ПараметрыБухгалтерскогоУчета.АгентскийДоговорНаПродажу = АгентскийДоговорКонтрагента;
									КонецЕсли;
									Нстр.ДоговорКонтрагента = АгентскийДоговорКонтрагента;
									
								КонецЕсли; 
								
								Если (АгентскийДоговорКонтрагента <> Неопределено) Тогда
									
									// определяем счёт расчётов
									ВалютныйДоговор = АгентскийДоговорКонтрагента.Валютный;
									ОплатаВВалюте = АгентскийДоговорКонтрагента.ОплатаВВалюте;
									// --- 
									Нстр.СчетРасчетов = ПолучитьСчетРасчетовДляАгентскогоДоговора(ВалютныйДоговор, Стр.ПорядокОтражения, ОплатаВВалюте, Счета);
									
								КонецЕсли; 
								
							КонецЕсли;
							
						КонецЕсли; 
						
					КонецЦикла; 
					
					// --- 
					ВедомыйОбъект.ОбменДанными.Загрузка = Ложь;
					// --- 
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъект);
					// --- 
					ВедомыйОбъект.Комментарий = "Сформировано автоматически (CW) документом ""Доходы по грузоперевозке"" №"+Строка(Номер)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");

					ВедомыйОбъект.Записать(РежимЗаписи);
					
					
				КонецЕсли; 
								
			Иначе
				
				Если (НЕ ВедомыйДокументКорректировки.Пустая()) Тогда
					
					ПометитьНаУдаление(ВедомыйДокументКорректировки);
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецПроцедуры

Функция ПолучитьСчетРасчетовДляАгентскогоДоговора(ВалютныйДоговор, ПорядокОтражения, ОплатаВВалюте, Счета)
	
	Если (ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление) Тогда
		
		Если НЕ ВалютныйДоговор Тогда
			СчетРасчетов = Счета.РасчетыСПрочимиПоставщикамиИПодрядчиками; // 76.05
		Иначе
			Если (ОплатаВВалюте) Тогда
				СчетРасчетов = Счета.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал; // 76.25
			Иначе
				СчетРасчетов = Счета.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ; // 76.35
			КонецЕсли; 
		КонецЕсли; 
		
	Иначе 
		
		Если НЕ ВалютныйДоговор Тогда
			СчетРасчетов = Счета.РасчетыСПрочимиПокупателямиИЗаказчиками; // 76.06
		Иначе
			Если (ОплатаВВалюте) Тогда
				СчетРасчетов = Счета.РасчетыСПрочимиПокупателямиИЗаказчикамиВал; // 76.26
			Иначе
				СчетРасчетов = Счета.РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ; // 76.36
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СчетРасчетов;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	// контроль загрузки
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	Если РучнаяКорректировка Тогда 
		Возврат; 
	КонецЕсли; 
	
	// не перепроводим при восстановлении последовательности
	ВосстановлениеПоследовательности = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ПроведенВХронологическойПоследовательности");
	Если (ВосстановлениеПоследовательности <> Неопределено) Тогда
		Если (ВосстановлениеПоследовательности) Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	// контроль наличия общих параметров
	CW_БухгалтерияЭкспедитораСервер.УстановитьОбщиеПараметрыПроведенияДокументов();

	Если НЕ ЗаполненыОбщиеПараметры() Тогда 
		СформироватьОбщиеПараметры(,Ложь); 
	КонецЕсли;   
	
	//Подситема.СтатусыДокументов
	ИспользуютсяСтатусыДокументов = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов");
	Если ИспользуютсяСтатусыДокументов И
		Не ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
		//В случае если используются статусы документа и проведение не из формы, тов ДС статуса нет
		ДанныеСтатуса = РегистрыСведений.CW_СтатусыДокументов.ПолучитьДанныеСтатусаДокумента(Ссылка);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СтатусДокумента", ДанныеСтатуса.СтатусДокумента);
	КонецЕсли;
	
	СтатусДокумента = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента", СтатусДокумента);
	
	СтатусДокументаПроводитьПоБухгалтерскомуУчету = CW_СтатусыДокументовСервер.ПолучитьПризнакПроведенияПоБухгалтерскомуУчету(Ссылка, СтатусДокумента);
	//Подситема.СтатусыДокументов
	
	ВедетсяУчетПриложенийПоДоговорам = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	СтруктураПараметровБухУчета.Вставить("ВедетсяУчетПриложений",	ВедетсяУчетПриложенийПоДоговорам);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	
	ПровестиПоБухгалтерскомуУчету = СтатусДокументаПроводитьПоБухгалтерскомуУчету и ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет;    
	
	// вызываем функцию формирования движений для счетов
	Если (Не ФормируетсяАкт ИЛИ НЕ ПровестиПоБухгалтерскомуУчету) Тогда
		
		Если (НЕ Корректировка) Тогда
			CW_Подписки.СформироватьДвиженияДляДоходов(Ссылка,Отказ,ДополнительныеСвойства);
		Иначе
			CW_Подписки.СформироватьДвиженияДляКорректировкиДоходов(Ссылка,Отказ,ДополнительныеСвойства);
		КонецЕсли; 
		
	КонецЕсли; 

	
КонецПроцедуры 

Функция ПроверятьНаличиеВТабличнойЧастиДокументаУслугСПорядкомОтраженияПеревыставление()
	
	
	
	
	
КонецФункции

Процедура ПроверитьСтатусВедомых()
	// --- 
	
	Если (НЕ Корректировка) Тогда
		
		Если (НЕ ВедомыйДокумент.Пустая()) Тогда
			
			Если (ФормируетсяАкт) Тогда
				СинхронизироватьПометкуУдаления(ВедомыйДокумент);
			Иначе
				ПометитьНаУдаление(ВедомыйДокумент);
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (НЕ ВедомыйСчет.Пустая()) Тогда
			
			Если (ФормируетсяСчет) Тогда
				СинхронизироватьПометкуУдаления(ВедомыйСчет);
			Иначе
				ПометитьНаУдаление(ВедомыйСчет);
			КонецЕсли; 
			
		КонецЕсли;  
		
		
		
	КонецЕсли; 
	
	Если (Корректировка) Тогда
		
		Если (НЕ ВедомыйДокументКорректировки.Пустая()) Тогда
			
			Если (ФормируетсяАкт) Тогда
				СинхронизироватьПометкуУдаления(ВедомыйДокументКорректировки);
			Иначе
				ПометитьНаУдаление(ВедомыйДокументКорректировки);
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

Процедура СинхронизироватьПометкуУдаления(Документ)
	// --- 
	
	Если (Документ.ПометкаУдаления <> ПометкаУдаления) Тогда
		
		ВедомыйОбъект = Документ.ПолучитьОбъект();
		_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
		ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

Процедура ПометитьНаУдаление(Документ)
	// --- 
	
	Если (ВедомыйДокумент.ПометкаУдаления <> Истина) Тогда
		
		ВедомыйОбъект = Документ.ПолучитьОбъект();
		_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
		ВедомыйОбъект.УстановитьПометкуУдаления(Истина);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

Процедура СформироватьОбщиеПараметры(Знач СписокПараметров=Неопределено,ИнтерактивныйРежим = Истина) Экспорт 
	
	// получаем параметры договора и константы, помещаем в доп. свойства
	CW_ОбщиеПараметры.СформироватьОбщиеПараметры(ЭтотОбъект,СписокПараметров,ИнтерактивныйРежим);
	ДС = ДополнительныеСвойства;
	
КонецПроцедуры

Функция ЗаполненыОбщиеПараметры() Экспорт 
	// --- 
	
	Возврат(CW_ОбщиеПараметры.ОбщиеПараметрыЗаполнены(ЭтотОбъект));
	
	// --- 
КонецФункции

Процедура ЗаполнитьТаблицуАвансов(ДатаПодбораАвансов) Экспорт 
	// --- 
	
	ЗаполнитьАвансы(ДатаПодбораАвансов,Истина, Ложь);

	// --- 
КонецПроцедуры

Процедура ЗаполнитьТаблицуАвансовОЗ(ДатаПодбораАвансов) Экспорт 
	// --- 
	
	ЗаполнитьАвансы(ДатаПодбораАвансов,Ложь,Истина);
	
	// --- 
КонецПроцедуры

Процедура ЗаполнитьАвансы(ДатаПодбораАвансов,БУ,ОЗ) Экспорт 
	// --- 
	
	Если (БУ) Тогда
		
		ТЧ = ЗачетАвансов;
		
	Иначе
		
		ТЧ = ЗачетАвансовОЗ;
		
	КонецЕсли; 
	
	ДС = ДополнительныеСвойства;
	Счета = CW_Конфигурация.ПланСчетов(); 		
	ТЧ.Очистить();
		
	УслугиПоПорядкуОтражения = Услуги.Выгрузить();
	УслугиПоПорядкуОтражения.Свернуть("ПорядокОтражения", "Всего");
	 
	// определяем счета авансов
	Если (Валюта = ДС.КО.ВалютаРегламентированногоУчета) Тогда
		
		СчетРасчетов = ДС.УП.СчетРасчетов_Клиенты_Рубли;
		Если СчетРасчетов = Счета.РасчетыСПокупателями Тогда
			СчетЗадолженностиПоСобственным = СчетРасчетов;
			СчетЗадолженностиПоВозмещаемым = СчетРасчетов;
			СчетАвансовПоСобственным = Счета.РасчетыПоАвансамПолученным;						
			СчетАвансовПоВозмещаемым = Счета.РасчетыПоАвансамПолученным;
		Иначе
			СчетЗадолженностиПоСобственным = Счета.РасчетыСПокупателями;
			СчетЗадолженностиПоВозмещаемым = СчетРасчетов;
			СчетАвансовПоСобственным = Счета.РасчетыПоАвансамПолученным;						
			СчетАвансовПоВозмещаемым = СчетРасчетов;
		КонецЕсли; 
		
	Иначе
		
		// Валюта
		Если (НЕ Договор.ВзаиморасчетыВУЕ) Тогда
			СчетРасчетов = ДС.УП.СчетРасчетов_Клиенты_Валюта;
			Если СчетРасчетов = Счета.РасчетыСПокупателямиВал Тогда
				СчетАвансовПоСобственным = Счета.РасчетыПоАвансамПолученнымВал;						
				СчетАвансовПоВозмещаемым = Счета.РасчетыПоАвансамПолученнымВал;
			Иначе
				СчетАвансовПоСобственным = Счета.РасчетыПоАвансамПолученнымВал;						
				СчетАвансовПоВозмещаемым = СчетРасчетов;
			КонецЕсли;
		КонецЕсли;
		
		// УЕ
		Если (Договор.ВзаиморасчетыВУЕ) Тогда
			СчетРасчетов = ДС.УП.СчетРасчетов_Клиенты_УЕ;
			Если СчетРасчетов = Счета.РасчетыСПокупателямиУЕ Тогда
				СчетАвансовПоСобственным = Счета.РасчетыПоАвансамПолученнымУЕ;						
				СчетАвансовПоВозмещаемым = Счета.РасчетыПоАвансамПолученнымУЕ;
			Иначе
				СчетАвансовПоСобственным = Счета.РасчетыПоАвансамПолученнымУЕ;						
				СчетАвансовПоВозмещаемым = СчетРасчетов;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	
	ПараметрыТА = Новый Структура("Дата,Договор,ОЗ,РаздельныйУчетЗаполженности,Акт,ПереплатаКакАванс");
	// --- 
	ПараметрыТА.Дата = ДатаПодбораАвансов;
	ПараметрыТА.Договор = Договор;
	ПараметрыТА.ОЗ = ДС.УП.ОЗ;
	ПараметрыТА.Акт = Ссылка;
	ПараметрыТА.РаздельныйУчетЗаполженности = ДС.УП.РаздельныйУчетОперативнойИБухгалтерскойЗадолженности;
	ПараметрыТА.ПереплатаКакАванс 			= ДС.УП.УчитыватьПереплатыПоДокументамКакАванс;
	
	//Подсистема.УчетПриложенийДоговоров
	ПараметрыТА.Вставить("ПриложениеКДоговору",ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	// --- 
	ТЗ_Услуги = Услуги.Выгрузить();
	Если (ПараметрыТА.ОЗ) Тогда
		Если (НЕ СписокСчетов) Тогда
			Если (ЗначениеЗаполнено(Счет)) Тогда
				ТЗ_Услуги.ЗаполнитьЗначения(Счет,"Счет");
			Иначе
				ТЗ_Услуги.ЗаполнитьЗначения(Ссылка,"Счет");
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	Если (БУ) Тогда
		ТаблицаАвансов = CW_Финансы.ТаблицаАвансов(ПараметрыТА,ТЗ_Услуги,ТЧ.Выгрузить(),ЗачетАвансовОЗ.Выгрузить());	
	ИначеЕсли (ОЗ) Тогда 
		ТаблицаАвансов = CW_Финансы.ТаблицаАвансовДляОЗ(ПараметрыТА,ТЗ_Услуги,ТЧ.Выгрузить());
	КонецЕсли; 
	
	ТолькоПоПлатежкамСчетов = ПараметрыТА.ОЗ и НЕ ПараметрыТА.РаздельныйУчетЗаполженности;
	//ДС.ПД.АвтоматическиЗачитыватьТолькоПлатежкиПоСчету;
	// --- 
	МассивСчетовАвансов = Новый Массив;
	Если (СчетАвансовПоВозмещаемым = СчетАвансовПоСобственным) Тогда
		МассивСчетовАвансов.Добавить(СчетАвансовПоСобственным);
	Иначе
		МассивСчетовАвансов.Добавить(СчетАвансовПоСобственным);
		МассивСчетовАвансов.Добавить(СчетАвансовПоВозмещаемым);
	КонецЕсли; 
	// --- 
	СуммаСобственных 	= УслугиПоПорядкуОтражения.Скопировать(Новый Структура("ПорядокОтражения",Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга)).Итог("Всего");
	СуммаПрочих 		= УслугиПоПорядкуОтражения.Скопировать(Новый Структура("ПорядокОтражения",Перечисления.CW_ПорядокОтраженияДоходов.ПрочиеДоходы)).Итог("Всего");
	
	СуммаСобственные 	= СуммаСобственных + СуммаПрочих;
	СуммаВозмещаемые 	= УслугиПоПорядкуОтражения.Итог("Всего") - СуммаСобственные;
	
	// распределение
	Для каждого СчетАванса Из МассивСчетовАвансов Цикл
		// --- 
		
		Если (СчетАвансовПоВозмещаемым = СчетАвансовПоСобственным) Тогда
			
			ТаблицаАнализа = ТаблицаАвансов;
			// --- 
			СуммаАванса = _сф.Итог(ТаблицаАвансов,"Аванс");
			СуммаРаспределения = _сф.Итог(УслугиПоПорядкуОтражения,"Всего");
			
		Иначе
			
			Если (СчетАванса = СчетАвансовПоСобственным) Тогда
				
				Отбор = Новый Структура("СчетАванса",СчетАванса);
				ТаблицаАнализа = ТаблицаАвансов.Скопировать(Отбор);
				// --- 
				СуммаАванса = _сф.Итог(ТаблицаАнализа,"Аванс");
				СуммаРаспределения = СуммаСобственные;					             					
				
			Иначе
				
				Отбор = Новый Структура("СчетАванса",СчетАванса);
				ТаблицаАнализа = ТаблицаАвансов.Скопировать(Отбор);
				// --- 
				СуммаАванса = _сф.Итог(ТаблицаАнализа,"Аванс");
				СуммаРаспределения = СуммаВозмещаемые;	
				
			КонецЕсли; 
			
		КонецЕсли; 
		// --- 
		ОстатокРаспределения = Мин(СуммаРаспределения,СуммаАванса);
		ОстаткиЗачетаПоАктированию = Новый СписокЗначений;
		Для каждого Стр Из ТаблицаАнализа Цикл
			
			Если (ОстатокРаспределения <= 0) Тогда Прервать; КонецЕсли;
			
			Если (БУ И ТолькоПоПлатежкамСчетов И Стр.ПризнакОплатыСчетовДокумента <> Истина) Тогда
				Продолжить;
			КонецЕсли; 
			
			Нстр = ТЧ.Добавить();
			// --- 
			Нстр.ДокументАванса = Стр.ДокументАванса;
			Нстр.ДокументОплаты = Стр.ДокументОплаты;
			Нстр.СчетАванса = Стр.СчетАванса;
			Нстр.СчетЗадолженности = Стр.СчетЗадолженности;
			// --- 
			Если (БУ) Тогда
				Нстр.Счет = Стр.Счет;
				Если (ТолькоПоПлатежкамСчетов) Тогда
					ОстатокЗадолженности = ОстаткиЗачетаПоАктированию.НайтиПоЗначению(Стр.Счет);
					Если (ОстатокЗадолженности = Неопределено) Тогда
						ОстатокЗадолженности = ОстаткиЗачетаПоАктированию.Добавить(Стр.Счет, Формат(Стр.Задолженность,"ЧН=; ЧГ="));
					КонецЕсли;
					НезачтенноеАктированноеСальдо = Число(ОстатокЗадолженности.Представление);
					Нстр.СуммаЗачета = Мин(ОстатокРаспределения,Стр.Аванс,НезачтенноеАктированноеСальдо);
					ОстатокЗадолженности.Представление = Формат(НезачтенноеАктированноеСальдо-Нстр.СуммаЗачета,"ЧН=; ЧГ=");
				Иначе
					Нстр.СуммаЗачета = Мин(ОстатокРаспределения,Стр.Аванс);
				КонецЕсли; 
			Иначе
				Нстр.СуммаЗачета = Мин(ОстатокРаспределения,Стр.Аванс);
			КонецЕсли; 
			// --- 
			_сф.Декремент(ОстатокРаспределения,Нстр.СуммаЗачета);
			Если (Нстр.СуммаЗачета = 0) Тогда
				ТЧ.Удалить(Нстр);
			КонецЕсли; 
			
		КонецЦикла; 

		// --- 
	КонецЦикла; 
	
	// сформируем текстовое представление платежки в ТЧ зачета авансов
	Для Каждого Стр Из ТЧ Цикл
		
		Попытка
			
			Если (БУ) Тогда
				
				Если НЕ Стр.ДокументАванса.НомерВходящегоДокумента = "" Тогда
					ВхНомер = Строка(Стр.ДокументАванса.НомерВходящегоДокумента);
				Иначе
					ВхНомер = "";
				КонецЕсли;	
				
				Если НЕ Стр.ДокументАванса.ДатаВходящегоДокумента = Дата("00010101") Тогда
					ВхДата = Строка(Формат(Стр.ДокументАванса.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy"));
				Иначе
					ВхДата = "";
				КонецЕсли;
				
				Если ВхНомер = "" ИЛИ ВхДата = "" Тогда
					Стр.ПредставлениеДокументаАванса = "Не задан!" ;
				Иначе
					Стр.ПредставлениеДокументаАванса = "№" + ВхНомер + " от " + ВхДата;
				КонецЕсли;	 
				
			ИначеЕсли (ОЗ) Тогда 
				
				Стр.ПредставлениеДокументаАванса = Стр.ДокументОплаты.ПредставлениеДокумента; 
				
			КонецЕсли; 
			
		Исключение
			
			// если аналитика заполнена
			Если ЗначениеЗаполнено(Стр.ДокументАванса) Тогда 
				
				Стр.ПредставлениеДокументаАванса = "№" + Строка(Стр.ДокументАванса.Номер) + " от " +  Формат(Стр.ДокументАванса.Дата, "ДЛФ=Д"); 
				
			// если документ не определен
			Иначе
				Стр.ПредставлениеДокументаАванса = Строка(Стр.ДокументАванса);	
			КонецЕсли;
			
		КонецПопытки	
		
	КонецЦикла;	
	
	// --- 
КонецПроцедуры

Функция ПроверкаНомеров(ПровестиПоБухгалтерскомуУчету)
	
	Если (НЕ ПровестиПоБухгалтерскомуУчету) Тогда
		
		Возврат(Истина);
		
	КонецЕсли; 
	
	ТребуетсяКонтрольСчета = Ложь;
	ТребуетсяКонтрольАкта = Ложь;
	ТребуетсяКонтрольСФ = Ложь;
	
	// анализируем, что мы можем проверить
	
	Если (ДС.УП.ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
		ИЛИ ДС.УП.ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) Тогда
		
		ТребуетсяКонтрольСчета = (ФормируетсяСчет);
		Если (ТребуетсяКонтрольСчета) Тогда
			НомерСчетаДляКонтроля = ?(ЗначениеЗаполнено(НомерСчета),НомерСчета,Номер);	
			ДатаСчетаДляКонтроля = ?(ЗначениеЗаполнено(ДатаСчета),ДатаСчета,Дата);
		КонецЕсли; 
		// --- 
		ТребуетсяКонтрольАкта = (ФормируетсяАкт);
		Если (ТребуетсяКонтрольАкта) Тогда
			НомерАктаДляКонтроля = ?(ЗначениеЗаполнено(НомерАкта),НомерАкта,Номер);
			ДатаАктаДляКонтроля = ?(ЗначениеЗаполнено(ДатаАкта),ДатаАкта,Дата);
		КонецЕсли;  
		// --- 
		ТребуетсяКонтрольСФ = (ФормируетсяАкт И ФормируетсяСчетФактура);
		Если (ТребуетсяКонтрольСФ) Тогда
			НомерСФДляКонтроля = ?(ЗначениеЗаполнено(НомерСчетаФактуры),НомерСчетаФактуры,Номер);
			ДатаСФДляКонтроля = ?(ЗначениеЗаполнено(ДатаСчетаФактуры),ДатаСчетаФактуры,?(ЗначениеЗаполнено(ДатаАкта),ДатаАкта,Дата));
		КонецЕсли; 
		
	КонецЕсли;
	
	Если (ДС.УП.ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда
		
		ТребуетсяКонтрольСчета = (ФормируетсяСчет И ЗначениеЗаполнено(НомерСчета) И ЗначениеЗаполнено(ДатаСчета));
		Если (ТребуетсяКонтрольСчета) Тогда
			НомерСчетаДляКонтроля = НомерСчета;	
			ДатаСчетаДляКонтроля = ДатаСчета;
		КонецЕсли; 
		ТребуетсяКонтрольАкта = (ФормируетсяАкт И ЗначениеЗаполнено(НомерАкта) И ЗначениеЗаполнено(ДатаАкта));
		Если (ТребуетсяКонтрольАкта) Тогда
			НомерАктаДляКонтроля = НомерАкта;
			ДатаАктаДляКонтроля = ДатаАкта;
		КонецЕсли;
		ТребуетсяКонтрольСФ = ФормируетсяАкт И ФормируетсяСчетФактура И ЗначениеЗаполнено(НомерСчетаФактуры) И ЗначениеЗаполнено(ДатаСчетаФактуры) И ВидОперацииКорректировки <> ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки");
		Если (ТребуетсяКонтрольСФ) Тогда
			НомерСФДляКонтроля 	= НомерСчетаФактуры;
			ДатаСФДляКонтроля 	= ДатаСчетаФактуры;
		КонецЕсли; 
		
	КонецЕсли; 
		
	Если (ТребуетсяКонтрольСчета) Тогда
		
		НомерСчетаУникальный = Ложь;
		Запрос = Новый Запрос("ВЫБРАТЬ 
							  |	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		                      |ГДЕ
		                      |	СчетНаОплатуПокупателю.Номер = &Номер
		                      |	И ГОД(СчетНаОплатуПокупателю.Дата) = &Год
		                      |	И СчетНаОплатуПокупателю.Ссылка <> &ВедомыйСчет
		                      |	И СчетНаОплатуПокупателю.Организация = &Организация");
		
		Запрос.УстановитьПараметр("Номер", НомерСчетаДляКонтроля);
		Запрос.УстановитьПараметр("Год", Год(ДатаСчетаДляКонтроля));
		Запрос.УстановитьПараметр("ВедомыйСчет", ВедомыйСчет);
		Запрос.УстановитьПараметр("Организация", ВедомыйСчет.Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			НомерСчетаУникальный = Истина;
		Иначе
			ПредтавлениеОшибки = "";
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ПредтавлениеОшибки = СокрЛП(Выборка.Ссылка);
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружены счета: "+ Символы.ПС + ПредтавлениеОшибки);
			
		КонецЕсли;
		
	Иначе
		
		НомерСчетаУникальный = Истина;
		
	КонецЕсли; 
	
	Если (ТребуетсяКонтрольАкта) Тогда
		
		НомерРеализацииУникальный = Ложь;
		// --- 
		Если (НЕ Корректировка) Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	РеализацияТоваровУслуг.Номер КАК Номер,
			                      |	РеализацияТоваровУслуг.Дата КАК Дата,
			                      |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			                      |ГДЕ
			                      |	РеализацияТоваровУслуг.Номер = &Номер
			                      |	И РеализацияТоваровУслуг.Ссылка <> &ВедомыйАкт
			                      |	И ГОД(РеализацияТоваровУслуг.Дата) = &Год
			                      |	И РеализацияТоваровУслуг.Организация = &Организация");
			Запрос.УстановитьПараметр("ВедомыйАкт", ВедомыйДокумент);
			Запрос.УстановитьПараметр("Организация", ВедомыйДокумент.Организация);
		
		Иначе
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	КорректировкаРеализации.Номер КАК Номер,
			                      |	КорректировкаРеализации.Дата КАК Дата,
			                      |	КорректировкаРеализации.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Документ.КорректировкаРеализации КАК КорректировкаРеализации
			                      |ГДЕ
			                      |	КорректировкаРеализации.Номер = &Номер
			                      |	И КорректировкаРеализации.Ссылка <> &ВедомыйАкт
			                      |	И ГОД(КорректировкаРеализации.Дата) = &Год
			                      |	И КорректировкаРеализации.Организация = &Организация");
			Запрос.УстановитьПараметр("ВедомыйАкт", ВедомыйДокументКорректировки);
			Запрос.УстановитьПараметр("Организация", ВедомыйДокументКорректировки.Организация);
		КонецЕсли; 
		Запрос.УстановитьПараметр("Номер", НомерАктаДляКонтроля);
		Запрос.УстановитьПараметр("Год", Год(ДатаАктаДляКонтроля));
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			НомерРеализацииУникальный = Истина;
		Иначе
			ПредтавлениеОшибки = "";
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ПредтавлениеОшибки = СокрЛП(Выборка.Ссылка);
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружены документы реализации: "+ Символы.ПС +ПредтавлениеОшибки);
			
		КонецЕсли;
			
	Иначе
		
		НомерРеализацииУникальный = Истина;
		
	КонецЕсли; 
	
	Если (ТребуетсяКонтрольСФ) Тогда
		
		НомерСФУникальный = Ложь;
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	СчетФактураВыданный.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		                      |ГДЕ
		                      |	СчетФактураВыданный.Номер = &Номер
		                      |	И ГОД(СчетФактураВыданный.Дата) = &Год
		                      |	И СчетФактураВыданный.ДокументОснование <> &ВедомыйАкт
		                      |	И СчетФактураВыданный.Ссылка <> &СчетФактура
		                      |	И СчетФактураВыданный.Организация = &Организация");
		
		Запрос.УстановитьПараметр("Год", Год(ДатаСФДляКонтроля));
		Если (НЕ Корректировка) Тогда
			Запрос.УстановитьПараметр("Номер", 		 НомерСФДляКонтроля);
			Запрос.УстановитьПараметр("ВедомыйАкт",  ВедомыйДокумент);	
			Запрос.УстановитьПараметр("СчетФактура", ВедомыйСчетФактура);
			Запрос.УстановитьПараметр("Организация", ВедомыйСчетФактура.Организация);
		Иначе
			Запрос.УстановитьПараметр("Номер", 		 ВедомыйСчетФактураКорректировочный.Номер);
			Запрос.УстановитьПараметр("ВедомыйАкт",  ВедомыйДокументКорректировки);
			Запрос.УстановитьПараметр("СчетФактура", ВедомыйСчетФактураКорректировочный);
			Запрос.УстановитьПараметр("Организация", ВедомыйСчетФактураКорректировочный.Организация);
		КонецЕсли; 
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			НомерСФУникальный = Истина;
		Иначе
			ПредтавлениеОшибки = "";
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ПредтавлениеОшибки = СокрЛП(Выборка.Ссылка);
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обнаружены счета-фактуры: " + Символы.ПС + ПредтавлениеОшибки);
			
		КонецЕсли;

	Иначе
		
		НомерСФУникальный = Истина;
		
	КонецЕсли; 
	
	Возврат(НомерРеализацииУникальный И НомерСФУникальный И НомерСчетаУникальный);

КонецФункции	

Функция ПроверитьЗакрытиеГрузоперевозок() Экспорт 
	// --- 
	
	Возврат(CW_Мониторинг.ПроверитьЗакрытиеГрузоперевозок(ЭтотОбъект));
	
	// --- 
КонецФункции

//УСТАРЕЛА. Следует использовать функцию АвтоматическийПодборСчетов(ВариантПодбора)
Функция ВыполнитьАвтоматическийПодборСчетов(ВариантПодбора) Экспорт
	// --- 
	
	Объект = ЭтотОбъект;  
	
	СтруктураНастроек  = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Организация,Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская, Дата); 
	ИспользуетсяОперативнаяЗадолженность = СтруктураНастроек["ВедетсяОперативныйУчет"];
	РежимВводначальныхОстатков_ОЗ 		 = СтруктураНастроек["ВводОстатков"];
	
	НастройкиОперативногоУчета = СтруктураНастроек["НастройкиОперативногоУчета"]; 
	КонтрольНоменклатуры 		= НастройкиОперативногоУчета["КонтрольНоменклатуры"];
	КонтрольПорядкаОтражения 	= НастройкиОперативногоУчета["КонтрольПорядкаОтражения"];
	КонтрольНДС 				= НастройкиОперативногоУчета["КонтрольНДС"];
	
	Если НЕ ИспользуетсяОперативнаяЗадолженность Тогда
		
		Возврат(_УФКС.Ответ(1,"Не используется оперативная задолжненность"));
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_АктированиеИсходящихСчетовОстатки.Счет,
	               |	CW_АктированиеИсходящихСчетовОстатки.ВсегоОстаток КАК Всего,
	               |	ЛОЖЬ КАК ЕстьСтроки,
	               |	CW_АктированиеИсходящихСчетовОстатки.Грузоперевозка,
	               |	CW_АктированиеИсходящихСчетовОстатки.Номенклатура,
	               |	CW_АктированиеИсходящихСчетовОстатки.ПорядокОтражения,
	               |	CW_АктированиеИсходящихСчетовОстатки.СтавкаНДС
	               |ИЗ
	               |	РегистрНакопления.CW_АктированиеИсходящихСчетов.Остатки(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Контрагент = &Контрагент
	               |				И Договор = &Договор
	               |				И Грузоперевозка = &Грузоперевозка
	               |				И ВЫБОР
	               |					КОГДА &Номенклатура = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ Номенклатура = &Номенклатура
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &ПорядокОтражения = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ПорядокОтражения = &ПорядокОтражения
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &СтавкаНДС = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ СтавкаНДС = &СтавкаНДС
	               |				КОНЕЦ) КАК CW_АктированиеИсходящихСчетовОстатки
	               |ГДЕ
	               |	CW_АктированиеИсходящихСчетовОстатки.ВсегоОстаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_АктированиеИсходящихСчетовОстатки.Счет.ДатаСчета";
	Если (ВариантПодбора = 0) Тогда
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Иначе
		Запрос.УстановитьПараметр("Период", Объект.ДатаАкта);
	КонецЕсли; 
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Договор", Объект.Договор); 
	// --- 
	ТЗУслуги = Объект.Услуги.Выгрузить();
	ТЗУслуги.Колонки.Добавить("СчетПодобран");
	ТЗУслуги.ЗаполнитьЗначения(Ложь,"СчетПодобран");
	
	// --- 
	
	ТаблицаОстатковАктирования = Неопределено;
	// --- 
	
	Для каждого СтрокаДокумента Из ТЗУслуги Цикл
		
		Запрос.УстановитьПараметр("Грузоперевозка", СтрокаДокумента.Грузоперевозка); 
		Запрос.УстановитьПараметр("Номенклатура", ?(КонтрольНоменклатуры,СтрокаДокумента.Номенклатура,Неопределено)); 	
		Запрос.УстановитьПараметр("ПорядокОтражения", ?(КонтрольПорядкаОтражения,СтрокаДокумента.ПорядокОтражения,Неопределено)); 	
		Запрос.УстановитьПараметр("СтавкаНДС", ?(КонтрольНДС,СтрокаДокумента.СтавкаНДС,Неопределено)); 	
		// --- 
		
		Отбор = Новый Структура;
		Отбор.Вставить("Грузоперевозка",СтрокаДокумента.Грузоперевозка);
		Если (КонтрольНоменклатуры) Тогда
			Отбор.Вставить("Номенклатура",СтрокаДокумента.Номенклатура);
		КонецЕсли; 
		Если (КонтрольПорядкаОтражения) Тогда
			Отбор.Вставить("ПорядокОтражения",СтрокаДокумента.ПорядокОтражения);
		КонецЕсли; 
		Если (КонтрольНДС) Тогда
			Отбор.Вставить("СтавкаНДС",СтрокаДокумента.СтавкаНДС);
		КонецЕсли; 
		
		// --- 
		
		ПоДаннымЗапроса = Ложь;
		
		Если (ТаблицаОстатковАктирования = Неопределено) Тогда
			ТЗ = Запрос.Выполнить().Выгрузить();
			ПоДаннымЗапроса = Истина;
			ТаблицаОстатковАктирования = ТЗ.СкопироватьКолонки();	
		Иначе
			// пробуем найти
			ТЗ = ТаблицаОстатковАктирования.НайтиСтроки(Отбор);
			Если (ТЗ.Количество() = 0) Тогда
				ТЗ = Запрос.Выполнить().Выгрузить();
				ПоДаннымЗапроса = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
		Если (ПоДаннымЗапроса) Тогда
			
			МассивУдаления = Новый Массив;
			Для каждого Стр Из ТЗ Цикл
				Если (Стр.Счет.Пустая()) Тогда
					МассивУдаления.Добавить(Стр);
				КонецЕсли; 
			КонецЦикла; 
			_сф.к_УдалитьЭлементыПоМассиву(ТЗ,МассивУдаления);
			
			// --- 
			
			// переносим в таблицу остатков
			Для каждого Стр Из ТЗ Цикл
				Нстр = ТаблицаОстатковАктирования.Добавить();
				ЗаполнитьЗначенияСвойств(Нстр,Стр);
			КонецЦикла; 
			
		КонецЕсли; 
		
		// --- 
		
		КоличествоСтрок = ТЗ.Количество();
		Если (КоличествоСтрок = 1) Тогда
			
			// подставляем счет
			Если (СтрокаДокумента.Всего <= ТЗ[0].Всего) Тогда
				
				СтрокаДокумента.Счет = ТЗ[0].Счет;
				СтрокаДокумента.СчетПодобран = Истина;
				// --- 
				_сф.Декремент(ТЗ[0].Всего,СтрокаДокумента.Всего);
				
			КонецЕсли; 
			
		ИначеЕсли (КоличествоСтрок > 1) Тогда 
			
			// анализируем, ищем строку
			СчетПодобран = Ложь;
			Для каждого СтрокаТЗ Из ТЗ Цикл
				
				Если (СчетПодобран) Тогда
					Прервать;
				КонецЕсли; 
				
				Отбор = Новый Структура("Грузоперевозка,Номенклатура",СтрокаДокумента.Грузоперевозка,СтрокаДокумента.Номенклатура);
				УдовлетворяющиеСтроки = _сф.к_НайтиСтроки(СтрокаТЗ.Счет.Услуги,Отбор);
				Если (УдовлетворяющиеСтроки.Количество()<>0) Тогда
					
					Для каждого Стр Из УдовлетворяющиеСтроки Цикл
						
						Если (Стр.Всего >= СтрокаДокумента.Всего) Тогда
							СтрокаТЗ.ЕстьСтроки = Истина;
						КонецЕсли; 
						
						Если (Стр.Всего = СтрокаДокумента.Всего) Тогда
							
							СтрокаДокумента.Счет = СтрокаТЗ.Счет;
							СтрокаДокумента.СчетПодобран = Истина;
							_сф.Декремент(СтрокаТЗ.Всего,СтрокаДокумента.Всего);
							СчетПодобран = Истина;
							Продолжить;
							
						КонецЕсли; 
						
					КонецЦикла; 
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			Если (НЕ СчетПодобран) Тогда
				
				// берем первую строку из таблицы с соответствующими строками
				ЕстьСтроки = Ложь;
				Для каждого Стр Из ТЗ Цикл
					
					Если (Стр.ЕстьСтроки) Тогда
						ЕстьСтроки = Истина;
						Прервать;
					КонецЕсли; 
					
				КонецЦикла; 
				
				Если (ЕстьСтроки) Тогда
					
					// подставляем счет
					Для каждого Стр Из ТЗ Цикл
						
						Если (Стр.ЕстьСтроки) Тогда
							
							Если (Стр.Всего >= СтрокаДокумента.Всего) Тогда
								
								СтрокаДокумента.Счет = Стр.Счет;
								СтрокаДокумента.СчетПодобран = Истина;	
								// --- 
								_сф.Декремент(Стр.Всего, СтрокаДокумента.Всего);
								
							КонецЕсли; 
							
						КонецЕсли; 
						
					КонецЦикла; 
					
				Иначе
					
					Если (ТЗ[0].Всего >= СтрокаДокумента.Всего) Тогда
						
						СтрокаДокумента.Счет = ТЗ[0].Счет;
						СтрокаДокумента.СчетПодобран = Истина;
						// --- 
						_сф.Декремент(ТЗ[0].Всего,СтрокаДокумента.Всего);
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// анализируем и переносим найденные счета в 
	КоличествоНеподобранных = ТЗУслуги.Скопировать(Новый Структура("СчетПодобран",Ложь)).Количество();
	
	КолонкаСчетов = ТЗУслуги.Скопировать(,"Счет");
	КолонкаСчетов.Свернуть("Счет");
	Счета = КолонкаСчетов.ВыгрузитьКолонку("Счет");
	
	Если (Счета.Количество()=1 И КоличествоНеподобранных = 0) Тогда
		
		Объект.СписокСчетов = Ложь;
		Объект.Счет = Счета[0];
		
	Иначе
		
		Объект.СписокСчетов = Истина;
		Объект.Счет = Документы.CW_ДоходыПоГрузоперевозке.ПустаяСсылка();
		// --- 
		// переносим в ТЧ
		ВТЧ = Объект.Услуги.Выгрузить();
		ВТЧ.ЗагрузитьКолонку(ТЗУслуги.ВыгрузитьКолонку("Счет"),"Счет");
		Объект.Услуги.Загрузить(ВТЧ);
		
	КонецЕсли; 
	// --- 
	ТекстСообщения = "";
	Если (КоличествоНеподобранных=0) Тогда
		ТекстСообщения = "Счета подобраны.";
	Иначе
		ТекстСообщения = "Для "+Строка(КоличествоНеподобранных)+" строк(и) подобрать счета не удалось.";
	КонецЕсли; 
	Ответ = _УФКС.Ответ(,ТекстСообщения);
	
	Возврат(Ответ);
	
	// --- 
КонецФункции

Функция АвтоматическийПодборСчетов(ВариантПодбора) Экспорт
	
	СтруктураНастроек  = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Организация,Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская, Дата); 

	ИспользуетсяОперативнаяЗадолженность = СтруктураНастроек["ВедетсяОперативныйУчет"]; 
	Если Не ИспользуетсяОперативнаяЗадолженность Тогда
		ВызватьИсключение "Не используется оперативная задолжненность";	
	КонецЕсли;
	
	НастройкиОперативногоУчета = СтруктураНастроек["НастройкиОперативногоУчета"]; 
	КонтрольНоменклатуры 		= НастройкиОперативногоУчета["КонтрольНоменклатуры"];
	КонтрольПорядкаОтражения 	= НастройкиОперативногоУчета["КонтрольПорядкаОтражения"];
	КонтрольНДС 				= НастройкиОперативногоУчета["КонтрольНДС"];
	
	Если ВариантПодбора = 0 Тогда
		ДатаСреза = ТекущаяДата();
	Иначе
		ДатаСреза = ДатаАкта;
	КонецЕсли;     
	
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаУслуг.Грузоперевозка КАК Грузоперевозка,
	|	ТаблицаУслуг.Номенклатура КАК Номенклатура,
	|	ТаблицаУслуг.ПорядокОтражения КАК ПорядокОтражения,
	|	ТаблицаУслуг.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	&ТаблицаУслуг КАК ТаблицаУслуг";
	
	Запрос.УстановитьПараметр("ТаблицаУслуг", Услуги.Выгрузить());
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДанныеДокумента.Грузоперевозка КАК Грузоперевозка
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента"; 
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивГрузоперевозок = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	
	ЗапросАктирование = Новый Запрос;
	ЗапросАктирование.Текст = "ВЫБРАТЬ
	|	CW_АктированиеИсходящихСчетовОстатки.Грузоперевозка КАК Грузоперевозка,
	|	CW_АктированиеИсходящихСчетовОстатки.Номенклатура КАК Номенклатура,
	|	CW_АктированиеИсходящихСчетовОстатки.ПорядокОтражения КАК ПорядокОтражения,
	|	CW_АктированиеИсходящихСчетовОстатки.СтавкаНДС КАК СтавкаНДС,
	|	CW_АктированиеИсходящихСчетовОстатки.Счет КАК Счет,
	|	CW_АктированиеИсходящихСчетовОстатки.ВсегоОстаток КАК Всего
	|ИЗ
	|	РегистрНакопления.CW_АктированиеИсходящихСчетов.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И Договор = &Договор
	|				И Грузоперевозка В (&Грузоперевозки)   
	|				//УСЛОВИЕ_Номенклатура
	|				//УСЛОВИЕ_ПорядокОтражения 
	|				//УСЛОВИЕ_СтавкаНДС
	|				И Счет <> ЗНАЧЕНИЕ(Документ.CW_ДоходыПоГрузоперевозке.ПустаяСсылка)) КАК CW_АктированиеИсходящихСчетовОстатки
	|ГДЕ
	|	CW_АктированиеИсходящихСчетовОстатки.ВсегоОстаток > 0";  
	
	ЗапросАктирование.УстановитьПараметр("Период", 			ДатаСреза);
	ЗапросАктирование.УстановитьПараметр("Организация", 	Организация);
	ЗапросАктирование.УстановитьПараметр("Контрагент", 		Контрагент);
	ЗапросАктирование.УстановитьПараметр("Договор", 		Договор);   
	ЗапросАктирование.УстановитьПараметр("Грузоперевозки", 	МассивГрузоперевозок); 
	
	Если КонтрольНоменклатуры Тогда   
		
		ЗапросАктирование.Текст = СтрЗаменить(ЗапросАктирование.Текст, "//УСЛОВИЕ_Номенклатура", "И Номенклатура В (&Номенклатура)");	
	
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента";
		
		РезультатЗапроса = Запрос.Выполнить();
		МассивНоменклатуры = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		ЗапросАктирование.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	КонецЕсли;   
	
	Если КонтрольПорядкаОтражения Тогда   
		ЗапросАктирование.Текст = СтрЗаменить(ЗапросАктирование.Текст, "//УСЛОВИЕ_ПорядокОтражения", "И ПорядокОтражения В (&ПорядокОтражения)");	
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеДокумента.ПорядокОтражения КАК ПорядокОтражения
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента";
		
		РезультатЗапроса = Запрос.Выполнить();
		МассивПорядокОтражения = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПорядокОтражения"); 
		
		ЗапросАктирование.УстановитьПараметр("ПорядокОтражения", МассивПорядокОтражения);
	КонецЕсли;   
	
	Если КонтрольНДС Тогда
		ЗапросАктирование.Текст = СтрЗаменить(ЗапросАктирование.Текст, "//УСЛОВИЕ_СтавкаНДС", "И СтавкаНДС В (&СтавкаНДС)");	
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ДанныеДокумента.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента"; 
		
		РезультатЗапроса = Запрос.Выполнить();
		МассивСтавкаНДС = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СтавкаНДС"); 
		
		ЗапросАктирование.УстановитьПараметр("СтавкаНДС", МассивСтавкаНДС);
	КонецЕсли;
	
	РезультатЗапроса = ЗапросАктирование.Выполнить();
	ТаблицаСчетов = РезультатЗапроса.Выгрузить(); 
	ТаблицаСчетов.Колонки.Добавить("Выбран", Новый ОписаниеТипов("Булево"));
	ТаблицаСчетов.Сортировать("Всего ВОЗР");
	
	Подобрано = 0;
	
	Для Каждого СтрокаУслуг из Услуги Цикл   
		
		ОтборСтрок = Новый Структура; 
		ОтборСтрок.Вставить("Выбран", 			Ложь); 
		ОтборСтрок.Вставить("Грузоперевозка", 	СтрокаУслуг.Грузоперевозка); 
		ОтборСтрок.Вставить("Всего", 			СтрокаУслуг.Всего); 
		
		Если КонтрольНоменклатуры Тогда
			ОтборСтрок.Вставить("Номенклатура", 	СтрокаУслуг.Номенклатура);
		КонецЕсли;
		Если КонтрольПорядкаОтражения Тогда
			ОтборСтрок.Вставить("ПорядокОтражения", СтрокаУслуг.ПорядокОтражения);
		КонецЕсли;
		Если КонтрольНДС Тогда
			ОтборСтрок.Вставить("СтавкаНДС", 		СтрокаУслуг.СтавкаНДС);
		КонецЕсли;  
		
		
		Пока Истина Цикл
			
			НайденныеСтроки = ТаблицаСчетов.НайтиСтроки(ОтборСтрок); 
			Если НайденныеСтроки.Количество() = 0 Тогда 
				Если ОтборСтрок.Свойство("СтавкаНДС") Тогда
					ОтборСтрок.Удалить("СтавкаНДС");  
				КонецЕсли;
				Если ОтборСтрок.Свойство("ПорядокОтражения") Тогда
					ОтборСтрок.Удалить("ПорядокОтражения");   
				КонецЕсли;
				Если ОтборСтрок.Свойство("Номенклатура") Тогда
					ОтборСтрок.Удалить("Номенклатура");   
				КонецЕсли;
				Если ОтборСтрок.Свойство("Всего") Тогда
					ОтборСтрок.Удалить("Всего");   
				КонецЕсли;
			КонеЦЕсли;
			
			Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл 
				Если НайденнаяСтрока.Всего >= СтрокаУслуг.Всего Тогда
					
					СтрокаУслуг.Счет 		= НайденнаяСтрока.Счет; 
					НайденнаяСтрока.Всего 	= НайденнаяСтрока.Всего - СтрокаУслуг.Всего;
					
					Подобрано = Подобрано + 1;  
					
					Если НайденнаяСтрока.Всего = 0 Тогда
						НайденнаяСтрока.Выбран = Истина;
					КонецЕсли;
					
					Прервать; 
					
				КонецЕсли;
			КонецЦикла;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;  
	
	НеПодобрано = Услуги.Количество() - Подобрано;
	
	Если НеПодобрано = 0 Тогда
		ТекстСообщения = "Счета подобраны.";
		
		// если во всех строках подобрали только один счет, то пропишем его в шапку
		ТЗСчетов = Услуги.Выгрузить();
		ТЗСчетов.Свернуть("Счет");
		Если ТЗСчетов.Количество() = 1 Тогда
			СписокСчетов = Ложь; 
			Счет = ТЗСчетов[0]["Счет"];
		КонецЕсли;
		
	Иначе
		ТекстСообщения = "Для "+Строка(НеПодобрано)+" строк(и) подобрать счета не удалось.";
	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Код", 0);
	Ответ.Вставить("ОписаниеОшибки",ТекстСообщения);
	
	Возврат Ответ;
	
КонецФункции
  
Процедура СформироватьВознаграждениеЭкспедитра(ДанныеЗаполнения, ПараметрыДоговора)
	
	НоменклатураВознаграждения 	= ПараметрыДоговора.Номенклатура;
	
	//Подситема.СтатусыДокументов
	СтатусДокумента 				= Справочники.CW_СтатусыДокументов.ПолучитьСтатусНовогоОбъекта(ТипЗнч(Ссылка));
	
	СтатусДокументаПроводитьПоБухгалтерскомуУчету 	= CW_СтатусыДокументовСервер.ПолучитьПризнакПроведенияПоБухгалтерскомуУчету(Ссылка, СтатусДокумента);
	//Подситема.СтатусыДокументов
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				ДанныеЗаполнения.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ДанныеЗаполнения.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, ДанныеЗаполнения.Дата);
	
	ПровестиПоБухгалтерскомуУчету = СтатусДокументаПроводитьПоБухгалтерскомуУчету и ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет;
	
	
	#Область Заполнение_шапки_Документа
	//Заполняем шапку документа
	Дата 							= ДанныеЗаполнения.Дата;
	ВидОперации 					= Перечисления.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг;
	Организация 					= ДанныеЗаполнения.Организация;
	Ответственный					= ДанныеЗаполнения.Ответственный;
	Руководитель					= ДанныеЗаполнения.Руководитель;
	ЗаРуководителяПоПриказу			= ДанныеЗаполнения.Руководитель_основание;
	ГлавныйБухгалтер				= ДанныеЗаполнения.ГлавныйБухгалтер;
	ЗаГлавногоБухгалтераПоПриказу	= ДанныеЗаполнения.ГлавныйБухгалтер_основание;
	
	Контрагент 						= ДанныеЗаполнения.Контрагент;
	Договор 						= ДанныеЗаполнения.Договор;
	Валюта 							= ДанныеЗаполнения.ВалютаДокумента;
	
	ДатаСчета 						= "";
	ДатаАкта  						= "";
	ДатаСчетаФактуры 				= "";
	
	НомерСчета 						= "";
	НомерАкта 						= "";
	НомерСчетаФактуры 				= "";
	
	Если ЗначениеЗаполнено(ПараметрыДоговора.ПорядокЗачетаАвансовОЗ) Тогда
		СпособЗачетаАвансовОЗ = ПараметрыДоговора.ПорядокЗачетаАвансовОЗ;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыДоговора.ПорядокЗачетаАвансов) Тогда
		СпособЗачетаАвансов = ПараметрыДоговора.ПорядокЗачетаАвансов;
	КонецЕсли;
	
	Если НЕ ПровестиПоБухгалтерскомуУчету Тогда
		СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
	КонецЕсли;
			
	Комментарий	= "Агентское вознагражжение к документу: "+СокрЛП(ДанныеЗаполнения);
	
	#КонецОбласти
	
	#Область заполение_табличной_части_документа
	//Получаем данных для заполнения таблицы документа
	СтруктураСвязанняеДокументы = Документы.CW_ОтчетЭкспедитора.ПолучитьСвязанныеДоходыПоГрузопереовзкам(ДанныеЗаполнения);
	
	ЗаполнитьТабличнуюЧастьВознаграждение(СтруктураСвязанняеДокументы.Проведенные, НоменклатураВознаграждения, ПараметрыДоговора, ДанныеЗаполнения);

	#КонецОбласти
	

КонецПроцедуры

Функция ПолучитьОсновнуюСтатьюЗатрат(Знач НоменклатураВознаграждения, ДанныеЗаполнения)
	
	ОсновнаяСтатьяЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
	
	//получим статью затрат для номенклатуры вознаграждения
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СтатьиЗатратНоменклатуры.Номенклатура КАК Номенклатура,
	|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат КАК СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры
	|ГДЕ
	|	CW_СтатьиЗатратНоменклатуры.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураВознаграждения);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ОсновнаяСтатьяЗатрат = Выборка.СтатьяЗатрат;
	Иначе
		ОсновнаяСтатьяЗатрат = CW_Настройки.ПараметрУчетнойПолитики(ДанныеЗаполнения.Дата, ДанныеЗаполнения.Договор.Организация, "ОсновнаяСтатьяЗатрат");
	КонецЕсли;
	
	Возврат ОсновнаяСтатьяЗатрат;

КонецФункции

Процедура ЗаполнитьТабличнуюЧастьВознаграждение(мДокументы, НоменклатураВознаграждения, ПараметрыДоговора, ДанныеЗаполнения)
	
	ОсновнаяСтатьяЗатрат = ПолучитьОсновнуюСтатьюЗатрат(НоменклатураВознаграждения, ДанныеЗаполнения);

	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,
	               |	СУММА(CW_ДоходыПоГрузоперевозкеУслуги.Всего) КАК Всего,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов КАК ДокументРасходов
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка В(&мСсылки)
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов";
	
	Запрос.УстановитьПараметр("мСсылки", мДокументы);
	
	РезультатЗапроса = запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Нстр = Услуги.Добавить();
		
		Нстр.Грузоперевозка   = Выборка.Грузоперевозка;
		Нстр.Номенклатура     = НоменклатураВознаграждения;
		Нстр.Представление    = НоменклатураВознаграждения.НаименованиеПолное + " " + Выборка.Грузоперевозка.CW_Представление;
		Нстр.СтатьяЗатрат     = ОсновнаяСтатьяЗатрат;
		Нстр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
		Нстр.Количество       = 1;
		Нстр.СтавкаНДС        = ПараметрыДоговора.СтавкаНДС;
		Нстр.ДокументРасходов = Выборка.ДокументРасходов;
		
	
		Ставка				  = CW_Финансы.ПолучитьСтавкуНДС(Нстр.СтавкаНДС)/100;
		
		Если ПараметрыДоговора.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ПроцентОтСуммы Тогда 
			СуммаВознагражденияПоСтроке = Окр(Выборка.Всего*ПараметрыДоговора.РазмерАгентскогоВознаграждения/100, 2, 1);
			
			Нстр.Всего	= СуммаВознагражденияПоСтроке;
			Нстр.НДС	= Окр(Нстр.Всего * Ставка/(1+Ставка),2,1);
			Нстр.Сумма	= Нстр.Всего - Нстр.НДС;
			Нстр.Цена	= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
			Нстр.База 	= Выборка.Всего;
		
		ИначеЕсли ПараметрыДоговора.ВариантРасчетаВознаграждения = Перечисления.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ФиксированнаяСумма Тогда
			
			Нстр.Всего				= ПараметрыДоговора.РазмерАгентскогоВознаграждения ;
			Нстр.НДС				= окр(Нстр.Всего*Ставка/(1+Ставка),2,1);
			Нстр.Сумма            	= Нстр.Всего - Нстр.НДС;
			Нстр.Цена				= _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецЕсли