
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПолучитьНастройкуПользователя() Тогда
		
		Режим = РежимДиалогаВыбораФайла.Сохранение;
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
		Фильтр = НСтр("ru = 'Файл Excel 2007'; en = 'File Excel 2007'") + "(*.xlsx)|*.xlsx";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = "Сохраниение файла";
		ДиалогОткрытияФайла.ПолноеИмяФайла = ПараметрыВыполненияКоманды.Источник.Окно.Заголовок;
		
		Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораИменифайла",ЭтотОбъект, ПараметрыВыполненияКоманды.Источник.Результат); 
		ДиалогОткрытияФайла.Показать(Оповещение);
		
	Иначе
		
		#Если ВебКлиент Тогда
			мДанныеФормы = СтрРазделить(ПараметрыВыполненияКоманды.Источник.ИмяФормы,".");
			Если мДанныеФормы.Количество() > 2 Тогда
				ИмяФормы = мДанныеФормы[1];
				ИмяФормы = СтрЗаменить(ИмяФормы, "CW_","");
			Иначе
				ИмяФормы = "Отчет";
			КонецЕсли;
			ИмяФайла = ИмяФормы+".xlsx";
		#Иначе
			ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
		#КонецЕсли
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗаписиТабличногоДокумента",ЭтотОбъект, Новый Структура("ИмяФайла", ИмяФайла)); 
		ПараметрыВыполненияКоманды.Источник.Результат.НачатьЗапись(ОписаниеОповещения,ИмяФайла,ТипФайлаТабличногоДокумента.XLSX);
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьНастройкуПользователя()
	
	Возврат CW_Настройки.ПолучитьНастройкуПользователя(,"СохранятьФайлаНаДиск");
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораИменифайла(Результат, ТабличныйДокумент) Экспорт 
	
	Если Результат = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = Результат[0];
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗаписиТабличногоДокумента",ЭтотОбъект, Новый Структура("ИмяФайла",ИмяФайла)); 
	ТабличныйДокумент.НачатьЗапись(ОписаниеОповещения,ИмяФайла,ТипФайлаТабличногоДокумента.XLSX);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиТабличногоДокумента(Результат, ДополнительныеПараметры) Экспорт 
	
	#Если НЕ ВебКлиент Тогда
		Если Результат <> Неопределено Тогда
			Если Результат Тогда
				ЗапуститьПриложение(ДополнительныеПараметры.ИмяФайла,,Ложь);
			КонецЕсли; 
		КонецЕсли; 	
	#КонецЕсли
	
КонецПроцедуры