
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ПодключаемыйОбъект = Параметры.Объект;
	Если  ЗначениеЗаполнено(Объект.ПодключаемыйОбъект) Тогда	
		Настройки = _ПО.ПолучитьНастройкиОбработки(Объект.ПодключаемыйОбъект);
		
		Если Настройки <> Неопределено Тогда
			Если Настройки.Свойство("МножествоПараметров") Тогда
				ТаблицаПараметров.Загрузить(Настройки.МножествоПараметров);
			КонецЕсли;
			Если Настройки.Свойство("ФлагМножественногоВыбора") Тогда
				ФлагМножественногоВыбора = Настройки.ФлагМножественногоВыбора;
			КонецЕсли;
			Если Настройки.Свойство("ПараметрХранилищаДанных") Тогда
				ПараметрХранилищаДанных = Настройки.ПараметрХранилищаДанных;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Отказ = Ложь;
	ПроверитьДублированиеПараметров(Отказ);
	
	Если Отказ Тогда
		ВызватьИсключение "Не удалось записать настойку!"; 
	КонецЕсли;
	
	_СохранитьНастройки();
	Модифицированность = ложь;
	ЭтаФорма.Закрыть(); 
	
КонецПроцедуры   

&НаСервере
Процедура ПроверитьДублированиеПараметров(Отказ)
	
	ВремТаблица = ТаблицаПараметров.Выгрузить().Скопировать();   
	ВремТаблица.Свернуть("ПараметрМножественногоЗаполнения"); 
	
	Если ВремТаблица.Количество() <> ТаблицаПараметров.Количество() тогда
		Отказ = истина;
		
		Для Каждого СтрокаТаблицы из ВремТаблица Цикл
			
			Отбор = Новый Структура("ПараметрМножественногоЗаполнения", СтрокаТаблицы.ПараметрМножественногоЗаполнения);  
			
			мСтроки = ТаблицаПараметров.НайтиСтроки(Отбор);
			Если мСтроки.Количество() >1 Тогда
				ШаблонСообщения = "Дублирование параметра ""%1"" в строках";
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СокрЛП(СтрокаТаблицы.ПараметрМножественногоЗаполнения));   
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;    
			
		КонецЦикла;  
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьНастройки()
		
	СтруктураНастройки = Новый Структура;
	
	СтруктураНастройки.Вставить("МножествоПараметров"		, ДанныеФормыВЗначение(ТаблицаПараметров, тип("ТаблицаЗначений")));
	СтруктураНастройки.Вставить("ФлагМножественногоВыбора"	, ФлагМножественногоВыбора);
	СтруктураНастройки.Вставить("ПараметрХранилищаДанных"	, ПараметрХранилищаДанных);
	
	_ПО.ЗаписатьНастройкиОбработки(Объект.ПодключаемыйОбъект, СтруктураНастройки);
	
	ОбновитьСвойстваПараметровНаСервере();

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбработкуВРеквизитПараметра(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Для выбранных параметров будет установлена обработка начала редактирования и сброшен флаг (при его наличии) редактирования в режиме Excel" 
	+Символы.ПС+ "Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСвойстваПараметровНаСервере()
	
	Для Каждого ЭлементСписка из ТаблицаПараметров Цикл
		
		ОбъектТекущийПараметр = ЭлементСписка.ПараметрМножественногоЗаполнения.ПолучитьОбъект();
		ОбъектТекущийПараметр.ИспользуетсяОбработкаПередНачаломВыбора 	= Истина;
		ОбъектТекущийПараметр.ВнешняяОбработкаПередНачаломВыбора 		= Объект.ПодключаемыйОбъект;
		
		Попытка
			ОбъектТекущийПараметр.Записать();
		исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать параметр "+ ЭлементСписка.Представление;
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ОбновитьСвойстваПараметровНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗначениеЭлемента(Команда)
	
	ПоказатьЗначение(,Элементы.ТаблицаПараметров.ТекущиеДанные.ПараметрМножественногоЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = истина;
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗаписи", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение,"Данные формы были изменены. Записать изменения?", Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗаписи(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = ложь;
		ЭтаФорма.Закрыть();
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ПроверитьДублированиеПараметров(Отказ);
	Если Отказ Тогда
		ВызватьИсключение "Не удалось записать настойку!"; 
	КонецЕсли;  
	
	_СохранитьНастройки();
	Модифицированность = ложь;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры