
Процедура ЗаписатьНастройку(ПараметрыЗаписи, Настройка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);   
	
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПараметрыЗаписи.ТипОбъекта, Ложь);
	Если ИдентификаторОбъектаМетаданных = Null Тогда  
		ЗаписьЖурналаРегистрации("ЗаписьНастроек",
		,
		ПараметрыЗаписи.Метаданные,
		,
		"Настройка не сохранена! При причине: отсутствует элемент справочника ""Идентификаторы объектов метаданных"" для типа """+ПараметрыЗаписи.ТипОбъекта);
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.CW_НастройкиКолонокЖурналов.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторОбъектаМетаданных = ИдентификаторОбъектаМетаданных;
	Запись.ТипПеревозки = ПараметрыЗаписи.ТипПеревозки;
 	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;  
	Запись.Прочитать();    
	
	Запись.ИдентификаторОбъектаМетаданных = ИдентификаторОбъектаМетаданных;
	Запись.ТипПеревозки = ПараметрыЗаписи.ТипПеревозки;
 	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;  
	Запись.ХранилищеНастроек = Новый ХранилищеЗначения(Настройка);
	Запись.Записать(Истина);		

КонецПроцедуры
	
Функция ПолучитьНастройку(ПараметрыЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);   
	
	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПараметрыЗаписи.ТипОбъекта);
	Если ИдентификаторОбъектаМетаданных = Null Тогда  
		ЗаписьЖурналаРегистрации("ЗаписьНастроек",
		,
		ПараметрыЗаписи.Метаданные,
		,
		"Настройка не сохранена! При причине: отсутствует элемент справочника ""Идентификаторы объектов метаданных"" для типа """+ПараметрыЗаписи.ТипОбъекта);
		Возврат Неопределено;
	КонецЕсли;
	
	Запись = РегистрыСведений.CW_НастройкиКолонокЖурналов.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторОбъектаМетаданных = ИдентификаторОбъектаМетаданных;
	Запись.ТипПеревозки = ПараметрыЗаписи.ТипПеревозки;
 	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;  
	Запись.Прочитать();    
	
	Если Запись.Выбран() Тогда
		Возврат Запись.ХранилищеНастроек.Получить();	
	КонецЕсли;
	
КонецФункции