
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СписокРежимовВводаНаОсновании = ПолучитьМассивРежимовВводаНаОсновании(ПараметрКоманды);
	Если СписокРежимовВводаНаОсновании.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Режим ввода на основании не доступен для текущего документа!");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды", ПараметрКоманды);
	ДополнительныеПараметры.Вставить("Источник", 		ПараметрыВыполненияКоманды.Источник);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыбораРежимаВвода", ЭтотОбъект, ДополнительныеПараметры);
	
	ЭлементСписка = СписокРежимовВводаНаОсновании.Получить(0);
	
	Если СписокРежимовВводаНаОсновании.Количество() > 1 Тогда
		СписокРежимовВводаНаОсновании.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите режим ввода", ЭлементСписка);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, ЭлементСписка); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбораРежимаВвода(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДокументОснование", 	ДополнительныеПараметры.ПараметрКоманды);
	СтруктураПараметров.Вставить("ВводНаОсновании", 	Истина);
	СтруктураПараметров.Вставить("РежимВвода", 			РезультатВыбора.Значение);
	СтруктураПараметров.Вставить("ТипОснования", 		ТипЗнч(ДополнительныеПараметры.ПараметрКоманды));
	
	ДанныеДляЗаполнения = новый Структура;
	ДанныеДляЗаполнения.Вставить("ЗначенияЗаполнения",  СтруктураПараметров);
	
	ОткрытьФорму("Документ.CW_ДоходыПоГрузоперевозке.ФормаОбъекта",ДанныеДляЗаполнения,ДополнительныеПараметры.Источник); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивРежимовВводаНаОсновании(ПараметрКоманды)
	
	Результат = Новый СписокЗначений;
	
	Если ПараметрКоманды.ФормируетсяСчет И НЕ ПараметрКоманды.ФормируетсяАкт И Не ПараметрКоманды.ФормируетсяСчетФактура Тогда
		Результат.Добавить("СоздатьАкт", "Акт");
	КонецЕсли;
	
	ЕстьПеревыставления = ПолучитьНаличиеПеревыставленийпоДокументу(ПараметрКоманды);
	
	Если ЕстьПеревыставления Тогда
		
		СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметров.Дата 				= ПараметрКоманды.Дата;
		СтруктураПараметров.Договор 			= ПараметрКоманды.Договор;
		СтруктураПараметров.ПриложениеКДоговору = ПараметрКоманды.ПриложениеКДоговору;
		
		СтрокаПараметров  = "АвтоматическийРасчетВознаграждения;МоментАвтоматическогоВыставленияВознаграждения;ВариантРасчетаВознаграждения";
		ПараметрыДоговора = CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров,СтрокаПараметров);
		
		Если ПараметрыДоговора.АвтоматическийРасчетВознаграждения И
			ПараметрыДоговора.МоментАвтоматическогоВыставленияВознаграждения = ПредопределенноеЗначение("Перечисление.CW_МоментАвтоматическогоВыставленияВознаграждения.ОтдельнымДокументом") И
			ПараметрыДоговора.ВариантРасчетаВознаграждения = ПредопределенноеЗначение("Перечисление.CW_ВариантыАвтоматическогоРасчетаВознаграждения.ПроцентОтСуммы") Тогда
			
			Результат.Добавить("СоздатьВознагражение", "Вознаграждение (%)");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Функция ПолучитьНаличиеПеревыставленийпоДокументу(ПараметрКоманды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Номенклатура КАК Номенклатура,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ПорядокОтражения КАК ПорядокОтражения
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление)
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ПараметрКоманды";
	
	Запрос.УстановитьПараметр("ПараметрКоманды",ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции