#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.УстановкаЦенНоменклатуры.Видимость = ПравоДоступа("Просмотр",
		Метаданные.Документы.УстановкаЦенНоменклатуры);
	
	Элементы.НастройкаОбменаСМаркетплейсами.Видимость = ПравоДоступа("Изменение",
		Метаданные.РегистрыСведений.НастройкиАвтозагрузкиОтчетовМаркетплейсов)
		И (ПолучитьФункциональнуюОпцию("ИспользоватьПродажиЧерезМаркетплейс")
		Или ПолучитьФункциональнуюОпцию("ВедетсяОтгрузкаБезПереходаПраваСобственности"));
	
	Элементы.ПереоценкаТоваровВРознице.Видимость = ПравоДоступа("Просмотр",
		Метаданные.Документы.ПереоценкаТоваровВРознице);
	Элементы.СчетаУчетаНоменклатуры.Видимость = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СчетаУчетаНоменклатуры);
	Элементы.ШаблоныЦенниковИЭтикеток.Видимость = ПравоДоступа("Просмотр", Метаданные.Справочники.ХранилищеШаблонов);
	
	Элементы.ПодключенныеКассы.Видимость = ПравоДоступа("Использование", Метаданные.Обработки.ПодключенныеКассы);
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Склады(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.Склады.ФормаСписка", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыЦенНоменклатуры(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.ТипыЦенНоменклатуры.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаЦенНоменклатуры(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.УстановкаЦенНоменклатуры.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыНоменклатуры(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.ВидыНоменклатуры.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереоценкаТоваровВРознице(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПереоценкаТоваровВРознице.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбменСПодключаемымОборудованиемOffline(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ОбменСОфлайнОборудованием.Форма",
		ЭтотОбъект, , , ОткрытыеФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчетаНоменклатуры(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("РегистрСведений.СчетаУчетаНоменклатуры.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныЦенниковИЭтикеток(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Справочник.ХранилищеШаблонов.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура ПодключенныеКассы(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ПодключенныеКассы.Форма.ПодключенныеКассы",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"Склады,ВидыНоменклатуры,НастройкаЗаполненияЦен,ТипыЦенНоменклатуры,УстановкаЦенНоменклатуры");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЗаполненияЦен(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ПанельАдминистрированияБП.Форма.ФормаНастройкиЦеныПродажи",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОбменаСМаркетплейсами(Команда)
	
	ОбменСМаркетплейсКлиент.ОткрытьНастройкиАвтозагрузкиОтчетовМаркетплейсов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
