&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Параметры.Свойство("Наименование",Объект.Наименование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Обработка) Тогда
				
		ЗаполнитьСписокДоступныхОбъектов();
		ОбновитьСписокОбъектовОбработки();
		
	КонецЕсли;
	
	Элементы.МетаданноеПодписки.КнопкаСоздания = Ложь;
	Элементы.МетаданноеПодписки.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТипВнешнегоОбъекта", 	ПредопределенноеЗначение("Перечисление.CW_ТипыПодключаемыхОбъектов.ВнешняяОбработка"));
	СтруктураПараметров.Вставить("Вид",					"ВнешняяПодписка");
	
	ПараметрыФормы = Новый Структура("Отбор",СтруктураПараметров);
	ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.ФормаВыбора",ПараметрыФормы,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьДубли() Тогда
		ПоказатьПредупреждение(,"В списке источников подписки есть дублирующиеся данные!");
		Отказ = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьДубли()
	
	ВремТЗ = Объект.ИсточникиПодписки.Выгрузить();
	ВремТЗ.Свернуть("Метаданное","");
	
	Возврат ВремТЗ.Количество() <> Объект.ИсточникиПодписки.Количество();
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьСписокОбъектовОбработки();	
	
	//Необходимо обновить повторно используемые занчения.
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры


&наСервере
Процедура ЗаполнитьСписокДоступныхОбъектов(ЗаписатьВидСобытия = ложь)

	СтруктураДанныхПодписки = Справочники.CW_ВнешниеПодписки.ПолучитьДанныеВнешнейПдписки(Объект.Обработка);
	
	Если ТипЗнч(СтруктураДанныхПодписки.МетаданныеПодписки) = Тип("Массив") Тогда
		СписокДоступныхОбъектов.ЗагрузитьЗначения(СтруктураДанныхПодписки.МетаданныеПодписки);
	КонецЕсли;
	
	Если СтруктураДанныхПодписки.Версия = "1.0" Тогда
		//Поддержка версии 1.0 внешних подписок 
		Если ЗначениеЗаполнено(Объект.МетаданноеПодписки) Тогда
			ЗначениеСписка = СписокДоступныхОбъектов.НайтиПоЗначению(Объект.МетаданноеПодписки);
			Если ЗначениеСписка = Неопределено Тогда
				КартинкаМетаданного = БиблиотекаКартинок.ЗеленыйШарСЗамком;
				СписокДоступныхОбъектов.Добавить(Объект.МетаданноеПодписки, СокрЛП(Объект.МетаданноеПодписки), ,КартинкаМетаданного);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаписатьВидСобытия тогда
		Объект.ВидПодписки = СтруктураДанныхПодписки.ВидПодписки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокОбъектовОбработки()
	
	мМетаданныеПодписки = СписокДоступныхОбъектов.ВыгрузитьЗначения();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_МетаданныеКонфигурации.Ссылка КАК Метаданное
	               |ПОМЕСТИТЬ ВТ_ДоступныеОбъекты
	               |ИЗ
	               |	Справочник.CW_МетаданныеКонфигурации КАК CW_МетаданныеКонфигурации
	               |ГДЕ
	               |	CW_МетаданныеКонфигурации.Ссылка В(&мМетаданныеПодписки)";
	Запрос.УстановитьПараметр("мМетаданныеПодписки"			,мМетаданныеПодписки); 
	
	Запрос.Выполнить();
	
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	CW_ВнешниеПодписки.Ссылка КАК ВнешняяПодписка,
	               	|	CW_ВнешниеПодписки.МетаданноеПодписки КАК МетаданноеПодписки
	               	|ПОМЕСТИТЬ ВТ_ИспользованиеОбработки
	               	|ИЗ
	               	|	Справочник.CW_ВнешниеПодписки КАК CW_ВнешниеПодписки
	               	|ГДЕ
	               	|	CW_ВнешниеПодписки.Обработка = &ОбработкаВнешнейПодписки
	               	|	И НЕ CW_ВнешниеПодписки.ПометкаУдаления
	               	|	И НЕ CW_ВнешниеПодписки.НеИспользуется
	               	|
	               	|ИНДЕКСИРОВАТЬ ПО
	               	|	МетаданноеПодписки";
	
	Запрос.УстановитьПараметр("ОбработкаВнешнейПодписки"	, Объект.Обработка);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ДоступныеОбъекты.Метаданное КАК Метаданное,
	               |	ВЫБОР
	               |		КОГДА ВТ_ИспользованиеОбработки.ВнешняяПодписка ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Используется
	               |ИЗ
	               |	ВТ_ДоступныеОбъекты КАК ВТ_ДоступныеОбъекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИспользованиеОбработки КАК ВТ_ИспользованиеОбработки
	               |		ПО ВТ_ДоступныеОбъекты.Метаданное = ВТ_ИспользованиеОбработки.МетаданноеПодписки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДоступныеОбъекты.Метаданное,
	               |	ВЫБОР
	               |		КОГДА ВТ_ИспользованиеОбработки.ВнешняяПодписка ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Используется УБЫВ";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Элементы.МетаданноеПодписки.СписокВыбора.Очистить();	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Используется Тогда
			ПредставлениеМетаданного = СокрЛП(Выборка.Метаданное);
			КартинкаМетаданного = БиблиотекаКартинок.CW_Папка;
		Иначе
			ПредставлениеМетаданного = "<"+СокрЛП(Выборка.Метаданное)+">";
			КартинкаМетаданного = БиблиотекаКартинок.Пустая;
		КонецЕсли;
		
		Элементы.МетаданноеПодписки.СписокВыбора.Добавить(Выборка.Метаданное, ПредставлениеМетаданного,,КартинкаМетаданного);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПриИзменении(Элемент)
	
	ЗаполнитьСписокДоступныхОбъектов(истина);
	ОбновитьСписокОбъектовОбработки();
	
КонецПроцедуры

&НаКлиенте
Процедура МетаданноеПодпискиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если ПроверитьИспользованиеВыбранногоЗначения(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(,"Выбранный объект метаданных уже используется в другой аналогичной внешней подписке");
	КонецЕсли;
	
КонецПроцедуры

&наСервере
Функция ПроверитьИспользованиеВыбранногоЗначения(ВыбранноеЗначение)
	
	Возврат Ложь;
	
	Запрос = новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	CW_ВнешниеПодписки.Ссылка КАК ВнешняяПодписка,
	               	|	CW_ВнешниеПодписки.МетаданноеПодписки КАК МетаданноеПодписки
	               	|ИЗ
	               	|	Справочник.CW_ВнешниеПодписки КАК CW_ВнешниеПодписки
	               	|ГДЕ
	               	|	CW_ВнешниеПодписки.Ссылка <> &ТекущаяСсыкла
	               	|	И CW_ВнешниеПодписки.МетаданноеПодписки = &МетаданноеПодписки
	               	|	И CW_ВнешниеПодписки.ВидПодписки = &ВидПодписки
	               	|	И CW_ВнешниеПодписки.НеИспользуется = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ТекущаяСсыкла"		, Объект.Ссылка);
	Запрос.УстановитьПараметр("МетаданноеПодписки"	, ВыбранноеЗначение);
	Запрос.УстановитьПараметр("ВидПодписки"			, Объект.ВидПодписки);
	
	РезультатЗапроса = Запрос.Выполнить();
	

	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Процедура НеИспользуетсяПриИзменении(Элемент)
	
	Если  Не Объект.НеИспользуется тогда
		//Сняли флаг
		Если ПроверитьИспользованиеВыбранногоЗначения(Объект.МетаданноеПодписки) Тогда
			Объект.НеИспользуется = истина;
			ПоказатьПредупреждение(,"Для указаного объекта метаданных уже существует аналогичная действующая внешняя подписка");
		КонецЕсли;
		
	КонецЕсли
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры


#КонецОбласти

