
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СброситьРазмерыИПоложениеОкна();
	
	ПлатежныйДокумент = Параметры.ПлатежныйДокумент;
	ЗаполнитьИнформациюОРасчете();
	
	Элементы.ПлатежныйДокумент.Видимость = Не Параметры.ОткрываетсяИзДокумента;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеВыписки"
		Или ИмяСобытия = ИнтеграцияАУСНКлиент.ИмяСобытияИзмененоСостояние() Тогда
		ЗаполнитьИнформациюОРасчете();
	ИначеЕсли ИмяСобытия = ИнтеграцияАУСНКлиент.ИмяСобытияОбменССервисом() Тогда
		ЗаполнитьСтатус();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьПодключениеАУСН" Тогда
		СтандартнаяОбработка = Ложь;
		ИнтеграцияАУСНКлиент.ОткрытьПомощникПодключенияСервиса();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЛКАУСН" Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиПоНавигационнойСсылке(СсылкаНаРасчетНДФЛВЛичномКабинете());
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки =
		РаботаСОповещениямиОСостоянииОбменаССервисамиКлиентСервер.ИмяДействияИсправитьОшибкиОтправкиАУСН() Тогда
		СтандартнаяОбработка = Ложь;
		АдресДанныхОшибкиОтправки = ПоместитьОшибкиОтправкиВХранилище(Организация, ПлатежныйДокумент, УникальныйИдентификатор);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОшибкиОтправкиАУСН", АдресДанныхОшибкиОтправки);
		ОткрытьФорму("ОбщаяФорма.ОшибкиОтправкиАУСН", ПараметрыФормы, , УникальныйИдентификатор);
	Иначе
		ИнтеграцияАУСНКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьИнформациюОРасчете()
	
	ЗаполнитьРеквизитыПоПлатежномуДокументу();
	ПрочитатьРасчетыНДФЛАУСН();
	ЗаполнитьСтатус();
	ЗаполнитьПодсказку();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоПлатежномуДокументу()
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПлатежныйДокумент,
		"Проведен, Организация");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыДокумента);
	
	Заголовок = СтрШаблон(НСтр("ru = 'Расчет НДФЛ АУСН по документу %1'"), Строка(ПлатежныйДокумент));
	
	БанкПередачиНДФЛИзПрограммы = РегистрыСведений.СостоянияИнтеграцииАУСН.БанкПередачиНДФЛИзПрограммы(Организация);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРасчетыНДФЛАУСН()
	
	РасчетыНДФЛАУСН.Очистить();
	
	Если Проведен Тогда
		НаборЗаписей = РеквизитФормыВЗначение("РасчетыНДФЛАУСН");
		НаборЗаписей.Отбор.Регистратор.Установить(ПлатежныйДокумент);
		НаборЗаписей.Прочитать();
		ЗначениеВРеквизитФормы(НаборЗаписей, "РасчетыНДФЛАУСН");
	КонецЕсли;
	
	ЗаполнитьЗаголовкиСтрок();
	
	Элементы.РасчетыНДФЛАУСН.Видимость = РасчетыНДФЛАУСН.Количество() > 0;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатус()
	
	ДанныеОбменаАУСН = РегистрыСведений.ДокументыНДФЛАУСН.ДанныеДокумента(ПлатежныйДокумент);
	СтатусыРасчетовНДФЛ = Перечисления.СтатусыРасчетовНДФЛАУСН;
	СтатусОбменаАУСН = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДанныеОбменаАУСН, "Статус", СтатусыРасчетовНДФЛ.ПустаяСсылка());
	ПредставлениеСтатуса = СтатусыРасчетовНДФЛ.ПредставлениеСтатуса(СтатусОбменаАУСН, Проведен, Истина);
	ЦветФонаСтатуса = ЦветаСтиля.БыстрыеОтборыФонГруппы;
	
	Если Не Проведен Тогда
		СтатусСтрокой = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = '<b>%1</b> - проведите документ, чтобы сформировать расчет, или пометьте на удаление, чтобы скрыть расчет в списке'"),
			ПредставлениеСтатуса);
	ИначеЕсли Не ЗначениеЗаполнено(СтатусОбменаАУСН) Тогда
		ОкончаниеСтатуса = ?(ЗначениеЗаполнено(БанкПередачиНДФЛИзПрограммы), НСтр("ru = 'банка'"), НСтр("ru = 'АУСН'"));
		Если НастроенаПередачаНДФЛАУСН() Тогда
			ТекстСообщения = НСтр("ru = '<b>%1</b> - сформирован до подключения к сервису АУСН. Перенесите расчет вручную в <a href = ""ЛКАУСН"">Личный кабинет %2</a>'");
		Иначе
			ТекстСообщения = НСтр("ru = '<b>%1</b> - Перенесите расчет вручную в <a href = ""ЛКАУСН"">Личный кабинет %2</a>'");
		КонецЕсли;
		СтатусСтрокой = СтроковыеФункции.ФорматированнаяСтрока(ТекстСообщения, ПредставлениеСтатуса, ОкончаниеСтатуса);
	ИначеЕсли СтатусОбменаАУСН = СтатусыРасчетовНДФЛ.ОжидаетОтправки Тогда
		СтатусСтрокой = СтроковыеФункции.ФорматированнаяСтрока(НСтр("ru = '<b>%1</b>'"), ПредставлениеСтатуса);
	ИначеЕсли СтатусОбменаАУСН = СтатусыРасчетовНДФЛ.ОшибкаПриОтправке Тогда
		СтатусСтрокой = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = '<b>%1</b> - исправьте <a href = ""%2"">Ошибки заполнения реквизитов</a>'"),
			ПредставлениеСтатуса,
			РаботаСОповещениямиОСостоянииОбменаССервисамиКлиентСервер.ИмяДействияИсправитьОшибкиОтправкиАУСН());
		ЦветФонаСтатуса = ЦветаСтиля.ЦветФонаНекорректногоЗначенияБИП;
	ИначеЕсли СтатусОбменаАУСН = СтатусыРасчетовНДФЛ.Отклонен Тогда
		СтатусСтрокой = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = '<b>%1</b> по причине: %2. Написать <a href = ""%3"">Сообщение в техническую поддержку 1С</a>'"),
			ПредставлениеСтатуса,
			ДанныеОбменаАУСН.ТекстОшибки,
			РаботаСОповещениямиОСостоянииОбменаССервисамиКлиентСервер.ИмяДействияОбращениеВТехподдержку1С());
		ЦветФонаСтатуса = ЦветаСтиля.ЦветФонаНекорректногоЗначенияБИП;
	Иначе
		СтатусСтрокой = СтроковыеФункции.ФорматированнаяСтрока(НСтр("ru = '<b>%1</b>'"), ПредставлениеСтатуса);
		ЦветФонаСтатуса = ЦветаСтиля.ЦветФонаПоложительногоЗначения;
	КонецЕсли;
	
	Элементы.ГруппаСтатус.ЦветФона = ЦветФонаСтатуса;
	Элементы.ДекорацияСтатус.Заголовок = СтатусСтрокой;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Доход
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСНДоходЗаголовок");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСНКодДохода");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСНСуммаДохода");
	ГруппаОтбораИ = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
		ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"РасчетыНДФЛАУСН.КодДохода", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"РасчетыНДФЛАУСН.СуммаДохода", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Вычет
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСНВычетЗаголовок");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСНКодВычета");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСНСуммаВычета");
	ГруппаОтбораИ = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
		ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"РасчетыНДФЛАУСН.КодВычета", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"РасчетыНДФЛАУСН.СуммаВычета", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Необлагаемый доход
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСННеоблагаемыйДоходЗаголовок");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСНКодНеоблагаемогоВзносамиДохода");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСНСуммаНеоблагаемаяВзносами");
	ГруппаОтбораИ = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
		ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"РасчетыНДФЛАУСН.КодНеоблагаемогоВзносамиДохода", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"РасчетыНДФЛАУСН.СуммаНеоблагаемаяВзносами", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Нерезидент
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСННомерУведомленияНерезидента");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСНДатаУведомленияНерезидента");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСНКодНалоговогоОрганаНерезидента");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыНДФЛАУСННДФЛНерезидента");
	ГруппаОтбораИ = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
		ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"РасчетыНДФЛАУСН.НомерУведомленияНерезидента", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"РасчетыНДФЛАУСН.ДатаУведомленияНерезидента", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"РасчетыНДФЛАУСН.КодНалоговогоОрганаНерезидента", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИ,
		"РасчетыНДФЛАУСН.НДФЛНерезидента", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовкиСтрок()

	Для Каждого СтрокаТаблицы Из РасчетыНДФЛАУСН Цикл
		СтрокаТаблицы.ДоходЗаголовок = НСтр("ru = 'Доход:'");
		СтрокаТаблицы.ВычетЗаголовок =  НСтр("ru = 'Вычет:'");
		СтрокаТаблицы.НеоблагаемыйДоходЗаголовок =  НСтр("ru = 'Необлагаемый доход:'");
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодсказку()
	
	Если Не НастроенаПередачаНДФЛАУСН() Тогда
		ПредставлениеНастройки = НСтр("ru = 'Не передается'");
		ТекстПодсказки = НСтр("ru = 'Расчет НДФЛ формируется при проведении документа с заполненной ведомостью. Расчет автоматически <a href = ""ОткрытьПодключениеАУСН"">%1</a>'");
	Иначе
		ПредставлениеНастройки = ?(ЗначениеЗаполнено(БанкПередачиНДФЛИзПрограммы),
			СтрШаблон(НСтр("ru = 'через %1'"), Строка(БанкПередачиНДФЛИзПрограммы)),
			НСтр("ru = 'напрямую в ФНС'"));
		ТекстПодсказки = НСтр("ru = 'Расчет НДФЛ формируется при проведении документа с заполненной ведомостью. Настроено автоматически передавать расчет <a href = ""ОткрытьПодключениеАУСН"">%1</a>'")
	КонецЕсли;
	
	Элементы.ДекорацияПодсказка.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(ТекстПодсказки, ПредставлениеНастройки);
	Элементы.ДекорацияПодсказка.Видимость = Проведен;
	
КонецПроцедуры

&НаСервере
Процедура СброситьРазмерыИПоложениеОкна()
	
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		Выборка = ХранилищеСистемныхНастроек.Выбрать(Новый Структура("Пользователь", ИмяПользователя));
		Пока Выборка.Следующий() Цикл
			Если СтрНайти(Выборка.КлючОбъекта, "Документ.СписаниеСРасчетногоСчета.Форма.ФормаРасчетНДФЛАУСНПоДокументу") = 0 Тогда
				Продолжить;
			КонецЕсли;
			ХранилищеСистемныхНастроек.Удалить(
				Выборка.КлючОбъекта, Строка(Выборка.Настройки), ИмяПользователя);
		КонецЦикла;
	КонецЕсли;
	
	КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоместитьОшибкиОтправкиВХранилище(Организация, ПлатежныйДокумент, ИдентификаторФормы)
	
	ОшибкиОтправки = РегистрыСведений.СостоянияИнтеграцииАУСН.ОшибкиОтправкиПоДокументуНДФЛ(Организация, ПлатежныйДокумент);
	Возврат ПоместитьВоВременноеХранилище(ОшибкиОтправки, ИдентификаторФормы);

КонецФункции

&НаСервере
Функция НастроенаПередачаНДФЛАУСН()
	
	Возврат БанкПередачиНДФЛИзПрограммы <> Неопределено;
	
КонецФункции

&НаКлиенте
Функция СсылкаНаРасчетНДФЛВЛичномКабинете()
	
	Если ЗначениеЗаполнено(БанкПередачиНДФЛИзПрограммы) Тогда
		Возврат СсылкаЛичныйКабинетБанка(БанкПередачиНДФЛИзПрограммы);
	Иначе
		Возврат СтрШаблон("%1%2",
			ИнтеграцияАУСНКлиентСервер.СсылкаНаЛичныйКабинетАУСН(),
			"employees/ndfl");
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылкаЛичныйКабинетБанка(Банк)
	
	Возврат ИнтеграцияАУСНПовтИсп.СсылкаЛичныйКабинетБанка(Банк);
	
КонецФункции

#КонецОбласти
