
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбъектУчета = ПолучитьОбъектУчетаЭДО(ПараметрКоманды);
	Если Не ЗначениеЗаполнено(ОбъектУчета) Тогда
		Возврат;
	КонецЕсли;   

	CW_ЭДОКлиент.ДобавитьФайлВПакетЭлектронногоДокумента(ПараметрКоманды, ОбъектУчета);

КонецПроцедуры      

&НаСервере
Функция ПолучитьОбъектУчетаЭДО(ПараметрКоманды)
	
	Если ПараметрКоманды.Корректировка Тогда
		Возврат ПараметрКоманды.ВедомыйДокументКорректировки;
	Иначе
		Возврат ПараметрКоманды.ВедомыйДокумент;
	КонецЕсли;
	
КонецФункции 	 
