#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешняяКоманда();
	
	СтруктураОписания.Наименование 				= "Восстановить стандартную иерархию параметров";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания,	"Регистрация");

	Возврат СтруктураОписания;
	
КонецФункции

Функция Регистрация(Ссылка) Экспорт 
	
	Попытка
		
		Набор = РегистрыСведений.CW_ВнешниеКоманды.СоздатьНаборЗаписей();
		_сф.УстановитьОтбор(Набор.Отбор, "Обработка", Ссылка);
		Набор.Записать(Истина);
		Если (Ссылка.ПометкаУдаления) Тогда
			Возврат(_УФКС.Ответ());
		КонецЕсли; 
		
 		Запись = Набор.Добавить();
 		Запись.Обработка = Ссылка;
		Запись.Метаданное = CW_Обмены_ПИ.МетаданноеКонфигурации("Справочник.CW_Грузоперевозки");
		//Запись.ВидФормы = Перечисления.CW_ВидыФорм.ФормаСписка;
		Запись.ИмяФормыОбъкта = "ФормаСписка";
		Запись.Наименование = "Восстановить стандартную иерархию параметров";
 		Набор.Записать(Истина);
		
		Возврат(_УФКС.Ответ());
		
	Исключение
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
	КонецПопытки; 
	
КонецФункции

Функция ВыполнитьКоманду(Обработка, ПараметрыОбработки=Неопределено) Экспорт 
	
	МассивГП = Неопределено;
	ПараметрыОбработки.Свойство("Грузоперевозки",МассивГП);
	
	Для каждого ГП Из МассивГП Цикл
		
		ГПО = ГП.ПолучитьОбъект();
		ГПО.ГруппыПараметровГрузоперевозки.Очистить();
		ГПО.Записать();
		
	КонецЦикла; 
	
	Ответ = _УФКС.Ответ();
	Ответ.Вставить("Действие","");
	Возврат(Ответ);
	
КонецФункции
#КонецЕсли