
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Прочтано 	= РегистрыСведений.CW_ПрочитанныеУведомления.УведомлениеПрочитано(Объект.Ссылка); 
	ТОбъект 	= РеквизитФормыВЗначение("Объект");
	
	Элементы.КартинкаПрочитано.Картинка = ?(Прочтано, БиблиотекаКартинок.CW_СераяТочка, БиблиотекаКартинок.CW_ЗеленаяТочка);
	
	СтрукутраHTML = ТОбъект.ХранилищеHTML.Получить();  
	Если СтрукутраHTML <> Неопределено Тогда
		Содержание.УстановитьHTML(СтрукутраHTML.ТекстHTML, СтрукутраHTML.Вложения);
	КонецЕсли; 
	
	ЭтаФорма.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Через 3 секунды считаем, что новость прочитана
	ПодключитьОбработчикОжидания("ПрочитатьНовость",5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНовость() 
	
	ПрочитатьНовостьНаСервере();

	Прочтано = истина; 
	Элементы.КартинкаПрочитано.Картинка = ?(Прочтано, БиблиотекаКартинок.CW_СераяТочка, БиблиотекаКартинок.CW_ЗеленаяТочка);  
	Оповестить("Уведомления_Прочитано");
	
КонецПроцедуры  

&НаСервере
Процедура ПрочитатьНовостьНаСервере() 
	
	РегистрыСведений.CW_ПрочитанныеУведомления.ПрочитатьУведомление(Объект.Ссылка);
	
КонецПроцедуры   