&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня);
	
	Если Не ЗначениеЗаполнено(Детализация) Тогда
		Детализация = "День";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Язык) Тогда
		Язык = Справочники.CW_Языки.ru;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Сценарий) Тогда
		Сценарий = Справочники.CW_СценарииПланированияДДС.Недельный;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВалютаОтчета) Тогда
		ВалютаОтчета = ВалютаРегламентированногоУчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОтчетаПриИзменении(Элемент)
	ВалютаОтчетаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаОтчетаПриИзмененииНаСервере()
	Элементы.ПересчитыватьПоКурсу.Видимость = ВалютаОтчета <> ВалютаРегламентированногоУчета;
КонецПроцедуры

&наСервере
Процедура ЗаполнитьПоляГруппировки()
	
	СписокЗначенийГруппировок = Новый СписокЗначений;
	СписокЗначенийГруппировок.Добавить("Организация", 	"Организация");
	СписокЗначенийГруппировок.Добавить("Офис", 			"Офис");
	СписокЗначенийГруппировок.Добавить("Инициатор", 	"Инициатор");
	СписокЗначенийГруппировок.Добавить("Валюта", 		"Валюта");
	СписокЗначенийГруппировок.Добавить("Контрагент", 	"Контрагент");
	СписокЗначенийГруппировок.Добавить("Договор", 		"Договор");
	
	Если ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам") Тогда
		СписокЗначенийГруппировок.Добавить("ПриложениеКДоговору", "Приложение к договору");
	КонецЕсли;
	
	СписокЗначенийГруппировок.Добавить("ЗаявкаНаРасход", 	"Заявка на расход");
	СписокЗначенийГруппировок.Добавить("СтатьяДДС", 		"Статья ДДС");
	
	Для Каждого ЭлементСписка из СписокЗначенийГруппировок Цикл
		мСтроки = ГруппировкиОтчета.НайтиСтроки(Новый Структура("ИмяПоля", ЭлементСписка.Значение));
		Если мСтроки.Количество() = 0 Тогда
			НоваяСтрока = ГруппировкиОтчета.Добавить();
			НоваяСтрока.ИмяПоля = ЭлементСписка.Значение;
		Иначе
			НоваяСтрока = мСтроки[0];
		КонецЕсли;
		НоваяСтрока.Поле = ЭлементСписка.Представление;
	КонецЦикла;
	
	Если НЕ ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам") Тогда
		мСтроки = ГруппировкиОтчета.НайтиСтроки(Новый Структура("ИмяПоля", "ПриложениеКДоговору"));
		Если мСтроки.Количество() > 0 Тогда
			ИндексСтроки = ГруппировкиОтчета.Индекс(мСтроки[0]);
			ГруппировкиОтчета.Удалить(ИндексСтроки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	_ВосстановитьСеансовуюНастройку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ЗавершениеРаботы Тогда
		_СохранитьСеансовуюНастройку();
		ВариантМодифицирован = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СтруктураНастройки = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СтруктураНастройки <> Неопределено Тогда
		Попытка
			Если СтруктураНастройки.Свойство("Период") Тогда
				Если ЗначениеЗаполнено(СтруктураНастройки.Период) Тогда
					Период = СтруктураНастройки.Период;
				КонецЕсли;
			КонецЕсли;
			Если СтруктураНастройки.Свойство("ВалютаОтчета") Тогда
				Если ЗначениеЗаполнено(СтруктураНастройки.ВалютаОтчета) Тогда
					ВалютаОтчета = СтруктураНастройки.ВалютаОтчета;
				КонецЕсли;
			КонецЕсли;			
			Если СтруктураНастройки.Свойство("Сценарий") Тогда
				Если ЗначениеЗаполнено(СтруктураНастройки.Сценарий) Тогда
					Сценарий = СтруктураНастройки.Сценарий;
				КонецЕсли;
			КонецЕсли;			
			Если СтруктураНастройки.Свойство("Детализация") Тогда
				Если ЗначениеЗаполнено(СтруктураНастройки.Детализация) Тогда
					Детализация = СтруктураНастройки.Детализация;
				КонецЕсли;
			КонецЕсли;				
			Если СтруктураНастройки.Свойство("Язык") Тогда
				Если ЗначениеЗаполнено(СтруктураНастройки.Язык) Тогда
					Язык = СтруктураНастройки.Язык;
				КонецЕсли;
			КонецЕсли;
			
			СтруктураНастройки.Свойство("ПересчитыватьПоКурсу",	ПересчитыватьПоКурсу);
			СтруктураНастройки.Свойство("ВходящийОстатокРежим",	ВходящийОстатокРежим);
			СтруктураНастройки.Свойство("ВходящийОстатокСумма",	ВходящийОстатокСумма);
			
			НастройкиКД = "";
			СтруктураНастройки.Свойство("Отбор", НастройкиКД);
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			Для Каждого СтрОтбор из НастройкиКД.Отбор.Элементы Цикл
				ЗаполнитьЗначенияСвойств(Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")),СтрОтбор);
			КонецЦикла;	
			
			Если СтруктураНастройки.Свойство("ГруппировкиОтчета") Тогда
				ГруппировкиОтчета.Загрузить(СтруктураНастройки.ГруппировкиОтчета);
			КонецЕсли;
			
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;			
	КонецЕсли; 
	
	ЗаполнитьПоляГруппировки();
	
	ВходящийОстатокРежимПриИзмененииНаСервере();
	ВалютаОтчетаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	ХранилищеСистемныхНастроек.Сохранить(РеквизитФормыВЗначение("Отчет").Метаданные().Имя, "Сеансовая", ПолучитьСтруктуруНасторйкиОтчета());
КонецПроцедуры



&НаКлиенте
Процедура Сформировать(Команда)
	Если ПроверитьЗаполнение() Тогда
		_Настройка(Истина);
		СформироватьОтчет();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	
	Группировки = Новый Массив;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Пометка", Истина);
	мСтроки = ГруппировкиОтчета.НайтиСтроки(Отбор);
	
	Для каждого СтрокаТаблицы из мСтроки Цикл
		Группировки.Добавить(Новый ПолеКомпоновкиДанных(СтрокаТаблицы.ИмяПоля));
	КонецЦикла;
	
	Настройки = Новый Структура();
	Настройки.Вставить("Период",				Период);
	Настройки.Вставить("ВалютаОтчета",			ВалютаОтчета);
	Настройки.Вставить("ДатаКурса",				?(ПересчитыватьПоКурсу = 0,Период.ДатаНачала,ТекущаяДата()));
	Настройки.Вставить("Сценарий",				Сценарий);
	Настройки.Вставить("ВходящийОстатокРежим",	ВходящийОстатокРежим);
	Настройки.Вставить("ВходящийОстатокСумма",	ВходящийОстатокСумма);
	Настройки.Вставить("Детализация",			Детализация);
	Настройки.Вставить("Язык",					Язык);    
	Настройки.Вставить("Статус",				Статус);    
	Настройки.Вставить("Группировки",			Группировки);
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор));
	
КонецФункции


&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаКлиенте
Процедура _Настройка(Скрыть = Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка    = Ложь;
	Иначе
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка    = Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка    = Истина;
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкиСнятьВсе(Команда)
	
	УстановитьСнятьПометки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкиУстановитьВсе(Команда)
	
	УстановитьСнятьПометки(Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьПометки(Пометка)
	
	Для Каждого СтрокаГруппировки из ГруппировкиОтчета Цикл
		СтрокаГруппировки.Пометка = Пометка;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ВходящийОстатокРежимПриИзменении(Элемент)
	ВходящийОстатокРежимПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВходящийОстатокРежимПриИзмененииНаСервере()
	
	Если ВходящийОстатокРежим <> 2 Тогда
		ВходящийОстатокСумма = 0;
	КонецЕсли;
	
	Элементы.ВходящийОстатокСумма.Видимость = ВходящийОстатокРежим = 2; 
	
КонецПроцедуры

#Область СохранениеПользовательскихНастроекОтчета

&НаСервере
//Функция ПолучитьСтруктуруНасторйкиОтчета()
//
// Функция возвращает структуру настроек, 
//	которые будут записаны в справочник "CW_НастройкиПользователей";
//
// ВНИМАНИЕ! Для каждого отчета стуктура индивидуальна!
//
Функция ПолучитьСтруктуруНасторйкиОтчета()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Период",				Период);
	СтруктураНастройки.Вставить("ВалютаОтчета",			ВалютаОтчета);
	СтруктураНастройки.Вставить("ПересчитыватьПоКурсу",	ПересчитыватьПоКурсу);
	СтруктураНастройки.Вставить("Сценарий",				Сценарий);
	СтруктураНастройки.Вставить("ВходящийОстатокРежим",	ВходящийОстатокРежим);
	СтруктураНастройки.Вставить("ВходящийОстатокСумма",	ВходящийОстатокСумма);
	СтруктураНастройки.Вставить("Детализация",			Детализация);
	СтруктураНастройки.Вставить("Язык",					Язык);
	СтруктураНастройки.Вставить("Статус",				Статус);
	СтруктураНастройки.Вставить("Отбор", 				Отчет.КомпоновщикНастроек.ПолучитьНастройки()); 
	СтруктураНастройки.Вставить("ГруппировкиОтчета",  	ГруппировкиОтчета.Выгрузить());
	
	Возврат СтруктураНастройки;
	
КонецФункции

#Конецобласти



//Процедура  ЗагрузитьНастройкиОтчетаНаСервере(НастройкаСсылка)
//
//	Параметры функции 
//		НастрйокаСсылка - ссылка на элемент справочника "CW_НастройкиПользователей", из которго
//						  будет загружена настройка;
//
// ВНИМАНИЕ! Для каждого отчета процедура индивидуальна!
//
&НаСервере
Процедура ЗагрузитьНастройкиОтчетаНаСервере(НастройкаСсылка)
	
	СтруктураНастройки = Справочники.CW_НастройкиПользователей.ЗагрузитьНастройку(НастройкаСсылка);
	
	СтруктураНастройки.Свойство("Период",				Период);
	СтруктураНастройки.Свойство("ВалютаОтчета",			ВалютаОтчета);
	СтруктураНастройки.Свойство("ПересчитыватьПоКурсу",	ПересчитыватьПоКурсу);
	СтруктураНастройки.Свойство("Сценарий",				Сценарий);
	СтруктураНастройки.Свойство("ВходящийОстатокРежим",	ВходящийОстатокРежим);
	СтруктураНастройки.Свойство("ВходящийОстатокСумма",	ВходящийОстатокСумма);
	СтруктураНастройки.Свойство("Детализация",			Детализация);
	СтруктураНастройки.Свойство("Язык",					Язык);   
	СтруктураНастройки.Свойство("Статус",				Статус);   
	
	Если СтруктураНастройки.Свойство("Отбор") Тогда
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураНастройки.Отбор);
	КонецЕсли;
	
	Если СтруктураНастройки.Свойство("ГруппировкиОтчета") Тогда
		ГруппировкиОтчета.Загрузить(СтруктураНастройки.ГруппировкиОтчета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//Процедура ЗаписатьНастройкуОтчета(Ответ, ДополнительныеПараметры) Экспорт
//	Параметры процедуры:
//  - СтруктураОтвета -  Структура со полями: НастройкаСсылка и НеВосстанавливатьОтбор;
//		 *НастройкаСсылка 			- ссылка на элемент справочника "CW_НастройкиПользователей",
//								   		из которого будет восстановлена текущая отчета; 
//		 *НеВосстанавливатьОтбор  	- в текущем контексте не используется, значение всегда "ложь";	
//
//	- ДополнительныеПараметры 	-  Дополнительные параметры, с которыми была открыта 
//								   форма управления настройками 
//							       (см. модуль общей команды "CW_СохранитьНастройку")
//                                            
Процедура ОткрытьНастройкуОтчета(СтруктураОтвета, ДополнительныеПараметры) Экспорт
	
	Если СтруктураОтвета <> Неопределено Тогда
		ЗагрузитьнастройкиОтчетаНаСервере(СтруктураОтвета.НастройкаСсылка);
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
//Процедура ЗаписатьНастройкуОтчета(Ответ, ДополнительныеПараметры) Экспорт
//	Параметры процедуры:
//  - ЭлементНастройки 			-  ссылка на элемент справочника "CW_НастройкиПользователей",
//								   в который будет записана текущая настройка отчета;
//	- ДополнительныеПараметры 	-  Дополнительные параметры, с которыми была открыта 
//								   форма управления настройками 
//							       (см. модуль общей команды "CW_СохранитьНастройку")
//
Процедура ЗаписатьНастройкуОтчета(ЭлементНастройки, ДополнительныеПараметры) Экспорт
	
	Если ЭлементНастройки <> Неопределено Тогда
		ЗаписатьНастройкиНаСервере(ЭлементНастройки);
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере(ЭлементНастройки)
	
	СтруктураНастроекОтчета = ПолучитьСтруктуруНасторйкиОтчета();
	Справочники.CW_НастройкиПользователей.СохранитьНастройку(ЭлементНастройки, СтруктураНастроекОтчета); 

КонецПроцедуры

