
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// читаем из временного хранилища структуру настроек журнала
	АдресСхемыКомпоновки = Параметры.СхемаКомпоновки;
	ИмяФормыИсточника = Параметры.ИмяФормыИсточника;
	// --- 
	Адрес = Параметры.АдресСНЖ;
	ДанныеХранилища = ПолучитьИзВременногоХранилища(Адрес);
	СтруктураНастроек.Очистить();
	СтруктураНастроек.Добавить(ДанныеХранилища.СтруктураНастроек);
	СН = СтруктураНастроек[0].Значение;
	
	ПодготовитьСписокТиповПеревозок();
	
	// --- 
	
	ТаблицаОписанияКолонок = ЗначениеИзСтрокиВнутр(СН["ОсновнаяНастройка"]);
	
	Попытка
		
		ОписаниеКолонок.Загрузить(ТаблицаОписанияКолонок);
		
	Исключение
		
		Отказ = Истина;
		Сообщить("Неизвестный тип таблицы колонок журнала");
		Сообщить(Строка(ТипЗнч(ТаблицаОписанияКолонок)));
		Возврат;
		
	КонецПопытки; 
	
	// проверка фиксации и сортировки
	Для каждого Колонка Из ОписаниеКолонок Цикл
		
		Если Колонка.Фиксация.Пустая() Тогда
			Колонка.Фиксация = Перечисления.CW_ВариантыФиксацииКолонок.Нет;
		КонецЕсли; 
		
		Если Колонка.Сортировка.Пустая() Тогда
			Колонка.Сортировка = Перечисления.CW_ПорядокСортировки.Нет;
		КонецЕсли; 
		
	КонецЦикла; 
	
	// формируем таблицу сортировки
	ТЗС = _сф.т_Создать("СтрокаПоляКомпоновки,Имя,Заголовок,Сортировка,ИндексСортировки");	
	Для каждого СтрокаКолонки Из ОписаниеКолонок Цикл
		
		Если СтрокаКолонки.ИндексСортировки <> 0 Тогда
			Нстр = ТЗС.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр, СтрокаКолонки);
		КонецЕсли; 
		
	КонецЦикла; 
	ТЗС.Сортировать("ИндексСортировки Возр");
	ТаблицаСортировки.Загрузить(ТЗС);
	
	// ---------------------------------------------------------------------------- 
	ВысотаШапки = СН["ВысотаШапки"];
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьСписокТиповПеревозок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ТипыПеревозок.Ссылка КАК ТипПеревозки
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок КАК CW_ТипыПеревозок
	               |ГДЕ
	               |	НЕ CW_ТипыПеревозок.ПометкаУдаления";
	
	РезультатЗапроса 		= Запрос.Выполнить();
	МассивТиповПеревозок 	= РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ТипПеревозки");
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.ЗагрузитьЗначения(МассивТиповПеревозок);
	
	АдресСпискаТиповПеревозок = ПоместитьВоВременноеХранилище(СписокВыбора, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
		
	ЭтаФорма.Закрыть(_ПолучитьАдресНастройки());
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастройки()
	// --- 
	
	// определяем индексы сортировки и записываем в описание колонок
	Индекс=0;
	Для каждого СтрокаСортировки Из ТаблицаСортировки Цикл
		
		СтрокаКолонки = _сф.к_НайтиСтроку(ОписаниеКолонок,"СтрокаПоляКомпоновки",СтрокаСортировки.СтрокаПоляКомпоновки);
		Если СтрокаКолонки <> Неопределено Тогда
			
			_сф.Инкремент(Индекс);
			СтрокаКолонки.ИндексСортировки = Индекс;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Ответ = Новый Структура("ОсновнаяНастройка,ВысотаШапки");
	Ответ["ОсновнаяНастройка"]=ЗначениеВСтрокуВнутр(ОписаниеКолонок.Выгрузить());
	Ответ["ВысотаШапки"]= ВысотаШапки;
	
	Адрес = ПоместитьВоВременноеХранилище(Ответ,Адрес);
	Возврат(Адрес);
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОписаниеКолонокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияКолонки",ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.CW_ЖурналГрузоперевозок_ВыборПоля",Новый Структура("СхемаКомпоновки,ИмяФормыИсточника",АдресСхемыКомпоновки,ИмяФормыИсточника),,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияКолонки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		// обрабатываем полученное поле
		Статус = _ОбработатьВыборПоля(Ответ);
		Если Статус.Код <> 0 Тогда
			
			_УФК.ВывестиПредупреждение(Статус.ОписаниеОшибки);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ОбработатьВыборПоля(Поле)
	// --- 
	
	// проверяем, что такого поля ещё нет в описании колонок
	Если _сф.к_НайтиСтроку(ОписаниеКолонок,_сф.ст_Отбор("СтрокаПоляКомпоновки",Строка(Поле.Поле))) <> Неопределено Тогда
		
		// возврат
		Возврат(_УФКС.Ответ(1,"Поле уже добавлено."));
		
	КонецЕсли; 
	
	Нстр = ОписаниеКолонок.Добавить();
	Нстр.Имя = ИмяПоляКомпоновкиДанных(Строка(Поле.Поле));
	Нстр.Наименование = Поле.Заголовок;
	Нстр.Заголовок = Поле.Заголовок;
	
	
	// пробуем обработаь заголовок:
	СтрокиЗаголовка = _сф.стр_РазбитьНаСтроки(Нстр.Заголовок,".");
	ЧислоСтрок = _сф.стр_ЧислоСтрок(СтрокиЗаголовка);
	Если ЧислоСтрок > 1 Тогда
		
		// отбрасываем первую часть (Грузоперевозка)
		// склеиваем оставшиеся
		ЗаголовокКолонки="";
		Для СчетчикСтрок=2 По ЧислоСтрок Цикл
			
			Если ЗаголовокКолонки <> "" Тогда
				
				_сф.стр_Добавить(ЗаголовокКолонки,".");
				
			КонецЕсли; 
			
			_сф.стр_Добавить(ЗаголовокКолонки,_сф.стр_ПолучитьСтроку(СтрокиЗаголовка,,СчетчикСтрок));
			
		КонецЦикла;
		ЗаголовокКолонки = _сф.стр_Заменить(ЗаголовокКолонки,"(пг) ","");
		ЗаголовокКолонки = _сф.стр_Заменить(ЗаголовокКолонки,"(кд) ","");
		
		Нстр.Заголовок = ЗаголовокКолонки;
		
	КонецЕсли; 
	
	Если  СтрНачинаетсяС(Поле.Заголовок , "Заказ.") Тогда
		Нстр.Заголовок = Нстр.Заголовок + " (Заказ)";
	КонецЕсли;
	
	Нстр.СтрокаПоляКомпоновки = Строка(Поле.Поле);
	Нстр.ТипЗначения = Поле.ТипЗначения;
	Нстр.Видимость = Истина;
	Нстр.РежимПрямогоРедактирования = Ложь;
	Нстр.КонтрольнаяДатаГрузоперевозки = Ложь;
	Нстр.ПараметрГрузоперевозки = Ложь;
	Нстр.Ширина = 10; 
	Нстр.Фиксация = Перечисления.CW_ВариантыФиксацииКолонок.Нет;
	Нстр.Сортировка = Перечисления.CW_ПорядокСортировки.Нет;
	//Нстр.Положение = ПоложениеКолонки.НоваяКолонка;
	// --- 
	Если Нстр.Имя="ссылка" Тогда
		
		Нстр.Ширина = 15;
		
	КонецЕсли; 
	// анализируем имя, если параметр или контрольная дата - ищем объект, читаем настройки прямого редактирования
	Если Найти(Нстр.СтрокаПоляКомпоновки,"(кд)") <> 0 Тогда
		
		// это контрольная дата
		// пробуем найти по идентификатору
		
		// определяем строку идентификатора
		ИдентификаторКД = _сф.стр_СписокМакросов(Строка(Поле.Поле),"[]")[0];
		
		// проверяем, нет ли в составе идентификатора _ЗначениеПлан или _ЗначениеФакт
		ПлановоеЗначение = Ложь;
		ФактическоеЗначение = Ложь;
		Если (СтрНайти(ИдентификаторКД,"_ЗначениеПлан") <> 0) Тогда
			ПлановоеЗначение = Истина;
			ИдентификаторКД = СтрЗаменить(ИдентификаторКД,"_ЗначениеПлан","");
			ЗаголовокКолонки = СтрЗаменить(ЗаголовокКолонки,"_ЗначениеПлан","") + " (план)";
		КонецЕсли; 
		Если (СтрНайти(ИдентификаторКД,"_ЗначениеФакт") <> 0) Тогда
			ФактическоеЗначение = Истина;
			ИдентификаторКД = СтрЗаменить(ИдентификаторКД,"_ЗначениеФакт","");
			ЗаголовокКолонки = СтрЗаменить(ЗаголовокКолонки,"_ЗначениеФакт","")+ " (факт)";
		КонецЕсли; 
		Если (ПлановоеЗначение ИЛИ ФактическоеЗначение) Тогда
			Нстр.Заголовок = ЗаголовокКолонки;
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ПараметрыГрузоперевозок.Ссылка,
		|	CW_ПараметрыГрузоперевозок.ПрямоеРедактирование
		|ИЗ
		|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
		|ГДЕ
		|	CW_ПараметрыГрузоперевозок.Идентификатор = &Идентификатор";
		Запрос.УстановитьПараметр("Идентификатор", ИдентификаторКД);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Нстр.ОбъектХарактеристики = Выборка.Ссылка;
			Нстр.РежимПрямогоРедактирования = Выборка.ПрямоеРедактирование;
			Нстр.КонтрольнаяДатаГрузоперевозки = Истина;
			Нстр.КонтрольнаяДатаПлан = ПлановоеЗначение;
			Нстр.КонтрольнаяДатаФакт = ФактическоеЗначение;
			Нстр.Ширина = 12;
			
		КонецЕсли; 
		
		
		// --- 
		
		//СписокКолонокКонтрольныхДат.Добавить(Нстр);
		
	ИначеЕсли Найти(Нстр.СтрокаПоляКомпоновки,"(пг)") <> 0 Тогда 
		
		// это параметр грузоперевозки
		// пробуем найти по идентификатору
		
		// определяем строку идентификатора
		ИдентификаторПГ = _сф.стр_СписокМакросов(Строка(Поле.Поле),"[]")[0];
		
		// тут ещё надо проверить, чтобы не было обращения к реквизиту !!!
		Строки = _сф.стр_РазбитьНаСтроки(Строка(Поле.Поле),".");
		Если  НЕ (_сф.стр_ЧислоСтрок(Строки) > 2) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CW_ПараметрыГрузоперевозок.Ссылка,
			|	CW_ПараметрыГрузоперевозок.ПрямоеРедактирование
			|ИЗ
			|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
			|ГДЕ
			|	CW_ПараметрыГрузоперевозок.Идентификатор = &Идентификатор";
			Запрос.УстановитьПараметр("Идентификатор", ИдентификаторПГ);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				Нстр.ОбъектХарактеристики = Выборка.Ссылка;
				Нстр.РежимПрямогоРедактирования = Выборка.ПрямоеРедактирование;
				Нстр.ПараметрГрузоперевозки = Истина;
				Нстр.Ширина = 20;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// если не КД и не ПГ - 
	Если (НЕ Нстр.КонтрольнаяДатаГрузоперевозки) И (НЕ Нстр.ПараметрГрузоперевозки) Тогда
		
		// проверяем список колонок на режим редактирования для реквизитов объекта
		РеквизитыДляПрямогоРедактирования = CW_Журналы_Сервер.МассивРеквизитовГрупповогоРедактирования(Новый Структура("ИмяФормы",ИмяФормыИсточника));
		Если РеквизитыДляПрямогоРедактирования.Найти(Нстр.СтрокаПоляКомпоновки) <> Неопределено Тогда
			Нстр.РежимПрямогоРедактирования = Истина;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

&НаСервере
Функция ИмяПоляКомпоновкиДанных(Знач ПолеКД)
	// --- 
	
	ИмяПоля=ПолеКД;
	ИмяПоля=_сф.стр_Заменить(ИмяПоля," ","");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"(","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,")","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"[","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"]","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,".","");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,",","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"/","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"\","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"!","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"@","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"#","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"№","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"$","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,";","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"%","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"^","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,":","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"&","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"?","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"*","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"-","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"+","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"=","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"~","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"|","_");
	
	Возврат(НРег(ИмяПоля));
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПоказатьНазвание(Команда)
	
	// 
	ПоказыватьНаименование = (НЕ ПоказыватьНаименование);
	Элементы.ОписаниеКолонокНаименование.Видимость=ПоказыватьНаименование;
	Элементы.ОписаниеКолонокПоказатьНазвание.Пометка=ПоказыватьНаименование;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОписаниеКолонокПередУдалением(Элемент, Отказ)
	
	_СортировкаПередУдалением(Элементы.ОписаниеКолонок.ВыделенныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура _СортировкаПередУдалением(Знач ВыделенныеСтроки)
	// --- 
	
	Для каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		
		СтрокаКолонки = ОписаниеКолонок.НайтиПоИдентификатору(ТекущаяСтрока);
		Если СтрокаКолонки.Сортировка <> Перечисления.CW_ПорядокСортировки.Нет Тогда
			
			СтрокаСортировки = _сф.к_НайтиСтроку(ТаблицаСортировки,"СтрокаПоляКомпоновки",СтрокаКолонки.СтрокаПоляКомпоновки);
			// удаляем из таблицы сортировки
			Если СтрокаСортировки <> Неопределено Тогда
				
				ТаблицаСортировки.Удалить(СтрокаСортировки.ПолучитьИдентификатор());
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
 

&НаКлиенте
Процедура ОписаниеКолонокСортировкаПриИзменении(Элемент)
	
	_СортировкаПриИзменении(Элементы.ОписаниеКолонок.ТекущаяСтрока);
	
КонецПроцедуры


&НаСервере
Процедура _СортировкаПриИзменении(ТекущаяСтрока)
	// --- 
	
	// если - нет, то удаляем из стека
	// если да - ищем в стеке и устанавливаем - иначе добавляем в конец
	СтрокаКолонки = ОписаниеКолонок.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаСортировки = _сф.к_НайтиСтроку(ТаблицаСортировки,"СтрокаПоляКомпоновки",СтрокаКолонки.СтрокаПоляКомпоновки);
	Если СтрокаКолонки.Сортировка = Перечисления.CW_ПорядокСортировки.Нет Тогда
		
		// удаляем из таблицы сортировки
		Если СтрокаСортировки <> Неопределено Тогда
			
			ТаблицаСортировки.Удалить(СтрокаСортировки.ПолучитьИдентификатор());
			
		КонецЕсли; 
		
	Иначе
		
		Если СтрокаСортировки=Неопределено Тогда
			
			Нстр = ТаблицаСортировки.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,СтрокаКолонки);
			
		Иначе
			
			СтрокаСортировки.Сортировка = СтрокаКолонки.Сортировка;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеКолонокЗаголовокПриИзменении(Элемент)
	
	_ЗаголовокПриИзменении(Элементы.ОписаниеКолонок.ТекущаяСтрока);
		
КонецПроцедуры

&НаСервере
Процедура _ЗаголовокПриИзменении(ТекущаяСтрока)
	// --- 
	
	// если очистили - подставляем наименование
	СтрокаКолонки = ОписаниеКолонок.НайтиПоИдентификатору(ТекущаяСтрока);
	Если СокрЛП(СтрокаКолонки.Заголовок) = "" Тогда
		
		СтрокаКолонки.Заголовок = СтрокаКолонки.Наименование;
		
	КонецЕсли; 
	
	// если есть сортировка - обновляем заголовок в таблице
	Если СтрокаКолонки.Сортировка <> Перечисления.CW_ПорядокСортировки.Нет Тогда
		
		СтрокаСортировки = _сф.к_НайтиСтроку(ТаблицаСортировки,"СтрокаПоляКомпоновки",СтрокаКолонки.СтрокаПоляКомпоновки);
		Если СтрокаСортировки <> Неопределено Тогда
			
			СтрокаСортировки.Заголовок = СтрокаКолонки.Заголовок;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОписаниеКолонокВидимостьПриИзменении(Элемент)
	
	_ВидимостьПриИзменении(Элементы.ОписаниеКолонок.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура _ВидимостьПриИзменении(ТекущаяСтрока)
	// --- 
	
	СтрокаКолонки = ОписаниеКолонок.НайтиПоИдентификатору(ТекущаяСтрока);
	_ВидимостьПриИзмененииДляСтроки(СтрокаКолонки);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ВидимостьПриИзмененииДляСтроки(СтрокаКолонки)
	// --- 
	
	СтрокаСортировки = _сф.к_НайтиСтроку(ТаблицаСортировки,"СтрокаПоляКомпоновки",СтрокаКолонки.СтрокаПоляКомпоновки);
	Если СтрокаКолонки.Видимость = Истина Тогда
		
		// добавляем в сортировку
		Если СтрокаКолонки.Сортировка <> Перечисления.CW_ПорядокСортировки.Нет Тогда
			
			Нстр = ТаблицаСортировки.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,СтрокаКолонки);
			
		КонецЕсли; 
				
	Иначе
		
		// удаляем из таблицы сортировки
		Если СтрокаСортировки <> Неопределено Тогда
			
			ТаблицаСортировки.Удалить(СтрокаСортировки.ПолучитьИдентификатор());
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТаблицаСортировкиПередУдалением(Элемент, Отказ)
	
	// находим соответствие в списке колонок и меняем порядок сортировки
	_ОбработатьУдалениеСтрокиТаблицыСортировки(Элемент.ТекущаяСтрока);	
	
КонецПроцедуры

&НаСервере
Процедура _ОбработатьУдалениеСтрокиТаблицыСортировки(Идентификатор)
	// --- 
	
	СтрокаТаблицысортировки = ТаблицаСортировки.НайтиПоИдентификатору(Идентификатор);
	СтрокаСортировки = _сф.к_НайтиСтроку(ОписаниеКолонок,"СтрокаПоляКомпоновки",СтрокаТаблицысортировки.СтрокаПоляКомпоновки);
	Если СтрокаСортировки <> Неопределено Тогда
		
		СтрокаСортировки.Сортировка = Перечисления.CW_ПорядокСортировки.Нет;
		СтрокаСортировки.ИндексСортировки = 0;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ОписаниеКолонок.Количество() > 0 Тогда
		
		СоответствиеПредставлений = ПолучитьЗаголовкиФОрмыПоИмениОбъкта();
		
		мДанныеФормы = СтрРазделить(ЭтотОбъект.ИмяФормыИсточника,".",ложь);
		
		ПредставлениеЗаголовкаФормы = СоответствиеПредставлений.Получить(мДанныеФормы[1]);
		ПредставлениеЗаголовкаФормы = ?(ПредставлениеЗаголовкаФормы=Неопределено, "Журнал", ПредставлениеЗаголовкаФормы);
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиКолонокПриЗаполнении",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Текущие колоноки журнала будут удалены." + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет, , , ПредставлениеЗаголовкаФормы);
		
	Иначе
		
		_Заполнить();		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗаголовкиФОрмыПоИмениОбъкта()
	
	Результат = Новый Соответствие;
	Результат.Вставить("CW_ЖурналЗаказов",			"Журнал заказов");
	Результат.Вставить("CW_ЖурналГрузоперевозок", 	"Журнал грузоперевозок");
	Результат.Вставить("CW_ЖурналЗаявок", 			"Журнал заявок");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВопросаОчисткиКолонокПриЗаполнении(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ = КодВозвратаДиалога.Да) Тогда
		_Заполнить();
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоТипуПеревозки(Команда)
	
	Если ОписаниеКолонок.Количество() > 0 Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиКолонокПриЗаполненииПоТипуПараметра",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Текущие колоноки журнала будут удалены." + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет, , , "Журнал грузоперевозок");
	Иначе
		
		ПродолжитьЗаполнениеСпискаКолонок();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОчисткиКолонокПриЗаполненииПоТипуПараметра(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПродолжитьЗаполнениеСпискаКолонок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнениеСпискаКолонок()
	
	Если ЭтоАдресВременногоХранилища(АдресСпискаТиповПеревозок) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресСпискаЗначений"	, АдресСпискаТиповПеревозок);
		ПараметрыФормы.Вставить("СписокСПометками"		, Ложь);
		ПараметрыФормы.Вставить("ЗаголовокФормы"		, "Выберите тип перевозки");
		
		ОписаниеОповещения = новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораСпискаПараметров", ЭтаФорма);
		
		ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораИзСписка",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораСпискаПараметров(Ответ, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Ответ) и ЭтоАдресВременногоХранилища(Ответ) Тогда
		СтукрутаОтвета = ПолучитьИзВременногоХранилища(Ответ);
		_Заполнить(СтукрутаОтвета.Значение); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _Заполнить(ТипПеревозки = Неопределено)
	
	ОписаниеКолонок.Очистить();

	мДанныеФормы 		= СтрРазделить(ЭтотОбъект.ИмяФормыИсточника,".",ложь);
	ПолноеИмяОбъекта 	= мДанныеФормы[0]+"."+мДанныеФормы[1];
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
	Результат = МенеджерОбъекта.ЗаполнитьНастройкиКолонок(ТипПеревозки);
	
	Для Каждого СтруктураВМассиве из Результат Цикл
		Статус = _ОбработатьВыборПоля(СтруктураВМассиве);
		Если Статус.Код <> 0 Тогда
			Сообщить(Статус.ОписаниеОшибки);
		КонецЕсли; 
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость(Команда)
	
	_УстановитьВидимостьВсех(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВидимость(Команда)
	
	_УстановитьВидимостьВсех(Ложь);
	
КонецПроцедуры
 

&НаСервере
Процедура _УстановитьВидимостьВсех(Признак)
	// --- 
	
	Для каждого Стр Из ОписаниеКолонок Цикл
		
		Если (Стр.Видимость <> Признак) Тогда
			
			Стр.Видимость = Признак;
			_ВидимостьПриИзмененииДляСтроки(Стр);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеКолонокФорматНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	Попытка
		
		Конструктор = Новый КонструкторФорматнойСтроки;
		Конструктор.Текст = Элементы.ОписаниеКолонок.ТекущиеДанные.Формат;
		СтрокаТипа = _СтрокаТипа(Элементы.ОписаниеКолонок.ТекущаяСтрока);
		Конструктор.ДоступныеТипы = Новый ОписаниеТипов(СтрокаТипа); 
		// --- 
		ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияФорматаКолонки",ЭтотОбъект); 
		Конструктор.Показать(ПОВ);
		
	Исключение
		_УФК.ВывестиПредупреждение("Формат вывода доступен только для примитивных типов.");
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияФорматаКолонки(НовыйТекст, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (НовыйТекст <> Неопределено) Тогда
		
		Элементы.ОписаниеКолонок.ТекущиеДанные.Формат = НовыйТекст;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  
 
&НаСервере
Функция _СтрокаТипа(Идентификатор)
	// --- 
	
	СтрокаОписания  = ОписаниеКолонок.НайтиПоИдентификатору(Идентификатор);
	Возврат(Строка(СтрокаОписания.ТипЗначения));	
	
	// --- 
КонецФункции

 


// ---------------------------------------------------------------------------- 

