
Функция ПолучитьСтруктуруПараметровЗаписиМаршрута() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаписатьРеквизиты", 			Ложь);
	Результат.Вставить("ЗаписатьМаршрут", 				Ложь);
	Результат.Вставить("ЗаписатьОбъектНаСогласование", 	Ложь);
	Результат.Вставить("ОтменитьОбъектНаСогласование",	Ложь);
	Результат.Вставить("ЗаписатьСостояниеОбъекта", 		Ложь);
	Результат.Вставить("ОповеститьПользователей", 		Ложь);
	Результат.Вставить("ОповеститьИнициатора", 			Ложь);  
	Результат.Вставить("СостояниеОбъекта", 				Неопределено);  
	
	Возврат Результат;
	
КонецФункции