#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПроверитьКорректностьSWIFT(SWIFT, ТекстОшибки = "") Экспорт
	
	ТекстОшибки = "";
	
	Если СтрДлина(SWIFT) <> 8 И СтрДлина(SWIFT) <> 11 Тогда 
		ТекстОшибки = "может состоять из 8 или 11 символов";
	КонецЕсли;

	флПосторонниеСимыолы = Ложь;
	Для ы = 1 ПО СтрДлина(SWIFT) Цикл 
		симв = Сред(SWIFT, ы, 1);
		Если симв < "A" ИЛИ симв > "Z" Тогда 
			Если симв < "0" ИЛИ симв > "9" Тогда 
				флПосторонниеСимыолы = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если флПосторонниеСимыолы Тогда 
		ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки+", ","") + "допустимы только цифры и латинские символы";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецЕсли
