&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//В качестве параметров формы передается структура параметров:
	//
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("ПараметрыВнешнейКоманды"	, СтруктураПараметровВнешнейКоманды);
	//СтруктураПараметров.Вставить("МассивОбъектовНазначения"	, МассивОбъектовНазначения);
	//

	
	
КонецПроцедуры


// Процедура - Выполнить внешнюю команду
//
// Параметры:
//  СтруктураПараметров	 - 	 - 
//	СтруктураПараметров = Новый Структура;
//	СтруктураПараметров.Вставить("ПараметрыВнешнейКоманды"	,  Структура("ПодключаемыйОбъект, ИмяМетода, ИмяФормы", Неопределено, "",""));
//	СтруктураПараметров.Вставить("МассивОбъектовНазначения"	, МассивОбъектовНазначения);
&НаКлиенте
Процедура ВыполнитьВнешнююКоманду(СтруктураПараметров) Экспорт
	
	ОбъектВладельца = ВладелецФормы.Объект;   
	
	Если СтруктураПараметров.МассивОбъектовНазначения <> Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В команду передано "+Формат(СтруктураПараметров.МассивОбъектовНазначения.Количество(),"ЧГ=0")+" объектов";
		Сообщение.Сообщить();
	КонецЕсли; 
	
	ЗаполнитьДанныеФормыНаСервере(ОбъектВладельца);
	
	КопироватьДанныеФормы(ОбъектВладельца, ВладелецФормы.Объект);  
	
	ВладелецФормы.Модифицированность = Истина;
	
	ПоказатьПредупреждение(,"Выполнена тестовая внешняя команда!");
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДанныеФормыНаСервере(Объект) 
	
	//Код заполнения объекта
	
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьИзФормы(Команда)
	
	ЭтаФорма.Закрыть();
	
	//массив методов формы владельца, которые необходимо выполнить после закрытия формы внешней команды
	МетодыФормыВладельца = Новый Массив;
	МетодыФормыВладельца.Добавить("_УправлениеЭлементамиФормы()");
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("УникальныйИдентификатор"	, ВладелецФормы.УникальныйИдентификатор);
	ПараметрыОповещения.Вставить("МетодыФормыВладельца"		, МетодыФормыВладельца);
	
	Оповестить("ВыполнитьМетодВладельца", ПараметрыОповещения);
	
КонецПроцедуры

