
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.Элементы[0].Значение = Параметры.КлючОбъекта;
	Список.Параметры.Элементы[0].Использование = Истина;
	Список.Параметры.Элементы[1].Значение = CW_Настройки.Пользователь();
	Список.Параметры.Элементы[1].Использование = Истина;
	
	Если Найти(Параметры.КлючОбъекта,"_Отбор_")>0 Тогда 
		ЭтаФорма.Заголовок = "Загрузка отбора";
	ИначеЕсли Найти(Параметры.КлючОбъекта,"_Группировка_")>0 Тогда 
		ЭтаФорма.Заголовок = "Загрузка группировки";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройку(Команда)
	
	ОбработатьВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбор()
	// --- 
	
	Если (Элементы.Список.ТекущиеДанные = Неопределено) Тогда
		_УФК.ВывестиПредупреждение("Не выбрана настройка!");
		Возврат;
	КонецЕсли; 
	
	Ответ = Новый Структура("НастройкаСсылка,НеВосстанавливатьОтбор",Элементы.Список.ТекущаяСтрока,НеВосстанавливатьОтбор);
	ЭтаФорма.Закрыть(Ответ);
	
	// --- 
КонецПроцедуры
  