
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Список = ПолучитьСписок(ПараметрКоманды);
	Если Список = Неопределено Тогда
		ПоказатьПредупреждение(,"Планы поступления ДС не найдены!");
	ИначеЕсли Список.Количество() = 1 Тогда 
		ПоказатьЗначение(,Список[0].Значение);
	Иначе
		Список.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыборСтатьи",ЭтотОбъект),"Выберите план поступления");
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСтатьи(Рез,ДП)Экспорт
	Если НЕ Рез = Неопределено Тогда
		ПоказатьЗначение(,Рез.Значение);
	КонецЕсли; 	
КонецПроцедуры
 

&НаСервере
Функция ПолучитьСписок(Ссылка)
	Запрос = Новый Запрос;Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ПланированиеДДС.Ссылка КАК Ссылка,
		|	CW_ПланированиеДДС.Код КАК Код,
		|	CW_ПланированиеДДС.Дата КАК Дата,
		|	CW_ПланированиеДДС.Автор.Наименование КАК Автор,
		|	CW_ПланированиеДДС.Сумма КАК Сумма
		|ИЗ
		|	Справочник.CW_ПланированиеДДС КАК CW_ПланированиеДДС
		|ГДЕ
		|	CW_ПланированиеДДС.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженияДДС.Приход)
		|	И (ВЫРАЗИТЬ(CW_ПланированиеДДС.ДокументОснование КАК Документ.CW_ДоходыПоГрузоперевозке)) = &ДокументОснование
		|
		|УПОРЯДОЧИТЬ ПО
		|	CW_ПланированиеДДС.Дата";
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() Тогда
		Список = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			Список.Добавить(Выборка.Ссылка,Выборка.Код + " от " + Формат(Выборка.Дата,"ДЛФ=D") + " - " + Формат(Выборка.Сумма,"ЧДЦ=2") + " (" + Выборка.Автор+ ")");
		КонецЦикла; 
		Возврат Список
	КонецЕсли; 
КонецФункции
