#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОтчетВывести(ТабДок, ДанныеРасшифровки) Экспорт 
	
	// --- 
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ВРег(МетаданныеОтчета.Синоним));
	
	// Установим параметры
	//НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Период", КонецДня(Настройки.НаДату));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Период"			, Новый Граница(КонецДня(Настройки.НаДату), ВидГраницы.Включая));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ТолькоОтклонение"	, Настройки.ТолькоОтклонения);
	
	// формируем структуру отчета по группировкам
	НастройкиСКД.Структура.Очистить();
	ТекущийРодитель = НастройкиСКД.Структура;
	Для Каждого Группировка Из Настройки.Группировки Цикл
		НоваяГруппировка = ТекущийРодитель.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		// --- 
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		ПолеГруппировки.Использование = Истина;
		// --- 
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование=Истина;
		// --- 
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		НС = ?(Группировка.Сортировка=Перечисления.CW_НаправлениеСортировки.ПоВозрастанию,НаправлениеСортировкиКомпоновкиДанных.Возр,НаправлениеСортировкиКомпоновкиДанных.Убыв);
		ЭлементПорядка.ТипУпорядочивания = НС;
		ЭлементПорядка.Использование = Истина;
		// --- 
		НоваяГруппировка.Имя = Группировка.Представление;
		НоваяГруппировка.Использование = Истина;
		// --- 
		ТекущийРодитель = НоваяГруппировка.Структура;
	КонецЦикла; 
	
КонецПроцедуры

#КонецЕсли