
&НаСервере
Функция ОбновитьНаСервере()
	Возврат CW_DT.ПолучитьСообщения(Получатель,ИдентификаторПолучателя,НастройкаСоединения);
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	Ответ = ОбновитьНаСервере();
	НовыеСообщения.Очистить();
	//Если НЕ Ответ.Количество() Тогда ПоказатьПредупреждение(Новый ОписаниеОповещения("НетСообщений",ЭтаФорма),"Новых сообщений нет!");Возврат;КонецЕсли; 
	Для Каждого Сообщение Из Ответ Цикл
		ЗаполнитьЗначенияСвойств(НовыеСообщения.Добавить(),Сообщение);
	КонецЦикла; 
	Элементы.ФормаПолучить.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НетСообщений(Рез) Экспорт
	Закрыть(НужноОбновитьМенеджер);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ CW_DT.РабочаяБаза() Тогда 
		ОписаниеОшибки = ОписаниеОшибки + "-Получение в копии запрещено!" + Символы.ПС;
	КонецЕсли; 
	НастройкаСоединения = Константы.CW_DT_ОсновнаяНастройкаСоединения.Получить();
	Если НастройкаСоединения.Пустая() Тогда
		ОписаниеОшибки = ОписаниеОшибки + "-Не настроено соедиение с сервисом!" + Символы.ПС;	
	КонецЕсли; 
	Параметры.Свойство("Получатель",Получатель);
	ИдентификаторПолучателя = CW_DT.ПолучитьИдентификаторУчастника(Получатель);
	Если ИдентификаторПолучателя = "" Тогда
		ОписаниеОшибки = ОписаниеОшибки + "-Не задан идентификатор получателя" + Символы.ПС;	
	КонецЕсли; 
	Если НЕ ОписаниеОшибки = "" Тогда
		Заголовок = "Получение сообщений невозможно!";
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОшибка;
	Иначе
		Заголовок = "Новые сообщения: " + Получатель;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОсновная;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьНаСервере(Закрыть)
	Для Каждого Ид Из Элементы.НовыеСообщения.ВыделенныеСтроки Цикл
		Стр = НовыеСообщения.НайтиПоИдентификатору(Ид);
		Если CW_DT.ЗагрузитьСообщение(Стр,НастройкаСоединения) Тогда
			Закрыть = Истина;
			НовыеСообщения.Удалить(Стр);		
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Получить(Команда)
	Закрыть = Ложь;
	ПолучитьНаСервере(Закрыть);
	Если Закрыть Тогда 
		Оповестить("CWDT.МенеджерСообщений.ОбновитьВходящие");
		Закрыть(Истина);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Закрыть(НужноОбновитьМенеджер);
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСнять(Команда)
	Пометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПометкиУстановить(Команда)
	Пометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Пометки(Пометка)
	Для Каждого Стр Из НовыеСообщения Цикл
		Стр.Пометка = Пометка;	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОсновная Тогда
		Обновить("");
		Если НЕ НовыеСообщения.Количество() Тогда
			Отказ = Истина;ПоказатьПредупреждение(,"Новых сообщений нет!")	
		КонецЕсли;  
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СтатусПолученНаСервере()
	Для Каждого Ид Из Элементы.НовыеСообщения.ВыделенныеСтроки Цикл
		Стр = НовыеСообщения.НайтиПоИдентификатору(Ид);
		Если CW_DT.УстановитьСтатусСообщения(Стр.message_id,Получатель,ИдентификаторПолучателя,НастройкаСоединения) Тогда
			НовыеСообщения.Удалить(Стр);		
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СтатусПолучен(Команда)
	СтатусПолученНаСервере();
КонецПроцедуры
 