#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Подготавливает параметры для получения документов уплаты налогов.
//
// Параметры:
//		Организация - СправочникСсылка.Организации
//		НачалоПериода - Дата - начало периода поиска
//		КонецПериода - Дата - конец периода поиска
//
// Возвращаемое значение:
//		ТаблицаЗначений - заполненная таблица уплаты налогов.
//
Функция ДокументыУплаты(Организация, НачалоПериода, КонецПериода) Экспорт
	
	ПараметрыУплатыНалогов = ПомощникиПоУплатеНалоговИВзносов.НовыеПараметрыУплатыНалогов();
	ПараметрыУплатыНалогов.КодыЗадач.Добавить("НалогНаПрофессиональныйДоход");
	
	ПараметрыУплатыНалогов.ВидыНалогов.Добавить(Перечисления.ВидыНалогов.НалогНаПрофессиональныйДоход);
	ПараметрыУплатыНалогов.ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ЕдиныйНалоговыйПлатеж);
	
	ПараметрыУплатыНалогов.ВидыНалоговыхОбязательств.Добавить(Перечисления.ВидыПлатежейВГосБюджет.Налог);
	ПараметрыУплатыНалогов.ВидыНалоговыхОбязательств.Добавить(Перечисления.ВидыПлатежейВГосБюджет.ПениАкт);
	ПараметрыУплатыНалогов.ВидыНалоговыхОбязательств.Добавить(Перечисления.ВидыПлатежейВГосБюджет.ПениСам);
	
	ПараметрыУплатыНалогов.ТипыДокументов.Добавить(Тип("ДокументСсылка.ПлатежноеПоручение"));
	ПараметрыУплатыНалогов.ТипыДокументов.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	
	ТаблицаПлатежей = ПомощникиПоУплатеНалоговИВзносов.ДокументыУплатыНалогов(
		Организация, НачалоПериода, КонецПериода, ПараметрыУплатыНалогов);
	Для Каждого СтрокаПлатежа Из ТаблицаПлатежей Цикл
		СтрокаПлатежа.Период = НачалоДня(КонецМесяца(СтрокаПлатежа.Период));
	КонецЦикла;
	
	Возврат ТаблицаПлатежей;
	
КонецФункции

// Отменяет запущенные фоновые задания.
//
// Параметры:
//		ИдентификаторЗадания - УникальныйИдентификатор 
//
Процедура ОтменитьФоновоеЗадание(ИдентификаторЗадания) Экспорт
	
	СообщениеОбОшибке = Неопределено;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьВыполнениеЗадания(ИдентификаторЗадания, СообщениеОбОшибке) Тогда 
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет завершение длительной операции по идентификатору.
//
// Параметры:
//		ИдентификаторЗадания 	- УникальныйИдентификатор - идентификатор фонового задания.
//		СообщениеОбОшибке	  	- Строка - возвращает сообщение об ошибке.
//
// Возвращаемое значение:
//		Булево - Истина, если длительная операция завершена, в том числе с ошибками.
//
Функция ПроверитьВыполнениеЗадания(ИдентификаторЗадания, СообщениеОбОшибке)
	
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Попытка
		
		Выполнено = ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
		СообщениеОбОшибке = "";
		
	Исключение
		СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'Не удалось выполнить данную операцию.
			|Подробности см. в Журнале регистрации.
			|%1'"), ОписаниеОшибки());
		Выполнено = Истина;
		
	КонецПопытки;
	
	Возврат Выполнено;
		
КонецФункции

Процедура УстановитьСтатусЗадачи(Организация, Правило, Период, Платежи, СуммаНалога) Экспорт
	
	ПараметрыЗадачи = Новый Структура;
	ПараметрыЗадачи.Вставить("Организация", Организация);
	ПараметрыЗадачи.Вставить("ПериодСобытия", Период);
	ПараметрыЗадачи.Вставить("Правило", Правило);
	ПараметрыЗадачи.Вставить("Действие", Правило.Действие);
	ПараметрыЗадачи.Вставить("РегистрацияВНалоговомОргане", Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка());
	
	ВыполнениеЗадачБухгалтера.ПроверитьАктуальностьСтатуса(ПараметрыЗадачи, СтатусЗадачиПоОплате(СуммаНалога, Платежи));
	
КонецПроцедуры

Функция СтатусЗадачиПоОплате(НалогКУплате, Платежи)
	
	Статус = "";
	
	Если НалогКУплате <> 0 Тогда
		
		СуммаОплаты = ПомощникиПоУплатеНалоговИВзносов.СуммаОплаты(Платежи);
		
		Если СуммаОплаты >= НалогКУплате Тогда
			Статус = "Оплачено";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Статус;

КонецФункции

#КонецОбласти

#КонецЕсли