
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТЗ = Параметры.АдресТЗ;
	ТЗХ = ПолучитьИзВременногоХранилища(АдресТЗ);
	АдресТЗ = ПоместитьВоВременноеХранилище(ТЗХ,ЭтаФорма.УникальныйИдентификатор);
	
	
	СчетДляОтбора = _сф.ст_ПолучитьСвойство(Параметры,"СчетДляОтбора");
	ПоПоставщику = Параметры.ПоПоставщику;
	
	_ОбновитьТаблицы();
	
	Элементы.ТЗЗаказ.Видимость = Параметры.ВыводитьЗаказы;
	Элементы.Поставщики.Видимость = ПоПоставщику;
	Элементы.ТЗДанныеПервичныхДокументов.Видимость = ПоПоставщику;
	Элементы.ОтборПоГрузоперевозкамСчета.Видимость = (ЗначениеЗаполнено(СчетДляОтбора));
	Элементы.ОтборПоНоменклатуреСчета.Видимость = (ЗначениеЗаполнено(СчетДляОтбора));
	   	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция _ОбновитьТаблицы()
	// --- 
	
	ТЗХ = ПолучитьИзВременногоХранилища(АдресТЗ);
	ТЗ.Загрузить(ТЗХ);
	// --- 
	Если (ОтборПоГрузоперевозкамСчета) Тогда
		
		// получаем массив г/п счета
		ГрузоперевозкиСчета = СчетДляОтбора.Услуги.Выгрузить(,"Грузоперевозка");
		ГрузоперевозкиСчета.Свернуть("Грузоперевозка");
		Грузоперевозки = ГрузоперевозкиСчета.ВыгрузитьКолонку("Грузоперевозка");
		
		МУ = Новый Массив;
		Для каждого Стр Из ТЗ Цикл
			
			Если (Грузоперевозки.Найти(Стр.Грузоперевозка) = Неопределено) Тогда
				МУ.Добавить(Стр);
			КонецЕсли; 
			
		КонецЦикла;
		_сф.к_УдалитьЭлементыПоМассиву(ТЗ,МУ);
		
	КонецЕсли; 
	
	Если (ОтборПоНоменклатуреСчета) Тогда
		
		// получаем массив г/п счета
		НоменклатураСчета = СчетДляОтбора.Услуги.Выгрузить(,"Номенклатура");
		НоменклатураСчета.Свернуть("Номенклатура");
		Номенклатура = НоменклатураСчета.ВыгрузитьКолонку("Номенклатура");
		
		МУ = Новый Массив;
		Для каждого Стр Из ТЗ Цикл
			
			Если (Номенклатура.Найти(Стр.Номенклатура) = Неопределено) Тогда
				МУ.Добавить(Стр);
			КонецЕсли; 
			
		КонецЦикла;
		_сф.к_УдалитьЭлементыПоМассиву(ТЗ,МУ);
		
	КонецЕсли; 
	
	ТаблицаПоставщиков = ТЗ.Выгрузить(,"Поставщик,СуммаВсего");
	_сф.к_УдалитьЭлементыПоОтбору(ТаблицаПоставщиков,_сф.ст_Отбор("Поставщик",Справочники.Контрагенты.ПустаяСсылка()));
	ТаблицаПоставщиков.Свернуть("Поставщик","СуммаВсего");
	Поставщики.Загрузить(ТаблицаПоставщиков);
	// --- 
	ПересчитатьИтого();
	
	// --- 
КонецФункции
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОК(Команда)
	
	ЭтаФорма.Закрыть(_ПолучитьАдресТЗ());
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресТЗ()
	// --- 
	
	Возврат(ПоместитьВоВременноеХранилище(ТЗ.Выгрузить().Скопировать(_сф.ст_Отбор("Пометка",Истина)),АдресТЗ));
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТЗПометкаПриИзменении(Элемент)
	
	ПересчитатьИтого();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтого()
	// --- 
	
	Если ПоПоставщику Тогда
		
		Для каждого Стр Из Поставщики Цикл
			
			Отбор = _сф.ст_Отбор("Поставщик",Стр.Поставщик);
			Отбор.Вставить("Пометка",Истина);
			Стр.СуммаПодобрано = ТЗ.Выгрузить(Отбор).Итог("СуммаВсего");
			
		КонецЦикла; 	
		
	КонецЕсли; 
		
	ИтогоВыбранных = ТЗ.Выгрузить(_сф.ст_Отбор("Пометка",Истина)).Итог("СуммаВсего");
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Если ПоПоставщику Тогда
		
		_УстановитьПометку(Ложь,Элементы.Поставщики.ТекущиеДанные.Поставщик);  
		
	Иначе
		
		_УстановитьПометку(Ложь);  
		
	КонецЕсли; 
	
	
	
	ПересчитатьИтого();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Если ПоПоставщику Тогда
		
		_УстановитьПометку(Истина,Элементы.Поставщики.ТекущиеДанные.Поставщик); 
		
	Иначе
		
		_УстановитьПометку(Истина); 
		
	КонецЕсли; 
	
	
	ПересчитатьИтого();
	
КонецПроцедуры

&НаКлиенте
Процедура _УстановитьПометку(Значение,Поставщик=Неопределено)
	// --- 
	
	Если ПоПоставщику Тогда
		
		Для каждого Стр Из ТЗ.НайтиСтроки(Новый Структура("Поставщик",Поставщик)) Цикл
			
			Стр.Пометка = Значение;
			
		КонецЦикла;
		
	Иначе
		
		Для каждого Стр Из ТЗ Цикл
			
			Стр.Пометка = Значение;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПоставщикиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Поставщики.ТекущиеДанные <> Неопределено Тогда
		
		Элементы.ТЗ.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Поставщик",Элементы.Поставщики.ТекущиеДанные.Поставщик));
		Элементы.ТЗ.Обновить();
		
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПоискПоСтроке(Команда)
	
	Текст = "";
	ПОВ = Новый ОписаниеОповещения("ОбработкаВводаТекста",ЭтотОбъект); 
	ПоказатьВводСтроки(ПОВ,Текст,"Поиск");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаТекста(НовыйТекст, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (НовыйТекст <> Неопределено) Тогда
		
		Текст = НовыйТекст;
		
		Если ПоПоставщику Тогда
			
			ТекСтр = _ПолучитьСтроку(Элементы.Поставщики.ТекущиеДанные.Поставщик,"ТЗГрузоперевозка",СокрЛП(Текст));
			
		Иначе
			
			ТекСтр = _ПолучитьСтроку(Неопределено,"ТЗГрузоперевозка",СокрЛП(Текст));
			
		КонецЕсли; 
		
		Если ТекСтр <> Неопределено Тогда
			
			Элементы.ТЗ.ТекущаяСтрока = ТекСтр;
			
		Иначе
			
			_УФК.ВывестиПредупреждение("Ничего не найдено.");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПолучитьСтроку(Поставщик=Неопределено,Знач Колонка,СтрокаПоиска)
	// --- 
	
	Колонка = СтрЗаменить(Колонка,"ТЗ","");
	
	Если ПоПоставщику Тогда
		
		МассивСтрок = ТЗ.НайтиСтроки(_сф.ст_Отбор("Поставщик",Поставщик));
		
	Иначе
		
		МассивСтрок = ТЗ;
		
	КонецЕсли; 
	
	Для каждого Стр Из МассивСтрок Цикл
		
		Если Найти(Строка(Стр[Колонка]),СтрокаПоиска) <> 0 Тогда
			
			Возврат(Стр.ПолучитьИдентификатор());
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(Неопределено);
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ТЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	
	Элементы.ТЗ.ТекущиеДанные.Пометка = НЕ Элементы.ТЗ.ТекущиеДанные.Пометка;
	
	ПересчитатьИтого();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ПоставщикиСуммаВсего Тогда
		
		СтандартнаяОбработка = Ложь;
		// --- 
		
		Если Элементы.Поставщики.ТекущиеДанные.СуммаПодобрано <> 0 Тогда
			
			_УстановитьПометку(Ложь,Элементы.Поставщики.ТекущиеДанные.Поставщик);
			
		Иначе
			
			_УстановитьПометку(Истина,Элементы.Поставщики.ТекущиеДанные.Поставщик);
			
		КонецЕсли; 
		
		ПересчитатьИтого();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоГрузоперевозкамСчетаПриИзменении(Элемент)
	
	_ОбновитьТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоНоменклатуреСчетаПриИзменении(Элемент)
	
	_ОбновитьТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗПриИзменении(Элемент)
	
	Если (Элементы.Поставщики.Видимость) Тогда
		
		Если Элементы.Поставщики.ТекущиеДанные <> Неопределено Тогда
			
			Элементы.ТЗ.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Поставщик",Элементы.Поставщики.ТекущиеДанные.Поставщик));
			Элементы.ТЗ.Обновить();
			
		КонецЕсли; 
		
	Иначе
		
		Элементы.ТЗ.Обновить();
		
	КонецЕсли; 
	
КонецПроцедуры
 

  #Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти