
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды",		ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ТипПараметраКоманды",	ТипЗнч(ПараметрКоманды));
	ДополнительныеПараметры.Вставить("Источник",			ПараметрыВыполненияКоманды.Источник);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьСозданиеЭПД", ЭтотОбъект, ДополнительныеПараметры);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПараметрКоманды", ПараметрКоманды);
	
	ОткрытьФорму("ОбщаяФорма.CW_ОбменГИСЭПДСозданиеЭПД", СтруктураПараметров , 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИдентификаторОбъектаМетаданных(ТипПараметраКоманды)

	Возврат ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипПараметраКоманды);
	
КонецФункции


&НаКлиенте
Процедура ПродолжитьСозданиеЭПД(РезультатВыбора, ДополнительныеПараметры) ЭКспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ТипОбъекта = ПолучитьИдентификаторОбъектаМетаданных(ДополнительныеПараметры.ТипПараметраКоманды);
	РезультатВыбора.Вставить("ТипОбъекта", ТипОбъекта);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПараметрКоманды", ДополнительныеПараметры.ПараметрКоманды);
	ПараметрыПроцедуры.Вставить("РезультатВыбора", РезультатВыбора);
	
	РезультатВыполнения =  НачатьСозданиеПроформыЭПДНаСервереВФоне(ПараметрыПроцедуры); 
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;     
	
	Дополнительныепараметры.Вставить("РезультатВыбора", РезультатВыбора);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ДополнительныеПараметры.Источник);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеФормированияПроформыЭПД", ЭтотОбъект, Дополнительныепараметры); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры  

&НаСервере
Функция НачатьСозданиеПроформыЭПДНаСервереВФоне(ПараметрыПроцедуры) 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне		= Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне    = ложь;  
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ОбменГИСЭПДДополнительный.ПолучитьДанныеДокументаЭПД" ,ПараметрыПроцедуры, ПараметрыВыполнения);  	
	
КонецФункции 

&НаКлиенте 
Процедура ПослеФормированияПроформыЭПД(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда   
		
		РезультатВыполненя = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		Если ТипЗнч(РезультатВыполненя) <> тип("Структура") Тогда
			Возврат;
		КонецЕсли;   
		
		Если Дополнительныепараметры.РезультатВыбора.Свойство("ДокументЭПД") Тогда
			РезультатВыполненя.Вставить("Ключ", Дополнительныепараметры.РезультатВыбора.ДокументЭПД);
		КонецЕсли;
		
		ОткрытьФорму("Справочник.CW_ОбменГИСЭПДПроформыТитуловЭПД.ФормаОбъекта", РезультатВыполненя, Дополнительныепараметры.Источник);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("ФиксированныйМассив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования элементов проформы ЭПД");  
		
	КонецЕсли;  
	
КонецПроцедуры 

