&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОсновнойВидОперацииПлатежногоПоручения.Видимость  = Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход");
	УстановитьОтбор();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьОтбор();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	Список.Отбор.Элементы.Очистить();
	Отбор					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СтатьяДДС");
	Отбор.ПравоеЗначение	= Объект.Ссылка;
	Отбор.Использование		= Истина;
	
	Элементы.Список.ТолькоПросмотр = Объект.Ссылка.Пустая();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,ПолучитьСтатью(ВыбраннаяСтрока));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатью(Ключ)
	Возврат Ключ.СтатьяДвиженияДенежныхСредств		
КонецФункции

&НаКлиенте
Процедура ВидДвиженияПриИзменении(Элемент)
	Элементы.ОсновнойВидОперацииПлатежногоПоручения.Видимость  = Объект.ВидДвижения = ПредопределенноеЗначение("Перечисление.CW_ВидыДвиженияДДС.Расход");
КонецПроцедуры

&НаСервере
Процедура УстановитьОсновнойНаСервере(СтатьяДвиженияДенежныхСредств)
	
	Объект.ОсновнаяСтатьяДДС = СтатьяДвиженияДенежныхСредств; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОсновной(Команда)
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		УстановитьОсновнойНаСервере(ТекущаяСтрока.СтатьяДвиженияДенежныхСредств);
		УстановитьПометкуКнопки(ТекущаяСтрока.СтатьяДвиженияДенежныхСредств);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		УстановитьПометкуКнопки(ТекущаяСтрока.СтатьяДвиженияДенежныхСредств);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуКнопки(СтатьяДвиженияДенежныхСредств)
	Элементы.СписокУстановитьОсновной.Пометка = СтатьяДвиженияДенежныхСредств = Объект.ОсновнаяСтатьяДДС;
КонецПроцедуры




 
