
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ПриИзмененииНаименования();
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторПриИзменении(Элемент)
	ПриИзмененииИдентификатора();
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНаименования()
	
	тИдентификатор = Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПолучитьИдентификатор(Объект.Наименование);
	
	Объект.Идентификатор 			= тИдентификатор;
	
	ПриИзмененииИдентификатора();

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииИдентификатора()
	
	Объект.ИдентификаторСлужебный 	= ВРег(Объект.Идентификатор);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПровериьСовпадениеИдентификатора(Отказ);

КонецПроцедуры

&НаСервере
Процедура ПровериьСовпадениеИдентификатора(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_ПоказателиРасчетаРасходаТоплива.Ссылка КАК Ссылка,
	|	CW_ПоказателиРасчетаРасходаТоплива.Идентификатор КАК Идентификатор
	|ИЗ
	|	Справочник.CW_ПоказателиРасчетаРасходаТоплива КАК CW_ПоказателиРасчетаРасходаТоплива
	|ГДЕ
	|	CW_ПоказателиРасчетаРасходаТоплива.Ссылка <> &Ссылка
	|	И CW_ПоказателиРасчетаРасходаТоплива.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор"	, Объект.Идентификатор);
	Запрос.УстановитьПараметр("Ссылка"			, Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		Отказ = истина;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Указанный идентификатор уже исползуется!";
			Сообщение.Поле = "Объект.Идентификатор";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрешеноСоздаватьПоказатели = ПолучитьФункциональнуюОпцию("CW_РазрешеноСоздаватьПоказателиДляРасчетаНормРасходаТоплива");
	
	Если Параметры.Ключ.Пустая() и НЕ РазрешеноСоздаватьПоказатели Тогда // форма нового

		Отказ = истина;
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "Создание собственных показателей запрещено настройками программы!";
		Сообщение.Сообщить();
		
	ИначеЕсли Параметры.Ключ.Пустая() и РазрешеноСоздаватьПоказатели Тогда // форма нового

		Объект.УказываетсяВНастройках = истина;
		
	КонецЕсли;
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти


