
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрКоманды", 	ПараметрКоманды); 
	ПараметрыФормы.Вставить("ВидСтатьи", 		0); 
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина); 
	
	ПолучитьВаринтВерсиюИзПараметра = Истина;
	
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.CW_Грузоперевозки.Форма.ФормаЭлемента" 
		или ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.CW_Заказы.Форма.ФормаЭлемента" Тогда

		ВерсияБюджета = ПараметрыВыполненияКоманды.Источник.БюджетТекущаяВерсия;
		ПараметрыФормы.Вставить("ВерсияБюджета", 	ВерсияБюджета); 
		
		ПолучитьВаринтВерсиюИзПараметра = Ложь;
	КонецЕсли;
		
	Если ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Справочник.CW_Заявки.Форма.ФормаЭлемента"  Тогда
		ВариантБюджета = ПараметрыВыполненияКоманды.Источник.Объект.ВариантБюджета;
		ПараметрыФормы.Вставить("ВариантБюджета", 	ВариантБюджета);     
		
		ПолучитьВаринтВерсиюИзПараметра = Ложь;
	КонецЕсли;
	
	Если ПолучитьВаринтВерсиюИзПараметра Тогда
		Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Заявки") Тогда
			ВариантБюджета = ПолучитьВариантБюджета(ПараметрКоманды);	
			ПараметрыФормы.Вставить("ВариантБюджета", 	ВариантБюджета);     
		КонецЕсли;
		Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			ВерсияБюджета = ПредопределенноеЗначение("Справочник.CW_ВерсииБюджетов.Основная");	
			ПараметрыФормы.Вставить("ВерсияБюджета", 	ВерсияБюджета);     
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		ПараметрыФормы.Вставить("ВариантГруппировки", 	"ГРУЗОПЕРЕВОЗКА");     
	КонецЕсли;
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Заказы") Тогда
		ПараметрыФормы.Вставить("ВариантГруппировки", 	"ЗАКАЗ");     
	КонецЕсли;
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Заявки") Тогда
		ПараметрыФормы.Вставить("ВариантГруппировки", 	"ЗАЯВКА");     
	КонецЕсли;

	ОткрытьФорму("Отчет.CW_АнализБюджета.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьВариантБюджета(ПараметрКоманды)
	
	 Возврат ПараметрКоманды.ВариантБюджета;
	 
КонецФункции
