Процедура ОбновитьИменаЯчееекРаздела(ПериодОтчета="") Экспорт
	
	Если ПериодОтчета = "" Тогда
		ПериодОтчета = "2023Кв4";  
	КонецЕсли;
	
	Если ПериодОтчета = "2023Кв4" Тогда
		ПриказСсылка = ПредопределенноеЗначение("ПланВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела.Отчет_2023Кв4_Раздел42");
		ПриказОбъект = ПриказСсылка.ПолучитьОбъект();
		ПриказОбъект.ДатаНачала = Дата(2023, 10, 1);
		ПриказОбъект.Записать();
		
		//2023Кв4
		ЗаполнитьЯчейки2023Кв4();
	КонецЕсли;
									   
									   
КонецПроцедуры    

Процедура ЗаполнитьЯчейки2023Кв4()
	
	ОписаниеЯчеек 	= ПолучитьОписанияЯчеек("ОписаниеЯчеек_2023Кв4_Раздел42"); 
	Родитель		= ПредопределенноеЗначение("ПланВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела.Отчет_2023Кв4_Раздел42");
	
	ЗаполнитьЯчейкиОтчета(ОписаниеЯчеек, Родитель);
	
КонецПроцедуры  

Процедура ЗаполнитьЯчейкиОтчета(Знач ОписаниеЯчеек, Знач Родитель)
	
	Для Каждого СтрокаОписания из ОписаниеЯчеек Цикл 
		
		НайденнаяСсылка = ПланыВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела.НайтиПоРеквизиту("ИмяЯчейки", СтрокаОписания.ИмяЯчейки, Родитель);  
		Если НайденнаяСсылка.Пустая() Тогда
			ОписаниеЯчейки = ПланыВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела.СоздатьЭлемент();  
		Иначе
			ОписаниеЯчейки = НайденнаяСсылка.ПолучитьОбъект();  
		КонецЕсли;
		
		ОписаниеЯчейки.Родитель		= Родитель;
		ОписаниеЯчейки.Наименование	= СтрокаОписания.Наименование;
		ОписаниеЯчейки.ИмяЯчейки	= СтрокаОписания.ИмяЯчейки;
		ОписаниеЯчейки.НомерСтроки	= СтрокаОписания.НомерСтроки;
		ОписаниеЯчейки.ТипЗначения	= СтрокаОписания.Тип;  
		ОписаниеЯчейки.КонтролироватьЗаполнение	= СтрокаОписания.КонтрольЗаполнения;
		ОписаниеЯчейки.Записать();
	КонецЦикла;

КонецПроцедуры 

Функция ПолучитьОписанияЯчеек(ИмяМакета)  
	
	ОписаниеЯчеек = Новый ТаблицаЗначений;
 	ОписаниеЯчеек.Колонки.Добавить("ИмяЯчейки", 	Новый ОписаниеТипов("Строка"));
	ОписаниеЯчеек.Колонки.Добавить("НомерСтроки", 	Новый ОписаниеТипов("Строка"));
	ОписаниеЯчеек.Колонки.Добавить("Тип");
	ОписаниеЯчеек.Колонки.Добавить("КонтрольЗаполнения",  Новый ОписаниеТипов("Булево"));
	ОписаниеЯчеек.Колонки.Добавить("Наименование",  Новый ОписаниеТипов("Строка"));
	
	Макет = ПланыВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела.ПолучитьМакет(ИмяМакета);
	
	ВысотаТаблицы = Макет.ВысотаТаблицы;
	
	//1 - ИмяЯчейки	
	//2 - НомерСтроки
	//3 - Тип	
	//4 - Контроль заполнения	   
	//5 - Наименование	   
	
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		НоваяСтрока = ОписаниеЯчеек.Добавить();
		
		НоваяСтрока.ИмяЯчейки			=  СокрЛП(Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
		НоваяСтрока.НомерСтроки			=  СокрЛП(Макет.Область(НомерСтроки, 2, НомерСтроки, 2).Текст);
		НоваяСтрока.КонтрольЗаполнения 	= (СокрЛП(Макет.Область(НомерСтроки, 4, НомерСтроки, 4).Текст) = "ДА");   
		НоваяСтрока.Наименование 		=  СокрЛП(Макет.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);   
		
		Тип = СокрЛП(Макет.Область(НомерСтроки, 3, НомерСтроки, 3).Текст);	
		Если Тип = "Строка" Тогда
			НоваяСтрока.Тип = Новый ОписаниеТипов(Тип);
		КонецЕсли;
		Если Тип = "Дата" Тогда
			НоваяСтрока.Тип = Новый ОписаниеТипов(Тип,,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата));
		КонецЕсли;
		Если Тип = "Число" Тогда
			НоваяСтрока.Тип = Новый ОписаниеТипов(Тип,,,Новый КвалификаторыЧисла(16,2));
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ОписаниеЯчеек;
	
КонецФункции
	



 