
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() 
		и Не Параметры.ЗначениеКопирования.Пустая() Тогда
		CW_КлючевыеПоказателиСервер.ЗаполнитьТаблицуОформления(ЭтаФорма, Параметры.ЗначениеКопирования);
	КонецЕсли;   
	
	CW_КлючевыеПоказателиСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
	
	КлючевойПараметр = 1000.00;
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.ГруппаПример, ТаблицаОформления.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	CW_КлючевыеПоказателиСервер.ЗаполнитьТаблицуОформления(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	CW_КлючевыеПоказателиСервер.ЗаписатьНастройкиОформления(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОформленияЗначениеПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.ТаблицаОформления.ТекущаяСтрока;
	ТаблицаОформленияЗначениеПриИзмененииНаСервере(ТекущаяСтрока);  
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаОформленияЗначениеПриИзмененииНаСервере(ТекущаяСтрока) 
	
	CW_КлючевыеПоказателиСервер.ТаблицаОформленияПриИзмененииЗначения(ЭтаФорма, ТекущаяСтрока);
	
КонецПроцедуры 


&НаКлиенте
Процедура ТаблицаОформленияПриИзменении(Элемент)
	ТаблицаОформленияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТаблицаОформленияПриИзмененииНаСервере()
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.ГруппаПример, ТаблицаОформления.Выгрузить());
КонецПроцедуры


  &НаКлиенте
Процедура ТаблицаОформленияВыборПриИзменении(Элемент)  
	
	ТекущаяСтрока = Элементы.ТаблицаОформления.ТекущаяСтрока;
	ТаблицаОформленияВыборПриИзмененииНаСервере(ТекущаяСтрока); 
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаОформленияВыборПриИзмененииНаСервере(ТекущаяСтрока)  
	
	CW_КлючевыеПоказателиСервер.ТаблицаОформленияПриИзмененииФлага(ЭтаФорма, ТекущаяСтрока); 
	
КонецПроцедуры

 
&НаКлиенте
Процедура ТаблицаОформленияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаОформления.ТекущиеДанные;
	Если CW_КлючевыеПоказателиКлиент.НуженДиалогРедактированияОформления(ТекущиеДанные.Параметр) тогда
		СтандартнаяОбработка = Ложь;                                    
		
		ТекущаяСтрока = Элементы.ТаблицаОформления.ТекущаяСтрока;
		
		ДополнительныеПараметры = Новый Структура;                      
		ДополнительныеПараметры.Вставить("ТекущаяСтрока",ТекущаяСтрока); 
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЗначения",ЭтотОбъект, ДополнительныеПараметры);
		
		CW_КлючевыеПоказателиКлиент.ОткрытьДиалогРедактированияОформления(ТекущиеДанные.Параметр, ТекущиеДанные.Значение, Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗначения(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыборЗначенияНаСервере(ВыбранноеЗначение, ДополнительныеПараметры.ТекущаяСтрока);
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьВыборЗначенияНаСервере(Значение, ТекущаяСтрока)  
	
	СтрокаТекущая = ТаблицаОформления.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаТекущая.Значение = Значение;
	
	CW_КлючевыеПоказателиСервер.ТаблицаОформленияПриИзмененииЗначения(ЭтаФорма, ТекущаяСтрока);
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.ГруппаПример, ТаблицаОформления.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("CW_НастройкиКлючевыхПоказателей_Запись");

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьНастройкиОформления(Команда)  
	
	Отбор = Новый Структура;
  	Отбор.Вставить("Владелец", 	Объект.Владелец); 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", Отбор);   
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИсточникаНастроек", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_НастройкиКлючевыхПоказателей.ФормаВыбораГруппы", СтруктураПараметров, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораИсточникаНастроек(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СкопироватьНастройкиОформленияНаСервере(РезультатВыбора);	
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНастройкиОформленияНаСервере(ИсточникНастроек)
	
	CW_КлючевыеПоказателиСервер.ЗаполнитьТаблицуОформления(ЭтаФорма, ИсточникНастроек);
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.ГруппаПример, ТаблицаОформления.Выгрузить());
	
КонецПроцедуры
