
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Наименование", 	Наименование);
	Параметры.Свойство("Раскрывать",	Раскрывать);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено наименование группы",,"Наименование",,Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		ПараметрыЗакрытия = новый Структура;
		ПараметрыЗакрытия.Вставить("Наименование", 	Наименование);
		ПараметрыЗакрытия.Вставить("Раскрывать", 	Раскрывать);
		
		ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры
