Функция ПолучитьЗначениеПараметра(Заказ, Параметр) Экспорт
	
	СтруктураЗначения = Новый Структура("Значение,ЗначениеПлан,ЗначениеФакт", Неопределено, Неопределено, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ХарактеристикиЗаказов.Заказ КАК Заказ,
	               |	CW_ХарактеристикиЗаказов.Параметр КАК Параметр,
	               |	CW_ХарактеристикиЗаказов.Значение КАК Значение,
	               |	CW_ХарактеристикиЗаказов.ЗначениеПлан КАК ЗначениеПлан,
	               |	CW_ХарактеристикиЗаказов.ЗначениеФакт КАК ЗначениеФакт
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
	               |ГДЕ
	               |	CW_ХарактеристикиЗаказов.Параметр = &Параметр
	               |	И CW_ХарактеристикиЗаказов.Заказ = &Заказ"; 
	
	Запрос.УстановитьПараметр("Заказ", 		Заказ);
	Запрос.УстановитьПараметр("Параметр",	Параметр); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураЗначения,Выборка);
	КонецЕсли;
	
	Возврат СтруктураЗначения;
	
КонецФункции  

Функция ПолучитьЗначенияПараметраОбъектов(МассивОбъектов, Параметр) Экспорт
	
	СоответствиеЗначений = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ХарактеристикиЗаказов.Заказ КАК Заказ,
	               |	CW_ХарактеристикиЗаказов.Параметр КАК Параметр,
	               |	CW_ХарактеристикиЗаказов.Значение КАК Значение,
	               |	CW_ХарактеристикиЗаказов.ЗначениеПлан КАК ЗначениеПлан,
	               |	CW_ХарактеристикиЗаказов.ЗначениеФакт КАК ЗначениеФакт,
	               |	CW_ХарактеристикиЗаказов.ЗначениеФакт КАК ХранилищеДанных
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
	               |ГДЕ
	               |	CW_ХарактеристикиЗаказов.Параметр = &Параметр
	               |	И CW_ХарактеристикиЗаказов.Заказ В(&МассивОбъектов)"; 
	
	Запрос.УстановитьПараметр("МассивОбъектов", 	МассивОбъектов);
	Запрос.УстановитьПараметр("Параметр", 			Параметр); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл    
		
		СтруктураЗначения = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
		СтруктураЗначения.Значение 			= Выборка.Значение;
		СтруктураЗначения.ЗначениеПлан 		= Выборка.ЗначениеПлан;
		СтруктураЗначения.ЗначениеФакт 		= Выборка.ЗначениеФакт;  
		
		Если Параметр.СохранятьПолноеЗначениеПараметра Тогда
			СтруктураЗначения.ПолноеЗначение =  Выборка.ХранилищеДанных.Получить();
		КонецЕсли;
	
		СоответствиеЗначений.Вставить(Выборка.Грузоперевозка, СтруктураЗначения); 
	КонецЦикла;
	
	Возврат СоответствиеЗначений;
	
КонецФункции
	
