#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиЗаполнениеБюджета();
	                                                                         
	СтруктураОписания.Наименование 				= "Заполнение бюджета на основании проекта ДТ";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	СтруктураОписания.Настройка					= Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьФормыВнешнегоОбъекта(СтруктураОписания,		"ФормаНастроекЗаполнения","ФормаНастроекЗаполнения");  
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыНастроекОбъекта(СтруктураОписания,	"ФормаНастройки");  
	
	Возврат СтруктураОписания;

КонецФункции

//Функция ЗаполнитьБюджет(СП) Экспорт
//	
//	
//КонецФункции	

#КонецЕсли