&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "НаличиеФайлов" Тогда
		СтандартнаяОбработка = Ложь;
		_УФК.ОткрытьСписокФайловОбъекта(ЭтаФорма, ВыбраннаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

//Отбор по списку номеров
&НаКлиенте
Процедура ПродолжитьОтобрПоСпискуНомеров(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	Конецесли;
	
	УстановитьОтборСписка(РезультатВыбора);

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписка(РезультатВыбора)  
	
	СписокОтбора = Новый СписокЗначений;
	СписокОтбора.ЗагрузитьЗначения(РезультатВыбора.МассивНомеров); 
	
	ИмяполяКомпоновки = РезультатВыбора.ИмяРеквизита; 
	
	ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	Если ТипЗнч(ПользовательскийОтбор) = Тип("ОтборКомпоновкиДанных") Тогда 
		ЭлементПользовательскогоОтбора =  ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементПользовательскогоОтбора.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных(ИмяполяКомпоновки);    
		ЭлементПользовательскогоОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;    
		ЭлементПользовательскогоОтбора.ПравоеЗначение	= СписокОтбора;    
		ЭлементПользовательскогоОтбора.Использование	= Истина;    
		ЭлементПользовательскогоОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор();
		ЭлементПользовательскогоОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры  
//Отбор по списку номеров

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти