
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.ОтображениеКнопокКоманднойПанелиФормыСписка(ЭтаФорма);
	// ---------------------------------------------------------------------------- 
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеНастроекБюджетов");
	Если НЕ ПравоРедактирования Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.Список.ТолькоПросмотр = Истина;
		Элементы.Список.ИзменятьСоставСтрок = Ложь;
		
	КонецЕсли;
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти