#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 					= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 				= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 				= CW_ПодключаемыеКомандыСервер.ВидОбработкиОбработкаИзмененияПараметров();
	
	СтруктураОписания.Наименование 				= "Пример подключаемой обработки изменения параметров";
	СтруктураОписания.Описание 					= "Пример подключаемой обработки изменения параметров";
	СтруктураОписания.Версия					= "3.2.2.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.12.2";
	
	СтруктураОписания.Настройка 				= Истина;
	СтруктураОписания.ИсторияИзменений			= Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыНастроекОбъекта(СтруктураОписания, "ФормаНастроек");

	Возврат СтруктураОписания;
	
КонецФункции
  
// УСТАРЕЛА - Следует использовать функцию "ВыполнитьОбработкуИзмененияПараметра"
//
// Параметры:
//  Объект			 - 	 изменяемцый объект, типы: "СправочникОбъект.CW_Заказы", "СправочникОбъект.CW_Заявки", "СправочникОбъект.CW_Грузоперевозки"; 
//  ЭтаФорма		 - 	 форма изменяемого объекта, тип: "ФормаКлиентскогоПриложения";
//  СтрокаПараметра	 - 	 строка таблицы параметров изменяемтого объекта 
// 
// Возвращаемое значение:
//   - Структура
//	    Свойства:
//		 - Код 				 	- 	код возврата, тип "Число", 0- успешено, 1 - ошибка;
//		 - ОписаниеОшибки    	- 	описаниеошибки, тип "Строка". Заполнется если Код = 1;
//		 - ТаблицаПараметров 	-  	табилица изменяемых парамтеров объекта, тип "ТаблицаЗначений", 
//									состав и типизацию колонок см. в зависимости от изменяемого объекта: 
//									Справочники.CW_Грузоперевозки.ПараметрыГрузоперевозки, 
//									Справочники.CW_Заказы.ПараметрыГрузоперевозки, 
//									Справочники.CW_Заказы.CW_Заявки 
//		 - СтруктураРеквизитов	- 	Струкрута со значениями изменяемых реквизтов объекта, где "Ключ" - Имя реквизита, "Значение" - новое значение реквизита;
//	
Функция ОбработкаИзмененияПараметра(Объект,ЭтаФорма,СтрокаПараметра) Экспорт
	
	// здесь нужно описать код обработчика
	Сообщить("Параметр изменен");
	
	Возврат Новый Структура("Код, ОписаниеОшибки", 0,"");
	
	
КонецФункции

// Функция - Выполнить обработку изменения параметра
//
// Параметры:
//  ПараметрыПроцедуры	 - 	
//	   Структура:
//		Свойства:
//			- ВнешняяОбработка 	- ссылка на подключаемый объект, тип: "СправочникСсылка.CW_ПодключаемыеОбъекты";
//			- Объект 			- изменяемцый объект, типы: "СправочникОбъект.CW_Заказы", "СправочникОбъект.CW_Заявки", "СправочникОбъект.CW_Грузоперевозки";
//			- Форма 			- форма изменяемого объекта, тип: "ФормаКлиентскогоПриложения";
//			- СтрокаПараметра 	- строка таблицы параметров изменяемтого объекта.
// 
// Возвращаемое значение:
//   - Структура
//	    Свойства:
//		 - Код 				 	- 	код возврата, тип "Число", 0- успешено, 1 - ошибка;
//		 - ОписаниеОшибки    	- 	описаниеошибки, тип "Строка". Заполнется если Код = 1;
//		 - ТаблицаПараметров 	-  	табилица изменяемых парамтеров объекта, тип "ТаблицаЗначений", 
//									состав и типизацию колонок см. в зависимости от изменяемого объекта: 
//									Справочники.CW_Грузоперевозки.ПараметрыГрузоперевозки, 
//									Справочники.CW_Заказы.ПараметрыГрузоперевозки, 
//									Справочники.CW_Заказы.CW_Заявки 
//		 - СтруктураРеквизитов	- 	Струкрута со значениями изменяемых реквизтов объекта, где "Ключ" - Имя реквизита, "Значение" - новое значение реквизита;
//	
Функция ВыполнитьОбработкуИзмененияПараметра(ПараметрыПроцедуры) Экспорт
	
	//Получение настроек объекта
	СтруктураНастроек = _ПО.ПолучитьНастройкиОбработки(ПараметрыПроцедуры.ВнешняяОбработка);
	Если СтруктураНастроек <> Неопределено Тогда
		
		
	КонецЕсли;


	Возврат Новый Структура("Код, ОписаниеОшибки", 0,"");
	
КонецФункции

#КонецЕсли