Процедура ДобавитьЗаписьВедомыеДокументы(Знач ИзмеренияРегистра) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.CW_СчетаФактурыНалоговыхАгентов.СоздатьМенеджерЗаписи();  
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ИзмеренияРегистра);
	ЗаписьРегистра.Прочитать();
	
	Если Не ЗаписьРегистра.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, ИзмеренияРегистра);
		ЗаписьРегистра.Записать(Истина);	
	КонецЕсли;
	
КонецПроцедуры      

Функция ПолучитьРеквизитыСчетФактуры(ВедущийДокумент, Контрагент, ДоговорКонтрагента) Экспорт  
	
    РеквизитыСчетФактуры = Новый Структура("НомерСчетаФактурыПродавца,ДатаСчетаФактурыПродавца,СчетФактура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	CW_СчетаФактурыНалоговыхАгентов.СчетФактура КАК СчетФактура,
	|	CW_СчетаФактурыНалоговыхАгентов.СчетФактура.Номер КАК НомерСчетаФактурыПродавца,
	|	CW_СчетаФактурыНалоговыхАгентов.СчетФактура.Дата КАК ДатаСчетаФактурыПродавца
	|ИЗ
	|	РегистрСведений.CW_СчетаФактурыНалоговыхАгентов КАК CW_СчетаФактурыНалоговыхАгентов
	|ГДЕ
	|	CW_СчетаФактурыНалоговыхАгентов.ВедущийДокумент = &ВедущийДокумент
	|	И CW_СчетаФактурыНалоговыхАгентов.Контрагент = &Контрагент
	|	И CW_СчетаФактурыНалоговыхАгентов.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ВедущийДокумент", 		ВедущийДокумент);
	Запрос.УстановитьПараметр("Контрагент", 			Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", 	ДоговорКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыСчетФактуры, Выборка);
	КонецЕсли;  
	
	Возврат РеквизитыСчетФактуры;

КонецФункции  

Процедура ОбработатьЗаписиРегистра() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СчетаФактурыНалоговыхАгентов.ВедущийДокумент КАК ВедущийДокумент,
	|	CW_СчетаФактурыНалоговыхАгентов.СчетФактура.Контрагент КАК Контрагент,
	|	CW_СчетаФактурыНалоговыхАгентов.СчетФактура.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	CW_СчетаФактурыНалоговыхАгентов.СчетФактура КАК СчетФактура
	|ИЗ
	|	РегистрСведений.CW_СчетаФактурыНалоговыхАгентов КАК CW_СчетаФактурыНалоговыхАгентов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Набор = РегистрыСведений.CW_СчетаФактурыНалоговыхАгентов.СоздатьНаборЗаписей();
	Набор.Загрузить(РезультатЗапроса.Выгрузить());
	Набор.Записать(Истина);
	
КонецПроцедуры