
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РежимОбщегоСписка = (Параметры.Отбор.Количество()=0);
	Элементы.ВидСубъектаОтбор.Видимость = РежимОбщегоСписка;
	
	Параметры.Отбор.Свойство("ВидСубъекта",ВидСубъекта);
	
	Если (НЕ РежимОбщегоСписка) Тогда
		
		Список.Группировка.Элементы.Очистить();
		Элементы.Субъект.Видимость = Ложь;
		// --- 
		ЭтаФорма.Заголовок = "Предопределённые параметры для """+Строка(Параметры.Отбор.Субъект)+"""";
		
	Иначе
		
		ЭтаФорма.Заголовок = "Предопределённые параметры";
		
	КонецЕсли; 
	
	Если (ВидСубъекта.Пустая()) Тогда
		ВидСубъекта=Перечисления.CW_ВидыСубъектовСвязанныхПараметров.Клиент;
	КонецЕсли; 
	
	Параметры.Отбор.Свойство("ДляГрузоперевозок", ДляГрузоперевозок);
	Параметры.Отбор.Свойство("ДляЗаявок",ДляЗаявок );	
	
	УстановитьЗаголовокПоля();
	УстановитьОтборДинамискогоСписка() ;
	
	// --- 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура УстановитьОтборДинамискогоСписка()

	Список.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
	
	ЭлементОтбора.Использование 	= Истина;
	
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ВидСубъекта");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ВидСубъекта; 
	
	Если ДляГрузоперевозок Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		
		ЭлементОтбора.Использование 	= Истина;
		
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДляГрузоперевозок");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Истина; 
	КонецЕсли;
	
	Если ДляЗаявок Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		
		ЭлементОтбора.Использование 	= Истина;
		
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДляЗаявок");
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение 	= Истина; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидСубъектаОтборПриИзмененииНаСервере()
	
	УстановитьОтборДинамискогоСписка();
	УстановитьЗаголовокПоля();
	
КонецПроцедуры


&НаКлиенте
Процедура ВидСубъектаОтборПриИзменении(Элемент)
	
	ВидСубъектаОтборПриИзмененииНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокПоля()
	
	Элементы.Субъект.Заголовок = Строка(ВидСубъекта);
	
КонецПроцедуры
 
