#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция - Контрагент входит в холдинг
//
//	Определяет входит-ли переданный контрагент в холдинг
//
// Возвращаемое значение:
//   - Истина/Ложь
//
Функция КонтрагентВходитВХолдинг(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоответствиеОрганизацийКонтрагентам.Организация КАК Организация
	               |ИЗ
	               |	РегистрСведений.CW_СоответствиеОрганизацийКонтрагентам КАК CW_СоответствиеОрганизацийКонтрагентам
	               |ГДЕ
	               |	CW_СоответствиеОрганизацийКонтрагентам.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();	
	
КонецФункции

Функция ПолучитьКонтрагентаОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СоответствиеОрганизацийКонтрагентам.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.CW_СоответствиеОрганизацийКонтрагентам КАК CW_СоответствиеОрганизацийКонтрагентам
	               |ГДЕ
	               |	CW_СоответствиеОрганизацийКонтрагентам.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Контрагент;
	КонецЕсли;
	
КонецФункции


#КонецЕсли