
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Функция СделкиДоговораДляРоялти(УведомлениеОКонтролируемойСделке, Организация, Контрагент, ДоговорКонтрагента) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Уведомление", УведомлениеОКонтролируемойСделке);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтролируемыеСделкиОрганизаций.Период КАК ДатаСовершенияСделки,
	|	КонтролируемыеСделкиОрганизаций.ПредметСделки КАК ПредметСделки,
	|	КонтролируемыеСделкиОрганизаций.НаименованиеПредметаСделки КАК НаименованиеПредметаСделки,
	|	КонтролируемыеСделкиОрганизаций.РасчетныйДокумент КАК РасчетныйДокумент,
	|	СУММА(КонтролируемыеСделкиОрганизаций.СуммаБезНДСВРублях + КонтролируемыеСделкиОрганизаций.СуммаНДСВРублях) КАК Сумма,
	|	СУММА(КонтролируемыеСделкиОрганизаций.СуммаБезНДСВВалютеРасчетов + КонтролируемыеСделкиОрганизаций.СуммаНДСВВалютеРасчетов) КАК ВалютнаяСумма
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|ГДЕ
	|	КонтролируемыеСделкиОрганизаций.Уведомление = &Уведомление
	|	И КонтролируемыеСделкиОрганизаций.Организация = &Организация
	|	И КонтролируемыеСделкиОрганизаций.Контрагент = &Контрагент
	|	И КонтролируемыеСделкиОрганизаций.ДоговорКонтрагента = &ДоговорКонтрагента
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделкиОрганизаций.Период,
	|	КонтролируемыеСделкиОрганизаций.ПредметСделки,
	|	КонтролируемыеСделкиОрганизаций.НаименованиеПредметаСделки,
	|	КонтролируемыеСделкиОрганизаций.РасчетныйДокумент";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
