&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Наименование", 		Наименование);
	Параметры.Свойство("Комментарий",  		Комментарий); 
	
	НаименованиеСтарое = Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Ответ = Новый Структура;
	Ответ.Вставить("Наименование", 			Наименование);
	Ответ.Вставить("Комментарий", 			Комментарий);
	Ответ.Вставить("НаименованиеСтарое",	НаименованиеСтарое);
	
	ЭтаФорма.Закрыть(Ответ);
	
КонецПроцедуры

