#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Счёт корректировочный";
	СтруктураОписания.Описание 					= "Печатная форма корректировочного счета на оплату, внешний вид которого можно изменить (частично) параметрами договора с контрагентом.";
	
	СтруктураОписания.Версия					= "3.2.9.3";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.17.2";
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерИсправления]", 			"Номер исправлния", 			"ПолучитьНомерИсправления(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления
	
	Возврат СтруктураОписания;
	
КонецФункции

Процедура Регистрация(Ссылка) Экспорт
	
	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_ДоходыПоГрузоперевозке");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "Счёт (корректировочный)"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		

	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);

КонецПроцедуры

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	Возврат СсылкаНаОбъект.Корректировка И СсылкаНаОбъект.ФормируетсяСчет 
			ИЛИ (СсылкаНаОбъект.ФормируетсяАкт И ЗначениеЗаполнено(СсылкаНаОбъект.Счет) И СсылкаНаОбъект.Счет.Корректировка);
	
КонецФункции

Функция ИспользованиеВКонтексте(КонтекстВызова) Экспорт 
	
	Возврат	ТипЗнч(КонтекстВызова) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора")
	И СсылкаНаОбъект.ФормируетсяСчет И СсылкаНаОбъект.Корректировка;
	
КонецФункции

//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьНомерИсправления(ПараметрыПроцедуры) Экспорт
	
	НомерИсправления  = ?(ЗначениеЗаполнено(ПараметрыПроцедуры.НомерИсправления), " (испр. "+Формат(ПараметрыПроцедуры.НомерИсправления,"ЧГ=0")+")","");
	Возврат СокрЛП(НомерИсправления);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления

Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт
	
	Если НастройкиПечати=Неопределено Тогда
		НастройкиПечати = Новый Структура;
	КонецЕсли; 
	
	Если (НЕ СсылкаНаОбъект.ФормируетсяСчет И СсылкаНаОбъект.ФормируетсяАкт И ЗначениеЗаполнено(СсылкаНаОбъект.Счет)) Тогда
		Ссылка = СсылкаНаОбъект.Счет;
	Иначе
		Ссылка = СсылкаНаОбъект;
	КонецЕсли; 

	БазоваяВалюта = CW_Настройки.ВалютаРегламентированногоУчета();
	
	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();

	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхСчета", Истина);
	Если КоличествоЭксземпляров <> Неопределено Тогда 
		РезультатПечати.Параметры.Количество = КоличествоЭксземпляров;
		РезультатПечати.Параметры.Печать 	 = (КоличествоЭксземпляров <> 0);  
	Иначе
		РезультатПечати.Параметры.Количество = 2;
		РезультатПечати.Параметры.Печать 	 = Истина;  
	КонецЕсли;  
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				СсылкаНаОбъект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		СсылкаНаОбъект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, СсылкаНаОбъект.Дата);
	
	// ---------------------------------------------------------------------------- 
	// формируем представление
	НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка, "НомерСчета", "ДатаСчета");
	ДатаДокумента = Ссылка.ДатаСчета;
	
	Если Ссылка.ВидОперацииКорректировки = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение")Тогда
		ПредставлениеДокумента     = "Корректировочный счет №"    + НомерДокумента+" от "  + Формат(ДатаДокумента,"ДФ=dd.MM.yyyy");
		ПредставлениеДокументаАнгл = "CORRECTION INVOICE №" + НомерДокумента+" of  " + Формат(ДатаДокумента,"ДФ=dd.MM.yyyy");
	Иначе
		ПредставлениеДокумента     = "Исправительный счет №"    + НомерДокумента+" от "  + Формат(ДатаДокумента,"ДФ=dd.MM.yyyy");
		ПредставлениеДокументаАнгл = "CORRECTION INVOICE №" + НомерДокумента+" of  " + Формат(ДатаДокумента,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	// --- 
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(ПредставлениеДокумента));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НомерДокумента",	НомерДокумента);
	ПараметрыПроцедуры.Вставить("ДатаДокумента",	ДатаДокумента);
	ПараметрыПроцедуры.Вставить("НомерИсправления",	СсылкаНаОбъект.НомерИсправления);
	
	РезультатПечати.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_УчетнаяПолитикаСрезПоследних.Логотип КАК Логотип,
	               |	CW_УчетнаяПолитикаСрезПоследних.ВыводитьЛоготипВПечатнуюФормуСчета КАК ВыводитьЛоготип
	               |ИЗ
	               |	РегистрСведений.CW_УчетнаяПолитика.СрезПоследних(&Дата, Организация = &Организация) КАК CW_УчетнаяПолитикаСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", 	Ссылка.Организация);
	Запрос.УстановитьПараметр("Дата", 			Ссылка.Дата);
	
	РезультатУчетнаяПолитика = Запрос.Выполнить();
	ВыводитьЛоготип = ложь;	
	ВыборкаУчетнаяПолитика= РезультатУчетнаяПолитика.Выбрать();
	Если ВыборкаУчетнаяПолитика.Следующий() Тогда
		ДвоичныеДанныеЛоготип 	= ВыборкаУчетнаяПолитика.Логотип.Получить();
		ВыводитьЛоготип = ВыборкаУчетнаяПолитика.ВыводитьЛоготип;
	КонецЕсли;   
	
	ДвоичныеДанныеПечать = CW_Печать.ПолучитьПечатьОрганизации(Ссылка.Организация,,Ссылка.Дата, Ложь);
	
	// ---------------------------------------------------------------------------- 
	// формируем печатную форму
	
	ТД=Новый ТабличныйДокумент;
	ТД.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТД.АвтоМасштаб=Истина;
	
	//	Попытка
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= ДатаДокумента;
	СтруктураПараметров.Договор 			= Ссылка.Договор;
	СтруктураПараметров.ПриложениеКДоговору = Ссылка.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
	
	ПараметрыУчетнойПолитики = CW_Настройки.ПараметрыУчетнойПолитики(Ссылка.Дата, Ссылка.Организация);
	Макет = ПолучитьМакет("МакетСчет");
	
	//СведенияООрганзации  			= CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Ссылка.Организация, Ссылка.ВедомыйДокумент.Дата);
	//ОрганизацияНаименованиеПолное = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияООрганзации, "ПолноеНаименование,");
	//ОрганизацияНаименованиеСокращенное = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияООрганзации, "СокращенноеНаименование,");
	
	НаименованияОрганиазции = Справочники.Организации.НаименованияНаДату(Ссылка.Организация, ДатаДокумента);
	КПП_Организации 		= Справочники.Организации.КППНаДату(Ссылка.Организация, ДатаДокумента);
	
	НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(Ссылка.Контрагент, ДатаДокумента);
	
	// ---------------------------------------------------------------------------- 
	// язык печати документов : 0=русский 1=английский 2=двуязычный
	// ---------------------------------------------------------------------------- 
	
	ПолучитьРусский 	= ПараметрыДоговора.ЯзыкПечатиДокументов = 0 ИЛИ ПараметрыДоговора.ЯзыкПечатиДокументов = 2;
	ПолучитьАнглийский 	= ПараметрыДоговора.ЯзыкПечатиДокументов = 1 ИЛИ ПараметрыДоговора.ЯзыкПечатиДокументов = 2;
	
	//--------
	// шапка
	Если ВыводитьЛоготип Тогда
		обл = Макет.ПолучитьОбласть("ШапкаЛоготип");   
		РисунокЛоготип = обл.Рисунки.Логотип;
		РисунокЛоготип.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
		РисунокЛоготип.ВыводитьНаПечать = Истина;
		Если ДвоичныеДанныеЛоготип <> Неопределено Тогда
			Если ТипЗнч(ДвоичныеДанныеЛоготип)=Тип("ДвоичныеДанные") Тогда
				РисунокЛоготип.Картинка = Новый Картинка(ДвоичныеДанныеЛоготип);
			Иначе
				РисунокЛоготип.ВыводитьНаПечать = Ложь;
			КонецЕсли; 
		КонецЕсли;
	Иначе
		обл = Макет.ПолучитьОбласть("Шапка");   
	КонецЕсли;

	Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
		стр = ПараметрыУчетнойПолитики.НаименованиеОрганизацииАнгл+Символы.ПС+ПараметрыДоговора.АдресОрганизацииАнгл;
	ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
		стр = НаименованияОрганиазции.НаименованиеДляПечатныхФорм
		+Символы.ПС
		+ПараметрыДоговора.АдресОрганизации+", тел.: "+ПараметрыДоговора.ТелефонОрганизации
		+ Символы.ПС
		+ ПараметрыУчетнойПолитики.НаименованиеОрганизацииАнгл
		+Символы.ПС
		+ПараметрыДоговора.АдресОрганизацииАнгл;
	Иначе 
		стр = НаименованияОрганиазции.НаименованиеДляПечатныхФорм
		+Символы.ПС
		+ПараметрыДоговора.АдресОрганизации+", тел.: "+ПараметрыДоговора.ТелефонОрганизации;
	КонецЕсли;
	обл.Параметры.ТекстШапки = стр;
	ТД.Вывести(обл);
	
	//--------
	// образец заполнения
	Если ПараметрыДоговора.ЯзыкПечатиДокументов = 0 Тогда//Если (Ссылка.Валюта=БазоваяВалюта ИЛИ Ссылка.Договор.ВзаиморасчетыВУЕ) Тогда 
		
		// только русский вариант
		обл = Макет.ПолучитьОбласть("ОбразецЗаполненияРус");
		обл.Параметры.ИНН = "ИНН "+Ссылка.Организация.ИНН;  
		обл.Параметры.КПП = "КПП "+КПП_Организации;
		Если (ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизации.ТекстКорреспондента)) Тогда
			обл.Параметры.Получатель = "Получатель"+Символы.ПС+ПараметрыДоговора.РасчетныйСчетОрганизации.ТекстКорреспондента;
		Иначе
			обл.Параметры.Получатель = "Получатель"+Символы.ПС+НаименованияОрганиазции.ПолноеНаименование;
		КонецЕсли; 
		обл.Параметры.БанкПолучателя = "Банк получателя"+Символы.ПС+ ПараметрыДоговора.РасчетныйСчетОрганизации.Банк+" "+ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.Город;
		обл.Параметры.НомерСчета = ПараметрыДоговора.РасчетныйСчетОрганизации.НомерСчета;
		обл.Параметры.БикБанкаПолучателя =ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.Код;
		обл.Параметры.НомерСчетаБанкаПолучателя = ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.КоррСчет;
		обл.Параметры.Заполнить(Новый Структура("Валюта", Ссылка.Валюта));
		ТД.Вывести(обл);
		
	Иначе 
		
		СуффиксОбластей = ?(ПараметрыДоговора.ЯзыкПечатиДокументов=1,"_Англ","_Двуязычный");
		// --- 
		обл_Верх = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Верх"+СуффиксОбластей);
		обл_Посредник = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Посредник"+СуффиксОбластей);
		обл_Корреспондент = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Корреспондент"+СуффиксОбластей);
		обл_Получатель = Макет.ПолучитьОбласть("ОбразецЗаполненияИностр_Получатель"+СуффиксОбластей);
		
		обл_Верх.Параметры.Заполнить(Новый Структура("Валюта", Ссылка.Валюта));
		ТД.Вывести(обл_Верх);
		
		Если ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.БанкПосредникБанкаКорреспондента) Тогда 
			банк = ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.БанкПосредникБанкаКорреспондента;
			обл_Посредник.Параметры.БанкПосредникБанкаКорреспондента = 
			банк.Наименование
			+", "+банк.АдресАнгл
			+Символы.ПС+"SWIFT: "+банк.SWIFT;
			ТД.Вывести(обл_Посредник);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.БанкКорреспондент) Тогда 
			банк = ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.БанкКорреспондент;
			обл_Корреспондент.Параметры.БанкКорреспондент = 
			банк.Наименование
			+", "+банк.АдресАнгл
			+Символы.ПС+"SWIFT: "+банк.SWIFT;
			ТД.Вывести(обл_Корреспондент);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.Банк) Тогда 
			банк = ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.Банк;
			обл_Получатель.Параметры.БанкПолучателя = 
			банк.Наименование
			+", "+банк.АдресАнгл
			+Символы.ПС+"SWIFT: "+банк.SWIFT
			+?(ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.КоррСчет),Символы.ПС+"Acc. "+ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.КоррСчет,"");
		КонецЕсли;
		обл_Получатель.Параметры.Получатель = 
		"Acc. "+ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.НомерСчета
		+ ?(ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.IBAN),Символы.ПС+"IBAN "+ПараметрыДоговора.РасчетныйСчетОрганизацииИностранный.IBAN,"")
		+ Символы.ПС + ПараметрыУчетнойПолитики.НаименованиеОрганизацииАнгл
		+ ", " + ПараметрыДоговора.АдресОрганизацииАнгл;
		ТД.Вывести(обл_Получатель);
		
	КонецЕсли;
	
	//--------
	// верхняя часть
	обл = Макет.ПолучитьОбласть("ВерхняяЧасть");
	Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
		
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокументаАнгл;
		ТД.Вывести(обл);
		
	ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
		
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокумента + Символы.ПС + ПредставлениеДокументаАнгл;
		ТД.Вывести(обл);
		
	Иначе 
		
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокумента;
		ТД.Вывести(обл);
		
	КонецЕсли;
	
	//Покупатель_Дополнительно
	Если ПолучитьРусский Тогда
		КПП = Справочники.Контрагенты.КППНаДату(Ссылка.Контрагент, Ссылка.Дата); 
		
		обл = Макет.ПолучитьОбласть("Покупатель_Рус");
		обл.Параметры.Покупатель_Рус	= "Покупатель: "+НаименованияКонтрагента.ПолноеНаименование 
			+ ?(ЗначениеЗаполнено(Ссылка.Контрагент.ИНН),", ИНН "+ Ссылка.Контрагент.ИНН, "")
			+ ?(ЗначениеЗаполнено(КПП),", КПП "+ КПП, "")
			+", "+ПараметрыДоговора.Адрес + ?(ЗначениеЗаполнено(ПараметрыДоговора.Телефон), ", тел.: "+ ПараметрыДоговора.Телефон, "");

			ТД.Вывести(обл);
		
		Если ПараметрыДоговора.ВыводитьДополнениевШапкуСчета Тогда
			обл = Макет.ПолучитьОбласть("Дополнительно_Рус");
			обл.Параметры.Дополнительно_Рус = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеСчета, Ссылка, Неопределено, Ссылка.Услуги);
			ТД.Вывести(обл);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПолучитьРусский и ПолучитьАнглийский Тогда
		обл = Макет.ПолучитьОбласть("Отступ");
		ТД.Вывести(обл);
	КонецЕсли;
	
	Если ПолучитьАнглийский Тогда
		обл = Макет.ПолучитьОбласть("Покупатель_Англ");
		обл.Параметры.Покупатель_Англ = "Customer: "+ПараметрыДоговора.НаименованиеКонтрагентаАнгл+", "+ПараметрыДоговора.АдресАнгл;
		ТД.Вывести(обл);
		
		Если ПараметрыДоговора.ВыводитьДополнениевШапкуСчета Тогда
			обл = Макет.ПолучитьОбласть("Дополнительно_Англ");
			обл.Параметры.Дополнительно_Англ = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеСчетаАнгл, Ссылка, Неопределено, Ссылка.Услуги);
			ТД.Вывести(обл);
		КонецЕсли;
		
	КонецЕсли;
	//Покупатель_Дополнительно
	
	облОтступ = Макет.ПолучитьОбласть("Отступ");
	ТД.Вывести(облОтступ);
	
	
	//--------
	//  шапка таблицы, строки таблицы, подвал таблицы
	Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
		облСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыБезНДС");
		облПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицыБезНДС");
	Иначе	
		облСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		облПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	КонецЕсли;	
	Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
		Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_АнглБезНДС");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "TOTAL:";
			облПодвалТаблицы.Параметры.НадписьНДС = "INCLUDING VAT:";
		Иначе	
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Англ");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "TOTAL:";
			стрбезНДС = "Without VAT";
		КонецЕсли;	
	ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
		Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_ДвуязБезНДС");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "ИТОГО / TOTAL:";
			облПодвалТаблицы.Параметры.НадписьНДС = "В т.ч. НДС / INCLUDING VAT:";
		Иначе	
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Двуяз");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "ИТОГО / TOTAL:";
			стрбезНДС = "БЕЗ НДС / Without VAT";
		КонецЕсли;				
	Иначе 
		Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_РусБезНДС");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "ИТОГО:";
			облПодвалТаблицы.Параметры.НадписьНДС = "В т.ч. НДС:";
		Иначе	
			облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Рус");
			облПодвалТаблицы.Параметры.НадписьИТОГО = "ИТОГО:";
			стрбезНДС = "БЕЗ НДС";
		КонецЕсли;	
	КонецЕсли;
	ПредставлениеВалютыРус = CW_Настройки_ПИ.ПредставлениеВалютыНаРусском(Ссылка.Валюта);
	
	облШапкаТаблицы.Параметры.Заполнить(Новый Структура("Валюта", Ссылка.Валюта));
	облШапкаТаблицы.Параметры.Заполнить(Новый Структура("ВалютаРус", ПредставлениеВалютыРус));
	ТД.Вывести(облШапкаТаблицы);
	
	// ---------------------------------------------------------------------------- 
	// определяем таблицу услуг для вывода
	ОсновнойЯзык = Константы.CW_ОсновнойЯзык.Получить();
	
	ТаблицаУслуг = CW_Финансы.ПолучитьУслугиДокумента(Ссылка);
	
	ТаблицаУслуг.Колонки.Добавить("ПредставлениеГП");
	Для Каждого СтрокаУслуг из ТаблицаУслуг Цикл
		СтрокаУслуг.ПредставлениеГП = СокрЛП(СтрокаУслуг.Грузоперевозка.CW_Представление);
	КонецЦикла;	
	
	// ----------------------------------------------------------------------------  
	
	ВсегоСтрокДляВывода = ТаблицаУслуг.Количество();
	ТекущаяСтрока = 0;
	
	// подготовим подвал и подписи
	// ---------------------------------------------------------------------------- 
	Подвал = Новый ТабличныйДокумент;
	// --- 
	Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
		Итого = _сф.Итог(Ссылка.Услуги,"Всего") - _сф.Итог(Ссылка.Услуги,"Всего_ДоКорректировки");
		облПодвалТаблицы.Параметры.СуммаИтого = Итого;
		облПодвалТаблицы.Параметры.СуммаНДС =  _сф.Итог(Ссылка.Услуги,"НДС") - _сф.Итог(Ссылка.Услуги,"НДС_ДоКорректировки");
	Иначе	
		облПодвалТаблицы.Параметры.Сумма 	=  _сф.Итог(Ссылка.Услуги,"Сумма") - _сф.Итог(Ссылка.Услуги,"Сумма_ДоКорректировки");
		облПодвалТаблицы.Параметры.СуммаНДС =  _сф.Итог(Ссылка.Услуги,"НДС") - _сф.Итог(Ссылка.Услуги,"НДС_ДоКорректировки");
		Если облПодвалТаблицы.Параметры.СуммаНДС = 0 Тогда
			ТЗ_НДС = Ссылка.Услуги.Выгрузить();
			ТЗ_НДС.Свернуть("СтавкаНДС");
			Если ТЗ_НДС.Количество() = 1 Тогда
				Если ТЗ_НДС[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
					облПодвалТаблицы.Параметры.СуммаНДС = "-";
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
		Итого = _сф.Итог(Ссылка.Услуги,"Всего") - _сф.Итог(Ссылка.Услуги,"Всего_ДоКорректировки");
		облПодвалТаблицы.Параметры.СуммаИтого = Итого;
	КонецЕсли;	
	Подвал.Вывести(облПодвалТаблицы);
	// --- 
	// итого и сумма прописью
	
	// вывод авансов
	Если ПараметрыДоговора.ВыводитьИнформациюОЗачтенномАвансе Тогда
		//Итого	
		СуммаАвансов = ПолучитьСуммуАвансовПоДокументу(Ссылка);
		Если СуммаАвансов > 0 Тогда
			обл = Макет.ПолучитьОбласть("ПодвалТаблицыАвансы");
			
			обл.Параметры.СуммаАвансов = СуммаАвансов;
			обл.Параметры.СуммаКОплате = Итого  - СуммаАвансов;
			
			Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
				обл.Параметры.НадписьАвансы = "ADVANCE RECEIVED" ;
				обл.Параметры.НадписьКОплате = "TOTAL TO PAYMENT";
			ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
				обл.Параметры.НадписьАвансы 	= "ПОЛУЧЕНО АВАНСОВ / ADVANCE RECEIVED";
				обл.Параметры.НадписьКОплате 	= "ИТОГО К ОПЛАТЕ / TOTAL TO PAYMENT";
			Иначе 
				обл.Параметры.НадписьАвансы 	= "ПОЛУЧЕНО АВАНСОВ";
				обл.Параметры.НадписьКОплате 	= "ИТОГО К ОПЛАТЕ";
			КонецЕсли;
			
			Подвал.Вывести(обл);
			
		КонецЕсли;
	КонецЕсли;
	//Конец вывод авансов
	
	// представление строки НДС
	ТаблицаНДС = Ссылка.Услуги.Выгрузить(,"СтавкаНДС,НДС,НДС_ДоКорректировки");
	ТаблицаНДС.Свернуть("СтавкаНДС","НДС,НДС_ДоКорректировки");
	ПредставлениеНДС = "";
	ПредставлениеНДСАнгл = "";
	СуммаНДС = _сф.Итог(Ссылка.Услуги,"НДС") - _сф.Итог(Ссылка.Услуги,"НДС_ДоКорректировки");
	ЕстьНДС = (СуммаНДС <> 0);
	Если (ЕстьНДС) Тогда
		
		Для каждого Стр Из ТаблицаНДС Цикл
			
			Если (Стр.СтавкаНДС = перечисления.СтавкиНДС.НДС18) Тогда
				ндс = "18%";
			ИначеЕсли (Стр.СтавкаНДС = перечисления.СтавкиНДС.НДС10) Тогда 
				ндс = "10%";
			ИначеЕсли (Стр.СтавкаНДС = перечисления.СтавкиНДС.НДС20) Тогда 
				ндс = "20%";
			Иначе
				Продолжить;
			КонецЕсли; 
			
		КонецЦикла; 
		
		РазницаНДС = ТаблицаУслуг.Итог("НДС") - ТаблицаУслуг.Итог("НДС_ДоКорректировки");
		
		СимволОткрытойСкобки = ?(РазницаНДС<0,"(","");
		СимволЗакрытойСкобки = ?(РазницаНДС<0,")","");
		
		ПредставлениеНДС     = ПредставлениеНДС		+ ", в том числе НДС "	+ндс+" - "	+СимволОткрытойСкобки+ Формат(РазницаНДС,"ЧЦ=15; ЧДЦ=2; ЧН=") +СимволЗакрытойСкобки+" " + ПредставлениеВалютыРус;
		ПредставлениеНДСАнгл = ПредставлениеНДСАнгл	+ ", including VAT " +СимволОткрытойСкобки+ Формат(РазницаНДС,"ЧДЦ=2; ЧРД=.; ЧРГ=,; ЧН=0.00")+СимволЗакрытойСкобки + " "+ Ссылка.Валюта;
		
	Иначе
		
		Если ПараметрыДоговора.ВыводСуммыБезНДС = 1 Тогда
			масНДС = Ссылка.Услуги.НайтиСтроки(Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.НДС0));
			Если масНДС.Количество() > 0 Тогда
				ПредставлениеНДС     = ", без НДС";
				ПредставлениеНДСАнгл = ", without VAT";
			Иначе
				ПредставлениеНДС     = ", НДС не облагается";
				ПредставлениеНДСАнгл = ", without VAT";
			КонецЕсли;	
		ИначеЕсли ПараметрыДоговора.ВыводСуммыБезНДС = 0 Тогда	
			ПредставлениеНДС     = ", в том числе НДС 0,00 " 	+ ПредставлениеВалютыРус;
			ПредставлениеНДСАнгл = ", including VAT 0,00 " 		+ Ссылка.Валюта;
		КонецЕсли;	
		
	КонецЕсли; 
	
	обл = Макет.ПолучитьОбласть("ИтогоСуммаПрописью");
	Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
		
		СуммаПрописью = CW_Печать.СформироватьСуммуПрописьюАнгл(Макс(Итого,-Итого), Ссылка.Валюта);
		СуммаПрописью = ?(Итого<0, "Minus "+ НРег(СуммаПрописью), СуммаПрописью);
		
		обл.Параметры.ИтоговыйТекст = "Total items "+ТаблицаУслуг.Количество()+", the amount is "+Формат(Итого,"ЧДЦ=2; ЧРД=.; ЧРГ=,")+" "+ Ссылка.Валюта;
		обл.Параметры.СуммаПрописью = СуммаПрописью + ПредставлениеНДСАнгл;
		
	ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
		
		СуммаПрописьюРус = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Макс(Итого,-Итого), Ссылка.Валюта);
		СуммаПрописьюРус = ?(Итого<0, "Минус "+НРег(СуммаПрописьюРус), СуммаПрописьюРус);
		
		СуммаПрописьюАнгл = CW_Печать.СформироватьСуммуПрописьюАнгл(Макс(Итого,-Итого), Ссылка.Валюта);
		СуммаПрописьюАнгл = ?(Итого<0, "Minus "+ НРег(СуммаПрописьюАнгл), СуммаПрописьюАнгл);
		
		
		обл.Параметры.ИтоговыйТекст = "Всего наименований "+ТаблицаУслуг.Количество()+", на сумму "+Формат(Итого,"ЧДЦ=2")+" "+ ПредставлениеВалютыРус
		+ Символы.ПС + СуммаПрописьюРус + ПредставлениеНДС; // ВызовБП
		обл.Параметры.СуммаПрописью = ""
		+ Символы.ПС + "Total items "+ТаблицаУслуг.Количество()+", the amount is "+Формат(Итого,"ЧДЦ=2; ЧРД=.; ЧРГ=,")+" "+ Ссылка.Валюта
		+ Символы.ПС + СуммаПрописьюАнгл + ПредставлениеНДСАнгл;
		
	Иначе 
		
		СуммаПрописьюРус = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Макс(Итого,-Итого), Ссылка.Валюта);
		СуммаПрописьюРус = ?(Итого<0, "Минус "+НРег(СуммаПрописьюРус), СуммаПрописьюРус);
		
		обл.Параметры.ИтоговыйТекст = "Всего наименований "+ТаблицаУслуг.Количество()+", на сумму "+Формат(Итого,"ЧДЦ=2")+" "+Ссылка.Валюта;
		обл.Параметры.СуммаПрописью = СуммаПрописьюРус + ПредставлениеНДС; // ВызовБП
		
	КонецЕсли;
	Подвал.Вывести(обл);
	// --- 
	// рублёвый счет
	Если ПараметрыДоговора.ВыводитьПодвалВСчете = 1 Тогда
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов=0) Тогда 
			стрДополнительнаяИнформация = ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалРус;
			Если НЕ ПустаяСтрока(стрДополнительнаяИнформация) Тогда 
				обл = Макет.ПолучитьОбласть("ДопИнфо");
				обл.Параметры.ДополнительнаяИнформация = стрДополнительнаяИнформация;
				Подвал.Вывести(обл);
			КонецЕсли;
		КонецЕсли;
		// валютный счет, англ
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
			стрДополнительнаяИнформация = ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалАнгл;
			Если НЕ ПустаяСтрока(стрДополнительнаяИнформация) Тогда 
				обл = Макет.ПолучитьОбласть("ДопИнфо");
				обл.Параметры.ДополнительнаяИнформация = стрДополнительнаяИнформация;
				Подвал.Вывести(обл);
			КонецЕсли;
		КонецЕсли;
		// валютный счет, рус/двуяз
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
			стрДополнительнаяИнформация = ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалРус + " / " + ПараметрыУчетнойПолитики.ДопИнфоДляПечатиСчетовПодвалАнгл;
			Если НЕ ПустаяСтрока(стрДополнительнаяИнформация) Тогда 
				обл = Макет.ПолучитьОбласть("ДопИнфо");
				обл.Параметры.ДополнительнаяИнформация = стрДополнительнаяИнформация;
				Подвал.Вывести(обл);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ПараметрыДоговора.ВыводитьПодвалВСчете = 2 Тогда
		Обл = Макет.ПолучитьОбласть("ПодвалПоШаблону");
		Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
			Обл.Параметры.ДополнительнаяИнформацияПоШаблону = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчетеАнгл, Ссылка, Неопределено, Ссылка.Услуги);
		ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
			Обл.Параметры.ДополнительнаяИнформацияПоШаблону = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчете, Ссылка, Неопределено, Ссылка.Услуги) +
			Символы.ПС +
			CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчетеАнгл, Ссылка, Неопределено, Ссылка.Услуги);
		Иначе
			Обл.Параметры.ДополнительнаяИнформацияПоШаблону = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ПодвалВСчете, Ссылка, Неопределено, Ссылка.Услуги);				
		КонецЕсли;
		Подвал.Вывести(Обл);
	КонецЕсли;
	
	
	// подписи, печать
	// ---------------------------------------------------------------------------- 
	обл = Макет.ПолучитьОбласть("Подписи");
	ВыводитьПодписиИПечать = НастройкиПечати.ПодписьИПечать = Истина ИЛИ (Ссылка.Договор.ПодписьИПечатьСчета И НастройкиПечати.ДляРассылки=Истина);
	
	Подписанты = CW_Печать.ВернутьПодписантов(Ссылка, ПараметрыДоговора);

	Если ВыводитьПодписиИПечать Тогда
		ПечатьОрганизации  = CW_Печать.ПолучитьПечатьОрганизации(Ссылка.Организация, НастройкиПечати.ПодключаемыйОбъект, Ссылка.ДатаСчета, Ложь);
		ПодписьРуководителя  		= CW_Печать.ПолучитьПодписьСотрудника(Подписанты.Руководитель, Ложь);
		ПодписьГлавногобБухгалтера	= CW_Печать.ПолучитьПодписьСотрудника(Подписанты.ГлБух, Ложь);
	КонецЕсли;
	
	обл.Рисунки.ПечатьОрганизации.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	обл.Рисунки.ПечатьОрганизации.ВыводитьНаПечать 	= Ложь;
	
	Если ВыводитьПодписиИПечать и ПечатьОрганизации <> Неопределено Тогда
		обл.Рисунки.ПечатьОрганизации.ВыводитьНаПечать 	= Истина;
		обл.Рисунки.ПечатьОрганизации.Картинка 			= Новый Картинка(ПечатьОрганизации); 
	КонецЕсли;
	// --- 
	обл.Рисунки.ПодписьРуководителя.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	обл.Рисунки.ПодписьРуководителя.ВыводитьНаПечать	= Ложь;
	
	Если ВыводитьПодписиИПечать и ПодписьРуководителя <> Неопределено Тогда
		обл.Рисунки.ПодписьРуководителя.ВыводитьНаПечать	= Истина;
		обл.Рисунки.ПодписьРуководителя.Картинка 			= Новый Картинка(ПодписьРуководителя);
	КонецЕсли;
	// ---  
	обл.Рисунки.ПодписьБухгалтера.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	обл.Рисунки.ПодписьБухгалтера.ВыводитьНаПечать	= Ложь;
	
	Если ВыводитьПодписиИПечать и ПараметрыДоговора.ВыводитьПодписьГлавногоБухгалтера И (ПодписьГлавногобБухгалтера <> Неопределено) Тогда
		обл.Рисунки.ПодписьБухгалтера.ВыводитьНаПечать	= Истина;
		обл.Рисунки.ПодписьБухгалтера.Картинка 			= Новый Картинка(ПодписьГлавногобБухгалтера);                                         
	КонецЕсли;
	//---подписи, печать
	
		
	обл.Параметры.ЛинияПодписиРуководитель 	= "_____________________";
	Если ПараметрыДоговора.ВыводитьПодписьГлавногоБухгалтера Тогда
		обл.Параметры.ЛинияПодписиБухгалтер	= "_____________________";
	КонецЕсли;
	
	Если (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
		
		обл.Параметры.ДолжностьРуководителя = Подписанты.РуководительДолжностьАнг;
		обл.Параметры.ФиоРуководителя = CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Подписанты.Руководитель))
		+ ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеАнг), " (" + Подписанты.РуководительОснованиеАнг + ")", "");
		
		Если ПараметрыДоговора.ВыводитьПодписьГлавногоБухгалтера Тогда
			обл.Параметры.ДолжностьГлавныйБухгалтер = "Chief accounting manager";
			обл.Параметры.ФиоГлавБуха     = CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Подписанты.ГлБух))
			+ ?(ЗначениеЗаполнено(Подписанты.ГлБухОснованиеАнг), " (" + Подписанты.ГлБухОснованиеАнг + ")", "");
		КонецЕсли;
		
		обл.Параметры.НадписьМП = "SEAL";
		
	ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
		
		обл.Параметры.ДолжностьРуководителя = СокрЛП(Подписанты.РуководительДолжностьРус) + Символы.ПС + СокрЛП(Подписанты.РуководительДолжностьАнг);
		обл.Параметры.ФиоРуководителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,Ссылка.Дата) + ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", "")
		+ Символы.ПС + CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Подписанты.Руководитель))
		+ ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеАнг), " (" + Подписанты.РуководительОснованиеАнг + ")", "");
		
		Если ПараметрыДоговора.ВыводитьПодписьГлавногоБухгалтера Тогда
			обл.Параметры.ДолжностьГлавныйБухгалтер = "Главный бухгалтер " + Символы.ПС + "Chief accounting manager";
			обл.Параметры.ФиоГлавБуха     = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.ГлБух,Ссылка.Дата) + ?(ЗначениеЗаполнено(Подписанты.ГлБухОснованиеРус), " (" + Подписанты.ГлБухОснованиеРус + ")", "") 
			+ Символы.ПС + CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Подписанты.ГлБух))
			+ ?(ЗначениеЗаполнено(Подписанты.ГлБухОснованиеАнг), " (" + Подписанты.ГлБухОснованиеАнг + ")", "");
		КонецЕсли;
		
		обл.Параметры.НадписьМП = "М.П."+ Символы.ПС +"SEAL";
		
	Иначе 
		
		обл.Параметры.ДолжностьРуководителя = Подписанты.РуководительДолжностьРус;
		обл.Параметры.ФиоРуководителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,Ссылка.Дата) + ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", "");
		
		Если ПараметрыДоговора.ВыводитьПодписьГлавногоБухгалтера Тогда
			обл.Параметры.ДолжностьГлавныйБухгалтер = "Главный бухгалтер";
			обл.Параметры.ФиоГлавБуха = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.ГлБух,Ссылка.Дата) + ?(ЗначениеЗаполнено(Подписанты.ГлБухОснованиеРус), " (" + Подписанты.ГлБухОснованиеРус + ")", "");
		КонецЕсли;
		
		обл.Параметры.НадписьМП = "М.П.";
		
	КонецЕсли;
	
	#Область НужноПечататьQRКод
	Если ПараметрыДоговора.НужноПечататьQRКод Тогда   
		
		//Оплата по счету № 0Ф00-000042 от 25.05.2022, сумма 120000-00, в т.ч. НДС 20% 20000-00  
		НазначениеПлатежа = "Оплата по счету №" + СокрЛП(НомерДокумента)+" от "  + Формат(ДатаДокумента,"ДФ=dd.MM.yyyy") +", "
							+ "сумма " + Формат(Итого,"ЧДЦ=2; ЧГ=0") +" "+ПредставлениеВалютыРус 
							+ ПредставлениеНДС;
		
		
		Если ЗначениеЗаполнено(ПараметрыДоговора.РасчетныйСчетОрганизации.ТекстКорреспондента) Тогда
			Получатель = СокрЛП(ПараметрыДоговора.РасчетныйСчетОрганизации.ТекстКорреспондента);
		Иначе
			Получатель = СокрЛП(НаименованияОрганиазции.ПолноеНаименование);
		КонецЕсли; 
		
		РеквизитыПлатежа = Новый Структура( "Получатель,
											|НомерСчета,
											|БанкПолучателя,
											|БикБанкаПолучателя,
											|НомерСчетаБанкаПолучателя,
											|Сумма,
											|ИНН,              
											|НазначениеПлатежа,
											|Ссылка");
		
		РеквизитыПлатежа.Получатель 				= Получатель;
		РеквизитыПлатежа.БанкПолучателя				= ПараметрыДоговора.РасчетныйСчетОрганизации.Банк;
		РеквизитыПлатежа.БикБанкаПолучателя			= ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.Код;   
		РеквизитыПлатежа.НомерСчета 				= ПараметрыДоговора.РасчетныйСчетОрганизации.НомерСчета;
		РеквизитыПлатежа.НомерСчетаБанкаПолучателя	= ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.КоррСчет;
		РеквизитыПлатежа.ИНН 						= Ссылка.Организация.ИНН;
		РеквизитыПлатежа.НазначениеПлатежа 			= НазначениеПлатежа; 
		РеквизитыПлатежа.Сумма 						= Формат(Итого*100, "ЧДЦ=0; ЧГ="); 
		РеквизитыПлатежа.Ссылка 					= Ссылка;
		
		QRСтрока = ФорматнаяСтрокаУФЭБС(РеквизитыПлатежа);
		
		Если Не ПустаяСтрока(QRСтрока) Тогда
			ДанныеQRКода = ДанныеQRКода(QRСтрока, 1, 190);
			
			Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда  
				КартинкаQRКода = Новый Картинка(ДанныеQRКода);
				обл.Рисунки.QRКод.Картинка = КартинкаQRКода;   
			Иначе
				Шаблон = Нстр("ru = 'Не удалось сформировать QR-код для документа %1.
				|Технические подробности см. в журнале регистрации.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Ссылка);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
		КонецЕсли; 
	Иначе
		обл.Рисунки.QRКод.Картинка = Новый Картинка;   
		обл.Рисунки.QRКод.ВыводитьНаПечать = Ложь;  
		обл.Рисунки.QRКод.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии,,); 
		
	КонецЕсли;
	#КонецОбласти
		
	// ---------------------------------------------------------------------------- 
	Подвал.Вывести(обл);
	
	// подготовка единиц измерения
	ТЗЕИ = ТаблицаУслуг.Скопировать(,"Номенклатура");
	ТЗЕИ.Свернуть("Номенклатура");
	МассивНоменклатуры = ТЗЕИ.ВыгрузитьКолонку("Номенклатура");
	// --- 
	МассивЯзыков = Новый Массив;
	МассивЯзыков.Добавить(Справочники.CW_Языки.ru);
	МассивЯзыков.Добавить(Справочники.CW_Языки.en);
	// --- 
	ОсновнойЯзык = Константы.CW_ОсновнойЯзык.Получить();
	// --- 
	СоответствиеПереводовЕдиниц = Новый Соответствие;
	Для каждого Номенклатура Из МассивНоменклатуры Цикл
		СтруктураПеревода = CW_ПереводыСервер.ПолучитьПереводы(Номенклатура.ЕдиницаИзмерения, ,МассивЯзыков);
		СоответствиеПереводовЕдиниц.Вставить(Номенклатура.ЕдиницаИзмерения, СтруктураПеревода);
	КонецЦикла; 
	
	
	НомСтрГП = 0;
	Для каждого усл Из ТаблицаУслуг Цикл
		
		Если  (Усл.Количество = Усл.Количество_ДоКорректировки) И (Усл.Цена 	= Усл.Цена_ДоКорректировки)  
			И (Усл.Сумма 	= усл.Сумма_ДоКорректировки) И (Усл.НДС    = усл.НДС_ДоКорректировки) И (Усл.Всего = усл.Всего_ДоКорректировки) Тогда
			Продолжить;
		КонецЕсли;
		
		_сф.Инкремент(ТекущаяСтрока);
		
		стру = Новый Структура;
		стру.Вставить("Номер",        ТекущаяСтрока);
		стру.Вставить("Наименование", усл.Представление);
		// --- 
		
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов=0) Тогда
			стру.Вставить("Единица",      СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["ru"] );
		ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 					
			стру.Вставить("Единица",      СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["en"] ); 
		ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
			стру.Вставить("Единица",      СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["ru"] + "/" + СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["en"] );
		КонецЕсли; 
		
		Если СокрЛП(усл.Номенклатура.ЕдиницаИзмерения.Наименование) = "-" Тогда
			Если ПараметрыДоговора.ВыводитьКоличествоЦенуУслугБезЕИ Тогда
				стру.Вставить("Количество",   ?( Усл.Количество <> Усл.Количество_ДоКорректировки,Усл.Количество - Усл.Количество_ДоКорректировки ,Усл.Количество));
				стру.Вставить("Цена",         Усл.Цена - Усл.Цена_ДоКорректировки);
			Иначе
				стру.Вставить("Количество", "-");
				стру.Вставить("Цена", "-");
			КонецЕсли;
		Иначе
			стру.Вставить("Количество",  ?( Усл.Количество <> Усл.Количество_ДоКорректировки,Усл.Количество - Усл.Количество_ДоКорректировки ,Усл.Количество));
			стру.Вставить("Цена",         Усл.Цена - Усл.Цена_ДоКорректировки);
		КонецЕсли;	
		
		стру.Вставить("Сумма",        Усл.Сумма - усл.Сумма_ДоКорректировки);
		стру.Вставить("СтавкаНДС",    ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, стрБезНДС, усл.СтавкаНДС));
		стру.Вставить("СуммаНДС",     Усл.НДС   - усл.НДС_ДоКорректировки);
		стру.Вставить("Итого",        Усл.Всего - усл.Всего_ДоКорректировки);
		
		облСтрокаТаблицы.Параметры.Заполнить(стру);
		Если ПараметрыДоговора.СкрыватьКолонкиНДСвТЧСчета Тогда
			облСтрокаТаблицы.Параметры.Цена = Усл.Цена  - Усл.Цена_ДоКорректировки;
		Иначе	
			облСтрокаТаблицы.Параметры.СуммаНДС = ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, "-", Усл.НДС - усл.НДС_ДоКорректировки);
		КонецЕсли;	
		
		ТД.Вывести(облСтрокаТаблицы);
		
	КонецЦикла;
	
	ТД.Вывести(Подвал);
	
	//исполнитель документа
	Если Не Ссылка.Ответственный.Пустая() и ПараметрыДоговора.ВыводитьИсполнителяСчет Тогда
		
		ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
		ТД.Вывести(ОбластьРазделитель);
		
		ТелефонИсполнителя 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка.Ответственный, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПользователя"),,Истина);		
		ИсполнительФизическоеЛицо 	= Ссылка.Ответственный.ФизическоеЛицо;
		
		Если ПараметрыДоговора.ЯзыкПечатиДокументов = 0 или ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда  
			Если ИсполнительФизическоеЛицо.Пустая() Тогда
				Исполнитель_рус = "";
			Иначе
				Исполнитель_рус = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ИсполнительФизическоеЛицо);
			КонецЕсли;
			
			ОбластьИсполнитель_Рус = Макет.ПолучитьОбласть("Исполнитель_Рус");
			ОбластьИсполнитель_Рус.Параметры.Исполнитель 		= "Исп."+ Исполнитель_рус;
			ОбластьИсполнитель_Рус.Параметры.ТелефонИсполнителя = "Тел."+ ТелефонИсполнителя;
			
			ТД.Вывести(ОбластьИсполнитель_Рус);
		КонецЕсли;
		
		Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 или ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда  
			Если ИсполнительФизическоеЛицо.Пустая() Тогда
				ИсполнительАнгл = "";
			Иначе
				ИсполнительАнгл =  CW_ПереводыСервер.ПолучитьПеревод(ИсполнительФизическоеЛицо, ,Справочники.CW_Языки.en);
				
				ЧастиИмени 			= ФизическиеЛицаКлиентСервер.ЧастиИмени(ИсполнительАнгл);
				Исполнитель_Англ	= ЧастиИмени.Фамилия  + " " + ЧастиИмени.Имя;
			КонецЕсли;
			
			ОбластьИсполнитель_Англ = Макет.ПолучитьОбласть("Исполнитель_Англ");
			ОбластьИсполнитель_Англ.Параметры.Исполнитель_Англ 		  = "Exe." + Исполнитель_Англ;
			ОбластьИсполнитель_Англ.Параметры.ТелефонИсполнителя_Англ = "Tel." + ТелефонИсполнителя;	
			
			ТД.Вывести(ОбластьИсполнитель_Англ);
		КонецЕсли;
		
		
	КонецЕсли;
	//исполнитель документа
	
	//Исключение
	//	
	//	Сообщить(ОписаниеОшибки());
	//	
	//КонецПопытки; 
	
	РезультатПечати.ПечатнаяФорма = ТД;
	
	// ---------------------------------------------------------------------------- 
	
	Возврат РезультатПечати;
	
КонецФункции

Функция ПолучитьСуммуАвансовПоДокументу(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозкеЗачетАвансовОЗ.Ссылка КАК Ссылка,
	|	СУММА(CW_ДоходыПоГрузоперевозкеЗачетАвансовОЗ.СуммаЗачета) КАК СуммаЗачета
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке.ЗачетАвансовОЗ КАК CW_ДоходыПоГрузоперевозкеЗачетАвансовОЗ
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозкеЗачетАвансовОЗ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДоходыПоГрузоперевозкеЗачетАвансовОЗ.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	СуммаАванса = 0;
	Если Выборка.Следующий() Тогда
		СуммаАванса = Выборка.СуммаЗачета;
	КонецЕсли;
	
	Возврат СуммаАванса;
	
КонецФункции

//Работа с QR-кодом

// Возвращает двоичные данные для формирования QR кода
//
// Параметры:
//  QRСтрока         - Строка - данные, которые необходимо разместить в QR-коде.
//
//  УровеньКоррекции - Число - уровень погрешности изображения при котором данный QR-код все еще возможно 100% распознать.
//                     Параметр должен иметь тип целого и принимать одно из 4 допустимых значений:
//                     0(7% погрешности), 1(15% погрешности), 2(25% погрешности), 3(35% погрешности).
//
//  Размер           - Число - определяет длину стороны выходного изображения в пикселях.
//                     Если минимально возможный размер изображения больше этого параметра – код сформирован не будет.
//
//  ТекстОшибки      - Строка - в этот параметр помещается описание возникшей ошибки (если возникла).
//
// Возвращаемое значение:
//  Двоичные данные  - буфер, содержащий байты PNG-изображения QR-кода.
// 
// Пример:
//  
//  //Выводим на печать QR-код, содержащий в себе информацию зашифрованную по УФЭБС
//
//  QRСтрока = УправлениеПечатью.ФорматнаяСтрокаУФЭБС(РеквизитыПлатежа);
//  ТекстОшибки = "";
//  ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190, ТекстОшибки);
//  Если Не ПустаяСтрока(ТекстОшибки)
//      ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
//  КонецЕсли;
//
//  КартинкаQRКода = Новый Картинка(ДанныеQRКода);
//  ОбластьМакета.Рисунки.QRКод.Картинка = КартинкаQRКода;
//
Функция ДанныеQRКода(QRСтрока, УровеньКоррекции, Размер) Экспорт
	
	Отказ = Ложь;
	
	ГенераторQRКода = КомпонентаФормированияQRКода(Отказ);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ДвоичныеДанныеКартинки = ГенераторQRКода.GenerateQRCode(QRСтрока, УровеньКоррекции, Размер);
	Исключение
		ЗаписьЖурналаРегистрации("Формирование QR-кода",УровеньЖурналаРегистрации.Ошибка,,,
								  ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат ДвоичныеДанныеКартинки;
	
КонецФункции  

// Формирует форматную строку согласно "Унифицированному формату электронных банковских сообщений" для ее отображения в виде QR-кода
// Параметры:
// ДанныеДокумента  - Структура - содержит значения полей документа
//					- Данные документа будут закодированы согласно стандарту 
//						"СТАНДАРТЫ ФИНАНСОВЫХ ОПЕРАЦИЙ Символы двумерного штрихового кода для осуществления платежей физических лиц"
//					- ДанныеДокумента должны содержать информацию в полях, описанных ниже.
//
//					- Обязательные поля структуры
//		* ТекстПолучателя             - Наименование получателя платежа         - Макс. 160 символов;
//		* НомерСчетаПолучателя        - Номер счета получателя платежа          - Макс. 20 символов;
//		* НаименованиеБанкаПолучателя - Наименование банка получателя платежа   - Макс. 45 символов;
//		* БИКБанкаПолучателя          - БИК                                     - Макс. 9 символов;
//		* СчетБанкаПолучателя         - Номер кор./сч. банка получателя платежа - Макс. 20 символов;
//					- Дополнительные поля структуры
//		* СуммаЧислом         - Сумма платежа, в рублях                 - Макс. 16 символов 
//		* НазначениеПлатежа   - Наименование платежа (назначение)       - Макс. 210 символов;
//		* ИННПолучателя       - ИНН получателя платежа                  - Макс. 12 символов;
//		* ИННПлательщика      - ИНН плательщика                         - Макс. 12 символов;
//		* СтатусСоставителя   - Статус составителя платежного документа - Макс. 2 символа;
//		* КПППолучателя       - КПП получателя платежа                  - Макс. 9 символов
//		* КодБК               - КБК                                     - Макс. 20 символов;
//		* КодОКАТО            - Код ОКАТО (ОКТМО)                       - Макс. 11 символов;
//		* ПоказательОснования - Основание налогового платежа            - Макс. 2 символа;
//		* ПоказательПериода   - Налоговый период                        - Макс. 10 символов;
//		* ПоказательНомера    - Номер документа                         - Макс. 15 символов;
//		* ПоказательДаты      - Дата документа                          - Макс. 10 символ
//		* ПоказательТипа      - Тип платежа                             - Макс. 2 символа
//					- Прочие дополнительные  поля
//		* ФамилияПлательщика               - Фамилия плательщика
//		* ИмяПлательщика                   - Имя плательщика
//		* ОтчествоПлательщика              - Отчество плательщика
//		* АдресПлательщика                 - Адрес плательщика
//		* ЛицевойСчетБюджетногоПолучателя  - Лицевой счет бюджетного получателя
//		* ИндексПлатежногоДокумента        - Индекс платежного документа
//		* СНИЛС                            - № лицевого счета в системе персонифицированного учета в ПФР - СНИЛС
//		* НомерДоговора                    - Номер договора
//		* НомерЛицевогоСчетаПлательщика    - Номер лицевого счета плательщика в организации (в системе учета ПУ)
//		* НомерКвартиры                    - Номер квартиры
//		* НомерТелефона                    - Номер телефона
//		* ВидПлательщика                   - Вид ДУЛ плательщика
//		* НомерПлательщик                  - Номер ДУЛ плательщика
//		* ФИОРебенка                       - Ф.И.О. ребенка/учащегося
//		* ДатаРождения                     - Дата рождения
//		* СрокПлатежа                      - Срок платежа/дата выставления счета
//		* ПериодОплаты                     - Период оплаты
//		* ВидПлатежа                       - Вид платежа
//		* КодУслуги                        - Код услуги/название прибора учета
//		* НомерПрибораУчета                - Номер прибора учета
//		* ПоказаниеПрибораУчета            - Показание прибора учета
//		* НомерИзвещения                   - Номер извещения, начисления, счета
//		* ДатаИзвещения                    - Дата извещения/начисления/счета/постановления (для ГИБДД)
//		* НомерУчреждения                  - Номер учреждения (образовательного, медицинского)
//		* НомерГруппы                      - Номер группы детсада/класса школы
//		* ФИОПреподавателя                 - ФИО преподавателя, специалиста, оказывающего услугу
//		* СуммаСтраховки                   - Сумма страховки/дополнительной услуги/Сумма пени (в копейках)
//		* НомерПостановления               - Номер постановления (для ГИБДД)
//		* НомерИсполнительногоПроизводства - Номер исполнительного производства
//		* КодВидаПлатежа                   - Код вида платежа (например, для платежей в адрес Росреестра)
//		* ИдентификаторНачисления          - Уникальный идентификатор начисления
//		* ТехническийКод                   - Технический код, рекомендуемый для заполнения поставщиком услуг.
//                                           Может использоваться принимающей организацией для вызова соответствующей обрабатывающей ИТ-системы. 
//                                           Перечень значений кода представлен ниже.
//
//	Код назначения			Наименование назначения платежа
//		платежа	
//	
//			01				Мобильная связь, стационарный телефон
//			02				Коммунальные услуги, ЖКХ
//			03				ГИБДД, налоги, пошлины, бюджетные платежи
//			04				Охранные услуги
//			05				Услуги, оказываемые УФМС
//			06				ПФР
//			07				Погашение кредитов
//			08				Образовательные учреждения
//			09				Интернет и ТВ
//			10				Электронные деньги
//			11				Отдых и путешествия
//			12				Инвестиции и страхование
//			13				Спорт и здоровье
//			14				Благотворительные и общественные организации
//			15				Прочие услуги
//
// Возвращаемое значение:
//   Строка - строка данных в формате УФЭБС
//
Функция ФорматнаяСтрокаУФЭБС(ДанныеДокумента) Экспорт
	
	ТекстОшибки = "";
	СтрокаОбязательныхРеквизитов = СтрокаОбязательныхРеквизитов(ДанныеДокумента, ТекстОшибки);
	
	Если ПустаяСтрока(СтрокаОбязательныхРеквизитов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , ,);
		Возврат "";
	КонецЕсли;
	
	Возврат СтрокаОбязательныхРеквизитов;
	
КонецФункции

Функция СтрокаОбязательныхРеквизитов(ДанныеДокумента, ТекстСообщения)
	
	СтруктураПредставленийИРеквизитов = СтруктураПредставленийИРеквизитов();

	МассивОбязательныеРеквизиты = Новый Массив;
	ДобавитьОбязательныеРеквизиты(МассивОбязательныеРеквизиты);
	
	Если Не ЗначениеЗаполнено(ДанныеДокумента.НомерСчетаБанкаПолучателя) Тогда
		ДанныеДокумента.НомерСчетаБанкаПолучателя = "0";
	КонецЕсли;
	
	СлужебныеДанные = "ST00012";
	
	ОбязательныеДанные = "";
	Для Каждого ИмяРеквизита Из МассивОбязательныеРеквизиты Цикл
		Если Не ЗначениеЗаполнено(ДанныеДокумента[ИмяРеквизита]) Тогда
			ТекстСообщения = Нстр("ru = 'Не заполнен обязательный реквизит: %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ИмяРеквизита);
			Возврат "";
		КонецЕсли;
		
		ЗначениеСтрокой 	= СтрЗаменить(СокрЛП(Строка(ДанныеДокумента[ИмяРеквизита])), "|", "");
		ОбязательныеДанные 	= ОбязательныеДанные + "|" + СтруктураПредставленийИРеквизитов.Получить(ИмяРеквизита) + "=" + ЗначениеСтрокой;
	КонецЦикла;
	
	Если СтрДлина(ОбязательныеДанные) > 600 Тогда
		Шаблон = НСтр("ru = 'Невозможно создать QR-код для документа %1
		                    |Строка обязательных реквизитов должна быть меньше 600 символов:
		                    |""%2""'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,
		                                                                         ДанныеДокумента.Ссылка,
		                                                                         ОбязательныеДанные);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат "";
	КонецЕсли;
	
	//Заполнем дополнительыне реквиизты
	МассивДополнительынеРеквизиты = Новый Массив;
	ДобавитьДополнительныеРеквизиты(МассивДополнительынеРеквизиты);
	
	ДополнительныеДанные = "";
	Для Каждого ИмяРеквизита Из МассивДополнительынеРеквизиты Цикл
		ЗначениеСтрокой 		= СтрЗаменить(СокрЛП(Строка(ДанныеДокумента[ИмяРеквизита])), "|", "");
		ДополнительныеДанные 	= ДополнительныеДанные + "|" + СтруктураПредставленийИРеквизитов.Получить(ИмяРеквизита) + "=" + ЗначениеСтрокой;
	КонецЦикла;

	Возврат СлужебныеДанные + ОбязательныеДанные + ДополнительныеДанные;
	
КонецФункции

Функция КомпонентаФормированияQRКода(Отказ)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Платформа = СистемнаяИнформация.ТипПлатформы;
	
	ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту для генерации QR-кода'");
	
	Попытка
		Если ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиQRКода", "QR") Тогда
			QRCodeGenerator = Новый("AddIn.QR.QRCodeExtension");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли
	Исключение
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки + Символы.ПС + ПодробноеПредставлениеОшибки, , , , Отказ);
	КонецПопытки;
	
	Возврат QRCodeGenerator;
	
КонецФункции

Функция СтруктураПредставленийИРеквизитов()
	
	СтруктураВозврата = Новый Соответствие;  
	
	//Обазательные реквизиты
	СтруктураВозврата.Вставить("Получатель", 				"Name");
	СтруктураВозврата.Вставить("НомерСчета", 				"PersonalAcc");
	СтруктураВозврата.Вставить("БанкПолучателя", 			"BankName");
	СтруктураВозврата.Вставить("БИКБанкаПолучателя",		"BIC");
	СтруктураВозврата.Вставить("НомерСчетаБанкаПолучателя", "CorrespAcc");
	СтруктураВозврата.Вставить("ИНН", 						"PayeeINN");  
	
	//Дополнительные реквизиты
	СтруктураВозврата.Вставить("Сумма", 					"Sum");   
	СтруктураВозврата.Вставить("НазначениеПлатежа", 		"Purpose");   
	
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ДобавитьОбязательныеРеквизиты(МассивОбязательныеРеквизиты)
	
	МассивОбязательныеРеквизиты.Добавить("Получатель");
	МассивОбязательныеРеквизиты.Добавить("НомерСчета");
	МассивОбязательныеРеквизиты.Добавить("БанкПолучателя");
	МассивОбязательныеРеквизиты.Добавить("БИКБанкаПолучателя");
	МассивОбязательныеРеквизиты.Добавить("НомерСчетаБанкаПолучателя");
	МассивОбязательныеРеквизиты.Добавить("ИНН");
	
КонецПроцедуры

Процедура ДобавитьДополнительныеРеквизиты(МассивДополнительынеРеквизиты)
	
	МассивДополнительынеРеквизиты.Добавить("Сумма");
	МассивДополнительынеРеквизиты.Добавить("НазначениеПлатежа");
	
КонецПроцедуры

//Работа с QR-кодом


#КонецЕсли