
Процедура ПередУдалениемГруппыУслуг(Форма, Элемент, Отказ) Экспорт
	
	Отказ		= истина;
	Элементы 	= Форма.Элементы;
	Объект		= Форма.Объект;
	
	Параметры = Новый Структура;
	Параметры.Вставить("КлючЗаписи", 	Элементы.ГруппыУслуг.ТекущаяСтрока);
	Параметры.Вставить("Элементы", 		Элементы);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьУдалениеГруппыУслуг", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Выбранная группа услуг и се входящие в нее услуги будут удалены из приложения. Продолжить?", Режим, 0);
	
КонецПроцедуры

Процедура ПередНачаломДобавленияГруппыУслуг(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр) Экспорт
	
	Объект 		= Форма.Объект;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Перед добавлением групп услуг, элемент необходимо записать!");
		Отказ = истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПродолжитьУдалениеГруппыУслуг(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    CW_ГруппыУслугСервер.ПродолжитьУдалениеГруппыУслугНаСервере(Параметры.КлючЗаписи);

	Параметры.Элементы.ГруппыУслуг.Обновить();

КонецПроцедуры

Процедура ИспользуетсяОграниченияПоГруппамУслугПриИзменении(Форма) Экспорт
	
	Форма.Элементы.СтраницаГруппыУслуг.Видимость = Форма.Объект.ИспользуетсяОграниченияПоГруппамУслуг;
	
КонецПроцедуры

