
&НаКлиенте
Процедура УстановитьПароль(Команда)
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Пароль) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан пароль",, "Пароль", "ЭтаФорма", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Подтверждение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо повториь ввод пароля",, "Подтверждение", "ЭтаФорма", Отказ);
	КонецЕсли;
	
	Если Пароль <> Подтверждение Тогда
		ПоказатьПредупреждение(,"Введенные пароли не совпадают!");
		Отказ = истина;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ЗакрытьИзФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИзФормы()
	
	ДанныеПароля = Новый Структура;
	ДанныеПароля.Вставить("Пароль", Пароль);
	ДанныеПароля.Вставить("Подтверждение", Подтверждение);
	
	ЭтаФорма.Закрыть(ДанныеПароля);
	
КонецПроцедуры
