#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 					= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 				= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 				= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешняяОбработкаОтбораПараметра();
	
	СтруктураОписания.Наименование 				= "Обработка отбора (Номенклатура, только услуги)";
	СтруктураОписания.Описание 					= "Пример подключаемой обработки отбора для параметра";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";

	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "ПараметрыФормыВыбора");
	
	Возврат СтруктураОписания;
	
КонецФункции

// --- 

Функция Регистрация(СсылкаНаОбъект) Экспорт 
	
	Возврат(_УФКС.Ответ());
	
КонецФункции
  
// --- 

Функция ПараметрыФормыВыбора(Параметр,РедактируемыйОбъект,Значение) Экспорт 
	// --- 
	
	Ответ = Новый Структура("ИмяФормы,ПараметрыФормы,ПараметрыВыбора","",Новый Структура,Новый Массив);
	// --- 
	Ответ.ИмяФормы = "Справочник.Номенклатура.ФормаВыбора";
	Ответ.ПараметрыФормы = Новый Структура("Отбор",Новый Структура("Услуга,СтавкаНДС",Истина,Перечисления.СтавкиНДС.НДС20));
	Если (ЗначениеЗаполнено(Значение)) Тогда
		Ответ.ПараметрыФормы.Вставить("ТекущаяСтрока",Значение);
	КонецЕсли; 
	// --- 
	Возврат(Ответ);
	
	// --- 
КонецФункции

#КонецЕсли