
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеКопирования = Параметры.ЗначениеКопирования; 
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если Объект.Валюта.Пустая() тогда
		Элементы.Валюта.ПодсказкаВвода = СокрЛП(ВалютаРегламентированногоУчета);	
	КонецЕсли;

	УстановитьВидимостьКурсаКратности();
	
	//Блокировка бюджета
	УстановитьПараметрыБлокировки();  
	//Блокировка бюджета    
	
	УтверждениеБюджетов 		= CW_ПраваДоступа.ПравоДоступно("УтверждениеБюджетов");  
 	ОтменаУтвержденияБюджетов 	= CW_ПраваДоступа.ПравоДоступно("ОтменаУтвержденияБюджетов");  
	
	Элементы.ГруппаБлокировка.Доступность = (Не Заблокирован и УтверждениеБюджетов) ИЛИ (Заблокирован и ОтменаУтвержденияБюджетов);
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Копирование", Истина);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СсылкаКопирования", ЗначениеКопирования);
	КонецЕсли;   
	
	Результатпроверки = ВозможностьУстановкиСрокаДействияНаСервере();
	Если Результатпроверки.Отказ Тогда 
		ТекстСообщения = "Срок действия варианта бюджета не может быть больше "+Формат(Результатпроверки.СрокДействия, "ДФ=dd.MM.yyyy");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"СрокДействия", "Объект", Отказ); 
	КонецЕсли;      
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Блокировка бюджета
	Если ЗаблокированНачальноеЗначение <> Заблокирован Тогда
		Если Заблокирован Тогда
			БюджетБлокироватьНаСервере();
		Иначе
			БюджетРазблокироватьнаСервере();
		КонецЕсли;                                              
	КонецЕсли;
	
	УстановитьПараметрыБлокировки();       
	//Блокировка бюджета

КонецПроцедуры

//Блокировка бюджета
&НаСервере
Процедура УстановитьПараметрыБлокировки()  
	
	Заблокирован = РегистрыСведений.CW_УтверждениеБюджетов.ПолучитьБлокировкуБюджета(Объект.Владелец, Объект.Ссылка);
	ЗаблокированНачальноеЗначение 	= Заблокирован;  
		
КонецПроцедуры     

&НаКлиенте
Процедура ЗаблокированТекстНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;	

	Отбор = Новый Структура;
	Отбор.Вставить("Объект", Объект.Владелец);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",Отбор);

	ОткрытьФорму("РегистрСведений.CW_ИсторияУтверждениеБюджетов.ФормаСписка",ПараметрыФормы, ЭтаФорма,Истина);

КонецПроцедуры

&НаСервере
Процедура БюджетБлокироватьНаСервере() 

	Запись = РегистрыСведений.CW_УтверждениеБюджетов.СоздатьМенеджерЗаписи();
	Запись.ВерсияБюджета = Объект.Ссылка;
	Запись.Объект 		 = Объект.Владелец;
	Запись.Записать();
	
	ЗаписатьИсториюУтвержденияБюджета(Истина); 
	
КонецПроцедуры

&НаСервере
Процедура БюджетРазблокироватьнаСервере()
	
	Запись = РегистрыСведений.CW_УтверждениеБюджетов.СоздатьМенеджерЗаписи();
	Запись.ВерсияБюджета = Объект.Ссылка;
	Запись.Объект 		 = Объект.Владелец;  
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Запись.Удалить();
		ЗаписатьИсториюУтвержденияБюджета();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИсториюУтвержденияБюджета(Заблокирован = Ложь)
	
	УстановитьПривилегированныйРежим(Истина); 
	
	Запись = РегистрыСведений.CW_ИсторияУтверждениеБюджетов.СоздатьМенеджерЗаписи();
	Запись.Период 		 		= ТекущаяДата();
	Запись.ВерсияБюджета 		= Объект.Ссылка;
	Запись.Объект 		 		= Объект.Владелец;  
	Запись.Пользователь  		= CW_Настройки.Пользователь();
	Запись.ПризнакУтверждения 	= Заблокирован;

	Запись.Записать(Истина);

КонецПроцедуры
 //Блокировка бюджета

 &НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ВариантыБюджетов");
	
КонецПроцедуры 

&НаСервере
Функция ВозможностьУстановкиСрокаДействияНаСервере()
	
	Результат = Новый Структура("Отказ,СрокДействия", Ложь, Дата(1,1,1));
	
	Если Объект.Ссылка.Пустая() или (Объект.СрокДействия = Дата(1,1,1)) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Ссылка,
	               |	CW_ПлановыеСтатьиЗатратИДоходов.СрокДействия КАК СрокДействия
	               |ИЗ
	               |	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
	               |ГДЕ
	               |	CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.СрокДействия <> ДАТАВРЕМЯ(1, 1, 1)
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.СрокДействия < &СрокДействия
	               |	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = ЗНАЧЕНИЕ(Перечисление.CW_ВидыСтатейПланирования.Расходы)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СрокДействия"; 
	
	Запрос.УстановитьПараметр("Владелец", 	  Объект.Ссылка);
	Запрос.УстановитьПараметр("СрокДействия", Объект.СрокДействия);
	
	РезультатЗапроса = Запрос.Выполнить();    
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Отказ 		= Истина;
		Результат.СрокДействия 	= Выборка.СрокДействия;
	КонецЕсли;  
	
	Возврат Результат;
	
КонецФункции

 &НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере() 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаСреза, Валюта = &Валюта) КАК КурсыВалютСрезПоследних"; 
	
	Запрос.УстановитьПараметр("ДатаСреза", 	ТекущаяДата());
	Запрос.УстановитьПараметр("Валюта", 	Объект.Валюта); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.Курс		 = Выборка.Курс;
		Объект.Кратность = Выборка.Кратность;
	КонецЕсли;

	УстановитьВидимостьКурсаКратности();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКурсаКратности()
	
	Элементы.Курс.Видимость = Не Объект.Валюта.Пустая() и Объект.Валюта <> ВалютаРегламентированногоУчета;
	Элементы.Кратность.Видимость = Не Объект.Валюта.Пустая() и Объект.Валюта <> ВалютаРегламентированногоУчета;

КонецПроцедуры



#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти