#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// при вводе на основании расходов
Функция Услуги_СформироватьПоДокументуДоходов(Документ,Договор) Экспорт 
	// --- 
	
	Ответ = _сф.ст_Создать("ТаблицаУслуг,Продавец,Код,Предупреждение");
	Ответ.Код=0;
	Ответ.Предупреждение="";
	
	// если документ не проведен, то предупреждаем
	Если НЕ Документ.Проведен Тогда
		
		Ответ.Код=1;
		Ответ.Предупреждение="Для ввода на основании документа в условных единицах документ должен быть проведен."; 
		Возврат(Ответ);
		
	Иначе
		
		ТаблицаУслуг = Документ.Услуги.Выгрузить();
		CW_Финансы.ДобавитьКолонкиБазовойВалюты(ТаблицаУслуг);
		// --- 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	CW_ДоходыПоГрузоперевозкам.НомерСтроки КАК НомерСтроки,
		               |	CW_ДоходыПоГрузоперевозкам.Всего КАК Всего_Рег,
		               |	CW_ДоходыПоГрузоперевозкам.Сумма КАК Сумма_Рег,
		               |	CW_ДоходыПоГрузоперевозкам.НДС КАК НДС_Рег
		               |ИЗ
		               |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
		               |ГДЕ
		               |	CW_ДоходыПоГрузоперевозкам.Регистратор = &Регистратор
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСтроки";
		Запрос.УстановитьПараметр("Регистратор", Документ);
		ТЗ = Запрос.Выполнить().Выгрузить();
		// --- 
		Если (ТЗ.Количество() <> 0) Тогда
			Для Индекс=0 По ТаблицаУслуг.Количество()-1 Цикл
				
				ЗаполнитьЗначенияСвойств(ТаблицаУслуг[Индекс],ТЗ[Индекс]);
				
			КонецЦикла; 
		КонецЕсли; 
		//
		// определяем продавца
		Продавец = Неопределено;
		ТЗ_Перевыставление = ТаблицаУслуг.Скопировать(Новый Структура("ПорядокОтражения",Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление));
		Если (ТЗ_Перевыставление.Количество() = ТаблицаУслуг.Количество()) Тогда
			// проверяем продавца
			Для каждого Стр Из ТЗ_Перевыставление Цикл
				ПродавецПоСтроке = Неопределено;		
				Если (НЕ Стр.ДокументРасходов.Продавец.Пустая()) Тогда
					ПродавецПоСтроке = Стр.ДокументРасходов.Продавец;
				Иначе
					ПродавецПоСтроке = Стр.ДокументРасходов.Контрагент;
				КонецЕсли; 
				Если (Продавец = Неопределено) Тогда
					Продавец = ПродавецПоСтроке;
				Иначе
					Если (ПродавецПоСтроке <> Продавец) Тогда
						Продавец = Неопределено;
						Прервать;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла; 
			
		КонецЕсли; 
		
		Ответ.Продавец = Продавец;
		Ответ.ТаблицаУслуг = ТаблицаУслуг;
		Возврат(Ответ);
		
	КонецЕсли; 
	
		// --- 
КонецФункции

// пересчет валютных сумм
Процедура Услуги_ПересчитатьИзВалютыРегламентированногоУчета(ТаблицаУслуг,СтруктураКурса) Экспорт  
	
	Для каждого Стр Из ТаблицаУслуг Цикл
		Стр.Всего = _сф.БезопасноРазделить(Стр.Всего_Рег * СтруктураКурса.Кратность,СтруктураКурса.Курс);
		Стр.НДС = _сф.БезопасноРазделить(Стр.НДС_Рег * СтруктураКурса.Кратность,СтруктураКурса.Курс);
		Стр.Сумма = Стр.Всего - Стр.НДС;
		Стр.Цена = _сф.БезопасноРазделить(Стр.Сумма,Стр.Количество);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если (ВидФормы = "ФормаСписка") Тогда
		
		СтандартнаяОбработка = Ложь;
		РежимПростойФормы = CW_Настройки.ПолучитьНастройкуПользователя(,"ПростаяФормаСпискаРасходов"); ;
		Если (РежимПростойФормы) Тогда
			ВыбраннаяФорма = "ФормаСпискаПростаяУправляемая";
		Иначе
			ВыбраннаяФорма = "ФормаСпискаУправляемая";
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// для документов Расходов смотрим на зачтённые авансы, причём только на списания с р/счёта
Функция ПолучитьТаблицу_ПлатёжноРасчётныеДокументы_дляСФ(РасходыСсылка, ЗачетАвансов=Неопределено) Экспорт 
	
	СтруктураОтвета = Новый Структура("Код, ОписаниеОшибки", 0, "");
	
	Если Неопределено=ЗачетАвансов Тогда 
		// передана только ссылка (подразумеваем, что документ проведён)
		з = Новый Запрос(
			"выбрать РАЗЛИЧНЫЕ 
			|	докРасходыЗачетАвансов.ДокументАванса.НомерВходящегоДокумента КАК НомерДокумента,
			|	докРасходыЗачетАвансов.ДокументАванса.ДатаВходящегоДокумента КАК ДатаДокумента
			|из 
			|	документ.CW_РасходыПоГрузоперевозке.ЗачетАвансов КАК докРасходыЗачетАвансов
			|где 
			|	докРасходыЗачетАвансов.Ссылка = &РасходыСсылка
			|	И докРасходыЗачетАвансов.ДокументАванса Ссылка Документ.СписаниеСРасчетногоСчета"
		);
	Иначе 
		// передана таб.часть ЗачетАвансов - это делаем перед записью документа, когда последние изменения ещё не записаны по ссылке 
		з = Новый Запрос(
			"ВЫБРАТЬ тз.ДокументАванса, тз.НомерСтроки ПОМЕСТИТЬ вт ИЗ &тзЗачетАвансов КАК тз;
			|выбрать РАЗЛИЧНЫЕ 
			|	вт.ДокументАванса.НомерВходящегоДокумента КАК НомерДокумента,
			|	вт.ДокументАванса.ДатаВходящегоДокумента КАК ДатаДокумента
			|из 
			|	вт КАК вт
			|где 
			|	вт.ДокументАванса Ссылка Документ.СписаниеСРасчетногоСчета"
		);
		з.УстановитьПараметр("тзЗачетАвансов", ЗачетАвансов.Выгрузить());
	КонецЕсли;		
	з.УстановитьПараметр("РасходыСсылка", РасходыСсылка);
	тз = з.Выполнить().Выгрузить();
	
	СтруктураОтвета.Вставить("ПлатёжноРасчётныеДокументы", тз);
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПолучитьСчетНаОплатуПоставщика(СсылкаНаДокумент) Экспорт
	
	Если СсылкаНаДокумент.СписокСчетов Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если СсылкаНаДокумент.ПредъявленСчет Тогда
		Возврат СсылкаНаДокумент.ВедомыйСчет;
	ИначеЕсли СсылкаНаДокумент.ПредъявленАкт Тогда
		Возврат ПолучитьСчетНаОплатуПоставщика(СсылкаНаДокумент.Счет);
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Ссылка <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.Ссылка.ПредставлениеДокумента;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

