#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем ДС Экспорт;
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = CW_Документы.ПрефиксОрганизации(Организация);	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// сбрасываем параметры, подлежащие определению для нового документа
	Ответственный = CW_Настройки.Пользователь();
	ЗачетАвансов.Очистить();
	ЗачетАвансовОЗ.Очистить();
	
	// учитываем опции, установленные у пользователя
	НП = CW_Настройки.ПолучитьНастройкиПользователя();
	УстанавливатьТекущееВремя = НП.ПриКопированниУстанавливатьТекущееВремя;
	Если (УстанавливатьТекущееВремя = Неопределено) Тогда
		УстанавливатьТекущееВремя = Ложь;
	КонецЕсли; 
	Если (УстанавливатьТекущееВремя) Тогда
		Дата = CW_Документы.РабочееВремя();
	КонецЕсли; 
	ОчищатьСведенияПервичныхДокументов = НП.ОчищатьСведенияОПервичныхДокументахПриКопированииРасходов;
	Если (ОчищатьСведенияПервичныхДокументов = Неопределено) Тогда
		ОчищатьСведенияПервичныхДокументов = Ложь;
	КонецЕсли;
	//СрокОплаты = Дата(1,1,1);
	//СрокОплатыОписание = "";
	Если (ОчищатьСведенияПервичныхДокументов) Тогда
		
		ПредъявленСчет = Ложь;
		НомерСчета = "";
		ДатаСчета = Дата(1,1,1);
		// --- 
		ПредъявленАкт = Ложь;
		НомерАкта = "";
		ДатаАкта = Дата(1,1,1);
		// --- 
		ПредъявленСФ = Ложь;
		НомерСФ = "";
		ДатаСФ = Дата(1,1,1);		
		
	КонецЕсли; 
	
	ПлатёжноРасчётныеДокументы.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если (ОбменДанными.Загрузка) Тогда Возврат; КонецЕсли;
	// --- 
	ПроверяемыеРеквизиты.Очистить();
	
	флОшибка = Ложь;
	МассивСообщений = Новый Массив;
	
	Для Каждого Стр Из Услуги Цикл
		
		Если CW_Настройки.ПолучитьНастройкуПользователя(, "ПроверятьНоменклатурнуюГруппу") Тогда
			Если НЕ ЗначениеЗаполнено(Стр.Номенклатура.НоменклатурнаяГруппа) Тогда
				флОшибка = Истина;
				МассивСообщений.Добавить("У номенклатуры в строке " + Стр.НомерСтроки + " отсутствует номенклатурная группа!");
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если флОшибка Тогда
		Для Каждого Стр Из МассивСообщений Цикл
			Сообщить(Стр, СтатусСообщения.Внимание);
		КонецЦикла; 
		
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"СтатусПроведенияДоПроведения", Проведен);
	
	//Для версии КОРП 
	ВестиУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для версии КОРП 
	
	// обмен данными
	Если (ОбменДанными.Загрузка) Тогда
		Возврат; 
	КонецЕсли;
	
	// не перепроводим при восстановлении последовательности
	ВосстановлениеПоследовательности = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ПроведенВХронологическойПоследовательности");
	Если (ВосстановлениеПоследовательности <> Неопределено) Тогда
		Если (ВосстановлениеПоследовательности) Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	// контроль наличия общих параметров
	Если (НЕ ЗаполненыОбщиеПараметры()) Тогда 
		СформироватьОбщиеПараметры(,Ложь); 
	КонецЕсли; 
	
	// если изменились даты начала ведения учета, то обновим соответствующие флаги
	// (при условии того, что в документе указана организация и договор)
	ВводОстатковБУ = Ложь;
	ВводОстатковОЗ = Ложь;
	
	// фиксируем режим записи
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"РежимЗаписи",РежимЗаписи);
	
	
	// сформируем представление
	СформироватьПредставлениеДокумента();
	
	// фиксируем сумму Всего и сумму НДС
	Если (НЕ Корректировка) Тогда
		СуммаДокумента 	= _сф.Итог(Услуги,"Всего");
		СуммаНДС		= _сф.Итог(Услуги,"НДС");	
	Иначе
		пСуммаДокумента = 0;
		пСуммаНДС = 0;
		
		Для каждого Стр Из Услуги Цикл
			_сф.Инкремент(пСуммаДокумента,Стр.Всего - Стр.Всего_ДоКорректировки);
			_сф.Инкремент(пСуммаНДС,Стр.НДС - Стр.НДС_ДоКорректировки);
		КонецЦикла; 
		
		СуммаДокумента = пСуммаДокумента;
		СуммаНДС = пСуммаНДС;
	КонецЕсли; 
	
	// ответственный
	_сф.УстановитьЕслиНезаполнено(Ответственный,CW_Настройки.Пользователь()); 
	
	// Контроль срока договора / приложения   
	СтруктураПараметров = CW_Документы.ПустаяСтруктураКонтроляСрокаДействияДоговора(); 
	СтруктураПараметров.КонтролироватьСрокДоговоров 	= ДС.НП.КонтролироватьСрокДоговоров;
	СтруктураПараметров.КонтролироватьСрокПриложения 	= ДС.НП.КонтролироватьСрокДействияПриложения; 
	
	CW_Документы.ПроверитьСрокДействияДоговора(ЭтотОбъект, СтруктураПараметров, Отказ);
	
	// для подстановки последнего договора записываем его в регистр
	CW_Документы.ЗаписатьПоследнийДоговор(Договор);
	
	// аналогично по строкам таб.части
	ТаблицаДоговоровКлиентов = _сф.т_СкопироватьСвернуть(Услуги.Выгрузить(),"ДоговорПокупателя");
	Для Каждого СтрокаДоговора Из ТаблицаДоговоровКлиентов Цикл
		CW_Документы.ЗаписатьПоследнийДоговор(СтрокаДоговора.ДоговорПокупателя);
	КонецЦикла;
 
	// синхронизация времени счета
	Если (ПредъявленСчет) Тогда
		Если (НачалоДня(ДатаСчета)=НачалоДня(Дата)) Тогда
			ДатаСчета = Дата;
		КонецЕсли; 	
	КонецЕсли; 
	
	//Подсистема.СтатусыДокументов
	СтатусДокумента = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента", СтатусДокумента);
	
	СтатусДокументаПроводитьПоБухгалтерскомуУчету = CW_СтатусыДокументовСервер.ПолучитьПризнакПроведенияПоБухгалтерскомуУчету(Ссылка, СтатусДокумента);
	//Подсистема.СтатусыДокументов
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор",					Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	
	ПровестиПоБухгалтерскомуУчету = ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет и СтатусДокументаПроводитьПоБухгалтерскомуУчету;
	
	// если статус документа "Не принимать к учету"
	Если Не ПровестиПоБухгалтерскомуУчету Тогда 
		Возврат; 
	КонецЕсли; 
	
	// перезаполняем счета задолженности
	СтруктураСчетов = CW_Финансы.СтруктураСчетовРасчетов_Поставщики(Дата,Организация);
	ЕстьПеревыставление = Ложь;
	ЕстьСобственные = Ложь;
	Для каждого Стр Из Услуги Цикл
		
		Если (НЕ СписокСчетов) Тогда
			Стр.Счет = Неопределено;
		КонецЕсли; 
		
		Стр.СчетЗадолженности = CW_Финансы.ОпределитьСчетУчетаРасходов(Стр,СтруктураСчетов,Валюта <> ДС.КО.ВалютарегламентированногоУчета,Договор.ВзаиморасчетыВУЕ);
		
		Если Стр.СтатьяЗатрат.Пустая() Тогда
			Стр.СтатьяЗатрат = Стр.Номенклатура.СтатьяЗатрат;
		КонецЕсли; 
		
		Если (Стр.ПорядокОтражения <> Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
			ЕстьПеревыставление = Истина;
		Иначе
			ЕстьСобственные = Истина;
		КонецЕсли;
		
	КонецЦикла; 
	
	#Область ПроверкаЗаполненияРеквизитов
		Если (НЕ ПометкаУдаления) Тогда
			
			КонтролироватьСтрокиСНулевойСуммой = CW_Настройки.ПолучитьНастройкуПользователя(,"КонтролироватьСтрокиСНулевойСуммой");
			
			// проверка реквизитов
			флОшибка = Ложь;
			МассивСообщений = Новый Массив;
			
			Если Организация.Пустая() Тогда
				
				флОшибка = Истина;
				МассивСообщений.Добавить("Не указана организация!");
				
			КонецЕсли; 
			Если Контрагент.Пустая() Тогда
				
				флОшибка = Истина;
				МассивСообщений.Добавить("Не указан контрагент!");
				
			КонецЕсли; 
			Если Договор.Пустая() Тогда
				
				флОшибка = Истина;
				МассивСообщений.Добавить("Не указан договор контрагента!");
				
			КонецЕсли; 
			
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				
				Если ПредъявленСчет Тогда
					
					Если СокрЛП(НомерСчета)="" Тогда
						
						флОшибка = Истина;
						МассивСообщений.Добавить("Не указан номер счета!");
						
					КонецЕсли;
					Если ДатаСчета = Дата(1,1,1) Тогда
						
						флОшибка = Истина;
						МассивСообщений.Добавить("Не указана дата счета!");
						
					КонецЕсли;
					
				КонецЕсли;
								
				СчетчикСтрок = 1;
				Для каждого Стр Из Услуги Цикл
					 Если Стр.Номенклатура.Пустая() Тогда
						флОшибка = Истина;
						МассивСообщений.Добавить("В строке №"+Строка(СчетчикСтрок)+" таблицы услуг не указана номенклатура услуги!");
					КонецЕсли;
					
					Если (Стр.Количество = 0) и КонтролироватьСтрокиСНулевойСуммой Тогда
						флОшибка = Истина;
						МассивСообщений.Добавить("В строке №"+Строка(СчетчикСтрок)+" таблицы услуг не указано количество!");
					КонецЕсли;
					Если (Стр.Цена = 0) и КонтролироватьСтрокиСНулевойСуммой Тогда
						флОшибка = Истина;
						МассивСообщений.Добавить("В строке №"+Строка(СчетчикСтрок)+" таблицы услуг не указана цена!");
					КонецЕсли;
					Если (Стр.Сумма = 0) и КонтролироватьСтрокиСНулевойСуммой Тогда
						флОшибка = Истина;
						МассивСообщений.Добавить("В строке №"+Строка(СчетчикСтрок)+" таблицы услуг не указана сумма!");
					КонецЕсли;
					Если Стр.СтавкаНДС.Пустая() Тогда
						флОшибка = Истина;
						МассивСообщений.Добавить("В строке №"+Строка(СчетчикСтрок)+" таблицы услуг не указана ставка НДС!");
					КонецЕсли;
					Если (Стр.НДС = 0) И 
						(Стр.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС) И
						(Стр.СтавкаНДС <> Перечисления.СтавкиНДС.НДС0) И 
						КонтролироватьСтрокиСНулевойСуммой 
						Тогда
						флОшибка = Истина;
						МассивСообщений.Добавить("В строке №"+Строка(СчетчикСтрок)+" таблицы услуг не указана сумма НДС!");
					КонецЕсли;
					Если (Стр.Всего = 0) И КонтролироватьСтрокиСНулевойСуммой Тогда
						флОшибка = Истина;
						МассивСообщений.Добавить("В строке №"+Строка(СчетчикСтрок)+" таблицы услуг не указана сумма всего!");
					КонецЕсли;
					
					_сф.Инкремент(СчетчикСтрок);
					
				КонецЦикла; 
				
			КонецЕсли; // для режима записи "Проведение" 
			
			// проверка корректности ввода остатков
			Если (ВводОстатковБУ) Тогда
				
				// проверяем, курс по взаиморасчетам
				Если Валюта <> CW_Настройки.ВалютаРегламентированногоУчета() И Договор.ВзаиморасчетыВУЕ И (КурсВзаиморасчетовБУ = 0) И
					(ПредъявленАкт Или ПредъявленСФ) 	
				Тогда
					флОшибка = Истина;
					МассивСообщений.Добавить("Не указан курс взаиморасчётов по бухгалтерскому учету!");				
				КонецЕсли;	
				
			КонецЕсли; 
			
			Если (ВводОстатковОЗ) Тогда
				
				// проверяем, курс по взаиморасчетам
				Если (СальдоВзаиморасчетовОЗ <> 0) И 
					(Валюта <> CW_Настройки.ВалютаРегламентированногоУчета()) И 
					(КурсВзаиморасчетовОЗ = 0) И
					(ПредъявленСчет)  	
				Тогда
					флОшибка = Истина;
					МассивСообщений.Добавить("Не указан курс ввода остатков для оперативного учета задолженности!");				
				КонецЕсли;	
				
			КонецЕсли; 
			
			// при наличии ошибок
			Если (флОшибка) Тогда
				Сообщить("Проверка перед записью " + ЭтотОбъект + " : ");
				
				Для каждого Стр Из МассивСообщений Цикл
					Сообщить(Стр,СтатусСообщения.Внимание);
				КонецЦикла; 
				
				Отказ = Истина;
				Возврат;
			КонецЕсли; 
			
		КонецЕсли; // проверка реквизитов для не помеченных на удаление документов
	#КонецОбласти 
	
	#Область ЗачетАвансов 
	
	// без бухгалтерского учета отключаем зачет авансов по бухгалтерии
	Если НЕ ПровестиПоБухгалтерскомуУчету Тогда
		
		СпособЗачетаАвансов=Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
		ЗачетАвансов.Очистить();
		
	КонецЕсли; 
	
	Если (НЕ ДС.УП.ОЗ) Тогда
		
		СпособЗачетаАвансовОЗ=Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
		ЗачетАвансовОЗ.Очистить();
		
	КонецЕсли; 
	
	Если (НЕ Корректировка) Тогда
		
		// заполнение ТЧ "ЗачетАвансаОЗ"
		Если (СпособЗачетаАвансовОЗ = Перечисления.СпособыЗачетаАвансов.Автоматически 
			И ДС.УП.ОЗ
			И РежимЗаписи=РежимЗаписиДокумента.Проведение
			И ПредъявленСчет) Тогда
			
			Если (НачалоДня(ДатаСчета) <> НачалоДня(Дата)) Тогда
				
				Сообщить("При ведении учета оперативной задолженности и автоматическом зачете авансов (ОУ) дата документа должна совпадать с датой счета");
				
			КонецЕсли; 
			
			ДатаПодбораАвансов = Новый Граница(МоментВремени(),ВидГраницы.Исключая);
			ЗаполнитьТаблицуАвансовОЗ(ДатаПодбораАвансов);
			
		ИначеЕсли (СпособЗачетаАвансовОЗ = Перечисления.СпособыЗачетаАвансов.НеЗачитывать) Тогда 
			ЗачетАвансовОЗ.Очистить();		 
		КонецЕсли; 
		
		// заполнение ТЧ "ЗачетАванса"
		Если СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически
			И РежимЗаписи=РежимЗаписиДокумента.Проведение 
			И ПредъявленАкт 
		Тогда
			
			Если (НачалоДня(ДатаАкта) <> НачалоДня(Дата)) Тогда
				Сообщить("При автоматическом зачете авансов (БУ) дата документа должна совпадать с датой акта");
			КонецЕсли; 
			
			ДатаПодбораАвансов = Новый Граница(ВедомыйДокумент.Дата,ВидГраницы.Исключая);
			ЗаполнитьТаблицуАвансов(ДатаПодбораАвансов);
			
		ИначеЕсли (СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать) Тогда 
			ЗачетАвансов.Очистить();		 
			
		КонецЕсли;	
		
		// заполнение таб.части "Платёжно-расчётные документы с/ф"
		Если ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.Автоматически 
			И РежимЗаписи=РежимЗаписиДокумента.Проведение 
			И ПредъявленСФ
		Тогда 
			Ответ = Документы.CW_РасходыПоГрузоперевозке.ПолучитьТаблицу_ПлатёжноРасчётныеДокументы_дляСФ(ЭтотОбъект.Ссылка, ЗачетАвансов);
			Если Ответ.Код = 0 Тогда
				ЭтотОбъект.ПлатёжноРасчётныеДокументы.Загрузить(Ответ.ПлатёжноРасчётныеДокументы);
			Иначе 
				Сообщить(Ответ.ОписаниеОшибки);
			КонецЕсли;
			
		ИначеЕсли ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.НеУчитывать Тогда  
			ЭтотОбъект.ПлатёжноРасчётныеДокументы.Очистить();
			
		КонецЕсли;
	КонецЕсли; 
	
	#КонецОбласти 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ) Экспорт
	
	// обмен данными
	Если (ОбменДанными.Загрузка) Тогда Возврат; КонецЕсли;
	Если (РучнаяКорректировка) Тогда Возврат; КонецЕсли; 
	
	// не перепроводим при восстановлении последовательности
	ВосстановлениеПоследовательности = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ПроведенВХронологическойПоследовательности");
	
	Если (ВосстановлениеПоследовательности <> Неопределено) Тогда
		Если (ВосстановлениеПоследовательности) Тогда
			
			Возврат;
			
		КонецЕсли; 
	КонецЕсли; 
	
	// контроль наличия общих параметров
	Если (НЕ ЗаполненыОбщиеПараметры()) Тогда СформироватьОбщиеПараметры(,Ложь); КонецЕсли; 
	
	// определяем, что делать с подчинённым документом
	РежимЗаписи = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"РежимЗаписи");
	
	//Подсистема.СтатусыДокументов
	ИспользуютсяСтатусыДокументов = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов");
	Если ИспользуютсяСтатусыДокументов И
		Не ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
		//В случае если используются статусы документа и проведение не из формы, тов ДС статуса нет
		ДанныеСтатуса = РегистрыСведений.CW_СтатусыДокументов.ПолучитьДанныеСтатусаДокумента(Ссылка);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СтатусДокумента", ДанныеСтатуса.СтатусДокумента);
	КонецЕсли;
	
	СтатусДокумента = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента", СтатусДокумента);
	
	СтатусДокументаПроводитьПоБухгалтерскомуУчету = CW_СтатусыДокументовСервер.ПолучитьПризнакПроведенияПоБухгалтерскомуУчету(Ссылка, СтатусДокумента);
	//Подсистема.СтатусыДокументов	
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор",					Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	
	ПровестиПоБухгалтерскомуУчету = ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет и СтатусДокументаПроводитьПоБухгалтерскомуУчету;
	
	// ЗАПИСЬ
	Если (РежимЗаписи = РежимЗаписиДокумента.Запись) Тогда
		ПроверитьСтатусВедомых();
	КонецЕсли;
	
	// ОТМЕНА ПРОВЕДЕНИЯ
	Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		Если (НЕ Корректировка) Тогда
			
			// проверяем возможность отмены проведения
			Если (НЕ ПроверитьЗакрытиеГрузоперевозок()) Тогда
				Сообщить("В документе присутствуют закрытие грузоперевозки. Операция отменена.",СтатусСообщения.Важное);
				Отказ = Истина;
				Возврат;
			КонецЕсли; 
		КонецЕсли; 
				
		ПроверитьСтатусВедомых();
		
		// удаляем движения
		Для каждого Набор Из Движения Цикл
			
			Набор.Прочитать();
			Набор.Очистить();
			
		КонецЦикла;
		Движения.Записать();
		
	КонецЕсли;
	
	// ПРОВЕДЕНИЕ
	Если (РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
		
		Счета = CW_Конфигурация.ПланСчетов(); 
		
		// опционально блокируем проведение по закрытым договорам
		Если (НЕ Корректировка И Договор.Закрыт И КонецДня(Договор.ДатаЗакрытия) < Дата) Тогда
			
			Отказ = Истина;
			Сообщить(Ссылка);
			Сообщить("Проведение документа позднее даты закрытия договора с контрагентом невозможно!");
			Возврат;
			
		КонецЕсли; 
		
		ОчищатьДвижения = Истина;
		// удаляем собственные движения	
		Если (ПредъявленАкт ИЛИ ПредъявленСФ) И ПровестиПоБухгалтерскомуУчету Тогда
			
			Если (НЕ Корректировка) Тогда
				ПроверяемыйДокумент = ВедомыйДокумент;
			Иначе
				ПроверяемыйДокумент = ВедомыйДокументКорректировки;
			КонецЕсли; 
			
			Если (НЕ ПроверяемыйДокумент.РучнаяКорректировка) Тогда
				
				ОчищатьДвижения = Истина;
				
			Иначе 
				
				СтатусПроведенияДоПроведения = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"СтатусПроведенияДоПроведения",Ложь);
				Если (НЕ СтатусПроведенияДоПроведения) Тогда
					Сообщить(Ссылка);
					Сообщить("Ведомый документ содержит признак ручной корректировки. Проведение заблокировано.");
					Отказ = Истина;
					Возврат;
				Иначе	
					
					Сообщить("Внимание! У ведомого документа "+Строка(ПроверяемыйДокумент)+" установлен признак ручной корректировки движений!");
					ОчищатьДвижения = Ложь;
					// ничего не делаем
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если (ОчищатьДвижения) Тогда
			
			Для каждого Набор Из Движения Цикл
				
				Набор.Прочитать();
				Набор.Очистить();
				
			КонецЦикла;
			Движения.Записать();
			
		Иначе
			
			Возврат;
			
		КонецЕсли; 
		
		Если (НЕ Корректировка) Тогда
			
			//проверяем на ввод начальных остатков...
			ДатаНачалаВеденияУчета = CW_Настройки.ПолучитьДатуНачалаВеденияУчета(Организация);
			Если НЕ ДатаНачалаВеденияУчета = Неопределено Тогда
				РежимВводначальныхОстатков = Ложь;		
				Если Дата < ДатаНачалаВеденияУчета Тогда		
					РежимВводначальныхОстатков = Истина;
				Иначе
					РежимВводначальныхОстатков = Ложь;
				КонецЕсли;	
			Иначе
				РежимВводначальныхОстатков = Ложь;	
			КонецЕсли;
			Если РежимВводначальныхОстатков Тогда
				Если Договор.ВзаиморасчетыВУЕ Тогда
					
					ПроверятьКурс = Ложь;
					Для каждого Стр Из Услуги Цикл
						Если (Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление ИЛИ Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам) И Стр.ВводОстатков Тогда
							ПроверятьКурс = Истина;	
							Прервать;
						КонецЕсли; 
					КонецЦикла;
					
					Если ПроверятьКурс Тогда
						Если КурсВзаиморасчетовБУ = 0 Тогда
							Сообщить("Курс у.е. не заполнен! см.вкладу ""Дополнительно"".");
							Отказ = Истина;
							Возврат;
						КонецЕсли;	
					КонецЕсли; 
					
				КонецЕсли;	
			КонецЕсли; 
			
		КонецЕсли; 
		
		// заполняем ведомые
		Если (НЕ Корректировка) Тогда
			
			Если  ПровестиПоБухгалтерскомуУчету Тогда
				
				// ведомый счёт
				Если (ПредъявленСчет И ДС.УП.ФормироватьСчетаПоставщикаНаОплату) Тогда
					
					ВедомыйОбъект = ВедомыйСчет.ПолучитьОбъект();
					ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
					// --- 
					ВедомыйОбъект.Организация = Организация;
					ВедомыйОбъект.Дата =?(ФормироватьВедомыеДатойДокумента,Дата,ДатаСчета);
					ВедомыйОбъект.Контрагент = Контрагент;
					ВедомыйОбъект.ДоговорКонтрагента = ПараметрыБухгалтерскогоУчета.УчетныйДоговор;
					ВедомыйОбъект.ВалютаДокумента = ПараметрыБухгалтерскогоУчета.УчетныйДоговор.ВалютаВзаиморасчетов;
					// --- 
					РасчетныйСчет = ДС.ПД.РасчетныйСчет;
					Если (НЕ ЗначениеЗаполнено(РасчетныйСчет)) Тогда
						ВедомыйОбъект.БанковскийСчетКонтрагента = Неопределено;
					Иначе
						ВедомыйОбъект.БанковскийСчетКонтрагента = РасчетныйСчет;
					КонецЕсли;
					// --- 
					ВедомыйОбъект.НомерВходящегоДокумента = НомерСчета;
					ВедомыйОбъект.ДатаВходящегоДокумента = ДатаСчета;
					// --- 
					ВедомыйОбъект.СуммаВключаетНДС = Ложь;
					ВедомыйОбъект.СуммаДокумента = Услуги.Итог("Всего");
					// --- 
					ЕстьТовары = (Документы.СчетНаОплатуПоставщика.ПустаяСсылка().Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено);
					Если (ЕстьТовары) Тогда
						
						ВедомыйОбъект.Товары.Очистить();
						Для каждого СтрокаУслуги Из Услуги Цикл
							
							Нстр = ВедомыйОбъект.Товары.Добавить();
							Нстр.Номенклатура = СтрокаУслуги.Номенклатура;
							Нстр.Содержание = СокрЛП(СтрокаУслуги.Представление);
							Нстр.СтавкаНДС = СтрокаУслуги.СтавкаНДС;
							Нстр.Количество = СтрокаУслуги.Количество;
							Нстр.Цена = СтрокаУслуги.Цена;
							Нстр.Сумма = СтрокаУслуги.Сумма;
							Нстр.СуммаНДС = СтрокаУслуги.НДС;
							
						КонецЦикла; 
						
					Иначе
						ВедомыйОбъект.Услуги.Очистить();
						Для каждого СтрокаУслуги Из Услуги Цикл
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							Нстр.Номенклатура = СтрокаУслуги.Номенклатура;
							Нстр.Содержание = СокрЛП(СтрокаУслуги.Представление);
							Нстр.СтавкаНДС = СтрокаУслуги.СтавкаНДС;
							Нстр.Количество = СтрокаУслуги.Количество;
							Нстр.Цена = СтрокаУслуги.Цена;
							Нстр.Сумма = СтрокаУслуги.Сумма;
							Нстр.СуммаНДС = СтрокаУслуги.НДС;
						КонецЦикла; 
					КонецЕсли; 
					
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъект);
					ВедомыйОбъект.ОбменДанными.Загрузка = Ложь;
					ВедомыйОбъект.Записать(РежимЗаписи);
					
					// Если для целей оперативного учета задолженности документ проводится в режиме ввода остатков,
					// то принудительно пропишем статус ведомого счета (при проведении в обычном режиме статус не прописываем,
					// т.к. он будет определен типовой конфигурацией на момент записи документа)
					СтруктураНастроек = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Организация,Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская, Дата);
					
					Если СтруктураНастроек["ВедетсяОперативныйУчет"] Тогда
						РежимВводНачальныхОстатков = СтруктураНастроек["ВводОстатков"];
						Если РежимВводНачальныхОстатков Тогда
							
							// статус оплаты
							СтатусОплаты = Перечисления.СтатусОплатыСчета.НеОплачен;
							Если СальдоВзаиморасчетовОЗ <= 0 Тогда
								СтатусОплаты = Перечисления.СтатусОплатыСчета.Оплачен;
							Иначе
								Если СальдоВзаиморасчетовОЗ < Услуги.Итог("Всего") Тогда
									СтатусОплаты = Перечисления.СтатусОплатыСчета.ОплаченЧастично;
								КонецЕсли; 
							КонецЕсли; 
							
							// статус отгрузки
							СтатусОтгрузки = ?(ПредъявленАкт,Перечисления.СтатусыОтгрузки.Отгружен,Перечисления.СтатусыОтгрузки.НеОтгружен);
							
							МассивДокументов = Новый Массив;
							МассивДокументов.Добавить(ВедомыйОбъект.Ссылка);
							
							// пишем в регистр
							СтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
							СтатусыДокумента.Статус            		= СтатусОплаты;
							СтатусыДокумента.ДополнительныйСтатус	= СтатусОтгрузки;
							РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокументов(МассивДокументов, СтатусыДокумента);
						КонецЕсли; // это режим ввода остатков 
					КонецЕсли; // по организации ведется учет оперативной задолженности
					
				// формировать счет не требуется	
				Иначе
					Если (НЕ ВедомыйСчет.Пустая()) Тогда
						
						ПометитьНаУдаление(ВедомыйСчет);
						
					КонецЕсли; 
				КонецЕсли; // требуется формировать счет 
				
				//ведомые акт и счёт-фактура
				Если (ПредъявленАкт ИЛИ ПредъявленСФ) Тогда
					
					ВедомыйОбъект = ВедомыйДокумент.ПолучитьОбъект();
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ЗависимоеПроведение",Истина);
					
					НоваяДата = ?(ФормироватьВедомыеДатойДокумента,Дата,?(ПредъявленАкт,ДатаАкта,ДатаСФ));
					
					//ВедомыйОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент(); // тмп
					ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
					ВедомыйОбъект.Организация = Организация;
					ВедомыйОбъект.Дата = НоваяДата;
					
					ВедомыйОбъект.ЭтоУниверсальныйДокумент = ЭтоУниверсальныйДокумент;
					
					Если (ПредъявленАкт) Тогда
						НомерВходящего = НомерАкта;
						ДатаВходящего = ДатаАкта;
					Иначе
						НомерВходящего = НомерСФ;
						ДатаВходящего = ДатаСФ;
					КонецЕсли; 
					
					ВедомыйОбъект.НомерВходящегоДокумента = НомерВходящего;
					ВедомыйОбъект.ДатаВходящегоДокумента = ДатаВходящего;
					ВедомыйОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
					ВедомыйОбъект.Контрагент = Контрагент;
					ВедомыйОбъект.ДоговорКонтрагента = ПараметрыБухгалтерскогоУчета.УчетныйДоговор;
					ВедомыйОбъект.СуммаВключаетНДС = Ложь;
					ВедомыйОбъект.СчетНаОплатуПоставщика = Документы.CW_РасходыПоГрузоперевозке.ПолучитьСчетНаОплатуПоставщика(Ссылка);
					//ВедомыйОбъект.НДСВключенВСтоимость = НДСВключатьВСтоимость;
					//ВедомыйОбъект.НДСНеВыделять = НДСВключатьВСтоимость;
					ВедомыйОбъект.ВалютаДокумента = Валюта;
					ВедомыйОбъект.Ответственный = Ответственный;
					ВедомыйОбъект.Комментарий = "Сформировано автоматически (CW) документом ""Расходы по грузоперевозке"" №"+Строка(Номер)+" от "+Формат(Дата,"ДФ=dd.MM.yyyy");
					
					Если (Валюта = ДС.КО.ВалютаРегламентированногоУчета) Тогда
						ВедомыйОбъект.КурсВзаиморасчетов = 1;
						ВедомыйОбъект.КратностьВзаиморасчетов = 1;
					Иначе
						
						Если УЕ_ПользовательскийКурс Тогда
							СК = Новый Структура("Курс,Кратность",УЕ_Курс,УЕ_Кратность);
						Иначе
							СК = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(НоваяДата, Новый Структура("Валюта", Валюта));
						КонецЕсли; 
						//Если ДополнительныеСвойства.УП.УчитыватьКурсыВалютАвансовДляБазыНДС
						//	И ЗачетАвансов.Количество()>0
						//Тогда 
						//	СК = ПриведённыйКурсСУчётомВалютныхАвансов(СК);
						//КонецЕсли;
						// --- 
						ВедомыйОбъект.КурсВзаиморасчетов = СК.Курс;
						ВедомыйОбъект.КратностьВзаиморасчетов = СК.Кратность;
					КонецЕсли;	
					
					СчетУчетаСПоставщиком = ДС.УП.СчетРасчетов_Поставщики_Рубли;
					СчетУчетСПоставщикомВВалюте = ДС.УП.СчетРасчетов_Поставщики_Валюта;
					СчетУчетСПоставщикомВУЕ = ДС.УП.СчетРасчетов_Поставщики_УЕ;
					
					Если (Валюта = ДС.КО.ВалютаРегламентированногоУчета) Тогда
						Если СчетУчетаСПоставщиком.Родитель = Счета.РасчетыСПоставщикамиИПодрядчиками Тогда			
							ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = СчетУчетаСПоставщиком; // 60.01
							ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = Счета.РасчетыПоАвансамВыданным; // 60.02
						Иначе
							ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = СчетУчетаСПоставщиком; 
							ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = СчетУчетаСПоставщиком;
						КонецЕсли;
					Иначе
						Если Договор.ВзаиморасчетыВУЕ Тогда
							Если СчетУчетаСПоставщиком.Родитель = Счета.РасчетыСПоставщикамиИПодрядчиками Тогда			
								ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = Счета.РасчетыСПоставщикамиУЕ; // 62.31
								ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = Счета.РасчетыПоАвансамВыданнымУЕ; // 62.32
							Иначе
								ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = СчетУчетСПоставщикомВУЕ; 
								ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = СчетУчетСПоставщикомВУЕ;
							КонецЕсли;
						ИначеЕсли СчетУчетСПоставщикомВВалюте.Родитель = Счета.РасчетыСПоставщикамиИПодрядчиками Тогда			
							ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = СчетУчетСПоставщикомВВалюте; // 
							ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = Счета.РасчетыПоАвансамВыданнымВал; // 60.02
						Иначе
							ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом = СчетУчетСПоставщикомВВалюте; 
							ВедомыйОбъект.СчетУчетаРасчетовПоАвансам = СчетУчетСПоставщикомВВалюте;
						КонецЕсли;
					КонецЕсли;	
					
					// способ зачета авансов переопределяется в подписке
					ВедомыйОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
					ОсновноеПодразделение = ДС.УП.ОсновноеПодразделение;
					
					// определим, требуется ли заполнение колонки для УСН
					ТребуетсяЗаполнениеОтраженияВУСН = (ДС.УП.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная 
														или ДС.УП.СистемаНалогообложения = Перечисления.СистемыНалогообложения.АУСН)
														И ДС.УП.ОбъектНалогообложенияУСН = Перечисления.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы;

					Если ДС.УП.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная
						или ДС.УП.СистемаНалогообложения = Перечисления.СистемыНалогообложения.АУСН Тогда
						ВедомыйОбъект.НДСВключенВСтоимость = Истина;
					КонецЕсли; 
					
					//Если (ДС.УП.РаздельныйУчетНДСНаСчете19) Тогда
					//	
					//	Запрос = Новый Запрос;
					//	Запрос.Текст = "ВЫБРАТЬ
					//	|	CW_СоответствиеНоменклатурныхГруппСпособамУчетаНДССрезПоследних.НоменклатурнаяГруппа,
					//	|	CW_СоответствиеНоменклатурныхГруппСпособамУчетаНДССрезПоследних.СпособУчетаНДС
					//	|ИЗ
					//	|	РегистрСведений.CW_СоответствиеНоменклатурныхГруппСпособамУчетаНДС.СрезПоследних(&Период, Организация = &Организация) КАК CW_СоответствиеНоменклатурныхГруппСпособамУчетаНДССрезПоследних";
					//	Запрос.УстановитьПараметр("Организация", Организация);
					//	Запрос.УстановитьПараметр("Период", НачалоДня(ДатаВходящего)); 
					//	ТЗС = Запрос.Выполнить().Выгрузить();
					//	СоответствиеСпособаУчетаНДС = _сф.со_Создать("НоменклатурнаяГруппа","СпособУчетаНДС",ТЗС);
					//	
					//КонецЕсли; 
					
					ЕстьЗатраты = Ложь;
					ЕстьПеревыставление = Ложь;
					ГруппировкаЗатратПоПодразделениям = ДС.УП.ГруппировкаЗатратПоПодразделениям;
					
					Если (ПараметрыБухгалтерскогоУчета.УчетныйДоговор.УчетАгентскогоНДС) Тогда
						ВедомыйОбъект.СуммаВключаетНДС = Ложь;
					КонецЕсли; 
					
					ВедомыйОбъект.Услуги.Очистить();
					ВедомыйОбъект.АгентскиеУслуги.Очистить();
					
					Для каждого СтрТЧ Из Услуги Цикл
						
						// получаем вид деятельности статьи затрат:
						ВидДеятельностиНУ = СтрТЧ.СтатьяЗатрат.ВидДеятельностиДляНалоговогоУчетаЗатрат;
						
						// затраты
						Если СтрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты Тогда 
							
							ЕстьЗатраты = Истина;
							
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							Нстр.Номенклатура = СтрТЧ.Номенклатура;
							Нстр.Содержание = СокрЛП(СтрТЧ.Представление);
							Нстр.Количество = СтрТЧ.Количество;
							Нстр.Цена = СтрТЧ.Цена;
							Нстр.СуммаНДС = СтрТЧ.НДС;
							
							Если (НЕ ПараметрыБухгалтерскогоУчета.УчетныйДоговор.УчетАгентскогоНДС) Тогда
								Нстр.СтавкаНДС = СтрТЧ.СтавкаНДС;
								Нстр.Сумма = СтрТЧ.Сумма;
							Иначе
								
								// для собственных накручиваем 18% (20%) сверху
								Нстр.Сумма 		= СтрТЧ.Всего;
								
								Нстр.СтавкаНДС 	= CW_БухгалтерияЭкспедитораДляРоссииСервер.СтавкаНДСПоВидуСтавки(Перечисления.ВидыСтавокНДС.Общая, ВедомыйОбъект.дата);
								СтавкуНДСЧислом = CW_Финансы.ПолучитьКоэффициентСтавкиНДС(Перечисления.ВидыСтавокНДС.Общая, ВедомыйОбъект.дата);
								Нстр.СуммаНДС 	= Нстр.Сумма * СтавкуНДСЧислом;
								//Если ВедомыйОбъект.дата < '20190101' тогда
								//	Нстр.СтавкаНДС 	= Перечисления.СтавкиНДС.НДС18;
								//	Нстр.СуммаНДС 	= Нстр.Сумма * 0.18;
								//Иначе
								//	Нстр.СтавкаНДС 	= Перечисления.СтавкиНДС.НДС20;
								//	Нстр.СуммаНДС 	= Нстр.Сумма * 0.20;
								//КонецЕсли;
								
								Нстр.Цена 		= Нстр.Сумма/Нстр.Количество;
							КонецЕсли;
							
							Нстр.СчетЗатрат = Счета.ОсновноеПроизводство; // 20.01
							Нстр.СчетЗатратНУ = Счета.ОсновноеПроизводство; // 20.01
							Нстр.Субконто1 = СтрТЧ.Номенклатура.НоменклатурнаяГруппа;
							Нстр.Субконто2 = СтрТЧ.СтатьяЗатрат;
							Нстр.СубконтоНУ1 = СтрТЧ.Номенклатура.НоменклатурнаяГруппа;
							Нстр.СубконтоНУ2 = СтрТЧ.СтатьяЗатрат;
							Нстр.СчетУчетаНДС = Счета.НДСпоПриобретеннымУслугам; // 19.04
							Нстр.ПодразделениеЗатрат = ОсновноеПодразделение;
							
							Если (ГруппировкаЗатратПоПодразделениям) Тогда
								Если (ЗначениеЗаполнено(СтрТЧ.Подразделение)) Тогда
									Нстр.ПодразделениеЗатрат = СтрТЧ.Подразделение;
								КонецЕсли; 
							КонецЕсли; 
							
							Если (ДС.УП.РаздельныйУчетНДСНаСчете19) Тогда
								Если (НЕ СтрТЧ.СпособУчетаНДС.Пустая()) Тогда
									Нстр.СпособУчетаНДС = СтрТЧ.СпособУчетаНДС;
								Иначе
									СтруктураПараметров = Новый Структура;
									СтруктураПараметров.Вставить("Дата"					, Дата);
									СтруктураПараметров.Вставить("Организация"			, Организация);
									СтруктураПараметров.Вставить("Номенклатура"			, Нстр.Номенклатура);
									СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, Нстр.Номенклатура.НоменклатурнаяГруппа);
									
									Нстр.СпособУчетаНДС = CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров, Ложь);
								КонецЕсли;	
							КонецЕсли; 
							
							Если ТребуетсяЗаполнениеОтраженияВУСН Тогда
								Если ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения Тогда
									Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.Принимаются;
								ИначеЕсли ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения Тогда 
									Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.НеПринимаются;
								ИначеЕсли ВидДеятельностиНУ=Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты Тогда 
									Нстр.ОтражениеВУСН=Перечисления.ОтражениеВУСН.Распределяются;
								КонецЕсли; 
							КонецЕсли; 
						КонецЕсли;
						
						// перевыставление 
						Если СтрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление ИЛИ СтрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам Тогда // процент
							
							ЕстьПеревыставление = Истина;
							
							Нстр = ВедомыйОбъект.АгентскиеУслуги.Добавить();
							Нстр.Номенклатура = СтрТЧ.Номенклатура;
							Нстр.Содержание = СокрЛП(СтрТЧ.Представление);
							Нстр.Количество = СтрТЧ.Количество;
							Нстр.Цена = СтрТЧ.Цена;
							Нстр.СуммаНДС = СтрТЧ.НДС;
							
							Если (НЕ ПараметрыБухгалтерскогоУчета.УчетныйДоговор.УчетАгентскогоНДС) Тогда
								Нстр.СтавкаНДС = СтрТЧ.СтавкаНДС;
								Нстр.Сумма = СтрТЧ.Сумма;
							Иначе
								//Нстр.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
								//// --- 
								//Нстр.Сумма = СтрТЧ.Всего;
								//Нстр.СуммаНДС = Нстр.Сумма*0.18;
								//Нстр.Цена = Нстр.Сумма/Нстр.Количество;
								
								Нстр.СтавкаНДС = СтрТЧ.СтавкаНДС;
								Нстр.Сумма = СтрТЧ.Сумма;
							КонецЕсли; 
							
							Нстр.Контрагент = СтрТЧ.Покупатель;
							АгентскийДоговорКонтрагента = СтрТЧ.ДоговорПокупателя.АгентскийДоговорНаЗакупку;
							
							Если (НЕ ЗначениеЗаполнено(АгентскийДоговорКонтрагента)) Тогда
								СтруктураДоговора = Новый Структура;
								СтруктураДоговора.Вставить("Договор", 				СтрТЧ.ДоговорПокупателя); 
								СтруктураДоговора.Вставить("ПриложениеКДоговору", 	ПредопределенноеЗначение("Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка")); 
								
								АгентскийДоговорКонтрагента = CW_Финансы.СоздатьАгентскийДоговор(СтруктураДоговора); 
							КонецЕсли; 
							
							Нстр.ДоговорКонтрагента = АгентскийДоговорКонтрагента;
							
							ВалютныйДоговор = АгентскийДоговорКонтрагента.Валютный;
							ОплатаВВалюте = АгентскийДоговорКонтрагента.ОплатаВВалюте;
							
							Если (стрТЧ.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление) Тогда
								Если (НЕ ВалютныйДоговор) Тогда
									Нстр.СчетРасчетов = Счета.РасчетыСПрочимиПоставщикамиИПодрядчиками; // 76.05
								Иначе
									Если (ОплатаВВалюте) Тогда
										Нстр.СчетРасчетов = Счета.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал; // 76.25
									Иначе
										Нстр.СчетРасчетов = Счета.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ; // 76.35
									КонецЕсли; 
								КонецЕсли; 
							Иначе 
								Если (НЕ ВалютныйДоговор) Тогда
									Нстр.СчетРасчетов = Счета.РасчетыСПрочимиПокупателямиИЗаказчиками; // 76.06
								Иначе
									Если (ОплатаВВалюте) Тогда
										Нстр.СчетРасчетов = Счета.РасчетыСПрочимиПокупателямиИЗаказчикамиВал; // 76.26
									Иначе
										Нстр.СчетРасчетов = Счета.РасчетыСПрочимиПокупателямиИЗаказчикамиУЕ; // 76.36
									КонецЕсли; 
								КонецЕсли;
							КонецЕсли;
						КонецЕсли; 
					КонецЦикла; 
					
					// устанавливаем свойства для обработки в подписках
					ВедомыйОбъект.ДополнительныеСвойства.Вставить("Постановление735", ДС.УП.ТребованияПостановления735);
					ВедомыйОбъект.ДополнительныеСвойства.Вставить("УчитыватьКурсыВалютАвансовДляБазыНДС", ДополнительныеСвойства.УП.УчитыватьКурсыВалютАвансовДляБазыНДС);
					
					ВедомыйОбъект.ОбменДанными.Загрузка = Ложь;
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъект);
					
					// при записи документа отработают подписки и скорректируются движения 
					// в зависимости от логики дополнительного модуля 
					ВедомыйОбъект.Записать(РежимЗаписи);
				Иначе
					Если (НЕ ВедомыйДокумент.Пустая()) Тогда
						ПометитьНаУдаление(ВедомыйДокумент);
					КонецЕсли;
				КонецЕсли;	
				
			// по договору не ведется бухгалтерский учет или принимать к учету не требуется	
			Иначе
				Если (НЕ ВедомыйСчет.Пустая()) Тогда
					ПометитьНаУдаление(ВедомыйСчет);
				КонецЕсли; 
				Если (НЕ ВедомыйДокумент.Пустая()) Тогда
					ПометитьНаУдаление(ВедомыйДокумент);
				КонецЕсли; 
			КонецЕсли; // по договору не ведется бухгалтерский учет и статус документа предполагает проведение по учету
		КонецЕсли; // это не корректировка 
		
		Если (Корректировка) Тогда
			
			Если ПровестиПоБухгалтерскомуУчету Тогда
				
				Если (ПредъявленАкт) Тогда
					
					ВедомыйОбъект = ВедомыйДокументКорректировки.ПолучитьОбъект();
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
					_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ЗависимоеПроведение",Истина);
					// --- 
					
					//ВедомыйОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент(); // тмп
					//ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
					// --- 
					ВедомыйОбъект.Организация = Организация;
					ВедомыйОбъект.Дата = Дата;
					ВедомыйОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение; 
					
					ВедомыйОбъект.ЭтоУниверсальныйДокумент = ЭтоУниверсальныйДокумент;
					
					// ---
					ВедомыйОбъект.КорректироватьБУиНУ = Истина;
					ВедомыйОбъект.КорректироватьНДС = Истина;
					// --- 
					ВедомыйОбъект.ДокументПоступления = ?(КорректируемыйДокумент.Корректировка,КорректируемыйДокумент.ВедомыйДокументКорректировки,КорректируемыйДокумент.ВедомыйДокумент); // или исправляемый ?
					// --- 
					ВедомыйОбъект.НомерВходящегоДокумента = НомерАкта;
					ВедомыйОбъект.ДатаВходящегоДокумента = ДатаАкта;
					// --- 
					ВедомыйОбъект.НомерИсходногоДокумента = КорректируемыйДокумент.НомерАкта;
					ВедомыйОбъект.ДатаИсходногоДокумента = КорректируемыйДокумент.ДатаАкта;
					// --- 
					ВедомыйОбъект.НомерИсправления = 1; // TODO
					ВедомыйОбъект.ДатаИсправления = Дата;
					// --- 
					ВедомыйОбъект.СтатьяПрочихДоходовИРасходов = ДС.УП.СтатьяПрочихДоходовИРасходовДляКорректировок;
					// --- 
					ВедомыйОбъект.Контрагент = Контрагент;
					ВедомыйОбъект.ДоговорКонтрагента = ПараметрыБухгалтерскогоУчета.УчетныйДоговор;
					ВедомыйОбъект.ВалютаДокумента = Валюта;
					// --- 
					ВедомыйОбъект.Услуги.Очистить();
					ВедомыйОбъект.АгентскиеУслуги.Очистить();
					// --- 
					ИндексСтрокиСобственных = 0;
					ИндексСтрокиАгентских = 0;
					
					Если КорректируемыйДокумент.Корректировка Тогда
						ТаблицаУслугСобственных = КорректируемыйДокумент.ВедомыйДокументКорректировки.Услуги.Выгрузить();
						ТаблицаУслугАгентских 	= КорректируемыйДокумент.ВедомыйДокументКорректировки.АгентскиеУслуги.Выгрузить();
					Иначе
						ТаблицаУслугСобственных = КорректируемыйДокумент.ВедомыйДокумент.Услуги.Выгрузить();
						ТаблицаУслугАгентских 	= КорректируемыйДокумент.ВедомыйДокумент.АгентскиеУслуги.Выгрузить();
					КонецЕсли;
					// --- 
					Для каждого Стр Из Услуги Цикл
						
						Если (Стр.ПорядокОтражения = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) Тогда
							
							Нстр = ВедомыйОбъект.Услуги.Добавить();
							// --- 
							Нстр.ЕстьВДокументеПоступления = Истина;
							Нстр.Номенклатура = Стр.Номенклатура;
							// --- 
							Нстр.СодержаниеДоИзменения = СокрЛП(Стр.Представление_ДоКорректировки);
							Нстр.Содержание = СокрЛП(Стр.Представление);
							// --- 
							Нстр.КоличествоДоИзменения = Стр.Количество_ДоКорректировки;
							Нстр.Количество = Стр.Количество;
							// --- 
							Нстр.ЦенаДоИзменения = Стр.Цена_ДоКорректировки;
							Нстр.Цена = Стр.Цена;
							// --- 
							Нстр.СуммаДоИзменения = Стр.Сумма_ДоКорректировки;
							Нстр.Сумма = Стр.Сумма;
							// --- 
							Нстр.СтавкаНДСДоИзменения = Стр.СтавкаНДС;
							Нстр.СтавкаНДС = Стр.СтавкаНДС;
							// --- 
							Нстр.СуммаНДСДоИзменения = Стр.НДС_ДоКорректировки;
							Нстр.СуммаНДС = Стр.НДС;
							
							// остальные реквизиты берём из соответствующей строки ведомого корректируемого документа
							СтрокаДокументаПоступления = ТаблицаУслугСобственных[ИндексСтрокиСобственных];
							_сф.Инкремент(ИндексСтрокиСобственных);
							// --- 
							ЗаполнитьЗначенияСвойств(Нстр,СтрокаДокументаПоступления,"СчетЗатрат,ПодразделениеЗатрат,Субконто1,Субконто2,Субконто3,СчетЗатратНУ,СубконтоНУ1,СубконтоНУ2,СубконтоНУ3,СчетУчетаНДС,ОтражениеВУСН,СпособУчетаНДС");
							
						Иначе
							
							Нстр = ВедомыйОбъект.АгентскиеУслуги.Добавить();
							// --- 
							Нстр.ЕстьВДокументеПоступления = Истина;
							Нстр.Номенклатура = Стр.Номенклатура;
							// --- 
							Нстр.СодержаниеДоИзменения = СокрЛП(Стр.Представление_ДоКорректировки);
							Нстр.Содержание = СокрЛП(Стр.Представление);
							// --- 
							Нстр.КоличествоДоИзменения = Стр.Количество_ДоКорректировки;
							Нстр.Количество = Стр.Количество;
							// --- 
							Нстр.ЦенаДоИзменения = Стр.Цена_ДоКорректировки;
							Нстр.Цена = Стр.Цена;
							// --- 
							Нстр.СуммаДоИзменения = Стр.Сумма_ДоКорректировки;
							Нстр.Сумма = Стр.Сумма;
							// --- 
							Нстр.СтавкаНДСДоИзменения = Стр.СтавкаНДС_ДоКорректировки;
							Нстр.СтавкаНДС = Стр.СтавкаНДС;
							// --- 
							Нстр.СуммаНДСДоИзменения = Стр.НДС_ДоКорректировки;
							Нстр.СуммаНДС = Стр.НДС;
							
							СтрокаДокументаПоступления = ТаблицаУслугАгентских[ИндексСтрокиАгентских];
							_сф.Инкремент(ИндексСтрокиАгентских);
							// --- 
							ЗаполнитьЗначенияСвойств(Нстр,СтрокаДокументаПоступления,"СчетРасчетов,Контрагент,ДоговорКонтрагента");
							
							
							
						КонецЕсли; 
						
					КонецЦикла; 
					
					// --- 
					ВедомыйОбъект.ОбменДанными.Загрузка = Ложь;
					// --- 
					CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъект);
					// --- 
					ВедомыйОбъект.Записать(РежимЗаписи);
					
					
				КонецЕсли; 
								
			Иначе
				
				Если (НЕ ВедомыйДокументКорректировки.Пустая()) Тогда
					
					ПометитьНаУдаление(ВедомыйДокументКорректировки);
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// контроль загрузки
	Если (ОбменДанными.Загрузка) Тогда 
		Возврат; 
	КонецЕсли;
	Если (РучнаяКорректировка) Тогда 
		Возврат; 
	КонецЕсли; 
	
	// не перепроводим при восстановлении последовательности
	ВосстановлениеПоследовательности = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ПроведенВХронологическойПоследовательности");
	Если (ВосстановлениеПоследовательности <> Неопределено) Тогда
		Если (ВосстановлениеПоследовательности) Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	// контроль наличия общих параметров
	CW_БухгалтерияЭкспедитораСервер.УстановитьОбщиеПараметрыПроведенияДокументов();

	Если НЕ ЗаполненыОбщиеПараметры() Тогда 
		СформироватьОбщиеПараметры(,Ложь); 
	КонецЕсли; 
	
	//Подсистема.СтатусыДокументов
	ИспользуютсяСтатусыДокументов = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяСтатусыДокументов");
	Если ИспользуютсяСтатусыДокументов И
		Не ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
		//В случае если используются статусы документа и проведение не из формы, тов ДС статуса нет
		ДанныеСтатуса = РегистрыСведений.CW_СтатусыДокументов.ПолучитьДанныеСтатусаДокумента(Ссылка);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СтатусДокумента", ДанныеСтатуса.СтатусДокумента);
	КонецЕсли;
	
	СтатусДокумента = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусДокумента", СтатусДокумента);
	
	СтатусДокументаПроводитьПоБухгалтерскомуУчету = CW_СтатусыДокументовСервер.ПолучитьПризнакПроведенияПоБухгалтерскомуУчету(Ссылка, СтатусДокумента);
	//Подсистема.СтатусыДокументов	
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор",					Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	
	ПровестиПоБухгалтерскомуУчету = ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет и СтатусДокументаПроводитьПоБухгалтерскомуУчету;
	
	// контроль статуса
	Если Не ПровестиПоБухгалтерскомуУчету Тогда
		
		// очищаем движения
		Для каждого НаборДвижений Из Движения Цикл
			НаборДвижений.Очистить();
		КонецЦикла; 
		Возврат;
	КонецЕсли; 
	
	// для счетов и ОУ
	Если НЕ (ПредъявленАкт ИЛИ ПредъявленСФ) ИЛИ НЕ ПровестиПоБухгалтерскомуУчету Тогда
		Если (НЕ Корректировка) Тогда
			CW_Подписки.СформироватьДвиженияДляРасходовПоПриобретениям(Ссылка,Отказ,ДополнительныеСвойства);
		Иначе
		//	CW_Подписки.СформироватьДвиженияДляКорректировкиРасходов(Ссылка,Отказ,ДополнительныеСвойства);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроверитьСтатусВедомых()
	
	Если (НЕ Корректировка) Тогда
		Если (НЕ ВедомыйДокумент.Пустая()) Тогда
			Если (ПредъявленАкт) Тогда
				СинхронизироватьПометкуУдаления(ВедомыйДокумент);
			Иначе
				ПометитьНаУдаление(ВедомыйДокумент);
			КонецЕсли; 
		КонецЕсли; 
		
		Если (НЕ ВедомыйСчет.Пустая()) Тогда
			Если (ПредъявленСчет) Тогда
				СинхронизироватьПометкуУдаления(ВедомыйСчет);
			Иначе
				ПометитьНаУдаление(ВедомыйСчет);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Если (Корректировка) Тогда
		Если (НЕ ВедомыйДокументКорректировки.Пустая()) Тогда
			Если (ПредъявленАкт) Тогда
				СинхронизироватьПометкуУдаления(ВедомыйДокументКорректировки);
			Иначе
				ПометитьНаУдаление(ВедомыйДокументКорректировки);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура СинхронизироватьПометкуУдаления(Документ)
	
	Если (Документ.ПометкаУдаления <> ПометкаУдаления) Тогда
		
		ВедомыйОбъект = Документ.ПолучитьОбъект();
		_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
		ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПометитьНаУдаление(Документ)
	// --- 
	
	Если (Документ.ПометкаУдаления <> Истина) Тогда
		
		ВедомыйОбъект = Документ.ПолучитьОбъект();
		_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
		ВедомыйОбъект.УстановитьПометкуУдаления(Истина);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

Процедура СформироватьОбщиеПараметры(Знач СписокПараметров = Неопределено,ИнтерактивныйРежим = Истина) Экспорт 
	// получаем параметры договора и константы, помещаем в доп. свойства
	
	CW_ОбщиеПараметры.СформироватьОбщиеПараметры(ЭтотОбъект,СписокПараметров,ИнтерактивныйРежим);
	ДС = ДополнительныеСвойства;
	
КонецПроцедуры

// проверка общих параметров
Функция ЗаполненыОбщиеПараметры() Экспорт 
	// --- 
	
	Возврат(CW_ОбщиеПараметры.ОбщиеПараметрыЗаполнены(ЭтотОбъект));
	
	// --- 
КонецФункции

Процедура ЗаполнитьТаблицуАвансов(ДатаПодбораАвансов) Экспорт 
	// --- 
	
	ЗаполнитьАвансы(ДатаПодбораАвансов,Истина, Ложь);

	// --- 
КонецПроцедуры

Процедура ЗаполнитьТаблицуАвансовОЗ(ДатаПодбораАвансов) Экспорт 
	// --- 
	
	ЗаполнитьАвансы(ДатаПодбораАвансов,Ложь,Истина);
	
	// --- 
КонецПроцедуры

Процедура ЗаполнитьАвансы(ДатаПодбораАвансов,БУ,ОЗ)
	// --- 
	
	Если (БУ) Тогда
		
		ТЧ = ЗачетАвансов;
		
	Иначе
		
		ТЧ = ЗачетАвансовОЗ;
		
	КонецЕсли; 
	
	ДС = ДополнительныеСвойства;
	Счета = CW_Конфигурация.ПланСчетов();
	// --- 
	ТЧ.Очистить();
	// --- 	
	УслугиПоПорядкуОтражения = Услуги.Выгрузить();
	УслугиПоПорядкуОтражения.Свернуть("ПорядокОтражения", "Всего");
	// --- 
	// определяем счета авансов
	Если (Валюта = ДС.КО.ВалютаРегламентированногоУчета) Тогда
		
		СчетРасчетов = ДС.УП.СчетРасчетов_Поставщики_Рубли;
		Если СчетРасчетов = Счета.РасчетыСПоставщиками Тогда
			
			СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданным;						
			СчетАвансовПоВозмещаемым = Счета.РасчетыПоАвансамВыданным;
			
		КонецЕсли; 
		
	Иначе
		
		// Валюта
		Если (НЕ Договор.ВзаиморасчетыВУЕ) Тогда
			СчетРасчетов = ДС.УП.СчетРасчетов_Поставщики_Валюта;
			Если СчетРасчетов = Счета.РасчетыСПоставщикамиВал Тогда
				СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданнымВал;						
				СчетАвансовПоВозмещаемым = Счета.РасчетыПоАвансамВыданнымВал;
			КонецЕсли;
		КонецЕсли;
		
		// УЕ
		Если (Договор.ВзаиморасчетыВУЕ) Тогда
			СчетРасчетов = ДС.УП.СчетРасчетов_Поставщики_УЕ;
			Если СчетРасчетов = Счета.РасчетыСПоставщикамиУЕ Тогда
				СчетАвансовПоСобственным = Счета.РасчетыПоАвансамВыданнымУЕ;						
				СчетАвансовПоВозмещаемым = Счета.РасчетыПоАвансамВыданнымУЕ;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если (Истина) Тогда
		
		ПараметрыТА = Новый Структура("Дата,Договор,ПриложениеКДоговору,ОЗ,РаздельныйУчетЗаполженност,Акт,ПереплатаКакАванс");
		// --- 
		ПараметрыТА.Дата = ДатаПодбораАвансов;
		ПараметрыТА.Договор = Договор;
		ПараметрыТА.ОЗ = ДС.УП.ОЗ;
		ПараметрыТА.Акт = Ссылка;
		
		ПараметрыТА.РаздельныйУчетЗаполженности = ДС.УП.РаздельныйУчетОперативнойИБухгалтерскойЗадолженности;
		ПараметрыТА.ПереплатаКакАванс 			= ДС.УП.УчитыватьПереплатыПоДокументамКакАванс;		
		// --- 
		ТЗ_Услуги = Услуги.Выгрузить();
		Если (ПараметрыТА.ОЗ) Тогда
			Если (НЕ СписокСчетов) Тогда
				Если (ЗначениеЗаполнено(Счет)) Тогда
					ТЗ_Услуги.ЗаполнитьЗначения(Счет,"Счет");
				Иначе
					ТЗ_Услуги.ЗаполнитьЗначения(Ссылка,"Счет");
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		Если (БУ) Тогда
			ТаблицаАвансов = CW_Финансы.ТаблицаАвансов(ПараметрыТА,ТЗ_Услуги,ТЧ.Выгрузить(),ЗачетАвансовОЗ.Выгрузить());	
		ИначеЕсли (ОЗ) Тогда 
			ТаблицаАвансов = CW_Финансы.ТаблицаАвансовДляОЗ(ПараметрыТА,ТЗ_Услуги,ТЧ.Выгрузить());	
		КонецЕсли; 
		
		ТолькоПоПлатежкамСчетов = ПараметрыТА.ОЗ и НЕ ПараметрыТА.РаздельныйУчетЗаполженности;
		//ДС.ПД.АвтоматическиЗачитыватьТолькоПлатежкиПоСчету;
		
		// --- 
		СуммаАванса = _сф.Итог(ТаблицаАвансов,"Аванс");
		СуммаРаспределения = _сф.Итог(УслугиПоПорядкуОтражения,"Всего");
		ОстатокРаспределения = Мин(СуммаРаспределения,СуммаАванса);
		ОстаткиЗачетаПоАктированию = Новый СписокЗначений;
		Для каждого Стр Из ТаблицаАвансов Цикл
			
			Если ОстатокРаспределения <= 0 Тогда
				Прервать; 
			КонецЕсли;
			
			Если (БУ И ТолькоПоПлатежкамСчетов И Стр.ПризнакОплатыСчетовДокумента <> Истина) Тогда
				Продолжить;
			КонецЕсли; 
			
			Нстр = ТЧ.Добавить();
			// --- 
			Нстр.ДокументАванса = Стр.ДокументАванса;
			Нстр.ДокументОплаты = Стр.ДокументОплаты;
			Нстр.СчетАванса = Стр.СчетАванса;
			Нстр.СчетЗадолженности = Стр.СчетЗадолженности;
			// --- 
			Если (БУ) Тогда
				Нстр.Счет = Стр.Счет;
				Если (ТолькоПоПлатежкамСчетов) Тогда
					ОстатокЗадолженности = ОстаткиЗачетаПоАктированию.НайтиПоЗначению(Стр.Счет);
					Если (ОстатокЗадолженности = Неопределено) Тогда
						ОстатокЗадолженности = ОстаткиЗачетаПоАктированию.Добавить(Стр.Счет, Формат(Стр.Задолженность,"ЧН=; ЧГ="));
					КонецЕсли;
					НезачтенноеАктированноеСальдо = Число(ОстатокЗадолженности.Представление);
					Нстр.СуммаЗачета = Мин(ОстатокРаспределения,Стр.Аванс,НезачтенноеАктированноеСальдо);
					ОстатокЗадолженности.Представление = Формат(НезачтенноеАктированноеСальдо-Нстр.СуммаЗачета,"ЧН=; ЧГ=");
				Иначе
					Нстр.СуммаЗачета = Мин(ОстатокРаспределения,Стр.Аванс);
				КонецЕсли; 
			Иначе
				Нстр.СуммаЗачета = Мин(ОстатокРаспределения,Стр.Аванс);
			КонецЕсли; 
			// --- 
			_сф.Декремент(ОстатокРаспределения,Нстр.СуммаЗачета);
			Если (Нстр.СуммаЗачета = 0) Тогда
				ТЧ.Удалить(Нстр);
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
	
	// сформируем текстовое представление платежки в ТЧ зачета авансов
	// ---------------------------------------------------------------------------- 
	Для Каждого Стр Из ТЧ Цикл
		
		Попытка
			
			Если (БУ) Тогда
				
				Если НЕ Стр.ДокументАванса.НомерВходящегоДокумента = "" Тогда
					ВхНомер = Строка(Стр.ДокументАванса.НомерВходящегоДокумента);
				Иначе
					ВхНомер = "";
				КонецЕсли;	
				
				Если НЕ Стр.ДокументАванса.ДатаВходящегоДокумента = Дата("00010101") Тогда
					ВхДата = Строка(Формат(Стр.ДокументАванса.ДатаВходящегоДокумента,"ДФ=dd.MM.yyyy"));
				Иначе
					ВхДата = "";
				КонецЕсли;
				
				Если ВхНомер = "" ИЛИ ВхДата = "" Тогда
					Стр.ПредставлениеДокументаАванса = "Не задан!" ;
				Иначе
					Стр.ПредставлениеДокументаАванса = "№" + ВхНомер + " от " + ВхДата;
				КонецЕсли;	 
				
			ИначеЕсли (ОЗ) Тогда 
				
				Стр.ПредставлениеДокументаАванса = Стр.ДокументОплаты.ПредставлениеДокумента;
				
			КонецЕсли; 
			
		Исключение
			
			Стр.ПредставлениеДокументаАванса = "№" + Строка(Стр.ДокументАванса.Номер) + " от " + Строка(Стр.ДокументАванса.Дата);
			
		КонецПопытки	
		
	КонецЦикла;	
	
	
	// --- 
КонецПроцедуры

Процедура СформироватьПредставлениеДокумента()
	// --- 
	
	стр = "";
	Если (Корректировка) Тогда
		
		Если ПредъявленСчет Тогда 
			стр = "Кор.счет №"+СокрЛП(НомерСчета)+" от "+Формат(ДатаСчета, "ДФ=dd.MM.yy"); 
		КонецЕсли;
		Если ПредъявленАкт Тогда 
			Если (ЗначениеЗаполнено(стр)) Тогда
				стр = стр + ";кор.а";
			Иначе
				стр = "Кор.а";
			КонецЕсли; 
			стр = стр+"кт №"+СокрЛП(НомерАкта)+" от "+Формат(ДатаАкта, "ДФ=dd.MM.yy");
		КонецЕсли;
		Если ПредъявленСФ Тогда 
			Если (ЗначениеЗаполнено(стр)) Тогда
				стр = стр + "; кор.с";
			Иначе
				стр = "Кор.с";
			КонецЕсли; 
			стр = стр + "/ф №"+СокрЛП(НомерСФ)+" от "+Формат(ДатаСФ, "ДФ=dd.MM.yy");
		КонецЕсли; 
		
	Иначе
		
		Если ПредъявленСчет Тогда 
			стр = "Счет №"+СокрЛП(НомерСчета)+" от "+Формат(ДатаСчета, "ДФ=dd.MM.yy"); 
		КонецЕсли;
		Если ПредъявленАкт Тогда 
			Если (ЗначениеЗаполнено(стр)) Тогда
				стр = стр + "; а";
			Иначе
				стр = "А";
			КонецЕсли; 
			стр = стр+"кт №"+СокрЛП(НомерАкта)+" от "+Формат(ДатаАкта, "ДФ=dd.MM.yy");
		КонецЕсли;
		Если ПредъявленСФ Тогда 
			Если (ЗначениеЗаполнено(стр)) Тогда
				стр = стр + "; с";
			Иначе
				стр = "С";
			КонецЕсли; 
			стр = стр + "/ф №"+СокрЛП(НомерСФ)+" от "+Формат(ДатаСФ, "ДФ=dd.MM.yy");
		КонецЕсли;

	КонецЕсли; 
		
	Если НЕ ЗначениеЗаполнено(стр) Тогда 
		стр = "<"+ЭтотОбъект+">";
	КонецЕсли;
	Если стр<>ПредставлениеДокумента Тогда 
		ПредставлениеДокумента = стр;
	КонецЕсли;	
	
	// --- 
КонецПроцедуры

Функция ПроверитьЗакрытиеГрузоперевозок() Экспорт 
	// --- 
	
	Возврат(CW_Мониторинг.ПроверитьЗакрытиеГрузоперевозок(ЭтотОбъект));
	
	// --- 
КонецФункции

Функция ПроверкаНомера(Документ, РежимЗаписи, Отказ) Экспорт
	
	Попытка
		Документ.Записать(РежимЗаписи);
	Исключение
		Сообщить(ОписаниеОшибки() + "Ведомый документ " + Документ + " записать не удалось!");
		
		Отказ = Истина;
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

Функция ВыполнитьАвтоматическийПодборСчетов(ВариантПодбора) Экспорт
	// --- 
	
	Объект = ЭтотОбъект;
	
	// настройки учетной политики 
	СтруктураНастроек = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Объект.Организация,Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская);
	
	ИспользуетсяОперативнаяЗадолженность 	= СтруктураНастроек["ВедетсяОперативныйУчет"];
	РежимВводначальныхОстатков_ОЗ 			= СтруктураНастроек["ВводОстатков"];
	
	НастройкиОперативногоУчета = СтруктураНастроек["НастройкиОперативногоУчета"];
	КонтрольНоменклатуры 		= НастройкиОперативногоУчета["КонтрольНоменклатуры"];
	КонтрольПорядкаОтражения	= НастройкиОперативногоУчета["КонтрольПорядкаОтражения"];
	КонтрольНДС 				= НастройкиОперативногоУчета["КонтрольНДС"];
	
	Если (НЕ ИспользуетсяОперативнаяЗадолженность) Тогда
		
		Возврат(_УФКС.Ответ(1,"Не используется оперативная задолжненность"));
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_АктированиеВходящихСчетовОстатки.Счет,
	               |	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток КАК Всего,
	               |	ЛОЖЬ КАК ЕстьСтроки,
	               |	CW_АктированиеВходящихСчетовОстатки.Грузоперевозка,
	               |	CW_АктированиеВходящихСчетовОстатки.Номенклатура,
	               |	CW_АктированиеВходящихСчетовОстатки.ПорядокОтражения,
	               |	CW_АктированиеВходящихСчетовОстатки.СтавкаНДС
	               |ИЗ
	               |	РегистрНакопления.CW_АктированиеВходящихСчетов.Остатки(
	               |			&Период,
	               |			Организация = &Организация
	               |				И Контрагент = &Контрагент
	               |				И Договор = &Договор
	               |				И Грузоперевозка = &Грузоперевозка
	               |				И ВЫБОР
	               |					КОГДА &Номенклатура = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ Номенклатура = &Номенклатура
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &ПорядокОтражения = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ПорядокОтражения = &ПорядокОтражения
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &СтавкаНДС = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ СтавкаНДС = &СтавкаНДС
	               |				КОНЕЦ) КАК CW_АктированиеВходящихСчетовОстатки
	               |ГДЕ
	               |	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток > 0";
	Если (ВариантПодбора = 0) Тогда
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Иначе
		Запрос.УстановитьПараметр("Период", Объект.ДатаАкта);
	КонецЕсли; 
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Договор", Объект.Договор); 
	// --- 
	ТЗУслуги = Объект.Услуги.Выгрузить();
	ТЗУслуги.Колонки.Добавить("СчетПодобран");
	ТЗУслуги.ЗаполнитьЗначения(Ложь,"СчетПодобран");
	
	// --- 
	
	ТаблицаОстатковАктирования = Неопределено;
	// --- 
	
	Для каждого СтрокаДокумента Из ТЗУслуги Цикл
		
		Запрос.УстановитьПараметр("Грузоперевозка", СтрокаДокумента.Грузоперевозка); 
		Запрос.УстановитьПараметр("Номенклатура", ?(КонтрольНоменклатуры,СтрокаДокумента.Номенклатура,Неопределено)); 	
		Запрос.УстановитьПараметр("ПорядокОтражения", ?(КонтрольПорядкаОтражения,СтрокаДокумента.ПорядокОтражения,Неопределено)); 	
		Запрос.УстановитьПараметр("СтавкаНДС", ?(КонтрольНДС,СтрокаДокумента.СтавкаНДС,Неопределено)); 	
		// --- 
		
		Отбор = Новый Структура;
		Отбор.Вставить("Грузоперевозка",СтрокаДокумента.Грузоперевозка);
		Если (КонтрольНоменклатуры) Тогда
			Отбор.Вставить("Номенклатура",СтрокаДокумента.Номенклатура);
		КонецЕсли; 
		Если (КонтрольПорядкаОтражения) Тогда
			Отбор.Вставить("ПорядокОтражения",СтрокаДокумента.ПорядокОтражения);
		КонецЕсли; 
		Если (КонтрольНДС) Тогда
			Отбор.Вставить("СтавкаНДС",СтрокаДокумента.СтавкаНДС);
		КонецЕсли; 
		
		// --- 
		
		ПоДаннымЗапроса = Ложь;
		
		Если (ТаблицаОстатковАктирования = Неопределено) Тогда
			ТЗ = Запрос.Выполнить().Выгрузить();
			ПоДаннымЗапроса = Истина;
			ТаблицаОстатковАктирования = ТЗ.СкопироватьКолонки();	
		Иначе
			// пробуем найти
			ТЗ = ТаблицаОстатковАктирования.НайтиСтроки(Отбор);
			Если (ТЗ.Количество() = 0) Тогда
				ТЗ = Запрос.Выполнить().Выгрузить();
				ПоДаннымЗапроса = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
		Если (ПоДаннымЗапроса) Тогда
			
			МассивУдаления = Новый Массив;
			Для каждого Стр Из ТЗ Цикл
				Если (Стр.Счет.Пустая()) Тогда
					МассивУдаления.Добавить(Стр);
				КонецЕсли; 
			КонецЦикла; 
			_сф.к_УдалитьЭлементыПоМассиву(ТЗ,МассивУдаления);
			
			// --- 
			
			// переносим в таблицу остатков
			Для каждого Стр Из ТЗ Цикл
				Нстр = ТаблицаОстатковАктирования.Добавить();
				ЗаполнитьЗначенияСвойств(Нстр,Стр);
			КонецЦикла; 
			
		КонецЕсли; 
		
		// --- 
		
		КоличествоСтрок = ТЗ.Количество();
		Если (КоличествоСтрок = 1) Тогда
			
			// подставляем счет
			Если (СтрокаДокумента.Всего <= ТЗ[0].Всего) Тогда
				
				СтрокаДокумента.Счет = ТЗ[0].Счет;
				СтрокаДокумента.СчетПодобран = Истина;
				// --- 
				_сф.Декремент(ТЗ[0].Всего,СтрокаДокумента.Всего);
				
			КонецЕсли; 
			
		ИначеЕсли (КоличествоСтрок > 1) Тогда 
			
			// анализируем, ищем строку
			СчетПодобран = Ложь;
			Для каждого СтрокаТЗ Из ТЗ Цикл
				
				Если (СчетПодобран) Тогда
					Прервать;
				КонецЕсли; 
				Отбор = Новый Структура("Грузоперевозка,Номенклатура",СтрокаДокумента.Грузоперевозка,СтрокаДокумента.Номенклатура);
				УдовлетворяющиеСтроки = _сф.к_НайтиСтроки(СтрокаТЗ.Счет.Услуги,Отбор);
				Если (УдовлетворяющиеСтроки.Количество()<>0) Тогда
					
					Для каждого Стр Из УдовлетворяющиеСтроки Цикл
						
						Если (Стр.Всего >= СтрокаДокумента.Всего) Тогда
							СтрокаТЗ.ЕстьСтроки = Истина;
						КонецЕсли; 
						
						Если (Стр.Всего = СтрокаДокумента.Всего) Тогда
							
							СтрокаДокумента.Счет = СтрокаТЗ.Счет;
							СтрокаДокумента.СчетПодобран = Истина;
							_сф.Декремент(СтрокаТЗ.Всего,СтрокаДокумента.Всего);
							СчетПодобран = Истина;
							Продолжить;
							
						КонецЕсли; 
						
					КонецЦикла; 
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			Если (НЕ СчетПодобран) Тогда
				
				// берем первую строку из таблицы с соответствующими строками
				ЕстьСтроки = Ложь;
				Для каждого Стр Из ТЗ Цикл
					
					Если (Стр.ЕстьСтроки) Тогда
						ЕстьСтроки = Истина;
						Прервать;
					КонецЕсли; 
					
				КонецЦикла; 
				
				Если (ЕстьСтроки) Тогда
					
					// подставляем счет
					Для каждого Стр Из ТЗ Цикл
						
						Если (Стр.ЕстьСтроки) Тогда
							
							Если (Стр.Всего >= СтрокаДокумента.Всего) Тогда
								
								СтрокаДокумента.Счет = Стр.Счет;
								СтрокаДокумента.СчетПодобран = Истина;	
								// --- 
								_сф.Декремент(Стр.Всего, СтрокаДокумента.Всего);
								
							КонецЕсли; 
							
						КонецЕсли; 
						
					КонецЦикла; 
					
				Иначе
					
					Если (ТЗ[0].Всего >= СтрокаДокумента.Всего) Тогда
						
						СтрокаДокумента.Счет = ТЗ[0].Счет;
						СтрокаДокумента.СчетПодобран = Истина;
						// --- 
						_сф.Декремент(ТЗ[0].Всего,СтрокаДокумента.Всего);
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// анализируем и переносим найденные счета в 
	КоличествоНеподобранных = ТЗУслуги.Скопировать(Новый Структура("СчетПодобран",Ложь)).Количество();
	
	КолонкаСчетов = ТЗУслуги.Скопировать(,"Счет");
	КолонкаСчетов.Свернуть("Счет");
	Счета = КолонкаСчетов.ВыгрузитьКолонку("Счет");
	
	Если (Счета.Количество()=1 И КоличествоНеподобранных = 0) Тогда
		
		Объект.СписокСчетов = Ложь;
		Объект.Счет = Счета[0];
		
	Иначе
		
		Объект.СписокСчетов = Истина;
		Объект.Счет = Документы.CW_ДоходыПоГрузоперевозке.ПустаяСсылка();
		// --- 
		// переносим в ТЧ
		ВТЧ = Объект.Услуги.Выгрузить();
		ВТЧ.ЗагрузитьКолонку(ТЗУслуги.ВыгрузитьКолонку("Счет"),"Счет");
		Объект.Услуги.Загрузить(ВТЧ);
		
	КонецЕсли; 
	// --- 
	ТекстСообщения = "";
	Если (КоличествоНеподобранных=0) Тогда
		ТекстСообщения = "Счета подобраны.";
	Иначе
		ТекстСообщения = "Для "+Строка(КоличествоНеподобранных)+" строк(и) подобрать счета не удалось.";
	КонецЕсли; 
	Ответ = _УФКС.Ответ(,ТекстСообщения);
	
	Возврат(Ответ);
	
	// --- 
КонецФункции

#КонецЕсли