&НаСервере
Функция ВыполнитьДействие(УФ, СтруктураДействия) Экспорт 
	
	ИмяКоманды = СтруктураДействия.Команда;
	Параметры = СтруктураДействия.Параметры;
	// ---
	Отладка = УФ.Отладка;
	Если (Отладка) Тогда
		Сообщить("Сервер: """+ИмяКоманды+"""");
	КонецЕсли; 
	// ---------------------------------------------------------------------------- 
	
	Если (ИмяКоманды = "/ВыполнитьДействие") Тогда 
		
		// если вдруг понадобится выполнить серверное действие с возвратом на клиента
		Возврат(Параметры);
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ИнициализацияФормы") Тогда 
		
		 НастройкаСсылка = _сф.ст_ПолучитьСвойство(Параметры,"НастройкаСсылка");
		 ИмяСеансовойНастройки = _сф.ст_ПолучитьСвойство(Параметры,"ИмяСеансовойНастройки");
		 Если (ЗначениеЗаполнено(ИмяСеансовойНастройки)) Тогда
		 	УФ.ИмяСеансовойНастройки = ИмяСеансовойНастройки;
		 КонецЕсли; 
		 // --- 
		 ИнициализацияФормы(УФ,Параметры);
		 //Инициализация(УФ,НастройкаСсылка,ИмяСеансовойНастройки,Параметры);
		 
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ИнициализацияНастроек") Тогда 
		
		Возврат(ИнициализацияНастроек(УФ,Параметры));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/УстановитьЗаголовкиКолонок") Тогда 
		
		 Возврат(УстановитьЗаголовкиКолонок(УФ));
		 
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/Обновить") Тогда 
		
		УФ.Журнал_РежимНастройки = Ложь;
		ОбновитьДанные(УФ);
		Возврат(_УФКС.СД("Журналы","клиент","/УстановитьТекстСтатуснойСтроки"));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОбновитьДанные") Тогда 
		 		
		 ОбновитьДанные(УФ, Параметры);
		 Если (Параметры <> Неопределено) Тогда
			Возврат(_УФКС.СД("Журналы","клиент","/ОповеститьОбИзменении",Параметры));	 
		 Иначе
			Возврат(Неопределено);	 
		 КонецЕсли; 
		 
	// ---------------------------------------------------------------------------- 	 
	ИначеЕсли (ИмяКоманды = "/ОбновитьДанныеПриИзмененииОтбора") Тогда 
		
		 ОбновитьДанныеПриИзмененииОтбора(УФ,Параметры);
		 Возврат(_УФКС.СД("Журналы","клиент","/УстановитьТекстСтатуснойСтроки"));
		 
	ИначеЕсли (ИмяКоманды = "/СортировкаКолонки") Тогда 
		
		ПорядокКУстановке = Параметры;
		СортировкаКолонки(УФ, ПорядокКУстановке);
		//Возврат(_УФКС.СД("Журналы","клиент","/УстановитьЗаголовкиКолонок"));
		Возврат(_УФКС.СД("Журналы","сервер","/УстановитьЗаголовкиКолонок"));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ПроверитьВозможностьПометкиУдаления") Тогда 
		
		Грузоперевозки = Параметры; 
		// --- 
		РезультатПроверки = ПроверитьВозможностьПометкиУдаления(Грузоперевозки);
		// --- 
		Если (_УФКС.ВыполненоУспешно(РезультатПроверки)) Тогда
			
			ВыполнитьДействие(УФ,_УФКС.СД("Журналы","сервер","/ИзменитьПометкуУдаления",Грузоперевозки));
			
		Иначе
			
			ТекстВопроса = _УФКС.ПредставлениеОшибки(РезультатПроверки);
			// --- 
			Возврат(_УФКС.СД("Журналы","клиент","/ДиалогПодтвержденияПометкиУдаления",Новый Структура("ТекстВопроса,Грузоперевозки",ТекстВопроса,Грузоперевозки)));
			
		КонецЕсли; 
	
	ИначеЕсли (ИмяКоманды = "/ИзменитьПометкуУдаления") Тогда 
		
		Грузоперевозки = Параметры; 
		Ответ = ИзменитьПометкуУдаления(Грузоперевозки);
		Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
			ВыполнитьДействие(УФ,_УФКС.СД("Журналы","сервер","/ОбновитьДанные",Грузоперевозки));
		Иначе
			Возврат(_УФКС.СД("Журналы","клиент","/Предупреждение","Ошибка изменения пометки удаления: "+_УФКС.ПредставлениеОшибки(Ответ)));
		КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ПроизвестиРедактирование") Тогда 
		
		Ответ = ПроизвестиРедактирование_ИзменениеДанных(Параметры.МассивСсылок, Параметры.ВидОперации, Параметры.СтруктураЗначения, Параметры.СписокВедомых, Параметры.СписокАдресовЗначенийПараметров);
		
		УФ.СписокАдресовЗначенийПараметров.Очистить();	
		
		Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
			Возврат(_УФКС.СД("Журналы","сервер","/ОбновитьДанные",Параметры.МассивСсылок));
			//ВыполнитьДействие(УФ,_УФКС.СД("Журналы","сервер","/ОбновитьДанные",Параметры.МассивСсылок));
		Иначе
			Возврат(_УФКС.СД("Журналы","клиент","/Предупреждение","Ошибка редактирования: "+_УФКС.ПредставлениеОшибки(Ответ)));
		КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОтборПоЗначению") Тогда 
		
		ОтборПоЗначению(УФ);
		Возврат(_УФКС.СД("Журналы","клиент","/УстановитьТекстСтатуснойСтроки"));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ОтборПоСпискуЗначенийПараметрыДиалога") Тогда 
		
		// Параметры - имя колонки
		Список = ВыгрузитьКолонкуДляОтбораПоСпискуЗначений(УФ,Параметры);
		Если (_сф.Количество(Список)=0) Тогда
			Возврат(_УФКС.СД("Журналы","клиент","/Предупреждение","Данные для отбора отсутствуют."));
		Иначе
			ПараметрыФормы = Новый Структура("Список,ИмяКолонки",Список,Параметры);
			Возврат(_УФКС.СД("Журналы","клиент","/ОтборПоСпискуЗначенийДиалог",ПараметрыФормы));	
		КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 	
	ИначеЕсли (ИмяКоманды = "/СброситьСортировку") Тогда 
		
		СброситьСортировку(УФ);
		//Возврат(_УФКС.СД("Журналы","клиент","/УстановитьЗаголовкиКолонок"));
		Возврат(_УФКС.СД("Журналы","сервер","/УстановитьЗаголовкиКолонок"));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/РежимЕкселя") Тогда 
		
		РежимРедактированияВключитьВыключить(УФ);
		Возврат(Неопределено);
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/НастройкаСписка") Тогда 
		
		Возврат(ПараметрыФормыНастройкиСписка(УФ));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/РаскраситьУстановкаЦветаИОформления") Тогда 
		
		 РаскраситьУстановкаЦветаИОформления(УФ, Параметры.МассивСсылок, Параметры.ЭлементСправочникаЦвета);
		 Возврат(Неопределено);
		 
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/СохранитьНастройку") Тогда 
		
		// Параметры - ссылка на настройку
		СохранитьНастройку_Сервер(УФ, Параметры);
		Возврат(Неопределено);
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ЗагрузитьНастройку") Тогда 
		
		Возврат(ЗагрузитьНастройку_Сервер(УФ, Параметры));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/СохранитьСеансовыеНастройки") Тогда 
		
		СохранитьСеансовыеНастройки(УФ,Параметры);
		Возврат(Неопределено); 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ВосстановитьНастройкуСписка") Тогда 
		
		Возврат(ВосстановитьНастройкуСписка(УФ, Параметры)); 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/УстановитьОтборПоСтатусам") Тогда 
		
		УстановитьЗаголовокЖурнала(УФ);
		ОбновитьСистемныйОтбор(УФ);
		// --- 
		// если не режим конструктора, то обновляем данные
		Если (НЕ УФ.Журнал_РежимНастройки) Тогда
			ОбновитьДанные(УФ);
			Возврат(_УФКС.СД("Журналы","клиент","/УстановитьТекстСтатуснойСтроки"));
		КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/УстановитьОтборПоФинансовымСтатусам") Тогда 
		
		УстановитьЗаголовокЖурнала(УФ);
		ОбновитьСистемныйОтбор(УФ);
		// --- 
		// если не режим конструктора, то обновляем данные
		Если (НЕ УФ.Журнал_РежимНастройки) Тогда
			ОбновитьДанные(УФ);
			Возврат(_УФКС.СД("Журналы","клиент","/УстановитьТекстСтатуснойСтроки"));
		КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ФинансовыйОтчетПараметры") Тогда 
		
		 Возврат(ПараметрыФормыФинансовогоОтчета(УФ));
		 
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ПодключитьГрузоперевозки") Тогда 
		
		Возврат(ПодключитьГрузоперевозки(УФ,Параметры)); 
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ДобавитьДинамическийПараметр") Тогда 
		
		Возврат(ДобавитьДинамическийПараметр(УФ,Параметры));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/УдалитьДинамическийПараметр") Тогда 
		
		Возврат(УдалитьДинамическийПараметр(УФ,Параметры));
		
	// ---------------------------------------------------------------------------- 
	ИначеЕсли (ИмяКоманды = "/ПересчитатьДинамическиеПараметры") Тогда 
		
		Возврат(ПересчитатьДинамическиеПараметры(УФ,Параметры));
		
	// ---------------------------------------------------------------------------- 	
	Иначе 
		
		Сообщить("Сервер: неизвестная команда """+ИмяКоманды+"""");
		Возврат(Неопределено);
		
	КонецЕсли;
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция ПроверитьВозможностьПометкиУдаления(МассивСсылок)
	// --- 
	
	СписокГрузоперевозок = Новый СписокЗначений;
	
	Для каждого Ссылка Из МассивСсылок Цикл
		
		Если (ТипЗнч(Ссылка) = Тип("СправочникСсылка.CW_Грузоперевозки")) Тогда
			
			ЕстьБюджет = Ложь;
			ЕстьРасходы = Ложь;
			ЕстьДоходы = Ложь;
			
			// ---------------------------------------------------------------------------- 
			
			Если (НЕ Ссылка.ПометкаУдаления) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка
				|ИЗ
				|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
				|ГДЕ
				|	CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ
				|	И CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец";
				Запрос.УстановитьПараметр("Владелец", Ссылка);
				// --- 
				ТЗ = Запрос.Выполнить().Выгрузить();
				Если (ТЗ.Количество() <> 0) Тогда
					
					// есть бюджеты
					ЕстьБюджет = Истина;
					
				КонецЕсли; 
				
				// ---------------------------------------------------------------------------- 
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка
				|ИЗ
				|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
				|ГДЕ
				|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка = &Грузоперевозка";
				Запрос.УстановитьПараметр("Грузоперевозка", Ссылка);
				// --- 
				ТЗ = Запрос.Выполнить().Выгрузить();
				Если (ТЗ.Количество() <> 0) Тогда
					
					// есть доходы
					ЕстьДоходы = Истина;
					
				КонецЕсли; 
				
				// ---------------------------------------------------------------------------- 
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				               |	CW_РасходыПоГрузоперевозкам.Грузоперевозка
				               |ИЗ
				               |	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
				               |ГДЕ
				               |	CW_РасходыПоГрузоперевозкам.Грузоперевозка = &Грузоперевозка";
				Запрос.УстановитьПараметр("Грузоперевозка", Ссылка);
				// --- 
				ТЗ = Запрос.Выполнить().Выгрузить();
				Если (ТЗ.Количество() <> 0) Тогда
					
					// есть расходы
					ЕстьРасходы = Истина;
					
				КонецЕсли; 
				
				Если (ЕстьБюджет ИЛИ ЕстьРасходы ИЛИ ЕстьДоходы) Тогда
					
					ПредставлениеДляГрузоперевозки = "";
					Если (ЕстьБюджет) Тогда
						
						ПредставлениеДляГрузоперевозки = "заполнен бюджет";
						
					КонецЕсли; 
					Если (ЕстьРасходы ИЛИ ЕстьДоходы) Тогда
						
						Если (ПредставлениеДляГрузоперевозки <> "") Тогда
							
							ПредставлениеДляГрузоперевозки = ПредставлениеДляГрузоперевозки +"; ";
							
						КонецЕсли; 
						ПредставлениеДляГрузоперевозки = ПредставлениеДляГрузоперевозки + "существуют документы";
						
					КонецЕсли; 
					СписокГрузоперевозок.Добавить(Ссылка, ПредставлениеДляГрузоперевозки);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если (СписокГрузоперевозок.Количество() = 0) Тогда
		
		Возврат(_УФКС.Ответ());
		
	Иначе
		
		ПредставлениеВопроса = "При проверке грузоперевозок обнаружено:";
		Для каждого ЭлементыСписка Из СписокГрузоперевозок Цикл
			
			ПредставлениеВопроса = ПредставлениеВопроса + Символы.ПС + Строка(ЭлементыСписка.Значение)+": "+ЭлементыСписка.Представление;
			
		КонецЦикла; 
		ПредставлениеВопроса = ПредставлениеВопроса + Символы.ПС + "Установить пометку удаления?";
		Ответ = _УФКС.Ответ(1,ПредставлениеВопроса);
		Возврат(Ответ);
		
	КонецЕсли; 
	
	// --- 
КонецФункции
 

&НаСервере
Функция ИзменитьПометкуУдаления(МассивСсылок)
	
	Попытка
		
		Для каждого Ссылка Из МассивСсылок Цикл
			РедактируемыйОбъект = Ссылка.ПолучитьОбъект();
			РедактируемыйОбъект.УстановитьПометкуУдаления(НЕ Ссылка.ПометкаУдаления);
		КонецЦикла; 
		
		Возврат(_УФКС.Ответ());
		
	Исключение
		
		Возврат(_УФКС.Ответ(1,ОписаниеОшибки()));
		
	КонецПопытки; 
	
КонецФункции

&НаСервере
Функция ПроизвестиРедактирование_ИзменениеДанных(МассивСсылок, ВидОперации, СтруктураЗначения, СписокВедомых=Неопределено, СписокАдресовЗначенийПараметров = Неопределено)
	// --- 
	
	ПроверятьБлокировкуМониторинга = Ложь;
	Если (МассивСсылок.Количество() <> 0) Тогда
		СсылкаДляТипа = МассивСсылок[0];
		Если (ТипЗнч(СсылкаДляТипа)=Тип("СправочникСсылка.CW_Грузоперевозки")) Тогда
			Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокировкиМониторинга")) Тогда
				ПроверятьБлокировкуМониторинга = Истина;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
	
	Для каждого Ссылка Из МассивСсылок Цикл
		
		Попытка
			
			Если (ПроверятьБлокировкуМониторинга) Тогда
				ДатаБлокировки = CW_Мониторинг.ПолучитьДатуЗакрытияМониторинга(Ссылка);
				Если (ЗначениеЗаполнено(ДатаБлокировки)) Тогда
					Сообщить("Грузоперевозка """+Строка(Ссылка.CW_Представление)+""" заблокирована.");
					Продолжить;
				КонецЕсли; 
			КонецЕсли; 
			
			МодОбъект = Ссылка.ПолучитьОбъект();
			МодОбъект.Заблокировать();
			
		Исключение
			
			Возврат(_УФКС.Ответ(1,"Ошибка блокировки записи. """+Строка(Ссылка)+""" заблокирован другим пользователем!"));
			
		КонецПопытки;
		
		Если ВидОперации = "Параметр" Тогда
			
			Попытка
				РежимОчистки = (_сф.ст_ПолучитьСвойство(СтруктураЗначения,"РежимОчистки")=Истина);
				
				//ИмяТЧ = CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(МодОбъект.Ссылка); 
				ИмяТЧ = CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(МодОбъект); 
				Если ИмяТЧ <> Неопределено Тогда
					
					Если ТипЗнч(СтруктураЗначения.Значение) <> Тип("Массив") Тогда
						МассивПараметров = Новый Массив;
						МассивПараметров.Добавить(СтруктураЗначения);
					Иначе
						МассивПараметров = СтруктураЗначения.Значение;
					КонецЕсли;
					
					Для Каждого мСтруктураЗначения из МассивПараметров Цикл
						СтрокаПараметра = _сф.к_НайтиСтроку(МодОбъект[ИмяТЧ],"Параметр",мСтруктураЗначения.Параметр);
						Если (СтрокаПараметра = Неопределено) Тогда
							Если (НЕ РежимОчистки) Тогда
								СтрокаПараметра = МодОбъект[ИмяТЧ].Добавить();
								СтрокаПараметра.Параметр = мСтруктураЗначения.Параметр;
							КонецЕсли; 
						КонецЕсли; 
						
						Если НЕ РежимОчистки Тогда
							
							Если мСтруктураЗначения.Примечание <> Неопределено Тогда
								
								СтрокаПараметра.Примечание = мСтруктураЗначения.Примечание;
								
							КонецЕсли; 
							
							Если СтрокаПараметра.Параметр.ЭтоКонтрольнаяДата Тогда
								
								Если мСтруктураЗначения.ЗначениеПлан <> Неопределено Тогда
									
									СтрокаПараметра.ЗначениеПлан = мСтруктураЗначения.ЗначениеПлан;
									
								КонецЕсли; 
								Если мСтруктураЗначения.ЗначениеФакт <> Неопределено Тогда
									
									СтрокаПараметра.ЗначениеФакт = мСтруктураЗначения.ЗначениеФакт;
									
								КонецЕсли; 
								СтрокаПараметра.Значение = ?(СтрокаПараметра.ЗначениеФакт <> Дата(1,1,1),СтрокаПараметра.ЗначениеФакт,СтрокаПараметра.ЗначениеПлан);
								
							Иначе
								
								Если мСтруктураЗначения.Значение <> Неопределено Тогда
									СтрокаПараметра.Значение = мСтруктураЗначения.Значение;
								КонецЕсли;    
								Если CW_МониторинговыеПараметрыСервер.ИспользуетсяСохранениеПолногоЗначения(мСтруктураЗначения.Параметр) Тогда
									СтрокаПараметра.ХранилищеДанных = Новый ХранилищеЗначения(мСтруктураЗначения.ПолноеЗначение);
								КонецЕсли;
								
							КонецЕсли; 
							
						Иначе
							
							Если СтрокаПараметра <> Неопределено Тогда
								СтрокаПараметра.Примечание = "";
								СтрокаПараметра.Значение = Неопределено;
								СтрокаПараметра.ЗначениеПлан = Дата(1,1,1);
								СтрокаПараметра.ЗначениеФакт = Дата(1,1,1);   
								СтрокаПараметра.ХранилищеДанных = Новый ХранилищеЗначения(Неопределено);
								
								мСтруктураЗначения.Вставить("ПараметрИзменен", Истина);   
							КонецЕсли; 
							
						КонецЕсли; 
						
						// очистка ведомых
						Если СписокВедомых <> Неопределено И мСтруктураЗначения.ПараметрИзменен Тогда
							
							Для каждого ВедомыйПараметр Из СписокВедомых Цикл
								
								СтрокаВедомого = _сф.к_НайтиСтроку(МодОбъект[ИмяТЧ],"Параметр",ВедомыйПараметр);
								Если СтрокаВедомого <>  Неопределено Тогда
									
									СтрокаВедомого.Значение = Неопределено;
									СтрокаВедомого.Примечание = "";
									
								КонецЕсли; 
								
							КонецЦикла; 
							
						КонецЕсли; 
						
					КонецЦикла; 
					
					Если СписокАдресовЗначенийПараметров <> Неопределено тогда
						Для Каждого ЭлементСписка из СписокАдресовЗначенийПараметров Цикл
							
							//ДанныеПоАдресу - тип "Структура("Параметр, ТаблицаДанных")
							ДанныеПоАдресу = ЭлементСписка.Значение;
							
							Отбор = Новый Структура("Параметр", ДанныеПоАдресу.Параметр);
							мСтроки = МодОбъект[ИмяТЧ].НайтиСтроки(Отбор);
							Если мСтроки.Количество() > 0 Тогда
								//Предполагаем что строка будет только одна
								СтрокаДанных = мСтроки[0]; 
								Если ТипЗНЧ(ДанныеПоАдресу.ДанныеДляХранения) = Тип("ДанныеФормыКоллекция") Тогда
									СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(ДанныеПоАдресу.ДанныеДляХранения.Выгрузить());	
								Иначе
									СтрокаДанных.ХранилищеДанных = новый ХранилищеЗначения(ДанныеПоАдресу.ДанныеДляХранения);	
								КонецЕсли;
							КонецЕсли;
							
						КонецЦикла;
					Конецесли; 
					
				КонецЕсли;
				
				МодОбъект.Записать();
				
			Исключение
				
				Возврат(_УФКС.Ответ(1,"Ошибка записи объекта """+Строка(Ссылка)+""": "+ОписаниеОшибки()));
				
			КонецПопытки; 
			
		ИначеЕсли ВидОперации = "Реквизит" Тогда 
			
			Попытка
				
				МодОбъект[СтруктураЗначения.Реквизит] = СтруктураЗначения.Значение;
				МодОбъект.Записать();
				
			Исключение
				
				Возврат(_УФКС.Ответ(1,"Ошибка записи объекта """+Строка(Ссылка)+""": "+ОписаниеОшибки()));
				
			КонецПопытки; 
			
			
		КонецЕсли; 
		
	КонецЦикла;
	
	//Запишем стутасы
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
	//Запишем стутасы  
	
	//Расчет прогноза оплаты статей бюджета
	Если ВидОперации = "Параметр" Тогда	
		CW_Бюджетирование.РассчитатьПрогнозОплатыПриИзменениииПараметра(МассивСсылок, СтруктураЗначения.Параметр);
	КонецЕсли;
	//---Расчет прогноза оплаты статей бюджета
	
	
	Возврат(_УФКС.Ответ());
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 
// ОТБОР И СОРТИРОВКА

&НаСервере
Функция ПроверитьНаличиеОтбора(СтруктураПараметров) Экспорт
	
	Если Не СтруктураПараметров.ЭтоФормаЖурналаГрузоперевозок 
		и Не СтруктураПараметров.ЭтоФормаЖурналаЗаявок 
		и Не СтруктураПараметров.ЭтоФормаЖурналаЗаказов 
		и Не СтруктураПараметров.ЭтоФормаЗаказа Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПараметрыОтбора = СтруктураПараметров.ОбъектХарактеристики.ПараметрыОтбора;
	
	Отказ = Ложь;
	
	Для Каждого ЭлементОбора из ПараметрыОтбора Цикл
		
				
			Если ЭлементОбора.ВидУсловия = Перечисления.CW_ВидыУсловийОтбораПараметров.Реквизит Тогда
				
				Отказ = ПроверитьЗначенияРеквизита(СтруктураПараметров, ЭлементОбора.Значение);
				
			ИначеЕсли ЭлементОбора.ВидУсловия = Перечисления.CW_ВидыУсловийОтбораПараметров.Параметр Тогда
				
				Отказ = ПроверитьЗначенияПараметров(СтруктураПараметров , ЭлементОбора.Значение);
				
			КонецЕсли;
			
			Если Отказ Тогда
				Возврат Отказ;
			КонецЕсли;
			
		КонецЦикла;
		
	Возврат Отказ;
	
КонецФункции

&НаСервере
Функция ПроверитьЗначенияРеквизита(СтруктураПараметров, ИмяРеквизита)
	
	Реквизит = ИмяРеквизита;
	
	Если СтруктураПараметров.ЭтоФормаЖурналаГрузоперевозок или
		СтруктураПараметров.ЭтоФормаЗаказа Тогда
		ИмяСправочника =  "CW_Грузоперевозки";
	ИначеЕсли  СтруктураПараметров.ЭтоФормаЖурналаЗаявок Тогда
		ИмяСправочника =  "CW_Заявки";   
		Реквизит = ?(ИмяРеквизита = "Клиент",  "Контрагент", ИмяРеквизита);
	ИначеЕсли  СтруктураПараметров.ЭтоФормаЖурналаЗаказов Тогда
		ИмяСправочника =  "CW_Заказы";   
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеСправочника."+Реквизит+") КАК ИмяРеквизита
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Справочник."+ИмяСправочника+" КАК ДанныеСправочника
	               |ГДЕ
	               |	ДанныеСправочника.Ссылка В(&МассивСсылок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.ИмяРеквизита КАК ИмяРеквизита
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	ВТ.ИмяРеквизита > 1";
	
	Запрос.УстановитьПараметр("МассивСсылок", СтруктураПараметров.МассивСсылок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Функция ПроверитьЗначенияПараметров(СтруктураПараметров, Параметр )
	
	Если СтруктураПараметров.ЭтоФормаЖурналаГрузоперевозок
		или  СтруктураПараметров.ЭтоФормаЗаказа Тогда
		ИмяСправочника =  "CW_Грузоперевозки.ПараметрыГрузоперевозки";
	ИначеЕсли  СтруктураПараметров.ЭтоФормаЖурналаЗаявок Тогда
		ИмяСправочника =  "CW_Заявки.ПараметрыЗаявки";
	ИначеЕсли  СтруктураПараметров.ЭтоФормаЖурналаЗаказов Тогда
		ИмяСправочника =  "CW_Заявки.ПараметрыЗаказа";
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаПараметров.Значение) КАК Значение
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Справочник."+ИмяСправочника+" КАК ТаблицаПараметров
	               |ГДЕ
	               |	ТаблицаПараметров.Ссылка В(&МассивСсылок)
	               |	И ТаблицаПараметров.Параметр = &Параметр
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Значение КАК Значение
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	ВТ.Значение > 1";
	
	Запрос.УстановитьПараметр("МассивСсылок", СтруктураПараметров.МассивСсылок);
	Запрос.УстановитьПараметр("Параметр"	, Параметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции


&НаСервере
Процедура ОтборПоЗначению(УФ)
	
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ)) Тогда
		УФ.Журнал_НастройкаИзменена = Истина;
	КонецЕсли; 
	
	Элементы = УФ.Элементы;
	Журнал_ОписаниеКолонок = УФ.Журнал_ОписаниеКолонок;
	Журнал_Данные = УФ.Журнал_Данные;
	Журнал_КомпоновщикНастроек =  УФ.Журнал_КомпоновщикНастроек;
	
	МассивСтрок = Журнал_ОписаниеКолонок.НайтиСтроки(Новый Структура("Имя", СтрЗаменить(Элементы.Журнал.ТекущийЭлемент.Имя, "Журнал_","")));
	Если МассивСтрок.Количество() = 0 Тогда 
		Возврат;
	Иначе 
		строкаОписаниеКолонок = МассивСтрок[0];
	КонецЕсли;
	
	Если строкаОписаниеКолонок.УстановленОтбор Тогда
		// снимаем
		// находим все элементы с текущим полем компоновки на первом уровне и удаляем
		ПолеКомпоновки = Новый ПолеКомпоновкиДанных(строкаОписаниеКолонок.СтрокаПоляКомпоновки);
		ОчередьУдаления = Новый Массив;
		Для каждого ЭлементОтбора Из Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки ИЛИ ЭлементОтбора.ПравоеЗначение = ПолеКомпоновки Тогда
					ОчередьУдаления.Добавить(ЭлементОтбора);
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		Для каждого ЭлементОтбора Из ОчередьУдаления Цикл
			Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЦикла; 
		строкаОписаниеКолонок.УстановленОтбор = Ложь;
		
	Иначе
		// устанавливаем
		СтрокаЖурнала = Журнал_Данные.НайтиПоИдентификатору(Элементы.Журнал.ТекущаяСтрока);
		Если (ЗначениеЗаполнено(СтрокаЖурнала[строкаОписаниеКолонок.Имя])
			ИЛИ строкаОписаниеКолонок.ОбъектХарактеристики.Пустая()) 
		Тогда
			
			ПолеСКД = Новый ПолеКомпоновкиДанных(строкаОписаниеКолонок.СтрокаПоляКомпоновки);
			НовыйОтбор = Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйОтбор.ЛевоеЗначение = ПолеСКД;
			Если строкаОписаниеКолонок.ТипЗначения.СодержитТип(Тип("Строка")) И строкаОписаниеКолонок.ТипЗначения.КвалификаторыСтроки.Длина=0 Тогда 
				НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Подобно; // строка неограниченной длины
			Иначе 
				НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
			НовыйОтбор.ПравоеЗначение = СтрокаЖурнала[строкаОписаниеКолонок.Имя];
			НовыйОтбор.Использование = Истина;
			
		Иначе
			
			ПустойСП = Новый СписокЗначений;
			ПустойСП.Добавить(Неопределено);
			ПустойСП.Добавить(СтрокаЖурнала[строкаОписаниеКолонок.Имя]);
			
			ПолеСКД = Новый ПолеКомпоновкиДанных(строкаОписаниеКолонок.СтрокаПоляКомпоновки);
			НовыйОтбор = Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйОтбор.ЛевоеЗначение = ПолеСКД;
			НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			НовыйОтбор.ПравоеЗначение = ПустойСП;
			НовыйОтбор.Использование = Истина;
			
		КонецЕсли;	
		
		строкаОписаниеКолонок.УстановленОтбор = Истина;
		
	КонецЕсли; 
	
	Элементы.ЖурналОтборПоЗначению.Пометка = строкаОписаниеКолонок.УстановленОтбор;
	ОформлениеКолонокОтбора(УФ);
	ОбновитьДанные(УФ);
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПриИзмененииОтбора(УФ, Параметры) Экспорт
	
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ)) Тогда
		УФ.Журнал_НастройкаИзменена = Истина;
	КонецЕсли;
	// --- 
	ОпределитьКолонкиОтбора(УФ);
	ОформлениеКолонокОтбора(УФ);
	ОбновитьСистемныйОтбор(УФ, Параметры);
	Если (НЕ УФ.Журнал_РежимНастройки) Тогда
		ОбновитьДанные(УФ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьКолонкуДляОтбораПоСпискуЗначений(УФ,ИмяКолонки)
	
	ТЗ = УФ.Журнал_Данные.Выгрузить(,ИмяКолонки);
	ТЗ.Свернуть(ИмяКолонки);
	ТЗ.Сортировать(ИмяКолонки);
	
	Сп = Новый СписокЗначений;
	Для Каждого Стр из ТЗ Цикл
		НСтр = Сп.Добавить(Стр[ИмяКолонки],, Истина);
	КонецЦикла;	
	
	Возврат(Сп);
	
КонецФункции	

&НаСервере
Процедура ОпределитьКолонкиОтбора(УФ)
	
	Журнал_КомпоновщикНастроек = УФ.Журнал_КомпоновщикНастроек;
	Журнал_ОписаниеКолонок = УФ.Журнал_ОписаниеКолонок;
	
	МассивТекущихПолейОтбора = Новый Массив;
	
	Для каждого ЭлементОтбора Из Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			//Подмена поля компановки в в связи с переименованием ревизита.
			Если Строка(ЭлементОтбора.ЛевоеЗначение) = "Ссылка.Представление" Тогда
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.CW_Представление");
			КонецЕсли;
			
			МассивТекущихПолейОтбора.Добавить(Строка(ЭлементОтбора.ЛевоеЗначение));
			// находим колонку с таким полем компоновки
			
			строкаКолонки = _сф.к_НайтиСтроку(Журнал_ОписаниеКолонок, _сф.ст_Отбор("СтрокаПоляКомпоновки",Строка(ЭлементОтбора.ЛевоеЗначение)));
			Если строкаКолонки <> Неопределено Тогда
				строкаКолонки.УстановленОтбор = ?(ЭлементОтбора.Использование, Истина, Ложь);
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// теперь пробегаемся по существующим колонкам с флагом отбора и проверяем, что они ещё в отборе
	Для каждого строкаКолонки Из Журнал_ОписаниеКолонок.НайтиСтроки(Новый Структура("УстановленОтбор",Истина)) Цикл
		Если МассивТекущихПолейОтбора.Найти(строкаКолонки.СтрокаПоляКомпоновки) = Неопределено Тогда
			строкаКолонки.УстановленОтбор = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СброситьСортировку(УФ) Экспорт 
	
	Для каждого строкаОписанияКолонки Из УФ.Журнал_ОписаниеКолонок Цикл
		строкаОписанияКолонки.Сортировка = Перечисления.CW_ПорядокСортировки.Нет;
		строкаОписанияКолонки.ИндексСортировки = 0;
	КонецЦикла; 	
	
	УФ.Элементы.ЖурналСортироватьПоВозрастанию.Пометка=Ложь;
	УФ.Элементы.ЖурналСортироватьПоУбыванию.Пометка=Ложь;
	
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ)) Тогда
		УФ.Журнал_НастройкаИзменена = Истина;
	КонецЕсли;
	
	СортироватьЖурнал(УФ);
	
КонецПроцедуры

&НаСервере
Процедура СортироватьЖурнал(УФ) Экспорт  
	
	ТЗС = _сф.т_Создать("СтрокаПоляКомпоновки,Имя,Заголовок,Сортировка,ИндексСортировки");	
	Для каждого строкаОписанияКолонки Из УФ.Журнал_ОписаниеКолонок Цикл
		Если (строкаОписанияКолонки.ИндексСортировки <> 0 И строкаОписанияКолонки.Видимость) Тогда
			Нстр = ТЗС.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр, строкаОписанияКолонки);
		КонецЕсли; 
	КонецЦикла; 
	ТЗС.Сортировать("ИндексСортировки Возр");
	
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
		
		ИмяСсылки = "Грузоперевозка";
		
	ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
		
		ИмяСсылки = "Заявка";	 
		
	ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
		
		ИмяСсылки = "Заказ";	 
	КонецЕсли; 
	
	Если (ТЗС.Количество() = 0) Тогда
		
		// добавляем сортировке по ссылке
		Нстр = ТЗС.Добавить();
		Нстр.СтрокаПоляКомпоновки = "ссылка";
		Нстр.Имя = "ссылка";
		Нстр.Заголовок = ИмяСсылки;
		Нстр.Сортировка = Перечисления.CW_ПорядокСортировки.ПоВозрастанию;
		Нстр.ИндексСортировки = 0;
		
	КонецЕсли; 
	
	Если ТЗС.Количество() <> 0 Тогда 
		
		СоответствиеНаправления = Новый Соответствие;
		СоответствиеНаправления.Вставить(Перечисления.CW_ПорядокСортировки.ПоВозрастанию,"Возр");
		СоответствиеНаправления.Вставить(Перечисления.CW_ПорядокСортировки.ПоУбыванию,"Убыв");
		
		стр = "";
		// ссылканомер
		Для каждого СтрокаСортировки Из ТЗС Цикл
			стр = стр + "," + (СтрокаСортировки.Имя+" "+СоответствиеНаправления.Получить(СтрокаСортировки.Сортировка));
		КонецЦикла; 
		стр = Сред(стр, 2);
		
		Попытка   
			//ВЫполняем в поптыке, так как в таблице "Журнал_Данные" может не быть колонок.
		ОбъектСравнения = Новый СравнениеЗначений;
		УФ.Журнал_Данные.Сортировать(стр, ОбъектСравнения);
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СортировкаКолонки(УФ, стрПорядокКУстановке) Экспорт 
	
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ)) Тогда
		УФ.Журнал_НастройкаИзменена = Истина;
		УстановитьЗаголовокЖурнала(УФ);
	КонецЕсли;
	// --- 
	Если стрПорядокКУстановке="Нет" Тогда 
		ПорядокКУстановке = Перечисления.CW_ПорядокСортировки.Нет;
	ИначеЕсли стрПорядокКУстановке="Возр" Тогда 
		ПорядокКУстановке=Перечисления.CW_ПорядокСортировки.ПоВозрастанию;
	ИначеЕсли стрПорядокКУстановке="Убыв" Тогда 
		ПорядокКУстановке=Перечисления.CW_ПорядокСортировки.ПоУбыванию;
	Иначе 
		ВызватьИсключение "_СортировкаКолонки: стрПорядокКУстановке="+стрПорядокКУстановке;
	КонецЕсли;
	// --- 
	строкаОписанияКолонки = _сф.к_НайтиСтроку(УФ.Журнал_ОписаниеКолонок, _сф.ст_Отбор("Имя",СтрЗаменить(УФ.Элементы.Журнал.ТекущийЭлемент.Имя,"Журнал_","")));
	Если (строкаОписанияКолонки <> Неопределено) Тогда
		
		Если (строкаОписанияКолонки.Сортировка=Перечисления.CW_ПорядокСортировки.Нет 
			И ПорядокКУстановке<>Перечисления.CW_ПорядокСортировки.Нет) Тогда
			// добавление сортировки
			строкаОписанияКолонки.Сортировка = ПорядокКУстановке;
			ТЗИ = УФ.Журнал_ОписаниеКолонок.Выгрузить(,"ИндексСортировки");
			ТЗИ.Сортировать("ИндексСортировки Убыв");
			строкаОписанияКолонки.ИндексСортировки = _сф.к_ПервыйЭлемент(ТЗИ).ИндексСортировки+1;
			
		ИначеЕсли (строкаОписанияКолонки.Сортировка<>Перечисления.CW_ПорядокСортировки.Нет 
			И ПорядокКУстановке=Перечисления.CW_ПорядокСортировки.Нет) Тогда 
			// удаление сортировки
			строкаОписанияКолонки.Сортировка = ПорядокКУстановке;
			строкаОписанияКолонки.ИндексСортировки = 0;
			
		Иначе
			
			// разворот направления
			строкаОписанияКолонки.Сортировка = ПорядокКУстановке;
			
		КонецЕсли; 
		
	КонецЕсли; 
	// --- 	
	CW_Журналы_Сервер.СортироватьЖурнал(УФ);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьУсловноеОформлениеФормы(УФ) Экспорт 
	
	Если (ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
		
		МассивУдаляемых = Новый Массив;
		Для каждого ЭлементУО Из УФ.УсловноеОформление.Элементы Цикл
			
			Если (СтрНайти(ЭлементУО.Представление,"!") = 0) Тогда
				МассивУдаляемых.Добавить(ЭлементУО);				
			КонецЕсли; 
			
		КонецЦикла; 
		Для каждого Элемент Из МассивУдаляемых Цикл
			УФ.УсловноеОформление.Элементы.Удалить(Элемент);
		КонецЦикла; 
		
	Иначе
		
		УФ.УсловноеОформление.Элементы.Очистить();
		
	КонецЕсли; 

	// формируем условное оформление для помеченных на удаление
	_УФС.ДобавитьПростоеУсловноеОформление(УФ, "Журнал_Данные.ПометкаУдаления",,Истина,"Журнал","Шрифт",Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,,,,,Истина));
	
	// КОНТРОЛЬНЫЕ ДАТЫ
	ЦветПлан = Новый Цвет(255,0,0);
	ЦветФакт = Новый Цвет(0,0,255);
	Для каждого строкаОписанияКолонки Из УФ.Журнал_ОписаниеКолонок.Выгрузить(_сф.ст_Отбор("КонтрольнаяДатаГрузоперевозки",Истина)) Цикл
		// план/факт
		_УФС.ДобавитьПростоеУсловноеОформление(УФ, "Журнал_Данные"+"."+строкаОписанияКолонки.Имя+"_Факт", , Истина, "Журнал"+"_"+строкаОписанияКолонки.Имя,"ЦветТекста", ЦветФакт);
		_УФС.ДобавитьПростоеУсловноеОформление(УФ, "Журнал_Данные"+"."+строкаОписанияКолонки.Имя+"_Факт", , Ложь,   "Журнал"+"_"+строкаОписанияКолонки.Имя,"ЦветТекста", ЦветПлан);
		
		Если УФ.Журнал_КонтролироватьПросрочкуПлановыхДат Тогда
			
			СтруктураОформления = Новый Структура;
			СтруктураОформления.Вставить("ЦветФона", WebЦвета.ЛососьСветлый);
			СтруктураОформления.Вставить("ЦветТекста", WebЦвета.Черный);
			_УФС.ДобавитьПростоеУсловноеОформление(УФ, "Журнал_Данные"+"."+строкаОписанияКолонки.Имя+"_План", , Истина, "Журнал"+"_"+строкаОписанияКолонки.Имя,СтруктураОформления);
			
		КонецЕсли; 
		
	КонецЦикла; 	
	
	// РАСКРАСКА
	Если (УФ.Журнал_МеханизмРаскраски = Перечисления.CW_МеханизмыРаскраскиСписковМониторинга.ЦветаСтатусов) Тогда
		
		Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
			
			ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_Грузоперевозки"));
			
		ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
			
			ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_Заявки"));
			
		ИначеЕсли ЭтоФормаЖурналаЗаказов(УФ) Тогда 
			
			ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_Заказы"));
			
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ЛогистическиеСтатусы.Ссылка КАК Ссылка,
		|	CW_ЛогистическиеСтатусы.ХранилищеЦвета КАК ХранилищеЦвета
		|ИЗ
		|	Справочник.CW_ЛогистическиеСтатусы КАК CW_ЛогистическиеСтатусы
		|ГДЕ
		|	CW_ЛогистическиеСтатусы.ИдентификаторОбъекта = &ИдентификаторОбъекта";
		Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
			
		СоответствиеЦветов = Новый Соответствие;
		Для каждого Стр Из ТЗ Цикл
			цв = Стр.ХранилищеЦвета.Получить();
			Если ТипЗнч(цв) = Тип("Цвет") Тогда 
				СоответствиеЦветов.Вставить(Стр.Ссылка, цв);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого Стр Из СоответствиеЦветов Цикл
			_УФС.ДобавитьПростоеУсловноеОформление(УФ, "Журнал_Данные"+"."+"ЛогистическийСтатус",,Стр.Ключ,"Журнал","ЦветФона",Стр.Значение);
		КонецЦикла; 
		
	ИначеЕсли (УФ.Журнал_МеханизмРаскраски = Перечисления.CW_МеханизмыРаскраскиСписковМониторинга.ПроизвольныеЦвета) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Цвета.Ссылка
		|ИЗ
		|	Справочник.CW_Цвета КАК Цвета";
		ТЗ = Запрос.Выполнить().Выгрузить();
		СоответствиеЦветов = Новый Соответствие;
		Для каждого Стр Из ТЗ Цикл
			СоответствиеЦветов.Вставить(Стр.Ссылка, Стр.Ссылка.ХранилищеЦвета.Получить());
		КонецЦикла; 
		Для каждого Стр Из СоответствиеЦветов Цикл
			_УФС.ДобавитьПростоеУсловноеОформление(УФ, "Журнал_Данные"+"."+"Цвет",,Стр.Ключ,"Журнал","ЦветФона",Стр.Значение);
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКолонки(УФ) Экспорт 
	
	ИмяЭлементаФормыСписка = "Журнал";
	ЭлементСписок = УФ.Элементы[ИмяЭлементаФормыСписка];
	ИмяИсточникаДанныхСписка = ЭлементСписок.ПутьКДанным;
	ПДЕО = Константы.CW_ПараметрДатыЕжедневногоОбновления.Получить();
	ИмяПДЕО = ИмяПоляКомпоновкиДанных(Строка("Ссылка.[" + ПДЕО.Идентификатор + "]"));
	ПолеПДЕО = Строка("Ссылка.[" + ПДЕО.Идентификатор + "]");
	// --- 
	УФ.Элементы.ЖурналКартинкаСтатуса.Видимость = УФ.Журнал_ФормироватьПиктограммыЛогистическихСтатусов;
	Если (НЕ УФ.Элементы.ЖурналКартинкаСтатуса.Видимость) Тогда
		УФ.Элементы.ЖурналКартинкаСтатуса.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
	Иначе
		УФ.Элементы.ЖурналКартинкаСтатуса.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
	КонецЕсли; 
	Если НЕ ЭтоФормаЖурналаЗаявок(УФ) и Не ЭтоФормаЖурналаЗаказов(УФ) Тогда
		УФ.Элементы.ЖурналКартинкаФинансовогоСтатуса.Видимость = УФ.Элементы.ЖурналКартинкаФинансовогоСтатуса.Видимость;	
		Если (НЕ УФ.Элементы.ЖурналКартинкаФинансовогоСтатуса.Видимость) Тогда
			УФ.Элементы.ЖурналКартинкаФинансовогоСтатуса.ФиксацияВТаблице = ФиксацияВТаблице.Нет;
		Иначе
			УФ.Элементы.ЖурналКартинкаФинансовогоСтатуса.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
		КонецЕсли; 
	КонецЕсли; 
	// --- 
	ФормироватьРеквизиты = Истина;
	ФормироватьЭлементы = Истина;
	ФормироватьПоля = Истина;
	ФормироватьУсловноеОформление = Истина;
	
	// проверка прав и прочего
	ПроверитьКолонки(УФ);
	
	// высота шапки
	ЭлементСписок.ВысотаШапки = УФ.Журнал_СтруктураНастроек["ВысотаШапки"];
	
	// ---------------------------------------------------------------------------- 
	// проверяем наличие ссылки в таблице колонок
	ЕстьСсылка = (_сф.к_НайтиСтроку(УФ.Журнал_ОписаниеКолонок,_сф.ст_Отбор("Имя","ссылка")) <> Неопределено);
	Если (НЕ ЕстьСсылка) Тогда
		
		Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
			ИмяСсылки = "Грузоперевозка";
			ТипСсылки = Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки");
		ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
			ИмяСсылки = "Заявка";
			ТипСсылки = Новый ОписаниеТипов("СправочникСсылка.CW_Заявки");
		ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
			ИмяСсылки = "Заказ";
			ТипСсылки = Новый ОписаниеТипов("СправочникСсылка.CW_Заказы");
		КонецЕсли; 
		// --- 
		Нстр = УФ.Журнал_ОписаниеКолонок.Добавить();
		Нстр.Имя                           = "ссылка";
		Нстр.Заголовок                     = ИмяСсылки;
		Нстр.СтрокаПоляКомпоновки          = "Ссылка";
		Нстр.ТипЗначения                   = ТипСсылки;
		Нстр.Видимость                     = Ложь;
		Нстр.ОбъектХарактеристики          = Неопределено;
		Нстр.РежимПрямогоРедактирования    = Ложь;
		Нстр.РежимМножественногоРедактирования = Ложь;
		Нстр.ПараметрГрузоперевозки        = Ложь;
		Нстр.КонтрольнаяДатаГрузоперевозки = Ложь;
		Нстр.Ширина = 15;
		
	КонецЕсли;
	
	// ---------------------------------------------------------------------------- 
	
	#Область РеквизитыФормы 
		
		// сначала формируем реквизиты формы  
		
		НенужныеСформированныеРеквизиты = УФ.Журнал_СформированныеРеквизитыФормы.ВыгрузитьЗначения();
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивУдаляемыхРеквизитов = Новый Массив;
		
		Для каждого строкаОписанияКолонки Из УФ.Журнал_ОписаниеКолонок Цикл
			
			ИмяРеквизита = строкаОписанияКолонки.Имя;
			
			// фикс
			Если ИмяРеквизита = "" Тогда
				Продолжить;
			КонецЕсли; 
			Если (Найти(ИмяРеквизита,"'")<>0) Тогда
				Продолжить;
			КонецЕсли; 
			// фикс во имя луны
			Если (НЕ строкаОписанияКолонки.Видимость И строкаОписанияКолонки.СтрокаПоляКомпоновки <> "Ссылка") Тогда
				Продолжить;
			КонецЕсли; 
			
			// фикс
			строкаОписанияКолонки.Имя = ИмяПоляКомпоновкиДанных(строкаОписанияКолонки.СтрокаПоляКомпоновки);
			ИмяРеквизита = строкаОписанияКолонки.Имя;
			
			// фикс для даты сделки
			Если строкаОписанияКолонки.Имя = "ссылка_датасделкиф" Тогда
				
				строкаОписанияКолонки.ТипЗначения = Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата));
				
			КонецЕсли; 
			
			// временный фикс - тип значения реквизита определяется во время его добавления или программно
			Если строкаОписанияКолонки.ТипЗначения.Типы().Количество() = 0 Тогда
				строкаОписанияКолонки.ТипЗначения = Новый ОписаниеТипов("Строка");
			КонецЕсли; 
			
			ОбновитьКолонки_ДобавитьРеквизит(УФ, ИмяРеквизита, строкаОписанияКолонки.ТипЗначения, НенужныеСформированныеРеквизиты, МассивДобавляемыхРеквизитов, ИмяИсточникаДанныхСписка);
			
			Если (строкаОписанияКолонки.КонтрольнаяДатаГрузоперевозки) Тогда
				
				// необходимо создать реквизиты для условного оформления план/факт и наличия комментария
				Если (НЕ строкаОписанияКолонки.КонтрольнаяДатаПлан И НЕ строкаОписанияКолонки.КонтрольнаяДатаФакт) Тогда
					ОбновитьКолонки_ДобавитьРеквизит(УФ, ИмяРеквизита + "ЗначениеПлан_",Новый ОписаниеТипов("Дата"), НенужныеСформированныеРеквизиты, МассивДобавляемыхРеквизитов, ИмяИсточникаДанныхСписка);
					ОбновитьКолонки_ДобавитьРеквизит(УФ, ИмяРеквизита + "ЗначениеФакт_",Новый ОписаниеТипов("Дата"), НенужныеСформированныеРеквизиты, МассивДобавляемыхРеквизитов, ИмяИсточникаДанныхСписка);
				КонецЕсли; 
				// --- 
				ОбновитьКолонки_ДобавитьРеквизит(УФ, ИмяРеквизита + "_Факт",       Новый ОписаниеТипов("Булево"), НенужныеСформированныеРеквизиты, МассивДобавляемыхРеквизитов, ИмяИсточникаДанныхСписка);
				ОбновитьКолонки_ДобавитьРеквизит(УФ, ИмяРеквизита + "_План",       Новый ОписаниеТипов("Булево"), НенужныеСформированныеРеквизиты, МассивДобавляемыхРеквизитов, ИмяИсточникаДанныхСписка);
				ОбновитьКолонки_ДобавитьРеквизит(УФ, ИмяРеквизита + "_Примечание", Новый ОписаниеТипов("Булево"), НенужныеСформированныеРеквизиты, МассивДобавляемыхРеквизитов, ИмяИсточникаДанныхСписка);
				
			КонецЕсли; 
			
		КонецЦикла;
		
		// динамические параметры
		ОбновитьКолонки_ДобавитьРеквизит(УФ, ИмяПДЕО, Новый ОписаниеТипов("Дата"), НенужныеСформированныеРеквизиты, МассивДобавляемыхРеквизитов, ИмяИсточникаДанныхСписка);
		
		// формируем массив реквизитов к удалению
		Для каждого ОставшийсяРеквизит Из НенужныеСформированныеРеквизиты Цикл
			Путь = УФ.Журнал_СформированныеРеквизитыФормы.НайтиПоЗначению(ОставшийсяРеквизит).Представление;
			УФ.Журнал_СформированныеРеквизитыФормы.Удалить(УФ.Журнал_СформированныеРеквизитыФормы.НайтиПоЗначению(ОставшийсяРеквизит));
			МассивУдаляемыхРеквизитов.Добавить(Путь);
		КонецЦикла; 
		
		МассивПроблемныхКолонок = Новый Массив;
		МассивПроблемныхКолонок.Добавить("ЛогистическийСтатус"); //Журнал заявок
		МассивПроблемныхКолонок.Добавить("ФинансовыйСтатус");  //Журнал грузоперевозок
		
		Для каждого Уд ИЗ МассивДобавляемыхРеквизитов Цикл
			ПроблемнаяКолонкаИндекс = МассивПроблемныхКолонок.Найти(Уд.Имя);
			Если ПроблемнаяКолонкаИндекс = Неопределено тогда
				Продолжить;
			КонецЕсли; 
			ПроблемнаяКолонка = МассивПроблемныхКолонок[ПроблемнаяКолонкаИндекс];
			Если Уд.Имя = ПроблемнаяКолонка Тогда
				Если УФ.Журнал_Данные.Выгрузить(Новый Массив).Колонки.Найти(ПроблемнаяКолонка) <> Неопределено тогда
					МассивДобавляемыхРеквизитов.Удалить(МассивДобавляемыхРеквизитов.Найти(Уд));
					УФ.Журнал_СформированныеРеквизитыФормы.Удалить(УФ.Журнал_СформированныеРеквизитыФормы.НайтиПоЗначению(ПроблемнаяКолонка));
				КонецЕсли;				
				МассивПроблемныхКолонок.Удалить(ПроблемнаяКолонкаИндекс);
				Если МассивПроблемныхКолонок.Количество() = 0 тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;					
		КонецЦикла;	  
		
		УникальныеИмена = Новый Массив;
		МуД = Новый Массив;
		Для каждого Уд ИЗ МассивДобавляемыхРеквизитов Цикл
			Имя = НРег(Уд.Имя);
			Если УникальныеИмена.Найти(Имя)=Неопределено Тогда
				УникальныеИмена.Добавить(Имя);
				Продолжить;
			КонецЕсли;            
			МуД.Добавить(Уд);   
		КонецЦикла;	            
		Для каждого У ИЗ МуД Цикл
			МассивДобавляемыхРеквизитов.Удалить(МассивДобавляемыхРеквизитов.Найти(У));	
		КонецЦикла;	
		
		ВыполнитьКонтрольДобавляемыхРеквизитов(УФ, ИмяИсточникаДанныхСписка, МассивДобавляемыхРеквизитов);
	
		// изменяем реквизиты
		УФ.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивУдаляемыхРеквизитов);
		
	#КонецОбласти 
	
	#Область ЭлементыФормы 
	
	// удаляем созданные колонки
	Для каждого ЭлементФормы Из УФ.Журнал_СформированныеЭлементыФормы.ВыгрузитьЗначения() Цикл
		УФ.Элементы.Удалить(УФ.Элементы.Найти(ЭлементФормы));
	КонецЦикла; 
	УФ.Журнал_СформированныеЭлементыФормы.Очистить();
	
	ЭлементСписок.РазрешитьПеретаскивание=Ложь;
	ЭлементСписок.РазрешитьНачалоПеретаскивания=Ложь;
	
	УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	// ---------------------------------------------------------------------------- 
		
	НовоеПоле = УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Заголовок = "_";
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("Файлы");
	НовоеПоле.Использование = Истина;

	НовоеПоле = УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Заголовок = "ЛогистическийСтатус";
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЛогистическийСтатус");
	НовоеПоле.Использование = Истина;
	
	НовоеПоле = УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Заголовок = "КартинкаСтатуса";
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("КартинкаСтатуса");
	НовоеПоле.Использование = Истина;
	
	НовоеПоле = УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Заголовок = "ЛогистическийСтатус";
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЛогистическийСтатус");
	НовоеПоле.Использование = Истина;
	
	НовоеПоле = УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Заголовок = "КартинкаФинансовогоСтатуса";
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("КартинкаФинансовогоСтатуса");
	НовоеПоле.Использование = Истина;

	НовоеПоле = УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Заголовок = "Пометка удаления";
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	НовоеПоле.Использование = Истина;
	
	НовоеПоле = УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Заголовок = "Цвет";
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("Цвет");
	НовоеПоле.Использование = Истина;
	
	
	// необходимо сформировать условное оформление для КД
	СформироватьУсловноеОформлениеФормы(УФ);
	
	#КонецОбласти 
	
	#Область ПоляКомпоновщика 
	
	// формируем выбранные поля компоновки и элементы формы
	МассивУдаления = Новый Массив;
	Для каждого СтрокаОписанияКолонки Из УФ.Журнал_ОписаниеКолонок Цикл
		
		Попытка
			
			ИмяРеквизита = СтрокаОписанияКолонки.Имя;
			
			// фикс
			Если ИмяРеквизита = "" Тогда
				МассивУдаления.Добавить(строкаОписанияКолонки);
				Продолжить;
			КонецЕсли; 
			Если (Найти(ИмяРеквизита,"'")<>0) Тогда
				МассивУдаления.Добавить(строкаОписанияКолонки);
				Продолжить;
			КонецЕсли; 
			
			// фикс во имя луны
			Если (НЕ строкаОписанияКолонки.Видимость И строкаОписанияКолонки.СтрокаПоляКомпоновки <> "Ссылка") Тогда
				Продолжить;
			КонецЕсли; 
			
			// ---------------------------------------------------------------------------- 
			// добавляем выбранное поле компоновки
			НовоеПоле = УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			НовоеПоле.Заголовок = строкаОписанияКолонки.Заголовок;
			НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(строкаОписанияКолонки.СтрокаПоляКомпоновки);
			НовоеПоле.Использование = Истина;
			
			// ---------------------------------------------------------------------------- 
			// добавляем колонку (элемент формы)
			ИмяКолонки = ИмяЭлементаФормыСписка+"_"+ИмяРеквизита;
			
			
			ПолеКолонки = УФ.Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ЭлементСписок); 
			ПолеКолонки.ПутьКДанным = ИмяИсточникаДанныхСписка+"."+ИмяРеквизита;	
			ПолеКолонки.Видимость = строкаОписанияКолонки.Видимость;
			ПолеКолонки.АвтоВысотаЯчейки=Ложь;
			
			Если строкаОписанияКолонки.Фиксация = Перечисления.CW_ВариантыФиксацииКолонок.Нет Тогда
				ПолеКолонки.ФиксацияВТаблице=ФиксацияВТаблице.Нет;
			ИначеЕсли строкаОписанияКолонки.Фиксация = Перечисления.CW_ВариантыФиксацииКолонок.Лево Тогда 
				ПолеКолонки.ФиксацияВТаблице=ФиксацияВТаблице.Лево;
			ИначеЕсли строкаОписанияКолонки.Фиксация = Перечисления.CW_ВариантыФиксацииКолонок.Право Тогда 
				ПолеКолонки.ФиксацияВТаблице=ФиксацияВТаблице.Право;
			КонецЕсли; 
			
			ТипПараметра = строкаОписанияКолонки.ТипЗначения.Типы()[0];
			Если ТипПараметра=Тип("Булево") 
				ИЛИ ТипПараметра=Тип("Дата")
				ИЛИ ТипПараметра=Тип("Число") 
				Тогда
				
				Если (строкаОписанияКолонки.Формат <> "") Тогда
					ПолеКолонки.Формат=строкаОписанияКолонки.Формат;
				Иначе
					Если строкаОписанияКолонки.ОбъектХарактеристики.ФорматВывода <> "" Тогда
						ПолеКолонки.Формат=строкаОписанияКолонки.ОбъектХарактеристики.ФорматВывода;
					КонецЕсли;
				КонецЕсли; 
				
				Если ТипПараметра=Тип("Дата") И НЕ ЗначениеЗаполнено(ПолеКолонки.Формат) Тогда 
					
					ЧастьДаты = строкаОписанияКолонки.ТипЗначения.КвалификаторыДаты.ЧастиДаты;
					Если ЧастьДаты = ЧастиДаты.Дата Тогда
						
						// формат дат по умолчанию
						ПолеКолонки.Формат = "ДФ=dd.MM.yyyy";
						
					ИначеЕсли ЧастьДаты = ЧастиДаты.Время Тогда 
						
						// формат дат по умолчанию
						ПолеКолонки.Формат = "ДФ=HH:mm:ss";
						
					ИначеЕсли ЧастьДаты = ЧастиДаты.ДатаВремя Тогда 
						
						Если (НЕ строкаОписанияКолонки.КонтрольнаяДатаГрузоперевозки) Тогда
							
							// формат дат по умолчанию
							ПолеКолонки.Формат = "";
							
						Иначе
							
							// формат дат по умолчанию
							ПолеКолонки.Формат = "ДФ='dd.MM.yyyy HH:mm'";
						
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли; 
			
			// --- 
			
			ПолеКолонки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
			ПолеКолонки.Заголовок          = СтрокаОписанияКолонки.Заголовок;
			ПолеКолонки.ОтображатьВШапке   = Истина;
			Если (ПолеКолонки.ФиксацияВТаблице <> ФиксацияВТаблице.Нет) Тогда
				
				ПолеКолонки.РастягиватьПоГоризонтали 	= Ложь;
				ПолеКолонки.АвтоМаксимальнаяШирина 		= Ложь;
				ПолеКолонки.Ширина 						= СтрокаОписанияКолонки.Ширина;
				ПолеКолонки.МаксимальнаяШирина 			= СтрокаОписанияКолонки.Ширина;
				
			Иначе
				ПолеКолонки.АвтоМаксимальнаяШирина = Ложь;
				
				ПолеКолонки.РастягиватьПоГоризонтали = (СтрокаОписанияКолонки.Ширина = 0);
				Если СтрокаОписанияКолонки.Ширина > 0 Тогда
					ПолеКолонки.Ширина 				= СтрокаОписанияКолонки.Ширина;
					ПолеКолонки.МаксимальнаяШирина	= СтрокаОписанияКолонки.Ширина;
				КонецЕсли;
				
			КонецЕсли; 
			
			// --- 
			
			УФ.Журнал_СформированныеЭлементыФормы.Добавить(ИмяКолонки);
			
			// ---------------------------------------------------------------------------- 
			
			Если (строкаОписанияКолонки.КонтрольнаяДатаГрузоперевозки) Тогда
				
				// добавляем поля компоновки для план-факта
				// ---------------------------------------------------------------------------- 
				Если (НЕ строкаОписанияКолонки.КонтрольнаяДатаПлан И НЕ строкаОписанияКолонки.КонтрольнаяДатаФакт) Тогда
					
					НовоеПоле = УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
					НовоеПоле.Заголовок = строкаОписанияКолонки.Заголовок+"_ЗначениеПлан";
					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрЗаменить(строкаОписанияКолонки.СтрокаПоляКомпоновки,"]","")+"_ЗначениеПлан]");
					НовоеПоле.Использование = Истина;
					// --- 
					НовоеПоле = УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
					НовоеПоле.Заголовок = строкаОписанияКолонки.Заголовок+"_ЗначениеФакт";
					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрЗаменить(строкаОписанияКолонки.СтрокаПоляКомпоновки,"]","")+"_ЗначениеФакт]");
					НовоеПоле.Использование = Истина;
					
				КонецЕсли;
				// ---------------------------------------------------------------------------- 
				
				ПолеКолонки.ГоризонтальноеПоложение=ГоризонтальноеПоложениеЭлемента.Центр;
				
				// формируем невидимые колонки для факта и примечания
				ИмяКолонки = ИмяЭлементаФормыСписка+"_"+ИмяРеквизита+"_Факт";
				ПолеКолонки = УФ.Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ЭлементСписок); 
				ПолеКолонки.ПутьКДанным = ИмяИсточникаДанныхСписка+"."+ИмяРеквизита+"_Факт";	
				ПолеКолонки.Видимость = Ложь;
				УФ.Журнал_СформированныеЭлементыФормы.Добавить(ИмяКолонки);
				// --- 
				ИмяКолонки = ИмяЭлементаФормыСписка+"_"+ИмяРеквизита+"_Примечание";
				ПолеКолонки = УФ.Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ЭлементСписок); 
				ПолеКолонки.ПутьКДанным = ИмяИсточникаДанныхСписка+"."+ИмяРеквизита+"_Примечание";	
				ПолеКолонки.Видимость = Ложь;
				УФ.Журнал_СформированныеЭлементыФормы.Добавить(ИмяКолонки);
				
				
				// ???
				ЧастьДаты = строкаОписанияКолонки.ТипЗначения.КвалификаторыДаты.ЧастиДаты;
				Если ЧастьДаты = ЧастиДаты.Дата Тогда
					
					// формат дат по умолчанию
					ПолеКолонки.Формат = "ДФ=dd.MM.yyyy";
					
				ИначеЕсли ЧастьДаты = ЧастиДаты.ДатаВремя Тогда 
					
					// формат дат по умолчанию
					ПолеКолонки.Формат = "ДФ='dd.MM.yyyy HH:mm'";
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			
		Исключение
			МассивУдаления.Добавить(строкаОписанияКолонки);
		КонецПопытки; 
		
	КонецЦикла; 
	_сф.к_УдалитьЭлементыПоМассиву(УФ.Журнал_ОписаниеКолонок,МассивУдаления);
	
	// поле для параметра пересчета
	// --- 
	НовоеПоле = УФ.Журнал_КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Заголовок = ПДЕО.Наименование;
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(ПолеПДЕО);
	НовоеПоле.Использование = Истина;
	
	#КонецОбласти  
	
	#Область ОформлениеКолонокОтбора
	
	ОформлениеКолонокОтбора(УФ);
	
	#КонецОбласти 
	
	#Область КешированиеСвойствКолонок
	
	УФ.Журнал_СписокСвойствКолонок.Очистить();
	Для каждого строкаОписанияКолонки Из УФ.Журнал_ОписаниеКолонок Цикл
		
		Если (строкаОписанияКолонки.Видимость) Тогда
			
			ИмяКолонки = строкаОписанияКолонки.Имя;
			УФ.Журнал_СписокСвойствКолонок.Добавить(ИмяКолонки,Формат(строкаОписанияКолонки.ПолучитьИдентификатор(),"ЧЦ=10; ЧН=; ЧГ="));
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	#КонецОбласти 
	
	// ---------------------------------------------------------------------------- 
	
	#Область ОтборКонтейнеровПоТексту 
	
	Вид = Истина;
	Попытка
		УФ.Элементы.ЖурналОтборКонтейнеровПоТексту.Видимость = Вид;
	Исключение
	КонецПопытки;	
	
	#КонецОбласти 
	
	// --- 
	
	УстановитьЗаголовкиКолонок(УФ);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКонтрольДобавляемыхРеквизитов(Форма, ИмяИсточникаДанныхСписка, МассивДобавляемыхРеквизитов)
	//AFR-250467
	
	ВсеРеквизиты = Форма.ПолучитьРеквизиты(ИмяИсточникаДанныхСписка);
	
	МассивИменРеквизитов = Новый Массив;
	Для Каждого Реквизит из ВсеРеквизиты Цикл
		МассивИменРеквизитов.Добавить(НРег(Реквизит.Имя));
	КонецЦикла;
	
	УдаляемыеРеквизиты = Новый Массив;
	Для Каждого ДобавляемыйРеквизит из МассивДобавляемыхРеквизитов Цикл
		Если МассивИменРеквизитов.Найти(НРег(ДобавляемыйРеквизит.Имя)) <> Неопределено Тогда
			УдаляемыеРеквизиты.Добавить(ДобавляемыйРеквизит);
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого УдаляемыйРеквизит из УдаляемыеРеквизиты Цикл
		МассивДобавляемыхРеквизитов.Удалить(МассивДобавляемыхРеквизитов.Найти(УдаляемыйРеквизит));
	КонецЦикла;    

КонецПроцедуры

&НаСервере
Процедура ОбновитьКолонки_ДобавитьРеквизит(УФ, ИмяРеквизита, ТипЗначения, НенужныеСформированныеРеквизиты, МассивДобавляемыхРеквизитов, ИмяИсточникаДанныхСписка)
	
	ВсеРеквизитыИсточника = УФ.ПолучитьРеквизиты(ИмяИсточникаДанныхСписка);
	
	Если УФ.Журнал_СформированныеРеквизитыФормы.НайтиПоЗначению(ИмяРеквизита) <>  Неопределено 
		ИЛИ ЕстьРеквизитВМассиве(МассивДобавляемыхРеквизитов, ИмяРеквизита) 
		ИЛИ ЕстьРеквизитВМассиве(ВсеРеквизитыИсточника, ИмяРеквизита) Тогда
		
		// если есть - удаляем из массива текущих сформированных - в конце там останутся только действительно ненужные
		УдаляемыйРеквизит = НенужныеСформированныеРеквизиты.Найти(ИмяРеквизита);
		Если (УдаляемыйРеквизит <> Неопределено) Тогда // если он при этом есть в списке
			НенужныеСформированныеРеквизиты.Удалить(УдаляемыйРеквизит);
		КонецЕсли; 
		
	Иначе   
		
		
		// создаем
		Попытка
			НовыйРеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, ТипЗначения, ИмяИсточникаДанныхСписка);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизитФормы);
			УФ.Журнал_СформированныеРеквизитыФормы.Добавить(ИмяРеквизита, ИмяИсточникаДанныхСписка+"."+ИмяРеквизита);	
		Исключение
			Сообщить("Ошибка создания реквизита: """+ИмяРеквизита+"""");
			Сообщить(ОписаниеОшибки());
		КонецПопытки; 
		
	КонецЕсли;
	
КонецПроцедуры     

&НаСервере
Функция ЕстьРеквизитВМассиве(МассивДобавляемыхРеквизитов, ИмяРеквизита)
	
	Для Каждого РеквизитФормы из  МассивДобавляемыхРеквизитов Цикл
		Если НРег(РеквизитФормы.Имя) = НРег(ИмяРеквизита) Тогда
 			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь; 
	
КонецФункции

&НаСервере
Процедура ОформлениеКолонокОтбора(УФ) Экспорт 
	
	Элементы = УФ.Элементы;
	Журнал_ОписаниеКолонок = УФ.Журнал_ОписаниеКолонок;
	
	Для каждого строкаОписанияКолонки Из Журнал_ОписаниеКолонок Цикл
		Если (строкаОписанияКолонки.Видимость И строкаОписанияКолонки.УстановленОтбор <> Неопределено) Тогда
			
			Подчеркнутый = (строкаОписанияКолонки.Фиксация <> Перечисления.CW_ВариантыФиксацииКолонок.Нет);
			Жирный = (строкаОписанияКолонки.УстановленОтбор);
			Элементы["Журнал"+"_"+строкаОписанияКолонки.Имя].ШрифтЗаголовка = Новый Шрифт(Элементы["Журнал"+"_"+строкаОписанияКолонки.Имя].ШрифтЗаголовка,,,Жирный,,Подчеркнутый);
			
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРежимЕкселя(УФ) Экспорт 
	
	Элементы = УФ.Элементы;
	Журнал_СтруктураНастроек = УФ.Журнал_СтруктураНастроек;
	
	Кнопка = Элементы.ЖурналРежимЕкселя;
	Если Журнал_СтруктураНастроек["РежимЕкселя"] Тогда
		
		Кнопка.Картинка = БиблиотекаКартинок.CW_Excel;
		Элементы.ЖурналОчиститьЗначения.Видимость=Истина;
		РаскраситьКолонки(УФ, Истина);
		
	Иначе
		
		Кнопка.Картинка = БиблиотекаКартинок.CW_ExcelНеДоступен;
		Элементы.ЖурналОчиститьЗначения.Видимость=Ложь;
		РаскраситьКолонки(УФ, Ложь);
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура РежимРедактированияВключитьВыключить(УФ) Экспорт 
	
	Элементы = УФ.Элементы;
	Журнал_СтруктураНастроек = УФ.Журнал_СтруктураНастроек;

	Кнопка = Элементы.ЖурналРежимЕкселя;
	
	Если Журнал_СтруктураНастроек["РежимЕкселя"] Тогда
		
		Журнал_СтруктураНастроек["РежимЕкселя"] = Ложь;
		Кнопка.Картинка = БиблиотекаКартинок.CW_ExcelНеДоступен;
		Элементы.ЖурналОчиститьЗначения.Видимость=Ложь;
		РаскраситьКолонки(УФ, Ложь);
		
	Иначе
		
		Журнал_СтруктураНастроек["РежимЕкселя"] = Истина;
		Кнопка.Картинка = БиблиотекаКартинок.CW_Excel;
		Элементы.ЖурналОчиститьЗначения.Видимость=Истина;
		РаскраситьКолонки(УФ, Истина);
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура РаскраситьКолонки(УФ, ФлагРаскраски)
    
	Элементы = УФ.Элементы;
	Журнал_ОписаниеКолонок = УФ.Журнал_ОписаниеКолонок;
	
	Если ФлагРаскраски Тогда
        ЦветРаскраски = Новый Цвет(214, 232, 149);
		//Цвет(155, 196, 92);
    Иначе
        ЦветРаскраски = ЦветаСтиля.ЦветФонаКнопки;
	КонецЕсли;
	
	Для каждого строкаОписанияКолонки Из Журнал_ОписаниеКолонок.Выгрузить(_сф.ст_Отбор("РежимПрямогоРедактирования", Истина)) Цикл
		КолонкаЭлемент = Элементы.Найти("Журнал_"+строкаОписанияКолонки.Имя);
		Если КолонкаЭлемент <> Неопределено Тогда
			КолонкаЭлемент.ЦветФонаЗаголовка = ЦветРаскраски;
		КонецЕсли; 
	КонецЦикла; 
	
	//ЭлементыФормы.Журнал.ОбновитьСтроки();
        
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокЖурнала(УФ)

	ДополнениеЗаголовка = "Сеансовая настройка";
	Если ЗначениеЗаполнено(УФ.Журнал_ТекущаяНастройка) Тогда
		ДополнениеЗаголовка = СокрЛП(УФ.Журнал_ТекущаяНастройка);
	КонеЦесли;
	
	Если ЭтоФормаЖурналаГрузоперевозок(УФ) Тогда    
		УФ.Заголовок = "Журнал грузоперевозок"+ " ("+ДополнениеЗаголовка+?(УФ.Журнал_НастройкаИзменена," *","")+")";	
	ИначеЕсли ЭтоФормаЖурналаЗаявок(УФ) Тогда 
		УФ.Заголовок = "Журнал заявок"+ " ("+ДополнениеЗаголовка+?(УФ.Журнал_НастройкаИзменена," *","")+")";	
	ИначеЕсли ЭтоФормаЖурналаЗаказов(УФ) Тогда 
		УФ.Заголовок = "Журнал заказов" + " ("+ДополнениеЗаголовка+?(УФ.Журнал_НастройкаИзменена," *","")+")";	
	КонецЕсли; 
	
КонецПроцедуры
 
&НаСервере
Процедура ПодготовитьДанные(ПараметрыПроцедуры, АдресРезультата) Экспорт 

	// шаблон настроек
	НовыеНастройки = ПараметрыПроцедуры.НастройкиСКД; 
	
	// устанавливаем парамтеры        
	Для Каждого КлючЗначение из ПараметрыПроцедуры.УстанавливаемыеПараметры Цикл
		НовыеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра(КлючЗначение.Ключ,КлючЗначение.Значение);
	КонецЦикла;  
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
	ПроцессорКомпоновки	= Новый ПроцессорКомпоновкиДанных;
	ПроцессорВывода		= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	
	Попытка
		
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(ПараметрыПроцедуры.СКД, НовыеНастройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

		// <фиксвоимялуны>
		Для каждого Ячейка Из МакетКомпоновкиДанных.Макеты[0].Макет.Ячейки Цикл
			Если (Найти(Ячейка.Имя,"[")<>0) Тогда
				Ячейка.Имя = ИмяПоляКомпоновкиДанных(Ячейка.Имя);
			КонецЕсли; 
		КонецЦикла;
		Для каждого Ячейка Из МакетКомпоновкиДанных.Макеты[1].Макет.Ячейки Цикл
			Если (Найти(Ячейка.Колонка,"[")<>0) Тогда
				Ячейка.Колонка = ИмяПоляКомпоновкиДанных(Ячейка.Колонка);
			КонецЕсли; 
		КонецЦикла;
		// </фиксвоимялуны>

		ПроцессорКомпоновки.Инициализировать(МакетКомпоновкиДанных);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	Исключение
	КонецПопытки;
	
	ПоместитьВоВременноеХранилище(ТаблицаРезультата, АдресРезультата);
						
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанные(УФ,АдресДанных) Экспорт 
	// --- 
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресДанных);
	// --- 
	УФ.Журнал_Данные.Загрузить(ТаблицаДанных);
	
	// --- 
	
	СоответствиеСвойствПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
	ТаблицаКД = УФ.Журнал_ОписаниеКолонок.Выгрузить(Новый Структура("КонтрольнаяДатаГрузоперевозки,Видимость", Истина, Истина));
	СоответствиеЛимитаПросрочки = Новый Соответствие;
	Для каждого КолонкаКД Из ТаблицаКД Цикл
		
		Параметр = КолонкаКД.ОбъектХарактеристики;
		СП = СоответствиеСвойствПараметров.Получить(Параметр);
		ЛимитПросрочки = 60*60*24*СП.ЛимитПросрочкиКонтрольнойДаты;
		// --- 
		СоответствиеЛимитаПросрочки.Вставить(Параметр, ЛимитПросрочки);
		
	КонецЦикла;

	ТДата = ТекущаяДата();
	Для каждого СтрокаЖурнала Из УФ.Журнал_Данные Цикл
		
		Для каждого КолонкаКД Из ТаблицаКД Цикл
			
			// проверяем план факт и наличие примечания
			ИмяРеквизита = КолонкаКД.Имя;
			Параметр = КолонкаКД.ОбъектХарактеристики;
			ЛимитПросрочки = СоответствиеЛимитаПросрочки.Получить(Параметр);
			
			// --- 
			ФактическоеЗначение = Ложь;
			ЕстьПримечание = Ложь;
			ПланПросрочен = Ложь;
			 //--- 
			Если (НЕ КолонкаКД.КонтрольнаяДатаПлан И НЕ КолонкаКД.КонтрольнаяДатаФакт) Тогда
				
				Если (СтрокаЖурнала[ИмяРеквизита+"ЗначениеФакт_"] <> Дата(1,1,1)) Тогда
					ФактическоеЗначение = Истина;
				Иначе
					Если (СтрокаЖурнала[ИмяРеквизита+"ЗначениеПлан_"] <> Дата(1,1,1)) И 
						(СтрокаЖурнала[ИмяРеквизита+"ЗначениеПлан_"] - НачалоДня(ТДата) <= ЛимитПросрочки) Тогда
						ПланПросрочен = Истина;
					КонецЕсли; 
				КонецЕсли; 
				
			Иначе
				
				Если (КолонкаКД.КонтрольнаяДатаПлан) Тогда
					ФактическоеЗначение = Ложь;
					РеквизитФакт = "";
					Если СтрНайти(ИмяРеквизита, "значениеплан_") <> Неопределено Тогда
						РеквизитФакт = СтрЗаменить(ИмяРеквизита,"значениеплан_", "значениефакт_");
					Конецесли;
					Если КолонкаКД.КонтрольнаяДатаФакт Тогда
						Если (СтрокаЖурнала[ИмяРеквизита] <> Дата(1,1,1)) И (СтрокаЖурнала[ИмяРеквизита] - НачалоДня(ТДата) <= ЛимитПросрочки) Тогда
							Если РеквизитФакт="" тогда
								ПланПросрочен = Истина;
							ИначеЕсли СтрокаЖурнала[ИмяРеквизита] < СтрокаЖурнала[РеквизитФакт] или СтрокаЖурнала[РеквизитФакт] = Дата(1,1,1) Тогда
								ПланПросрочен = Истина;
							КонецЕсли;
						КонецЕсли;
					Иначе
						ФактическоеЗначение = Истина;
						ПланПросрочен = Ложь;
					КонецЕсли;
				КонецЕсли; 
				// --- 
				Если (КолонкаКД.КонтрольнаяДатаФакт) Тогда
					ФактическоеЗначение = Истина;
					ПланПросрочен = Ложь;
				КонецЕсли; 
				
			КонецЕсли;
			// --- 
			СтрокаЖурнала[ИмяРеквизита+"_Факт"]=ФактическоеЗначение;
			СтрокаЖурнала[ИмяРеквизита+"_План"]=ПланПросрочен;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	// --- 
	
	// СОРТИРОВКА
	СортироватьЖурнал(УФ);
	
	// --- 
КонецПроцедуры
 
 

&НаСервере
Процедура ОбновитьДанные(УФ, МассивСсылок=Неопределено) Экспорт 
	
	ссылкаЗаказ 	= Неопределено;
	ссылкаЗаявка 	= Неопределено;

	ЭтоФормаЖурнала = (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ));
	ВстроенныйЖурнал = (ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ));
	Если ЭтоФормаЖурнала Тогда
		УстановитьЗаголовокЖурнала(УФ);
	КонецЕсли; 

	Если (УФ.Журнал_НастройкаИзменена ИЛИ ВстроенныйЖурнал) Тогда
		
		Если ЭтоФормаЖурнала Тогда
			ИмяСеансовойНастройки = УФ.ИмяСеансовойНастройки;
			СохранитьСеансовыеНастройки(УФ,ИмяСеансовойНастройки);
		Иначе
			Если ЭтоФормаЗаявки(УФ) Тогда 
				ИмяСеансовойНастройки = "ПоследняяНастройкаЗаявки";
				СохранитьСеансовыеНастройки(УФ,ИмяСеансовойНастройки);
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли; 

	// --- 
	СоответствиеСвойствПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
	// --- 
	// установка параметров "заказ", "заявка" и "выводить архивные"
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ) или ЭтоФормаЖурналаЗаявок(УФ)
		ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
		
		Если (УФ.Журнал_КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Количество() = 0) Тогда
			
			ТекущиеНастройки = УФ.Журнал_КомпоновщикНастроек.ПолучитьНастройки();
			// ---
			СК = ПолучитьОбщийМакет("CW_СхемаЖурналаГрузоперевозок");
			//СхемаКомпоновки = ПолучитьИзВременногоХранилища(УФ.Журнал_СхемаКомпоновки);
			ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СК);
			УФ.Журнал_КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
			УФ.Журнал_КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
			УФ.Журнал_КомпоновщикНастроек.ЗагрузитьНастройки(ТекущиеНастройки);
			
		КонецЕсли;
		
		// ---
		
		Если (ЭтоФормаЗаказа(УФ)) Тогда
			
			ссылкаЗаказ = УФ.Объект.Ссылка;
			Если (НЕ ЗначениеЗаполнено(ссылкаЗаказ)) Тогда
				ссылкаЗаказ = Неопределено;
			КонецЕсли; 
			// --- 
			ссылкаЗаявка = Справочники.CW_Заявки.ПустаяСсылка();
			
		ИначеЕсли (ЭтоФормаЗаявки(УФ)) Тогда 
			
			ссылкаЗаявка = УФ.Объект.Ссылка; 
			Если (НЕ ЗначениеЗаполнено(ссылкаЗаявка)) Тогда
				ссылкаЗаявка = Неопределено;
			КонецЕсли;
			// --- 
			ссылкаЗаказ = Справочники.CW_Заказы.ПустаяСсылка();
			
		ИначеЕсли ЭтоФормаЖурналаГрузоперевозок(УФ) Тогда
			
			 ссылкаЗаказ = Справочники.CW_Заказы.ПустаяСсылка();
			 ссылкаЗаявка = Справочники.CW_Заявки.ПустаяСсылка();
			
		КонецЕсли; 
		// --- 
		ВыводитьАрхивные = УФ.ВыводитьАрхивные;
		
		Попытка
			
			Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
				УФ.Журнал_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заказ", 				ссылкаЗаказ);
				УФ.Журнал_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заявка",				ссылкаЗаявка);
				УФ.Журнал_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МассивСсылок",			МассивСсылок);
				УФ.Журнал_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("УказанМассивСсылок",	МассивСсылок <> Неопределено);
			КонецЕсли;
		
			УФ.Журнал_КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьАрхивные",		ВыводитьАрхивные);
			
		Исключение
			Сообщить(ОписаниеОшибки());
		    Сообщить("Внутренняя ошибка. Отсутствуют параметры данных схемы компоновки.");//ОписаниеОшибки()
		КонецПопытки; 
		
		
	КонецЕсли; 
	
	// --- 
	//ПДЕО = Константы.CW_ПараметрДатыЕжедневногоОбновления.Получить();
	ИмяПДЕО = ИмяПоляКомпоновкиДанных(Строка("Ссылка.[" + УФ.Журнал_ПДЕО.Идентификатор + "]"));
	// --- 
	
	ТаймерОбновления = Неопределено;
	ТаймерЗапроса = Неопределено;
	Если ЭтоФормаЖурнала Тогда
		УФ.Журнал_ДлительностьОбновленияДанных = 0;
		УФ.Журнал_ДлительностьЗапросаДанных = 0;	
	КонецЕсли; 
	
	
	// ---------------------------------------------------------------------------- 
	// ПОДГОТОВКА
	
	Если (МассивСсылок = Неопределено) Тогда
		
		// стандартное обновление
		Если ЭтоФормаЖурнала Тогда
			ТаймерОбновления = _сф.Таймер_Старт();
			ТаймерЗапроса = _сф.Таймер_Старт();	
		КонецЕсли; 
		
		// пытаемся запомнить текущую колонку и строку
		ТекущаяКолонка = Неопределено;
		ТекущаяСтрока = Неопределено;
		
		Если (УФ.Элементы.Журнал.ТекущаяСтрока <> Неопределено) Тогда
			ТекущаяСтрока = УФ.Журнал_Данные.НайтиПоИдентификатору(УФ.Элементы.Журнал.ТекущаяСтрока).Ссылка;
		КонецЕсли; 
		
		Если (УФ.Элементы.Журнал.ТекущийЭлемент <> Неопределено) Тогда
			ТекущаяКолонка = УФ.Элементы.Журнал.ТекущийЭлемент.Имя;
		КонецЕсли; 
		
		УФ.Журнал_Данные.Очистить();
		
	КонецЕсли; 
	
	НовыеНастройки = УФ.Журнал_КомпоновщикНастроек.ПолучитьНастройки();
	
	ПроцессПолученияДанныхЗавершен = Ложь;
	ПересчетДинамическихПараметровВыполнен = Ложь;
	Пока (НЕ ПроцессПолученияДанныхЗавершен) Цикл
		
		// ---------------------------------------------------------------------------- 
		// ПОЛУЧЕНИЕ ДАННЫХ
		
		ТДата = ТекущаяДата();
		ТаблицаРезультата = Новый ТаблицаЗначений;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		// --- 
		ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
		// --- 
		Попытка     
			Если ЭтоАдресВременногоХранилища(УФ.Журнал_СхемаКомпоновки) Тогда
				СхемаКомпоновки = ПолучитьИзВременногоХранилища(УФ.Журнал_СхемаКомпоновки);
				МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НовыеНастройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
				// --- 
				// <фиксвоимялуны>
				Для каждого Ячейка Из МакетКомпоновкиДанных.Макеты[0].Макет.Ячейки Цикл
					Если (Найти(Ячейка.Имя,"[")<>0) Тогда
						Ячейка.Имя = ИмяПоляКомпоновкиДанных(Ячейка.Имя);
					КонецЕсли; 
				КонецЦикла;
				Для каждого Ячейка Из МакетКомпоновкиДанных.Макеты[1].Макет.Ячейки Цикл
					Если (Найти(Ячейка.Колонка,"[")<>0) Тогда
						Ячейка.Колонка = ИмяПоляКомпоновкиДанных(Ячейка.Колонка);
					КонецЕсли; 
				КонецЦикла;
				// </фиксвоимялуны>
				// --- 
				ПроцессорКомпоновки.Инициализировать(МакетКомпоновкиДанных);
				ПроцессорВывода.Вывести(ПроцессорКомпоновки);                    
			КонецЕсли;
		Исключение
			
			УФ.Журнал_Данные.Очистить();
			Сообщить(ОписаниеОшибки());
			
		КонецПопытки;
		
		Если (ТаймерЗапроса <> Неопределено) Тогда
			
			_сф.Таймер_Стоп(ТаймерЗапроса);
			УФ.Журнал_ДлительностьЗапросаДанных = _сф.Таймер_Интервал(ТаймерЗапроса)/1000;
			
		КонецЕсли; 
		
		// загрузка результата
		Если (МассивСсылок = Неопределено) Тогда
			
			УФ.Журнал_Данные.Загрузить(ТаблицаРезультата);
			ОбрабатываемаяТаблица = УФ.Журнал_Данные;
			
		Иначе
			
			ОбрабатываемаяТаблица = Новый Массив;
			
			// обновляем только выбранные строки
			Для каждого Ссылка Из МассивСсылок Цикл
				
				СтрокаРезультата = _сф.к_НайтиСтроку(ТаблицаРезультата, "ссылка", Ссылка);
				СтрокаЖурнала = _сф.к_НайтиСтроку(УФ.Журнал_Данные, "ссылка", Ссылка);
				Если (СтрокаРезультата = Неопределено) Тогда
					Если (СтрокаЖурнала <> Неопределено) Тогда
						УФ.Журнал_Данные.Удалить(СтрокаЖурнала);
					КонецЕсли;	
				Иначе
					Если (СтрокаЖурнала = Неопределено) Тогда
						СтрокаЖурнала = УФ.Журнал_Данные.Добавить();
					КонецЕсли;
					
					
					ИсключитьКолонки = "КартинкаСтатуса";
					Если ЭтоФормаЖурналаГрузоперевозок(УФ)  Тогда
						Если ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок") Тогда
							ИсключитьКолонки = ИсключитьКолонки + ",КартинкаФинансовогоСтатуса";
						КонецЕсли;
					КонецЕсли;
					Если ЭтоФормаЗаказа(УФ) Тогда
						Если ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыЗаказов") Тогда
							ИсключитьКолонки = ИсключитьКолонки + ",КартинкаФинансовогоСтатуса";
						КонецЕсли;
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(СтрокаЖурнала, СтрокаРезультата,, ИсключитьКолонки);
					
					СтрокаЖурнала.КартинкаСтатуса = СтрокаРезультата.КартинкаСтатуса;
					
					Если ЭтоФормаЖурналаГрузоперевозок(УФ) и ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок") Тогда
						СтрокаЖурнала.КартинкаФинансовогоСтатуса = СтрокаРезультата.КартинкаФинансовогоСтатуса;
					КонецЕсли;
					
					
					Если ЭтоФормаЗаказа(УФ) и ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыЗаказов") Тогда
						СтрокаЖурнала.КартинкаФинансовогоСтатуса = СтрокаРезультата.КартинкаФинансовогоСтатуса;
					КонецЕсли;
					
					ОбрабатываемаяТаблица.Добавить(СтрокаЖурнала);
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли; 
		
		#Область ДинамическиеПараметры 
		
		Если (УФ.Журнал_ДинамическиеПараметры) Тогда
			
			Если (НЕ ПересчетДинамическихПараметровВыполнен) Тогда
				
				// проверяем необходимость пересчета динамических параметров
				// ---------------------------------------------------------------------------- 
				МассивГПДляПересчетаПараметров = Новый Массив;
				Для каждого СтрокаЖурнала Из ОбрабатываемаяТаблица Цикл
					
					ДатаПлановогоОбновления = СтрокаЖурнала[ИмяПДЕО];
					Если (ДатаПлановогоОбновления = Неопределено) Тогда
						ДатаПлановогоОбновления = Дата(1,1,1);
					КонецЕсли;
					Если (ДатаПлановогоОбновления <> Дата(1,1,1) И ДатаПлановогоОбновления < ТДата) Тогда
						МассивГПДляПересчетаПараметров.Добавить(СтрокаЖурнала.ссылка);
					КонецЕсли; 
					
				КонецЦикла; 
				// --- 
				Если (МассивГПДляПересчетаПараметров.Количество() <> 0) Тогда
					
					// пересчитываем и обновляем данные
					Для каждого ГП Из МассивГПДляПересчетаПараметров Цикл
						
						Ответ = CW_Мониторинг.ПересчитатьДинамическиеПараметрыОбъекта(ГП,СоответствиеСвойствПараметров);
						Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
							Сообщить(Строка(ГП)+":");
							Сообщить(_УФКС.ПредставлениеОшибки(Ответ));
						КонецЕсли; 
						
					КонецЦикла;
					
				Иначе
					
					ПроцессПолученияДанныхЗавершен = Истина;
					
				КонецЕсли; 
				// --- 
				ПересчетДинамическихПараметровВыполнен = Истина;
				
			Иначе
				
				ПроцессПолученияДанныхЗавершен = Истина;
				
			КонецЕсли; 
			
		Иначе
			
			ПроцессПолученияДанныхЗавершен = Истина;
			
		КонецЕсли; 
		
		#КонецОбласти 
		
	КонецЦикла; 
	
	// ---------------------------------------------------------------------------- 
	// ПОСТ-ОБРАБОТКА
	// ---------------------------------------------------------------------------- 
	
	ТаблицаКД = УФ.Журнал_ОписаниеКолонок.Выгрузить(Новый Структура("КонтрольнаяДатаГрузоперевозки,Видимость", Истина, Истина));
	СоответствиеЛимитаПросрочки = Новый Соответствие;
	Для каждого КолонкаКД Из ТаблицаКД Цикл
		
		Параметр = КолонкаКД.ОбъектХарактеристики;
		СП = СоответствиеСвойствПараметров.Получить(Параметр);
		ЛимитПросрочки = 60*60*24*СП.ЛимитПросрочкиКонтрольнойДаты;
		// --- 
		СоответствиеЛимитаПросрочки.Вставить(Параметр, ЛимитПросрочки);
		
	КонецЦикла;
	
	// --- 
	
	Для каждого СтрокаЖурнала Из ОбрабатываемаяТаблица Цикл
		
		Для каждого КолонкаКД Из ТаблицаКД Цикл
			
			// проверяем план факт и наличие примечания
			
			ИмяРеквизита 		= КолонкаКД.Имя;
			Параметр 			= КолонкаКД.ОбъектХарактеристики;
			ЛимитПросрочки 		= СоответствиеЛимитаПросрочки.Получить(Параметр);
			
			// --- 
			ФактическоеЗначение = Ложь;
			ЕстьПримечание = Ложь;
			ПланПросрочен = Ложь;
			// --- 
			Если (НЕ КолонкаКД.КонтрольнаяДатаПлан И НЕ КолонкаКД.КонтрольнаяДатаФакт) Тогда
				
				Если (СтрокаЖурнала[ИмяРеквизита+"ЗначениеФакт_"] <> Дата(1,1,1)) Тогда
					ФактическоеЗначение = Истина;
				Иначе
					Если (СтрокаЖурнала[ИмяРеквизита+"ЗначениеПлан_"] <> Дата(1,1,1)) И 
						(СтрокаЖурнала[ИмяРеквизита+"ЗначениеПлан_"] - НачалоДня(ТДата) <= ЛимитПросрочки) Тогда
						ПланПросрочен = Истина;
					КонецЕсли; 
				КонецЕсли; 
				
			Иначе
				
				Если (КолонкаКД.КонтрольнаяДатаПлан) Тогда
					ФактическоеЗначение = Ложь;
					РеквизитФакт = "";
					Если СтрНайти(ИмяРеквизита, "значениеплан_") <> Неопределено Тогда
						РеквизитФакт = СтрЗаменить(ИмяРеквизита,"значениеплан_", "значениефакт_");
					Конецесли;
					Если КолонкаКД.КонтрольнаяДатаФакт Тогда
						Если (СтрокаЖурнала[ИмяРеквизита] <> Дата(1,1,1)) И (СтрокаЖурнала[ИмяРеквизита] - НачалоДня(ТДата) <= ЛимитПросрочки) Тогда
							Если РеквизитФакт="" тогда
								ПланПросрочен = Истина;
							ИначеЕсли СтрокаЖурнала[ИмяРеквизита] < СтрокаЖурнала[РеквизитФакт] или СтрокаЖурнала[РеквизитФакт] = Дата(1,1,1) Тогда
								ПланПросрочен = Истина;
							КонецЕсли;
						КонецЕсли;
					Иначе
						ФактическоеЗначение = Истина;
						ПланПросрочен = Ложь;
					КонецЕсли;
				КонецЕсли; 
				// --- 
				Если (КолонкаКД.КонтрольнаяДатаФакт) Тогда
					ФактическоеЗначение = Истина;
					ПланПросрочен = Ложь;
				КонецЕсли; 
				
			КонецЕсли;
			// --- 
			СтрокаЖурнала[ИмяРеквизита+"_Факт"]=ФактическоеЗначение;
			СтрокаЖурнала[ИмяРеквизита+"_План"]=ПланПросрочен;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	// ---------------------------------------------------------------------------- 
	// СОРТИРОВКА
	СортироватьЖурнал(УФ);
	
	// ---------------------------------------------------------------------------- 
	// ВОССТАНОВЛЕНИЕ ТЕКУЩЕЙ СТРОКИ
	
	Если (МассивСсылок = Неопределено) Тогда
		
		// восстанавливаем текущую колонку и строку
		Если (ТекущаяСтрока <> Неопределено И ТекущаяКолонка <> Неопределено) Тогда
			
			// пробуем восстановить строку
			ТС = _сф.к_НайтиСтроку(УФ.Журнал_Данные, "Ссылка", ТекущаяСтрока);
			Если ТС <> Неопределено Тогда
				УФ.Элементы.Журнал.ТекущаяСтрока = ТС.ПолучитьИдентификатор();
			КонецЕсли; 
			// --- 
			ТК = УФ.Элементы.Найти(ТекущаяКолонка);
			Если (ТК <> Неопределено) Тогда
				УФ.Элементы.Журнал.ТекущийЭлемент = ТК;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	// ПАРАМЕТРЫ СТАТУСНОЙ СТРОКИ
	УФ.Журнал_КоличествоДоступныхСтрок = УФ.Журнал_Данные.Количество();
	УФ.Журнал_КоличествоВыделенныхСтрок = УФ.Элементы.Журнал.ВыделенныеСтроки.Количество();
	
	// длительность обновления
	Если (ТаймерОбновления <> Неопределено) Тогда
		
		_сф.Таймер_Стоп(ТаймерОбновления);
		УФ.Журнал_ДлительностьОбновленияДанных = _сф.Таймер_Интервал(ТаймерОбновления)/1000;
		
		ТекстСтатистики = "Обновление данных выполнено за "+_сф.Таймер_Представление(ТаймерОбновления,Истина)+" ("+_сф.Таймер_Представление(ТаймерЗапроса,Истина)+") с.";
		// --- 
		Если (УФ.Журнал_ПоказыватьСтатистикуОбновленияДанныхЖурнала) Тогда
			
			
			_УФКС.СообщитьПользователю(ТекстСтатистики);
			
		КонецЕсли; 
		Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеСтатистикиЖурналаГрузоперевозок")) Тогда
			
			// записываем статистику
			
			Попытка
				
				ЗС = РегистрыСведений.CW_СтатистикаЖурналаГрузоперевозок.СоздатьМенеджерЗаписи();
				// --- 
				ЗС.Активность = Истина;
				ЗС.Дата = ТекущаяДата();
				ЗС.Пользователь = CW_Настройки.Пользователь();
				// --- 
				ЗС.Настройка = УФ.Журнал_ТекущаяНастройка;
				// --- 
				ЗС.Колонки = УФ.Журнал_ОписаниеКолонок.Выгрузить(Новый Структура("Видимость", Истина)).Количество();
				ЗС.Строки = УФ.Журнал_Данные.Количество();
				ЗС.ДлительностьЗапроса = УФ.Журнал_ДлительностьЗапросаДанных;
				ЗС.ДлительностьОбновления = УФ.Журнал_ДлительностьОбновленияДанных;
				// --- 
				ЗС.Записать(Истина);
				
			Исключение
			    //ОписаниеОшибки()
			КонецПопытки; 
			
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// строка статуса
	ТекстРасшифровки = "";
	флУстановленОтборПоСтатусам=Ложь;
	флУстановленОтборПоФинансовымСтатусам=Ложь;
	флУстановленОтборПоРеквизитам=Ложь; 
	Попытка
		Если УФ.Журнал_СтруктураНастроек["ОтборПоСтатусам"].Количество() <> 0 Тогда
			флУстановленОтборПоСтатусам=Истина;
		КонецЕсли;
		Если УФ.Журнал_СтруктураНастроек["ОтборПоФинансовымСтатусам"].Количество() <> 0 Тогда
			флУстановленОтборПоФинансовымСтатусам=Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;

	Если УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() <> 0 Тогда
		флУстановленОтборПоРеквизитам=Истина;
	КонецЕсли; 
	Если НЕ флУстановленОтборПоСтатусам И НЕ флУстановленОтборПоФинансовымСтатусам И НЕ флУстановленОтборПоРеквизитам Тогда 
		ТекстРасшифровки = "(без отбора)";
	Иначе 
		ТекстРасшифровки = "установлен отбор";
		Если флУстановленОтборПоСтатусам Тогда 
			ТекстРасшифровки = УФ.Журнал_РасшифровкаОтбора + " по логистическим статусам";
		КонецЕсли;
		Если флУстановленОтборПоФинансовымСтатусам Тогда 
			Если (флУстановленОтборПоСтатусам) Тогда
				ТекстРасшифровки = ТекстРасшифровки + " ,";
			КонецЕсли; 
			ТекстРасшифровки = УФ.Журнал_РасшифровкаОтбора + " по финансовым статусам";
		КонецЕсли;
		Если (флУстановленОтборПоСтатусам ИЛИ флУстановленОтборПоФинансовымСтатусам) И флУстановленОтборПоРеквизитам Тогда 
			ТекстРасшифровки = ТекстРасшифровки + " ,";
		КонецЕсли;
		Если флУстановленОтборПоРеквизитам Тогда 
			ТекстРасшифровки = ТекстРасшифровки + " по реквизитам";
		КонецЕсли;
	КонецЕсли;
	УФ.Журнал_РасшифровкаОтбора = ТекстРасшифровки;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 
// РАСКРАСКА

Процедура РаскраситьУстановкаЦветаИОформления(УФ, МассивСсылок, ЭлементСправочникаЦвета)
	
	УстановитьЦвет(МассивСсылок, ЭлементСправочникаЦвета);
	ОбновитьДанные(УФ);
	// ... (далее здесь будет обновление не всех данных, а только выбранных)
	СформироватьУсловноеОформлениеФормы(УФ);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦвет(МассивСсылок, элСпрЦвет)
	// --- 
	Если НЕ элСпрЦвет.Пустая() Тогда
		Для каждого Стр Из МассивСсылок Цикл
			МенеджерЗаписи = РегистрыСведений.CW_ЦветаОбъектов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = Стр;
			МенеджерЗаписи.Цвет = элСпрЦвет;
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла; 
				
	Иначе
		// удаляем
		Для каждого Стр Из МассивСсылок Цикл
			НаборЗаписей = РегистрыСведений.CW_ЦветаОбъектов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Значение = Стр;
			НаборЗаписей.Отбор.Объект.Использование = Истина;
			НаборЗаписей.Записать(Истина);
		КонецЦикла; 
	КонецЕсли; 	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 
// ЯДРО

&НаСервере
Процедура ИнициализацияФормы(УФ,ПараметрыФормы=Неопределено) Экспорт
	
	ИмяСеансовойНастройки = Неопределено;
	
	// специфичные для журналов параметры
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ)) Тогда
		
		Если (ПараметрыФормы <> Неопределено) Тогда
			
			ПараметрыФормы.Свойство("РежимВыбора",УФ.Журнал_РежимВыбора);
			// --- 
			УФ.РежимОткрытия = "";
			ПараметрыФормы.Свойство("РежимОткрытия", УФ.РежимОткрытия);
			ПараметрыФормы.Свойство("ИмяСеансовойНастройки", ИмяСеансовойНастройки);
			Если (УФ.РежимОткрытия = "ДляБюджета") Тогда
				ПараметрыФормы.Свойство("Заказ", УФ.Журнал_Заказ);
			КонецЕсли; 
			// --- 
			// проверяем, что передан список грузоперевозок для отбора
			МассивДоступных = _сф.ст_ПолучитьСвойство(ПараметрыФормы,"МассивДоступных");
			Если (МассивДоступных <> Неопределено) Тогда
				УФ.Журнал_ДоступныеГрузоперевозки.ЗагрузитьЗначения(МассивДоступных);	
			КонецЕсли; 
			
		КонецЕсли; 
		
	ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
		
		 Если (ПараметрыФормы <> Неопределено) Тогда
			
			ПараметрыФормы.Свойство("РежимВыбора",УФ.Журнал_РежимВыбора);
			// --- 
			УФ.РежимОткрытия = "";
			ПараметрыФормы.Свойство("РежимОткрытия", УФ.РежимОткрытия);
			ПараметрыФормы.Свойство("ИмяСеансовойНастройки", ИмяСеансовойНастройки);
			// --- 
			//// проверяем, что передан список грузоперевозок для отбора
			//МассивДоступных = _сф.ст_ПолучитьСвойство(ПараметрыФормы,"МассивДоступных");
			//Если (МассивДоступных <> Неопределено) Тогда
			//	УФ.Журнал_ДоступныеГрузоперевозки.ЗагрузитьЗначения(МассивДоступных);	
			//КонецЕсли; 
			
		КонецЕсли;
		
	ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
		
		Если (ПараметрыФормы <> Неопределено) Тогда
			
			ПараметрыФормы.Свойство("РежимВыбора",УФ.Журнал_РежимВыбора);
			// --- 
			УФ.РежимОткрытия = "";
			ПараметрыФормы.Свойство("РежимОткрытия", УФ.РежимОткрытия);
			ПараметрыФормы.Свойство("ИмяСеансовойНастройки", ИмяСеансовойНастройки);
			// --- 
			// проверяем, что передан список грузоперевозок для отбора
			МассивДоступных = _сф.ст_ПолучитьСвойство(ПараметрыФормы,"МассивДоступных");
			Если (МассивДоступных <> Неопределено) Тогда
				УФ.Журнал_ДоступныеГрузоперевозки.ЗагрузитьЗначения(МассивДоступных);	
			КонецЕсли; 
		КонецЕсли; 
		
		
	КонецЕсли; 
	
	// определяем имя сеансовой настройки
	Если (НЕ ЗначениеЗаполнено(УФ.ИмяСеансовойНастройки)) Тогда
		
		Если (НЕ УФ.Журнал_РежимВыбора И НЕ ЗначениеЗаполнено(УФ.РежимОткрытия)) Тогда
			УФ.ИмяСеансовойНастройки = "ПоследняяНастройка";
		Иначе
			Если (УФ.Журнал_РежимВыбора) Тогда
				УФ.ИмяСеансовойНастройки = "ПоследняяНастройкаПодбора";
				Если (УФ.РежимОткрытия = "ДляБюджета") Тогда
					УФ.Журнал_РежимНастройки = Ложь;	
				КонецЕсли;
				Если (УФ.РежимОткрытия = "Подбор") Тогда
					УФ.Журнал_РежимНастройки = Истина;
				КонецЕсли; 
			Иначе
				Если УФ.РежимОткрытия = "ОтборПоСписку" Тогда
					УФ.ИмяСеансовойНастройки = "ПоследняяНастройка_"+УФ.РежимОткрытия;
					УФ.Журнал_РежимНастройки = Ложь;
				Иначе
					УФ.ИмяСеансовойНастройки = "ПоследняяНастройка_"+УФ.РежимОткрытия;
					УФ.Журнал_РежимНастройки = Истина; 
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
	УстановитьЗаголовокЖурнала(УФ);
	
	// инициализация компоновщика и загрузка сеансовых настроек
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ)) Тогда
		//ОбновитьПовторноИспользуемыеЗначения(); // ???	
	КонецЕсли; 
	
	// инициализируем компоновщик
	// ---------------------------------------------------------------------------- 
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
		СК = ПолучитьОбщийМакет("CW_СхемаЖурналаГрузоперевозок");
		УФ.Журнал_МеханизмРаскраски = Константы.CW_МеханизмРаскраскиСписковМониторинга.Получить();
	ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
		СК = ПолучитьОбщийМакет("CW_СхемаЖурналаЗаявок");
		УФ.Журнал_МеханизмРаскраски = Константы.CW_МеханизмРаскраскиСпискаЗаявок.Получить();
	ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
		СК = ПолучитьОбщийМакет("CW_СхемаЖурналаЗаказов");
		УФ.Журнал_МеханизмРаскраски = Константы.CW_МеханизмРаскраскиЗаказов.Получить();
	КонецЕсли; 
	// --- 
	Если НЕ ЭтоФормаЗаказа(УФ) Тогда
		УФ.Журнал_ДинамическиеПараметры = ПолучитьФункциональнуюОпцию("CW_ИспользованиеДинамическихПараметров");
	КонецЕсли;
	Если (УФ.Журнал_ДинамическиеПараметры) Тогда
		УФ.Журнал_ПДЕО = Константы.CW_ПараметрДатыЕжедневногоОбновления.Получить();	
	КонецЕсли; 
	// --- 
	УФ.Журнал_СхемаКомпоновки = ПоместитьВоВременноеХранилище(СК,УФ.УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СК);
	УФ.Журнал_КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	УФ.Журнал_КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	// --- 	
	УФ.Перечисления_CW_ПорядокСортировки_Нет           = Перечисления.CW_ПорядокСортировки.Нет;
	УФ.Перечисления_CW_ПорядокСортировки_ПоВозрастанию = Перечисления.CW_ПорядокСортировки.ПоВозрастанию;
	УФ.Перечисления_CW_ПорядокСортировки_ПоУбыванию    = Перечисления.CW_ПорядокСортировки.ПоУбыванию;
	
	// --- 
	
	// настройки формы
	НП = CW_Настройки.ПолучитьНастройкиПользователя(CW_Настройки.Пользователь());
	УФ.Журнал_КонтролироватьПросрочкуПлановыхДат = НП.КонтролироватьПросрочкуПлановыхДат;
	УФ.Журнал_ПодтверждатьЗакрытие = НП.ПодтверждатьЗакрытиеЖурналаГрузоперевозок;
	// --- 
	Если НЕ ЭтоФормаЖурналаЗаявок(УФ) Тогда
		УФ.Журнал_ФормироватьПиктограммыЛогистическихСтатусов 	= (НЕ НП.СкрыватьКартинкиСтатусовВЖурналах);
		УФ.Журнал_ФормироватьПиктограммыФинансовыхСтатусов 		= (НЕ НП.СкрыватьКартинкиФинансовыхСтатусовВЖурналах);
	Иначе
		УФ.Журнал_ФормироватьПиктограммыЛогистическихСтатусов 	= (НЕ НП.СкрыватьКартинкиСтатусовВЖурналах);
		УФ.Журнал_ФормироватьАдресаКартинок = (НЕ НП.СкрыватьКартинкиСтатусовВЖурналах);
	КонецЕсли; 
	// --- 
	Если НЕ ЭтоФормаЖурналаЗаявок(УФ) Тогда
		УФ.Элементы.ЖурналКартинкаСтатуса.Видимость 	= УФ.Журнал_ФормироватьПиктограммыЛогистическихСтатусов;
	Иначе
		УФ.Элементы.ЖурналКартинкаСтатуса.Доступность = УФ.Журнал_ФормироватьАдресаКартинок;
	КонецЕсли;
	
	// --- 
	ИспользуютсяФинансовыеСтатусы 			= ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок");
	ИспользованиеФинансовыхСтатусовЗаказов 	= ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыЗаказов");
	
	// ---   
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ)) Тогда
		УФ.Элементы.ЖурналКартинкаФинансовогоСтатуса.Видимость = УФ.Журнал_ФормироватьПиктограммыФинансовыхСтатусов И ИспользуютсяФинансовыеСтатусы;	
	КонецЕсли; 
	Если (ЭтоФормаЖурналаЗаказов(УФ)) Тогда
		УФ.Элементы.ЖурналКартинкаФинансовогоСтатуса.Видимость	= УФ.Журнал_ФормироватьПиктограммыФинансовыхСтатусов И ИспользованиеФинансовыхСтатусовЗаказов;	
	КонецЕсли;  
	Если (ЭтоФормаЖурналаЗаявок(УФ)) Тогда
		УФ.Элементы.ЖурналКартинкаСтатуса.Видимость	= УФ.Журнал_ФормироватьПиктограммыЛогистическихСтатусов И ИспользованиеФинансовыхСтатусовЗаказов;	
	КонецЕсли;  
	
	Если ЭтоФормаЗаказа(УФ) Тогда
		УФ.Элементы.ЖурналКартинкаФинансовогоСтатуса.Видимость	= УФ.Журнал_ФормироватьПиктограммыФинансовыхСтатусов;	
	КонецЕсли;       
	Если ЭтоФормаЗаявки(УФ) Тогда
		УФ.Элементы.ЖурналКартинкаФинансовогоСтатуса.Видимость	= УФ.Журнал_ФормироватьПиктограммыФинансовыхСтатусов и ИспользуютсяФинансовыеСтатусы;	
		УФ.Элементы.ЖурналКартинкаСтатуса.Видимость				= УФ.Журнал_ФормироватьПиктограммыЛогистическихСтатусов ;	
	КонецЕсли;          
	
	

	// --- 
	Если (УФ.Журнал_МеханизмРаскраски <> Перечисления.CW_МеханизмыРаскраскиСписковМониторинга.ПроизвольныеЦвета) Тогда
		УФ.Элементы.ЖурналРаскрасить.Видимость=Ложь;
	КонецЕсли; 
	
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ)) Тогда
		
		// видимость кнопки "выбрать" 
		УФ.Элементы.Журнал_Выбрать.Видимость = (УФ.Журнал_РежимВыбора);
		// видимость кнопок динамических параметров
		УФ.Элементы.ГруппаДинамическиеПараметры.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеДинамическихПараметров");
		// статистика обновления
		УФ.Журнал_ПоказыватьСтатистикуОбновленияДанныхЖурнала = НП.ПоказыватьСтатистикуОбновленияДанныхЖурнала;
		
	КонецЕсли; 
	
	// доп. кнопки
	КнопкаОтбораКонтейнеровПоТексту = "ЖурналОтборКонтейнеровПоТексту";
	Если (УФ.Элементы.Найти(КнопкаОтбораКонтейнеровПоТексту)<>Неопределено) Тогда
		УФ.Элементы[КнопкаОтбораКонтейнеровПоТексту].Видимость = истина;	
	КонецЕсли;
	// --- 
	КнопкаФинансовогоОтчета = "ЖурналФинансовыйОтчет";
	Если (УФ.Элементы.Найти(КнопкаФинансовогоОтчета)<>Неопределено) Тогда
		УФ.Элементы[КнопкаФинансовогоОтчета].Видимость = (CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов"));
	КонецЕсли; 
	// --- 
	КнопкаФормированияДокументовПоБюджету = "ЖурналФормированиеДокументовПоБюджету";
	Если (УФ.Элементы.Найти(КнопкаФормированияДокументовПоБюджету)<>Неопределено) Тогда
		УФ.Элементы[КнопкаФормированияДокументовПоБюджету].Видимость = (CW_ПраваДоступа.ПравоДоступно("ПросмотрБюджетов") И CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов"));
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	// читаем настройки
	ЗагрузкаНастроек(УФ);	
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаНастроек(УФ,СтруктураНастройки=Неопределено) Экспорт 
	// --- 
	
	СохранитьТекущийОтбор = Ложь;
	
	// по-умолчанию загружаем сеансовые
	Если (СтруктураНастройки = Неопределено) Тогда
		УФ.Журнал_СтруктураНастроек = ЗагрузитьСеансовыеНастройки(УФ, УФ.ИмяСеансовойНастройки);
	КонецЕсли; 
	
	// проверяем признак сохранения отбора для именованных настроек
	Если (СтруктураНастройки <> Неопределено) Тогда
		
		//НеВосстанавливатьОтборНастройки = Ложь;
		СтруктураНастройки.Свойство("НеВосстанавливатьОтбор",СохранитьТекущийОтбор);
		//СохранитьТекущийОтбор = (НеВосстанавливатьОтборНастройки);
		// --- 
		Если (СохранитьТекущийОтбор) Тогда
			ТекущийОтбор = УФ.Журнал_КомпоновщикНастроек.ПолучитьНастройки();
		КонецЕсли;
		// --- 
		УФ.Журнал_СтруктураНастроек = Справочники.CW_НастройкиПользователей.ЗагрузитьНастройку(СтруктураНастройки.НастройкаСсылка); 
		
		//для воставновления заголовка журнала
		УФ.Журнал_СтруктураНастроек.Вставить("НастройкаСсылка", СтруктураНастройки.НастройкаСсылка); 
		//для воставновления заголовка журнала
		
		// --- 
		//УФ.Журнал_ТекущаяНастройка = СтруктураНастройки.НастройкаСсылка;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	#Область Проверки 
	
	// проверяем настройки
    Если (УФ.Журнал_СтруктураНастроек = Неопределено) Тогда
		
		//Сообщить("Пустая структура настройки!");
		СброситьНастройкиЖурнала(УФ);
		
    Иначе
		
        Если (НЕ УФ.Журнал_СтруктураНастроек.Свойство("ОсновнаяНастройка")) Тогда
			Сообщить("Отсутствует описание колонок.");
			СброситьНастройкиЖурнала(УФ);
		КонецЕсли;
		УФ.Журнал_СтруктураНастроек.Свойство("НастройкаСсылка",УФ.Журнал_ТекущаяНастройка);
		
	КонецЕсли;
	
	// проверяем тип таблицы настройки колонок
	Если (УФ.Журнал_СтруктураНастроек["ОсновнаяНастройка"] <> Неопределено) Тогда
		
		ТипТаблицыОсновнойНастройки = ТипЗнч(УФ.Журнал_СтруктураНастроек["ОсновнаяНастройка"]); 
		
		Если (ТипТаблицыОсновнойНастройки=Тип("ТаблицаЗначений")) Тогда
			
			УФ.Журнал_ОписаниеКолонок.Загрузить(УФ.Журнал_СтруктураНастроек["ОсновнаяНастройка"]);
			УФ.Журнал_СтруктураНастроек["ОсновнаяНастройка"]=ЗначениеВСтрокуВнутр(УФ.Журнал_ОписаниеКолонок.Выгрузить());
			
		ИначеЕсли (ТипТаблицыОсновнойНастройки=Тип("ДанныеФормыКоллекция")) Тогда 
			
			Сообщить("Тип таблицы описания колонок: "+Строка(ТипТаблицыОсновнойНастройки));
			УФ.Журнал_ОписаниеКолонок.Загрузить(УФ.Журнал_СтруктураНастроек["ОсновнаяНастройка"].Выгрузить());
			УФ.Журнал_СтруктураНастроек["ОсновнаяНастройка"]=ЗначениеВСтрокуВнутр(УФ.Журнал_ОписаниеКолонок.Выгрузить());
			
		ИначеЕсли (ТипТаблицыОсновнойНастройки=Тип("Строка")) Тогда 
			
			УФ.Журнал_ОписаниеКолонок.Загрузить(ЗначениеИзСтрокиВнутр(УФ.Журнал_СтруктураНастроек["ОсновнаяНастройка"]));
			
		Иначе
			// неизвестный тип
			Сообщить("Неподдерживаемый тип таблицы описания колонок: "+Строка(ТипТаблицыОсновнойНастройки));
			СформироватьНачальнуюТаблицуКолонок(УФ);
			
		КонецЕсли; 
		
	Иначе
		
		СформироватьНачальнуюТаблицуКолонок(УФ);
		
	КонецЕсли; 
	
	#КонецОбласти 
	// ---------------------------------------------------------------------------- 
	
    // отрабатываем настройки (восстанавливаем настройку компоновщика)
	Попытка
		
		// инициализируем компоновщик по схеме
		СхемаКомпоновки = ПолучитьИзВременногоХранилища(УФ.Журнал_СхемаКомпоновки);
		// --- 
		Если (СохранитьТекущийОтбор) Тогда
			
			НастройкиОтбора = ТекущийОтбор;
			
		Иначе
			
		    // отбор настройки
			НастройкиОтбора = УФ.Журнал_СтруктураНастроек["НастройкиКомпоновщика"];
		
		КонецЕсли;
		// --- 
		УФ.Журнал_КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);		
		// --- 
		Если (НастройкиОтбора <> Неопределено) Тогда
			УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			_УФС.СкопироватьОтбор(НастройкиОтбора.Отбор,УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор);
		КонецЕсли;
		
	Исключение
		Сообщить("Ошибка загрузки настроек компоновщика.");
		СброситьНастройкиЖурнала(УФ);   
	КонецПопытки;
	
	// при восстановлении настроек в заказе очищаем отбор
	Если (ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ) ИЛИ (УФ.Журнал_РежимВыбора И СтруктураНастройки=Неопределено)) Тогда
		
		УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		Для каждого строкаОписанияКолонки Из УФ.Журнал_ОписаниеКолонок Цикл
			строкаОписанияКолонки.УстановленОтбор=Ложь;
		КонецЦикла; 
				
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	ФиксыНастроек(УФ);
	// --- 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруНастройки(УФ) Экспорт
	// --- 
	
	СН = Новый Структура();
	//Если (ЗначениеЗаполнено(УФ.Журнал_ТекущаяНастройка)) Тогда
	//	СН.Вставить("ИмяНастройки",УФ.Журнал_ТекущаяНастройка.Наименование);
	//Иначе
		СН.Вставить("ИмяНастройки","<Сеансовая>");
	//КонецЕсли; 
	// --- 
	// отбор по статусам
	СН.Вставить("ОтборПоСтатусам", УФ.Журнал_СтруктураНастроек["ОтборПоСтатусам"].Количество() <> 0);
	СН.Вставить("ОтборПоСтатусам_Представление",_сф.сп_Представление(УФ.Журнал_СтруктураНастроек["ОтборПоСтатусам"],", ",Ложь));
	// отбор по финансовым статусам
	СН.Вставить("ОтборПоФинансовымСтатусам", УФ.Журнал_СтруктураНастроек["ОтборПоФинансовымСтатусам"].Количество() <> 0);
	СН.Вставить("ОтборПоФинансовымСтатусам_Представление",_сф.сп_Представление(УФ.Журнал_СтруктураНастроек["ОтборПоФинансовымСтатусам"],", ",Ложь));
	// отбор
	СН.Вставить("Отбор", УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() <> 0);
	СН.Вставить("Отбор_Представление", Строка(УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор));
	// информация
	
	СН.Вставить("КоличествоКолонок",_сф.ст_ПолучитьСвойство(УФ.Журнал_СтруктураНастроек,"КоличествоКолонок",0));
	СН.Вставить("КоличествоСтрок",_сф.ст_ПолучитьСвойство(УФ.Журнал_СтруктураНастроек,"КоличествоСтрок",0));
	СН.Вставить("ВремяОбновления",_сф.ст_ПолучитьСвойство(УФ.Журнал_СтруктураНастроек,"ВремяОбновления",0));
	СН.Вставить("ЕстьИнформация", (СН.ВремяОбновления <> 0));
	
	// --- 
	Возврат(СН);
	
	// --- 
КонецФункции
 

&НаСервере
Функция ИнициализацияНастроек(УФ,СтруктураНастройки=Неопределено) Экспорт 
	// --- 
	
	ОбновитьКолонки(УФ);
	ОбновитьСистемныйОтбор(УФ);
	// --- 
	ОпределитьКолонкиОтбора(УФ);
	ОбновитьРежимЕкселя(УФ);
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция УстановитьЗаголовкиКолонок(УФ) Экспорт 
	
	Для каждого СтрокаОписанияКолонки Из УФ.Журнал_ОписаниеКолонок Цикл
		
		Попытка
			ИмяКолонки = "Журнал"+"_"+СтрокаОписанияКолонки.Имя;	
		Исключение
		    Продолжить;
		КонецПопытки; 
		
		КолонкаЭлемент = УФ.Элементы.Найти(ИмяКолонки);
		
		Если (КолонкаЭлемент <> Неопределено) Тогда
			
			Если строкаОписанияКолонки.Сортировка = УФ.Перечисления_CW_ПорядокСортировки_ПоВозрастанию Тогда
				
				КолонкаЭлемент.Заголовок     = " "+СтрокаОписанияКолонки.Заголовок; // NB! меняя только картинку, не вызываем обновления формы, приходится также трогать заголовок
				КолонкаЭлемент.КартинкаШапки = БиблиотекаКартинок.CW_СортировкаAZ;
				
			ИначеЕсли СтрокаОписанияКолонки.Сортировка = УФ.Перечисления_CW_ПорядокСортировки_ПоУбыванию Тогда 
				
				КолонкаЭлемент.Заголовок     = " "+СтрокаОписанияКолонки.Заголовок; // NB! меняя только картинку, не вызываем обновления формы, приходится также трогать заголовок
				КолонкаЭлемент.КартинкаШапки = БиблиотекаКартинок.CW_СортировкаZA;
				
			Иначе
				
				КолонкаЭлемент.КартинкаШапки = Новый Картинка;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат(Неопределено);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция ЭтоФормаЗаказа(УФ) Экспорт
	// --- 
	
	Возврат(УФ.ИмяФормы = "Справочник.CW_Заказы.Форма.ФормаЭлемента");
	
	// --- 
КонецФункции

&НаСервере
Функция ЭтоФормаЗаявки(УФ) Экспорт
	// --- 
	
	Возврат(УФ.ИмяФормы = "Справочник.CW_Заявки.Форма.ФормаЭлемента");
	
	// --- 
КонецФункции

&НаСервере
Функция ЭтоФормаЖурналаГрузоперевозок(УФ) Экспорт 
	// --- 
	
	Возврат(УФ.ИмяФормы = "Обработка.CW_ЖурналГрузоперевозок.Форма.Форма");
	
	// --- 
КонецФункции

&НаСервере
Функция ЭтоФормаЖурналаЗаявок(УФ) Экспорт 
	// --- 
	
	Возврат(УФ.ИмяФормы = "Обработка.CW_ЖурналЗаявок.Форма.Форма");
	
	// --- 
КонецФункции

&НаСервере
Функция ЭтоФормаЖурналаЗаказов(УФ) Экспорт 
	// --- 
	
	Возврат(УФ.ИмяФормы = "Обработка.CW_ЖурналЗаказов.Форма.Форма");
	
	// --- 
КонецФункции
// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПроверитьКолонки(УФ)
	// --- 
	
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
		КоллекцияРеквизитов = Метаданные.Справочники.CW_Грузоперевозки.Реквизиты;
		ТипСсылки = Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки");
	ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
		КоллекцияРеквизитов = Метаданные.Справочники.CW_Заявки.Реквизиты;
		ТипСсылки = Новый ОписаниеТипов("СправочникСсылка.CW_Заявки");
	ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
		КоллекцияРеквизитов = Метаданные.Справочники.CW_Заказы.Реквизиты;
		ТипСсылки = Новый ОписаниеТипов("СправочникСсылка.CW_Заказы");
	КонецЕсли; 
	// --- 
	РеквизитыДляПрямогоРедактирования = МассивРеквизитовГрупповогоРедактирования(УФ);
	МассивУдаления = Новый Массив;
	// ---------------------------------------------------------------------------- 
	
	НаборПрав = CW_ПраваДоступа.НаборПравДляПараметров();
	СоответствиеПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров(); 
	
	// проверим настройки колонок и права доступа
	// ---------------------------------------------------------------------------- 
	Для каждого строкаОписанияКолонки Из УФ.Журнал_ОписаниеКолонок Цикл
		
		// типизация ссылки
		Если (строкаОписанияКолонки.СтрокаПоляКомпоновки = "Ссылка") Тогда
			строкаОписанияКолонки.ТипЗначения = ТипСсылки;
		КонецЕсли;
		
		// невидимые колонки не обрабатываем во имя луны
		Если (НЕ строкаОписанияКолонки.Видимость) Тогда
			Продолжить;
		КонецЕсли; 
		
		// если не указана сортировка
		Если строкаОписанияКолонки.Сортировка.Пустая() Тогда
			строкаОписанияКолонки.Сортировка = Перечисления.CW_ПорядокСортировки.Нет;
		КонецЕсли; 
		
		// если не указана фиксация
		Если строкаОписанияКолонки.Фиксация.Пустая() Тогда
			строкаОписанияКолонки.Фиксация = Перечисления.CW_ВариантыФиксацииКолонок.Нет;
		КонецЕсли; 
		
		// ---------------------------------------------------------------------------- 
		
		// если колонка - параметр г/п - обновим тип и режим редактирования
		// проверим, не является ли ссылка на параметр битой =)
		Если (строкаОписанияКолонки.ПараметрГрузоперевозки ИЛИ строкаОписанияКолонки.КонтрольнаяДатаГрузоперевозки) Тогда
			
			// проверка на битую ссылку
			Если Найти(Строка(строкаОписанияКолонки.ОбъектХарактеристики),"не найден") <> 0 Тогда
				
				// параметр был удалён, колонку необходимо удалить из настроек
				МассивУдаления.Добавить(строкаОписанияКолонки);
				Сообщить("Колонка """+строкаОписанияКолонки.Имя+""" удалена.");
				Продолжить;
				
			КонецЕсли; 
			
			Если строкаОписанияКолонки.ОбъектХарактеристики.Пустая() Тогда
				
				// ахутнг - удаляем
				МассивУдаления.Добавить(строкаОписанияКолонки);
				Продолжить;
				
			КонецЕсли; 
			
			// ---------------------------------------------------------------------------- 
			
			СвойстваПараметра = СоответствиеПараметров.Получить(строкаОписанияКолонки.ОбъектХарактеристики);
			
			// проверяем права доступа и режим редактирования
			ПраваПараметра = НаборПрав["п_"+_сф.КлючПоСсылке(строкаОписанияКолонки.ОбъектХарактеристики)];
			Если НЕ ПраваПараметра.Просмотр Тогда
				
				МассивУдаления.Добавить(строкаОписанияКолонки);
				Продолжить;
				
			Иначе
				
				// проверяем редактирование
				Если (НЕ ПраваПараметра.Редактирование) Тогда
					
					строкаОписанияКолонки.РежимПрямогоРедактирования = Ложь;
					
				Иначе
					
					ПрямоеРедактирование = СвойстваПараметра.ПрямоеРедактирование;
					МножественноеПрямоеРедактирование = СвойстваПараметра.МножественноеПрямоеРедактирование;
					Если ЭтоФормаЖурналаГрузоперевозок(УФ) 
						И СтрНайти(строкаОписанияКолонки.СтрокаПоляКомпоновки, "Заказ.") > 0 Тогда
						ПрямоеРедактирование = ложь;
						МножественноеПрямоеРедактирование = Ложь;
					КонецЕсли;
					
					// обновляем режим прямого редактирования по данным параметра
					строкаОписанияКолонки.РежимПрямогоРедактирования = ПрямоеРедактирование;
					//	строкаОписанияКолонки.РежимМножественногоРедактирования = (СвойстваПараметра.ПрямоеРедактирование И НЕ СвойстваПараметра.ИспользованиеОтбора);
					строкаОписанияКолонки.РежимМножественногоРедактирования = МножественноеПрямоеРедактирование;
					строкаОписанияКолонки.ИспользованиеОтбора = СвойстваПараметра.ИспользованиеОтбора;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			// обновляем тип 
			строкаОписанияКолонки.ТипЗначения = СвойстваПараметра.ТипЗначения;
			
			// обновляем тип параметра
			Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
				строкаОписанияКолонки.ПараметрГрузоперевозки = Ложь;
				строкаОписанияКолонки.КонтрольнаяДатаГрузоперевозки = Истина;
			Иначе
				строкаОписанияКолонки.ПараметрГрузоперевозки = Истина;
				строкаОписанияКолонки.КонтрольнаяДатаГрузоперевозки = Ложь;
			КонецЕсли; 
			
			// проверяем, что идентификтор параметра не изменился
			
			//Для параметров всегда есть квадрантые скобки    
			мСтрокаПоляКомпоновки   = СтрРазделить(строкаОписанияКолонки.СтрокаПоляКомпоновки, ".");   
			стрОбъектПараметра  	= мСтрокаПоляКомпоновки[0];
			
			Если строкаОписанияКолонки.КонтрольнаяДатаПлан Тогда
				КонтрольныйИдентификатор 	= СвойстваПараметра.ИдентификаторПлан;
				ДополнениеЗаголовка 		= " (план)";
			ИначеЕсли строкаОписанияКолонки.КонтрольнаяДатаФакт Тогда 
				КонтрольныйИдентификатор = СвойстваПараметра.ИдентификаторФакт;
				ДополнениеЗаголовка 		= " (факт)";
			Иначе
				КонтрольныйИдентификатор = СвойстваПараметра.Идентификатор; 
				ДополнениеЗаголовка = "";
			КонецЕсли; 
			
			Если СтрНайти(строкаОписанияКолонки.СтрокаПоляКомпоновки,"["+КонтрольныйИдентификатор+"]") = 0 Тогда
				//Изменился идентифкатор параметра
				строкаОписанияКолонки.Заголовок 			= СвойстваПараметра.Наименование + ДополнениеЗаголовка;
				строкаОписанияКолонки.СтрокаПоляКомпоновки 	= стрОбъектПараметра+".["+КонтрольныйИдентификатор+"]";
				
				Если ЭтоФормаЖурналаЗаявок(УФ) Тогда
					строкаОписанияКолонки.Наименование = "Заявка."+КонтрольныйИдентификатор;
				Иначеесли ЭтоФормаЖурналаЗаказов(УФ) Тогда
					строкаОписанияКолонки.Наименование = "Заказ."+КонтрольныйИдентификатор;
				Иначе
					Если СтрНайти(строкаОписанияКолонки.СтрокаПоляКомпоновки, "Заказ") Тогда
						строкаОписанияКолонки.Наименование = "Заказ."+КонтрольныйИдентификатор;
					Иначе
						строкаОписанияКолонки.Наименование = "Грузоперевозка."+КонтрольныйИдентификатор;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;

		Иначе
			
			// проверяем режим екселя
			Если РеквизитыДляПрямогоРедактирования.Найти(строкаОписанияКолонки.СтрокаПоляКомпоновки) <> Неопределено Тогда
				строкаОписанияКолонки.РежимПрямогоРедактирования = Истина;
				строкаОписанияКолонки.РежимМножественногоРедактирования = Истина;
			Иначе
				строкаОписанияКолонки.РежимПрямогоРедактирования = Ложь;
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла; 
	// ---------------------------------------------------------------------------- 
	Если (МассивУдаления.Количество() <> 0) Тогда
		УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		_сф.к_УдалитьЭлементыПоМассиву(УФ.Журнал_ОписаниеКолонок,МассивУдаления);
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура ФиксыНастроек(УФ)
	// --- 
	
	// временный фикс
	УФ.Журнал_СтруктураНастроек.РежимВыделенияТП = "";
	
	Если (НЕ УФ.Журнал_СтруктураНастроек.Свойство("ОтборПоФинансовымСтатусам")) Тогда
		
		СписокФинансовыхСтатусов = Новый СписокЗначений;
		СписокФинансовыхСтатусов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ФинансовыеСтатусы");
		УФ.Журнал_СтруктураНастроек.Вставить("ОтборПоФинансовымСтатусам", СписокФинансовыхСтатусов);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция МассивРеквизитовГрупповогоРедактирования(УФ) Экспорт 
	
	// тут проверяем права пользователя на редактирование основных реквизитов г/п
	ЕстьПравоРедактированияОсновныхРеквизитов = CW_ПраваДоступа.ПравоДоступно("РедактированиеОсновныхСвойствГрузоперевозок");
	
	РеквизитыДляПрямогоРедактирования = Новый Массив;
	Если (ЕстьПравоРедактированияОсновныхРеквизитов) Тогда
		
		Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
			
			СтруктураРедактируемыхРеквизитов = Новый Структура;
			Если ЭтоФормаЖурналаГрузоперевозок(УФ) Тогда
				СтруктураРедактируемыхРеквизитов = CW_Грузоперевозки_Сервер.ПолучитьСтруктуруРедактируемыхРеквизитовШапки(Истина);
			КонецЕсли;
			Если ЭтоФормаЗаказа(УФ) Тогда
				СтруктураРедактируемыхРеквизитов = CW_Грузоперевозки_Сервер.ПолучитьСтруктуруРедактируемыхРеквизитовШапки(Ложь);
			КонецЕсли;
			
			ЕстьФлаг = Неопределено;
			СтруктураРедактируемыхРеквизитов.Свойство("Заказ", ЕстьФлаг);
			ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
			Если ЕстьФлаг Тогда
				РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Заказ"); // заказ
			КонецЕсли;
			
			ЕстьФлаг = Неопределено;
			СтруктураРедактируемыхРеквизитов.Свойство("Типоразмер", ЕстьФлаг);
			ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
			Если ЕстьФлаг Тогда
				РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Типоразмер"); // типоразмер
			КонецЕсли;
			
			ЕстьФлаг = Неопределено;
			СтруктураРедактируемыхРеквизитов.Свойство("Клиент", ЕстьФлаг);
			ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
			Если ЕстьФлаг Тогда
				РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Клиент"); // Клиент
			КонецЕсли;
			
			ЕстьФлаг = Неопределено;
			СтруктураРедактируемыхРеквизитов.Свойство("МенеджерПродаж", ЕстьФлаг);
			ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
			Если ЕстьФлаг Тогда
				РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.МенеджерПродаж"); // МенеджерПродаж
			КонецЕсли;
			
			ЕстьФлаг = Неопределено;
			СтруктураРедактируемыхРеквизитов.Свойство("ОперативныйМенеджер", ЕстьФлаг);
			ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
			Если ЕстьФлаг Тогда
				РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.ОперативныйМенеджер"); // ОперативныйМенеджер
			КонецЕсли;
			
			ЕстьФлаг = Неопределено;
			СтруктураРедактируемыхРеквизитов.Свойство("Груз", ЕстьФлаг);
			ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
			Если ЕстьФлаг Тогда
				РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Груз"); // Груз
			КонецЕсли;
			
			ЕстьФлаг = Неопределено;
			СтруктураРедактируемыхРеквизитов.Свойство("Маршрут", ЕстьФлаг);
			ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
			Если ЕстьФлаг Тогда
				РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Маршрут"); // Маршрут
			КонецЕсли;
			
			ЕстьФлаг = Неопределено;
			СтруктураРедактируемыхРеквизитов.Свойство("Представление", ЕстьФлаг);
			ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
			Если ЕстьФлаг Тогда
				РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.CW_Представление"); // Представление
			КонецЕсли;
			
			ЕстьФлаг = Неопределено;
			СтруктураРедактируемыхРеквизитов.Свойство("ДатаСделкиФ", ЕстьФлаг);
			ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
			Если ЕстьФлаг Тогда
				РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.ДатаСделкиФ"); // ДатаСделкиФ
			КонецЕсли;
			
			ЕстьФлаг = Неопределено;
			СтруктураРедактируемыхРеквизитов.Свойство("ТипПеревозки", ЕстьФлаг);
			ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
			Если ЕстьФлаг Тогда
				РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.ТипПеревозки"); // ТипПеревозки
			КонецЕсли;

			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Примечание");
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.ДатаЗакрытия");
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Комментарий");
			
			Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаявок") Тогда    
				ЕстьФлаг = Неопределено;
				СтруктураРедактируемыхРеквизитов.Свойство("Заявка", ЕстьФлаг);
				ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
				Если ЕстьФлаг Тогда
					РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Заявка"); 
				КонецЕсли;
			КонецЕсли; 

		КонецЕсли; 
		
		Если (ЭтоФормаЖурналаЗаявок(УФ)) Тогда
			
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Типоразмер"); // типоразмер
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Конрагент"); // контрагент
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.МенеджерПродаж"); // физ.лица
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.ОперативныйМенеджер"); // физ.лица
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.ТипПеревозки");
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Комментарий");
			
		КонецЕсли; 
		
		Если (ЭтоФормаЖурналаЗаказов(УФ)) Тогда
			
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.ДатаСделкиФ"); // Дата заказа
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Клиент"); // контрагент
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Комментарий");
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.МенеджерПродаж"); // физ.лица
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.ОперативныйМенеджер"); // физ.лица
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Груз"); // контрагент
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Маршрут");
			РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.ТипПеревозки");  
			
			Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаявок") Тогда    
				ЕстьФлаг = Неопределено;        
				СтруктураРедактируемыхРеквизитов = CW_Грузоперевозки_Сервер.ПолучитьСтруктуруРедактируемыхРеквизитовШапки(Ложь);
				СтруктураРедактируемыхРеквизитов.Свойство("Заявка", ЕстьФлаг);
				ЕстьФлаг = ?(ЕстьФлаг = Неопределено, Истина, ЕстьФлаг);
				Если ЕстьФлаг Тогда
					РеквизитыДляПрямогоРедактирования.Добавить("Ссылка.Заявка"); 
				КонецЕсли;
			КонецЕсли; 
				
		КонецЕсли;		
	КонецЕсли; 
	
	Возврат(РеквизитыДляПрямогоРедактирования);
	
КонецФункции

&НаСервере
Процедура СброситьНастройкиЖурнала(УФ)
	
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ) ) Тогда
		УФ.Журнал_НастройкаИзменена = Истина;
		УстановитьЗаголовокЖурнала(УФ);
	КонецЕсли; 
	// --- 
    УФ.Журнал_СтруктураНастроек = Новый Структура();
	УФ.Журнал_СтруктураНастроек.Вставить("РежимВыделенияТП","");
	УФ.Журнал_СтруктураНастроек.Вставить("РежимЕкселя", Ложь);
	// --- 
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ЛогистическиеСтатусы");	
	
	УФ.Журнал_СтруктураНастроек.Вставить("ОтборПоСтатусам", СписокСтатусов);
	// --- 
	СписокФинансовыхСтатусов = Новый СписокЗначений;
	СписокФинансовыхСтатусов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ФинансовыеСтатусы");
    УФ.Журнал_СтруктураНастроек.Вставить("ОтборПоФинансовымСтатусам", СписокФинансовыхСтатусов);
	// --- 
    УФ.Журнал_СтруктураНастроек.Вставить("ОсновнаяНастройка", Неопределено);
	УФ.Журнал_СтруктураНастроек.Вставить("НастройкиКомпоновщика", ПолучитьИзВременногоХранилища(УФ.Журнал_СхемаКомпоновки).НастройкиПоУмолчанию);
	УФ.Журнал_СтруктураНастроек.Вставить("ВысотаШапки",3);
	// --- 
	УФ.Журнал_РежимНастройки = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНачальнуюТаблицуКолонок(УФ)
	
	Журнал_ОписаниеКолонок = УФ.Журнал_ОписаниеКолонок;
	
	МассивРеквизитовГрупповогоРедактирования = МассивРеквизитовГрупповогоРедактирования(УФ);
	
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
		ИмяОбъекта = "Грузоперевозка";
		ТипОбъекта = Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки");
		КоллекцияРеквизитов = Метаданные.Справочники.CW_Грузоперевозки.Реквизиты;
	ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
		ИмяОбъекта = "Заявка";
		ТипОбъекта = Новый ОписаниеТипов("СправочникСсылка.CW_Заявки");
		КоллекцияРеквизитов = Метаданные.Справочники.CW_Заявки.Реквизиты;
	ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
		ИмяОбъекта = "Заказ";
		ТипОбъекта = Новый ОписаниеТипов("СправочникСсылка.CW_Заказы");
		КоллекцияРеквизитов = Метаданные.Справочники.CW_Заказы.Реквизиты;
	КонецЕсли; 
	
	// колонки по умолчанию - видимые реквизиты шапки
	Нстр = Журнал_ОписаниеКолонок.Добавить();
	Нстр.Имя                           = нрег("Ссылка");
	Нстр.Заголовок                     = ИмяОбъекта;
	Нстр.СтрокаПоляКомпоновки          = "Ссылка";
	Нстр.ТипЗначения                   = ТипОбъекта;
	Нстр.Видимость                     = Истина;
    Нстр.РежимПрямогоРедактирования    = Ложь;
	Нстр.КонтрольнаяДатаГрузоперевозки = Ложь;
	Нстр.ПараметрГрузоперевозки        = Ложь;
	Нстр.Ширина                        = 10; 
	Нстр.Фиксация                      = Перечисления.CW_ВариантыФиксацииКолонок.Нет;
	Нстр.Сортировка                    = Перечисления.CW_ПорядокСортировки.Нет;
	
	Для Каждого рекв Из КоллекцияРеквизитов Цикл
		
		Если Найти(рекв.Имя, "удалить") <> 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		Нстр = Журнал_ОписаниеКолонок.Добавить();
		Нстр.Имя                           = нрег("Ссылка" + рекв.Имя);
		Нстр.Заголовок                     = рекв.Синоним;
		Нстр.СтрокаПоляКомпоновки          = "Ссылка." + рекв.Имя;
		Нстр.ТипЗначения                   = рекв.Тип;
		Нстр.Видимость                     = Истина;
        Нстр.РежимПрямогоРедактирования    = (МассивРеквизитовГрупповогоРедактирования.Найти("Ссылка." + рекв.Имя) <> Неопределено);
		Нстр.КонтрольнаяДатаГрузоперевозки = Ложь;
		Нстр.ПараметрГрузоперевозки        = Ложь;
		Нстр.Ширина                        = 10; 
		Нстр.Фиксация                      = Перечисления.CW_ВариантыФиксацииКолонок.Нет;
		Нстр.Сортировка                    = Перечисления.CW_ПорядокСортировки.Нет;
		
	КонецЦикла;
	
	// --- 
	
	// записываем 
	УФ.Журнал_СтруктураНастроек["ОсновнаяНастройка"]=ЗначениеВСтрокуВнутр(УФ.Журнал_ОписаниеКолонок.Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныеПараметры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ПараметрыГрузоперевозок.Ссылка КАК Параметр,
		|	CW_ПараметрыГрузоперевозок.Идентификатор,
		|	ВЫБОР
		|		КОГДА &Группа = ЗНАЧЕНИЕ(Справочник.CW_ГруппыПользователей.Администраторы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Просмотр, ЛОЖЬ)
		|	КОНЕЦ КАК Просмотр
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
		|		ПО (CW_ПраваДоступаДляПараметровМониторинга.Параметр = CW_ПараметрыГрузоперевозок.Ссылка)
		|			И (CW_ПраваДоступаДляПараметровМониторинга.Группа = &Группа)
		|ГДЕ
		|	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
		|	И CW_ПараметрыГрузоперевозок.Предопределенный = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Параметр,
		|	ВТ.Идентификатор
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Просмотр = ИСТИНА";
		
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());	
	Если (ГруппаПользователя = Неопределено) Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.ПустаяСсылка();
	КонецЕсли; 
	Если ГруппаПользователя.ПолныеПрава Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли; 
	Запрос.УстановитьПараметр("Группа", ГруппаПользователя);
	ТЗ = Запрос.Выполнить().Выгрузить();

	Возврат(ТЗ);

КонецФункции	

&НаСервере
Функция ИмяПоляКомпоновкиДанных(Знач ПолеКД) Экспорт 
	// --- 
	
	ИмяПоля=ПолеКД;
	ИмяПоля=_сф.стр_Заменить(ИмяПоля," ","");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"(","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,")","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"[","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"]","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,".","");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,",","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"/","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"\","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"!","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"@","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"#","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"№","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"$","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,";","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"%","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"^","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,":","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"&","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"?","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"*","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"-","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"+","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"=","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"~","_");
	ИмяПоля=_сф.стр_Заменить(ИмяПоля,"|","_");
	
	Возврат(НРег(ИмяПоля));
	
	// --- 
КонецФункции

&НаСервере
Процедура ОбновитьСистемныйОтбор(УФ,ПараметрыСистемногоОтбора=Неопределено) Экспорт 
	
	ОбновлятьОтборПоСтатусам = Истина;
	Если (ПараметрыСистемногоОтбора <> Неопределено) Тогда
		ПараметрыСистемногоОтбора.Свойство("ОбновлятьОтборПоСтатусам",ОбновлятьОтборПоСтатусам);
	КонецЕсли; 
	// --- 
	ОбновлятьОтборПоФинансовымСтатусам = Истина;
	Если (ПараметрыСистемногоОтбора <> Неопределено) Тогда
		ПараметрыСистемногоОтбора.Свойство("ОбновлятьОтборПоФинансовымСтатусам",ОбновлятьОтборПоФинансовымСтатусам);
	КонецЕсли; 
	
	// находим отбор группировки
	ОтборДетальных = УФ.Журнал_КомпоновщикНастроек.Настройки.Структура[0].Отбор;
	ОтборДетальных.Элементы.Очистить();
	
	// отбор по правам доступа и типам перевозок
	// ---------------------------------------------------------------------------- 
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());
	Если (ГруппаПользователя = Неопределено) Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.ПустаяСсылка();
	КонецЕсли; 
	Если (НЕ ГруппаПользователя.Пустая()) Тогда
		
		Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
			
			Если (ГруппаПользователя.ФильтрГрузоперевозок) Тогда
				
				Фильтр = ГруппаПользователя.ХранилищеФильтраГрузоперевозок.Получить();
				Если (Фильтр <> Неопределено) Тогда
					
					_УФС.СкопироватьОтбор(Фильтр.Отбор,ОтборДетальных);
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли; 
		Если (ЭтоФормаЖурналаЗаявок(УФ)) Тогда
			
			Если (ГруппаПользователя.ФильтрЗаявок) Тогда
				
				Фильтр = ГруппаПользователя.ХранилищеФильтраЗаявок.Получить();
				Если (Фильтр <> Неопределено) Тогда
					
					_УФС.СкопироватьОтбор(Фильтр.Отбор,ОтборДетальных);
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ЭтоФормаЖурналаЗаказов(УФ) Тогда
			Если ГруппаПользователя.ФильтрЗаказов Тогда
				
				Фильтр = ГруппаПользователя.ХранилищеФильтраЗаказов.Получить();
				Если Фильтр <> Неопределено Тогда
					_УФС.СкопироватьОтбор(Фильтр.Отбор,ОтборДетальных);
				КонецЕсли; 
				
			КонецЕсли;
		КонецЕсли; 
	 
		
		Если (ГруппаПользователя.ОграничениеПоТипамГрузоперевозок) Тогда
			
			Если (ГруппаПользователя.ДоступныеТипыГрузоперевозок.Количество() <> 0) Тогда
				
				// создаем группу
				ГруппаИЛИ = ОтборДетальных.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаИЛИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
				ГруппаИЛИ.Использование = Истина;
				
				Для каждого Стр Из ГруппаПользователя.ДоступныеТипыГрузоперевозок Цикл
					НовыйЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.ТипПеревозки");
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					НовыйЭлементОтбора.ПравоеЗначение = Стр.ТипГрузоперевозки;
					НовыйЭлементОтбора.Использование = Истина;
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 

	// отбор по переданным грузоперевозкам 
	// ---------------------------------------------------------------------------- 
	Если (УФ.Журнал_РежимВыбора) Тогда
		
		Если (НЕ ЗначениеЗаполнено(УФ.РежимОткрытия)) Тогда
			
			Если (УФ.Журнал_ДоступныеГрузоперевозки.Количество() <> 0) Тогда
				
				НовыйЭлементОтбора = ОтборДетальных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
				НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				НовыйЭлементОтбора.ПравоеЗначение = УФ.Журнал_ДоступныеГрузоперевозки;
				НовыйЭлементОтбора.Использование = Истина;
				
			КонецЕсли; 	
			
		Иначе
			
			Если (УФ.РежимОткрытия = "ДляБюджета") Тогда
				
				НовыйЭлементОтбора = ОтборДетальных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.Заказ");
				НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				НовыйЭлементОтбора.ПравоеЗначение = УФ.Журнал_Заказ;
				НовыйЭлементОтбора.Использование = Истина;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ЭтоФормаЖурналаГрузоперевозок(УФ) или ЭтоФормаЖурналаЗаказов(УФ) Тогда
		Если УФ.РежимОткрытия = "ОтборПоСписку" Тогда
			Если УФ.Журнал_ДоступныеГрузоперевозки.Количество() <> 0 Тогда
				НовыйЭлементОтбора = ОтборДетальных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
				НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				НовыйЭлементОтбора.ПравоеЗначение = УФ.Журнал_ДоступныеГрузоперевозки;
				НовыйЭлементОтбора.Использование = Истина;
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	// отбор по статусам
	// ---------------------------------------------------------------------------- 
	Если ОбновлятьОтборПоСтатусам Тогда
		
		// для списка в заказе отбор по статусам не используем
		Если (ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ) ИЛИ (УФ.Журнал_РежимВыбора И НЕ ЗначениеЗаполнено(УФ.Журнал_ТекущаяНастройка))) и НЕ ЭтоФормаЖурналаГрузоперевозок(УФ) Тогда
			
			УФ.Журнал_СтруктураНастроек["ОтборПоСтатусам"].Очистить();
			
		КонецЕсли;
		СписокСтатусов =УФ.Журнал_СтруктураНастроек["ОтборПоСтатусам"];
		Если (СписокСтатусов.Количество() <> 0) Тогда
			
			// создаем группу
			ГруппаИЛИ = ОтборДетальных.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаИЛИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			ГруппаИЛИ.Использование = Истина;
			
			Для каждого Стр Из СписокСтатусов Цикл
				НовыйЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ЛогистическийСтатус");
				НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
				НовыйЭлементОтбора.ПравоеЗначение 	= Стр.Значение;
				НовыйЭлементОтбора.Использование 	= Истина;
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// отбор по финансовым статусам
	// ---------------------------------------------------------------------------- 
	Если ОбновлятьОтборПоФинансовымСтатусам Тогда
		
		// для списка в заказе отбор по статусам не используем
		Если (ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ) ИЛИ (УФ.Журнал_РежимВыбора И НЕ ЗначениеЗаполнено(УФ.Журнал_ТекущаяНастройка))) и НЕ ЭтоФормаЖурналаГрузоперевозок(УФ)  Тогда
			
			УФ.Журнал_СтруктураНастроек["ОтборПоФинансовымСтатусам"].Очистить();
			
		КонецЕсли;
			
		СписокСтатусов =УФ.Журнал_СтруктураНастроек["ОтборПоФинансовымСтатусам"];
		Если (СписокСтатусов.Количество() <> 0) Тогда
			
			// создаем группу
			ГруппаИЛИ = ОтборДетальных.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаИЛИ.ТипГруппы=ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			ГруппаИЛИ.Использование = Истина;
			
			Для каждого Стр Из СписокСтатусов Цикл
				НовыйЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФинансовыйСтатус");
				НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				НовыйЭлементОтбора.ПравоеЗначение = Стр.Значение;
				НовыйЭлементОтбора.Использование = Истина;
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецПроцедуры



// ---------------------------------------------------------------------------- 
// НАСТРОЙКА СПИСКА

&НаСервере
Функция ПараметрыФормыНастройкиСписка(УФ)
	
	// открываем форму настройки списка
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСНЖ", ПолучитьАдресНастроекСписка(УФ));
	ПараметрыФормы.Вставить("СхемаКомпоновки",УФ.Журнал_СхемаКомпоновки);
	Возврат(_УФКС.СД("Журналы","клиент","/НастройкаСписка",ПараметрыФормы));
	
КонецФункции

&НаСервере
Функция ПолучитьАдресНастроекСписка(УФ)
	
	УФ.Журнал_СтруктураНастроек["ОсновнаяНастройка"] = ЗначениеВСтрокуВнутр(УФ.Журнал_ОписаниеКолонок.Выгрузить());
	// --- 
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("СтруктураНастроек", УФ.Журнал_СтруктураНастроек);
	// --- 
	Возврат(ПоместитьВоВременноеХранилище(СтруктураНастройки, УФ.УникальныйИдентификатор));
	
КонецФункции

&НаСервере
Функция ВосстановитьНастройкуСписка(УФ, Адрес)
	
		
	Настройка = ПолучитьИзВременногоХранилища(Адрес);
	
	УФ.Журнал_ОписаниеКолонок.Загрузить(ЗначениеИзСтрокиВнутр(Настройка["ОсновнаяНастройка"]));
	УФ.Журнал_СтруктураНастроек["ОсновнаяНастройка"] = ЗначениеВСтрокуВнутр(УФ.Журнал_ОписаниеКолонок.Выгрузить());
	// --- 
	УФ.Журнал_СтруктураНастроек["ВысотаШапки"]= Настройка["ВысотаШапки"];
	УФ.Журнал_ТекущаяНастройка = Неопределено;
	// --- 	
	ОбновитьКолонки(УФ);
	ОбновитьСистемныйОтбор(УФ);
	ОбновитьРежимЕкселя(УФ);
	// --- 
	УстановитьЗаголовокЖурнала(УФ);
	
	Если (НЕ УФ.Журнал_РежимНастройки) Тогда
		ОбновитьДанные(УФ);
	КонецЕсли; 
	
	Возврат(Неопределено);
	
КонецФункции

// ---------------------------------------------------------------------------- 
// СЕАНСОВЫЕ НАСТРОЙКИ

&НаСервере
Функция СохранитьСеансовыеНастройки(УФ, ИмяНастройки) Экспорт 
	
	Настройка = УФ.Журнал_СтруктураНастроек;
	Если (Настройка <> Неопределено) Тогда  
		
		Если Настройка.Свойство("НастройкаСсылка") Тогда
			Настройка.НастройкаСсылка= Неопределено;
		КонецЕсли;
		
		_СохранитьНастройкиЖурнала(УФ);
		// --- 
		Если ЭтоФормаЖурналаГрузоперевозок(УФ) Тогда
			ХранилищеСистемныхНастроек.Сохранить("ОбработкаОбъект.CW_ЖурналГрузоперевозок", ИмяНастройки, Настройка);
		ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
			ХранилищеСистемныхНастроек.Сохранить("ОбработкаОбъект.CW_ЖурналЗаявок", ИмяНастройки, Настройка);
		ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
			ХранилищеСистемныхНастроек.Сохранить("ОбработкаОбъект.CW_ЖурналЗаказов", ИмяНастройки, Настройка);
		ИначеЕсли ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ) Тогда
			
			Если ЗначениеЗаполнено(УФ.Объект.ТипПеревозки) Тогда 
				ПараметрыЗаписи = Новый Структура;
				ПараметрыЗаписи.Вставить("Метаданные",	 УФ.Объект.Ссылка.Метаданные());
				ПараметрыЗаписи.Вставить("ТипОбъекта",	 ТипЗнч(УФ.Объект.Ссылка));
				ПараметрыЗаписи.Вставить("ТипПеревозки", УФ.Объект.ТипПеревозки);
				
				РегистрыСведений.CW_НастройкиКолонокЖурналов.ЗаписатьНастройку(ПараметрыЗаписи, Настройка);	
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ЗагрузитьСеансовыеНастройки(УФ, Знач ИмяНастройки="ПоследняяНастройка") Экспорт 
	
	Попытка
		Если (ЗначениеЗаполнено(УФ.ИмяСеансовойНастройки)) Тогда
			ИмяНастройки = УФ.ИмяСеансовойНастройки;
		КонецЕсли; 
		// --- 
		Если ЭтоФормаЖурналаГрузоперевозок(УФ) Тогда
			ПоследняяНастройка = ХранилищеСистемныхНастроек.Загрузить("ОбработкаОбъект.CW_ЖурналГрузоперевозок", ИмяНастройки);
		ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
			ПоследняяНастройка = ХранилищеСистемныхНастроек.Загрузить("ОбработкаОбъект.CW_ЖурналЗаявок", ИмяНастройки);
		ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
			ПоследняяНастройка = ХранилищеСистемныхНастроек.Загрузить("ОбработкаОбъект.CW_ЖурналЗаказов", ИмяНастройки);
		ИначеЕсли ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ) Тогда
			
			Если ЗначениеЗаполнено(УФ.Объект.ТипПеревозки) Тогда
				ПараметрыЗаписи = Новый Структура;
				ПараметрыЗаписи.Вставить("Метаданные",	 УФ.Объект.Ссылка.Метаданные());
				ПараметрыЗаписи.Вставить("ТипОбъекта",	 ТипЗнч(УФ.Объект.Ссылка));
				ПараметрыЗаписи.Вставить("ТипПеревозки", УФ.Объект.ТипПеревозки);
				
				ПоследняяНастройка = РегистрыСведений.CW_НастройкиКолонокЖурналов.ПолучитьНастройку(ПараметрыЗаписи);
			КонецЕсли;  

			Если ПоследняяНастройка = Неопределено Тогда
				ПоследняяНастройка = ХранилищеСистемныхНастроек.Загрузить("ОбработкаОбъект.CW_ЖурналГрузоперевозок",ИмяНастройки);	
			КонецЕсли;
		КонецЕсли; 

		Возврат(ПоследняяНастройка);
	Исключение
		Сообщить("Ошибка восстановления настроек сеанса!");
		Возврат(Неопределено);
	КонецПопытки; 

КонецФункции

// ---------------------------------------------------------------------------- 
// ИМЕННЫЕ НАСТРОЙКИ

&НаСервере
Процедура СохранитьНастройку_Сервер(УФ, НастройкаСсылка)
	
	УФ.Журнал_ТекущаяНастройка = НастройкаСсылка;
	_СохранитьНастройкиЖурнала(УФ);
	// --- 
	Справочники.CW_НастройкиПользователей.СохранитьНастройку(НастройкаСсылка, УФ.Журнал_СтруктураНастроек);
	// --- 
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ)) Тогда
		УФ.Журнал_НастройкаИзменена = Ложь;
		УстановитьЗаголовокЖурнала(УФ);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьНастройку_Сервер(УФ, СтруктураНастройки)
	
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ)) Тогда
		УФ.Журнал_НастройкаИзменена = Ложь;
		УФ.Журнал_РежимНастройки = Ложь;
	КонецЕсли;
	// --- 
	ЗагрузкаНастроек(УФ,СтруктураНастройки);
	// --- 
	ИнициализацияНастроек(УФ);
	// --- 
	ЭтоФормаЖурнала = (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ));
	Если ЭтоФормаЖурнала Тогда
		ИмяСеансовойНастройки = УФ.ИмяСеансовойНастройки;
	Иначе
		Если (ЭтоФормаЗаказа(УФ)) Тогда
			ИмяСеансовойНастройки = "ПоследняяНастройкаЗаказы";
		ИначеЕсли (ЭтоФормаЗаявки(УФ)) Тогда 
			ИмяСеансовойНастройки = "ПоследняяНастройкаЗаявки";
		Иначе
			ИмяСеансовойНастройки = "ПоследняяНастройкаРезервная";
		КонецЕсли; 
	КонецЕсли; 
	// --- 
	СохранитьСеансовыеНастройки(УФ,ИмяСеансовойНастройки);
	// --- 
	ОбновитьДанные(УФ);
		
КонецФункции

&НаСервере
Процедура _СохранитьНастройкиЖурнала(УФ)
	// --- 
	
	Настройка = УФ.Журнал_СтруктураНастроек;
	// --- 
	ТЗ_ОписаниеКолонок = УФ.Журнал_ОписаниеКолонок.Выгрузить();
	Настройка["ОсновнаяНастройка"] = ЗначениеВСтрокуВнутр(ТЗ_ОписаниеКолонок);
	Настройка["НастройкиКомпоновщика"] = УФ.Журнал_КомпоновщикНастроек.Настройки;
//	_сф.ст_УстановитьСвойство(Настройка,"НастройкаСсылка", УФ.Журнал_ТекущаяНастройка);
	_сф.ст_УстановитьСвойство(Настройка,"КоличествоКолонок", ТЗ_ОписаниеКолонок.Скопировать(Новый Структура("Видимость",Истина)).Количество());
	_сф.ст_УстановитьСвойство(Настройка,"КоличествоСтрок", УФ.Журнал_Данные.Количество());
	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЖурналаЗаявок(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ)) Тогда
		_сф.ст_УстановитьСвойство(Настройка,"ВремяОбновления", УФ.Журнал_ДлительностьОбновленияДанных);	
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаСервере
Функция ЕстьПравоСоздания(ИмяФормы) Экспорт 
	// --- 
	УФ = Новый Структура("ИмяФормы",ИмяФормы);
	Если ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ) ИЛИ ЭтоФормаЖурналаЗаказов(УФ) Тогда
		Возврат(CW_ПраваДоступа.ПравоДоступно("ДобавлениеГрузоперевозок"));
	ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
		Возврат(CW_ПраваДоступа.ПравоДоступно("ДобавлениеЗаявок"));
	КонецЕсли; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция ПараметрыФормыФинансовогоОтчета(УФ)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Журнал", ПоместитьВоВременноеХранилище(УФ.Журнал_Данные.Выгрузить(), УФ.УникальныйИдентификатор));
	ПараметрыФормы.Вставить("ОписаниеКолонок", ПоместитьВоВременноеХранилище(УФ.Журнал_ОписаниеКолонок.Выгрузить(), УФ.УникальныйИдентификатор));
	Возврат(_УФКС.СД("Журналы","клиент","/ФинансовыйОтчет",ПараметрыФормы));
	
КонецФункции

// --- 

&НаСервере
Функция ПодключитьГрузоперевозки(УФ,МассивСсылок)

	НачатьТранзакцию();
	
	// сразу заблокируем все требуемые Грузоперевозки
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	CW_Грузоперевозки.Ссылка
		|ИЗ
		|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
		|ГДЕ
		|	CW_Грузоперевозки.Ссылка В(&МассивСсылок)
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|	Справочник.CW_Грузоперевозки"
	);
	з.УстановитьПараметр("МассивСсылок", МассивСсылок);
	рз = з.Выполнить();
	выб = рз.Выбрать();
	Пока выб.Следующий() Цикл
		об = выб.Ссылка.ПолучитьОбъект();
		об.Заказ = УФ.Объект.Ссылка;
		об.Записать();
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();

	// ---------------------------------------------------------------------------- 
	
	МД = Новый Массив();
	МД.Добавить(_УФКС.СД("Грузоперевозки","сервер","/БюджетОбновить"));
	МД.Добавить(_УФКС.СД("Журналы","сервер","/ОбновитьДанные",МассивСсылок));
	Возврат(МД);

КонецФункции

// --- 

&НаСервере
Функция ДобавитьДинамическийПараметр(УФ,Параметры)
	
	Параметр = Параметры.Параметр;
	Грузоперевозки = Параметры.Грузоперевозки;
	
	Если ЭтоФормаЖурналаЗаявок(УФ) Тогда
		ИмяТаблицы = "ПараметрыЗаявки";
	ИначеЕсли ЭтоФормаЖурналаЗаказов(УФ) Тогда
		ИмяТаблицы = "ПараметрыЗаказа";
	ИначеЕсли ЭтоФормаЖурналаГрузоперевозок(УФ) Тогда
		ИмяТаблицы = "ПараметрыГрузоперевозки";
	КонецЕсли;
	
	Попытка
		
		Для каждого ГП Из Грузоперевозки Цикл
			
			Отбор = Новый Структура("Параметр",Параметр);
			СтрокаПараметра = _сф.к_НайтиСтроку(ГП[ИмяТаблицы],Отбор);
			Если (СтрокаПараметра = Неопределено) Тогда
				
				ГПО = ГП.ПолучитьОбъект();
				// ---    
				Нстр = ГПО[ИмяТаблицы].Добавить(); // 05.12.22 Колмаков
                //Нстр = ГПО.ПараметрыГрузоперевозки.Добавить();
				Нстр.Параметр = Параметр;
				// --- 
				ГПО.Записать();
				
			КонецЕсли; 
			
		КонецЦикла; 	
		
	Исключение
		Возврат(_УФКС.СД("Журналы","клиент","/Предупреждение","Ошибка добавления динамического параметра: "+ОписаниеОшибки()));
	КонецПопытки; 
	
	Возврат(_УФКС.СД("Журналы","сервер","/ОбновитьДанные",Грузоперевозки));
	
	// --- 
КонецФункции

&НаСервере
Функция УдалитьДинамическийПараметр(УФ,Параметры)
	
	Параметр = Параметры.Параметр;
	Грузоперевозки = Параметры.Грузоперевозки;
	
	Если ЭтоФормаЖурналаЗаявок(УФ) Тогда
		ИмяТаблицы = "ПараметрыЗаявки";
	ИначеЕсли ЭтоФормаЖурналаЗаказов(УФ) Тогда
		ИмяТаблицы = "ПараметрыЗаказа";
	ИначеЕсли ЭтоФормаЖурналаГрузоперевозок(УФ) Тогда
		ИмяТаблицы = "ПараметрыГрузоперевозки";
	КонецЕсли;
	
	Попытка
		
		Для каждого ГП Из Грузоперевозки Цикл
			
			Отбор = Новый Структура("Параметр",Параметр);
			СтрокаПараметра = _сф.к_НайтиСтроку(ГП[ИмяТаблицы],Отбор);
			Если (СтрокаПараметра <> Неопределено) Тогда
				
				ГПО = ГП.ПолучитьОбъект();
				// --- 
				Нстр = _сф.к_НайтиСтроку(ГПО[ИмяТаблицы],Отбор);
				ГПО[ИмяТаблицы].Удалить(Нстр);
				// --- 
				ГПО.Записать();
				
			КонецЕсли; 
			
		КонецЦикла; 	
		
	Исключение
		Возврат(_УФКС.СД("Журналы","клиент","/Предупреждение","Ошибка удаления динамического параметра: "+ОписаниеОшибки()));
	КонецПопытки; 
	
	Возврат(_УФКС.СД("Журналы","сервер","/ОбновитьДанные",Грузоперевозки));
	
	// --- 
КонецФункции
 
&НаСервере
Функция ПересчитатьДинамическиеПараметры(УФ,Параметры)
	// --- 
	
	Попытка
		
		// перезаписываем текущие грузоперевозки
		Для каждого Стр Из УФ.Журнал_Данные Цикл
			
			ГП = Стр.Ссылка.ПолучитьОбъект();
			ГП.Записать();
			
		КонецЦикла; 
		
	Исключение
		
		ОписаниеОшибкиПересчета = "Ошибка пересчета для грузоперевозки "+Строка(Стр.Ссылка)+": "+ОписаниеОшибки();
		Возврат(_УФКС.СД("Журналы","клиент","/Предупреждение",ОписаниеОшибкиПересчета));
		
	КонецПопытки; 
	
	Возврат(_УФКС.СД("Журналы","сервер","/Обновить"));
	
	// --- 
КонецФункции
 
&НаСервере
Функция ТолькоПросмотрПараметра(Параметр) Экспорт
	ТолькоПросмотр = Истина;
	
	НаборПрав = CW_ПраваДоступа.НаборПравДляПараметров();
	
	
	Попытка
		ТолькоПросмотр = (НЕ НаборПрав["п_"+_сф.КлючПоСсылке(Параметр)].Редактирование);
	Исключение
		ТолькоПросмотр = Истина;
	КонецПопытки; 
	
	Возврат ТолькоПросмотр;
	
КонецФункции


&НаСервере
Функция АдресОбъекта(ТекущийОбъект, УникальныйИдентификатор) Экспорт
	
	ИмяТЧ = CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(ТекущийОбъект);
	
	ТаблицаПараметров = ТекущийОбъект[ИмяТЧ].Выгрузить();

	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Ссылка", 			ТекущийОбъект);
	СтруктураОбъекта.Вставить("ТаблицаПараметров", 	ТаблицаПараметров); 
	
	Возврат(ПоместитьВоВременноеХранилище(СтруктураОбъекта,УникальныйИдентификатор));
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкиВыделенныхСтрок(ФормаОбъета, Знач ВыделенныеСтроки) Экспорт
	
	МассивСсылок = Новый Массив;
	Для Каждого Идентификатор из ВыделенныеСтроки Цикл
		СтрокаЖурнала = ФормаОбъета.Журнал_Данные.НайтиПоИдентификатору(Идентификатор);		
		МассивСсылок.Добавить(СтрокаЖурнала.Ссылка);
	КонецЦикла;
	
	Возврат МассивСсылок;
	
КонецФункции

Функция ИмяТаблицыПоОписаниюТипов(ОписаниеТипов) Экспорт
	
	ТипРеквизита 	= ОписаниеТипов.Типы()[0];
	Метаданное 		= Метаданные.НайтиПоТипу(ТипРеквизита);
	
	ИмяТаблицы 	= "";
	Если Метаданное <> Неопределено тогда  
		ИмяТаблицы 	= Метаданное.ПолноеИмя();
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяТаблицы", 	ИмяТаблицы);
	Результат.Вставить("ТипРеквизита", 	ТипРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначениеРеквизита(Ссылка, СтрокаПоляКомпоновки) Экспорт
	
	Попытка 
		Возврат Вычислить(СтрокаПоляКомпоновки);
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции

Процедура ДополнитьОграниченияКолонок(Массив) Экспорт
	
	Если Не Константы.CW_Мониторинг_Клиент.Получить() Тогда 
		Массив.Добавить("Клиент");  
	КонецЕсли;
	Если Не Константы.CW_Мониторинг_Груз.Получить() Тогда 
		Массив.Добавить("Груз");  
	КонецЕсли;
	Если Не Константы.CW_Мониторинг_Маршрут.Получить() Тогда 
		Массив.Добавить("Маршрут");  
	КонецЕсли;
	Если Не Константы.CW_Мониторинг_МенеджерПродаж.Получить() Тогда 
		Массив.Добавить("МенеджерПродаж");  
	КонецЕсли;
	Если Не Константы.CW_Мониторинг_ОперативныйМенеджер.Получить() Тогда 
		Массив.Добавить("ОперативныйМенеджер");  
	КонецЕсли;
	
КонецПроцедуры
