   
Функция ПолучитьДанныеРегистрациии() Экспорт
	
	ДанныеМонитора = Новый Структура;
	
	//Регистрационные данные
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	Организация 			= CW_ПроверкаЛицензии.ПолучитьНазваниеОрганизации();
	Лицензий				= CW_ПроверкаЛицензии.ПолучитьКоличествоЛицензий(); 
	
	Если ПустаяСтрока(РегистрационныйНомер) и ПустаяСтрока(Организация) и ПустаяСтрока(Лицензий) Тогда
		Возврат "Программа не зарегистрирована!";	
	КонецЕсли;
	
	Логин 					= "";
	Пароль 					= "";
	РегистрационныйНомер 	= ?(ПустаяСтрока(РегистрационныйНомер), "<не указан>" , РегистрационныйНомер);
	
	//Получаем текущий логин
	ДанныеАутентификацииПользователя = ДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ТипЗнч(ДанныеАутентификацииПользователя) = Тип("Структура") Тогда
		ДанныеАутентификацииПользователя.Свойство("Логин",  Логин);
		ДанныеАутентификацииПользователя.Свойство("Пароль", Пароль);
	КонецЕсли;	
	
	РегистрационныйНомерПолучен = ЗначениеЗаполнено(РегистрационныйНомер);
	ЛогинПолучен  				= ЗначениеЗаполнено(Логин);
	ПарольПолучен  				= ЗначениеЗаполнено(Пароль);
	
	ШаблонРегистрационныхДанны = "Регистрационный номер: [РегистрационныйНомер], [Организация], лицензия на [Лицензий] пользователей";

	ШаблонРегистрационныхДанны = СтрЗаменить(ШаблонРегистрационныхДанны,"[РегистрационныйНомер]", 	РегистрационныйНомер);
	ШаблонРегистрационныхДанны = СтрЗаменить(ШаблонРегистрационныхДанны,"[Организация]", 			Организация);
	ШаблонРегистрационныхДанны = СтрЗаменить(ШаблонРегистрационныхДанны,"[Лицензий]", 				Лицензий);
	
	Возврат ШаблонРегистрационныхДанны;
	
КонецФункции
   
Процедура ПодключитьсяКРесурусуОбновлений(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ДанныеМонитора = Новый Структура;
	
	//Регистрационные данные
	ШаблонРегистрационныхДанны = "[РегистрационныйНомер], [Организация], лицензия на [Лицензий] пользователей";
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	Организация 			= CW_ПроверкаЛицензии.ПолучитьНазваниеОрганизации();
	Лицензий				= CW_ПроверкаЛицензии.ПолучитьКоличествоЛицензий();
	
	Логин 					= "<не указан>";
	Пароль 					= "";
	РегистрационныйНомер 	= ?(ПустаяСтрока(РегистрационныйНомер), "<не указан>" , РегистрационныйНомер);
	
	//Получаем текущий логин
	ДанныеАутентификацииПользователя = ДанныеАутентификацииПользователяИнтернетПоддержки();
	
	Если ТипЗнч(ДанныеАутентификацииПользователя) = Тип("Структура") Тогда
		ДанныеАутентификацииПользователя.Свойство("Логин",  Логин);
		ДанныеАутентификацииПользователя.Свойство("Пароль", Пароль);
	КонецЕсли;	
	
	HTTPСоединение = CW_ИсправленияКонфигурации.ПодключитьсяКРесурусуОбновлений(Логин, Пароль);
	АвторизацияВыполнена = НЕ HTTPСоединение = Неопределено;
	
	РегистрационныйНомерПолучен = ЗначениеЗаполнено(РегистрационныйНомер);
	ЛогинПолучен  				= ЗначениеЗаполнено(Логин);
	ПарольПолучен  				= ЗначениеЗаполнено(Пароль);
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("ЛогинПолучен",					ЛогинПолучен); 
	РегистрационныеДанные.Вставить("ПарольПолучен",					ПарольПолучен); 
	РегистрационныеДанные.Вставить("РегистрационныйНомерПолучен",	РегистрационныйНомерПолучен); 
	РегистрационныеДанные.Вставить("ДанныеРегистрации",				ШаблонРегистрационныхДанны); 
	РегистрационныеДанные.Вставить("АвторизацияВыполнена",			АвторизацияВыполнена); 

	ДанныеМонитора.Вставить("РегистрационныеДанные", РегистрационныеДанные);
	
	ПоместитьВоВременноеХранилище(ДанныеМонитора, АдресРезультата);
	
КонецПроцедуры

Процедура ПолучитьИнформациюОбОбновлениях(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	//Обновления версии
	АдресОбновлений = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ДанныеМонитора  = Новый Структура;
	
	ОбновленияВерсии = Новый Структура;
	ОбновленияВерсии.Вставить("ЕстьОбновление",		 	Ложь); 
	ОбновленияВерсии.Вставить("ЕстьИсправление",	 	Ложь); 
	ОбновленияВерсии.Вставить("ЕстьДополнения", 		Ложь);
	ОбновленияВерсии.Вставить("ТекущаяВерсия",		 	""); 
	ОбновленияВерсии.Вставить("НоваяВерсия",		 	""); 
	ОбновленияВерсии.Вставить("КоличествоИсправлений", 	0); 
	ОбновленияВерсии.Вставить("КоличествоДополнений", 	0); 
	ОбновленияВерсии.Вставить("ОписаниеВерсии",		 	""); 
	ОбновленияВерсии.Вставить("ОписаниеИсправлений", 	""); 
	ОбновленияВерсии.Вставить("АвторизацияВыполнена", 	Ложь); 
	
	ДанныеАутентификации = CW_МониторПорталаПоддержкиСервер.ДанныеАутентификацииПользователяИнтернетПоддержки();
	
	Если ДанныеАутентификации <> Неопределено Тогда
		HTTPСоединение = CW_ИсправленияКонфигурации.ПодключитьсяКРесурусуОбновлений(ДанныеАутентификации.Логин, ДанныеАутентификации.Пароль);
		АвторизацияВыполнена = НЕ HTTPСоединение = Неопределено;
		
		ОбновленияВерсии.Вставить("АвторизацияВыполнена", 	АвторизацияВыполнена); 
	КонецЕсли;
	
	ПараметрыПроцедуры = новый Структура;
	ПараметрыПроцедуры.Вставить("ПроверитьИсправления", Истина);   
	ПараметрыПроцедуры.Вставить("ПроверитьДополнения", Истина);   
	
	CW_ОбновлениеКонфигурацииСервер.ВыполнитьПроверкуОбновленийКонфигурации(ПараметрыПроцедуры, АдресОбновлений);
	Ответ = ПолучитьИзВременногоХранилища(АдресОбновлений);
	
	Если Ответ <> Неопределено Тогда
		ОбновленияВерсии.Вставить("ЕстьОбновление",		 	Ответ.ЕстьОбновление); 
		ОбновленияВерсии.Вставить("ЕстьИсправление",	 	Ответ.ЕстьИсправление); 
		ОбновленияВерсии.Вставить("ЕстьДополнения", 		Ответ.ЕстьДополнения);
		ОбновленияВерсии.Вставить("ТекущаяВерсия",		 	Ответ.ТекущаяВерсия); 
		ОбновленияВерсии.Вставить("НоваяВерсия",		 	Ответ.ПоследняяВерсия); 
		ОбновленияВерсии.Вставить("КоличествоИсправлений", 	Ответ.КоличествоИсправлений); 
		ОбновленияВерсии.Вставить("КоличествоДополнений", 	Ответ.КоличествоДополнений); 
		ОбновленияВерсии.Вставить("ОписаниеВерсии",		 	Ответ.ОписаниеВерсии); 
		ОбновленияВерсии.Вставить("ОписаниеИсправлений", 	Ответ.ОписаниеИсправлений); 
	КонецЕсли;
	//Обновления версии
	
	ДанныеМонитора.Вставить("ОбновленияВерсии", ОбновленияВерсии);
	
	ПоместитьВоВременноеХранилище(ДанныеМонитора, АдресРезультата);
	
КонецПроцедуры

Процедура ПолучитьДанныеПодискиНаОбновления(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ДанныеМонитора = Новый Структура;
	
	ПодпискаНаОбновления = Новый Структура;
	ПодпискаНаОбновления.Вставить("ДатаОкончания",  				Дата(1,1,1)); 
	ПодпискаНаОбновления.Вставить("ПодпискаЗаканчивается", 			Ложь); 
	ПодпискаНаОбновления.Вставить("СледующаяОформлена", 			Ложь); 
	ПодпискаНаОбновления.Вставить("ПодпискаФормлена", 				Ложь); 
	ПодпискаНаОбновления.Вставить("Состояние", 						""); 
	ПодпискаНаОбновления.Вставить("ОшибкаПолученияДанных", 			Истина); 
	ПодпискаНаОбновления.Вставить("АвтоматическиВыписыватьСчета",	Ложь); 
	
	//Подписка на обновления
	Результат = CW_ОбновлениеКонфигурацииСервер.ПолучитьДанныеПодпискиНаОбновление(10);  
	Если Результат.КодСостояния = 200 Тогда
		
		ПодпискаЗаканчивается = Результат.ДатаОкончания = НачалоДня(КонецМесяца(ТекущаяДата())) или  Результат.ДатаОкончания = Дата(1,1,1);
		
		ПодпискаНаОбновления.Вставить("ДатаОкончания",  				Результат.ДатаОкончания); 
		ПодпискаНаОбновления.Вставить("ПодпискаЗаканчивается", 			ПодпискаЗаканчивается); 
		ПодпискаНаОбновления.Вставить("СледующаяОформлена", 			Результат.СледующаяОформлена); 
		ПодпискаНаОбновления.Вставить("ПодпискаФормлена", 				Результат.ПодпискаФормлена); 
		ПодпискаНаОбновления.Вставить("Состояние", 						Результат.Состояние); 
		ПодпискаНаОбновления.Вставить("АвтоматическиВыписыватьСчета",	Результат.АвтоматическиВыписыватьСчета); 
		ПодпискаНаОбновления.Вставить("ОшибкаПолученияДанных", 			Ложь); 
		
	КонецЕсли;
	
	ДанныеМонитора.Вставить("ПодпискаНаОбновления", ПодпискаНаОбновления);
	//Подписка на обновления
	
	ПоместитьВоВременноеХранилище(ДанныеМонитора, АдресРезультата);
	
КонецПроцедуры

Функция ИдентификаторПодсистемы() Экспорт
	
	Возврат "CW_ПоддержкаПользователей.ПорталПоддержки";
	
КонецФункции

// Проверяет заполнение данных аутентификации пользователя
// Интернет-поддержки.
//
// Возвращаемое значение:
//  Булево - признак заполнения данных аутентификации.
//      Истина - данные аутентификации заполнены,
//      Ложь - в противном случае.
//
Функция ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат (ДанныеАутентификацииПользователяИнтернетПоддержки() <> Неопределено);
	
КонецФункции

// Возвращает логин и пароль пользователя Интернет-поддержки,
// сохраненные в информационной базе.
// Перед вызовом вызывающий код должен устанавливать привилегированный режим.
//
// Возвращаемое значение:
//  Структура - структура, содержащая логин и пароль пользователя
//              Интернет-поддержки:
//     * Логин - Строка - логин пользователя Интернет-поддержки;
//     * Пароль - Строка - пароль пользователя Интернет-поддержки.
//   Неопределено - при отсутствии сохраненных данных аутентификации.
//
Функция ДанныеАутентификацииПользователяИнтернетПоддержки() Экспорт

	ДанныеВБезопасномХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ИдентификаторПодсистемы(),
		"login,password");

	Если ДанныеВБезопасномХранилище.login <> Неопределено
		И ДанныеВБезопасномХранилище.password <> Неопределено Тогда
		Возврат Новый Структура(
			"Логин, Пароль",
			ДанныеВБезопасномХранилище.login,
			ДанныеВБезопасномХранилище.password);
	КонецЕсли;

КонецФункции   

Процедура ОбновитьДанныеАвтоматическойВыпискиСчетов(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	Результат = Новый Структура;
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	Если ПустаяСтрока(РегистрационныйНомер) Тогда
		Результат.Вставить("КодСостояния",	403);
		Результат.Вставить("Состояние",		"Программный продукт не зарегистрирован!");
	Иначе
		
		versionaf = CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы(); 
		
		СтруктураJSON = Новый Структура;
		СтруктураJSON.Вставить("regnumber",		XMLСтрока(РегистрационныйНомер)); 
		СтруктураJSON.Вставить("autoinvoice",	XMLСтрока(ПараметрыПроцедуры.Значение)); 
		
		ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("af_autoinvoice", СтруктураJSON);
		
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");
		Результат.Вставить("КодСостояния", Ответ.КодСостояния);
		Результат.Вставить("Состояние", Ответ.ПолучитьтелоКакСтроку());
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры  

Функция ПолучитьURLНовойВерсии(Знач Версия) Экспорт
	
	ИмяВерсии = СтрЗаменить(Версия, ".", "_");
	
	ИмяКонфигурации = CW_ОбновлениеКонфигурацииСервер.ПолучитьКороткоеИмяКонфигурации();
	Если ИмяКонфигурации = "" Тогда
		Возврат ложь;
	КонецЕсли;
	
	Возврат "https://www.coralway.ru/products/programs_cw/"+ИмяКонфигурации+"/Version/New%20AF8%20ver_"+ ИмяВерсии +".pdf";

КонецФункции

