Функция ПолучитьСоответствиеСвойствПараметров() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка,
	               |	CW_ПараметрыГрузоперевозок.Наименование КАК Наименование,
	               |	CW_ПараметрыГрузоперевозок.ПрямоеРедактирование КАК ПрямоеРедактирование,
	               |	CW_ПараметрыГрузоперевозок.ЭтоКонтрольнаяДата КАК ЭтоКонтрольнаяДата,
	               |	CW_ПараметрыГрузоперевозок.ДинамическийПараметр КАК ДинамическийПараметр,
	               |	CW_ПараметрыГрузоперевозок.Идентификатор КАК Идентификатор,
	               |	CW_ПараметрыГрузоперевозок.ЕжедневныйПересчет КАК ЕжедневныйПересчет,
	               |	CW_ПараметрыГрузоперевозок.ЛимитПросрочкиКонтрольнойДаты КАК ЛимитПросрочкиКонтрольнойДаты,
	               |	CW_ПараметрыГрузоперевозок.Родитель КАК Родитель,
	               |	CW_ПараметрыГрузоперевозок.ФорматВывода КАК ФорматВывода,
	               |	CW_ПараметрыГрузоперевозок.КонтрольнаяДатаИспользуетВремя КАК КонтрольнаяДатаИспользуетВремя,
	               |	CW_ПараметрыГрузоперевозок.ТипЗначения КАК ТипЗначения,
	               |	CW_ПараметрыГрузоперевозок.ОбработкаИзменения КАК ОбработкаИзменения,
	               |	CW_ПараметрыГрузоперевозок.ВнешняяОбработкаИзменения КАК ВнешняяОбработкаИзменения,
	               |	CW_ПараметрыГрузоперевозок.ИспользованиеОтбора КАК ИспользованиеОтбора,
	               |	CW_ПараметрыГрузоперевозок.ИдентификаторПлан КАК ИдентификаторПлан,
	               |	CW_ПараметрыГрузоперевозок.ИдентификаторФакт КАК ИдентификаторФакт,
	               |	CW_ПараметрыГрузоперевозок.МножественноеПрямоеРедактирование КАК МножественноеПрямоеРедактирование,
	               |	CW_ПараметрыГрузоперевозок.ИспользуемыеПараметры.(
	               |		Параметр КАК Параметр
	               |	) КАК ИспользуемыеПараметры
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Соответствие = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураСвойств = Новый Структура("Наименование,Идентификатор,ИдентификаторПлан,ИдентификаторФакт,Родитель,ПрямоеРедактирование,ЭтоКонтрольнаяДата,КонтрольнаяДатаИспользуетВремя,ЛимитПросрочкиКонтрольнойДаты,ДинамическийПараметр,ЕжедневныйПересчет,ФорматВывода,ТипЗначения,ОбработкаИзменения,ВнешняяОбработкаИзменения,ИспользованиеОтбора,МножественноеПрямоеРедактирование");
		
		ЗаполнитьЗначенияСвойств(СтруктураСвойств,Выборка);
		
		Если Выборка.ДинамическийПараметр Тогда
			ИспользуемыеПараметры 	= Выборка.ИспользуемыеПараметры.Выгрузить();
			
			СтруктураСвойств.Вставить("ИспользуемыеПараметры"		, ИспользуемыеПараметры.ВыгрузитьКолонку("Параметр"));
			СтруктураСвойств.Вставить("ЕстьИспользуемыеПараметры"	,?(ИспользуемыеПараметры.Количество()= 0, Ложь, Истина));
		КонецЕсли; 
		
		Соответствие.Вставить(Выборка.Ссылка, СтруктураСвойств);
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции