// Механизм расчета статусов оформления документов ИС МП.
//

#Область СлужебныйПрограммныйИнтерфейс

// Позволяет переопределить имена реквизитов документа-основания для документа ИСМП.
//
// Параметры:
//  МетаданныеДокументаОснования - ОбъектМетаданных - метаданные документа из ОпределяемыйТип.Основание<Имя документа ИСМП>
//  МетаданныеДокументаИСМП - ОбъектМетаданных - метаданные документа из ОпределяемыйТип.ДокументыИСМППоддерживающиеСтатусыОформления
//  Реквизиты  - Структура - имена реквизитов:
//  * Ключ  - служебное имя реквизита в ИСМП
//  * Значение - имя реквизита документа-основания, которое при необходимости надо переопределить
//  (см. РасчетСтатусовОформленияИСМП.СтруктураРеквизитовДляРасчетаСтатусаОформленияДокументов).
Процедура ПриОпределенииИменРеквизитовДляРасчетаСтатусаОформления(
			Знач МетаданныеДокументаОснования, Знач МетаданныеДокументаИСМП, Реквизиты) Экспорт
	
	// Зададим имена реквизитов по умолчанию.
	Реквизиты.Контрагент = "Организация";
	
	Если МетаданныеДокументаОснования = Метаданные.Документы.ПроизводственнаяОперацияВЕТИС Тогда
		Реквизиты.Контрагент = "ХозяйствующийСубъект";
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ВходящаяТранспортнаяОперацияВЕТИС Тогда
		Реквизиты.Контрагент = "ГрузополучательХозяйствующийСубъект";
	КонецЕсли;
		
	// Определим имя реквизита "Ответственный".
	Если МетаданныеДокументаОснования.Реквизиты.Найти("Кассир") <> Неопределено Тогда
		Реквизиты.Ответственный = "Кассир";
	Иначе
		Реквизиты.Ответственный = "Ответственный";
	КонецЕсли;
	
КонецПроцедуры

// Позволяет переопределить текст запроса выборки данных из документов-основания для расчета статуса оформления.
//   Требования к тексту запроса:
//     Если данные из документа выбирать не требуется, переопределение также не заполнять.
//     Результат запроса обязательно должен содержать следующие поля:
//      * Ссылка - ОпределяемыйТип.Основание<Имя документа ИСМП> - ссылка на документ-основание
//      * ЭтоДвижениеПриход - Булево - вид движения ТМЦ (Истина - приход, Ложь - расход)
//      * Номенклатура - ОпределяемыйТип.Номенклатура - номенклатура
//      * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика номенклатуры
//      * Серия - ОпределяемыйТип.СерияНоменклатуры - серия номенклатуры
//      * Количество - Число - количество номенклатуры в ее основной единице измерения
//     В результат запроса нужно включать только подконтрольную номенклатуру ИСМП (табак, обувь)
//     Для отбора документов-основания в запросе нужно использовать отбор "В (&МассивДокументов)"
//     Выбранные данные необходимо поместить во временную таблицу (См. РасчетСтатусовОформленияИС.ИмяВременнойТаблицыДляВыборкиДанныхДокумента).
//
Процедура ПриОпределенииТекстаЗапросаДляРасчетаСтатусаОформления(
			Знач МетаданныеДокументаОснования, Знач МетаданныеДокументаИСМП, ТекстЗапроса, ДополнительныеПараметрыЗапроса) Экспорт
	
	Если МетаданныеДокументаОснования = Метаданные.Документы.ОтчетПроизводстваЗаСмену
		И МетаданныеДокументаИСМП = Метаданные.Документы.МаркировкаТоваровИСМП Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|
		|ГДЕ
		|	ТаблицаТовары.Ссылка В (&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)";
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ПоступлениеИзПереработки
		И МетаданныеДокументаИСМП = Метаданные.Документы.МаркировкаТоваровИСМП Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.ПоступлениеИзПереработки.Продукция КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|
		|ГДЕ
		|	ТаблицаТовары.Ссылка В (&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)";
		
	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.СписаниеТоваров
		И МетаданныеДокументаИСМП = Метаданные.Документы.ВыводИзОборотаИСМП) Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.СписаниеТоваров.Товары КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|
		|ГДЕ
		|	ТаблицаТовары.Ссылка В (&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)";
		
	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.ТребованиеНакладная
		И МетаданныеДокументаИСМП = Метаданные.Документы.ВыводИзОборотаИСМП) Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.ТребованиеНакладная.Материалы КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|
		|ГДЕ
		|	ТаблицаТовары.Ссылка В (&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)";
		
	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.РеализацияТоваровУслуг
		И МетаданныеДокументаИСМП = Метаданные.Документы.ВыводИзОборотаИСМП) Тогда
		
		// Если на основании реализации есть оформленный документ ЭДО, 
		// то "Отгрузка товаров ИСМП" на его основании создавать не надо
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СправочникКонтрагенты
		|	ПО ТаблицаТовары.Ссылка.Контрагент = СправочникКонтрагенты.Ссылка
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
		|	И НЕ(СправочникКонтрагенты.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|				И СправочникКонтрагенты.СтранаРегистрации.УчастникЕАЭС = ИСТИНА
		|				И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ В (&ВидыПродукцииРазрешенияНаОтгрузку))
		|	И НЕ 1 В
		|				(ВЫБРАТЬ
		|					1
		|				ИЗ
		|					РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
		|				ГДЕ
		|					ОбъектыУчетаДокументовЭДО.ОбъектУчета = ТаблицаТовары.Ссылка
		|					И ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент.СодержитМаркируемыеТовары)
		|	И ТаблицаТовары.Ссылка.ПередачаДляСобственныхНуждИСМП";

	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.ОприходованиеТоваров
		И МетаданныеДокументаИСМП = Метаданные.Документы.МаркировкаТоваровИСМП) Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.ОприходованиеТоваров.Товары КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|
		|ГДЕ
		|	ТаблицаТовары.Ссылка В (&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)";
		
	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.ВозвратТоваровОтПокупателя
		И МетаданныеДокументаИСМП = Метаданные.Документы.ПеремаркировкаТоваровИСМП) Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
		|	И ТаблицаТовары.Ссылка.Сделка ССЫЛКА Документ.ОтчетОРозничныхПродажах";
		
	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.ОтчетОРозничныхПродажах
		И МетаданныеДокументаИСМП = Метаданные.Документы.ПеремаркировкаТоваровИСМП) Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах.Возвраты КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)";
		
	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.РеализацияТоваровУслуг
		И МетаданныеДокументаИСМП = Метаданные.Документы.ОтгрузкаТоваровИСМП) Тогда
		
		// Если на основании реализации есть оформленный документ ЭДО, 
		// то "Отгрузка товаров ИСМП" на его основании создавать не надо
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СправочникКонтрагенты
		|	ПО ТаблицаТовары.Ссылка.Контрагент = СправочникКонтрагенты.Ссылка
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивДокументов)
		|	И СправочникКонтрагенты.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
		|	И СправочникКонтрагенты.СтранаРегистрации.УчастникЕАЭС = ИСТИНА
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ В (&ВидыПродукцииРазрешенияНаОтгрузку)
		|	И НЕ 1 В
		|				(ВЫБРАТЬ
		|					1
		|				ИЗ
		|					РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
		|				ГДЕ
		|					ОбъектыУчетаДокументовЭДО.ОбъектУчета = ТаблицаТовары.Ссылка
		|					И ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент.СодержитМаркируемыеТовары)";
		
		
	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.ВозвратТоваровПоставщику
		И МетаданныеДокументаИСМП = Метаданные.Документы.ОтгрузкаТоваровИСМП) Тогда
		
		// Если на основании реализации есть оформленный документ ЭДО, 
		// то "Отгрузка товаров ИСМП" на его основании создавать не надо
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику.Товары КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ В (&ВидыПродукцииРазрешенияНаОтгрузку)
		|	И НЕ(1 В (ВЫБРАТЬ 1 Из РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО 
		|			ГДЕ ОбъектыУчетаДокументовЭДО.ОбъектУчета = ТаблицаТовары.Ссылка 
		|			И ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент.СодержитМаркируемыеТовары))";
		
	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.ПоступлениеТоваровУслуг
		И МетаданныеДокументаИСМП = Метаданные.Документы.ПриемкаТоваровИСМП) Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
		|	И (1 В (ВЫБРАТЬ 1 ИЗ Документ.ПриемкаТоваровИСМП КАК ПриемкаТоваровИСМП 
		|		ГДЕ ПриемкаТоваровИСМП.ДокументОснование = ТаблицаТовары.Ссылка))";
		
	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.ВозвратТоваровОтПокупателя
		И МетаданныеДокументаИСМП = Метаданные.Документы.ПриемкаТоваровИСМП) Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)
		|	И (1 В (ВЫБРАТЬ 1 ИЗ Документ.ПриемкаТоваровИСМП КАК ПриемкаТоваровИСМП 
		|		ГДЕ ПриемкаТоваровИСМП.ДокументОснование = ТаблицаТовары.Ссылка))";
		
	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.ПередачаТоваров
		И МетаданныеДокументаИСМП = Метаданные.Документы.ОтгрузкаТоваровИСМП) Тогда
		
		// Если на основании реализации есть оформленный документ ЭДО, 
		// то "Отгрузка товаров ИСМП" на его основании создавать не надо
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Ссылка КАК Ссылка,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	"""" КАК Характеристика,
		|	"""" КАК Серия,
		|	ТаблицаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	Документ.ПередачаТоваров.Товары КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура 
		|ГДЕ
		|	ТаблицаТовары.Ссылка В(&МассивДокументов)
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ В (&ВидыПродукцииРазрешенияНаОтгрузку)
		|	И НЕ(1 В (ВЫБРАТЬ 1 Из РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО 
		|			ГДЕ ОбъектыУчетаДокументовЭДО.ОбъектУчета = ТаблицаТовары.Ссылка 
		|			И ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент.СодержитМаркируемыеТовары))";
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.РеализацияТоваровУслуг 
		И МетаданныеДокументаИСМП = Метаданные.Документы.РазрешениеНаОтгрузкуИСМП Тогда
	    ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	ИСТИНА КАК ЭтоДвижениеПриход,
		|	РеализацияТоваровУслуг.Дата КАК ДатаДокумента,
		|	1 КАК Количество
		|ПОМЕСТИТЬ втТоварыДокументаОснования
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|	ПО РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДатаНачалаУчета КАК ТаблицаДатаНачалаУчета
		|		ПО ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ = ТаблицаДатаНачалаУчета.ВидПродукции
		|		И ТаблицаДатаНачалаУчета.ДатаНачалаУчетаПеремещенияМеждуМОД > ДАТАВРЕМЯ(1,1,1)
		|	ПО РеализацияТоваровУслугТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)
		|	И РеализацияТоваровУслуг.Проведен
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ В (&ВидыПродукцииРазрешенияНаОтгрузку)
		|	И НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ) >= ТаблицаДатаНачалаУчета.ДатаНачалаУчетаПеремещенияМеждуМОД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТоварыДокумента.Ссылка КАК Ссылка,
		|	втТоварыДокумента.ЭтоДвижениеПриход КАК ЭтоДвижениеПриход,
		|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК Характеристика,
		|	НЕОПРЕДЕЛЕНО КАК Серия,
		|	втТоварыДокумента.Количество КАК Количество
		|ПОМЕСТИТЬ %1
		|ИЗ
		|	втТоварыДокументаОснования КАК втТоварыДокумента
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
		|	ПО втТоварыДокумента.Ссылка = ОбъектыУчетаДокументовЭДО.ОбъектУчета
		|	И (ОбъектыУчетаДокументовЭДО.Актуальный)
		|	И (ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент ССЫЛКА Документ.ЭлектронныйДокументИсходящийЭДО)";

		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДатаНачалаУчета.ВидПродукции КАК ВидПродукции,
		|	ТаблицаДатаНачалаУчета.ДатаНачалаУчетаПеремещенияМеждуМОД КАК ДатаНачалаУчетаПеремещенияМеждуМОД
		|ПОМЕСТИТЬ ТаблицаДатаНачалаУчета
		|ИЗ
		|	&ТаблицаДатаНачалаУчета КАК ТаблицаДатаНачалаУчета
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////////
		|" + ТекстЗапроса;
		ДополнительныеПараметрыЗапроса.Вставить("ТаблицаДатаНачалаУчета", ТаблицаДатаНачалаУчета());

		СоответствиеТребованиямГИСМТ.ДополнитьТекстРасчетаСтатусовДляРазрешенияНаОтгрузкуИСМП(ТекстЗапроса);
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ПеремещениеТоваров 
		И МетаданныеДокументаИСМП = Метаданные.Документы.ПеремещениеМеждуМОДИСМП Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаТовары.Ссылка 		КАК Ссылка,
		|	ИСТИНА               		КАК ЭтоДвижениеПриход,
		|	ТаблицаТовары.Номенклатура 	КАК Номенклатура,
		|	""""         				КАК Характеристика,
		|	""""         				КАК Серия,
		|	ТаблицаТовары.Количество 	КАК Количество,
		|	ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ КАК ВидПродукцииИС,
		|	ТаблицаДокумента.Дата		КАК Дата
		|
		|ПОМЕСТИТЬ ВремТаблицаТовары
		|ИЗ
		|	&ИмяТаблицыТовары КАК ТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ &ИмяТаблицыДокумента КАК ТаблицаДокумента
		|	ПО ТаблицаДокумента.Ссылка = ТаблицаТовары.Ссылка
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|	ПО ТаблицаТовары.Номенклатура = ОписаниеНоменклатурыИС.Номенклатура
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В (&МассивДокументов)
		|   И ТаблицаДокумента.Проведен
		|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииГИСМТ В (&ВидыПродукцииПеремещенияМеждуМОД)
		|;
		|   ВЫБРАТЬ
		|	ВремТаблицаТовары.Ссылка,
		|	ВремТаблицаТовары.ЭтоДвижениеПриход,
		|	ВремТаблицаТовары.Номенклатура,
		|	ВремТаблицаТовары.Характеристика,
		|	ВремТаблицаТовары.Серия,
		|	ВремТаблицаТовары.Количество
		|ПОМЕСТИТЬ %1
		|ИЗ ВремТаблицаТовары КАК ВремТаблицаТовары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДатаНачалаУчета КАК ТаблицаДатаНачалаУчета
		|	ПО ВремТаблицаТовары.ВидПродукцииИС = ТаблицаДатаНачалаУчета.ВидПродукции
		|	И ТаблицаДатаНачалаУчета.ДатаНачалаУчетаПеремещенияМеждуМОД > ДАТАВРЕМЯ(1,1,1)
		|	И НАЧАЛОПЕРИОДА(ВремТаблицаТовары.Дата, ДЕНЬ) >= ТаблицаДатаНачалаУчета.ДатаНачалаУчетаПеремещенияМеждуМОД
		|";
		 	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицыТовары",    СтрШаблон("Документ.%1.Товары", МетаданныеДокументаОснования.Имя));
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицыДокумента", СтрШаблон("Документ.%1", МетаданныеДокументаОснования.Имя));
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДатаНачалаУчета.ВидПродукции КАК ВидПродукции,
		|	ТаблицаДатаНачалаУчета.ДатаНачалаУчетаПеремещенияМеждуМОД КАК ДатаНачалаУчетаПеремещенияМеждуМОД
		|ПОМЕСТИТЬ ТаблицаДатаНачалаУчета
		|ИЗ
		|	&ТаблицаДатаНачалаУчета КАК ТаблицаДатаНачалаУчета
		|;
		|///////////////////////////////////////////////////////////////////////////////////////////////////
		|" + ТекстЗапроса;
		ДополнительныеПараметрыЗапроса.Вставить("ТаблицаДатаНачалаУчета", ТаблицаДатаНачалаУчета());
		
	ИначеЕсли (МетаданныеДокументаОснования = Метаданные.Документы.МаркировкаТоваровИСМП
		И МетаданныеДокументаИСМП = Метаданные.Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ) Тогда
		//Опеределяется в библиотеке 
	
	Иначе
		
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЛОЖЬ		 КАК ЭтоДвижениеПриход,
		|	НЕОПРЕДЕЛЕНО КАК Ссылка,
		|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК Характеристика,
		|	НЕОПРЕДЕЛЕНО КАК Серия,
		|	0 			 КАК Количество
		|ПОМЕСТИТЬ %1";
		
	КонецЕсли;
	
	ВидыПродукцииРазрешенияНаОтгрузку = КонструкторИСМПКлиентСервер.ВидыПродукцииТребующиеРазрешенияНаОтгрузку();
	ДополнительныеПараметрыЗапроса.Вставить("ВидыПродукцииРазрешенияНаОтгрузку", ВидыПродукцииРазрешенияНаОтгрузку);
	ВидыПродукцииПеремещенияМеждуМОД = КонструкторИСМПКлиентСервер.ВидыПродукцииВнутреннегоПеремещенияМеждуМОД();
	ДополнительныеПараметрыЗапроса.Вставить("ВидыПродукцииПеремещенияМеждуМОД", ВидыПродукцииПеремещенияМеждуМОД);
		
КонецПроцедуры

//Формирует дополнительную таблицу дат учета в запрос статсуов
//Параметры: нет
//
//Возвращаемое значение: ТаблицаДатаНачалаУчета Тип("ТаблицаЗначений")
//
Функция ТаблицаДатаНачалаУчета() Экспорт
	
	ВидыПродукции = КонструкторИСМПКлиентСервер.ВидыПродукцииПрослеживаемогоПеремещенияМеждуМОД();
	
	ТаблицаДатаНачалаУчета = Новый ТаблицаЗначений;
	ТаблицаДатаНачалаУчета.Колонки.Добавить("ВидПродукции"						, Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС"));
	ТаблицаДатаНачалаУчета.Колонки.Добавить("ДатаНачалаУчетаПеремещенияМеждуМОД", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		НоваяСтрока = ТаблицаДатаНачалаУчета.Добавить();
		НоваяСтрока.ВидПродукции 						= ВидПродукции;
		НоваяСтрока.ДатаНачалаУчетаПеремещенияМеждуМОД 	= КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаПрослеживаемостиПеремещенияМеждуМОД(ВидПродукции);
	КонецЦикла;
	
	Возврат ТаблицаДатаНачалаУчета;
	
КонецФункции

#КонецОбласти
