
Процедура ПриОткрытии(Форма, Отказ) Экспорт          
	
	Оповещение = Новый ОписаниеОповещения("ЗавешитьРасширенныеНастройкиМодуля", Форма);
	
	CW_РегистрацияПрограммыКлиент.ПрименитьРасширенныеНастройкиМодуля(Оповещение);
	
КонецПроцедуры  

Процедура ПоказатьОшибкуИсполнения(ТекстОшибки, ТекстОписанияОшибки ="", Источник) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТекстОшибки",			ТекстОшибки);
	СтруктураПараметров.Вставить("ТекстОписанияОшибки",	ТекстОписанияОшибки);    
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаОшибки", СтруктураПараметров, Источник,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры