#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Справка-расчет вознаграждения";
	СтруктураОписания.Описание 					= "Справка-расчет вознаграждения";
	СтруктураОписания.Версия					= "3.2.8.1";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.15.8";
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления
	
	Возврат СтруктураОписания;
	
КонецФункции

//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления

// функция, осуществляющая регистрацию печатной формы для перечисленных объектов метаданных
Процедура Регистрация(Ссылка) Экспорт
	
	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_ЗакрытиеГрузоперевозки");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "Справка-расчет вознаграждения"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		
	
	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);
	
КонецПроцедуры

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	Возврат Истина;
	
КонецФункции


Функция ПечатнаяФорма(НастройкиПечати = Неопределено) Экспорт
	
	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	КонецЕсли;
	
	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();
	
	РезультатПечати.Параметры.Количество = 2;
	РезультатПечати.Параметры.Печать 	 = Истина;  
	
	
	Ссылка = СсылкаНаОбъект;
	
	// ---------------------------------------------------------------------------- 
	// формируем представление
	
	НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Ссылка.ВедомыйДокумент);
	ДатаДокумента = Формат(Ссылка.ВедомыйДокумент.Дата,"ДФ=dd.MM.yyyy");
	ПредставлениеДокумента = "Справка-расчет вознаграждения №"+НомерДокумента+" от "+Формат(ДатаДокумента,"ДФ=dd.MM.yyyy");
	
	// --- 
	
	РезультатПечати.Представление = ПредставлениеДокумента;
	
	//Установка представления печатной формы
	ДанныеДляЗаполнения = Новый Структура;
	ДанныеДляЗаполнения.Вставить("НомерДокумента", НомерДокумента);
	ДанныеДляЗаполнения.Вставить("ДатаДокумента",  ДатаДокумента);
	
	CW_Печать.УстановитьПредставлениеПоШаблону(РезультатПечати.Представление, НастройкиПечати, ДанныеДляЗаполнения);
	//Установка представления печатной формы
	
	// ---------------------------------------------------------------------------- 
	// формируем печатную форму
	
	ТабличныйДокумент =Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб=Истина;
	Макет = ПолучитьМакет("Макет");
	
	// получаем настройку из учетной политики...
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= Ссылка.Дата;
	СтруктураПараметров.Договор 			= Ссылка.Договор;
	СтруктураПараметров.ПриложениеКДоговору = Ссылка.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
	
	
	ПолноеНаименованиеКонтрагента = Ссылка.Контрагент.НаименованиеПолное;
	
	Шапка = Макет.ПолучитьОбласть("ВерхняяЧасть");
	ШапкаРасходы = Макет.ПолучитьОбласть("ШапкаРасходы");
	СтрокаРасходы = Макет.ПолучитьОбласть("СтрокаРасходы");
	ПодвалРасходы = Макет.ПолучитьОбласть("ПодвалРасходы");
	
	ШапкаДоходы = Макет.ПолучитьОбласть("ШапкаДоходы");
	СтрокаДоходы = Макет.ПолучитьОбласть("СтрокаДоходы");
	ПодвалДоходы = Макет.ПолучитьОбласть("ПодвалДоходы");
	
	ШапкаВознаграждение = Макет.ПолучитьОбласть("ШапкаВознаграждение");
	СтрокаВознаграждение = Макет.ПолучитьОбласть("СтрокаВознаграждение");
	ПодвалВознаграждение = Макет.ПолучитьОбласть("ПодвалВознаграждение");
	
	Подписи = Макет.ПолучитьОбласть("Подвал");
	
	// ---------------------------------------------------------------------------- 
	Шапка.Параметры.Заголовок = "Справка-расчет вознаграждения №" + CW_Документы.ПолучитьНомерНаПечать(Ссылка) + " от " + Формат(Ссылка.Дата,"ДФ=dd.MM.yyyy");
	
	Если Ссылка.ЗакрытиеПоЗаказу Тогда
		Шапка.Параметры.Аналитика = "заказу";
	Иначе
		Шапка.Параметры.Аналитика = "грузоперевозке";
	КонецЕсли;
	
	Шапка.Параметры.ЗначениеАналитики = Строка(Ссылка.Аналитика);
	Шапка.Параметры.Договор = "№" + Строка(Ссылка.Договор.НомерДоговора) + " от " + Формат(Ссылка.Договор.ДатаДоговора, "ДФ=dd.MM.yyyy");
	Шапка.Параметры.Контрагент = Строка(Ссылка.Контрагент.НаименованиеПолное);
	
	ТабличныйДокумент.Вывести(Шапка);
	
	Валюта = CW_Настройки.ВалютаРегламентированногоУчета();
	
	ШапкаРасходы.Параметры.Валюта = Валюта;
	ТабличныйДокумент.Вывести(ШапкаРасходы);
	
	ВсегоСтрокДляВывода = 0;
	Для каждого усл Из Ссылка.Расходы Цикл
		Если усл.Всего <> 0  Тогда
			ВсегоСтрокДляВывода = ВсегоСтрокДляВывода + 1;
		КонецЕсли;
	КонецЦикла;
	
	Кол = 1;
	Для каждого усл Из Ссылка.Расходы Цикл
		Если усл.Всего <> 0  Тогда
			СтрокаРасходы.Параметры.Номер = кол;
			СтрокаРасходы.Параметры.Наименование = ПредставлениеНоменклатуры(усл, усл.РасходыПоГрузоперевозке);
			СтрокаРасходы.Параметры.Контрагент = НаименованиеКонтрагента(усл.РасходыПоГрузоперевозке.Контрагент);
			СтрокаРасходы.Параметры.Документ = усл.РасходыПоГрузоперевозке.ПредставлениеДокумента;
			СтрокаРасходы.Параметры.Сумма = усл.Сумма;
			СтрокаРасходы.Параметры.СтавкаНДС = усл.СтавкаНДС;
			СтрокаРасходы.Параметры.СуммаНДС = усл.НДС;
			СтрокаРасходы.Параметры.Итого = усл.Всего;
			
			// --- 
			Если Не ТабличныйДокумент.ПроверитьВывод(СтрокаРасходы) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ШапкаРасходы);
			КонецЕсли;
			Кол = Кол + 1;
			Если кол-1 <> всегоСтрокДляВывода Тогда
				ТабличныйДокумент.Вывести(СтрокаРасходы);
			Иначе
				ПослСтрока = Новый ТабличныйДокумент;
				ПослСтрока.Вывести(СтрокаРасходы);
				ПодвалРасходы.Параметры.Сумма = Ссылка.Расходы.Итог("Сумма");
				ПодвалРасходы.Параметры.СуммаНДС = Ссылка.Расходы.Итог("НДС");
				Итого = Ссылка.Расходы.Итог("Всего");
				ПодвалРасходы.Параметры.СуммаИтого = Итого;
				ПослСтрока.Вывести(ПодвалРасходы);
				Если ТабличныйДокумент.ПроверитьВывод(ПослСтрока) Тогда
					ТабличныйДокумент.Вывести(ПослСтрока);
				Иначе
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ШапкаРасходы);
					ТабличныйДокумент.Вывести(ПослСтрока);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	ШапкаДоходы.Параметры.Валюта = Валюта;
	ТабличныйДокумент.Вывести(ШапкаДоходы);
	
	ВсегоСтрокДляВывода = 0;
	Для каждого усл Из Ссылка.Доходы Цикл
		Если усл.Всего <> 0  Тогда
			ВсегоСтрокДляВывода = ВсегоСтрокДляВывода + 1;
		КонецЕсли;
	КонецЦикла;
	
	Кол = 1;
	Для каждого усл Из Ссылка.Доходы Цикл
		Если усл.Всего <> 0  Тогда
			СтрокаДоходы.Параметры.Номер = кол;
			СтрокаДоходы.Параметры.Наименование = ПредставлениеНоменклатуры(усл, усл.ДоходыПоГрузоперевозке);
			СтрокаДоходы.Параметры.Контрагент = НаименованиеКонтрагента(усл.ДоходыПоГрузоперевозке.Контрагент);
			СтрокаДоходы.Параметры.Документ = усл.ДоходыПоГрузоперевозке.ПредставлениеДокумента;
			СтрокаДоходы.Параметры.Сумма = усл.Сумма;
			СтрокаДоходы.Параметры.СтавкаНДС = усл.СтавкаНДС;
			СтрокаДоходы.Параметры.СуммаНДС = усл.НДС;
			СтрокаДоходы.Параметры.Итого = усл.Всего;
			// --- 
			Если Не ТабличныйДокумент.ПроверитьВывод(СтрокаДоходы) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ШапкаДоходы);
			КонецЕсли;
			Кол = Кол + 1;
			Если кол-1 <> всегоСтрокДляВывода Тогда
				ТабличныйДокумент.Вывести(СтрокаДоходы);
			Иначе
				ПослСтрока = Новый ТабличныйДокумент;
				ПослСтрока.Вывести(СтрокаДоходы);
				ПодвалДоходы.Параметры.Сумма = Ссылка.Доходы.Итог("Сумма");
				ПодвалДоходы.Параметры.СуммаНДС = Ссылка.Доходы.Итог("НДС");
				Итого = Ссылка.Доходы.Итог("Всего");
				ПодвалДоходы.Параметры.СуммаИтого = Итого;
				ПослСтрока.Вывести(ПодвалДоходы);
				Если ТабличныйДокумент.ПроверитьВывод(ПослСтрока) Тогда
					ТабличныйДокумент.Вывести(ПослСтрока);
				Иначе
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ШапкаДоходы);
					ТабличныйДокумент.Вывести(ПослСтрока);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	ШапкаВознаграждение.Параметры.Валюта = Валюта;
	ТабличныйДокумент.Вывести(ШапкаВознаграждение);
	
	ВсегоСтрокДляВывода = 0;
	Для каждого усл Из Ссылка.Вознаграждение Цикл
		Если усл.Всего <> 0  Тогда
			ВсегоСтрокДляВывода = ВсегоСтрокДляВывода + 1;
		КонецЕсли;
	КонецЦикла;
	
	Кол = 1;
	Для каждого усл Из Ссылка.Вознаграждение Цикл
		Если усл.Всего <> 0  Тогда
			СтрокаВознаграждение.Параметры.Номер = кол;
			СтрокаВознаграждение.Параметры.Наименование = усл.Представление;
			СтрокаВознаграждение.Параметры.Сумма = усл.Сумма;
			СтрокаВознаграждение.Параметры.СтавкаНДС = усл.СтавкаНДС;
			СтрокаВознаграждение.Параметры.СуммаНДС = усл.НДС;
			СтрокаВознаграждение.Параметры.Итого = усл.Всего;
			//СтрокаВознаграждение.Параметры.Валюта = Валюта;
			
			// --- 
			Если Не ТабличныйДокумент.ПроверитьВывод(СтрокаВознаграждение) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ШапкаВознаграждение);
			КонецЕсли;
			Кол = Кол + 1;
			Если кол-1 <> всегоСтрокДляВывода Тогда
				ТабличныйДокумент.Вывести(СтрокаВознаграждение);
			Иначе
				ПослСтрока = Новый ТабличныйДокумент;
				ПослСтрока.Вывести(СтрокаВознаграждение);
				ПодвалВознаграждение.Параметры.Сумма = Ссылка.Вознаграждение.Итог("Сумма");
				ПодвалВознаграждение.Параметры.СуммаНДС = Ссылка.Вознаграждение.Итог("НДС");
				Итого = Ссылка.Вознаграждение.Итог("Всего");
				ПодвалВознаграждение.Параметры.СуммаИтого = Итого;
				ПослСтрока.Вывести(ПодвалВознаграждение);
				Если ТабличныйДокумент.ПроверитьВывод(ПослСтрока) Тогда
					ТабличныйДокумент.Вывести(ПослСтрока);
				Иначе
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ШапкаВознаграждение);
					ТабличныйДокумент.Вывести(ПослСтрока);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
	Подписанты = CW_Печать.ВернутьПодписантов(Ссылка, ПараметрыДоговора); 
	
	Подписи.Параметры.ФИОСотрудника = " " + CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Ссылка.Исполнитель,Ссылка.Дата);
	Подписи.Параметры.ФИОГлавногоБухгалтера = " "+CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.ГлБух,Ссылка.Дата) + 
	?(ЗначениеЗаполнено(Подписанты.ГлБухОснованиеРус), " (" + Подписанты.ГлБухОснованиеРус + ")", ""); 
	ТабличныйДокумент.Вывести(Подписи);
	
	РезультатПечати.ПечатнаяФорма = ТабличныйДокумент;
	
	Возврат РезультатПечати;
	
КонецФункции // Печать

// ---------------------------------------------------------------------------- 

Функция ПредставлениеНоменклатуры(Стр, Док)
	
	Если СсылкаНаОбъект.ПодробноеПредставлениеНоменклатуры Тогда
		Мас = Док.Услуги.НайтиСтроки(Новый Структура("Грузоперевозка,Номенклатура,Сумма,СтавкаНДС,НДС,Всего", Стр.Грузоперевозка, Стр.Номенклатура, Стр.Сумма, Стр.СтавкаНДС, Стр.НДС, Стр.Всего)); 
		Если Мас.Количество() = 1 Тогда
			Если Мас[0].Представление <> "" Тогда
				Возврат Мас[0].Представление;
			Иначе
				Возврат ТиповоеПредставлениеНоменклатуры(Стр);
			КонецЕсли;	
		Иначе
			Возврат ТиповоеПредставлениеНоменклатуры(Стр);
		КонецЕсли;	
	Иначе	
		Возврат ТиповоеПредставлениеНоменклатуры(Стр);
	КонецЕсли;
	
КонецФункции

Функция ТиповоеПредставлениеНоменклатуры(Стр) 
	
	Если СокрЛП(Стр.Номенклатура.НаименованиеПолное) <> "" Тогда
		Возврат(Стр.Номенклатура.НаименованиеПолное);
	Иначе
		Возврат(Стр.Номенклатура.Наименование);
	КонецЕсли; 
	
КонецФункции	

Функция НаименованиеКонтрагента(Контрагент)
	
	Возврат ?(ПустаяСтрока(СокрЛП(Контрагент.НаименованиеПолное)),Контрагент.Наименование, СокрЛП(Контрагент.НаименованиеПолное));
	
КонецФункции

#КонецЕсли