&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокОбъектовСогласования();
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	
	ОповещатьПользователейОСобытияхСогласования = CW_ОповещатьЧерезЦентрОповещений 
												  		ИЛИ CW_ОповещатьПоЭлектроннойПочте 
												  		ИЛИ CW_ОповещатьЧерезСистемуВзаимодействия;

	УправлениеФормой(ЭтаФорма);
	
	Элементы.ГруппаПредупреждениеУчетнаяЗапись.Видимость = НЕ ЗначениеЗаполнено(Константы.CW_УчетнаяЗаписьДляОтправкиПисемПоСогласованию.Получить());

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда
		
		Если Не ЗакрытьФорму Тогда
			
			Если  CW_ОповещатьПоЭлектроннойПочте
					И НЕ ЗначениеЗаполнено(НаборКонстант.CW_УчетнаяЗаписьДляОтправкиПисемПоСогласованию) Тогда
				
				Отказ = Истина;
				
				Режим = РежимДиалогаВопрос.ДаНет;
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОЗакрытииФормы", ЭтотОбъект, Параметры);
				ПоказатьВопрос(Оповещение, "Не выбрана учетная запись для отправки уведеомлений! Продолжить?", Режим,0);	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОЗакрытииФормы(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	CW_ОповещатьПоЭлектроннойПочте = Ложь;
	
	НаборКонстант.CW_ОповещатьПоЭлектроннойПочте = CW_ОповещатьПоЭлектроннойПочте;
	ИзмененныеКонстанты = ОповещатьПоЭлектроннойПочтеПриИзмененииНаСервере();
	
	ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты);
	
	ЗакрытьФорму = Истина;
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбъектовСогласования()
	
	мИдентифкаторыОбъектов = Новый Массив;
	мТипы = Метаданные.ОпределяемыеТипы.CW_ОбъектыСогласования.Тип.Типы();
	Для Каждого ТипОбъекта из мТипы Цикл
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
		мИдентифкаторыОбъектов.Добавить(ИдентификаторОбъекта);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИдентификаторыОбъектовМетаданных.Ссылка КАК ОбъектМетаданных,
	               |	ВЫБОР
	               |		КОГДА CW_ДоступныеОбъектыСогласования.ИдентификаторОбъектаМетаданных ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Используется
	               |ИЗ
	               |	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ДоступныеОбъектыСогласования КАК CW_ДоступныеОбъектыСогласования
	               |		ПО ИдентификаторыОбъектовМетаданных.Ссылка = CW_ДоступныеОбъектыСогласования.ИдентификаторОбъектаМетаданных
	               |ГДЕ
	               |	ИдентификаторыОбъектовМетаданных.Ссылка В(&мИдентифкаторыОбъектов)";
	
	Запрос.УстановитьПараметр("мИдентифкаторыОбъектов", мИдентифкаторыОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	ДоступныеОбъектыСогласования.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПометки(Команда)
	ОбработатьпометкиДоступныхОбъектовНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеПометки(Команда)
	ОбработатьпометкиДоступныхОбъектовНаСервере(Истина);
КонецПроцедуры

&НаСервере
Процедура ОбработатьпометкиДоступныхОбъектовНаСервере(Используется)
	
	Для Каждого СтрокаТаблицы из ДоступныеОбъектыСогласования Цикл
		 СтрокаТаблицы.Используется = Используется;
	КонецЦикла;
	
	ДоступныеОбъектыЗаписатьВРегистрНаСервере();

КонецПроцедуры


&НаКлиенте
Процедура ДоступныеОбъектыСогласованияИспользуетсяПриИзменении(Элемент)
	ДоступныеОбъектыЗаписатьВРегистрНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДоступныеОбъектыЗаписатьВРегистрНаСервере()
	
	мОбъекты = Новый Массив;
	
	мСтроки = ДоступныеОбъектыСогласования.НайтиСтроки(Новый Структура("Используется", Истина));
	
	Для Каждого СтрокаМассива из мСтроки Цикл
		 мОбъекты.Добавить(СтрокаМассива.ОбъектМетаданных);
	КонецЦикла;
	
	РегистрыСведений.CW_ДоступныеОбъектыСогласования.ЗаписатьДоступныеОбъектыМетаданных(мОбъекты);
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ПриИзмененииРеквизитаФормы(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещатьПользователейОСобытияхСогласованияПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
	ИзмененныеКонстанты = ОповещатьПользователейОСобытияхСогласованияПриИзмененииНаСервере();
	
	ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты);
	
КонецПроцедуры

&НаКлиенте
Процедура CW_ОповещатьЧерезЦентрОповещенийПриИзменении(Элемент)
	
	НаборКонстант.CW_ОповещатьЧерезЦентрОповещений =  CW_ОповещатьЧерезЦентрОповещений;
	ИзмененныеКонстанты = ОповещатьЧерезЦентрОповещенийПриИзмененииНаСервере();
	
	ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты);
	
	CW_СогласованиеКлиент.ПодключитьОбработчикиОжиданияСогласования();
	
КонецПроцедуры

&НаКлиенте
Процедура CW_ОповещатьЧерезСистемуВзаимодействияПриИзменении(Элемент)
	
	НаборКонстант.CW_ОповещатьЧерезСистемуВзаимодействия =  CW_ОповещатьЧерезСистемуВзаимодействия;
	ИзмененныеКонстанты = ОповещатьЧерезСистемуВзаимодействияПриИзмененииНаСервере();
	
	ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты);
	
	CW_СогласованиеКлиент.ПодключитьОбработчикиОжиданияСогласования();

КонецПроцедуры

&НаКлиенте
Процедура CW_ОповещатьПоЭлектроннойПочтеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);

	НаборКонстант.CW_ОповещатьПоЭлектроннойПочте =  CW_ОповещатьПоЭлектроннойПочте;
	ИзмененныеКонстанты = ОповещатьПоЭлектроннойПочтеПриИзмененииНаСервере();
	
	ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты);
	
	УчетнаяЗаписьДляОтправкиПисемПоСогласованиюПриИзменениинаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура CW_УчетнаяЗаписьДляОтправкиПисемПоСогласованиюПриИзменении(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
	УчетнаяЗаписьДляОтправкиПисемПоСогласованиюПриИзменениинаСервере();
	
КонецПроцедуры


#КонецОБласти


#Область ОбработчикиЗаписиЗначений

&НаСервере
Процедура УчетнаяЗаписьДляОтправкиПисемПоСогласованиюПриИзменениинаСервере()
	
	Элементы.ГруппаПредупреждениеУчетнаяЗапись.Видимость = НЕ ЗначениеЗаполнено(НаборКонстант.CW_УчетнаяЗаписьДляОтправкиПисемПоСогласованию);

КонецПроцедуры

&НаСервере
Функция ОповещатьПользователейОСобытияхСогласованияПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	НаборКонстант.CW_ОповещатьЧерезЦентрОповещений = ОповещатьПользователейОСобытияхСогласования;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ОповещатьЧерезЦентрОповещений");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_УведомлятьИнициатораОСобытияхСогласования = ОповещатьПользователейОСобытияхСогласования;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УведомлятьИнициатораОСобытияхСогласования");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ОповещатьЧерезСистемуВзаимодействия = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ОповещатьЧерезСистемуВзаимодействия");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ОповещатьПоЭлектроннойПочте = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ОповещатьПоЭлектроннойПочте");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_УчетнаяЗаписьДляОтправкиПисемПоСогласованию = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УчетнаяЗаписьДляОтправкиПисемПоСогласованию");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция ОповещатьЧерезЦентрОповещенийПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ОповещатьЧерезЦентрОповещений");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	Если CW_ОповещатьЧерезЦентрОповещений Тогда
		НаборКонстант.CW_ОповещатьЧерезСистемуВзаимодействия = Ложь;
		КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ОповещатьЧерезСистемуВзаимодействия");
		ИзмененныеКонстанты.Добавить(КонстантаИмя);
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция ОповещатьЧерезСистемуВзаимодействияПриИзмененииНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ОповещатьЧерезСистемуВзаимодействия");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	Если  CW_ОповещатьЧерезСистемуВзаимодействия Тогда
		НаборКонстант.CW_ОповещатьЧерезЦентрОповещений = Ложь;
		КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ОповещатьЧерезЦентрОповещений");
		ИзмененныеКонстанты.Добавить(КонстантаИмя);
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция  ОповещатьПоЭлектроннойПочтеПриИзмененииНаСервере()

	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ОповещатьПоЭлектроннойПочте");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_УчетнаяЗаписьДляОтправкиПисемПоСогласованию = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_УчетнаяЗаписьДляОтправкиПисемПоСогласованию");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	
	
	Возврат ИзмененныеКонстанты;

КонецФункции

#КонецОБласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьЗначенияРеквизитовФормы(Форма)

	Форма.CW_ОповещатьПоЭлектроннойПочте			= Константы.CW_ОповещатьПоЭлектроннойПочте.Получить();
	Форма.CW_ОповещатьЧерезЦентрОповещений 			= Константы.CW_ОповещатьЧерезЦентрОповещений.Получить();
	Форма.CW_ОповещатьЧерезСистемуВзаимодействия	= Константы.CW_ОповещатьЧерезСистемуВзаимодействия.Получить();
	

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;

	Элементы.ГруппаОповещения.Видимость  							= Форма.ОповещатьПользователейОСобытияхСогласования;
	Элементы.ГруппаПараметрыОтправкиПоЭлектроннойПочте.Видимость 	= Форма.CW_ОповещатьПоЭлектроннойПочте;																
	Элементы.CW_ОповещатьЧерезСистемуВзаимодействия.Видимость 		= СистемаВзаимодействия.ИспользованиеДоступно();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты)
	
	УправлениеФормой(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОБласти
