#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПорядокОтраженияЗатрат(ПорядокОтраженияДоходов) Экспорт
	
	Если ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление Тогда
		Возврат Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление;
	ИначеЕсли ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам  Тогда
		Возврат Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам ;
	ИначеЕсли  ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга Тогда
		Возврат Перечисления.CW_ПорядокОтраженияЗатрат.Затраты ;
	КонецЕсли;
	
	Возврат Перечисления.CW_ПорядокОтраженияЗатрат.ПустаяСсылка()
	
КонецФункции

#КонецЕсли