#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("УстановитьИспользованиеМаркировки");
	
КонецПроцедуры

//Изменяет положение подменю проверка и подбор на форме докеумента
//Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма, в которой нужно внести изменения
//
Процедура ИзменитьПоложениеПодменюПроверкаИПодбор(Форма) Экспорт
	
	Если ОбщегоНазначенияБП.ЭтоПростойИнтерфейс() Тогда
		КоманднаяПанельПроверкаИПодборИС = Форма.Элементы.Найти("КоманднаяПанельПроверкаИПодборПродукцииГосИС");
		Если КоманднаяПанельПроверкаИПодборИС = Неопределено Тогда
			Возврат;		
		КонецЕсли;
		КоманднаяПанельПроверкаИПодборИС.Видимость = Ложь;
        ПодменюГосИС = КоманднаяПанельПроверкаИПодборИС.ПодчиненныеЭлементы[0];
		РодительскаяГруппа = Форма.Элементы.Найти("ТоварыДействия");
		Если РодительскаяГруппа = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Подменю = Форма.Элементы.Найти("ПодменюТоварыПроверкаИПодбор");
		Если Не Подменю = Неопределено Тогда
			Форма.Элементы.Удалить(Подменю);	
		КонецЕсли;	
		Подменю = Форма.Элементы.Добавить("ПодменюТоварыПроверкаИПодбор", Тип("ГруппаФормы"), РодительскаяГруппа);
		Подменю.Вид = ВидГруппыФормы.Подменю;
		Подменю.Заголовок = ПодменюГосИС.Заголовок;
		Для Каждого КнопкаГосИС Из ПодменюГосИС.ПодчиненныеЭлементы Цикл
			Если КнопкаГосИС.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели Тогда
				Кнопка = Форма.Элементы.Добавить(КнопкаГосИС.Имя + "_", Тип("КнопкаФормы"), Подменю);
				Кнопка.ИмяКоманды = КнопкаГосИС.ИмяКоманды;
			ИначеЕсли КнопкаГосИС.Вид = ВидГруппыФормы.Подменю Тогда
				ДопПодменю = Форма.Элементы.Добавить(КнопкаГосИС.Имя + "_", Тип("ГруппаФормы"), Подменю);
				Для Каждого ЭлементПодменю Из КнопкаГосИС.ПодчиненныеЭлементы Цикл
					Если ЭлементПодменю.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели Тогда
						Кнопка = Форма.Элементы.Добавить(ЭлементПодменю.Имя + "_", Тип("КнопкаФормы"), ДопПодменю);
						Кнопка.ИмяКоманды = ЭлементПодменю.ИмяКоманды;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак настройки видов маркируемой продукции.
// 
// Возвращаемое значение:
//  Булево - Истина, если маркировка настроена
//
Функция МаркировкаВключена() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.ВидПродукции КАК ВидПродукции
	|ИЗ
	|	РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС
	|ГДЕ
	|	ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.ЭлементКонструктора = &МаркировкаИС
	|	И НЕ ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("МаркировкаИС", ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ"));
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#Область ОбработчикиОбновления

// ОбработчикОбновления с 3.0.151.28
//
Процедура УстановитьИспользованиеМаркировки() Экспорт
	
	Если МаркировкаВключена() Тогда
		МенеджерЗначенияКонстанты = Константы.ИспользоватьМаркировку.СоздатьМенеджерЗначения();
		МенеджерЗначенияКонстанты.Значение = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначенияКонстанты);
	КонецЕсли;
	  
КонецПроцедуры

#КонецОбласти

#КонецОбласти
