

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Отбор.Очистить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура("Организация, ВыбранныйДокумент", ТекущиеДанные.Организация, ТекущиеДанные.Ссылка);
	
	Если Не ОрганизацияЗарегистрирована(ТекущиеДанные.Организация) Тогда
		
		Шаблон = НСтр("ru='Организация ""%1"" не подключена к сервису 1С:Бизнес-сеть. Подключить сейчас?'");
		ТекстВопроса = СтрШаблон(Шаблон, ТекущиеДанные.Организация);
		
		Описание = Новый ОписаниеОповещения("ВыборЗначенияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Описание, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		СтандартнаяОбработка = Ложь;
		Возврат;
		
	КонецЕсли;
	
	ВыборЗначенияЗавершение(КодВозвратаДиалога.Да, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОрганизацияЗарегистрирована(Организация)

	Возврат БизнесСеть.ОрганизацияПодключена(Организация);

КонецФункции

&НаКлиенте
Процедура ВыборЗначенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПодключитьОрганизациюПродолжение", ЭтотОбъект, ДополнительныеПараметры);
		
		БизнесСетьСлужебныйКлиент.ОткрытьФормуПодключенияОрганизации(
			ДополнительныеПараметры.Организация,
			ЭтотОбъект,
			Оповещение);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОрганизациюПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СтатусПодключения <> "Подключена" Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось выбрать документ. Организация не зарегистрирована в 1С:Бизнес-сеть.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти