
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивГрузоперевозок = ПолучитьМассивГрузоперевозокОбъета(ПараметрКоманды);
	
	СтруктураПараметров = Новый Структура("РежимОткрытия,МассивДоступных","ОтборПоСписку",МассивГрузоперевозок);
	ОткрытьФорму("Обработка.CW_ЖурналГрузоперевозок.Форма.Форма", СтруктураПараметров, ПараметрыВыполненияКоманды.Источник, Истина);

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивГрузоперевозокОбъета(ПараметрКоманды)
	
	ТаблицаГрузоперевозок = ПараметрКоманды.Услуги.Выгрузить(, "Грузоперевозка");  
	
	мГрузоперевозкиОтбора = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мГрузоперевозкиОтбора,ТаблицаГрузоперевозок.ВыгрузитьКолонку("Грузоперевозка"), Истина);
	
	Возврат мГрузоперевозкиОтбора;
	
КонецФункции
