
&НаКлиенте
Функция сбисОписанияПрограмм(Кэш) Экспорт
	
	Если Кэш.Ини.Свойство("Конфигурация") и Не ЗначениеЗаполнено(Кэш.Парам.НастройкиКриптографии.ИмяПрограммы) Тогда
		ОписанияПрограмм = сбисПолучитьНастройкиКриптографии(Кэш);
	Иначе
		ОписанияПрограмм = Новый Массив;
		СвойстваПрограммы = Новый Структура("ИмяПрограммы,ПутьКПрограмме,ТипПрограммы", Кэш.Парам.НастройкиКриптографии.ИмяПрограммы,Кэш.Парам.НастройкиКриптографии.ПутьКПрограмме,Кэш.Парам.НастройкиКриптографии.ТипПрограммы);
		ОписанияПрограмм.Добавить(СвойстваПрограммы);
	КонецЕсли;
	Возврат ОписанияПрограмм;
КонецФункции
&НаСервере
Функция сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм) Экспорт
	
	Менеджер = Неопределено;
	Для Каждого СвойстваПрограммы Из ОписанияПрограмм Цикл
		
		Попытка
			ИнформацияМодуля = СредстваКриптографии.ПолучитьИнформациюМодуляКриптографии(
				СвойстваПрограммы.ИмяПрограммы,
				СвойстваПрограммы.ПутьКПрограмме,
				СвойстваПрограммы.ТипПрограммы);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если ИнформацияМодуля = Неопределено Тогда
			Менеджер = Неопределено;
			Продолжить;
		КонецЕсли;
		
		Попытка
			Менеджер = Новый МенеджерКриптографии(
				СвойстваПрограммы.ИмяПрограммы,
				СвойстваПрограммы.ПутьКПрограмме,
				СвойстваПрограммы.ТипПрограммы);
		Исключение
			Продолжить;
		КонецПопытки;

		
		Прервать; // Требуемый менеджер криптографии получен.
	КонецЦикла;  
	Если Менеджер = Неопределено Тогда
		ВызватьИсключение("Не удалось создать менеджер криптографии. Возможно неверно указаны настройки криптографии.");		
	КонецЕсли;
	Возврат Менеджер;
	
КонецФункции

&НаКлиенте
Функция сбисПолучитьНастройкиКриптографии(Кэш) Экспорт
	Контекст = Новый Структура("Документ, СтрТабл, Ини",,);
	Контекст.Ини = Новый Структура;
	Кэш.ОбщиеФункции.сбисСкопироватьСтруктуруНаКлиенте(Контекст.Ини, Кэш.Ини.Конфигурация.мПрограммыЭП);
	
	СписокДопустимыхТипов = Кэш.ОбщиеФункции.СписокДопустимыхТипов();
	НастройкиЭП = Кэш.ОбщиеФункции.ПолучитьДанныеДокумента1С(Кэш.Ини.Конфигурация.мПрограммыЭП, Неопределено, Новый Структура, Кэш.Парам);
    Возврат НастройкиЭП.ПрограммыЭП;
КонецФункции
     
&НаКлиенте
Функция сбисСписокСертификатовДляАвторизации(Кэш, ТекстОшибки) Экспорт
	Возврат сбисСписокСертификатовДляАвторизацииНаСервере(сбисОписанияПрограмм(Кэш), ТекстОшибки);	
КонецФункции

&НаСервере
Функция сбисСписокСертификатовДляАвторизацииНаСервере(ОписанияПрограмм, ТекстОшибки) Экспорт
	СертификатыДляАвторизации = Новый Массив();
	Попытка
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	Исключение    
		ТекстОшибки = ИнформацияОбОшибке().Описание;
		Возврат СертификатыДляАвторизации;
	КонецПопытки;
	
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе(); 
	Для Каждого Серт из Сертификаты Цикл
		Попытка
			СертДвоичныеДанные = СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()),Символы.ПС,""),Символы.ВК,"");
			СертОтпечаток = СтрЗаменить(Строка(Серт.Отпечаток), " ", "");
			СертификатыДляАвторизации.Добавить(Новый Структура("ДвоичныеДанные,Отпечаток,Название,ФИО,Должность,ДействителенПо",СертДвоичныеДанные, СертОтпечаток,Серт.Субъект.CN, Серт.Субъект.SN+" "+Серт.Субъект.GN,Серт.Субъект.T,Серт.ДатаОкончания));
		Исключение
		КонецПопытки;
	КонецЦикла;
	Возврат СертификатыДляАвторизации;

КонецФункции
&НаКлиенте
Функция сбисДвоичныеДанныеСертификатаПоОтпечатку(Кэш, Отпечаток) Экспорт
	Возврат сбисДвоичныеДанныеСертификатаПоОтпечаткуНаСервере(сбисОписанияПрограмм(Кэш), Отпечаток);	
КонецФункции  
&НаСервере
Функция сбисДвоичныеДанныеСертификатаПоОтпечаткуНаСервере(ОписанияПрограмм, Отпечаток) Экспорт
	Попытка
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	Исключение    
		Возврат Ложь;
	КонецПопытки;
	ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе(); 
	Для Каждого Серт из Сертификаты Цикл
		Если СтрЗаменить(Строка(Серт.Отпечаток), " ", "") = Отпечаток Тогда
			Возврат СтрЗаменить(СтрЗаменить(Base64Строка(Серт.Выгрузить()),Символы.ПС,""),Символы.ВК,"");
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Функция сбисВыбратьПодходящийСертификат(Кэш, СертификатыДок, ТекстОшибки) Экспорт
	Возврат сбисВыбратьПодходящийСертификатНаСервере(сбисОписанияПрограмм(Кэш), СертификатыДок, ТекстОшибки);
КонецФункции

&НаСервере
Функция сбисВыбратьПодходящийСертификатНаСервере(ОписанияПрограмм, СертификатыДок, ТекстОшибки) Экспорт
	Результат = Новый Структура();
	Попытка
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	Исключение    
		ТекстОшибки = ИнформацияОбОшибке().Описание;
		Возврат Ложь;
	КонецПопытки;
	Попытка
		ХранилищеСертификатовКриптографии = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
		Сертификаты = ХранилищеСертификатовКриптографии.ПолучитьВсе(); 
	Исключение
		ТекстОшибки = ИнформацияОбОшибке().Описание;
	КонецПопытки;
	Для Каждого СертДок Из СертификатыДок Цикл
		Если СертДок.Ключ.Тип = "Отложенный" Тогда
			Результат.Вставить("СертификатДляПодписания", Неопределено);
			Результат.Вставить("СертификатДок", СертДок);
			Возврат Результат;
		ИначеЕсли СертДок.Ключ.Тип = "Клиентский" Тогда
			Для Каждого Серт из Сертификаты Цикл
				СертОтпечаток = СтрЗаменить(Строка(Серт.Отпечаток), " ", "");
				Если  СертОтпечаток = СертДок.Отпечаток Тогда
                    Результат.Вставить("СертификатДляПодписания", Base64Строка(Серт.Выгрузить()));
					Результат.Вставить("СертификатДок", СертДок);
					Возврат Результат;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

&НаКлиенте
Функция сбисПодписатьФайл(Кэш, ПолноеИмяФайла, Сертификат, ТекстОшибки) Экспорт
	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	Подпись = сбисПодписатьФайлНаСервере(сбисОписанияПрограмм(Кэш), Base64Строка(ДвоичныеДанные), Сертификат, ТекстОшибки);
	Возврат Подпись;
КонецФункции

&НаКлиенте
Функция сбисПодписатьДвоичныеДанные(Кэш, ДвоичныеДанные, Сертификат, ТекстОшибки) Экспорт
	Подпись = сбисПодписатьФайлНаСервере(сбисОписанияПрограмм(Кэш), ДвоичныеДанные, Сертификат, ТекстОшибки);
	Возврат Подпись;
КонецФункции

&НаСервере
Функция сбисПодписатьФайлНаСервере(ОписанияПрограмм, ДвоичныеДанные, Сертификат, ТекстОшибки) Экспорт
	Попытка
		МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	Исключение    
		ТекстОшибки = ИнформацияОбОшибке().Описание;
		Возврат Ложь;
	КонецПопытки;
	Серт = Новый СертификатКриптографии(Base64Значение(Сертификат));
	Подпись = МенеджерКриптографии.Подписать(Base64Значение(ДвоичныеДанные), Серт);
	Возврат СтрЗаменить(СтрЗаменить(Base64Строка(Подпись),Символы.ПС,""),Символы.ВК,"");
КонецФункции

&НаКлиенте
Функция сбисРасшифровать(Кэш, ДвоичныеДанные, ПолноеИмяФайла) Экспорт
	Рез = сбисРасшифроватьНаСервере(сбисОписанияПрограмм(Кэш), Base64Строка(ДвоичныеДанные));
	РезДвоичныеДанные = Base64Значение(Рез);
	РезДвоичныеДанные.Записать(ПолноеИмяФайла);
КонецФункции 

&НаСервере
Функция сбисРасшифроватьНаСервере(ОписанияПрограмм, ДвоичныеДанные) Экспорт
	МенеджерКриптографии = сбисСоздатьМенеджерКриптографииНаСервере(ОписанияПрограмм);
	ДвоичныеДанныеРашифрованные = МенеджерКриптографии.Расшифровать(Base64Значение(ДвоичныеДанные));
	НедопустимыеСимволы = Новый Массив;
	НедопустимыеСимволы.Добавить(Символы.ПС);
	НедопустимыеСимволы.Добавить(Символы.ВК);
	ДанныеВозврат = Base64Строка(ДвоичныеДанныеРашифрованные);
	Для Каждого НедопустимыйСимвол Из НедопустимыеСимволы Цикл
		ДанныеВозврат = СтрЗаменить(ДанныеВозврат, НедопустимыйСимвол, "");
	КонецЦикла;
	Возврат ДанныеВозврат;
КонецФункции