
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ПараметрКоманды = Новый ХранилищеЗначения(Параметры.ПараметрКоманды);
	Параметры.Свойство("ВариантГруппировки", Отчет.ВариантГруппировки); 
	
	Элементы.ВерсияБюджета.Видимость = (Отчет.ВариантГруппировки <> "ЗАЯВКА");
	
	Если Отчет.ВариантГруппировки <> "ЗАЯВКА" Тогда
		
		Параметры.Свойство("ВерсияБюджета", Отчет.ВерсияБюджета); 
		
		Если Не ЗначениеЗаполнено(Отчет.ВерсияБюджета) Тогда
			Отчет.ВерсияБюджета = Справочники.CW_ВерсииБюджетов.Основная;	
		Конецесли;
		
	КонецЕсли;

	Если Отчет.ВариантГруппировки = "ЗАЯВКА" 
		И Параметры.Свойство("ВариантБюджета") Тогда
		Параметры.Свойство("ВариантБюджета",  Отчет.ВариантБюджета); 
	КонецЕсли;   
	
	Элементы.ГруппаНастройки.Видимость 	= ПоказатьНастройки;
	Элементы.ФормаНастройки.Пометка 	= ПоказатьНастройки;
	             
КонецПроцедуры

&НаКлиенте
Процедура ВерсияБюджетаПриИзменении(Элемент)
	УстановитьСостояниеПоляТабличногоДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОтраженияПриИзменении(Элемент)
	УстановитьСостояниеПоляТабличногоДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеПоляТабличногоДокумента()
	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет не сформирован. Нажмите ""Сформировать"" для получения отчета.'");;
	
КонецПроцедуры


&НаКлиенте
Процедура Настройки(Команда)
	
	ПоказатьНастройки = Не ПоказатьНастройки;
	ПоказатьСкрытьНастройки();
	
КонецПроцедуры

&наКлиенте
Процедура ПоказатьСкрытьНастройки()
	
	Элементы.ГруппаНастройки.Видимость = ПоказатьНастройки;
	Элементы.ФормаНастройки.Пометка = ПоказатьНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	ЭтаФорма.СкомпоноватьРезультат();
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	УстановитьКолонтитулы();
	
	ПоказатьНастройки = Ложь;
	ПоказатьСкрытьНастройки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКолонтитулы()
	
	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(Результат,"Анализ бюджета");
	//УправлениеКолонтитулами
	
КонецПроцедуры

