
//ЗАПОЛНЕНИЕ ДАННЫХ НА ФОРМЕ 
Процедура ПолучитьИсходныеДанные(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	Результат = Новый Структура;
	
	Если ПараметрыПроцедуры.ПеремещенияТоплива Тогда
		ПеремещенияТоплива = ПолучитьТаблицуПеремещенияТоплива(ПараметрыПроцедуры);
		Результат.Вставить("ПеремещенияТоплива", ПеремещенияТоплива);
	КонецЕсли;
	
	Если ПараметрыПроцедуры.СписанияТоплива Тогда
		
		ДанныеСписанияТоплива = ПолучитьДанныеСписанияТоплива(ПараметрыПроцедуры);
		
		Результат.Вставить("СписанияТоплива", ДанныеСписанияТоплива);
		
	КонецЕсли;   
	
	Если ПараметрыПроцедуры.ЗаработнаяПлата Тогда
		
		ДанныеСписанияТоплива = ПолучитьДанныеЗаработнойПлаты(ПараметрыПроцедуры);
		
		Результат.Вставить("ЗаработнаяПлата", ДанныеСписанияТоплива);
		
	КонецЕсли;   
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Функция ПолучитьТаблицуПеремещенияТоплива(ПараметрыПроцедуры) 
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ЗаправкиТопливнымиКартамиОбороты.Период КАК ДатаЗаправки,
	|	CW_ЗаправкиТопливнымиКартамиОбороты.Организация КАК Организация,
	|	CW_ЗаправкиТопливнымиКартамиОбороты.Топливо КАК Топливо,
	|	CW_ЗаправкиТопливнымиКартамиОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
	|	СУММА(CW_ЗаправкиТопливнымиКартамиОбороты.КоличествоОборот) КАК Количество,
	|	CW_ЗаправкиТопливнымиКартамиОбороты.ТопливнаяКарта.СкладТоплива КАК СкладОтправитель
	|ПОМЕСТИТЬ ВТ_Заправки
	|ИЗ
	|	РегистрНакопления.CW_ЗаправкиТопливнымиКартами.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			День, 
	|			//УСЛОВИЕ_Организация
	|			) КАК CW_ЗаправкиТопливнымиКартамиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ЗаправкиТопливнымиКартамиОбороты.ТранспортноеСредство,
	|	CW_ЗаправкиТопливнымиКартамиОбороты.Период,
	|	CW_ЗаправкиТопливнымиКартамиОбороты.Топливо,
	|	CW_ЗаправкиТопливнымиКартамиОбороты.Организация,
	|	CW_ЗаправкиТопливнымиКартамиОбороты.ТопливнаяКарта.СкладТоплива
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_ПараметрыТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_ПараметрыТССрезПоследних.Значение КАК Склад
	|ПОМЕСТИТЬ ВТ_СкладыТС
	|ИЗ
	|	РегистрСведений.CW_ПараметрыТС.СрезПоследних(
	|			&ДатаОкончания,
	|			ТранспортноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ_Заправки.ТранспортноеСредство КАК ТранспортноеСредство
	|					ИЗ
	|						ВТ_Заправки КАК ВТ_Заправки)
	|				И ПараметрТранпортногоСредства = &ПараметрСклад) КАК CW_ПараметрыТССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_ПараметрыТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_ПараметрыТССрезПоследних.Значение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_ПодразделенияТС
	|ИЗ
	|	РегистрСведений.CW_ПараметрыТС.СрезПоследних(
	|			&ДатаОкончания,
	|			ТранспортноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ_Заправки.ТранспортноеСредство КАК ТранспортноеСредство
	|					ИЗ
	|						ВТ_Заправки КАК ВТ_Заправки)
	|				И ПараметрТранпортногоСредства = &ПараметрПодразделение) КАК CW_ПараметрыТССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заправки.ДатаЗаправки КАК ДатаЗаправки,
	|	ВТ_Заправки.Организация КАК Организация,
	|	ВТ_ПодразделенияТС.Подразделение КАК ПодразделениеПолучатель,
	|	ВТ_ПодразделенияТС.Подразделение КАК ПодразделениеОтправитель,
	|	ВТ_Заправки.СкладОтправитель КАК СкладОтправитель,
	|	ВТ_СкладыТС.Склад КАК СкладПолучатель,
	|	ВТ_Заправки.Топливо КАК Номенклатура,
	|	СУММА(ВТ_Заправки.Количество) КАК Количество
	|ИЗ
	|	ВТ_Заправки КАК ВТ_Заправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкладыТС КАК ВТ_СкладыТС
	|		ПО ВТ_Заправки.ТранспортноеСредство = ВТ_СкладыТС.ТранспортноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияТС КАК ВТ_ПодразделенияТС
	|		ПО ВТ_Заправки.ТранспортноеСредство = ВТ_ПодразделенияТС.ТранспортноеСредство
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заправки.ДатаЗаправки,
	|	ВТ_СкладыТС.Склад,
	|	ВТ_Заправки.Топливо,
	|	ВТ_ПодразделенияТС.Подразделение,
	|	ВТ_Заправки.Организация,
	|	ВТ_Заправки.СкладОтправитель,
	|	ВТ_ПодразделенияТС.Подразделение";      
	
	Если ЗначениеЗаполнено(ПараметрыПроцедуры.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_Организация", "Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", ПараметрыПроцедуры.Организация);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаНачала", 			ПараметрыПроцедуры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 			ПараметрыПроцедуры.ДатаОкончания);
	Запрос.УстановитьПараметр("ПараметрСклад", 			ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.Склад);
	Запрос.УстановитьПараметр("ПараметрПодразделение", 	ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьДанныеСписанияТоплива(ПараметрыПроцедуры)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_РасходГСМТСОбороты.Организация КАК Организация,
	|	CW_РасходГСМТСОбороты.ПутевойЛист КАК ПутевойЛист,
	|	CW_РасходГСМТСОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_РасходГСМТСОбороты.Номенклатура КАК Номенклатура,
	|	CW_РасходГСМТСОбороты.ВариантОтраженияЗатратПоБУ КАК ВариантОтраженияЗатратПоБУ,
	|	CW_РасходГСМТСОбороты.ВидРасходаТоплива КАК ВидРасходаТоплива,
	|	СУММА(CW_РасходГСМТСОбороты.КоличествоОборот) КАК КоличествоОборот
	|ПОМЕСТИТЬ ВТ_ПутевыеЛисты
	|ИЗ
	|	РегистрНакопления.CW_РасходГСМТС.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Период,
	|			ВидРасходаТоплива В (&мВидыРасходаТоплива)
	|			//УСЛОВИЕ_Организация
	|				) КАК CW_РасходГСМТСОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_РасходГСМТСОбороты.ВариантОтраженияЗатратПоБУ,
	|	CW_РасходГСМТСОбороты.ВидРасходаТоплива,
	|	CW_РасходГСМТСОбороты.Номенклатура,
	|	CW_РасходГСМТСОбороты.ТранспортноеСредство,
	|	CW_РасходГСМТСОбороты.ПутевойЛист,
	|	CW_РасходГСМТСОбороты.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.ПутевойЛист КАК ПутевойЛист,
	|	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|ПОМЕСТИТЬ ВТ_НоменклатурныеГруппы
	|ИЗ
	|	РегистрСведений.CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп КАК CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп
	|ГДЕ
	|	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.ПутевойЛист В
	|			(ВЫБРАТЬ
	|				ВТ_ПутевыеЛисты.ПутевойЛист КАК ПутевойЛист
	|			ИЗ
	|				ВТ_ПутевыеЛисты КАК ВТ_ПутевыеЛисты)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПутевойЛист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_ПараметрыТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_ПараметрыТССрезПоследних.Значение КАК Склад
	|ПОМЕСТИТЬ ВТ_СкладыТС
	|ИЗ
	|	РегистрСведений.CW_ПараметрыТС.СрезПоследних(
	|			&ДатаОкончания,
	|			ТранспортноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ_ПутевыеЛисты.ТранспортноеСредство КАК ТранспортноеСредство
	|					ИЗ
	|						ВТ_ПутевыеЛисты КАК ВТ_ПутевыеЛисты)
	|				И ПараметрТранпортногоСредства = &ПараметрСклад) КАК CW_ПараметрыТССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_ПараметрыТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_ПараметрыТССрезПоследних.Значение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_ПодразделенияТС
	|ИЗ
	|	РегистрСведений.CW_ПараметрыТС.СрезПоследних(
	|			&ДатаОкончания,
	|			ТранспортноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ_ПутевыеЛисты.ТранспортноеСредство КАК ТранспортноеСредство
	|					ИЗ
	|						ВТ_ПутевыеЛисты КАК ВТ_ПутевыеЛисты)
	|				И ПараметрТранпортногоСредства = &ПараметрПодразделение) КАК CW_ПараметрыТССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_СкладыТС.Склад, НЕОПРЕДЕЛЕНО) КАК Склад,
	|	ВТ_ПутевыеЛисты.Организация КАК Организация,
	|	ЕСТЬNULL(ВТ_ПодразделенияТС.Подразделение, НЕОПРЕДЕЛЕНО) КАК Подразделение,
	|	ВТ_ПутевыеЛисты.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_НоменклатурныеГруппы.НоменклатурнаяГруппа, НЕОПРЕДЕЛЕНО) КАК НоменклатурнаяГруппа,
	|	ВТ_ПутевыеЛисты.ВариантОтраженияЗатратПоБУ КАК ВариантОтраженияЗатратПоБУ,
	|	ВТ_ПутевыеЛисты.ВидРасходаТоплива КАК ВидРасходаТоплива,
	|	СУММА(ВТ_ПутевыеЛисты.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	ВТ_ПутевыеЛисты КАК ВТ_ПутевыеЛисты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НоменклатурныеГруппы КАК ВТ_НоменклатурныеГруппы
	|		ПО ВТ_ПутевыеЛисты.ПутевойЛист = ВТ_НоменклатурныеГруппы.ПутевойЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СкладыТС КАК ВТ_СкладыТС
	|		ПО ВТ_ПутевыеЛисты.ТранспортноеСредство = ВТ_СкладыТС.ТранспортноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияТС КАК ВТ_ПодразделенияТС
	|		ПО ВТ_ПутевыеЛисты.ТранспортноеСредство = ВТ_ПодразделенияТС.ТранспортноеСредство
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПутевыеЛисты.ВариантОтраженияЗатратПоБУ,
	|	ВТ_ПутевыеЛисты.Организация,
	|	ВТ_ПутевыеЛисты.ВидРасходаТоплива,
	|	ВТ_ПутевыеЛисты.Номенклатура,
	|	ЕСТЬNULL(ВТ_НоменклатурныеГруппы.НоменклатурнаяГруппа, НЕОПРЕДЕЛЕНО),
	|	ЕСТЬNULL(ВТ_СкладыТС.Склад, НЕОПРЕДЕЛЕНО),
	|	ЕСТЬNULL(ВТ_ПодразделенияТС.Подразделение, НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Склад КАК Склад,
	|	ВТ_ИсходныеДанные.Организация КАК Организация,
	|	ВТ_ИсходныеДанные.Подразделение КАК Подразделение,
	|	ВТ_ИсходныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СУММА(ВТ_ИсходныеДанные.Количество) КАК КоличествоВПределахНормы,
	|	0 КАК КоличествоСверхНормы,
	|	0 КАК КоличествоВсего
	|ПОМЕСТИТЬ ВТ_ДанныенаФорму
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.ВидРасходаТоплива = &ВидРасходаТопливаВПределахНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Склад,
	|	ВТ_ИсходныеДанные.Организация,
	|	ВТ_ИсходныеДанные.Подразделение,
	|	ВТ_ИсходныеДанные.Номенклатура,
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Склад,
	|	ВТ_ИсходныеДанные.Организация,
	|	ВТ_ИсходныеДанные.Подразделение,
	|	ВТ_ИсходныеДанные.Номенклатура,
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа,
	|	0,
	|	ВТ_ИсходныеДанные.Количество,
	|	0
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.ВидРасходаТоплива = &ВидРасходаТопливаСверхНормы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Склад,
	|	ВТ_ИсходныеДанные.Организация,
	|	ВТ_ИсходныеДанные.Подразделение,
	|	ВТ_ИсходныеДанные.Номенклатура,
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа,
	|	0,
	|	0,
	|	ВТ_ИсходныеДанные.Количество
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.ВидРасходаТоплива = &ВидРасходаТопливаРасходФактический
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Склад КАК Склад,
	|	ВТ_ИсходныеДанные.Организация КАК Организация,
	|	ВТ_ИсходныеДанные.Подразделение КАК Подразделение,
	|	ВТ_ИсходныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ_ИсходныеДанные.ВариантОтраженияЗатратПоБУ КАК ВариантОтраженияЗатратПоБУ,
	|	ВТ_ИсходныеДанные.ВидРасходаТоплива КАК ВидРасходаТоплива,
	|	СУММА(ВТ_ИсходныеДанные.Количество) КАК Количество
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.ВидРасходаТоплива <> &ВидРасходаТопливаРасходФактический
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Склад,
	|	ВТ_ИсходныеДанные.Организация,
	|	ВТ_ИсходныеДанные.Подразделение,
	|	ВТ_ИсходныеДанные.Номенклатура,
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа,
	|	ВТ_ИсходныеДанные.ВариантОтраженияЗатратПоБУ,
	|	ВТ_ИсходныеДанные.ВидРасходаТоплива
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныенаФорму.Склад КАК Склад,
	|	ВТ_ДанныенаФорму.Организация КАК Организация,
	|	ВТ_ДанныенаФорму.Подразделение КАК Подразделение,
	|	ВТ_ДанныенаФорму.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныенаФорму.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СУММА(ВТ_ДанныенаФорму.КоличествоВПределахНормы) КАК КоличествоВПределахНормы,
	|	СУММА(ВТ_ДанныенаФорму.КоличествоСверхНормы) КАК КоличествоСверхНормы,
	|	СУММА(ВТ_ДанныенаФорму.КоличествоВсего) КАК КоличествоВсего
	|ИЗ
	|	ВТ_ДанныенаФорму КАК ВТ_ДанныенаФорму
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныенаФорму.Склад,
	|	ВТ_ДанныенаФорму.Организация,
	|	ВТ_ДанныенаФорму.Подразделение,
	|	ВТ_ДанныенаФорму.Номенклатура,
	|	ВТ_ДанныенаФорму.НоменклатурнаяГруппа";
	
	Если ЗначениеЗаполнено(ПараметрыПроцедуры.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_Организация",  "И Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", ПараметрыПроцедуры.Организация);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаНачала",		ПараметрыПроцедуры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ПараметрыПроцедуры.ДатаОкончания);
	
	мВидыРасходаТоплива = Новый Массив;
	мВидыРасходаТоплива.Добавить(Перечисления.CW_ВидыРасходаТоплива.РасходВПределахНормы);
	мВидыРасходаТоплива.Добавить(Перечисления.CW_ВидыРасходаТоплива.РасходСверхНормы);
	мВидыРасходаТоплива.Добавить(Перечисления.CW_ВидыРасходаТоплива.РасходФактический);
	
	Запрос.УстановитьПараметр("мВидыРасходаТоплива", мВидыРасходаТоплива);
	Запрос.УстановитьПараметр("ВидРасходаТопливаВПределахНормы",	Перечисления.CW_ВидыРасходаТоплива.РасходВПределахНормы);
	Запрос.УстановитьПараметр("ВидРасходаТопливаСверхНормы", 		Перечисления.CW_ВидыРасходаТоплива.РасходСверхНормы);
	Запрос.УстановитьПараметр("ВидРасходаТопливаРасходФактический", Перечисления.CW_ВидыРасходаТоплива.РасходФактический);
	Запрос.УстановитьПараметр("ПараметрСклад", 						ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.Склад);
	Запрос.УстановитьПараметр("ПараметрПодразделение", 				ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.Подразделение);
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("ИсходныеДанныеСписание", 		ПакетРезультатовЗапроса[6].Выгрузить());
	Результат.Вставить("ИсходныеДанныеСписаниеНаФорме", ПакетРезультатовЗапроса[7].Выгрузить());
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеЗаработнойПлаты(ПараметрыПроцедуры)    
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
	|	ХозрасчетныйОбороты.Субконто2 КАК Субконто2,
	|	ХозрасчетныйОбороты.Субконто3 КАК Субконто3,
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.Валюта КАК Валюта,
	|	//Поле_Подразделение  КАК Подразделение,
	|	ХозрасчетныйОбороты.СуммаОборотДт КАК Сумма,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт КАК СуммаНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт КАК СуммаПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт КАК СуммаВР
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			Счет = &СчетУчетаЗаработнойПлаты,
	|			,
	|			Субконто1 В (&мСтатьиЗатарат)
	|			//УСЛОВИЕ_Организация
	|			,
	|			,
	|			) КАК ХозрасчетныйОбороты";  
	
	
	Если ЗначениеЗаполнено(ПараметрыПроцедуры.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_Организация",  "И Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", ПараметрыПроцедуры.Организация);
	КонецЕсли;   
	
	Если ПараметрыПроцедуры.ВестиУчетЗатратПоПодразделениям 
		или ПараметрыПроцедуры.ВестиУчетПоПодразделениям Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Поле_Подразделение",  "ХозрасчетныйОбороты.Подразделение");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Поле_Подразделение",  "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)");
	КонецЕсли;
	
	МассивСтатейЗатаратПоОплатеТруда = ПолучитьМассивСтатейЗатаратПоОплатеТруда();
	
	
	Запрос.УстановитьПараметр("НачалоПериода", 	ПараметрыПроцедуры.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 	Новый Граница(ПараметрыПроцедуры.ДатаОкончания, ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("мСтатьиЗатарат", 			МассивСтатейЗатаратПоОплатеТруда);
	Запрос.УстановитьПараметр("СчетУчетаЗаработнойПлаты", 	ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции    
//---ЗАПОЛНЕНИЕ ДАННЫХ НА ФОРМЕ 


//ФОРМИРОВАНИЕ ПЕРЕМЕЩЕНИя ТОПЛИВА
Процедура СформироватьПеремещенияТоплива(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВнешниеДанные.Организация КАК Организация,
	|	//Поле_Подразделение КАК Подразделение,
	|	//ПОЛЕ_ДатаПеремещения КАК ДатаПеремещения,  
	|	ВнешниеДанные.Номенклатура КАК Номенклатура,
	|	ВнешниеДанные.СкладОтправитель КАК СкладОтправитель,
	|	ВнешниеДанные.СкладПолучатель КАК СкладПолучатель,
	|	ВнешниеДанные.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	&ВнешниеДанные КАК ВнешниеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.ДатаПеремещения КАК ДатаПеремещения,
	|	ВТ_ИсходныеДанные.Организация КАК Организация,
	|	ВТ_ИсходныеДанные.Подразделение КАК Подразделение,
	|	ВТ_ИсходныеДанные.СкладОтправитель КАК СкладОтправитель,
	|	ВТ_ИсходныеДанные.СкладПолучатель КАК СкладПолучатель,
	|	ВТ_ИсходныеДанные.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_ИсходныеДанные.Количество) КАК Количество,
	|	ВТ_ИсходныеДанные.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.Номенклатура,
	|	ВТ_ИсходныеДанные.Подразделение,
	|	ВТ_ИсходныеДанные.ДатаПеремещения,
	|	ВТ_ИсходныеДанные.Организация,
	|	ВТ_ИсходныеДанные.СкладПолучатель,
	|	ВТ_ИсходныеДанные.СкладОтправитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПеремещения,
	|	Организация
	|ИТОГИ ПО
	|	ДатаПеремещения,
	|	Организация,
	|	Подразделение,
	|	СкладОтправитель,
	|	СкладПолучатель
	|АВТОУПОРЯДОЧИВАНИЕ";   
	
	Если ПараметрыПроцедуры.ВестиУчетПоПодразделениям Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Поле_Подразделение", "ВнешниеДанные.ПодразделениеПолучатель");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//Поле_Подразделение", "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)");
	КонецЕсли;  
	
	Если ПараметрыПроцедуры.СводноеПеремещение Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕ_ДатаПеремещения", "&ДатаПеремещений");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕ_ДатаПеремещения", "ВнешниеДанные.ДатаЗаправки");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВнешниеДанные",		ПараметрыПроцедуры.ВнешниеДанные);
	Запрос.УстановитьПараметр("ДатаПеремещений",	ПараметрыПроцедуры.ДатаПеремещений); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка_Даты = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МасссивПеремещений = ПометитьНаУдалениеДокументыПеремещениеТоваров(ПараметрыПроцедуры);
	
	ИндексДокумента = 0;
	
	Пока Выборка_Даты.Следующий() Цикл
		
		Выборка_Организации = Выборка_Даты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка_Организации.Следующий() Цикл
			
			Выборка_Подразделение = Выборка_Организации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка_Подразделение.Следующий() Цикл
				
				Выборка_СкладОтправитель = Выборка_Подразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока Выборка_СкладОтправитель.Следующий() Цикл
					
					Выборка_СкладПолучатель = Выборка_СкладОтправитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока Выборка_СкладПолучатель.Следующий() Цикл
						
						СоздатьДокумент = истина;
						Если МасссивПеремещений.Количество() > 0 и ИндексДокумента < МасссивПеремещений.Количество() Тогда
							
							СсылкаНаДокумент = МасссивПеремещений[ИндексДокумента];
							
							//Готовим документ
							ДокументПеремещения = СсылкаНаДокумент.ПолучитьОбъект();
							ДокументПеремещения.УстановитьПометкуУдаления(Ложь);
							ДокументПеремещения.Товары.Очистить();
							
							ИндексДокумента = ИндексДокумента + 1;
							СоздатьДокумент = Ложь;
							
						КонецЕсли;
						
						Если СоздатьДокумент Тогда
							//новый документ
							ДокументПеремещения = Документы.ПеремещениеТоваров.СоздатьДокумент();
						КонецЕсли;
						
						ДокументПеремещения.Дата 		= Выборка_Даты.ДатаПеремещения;
						ДокументПеремещения.Организация = Выборка_Организации.Организация;
						ДокументПеремещения.Комментарий = "Сформирован обработокй ""Формирование документов учета ГСМ в БУ""";
						
						Если ПараметрыПроцедуры.ВестиУчетПоПодразделениям Тогда
							ДокументПеремещения.ПодразделениеПолучатель  = ПараметрыПроцедуры.ПодразделениеОрганизации;
							ДокументПеремещения.ПодразделениеОтправитель = ПараметрыПроцедуры.ПодразделениеОрганизации;
						КонецЕсли;
						
						ДокументПеремещения.СкладОтправитель 		= Выборка_СкладОтправитель.СкладОтправитель;
						ДокументПеремещения.СкладПолучатель 		= Выборка_СкладПолучатель.СкладПолучатель;
						ДокументПеремещения.НДСвСтоимостиТоваров 	= Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять;
						
						ДокументПеремещения.Ответственный 			= ПараметрыСеанса.ТекущийПользователь;
						
						//ДокументПеремещения.ДополнительныеСвойства.Вставить("ЗаполнитьСчетаУчетаПередЗаписью", Истина);
						
						Выборка_ДетальныеЗаписи = Выборка_СкладПолучатель.Выбрать();
						
						Пока Выборка_ДетальныеЗаписи.Следующий() Цикл
							
							НоваяСтрока = ДокументПеремещения.Товары.Добавить();
							
							НоваяСтрока.Номенклатура 			= Выборка_ДетальныеЗаписи.Номенклатура;
							НоваяСтрока.ЕдиницаИзмерения 		= Выборка_ДетальныеЗаписи.ЕдиницаИзмерения;
							НоваяСтрока.КоличествоМест 			= Выборка_ДетальныеЗаписи.Количество;
							НоваяСтрока.Количество 				= Выборка_ДетальныеЗаписи.Количество;
							НоваяСтрока.Коэффициент 			= 1;
							
							НоваяСтрока.СчетУчета 			= ПланыСчетов.Хозрасчетный.Топливо;
							НоваяСтрока.НовыйСчетУчета 		= ПланыСчетов.Хозрасчетный.Топливо;
							НоваяСтрока.СпособУчетаНДС 		= СпособУчетаНДСНоменклатуры(Выборка_ДетальныеЗаписи.Номенклатура.НоменклатурнаяГруппа.СпособУчетаНДС); 
							
						КонецЦикла;
						
						Если ДокументПеремещения.Товары.Количество() > 0 Тогда
							
							РежимЗаписи = РежимЗаписиДокумента.Запись;
							
							Если ПараметрыПроцедуры.ПровестиДокументыПеремещения Тогда
								РежимЗаписи = РежимЗаписиДокумента.Проведение;
							КонецЕсли;
							
							Попытка
								ДокументПеремещения.Записать(РежимЗаписи);
							Исключение
								ДокументПеремещения.Записать(РежимЗаписиДокумента.Запись);
								
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
								"Не удалось провести документ "+СокрЛП(ДокументПеремещения.Ссылка)+" по причине "+ОписаниеОшибки()+ ". ДОКУМЕНТ ЗАПИСАН!");
								
							КонецПопытки;
							
							//Записать дополнительное свойство
							ЗаписатьДополнителнительноеСвойствоДокумента(ДокументПеремещения.Ссылка, ПараметрыПроцедуры.ДополнительноеСвойство);
							
							ПроверитьНаличиеДокументов = Истина;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;     
	
	Результат = Новый Структура;
	Результат.Вставить("ПроверитьНаличиеДокументовПриЗакрытии", ПроверитьНаличиеДокументов);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Функция ПометитьНаУдалениеДокументыПеремещениеТоваров(ПараметрыПроцедуры)
	
	МассивПомеченныхНаУдаление = Новый Массив;
	
	РезультатЗапроса = ПолучитьРезультатЗапросаПеремещений(ПараметрыПроцедуры);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		ДокументОбъект.УстановитьПометкуУдаления(истина); 
		
		МассивПомеченныхНаУдаление.Добавить(Выборка.Ссылка);
	КонецЦикла;  
	
	Возврат МассивПомеченныхНаУдаление;
	
КонецФункции

Функция ПолучитьРезультатЗапросаПеремещений(Знач ПараметрыПроцедуры) ЭКспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДокументПеремещениеТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ДокументПеремещениеТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО ДокументПеремещениеТоваров.Ссылка = ДополнительныеСведения.Объект
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство
	|	И ДополнительныеСведения.Значение = ИСТИНА
	|	И ДокументПеремещениеТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ДокументПеремещениеТоваров.ПометкаУдаления 
	|	//УСЛОВИЕ_Организация
	|	";
	
	Если ЗначениеЗаполнено(ПараметрыПроцедуры.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_Организация", "И ДокументПеремещениеТоваров.Организация = &Организация");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", 	ПараметрыПроцедуры.Организация);
	Запрос.УстановитьПараметр("ДатаНачала",		ПараметрыПроцедуры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ПараметрыПроцедуры.ДатаОкончания);
	Запрос.УстановитьПараметр("Свойство", 		ПараметрыПроцедуры.ДополнительноеСвойство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
//---ФОРМИРОВАНИЕ ПЕРЕМЕЩЕНИя ТОПЛИВА


//ФОРМИРОВАНИЕ ТРЕБОВАНИЯ-НАКЛАДНОЙ
Процедура СформироватьТребованияНакладные(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	МассивНакладных = ПометитьНаУдалениеДокументыТребованиеНакладная(ПараметрыПроцедуры);
	ПараметрыПроцедуры.Вставить("МассивНакладных", МассивНакладных);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Счет_20", ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ОсновноеПроизводство"));
	Запрос.УстановитьПараметр("ВидРасходаВПределахНормы", Перечисления.CW_ВидыРасходаТоплива.РасходВПределахНормы);
	Запрос.УстановитьПараметр("ВидРасходаСверхНормы", Перечисления.CW_ВидыРасходаТоплива.РасходСверхНормы);
	
	Запрос.УстановитьПараметр("ВестиУчетПоПодразделениям", ПараметрыПроцедуры.ВестиУчетПоПодразделениям);
	Запрос.УстановитьПараметр("ВестиУчетЗатратПоПодразделениям", ПараметрыПроцедуры.ВестиУчетЗатратПоПодразделениям);
	Запрос.УстановитьПараметр("ФормироватьРазныеДокументыПоВидуРасхода", ПараметрыПроцедуры.ФормироватьРазныеДокументыПоВидуРасхода);
	Запрос.УстановитьПараметр("ВнешниеДанные", ПараметрыПроцедуры.ВнешниеДанные);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВнешниеДанные.Склад КАК Склад,
	|	ВнешниеДанные.Организация КАК Организация,
	|	ВнешниеДанные.Номенклатура КАК Номенклатура,
	|	ВнешниеДанные.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВнешниеДанные.ВариантОтраженияЗатратПоБУ КАК ВариантОтраженияЗатратПоБУ,
	|	ВнешниеДанные.ВидРасходаТоплива КАК ВидРасходаТоплива,
	|	ВнешниеДанные.Подразделение КАК Подразделение,
	|	ВнешниеДанные.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	&ВнешниеДанные КАК ВнешниеДанные";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Склад КАК Склад,
	|	ВТ_ИсходныеДанные.Организация КАК Организация,
	|	//ПОЛЕ_Подразделение КАК Подразделение, 
	|	ВТ_ИсходныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СУММА(ВТ_ИсходныеДанные.Количество) КАК Количество,
	|	ВТ_ИсходныеДанные.ВидРасходаТоплива КАК ВидРасходаТоплива
	|ПОМЕСТИТЬ ВТ_СобственныеЗатраты
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.Количество > 0
	|	И ВТ_ИсходныеДанные.ВидРасходаТоплива = &ВидРасходаВПределахНормы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа,
	|	ВТ_ИсходныеДанные.Номенклатура,
	|	//ПОЛЕ_Подразделение,
	|	ВТ_ИсходныеДанные.Организация,
	|	ВТ_ИсходныеДанные.Склад,
	|	ВТ_ИсходныеДанные.ВидРасходаТоплива
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Склад,
	|	ВТ_ИсходныеДанные.Организация,
	|	//ПОЛЕ_Подразделение, 
	|	ВТ_ИсходныеДанные.Номенклатура,
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа,
	|	СУММА(ВТ_ИсходныеДанные.Количество),
	|	ВТ_ИсходныеДанные.ВидРасходаТоплива
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.ВариантОтраженияЗатратПоБУ.СчетЗатрат = &Счет_20
	|	И ВТ_ИсходныеДанные.ВидРасходаТоплива = &ВидРасходаСверхНормы
	|	И ВТ_ИсходныеДанные.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа,
	|	ВТ_ИсходныеДанные.Номенклатура,
	|	ВТ_ИсходныеДанные.Организация,
	|	ВТ_ИсходныеДанные.Склад,
	|	//ПОЛЕ_Подразделение,
	|	ВТ_ИсходныеДанные.ВидРасходаТоплива";
	
	Если ПараметрыПроцедуры.ВестиУчетПоподразделениям 
		или ПараметрыПроцедуры.ВестиУчетЗатратПоПодразделениям  Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕ_Подразделение", "ВТ_ИсходныеДанные.Подразделение");   
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕГРУППИРОВКИ_Подразделение", "Значение(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)");
	КонецЕсли;
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_СобственныеЗатраты.Склад КАК Склад,
	|	ВТ_СобственныеЗатраты.Организация КАК Организация,
	|	ВТ_СобственныеЗатраты.Подразделение КАК Подразделение,
	|	ВТ_СобственныеЗатраты.Номенклатура КАК Номенклатура,
	|	ВТ_СобственныеЗатраты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СУММА(ВТ_СобственныеЗатраты.Количество) КАК Количество, 
	|	//ПОЛЕ_ВидРасхода КАК ВидРасхода 
	|ИЗ
	|	ВТ_СобственныеЗатраты КАК ВТ_СобственныеЗатраты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СобственныеЗатраты.Организация,
	|	ВТ_СобственныеЗатраты.Склад,
	|	ВТ_СобственныеЗатраты.НоменклатурнаяГруппа,
	|	ВТ_СобственныеЗатраты.Номенклатура,
	|	ВТ_СобственныеЗатраты.Подразделение,  
	|	//ПОЛЕ_ВидРасхода
	|ИТОГИ ПО
	|	Организация,
	|	Склад,
	|	Подразделение,
	|	ВидРасхода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Организация КАК Организация,
	|	ВТ_ИсходныеДанные.Склад КАК Склад,
	|	ВТ_ИсходныеДанные.ВариантОтраженияЗатратПоБУ КАК ВариантОтраженияЗатратПоБУ,
	|	ВТ_ИсходныеДанные.Номенклатура КАК Номенклатура,
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа, 
	|	//ПОЛЕ_Подразделение КАК Подразделение,
	|	СУММА(ВТ_ИсходныеДанные.Количество) КАК Количество
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.Количество > 0
	|	И ВТ_ИсходныеДанные.ВидРасходаТоплива = &ВидРасходаСверхНормы
	|	И ВТ_ИсходныеДанные.ВариантОтраженияЗатратПоБУ.СчетЗатрат <> &Счет_20
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.ВариантОтраженияЗатратПоБУ,
	|	ВТ_ИсходныеДанные.Склад,
	|	ВТ_ИсходныеДанные.Организация,
	|	ВТ_ИсходныеДанные.НоменклатурнаяГруппа,
	|	ВТ_ИсходныеДанные.Номенклатура,  
	|	//ПОЛЕ_Подразделение
	|ИТОГИ ПО
	|	Организация,
	|	Склад,
	|	Подразделение,
	|	ВариантОтраженияЗатратПоБУ";   
	
	Если ПараметрыПроцедуры.ФормироватьРазныеДокументыПоВидуРасхода Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕ_ВидРасхода", "ВТ_СобственныеЗатраты.ВидРасходаТоплива");   
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕ_ВидРасхода", "Значение(Перечисление.CW_ВидыРасходаТоплива.ПустаяСсылка)");
	КонецЕсли;
	
	Если ПараметрыПроцедуры.ВестиУчетПоподразделениям 
		или ПараметрыПроцедуры.ВестиУчетЗатратПоПодразделениям  Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕ_Подразделение", "ВТ_ИсходныеДанные.Подразделение");   
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕГРУППИРОВКИ_Подразделение", "Значение(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)");
	КонецЕсли;
	
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатОсновноеПроизводство	= ПакетРезультатовЗапроса[0];
	РезультатПрочееСписание 		= ПакетРезультатовЗапроса[1];
	
	ПараметрыПроцедуры.Вставить("ПроверитьНаличиеДокументов", Неопределено);
	
	ИндексДокумента = 0;  
	Если Не	РезультатОсновноеПроизводство.Пустой() Тогда
		//СПИСАНИЕ ПО НОРМЕ
		СформироватьСписаниеПоНорме(РезультатОсновноеПроизводство, ИндексДокумента, ПараметрыПроцедуры);
	КонецЕсли;
	
	Если Не	РезультатПрочееСписание.Пустой() Тогда
		//СПИСАНИЕ СВЕРХ НОРМЫ
		СформироватьСписаниеСверхНормы(РезультатПрочееСписание, ИндексДокумента, ПараметрыПроцедуры);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПроверитьНаличиеДокументовПриЗакрытии", ПараметрыПроцедуры.ПроверитьНаличиеДокументов);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Процедура СформироватьСписаниеПоНорме(РезультатОсновноеПроизводство, ИндексДокумента, ПараметрыПроцедуры)
	
	СтурктураШапки = Новый Структура("Организация,Склад,Подразделение,Комментарий", Неопределено, Неопределено, Неопределено, Неопределено);
	
	Выборка_Организации = РезультатОсновноеПроизводство.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПроверитьНаличиеДокументов = Неопределено;
	
	Пока Выборка_Организации.Следующий() Цикл
		
		СтурктураШапки.Организация  =  Выборка_Организации.Организация;
		
		Выборка_Склады = Выборка_Организации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка_Склады.Следующий() Цикл
			
			СтурктураШапки.Склад  =  Выборка_Склады.Склад;
			
			Выборка_Подразделения = Выборка_Склады.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка_Подразделения.Следующий() Цикл
				
				Если ВариантыПриложений.ЭтоВерсияКОРП() Тогда       
					СтурктураШапки.Подразделение  =  ПараметрыПроцедуры.ПодразделениеОрганизации;
				Иначе
					СтурктураШапки.Подразделение  =  Выборка_Подразделения.Подразделение;
				КонецЕсли;
				
				Выборка_ВидРасхода  = Выборка_Подразделения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока Выборка_ВидРасхода.Следующий() Цикл
					
					СтурктураШапки.Комментарий =  СокрЛП(Выборка_ВидРасхода.ВидРасхода)+ " (Сформирован обработокй ""Формирование документов учета ГСМ в БУ"")";
					
					Выборка_ДетальныеЗаписи = Выборка_ВидРасхода.Выбрать();
					
					ОбработатьВыборкуДетальныхЗаписейПоНорме(Выборка_ДетальныеЗаписи, СтурктураШапки, ИндексДокумента, ПараметрыПроцедуры);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура  СформироватьСписаниеСверхНормы(РезультатПрочееСписание, ИндексДокумента, ПараметрыПроцедуры)
	
	СтурктураШапки = Новый Структура("Организация, Склад, Подразделение, СчетЗатрат, Субконто1, Субконто2, Субконто3",Неопределено,Неопределено,Неопределено,Неопределено,Неопределено,Неопределено,Неопределено);
	
	ПроверитьНаличиеДокументов = Неопределено;
	
	Выборка_Организации = РезультатПрочееСписание.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка_Организации.Следующий() Цикл
		
		СтурктураШапки.Организация  =  Выборка_Организации.Организация;
		
		Выборка_Склады = Выборка_Организации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка_Склады.Следующий() Цикл
			
			СтурктураШапки.Склад  =  Выборка_Склады.Склад;
			
			Выборка_Подразделения = Выборка_Склады.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка_Подразделения.Следующий() Цикл
				
				Если ВариантыПриложений.ЭтоВерсияКОРП() Тогда       
					СтурктураШапки.Подразделение  =  ПараметрыПроцедуры.ПодразделениеОрганизации;
				Иначе
					СтурктураШапки.Подразделение  =  Выборка_Подразделения.Подразделение;
				КонецЕсли;
				
				Выборка_ВариантСписанияЗатрат = Выборка_Подразделения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока Выборка_ВариантСписанияЗатрат.Следующий() Цикл
					
					СтурктураШапки.СчетЗатрат  	=  Выборка_ВариантСписанияЗатрат.ВариантОтраженияЗатратПоБУ.СчетЗатрат;
					СтурктураШапки.Субконто1 	=  Выборка_ВариантСписанияЗатрат.ВариантОтраженияЗатратПоБУ.Субконто1;
					СтурктураШапки.Субконто2  	=  Выборка_ВариантСписанияЗатрат.ВариантОтраженияЗатратПоБУ.Субконто2;
					СтурктураШапки.Субконто3  	=  Выборка_ВариантСписанияЗатрат.ВариантОтраженияЗатратПоБУ.Субконто3;
					
					Выборка_ДетальныеЗаписи = Выборка_ВариантСписанияЗатрат.Выбрать();
					
					ОбработатьВыборкуДетальныхЗаписейСверхНормы(Выборка_ДетальныеЗаписи, СтурктураШапки, ИндексДокумента, ПараметрыПроцедуры);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;   
	
КонецПроцедуры

Процедура ОбработатьВыборкуДетальныхЗаписейПоНорме(Выборка_ДетальныеЗаписи, СтрукртураШапки, ИндексДокумента, ПараметрыПроцедуры)
	
	РаздельныйУчетНДСНаСчете19  = ПолучитьРаздельныйРежимУчетаНДС(СтрукртураШапки.Организация,КонецДня(ПараметрыПроцедуры.ДатаНакладных));
	СтатьяЗатрат 				= Константы.CW_СтатьяЗатратСписанияТопливаПоПутевымЛистам.Получить();
	
	МассивНакладных = ПараметрыПроцедуры.МассивНакладных;
	
	СоздатьДокумент = истина;
	Если МассивНакладных.Количество() > 0 и ИндексДокумента < МассивНакладных.Количество() Тогда
		
		СсылкаНаДокумент = МассивНакладных[ИндексДокумента];
		
		//Готовим документ
		НовыйДокумент = СсылкаНаДокумент.ПолучитьОбъект();
		НовыйДокумент.УстановитьПометкуУдаления(Ложь);
		НовыйДокумент.Материалы.Очистить();
		
		ИндексДокумента = ИндексДокумента + 1;
		СоздатьДокумент = Ложь;
		
	КонецЕсли;
	
	Если СоздатьДокумент Тогда	
		НовыйДокумент = Документы.ТребованиеНакладная.СоздатьДокумент();
	КонецЕсли;	
	
	НовыйДокумент.Дата 						= КонецДня(ПараметрыПроцедуры.ДатаНакладных);
	НовыйДокумент.Организация 				= СтрукртураШапки.Организация;
	НовыйДокумент.Склад						= СтрукртураШапки.Склад;
	НовыйДокумент.Комментарий				= СтрукртураШапки.Комментарий;
	
	НовыйДокумент.Ответственный 			= ПараметрыСеанса.ТекущийПользователь;
	
	НовыйДокумент.НДСвСтоимостиТоваров      = Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять;
	
	Если ПараметрыПроцедуры.ВестиУчетПоПодразделениям Тогда
		НовыйДокумент.ПодразделениеОрганизации	= ПараметрыПроцедуры.ПодразделениеОрганизации;
	КонецЕсли;
	
	Если ПараметрыПроцедуры.ВестиУчетЗатратПоПодразделениям Тогда
		НовыйДокумент.ПодразделениеЗатрат		= СтрукртураШапки.Подразделение;
	КонецЕсли;
	
	НовыйДокумент.СчетаУчетаЗатратВТаблице 	= Истина;
	
	//НовыйДокумент.ДополнительныеСвойства.Вставить("ЗаполнитьСчетаУчетаПередЗаписью", Истина);
	
	Пока Выборка_ДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = НовыйДокумент.Материалы.Добавить();
		
		НоваяСтрока.СчетЗатрат				= ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ОсновноеПроизводство"); 
		
		Если ПараметрыПроцедуры.ВестиУчетЗатратПоПодразделениям Тогда
			НоваяСтрока.ПодразделениеЗатрат	= СтрукртураШапки.Подразделение;
		КонецЕсли;
		
		НоваяСтрока.Субконто1 	= Выборка_ДетальныеЗаписи.НоменклатурнаяГруппа;
		НоваяСтрока.Субконто2	= СтатьяЗатрат;
		
		
		НоваяСтрока.Счет 					= ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Топливо");
		
		НоваяСтрока.Номенклатура 			= Выборка_ДетальныеЗаписи.Номенклатура;
		
		НоваяСтрока.КоличествоМест 			= Выборка_ДетальныеЗаписи.Количество;
		НоваяСтрока.Количество 				= Выборка_ДетальныеЗаписи.Количество;
		НоваяСтрока.Коэффициент 			= 1;
		
		Если РаздельныйУчетНДСНаСчете19 Тогда
			НоваяСтрока.СпособУчетаНДС = СпособУчетаНДСНоменклатуры(Выборка_ДетальныеЗаписи.Номенклатура.НоменклатурнаяГруппа.СпособУчетаНДС);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НовыйДокумент.Материалы.Количество() > 0 Тогда
		
		РежимЗаписи = РежимЗаписиДокумента.Запись;
		
		Если ПараметрыПроцедуры.ПровестиДокументыНакладные Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли;
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписи);
		Исключение
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось провести документ "+СокрЛП(НовыйДокумент.Ссылка)+" по причине "+ОписаниеОшибки()+ ". ДОКУМЕНТ ЗАПИСАН!";
			Сообщение.Сообщить();
			
		КонецПопытки;
		
		ЗаписатьДополнителнительноеСвойствоДокумента(НовыйДокумент.Ссылка, ПараметрыПроцедуры.ДополнительноеСвойство);
		
		ПараметрыПроцедуры.ПроверитьНаличиеДокументов = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьВыборкуДетальныхЗаписейСверхНормы(Выборка_ДетальныеЗаписи, СтрукртураШапки, ИндексДокумента, ПараметрыПроцедуры)
	
	РаздельныйУчетНДСНаСчете19 = ПолучитьРаздельныйРежимУчетаНДС(СтрукртураШапки.Организация,КонецДня(ПараметрыПроцедуры.ДатаНакладных));
	
	МассивНакладных = ПараметрыПроцедуры.МассивНакладных;
	
	СоздатьДокумент = истина;
	Если МассивНакладных.Количество() > 0 и ИндексДокумента < МассивНакладных.Количество() Тогда
		
		СсылкаНаДокумент = МассивНакладных[ИндексДокумента];
		
		//Готовим документ
		НовыйДокумент = СсылкаНаДокумент.ПолучитьОбъект();
		НовыйДокумент.УстановитьПометкуУдаления(Ложь);
		НовыйДокумент.Материалы.Очистить();
		
		ИндексДокумента = ИндексДокумента + 1;
		СоздатьДокумент = Ложь;
		
	КонецЕсли;
	
	Если СоздатьДокумент Тогда	
		НовыйДокумент = Документы.ТребованиеНакладная.СоздатьДокумент();
	КонецЕсли;	
	
	НовыйДокумент.Дата 						= КонецДня(ПараметрыПроцедуры.ДатаНакладных);
	НовыйДокумент.Организация 				= СтрукртураШапки.Организация;
	НовыйДокумент.Склад						= СтрукртураШапки.Склад;
	НовыйДокумент.Ответственный 			= ПараметрыСеанса.ТекущийПользователь;
	НовыйДокумент.Комментарий				= СокрЛП(Перечисления.CW_ВидыРасходаТоплива.РасходСверхНормы) + " (Сформирован обработокй ""Формирование документов учета ГСМ в БУ"")";
	
	НовыйДокумент.НДСвСтоимостиТоваров      = Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять;
	
	Если ПараметрыПроцедуры.ВестиУчетПоПодразделениям Тогда
		НовыйДокумент.ПодразделениеОрганизации	= ПараметрыПроцедуры.ПодразделениеОрганизации;
	КонецЕсли;
	
	Если ПараметрыПроцедуры.ВестиУчетЗатратПоПодразделениям Тогда
		НовыйДокумент.ПодразделениеЗатрат		= СтрукртураШапки.Подразделение;
	КонецЕсли;
	
	НовыйДокумент.СчетаУчетаЗатратВТаблице 	= Ложь;
	
	НовыйДокумент.СчетЗатрат 			= СтрукртураШапки.СчетЗатрат;
	НовыйДокумент.Субконто1 			= СтрукртураШапки.Субконто1;
	НовыйДокумент.Субконто2 			= СтрукртураШапки.Субконто2;
	НовыйДокумент.Субконто3 			= СтрукртураШапки.Субконто3;
	
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрукртураШапки.СчетЗатрат);
	
	
	ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы;
	
	Если СвойстваСчета.ВидСубконто1 = ВидСубконто тогда
		
	ИначеЕсли  СвойстваСчета.ВидСубконто2 = ВидСубконто тогда
		
	ИначеЕсли  СвойстваСчета.ВидСубконто3 = ВидСубконто тогда
		
	КонецЕсли;
	
	Если РаздельныйУчетНДСНаСчете19 Тогда
		НовыйДокумент.СпособУчетаНДС 			=  Перечисления.СпособыУчетаНДС.УчитываетсяВCтоимости;
	КонецЕсли;
	
	Если ПараметрыПроцедуры.ВестиУчетЗатратПоПодразделениям Тогда
		НовыйДокумент.ПодразделениеЗатрат		= СтрукртураШапки.Подразделение;
	КонецЕсли;
	
	Пока Выборка_ДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = НовыйДокумент.Материалы.Добавить();
		
		НоваяСтрока.Счет 					=  ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Топливо");
		
		НоваяСтрока.Номенклатура 			= Выборка_ДетальныеЗаписи.Номенклатура;
		НоваяСтрока.КоличествоМест 			= Выборка_ДетальныеЗаписи.Количество;
		НоваяСтрока.Количество 				= Выборка_ДетальныеЗаписи.Количество;
		НоваяСтрока.Коэффициент 			= 1;
		НоваяСтрока.СпособУчетаНДС 			= СпособУчетаНДСНоменклатуры(Выборка_ДетальныеЗаписи.Номенклатура.НоменклатурнаяГруппа.СпособУчетаНДС);
		
	КонецЦикла;
	
	Если НовыйДокумент.Материалы.Количество() > 0 Тогда
		
		РежимЗаписи = РежимЗаписиДокумента.Запись;
		
		Если ПараметрыПроцедуры.ПровестиДокументыНакладные Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли;
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписи);
		Исключение
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось провести документ "+СокрЛП(НовыйДокумент.Ссылка)+" по причине "+ОписаниеОшибки()+ ". ДОКУМЕНТ ЗАПИСАН!";
			Сообщение.Сообщить();
			
		КонецПопытки;
		
		ЗаписатьДополнителнительноеСвойствоДокумента(НовыйДокумент.Ссылка, ПараметрыПроцедуры.ДополнительноеСвойство);
		
		ПараметрыПроцедуры.ПроверитьНаличиеДокументов = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПометитьНаУдалениеДокументыТребованиеНакладная(ПараметрыПроцедуры)
	
	МассивПомеченныхНаУдаление = Новый Массив;
	
	РезультатЗапроса = ПолучитьРезультатЗапросаТребованияНакладная(ПараметрыПроцедуры);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		ДокументОбъект.УстановитьПометкуУдаления(истина); 
		
		МассивПомеченныхНаУдаление.Добавить(Выборка.Ссылка);
	КонецЦикла;  
	
	Возврат МассивПомеченныхНаУдаление;
	
КонецФункции

Функция ПолучитьРезультатЗапросаТребованияНакладная(Знач ПараметрыПроцедуры) ЭКспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДокументТребованиеНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ТребованиеНакладная КАК ДокументТребованиеНакладная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО ДокументТребованиеНакладная.Ссылка = ДополнительныеСведения.Объект
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство
	|	И ДополнительныеСведения.Значение = ИСТИНА
	|	И ДокументТребованиеНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ДокументТребованиеНакладная.ПометкаУдаления 
	|	//УСЛОВИЕ_Организация
	|	"; 
	
	Если ЗначениеЗаполнено(ПараметрыПроцедуры.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_Организация", "И ДокументТребованиеНакладная.Организация = &Организация");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", 	ПараметрыПроцедуры.Организация);
	Запрос.УстановитьПараметр("Свойство", 		ПараметрыПроцедуры.ДополнительноеСвойство);
	Запрос.УстановитьПараметр("ДатаНачала",		ПараметрыПроцедуры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ПараметрыПроцедуры.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
//---ФОРМИРОВАНИЕ ТРЕБОВАНИЯ-НАКЛАДНОЙ

//ФОРМИРОВАНИЕ ОПЕРАЦИЙ
Процедура СформироватьОперацииРаспределенияЗарплаты(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	МассивОперацийБух = ПометитьНаУдалениеДокументыОперацииБух(ПараметрыПроцедуры);
	
	ПараметрыПроцедуры.Вставить("МассивОперацийБух", 			МассивОперацийБух);
	ПараметрыПроцедуры.Вставить("ПроверитьНаличиеДокументов", 	Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("Организация", 	ПараметрыПроцедуры.Организация);
	Запрос.УстановитьПараметр("ВнешниеДанные", 	ПараметрыПроцедуры.ВнешниеДанные); 
	Запрос.УстановитьПараметр("НачалоПериода", 	ПараметрыПроцедуры.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 	ПараметрыПроцедуры.ДатаОкончания);
	Запрос.УстановитьПараметр("ВидРасходовНУ",  Перечисления.ВидыРасходовНУ.ОплатаТруда);
	
	//Данные полученные со счета 25 (находящиеся на форме)
	//если вдруг на счете 25 будет добавлена дополнительная аналитика
	//необходимо внестиизменения в запрос, добавив соответсвующие субконто
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеПоЗарплате.Счет КАК Счет,
	|	ДанныеПоЗарплате.Организация КАК Организация,
	|	ДанныеПоЗарплате.Подразделение КАК Подразделение,
	|	ДанныеПоЗарплате.Субконто1 КАК СтатьяЗатрат,
	|	ДанныеПоЗарплате.Сумма КАК СуммаБУ
	|ПОМЕСТИТЬ ВТ_ДанныеПоЗарплате
	|ИЗ
	|	&ВнешниеДанные КАК ДанныеПоЗарплате
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоЗарплате.Счет КАК Счет,
	|	ВТ_ДанныеПоЗарплате.Организация КАК Организация,
	|	ВТ_ДанныеПоЗарплате.Подразделение КАК Подразделение,
	|	ВТ_ДанныеПоЗарплате.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_ДанныеПоЗарплате.СуммаБУ КАК СуммаБУ,
	|	ВТ_ДанныеПоЗарплате.СтатьяЗатрат.ВидРасходовНУ КАК ВидРасходовНУ
	|ПОМЕСТИТЬ ДанныеУчетаБУ
	|ИЗ
	|	ВТ_ДанныеПоЗарплате КАК ВТ_ДанныеПоЗарплате";
	
	Запрос.Выполнить();
	
	//Данные движений регистра CW_ЗарплатаВодителейТС
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ЗарплатаВодителейТСОбороты.Организация КАК Организация,
	|	//ПОЛЕ_Подразделение КАК Подразделение,
	|	ЕСТЬNULL(CW_НоменклатурныеГруппыПутевыхЛистов.НоменклатурнаяГруппа, НЕОПРЕДЕЛЕНО) КАК НоменклатурнаяГруппа,
	|	CW_ЗарплатаВодителейТСОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_ЗарплатаВодителейТСОбороты.ПутевойЛист КАК ПутевойЛист,
	|	СУММА(CW_ЗарплатаВодителейТСОбороты.СуммаОборот) КАК СуммаОУ
	|ПОМЕСТИТЬ ДанныеУчетаОУ
	|ИЗ
	|	РегистрНакопления.CW_ЗарплатаВодителейТС.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			//УСЛОВИЕ_Организация
	|			) КАК CW_ЗарплатаВодителейТСОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПараметрыТС.СрезПоследних(&КонецПериода, ПараметрТранпортногоСредства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.CW_ПараметрыТранспортныхСредств.подразделение)) КАК CW_ПодразделениеТранспортныхСредств
	|		ПО CW_ЗарплатаВодителейТСОбороты.ТранспортноеСредство = CW_ПодразделениеТранспортныхСредств.ТранспортноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп КАК CW_НоменклатурныеГруппыПутевыхЛистов
	|		ПО CW_ЗарплатаВодителейТСОбороты.ПутевойЛист = CW_НоменклатурныеГруппыПутевыхЛистов.ПутевойЛист
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ЗарплатаВодителейТСОбороты.ТранспортноеСредство,
	|	CW_ЗарплатаВодителейТСОбороты.Организация,
	|	CW_ЗарплатаВодителейТСОбороты.ПутевойЛист,
	|	ЕСТЬNULL(CW_НоменклатурныеГруппыПутевыхЛистов.НоменклатурнаяГруппа, НЕОПРЕДЕЛЕНО),
	|	//ПОЛЕ_Подразделение
	|";   
	
	Если ЗначениеЗаполнено(ПараметрыПроцедуры.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_Организация", "Организация = &Организация");
	КонецЕсли;
	
	Если ПараметрыПроцедуры.УчетПоПодразделениям Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕ_Подразделение", "ЕСТЬNULL(CW_ПодразделениеТранспортныхСредств.Значение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПОЛЕ_Подразделение", "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)");
	КонецЕсли;
	
	Запрос.Выполнить();
	
	//получаем коэффициенты распределения затрат
	//Используются два коэфициента:
	// - отношение ОУ к БУ;
	// - Доля ЗП по путевым листам к общей сумме ОУ
	//Все коэффициенты получаем в разрезе организации и подразделения
	
	//Сначала подготовим общие итоги
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеУчетаБУ.Организация КАК Организация,
	|	ДанныеУчетаБУ.Подразделение КАК Подразделение,
	|	СУММА(ДанныеУчетаБУ.СуммаБУ) КАК СуммаБУ
	|ПОМЕСТИТЬ ВТ_общийИтогБУ
	|ИЗ
	|	ДанныеУчетаБУ КАК ДанныеУчетаБУ
	|ГДЕ
	|	ДанныеУчетаБУ.ВидРасходовНУ = &ВидРасходовНУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУчетаБУ.Организация,
	|	ДанныеУчетаБУ.Подразделение";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеУчетаОУ.Организация КАК Организация,
	|	ДанныеУчетаОУ.Подразделение КАК Подразделение,
	|	СУММА(ДанныеУчетаОУ.СуммаОУ) КАК СуммаОУ
	|ПОМЕСТИТЬ ВТ_ОбщийИтогОУ
	|ИЗ
	|	ДанныеУчетаОУ КАК ДанныеУчетаОУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУчетаОУ.Подразделение,
	|	ДанныеУчетаОУ.Организация";
	
	Запрос.Выполнить();
	
	//Получим коэффициент ОУ к БУ
	Запрос.Текст ="ВЫБРАТЬ
	|	ВТ_общийИтогБУ.Организация КАК Организация,
	|	ВТ_общийИтогБУ.Подразделение КАК Подразделение,
	|	ВТ_ОбщийИтогОУ.СуммаОУ КАК СуммаОУ,
	|	ВТ_общийИтогБУ.СуммаБУ КАК СуммаБУ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ОбщийИтогОУ.СуммаОУ, 0) / ВТ_общийИтогБУ.СуммаБУ > 1
	|			ТОГДА 1
	|		ИНАЧЕ (ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОбщийИтогОУ.СуммаОУ, 0) КАК ЧИСЛО(38, 30))) / ВТ_общийИтогБУ.СуммаБУ
	|	КОНЕЦ КАК Коэффициент_ОУ_БУ
	|ПОМЕСТИТЬ ВТ_Коэфициент_ОУ_БУ
	|ИЗ
	|	ВТ_общийИтогБУ КАК ВТ_общийИтогБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщийИтогОУ КАК ВТ_ОбщийИтогОУ
	|		ПО ВТ_общийИтогБУ.Организация = ВТ_ОбщийИтогОУ.Организация
	|			И ВТ_общийИтогБУ.Подразделение = ВТ_ОбщийИтогОУ.Подразделение";
	
	Запрос.Выполнить();
	
	//Получим доли путевых листов ОУ
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеУчетаОУ.Организация КАК Организация,
	|	ДанныеУчетаОУ.Подразделение КАК Подразделение,
	|	ДанныеУчетаОУ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ДанныеУчетаОУ.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ДанныеУчетаОУ.ПутевойЛист КАК ПутевойЛист,
	|	ДанныеУчетаОУ.СуммаОУ КАК СуммаОУ,
	|	ВТ_ОбщийИтогОУ.СуммаОУ КАК ОбщаяСуммаОУ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ОбщийИтогОУ.СуммаОУ, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ДанныеУчетаОУ.СуммаОУ КАК ЧИСЛО(38,30))/ ВТ_ОбщийИтогОУ.СуммаОУ
	|	КОНЕЦ КАК Коэффициент_ОУ
	|ПОМЕСТИТЬ ВТ_КоэффициентыОУ
	|ИЗ
	|	ДанныеУчетаОУ КАК ДанныеУчетаОУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбщийИтогОУ КАК ВТ_ОбщийИтогОУ
	|		ПО ДанныеУчетаОУ.Организация = ВТ_ОбщийИтогОУ.Организация
	|			И ДанныеУчетаОУ.Подразделение = ВТ_ОбщийИтогОУ.Подразделение";
	
	Запрос.Выполнить();
	
	//Готовим общую таблицу с коэфициепнтами распределения
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеУчетаБУ.Счет КАК Счет,
	|	ДанныеУчетаБУ.Организация КАК Организация,
	|	ДанныеУчетаБУ.Подразделение КАК Подразделение,
	|	ДанныеУчетаБУ.СтатьяЗатрат КАК СтатьяЗатрат,
	|	СУММА(ДанныеУчетаБУ.СуммаБУ) КАК СуммаБУ,
	|	ВТ_Коэфициент_ОУ_БУ.Коэффициент_ОУ_БУ КАК Коэффициент,
	|	ДанныеУчетаБУ.СуммаБУ * ВТ_Коэфициент_ОУ_БУ.Коэффициент_ОУ_БУ КАК СуммаБУ_Коэфициент
	|ПОМЕСТИТЬ ВТ_ДанныеБУСКоэффициентом
	|ИЗ
	|	ДанныеУчетаБУ КАК ДанныеУчетаБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Коэфициент_ОУ_БУ КАК ВТ_Коэфициент_ОУ_БУ
	|		ПО ДанныеУчетаБУ.Организация = ВТ_Коэфициент_ОУ_БУ.Организация
	|			И ДанныеУчетаБУ.Подразделение = ВТ_Коэфициент_ОУ_БУ.Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУчетаБУ.Счет,
	|	ДанныеУчетаБУ.Организация,
	|	ДанныеУчетаБУ.Подразделение,
	|	ДанныеУчетаБУ.СтатьяЗатрат,
	|	ВТ_Коэфициент_ОУ_БУ.Коэффициент_ОУ_БУ,
	|	ДанныеУчетаБУ.СуммаБУ * ВТ_Коэфициент_ОУ_БУ.Коэффициент_ОУ_БУ";
	
	Запрос.Выполнить();
	
	//таблицы больше не понадобятся. Уничтожаем
	УничтожитьТаблицуПакета(Запрос, "ДанныеУчетаОУ");   
	УничтожитьТаблицуПакета(Запрос, "ВТ_общийИтогБУ");   
	УничтожитьТаблицуПакета(Запрос, "ВТ_ОбщийИтогОУ");   
	УничтожитьТаблицуПакета(Запрос, "ВТ_Коэфициент_ОУ_БУ");   
	
	//Готовим общую таблицу с коэфициепнтами распределения
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ДанныеБУСКоэффициентом.Счет КАК Счет,
	|	ВТ_ДанныеБУСКоэффициентом.Организация КАК Организация,
	|	ВТ_ДанныеБУСКоэффициентом.Подразделение КАК Подразделение,
	|	ВТ_ДанныеБУСКоэффициентом.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ВТ_КоэффициентыОУ.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СУММА(ВТ_ДанныеБУСКоэффициентом.СуммаБУ_Коэфициент) КАК СуммаБУ,
	|	ВТ_КоэффициентыОУ.Коэффициент_ОУ КАК Коэффициент_ОУ,
	|	ВЫРАЗИТЬ(ВТ_ДанныеБУСКоэффициентом.СуммаБУ_Коэфициент * ВТ_КоэффициентыОУ.Коэффициент_ОУ КАК ЧИСЛО(15, 2)) КАК СуммаПроводки
	|ПОМЕСТИТЬ ВТ_ДанныеПроводки
	|ИЗ
	|	ВТ_ДанныеБУСКоэффициентом КАК ВТ_ДанныеБУСКоэффициентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоэффициентыОУ КАК ВТ_КоэффициентыОУ
	|		ПО ВТ_ДанныеБУСКоэффициентом.Организация = ВТ_КоэффициентыОУ.Организация
	|			И ВТ_ДанныеБУСКоэффициентом.Подразделение = ВТ_КоэффициентыОУ.Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеБУСКоэффициентом.Счет,
	|	ВТ_ДанныеБУСКоэффициентом.Организация,
	|	ВТ_ДанныеБУСКоэффициентом.Подразделение,
	|	ВТ_ДанныеБУСКоэффициентом.СтатьяЗатрат,
	|	ВТ_КоэффициентыОУ.НоменклатурнаяГруппа,
	|	ВТ_КоэффициентыОУ.Коэффициент_ОУ,
	|	ВЫРАЗИТЬ(ВТ_ДанныеБУСКоэффициентом.СуммаБУ_Коэфициент * ВТ_КоэффициентыОУ.Коэффициент_ОУ КАК ЧИСЛО(15, 2))";
	
	Запрос.Выполнить();
	
	//таблицы больше не понадобятся. Уничтожаем
	УничтожитьТаблицуПакета(Запрос, "ВТ_КоэффициентыОУ");   
	УничтожитьТаблицуПакета(Запрос, "ВТ_ДанныеБУСКоэффициентом");   
	
	//Готовим контрольную таблицу для провдок без номенлатурных групп
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеУчетаБУ.Счет КАК Счет,
	|	ДанныеУчетаБУ.Организация КАК Организация,
	|	ДанныеУчетаБУ.Подразделение КАК Подразделение,
	|	ДанныеУчетаБУ.СтатьяЗатрат КАК СтатьяЗатрат,
	|	СУММА(ДанныеУчетаБУ.СуммаБУ) КАК СуммаБУ
	|ПОМЕСТИТЬ ДанныеУчетаБУ_свернуто
	|ИЗ
	|	ДанныеУчетаБУ КАК ДанныеУчетаБУ
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУчетаБУ.Счет,
	|	ДанныеУчетаБУ.Организация,
	|	ДанныеУчетаБУ.Подразделение,
	|	ДанныеУчетаБУ.СтатьяЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПроводки.Счет КАК Счет,
	|	ВТ_ДанныеПроводки.Организация КАК Организация,
	|	ВТ_ДанныеПроводки.Подразделение КАК Подразделение,
	|	ВТ_ДанныеПроводки.СтатьяЗатрат КАК СтатьяЗатрат,
	|	СУММА(ВТ_ДанныеПроводки.СуммаПроводки) КАК СуммаПроводки
	|ПОМЕСТИТЬ ВТ_ДанныеПроводки_свернуто
	|ИЗ
	|	ВТ_ДанныеПроводки КАК ВТ_ДанныеПроводки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПроводки.Счет,
	|	ВТ_ДанныеПроводки.Организация,
	|	ВТ_ДанныеПроводки.Подразделение,
	|	ВТ_ДанныеПроводки.СтатьяЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУчетаБУ_свернуто.Счет КАК Счет,
	|	ДанныеУчетаБУ_свернуто.Организация КАК Организация,
	|	ДанныеУчетаБУ_свернуто.Подразделение КАК Подразделение,
	|	ДанныеУчетаБУ_свернуто.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ДанныеУчетаБУ_свернуто.СуммаБУ КАК СуммаБУ,
	|	ЕСТЬNULL(ВТ_ДанныеПроводки_свернуто.СуммаПроводки, 0) КАК СуммаПроводки,
	|	ДанныеУчетаБУ_свернуто.СуммаБУ - ЕСТЬNULL(ВТ_ДанныеПроводки_свернуто.СуммаПроводки, 0) КАК Сумма_Дельта
	|ПОМЕСТИТЬ ВТ_ОтклоненияСумм
	|ИЗ
	|	ДанныеУчетаБУ_свернуто КАК ДанныеУчетаБУ_свернуто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПроводки_свернуто КАК ВТ_ДанныеПроводки_свернуто
	|		ПО ДанныеУчетаБУ_свернуто.Счет = ВТ_ДанныеПроводки_свернуто.Счет
	|			И ДанныеУчетаБУ_свернуто.Организация = ВТ_ДанныеПроводки_свернуто.Организация
	|			И ДанныеУчетаБУ_свернуто.Подразделение = ВТ_ДанныеПроводки_свернуто.Подразделение
	|			И ДанныеУчетаБУ_свернуто.СтатьяЗатрат = ВТ_ДанныеПроводки_свернуто.СтатьяЗатрат";
	
	Запрос.Выполнить();
	
	//таблицы больше не понадобятся. Уничтожаем
	УничтожитьТаблицуПакета(Запрос, "ДанныеУчетаБУ");   
	УничтожитьТаблицуПакета(Запрос, "ДанныеУчетаБУ_свернуто");   
	УничтожитьТаблицуПакета(Запрос, "ВТ_ДанныеПроводки_свернуто");   
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ДанныеПроводки.Счет КАК Счет,
	|	ВТ_ДанныеПроводки.Организация КАК Организация,
	|	ВТ_ДанныеПроводки.Подразделение КАК Подразделение,
	|	ВТ_ДанныеПроводки.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ВТ_ДанныеПроводки.СтатьяЗатрат КАК СтатьяЗатрат,
	|	СУММА(ВТ_ДанныеПроводки.СуммаПроводки) КАК Сумма,
	|	СУММА(ВТ_ДанныеПроводки.СуммаПроводки) КАК СуммаНУ,
	|	СУММА(0) КАК СуммаПР,
	|	СУММА(0) КАК СуммаВР
	|ИЗ
	|	ВТ_ДанныеПроводки КАК ВТ_ДанныеПроводки
	|ГДЕ
	|	ВТ_ДанныеПроводки.СуммаПроводки <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПроводки.Счет,
	|	ВТ_ДанныеПроводки.Организация,
	|	ВТ_ДанныеПроводки.Подразделение,
	|	ВТ_ДанныеПроводки.НоменклатурнаяГруппа,
	|	ВТ_ДанныеПроводки.СтатьяЗатрат
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаНУ)
	|ПО
	|	Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ИндексДокумента = 0;
	Если не РезультатЗапроса.Пустой() Тогда
		СформироватьДокументОперацияБух(РезультатЗапроса, ИндексДокумента, ПараметрыПроцедуры);	
	КонецЕсли;	
	
	//Формируем операцию по отклонениям
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ОтклоненияСумм.Счет КАК Счет,
	|	ВТ_ОтклоненияСумм.Организация КАК Организация,
	|	ВТ_ОтклоненияСумм.Подразделение КАК Подразделение,
	|	&НоменклатурнаяГруппаДельта КАК НоменклатурнаяГруппа,
	|	ВТ_ОтклоненияСумм.СтатьяЗатрат КАК СтатьяЗатрат,
	|	СУММА(ВТ_ОтклоненияСумм.Сумма_Дельта) КАК Сумма,
	|	СУММА(ВТ_ОтклоненияСумм.Сумма_Дельта) КАК СуммаНУ,
	|	СУММА(0) КАК СуммаПР,
	|	СУММА(0) КАК СуммаВР
	|ИЗ
	|	ВТ_ОтклоненияСумм КАК ВТ_ОтклоненияСумм
	|ГДЕ
	|	ВТ_ОтклоненияСумм.Сумма_Дельта <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОтклоненияСумм.Подразделение,
	|	ВТ_ОтклоненияСумм.Счет,
	|	ВТ_ОтклоненияСумм.Организация,
	|	ВТ_ОтклоненияСумм.СтатьяЗатрат
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаНУ)
	|ПО
	|	Организация";
	
	Запрос.УстановитьПараметр("НоменклатурнаяГруппаДельта", ПараметрыПроцедуры.НоменклатурнаяГруппаДельта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		СформироватьДокументОперацияБух(РезультатЗапроса, ИндексДокумента, ПараметрыПроцедуры);	
	КонецЕсли;
	
	//Контрольный запрос по суммам БУ, НУ, ПР, ВР на случай если что-то осталось
	//Данный блок закрываетостатки НУ, ПР и ВР в случае если там что-то осталось после выполнения основного распределения
	//остатки могут возникнуть по начислению отпусков за счет резерва, для исключения такой ситуации
	//можно настроить в ЗУП отражение резервово отпусков сразу на 20 счет
	//Получаем разницу оборотов по ДТ и КТ, так как субонкто "Статья затрат" оборотный
	мСтатьиЗатарат = Обработки.CW_ФормированиеДокументовУчетаГСМвБУ.ПолучитьМассивСтатейЗатаратПоОплатеТруда();
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.Субконто1 КАК СтатьяЗатрат,
	|	&НоменклатурнаяГруппаДельта КАК НоменклатурнаяГруппа,
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.Валюта КАК Валюта,
	|	ХозрасчетныйОбороты.Подразделение КАК Подразделение,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт) КАК Сумма,
	|	СУММА(ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт) КАК СуммаНУ,
	|	СУММА(ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт) КАК СуммаПР,
	|	СУММА(ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт) КАК СуммаВР
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Период,
	|			Счет = &СчетУчетаЗаработнойПлаты,
	|			,
	|			Субконто1 В (&мСтатьиЗатарат)
	|			//УСЛОВИЕ_Организация		
	|			,
	|			,
	|			) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	(ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт <> 0
	|			ИЛИ ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Валюта,
	|	ХозрасчетныйОбороты.Субконто1
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаНУ),
	|	СУММА(СуммаПР),
	|	СУММА(СуммаВР)
	|ПО
	|	ОБЩИЕ,
	|	Организация";  
	
	Если ЗначениеЗаполнено(ПараметрыПроцедуры.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_Организация", "И Организация = &Организация");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", 				ПараметрыПроцедуры.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 				Новый Граница(ПараметрыПроцедуры.ДатаОкончания, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетУчетаЗаработнойПлаты", 	ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	Запрос.УстановитьПараметр("Организация", 				ПараметрыПроцедуры.Организация);
	Запрос.УстановитьПараметр("НоменклатурнаяГруппаДельта", ПараметрыПроцедуры.НоменклатурнаяГруппаДельта);  
	Запрос.УстановитьПараметр("мСтатьиЗатарат", 			мСтатьиЗатарат);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка_ОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если Выборка_ОбщийИтог.Следующий() Тогда
			СформироватьДокументОперацияБух(Выборка_ОбщийИтог, ИндексДокумента, ПараметрыПроцедуры);	
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПроверитьНаличиеДокументовПриЗакрытии", ПараметрыПроцедуры.ПроверитьНаличиеДокументов);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
	
КонецПроцедуры

Процедура СформироватьДокументОперацияБух(РезультатЗапроса, ИндексДокумента, ПараметрыПроцедуры)
	
	СчетДт = ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	
	Выборка_Организации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка_Организации.Следующий() Цикл
		
		Выборка_Проводки = Выборка_Организации.Выбрать();
		
		Если Выборка_Проводки.Количество() = 0 тогда
			Продолжить;
		КонецЕсли;
		
		МассивОперацийБух = ПараметрыПроцедуры.МассивОперацийБух;
		
		СоздатьДокумент = истина;
		Если МассивОперацийБух.Количество() > 0 и ИндексДокумента < МассивОперацийБух.Количество() Тогда
			
			СсылкаНаДокумент = МассивОперацийБух[ИндексДокумента];
			
			//Готовим документ
			ОперацияБух = СсылкаНаДокумент.ПолучитьОбъект();
			ОперацияБух.УстановитьПометкуУдаления(Ложь);
			
			Набор = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(СсылкаНаДокумент, Истина);
			Набор.Очистить();
			
			ИндексДокумента = ИндексДокумента + 1;
			СоздатьДокумент = Ложь;
		КонецЕсли;
		
		Если СоздатьДокумент Тогда	
			ОперацияБух = Документы.ОперацияБух.СоздатьДокумент();
		КонецЕсли;	
		
		ОперацияБух.Дата 			= ПараметрыПроцедуры.ДатаОперации;
		ОперацияБух.Организация 	= Выборка_Организации.Организация;
		ОперацияБух.СуммаОперации 	= Выборка_Организации.Сумма;
		ОперацияБух.Содержание 		= "Распределение зарплаты водителей по путевым листам";
		ОперацияБух.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
		ОперацияБух.Комментарий 	=  "(Сформирована обработокй ""Формирование документов учета ГСМ в БУ"")";
		ОперацияБух.Записать();
		
		ЗаписатьДополнителнительноеСвойствоДокумента(ОперацияБух.Ссылка, ПараметрыПроцедуры.ДополнительноеСвойство);
		
		Набор = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(ОперацияБух.Ссылка, Истина);
		
		Пока Выборка_Проводки.Следующий() Цикл
			
			Движение					= Набор.Добавить();
			Движение.Период		 		= ПараметрыПроцедуры.ДатаОперации;
			Движение.Активность 		= Истина;
			Движение.Организация 		= Выборка_Проводки.Организация;
			
			//Дебет проводки
			Движение.СчетДт 			= СчетДт;
			Движение.ПодразделениеДт 	= Выборка_Проводки.Подразделение;
			
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "СтатьиЗатрат"			, Выборка_Проводки.СтатьяЗатрат);
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "НоменклатурныеГруппы"	, Выборка_Проводки.НоменклатурнаяГруппа);
			
			
			//Кредит проводки
			Движение.СчетКт 			= Выборка_Проводки.Счет;
			Движение.ПодразделениеКт	= Выборка_Проводки.Подразделение;
			
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "СтатьиЗатрат"			, Выборка_Проводки.СтатьяЗатрат);
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "НоменклатурныеГруппы"	, Выборка_Проводки.НоменклатурнаяГруппа);
			
			Движение.Сумма 				= Выборка_Проводки.Сумма;
			
			Движение.СуммаНУДт 			= Выборка_Проводки.СуммаНУ;
			Движение.СуммаНУКт 			= Выборка_Проводки.СуммаНУ;
			
			Движение.СуммаПРДт 			= Выборка_Проводки.СуммаПР;
			Движение.СуммаПРКт 			= Выборка_Проводки.СуммаПР;
			
			Движение.СуммаВРДт 			= Выборка_Проводки.СуммаВР;
			Движение.СуммаВРКт 			= Выборка_Проводки.СуммаВР;
			
		КонецЦикла;
		
		Набор.Записать(Истина);
		
		ПараметрыПроцедуры.ПроверитьНаличиеДокументов = Истина;   
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРезультатЗапросаОперации(ПараметрыПроцедуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОперацияБух.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОперацияБух КАК ОперацияБух
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО ОперацияБух.Ссылка = ДополнительныеСведения.Объект
	|ГДЕ
	|	ДополнительныеСведения.Свойство = &Свойство
	|	И ДополнительныеСведения.Значение = ИСТИНА
	|	И ОперацияБух.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ОперацияБух.ПометкаУдаления 
	|	//УСЛОВИЕ_Организация
	|";
	
	Если ЗначениеЗаполнено(ПараметрыПроцедуры.Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_Организация", "И ОперацияБух.Организация = &Организация");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", 	ПараметрыПроцедуры.Организация);
	Запрос.УстановитьПараметр("Свойство",		ПараметрыПроцедуры.ДополнительноеСвойство);
	Запрос.УстановитьПараметр("ДатаНачала",		ПараметрыПроцедуры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ПараметрыПроцедуры.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПометитьНаУдалениеДокументыОперацииБух(ПараметрыПроцедуры)
	
	МассивПомеченныхНаУдаление = Новый Массив;
	
	РезультатЗапроса = ПолучитьРезультатЗапросаОперации(ПараметрыПроцедуры);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		ДокументОбъект.УстановитьПометкуУдаления(истина); 
		
		МассивПомеченныхНаУдаление.Добавить(Выборка.Ссылка);
	КонецЦикла;  
	
	Возврат МассивПомеченныхНаУдаление;
	
КонецФункции
//---ФОРМИРОВАНИЕ ОПЕРАЦИЙ

//ДОПОЛНИТЕЛЬНО
Функция ПолучитьМассивСтатейЗатаратПоОплатеТруда() Экспорт 
	
	мВидыРасходовНУ = Новый Массив;
	мВидыРасходовНУ.Добавить(Перечисления.ВидыРасходовНУ.ОплатаТруда);
	мВидыРасходовНУ.Добавить(Перечисления.ВидыРасходовНУ.СтраховыеВзносы);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтатьиЗатрат.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
	|ГДЕ
	|	СтатьиЗатрат.ВидРасходовНУ В(&мВидыРасходовНУ)
	|	И СтатьиЗатрат.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("мВидыРасходовНУ", мВидыРасходовНУ);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"); 
	
КонецФункции

Функция ПолучитьРаздельныйРежимУчетаНДС(Организация,ДатаСреза)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РаздельныйУчетНДСНаСчете19 = CW_БухгалтерияЭкспедитораСерверПереопределяемый.РаздельныйУчетНДСНаСчете19(Организация, ДатаСреза);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РаздельныйУчетНДСНаСчете19;
	
КонецФункции

Функция СпособУчетаНДСНоменклатуры(СпособУчета)
	Если ЗначениеЗаполнено(СпособУчета) Тогда
		Возврат СпособУчета;
	Иначе
		Возврат Перечисления.СпособыУчетаНДС.УчитываетсяВCтоимости;	
	КонецЕсли;
КонецФункции

Процедура ЗаписатьДополнителнительноеСвойствоДокумента(СсылкаНаДокумент, Свойство)
	
	Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	Запись.Объект 	= СсылкаНаДокумент;
	Запись.Свойство = Свойство;
	Запись.Прочитать();
	
	Запись.Объект 	= СсылкаНаДокумент;
	Запись.Свойство = Свойство;
	Запись.Значение = истина;
	Запись.Записать(истина);
	
КонецПроцедуры

Процедура УничтожитьТаблицуПакета(Запрос, ИмяТаблицы)
	
	Запрос.Текст = "УНИЧТОЖИТЬ "+ИмяТаблицы;
	Запрос.Выполнить();

КонецПроцедуры
//---ДОПОЛНИТЕЛЬНО

