#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об отчете
Функция Информация() Экспорт 
	
	СтруктураОписания 					= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 				= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 				= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешняяОбработка();

	СтруктураОписания.Наименование 				= "Пример выполнения метода формы объекта на клиенте";
	СтруктураОписания.Описание 					= "Пример выполнения метода формы объекта на клиенте безе открытия формы";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	СтруктураОписания.Настройка 				= Истина;
	СтруктураОписания.РасполагатьНаРабочемСтоле	= Истина;
	
	//Методы
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "ВыполнитьКлиентскийМетод");
	
	// Формы
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыОбъекта(СтруктураОписания, "ФормаОбъекта");
	
	//Команды отчета
	CW_ПодключаемыеКомандыСервер.УстановитьКомандыВнешнегоОбъекта(СтруктураОписания, 
				"ТествоаяОбработка", 
				"Тестовая обработка - Открыть форму списка регистра сведений ""CW_УчетнаяПолитика""",
				,
				);
	
	Возврат СтруктураОписания;
	
КонецФункции
#КонецЕсли