
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Если Не Параметры.Свойство("РедактируемыеРеквизиты") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;       
	
	Для Каждого ДанныеРеквизита из Параметры.РедактируемыеРеквизиты Цикл
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита		= ДанныеРеквизита.Имя;
		НоваяСтрока.ЗаголовокРеквизита	= ДанныеРеквизита.Заголовок;
		НоваяСтрока.ЗначениеРеквизита	= ДанныеРеквизита.Значение;  
	КонецЦикла;       
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)  
	
	Структура = Новый Структура;
	Для Каждого СтрокаТаблицы из ТаблицаРеквизитов Цикл    
		Если СтрокаТаблицы.Выбор = Истина Тогда 
			Структура.Вставить(СтрокаТаблицы.ИмяРеквизита, СтрокаТаблицы.ЗначениеРеквизита);	
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Закрыть(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	ТекущиеДанные.Выбор = ЗначениеЗаполнено(ТекущиеДанные.ЗначениеРеквизита);  
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	
КонецПроцедуры   


