
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Запись.Значение) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"Не задано значение параметра.");
	КонецЕсли; 	
	
	Если не Запись.ДляГрузоперевозок и Не Запись.ДляЗаявок  и Не Запись.ДляЗаказов Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"Необходимо выбрать хотябы одно значение из <Для грузоперевозок> или <Для заявок> или <Для заказов>");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрПриИзменении(Элемент)
	
	ПараметрПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПараметрПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(Запись.Параметр) Тогда
		ОграниченСпискомЗначений 	= Запись.Параметр.ОграниченСпискомЗначений;
	КонецЕсли; // параметр выбран
	
	Элементы.Значение.РедактированиеТекста 	=  Не ОграниченСпискомЗначений;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.Параметр) Тогда
		Если ОграниченСпискомЗначений Тогда
			СтандартнаяОбработка = Ложь;
			ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораЗначенияИзДоступных",ЭтотОбъект); 
			ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.Форма.ФормаВыбораДоступныхЗначенийПараметра", Новый Структура("Параметр",Запись.Параметр),Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЗначенияИзДоступных(Ответ, ДополнительныеПараметры) Экспорт 

	Если Ответ = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Запись.Значение 	= Ответ;
	Модифицированность 	= Истина;	
	
КонецПроцедуры


 
