
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДатаДокумента = ПолучитьДатуДокумента(ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", 	ПараметрКоманды);
	ПараметрыФормы.Вставить("Дата", 		ДатаДокумента);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВводНаОсовании", ЭтотОбъект);
	
	ОткрытьФорму("Документ.CW_ОтчетЭкспедитора.Форма.ФормаВводаНаОноавнии", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуДокумента(ПараметрКоманды)
	
	ДатаДокумента = ПараметрКоманды.Дата + 1;
	Если НачалоДня(ДатаДокумента) <> НачалоДня(ПараметрКоманды.Дата) Тогда
		ДатаДокумента = ПараметрКоманды.Дата;
	КонецЕсли;

	Возврат ДатаДокумента;
	
КонецФункции

&НаКлиенте
Процедура ПродолжитьВводНаОсовании(РезультатВыбора, Параметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Отмена 
		ИЛИ РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляЗаполнения = ПолучитьИзВременногоХранилища(РезультатВыбора);
	
	ДанныеДляЗаполнения.Вставить("ВводНаОсновании");
	ДанныеДляЗаполнения.Вставить("ЗаполнитьТабличнуюЧасть");
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("ЗначенияЗаполнения", ДанныеДляЗаполнения);
	
	ОткрытьФорму("Документ.CW_ОтчетЭкспедитора.ФормаОбъекта", ПараметрыОбъекта);
	
КонецПроцедуры
