
Функция УведомлениеПрочитано(Уведомление) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПрочитанныеУведомления.Уведомление КАК Уведомление
	               |ИЗ
	               |	РегистрСведений.CW_ПрочитанныеУведомления КАК CW_ПрочитанныеУведомления
	               |ГДЕ
	               |	CW_ПрочитанныеУведомления.Уведомление = &Уведомление
	               |	И CW_ПрочитанныеУведомления.Пользователь = &Пользователь";   
	
	Запрос.УстановитьПараметр("Уведомление", Уведомление);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции      

Функция ПрочитатьУведомление(Уведомление) Экспорт
	
	Запись = РегистрыСведений.CW_ПрочитанныеУведомления.СоздатьМенеджерЗаписи();
	Запись.Уведомление 	= Уведомление;
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запись.Записать(истина);
	
КонецФункции    

Функция ОтменитьПрочтениеУведомления(Уведомление) Экспорт
	
	Запись = РегистрыСведений.CW_ПрочитанныеУведомления.СоздатьМенеджерЗаписи();
	Запись.Уведомление 	= Уведомление;
	Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецФункции