
&НаСервере
&ИзменениеИКонтроль("ПроверитьКолонки")
Процедура саб_ПроверитьКолонки(УФ)
	// --- 

	Если (ЭтоФормаЖурналаГрузоперевозок(УФ) ИЛИ ЭтоФормаЗаказа(УФ) ИЛИ ЭтоФормаЗаявки(УФ)) Тогда
		КоллекцияРеквизитов = Метаданные.Справочники.CW_Грузоперевозки.Реквизиты;
		ТипСсылки = Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки");
	ИначеЕсли (ЭтоФормаЖурналаЗаявок(УФ)) Тогда 
		КоллекцияРеквизитов = Метаданные.Справочники.CW_Заявки.Реквизиты;
		ТипСсылки = Новый ОписаниеТипов("СправочникСсылка.CW_Заявки");
	ИначеЕсли (ЭтоФормаЖурналаЗаказов(УФ)) Тогда 
		КоллекцияРеквизитов = Метаданные.Справочники.CW_Заказы.Реквизиты;
		ТипСсылки = Новый ОписаниеТипов("СправочникСсылка.CW_Заказы");
	КонецЕсли; 
	// --- 
	РеквизитыДляПрямогоРедактирования = МассивРеквизитовГрупповогоРедактирования(УФ);
	МассивУдаления = Новый Массив;
	// ---------------------------------------------------------------------------- 

	НаборПрав = CW_ПраваДоступа.НаборПравДляПараметров();
	СоответствиеПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров(); 

	// проверим настройки колонок и права доступа
	// ---------------------------------------------------------------------------- 
	Для каждого строкаОписанияКолонки Из УФ.Журнал_ОписаниеКолонок Цикл

		// типизация ссылки
		Если (строкаОписанияКолонки.СтрокаПоляКомпоновки = "Ссылка") Тогда
			строкаОписанияКолонки.ТипЗначения = ТипСсылки;
		КонецЕсли;

		// невидимые колонки не обрабатываем во имя луны
		Если (НЕ строкаОписанияКолонки.Видимость) Тогда
			Продолжить;
		КонецЕсли; 

		// если не указана сортировка
		Если строкаОписанияКолонки.Сортировка.Пустая() Тогда
			строкаОписанияКолонки.Сортировка = Перечисления.CW_ПорядокСортировки.Нет;
		КонецЕсли; 

		// если не указана фиксация
		Если строкаОписанияКолонки.Фиксация.Пустая() Тогда
			строкаОписанияКолонки.Фиксация = Перечисления.CW_ВариантыФиксацииКолонок.Нет;
		КонецЕсли; 

		// ---------------------------------------------------------------------------- 

		// если колонка - параметр г/п - обновим тип и режим редактирования
		// проверим, не является ли ссылка на параметр битой =)
		Если (строкаОписанияКолонки.ПараметрГрузоперевозки ИЛИ строкаОписанияКолонки.КонтрольнаяДатаГрузоперевозки) Тогда

			// проверка на битую ссылку
			Если Найти(Строка(строкаОписанияКолонки.ОбъектХарактеристики),"не найден") <> 0 Тогда

				// параметр был удалён, колонку необходимо удалить из настроек
				МассивУдаления.Добавить(строкаОписанияКолонки);
				Сообщить("Колонка """+строкаОписанияКолонки.Имя+""" удалена.");
				Продолжить;

			КонецЕсли; 

			Если строкаОписанияКолонки.ОбъектХарактеристики.Пустая() Тогда

				// ахутнг - удаляем
				МассивУдаления.Добавить(строкаОписанияКолонки);
				Продолжить;

			КонецЕсли; 

			// ---------------------------------------------------------------------------- 

			СвойстваПараметра = СоответствиеПараметров.Получить(строкаОписанияКолонки.ОбъектХарактеристики);

			// проверяем права доступа и режим редактирования
			ПраваПараметра = НаборПрав["п_"+_сф.КлючПоСсылке(строкаОписанияКолонки.ОбъектХарактеристики)];
			Если НЕ ПраваПараметра.Просмотр Тогда

				МассивУдаления.Добавить(строкаОписанияКолонки);
				Продолжить;

			Иначе

				// проверяем редактирование
				Если (НЕ ПраваПараметра.Редактирование) Тогда

					строкаОписанияКолонки.РежимПрямогоРедактирования = Ложь;

				Иначе

					ПрямоеРедактирование = СвойстваПараметра.ПрямоеРедактирование;
					МножественноеПрямоеРедактирование = СвойстваПараметра.МножественноеПрямоеРедактирование;
					Если ЭтоФормаЖурналаГрузоперевозок(УФ) 
						И СтрНайти(строкаОписанияКолонки.СтрокаПоляКомпоновки, "Заказ.") > 0 Тогда
						ПрямоеРедактирование = ложь; 
						#Удаление
						МножественноеПрямоеРедактирование = Ложь;
						#КонецУдаления
					КонецЕсли;

					// обновляем режим прямого редактирования по данным параметра
					строкаОписанияКолонки.РежимПрямогоРедактирования = ПрямоеРедактирование;
					//	строкаОписанияКолонки.РежимМножественногоРедактирования = (СвойстваПараметра.ПрямоеРедактирование И НЕ СвойстваПараметра.ИспользованиеОтбора);
					#Удаление
					строкаОписанияКолонки.РежимМножественногоРедактирования = МножественноеПрямоеРедактирование;
					#КонецУдаления
					#Вставка
					строкаОписанияКолонки.РежимМножественногоРедактирования = ПрямоеРедактирование;
					#КонецВставки
					строкаОписанияКолонки.ИспользованиеОтбора = СвойстваПараметра.ИспользованиеОтбора;

				КонецЕсли; 

			КонецЕсли; 

			// обновляем тип 
			строкаОписанияКолонки.ТипЗначения = СвойстваПараметра.ТипЗначения;

			// обновляем тип параметра
			Если (СвойстваПараметра.ЭтоКонтрольнаяДата) Тогда
				строкаОписанияКолонки.ПараметрГрузоперевозки = Ложь;
				строкаОписанияКолонки.КонтрольнаяДатаГрузоперевозки = Истина;
			Иначе
				строкаОписанияКолонки.ПараметрГрузоперевозки = Истина;
				строкаОписанияКолонки.КонтрольнаяДатаГрузоперевозки = Ложь;
			КонецЕсли; 

			// проверяем, что идентификтор параметра не изменился

			//Для параметров всегда есть квадрантые скобки    
			мСтрокаПоляКомпоновки   = СтрРазделить(строкаОписанияКолонки.СтрокаПоляКомпоновки, ".");   
			стрОбъектПараметра  	= мСтрокаПоляКомпоновки[0];

			Если строкаОписанияКолонки.КонтрольнаяДатаПлан Тогда
				КонтрольныйИдентификатор 	= СвойстваПараметра.ИдентификаторПлан;
				ДополнениеЗаголовка 		= " (план)";
			ИначеЕсли строкаОписанияКолонки.КонтрольнаяДатаФакт Тогда 
				КонтрольныйИдентификатор = СвойстваПараметра.ИдентификаторФакт;
				ДополнениеЗаголовка 		= " (факт)";
			Иначе
				КонтрольныйИдентификатор = СвойстваПараметра.Идентификатор; 
				ДополнениеЗаголовка = "";
			КонецЕсли; 

			Если СтрНайти(строкаОписанияКолонки.СтрокаПоляКомпоновки,"["+КонтрольныйИдентификатор+"]") = 0 Тогда
				//Изменился идентифкатор параметра
				строкаОписанияКолонки.Заголовок 			= СвойстваПараметра.Наименование + ДополнениеЗаголовка;
				строкаОписанияКолонки.СтрокаПоляКомпоновки 	= стрОбъектПараметра+".["+КонтрольныйИдентификатор+"]";

				Если ЭтоФормаЖурналаЗаявок(УФ) Тогда
					строкаОписанияКолонки.Наименование = "Заявка."+КонтрольныйИдентификатор;
				Иначеесли ЭтоФормаЖурналаЗаказов(УФ) Тогда
					строкаОписанияКолонки.Наименование = "Заказ."+КонтрольныйИдентификатор;
				Иначе
					Если СтрНайти(строкаОписанияКолонки.СтрокаПоляКомпоновки, "Заказ") Тогда
						строкаОписанияКолонки.Наименование = "Заказ."+КонтрольныйИдентификатор;
					Иначе
						строкаОписанияКолонки.Наименование = "Грузоперевозка."+КонтрольныйИдентификатор;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;

		Иначе

			// проверяем режим екселя
			Если РеквизитыДляПрямогоРедактирования.Найти(строкаОписанияКолонки.СтрокаПоляКомпоновки) <> Неопределено Тогда
				строкаОписанияКолонки.РежимПрямогоРедактирования = Истина;
				строкаОписанияКолонки.РежимМножественногоРедактирования = Истина;
			Иначе
				строкаОписанияКолонки.РежимПрямогоРедактирования = Ложь;
				#Вставка
				строкаОписанияКолонки.РежимМножественногоРедактирования = Ложь;
				#КонецВставки
			КонецЕсли;

		КонецЕсли; 

	КонецЦикла; 
	// ---------------------------------------------------------------------------- 
	Если (МассивУдаления.Количество() <> 0) Тогда
		УФ.Журнал_КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
		_сф.к_УдалитьЭлементыПоМассиву(УФ.Журнал_ОписаниеКолонок,МассивУдаления);
	КонецЕсли; 

	// --- 
КонецПроцедуры
