&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьКоманды = Ложь;
	Если ЭтоАдресВременногоХранилища(Параметры.АдресНастроек) Тогда
		Настройки =  ПолучитьИзВременногоХранилища(Параметры.АдресНастроек);
		Если Настройки <> Неопределено Тогда
			
			Индекс 		= Настройки.Индекс;
			ЭтоОтчет 	= Настройки.ЭтоОтчет;
		
			Для Каждого ЭлементСписка из Настройки.СписокКомандОбъекта Цикл
				СписокКомандОбъекта.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);	
			КонецЦикла;
			
			
			КомандаОтчета =  Настройки.КомандаОтчета;
			
			ЗаполнитьЗначенияСвойств(ЭтаФорма, КомандаОтчета);
			
			_ОбработатьВыборКартинки(ИмяКартинки) ;
					
			РасположениеОбъекта.ЗагрузитьЗначения(Настройки.РасположениеОбъекта);
			ДоступностьОбъекта.ЗагрузитьЗначения(Настройки.ДоступностьОбъекта);
			
			КомандыОбъекта.Загрузить(Настройки.КомандыОбъекта);
			
			ЕстьКоманды = КомандыОбъекта.Количество() > 0;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьТекстДоступныхГруппПользователй();
	УстановитьТекстРасположенияОбъекта();
	
	//Видимость элементов
	Элементы.ВыборКартинки.Видимость 				= ЕстьКоманды;
	Элементы.ПредставлениеКоманды.Видимость	 		= ЕстьКоманды;
	Элементы.ГруппаРасположение.Видимость 			= ЕстьКоманды;
	Элементы.Доступность.Видимость	 				= ЕстьКоманды;
	
	Элементы.Надпись_КомандыНеНастроены.Видимость 	= Не ЕстьКоманды;
	
	Элементы.ВыборКоманды.Видимость = КомандыОбъекта.Количество() > 1;
	
КонецПроцедуры  



&НаСервере
Процедура УстановитьТекстДоступныхГруппПользователй()
	
	
	Если ДоступностьОбъекта.Количество() = 0 Тогда
		Элементы.ДекорацияСтрокаГруппПользователей.Заголовок = "<Настроить>";
	Иначе
		Элементы.ДекорацияСтрокаГруппПользователей.Заголовок = СтрСоединить(ДоступностьОбъекта.ВыгрузитьЗначения(),", ");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстРасположенияОбъекта()
	
	Если РасположениеОбъекта.Количество() = 0 Тогда
		Элементы.ДекорацияСтрокаРасположение.Заголовок = "<Настроить>";
	Иначе
		МассивРасположенийНаРабочемСтоле 				= ПолучитьОписаниеРасположенияНаРабочемСтоле(РасположениеОбъекта.ВыгрузитьЗначения());
		Элементы.ДекорацияСтрокаРасположение.Заголовок 	= СтрСоединить(МассивРасположенийНаРабочемСтоле, Символы.ПС);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеРасположенияНаРабочемСтоле(РасположенияОбъекта)
	
	Исклчаемыеродители = ПолучитьИскючения();
	
	Массив = Новый Массив;
	
	Для Каждого Расположение из РасположенияОбъекта Цикл
		
		СтрокаРасположения = "";
		ПолучитьСтрокуРасположения(Расположение,Исклчаемыеродители,СтрокаРасположения);
		Массив.Добавить(СтрокаРасположения);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Функция ПолучитьИскючения()
	
	Массив = Новый Массив;
	
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаАвтотранспортКолонка1);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаАвтотранспортКолонка2);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаАвтотранспортКолонка3);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаАвтотранспортКолонка4);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаАвтотранспортКолонка5);
	
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаДокументыКолонка1);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаДокументыКолонка2);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаДокументыКолонка3);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаДокументыКолонка4);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаДокументыКолонка5);
	
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаМониторингКолонка1);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаМониторингКолонка2);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаМониторингКолонка3);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаМониторингКолонка4);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаМониторингКолонка5);
	
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаОтчетыКолонка1);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаОтчетыКолонка2);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаОтчетыКолонка3);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаОтчетыКолонка4);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаОтчетыКолонка5);
	
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаФинансыКолонка1);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаФинансыКолонка2);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаФинансыКолонка3);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаФинансыКолонка4);
	Массив.Добавить(Справочники.CW_РазделыРабочегоСтола.ГруппаФинансыКолонка5);
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура ПолучитьСтрокуРасположения(Расположение, ИсклчаемыеРодители, СтрокаРасположения)
	
		
	СтрокаРасположения = """"+ СокрЛП(Расположение) +"""" + ?(ЗначениеЗаполнено(СтрокаРасположения)," - " + СтрокаРасположения,"");
	
	Родитель = Расположение.Родитель;
	Если ИсклчаемыеРодители.Найти(Родитель) <> Неопределено Тогда
		//Берем уровень выше
		Родитель = Родитель.Родитель;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		ПолучитьСтрокуРасположения(Родитель, ИсклчаемыеРодители, СтрокаРасположения);
	КонецЕсли;
	
КонецПроцедуры


#Область Выбор_расположения_на_рабочем_столе

&НаКлиенте
Процедура ДекорацияСтрокаРасположениеНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("АдресСписка",ПолучитьАдресСпискаРасположений());
	ОписаниеОповещения = новый ОписаниеОповещения("ПриЗакрытиФормыВыбораРасположения", ЭтаФорма);
	
	ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.Форма.ФормаВыбораРасположения",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытиФормыВыбораРасположения(Результат, ДопПараметр) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьРезультаВыбораРасположения(Результат);
		Модифицированность 		= истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСпискаРасположений()
	
	Возврат ПоместитьВоВременноеХранилище(РасположениеОбъекта.ВыгрузитьЗначения());
	
КонецФункции

&НаСервере
Процедура ОбработатьРезультаВыбораРасположения(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		мВыбранныеЗначения = ПолучитьИзВременногоХранилища(Результат);	
		
		РасположениеОбъекта.ЗагрузитьЗначения(мВыбранныеЗначения);
		
	КонецЕсли;
	
	УстановитьТекстРасположенияОбъекта();
	
КонецПроцедуры

#КонецОбласти


#Область Выбор_грппы_пользователй

&НаКлиенте
Процедура ДекорацияСтрокаГруппПользователейНажатие(Элемент)
	
	ПараметрыФормы 		= Новый Структура("АдресСписка", ПолучитьАдресСпискаПользователей());
	ОписаниеОповещения = новый ОписаниеОповещения("ПриЗакрытиФормыВыбораГруппыПользователей", ЭтаФорма);
	
	ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.Форма.ФормаСпискаГрупПользователей",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСпискаПользователей()
	
	Возврат ПоместитьВоВременноеХранилище(ДоступностьОбъекта.ВыгрузитьЗначения());
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытиФормыВыбораГруппыПользователей(Результат, ДопПараметр) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьРезультаВыбораГруппыПользователей(Результат);
		Модифицированность = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультаВыбораГруппыПользователей(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		мВыбранныеЗначения = ПолучитьИзВременногоХранилища(Результат);	
		ДоступностьОбъекта.ЗагрузитьЗначения(мВыбранныеЗначения);
		
	КонецЕсли;
	
	УстановитьТекстДоступныхГруппПользователй();
	
КонецПроцедуры

#КонецОбласти


#Область Выбор_команды_внешнего_отчета
&НаКлиенте
Процедура ПредставлениеКомандыПриИзменении(Элемент)
	Модифицированность = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыборКоманды(Команда)
	
	ПараметрыФормы = Новый Структура("АдресСписка",ПолучитьАдресСпискаКоманд());
	
	ОписаниеОповещения = новый ОписаниеОповещения("ПриЗакрытиФормыВыбораКоманды", ЭтаФорма);
	
	ОткрытьФорму("Справочник.CW_ПодключаемыеОбъекты.Форма.ФормаВыбораКоманды",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытиФормыВыбораКоманды(Результат, ДопПараметр) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьРезультаВыбораКомнады(Результат);
		Модифицированность = истина;
		ИзмененоКоманда 	= истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьрезультаВыбораКомнады(Результат)
	
	Если ЭтоАдресВременногоХранилища(Результат) Тогда
		
		СтрокаСписка = ПолучитьИзВременногоХранилища(Результат);
		
		ИмяКоманды 				= СтрокаСписка.Значение;
		ПредставлениеКоманды 	= СтрокаСписка.Представление;
		
		Отбор = новый Структура("ИмяКоманды", ИмяКоманды);
		мКоманда = КомандыОбъекта.НайтиСтроки(Отбор);
		Если мКоманда.Количество() > 0 Тогда
			СтрокаКоманды = мКоманда[0];
			_ОбработатьВыборКартинки(СтрокаКоманды.ИмяКартинки);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&наСервере
Функция ПолучитьАдресСпискаКоманд()
	
	Возврат ПоместитьВоВременноеХранилище(СписокКомандОбъекта);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеВыбора(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		ИмяКоманды = ВыбранноеЗначение.Значение;
		ПредставлениеКоманды = ВыбранноеЗначение.Представление;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Выбор_пиктограммы_команды

&НаКлиенте
Процедура ОбработкаВыбораПиктограммы(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		_ОбработатьВыборКартинки(Ответ.Значение);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьСписокКартинок()
	
	СписокКартинок.Очистить();
	CW_ОбщегоНазначения.ЗаполнитьСписокКартинок(СписокКартинок); 
	
КонецПроцедуры

&НаСервере
Функция _ОбработатьВыборКартинки(тИмяКартинки)
	
	ИмяКартинки 					= тИмяКартинки; 
	
	Если ЗначениеЗаполнено(ИмяКартинки) Тогда
		Элементы.ВыборКартинки.Картинка = БиблиотекаКартинок[тИмяКартинки]; 
	Иначе
		Если ЭтоОтчет Тогда
			Элементы.ВыборКартинки.Картинка = БиблиотекаКартинок.Отчет;
		Иначе
			Элементы.ВыборКартинки.Картинка = БиблиотекаКартинок.Обработка;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыборКартинки(Команда)
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("коллекция"	,"Из коллекции"	,,БиблиотекаКартинок.ПанельНастроек);//БиблиотекаКартинок.ПанельПользователя);
	СписокВыбора.Добавить("очистить"	,"Очистить"		,,БиблиотекаКартинок.Очистить);
	// --- 
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораВариантаПиктограммы",ЭтотОбъект); 
	ПоказатьВыборИзСписка(ОписаниеОповещения,СписокВыбора, Элементы.ВыборКартинки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВариантаПиктограммы(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		Если Ответ.Значение = "коллекция" Тогда
			
			// выбираем из списка
			Если СписокКартинок.Количество() = 0 Тогда
				
				_ЗаполнитьСписокКартинок();
				
			КонецЕсли; 
			ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораПиктограммы",ЭтотОбъект); 
			СписокКартинок.ПоказатьВыборЭлемента(ПОВ,"Выберите пиктограмму");
			
		ИначеЕсли Ответ.Значение = "очистить" Тогда 
			
			ИмяКартинки = "";
			_ОбработатьВыборКартинки(ИмяКартинки);
			
		КонецЕсли; 
		
		Модифицированность = истина;
		ИзмененоКартинка 	= истина;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЭтаФорма.Закрыть(ПолучитьНастрйокиНаСервере());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастрйокиНаСервере()
	
	КомандаОтчета = Новый Структура;
	КомандаОтчета.Вставить("ИмяКартинки"			, ИмяКартинки);
	КомандаОтчета.Вставить("ИмяКоманды"				, ИмяКоманды);
	КомандаОтчета.Вставить("ПредставлениеКоманды"	, ПредставлениеКоманды);
	КомандаОтчета.Вставить("ОсновнаяКоманда"		, истина);
	
	Настройки = Новый Структура;
	Настройки.Вставить("Индекс"				, Индекс);
	Настройки.Вставить("КомандаОтчета"		, КомандаОтчета);
	Настройки.Вставить("РасположениеОбъекта", РасположениеОбъекта.ВыгрузитьЗначения());
	Настройки.Вставить("ДоступностьОбъекта" , ДоступностьОбъекта.ВыгрузитьЗначения());
	
	Возврат ПоместитьВоВременноеХранилище(Настройки);
	
КонецФункции



#КонецОбласти

