#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если Не Значение Тогда
		Константы.CW_ИспользуетсяСогласованиеОбъектов.Установить(Ложь);	
		Константы.CW_ПараметрПриложенияДоговора.Установить(Неопределено);	
		Константы.CW_ИспользуютсяГруппыУслугДоговоровИПриложений.Установить(Ложь);	 
	КонецЕсли;
	
	РегистрыСведений.CW_НастройкиПользователей.СброситьУстановитьНастройкиПриИзмененииОпцийПрограммы("CW_ВедетсяУчетПриложенийПоДоговорам", Значение);
	
КонецПроцедуры

#КонецЕсли
