#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ВыполнитьСценарий(СтрокаПараметра) Экспорт
	Если		СтрокаПараметра.Сценарий.ВидСценария = Перечисления.CW_DT_ВидыСценария.ПоискПоНаименованию Тогда
		Справочник	= Метаданные.НайтиПоТипу(СтрокаПараметра.Параметр.ТипЗначения.Типы()[0]).Имя;
		Менеджер	= Справочники[Справочник];
		СтрокаПараметра.ЗначениеВПриемнике = Менеджер.НайтиПоНаименованию(СтрокаПараметра.Значение,Истина);
	ИначеЕсли	СтрокаПараметра.Сценарий.ВидСценария = Перечисления.CW_DT_ВидыСценария.ПоискПоКоду Тогда 
		Справочник	= Метаданные.НайтиПоТипу(СтрокаПараметра.Параметр.ТипЗначения.Типы()[0]).Имя;
		Менеджер	= Справочники[Справочник];
		СтрокаПараметра.ЗначениеВПриемнике = Менеджер.НайтиПоКоду(СтрокаПараметра.Значение,Истина);
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
