
&НаСервере
Процедура КомандаЗаполнитьДеревоНаСервере()

	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Метаданное КАК Метаданное,
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Ссылка КАК Подписка,
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.ВидПодписки КАК Событие,
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.Порядок КАК Порядок,
	               |	ВЫБОР
	               |		КОГДА CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.ВидПодписки = &ПередЗаписью
	               |			ТОГДА 0
	               |		КОГДА CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.ВидПодписки = &ПриЗаписи
	               |			ТОГДА 1
	               |		КОГДА CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.ВидПодписки = &ПриПроведении
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК ПорядокСобытия,
	               |	CW_ВнешниеПодпискиИсточникиПодписки.Ссылка.НеИспользуется КАК НеИспользуется
	               |ИЗ
	               |	Справочник.CW_ВнешниеПодписки.ИсточникиПодписки КАК CW_ВнешниеПодпискиИсточникиПодписки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПорядокСобытия,
	               |	Порядок
	               |ИТОГИ ПО
	               |	Метаданное
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ПередЗаписью", Перечисления.CW_ВидыВнешнихПодписок.ОбработчикПередЗаписью);
	Запрос.УстановитьПараметр("ПриЗаписи", Перечисления.CW_ВидыВнешнихПодписок.ОбработчикПриЗаписи);
	Запрос.УстановитьПараметр("ПриПроведении", Перечисления.CW_ВидыВнешнихПодписок.ОбработчикПриПроведении);
	
	ВыборкаМетаданное = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоПодписок",Тип("ДеревоЗначений"));
	
	Пока ВыборкаМетаданное.Следующий() Цикл  
		СтрокаДерева = ДеревоЗначений.Строки.Добавить();
		СтрокаДерева.МетаданноеПодписка	= ВыборкаМетаданное.Метаданное;
		СтрокаДерева.ВерхнийУровень 	= истина;
		
		ВыборкаПодписки = ВыборкаМетаданное.Выбрать();
		
		Пока ВыборкаПодписки.Следующий() Цикл
			СтрокаПодписки = СтрокаДерева.Строки.Добавить();
			СтрокаПодписки.МетаданноеПодписка 	= ВыборкаПодписки.Подписка;
			ЗаполнитьЗначенияСвойств(СтрокаПодписки, ВыборкаПодписки);
		КонецЦикла;
		
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений,"ДеревоПодписок");
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КомандаЗаполнитьДеревоНаСервере();

КонецПроцедуры
