Функция ПолучитьСтруктуруПараметров(ПарамтерыПроцедуры) Экспорт
	
	НалоговаяБаза = 0;  
	АдресДерева = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);

	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ДокументРеализации",	ПарамтерыПроцедуры.ВедомыйДокумент);
	ЗначенияЗаполнения.Вставить("ПриложениеРеестра",	ПарамтерыПроцедуры.ПриложениеРеестра);
	
	Если ЗначениеЗаполнено(ПарамтерыПроцедуры.ДокументРеализации) Тогда
		ЗначенияЗаполнения.Вставить("Организация",		ПарамтерыПроцедуры.ВедущийДокумент.Организация);
	КонецЕсли;
	
	СтруктураПарамтеров = Новый Структура;
	СтруктураПарамтеров.Вставить("АдресДерева",			АдресДерева);  
	СтруктураПарамтеров.Вставить("ЗначенияЗаполнения",	ЗначенияЗаполнения);  
	
	Возврат СтруктураПарамтеров;
	
КонецФункции

Функция ПолучитьВедомыйВедущийДокумент(ПараметрКоманды) Экспорт
	
	СтруктураДокументов = Новый Структура("ВедущийДокумент,ВедомыйДокумент", Неопределено, Неопределено);
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда   
		СтруктураДокументов.ВедущийДокумент = ПараметрКоманды;   
		СтруктураДокументов.ВедомыйДокумент = CW_РеестрыНДС0Сервер.ПолучитьДокументРеализации(ПараметрКоманды);
	КонецЕсли;   
	
	Возврат СтруктураДокументов;
	
КонецФункции

Функция ПолучитьСписокПриложений(ДокументРеализации) Экспорт
	
	Если ЗначениеЗаполнено(ДокументРеализации) Тогда 
		ВедущийДокумент = ПолучитьВедущийДокумент(ДокументРеализации);
		Если ЗначениеЗаполнено(ВедущийДокумент) Тогда
			СписокПриложений  = CW_РеестрыНДС0Дополнительный.ПолучитьСписокПриложенийПоДокументу(ВедущийДокумент);
		КонецЕсли;  
	Иначе
		СписокПриложений = Перечисления.CW_РеестрыНДС0Приложения.ПолучитьСписокПриложений();
	КонецЕсли;
	
	Возврат СписокПриложений;
	
КонецФункции

Функция ПолучитьСписокПриказов() Экспорт
	
	Возврат ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.ПолучитьСписокПриказов();
	
КонецФункции

Функция ПолучитьДействующиеПриказы(Знач Период=Неопределено) Экспорт

	// В соответствии с разъяснениями, полученными по применению приказа:
	// "Приказ ЕД-7-15/202@ вступил в силу 01.07.2024. Одновременно утратил силу приказ 772, 
	// то есть, с 01.07.2024 реестры в редакции приказа ЕД-7-15/772@ не применяются. 
	// И, в отличие от декларации по НДС, реестры не привязаны к налоговому периоду - 
	// у них есть только даты начала и конца применения. То есть на данный момент, 
	// применются реестры в редакции приказа ЕД-7-15/202@, но за любой прошлый период, 
	// включая корректировки." 
	// определение действующего приказа будет осуществляться на дату формирования 
	// записей в предположении того, что подготовка сведений (формирование реестров) и 
	// его отправка осуществляется в одном периоде (периоде действия приказа)  

	Возврат РегистрыСведений.CW_РеестрыНДС0ДействующиеПриказыПоВидуТранспорта.ПолучитьДействующиеПриказы(Период);   
	
КонецФункции

Функция МассивВыгрузкаДоступна() Экспорт
	
	МассивДоступныДляВыгрузки = Новый Массив;
	МассивДоступныДляВыгрузки.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение06); //КНД1155112
	МассивДоступныДляВыгрузки.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение07); //КНД1155113
	МассивДоступныДляВыгрузки.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение08); //КНД1155114
	МассивДоступныДляВыгрузки.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение09); //КНД1155115
	МассивДоступныДляВыгрузки.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение12); //КНД1155116
	МассивДоступныДляВыгрузки.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение10); //КНД1155122
	МассивДоступныДляВыгрузки.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2024Кв2_Приложение11); //КНД1155123
	
	МассивДоступныДляВыгрузки.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение06); //КНД1155112
	
	МассивДоступныДляВыгрузки.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение07); //КНД1155113
	МассивДоступныДляВыгрузки.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение08); //КНД1155114
	МассивДоступныДляВыгрузки.Добавить(ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.РеестрНДС2025Кв2_Приложение09); //КНД1155115

	Возврат МассивДоступныДляВыгрузки;

КонецФункции 

Функция ПолучитьВедущийДокумент(ДокументРеализации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ДоходыПоГрузоперевозке.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозке.ВедомыйДокумент = &ВедомыйДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ДоходыПоГрузоперевозке.Ссылка
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозке.ВедомыйДокументКорректировки = &ВедомыйДокумент"; 
	
	Запрос.УстановитьПараметр("ВедомыйДокумент", ДокументРеализации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда  
		Возврат Выборка.Ссылка;;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВидимостьКомандыЗаполнить(ДокументРеализации) Экспорт  
	
	Если Не ЗначениеЗаполнено(ДокументРеализации) тогда
		Возврат	Ложь;
	КонецЕсли;
	
	ВедущийДокумент = ПолучитьВедущийДокумент(ДокументРеализации);
	Если Не ЗначениеЗаполнено(ВедущийДокумент) тогда
		Возврат	Ложь;
	КонецЕсли;  
	
	Возврат Истина;
	
КонецФункции   

Функция ПодготовитьДанныеЗаписиРеестраНДСНаСервере(ПараметрКоманды, ТолькоОшибкиЗаполнения = Ложь) Экспорт
	
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		ТаблицаГрузоперевозок = ПолучитьТаблицуГрузоперевозокПоМассиву(ПараметрКоманды);
	ИначеЕсли  ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Заказы") Тогда   
		МассивГрузоперевозок  = Справочники.CW_Заказы.ПолучитьМассивГрузоперевозокЗаказа(ПараметрКоманды);
		ТаблицаГрузоперевозок = ПолучитьТаблицуГрузоперевозокПоМассиву(МассивГрузоперевозок);
	ИначеЕсли  ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Заявки") Тогда
		МассивГрузоперевозок = Справочники.CW_Заявки.ПолучитьМассивГрузоперевозокЗаявки(ПараметрКоманды);
		ТаблицаГрузоперевозок = ПолучитьТаблицуГрузоперевозокПоМассиву(МассивГрузоперевозок);
	ИначеЕсли  ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_РеестрыНДС0ЗаписиРеестра") Тогда
		ТаблицаГрузоперевозок = ПолучитьТаблицуГрузоперевозокЗаписиРеестра(ПараметрКоманды);
	ИначеЕсли  ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		ТаблицаГрузоперевозок = ПолучитьТаблицуГрузоперевозокПоДокументу(ПараметрКоманды);
	КонецЕсли;
	
	//Подмена грузоперевозок   
	ТаблицаГрузоперевозок = ОбработатьПодменуГрузоперевозок(ТаблицаГрузоперевозок);
	//Подмена грузоперевозок
	
	//Исключим помеченные на удаление
	ТаблицаГрузоперевозок = ОбработатьТаблицуГрузоперевозок(ТаблицаГрузоперевозок);
	//Исключим помеченные на удаление
	
	Возврат CW_РеестрыНДС0Дополнительный.ПодготовитьДанныеЗаписиРеестраНДСНаСервере(ТаблицаГрузоперевозок, ТолькоОшибкиЗаполнения);
	
КонецФункции 

Функция ОбработатьТаблицуГрузоперевозок(ТаблицаГрузоперевозок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаГрузоперевозок.ВидТранспорта КАК ВидТранспорта,
	|	ТаблицаГрузоперевозок.Грузоперевозка КАК Грузоперевозка
	|ПОМЕСТИТЬ ВТ_ТаблицаГрузоперевозок
	|ИЗ
	|	&ТаблицаГрузоперевозок КАК ТаблицаГрузоперевозок 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаГрузоперевозок.ВидТранспорта КАК ВидТранспорта,
	|	ВТ_ТаблицаГрузоперевозок.Грузоперевозка КАК Грузоперевозка
	|ИЗ
	|	ВТ_ТаблицаГрузоперевозок КАК ВТ_ТаблицаГрузоперевозок  
	|ГДЕ
	|	ВТ_ТаблицаГрузоперевозок.Грузоперевозка.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("ТаблицаГрузоперевозок", ТаблицаГрузоперевозок);
	
	РезультатЗапроса 	= Запрос.Выполнить(); 
	
	Возврат  РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ОбработатьПодменуГрузоперевозок(ТаблицаГрузопереовзок)

	Если Не Константы.CW_РеестрыНДС0ИспользуетсяПодменаГрузоперевозок.Получить() или ТаблицаГрузопереовзок = Неопределено Тогда
		Возврат ТаблицаГрузопереовзок;
	КонецЕсли; 
	
	ПараметрТребуетсяПодмена 			= Константы.CW_РеестрыНДС0ПараметрТребуетсяПодменаГрузоперевозок.Получить();
	ПараметрГрузоперевозкаДляЗамены  	= Константы.CW_РеестрыНДС0ПараметрГрузоперевозкаДляЗамены.Получить();

	Запрос = Новый Запрос;   
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаГрузопереовзок", 				ТаблицаГрузопереовзок);
	Запрос.УстановитьПараметр("ПараметрТребуетсяПодмена", 			ПараметрТребуетсяПодмена);
	Запрос.УстановитьПараметр("ПараметрГрузоперевозкаДляЗамены",	ПараметрГрузоперевозкаДляЗамены);

	Запрос.Текст  = "ВЫБРАТЬ
	                |	ВТ_Данные.ВидТранспорта КАК ВидТранспорта,
	                |	ВТ_Данные.Грузоперевозка КАК Грузоперевозка
	                |ПОМЕСТИТЬ ВТ_ВнешняяТаблица
	                |ИЗ
	                |	&ТаблицаГрузопереовзок КАК ВТ_Данные
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_ВнешняяТаблица.ВидТранспорта КАК ВидТранспорта,
	                |	ВТ_ВнешняяТаблица.Грузоперевозка КАК Грузоперевозка,
	                |	ЕСТЬNULL(CW_ХарактеристикиТребуетсяПодмена.Значение, ЛОЖЬ) КАК ТребутсяПодмена
	                |ПОМЕСТИТЬ ВТ_Дополненная
	                |ИЗ
	                |	ВТ_ВнешняяТаблица КАК ВТ_ВнешняяТаблица
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиТребуетсяПодмена
	                |		ПО ВТ_ВнешняяТаблица.Грузоперевозка = CW_ХарактеристикиТребуетсяПодмена.Грузоперевозка
	                |			И (CW_ХарактеристикиТребуетсяПодмена.Параметр = &ПараметрТребуетсяПодмена)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_Дополненная.ВидТранспорта КАК ВидТранспорта,
	                |	ВТ_Дополненная.Грузоперевозка КАК Грузоперевозка
	                |ИЗ
	                |	ВТ_Дополненная КАК ВТ_Дополненная
	                |ГДЕ
	                |	ВТ_Дополненная.ТребутсяПодмена = ЛОЖЬ";
	
	РезультатЗапроса 	= Запрос.Выполнить(); 
	
	//Грузоперевозки не требующие подмены
	ТаблицаЗапроса 		= РезультатЗапроса.Выгрузить();
	
	//Грузоперевозки требующие подмены
	Запрос.Текст  = "ВЫБРАТЬ
	                |	ВТ_Дополненная.ВидТранспорта КАК ВидТранспорта,
	                |	ВТ_Дополненная.Грузоперевозка КАК Грузоперевозка,
	                |	ЕСТЬNULL(CW_ХарактеристикиГрузоперевозок.Грузоперевозка, ВТ_Дополненная.Грузоперевозка) КАК ГрузоперевозкаЗамена
	                |ИЗ
	                |	ВТ_Дополненная КАК ВТ_Дополненная
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	                |		ПО ВТ_Дополненная.Грузоперевозка = CW_ХарактеристикиГрузоперевозок.Значение
	                |			И (CW_ХарактеристикиГрузоперевозок.Параметр = &ПараметрГрузоперевозкаДляЗамены)
	                |ГДЕ
	                |	ВТ_Дополненная.ТребутсяПодмена = ИСТИНА
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ_Дополненная.Грузоперевозка,
	                |	ЕСТЬNULL(CW_ХарактеристикиГрузоперевозок.Грузоперевозка, ВТ_Дополненная.Грузоперевозка),
	                |	ВТ_Дополненная.ВидТранспорта
	                |ИТОГИ
	                |	МАКСИМУМ(ВидТранспорта)
	                |ПО
	                |	Грузоперевозка";
	
	
	РезультатЗапроса 	= Запрос.Выполнить(); 
	
	ВыборкаГрузоперевозки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГрузоперевозки.Следующий() Цикл
		
		ВыборкаЗамена = ВыборкаГрузоперевозки.Выбрать();
		Если ВыборкаЗамена.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаЗапроса.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаГрузоперевозки);
			Продолжить;
		КонецЕсли;   
		
		Пока ВыборкаЗамена.Следующий() Цикл
			НоваяСтрока = ТаблицаЗапроса.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаГрузоперевозки,,"Грузоперевозка");
			НоваяСтрока.Грузоперевозка  = ВыборкаЗамена.ГрузоперевозкаЗамена;
		КонецЦикла;  
		
	КонецЦикла;  
	
	Возврат ТаблицаЗапроса;
	
КонецФункции

Функция ПолучитьТаблицуГрузоперевозокПоМассиву(Грузоперевозки)
	
	ПараметрПриложения = Константы.CW_РеестрыНДС0МониторинговыйПараметрПриложения.Получить(); 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ХарактеристикиГрузоперевозок.Значение КАК ВидТранспорта
	               |ИЗ
	               |	РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	               |ГДЕ
	               |	CW_ХарактеристикиГрузоперевозок.Грузоперевозка В(&Грузоперевозки)
	               |	И CW_ХарактеристикиГрузоперевозок.Параметр = &ПараметрПриложения";
	
	Запрос.УстановитьПараметр("Грузоперевозки", 	Грузоперевозки);
	Запрос.УстановитьПараметр("ПараметрПриложения", ПараметрПриложения); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

Функция ПолучитьТаблицуГрузоперевозокЗаписиРеестра(ПараметрКоманды)

	МассивДокументов = Новый Массив;
		   
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_РеестрыНДС0ЗаписиРеестра.ДокументДоходов КАК ДокументДоходов
	               |ИЗ
	               |	Справочник.CW_РеестрыНДС0ЗаписиРеестра КАК CW_РеестрыНДС0ЗаписиРеестра
	               |ГДЕ
	               |	CW_РеестрыНДС0ЗаписиРеестра.Ссылка В(&ПараметрКоманды)";
	
	Запрос.УстановитьПараметр("ПараметрКоманды", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивДокументов.Добавить(Выборка.ДокументДоходов);
	КонецЦикла;  
	
	Возврат ПолучитьТаблицуГрузоперевозокПоДокументу(МассивДокументов);
	
КонецФункции

Функция ПолучитьТаблицуГрузоперевозокПоДокументу(ПараметрКоманды)

	ПараметрПриложения = Константы.CW_РеестрыНДС0МониторинговыйПараметрПриложения.Получить(); 
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,
	               |	ВЫБОР
	               |		КОГДА CW_ДоходыПоГрузоперевозкеУслуги.РеестрыНДС0Приложение = ЗНАЧЕНИЕ(Перечисление.CW_РеестрыНДС0Приложения.ПустаяСсылка)
	               |			ТОГДА ЕСТЬNULL(CW_ХарактеристикиГрузоперевозок.Значение, НЕОПРЕДЕЛЕНО)
	               |		ИНАЧЕ CW_ДоходыПоГрузоперевозкеУслуги.РеестрыНДС0Приложение
	               |	КОНЕЦ КАК ВидТранспорта
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	               |		ПО CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка = CW_ХарактеристикиГрузоперевозок.Грузоперевозка
	               |			И (CW_ХарактеристикиГрузоперевозок.Параметр = &ПараметрПриложения)
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка В(&ПараметрКоманды)
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.ПорядокОтражения = ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга)
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)";
	
	Запрос.УстановитьПараметр("ПараметрКоманды", 	ПараметрКоманды);
	Запрос.УстановитьПараметр("ПараметрПриложения", ПараметрПриложения); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции 

