#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ДобавитьНовыйЭтапСогласования(ОбъектСогласования, НомерЭтапа, Инициатор) Экспорт
	
	НовыйОбъект = Справочники.CW_ЭтапыСогласования.СоздатьЭлемент();
	НовыйОбъект.ОбъектСогласования 		= ОбъектСогласования;
	НовыйОбъект.Инициатор 				= Инициатор;
	НовыйОбъект.Наименование 			= "Этап "+НомерЭтапа;
	НовыйОбъект.СостояниеСогласования 	= ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Черновик");
	НовыйОбъект.ПорядокСогласования 	= ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Параллельное");

	НовыйОбъект.ДополнительныеСвойства.Вставить("ЗаписатьСостояниеОбъекта",	Истина);
	НовыйОбъект.ДополнительныеСвойства.Вставить("СостояниеОбъекта",			ПредопределенноеЗначение("Перечисление.CW_СостоянияСогласования.Черновик"));
	
	НовыйОбъект.Записать();
	
	Возврат НовыйОбъект.Ссылка;
	
КонецФункции

Функция ПолучитьКоличествоЭтаповОбъектаСогласования(ОбъектСогласования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_ЭтапыСогласования.Ссылка) КАК Количество
	               |ИЗ
	               |	Справочник.CW_ЭтапыСогласования КАК CW_ЭтапыСогласования
	               |ГДЕ
	               |	CW_ЭтапыСогласования.ОбъектСогласования = &ОбъектСогласования";
	
	Запрос.УстановитьПараметр("ОбъектСогласования", ОбъектСогласования);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецЕсли
