
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.ЗначениеКопирования) Тогда 
		ц = ЭтаФорма.Параметры.ЗначениеКопирования.ХранилищеЦвета.Получить();
	Иначе 
		ц = РеквизитФормыВЗначение("Объект").ХранилищеЦвета.Получить();
	КонецЕсли;
		
	Если ц <> Неопределено Тогда 
		Цвет = ц;
	Иначе 
		Цвет = ЦветаСтиля.ЦветФонаПоля;
	КонецЕсли;
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ХранилищеЦвета = Новый ХранилищеЗначения(Цвет);
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти

