#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Инициализация_отчета
// информация об отчете
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОтчет();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешнийОтчет();
	
	СтруктураОписания.Наименование 				= "Движение денежных средств";
	СтруктураОписания.Описание 					= "Движение денежных средств.
												 |Заказчик: АО ""Порт-Карго-Сервис"", Заявка №338, Булгакова Л. Е.";
	СтруктураОписания.Версия					= "3.2.0.2";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.10.10";
	
	СтруктураОписания.РасполагатьНаРабочемСтоле =  Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "ОткрытьФорму");
	
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыОбъекта(СтруктураОписания, 		"ФормаОтчета");

	CW_ПодключаемыеКомандыСервер.УстановитьКомандыВнешнегоОбъекта(СтруктураОписания,
						"ВнешнийОтчет_CW_ОтчетБДДС",
						"Движение денежных средств (внешний)",
						"Отчет",
						Ложь);
	
	Возврат СтруктураОписания;

КонецФункции

#КонецОбласти

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиСКД	= КомпоновщикНастроек.Настройки;
	Настройки		= ПолучитьИзВременногоХранилища(АдресНастроек);
	
	Если Настройки	= Неопределено Тогда 
		Возврат 
	КонецЕсли; 
	
	Данные = ПолучитьДанныеДляФормированияОтчета(Настройки);

	// установим заголовок
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ?(Настройки.Язык = Справочники.CW_Языки.ru,"БЮДЖЕТ ДВИЖЕНИЯ ДЕНЕЖНЫХ СРЕДСТВ","CASH FLOW BUDGET"));
	
	// Установим параметры
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",		Настройки.Период.ДатаНачала);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания",	Настройки.Период.ДатаОкончания);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ВалютаОтчета",	Настройки.ВалютаОтчета);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Сценарий",		Настройки.Сценарий);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Детализация",		Настройки.Детализация);  
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Статус",			Настройки.Статус);  
	
	//Группировки отчета
	СоответствиеЦветаГруппирвок = ПолучитьСоответствиеЦветаУровнюГруппировки();
	
	Таблица 			= НастройкиСКД.Структура[0];
	СтрокаГруппировка 	= Таблица.Строки[1];
	
	ЭлементУсловногоОформления = СтрокаГруппировка.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаГруппировкиОтчета1);
	
	СтрокаГруппировка.Структура.Очистить();
	Для Индекс = 0 по Настройки.Группировки.Количество()-1 Цикл
		
		ПолеКомпановки = Настройки.Группировки[Индекс];
		
		НоваяГруппировка = СтрокаГруппировка.Структура.Добавить();
		НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		
		ПолеГруппировки 		= НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле 	= ПолеКомпановки;
		
		СтрокаГруппировка = НоваяГруппировка;
		
		Если Настройки.Группировки.Количество() > 1 Тогда
			ЦветФона =  СоответствиеЦветаГруппирвок.Получить(Индекс);
			ЦветФона = ?(ЦветФона = Неопределено,  Новый Цвет(255,255,255), ЦветФона);
		Иначе
			ЦветФона =  Новый Цвет(255,255,255);
		Конецесли;
		
		ЭлементУсловногоОформления = НоваяГруппировка.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	
	КонецЦикла;
	
	//Программно формируем отчет 
    СтандартнаяОбработка	= Ложь;
    Схема					= ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    ДанныеРасшифровки		= Новый ДанныеРасшифровкиКомпоновкиДанных;
    КомпоновщикМакета		= Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки			= КомпоновщикМакета.Выполнить(Схема, НастройкиСКД, ДанныеРасшифровки);
    
    ВнешниеНаборыДанных		= Новый Структура;
    ВнешниеНаборыДанных.Вставить("Данные",Данные);
    
    //Инициализируем процессор компоновки
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	ДокументРезультат.Очистить();
    
    //Выводим отчет в документ
    ПроцессорВывода = Новый
    ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
	ДокументРезультат.НайтиТекст("<ЗаголовокГруппировок>").Текст = ?(Настройки.Язык = Справочники.CW_Языки.ru,"Группировки","Groupings");
	
	Пока Истина Цикл
		НайденнаяОбласть = ДокументРезультат.НайтиТекст("<ЗаголовокГруппировок>");
		Если НайденнаяОбласть = Неопределено тогда
			Возврат;
		КонецЕсли;
		
		Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
		Область = ДокументРезультат.Область("R"+Формат(НайденнаяОбласть.Низ,"ЧГ="));
		
		ДокументРезультат.УдалитьОбласть(Область, Смещать);		
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьСоответствиеЦветаУровнюГруппировки()
	
	Результат = новый Соответствие;
	Результат.Вставить(0, ЦветаСтиля.ЦветФонаГруппировкиОтчета2);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеДляФормированияОтчета(Знач Настройки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПериодов.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ТаблицаПериодов
	|ИЗ
	|	&ТаблицаПериодов КАК ТаблицаПериодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация КАК Организация,
	|	ВалютаРегламентированногоУчета.Значение КАК ВалютаСтатьи,
	|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаНачала, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), , ) КАК ХозрасчетныйОстатки,
	|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация,
	|	ХозрасчетныйОстатки.Валюта,
	|	ХозрасчетныйОстатки.ВалютнаяСуммаОстаток 
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаНачала, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета), , ) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
	|	ВТ_Остатки.Организация КАК Организация,
	|	ВТ_Остатки.ВалютаСтатьи КАК ВалютаСтатьи,
	|	ВТ_Остатки.Сумма * (ЕСТЬNULL(КурсыВалютОстаток.Курс, 1) / ЕСТЬNULL(КурсыВалютОстаток.Кратность, 1) / (ЕСТЬNULL(КурсыВалютОтчет.Курс, 1) / ЕСТЬNULL(КурсыВалютОтчет.Кратность, 1))) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ОстаткиВал
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаНачала, ) КАК КурсыВалютОстаток
	|		ПО ВТ_Остатки.ВалютаСтатьи = КурсыВалютОстаток.Валюта,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаНачала, Валюта = &ВалютаОтчета) КАК КурсыВалютОтчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
	|	&ВходящийОстатокСумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ВходящийОстатокСумма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_ПланированиеДДС.Ссылка КАК Ссылка,
	|	CW_ПланированиеДДС.ВидДвижения КАК ВидДвижения,
	|	CW_ПланированиеДДС.СтатьяДДС КАК СтатьяДДС,
	|	CW_ПланированиеДДС.Валюта КАК ВалютаСтатьи,
	|	ВЫБОР
	|		КОГДА &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.План)
	|				ИЛИ &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.Отклонена)
	|			ТОГДА CW_ПланированиеДДС.СрокОплаты
	|		ИНАЧЕ CW_ПланированиеДДС.ПланОплаты
	|	КОНЕЦ КАК ПланОплаты,
	|	CW_ПланированиеДДС.Сумма КАК Сумма,
	|	CW_ПланированиеДДС.Организация КАК Организация,
	|	CW_ПланированиеДДС.Офис КАК Офис,
	|	CW_ПланированиеДДС.Инициатор КАК Инициатор,
	|	CW_ПланированиеДДС.Валюта КАК Валюта,
	|	CW_ПланированиеДДС.Контрагент КАК Контрагент,
	|	CW_ПланированиеДДС.Договор КАК Договор,
	|	CW_ПланированиеДДС.ПриложениеКДоговору КАК ПриложениеКДоговору
	|ПОМЕСТИТЬ ВТ_СтатьиДДС
	|ИЗ
	|	Справочник.CW_ПланированиеДДС КАК CW_ПланированиеДДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_СтатусыПланированиеДДС.СрезПоследних(&ДатаСреза, ) КАК CW_СтатусыПланированиеДДССрезПоследних
	|		ПО CW_ПланированиеДДС.Ссылка = CW_СтатусыПланированиеДДССрезПоследних.ПланированиеДДС
	|			И (CW_СтатусыПланированиеДДССрезПоследних.Статус = &Статус)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.План)
	|					ИЛИ &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.Отклонена)
	|				ТОГДА НЕ CW_ПланированиеДДС.СрокОплаты = ДАТАВРЕМЯ(1, 1, 1)
	|			КОГДА &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.Согласована)
	|					ИЛИ &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.ВОплате)
	|					ИЛИ &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.Оплачено)
	|				ТОГДА НЕ CW_ПланированиеДДС.ПланОплаты = ДАТАВРЕМЯ(1, 1, 1)
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.План)
	|					ИЛИ &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.Отклонена)
	|				ТОГДА CW_ПланированиеДДС.СрокОплаты МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			КОГДА &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.Согласована)
	|					ИЛИ &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.ВОплате)
	|					ИЛИ &Статус = ЗНАЧЕНИЕ(перечисление.CW_СтатусыПланированияДДС.Оплачено)
	|				ТОГДА CW_ПланированиеДДС.ПланОплаты МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И CW_ПланированиеДДС.Сценарий = &Сценарий
	|	И НЕ CW_ПланированиеДДС.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтатьиДДС.СтатьяДДС КАК СтатьяДДС
	|ПОМЕСТИТЬ ВТ_СтатьиДДСГрупп
	|ИЗ
	|	ВТ_СтатьиДДС КАК ВТ_СтатьиДДС
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СтатьиДДС.СтатьяДДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтатьиДДСГрупп.СтатьяДДС КАК СтатьяДДС,
	|	ВТ_СтатьиДДСГрупп.СтатьяДДС.Наименование КАК СтатьяДДСПердставление
	|ПОМЕСТИТЬ ВТ_Переводы
	|ИЗ
	|	ВТ_СтатьиДДСГрупп КАК ВТ_СтатьиДДСГрупп
	|ГДЕ
	|	&Язык = ЗНАЧЕНИЕ(Справочник.CW_Языки.ru)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СтатьиДДСГрупп.СтатьяДДС,
	|	ЕСТЬNULL(CW_Переводы.Перевод, ""<Translation undefined>"")
	|ИЗ
	|	ВТ_СтатьиДДСГрупп КАК ВТ_СтатьиДДСГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_Переводы КАК CW_Переводы
	|		ПО ВТ_СтатьиДДСГрупп.СтатьяДДС = CW_Переводы.ОбъектПеревода
	|			И (НЕ CW_Переводы.Язык = ЗНАЧЕНИЕ(Справочник.CW_Языки.ru))
	|ГДЕ
	|	НЕ &Язык = ЗНАЧЕНИЕ(Справочник.CW_Языки.ru)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СтатьиДДС.Ссылка КАК Ссылка,
	|	ВТ_СтатьиДДС.ВидДвижения КАК ВидДвижения,
	|	ВТ_СтатьиДДС.СтатьяДДС КАК СтатьяДДС,
	|	ВТ_СтатьиДДС.ВалютаСтатьи КАК ВалютаСтатьи,
	|	ВТ_СтатьиДДС.ПланОплаты КАК ПланОплаты,
	|	ВТ_СтатьиДДС.Сумма * (ЕСТЬNULL(КурсыВалютСтатьи.Курс, 1) / ЕСТЬNULL(КурсыВалютСтатьи.Кратность, 1) / (ЕСТЬNULL(КурсыВалютОтчет.Курс, 1) / ЕСТЬNULL(КурсыВалютОтчет.Кратность, 1))) КАК Сумма,
	|	ВТ_СтатьиДДС.Организация КАК Организация,
	|	ВТ_СтатьиДДС.Офис КАК Офис,
	|	ВТ_СтатьиДДС.Инициатор КАК Инициатор,
	|	ВТ_СтатьиДДС.Валюта КАК Валюта,
	|	ВТ_СтатьиДДС.Контрагент КАК Контрагент,
	|	ВТ_СтатьиДДС.Договор КАК Договор,
	|	ВТ_СтатьиДДС.ПриложениеКДоговору КАК ПриложениеКДоговору
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_СтатьиДДС КАК ВТ_СтатьиДДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, ) КАК КурсыВалютСтатьи
	|		ПО ВТ_СтатьиДДС.ВалютаСтатьи = КурсыВалютСтатьи.Валюта,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, Валюта = &ВалютаОтчета) КАК КурсыВалютОтчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.ПланОплаты КАК ПланОплаты,
	|	НАЧАЛОПЕРИОДА(ВТ_Данные.ПланОплаты, ДЕНЬ) КАК Период
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	&Детализация = ""День""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.ПланОплаты,
	|	НАЧАЛОПЕРИОДА(ВТ_Данные.ПланОплаты, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Данные.ПланОплаты,
	|	НАЧАЛОПЕРИОДА(ВТ_Данные.ПланОплаты, НЕДЕЛЯ)
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	&Детализация = ""Неделя""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.ПланОплаты,
	|	НАЧАЛОПЕРИОДА(ВТ_Данные.ПланОплаты, НЕДЕЛЯ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Данные.ПланОплаты,
	|	НАЧАЛОПЕРИОДА(ВТ_Данные.ПланОплаты, МЕСЯЦ)
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	&Детализация = ""Месяц""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.ПланОплаты,
	|	НАЧАЛОПЕРИОДА(ВТ_Данные.ПланОплаты, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Данные.ПланОплаты,
	|	НАЧАЛОПЕРИОДА(ВТ_Данные.ПланОплаты, КВАРТАЛ)
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	&Детализация = ""Квартал""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.ПланОплаты,
	|	НАЧАЛОПЕРИОДА(ВТ_Данные.ПланОплаты, КВАРТАЛ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Данные.ПланОплаты,
	|	НАЧАЛОПЕРИОДА(ВТ_Данные.ПланОплаты, ГОД)
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|ГДЕ
	|	&Детализация = ""Год""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.ПланОплаты,
	|	НАЧАЛОПЕРИОДА(ВТ_Данные.ПланОплаты, ГОД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Периоды.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ПериодыДополненные
	|ИЗ
	|	ВТ_Периоды КАК ВТ_Периоды
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Периоды.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПериодов.Период
	|ИЗ
	|	ВТ_ТаблицаПериодов КАК ВТ_ТаблицаПериодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыДополненные.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ПериодыГрупп
	|ИЗ
	|	ВТ_ПериодыДополненные КАК ВТ_ПериодыДополненные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПериодыДополненные.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка КАК Ссылка,
	|	ВТ_Данные.Организация КАК Организация,
	|	ВТ_Данные.ВидДвижения КАК ВидДвижения,
	|	ВТ_Данные.СтатьяДДС КАК СтатьяДДС,
	|	ВТ_Данные.ВалютаСтатьи КАК ВалютаСтатьи,
	|	ВТ_Данные.ПланОплаты КАК ПланОплаты,
	|	ВТ_Данные.Сумма КАК Сумма,
	|	ВТ_Периоды.Период КАК Период,
	|	ВТ_Данные.Офис КАК Офис,
	|	ВТ_Данные.Инициатор КАК Инициатор,
	|	ВТ_Данные.Валюта КАК Валюта,
	|	ВТ_Данные.Контрагент КАК Контрагент,
	|	ВТ_Данные.Договор КАК Договор,
	|	ВТ_Данные.ПриложениеКДоговору КАК ПриложениеКДоговору
	|ПОМЕСТИТЬ ВТ_ДанныеПериод
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Периоды КАК ВТ_Периоды
	|		ПО ВТ_Данные.ПланОплаты = ВТ_Периоды.ПланОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПериод.Период КАК Период,
	|	ВТ_ДанныеПериод.Организация КАК Организация,
	|	ВТ_ДанныеПериод.ВалютаСтатьи КАК ВалютаСтатьи,
	|	ВТ_ДанныеПериод.СтатьяДДС КАК СтатьяДДС,
	|	ВТ_ДанныеПериод.Сумма КАК Сумма,
	|	ВТ_ДанныеПериод.Ссылка КАК Ссылка,
	|	ВТ_ДанныеПериод.Офис КАК Офис,
	|	ВТ_ДанныеПериод.Инициатор КАК Инициатор,
	|	ВТ_ДанныеПериод.Валюта КАК Валюта,
	|	ВТ_ДанныеПериод.Контрагент КАК Контрагент,
	|	ВТ_ДанныеПериод.Договор КАК Договор,
	|	ВТ_ДанныеПериод.ПриложениеКДоговору КАК ПриложениеКДоговору
	|ПОМЕСТИТЬ ВТ_Приход
	|ИЗ
	|	ВТ_ДанныеПериод КАК ВТ_ДанныеПериод
	|ГДЕ
	|	ВТ_ДанныеПериод.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженияДДС.Приход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПериод.Период КАК Период,
	|	ВТ_ДанныеПериод.Организация КАК Организация,
	|	ВТ_ДанныеПериод.ВалютаСтатьи КАК ВалютаСтатьи,
	|	ВТ_ДанныеПериод.СтатьяДДС КАК СтатьяДДС,
	|	ВТ_ДанныеПериод.Сумма КАК Сумма,
	|	ВТ_ДанныеПериод.Ссылка КАК Ссылка,
	|	ВТ_ДанныеПериод.Офис КАК Офис,
	|	ВТ_ДанныеПериод.Инициатор КАК Инициатор,
	|	ВТ_ДанныеПериод.Валюта КАК Валюта,
	|	ВТ_ДанныеПериод.Контрагент КАК Контрагент,
	|	ВТ_ДанныеПериод.Договор КАК Договор,
	|	ВТ_ДанныеПериод.ПриложениеКДоговору КАК ПриложениеКДоговору
	|ПОМЕСТИТЬ ВТ_Расход
	|ИЗ
	|	ВТ_ДанныеПериод КАК ВТ_ДанныеПериод
	|ГДЕ
	|	ВТ_ДанныеПериод.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженияДДС.Расход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПериод.Период КАК Период,
	|	ВТ_ДанныеПериод.Организация КАК Организация,
	|	ВТ_ДанныеПериод.ВалютаСтатьи КАК ВалютаСтатьи,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ДанныеПериод.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженияДДС.Приход)
	|				ТОГДА ВТ_ДанныеПериод.Сумма
	|			КОГДА ВТ_ДанныеПериод.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженияДДС.Расход)
	|				ТОГДА -ВТ_ДанныеПериод.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	ВТ_ДанныеПериод.Ссылка КАК Ссылка,
	|	ВТ_ДанныеПериод.Офис КАК Офис,
	|	ВТ_ДанныеПериод.Инициатор КАК Инициатор,
	|	ВТ_ДанныеПериод.Валюта КАК Валюта,
	|	ВТ_ДанныеПериод.Контрагент КАК Контрагент,
	|	ВТ_ДанныеПериод.Договор КАК Договор,
	|	ВТ_ДанныеПериод.ПриложениеКДоговору КАК ПриложениеКДоговору
	|ПОМЕСТИТЬ ВТ_Оборот
	|ИЗ
	|	ВТ_ДанныеПериод КАК ВТ_ДанныеПериод
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПериод.Период,
	|	ВТ_ДанныеПериод.Организация,
	|	ВТ_ДанныеПериод.ВалютаСтатьи,
	|	ВТ_ДанныеПериод.Ссылка,
	|	ВТ_ДанныеПериод.Офис,
	|	ВТ_ДанныеПериод.Инициатор,
	|	ВТ_ДанныеПериод.Валюта,
	|	ВТ_ДанныеПериод.Контрагент,
	|	ВТ_ДанныеПериод.Договор,
	|	ВТ_ДанныеПериод.ПриложениеКДоговору
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыГрупп.Период КАК Период,
	|	ВТ_Оборот.Организация КАК Организация,
	|	ВТ_Оборот.ВалютаСтатьи КАК ВалютаСтатьи,
	|	СУММА(ЕСТЬNULL(ВТ_Оборот.Сумма, 0)) КАК Сумма,
	|	NULL КАК ВходящийОстатокСумма,
	|	ВТ_Оборот.Ссылка КАК Ссылка,
	|	ВТ_Оборот.Офис КАК Офис,
	|	ВТ_Оборот.Инициатор КАК Инициатор,
	|	ВТ_Оборот.Валюта КАК Валюта,
	|	ВТ_Оборот.Контрагент КАК Контрагент,
	|	ВТ_Оборот.Договор КАК Договор,
	|	ВТ_Оборот.ПриложениеКДоговору КАК ПриложениеКДоговору
	|ПОМЕСТИТЬ ВТ_ВходящийОстаток
	|ИЗ
	|	ВТ_ПериодыГрупп КАК ВТ_ПериодыГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оборот КАК ВТ_Оборот
	|		ПО ВТ_ПериодыГрупп.Период > ВТ_Оборот.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПериодыГрупп.Период,
	|	ВТ_Оборот.Организация,
	|	ВТ_Оборот.ВалютаСтатьи,
	|	ВТ_Оборот.Ссылка,
	|	ВТ_Оборот.Офис,
	|	ВТ_Оборот.Инициатор,
	|	ВТ_Оборот.Валюта,
	|	ВТ_Оборот.Контрагент,
	|	ВТ_Оборот.Договор,
	|	ВТ_Оборот.ПриложениеКДоговору
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПериодыГрупп.Период,
	|	ВТ_ОстаткиВал.Организация,
	|	ВТ_ОстаткиВал.ВалютаСтатьи,
	|	ВТ_ОстаткиВал.Сумма,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ПериодыГрупп КАК ВТ_ПериодыГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиВал КАК ВТ_ОстаткиВал
	|		ПО ВТ_ПериодыГрупп.Период > ВТ_ОстаткиВал.Период
	|ГДЕ
	|	&ВходящийОстатокРежим = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПериодыГрупп.Период,
	|	ВТ_ОстаткиВал.Организация,
	|	ВТ_ОстаткиВал.ВалютаСтатьи,
	|	ВТ_ОстаткиВал.Сумма
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПериодыГрупп.Период,
	|	ВТ_Данные.Организация,
	|	ВТ_Данные.ВалютаСтатьи,
	|	NULL,
	|	ВЫБОР
	|		КОГДА &ВходящийОстатокРежим = 2
	|			ТОГДА &ВходящийОстатокСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ПериодыГрупп КАК ВТ_ПериодыГрупп,
	|	ВТ_Данные КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВходящийОстаток.Период КАК Период,
	|	ВТ_ВходящийОстаток.Организация КАК Организация,
	|	ВТ_ВходящийОстаток.ВалютаСтатьи КАК ВалютаСтатьи,
	|	СУММА(ВТ_ВходящийОстаток.Сумма) КАК Сумма,
	|	МАКСИМУМ(ВТ_ВходящийОстаток.ВходящийОстатокСумма) КАК ВходящийОстатокСумма
	|ПОМЕСТИТЬ ВТ_ВходящийОстатокГрупп
	|ИЗ
	|	ВТ_ВходящийОстаток КАК ВТ_ВходящийОстаток
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВходящийОстаток.Период,
	|	ВТ_ВходящийОстаток.Организация,
	|	ВТ_ВходящийОстаток.ВалютаСтатьи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыГрупп.Период КАК Период,
	|	ВТ_Оборот.Организация КАК Организация,
	|	ВТ_Оборот.ВалютаСтатьи КАК ВалютаСтатьи,
	|	СУММА(ЕСТЬNULL(ВТ_Оборот.Сумма, 0)) КАК Сумма,
	|	NULL КАК ВходящийОстатокСумма
	|ПОМЕСТИТЬ ВТ_ИсходящийОстаток
	|ИЗ
	|	ВТ_ПериодыГрупп КАК ВТ_ПериодыГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оборот КАК ВТ_Оборот
	|		ПО ВТ_ПериодыГрупп.Период >= ВТ_Оборот.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПериодыГрупп.Период,
	|	ВТ_Оборот.Организация,
	|	ВТ_Оборот.ВалютаСтатьи
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПериодыГрупп.Период,
	|	ВТ_ОстаткиВал.Организация,
	|	ВТ_ОстаткиВал.ВалютаСтатьи,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиВал.Сумма, 0)),
	|	NULL
	|ИЗ
	|	ВТ_ПериодыГрупп КАК ВТ_ПериодыГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиВал КАК ВТ_ОстаткиВал
	|		ПО ВТ_ПериодыГрупп.Период >= ВТ_ОстаткиВал.Период
	|ГДЕ
	|	&ВходящийОстатокРежим = 1
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПериодыГрупп.Период,
	|	ВТ_ОстаткиВал.ВалютаСтатьи,
	|	ВТ_ОстаткиВал.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПериодыГрупп.Период,
	|	ВТ_Данные.Организация,
	|	ВТ_Данные.ВалютаСтатьи,
	|	NULL,
	|	ВЫБОР
	|		КОГДА &ВходящийОстатокРежим = 2
	|			ТОГДА &ВходящийОстатокСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТ_ПериодыГрупп КАК ВТ_ПериодыГрупп,
	|	ВТ_Данные КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходящийОстаток.Период КАК Период,
	|	ВТ_ИсходящийОстаток.Организация КАК Организация,
	|	ВТ_ИсходящийОстаток.ВалютаСтатьи КАК ВалютаСтатьи,
	|	СУММА(ВТ_ИсходящийОстаток.Сумма) КАК Сумма,
	|	МАКСИМУМ(ВТ_ИсходящийОстаток.ВходящийОстатокСумма) КАК ВходящийОстатокСумма
	|ПОМЕСТИТЬ ВТ_ИходящийОстатокГрупп
	|ИЗ
	|	ВТ_ИсходящийОстаток КАК ВТ_ИсходящийОстаток
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходящийОстаток.Период,
	|	ВТ_ИсходящийОстаток.Организация,
	|	ВТ_ИсходящийОстаток.ВалютаСтатьи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Приход.Период КАК Период,
	|	ВЫБОР
	|		КОГДА &Язык = ЗНАЧЕНИЕ(Справочник.CW_Языки.ru)
	|			ТОГДА ""Приход""
	|		ИНАЧЕ ""Income""
	|	КОНЕЦ КАК Группировка,
	|	ВТ_Приход.ВалютаСтатьи КАК ВалютаСтатьи,
	|	ВТ_Приход.СтатьяДДС КАК СтатьяДДС,
	|	ВТ_Приход.Сумма КАК Сумма,
	|	2 КАК Порядок,
	|	NULL КАК ВходящийОстатокСумма,
	|	ВТ_Приход.Ссылка КАК Ссылка,
	|	ВТ_Приход.Организация КАК Организация,
	|	ВТ_Приход.Офис КАК Офис,
	|	ВТ_Приход.Инициатор КАК Инициатор,
	|	ВТ_Приход.Валюта КАК Валюта,
	|	ВТ_Приход.Контрагент КАК Контрагент,
	|	ВТ_Приход.Договор КАК Договор,
	|	ВТ_Приход.ПриложениеКДоговору КАК ПриложениеКДоговору
	|ПОМЕСТИТЬ ВТ_Финал
	|ИЗ
	|	ВТ_Приход КАК ВТ_Приход
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Расход.Период,
	|	ВЫБОР
	|		КОГДА &Язык = ЗНАЧЕНИЕ(Справочник.CW_Языки.ru)
	|			ТОГДА ""Расход""
	|		ИНАЧЕ ""Expense""
	|	КОНЕЦ,
	|	ВТ_Расход.ВалютаСтатьи,
	|	ВТ_Расход.СтатьяДДС,
	|	ВТ_Расход.Сумма,
	|	3,
	|	NULL,
	|	ВТ_Расход.Ссылка,
	|	ВТ_Расход.Организация,
	|	ВТ_Расход.Офис,
	|	ВТ_Расход.Инициатор,
	|	ВТ_Расход.Валюта,
	|	ВТ_Расход.Контрагент,
	|	ВТ_Расход.Договор,
	|	ВТ_Расход.ПриложениеКДоговору
	|ИЗ
	|	ВТ_Расход КАК ВТ_Расход
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Оборот.Период,
	|	ВЫБОР
	|		КОГДА &Язык = ЗНАЧЕНИЕ(Справочник.CW_Языки.ru)
	|			ТОГДА ""Оборот""
	|		ИНАЧЕ ""Turnover""
	|	КОНЕЦ,
	|	ВТ_Оборот.ВалютаСтатьи,
	|	NULL,
	|	ВТ_Оборот.Сумма,
	|	4,
	|	NULL,
	|	ВТ_Оборот.Ссылка,
	|	ВТ_Оборот.Организация,
	|	ВТ_Оборот.Офис,
	|	ВТ_Оборот.Инициатор,
	|	ВТ_Оборот.Валюта,
	|	ВТ_Оборот.Контрагент,
	|	ВТ_Оборот.Договор,
	|	ВТ_Оборот.ПриложениеКДоговору
	|ИЗ
	|	ВТ_Оборот КАК ВТ_Оборот
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВходящийОстатокГрупп.Период,
	|	ВЫБОР
	|		КОГДА &Язык = ЗНАЧЕНИЕ(Справочник.CW_Языки.ru)
	|			ТОГДА ""Входящий остаток""
	|		ИНАЧЕ ""Incoming balance""
	|	КОНЕЦ,
	|	ВТ_ВходящийОстатокГрупп.ВалютаСтатьи,
	|	NULL,
	|	ВТ_ВходящийОстатокГрупп.Сумма,
	|	1,
	|	ВТ_ВходящийОстатокГрупп.ВходящийОстатокСумма,
	|	NULL,
	|	ВТ_ВходящийОстатокГрупп.Организация,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ВходящийОстатокГрупп КАК ВТ_ВходящийОстатокГрупп
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ИходящийОстатокГрупп.Период,
	|	ВЫБОР
	|		КОГДА &Язык = ЗНАЧЕНИЕ(Справочник.CW_Языки.ru)
	|			ТОГДА ""Исходящий остаток""
	|		ИНАЧЕ ""Outgoing balance""
	|	КОНЕЦ,
	|	ВТ_ИходящийОстатокГрупп.ВалютаСтатьи,
	|	NULL,
	|	ВТ_ИходящийОстатокГрупп.Сумма,
	|	5,
	|	ВТ_ИходящийОстатокГрупп.ВходящийОстатокСумма,
	|	NULL,
	|	ВТ_ИходящийОстатокГрупп.Организация,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТ_ИходящийОстатокГрупп КАК ВТ_ИходящийОстатокГрупп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Финал.Период КАК Период,
	|	ВТ_Финал.Группировка КАК Группировка,
	|	ВТ_Финал.СтатьяДДС КАК СтатьяДДС,
	|	ЕСТЬNULL(ВТ_Финал.Сумма, 0) КАК Сумма,
	|	ВТ_Финал.Порядок КАК Порядок,
	|	ВТ_Финал.Организация КАК Организация,
	|	ВТ_Финал.ВалютаСтатьи КАК ВалютаСтатьи,
	|	&Детализация КАК Детализация,
	|	&Язык КАК Язык,
	|	ВТ_Переводы.СтатьяДДСПердставление КАК СтатьяДДСПердставление,
	|	ВТ_Финал.ВходящийОстатокСумма КАК ВходящийОстатокСумма,
	|	ВТ_Финал.Ссылка КАК ЗаявкаНаРасход,
	|	ВТ_Финал.Офис КАК Офис,
	|	ВТ_Финал.Инициатор КАК Инициатор,
	|	ВТ_Финал.Валюта КАК Валюта,
	|	ВТ_Финал.Контрагент КАК Контрагент,
	|	ВТ_Финал.Договор КАК Договор,
	|	ВТ_Финал.ПриложениеКДоговору КАК ПриложениеКДоговору
	|ИЗ
	|	ВТ_Финал КАК ВТ_Финал
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Переводы КАК ВТ_Переводы
	|		ПО ВТ_Финал.СтатьяДДС = ВТ_Переводы.СтатьяДДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("ТаблицаПериодов",		ТаблицаПериодов(Настройки.Период, Настройки.Детализация));
	Запрос.УстановитьПараметр("ВалютаОтчета", 			Настройки.ВалютаОтчета);
	Запрос.УстановитьПараметр("ВходящийОстатокРежим",	Настройки.ВходящийОстатокРежим);
	Запрос.УстановитьПараметр("ВходящийОстатокСумма",	Настройки.ВходящийОстатокСумма);
	Запрос.УстановитьПараметр("ДатаКурса",				Настройки.ДатаКурса);
	Запрос.УстановитьПараметр("ДатаНачала",				Настройки.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 			Настройки.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Детализация",			Настройки.Детализация);
	Запрос.УстановитьПараметр("Сценарий",				Настройки.Сценарий);
	Запрос.УстановитьПараметр("Язык",					Настройки.Язык);  
	Запрос.УстановитьПараметр("ДатаСреза",				ТекущаяДата());  
	Запрос.УстановитьПараметр("Статус",					Настройки.Статус);  
	
	
	Данные = Запрос.Выполнить().Выгрузить();
	
	Возврат Данные;

КонецФункции

Функция ТаблицаПериодов(Период, Детализация)
     
     тзИнтервалов = Новый ТаблицаЗначений;
     тзИнтервалов.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
     
     Запрос = Новый Запрос;
     Запрос.Текст = "ВЫБРАТЬ
     |   НАЧАЛОПЕРИОДА(&НачДата, День) КАК НачИнтервала
     |УПОРЯДОЧИТЬ ПО
     |   НачИнтервала
     |ИТОГИ ПО
     |   НачИнтервала ПЕРИОДАМИ("+Детализация+", &НачДата, &КонДата)";

     Запрос.УстановитьПараметр("НачДата", Период.ДатаНачала);
     Запрос.УстановитьПараметр("КонДата", Период.ДатаОкончания);
     
     Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НачИнтервала", "ВСЕ");
     Пока Выборка.Следующий() Цикл
         НоваяСтрока = тзИнтервалов.Добавить();
         НоваяСтрока.Период = Выборка.НачИнтервала;
     КонецЦикла;
     
     Возврат тзИнтервалов
     
 КонецФункции
 
 #КонецЕсли