#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 					= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 				= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 				= CW_ПодключаемыеКомандыСервер.ВидОбработкиФормаПараметра();

	СтруктураОписания.Наименование 				= "Пример внешней формы группового редактирования параметров";
	СтруктураОписания.Описание 					= "Пример внешней формы группового редактирования параметров";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	СтруктураОписания.Настройка 		= Истина;

	// Формы
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыОбъекта(СтруктураОписания, 			"Форма");  
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыНастроекОбъекта(СтруктураОписания, 	"ФормаНастроек");  

	Возврат СтруктураОписания;
	
КонецФункции

//Функция Использование(АдресОбъекта) Экспорт
//Параметры
// - АдресОбъекта - адрес во временном хранилище, в котором содержится структура с ключами: 
//			Ссылка - Объект формы;
//			ПараметрыГрузоперевозки - таблица значений параметров грузопереовзки
//
//СтруктурВозврата - тип "Структура"
//- "РежимОткрытия" тип число:
//		0 - Открыть форму внешней обработки;
//		1 - Открыть форму редактирования параметра;
//		3 - Отказ от открытия;
//- "ТолькоПросмотр" 	- тип "булево";
Функция Использование(АдресОбъекта) Экспорт
	
	РежимОткрытия 				= 0;
	ФлагМножественногоВыбора 	= Неопределено;
	РежимТолькоПросмотр 		= Ложь;
	
	Если ЭтоАдресВременногоХранилища(АдресОбъекта) тогда
		СтруктураОбъекта = ПолучитьИзВременногоХранилища(АдресОбъекта);
	КонецЕсли;
	Если  ЗначениеЗаполнено(ПодключаемыйОбъект) Тогда
		Настройки = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъект);
		Если (Настройки <> Неопределено) Тогда
			Если Настройки.Свойство("ФлагМножественногоВыбора") Тогда
				ФлагМножественногоВыбора = Настройки.ФлагМножественногоВыбора;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ФлагМножественногоВыбора <> Неопределено Тогда
		Если СтруктураОбъекта <> Неопределено Тогда
			ИмяТабличнойЧасти 			= CW_Мониторинг.ТабличнаяЧастьПараметровОбъекта(СтруктураОбъекта);
			НайденнаяСтрока = СтруктураОбъекта[ИмяТабличнойЧасти].Найти(ФлагМножественногоВыбора, "Параметр"); 
			Если НайденнаяСтрока <> Неопределено Тогда
				РежимОткрытия = ?(НайденнаяСтрока.Значение, 0, 1);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураНеобходимостиОткрытия = Новый Структура;
	СтруктураНеобходимостиОткрытия.Вставить("РежимОткрытия" , РежимОткрытия);
	СтруктураНеобходимостиОткрытия.Вставить("ТолькоПросмотр", РежимТолькоПросмотр);
	
	Возврат СтруктураНеобходимостиОткрытия;
	
КонецФункции


  

#КонецЕсли