
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СоответствиеОстатков = ПолучитьОстаткиПоДокументам(ПараметрКоманды);
	
	Количество = 1;
	Для Каждого Ссылка из ПараметрКоманды Цикл
		
		РассчитатьПлановуюДатуОплатыНаСервере(Ссылка, СоответствиеОстатков);
		
		Прогрес 	= 100/ПараметрКоманды.Количество() * Количество;
		Пояснение	= Строка(Ссылка);
		
		Состояние("Установка плановой даты оплаты", Прогрес, Пояснение);
		
		Количество = Количество + 1;
	КонецЦикла;
	
	Состояние("Установка плановой даты оплаты", 100, "Заершено");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаткиПоДокументам(мСсылки)
	
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОперативнаяКредиторскаяЗадолженность.Счет КАК Счет,
	               |	ОперативнаяКредиторскаяЗадолженность.Всего_ВалютаОстаток КАК Всего_ВалютаОстаток
	               |ИЗ
	               |	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Остатки(&ДатаСреза, Счет В (&мСсылки)) КАК ОперативнаяКредиторскаяЗадолженность
	               |ГДЕ
	               |	ОперативнаяКредиторскаяЗадолженность.Всего_ВалютаОстаток <> 0";
	
	Запрос.УстановитьПараметр("ДатаСреза", 	ТекущаяДата());
	Запрос.УстановитьПараметр("мСсылки", 	мСсылки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Счет);
	КонецЦикла;
		
	Возврат Соответствие;
	
КонецФункции

&НаСервере
Процедура РассчитатьПлановуюДатуОплатыНаСервере(ПараметрКоманды, СоответствиеОстатков)
	
	Если ПараметрКоманды.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ПлатежныйКалендарь 	= CW_Настройки.ПараметрУчетнойПолитики(ПараметрКоманды.Дата, ПараметрКоманды.Организация, "ПлатежныйКалендарь");
	Если Не ЗначениеЗаполнено(ПлатежныйКалендарь)  Тогда
		Возврат;
	КонецЕсли;
	
	ПлановаяДата 		= CW_Документы.ПолучитьПлановыйСрокОплаты(ПараметрКоманды, ПлатежныйКалендарь, СоответствиеОстатков);
	Если ПлановаяДата = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("Счет", 			ПараметрКоманды);
	СтруктураПараметров.Вставить("ПлановаяДата", 	ПлановаяДата);
	СтруктураПараметров.Вставить("Описание", 		"");
	
	РегистрыСведений.CW_ПланОплатыВходящихСчетов.ЗаписатьПланОплатыДокумента(СтруктураПараметров);

КонецПроцедуры
