&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользованиеБюджетирования 			= ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования");
	ИсключатьВнутрихолдинговыеВзаиморасчеты = CW_Настройки.ПолучитьНастройкуПользователя(,"ИсключатьВнутрихолдинговыеВзаиморасчеты");
	
	// параметры
	//Период.Вариант=ВариантСтандартногоПериода.ЭтотГод;
	ВерсияБюджета=Справочники.CW_ВерсииБюджетов.Основная;
	
	// показатели
	Показатели.Добавить("Сумма",,Истина);
	Показатели.Добавить("НДС",,Истина);
	Показатели.Добавить("Всего",,Истина);
	
	// разделы
	Разделы.Добавить("План",,Истина);	
	Разделы.Добавить("Факт",,Истина);
	Разделы.Добавить("Отклонение",,Истина);	
		
	// группировки
	Нстр = Группировки.Добавить();
	Нстр.ИмяПоля = "Грузоперевозка.Клиент";
	Нстр.Представление = "Клиент";
	Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
	// --- 
	Нстр = Группировки.Добавить();
	Нстр.ИмяПоля = "Грузоперевозка";
	Нстр.Представление = "Грузоперевозка";
	Нстр.Сортировка = Перечисления.CW_НаправлениеСортировки.ПоВозрастанию;
	
	СписокВыбора = ПолучитьСписокПолейДляОтбораПоИнтервалу();
	Элементы.ДатаОпределенияПрибыли.СписокВыбора.Очистить();
	Для каждого Стр Из СписокВыбора Цикл
		
		Элементы.ДатаОпределенияПрибыли.СписокВыбора.Добавить(Стр.Значение,Стр.Представление,,Стр.Картинка);
		
	КонецЦикла; 
	
	_ВосстановитьСеансовуюНастройку();
	
	Если НЕ ИспользованиеБюджетирования Тогда
		
		Элементы.ВерсияБюджета.Видимость = Ложь;
		
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если СформироватьПриОткрытии Тогда
		СформироватьПриОткрытии=Ложь;
		СформироватьОтчет();
	Иначе
		_ВосстановитьСтандартныеНастройки();
		_ВосстановитьСеансовуюНастройку();
	КонецЕсли; 
	
	// период по умолчанию
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяДата());
		КонецПериода  = КонецМесяца(ТекущаяДата());
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;		
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_АнализПрибылиПоМесяцам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	// --- 
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("Показатели",Показатели);
			Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования")) Тогда
				СеансоваяНастройка.Свойство("Разделы", Разделы);
				Если Разделы.Количество() = 1 Тогда
					Разделы.Вставить(0, "План", , Ложь);
					Разделы.Добавить("Отклонение", , Ложь);
				КонецЕсли;	
				СеансоваяНастройка.Свойство("ВерсияБюджета",ВерсияБюджета);
				Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
					ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
				КонецЕсли;	
			Иначе
				Разделы.Очистить();
				Разделы.Добавить("Факт",,Истина);
				Элементы.ВерсияБюджета.Видимость = Ложь;
			КонецЕсли;	
			СеансоваяНастройка.Свойство("ВариантФормирования",ВариантФормирования);
			СеансоваяНастройка.Свойство("ВыводитьРасходыДоходы",ВыводитьРасходыДоходы);
			СеансоваяНастройка.Свойство("ДатаОпределенияПрибыли",ДатаОпределенияПрибыли);
			Если НЕ ЗначениеЗаполнено(ДатаОпределенияПрибыли) Тогда
				ДатаОпределенияПрибыли = Элементы.ДатаОпределенияПрибыли.СписокВыбора.НайтиПоЗначению("Реквизит.ДатаЗакрытия");
			КонецЕсли;		
			СеансоваяНастройка.Свойство("Организация",Организация);
			СеансоваяНастройка.Свойство("ПорядокОтражения",ПорядокОтражения);
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	// --- 
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Показатели",Показатели);
	СтруктураНастройки.Вставить("Разделы",Разделы);
	СтруктураНастройки.Вставить("Группировки",Группировки.Выгрузить());
	СтруктураНастройки.Вставить("ВариантФормирования",ВариантФормирования);
	СтруктураНастройки.Вставить("ВерсияБюджета",ВерсияБюджета);
	СтруктураНастройки.Вставить("ВыводитьРасходыДоходы",ВыводитьРасходыДоходы);
	СтруктураНастройки.Вставить("ДатаОпределенияПрибыли",ДатаОпределенияПрибыли);
	СтруктураНастройки.Вставить("Организация",Организация);
	СтруктураНастройки.Вставить("ПорядокОтражения",ПорядокОтражения);
	// --- 
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _УправлениеЭлементамиФормы()
	// --- 
	
	Если (ИспользованиеБюджетирования) Тогда
		
		ЕстьПлан = Ложь;
		Для каждого Стр Из Разделы Цикл
			
			Если ((Стр.Значение = "План" ИЛИ Стр.Значение = "Отклонение") И Стр.Пометка) Тогда
				
				ЕстьПлан = Истина;
				Прервать;
				
			КонецЕсли; 
			
		КонецЦикла; 
		Элементы.ВерсияБюджета.Видимость = ЕстьПлан;
		
	КонецЕсли; 
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура Сформировать(Команда)
	
	_Настройка(Истина);
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	// --- 
	
	Раздел = Ложь;
	Для Каждого Стр из Разделы Цикл
		Раздел = ?(Стр.Пометка, Истина, Раздел);
	КонецЦикла;
	Если НЕ Раздел Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного раздела!");
		Возврат;		
	КонецЕсли;	
	
	Показатель = Ложь;
	Для Каждого Стр из Показатели Цикл
		Показатель = ?(Стр.Пометка, Истина, Показатель);
	КонецЦикла;
	Если НЕ Показатель Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного показателя!");
		Возврат;		
	КонецЕсли;	
	
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	ОбработатьОтчет();
	
	// --- 
	_СохранитьСеансовуюНастройку();
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	// --- 
	
	Настройки = _сф.ст_Создать("ВариантФормирования,НачалоПериода,КонецПериода,ВерсияБюджета,Организация,ВыводитьРасходыДоходы,ДатаОпределенияПрибыли,Показатели,Разделы,Группировки,ИсключатьВнутрихолдинговыеВзаиморасчеты,ПорядокОтражения");
	Настройки.ВариантФормирования = ВариантФормирования;
	Настройки.ВыводитьРасходыДоходы = ВыводитьРасходыДоходы;
	Настройки.НачалоПериода = НачалоПериода;
	Настройки.КонецПериода = КонецПериода;
	Настройки.ВерсияБюджета = ВерсияБюджета;
	Настройки.Организация = Организация;
	Настройки.Показатели = Показатели;
	Настройки.Разделы = Разделы;
	Настройки.Группировки = Группировки.Выгрузить();
	Настройки.ДатаОпределенияПрибыли=ДатаОпределенияПрибыли;
	Настройки.ИсключатьВнутрихолдинговыеВзаиморасчеты = ИсключатьВнутрихолдинговыеВзаиморасчеты;
	Настройки.ПорядокОтражения = ПорядокОтражения;
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки,ЭтаФорма.УникальныйИдентификатор));
	
	// --- 
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "0:00:00", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "23:59:59", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "План", "План", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Факт", "Факт", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Отклонение", "Отклонение", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Расходы", "Расходы", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Доходы", "Доходы", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Прибыль", "Прибыль", ГоризонтальноеПоложение.Центр);	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сумма", "Сумма", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "НДС", "НДС", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Всего", "Всего", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(Результат,"Анализ прибыли по месяцам");
	//УправлениеКолонтитулами
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть=Ложь)
	// --- 
	
	Если Скрыть Тогда
		
		Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка=Ложь;
		
	Иначе
		
		Если Элементы.ГруппаНастройкиОтчета.Видимость Тогда
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка=Ложь;
			
		Иначе
			
			Элементы.ГруппаНастройкиОтчета.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка=Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
		
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПолучитьСписокДоступныхГруппировок()
	// --- 
	
	//Возврат(_сф.сп_ОтобратьПоПометке(СписокГруппировок,Ложь));
	
	// --- 
КонецФункции

&НаКлиенте
Процедура ГруппировкиПередУдалением(Элемент, Отказ)
	
	//УдаляемаяСтрока = Группировки.НайтиПоИдентификатору(Элементы.Группировки.ТекущаяСтрока);
	//Стр = СписокГруппировок.НайтиПоЗначению(УдаляемаяСтрока.ИмяПоля);
	//Если Стр <> Неопределено Тогда
	//	Стр.Пометка = Ложь;	
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда
		//СписокПолей.Добавить("Регистратор");
		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
    СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	// ---------------------------------------------------------------------------- 
	
    ДоступныеДействия = Новый Массив();
    ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
    
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных=РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция ПолучитьСписокПолейДляОтбораПоИнтервалу() Экспорт 

	сз = Новый СписокЗначений;
	сз.Добавить("Реквизит.ДатаСделкиФ", "Дата грузоперевозки", , БиблиотекаКартинок.CW_Грузоперевозки);
	сз.Добавить("Реквизит.ДатаЗакрытия", "Дата блокировки", , БиблиотекаКартинок.CW_Грузоперевозки);
			
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	CW_ПараметрыГрузоперевозок.Ссылка,
		|	CW_ПараметрыГрузоперевозок.Наименование,
		|	CW_ПараметрыГрузоперевозок.ТипЗначения,
		|	CW_ПараметрыГрузоперевозок.Код
		|ИЗ
		|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
		|ГДЕ
		|	НЕ CW_ПараметрыГрузоперевозок.ЭтоГруппа"
	);
	рз = з.Выполнить();
	выб = рз.Выбрать();
	Пока выб.Следующий() Цикл
		Если выб.ТипЗначения.СодержитТип(Тип("Дата")) Тогда // выб.ТипЗначения это ОписаниеТипов, а не тип
			сз.Добавить(выб.Код,"" + выб.Наименование, , БиблиотекаКартинок.CW_КонтрольныеДаты);
		КонецЕсли;
	КонецЦикла;
	
	Возврат сз;

КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Период;
	Диалог.Период.ДатаНачала = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПериод <> Неопределено) Тогда
		НачалоПериода = НачалоДня(ОтветПериод.ДатаНачала);
		КонецПериода  = КонецДня(ОтветПериод.ДатаОкончания);
		Период = ОтветПериод;
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ВерсияБюджетаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
		ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьБазовуюВерсиюБюджета()
	
	Возврат ?(ЗначениеЗаполнено(Константы.CW_БазоваяВерсияБюджета.Получить()), Константы.CW_БазоваяВерсияБюджета.Получить(), Справочники.CW_ВерсииБюджетов.Основная);
	
КонецФункции

&НаКлиенте
Процедура ДатаОпределенияПрибылиПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ДатаОпределенияПрибыли) Тогда
		ДатаОпределенияПрибыли = Элементы.ДатаОпределенияПрибыли.СписокВыбора.НайтиПоЗначению("Реквизит.ДатаЗакрытия");
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("Показатели",Показатели);
	Настройки.ДополнительныеСвойства.Вставить("Разделы",Разделы);
	//Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки.Выгрузить());
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); // ДанныеФормыКоллекция
	//Настройки.ДополнительныеСвойства.Вставить("НачалоПериода",НачалоПериода);
	//Настройки.ДополнительныеСвойства.Вставить("КонецПериода",КонецПериода);
	Настройки.ДополнительныеСвойства.Вставить("ВерсияБюджета",ВерсияБюджета);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьРасходыДоходы",ВыводитьРасходыДоходы);
	Настройки.ДополнительныеСвойства.Вставить("ДатаОпределенияПрибыли",ДатаОпределенияПрибыли);
	Настройки.ДополнительныеСвойства.Вставить("Организация",Организация);
	Настройки.ДополнительныеСвойства.Вставить("ИсключатьВнутрихолдинговыеВзаиморасчеты",ИсключатьВнутрихолдинговыеВзаиморасчеты);
	Настройки.ДополнительныеСвойства.Вставить("ПорядокОтражения",ПорядокОтражения);
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если НЕ СформироватьПриОткрытии Тогда
		
		CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
		
		Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования") Тогда
			Если Разделы.Количество() = 1 Тогда
				Разделы.Вставить(0, "План", , Ложь);
				Разделы.Добавить("Отклонение", , Ложь);
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
				ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
			КонецЕсли;	
		Иначе
			Разделы.Очистить();
			Разделы.Добавить("Факт",,Истина);
			Элементы.ВерсияБюджета.Видимость = Ложь;
			ВерсияБюджета = Неопределено;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ДатаОпределенияПрибыли) Тогда
			ДатаОпределенияПрибыли = Элементы.ДатаОпределенияПрибыли.СписокВыбора.НайтиПоЗначению("Реквизит.ДатаЗакрытия");
		КонецЕсли;		
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Очистить();
	Настройки.ДополнительныеСвойства.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры
