#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета		= ПолучитьИзВременногоХранилища(АдресНастроек);
	СвойстваДокументов 	= ПолучитьСвойстваДокументов(); 
	
	СвойстваДокумента	= СвойстваДокументов.Получить(ТипЗнч(НастройкиОтчета.Документ));
	Если СвойстваДокумента = Неопределено Тогда
		ВызватьИсключение "Неправильный тип документа!";	
	КонецЕсли;

	ДатаКурсаДокумента	= ПолучитьДатуКурсаПоДокументу(НастройкиОтчета.Документ, СвойстваДокумента);
	ПоляЗапросов 		= ПолучитьПоляЗапросов(НастройкиОтчета, СвойстваДокумента.ВидСтатьи);
	
	ЭтоАкт 	= НастройкиОтчета.Документ[СвойстваДокумента.Акт];
	ЭтоСчет = НастройкиОтчета.Документ[СвойстваДокумента.Счет];  
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;   
	
	Запрос.УстановитьПараметр("Организация", НастройкиОтчета.Организация);
	
	//Данные документа
	Запрос.Текст = "ВЫБРАТЬ
	|	ОборотПоРегистратору.Грузоперевозка КАК Грузоперевозка,
	|	ОборотПоРегистратору.Номенклатура КАК Номенклатура,";
	
	Для Каждого КлючЗначение из ПоляЗапросов.ПоляДокументов ЦИкл
		Запрос.Текст = Запрос.Текст + "
		|ОборотПоРегистратору."+КлючЗначение.Ключ+" КАК "+КлючЗначение.Значение+",";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|	ОборотПоРегистратору.Всего_ВалютаОборот КАК ВсегоПоДокументу
	|ПОМЕСТИТЬ ВТ_ДвиженияДокумента
	|ИЗ
	|	РегистрНакопления."+СвойстваДокумента.ИмяРегистра+".Обороты(, , Регистратор, ) КАК ОборотПоРегистратору
	|ГДЕ
	|	ОборотПоРегистратору.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", НастройкиОтчета.Документ); 
	
	Запрос.Выполнить();  
	//---Данные документа    
	
	//Остальные документы
	Запрос.Текст = "ВЫБРАТЬ
	|	ОборотПоРегистратору.Период КАК Период,
	|	ОборотПоРегистратору.Регистратор КАК Регистратор,
	|	ОборотПоРегистратору.Валюта КАК РегистраторВалюта,
	|	ОборотПоРегистратору.Грузоперевозка КАК Грузоперевозка,
	|	ОборотПоРегистратору.Номенклатура КАК Номенклатура,";
	
	Для Каждого КлючЗначение из ПоляЗапросов.ПоляДокументов ЦИкл
		Запрос.Текст = Запрос.Текст + "
		|ОборотПоРегистратору."+КлючЗначение.Ключ+" КАК "+КлючЗначение.Значение+",";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|	ОборотПоРегистратору.Всего_ВалютаОборот КАК ВсегоВалюта,
	|	ОборотПоРегистратору.ВсегоОборот КАК ВсегоРуб,
	|	0 КАК ВсегоПоДругимДокументам
	|ИЗ
	|	РегистрНакопления."+СвойстваДокумента.ИмяРегистра+".Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Грузоперевозка В
	|					(ВЫБРАТЬ
	|						ВТ_ДвиженияДокумента.Грузоперевозка КАК Грузоперевозка
	|					ИЗ
	|						ВТ_ДвиженияДокумента КАК ВТ_ДвиженияДокумента)
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_ДвиженияДокумента.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_ДвиженияДокумента КАК ВТ_ДвиженияДокумента)";
	
	Для Каждого КлючЗначение из ПоляЗапросов.ПоляДокументов Цикл
		Запрос.Текст = Запрос.Текст + "
		|				И "+КлючЗначение.Ключ+" В
		|					(ВЫБРАТЬ
		|						ВТ_ДвиженияДокумента."+КлючЗначение.Ключ+" КАК "+КлючЗначение.Ключ+"
		|					ИЗ
		|						ВТ_ДвиженияДокумента КАК ВТ_ДвиженияДокумента)"
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|) КАК ОборотПоРегистратору
	|ГДЕ
	|	ОборотПоРегистратору.Регистратор <> &Регистратор
	|	И ОборотПоРегистратору.Регистратор.Организация = &Организация
	|	//ЭтоАкт
	|	//ЭтоСчет";
	
	Если ЭтоАкт Тогда    
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ЭтоАкт", "И ОборотПоРегистратору.ЭтоАкт = ИСТИНА");	
	ИначеЕсли ЭтоСчет Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ЭтоСчет", "И ОборотПоРегистратору.ЭтоСчет = ИСТИНА");	
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ЭтоАкт", "И ОборотПоРегистратору.ЭтоАкт = ЛОЖЬ");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ЭтоСчет", "И ОборотПоРегистратору.ЭтоСчет = ЛОЖЬ");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Регистратор", 	НастройкиОтчета.Документ); 
	Запрос.УстановитьПараметр("ЭтоСчет", 		ЭтоСчет); 
	Запрос.УстановитьПараметр("ЭтоАкт", 		ЭтоАкт);  
	
	ТаблицаПоДругимДокументам = Запрос.Выполнить().Выгрузить(); 
	Для Каждого СтрокаТаблицы из ТаблицаПоДругимДокументам Цикл  
		СвойстваРегистратора	= СвойстваДокументов.Получить(ТипЗнч(СтрокаТаблицы.Регистратор));
		Если СвойстваРегистратора = Неопределено Тогда 
			СтрокаТаблицы.ВсегоПоДругимДокументам = СтрокаТаблицы.ВсегоВалюта;	
			Продолжить;	
		КонецЕсли;  
		
		Если СтрокаТаблицы.РегистраторВалюта = НастройкиОтчета.ВалютаДокумента Тогда
			СтрокаТаблицы.ВсегоПоДругимДокументам = СтрокаТаблицы.ВсегоВалюта;	
			Продолжить;	
		КонецЕсли;
		
		ДатаКурсаРегистратора 	= ПолучитьДатуКурсаПоДокументу(СтрокаТаблицы.Регистратор, СвойстваРегистратора);
		КурсРегистратора		= CW_Финансы.ПолучитьКурсВалюты(НастройкиОтчета.ВалютаДокумента, ДатаКурсаРегистратора);   
		
		СтрокаТаблицы.ВсегоПоДругимДокументам = Окр(СтрокаТаблицы.ВсегоРуб / КурсРегистратора.Курс / КурсРегистратора.Кратность, 2);
	КонецЦикла;

	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаПоДругимДокументам.Грузоперевозка,
	|	ТаблицаПоДругимДокументам.Номенклатура,";

	Для Каждого КлючЗначение из ПоляЗапросов.ПоляДокументов ЦИкл
		Запрос.Текст = Запрос.Текст + "
		|ТаблицаПоДругимДокументам."+КлючЗначение.Ключ+" КАК "+КлючЗначение.Значение+",";
	КонецЦикла;

	Запрос.Текст = Запрос.Текст + "
	|	ТаблицаПоДругимДокументам.ВсегоПоДругимДокументам
	|	ПОМЕСТИТЬ ВТ_ДвиженияДругихДокументов
	|ИЗ
	|	&ТаблицаПоДругимДокументам КАК ТаблицаПоДругимДокументам";
	
	Запрос.УстановитьПараметр("ТаблицаПоДругимДокументам", ТаблицаПоДругимДокументам);
	Запрос.Выполнить(); 
	//Остальные документы
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("ПорядокОтраженияДоходов",  "ПорядокОтражения");
	Соответствие.Вставить("ПорядокОтраженияРасходов", "ПорядокОтражения");

	//Данные бюджета
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеБюджета.Ссылка КАК СтатьяБюджета,
	|	ДанныеБюджета.Владелец КАК Грузоперевозка,
	|	ДанныеБюджета.Номенклатура КАК Номенклатура,";
	
	Для Каждого КлючЗначение из ПоляЗапросов.ПоляБюджета ЦИкл
		Запрос.Текст = Запрос.Текст + "
		|ДанныеБюджета."+КлючЗначение.Ключ+" КАК "+КлючЗначение.Значение+",";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|	СУММА(ДанныеБюджета.СуммаВсего) КАК СуммаВсего
	|ПОМЕСТИТЬ ВТ_ДанныеБюджета
	|ИЗ
	|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК ДанныеБюджета
	|ГДЕ
	|	ДанныеБюджета.Организация = &Организация
	|	И ДанныеБюджета.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ_ДвиженияДокумента.Грузоперевозка КАК Грузоперевозка
	|			ИЗ
	|				ВТ_ДвиженияДокумента КАК ВТ_ДвиженияДокумента)
	|	И ДанныеБюджета.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТ_ДвиженияДокумента.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ВТ_ДвиженияДокумента КАК ВТ_ДвиженияДокумента)";

	
	Для Каждого КлючЗначение из ПоляЗапросов.ПоляБюджета Цикл
		
		ИмяПоляРегистра = Соответствие.Получить(КлючЗначение.Ключ);
		ИмяПоляРегистра = ?(ИмяПоляРегистра=Неопределено, КлючЗначение.Ключ, ИмяПоляРегистра);  
		
		Запрос.Текст = Запрос.Текст + "
		|				И "+КлючЗначение.Ключ+" В
		|					(ВЫБРАТЬ
		|						ВТ_ДвиженияДокумента."+ИмяПоляРегистра+" КАК "+ИмяПоляРегистра+"
		|					ИЗ
		|						ВТ_ДвиженияДокумента КАК ВТ_ДвиженияДокумента)"
		
	КонецЦикла;
	
	
	Запрос.Текст = Запрос.Текст + "
	|	И ДанныеБюджета.ВидСтатьиПланирования = &ВидСтатьиПланирования
	|
	|СГРУППИРОВАТЬ ПО";
	
	Для Каждого КлючЗначение из ПоляЗапросов.ПоляБюджета ЦИкл
		Запрос.Текст = Запрос.Текст + "
		|ДанныеБюджета."+КлючЗначение.Ключ+ ",";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|	ДанныеБюджета.Ссылка";
	
	Запрос.УстановитьПараметр("ВидСтатьиПланирования", СвойстваДокумента.ВидСтатьи);
	
	Запрос.Выполнить(); 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ДанныеБюджета.СтатьяБюджета КАК СтатьяБюджета,
	|	ВТ_ДанныеБюджета.Грузоперевозка КАК Грузоперевозка,
	|	ВТ_ДанныеБюджета.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеБюджета.СуммаВсего КАК СуммаВсего,
	|	ВТ_ДанныеБюджета.СтатьяБюджета.КонтрольнаяДатаКурсаДляПроверки КАК КонтрольнаяДатаКурса,
	|	ВТ_ДанныеБюджета.СтатьяБюджета.Валюта КАК Валюта,
	|	ВТ_ДанныеБюджета.СтатьяБюджета.ТипКурсаВалюты КАК ТипКурсаВалюты,
	|	ВТ_ДанныеБюджета.СтатьяБюджета.Кратность КАК Кратность,
	|	ВТ_ДанныеБюджета.СтатьяБюджета.Курс КАК Курс,
	|	ВТ_ДанныеБюджета.Грузоперевозка.ДатаСделкиФ КАК ДатаГрузоперевозки,
	|	0 КАК ВсегоПоБюджету
	|ИЗ
	|	ВТ_ДанныеБюджета КАК ВТ_ДанныеБюджета";
	
	ДанныеБюджета = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы из ДанныеБюджета Цикл   
		
		ДатаКурса = ДатаКурсаДокумента;
		
		Если СтрокаТаблицы.ТипКурсаВалюты = 2 Тогда
			ДанныеКурса = CW_Бюджетирование.ПолучитьДатуКурсаПлановойСтатьи(
				СтрокаТаблицы.Грузоперевозка, 
				СтрокаТаблицы.КонтрольнаяДатаКурса, 
				СтрокаТаблицы.ДатаГрузоперевозки);  
			
			ДатаКурса = ДанныеКурса.Дата;		
		КонецЕсли;
		
		Если СтрокаТаблицы.ТипКурсаВалюты = 1 Тогда 
			ДанныеКурса = Новый Структура;
			ДанныеКурса.Вставить("Курс", 		СтрокаТаблицы.Курс);
			ДанныеКурса.Вставить("Кратность", 	СтрокаТаблицы.Кратность);
		Иначе
			ДанныеКурса = CW_Финансы.ПолучитьКурсВалюты(СтрокаТаблицы.Валюта, ДатаКурса);  
		КонецЕсли;
		
		ВсегоПоБюджетуРуб = Окр(СтрокаТаблицы.СуммаВсего * ДанныеКурса.Курс / ДанныеКурса.Кратность, 2);
		
		СтрокаТаблицы.ВсегоПоБюджету = Окр(ВсегоПоБюджетуРуб / НастройкиОтчета.КурсДокумента, 2);	
	КонецЦикла;
	
	Запрос.Текст = "УНИЧТОЖИТЬ ВТ_ДанныеБюджета";
	Запрос.Выполнить(); 

	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеБюджета.Грузоперевозка,
	|	ДанныеБюджета.Номенклатура,
	|	0,
	|	0,
	|	ДанныеБюджета.ВсегоПоБюджету
	|	ПОМЕСТИТЬ ВТ_ДанныеБюджета
	|ИЗ
	|	&ДанныеБюджета КАК ДанныеБюджета";
	
	Запрос.УстановитьПараметр("ДанныеБюджета", ДанныеБюджета);
	Запрос.Выполнить(); 
	//---Данные бюджета    
	
	//Сборка таблицы
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ДвиженияДокумента.Грузоперевозка КАК Грузоперевозка,
	|	ВТ_ДвиженияДокумента.Номенклатура КАК Номенклатура,
	|	ВТ_ДвиженияДокумента.ВсегоПоДокументу КАК ВсегоПоДокументу,
	|	0 КАК ВсегоПоДругимДокументам,
	|	0 КАК ВсегоПоБюджету
	|ПОМЕСТИТЬ ВТ_ВременнаяТаблица
	|ИЗ
	|	ВТ_ДвиженияДокумента КАК ВТ_ДвиженияДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДвиженияДругихДокументов.Грузоперевозка,
	|	ВТ_ДвиженияДругихДокументов.Номенклатура,
	|	0,
	|	ВТ_ДвиженияДругихДокументов.ВсегоПоДругимДокументам,
	|	0
	|ИЗ
	|	ВТ_ДвиженияДругихДокументов КАК ВТ_ДвиженияДругихДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДанныеБюджета.Грузоперевозка,
	|	ВТ_ДанныеБюджета.Номенклатура,
	|	0,
	|	0,
	|	ВТ_ДанныеБюджета.ВсегоПоБюджету
	|ИЗ
	|	ВТ_ДанныеБюджета КАК ВТ_ДанныеБюджета";
	
	Запрос.Выполнить();
	//---Сборка таблицы
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_ВременнаяТаблица.Грузоперевозка КАК Грузоперевозка,
	|	ВТ_ВременнаяТаблица.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_ВременнаяТаблица.ВсегоПоДокументу) КАК ВсегоПоДокументу,
	|	СУММА(ВТ_ВременнаяТаблица.ВсегоПоДругимДокументам) КАК ВсегоПоДругимДокументам,
	|	СУММА(ВТ_ВременнаяТаблица.ВсегоПоБюджету) КАК ВсегоПоБюджету
	|ИЗ
	|	ВТ_ВременнаяТаблица КАК ВТ_ВременнаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВременнаяТаблица.Номенклатура,
	|	ВТ_ВременнаяТаблица.Грузоперевозка";
	
	РезультатПроверки = Запрос.Выполнить().Выгрузить();
	
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	КомпоновщикНастроек.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок",		ВРег(МетаданныеОтчета.Синоним));
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Документ",		НастройкиОтчета.Документ);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Контрагент",		НастройкиОтчета.Документ.Контрагент);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Валюта",			НастройкиОтчета.Документ.Валюта);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВерсияБюджета",	НастройкиОтчета.ВерсияБюджета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	ВнешнийНабор = Новый Структура("РезультатПроверки", РезультатПроверки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешнийНабор, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ПолучитьПоляЗапросов(Знач НастройкиОтчета, Знач ВидСтатьиПланирования)
	
	ПоляДокументов	= Новый Соответствие; 
	ПоляБюджета 	= Новый Соответствие;   
	
	Если НастройкиОтчета.УчитыватьКонтрагента Тогда
		ПоляДокументов.Вставить("Контрагент","Контрагент");	
		ПоляБюджета.Вставить("Контрагент", "Контрагент");	
	КонецЕсли;
	
	Если НастройкиОтчета.УчитыватьПорядокОтражения Тогда
		ПоляДокументов.Вставить("ПорядокОтражения","ПорядокОтражения");	
		Если ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Доходы Тогда
			ПоляБюджета.Вставить("ПорядокОтраженияДоходов", "ПорядокОтражения");	
		КонецЕсли;
		Если ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Расходы Тогда
			ПоляБюджета.Вставить("ПорядокОтраженияРасходов", "ПорядокОтражения");	
		КонецЕсли;
	КонецЕсли;   
	
	Если НастройкиОтчета.УчитыватьСтавкуНДС Тогда
		ПоляДокументов.Вставить("СтавкаНДС","СтавкаНДС");	
		ПоляБюджета.Вставить("СтавкаНДС","СтавкаНДС");	
	КонецЕсли;   
	
	Если НастройкиОтчета.УчитыватьВалюту Тогда
		ПоляДокументов.Вставить("Валюта","Валюта");	
		ПоляБюджета.Вставить("Валюта","Валюта");	
	КонецЕсли;    
	
	Поля = Новый Структура;
	Поля.Вставить("ПоляДокументов", ПоляДокументов);
	Поля.Вставить("ПоляБюджета", 	ПоляБюджета);
	
	Возврат Поля; 
	
КонецФункции   

Функция ПолучитьСвойстваДокументов() 
	
	Расходы = Новый Структура;
	Расходы.Вставить("Акт", 		"ПредъявленАкт");
	Расходы.Вставить("Счет", 		"ПредъявленСчет");
	Расходы.Вставить("ИмяРегистра",	"CW_РасходыПоГрузоперевозкам");
	Расходы.Вставить("ВидСтатьи",	Перечисления.CW_ВидыСтатейПланирования.Расходы);
	
	Доходы = Новый Структура;   	
	Доходы.Вставить("Акт", 			"ФормируетсяАкт");
	Доходы.Вставить("Счет", 		"ФормируетсяСчет");   
	Доходы.Вставить("ИмяРегистра",	"CW_ДоходыПоГрузоперевозкам");
	Доходы.Вставить("ВидСтатьи",	Перечисления.CW_ВидыСтатейПланирования.Доходы);
	
	Соответствие = Новый Соответствие;    
	Соответствие.Вставить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"), Расходы);
	Соответствие.Вставить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"), 	Доходы);
	
	Возврат Соответствие;

КонецФункции

Функция ПолучитьДатуКурсаПоДокументу(Документ, СвойстваДокумента) 
	
	Если Документ[СвойстваДокумента.Акт] Тогда
		Возврат Документ.ДатаАкта;
	КонецЕсли; 
	
	Если Документ[СвойстваДокумента.Счет] Тогда
		Возврат Документ.ДатаСчета;
	КонецЕсли;  
	
	Возврат Документ.Дата;
	
КонецФункции
 #КонецЕсли