//см.CW_ОбновлениеКонфигурацииСервер.ПриДобавленииОбработчиков()
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт  
	
	//НачальноеЗаполнение
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_ДоходыНерезидентовСлужебный.ОбновитьИменаРаздела";  
	НоваяСтрока.Версия 				= "8.3.1.5";
	НоваяСтрока.ИмяПодсистемы 		= "CW_ДоходыНерезидентов";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 3;
	НоваяСтрока.Наименование		= "Заполнение имен ячеек для предопределенных элементов";
	НоваяСтрока.Комментарий			= "Выполняет заполнение имен ячеек плана видов характеристик ""Ячейки раздела"" для предопределенных элементов";   

	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_ДоходыНерезидентовСлужебный.ОбновитьПредопределенныеФункции";  
	НоваяСтрока.Версия 				= "8.3.1.5";
	НоваяСтрока.ИмяПодсистемы 		= "CW_ДоходыНерезидентов";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 3;
	НоваяСтрока.Наименование		= "Заполнение свойств предопределенных функций заполнения ячеек раздела";
	НоваяСтрока.Комментарий			= "Выполняет заполнение свойст предопределенных функций заполнения раздела отчета";       
	
	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_ДоходыНерезидентовСлужебный.ПодключитьИсториюДляОбъектовПодсистемы";  
	НоваяСтрока.Версия 				= "8.3.1.16";
	НоваяСтрока.ИмяПодсистемы 		= "CW_ДоходыНерезидентов";
	НоваяСтрока.НачальноеЗаполнение	= Истина;
	НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 1;
	НоваяСтрока.Наименование		= "Подключение истории объетов";
	НоваяСтрока.Комментарий			= "Выполняет подключение истории объектов";   
	//---НачальноеЗаполнение
	
КонецПроцедуры


//НачальноеЗаполнение
Процедура ОбновитьИменаРаздела(АдресРезультата=Неопределено) Экспорт
	
	ПланыВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела.ОбновитьИменаЯчееекРаздела("2023Кв4");
	
КонецПроцедуры   

Процедура ОбновитьПредопределенныеФункции(АдресРезультата=Неопределено) Экспорт
	
	Справочники.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.ЗаполнитьПредопределенныеФункции();
	
КонецПроцедуры

Процедура ПодключитьИсториюДляОбъектовПодсистемы(АдресРезультата=Неопределено) Экспорт
	
	МассивИменМетаданных = Новый Массив;
	МассивИменМетаданных.Добавить("Справочник.CW_ДоходыНерезидентовСведенияОДоходах");
	МассивИменМетаданных.Добавить("Справочник.CW_ДоходыНерезидентовСоответствиеЗаполненияСтрок");
	МассивИменМетаданных.Добавить("Справочник.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета");
	МассивИменМетаданных.Добавить("Справочник.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета");
	МассивИменМетаданных.Добавить("ПланВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела");
	
	Для Каждого ИмяМетаданного из МассивИменМетаданных Цикл
		СсылкаНаМетаданное  		= CW_Обмены_ПИ.МетаданноеКонфигурации(ИмяМетаданного);
		
		ОбъектМетаданоеКонфигурации = СсылкаНаМетаданное.ПолучитьОбъект();
		ОбъектМетаданоеКонфигурации.ДляИсторииОбъектов = Истина;  
		ОбъектМетаданоеКонфигурации.Записать();
	КонецЦикла;
	
КонецПроцедуры  
//---НачальноеЗаполнение

