
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ДоступенВыводНаАнглийскомЯзыке Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПредставлениеEN"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ЗаголовокНовойЗаявкиEN"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СоставЗаявки.ЗаголовокПоляEN"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ГруппыПараметров.ИмяГруппыEN"));
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Если РазрешеноПрикреплятьФайлы и ТипыФайлов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен список типов выгружаемых файлов",,"РазрешеноПрикреплятьФайлы", "Объект", Отказ);
	КонецЕсли;   
	
КонецПроцедуры
