
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивГП = CW_Бюджетирование._ПолучитьМассивГрузоперевозокДляДобавленияПриРедактированииИзЗаказа(Параметры.Отбор);
	КоличествоОтмеченныхГП = 0;
	
	Для каждого ГП Из МассивГП Цикл
		
		Нстр = Грузоперевозки.Добавить();
		Нстр.Грузоперевозка	 = ГП;      
		Нстр.ТипПеревозки	 = ГП.ТипПеревозки;      
		Нстр.ПометкаУдаления = ГП.ПометкаУдаления;
		Нстр.Пометка = (НЕ Нстр.ПометкаУдаления);
		Если (Нстр.Пометка) Тогда
			_сф.Инкремент(КоличествоОтмеченныхГП);			
		КонецЕсли; 
		
	КонецЦикла; 
	Грузоперевозки.Сортировать("Грузоперевозка Возр");
	
	Если (Грузоперевозки.Количество() = 0) Тогда
		
		Отказ = Истина;
		
	КонецЕсли; 
	
	//сзГрузоперевозки.ЗагрузитьЗначения(масс);
	//Для каждого Стр Из сзГрузоперевозки Цикл
	//	Стр.Пометка = Истина;
	//КонецЦикла; 
	//
	//Если сзГрузоперевозки.Количество()=0 Тогда 
	//	Отказ = Истина;
	//КонецЕсли;
	
	Заказ = Параметры.Отбор.ЗаказСсылка;
	МассивГПЗаказа = CW_Мониторинг.ГрузоперевозкиЗаказа(Заказ);
	КоличествоГП = МассивГПЗаказа.Количество();
	// --- 
	КоличествоДоступныхГП = МассивГП.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	МассивПомеченныхНаУдаление = Новый Массив;
	
	масс = Новый Массив;
	Для Каждого эл Из Грузоперевозки Цикл
		Если эл.Пометка Тогда 
			масс.Добавить(эл.Грузоперевозка);
			Если (эл.ПометкаУдаления) Тогда
				МассивПомеченныхНаУдаление.Добавить(эл.Грузоперевозка);
			КонецЕсли; 	
		КонецЕсли;
	КонецЦикла;
	
	Если (МассивПомеченныхНаУдаление.Количество() = 0) Тогда
		
		Закрыть(масс);
		
	Иначе
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаПодтвержденияВыбораПомеченных",ЭтотОбъект, Новый Структура("МассивВыбранных",масс)); 
		ПоказатьВопрос(ПОВ,"Выбраны помеченные на удаление грузоперевозки. Продолжить?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодтвержденияВыбораПомеченных(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ = КодВозвратаДиалога.Да) Тогда
			
			Закрыть(ДополнительныеПараметры.МассивВыбранных);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура КомандаУстановитьПометки(Команда)
	
	//Для каждого Стр Из Элементы.Грузоперевозки.ВыделенныеСтроки Цикл
	//	
	//	СтрокаГП = Грузоперевозки.НайтиПоИдентификатору(Стр);
	//	
	//	СтрокаГП.Пометка = Истина;
	//	
	//КонецЦикла; 
	Для каждого СтрокаГП Из Грузоперевозки Цикл
		СтрокаГП.Пометка = Истина;
	КонецЦикла; 
	
	ОбновитьКоличествоОтмеченных();
	ОбновитьСтатистику();
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьПометки(Команда)
	
	//Для каждого Стр Из Элементы.Грузоперевозки.ВыделенныеСтроки Цикл
	//	
	//	СтрокаГП = Грузоперевозки.НайтиПоИдентификатору(Стр);
	//	
	//	СтрокаГП.Пометка = Ложь;
	//	
	//КонецЦикла;
	Для каждого СтрокаГП Из Грузоперевозки Цикл
		СтрокаГП.Пометка = Ложь;
	КонецЦикла;
	
	ОбновитьКоличествоОтмеченных();
	ОбновитьСтатистику();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСтатистику();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатистику()
	// --- 
	
	Элементы.Статистика.Заголовок = "Грузоперевозки: "+Формат(КоличествоОтмеченныхГП,"ЧДЦ=; ЧН=") +"/"+Формат(КоличествоДоступныхГП,"ЧДЦ=; ЧН=");
	Если (КоличествоДоступныхГП <> КоличествоГП) Тогда
		Элементы.Статистика.Заголовок = Элементы.Статистика.Заголовок + " (всего по заказу "+Формат(КоличествоГП,"ЧДЦ=; ЧН=")+")";
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиПометкаПриИзменении(Элемент)
	
	ОбновитьКоличествоОтмеченных();
	ОбновитьСтатистику();
	
КонецПроцедуры
  
&НаКлиенте
Процедура ОбновитьКоличествоОтмеченных()
	// --- 
	
	КоличествоОтмеченныхГП = 0;
	Для каждого Элемент Из Грузоперевозки Цикл
		
		Если (Элемент.Пометка) Тогда
			КоличествоОтмеченныхГП = КоличествоОтмеченныхГП+1;
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
  
