
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьИННАдреса();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Объект.Отправитель и Не Объект.Получатель Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо установить хотябы один флаг!",,"Отправитель","Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры    
 
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьИННАдреса();
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  
	
	КонтрагентПриИзмененииНаСервере(); 

КонецПроцедуры   

&НаСервере
Процедура УстановитьДоступностьИННАдреса()  
	
	Элементы.ГруппаИННАдерсОбъекта.Видимость 		= Не ЗначениеЗаполнено(Объект.Контрагент);
 	Элементы.ГруппаИННАдерсКонтрагента.Видимость 	= ЗначениеЗаполнено(Объект.Контрагент);
  
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	КонтрагентПриИзмененииНаСервере(); 

	УстановитьРеквизитыОбъекта();
	
	УстановитьДоступностьИННАдреса();

КонецПроцедуры

&НаСервере
Процедура УстановитьРеквизитыОбъекта()
	
	Если Объект.Контрагент.Пустая() Тогда
		Объект.Страна = Страна;
		Объект.Город = Город;
		Объект.ИНН = ИНН;
		Объект.ЮридическийАдрес = ЮридическийАдрес;
		Объект.ЮридическоеФизическоеЛицо = ЮридическоеФизическоеЛицо;
	КонецЕсли;
	
КонецПроцедуры  



&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()   
	
	Если Объект.Контрагент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
   	СведенияОКонтрагенте = CW_БухгалтерияЭкспедитораСервер.СведенияОЮрФизЛице(Объект.Контрагент,  ТекущаяДата());   
	
	ИНН 						= СведенияОКонтрагенте.ИНН; 
    ЮридическоеФизическоеЛицо 	= СведенияОКонтрагенте.ЮридическоеФизическоеЛицо;  
	Страна 						= Объект.Контрагент.СтранаРегистрации; 
	
	Если Не ПустаяСтрока(СведенияОКонтрагенте.ЗначениеJSONЮридическийАдрес) Тогда
		СтруктураАдреса = CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СведенияОКонтрагенте.ЗначениеJSONЮридическийАдрес);
		
		ЮридическийАдрес 	= СтруктураАдреса.value;
		
		Если  СтруктураАдреса.Свойство("city") Тогда
			Город = СтруктураАдреса.city;
		ИначеЕсли СтруктураАдреса.Свойство("area") Тогда
			Город = СтруктураАдреса.area;
		КонецЕсли;    
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПеревод(Команда)    

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ЮридическийАдрес");
	
КонецПроцедуры

&НаКлиенте
Процедура ГородПеревод(Команда)     

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "Город");
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПеревод(Команда)   
	
	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ПолноеНаименование");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоДляСвязиПеревод(Команда)
	
	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "КонтактноеЛицоДляСвязи");
	
КонецПроцедуры

&НаКлиенте
Процедура СпособСвязиСКонтактнымЛицомПеревод(Команда)
	
	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "СпособСвязиСКонтактнымЛицом");
	
КонецПроцедуры

  