// Заполняет основные сведения о библиотеке или основной конфигурации.
// 
// Параметры:
//  Описание - Структура:
//
//   * Имя                 - Строка - имя подсисетмы, например, "CW_БухгалтерияЭкспедитора".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
Процедура ПриДобавленииПодсистем(ОписаниеПодсистем) Экспорт

	ОписаниеПодсистем.Вставить("CW_ЭлектронныйОбменДанными", "8.3.1.7");

КонецПроцедуры  

Процедура ПолучитьШаблоныТекстовHTTPЗапросов(Результат) Экспорт
	
	Результат.Вставить("AFEx_checkinn",				"/%1/hs/AFExchange/checkinn");  
	Результат.Вставить("AFEx_changeorganization",	"/%1/hs/AFExchange/changeorganization");  
	
	Результат.Вставить("AFEx_suppliersdocument", 	"/%1/hs/AFExchange/suppliersdocument");
	
КонецПроцедуры  

Функция ПолучитьСписокЗарезервированныхПолей() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Грузоперевозка");
	Массив.Добавить("Номенклатура");
	Массив.Добавить("Представление");
	Массив.Добавить("Количество");
	Массив.Добавить("Цена");
	Массив.Добавить("Сумма");
	Массив.Добавить("СтавкаНДС");
	Массив.Добавить("НДС");    
	Массив.Добавить("Всего");    
	
	Возврат Массив;
	
КонецФункции