&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//1.
	МониторинговыйПараметр = Константы.CW_РеестрыНДС0МониторинговыйПараметрПриложения.Получить(); 
	
	//2.
	ПолучитьСписокТиповПеревозок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// Вставить содержимое обработчика.
КонецПроцедуры

 
//1. Создать парамтер
&НаКлиенте
Процедура УстановитьПараметр(Команда)
	СоздатьПараметрНаСервере();
КонецПроцедуры 

&НаСервере
Процедура СоздатьПараметрНаСервере()
	
	МониторинговыйПараметр = CW_РеестрыНДС0Сервер.ВыполнитьНастройкиМониторинговыхПарамтеров();
	
КонецПроцедуры


//2. Заполнить парамтер в тип перевозки  
&НаСервере
Процедура ПолучитьСписокТиповПеревозок()  
	
	
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ТипыПеревозок.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА CW_ТипыПеревозокПараметрыГрузоперевозки.Ссылка ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Пометка
	               |ИЗ
	               |	Справочник.CW_ТипыПеревозок КАК CW_ТипыПеревозок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CW_ТипыПеревозок.ПараметрыГрузоперевозки КАК CW_ТипыПеревозокПараметрыГрузоперевозки
	               |		ПО CW_ТипыПеревозок.Ссылка = CW_ТипыПеревозокПараметрыГрузоперевозки.Ссылка
	               |			И (CW_ТипыПеревозокПараметрыГрузоперевозки.Параметр = &МониторинговыйПараметр)
	               |ГДЕ
	               |	CW_ТипыПеревозок.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ТипыПеревозок.ЭтоГруппа = ЛОЖЬ";   
	
	Запрос.УстановитьПараметр("МониторинговыйПараметр", МониторинговыйПараметр);  
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокТиповПеревозок.Добавить(Выборка.Ссылка,,Выборка.Пометка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрВТипыПеревозок(Команда) 
	
	ЗаполнитьПараметрВТипыПеревозокНаСервере();
	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьПараметрВТипыПеревозокНаСервере()  
	
	Для Каждого ЭлементСписка из СписокТиповПеревозок Цикл       
		Если ЭлементСписка.Пометка = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементСписка.Значение.ПараметрыГрузоперевозки.Найти(МониторинговыйПараметр, "Параметр") <> Неопределено Тогда
			//Параметр уже есть
			Продолжить;
		КонецЕсли; 
		
		ТипПеревозкиОбъект = ЭлементСписка.Значение.ПолучитьОбъект();
		НоваяСтрока = ТипПеревозкиОбъект.ПараметрыГрузоперевозки.Добавить();
		НоваяСтрока.Параметр = МониторинговыйПараметр;
		ТипПеревозкиОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

 //3. Работа с таблицей  
&НаКлиенте
Процедура КомандаЗаполнить(Команда)  
	
	Если не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПеревозкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПеревозкиНаСервере()
	
	мПорядокОтражения = Новый Массив;
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыПоГрузоперевозкамОбороты.Грузоперевозка КАК Грузоперевозка,
	               |	СУММА(CW_ДоходыПоГрузоперевозкамОбороты.ВсегоОборот) КАК СуммаРеализации
	               |ПОМЕСТИТЬ ВТ_Доходы
	               |ИЗ
	               |	РегистрНакопления.CW_ДоходыПоГрузоперевозкам.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Период,
	               |			ДокументДоходов.Организация = &Организация
	               |				И ДокументДоходов.ФормируетсяАкт
	               |				И ДокументДоходов.ФормируетсяСчетФактура
	               |				И СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	               |				И ПорядокОтражения В (&мПорядокОтражения)
	               |				И (ДокументДоходов.ВедомыйДокумент <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	               |					ИЛИ ДокументДоходов.ВедомыйДокументКорректировки <> ЗНАЧЕНИЕ(Документ.КорректировкаРеализации.ПустаяСсылка))) КАК CW_ДоходыПоГрузоперевозкамОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ДоходыПоГрузоперевозкамОбороты.Грузоперевозка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_Доходы.Грузоперевозка КАК Грузоперевозка,
	               |	ВТ_Доходы.Грузоперевозка.ТипПеревозки КАК ТипПеревозки,
	               |	ЕСТЬNULL(CW_ХарактеристикиГрузоперевозок.Параметр, НЕОПРЕДЕЛЕНО) КАК Параметр,
	               |	ЕСТЬNULL(CW_ХарактеристикиГрузоперевозок.Значение, НЕОПРЕДЕЛЕНО) КАК ЗнаначениеПараметра
	               |ИЗ
	               |	ВТ_Доходы КАК ВТ_Доходы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
	               |		ПО ВТ_Доходы.Грузоперевозка = CW_ХарактеристикиГрузоперевозок.Грузоперевозка
	               |			И (CW_ХарактеристикиГрузоперевозок.Параметр = &Параметр)";
	
	Запрос.УстановитьПараметр("НачалоПериода", 		ПериодОбработки.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", 		Новый Граница(ПериодОбработки.ДатаОкончания, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация",  		Организация);    
	Запрос.УстановитьПараметр("мПорядокОтражения",  мПорядокОтражения);    
	Запрос.УстановитьПараметр("Параметр",  			МониторинговыйПараметр);    
	
	РезультатлвЗапроса = Запрос.Выполнить();
	
	ТаблицаПеревозок.Очистить();
	
	Выборка = РезультатлвЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаПеревозок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПеревозокЗнаначениеПараметраПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаПеревозок.ТекущиеДанные;
	ТекущиеДанные.Флаг = ЗначениеЗаполнено(ТекущиеДанные.ЗнаначениеПараметра);	
	
КонецПроцедуры
 
 &НаКлиенте
Процедура УстановитьЗначениеДляВыделенныхСтрок(Команда)
	
	Список = Новый СписокЗначений;
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.ЖД"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.АВТО"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.АВИА"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.МОРЕ"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.ЖДПредоставление"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.АВИАТранзит"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.ЖДТранзит"));
	
	ВыделенныеСтроки = Элементы.ТаблицаПеревозок.ВыделенныеСтроки;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);

	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборЗначения", ЭтотОбъект, ДополнительныеПараметры);
	
	Список.ПоказатьВыборЭлемента(Оповещение);
	
КонецПроцедуры  

&наКлиенте
Процедура ЗавершитьВыборЗначения(ЭлементСписка, ДополнительныеПараметры) Экспорт
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	Конецесли; 
	
	УстанвоитьЗначениеНаСервере(ЭлементСписка.Значение, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура УстанвоитьЗначениеНаСервере(Приложение, ДополнительныеПараметры)    
	
	Для Каждого ИдентификаторСтроки из ДополнительныеПараметры.ВыделенныеСтроки Цикл
		СтрокаТаблицы = ТаблицаПеревозок.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаТаблицы.ЗнаначениеПараметра = Приложение;
		СтрокаТаблицы.Флаг = ЗначениеЗаполнено(СтрокаТаблицы.ЗнаначениеПараметра);	
	КонецЦикла;    


КонецПроцедуры

&НаКлиенте
Процедура УстанвоитьЗначениеПоТипуПеревозки(Команда)   
	
	ТипыПеревозокСписокДляВыборы = ПолучитьСписокТиповПеревозокДляВыбора();

	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборТипПеревозкиЗначения", ЭтотОбъект);
	ТипыПеревозокСписокДляВыборы.ПоказатьВыборЭлемента(Оповещение);
	
КонецПроцедуры  

&наКлиенте
Процедура ЗавершитьВыборТипПеревозкиЗначения(ЭлементСписка, ДополнительныеПараметры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	Конецесли;        
	
	Список = Новый СписокЗначений;
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.ЖД"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.АВТО"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.АВИА"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.МОРЕ"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.ЖДПредоставление"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.АВИАТранзит"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.CW_РеестрыНДС0Приложения.ЖДТранзит"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТипПеревозки", ЭлементСписка.Значение);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборЗначенияДляТипаПеревозки", ЭтотОбъект, ДополнительныеПараметры);
	
	Список.ПоказатьВыборЭлемента(Оповещение);
	
	
КонецПроцедуры   

&наКлиенте
Процедура ЗавершитьВыборЗначенияДляТипаПеревозки(ЭлементСписка, ДополнительныеПараметры) Экспорт
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	Конецесли; 
	
	УстанвоитьЗначениеДляТипаПеревозкиНаСервере(ЭлементСписка.Значение, ДополнительныеПараметры.ТипПеревозки);
	
КонецПроцедуры

&НаСервере
Процедура УстанвоитьЗначениеДляТипаПеревозкиНаСервере(Приложение, ТипПеревозки) 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипПеревозки", ТипПеревозки);
	
	мСтроки = ТаблицаПеревозок.НайтиСтроки(Отбор);
	Для Каждого СтрокаТаблицы из мСтроки Цикл
		СтрокаТаблицы.ЗнаначениеПараметра 	= Приложение;
		СтрокаТаблицы.Флаг 					= Истина;	
	КонецЦикла;    

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТиповПеревозокДляВыбора()   
	
	СписокЗначений = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка из СписокТиповПеревозок Цикл
		Если ЭлементСписка.Пометка Тогда
			СписокЗначений.Добавить(ЭлементСписка.Значение);	
		КонецЕсли;
	КонецЦикла;  
	
	Возврат СписокЗначений;
	
КонецФункции

 &НаКлиенте
Процедура ЗаписатьПеревозки(Команда)    
	
	Отбор = Новый Структура("Флаг", Истина);
	мСтроки = ТаблицаПеревозок.НайтиСтроки(Отбор);
	НомерСтроки = 1;
	Для Каждого СтрокаТаблицы из мСтроки Цикл    
		ЗаписатьПеревозкиНаСервере(СтрокаТаблицы.Грузоперевозка, СтрокаТаблицы.ЗнаначениеПараметра);    
		
		Прогесс = НомерСтроки / мСтроки.Количество() * 100; 
		
		Состояние(СокрЛП(СтрокаТаблицы.Грузоперевозка), Прогесс, "Запись");
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПеревозкиНаСервере(Грузоперевозка,ЗнаначениеПараметра)
	
	ПеревозкаОбъект = Грузоперевозка.ПолучитьОбъект();
	
	НайденнаяСтрока = ПеревозкаОбъект.ПараметрыГрузоперевозки.Найти(МониторинговыйПараметр, "Параметр"); 
	Если НайденнаяСтрока = Неопределено Тогда
		НайденнаяСтрока = ПеревозкаОбъект.ПараметрыГрузоперевозки.Добавить();  
		НайденнаяСтрока.Параметр = МониторинговыйПараметр;
	КонецЕсли;                                        
	
	НайденнаяСтрока.Значение = ЗнаначениеПараметра;  
	
	ПеревозкаОбъект.ОбменДанными.Загрузка = истина;
	ПеревозкаОбъект.Записать(); 
	
	ЗаписатьМониторинговыеПараметрыВРегистр(Грузоперевозка, ЗнаначениеПараметра)
	
КонецПроцедуры   

Процедура ЗаписатьМониторинговыеПараметрыВРегистр(Грузоперевозка, ЗнаначениеПараметра) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.CW_ХарактеристикиГрузоперевозок.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Грузоперевозка 	= Грузоперевозка;
	ЗаписьРегистра.Параметр 		= МониторинговыйПараметр;
	ЗаписьРегистра.Прочитать();
	
	ЗаписьРегистра.Грузоперевозка 	= Грузоперевозка;
	ЗаписьРегистра.Параметр 		= МониторинговыйПараметр;
	ЗаписьРегистра.Значение 		= ЗнаначениеПараметра;
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры // ЗаписатьМониторинговыеПараметрыВРегистр()



&НаКлиенте
Процедура МониторинговыйПараметрПриИзменении(Элемент)
	МониторинговыйПараметрПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МониторинговыйПараметрПриИзмененииНаСервере()
	
	Константы.CW_РеестрыНДС0МониторинговыйПараметрПриложения.Установить(МониторинговыйПараметр);
	
КонецПроцедуры