
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	УправлениеФормой();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	ПодключаемаяОбработка =  Объект.ПорядокРасчета = ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ПодключаемаяОбработка");
	
	Элементы.ПодключаемаяОбработка.Видимость		= ПодключаемаяОбработка;
	Элементы.ГруппаСпособРасчета.Видимость 			= НЕ ПодключаемаяОбработка;
	
	//Элементы.ПорядокРасчета.Доступность 		= Не Объект.Предопределенный;
	//Элементы.ГруппаСпособРасчета.Доступность 	= Не Объект.Предопределенный;
	
	Элементы.ПроизводственныйКалендарь.Видимость 	= Объект.СпособРасчетаОтсрочки = 1 
													ИЛИ (Объект.СпособРасчетаОтсрочки = 0 и Объект.ВариантПереносаДаты > 0)
													И НЕ ПодключаемаяОбработка;
													
	Элементы.ВариантПереносаДаты.Видимость 			= Объект.СпособРасчетаОтсрочки = 0 и НЕ ПодключаемаяОбработка;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокРасчетаПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры


&НаСервере
Процедура СпособРасчетаОтсрочкиПриИзмененииНаСервере()
	
	Элементы.ПроизводственныйКалендарь.Видимость 	= Объект.СпособРасчетаОтсрочки = 1 
													ИЛИ (Объект.СпособРасчетаОтсрочки = 0 и Объект.ВариантПереносаДаты > 0);
													
	Элементы.ВариантПереносаДаты.Видимость 			= Объект.СпособРасчетаОтсрочки = 0;
	
	Если Объект.СпособРасчетаОтсрочки = 1 Тогда
		Объект.ВариантПереносаДаты = 0;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПроизводственныйКалендарь) Тогда
		Если Не Константы.ИспользоватьНесколькоПроизводственныхКалендарей.Получить() Тогда
			Объект.ПроизводственныйКалендарь = ПолучитьЕдинственныйКалендарь();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЕдинственныйКалендарь()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПроизводственныеКалендари.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПроизводственныеКалендари КАК ПроизводственныеКалендари";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура СпособРасчетаОтсрочкиПриИзменении(Элемент)
	СпособРасчетаОтсрочкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВариантПереносаДатыПриИзменении(Элемент)
	
	Элементы.ПроизводственныйКалендарь.Видимость = Объект.СпособРасчетаОтсрочки = 1 
												ИЛИ (Объект.СпособРасчетаОтсрочки = 0 и Объект.ВариантПереносаДаты > 0);
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если Объект.ПорядокРасчета <> ПредопределенноеЗначение("Перечисление.CW_ПорядокРасчетаДляУсловияОплаты.ПодключаемаяОбработка")
		И Объект.СпособРасчетаОтсрочки = 1 
		И Не ЗначениеЗаполнено(Объект.ПроизводственныйКалендарь) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен производственный календарь",,"ПроизводственныйКалендарь", "Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти