//@skip-check bsl-legacy-check-string-literal

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ДокументОПредстоящейПоставке;
	УведомлениеОСпецрежимахНалогообложения.НачальныеОперацииПриСозданииНаСервере(ЭтотОбъект);
	УведомлениеОСпецрежимахНалогообложения.СформироватьСпискиВыбора(ЭтотОбъект, "СпискиВыбора2026_1");
	
	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗагрузитьДанные(Параметры.Ключ);
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ЗагрузитьДанные(Параметры.ЗначениеКопирования);
	ИначеЕсли Параметры.Свойство("ПредставлениеXML") Тогда 
		Параметры.Свойство("РегистрацияВНалоговомОргане", Объект.РегистрацияВИФНС);
		ЗагрузитьИзXMLНаСервере(Новый Структура("Организация, РегистрацияВНалоговомОргане, ПредставлениеXML", 
								Объект.Организация, Объект.РегистрацияВИФНС, Параметры.ПредставлениеXML));
	Иначе
		Объект.РегистрацияВИФНС = Документы.УведомлениеОСпецрежимахНалогообложения.РегистрацияВФНСОрганизации(Объект.Организация);
		СформироватьДеревоСтраниц();
		УведомлениеОСпецрежимахНалогообложения.СформироватьСтруктуруДанныхУведомленияНовогоОбразца(ЭтотОбъект);
		ЗаполнитьНачальныеДанные();
	КонецЕсли;
	
	Заголовок = УведомлениеОСпецрежимахНалогообложения.ДополнитьЗаголовокУведомления(Заголовок, Объект.Организация);
	УведомлениеОСпецрежимахНалогообложения.СпрятатьКнопкиВыгрузкиОтправкиУНеактуальныхФорм(ЭтотОбъект);
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ИнициализироватьВыводСтатусовИВажныхСообщений_85(ЭтотОбъект);
	ИдДляСвор = УведомлениеОСпецрежимахНалогообложенияСлужебный.ПолучитьИдентификаторыДляСворачивания(ЭтотОбъект);
	ЭтотОбъект["СворачиваемыеЭлементы"] = ПоместитьВоВременноеХранилище(ИдДляСвор);
	
	Разложение = СтрРазделить(ИмяФормы, ".");
	ПараметрыОтчета = Новый Структура("Организация", Объект.Организация);
	ПоказателиОтчета = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОПоказателяхОтчета(
		Разложение[1], Разложение[3], ПараметрыОтчета);
		
	ЭтотОбъект["СтруктураРеквизитовФормы"].Вставить("ИмяФормыПодбораОснований", "");
	
	Если ПоказателиОтчета = Неопределено Тогда
		Элементы.ФормаЗаполнить.Видимость = Ложь;
	ИначеЕсли ТипЗнч(ПоказателиОтчета) = Тип("Структура") Тогда
		ЭтотОбъект["СтруктураРеквизитовФормы"].Вставить("ИмяФормыПодбораОснований",
			ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПоказателиОтчета, "ИмяФормыПодбораОснований", ""));
		Элементы.ФормаЗаполнить.Видимость = (ПоказателиОтчета.Количество() > 0);
	КонецЕсли;
	
	ЭтотОбъект["СтруктураРеквизитовФормы"].Вставить("ДоступнаПодсистемаВалюты",
		ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Валюты"));
	ЭтотОбъект["СтруктураРеквизитовФормы"].Вставить("ПравоРегламентированнаяОтчетность",
		ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.РегламентированнаяОтчетность));
	Если Параметры.ЗаполнитьПриОткрытии И Параметры.ОснованияЗаполнения.Количество() > 0 Тогда 
		ЭтотОбъект["СтруктураРеквизитовФормы"].Вставить("ОснованияЗаполнения",
			ОбщегоНазначения.СкопироватьРекурсивно(Параметры.ОснованияЗаполнения));
	КонецЕсли;
	ЭтотОбъект["СтруктураРеквизитовФормы"].Вставить("ОснованиеЗаполнения", Неопределено);
	
	Если Элементы.ПредставлениеУведомления.ЧерноБелыйПросмотр = Истина Тогда
		ЗаполнениеСпискаРНПТ();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
	Оповестить(РегламентированнаяОтчетностьКлиент.ИмяСобытияЗаписьУведомления(),,Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтотОбъект, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УведомлениеОСпецрежимахНалогообложенияКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	Если ЭтотОбъект["СтруктураРеквизитовФормы"].Свойство("ОснованияЗаполнения") Тогда 
		ПодключитьОбработчикОжидания("ПриОткрытииЗавершение", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить(РегламентированнаяОтчетностьКлиент.ИмяСобытияЗаписьУведомления(), ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

#Область ИнтеграцияСОблачнойОтчетностью

	Если Параметр = ЭтотОбъект Тогда
		Если ИмяСобытия = "ПослеВыбораИсточникаДанныхДляОблака" Тогда
			ПослеВыбораИсточникаДанныхДляОблака();
		ИначеЕсли ИмяСобытия = "ПослеПолученияДанныхДляОблака" Тогда
			ПослеПолученияДанныхДляОблака();
		КонецЕсли;
	КонецЕсли;

#КонецОбласти
	Если ИмяСобытия = "УведомлениеОСпецрежимахНалогообложения_НавигацияПоОшибкам" Тогда 
		УведомлениеОСпецрежимахНалогообложенияКлиент.ОбработкаОповещенияНавигацииПоОшибкам(ЭтотОбъект, Параметр, Источник);
	КонецЕсли;
	Если РегламентированнаяОтчетностьКлиент.ЭтоСобытиеЗавершениеОтправки(ИмяСобытия) Тогда
		ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеУведомленияПриИзмененииСодержимогоОбласти(Элемент, Область)
	Если Область.Имя = "НДССт" Или Область.Имя = "АкцТвСт" Или Область.Имя = "АкцАдвСт"
		Или Область.Имя = "НДСБаза" Или Область.Имя = "АкцизТвБаза" Или Область.Имя = "АкцизАдвБаза" Тогда 
		
		РасчетСуммНалогов();
	ИначеЕсли Область.Имя = "КолТов" Тогда 
		КолТовПриИзменении(Область);
	ИначеЕсли Область.Имя = "КурсВалют" Тогда 
		КурсВалютПриИзменении(Область);
	Иначе
		УведомлениеОСпецрежимахНалогообложенияКлиент.ПриИзмененииСодержимогоОбласти(ЭтотОбъект, Область, Истина);
		Если Область.Имя = "ДАТА_ПОДПИСИ" Тогда
			Объект.ДатаПодписи = Область.Значение;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеУведомленияВыбор(Элемент, Область, СтандартнаяОбработка)
	Если Область.Имя = "ПодборПервичногоДокумента" Тогда 
		ПодборСданногоПервичногоДокумента();
	ИначеЕсли Область.Имя = "Пересчитать" Тогда 
		ПересчетСуммыОбеспечительногоПлатежа();
	ИначеЕсли Область.Имя = "МаркируемыйТовар" Тогда 
		Область.Значение = Не Область.Значение;
		СтандартнаяОбработка = Ложь;
		УведомлениеОСпецрежимахНалогообложенияКлиент.ПриИзмененииСодержимогоОбласти(ЭтотОбъект, Область, Истина);
	Иначе
		Если УведомлениеОСпецрежимахНалогообложенияКлиент.ТиповойВыбор(ЭтотОбъект, Область, СтандартнаяОбработка) Или ЭтотОбъект["РучнойВвод"] Тогда 
			Возврат;
		КонецЕсли;
		
		УведомлениеОСпецрежимахНалогообложенияКлиент.ПредставлениеУведомленияВыбор(
			ЭтотОбъект, Область, СтандартнаяОбработка, Истина, Истина, 
			?(ЭтотОбъект["СтруктураРеквизитовФормы"]["ДоступнаПодсистемаВалюты"] И Область.Имя = "КодВалют",
				Новый ОписаниеОповещения("ПредставлениеУведомленияВыборЗавершение", ЭтотОбъект), Неопределено));
		Если СтандартнаяОбработка Тогда 
			Если Область.Имя = "КодНО" Тогда 
				СтандартнаяОбработка = Ложь;
				РегламентированнаяОтчетностьКлиент.ОткрытьФормуВыбораРегистрацииВИФНС(ЭтотОбъект, Область.Имя);
			ИначеЕсли Область.Имя = "НДССт" И Не ЭтотОбъект["РучнойВвод"] Тогда
				СтандартнаяОбработка = Ложь;
				ВыборСтавкиНДС();
			ИначеЕсли СтандартнаяОбработка И ЭтоОбластьОКСМ(Область) Тогда
				УведомлениеОСпецрежимахНалогообложенияКлиент.ВыборКодаСтраныИзСправочника(ЭтотОбъект, Область, СтандартнаяОбработка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтотОбъект, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтотОбъект, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтотОбъект, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНаименованиеЭтапаНажатие(Элемент)
	
	ПараметрыИзменения = Новый Структура;
	ПараметрыИзменения.Вставить("Форма", ЭтотОбъект);
	ПараметрыИзменения.Вставить("Организация", Объект.Организация);
	ПараметрыИзменения.Вставить("КонтролирующийОрган",
		ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФНС"));
	ПараметрыИзменения.Вставить("ТекстВопроса", НСтр("ru='Вы уверены, что уведомление уже сдано?'"));
	
	РегламентированнаяОтчетностьКлиент.ИзменитьСтатусОтправки(ПараметрыИзменения);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеУведомленияПриАктивизацииОбласти(Элемент)
	Если ПредставлениеУведомления.ТекущаяОбласть <> Неопределено
		И ПредставлениеУведомления.ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда 
		Элементы.ПредставлениеУведомленияКонтекстноеМенюОчиститьОКСМ.Доступность = ЭтоОбластьОКСМ(ПредставлениеУведомления.ТекущаяОбласть);
	Иначе
		Элементы.ПредставлениеУведомленияКонтекстноеМенюОчиститьОКСМ.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоСтраниц

&НаКлиенте
Процедура ДеревоСтраницПриАктивизацииСтроки(Элемент)
	Если УведомлениеОСпецрежимахНалогообложенияКлиент.НеобходимоФормированиеТабличногоДокумента(ЭтотОбъект, Элемент, ЭтотОбъект["УИДПереключение"]) Тогда
		ОтключитьОбработчикОжидания("ДеревоСтраницПриАктивизацииСтрокиЗавершение");
		ПодключитьОбработчикОжидания("ДеревоСтраницПриАктивизацииСтрокиЗавершение", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСтраницНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Если Элемент.ТекущиеДанные.ИмяМакета <> "Товар_2026" И Элемент.ТекущиеДанные.Наименование <> "Товары" Тогда 
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСтраницПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	Если Строка = Неопределено Или Элементы.ДеревоСтраниц <> Элемент Тогда 
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
	
	ПредметПеретаскивания = ДеревоСтраниц.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
	НазначениеПеретаскивания = ДеревоСтраниц.НайтиПоИдентификатору(Строка);
	
	Если НазначениеПеретаскивания = Неопределено
		Или ПредметПеретаскивания.ПолучитьРодителя() = НазначениеПеретаскивания.ПолучитьРодителя()
		Или ПредметПеретаскивания.ПолучитьРодителя() = НазначениеПеретаскивания
		Или НазначениеПеретаскивания.Наименование <> "Товары" Тогда 
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСтраницПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	
	ПредметПеретаскивания = ДеревоСтраниц.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
	Если ПредметПеретаскивания.ИмяМакета = "Товар_2026" Тогда 
		ОбработкаПеретаскиванияТовара(ПараметрыПеретаскивания.Значение, Строка);
	ИначеЕсли ПредметПеретаскивания.Наименование = "Товары" Тогда
		ОбработкаПеретаскиванияГруппыТоваров(ПараметрыПеретаскивания.Значение, Строка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если ЗначениеЗаполнено(ЭтотОбъект["СтруктураРеквизитовФормы"]["ИмяФормыПодбораОснований"]) Тогда
		ОО = Новый ОписаниеОповещения("ЗаполнитьДаннымиДокументаПослеВыбора", ЭтотОбъект);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("Основание", Объект.Основание);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		ОткрытьФорму(ЭтотОбъект["СтруктураРеквизитовФормы"]["ИмяФормыПодбораОснований"],
			ПараметрыФормы, ЭтотОбъект, , , , ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе

		
#Область ИнтеграцияСОблачнойОтчетностью

		ЗаполнениеИзУчетнойБазы = Ложь;
		РегламентированнаяОтчетностьКлиентПереопределяемый.ПроверитьВозможностьЗаполненияИзУчетныхБаз(
			ИмяФормы, ЗаполнениеИзУчетнойБазы);
		Если ЗаполнениеИзУчетнойБазы Тогда
			Возврат;
		КонецЕсли;
		
#КонецОбласти

		РезультатВыполнения = ЗаполнитьАвтоНаСервере();
		Если НЕ РезультатВыполнения.ЗаданиеВыполнено Тогда
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьАвтоЗавершениеПослеЗаполнения", ЭтотОбъект);
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется заполнение по данным информационной базы'");
			ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьДанные();
	Оповестить(РегламентированнаяОтчетностьКлиент.ИмяСобытияЗаписьУведомления(),,Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьXML(Команда)
	
	ВыгружаемыеДанные = СформироватьXMLНаСервере(УникальныйИдентификатор);
	Если ВыгружаемыеДанные <> Неопределено Тогда 
		РегламентированнаяОтчетностьКлиент.ВыгрузитьФайлы(ВыгружаемыеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрган(Команда)
	
	РегламентированнаяОтчетностьКлиент.ПриНажатииНаКнопкуОтправкиВКонтролирующийОрган(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернете(Команда)
	
	РегламентированнаяОтчетностьКлиент.ПроверитьВИнтернете(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтотОбъект, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтотОбъект, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузку(Команда)
	УведомлениеОСпецрежимахНалогообложенияКлиент.ПроверитьВыгрузку(ЭтотОбъект, ПроверитьВыгрузкуНаСервере());
КонецПроцедуры

&НаКлиенте
Процедура РучнойВвод(Команда)
	УведомлениеОСпецрежимахНалогообложенияКлиент.ОбработкаРучнойВвод(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьВыгружатьСОшибками(Команда)
	УведомлениеОСпецрежимахНалогообложенияКлиент.ОбработкаРазрешитьВыгружатьСОшибками(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОКСМ(Команда)
	ПредставлениеУведомления.ТекущаяОбласть.Значение = Неопределено;
	УведомлениеОСпецрежимахНалогообложенияКлиент.ПриИзмененииСодержимогоОбласти(ЭтотОбъект, ПредставлениеУведомления.ТекущаяОбласть, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КопироватьСПодчиненными(Команда)
	УведомлениеОСпецрежимахНалогообложенияКлиент.ОбработкаКопироватьСПодчиненными(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьБРО(Команда)
	ПечатьБРОНаСервере();
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(
		ЭтотОбъект, "Открыть", Ложь, ЭтотОбъект["СтруктураРеквизитовУведомления"].СписокПечатаемыхЛистов);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнтеграцияСОблачнойОтчетностью

&НаКлиенте
Процедура ПослеВыбораИсточникаДанныхДляОблака()
	
	
	ЗаполнитьАвтоНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияДанныхДляОблака()
	
	
	ЗагрузитьПодготовленныеДанные();
	
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура ПриОткрытииЗавершение() Экспорт 
	ОснованияЗаполнения = Новый Массив;
	Для Каждого Элт Из ЭтотОбъект["СтруктураРеквизитовФормы"]["ОснованияЗаполнения"] Цикл 
		ОснованияЗаполнения.Добавить(Элт.Значение);
	КонецЦикла;
	ЗаполнитьДаннымиДокументаПослеВыбора(ОснованияЗаполнения, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДаннымиДокументаПослеВыбора(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = ЗаполнитьАвтоНаСервере(Результат);
	Если НЕ РезультатВыполнения.ЗаданиеВыполнено Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьАвтоЗавершениеПослеЗаполнения", ЭтотОбъект);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется заполнение по данным информационной базы'");
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммыОбеспечительногоПлатежа()
	СумОбПлат = 0;
	
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"].Договор Цикл 
		Договор = Элт.Значение;
		ПрСпецТов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Договор, "ПрСпецТов");
		Если ПрСпецТов = "1" Тогда 
			Для Каждого Элт1 Из ЭтотОбъект["ДанныеМногостраничныхРазделов"].Спецификация Цикл 
				Если Элт1.Значение.УИДРодителя <> Договор.УИД Тогда 
					Продолжить;
				КонецЕсли;
				
				Для Каждого Элт2 Из ЭтотОбъект["ДанныеМногостраничныхРазделов"].ТоварСпецификация Цикл 
					Товар = Элт2.Значение;
					Если Товар.УИДРодителя <> Элт1.Значение.УИД Тогда 
						Продолжить;
					КонецЕсли;
					
					Коэффициент = ?(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, "МаркируемыйТовар", Ложь), 0, 1);
					СумОбПлат = СумОбПлат + ЭтотОбъект["ОТЧ"].ПривестиЗначение(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, "СумНДС"))
						+ Коэффициент * ЭтотОбъект["ОТЧ"].ПривестиЗначение(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, "СумАкцизТв"))
						+ Коэффициент * ЭтотОбъект["ОТЧ"].ПривестиЗначение(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, "СумАкцизАдв"));
				КонецЦикла;
			КонецЦикла;
		ИначеЕсли ПрСпецТов = "2" Тогда 
			Для Каждого Элт2 Из ЭтотОбъект["ДанныеМногостраничныхРазделов"].ТоварДоговор Цикл 
				Товар = Элт2.Значение;
				Если Товар.УИДРодителя <> Договор.УИД Тогда 
					Продолжить;
				КонецЕсли;
				
				Коэффициент = ?(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, "МаркируемыйТовар", Ложь), 0, 1);
				СумОбПлат = СумОбПлат + ЭтотОбъект["ОТЧ"].ПривестиЗначение(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, "СумНДС"))
					+ Коэффициент * ЭтотОбъект["ОТЧ"].ПривестиЗначение(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, "СумАкцизТв"))
					+ Коэффициент * ЭтотОбъект["ОТЧ"].ПривестиЗначение(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, "СумАкцизАдв"));
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Область = ПредставлениеУведомления.Области.Найти("СумОбПлат");
	Область.Значение = СумОбПлат;
	УведомлениеОСпецрежимахНалогообложенияКлиент.ПриИзмененииСодержимогоОбласти(ЭтотОбъект, Область);
КонецПроцедуры

&НаКлиенте
Процедура ПодборСданногоПервичногоДокумента()
	ОО = Новый ОписаниеОповещения("ПодборСданногоПервичногоДокументаЗавершение", ЭтотОбъект, Неопределено);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Организация", Объект.Организация);
	ДополнительныеПараметры.Вставить("ЭтоРежимВыбора", Истина);
	Если ЭтотОбъект["СтруктураРеквизитовФормы"]["ПравоРегламентированнаяОтчетность"] Тогда 
		ДополнительныеПараметры.Вставить("ОтборОрган", 
			ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФНС"));
		ДополнительныеПараметры.Вставить("Раздел", 
			ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Уведомления"));
		ДополнительныеПараметры.Вставить("ВидУведомления", 
			ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ДокументОПредстоящейПоставке"));
			
		ОткрытьФорму("ОбщаяФорма.РегламентированнаяОтчетность", 
			ДополнительныеПараметры, , Новый УникальныйИдентификатор, , , ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Отчет.РегламентированноеУведомлениеДокументОПредстоящейПоставке.Форма.СписокДОПП", 
			ДополнительныеПараметры, , Новый УникальныйИдентификатор, , , ОО, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодборСданногоПервичногоДокументаЗавершение(ВыбранныйОбъект, Область) Экспорт
	Если ТипЗнч(ВыбранныйОбъект) = Тип("ДокументСсылка.УведомлениеОСпецрежимахНалогообложения") Тогда
		ДанныеПервичногоУведомления = РеквизитыСданногоУведомления(ВыбранныйОбъект);
		Если ТипЗнч(ДанныеПервичногоУведомления) = Тип("Структура") Тогда 
			ЗаполнитьЗначенияСвойств(ЭтотОбъект["ДанныеУведомления"].Титульная, ДанныеПервичногоУведомления);
			ПредставлениеУведомления.Области["НомерДОПП"].Значение = ДанныеПервичногоУведомления.НомерДОПП;
			ПредставлениеУведомления.Области["ДатаРегистр"].Значение = ДанныеПервичногоУведомления.ДатаРегистр;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РеквизитыСданногоУведомления(ВыбранныйОбъект)
	СтатусИСведенияКвитанций = Отчеты[СтрРазделить(ИмяФормы, ".")[1]].СтатусИСведенияКвитанций(ВыбранныйОбъект);
	СтатусИСведенияКвитанций.Вставить("ДатаРегистр", СтатусИСведенияКвитанций.ДатаРегистрацииДокумента);
	Возврат СтатусИСведенияКвитанций;
КонецФункции

&НаСервере
Функция ЗаполнитьАвтоНаСервере(МассивДокументов = Неопределено)
	ЭтотОбъект["СтруктураРеквизитовФормы"].Вставить("ОснованиеЗаполнения",
		?(ТипЗнч(МассивДокументов) = Тип("Массив") И МассивДокументов.Количество() = 1, МассивДокументов[0], Неопределено));
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация", Объект.Организация);
	ПараметрыОтчета.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("ВидУведомления", Объект.ВидУведомления);
	ПараметрыОтчета.Вставить("РегистрацияВИФНС", Объект.РегистрацияВИФНС);
	ПараметрыОтчета.Вставить("ДатаПодписи", Объект.ДатаПодписи);
	ПараметрыОтчета.Вставить("МассивДокументов" , МассивДокументов);
	

	
#Область ИнтеграцияСОблачнойОтчетностью

	Если Не ПараметрыОтчета.Свойство("УникальныйИдентификаторФормы") Тогда
		ПараметрыОтчета.Вставить("УникальныйИдентификаторФормы", УникальныйИдентификатор);
	КонецЕсли;
	
#КонецОбласти    

	Контейнер = Новый Структура;
	Контейнер.Вставить("РегистрацияВИФНС", Объект.РегистрацияВИФНС);
	Контейнер.Вставить("ДатаПодписи", Объект.ДатаПодписи);
	Контейнер.Вставить("Титульная", ЭтотОбъект["ДанныеУведомления"].Титульная);
	Для Каждого КЗ Из ЭтотОбъект["ДанныеМногостраничныхРазделов"] Цикл 
		ДанныеСтраницы = ОбщегоНазначения.СкопироватьРекурсивно(КЗ.Значение[0].Значение);
		ТЗСтр = Новый ТаблицаЗначений;
		Для Каждого Кол Из ДанныеСтраницы Цикл 
			ТЗСтр.Колонки.Добавить(Кол.Ключ)
		КонецЦикла;
		Контейнер.Вставить(КЗ.Ключ, ТЗСтр);
	КонецЦикла;
	
	Для Каждого КЗ Из ЭтотОбъект["ДанныеДопСтрок"] Цикл 
		Таблица = ПолучитьИзВременногоХранилища(КЗ.Значение);
		Таблица.Очистить();
		Контейнер.Вставить(КЗ.Ключ, Таблица);
	КонецЦикла;
	
	Разложение = СтрРазделить(ИмяФормы, ".");
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.ЗапуститьВФоне = Истина;
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне("РегламентированнаяОтчетность.ЗаполнитьОтчетВФоне_Уведомления",
		Новый Структура("ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер", Разложение[1], Разложение[3], ПараметрыОтчета, Контейнер),
		ПараметрыВыполненияВФоне);
	
	РезультатВыполнения.Вставить("ЗаданиеВыполнено", НРег(РезультатВыполнения.Статус) = "выполнено");
	ЭтотОбъект["АдресХранилища"] = РезультатВыполнения.АдресРезультата;
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьАвтоЗавершениеПослеЗаполнения(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	Доступность = Истина;
	
	Если РезультатЗагрузки = Неопределено Или РезультатЗагрузки.Статус <> "Выполнено" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить автозаполнение...'"));
		Возврат;
	КонецЕсли;

	ЗагрузитьПодготовленныеДанные();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	СтруктураДанных = ПолучитьИзВременногоХранилища(ЭтотОбъект["АдресХранилища"]);
	
	СформироватьДеревоСтраниц();
	УведомлениеОСпецрежимахНалогообложения.СформироватьСтруктуруДанныхУведомленияНовогоОбразца(ЭтотОбъект);
	
	СтруктураДанных.Контейнер.Свойство("РегистрацияВИФНС", Объект.РегистрацияВИФНС);
	СтруктураДанных.Контейнер.Свойство("ДатаПодписи", Объект.ДатаПодписи);
	ЭтотОбъект["ДанныеУведомления"].Титульная["КодНО"] = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РегистрацияВИФНС, "Код");
	ЭтотОбъект["ДанныеУведомления"].Титульная["ДАТА_ПОДПИСИ"] = Объект.ДатаПодписи;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект["ДанныеУведомления"].Титульная, СтруктураДанных.Контейнер.Титульная);
	
	Если СтруктураДанных.Контейнер.Договор.Количество() = 0 Тогда
		ЭтотОбъект["ТекущееИДНаименования"] = "Титульная";
		ПоказатьТекущуюСтраницу("Титульная_2026", Новый СписокЗначений, Неопределено);
		Модифицированность = Истина;
		Доступность = Истина;
		Возврат;
	КонецЕсли;
	
	ИсточникДоговор = ДеревоСтраниц.ПолучитьЭлементы()[1].ПолучитьЭлементы()[0];
	Договоры = СтруктураДанных.Контейнер.Договор;
	ТоварДоговор = СтруктураДанных.Контейнер.ТоварДоговор;
	ОбъектДоговор = ЭтотОбъект["ДанныеМногостраничныхРазделов"].Договор;
	ОбъектСпецификация = ЭтотОбъект["ДанныеМногостраничныхРазделов"].Спецификация;
	ОбъектТоварДоговор = ЭтотОбъект["ДанныеМногостраничныхРазделов"].ТоварДоговор;
	ОбъектТоварСпецификация = ЭтотОбъект["ДанныеМногостраничныхРазделов"].ТоварСпецификация;
	Для Каждого Стр1 Из Договоры Цикл 
		ПриемникДоговор = УведомлениеОСпецрежимахНалогообложения.СкопироватьСтрокуВДереве(ЭтотОбъект, ИсточникДоговор);
		ПриемникДоговор.УИД = Стр1.УИД;
		ПриемникДоговор.Наименование = "Стр. " + Формат((1 + Договоры.Индекс(Стр1)), "ЧГ=");
		ОбъектДоговор[ОбъектДоговор.Количество() - 1].Значение = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр1);
		
		ИсточникТовар = ПриемникДоговор.ПолучитьЭлементы()[0].ПолучитьЭлементы()[0];
		Товары = СтруктураДанных.Контейнер.ТоварДоговор.НайтиСтроки(Новый Структура("УИДРодителя", Стр1.УИД));
		Если Товары.Количество() > 0 Тогда 
			Для Инд1 = 1 По Товары.Количество() Цикл 
				ПриемникТовар = УведомлениеОСпецрежимахНалогообложения.СкопироватьСтрокуВДереве(ЭтотОбъект, ИсточникТовар);
				ПриемникТовар.УИД = Товары[Инд1 - 1].УИД;
				ПриемникТовар.Наименование = "Стр. " + Формат(Инд1, "ЧГ=");
				ОбъектТоварДоговор[ОбъектТоварДоговор.Количество() - 1].Значение = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Товары[Инд1 - 1]);
			КонецЦикла;
			ЭтотОбъект["УИДТекущаяСтраница"] = ИсточникТовар.УИД;
			УведомлениеОСпецрежимахНалогообложения.УдалитьСтраницуНаСервере(ЭтотОбъект);
		КонецЕсли;
		
		ИсточникСпецификация = ПриемникДоговор.ПолучитьЭлементы()[1].ПолучитьЭлементы()[0];
		Спецификации = СтруктураДанных.Контейнер.Спецификация.НайтиСтроки(Новый Структура("УИДРодителя", Стр1.УИД));
		Если Спецификации.Количество() > 0 Тогда 
			Для Инд0 = 1 По Спецификации.Количество() Цикл 
				ПриемникСпецификация = УведомлениеОСпецрежимахНалогообложения.СкопироватьСтрокуВДереве(ЭтотОбъект, ИсточникСпецификация);
				ПриемникСпецификация.УИД = Спецификации[Инд0 - 1].УИД;
				ПриемникСпецификация.Наименование = "Стр. " + Формат(Инд0, "ЧГ=");
				ОбъектСпецификация[ОбъектСпецификация.Количество() - 1].Значение = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Спецификации[Инд0 - 1]);
				
				ИсточникТовар = ПриемникСпецификация.ПолучитьЭлементы()[0].ПолучитьЭлементы()[0];
				Товары = СтруктураДанных.Контейнер.ТоварСпецификация.НайтиСтроки(Новый Структура("УИДРодителя", ПриемникСпецификация.УИД));
				Если Товары.Количество() > 0 Тогда 
					Для Инд1 = 1 По Товары.Количество() Цикл 
						ПриемникТовар = УведомлениеОСпецрежимахНалогообложения.СкопироватьСтрокуВДереве(ЭтотОбъект, ИсточникТовар);
						ПриемникТовар.УИД = Товары[Инд1 - 1].УИД;
						ПриемникТовар.Наименование = "Стр. " + Формат(Инд1, "ЧГ=");
						ОбъектТоварСпецификация[ОбъектТоварСпецификация.Количество() - 1].Значение = 
							ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Товары[Инд1 - 1]);
					КонецЦикла;
					ЭтотОбъект["УИДТекущаяСтраница"] = ИсточникТовар.УИД;
					УведомлениеОСпецрежимахНалогообложения.УдалитьСтраницуНаСервере(ЭтотОбъект);
				КонецЕсли;
			КонецЦикла;
			ЭтотОбъект["УИДТекущаяСтраница"] = ИсточникСпецификация.УИД;
			УведомлениеОСпецрежимахНалогообложения.УдалитьСтраницуНаСервере(ЭтотОбъект);
		КонецЕсли;
	КонецЦикла;
	ЭтотОбъект["УИДТекущаяСтраница"] = ИсточникДоговор.УИД;
	УведомлениеОСпецрежимахНалогообложения.УдалитьСтраницуНаСервере(ЭтотОбъект);
	
	ЭтотОбъект["ДанныеДопСтрок"].МнгСтр1 = ПоместитьВоВременноеХранилище(СтруктураДанных.Контейнер.МнгСтр1, Новый УникальныйИдентификатор);
	ЭтотОбъект["ТекущееИДНаименования"] = "Титульная";
	ПоказатьТекущуюСтраницу("Титульная_2026", Новый СписокЗначений, Неопределено);
	
	Объект.Основание = ЭтотОбъект["СтруктураРеквизитовФормы"]["ОснованиеЗаполнения"];
	Модифицированность = Истина;
	Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Асинх Процедура КурсВалютПриИзменении(Область)
	ДанныеСтраницы = ТекущаяСтраницаДанными();
	ОТЧ = ЭтотОбъект["ОТЧ"];
	СтарыйКурсВалют = ОТЧ.ПривестиЗначение(ДанныеСтраницы["КурсВалют"]);
	
	Если ЗначениеЗаполнено(СтарыйКурсВалют) И
		Ждать ВопросАсинх("Выполнить пересчет налогов пропорционально курсу?", РежимДиалогаВопрос.ДаНет)
		= КодВозвратаДиалога.Да Тогда 
		
		КоэффициентПересчета = Область.Значение / СтарыйКурсВалют;
		ДанныеСтраницы["КурсВалют"] = Область.Значение;
		Поля = СтрРазделить("НДСБаза,АкцизАдвБаза", ",");
		Для Каждого Элт2 Из ЭтотОбъект["ДанныеМногостраничныхРазделов"].ТоварДоговор Цикл
			Если Элт2.Значение.УИДРодителя = ДанныеСтраницы.УИД Тогда 
				ПропорциональныйПересчетТоварПоКурсу(Элт2.Значение, КоэффициентПересчета, Поля, ОТЧ);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Элт1 Из ЭтотОбъект["ДанныеМногостраничныхРазделов"].Спецификация Цикл
			Если Элт1.Значение.УИДРодителя <> ДанныеСтраницы.УИД Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого Элт2 Из ЭтотОбъект["ДанныеМногостраничныхРазделов"].ТоварСпецификация Цикл
				Если Элт2.Значение.УИДРодителя = Элт1.Значение.УИД Тогда 
					ПропорциональныйПересчетТоварПоКурсу(Элт2.Значение, КоэффициентПересчета, Поля, ОТЧ);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Иначе
		УведомлениеОСпецрежимахНалогообложенияКлиент.ПриИзмененииСодержимогоОбласти(ЭтотОбъект, Область, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПропорциональныйПересчетТоварПоКурсу(Товар, КоэффициентПересчета, Поля, ОТЧ)
	Для Каждого Обл Из Поля Цикл 
		Товар[Обл] = КоэффициентПересчета * ОТЧ.ПривестиЗначение(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, Обл, 0));
	КонецЦикла;
	
	Товар["СумНДС"] = Товар["НДСБаза"] 
		* ОТЧ.ПривестиЗначение(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, "НДССт", 0)) / 100;
	Товар["СумАкцизАдв"] = Товар["АкцизАдвБаза"] 
		* ОТЧ.ПривестиЗначение(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, "АкцАдвСт", 0)) / 100;
КонецПроцедуры

&НаКлиенте
Асинх Процедура КолТовПриИзменении(Область)
	ДанныеСтраницы = ТекущаяСтраницаДанными();
	ОТЧ = ЭтотОбъект["ОТЧ"];
	СтароеКоличество = ОТЧ.ПривестиЗначение(ДанныеСтраницы["КолТов"]);
	ЕстьДанныеДляПересчета = ЗначениеЗаполнено(СтароеКоличество) 
		И (ЗначениеЗаполнено(ДанныеСтраницы["СтоимТов"]) Или ЗначениеЗаполнено(ДанныеСтраницы["НДСБаза"]) 
			Или ЗначениеЗаполнено(ДанныеСтраницы["АкцизТвБаза"]) Или ЗначениеЗаполнено(ДанныеСтраницы["АкцизАдвБаза"]));
	
	Если ЕстьДанныеДляПересчета И
		Ждать ВопросАсинх("Выполнить пересчет стоимости пропорционально количеству?", РежимДиалогаВопрос.ДаНет)
		= КодВозвратаДиалога.Да Тогда 
		
		КоэффициентПересчета = Область.Значение / СтароеКоличество;
		Для Каждого Поле Из СтрРазделить("СтоимТов,НДСБаза,АкцизТвБаза,АкцизАдвБаза", ",") Цикл 
			ДанныеСтраницы[Поле] = ОТЧ.ПривестиЗначение(ДанныеСтраницы[Поле]) * КоэффициентПересчета;
			ПредставлениеУведомления.Области[Поле].Значение = ДанныеСтраницы[Поле];
		КонецЦикла;
		ДанныеСтраницы.Вставить("КолТов", Область.Значение);
		РасчетСуммНалогов();
	Иначе
		УведомлениеОСпецрежимахНалогообложенияКлиент.ПриИзмененииСодержимогоОбласти(ЭтотОбъект, Область, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ТекущаяСтраницаДанными()
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"][ЭтотОбъект["ТекущееИДНаименования"]] Цикл 
		Если Элт.Значение.УИД = ЭтотОбъект["УИДТекущаяСтраница"] Тогда 
			Возврат Элт.Значение;
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура РасчетСуммНалогов()
	ДанныеСтраницы = ТекущаяСтраницаДанными();
	ОТЧ = ЭтотОбъект["ОТЧ"];
	
	ДанныеСтраницы.Вставить("СумНДС", ОТЧ.ПривестиЗначение(ПредставлениеУведомления.Области["НДССт"].Значение) 
		* ОТЧ.ПривестиЗначение(ПредставлениеУведомления.Области["НДСБаза"].Значение) / 100);
	ДанныеСтраницы.Вставить("СумАкцизТв", ОТЧ.ПривестиЗначение(ПредставлениеУведомления.Области["АкцТвСт"].Значение) 
		* ОТЧ.ПривестиЗначение(ПредставлениеУведомления.Области["АкцизТвБаза"].Значение));
	ДанныеСтраницы.Вставить("СумАкцизАдв", ОТЧ.ПривестиЗначение(ПредставлениеУведомления.Области["АкцАдвСт"].Значение) 
		* ОТЧ.ПривестиЗначение(ПредставлениеУведомления.Области["АкцизАдвБаза"].Значение) / 100);
		
	Для Каждого Элт Из СтрРазделить("НДССт,НДСБаза,АкцТвСт,АкцизТвБаза,АкцАдвСт,АкцизАдвБаза", ",") Цикл 
		ДанныеСтраницы.Вставить(Элт, ПредставлениеУведомления.Области[Элт].Значение);
	КонецЦикла;
		
	ПредставлениеУведомления.Области["СумНДС"].Значение = ДанныеСтраницы["СумНДС"];
	ПредставлениеУведомления.Области["СумАкцизТв"].Значение = ДанныеСтраницы["СумАкцизТв"];
	ПредставлениеУведомления.Области["СумАкцизАдв"].Значение = ДанныеСтраницы["СумАкцизАдв"];
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыборСтавкиНДС()
	СписокВыбораПризнак = Новый СписокЗначений;
	СписокВыбораПризнак.Добавить("", "пустое значение");
	СписокВыбораПризнак.Добавить("10", "10%");
	СписокВыбораПризнак.Добавить("22", "22%");
	Результат = Ждать ВыбратьИзСпискаАсинх(СписокВыбораПризнак);
	Если ТипЗнч(Результат) = Тип("ЭлементСпискаЗначений") Тогда 
		Область = ПредставлениеУведомления.Области["НДССт"];
		Область.Значение = Результат.Значение;
		УведомлениеОСпецрежимахНалогообложенияКлиент.ПриИзмененииСодержимогоОбласти(ЭтотОбъект, Область, Истина);
		РасчетСуммНалогов();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальныеДанные() Экспорт
	ДанныеУведомленияТитульный = ЭтотОбъект["ДанныеУведомления"]["Титульная"];
	ДанныеУведомленияТитульный.Вставить("КодНО", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РегистрацияВИФНС, "Код"));
	Объект.ДатаПодписи = ТекущаяДатаСеанса();
	ДанныеУведомленияТитульный.Вставить("ДАТА_ПОДПИСИ", Объект.ДатаПодписи);
	
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Объект.Организация) Тогда
		СтрокаСведений = "ИННЮЛ,НаимЮЛПол,КППЮЛ";
		СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
			Объект.Организация, Объект.ДатаПодписи, СтрокаСведений);
		ДанныеУведомленияТитульный.Вставить("ИНН", СведенияОбОрганизации.ИННЮЛ);
		ДанныеУведомленияТитульный.Вставить("КПП", СведенияОбОрганизации.КППЮЛ);
		ДанныеУведомленияТитульный.Вставить("НаимОрг", СведенияОбОрганизации.НаимЮЛПол);
	Иначе
		СтрокаСведений = "ИННФЛ,ФамилияИП,ИмяИП,ОтчествоИП";
		СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
			Объект.Организация, Объект.ДатаПодписи, СтрокаСведений);
		ДанныеУведомленияТитульный.Вставить("ИНН", СведенияОбОрганизации.ИННФЛ);
		ДанныеУведомленияТитульный.Вставить("Фамилия", СведенияОбОрганизации.ФамилияИП);
		ДанныеУведомленияТитульный.Вставить("Имя", СведенияОбОрганизации.ИмяИП);
		ДанныеУведомленияТитульный.Вставить("Отчество", СведенияОбОрганизации.ОтчествоИП);
	КонецЕсли;
	
	Реквизиты = РегистрацияВНОСервер.ДанныеРегистрации(Объект.РегистрацияВИФНС);
	ДанныеУведомленияТитульный.Вставить("КодНО", Реквизиты.Код);
	ДанныеУведомленияТитульный.Вставить("КПП", Реквизиты.КПП);
	
	Если ЗначениеЗаполнено(Реквизиты.Представитель) Тогда
		УведомлениеОСпецрежимахНалогообложения.УстановитьПредставителяПоФизЛицу(ЭтотОбъект);
	Иначе
		УведомлениеОСпецрежимахНалогообложения.УстановитьПредставителяПоОрганизации(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоСтраниц() Экспорт
	ДеревоСтраниц.ПолучитьЭлементы().Очистить();
	КорневойУровень = ДеревоСтраниц.ПолучитьЭлементы();
	
	Стр001 = КорневойУровень.Добавить();
	Стр001.Наименование = "Основные данные";
	Стр001.ИндексКартинки = 1;
	Стр001.ИмяМакета = "Титульная_2026";
	Стр001.Многостраничность = Ложь;
	Стр001.Многострочность = Ложь;
	Стр001.УИД = Новый УникальныйИдентификатор;
	Стр001.ИДНаименования = "Титульная";
	
	Стр001 = КорневойУровень.Добавить();
	Стр001.Наименование = "Договоры";
	Стр001.ИндексКартинки = 1;
	Стр001.Многостраничность = Истина;
	Стр001.Многострочность = Ложь;
	
	СтрДог = Стр001.ПолучитьЭлементы().Добавить();
	СтрДог.Наименование = "Стр. 1";
	СтрДог.ИндексКартинки = 1;
	СтрДог.ИмяМакета = "Договор_2026";
	СтрДог.Многостраничность = Истина;
	СтрДог.Многострочность = Ложь;
	СтрДог.УИД = Новый УникальныйИдентификатор;
	СтрДог.ИДНаименования = "Договор";
	
	Стр001 = СтрДог.ПолучитьЭлементы().Добавить();
	Стр001.Наименование = "Товары";
	Стр001.ИндексКартинки = 1;
	Стр001.Многостраничность = Истина;
	Стр001.Многострочность = Истина;
	
	Стр001 = Стр001.ПолучитьЭлементы().Добавить();
	Стр001.Наименование = "Стр. 1";
	Стр001.ИндексКартинки = 1;
	Стр001.ИмяМакета = "Товар_2026";
	Стр001.Многостраничность = Истина;
	Стр001.Многострочность = Истина;
	Стр001.УИД = Новый УникальныйИдентификатор;
	Стр001.ИДНаименования = "ТоварДоговор";
	Стр001.МногострочныеЧасти.Добавить("МнгСтр1");
	
	Стр001 = СтрДог.ПолучитьЭлементы().Добавить();
	Стр001.Наименование = "Спецификации";
	Стр001.ИндексКартинки = 1;
	Стр001.Многостраничность = Истина;
	Стр001.Многострочность = Ложь;
	
	Стр001 = Стр001.ПолучитьЭлементы().Добавить();
	Стр001.Наименование = "Стр. 1";
	Стр001.ИндексКартинки = 1;
	Стр001.ИмяМакета = "Спецификация_2026";
	Стр001.Многостраничность = Истина;
	Стр001.Многострочность = Ложь;
	Стр001.УИД = Новый УникальныйИдентификатор;
	Стр001.ИДНаименования = "Спецификация";
	
	Стр001 = Стр001.ПолучитьЭлементы().Добавить();
	Стр001.Наименование = "Товары";
	Стр001.ИндексКартинки = 1;
	Стр001.Многостраничность = Истина;
	Стр001.Многострочность = Истина;
	
	Стр001 = Стр001.ПолучитьЭлементы().Добавить();
	Стр001.Наименование = "Стр. 1";
	Стр001.ИндексКартинки = 1;
	Стр001.ИмяМакета = "Товар_2026";
	Стр001.Многостраничность = Истина;
	Стр001.Многострочность = Истина;
	Стр001.УИД = Новый УникальныйИдентификатор;
	Стр001.ИДНаименования = "ТоварСпецификация";
	Стр001.МногострочныеЧасти.Добавить("МнгСтр1");
КонецПроцедуры

&НаСервере
Процедура СохранитьДанные() Экспорт
	Если ЗначениеЗаполнено(Объект.Ссылка) И Не Модифицированность Тогда 
		Возврат;
	КонецЕсли;
	СтруктураПараметров = УведомлениеОСпецрежимахНалогообложения.СтруктураПараметровДляСохранения(ЭтотОбъект);
	УведомлениеОСпецрежимахНалогообложения.СохранитьДанные(ЭтотОбъект, СтруктураПараметров);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанные(СсылкаНаДанные)
	УведомлениеОСпецрежимахНалогообложения.ЗагрузкаДанныхУведомления(ЭтотОбъект, СсылкаНаДанные);
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	СохранитьДанные();
КонецПроцедуры

&НаСервере
Функция СформироватьXMLНаСервере(УникальныйИдентификатор)
	СохранитьДанные();
	Документ = РеквизитФормыВЗначение("Объект");
	Возврат Документ.ВыгрузитьДокумент(УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь,ВыполняемоеОповещение = Неопределено) Экспорт 
	
	СохранитьДанные();
	Если ВыполняемоеОповещение <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВыгрузкуНаСервере()
	СохранитьДанные();
	Документ = РеквизитФормыВЗначение("Объект");
	Возврат Документ.ПроверитьДокументСВыводомВТаблицу(УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы(Команда)
	
	РегламентированнаяОтчетностьКлиент.СохранитьУведомлениеИОткрытьФормуПрисоединенныеФайлы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура РазрешитьРедактированиеРеквизитовОбъекта() Экспорт
	РегламентированнаяОтчетность.РазрешитьРедактированиеРеквизитовОтчета(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	РегламентированнаяОтчетностьКлиент.РазрешитьРедактированиеРеквизитовОтчета(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКодаНОЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда 
		Объект.РегистрацияВИФНС = Результат;
		УстановитьДанныеПоРегистрацииВИФНС();
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеПоРегистрацииВИФНС()
	Реквизиты = РегистрацияВНОСервер.ДанныеРегистрации(Объект.РегистрацияВИФНС);
	ПредставлениеУведомления.Области["КодНО"].Значение = Реквизиты.Код;
	ПредставлениеУведомления.Области["КПП"].Значение = Реквизиты.КПП;
	ДанныеУведомленияТитульный = ЭтотОбъект["ДанныеУведомления"]["Титульная"];
	ДанныеУведомленияТитульный.Вставить("КодНО", ПредставлениеУведомления.Области["КодНО"].Значение);
	ДанныеУведомленияТитульный.Вставить("КПП", ПредставлениеУведомления.Области["КПП"].Значение);
	Если ЗначениеЗаполнено(Реквизиты.Представитель) Тогда
		УведомлениеОСпецрежимахНалогообложения.УстановитьПредставителяПоФизЛицу(ЭтотОбъект);
	Иначе
		УведомлениеОСпецрежимахНалогообложения.УстановитьПредставителяПоОрганизации(ЭтотОбъект);
	КонецЕсли;
	
	ДанныеУведомленияТитульный.Вставить("ПРИЗНАК_НП_ПОДВАЛ", ПредставлениеУведомления.Области["ПРИЗНАК_НП_ПОДВАЛ"].Значение);
	ДанныеУведомленияТитульный.Вставить("НаимДок", ПредставлениеУведомления.Области["НаимДок"].Значение);
	ДанныеУведомленияТитульный.Вставить("ДАТА_ПОДПИСИ", ПредставлениеУведомления.Области["ДАТА_ПОДПИСИ"].Значение);
	ДанныеУведомленияТитульный.Вставить("ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ", ПредставлениеУведомления.Области["ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ"].Значение);
КонецПроцедуры

&НаСервере
Процедура ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере() Экспорт
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ВывестиСтатусыИВыжныеСообщенияНаФорму_85(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДетальноеОписаниеСтатусаПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбработатьНажатиеВФормеРасшифровкиСтатуса(ЭтотОбъект, Результат, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиСтатусыИВыжныеСообщенияНаФорму() Экспорт

	ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНажатияКнопкиВВажномСообщении(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбработатьНажатиеКнопкиВВажномСообщении(ЭтотОбъект, Команда.Имя, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНавигационнойСсылкиВВажномСообщении(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбработатьНавигационнуюСсылкуВВажномСообщении(
		ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, "ФНС");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаЗакрытияВажногоСообщения(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ЗакрытьВажноеСообщение(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбработатьДействиеИнформационногоСообщения(
		ЭтотОбъект, ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Функция ЭтоОбластьОКСМ(Область)
	Возврат Область.Имя = "ОКСМПерев" Или Область.Имя = "ОКСМПроисх" Или Область.Имя = "ОКСМПрод";
КонецФункции

&НаКлиенте
Процедура ДеревоСтраницПриАктивизацииСтрокиЗавершение() Экспорт 
	ПредУИД = ЭтотОбъект["УИДПереключение"];
	Элемент = Элементы.ДеревоСтраниц;
	
	Если Элемент.ТекущиеДанные.Многостраничность Тогда 
		ИмяМакета = УведомлениеОСпецрежимахНалогообложенияКлиент.ПолучитьИмяВыводимогоМакета(Элемент.ТекущиеДанные);
		ПоказатьТекущуюМногостраничнуюСтраницу(ИмяМакета, УведомлениеОСпецрежимахНалогообложенияКлиент.ПолучитьМногострочныеЧасти(Элемент.ТекущиеДанные), ПредУИД);
	Иначе 
		ПоказатьТекущуюСтраницу(Элемент.ТекущиеДанные.ИмяМакета, Элемент.ТекущиеДанные.МногострочныеЧасти, ПредУИД);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекущуюСтраницу(ИмяМакета, МногострочныеЧасти, ПредУИД)
	Если Не ЭтотОбъект["УдалениеСтраницы"] И ЭтотОбъект["ТекущиеМногострочныеЧасти"].Количество() > 0 Тогда 
		УведомлениеОСпецрежимахНалогообложения.СобратьДанныеМногострочныхЧастейТекущейСтраницы(
					ЭтотОбъект, ЭтотОбъект["ТекущиеМногострочныеЧасти"], ПредУИД);
	КонецЕсли;
	
	ЭтотОбъект["ТекущиеМногострочныеЧасти"] = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(МногострочныеЧасти);
	ЭтотОбъект["ТекущийМакет"] = ИмяМакета;
	Макет = УведомлениеОСпецрежимахНалогообложения.ПолучитьМакетТабличногоДокумента(ЭтотОбъект, ИмяМакета);
	УведомлениеОСпецрежимахНалогообложения.ПоказатьТекущуюСтраницу(ЭтотОбъект, ИмяМакета, ПредУИД);
	
	Если ЭтотОбъект["ТекущееИДНаименования"] = "Титульная" Тогда 
		Если Не ЭтотОбъект["Подключена1СОтчетность"] Тогда 
			ПодборПервичногоДокумента = ПредставлениеУведомления.Области["ПодборПервичногоДокумента"];
			ПодборПервичногоДокумента.Текст = "";
			ПодборПервичногоДокумента.Гиперссылка = Ложь;
			ПодборПервичногоДокумента.Имя = "";
		КонецЕсли;
		Если ЭтотОбъект["ЭтоЮЛ"] Тогда 
			ПредставлениеУведомления.Области["ИНН"].ТипЗначения = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(10));
			УведомлениеОСпецрежимахНалогообложения.ЗащитаОбласти(ЭтотОбъект, "Фамилия");
			УведомлениеОСпецрежимахНалогообложения.ЗащитаОбласти(ЭтотОбъект, "Имя");
			УведомлениеОСпецрежимахНалогообложения.ЗащитаОбласти(ЭтотОбъект, "Отчество");
		Иначе
			УведомлениеОСпецрежимахНалогообложения.ЗащитаОбласти(ЭтотОбъект, "НаимОрг");
			УведомлениеОСпецрежимахНалогообложения.ЗащитаОбласти(ЭтотОбъект, "КПП");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекущуюМногостраничнуюСтраницу(ИмяМакета, МногострочныеЧасти, ПредУИД)
	Если Не ЭтотОбъект["УдалениеСтраницы"] И ЭтотОбъект["ТекущиеМногострочныеЧасти"].Количество() > 0 Тогда 
		УведомлениеОСпецрежимахНалогообложения.СобратьДанныеМногострочныхЧастейТекущейСтраницы(
					ЭтотОбъект, ЭтотОбъект["ТекущиеМногострочныеЧасти"], ПредУИД);
	КонецЕсли;
	
	ЭтотОбъект["ТекущиеМногострочныеЧасти"] = ОбщегоНазначенияКлиентСервер.СкопироватьСписокЗначений(МногострочныеЧасти);
	ЭтотОбъект["ТекущийМакет"] = ИмяМакета;
	Макет = УведомлениеОСпецрежимахНалогообложения.ПоказатьТекущуюМногостраничнуюСтраницу(ЭтотОбъект, ИмяМакета);
	УведомлениеОСпецрежимахНалогообложения.ПоказатьМногострочныеЧасти(ЭтотОбъект, Макет, МногострочныеЧасти, ЭтотОбъект["ЧисловыеФорматы"]);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтраницу(Команда) Экспорт 
	ДобавитьСтраницуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтраницуНаСервере()
	УведомлениеОСпецрежимахНалогообложения.ДобавитьСтраницуУведомления(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницу() Экспорт
	ЭтотОбъект["УдалениеСтраницы"] = Истина;
	УдалитьСтраницуНаСервере();
	ЭтотОбъект["УдалениеСтраницы"] = Ложь;
КонецПроцедуры

&НаСервере
Процедура УдалитьСтраницуНаСервере()
	УведомлениеОСпецрежимахНалогообложения.УдалитьСтраницуНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СкопироватьСтраницуНаСервере()
	УведомлениеОСпецрежимахНалогообложения.СобратьДанныеМногострочныхЧастейТекущейСтраницы(
				ЭтотОбъект, ЭтотОбъект["ТекущиеМногострочныеЧасти"], ЭтотОбъект["УИДТекущаяСтраница"]);
	УведомлениеОСпецрежимахНалогообложения.КопироватьСтраницуУведомления(ЭтотОбъект, ЭтотОбъект["СПодчиненными"]);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтраницуНаКлиенте() Экспорт 
	СкопироватьСтраницуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтроку(ИмяОбласти)
	УведомлениеОСпецрежимахНалогообложения.ДобавитьСтроку(ЭтотОбъект, ИмяОбласти);
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ИмяОбласти)
	УведомлениеОСпецрежимахНалогообложения.УдалитьСтроку(ЭтотОбъект, ИмяОбласти);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуНаКлиенте(ИмяОбласти) Экспорт 
	ДобавитьСтроку(ИмяОбласти);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуНаКлиенте(ИмяОбласти) Экспорт 
	УдалитьСтроку(ИмяОбласти);
КонецПроцедуры

&НаСервере
Процедура ПечатьБРОНаСервере()
	УведомлениеОСпецрежимахНалогообложения.ПечатьУведомленияБРО(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПостОбработка()
	ПризнакПоУИД = Новый Соответствие;
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"]["ТоварДоговор"] Цикл 
		Если УведомлениеОСпецрежимахНалогообложенияКлиентСервер.СтраницаЗаполнена(Элт.Значение) Тогда 
			ПризнакПоУИД.Вставить(Элт.Значение.УИДРодителя, "2");
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"]["Спецификация"] Цикл 
		Если УведомлениеОСпецрежимахНалогообложенияКлиентСервер.СтраницаЗаполнена(Элт.Значение) Тогда 
			ПризнакПоУИД.Вставить(Элт.Значение.УИДРодителя, "1");
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"]["Договор"] Цикл 
		Элт.Значение.Вставить("ПрСпецТов", ПризнакПоУИД[Элт.Значение.УИД]);
	КонецЦикла;
	
	МнгСтр = ПолучитьИзВременногоХранилища(ЭтотОбъект["ДанныеДопСтрок"].МнгСтр);
	Элт = ДеревоСтраниц.ПолучитьЭлементы()[0];
	Элт.Многострочность = Ложь;
	Элт.МногострочныеЧасти.Очистить();
	Если МнгСтр.Количество() = 1 Тогда 
		ЭтотОбъект["ДанныеУведомления"].Титульная.Вставить("НомерПрицеп1", МнгСтр[0].НомерПрицеп);
	ИначеЕсли МнгСтр.Количество() = 2 Тогда 
		ЭтотОбъект["ДанныеУведомления"].Титульная.Вставить("НомерПрицеп1", МнгСтр[0].НомерПрицеп);
		ЭтотОбъект["ДанныеУведомления"].Титульная.Вставить("НомерПрицеп2", МнгСтр[1].НомерПрицеп);
	КонецЕсли;
	ЭтотОбъект["ДанныеДопСтрок"].Удалить("МнгСтр");
	
	Если ЗначениеЗаполнено(ЭтотОбъект["ДанныеУведомления"].Титульная["РегЗнакТС"])
		Или ЗначениеЗаполнено(ЭтотОбъект["ДанныеУведомления"].Титульная["НомерПрицеп1"])
		Или ЗначениеЗаполнено(ЭтотОбъект["ДанныеУведомления"].Титульная["НомерПрицеп2"]) Тогда 
		ЭтотОбъект["ДанныеУведомления"].Титульная["ВидТС"] = "1";
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект["ДанныеУведомления"].Титульная["НомерНаклАвиа"])
		Или ЗначениеЗаполнено(ЭтотОбъект["ДанныеУведомления"].Титульная["ДатаНаклАвиа"]) Тогда 
		ЭтотОбъект["ДанныеУведомления"].Титульная["ВидТС"] = "2";
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект["ДанныеУведомления"].Титульная["НомерНаклЖД"])
		Или ЗначениеЗаполнено(ЭтотОбъект["ДанныеУведомления"].Титульная["ДатаНаклЖД"]) Тогда 
		ЭтотОбъект["ДанныеУведомления"].Титульная["ВидТС"] = "3";
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект["ДанныеУведомления"].Титульная["НомерКон"])
		Или ЗначениеЗаполнено(ЭтотОбъект["ДанныеУведомления"].Титульная["ДатаКон"]) Тогда 
		ЭтотОбъект["ДанныеУведомления"].Титульная["ВидТС"] = "4";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзXMLНаСервере(ПараметрыЗагрузкиXML)
	ДеревоЗагрузки = УведомлениеОСпецрежимахНалогообложения.СформироватьДеревоЗагрузки(ПараметрыЗагрузкиXML.ПредставлениеXML);
	СхемаВыгрузки = Документы.УведомлениеОСпецрежимахНалогообложения.ИзвлечьСтруктуруXMLУведомления(Объект.ИмяОтчета, "СхемаВыгрузкиФорма2026_1");
	УведомлениеОСпецрежимахНалогообложения.УстановитьОрганизациюПоПараметрамЗагрузки(ЭтотОбъект, ПараметрыЗагрузкиXML);
	ДеревоСтраниц.ПолучитьЭлементы().Очистить();
	СформироватьДеревоСтраниц();
	УведомлениеОСпецрежимахНалогообложения.СформироватьСтруктуруДанныхУведомленияНовогоОбразца(ЭтотОбъект);
	
	МнгСтр = Новый ТаблицаЗначений;
	МнгСтр.Колонки.Добавить("УИД");
	МнгСтр.Колонки.Добавить("НомерПрицеп");
	ЭтотОбъект["ДанныеДопСтрок"].Вставить("МнгСтр", ПоместитьВоВременноеХранилище(МнгСтр));
	Элт = ДеревоСтраниц.ПолучитьЭлементы()[0];
	Элт.Многострочность = Истина;
	Элт.МногострочныеЧасти.Добавить("МнгСтр");
	
	ДополнительныеПараметры = Новый Структура;
	УведомлениеОСпецрежимахНалогообложения.ЗагрузитьОбычныеСтраницы(ЭтотОбъект, ДеревоЗагрузки, СхемаВыгрузки, ДополнительныеПараметры);
	УведомлениеОСпецрежимахНалогообложения.ЗагрузитьМногостраничныеСтраницы(ЭтотОбъект, ДеревоЗагрузки, СхемаВыгрузки, ДополнительныеПараметры);
	ПостОбработка();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеУведомленияВыборЗавершение(КодВалюты, ДопПараметры) Экспорт 
	ТекущаяСтраницаДанными = ТекущаяСтраницаДанными();
	Если КодВалюты.Код = "643" Тогда
		ТекущаяСтраницаДанными.Вставить("КурсВалют", 1);
		ТекущаяСтраницаДанными.Вставить("БазаВалют", 1);
		ПредставлениеУведомления.Области["КурсВалют"].Значение = 1;
		ПредставлениеУведомления.Области["БазаВалют"].Значение = 1;
	ИначеЕсли ЗначениеЗаполнено(КодВалюты.Код) Тогда
		ИнформацияПоВалюте = ИнформацияПоВалюте(КодВалюты.Код, ПредставлениеУведомления.Области["ДатаКурсВалют"].Значение);
		Если ТипЗнч(ИнформацияПоВалюте) = Тип("Структура") И ЗначениеЗаполнено(ИнформацияПоВалюте.Курс) Тогда 
			ТекущаяСтраницаДанными.Вставить("КурсВалют", ИнформацияПоВалюте.Курс);
			ТекущаяСтраницаДанными.Вставить("БазаВалют", ИнформацияПоВалюте.Кратность);
			ПредставлениеУведомления.Области["КурсВалют"].Значение = ИнформацияПоВалюте.Курс;
			ПредставлениеУведомления.Области["БазаВалют"].Значение = ИнформацияПоВалюте.Кратность;
		Иначе
			ТекущаяСтраницаДанными.Вставить("КурсВалют", 0);
			ТекущаяСтраницаДанными.Вставить("БазаВалют", 0);
			ПредставлениеУведомления.Области["КурсВалют"].Значение = 0;
			ПредставлениеУведомления.Области["БазаВалют"].Значение = 0;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнформацияПоВалюте(КодВалюты, Дата)
	ДатаКурса = ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), КонецДня(ТекущаяДатаСеанса()));
	Валюта = Справочники["Валюты"].НайтиПоКоду(КодВалюты);
	Результат = Новый Структура("Курс, Кратность");
	Если ЗначениеЗаполнено(Валюта) Тогда 
		МодульРаботаСКурсамиВалют = ОбщегоНазначения.ОбщийМодуль("РаботаСКурсамиВалют");
		ЗаполнитьЗначенияСвойств(Результат, МодульРаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ДатаКурса));
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ОчищеннаяСтруктура(ИсходнаяСтруктура)
	Результат = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ИсходнаяСтруктура);
	Для Каждого КЗ Из Результат Цикл 
		Если ТипЗнч(КЗ.Значение) = Тип("Число") Тогда 
			Результат[КЗ.Ключ] = 0;
		ИначеЕсли ТипЗнч(КЗ.Значение) = Тип("Булево") Тогда 
			Результат[КЗ.Ключ] = Ложь;
		ИначеЕсли ТипЗнч(КЗ.Значение) = Тип("Строка") Тогда 
			Результат[КЗ.Ключ] = "";
		ИначеЕсли ТипЗнч(КЗ.Значение) = Тип("УникальныйИдентификатор") Тогда 
			Результат[КЗ.Ключ] = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция УИДРодителя(УИД, ИДНаименования)
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"][ИДНаименования] Цикл 
		Если Элт.Значение.УИД = УИД Тогда 
			Возврат Элт.Значение.УИДРодителя;
		КонецЕсли;
	КонецЦикла;
	
	ВызватьИсключение "";
КонецФункции

&НаКлиенте
Процедура ОбработкаПеретаскиванияГруппыТоваров(ПредметПеретаскивания, НазначениеПеретаскивания)
	НазначениеПеретаскиванияВДереве = ДеревоСтраниц.НайтиПоИдентификатору(НазначениеПеретаскивания);
	ПредметПеретаскиванияВДереве = ДеревоСтраниц.НайтиПоИдентификатору(ПредметПеретаскивания);
	ИДНаименованияИсточник = ПредметПеретаскиванияВДереве.ПолучитьЭлементы()[0].ИДНаименования;
	ИДНаименованияПриемник = НазначениеПеретаскиванияВДереве.ПолучитьЭлементы()[0].ИДНаименования;
	УИДРодителяИсточник = УИДРодителя(ПредметПеретаскиванияВДереве.ПолучитьЭлементы()[0].УИД, ИДНаименованияИсточник);
	УИДРодителяПриемник = УИДРодителя(НазначениеПеретаскиванияВДереве.ПолучитьЭлементы()[0].УИД, ИДНаименованияПриемник);
	
	ИдентификаторыЭлементов = Новый Соответствие;
	ОчищенныйТовар = ОчищеннаяСтруктура(ЭтотОбъект["ДанныеМногостраничныхРазделов"][ИДНаименованияИсточник][0].Значение);
	ОчищенныйТовар.УИДРодителя = УИДРодителяИсточник;
	Для Каждого Элт Из ПредметПеретаскиванияВДереве.ПолучитьЭлементы() Цикл 
		ИдентификаторыЭлементов.Вставить(Элт.УИД, Элт);
	КонецЦикла;
	
	МассивПеремещаемых = Новый Массив;
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"][ИДНаименованияИсточник] Цикл 
		Если ИдентификаторыЭлементов[Элт.Значение.УИД] = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		НовСтр = НазначениеПеретаскиванияВДереве.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ИдентификаторыЭлементов[Элт.Значение.УИД]);
		НовСтр.МногострочныеЧасти = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ПредметПеретаскиванияВДереве.МногострочныеЧасти);
		НовСтр.Наименование = "Стр. " + НазначениеПеретаскиванияВДереве.ПолучитьЭлементы().Количество();
		НовСтр.ИДНаименования = ИДНаименованияПриемник;
		Элт.Значение.УИДРодителя = УИДРодителяПриемник;
		МассивПеремещаемых.Добавить(Элт);
	КонецЦикла;
	
	Для Каждого Элт Из МассивПеремещаемых Цикл 
		ЭтотОбъект["ДанныеМногостраничныхРазделов"][ИДНаименованияПриемник].Добавить(Элт.Значение);
		ЭтотОбъект["ДанныеМногостраничныхРазделов"][ИДНаименованияИсточник].Удалить(Элт);
	КонецЦикла;
	
	ПредметПеретаскиванияВДереве.ПолучитьЭлементы()[0].УИД = ОчищенныйТовар.УИД;
	Пока ПредметПеретаскиванияВДереве.ПолучитьЭлементы().Количество() > 1 Цикл 
		ПредметПеретаскиванияВДереве.ПолучитьЭлементы().Удалить(0);
	КонецЦикла;
	ОчищенныйТоварВДереве = ПредметПеретаскиванияВДереве.ПолучитьЭлементы()[0];
	ОчищенныйТоварВДереве.УИД = ОчищенныйТовар.УИД;
	ОчищенныйТоварВДереве.Наименование = "Стр. 1";
	ЭтотОбъект["ДанныеМногостраничныхРазделов"][ИДНаименованияИсточник].Добавить(ОчищенныйТовар);
	
	Элементы.ДеревоСтраниц.ТекущаяСтрока = НазначениеПеретаскиванияВДереве.ПолучитьЭлементы()[0].ПолучитьИдентификатор();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПеретаскиванияТовара(ПредметПеретаскивания, НазначениеПеретаскивания)
	НазначениеПеретаскиванияВДереве = ДеревоСтраниц.НайтиПоИдентификатору(НазначениеПеретаскивания);
	ПредметПеретаскиванияВДереве = ДеревоСтраниц.НайтиПоИдентификатору(ПредметПеретаскивания);
	ИДНаименованияПриемник = НазначениеПеретаскиванияВДереве.ПолучитьЭлементы()[0].ИДНаименования;
	УИДРодителяИсточник = УИДРодителя(ПредметПеретаскиванияВДереве.УИД, ПредметПеретаскиванияВДереве.ИДНаименования);
	УИДРодителяПриемник = УИДРодителя(НазначениеПеретаскиванияВДереве.ПолучитьЭлементы()[0].УИД, ИДНаименованияПриемник);
	
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"][ПредметПеретаскиванияВДереве.ИДНаименования] Цикл 
		Если Элт.Значение.УИД = ПредметПеретаскиванияВДереве.УИД Тогда 
			НовСтр = НазначениеПеретаскиванияВДереве.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ПредметПеретаскиванияВДереве);
			НовСтр.Наименование = "Стр. " + НазначениеПеретаскиванияВДереве.ПолучитьЭлементы().Количество();
			НовСтр.МногострочныеЧасти = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ПредметПеретаскиванияВДереве.МногострочныеЧасти);
			НовСтр.ИДНаименования = ИДНаименованияПриемник;
			Элт.Значение.УИДРодителя = УИДРодителяПриемник;
			
			ИсходнаяПапка = ПредметПеретаскиванияВДереве.ПолучитьРодителя();
			Если ИсходнаяПапка.ПолучитьЭлементы().Количество() = 1 Тогда 
				ОчищенныйТовар = ОчищеннаяСтруктура(Элт.Значение);
				ОчищенныйТовар.УИДРодителя = УИДРодителяИсточник;
				ИсходнаяПапка.ПолучитьЭлементы()[0].УИД = ОчищенныйТовар.УИД;
				ЭтотОбъект["ДанныеМногостраничныхРазделов"][ПредметПеретаскиванияВДереве.ИДНаименования].Добавить(ОчищенныйТовар);
			Иначе
				ИсходнаяПапка.ПолучитьЭлементы().Удалить(ПредметПеретаскиванияВДереве);
			КонецЕсли;
			
			ЭтотОбъект["ДанныеМногостраничныхРазделов"][ИДНаименованияПриемник].Добавить(Элт.Значение);
			ЭтотОбъект["ДанныеМногостраничныхРазделов"][ПредметПеретаскиванияВДереве.ИДНаименования].Удалить(Элт);
			
			Инд = 0;
			Для Каждого Стр Из ИсходнаяПапка.ПолучитьЭлементы() Цикл 
				Инд = Инд + 1;
				Стр.Наименование = "Стр. " + Инд;
			КонецЦикла;
			
			Элементы.ДеревоСтраниц.ТекущаяСтрока = НовСтр.ПолучитьИдентификатор();
			Модифицированность = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция НРегСтруктура(Исходник)
	Результат = Новый Структура;
	Для Каждого КЗ Из Исходник Цикл 
		Результат.Вставить(КЗ.Ключ, ?(ТипЗнч(КЗ.Значение) = Тип("Строка"), СокрЛП(НРег(КЗ.Значение)), КЗ.Значение));
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция НРегСтрока(Исходник)
	Возврат СокрЛП(НРег(Исходник));
КонецФункции

&НаСервере
Функция ДанныеДоговоровПоТоварам()
	КешДоговор = Новый Соответствие;
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"]["Договор"] Цикл 
		КешДоговор.Вставить(Элт.Значение.УИД, Элт.Значение);
	КонецЦикла;
	
	КешСпецификация = Новый Соответствие;
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"]["Спецификация"] Цикл 
		КешСпецификация.Вставить(Элт.Значение.УИД, Элт.Значение);
	КонецЦикла;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("УИД", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Результат.Колонки.Добавить("НаименованиеТовара", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ТНВЭД", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерДоговора", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерСпецификации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерТовара", Новый ОписаниеТипов("Число"));
	
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"]["ТоварДоговор"] Цикл 
		Договор = КешДоговор[Элт.Значение.УИДРодителя];
		Если ТипЗнч(Договор) <> Тип("Структура") Тогда 
			Продолжить;
		КонецЕсли;
		
		НовСтр = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, НРегСтруктура(Элт.Значение));
		НовСтр.НаименованиеТовара = НРегСтрока(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Элт.Значение, "НаимТов", ""));
		НовСтр.НомерДоговора = НРегСтрока(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Договор, "НомерДог", ""));
	КонецЦикла;
	
	Для Каждого Элт Из ЭтотОбъект["ДанныеМногостраничныхРазделов"]["ТоварСпецификация"] Цикл 
		Спецификация = КешСпецификация[Элт.Значение.УИДРодителя];
		Если ТипЗнч(Спецификация) <> Тип("Структура") Тогда 
			Продолжить;
		КонецЕсли;
		Договор = КешДоговор[Спецификация.УИДРодителя];
		Если ТипЗнч(Договор) <> Тип("Структура") Тогда 
			Продолжить;
		КонецЕсли;
		
		НовСтр = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, НРегСтруктура(Элт.Значение));
		НовСтр.НаименованиеТовара = НРегСтрока(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Элт.Значение, "НаимТов", ""));
		НовСтр.НомерДоговора = НРегСтрока(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Договор, "НомерДог", ""));
		НовСтр.НомерСпецификации = НРегСтрока(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Спецификация, "НомерСп", ""));
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ДанныеДокументооборота(СписокДокументов)
	ДанныеДокументооборота = Новый ТаблицаЗначений;
	ДанныеДокументооборота.Колонки.Добавить("РНПТ", Новый ОписаниеТипов("Строка"));
	ДанныеДокументооборота.Колонки.Добавить("НаименованиеТовара", Новый ОписаниеТипов("Строка"));
	ДанныеДокументооборота.Колонки.Добавить("ТНВЭД", Новый ОписаниеТипов("Строка"));
	ДанныеДокументооборота.Колонки.Добавить("НомерДоговора", Новый ОписаниеТипов("Строка"));
	ДанныеДокументооборота.Колонки.Добавить("НомерСпецификации", Новый ОписаниеТипов("Строка"));
	ДанныеДокументооборота.Колонки.Добавить("НомерТовара", Новый ОписаниеТипов("Число"));
	
	Для Каждого Элт Из СписокДокументов Цикл 
		Если Не ЗначениеЗаполнено(Элт.СписокРНПТ) Тогда 
			Продолжить;
		КонецЕсли;
		
		Для Каждого Товар Из Элт.СписокРНПТ Цикл 
			Если ЗначениеЗаполнено(Товар.ТНВЭД) Тогда 
				ЗаполнитьЗначенияСвойств(ДанныеДокументооборота.Добавить(), НРегСтруктура(Товар));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДанныеДокументооборота;
КонецФункции

&НаСервере
Процедура ЗаполнениеТаблицыРНПТ(ДанныеДокументооборота, ДанныеДоговоровПоТоварам)
	ТаблицаРНПТ.Очистить();
	
	СтруктураПоискаБезНомера = Новый Структура;
	СтруктураПоискаБезНомера.Вставить("ТНВЭД", "");
	СтруктураПоискаБезНомера.Вставить("НаименованиеТовара", "");
	СтруктураПоискаБезНомера.Вставить("НомерДоговора", "");
	СтруктураПоискаБезНомера.Вставить("НомерСпецификации", "");
	
	НайденныеУИД = Новый Соответствие;
	Для Каждого Стр Из ДанныеДокументооборота Цикл 
		ЗаполнитьЗначенияСвойств(СтруктураПоискаБезНомера, Стр);
		НайденныеСтроки = ДанныеДоговоровПоТоварам.НайтиСтроки(СтруктураПоискаБезНомера);
		
		Если НайденныеСтроки.Количество() = 1 И Не ЗначениеЗаполнено(НайденныеУИД[НайденныеСтроки[0].УИД]) Тогда
			НовСтр = ТаблицаРНПТ.Добавить();
			НовСтр.УИД = НайденныеСтроки[0].УИД;
			НовСтр.РНПТ = Стр.РНПТ;
			
			НайденныеУИД.Вставить(НовСтр.УИД, 1);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеСпискаРНПТ()
	Попытка
		СписокДокументов = ИнтерфейсыВзаимодействияБРОВызовСервера.ДокументыРеализацииПолномочийНО(Объект.Ссылка);
		Если Не ЗначениеЗаполнено(СписокДокументов) Тогда 
			Возврат;
		КонецЕсли;
		
		ДанныеДокументооборота = ДанныеДокументооборота(СписокДокументов);
		ДанныеДоговоровПоТоварам = ДанныеДоговоровПоТоварам();
		ЗаполнениеТаблицыРНПТ(ДанныеДокументооборота, ДанныеДоговоровПоТоварам);
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось получить занчения РНПТ");
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
