Функция ШаблонОбщихПараметров(СтрокаМетаданного,ИнтерактивныйРежим = Истина) Экспорт 
	// --- 
	
	Если СтрокаМетаданного = "Документ.CW_ДоходыПоГрузоперевозке" Тогда
		
		ШП = Новый Структура("СписокКонстант,СписокУП,СписокГУП,СписокНП");
		// ----------------------------------------------------------------------------  
		СписокКонстант = Новый Массив;
		// --- 
		СписокКонстант.Добавить("ВалютаРегламентированногоУчета"); // всегда
		СписокКонстант.Добавить("CW_КонтролироватьПолучениеОригиналовОтКлиентов"); // всегда
		Если ИнтерактивныйРежим Тогда
			СписокКонстант.Добавить("CW_КаталогУслуг"); // при выборе номенклатуры, обсуждаемо
			СписокКонстант.Добавить("CW_КаталогКлиентов"); // при выборе контрагентов, обсуждаемо
			СписокКонстант.Добавить("CW_ИспользованиеБюджетирования"); // всегда
			СписокКонстант.Добавить("CW_ИспользованиеЗаказов"); // всегда
		КонецЕсли;
		// --- 
		ШП.СписокКонстант = СписокКонстант;
		// ----------------------------------------------------------------------------  
		СписокУП = Новый Массив;
		// --- 
		СписокУП.Добавить("ПорядокПрисвоенияНомеров"); // всегда
		СписокУП.Добавить("ВнешнийНумератор"); // всегда
		СписокУП.Добавить("КодВидаОперацииДляИсходящихСчетовФактур");
		СписокУП.Добавить("ОсновнаяСтатьяЗатрат");
		СписокУП.Добавить("ТребованияПостановления735");
		СписокУП.Добавить("ФормироватьСчетаПокупателюНаОплату");
		СписокУП.Добавить("СчетРасчетов_Клиенты_Рубли");
		СписокУП.Добавить("СчетРасчетов_Клиенты_Валюта");
		СписокУП.Добавить("СчетРасчетов_Клиенты_УЕ"); // в модуле всегда, в форме только при подборе авансов
		СписокУП.Добавить("СтатьяПрочихДоходовИРасходовДляКорректировок");
		СписокУП.Добавить("УчитыватьКурсыВалютАвансовДляБазыНДС");
		Если ИнтерактивныйРежим Тогда
			СписокУП.Добавить("СчетаФактурыПоПостановлению1137"); // только при заполнении по неперевыставленным
		КонецЕсли;
		ШП.СписокУП = СписокУП;

		СписокГУП = Новый Массив;
		СписокГУП.Добавить("СистемаНалогообложения");
		СписокГУП.Добавить("ДатаПереходаНаУСН");
		СписокГУП.Добавить("ОбъектНалогообложенияУСН");   
		СписокГУП.Добавить("ПлательщикНДСПрименяющийУСН");
		ШП.СписокГУП = СписокГУП;

		СписокНП = Новый Массив;
		СписокНП.Добавить("КонтролироватьСрокДоговоров");   
		СписокНП.Добавить("КонтролироватьСрокДействияПриложения");   
		
		Если ИнтерактивныйРежим Тогда
			СписокНП.Добавить("ОтображатьНоменклатурнуюГруппу");
			СписокНП.Добавить("ОтображатьЕИ");
			СписокНП.Добавить("ПодставлятьУполномоченныхЛицПриСозданииДокументов");
			СписокНП.Добавить("ПодставлятьСтавкуНДС");
			СписокНП.Добавить("ОбратныйПересчетВДокументах");
			СписокНП.Добавить("ВыводитьФинансовыйСтатусВДокументах");
			СписокНП.Добавить("ГруппироватьПоПоставщикамПриПеревыставлении"); // только при заполнении
		КонецЕсли; 
		ШП.СписокНП = СписокНП;							

		Возврат(ШП);
	КонецЕсли; 
	
	Если СтрокаМетаданного = "Документ.CW_РасходыПоГрузоперевозке" 
		ИЛИ СтрокаМетаданного = "Документ.CW_РасходыПоПриобретениям"
		ИЛИ СтрокаМетаданного = "Документ.CW_РасходыПодотчетногоЛица"Тогда
		
		ШП = Новый Структура("СписокКонстант,СписокУП,СписокГУП,СписокНП");

		СписокКонстант = Новый Массив;
		СписокКонстант.Добавить("ВалютаРегламентированногоУчета"); // всегда
		СписокКонстант.Добавить("CW_КонтролироватьПолучениеОригиналовОтПоставщиков"); // всегда
		СписокКонстант.Добавить("CW_ОсновноеПодразделение"); // всегда
		Если ИнтерактивныйРежим Тогда
			СписокКонстант.Добавить("CW_КаталогУслуг"); // при выборе номенклатуры, обсуждаемо
			СписокКонстант.Добавить("CW_КаталогПоставщиков"); // при выборе контрагентов, обсуждаемо
			СписокКонстант.Добавить("CW_ИспользованиеБюджетирования"); // всегда
			СписокКонстант.Добавить("CW_ИспользованиеЗаказов"); // всегда
		КонецЕсли;

		ШП.СписокКонстант = СписокКонстант;
		СписокУП = Новый Массив;
		СписокУП.Добавить("ПорядокПрисвоенияНомеров"); // всегда
		СписокУП.Добавить("ОсновноеПодразделение");
		СписокУП.Добавить("ОсновнаяСтатьяЗатрат");
		СписокУП.Добавить("ОсновнойСпособУчетаНДС");
		СписокУП.Добавить("ГруппировкаЗатратПоПодразделениям");
		СписокУП.Добавить("ТребованияПостановления735");
		СписокУП.Добавить("ФормироватьСчетаПоставщикаНаОплату");
		СписокУП.Добавить("КодВидаОперацииДляВходящихСчетовФактур");
		СписокУП.Добавить("СчетРасчетов_Поставщики_Рубли");
		СписокУП.Добавить("СчетРасчетов_Поставщики_Валюта");
		СписокУП.Добавить("СчетРасчетов_Поставщики_УЕ"); // в модуле всегда, в форме только при подборе авансов
		СписокУП.Добавить("СтатьяПрочихДоходовИРасходовДляКорректировок");
		СписокУП.Добавить("УчитыватьКурсыВалютАвансовДляБазыНДС");
		СписокУП.Добавить("УчитыватьНДСВСебестоимости");
		Если ИнтерактивныйРежим Тогда
			СписокУП.Добавить("СчетаФактурыПоПостановлению1137"); // только при заполнении по неперевыставленным
		КонецЕсли;

		ШП.СписокУП = СписокУП;
		СписокГУП = Новый Массив;
		СписокГУП.Добавить("СистемаНалогообложения");
		СписокГУП.Добавить("ДатаПереходаНаУСН");
		СписокГУП.Добавить("ОбъектНалогообложенияУСН");
		СписокГУП.Добавить("РаздельныйУчетНДСНаСчете19");  
		СписокГУП.Добавить("ПлательщикНДСПрименяющийУСН");
		
		ШП.СписокГУП = СписокГУП;
		СписокНП = Новый Массив;
		СписокНП.Добавить("КонтролироватьСрокДоговоров"); 
		СписокНП.Добавить("КонтролироватьСрокДействияПриложения"); 
		
		//СписокНП.Добавить("ОсновнойСтатусВходящихДокументов");
		Если ИнтерактивныйРежим Тогда
			СписокНП.Добавить("ОтображатьНоменклатурнуюГруппу");
			СписокНП.Добавить("ОтображатьЕИ");
			СписокНП.Добавить("ПодставлятьСтавкуНДС");
			СписокНП.Добавить("ОбратныйПересчетВДокументах");
			СписокНП.Добавить("ВыводитьФинансовыйСтатусВДокументах");			
		КонецЕсли; 

		ШП.СписокНП = СписокНП;		
		Возврат(ШП);
		
	КонецЕсли; 
	
	Если СтрокаМетаданного = "Документ.CW_ЗакрытиеГрузоперевозки" Тогда
		
		ШП = Новый Структура("СписокКонстант,СписокУП,СписокГУП,СписокНП");
		СписокКонстант = Новый Массив;
		СписокКонстант.Добавить("ВалютаРегламентированногоУчета"); // всегда

		ШП.СписокКонстант = СписокКонстант;
		СписокУП = Новый Массив;
		СписокУП.Добавить("ТребованияПостановления735");
		СписокУП.Добавить("ПорядокПрисвоенияНомеров"); // всегда
		СписокУП.Добавить("ВнешнийНумератор"); // всегда
		Если ИнтерактивныйРежим Тогда
			СписокУП.Добавить("СчетаФактурыПоПостановлению1137"); // только при заполнении по неперевыставленным
		КонецЕсли;
		ШП.СписокУП = СписокУП;

		СписокГУП = Новый Массив;
		ШП.СписокГУП = СписокГУП;

		СписокНП = Новый Массив;
		Если ИнтерактивныйРежим Тогда
			СписокНП.Добавить("ПодставлятьСтавкуНДС");
			СписокНП.Добавить("ОбратныйПересчетВДокументах");
		КонецЕсли; 

		ШП.СписокНП = СписокНП;	
		Возврат(ШП);
	КонецЕсли;
КонецФункции
