 
Функция СтранаНаДату(Судно, ДатаСведений) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Судно)
		ИЛИ ТипЗнч(Судно) <> Тип("СправочникСсылка.CW_Суда") Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаСведений) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Судно, "Страна");
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Судно", Судно);
	Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ИсторияСтраныСудов.Период) КАК Период,
	|	ИсторияСтраныСудов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЗначенияСтран
	|ИЗ
	|	Справочник.CW_Суда.ИсторияСтраны КАК ИсторияСтраныСудов
	|ГДЕ
	|	ИсторияСтраныСудов.Ссылка = &Судно
	|	И ИсторияСтраныСудов.Период <= &ДатаСведений
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияСтраныСудов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияСтраныСудов.Страна КАК Страна
	|ИЗ
	|	ЗначенияСтран КАК ЗначенияСтран
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CW_Суда.ИсторияСтраны КАК ИсторияСтраныСудов
	|		ПО ЗначенияСтран.Ссылка = ИсторияСтраныСудов.Ссылка
	|			И ЗначенияСтран.Период = ИсторияСтраныСудов.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Страна;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Судно, "Страна");
	КонецЕсли;
	
КонецФункции

Процедура УстановитьАктуальноеЗначениеИсторииСтраны(Страна, ИсторияСтраны) Экспорт
	
	КоличествоЗаписей = ИсторияСтраны.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ИсторияСтраны.Сортировать("Период");
		АктуальнаяЗаписьИстории = ИсторияСтраны[КоличествоЗаписей - 1];
		АктуальнаяЗаписьИстории.Страна = Страна;
		
	КонецЕсли;
	
КонецПроцедуры

