
Функция ПолучитьМассивСсылокДляРасчетаСтатусов(ИсходныйМассив, ДоступныеТипыПоОпциям) Экспорт
	
	МассивСсылок = Новый Массив;
	
	Для Каждого ОбъектСтатуса из ИсходныйМассив Цикл
		Если Не ЗначениеЗаполнено(ОбъектСтатуса) Тогда   
			//Вдруг кому-то пришло в голову пуссыту ссылку передать
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ОбъектСтатуса) = Тип("СправочникСсылка.CW_Заказы") Тогда
			ДобавитьВМассивСвязаныеСсылки(ОбъектСтатуса, МассивСсылок, ДоступныеТипыПоОпциям);	
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Заявка", ОбъектСтатуса.Метаданные()) 
			И ДоступныеТипыПоОпциям.Найти(Тип("СправочникСсылка.CW_Заявки")) <> Неопределено Тогда
			Если ЗначениеЗаполнено(ОбъектСтатуса.Заявка) Тогда
				МассивСсылок.Добавить(ОбъектСтатуса.Заявка);
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Заказ", ОбъектСтатуса.Метаданные()) 
			И ДоступныеТипыПоОпциям.Найти(Тип("СправочникСсылка.CW_Заказы")) <> Неопределено Тогда
			Если ЗначениеЗаполнено(ОбъектСтатуса.Заказ) Тогда
				МассивСсылок.Добавить(ОбъектСтатуса.Заказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат МассивСсылок;
	
КонецФункции

Процедура ДобавитьВМассивСвязаныеСсылки(ОбъектСтатуса, МассивСсылок, ДоступныеТипыПоОпциям) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыРасчетаСтатусов.Ссылка КАК Ссылка
	               |ИЗ
	               |	КритерийОтбора.CW_ОбъектыРасчетаСтатусов(&ОбъектСтатуса) КАК CW_ОбъектыРасчетаСтатусов";
	
	Запрос.УстановитьПараметр("ОбъектСтатуса", ОбъектСтатуса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если МассивСсылок.Найти(Выборка.Ссылка) = Неопределено 
			И ДоступныеТипыПоОпциям.Найти(ТипЗнч(Выборка.Ссылка)) <> Неопределено Тогда
			МассивСсылок.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры