
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Элементы.ГрузоперевозкиЗаказ.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов");
	// --- 
	ТЗ = ПолучитьИзВременногоХранилища(_сф.ст_ПолучитьСвойство(Параметры,"Адрес"));
	Грузоперевозки.Загрузить(ТЗ);
	
	// --- 
	
	Элементы.Документ.Видимость = Ложь;
	ДокументП = _сф.ст_ПолучитьСвойство(Параметры,"Ссылка");
	Если ДокументП <> Неопределено Тогда
		
		Документ = ДокументП;
		Элементы.Документ.Видимость = Истина;
				
	КонецЕсли; 
	
	// --- 
	
	//Элементы.ГрузоперевозкиЗаказ.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// анализируем
	Если Элемент.ТекущиеДанные.Заказ.Пустая() Тогда
		
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Грузоперевозка);
		
	Иначе
		
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Заказ);
		
	КонецЕсли; 
	
КонецПроцедуры
