
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Отбор.Элементы.Очистить();
	
	ЭлементОбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОбора.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь;
	ЭлементОбора.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда) 
	
	ПереместитьЭлемент(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)

	ПереместитьЭлемент(1);
	
КонецПроцедуры  

&НаКлиенте
Процедура СвернутьВсе(Команда)  
	
	CW_КлючевыеПоказателиКлиент.СвернутьГруппыПоказателей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда) 
	
	CW_КлючевыеПоказателиКлиент.РазвернутьГруппыПоказателей(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПереместитьЭлемент(Направление)  
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПеремещениеЭлемента(ТекущаяСтрока, Направление);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПеремещениеЭлемента(СправочникСсылка, Направление) 
	
	ИндексЭлемента = СправочникСсылка.ИндексЭлемента + Направление;
	Если ИндексЭлемента < 1 Тогда
		ИндексЭлемента = 1;
	КонецЕсли;
	
	СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	СправочникОбъект.ИндексЭлемента = ИндексЭлемента;
	СправочникОбъект.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиКлючевыхПоказателей.Ссылка КАК Ссылка,
	|	НастройкиКлючевыхПоказателей.Владелец КАК Владелец,
	|	НастройкиКлючевыхПоказателей.Родитель КАК Родитель,
	|	НастройкиКлючевыхПоказателей.ИндексЭлемента КАК ИндексЭлемента
	|ИЗ
	|	Справочник.CW_НастройкиКлючевыхПоказателей КАК НастройкиКлючевыхПоказателей
	|ГДЕ
	|	НастройкиКлючевыхПоказателей.ИндексЭлемента = &ИндексЭлемента
	|	И НастройкиКлючевыхПоказателей.Ссылка <> &Ссылка
	|	И НастройкиКлючевыхПоказателей.Владелец = &Владелец
	|	И НастройкиКлючевыхПоказателей.Родитель = &Родитель
	|	И НастройкиКлючевыхПоказателей.Владелец = &Владелец
	|	И НастройкиКлючевыхПоказателей.ЭтоГруппа = &ЭтоГруппа";   
	
	Запрос.УстановитьПараметр("Владелец", 			СправочникСсылка.Владелец);
	Запрос.УстановитьПараметр("Родитель", 			СправочникСсылка.Родитель);
	Запрос.УстановитьПараметр("Ссылка", 			СправочникСсылка); 
	Запрос.УстановитьПараметр("ИндексЭлемента", 	ИндексЭлемента); 
	Запрос.УстановитьПараметр("ЭтоГруппа", 			СправочникСсылка.ЭтоГруппа); 
	Запрос.УстановитьПараметр("Владелец", 			ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ИндексЭлемента = СправочникОбъект.ИндексЭлемента - Направление;
		Если ИндексЭлемента < 1 Тогда
			ИндексЭлемента = 1;
		КонецЕсли;
		
		СправочникОбъект.ИндексЭлемента = ИндексЭлемента;
		СправочникОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

