
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		ОдинОбъект	= "грузоперевозку";
		Несколько 	= "грузоперевозки";
	ИначеЕсли ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Заказы") Тогда   
		ОдинОбъект 	= "заказ";
		Несколько 	= "заказы";  
	ИначеЕсли ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Заявки") Тогда
		ОдинОбъект	= "заявку";
		Несколько 	= "заявки";
	КонецЕсли;
	
	Если ПараметрКоманды.Количество() = 1 Тогда
		ТекстВопроса = СтрШаблон("Извлечь %1 в архива?", ОдинОбъект);	
	Иначе
		ТекстВопроса = СтрШаблон("Извлечь %1 в архива?", Несколько);	
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;       
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды", 			ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", 	ПараметрыВыполненияКоманды);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;   
	
	Источник 		= ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник;
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда     
		
		CW_АрхивОбъектовКлиент.ПеревестиИзвлечьОбъектыИзАрхива(Источник, ПараметрКоманды, Ложь);
		
	ИначеЕсли ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Заказы") Тогда   
		
		Если ПараметрКоманды.Количество() = 1 Тогда
			ТекстВопроса = СтрШаблон("Извлечь грузоперевозки %1 из архива?", "заказа");	
		Иначе
			ТекстВопроса = СтрШаблон("Извлечь грузоперевозки %1 из архива?", "заказов");	
		КонецЕсли;
		
		Режим 		= РежимДиалогаВопрос.ДаНет;       
		Оповещение 	= Новый ОписаниеОповещения("ПродолжитьПереводВАрхивЗаказов", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0); 
		
	ИначеЕсли ТипЗнч(ПараметрКоманды[0]) = Тип("СправочникСсылка.CW_Заявки") Тогда
		
		CW_АрхивОбъектовКлиент.ПеревестиИзвлечьОбъектыИзАрхива(Источник, ПараметрКоманды, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура ПродолжитьПереводВАрхивЗаказов(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		//Просто закрыли форму. Ничего не делаем.
        Возврат;
	КонецЕсли; 
	
 	Источник 		= ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник;
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;

	ПереводитьГрузоперевозки = (Результат = КодВозвратаДиалога.Да);

	CW_АрхивОбъектовКлиент.ПеревестиИзвлечьОбъектыИзАрхива(Источник, ПараметрКоманды, Ложь, ПереводитьГрузоперевозки);
	
КонецПроцедуры


