
Процедура ЗаполнитьДокументСписаниеСРасчетногоСчета(СтруктураПараметров, АдресРезультат) Экспорт
	
	Если ТипЗнч(СтруктураПараметров.ДокументВыписки) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		ВидЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская;
	КонецЕсли;
	
 	Если ТипЗнч(СтруктураПараметров.ДокументВыписки) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ВидЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская;
	КонецЕсли;   
	
	Если ВидЗадолженности = Неопределено Тогда
		ВызватьИсключение "не удалось определить вид задолженности!";
	КонецЕсли;

	СоответствиеСчетовАванса = ПолучитьСоответствиеСчетовАванса(ВидЗадолженности);
	
	СтруктураТаблиц = СтруктураПараметров.ПустыеТаблицыДокументов;  
	
	Отбор = Новый Структура("ИндексКартинки",  1); //Только строки второрго уровня
	НайденныеСтроки = СтруктураПараметров.ДереваСчетов.Строки.НайтиСтроки(Отбор, Истина); 
	
	Для Каждого ПодчиненаяСтрока из НайденныеСтроки Цикл
		
		Если ТипЗнч(ПодчиненаяСтрока.Сделка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
			СчетАванса 			= СоответствиеСчетовАванса.Получить(ПодчиненаяСтрока.СчетЗадолженности); 
			Если СчетАванса = Неопределено Тогда
				СчетАванса = ПодчиненаяСтрока.СчетЗадолженности;
			КонецЕсли;
			СчетЗадолженности	= СчетАванса;
		Иначе     
			СчетЗадолженности 	= ПодчиненаяСтрока.СчетЗадолженности;
			СчетАванса 			= СоответствиеСчетовАванса.Получить(СчетЗадолженности); 
			Если СчетАванса = Неопределено Тогда
				СчетАванса = ПодчиненаяСтрока.СчетЗадолженности;
			КонецЕсли;  
		КонецЕсли;
		
		КурсВзаиморасчетов = ?(ПодчиненаяСтрока.СуммаВал = 0 , 1, ПодчиненаяСтрока.Сумма / ПодчиненаяСтрока.СуммаВал);  
		
		СтавкаЧислом 	= CW_Финансы.ПолучитьСтавкуНДС(ПодчиненаяСтрока.СтавкаНДС)/100;
		СуммаНДС 		= ПодчиненаяСтрока.Сумма  	* СтавкаЧислом / (1+СтавкаЧислом);
		СуммаНДСВал 	= ПодчиненаяСтрока.СуммаВал * СтавкаЧислом / (1+СтавкаЧислом);
		
		// - строка в документ "CW_Оплаты"
		НоваяСтрокаОплаты = СтруктураТаблиц.Оплаты.Добавить();
		НоваяСтрокаОплаты.Счет 	= ПодчиненаяСтрока.Родитель.ДокументВзаиморасчетов;
		НоваяСтрокаОплаты.Акт 	= ПодчиненаяСтрока.ДокументВзаиморасчетов; 
		
		НоваяСтрокаОплаты.СчетЗадолженности 	= ПодчиненаяСтрока.СчетЗадолженности; 
		НоваяСтрокаОплаты.СчетАванса 			= СчетАванса;  
		
		НоваяСтрокаОплаты.Оплата 		= ПодчиненаяСтрока.СуммаВал;
		НоваяСтрокаОплаты.Оплата_БВ 	= ПодчиненаяСтрока.Сумма;
		НоваяСтрокаОплаты.Курс 			= КурсВзаиморасчетов;
		НоваяСтрокаОплаты.СтавкаНДС 	= ПодчиненаяСтрока.СтавкаНДС;
		
		Если СтруктураПараметров.УчетныйДоговор.РасчетыВУсловныхЕдиницах Тогда
			СуммаПлатежа = ПодчиненаяСтрока.Сумма;
		Иначе
			СуммаПлатежа = ПодчиненаяСтрока.СуммаВал;
		КонецЕсли;

		// - строка в документ "Списание с расчетного счета" / "Поступление на расчетный счет"  
		НоваяСтрокаСписаниеСРасчетногоСчета = СтруктураТаблиц.ТаблицаБухгалтескогоДокумента.Добавить(); 
		НоваяСтрокаСписаниеСРасчетногоСчета.ДоговорКонтрагента 				= СтруктураПараметров.УчетныйДоговор;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СпособПогашенияЗадолженности 	= Перечисления.СпособыПогашенияЗадолженности.ПоДокументу;	
		НоваяСтрокаСписаниеСРасчетногоСчета.Сделка 							= ПодчиненаяСтрока.Сделка;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СуммаПлатежа 					= СуммаПлатежа;	
		НоваяСтрокаСписаниеСРасчетногоСчета.КурсВзаиморасчетов 				= КурсВзаиморасчетов;	
		НоваяСтрокаСписаниеСРасчетногоСчета.КратностьВзаиморасчетов 		= 1;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СуммаВзаиморасчетов 			= ПодчиненаяСтрока.СуммаВал;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СтавкаНДС 						= ПодчиненаяСтрока.СтавкаНДС;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СуммаНДС 						= СуммаНДСВал;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СтатьяДвиженияДенежныхСредств 	= СтруктураПараметров.СтатьяДвиженияДенежныхСредств;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СчетУчетаРасчетовСКонтрагентом 	= СчетЗадолженности;	
		НоваяСтрокаСписаниеСРасчетногоСчета.СчетУчетаРасчетовПоАвансам 		= СчетАванса;	
		
	КонецЦикла;   
	
	
	//Заполняем документы
	ДокументОплата = СтруктураПараметров.ДокументОплата;  
	Если ДокументОплата <> Неопределено Тогда
		ДокументОплатаОбъект = ДокументОплата.ПолучитьОбъект(); 
		Если ДокументОплатаОбъект.ПометкаУдаления Тогда
			ДокументОплатаОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	Иначе
		ДокументОплатаОбъект = Документы.CW_Оплата.СоздатьДокумент();  
		ДокументОплатаОбъект.Дата 					= СтруктураПараметров.ДатаДокумента;
		ДокументОплатаОбъект.Организация 			= СтруктураПараметров.Организация;
		ДокументОплатаОбъект.Контрагент 			= СтруктураПараметров.Контрагент;
		ДокументОплатаОбъект.Договор 				= СтруктураПараметров.Договор;
		ДокументОплатаОбъект.ПриложениеКДоговору 	= СтруктураПараметров.ПриложениеКДоговору;
		ДокументОплатаОбъект.Валюта 				= СтруктураПараметров.Договор.ВалютаДоговора;
		ДокументОплатаОбъект.Основание 				= СтруктураПараметров.ДокументВыписки;
		ДокументОплатаОбъект.ВидЗадолженности 		= ВидЗадолженности;       
	КонецЕсли; 
	
	ДокументОплатаОбъект.СтатьяДвиженияДенежныхСредств 	= СтруктураПараметров.СтатьяДвиженияДенежныхСредств;      
	ДокументОплатаОбъект.ЭтоВозврат						= Истина;      
	ДокументОплатаОбъект.ХранилищеДерева 				= Новый ХранилищеЗначения(СтруктураПараметров.ДереваСчетов);
	
	ДокументОплатаОбъект.Оплата.Загрузить(СтруктураТаблиц.Оплаты);
	ДокументОплатаОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	ДокументВыписки = СтруктураПараметров.ДокументВыписки;  
	ДокументВыпискиОбъект = ДокументВыписки.ПолучитьОбъект(); 
	
	ДокументВыпискиОбъект.РасшифровкаПлатежа.Загрузить(СтруктураТаблиц.ТаблицаБухгалтескогоДокумента);

	ДокументВыпискиОбъект.СуммаДокумента = ДокументВыпискиОбъект.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	ДокументВыпискиОбъект.Записать(РежимЗаписиДокумента.Запись);

КонецПроцедуры 

Функция ПолучитьСоответствиеСчетовАванса(ВидЗадолженности) Экспорт
	
	ПланСчетов = ПланыСчетов.Хозрасчетный;
	
	Соответствие = Новый Соответствие;                   
	Если ВидЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская Тогда
		Соответствие.Вставить(ПланСчетов.РасчетыСПокупателями,		ПланСчетов.РасчетыПоАвансамПолученным);	
		Соответствие.Вставить(ПланСчетов.РасчетыСПокупателямиВал,	ПланСчетов.РасчетыПоАвансамПолученнымВал);
		Соответствие.Вставить(ПланСчетов.РасчетыСПокупателямиУЕ ,   ПланСчетов.РасчетыПоАвансамПолученнымУЕ);	
	ИначеЕсли ВидЗадолженности = Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская Тогда
		Соответствие.Вставить(ПланСчетов.РасчетыСПоставщиками,		ПланСчетов.РасчетыПоАвансамВыданным);	
		Соответствие.Вставить(ПланСчетов.РасчетыСПоставщикамиВал,	ПланСчетов.РасчетыПоАвансамВыданнымВал);
		Соответствие.Вставить(ПланСчетов.РасчетыСПоставщикамиУЕ ,   ПланСчетов.РасчетыПоАвансамВыданнымУЕ);	
	КонецЕсли;
	
	Возврат Соответствие;

КонецФункции
