
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументРегОтчетности = Параметры.ДокументРегОтчетности;
	
	Заголовок = Строка(ДокументРегОтчетности);
	
	Если ТипЗнч(ДокументРегОтчетности) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
		ЗаполнитьПоРеквизитамОтчета();
	Иначе
		ЗаполнитьПоРеквизитамУведомления();
		
		Элементы.ПосмотретьПечатныйБланк.Заголовок = НСтр("ru = 'Посмотреть уведомление'");
		Элементы.ДекорацияПояснениеПросмотр.Заголовок = НСтр("ru = 'Посмотрите и проверьте заполненную печатную форму уведомления'");
		Элементы.ДекорацияПояснениеПоделиться.Заголовок = НСтр("ru = 'Отправьте или сохраните печатную форму уведомления в формате PDF'");
		
		Элементы.ПредставлениеОтчета.Заголовок = НСтр("ru = 'Уведомление'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПосмотретьОтчет(Команда)
	
	БланкОтчета = СформированныйПечатныйБланк();
	
	Если НЕ ЗначениеЗаполнено(БланкОтчета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Просмотр недоступен на мобильном устройстве.
			|Больше возможностей в версии для компьютера.'"));
		
		Возврат;
	КонецЕсли;
	
	ЗапуститьПриложение(БланкОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура Поделиться(Команда)
	
	ПечатныйБланк = СформированныйПечатныйБланк();
	
	Если НЕ ЗначениеЗаполнено(ПечатныйБланк) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Отправка недоступна на мобильном устройстве.
			|Больше возможностей в версии для компьютера.'"));
		
		Возврат;
	КонецЕсли;
	
	МобильныйКлиентБПКлиент.ПоделитьсяФайлами(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПечатныйБланк));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СформированныйПечатныйБланк()
	
	Если ТипЗнч(ДокументРегОтчетности) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
		ПечатныйБланк = ПечатныйБланкРегОтчета();
	Иначе
		ПечатныйБланк = ПечатныйБланкУведомления(ДокументРегОтчетности);
	КонецЕсли;
	
	Если ПечатныйБланк = Неопределено Тогда
		Возврат ПечатныйБланк;
	КонецЕсли;
	
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ПечатныйБланк.ИмяФайлаПечатногоБланка);
	ФайлПечатногоБланка = ПечатныйБланк.ФайлПечатногоБланка;// ДвоичныеДанные
	
	ПутьКВременномуКаталогу = МобильныйКлиентБПКлиент.ПолучитьВременныйКаталогДокументов();
	
	ПолноеИмяФайла = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ПутьКВременномуКаталогу, ИмяФайла);
	
	ФайлПечатногоБланка.Записать(ПолноеИмяФайла);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоРеквизитамОтчета()
	
	РеквизитыОтчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРегОтчетности, "Организация, ПредставлениеПериода,
		|ПредставлениеВида, НаименованиеОтчета");
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыОтчета);
	
	НаименованиеОтчета = СтрШаблон(НСтр("ru = '%1, Вид: %2'"), НаименованиеОтчета,
		ПредставлениеВида);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРеквизитамУведомления()
	
	РеквизитыУведомления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРегОтчетности, "Организация, Дата, ВидУведомления");
	
	Организация = РеквизитыУведомления.Организация;
	ПредставлениеПериода = Формат(РеквизитыУведомления.Дата, "ДФ=dd.MM.yyyy");
	ПредставлениеВида = РеквизитыУведомления.ВидУведомления;
	НаименованиеОтчета = СтрШаблон(НСтр("ru = '%1 от %2'"), РеквизитыУведомления.ВидУведомления,
		ПредставлениеПериода);
	
КонецПроцедуры

&НаКлиенте
Функция ПечатныйБланкРегОтчета()
	
	ПараметрыПечати = Новый Структура("АдресБланкаPDFВоВременномХранилище");
	
	МобильныйКлиентБПКлиент.НапечататьРегламентированныйОтчетPDF(ДокументРегОтчетности, ПараметрыПечати);
	
	Если ПараметрыПечати.АдресБланкаPDFВоВременномХранилище = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПараметрыПечати.АдресБланкаPDFВоВременномХранилище.Количество() <> 0 Тогда
		ВыгрузкаОтчета = ПараметрыПечати.АдресБланкаPDFВоВременномХранилище[0];
		
		ПечатныйБланкОтчета = Новый Структура;
		
		ПечатныйБланкОтчета.Вставить("ФайлПечатногоБланка", ПолучитьИзВременногоХранилища(ВыгрузкаОтчета.АдресВоВременномХранилище));
		ПечатныйБланкОтчета.Вставить("ИмяФайлаПечатногоБланка", ВыгрузкаОтчета.Наименование);
	КонецЕсли;
	
	Возврат ПечатныйБланкОтчета;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПечатныйБланкУведомления(ДокументРегОтчетности)
	
	Если ТипЗнч(ДокументРегОтчетности) = Тип("ДокументСсылка.УведомлениеОСпецрежимахНалогообложения") Тогда
		ВыбранноеУведомление = ДокументРегОтчетности;
	ИначеЕсли ТипЗнч(ДокументРегОтчетности) = Тип("ДокументСсылка.УведомлениеОбИсчисленныхСуммахНалогов") Тогда
		ВыбранноеУведомление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегОтчетности, "Уведомление");
	КонецЕсли;
	
	Попытка
		ПечатныйБланкУведомления = ПечатьУведомления(ВыбранноеУведомление);
	Исключение
		ЗаписьЖурналаРегистрации("ПросмотрУведомленияНаМК", УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ОписаниеОшибки()));
		
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ПечатныйБланкУведомления;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПечатьУведомления(Уведомление)
	
	ЛистыУведомления = УведомлениеОСпецрежимахНалогообложенияВызовСервера.ПечатьУведомленияБРО(Уведомление);
	
	ФорматПакета = ТипФайлаПакетаОтображаемыхДокументов.PDF;
	
	ПакетТабличныхДокументов = Новый ПакетОтображаемыхДокументов;
	
	Для Каждого Лист Из ЛистыУведомления Цикл
		ПакетТабличныхДокументов.Состав.Добавить(Лист.Значение[0]);
	КонецЦикла;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
	
	ПакетТабличныхДокументов.Записать(ИмяФайла, ФорматПакета);
	ДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);
	УдалитьФайлы(ИмяФайла);
	
	ИмяФайлаПечатногоБланка = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(Строка(Уведомление) + ".pdf");
	
	ПечатныйБланкУведомления = Новый Структура();
	ПечатныйБланкУведомления.Вставить("ФайлПечатногоБланка", ДанныеФайла);
	ПечатныйБланкУведомления.Вставить("ИмяФайлаПечатногоБланка", ИмяФайлаПечатногоБланка);
	
	Возврат ПечатныйБланкУведомления;
	
КонецФункции

&НаКлиенте
Процедура ДекорацияПодключениеМКНажатие(Элемент)
	
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ПредложениеОформитьЗаявлениеНаПодключение");
	
КонецПроцедуры

#КонецОбласти
