
Процедура ПроверитьКонтрагентаПоБазеЛКК(Форма, ИНН) Экспорт  

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник", Форма); 
	
	ПараметрыПроверкиКонтрагента = Новый Структура;
	ПараметрыПроверкиКонтрагента.Вставить("ИНН", ИНН);
	
	Если СтрНачинаетсяС(Форма.ИмяФормы, "Документ.CW_ДоходыПоГрузоперевозке") Тогда
		ПараметрыПроверкиКонтрагента.Вставить("Организация", Форма.Объект.Организация);
	КонецЕсли;
	
	РезультатВыполнения =  CW_ЭлектронныйОбменДаннымиВызовСервера.ПроверитьКонтрагентаПоБазеЛККНаСервереВФоне(ПараметрыПроверкиКонтрагента);  
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;     
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПроверкиКонтрагентаПоБазеЛКК", ЭтотОбъект, ДополнительныеПараметры); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры 

Процедура ПослеПроверкиКонтрагентаПоБазеЛКК(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	ЭлементыФормы = Дополнительныепараметры.Источник.Элементы;    
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		Результат = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		Если СтрНачинаетсяС(Дополнительныепараметры.Источник.ИмяФормы, "Документ.CW_ДоходыПоГрузоперевозке") Тогда  
			Если ЭлементыФормы.Найти("ГруппаОбменДокументами") <> Неопределено Тогда
				ЭлементыФормы.ГруппаОбменДокументами.Видимость = (Результат["СтатусОбмена"] = 1); 
			КонецЕсли;
		Иначе
			Если ЭлементыФормы.Найти("ГруппаОбменДокументами") <> Неопределено Тогда
				ЭлементыФормы.ГруппаОбменДокументами.Видимость = (Результат["СтатусОбмена"] > 0); 
			КонецЕсли;
		КонецЕсли;
		
		Если ЭлементыФормы.Найти("ГипрессылкаПодробнее") <> Неопределено Тогда
			ЭлементыФормы.ГипрессылкаПодробнее.Видимость = (Результат["СтатусОбмена"] = 1); 
		КонецЕсли;
		Если ЭлементыФормы.Найти("ГипрессылкаПолучить") <> Неопределено Тогда
			ЭлементыФормы.ГипрессылкаПолучить.Видимость  = (Результат["СтатусОбмена"] = 2);
		КонецЕсли;
		
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПолучитьДокументПоставщика(Форма) Экспорт    

	ОбъектФормы = Форма.Объект;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИдентификаторДокумента", 	СокрЛП(Форма.ИдентификаторДокументаПоставщика));
	СтруктураПараметров.Вставить("Организаия", 				ОбъектФормы.Организация);
	СтруктураПараметров.Вставить("Контрагент", 				ОбъектФормы.Контрагент); 
	
	СтруктураПараметров.Вставить("НомерСчета", 				ОбъектФормы.НомерСчета); 
	СтруктураПараметров.Вставить("ДатаСчета", 				ОбъектФормы.ДатаСчета); 
	СтруктураПараметров.Вставить("НомерАкта", 				ОбъектФормы.НомерАкта); 
	СтруктураПараметров.Вставить("ДатаАкта", 				ОбъектФормы.ДатаАкта); 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник", Форма); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьЗагрузкуДокументаПоставщика", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаЗагрузкиДокумента", СтруктураПараметров, Форма,,,,ОписаниеОповещения);
	
КонецПроцедуры      

Процедура ПродолжитьЗагрузкуДокументаПоставщика(Результат, ДополнительныеПарамтеры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда 
		
		CW_ЭлектронныйОбменДаннымиВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(Результат);	
		
		CW_БухгалтерияЭкспедитораКлиент.ПоказатьОшибкуИсполнения(
			"Не удалось получить документ!", 
			Результат, 
			ДополнительныеПарамтеры.Источник);
	Иначе    
		
		ОбъектФормы = ДополнительныеПарамтеры.Источник.Объект;
		
		Модифицированность = Истина;
		
		ДополнительныеПарамтеры.Источник.ИдентификаторДокументаПоставщика = СокрЛП(Результат.УИД);
		
		ОбъектФормы.ПредъявленСчет 	= Результат["Счет"]["Счет"];
		ОбъектФормы.ДатаСчета 		= Результат["Счет"]["Дата"];
		ОбъектФормы.НомерСчета 		= Результат["Счет"]["Номер"]; 
		
		ОбъектФормы.ПредъявленАкт 	= Результат["Акт"]["Акт"];
		ОбъектФормы.ДатаАкта 		= Результат["Акт"]["Дата"];
		ОбъектФормы.НомерАкта 		= Результат["Акт"]["Номер"]; 
		
		ОбъектФормы.ПредъявленСФ 	= Результат["СчетФактура"]["СчетФактура"];
		ОбъектФормы.ДатаСФ 			= Результат["СчетФактура"]["Дата"];
		ОбъектФормы.НомерСФ 			= Результат["СчетФактура"]["Номер"]; 
		
		//Вызываем экспорные функции формы
		ДополнительныеПарамтеры.Источник.ОбновитьНомераДокументовНаКлиенте();
		ДополнительныеПарамтеры.Источник.ОткрытьФормуЗагрузкиДокумента(Результат.ТабличныйДокумент, Истина); 
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ОбработатьСсылкуПодробнее() Экспорт
	
	ИмяФайла = ПолучитьИмяФайлаРуководствоПоНастройке();
	#Если Вебклиент Тогда 
		ПерейтиПоНавигационнойСсылке(ИмяФайла);
	#Иначе
		ЗапуститьПриложение(ИмяФайла);
	#КонецЕсли
	
КонецПроцедуры 

Функция ПолучитьИмяФайлаРуководствоПоНастройке()
	
	Возврат "http://www.coralway.ru/products/programs_cw/AF8/UserGuide/UserGuide_AFEX.pdf";    
	
КонецФункции


Процедура СкрытьГруппуОбменДокументами(Форма) Экспорт
	
	ЭлементыФормы = Форма.Элементы;    
	Если ЭлементыФормы.Найти("ГруппаОбменДокументами") <> Неопределено Тогда
		ЭлементыФормы.ГруппаОбменДокументами.Видимость = Ложь; 
	КонецЕсли;
	
КонецПроцедуры