
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)   
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды);

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродложитьОтключениеОтСервиса", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВопрос(Оповещение, "Сервис ""Реестры НДС 0%"" будет отключен. Продолжить?", Режим, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПродложитьОтключениеОтСервиса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ CW_РаботаСВнешнимиРесурсамиСервер.ПроверитьПараметрыАвторизацииНаСервереТехподдрежки() Тогда
		
		ПоказатьПредупреждение(,"Не указаны параметры авторизации на сервере техподдержки!",,"Авторизация");  
		
	Иначе 
		
		Результат = ВыполнитьОтклчюениеСервисаНаСервере();	
		Если Результат.Успешно Тогда    
			Если  ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник.ИмяФормы = "ОбщаяФорма.CW_Настройки" Тогда
				ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник.CW_ОбменГИСЭПДИспользуется = Не Результат.Успешно;
				ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник.Элементы.ОбщаяКомандаCW_ОбменГИСЭПДПодключить.Видимость = Результат.Успешно;
			КонецЕсли;                                                                                          
			
			ПоказатьПредупреждение(, "Cервис ""Реестры НДС 0%""
			|успешно отключен!");
			
			ОбновитьИнтерфейс(); 
			
		Иначе
			ПоказатьПредупреждение(, Результат.Сообщение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ВыполнитьОтклчюениеСервисаНаСервере(); 

	Возврат CW_ОбменГИСЭПДДополнительный.ВыполнитьОтключениеСервиса(); 
	
КонецФункции
