
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ДокументПроведен(ПараметрКоманды) Тогда
		ПоказатьПредупреждение(, "Необходимо провести документ!");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;     
	СтруктураПараметров.Вставить("Документ", ПараметрКоманды); 
	
	ВерсияБюджета = ПолучитьВерсиюБюджетаПользователя();
	Если ЗначениеЗаполнено(ВерсияБюджета) Тогда
		СтруктураПараметров.Вставить("ВерсияБюджета",ВерсияБюджета); 
	КонецЕсли;
	
	ОткрытьФорму("Отчет.CW_ПроверкаДокументаПоБюджету.Форма.ФормаОтчета",СтруктураПараметров,,Истина,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаСервере
Функция ДокументПроведен(ПараметрКоманды)
	
	Возврат ПараметрКоманды.Проведен; 
	
КонецФункции

&НаСервере
Функция ПолучитьВерсиюБюджетаПользователя()
	
	ВерсияБюджета = CW_Бюджетирование.ПолучитьОсновнуюВерсиюБюджета();
	Если ЗначениеЗаполнено(ВерсияБюджета) Тогда
		ВерсияБюджета = ПредопределенноеЗначение("Справочник.CW_ВерсииБюджетов.Основная");
	КонецЕсли;
	
	Возврат ВерсияБюджета;
	
КонецФункции