#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция СформироватьОтчет(Результат=Неопределено, ДанныеРасшифровки = Неопределено) Экспорт
	
	Если Результат=Неопределено Тогда
		Результат = Новый ТабличныйДокумент;
	КонецЕсли;
	
	Результат.АвтоМасштаб = Истина;
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
// ---------------------------------------------------------------------------- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	CW_ДенежныеСредстваОстаткиИОбороты.Валюта КАК Валюта,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.Касса КАК Касса,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток КАК СальдоНачальное,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.СуммаПриход КАК Приход,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.СуммаРасход КАК Расход,
	               |	CW_ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток КАК СальдоКонечное
	               |ИЗ
	               |	РегистрНакопления.CW_ДенежныеСредства.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК CW_ДенежныеСредстваОстаткиИОбороты
	               |ИТОГИ
	               |	СУММА(СальдоНачальное),
	               |	СУММА(Приход),
	               |	СУММА(Расход),
	               |	СУММА(СальдоКонечное)
	               |ПО
	               |	Валюта,
	               |	Касса";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	// --- 
		
	// ---------------------------------------------------------------------------- 
	
	Макет = ПолучитьМакет("ОтчетПоКассам");
	
	ТД = Новый ТабличныйДокумент;
	ТД.АвтоМасштаб = Истина;
	ТД.НачатьАвтогруппировкуСтрок();
	// ---------------------------------------------------------------------------- 
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заголовок = ВРег("Ведомость по кассам"); 
	Область.Параметры.Фильтр = "Период: "+Формат(НачалоПериода, "ДЛФ=Д")+?(КонецПериода=Дата(1,1,1),Неопределено," - "+Формат(КонецПериода, "ДЛФ=Д"));
	ТД.Вывести(Область);
	
	// --- 
	
	Область = Макет.ПолучитьОбласть("Шапка");
	СтрГруппировка = "Валюта / Касса";
	Если (ВыводитьСтатьи) Тогда
		СтрГруппировка = СтрГруппировка + " / Статья ДДС"
	КонецЕсли; 
	Область.Параметры.Группировка = СтрГруппировка; 
	Область.Параметры.НачПериода = Формат(НачалоПериода,"ДЛФ=Д");
	Область.Параметры.КонПериода = Формат(КонецПериода,"ДЛФ=Д");
	ТД.Вывести(Область);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		Область = Макет.ПолучитьОбласть("СтрокаВалюта");
		Область.Параметры.Группировка = Выборка.Валюта;
		ЗаполнитьЗначенияСвойств(Область.Параметры,Выборка);
		Область.Параметры.ПараметрРасшифровки = Выборка.Валюта; 
		ТД.Вывести(Область,1);
		
		ВыборкаПоКассам = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоКассам.Следующий() Цикл
			
			Область = Макет.ПолучитьОбласть("СтрокаКасса");
			Область.Параметры.Группировка = ВыборкаПоКассам.Касса;
			ЗаполнитьЗначенияСвойств(Область.Параметры,ВыборкаПоКассам);
			Область.Параметры.ПараметрРасшифровки = ВыборкаПоКассам.Касса; 
			Область.Параметры.Касса = ВыборкаПоКассам.Касса;
			ТД.Вывести(Область,2);
			
			Если (ВыводитьСтатьи) Тогда
				
				// получаем таблицу движений по статьям ДДС
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	CW_ДенежныеСредства.СтатьяДДС,
				               |	ВЫБОР
				               |		КОГДА CW_ДенежныеСредства.ВидДвижения = &Приход
				               |			ТОГДА CW_ДенежныеСредства.Сумма
				               |		ИНАЧЕ 0
				               |	КОНЕЦ КАК Приход,
				               |	ВЫБОР
				               |		КОГДА CW_ДенежныеСредства.ВидДвижения = &Расход
				               |			ТОГДА CW_ДенежныеСредства.Сумма
				               |		ИНАЧЕ 0
				               |	КОНЕЦ КАК Расход
				               |ПОМЕСТИТЬ тмп
				               |ИЗ
				               |	РегистрНакопления.CW_ДенежныеСредства КАК CW_ДенежныеСредства
				               |ГДЕ
				               |	CW_ДенежныеСредства.Касса = &Касса
				               |	И CW_ДенежныеСредства.Валюта = &Валюта
				               |	И CW_ДенежныеСредства.Период МЕЖДУ &НачалоПериода И &КонецПериода
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ
				               |	тмп.СтатьяДДС КАК СтатьяДДС,
				               |	СУММА(тмп.Приход) КАК Приход,
				               |	СУММА(тмп.Расход) КАК Расход
				               |ИЗ
				               |	тмп КАК тмп
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	тмп.СтатьяДДС
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	СтатьяДДС";
				Запрос.УстановитьПараметр("Приход", ВидДвиженияНакопления.Приход);
				Запрос.УстановитьПараметр("Расход", ВидДвиженияНакопления.Расход);
				Запрос.УстановитьПараметр("Касса", ВыборкаПоКассам.Касса);
				Запрос.УстановитьПараметр("Валюта", Выборка.Валюта);
				Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
				Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода)); 
				
				ТЗ = Запрос.Выполнить().Выгрузить();
				
				Для каждого Стр Из ТЗ Цикл
					
					Область = Макет.ПолучитьОбласть("СтрокаДДС");
					Область.Параметры.Группировка = Стр.СтатьяДДС;
					ЗаполнитьЗначенияСвойств(Область.Параметры,Стр);
					Область.Параметры.ПараметрРасшифровки = Стр.СтатьяДДС;
					Область.Параметры.Касса = ВыборкаПоКассам.Касса;
					ТД.Вывести(Область,3);
					
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	
	Область = Макет.ПолучитьОбласть("Подвал");
	ТД.Вывести(Область);
	
	// --- 
	
	ТД.ЗакончитьАвтогруппировкуСтрок();
	Результат.Вывести(ТД);
	
	// ---------------------------------------------------------------------------- 
	
КонецФункции
#КонецЕсли