
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды", ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды); 
	
	ТекстВопроса = "Установить дату окончания слежения?";
	Если ПараметрКоманды.Количество() > 1 Тогда
		ТекстВопроса = "Установить дату окончания слежения для выделенного оборудования на слежении?";
	КонецЕсли;

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПередВыборомДатыОкончанияСлежения", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередВыборомДатыОкончанияСлежения(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

 	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораДатыОкончанияСлежения", ЭтотОбъект, ДополнительныеПараметры);

  	ПоказатьВводДаты(ОписаниеОповещения, ТекущаяДата(), "Укажите дату окончания слежения", ЧастиДаты.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДатыОкончанияСлежения(РезультатВыбора, ДополнительныеПараметры)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ОтслеживаемоеОборудование",	ДополнительныеПараметры.ПараметрКоманды);
	ПараметрыПроцедуры.Вставить("ОкончаниеСлежения",			РезультатВыбора);
	
	РезультатВыполнения =  ПродолжитьУстановкуДатыОкончнаияСлеженияНаСервереВФоне(ПараметрыПроцедуры); 
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;     
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПриЗавершенииУстановкиДатыОкончанияСлежения", ЭтотОбъект, ДополнительныеПараметры); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры    

&НаСервере 
Функция ПродолжитьУстановкуДатыОкончнаияСлеженияНаСервереВФоне(ПараметрыПроцедуры)  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение  = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне   = ложь;   

	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ОтслеживаемоеОборудование.ЗавершитьСлежениеОборудования", ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции 

&НаКлиенте 
Процедура ПриЗавершенииУстановкиДатыОкончанияСлежения(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда   
		
        ПоказатьОповещениеПользователя("Окончание слежения", ,"Оборудование не слежении",,,Строка(Новый УникальныйИдентификатор));
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_ОтслеживаемоеОборудование"));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка установки окончания слежения");  
		
	КонецЕсли;  
	
КонецПроцедуры  

