#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция - Содержит тип объекта
//
// Параметры:
//  ТипОбъекта	 - 	 тип 
// 
// Возвращаемое значение:
//   - истина/ложь
//
Функция СодержитТипОбъекта(НазначениеСтатуса, ТипОбъекта) Экспорт
	
	ОбъектНазначенияСтатуса = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ОбъектыНазначенийСтатусов.ОбъектНазначенияСтатуса КАК ОбъектНазначенияСтатуса
	               |ИЗ
	               |	РегистрСведений.CW_ОбъектыНазначенийСтатусов КАК CW_ОбъектыНазначенийСтатусов
	               |ГДЕ
	               |	CW_ОбъектыНазначенийСтатусов.НазначениеСтатуса = &НазначениеСтатуса
	               |	И CW_ОбъектыНазначенийСтатусов.ОбъектНазначенияСтатуса = &ОбъектНазначенияСтатуса";
	
	Запрос.УстановитьПараметр("НазначениеСтатуса", НазначениеСтатуса);
	Запрос.УстановитьПараметр("ОбъектНазначенияСтатуса", ОбъектНазначенияСтатуса);
	
	РезультатаЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатаЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьНазначениеСтатусовПоТипуОбъекрта(ТипОбъекта) Экспорт
	
	Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ОбъектыНазначенийСтатусов.НазначениеСтатуса КАК НазначениеСтатуса,
	               |	CW_ОбъектыНазначенийСтатусов.ОбъектНазначенияСтатуса КАК ОбъектНазначенияСтатуса
	               |ИЗ
	               |	РегистрСведений.CW_ОбъектыНазначенийСтатусов КАК CW_ОбъектыНазначенийСтатусов
	               |ГДЕ
	               |	CW_ОбъектыНазначенийСтатусов.ОбъектНазначенияСтатуса = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НазначениеСтатуса;
	КонецЕсли;
	
	Возврат Неопределено;
	
	
КонецФункции

Функция ОбъектИспользуетсяВСистемеСтатусов(ТипОбъекта) Экспорт
	
	Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ОбъектыНазначенийСтатусов.НазначениеСтатуса КАК НазначениеСтатуса
	               |ИЗ
	               |	РегистрСведений.CW_ОбъектыНазначенийСтатусов КАК CW_ОбъектыНазначенийСтатусов
	               |ГДЕ
	               |	CW_ОбъектыНазначенийСтатусов.ОбъектНазначенияСтатуса = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция НазначениеСтатусаПрименимоКОбъекту(НазначениеСтатуса, ТипОбъекта) Экспорт
	
	Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ОбъектыНазначенийСтатусов.НазначениеСтатуса КАК НазначениеСтатуса,
	               |	CW_ОбъектыНазначенийСтатусов.ОбъектНазначенияСтатуса КАК ОбъектНазначенияСтатуса
	               |ИЗ
	               |	РегистрСведений.CW_ОбъектыНазначенийСтатусов КАК CW_ОбъектыНазначенийСтатусов
	               |ГДЕ
	               |	CW_ОбъектыНазначенийСтатусов.НазначениеСтатуса = &НазначениеСтатуса
	               |	И CW_ОбъектыНазначенийСтатусов.ОбъектНазначенияСтатуса = &Идентификатор";
	
	Запрос.УстановитьПараметр("НазначениеСтатуса",  НазначениеСтатуса);
	Запрос.УстановитьПараметр("Идентификатор", 		Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции

#КонецЕсли
