#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("СоздатьСтатусНовогоОбъекта") Тогда
		Справочники.CW_СтатусыДокументов.СоздатьСтатусНовогоОбъекта(Ссылка, ВлияетНаПроведениеДокументаВБухгалтерскомУчете);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СоздатьСтатусНовогоОбъекта", Истина);
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли