
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо записать элемент!", 30);
	Иначе
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ОбъектСогласования",	ПараметрКоманды);
		ПараметрыОповещения.Вставить("ФормаОбъекта",		ПараметрыВыполненияКоманды.Источник);
		
		ПараметрыОпвещения = CW_СогласованиеСервер.ПолучитьПараметрыОповещения();
		
		ПараметрыОбъекта = Новый Структура("ОбъектСогласования", ПараметрКоманды);
		ОткрытьФорму("ОбщаяФорма.CW_ФормаСогласования", ПараметрыОбъекта, ПараметрыВыполненияКоманды.Источник,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры