
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	ПериодОбработки.ДатаНачала 		= НачалоМесяца(ТекущаяДата());
	ПериодОбработки.ДатаОкончания 	= КонецМесяца(ТекущаяДата());
	ПериодОбработки.Вариант 		= ВариантСтандартногоПериода.ЭтотКвартал; 
	
	Организация = CW_Настройки.ОсновнаяОрганизация();
	ПолучитьАктуальныйПриказ();
	
КонецПроцедуры   

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	 ПолучитьАктуальныйПриказ();
КонецПроцедуры

&НаСервере
Процедура ПолучитьАктуальныйПриказ()
	Приказ = CW_ДоходыНерезидентовДополнительный.ПолучитьАктуальныйПриказ(ПериодОбработки.ДатаОкончания);
КонецПроцедуры


//Обработка флажков
&НаКлиенте
Процедура СнятьФлажки(Команда)
	
   СнятьУстановитьФлажки(Ложь);  
   
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
   СнятьУстановитьФлажки(Истина); 
   
КонецПроцедуры 

&НаСервере
Процедура СнятьУстановитьФлажки(Флаг)
   
   Для каждого СтрокаТаблицы из ТаблицаДокументов Цикл
	   СтрокаТаблицы.Выбор = Флаг;
   КонецЦикла;
   
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьФлажкиАвтоматически(Команда) 
	
	УстановитьФлажкиАвтоматическиНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлажкиАвтоматическиНаСервере()  
	
	Для Каждого СтрокаТаблицы из ТаблицаДокументов Цикл
		СтрокаТаблицы.Выбор = СтрокаТаблицы.ТребуетсяЗаполнение или СтрокаТаблицы.Отклонение <> 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиТребуентсяЗаполнение(Команда)
	
	УстановитьФлажкиТребуентсяЗаполнениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлажкиТребуентсяЗаполнениеНаСервере()  
	
	Для Каждого СтрокаТаблицы из ТаблицаДокументов Цикл
		СтрокаТаблицы.Выбор = СтрокаТаблицы.ТребуетсяЗаполнение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиОтклонение(Команда)  
	
	УстановитьФлажкиОтклонениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлажкиОтклонениеНаСервере()  
	
	Для Каждого СтрокаТаблицы из ТаблицаДокументов Цикл
		СтрокаТаблицы.Выбор = СтрокаТаблицы.Отклонение <> 0;
	КонецЦикла;
	
КонецПроцедуры
//Обработка флажков


&НаКлиенте
Процедура Обновить(Команда)   
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗполнениеТаблицы", ЭтотОбъект);
	
	Если ТаблицаДокументов.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Таблица документов будет очищена. Продолжить? ", Режим, 0);	
		
	Иначе
		
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Процедура ПродолжитьЗполнениеТаблицы(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	РезультатВыполнения =  НачатьЗаполнениеСпискавВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьЗаполнениеСписка", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры 

&НаСервере
Функция НачатьЗаполнениеСпискавВФоне()    
	
	ВремТаблицаДокументов = ТаблицаДокументов.Выгрузить(); 
	ВремТаблицаДокументов.Очистить();             

	ДатаОкончания = ПериодОбработки.ДатаОкончания;
	Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = КонецГода(ТекущаяДата());	
	Конецесли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Приказ", 					Приказ);
	ПараметрыПроцедуры.Вставить("ДатаНачала", 				ПериодОбработки.ДатаНачала);
	ПараметрыПроцедуры.Вставить("ДатаОкончания",			ДатаОкончания);
	ПараметрыПроцедуры.Вставить("Организация", 				Организация); 
	ПараметрыПроцедуры.Вставить("ИгнорироватьИсключения",	Ложь); 
	ПараметрыПроцедуры.Вставить("ТаблицаДокументов", 		ВремТаблицаДокументов);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Заполнение списка документов";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ДоходыНерезидентовПакетноеФормированиеСведенийОДоходах.ПолучитьСписокДоходов",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьЗаполнениеСписка(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда   
		
		ЗавершитьЗаполнениеСпискаНаСевере(РезультатВыполнения.АдресРезультата);
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось получить список документов!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка получения списка документов");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьЗаполнениеСпискаНаСевере(Знач АдресРезультата)
	
	времТаблицаДокументов = ПолучитьИзВременногоХранилища(АдресРезультата);
	ТаблицаДокументов.Загрузить(времТаблицаДокументов);   
	
	
	СуммаПоДокументу	= ТаблицаДокументов.Итог("СуммаПоДокументу");
	СуммаДоходов		= ТаблицаДокументов.Итог("СуммаДоходов");
	
	Элементы.Сформировать.Доступность = (ТаблицаДокументов.Количество() > 0);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)  
	
	Отбор   = Новый Структура("Выбор", Истина);
	мСтроки = ТаблицаДокументов.НайтиСтроки(Отбор);
	Если мСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбрано ни одного документа для формирования сведений о доходах!");
		Возврат;
	КонецЕсли;

	РезультатВыполнения =  НачатьФормированиеСведенийОДоходахВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьФормированиеСведенийОДоходах", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры  

&НаСервере
Функция НачатьФормированиеСведенийОДоходахВФоне()  
	
	ВремТаблицаДокументов = ТаблицаДокументов.Выгрузить(); 
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Приказ", 				Приказ);    
	ПараметрыПроцедуры.Вставить("Организация", 			Организация);    
	ПараметрыПроцедуры.Вставить("ТаблицаДокументов", 	ВремТаблицаДокументов);    
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Формирование сведений о доходах";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ДоходыНерезидентовПакетноеФормированиеСведенийОДоходах.СформироватьСведенияОДоходах",ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьФормированиеСведенийОДоходах(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПродолжитьЗполнениеТаблицы", ЭтотОбъект);
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_ДоходыНерезидентовСведенияОДоходах"));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Сведения о доходах не сформированы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,""); 
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = ТаблицаДокументов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПоказатьЗначение(, СтрокаТаблицы.Документ);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьПоВыделеннымСтрокам(Команда) 
	
	ВыделенныеСтроки = Элементы.ТаблицаДокументов.ВыделенныеСтроки;
	УстановитьПоВыделеннымСтрокамНаСервере(ВыделенныеСтроки);  
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПоВыделеннымСтрокамНаСервере(ВыделенныеСтроки)  
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТекущая = ТаблицаДокументов.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаТекущая.Выбор = Истина;	
	КонецЦикла;
	
КонецПроцедуры

