#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ПроверитьКорректностьНомераСчета(Номер, ТекстОшибки = "") Экспорт

	Если НЕ ТипЗнч(Номер) = Тип("Строка") Тогда
		ТекстОшибки = "Номер счета должен быть строкой.";
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Номер) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПроверитьКорректностьНомераСчета()

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ПометкаУдаления ИЛИ Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = "Запись банковского счета (" + Владелец + ") " + Наименование + ", код " + Код;
	
	//Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(СокрЛП(НомерСчета)) Тогда 
	//	ОбщегоНазначения.СообщитьОбОшибке("В номере банковского счета присутствуют не только цифры. 
	//	|Возможно, номер указан неправильно", , Заголовок);
	//КонецЕсли;

	// Проверка заполнения обязательных реквизитов
	Если НЕ ЗначениеЗаполнено(ВалютаДенежныхСредств) Тогда
		Сообщить("Не выбрана валюта.");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерСчета) Тогда
		Сообщить("Не указан номер счета.");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Банк) Тогда
		Сообщить("Не выбран банк.");
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли