#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.0.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВнешняяКоманда();
	
	СтруктураОписания.Наименование 				= "Пример внешней команды для журналов";
	СтруктураОписания.Описание 					= "Пример внешней команды для журналов";
	СтруктураОписания.Версия					= "3.2.1.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	
	//Параметры команды
	CW_ПодключаемыеКомандыСервер.УстановитьПараметрыВнешнейКоманды(СтруктураОписания, 
			"Обработка.CW_ЖурналГрузоперевозок", 
			"Форма",
			,
			,
			,
			"Обновить комментарий");
			
			//Методы команды
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "ВыполнитьВнешнююКомандуНаКлиенте");
	
	//Формы  команды
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыОбъекта(СтруктураОписания, "Форма");
	
	Возврат СтруктураОписания;
	
КонецФункции
#КонецЕсли
