
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		
		ПоказатьКнопкуВывестиДляТекущего = Ложь;
		Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			ИмяКритерияОтбора =  "CW_ДокументыПоГрузоперевозке";
		Иначеесли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Заказы") Тогда
			ИмяКритерияОтбора =  "CW_ДокументыПоЗаказу";
		Иначе
			ИмяКритерияОтбора =  "CW_СвязанныеДокументы";
			ПоказатьКнопкуВывестиДляТекущего = Истина;
		КонецЕсли ;
		
		ОткрытьФорму("ОбщаяФорма.CW_СтруктураПодчиненности",Новый Структура("ОбъектОтбора, ИмяКритерияОтбора,ПоказатьКнопкуВывестиДляТекущего", ПараметрКоманды, ИмяКритерияОтбора, ПоказатьКнопкуВывестиДляТекущего),
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Источник.КлючУникальности,
		ПараметрыВыполненияКоманды.Окно);
		
	КонецЕсли;
	
КонецПроцедуры
