
Процедура ПередЗаписью(Отказ)
	
	Если Не ПроверитьУникальностьКода() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Код не уникальный!",,"Объект.Код",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьУникальностьКода()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ЛогистическиеСтатусы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ЛогистическиеСтатусы КАК CW_ЛогистическиеСтатусы
	               |ГДЕ
	               |	CW_ЛогистическиеСтатусы.Код = &Код
	               |	И CW_ЛогистическиеСтатусы.Ссылка <> &Ссылка
	               |	И CW_ЛогистическиеСтатусы.ИдентификаторОбъекта = &ИдентификаторОбъекта";
	
	Запрос.УстановитьПараметр("Код",					Код);
	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", 	ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьНовыйКод()
	
	НовыйКод = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ЛогистическиеСтатусы.Ссылка КАК Ссылка,
	               |	CW_ЛогистическиеСтатусы.Код КАК Код
	               |ИЗ
	               |	Справочник.CW_ЛогистическиеСтатусы КАК CW_ЛогистическиеСтатусы
	               |ГДЕ
	               |	CW_ЛогистическиеСтатусы.ИдентификаторОбъекта = &ИдентификаторОбъекта
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код УБЫВ";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выбрка = РезультатЗапроса.Выбрать();
	Если Выбрка.Следующий() Тогда
		Попытка
			НовыйКод = Число(Выбрка.Код)+1;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат НовыйКод;
	
КонецФункции

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	НовыйКод = ПолучитьНовыйКод();
	Если НовыйКод <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Код = Прав("000000000" + Формат(НовыйКод,"ЧГ=0"), 9);
	КонецЕсли;
	
КонецПроцедуры

