#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	Настройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	Если Настройки = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	// --- 
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	// установим заголовок
	МетаданныеОтчета = ЭтотОбъект.Метаданные();
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок",ВРег(МетаданныеОтчета.Синоним));
	
	// Установим параметры
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ?(ЗначениеЗаполнено(Настройки.Организация),Настройки.Организация,Неопределено));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ПоАктам", Настройки.ВариантФормирования = 0);
	// --- 
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Дата1", НачалоДня(Настройки.НачалоПериода));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Дата2", КонецДня(Настройки.КонецПериода));	
	// --- 
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(Настройки.НачалоПериода));
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(Настройки.КонецПериода));	
	// --- 
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("КонтейнернаяПеревозка", Перечисления.CW_ВидыПеревозок.Контейнер);
	Размер20 = Справочники.CW_РазмерыКонтейнеров.НайтиПоНаименованию("20",Ложь);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Размер20", Размер20);
	Размер40 = Справочники.CW_РазмерыКонтейнеров.НайтиПоНаименованию("40",Ложь);
	НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("Размер40", Размер40);
	
	Если (НЕ ЗначениеЗаполнено(Размер20) ИЛИ НЕ ЗначениеЗаполнено(Размер40)) Тогда
		
		Сообщить("Не заполнен справочник размеров контейнеров.");
		
	КонецЕсли; 
	
	Если (Настройки.ПорядокОтражения = 0) Тогда
		
		ПорядокОтраженияРасходов = Новый Массив;
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"));
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы"));
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление"));
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам"));
		
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ПорядокОтраженияРасходов", ПорядокОтраженияРасходов);
		
		ПорядокОтраженияДоходов = Новый Массив;
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление"));
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам"));
		
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ПорядокОтраженияДоходов", ПорядокОтраженияДоходов);
		
	ИначеЕсли (Настройки.ПорядокОтражения = 1) Тогда 
		
		ПорядокОтраженияРасходов = Новый Массив;
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"));
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы"));
		
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ПорядокОтраженияРасходов", ПорядокОтраженияРасходов);
		
		ПорядокОтраженияДоходов = Новый Массив;
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));
		
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ПорядокОтраженияДоходов", ПорядокОтраженияДоходов);
		
	ИначеЕсли (Настройки.ПорядокОтражения = 2) Тогда 
		
		ПорядокОтраженияРасходов = Новый Массив;
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление"));
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам"));
	
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ПорядокОтраженияРасходов", ПорядокОтраженияРасходов);
		
		ПорядокОтраженияДоходов = Новый Массив;
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление"));
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам"));
	
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("ПорядокОтраженияДоходов", ПорядокОтраженияДоходов);
		
	КонецЕсли; 
	
	Если (Настройки.ИсключатьВнутрихолдинговыеВзаиморасчеты) Тогда
		
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("КонтрагентыХолдинга", CW_Финансы.ПолучитьКонтрагентовХолдинга());	
		
	Иначе
		
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра("КонтрагентыХолдинга", Новый Массив);
		
	КонецЕсли; 
	
	// обрабатываем разделы и показатели
	Для каждого Поле Из НастройкиСКД.Выбор.Элементы Цикл
		
		Если ТипЗнч(Поле)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			
			Если (Поле.Поле = "Статистика") Тогда
				Продолжить;
			КонецЕсли; 
			
			// проходим по подчинённым элементам "расходы-доходы-прибыль"
			Для каждого ПодРаздел Из Поле.Элементы Цикл
				
				Если ТипЗнч(ПодРаздел)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
					
					ИмяПодраздела = Подраздел.Заголовок;
					Если ИмяПодраздела = "Расходы" ИЛИ ИмяПодраздела = "Доходы" Тогда
						
						ПодРаздел.Использование = Истина;
						
					КонецЕсли; 
					
					Если ПодРаздел.Использование Тогда
						
						// проходим по подчинённым элементам
						Для каждого Показатель Из ПодРаздел.Элементы Цикл
							
							ИмяПоля = СтрЗаменить(Строка(Показатель.Поле),Строка(Поле.Заголовок)+"."+ИмяПодраздела+"."+Строка(Поле.Заголовок)+ИмяПодраздела,"");
							Показатель.Использование = Настройки.Показатели.НайтиПоЗначению(ИмяПоля).Пометка;
							
						КонецЦикла; 
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла;  
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// формируем структуру отчета по группировкам
	//НастройкиСКД.Структура.Очистить();
	ТекущийРодитель = НастройкиСКД.Структура[0].Строки; 
	ТекущийРодитель.Очистить();
	// --- 
	Для каждого Группировка Из Настройки.Группировки Цикл
		
		// ГруппировкаКомпоновкиДанных
		НоваяГруппировка = ТекущийРодитель.Добавить();
		// --- 
		ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		ПолеГруппировки.Использование = Истина;
		// --- 
		НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		НовоеАвтоПолеВыбора.Использование=Истина;
		// --- 
		ЭлементПорядка = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(Группировка.ИмяПоля);
		НС = ?(Группировка.Сортировка=Перечисления.CW_НаправлениеСортировки.ПоВозрастанию,НаправлениеСортировкиКомпоновкиДанных.Возр,НаправлениеСортировкиКомпоновкиДанных.Убыв);
		ЭлементПорядка.ТипУпорядочивания = НС;
		ЭлементПорядка.Использование = Истина;
		// --- 
		НоваяГруппировка.Имя = Группировка.Представление;
		НоваяГруппировка.Использование = Истина;
		// --- 
		ТекущийРодитель = НоваяГруппировка.Структура;
		
	КонецЦикла; 
	
	// ---------------------------------------------------------------------------- 
	
КонецПроцедуры

#КонецЕсли
