///УДАЛИТЬ ВСЕ!

//getdata   
Функция getdatapost(Запрос) 
	
	УстановитьПривилегированныйРежим(Истина);  
	
	СтрокаJSON 		= Запрос.ПолучитьТелоКакСтроку();
	СтруктураJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтрокаJSON);   
	
	ИмяПользователя	= XMLЗначение(Тип("Строка"), 	СтруктураJSON.UserName); 
	Вариант 		= XMLЗначение(Тип("Число"), 	СтруктураJSON.version); 
	ЗначениеПрофиля	= XMLЗначение(Тип("Строка"), 	СтруктураJSON.CurrentProfile);  
	
	Если ПустаяСтрока(ЗначениеПрофиля) Тогда
		Профиль = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");
	Иначе
		Профиль = XMLЗначение(тип("СправочникСсылка.CW_ВебПрофили"),ЗначениеПрофиля);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);	
		Ответ.УстановитьТелоИзСтроки("Не удалось идентифицировать пользователя");
		Возврат Ответ;
	КонецЕсли;	
	
	ДанныеПользователя 	= CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(ИмяПользователя);
	ТребуетсяПеревод 	= ДанныеПользователя.Язык <> ПредопределенноеЗначение("Справочник.CW_Языки.ru");
	
	//Доступные пользователю профили
	ТаблицаДоступныхПрофилей	= CW_ЛичныйКабинетКлиентаСервер.ПолучитьПрофилиПользователя(ДанныеПользователя, Профиль.ОсновнойПрофиль, "ГРУЗОПЕРЕВОЗКИ");
	Если ТаблицаДоступныхПрофилей.Количество() = 0 Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);	
		Ответ.УстановитьТелоИзСтроки("Нет доступных профилей");
		Возврат Ответ;
	КонецЕсли;
	
	Если НЕ Профиль.Пустая() Тогда
		СтрокаДоступныхПрофилей = ТаблицаДоступныхПрофилей.Найти(Профиль, "ВебПрофиль"); 
		Если СтрокаДоступныхПрофилей = Неопределено Тогда
			Профиль = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Если Профиль.Пустая()  Тогда
		ПерваяСтрокаПрофилей = ТаблицаДоступныхПрофилей[0];
		Профиль = ПерваяСтрокаПрофилей.ВебПрофиль;
	КонецЕсли;
	
	ДанныеПрофиля = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПрофиляГрузоперевозок(Профиль);
	//----Доступные пользователю профили
	
	СтуктураJSON = Новый Структура;
	
	version = новый Структура;
	version.Вставить("id",			XMLСтрока(ДанныеПрофиля.Ссылка));  
	version.Вставить("nameRus",		XMLСтрока(ДанныеПрофиля.ПредставлениеНаРусском));
	version.Вставить("nameEng",		XMLСтрока(ДанныеПрофиля.ПредставлениеНаАнглийском));
	
	СтуктураJSON.Вставить("version", version);
	
	ТЗДанные = CW_ЛичныйКабинетКлиентаСервер.ПолучитьТаблицуГрузоперевозок(ДанныеПрофиля.Ссылка, Вариант);
	
	table = новый Массив;   
	
	Для Каждого СтрокаДанных из ТЗДанные Цикл
		
		СтруктураСтроки = Новый Структура;
		
		Для Каждого Колонка Из ТЗДанные.Колонки Цикл
			ИмяАтрибута 		= Колонка.Имя;
			ЗначениеАтрибута 	= СтрокаДанных[Колонка.Имя];
			
			Если ИмяАтрибута = "Ссылка" Тогда
				СтруктураСтроки.Вставить(ИмяАтрибута, XMLСтрока(ЗначениеАтрибута));
				Продолжить;
			КонецЕсли;
			
			ИмяТипаКолонки 		= Строка(ТипЗнч(ЗначениеАтрибута)); 
			
			Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗначениеАтрибута)) 
				И ТребуетсяПеревод Тогда
				//Пробуем получить перевод
				ЗначениеАтрибута = CW_ПереводыСервер.ПолучитьПеревод(ЗначениеАтрибута,, Справочники.CW_Языки.en);
			КонецЕсли;
			
			СтрокаСтруктуры = ДанныеПрофиля.Ссылка.СтруктураПрофиля.Найти(Нрег(ИмяАтрибута),"Имя");
			Если СтрокаСтруктуры <> Неопределено Тогда
				ИмяТипаКолонки = СтрокаСтруктуры.ТипЗначения;
			Иначе
				Если ИмяАтрибута <> "ЕстьФайлы" 
					И ИмяАтрибута <> "ЕстьДокументы" Тогда
					ИмяТипаКолонки = "Строка"; 
				КонецЕсли;
			КонецЕсли;
			
			Если  ИмяТипаКолонки = "Строка" Тогда
				ЗначениеАтрибута = Строка(ЗначениеАтрибута);
			КонецЕсли;
			
			СтруктураСтроки.Вставить(ИмяАтрибута, XMLСтрока(ЗначениеАтрибута));  
			
		КонецЦикла;
		
		table.Добавить(СтруктураСтроки);
		
	КонецЦикла;                         
	
	СтуктураJSON.Вставить("table", table);  
	
	//Типизация колонок    
	TypeColumns = новый Структура;
	Для Каждого СтрНастройка Из ДанныеПрофиля.Ссылка.СтруктураПрофиля Цикл
		TypeColumns.Вставить(СтрНастройка.Имя, XMLСтрока(СтрНастройка.ТипЗначения));
	КонецЦикла;
	СтуктураJSON.Вставить("TypeColumns", TypeColumns);	
	//Типизация колнок 
	
	//Быстрые отборы
	мСтроки = ДанныеПрофиля.Ссылка.СтруктураПрофиля.НайтиСтроки(Новый Структура("БыстрыйОтбор", Истина));
	
	Selection = новый Структура;
	Для Каждого СтрокаСтруктуры из мСтроки Цикл
		ИмяАтрибута = СтрокаСтруктуры.Имя;
		Selection.Вставить(ИмяАтрибута, XMLСтрока(истина));
	КонецЦикла;
	СтуктураJSON.Вставить("Selection", Selection);	
	//Быстрые отборы
	
	//Фиксация колонок
	мСтроки			= ДанныеПрофиля.Ссылка.СтруктураПрофиля.НайтиСтроки(Новый Структура("Фиксация", ПредопределенноеЗначение("Перечисление.CW_ВариантыФиксацииКолонок.Лево")));
	мСтрокиПраво	= ДанныеПрофиля.Ссылка.СтруктураПрофиля.НайтиСтроки(Новый Структура("Фиксация", ПредопределенноеЗначение("Перечисление.CW_ВариантыФиксацииКолонок.Право")));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мСтроки, мСтрокиПраво, Истина);
	
	Fixation = новый Структура;
	Для Каждого СтрокаСтруктуры из мСтроки Цикл
		ИмяАтрибута 		= СтрокаСтруктуры.Имя;
		ЗначениеАтрибута 	= Строка(СтрокаСтруктуры.Фиксация);
		Fixation.Вставить(ИмяАтрибута, XMLСтрока(ЗначениеАтрибута));
	КонецЦикла;
	СтуктураJSON.Вставить("Fixation", Fixation);	
	//Фиксация колонок

	//Формат печатной формы
	PrintedForm = новый Структура;
	Для Каждого СтрНастройка Из ДанныеПрофиля.Ссылка.СтруктураПрофиля Цикл
		ИмяАтрибута 		= СтрНастройка.Имя;                      
		ЗначениеАтрибута 	= СтрНастройка.Расположение;
		Если ПустаяСтрока(СтрНастройка.Расположение) Тогда
			ЗначениеАтрибута = "Таблица";
		КонецЕсли;
		PrintedForm.Вставить(ИмяАтрибута, XMLСтрока(ЗначениеАтрибута));
	КонецЦикла;
	СтуктураJSON.Вставить("PrintedForm", PrintedForm);	
	//Формат печатной формы
	
	//Формат вывода колонок    
	Formats = новый Структура;
	Для Каждого СтрНастройка Из ДанныеПрофиля.Ссылка.СтруктураПрофиля Цикл
		ФорматВывода = СтрНастройка.Формат;
		Если ПустаяСтрока(ФорматВывода) Тогда
			ФорматВывода = СтрНастройка.ОбъектХарактеристики.ФорматВывода;
		КонецЕсли;
		Если Не ПустаяСтрока(ФорматВывода) Тогда
			ИмяАтрибута 		= СтрНастройка.Имя;
			ЗначениеАтрибута 	= Строка(ФорматВывода);
			Formats.Вставить(ИмяАтрибута,XMLСтрока(ЗначениеАтрибута));
		КонецЕсли;
	КонецЦикла;
	СтуктураJSON.Вставить("Formats", Formats);	
	//Формат вывода колонок	
	
	//профили пользователя
	Profiles = новый Массив;
	Для Каждого СтрокаТаблицы из ТаблицаДоступныхПрофилей Цикл  
		Profile = Новый Структура;
		Profile.Вставить("uid",		XMLСтрока(СтрокаТаблицы.ВебПрофиль));
		Profile.Вставить("name",	XMLСтрока(Строка(СтрокаТаблицы.ВебПрофиль)));
		Profile.Вставить("ru",		XMLСтрока(Строка(СтрокаТаблицы.ПредставлениеНаРусском)));
		Profile.Вставить("en",		XMLСтрока(Строка(СтрокаТаблицы.ПредставлениеНаАнглийском))); 
		Profile.Вставить("attachfiles", XMLСтрока(СтрокаТаблицы.РазрешеноПрикреплятьФайлы)); 
		
		Profiles.Добавить(Profile);
	КонецЦикла;
	СтуктураJSON.Вставить("Profiles", Profiles);	
	//профили пользователя
	
	languages = ПолучитьЯзык(Профиль, ДанныеПользователя.Язык);
	СтуктураJSON.Вставить("languages", languages);
	
	//Версии подсистем
 	ИмяОсновнойПодсистемы 	= CW_ВерсииПодсистемСервер.ИмяОсновнойПодсистемы();  
	ОписаниеПодсистем 		= Новый Структура;
	CW_ВерсииПодсистемСервер.ПриДобавленииПодсистем(ОписаниеПодсистем);

	subsystems = новый Массив;
	Если ОписаниеПодсистем.Свойство(ИмяОсновнойПодсистемы) Тогда  
	 	subsystem = новый Структура;
		subsystem.Вставить("name",		XMLСтрока(ИмяОсновнойПодсистемы));
		subsystem.Вставить("version",  	XMLСтрока(ОписаниеПодсистем[ИмяОсновнойПодсистемы]));
		subsystems.Добавить(subsystem);
	КонецЕсли;
	Если ОписаниеПодсистем.Свойство("CW_ЛичныйКабинетКлиента") Тогда
	 	subsystem = новый Структура;
		subsystem.Вставить("name",		XMLСтрока("ОписаниеПодсистем"));
		subsystem.Вставить("version",  	XMLСтрока(ОписаниеПодсистем.CW_ЛичныйКабинетКлиента));
		subsystems.Добавить(subsystem);
	КонецЕсли;
	СтуктураJSON.Вставить("subsystems", subsystems);
	//Версии подсистем
	
	
	GetFinDoc 	= ДанныеПользователя.ВыгружатьПечатныеФормы и ДанныеПрофиля.ВыводитьФинансовыеДокументы;
	showdebt 	= ДанныеПользователя.ВыгружатьПечатныеФормы и ДанныеПрофиля.ВыводитьЗадолженность;
	notifydebt 	= ДанныеПользователя.ВыгружатьПечатныеФормы и ДанныеПрофиля.УведомлятьОЗадолженности;
	
	ВерсияAF	= CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы(); 
	
	СтуктураJSON.Вставить("GetFinDoc", 		XMLСтрока(GetFinDoc));  
	СтуктураJSON.Вставить("showdebt", 		XMLСтрока(showdebt));  
	СтуктураJSON.Вставить("notifydebt", 	XMLСтрока(notifydebt)); 
	
	СтрокаJSON = CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтуктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);	
	
	Возврат Ответ;
	
КонецФункции

//getprofile
Функция getprofileget(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	username	= Запрос.Заголовки.Получить("username");
	username 	= ?(username = Неопределено, "", XMLЗначение(Тип("Строка"),username)); 
	
	Если Не ЗначениеЗаполнено(username) Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408,,"xml");	
		Ответ.УстановитьТелоИзСтроки("Не удалось идентифицировать пользователя");
		Возврат Ответ;
	КонецЕсли;	
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(username);
	Если Не ЗначениеЗаполнено(ДанныеПользователя.Пользователь) Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408,,"xml");	
		Ответ.УстановитьТелоИзСтроки("Пользователь "+username+" не найден!");
		Возврат Ответ;
	КонецЕсли;	
	
	ТаблицаДоступныхПрофилей	= CW_ЛичныйКабинетКлиентаСервер.ПолучитьПрофилиПользователя(ДанныеПользователя, , "ГРУЗОПЕРЕВОЗКИ");
	Если ТаблицаДоступныхПрофилей.Количество() = 0 Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408,,"xml");	
		Ответ.УстановитьТелоИзСтроки("Нет доступных профилей");
		Возврат Ответ;
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла);
	
	//профили пользователя
	ЗаписьXML.ЗаписатьНачалоЭлемента("Profiles");
	
	Для Каждого СтрокаТаблицы из ТаблицаДоступныхПрофилей Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("profile");	
		ЗаписьXML.ЗаписатьАтрибут("uid",  	XMLСтрока(СтрокаТаблицы.ВебПрофиль));
		
		Если ДанныеПользователя.Язык = ПредопределенноеЗначение("Справочник.CW_Языки.ru") Тогда
			ЗаписьXML.ЗаписатьАтрибут("name", 	XMLСтрока(Строка(СтрокаТаблицы.ПредставлениеНаРусском)));
		ИначеЕсли ДанныеПользователя.Язык <> ПредопределенноеЗначение("Справочник.CW_Языки.en") Тогда
			ЗаписьXML.ЗаписатьАтрибут("name", 	XMLСтрока(Строка(СтрокаТаблицы.ПредставлениеНаАнглийском)));
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("name", 	XMLСтрока(Строка(СтрокаТаблицы.ВебПрофиль)));
		КонецЕсли;

		ЗаписьXML.ЗаписатьКонецЭлемента();  //Profile
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Profiles
	//профили пользователя
	
	ЗаписьXML.Закрыть();
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200,,"xml");	
	Ответ.УстановитьИмяФайлаТела(ИмяВременногоФайла);	
	
	Возврат Ответ;
	
КонецФункции   

Функция ПолучитьЯзык(ВебПрофиль, Язык)
	
	СтрукутраЯзыки = Новый Структура;
	
	Если ВебПрофиль.ДоступенВыводНаАнглийскомЯзыке Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ПереводыВебПрофиля.Язык КАК Язык,
		|	CW_ПереводыВебПрофиля.ИдентифкаторСтроки КАК ИдентифкаторСтроки,
		|	CW_ПереводыВебПрофиля.Перевод КАК Перевод
		|ИЗ
		|	РегистрСведений.CW_ПереводыВебПрофиля КАК CW_ПереводыВебПрофиля
		|ГДЕ
		|	CW_ПереводыВебПрофиля.ВебПрофиль = &ВебПрофиль
		|	И CW_ПереводыВебПрофиля.Язык = Значение(Справочник.CW_Языки.en)";
		
		Запрос.УстановитьПараметр("ВебПрофиль", ВебПрофиль);
		
		РезультатЗапроса 	= Запрос.Выполнить();
		ВыборкаEN			= РезультатЗапроса.Выбрать();
		
		Пока ВыборкаEN.Следующий() Цикл
			СтрокаСтруктуры = ВебПрофиль.СтруктураПрофиля[ВыборкаEN.ИдентифкаторСтроки];
			
			ДанныеЯзыка = новый Структура;
			ДанныеЯзыка.Вставить("ru", СтрокаСтруктуры.Заголовок);
			ДанныеЯзыка.Вставить("en", ВыборкаEN.Перевод);
			СтрукутраЯзыки.Вставить(СтрокаСтруктуры.Имя, ДанныеЯзыка); 
		КонецЦикла;
	Иначе
		//Все на русском
		Для каждого СтрокаСтруктуры из ВебПрофиль.СтруктураПрофиля Цикл   
			ДанныеЯзыка = новый Структура;
			ДанныеЯзыка.Вставить("ru", СтрокаСтруктуры.Заголовок);
			ДанныеЯзыка.Вставить("en", СтрокаСтруктуры.Заголовок);
			СтрукутраЯзыки.Вставить(СтрокаСтруктуры.Имя, ДанныеЯзыка); 
		КонецЦикла;
	КонецЕсли; 
	
	Возврат СтрукутраЯзыки;

	
КонецФункции
