#Область ПрограммныйИнтерфейс

Функция КодТНВЭД(Номенклатура) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "КодТНВЭД").Код;
	
КонецФункции

Функция ШтрихкодыМаркируемойПродукции(СписокОбъектов, АдресХранилища) Экспорт

	ШтрихкодыМаркируемойПродукции = Обработки.ПечатьЭтикеток.НовыйШтрихкодыМаркируемойПродукции();
	
	ОрганизацияПоУмолчанию = Справочники.Организации.ОрганизацияПоУмолчанию();
	
	Для каждого ОписаниеЭтикетки Из СписокОбъектов Цикл
		ОписаниеЭтикетки.Вставить("ИдентификаторСтроки", Новый УникальныйИдентификатор);
		
		НоваяСтрока = ШтрихкодыМаркируемойПродукции.Добавить();
		
		НоваяСтрока.ИдентификаторСтроки = ОписаниеЭтикетки.ИдентификаторСтроки;
		НоваяСтрока.Организация         = ОрганизацияПоУмолчанию;
		НоваяСтрока.Номенклатура        = ОписаниеЭтикетки.Номенклатура;
		НоваяСтрока.Количество          = 1;
		НоваяСтрока.ТипШтрихкода        = ОписаниеЭтикетки.ТипШтрихкода;
		
		
		СтруктураШтрихкода  = Новый Структура;
		СтруктураШтрихкода.Вставить("Штрихкод",        ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ШтрихкодВBase64(ОписаниеЭтикетки.Штрихкод));
		СтруктураШтрихкода.Вставить("ШтрихкодВBase64", Истина);
		
		НоваяСтрока.Штрихкод        = ДанныеВСтрокуJSON(СтруктураШтрихкода);
	КонецЦикла; 
	
	Возврат ПоместитьВоВременноеХранилище(ШтрихкодыМаркируемойПродукции, АдресХранилища);
КонецФункции

Функция ДанныеВСтрокуJSON(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ПараметрыОписанияМаркируемогоТовара(Ссылка, ГосударственныйКонтроль) Экспорт
	
	ПараметрыОписанияМаркируемогоТовара 												= ИнтеграцияИСКлиентСервер.ПараметрыФормированияДанныхПредставленияНастройкиНоменклатуры();
	ПараметрыОписанияМаркируемогоТовара.СсылкаНаОбъект 									= Ссылка;
	ПараметрыОписанияМаркируемогоТовара.ВидПродукции 									= ГосударственныйКонтроль; 
	ПараметрыОписанияМаркируемогоТовара.ДопустимаНастройкаЛогистическойЕдиницы 			= Ложь;
	ПараметрыОписанияМаркируемогоТовара.ПредставлениеВНесколькоСтрок 					= Ложь;
	ПараметрыОписанияМаркируемогоТовара.ОтступПриВыводеНастройкиВидаУпаковки 			= Ложь;
	ПараметрыОписанияМаркируемогоТовара.ВыводитьГиперссылкуНастройкиВидовУпаковокПоGTIN = Ложь;

	Возврат ПараметрыОписанияМаркируемогоТовара;
	
КонецФункции

Функция ПолучитьЧастичноеСодержимоеИКодыОСУ(ТаблицаУпаковок, СсылкаНаОбъект, ИмяТабличнойЧасти, ИмяРеквизитаКоличество = "Количество") Экспорт
	
	ТаблицаТоваров = СсылкаНаОбъект[ИмяТабличнойЧасти].Выгрузить(,"Номенклатура," + ИмяРеквизитаКоличество);
	
	ТаблицаТоваров.Колонки.Добавить("Ссылка"				, Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(СсылкаНаОбъект))));
	ТаблицаТоваров.Колонки.Добавить("Характеристика"		, ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	Если ИмяРеквизитаКоличество <> "Количество" Тогда
		ТаблицаТоваров.Колонки[ИмяРеквизитаКоличество].Имя = "Количество";
	КонецЕсли;
	
	ТаблицаТоваров.ЗаполнитьЗначения(СсылкаНаОбъект, "Ссылка");
	
	ЗаполнитьКодЕдиницыИзмеренияВТаблицеТоваров(ТаблицаТоваров);	
	
	ДанныеШапки 			= ШтрихкодированиеИС.ПолучитьСтруктуруРеквизитовДокумента(СсылкаНаОбъект);
	ПараметрыСканирования 	= ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(ДанныеШапки);
	
	Если Не ПараметрыСканирования.Свойство("ДатаДокумента") Тогда
		ПараметрыСканирования.Вставить("ДатаДокумента", Дата(1,1,1));
	КонецЕсли;

	Возврат ЭлектронноеВзаимодействиеИСМП.ЧастичноеСодержимоеИКодыОСУ(ТаблицаУпаковок, ТаблицаТоваров, ПараметрыСканирования);
	
КонецФункции

//Возвращает массив выбранных пользователем маркированных товаров
//Параметры: ДатаНачалаМаркировки Тип("Дата")
//
//Возвращаемое значение: ИспользуемаяМаркировка Тип("Массив")
//
Функция ПолучитьИспользованиеМаркировки(ДатаНачалаМаркировки) Экспорт

	ИспользуемаяМаркировка = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиУчетаМаркируемойПродукцииИСМП.ВидПродукции.Ссылка КАК ВидПродукции
	               |ИЗ
	               |	РегистрСведений.УдалитьНастройкиУчетаМаркируемойПродукцииИСМП КАК НастройкиУчетаМаркируемойПродукцииИСМП
	               |ГДЕ
	               |	НастройкиУчетаМаркируемойПродукцииИСМП.ВестиУчетПродукции = ИСТИНА
	               |	И НастройкиУчетаМаркируемойПродукцииИСМП.ДатаКонтрольПроизводства <= &ДатаНачалаМаркировки";
	
	Запрос.УстановитьПараметр("ДатаНачалаМаркировки", ДатаНачалаМаркировки);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИспользуемаяМаркировка.Добавить(Выборка.ВидПродукции);	
	КонецЦикла;
	
	Возврат ИспользуемаяМаркировка;	
	
КонецФункции

//Для возможности использовать на клиенте в переопределениях
Функция ПолучитьЗначенияРеквизитовДокументаОснования(Ссылка, СписокРеквизитов) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СписокРеквизитов);
		
КонецФункции

//Проверяет что номенклатура это алкогольгаяпродукция( не пиво)
//Параметры: -Номенклатура Тип("СправочникСсылка.Номенлатура")
//
//Возвращаемое значение: ЭтоАлкоголь Тип("Булево")
//
Функция ЭтоАлкогольнаяПродукция(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОписаниеНоменклатурыИС.КлючВидовПродукции КАК ВидПродукции
	|ИЗ
	|	РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
	|ГДЕ
	|	ОписаниеНоменклатурыИС.Номенклатура = &Номенклатура
	|	И ОписаниеНоменклатурыИС.КлючВидовПродукции.ВидПродукцииЕГАИС <> ЗНАЧЕНИЕ(Справочник.ВидыПродукцииИС.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатВыполненияЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатВыполненияЗапроса.Пустой();
		
КонецФункции

Функция ЭтоПростойИнтерфейс() Экспорт
	
	Возврат ОбщегоНазначенияБП.ЭтоПростойИнтерфейс();
	
КонецФункции

//Если единица штучная(Экономическая, безразмерная) тогда Истина иначе Ложь
//Параметры: ЕдиницаИзмерения Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
//
//Возвращаемое значение: ШтучнаяЕдиница тип("Булево")
//
Функция ЭтоШтучнаяЕдиница(ЕдиницаИзмерения) Экспорт
	
	ШтучнаяЕдиница = Ложь;
	
	СтрокаКодовШтучныхЕдиниц 	= "715, 778, 780, 781, 796, 797, 798, 799, 800";
	КодЕдиницы 					= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "Код");
	Если СтрНайти(СтрокаКодовШтучныхЕдиниц, КодЕдиницы) > 0 Тогда
		ШтучнаяЕдиница = Истина;
	КонецЕсли;	
	
	Возврат ШтучнаяЕдиница;
	
КонецФункции

//Если единица мерная(Вес, объем, длина) тогда Истина иначе Ложь
//Параметры: ЕдиницаИзмерения Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
//
//Возвращаемое значение: МернаяЕдиница тип("Булево")
//
Функция ЭтоМернаяЕдиница(ЕдиницаИзмерения) Экспорт
	
	МернаяЕдиница = Ложь;
	
	СтрокаКодовМерныхЕдиниц = "
	|003, 004, 005, 006, 008, 009, 018, 039, 041, 043, 047,
	|110, 111, 112, 113, 116, 118, 122, 126, 131, 132, 133, 159,
	|160, 161, 162, 163, 164, 166, 168, 170, 173, 181, 185";
	
	КодЕдиницы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "Код");
	Если СтрНайти(СтрокаКодовМерныхЕдиниц, КодЕдиницы) > 0 Тогда
		МернаяЕдиница = Истина;
	КонецЕсли;	
	
	Возврат МернаяЕдиница;

КонецФункции

Функция ЭтоВерсияКорп() Экспорт
	
	Возврат ВариантыПриложений.ЭтоВерсияКОРП();
	
КонецФункции

Функция ИерархияЭлементовСправочникаОКПД2(Знач КодОКПД2) Экспорт
	
	ДоступныеОКПД2 = Новый Массив;
	
	Пока КодОКПД2 <> "" Цикл
		ДоступныеОКПД2.Добавить(КодОКПД2);
		ПозицияТочки = СтрНайти(КодОКПД2, ".", НаправлениеПоиска.СКонца);
		КодОКПД2 = ?(ПозицияТочки > 0, Лев(КодОКПД2, ПозицияТочки - 1), "");
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Код", ДоступныеОКПД2);
	Запрос.Текст = "ВЫБРАТЬ Ссылка Из Справочник.КлассификаторОКПД2 ГДЕ Код В (&Код)";
	СсылкиОКПД2 = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СсылкиОКПД2.Добавить(Справочники.КлассификаторОКПД2.ПустаяСсылка());
	
	Возврат СсылкиОКПД2;
	
КонецФункции

// Получает ТН ВЭД
//
// Параметры:
//  КодТНВЭД - Строка - Код по классификатору товарной номенклатуры внешнеэкономической деятельности
//
// Возвращаемое значение:
//   Произвольный - элемент классификатора (если он определен в конфигурации)
//
Функция КлассификаторТНВЭДПоКоду(КодТНВЭД) Экспорт
	
	ТНВЭД = Неопределено;
	
	КлассификаторТНВЭД(КодТНВЭД, ТНВЭД);
	
	Возврат ТНВЭД;
	
КонецФункции

//Получение ссылки ТН ВЭД по коду.
//
//Параметры:
//  КодТНВЭД - Строка - Код по классификатору товарной номенклатуры внешнеэкономической деятельности.
//  ТНВЭД - Произвольный - искомый элемент.
//
Процедура КлассификаторТНВЭД(КодТНВЭД, ТНВЭД) Экспорт
	
	ТНВЭД = Справочники.КлассификаторТНВЭД.НайтиПоКоду(КодТНВЭД);
	
КонецПроцедуры

Процедура ЗаполнитьКодЕдиницыИзмеренияВТаблицеТоваров(ТаблицаТоваров)
	
	Если ТаблицаТоваров.Колонки.Найти("ЕдиницаИзмеренияКод") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияКод", ОбщегоНазначения.ОписаниеТипаСтрока(5));
	КонецЕсли;
	
	Для Каждого СтрокаТовары Из ТаблицаТоваров Цикл
		Если ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
			СтрокаТовары.ЕдиницаИзмеренияКод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура.ЕдиницаИзмерения, "Код");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти