// Хранит выбранные форматы сохранения файла договора

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Создан = ТекущаяДата();
	КонецЕсли;

	НазначениеШаблона	= ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект.Владелец));
	РедактированиеМакросовДоступно 	= CW_ШаблоныДокументовСерверВызовСервера.ПолучитьПравоРедактированияШаблона(Объект.Ссылка, НазначениеШаблона); 

	Элементы.ПараметрыШаблонаИзменить.Видимость = РедактированиеМакросовДоступно;
	Элементы.ПараметрыШаблонаКонтекстноеМенюИзменить.Видимость = РедактированиеМакросовДоступно;

	УстановитьДоступностьЭлементовФормы();
	
	УстановитьЗаголовокФормы();

	ХранилищеШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ХранилищеШаблона");  
	Если ТипЗнч(ХранилищеШаблона) = Тип("ХранилищеЗначения") Тогда
		ДанныеШаблона = ХранилищеШаблона.Получить(); 
		
		Если ТипЗнч(ДанныеШаблона) = Тип("Структура") Тогда
			ФорматированныйДокумент.УстановитьHTML(ДанныеШаблона.ТекстHTML, ДанныеШаблона.Вложения);
		КонецЕсли;
	КонецЕсли; 
	
	НазначениеШаблона = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект.Владелец));

	УстановитьОтборСпискаПараметровШаблона();  

	Формат = "HTML";
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()   
	
	РедактированиеДоступно = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьПравоРедактированияШаблона(Объект.Ссылка, НазначениеШаблона);

	ТолькоПросмотр = Не РедактированиеДоступно; 
	
	Элементы.ПараметрыШаблона.Доступность					= РедактированиеДоступно;
	Элементы.ФорматированныйДокумент.Доступность 			= РедактированиеДоступно;
	//Элементы.ПараметрыШаблонаИзменитьПараметр.Доступность 	= РедактированиеДоступно;
	//Элементы.ПараметрыШаблонаДобавитьПараметр.Доступность 	= РедактированиеДоступно;
	Элементы.ФормаЗаполнитьИзШаблона.Доступность 			= РедактированиеДоступно;
	Элементы.Комментарий.Доступность 						= РедактированиеДоступно;
	Элементы.ГруппаПараметры.Видимость 						= РедактированиеДоступно;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьЗаголовокФормы();
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Заголовок = СокрЛП(Объект.Ссылка)+?(Параметры.Ключ.Пустая(), СокрЛП(Объект.Владелец)+" (Создание шаблона)","");

КонецПроцедуры


&НаКлиенте
Процедура ФорматированныйДокументПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекстHTML = "";
	Вложения = Новый Структура;
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	
	СтруктураФорматированногоДокумента = Справочники.CW_ОбщиеШаблоныДокументов.ПустаяСтруктураШаблонаДокумента();
	СтруктураФорматированногоДокумента.ТекстHTML 	= ТекстHTML;
	СтруктураФорматированногоДокумента.Вложения		= Вложения;
	
	ТекущийОбъект.ХранилищеШаблона = Новый ХранилищеЗначения(СтруктураФорматированногоДокумента, Новый СжатиеДанных(9));   
	
	ТекущийОбъект.ДатаРедактирования 	= ТекущаяДата();
	ТекущийОбъект.Пользователь 			= ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзШаблона(Команда)    
	
	СтруктураОтбора = новый Структура;
	СтруктураОтбора.Вставить("ИмяФормата", "HTML");
	СтруктураОтбора.Вставить("НазначениеШаблона", НазначениеШаблона);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);      
	СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);      
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", Истина);   
	
	ОписаниеОповещения = новый ОписаниеОповещения("ВыборШаблонаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_ОбщиеШаблоныДокументов.ФормаВыбора", СтруктураПараметров, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&наКлиенте
Процедура ВыборШаблонаЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = СокрЛП(РезультатВыбора);      
	КонецЕсли;
	
	ВыборШаблонаЗавершениенаСервере(РезультатВыбора);
	
КонецПроцедуры  

&НаСервере
Процедура ВыборШаблонаЗавершениенаСервере(РезультатВыбора)

	ХранилищеШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РезультатВыбора, "ХранилищеШаблона");  
	Если ТипЗнч(ХранилищеШаблона) = Тип("ХранилищеЗначения") Тогда
		ДанныеШаблона = ХранилищеШаблона.Получить(); 
		
		Если ТипЗнч(ДанныеШаблона) = Тип("Структура") Тогда
			ФорматированныйДокумент.УстановитьHTML(ДанныеШаблона.ТекстHTML, ДанныеШаблона.Вложения);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Просмотр(Команда)  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектПечати", 	Объект.Владелец);
	ПараметрыФормы.Вставить("ШаблонДокумента", 	Объект.Ссылка);   
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаПросмотраТекстаДокументаHTML", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокПоказателейШаблона" Тогда
		УстановитьОтборСпискаПараметровШаблона();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборСпискаПараметровШаблона() 
	
	ПараметрыШаблона.Отбор.Элементы.Очистить();

	НовыйЭлементОтбора = ПараметрыШаблона.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НазначениеШаблона");
	НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение 	= НазначениеШаблона;
	НовыйЭлементОтбора.Использование 	= Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)   
	
	СтандартнаяОбработка = Ложь;

	Если CW_ШаблоныДокументовСерверВызовСервера.ЭтоГруппаПараметров(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторПараметра = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИдентификаторПараметра(ВыбраннаяСтрока);
	ВставитьПараметр(ИдентификаторПараметра);

КонецПроцедуры 

&НаКлиенте
Процедура ВставитьПараметр(Значение)  
	
	ЗакладкаНачала = Неопределено;
	ЗакладкаОкончания = Неопределено;
	Элементы.ФорматированныйДокумент.ПолучитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);

	ПозицияНачала = ФорматированныйДокумент.ПолучитьПозициюПоЗакладке(ЗакладкаНачала);
	ПозицияОкончания = ФорматированныйДокумент.ПолучитьПозициюПоЗакладке(ЗакладкаОкончания);
	
	Если ЗакладкаНачала <> ЗакладкаОкончания Тогда 
		ФорматированныйДокумент.Удалить(ЗакладкаНачала, ЗакладкаОкончания);
		Элементы.ФорматированныйДокумент.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаНачала);
	КонецЕсли;

	// Выделяем параметр в тексте договора жирным шрифтом и желтым фоном.
	Если ФорматированныйДокумент.Элементы.Количество() = 0 Тогда
		НовыйЭлементДокумента = ФорматированныйДокумент.Добавить(Значение, Тип("ТекстФорматированногоДокумента"));
	Иначе
		НовыйЭлементДокумента = ФорматированныйДокумент.Вставить(ЗакладкаНачала, Значение, Тип("ТекстФорматированногоДокумента"));
	КонецЕсли;
	
	ПозицияОкончания = ПозицияНачала + СтрДлина(Значение);
	ЗакладкаОкончания = ФорматированныйДокумент.ПолучитьЗакладкуПоПозиции(ПозицияОкончания);
	Элементы.ФорматированныйДокумент.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);
	
	Модифицированность = Истина;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПараметрыШаблонаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если CW_ШаблоныДокументовСерверВызовСервера.ЭтоГруппаПараметров(ПараметрыПеретаскивания.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторПараметра  = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИдентификаторПараметра(ПараметрыПеретаскивания.Значение); 
 	ПараметрыПеретаскивания.Значение = ИдентификаторПараметра;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ИмяМакроса = ПараметрыПеретаскивания.Значение;
	ПодключитьОбработчикОжидания("ОформитьВставленныйМакрос",0.1,Истина);   

КонецПроцедуры  

&НаКлиенте
Процедура ОформитьВставленныйМакрос()   
	
	ОформитьВставленныйМакросНаСервере();

КонецПроцедуры     

&НаСервере
Процедура ОформитьВставленныйМакросНаСервере()   
	
	НайденнаяОбласть = ФорматированныйДокумент.НайтиТекст(ИмяМакроса);
	
	Пока НайденнаяОбласть <> Неопределено Цикл
		Элементы.ФорматированныйДокумент.УстановитьГраницыВыделения(НайденнаяОбласть.ЗакладкаНачала, НайденнаяОбласть.ЗакладкаКонца);
		
		НайденнаяОбласть = ФорматированныйДокумент.НайтиТекст(ИмяМакроса, НайденнаяОбласть.ЗакладкаКонца);
	
	КонецЦикла;
	
	ИмяМакроса = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаПередНачаломИзменения(Элемент, Отказ)
	Отказ = Не РедактированиеМакросовДоступно;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


