
&ИзменениеИКонтроль("ДополнитьНаборДополнительныхСведений")
Процедура саб_ДополнитьНаборДополнительныхСведений(Метаданное)
	
	#Вставка
	УстановитьПривилегированныйРежим(Истина);
	#КонецВставки
	ПолноеИмя 			= Метаданное.ПолноеИмя();
	МассивИмениФормы 	= СтрРазделить(ПолноеИмя, ".");
	ИмяЭлемента 		= МассивИмениФормы[0] + "_" + МассивИмениФормы[1];

	НаборСсылка = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоРеквизиту("ИмяПредопределенногоНабора", ИмяЭлемента);
	Если НаборСсылка.Пустая() Тогда
		НаборОбъект = Справочники.НаборыДополнительныхРеквизитовИСведений.СоздатьЭлемент();
	Иначе  
		НаборОбъект = НаборСсылка.ПолучитьОбъект();
		НаборОбъект.Представления.Очистить();
	КонецЕсли;

	НаборОбъект.ИмяПредопределенногоНабора 	= ИмяЭлемента;
	НаборОбъект.Наименование				= Метаданное.Синоним;
	НаборОбъект.Используется 				= Истина;
	НаборОбъект.Записать();
	#Вставка
	УстановитьПривилегированныйРежим(Ложь);
	#КонецВставки
	
КонецПроцедуры
