&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма);
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
    //Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСайтаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.АдресСайта) Тогда 
		АдресСайта = Объект.АдресСайта;
		Если ЗначениеЗаполнено(АдресСайта) Тогда 
			Если Лев(АдресСайта, 4) <> "http" Тогда 
				АдресСайта = "http://"+АдресСайта;
			КонецЕсли;
			#Если Вебклиент Тогда 
				ПерейтиПоНавигационнойСсылке(АдресСайта);
			#Иначе
				ЗапуститьПриложение(АдресСайта);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти

