
Процедура СформироватьОбщиеПараметры(Объект,Разделы=Неопределено,ИнтерактивныйРежим=Истина) Экспорт 
	
	Метаданное = Объект.Метаданные().ПолноеИмя();
	ШаблонСписков = CW_ОбщиеПараметры_ПИ.ШаблонОбщихПараметров(Метаданное,ИнтерактивныйРежим);
	
	СтруктураПараметров=_сф.ст_Создать("ПараметрыДоговора,Константы,УчетнаяПолитика,НастройкиПользователя");
	НачальноеЗначение = ?(Разделы=Неопределено,Истина,Ложь);
	СтруктураПараметров.ПараметрыДоговора		=	НачальноеЗначение;
	СтруктураПараметров.Константы				=	НачальноеЗначение;
	СтруктураПараметров.УчетнаяПолитика			=   НачальноеЗначение;
	СтруктураПараметров.НастройкиПользователя	=   НачальноеЗначение;
	
	// анализируем переданный список
	Если Разделы <> Неопределено Тогда
		
		СписокРазделов = _сф.м_СоздатьИзСтроки(Разделы,",");
		Для каждого Стр Из СписокРазделов Цикл
			
			СтруктураПараметров[Стр]=Истина;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если Метаданное = "Документ.CW_ДоходыПоГрузоперевозке" Тогда
		
		ДатаАктуальности = ?(Объект.ДатаАкта=Дата(1,1,1),Объект.Дата,Объект.ДатаАкта);
		ПроверятьБУ = Истина;
		ПроверятьОЗ = Истина;
		ВидОЗ = Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская;
		
	ИначеЕсли Метаданное = "Документ.CW_РасходыПоГрузоперевозке" 
		ИЛИ Метаданное = "Документ.CW_РасходыПоПриобретениям" Тогда 
		
		Если Объект.ФормироватьВедомыеДатойДокумента тогда
			ДатаАктуальности = Объект.Дата;
		Иначе
			ДатаАктуальности = ?(Объект.ДатаАкта=Дата(1,1,1),Объект.Дата,Объект.ДатаАкта);
		КонецЕсли;
	
		ПроверятьБУ = Истина;
		ПроверятьОЗ = Истина;
		ВидОЗ = Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская;
		
	ИначеЕсли Метаданное = "Документ.CW_ЗакрытиеГрузоперевозки" Тогда 
		
		ДатаАктуальности = Объект.Дата;
		ПроверятьБУ = Ложь;
		ПроверятьОЗ = Ложь;
		
	ИначеЕсли Метаданное = "Документ.CW_РасходыПодотчетногоЛица" Тогда 
		
		ДатаАктуальности = Объект.Дата;
		ПроверятьБУ = Ложь;
		ПроверятьОЗ = Ложь;
		
	КонецЕсли; 
	
	// параметры договора
	Если СтруктураПараметров.ПараметрыДоговора Тогда
		
		СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметровДоговора.Дата 				= ДатаАктуальности;
		СтруктураПараметровДоговора.Договор 			= Объект.Договор;
		СтруктураПараметровДоговора.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
		
		ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора);
		
		_сф.ст_УстановитьСвойство(Объект.ДополнительныеСвойства,"ПД",ПараметрыДоговора);	
	КонецЕсли; 
	
	// константы
	Если СтруктураПараметров.Константы Тогда
		СтруктураКонстант = Новый Структура;
		Для каждого Константа Из ШаблонСписков.СписокКонстант Цикл
			_сф.ст_УстановитьСвойство(СтруктураКонстант,Константа,Константы[Константа].Получить());			
		КонецЦикла; 
		_сф.ст_УстановитьСвойство(Объект.ДополнительныеСвойства,"КО",СтруктураКонстант);
	КонецЕсли; 
	
	// учетная политика
	Если СтруктураПараметров.УчетнаяПолитика Тогда
		
		СтруктураПараметровБухУчета = Новый Структура;
		СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
		СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
		
		ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);
		
		СтруктураПараметровУчетнойПолитики = Новый Структура;
		Если ШаблонСписков.СписокУП.Количество() <> 0 Тогда
			УП = CW_Настройки.ПараметрыУчетнойПолитики(ДатаАктуальности,Объект.Организация);
			Для каждого ПараметрУП Из ШаблонСписков.СписокУП Цикл
				_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,ПараметрУП,УП[ПараметрУП]);
			КонецЦикла;  
		КонецЕсли; 
	//	Если (ШаблонСписков.СписокГУП.Количество() <> 0 И ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
		Если ШаблонСписков.СписокГУП.Количество() <> 0 Тогда
			ГУП = CW_Настройки.ПараметрыГлобальнойУчетнойПолитики(ДатаАктуальности,Объект.Организация);
			Для каждого ПараметрГУП Из ШаблонСписков.СписокГУП Цикл
				_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,ПараметрГУП,ГУП[ПараметрГУП]);
			КонецЦикла;
		КонецЕсли; 
		
		// определяем параметры оперативной задолженности
		Если ПроверятьБУ Тогда
			
			ДатаНачалаВеденияУчетаБУ = CW_Настройки.ПолучитьДатуНачалаВеденияУчета(Объект.Организация);
			Если ДатаНачалаВеденияУчетаБУ <> Неопределено Тогда
				ВводОстатковБУ = (Объект.Дата < ДатаНачалаВеденияУчетаБУ);		
			Иначе
				ВводОстатковБУ = Ложь;
			КонецЕсли;
			
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"БУ",Истина);
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"ВводОстатковБУ",ВводОстатковБУ);
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"ДатаНачалаВеденияУчетаБУ",ДатаНачалаВеденияУчетаБУ);
			
		КонецЕсли; 
		Если ПроверятьОЗ Тогда
			
			СтруктураНастроек = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Объект.Организация, ВидОЗ, Объект.Дата); 
			НачалоВеденияУчета	= СтруктураНастроек["НачалоВеденияУчета"];
			ОперативныйУчет		= СтруктураНастроек["ВедетсяОперативныйУчет"]; 
			ВводОстатковОУ		= СтруктураНастроек["ВводОстатков"]; 
			
			НастройкиОперативногоУчета	= СтруктураНастроек["НастройкиОперативногоУчета"]; 
			РаздельныйУчетОперативнойИБухгалтерскойЗадолженности 	= НастройкиОперативногоУчета["РаздельныйУчет"];
			УчитыватьПереплатыПоДокументамКакАванс 					= НастройкиОперативногоУчета["УчитыватьПереплатыПоДокументамКакАванс"];
		
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"ОЗ",							ОперативныйУчет);
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"ВводОстатковОЗ",				ВводОстатковОУ);
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"ДатаНачалаВеденияУчетаОЗ",	НачалоВеденияУчета);
			
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"РаздельныйУчетОперативнойИБухгалтерскойЗадолженности", РаздельныйУчетОперативнойИБухгалтерскойЗадолженности);
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"УчитыватьПереплатыПоДокументамКакАванс", 				 УчитыватьПереплатыПоДокументамКакАванс);
			
			
		КонецЕсли; 
		
		_сф.ст_УстановитьСвойство(Объект.ДополнительныеСвойства,"УП",СтруктураПараметровУчетнойПолитики);
		
	КонецЕсли; 
	
	// настройки пользователя
	Если СтруктураПараметров.НастройкиПользователя Тогда
		
		СтруктураНастроекПользователя = новый Структура;
		Для каждого НастройкаПользователя Из ШаблонСписков.СписокНП Цикл
			_сф.ст_УстановитьСвойство(СтруктураНастроекПользователя,НастройкаПользователя,CW_Настройки.ПолучитьНастройкуПользователя(,НастройкаПользователя));		
		КонецЦикла; 
		_сф.ст_УстановитьСвойство(Объект.ДополнительныеСвойства,"НП",СтруктураНастроекПользователя);
		
	КонецЕсли; 
	
	_сф.ст_УстановитьСвойство(Объект.ДополнительныеСвойства,"ПерваяЗаписьОбъекта",	Не ЗначениеЗаполнено(Объект.Ссылка));
КонецПроцедуры

Функция ОбщиеПараметрыЗаполнены(Объект) Экспорт 
	// --- 
	
	ТребуетсяФормирование = Ложь;
	// --- 
	ДС = Объект.ДополнительныеСвойства;
	
	Если НЕ ДС.Свойство("ПД") Тогда
		
		ТребуетсяФормирование = Истина;
		
	КонецЕсли; 
	Если НЕ ДС.Свойство("КО") Тогда
		
		ТребуетсяФормирование = Истина;
		
	КонецЕсли; 
	Если НЕ ДС.Свойство("НП") Тогда
		
		ТребуетсяФормирование = Истина;
		
	КонецЕсли;
	Если НЕ ДС.Свойство("УП") Тогда
		
		ТребуетсяФормирование = Истина;
		
	КонецЕсли;
	
	Возврат(НЕ ТребуетсяФормирование);
	
	// --- 
КонецФункции
