
&ИзменениеИКонтроль("ТаблицаАвансовДляОЗ")
Функция саб_ТаблицаАвансовДляОЗ(Параметры, ТаблицаДокумента, ТаблицаЗачета)

	ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");

	Дата			= Параметры.Дата;
	Договор			= Параметры.Договор;

	//Подсистема.УчетПриложенийДоговоров
	ПриложениеКДоговору = Параметры.ПриложениеКДоговору;
	//Подсистема.УчетПриложенийДоговоров

	ПереплатаКакАванс   = Параметры.ПереплатаКакАванс;

	Организация		= Договор.Организация;
	Контрагент		= Договор.Владелец; 

	Если ЗначениеЗаполнено(ПриложениеКДоговору) Тогда
		Валюта = ПриложениеКДоговору.ВалютаДоговора;
	Иначе
		Валюта = Договор.ВалютаДоговора;
	КонецЕсли;	

	ВестиУчетПоПодразделениям 	= ложь;
	ПодразделениеОрганизации 	= Неопределено;

	//Для версии КОРП
	Если Параметры.Свойство("ВестиУчетПоПодразделениям") Тогда
		ВестиУчетПоПодразделениям 	= Параметры.ВестиУчетПоПодразделениям;
		ПодразделениеОрганизации 	= Параметры.ПодразделениеОрганизации;
	КонецЕсли;
	//Для версии КОРП

	// --- 
	ЭтоПокупатель = ДоговорПокупателя(Договор); 
	ЭтоПоставщик = (НЕ ЭтоПокупатель);
	// --- 
	ОЗ = Параметры.ОЗ;

	Если (НЕ ОЗ) Тогда

		Возврат(Неопределено);

	КонецЕсли; 

	// --- 

	СчетаУчета = ТаблицаДокумента.Скопировать(,"СчетЗадолженности");
	СчетаУчета.Свернуть("СчетЗадолженности");

	Если (ЭтоПоставщик) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	-CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК Аванс,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.СчетУчета КАК СчетЗадолженности,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Валюта КАК Валюта,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет КАК ДокументОплаты,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет.Основание КАК ДокументАванса
		|ПОМЕСТИТЬ тмп
		|ИЗ
		|	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Остатки(
		|			&Период,
		|			СчетУчета В (&Счета)
		|				И Контрагент = &Контрагент
		|				И Договор = &Договор
		//Подсистема.УчетПриложенийДоговоров
		|				И ПриложениеКДоговору = &ПриложениеКДоговору
		//Подсистема.УчетПриложенийДоговоров
		|				И Валюта = &Валюта
		|				И Организация = &Организация
		|				И ВЫБОР
		|					КОГДА &ВестиУчетПоПодразделениям
		|						ТОГДА ВЫБОР
		|								КОГДА Счет ССЫЛКА Документ.CW_РасходыПоГрузоперевозке
		|										ИЛИ Счет ССЫЛКА Документ.CW_Оплата
		|										ИЛИ Счет ССЫЛКА Документ.CW_РасходыПоПриобретениям
		|									ТОГДА Счет.ПодразделениеОрганизации = &ПодразделениеОрганизации
		|								ИНАЧЕ ИСТИНА
		|							КОНЕЦ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ПереплатаКакАванс = ЛОЖЬ
		|						ТОГДА Счет ССЫЛКА Документ.CW_Оплата
		|								ИЛИ Счет ССЫЛКА Документ.CW_ДвижениеДенежныхСредств
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК CW_ОперативнаяКредиторскаяЗадолженностьОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тмп.Аванс КАК Аванс,
		|	тмп.СчетЗадолженности КАК СчетЗадолженности,
		|	тмп.Валюта КАК Валюта,
		|	тмп.ДокументОплаты КАК ДокументОплаты,
		|	тмп.ДокументАванса КАК ДокументАванса,
		|	тмп.ДокументОплаты.Дата КАК Дата
		|ИЗ
		|	тмп КАК тмп
		|ГДЕ
		|	тмп.Аванс > 0";

		Запрос.УстановитьПараметр("Счета", 			СчетаУчета.ВыгрузитьКолонку("СчетЗадолженности"));
		Запрос.УстановитьПараметр("Период", 		Дата); 
		Запрос.УстановитьПараметр("Организация", 	Организация); 
		Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
		Запрос.УстановитьПараметр("Договор", 		Договор);

		//Подсистема.УчетПриложенийДоговоров
		Запрос.УстановитьПараметр("ПриложениеКДоговору", ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров

		Запрос.УстановитьПараметр("ПереплатаКакАванс", 	 ПереплатаКакАванс);

		Запрос.УстановитьПараметр("Валюта", Валюта); 
        #Вставка
		//+++САБ 4952
		ВестиУчетПоПодразделениям = Ложь;
		#КонецВставки		
		Запрос.УстановитьПараметр("ВестиУчетПоПодразделениям"		, ВестиУчетПоПодразделениям);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации"		, ПодразделениеОрганизации); 
		// --- 
		ТЗ=Запрос.Выполнить().Выгрузить();
		_сф.т_ДобавитьКолонку(ТЗ,"СчетАванса");
		_сф.т_ДобавитьКолонку(ТЗ,"Зачтено");
		_сф.т_ДобавитьКолонку(ТЗ,"ПризнакОплатыСчетовДокумента");
		_сф.т_ДобавитьКолонку(ТЗ,"ПредставлениеДокументаАванса");
		МассивУдаления = Новый Массив;
		Для каждого Стр Из ТЗ Цикл

			Стр.ПризнакОплатыСчетовДокумента = Ложь;
			Стр.ПредставлениеДокументаАванса = "";
			Стр.СчетАванса = СчетАванса(Стр.СчетЗадолженности);
			Стр.Зачтено = 0;

		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(ТЗ, МассивУдаления);
		ТЗ.Сортировать("Дата Возр");

	ИначеЕсли (ЭтоПокупатель) Тогда 

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	-CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК Аванс,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.СчетУчета КАК СчетЗадолженности,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Валюта КАК Валюта,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет КАК ДокументОплаты,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет.Основание КАК ДокументАванса
		|ПОМЕСТИТЬ тмп
		|ИЗ
		|	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность.Остатки(
		|			&Период,
		|			СчетУчета В (&Счета)
		|				И Контрагент = &Контрагент
		|				И Договор = &Договор
		//Подсистема.УчетПриложенийДоговоров
		|				И ПриложениеКДоговору = &ПриложениеКДоговору
		//Подсистема.УчетПриложенийДоговоров
		|				И Валюта = &Валюта
		|				И Организация = &Организация
		|				И ВЫБОР
		|					КОГДА &ВестиУчетПоПодразделениям
		|						ТОГДА ВЫБОР
		|								КОГДА Счет ССЫЛКА Документ.CW_ДоходыПоГрузоперевозке
		|										ИЛИ Счет ССЫЛКА Документ.CW_Оплата
		|									ТОГДА Счет.ПодразделениеОрганизации = &ПодразделениеОрганизации
		|								ИНАЧЕ ИСТИНА
		|							КОНЕЦ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ПереплатаКакАванс = ЛОЖЬ
		|						ТОГДА Счет ССЫЛКА Документ.CW_Оплата 
		|								ИЛИ Счет ССЫЛКА Документ.CW_ДвижениеДенежныхСредств
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК CW_ОперативнаяДебиторскаяЗадолженностьОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тмп.Аванс КАК Аванс,
		|	тмп.СчетЗадолженности КАК СчетЗадолженности,
		|	тмп.Валюта КАК Валюта,
		|	тмп.ДокументОплаты КАК ДокументОплаты,
		|	тмп.ДокументАванса КАК ДокументАванса,
		|	тмп.ДокументОплаты.Дата КАК Дата
		|ИЗ
		|	тмп КАК тмп
		|ГДЕ
		|	тмп.Аванс > 0";

		Запрос.УстановитьПараметр("Счета", СчетаУчета.ВыгрузитьКолонку("СчетЗадолженности"));
		Запрос.УстановитьПараметр("Период", Дата); 
		Запрос.УстановитьПараметр("Организация", Организация); 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Договор", Договор);

		//Подсистема.УчетПриложенийДоговоров
		Запрос.УстановитьПараметр("ПриложениеКДоговору", ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров

		Запрос.УстановитьПараметр("ПереплатаКакАванс", 	ПереплатаКакАванс);

		Запрос.УстановитьПараметр("Валюта", Валюта); 

		Запрос.УстановитьПараметр("ВестиУчетПоПодразделениям"	, ВестиУчетПоПодразделениям);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации"	, ПодразделениеОрганизации); 

		ТЗ=Запрос.Выполнить().Выгрузить();
		_сф.т_ДобавитьКолонку(ТЗ,"СчетАванса");
		_сф.т_ДобавитьКолонку(ТЗ,"Зачтено");
		_сф.т_ДобавитьКолонку(ТЗ,"ПризнакОплатыСчетовДокумента");
		_сф.т_ДобавитьКолонку(ТЗ,"ПредставлениеДокументаАванса");
		МассивУдаления = Новый Массив;
		Для каждого Стр Из ТЗ Цикл

			Стр.ПризнакОплатыСчетовДокумента = Ложь;
			Стр.ПредставлениеДокументаАванса = "";
			Стр.СчетАванса = СчетАванса(Стр.СчетЗадолженности);
			Стр.Зачтено = 0;

		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(ТЗ, МассивУдаления); 
		ТЗ.Сортировать("Дата Возр");

	КонецЕсли; 

	// --- 
	Для каждого Стр Из ТЗ Цикл

		Отбор = _сф.ст_Создать("ДокументОплаты,СчетЗадолженности",Стр);
		СтрокиСтарогоЗачета = ТаблицаЗачета.Скопировать(Отбор);
		Если (_сф.Количество(СтрокиСтарогоЗачета)<>0) Тогда
			Стр.Зачтено = _сф.Итог(СтрокиСтарогоЗачета,"СуммаЗачета");
		КонецЕсли; 

	КонецЦикла; 
	// --- 
	Возврат(ТЗ);

КонецФункции
