
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	РезультатВыполнения =  ПеревестиВАрхивНаСервереВФоне(ПараметрКоманды);
	
	Дополнительныепараметры = Новый Структура;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ПараметрыВыполненияКоманды.Источник);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПереводаВАрхив", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПеревестиВАрхивНаСервереВФоне(ПараметрКоманды)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Профили", ПараметрКоманды);

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Перевод грузоперевозок в архив";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ВебПрофилиПеревозок.ВыполнитьПереводПеревозокПрофиляВАрхив",ПараметрыПроцедуры, ПараметрыВыполнения);
		
КонецФункции 

&НаКлиенте
Процедура ОбработатьРезультатПереводаВАрхив(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ТекстПредупреждения = "Ошибка перевода грузоперевозок в архив!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка перевода в архив");
	КонецЕсли;
	
КонецПроцедуры
