// Формирует и выводит сообщение, которое может быть связано с элементом 
// управления формы.
//
//	Параметры
//	ТекстСообщенияПользователю	- Строка - текст сообщения.
//	ОбъектИлиСсылка				- Ссылка на объект ИБ или объект
//	Поле						- Строка - наименование реквизита формы
//	ПутьКДанным					- Строка - путь к данным (путь к реквизиту формы)
//	Отказ						- Булево - Выходной параметр. 
//                                Устанавливается в этой процедуре в значение Истина.
//
//	Примеры использования:
//	1. Для вывода сообщения у поля управляемой формы, связанного с реквизитом объекта:
//	Стандартные_КлиентСервер.СообщитьПользователю(
//		НСтр("ru = 'Сообщение об ошибке.'"), ,
//		"ПолеВРеквизитеФормыОбъект",
//		"Объект");
//
//	Альтернативный вариант использования в форме объекта:
//	Стандартные_КлиентСервер.СообщитьПользователю(
//		НСтр("ru = 'Сообщение об ошибке.'"), ,
//		"Объект.ПолеВРеквизитеФормыОбъект");
//
//	2. Для вывода сообщения рядом с полем управляемой формы, связанным с реквизитом формы:
//	Стандартные_КлиентСервер.СообщитьПользователю(
//		НСтр("ru = 'Сообщение об ошибке.'"), ,
//		"ИмяРеквизитаФормы");
//
//	3. Для вывода сообщения из кода на сервере:
//	Стандартные_КлиентСервер.СообщитьПользователю(
//		НСтр("ru = 'Сообщение об ошибке.'"),СсылкаНаОбъект,,,Отказ);
//
Процедура СообщитьПользователю(	Знач ТекстСообщенияПользователю,
								Знач ОбъектИлиСсылка = Неопределено,
								Знач Поле = "",
								Знач ПутьКДанным = "",
								Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	Сообщение.ПутьКДанным = ПутьКДанным;
	
	Если ОбъектИлиСсылка <> Неопределено Тогда
		Сообщение.УстановитьДанные(ОбъектИлиСсылка);
	КонецЕсли;
	
	Сообщение.Сообщить();
	Отказ = Истина;
	
КонецПроцедуры

// --- 

// СД - Структура действия
Функция СД(Модуль,Выполнение,Команда,Параметры=Неопределено) Экспорт 
	// --- 
	
	// исполнение: клиент/сервер
	
	СД = Новый Структура;
	СД.Вставить("Модуль",Модуль);
	СД.Вставить("Выполнение",Выполнение);
	СД.Вставить("Команда",Команда);
	СД.Вставить("Параметры",Параметры);
	// --- 
	Возврат(СД);
	
	// --- 
КонецФункции

// --- 

Функция СформироватьПараметрыВыбораПоля(СтруктураПараметров) Экспорт 
	// --- 
	
	ПараметрыВыбора = Новый Массив;
	
	Для каждого КлючЗначение Из СтруктураПараметров Цикл
		
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор."+КлючЗначение.Ключ,КлючЗначение.Значение));
		
	КонецЦикла; 
	
	Возврат(Новый ФиксированныйМассив(ПараметрыВыбора));
	
	// --- 
КонецФункции


Функция СформироватьПараметрВыбораПоля(Имя,Значение) Экспорт 
	// --- 
	
	//Возврат(СформироватьПараметрыВыбораПоля(Новый Структура(Имя,Значение)));
	
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора(Имя,Значение));
	
	Возврат(Новый ФиксированныйМассив(ПараметрыВыбора));
	
	// --- 
КонецФункции

// --- 

Функция ДС_ИмяПоКоманде(Знач ИмяКоманды) Экспорт 
	// --- 
	
	Строки = СтрЗаменить(ИмяКоманды,"_",Символы.ПС);
	Возврат(СтрПолучитьСтроку(Строки,1));
	
	// --- 
КонецФункции
  

// --- 

Функция РеквизитДС(ИмяДС,Реквизит) Экспорт 
	
	Возврат(ИмяДС+"_"+Реквизит);
	
КонецФункции

// --- 

Функция ДС_НастройкиКолонок(ИмяСписка) Экспорт 
	// --- 
	
	Возврат(РеквизитДС(ИмяСписка,"НастройкаКолонок"));
	
	// --- 
КонецФункции

Функция ДС_СтекОтборов(ИмяСписка) Экспорт 
	// --- 
	
	Возврат(РеквизитДС(ИмяСписка,"СтекОтборов"));
	
	// --- 
КонецФункции

Функция ДС_КолонкиСписка(ИмяСписка) Экспорт 
	// --- 
	
	Возврат(РеквизитДС(ИмяСписка,"КолонкиСписка"));
	
	// --- 
КонецФункции

Функция ДС_РежимРедактированияСписка(ИмяСписка) Экспорт 
	// --- 
	
	Возврат(РеквизитДС(ИмяСписка,"РежимРедактированияСписка"));
	
	// --- 
КонецФункции

Функция ДС_РежимОтображенияАрхивных(ИмяСписка) Экспорт 
	// --- 
	
	Возврат(РеквизитДС(ИмяСписка,"РежимОтображенияАрхивных"));
	
	// --- 
КонецФункции

Функция ДС_ПараметрыСписка(ИмяСписка) Экспорт 
	// --- 
	
	Возврат(РеквизитДС(ИмяСписка,"Настройка"));
	
	// --- 
КонецФункции

// --- 

Функция УправляемоеПриложение() Экспорт 
	// --- 
	
	Возврат(ТекущийРежимЗапуска()=РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение);
	
	// --- 
КонецФункции
  

// --- 

// функция возвращает стандартную структуру ответа
Функция Ответ(Код=0,ОписаниеОшибки="") Экспорт 
	// --- 
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Код", Код);
	СтруктураОтвета.Вставить("ОписаниеОшибки",ОписаниеОшибки);
	Возврат(СтруктураОтвета);	
	
	// --- 
КонецФункции

// функция проверяет ответ
Функция ВыполненоУспешно(Ответ) Экспорт 
	// --- 
	
	Код = Неопределено;
	
	Если ТипЗнч(Ответ) = Тип("Структура") Тогда
		
		Если Ответ.Свойство("Код",Код) Тогда
			
			Если Код = 0 Тогда
				
				Возврат(Истина);
				
			Иначе
				
				Возврат(Ложь);
				
			КонецЕсли; 
			
		Иначе
			
			Возврат(Ложь);
			
		КонецЕсли; 
		
	Иначе
		
		Возврат(Ложь);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// возвращает описание ошибки
Функция ПредставлениеОшибки(Ответ) Экспорт 
	// --- 
	
	ТекстОшибки = "<не указано>";
	
	Если ТипЗнч(Ответ) = Тип("Структура") Тогда
		
		Ответ.Свойство("ОписаниеОшибки",ТекстОшибки);
		
	КонецЕсли; 
	
	Возврат(ТекстОшибки);
	
	// --- 
КонецФункции
  

// --- 

Функция ИнформационнаяБазаФайловая(Знач СтрокаСоединенияИнформационнойБазы = "") Экспорт
			
	Если ПустаяСтрока(СтрокаСоединенияИнформационнойБазы) Тогда
		СтрокаСоединенияИнформационнойБазы =  СтрокаСоединенияИнформационнойБазы();
	КонецЕсли;
	Возврат Найти(Врег(СтрокаСоединенияИнформационнойБазы), "FILE=") = 1;
	
КонецФункции 

//Наличие прикрепленных файло
Процедура УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(Форма) Экспорт
	
	Объект = Форма.Объект;
	АдресКартинкиФайлов 		= _УФС.ПолучитьАдресКартинкиФайлов(Объект.Ссылка, Форма.УникальныйИдентификатор);
	Форма.АдресКартинкиФайлов  	= АдресКартинкиФайлов;
	
КонецПроцедуры
//Наличие прикрепленных файлов
