
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроверятьНомерКонтейнера = CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь, "ПроверятьНомерКонтейнера");

	Элементы.КоманднаяПанельПроверкаНомеров.Видимость = ПроверятьНомерКонтейнера;
	
	КоличествоПеревозок = Параметры.КоличествоПеревозок;
	Элементы.НадписьЗаголовокПоля.Заголовок = "Введите представление для "+Формат(КоличествоПеревозок,"ЧГ=0")+" грузоперевозок";
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	МассивИмен = ПолучитьМассивПредставлений();
	
	Если МассивИмен.Количество() <> КоличествоПеревозок Тогда
		ПоказатьПредупреждение(,"Количество выделенных грузоперевозок ("+ Формат(КоличествоПеревозок,"ЧГ=0") +") "+ 
		"не совпадает с количеством введенный представлений ("+Формат(МассивИмен.Количество(),"ЧГ=0") +").
		|Скорректируйте исходные данные и повторите попытку.",30, "Ошибка количества представлений");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивИмен", МассивИмен);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьЗаполнениеКонтейнеров", ЭтотОбъект, ДополнительныеПараметры);
	ЕстьОшибки = ПроверитьНомераКонтейнеровНаСервере();
	Если ЕстьОшибки Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Есть ошибки номеров контейнеров. Продолжить?", Режим, 0);	
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПродолжитьЗаполнениеКонтейнеров(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

 	ЭтаФорма.Закрыть(ДополнительныеПараметры.МассивИмен);

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивПредставлений()
	
	МассивПредсталений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокПредставлений, Символы.ПС, Истина);
	
	Массив = Новый Массив;
	Для Каждого Текст из МассивПредсталений Цикл
		Текст = УбратьСимволПС(Текст);
		Массив.Добавить(Текст);
	КонецЦикла; 
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Функция УбратьСимволПС(Знач Текст)
	
	Возврат СтрЗаменить(Текст, Символы.ПС, "");
	
КонецФункции


&НаКлиенте
Процедура КомандаПривестиСтроки(Команда)
	ПривестиСтрокиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПривестиСтрокиНаСервере()
	
	СписокПредставлений = СтрЗаменить(СписокПредставлений, ";", Символы.ПС);
	СписокПредставлений = СтрЗаменить(СписокПредставлений, " ", Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверить(Команда)
	
	ЕстьОшибки = ПроверитьНомераКонтейнеровНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНомераКонтейнеровНаСервере()
	
	ЕстьОшибки = Ложь;
	
	Если Не ПроверятьНомерКонтейнера Тогда
		Возврат ЕстьОшибки;
	КонецЕсли;

	ПривестиСтрокиНаСервере();
	
	МассивОшибок = Новый Массив;
	
	МассивЭлементов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокПредставлений, Символы.ПС, Истина);
	Для Каждого ПроверяемаяСтрока из МассивЭлементов Цикл
		Успешно = CW_Мониторинг.НомерКонтейнераКорректный(ПроверяемаяСтрока);
		Если Не Успешно Тогда 
			МассивОшибок.Добавить(ПроверяемаяСтрока);
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла; 
	
	Если МассивОшибок.Количество() > 0 Тогда    
		СписокСлов = СтрСоединить(МассивОшибок, ", ");
		СписокСлов = УбратьСимволПС(СписокСлов);
		Сообщить("Некорректные номера контейнеров: "+СписокСлов);
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	
КонецФункции

