&НаКлиенте
Процедура ВодителиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	СтруктураПараметровФормы = новый Структура;
	СтруктураПараметровФормы.Вставить("РольСотрудника"				, ПредопределенноеЗначение("Справочник.CW_РолиСотрудников.Водитель"));
	СтруктураПараметровФормы.Вставить("Организация"					, Организация);
	СтруктураПараметровФормы.Вставить("ОтборПоОрганизации"			,  ЗначениеЗаполнено(Организация));
	СтруктураПараметровФормы.Вставить("ВозможностьСоздаватьЗаписи"	, Ложь);
	СтруктураПараметровФормы.Вставить("РежимВыбора"					, истина);
	
	ДополнительныеПараметры = Новый Структура("Реквизит", "Водитель");

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораВодителя",ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораСотрудникаДляРоли",СтруктураПараметровФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбораВодителя(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		СтрокиПоВодителю = Водители.НайтиСтроки(Новый Структура("Водитель",Ответ));
		Если (СтрокиПоВодителю.Количество() = 0) Тогда
			
			НоваяСтрока = Водители.Добавить();
			НоваяСтрока.Водитель = Ответ;
			
		Иначе
			
			ПоказатьПредупреждение(,"Водитель уже добавлен.");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	
	табВодители = ПолучитьИзВременногоХранилища(Параметры.ВодителиАдрес);
	
	Водители.Загрузить(табВодители);
	
	Отбор = Новый Структура("Водитель", Параметры.ОсновнойОодитель);
	
	мСтроки = Водители.НайтиСтроки(Отбор);
	
	Если мСтроки.Количество() > 0 Тогда
		НайденнаяСтрока = мСтроки[0];
		НайденнаяСтрока.Основной = истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВодителиОсновнойПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Водители.ТекущиеДанные;
	
	Если ТекущиеДанные.Основной Тогда
		
		ОчиститьВсеГалки();
		ТекущиеДанные.Основной = истина;
		
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВсеГалки()
	
	Для каждого СтрокаВодителей Из Водители Цикл
		
		СтрокаВодителей.Основной = ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицыВодителей()
	
	Возврат	ПоместитьВоВременноеХранилище(Водители.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть(ПолучитьАдресТаблицыВодителей());
КонецПроцедуры
