&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьПриОткрытии = Параметры.Свойство("Документ", Документ);
	
	Параметры.Свойство("ВерсияБюджета", 			ВерсияБюджета); 
	
	Если ВерсияБюджета.Пустая() Тогда
		ВерсияБюджета = CW_Бюджетирование.ПолучитьОсновнуюВерсиюБюджета();  
		Если ЗначениеЗаполнено(ВерсияБюджета) Тогда
			ВерсияБюджета = ПредопределенноеЗначение("Справочник.CW_ВерсииБюджетов.Основная");
		КонецЕсли;
	КонецЕсли; 
	
	ПравоДоступноПросмотрБюджетов 		= CW_ПраваДоступа.ПравоДоступно("ПросмотрБюджетов");
	ПравоДоступноРедактированиеБюджетов = CW_ПраваДоступа.ПравоДоступно("РедактированиеБюджетов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПоказатьНастройки=Истина;
	НастройкаНаСервере(); 
	
	Если ЭтаФорма.СформироватьПриОткрытии Тогда 
		СформироватьОтчет();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет() 
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Документ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран документ!",,"Документ",,Отказ);
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ПоместитьНастройкиФормыВХранилище();
	
	ЭтаФорма.СкомпоноватьРезультат();
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьНастройкиФормыВХранилище()
	
	КурсДокумента = ПолучитьКурсДокумента(); 
	
	Настройки = Новый Структура;
	Настройки.Вставить("Документ", 				Документ);
	Настройки.Вставить("Организация", 			Документ.Организация);
	Настройки.Вставить("ВалютаДокумента",		Документ.Валюта);
	Настройки.Вставить("КурсДокумента", 		КурсДокумента);
	Настройки.Вставить("ВерсияБюджета", 		ВерсияБюджета);
	Настройки.Вставить("УчитыватьКонтрагента", 	УчитыватьКонтрагента);
	Настройки.Вставить("УчитыватьСтавкуНДС", 	УчитыватьСтавкуНДС);
	Настройки.Вставить("УчитыватьВалюту", 		УчитыватьВалюту);
	Настройки.Вставить("УчитыватьПорядокОтражения", УчитыватьПорядокОтражения);
	
	Отчет.АдресНастроек = ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры   

Функция ПолучитьКурсДокумента()

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда   
		ИмяРегистра = "CW_РасходыПоГрузоперевозкам";
	КонецЕсли;
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		ИмяРегистра = "CW_ДоходыПоГрузоперевозкам";
	КонецЕсли;
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ОборотыРегистра.ВсегоОборот) КАК ВсегоОборот,
	|	СУММА(ОборотыРегистра.Всего_ВалютаОборот) КАК Всего_ВалютаОборот
	|ИЗ
	|	РегистрНакопления."+ИмяРегистра+".Обороты(, , Регистратор, ) КАК ОборотыРегистра
	|ГДЕ
	|	ОборотыРегистра.Регистратор = &Регистратор";    
	
	Запрос.УстановитьПараметр("Регистратор", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();     

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда  
		Если Выборка.Всего_ВалютаОборот > 0 Тогда
			Возврат Выборка.ВсегоОборот / Выборка.Всего_ВалютаОборот;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат 1;
	
КонецФункции



&НаКлиенте
Процедура Настройка(Команда)

	ПоказатьНастройки = Не ПоказатьНастройки;
	НастройкаНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура НастройкаНаСервере()
	
	Элементы.ГруппаНастройкиОтчета.Видимость 	= ПоказатьНастройки;
	Элементы.ФормаНастройка.Пометка				= ПоказатьНастройки;
	
КонецПроцедуры


&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
    СтандартнаяОбработка = Ложь;
	
	СтруктураИзРасшифровки = ПолучитьСтруктуруПоДаннымРасшифровкиНаСервере(Расшифровка);
	ИмяПоля = СтруктураИзРасшифровки.ИмяПоля;
	Статья  = СтруктураИзРасшифровки.Статья;
	
	Если ИмяПоля = "Ссылка" Тогда
		Если НЕ ЗначениеЗаполнено(Статья) 
			ИЛИ ТипЗнч(Статья) <> Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов") Тогда
			Возврат;
		КонецЕсли;	
		
		Если ПравоДоступноПросмотрБюджетов Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", Статья);
			ПараметрыФормы.Вставить("ТолькоПросмотр", СтруктураИзРасшифровки.ТолькоПросмотр); 
			
			ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;	 
		
		Возврат;
	КонецЕсли;
	
	Если ИмяПоля = "Отклонение" Тогда  
		
		Если СтруктураИзРасшифровки.Отклонение <> 0 Тогда
			Если Не ПравоДоступноРедактированиеБюджетов Тогда
				Возврат;
			КонецЕсли;    
			
			ДополнительныеПараметры = Новый Структура; 
			ДополнительныеПараметры.Вставить("СтруктураИзРасшифровки", СтруктураИзРасшифровки);
			
			Если НЕ ЗначениеЗаполнено(Статья) 
				ИЛИ ТипЗнч(Статья) <> Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов") Тогда    
				
				ТекстВопроса 		= "Добавить статью бюджета?";
				ОписаниеОповещения 	= Новый ОписаниеОповещения("ОбработкаВопросаДобавленияСтатьиБюджета",ЭтотОбъект, ДополнительныеПараметры); 
				
			Иначе
				ТекстВопроса 		= "Скорректировать статью бюджета?";
				ОписаниеОповещения 	= Новый ОписаниеОповещения("ОбработкаВопросаКорректированияСтатьиБюджета",ЭтотОбъект, ДополнительныеПараметры); 
				
			КонецЕсли;	
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли; 
		
		Возврат;
	КонецЕсли;	                      
	
	АдресСхемы = ПолучитьАдресСхемыКомпоновкиДанных();
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	
    ДоступныеДействия = Новый Массив();
    ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
    
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ОписаниеОповещения,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
			ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
			НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				СформироватьОтчет();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаДобавленияСтатьиБюджета(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ДобавитьСтатьюБюджетаПоСтруктуреИзРасшифровкиНаСервере(ДополнительныеПараметры.СтруктураИзРасшифровки);
	Если ТипЗнч(Результат) = Тип("Строка") Тогда   
		Сообщить(Результат);
	Иначе
		СформироватьОтчет(); 
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаКорректированияСтатьиБюджета(Ответ, ДополнительныеПараметры) Экспорт 

	Если Ответ <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	Результат = СкорректироватьСтатьюБюджетаПоСтруктуреИзРасшифровкиНаСервере(ДополнительныеПараметры.СтруктураИзРасшифровки);
	Если ТипЗнч(Результат) = Тип("Строка") Тогда   
		Сообщить(Результат);
	Иначе
		СформироватьОтчет(); 
	КонецЕсли;    
		
КонецПроцедуры

&НаСервере
Функция ЗапрещеноРедактированиеБюджета(Грузоперевозка)
	
	Если Не ПравоДоступноРедактированиеБюджетов Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_УтверждениеБюджетов.Объект
	|ИЗ
	|	РегистрСведений.CW_УтверждениеБюджетов КАК CW_УтверждениеБюджетов
	|ГДЕ
	|	CW_УтверждениеБюджетов.Объект = &Объект"; 
	
	Запрос.УстановитьПараметр("Объект", Грузоперевозка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();    
	
КонецФункции

&НаСервере
Функция ДобавитьСтатьюБюджетаПоСтруктуреИзРасшифровкиНаСервере(ПараметрыПроцедуры)
	
	УчитыватьНДСВСебестоимости = CW_Настройки.ПараметрУчетнойПолитики(Документ.Дата, Документ.Организация, "УчитыватьНДСВСебестоимости");
	
	Статья = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.СоздатьЭлемент();
	Статья.Валюта               		= Документ.Валюта;
	Статья.ВерсияБюджета         		= ВерсияБюджета;
	Статья.ВидСтатьиПланирования 		= Перечисления.CW_ВидыСтатейПланирования.Расходы;
	Статья.Владелец              		= ПараметрыПроцедуры.Грузоперевозка;
	Статья.Организация           		= Документ.Организация;
	Статья.Контрагент            		= Документ.Контрагент;
	Статья.Номенклатура          		= ПараметрыПроцедуры.Номенклатура; 
	Статья.УчитыватьНДСВСебестоимости 	= УчитыватьНДСВСебестоимости; 
	
	ДанныеКурса = CW_Финансы.ПолучитьКурсВалюты(Статья.Валюта, Документ.Дата);
	Статья.Курс		 = ДанныеКурса.Курс;
	Статья.Кратность = ДанныеКурса.Кратность;
	
	Статья.СтавкаНДС             = ПараметрыПроцедуры.СтавкаНДС;
	Статья.СуммаВсего            = ПараметрыПроцедуры.СуммаВсего;

	CW_Бюджетирование.ПриИзмененииСуммыВсегоСтатьиБюджета(Статья);
	
	Попытка
		Статья.Записать();
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции 

&НаСервере
Функция СкорректироватьСтатьюБюджетаПоСтруктуреИзРасшифровкиНаСервере(ПараметрыПроцедуры)

	СтатьяОбъект = ПараметрыПроцедуры.Статья.ПолучитьОбъект();
	СтатьяОбъект.СуммаВсего = ПараметрыПроцедуры.СуммаВсего;
	
	CW_Бюджетирование.ПриИзмененииСуммыВсегоСтатьиБюджета(СтатьяОбъект);
	
	Попытка
		СтатьяОбъект.Записать();
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруПоДаннымРасшифровкиНаСервере(Расшифровка)
	
	// значение возврата
	Структура = Новый Структура("ИмяПоля, Статья");
	
	// объект
	ЗначенияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	
	Структура.ИмяПоля = ЗначенияРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Поле;
	
	Если Структура.ИмяПоля = "Ссылка" Тогда
		Структура.Вставить("Статья", 			ЗначенияРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Значение);
		Структура.Вставить("Грузоперевозка", 	ЗначенияРасшифровки.Элементы[Расшифровка - 3].ПолучитьПоля()[0].Значение); 
		
		Если ПравоДоступноПросмотрБюджетов 
			И ЗначениеЗаполнено(Структура.Статья) 
			И ТипЗнч(Структура.Статья) = Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов") Тогда  
			
			Структура.Вставить("ТолькоПросмотр", ЗапрещеноРедактированиеБюджета(Структура.Грузоперевозка)); 
			
		КонецЕсли;	
		
	ИначеЕсли Структура.ИмяПоля = "Отклонение" Тогда
		
		Структура.Вставить("Отклонение", ЗначенияРасшифровки.Элементы[Расшифровка].ПолучитьПоля()[0].Значение);
		Структура.Вставить("Статья", ЗначенияРасшифровки.Элементы[Расшифровка - 3].ПолучитьПоля()[0].Значение);	
		Если Структура.Отклонение <> 0 Тогда
			Если ПравоДоступноРедактированиеБюджетов Тогда
				Если НЕ ЗначениеЗаполнено(Структура.Статья) ИЛИ ТипЗнч(Структура.Статья) <> Тип("СправочникСсылка.CW_ПлановыеСтатьиЗатратИДоходов") Тогда
					// Статьи нет - для создания надо...
					Структура.Вставить("Грузоперевозка", 	ЗначенияРасшифровки.Элементы[Расшифровка - 6].ПолучитьПоля()[0].Значение);
					Структура.Вставить("Номенклатура", 		ЗначенияРасшифровки.Элементы[Расшифровка - 5].ПолучитьПоля()[0].Значение);
					Структура.Вставить("СтавкаНДС", 		ЗначенияРасшифровки.Элементы[Расшифровка - 4].ПолучитьПоля()[0].Значение);
					Структура.Вставить("СуммаВсего",		ЗначенияРасшифровки.Элементы[Расшифровка - 1].ПолучитьПоля()[0].Значение + ЗначенияРасшифровки.Элементы[Расшифровка - 2].ПолучитьПоля()[0].Значение);
				Иначе
					// Чтобы Статью корректировать...
					Структура.Вставить("СуммаВсего", 		ЗначенияРасшифровки.Элементы[Расшифровка - 1].ПолучитьПоля()[0].Значение + ЗначенияРасшифровки.Элементы[Расшифровка - 2].ПолучитьПоля()[0].Значение);
				КонецЕсли;									
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;	
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ПолучитьАдресСхемыКомпоновкиДанных()
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
	
	Возврат URLСхемы;
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьАдресСхемыКомпоновкиДанных()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции
