&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
//Процедура ВыполнитьВнешнююКоманду(СтруктураПараметров) Экспорт
//
//СтруктураПараметров = Новый Структура;
// - ПараметрыВнешнейКоманды -  Структура с параметтрами:
//									- ПодключаемыйОбъект - ссылка на справочник "Подклчюаемые объекты";
//									- ИмяМетода - имя выплняемого метода, описанного в функции "Информация", модуля обпработки;
//									- ИмяФормы - имя формы обработки, описанной вфункции "Информация", модуля обпработки;
//
// - МассивОбъектовНазначения - массив выделенных ссылок;
//
// В параметр "ВладелецФормы" передается исходаня форма, из которой вызван данный метод. 

&НаКлиенте
Процедура ВыполнитьВнешнююКоманду(СтруктураПараметров) Экспорт
	
	Если СтруктураПараметров.МассивОбъектовНазначения <> Неопределено Тогда
		
		МассивСсылок = Новый Массив;
		
		Для Каждого Идентификатор из СтруктураПараметров.МассивОбъектовНазначения Цикл
			//В случае журнала, в параметр МассивОбъектовНазначения передается массив идетнийикаторв выделенных строк 
			СтрокаЖурнала = ВладелецФормы.Журнал_Данные.НайтиПоИдентификатору(Идентификатор); 
			МассивСсылок.Добавить(СтрокаЖурнала.Ссылка);
			
		КонецЦикла;
		
		ОбработатьГрузоперевозкуНаСервере(МассивСсылок);
			

	КонецЕсли;
	
	ПоказатьПредупреждение(,"Обнолвение коментариев выполнено!");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьГрузоперевозкуНаСервере(МассивСсылок)
	
	Для Каждого ЭлементМассва из МассивСсылок Цикл
		
		//Формируем  текст комментария и заменяем его в грузопереовзке:
		//так же тут можно получить значения отдельных параметров.
		СтрокаКомментария = "Грузоперевозка № "+СокрЛП(ЭлементМассва.Номер)+" от "+Формат(ЭлементМассва.ДатаСделкиФ, "ДФ='dd.MM.yyyy г.'")+"
		| Клиент: 			" + ?(ЗначениеЗаполнено(ЭлементМассва.Клиент)				, СокрЛП(ЭлементМассва.Клиент)	,"-----")+";
		| Груз:				" + ?(ЗначениеЗаполнено(ЭлементМассва.Груз)				, СокрЛП(ЭлементМассва.Груз)	,"-----")+";
		| Маршрут:			" + ?(ЗначениеЗаполнено(ЭлементМассва.Маршрут)				, СокрЛП(ЭлементМассва.Маршрут),"-----")+";
		| Ответственный:	" + ?(ЗначениеЗаполнено(ЭлементМассва.ОперативныйМенеджер)	, СокрЛП(ЭлементМассва.ОперативныйМенеджер),"-----")+";";
		
		
		ГрузоперевозкаОбъект 				= ЭлементМассва.ПолучитьОбъект();
		ГрузоперевозкаОбъект.Комментарий 	= СтрокаКомментария;
		
		Попытка
			ГрузоперевозкаОбъект.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = 	"Не удалось записать грузопереовзку № "+СокрЛП(ЭлементМассва.Номер)+" от "+Формат(ЭлементМассва.ДатаСделкиФ, "ДФ='dd.MM.yyyy г.'")+"
			|По причине: "+ ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;  
		
	КонецЦикла;
	
КонецПроцедуры
