
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокОбъектовМаршрутаСогласования();
	
	УстановитьПометкуКнопокПорядкаСогласования();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбъектовМаршрутаСогласования()
	
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоступныеОбъектыСогласования.ИдентификаторОбъектаМетаданных КАК ОбъектМетаданных,
	               |	ВЫБОР
	               |		КОГДА CW_НазначениеМаршрутовСогласования.НазначениеМаршрута ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Используется
	               |ИЗ
	               |	РегистрСведений.CW_ДоступныеОбъектыСогласования КАК CW_ДоступныеОбъектыСогласования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_НазначениеМаршрутовСогласования КАК CW_НазначениеМаршрутовСогласования
	               |		ПО CW_ДоступныеОбъектыСогласования.ИдентификаторОбъектаМетаданных = CW_НазначениеМаршрутовСогласования.НазначениеМаршрута
	               |			И (CW_НазначениеМаршрутовСогласования.МаршрутСогласования = &МаршрутСогласования)
	               |АВТОУПОРЯДОЧИВАНИЕ";

	Запрос.УстановитьПараметр("МаршрутСогласования", 	Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДоступенОбъектам.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура КомандаПараллельное(Команда)
	
	Объект.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Параллельное");
	УстановитьПометкуКнопокПорядкаСогласования();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоследовательное(Команда)
	
	Объект.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное");
	УстановитьПометкуКнопокПорядкаСогласования();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуКнопокПорядкаСогласования()
	
	ЦветАктивности 	= Новый Цвет(0,150,70);
	ЦветТекстаФормы = Новый Цвет;
	
	Элементы.КомандаПараллельное.Пометка 	 = Объект.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Параллельное");
	Элементы.КомандаПоследовательное.Пометка = Объект.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное");
	
	Элементы.КомандаПараллельное.ЦветТекста 	= ?(Объект.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Параллельное"),ЦветАктивности, ЦветТекстаФормы);
	Элементы.КомандаПоследовательное.ЦветТекста = ?(Объект.ПорядокСогласования = ПредопределенноеЗначение("Перечисление.CW_ПорядокСогласованияОбъектов.Последовательное"),ЦветАктивности, ЦветТекстаФормы);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьДанныеНазначенияМаршрута();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНазначенияМаршрута()
	
	НазначенияМаршрута = ПолучитьОтмеченныеНазначенияМаршурта();
	РегистрыСведений.CW_НазначениеМаршрутовСогласования.ЗаписатьНазначениеМаршрутаСогласования(Объект.Ссылка, НазначенияМаршрута);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтмеченныеНазначенияМаршурта()
	
	НазначенияМаршрута = РегистрыСведений.CW_НазначениеМаршрутовСогласования.ПолучитьПустуюТаблицу();
	
	мВыделенныеСтроки = ДоступенОбъектам.НайтиСтроки(Новый Структура("Используется", Истина));
	Для Каждого СтрокаТаблицы из мВыделенныеСтроки Цикл
		НоваяСтрока = НазначенияМаршрута.добавить();
		НоваяСтрока.НазначениеМаршрута  = СтрокаТаблицы.ОбъектМетаданных;
		НоваяСтрока.МаршрутСогласования = Объект.Ссылка;
	КонецЦикла;
	
	Возврат  НазначенияМаршрута;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ПродолжитьЗапись Тогда
		Если НЕ ПроверитьВозможностьЗаписиМаршрутаНаСервере() Тогда
			Отказ = Истина;
			ПоказатьВопросПриЗаписиМаршрута(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Отказ = Ложь;
	Если Не ПродолжитьЗапись Тогда
		Если НЕ ПроверитьВозможностьЗаписиМаршрутаНаСервере() Тогда
			Отказ = Истина;
			ПоказатьВопросПриЗаписиМаршрута(Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ Тогда
		ЭтаФорма.Записать();
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьВопросПриЗаписиМаршрута(ЗакрытьФорму)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	
	ПараметрыЗаписи = Новый Структура("ЗакрытьФорму", ЗакрытьФорму);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, ПараметрыЗаписи);
	ПоказатьВопрос(Оповещение, "Для маршрута не определены доступные объекты! Использование маршрута будет не невозможно. Продолжить?", Режим, 0);

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ПараметрыЗаписи) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ПродолжитьЗапись = Истина;
	ЭтаФорма.Записать();
	
	Если ПараметрыЗаписи.ЗакрытьФорму Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьЗаписиМаршрутаНаСервере()
	
	мВыделенныеСтроки = ДоступенОбъектам.НайтиСтроки(Новый Структура("Используется", Истина));
	
	Возврат мВыделенныеСтроки.Количество() > 0;
	
КонецФункции

&НаКлиенте
Процедура ДоступенОбъектамСнятьФлажки(Команда)
	
	ОбработатьФлажкиТаблицы(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступенОбъектамУстановитьФлажки(Команда)
	
	ОбработатьФлажкиТаблицы(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьФлажкиТаблицы(Используется) 
	
	Для Каждого СтрокаТаблицы из ДоступенОбъектам ЦИкл
		СтрокаТаблицы.Используется = Используется;
	КонецЦикла;
	
КонецПроцедуры



