
Функция ПроверитьУчетнуюЗаписьДляОтправкиПисемНаСогласование() Экспорт
	
	Возврат	ЗначениеЗаполнено(Константы.CW_УчетнаяЗаписьДляОтправкиПисемПоСогласованию.Получить());
	
КонецФункции

Функция ПолучитьУчетнуюЗаписьДляОтправкиПисемНаСогласование() Экспорт
	
	Возврат	Константы.CW_УчетнаяЗаписьДляОтправкиПисемПоСогласованию.Получить();
	
КонецФункции

Функция ПараметрыОтправкиПисьма() Экспорт
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Отправитель", Неопределено);
	ПараметрыПисьма.Вставить("Получатель", Неопределено);
	ПараметрыПисьма.Вставить("Копии", Неопределено);
	ПараметрыПисьма.Вставить("СкрытыеКопии", Неопределено);
	ПараметрыПисьма.Вставить("Тема", Неопределено);
	ПараметрыПисьма.Вставить("Текст", Неопределено);
	ПараметрыПисьма.Вставить("Вложения", Неопределено);
	ПараметрыПисьма.Вставить("УдалятьФайлыПослеОтправки", Неопределено);
	ПараметрыПисьма.Вставить("Предмет", Неопределено);
	
	Возврат ПараметрыПисьма;
	
КонецФункции
