#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ПростойИнтерфейсКлиент.ПараметрыОткрытияЗависимыхФорм(ПараметрыВыполненияКоманды.Источник);
	
	ОткрытьФорму("Документ.РегистрацияОплатыОсновныхСредствДляУСН.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

#КонецОбласти