Процедура ВыполнитьПереводПеревозокПрофиляВАрхив(ПараметрыПроцедуры, РезультатВыполнения) Экспорт
	
	CW_ОбщийМодульЛичныйКабинетСервер.ПеревестиГрузоперевозокиВАрхив(ПараметрыПроцедуры.Профили);

КонецПроцедуры    

Процедура ВыполнитьКонвертациюВебПрофилей() Экспорт
	
	СоответствиеПрофилей = Новый Соответствие;
	
	//Шаблоны Перевозок 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПереводыВебПрофиля.ВебПрофиль КАК ВебПрофиль,
	               |	CW_ПереводыВебПрофиля.Язык КАК Язык,
	               |	CW_ПереводыВебПрофиля.ИдентифкаторСтроки КАК ИдентифкаторСтроки,
	               |	CW_ПереводыВебПрофиля.Перевод КАК Перевод
	               |ИЗ
	               |	РегистрСведений.CW_ПереводыВебПрофиля КАК CW_ПереводыВебПрофиля"; 
	
	ТаблицаПереводов = Запрос.Выполнить().Выгрузить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВебПрофили.Ссылка КАК Ссылка,
	               |	CW_ВебПрофили.АвтоматическиПереводитьВАрхив КАК АвтоматическиПереводитьВАрхив,
	               |	CW_ВебПрофили.Активный КАК Активный,
	               |	CW_ВебПрофили.ВыгружатьФайлы КАК ВыгружатьФайлы,
	               |	CW_ВебПрофили.ДоступенВыводНаАнглийскомЯзыке КАК ДоступенВыводНаАнглийскомЯзыке,
	               |	CW_ВебПрофили.НастройкиОсновногоОтбора КАК НастройкиОсновногоОтбора,
	               |	CW_ВебПрофили.ОтсрочкаПереводаВАрхив КАК ОтсрочкаПереводаВАрхив,
	               |	CW_ВебПрофили.ПараметрПереводаВАрхив КАК ПараметрПереводаВАрхив,
	               |	CW_ВебПрофили.ПредставлениеНаАнглийском КАК ПредставлениеНаАнглийском,
	               |	CW_ВебПрофили.ПредставлениеНаРусском КАК ПредставлениеНаРусском,
	               |	CW_ВебПрофили.ВыводитьТипФайла КАК ВыводитьТипФайла,
	               |	CW_ВебПрофили.РазрешеноПрикреплятьФайлы КАК РазрешеноПрикреплятьФайлы,
	               |	CW_ВебПрофили.ИдентификаторАрхивныхГрузоперевозок КАК ИдентификаторАрхивныхГрузоперевозок,
	               |	CW_ВебПрофили.ОсновнойПрофиль КАК ОсновнойПрофиль,
	               |	CW_ВебПрофили.СтруктураПрофиля.(
	               |		НомерСтроки КАК НомерСтроки,
	               |		Имя КАК Имя,
	               |		Заголовок КАК Заголовок,
	               |		Наименование КАК Наименование,
	               |		СтрокаПоляКомпоновки КАК СтрокаПоляКомпоновки,
	               |		ОбъектХарактеристики КАК ОбъектХарактеристики,
	               |		Формат КАК Формат,
	               |		ТипЗначения КАК ТипЗначения,
	               |		Фиксация КАК Фиксация,
	               |		БыстрыйОтбор КАК БыстрыйОтбор,
	               |		ДоступенФормат КАК ДоступенФормат
	               |	) КАК СтруктураПрофиля,
	               |	CW_ВебПрофили.ПоляСортировки.(
	               |		Имя КАК Имя,
	               |		СтрокаПоляКомпоновки КАК СтрокаПоляКомпоновки,
	               |		Заголовок КАК Заголовок,
	               |		Сортировка КАК Сортировка
	               |	) КАК ПоляСортировки
	               |ИЗ
	               |	Справочник.CW_ВебПрофили КАК CW_ВебПрофили
	               |ГДЕ
	               |	CW_ВебПрофили.ОсновнойПрофиль <> ЗНАЧЕНИЕ(Справочник.CW_ВебПрофили.ПустаяСсылка)
	               |	И CW_ВебПрофили.ШаблонПрофиля = ЗНАЧЕНИЕ(Справочник.CW_ВебШаблоныПрофилей.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	                                        
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВебШаблонОбъект = Справочники.CW_ВебШаблоныПрофилей.СоздатьЭлемент();
		ВебШаблонОбъект.Наименование 	= СокрЛП(Выборка.Ссылка);
		ВебШаблонОбъект.Раздел			= "ГРУЗОПЕРЕВОЗКИ"; 
		
		ВыборкаСтруктураПрофиля = Выборка.СтруктураПрофиля.Выбрать();   
		Пока ВыборкаСтруктураПрофиля.Следующий() Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ВебПрофиль",  			Выборка.Ссылка);
			Отбор.Вставить("Язык",  				ПредопределенноеЗначение("Справочник.CW_Языки.en"));
			Отбор.Вставить("ИдентифкаторСтроки", 	ВыборкаСтруктураПрофиля.НомерСтроки - 1); 
			
			МассивСтрок = ТаблицаПереводов.НайтиСтроки(Отбор);  
			Если МассивСтрок.Количество() > 0 Тогда
				ЗаголовокEN = МассивСтрок[0].Перевод;
			КонецЕсли;
			
			СтрокаТаблицы = ВебШаблонОбъект.СтруктураПрофиля.Добавить();  
			СтрокаТаблицы.ЗаголовокRU 			= ВыборкаСтруктураПрофиля.Заголовок;
			СтрокаТаблицы.ЗаголовокEN 			= ЗаголовокEN;
			СтрокаТаблицы.СтрокаПоляКомпоновки 	= ВыборкаСтруктураПрофиля.СтрокаПоляКомпоновки;
			СтрокаТаблицы.ОбъектХарактеристики  = ВыборкаСтруктураПрофиля.ОбъектХарактеристики;
			СтрокаТаблицы.Формат 				= ВыборкаСтруктураПрофиля.Формат;
			СтрокаТаблицы.Фиксация 				= ВыборкаСтруктураПрофиля.Фиксация;
			СтрокаТаблицы.БыстрыйОтбор 			= ВыборкаСтруктураПрофиля.БыстрыйОтбор;
			СтрокаТаблицы.ДоступенФормат 		= ВыборкаСтруктураПрофиля.ДоступенФормат;
			СтрокаТаблицы.ИмяПоля 				= ВыборкаСтруктураПрофиля.Имя;  
			
			ОписаниеТипа = ПолучитьОписаниеТипа(ВыборкаСтруктураПрофиля.ОбъектХарактеристики, ВыборкаСтруктураПрофиля.СтрокаПоляКомпоновки);

			СтрокаТаблицы.ХранилищеТипаЗначения = Новый ХранилищеЗначения(ОписаниеТипа);			 
			
			СтрокаТаблицы = ВебШаблонОбъект.ПоляОбъекта.Добавить(); 
			СтрокаТаблицы.СтрокаПоляКомпоновки 	= ВыборкаСтруктураПрофиля.СтрокаПоляКомпоновки;
			СтрокаТаблицы.ЗаголовокRU 			= ВыборкаСтруктураПрофиля.Заголовок;
			
		КонецЦикла;
		
		ВыборкаПоляСортировки = Выборка.ПоляСортировки.Выбрать(); 
		Пока ВыборкаПоляСортировки.Следующий() Цикл
			СтрокаТаблицы = ВебШаблонОбъект.ПоляСортировки.Добавить(); 
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаПоляСортировки); 
		КонецЦикла; 
		
		СтрокаТаблицы = ВебШаблонОбъект.ГруппыПолей.Добавить(); 
		СтрокаТаблицы.ИмяГруппыRU 			= "<Пустая>"; 
		СтрокаТаблицы.ЕстьОформление		= -1;
		СтрокаТаблицы.ХранилищеШрифт 	 	= Новый ХранилищеЗначения(ШрифтыСтиля.ШрифтТекста);
		СтрокаТаблицы.ХранилищеЦветТекста 	= Новый ХранилищеЗначения(ЦветаСтиля.ЦветТекстаПоля);
		СтрокаТаблицы.ХранилищеЦветФона 	= Новый ХранилищеЗначения(ЦветаСтиля.ЦветФонаПоля);  
		
		ВебШаблонОбъект.Записать();
		
		CW_ВебПрофильПеревозки = Справочники.CW_ВебПрофилиПеревозок.СоздатьЭлемент();
		CW_ВебПрофильПеревозки.Наименование 					= СокрЛП(Выборка.Ссылка);
		CW_ВебПрофильПеревозки.Владелец 						= Выборка.ОсновнойПрофиль;
		CW_ВебПрофильПеревозки.АвтоматическиПереводитьВАрхив 	= Выборка.АвтоматическиПереводитьВАрхив;
		CW_ВебПрофильПеревозки.Активный 						= Выборка.Активный;
		CW_ВебПрофильПеревозки.ВыгружатьФайлы 					= Выборка.ВыгружатьФайлы;
		CW_ВебПрофильПеревозки.ДоступенВыводНаАнглийскомЯзыке 	= Выборка.ДоступенВыводНаАнглийскомЯзыке;
		CW_ВебПрофильПеревозки.НастройкиОсновногоОтбора 		= Новый ХранилищеЗначения(Выборка.НастройкиОсновногоОтбора.Получить());
		CW_ВебПрофильПеревозки.ОтсрочкаПереводаВАрхив 			= Выборка.ОтсрочкаПереводаВАрхив;
		CW_ВебПрофильПеревозки.ПараметрПереводаВАрхив 			= Выборка.ПараметрПереводаВАрхив;
		CW_ВебПрофильПеревозки.ПредставлениеRU 					= Выборка.ПредставлениеНаРусском;
		CW_ВебПрофильПеревозки.ПредставлениеEN 					= Выборка.ПредставлениеНаАнглийском;
		CW_ВебПрофильПеревозки.ВыводитьТипФайла 				= Выборка.ВыводитьТипФайла;
		CW_ВебПрофильПеревозки.РазрешеноПрикреплятьФайлы 		= Выборка.РазрешеноПрикреплятьФайлы;
		CW_ВебПрофильПеревозки.ИдентификаторАрхива 				= Выборка.ИдентификаторАрхивныхГрузоперевозок;
		CW_ВебПрофильПеревозки.ШаблонПрофиля 					= ВебШаблонОбъект.Ссылка; 
		
		CW_ВебПрофильПеревозки.ТипыФайлов.Загрузить(Выборка.Ссылка.ТипыФайлов.Выгрузить());
		
		CW_ВебПрофильПеревозки.УстановитьНовыйКод();
		CW_ВебПрофильПеревозки.ОбменДанными.Загрузка = ИСТИНА;
		CW_ВебПрофильПеревозки.Записать();   
		
		ОбъектПрофиль = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектПрофиль.ШаблонПрофиля = ВебШаблонОбъект.Ссылка; 
		ОбъектПрофиль.ОбменДанными.Загрузка = ИСТИНА;
		ОбъектПрофиль.Записать();   
		
		СоответствиеПрофилей.Вставить(Выборка.Ссылка, CW_ВебПрофильПеревозки.Ссылка);

	КонецЦикла;
	//Шаблоны Перевозок 
	
	//Перепишем данные регистра
	Набор = РегистрыСведений.CW_ПользователиВебПрофилей.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	Для Каждого СтрокаНабора из Набор Цикл
		
		ВебПрофильПеревозки = СоответствиеПрофилей.Получить(СтрокаНабора.ВебПрофиль);
		Если ВебПрофильПеревозки <> Неопределено Тогда
			СтрокаНабора.ВебПрофиль = ВебПрофильПеревозки; 
			СтрокаНабора.Раздел 	= "ГРУЗОПЕРЕВОЗКИ";
		КонецЕсли;
		
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры  

Функция ПолучитьОписаниеТипа(ОбъектХарактеристики, СтрокаПоляКомпоновки)
	
	Если ЗначениеЗаполнено(ОбъектХарактеристики) Тогда
		//Это параметр
		Возврат ОбъектХарактеристики.ТипЗначения;
	Иначе
		//реквизит 
		
		мРеквизиты = СтрРазделить(СтрокаПоляКомпоновки,".");  
		Если мРеквизиты.Количество() = 1 Тогда 
			//Это ссылка 
			Имяполя = мРеквизиты[0];
			мТипы = Новый Массив;
			Если Имяполя = "Ссылка" Тогда
				мТипы.Добавить(Тип("СправочникСсылка.CW_Грузоперевозки"));
			КонецЕсли;
			Если Имяполя = "ЛогистическийСтатус" Тогда
				мТипы.Добавить(Тип("СправочникСсылка.CW_ЛогистическиеСтатусы"));
			КонецЕсли;
			
			Возврат Новый ОписаниеТипов(мТипы);
		КонецЕсли;  
		
		мТипы = Новый Массив;
		
		Попытка
			Ссылка 			= ПредопределенноеЗначение("Справочник.CW_Грузоперевозки.ПустаяСсылка");
			ПустоеЗначение 	= Вычислить(СтрокаПоляКомпоновки); 
			мТипы.Добавить(ТипЗнч(ПустоеЗначение));
		Исключение
		КонецПопытки;  
		
		Возврат Новый ОписаниеТипов(мТипы);  
		
	Конецесли;
	
КонецФункции

Процедура ПриОтключенииКонтстантыЗапрашиватьТипФайлаПриДобавленииВАрхив() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ВебПрофилиПеревозок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ВебПрофилиПеревозок КАК CW_ВебПрофилиПеревозок";  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПрофильОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПрофильОбъект.ВыгружатьФайлы = Ложь;
		ПрофильОбъект.ВыводитьТипФайла = Ложь;
		ПрофильОбъект.РазрешеноПрикреплятьФайлы = Ложь;
		
		ПрофильОбъект.ТипыФайлов.Очистить(); 
		
		ПрофильОбъект.ОбменДанными.Загрузка = Истина; 
		ПрофильОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПрофилиЗаданий() Экспорт
	
	
КонецФункции