#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьДоступныеОбъектыМетаданных(мОбъекты) Экспорт
	
	Набор = РегистрыСведений.CW_ДоступныеОбъектыСогласования.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Набор.Очистить();
	
	Для Каждого ЭлементМассива из мОбъекты Цикл
		СтрокаНабора = Набор.Добавить();
		СтрокаНабора.ИдентификаторОбъектаМетаданных = ЭлементМассива;
		СтрокаНабора.Используется = Истина;
	КонецЦикла;
	
	Набор.Записать();
	
КонецПроцедуры

Функция ПроверитьДоступностьОбъектаМетаданных(ТипОбъекта) Экспорт 
	
	ИдетифкаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоступныеОбъектыСогласования.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных
	               |ИЗ
	               |	РегистрСведений.CW_ДоступныеОбъектыСогласования КАК CW_ДоступныеОбъектыСогласования
	               |ГДЕ
	               |	CW_ДоступныеОбъектыСогласования.ИдентификаторОбъектаМетаданных = &ИдетифкаторОбъекта";
	
	Запрос.УстановитьПараметр("ИдетифкаторОбъекта", ИдетифкаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецЕсли