&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("CW_ГруппаПользователя", 	ГруппаПользователя);
	СтруктураПараметров.Вставить("CW_Пользователь", 		ПараметрыСеанса.ТекущийПользователь);
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураПараметров);    
	
	Параметры.Свойство("РежимВыбора",Элементы.Список.РежимВыбора);
	Если Элементы.Список.РежимВыбора Тогда
		Элементы.Список.МножественныйВыбор=Ложь;
	КонецЕсли; 
	
	//Подсистема.ЛогистическиеСтатусы
	ИспользоватьЛогистическиеСтатусыЗаказов = ПолучитьФункциональнуюОпцию("CW_ИспользоватьЛогистическиеСтатусыЗаказов");
	
	Элементы.КартинкаСтатуса.Видимость 		= ИспользоватьЛогистическиеСтатусыЗаказов;
	Элементы.ЛогистическийСтатус.Видимость	= ИспользоватьЛогистическиеСтатусыЗаказов;
	
	Если ИспользоватьЛогистическиеСтатусыЗаказов Тогда
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_Заказы"));
		МеханизмРаскраски 	 = Константы.CW_МеханизмРаскраскиЗаказов.Получить();
		
		CW_ЛогистическиеСтатусыСервер.ПриСозданииФормыСпискаНаСервере(ЭтаФорма, "Список", ИдентификаторОбъекта, МеханизмРаскраски, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	//Подсистема.ЛогистическиеСтатусы
	
	//Подсистема.ФинансовыеСтатусы
	ИспользоватьФинансовыеСтатусыЗаказов = ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыЗаказов");
	
	Элементы.ФинансовыйСтатусКартинка.Видимость = ИспользоватьФинансовыеСтатусыЗаказов;
	Элементы.ФинансовыйСтатус.Видимость 		= ИспользоватьФинансовыеСтатусыЗаказов;
	//Подсистема.ФинансовыеСтатусы
	
	УстановитьПараметрыыДинамическогоСписка();    
	
	УстановитьОтборПоГруппеПользователя();

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	#Область ПоискПоГрузоперевозке
		ОбновитьДоступностьКнопок();
		УстановитьПараметрыДинамическогоСписка();
	#КонецОбласти

КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборПоГруппеПользователя()
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	Если  ГруппаПользователя = ПредопределенноеЗначение("Справочник.CW_ГруппыПользователей.Администраторы") 
		ИЛИ ГруппаПользователя.ПолныеПрава ИЛИ НЕ ГруппаПользователя.ФильтрЗаказов Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиГруппы  = ГруппаПользователя.ХранилищеФильтраЗаказов.Получить();
	Если НастройкиГруппы <> Неопределено Тогда
		Список.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиГруппы);
	КонецЕсли;
	
КонецПроцедуры


//Внешние подклчюаемые команды
&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры
//Внешние подклчюаемые команды

#Область ПоискПоГрузоперевозке

&НаКлиенте
Процедура КомандаНайти(Команда)
	
	ВключенОтборПоГрузопереовзке = истина;
	УстановитьПараметрыДинамическогоСписка();
	ОбновитьДоступностьКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьОтбор(Команда)
	
	АдресГрузоперевозок = "";
	ВключенОтборПоГрузопереовзке = Ложь;
	УстановитьПараметрыДинамическогоСписка();
	ОбновитьДоступностьКнопок();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьКнопок()
	
	Элементы.КомандаОтобрать.Доступность 			=  ЗначениеЗаполнено(СтрокаПоискаГрузоперевозки);
	Элементы.КомандаОтменитьОтбор.Доступность 		=  ВключенОтборПоГрузопереовзке;
	Элементы.МассивГрузоперевозокОтбора.Видимость 	=  ВключенОтборПоГрузопереовзке;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьПараметрыДинамическогоСписка()
	
	МассивСсылкоЗаказов = новый Массив;
	Если ВключенОтборПоГрузопереовзке Тогда
		МассивСсылкоЗаказов = ПолучитьМассивСсылокДляОтбора();
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ВключенОтбор"	, ВключенОтборПоГрузопереовзке);
	Список.Параметры.УстановитьЗначениеПараметра("мСсылки"		, МассивСсылкоЗаказов);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьМассивСсылокДляОтбора()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Грузопереовзка,
	               |	CW_Грузоперевозки.Заказ КАК Заказ
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.CW_Представление ПОДОБНО &СтрокаПоиска";
	
	Запрос.УстановитьПараметр("СтрокаПоиска","%"+СокрЛП(СтрокаПоискаГрузоперевозки)+"%");

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		АдресГрузоперевозок = "";
		Возврат новый Массив;
	КонецЕсли;
	
	ТаблицаРезультата = РезультатЗапроса.Выгрузить();
	
	МассивГрузоперевозок = ТаблицаРезультата.ВыгрузитьКолонку("Грузопереовзка");
	
	АдресГрузоперевозок = ПоместитьВоВременноеХранилище(МассивГрузоперевозок, ЭтаФорма.УникальныйИдентификатор);
	
	Возврат ТаблицаРезультата.ВыгрузитьКолонку("Заказ");
	
КонецФункции

&НаКлиенте
Процедура СтрокаПоискаГрузоперевозкиПриИзменении(Элемент)
	
	ВключенОтборПоГрузопереовзке = ЗначениеЗаполнено(СтрокаПоискаГрузоперевозки);
	УстановитьПараметрыДинамическогоСписка();
	ОбновитьДоступностьКнопок();
	
КонецПроцедуры

&НаКлиенте
Процедура МассивГрузоперевозокОтбораНажатие(Элемент)
	
	МассивДляОтбора = ПолучитьМассиивИзХранилища();
	
	Если МассивДляОтбора <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Ссылка",МассивДляОтбора));
	Иначе
		ПараметрыФормы = Новый Структура();
	КонецЕсли;
	
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаСписка",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассиивИзХранилища()
	
	Если ЭтоАдресВременногоХранилища(АдресГрузоперевозок) Тогда
 		МассивГрузоперевозок = ПолучитьИзВременногоХранилища(АдресГрузоперевозок);
		Возврат новый ФиксированныйМассив(МассивГрузоперевозок);
	КонецЕсли;
	
	Возврат Неопределено;
		

КонецФункции

#КонецОбласти  

&НаКлиенте
Процедура ПоказатьАрхивныеПриИзменении(Элемент)

	УстановитьПараметрыыДинамическогоСписка();
	Элементы.Список.Обновить();	

КонецПроцедуры   

&НаСервере
Процедура УстановитьПараметрыыДинамическогоСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьАрхивные", ПоказатьАрхивные);
	
КонецПроцедуры





// ---------------------------------------------------------------------------- 