
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступныеВариантыСлежения = ПолучитьДоступныеВариантыСлежения();
	Если ДоступныеВариантыСлежения.Количество() = 1 Тогда
		ВариантСлежения = ДоступныеВариантыСлежения[0];	
	КонецЕсли;
	
	ДатаНачала = ТекущаяДата(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПостановкуНаСлежение(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСлежения = Новый Структура;
	ПараметрыСлежения.Вставить("ВариантСлежения", 	ВариантСлежения);
	ПараметрыСлежения.Вставить("НачалоСлежения", 	ДатаНачала);
	ПараметрыСлежения.Вставить("ОкончаниеСлежения", ДатаОкончания);    
	
	ЭтаФорма.Закрыть(ПараметрыСлежения);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьДоступныеВариантыСлежения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВариантыСлежения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ВариантыСлежения КАК CW_ВариантыСлежения
	               |ГДЕ
	               |	CW_ВариантыСлежения.ПометкаУдаления = ЛОЖЬ";  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции