
Процедура ПередНачаломДобавленияПараметров(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр) Экспорт
	
	Ссылка = Форма.Объект.Ссылка;  
	Если Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Необходимо записать элемент!");
		Отказ = истина;
		Возврат;
	КонецЕсли; 
	
	Если Группа Тогда
		Возврат;
	КонецЕсли; 
	
	Отказ = истина;
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;  

	ПоказатьФормуВыбораПараметра(Форма, Ссылка, Родитель);

КонецПроцедуры

Процедура ПоказатьФормуВыбораПараметра(Форма, Владелец, Родитель)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", 	 Форма);
	ДополнительныеПараметры.Вставить("Владелец", Владелец);
	ДополнительныеПараметры.Вставить("Родитель", Родитель);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораМониторинговогоПараметра", ЭтотОбъект, ДополнительныеПараметры);

	СтруктураПараметровВыбора = Новый Структура;
	СтруктураПараметровВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	СтруктураПараметровВыбора.Вставить("МножественныйВыбор", Ложь);
	
	Если CW_МониторинговыеПараметрыСерверПовторноеИспользование.ЯвляетсяОбъектомПараметров(Владелец) Тогда 
		Если ТипЗнч(Форма.ДоступныеПараметры) = Тип("ФиксированнаяСтруктура") 
			И Форма.ДоступныеПараметры.Свойство("Редактирование") Тогда
			
			Отбор = Новый Структура;
			Отбор.Вставить("Ссылка", Форма.ДоступныеПараметры.Редактирование);
			
			СтруктураПараметровВыбора.Вставить("Отбор", Отбор);
		КонецЕсли; 
	КонецЕсли; 

	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора", СтруктураПараметровВыбора, Форма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры  

Процедура ПослеВыбораМониторинговогоПараметра(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Владелец", ДополнительныеПараметры.Владелец);
	ПараметрыПроцедуры.Вставить("Родитель", ДополнительныеПараметры.Родитель);

	CW_МониторинговыеПараметрыСервер.ДобавитьМониторинговыйПараметрОбъекта(РезультатВыбора, ПараметрыПроцедуры);
	
	ДополнительныеПараметры.Форма.Элементы.МониторинговыеПараметры.Обновить();
	
КонецПроцедуры  

Процедура ПереместитьЭлемент(Форма, Направление) Экспорт 
	
	Элементы = Форма.Элементы;
	
	ТекущаяСтрока = Элементы.МониторинговыеПараметры.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	CW_МониторинговыеПараметрыСервер.ВыполнитьПеремещениеЭлемента(ТекущаяСтрока, Направление);
	
	Элементы.МониторинговыеПараметры.Обновить();
	
КонецПроцедуры

Процедура СвернутьГруппыПараметров(Форма) Экспорт

	Элементы 	= Форма.Элементы; 
	Ссылка 		= Форма.Объект.Ссылка;  
	
	ГруппыПараметров = CW_МониторинговыеПараметрыСервер.ПолучитьГруппыПараметровОбъекта(Ссылка);
	Для Каждого Группа из ГруппыПараметров ЦИкл
		Элементы.МониторинговыеПараметры.Свернуть(Группа); 
	КонецЦикла;

КонецПроцедуры

Процедура РазвернутьГруппыПараметров(Форма) Экспорт

	Элементы 	= Форма.Элементы; 
	Ссылка 		= Форма.Объект.Ссылка;  
	
	ГруппыПараметров = CW_МониторинговыеПараметрыСервер.ПолучитьГруппыПараметровОбъекта(Ссылка);
	Для Каждого Группа из ГруппыПараметров ЦИкл
		Элементы.МониторинговыеПараметры.Развернуть(Группа); 
	КонецЦикла;
	
КонецПроцедуры

Процедура ВосстановитьСостояниеГрупп(Форма) Экспорт
	
	Элементы 	= Форма.Элементы; 
	Ссылка 		= Форма.Объект.Ссылка;  
	
	НастройкиГрупп = CW_МониторинговыеПараметрыСервер.ПолучитьНастройкиГруппПараметровОбъекта(Ссылка);
	Если НастройкиГрупп.Количество() > 0 Тогда
		Для Каждого КлючЗначение из НастройкиГрупп Цикл
			Если КлючЗначение.Значение Тогда
				Элементы.МониторинговыеПараметры.Свернуть(КлючЗначение.Ключ); 
			Иначе
				Элементы.МониторинговыеПараметры.Развернуть(КлючЗначение.Ключ); 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоТипу(Форма, Реквизит) Экспорт

	Элементы	= Форма.Элементы; 
	Объект 		= Форма.Объект;  
	Ссылка 		= Форма.Объект.Ссылка;  
	
	Если Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Необходимо записать элемент!");
		Возврат;
	КонецЕсли;
	
	ТипОбъекта = Объект[Реквизит.Имя];
	
	Если ТипОбъекта.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран "+ Реквизит.Синоним,, Реквизит.Имя, "Объект");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма",	 	Форма);
	ДополнительныеПараметры.Вставить("Владелец", 	Ссылка);
	ДополнительныеПараметры.Вставить("ТипОбъекта",  ТипОбъекта);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораВариантаЗаполнения", ЭтотОбъект, ДополнительныеПараметры);
	
	Если CW_МониторинговыеПараметрыСервер.ЕстьПараметрыОбъекта(Ссылка) Тогда
		ОткрытьФорму("ОбщаяФорма.CW_ВыборВаринтаЗаполненияПараметров", , Форма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, 1);	
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПослеВыбораВариантаЗаполнения(ВариантЗаполнения, ДополнительныеПараметры) Экспорт
	
	Если ВариантЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;       
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Владелец", 			ДополнительныеПараметры.Владелец);
	ПараметрыПроцедуры.Вставить("ТипОбъекта", 			ДополнительныеПараметры.ТипОбъекта);
	ПараметрыПроцедуры.Вставить("ВариантЗаполнения", 	ВариантЗаполнения);
	
	ПередНачаломЗаполненияПараметров(ПараметрыПроцедуры, ДополнительныеПараметры);
	
КонецПроцедуры  


Процедура ПередНачаломЗаполненияПараметров(ПараметрыПроцедуры, ДополнительныеПараметры)
	
	РезультатВыполнения = CW_МониторинговыеПараметрыСервер.НачатьЗаполнениеПараметровВФоне(ПараметрыПроцедуры);
	ПараметрыОжидания 	= ДлительныеОперацииКлиент.ПараметрыОжидания(ДополнительныеПараметры.Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;     
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗаполненияПараметров", ЭтотОбъект, ДополнительныеПараметры); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры  

Процедура ОбработатьРезультатЗаполненияПараметров(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    

		ДополнительныеПараметры.Форма.Элементы.МониторинговыеПараметры.Обновить();
		CW_МониторинговыеПараметрыКлиент.ВосстановитьСостояниеГрупп(ДополнительныеПараметры.Форма);
	
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
			
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка заполнения параметров");  
		
	КонецЕсли;  
	
КонецПроцедуры

Процедура ОбновитьНаименованияСвязанныхПараметров(Форма, МониторинговыйПараметр=Неопределено) Экспорт
	
	РезультатВыполнения = CW_МониторинговыеПараметрыСервер.НачатьПереименованиеСвязанныхПараметровВФоне(МониторинговыйПараметр);
	
	ПараметрыОжидания 	= ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = (МониторинговыйПараметр = Неопределено);     
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатОбновленияНаименовнийПараметров", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры   

Процедура ОбработатьРезультатОбновленияНаименовнийПараметров(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_МониторинговыеПараметрыОбъектов"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_МониторинговыеПараметрыТиповОбъектов"));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка обновления наименований параметров");  
		
	КонецЕсли;  
	
КонецПроцедуры
