&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовокФормыНаСервере();
	
	Параметры.Свойство("ОбъектОтбора", ЗаказЗаявка);    
	
	ИспользуютсяПараметрыВЗаказах = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяПараметрыВЗаказах");
	
	ТекстНезаполненногоЗаголовкаПарамтера   = "Выбрать параметр";
	ТекстНезаполненногоЗаголовкаДействия 	= "Выбрать действие";
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	МакетЗаголовка = ТОбъект.ПолучитьМакет("МакетЗаголовка");   
	ОбластьЗаголовок = МакетЗаголовка.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ИмяРеквизита 	= ТекстНезаполненногоЗаголовкаПарамтера;
	ОбластьЗаголовок.Параметры.Действие 		= ТекстНезаполненногоЗаголовкаДействия;
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок); 
	
	Элементы.ЗаказЗаявка.Видимость = ЗначениеЗаполнено(ЗаказЗаявка);
	Элементы.ЗаказЗаявка1.Видимость = ЗначениеЗаполнено(ЗаказЗаявка); 
	
	Элементы.КоманднаяПанельОбъектыЗаписи_1.Видимость = Не ЗначениеЗаполнено(ЗаказЗаявка);	
	Элементы.КоманднаяПанельОбъектыЗаписи_2.Видимость = ЗначениеЗаполнено(ЗаказЗаявка);
	
	ЗашоловокЗаказЗаявка = "";
	Если ТипЗнч(ЗаказЗаявка) = Тип("СправочникСсылка.CW_Заказы") Тогда
		ЗашоловокЗаказЗаявка = "Заказ";
	КонецЕсли;
	Если ТипЗнч(ЗаказЗаявка) = Тип("СправочникСсылка.CW_Заявки") Тогда
		ЗашоловокЗаказЗаявка = "Заявка";
	КонецЕсли;	
	Элементы.ЗаказЗаявка.Заголовок  = ЗашоловокЗаказЗаявка;
	Элементы.ЗаказЗаявка1.Заголовок = ЗашоловокЗаказЗаявка;
	
	РежимПоказать = "Все";  
	
	Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаНачало;  
	
	ПоказатьСкрытьНазначениеПараметров = Ложь;
	ПоказатьСкрытьНазначениеПараметровНаСервере();

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбработатьШагНаКлиенте("Шаг1");
	
КонецПроцедуры  


&НаСервере
Процедура УстановитьЗаголовокФормыНаСервере(Знач ИмяВыбраннойНастройки="")
	
	Если ПустаяСтрока(ИмяВыбраннойНастройки) Тогда
		ИмяНастройки = "";
	Иначе
		ИмяНастройки = "(" + ИмяВыбраннойНастройки + ")";
	КонецЕсли;
	
	ЭтаФорма.Заголовок = СокрЛП("Загрузка параметров грузоперевозок из файла "+ИмяНастройки);

КонецПроцедуры


//Шаги
&НаКлиенте
Процедура КомандаДалее(Команда)  
	
	ОбработатьШагНаКлиенте("Шаг2"); 
	
	ВключитьОтбор = (РежимПоказать = "НеПодобранные");
	УстановитьОтборСтрок(ВключитьОтбор);
	
КонецПроцедуры   

&НаКлиенте
Процедура КомандаДалееШаг3(Команда)
	
	ОбработатьШагНаКлиенте("Шаг3"); 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда) 
	
	ОбработатьШагНаКлиенте("Шаг1");   
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШагНаКлиенте(ИмяШага) 
	
	Если ИмяШага = "Шаг1" Тогда
		Если ТаблицаСоответствий.Количество() > 0 Тогда
			ПометитьСтрокиТабличногоДокумента();
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяШага = "Шаг2" Тогда 
		ОтметкиЗаполнены = ПроверитьУстановленныеОтметкиНазначенияПараметров();
		Если Не ОтметкиЗаполнены Тогда
			ПоказатьПредупреждение(, "Параметры должны быть записаны хотя бы в один объект!"); 
			ИмяШага = "Шаг1";
			Возврат;
		КонецЕсли;  
		
		ТекстОшибки = ЗаполнитьТаблицуСоответствий();    
		Если Не ПустаяСтрока(ТекстОшибки) Тогда
			ПоказатьПредупреждение(, ТекстОшибки); 
			ИмяШага = "Шаг1"	
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяШага = "Шаг3" Тогда 
		
		УстановитьКартинкуОжиданияПоСтрокам(); 
		
		ПодключитьОбработчикОжидания("ВыполнитьЗагрузкуПараметров",0.1, Истина);
		
	КонецЕсли;  
	
	УстановитьТекущуюСтраницуДляШагаНаСервере(ИмяШага); 
	
	Элементы.КомандаДалееШаг3.Доступность 	= (ИмяШага <> "Шаг4"); 
	
КонецПроцедуры

&НаСервере
Функция УстановитьТекущуюСтраницуДляШагаНаСервере(ИмяШага)
	
	СоответствиеСтраницШагам = ПолучитьСоответствиеСтраницШагам();
	
	Страница = СоответствиеСтраницШагам.Получить(ИмяШага);
	Если Страница = Неопределено Тогда
		ВызватьИсключение "Ошибка!";
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Страница;
	
КонецФункции 

&НаСервере
Функция ПолучитьСоответствиеСтраницШагам() 
	
	Соответствие = новый Соответствие;
	Соответствие.Вставить("Шаг1", Элементы.СтраницаШаг1);
	Соответствие.Вставить("Шаг2", Элементы.СтраницаШаг2); 
	Соответствие.Вставить("Шаг3", Элементы.СтраницаШаг2); 
	Соответствие.Вставить("Шаг4", Элементы.СтраницаШаг2); 
	
	Возврат Соответствие;
	
	
КонецФункции
//Шаги

//Работа с макетом
&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Область.Верх = 1 И Область.Лево <= ТабличныйДокумент.ШиринаТаблицы Тогда
		
		Если ТипЗнч(Область.Расшифровка) = Тип("Структура") Тогда
			Возврат;
		КонецЕсли;    
		
		ОбластьДействие = ТабличныйДокумент.Область(2, Область.Лево, 2, Область.Лево);
		
		ДополнительныеПараметры = Новый Структура("ТекущаяОбласть,ОбластьДействие", Область, ОбластьДействие);
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить("Реквизит",	"Реквизит грузоперевозки",,БиблиотекаКартинок.Реквизит);
		СписокВыбора.Добавить("Параметр",	"Параметр грузоперевозки",,БиблиотекаКартинок.CW_ПараметрыГрузоперевозок);
		
		Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборТипаДанных", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элемент); 
		
	КонецЕсли;  
	
	Если Область.Верх = 2 И Область.Лево <= ТабличныйДокумент.ШиринаТаблицы Тогда
		
		ОбластьПараметра = ТабличныйДокумент.Область(1, Область.Лево, 1, Область.Лево);
		Если ОбластьПараметра.Расшифровка = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить("ПоискПоЗначению",	"Поиск по значению", ,БиблиотекаКартинок.Найти);
		
		Если ОбластьПараметра.Расшифровка.Свойство("Реквизит") Тогда   
			Если ОбластьПараметра.Расшифровка["Идентификатор"] <> "Наименование" 
				и ОбластьПараметра.Расшифровка["Идентификатор"] <> "Код" Тогда
				СписокВыбора.Добавить("ОбновитьЗначение",	"Обновить реквизит", ,БиблиотекаКартинок.Изменить);
			КонецЕсли;
		КонецЕсли;  
		
		Если ОбластьПараметра.Расшифровка.Свойство("Параметр") Тогда
			СписокВыбора.Добавить("ОбновитьЗначение",	"Обновить параметр", ,БиблиотекаКартинок.Изменить);
			СписокВыбора.Добавить("ДобавитьЗначение",	"Добавить параметр", ,БиблиотекаКартинок.СоздатьЭлементСписка);
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура("ТекущаяОбласть", Область);
		
		Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборДействия", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВыборИзМеню(Оповещение,СписокВыбора, Элемент); 
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;    
	Если Элемент.ТекущаяОбласть.Верх > 1 Тогда   
		Возврат;
	КонецЕсли;   
	
	ОбластьДействие = ТабличныйДокумент.Область(2, Элемент.ТекущаяОбласть.Лево, 2, Элемент.ТекущаяОбласть.Лево);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяОбласть", 	Элемент.ТекущаяОбласть); 
	ДополнительныеПараметры.Вставить("ОбластьДействие", ОбластьДействие); 
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Реквизит",	"Реквизит грузоперевозки",,БиблиотекаКартинок.Реквизит);
	СписокВыбора.Добавить("Параметр",	"Параметр грузоперевозки",,БиблиотекаКартинок.CW_ПараметрыГрузоперевозок);
	
	Если Расшифровка.Свойство("Параметр") Тогда
		Если ЭтоКонтрольнаяДата(Расшифровка["Параметр"]["Ссылка"]) Тогда
			СинонимПоля = Расшифровка["Параметр"]["ЗначениеПоля"]["СинонимПоля"];
			ПредставлениеКоманды = "Значение контрольной даты - " + СинонимПоля; 
			
			СписокВыбора.Добавить("ЗначенияПараметра", ПредставлениеКоманды, ,БиблиотекаКартинок.CW_КонтрольныеДаты);	
		КонецЕсли;  
		
		Если ЗначениеПараметраСсылка(Расшифровка["Параметр"]["Ссылка"]) Тогда  
			СинонимПоля = Расшифровка["Параметр"]["ПолеПоиска"]["СинонимПоля"];
			ПредставлениеКоманды = "Реквизит поиска - " + СинонимПоля; 
			
			СписокВыбора.Добавить("ВыборПоляПоискаПараметр",	ПредставлениеКоманды, ,БиблиотекаКартинок.Найти); 
		КонецЕсли;
	КонецЕсли;
	
	Если Расшифровка.Свойство("Реквизит") Тогда     
		
		Если ЭтоСсылка(Расшифровка["Реквизит"]["ИмяРеквизита"]) Тогда 
			СинонимПоля = Расшифровка["Реквизит"]["ПолеПоиска"]["СинонимПоля"];
			ПредставлениеКоманды = "Реквизит поиска - " + СинонимПоля; 
			
			СписокВыбора.Добавить("ВыборПоляПоискаРеквизит",	ПредставлениеКоманды, ,БиблиотекаКартинок.Найти); 
		КонецЕсли;
	КонецЕсли;  
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборТипаДанных", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборТипаДанных(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Если ДополнительныеПараметры.Свойство("ОбластьДействие") Тогда
		ДополнительныеПараметры.ОбластьДействие.Расшифровка 		= Неопределено;
		ДополнительныеПараметры.ОбластьДействие.ПараметрРасшифровки	= ""; 
		ДополнительныеПараметры.ОбластьДействие.Текст 				= "Выбрать действие";  
		ДополнительныеПараметры.ОбластьДействие.ЦветТекста			= ОбщегоНазначенияКлиентПовтИсп.ЦветСтиля("НезаполненныйРеквизит")
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ТабличныйДокументВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если РезультатВыбора.Значение = "Параметр" Тогда
		ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",, ЭтотОбъект,,,, ОписаниеОповещения);
	КонецЕсли; 
	
	Если РезультатВыбора.Значение = "Реквизит" Тогда 
		СписокРеквизитов = ПолучитьСписокДоступныхРеквизитовГрузоперевозки(); 
		СписокРеквизитов.ПоказатьВыборЭлемента(ОписаниеОповещения, "Реквизиты");
	КонецЕсли;    
	
	Если РезультатВыбора.Значение = "ЗначенияПараметра" Тогда 
		
		Расшифровка = ДополнительныеПараметры.ТекущаяОбласть.Расшифровка;
		
		СписокЗначенийПараметра = Новый СписокЗначений;
		СписокЗначенийПараметра.Добавить("ЗначениеПлан",	"План"		, ,	БиблиотекаКартинок.CW_КонтрольныеДаты);
		СписокЗначенийПараметра.Добавить("ЗначениеФакт",	"Факт"		, ,	БиблиотекаКартинок.CW_КалендарьТекущаяДата);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборЗначенияПарамета", ЭтотОбъект, ДополнительныеПараметры);
		
		ТекущееЗначение 	= Расшифровка["Параметр"]["ЗначениеПоля"]["ИмяПоля"];
		НачальаноеЗначение 	= СписокЗначенийПараметра.НайтиПоЗначению(ТекущееЗначение);
		
		СписокЗначенийПараметра.ПоказатьВыборЭлемента(ОписаниеОповещения,,НачальаноеЗначение);
		
	КонецЕсли;    
	
	Если РезультатВыбора.Значение = "ВыборПоляПоискаРеквизит" Тогда 
		
		Расшифровка 		= ДополнительныеПараметры.ТекущаяОбласть.Расшифровка;
		
		СписокРеквизитов 	= ПолучитьСписокРеквизитовДоступныхДляПоиска(Расшифровка.Идентификатор);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборПоляПоискаРеквизита", ЭтотОбъект, ДополнительныеПараметры);
		
		ТекущееЗначение 	= Расшифровка["Реквизит"]["ПолеПоиска"]["ИмяПоля"];
		НачальаноеЗначение 	= СписокРеквизитов.НайтиПоЗначению(ТекущееЗначение);
		
		СписокРеквизитов.ПоказатьВыборЭлемента(ОписаниеОповещения,,НачальаноеЗначение); 
		
	КонецЕсли;  
	
	
	Если РезультатВыбора.Значение = "ВыборПоляПоискаПараметр" Тогда 
		
		Расшифровка 		= ДополнительныеПараметры.ТекущаяОбласть.Расшифровка;
		
		СписокРеквизитов 	= ПолучитьСписокРеквизитовПараметраДоступныхДляПоиска(Расшифровка.Идентификатор);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборПоляПоискаПараметра", ЭтотОбъект, ДополнительныеПараметры);
		
		ТекущееЗначение 	= Расшифровка["Параметр"]["ПолеПоиска"]["ИмяПоля"];
		НачальаноеЗначение 	= СписокРеквизитов.НайтиПоЗначению(ТекущееЗначение);
		
		СписокРеквизитов.ПоказатьВыборЭлемента(ОписаниеОповещения,,НачальаноеЗначение); 
		
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборДействия(РезультатВыбора, ДополнительныеПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ТабличныйДокументВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	СтруктураДействия = Новый Структура;
	СтруктураДействия.Вставить("Значение", 		РезультатВыбора.Значение); 
	СтруктураДействия.Вставить("Представление", РезультатВыбора.Представление); 
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, СтруктураДействия);
	
КонецПроцедуры


&НаКлиенте
Процедура ТабличныйДокументВыборЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	Если ТипЗнч(РезультатВыбора) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
		СтруктураРасшифровки = Новый Структура;
		ЗаполнитьДанныеПараметра(РезультатВыбора, СтруктураРасшифровки);  
	КонецЕсли; 
	
	Если ТипЗнч(РезультатВыбора) = Тип("ЭлементСпискаЗначений") Тогда  
		
		ПолеПоиска = Новый Структура("ИмяПоля,СинонимПоля", "",""); 
		
		Если ЭтоСсылка(РезультатВыбора.Значение) Тогда
			ПолеПоиска.ИмяПоля 		=	"Наименование";
			ПолеПоиска.СинонимПоля	=	"Наименование"; 
		КонецЕсли;    
		
		ПредставлениеЯчейки = СокрЛП(РезультатВыбора.Представление); 
		
		ДанныеРасшифровки = Новый Структура;
		ДанныеРасшифровки.Вставить("ИмяРеквизита",	СокрЛП(РезультатВыбора.Значение));
		ДанныеРасшифровки.Вставить("СинонимПоля", 	СокрЛП(РезультатВыбора.Представление));
		ДанныеРасшифровки.Вставить("ПолеПоиска", 	ПолеПоиска);
		
		СтруктураРасшифровки = Новый Структура;
		СтруктураРасшифровки.Вставить("ПредставлениеЯчейки",	ПредставлениеЯчейки);
		СтруктураРасшифровки.Вставить("Идентификатор", 			СокрЛП(РезультатВыбора.Значение));
		СтруктураРасшифровки.Вставить("Реквизит", 				ДанныеРасшифровки);
		СтруктураРасшифровки.Вставить("ТипЗначения", 			Новый ОписаниеТипов("Строка"));
		
	КонецЕсли;  
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		СтруктураРасшифровки = Новый Структура;
		СтруктураРасшифровки.Вставить("ПредставлениеЯчейки",	РезультатВыбора.Представление);
		СтруктураРасшифровки.Вставить("Идентификатор", 			СокрЛП(РезультатВыбора.Значение));
	КонецЕсли;
	
	Если СтруктураРасшифровки = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	УстановитьОформлениеОбласти(СтруктураРасшифровки, ДополнительныеПараметры);
	
	ТабличныйДокументВыборЗавершениеНаСервере(); 
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВыборЗначенияПарамета(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	Расшифровка = ДополнительныеПараметры.ТекущаяОбласть.Расшифровка; 
	Расшифровка.ПредставлениеЯчейки	= СокрЛП(Расшифровка["Параметр"]["СинонимПоля"])+" ("+СокрЛП(РезультатВыбора.Представление)+")";
	
	Расшифровка["Параметр"]["ЗначениеПоля"].ИмяПоля		= СокрЛП(РезультатВыбора.Значение);
	Расшифровка["Параметр"]["ЗначениеПоля"].СинонимПоля	= СокрЛП(РезультатВыбора.Представление);
	
	УстановитьОформлениеОбласти(Расшифровка, ДополнительныеПараметры);
	
	ТабличныйДокументВыборЗавершениеНаСервере();  
	
КонецПроцедуры       

&НаКлиенте
Процедура ЗавершитьВыборПоляПоискаРеквизита(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Расшифровка = ДополнительныеПараметры.ТекущаяОбласть.Расшифровка; 
	Расшифровка.ПредставлениеЯчейки	= СокрЛП(Расшифровка["Реквизит"]["СинонимПоля"])+" ("+СокрЛП(РезультатВыбора.Представление)+")";
	
	Расшифровка["Реквизит"]["ПолеПоиска"].ИмяПоля		= СокрЛП(РезультатВыбора.Значение);
	Расшифровка["Реквизит"]["ПолеПоиска"].СинонимПоля	= СокрЛП(РезультатВыбора.Представление);
	
	УстановитьОформлениеОбласти(Расшифровка, ДополнительныеПараметры);
	
	ТабличныйДокументВыборЗавершениеНаСервере();  
	
КонецПроцедуры   

&НаКлиенте
Процедура ЗавершитьВыборПоляПоискаПараметра(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Расшифровка = ДополнительныеПараметры.ТекущаяОбласть.Расшифровка; 
	Расшифровка.ПредставлениеЯчейки	= СокрЛП(Расшифровка["Параметр"]["СинонимПоля"])+" ("+СокрЛП(РезультатВыбора.Представление)+")";
	
	Расшифровка["Параметр"]["ПолеПоиска"].ИмяПоля		= СокрЛП(РезультатВыбора.Значение);
	Расшифровка["Параметр"]["ПолеПоиска"].СинонимПоля	= СокрЛП(РезультатВыбора.Представление);
	
	УстановитьОформлениеОбласти(Расшифровка, ДополнительныеПараметры);
	
	ТабличныйДокументВыборЗавершениеНаСервере();  
	
КонецПроцедуры  



&НаСервере
Процедура ТабличныйДокументВыборЗавершениеНаСервере()
	
	Обработки.CW_ЗагрузкаПараметровГрузоперевозокИзФайла.РассчитатьШиринуКолонокТабличногоДокумента(ТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеОбласти(Знач Расшифровка, Знач ДополнительныеПараметры)
	
	ТекстНезаполненногоЗаголовка = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.ТекстЗаголовкаНесопоставленнойКолонки();
	Для НомерКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		Область = ТабличныйДокумент.Область(1, НомерКолонки);
		Если Область.ПараметрРасшифровки 	= Расшифровка.Идентификатор Тогда
			Область.Текст 					= ТекстНезаполненногоЗаголовка;
			Область.ПараметрРасшифровки 	= "";
			Область.Расшифровка 			= Неопределено;
			Область.ЦветТекста 				= ОбщегоНазначенияКлиентПовтИсп.ЦветСтиля("НезаполненныйРеквизит");
		КонецЕсли;  
	КонецЦикла; 
	
	ДополнительныеПараметры.ТекущаяОбласть.Текст      			= Расшифровка.ПредставлениеЯчейки;
	ДополнительныеПараметры.ТекущаяОбласть.ЦветТекста 			= ОбщегоНазначенияКлиентПовтИсп.ЦветСтиля("ЦветГиперссылки");
	ДополнительныеПараметры.ТекущаяОбласть.ПараметрРасшифровки 	= Расшифровка.Идентификатор;
	ДополнительныеПараметры.ТекущаяОбласть.Расшифровка 			= Расшифровка;
	
	МассивДействий 	= ПолучитьМассивДействийДляУстановкиНазначенияПараметра();
	
	Если ТипЗнч(ДополнительныеПараметры.ТекущаяОбласть.Расшифровка) = Тип("Структура")
		И МассивДействий.Найти(ДополнительныеПараметры.ТекущаяОбласть.ПараметрРасшифровки) <> Неопределено Тогда    
		
		ОбластьДанных = ТабличныйДокумент.Область(1, ДополнительныеПараметры.ТекущаяОбласть.Лево);
		Если ОбластьДанных.Расшифровка.Свойство("Параметр") Тогда
			ДобавитьСтрокуНазначенияПараметра(ОбластьДанных.Расшифровка.Параметр.Ссылка);  
		ИначеЕсли ОбластьДанных.Расшифровка.Свойство("Реквизит") Тогда
			ДобавитьСтрокуНазначенияПараметра(ОбластьДанных.Расшифровка.Реквизит.ИмяРеквизита);  
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьНазначенияПараметровНаСервере();
	
КонецПроцедуры  

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	Верх = ТабличныйДокумент.ТекущаяОбласть.Верх;
	Низ  = ТабличныйДокумент.ТекущаяОбласть.Низ;
	Лево = ТабличныйДокумент.ТекущаяОбласть.Лево;
	
	Если (Верх = 1 или Верх = 2) И (Низ = 1 или Низ = 2) Тогда
		Возврат; // выделена первая строка (строка заголовка)
	КонецЕсли;
	
	УдалитьСтрокиНаСервере(Верх, Низ);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево);
	
КонецПроцедуры  

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	Верх = ТабличныйДокумент.ТекущаяОбласть.Верх;
	Низ  = ТабличныйДокумент.ТекущаяОбласть.Низ;
	Лево = ТабличныйДокумент.ТекущаяОбласть.Лево;
	
	Если (Верх = 1 или Верх = 2) И (Низ = 1 или Низ = 2) Тогда
		Возврат; // выделена первая строка (строка заголовка)
	КонецЕсли;
	
	ДобавитьСтрокиНаСервере(Верх, Низ);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево); 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКолонку(Команда)
	
	Если ТабличныйДокумент.ШиринаТаблицы = 1 Тогда
		Возврат; // выделена первая строка (строка заголовка)
	КонецЕсли;
	
	Лево  = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Право = ТабличныйДокумент.ТекущаяОбласть.Право;
	Верх  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	
	УдалитьКолонкиНаСервере(Лево, Право);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево);
	
КонецПроцедуры  

&НаСервере
Процедура УдалитьСтрокиНаСервере(Верх, Низ)
	
	Если Верх = 1 Тогда
		Верх = 2; // чтобы не удалить заголовки колонок
	КонецЕсли;
	
	Область = ТабличныйДокумент.Область(Верх,, Низ);
	ТабличныйДокумент.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоВертикали);
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьСтрокиНаСервере(Верх, Низ)

	Область = ТабличныйДокумент.Область(Верх,, Низ);
	ТабличныйДокумент.ВставитьОбласть(Область, Область, ТипСмещенияТабличногоДокумента.ПоВертикали);  
	
	ВыделеноСтрок = (Низ - Верх) + 1;
	
	НоваяОбласть = ТабличныйДокумент.Область(Низ+1,, Низ+ВыделеноСтрок);
	НоваяОбласть.Очистить(Истина,Ложь,Ложь);
	
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьКолонку(Команда)
	Лево  = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Право = ТабличныйДокумент.ТекущаяОбласть.Право;
	Верх  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	
	ДобавитьКолонкиНаСервере(Лево, Право);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(Верх, Лево);
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонкиНаСервере(Лево, Право)
 
	Область = ТабличныйДокумент.Область(, Лево,, Право);
	ТабличныйДокумент.ВставитьОбласть(Область, Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
	ВыделеноКолонок = (Право - Лево) + 1; 
	ЛевоНовая 		= Лево+1;
	ПравоНовая		= Лево+ВыделеноКолонок;
	
	НоваяОбласть = ТабличныйДокумент.Область(3,ЛевоНовая, ТабличныйДокумент.ВысотаТаблицы, ПравоНовая);
	НоваяОбласть.Очистить(Истина,Ложь,Ложь);

	ТекстНезаполненногоЗаголовкаПарамтера   = "Выбрать параметр";
	ТекстНезаполненногоЗаголовкаДействия 	= "Выбрать действие";
	
	Для Колонка = ЛевоНовая По ПравоНовая Цикл
		Область = ТабличныйДокумент.Область(1, Колонка, 1, Колонка);    
		Область.Текст 				= ТекстНезаполненногоЗаголовкаПарамтера;
		Область.ПараметрРасшифровки = "";
		Область.ЦветТекста 			= ЦветаСтиля.НезаполненныйРеквизит;  
		
		Область = ТабличныйДокумент.Область(2, Колонка, 2, Колонка);    
		Область.Текст 				= ТекстНезаполненногоЗаголовкаДействия;
		Область.ПараметрРасшифровки = "";
		Область.ЦветТекста 			= ЦветаСтиля.НезаполненныйРеквизит;
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура УдалитьКолонкиНаСервере(Лево, Право)
	
	Область = ТабличныйДокумент.Область(, Лево,, Право);
	ТабличныйДокумент.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
	ОбновитьНазначенияПараметровНаСервере();
	
КонецПроцедуры   

&НаКлиенте
Процедура УстановитьГраницы(Команда)
	
	Лево  = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Право = ТабличныйДокумент.ТекущаяОбласть.Право;
	Верх  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	Низ  = ТабличныйДокумент.ТекущаяОбласть.Низ;
	
	УстановитьГраницыНаСервере(Право, Лево, Верх, Низ);
	
КонецПроцедуры  

&НаКлиенте
Процедура СнятьЗащитуЯчеек(Команда)
	
	Лево  = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Право = ТабличныйДокумент.ТекущаяОбласть.Право;
	Верх  = ТабличныйДокумент.ТекущаяОбласть.Верх;
	Низ  = ТабличныйДокумент.ТекущаяОбласть.Низ;
	
	СнятьЗащитуЯчеекНаСервере(Право, Лево, Верх, Низ);  
	УстановитьГраницыНаСервере(Право, Лево, Верх, Низ);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьГраницыНаСервере(Право, Лево, Верх, Низ)
	
	Линия	 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	
	Для НомерСтроки = Верх По Низ Цикл
		Для НомерКолонки = Лево По Право Цикл
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Ячейка.Обвести(Линия, Линия, Линия, Линия);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура СнятьЗащитуЯчеекНаСервере(Право, Лево, Верх, Низ) 
	
	Для НомерСтроки = Верх По Низ Цикл
		Если НомерСтроки < 3 Тогда
			Продолжить;
		КонецЕсли; 
		
		Для НомерКолонки = Лево По Право Цикл
			Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Ячейка.Защита 	= Ложь;
			Ячейка.ЦветФона = ЦветаСтиля.ПравоРедактированияФон
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьСтрокиТабличногоДокумента()
	
	Для Каждого СтрокаТаблицы из ТаблицаСоответствий Цикл 
		Если СтрокаТаблицы.ФлагПодобрано Тогда
			Продолжить;
		КонецЕсли;
		Область = ТабличныйДокумент.Область(СтрокаТаблицы.СтрокаМакета, , СтрокаТаблицы.СтрокаМакета);
		Область.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;	
	КонецЦикла;
	
КонецПроцедуры
//Работа с макетом

//Работа с настройрками
&НаКлиенте
Процедура СохранитьНастройку(Команда)  
	
	СоответствиеНастроек = ПолучитьНастроенныйЗаголовокНаСервере();
	
	ПараметрыФормыВариантов = новый Структура;
	ПараметрыФормыВариантов.Вставить("РежимФормы", 				0);
	ПараметрыФормыВариантов.Вставить("Настройки", 				СоответствиеНастроек);
	
	ОткрытьФорму("Обработка.CW_ЗагрузкаПараметровГрузоперевозокИзФайла.Форма.ФормаВариантовНастроек", ПараметрыФормыВариантов,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастроенныйЗаголовокНаСервере()
	
	СоответствиеНастроек = новый Соответствие;
	
	Для Лево = 1 по ТабличныйДокумент.ШиринаТаблицы Цикл
		
		Область 		= ТабличныйДокумент.Область(1, Лево);
		ОбластьДействия = ТабличныйДокумент.Область(2, Лево);
		
		СтруктураНастроек = Новый Структура;
		
		ДанныеЯчейки = Новый Структура;
		ДанныеЯчейки.Вставить("Текст", 					Область.Текст);
		ДанныеЯчейки.Вставить("ПараметрРасшифровки", 	Область.ПараметрРасшифровки); 
		ДанныеЯчейки.Вставить("Расшифровка", 			Область.Расшифровка); 
		ДанныеЯчейки.Вставить("ЦветТекста", 			Область.ЦветТекста); 
		
		СтруктураНастроек.Вставить("Заголовок", ДанныеЯчейки);
		
		ДанныеЯчейки = Новый Структура;
		ДанныеЯчейки.Вставить("Текст", 					ОбластьДействия.Текст);
		ДанныеЯчейки.Вставить("ПараметрРасшифровки", 	ОбластьДействия.ПараметрРасшифровки); 
		ДанныеЯчейки.Вставить("Расшифровка", 			ОбластьДействия.Расшифровка); 
		ДанныеЯчейки.Вставить("ЦветТекста", 			ОбластьДействия.ЦветТекста); 
		
		СтруктураНастроек.Вставить("Действия", ДанныеЯчейки);
		
		СоответствиеНастроек.Вставить(Лево, СтруктураНастроек);
	КонецЦикла;  
	
	Соответствие = ПолучитьСоответствиеПоТаблицеНазначений();
	СоответствиеНастроек.Вставить("НазначенияПараметров", Соответствие);
	
	Возврат СоответствиеНастроек;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьНастройку(Команда)       
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыборНастроек", ЭтотОбъект);
	
	ПараметрыФормыВариантов = новый Структура;
	ПараметрыФормыВариантов.Вставить("РежимФормы", 1);
	
	ОткрытьФорму("Обработка.CW_ЗагрузкаПараметровГрузоперевозокИзФайла.Форма.ФормаВариантовНастроек", ПараметрыФормыВариантов,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&наКлиенте
Процедура ЗавершитьВыборНастроек(ВыбраннаяНастройка, ДополнительныеПараметры) Экспорт   
	
	Если ВыбраннаяНастройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьВыборНастроекНаСервере(ВыбраннаяНастройка);	
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьВыборНастроекНаСервере(ВыбраннаяНастройка)    
	
	УстановитьЗаголовокФормыНаСервере(ВыбраннаяНастройка["ИмяНастройки"]);
	
	СоответствиеНастроек = ВыбраннаяНастройка["Настройка"];
	Если ТипЗнч(СоответствиеНастроек) <> тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;  
	
	СоответствиеНазначения = СоответствиеНастроек.Получить("НазначенияПараметров");
	Для Каждого КлючЗначение из СоответствиеНазначения Цикл 
		НоваяСтрока = НазначенияПараметров.Добавить();
		НоваяСтрока.Параметр 		= КлючЗначение.Ключ;  
		НоваяСтрока.ИндексКартинки 	= ПолучитьИндексКартинкиПараметра(КлючЗначение.Ключ);
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, КлючЗначение.Значение);
	КонецЦикла;
	
	МассивДействийНазначений = ПолучитьМассивДействийДляУстановкиНазначенияПараметра();
	
	Для Лево = 1 по ТабличныйДокумент.ШиринаТаблицы Цикл   
		
		СтруктураНастроек = СоответствиеНастроек.Получить(Лево);
		Если СтруктураНастроек = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеЗаголовка = СтруктураНастроек.Заголовок;
		
		Область	 = ТабличныйДокумент.Область(1, Лево);
		Область.Текст 				= ДанныеЗаголовка.Текст;
		Область.ПараметрРасшифровки = ДанныеЗаголовка.ПараметрРасшифровки;
		Область.Расшифровка 		= ДанныеЗаголовка.Расшифровка;
		Область.ЦветТекста 			= ДанныеЗаголовка.ЦветТекста;  
		
		ДанныеДействия   = СтруктураНастроек.Действия; 
		
		ОбластьДействия = ТабличныйДокумент.Область(2, Лево);
		ОбластьДействия.Текст 				= ДанныеДействия.Текст;
		ОбластьДействия.ПараметрРасшифровки = ДанныеДействия.ПараметрРасшифровки;
		ОбластьДействия.Расшифровка 		= ДанныеДействия.Расшифровка;
		ОбластьДействия.ЦветТекста 			= ДанныеДействия.ЦветТекста;  
		
	КонецЦикла; 
	
	Обработки.CW_ЗагрузкаПараметровГрузоперевозокИзФайла.РассчитатьШиринуКолонокТабличногоДокумента(ТабличныйДокумент);
	
КонецПроцедуры
//Работа с настройрками

//Чтиение файла
&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьПомещениеФайлаНаНаСервер", ЭтотОбъект);
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файл";
	ПараметрыДиалога.Фильтр    = "Файл Excel|*.xls;*.xlsx";
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения, , ,, ПараметрыДиалога, Новый УникальныйИдентификатор);
	
КонецПроцедуры           

&НаКлиенте
Процедура ЗавершитьПомещениеФайлаНаНаСервер(ОписаниеПомещенногоФайла,ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено 
		Или ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	Конецесли;    
	
	Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаОжидание;
	
	РезультатВыполнения =  ОбработатьЗагрузкуФайлаНаСервереВФоне(ОписаниеПомещенногоФайла.Адрес, ОписаниеПомещенногоФайла.СсылкаНаФайл.Расширение);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗагрузкиФайла", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьЗагрузкуФайлаНаСервереВФоне(Адрес, РасширениеФайла)  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Чтение файла Excel в табличный документ";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ДвоичныеДанные 			= ПолучитьИзВременногоХранилища(Адрес);
	ХранилищеДанныхФайла 	= Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("ХранилищеДанныхФайла", 	ХранилищеДанныхФайла);
	ПараметрыЗагрузки.Вставить("РасширениеФайла", 		РасширениеФайла);
	ПараметрыЗагрузки.Вставить("ИмяМакетаЗаголовка", 	"МакетЗаголовка");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ЗагрузкаПараметровГрузоперевозокИзФайла.ЗагрузитьФайлВТабличныйДокумент", ПараметрыЗагрузки, ПараметрыВыполнения);
	
КонецФункции  

&НаКлиенте
Процедура ОбработатьРезультатЗагрузкиФайла(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ТабличныйДокумент = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаРезультат; 
		
		НазначенияПараметров.Очистить();
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		Элементы.СтраницыШаг1.ТекущаяСтраница = Элементы.СтраницаНачало;
		
		ТекстПредупреждения = "Не удалось прочитать файл!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка чтения файла");
	КонецЕсли;
	
КонецПроцедуры
//Чтиение файла 

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеПараметра(Параметр, СтруктураРасшифровки) 
	
	ПолеПоиска = Новый Структура("ИмяПоля,СинонимПоля", "",""); 
	
	ПустаяСсылка = Параметр.ТипЗначения.ПривестиЗначение(Неопределено);
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустаяСсылка)) Тогда
		ПолеПоиска.ИмяПоля 		= 	"Наименование";
		ПолеПоиска.СинонимПоля	=	"Наименование"; 
	КонецЕсли;    
	
	ПредставлениеЯчейки = СокрЛП(Параметр.Наименование);

	ЗначениеПараметра = Новый Структура;
	Если ЭтоКонтрольнаяДата(Параметр) тогда
		ЗначениеПараметра.Вставить("ИмяПоля", 		"ЗначениеФакт");
		ЗначениеПараметра.Вставить("СинонимПоля", 	"Факт");
		
		ПредставлениеЯчейки = ПредставлениеЯчейки + " (Факт)";
	Иначе
		ЗначениеПараметра.Вставить("ИмяПоля", 		"Значение");
		ЗначениеПараметра.Вставить("СинонимПоля", 	"Значение");
	КонецЕсли;
	
	ДанныеРасшифровки = Новый Структура;
	ДанныеРасшифровки.Вставить("Ссылка", 		Параметр);
	ДанныеРасшифровки.Вставить("СинонимПоля", 	СокрЛП(Параметр.Наименование));
	ДанныеРасшифровки.Вставить("ЗначениеПоля", 	ЗначениеПараметра);
	ДанныеРасшифровки.Вставить("ПолеПоиска", 	ПолеПоиска);
	
	СтруктураРасшифровки = Новый Структура;
	СтруктураРасшифровки.Вставить("ПредставлениеЯчейки",	ПредставлениеЯчейки);
	СтруктураРасшифровки.Вставить("Идентификатор", 			XMLСтрока(Параметр));
	СтруктураРасшифровки.Вставить("Параметр", 				ДанныеРасшифровки);
//	СтруктураРасшифровки.Вставить("ТипЗначения", 			Параметр.ТипЗначения);
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьСписокРеквизитовДоступныхДляПоиска(ИмяРеквизита)
	
	РеквизитыПоиска = новый СписокЗначений;
	
	Реквизит = Метаданные.Справочники.CW_Грузоперевозки.Реквизиты.Найти(ИмяРеквизита);
	Если Реквизит = Неопределено Тогда
		Возврат РеквизитыПоиска;
	КонецЕсли;
	
	ПустоеЗначение = Реквизит.Тип.ПривестиЗначение(Неопределено);
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) Тогда
		
		МетаданныеРеквизита = ПустоеЗначение.Метаданные();
		
		Если МетаданныеРеквизита.ДлинаКода <> 0 Тогда  
			
			Реквизит = МетаданныеРеквизита.СтандартныеРеквизиты["Код"];
			Синоним  = Реквизит.Синоним;
			Если ПустаяСтрока(Синоним) Тогда
				Синоним = "Код";  
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Синоним); 
		КонецЕсли;
		
		Если МетаданныеРеквизита.ДлинаНаименования <> 0 Тогда
			Реквизит = МетаданныеРеквизита.СтандартныеРеквизиты["Наименование"];
			Синоним  = Реквизит.Синоним;
			Если ПустаяСтрока(Синоним) Тогда
				Синоним = "Наименование";  
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Синоним); 
		КонецЕсли;
		
		Для Каждого Реквизит из МетаданныеРеквизита.Реквизиты Цикл   
			Если Реквизит.Тип = Новый ОписаниеТипов("ХранилищеЗначения") Тогда
				Продолжить;
			Конецесли; 
			Если СтрНачинаетсяС(ВРег(Реквизит.Имя), "УДАЛИТЬ") Тогда
				Продолжить;
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Реквизит.Синоним); 
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РеквизитыПоиска; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокРеквизитовПараметраДоступныхДляПоиска(ИдентифкаторПараметра)
	
	РеквизитыПоиска = новый СписокЗначений;
	
	ПараметрГрузоперевозки = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентифкаторПараметра));
	
	ПустоеЗначение = ПараметрГрузоперевозки.ТипЗначения.ПривестиЗначение(Неопределено);
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) Тогда
		
		МетаданныеРеквизита = ПустоеЗначение.Метаданные();
		
		Если МетаданныеРеквизита.ДлинаКода <> 0 Тогда  
			
			Реквизит = МетаданныеРеквизита.СтандартныеРеквизиты["Код"];
			Синоним  = Реквизит.Синоним;
			Если ПустаяСтрока(Синоним) Тогда
				Синоним = "Код";  
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Синоним); 
		КонецЕсли;
		
		Если МетаданныеРеквизита.ДлинаНаименования <> 0 Тогда
			Реквизит = МетаданныеРеквизита.СтандартныеРеквизиты["Наименование"];
			Синоним  = Реквизит.Синоним;
			Если ПустаяСтрока(Синоним) Тогда
				Синоним = "Наименование";  
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Синоним); 
		КонецЕсли;
		
		Для Каждого Реквизит из МетаданныеРеквизита.Реквизиты Цикл   
			Если Реквизит.Тип = Новый ОписаниеТипов("ХранилищеЗначения") Тогда
				Продолжить;
			Конецесли; 
			Если СтрНачинаетсяС(ВРег(Реквизит.Имя), "УДАЛИТЬ") Тогда
				Продолжить;
			КонецЕсли;
			
			РеквизитыПоиска.Добавить(Реквизит.Имя, Реквизит.Синоним); 
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РеквизитыПоиска; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокДоступныхРеквизитовГрузоперевозки()
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("Код", "Код");
	СписокЗначений.Добавить("Наименование", "Наименование");
	
	стрДоступныеРеквизиты 		= "ДатаСделкиФ,Клиент,Типоразмер,Груз,ОперативныйМенеджер,МенеджерПродаж,Маршрут";
	массивДоступнныхРеквизитов 	= СтрРазделить(стрДоступныеРеквизиты,",", Ложь);
	Реквизиты = Метаданные.Справочники.CW_Грузоперевозки.Реквизиты;
	Для Каждого ИмяРеквизита из массивДоступнныхРеквизитов Цикл
		Реквизит = Реквизиты.Найти(ИмяРеквизита);
		Если Реквизит = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СписокЗначений.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоКонтрольнаяДата(Параметр) 
	Возврат Параметр.ЭтоКонтрольнаяДата;
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоСсылка(ИмяРеквизита)
	
	Реквизит = Метаданные.Справочники.CW_Грузоперевозки.Реквизиты.Найти(ИмяРеквизита);
	Если Реквизит = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПустаяСсылка = Реквизит.Тип.ПривестиЗначение(Неопределено);
	Возврат ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустаяСсылка));
	
КонецФункции 

&НаСервереБезКонтекста
Функция ЗначениеПараметраСсылка(Параметр)
	
	ПустаяСсылка = Параметр.ТипЗначения.ПривестиЗначение(Неопределено);
	Возврат ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустаяСсылка));
	
КонецФункции


//Таблица соответстий  
&НаКлиенте
Процедура РежимПоказатьПриИзменении(Элемент)
	
	ВключитьОтбор = (РежимПоказать = "НеПодобранные");
	УстановитьОтборСтрок(ВключитьОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрок(Включен)
	
	ОтборСтрок = Неопределено;
	Если Включен Тогда
		ОтборСтрок = новый ФиксированнаяСтруктура(Новый Структура("ФлагПодобрано", Ложь));
	КонецЕсли;
	
	Элементы.ТаблицаСоответствий.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТаблицуСоответствий() 
	
	СоответствиеИменКолонок = Новый Соответствие;    
	ТаблицаЗначений 		= Новый ТаблицаЗначений;  
	ТаблицаЗначений.Колонки.Добавить("СтрокаМакета", 	Новый ОписаниеТипов("Число"));
	ТаблицаЗначений.Колонки.Добавить("Ссылка", 			Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки"));
	
	//Соответствие колонок
	ЗаполнитьОписаниеКолонок(СоответствиеИменКолонок, ТаблицаЗначений);
	//Соответствие колонок
	
	Если ОписаниеКолонок.Количество() = 0 Тогда 
		Возврат "Не установлено соответствие колонок!";
	КонецЕсли;  
	
	ПоляПоиска = ПолучитьПоляПоиска();
	Если ПоляПоиска.Количество() = 0 Тогда
		Возврат "Не указано ни одного поля для поиска грузоперевозок!";
	КонецЕсли;
	
	//Заполнение промежуточной таблицы
	ЗаполнитьТаблицуДанных(СоответствиеИменКолонок, ТаблицаЗначений);
	//Заполнение промежуточной таблицы
	
	//Реквизиты формы
	ОбработатьРеквизитыФормы(ТаблицаЗначений);
	//Реквизиты формы
	
	//Удаление элементов формы
	УдалитьНенужныеЭлементыФормы();
	//Удаление элементов формы
	
	//Добавлениеэлементов на фомру
	ДобавитьЭлементыФормы(ТаблицаЗначений);
	//Добавлениеэлементов на фомру
	
	//Поиск грузоперевозок  
	ПодобратьГрузоперевозки(ТаблицаЗначений, ПоляПоиска);
	//Поиск грузоперевозок  
	
	ТаблицаСоответствий.Загрузить(ТаблицаЗначений);
	
	УстановитьФлагПодобрано(); 
	
	Возврат ""; 
	
КонецФункции  

&НаСервере
Функция ПолучитьПоляПоиска()

	СоответствиеПоляПоиска = Новый Соответствие;
	Для Каждого КлючЗначение из ОписаниеКолонок Цикл  
		
		ОписаниеКолонки = КлючЗначение.Значение;
		
		Действие = ОписаниеКолонки["Действие"];  
		Если Действие <> "ПоискПоЗначению" Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКолонки			= ОписаниеКолонки["ИмяКолонки"]; 
		ИмяПоляКомпоновки	= ОписаниеКолонки["ИмяПоляКомпоновки"]; 
		
		Если ИмяКолонки <> "Наименование" 
			и ИмяКолонки <> "Код" Тогда 
			
			ПолеЗначения = ОписаниеКолонки["ПолеЗначения"];   
			Если ПолеЗначения <> Неопределено Тогда 
				ИмяКолонки 			= ПолеЗначения["ИмяКолонки"];	
				ИмяПоляКомпоновки	= ПолеЗначения["ИмяПоляКомпоновки"]; 
			КонецЕсли; 
			
		КонецЕсли;
		
		СоответствиеПоляПоиска.Вставить(ИмяКолонки, ИмяПоляКомпоновки);
		
	КонецЦикла; 
	
	Возврат СоответствиеПоляПоиска; 
	
КонецФункции

&НаСервере
Процедура ПодобратьГрузоперевозки(ТаблицаЗначений, ПоляПоиска)
	
	
	Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл 
		
		ОтборКомпоновкиДанных = Новый ОтборКомпоновкиДанных;
		
		Если ЗначениеЗаполнено(ЗаказЗаявка) Тогда 
			ИмяПоляКомпановки = "Заказ";
			Если ТипЗнч(ЗаказЗаявка) = Тип("СправочникСсылка.CW_Заявки") Тогда
				ИмяПоляКомпановки = "Заявка";
			КонецЕсли;
			
			ЭлементОтбора = ОтборКомпоновкиДанных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ИмяПоляКомпановки); 
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементОтбора.ПравоеЗначение 	= ЗаказЗаявка; 
			ЭлементОтбора.Использование 	= Истина; 
		КонецЕсли;    
		
		Для Каждого КлючЗначение из ПоляПоиска Цикл
			ЗначениеКолонки = СтрокаТаблицы[КлючЗначение.Ключ];
			Если Не ЗначениеЗаполнено(ЗначениеКолонки) тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементОтбора = ОтборКомпоновкиДанных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(КлючЗначение.Значение); 
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементОтбора.ПравоеЗначение 	= ЗначениеКолонки; 
			ЭлементОтбора.Использование 	= Истина; 
			
		КонецЦикла; 
		
		//Органичиваем для поиска заблокированные грзуоперевозки
		ЭлементОтбора = ОтборКомпоновкиДанных.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Заблокирована"); 
		ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.ПравоеЗначение 	= Ложь; 
		ЭлементОтбора.Использование 	= Истина; 
		//Органичиваем для поиска заблокированные грзуоперевозки 
		
		СтрокаТаблицы.Ссылка = ПолучитьГрузоперевозкуПоОтбору(ОтборКомпоновкиДанных);
		
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьГрузоперевозкуПоОтбору(ОтборКомпоновкиДанных)
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	СхемаКомпоновкиДанных = ТОбъект.ПолучитьМакет("МакетОтбораГрузоперевозок");
	
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	_УФС.СкопироватьОтбор(ОтборКомпоновкиДанных, Настройки.Отбор);
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	Результат = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Если Результат.Количество() = 0 или Результат.Количество() > 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаТаблицы = Результат[0];
	Возврат СтрокаТаблицы.Ссылка;
	
КонецФункции


&НаСервере
Процедура ДобавитьЭлементыФормы(Знач ТаблицаЗначений)
	
	ТаблицаФормы = Элементы.ТаблицаСоответствий;    
	
	СоответствиеКартинокДействию = Новый Соответствие;
	СоответствиеКартинокДействию.Вставить("ПоискПоЗначению",  БиблиотекаКартинок.Найти);	  
	СоответствиеКартинокДействию.Вставить("ОбновитьЗначение", БиблиотекаКартинок.Изменить);	  
	СоответствиеКартинокДействию.Вставить("ДобавитьЗначение", БиблиотекаКартинок.СоздатьЭлементСписка);	  
	
	Для Каждого КлючЗначение из ОписаниеКолонок Цикл
		
		ОписаниеКолнки = КлючЗначение.Значение;
		
		ДанныеГруппы  = ОписаниеКолнки["Группа"];  
		
		ГруппаТаблицы = Элементы.Найти(ДанныеГруппы["Имя"]);
		Если ГруппаТаблицы = Неопределено Тогда
			ГруппаТаблицы = ДобавитьГруппуТаблицы(ДанныеГруппы["Имя"], 
			ДанныеГруппы["Заголовок"],
			Истина, 
			Новый Картинка, 
			ТаблицаФормы);
			
			ГруппаТаблицы.РастягиватьПоГоризонтали = ложь;
			ГруппаТаблицы.РастягиватьПоВертикали   = Ложь;   
			
		КонецЕсли;	 
		
		ЕстьПолеЗначения = (ОписаниеКолнки["ПолеЗначения"] <> Неопределено);
		
		ЦветФонаЯчейки 	= ?(ЕстьПолеЗначения,Новый Цвет,ЦветаСтиля.ПравоРедактированияФон);
		ТолькоПросмотр = ЕстьПолеЗначения;
		
		КартинкаШапки = СоответствиеКартинокДействию.Получить(ОписаниеКолнки["Действие"]);
		КартинкаШапки = ?(КартинкаШапки = Неопределено, Новый Картинка, КартинкаШапки);
		
		//Добавляем элемент формы   
		Если Элементы.Найти("ТаблицаСоответствий"+ОписаниеКолнки["ИмяКолонки"]) <> Неопределено Тогда
			//Колонка с тамим именем уже есть
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить("ТаблицаСоответствий"+ОписаниеКолнки["ИмяКолонки"], Тип("ПолеФормы"), ГруппаТаблицы); 
		Если Не ЕстьПолеЗначения Тогда
			НовыйЭлемент.Заголовок = "Значение";	
		КонецЕсли;
		НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 				= "ТаблицаСоответствий." + ОписаниеКолнки["ИмяКолонки"]; 
		НовыйЭлемент.ОтображатьВШапке 		   	= Истина;
		НовыйЭлемент.ЦветФона 		   			= ЦветФонаЯчейки;
		НовыйЭлемент.КартинкаШапки  			= КартинкаШапки; 
		НовыйЭлемент.ТолькоПросмотр 			= ЕстьПолеЗначения; 
		НовыйЭлемент.РастягиватьПоГоризонтали 	= ложь;
		НовыйЭлемент.РастягиватьПоВертикали   	= Ложь;
		НовыйЭлемент.АвтоМаксимальнаяШирина		= Истина;
		
		Ширина = ПолучитьШиринуКолнки(ТаблицаЗначений, ОписаниеКолнки["ИмяКолонки"]);
		НовыйЭлемент.Ширина = Макс(Ширина, СтрДлина(ОписаниеКолнки["Заголовок"])+4);
		//Добавляем элемент формы  
		
		Если ЕстьПолеЗначения Тогда  
			
			ПолеЗначения =	ОписаниеКолнки["ПолеЗначения"];
		
			Если Элементы.Найти("ТаблицаСоответствий"+ПолеЗначения["ИмяКолонки"]) <> Неопределено Тогда
				//Колонка с тамим именем уже есть
				Продолжить;
			КонецЕсли;
			
			//Добавляем элемент формы
			НовыйЭлемент = Элементы.Добавить("ТаблицаСоответствий"+ПолеЗначения["ИмяКолонки"], Тип("ПолеФормы"), ГруппаТаблицы);       
			НовыйЭлемент.Вид 						= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 				= "ТаблицаСоответствий." + ПолеЗначения["ИмяКолонки"]; 
			НовыйЭлемент.ОтображатьВШапке 		   	= Истина;
			НовыйЭлемент.ЦветФона 		   			= ЦветаСтиля.ПравоРедактированияФон;
			НовыйЭлемент.КартинкаШапки  			= КартинкаШапки; 
			НовыйЭлемент.ТолькоПросмотр 			= Ложь; 
			НовыйЭлемент.РастягиватьПоГоризонтали 	= ложь;
			НовыйЭлемент.РастягиватьПоВертикали   	= Ложь; 
			НовыйЭлемент.АвтоМаксимальнаяШирина		= Истина;
			
			Ширина = ПолучитьШиринуКолнки(ТаблицаЗначений, ПолеЗначения["ИмяКолонки"]);
			НовыйЭлемент.Ширина = Макс(Ширина, СтрДлина(ПолеЗначения["Заголовок"])+4);
			//Добавляем элемент формы 		
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры          

&НаСервере
Функция ПолучитьШиринуКолнки(ТаблицаЗначений, КолонкаИмя)
	
	ШиринаПоля = 0;
	Для Каждого СтрокаТаблицы из ТаблицаЗначений Цикл
		ДлинаЗначнеия = СтрДлина(СокрЛП(СтрокаТаблицы[КолонкаИмя]));
		ШиринаПоля = Макс(ШиринаПоля, ДлинаЗначнеия);
		Если ШиринаПоля > 20 Тогда
			ШиринаПоля = 0;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ШиринаПоля;
	
КонецФункции

&НаСервере
Функция ДобавитьГруппуТаблицы(ИмяГруппы, ЗаголовокГруппы, ОтображатьВШапке, КартинкаШапки, РодительскийЭлемент)
	
	ГруппаПоиск = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаПоиск.Заголовок 			= ЗаголовокГруппы;  
	ГруппаПоиск.ОтображатьВШапке 	= ОтображатьВШапке;
	ГруппаПоиск.КартинкаШапки 		= КартинкаШапки;
	
	ГруппаПоиск.Вид			 		= ВидГруппыФормы.ГруппаКолонок; 
	ГруппаПоиск.Группировка 		= ГруппировкаКолонок.Горизонтальная;
	
	Возврат ГруппаПоиск;
	
КонецФункции

&НаСервере
Процедура УдалитьНенужныеЭлементыФормы()
	
	мЭлементы = Новый Массив;
	Для Каждого Элемент из Элементы.ТаблицаСоответствий.ПодчиненныеЭлементы Цикл  
		Если Элемент.Имя = "ТаблицаСоответствийИндексКартинки" Тогда
			Продолжить;
		Конецесли;
		мЭлементы.Добавить(Элемент);
	КонецЦикла;  
	
	Для Каждого Элемент из мЭлементы Цикл  
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписаниеКолонок(СоответствиеИменКолонок, ТаблицаЗначений)
	
	МетаданныеГрузоперевозки = Метаданные.Справочники.CW_Грузоперевозки;
	
	ДанныеКолонок = Новый Соответствие;
	
	Для Лево = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ОбластьДанные = ТабличныйДокумент.Область(1, Лево);
		Если ОбластьДанные.Расшифровка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОбластьДействие = ТабличныйДокумент.Область(2, Лево); 
		
		Расшифровка = ОбластьДанные.Расшифровка;
		
		Если Расшифровка.Свойство("Реквизит") Тогда       
			
			ИмяПоля		= Расшифровка["Идентификатор"];
			СинонимПоля	= Расшифровка["Реквизит"]["СинонимПоля"]; 
			
			СоответствиеИменКолонок.Вставить(Лево, ИмяПоля); 
			
			Реквизит = МетаданныеГрузоперевозки.Реквизиты.Найти(ИмяПоля);
			Если Реквизит = Неопределено Тогда
				Реквизит = МетаданныеГрузоперевозки.СтандартныеРеквизиты[ИмяПоля];
			КонецЕсли; 
			
			ПустоеЗначение = Реквизит.Тип.ПривестиЗначение(Неопределено);
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) Тогда   
				ОписаниеТипа = Новый ОписаниеТипов("Строка");  
			Иначе
				ОписаниеТипа = Реквизит.Тип;
			КонецЕсли;
			
			ТаблицаЗначений.Колонки.Добавить(ИмяПоля, ОписаниеТипа, СинонимПоля); 
			
			ОтборПоЗначению = (ОбластьДействие.ПараметрРасшифровки = "ПоискПоЗначению"); 
			ИмяПоляПоиска 	= Расшифровка["Реквизит"]["ПолеПоиска"]["ИмяПоля"];
			
			ИмяГруппы 			= "Группа"+ИмяПоля;   
			ЗаголовокГруппы 	= СинонимПоля;  
			ПолеЗначения 		= Неопределено;
			
			Если ИмяПоля = "Наименование" 
				или ИмяПоля = "Код" Тогда     
				
				ИмяГруппы 			= "ГруппаГрузоперевозка";
				ЗаголовокГруппы 	= "Грузоперевозка"; 
				
				ПолеЗначения = Новый Структура; 
				ПолеЗначения.Вставить("ИмяКолонки",			"Ссылка"); 
				ПолеЗначения.Вставить("Заголовок", 			"Ссылка"); 
				ПолеЗначения.Вставить("ТипЗначения", 		Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки")); 
				ПолеЗначения.Вставить("ИмяПоляКомпоновки", 	ИмяПоля);
				
			КонецЕсли;
			
			ДанныеГруппы = Новый Структура;
			ДанныеГруппы.Вставить("Имя", 				ИмяГруппы);
			ДанныеГруппы.Вставить("Заголовок", 			ЗаголовокГруппы);
			ДанныеГруппы.Вставить("ОтображатьВШапке",	Истина);
			
			ОписаниеКолонки = Новый Структура; 
			ОписаниеКолонки.Вставить("ИмяКолонки", 			ИмяПоля); 
			ОписаниеКолонки.Вставить("Заголовок", 			СинонимПоля); 
			ОписаниеКолонки.Вставить("ТипЗначения", 		ОписаниеТипа); 
			ОписаниеКолонки.Вставить("Действие", 			ОбластьДействие.ПараметрРасшифровки); 
			ОписаниеКолонки.Вставить("ТипДанных", 			"Реквизит");   
			ОписаниеКолонки.Вставить("Группа", 				ДанныеГруппы); 
			ОписаниеКолонки.Вставить("ПоискПоПолю", 		ИмяПоляПоиска);
			ОписаниеКолонки.Вставить("ИмяПоляКомпоновки", 	ИмяПоля);
			
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) Тогда
				
				ОписаниеТипаСсылка = Реквизит.Тип;

				ТаблицаЗначений.Колонки.Добавить("Ссылка"+ИмяПоля, ОписаниеТипаСсылка, "Ссылка"); 
				
				ПолеЗначения = Новый Структура; 
				ПолеЗначения.Вставить("ИмяКолонки",			"Ссылка"+ИмяПоля); 
				ПолеЗначения.Вставить("Заголовок", 			"Ссылка"); 
				ПолеЗначения.Вставить("ТипЗначения", 		ОписаниеТипаСсылка); 
				ПолеЗначения.Вставить("ИмяПоляКомпоновки", 	ИмяПоля);
			КонецЕсли;
			
			ОписаниеКолонки.Вставить("ПолеЗначения", ПолеЗначения); 
			
			ДанныеКолонок.Вставить(Расшифровка["Идентификатор"], ОписаниеКолонки); 
			
		КонецЕсли;
		
		Если Расшифровка.Свойство("Параметр") Тогда      
			
			ИмяПоля 		= СтрЗаменить(Расшифровка["Идентификатор"],"-", "_");
			СинонимПоля	 	= Расшифровка["Параметр"]["СинонимПоля"]; 
			ИмяРеквизита 	= Расшифровка["Параметр"]["ЗначениеПоля"]["ИмяПоля"]; 
			ИмяПоляПоиска 	= Расшифровка["Параметр"]["ПолеПоиска"]["ИмяПоля"];
			
			Параметр 		= XMLЗначение(Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок"), Расшифровка["Идентификатор"]);
			ПустоеЗначение 	= Параметр.ТипЗначения.ПривестиЗначение(Неопределено); 
			
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) Тогда   
				ОписаниеТипа = Новый ОписаниеТипов("Строка");  
			Иначе
				ОписаниеТипа = Параметр.ТипЗначения;
			КонецЕсли; 
			
			ТаблицаЗначений.Колонки.Добавить("Параметр_"+ИмяПоля, ОписаниеТипа, СинонимПоля); 
			
			ДанныеГруппы = Новый Структура;
			ДанныеГруппы.Вставить("Имя", 				"ГруппаПараметр_"+ИмяПоля);
			ДанныеГруппы.Вставить("Заголовок", 			СинонимПоля);
			ДанныеГруппы.Вставить("ОтображатьВШапке",	Истина);
			
			ОписаниеКолонки = Новый Структура; 
			ОписаниеКолонки.Вставить("ИмяКолонки", 			"Параметр_"+ИмяПоля); 
			ОписаниеКолонки.Вставить("Заголовок", 			СинонимПоля); 
			ОписаниеКолонки.Вставить("ТипЗначения", 		ОписаниеТипа); 
			ОписаниеКолонки.Вставить("Действие", 			ОбластьДействие.ПараметрРасшифровки); 
			ОписаниеКолонки.Вставить("ТипДанных", 			"Параметр");   
			ОписаниеКолонки.Вставить("Группа", 				ДанныеГруппы); 
			ОписаниеКолонки.Вставить("ИмяРеквизита", 		ИмяРеквизита);
			ОписаниеКолонки.Вставить("ПоискПоПолю", 		ИмяПоляПоиска);
			ОписаниеКолонки.Вставить("ИмяПоляКомпоновки", 	"Ссылка.["+Параметр.Идентификатор+"]"); 
			
			ПолеЗначения = Неопределено;
			
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустоеЗначение)) Тогда 
				
				ТаблицаЗначений.Колонки.Добавить("СсылкаПараметр_"+ИмяПоля, Параметр.ТипЗначения, "Ссылка"); 
				
				ПолеЗначения = Новый Структура; 
				ПолеЗначения.Вставить("ИмяКолонки", 		"СсылкаПараметр_"+ИмяПоля); 
				ПолеЗначения.Вставить("Заголовок", 			"Ссылка"); 
				ПолеЗначения.Вставить("ТипЗначения", 		Параметр.ТипЗначения); 
				ПолеЗначения.Вставить("ИмяПоляКомпоновки", 	"Ссылка.["+Параметр.Идентификатор+"]");
				
			КонецЕсли;
			
			ОписаниеКолонки.Вставить("ПолеЗначения", ПолеЗначения); 
			
			ДанныеКолонок.Вставить(Расшифровка["Идентификатор"], ОписаниеКолонки); 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОписаниеКолонок = новый ФиксированноеСоответствие(ДанныеКолонок);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДанных(Знач СоответствиеИменКолонок, ТаблицаЗначений)
	
	Для Верх = 3 по ТабличныйДокумент.ВысотаТаблицы Цикл   
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.СтрокаМакета = Верх;    
		
		Для Лево = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл    
			
			ОбластьОписание = ТабличныйДокумент.Область(1, Лево);   
			Если ОбластьОписание.Расшифровка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяКолонки  = ОбластьОписание.Расшифровка.Идентификатор; 
			
			ОписаниеКолонки = ОписаниеКолонок[ИмяКолонки];
			Если ОписаниеКолонки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеЯчейки = ТабличныйДокумент.Область(Верх, Лево).Текст;
			
			//преобразование пимитивных типов
			ПустаяСсылка = ОписаниеКолонки["ТипЗначения"].ПривестиЗначение(Неопределено); 
			Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустаяСсылка)) Тогда 
				Если ТипЗнч(ПустаяСсылка) = Тип("Дата") Тогда
					ЗначениеЯчейки = ОбщегоНазначенияКлиентСервер.СтрокаВДату(ЗначениеЯчейки);
				Конецесли;
				
				Если ТипЗнч(ПустаяСсылка) = Тип("Число") Тогда
					ЗначениеЯчейки = ОписаниеКолонки["ТипЗначения"].ПривестиЗначение(ЗначениеЯчейки);
				Конецесли;  
				
				Если ТипЗнч(ПустаяСсылка) = Тип("Булево") Тогда
					Если ВРег(ЗначениеЯчейки) = "ДА" или ВРег(ЗначениеЯчейки) = "YES" Тогда
						ЗначениеЯчейки = Истина;
					Иначе
						ЗначениеЯчейки = Ложь;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			//преобразование пимитивных типов
			
			
			НоваяСтрока[ОписаниеКолонки.ИмяКолонки] = ЗначениеЯчейки;
			
			Если ОписаниеКолонки["ПолеЗначения"] <> Неопределено Тогда
				
				ИмяПоляЗначения		= ОписаниеКолонки["ПолеЗначения"]["ИмяКолонки"];
				ЗначениеРеквизита 	= ОписаниеКолонки["ПолеЗначения"].ТипЗначения.ПривестиЗначение(Неопределено); 
				
				Если ИмяКолонки <> "Код" и ИмяКолонки <> "Наименование"  Тогда  
					
					Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда 
						
						МетаданныеПеречисления 		= ЗначениеРеквизита.Метаданные();
						МетаданныеПеречисленияИмя	= МетаданныеПеречисления.Имя; 
						мдЗначениеПеречисления 		= МетаданныеПеречисления.ЗначенияПеречисления.Найти(СокрЛП(ЗначениеЯчейки)); 
						
						Если мдЗначениеПеречисления <> Неопределено Тогда
							ЗначениеРеквизита = ПредопределенноеЗначение("Перечисление."+МетаданныеПеречисленияИмя+"."+СокрЛП(ЗначениеЯчейки)); 
						КонецЕсли;
						
						Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
							//Ищем перечисление по синониму
							Для Каждого ЗначениеПеречисления из МетаданныеПеречисления.ЗначенияПеречисления Цикл
								Если ЗначениеПеречисления.Синоним = СокрЛП(ЗначениеЯчейки) Тогда
									ЗначениеРеквизита = ПредопределенноеЗначение("Перечисление."+МетаданныеПеречисленияИмя+"."+СокрЛП(ЗначениеПеречисления.Имя)); 
									Прервать;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;	
						
					ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗначениеРеквизита))
						Или Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗначениеРеквизита)) 
						или ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда 
						
						Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ЗначениеРеквизита); 
						Если ОписаниеКолонки.ПоискПоПолю = "Наименование" Тогда
							ЗначениеРеквизита	= Менеджер.НайтиПоНаименованию(СокрЛП(ЗначениеЯчейки), Истина); 
						ИначеЕсли ОписаниеКолонки.ПоискПоПолю = "Код" Тогда
							ЗначениеРеквизита	= Менеджер.НайтиПоКоду(СокрЛП(ЗначениеЯчейки)); 
						Иначе
							ЗначениеРеквизита	= Менеджер.НайтиПоРеквизиту(ОписаниеКолонки.ПоискПоПолю, СокрЛП(ЗначениеЯчейки)); 
						КонецЕсли;
						
					КонецЕсли; 
					
				КонецЕсли;
				
				НоваяСтрока[ИмяПоляЗначения] = ЗначениеРеквизита;
				
			КонецЕсли;
			
		КонецЦикла;  
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРеквизитыФормы(Знач ТаблицаЗначений)   
	
	ИгнорируемыеКолонки = ПолучиьИгнорируемыеКолонкиТаблицы();
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Колонка из ТаблицаЗначений.Колонки Цикл  
		
		Если ИгнорируемыеКолонки.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения,"ТаблицаСоответствий", Колонка.Заголовок));
	КонецЦикла;  
	
	Удалаемыереквизиты 	= Новый Массив;
	КолонкиТаблицы 		= ЭтаФорма.ПолучитьРеквизиты("ТаблицаСоответствий");
	
	Для Каждого Реквизит из КолонкиТаблицы Цикл   
		Если ИгнорируемыеКолонки.Найти(Реквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Удалаемыереквизиты.Добавить("ТаблицаСоответствий."+Реквизит.Имя);
	КонецЦикла;  
	
	ИзменитьРеквизиты(Добавляемыереквизиты, Удалаемыереквизиты);
	
КонецПроцедуры

&НаСервере
Функция ПолучиьИгнорируемыеКолонкиТаблицы()
	
	ИгнорируемыеКолонки = Новый Массив;
	ИгнорируемыеКолонки.Добавить("ФлагПодобрано");	
	ИгнорируемыеКолонки.Добавить("ИндексКартинки");	
	ИгнорируемыеКолонки.Добавить("СтрокаМакета");
	
	Возврат ИгнорируемыеКолонки;
	
КонецФункции   

&НаКлиенте
Процедура ТаблицаСоответствийПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаСоответствий.ТекущаяСтрока;
	УстановитьФлагПодобраноПоСтроке(ТекущаяСТрока);
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьФлагПодобраноПоСтроке(ТекущаяСтрока)
	
	СтрокаТекущая = ТаблицаСоответствий.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ФлагПодобрано = Ложь;
	Для Каждого КлючЗначение из ОписаниеКолонок Цикл  
		
		ОписаниеКолонки = КлючЗначение.Значение;
		ПолеЗначения 	= ОписаниеКолонки["ПолеЗначения"];   
		
		ИмяКолонки = ОписаниеКолонки["ИмяКолонки"];  
		
		Если ПолеЗначения <> Неопределено Тогда 
			ИмяКолонки = ПолеЗначения["ИмяКолонки"];	
		КонецЕсли;  
		
		//Контроль блокировки мониторига   
		Если ОписаниеКолонки.ПолеЗначения <> Неопределено и ЗначениеЗаполнено(СтрокаТекущая[ИмяКолонки]) Тогда
			ПустоеЗначение = ОписаниеКолонки.ПолеЗначения.ТипЗначения.ПривестиЗначение(Неопределено);
			Если ТипЗнч(ПустоеЗначение) = Тип("СправочникСсылка.CW_Грузоперевозки") 
				или ТипЗнч(ПустоеЗначение) = Тип("СправочникСсылка.CW_Заказы") Тогда
				МониторингЗаблокирован = ПроверитьЗакрытиеМониторинга(СтрокаТекущая[ИмяКолонки]);  
				Если МониторингЗаблокирован Тогда
					СтрокаТекущая[ИмяКолонки] = ПустоеЗначение;	
				КонецЕсли;
			КонецЕсли;                                             
		КонецЕсли;
		//---Контроль блокировки мониторига
	
		ФлагПодобрано = ЗначениеЗаполнено(СтрокаТекущая[ИмяКолонки]);
		
		Если Не ФлагПодобрано Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаТекущая.ФлагПодобрано = ФлагПодобрано;	
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПроверитьЗакрытиеМониторинга(ОбъектМониторинга)    
	
	Если ТипЗнч(ОбъектМониторинга) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Если ЗначениеЗаполнено(ОбъектМониторинга.Заказ) Тогда
			Аналитика = ОбъектМониторинга.Заказ;	
		Иначе
			Аналитика = ОбъектМониторинга;	
		КонецЕсли;
	ИначеЕсли ТипЗнч(ОбъектМониторинга) = Тип("СправочникСсылка.CW_Заказы") Тогда  
		Аналитика = ОбъектМониторинга;	
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст  = "ВЫБРАТЬ
	                |	CW_ЗакрытиеМониторинга.Аналитика КАК Аналитика
	                |ИЗ
	                |	РегистрСведений.CW_ЗакрытиеМониторинга КАК CW_ЗакрытиеМониторинга
	                |ГДЕ
	                |	CW_ЗакрытиеМониторинга.Аналитика = &Аналитика"; 
	
	Запрос.УстановитьПараметр("Аналитика", Аналитика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Процедура УстановитьФлагПодобрано()
	
	Для Каждого СтрокаТаблицы из ТаблицаСоответствий Цикл 
		УстановитьФлагПодобраноПоСтроке(СтрокаТаблицы.ПолучитьИдентификатор());
	КонецЦикла; 
	
КонецПроцедуры
//Таблица соответстий  

//Загрузка данных  
&НаСервере
Процедура УстановитьКартинкуОжиданияПоСтрокам()
	
	Для Каждого СтрокаТаблицы из ТаблицаСоответствий Цикл
		СтрокаТаблицы.ИндексКартинки = 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуПараметров()
	
	ИнициализироватьОбъектыОтложеннойЗаписи();  
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", ПредопределенноеЗначение("Справочник.CW_Грузоперевозки.ПустаяСсылка"));
	
	НайденныеСтроки = ТаблицаСоответствий.НайтиСтроки(Отбор);
	
	Если Не ПропускатьНесинхронизированныеГрузоперевозки
		и НайденныеСтроки.Количество() > 0 Тогда                 
		
		Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл      
			ИндексСтроки = Формат(ТаблицаСоответствий.Индекс(НайденнаяСтрока), "ЧГ=0");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не подобрана грузоперевозка",,"ТаблицаСоответствий["+ИндексСтроки+"].Ссылка");
		КонецЦикла;
		ПоказатьПредупреждение(, "Загрузка невозможна! Требуется синхронизация грузоперевозок!");
		Возврат;
	КонецЕсли;
	
	НомерСтроки = 1;
	Для Каждого СтрокаТаблицы из ТаблицаСоответствий Цикл
		
		ЗагрузитьДанныеВИнформационнуБазу(СтрокаТаблицы.ПолучитьИдентификатор());  
		
		Прогресс = Окр(НомерСтроки / ТаблицаСоответствий.Количество() * 100, 0);;	
		Состояние("Загрузка параметров", Прогресс, СокрЛП(СтрокаТаблицы.Ссылка));   
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла; 
	
	//Отложенная запись объектов
	НомерСтроки = 1;
	Для Каждого ОбъектВМассиве из ОбъектыОтложеннойЗаписиМассив Цикл
		
		ВыполнитьОтложеннуюЗаписьОбъектов(ОбъектВМассиве);  
		
		Прогресс = Окр(НомерСтроки / ОбъектыОтложеннойЗаписиМассив.Количество() * 100, 0);;	
		Состояние("Отложенная запись параметров", Прогресс, СокрЛП(ОбъектВМассиве));   
	
		НомерСтроки = НомерСтроки + 1;

		Оповестить("ОбновитьДеревоПараметров", ОбъектВМассиве);
	КонецЦикла; 

	ИнициализироватьОбъектыОтложеннойЗаписи(Истина);
	//Отложенная запись объектов
	
	ОбработатьШагНаКлиенте("Шаг4"); 
	
	
	ПоказатьПредупреждение(, "Загрузка завершена");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеВИнформационнуБазу(ИдентификаторСтроки)  
	
	СтрокаТаблицы = ТаблицаСоответствий.НайтиПоИдентификатору(ИдентификаторСтроки); 
	ИндексСтроки  = Формат(ТаблицаСоответствий.Индекс(СтрокаТаблицы), "ЧГ=0");
	
	ГрузоперевозкаСсылка = СтрокаТаблицы.Ссылка; 
	
	Если Не ЗначениеЗаполнено(ГрузоперевозкаСсылка) 
		и ПропускатьНесинхронизированныеГрузоперевозки Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена грузоперевозка",,"ТаблицаСоответствий["+ИндексСтроки+"].Ссылка");
		СтрокаТаблицы.ИндексКартинки = 6; 
		Возврат;
	КонецЕсли; 
	
	//Контроль блокиовки мониторига
	МониторингЗаблокирован = ПроверитьЗакрытиеМониторинга(ГрузоперевозкаСсылка);  
	Если МониторингЗаблокирован Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Даныне не загружены! Мониторинг заблокирован",,"ТаблицаСоответствий["+ИндексСтроки+"].Ссылка");
		СтрокаТаблицы.ИндексКартинки = 6; 
		Возврат;	
	КонецЕсли;
	//---Контроль блокиовки мониторига
	
	ГрузоперевозкаОбъект 	= ГрузоперевозкаСсылка.ПолучитьОбъект(); 
	ПараметрыГрузоперевозки = ГрузоперевозкаОбъект.ПараметрыГрузоперевозки; 
	
	Заказ 	= ГрузоперевозкаСсылка.Заказ;
	Заявка 	= ГрузоперевозкаСсылка.Заявка;
	
	ЗаписатьГрузоперевозку 	= ложь;
	ОтложеннаяЗапись 		= Новый Соответствие(ОбъектыОтложеннойЗаписи);
	ОтложенныеОбъекты 		= новый Массив(ОбъектыОтложеннойЗаписиМассив);	
	
	Для Каждого КлючЗначение из ОписаниеКолонок Цикл
		
		ОписаниеКолонки = КлючЗначение.Значение;
		
		ИмяКолонки	= ОписаниеКолонки["ИмяКолонки"]; 
		Действие 	= ОписаниеКолонки["Действие"];  
		ТипДанных 	= ОписаниеКолонки["ТипДанных"];  
		
		Если ИмяКолонки = "Наименование" или ИмяКолонки = "Код"
			или Действие = "ПоискПоЗначению" Тогда 
			Продолжить;
		КонецЕсли;    
		
		ПолеЗначения = ОписаниеКолонки["ПолеЗначения"];   
		Если ПолеЗначения <> Неопределено Тогда 
			ИмяКолонки = ПолеЗначения["ИмяКолонки"];	
		КонецЕсли;                             
		
		Если ТипДанных = "Реквизит" Тогда
			ГрузоперевозкаОбъект[КлючЗначение.Ключ] = СтрокаТаблицы[ИмяКолонки];	
			ЗаписатьГрузоперевозку = Истина; 
			
			НазначениеПараметра = СоответствиеНазначенияПараметров.Получить(КлючЗначение.Ключ);  
			Если НазначениеПараметра["Заказ"] и Не Заказ.Пустая() Тогда
				
				Если ОтложенныеОбъекты.Найти(Заказ) = Неопределено Тогда
					ОтложенныеОбъекты.Добавить(Заказ);                      
				КонецЕсли;
	
				ДанныеОбъекта = ОтложеннаяЗапись.Получить(Заказ); 
				Если ДанныеОбъекта = Неопределено Тогда
					ДанныеОбъекта = ПолучитьПустуюСтруктуруДанныхОбъекта();
				КонецЕсли;  
				
				ДанныеОбъекта["Реквизиты"].Вставить(КлючЗначение.Ключ, СтрокаТаблицы[ИмяКолонки]);
				ОтложеннаяЗапись.Вставить(Заказ, ДанныеОбъекта);
			КонецЕсли;
			
			Если НазначениеПараметра["Заявка"] и Не Заявка.Пустая() Тогда
				Если ОтложенныеОбъекты.Найти(Заявка) = Неопределено Тогда
					ОтложенныеОбъекты.Добавить(Заявка);                      
				КонецЕсли;
				
				ДанныеОбъекта = ОтложеннаяЗапись.Получить(Заявка); 
				Если ДанныеОбъекта = Неопределено Тогда
					ДанныеОбъекта = ПолучитьПустуюСтруктуруДанныхОбъекта();
				КонецЕсли;  
				
				//Для заявки подменяем имя реквизита "Клиент" на "Контрагент"
				ИмяРеквизита = ?(КлючЗначение.Ключ="Клиент", "Контрагент", КлючЗначение.Ключ);
				
				ДанныеОбъекта["Реквизиты"].Вставить(ИмяРеквизита, СтрокаТаблицы[ИмяКолонки]);
				ОтложеннаяЗапись.Вставить(Заявка, ДанныеОбъекта);
			КонецЕсли;
			
			
		КонецЕсли; 
		
		Если ТипДанных = "Параметр" Тогда  
			
			ИмяРеквизита 		= ОписаниеКолонки["ИмяРеквизита"];
			ЗначениеПараметра 	= СтрокаТаблицы[ИмяКолонки]; 
			Параметр 			= ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Ключ));
			
			НазначениеПараметра = СоответствиеНазначенияПараметров.Получить(Параметр);  
			
			ЗаписатьПараметрыГрузоперевозки	= НазначениеПараметра["Грузоперевозка"];  
			ЗаписатьПараметрыЗаказа	= НазначениеПараметра["Заказ"] и Не Заказ.Пустая() и ИспользуютсяПараметрыВЗаказах;
			ЗаписатьПараметрыЗаявки	= НазначениеПараметра["Заявка"] и Не Заявка.Пустая();			
			
			Если Действие = "ДобавитьЗначение" Тогда
				Если ЗаписатьПараметрыГрузоперевозки Тогда
					НайденнаяСтрока = ПараметрыГрузоперевозки.Найти(Параметр, "Параметр"); 
					Если НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока = ПараметрыГрузоперевозки.Добавить();	
						НайденнаяСтрока.Параметр = Параметр;
					КонецЕсли;                                
					ЗаписатьГрузоперевозку = Истина;					
					ПродолжитьДействие  = "ОбновитьЗначение";
				КонецЕсли;
			КонецЕсли;   
			
			Если Действие = "ОбновитьЗначение" или ПродолжитьДействие = "ОбновитьЗначение" Тогда
				Если ЗаписатьПараметрыГрузоперевозки Тогда
					НайденнаяСтрока = ПараметрыГрузоперевозки.Найти(Параметр, "Параметр");
					Если НайденнаяСтрока <> Неопределено Тогда  
						
						ЗаписатьЗначение = Истина;
						Если ЭтоКонтрольнаяДата(Параметр) Тогда   
							Если ИмяРеквизита = "ЗначениеФакт" Тогда
								НайденнаяСтрока.ЗначениеФакт = ЗначениеПараметра;
							КонецЕсли;
							Если ИмяРеквизита = "ЗначениеПлан" Тогда
								НайденнаяСтрока.ЗначениеПлан = ЗначениеПараметра;
								ЗаписатьЗначение = Не ЗначениеЗаполнено(НайденнаяСтрока.ЗначениеФакт);
							КонецЕсли;
						КонецЕсли;
						
						Если ЗаписатьЗначение Тогда
							НайденнаяСтрока.Значение = ЗначениеПараметра;
						КонецЕсли;
						
						ЗаписатьГрузоперевозку = Истина;					
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;   
			
			Если ЗаписатьПараметрыЗаказа Тогда  
				
				Если ОтложенныеОбъекты.Найти(Заказ) = Неопределено Тогда
					ОтложенныеОбъекты.Добавить(Заказ);                      
				КонецЕсли;
				
				ДанныеОбъекта = ОтложеннаяЗапись.Получить(Заказ); 
				Если ДанныеОбъекта = Неопределено Тогда
					ДанныеОбъекта = ПолучитьПустуюСтруктуруДанныхОбъекта();
				КонецЕсли; 
				
				СтрукутраЗначения = Новый Структура;
				СтрукутраЗначения.Вставить("ИмяРеквизита",		ИмяРеквизита);
				СтрукутраЗначения.Вставить("ЗначениеПараметра", ЗначениеПараметра);
				
				СоответствиеЗначений = ДанныеОбъекта[Действие]; 
				СоответствиеЗначений.Вставить(Параметр, СтрукутраЗначения);
				
				ОтложеннаяЗапись.Вставить(Заказ, ДанныеОбъекта);
			КонеЦЕсли;  
			
			Если ЗаписатьПараметрыЗаявки Тогда
				Если ОтложенныеОбъекты.Найти(Заявка) = Неопределено Тогда
					ОтложенныеОбъекты.Добавить(Заявка);                      
				КонецЕсли;
				
				ДанныеОбъекта = ОтложеннаяЗапись.Получить(Заявка); 
				Если ДанныеОбъекта = Неопределено Тогда
					ДанныеОбъекта = ПолучитьПустуюСтруктуруДанныхОбъекта();
				КонецЕсли;                                     
				
				СтрукутраЗначения = Новый Структура;
				СтрукутраЗначения.Вставить("ИмяРеквизита",		ИмяРеквизита);
				СтрукутраЗначения.Вставить("ЗначениеПараметра", ЗначениеПараметра);
				
				СоответствиеЗначений = ДанныеОбъекта[Действие]; 
				СоответствиеЗначений.Вставить(Параметр, СтрукутраЗначения);
				
				ОтложеннаяЗапись.Вставить(Заявка, ДанныеОбъекта);
			КонеЦЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗаписатьГрузоперевозку Тогда
		Попытка   
			ГрузоперевозкаОбъект.Записать(); 
		Исключение
			СтрокаТаблицы.ИндексКартинки = 6; 
			Возврат;
		КонецПопытки;
	Конецесли;
	
	//Запишем стутасы
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ГрузоперевозкаСсылка.Ссылка);
	
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
	//Запишем стутасы     
	
	ОбъектыОтложеннойЗаписи 		= Новый ФиксированноеСоответствие(ОтложеннаяЗапись);	
	ОбъектыОтложеннойЗаписиМассив 	= Новый ФиксированныйМассив(ОтложенныеОбъекты);
	
КонецПроцедуры
              
//Загрузка данных                


&НаКлиенте
Процедура ЗаполнитьЗначенияКолонки(Команда) 
	
	ВыделенныеСтроки = Элементы.ТаблицаСоответствий.ВыделенныеСтроки;
	
	ОписаниеКолонки  = ПолучитьДанныеКолонки();   
	Если ОписаниеКолонки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки",	ВыделенныеСтроки);
	ДополнительныеПараметры.Вставить("ОписаниеКолонки", 	ОписаниеКолонки);
	
	ОписаниеОпвещения = Новый ОписаниеОповещения("ЗавершитьВыборЭлемента", ЭтотОбъект, ДополнительныеПараметры);  
	
	Если ОписаниеКолонки.ЭтоСсылка Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("РежимВыбора", 	   Истина);
		СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", Истина);
		СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
		
		ОткрытьФорму(ОписаниеКолонки.ИмяОбъекта+".ФормаВыбора", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОпвещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе  
		
		ПоказатьВводЗначения(ОписаниеОпвещения,, "Введите значение", ОписаниеКолонки.ТипЗначения);
		
	КонецЕсли;
	
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьДанныеКолонки() 
	
	ПутьКданным 	= Элементы.ТаблицаСоответствий.ТекущийЭлемент.ПутьКДанным;
	мДанныеПоля 	= СтрРазделить(ПутьКданным, ".");   
	ИмяКолонки 		= мДанныеПоля[1];  
	
	Для Каждого КлючЗначение из  ОписаниеКолонок Цикл
		
		ОписаниеКолонки = КлючЗначение.Значение; 
		ПолеЗначения 	= ОписаниеКолонки["ПолеЗначения"]; 
		ИмяПоля 		= ОписаниеКолонки["ИмяКолонки"]; 
		
		Если ИмяПоля = ИмяКолонки и ПолеЗначения <> Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если ПолеЗначения <> Неопределено Тогда
			ИмяПоля 		= ПолеЗначения["ИмяКолонки"];
			ОписаниеКолонки = ПолеЗначения;
		КонецЕсли;
		
		Если ИмяПоля = ИмяКолонки Тогда
			ТипЗначения = ОписаниеКолонки["ТипЗначения"];	
			Прервать;
		Конецесли;
		
	КонецЦикла;
	
	ПустаяСсылка = ТипЗначения.ПривестиЗначение(Неопределено);   
	
	ОписаниеКолонки = Новый Структура;
	ОписаниеКолонки.Вставить("Имя",			ИмяПоля);
	ОписаниеКолонки.Вставить("ТипЗначения",	ТипЗнч(ПустаяСсылка));
	ОписаниеКолонки.Вставить("ЭтоСсылка", 	Ложь);  
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПустаяСсылка)) Тогда
		ПолноеИмяОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(ПустаяСсылка)).ПолноеИмя();
		ОписаниеКолонки.Вставить("ЭтоСсылка",	Истина);  
		ОписаниеКолонки.Вставить("ИмяОбъекта", 	ПолноеИмяОбъекта);  
	КонецЕсли;      
	
	Возврат ОписаниеКолонки
	
КонецФункции


&НаКлиенте
Процедура ЗавершитьВыборЭлемента(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыборЭлементаНаСервере(РезультатВыбора, ДополнительныеПараметры);
	
КонецПроцедуры    

&НаСервере
Процедура ОбработатьВыборЭлементаНаСервере(ВыбранноеЗначение, ДополнительныеПараметры)
	
	Для Каждого ИдентификаторСтроки из ДополнительныеПараметры.ВыделенныеСтроки Цикл
		СтрокаТекущая = ТаблицаСоответствий.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаТекущая[ДополнительныеПараметры.ОписаниеКолонки["Имя"]]  = ВыбранноеЗначение;
	КонецЦикла; 
	
	УстановитьФлагПодобрано();
	
КонецПроцедуры    

//Назначение параметров
&НаКлиенте
Процедура ПоказатьСкрытьНазначениеПараметров(Команда)
	
	ПоказатьСкрытьНазначениеПараметров = Не ПоказатьСкрытьНазначениеПараметров;
	ПоказатьСкрытьНазначениеПараметровНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьНазначениеПараметровНаСервере()
	
	Элементы.ГруппаНазначениеПараметров.Видимость 		= ПоказатьСкрытьНазначениеПараметров;
	Элементы.ПоказатьСкрытьНазначениеПараметров.Пометка = ПоказатьСкрытьНазначениеПараметров;
	
КонецПроцедуры  

&НаСервере
Процедура ДобавитьСтрокуНазначенияПараметра(Знач Параметр) 
	
	тНазначенияПараметров = РеквизитФормыВЗначение("НазначенияПараметров");
	
	СтрокаТаблицы = тНазначенияПараметров.Найти(Параметр, "Параметр"); 
	Если СтрокаТаблицы = Неопределено Тогда
		СтрокаТаблицы = тНазначенияПараметров.Добавить();  
		СтрокаТаблицы.Параметр 			= Параметр;
		СтрокаТаблицы.ИндексКартинки 	= ПолучитьИндексКартинкиПараметра(Параметр); 
	КонецЕсли;

	НазначениеПараметра = ПолучитьПустуюСтруктуруНазначения(); 
	СтрокаТаблицы.Грузоперевозка 	= НазначениеПараметра["Грузоперевозка"];
	СтрокаТаблицы.Заказ 			= НазначениеПараметра["Заказ"];
	СтрокаТаблицы.Заявка 			= НазначениеПараметра["Заявка"]; 
	
	ДоступностьНазначения = ПолучитьДоступностьНазначения(Параметр); 
	СтрокаТаблицы.ГрузоперевозкаДоступность	= ДоступностьНазначения["Грузоперевозка"];
	СтрокаТаблицы.ЗаказДоступность 			= ДоступностьНазначения["Заказ"];
	СтрокаТаблицы.ЗаявкаДоступность			= ДоступностьНазначения["Заявка"]; 
	

	ЗначениеВРеквизитФормы(тНазначенияПараметров, "НазначенияПараметров");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИндексКартинкиПараметра(Знач Параметр)
	
	Если ТипЗнч(Параметр) = Тип("Строка") Тогда
		//Это имя реквизита
		Возврат 6;
	КонецЕсли;
	
	Если Параметр.ЭтоКонтрольнаяДата Тогда
		Возврат 2;				
	ИначеЕсли Параметр.ДинамическийПараметр Тогда 
		Возврат 3;
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции   

&НаСервере
Процедура ОбновитьНазначенияПараметровНаСервере() 
	
	МассивДействий = ПолучитьМассивДействийДляУстановкиНазначенияПараметра();
	
	МассивВыбранныхПараметров = новый Массив;
	Для НомерКолонки = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		ОбластьДанных 	= ТабличныйДокумент.Область(1, НомерКолонки);  
		ОбластьДействия = ТабличныйДокумент.Область(2, НомерКолонки);
		
		Если ТипЗнч(ОбластьДанных.Расшифровка) = Тип("Структура") 
			И МассивДействий.Найти(ОбластьДействия.ПараметрРасшифровки) <> Неопределено	Тогда 
			
			Если ОбластьДанных.Расшифровка.Свойство("Параметр") Тогда 
				МассивВыбранныхПараметров.Добавить(ОбластьДанных.Расшифровка.Параметр.Ссылка);  
			КонецЕсли;
			Если ОбластьДанных.Расшифровка.Свойство("Реквизит") Тогда
				МассивВыбранныхПараметров.Добавить(ОбластьДанных.Расшифровка.Реквизит.ИмяРеквизита);  
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла; 
	
	УдаляемыеСтроки = Новый Массив;
	Для Каждого СтрокаТаблицы из НазначенияПараметров Цикл
		Если МассивВыбранныхПараметров.Найти(СтрокаТаблицы.Параметр) = Неопределено Тогда
			 УдаляемыеСтроки.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;  
	
	Для Каждого УдаляемаяСтрока из УдаляемыеСтроки Цикл
		НазначенияПараметров.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры      

&НаСервере
Функция ПолучитьСоответствиеПоТаблицеНазначений()
	
	Соответствие = Новый Соответствие;
	Для Каждого СтрокаТаблицы из НазначенияПараметров Цикл
		НазначениеПараметра = ПолучитьПустуюСтруктуруНазначения(); 
		ЗаполнитьЗначенияСвойств(НазначениеПараметра, СтрокаТаблицы);
		
		Соответствие.Вставить(СтрокаТаблицы.Параметр, НазначениеПараметра);
	КонецЦикла;
	
	Возврат Соответствие;

КонецФункции

&НаСервере
Функция ПолучитьПустуюСтруктуруНазначения()
	
	Структура = Новый Структура;
	Структура.Вставить("Грузоперевозка", 			Истина);
	Структура.Вставить("Заказ", 					Ложь);
	Структура.Вставить("Заявка", 					Ложь);
	Структура.Вставить("ГрузоперевозкаДоступность", Истина);
	Структура.Вставить("ЗаказДоступность", 			Истина);
	Структура.Вставить("ЗаявкаДоступность", 		Истина);
	
	Возврат Структура;
	
КонецФункции  

&НаСервере
Функция ПолучитьДоступностьНазначения(Параметр)

	Структура = Новый Структура("Грузоперевозка,Заказ,Заявка",Истина, Истина, Истина);
	Если ТипЗнч(Параметр) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда  
		//Доступнны все поля
		Возврат Структура
	КонецЕсли; 
	
	стрДоступныеРеквизитыГрузоперевозки	= "Клиент,Типоразмер,Груз,ОперативныйМенеджер,МенеджерПродаж,Маршрут";
	стрДоступныеРеквизитыЗаказа			= "Клиент,Груз,ОперативныйМенеджер,МенеджерПродаж,Маршрут";
	стрДоступныеРеквизитыЗаявки			= "Клиент,Типоразмер,Груз,МенеджерПродаж,Маршрут"; 
	
	Структура.Грузоперевозка 	= (СтрНайти(стрДоступныеРеквизитыГрузоперевозки, Параметр) > 0); 
	Структура.Заказ 			= (СтрНайти(стрДоступныеРеквизитыЗаказа, Параметр) > 0); 
	Структура.Заявка 			= (СтрНайти(стрДоступныеРеквизитыЗаявки, Параметр) > 0); 

	Возврат Структура;
	
КонецФункции  


&НаСервере
Функция ПолучитьПустуюСтруктуруДанныхОбъекта()
	
	ДанныеОбъекта = Новый Соответствие;  
	ДанныеОбъекта.Вставить("ДобавитьЗначение", 	Новый Соответствие);
	ДанныеОбъекта.Вставить("ОбновитьЗначение", 	Новый Соответствие);
	ДанныеОбъекта.Вставить("Реквизиты", 		Новый Соответствие);
	
	Возврат ДанныеОбъекта;
	
КонецФункции       

&НаСервере
Функция ПолучитьМассивДействийДляУстановкиНазначенияПараметра()
	
	Массив = Новый Массив; 
	Массив.Добавить("ДобавитьЗначение");
	Массив.Добавить("ОбновитьЗначение"); 
	
	Возврат Массив;

КонецФункции


&НаСервере
Процедура ИнициализироватьОбъектыОтложеннойЗаписи(ОчиститьНазначенияПараметров =ложь)  
	
	ОбъектыОтложеннойЗаписи 		= Новый ФиксированноеСоответствие(Новый Соответствие);          
	ОбъектыОтложеннойЗаписиМассив 	= Новый ФиксированныйМассив(Новый Массив); 
	
	Если ОчиститьНазначенияПараметров Тогда     
		Соответствие = Новый Соответствие;
	Иначе
		Соответствие = ПолучитьСоответствиеПоТаблицеНазначений();   
	КонецЕсли;
	
	СоответствиеНазначенияПараметров = Новый ФиксированноеСоответствие(Соответствие);
	
КонецПроцедуры     

&НаСервере
Процедура ВыполнитьОтложеннуюЗаписьОбъектов(ОтложенныйОбъект)
	
	ДанныеОбъекта = ОбъектыОтложеннойЗаписи.Получить(ОтложенныйОбъект); 
	Если ДанныеОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектДляЗаписи = ОтложенныйОбъект.ПолучитьОбъект();
	Если ТипЗнч(ОтложенныйОбъект) = Тип("СправочникСсылка.CW_Заказы") Тогда
		ТаблицаПараметров = ОбъектДляЗаписи.ПараметрыЗаказа;
	ИначеЕсли ТипЗнч(ОтложенныйОбъект) = Тип("СправочникСсылка.CW_Заявки") Тогда
		ТаблицаПараметров = ОбъектДляЗаписи.ПараметрыЗаявки;
	Иначе
		Возврат;
	КонецЕсли;      
	
	Для Каждого КлючЗначение из ДанныеОбъекта["ДобавитьЗначение"] Цикл            
		
		СтрукутраЗначения = КлючЗначение.Значение;
		
		НайденнаяСтрока = ТаблицаПараметров.Найти(КлючЗначение.Ключ, "Параметр"); 
		Если НайденнаяСтрока = Неопределено Тогда
			НайденнаяСтрока = ТаблицаПараметров.Добавить();	
			НайденнаяСтрока.Параметр = КлючЗначение.Ключ;
		КонецЕсли;                                
		
		ЗаписатьЗначение = Истина;
		Если ЭтоКонтрольнаяДата(КлючЗначение.Ключ) Тогда   
			Если СтрукутраЗначения.ИмяРеквизита = "ЗначениеФакт" Тогда
				НайденнаяСтрока.ЗначениеФакт = СтрукутраЗначения.ЗначениеПараметра;
			КонецЕсли;
			Если СтрукутраЗначения.ИмяРеквизита = "ЗначениеПлан" Тогда
				НайденнаяСтрока.ЗначениеПлан = СтрукутраЗначения.ЗначениеПараметра;
				ЗаписатьЗначение = Не ЗначениеЗаполнено(НайденнаяСтрока.ЗначениеФакт);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗаписатьЗначение Тогда
			НайденнаяСтрока.Значение = СтрукутраЗначения.ЗначениеПараметра;
		КонецЕсли;
		
		ЗаписатьОбъект = Истина;					
	КонецЦикла;   
	
	Для Каждого КлючЗначение из ДанныеОбъекта["ОбновитьЗначение"] Цикл
		
		СтрукутраЗначения = КлючЗначение.Значение;
		
		НайденнаяСтрока = ТаблицаПараметров.Найти(КлючЗначение.Ключ, "Параметр");
		Если НайденнаяСтрока <> Неопределено Тогда  
			
			ЗаписатьЗначение = Истина;
			Если ЭтоКонтрольнаяДата(КлючЗначение.Ключ) Тогда   
				Если СтрукутраЗначения.ИмяРеквизита = "ЗначениеФакт" Тогда
					НайденнаяСтрока.ЗначениеФакт = СтрукутраЗначения.ЗначениеПараметра;
				КонецЕсли;
				Если СтрукутраЗначения.ИмяРеквизита = "ЗначениеПлан" Тогда
					НайденнаяСтрока.ЗначениеПлан = СтрукутраЗначения.ЗначениеПараметра;
					ЗаписатьЗначение = Не ЗначениеЗаполнено(НайденнаяСтрока.ЗначениеФакт);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗаписатьЗначение Тогда
				НайденнаяСтрока.Значение = СтрукутраЗначения.ЗначениеПараметра;
			КонецЕсли;
			
			ЗаписатьОбъект = Истина;					
		КонецЕсли;
	КонецЦикла; 
	
	Для Каждого КлючЗначение из ДанныеОбъекта["Реквизиты"] Цикл
		ОбъектДляЗаписи[КлючЗначение.Ключ] = КлючЗначение.Значение;	
		ЗаписатьОбъект = Истина;					
	КонецЦикла; 
	
	Если ЗаписатьОбъект Тогда   
		Попытка
			ОбъектДляЗаписи.Записать();	
		Исключение       
			Возврат;
		КонецПопытки;
	КонецЕсли;

 	//Запишем стутасы
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОтложенныйОбъект);
	
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
	//Запишем стутасы     

	
КонецПроцедуры

&НаКлиенте
Процедура НазначенияПараметровПередУдалением(Элемент, Отказ)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьСнятьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажки(Флаг)  
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Грузоперевозка",,,БиблиотекаКартинок.CW_Грузоперевозки);
	СписокВыбора.Добавить("Заказ",,,БиблиотекаКартинок.CW_Коробка);
	СписокВыбора.Добавить("Заявка",,,БиблиотекаКартинок.CW_Заявки);    

	ВыделенныеСтроки = Элементы.НазначенияПараметров.ВыделенныеСтроки;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	ДополнительныеПараметры.Вставить("Флаг", Флаг);
	
	Оповещение = новый ОписаниеОповещения("ЗавершитьОтметкуЭлементов", ЭтотОбъект, ДополнительныеПараметры);
	
	ЗаголовокСписка = "Снять флажки для...";
	Если Флаг Тогда
		ЗаголовокСписка = "Установить флажки для...";
	КонецЕсли;
	
	СписокВыбора.ПоказатьОтметкуЭлементов(Оповещение, ЗаголовокСписка);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьОтметкуЭлементов(СпискЗначений, ДополнительныеПараметры) Экспорт
	
	Если СпискЗначений = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	мПоля = Новый Массив;
	Для Каждого ЭлементСписка из СпискЗначений Цикл
		Если ЭлементСписка.Пометка Тогда
			мПоля.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ВыделенныеУстановитьСнятьФлажкиНаСервере(ДополнительныеПараметры.ВыделенныеСтроки, ДополнительныеПараметры.Флаг, мПоля)	
	
КонецПроцедуры

&НаСервере
Процедура ВыделенныеУстановитьСнятьФлажкиНаСервере(ВыделенныеСтроки, Флаг, мПоля) 
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТекущая = НазначенияПараметров.НайтиПоИдентификатору(ИдентификаторСтроки);   
		
		Для Каждого ИмяПоля из мПоля Цикл 
			Если Не СтрокаТекущая[ИмяПоля+"Доступность"] Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТекущая[ИмяПоля] = Флаг;   
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры         

&НаСервере
Функция ПроверитьУстановленныеОтметкиНазначенияПараметров()
	
	Если НазначенияПараметров.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;  
	
	Успешно = истина;
	Для Каждого СтрокаНазначения из НазначенияПараметров Цикл
		Если Не СтрокаНазначения.Грузоперевозка
			И Не СтрокаНазначения.Заказ
			И Не СтрокаНазначения.Заявка Тогда
			
			Успешно = ложь;
			Прервать;
		КонецЕсли;  
	КонецЦикла;
	
	Возврат Успешно;
	
КонецФункции



//Назначение параметров