#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

Процедура ЗаполнитьПредопределенныеФункции() Экспорт
	
	СпрОбъект = Справочники.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.ДатаВыплатыДохода.ПолучитьОбъект();
	СпрОбъект.СпособПолученияЗначения 	= 3;
	СпрОбъект.Идентификатор 			= "ДатаВыплатыДохода";
	СпрОбъект.Записать();  
	
	СпрОбъект = Справочники.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.КодВалютыВыплатыДохода.ПолучитьОбъект();
	СпрОбъект.СпособПолученияЗначения 	= 3;
	СпрОбъект.Идентификатор 			= "КодВалютыВыплатыДохода";
	СпрОбъект.Записать();  
	
	СпрОбъект = Справочники.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.КурсРубляНаДатуВыплатыДохода.ПолучитьОбъект();
	СпрОбъект.СпособПолученияЗначения 	= 3;
	СпрОбъект.Идентификатор 			= "КурсРубляНаДатуВыплатыДохода";
	СпрОбъект.Записать();  
	
	СпрОбъект = Справочники.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.СуммаДоходаРуб.ПолучитьОбъект();
	СпрОбъект.СпособПолученияЗначения 	= 3;
	СпрОбъект.Идентификатор 			= "СуммаДоходаРуб";
	СпрОбъект.Записать();  
	
	СпрОбъект = Справочники.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.СуммаДоходаВВалютеВыплаты.ПолучитьОбъект();
	СпрОбъект.СпособПолученияЗначения 	= 3;
	СпрОбъект.Идентификатор 			= "СуммаДоходаВВалютеВыплаты";
	СпрОбъект.Записать();  
	
КонецПроцедуры  

#КонецЕсли
	