
Процедура ПриЗаписи(Отказ) 
	
	ОбновитьПовторноИспользуемыеЗначения(); 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИдентификаторФормулыУникальный() Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры  

Функция ИдентификаторФормулыУникальный()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета КАК CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета
	               |ГДЕ
	               |	CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.Ссылка <> &Ссылка
	               |	И CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета.Идентификатор = &Идентификатор";   
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции
