#Область ПрограммныйИнтерфейс

Процедура ОбновитьТекстЭПД(Форма) Экспорт
	Элементы = Форма.Элементы;
	Если Элементы.Найти("ГруппаСостояниеЭПД") = Неопределено 
		ИЛИ НЕ Элементы.ГруппаСостояниеЭПД.Видимость Тогда
		
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ТерминальныйТип = Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная");
	Иначе
		ТерминальныйТип = Тип("ДокументСсылка.ЭлектронныйЗаказЗаявка");
	КонецЕсли;
	
	СписокДокументов = ОбменСГИСЭПДБПВызовСервера.ЭлектронныеДокументыПоОснованию(Объект);
	ДокументооборотЗавершен = Ложь;
	Для каждого СтрокаДокумент Из СписокДокументов Цикл
		Если ТипЗнч(СтрокаДокумент.Значение) = ТерминальныйТип 
			И СтрокаДокумент.Пометка Тогда
			
			ДокументооборотЗавершен = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ДекорацияОформитьЭПД.Видимость = НЕ ДокументооборотЗавершен;
	Элементы.ДекорацияЭПД.Видимость = СписокДокументов.Количество() > 0;
	
	Если СписокДокументов.Количество() = 1 Тогда
		Элементы.ДекорацияЭПД.Заголовок = СписокДокументов[0].Представление;
		Форма.ЭПДСсылка = СписокДокументов[0].Значение;
	Иначе
		Элементы.ДекорацияЭПД.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ЭПД (%1)", СписокДокументов.Количество());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
