&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Регистр.Параметры.УстановитьЗначениеПараметра("Вариант", Объект.Ссылка);
	_УФС.ДобавитьОтбор(Регистр.Отбор,"Вариант", , Объект.Ссылка);
	
	// --- 
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Регистр.Отбор.Элементы.Очистить();
	Регистр.Параметры.УстановитьЗначениеПараметра("Вариант", Объект.Ссылка);
	_УФС.ДобавитьОтбор(Регистр.Отбор,"Вариант", , Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
			Объект.Наименование = "Основной";
		КонецЕсли;
		ЭтаФорма.Записать();
	КонецЕсли;	
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти

