#Область ПрограммныйИнтерфейс

Процедура ОбработкаЗагрузитьВыпискуПоделиться(ДанныеЗапроса) Экспорт
	
	Если ДанныеЗапроса.Файлы.Количество() > 0 Тогда
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ДанныеЗапроса.Файлы[0]);
		АдресХранилищаДанныхФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, Новый УникальныйИдентификатор);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресФайлаВыписки", АдресХранилищаДанныхФайла);
		
		НоваяФормаКлиентБанк = ПолучитьФорму("Обработка.КлиентБанк.Форма.Форма", ПараметрыФормы,, "ФормаЗагрузкиИзФайла");
		НоваяФормаКлиентБанк.Открыть();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось передать файл в мобильное приложение. Сообщите разработчикам'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти