&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Журнал") И Параметры.Свойство("ОписаниеКолонок") Тогда
		Параметры.Свойство("Журнал", Отчет.АдресЖурналаПереданый);
		Параметры.Свойство("ОписаниеКолонок", АдрОписаниеКолонок);
		Журнал = ПолучитьИзВременногоХранилища(Отчет.АдресЖурналаПереданый);
		//Для Инд = 1 по 6 Цикл
		//	Журнал.Колонки.Удалить(0);
		//КонецЦикла;			
		ОписаниеКолонок = ПолучитьИзВременногоХранилища(АдрОписаниеКолонок);
		Отчет.АдресЖурналаПереданый = ПоместитьВоВременноеХранилище(Журнал, Новый УникальныйИдентификатор());
		АдрОписаниеКолонок = ПоместитьВоВременноеХранилище(ОписаниеКолонок, ЭтаФорма.УникальныйИдентификатор);		
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	флАнализЭкономикиГрузоперевозок	= CW_ПраваДоступа.ПравоДоступно("АнализЭкономикиГрузоперевозок", ПараметрыСеанса.ТекущийПользователь);
	
	Элементы.ВыводитьФинансовыеПоказатели.Доступность = флАнализЭкономикиГрузоперевозок;
	
	Если Не флАнализЭкономикиГрузоперевозок Тогда
		ВыводитьФинансовыеПоказатели = Ложь;
	КонецЕсли;
	
	Если (НЕ ПолучитьФункциональнуюОпцию("CW_ИспользованиеБюджетирования")) Тогда
		Элементы.ВерсияБюджета.Видимость = Ложь;
		Элементы.ВыводитьФинансовыеПоказателиПоБюджету.Доступность=Ложь;
	КонецЕсли;	
	
	СЗ = _ПолучитьСписокКД();
	Для Каждого Стр Из СЗ Цикл
		Элементы.КД.СписокВыбора.Добавить(Стр.Значение, Стр.Представление, , Стр.Картинка);
	КонецЦикла; 
	
	ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	_ВосстановитьСеансовуюНастройку();	
	
	Если (ВыводитьФинансовыеПоказатели И (НЕ ВыводитьФинансовыеПоказателиПоСчетам И НЕ ВыводитьФинансовыеПоказателиПоАктам И НЕ ВыводитьФинансовыеПоказателиПоБюджету)) Тогда
		ВыводитьФинансовыеПоказатели = Ложь;
	КонецЕсли;	
	
	_ПраваДоступа();
	УправлениеВидимостью();
	
	_Сформировать();
	
КонецПроцедуры

&НаСервере
Функция _ПраваДоступа()
	// --- 
	
	ПравоФинансы = CW_ПраваДоступа.ПравоДоступно("АнализЭкономикиГрузоперевозок");;
	Если (НЕ ПравоФинансы) Тогда
		ВыводитьФинансовыеПоказатели = Ложь;
	КонецЕсли; 
	Элементы.ВыводитьФинансовыеПоказатели.Видимость = ПравоФинансы;
	
	// --- 
КонецФункции
 

&НаСервере
Процедура УправлениеВидимостью()

	Элементы.ГруппаОтбор.Видимость = ВыводитьФинансовыеПоказатели;
	Элементы.ГруппаФО.Видимость = ВыводитьФинансовыеПоказатели;
	Элементы.ГруппаДетализация.Видимость = ВыводитьФинансовыеПоказатели;
	Элементы.ГруппаВалюты.Видимость = ВыводитьФинансовыеПоказатели;
	
	// --- 
	
	Элементы.ВерсияБюджета.Видимость = ВыводитьФинансовыеПоказателиПоБюджету;

	Элементы.Валюты.Видимость = ?(РежимВалют = 1, Истина, Ложь);
	Элементы.ОпределениеКурса.Видимость = ?(РежимВалют = 1, Истина, Ложь);
	Элементы.КД.Видимость = ?(РежимВалют = 1, Истина, Ложь) И ?(ОпределениеКурса = 1, Истина, Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияБюджетаПриИзменении(Элемент)
		
	Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
		ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьБазовуюВерсиюБюджета()
	
	тВерсияБюджета = CW_Бюджетирование.ПолучитьОсновнуюВерсиюБюджета();
	тВерсияБюджета = ?(ЗначениеЗаполнено(тВерсияБюджета), тВерсияБюджета, Справочники.CW_ВерсииБюджетов.Основная);
	
	Возврат тВерсияБюджета;
	
КонецФункции

&НаКлиенте
Процедура ПереключателиПриИзменении(Элемент)
	
	Если ФормированиеОтчета = 2 И РежимВалют = 1 Тогда
		ОпределениеКурса = 1;
	КонецЕсли;	
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьСписокКД() 

	СЗ = Новый СписокЗначений;
	СЗ.Добавить("Реквизит.ДатаСделкиФ",  "Дата грузоперевозки", , БиблиотекаКартинок.CW_Грузоперевозки);
	СЗ.Добавить("Реквизит.ДатаЗакрытия", "Дата блокировки", ,     БиблиотекаКартинок.CW_Грузоперевозки);
			
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	CW_ПараметрыГрузоперевозок.Ссылка,
		|	CW_ПараметрыГрузоперевозок.Наименование,
		|	CW_ПараметрыГрузоперевозок.ТипЗначения,
		|	CW_ПараметрыГрузоперевозок.Код
		|ИЗ
		|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
		|ГДЕ
		|	НЕ CW_ПараметрыГрузоперевозок.ЭтоГруппа
		|	И CW_ПараметрыГрузоперевозок.ЭтоКонтрольнаяДата = ИСТИНА";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр из ТЗ Цикл
		СЗ.Добавить(Стр.Код, "(П) " + Стр.Наименование, , БиблиотекаКартинок.ДиаграммаГанта);
	КонецЦикла;
	
	Возврат СЗ;

КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;
	//УдалитьИзВременногоХранилища(Отчет.АдресЖурналаПереданый);
	
КонецПроцедуры

//-----------------------------------------------------------------------------

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть=Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка=Ложь;
	Иначе
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка=Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка=Истина;
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

//-----------------------------------------------------------------------------

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("Организация", Организация);
			СеансоваяНастройка.Свойство("ФормированиеОтчета", ФормированиеОтчета);
			// --- 
			СеансоваяНастройка.Свойство("ВыводитьЗаголовок", ВыводитьЗаголовок);
			СеансоваяНастройка.Свойство("ВыводитьФинансовыеПоказатели", ВыводитьФинансовыеПоказатели);
			СеансоваяНастройка.Свойство("ВыводитьФинансовыеПоказателиПоСчетам", ВыводитьФинансовыеПоказателиПоСчетам);
			СеансоваяНастройка.Свойство("ВыводитьФинансовыеПоказателиПоАктам", ВыводитьФинансовыеПоказателиПоАктам);
			СеансоваяНастройка.Свойство("ВыводитьФинансовыеПоказателиПоБюджету", ВыводитьФинансовыеПоказателиПоБюджету);
			СеансоваяНастройка.Свойство("КомментироватьФинансовыеПоказатели", КомментироватьФинансовыеПоказатели);
			// --- 
			СеансоваяНастройка.Свойство("ВерсияБюджета", ВерсияБюджета);
			Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
				ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
			КонецЕсли;				
			СеансоваяНастройка.Свойство("ДетализироватьДоходы", ДетализироватьДоходы);
			СеансоваяНастройка.Свойство("ДетализироватьРасходы", ДетализироватьРасходы);
			СеансоваяНастройка.Свойство("ДетализироватьФинансовыйРезультат", ДетализироватьФинансовыйРезультат);
			СеансоваяНастройка.Свойство("РежимВалют", РежимВалют);
			СеансоваяНастройка.Свойство("Валюты", Валюты);
			СеансоваяНастройка.Свойство("ОпределениеКурса", ОпределениеКурса);
			СеансоваяНастройка.Свойство("КонтрольнаяДата", КД);
		Исключение
		КонецПопытки; 
	КонецЕсли;      
	
	ОбновитьСписокДоступныхВалют();
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьСписокДоступныхВалют() 
	
	RUB = Справочники.Валюты.НайтиПоКоду("643");   
	
	мИсключения = Валюты.ВыгрузитьЗначения(); 
	Если Не RUB.Пустая() Тогда
		мИсключения.Добавить(RUB);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Валюты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Валюты КАК Валюты
	               |ГДЕ
	               |	Валюты.ПометкаУдаления = ЛОЖЬ
	               |	И НЕ Валюты.Ссылка В (&мИсключения)";  
	
	Запрос.УстановитьПараметр("мИсключения", мИсключения);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Валюты.Добавить(Выборка.Ссылка, , Истина);
	КонецЦикла;   
	
	Валюты.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Организация", Организация);
	СтруктураНастройки.Вставить("ФормированиеОтчета", ФормированиеОтчета);
	// --- 
	СтруктураНастройки.Вставить("ВыводитьЗаголовок",ВыводитьЗаголовок);
	СтруктураНастройки.Вставить("ВыводитьФинансовыеПоказатели",ВыводитьФинансовыеПоказатели);
	СтруктураНастройки.Вставить("ВыводитьФинансовыеПоказателиПоСчетам", ВыводитьФинансовыеПоказателиПоСчетам);
	СтруктураНастройки.Вставить("ВыводитьФинансовыеПоказателиПоАктам", ВыводитьФинансовыеПоказателиПоАктам);
	СтруктураНастройки.Вставить("ВыводитьФинансовыеПоказателиПоБюджету", ВыводитьФинансовыеПоказателиПоБюджету);
	СтруктураНастройки.Вставить("КомментироватьФинансовыеПоказатели",КомментироватьФинансовыеПоказатели);
	// --- 
	СтруктураНастройки.Вставить("ВерсияБюджета", ВерсияБюджета);	
	СтруктураНастройки.Вставить("ДетализироватьДоходы", ДетализироватьДоходы);
	СтруктураНастройки.Вставить("ДетализироватьРасходы", ДетализироватьРасходы);
	СтруктураНастройки.Вставить("ДетализироватьФинансовыйРезультат", ДетализироватьФинансовыйРезультат);
	СтруктураНастройки.Вставить("РежимВалют", РежимВалют);
	СтруктураНастройки.Вставить("Валюты", Валюты);
	СтруктураНастройки.Вставить("ОпределениеКурса", ОпределениеКурса);
	СтруктураНастройки.Вставить("КонтрольнаяДата", КД);
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
	
	_Сформировать();

КонецПроцедуры

&НаСервере
Процедура _Сформировать()
	
	Результат.Очистить();
	_Настройка(Истина);
	
	ПодготовитьОтчет();
	СформироватьОтчет();
	ОбработатьОтчет();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 


// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПодготовитьОтчет()
	
	ОписаниеКолонок = ПолучитьИзВременногоХранилища(АдрОписаниеКолонок);
	
	СКД = Новый СхемаКомпоновкиДанных;
	
    ИД = СКД.ИсточникиДанных.Добавить();
    ИД.Имя = "ИсточникДанных";
    ИД.ТипИсточникаДанных = "Local";
	
    НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
    НаборДанных.Имя = "ВНД";
	НаборДанных.ИмяОбъекта = "ВНД";
    НаборДанных.ИсточникДанных = "ИсточникДанных";
	
	НаборДанных.Поля.Очистить();
	
	#Область СтандартныеПоля 
	
    НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Ссылка";
	НД_Поле.ПутьКДанным = "Ссылка";
	НД_Поле.Заголовок = "Грузоперевозка";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки");
	НД_Поле.Роль.Измерение = Истина;
	
	// --- 
	
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "Цвет";
	НД_Поле.ПутьКДанным = "Цвет";
	НД_Поле.Заголовок = "Цвет";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_Цвета");
	
	Поле_Ресурса = СКД.ПоляИтога.Добавить();
	Поле_Ресурса.ПутьКДанным = "Цвет";
	Поле_Ресурса.Выражение = "Цвет";
	Поле_Ресурса.Группировки.Добавить("Ссылка");
	
	// --- 
	
	НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НД_Поле.Поле = "ЛогистическийСтатус";
	НД_Поле.ПутьКДанным = "ЛогистическийСтатус";
	НД_Поле.Заголовок = "Логистический статус";
	НД_Поле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ЛогистическиеСтатусы"); 
	
	#КонецОбласти 
	
	#Область КолонкиЖурнала 
    СчКол = 1;
	Для Каждого Кол из ОписаниеКолонок Цикл
		
		Если (Кол.Имя <> "ссылка" И Кол.Видимость) Тогда
			
			Если (Кол.КонтрольнаяДатаГрузоперевозки И ВыводитьКонтрольныеДатыРаздельно) Тогда
				
				ФВ = ?(ЗначениеЗаполнено(Кол.Формат), Кол.Формат, Кол.ОбъектХарактеристики.ФорматВывода);
				Если НЕ ЗначениеЗаполнено(ФВ) Тогда
					Если (Кол.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата) Тогда
						ФВ = "ДЛФ=Д";
					ИначеЕсли (Кол.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.ДатаВремя) Тогда 
						ФВ = "ДЛФ=DT";
					КонецЕсли; 
				КонецЕсли;	
				
				НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
				НД_Поле.Поле = Кол.Имя+"_План";
				НД_Поле.ПутьКДанным = Кол.Имя+"_План";
				НД_Поле.Заголовок = Кол.Заголовок;
				НД_Поле.ТипЗначения = Новый ОписаниеТипов("Дата");
				Попытка
					НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", ФВ);
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
				
				Поле_Ресурса = СКД.ПоляИтога.Добавить();
				Поле_Ресурса.ПутьКДанным = Кол.Имя+"_План";
				Поле_Ресурса.Выражение = Кол.Имя+"_План";
				Поле_Ресурса.Группировки.Добавить("Ссылка");
				
				СчКол = СчКол + 1;
				
				// ---------------------------------------------------------------------------- 
				
				НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
				НД_Поле.Поле = Кол.Имя+"_Факт";
				НД_Поле.ПутьКДанным = Кол.Имя+"_Факт";
				НД_Поле.Заголовок = Кол.Заголовок;
				НД_Поле.ТипЗначения = Новый ОписаниеТипов("Дата");
				Попытка
					НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", ФВ);
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
				
				Поле_Ресурса = СКД.ПоляИтога.Добавить();
				Поле_Ресурса.ПутьКДанным = Кол.Имя+"_Факт";
				Поле_Ресурса.Выражение = Кол.Имя+"_Факт";
				Поле_Ресурса.Группировки.Добавить("Ссылка");
				
				СчКол = СчКол + 1;
				
			Иначе
				
				ФВ = ?(ЗначениеЗаполнено(Кол.Формат), Кол.Формат, Кол.ОбъектХарактеристики.ФорматВывода);
				Если НЕ ЗначениеЗаполнено(ФВ) Тогда
					Типы = Кол.ТипЗначения.Типы();
					Если (Типы.Количество() > 0) Тогда
						ТипПараметра = Типы[0];
						Если (ТипПараметра = Тип("Дата")) Тогда
							Если (Кол.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата) Тогда
								ФВ = "ДЛФ=Д";
							ИначеЕсли (Кол.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.ДатаВремя) Тогда 
								ФВ = "ДЛФ=DT";
							ИначеЕсли (Кол.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время) Тогда 
								ФВ = "ДФ=HH:mm"; 
							КонецЕсли; 
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли;	
				
				НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
				НД_Поле.Поле = Кол.Имя;
				НД_Поле.ПутьКДанным = Кол.Имя;
				НД_Поле.Заголовок = Кол.Заголовок;
				НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", ФВ);
				
				Поле_Ресурса = СКД.ПоляИтога.Добавить();
				Поле_Ресурса.ПутьКДанным = Кол.Имя;
				Поле_Ресурса.Выражение = Кол.Имя;
				Поле_Ресурса.Группировки.Добавить("Ссылка");
				
				СчКол = СчКол + 1;
				
			КонецЕсли; 
			
		КонецЕсли;	
		
	КонецЦикла;	
	#КонецОбласти 
	
	// ---------------------------------------------------------------------------- 
	
	ЖурналПереданый = ПолучитьИзВременногоХранилища(Отчет.АдресЖурналаПереданый);
	Журнал = ЖурналПереданый.Скопировать();
	Инд = 0;
	Пока Инд < Журнал.Колонки.Количество() Цикл
		Если Найти(Журнал.Колонки[Инд].Имя, "Приход") <> 0 ИЛИ Найти(Журнал.Колонки[Инд].Имя, "Расход") <> 0 ИЛИ Найти(Журнал.Колонки[Инд].Имя, "Прибыль") <> 0 Тогда
			Журнал.Колонки.Удалить(Инд);
		Иначе
			Инд = Инд + 1;
		КонецЕсли;	
	КонецЦикла;	
	
	// --- 
	
	СоответствиеФинПоказателей = Новый Соответствие;  
	СоответствиеКомментариев = Новый Соответствие;
	
	Если (ВыводитьФинансовыеПоказатели И (ВыводитьФинансовыеПоказателиПоСчетам ИЛИ ВыводитьФинансовыеПоказателиПоАктам ИЛИ ВыводитьФинансовыеПоказателиПоБюджету)) Тогда
		
		Для каждого СтрокаЖурнала Из Журнал Цикл
			
			СоответствиеФинПоказателей.Вставить(СтрокаЖурнала.Ссылка, Новый Структура("ПоСчетам,ПоАктам,ПоБюджету",Неопределено,Неопределено,Неопределено));
			Если (КомментироватьФинансовыеПоказатели) Тогда
				СоответствиеКомментариев.Вставить(СтрокаЖурнала.Ссылка, Новый Структура);
			КонецЕсли; 
			
		КонецЦикла;
		
		НоменклатураДетализации = Новый ТаблицаЗначений;
		НоменклатураДетализации.Колонки.Добавить("Вид");
		НоменклатураДетализации.Колонки.Добавить("Номенклатура");
		
		СписокКонтрагентовХолдинга = Новый Массив;
		Если ИсключатьВнутрихолдинговыеВзаиморасчеты Тогда
			СписокКонтрагентовХолдинга =  ПолучитьКонтрагентовХолдинга();
		КонецЕсли;
		
		// счета и акты
		Если (ВыводитьФинансовыеПоказателиПоСчетам ИЛИ ВыводитьФинансовыеПоказателиПоАктам) Тогда
			
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ИсключатьВнутрихолдинговыеВзаиморасчеты", 	ИсключатьВнутрихолдинговыеВзаиморасчеты);
			Запрос.УстановитьПараметр("СписокКонтрагентовХолдинга", 				СписокКонтрагентовХолдинга);
			
			Если (РежимВалют <> Неопределено) Тогда
				
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов КАК Документ,
				|	CW_ДоходыПоГрузоперевозкам.Валюта КАК Валюта,
				|	CW_ДоходыПоГрузоперевозкам.Номенклатура КАК Номенклатура,
				|	CW_ДоходыПоГрузоперевозкам.Всего_Валюта КАК Доходы_Валюта,
				|	0 КАК Расходы_Валюта,
				|	CW_ДоходыПоГрузоперевозкам.Всего КАК Доходы,
				|	0 КАК Расходы
				|ПОМЕСТИТЬ Рез
				|ИЗ
				|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
				|ГДЕ
				|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка = &Грузоперевозка
				|	И ВЫБОР
				|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Организация = &Организация
				|		КОНЕЦ
				|	И ВЫБОР
				|			КОГДА &ФормированиеОтчета = 1
				|				ТОГДА CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяАкт
				|						ИЛИ CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяСчетФактура
				|			ИНАЧЕ CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяСчет
				|		КОНЕЦ
				|	И ВЫБОР
				|			КОГДА &ИсключатьВнутрихолдинговыеВзаиморасчеты
				|				ТОГДА НЕ CW_ДоходыПоГрузоперевозкам.Контрагент В (&СписокКонтрагентовХолдинга)
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	CW_РасходыПоГрузоперевозкам.ДокументРасходов,
				|	CW_РасходыПоГрузоперевозкам.Валюта,
				|	CW_РасходыПоГрузоперевозкам.Номенклатура,
				|	0,
				|	CW_РасходыПоГрузоперевозкам.Всего_Валюта,
				|	0,
				|	CW_РасходыПоГрузоперевозкам.Всего
				|ИЗ
				|	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
				|ГДЕ
				|	CW_РасходыПоГрузоперевозкам.Грузоперевозка = &Грузоперевозка
				|	И ВЫБОР
				|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ CW_РасходыПоГрузоперевозкам.ДокументРасходов.Организация = &Организация
				|		КОНЕЦ
				|	И ВЫБОР
				|			КОГДА &ФормированиеОтчета = 1
				|				ТОГДА CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредъявленАкт
				|						ИЛИ CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредъявленСФ
				|			ИНАЧЕ CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредъявленСчет
				|		КОНЕЦ
				|	И ВЫБОР
				|			КОГДА &ИсключатьВнутрихолдинговыеВзаиморасчеты
				|				ТОГДА НЕ CW_РасходыПоГрузоперевозкам.Контрагент В (&СписокКонтрагентовХолдинга)
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Рез.Документ КАК Документ,
				|	Рез.Валюта КАК Валюта,
				|	Рез.Номенклатура КАК Номенклатура,
				|	СУММА(Рез.Доходы_Валюта) КАК Доходы_Валюта,
				|	СУММА(Рез.Расходы_Валюта) КАК Расходы_Валюта,
				|	СУММА(Рез.Доходы) КАК Доходы,
				|	СУММА(Рез.Расходы) КАК Расходы
				|ИЗ
				|	Рез КАК Рез
				|
				|СГРУППИРОВАТЬ ПО
				|	Рез.Номенклатура,
				|	Рез.Валюта,
				|	Рез.Документ
				|
				|УПОРЯДОЧИТЬ ПО
				|	Рез.Номенклатура.Наименование";
			КонецЕсли; 
			// ---------------------------------------------------------------------------- 
			ДетализироватьФинансовыеПоказатели = (ДетализироватьДоходы ИЛИ ДетализироватьРасходы ИЛИ ДетализироватьФинансовыйРезультат);
			
			Для каждого СтрокаЖурнала Из Журнал Цикл
				// --- 
				
				СтруктураФинПоказателей = СоответствиеФинПоказателей.Получить(СтрокаЖурнала.Ссылка);
				МассивТаблицАнализаНоменклатуры = Новый Массив;
				// --- 
				Запрос.УстановитьПараметр("Грузоперевозка", СтрокаЖурнала.Ссылка);	
				Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
				Если (ВыводитьФинансовыеПоказателиПоСчетам) Тогда
						
					Запрос.УстановитьПараметр("ФормированиеОтчета", 0);
					// --- 
					СтруктураФинПоказателей.ПоСчетам = Запрос.Выполнить().Выгрузить();
					// ---
					Если (ДетализироватьФинансовыеПоказатели) Тогда
						
						МассивТаблицАнализаНоменклатуры.Добавить(СтруктураФинПоказателей.ПоСчетам);
						
					КонецЕсли; 
					
				КонецЕсли; 
				Если (ВыводитьФинансовыеПоказателиПоАктам) Тогда
						
					Запрос.УстановитьПараметр("ФормированиеОтчета", 1);
					// --- 
					СтруктураФинПоказателей.ПоАктам = Запрос.Выполнить().Выгрузить();
					// --- 
					Если (ДетализироватьФинансовыеПоказатели) Тогда
						
						МассивТаблицАнализаНоменклатуры.Добавить(СтруктураФинПоказателей.ПоАктам);
						
					КонецЕсли;
					
				КонецЕсли; 
				
				Если (ДетализироватьФинансовыеПоказатели) Тогда
					
					Для каждого ТаблицаАнализа Из МассивТаблицАнализаНоменклатуры Цикл
						
						НоменклатураРезультата = ТаблицаАнализа.Скопировать(,"Номенклатура,Доходы,Расходы");
						НоменклатураРезультата.Свернуть("Номенклатура","Доходы,Расходы");
						Для каждого Стр Из НоменклатураРезультата Цикл
							Если (Стр.Доходы <> 0 ИЛИ Стр.Расходы <> 0) Тогда
								
								Если (Стр.Доходы <> 0) Тогда
									Нстр = НоменклатураДетализации.Добавить();
									Нстр.Вид = "Доходы";
									Нстр.Номенклатура = Стр.Номенклатура;
								КонецЕсли; 
								// --- 
								Если (Стр.Расходы <> 0) Тогда
									Нстр = НоменклатураДетализации.Добавить();
									Нстр.Вид = "Расходы";
									Нстр.Номенклатура = Стр.Номенклатура;
								КонецЕсли; 
								
							КонецЕсли; 
						КонецЦикла; 	
						
					КонецЦикла; 
					
				КонецЕсли; 
				
				// --- 
			КонецЦикла; // цикл по грузоперевозкам журнала
			
		КонецЕсли; 
		
		// бюджет
		Если (ВыводитьФинансовыеПоказателиПоБюджету) Тогда
			
			Запрос = Новый Запрос;  
			Запрос.УстановитьПараметр("ИсключатьВнутрихолдинговыеВзаиморасчеты", 	ИсключатьВнутрихолдинговыеВзаиморасчеты);
			Запрос.УстановитьПараметр("СписокКонтрагентовХолдинга", 				СписокКонтрагентовХолдинга);
			
			Если (РежимВалют <> Неопределено) Тогда
				Запрос.Текст =
				"ВЫБРАТЬ
				|	CW_ПлановыеСтатьиЗатратИДоходов.Валюта КАК Валюта,
				|	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура КАК Номенклатура,
				|	CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсего КАК Доходы_Валюта,
				|	0 КАК Расходы_Валюта,
				|	CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсегоРуб КАК Доходы,
				|	0 КАК Расходы,
				|	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка КАК Документ
				|ПОМЕСТИТЬ Рез
				|ИЗ
				|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
				|ГДЕ
				|	CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
				|	И CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Грузоперевозка
				|	И ВЫБОР
				|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ CW_ПлановыеСтатьиЗатратИДоходов.Организация = &Организация
				|		КОНЕЦ
				|	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = &ВидСтатьиПланированияДоход
				|	И ВЫБОР
				|			КОГДА &ИсключатьВнутрихолдинговыеВзаиморасчеты
				|				ТОГДА НЕ CW_ПлановыеСтатьиЗатратИДоходов.Контрагент В (&СписокКонтрагентовХолдинга)
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	CW_ПлановыеСтатьиЗатратИДоходов.Валюта,
				|	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура,
				|	0,
				|	CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсего,
				|	0,
				|	CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсегоРуб,
				|	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка
				|ИЗ
				|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
				|ГДЕ
				|	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Грузоперевозка
				|	И CW_ПлановыеСтатьиЗатратИДоходов.ВерсияБюджета = &ВерсияБюджета
				|	И CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования = &ВидСтатьиПланированияРасход
				|	И ВЫБОР
				|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
				|				ТОГДА ИСТИНА
				|			ИНАЧЕ CW_ПлановыеСтатьиЗатратИДоходов.Организация = &Организация
				|		КОНЕЦ
				|	И ВЫБОР
				|			КОГДА &ИсключатьВнутрихолдинговыеВзаиморасчеты
				|				ТОГДА НЕ CW_ПлановыеСтатьиЗатратИДоходов.Контрагент В (&СписокКонтрагентовХолдинга)
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Рез.Валюта КАК Валюта,
				|	Рез.Номенклатура КАК Номенклатура,
				|	Рез.Документ КАК Документ,
				|	Рез.Доходы_Валюта КАК Доходы_Валюта,
				|	Рез.Расходы_Валюта КАК Расходы_Валюта,
				|	Рез.Доходы КАК Доходы,
				|	Рез.Расходы КАК Расходы
				|ИЗ
				|	Рез КАК Рез";
			КонецЕсли;
			
			ДетализироватьФинансовыеПоказатели = (ДетализироватьДоходы ИЛИ ДетализироватьРасходы ИЛИ ДетализироватьФинансовыйРезультат);
			
			Для каждого СтрокаЖурнала Из Журнал Цикл
				
				СтруктураФинПоказателей = СоответствиеФинПоказателей.Получить(СтрокаЖурнала.Ссылка);
				МассивТаблицАнализаНоменклатуры = Новый Массив;
				
				Запрос.УстановитьПараметр("Грузоперевозка", СтрокаЖурнала.Ссылка);	
				Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));	
				Запрос.УстановитьПараметр("ВерсияБюджета", ВерсияБюджета);	
				Запрос.УстановитьПараметр("ВидСтатьиПланированияДоход", Перечисления.CW_ВидыСтатейПланирования.Доходы);
				Запрос.УстановитьПараметр("ВидСтатьиПланированияРасход", Перечисления.CW_ВидыСтатейПланирования.Расходы);
				
				СтруктураФинПоказателей.ПоБюджету = Запрос.Выполнить().Выгрузить();
				// ---
				
				Если (ДетализироватьФинансовыеПоказатели) Тогда
					
					МассивТаблицАнализаНоменклатуры.Добавить(СтруктураФинПоказателей.ПоБюджету);
					Для каждого ТаблицаАнализа Из МассивТаблицАнализаНоменклатуры Цикл
						
						НоменклатураРезультата = ТаблицаАнализа.Скопировать(,"Номенклатура,Доходы,Расходы");
						НоменклатураРезультата.Свернуть("Номенклатура","Доходы,Расходы");
						Для каждого Стр Из НоменклатураРезультата Цикл
							Если (Стр.Доходы <> 0 ИЛИ Стр.Расходы <> 0) Тогда
								
								Если (Стр.Доходы <> 0) Тогда
									Нстр = НоменклатураДетализации.Добавить();
									Нстр.Вид = "Доходы";
									Нстр.Номенклатура = Стр.Номенклатура;
								КонецЕсли; 
								// --- 
								Если (Стр.Расходы <> 0) Тогда
									Нстр = НоменклатураДетализации.Добавить();
									Нстр.Вид = "Расходы";
									Нстр.Номенклатура = Стр.Номенклатура;
								КонецЕсли; 
								
							КонецЕсли; 
						КонецЦикла; 	
						
					КонецЦикла; 
					
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли; 
		
		// --- 
		
		// теперь формируем списки доп. колонок
		// ---------------------------------------------------------------------------- 
		НоменклатураДетализации.Свернуть("Вид,Номенклатура");
		// --- 
		СписокДопКолонокРасходов.Очистить();
		Если (ДетализироватьРасходы) Тогда
			НоменклатураДетализацииРасходов = НоменклатураДетализации.Скопировать(Новый Структура("Вид","Расходы"));
			СписокДопКолонокРасходов.ЗагрузитьЗначения(НоменклатураДетализацииРасходов.ВыгрузитьКолонку("Номенклатура"));
		КонецЕсли; 
		// --- 
		СписокДопКолонокДоходов.Очистить();
		Если (ДетализироватьДоходы) Тогда
			НоменклатураДетализацииДоходов = НоменклатураДетализации.Скопировать(Новый Структура("Вид","Доходы"));
			СписокДопКолонокДоходов.ЗагрузитьЗначения(НоменклатураДетализацииДоходов.ВыгрузитьКолонку("Номенклатура"));
		КонецЕсли; 
		// --- 
		СписокДопКолонокПрибыли.Очистить();;
		Если (ДетализироватьФинансовыйРезультат) Тогда
			
			НоменклатураДетализацииПрибыли = НоменклатураДетализации.Скопировать();
			НоменклатураДетализацииПрибыли.Свернуть("Номенклатура");
			СписокДопКолонокПрибыли.ЗагрузитьЗначения(НоменклатураДетализацииПрибыли.ВыгрузитьКолонку("Номенклатура"));
			
		КонецЕсли; 
		
		// формируем колонки и поля компоновщика
		// ---------------------------------------------------------------------------- 
		
		СписокДопКолонокРасходов.СортироватьПоПредставлению();
		СписокДопКолонокРасходов.Добавить(Справочники.Номенклатура.ПустаяСсылка(),"Всего");
		// --- 
		СписокДопКолонокДоходов.СортироватьПоПредставлению();
		СписокДопКолонокДоходов.Добавить(Справочники.Номенклатура.ПустаяСсылка(),"Всего");
		// --- 
		СписокДопКолонокПрибыли.СортироватьПоПредставлению();
		СписокДопКолонокПрибыли.Добавить(Справочники.Номенклатура.ПустаяСсылка(),"Всего");
		
		МассивКлючевыхПоказателей = Новый Массив;
		МассивКлючевыхПоказателей.Добавить("Расход");
		МассивКлючевыхПоказателей.Добавить("Доход");
		МассивКлючевыхПоказателей.Добавить("Прибыль");
		
		МассивФинансовыхПоказателей = Новый Массив;
		Если (ВыводитьФинансовыеПоказателиПоСчетам) Тогда
			МассивФинансовыхПоказателей.Добавить("ПоСчетам");
		КонецЕсли; 
		Если (ВыводитьФинансовыеПоказателиПоАктам) Тогда
			МассивФинансовыхПоказателей.Добавить("ПоАктам");
		КонецЕсли; 
		Если (ВыводитьФинансовыеПоказателиПоБюджету) Тогда
			МассивФинансовыхПоказателей.Добавить("ПоБюджету");
		КонецЕсли; 
		
		// формируем массив валют
		БазоваяВалюта = CW_Настройки.ВалютаРегламентированногоУчета();
		СписокВалют.Очистить();
		ДетализацияПоВалютам = (РежимВалют <> 0);
		Если (НЕ ДетализацияПоВалютам) Тогда
			СписокВалют.Добавить(БазоваяВалюта,Строка(БазоваяВалюта.Код));
		Иначе
			Для каждого СтрВалюта Из Валюты Цикл
				Если (СтрВалюта.Пометка) Тогда
					СписокВалют.Добавить(СтрВалюта.Значение,Строка(СтрВалюта.Значение.Код));
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		
		МассивДобавленныхКолонок = Новый Массив;
		
		// Расход - Приход - Прибыль
		Для каждого КлючевойПоказатель Из МассивКлючевыхПоказателей Цикл
			
			Если (КлючевойПоказатель = "Расход") Тогда
				СписокДопКолонок = СписокДопКолонокРасходов;
			КонецЕсли;
			Если (КлючевойПоказатель = "Доход") Тогда
				СписокДопКолонок = СписокДопКолонокДоходов;
			КонецЕсли;
			Если (КлючевойПоказатель = "Прибыль") Тогда
				СписокДопКолонок = СписокДопКолонокПрибыли;
			КонецЕсли;
			
			// ПоСчетам - ПоАктам - ПоБюджету
			Для каждого ФинансовыйПоказатель Из МассивФинансовыхПоказателей Цикл
				
				Индекс = 1;
				// цикл по колонкам
				Для каждого СтрКолонка Из СписокДопКолонок Цикл
					
					// цикл по валютам
					Для каждого СтрВалюта Из СписокВалют Цикл
						
						Если (СтрКолонка.Представление <> "Всего") Тогда
							ИмяКолонки = КлючевойПоказатель+"_"+ФинансовыйПоказатель+"_"+Строка(Индекс)+"_"+СтрВалюта.Представление;
						Иначе
							ИмяКолонки = КлючевойПоказатель+"_"+ФинансовыйПоказатель+"_"+"Всего"+"_"+СтрВалюта.Представление;
						КонецЕсли; 
						
						Журнал.Колонки.Добавить(ИмяКолонки);
						МассивДобавленныхКолонок.Добавить(ИмяКолонки);
						
						НД_Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
						НД_Поле.Поле = ИмяКолонки;
						НД_Поле.ПутьКДанным = ИмяКолонки;
						НД_Поле.Заголовок = СтрВалюта.Представление;
						НД_Поле.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=2;ЧН=-");
						
						Поле_Ресурса = СКД.ПоляИтога.Добавить();
						Поле_Ресурса.ПутьКДанным = ИмяКолонки;
						Поле_Ресурса.Выражение = "Сумма("+ИмяКолонки+")";
						Поле_Ресурса.Группировки.Добавить("Ссылка");
						Поле_Ресурса.Группировки.Добавить("ОбщийИтог");
						
					КонецЦикла; 
					
					// --- 
					_сф.Инкремент(Индекс);
					
				КонецЦикла; 
				
			КонецЦикла; 
			
		КонецЦикла; 
		
		// обнуляем новые колонки
		Журнал.ЗаполнитьЗначения(0,_сф.м_Представление(МассивДобавленныхКолонок,","));
		
		// ЗАПОЛНЯЕМ ТАБЛИЦУ ДАННЫМИ
		// ---------------------------------------------------------------------------- 
		Для каждого СтрокаЖурнала Из Журнал Цикл
			
			СтруктураФинПоказателей = СоответствиеФинПоказателей.Получить(СтрокаЖурнала.Ссылка);
			Если (КомментироватьФинансовыеПоказатели) Тогда
				СтруктураКомментариев = СоответствиеКомментариев.Получить(СтрокаЖурнала.Ссылка);	
			КонецЕсли; 
			ДатаГП = СтрокаЖурнала.Ссылка.ДатаСделкиФ;
			
			// определим дату курса и курсы валют для варианта определения курса по контрольной дате
			ОпределениеКурсовПоДатеДокументов = (ОпределениеКурса = 0 ИЛИ РежимВалют = 0);    // Изменено Севостьянов ОпределениеКурсовПоДатеДокументов = (ОпределениеКурса = 0);
			Если (ДетализацияПоВалютам И НЕ ОпределениеКурсовПоДатеДокументов) Тогда
				
				ДатаКурса = ОпределитьДатуКурса(СтрокаЖурнала.Ссылка);
				СоответствиеКурсов = Новый Соответствие;
				Для каждого СтрВалюта Из Валюты Цикл   // Изменено Севостьянов Для каждого СтрВалюта Из СписокВалют Цикл
					
					СоответствиеКурсов.Вставить(СтрВалюта.Значение, CW_Финансы.ПолучитьКурсВалюты(СтрВалюта.Значение,ДатаКурса));  // Изменено Севостьянов СоответствиеКурсов.Вставить(СтрВалюта.Значение, CW_Финансы.ПолучитьКурсВалюты(СтрВалюта,ДатаКурса));
					
				КонецЦикла; 
				
			КонецЕсли; 
			
			// цикл по фин. показателям: ПоСчетам - ПоАктам - ПоБюджету 
			Для каждого ФинансовыйПоказатель Из МассивФинансовыхПоказателей Цикл
				
				ТаблицаФинПоказателя = СтруктураФинПоказателей[ФинансовыйПоказатель];
				ТЗ = ТаблицаФинПоказателя.Скопировать();
				//ТЗ.Свернуть("Номенклатура","Расходы,Доходы");
				МассивНовыхКолонок = Новый Массив;
				Для каждого СтрВалюта Из СписокВалют Цикл
					МассивНовыхКолонок.Добавить("Доход_"+СтрВалюта.Представление);
					МассивНовыхКолонок.Добавить("Расход_"+СтрВалюта.Представление);
					МассивНовыхКолонок.Добавить("Прибыль_"+СтрВалюта.Представление);	
				КонецЦикла; 
				Для каждого Колонка Из МассивНовыхКолонок Цикл
					ТЗ.Колонки.Добавить(Колонка);
				КонецЦикла;
				ТЗ.ЗаполнитьЗначения(0,_сф.м_Представление(МассивНовыхКолонок,","));
				// --- 
				
				// заполняем значения новых колонок по валютам
				Для каждого СтрВалюта Из СписокВалют Цикл
					
					// заполняем значения колонок
					Для каждого Стр Из ТЗ Цикл
						
						ИмяКолонкиРасход = "Расход_"+Строка(СтрВалюта.Значение.Код);
						ИмяКолонкиДоход = "Доход_"+Строка(СтрВалюта.Значение.Код);
						ИмяКолонкиПрибыль = "Прибыль_"+Строка(СтрВалюта.Значение.Код);
						
						Если (СтрВалюта.Значение = Стр.Валюта) Тогда
							
							Стр[ИмяКолонкиРасход]=Стр.Расходы_Валюта;
							Стр[ИмяКолонкиДоход]=Стр.Доходы_Валюта;
							Стр[ИмяКолонкиПрибыль]=Стр[ИмяКолонкиДоход] - Стр[ИмяКолонкиРасход];
							
						Иначе
							
							Если (ФинансовыйПоказатель = "ПоСчетам") Тогда
								
								// пересчитываем из валютной суммы в нужную валюту
								Если (ОпределениеКурсовПоДатеДокументов) Тогда
									
									Если (СтрВалюта.Значение = БазоваяВалюта) Тогда
										
										Стр[ИмяКолонкиРасход]=Стр.Расходы;
										Стр[ИмяКолонкиДоход]=Стр.Доходы;
										Стр[ИмяКолонкиПрибыль]=Стр[ИмяКолонкиДоход] - Стр[ИмяКолонкиРасход];
										
									Иначе
										
										// !!! для пакетника берем курс на дату АКТА !!!
										Если (ЗначениеЗаполнено(Стр.Документ.ДатаАкта)) Тогда
											ДатаКурса = Стр.Документ.ДатаАкта;	
										Иначе
											ДатаКурса = Стр.Документ.ДатаСчета;	
										КонецЕсли; 
										
										СКИ = CW_Финансы.ПолучитьКурсВалюты(Стр.Валюта, ДатаКурса);
										СКЦ = CW_Финансы.ПолучитьКурсВалюты(СтрВалюта.Значение, ДатаКурса);
										// --- 
										Стр[ИмяКолонкиРасход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Расходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
										Стр[ИмяКолонкиДоход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Доходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
										Стр[ИмяКолонкиПрибыль]=Стр[ИмяКолонкиДоход] - Стр[ИмяКолонкиРасход];
										
									КонецЕсли;
									
								Иначе
									
									СКИ = СоответствиеКурсов.Получить(Стр.Валюта);
									СКЦ = СоответствиеКурсов.Получить(СтрВалюта.Значение);
									// --- 
									Стр[ИмяКолонкиРасход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Расходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
									Стр[ИмяКолонкиДоход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Доходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
									Стр[ИмяКолонкиПрибыль]=Стр[ИмяКолонкиДоход] - Стр[ИмяКолонкиРасход];
									
								КонецЕсли; 
								
							КонецЕсли; 
							// --- 
							Если (ФинансовыйПоказатель = "ПоАктам") Тогда
								
								// пересчитываем из валютной суммы в нужную валюту
								Если (ОпределениеКурсовПоДатеДокументов) Тогда
									
									Если (СтрВалюта.Значение = БазоваяВалюта) Тогда
										
										Стр[ИмяКолонкиРасход]=Стр.Расходы;
										Стр[ИмяКолонкиДоход]=Стр.Доходы;
										Стр[ИмяКолонкиПрибыль]=Стр[ИмяКолонкиДоход] - Стр[ИмяКолонкиРасход];
										
									Иначе
										
										Если (ЗначениеЗаполнено(Стр.Документ.ДатаАкта)) Тогда
											ДатаКурса = Стр.Документ.ДатаАкта;	
										Иначе
											ДатаКурса = Стр.Документ.Дата; // входящие документы без акта в этом разделе идут лесом
										КонецЕсли; 
										// --- 
										СКИ = CW_Финансы.ПолучитьКурсВалюты(Стр.Валюта, ДатаКурса);
										СКЦ = CW_Финансы.ПолучитьКурсВалюты(СтрВалюта.Значение, ДатаКурса);
										// --- 
										Стр[ИмяКолонкиРасход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Расходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
										Стр[ИмяКолонкиДоход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Доходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
										Стр[ИмяКолонкиПрибыль]=Стр[ИмяКолонкиДоход] - Стр[ИмяКолонкиРасход];
										
									КонецЕсли; 
									
								Иначе
									
									СКИ = СоответствиеКурсов.Получить(Стр.Валюта);
									СКЦ = СоответствиеКурсов.Получить(СтрВалюта.Значение);
									
									// --- 
									Стр[ИмяКолонкиРасход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Расходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
									Стр[ИмяКолонкиДоход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Доходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
									Стр[ИмяКолонкиПрибыль]=Стр[ИмяКолонкиДоход] - Стр[ИмяКолонкиРасход];
									
								КонецЕсли; 
								
							КонецЕсли; 
							// --- 
							Если (ФинансовыйПоказатель = "ПоБюджету") Тогда
								
								Если (ОпределениеКурсовПоДатеДокументов) Тогда
									
									Если (СтрВалюта.Значение = БазоваяВалюта) Тогда
										
										Стр[ИмяКолонкиРасход]=Стр.Расходы;
										Стр[ИмяКолонкиДоход]=Стр.Доходы;
										Стр[ИмяКолонкиПрибыль]=Стр[ИмяКолонкиДоход] - Стр[ИмяКолонкиРасход];
										
									Иначе
										
										ДатаКурса = ДатаГП;
										СКИ = CW_Финансы.ПолучитьКурсВалюты(Стр.Валюта, ДатаКурса);
										СКЦ = CW_Финансы.ПолучитьКурсВалюты(СтрВалюта.Значение, ДатаКурса);
										// --- 
										Стр[ИмяКолонкиРасход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Расходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
										Стр[ИмяКолонкиДоход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Доходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
										Стр[ИмяКолонкиПрибыль]=Стр[ИмяКолонкиДоход] - Стр[ИмяКолонкиРасход];
										
									КонецЕсли; 
									
								Иначе
									
									СКИ = СоответствиеКурсов.Получить(Стр.Валюта);
									СКЦ = СоответствиеКурсов.Получить(СтрВалюта.Значение);
									// --- 
									Стр[ИмяКолонкиРасход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Расходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
									Стр[ИмяКолонкиДоход]=CW_Финансы.ПересчитатьИзВалютыВВалюту(Стр.Доходы_Валюта,Стр.Валюта,СтрВалюта.Значение,СКИ.Курс,СКЦ.Курс,СКИ.Кратность,СКЦ.Кратность);
									Стр[ИмяКолонкиПрибыль]=Стр[ИмяКолонкиДоход] - Стр[ИмяКолонкиРасход];
									
								КонецЕсли; 
								
							КонецЕсли; 
							
						КонецЕсли; 
						
					КонецЦикла; 
					
				КонецЦикла; 
				
				
				ТЗД = ТЗ.Скопировать();
				ТЗД.Свернуть("Номенклатура",_сф.м_Представление(МассивНовыхКолонок,","));
				
				// комментарии едины для раскладкам по валюте, будем кешировать
				Если (КомментироватьФинансовыеПоказатели) Тогда
					
					СоответствиеКомментариевПоНоменклатуре = Новый Соответствие;
					
				КонецЕсли; 
				
				// делаем свертку и формируем значения для журнала
				Для каждого СтрВалюта Из СписокВалют Цикл
					
					ИмяКолонкиРасход = "Расход_"+Строка(СтрВалюта.Значение.Код);
					ИмяКолонкиДоход = "Доход_"+Строка(СтрВалюта.Значение.Код);
					ИмяКолонкиПрибыль = "Прибыль_"+Строка(СтрВалюта.Значение.Код);
					
					// распределяем детальные записи
					Если (ДетализироватьРасходы ИЛИ ДетализироватьДоходы ИЛИ ДетализироватьФинансовыйРезультат) Тогда
						
						Для каждого Стр Из ТЗД Цикл
							
							Если (КомментироватьФинансовыеПоказатели) Тогда
								СтруктураКомментариевПоНоменклатуре = СоответствиеКомментариевПоНоменклатуре.Получить(Стр.Номенклатура);
								Если (СтруктураКомментариевПоНоменклатуре = Неопределено) Тогда
									СоответствиеКомментариевПоНоменклатуре.Вставить(Стр.Номенклатура, Новый Структура("Расход,Доход"));	
									СтруктураКомментариевПоНоменклатуре = СоответствиеКомментариевПоНоменклатуре.Получить(Стр.Номенклатура);
								КонецЕсли; 
							КонецЕсли; 
							
							Если (Стр[ИмяКолонкиРасход] <> 0 И ДетализироватьРасходы) Тогда
								
								КлючевойПоказатель = "Расход";
								Индекс = СписокДопКолонокРасходов.Индекс(СписокДопКолонокРасходов.НайтиПоЗначению(Стр.Номенклатура))+1;
								ИмяКолонки = КлючевойПоказатель+"_"+ФинансовыйПоказатель+"_"+Строка(Индекс)+"_"+СтрВалюта.Представление;
								// --- 
								СтрокаЖурнала[ИмяКолонки] = Стр[ИмяКолонкиРасход];
								Если (КомментироватьФинансовыеПоказатели) Тогда
									Если (СтруктураКомментариевПоНоменклатуре[КлючевойПоказатель] = Неопределено) Тогда
										СтруктураКомментариевПоНоменклатуре[КлючевойПоказатель] = СформироватьКомментарийЯчейки(ТЗ, Стр.Номенклатура, КлючевойПоказатель, ФинансовыйПоказатель, БазоваяВалюта);
									КонецЕсли; 
									СтруктураКомментариев.Вставить(ИмяКолонки, СтруктураКомментариевПоНоменклатуре[КлючевойПоказатель]);
								КонецЕсли; 
								
							КонецЕсли; 
							// --- 
							Если (Стр[ИмяКолонкиДоход] <> 0 И ДетализироватьДоходы) Тогда
								
								КлючевойПоказатель = "Доход";
								Индекс = СписокДопКолонокДоходов.Индекс(СписокДопКолонокДоходов.НайтиПоЗначению(Стр.Номенклатура))+1;
								ИмяКолонки = КлючевойПоказатель+"_"+ФинансовыйПоказатель+"_"+Строка(Индекс)+"_"+СтрВалюта.Представление;
								// --- 
								СтрокаЖурнала[ИмяКолонки] = Стр[ИмяКолонкиДоход];
								Если (КомментироватьФинансовыеПоказатели) Тогда
									Если (СтруктураКомментариевПоНоменклатуре[КлючевойПоказатель] = Неопределено) Тогда
										СтруктураКомментариевПоНоменклатуре[КлючевойПоказатель] = СформироватьКомментарийЯчейки(ТЗ, Стр.Номенклатура, КлючевойПоказатель, ФинансовыйПоказатель, БазоваяВалюта);
									КонецЕсли; 
									СтруктураКомментариев.Вставить(ИмяКолонки, СтруктураКомментариевПоНоменклатуре[КлючевойПоказатель]);
								КонецЕсли;
								
							КонецЕсли; 
							// --- 
							Если (Стр[ИмяКолонкиПрибыль] <> 0 И ДетализироватьФинансовыйРезультат) Тогда
								
								КлючевойПоказатель = "Прибыль";
								Индекс = СписокДопКолонокПрибыли.Индекс(СписокДопКолонокПрибыли.НайтиПоЗначению(Стр.Номенклатура))+1;
								ИмяКолонки = КлючевойПоказатель+"_"+ФинансовыйПоказатель+"_"+Строка(Индекс)+"_"+СтрВалюта.Представление;
								// --- 
								СтрокаЖурнала[ИмяКолонки] = Стр[ИмяКолонкиПрибыль];
								
							КонецЕсли; 
							
						КонецЦикла; 
						
					КонецЕсли; 
					
					// пишем итоговые записи
					КлючевойПоказатель = "Расход";
					ИмяКолонки = КлючевойПоказатель+"_"+ФинансовыйПоказатель+"_"+"Всего"+"_"+СтрВалюта.Представление;
					СтрокаЖурнала[ИмяКолонки] = ТЗД.Итог(ИмяКолонкиРасход);
					// --- 
					КлючевойПоказатель = "Доход";
					ИмяКолонки = КлючевойПоказатель+"_"+ФинансовыйПоказатель+"_"+"Всего"+"_"+СтрВалюта.Представление;
					СтрокаЖурнала[ИмяКолонки] = ТЗД.Итог(ИмяКолонкиДоход);
					// --- 
					КлючевойПоказатель = "Прибыль";
					ИмяКолонки = КлючевойПоказатель+"_"+ФинансовыйПоказатель+"_"+"Всего"+"_"+СтрВалюта.Представление;
					СтрокаЖурнала[ИмяКолонки] = ТЗД.Итог(ИмяКолонкиПрибыль);
					
				КонецЦикла; 
				
			КонецЦикла; 
			
		КонецЦикла; 
		
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	АдрЖурнал = ПоместитьВоВременноеХранилище(Журнал, ЭтаФорма.УникальныйИдентификатор);	
	АдрСоответствиеКомментариев = ПоместитьВоВременноеХранилище(СоответствиеКомментариев,ЭтаФорма.УникальныйИдентификатор);
	Отчет.АдресСхемы = ПоместитьВоВременноеХранилище(СКД, ЭтаФорма.УникальныйИдентификатор);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтрагентовХолдинга()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_СоответствиеОрганизацийКонтрагентам.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.CW_СоответствиеОрганизацийКонтрагентам КАК CW_СоответствиеОрганизацийКонтрагентам"; 
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контрагент");

КонецФункции

&НаСервере
Функция СформироватьКомментарийЯчейки(ТаблицаДанных, Номенклатура, КлючевойПоказатель, ФинансовыйПоказатель, БазоваяВалюта)
	// --- 
	
	Отбор = Новый Структура("Номенклатура", Номенклатура);
	ТаблицаОтбора = ТаблицаДанных.Скопировать(Отбор);
	
	Примечание = "";
	Если ТаблицаОтбора.Количество() > 0 Тогда
		
		Для Каждого Стр из ТаблицаОтбора Цикл
			
			ВалютаСтроки = Стр.Валюта;
			
			Если (КлючевойПоказатель = "Доход") Тогда
				
				КолонкаСуммы = "Доходы_Валюта";
				
			ИначеЕсли (КлючевойПоказатель = "Расход") Тогда 
				
				КолонкаСуммы = "Расходы_Валюта"; 
				
			КонецЕсли; 
			
			Если (ФинансовыйПоказатель = "ПоСчетам") Тогда
				
				НачалоПримечания = "Счёт №"+Стр.Документ.НомерСчета+" от "+ Формат(Стр.Документ.ДатаСчета, "ДЛФ=Д")+ " = " + Формат(Стр[КолонкаСуммы], "ЧДЦ=2") +" "+ Стр.Валюта.Наименование + " (" +Стр.Документ.Контрагент  + ")";
				
			ИначеЕсли (ФинансовыйПоказатель = "ПоАктам") Тогда 
				
				НачалоПримечания = "Акт №"+Стр.Документ.НомерАкта+" от "+ Формат(Стр.Документ.ДатаАкта, "ДЛФ=Д")+ " = " +Формат(Стр[КолонкаСуммы], "ЧДЦ=2") +" "+ Стр.Валюта.Наименование + " (" +Стр.Документ.Контрагент + ")";
				
			ИначеЕсли (ФинансовыйПоказатель = "ПоБюджету") Тогда 
				
				НачалоПримечания = Формат(Стр[КолонкаСуммы], "ЧДЦ=2") +" "+ Стр.Валюта.Наименование + " ("+ ?(ЗначениеЗаполнено(Стр.Документ.Контрагент), Стр.Документ.Контрагент.Наименование, "<?>")+")"; 
				
			КонецЕсли; 
			
			Если (Стр[КолонкаСуммы] <> 0) Тогда
				
				Примечание = Примечание + НачалоПримечания +  Символы.ПС;
				
			КонецЕсли; 
			
		КонецЦикла;	
		Если (ЗначениеЗаполнено(Примечание)) Тогда
			Примечание = Сред(Примечание, 1, СтрДлина(Примечание) - 1);
		КонецЕсли; 
		
	КонецЕсли;	
	
	Возврат(Примечание);
	
	// --- 
КонецФункции
 

&НаСервере
Функция СформироватьОтчет()

	//ПодготовитьОтчет();
	
	Журнал = ПолучитьИзВременногоХранилища(АдрЖурнал);	
	Если (ВыводитьКонтрольныеДатыРаздельно) Тогда
		
		ОписаниеКолонок = ПолучитьИзВременногоХранилища(АдрОписаниеКолонок);
		МассивКД = Новый Массив;
		Для каждого Кол Из ОписаниеКолонок Цикл
			
			Если (Кол.КонтрольнаяДатаГрузоперевозки И Кол.Видимость) Тогда
				МассивКД.Добавить(Кол);
			КонецЕсли; 
			
		КонецЦикла; 
		
		Для каждого Кол Из МассивКД Цикл
			
			ИмяПлан = Кол.Имя+"_План";
			ИмяФакт = Кол.Имя+"_Факт";
			// --- 
			Журнал.Колонки.Удалить(Журнал.Колонки.Найти(ИмяПлан));
			Журнал.Колонки.Удалить(Журнал.Колонки.Найти(ИмяФакт));
			// --- 
			Журнал.Колонки.Добавить(ИмяПлан);
			Журнал.Колонки.Добавить(ИмяФакт);
			
		КонецЦикла; 
		
		// получаем значения контрольных дат из грузоперевозок
		Для каждого Стр Из Журнал Цикл
			
			Для каждого Кол Из МассивКД Цикл
				
				Отбор = Новый Структура("Параметр",Кол.ОбъектХарактеристики);
				СтрокаГП = _сф.к_НайтиСтроку(Стр.ссылка.ПараметрыГрузоперевозки,Отбор);
				ИмяПлан = Кол.Имя+"_План";
				ИмяФакт = Кол.Имя+"_Факт";
				Если (СтрокаГП <> Неопределено) Тогда
					
					Стр[ИмяПлан] = СтрокаГП.ЗначениеПлан;
					Стр[ИмяФакт] = СтрокаГП.ЗначениеФакт;
					
				Иначе
					
					Стр[ИмяПлан]=Дата(1,1,1);
					Стр[ИмяФакт]=Дата(1,1,1);
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	ВНД = Новый Структура("ВНД", Журнал);
	
	СКД = ПолучитьИзВременногоХранилища(Отчет.АдресСхемы);
	
	НастройкиСКД = УстановитьНастройкиСКД();
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиСКД);
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДР = Новый ДанныеРасшифровкиКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкиСКД, ДР);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВНД, ДР, Истина);
		
	Результат = Новый ТабличныйДокумент;
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(Результат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Отчет.АдресРасшифровки = ПоместитьВоВременноеХранилище(ДР, ЭтаФорма.УникальныйИдентификатор);	
	
	// --- 
	_СохранитьСеансовуюНастройку();
		
КонецФункции

&НаСервере
Функция УстановитьНастройкиСКД()
	
	ОписаниеКолонок = ПолучитьИзВременногоХранилища(АдрОписаниеКолонок);
	
	СКД = ПолучитьИзВременногоХранилища(Отчет.АдресСхемы);
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	НастройкиСКД = Компоновщик.Настройки;

	НастройкиСКД.Структура.Очистить();
	
	НоваяГруппировка = НастройкиСКД.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	НоваяГруппировка.Использование = Истина;
	ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
	НовоеАвтоПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	НовоеАвтоПолеВыбора.Использование = Истина;
	НоваяГруппировка.Имя = "Грузоперевозка";
	НоваяГруппировка.Использование = Истина;
	
	НастройкиСКД.Выбор.Элементы.Очистить();
	
	// --- 
	
	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВП.Использование = Ложь;
	ВП.Заголовок = "Логистический статус";
	ВП.Поле = Новый ПолеКомпоновкиДанных("ЛогистическийСтатус");	
	
	ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВП.Использование = Ложь;
	ВП.Заголовок = "Цвет";
	ВП.Поле = Новый ПолеКомпоновкиДанных("Цвет");	
	
	// КОЛОНКИ ЖУРНАЛА
	Для Каждого Кол из ОписаниеКолонок Цикл
		
		Если (Кол.Имя <> "ссылка" И Кол.Имя <> "Ссылка" И Кол.Видимость) Тогда
			
			// для контрольных дат смотрим режим вывода
			Если (Кол.КонтрольнаяДатаГрузоперевозки И ВыводитьКонтрольныеДатыРаздельно) Тогда
				
				// план
				ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				ВП.Использование = Истина;
				ВП.Заголовок = Кол.Заголовок+" (план)";
				ВП.Поле = Новый ПолеКомпоновкиДанных(Кол.Имя+"_План");	
				
				// факт
				ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				ВП.Использование = Истина;
				ВП.Заголовок = Кол.Заголовок+" (факт)";
				ВП.Поле = Новый ПолеКомпоновкиДанных(Кол.Имя+"_Факт");
				
			Иначе
				
				ВП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				ВП.Использование = Истина;
				ВП.Заголовок = Кол.Заголовок;
				ВП.Поле = Новый ПолеКомпоновкиДанных(Кол.Имя);
				
			КонецЕсли; 
			
			
		КонецЕсли;
		
	КонецЦикла;	
	
	// КОЛОНКИ ФИНАНСОВЫХ ПОКАЗАТЕЛЕЙ
	Если (ВыводитьФинансовыеПоказатели) Тогда
		
		КоличествоСформированныхКолонокФинансов=0;
		
		МассивКлючевыхПоказателей = Новый Массив;
		МассивКлючевыхПоказателей.Добавить("Расход");
		МассивКлючевыхПоказателей.Добавить("Доход");
		МассивКлючевыхПоказателей.Добавить("Прибыль");
		
		МассивФинансовыхПоказателей = Новый Массив;
		Если (ВыводитьФинансовыеПоказателиПоСчетам) Тогда
			МассивФинансовыхПоказателей.Добавить("ПоСчетам");
		КонецЕсли; 
		Если (ВыводитьФинансовыеПоказателиПоАктам) Тогда
			МассивФинансовыхПоказателей.Добавить("ПоАктам");
		КонецЕсли; 
		Если (ВыводитьФинансовыеПоказателиПоБюджету) Тогда
			МассивФинансовыхПоказателей.Добавить("ПоБюджету");
		КонецЕсли; 
		
		БазоваяВалюта = CW_Настройки.ВалютаРегламентированногоУчета();
		СписокВалют = Новый СписокЗначений;
		ДетализацияПоВалютам = (РежимВалют <> 0);
		Если (НЕ ДетализацияПоВалютам) Тогда
			СписокВалют.Добавить(БазоваяВалюта,Строка(БазоваяВалюта.Код));
		Иначе
			Для каждого СтрВалюта Из Валюты Цикл
				Если (СтрВалюта.Пометка) Тогда
					СписокВалют.Добавить(СтрВалюта.Значение,Строка(СтрВалюта.Значение.Код));
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
		
		// ---------------------------------------------------------------------------- 
		
		Для каждого КлючевойПоказатель Из МассивКлючевыхПоказателей Цикл // Расход - Доход - Прибыль
			
			Если (КлючевойПоказатель = "Расход") Тогда
				СписокДопКолонок = СписокДопКолонокРасходов;
			КонецЕсли;
			Если (КлючевойПоказатель = "Доход") Тогда
				СписокДопКолонок = СписокДопКолонокДоходов;
			КонецЕсли;
			Если (КлючевойПоказатель = "Прибыль") Тогда
				СписокДопКолонок = СписокДопКолонокПрибыли;
			КонецЕсли;
			
			ГруппаКП = НастройкиСКД.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
			ГруппаКП.Использование = Истина;
			ГруппаКП.Заголовок = КлючевойПоказатель;
			
			Индекс = 1;
			
			Для каждого Номенклатура Из СписокДопКолонок Цикл // доп. колонки
				
				ГруппаНП = ГруппаКП.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
				ГруппаНП.Использование = Истина;
				Если (Номенклатура.Представление = "Всего") Тогда
					ИндексСтрокой = "Всего";
					ЗаголовокНоменклатуры = "Всего";
				Иначе
					ИндексСтрокой = Строка(Индекс);
					ЗаголовокНоменклатуры = Строка(Номенклатура.Значение);
				КонецЕсли; 
				ГруппаНП.Заголовок = ЗаголовокНоменклатуры;
				
				Для каждого ФинансовыйПоказатель Из МассивФинансовыхПоказателей Цикл // финансовые показатели
					
					Если (ФинансовыйПоказатель = "ПоСчетам") Тогда
						
						ЗаголовокФинансовогоПоказателя = "Счета";
						
					ИначеЕсли (ФинансовыйПоказатель = "ПоАктам") Тогда 
						
						ЗаголовокФинансовогоПоказателя = "Акты";
						
					ИначеЕсли (ФинансовыйПоказатель = "ПоБюджету") Тогда 
						
						ЗаголовокФинансовогоПоказателя = "Бюджет";
						
					КонецЕсли; 
					
					ГруппаФП = ГруппаНП.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
					ГруппаФП.Использование = Истина;
					ГруппаФП.Заголовок = ЗаголовокФинансовогоПоказателя;
					
					Для каждого СтрВалюта Из СписокВалют Цикл // валюты
						
						ВП = ГруппаФП.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
						ВП.Использование = Истина;
						ВП.Заголовок = Строка(СтрВалюта.Значение);
						//СтрВалюта.Представление;
						ИмяПоля = КлючевойПоказатель + "_"+ФинансовыйПоказатель + "_" + ИндексСтрокой + "_"+ СтрВалюта.Представление;
						ВП.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
						
						_сф.Инкремент(КоличествоСформированныхКолонокФинансов);
						
					КонецЦикла; // валюты
					
				КонецЦикла; // финансовые показатели
				
				_сф.Инкремент(Индекс);
				
			КонецЦикла; // доп. колонки
			
		КонецЦикла; // Расход - Доход - Прибыль
		
	КонецЕсли; 
	
	// УО для дат
	Если (НЕ ВыводитьКонтрольныеДатыРаздельно) Тогда
		
		НастройкиСКД.УсловноеОформление.Элементы.Очистить();
		ЭлУО = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
		ЭлУО.Использование = Истина;
		Для Каждого Кол из ОписаниеКолонок Цикл 
			Попытка
				Если Тип(Кол.ТипЗначения) = Тип(Новый ОписаниеТипов("Дата")) И Кол.Видимость Тогда
					ЭлУО = НастройкиСКД.УсловноеОформление.Элементы.Добавить();
					ЭлУО.Использование = Истина;			
					ЭлПоле = ЭлУО.Поля.Элементы.Добавить();
					ЭлПоле.Использование = Истина;
					ЭлПоле.Поле = Новый ПолеКомпоновкиДанных(Кол.Имя);
					ЭлУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);	
				КонецЕсли;
			Исключение	
			КонецПопытки	
		КонецЦикла;	
		
	КонецЕсли; 
	
	// УО строк
	Если (СохранятьЦветовоеОформление) Тогда
		
		МеханизмРаскраски = Константы.CW_МеханизмРаскраскиСписковМониторинга.Получить();
		// РАСКРАСКА
		Если МеханизмРаскраски = Перечисления.CW_МеханизмыРаскраскиСписковМониторинга.ЦветаСтатусов Тогда
			
			ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_Грузоперевозки"));
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	CW_ЛогистическиеСтатусы.Ссылка КАК Ссылка,
			|	CW_ЛогистическиеСтатусы.ХранилищеЦвета КАК ХранилищеЦвета
			|ИЗ
			|	Справочник.CW_ЛогистическиеСтатусы КАК CW_ЛогистическиеСтатусы
			|ГДЕ
			|	CW_ЛогистическиеСтатусы.ИдентификаторОбъекта = &ИдентификаторОбъекта";
			
			Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() ЦИкл
				ЦветФона = Выборка.ХранилищеЦвета.Получить();
				_УФС.ДобавитьПростоеУсловноеОформление(НастройкиСКД, "ЛогистическийСтатус",,Выборка.Ссылка,,"ЦветФона", ЦветФона);
			КонецЦикла;
			
		ИначеЕсли МеханизмРаскраски = Перечисления.CW_МеханизмыРаскраскиСписковМониторинга.ПроизвольныеЦвета Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Цвета.Ссылка КАК Ссылка,
			|	Цвета.ХранилищеЦвета КАК ХранилищеЦвета
			|ИЗ
			|	Справочник.CW_Цвета КАК Цвета";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЦветФона = Выборка.ХранилищеЦвета.Получить();
				_УФС.ДобавитьПростоеУсловноеОформление(НастройкиСКД, "Цвет",,Выборка.Ссылка,,"ЦветФона", ЦветФона);
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("МакетОформления", "CW_ОсновнойМакетСКД");
	Если (ВыводитьЗаголовок) Тогда
		НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьЗаголовок", Ложь);
		НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ВРег("Финансовый отчёт по грузоперевозкам"));
	Иначе
		НастройкиСКД.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьЗаголовок", Истина);
	КонецЕсли; 
	
	
	Возврат НастройкиСКД;
	
КонецФункции	

&НаСервере
Процедура ОбработатьОтчет()

	Журнал = ПолучитьИзВременногоХранилища(АдрЖурнал);
	ОписаниеКолонок = ПолучитьИзВременногоХранилища(АдрОписаниеКолонок);
	
	КоличествоКолонокЖурнала = ОписаниеКолонок.Количество();
	
	// --- 
	
	Если (ВыводитьФинансовыеПоказатели И (ВыводитьФинансовыеПоказателиПоСчетам ИЛИ ВыводитьФинансовыеПоказателиПоАктам ИЛИ ВыводитьФинансовыеПоказателиПоБюджету)) Тогда
		
		// установка заголовков
		CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Доход", "ДОХОД", ГоризонтальноеПоложение.Лево);
		CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Расход", "РАСХОД", ГоризонтальноеПоложение.Лево);
		CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Прибыль", "ПРИБЫЛЬ", ГоризонтальноеПоложение.Лево);
		CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Всего", "ВСЕГО", ГоризонтальноеПоложение.Лево);
		CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");
		
		Если (КомментироватьФинансовыеПоказатели) Тогда
			
			ДР = ПолучитьДР();
			СоответствиеКомментариев = ПолучитьИзВременногоХранилища(АдрСоответствиеКомментариев);
			// --- 
			НачальнаяСтрока = Результат.ФиксацияСверху + 1; 
			// --- 
			
			Для ИтераторСтрок=НачальнаяСтрока По НачальнаяСтрока+Журнал.Количество()-1 Цикл // перебор строк
				
				ОбластьСсылки = Результат.Область(ИтераторСтрок, 1, ИтераторСтрок, 1);
				РасшифровкаОбластиСсылки = ДР.Элементы[ОбластьСсылки.Расшифровка].ПолучитьПоля()[0];
				Если РасшифровкаОбластиСсылки.Поле = "Ссылка" Тогда
					
					Грузоперевозка = РасшифровкаОбластиСсылки.Значение;
					СтруктураКомментариев = СоответствиеКомментариев.Получить(Грузоперевозка);
					
					Если СтруктураКомментариев <> Неопределено 
						и СтруктураКомментариев.Количество() <> 0 Тогда
						
						// перебираем ячейки строки
						НачальнаяЯчейка = СчКол+1;
						Для ИтераторЯчеек=НачальнаяЯчейка По НачальнаяЯчейка+КоличествоСформированныхКолонокФинансов-1 Цикл
							
							ОбластьЯчейки = Результат.Область(ИтераторСтрок, ИтераторЯчеек, ИтераторСтрок, ИтераторЯчеек);
							РасшифровкаОбластиЯчейки = ДР.Элементы[ОбластьЯчейки.Расшифровка].ПолучитьПоля()[0];
							ИмяПоля = РасшифровкаОбластиЯчейки.Поле;
							
							// если это фин.колонка и значение заполнено, то получаем ранее сохранённую расшифровку
							Если ((Найти(ИмяПоля,"Доход_")<>0 ИЛИ Найти(ИмяПоля,"Расход_")<>0) И (Найти(ИмяПоля,"Всего")=0) ) Тогда
								
								// получаем из структуры комментариев
								Комментарий = "";
								СтруктураКомментариев.Свойство(ИмяПоля,Комментарий);
								Если (ЗначениеЗаполнено(Комментарий)) Тогда
									ОбластьЯчейки.Примечание.Текст = Комментарий;	
								КонецЕсли; 
								
							КонецЕсли; 
							
						КонецЦикла; 
						
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЦикла; // перебор строк
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры
	
// ---------------------------------------------------------------------------- 

&НаСервере
Функция ПроверитьПараметры()
	
	Рез = Истина;
	
	Если РежимВалют = 1 И ОпределениеКурса = 1 И НЕ ЗначениеЗаполнено(КД) Тогда
		Сообщить("Не выбрана контрольная дата!");
		Рез = Ложь;			
	КонецЕсли;	
	
	Возврат Рез;
	
КонецФункции	

&НаСервере
Функция ОпределитьДатуКурса(ГП)
	
	Если КД = "Реквизит.ДатаЗакрытия" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	CW_ЗакрытиеФинансов.ДатаЗакрытия КАК Дата
			|ИЗ
			|	РегистрСведений.CW_ЗакрытиеФинансов КАК CW_ЗакрытиеФинансов
			|ГДЕ
			|	(CW_ЗакрытиеФинансов.Аналитика = &ГП
			|			ИЛИ CW_ЗакрытиеФинансов.Аналитика = &Заказ)";
		Запрос.УстановитьПараметр("Заказ", ГП.Заказ);
		Запрос.УстановитьПараметр("ГП", ГП);
		ТЗ = Запрос.Выполнить().Выгрузить();
	ИначеЕсли КД = "Реквизит.ДатаСделкиФ" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	CW_Грузоперевозки.ДатаСделкиФ КАК Дата
			|ИЗ
			|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
			|ГДЕ
			|	CW_Грузоперевозки.Ссылка = &ГП";
		Запрос.УстановитьПараметр("ГП", ГП);
		ТЗ = Запрос.Выполнить().Выгрузить();
	Иначе
		Параметр = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.НайтиПоКоду(КД);
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	CW_ГрузоперевозкиПараметрыОбъекта.Значение КАК Дата
			|ИЗ
			|	Справочник.CW_Грузоперевозки.ПараметрыГрузоперевозки КАК CW_ГрузоперевозкиПараметрыОбъекта
			|ГДЕ
			|	CW_ГрузоперевозкиПараметрыОбъекта.Параметр = &Параметр
			|	И CW_ГрузоперевозкиПараметрыОбъекта.Ссылка = &ГП";
		Запрос.УстановитьПараметр("Параметр", Параметр);
		Запрос.УстановитьПараметр("ГП", ГП);
		ТЗ = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Если ТЗ.Количество() > 0 Тогда
		Возврат ТЗ[0].Дата;	
	Иначе
		Возврат '00010101';
	КонецЕсли;	
	
КонецФункции	

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("Организация", Организация);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок",ВыводитьЗаголовок);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьФинансовыеПоказатели",ВыводитьФинансовыеПоказатели);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьФинансовыеПоказателиПоСчетам", ВыводитьФинансовыеПоказателиПоСчетам);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьФинансовыеПоказателиПоАктам", ВыводитьФинансовыеПоказателиПоАктам);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьФинансовыеПоказателиПоБюджету", ВыводитьФинансовыеПоказателиПоБюджету);
	Настройки.ДополнительныеСвойства.Вставить("КомментироватьФинансовыеПоказатели",КомментироватьФинансовыеПоказатели);
	Настройки.ДополнительныеСвойства.Вставить("ВерсияБюджета", ВерсияБюджета);
	Настройки.ДополнительныеСвойства.Вставить("ДетализироватьДоходы", ДетализироватьДоходы);
	Настройки.ДополнительныеСвойства.Вставить("ДетализироватьРасходы", ДетализироватьРасходы);
	Настройки.ДополнительныеСвойства.Вставить("ДетализироватьФинансовыйРезультат", ДетализироватьФинансовыйРезультат);
	Настройки.ДополнительныеСвойства.Вставить("РежимВалют", РежимВалют);
	Настройки.ДополнительныеСвойства.Вставить("Валюты", Валюты);
	Настройки.ДополнительныеСвойства.Вставить("ОпределениеКурса", ОпределениеКурса);
	Настройки.ДополнительныеСвойства.Вставить("КД", КД);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьКонтрольныеДатыРаздельно", ВыводитьКонтрольныеДатыРаздельно);
	Настройки.ДополнительныеСвойства.Вставить("СохранятьЦветовоеОформление", СохранятьЦветовоеОформление);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
	Если НЕ ЗначениеЗаполнено(ВерсияБюджета) Тогда
		ВерсияБюджета = _ПолучитьБазовуюВерсиюБюджета();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаРасшифровки = _ПолучитьСсылку(Расшифровка);
	Попытка
		ПоказатьЗначение(,СсылкаРасшифровки);
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьСсылку(Расшифровка)
	// --- 
	
	ДР = ПолучитьДР();
	//ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДР, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьИзВременногоХранилища(Отчет.АдресСхемы)));
	
	РасшРод = ДР.Элементы[Расшифровка].ПолучитьРодителей();
	Возврат(ДР.Элементы[РасшРод[0].Идентификатор].ПолучитьПоля()[0].Значение);   
	
	// --- 
КонецФункции

&НаСервере
Функция ПолучитьДР()
	
	Возврат ПолучитьИзВременногоХранилища(Отчет.АдресРасшифровки);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыводитьФинансовыеПоказателиПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьФинансовыеПоказателиПоБюджетуПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочте(Команда)
	
// проверяем учётную запись пользователя
	Если (НЕ _ЕстьУчетнаяЗаписьПользователя()) Тогда
		
		_УФК.ВывестиПредупреждение("У текущего пользователя не задана учетная запись электронной почты!" + Символы.ПС + """Настройки пользователя"" --> ""Сервис"" --> ""Учетная запись электронной почты""");
		Возврат;
		
	КонецЕсли; 
	
	ПФ = Новый Структура("СтруктураПисьма",СформироватьПисьмо());
    ОткрытьФорму("Обработка.CW_ОтправкаПочты.Форма.Форма", ПФ);
	
КонецПроцедуры

&НаСервере
Функция _ЕстьУчетнаяЗаписьПользователя()
	
	УчетнуюЗапись = _ЭП.ПолучитьУчетнуюЗаписьТекущегоПользователя();
	Возврат УчетнуюЗапись <> Неопределено; 
	
КонецФункции

&НаСервере
Функция СформироватьПисьмо()
	
	СП = _ЭП.СтруктураПисьма();
	// --- 
	НастройкиПользователя = CW_Настройки.ПолучитьНастройкиПользователя();
	Учетка = НастройкиПользователя;
	СП.Отправитель = Учетка.УчетнаяЗаписьЭлектроннойПочты;
	// --- 
	
	// --- 
	
	СП.Тема = "";
	_ЭП.ДобавитьТекст(СП,"");
	
	// --- 
	//_ЭП.ДобавитьПолучателейИзСтроки(СП.Получатели,Получатели);
	// --- 
	Если Учетка.СкрытаяКопияСебе Тогда
		_ЭП.ДобавитьПолучателейИзСтроки(СП.Получатели_СкрытыеКопии,Учетка.УчетнаяЗаписьЭлектроннойПочты.ПочтовыйАдрес);
	КонецЕсли;
	// --- 
	
	// добавляем отчет в формате excel
	ИмяФайла = ПолучитьИмяВременногоФайла("xls");
	Результат.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	_ЭП.ДобавитьВложение(СП,ИмяФайла,"путь",ИмяФайла);
	
	// ---------------------------------------------------------------------------- 
	
	Возврат(ПоместитьВоВременноеХранилище(СП,ЭтаФорма.УникальныйИдентификатор));
	
КонецФункции



