&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РедактированиеСтатусовДокументов = CW_ПраваДоступа.ПравоДоступно("РедактированиеСтатусовДокументов", ПараметрыСеанса.ТекущийПользователь);
	
	Элементы.СписокУдалить.Видимость 				=  РедактированиеСтатусовДокументов;
	Элементы.СписокКонтекстноеМенюУдалить.Видимость =  РедактированиеСтатусовДокументов;

	Параметры.Свойство("ЗначениеОтбора",ЗначениеОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные 	= Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ПользовательАвторСтатуса(ТекущиеДанные.Автор) Тогда 
			Если Не РедактированиеСтатусовДокументов Тогда
				//Только комментарий
				Отказ = Истина;
				ОписаниеОпвещения = Новый ОписаниеОповещения("ОбработатьИзменениеКомментария",ЭтаФорма, Элементы.Список.ТекущаяСтрока);
				ПоказатьВводСтроки(ОписаниеОпвещения, ТекущиеДанные.Комментарий, "Введите комментарий",,Истина);
			КонецЕсли;
		Иначе
			Отказ = Истина;
			ПоказатьПредупреждение(,"Редактирование статуса запрещено!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные 	= Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если НЕ (ПользовательАвторСтатуса(ТекущиеДанные.Автор) и РедактированиеСтатусовДокументов) Тогда
			Отказ 			= Истина;
			ПоказатьПредупреждение(,"Удаление статуса запрещено!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПользовательАвторСтатуса(Автор)
	
	Возврат Автор = ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеКомментария(Результат, КлючЗаписи) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьИзменениеКомментарияНаСервере(Результат, КлючЗаписи);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеКомментарияНаСервере(Результат, КлючЗаписи)
	
	РегистрыСведений.CW_СтатусыДокументов.ОбновитьКомментарийЗаписиСтатуса(КлючЗаписи, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаСтатусов(Команда)
	
	ТекущиеДанные 				= Элементы.Список.ТекущиеДанные;
	ДокументВМассиве 			= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущиеДанные.Документ);
	ИдентификаторОбъекта 		= ПолучитьИдентификаторОбъекта(ТекущиеДанные.Документ);
	АдресДокументовДляОтбора 	= ПолучитьАдресДокументов(ДокументВМассиве);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторОбъекта", 	ИдентификаторОбъекта);
	ПараметрыФормы.Вставить("АдресДокументовДляОтбора",	АдресДокументовДляОтбора);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", 	Истина);
	
	ОткрытьФорму("Отчет.CW_СтатистикаНахожденияДокументаВСтатусах.Форма", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресДокументов(ПараметрКоманды)
	
	Возврат ПоместитьВоВременноеХранилище(ПараметрКоманды);
	
КонецФункции

&НаСервере
Функция ПолучитьИдентификаторОбъекта(Ссылка)
	
	Возврат ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Ссылка));

КонецФункции

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Оповестить("Изменение_СтатусДокумента");

КонецПроцедуры



