&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Периоды") Тогда
		Периоды.Загрузить(Параметры.Периоды.Выгрузить());
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	Если Не ОтменаРедактирования Тогда
		ТекущаяСтрока = Элемент.ТекущиеДанные;
		
		Если ТекущаяСтрока.КонДень = 0 ИЛИ ТекущаяСтрока.КонДень = Неопределено Тогда
			_УФК.ВывестиПредупреждение("Значение окончания интервала должно быть больше 0.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ЕстьДубль = Ложь;
		Для Каждого СтрокаИнтервал Из Периоды Цикл
			Если СтрокаИнтервал.КонДень = ТекущаяСтрока.КонДень
				И СтрокаИнтервал <> ТекущаяСтрока Тогда
				ЕстьДубль = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДубль Тогда 
			_УФК.ВывестиПредупреждение("Окончание интервала - " + ТекущаяСтрока.Значение + " уже введено.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Периоды.Сортировать("КонДень");
	
	ПерваяСтрока = Истина;
	ПредыдущееЗначение = 0;
	Для Каждого Интервал Из Периоды Цикл
		Если ПерваяСтрока Тогда
			Интервал.Представление = "До " + Интервал.КонДень + " дней";
			ПредыдущееЗначение = Интервал.КонДень;
			Интервал.НачДень = 1; 
			ПерваяСтрока = Ложь;
		Иначе
			Интервал.НачДень = ПредыдущееЗначение + 1;
			Интервал.Представление = "С " + (ПредыдущееЗначение + 1) + " до " + Интервал.КонДень + " дней";
			ПредыдущееЗначение = Интервал.КонДень;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ЭтаФорма.Закрыть(_ВыгрузитьПериоды());
	
КонецПроцедуры

&НаСервере
Функция _ВыгрузитьПериоды()
	
	Возврат Периоды;
	
КонецФункции	
