
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) 
	
	ПарамтерыОтчета = ПолучитьПараметрыОткрытияОтчета(ПараметрКоманды);

	ОткрытьФорму("Отчет.CW_РеестрыНДС0АнализЗаписейРеестров.Форма", ПарамтерыОтчета, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры    

 &НаСервере
Функция ПолучитьПараметрыОткрытияОтчета(ПараметрКоманды)
	
	ОтчетОбъект 		= Отчеты.CW_РеестрыНДС0АнализЗаписейРеестров.Создать();
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек; 
	
	ЗначенияНастроек = ПолучитьЗначенияНастроекНаСервере(ПараметрКоманды);
	
	Для Каждого КлючЗначение из ЗначенияНастроек.ПользовательскийОтбор Цикл   
		ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных.Равно;
		Если ТипЗнч(КлючЗначение.Значение) = Тип("Массив") Тогда
			
			ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли;
		УстановитьЭлементОтбораСКД(КомпоновщикНастроек, ВидСравненияКомпоновки,	КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;  
	
	Для Каждого КлючЗначение из ЗначенияНастроек.Параметры Цикл   
		УстановитьЭлементПараметрыСКД(КомпоновщикНастроек, КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ДоходыПоГрузоперевозке.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозке.Ссылка В (&ПараметрКоманды)
	               |	И CW_ДоходыПоГрузоперевозке.ПриложениеКДоговору <> Значение(Справочник.CW_ПриложенияКДоговорам.ПустаяСсылка)";    
	
	Запрос.УстановитьПараметр("ПараметрКоманды", ПараметрКоманды);    
	РезультатЗапроса = Запрос.Выполнить();
	КлючВарианта = ?(РезультатЗапроса.Пустой(),  "ОсновнойБезПриложений", "Основной");
	
	ПараметрыОткрытия = Новый Структура(); 	
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	ПараметрыОткрытия.Вставить("Отбор", ЗначенияНастроек.Отбор);
	ПараметрыОткрытия.Вставить("КлючВарианта", КлючВарианта);
	Возврат ПараметрыОткрытия;

КонецФункции

&НаСервере
Процедура УстановитьЭлементОтбораСКД(КомпоновщикНастроек, ВидСравнения, ИмяПоля, Значение)
	
	Для Каждого ЭлементОтбора из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл 
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
				 Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора =  КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
		ЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор(); 
	КонецЕсли;
	
	ЭлементОтбора.ВидСравнения 		= ВидСравнения;
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ПравоеЗначение 	= Значение;
	ЭлементОтбора.Использование 	= Истина;      
	
	ПользовательскийОтбор = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
	Если ТипЗнч(ПользовательскийОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		ПользовательскийОтбор.ПравоеЗначение	= ЭлементОтбора.ПравоеЗначение;    
		ПользовательскийОтбор.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ПользовательскийОтбор.Использование		= ЭлементОтбора.Использование;    
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлементПараметрыСКД(КомпоновщикНастроек, ИмяПараметра, Значение)
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	ПараметрСКД.Значение = Значение;
	ПараметрСКД.Использование = Истина;     
	
	Если ЗначениеЗаполнено(ПараметрСКД.ИдентификаторПользовательскойНастройки) Тогда
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрСКД.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение 			= ПараметрСКД.Значение;
			ПользовательскийПараметр.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;  
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначенияНастроекНаСервере(ПараметрКоманды)  
	
	Организации 	= Новый Массив;
	ПериодОтчета 	= новый СтандартныйПериод; 
	ПериодОтчета.ДатаНачала    = НачалоКвартала(ТекущаяДата());
	ПериодОтчета.ДатаОкончания = КонецКвартала(ТекущаяДата());
	
	//Период отчета
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПараметрКоманды", ПараметрКоманды);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	МИНИМУМ(CW_ДоходыПоГрузоперевозке.Дата) КАК ДатаНачала,
	|	МАКСИМУМ(CW_ДоходыПоГрузоперевозке.Дата) КАК ДатаОкончания
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозке.Ссылка В(&ПараметрКоманды)"; 
	
	РезультатЗапрсоа = Запрос.Выполнить();
	Выборка = РезультатЗапрсоа.Выбрать();
	Если Выборка.Следующий() Тогда
		ПериодОтчета.ДатаНачала = НачалоКвартала(Выборка.ДатаНачала);
		ПериодОтчета.ДатаОкончания = КонецКвартала(Выборка.ДатаОкончания);
	КонецЕсли;  
	//Период отчета
	
	//Организация
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозке.Организация КАК Организация
	|ИЗ
	|	Документ.CW_ДоходыПоГрузоперевозке КАК CW_ДоходыПоГрузоперевозке
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозке.Ссылка В(&ПараметрКоманды)
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДоходыПоГрузоперевозке.Организация"; 
	
	РезультатЗапрсоа = Запрос.Выполнить();
	Выборка = РезультатЗапрсоа.Выбрать();
	Пока Выборка.Следующий() Цикл  
		Организации.Добавить(Выборка.Организация);
	КонецЦикла;  
	//Организация
	
	ПарамтерыОтчета = Новый Структура;
	ПарамтерыОтчета.Вставить("ПериодОтчета",	ПериодОтчета); 
	
	ПользовательскийОтбор = Новый Структура;
	ПользовательскийОтбор.Вставить("Организация", 	Организации);  
	Если Организации.Количество() = 1 Тогда
		ПользовательскийОтбор.Вставить("Организация",	Организации[0]);  
	КонецЕсли;         
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДокументДоходов", 	ПараметрКоманды);  
	Если ПараметрКоманды.Количество() = 1 Тогда
		Отбор.Вставить("ДокументДоходов", ПараметрКоманды[0]);  
	КонецЕсли;  
	
	ЗначенияНастроекОтчета = Новый Структура;
	ЗначенияНастроекОтчета.Вставить("Параметры", 				ПарамтерыОтчета);
	ЗначенияНастроекОтчета.Вставить("ПользовательскийОтбор",	ПользовательскийОтбор);
	ЗначенияНастроекОтчета.Вставить("Отбор", 					Отбор);
	
	Возврат ЗначенияНастроекОтчета;
	
КонецФункции



