#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьРеквизитСлужебныйВладелец() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВебПользователиЛКК.Ссылка КАК Ссылка,
	               |	CW_ВебПользователиЛКК.Владелец КАК Владелец
	               |ИЗ
	               |	Справочник.CW_ВебПользователиЛКК КАК CW_ВебПользователиЛКК";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.СлужебныйВладелец = Выборка.Владелец;
		
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПолучитьИдентификаторыАктивныхПользователей(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	МассивИдентифкаторов = ПолучитьМассивИдентификаторовАктивныхПользователей();	
	
	ПоместитьВоВременноеХранилище(МассивИдентифкаторов,АдресРезультата);
	
КонецПроцедуры

Функция ПолучитьМассивИдентификаторовАктивныхПользователей() Экспорт
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber", XMLСтрока(РегистрационныйНомер));  
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_activeusers", СтруктураJSON);
	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET"); 
	Если Ответ = Неопределено Тогда
		ВызватьИсключение "Отсутствует интеренет-соединение!";
	КонецЕсли;
	
	МассивИдентифкаторов = Новый Массив;

	Если Ответ.КодСостояния = 200 Тогда
		МассивJSON =  CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);
		Для Каждого userid  из МассивJSON Цикл   
			МассивИдентифкаторов.Добавить( XMLЗначение(тип("Строка"), userid));
		КонецЦикла;
	КонецЕсли;
	
	Возврат  МассивИдентифкаторов;
	
КонецФункции


#КонецЕсли

