#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ПередУдалением(Отказ)  
	
	Если РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		Возврат;
	КонецЕсли;

	СоответствиеКодовСостояний 	= CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
	РегистрационныйНомер 		= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("email",		XMLСтрока(ЭлектроннаяПочта));
	СтруктураJSON.Вставить("userid",	XMLСтрока(ИдентифкаторПользователя));
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_deluser", СтруктураJSON);
	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST"); 
	Если Ответ = Неопределено Тогда
		ВызватьИсключение "Отсутствует интернет-соединение!";
	КонецЕсли; 
	
	Если Ответ.КодСостояния = 200 Тогда
		ОбщегоНазначения.СообщитьПользователю(Ответ.ПолучитьТелоКакСтроку());  
	Иначе
		ОписаниеОшибки = СоответствиеКодовСостояний.Получить(Ответ.КодСостояния);	
		ОбщегоНазначения.СообщитьПользователю("Код: " + Ответ.КодСостояния + " - " + ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли