Процедура ВыполнитьПереводЗаявокПрофиляВАрхив(ПараметрыПроцедуры, РезультатВыполнения) Экспорт
	
	CW_ОбщийМодульЛичныйКабинетСервер.ПеревестиЗаявкиВАрхив(ПараметрыПроцедуры.Профили);

КонецПроцедуры      

Процедура ПриОтключенииКонтстантыЗапрашиватьТипФайлаПриДобавленииВАрхив() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ВебПрофилиЗаявок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_ВебПрофилиЗаявок КАК CW_ВебПрофилиЗаявок";  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПрофильОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПрофильОбъект.ВыгружатьФайлы = Ложь;
		ПрофильОбъект.ВыводитьТипФайла = Ложь;
		ПрофильОбъект.РазрешеноПрикреплятьФайлы = Ложь;
		
		ПрофильОбъект.ТипыФайлов.Очистить(); 
		
		ПрофильОбъект.ОбменДанными.Загрузка = Истина; 
		ПрофильОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатнойФормы(Знач ШаблонПрофиля, Знач Язык = "ru") Экспорт
	
	ПоляМакета		= Новый Массив; 
	ТаблицаПрофиля  = ШаблонПрофиля.СтруктураПрофиля.Выгрузить();
	
	НомерГруппы = 1;
	Для Каждого СтрокаГруппы из ШаблонПрофиля.ГруппыПолей Цикл  
		
		ПоляГруппы 			= новый Массив;
		ЗаголовокГруппыПоля = Нстр("ru='"+СтрокаГруппы.ИмяГруппыRU+"'; en='"+СтрокаГруппы.ИмяГруппыEN+"'", СокрЛП(Язык)); 
		ИмяЯчейкиГруппы 	= "П001_"+Формат(НомерГруппы, "ЧГ=0");
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторГруппы", СтрокаГруппы.ИдентификаторГруппы);
		
		МассивСтрок = ШаблонПрофиля.ПоляОбъекта.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтроки = 1;
		Для Каждого ПолеОбъекта из МассивСтрок Цикл 
			НайденнаяСтрока = ТаблицаПрофиля.Найти(ПолеОбъекта.СтрокаПоляКомпоновки, "СтрокаПоляКомпоновки"); 
			Если НайденнаяСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаголовокПоля = Нстр("ru='"+НайденнаяСтрока.ЗаголовокRU+"'; en='"+НайденнаяСтрока.ЗаголовокEN +"'", СокрЛП(Язык));
			
			ИмяЯчейкиЗаголовка 	= "П001_" + Формат(НомерГруппы, "ЧГ=0") + "_" + Формат(НомерСтроки, "ЧГ=0")+"_1";
			ИмяЯчейкиЗначения 	= "П001_" + Формат(НомерГруппы, "ЧГ=0") + "_" + Формат(НомерСтроки, "ЧГ=0")+"_2";
			
			ДанныеПоля = Новый Структура;
			ДанныеПоля.Вставить("title",		XMLСтрока(ЗаголовокПоля));
			ДанныеПоля.Вставить("name",			XMLСтрока(НайденнаяСтрока.ИмяПоля));
			ДанныеПоля.Вставить("titlecell",	XMLСтрока(ИмяЯчейкиЗаголовка));
			ДанныеПоля.Вставить("valuecell",	XMLСтрока(ИмяЯчейкиЗначения));
			ДанныеПоля.Вставить("format",		XMLСтрока(НайденнаяСтрока.Формат)); 
			ПоляГруппы.Добавить(ДанныеПоля);  
			
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла; 
		
		Шрифт 		= СтрокаГруппы.ХранилищеШрифт.Получить();
		ЦветФона 	= СтрокаГруппы.ХранилищеЦветФона.Получить();
		ЦветТекста 	= СтрокаГруппы.ХранилищеЦветТекста.Получить();
		
		ДанныеОформления = Новый Структура;
		ДанныеОформления.Вставить("font",               CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(Шрифт));
		ДанныеОформления.Вставить("backgroundcolor",    CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ЦветФона));
		ДанныеОформления.Вставить("textcolor",         	CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ЦветТекста));
		
		ДанныеГруппы = Новый Структура;
		ДанныеГруппы.Вставить("name",		XMLСтрока(ЗаголовокГруппыПоля));
		ДанныеГруппы.Вставить("show",		XMLСтрока(СтрокаГруппы.ОтображатьЗаголовок));  
		ДанныеГруппы.Вставить("decoration",	ДанныеОформления); 		
		ДанныеГруппы.Вставить("fields", 	ПоляГруппы);
		ДанныеГруппы.Вставить("titlecell", 	ИмяЯчейкиГруппы);
		
		ПоляМакета.Добавить(ДанныеГруппы); 
		
		НомерГруппы = НомерГруппы + 1;
		
	КонецЦикла; 
	
	Возврат ПоляМакета;

КонецФункции     

