
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Объект", ПодключаемыйОбъект);
	
	ПолучитьНастройку();

КонецПроцедуры

#Область Обработка_Команд_Формы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНастройку();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	СохранитьНастройку();
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Отказ 				= ЗавершениеРаботы;
	ТекстПредупреждения = "Закрыть форму без сохранения настроек?";
	
	Если Модифицированность Тогда
		Отказ = истина;
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Закрыть форму без сохранения настроек?", Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    Модифицированность = Ложь;
	ЭтаФорма.Закрыть();

КонецПроцедуры

#КонецОбласти

#Область Сохранение_Восстановление_Настроек

&НаСервере
Процедура СохранитьНастройку()
	
	СтруктураНастройки = Новый Структура();
	
	_ПО.ЗаписатьНастройкиОбработки(ПодключаемыйОбъект,СтруктураНастройки); 

КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройку()
	
	СтруктураНастроек = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъект);
	
	Если СтруктураНастроек <> Неопределено Тогда
		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти