
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП

КонецПроцедуры


//Групповое редактирование реквизитов
&НаКлиенте
Процедура ГрупповоеРедактированиеРеквизита(Команда)
	
	// если нет выделенных строк
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Для группового изменения реквизтов необходимо выделить строки!",10,"Предупреждение");
		Возврат;
	КонецЕсли;    
	
	РедактируемыеРеквизиты = ПолучитьРедактиуемыеРеквизитыОбъекта();
	
	СтруктураПараметров = новый Структура;
	СтруктураПараметров.Вставить("РедактируемыеРеквизиты", РедактируемыеРеквизиты); 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьРедактированиеРеквизитов", ЭтотОбъект, ДополнительныеПараметры);	
	
	ОткрытьФорму("ОбщаяФорма.CW_ГрупповоеИзменениеРеквизитовОбъекта", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения);

КонецПроцедуры   

&НаСервере
Функция ПолучитьРедактиуемыеРеквизитыОбъекта()
	
	Возврат Справочники.CW_ПланированиеДДС.ПолучитьРедактиуемыеРеквизитыОбъекта();
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьРедактированиеРеквизитов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Ссылки", 				ДополнительныеПараметры.ВыделенныеСтроки); 
	ПараметрыПроцедуры.Вставить("ЗначенияРеквизитов",	РезультатВыбора);
	
	РезультатВыполнения =  НачатьИзменениеРеквизитовВФоне(ПараметрыПроцедуры);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьФоновоеРедактированиеРеквизитов", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры    

&НаСервере
Функция НачатьИзменениеРеквизитовВФоне(ПараметрыПроцедуры)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Редактирование реквизитов";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_ПланированиеДДС.ВыполнитьИзменениеРеквитовОбъетов", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции 

&НаКлиенте
Процедура ЗавершитьФоновоеРедактированиеРеквизитов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_ПланированиеДДС"));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось изменить реквизты!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка изменения реквизитов");
	КонецЕсли;
	
КонецПроцедуры
//Групповое редактирование реквизитов
