
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// --- 
	
	// по переданным спискам колоноки и колонок доступных для изменения видимости 
	// формируем дерево
	
	// Структура колонки: Имя,Заголовок,Видимость,ИзменениеВидимости,ЭтоГруппа,Элементы
	
	Для каждого СК Из Параметры.СписокКолонок Цикл
		
		_ДобавитьУзел(ДеревоКолонок,СК);
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ДобавитьУзел(Родитель,СтруктураУзла)
	// --- 
	
	Нстр = Родитель.ПолучитьЭлементы().Добавить();
	ЗаполнитьЗначенияСвойств(Нстр,СтруктураУзла);
	// --- 
	Если СокрЛП(Нстр.Заголовок) = "" Тогда
		
		Нстр.Представление = "("+Нстр.Имя+")";
		
	Иначе
		
		Нстр.Представление = Нстр.Заголовок;
		
	КонецЕсли; 
	
	Нстр.ИндексКартинки = ?(Нстр.ЭтоГруппа,0,1);
	// --- 
	Если Нстр.ЭтоГруппа Тогда
		
		Для каждого СК Из СтруктураУзла.Элементы Цикл
			
			_ДобавитьУзел(Нстр,СК);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЭтаФорма.Закрыть(_Ответ());
	
КонецПроцедуры

&НаСервере
Функция _Ответ()
	// --- 
	
	МассивСК = Новый Массив;
	_СформироватьСтруктуруКолонок(ДеревоКолонок,МассивСК);
	Возврат(МассивСК);
	
	// --- 
КонецФункции

&НаСервере
Процедура _СформироватьСтруктуруКолонок(Дерево,МассивСК)
	// --- 
	
	// обходим подчинённые элементы
	Для каждого Строка Из Дерево.ПолучитьЭлементы() Цикл
		
		Узел = _ШаблонУзла();
		_сф.ст_ЗаполнитьСвойства(Узел,"Имя,Заголовок,Видимость,ЭтоГруппа",Строка);
		МассивСК.Добавить(Узел);
		// --- 
		Если Узел.ЭтоГруппа Тогда
			
			_СформироватьСтруктуруКолонок(Строка,Узел.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры

&НаСервере
Функция _ШаблонУзла()
	// --- 
	
	Возврат(Новый Структура("Имя,Заголовок,Видимость,ЭтоГруппа,Элементы","","",Ложь,Ложь,Новый Массив));
	
	// --- 
КонецФункции


&НаКлиенте
Процедура УстановитьВидимость(Команда)
	
	_УстановитьПометки(Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура СнятьВидимость(Команда)
	
	_УстановитьПометки(Ложь);
	
КонецПроцедуры
 
&НаСервере
Процедура _УстановитьПометки(Значение)
	// --- 
	
	
	Для каждого Стр Из ДеревоКолонок.ПолучитьЭлементы() Цикл
		
		_УстановитьРекурсивно(Стр,Значение);
		
	КонецЦикла; 
	
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _УстановитьРекурсивно(Строка,Значение)
	// --- 
	
	Строка.Видимость = Значение;
	Для каждого Стр Из Строка.ПолучитьЭлементы() Цикл
		
		_УстановитьРекурсивно(Стр,Значение);
		
	КонецЦикла; 
	
	// --- 
КонецПроцедуры
 