&После("ПриСозданииНаСервере")
Процедура САБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Элементы.Найти("САБ_ОперативныйМенеджер") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйЭлемент = Элементы.Добавить("САБ_ОперативныйМенеджер", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.САБ_ОперативныйМенеджер";
	НовыйЭлемент.Заголовок = "Оперативный менеджер";
	НовыйЭлемент.ТолькоПросмотр =
		Не Пользователи.ЭтоПолноправныйПользователь()
		И Не РольДоступна("САБ_ИзменениеОперативногоМенеджераЭПД");
	
КонецПроцедуры
