
&НаКлиенте
Процедура КомандаПечать(Команда)
	
	СтруктураПечатныхФорм = ПолучитьПечатнуюФорму();
	Результат = СтруктураПечатныхФорм.ПечатнаяФорма;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПечатнуюФорму()
	
	СтруктураНастроек = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъект);
	
	ПараметрыПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	ПараметрыПечати.Настройки 			= СтруктураНастроек;
	ПараметрыПечати.ПодписьИПечать 		= Истина;
	ПараметрыПечати.ПодключаемыйОбъект 	= ПодключаемыйОбъект;
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ТОбъект.ПечатнаяФорма(ПараметрыПечати); 
	
КонецФункции
