
Процедура СогласованиеОповеститьПользователя() Экспорт
	
	МассивОповещений = CW_СогласованиеСервер.ПолучитьМассивОповещенийКОтправке();
	
	Если МассивОповещений.Количество() =  0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеОповещения из МассивОповещений Цикл
		НавигационнаяСсылкаОбъекта = "";
		Если ЗначениеЗаполнено(ДанныеОповещения.Объект) Тогда
			НавигационнаяСсылкаОбъекта = ПолучитьНавигационнуюСсылку(ДанныеОповещения.Объект);
		КонецЕсли;
		ПоказатьОповещениеПользователя(ДанныеОповещения.ЗаголовокОповещения, 
										НавигационнаяСсылкаОбъекта, 
										ДанныеОповещения.ТекстОповещения, 
										БиблиотекаКартинок.СигналАктивный32, 
										СтатусОповещенияПользователя.Важное);
	КонецЦикла;
	
КонецПроцедуры