&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	// ---------------------------------------------------------------------------- 
	УстановитьФункциональныеОпцииДокумента();
	
	ПорядокОтраженияЗатратВПеделахПогрешности = Константы.CW_ВариантОтраженияЗатратПоБУВПределахПогрешности.Получить(); 
	
	РеквизитВыезд 				= "Выезд";
	РеквизитВозвращение 		= "Возвращение";
	// --- 
	РеквизитРасходВсего 		= "Расход, л";
	РеквизитРасходНормированный = "Расход, л/100км";
	
	Если Параметры.Ключ.Пустая() Тогда
		Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПутевыхЛистов.Выписан");
		Объект.Организация 							= CW_Настройки.ОсновнаяОрганизация();
		Объект.РассчитыватьНормативныйРасходТоплива = ПрименяютсяНормативыРасходаТоплива;
		Объект.Ответственный 						= Пользователи.ТекущийПользователь();
	Иначе	
		Статус = Объект.Статус;
		
		ОбновитьДанныеДляРасчетаПогрешности();
				
	КонецЕсли;
	
	ТекущаяОрганизация = Объект.Организация;
	
	_ВосстановитьСеансовуюНастройку();
	
	// ---------------------------------------------------------------------------- 
	
	ЗаполнитьДанныеФормыДокумента();
	
	УстановитьВидимостьЭлементовФормы();
	
	_ОбновитьПредставлениеВодителей();
	
	ПоказатьСкрытьПростоиЭтапа();
	
	РассчиатьПробегПоОдометру();
	
	ВыделитьЦветомОтклонениеПробега();

	УстановитьЗаголовкиСвертываемыхГрупп();
	
	УстановитьВидимостьСсылкиВодители() ;
	
	ОбновитьДанныеРегистрационныхЗнаков();
	
	ЗаполнитьСписокСведенийОПеревозках();
	
	ТолькоПросмотр = Не ДоступноЗакрытиеПутевыхЛистов и ЗначениеЗаполнено(Объект.ДатаЗакрытия);
	
	УстановитьДоступностьКнопок();

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКнопок()
	
	Элементы.ПолучитьОстатокТоплива.Доступность 	= Не ТолькоПросмотр;
	Элементы.ПолучитьДанныеОдометра.Доступность 	= Не ТолькоПросмотр;
	Элементы.КомандаВозвращениеПланФакт.Доступность = Не ТолькоПросмотр;
	Элементы.КомандаВыездПланФакт.Доступность 		= Не ТолькоПросмотр;
	
	Элементы.КомандаРаспределитьТоплитвоПоГрузоперевозкам.Доступность 	= Не ТолькоПросмотр;
	Элементы.КомандаПересчитатьНормативныйРасход.Доступность 			= Не ТолькоПросмотр;
	Элементы.ЭтапыМаршрутаКомандаПодборИзЖурнала.Доступность 			= Не ТолькоПросмотр;
	Элементы.ЭтапыМаршрутаКомандаЗаполнитьЭтапы.Доступность 			= Не ТолькоПросмотр;
	Элементы.УдалитьСоответствие.Доступность 							= Не ТолькоПросмотр;
	Элементы.СгенерироватьАналиткуЗатрат.Доступность 					= Не ТолькоПросмотр;
	Элементы.ДобавитьДокументЗаправки.Доступность 						= Не ТолькоПросмотр;
	Элементы.ОтражениеРасходовСверхНормативаКомандаЗаполнитьОтражениеВПределахПогрешности.Доступность	= Не ТолькоПросмотр;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСведенийОПеревозках()
	
	МассивЗначений = Документы.CW_ПутевойЛист.ПолучитьСписокСведенийОперевозках();
	
	Если МассивЗначений.Количество() Тогда
		Элементы.СведенияОПеревозке.СписокВыбора.ЗагрузитьЗначения(МассивЗначений);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеРегистрационныхЗнаков()
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		ТранспортноеСредствоРегистрационныйЗнак = РегистрыСведений.CW_РегистрацонныеЗнакиАвтомобилей.ПолучитьПредставлениеГосНомераТранспортногоСредства(Объект.Дата, Объект.ТранспортноеСредство);
	Иначе
		ТранспортноеСредствоРегистрационныйЗнак = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Прицеп) Тогда
		ПрицепРегистрационныйЗнак = РегистрыСведений.CW_РегистрацонныеЗнакиАвтомобилей.ПолучитьПредставлениеГосНомераТранспортногоСредства(Объект.Дата, Объект.Прицеп);
	Иначе
		ПрицепРегистрационныйЗнак 	= "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьДанныеФормы();

КонецПроцедуры

&НаСервере
Процедура ПодготовитьДанныеФормы()
	
	ЗаполнитьДобавленныеКолонкиТаблиц("ЭтапыМаршрута");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц(ИмяТабличнойЧасти)
	
	МассивГрузоперевозок 	= Объект[ИмяТабличнойЧасти].Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	СвойстваГрузоперевозок 	= CW_Грузоперевозки_Сервер.ПолучитьСведенияПоГрузоперевозкам(МассивГрузоперевозок);

	Для каждого СтрокаДокумента Из Объект[ИмяТабличнойЧасти] Цикл

		СтруктураСвойств = СвойстваГрузоперевозок.Получить(СтрокаДокумента.Грузоперевозка);
		
		Если СтруктураСвойств <> Неопределено Тогда
			 СтруктураСвойств.Свойство("ПометкаУдаления",СтрокаДокумента.ГрузоперевозкаУдалена);
		Конецесли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьДанныеДляРасчетаПогрешности()
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		
		// при определении даты среза плановую дату не используем, так как она может быть меньше фактической
		ДатаСреза 					= Макс(Объект.Дата, Объект.ВозвращениеФакт);
		СсылкаТранспортноеСредство 	=  Объект.ТранспортноеСредство;
		СсылкаМодель 				=  Объект.ТранспортноеСредство.Модель;

		мПоказатели = Новый массив;
		мПоказатели.Добавить(Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПогрешностьИзмеренияОстаткаТоплива);
		
		ЗначенияПоказателей	= новый Соответствие;
		
		тОбъект = РеквизитФормыВЗначение("Объект");
		
		тОбъект.ПолучитьЗначенияПоказателей(ДатаСреза, ЗначенияПоказателей , СсылкаТранспортноеСредство, мПоказатели);
		
		времПогрешностьРасчета = ЗначенияПоказателей.Получить(Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПогрешностьИзмеренияОстаткаТоплива);
		
		Если времПогрешностьРасчета = Неопределено Тогда
			тОбъект.ПолучитьЗначенияПоказателей(ДатаСреза, ЗначенияПоказателей , СсылкаМодель, мПоказатели);
			времПогрешностьРасчета = ЗначенияПоказателей.Получить(Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПогрешностьИзмеренияОстаткаТоплива);
		КонецЕсли;
		
		ИспользуетсяПогрешностьРасчета 	= НЕ времПогрешностьРасчета = Неопределено;
		ПогрешностьРасчета 				= ?(ЗначениеЗаполнено(времПогрешностьРасчета), времПогрешностьРасчета, 0);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()	
	
	Элементы.СтраницаДополнительноеОборудование.Видимость 			= ИспользуетсяДополнительноеОборудование;
	
	Элементы.ГруппаПрименениеНормативов.Видимость 					= ПрименяютсяНормативыРасходаТоплива;
	
	Элементы.ПриравнятьФактическийРасходКНормативному.Видимость 	= Объект.РассчитыватьНормативныйРасходТоплива; 
	
	Элементы.ГруппаПорядокОтраженияРасходаСверхНорматива.Видимость 	= ПрименяютсяНормативыРасходаТоплива и Объект.РассчитыватьНормативныйРасходТоплива и  Не Объект.ПриравнятьФактическийРасходКНормативному;
	Элементы.Группа4.Видимость 										= ПрименяютсяНормативыРасходаТоплива и Объект.РассчитыватьНормативныйРасходТоплива;
	Элементы.ЭтапыМаршрутаИтогРасходНорма.Видимость					= ПрименяютсяНормативыРасходаТоплива и Объект.РассчитыватьНормативныйРасходТоплива;

	Элементы.КомандаПересчитатьНормативныйРасход.Видимость 				= ПрименяютсяНормативыРасходаТоплива и Объект.РассчитыватьНормативныйРасходТоплива;
	Элементы.КомандаРаспределитьТоплитвоПоГрузоперевозкам.Видимость 	= Не (ПрименяютсяНормативыРасходаТоплива  и Объект.РассчитыватьНормативныйРасходТоплива);
	
	Элементы.ПробегПриВозвращении.Доступность 			= ЗначениеЗаполнено(Объект.ВозвращениеФакт);
	Элементы.ОстатокТопливаПриВозвращении.Доступность 	= ЗначениеЗаполнено(Объект.ВозвращениеФакт);
	
	
	Элементы.ГруппаИтогиПробегаСгрузом.Видимость 		= УчитыватьПробегТранспортногоСредстваСГрузом;
	Элементы.ЭтапыМаршрутаПробегПорожний.Доступность 	= ВводитьДанныеОПорожнемПробегеВДокументах;
	Элементы.ЭтапыМаршрутаПробег.Доступность 			= Не ВводитьДанныеОПорожнемПробегеВДокументах;
	
	ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива() ;
	
	Элементы.ОтражениеРасходовСверхНормативаКомандаЗаполнитьОтражениеВПределахПогрешности.Доступность = ИспользуетсяПогрешностьРасчета и УчитыватьПогрешностьИзмеренияОстаткаТоплива;
	
	Элементы.ГруппаПробегТС.Видимость = ЗначениеЗаполнено(Объект.ВозвращениеФакт);
	Элементы.ГруппаРасходТС.Видимость = ЗначениеЗаполнено(Объект.ВозвращениеФакт);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиСвертываемыхГрупп()
	
	СтрокОтражения = Объект.ОтражениеРасходовСверхНорматива.Количество();
	
	ЗаголовокПорядокОтраженияРасходаСверхНорматива = "Отражение расхода сверх норматива ("+Формат(СтрокОтражения,"ЧН=0; ЧГ=0")+ " строк)";
	
	Элементы.ГруппаПорядокОтраженияРасходаСверхНорматива.ЗаголовокСвернутогоОтображения = ЗаголовокПорядокОтраженияРасходаСверхНорматива;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииДокумента()
	
	ПараметрыОпции = Новый Структура;
	ПараметрыОпции.Вставить("CW_ГруппаПользователя", CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь));
	
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыОпции);
	
	УчитыватьПробегТранспортногоСредстваСГрузом = ПолучитьФункциональнуюОпцию("CW_УчитыватьПробегТранспортногоСредстваСГрузом");
	ВводитьДанныеОПорожнемПробегеВДокументах 	= ПолучитьФункциональнуюОпцию("CW_ВводитьДанныеОПорожнемПробегеВДокументах");	
	ПрименяютсяНормативыРасходаТоплива 			= ПолучитьФункциональнуюОпцию("CW_ПрименяютсяНормативыРасходаТоплива");	
	ИспользуетсяДополнительноеОборудование 	 	= ПолучитьФункциональнуюОпцию("CW_ИспользуетсяДополнительноеОборудованиеТранспортныхСредств");
	ИспользованиеЗаказов  						= ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов");
	ИспользуютсяПоказателиТранспортногоСредства = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяПоказателиТранспортногоСредстваОтдельноОтМодели");
	УчитыватьПогрешностьИзмеренияОстаткаТоплива = ПолучитьФункциональнуюОпцию("CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива");
	
	ДоступноЗакрытиеПутевыхЛистов = ПолучитьФункциональнуюОпцию("CW_ЗакрытиеПутевыхЛистов", ПараметрыОпции);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыделитьЦветомОтклонениеПробега();
	
	
КонецПроцедуры

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Объект").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("ПоказатьПростоиЭтапа", ПоказатьПростоиЭтапа);
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("ПоказатьПростоиЭтапа", ПоказатьПростоиЭтапа);
	
	Идентификатор = РеквизитФормыВЗначение("Объект").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПолучитьДанныеСпидометра(Команда)
	
	_ОбновитьДанныеОдометра();
	РассчиатьПробегПоОдометру();
	
КонецПроцедуры
 
&НаСервере
Процедура _ОбновитьДанныеОдометра()
	// --- 
	
	ДатаПоказаний = Объект.Дата;
	Если (ЗначениеЗаполнено(Объект.ВыездПлан)) Тогда
		
		Если (Объект.ВыездПлан > ДатаПоказаний) Тогда
			
			ДатаПоказаний = Объект.ВыездПлан;
			
		КонецЕсли; 
		
	КонецЕсли; 
	// --- 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПоказанияОдометровТранспортныхСредствСрезПоследних.Пробег КАК Пробег,
	               |	CW_ПоказанияОдометровТранспортныхСредствСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство
	               |ИЗ
	               |	РегистрСведений.CW_ПоказанияОдометровТранспортныхСредств.СрезПоследних(&Период, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_ПоказанияОдометровТранспортныхСредствСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ДатаПоказаний);
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.ТранспортноеСредство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Объект.ПробегПриВыезде = Выборка.Пробег;
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Даные пробега на дату выезда не обнаружены!";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПолучитьОстатокТоплива(Команда)
	
	ПолучитьОстатокТопливаНаСервере();
	_ПересчитатьРасходТоплива();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьОстатокТопливаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(CW_ТопливоТСОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.CW_ТопливоТС.Остатки(
	               |			,
	               |			ТранспортноеСредство = &ТранспортноеСредство
	               |				И Топливо = &Топливо) КАК CW_ТопливоТСОстатки";
	
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.ТранспортноеСредство);
	Запрос.УстановитьПараметр("Топливо"				, Объект.Топливо);
	// --- 
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Объект.ОстатокТопливаПриВыезде = Выборка.Количество;
	КонецЕсли;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ПересчитатьРасходТоплива()
	
	ВсегоЗаправлено 			= Объект.Заправки.Итог("Количество");
	ВсегоПробег 				= Объект.ПробегПриВозвращении -Объект.ПробегПриВыезде ;
	
	Объект.РасходТоплива 		= (Объект.ОстатокТопливаПриВыезде - Объект.ОстатокТопливаПриВозвращении) + ВсегоЗаправлено;
	Объект.СреднийРасходТоплива = _сф.БезопасноРазделить(Объект.РасходТоплива, ВсегоПробег) * 100;
	
	РассчитатьОтклонение();
	РассчитатьОстатокРаспределения();
	
	ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива();
	
	УстановитьЦветФонаРасходаТоплива();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветФонаРасходаТоплива()
	
	Элементы.РасходТоплива.ЦветФона 		= ?(Объект.РасходТоплива < 0		, ЦветаСтиля.КритичноеСобытиеНадежностьБанковЦветФона , ЦветаСтиля.ЦветФонаПодсказки);
	Элементы.СреднийРасходТоплива.ЦветФона 	= ?(Объект.СреднийРасходТоплива < 0	, ЦветаСтиля.КритичноеСобытиеНадежностьБанковЦветФона, ЦветаСтиля.ЦветФонаПодсказки);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива()
	
	Элементы.НадписьПересчетаРаспределения.Видимость 		= НеобходимоПересчитатьНормативныйРасход и Не (ПрименяютсяНормативыРасходаТоплива	и Объект.РассчитыватьНормативныйРасходТоплива);
	Элементы.НадписьНеобходимостьРасчетаТоплива.Видимость 	= НеобходимоПересчитатьНормативныйРасход и ПрименяютсяНормативыРасходаТоплива 		и Объект.РассчитыватьНормативныйРасходТоплива;
	
	Элементы.КартинкаПредупреждение.Видимость				= НеобходимоПересчитатьНормативныйРасход;	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаправкиОбъемПриИзменении(Элемент)
		
	_ПересчитатьРасходТоплива();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаправкиПослеУдаления(Элемент)
	
	_ПересчитатьРасходТоплива();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ЭтапыМаршрутаПробегПриИзменении(Элемент)
	
	НеобходимоПересчитатьНормативныйРасход = Истина;
	
	ТекущиеДанные = Элементы.ЭтапыМаршрута.ТекущиеДанные;
	РасчитатьПробегПоСтроке(ТекущиеДанные.ПолучитьИдентификатор());
	
	_ПересчитатьРасходТоплива();
	
	ПолучитьОтклонениеПробега();
	
	ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормыДокумента()
	
	СтарыйВодитель 				= Объект.Водитель;	
	СтароеТранспортноеСредство	= Объект.ТранспортноеСредство;	
	
	Водители.Загрузить(Объект.Водители.Выгрузить());
	
	_ПересчитатьРасходТоплива();
	УстановитьЦветНадписиОстатокРаспределения();
	
	ЗаполнитьСкладБУ_ИзПараметров();
	
КонецПроцедуры


&НаСервере
Процедура РассчитатьОтклонение()
	
	Если ПрименяютсяНормативыРасходаТоплива и Объект.РассчитыватьНормативныйРасходТоплива Тогда
		
		РасходОтклонение        = Объект.РасходТоплива 			-  Объект.РасходПоНорме;
		РасходОтклонениеСредний = Объект.СреднийРасходТоплива 	-  Объект.РасходПоНормеСредний;
		
	КонецЕсли;
	
	УстановитьЦветФонаОтколнения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветФонаОтколнения()
	
	Если ПрименяютсяНормативыРасходаТоплива и Объект.РассчитыватьНормативныйРасходТоплива Тогда
		
		Элементы.РасходОтклонение.ЦветФона 			= ?(РасходОтклонение 		= 0	, Новый Цвет, ЦветаСтиля.КритичноеСобытиеНадежностьБанковЦветФона);
		Элементы.РасходОтклонениеСредний.ЦветФона 	= ?(РасходОтклонениеСредний = 0	, Новый Цвет, ЦветаСтиля.КритичноеСобытиеНадежностьБанковЦветФона);
		
		Элементы.Группа5.Видимость =  РасходОтклонение <> 0  или  РасходОтклонениеСредний <> 0;
		
	Иначе
		
		Элементы.Группа5.Видимость = ложь;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаКоличествоЕздокПриИзменении(Элемент)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаПослеУдаления(Элемент)
	
	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаЗаполнитьЭтапы(Команда)
	
	Если Объект.ЭтапыМаршрута.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОчисткеМаршуртов", ЭтаФорма, Параметры);
		
		ПоказатьВопрос(Оповещение, "Табличная часть будет очищена. Продолжить?", Режим, 0);
		
	Иначе
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Тягач"	, Объект.ТранспортноеСредство);
		ПараметрыОтбора.Вставить("Прицеп"	, Объект.Прицеп);
		ПараметрыОтбора.Вставить("Водитель"	, Объект.Водитель);
		
		ПараметрыФормы 	= Новый Структура("ПараметрыОтбора",ПараметрыОтбора);	
		Оповещение 		= Новый ОписаниеОповещения("ОбработкаЗаполненияЭтапов",ЭтотОбъект, Новый Структура()); 
		
		ОткрытьФорму("Документ.CW_ПутевойЛист.Форма.ФормаПодбораГрузоперевозок",ПараметрыФормы,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОчисткеМаршуртов(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Тягач"	, Объект.ТранспортноеСредство);
	ПараметрыОтбора.Вставить("Прицеп"	, Объект.Прицеп);
	ПараметрыОтбора.Вставить("Водитель"	, Объект.Водитель);
	
	ПараметрыФормы 	= Новый Структура("ПараметрыОтбора",ПараметрыОтбора);	
	Оповещение 		= Новый ОписаниеОповещения("ОбработкаЗаполненияЭтапов",ЭтотОбъект, Новый Структура()); 
	
	ОткрытьФорму("Документ.CW_ПутевойЛист.Форма.ФормаПодбораГрузоперевозок",ПараметрыФормы,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаполненияЭтапов(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (_УФКС.ВыполненоУспешно(Ответ)) Тогда
			
			_ЗаполнитьЭтапыПоГрузоперевозкамНовая(Ответ.Грузоперевозки);
			
		Иначе
			
			Сообщить(_УФКС.ПредставлениеОшибки(Ответ));
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьЭтапыПоГрузоперевозкамНовая(МассивГрузоперевозок, ОчиститьМаршруты = истина)
	
	Если ОчиститьМаршруты Тогда
		
		Объект.ЭтапыМаршрута.Очистить();
		
	КонецЕсли;

	РезультатЗапроса = ПолучитьЗаполняемыеПараметрыПоГрузопереовзке(МассивГрузоперевозок);	
	
	Выборка_Грузопереовозки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для каждого ГрузоперевозкаИзМассива Из МассивГрузоперевозок Цикл
		
		НоваяСтрока = Объект.ЭтапыМаршрута.Добавить();
		
		НоваяСтрока.ИдентификаторСтроки 	= НоваяСтрока.ПолучитьИдентификатор();
		НоваяСтрока.Грузоперевозка 			= ГрузоперевозкаИзМассива;
		НоваяСтрока.КоличествоЕздок			= 1;
		НоваяСтрока.Груз 					= ГрузоперевозкаИзМассива.Груз;
		
		НоваяСтрока.ТранспортноеСредство	= Объект.ТранспортноеСредство;
		НоваяСтрока.Водитель 				= Объект.Водитель;
		
		//Заполнение параметров
		Выборка_Грузопереовозки.Сбросить();
		Если Выборка_Грузопереовозки.НайтиСледующий(новый Структура("Грузопереовзка",ГрузоперевозкаИзМассива)) Тогда
		
			ВыборкаПараметры = Выборка_Грузопереовозки.Выбрать();
			
			Пока ВыборкаПараметры.Следующий() Цикл
				РеквизитПутевогоЛиста 	= ВыборкаПараметры.РеквизитПутевогоЛиста.Метаданные().ЗначенияПеречисления[Перечисления.CW_РеквизитыПутевыхЛистов.Индекс(ВыборкаПараметры.РеквизитПутевогоЛиста)].Имя;
				Параметр 				= ВыборкаПараметры.ПараметрГрузоперевозки;
				
				ИмяРеквизита = СтрЗаменить(РеквизитПутевогоЛиста,"ЭтапыМаршрута_","");
				
				СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ГрузоперевозкаИзМассива, ВыборкаПараметры.ПараметрГрузоперевозки);
				Если (СтрокаПараметра <> Неопределено) Тогда
					Попытка
						НоваяСтрока[ИмяРеквизита] = СтрокаПараметра.Значение;
					Исключение
					КонецПопытки;
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьЗаполняемыеПараметрыПоГрузопереовзке(МассивГрузоперевозок)
	
	Запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка,
	               |	CW_Грузоперевозки.ТипПеревозки КАК ТипПеревозки
	               |ПОМЕСТИТЬ ВТ_ТипыГрузоперевозок
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.Ссылка В(&МассивГрузоперевозок)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_Грузоперевозки.ТипПеревозки,
	               |	CW_Грузоперевозки.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТипыГрузоперевозок.Ссылка КАК Грузопереовзка,
	               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста КАК РеквизитПутевогоЛиста,
	               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр КАК ПараметрГрузоперевозки
	               |ИЗ
	               |	ВТ_ТипыГрузоперевозок КАК ВТ_ТипыГрузоперевозок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CW_ТипыПеревозок.ПараметрыПутевыхЛистов КАК CW_ТипыПеревозокПараметрыПутевыхЛистов
	               |		ПО ВТ_ТипыГрузоперевозок.ТипПеревозки = CW_ТипыПеревозокПараметрыПутевыхЛистов.Ссылка
	               |ГДЕ
	               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ТипыГрузоперевозок.ТипПеревозки КАК ТипПеревозки
	               |			ИЗ
	               |				ВТ_ТипыГрузоперевозок КАК ВТ_ТипыГрузоперевозок)
	               |	И CW_ТипыПеревозокПараметрыПутевыхЛистов.ЧитатьИзГрузоперевозки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.РеквизитПутевогоЛиста,
	               |	CW_ТипыПеревозокПараметрыПутевыхЛистов.Параметр,
	               |	ВТ_ТипыГрузоперевозок.Ссылка
	               |ИТОГИ ПО
	               |	Грузопереовзка";
	
	Запрос.УстановитьПараметр("МассивГрузоперевозок", МассивГрузоперевозок); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура МедработникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьОтветственноеЛицо("Медработник");
	
КонецПроцедуры

&НаКлиенте
Процедура СопровождающийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьОтветственноеЛицо("Сопровождающий");
	
КонецПроцедуры

&НаКлиенте
Процедура СопровождающийДополнительныйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьОтветственноеЛицо("СопровождающийДополнительный");
	
КонецПроцедуры

&НаКлиенте
Процедура Диспетчер_ВыездНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьОтветственноеЛицо("Диспетчер_Выезд");
	
КонецПроцедуры

&НаКлиенте
Процедура Диспетчер_ВозвращениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьОтветственноеЛицо("Диспетчер_Возвращение");
	
КонецПроцедуры

&НаКлиенте
Процедура Механик_ВыездНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьОтветственноеЛицо("Механик_Выезд");

КонецПроцедуры

&НаКлиенте
Процедура Механик_ВозвращениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьОтветственноеЛицо("Механик_Возвращение");
	
КонецПроцедуры

&НаКлиенте
Процедура МедработникВозвращениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьОтветственноеЛицо("МедработникВозвращение");

КонецПроцедуры

// --- 

&НаКлиенте
Процедура ВыбратьОтветственноеЛицо(Реквизит)
	// --- 
	
	Роль = Неопределено;
	// --- 
	Если (Реквизит = "Сопровождающий" ИЛИ Реквизит = "СопровождающийДополнительный") Тогда
		
		РольСотрудника = ПредопределенноеЗначение("Справочник.CW_РолиСотрудников.СопровождающееЛицо");
		
	ИначеЕсли (Реквизит = "Медработник" ИЛИ Реквизит = "МедработникВозвращение") Тогда 
		
		РольСотрудника = ПредопределенноеЗначение("Справочник.CW_РолиСотрудников.Врач");
		
	ИначеЕсли (Реквизит = "Диспетчер_Выезд" ИЛИ Реквизит = "Диспетчер_Возвращение") Тогда 
		
		РольСотрудника = ПредопределенноеЗначение("Справочник.CW_РолиСотрудников.Диспетчер");
		
	ИначеЕсли (Реквизит = "Механик_Выезд" ИЛИ Реквизит = "Механик_Возвращение") Тогда 
		
		РольСотрудника = ПредопределенноеЗначение("Справочник.CW_РолиСотрудников.Механик");
		
	КонецЕсли; 
	// --- 
	СтруктураПараметровФормы = новый Структура;
	СтруктураПараметровФормы.Вставить("РольСотрудника"				, РольСотрудника);
	СтруктураПараметровФормы.Вставить("Организация"					, Объект.Организация);
	СтруктураПараметровФормы.Вставить("ОтборПоОрганизации"			,  ЗначениеЗаполнено(Объект.Организация));
	СтруктураПараметровФормы.Вставить("ВозможностьСоздаватьЗаписи"	, Ложь);
	СтруктураПараметровФормы.Вставить("РежимВыбора"					, истина);

	ДополнительныеПараметры = Новый Структура("Реквизит", Реквизит);
	// --- 
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораОтветственногоЛица",ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораСотрудникаДляРоли",СтруктураПараметровФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	// --- 
КонецПроцедуры



&НаКлиенте
Процедура ОбработкаВыбораОтветственногоЛица(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Объект[ДополнительныеПараметры.Реквизит]=Ответ;
		
	КонецЕсли; 	
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаПересчитатьНормативныйРасход(Команда)
	
	НеобходимоПересчитатьНормативныйРасход = Ложь;
	_ПересчитатьНормативныйРасход();
	
КонецПроцедуры

&НаСервере
Процедура _ПересчитатьНормативныйРасход()
	
	тОбъект = РеквизитФормыВЗначение("Объект");
	
	ПорядокПолученияНормативов = Константы.CW_ПорядокРасчетаНормативаТоплива.Получить();
	
	ИтогоРасходПоНорме = 0;
	Для ИндексСтроки = 0 по Объект.ЭтапыМаршрута.Количество() - 1 Цикл
		
		ТекущаяСтрокаГрузоперевозки = Объект.ЭтапыМаршрута[ИндексСтроки];
		
		Если ПорядокПолученияНормативов = Перечисления.CW_ПорядокРасчетаНормативаТоплива.НаДатуНачалаПеревозки Тогда
			ДатаСреза 	= Макс(ТекущаяСтрокаГрузоперевозки.ДатаПогрузки, ТекущаяСтрокаГрузоперевозки.ДатаВыезда);
		Иначе
			ДатаСреза 	= Макс(ТекущаяСтрокаГрузоперевозки.ДатаРазгрузки, ТекущаяСтрокаГрузоперевозки.ДатаВозвращения);
		КонецЕсли;
		
		СсылкаТранспортноеСредство 	= ТекущаяСтрокаГрузоперевозки.ТранспортноеСредство;
		СсылкаПрицеп				= Объект.Прицеп;
		СсылкаМодель				= СсылкаТранспортноеСредство.Модель;
		ФормулаМодели				= СсылкаТранспортноеСредство.Модель.ФормулаРасчетаНормыРасходаТоплива;
		
		мДопОборудование = Неопределено;
		Если ИспользуетсяДополнительноеОборудование Тогда
			ЕстьДопОборудование = Объект.ДополнительноеОборудование.Количество() > 0;
			Если мДопОборудование = Неопределено тогда
				мДопОборудование 	= Объект.ДополнительноеОборудование.Выгрузить().ВыгрузитьКолонку("ДополнительноеОборудование");
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыФормулы = CW_УчетСобственногоТранспортаСервер.ПолучитьДействующуюФормулуНормрасходатранспортныхСредств(ДатаСреза, СсылкаТранспортноеСредство);
		
		Если НЕ ПараметрыФормулы = Неопределено Тогда
			СсылкаНаФормулу			= ПараметрыФормулы.ФормулаРасчетаНормыРасходаТоплива; 
		Иначе
			СсылкаНаФормулу 		= ФормулаМодели;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СсылкаНаФормулу) Тогда
			Возврат;
		КонецЕсли;
		
		Формула	= СсылкаНаФормулу.ФормулаРасчета;
		Формула	= CW_УчетСобственногоТранспортаСервер.ПривестиФормулуКСтроке(Формула);
		
		НаименованиеФормулы = СсылкаНаФормулу.Наименование;
		// --- 
		ПараметрыВыполненияФормулы = CW_УчетСобственногоТранспортаСервер.ПараметрыВыполненияФормулы(Формула,,НаименованиеФормулы);
		
		Если ПараметрыВыполненияФормулы = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		//Получим показатели   
		мПоказатели 					=  Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПолучитьМассивПоказателей();
		
		ЗначенияПоказателейМодели	= новый Соответствие;
		тОбъект.ПолучитьЗначенияПоказателей(ДатаСреза, ЗначенияПоказателейМодели				, СсылкаМодель					, мПоказатели);
		
		Если ИспользуютсяПоказателиТранспортногоСредства Тогда
			ЗначенияПоказателейтранспортногоСредства 		= новый Соответствие;
			тОбъект.ПолучитьЗначенияПоказателей(ДатаСреза, ЗначенияПоказателейтранспортногоСредства	, СсылкаТранспортноеСредство	, мПоказатели);
		КонецЕсли;
		
		Если ИспользуетсяДополнительноеОборудование Тогда
			Если ЕстьДопОборудование тогда
				ЗначенияПоказателейДополнительногоОборудования 	= новый Соответствие;
				мПоказателиДопОборудования 		=  Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПолучитьМассивДоступныхПоказателейПоВидутранспортногоСредства(ПредопределенноеЗначение("Перечисление.CW_ВидыТС.ДополнительноеОборудование"));
				тОбъект.ПолучитьЗначенияПоказателей(ДатаСреза, ЗначенияПоказателейДополнительногоОборудования, мДопОборудование	, мПоказателиДопОборудования);
			КонецЕсли;
		КонецЕсли;
		
		СоответствиеПоказателейШапки			=  Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПолучитьСоответствиеПоказателейШапки();
		СоответствиеПоказателейТабличнойЧасти	=  Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПолучитьСоответствиеПоказателейТабличнойЧасти();
		МассивПоказателейСОсобымПорядком		=  Справочники.CW_ПоказателиРасчетаРасходаТоплива.ПоулчитьМассивПоказателейСОсобымПорядком();
		
		ИсходныеДанные 					= Новый Структура;
		мПоказателиТабличнойЧасти 		= Новый Массив;
		мПоказателиОсобыйПорядок 		= Новый Массив;
		
		// заполняем исходные данные по настраиваемым показателям
		Для каждого Показатель из ПараметрыВыполненияФормулы.ПоказателиФормулы Цикл
			Если Показатель.УказываетсяВНастройках тогда
				
				ЗначениеПоказателя =  ЗначенияПоказателейМодели.Получить(Показатель);
				
				Если ИспользуютсяПоказателиТранспортногоСредства Тогда
					ЗначениеПоказателяТС =  ЗначенияПоказателейтранспортногоСредства.Получить(Показатель);
					Если ЗначениеЗаполнено(ЗначениеПоказателяТС) Тогда
						ЗначениеПоказателя = ЗначениеПоказателяТС;
					КонецЕсли;
				КонецЕсли;
				
				ИсходныеДанные.Вставить(Показатель.Идентификатор, ?(ЗначениеПоказателя = Неопределено,0, ЗначениеПоказателя));
				
			Иначе
				
				ПоказательПолучен = Ложь;
				ПутьКДаннымПоказателяШапки = СоответствиеПоказателейШапки.Получить(Показатель);
				Если ПутьКДаннымПоказателяШапки <> Неопределено Тогда
					ИсходныеДанные.Вставить(Показатель.Идентификатор, Вычислить(СокрЛП(ПутьКДаннымПоказателяШапки)));
					ПоказательПолучен = истина;
				КонецЕсли;
				
				ПутьКДаннымПоказателяТабличнойЧасти = СоответствиеПоказателейТабличнойЧасти.Получить(Показатель);
				Если ПутьКДаннымПоказателяТабличнойЧасти <> Неопределено Тогда
					мПоказателиТабличнойЧасти.Добавить(Показатель);
					ПоказательПолучен = истина;
				КонецЕсли;
				
				НомерВМассиве = МассивПоказателейСОсобымПорядком.Найти(Показатель);
				Если НомерВМассиве <> Неопределено Тогда
					мПоказателиОсобыйПорядок.Добавить(Показатель);
					ПоказательПолучен = истина;
				КонецЕсли;

				Если Не ПоказательПолучен Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Неизвестный покзаатель расчета расхода топлива: "+СокрЛП(Показатель);
					Сообщение.Сообщить();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Показатель из мПоказателиТабличнойЧасти Цикл
			
			ПутьКДаннымПоказателяТабличнойЧасти = СоответствиеПоказателейТабличнойЧасти.Получить(Показатель);
			ИсходныеДанные.Вставить(Показатель.Идентификатор, Вычислить(СокрЛП(ПутьКДаннымПоказателяТабличнойЧасти)));
			
		КонецЦикла;
		
		Для Каждого Показатель из мПоказателиОсобыйПорядок Цикл
			
			Если Показатель =  ПредопределенноеЗначение("Справочник.CW_ПоказателиРасчетаРасходаТоплива.ВремяПростоя") Тогда
				//Дополним исходные данные временим простоя
				ИдентификаторСтроки 	= Вычислить("Объект.ЭтапыМаршрута[ИндексСтроки].ИдентификаторСтроки");
				
				Отбор = Новый Структура("ИдентификаторСтроки,ДвигательВключен", ИдентификаторСтроки, Истина);
				ТабПростои = Объект.Простои.Выгрузить().Скопировать(Отбор);
				
				ИсходныеДанные.Вставить(Показатель.Идентификатор, ТабПростои.Итог("ВремяПростояЧас"));
				
			Иначе
				
				//другие возможные показатели
				
			КонецЕсли;
			
		КонецЦикла;
		

		
		РасходПоНормеЭтапа = CW_УчетСобственногоТранспортаСервер.ВыполнитьРасчетНормыРасходаТопливаПоФормуле(ИсходныеДанные, ПараметрыВыполненияФормулы);
		
		// -----
		//Данные распредения нормы по строкам
		ТекущаяСтрокаГрузоперевозки.РасходНорма = РасходПоНормеЭтапа;
		// -----
		
		ИтогоРасходПоНорме = ИтогоРасходПоНорме + РасходПоНормеЭтапа;
		
	КонецЦикла;
	
	// ---
	
	Объект.РасходПоНорме 			= ИтогоРасходПоНорме;
	
	ПрересчитатьФактическийРасходПоНорме();
	
	Если Объект.ПриравнятьФактическийРасходКНормативному Тогда
		Объект.РасходПоНорме  			= Объект.РасходТоплива;
	КонецЕсли;
	
	ВсегоПробег 					= Объект.ЭтапыМаршрута.Итог("Пробег");
	Объект.РасходПоНормеСредний 	= Объект.РасходПоНорме / ВсегоПробег * 100; 
	
	_ПересчитатьРасходТоплива();

	ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива();

КонецПроцедуры  


&НаСервере
Процедура ПрересчитатьФактическийРасходПоНорме()
	
	//Пересчитаем распредление фактического расхода
	ТопливоКРаспределению = Объект.РасходТоплива;
	Для каждого СтрокаРаспределения из Объект.ЭтапыМаршрута Цикл
		
		КоэфРаспределения =  СтрокаРаспределения.РасходНорма  / Объект.РасходПоНорме;
		
		РасходПоСтроке = Окр(Объект.РасходТоплива * КоэфРаспределения, 3);
		
		СтрокаРаспределения.РасходФакт  = РасходПоСтроке;
		
		Если Объект.ПриравнятьФактическийРасходКНормативному Тогда
			СтрокаРаспределения.РасходНорма  = РасходПоСтроке;
		КонецЕсли;
		
		ТопливоКРаспределению =  ТопливоКРаспределению - РасходПоСтроке; 
		
	КонецЦикла;
	
	Если ТопливоКРаспределению <> 0 Тогда
		СтрокаРаспределения.РасходФакт = СтрокаРаспределения.РасходФакт + ТопливоКРаспределению;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МашинаПриИзменении(Элемент)
	
	ПриИзменениитранспортногоСредстваНаСервере();
	ОбновитьДанныеДляРасчетаПогрешности();
	УстановитьВидимостьЭлементовФормы();
	ОбновитьДанныеРегистрационныхЗнаков();
	
КонецПроцедуры

&НаКлиенте
Процедура МашинаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПриИзменениитранспортногоСредстваНаСервере();
	ОбновитьДанныеДляРасчетаПогрешности();
	УстановитьВидимостьЭлементовФормы();
	ОбновитьДанныеРегистрационныхЗнаков();

КонецПроцедуры


&НаСервере
Процедура ПриИзменениитранспортногоСредстваНаСервере()
	
	Если СтароеТранспортноеСредство <> Объект.ТранспортноеСредство Тогда
		
		Объект.Водитель =  Объект.ТранспортноеСредство.ОсновнойВодитель;
		Объект.Прицеп 	=  Объект.ТранспортноеСредство.ОсновнойПрицеп;
		
		ВодительПриИзмененииНаСервере() ;

		ЗаполнитьТопливоНаСервере();
		
		ЗаполнитьСкладБУ_ИзПараметров();
		
		Если ИспользуетсяДополнительноеОборудование Тогда
			ЗаполнитьДополнительноеОборудование();
		КонецЕсли;
		
		СтароеТранспортноеСредство = Объект.ТранспортноеСредство;
	
	КонецЕсли;
	
	ОбработатьТаблицуЭтапыМаршрута(Ложь, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСкладБУ_ИзПараметров()
	
	СкладБУ = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ПараметрыТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
		|	CW_ПараметрыТССрезПоследних.ПараметрТранпортногоСредства КАК ПараметрТранпортногоСредства,
		|	CW_ПараметрыТССрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.CW_ПараметрыТС.СрезПоследних(
		|			&ДатаСреза,
		|			ТранспортноеСредство = &ТранспортноеСредство
		|				И ПараметрТранпортногоСредства = &ПараметрТранпортногоСредства) КАК CW_ПараметрыТССрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза"					, Объект.Дата);
	Запрос.УстановитьПараметр("ТранспортноеСредство"		, Объект.ТранспортноеСредство);
	Запрос.УстановитьПараметр("ПараметрТранпортногоСредства", ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СкладБУ = ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;	

	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительноеОборудование()
	
	Объект.ДополнительноеОборудование.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_ДополнительноеОборудованиеТС.ДополнительноеОборудование КАК ДополнительноеОборудование,
	|	CW_ДополнительноеОборудованиеТС.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_ДополнительноеОборудованиеТС.ДополнительноеОборудование.ОсновноеТопливо КАК Топливо
	|ИЗ
	|	РегистрСведений.CW_ДополнительноеОборудованиеТС КАК CW_ДополнительноеОборудованиеТС
	|ГДЕ
	|	CW_ДополнительноеОборудованиеТС.ТранспортноеСредство = &ТранспортноеСредство
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_ДополнительноеОборудованиеТС.ТранспортноеСредство,
	|	CW_ДополнительноеОборудованиеТС.ДополнительноеОборудование,
	|	CW_ДополнительноеОборудованиеТС.ДополнительноеОборудование.ОсновноеТопливо";
	
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.ТранспортноеСредство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Объект.ДополнительноеОборудование.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТопливоНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		
		Объект.Топливо = Объект.ТранспортноеСредство.ОсновноеТопливо;
		
	Иначе
		
		Объект.Топливо = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Водители.Загрузить(Водители.Выгрузить());
	
	Если Не	Объект.Статус = Статус  Тогда
		ТекущийОбъект.Статус = Статус;
	КонецЕсли;
	
	//-------------------
	
	Если ЗначениеЗаполнено(Объект.АналитикаЗатрат) Тогда
		ПроверитьУникальностьАналитикиЗатрат(Отказ);
	КонецЕсли;
	
	_СохранитьСеансовуюНастройку();

КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьАналитикиЗатрат(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.ПутевойЛист КАК ПутевойЛист,
		|	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
		|	ПРЕДСТАВЛЕНИЕ(CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппаПредставление,
		|	ПРЕДСТАВЛЕНИЕ(CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.ПутевойЛист) КАК ПутевойЛистПредставление
		|ИЗ
		|	РегистрСведений.CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп КАК CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп
		|ГДЕ
		|	НЕ CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.ПутевойЛист = &ПутевойЛист
		|	И CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.НоменклатурнаяГруппа = &НоменклатурнаяГруппа";
	
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа"	, Объект.АналитикаЗатрат);
	Запрос.УстановитьПараметр("ПутевойЛист"				, Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Аналитика затрат "+ВыборкаДетальныеЗаписи.НоменклатурнаяГруппаПредставление+" уже используется для путевого листа "+ВыборкаДетальныеЗаписи.ПутевойЛистПредставление;
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.Поле 	= "АналитикаЗатрат";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокТопливаПриВозвращенииПриИзменении(Элемент)
	
	_ПересчитатьРасходТоплива();

КонецПроцедуры

&НаКлиенте
Процедура ПростоиВремяПростояПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Простои.ТекущиеДанные;
	
	ВремяПростоя = ОКР((ТекущиеДанные.ВремяПростоя - Дата(1,1,1))/3600, 2);
	
	ТекущиеДанные.ВремяПростояЧас = ВремяПростоя;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока или Копирование тогда
		ТекущиеДанные = Элементы.ЭтапыМаршрута.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		
		Если ТекущиеДанные.Пробег = 0 или Копирование Тогда
			ПробегПоСтроке =  ПробегПоОдометру - Объект.ЭтапыМаршрута.Итог("Пробег");
			ТекущиеДанные.Пробег = ?(ПробегПоСтроке < 0, 0, ПробегПоСтроке);
		КонецЕсли;
		
		ТекущиеДанные.Водитель 				= Объект.Водитель;
		ТекущиеДанные.ТранспортноеСредство 	= Объект.ТранспортноеСредство;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ЭтапыМаршрута.ТекущиеДанные;
	
	//Удалим строки
	тОтбор = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	
	мСтрокиПростои = Объект.Простои.НайтиСтроки(тОтбор);
	
	Если мСтрокиПростои.Количество() > 0 Тогда
		
		Для Каждого СтрокаМассива из мСтрокиПростои Цикл
			
			Объект.Простои.Удалить(СтрокаМассива);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыМаршрута.ТекущиеДанные;
	
	Если не ТекущиеДанные = Неопределено Тогда
		Элементы.Простои.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПростои(Команда)
	ПоказатьПростоиЭтапа = Не ПоказатьПростоиЭтапа;
	ПоказатьСкрытьПростоиЭтапа();
КонецПроцедуры

&НаСервере
Процедура ПоказатьСкрытьПростоиЭтапа()
	
	Элементы.ЭтапыМаршрутаПоказатьПростои.Пометка 	= ПоказатьПростоиЭтапа;
	Элементы.ГруппаПростои.Видимость 				= ПоказатьПростоиЭтапа;
	
КонецПроцедуры

&НаКлиенте
Процедура ПростоиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока или Копирование тогда
		ТекущиеДанные = Элементы.ЭтапыМаршрута.ТекущиеДанные;
		
		СтрокаПростой = Элементы.Простои.ТекущиеДанные;
		СтрокаПростой.ИдентификаторСтроки =  ТекущиеДанные.ИдентификаторСтроки;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасчет(Команда)
	
	Если ПрименяютсяНормативыРасходаТоплива и Объект.РассчитыватьНормативныйРасходТоплива тогда
		ТабДокумент = ВывестиРасшифровкуРасчетаНормативов();
		ТабДокумент.Показать("");
	Иначе
		ТабДокумент = ВывестиРасшифровкуРасчетаРаспредления();
		ТабДокумент.Показать("");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВывестиРасшифровкуРасчетаНормативов()
	
	тОбъект = РеквизитФормыВЗначение("Объект");
	
	Возврат тОбъект.ПолучитьДанныеДляПечати();
	
КонецФункции

&НаСервере
Функция ВывестиРасшифровкуРасчетаРаспредления()
	
	тОбъект = РеквизитФормыВЗначение("Объект");
	
	Возврат тОбъект.ПолучитьДанныеДляПечатиПоФактическомуРасходу();
	
	
КонецФункции

&НаКлиенте
Процедура ВыездФактПриИзменении(Элемент)
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ВозвращениеФактПриИзменении(Элемент)

	ИзменитьСтатусДокумента();
	УстановитьВидимостьЭлементовФормы();
	ОбновитьДанныеДляРасчетаПогрешности();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗакрытияПриИзменении(Элемент)
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусДокумента()
	
	Если ЗначениеЗаполнено(Объект.ДатаЗакрытия) Тогда
		Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПутевыхЛистов.Закрыт");
	ИначеЕсли Объект.ЭтапыМаршрута.Итог("РасходФакт") <> 0 Тогда
		Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПутевыхЛистов.Расчитан");
	ИначеЕсли ЗначениеЗаполнено(Объект.ВозвращениеФакт) Тогда
		Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПутевыхЛистов.ВОбработке");
	ИначеЕсли ЗначениеЗаполнено(Объект.ВыездФакт) Тогда
		Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПутевыхЛистов.ВРейсе");
	Иначе
		Статус = ПредопределенноеЗначение("Перечисление.CW_СтатусыПутевыхЛистов.Выписан");
	КонецЕсли;
	
КонецПроцедуры


//Водители документа
&НаКлиенте
Процедура ВодителиДокументаНажатие(Элемент)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ВодителиАдрес"		, ПолучитьАдресВодителей());	
	ПараметрыОткрытияФормы.Вставить("Организация"		, Объект.Организация );	
	ПараметрыОткрытияФормы.Вставить("ОсновнойОодитель"	, Объект.Водитель );	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаЗакрытияФормыСпискаВодителей",ЭтотОбъект, Новый Структура()); 
	
	ОткрытьФорму("Документ.CW_ПутевойЛист.Форма.ФормаВодителейДокумента",ПараметрыОткрытияФормы, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьАдресВодителей()
	
	Возврат ПоместитьВоВременноеХранилище(Водители.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ОбработкаЗакрытияФормыСпискаВодителей(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> Неопределено Тогда
		ОбработкаЗакрытияФормыСпискаВодителейНаСервере(Ответ);
	конецЕсли;
	
КонецПроцедуры

&наСервере
Процедура ОбработкаЗакрытияФормыСпискаВодителейНаСервере(Адерс)
	
	ТаблицаВодителей = ПолучитьИзВременногоХранилища(Адерс);
	Водители.Загрузить(ТаблицаВодителей);
	
	Отбор = Новый Структура("Основной", Истина);
	
	мСтроки = ТаблицаВодителей.НайтиСтроки(Отбор);
	
	Если мСтроки.Количество() > 0 Тогда
		
		ПерваяСтрока = мСтроки[0];
		Объект.Водитель = ПерваяСтрока.Водитель;
		
	Иначе
		
		Объект.Водитель = Неопределено;
		
	КонецЕсли;
	
	ВодительПриИзмененииНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	
	Если СтарыйВодитель <> Объект.Водитель Тогда
		УдалитьВодителяИзСписка(СтарыйВодитель);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Водитель) Тогда
		ДобавитьВодителяВСписок(Объект.Водитель);
	КонецЕсли;

	_ОбновитьПредставлениеВодителей();
	
	ОбработатьТаблицуЭтапыМаршрута(Истина, Ложь);
	ОбработатьТаблицуЗаправки();

	СтарыйВодитель = Объект.Водитель;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуЭтапыМаршрута(ЗаменятьВодителя, ЗаменятьТранспортноеСредство)
	
	Для Каждого СтрокаЭтапа из Объект.ЭтапыМаршрута Цикл
		
		Если ЗаменятьВодителя  Тогда
			Если Объект.НесколькоВодителей Тогда
				Если Не ЗначениеЗаполнено(СтрокаЭтапа.Водитель) 
					или СтарыйВодитель = СтрокаЭтапа.Водитель Тогда
					СтрокаЭтапа.Водитель = Объект.Водитель;
				КонецЕсли;
			Иначе
				СтрокаЭтапа.Водитель = Объект.Водитель;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗаменятьТранспортноеСредство Тогда
			СтрокаЭтапа.ТранспортноеСредство = Объект.ТранспортноеСредство;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуЗаправки()
	
	Для Каждого СтрокаЗаправки из Объект.Заправки Цикл
		
		Если Объект.НесколькоВодителей Тогда
			
			Если Не ЗначениеЗаполнено(СтрокаЗаправки.Водитель) 
				или СтарыйВодитель = СтрокаЗаправки.Водитель Тогда
				СтрокаЗаправки.Водитель = Объект.Водитель;
			КонецЕсли;
			
		Иначе
			СтрокаЗаправки.Водитель = Объект.Водитель;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьВодителяВСписок(ВодительКДобавлению)
	
	Если ЗначениеЗаполнено(ВодительКДобавлению) Тогда 
		
		Отбор 	= Новый Структура("Водитель", ВодительКДобавлению);
		мСтроки = Водители.НайтиСтроки(Отбор);
		
		Если мСтроки.Количество() = 0 Тогда
			
			СтрокаВодители = Водители.Добавить();
			СтрокаВодители.Водитель = ВодительКДобавлению;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВодителяИзСписка(ВодительКУдалению = Неопределено)
	
	Если ВодительКУдалению = Неопределено Тогда
		Водители.Очистить();
	Иначе
		
		//Удалим старого водителя	
		Отбор = Новый Структура("Водитель", ВодительКУдалению);
		
		мСтроки = Водители.НайтиСтроки(Отбор);
		
		Если мСтроки.Количество() <> 0 Тогда
			НайденнаяСтрока = мСтроки[0];
			Водители.Удалить(НайденнаяСтрока);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	
	ВодительПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НесколькоВодителейПриИзменении(Элемент)
	
	ОбработатьИзменениеФлага();
	
	_ОбновитьПредставлениеВодителей();
	
	ОбработатьТаблицуЭтапыМаршрута(Истина, Ложь);
	ОбработатьТаблицуЗаправки();

КонецПроцедуры

&насервере
Процедура ОбработатьИзменениеФлага()
	
	Если НЕ Объект.НесколькоВодителей Тогда
		//Флаг снят
		Водители.Очистить();
		ДобавитьВодителяВСписок(Объект.Водитель);

	КонецЕсли;
	
	УстановитьВидимостьСсылкиВодители();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСсылкиВодители()
	
	Элементы.ВодителиДокумента.Видимость	 = Объект.НесколькоВодителей;
	
КонецПроцедуры

&НаСервере
Процедура _ОбновитьПредставлениеВодителей()
	
	Элементы.ВодителиДокумента.Заголовок 	= "Список (" + Формат(Водители.Количество(),"ЧДЦ=0; ЧГ=0")+")";
	Элементы.Водитель.Доступность 			= Не Объект.НесколькоВодителей;
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьАналиткуЗатрат(Команда)
	
	Если Модифицированность тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо записать документ!';"
		+ " en = 'You should write the document!'")); 
		
	Иначе
		
		СгенерироватьАналиткуЗатратНаСервере();
		
		ТекстОповещения	= "Записана номенклатурная группа";
		ТекстПояснения	= Строка(Объект.АналитикаЗатрат) + " сопоставлена с путевым листом";
		ПоказатьОповещениеПользователя(ТекстОповещения, ПолучитьНавигационнуюСсылку(Объект.АналитикаЗатрат), ТекстПояснения);
	
		ОбновитьОтображениеДанных();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СгенерироватьАналиткуЗатратНаСервере()
	
	АдресВХранилище = ПолучитьАналитикуЗатрат();
	
	Объект.АналитикаЗатрат = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАналитикуЗатрат()
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Водитель)  Тогда
		
		Сообщение  = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран водитель!";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Поле = "Водитель";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонеЦЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство)  Тогда
		
		Сообщение  = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран Транспортное средство!";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Поле = "ТранспортноеСредство";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонеЦЕсли;
	
	Если Отказ Тогда
		Возврат ПоместитьВоВременноеХранилище(Неопределено);
	КонецЕсли;

	ОсновнойСпособУчетаНДС = CW_Настройки.ПараметрУчетнойПолитики(Объект.ДатаЗакрытия, Объект.Организация, "ОсновнойСпособУчетаНДС");
	
	ДатаСреза = ПолучитьДатуСреза();
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДатаСреза"					, ДатаСреза);
	СтруктураДанных.Вставить("ТранспортноеСредство"			, Объект.ТранспортноеСредство);
	СтруктураДанных.Вставить("ПараметрТранпортногоСредства"	, ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.ГруппаПутевыхЛистов);
	
	ГруппаПутевыхЛистов = CW_УчетСобственногоТранспортаСервер.ПолучитьПараметрТранспортногоСредства(СтруктураДанных);
	
	спрНовыйОбъект = ПолучитьСоответствиеПутевогоЛистаИАналитикиЗатрат();
	
	спрНовыйОбъект.Родитель 		= ?(ЗначениеЗаполнено(ГруппаПутевыхЛистов), ГруппаПутевыхЛистов, Справочники.НоменклатурныеГруппы.ПустаяСсылка());
	спрНовыйОбъект.Наименование 	= СформироватьПредставлениеПутевогоЛиста();
	спрНовыйОбъект.СпособУчетаНДС 	= ОсновнойСпособУчетаНДС;
	
	спрНовыйОбъект.Записать();
	
	Возврат ПоместитьВоВременноеХранилище(спрНовыйОбъект.Ссылка);

КонецФункции

&НаСервере

&НаСервере
Функция СформироватьПредставлениеПутевогоЛиста()
	
	ИмяДокумента 	= РеквизитФормыВЗначение("Объект").Метаданные().Синоним;
	НомерДокумента 	= CW_Документы.ПолучитьНомерНаПечать(Объект.Ссылка);
	ДатаДокумента 	= Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	ФИОВодитель 	= ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СокрЛП(Объект.Водитель));
	стрМашина		= СокрЛП(Объект.ТранспортноеСредство.Наименование);
	
	Возврат ИмяДокумента + " № " + НомерДокумента+" от "+ДатаДокумента+ " ("+стрМашина+", "+ФИОВодитель+")";
	
КонецФункции

&НаСервере
Функция ПолучитьСоответствиеПутевогоЛистаИАналитикиЗатрат()
	
	спрНовыйОбъект = Неопределено;
	Если ЗначениеЗаполнено(Объект.АналитикаЗатрат) Тогда
		спрНовыйОбъект = Объект.АналитикаЗатрат.ПолучитьОбъект();
	КонецЕсли;
	
	Если спрНовыйОбъект = Неопределено тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.ПутевойЛист КАК ПутевойЛист,
		|	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|ИЗ
		|	РегистрСведений.CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп КАК CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп
		|ГДЕ
		|	CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.ПутевойЛист = &ПутевойЛист";
		
		Запрос.УстановитьПараметр("ПутевойЛист", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Если НЕ ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа.Пустая() Тогда
				
				спрНовыйОбъект = ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа.ПолучитьОбъект();
				
			КонецЕсли;
			
		конецЕсли;
		
	КонецЕсли;
	
	
	Если спрНовыйОбъект = Неопределено тогда
		спрНовыйОбъект = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
	КонецЕсли;
	
	Возврат  спрНовыйОбъект;
	
КонецФункции

&НаСервере
Процедура УдалитьСоответствиеНаСервере()
	
	ЗаписьСоответствия = РегистрыСведений.CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.СоздатьМенеджерЗаписи();
	ЗаписьСоответствия.ПутевойЛист = Объект.Ссылка;
	ЗаписьСоответствия.Прочитать();
	ЗаписьСоответствия.Удалить();
	
	Объект.АналитикаЗатрат = Неопределено;
	Модифицированность = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСоответствие(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаУдаления", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Соответствие аналитики затрат путевому листу будет удалено. Продолжить?';"
	+ " en = 'You should write the document. Continue?'"), Режим, 0); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаУдаления(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСоответствиеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметровФормы = новый Структура;
	СтруктураПараметровФормы.Вставить("РольСотрудника"				, ПредопределенноеЗначение("Справочник.CW_РолиСотрудников.Водитель"));
	СтруктураПараметровФормы.Вставить("Организация"					, Объект.Организация);
	СтруктураПараметровФормы.Вставить("ОтборПоОрганизации"			,  ЗначениеЗаполнено(Объект.Организация));
	СтруктураПараметровФормы.Вставить("ВозможностьСоздаватьЗаписи"	, Ложь);
	СтруктураПараметровФормы.Вставить("РежимВыбора"					, истина);

	ДополнительныйПараметр 		= Новый Структура("Реквизит","Водитель");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораВодителя",ЭтотОбъект, ДополнительныйПараметр);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораСотрудникаДляРоли",СтруктураПараметровФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВодителя(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Объект.Водитель = Ответ;
		ВодительПриИзмененииНаСервере();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПробегПриВозвращенииПриИзменении(Элемент)
	
	РассчиатьПробегПоОдометру();

КонецПроцедуры

&НаКлиенте
Процедура ПробегПриВыездеПриИзменении(Элемент)
	
	РассчиатьПробегПоОдометру();
	
КонецПроцедуры

&НаСервере
Процедура РассчиатьПробегПоОдометру()
	
	Если Не ЗначениеЗаполнено(Объект.ВозвращениеФакт) Тогда
		ПробегПоОдометру = 0;
	Иначе
		ПробегПоОдометру = Объект.ПробегПриВозвращении - Объект.ПробегПриВыезде;
	КонецЕсли;
	
	ПолучитьОтклонениеПробега();
	ВыделитьЦветомОтклонениеПробега();

КонецПроцедуры

&НаСервере
Процедура ПолучитьОтклонениеПробега()
	
	ОтклонениеПробега = ПробегПоОдометру - Объект.ЭтапыМаршрута.Итог("Пробег");
	ВыделитьЦветомОтклонениеПробега();
	
КонецПроцедуры

&НаСервере
Процедура ВыделитьЦветомОтклонениеПробега()
	
	Элементы.ГруппаГрузоперевозки_ОтклонениеПробега.Видимость = ОтклонениеПробега <> 0;
	
	Если ОтклонениеПробега <> 0 Тогда
		Элементы.ГруппаПробегТС.ЦветФона 							= ЦветаСтиля.КритичноеСобытиеНадежностьБанковЦветФона;
		Элементы.ГруппаГрузоперевозки_ОтклонениеПробега.ЦветФона 	= ЦветаСтиля.КритичноеСобытиеНадежностьБанковЦветФона;
	Иначе
		Элементы.ГруппаПробегТС.ЦветФона 							= Новый Цвет;
		Элементы.ГруппаГрузоперевозки_ОтклонениеПробега.ЦветФона 	= Новый Цвет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВодительОчистка(Элемент, СтандартнаяОбработка)
	
	Водители.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаГрузоперевозкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыМаршрута.ТекущиеДанные;
	ПриИзмененииГрузоперевозкиНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаГрузоперевозкаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЭтапыМаршрута.ТекущиеДанные;
	ПриИзмененииГрузоперевозкиНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииГрузоперевозкиНаСервере(ИдентификаторСтроки)
	
	СтрокаЭтапа = Объект.ЭтапыМаршрута.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	МассивГрузоперевозок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаЭтапа.Грузоперевозка);
	
	РезультатЗапроса = ПолучитьЗаполняемыеПараметрыПоГрузопереовзке(МассивГрузоперевозок);	
	
	Выборка_Грузопереовозки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для каждого ГрузоперевозкаИзМассива Из МассивГрузоперевозок Цикл
		
		СтрокаЭтапа.КоличествоЕздок	= 1;
		СтрокаЭтапа.Груз 			= ГрузоперевозкаИзМассива.Груз;
		
		//Заполнение парамтеров
		Выборка_Грузопереовозки.Сбросить();
		Если Выборка_Грузопереовозки.НайтиСледующий(новый Структура("Грузопереовзка",ГрузоперевозкаИзМассива)) Тогда
		
			ВыборкаПараметры = Выборка_Грузопереовозки.Выбрать();
			
			Пока ВыборкаПараметры.Следующий() Цикл
				РеквизитПутевогоЛиста 	= ВыборкаПараметры.РеквизитПутевогоЛиста.Метаданные().ЗначенияПеречисления[Перечисления.CW_РеквизитыПутевыхЛистов.Индекс(ВыборкаПараметры.РеквизитПутевогоЛиста)].Имя;
				Параметр 				= ВыборкаПараметры.ПараметрГрузоперевозки;
				
				ИмяРеквизита = СтрЗаменить(РеквизитПутевогоЛиста,"ЭтапыМаршрута_","");
				
				СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ГрузоперевозкаИзМассива, ВыборкаПараметры.ПараметрГрузоперевозки);
				Если (СтрокаПараметра <> Неопределено) Тогда
					Попытка
						СтрокаЭтапа[ИмяРеквизита] = СтрокаПараметра.Значение;
					Исключение
					КонецПопытки;
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЕсли;
		
	КонецЦикла; 
	
	ЗаполнитьДобавленныеКолонкиТаблиц("ЭтапыМаршрута");

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДокументЗаправки(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("СкладПолучатель"	, СкладБУ);
	
	ДанныеОтбора = Новый Структура("Отбор",ПараметрыОтбора); 
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораПеремещнийТовара", ЭтаФорма, Параметры);	
	
	ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаВыбора", ДанныеОтбора,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораПеремещнийТовара(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбора <> Неопределено Тогда
		
		ОбработатьВыборНаСервере(ЗначениеВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборНаСервере(МассивЗначений)
	
	Если НЕ ТипЗнч(МассивЗначений) = Тип("Массив") Тогда
		
		МассивЗначений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МассивЗначений);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Ссылка КАК Документ,
		|	СУММА(ПеремещениеТоваровТовары.Количество) КАК Объем
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка В(&мСсылки)
		|	И ПеремещениеТоваровТовары.Номенклатура = &Номенклатура
		|	И ПеремещениеТоваровТовары.Ссылка.СкладПолучатель = &СкладПолучатель
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеТоваровТовары.Ссылка";
	
	Запрос.УстановитьПараметр("мСсылки"				, МассивЗначений);
	Запрос.УстановитьПараметр("Номенклатура"		, Объект.Топливо);
	Запрос.УстановитьПараметр("СкладПолучатель"		, СкладБУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		мСтроки = Объект.ТопливоВыдано.НайтиСтроки(Новый Структура("Документ",Выборка.Документ));
		
		если мСтроки.Количество() > 0 тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ "+СокрЛП(Выборка.Документ) +" уже есть в списке";
			Сообщение.Сообщить();
			
		Иначе
			
			НоваяСтрока = Объект.ТопливоВыдано.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ДанныеСтроки = Элементы.Заправки.ТекущиеДанные;
		
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, ПолучитьданныеСтрокиЗаправкиДляЗаполнения());

	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьданныеСтрокиЗаправкиДляЗаполнения()
	
	СтрктураДанных = Новый Структура;
	СтрктураДанных.Вставить("ВариантЗаправки"	, ПредопределенноеЗначение("Перечисление.CW_ВариантыЗаправокТС.НаличныйРасчет"));
	СтрктураДанных.Вставить("СтавкаНДС"			,  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(Объект.Топливо));
	СтрктураДанных.Вставить("Водитель"			, Объект.Водитель);
	СтрктураДанных.Вставить("Топливо"			, Объект.Топливо);
	
	
	Возврат СтрктураДанных;
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписьСоответствия 						= РегистрыСведений.CW_СоответствияПутевыхЛистовИНоменклатурныхГрупп.СоздатьМенеджерЗаписи();
	ЗаписьСоответствия.ПутевойЛист 			= ТекущийОбъект.Ссылка;
	ЗаписьСоответствия.НоменклатурнаяГруппа = ТекущийОбъект.АналитикаЗатрат;
	ЗаписьСоответствия.Записать(истина);
	
	ПроверитьИЗаписатьАналитикуЗатрат();
	
	ПодготовитьДанныеФормы();

КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаписатьАналитикуЗатрат()
	
	Если ЗначениеЗаполнено(Объект.АналитикаЗатрат) тогда
		
		ДатаСреза = ПолучитьДатуСреза();
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ДатаСреза"					, ДатаСреза);
		СтруктураДанных.Вставить("ТранспортноеСредство"			, Объект.ТранспортноеСредство);
		СтруктураДанных.Вставить("ПараметрТранпортногоСредства"	, ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.ГруппаПутевыхЛистов);
		ГруппаПутевыхЛистов = CW_УчетСобственногоТранспортаСервер.ПолучитьПараметрТранспортногоСредства(СтруктураДанных);
		
		Если  ГруппаПутевыхЛистов <> Неопределено Тогда
			
			Если Объект.АналитикаЗатрат.Родитель <> ГруппаПутевыхЛистов Тогда
				
				ОбъектАналитикаЗатрат = Объект.АналитикаЗатрат.ПолучитьОбъект();
				ОбъектАналитикаЗатрат.Родитель =  ГруппаПутевыхЛистов;
				ОбъектАналитикаЗатрат.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПростоиНачалоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Простои.ТекущиеДанные;
	ПересчитатьВремяПростоя(ТекущиеДанные);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПростоиОкончаниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Простои.ТекущиеДанные;
	ПересчитатьВремяПростоя(ТекущиеДанные);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВремяПростоя(ТекущиеДанные)
	
	Если  ТекущиеДанные.Окончание <  ТекущиеДанные.Начало Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСтроки = Новый Структура("Начало,Окончание,ВремяПростоя,ВремяПростояЧас");
	
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущиеДанные);
	
	ПересчитатьДанныеСтроки(СтруктураСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураСтроки);
	
	
КонецПроцедуры

&НаСервере
Функция ПересчитатьДанныеСтроки(СтркутураСтроки)
	
	ВремяПрсотояСек = СтркутураСтроки.Окончание - СтркутураСтроки.Начало;
	
	ВремяПростояЧас 					= ОКР((ВремяПрсотояСек)/3600, 2);
	СтркутураСтроки.ВремяПростояЧас 	= ВремяПростояЧас;

	ЧасПростоя = Формат(Цел(ВремяПрсотояСек/3600),"ЧН=00; ЧГ=0");
	МинПростоя = Формат(Цел((ВремяПрсотояСек - (ЧасПростоя * 3600))/60),"ЧН=00; ЧГ=0");
	
	СтркутураСтроки.ВремяПростоя 		=?(СтрДлина(ЧасПростоя)=1, "0","")+ЧасПростоя +":" +?(СтрДлина(МинПростоя)=1, "0","")+ МинПростоя;	
	СтркутураСтроки.ВремяПростояЧас 	= ВремяПростояЧас;	
	
КонецФункции

&НаКлиенте
Процедура КомандаРаспределитьТопливоПоГрузоперевозкам(Команда)
	
	НеобходимоПересчитатьНормативныйРасход = Ложь;
	РаспределитьФактическийРасходТоплива()
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьФактическийРасходТоплива()
	
	//Распределение выполянем пропоционально пробегу!
	БазаРаспределения = Объект.ЭтапыМаршрута.Итог("Пробег");
	
	Если БазаРаспределения = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось распределить топливо по грузопереовзкам. Отсутствуют данные пробега по грузоперевозкам!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	РасходТоплива  		= Объект.РасходТоплива;
	НужноРаспределить 	= РасходТоплива;
	
	//Для Каждого СтрокаЭтапа из Объект.ЭтапыМаршрута Цикл
	//	
	//	Если НужноРаспределить > 0 Тогда
	//		
	//		Коэффициент =  СтрокаЭтапа.Пробег / БазаРаспределения;
	//		
	//		КоличествоПоСтроке 		=  Окр(РасходТоплива * Коэффициент, 3);
	//		СтрокаЭтапа.РасходНорма	= КоличествоПоСтроке;
	//		СтрокаЭтапа.РасходФакт 	= КоличествоПоСтроке;
	//		
	//		НужноРаспределить = НужноРаспределить - КоличествоПоСтроке;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Если НужноРаспределить <> 0 Тогда
	//	//Погрешностьот округаления на последнюю строку
	//	СтрокаЭтапа.РасходНорма = СтрокаЭтапа.РасходНорма + НужноРаспределить;
	//	СтрокаЭтапа.РасходФакт 	= СтрокаЭтапа.РасходФакт + НужноРаспределить;
	//КонецЕсли;
	
	//
	Для Каждого СтрокаЭтапа из Объект.ЭтапыМаршрута Цикл
		
		Если НужноРаспределить > 0 Тогда
			
			Коэффициент =  СтрокаЭтапа.Пробег / БазаРаспределения;
			
			Если СтрокаЭтапа.НомерСтроки = Объект.ЭтапыМаршрута.Количество() Тогда
				СтрокаЭтапа.РасходНорма = НужноРаспределить;
				СтрокаЭтапа.РасходФакт  = НужноРаспределить;
				НужноРаспределить = 0;
			Иначе
				КоличествоПоСтроке   	=  Окр(РасходТоплива * Коэффициент, 3);
				СтрокаЭтапа.РасходНорма = КоличествоПоСтроке;
				СтрокаЭтапа.РасходФакт  = КоличествоПоСтроке;
				НужноРаспределить 		= НужноРаспределить - КоличествоПоСтроке;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	//
	
	
	ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВозвращениеПланФакт(Команда)

	Объект.ВозвращениеФакт = Объект.ВозвращениеПлан;
	ИзменитьСтатусДокумента();	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыездПланФакт(Команда)
	
	Объект.ВыездФакт = Объект.ВыездПлан;
	ИзменитьСтатусДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ОтражениеРасходовСверхНормативаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока или Копирование тогда
		ТекущиеДанные = Элементы.ОтражениеРасходовСверхНорматива.ТекущиеДанные;
		
		Если ТекущиеДанные.Количество = 0 Тогда
			КоличествоПоСтроке =  РасходОтклонение - Объект.ОтражениеРасходовСверхНорматива.Итог("Количество");
			ТекущиеДанные.Количество = ?(КоличествоПоСтроке < 0, 0, КоличествоПоСтроке);
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтражениеРасходовСверхНормативаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьЗаголовкиСвертываемыхГрупп();
	РассчитатьОстатокРаспределения();
		
КонецПроцедуры

&НаСервере
Процедура РассчитатьОстатокРаспределения()
	
	Если ПрименяютсяНормативыРасходаТоплива и Объект.РассчитыватьНормативныйРасходТоплива и  Не Объект.ПриравнятьФактическийРасходКНормативному Тогда
		
		ОсталосьРаспределить = РасходОтклонение - Объект.ОтражениеРасходовСверхНорматива.Итог("Количество");
		
		УстановитьЦветНадписиОстатокРаспределения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветНадписиОстатокРаспределения()
	
	Элементы.ОсталосьРаспределить.Видимость = ОсталосьРаспределить <> 0;
	
	Если ОсталосьРаспределить <> 0 тогда
		Элементы.ОсталосьРаспределить.ЦветФона = ЦветаСтиля.КритичноеСобытиеНадежностьБанковЦветФона;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаПробегСГрузомПриИзменении(Элемент)
	
	НеобходимоПересчитатьНормативныйРасход = Истина;
	
	ТекущиеДанные = Элементы.ЭтапыМаршрута.ТекущиеДанные;
	
	РасчитатьПробегПоСтроке(ТекущиеДанные.ПолучитьИдентификатор());
	ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива();

КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаВесГрузаПриИзменении(Элемент)
	
	НеобходимоПересчитатьНормативныйРасход = Истина;
	ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива();

КонецПроцедуры

&НаКлиенте
Процедура ПростоиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	НеобходимоПересчитатьНормативныйРасход = Истина;
	ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьДатуЗакрытияПутевогоЛиста(Команда)
	
	Модифицированность = Истина;     
	
	ПараметрыФормыПодстановки = новый Структура;
	ПараметрыФормыПодстановки.Вставить("ВозвращениеФакт", Объект.ВозвращениеФакт);    
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборВариантаПодстановки", ЭтотОбъект);
	
	ОткрытьФорму("Документ.CW_ПутевойЛист.Форма.ФормаВариантПодстановкиДаты", ПараметрыФормыПодстановки, ЭтаФорма,,,,ОписаниеОповещения);
	
	////Объект.ДатаЗакрытия = Объект.ВозвращениеФакт; //Удалено заявка AF8/3235
	//Объект.ДатаЗакрытия = ТекущаяДата(); //Заявка AF8/3235

	
КонецПроцедуры  

&наКлиенте
Процедура ЗавершитьВыборВариантаПодстановки(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	
	Если РезультатВыбора = 0 Тогда
		Объект.ДатаЗакрытия = ТекущаяДата(); 	 
	Иначе
		Объект.ДатаЗакрытия = Объект.ВозвращениеФакт; 
	КонецЕсли;

	ИзменитьСтатусДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитыватьНормативныйРасходТопливаПриИзменении(Элемент)
	
	НеобходимоПересчитатьНормативныйРасход = Истина;
	
	Если Не Объект.РассчитыватьНормативныйРасходТоплива тогда
		Объект.ПриравнятьФактическийРасходКНормативному = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриравнятьФактическийРасходКНормативномуПриИзменении(Элемент)
	
	НеобходимоПересчитатьНормативныйРасход = Истина;
	ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива();
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстатокТопливаПриВыездеПриИзменении(Элемент)
	
	_ПересчитатьРасходТоплива();

КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиДатаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Заправки.ТекущиеДанные;
	ТекущиеДанные.ДокументДата = ТекущиеДанные.ДатаЗаправки;
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Заправки.ТекущиеДанные;
	РасчитатьСуммуВсего(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиСтавкаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Заправки.ТекущиеДанные;
	РасчитатьСуммуВсего(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиВсегоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Заправки.ТекущиеДанные;
	РасчитатьСуммуПриИзмененииВсего(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Заправки.ТекущиеДанные;
	РасчитатьВсегоПриИзмененииСуммыНДС(ТекущиеДанные);
	
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьВсегоПриИзмененииСуммыНДС(ТекущиеДанные)
	
	СтруктураНДС = ПолучитьПроцентНДС(ТекущиеДанные.СтавкаНДС);
	
	Если Не СтруктураНДС.НДС_В_Сумме Тогда
		ТекущиеДанные.Всего = ТекущиеДанные.Сумма + ТекущиеДанные.НДС;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РасчитатьСуммуПриИзмененииВсего(ТекущиеДанные)
	
	СтруктураНДС = ПолучитьПроцентНДС(ТекущиеДанные.СтавкаНДС);
	
	Если СтруктураНДС.НДС_В_Сумме Тогда
		ТекущиеДанные.Сумма = ТекущиеДанные.Всего;
		ТекущиеДанные.НДС 	= ТекущиеДанные.Всего * СтруктураНДС.Ставка;
	Иначе
		ТекущиеДанные.НДС 	= ТекущиеДанные.Всего * СтруктураНДС.СтавкаОбратная;
		ТекущиеДанные.Сумма = ТекущиеДанные.Всего - ТекущиеДанные.НДС;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура РасчитатьСуммуВсего(ТекущиеДанные)
	
	СтруктураНДС 		= ПолучитьПроцентНДС(ТекущиеДанные.СтавкаНДС);
	
	ТекущиеДанные.НДС 	= ТекущиеДанные.Сумма * СтруктураНДС.Ставка;
	ТекущиеДанные.Всего = ТекущиеДанные.Сумма + ?(СтруктураНДС.НДС_В_Сумме, 0, ТекущиеДанные.НДС);
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьПроцентНДС(СтавкаНДС)
	
	Ответ = Новый Структура("Ставка,СтавкаОбратная,НДС_В_Сумме", 0, 0, Ложь);
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		
		Ответ.Ставка 			= 0.1;
		Ответ.СтавкаОбратная 	= 10/110;
		Ответ.НДС_В_Сумме 		= Ложь;
		
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") Тогда
		
		Ответ.Ставка 			= 10/110;
		Ответ.СтавкаОбратная 	= 0.1;
		Ответ.НДС_В_Сумме 		= Истина;
		
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
		
		Ответ.Ставка 			= 0.18;
		Ответ.СтавкаОбратная 	= 18/118;
		Ответ.НДС_В_Сумме 		= Ложь;
		
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118") Тогда
		
		Ответ.Ставка 			= 18/118;
		Ответ.СтавкаОбратная 	= 0.18;
		Ответ.НДС_В_Сумме 		= Истина;
		
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		
		Ответ.Ставка 			= 0.20;
		Ответ.СтавкаОбратная 	= 20/120;
		Ответ.НДС_В_Сумме 		= Ложь;
		
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120") Тогда
		
		Ответ.СтавкаОбратная 	= 0.20;
		Ответ.Ставка 			= 20/120;
		Ответ.НДС_В_Сумме 		= Истина;
		
		
	КонецЕсли;
	
Возврат Ответ;

	
КонецФункции

&НаКлиенте
Процедура КомандаПодборИзЖурнала(Команда)
	
	Оповещение 			= Новый ОписаниеОповещения("ОбработкаПодбораИзЖурнала",ЭтотОбъект); 
	ПараметрыФормыГП 	= Новый Структура("РежимВыбора,РежимОткрытия",Истина,"Подбор");
	
	ОткрытьФорму("Обработка.CW_ЖурналГрузоперевозок.Форма.Форма",ПараметрыФормыГП, ЭтаФорма,Истина,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбораИзЖурнала(Ответ, ДополнительныеПараметры) Экспорт
	
	Если (Ответ <> Неопределено) Тогда
		
		Если ТипЗнч(Ответ) <> тип("Массив") Тогда
			
			Ответ = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответ);
			
		КонецЕсли;
		
		_ЗаполнитьЭтапыПоГрузоперевозкамНовая(Ответ, Ложь);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаДатаПогрузкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыМаршрута.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ДатаВыезда) Тогда
		ТекущиеДанные.ДатаВыезда  = ТекущиеДанные.ДатаПогрузки;
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаДатаРазгрузкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыМаршрута.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ДатаВозвращения) Тогда
		ТекущиеДанные.ДатаВозвращения  = ТекущиеДанные.ДатаРазгрузки;
	Конецесли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПересчетаРаспределенияНажатие(Элемент)
	
	НеобходимоПересчитатьНормативныйРасход = Ложь;
	РаспределитьФактическийРасходТоплива();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНеобходимостьРасчетаТопливаНажатие(Элемент)
	
	НеобходимоПересчитатьНормативныйРасход = Ложь;
	_ПересчитатьНормативныйРасход();
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьПробегПоСтроке(ИдентификаторСтроки)
	
	ТекущаяСтрока = Объект.ЭтапыМаршрута.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ВводитьДанныеОПорожнемПробегеВДокументах Тогда
		ТекущаяСтрока.Пробег 			=  ТекущаяСтрока.ПробегСГрузом + ТекущаяСтрока.ПробегПорожний;
	Иначе
		ТекущаяСтрока.ПробегПорожний 	=  ТекущаяСтрока.Пробег - ТекущаяСтрока.ПробегСГрузом;
	КонецЕсли;
	РассчиатьПробегПоОдометру();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыМаршрутаПробегПорожнийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыМаршрута.ТекущиеДанные;
	РасчитатьПробегПоСтроке(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьОтражениеВПределахПогрешности(Команда)
	
	Если Объект.ОтражениеРасходовСверхНорматива.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОчисткеОтраженияРасходов", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, "Табличная часть будет очищена. Продолжить?", Режим, 0); 
	Иначе
		ЗаполнитьданныеПерерасхродаНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОчисткеОтраженияРасходов(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	Объект.ОтражениеРасходовСверхНорматива.Очистить();
	ЗаполнитьданныеПерерасхродаНаСервере();

КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьДанныеПерерасхродаНаСервере()
	
	//Подготовка данных к расчету
	ОстатокТоплива 		= Объект.ОстатокТопливаПриВозвращении;
	Перерасход 			= РасходОтклонение;
	ПогрешностьЛитры 	= ОстатокТоплива * ПогрешностьРасчета/100;
	
	ПерерасходВпределахПогрешности = Мин(ПогрешностьЛитры,Перерасход);
	
	Если ПерерасходВпределахПогрешности > 0 тогда
		
		НоваяСтрока = Объект.ОтражениеРасходовСверхНорматива.Добавить();
		НоваяСтрока.ВариантОтраженияЗатратПоБУ = ПорядокОтраженияЗатратВПеделахПогрешности;
		НоваяСтрока.Количество = ПерерасходВпределахПогрешности;
			
	КонецЕсли;
	
	РассчитатьОстатокРаспределения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ДатаЗакрытия) Тогда
		
		Если Объект.ДатаЗакрытия < Объект.Дата Тогда
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст 		= "Дата закрытия не может быть меньше даты документа!";
			Сообщение.Поле			= "ДатаЗакрытия";
			Сообщение.ПутьКДанным	= "Объект";
			Сообщение.Сообщить();
			Отказ = истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.Топливо) Тогда
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст 		= "Не указано топливо";
			Сообщение.Поле			= "Топливо";
			Сообщение.ПутьКДанным	= "Объект";
			Сообщение.Сообщить();
			Отказ = истина;
		Конецесли;
		
		Если Не ЗначениеЗаполнено(Объект.АналитикаЗатрат) Тогда
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст 		= "Не указана Аналитика затрат";
			Сообщение.Поле 			= "АналитикаЗатрат";
			Сообщение.ПутьКДанным	= "Объект";
			Сообщение.Сообщить();
			Отказ = истина;
		Конецесли;
		
		Если ОсталосьРаспределить <> 0 Тогда
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст 		= "Есть нераспределенный остаток перерасхода топлива!";
			Сообщение.Поле 			= "ОсталосьРаспределить";
			Сообщение.ПутьКДанным	= "ЭтаФорма";
			Сообщение.Сообщить();
			Отказ = истина;
			
		Конецесли;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВозвращениеФакт) тогда
		
		Если Объект.ВозвращениеФакт <= Объект.ВыездФакт тогда
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст 		= "Не правильно указана дата фактического возвращения!";
			Сообщение.Поле 			= "ВозвращениеФакт";
			Сообщение.ПутьКДанным	= "Объект";
			Сообщение.Сообщить();
			Отказ = истина;
		Конецесли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВозвращениеПлан) тогда
		
		Если Объект.ВозвращениеПлан <= Объект.ВыездПлан тогда
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст 		= "Не правильно указана дата планового возвращения!";
			Сообщение.Поле			= "ВозвращениеПлан";
			Сообщение.ПутьКДанным	= "Объект";
			Сообщение.Сообщить();
			Отказ = истина;
		Конецесли;
		
	КонецЕсли;
	
	Если Объект.РасходТоплива < 0 Тогда
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "Некорректно указанны данные расхода топлива!";
		Сообщение.Поле 			= "РасходТоплива";
		Сообщение.ПутьКДанным	= "Объект";
		Сообщение.Сообщить();             
		Отказ = истина;
	КонецЕсли;
	
	//провека табличной части "Этапы маршрутов"
	Для ИндексСтроки = 0 По Объект.ЭтапыМаршрута.Количество()-1 Цикл
		СтрокаЭтапа = Объект.ЭтапыМаршрута[ИндексСтроки];
		Если ЗначениеЗаполнено(СтрокаЭтапа.ДатаВозвращения) Тогда
			Если СтрокаЭтапа.ДатаВозвращения <=  СтрокаЭтапа.ДатаВыезда Тогда
				Сообщение = новый СообщениеПользователю;
				Сообщение.Текст 		= "Не правильно указана дата возвращения в строке "+Формат(ИндексСтроки+1,"ЧГ=0");
				Сообщение.Поле 			= "ЭтапыМаршрута["+Формат(ИндексСтроки,"ЧГ=0")+"].ДатаВозвращения";
				Сообщение.ПутьКДанным	= "Объект";
				Сообщение.Сообщить();
				Отказ = истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаЭтапа.ДатаРазгрузки) Тогда
			Если СтрокаЭтапа.ДатаРазгрузки <=  СтрокаЭтапа.ДатаПогрузки Тогда
				Сообщение = новый СообщениеПользователю;
				Сообщение.Текст 		= "Не правильно указана дата разгрузки в строке "+Формат(ИндексСтроки+1,"ЧГ=0");
				Сообщение.Поле 			= "ЭтапыМаршрута["+Формат(ИндексСтроки,"ЧГ=0")+"].ДатаРазгрузки";
				Сообщение.ПутьКДанным	= "Объект";
				Сообщение.Сообщить();
				Отказ = истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрицепПриИзменении(Элемент)
	
	ОчиститьДанныеПробегаБезПицепа();
	ОбновитьДанныеРегистрационныхЗнаков();

КонецПроцедуры

&наСервере
Процедура ОчиститьДанныеПробегаБезПицепа()
	
	Если Не ЗначениеЗаполнено(Объект.Прицеп) Тогда
		
		
		ЕстьИзменения = Ложь;
		
		Для каждого СтрокаМаршрута из Объект.ЭтапыМаршрута Цикл
			
			Если СтрокаМаршрута.ПробегБезПрицепа <> 0 тогда
				
				СтрокаМаршрута.ПробегБезПрицепа = 0;
				ЕстьИзменения 					= Истина;
				
			КонецЕсли;
			
		КонецЦикла;   
		
		Если ЕстьИзменения Тогда
			НеобходимоПересчитатьНормативныйРасход = Истина;
			ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЭтапыМаршрутаПробегБезПрицепаПриИзменении(Элемент)
	
	НеобходимоПересчитатьНормативныйРасход = Истина;
	ПоказатьНадписьНеобходимстиПересчетаРасходаТоплива();
			
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуСреза()
	
	ДатаВыездаВозвращения = Макс(Объект.ВозвращениеФакт, Объект.ВыездФакт);
	
	Возврат ?(ЗначениеЗаполнено(ДатаВыездаВозвращения), ДатаВыездаВозвращения, Объект.Дата);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
		
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	ИначеЕсли ИмяСобытия = "ОбновитьРегистрационныеНомера" Тогда
		ОбновитьДанныеРегистрационныхЗнаков();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если Не ТекущаяОрганизация = Объект.Организация Тогда
		Объект.Номер = "";
	КонецЕсли;
	
	ТекущаяОрганизация = Объект.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры

#КонецОбласти	


// ---------------------------------------------------------------------------- 


//_кф=GP.КлиентскиеФункции();

 
 