#Область НастройкиАвторизации

Процедура СохранитьНастройкиАвторизации(НастройкаИнтеграции, Токен) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(НастройкаИнтеграции, Токен, ИмяТокена());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПрочитатьНастройкиАвторизации(НастройкаИнтеграции)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(НастройкаИнтеграции, ИмяТокена());
КонецФункции

Функция ИмяТокена()
	Возврат "Токен_Версия_1_4";
КонецФункции

Функция ИнтеграцияНастроена(НастройкаИнтеграции) Экспорт
	Возврат ЗначениеЗаполнено(ПрочитатьНастройкиАвторизации(НастройкаИнтеграции));
КонецФункции 

#КонецОбласти

#Область Токен

// Возвращает данные токена по настройке интеграции
//
// Параметры:
//  НастройкаИнтеграции	 - СправочникСсылка.НастройкиИнтеграцииМаркетплейс - настройка интеграции
// 
// Возвращаемое значение:
//  Структура - см. ДанныеТокена
//
Функция ДанныеТокенаПоНастройкеИнтеграции(НастройкаИнтеграции) Экспорт
	
	Токен = ПрочитатьНастройкиАвторизации(НастройкаИнтеграции);
	Возврат ДанныеТокена(Токен);
	
КонецФункции

// Возвращает информацию о токене доступа к API Wildberries
//
// Параметры:
//  Токен	 - Строка - токен API Wildberries
// 
// Возвращаемое значение:
//  Структура - 
//     * ТекстОшибки - Строка - описание ошибки токена
//     * СрокДействия - Дата - срок действия токена
//     * Категории - Массив - категории, доступные в токене
//     * КодТипаТокена - Число - код типа токена (0,1,2,3,4)
//     * ТипТокена - Строка - представление типа токена, см. функцию ТипТокена
//     * ДоступнаяФункциональность - Массив - доступные действия в программе с API Wildberries
//     * НедоступнаяФункциональность - Массив - недоступные, из-за отсутствия необходимых категорий, действия
//
Функция ДанныеТокена(Токен) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("СрокДействия", Дата(1, 1, 1));
	Результат.Вставить("КодТипаТокена", 0);
	Результат.Вставить("ТипТокена", "");
	Результат.Вставить("Категории", Новый Массив);
	Результат.Вставить("ДоступнаяФункциональность", Новый Массив);
	Результат.Вставить("НедоступнаяФункциональность", Новый Массив);
	
	ПараметрыТокена = ДекодироватьТокен(Токен);
	
	Если Не ПустаяСтрока(ПараметрыТокена.ТекстОшибки) Тогда
		Результат.ТекстОшибки = ПараметрыТокена.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
	
	Если ПараметрыТокена.Данные["t"] Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Токен предназначен для тестового контура'");
		Возврат Результат;
	КонецЕсли;
	
	Результат.СрокДействия = МестноеВремя(Дата(1970, 1, 1) + ПараметрыТокена.Данные["exp"], "GMT"); // RFC 7519
	Если УниверсальноеВремя(ТекущаяДатаСеанса()) > Результат.СрокДействия Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Срок действия токена истек'");
		Возврат Результат;
	ИначеЕсли УниверсальноеВремя(ТекущаяДатаСеанса() + ПорогИстекающегоСрокаТокена()) > Результат.СрокДействия Тогда
		КоличествоДней = Цел((Результат.СрокДействия - УниверсальноеВремя(ТекущаяДатаСеанса()))/(24*60*60));
		Результат.ТекстОшибки = СтрШаблон(НСтр("ru = 'Действует до %1 (осталось %2)'"),
			Формат(Результат.СрокДействия, "ДФ=dd.MM.yyyy"),
			ПолучитьСклоненияСтрокиПоЧислу(, КоличествоДней, "день", "ЧС=Количественное", "ПД=Винительный")[0]);
	КонецЕсли;
	
	Результат.ТипТокена = ТипТокена(ПараметрыТокена, Результат.КодТипаТокена);
	
	Результат.Категории = ДоступныеКатегории(ПараметрыТокена);
	
	ВыгрузкаОстатковТоваров = ДоступнаВыгрузкаОстатковТоваров(ПараметрыТокена);
	Если ВыгрузкаОстатковТоваров.ФункциональностьДоступна Тогда
		Результат.ДоступнаяФункциональность.Добавить(ВыгрузкаОстатковТоваров);
	Иначе
		Результат.НедоступнаяФункциональность.Добавить(ВыгрузкаОстатковТоваров);
	КонецЕсли;
	
	ЗагрузкаКаталогаТоваров = ДоступнаЗагрузкаКаталогаТоваров(ПараметрыТокена);
	Если ЗагрузкаКаталогаТоваров.ФункциональностьДоступна Тогда
		Результат.ДоступнаяФункциональность.Добавить(ЗагрузкаКаталогаТоваров);
	Иначе
		Результат.НедоступнаяФункциональность.Добавить(ЗагрузкаКаталогаТоваров);
	КонецЕсли;
	
	ЗагрузкаОтчетовОПродажах = ДоступнаЗагрузкаОтчетовОПродажах(ПараметрыТокена);
	Если ЗагрузкаОтчетовОПродажах.ФункциональностьДоступна Тогда
		Результат.ДоступнаяФункциональность.Добавить(ЗагрузкаОтчетовОПродажах);
	Иначе
		Результат.ТекстОшибки = НСтр("ru = 'Необходимо пересоздать токен доступа'");
		Результат.НедоступнаяФункциональность.Добавить(ЗагрузкаОтчетовОПродажах);
	КонецЕсли;
	
	ЗагрузкаУведомленийОВыкупе = ДоступнаЗагрузкаУведомленийОВыкупе(ПараметрыТокена);
	Если ЗагрузкаУведомленийОВыкупе.ФункциональностьДоступна Тогда
		Результат.ДоступнаяФункциональность.Добавить(ЗагрузкаУведомленийОВыкупе);
	Иначе
		Результат.ТекстОшибки = НСтр("ru = 'Необходимо пересоздать токен доступа'");
		Результат.НедоступнаяФункциональность.Добавить(ЗагрузкаУведомленийОВыкупе);
	КонецЕсли;
	
	ЗагрузкаРеестровПродажЮрлицам = ДоступнаЗагрузкаРеестровПродажЮрлицам(ПараметрыТокена);
	Если ЗагрузкаРеестровПродажЮрлицам.ФункциональностьДоступна Тогда
		Результат.ДоступнаяФункциональность.Добавить(ЗагрузкаРеестровПродажЮрлицам);
	Иначе
		Результат.НедоступнаяФункциональность.Добавить(ЗагрузкаРеестровПродажЮрлицам);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет наличие состояний токенов, о которых необходимо оповестить пользователя
// 
// Возвращаемое значение:
//  Булево - результат диагностики токенов
//
Функция ЕстьПроблемыСТокенами() Экспорт
	
	Ошибки = НастройкиИнтеграцииСОшибками();
	
	Возврат ЗначениеЗаполнено(Ошибки);
	
КонецФункции

// Возвращает текст предупреждения о наличии проблем с токенами
//
// Параметры:
//  Шаблон	 - Строка - возможно использование шаблона текста
// 
// Возвращаемое значение:
//  Строка - текст предупреждения
//
Функция ТекстПроблемСТокенами(Знач Шаблон = Неопределено) Экспорт
	
	Ошибки = НастройкиИнтеграцииСОшибками();
	
	ТекстТокен = ?(Ошибки.Количество() = 1, НСтр("ru = 'токен'"), НСтр("ru = 'токены'"));
	
	Если Шаблон = Неопределено Тогда
		Шаблон = НСтр("ru = 'Проверьте %1 доступа к API Wildberries'");
	КонецЕсли;
	
	Возврат СтрШаблон(Шаблон, ТекстТокен);
	
КонецФункции

// Возвращает параметры формы с предупреждениями о состоянии токена
// 
// Возвращаемое значение:
//  Структура - 
//     * ПараметрыФормы - Структура - параметры формы
//     * ИмяФормы - Строка - имя формы
//
Функция ПараметрыОткрытияФормыПроблемСТокенами() Экспорт
	
	Ошибки = НастройкиИнтеграцииСОшибками();
	ЛимитированныеТокены = НастройкиИнтеграцииСЛимитированнымиТокенами();
	
	Результат = Новый Структура;
	
	Если Ошибки.Количество() = 0 И ЛимитированныеТокены.Количество() = 1 Тогда
		Результат.Вставить("ПараметрыФормы", Новый Структура("Ключ", ЛимитированныеТокены[0]));
		Результат.Вставить("ИмяФормы", "Справочник.НастройкиИнтеграцииМаркетплейс.Форма.ФормаЭлемента");
	ИначеЕсли Ошибки.Количество() = 1 Тогда
		Результат.Вставить("ПараметрыФормы", Новый Структура("Ключ", Ошибки[0]));
		Результат.Вставить("ИмяФормы", "Справочник.НастройкиИнтеграцииМаркетплейс.Форма.ФормаЭлемента");
	Иначе
		Результат.Вставить("ПараметрыФормы", Новый Структура("ВидМаркетплейса", Перечисления.ВидыМаркетплейсов.Wildberries));
		Результат.Вставить("ИмяФормы", "Справочник.НастройкиИнтеграцииМаркетплейс.ФормаСписка");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает данные для отображения в динамическом списке формы Справочник.НастройкиИнтеграцииМаркетплейс.ФормаСписка
// 
// Возвращаемое значение:
//  Соответствие - 
//     * Ключ - СправочникСсылка.НастройкиИнтеграцииМаркетплейс
//     * Значение - Структура - наличие предупреждения и состояние токена
//
Функция СостоянияТокенов() Экспорт
	
	Результат = Новый Соответствие;
	
	ДанныеТокенов = ДанныеВсехТокенов();
	
	Если Не ЗначениеЗаполнено(ДанныеТокенов) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ДанныеТокена Из ДанныеТокенов Цикл
		СостояниеТокена = Новый Структура("ЕстьОшибка, Состояние", Ложь, "");
		Если ЗначениеЗаполнено(ДанныеТокена.Значение.ТекстОшибки) Тогда
			СостояниеТокена.ЕстьОшибка = Истина;
			СостояниеТокена.Состояние = ДанныеТокена.Значение.ТекстОшибки;
		Иначе
			СостояниеТокена.ЕстьОшибка = Ложь;
			СостояниеТокена.Состояние = СтрШаблон(НСтр("ru = '%1, действует до %2'"),
				ДанныеТокена.Значение.ТипТокена,
				Формат(ДанныеТокена.Значение.СрокДействия, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
		Результат.Вставить(ДанныеТокена.Ключ, СостояниеТокена);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиИнтеграцииСОшибками()
	
	Результат = Новый Массив;
	
	ДанныеТокенов = ДанныеВсехТокенов();
	
	Если Не ЗначениеЗаполнено(ДанныеТокенов) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ДанныеТокена Из ДанныеТокенов Цикл
		Если ЗначениеЗаполнено(ДанныеТокена.Значение.ТекстОшибки) Тогда
			Результат.Добавить(ДанныеТокена.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает настройки интеграции, в которых используется токен отличный от персонального
// 
// Возвращаемое значение:
//  Массив - список настроек интеграции, которые содержат токены с сущуственными лимитами (1 раз в 24 часа) запросов
//
Функция НастройкиИнтеграцииСЛимитированнымиТокенами() Экспорт
	
	Результат = Новый Массив;
	
	ДанныеТокенов = ДанныеВсехТокенов();
	
	Если Не ЗначениеЗаполнено(ДанныеТокенов) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ДанныеТокена Из ДанныеТокенов Цикл
		// только персональный тип токена позволяет получать данные без существенных ограничений по времени
		Если ДанныеТокена.Значение.КодТипаТокена <> КодПерсональногоТипаТокена() Тогда
			Результат.Добавить(ДанныеТокена.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеВсехТокенов()
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиИнтеграцииМаркетплейс.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиИнтеграцииМаркетплейс КАК НастройкиИнтеграцииМаркетплейс
	|ГДЕ
	|	НастройкиИнтеграцииМаркетплейс.ВидМаркетплейса = ЗНАЧЕНИЕ(Перечисление.ВидыМаркетплейсов.Wildberries)
	|	И НЕ НастройкиИнтеграцииМаркетплейс.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеТокена = ДанныеТокенаПоНастройкеИнтеграции(Выборка.Ссылка);
		Результат.Вставить(Выборка.Ссылка, ДанныеТокена);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДоступныеКатегории(ПараметрыТокена)
	
	Результат = Новый Массив;
	Если ПараметрыТокена.Данные["s"] = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	КатегорииМаркетплейса = КатегорииМаркетплейса();
	Для Каждого Категория Из КатегорииМаркетплейса Цикл
		Если ПроверитьБит(ПараметрыТокена.Данные["s"], Категория.Ключ) Тогда
			Результат.Добавить(Категория.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТипТокена(ПараметрыТокена, КодТипаТокена)
	
	ТипТокена = "";
	КодТипаТокена = 0;
	Если ПараметрыТокена.Данные.Свойство("acc", КодТипаТокена) Тогда
		Если КодТипаТокена = 1 Тогда
			ТипТокена = НСтр("ru = 'Базовый токен'");
		ИначеЕсли КодТипаТокена = 2 Тогда
			ТипТокена = НСтр("ru = 'Тестовый токен'");
		ИначеЕсли КодТипаТокена = 3 Тогда
			ТипТокена = НСтр("ru = 'Персональный токен'");
		ИначеЕсли КодТипаТокена = 4 Тогда
			ТипТокена = НСтр("ru = 'Сервисный токен'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТипТокена;
	
КонецФункции

// Определяет является ли тип токена персональным (наивысший доступ)
//
// Параметры:
//  Токен	 - Строка - токен доступа
// 
// Возвращаемое значение:
//  Булево - результат проверки
//
Функция ИспользуетсяПерсональныйТокенДоступа(Токен) Экспорт
	
	ДанныеТокена = ДанныеТокена(Токен);
	
	Возврат ДанныеТокена.КодТипаТокена = КодПерсональногоТипаТокена();
	
КонецФункции

Функция ДоступнаВыгрузкаОстатковТоваров(ПараметрыТокена)
	
	Возврат ДоступнаФункциональность(ПараметрыТокена, НСтр("ru = 'Выгрузка остатков товаров'"), "4");
	
КонецФункции

Функция ДоступнаЗагрузкаКаталогаТоваров(ПараметрыТокена)
	
	Возврат ДоступнаФункциональность(ПараметрыТокена, НСтр("ru = 'Загрузка каталога товаров'"), "1");
	
КонецФункции

Функция ДоступнаЗагрузкаОтчетовОПродажах(ПараметрыТокена)
	
	Возврат ДоступнаФункциональность(ПараметрыТокена, НСтр("ru = 'Загрузка отчетов о продажах'"), "13");
	
КонецФункции

Функция ДоступнаЗагрузкаУведомленийОВыкупе(ПараметрыТокена)
	
	Возврат ДоступнаФункциональность(ПараметрыТокена, НСтр("ru = 'Загрузка уведомлений о выкупе'"), "12");
	
КонецФункции

Функция ДоступнаЗагрузкаРеестровПродажЮрлицам(ПараметрыТокена)
	
	Возврат ДоступнаФункциональность(ПараметрыТокена, НСтр("ru = 'Загрузка реестров продаж юрлицам'"), "12");
	
КонецФункции

Функция ДоступнаФункциональность(ПараметрыТокена, НаименованиеФункциональности, КлючиКатегорииДоступаСтрокой)
	
	КатегорииМаркетплейса = КатегорииМаркетплейса();
	
	НедоступныеКатегории = Новый Массив;
	
	Ключи = СтрРазделить(КлючиКатегорииДоступаСтрокой, ",");
	Для Каждого Ключ Из Ключи Цикл
		Если ПараметрыТокена.Данные["s"] = Неопределено
			Или Не ПроверитьБит(ПараметрыТокена.Данные["s"], Число(Ключ)) Тогда
			НедоступныеКатегории.Добавить(КатегорииМаркетплейса.Получить(Число(Ключ)));
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура("Наименование, НедоступныеКатегории, ФункциональностьДоступна",
		НаименованиеФункциональности,
		НедоступныеКатегории,
		НедоступныеКатегории.Количество() = 0);
	
	Возврат Результат;
	
КонецФункции

Функция КатегорииМаркетплейса()
	
	КатегорииМаркетплейса = Новый Соответствие;
	КатегорииМаркетплейса.Вставить(1, НСтр("ru = 'Контент'"));
	КатегорииМаркетплейса.Вставить(4, НСтр("ru = 'Маркетплейс'"));
	КатегорииМаркетплейса.Вставить(12, НСтр("ru = 'Документы'"));
	КатегорииМаркетплейса.Вставить(13, НСтр("ru = 'Финансы'"));
	
	Возврат КатегорииМаркетплейса;
	
КонецФункции

Функция ДекодироватьТокен(Токен)
	
	Результат = Новый Структура("Данные, ТекстОшибки", Новый Структура, "");
	
	Если Не ЗначениеЗаполнено(Токен) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Токен не выбран'");
		Возврат Результат;
	КонецЕсли;
	
	ЭлементыТокена = СтрРазделить(Токен, ".");
	Если ЭлементыТокена.Количество() <> 3 Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Токен не соответствует формату Wildberries'");
		Возврат Результат;
	КонецЕсли;
	
	Значение = СтрЗаменить(СтрЗаменить(ЭлементыТокена[1], "-", "+"), "_", "/");
	Остаток = СтрДлина(Значение) % 4;
	
	Если Остаток = 1 Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Токен не соответствует формату Wildberries'");
		Возврат Результат;
	ИначеЕсли Остаток = 2 Тогда
		Значение = Значение + "==";
	ИначеЕсли Остаток = 3 Тогда
		Значение = Значение + "=";
	КонецЕсли;
	
	СтрокаJSON = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(Значение));
	
	Попытка
		Результат.Данные = ОбменСМаркетплейс.ИзJSON(СтрокаJSON);
		Если ТипЗнч(Результат.Данные) <> Тип("Структура")
			Или Не Результат.Данные.Свойство("s")
			Или Не Результат.Данные.Свойство("t")
			Или Не Результат.Данные.Свойство("acc")
			Или Не Результат.Данные.Свойство("exp") Тогда
			Результат.ТекстОшибки = НСтр("ru = 'Токен не соответствует формату Wildberries'");
		КонецЕсли;
	Исключение
		Результат.ТекстОшибки = НСтр("ru = 'Токен не соответствует формату Wildberries'");
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ОшибкаАвторизации()
	Возврат НСтр("ru = 'Ошибка авторизации'");
КонецФункции

Функция ПорогИстекающегоСрокаТокена()
	Возврат 15 * 24 * 60 * 60; // секунд
КонецФункции

Функция КодПерсональногоТипаТокена()
	
	Возврат 3;
	
КонецФункции

#КонецОбласти

#Область РаботаСОтчетами

Функция ПрочитатьОтчет(ПараметрыОтчета, КодОтвета, СообщенияОбОшибках)
	
	ТаблицаТоваров = ЭлектронноеВзаимодействиеБП.ПодготовитьТаблицуТоваровМаркетплейс();
	
	НастройкиПодключения = НовыйНастройкиПодключения();
	
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(ПараметрыОтчета.НастройкаИнтеграции);
	
	ПараметрыЗапроса = НовыйПараметрыЗапросаОтчетОпродажахWildberries();
	ПараметрыЗапроса.НастройкиПодключения = НастройкиПодключения;
	ПараметрыЗапроса.НачалоПериода        = ПараметрыОтчета.НачалоПериода;
	ПараметрыЗапроса.ОкончаниеПериода     = ПараметрыОтчета.ОкончаниеПериода;
	ПараметрыЗапроса.ПределВыборкиОдногоЗапроса = 10000;
	ПараметрыЗапроса.ЛимитыЗапросов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыОтчета, "ЛимитыЗапросов", Новый Соответствие);
		
	Поля = "brandName,country,docTypeName,forPay,isB2b,nmId,quantity,reportId,reportType,
		|retailAmount,rrdId,saleDt,sellerOperName,sku,subjectName,techSize,title,vendorCode";
	ПараметрыЗапроса.Поля = СтрРазделить(СтрЗаменить(Поля, Символы.ПС, ""), ",");
	
	ПоследняяЗагруженнаяСтрока = 0;
	
	//Логирование
	Логирование = Логирование(ПараметрыОтчета.НастройкаИнтеграции);
	//Конец Логирование

	МассивЗагрузок = Новый Массив;
	Пока Истина Цикл
		
		ПараметрыЗапроса.НачалоВыборки = ПоследняяЗагруженнаяСтрока;
		РезультатЗапроса = ЗапросОтчетОпродажахWildberries(ПараметрыЗапроса, СообщенияОбОшибках, Логирование);
		
		Если ЗначениеЗаполнено(СообщенияОбОшибках) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		КодОтвета = РезультатЗапроса.КодСостояния;
		Если КодОтвета <> 200 Тогда
			
			Если КодОтвета = 502 Тогда
				СообщенияОбОшибках = НСтр("ru = 'Сервер API Wildberries недоступен. Попробуйте позже'");
			ИначеЕсли КодОтвета = 400 Тогда
				СообщенияОбОшибках = НСтр("ru = 'Ошибка в запросе при обращении к API Wildberries.
					|Обратитесь на линию техподдержки'");
			ИначеЕсли КодОтвета = 401 Тогда
				СообщенияОбОшибках = НСтр("ru = 'Ошибка авторизации в API Wildberries.
					|Возможно, ваш токен API устарел: срок действия токена - 180 дней от даты создания.
					|Получите токен API с типами ""Финансы, Документы"" в личном кабинете Профиль-Настройки-Доступ к API'");
			ИначеЕсли КодОтвета = 403 Тогда
				СообщенияОбОшибках = НСтр("ru = 'Ошибка авторизации в API Wildberries. Проверьте в настройках ключ API'");
			ИначеЕсли КодОтвета = 429 Тогда
				СообщенияОбОшибках = СообщениеОПревышенииЛимитовЗапросов(РезультатЗапроса.Заголовки, НастройкиПодключения.Токен);
			ИначеЕсли КодОтвета = 204 Тогда
				СообщенияОбОшибках = НСтр("ru = 'Нет данных для формирования отчета о продажах.'");
			Иначе
				ПереченьОшибок = РезультатЗапроса.ПолучитьТелоКакСтроку();
				Если СтрНайти(ПереченьОшибок, "Record limit exceeded") > 0
					И ПараметрыЗапроса.ПределВыборкиОдногоЗапроса = 10000 Тогда
					ПараметрыЗапроса.ПределВыборкиОдногоЗапроса = 1000;
					ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Не удалось загрузить отчет о продажах. Получен ответ API Wildberries, код ошибки: %1'"),
						ПереченьОшибок);
					ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(ТекстОшибки, Перечисления.ВидыМаркетплейсов.Wildberries);
					Продолжить;
				КонецЕсли;
				СообщенияОбОшибках = СтрШаблон(
					НСтр("ru = 'Не удалось загрузить отчет о продажах. Получен ответ API Wildberries, код ошибки: %1'"),
						ПереченьОшибок);
			КонецЕсли;
			ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщенияОбОшибках, Перечисления.ВидыМаркетплейсов.Wildberries);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СообщенияОбОшибках) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Попытка
			РезультатЧтения = ОбменСМаркетплейс.ПолучитьДанныеОтвета(РезультатЗапроса);
		Исключение
			ТекстОтвета = РезультатЗапроса.ПолучитьТелоКакСтроку();
			Если ПустаяСтрока(ТекстОтвета) Тогда
				СообщенияОбОшибках = СтрШаблон(
				НСтр("ru = 'Не удалось загрузить отчет о продажах.
				|Получен ответ API Wildberries %1: <пустой ответ> - ответ не содержит данных. 
				|Обратитесь в техподдержку Wildberries с жалобой на ошибку в работе метода %2
				|при выполнении запроса за период с %3 по %4'"),
					ПараметрыЗапроса.ВерсияМетодаAPI,
					МетодЗапросаФинансыДетализацияОтчетовРеализации(),
					Формат(ПараметрыОтчета.НачалоПериода,"ДЛФ=D"),
					Формат(ПараметрыОтчета.ОкончаниеПериода,"ДЛФ=D"));
			Иначе
				СообщенияОбОшибках = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецЕсли;
			ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщенияОбОшибках, Перечисления.ВидыМаркетплейсов.Wildberries);
			Возврат Неопределено;
		КонецПопытки;
		
		//API вернул ответ null
		Если РезультатЧтения = Неопределено Тогда 
			
			СообщенияОбОшибках = СтрШаблон(
				НСтр("ru = 'Не удалось загрузить отчет о продажах.
				|Получен ответ API Wildberries: Отсутствует данные отчета за период с %1 по %2. Попробуйте загрузить отчет позже'"),
					Формат(ПараметрыОтчета.НачалоПериода,"ДЛФ=D"),
					Формат(ПараметрыОтчета.ОкончаниеПериода,"ДЛФ=D"));
					ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщенияОбОшибках, Перечисления.ВидыМаркетплейсов.Wildberries);
			
			Возврат Неопределено;
			
		КонецЕсли;
		
		ПрочитаноСтрок = РезультатЧтения.Количество(); 
		
		//API вернул ответ []
		Если ПрочитаноСтрок = 0 Тогда 
			
			СообщенияОбОшибках = СтрШаблон(
				НСтр("ru = 'Не удалось загрузить отчет о продажах.
				|Получен ответ API Wildberries: Отсутствует данные отчета за период с %1 по %2.'"),
					Формат(ПараметрыОтчета.НачалоПериода,"ДЛФ=D"),
					Формат(ПараметрыОтчета.ОкончаниеПериода,"ДЛФ=D"));
			ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщенияОбОшибках, Перечисления.ВидыМаркетплейсов.Wildberries);
			
			Возврат Неопределено;
			
		КонецЕсли;
		
		ПоследняяЗагруженнаяСтрока = РезультатЧтения[ПрочитаноСтрок-1].rrdId;
		
		ДополнитьТаблицуТоваровWildberries(РезультатЧтения, ТаблицаТоваров);
		
		РезультатЧтения = Неопределено;
		
		Если ПрочитаноСтрок < ПараметрыЗапроса.ПределВыборкиОдногоЗапроса Тогда
			//все выбрали, второй запрос не нужен
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОтчета.Вставить("ЛимитыЗапросов", ПараметрыЗапроса.ЛимитыЗапросов);
	
	Возврат ТаблицаТоваров;

КонецФункции

Функция ДокументыКатегории(ПараметрыОтчета, КатегорияДокумента, СообщениеОбОшибке)
	
	НастройкиПодключения = НовыйНастройкиПодключения();
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(ПараметрыОтчета.НастройкаИнтеграции);
	
	ПараметрыЗапроса = НовыйПараметрыЗапросаДокументыКатегории();
	ПараметрыЗапроса.НастройкиПодключения = НастройкиПодключения;
	ПараметрыЗапроса.КатегорияДокумента = КатегорияДокумента;
	ПараметрыЗапроса.НачалоПериода = ПараметрыОтчета.НачалоПериода;
	ПараметрыЗапроса.ОкончаниеПериода = ПараметрыОтчета.ОкончаниеПериода;
	ПараметрыЗапроса.ЛимитыЗапросов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыОтчета, "ЛимитыЗапросов", Новый Соответствие);
	
	//Логирование
	Логирование = Логирование(ПараметрыОтчета.НастройкаИнтеграции);
	//Конец Логирование
	
	ТекстСообщенияОбОшибке = НСтр("ru = 'Не удалось загрузить список документов Wildberries.'");
	
	РезультатЗапроса = ЗапросДокументыКатегорииWildberries(ПараметрыЗапроса, СообщениеОбОшибке, Логирование);
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КодОтвета = РезультатЗапроса.КодСостояния;
	Если КодОтвета <> 200 Тогда
		Если КодОтвета = 401 Тогда
			СообщениеОбОшибке = СообщениеОбОшибкеАвторизации(РезультатЗапроса);
			Возврат ОшибкаАвторизации();
		ИначеЕсли КодОтвета = 429 Тогда
			СообщениеОбОшибке = СообщениеОПревышенииЛимитовЗапросов(РезультатЗапроса.Заголовки, НастройкиПодключения.Токен);
			Возврат ОшибкаЛимитЗапросов();
		ИначеЕсли КодОтвета >= 500 И КодОтвета < 600 Тогда
			СообщениеОбОшибке = СообщениеОНедоступностиСервера();
		Иначе
			СообщениеОбОшибке = СообщениеОПрочейОшибке(РезультатЗапроса, ТекстСообщенияОбОшибке);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатЧтения = ДанныеОтвета(РезультатЗапроса, ТекстСообщенияОбОшибке, СообщениеОбОшибке);
	Если РезультатЧтения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Проверка наличия ключевых реквизитов в ответе
	Если Не РезультатЧтения.Свойство("data")
		Или Не РезультатЧтения.data.Свойство("documents") Тогда
		СообщениеОбОшибке = ТекстСообщенияОбОшибке;
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыОтчета.Вставить("ЛимитыЗапросов", ПараметрыЗапроса.ЛимитыЗапросов);
	
	Возврат РезультатЧтения.data.documents
	
КонецФункции

Функция ПрочитатьДокумент(ПараметрыОтчета, ИдентификаторДокумента, ФорматДокумента, СообщениеОбОшибке)
	
	НастройкиПодключения = НовыйНастройкиПодключения();
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(ПараметрыОтчета.НастройкаИнтеграции);
	
	ПараметрыЗапроса = НовыйПараметрыЗапросаДокумент();
	ПараметрыЗапроса.НастройкиПодключения   = НастройкиПодключения;
	ПараметрыЗапроса.ИдентификаторДокумента = ИдентификаторДокумента;
	ПараметрыЗапроса.ФорматДокумента        = ФорматДокумента;
	ПараметрыЗапроса.ЛимитыЗапросов         = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыОтчета, "ЛимитыЗапросов", Новый Соответствие);
	
	//Логирование
	Логирование = Логирование(ПараметрыОтчета.НастройкаИнтеграции);
	//Конец Логирование
	
	ТекстСообщенияОбОшибке = СтрШаблон(НСтр("ru = 'Не удалось загрузить документ Wildberries c идентификатором: %1.'"),
		ИдентификаторДокумента);
	
	РезультатЗапроса = ЗапросДокументWildberries(ПараметрыЗапроса, СообщениеОбОшибке, Логирование);
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КодОтвета = РезультатЗапроса.КодСостояния;
	Если КодОтвета <> 200 Тогда
		Если КодОтвета = 401 Тогда
			СообщениеОбОшибке = СообщениеОбОшибкеАвторизации(РезультатЗапроса);
			Возврат ОшибкаАвторизации();
		ИначеЕсли КодОтвета = 429 Тогда
			СообщениеОбОшибке = СообщениеОПревышенииЛимитовЗапросов(РезультатЗапроса.Заголовки, НастройкиПодключения.Токен);
			Возврат ОшибкаЛимитЗапросов();
		ИначеЕсли КодОтвета >= 500 И КодОтвета < 600 Тогда
			СообщениеОбОшибке = СообщениеОНедоступностиСервера();
		Иначе
			СообщениеОбОшибке = СообщениеОПрочейОшибке(РезультатЗапроса, ТекстСообщенияОбОшибке);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатЧтения = ДанныеОтвета(РезультатЗапроса, ТекстСообщенияОбОшибке, СообщениеОбОшибке);
	Если РезультатЧтения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Проверка наличия ключевых реквизитов в ответе
	Если Не РезультатЧтения.Свойство("data")
		Или Не РезультатЧтения.data.Свойство("document") Тогда
		СообщениеОбОшибке = ТекстСообщенияОбОшибке;
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыОтчета.Вставить("ЛимитыЗапросов", ПараметрыЗапроса.ЛимитыЗапросов);
	
	ДвоичныеДанныеФайла = Base64Значение(РезультатЧтения.data.document);
	
	РасширениеИмениФайла = ПараметрыЗапроса.ФорматДокумента;
	ИмяФайла = "reportWB." + РасширениеИмениФайла;
	
	ОписаниеФайла = Новый Структура;
	ОписаниеФайла.Вставить("ИмяФайла", ИмяФайла);
	ОписаниеФайла.Вставить("РасширениеФайла", РасширениеИмениФайла);
	ОписаниеФайла.Вставить("ПолноеИмяФайла", ИмяФайла);
	ОписаниеФайла.Вставить("ДвоичныеДанные", ДвоичныеДанныеФайла);
	
	Возврат ОписаниеФайла;
	
КонецФункции

Функция СписокУведомленийОВыкупеЧерезИдентификаторы(ПараметрыОтчета, ИдентификаторыУведомлений)
	
	ФорматДокумента = "zip";
	УведомленияОВыкупе = Новый Массив;
	НезагруженныеУведомленияОшибкаАвторизации = Новый Массив;
	НезагруженныеУведомленияЛимитЗапросов = Новый Массив;
	
	Для Каждого ИдентификаторДокумента Из ИдентификаторыУведомлений Цикл
		ТекстОшибки = "";
		Идентификатор = СтрШаблон("%1-%2", КатегорияДокументаУведомлениеОВыкупе(), ИдентификаторДокумента.Ключ);
		УведомлениеОВыкупе = ПрочитатьДокумент(ПараметрыОтчета, Идентификатор, ФорматДокумента, ТекстОшибки);
		Если УведомлениеОВыкупе = Неопределено Тогда
			Продолжить;
		ИначеЕсли УведомлениеОВыкупе = ОшибкаАвторизации() Тогда
			НезагруженныеУведомленияОшибкаАвторизации.Добавить(ИдентификаторДокумента.Ключ);
			Продолжить;
		ИначеЕсли УведомлениеОВыкупе = ОшибкаЛимитЗапросов() Тогда
			ОшибкаЛимитЗапросов = Новый Структура("Ключ, ТекстОшибки", ИдентификаторДокумента.Ключ, ТекстОшибки);
			НезагруженныеУведомленияЛимитЗапросов.Добавить(ОшибкаЛимитЗапросов);
			Продолжить;
		КонецЕсли;
		УведомленияОВыкупе.Добавить(УведомлениеОВыкупе);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(УведомленияОВыкупе)
		И Не ЗначениеЗаполнено(НезагруженныеУведомленияОшибкаАвторизации)
		И Не ЗначениеЗаполнено(НезагруженныеУведомленияЛимитЗапросов) Тогда
		Возврат УведомленияОВыкупе;
	КонецЕсли;
	
	ДанныеФайлов = ЭлектронноеВзаимодействиеБП.ПолучитьДанныеФайлов(УведомленияОВыкупе);
	
	Если ЗначениеЗаполнено(НезагруженныеУведомленияОшибкаАвторизации) Тогда
		Предупреждение = Новый Структура;
		Если НезагруженныеУведомленияОшибкаАвторизации.Количество() = 1 Тогда
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Не удалось загрузить уведомление о выкупе № %1'"),
				НезагруженныеУведомленияОшибкаАвторизации[0]);
		Иначе
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Не удалось загрузить уведомления о выкупах №№ %1'"),
				СтрСоединить(НезагруженныеУведомленияОшибкаАвторизации, ", "));
		КонецЕсли;
		Предупреждение.Вставить("Предупреждение", ТекстПредупреждения);
		Предупреждение.Вставить("Организация", ПараметрыОтчета.Организация);
		Предупреждение.Вставить("Маркетплейс", Перечисления.ВидыМаркетплейсов.Wildberries);
		Предупреждение.Вставить("Дата", КонецДня(ПараметрыОтчета.ОкончаниеПериода));
		Предупреждение.Вставить("Действие", ТекстПроблемСТокенами());
		ДанныеФайлов.Добавить(Предупреждение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НезагруженныеУведомленияЛимитЗапросов) Тогда
		Предупреждение = Новый Структура;
		Если НезагруженныеУведомленияЛимитЗапросов.Количество() = 1 Тогда
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Не удалось загрузить уведомление о выкупе № %1. %2'"),
				НезагруженныеУведомленияЛимитЗапросов[0].Ключ,
				НезагруженныеУведомленияЛимитЗапросов[0].ТекстОшибки);
		Иначе
			ТекстОшибки = "";
			Ключи = Новый Массив;
			Для Каждого НезагруженноеУведомление Из НезагруженныеУведомленияЛимитЗапросов Цикл
				ТекстОшибки = НезагруженноеУведомление.ТекстОшибки;
				Ключи.Добавить(НезагруженноеУведомление.Ключ);
			КонецЦикла;
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Не удалось загрузить уведомления о выкупах №№ %1. %2'"),
				СтрСоединить(Ключи, ", "), ТекстОшибки);
		КонецЕсли;
		Предупреждение.Вставить("СообщениеПользователю", ТекстПредупреждения);
		Предупреждение.Вставить("Организация", ПараметрыОтчета.Организация);
		Предупреждение.Вставить("Маркетплейс", Перечисления.ВидыМаркетплейсов.Wildberries);
		Предупреждение.Вставить("Дата", КонецДня(ПараметрыОтчета.ОкончаниеПериода));
		
		Токен = ПрочитатьНастройкиАвторизации(ПараметрыОтчета.НастройкаИнтеграции);
		ИспользуетсяПерсональныйТокен = ИспользуетсяПерсональныйТокенДоступа(Токен);
		Если Не ИспользуетсяПерсональныйТокен Тогда
			Предупреждение.Вставить("НастройкаИнтеграции", ПараметрыОтчета.НастройкаИнтеграции);
			Предупреждение.Вставить("Действие", НСтр("ru = 'Изменить настройку интеграции'"));
			Предупреждение.Вставить("Предупреждение", НСтр("ru = 'Рекомендуется сменить Базовый токен на Персональный'"));
			Предупреждение.Вставить("ВидДокумента", "яяя"); // для сортировки
		КонецЕсли;
		ДанныеФайлов.Добавить(Предупреждение);
	КонецЕсли;
	
	Возврат ДанныеФайлов;
	
КонецФункции

Функция РеестрыПродажЮрлицамЗаПериод(ПараметрыОтчета) Экспорт
	
	РеестрыПродажЮрлицам = Новый Массив;
	
	СообщенияОбОшибках = "";
	ДокументыКатегории = ДокументыКатегории(ПараметрыОтчета, КатегорияДокументаРеестрПродажЮрлицам(), СообщенияОбОшибках);
	Если ДокументыКатегории = Неопределено Тогда
		Возврат РеестрыПродажЮрлицам;
	ИначеЕсли ДокументыКатегории = ОшибкаАвторизации() Тогда
		Предупреждение = Новый Структура;
		Предупреждение.Вставить("Предупреждение", СообщенияОбОшибках);
		Предупреждение.Вставить("Организация", ПараметрыОтчета.Организация);
		Предупреждение.Вставить("Маркетплейс", Перечисления.ВидыМаркетплейсов.Wildberries);
		Предупреждение.Вставить("Дата", КонецДня(ПараметрыОтчета.ОкончаниеПериода));
		Предупреждение.Вставить("Действие", ТекстПроблемСТокенами());
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Предупреждение);
	ИначеЕсли ДокументыКатегории = ОшибкаЛимитЗапросов() Тогда
		Предупреждение = Новый Структура;
		Предупреждение.Вставить("СообщениеПользователю", СообщенияОбОшибках);
		Предупреждение.Вставить("Организация", ПараметрыОтчета.Организация);
		Предупреждение.Вставить("Маркетплейс", Перечисления.ВидыМаркетплейсов.Wildberries);
		Предупреждение.Вставить("Дата", КонецДня(ПараметрыОтчета.ОкончаниеПериода));
		Токен = ПрочитатьНастройкиАвторизации(ПараметрыОтчета.НастройкаИнтеграции);
		ИспользуетсяПерсональныйТокен = ИспользуетсяПерсональныйТокенДоступа(Токен);
		Если Не ИспользуетсяПерсональныйТокен Тогда
			Предупреждение.Вставить("НастройкаИнтеграции", ПараметрыОтчета.НастройкаИнтеграции);
			Предупреждение.Вставить("Действие", НСтр("ru = 'Изменить настройку интеграции'"));
			Предупреждение.Вставить("Предупреждение", НСтр("ru = 'Рекомендуется сменить Базовый токен на Персональный'"));
			Предупреждение.Вставить("ВидДокумента", "яяя"); // для сортировки
		КонецЕсли;
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Предупреждение);
	КонецЕсли;
	
	НезагруженныеРеестрыПродажЮрлицамОшибкаАвторизации = Новый Массив;
	НезагруженныеРеестрыПродажЮрлицамЛимитЗапросов = Новый Массив;
	
	ИменаОтчетов = Новый Массив;
	Для Каждого ДанныеРеестрПродажЮрлицам Из ДокументыКатегории Цикл
		Если ИменаОтчетов.Найти(ДанныеРеестрПродажЮрлицам.name) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ИменаОтчетов.Добавить(ДанныеРеестрПродажЮрлицам.name);
		ТекстОшибки = "";
		Идентификатор = СокрЛП(ДанныеРеестрПродажЮрлицам.serviceName);
		ФорматДокумента = "zip";
		РеестрПродажЮрлицам = ПрочитатьДокумент(ПараметрыОтчета, Идентификатор, ФорматДокумента, ТекстОшибки);
		Если РеестрПродажЮрлицам = Неопределено Тогда
			Продолжить;
		ИначеЕсли РеестрПродажЮрлицам = ОшибкаАвторизации() Тогда
			НезагруженныеРеестрыПродажЮрлицамОшибкаАвторизации.Добавить(ДанныеРеестрПродажЮрлицам.name);
			Продолжить;
		ИначеЕсли РеестрПродажЮрлицам = ОшибкаЛимитЗапросов() Тогда
			ОшибкаЛимитЗапросов = Новый Структура("Ключ, ТекстОшибки", ДанныеРеестрПродажЮрлицам.name, ТекстОшибки);
			НезагруженныеРеестрыПродажЮрлицамЛимитЗапросов.Добавить(ОшибкаЛимитЗапросов);
			Продолжить;
		КонецЕсли;
		РеестрыПродажЮрлицам.Добавить(РеестрПродажЮрлицам);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(РеестрыПродажЮрлицам)
		И Не ЗначениеЗаполнено(НезагруженныеРеестрыПродажЮрлицамОшибкаАвторизации)
		И Не ЗначениеЗаполнено(НезагруженныеРеестрыПродажЮрлицамЛимитЗапросов) Тогда
		Предупреждение = Новый Структура;
		Предупреждение.Вставить("ТекстОшибки", НСтр("ru = 'Нет данных для загрузки.'"));
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Предупреждение);
	КонецЕсли;
	
	ДанныеФайловДоОтбораПоПериоду = ЭлектронноеВзаимодействиеБП.ПолучитьДанныеФайлов(РеестрыПродажЮрлицам);
	
	// убираем реестры продаж юрлицам не относящиеся к загружаемому периоду
	ДанныеФайлов = Новый Массив;
	Для Каждого ДанныеФайла Из ДанныеФайловДоОтбораПоПериоду Цикл
		Если НачалоДня(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеФайла.ДанныеДокумента, "НачалоПериода", Дата(1,1,1))) = НачалоДня(ПараметрыОтчета.НачалоПериода)
			И НачалоДня(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеФайла.ДанныеДокумента, "ОкончаниеПериода", Дата(1,1,1))) = НачалоДня(ПараметрыОтчета.ОкончаниеПериода) Тогда
			ДанныеФайлов.Добавить(ДанныеФайла);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НезагруженныеРеестрыПродажЮрлицамОшибкаАвторизации) Тогда
		Предупреждение = Новый Структура;
		Если НезагруженныеРеестрыПродажЮрлицамОшибкаАвторизации.Количество() = 1 Тогда
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Не удалось загрузить %1'"),
				НезагруженныеРеестрыПродажЮрлицамОшибкаАвторизации[0]);
		Иначе
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Не удалось загрузить %1'"),
				СтрСоединить(НезагруженныеРеестрыПродажЮрлицамОшибкаАвторизации, ", "));
		КонецЕсли;
		Предупреждение.Вставить("Предупреждение", ТекстПредупреждения);
		Предупреждение.Вставить("Организация", ПараметрыОтчета.Организация);
		Предупреждение.Вставить("Маркетплейс", Перечисления.ВидыМаркетплейсов.Wildberries);
		Предупреждение.Вставить("Дата", КонецДня(ПараметрыОтчета.ОкончаниеПериода));
		Предупреждение.Вставить("Действие", ТекстПроблемСТокенами());
		ДанныеФайлов.Добавить(Предупреждение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НезагруженныеРеестрыПродажЮрлицамЛимитЗапросов) Тогда
		Предупреждение = Новый Структура;
		Если НезагруженныеРеестрыПродажЮрлицамЛимитЗапросов.Количество() = 1 Тогда
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Не удалось загрузить %1. %2'"),
				НезагруженныеРеестрыПродажЮрлицамЛимитЗапросов[0].Ключ,
				НезагруженныеРеестрыПродажЮрлицамЛимитЗапросов[0].ТекстОшибки);
		Иначе
			ТекстОшибки = "";
			Ключи = Новый Массив;
			Для Каждого НезагруженныйРеестрПродажЮрлицам Из НезагруженныеРеестрыПродажЮрлицамЛимитЗапросов Цикл
				ТекстОшибки = НезагруженныйРеестрПродажЮрлицам.ТекстОшибки;
				Ключи.Добавить(НезагруженныйРеестрПродажЮрлицам.Ключ);
			КонецЦикла;
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Не удалось загрузить %1. %2'"),
				СтрСоединить(Ключи, ", "), ТекстОшибки);
		КонецЕсли;
		Предупреждение.Вставить("СообщениеПользователю", ТекстПредупреждения);
		Предупреждение.Вставить("Организация", ПараметрыОтчета.Организация);
		Предупреждение.Вставить("Маркетплейс", Перечисления.ВидыМаркетплейсов.Wildberries);
		Предупреждение.Вставить("Дата", КонецДня(ПараметрыОтчета.ОкончаниеПериода));
		
		Токен = ПрочитатьНастройкиАвторизации(ПараметрыОтчета.НастройкаИнтеграции);
		ИспользуетсяПерсональныйТокен = ИспользуетсяПерсональныйТокенДоступа(Токен);
		Если Не ИспользуетсяПерсональныйТокен Тогда
			Предупреждение.Вставить("НастройкаИнтеграции", ПараметрыОтчета.НастройкаИнтеграции);
			Предупреждение.Вставить("Действие", НСтр("ru = 'Изменить настройку интеграции'"));
			Предупреждение.Вставить("Предупреждение", НСтр("ru = 'Рекомендуется сменить Базовый токен на Персональный'"));
			Предупреждение.Вставить("ВидДокумента", "яяя"); // для сортировки
		КонецЕсли;
		ДанныеФайлов.Добавить(Предупреждение);
	КонецЕсли;
	
	Возврат ДанныеФайлов;
	
КонецФункции

Функция ПродажаЧерезВыкупТовара(КодСтраны, НазваниеСтраны = "") Экспорт
	
	Код = Врег(КодСтраны);
	Название = Врег(НазваниеСтраны);
	Возврат Код = "KZ" ИЛИ Название = "КАЗАХСТАН" 
			ИЛИ Код = "BY" ИЛИ Название = "БЕЛАРУСЬ"
			ИЛИ Код = "KG" ИЛИ Название = "КИРГИЗИЯ"
			ИЛИ Код = "AM" ИЛИ Название = "АРМЕНИЯ";
	
КонецФункции

Функция СписаниеТовараМаркетплейсом(ВидДвижения, ТипДокумента) Экспорт
	
	ЭтоСписание = (Нрег(ВидДвижения) = "оплата потерянного товара" 
					ИЛИ Нрег(ВидДвижения) = "авансовая оплата за товар без движения" 
					ИЛИ Нрег(ВидДвижения) = "частичная компенсация брака"
					ИЛИ Нрег(ВидДвижения) = "компенсация потерянного товара"
					ИЛИ Нрег(ВидДвижения) = "компенсация подмененного товара"
					ИЛИ Нрег(ВидДвижения) = "компенсация ущерба"
					ИЛИ Нрег(ВидДвижения) = "добровольная компенсация при возврате"
					ИЛИ Нрег(ВидДвижения) = "компенсация брака");
					
	ЭтоСторно   = (Нрег(ТипДокумента) = "возврат");
	
	Возврат ЭтоСписание И НЕ ЭтоСторно;
	
КонецФункции

Функция ПродажаТовараМаркетплейсом(ВидДвижения, ТипДокумента) Экспорт
	
	Возврат Нрег(ВидДвижения) = "продажа"
			ИЛИ Нрег(ВидДвижения) = "корректная продажа"
			ИЛИ Нрег(ВидДвижения) = "сторно возвратов"
			ИЛИ (Нрег(ВидДвижения) = "коррекция продаж"
				И Нрег(ТипДокумента) = "продажа");
	
КонецФункции

Функция ВозвратТовараМаркетплейсом(ВидДвижения, ТипДокумента) Экспорт
	
	Возврат Нрег(ВидДвижения) = "возврат"
			ИЛИ Нрег(ВидДвижения) = "сторно продаж"
			ИЛИ (Нрег(ВидДвижения) = "коррекция продаж"
				И Нрег(ТипДокумента) = "возврат");
	
КонецФункции

// Проверяет необходимость исключения выкупов из документа продаж для организации
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - организация для проверки
//  Дата		 - Дата - дата для проверки
// 
// Возвращаемое значение:
//   Булево - результат проверки
//
Функция ИсключитьВыкупы(Организация, Дата) Экспорт
	
	Возврат (Дата <= '20230901')
		Или УчетнаяПолитика.ПлательщикНДС(Организация, Дата)
		Или УчетнаяПолитика.ПлательщикНДСПрименяющийУСН(Организация, Дата);
	
КонецФункции

Функция ПреобразоватьДанныеПрочитанногоОтчета(ПараметрыОтчета, ТаблицаТоваров)
	
	КолонкиТаблицыТоваров = ТаблицаТоваров.Колонки;
	Если КолонкиТаблицыТоваров.Найти("НатуральныйИД") = Неопределено Тогда
		КолонкиТаблицыТоваров.Добавить("НатуральныйИД", ОбщегоНазначения.ОписаниеТипаСтрока(300));
	КонецЕсли;
	Если КолонкиТаблицыТоваров.Найти("КоличествоВозврат") = Неопределено Тогда
		КолонкиТаблицыТоваров.Добавить("КоличествоВозврат", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	КонецЕсли;
	Если КолонкиТаблицыТоваров.Найти("СуммаВозврат") = Неопределено Тогда
		КолонкиТаблицыТоваров.Добавить("СуммаВозврат", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	КонецЕсли;
	Если КолонкиТаблицыТоваров.Найти("СтавкаНДС") = Неопределено Тогда
		КолонкиТаблицыТоваров.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	КонецЕсли;
	Если КолонкиТаблицыТоваров.Найти("СуммаНДС") = Неопределено Тогда
		КолонкиТаблицыТоваров.Добавить("СуммаНДС", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	КонецЕсли;
	
	КолонкаНаимТов = КолонкиТаблицыТоваров.Найти("НаимТов");
	КолонкаНаименование = КолонкиТаблицыТоваров.Найти("Наименование");
	Если КолонкаНаимТов <> Неопределено
		И КолонкаНаименование = Неопределено Тогда
		КолонкаНаимТов.Имя = "Наименование";
	КонецЕсли;
	
	ТаблицаПродажи  = ТаблицаТоваров.СкопироватьКолонки();
	ТаблицаСписание = ТаблицаТоваров.СкопироватьКолонки();
	ТаблицаОприходование    = ТаблицаТоваров.СкопироватьКолонки();
	
	НастройкаИнтеграции     = ПараметрыОтчета.НастройкаИнтеграции;
	КонтрагентДоговор       = Справочники.НастройкиИнтеграцииМаркетплейс.КонтрагентДоговорНаДату(НастройкаИнтеграции, ПараметрыОтчета.ОкончаниеПериода);
	
	Организация             = НастройкаИнтеграции.Владелец;
	Контрагент              = КонтрагентДоговор.Контрагент;
	ДоговорКонтрагента      = КонтрагентДоговор.ДоговорКонтрагента;
	Дата                    = ПараметрыОтчета.ОкончаниеПериода;
	
	ИсключатьВыкупы = ИсключитьВыкупы(Организация, Дата);
	
	ИдентификаторыУведомленийОВыкупе = Новый Соответствие;
	
	СуммаПродаж = 0;
	СуммаВозвратов = 0;
	
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		// если строки с нулевыми показателями (например ВидДвижения = "логистика") попадут в таблицу продаж,
		// то может быть неверно определен номер отчета (ТаблицаПродажи[0].ИдентификаторОтчета)
		Если СтрокаТаблицы.Количество = 0 И СтрокаТаблицы.КоличествоВозврат = 0
			И СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаВозврат = 0
			И СтрокаТаблицы.Доплата = 0 И СтрокаТаблицы.ДоплатаВозврат = 0
			И СтрокаТаблицы.ДоплатаПартнеров = 0 И СтрокаТаблицы.ДоплатаПартнеровВозврат = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если СписаниеТовараМаркетплейсом(СтрокаТаблицы.ВидДвижения, СтрокаТаблицы.ТипДокумента) Тогда
			НоваяСтрока = ТаблицаСписание.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		ИначеЕсли ОприходованиеТовараМаркетплейсом(СтрокаТаблицы.ВидДвижения, СтрокаТаблицы.ТипДокумента) Тогда
			НоваяСтрока = ТаблицаОприходование.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		ИначеЕсли ПродажаЧерезВыкупТовара(СтрокаТаблицы.КодСтраны, СтрокаТаблицы.КодСтраны)
			И (СтрокаТаблицы.ВидДвижения = "продажа" Или СтрокаТаблицы.ВидДвижения = "корректная продажа") Тогда
			Если ИсключатьВыкупы Тогда
				ИдентификаторыУведомленийОВыкупе.Вставить(СтрокаТаблицы.ИдентификаторОтчета, ЭлектронноеВзаимодействиеБП.ВидДокументаWBУведомлениеВыкупа());
			Иначе
				Если СтрокаТаблицы.ТипОтчета = 2 Тогда
					ИдентификаторыУведомленийОВыкупе.Вставить(СтрокаТаблицы.ИдентификаторОтчета, ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBДетальный());
				Иначе
					НоваяСтрока = ТаблицаПродажи.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					СуммаПродаж = СуммаПродаж + СтрокаТаблицы.Сумма;
				КонецЕсли;
			КонецЕсли;
		Иначе
			НоваяСтрока = ТаблицаПродажи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			Если СтрокаТаблицы.ВидДвижения = "возврат"
				Или СтрокаТаблицы.ВидДвижения = "сторно продаж" Тогда
				// возвраты выкупов не попадают в возвраты отчета о продажах
				Если Не ПродажаЧерезВыкупТовара(СтрокаТаблицы.КодСтраны, СтрокаТаблицы.КодСтраны) Тогда
					СуммаВозвратов = СуммаВозвратов + СтрокаТаблицы.Сумма;
				КонецЕсли;
			Иначе
				СуммаПродаж = СуммаПродаж + СтрокаТаблицы.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УведомленияОВыкупе = СписокУведомленийОВыкупеЧерезИдентификаторы(ПараметрыОтчета, ИдентификаторыУведомленийОВыкупе);
	
	НастройкиСопоставления = Новый Структура;
	НастройкиСопоставления.Вставить("ОграничениеТипаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	НастройкиСопоставления.Вставить("ОтключитьПоискПоСловарю",     Истина);
	НастройкиСопоставления.Вставить("ТочностьПоискаПоУмолчанию",   100);
	
	ДополнительныеПараметрыПоиска = Новый Структура;
	ДополнительныеПараметрыПоиска.Вставить("НатуральныеКлючи", "Артикул");
	ДополнительныеПараметрыПоиска.Вставить("Маркетплейс",      Перечисления.ВидыМаркетплейсов.Wildberries);
	НастройкиСопоставления.Вставить("ДополнительныеПараметрыПоиска", ДополнительныеПараметрыПоиска);
	
	НовыеКолонкиСопоставления = Новый Массив;
	ДополнительныйРеквизит = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НовыйДополнительныйРеквизитСопоставления();
	ДополнительныйРеквизит.Имя = "КодМагазина";
	ДополнительныйРеквизит.Представление = "Код маркетплейса";
	НовыеКолонкиСопоставления.Добавить(ДополнительныйРеквизит);
	НастройкиСопоставления.Вставить("ДополнительныеРеквизитыСопоставления", НовыеКолонкиСопоставления);
	
	ВидимостьКолонокСопоставления = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НовыеНастройкиВидимостиКолонокСопоставления();
	ВидимостьКолонокСопоставления.Вставить("ЕдиницаИзмерения", Ложь);
	ВидимостьКолонокСопоставления.Вставить("Упаковка", Ложь);
	ВидимостьКолонокСопоставления.Вставить("СтавкаНДС", Ложь);
	НастройкиСопоставления.Вставить("ВидимостьКолонокСопоставления", ВидимостьКолонокСопоставления);
	
	ДанныеФайлов = Новый Массив();
	
	Если ТаблицаПродажи.Количество() > 0 Тогда
		
		Описание = СтрШаблон(НСтр("ru='Отчет о продажах Wildberries от %1
			|Продажи: %2 Возвраты: %3'"), 
			Формат(Дата, "ДФ=dd.MM.yyyy"), 
			Формат(СуммаПродаж, "ЧДЦ=2; ЧН="), 
			Формат(СуммаВозвратов, "ЧДЦ=2; ЧН="));
			
		НомерВходящегоДокумента = ТаблицаПродажи[0].ИдентификаторОтчета;
			
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Плательщик",     Новый Структура("Ссылка", Контрагент));
		ДанныеДокумента.Вставить("Получатель",     Новый Структура("Ссылка", Организация));
		ДанныеДокумента.Вставить("Договор",        ДоговорКонтрагента);
		ДанныеДокумента.Вставить("ДатаНач",        ПараметрыОтчета.НачалоПериода);
		ДанныеДокумента.Вставить("Дата",           ПараметрыОтчета.ОкончаниеПериода);
		ДанныеДокумента.Вставить("ТаблицаТоваров", ТаблицаПродажи);
		ДанныеДокумента.Вставить("ВидДокумента"  , ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBДетальный());
		ДанныеДокумента.Вставить("Номер"         , НомерВходящегоДокумента);
		ОбменСМаркетплейс.ПервичныеДанныеМаркетплейсаИзТаблицы(ДанныеДокумента, ТаблицаПродажи);
		
		Файл = Новый Структура;
		Файл.Вставить("ПолноеИмяФайла",          НомерВходящегоДокумента);
		Файл.Вставить("ДанныеДокумента",         ДанныеДокумента);
		Файл.Вставить("ВидДокумента",            ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBДетальный());
		Файл.Вставить("Маркетплейс",             Перечисления.ВидыМаркетплейсов.Wildberries);
		Файл.Вставить("Организация",             Организация);
		Файл.Вставить("Контрагент",              Контрагент);
		Файл.Вставить("ДоговорКонтрагента",      ДоговорКонтрагента);
		Файл.Вставить("Дата",                    Дата);
		Файл.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
		Файл.Вставить("СуммаВыкупа",             0);
		Файл.Вставить("СуммаПродаж",             СуммаПродаж);
		Файл.Вставить("СуммаВозвратов",          СуммаВозвратов);
		Файл.Вставить("СуммаСписания",           0);
		Файл.Вставить("Загружать",               СуммаПродаж > 0 ИЛИ СуммаВозвратов > 0);
		Файл.Вставить("Описание",                Описание);
		Файл.Вставить("ТаблицаНоменклатура",     ТаблицаПродажи);
		Файл.Вставить("НастройкиСопоставленияНоменклатуры", НастройкиСопоставления);
		Файл.Вставить("СкорректированНаПродажиЮрлицам", Ложь);
		
		ДанныеФайлов.Добавить(Файл);
		
	КонецЕсли; 
	
	Если ТаблицаСписание.Количество() > 0 Тогда 
		
		Описание = СтрШаблон(НСтр("ru='Отчет о списании Wildberries от %1
			|Сумма компенсации: %2'"),
			Формат(Дата, "ДФ=dd.MM.yyyy"),
			Формат(ТаблицаСписание.Итог("Сумма"), "ЧДЦ=2; ЧН="));
			
		НомерВходящегоДокумента = ТаблицаСписание[0].ИдентификаторОтчета;
			
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Плательщик",     Новый Структура("Ссылка", Контрагент));
		ДанныеДокумента.Вставить("Получатель",     Новый Структура("Ссылка", Организация));
		ДанныеДокумента.Вставить("Договор",        ДоговорКонтрагента);
		ДанныеДокумента.Вставить("ДатаНач",        ПараметрыОтчета.НачалоПериода);
		ДанныеДокумента.Вставить("Дата",           ПараметрыОтчета.ОкончаниеПериода);
		ДанныеДокумента.Вставить("ТаблицаТоваров", ТаблицаСписание);
		ДанныеДокумента.Вставить("ВидДокумента"  , ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBСписание());
		ДанныеДокумента.Вставить("Номер"         , НомерВходящегоДокумента);
		ОбменСМаркетплейс.ПервичныеДанныеМаркетплейсаИзТаблицы(ДанныеДокумента, ТаблицаСписание);
		
		Файл = Новый Структура;
		Файл.Вставить("ПолноеИмяФайла",          НомерВходящегоДокумента);
		Файл.Вставить("ДанныеДокумента",         ДанныеДокумента);
		Файл.Вставить("ВидДокумента",            ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBСписание());
		Файл.Вставить("Маркетплейс",             Перечисления.ВидыМаркетплейсов.Wildberries);
		Файл.Вставить("Организация",             Организация);
		Файл.Вставить("Контрагент",              Контрагент);
		Файл.Вставить("ДоговорКонтрагента",      ДоговорКонтрагента);
		Файл.Вставить("Дата",                    Дата);
		Файл.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
		Файл.Вставить("СуммаСписания",           ТаблицаСписание.Итог("Сумма"));
		Файл.Вставить("Загружать",               ТаблицаСписание.Итог("Сумма") > 0);
		Файл.Вставить("Описание",                Описание);
		Файл.Вставить("ТаблицаНоменклатура",     ТаблицаСписание);
		Файл.Вставить("НастройкиСопоставленияНоменклатуры", НастройкиСопоставления);
		
		ДанныеФайлов.Добавить(Файл);
	
	КонецЕсли;
	
	Если ТаблицаОприходование.Количество() > 0 Тогда 
		
		Описание = СтрШаблон(НСтр("ru='Отчет о списании Wildberries от %1
			|Сумма компенсации: %2'"),
			Формат(Дата, "ДФ=dd.MM.yyyy"),
			Формат(ТаблицаОприходование.Итог("Сумма"), "ЧДЦ=2; ЧН="));
			
		НомерВходящегоДокумента = ТаблицаОприходование[0].ИдентификаторОтчета;
			
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Плательщик",     Новый Структура("Ссылка", Контрагент));
		ДанныеДокумента.Вставить("Получатель",     Новый Структура("Ссылка", Организация));
		ДанныеДокумента.Вставить("Договор",        ДоговорКонтрагента);
		ДанныеДокумента.Вставить("ДатаНач",        ПараметрыОтчета.НачалоПериода);
		ДанныеДокумента.Вставить("Дата",           ПараметрыОтчета.ОкончаниеПериода);
		ДанныеДокумента.Вставить("ТаблицаТоваров", ТаблицаОприходование);
		ДанныеДокумента.Вставить("ВидДокумента"  , ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBОприходование());
		ДанныеДокумента.Вставить("Номер"         , НомерВходящегоДокумента);
		ОбменСМаркетплейс.ПервичныеДанныеМаркетплейсаИзТаблицы(ДанныеДокумента, ТаблицаОприходование);
		
		Файл = Новый Структура;
		Файл.Вставить("ПолноеИмяФайла",          НомерВходящегоДокумента);
		Файл.Вставить("ДанныеДокумента",         ДанныеДокумента);
		Файл.Вставить("ВидДокумента",            ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBОприходование());
		Файл.Вставить("Маркетплейс",             Перечисления.ВидыМаркетплейсов.Wildberries);
		Файл.Вставить("Организация",             Организация);
		Файл.Вставить("Контрагент",              Контрагент);
		Файл.Вставить("ДоговорКонтрагента",      ДоговорКонтрагента);
		Файл.Вставить("Дата",                    Дата);
		Файл.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
		Файл.Вставить("СуммаВозвратов",          ТаблицаОприходование.Итог("Сумма"));
		Файл.Вставить("Загружать",               ТаблицаОприходование.Итог("Сумма") > 0);
		Файл.Вставить("Описание",                Описание);
		Файл.Вставить("ТаблицаНоменклатура",     ТаблицаОприходование);
		Файл.Вставить("НастройкиСопоставленияНоменклатуры", НастройкиСопоставления);
		
		ДанныеФайлов.Добавить(Файл);
	
	КонецЕсли;
	
	Для Каждого УведомлениеОВыкупе Из УведомленияОВыкупе Цикл
		Если УведомлениеОВыкупе.Свойство("Предупреждение")
			Или УведомлениеОВыкупе.Свойство("СообщениеПользователю") Тогда
			ДанныеФайлов.Добавить(УведомлениеОВыкупе);
			Продолжить;
		КонецЕсли;
		
		Описание = СтрШаблон(НСтр("ru='Уведомление о выкупе Wildberries №%1 от %2
			|Сумма выкупа: %3'"),
			УведомлениеОВыкупе.ДанныеДокумента.Номер,
			Формат(УведомлениеОВыкупе.ДанныеДокумента.Дата, "ДФ=dd.MM.yyyy"),
			Формат(УведомлениеОВыкупе.СуммаВыкупа, "ЧДЦ=2; ЧН="));
			
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Плательщик",     Новый Структура("Ссылка", Контрагент));
		ДанныеДокумента.Вставить("Получатель",     Новый Структура("Ссылка", Организация));
		ДанныеДокумента.Вставить("ДатаНач",        ПараметрыОтчета.НачалоПериода);
		ДанныеДокумента.Вставить("Дата",           УведомлениеОВыкупе.ДанныеДокумента.Дата);
		ДанныеДокумента.Вставить("ТаблицаТоваров", УведомлениеОВыкупе.ДанныеДокумента.ТаблицаТоваров);
		ДанныеДокумента.Вставить("Ссылка"        , Неопределено);
		ДанныеДокумента.Вставить("Договор"       , Неопределено);
		ДанныеДокумента.Вставить("Номер"         , УведомлениеОВыкупе.ДанныеДокумента.Номер);
		ДанныеДокумента.Вставить("ПервичныеДанныеМаркетплейса", УведомлениеОВыкупе.ДанныеДокумента.ПервичныеДанныеМаркетплейса);
		
		ВидДокумента = ИдентификаторыУведомленийОВыкупе.Получить(УведомлениеОВыкупе.ДанныеДокумента.Номер);
		Комментарий = "";
		ДоговорКонтрагента = Неопределено;
		Если ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBДетальный() Тогда
			Комментарий = СтрШаблон(НСтр("ru='Уведомление о выкупе Wildberries №%1 от %2'"),
				УведомлениеОВыкупе.ДанныеДокумента.Номер,
				Формат(УведомлениеОВыкупе.ДанныеДокумента.Дата, "ДФ=dd.MM.yyyy"));
			Договор = ДоговорКонтрагента;
			ТаблицаПродажи = ТаблицаТоваров.СкопироватьКолонки();
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(УведомлениеОВыкупе.ДанныеДокумента.ТаблицаТоваров, ТаблицаПродажи);
			ТаблицаПродажи.ЗаполнитьЗначения("продажа", "ВидДвижения");
			ТаблицаПродажи.ЗаполнитьЗначения("Продажа", "ТипДокумента");
			ДанныеДокумента.ТаблицаТоваров = ТаблицаПродажи;
		КонецЕсли;
		
		Файл = Новый Структура;
		Файл.Вставить("ПолноеИмяФайла",          УведомлениеОВыкупе.ДанныеДокумента.Номер);
		Файл.Вставить("ДанныеДокумента",         ДанныеДокумента);
		Файл.Вставить("ВидДокумента",            ВидДокумента);
		Файл.Вставить("Маркетплейс",             Перечисления.ВидыМаркетплейсов.Wildberries);
		Файл.Вставить("Организация",             Организация);
		Файл.Вставить("Контрагент",              Контрагент);
		Файл.Вставить("ДоговорКонтрагента",      Договор);
		Файл.Вставить("Дата",                    УведомлениеОВыкупе.ДанныеДокумента.Дата);
		Файл.Вставить("НомерВходящегоДокумента", УведомлениеОВыкупе.ДанныеДокумента.Номер);
		Файл.Вставить("СуммаВыкупа",             УведомлениеОВыкупе.СуммаВыкупа);
		Файл.Вставить("Загружать",               УведомлениеОВыкупе.СуммаВыкупа > 0);
		Файл.Вставить("Описание",                Описание);
		Файл.Вставить("ТаблицаНоменклатура",     УведомлениеОВыкупе.ТаблицаНоменклатура);
		Файл.Вставить("НастройкиСопоставленияНоменклатуры", НастройкиСопоставления);
		Файл.Вставить("Комментарий",             Комментарий);
		Файл.Вставить("ЗаполнятьДоговор",        Истина);
		
		ДанныеФайлов.Добавить(Файл);
	КонецЦикла;
	
	Возврат ДанныеФайлов;

КонецФункции

Функция РазбитьРеестрПродажЮридическимЛицамПоДокументам(ТаблицаТоваров) Экспорт
	
	Результат = Новый Массив;
	
	Реквизиты = ТаблицаТоваров.Скопировать(, "НомерДокумента, ДатаДокумента");
	Реквизиты.Свернуть("НомерДокумента, ДатаДокумента");
	
	Для Каждого Документ Из Реквизиты Цикл
		
		ОтборПоСтрокам = Новый Структура("НомерДокумента, ДатаДокумента", Документ.НомерДокумента, Документ.ДатаДокумента);
		ТаблицаТоваровПоДокументу = ТаблицаТоваров.Скопировать(ОтборПоСтрокам);
		Если ТаблицаТоваровПоДокументу.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Шапка = Новый Структура("ТипДокумента, НомерДокумента, ДатаДокумента, НомерСФ, ДатаСФ, НомерКоррСФ, ДатаКоррСФ,
			|ИННПокупателя, КПППокупателя, НаименованиеПокупателя, КраткоеНаименованиеПокупателя, Контрагент, ДоговорКонтрагента, Документ");
		ЗаполнитьЗначенияСвойств(Шапка, ТаблицаТоваровПоДокументу[0]);
		Шапка.КраткоеНаименованиеПокупателя = Справочники.Контрагенты.ПолучитьКраткоеНаименованиеКонтрагента(
			Шапка.НаименованиеПокупателя);
		
		Результат.Добавить(Новый Структура("Шапка, Товары", Шапка, ТаблицаТоваровПоДокументу));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьКонтрагентаИДоговорПоРееструПродажЮридическимЛицам(ДанныеДокумента, Организация, ГруппаДляНовыхКонтрагентов, ОписаниеОшибки) Экспорт
	
	Шапка = ДанныеДокумента.Шапка;
	
	РеквизитыПокупателя = Новый Структура("Наименование, НаименованиеПолное, ИНН, КПП, ЮридическоеФизическоеЛицо",
		Шапка.КраткоеНаименованиеПокупателя,
		Шапка.НаименованиеПокупателя,
		Шапка.ИННПокупателя,
		Шапка.КПППокупателя,
		?(СтрДлина(Шапка.ИННПокупателя) = 12 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Шапка.ИННПокупателя),
			Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо,
			Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо));
	Контрагент = РаботаСКонтрагентамиБП.НайтиКонтрагентаПоИНН_КПП(РеквизитыПокупателя);
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		РеквизитыПокупателя.Вставить("Родитель", ГруппаДляНовыхКонтрагентов);
		Попытка
			Контрагент = Справочники.Контрагенты.СоздатьКонтрагента(РеквизитыПокупателя);
		Исключение
			ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Не удалось создать контрагента: %1 (ИНН: %2),
				|по причине %2'"),
				Шапка.НаименованиеПокупателя,
				Шапка.ИННПокупателя,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат;
		КонецПопытки;
	КонецЕсли;
	Шапка.Контрагент = Контрагент;
	
	// Для возвратов договор берем из документа основания
	Если Не ЭтоДокументНаВозврат(Шапка.ТипДокумента) Тогда
		
		НаименованиеДоговора = СтрШаблон(НСтр("ru = '%1 от %2'"),
			СокрЛП(Шапка.НомерДокумента),
			Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yyyy"));
		
		РеквизитыДоговора = Новый Структура;
		РеквизитыДоговора.Вставить("Владелец", Контрагент);
		РеквизитыДоговора.Вставить("Организация", Организация);
		РеквизитыДоговора.Вставить("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		РеквизитыДоговора.Вставить("Наименование", НаименованиеДоговора);
		РеквизитыДоговора.Вставить("Номер", СокрЛП(Шапка.НомерДокумента));
		РеквизитыДоговора.Вставить("Дата", Шапка.ДатаДокумента);
		
		ДополнительныеПараметры = Новый Структура("Наименование, Номер, Дата",
			Новый Структура("ЗначениеОтбора", НаименованиеДоговора),
			Новый Структура("ЗначениеОтбора", СокрЛП(Шапка.НомерДокумента)),
			Новый Структура("ЗначениеОтбора", Шапка.ДатаДокумента));
		
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		ЕстьДоговорКонтрагента = РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(
			ДоговорКонтрагента,
			РеквизитыДоговора.Владелец,
			РеквизитыДоговора.Организация,
			РеквизитыДоговора.ВидДоговора,
			ДополнительныеПараметры);
		Если НЕ ЕстьДоговорКонтрагента Тогда
			ПараметрыСоздания = Новый Структура("ЗначенияЗаполнения", РеквизитыДоговора);
			ДоговорКонтрагента = РаботаСДоговорамиКонтрагентовБПВызовСервера.СоздатьОсновнойДоговорКонтрагента(ПараметрыСоздания);
			Если ДоговорКонтрагента = Неопределено Тогда
				ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Не удалось создать договор с покупателем контрагента: %1 (ИНН: %2).'"),
					Шапка.НаименованиеПокупателя,
					Шапка.ИННПокупателя);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Шапка.ДоговорКонтрагента = ДоговорКонтрагента;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПреобразоватьДанныеФайлов(ДанныеФайлов) Экспорт
	
	ПродажиНаWB = Новый Массив;
	Для Каждого ДанныеФайла Из ДанныеФайлов Цикл
		Если ДанныеФайла.Свойство("ВидДокумента")
			И ДанныеФайла.Свойство("СкорректированНаПродажиЮрлицам")
			И ДанныеФайла.ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетWBДетальный()
			И Не ДанныеФайла.СкорректированНаПродажиЮрлицам Тогда
				ПродажиНаWB.Добавить(ДанныеФайла);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ДанныеФайла Из ДанныеФайлов Цикл
		Если ДанныеФайла.Свойство("ВидДокумента") Тогда
			Если ДанныеФайла.ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаРеестрПродажЮрлицамWB()
				И ПродажиНаWB.Количество() > 0 Тогда
				Для Каждого Продажа Из ПродажиНаWB Цикл
					Если Продажа.Организация = ДанныеФайла.Организация
						И Продажа.Дата = ДанныеФайла.Дата Тогда
						УбратьПродажиЮрлицамИзОтчетаWBДетальный(Продажа, ДанныеФайла);
						ПродажиНаWB.Удалить(ПродажиНаWB.Найти(Продажа));
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ОприходованиеТовараМаркетплейсом(ВидДвижения, ТипДокумента) Экспорт
	
	ЭтоСписание = (Нрег(ВидДвижения) = "оплата потерянного товара" 
					ИЛИ Нрег(ВидДвижения) = "авансовая оплата за товар без движения" 
					ИЛИ Нрег(ВидДвижения) = "частичная компенсация брака"
					ИЛИ Нрег(ВидДвижения) = "компенсация потерянного товара"
					ИЛИ Нрег(ВидДвижения) = "компенсация подмененного товара"
					ИЛИ Нрег(ВидДвижения) = "компенсация ущерба"
					ИЛИ Нрег(ВидДвижения) = "добровольная компенсация при возврате"
					ИЛИ Нрег(ВидДвижения) = "компенсация брака");
					
	ЭтоСторно   = (Нрег(ТипДокумента) = "возврат");
	
	Возврат ЭтоСписание И ЭтоСторно;
	
КонецФункции

// Добавляет к наименованию товара размер (если это уместно)
//
// Параметры:
//  Наименование - Строка - изначальное наименование товара
//  Размер		 - Строка - размер товара
// 
// Возвращаемое значение:
//  Строка - наименование товара с учетом размера (если был указан)
//
Функция СформироватьНаименованиеТовара(Наименование, Размер) Экспорт
	
	Результат = Наименование;
	
	Если Не ЗначениеЗаполнено(Размер)
		Или СокрЛП(Размер) = "0" Тогда
		Результат = Наименование;
	Иначе
		Результат = СтрШаблон("%1, %2", Наименование, Размер);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСТоварами

Функция ПолучитьОстаткиТоваров(НастройкиИнтеграции, Отбор, Отказ) Экспорт
	ТаблицаОстатковТоваров = ОбменСМаркетплейс.НовыйТаблицаОстатковТоваров();
	Если НЕ ЗначениеЗаполнено(Отбор) Тогда
		Возврат ТаблицаОстатковТоваров;
	КонецЕсли;
	
	НастройкиПодключения = НовыйНастройкиПодключения();
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(НастройкиИнтеграции);
	НастройкиПодключения.АдресСервера = АдресСервераМаркетплейсWilberries();
	//Логирование
	Если РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЛогированиеВключено() ТОгда
		НастройкиПодключения.Вставить("Логирование", РегистрыСведений.ЖурналОбменаСМаркетплейсами.ПараметрыЛогирования(НастройкиИнтеграции));
	КонецЕсли;
	//Конец Логирование
	ИдентификаторСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкиИнтеграции, "ИдентификаторСклада");
	Если НЕ ЗначениеЗаполнено(ИдентификаторСклада) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("skus", Новый Массив);
	
	АдресРесурса = "/api/v3/stocks/"+Формат(ИдентификаторСклада, "ЧГ=");
	
	ВыполнятьСЗадержкой = Ложь;
	
	ПорцииТоваров = ОбменСМаркетплейс.ПодготовитьПорцииДляОбмена(Отбор, 1000);
	Для каждого Порция Из ПорцииТоваров Цикл
		ПараметрыЗапроса.skus.Очистить();
		
		Для каждого СтрокаТовары Из Порция Цикл
			ПараметрыЗапроса.skus.Добавить(СтрокаТовары.Штрихкод);
		КонецЦикла;
		
		РезультатЗапроса = ВыполнитьPOSTЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения);
		Если НЕ РезультатЗапроса.Результат 
			И РезультатЗапроса.ВыполнятьСЗадержкой 
			И НЕ ВыполнятьСЗадержкой тогда
			
			ВыполнятьСЗадержкой = Истина;
		ИначеЕсли НЕ РезультатЗапроса.Результат Тогда
			Отказ = Истина;
			Возврат Неопределено;
		КонецЕсли;
		
		Если ВыполнятьСЗадержкой Тогда
			Приостановить(61);
		КонецЕсли;
		
		ЗаполнитьТаблицуТовары(ТаблицаОстатковТоваров, ИдентификаторСклада, РезультатЗапроса.Данные);
	КонецЦикла;
	
	Возврат ТаблицаОстатковТоваров;
КонецФункции

Процедура ПередатьОстаткиТоваров(НастройкаИнтеграции, ТаблицаТоваров, СообщениеОбОшибке, Отказ, КодОтветаСервера = 0) Экспорт
	ИдентификаторСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаИнтеграции, "ИдентификаторСклада");
	Если НЕ ЗначениеЗаполнено(ИдентификаторСклада) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НастройкиПодключения = НовыйНастройкиПодключения();
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(НастройкаИнтеграции);
	НастройкиПодключения.АдресСервера = АдресСервераМаркетплейсWilberries();
	//Логирование
	Если РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЛогированиеВключено() Тогда
		НастройкиПодключения.Вставить("Логирование", РегистрыСведений.ЖурналОбменаСМаркетплейсами.ПараметрыЛогирования(НастройкаИнтеграции));
	КонецЕсли;
	//Конец Логирование
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("stocks", Новый Массив);
	
	АдресРесурса = "/api/v3/stocks/"+Формат(ИдентификаторСклада, "ЧГ=");
	
	ПорцииДляОбмена = ОбменСМаркетплейс.ПодготовитьПорцииДляОбмена(ТаблицаТоваров, 1000);
	
	ВыполнятьСЗадержкой = Ложь;
	Для каждого Порция Из ПорцииДляОбмена Цикл
		ПараметрыЗапроса.stocks.Очистить();
		Для каждого СтрокаТаблицыТовары Из Порция Цикл
			ОстатокТовара = Новый Структура;
			ОстатокТовара.Вставить("sku", СтрокаТаблицыТовары.Штрихкод);
			ОстатокТовара.Вставить("amount", СтрокаТаблицыТовары.Остаток);
			ПараметрыЗапроса.stocks.Добавить(ОстатокТовара);
		КонецЦикла;
		
		РезультатЗапроса = ВыполнитьPUTЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения);
		Если НЕ РезультатЗапроса.Результат 
			И РезультатЗапроса.ВыполнятьСЗадержкой 
			И НЕ ВыполнятьСЗадержкой тогда
			
			ВыполнятьСЗадержкой = Истина;
		ИначеЕсли НЕ РезультатЗапроса.Результат Тогда
			СообщениеОбОшибке = РезультатЗапроса.СообщениеОбОшибке;
			Отказ = Истина;
			Прервать;
		Иначе
			ОбменСМаркетплейс.ОбновитьДанныеОбОстатках(НастройкаИнтеграции, Порция);
		КонецЕсли;
		
		Если ВыполнятьСЗадержкой Тогда
			Приостановить(61);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьТоварыИзСервиса(НастройкаИнтеграции, СообщениеОбОшибке)
	// Размер получаемой порции, определяется wb
	РазмерПорции = 100;
	
	НастройкиПодключения = НовыйНастройкиПодключения();
	НастройкиПодключения.АдресСервера = АдресСервераКонтентWildberries();
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(НастройкаИнтеграции);
	
	//Логирование
	Если РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЛогированиеВключено() Тогда
		НастройкиПодключения.Вставить("Логирование", РегистрыСведений.ЖурналОбменаСМаркетплейсами.ПараметрыЛогирования(НастройкаИнтеграции));
	КонецЕсли;
	//Конец Логирование
	
	Параметры = Новый Структура;
	Параметры.Вставить("cursor", Новый Структура("limit", РазмерПорции));
	Параметры.Вставить("filter", Новый Структура("withPhoto", -1));
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("settings", Параметры);
	
	КарточкиТоваров = Новый Массив;
	Пока Истина Цикл
		РезультатЗапроса = ВыполнитьPOSTЗапрос("/content/v2/get/cards/list?locale=ru", ПараметрыЗапроса, НастройкиПодключения);
		Если НЕ РезультатЗапроса.Результат Тогда
			СообщениеОбОшибке = РезультатЗапроса.СообщениеОбОшибке;
			Возврат Неопределено;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КарточкиТоваров, РезультатЗапроса.Данные.cards);
		
		Пагинатор = РезультатЗапроса.Данные.cursor;
		Если Пагинатор.total < РазмерПорции Тогда
			Прервать;
		КонецЕсли;
		ПараметрыЗапроса.settings.Вставить("cursor", Пагинатор);
	КонецЦикла;
	
	Возврат КарточкиТоваров;
КонецФункции

Функция СписокТоваровМаркетплейс(НастройкиИнтеграции, СообщениеОбОшибке, Отказ) Экспорт
	СписокТоваровСервиса = ПолучитьТоварыИзСервиса(НастройкиИнтеграции, СообщениеОбОшибке); 
	Если ЗначениеЗаполнено(СообщениеОбОшибке) тогда
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	Контрагент = Справочники.НастройкиИнтеграцииМаркетплейс.КонтрагентДоговорНаДату(НастройкиИнтеграции, ТекущаяДатаСеанса()).Контрагент;
	Владелец = СопоставлениеНоменклатурыКонтрагентовСлужебный.ВладелецНоменклатурыКонтрагента(Контрагент);
	
	СписокТоваров = Новый Массив;
	Для Каждого ИнформацияОТоваре Из СписокТоваровСервиса Цикл
		КодМагазина = Формат(ИнформацияОТоваре.nmID, "ЧГ=");
		
		Для каждого Размер Из ИнформацияОТоваре.sizes Цикл
			Для каждого Штрихкод Из Размер.skus Цикл // У wildberries штрихкод является ключевым полем
				НоменклатураМаркетплейса = ОбменСМаркетплейс.НовыйНоменклатураМаркетплейса(Перечисления.ВидыМаркетплейсов.Wildberries, Владелец);
				НоменклатураМаркетплейса.КодМагазина = КодМагазина;
				НоменклатураМаркетплейса.Наименование = СтрШаблон("%1/%2/%3",
					ИнформацияОТоваре.subjectname,
					ИнформацияОТоваре.brand,
					КодМагазина);
				НоменклатураМаркетплейса.Артикул = ИнформацияОТоваре.VendorCode;
				НоменклатураМаркетплейса.Штрихкоды.Добавить(Штрихкод);
				
				ОбменСМаркетплейс.ДобавитьНоменклатуруВСписок(СписокТоваров, НоменклатураМаркетплейса);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокТоваров;
КонецФункции

Процедура ЗаполнитьТаблицуТовары(ТаблицаОстатковТоваров, ИдентификаторСклада, РезультатЧтения)
	ДанныеМаркетплейса = Новый ТаблицаЗначений;
	ДанныеМаркетплейса.Колонки.Добавить("Sku",    ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ДанныеМаркетплейса.Колонки.Добавить("amount", ОбщегоНазначения.ОписаниеТипаЧисло(6,0));
	
	Для каждого ЭлементРезультата Из РезультатЧтения["stocks"] Цикл
		ЗаполнитьЗначенияСвойств(ДанныеМаркетплейса.Добавить(), ЭлементРезультата);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеМаркетплейса.sku КАК Штрихкод,
	|	ДанныеМаркетплейса.amount КАК Остаток
	|ПОМЕСТИТЬ ВТ_ДанныеМаркетплейса
	|ИЗ
	|	&ДанныеМаркетплейса КАК ДанныеМаркетплейса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураМаркетплейсов.ИдентификаторТовара КАК ИдентификаторТовара,
	|	&ИдентификаторСклада КАК ИдентификаторСклада,
	|	НоменклатураМаркетплейсов.Штрихкод КАК Штрихкод,
	|	ВТ_ДанныеМаркетплейса.Остаток КАК Остаток
	|ИЗ
	|	ВТ_ДанныеМаркетплейса КАК ВТ_ДанныеМаркетплейса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураМаркетплейсов КАК НоменклатураМаркетплейсов
	|		ПО ВТ_ДанныеМаркетплейса.Штрихкод = НоменклатураМаркетплейсов.Штрихкод
	|ГДЕ
	|	НЕ НоменклатураМаркетплейсов.Штрихкод ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДанныеМаркетплейса",  ДанныеМаркетплейса);
	Запрос.УстановитьПараметр("ИдентификаторСклада", ИдентификаторСклада);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОстатковТоваров.Добавить(), Выборка);
	КонецЦикла;
КонецПроцедуры

Функция ПодготовитьФайлОстатков(НастройкаИнтеграции, ТаблицаОстатки) Экспорт
	СтруктураФайла = Новый Структура;
	СтруктураФайла.Вставить("ИмяФайла", "stocks.xlsx");
	СтруктураФайла.Вставить("Страницы", Новый Соответствие);
	
	Макет = РегистрыСведений.ОстаткиТоваровМаркетплейсов.ПолучитьМакет("ФормаОстатковWB");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ОстаткиНаСкладе_Шапка"));
	
	ОбластьОстатки = Макет.ПолучитьОбласть("ОстаткиНаСкладе_Строка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаОстатки", ТаблицаОстатки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Остаток КАК Остаток,
	|	ТаблицаОстатки.ИдентификаторТовара КАК ИдентификаторТовара
	|ПОМЕСТИТЬ ВТ_ОстаткиТоваров
	|ИЗ
	|	&ТаблицаОстатки КАК ТаблицаОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураМаркетплейсов.Штрихкод КАК Штрихкод,
	|	ВТ_ОстаткиТоваров.Остаток КАК Остаток
	|ИЗ
	|	ВТ_ОстаткиТоваров КАК ВТ_ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураМаркетплейсов КАК НоменклатураМаркетплейсов
	|		ПО ВТ_ОстаткиТоваров.ИдентификаторТовара = НоменклатураМаркетплейсов.ИдентификаторТовара";
	
	ВыборкаРезультатов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаРезультатов.Следующий() Цикл
		ОбластьОстатки.Параметры.Заполнить(ВыборкаРезультатов);
		
		ТабличныйДокумент.Вывести(ОбластьОстатки);
	КонецЦикла;
	
	СтруктураФайла.Страницы.Вставить("Остатки", ПоместитьВоВременноеХранилище(ТабличныйДокумент));
	
	Возврат СтруктураФайла;
КонецФункции


#КонецОбласти

#Область РаботаСоСкладами

Функция СписокСкладов(НастройкаИнтеграции, Отказ) Экспорт
	НастройкиПодключения = НовыйНастройкиПодключения();
	НастройкиПодключения.Токен = ПрочитатьНастройкиАвторизации(НастройкаИнтеграции);
	НастройкиПодключения.АдресСервера = АдресСервераМаркетплейсWilberries();
    //Логирование
	Если РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЛогированиеВключено() Тогда
		НастройкиПодключения.Вставить("Логирование", РегистрыСведений.ЖурналОбменаСМаркетплейсами.ПараметрыЛогирования(НастройкаИнтеграции));
	КонецЕсли;
	//КонецЛогирование
	РезультатЗапроса = ВыполнитьGETЗапрос("/api/v3/warehouses", НастройкиПодключения);
	Если НЕ РезультатЗапроса.Результат тогда
		Отказ = Истина;
		Возврат Неопределено;
	КонецЕсли;
	
	СписокСкладов = Новый СписокЗначений;
	Для каждого СтрокаСклад Из РезультатЗапроса.Данные Цикл
		СписокСкладов.Добавить(Формат(СтрокаСклад.id, "ЧГ="), СтрокаСклад.name);
	КонецЦикла;
	
	Возврат СписокСкладов;
	
КонецФункции

#КонецОбласти

#Область ОтчетОПродажах

Функция ПолучитьДанныеДокумента(ПараметрыОтчета, КодОтветаСервера, СообщениеОбОшибке) Экспорт
	РезультатЧтения = ПрочитатьОтчет(ПараметрыОтчета, КодОтветаСервера, СообщениеОбОшибке);
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если РезультатЧтения = Неопределено Тогда
		//Все прочие ошибки
		СообщениеОбОшибке = НСтр("ru = 'Не удалось разобрать ответ от маркетплейс. Попробуйте загрузить отчет позже'");
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
		Возврат Неопределено;
	ИначеЕсли Не ЗначениеЗаполнено(РезультатЧтения) Тогда
		//В загруженных данных не оказалось подходящих для загрузки
		СообщениеОбОшибке = СтрШаблон(
				НСтр("ru = 'В отчете за период с %1 по %2 отсутствуют сведения о продажах, возвратах или списаниях товаров.'"),
					Формат(ПараметрыОтчета.НачалоПериода,"ДЛФ=D"),
					Формат(ПараметрыОтчета.ОкончаниеПериода,"ДЛФ=D"));
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеФайлов = ПреобразоватьДанныеПрочитанногоОтчета(ПараметрыОтчета, РезультатЧтения);
	
	ДанныеФайловРеестрПродажЮрлицам = РеестрыПродажЮрлицамЗаПериод(ПараметрыОтчета);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеФайлов, ДанныеФайловРеестрПродажЮрлицам);
	ПреобразоватьДанныеФайлов(ДанныеФайлов);
	
	Возврат ДанныеФайлов;
	
КонецФункции

Процедура ДополнитьТаблицуТоваровWildberries(Источник, ТаблицаТоваров)
	
	ВариантОбработкиЧисел = ОбменСМаркетплейс.ОпределитьВариантОбработкиЧисел();
	
	Для Каждого СтрокаОтчета Из Источник Цикл
		
		Сумма        = ОбменСМаркетплейс.СтрокаВЧисло(СтрокаОтчета.retailAmount, ВариантОбработкиЧисел);
		ВидДвижения  = НРег(СтрокаОтчета.sellerOperName);
		ТипДокумента = НРег(СтрокаОтчета.docTypeName);
		КодСтраны    = СтрокаОтчета.country;
		
		Если ПродажаЧерезВыкупТовара(КодСтраны, КодСтраны)
			Или ПродажаТовараМаркетплейсом(ВидДвижения, ТипДокумента)
			Или ВозвратТовараМаркетплейсом(ВидДвижения, ТипДокумента) Тогда
		ИначеЕсли ВидДвижения = "компенсация подмененного товара" Тогда
			Сумма = ОбменСМаркетплейс.СтрокаВЧисло(СтрокаОтчета.forPay, ВариантОбработкиЧисел);
		ИначеЕсли СписаниеТовараМаркетплейсом(ВидДвижения, ТипДокумента)
			ИЛИ ОприходованиеТовараМаркетплейсом(ВидДвижения, ТипДокумента) Тогда
			Сумма = ОбменСМаркетплейс.СтрокаВЧисло(СтрокаОтчета.forPay, ВариантОбработкиЧисел);
		Иначе
			Продолжить;
		КонецЕсли;
		
		ИдентификаторТовара = Формат(СтрокаОтчета.nmId, "ЧГ=0");
		
		//По таким позициям, даже при наличии ШК, сопоставление невозможно
		Если Не ЗначениеЗаполнено(СтрокаОтчета.subjectName)
			И Не ЗначениеЗаполнено(СтрокаОтчета.brandName)
			И Не ЗначениеЗаполнено(ИдентификаторТовара) Тогда
			Продолжить;
		КонецЕсли;
		
		Артикул = СтрокаОтчета.vendorCode;
		ЛеваяЧасть = Лев(Артикул, Стрдлина(Артикул)/2);
		ПраваяЧасть = Прав(Артикул, Стрдлина(Артикул)/2);
		Артикул = ?(ЛеваяЧасть = ПраваяЧасть, ЛеваяЧасть, Артикул);
		
		Если ЗначениеЗаполнено(СтрокаОтчета.sku) Тогда
			ИД = СопоставлениеНоменклатурыКонтрагентов.ИдентификаторТовараПоСтроке(ИдентификаторТовара + "#" + СтрокаОтчета.sku);
		Иначе
			ИД = СопоставлениеНоменклатурыКонтрагентов.ИдентификаторТовараПоСтроке(ИдентификаторТовара);
		КонецЕсли;
		
		НоваяСтрокаТовара = ТаблицаТоваров.Добавить();
		НоваяСтрокаТовара.ИД                  = ИД;
		НоваяСтрокаТовара.НаимТов             = СформироватьНаименованиеТовара(СтрокаОтчета.title, СтрокаОтчета.techSize);
		НоваяСтрокаТовара.Артикул             = Артикул;
		НоваяСтрокаТовара.ВидДвижения         = ВидДвижения;
		НоваяСтрокаТовара.ТипДокумента        = СтрокаОтчета.docTypeName;
		НоваяСтрокаТовара.ИдентификаторОтчета = Формат(СтрокаОтчета.reportId, "ЧГ=0");
		НоваяСтрокаТовара.ТипОтчета           = СтрокаОтчета.reportType;
		НоваяСтрокаТовара.Количество          = СтрокаОтчета.quantity;
		НоваяСтрокаТовара.Сумма               = Сумма;
		НоваяСтрокаТовара.КодСтраны           = КодСтраны;
		НоваяСтрокаТовара.НазваниеСтраны      = КодСтраны;
		НоваяСтрокаТовара.ШтрихКод            = СтрокаОтчета.sku;
		НоваяСтрокаТовара.КодМагазина         = ИдентификаторТовара;
		НоваяСтрокаТовара.ПродажаЮрлицу       = СтрокаОтчета.isB2b;
		НоваяСтрокаТовара.ДанныеМаркетплейса  = СтрокаОтчета;
		
		Если ВидДвижения = "Возврат" Тогда
			//WB: Литера Z в конце строки означает часовой пояс UTC. При ее отсутствии время считается в часовом поясе МСК (UTC+3)
			//Приведем все часовые пояса к началу дня
			НоваяСтрокаТовара.ДатаПродажи = НачалоДня(ПрочитатьДатуJSON(СтрокаОтчета.saleDt, ФорматДатыJSON.ISO));
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция МетодЗапросаФинансыДетализацияОтчетовРеализации()
	
	Возврат "/api/finance/v1/sales-reports/detailed";
	
КонецФункции

Функция НомерОтчетаИзИмениФайла(ПолноеИмяФайла) Экспорт
	
	СтрокаЦифровыхСимволов = "0123456789";
	
	Номер = "";
	//Исключим символы до номера
	Для Индекс = 1 По СтрДлина(ПолноеИмяФайла) Цикл
		Символ = Сред(ПолноеИмяФайла, Индекс, 1);
		Если СтрНайти(СтрокаЦифровыхСимволов, Символ) > 0 Тогда
			Номер = Сред(ПолноеИмяФайла, Индекс);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Результат = "";
	//Отбросим символы после номера
	Для Индекс = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер, Индекс, 1);
		Если СтрНайти(СтрокаЦифровыхСимволов, Символ) = 0 Тогда
			Прервать;
		КонецЕсли;
		Результат = Результат + Символ;
	КонецЦикла;
	
	Если Результат = "0" Тогда
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ЗапросОтчетОпродажахWildberries(ПараметрыЗапроса, СообщениеОбОшибке, Логирование = Неопределено)
	
	НастройкиПодключения = ПараметрыЗапроса.НастройкиПодключения;
	
	МетодЗапроса = МетодЗапросаФинансыДетализацияОтчетовРеализации();
	
	Если ПревышенЛимитЗапросов(ПараметрыЗапроса, МетодЗапроса) Тогда
		Приостановить(61);
	КонецЕсли;
	
	СписокПараметровМетода = Новый Структура;
	СписокПараметровМетода.Вставить("dateFrom", Формат(ПараметрыЗапроса.НачалоПериода,"ДФ=гггг-ММ-дд"));
	СписокПараметровМетода.Вставить("dateTo", Формат(ПараметрыЗапроса.ОкончаниеПериода,"ДФ=гггг-ММ-дд"));
	СписокПараметровМетода.Вставить("limit", ПараметрыЗапроса.ПределВыборкиОдногоЗапроса);
	СписокПараметровМетода.Вставить("rrdId", ПараметрыЗапроса.НачалоВыборки);
	Если ЗначениеЗаполнено(ПараметрыЗапроса.Поля) Тогда
		СписокПараметровМетода.Вставить("fields", ПараметрыЗапроса.Поля);
	КонецЕсли;
	
	АдресСервера = АдресСервераФинансыWildberries();
	
	ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTPS");
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровОС);
	HTTPСоединениеВайлдберризАпиФинансы = Новый HTTPСоединение(
		АдресСервера,
		, , ,
		ИнтернетПрокси,
		,
		ЗащищенноеСоединение);
	
	ЗаголовкиHTTPЗапроса = Новый Соответствие();
	ЗаголовкиHTTPЗапроса.Вставить("Content-Type", "application/json;charset=UTF-8");
	ЗаголовкиHTTPЗапроса.Вставить("Authorization", НастройкиПодключения.Токен);
	
	HTTPЗапрос = Новый HTTPЗапрос(МетодЗапроса, ЗаголовкиHTTPЗапроса);
	ТелоЗапроса = ОбменСМаркетплейс.ВJSON(СписокПараметровМетода);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, "UTF8", ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		HTTPОтвет = HTTPСоединениеВайлдберризАпиФинансы.ОтправитьДляОбработки(HTTPЗапрос); // POST
	Исключение
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
		ВызватьИсключение;
	КонецПопытки;
	
	//Логирование
	Если Не Логирование = Неопределено Тогда 
		Если HTTPСоединениеВайлдберризАпиФинансы  = Неопределено Тогда
			Логирование.АдресСервера 	= АдресСервера;
		Иначе
			Логирование.АдресСервера 	= HTTPСоединениеВайлдберризАпиФинансы.Сервер +":"+HTTPСоединениеВайлдберризАпиФинансы.Порт;
			Логирование.Соединение 		= Истина;
			Логирование.Метод 			= "POST";
			Логирование.Запрос 			= HTTPЗапрос;
			Логирование.Ответ 			= HTTPОтвет;
		КонецЕсли;
		РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЗаписатьВЖурнал(Логирование);
	КонецЕсли;
	//Конец Логирование
	
	ОбновитьЛимитыЗапросов(ПараметрыЗапроса, МетодЗапроса, HTTPОтвет.Заголовки);
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция НовыйПараметрыЗапросаОтчетОпродажахWildberries() Экспорт
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("НастройкиПодключения");
	ПараметрыЗапроса.Вставить("НачалоПериода", Дата(1,1,1));
	ПараметрыЗапроса.Вставить("ОкончаниеПериода", Дата(1,1,1));
	ПараметрыЗапроса.Вставить("ПределВыборкиОдногоЗапроса", 0);
	ПараметрыЗапроса.Вставить("НачалоВыборки", 0);
	ПараметрыЗапроса.Вставить("ЛимитыЗапросов", Новый Соответствие);
	ПараметрыЗапроса.Вставить("Поля", Новый Массив);
	
	Возврат ПараметрыЗапроса;

КонецФункции

#КонецОбласти

#Область ЛимитыЗапросов

// Приостанавливает работу программы на указанное количество секунд.
//
Процедура Приостановить(Секунд)
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		
		ПараметрыЗапускаПрограммы = ФайловаяСистема.ПараметрыЗапускаПрограммы();
		ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
		ФайловаяСистема.ЗапуститьПрограмму("timeout " + Секунд, ПараметрыЗапускаПрограммы);
		
	Иначе
		
		МодульОбщегоНазначенияБТС = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияБТС");
		МодульОбщегоНазначенияБТС.Пауза(Секунд);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьЛимитыЗапросов(ПараметрыЗапроса, АдресЗапроса, ЗаголовкиОтвета)
	
	// Количество запросов, которое можно выполнить на данный момент без пауз.
	ЗаголовокОстатокЗапросов = "X-Ratelimit-Remaining";
	
	// Если X-Ratelimit-Remaining равен 0 и вы сделали следующий запрос без задержки,
	// в ответ вы получите ошибку 429.
	Остаток = ЗаголовкиОтвета.Получить(ЗаголовокОстатокЗапросов);
	Результат = Остаток <> Неопределено И Строка(Остаток) = "0";
	
	ЛимитыЗапросов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "ЛимитыЗапросов", Новый Соответствие);
	ЛимитыЗапросов.Вставить(АдресЗапроса, Результат);
	
КонецПроцедуры

Функция ПревышенЛимитЗапросов(ПараметрыЗапроса, АдресЗапроса)
	
	ЛимитыЗапросов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапроса, "ЛимитыЗапросов", Новый Соответствие);
	Результат = ЛимитыЗапросов.Получить(АдресЗапроса);
	
	Возврат Результат <> Неопределено И Результат;
	
КонецФункции

Функция СообщениеОПревышенииЛимитовЗапросов(ЗаголовкиОтвета, Токен)
	
	// X-Ratelimit-Retry — через сколько секунд вы можете повторить запрос.
	// Если вы сделаете попытку раньше, вы все равно будете получать ошибку 429
	ЗаголовокПовторногоЗапроса = "X-Ratelimit-Retry";
	
	ПредложитьЗагрузкаЧерезФайлы = Ложь;
	
	Ответ = НСтр("ru = 'Превышен лимит запросов к API Wildberries. '");
	
	Значение = ЗаголовкиОтвета.Получить(ЗаголовокПовторногоЗапроса);
	Если Значение = Неопределено Или Строка(Значение) = "0" Тогда
		Ответ = Ответ + НСтр("ru = 'Повторите позже. '");
	Иначе
		Остаток = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Значение);
		Если Остаток = Неопределено Тогда
			Ответ = Ответ + НСтр("ru = 'Повторите позже. '");
		ИначеЕсли Остаток < 59 * 60 Тогда
			КоличествоМинут = Цел(Остаток / 60) + 1;
			ПредставлениеМинут = НСтр("ru = ';%1 минуту;;%1 минуты;%1 минут;%1 минуты'");
			Ответ = Ответ + СтрШаблон(НСтр("ru = 'Повторите попытку через %1. '"),
				СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеМинут, КоличествоМинут));
			ПредложитьЗагрузкаЧерезФайлы = КоличествоМинут > 1;
		Иначе
			КоличествоЧасов = Цел(Остаток / (60 * 60)) + 1;
			ПредставлениеЧасов = НСтр("ru = ';%1 час;;%1 часа;%1 часов;%1 часа'");
			Ответ = Ответ + СтрШаблон(НСтр("ru = 'Повторите попытку через %1. '"),
				СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеЧасов, КоличествоЧасов));
			ПредложитьЗагрузкаЧерезФайлы = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИспользуетсяПерсональныйТокен = ИспользуетсяПерсональныйТокенДоступа(Токен);
	Если Не ИспользуетсяПерсональныйТокен Тогда
		Ответ = Ответ + Символы.ПС + НСтр("ru = 'Обратите внимание, что для Базового токена действуют строгие лимиты на количество запросов в сутки. '");
	КонецЕсли;
	Если ПредложитьЗагрузкаЧерезФайлы Тогда
		Ответ = Ответ + НСтр("ru = 'В качестве альтернативы вы можете загрузить отчеты с помощью файлов.'");
	КонецЕсли;
	
	ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(Ответ, Перечисления.ВидыМаркетплейсов.Wildberries);
	
	Возврат Ответ;
	
КонецФункции

Функция ОшибкаЛимитЗапросов()
	Возврат НСтр("ru = 'Превышен лимит запросов'");
КонецФункции

#КонецОбласти

#Область ДокументыWildberries

Функция АдресЗапросаДокументыКатегорииWildberries()
	
	Возврат "/api/v1/documents/list";
	
КонецФункции

Функция АдресЗапросаДокументWildberries()
	
	Возврат "/api/v1/documents/download";
	
КонецФункции

Функция КатегорияДокументаУведомлениеОВыкупе()
	
	Возврат "redeem-notification";
	
КонецФункции

Функция КатегорияДокументаРеестрПродажЮрлицам()
	
	Возврат "sales-registry-to-legals";
	
КонецФункции

Функция НовыйПараметрыЗапросаДокумент()
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("НастройкиПодключения");
	ПараметрыЗапроса.Вставить("ИдентификаторДокумента", "");
	ПараметрыЗапроса.Вставить("ФорматДокумента", "");
	ПараметрыЗапроса.Вставить("ЛимитыЗапросов", Новый Соответствие);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция НовыйПараметрыЗапросаДокументыКатегории()
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("НастройкиПодключения");
	ПараметрыЗапроса.Вставить("КатегорияДокумента", "");
	ПараметрыЗапроса.Вставить("НачалоПериода", Дата(1,1,1));
	ПараметрыЗапроса.Вставить("ОкончаниеПериода", Дата(1,1,1));
	ПараметрыЗапроса.Вставить("ЛимитыЗапросов", Новый Соответствие);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ЗапросДокументыКатегорииWildberries(ПараметрыЗапроса, СообщениеОбОшибке, Логирование = Неопределено)
	
	НастройкиПодключения = ПараметрыЗапроса.НастройкиПодключения;
	
	АдресЗапроса = АдресЗапросаДокументыКатегорииWildberries();
	
	Если ПревышенЛимитЗапросов(ПараметрыЗапроса, АдресЗапроса) Тогда
		Приостановить(11);
	КонецЕсли;
	
	СписокПараметровМетода = Новый Структура;
	СписокПараметровМетода.Вставить("locale", "ru");
	СписокПараметровМетода.Вставить("beginTime", Формат(ПараметрыЗапроса.НачалоПериода, "ДФ=yyyy-MM-dd"));
	СписокПараметровМетода.Вставить("endTime", Формат(ПараметрыЗапроса.ОкончаниеПериода, "ДФ=yyyy-MM-dd"));
	СписокПараметровМетода.Вставить("category", ПараметрыЗапроса.КатегорияДокумента);
	
	ПараметрыСтрокой = Новый Массив;
	Для Каждого Параметр Из СписокПараметровМетода Цикл
		ПараметрыСтрокой.Добавить(Параметр.Ключ+"="+Параметр.Значение);
	КонецЦикла;
	
	МетодЗапроса = АдресЗапроса+ "?" + СтрСоединить(ПараметрыСтрокой,"&");
	
	АдресСервера = АдресСервераДокументыWildberries();
	
	ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTPS");
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровОС);
	HTTPСоединениеВайлдберризАпиДокументы = Новый HTTPСоединение(
		АдресСервера,
		, , ,
		ИнтернетПрокси,
		,
		ЗащищенноеСоединение);
	
	ЗаголовкиHTTPЗапроса = Новый Соответствие();
	ЗаголовкиHTTPЗапроса.Вставить("Content-Type", "application/json;charset=UTF-8");
	ЗаголовкиHTTPЗапроса.Вставить("Authorization", НастройкиПодключения.Токен);
	
	HTTPЗапрос = Новый HTTPЗапрос(МетодЗапроса, ЗаголовкиHTTPЗапроса);
	
	Попытка
		HTTPОтвет = HTTPСоединениеВайлдберризАпиДокументы.Получить(HTTPЗапрос); // GET
	Исключение
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
		ВызватьИсключение;
	КонецПопытки;
	
	//Логирование
	Если Не Логирование = Неопределено Тогда 
		Если HTTPСоединениеВайлдберризАпиДокументы = Неопределено Тогда
			Логирование.АдресСервера = АдресСервера;
		Иначе
			Логирование.АдресСервера = HTTPСоединениеВайлдберризАпиДокументы.Сервер +":"+HTTPСоединениеВайлдберризАпиДокументы.Порт;
			Логирование.Соединение   = Истина;
			Логирование.Метод        = "GET";
			Логирование.Запрос       = HTTPЗапрос;
			Логирование.Ответ        = HTTPОтвет;
		КонецЕсли;
		РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЗаписатьВЖурнал(Логирование);
	КонецЕсли;
	//Конец Логирование
	
	ОбновитьЛимитыЗапросов(ПараметрыЗапроса, АдресЗапроса, HTTPОтвет.Заголовки);
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция ЗапросДокументWildberries(ПараметрыЗапроса, СообщениеОбОшибке, Логирование = Неопределено)
	
	НастройкиПодключения = ПараметрыЗапроса.НастройкиПодключения;
	
	АдресЗапроса = АдресЗапросаДокументWildberries();
	
	Если ПревышенЛимитЗапросов(ПараметрыЗапроса, АдресЗапроса) Тогда
		Приостановить(11);
	КонецЕсли;
	
	СписокПараметровМетода = Новый Структура;
	СписокПараметровМетода.Вставить("serviceName", ПараметрыЗапроса.ИдентификаторДокумента);
	СписокПараметровМетода.Вставить("extension", ПараметрыЗапроса.ФорматДокумента);
	
	ПараметрыСтрокой = Новый Массив;
	Для Каждого Параметр Из СписокПараметровМетода Цикл
		ПараметрыСтрокой.Добавить(Параметр.Ключ+"="+Параметр.Значение);
	КонецЦикла;
	
	МетодЗапроса = АдресЗапроса+ "?" + СтрСоединить(ПараметрыСтрокой,"&");
	
	АдресСервера = АдресСервераДокументыWildberries();
	
	ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTPS");
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровОС);
	HTTPСоединениеВайлдберризАпиДокументы = Новый HTTPСоединение(
		АдресСервера,
		, , ,
		ИнтернетПрокси,
		,
		ЗащищенноеСоединение);
	
	ЗаголовкиHTTPЗапроса = Новый Соответствие();
	ЗаголовкиHTTPЗапроса.Вставить("Content-Type", "application/json;charset=UTF-8");
	ЗаголовкиHTTPЗапроса.Вставить("Authorization", НастройкиПодключения.Токен);
	
	HTTPЗапрос = Новый HTTPЗапрос(МетодЗапроса, ЗаголовкиHTTPЗапроса);
	
	Попытка
		HTTPОтвет = HTTPСоединениеВайлдберризАпиДокументы.Получить(HTTPЗапрос); // GET
	Исключение
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
		ВызватьИсключение;
	КонецПопытки;
	
	//Логирование
	Если Не Логирование = Неопределено Тогда 
		Если HTTPСоединениеВайлдберризАпиДокументы = Неопределено Тогда
			Логирование.АдресСервера = АдресСервера;
		Иначе
			Логирование.АдресСервера = HTTPСоединениеВайлдберризАпиДокументы.Сервер +":"+HTTPСоединениеВайлдберризАпиДокументы.Порт;
			Логирование.Соединение   = Истина;
			Логирование.Метод        = "GET";
			Логирование.Запрос       = HTTPЗапрос;
			Логирование.Ответ        = HTTPОтвет;
		КонецЕсли;
		РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЗаписатьВЖурнал(Логирование);
	КонецЕсли;
	//Конец Логирование
	
	ОбновитьЛимитыЗапросов(ПараметрыЗапроса, АдресЗапроса, HTTPОтвет.Заголовки);
	
	Возврат HTTPОтвет;
	
КонецФункции

#КонецОбласти

#Область РеестрПродажЮридическимЛицам

Процедура УбратьПродажиЮрлицамИзОтчетаWBДетальный(ДанныеФайлаПродаж, ДанныеФайлаРеестра)
	
	ТаблицаТоваров = ДанныеФайлаПродаж.ДанныеДокумента.ТаблицаТоваров;
	ТаблицаТоваров = ТаблицаТоваров.Скопировать(Новый Структура("ПродажаЮрлицу", "Нет"));
	ДанныеФайлаПродаж.ДанныеДокумента.ТаблицаТоваров = ТаблицаТоваров;
	ДанныеФайлаПродаж.ДанныеДокумента.ПервичныеДанныеМаркетплейса = ОбменСМаркетплейс.ОтобратьПервичныеДанныеМаркетплейса(
		ДанныеФайлаПродаж.ДанныеДокумента.ПервичныеДанныеМаркетплейса, "признакпродажиюридическомулицу", "Нет");
	
	СуммаВыкупа = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеФайлаПродаж, "СуммаВыкупа", 0);
	СуммаПродаж = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеФайлаПродаж, "СуммаПродаж", 0)
		- ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеФайлаРеестра, "СуммаПродаж", 0);
	СуммаВозвратов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеФайлаПродаж, "СуммаВозвратов", 0)
		- ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеФайлаРеестра, "СуммаВозвратов", 0);;
	СуммаСписания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеФайлаПродаж, "СуммаСписания", 0);
	
	Если СуммаВыкупа > 0 Тогда
		ОписаниеВыкупа = СтрШаблон(НСтр("ru=' Выкупы: %1'"), Формат(СуммаВыкупа, "ЧДЦ=2; ЧН="));
	Иначе 
		ОписаниеВыкупа = "";
	КонецЕсли;
	
	Описание = СтрШаблон(НСтр("ru='Отчет о продажах Wildberries от %1
		|Продажи: %2 Возвраты: %3 %4
		|Скорректирован на сумму продаж юрлицам'"),
		Формат(ДанныеФайлаПродаж.ДанныеДокумента.Дата, "ДФ=dd.MM.yyyy"),
		Формат(СуммаПродаж, "ЧДЦ=2; ЧН="),
		Формат(СуммаВозвратов, "ЧДЦ=2; ЧН="),
		ОписаниеВыкупа);
	
	ДанныеФайлаПродаж.Вставить("СуммаВыкупа",    СуммаВыкупа);
	ДанныеФайлаПродаж.Вставить("СуммаПродаж",    СуммаПродаж);
	ДанныеФайлаПродаж.Вставить("СуммаВозвратов", СуммаВозвратов);
	ДанныеФайлаПродаж.Вставить("СуммаСписания",  СуммаСписания);
	ДанныеФайлаПродаж.Вставить("Загружать",      СуммаПродаж > 0 ИЛИ СуммаВозвратов > 0);
	ДанныеФайлаПродаж.Вставить("Описание",       Описание);
	ДанныеФайлаПродаж.Вставить("СкорректированНаПродажиЮрлицам", Истина);
	
КонецПроцедуры

Функция ЭтоДокументНаВозврат(ТипДокумента)
	
	Возврат Врег(Лев(СокрЛП(ТипДокумента), 3)) = "УКД";
	
КонецФункции

#КонецОбласти

#Область АвтозагрузкаОтчетовМаркетплейсов

Функция ПериодыАвтозагрузки(Интеграция, ПериодыАвтозагрузки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Интеграция.Организация);
	Запрос.УстановитьПараметр("Контрагент", Интеграция.Контрагент);
	Запрос.УстановитьПараметр("ПериодыАвтозагрузки", ПериодыАвтозагрузки);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, НЕДЕЛЯ)), ДАТАВРЕМЯ(1, 1, 1)) КАК МаксимальныйПериод
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И РеализацияТоваровУслуг.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ВыкупТоваровКомиссионером)
	|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, НЕДЕЛЯ) В (&ПериодыАвтозагрузки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(НАЧАЛОПЕРИОДА(ОтчетКомиссионераОПродажах.Дата, НЕДЕЛЯ)), ДАТАВРЕМЯ(1, 1, 1))
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|ГДЕ
	|	НЕ ОтчетКомиссионераОПродажах.ПометкаУдаления
	|	И ОтчетКомиссионераОПродажах.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетОРозничныхПродажах)
	|	И ОтчетКомиссионераОПродажах.Контрагент = &Контрагент
	|	И ОтчетКомиссионераОПродажах.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(ОтчетКомиссионераОПродажах.Дата, НЕДЕЛЯ) В (&ПериодыАвтозагрузки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, НЕДЕЛЯ)), ДАТАВРЕМЯ(1, 1, 1))
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|	И РеализацияТоваровУслуг.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ПродажаТоваровСоСкладаКомиссионера)
	|	И РеализацияТоваровУслуг.Комиссионер = &Контрагент
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, НЕДЕЛЯ) В (&ПериодыАвтозагрузки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(НАЧАЛОПЕРИОДА(ВозвратТоваровОтПокупателя.Дата, НЕДЕЛЯ)), ДАТАВРЕМЯ(1, 1, 1))
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|ГДЕ
	|	НЕ ВозвратТоваровОтПокупателя.ПометкаУдаления
	|	И ВозвратТоваровОтПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВозвратТоваровОтПокупателя.ТоварыНаСкладКомиссионера)
	|	И ВозвратТоваровОтПокупателя.Комиссионер = &Контрагент
	|	И ВозвратТоваровОтПокупателя.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(ВозвратТоваровОтПокупателя.Дата, НЕДЕЛЯ) В (&ПериодыАвтозагрузки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(НАЧАЛОПЕРИОДА(ОтчетКомиссионераОПродажах.Дата, НЕДЕЛЯ)), ДАТАВРЕМЯ(1, 1, 1))
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|ГДЕ
	|	НЕ ОтчетКомиссионераОПродажах.ПометкаУдаления
	|	И ОтчетКомиссионераОПродажах.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетОСписании)
	|	И ОтчетКомиссионераОПродажах.Контрагент = &Контрагент
	|	И ОтчетКомиссионераОПродажах.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(ОтчетКомиссионераОПродажах.Дата, НЕДЕЛЯ) В (&ПериодыАвтозагрузки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(НАЧАЛОПЕРИОДА(ОтчетКомиссионераОПродажах.Дата, НЕДЕЛЯ)), ДАТАВРЕМЯ(1, 1, 1))
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|ГДЕ
	|	НЕ ОтчетКомиссионераОПродажах.ПометкаУдаления
	|	И ОтчетКомиссионераОПродажах.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомиссионера.ОтчетОбОприходовании)
	|	И ОтчетКомиссионераОПродажах.Контрагент = &Контрагент
	|	И ОтчетКомиссионераОПродажах.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(ОтчетКомиссионераОПродажах.Дата, НЕДЕЛЯ) В (&ПериодыАвтозагрузки)";
	
	Результат = Новый Массив;
	
	МаксимальныйПериод = Дата(1, 1, 1);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МаксимальныйПериод = Макс(МаксимальныйПериод, Выборка.МаксимальныйПериод);
	КонецЦикла;
	
	Для Каждого ПериодАвтозагрузки Из ПериодыАвтозагрузки Цикл
		Если ПериодАвтозагрузки > МаксимальныйПериод Тогда
			НачалоПериода = НачалоНедели(ПериодАвтозагрузки);
			ОкончаниеПериода = КонецНедели(ПериодАвтозагрузки);
			Если Год(НачалоПериода) = Год(ОкончаниеПериода) Тогда
				Результат.Добавить(Новый Структура("НачалоПериода, ОкончаниеПериода", НачалоПериода, ОкончаниеПериода));
			Иначе
				Результат.Добавить(Новый Структура("НачалоПериода, ОкончаниеПериода", НачалоПериода, КонецГода(НачалоПериода)));
				Результат.Добавить(Новый Структура("НачалоПериода, ОкончаниеПериода", НачалоГода(ОкончаниеПериода), ОкончаниеПериода));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция АвтозагрузкаДокументов(Интеграция, ДанныеМаркеплейса) Экспорт
	
	Ошибки = Новый Массив;
	СписокЗагрузки = Новый Массив;
	Для Каждого ДанныеФайла Из ДанныеМаркеплейса Цикл
		Если ДанныеФайла.Свойство("Предупреждение")
			Или ДанныеФайла.Свойство("СообщениеПользователю")
			Или ДанныеФайла.Свойство("ТекстОшибки") Тогда
			Продолжить;
		КонецЕсли;
		ПодготовитьДокументыКСозданию(СписокЗагрузки, ДанныеФайла, Интеграция, Ошибки);
		Если ЗначениеЗаполнено(Ошибки) Тогда
			Для Каждого ОписаниеОшибки Из Ошибки Цикл
				ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(ОписаниеОшибки, Интеграция.Маркетплейс);
			КонецЦикла;
			Возврат Новый Массив;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СоздатьДокументы(СписокЗагрузки);
	
КонецФункции

#КонецОбласти

#Область СозданиеДокументов

Функция СоздатьДокументы(ДанныеДокументов) Экспорт
	
	СозданныеДокументы = Новый Массив;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
	ЭлектронноеВзаимодействиеБП.СоздатьДокументыИзСтруктуры(ДанныеДокументов, АдресХранилища);
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	Для Каждого СтрокаРезультата Из Результат Цикл
		Если СтрокаРезультата.Свойство("СозданДокумент") Тогда
			СозданныеДокументы.Добавить(СтрокаРезультата.СозданДокумент);
		ИначеЕсли СтрокаРезультата.Свойство("ТекстОшибки") Тогда
			ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СтрокаРезультата.ТекстОшибки, Перечисления.ВидыМаркетплейсов.Wildberries);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СозданныеДокументы;
	
КонецФункции

Процедура ПодготовитьДокументыКСозданию(СписокЗагрузки, ДанныеМаркеплейса, ПараметрыИнтеграции, Ошибки) Экспорт
	
	Если ДанныеМаркеплейса.ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаWBУведомлениеВыкупа() Тогда
		СворачиваемыеКолонки = "Наименование,Артикул,ИД,НатуральныйИД,СтавкаНДС,ШтрихКод,КодМагазина";
		СуммируемыеКолонки = "Количество,Сумма,СуммаНДС";
	ИначеЕсли ДанныеМаркеплейса.ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаАктПриемкиТовараWB() Тогда
		СворачиваемыеКолонки = "Наименование,Артикул,ИД,НатуральныйИД,ШтрихКод,КодМагазина";
		СуммируемыеКолонки = "Количество";
	ИначеЕсли ДанныеМаркеплейса.ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаРеестрПродажЮрлицамWB() Тогда
		СворачиваемыеКолонки = "Артикул,ДатаДокумента,ДатаКоррСФ,ДатаСФ,ИД,ИННПокупателя,КПППокупателя,КодМагазина,
			|Наименование,НаименованиеПокупателя,НатуральныйИД,НомерДокумента,НомерКоррСФ,НомерСФ,СтавкаНДС,
			|ТипДокумента,Цена,Штрихкод";
		СуммируемыеКолонки = "Количество,Сумма,СуммаБезНДС,СуммаНДС";
	Иначе
		СворачиваемыеКолонки = "Наименование,Артикул,ИД,НатуральныйИД,ВидДвижения,ТипДокумента,КодСтраны,НазваниеСтраны,
			|ШтрихКод,КодМагазина,ДатаПродажи";
		СуммируемыеКолонки = "Количество,Сумма,КоличествоВозврат,СуммаВозврат";
	КонецЕсли;
	
	Если ДанныеМаркеплейса.ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаРеестрПродажЮрлицамWB() Тогда
		
		ДоговорКомиссионера = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		ВидыДоговоровКонтрагентов = Новый Массив;
		ВидыДоговоровКонтрагентов.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
		
		РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДоговорКомиссионера,
			ДанныеМаркеплейса.Контрагент, ПараметрыИнтеграции.Организация, ВидыДоговоровКонтрагентов);
		
		Для Каждого ПодчиненныйДокумент Из ДанныеМаркеплейса.ДанныеДокумента.ПодчиненныеДокументы Цикл
			Шапка = ПодчиненныйДокумент.Шапка;
			
			ОписаниеОшибки = "";
			СоздатьКонтрагентаИДоговорПоРееструПродажЮридическимЛицам(
				ПодчиненныйДокумент,
				ПараметрыИнтеграции.Организация,
				ПараметрыИнтеграции.ГруппаДляНовыхКонтрагентов,
				ОписаниеОшибки);
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				Ошибки.Добавить(ОписаниеОшибки);
			КонецЕсли;
			
			Если ПараметрыИнтеграции.СпособСверткиОтчетов = "Сворачивать" Тогда
				ПодчиненныйДокумент.Товары.Свернуть(СворачиваемыеКолонки, СуммируемыеКолонки);
			КонецЕсли;
			
			ОписаниеРодителя = ДанныеМаркеплейса.Описание;
			Если ЗначениеЗаполнено(ОписаниеРодителя) Тогда
				МассивПодстрок = СтрРазделить(ОписаниеРодителя, Символы.ПС, Ложь);
				Если МассивПодстрок.Количество() > 0 Тогда
					ОписаниеРодителя = МассивПодстрок[0];
				КонецЕсли;
			КонецЕсли; 
			
			ЭтоДокументНаВозврат = ЭтоДокументНаВозврат(ПодчиненныйДокумент.Шапка.ТипДокумента);
			
			ДанныеДляЗагрузки = Новый Структура;
			Если ЭтоДокументНаВозврат Тогда
				ШаблонОписание = НСтр("ru = 'Возврат на склад комиссионера %1 от %2'");
			Иначе
				ШаблонОписание = НСтр("ru = 'Продажа со склада комиссионера %1 от %2'");
			КонецЕсли;
			ДанныеДляЗагрузки.Вставить("Описание", СтрШаблон(ШаблонОписание, Шапка.НомерДокумента, Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yyyy")));
			ДанныеДляЗагрузки.Вставить("ОписаниеРодителя", ОписаниеРодителя);
			ДанныеДляЗагрузки.Вставить("Маркетплейс", Перечисления.ВидыМаркетплейсов.Wildberries);
			ДанныеДляЗагрузки.Вставить("ВидДокумента", ДанныеМаркеплейса.ВидДокумента);
			ДанныеДляЗагрузки.Вставить("Документ", ПодчиненныйДокумент);
			ДанныеДляЗагрузки.Вставить("Организация", ПараметрыИнтеграции.Организация);
			ДанныеДляЗагрузки.Вставить("КонтрагентМаркетплейс", ДанныеМаркеплейса.Контрагент);
			ДанныеДляЗагрузки.Вставить("ДоговорКомиссионера", ДоговорКомиссионера);
			ДанныеДляЗагрузки.Вставить("ЭтоВозврат", ЭтоДокументНаВозврат);
			ДанныеДляЗагрузки.Вставить("ПервичныеДанныеМаркетплейса", ОбменСМаркетплейс.ОтобратьПервичныеДанныеМаркетплейса(
				ДанныеМаркеплейса.ДанныеДокумента.ПервичныеДанныеМаркетплейса, "номердокумента", Шапка.НомерДокумента));
			ДанныеДляЗагрузки.Вставить("СпособЗагрузки", ПараметрыИнтеграции.СпособЗагрузки);
			СписокЗагрузки.Добавить(ДанныеДляЗагрузки);
			
		КонецЦикла;
		
	Иначе
		Если ПараметрыИнтеграции.СпособСверткиОтчетов = "Сворачивать" Тогда
			Если НЕ (ДанныеМаркеплейса.ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаWBУведомлениеВыкупа()
				Или ДанныеМаркеплейса.ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаАктПриемкиТовараWB()
				ИЛИ ДанныеМаркеплейса.ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаОтчетOzonВыкуп()) Тогда
				ОбработатьДатуПродажи(ДанныеМаркеплейса.ДанныеДокумента.ТаблицаТоваров);
			КонецЕсли;
			ДанныеМаркеплейса.ДанныеДокумента.ТаблицаТоваров.Свернуть(СворачиваемыеКолонки, СуммируемыеКолонки);
		КонецЕсли;
		
		ДанныеМаркеплейса.Вставить("СпособЗагрузки", ПараметрыИнтеграции.СпособЗагрузки);
		
		ДобавитьПолучателяВСтруктуру(ДанныеМаркеплейса.ДанныеДокумента, ПараметрыИнтеграции.Организация);
		
		СписокЗагрузки.Добавить(ДанныеМаркеплейса);
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПолучателяВСтруктуру(ДанныеДокумента, Организация)
	
	Если ДанныеДокумента.Свойство("Получатель") 
		И ТипЗнч(ДанныеДокумента.Получатель) = Тип("Структура") Тогда
		ДанныеДокумента.Получатель.Вставить("Ссылка", Организация);
	Иначе
		Получатель = Новый Структура;
		Получатель.Вставить("Ссылка", Организация);
		ДанныеДокумента.Вставить("Получатель", Получатель);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработатьДатуПродажи(ТаблицаТоваров)
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		Если СтрокаТовара.ВидДвижения <> "Возврат"
			И СтрокаТовара.ВидДвижения <> "Сторно продаж" Тогда
			СтрокаТовара.ДатаПродажи = Дата(1,1,1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОтложенноеСопоставлениеНоменклатуры

Функция НастройкиСопоставленияНоменклатуры(ВидДокумента) Экспорт
	
	ЕстьСтавкаНДС = (ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаWBУведомлениеВыкупа())
		Или (ВидДокумента = ЭлектронноеВзаимодействиеБП.ВидДокументаРеестрПродажЮрлицамWB());
	
	ВидимостьКолонокСопоставления = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НовыеНастройкиВидимостиКолонокСопоставления();
	ВидимостьКолонокСопоставления.Вставить("ЕдиницаИзмерения", Ложь);
	ВидимостьКолонокСопоставления.Вставить("Упаковка", Ложь);
	ВидимостьКолонокСопоставления.Вставить("СтавкаНДС", ЕстьСтавкаНДС);
	
	ДополнительныйРеквизит = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НовыйДополнительныйРеквизитСопоставления();
	ДополнительныйРеквизит.Имя = "КодМагазина";
	ДополнительныйРеквизит.Представление = "Код маркетплейса";
	НовыеКолонкиСопоставления = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныйРеквизит);
	
	ДополнительныеПараметрыПоиска = Новый Структура;
	ДополнительныеПараметрыПоиска.Вставить("НатуральныеКлючи", "Артикул");
	ДополнительныеПараметрыПоиска.Вставить("Маркетплейс", Перечисления.ВидыМаркетплейсов.Wildberries);
	
	НастройкиСопоставления = Новый Структура;
	НастройкиСопоставления.Вставить("ВидимостьКолонокСопоставления", ВидимостьКолонокСопоставления);
	НастройкиСопоставления.Вставить("ДополнительныеРеквизитыСопоставления", НовыеКолонкиСопоставления);
	НастройкиСопоставления.Вставить("ДополнительныеПараметрыПоиска", ДополнительныеПараметрыПоиска);
	НастройкиСопоставления.Вставить("ОграничениеТипаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	НастройкиСопоставления.Вставить("ОтключитьПоискПоСловарю", Истина);
	НастройкиСопоставления.Вставить("ТочностьПоискаПоУмолчанию", 100);
	
	Возврат НастройкиСопоставления;
	
КонецФункции

Функция ПодготовитьОтложенноеСопоставлениеНоменклатуры(Контрагент, НезаполненнаяНоменклатура) Экспорт
	
	НесопоставленнаяНоменклатура = Новый Массив;
	
	Для Каждого СтрокаКСопоставлению Из НезаполненнаяНоменклатура Цикл
		СтрокаТовара = СтрокаКСопоставлению.СтрокаТовара;
		
		НоменклатураКонтрагента = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента(Контрагент);
		ЗаполнитьЗначенияСвойств(НоменклатураКонтрагента, СтрокаТовара);
		НоменклатураКонтрагента.Идентификатор             = СтрокаТовара.ИД;
		НоменклатураКонтрагента.ИдентификаторНоменклатуры = СтрокаТовара.ИД;
		НоменклатураКонтрагента.ШтрихкодКомбинации        = СтрокаТовара.Штрихкод;
		НоменклатураКонтрагента.ШтрихкодыНоменклатуры     = СтрокаТовара.Штрихкод;
		Если ЗначениеЗаполнено(СтрокаТовара.НатуральныйИД) Тогда
			НоменклатураКонтрагента.ИсторияИдентификаторов.Добавить(СтрокаТовара.НатуральныйИД);
		КонецЕсли;
		НоменклатураКонтрагента.Вставить("ИмяТабличнойЧасти", СтрокаКСопоставлению.ИмяТабличнойЧасти);
		НоменклатураКонтрагента.Вставить("ИндексТабличнойЧасти", СтрокаКСопоставлению.ИндексТабличнойЧасти);
		НесопоставленнаяНоменклатура.Добавить(НоменклатураКонтрагента);
		
	КонецЦикла;
	
	Возврат НесопоставленнаяНоменклатура;
	
КонецФункции

#КонецОбласти

#Область РаботаСЗапросами

Функция НовыйНастройкиПодключения()
	НастройкиПодключения = Новый Структура("АдресСервера, Токен");
	Возврат НастройкиПодключения;
КонецФункции

Функция АдресСервераФинансыWildberries() 
	Возврат "finance-api.wildberries.ru";
КонецФункции

Функция АдресСервераМаркетплейсWilberries()
	Возврат "marketplace-api.wildberries.ru";
КонецФункции

Функция АдресСервераДокументыWildberries()
	Возврат "documents-api.wildberries.ru";
КонецФункции

Функция АдресСервераКонтентWildberries()
	Возврат "content-api.wildberries.ru";
КонецФункции

Функция ВыполнитьPOSTЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения, КодУспех = 200, ПолучитьДанные = Истина)
	Возврат ВыполнитьHTTPЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения,  "POST", КодУспех, ПолучитьДанные);
КонецФункции

Функция ВыполнитьPUTЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения, КодУспех = 204, ПолучитьДанные = Ложь)
	Возврат ВыполнитьHTTPЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения,  "PUT", КодУспех, ПолучитьДанные);
КонецФункции

Функция ВыполнитьGETЗапрос(АдресРесурса, НастройкиПодключения, КодУспех = 200, ПолучитьДанные = Истина)
	Возврат ВыполнитьHTTPЗапрос(АдресРесурса, Неопределено, НастройкиПодключения,  "GET", КодУспех, ПолучитьДанные);
КонецФункции

Функция ВыполнитьHTTPЗапрос(АдресРесурса, ПараметрыЗапроса, НастройкиПодключения, МетодЗапроса, КодУспех, ПолучитьДанные)
	
	ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTPS");
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(, Новый СертификатыУдостоверяющихЦентровОС);
	HTTPСоединение = Новый HTTPСоединение(
		НастройкиПодключения.АдресСервера,
		, , ,
		ИнтернетПрокси,
		,
		ЗащищенноеСоединение);
	
	ЗаголовкиHTTPЗапроса = Новый Соответствие();
	ЗаголовкиHTTPЗапроса.Вставить("Content-Type", "application/json;charset=UTF-8");
	ЗаголовкиHTTPЗапроса.Вставить("Authorization", НастройкиПодключения.Токен);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовкиHTTPЗапроса);
	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		ТелоHTTPЗапроса = ОбменСМаркетплейс.ВJSON(ПараметрыЗапроса);
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоHTTPЗапроса, "UTF-8");
	КонецЕсли;
	Попытка	
		HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод(МетодЗапроса, HTTPЗапрос);
	Исключение
		СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
		ВызватьИсключение;
	КонецПопытки;
	//Логирование
	Если НастройкиПодключения.Свойство("Логирование") Тогда
		Логирование = НастройкиПодключения.Логирование;
		Если HTTPСоединение  = Неопределено Тогда
			Логирование.АдресСервера 	= НастройкиПодключения.АдресСервера;
		Иначе
			Логирование.АдресСервера 	= HTTPСоединение.Сервер +":"+HTTPСоединение.Порт;
			Логирование.Соединение 		= Истина;
			Логирование.Метод 			= МетодЗапроса;
			Логирование.Запрос 			= HTTPЗапрос;
			Логирование.Ответ 			= HTTPОтвет;
		КонецЕсли;
		РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЗаписатьВЖурнал(Логирование);
	КонецЕсли;
	//Конец Логирование
	КодСостояния = HTTPОтвет.КодСостояния;
	
	РезультатЗапроса = Новый Структура;
	РезультатЗапроса.Вставить("Результат",           КодСостояния = КодУспех);
	РезультатЗапроса.Вставить("ВыполнятьСЗадержкой", КодСостояния = 429);
	РезультатЗапроса.Вставить("СообщениеОбОшибке");
	РезультатЗапроса.Вставить("Данные");
	
	СообщениеОбОшибке = "";
	Если НЕ РезультатЗапроса.Результат Тогда
		СообщениеОбОшибке = СообщениеОбОшибкеПоКоду(HTTPОтвет);
	ИначеЕсли ПолучитьДанные Тогда
		Попытка
			ДанныеОтвета = ОбменСМаркетплейс.ПолучитьДанныеОтвета(HTTPОтвет);
			РезультатЗапроса.Вставить("Данные", ДанныеОтвета);
		Исключение
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка разбора данных, полученных от маркетплейса. Причина: %1'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
	КонецЕсли;
	
	Если КодСостояния = 500 ИЛИ КодСостояния = 401 ИЛИ КодСостояния = 403 Тогда
		РезультатЗапроса.СообщениеОбОшибке = СообщениеОбОшибке;
	КонецЕсли;
	
	Возврат РезультатЗапроса;
КонецФункции 

Функция СообщениеОбОшибкеПоКоду(HTTPОтвет)
	КодСостояния = HTTPОтвет.КодСостояния;
	Если КодСостояния = 500 Тогда
		СообщенияОбОшибках = НСтр("ru = 'Внутренняя ошибка на сервере Wildberries. Попробуйте позже'");
	ИначеЕсли КодСостояния = 401 Тогда
		СообщенияОбОшибках = НСтр("ru = 'Ошибка авторизации в API Wildberries. Проверьте тип и срок действия токена.
			|Получить новый токен API можно в личном кабинете: Профиль-Настройки-Доступ к API'");
	ИначеЕсли КодСостояния = 403 Тогда
		СообщенияОбОшибках = НСтр("ru = 'Ошибка авторизации в API Wildberries. Проверьте в настройках ключ API'");
	ИначеЕсли КодСостояния = 429 Тогда
		СообщенияОбОшибках = НСтр("ru = 'Сервер API Wildberries ответил: слишком много запросов. Попробуйте позже'");
	Иначе
		ПереченьОшибок = HTTPОтвет.ПолучитьТелоКакСтроку();
		СообщенияОбОшибках = СтрШаблон(НСтр("ru = 'Ошибка получения данных из маркетплейса. Ответ сервера: %1'"), ПереченьОшибок);
	КонецЕсли;

	Возврат СообщенияОбОшибках;
КонецФункции

Функция СообщениеОбОшибкеАвторизации(HTTPОтвет)
	
	СообщениеОбОшибке = "";
	
	ПараметрыОшибки = ОбменСМаркетплейс.ИзJSON(HTTPОтвет.ПолучитьТелоКакСтроку());
	Если СтрНайти(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОшибки, "detail"), "token scope not allowed") > 0 Тогда
		СообщениеОбОшибке = НСтр("ru = 'Ошибка авторизации в API Wildberries.
			|Возможно, ваш токен API не предоставляет доступа к категориям: ""Финансы, Документы"".
			|Получите токен API с типами ""Финансы, Документы"" в личном кабинете Профиль-Настройки-Доступ к API'");
	Иначе
		СообщениеОбОшибке = НСтр("ru = 'Ошибка авторизации в API Wildberries.
			|Возможно, ваш токен API устарел: срок действия токена - 180 дней от даты создания.
			|Получите токен API с типами ""Финансы, Документы"" в личном кабинете Профиль-Настройки-Доступ к API'");
	КонецЕсли;
	
	ЗаголовокОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОшибки, "title", "");
	ДеталиОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОшибки, "detail", "");
	ОшибкаОбмена = СообщениеОбОшибке + Символы.ПС + ЗаголовокОшибки + Символы.ПС + ДеталиОшибки;
	
	ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(ОшибкаОбмена, Перечисления.ВидыМаркетплейсов.Wildberries);
	
	Возврат СообщениеОбОшибке;
	
КонецФункции

Функция СообщениеОНедоступностиСервера()
	
	СообщениеОбОшибке =  НСтр("ru = 'Сервер API Wildberries недоступен. Попробуйте позже'");
	
	ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
	
	Возврат СообщениеОбОшибке;
	
КонецФункции

Функция СообщениеОПрочейОшибке(HTTPОтвет, ПерваяСтрока)
	
	ПереченьОшибок = HTTPОтвет.ПолучитьТелоКакСтроку();
	СообщениеОбОшибке = СтрШаблон(
		НСтр("ru = '%1.
			|Получен ответ %2. 
			|Попробуйте загрузить документ позже.'"), ПерваяСтрока, ПереченьОшибок);
	
	ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
	
	Возврат СообщениеОбОшибке;
	
КонецФункции

Функция ДанныеОтвета(HTTPОтвет, ПерваяСтрока, СообщениеОбОшибке)
	
	ЕстьОшибкаПреобразования = Ложь;
	
	Попытка
		РезультатЧтения = ОбменСМаркетплейс.ПолучитьДанныеОтвета(HTTPОтвет);
	Исключение
		ЕстьОшибкаПреобразования = Истина;
		
		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		Если ЗначениеЗаполнено(ТекстОтвета) Тогда
			СообщениеОбОшибке = ПерваяСтрока
				+ Символы.ПС + ТекстОтвета;
		Иначе
			СообщениеОбОшибке = ПерваяСтрока
				+ Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецЕсли;
		
		ОбменСМаркетплейс.ЗарегистрироватьОшибкуОбмена(СообщениеОбОшибке, Перечисления.ВидыМаркетплейсов.Wildberries);
	КонецПопытки;
	
	Возврат ?(ЕстьОшибкаПреобразования, Неопределено, РезультатЧтения);
	
КонецФункции

#КонецОбласти

#Область Логирование

Функция Логирование(НастройкаИнтеграции)
	
	Если РегистрыСведений.ЖурналОбменаСМаркетплейсами.ЛогированиеВключено() Тогда
		Возврат РегистрыСведений.ЖурналОбменаСМаркетплейсами.ПараметрыЛогирования(НастройкаИнтеграции);
	КонецЕсли;
	
КонецФункции

#КонецОбласти