Процедура ОбработатьСобытия() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_События.Ссылка КАК Ссылка,
	               |	CW_События.Описание КАК Описание 
	               |ИЗ
	               |	Справочник.CW_События КАК CW_События";    
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ФорматированныйДокумент = Новый ФорматированныйДокумент; 
		ФорматированныйДокумент.УстановитьHTML(Выборка.Описание, Новый Структура);
		
		СобытиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СобытиеОбъект.ХранилищеСообщения = Новый ХранилищеЗначения(ФорматированныйДокумент);
		
		Попытка
			СобытиеОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры


// Процедура - Создать событие
//
// Параметры:
//  ПараметрыСобытия			 - 	см. функацию ПоучитьСтруктуруСобытия() 
//  РежимЗагрузка				 - 	запись в режжиме "ОбменДанными.Загурзка" 
//  ПривелигированныйРежимЗаписи - 	устанвока дополнительного свойства 
//
Процедура СоздатьСобытие(ПараметрыСобытия, РежимЗагрузка = Ложь, ПривелигированныйРежимЗаписи = Неопределено) Экспорт
	
	НовоеСобытие = Справочники.CW_События.СоздатьЭлемент();   
	НовоеСобытие.УстановитьНовыйКод();
	НовоеСобытие.ДатаСобытия 		= ПараметрыСобытия.ДатаСобытия;
	НовоеСобытие.ТипСобытия 		= ПараметрыСобытия.ТипСобытия;
	НовоеСобытие.Владелец 			= ПараметрыСобытия.Владелец;
	НовоеСобытие.КонтактноеЛицо 	= ПараметрыСобытия.КонтактноеЛицо;
	НовоеСобытие.Грузоперевозка 	= ПараметрыСобытия.Грузоперевозка; 
	НовоеСобытие.Заказ 				= ПараметрыСобытия.Заказ; 
	НовоеСобытие.ОбъектСобытия 		= ПараметрыСобытия.ОбъектСобытия;
	НовоеСобытие.Ответственный 		= ПараметрыСобытия.Ответственный; 
	
	НовоеСобытие.ХранилищеСообщения = Новый ХранилищеЗначения(ПараметрыСобытия.Сообщение);
	
	Если ПривелигированныйРежимЗаписи <> Неопределено Тогда
		НовоеСобытие.ДополнительныеСвойства.Вставить("ПривелигированныйРежимЗаписи", ПривелигированныйРежимЗаписи);
	КонецЕсли;

	НовоеСобытие.ОбменДанными.Загрузка = РежимЗагрузка;  
	Попытка
		НовоеСобытие.Записать();
	Исключение
		ТекстОшибки = ОписаниеОшибки();	
	КонецПопытки;
		
КонецПроцедуры   

Функция ПоучитьСтруктуруСобытия() Экспорт
	
	СтруктуруСобытия = Новый Структура;
	СтруктуруСобытия.Вставить("ДатаСобытия",	ТекущаяДата());
	СтруктуруСобытия.Вставить("ТипСобытия",		Неопределено);
	СтруктуруСобытия.Вставить("Владелец",		Неопределено);
	СтруктуруСобытия.Вставить("КонтактноеЛицо",	Неопределено); 
	СтруктуруСобытия.Вставить("Грузоперевозка",	Неопределено); 
	СтруктуруСобытия.Вставить("Заказ",  		Неопределено); 
	СтруктуруСобытия.Вставить("ОбъектСобытия",  Неопределено); 
	СтруктуруСобытия.Вставить("Ответственный", 	ПараметрыСеанса.ТекущийПользователь);  
	СтруктуруСобытия.Вставить("Сообщение",	 	Новый ФорматированныйДокумент);
	
	Возврат СтруктуруСобытия;
	
КонецФункции