#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДатаСобытия = Дата(1,1,1) Тогда
		ДатаСобытия = ТекущаяДата();        
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли

Процедура ПередЗаписью(Отказ)
	
	// сохраним текстовую часть форматированного документа в описании
	ФорматированныйДокумент = ХранилищеСообщения.Получить();
	Описание = ФорматированныйДокумент.ПолучитьТекст();
	
КонецПроцедуры
