
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды", ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", ПараметрыВыполненияКоманды); 
	
	ТекстВопроса = "Установить оборудование на слежение?";
	Если ПараметрКоманды.Количество() > 1 Тогда
		ТекстВопроса = "Установить выбранное оборудование на слежение?";
	КонецЕсли;

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПередВыборомПараметровСлежения", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);

КонецПроцедуры   

&НаКлиенте
Процедура ПередВыборомПараметровСлежения(Результат, ДополнительныеПараметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;                     

	ПараметрыФормы = Новый Структура;    
	
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды; 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияПараметровСлежения", ЭтотОбъект, ДополнительныеПараметры);
	
   	ОткрытьФорму("Справочник.CW_Оборудование.Форма.ПостановкаОборудованияНаСлежение", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияПараметровСлежения(ПараметрыСлежения, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыСлежения = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды; 
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды; 
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Оборудование", 		ПараметрКоманды);
	ПараметрыПроцедуры.Вставить("ПараметрыСлежения",	ПараметрыСлежения);
	
	РезультатВыполнения =  ПродолжитьПостановкуНаСлежениеНаСервереВФоне(ПараметрыПроцедуры); 
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ПараметрыВыполненияКоманды.Источник);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;     
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПриЗавершенииПостановкиОборудованияНаСлежение", ЭтотОбъект, ДополнительныеПараметры); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры

&НаСервере 
Функция ПродолжитьПостановкуНаСлежениеНаСервереВФоне(ПараметрыПроцедуры)  
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение  = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне   = ложь;   

	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.CW_Оборудование.ПоставитьОборудованиеНаСлеждение", ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции 

&НаКлиенте 
Процедура ПриЗавершенииПостановкиОборудованияНаСлежение(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда   
		
		МассивОтслеживаемогоОборудования = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата); 
		
		Дополнительныепараметры.Вставить("Массив", МассивОтслеживаемогоОборудования);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыполненияПоставновкиНаСлежение", ЭтотОбъект, Дополнительныепараметры); 
	
        ПоказатьОповещениеПользователя("Постановка оборудования на слежение", ОписаниеОповещения, "Оборудование на слежении",,,Строка(Новый УникальныйИдентификатор));
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Информация об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка установки начала слежения");  
		
	КонецЕсли;  
	
КонецПроцедуры  

&НаКлиенте 
Процедура ПослеВыполненияПоставновкиНаСлежение(Дополнительныепараметры) Экспорт   
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", Дополнительныепараметры.Массив); 
	
	СтрукутраПараметров = Новый Структура;
	СтрукутраПараметров.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("Справочник.CW_ОтслеживаемоеОборудование.ФормаСписка", СтрукутраПараметров, Дополнительныепараметры.ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры

