
Процедура ЗаписатьСтатусОбработки(ЭлектронноеПисьмо, СтатусОбработки) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.CW_СтатусОбработкиЭлектронныхПисем.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.ЭлектронноеПисьмо = ЭлектронноеПисьмо;
	ЗаписьРегистра.СтатусОбработки = СтатусОбработки;
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьСтатусОбработки(ЭлектронноеПисьмо) Экспорт
	
	Если Не ЗначениеЗаполнено(ЭлектронноеПисьмо) Тогда
		Возврат ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработкиПочтовыхСообщений.Ожидание");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_СтатусОбработкиЭлектронныхПисем.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо,
	               |	CW_СтатусОбработкиЭлектронныхПисем.СтатусОбработки КАК СтатусОбработки
	               |ИЗ
	               |	РегистрСведений.CW_СтатусОбработкиЭлектронныхПисем КАК CW_СтатусОбработкиЭлектронныхПисем
	               |ГДЕ
	               |	CW_СтатусОбработкиЭлектронныхПисем.ЭлектронноеПисьмо = &ЭлектронноеПисьмо";
	
	Запрос.УстановитьПараметр("ЭлектронноеПисьмо", ЭлектронноеПисьмо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатусОбработки;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Перечисление.CW_СтатусыОбработкиПочтовыхСообщений.Ожидание");
	
КонецФункции