// Содержимое модуля отличается в версиях ПРОФ и КОРП.
// В версии ПРОФ отсутствует:
// - тело экспортных процедур (остаются только сигнатуры методов)
// - неэкспортные процедуры и все функции.
// Поэтому не допускается реализация в модуле экспортных функций: вместо них следует использовать процедуры с возвращаемым параметром.

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьКлассификаторыПоАкцизам(Организация, ВидТовара, Импорт) Экспорт
	Справочники.ВидыНоменклатуры.НайтиСоздатьПодакцизныйВидНоменклатуры(Организация, ВидТовара, Импорт);
	НайтиСоздатьКодыПодакцизныхТоваров(ВидТовара);
	НайтиСоздатьЕдиницыИзмерения(ВидТовара);
КонецПроцедуры

Процедура СписокПроизводимыхПодакцизныхТоваров(Организация, СписокПроизводимыхТоваров) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара
	|ИЗ
	|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
	|ГДЕ
	|	ПорядокУплатыАкцизов.Организация = &Организация
	|	И ПорядокУплатыАкцизов.Производство = ИСТИНА";
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокПроизводимыхТоваров.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("ВидТовара"));
	
КонецПроцедуры

Процедура СписокИмпортируемыхПодакцизныхТоваров(Организация, СписокИмпортируемыхТоваров) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара
	|ИЗ
	|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
	|ГДЕ
	|	ПорядокУплатыАкцизов.Организация = &Организация
	|	И ПорядокУплатыАкцизов.Импорт = ИСТИНА";
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокИмпортируемыхТоваров.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("ВидТовара"));
	
КонецПроцедуры

Процедура ПолучитьСтавкуАкциза(ВидПодакцизногоТовара, Дата, ДанныеПоСтавкеАкциза) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиАкцизаСрезПоследних.Сумма КАК Сумма,
	|	СтавкиАкцизаСрезПоследних.ОкруглятьДоЦелого КАК ОкруглятьДоЦелого
	|ИЗ
	|	РегистрСведений.СтавкиАкцизаПоставляемый.СрезПоследних(&Дата, КодВидаПодакцизногоТовара = &КодВидаПодакцизногоТовара) КАК СтавкиАкцизаСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Если Не ЗначениеЗаполнено(ВидПодакцизногоТовара) Тогда
		Возврат;
	КонецЕсли;
	КодВидаПодакцизногоТовара = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПодакцизногоТовара, "Код");
	Запрос.УстановитьПараметр("КодВидаПодакцизногоТовара", КодВидаПодакцизногоТовара);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ДанныеПоСтавкеАкциза.Ставка            = Результат.Сумма;
		ДанныеПоСтавкеАкциза.ОкруглятьДоЦелого = Результат.ОкруглятьДоЦелого;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияНачисленияАкцизов(ТаблицаАкцизов, Реквизиты, Движения) Экспорт
	Если НЕ ЗначениеЗаполнено(ТаблицаАкцизов) Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат;
	КонецЕсли;
	СтрокаРеквизитов = Реквизиты[0];
	ПоляСвертки = "СчетАкциза, Субконто";
	ВедетсяУчетПоПодразделениям = БухгалтерскийУчетПереопределяемый.ВестиУчетПоПодразделениям();
	ТаблицаДляПроводок = ТаблицаАкцизов.Скопировать();
	
	Если ТаблицаАкцизов.Колонки.Найти("СубконтоАкцизы") <> Неопределено Тогда
		ПоляСвертки = ПоляСвертки + ", СубконтоАкцизы";
	КонецЕсли;
	Если ТаблицаАкцизов.Колонки.Найти("КодВидаПодакцизногоТовара") <> Неопределено Тогда
		ПоляСвертки = ПоляСвертки + ", КодВидаПодакцизногоТовара";
	КонецЕсли;
	ТаблицаДляПроводок.Свернуть(ПоляСвертки, "СуммаАкциза");
	
	Для Каждого Строка Из ТаблицаДляПроводок Цикл
		
		Проводка = Движения.Хозрасчетный.Добавить();
		Проводка.Период = СтрокаРеквизитов.Период;
		Проводка.Организация =  СтрокаРеквизитов.Организация;
		Проводка.Содержание  = "Начисление акциза";
		Проводка.СчетДт = Строка.СчетАкциза;
		СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Строка.СчетАкциза);
		Если СвойстваСчета.УчетПоПодразделениям Тогда
			Проводка.ПодразделениеДт = СтрокаРеквизитов.ПодразделениеОрганизации;
		КонецЕсли;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", Строка.Субконто);
		Проводка.СчетКт = ПланыСчетов.Хозрасчетный.Акцизы;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ВидыПлатежейВГосБюджет", Перечисления.ВидыПлатежейВГосБюджет.Налог);
		Если ВедетсяУчетПоПодразделениям Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "РегистрацияВНалоговомОргане", Строка.СубконтоАкцизы);
		КонецЕсли;
		Проводка.Сумма = Строка.СуммаАкциза;
		
	КонецЦикла;
	
	Движения.Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьДвиженияСторноАкцизов(ТаблицаАкцизов, Реквизиты, Движения) Экспорт
	Если НЕ ЗначениеЗаполнено(ТаблицаАкцизов) Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат;
	КонецЕсли;
	СтрокаРеквизитов = Реквизиты[0];
	Корректировка = ТипЗнч(СтрокаРеквизитов.Регистратор) = Тип("ДокументСсылка.КорректировкаРеализации");
	Если Корректировка Тогда
		КорректировкаПоСогласованиюСторон = СтрокаРеквизитов.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	Иначе
		КорректировкаПоСогласованиюСторон = Истина;
	КонецЕсли;
	Если КорректировкаПоСогласованиюСторон Тогда
		КорСчет = ПланыСчетов.Хозрасчетный.АкцизыПоОплаченнымМатериальнымЦенностям;
	Иначе
		КорСчет = ПланыСчетов.Хозрасчетный.Акцизы;
	КонецЕсли;
	ВедетсяУчетПоПодразделениям = БухгалтерскийУчетПереопределяемый.ВестиУчетПоПодразделениям();
	ПоляСвертки = "СчетАкциза, Субконто";
	ТаблицаДляСторно = ТаблицаАкцизов.Скопировать();
	Если ТаблицаДляСторно.Колонки.Найти("СубконтоАкцизы") <> Неопределено Тогда
		ПоляСвертки = ПоляСвертки + ", СубконтоАкцизы";
	КонецЕсли;
	Если ТаблицаДляСторно.Колонки.Найти("КодВидаПодакцизногоТовара") <> Неопределено Тогда
		ПоляСвертки = ПоляСвертки + ", КодВидаПодакцизногоТовара";
	КонецЕсли;
	ТаблицаДляСторно.Свернуть(ПоляСвертки, "СуммаАкциза");
	
	Для Каждого Строка Из ТаблицаДляСторно Цикл
		
		Проводка = Движения.Хозрасчетный.Добавить();
		Проводка.Период = СтрокаРеквизитов.Период;
		Проводка.Организация =  СтрокаРеквизитов.Организация;
		Проводка.Содержание  = "Сторно акциза";
		Проводка.СчетДт = Строка.СчетАкциза;
		СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Строка.СчетАкциза);
		Если СвойстваСчета.УчетПоПодразделениям Тогда
			Проводка.ПодразделениеДт = СтрокаРеквизитов.ПодразделениеОрганизации;
		КонецЕсли;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НоменклатурныеГруппы", Строка.Субконто);
		Проводка.СчетКт = КорСчет;
		Если Не КорректировкаПоСогласованиюСторон Тогда
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ВидыПлатежейВГосБюджет", Перечисления.ВидыПлатежейВГосБюджет.Налог);
			Если ВедетсяУчетПоПодразделениям Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "РегистрацияВНалоговомОргане", Строка.СубконтоАкцизы);
			КонецЕсли;
		КонецЕсли;
		Проводка.Сумма = Строка.СуммаАкциза;
		
	КонецЦикла;
	
	Движения.Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьДвиженияНачисленияАкцизовПриИмпорте(ТаблицаАкцизов, Реквизиты, Движения) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицаАкцизов) Или Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРеквизитов              = Реквизиты[0];
	ПартионныйУчет                = УчетнаяПолитика.СпособОценкиМПЗ(СтрокаРеквизитов.Организация, СтрокаРеквизитов.Период) = Перечисления.СпособыОценки.ФИФО;
	ЕстьПодразделениеВТаблице     = ТаблицаАкцизов.Колонки.Найти("Подразделение") <> Неопределено;
	ЕстьПодразделениеВШапке       = Реквизиты.Колонки.Найти("ПодразделениеОрганизации") <> Неопределено;
	ТаблицаАкцизовПоУплатеТаможне = ТаблицаАкцизов.Скопировать();
	ТаблицаАкцизовПоУплатеТаможне.Свернуть("Подразделение, СчетАкциза", "СуммаАкциза"); 
	ВедетсяУчетПоПодразделениям = БухгалтерскийУчетПереопределяемый.ВестиУчетПоПодразделениям();
	
	Для Каждого СтрокаТаблицы Из ТаблицаАкцизовПоУплатеТаможне Цикл
		
		Подразделение 	= Неопределено;
		Если ЕстьПодразделениеВТаблице Тогда
			Подразделение = СтрокаТаблицы.Подразделение;
		ИначеЕсли ЕстьПодразделениеВШапке Тогда
			Подразделение = СтрокаРеквизитов.Подразделение;
		КонецЕсли;
		
		// Дт 19.06 Кт 60.х
		Проводка = Движения.Хозрасчетный.Добавить();
		Проводка.Период      = СтрокаРеквизитов.Период;
		Проводка.Организация = СтрокаРеквизитов.Организация;
		Проводка.Содержание  = "Уплата акциза на таможне";
		
		Проводка.СчетДт      = СтрокаТаблицы.СчетАкциза;
		Проводка.СчетКт      = СтрокаРеквизитов.СчетУчетаРасчетовСКонтрагентом;
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт,
			1, СтрокаРеквизитов.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт,
			2, СтрокаРеквизитов.ДоговорКонтрагента);
		БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт,
			3, СтрокаРеквизитов.Регистратор);
		
		СвойстваСчетаКт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
		
		Если СвойстваСчетаКт.УчетПоПодразделениям Тогда
			Проводка.ПодразделениеКт = Подразделение;
		КонецЕсли;
		Проводка.Сумма = СтрокаТаблицы.СуммаАкциза;
		
	КонецЦикла;
	
	СформироватьДвиженияВключениеАкцизаВСтоимость(Движения, ЕстьПодразделениеВТаблице, ЕстьПодразделениеВШапке, ПартионныйУчет, СтрокаРеквизитов, ТаблицаАкцизов);
	
	Движения.Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьКодВидаПодакцизногоТовараПоУмолчанию(ВидТовара, КодВидаПодакцизногоТовара) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КодыВидовПодакцизныхТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КодыВидовПодакцизныхТоваров КАК КодыВидовПодакцизныхТоваров
	|ГДЕ
	|	КодыВидовПодакцизныхТоваров.ВидТовара = &ВидТовара
	|	И КодыВидовПодакцизныхТоваров.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА КодыВидовПодакцизныхТоваров.ДействуетС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КодыВидовПодакцизныхТоваров.ДействуетС >= &Дата
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА КодыВидовПодакцизныхТоваров.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КОНЕЦПЕРИОДА(КодыВидовПодакцизныхТоваров.ДействуетПо, ДЕНЬ) <= &Дата
	|		КОНЕЦ";

	Запрос.УстановитьПараметр("ВидТовара", ВидТовара);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 1 Тогда
		КодВидаПодакцизногоТовара = Результат[0].Ссылка;
	Иначе
		КодВидаПодакцизногоТовара = Неопределено;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаДействияАкцизаПоСпискуНоменклатуры(СписокНоменклатуры, Дата, ЗначенияРеквизитов) Экспорт
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	Если СписокНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|			КОГДА КодыВидовПодакцизныхТоваров.ДействуетС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КодыВидовПодакцизныхТоваров.ДействуетС <= &Дата
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА КодыВидовПодакцизныхТоваров.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КОНЕЦПЕРИОДА(КодыВидовПодакцизныхТоваров.ДействуетПо, ДЕНЬ) >= &Дата
	|		КОНЕЦ КАК АкцизСчитаетсяНаДату,
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|					КОГДА КодыВидовПодакцизныхТоваров.ДействуетС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ КодыВидовПодакцизныхТоваров.ДействуетС <= &Дата
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА КодыВидовПодакцизныхТоваров.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ КОНЕЦПЕРИОДА(КодыВидовПодакцизныхТоваров.ДействуетПо, ДЕНЬ) >= &Дата
	|				КОНЕЦ
	|			ТОГДА Номенклатура.КодВидаПодакцизногоТовара
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КодВидаПодакцизногоТовара
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыВидовПодакцизныхТоваров КАК КодыВидовПодакцизныхТоваров
	|		ПО Номенклатура.КодВидаПодакцизногоТовара = КодыВидовПодакцизныхТоваров.Ссылка
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокНоменклатуры)";
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	Запрос.УстановитьПараметр("Дата",                Дата);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Результат = Новый Структура("КодВидаПодакцизногоТовара, АкцизСчитаетсяНаДату");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		ЗначенияРеквизитов[Выборка.Номенклатура] = Результат;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоАкцизам(ТаблицаТовары, Организация, Дата, ПараметрыДляЗаполнения) Экспорт
	
	Если ТаблицаТовары = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара
	|ПОМЕСТИТЬ СписокУчитываемыхПодакцизныхТоваров
	|ИЗ
	|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
	|ГДЕ
	|	ПорядокУплатыАкцизов.Организация = &Организация
	|	И ПорядокУплатыАкцизов.Производство = &Производство
	|	И ПорядокУплатыАкцизов.Импорт = &Импорт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.КодВидаПодакцизногоТовара КАК КодВидаПодакцизногоТовара,
	|	Номенклатура.КоэффициентПересчета КАК КоэффициентПересчета,
	|	КодыВидовПодакцизныхТоваров.ВидТовара КАК ВидТовара,
	|	Номенклатура.ЕдиницаИзмеренияДляРасчетаАкциза КАК ЕдиницаИзмеренияДляРасчетаАкциза,
	|	ЛОЖЬ КАК МаркируемаяПродукция
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыВидовПодакцизныхТоваров КАК КодыВидовПодакцизныхТоваров
	|		ПО Номенклатура.КодВидаПодакцизногоТовара = КодыВидовПодакцизныхТоваров.Ссылка
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокНоменклатуры)
	|	И ВЫБОР
	|			КОГДА КодыВидовПодакцизныхТоваров.ДействуетС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КодыВидовПодакцизныхТоваров.ДействуетС <= &Дата
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА КодыВидовПодакцизныхТоваров.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КОНЕЦПЕРИОДА(КодыВидовПодакцизныхТоваров.ДействуетПо, ДЕНЬ) >= &Дата
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокУчитываемыхПодакцизныхТоваров.ВидТовара КАК ВидТовара,
	|	СписокНоменклатуры.Ссылка КАК Ссылка,
	|	СписокНоменклатуры.КодВидаПодакцизногоТовара КАК КодВидаПодакцизногоТовара,
	|	СписокНоменклатуры.КоэффициентПересчета КАК КоэффициентПересчета,
	|	СписокНоменклатуры.ЕдиницаИзмеренияДляРасчетаАкциза КАК ЕдиницаИзмеренияДляРасчетаАкциза,
	|	СписокНоменклатуры.МаркируемаяПродукция КАК МаркируемаяПродукция
	|ПОМЕСТИТЬ СписокНоменклатурыУчитываемойВТекОрганизации
	|ИЗ
	|	СписокУчитываемыхПодакцизныхТоваров КАК СписокУчитываемыхПодакцизныхТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписокНоменклатуры КАК СписокНоменклатуры
	|		ПО СписокУчитываемыхПодакцизныхТоваров.ВидТовара = СписокНоменклатуры.ВидТовара
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокНоменклатурыУчитываемойВТекОрганизации.Ссылка КАК Номенклатура,
	|	СписокНоменклатурыУчитываемойВТекОрганизации.КодВидаПодакцизногоТовара КАК КодВидаПодакцизногоТовара,
	|	СписокНоменклатурыУчитываемойВТекОрганизации.КоэффициентПересчета КАК КоэффициентПересчета,
	|	СписокНоменклатурыУчитываемойВТекОрганизации.ВидТовара КАК ВидТовара,
	|	ЕСТЬNULL(СтавкиАкцизаСрезПоследних.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(СтавкиАкцизаСрезПоследних.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(СтавкиАкцизаСрезПоследних.ОкруглятьДоЦелого, ЛОЖЬ) КАК ОкруглятьДоЦелого,
	|	СписокНоменклатурыУчитываемойВТекОрганизации.ЕдиницаИзмеренияДляРасчетаАкциза.Код КАК ЕдиницаИзмеренияАкциза,
	|	СписокНоменклатурыУчитываемойВТекОрганизации.МаркируемаяПродукция КАК МаркируемаяПродукция
	|ИЗ
	|	СписокНоменклатурыУчитываемойВТекОрганизации КАК СписокНоменклатурыУчитываемойВТекОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиАкцизаПоставляемый.СрезПоследних(&ДатаПолученияСтавки, ) КАК СтавкиАкцизаСрезПоследних
	|		ПО СписокНоменклатурыУчитываемойВТекОрганизации.КодВидаПодакцизногоТовара.Код = СтавкиАкцизаСрезПоследних.КодВидаПодакцизногоТовара";
	
	Запрос.УстановитьПараметр("Организация",            Организация);
	Запрос.УстановитьПараметр("Дата",                   Дата);
	Запрос.УстановитьПараметр("ДатаПолученияСтавки",    ?(ПараметрыДляЗаполнения.ДатаПолученияСтавки = '00010101', Дата, ПараметрыДляЗаполнения.ДатаПолученияСтавки));
	Запрос.УстановитьПараметр("СписокНоменклатуры",     ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаТовары, "Номенклатура", Истина));
	Запрос.УстановитьПараметр("Импорт",                 ПараметрыДляЗаполнения.Импорт);
	Запрос.УстановитьПараметр("Производство",           Не ПараметрыДляЗаполнения.Импорт);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ТаблицаТовары Цикл
		СтрокаПоАкцизу = Результат.Найти(Строка.Номенклатура, "Номенклатура");
		
		Если СтрокаПоАкцизу <> Неопределено Тогда
			
			СвойстваНоменклатурыИС = ОбщегоНазначенияИС.СвойстваМаркируемойПродукции(Строка.Номенклатура);
			МаркируемаяПродукция = СвойстваНоменклатурыИС.МаркируемаяПродукция;
			
			Строка.КоэффициентПересчета      = СтрокаПоАкцизу.КоэффициентПересчета;
			Строка.ЕдиницаИзмеренияАкциза    = СтрокаПоАкцизу.ЕдиницаИзмеренияАкциза;
			Строка.ПодакцизныйТовар          = Истина;
			
			Если ПараметрыДляЗаполнения.ЗаявлениеОВвозе Тогда
				Строка.ТвердаяСтавкаАкциза       = СтрокаПоАкцизу.Сумма;
				Строка.КодВидаПодакцизногоТовара = СтрокаПоАкцизу.КодВидаПодакцизногоТовара;
				Строка.КБК                       = Документы.ЗаявлениеОВвозеТоваров.КБКПоКодуВидаПодакцизногоТовара(СтрокаПоАкцизу.КодВидаПодакцизногоТовара);
				Строка.МаркируемаяПродукция      = МаркируемаяПродукция;
			Иначе
				Строка.СтавкаАкциза = СтрокаПоАкцизу.Сумма;
			КонецЕсли;
			
			Если СтрокаПоАкцизу.Сумма <> 0 Тогда
				Строка.ОкруглятьДоЦелого = СтрокаПоАкцизу.ОкруглятьДоЦелого;
				
				Если ПараметрыДляЗаполнения.ДОПП Тогда
					УчетАкцизовКлиентСервер.РассчитатьСуммуАкцизаВТабЧастиПоЗаявлениюОВвозе(Строка, Истина);
				ИначеЕсли ПараметрыДляЗаполнения.ЗаявлениеОВвозе Тогда
					УчетАкцизовКлиентСервер.РассчитатьСуммуАкцизаВТабЧастиПоЗаявлениюОВвозе(Строка);
				ИначеЕсли ПараметрыДляЗаполнения.Корректировка Тогда
					Если Строка.КоличествоДоИзменения = Строка.Количество Тогда
						Строка.СуммаАкциза = Строка.СуммаАкцизаДоИзменения;
					Иначе
						УчетАкцизовКлиентСервер.РассчитатьСуммуАкцизаВТабЧасти(Строка, ПараметрыДляЗаполнения.ЭкспортПриРеализации,
						ПараметрыДляЗаполнения.Импорт, ПараметрыДляЗаполнения.ЭтоПередачаТоваров);
					КонецЕсли;
				Иначе
					УчетАкцизовКлиентСервер.РассчитатьСуммуАкцизаВТабЧасти(Строка, ПараметрыДляЗаполнения.ЭкспортПриРеализации,
					ПараметрыДляЗаполнения.Импорт, ПараметрыДляЗаполнения.ЭтоПередачаТоваров);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			Строка.КоэффициентПересчета      = 0;
			Строка.ЕдиницаИзмеренияАкциза    = "";
			Строка.ОкруглятьДоЦелого         = 0;
			Строка.ПодакцизныйТовар          = Ложь;
			Строка.СуммаАкциза               = 0;
			
			Если ПараметрыДляЗаполнения.ЗаявлениеОВвозе Тогда
				Строка.ТвердаяСтавкаАкциза       = 0;
				Строка.КодВидаПодакцизногоТовара = Справочники.КодыВидовПодакцизныхТоваров.ПустаяСсылка();
				Строка.КБК                       = "";
				Строка.МаркируемаяПродукция      = Ложь;
			Иначе
				Строка.СтавкаАкциза          = 0;
			КонецЕсли;
			
			Если ПараметрыДляЗаполнения.Корректировка Тогда
				Строка.СуммаАкцизаДоИзменения     = 0;
				Строка.СуммаАкцизаДоКорректировки = 0;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПараметрыДляЗаполненияДанныхПоАкцизам(Параметры) Экспорт
	
	Параметры.Вставить("Импорт",               Ложь);
	Параметры.Вставить("ЭкспортПриРеализации", Ложь);
	Параметры.Вставить("Корректировка",        Ложь);
	Параметры.Вставить("ЗаявлениеОВвозе",      Ложь);
	Параметры.Вставить("ДОПП",                 Ложь);
	Параметры.Вставить("ЭтоПередачаТоваров",   Ложь);
	Параметры.Вставить("ДатаПолученияСтавки",  '00010101');
	
КонецПроцедуры

Процедура ПоказыватьНовостьПриОткрытии(Импорт, ПоказыватьНовость) Экспорт
	ЕстьУчетПодакцизныхТоваров = Ложь;
	Если Импорт Тогда
		ЕстьУчетПодакцизныхТоваров = ПолучитьФункциональнуюОпцию("ИмпортПодакцизныхТоваров");
	Иначе
		ЕстьУчетПодакцизныхТоваров = ПолучитьФункциональнуюОпцию("ПроизводствоПодакцизныхТоваров");
	КонецЕсли;
	
	Если НЕ ЕстьУчетПодакцизныхТоваров Тогда
		ПоказыватьНовость = ЕстьУчетПодакцизныхТоваров;
	Иначе
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.КодВидаПодакцизногоТовара <> ЗНАЧЕНИЕ(Справочник.КодыВидовПодакцизныхТоваров.ПустаяСсылка)";
		Результат = Запрос.Выполнить();
		ПоказыватьНовость = Результат.Пустой();
	КонецЕсли;
КонецПроцедуры

Процедура УстановкаСпособаПолученияТоваровПриОбновленииИБ() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокУплатыАкцизов.Организация КАК Организация,
	|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара,
	|	НастройкиСистемыНалогообложенияСрезПоследних.ПрименяетсяУСН КАК ПрименяетсяУСН
	|ИЗ
	|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(&Период, ) КАК НастройкиСистемыНалогообложенияСрезПоследних
	|		ПО ПорядокУплатыАкцизов.Организация = НастройкиСистемыНалогообложенияСрезПоследних.Организация
	|ГДЕ
	|	ПорядокУплатыАкцизов.Импорт = ЛОЖЬ
	|	И ПорядокУплатыАкцизов.Производство = ЛОЖЬ";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВедетсяУчетИмпортаТоваров = ПолучитьФункциональнуюОпцию("ВедетсяУчетИмпортаТоваров");
	ВедетсяПроизводство       = ПолучитьФункциональнуюОпцию("ИспользоватьВыпускПродукции");
	
	Если ВедетсяУчетИмпортаТоваров Тогда
		Константы.ИмпортПодакцизныхТоваров.Установить(Истина);
	КонецЕсли;
	Если ВедетсяПроизводство Тогда
		Константы.ПроизводствоПодакцизныхТоваров.Установить(Истина);
	КонецЕсли;
	
	Если ВедетсяУчетИмпортаТоваров Или ВедетсяПроизводство Тогда
		Для Каждого Строка Из Результат Цикл
			НаборЗаписейПорядокУплатыАкцизов = РегистрыСведений.ПорядокУплатыАкцизов.СоздатьНаборЗаписей();
			НаборЗаписейПорядокУплатыАкцизов.Отбор.Организация.Установить(Строка.Организация);
			НаборЗаписейПорядокУплатыАкцизов.Отбор.ВидТовара.Установить(Строка.ВидТовара);
			НаборЗаписейПорядокУплатыАкцизов.Прочитать();
			Если НаборЗаписейПорядокУплатыАкцизов.Количество() <> 0 Тогда
				Запись = НаборЗаписейПорядокУплатыАкцизов[0];
				Если ВедетсяУчетИмпортаТоваров И НЕ ВедетсяПроизводство Тогда
					Запись.Импорт = Истина;
				ИначеЕсли ВедетсяПроизводство И НЕ ВедетсяУчетИмпортаТоваров Тогда
					Запись.Производство = Истина;
				Иначе
					Если Строка.ПрименяетсяУСН Тогда
						Запись.Импорт = Истина;
					Иначе
						Запись.Производство = Истина;
					КонецЕсли;
				КонецЕсли;
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПорядокУплатыАкцизов, Истина);
				Справочники.ВидыНоменклатуры.НайтиСоздатьПодакцизныйВидНоменклатуры(Строка.Организация, Строка.ВидТовара, Запись.Импорт);
			КонецЕсли;
		КонецЦикла;
		Результат.Свернуть("ВидТовара");
		Для Каждого Строка Из Результат Цикл
			НайтиСоздатьКодыПодакцизныхТоваров(Строка.ВидТовара);
			НайтиСоздатьЕдиницыИзмерения(Строка.ВидТовара)
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ДозаполнитьСчетАкциза(ДокументОбъект) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ПроизводствоПодакцизныхТоваров") Тогда
		СчетАкцизов = ПланыСчетов.Хозрасчетный.Продажи_Акцизы;
		Для Каждого Строка Из ДокументОбъект.Товары Цикл
			Если Строка.ПодакцизныйТовар И Строка.СуммаАкциза <> 0 И Не ЗначениеЗаполнено(Строка.СчетАкциза) Тогда
				Строка.СчетАкциза = СчетАкцизов;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерезаполнитьДанныеПоАкцизамПриИзмененииОперации(Объект) Экспорт
	Если Не ЗначениеЗаполнено(Объект.ДокументРеализации) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = Объект.ДокументРеализации.Метаданные();
	ИмяВидаДокумента = МетаданныеДокумента.Имя;
	
	Если ИмяВидаДокумента <> "КорректировкаРеализации" И ИмяВидаДокумента <> "РеализацияТоваровУслуг" Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументРеализации", Объект.ДокументРеализации);
	ТекстЗапроса = "ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.СуммаАкциза КАК СуммаАкциза,
	|	РеализацияТоваровУслугТовары.СчетАкциза КАК СчетАкциза,
	|	РеализацияТоваровУслугТовары.СубконтоАкцизы КАК СубконтоАкцизы,
	|	РеализацияТоваровУслугТовары.ПодакцизныйТовар КАК ПодакцизныйТовар,
	|	&ПолеСуммаАкцизаДоИзменения
	|ИЗ
	|	Документ." + ИмяВидаДокумента + ".Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &ДокументРеализации";
	
	Если ИмяВидаДокумента = "КорректировкаРеализации" Тогда
		ПолеСуммаАкцизаДоИзменения = "РеализацияТоваровУслугТовары.СуммаАкцизаДоИзменения КАК СуммаАкцизаДоИзменения";
	Иначе
		ПолеСуммаАкцизаДоИзменения = "0 КАК СуммаАкцизаДоИзменения";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеСуммаАкцизаДоИзменения", ПолеСуммаАкцизаДоИзменения);
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Объект.Товары Цикл
		НайденнаяСтрока = РезультатЗапроса.Найти(Строка.ИдентификаторСтроки, "ИдентификаторСтроки");
		Если НайденнаяСтрока <> Неопределено Тогда
			Строка.ПодакцизныйТовар       = НайденнаяСтрока.ПодакцизныйТовар;
			Строка.СуммаАкцизаДоИзменения = НайденнаяСтрока.СуммаАкциза;
			Строка.СчетАкциза             = НайденнаяСтрока.СчетАкциза;
			Строка.СубконтоАкцизы         = НайденнаяСтрока.СубконтоАкцизы;
			Если ИмяВидаДокумента = "КорректировкаРеализации" Тогда
				Строка.СуммаАкцизаДоКорректировки = НайденнаяСтрока.СуммаАкцизаДоИзменения;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура ОбновитьСтавкиПоВидуТоваров(ВидТовара)
	
	ЕстьУчетАкцизов = ПолучитьФункциональнуюОпцию("ПроизводствоПодакцизныхТоваров")
	Или ПолучитьФункциональнуюОпцию("ИмпортПодакцизныхТоваров");
	Если Не ЕстьУчетАкцизов Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПорядокУплатыАкцизов.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
	|ГДЕ
	|	ПорядокУплатыАкцизов.ВидТовара = &ВидТовара";
	Запрос.УстановитьПараметр("ВидТовара", ВидТовара);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	НайтиСоздатьКодыПодакцизныхТоваров(ВидТовара,Истина);
	НайтиСоздатьЕдиницыИзмерения(ВидТовара);
	
КонецПроцедуры

Процедура ОбновитьСтавкиПоСпиртосодержащейПродукцииС01_01_2025() Экспорт 
	
	ВидТовара = Перечисления.ВидыПодакцизныхТоваров.СпиртосодержащаяПродукция;
	
	ОбновитьСтавкиПоВидуТоваров(ВидТовара)
	
КонецПроцедуры

Функция ПолучитьСтатистикуПоОрганизациям() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара,
	|	ВЫБОР
	|		КОГДА ПорядокУплатыАкцизов.Импорт = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоИмпорт,
	|	ВЫБОР
	|		КОГДА ПорядокУплатыАкцизов.Производство = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПроизводство,
	|	ВЫБОР
	|		КОГДА (ПорядокУплатыАкцизов.Импорт ЕСТЬ NULL
	|				ИЛИ ПорядокУплатыАкцизов.Импорт = ЛОЖЬ)
	|				И (ПорядокУплатыАкцизов.Производство ЕСТЬ NULL
	|					ИЛИ ПорядокУплатыАкцизов.Производство = ЛОЖЬ)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоБезАкцизов
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
	|		ПО Организации.Ссылка = ПорядокУплатыАкцизов.Организация
	|ГДЕ
	|	Организации.ПометкаУдаления = ЛОЖЬ
	|ИТОГИ
	|	СУММА(КоличествоИмпорт),
	|	СУММА(КоличествоПроизводство),
	|	СУММА(КоличествоБезАкцизов)
	|ПО
	|	ВидТовара";
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтатистикуПоКодамПодакцизныхТоваров() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КодыВидовПодакцизныхТоваров.Код КАК Код,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыВидовПодакцизныхТоваров КАК КодыВидовПодакцизныхТоваров
	|		ПО Номенклатура.КодВидаПодакцизногоТовара = КодыВидовПодакцизныхТоваров.Ссылка
	|ГДЕ
	|	Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И Номенклатура.КодВидаПодакцизногоТовара <> ЗНАЧЕНИЕ(Справочник.КодыВидовПодакцизныхТоваров.ПустаяССылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	КодыВидовПодакцизныхТоваров.Код";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
	
КонецФункции

Процедура НачальноеЗаполнение() Экспорт	
	ДанныеКлассификатора = 
	РегистрыСведений.СтавкиАкцизаПоставляемый.ПолучитьМакет("ПредопределенныеЗначения").ПолучитьТекст();

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ДанныеКлассификатора);
		ДанныеКлассификатора = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		НаборЗаписей = РегистрыСведений.СтавкиАкцизаПоставляемый.СоздатьНаборЗаписей();
		Для Каждого Элемент Из ДанныеКлассификатора.classifierData Цикл
			Если Элемент.Дата < "20250101" Тогда
				Продолжить;
			КонецЕсли;
			КодТовара = Элемент.Код;
			КодЕдИзм  = Элемент.ЕдиницаИзмерения;
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период                    = Элемент.Дата;
			НоваяЗапись.КодВидаПодакцизногоТовара = КодТовара;
			НоваяЗапись.Сумма                     = Элемент.Ставка;
			НоваяЗапись.ЕдиницаИзмерения          = КодЕдИзм;
			Если Элемент.Свойство("Округлять") Тогда	
				Если Элемент.Округлять Тогда
					НоваяЗапись.ОкруглятьДоЦелого = Элемент.Округлять;
				Иначе
					НоваяЗапись.ОкруглятьДоЦелого = "Ложь";
				КонецЕсли;
			КонецЕсли;
			Если Элемент.Свойство("АкцизЗаЛитрСпирта") Тогда
				Если Элемент.АкцизЗаЛитрСпирта Тогда
					НоваяЗапись.РасчетАкцизаЗаЛитрСпиртаВПродукции = Элемент.АкцизЗаЛитрСпирта;
				Иначе
					НоваяЗапись.РасчетАкцизаЗаЛитрСпиртаВПродукции = "Ложь";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	Исключение
		
		УчетАкцизов.ЗаписатьИнформациюВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось выполнить начальное заполнение регистра сведений Ставки акциза:
					|%1'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())),
			Истина,
			РегистрыСведений.СтавкиАкцизаПоставляемый);
		
		ВызватьИсключение;
		
	КонецПопытки;	
КонецПроцедуры

Процедура ОбновитьСтавкиПоАкцизам(Параметры = Неопределено) Экспорт
	Если ОбщегоНазначения.РазделениеВключено() И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	Набор = РегистрыСведений.СтавкиАкцизаПоставляемый.СоздатьНаборЗаписей();
	Набор.Записать();
	НачальноеЗаполнение();
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОбновитьСтавкиПоСпиртосодержащейПродукцииС01_01_2025");
	Методы.Вставить("УстановкаСпособаПолученияТоваровПриОбновленииИБ");
	Методы.Вставить("ОбновитьСтавкиПоАкцизам");
	
КонецПроцедуры

Процедура СформироватьДвиженияОперацииСПодакцизнымиТоварами(ТаблицаАкцизов, Реквизиты, Движения) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицаАкцизов)
	 Или Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРеквизитов = Реквизиты[0];
	
	ТаблицаДляЗаписи = ТаблицаАкцизов.Скопировать();
	ТаблицаДляЗаписи.Свернуть("Номенклатура, ВидДекларации, ДатаПринятияНаУчет", "Количество, СуммаАкциза");
	
	Для Каждого Строка Из ТаблицаДляЗаписи Цикл
		Если Не ЗначениеЗаполнено(Строка.ВидДекларации) Тогда
			Продолжить;
		КонецЕсли;
		Проводка = Движения.ОперацииСПодакцизнымиТоварами.Добавить();
		Если ЗначениеЗаполнено(Строка.ДатаПринятияНаУчет) Тогда
			Проводка.Период = Строка.ДатаПринятияНаУчет;
		Иначе
			Проводка.Период = СтрокаРеквизитов.Период;
		КонецЕсли;
		Проводка.Организация   = СтрокаРеквизитов.Организация;
		Проводка.Номенклатура  = Строка.Номенклатура;
		Проводка.Количество    = Строка.Количество;
		Проводка.СуммаАкциза   = Строка.СуммаАкциза;
		Проводка.ВидДекларации = Строка.ВидДекларации;
	КонецЦикла;
	
	Движения.ОперацииСПодакцизнымиТоварами.Записывать = Истина;
	
КонецПроцедуры

Процедура ПолучитьСведенияОПоказателяхОтчетаАкцизыАлкоголь(ПоказателиОтчета, ИДРедакцииОтчета) Экспорт
	
	Если ИДРедакцииОтчета = "ФормаОтчета2025Кв1" Тогда
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020001003", Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000020002003", Истина, Ложь);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00021М100001", Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00021М100002", Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00021М100004", Истина, Ложь);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00024М100001", Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00024М100002", Истина, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьСведенияОПоказателяхОтчетаКосвенныеНалогиФорма2026Кв2(ПоказателиОтчета) Экспорт
	
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000030001003", Истина, Ложь);
	
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00003М102000", Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00003М103100", Истина, Ложь);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00003М204000", Истина, Ложь);
		
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00003М300001", Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00003М300002", Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00003М300003", Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00003М300004", Истина, Ложь);

		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П00003М305000", Истина, Ложь);
		
КонецПроцедуры

Процедура СформироватьДвиженияНачисленияАкцизовПриВвозеИзЕАЭС(ТаблицаАкцизов, Реквизиты, Движения) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицаАкцизов) Или Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРеквизитов              = Реквизиты[0];
	ПартионныйУчет                = УчетнаяПолитика.СпособОценкиМПЗ(СтрокаРеквизитов.Организация, СтрокаРеквизитов.Период) = Перечисления.СпособыОценки.ФИФО;
	ЕстьПодразделениеВТаблице     = ТаблицаАкцизов.Колонки.Найти("Подразделение") <> Неопределено;
	ЕстьПодразделениеВШапке       = Реквизиты.Колонки.Найти("ПодразделениеОрганизации") <> Неопределено;
	
	ОбщаяСуммаАкциза = Окр(ТаблицаАкцизов.Итог("СуммаАкциза"));
	Если СтрокаРеквизитов.Период > '20260701' Тогда
		// Округляем проводку по начислению акциза с 1 июля 2026 года.
		КоличествоСтрок = ТаблицаАкцизов.Количество();
		Если КоличествоСтрок > 0 
			И ОбщаяСуммаАкциза > 0
			И ОбщаяСуммаАкциза <> ТаблицаАкцизов.Итог("СуммаАкциза") Тогда
			МассивКоэффициентов = ТаблицаАкцизов.ВыгрузитьКолонку("СуммаАкциза");
			МассивСумм = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(
				ОбщаяСуммаАкциза, МассивКоэффициентов);
			Для НомерСтроки = 0 По КоличествоСтрок - 1 Цикл
				ТаблицаАкцизов[НомерСтроки].СуммаАкциза = МассивСумм[НомерСтроки];
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаАкцизовНачисление = ТаблицаАкцизов.Скопировать();
	ТаблицаАкцизовНачисление.Свернуть("СчетАкциза, СубконтоАкцизы, ДатаПринятияНаУчет, МаркируемаяПродукция, ПрименяетсяДОПП", "СуммаАкциза");
	
	ВедетсяУчетПоПодразделениям = БухгалтерскийУчетПереопределяемый.ВестиУчетПоПодразделениям();
	
	НачислениеНалоговНаЕНС = ЕдиныйНалоговыйСчет.НовыйНачислениеНалоговНаЕНС();
	
	Для Каждого СтрокаТаблицы Из ТаблицаАкцизовНачисление Цикл
		
		МесяцУплаты               = ДобавитьМесяц(СтрокаТаблицы.ДатаПринятияНаУчет, 1);
		СрокУплаты                = Дата(Год(МесяцУплаты), Месяц(МесяцУплаты), 20);
		ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
		ГрафикПереноса            = КалендарныеГрафики.БлижайшиеРабочиеДаты(ПроизводственныйКалендарь,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СрокУплаты));
		НачислениеКосвенныхНалоговНаЕНСРегламентнымДокументом = УчетНДС.НачислениеКосвенныхНалоговНаЕНСРегламентнымДокументом(
			ГрафикПереноса[СрокУплаты]);
		
		СчетУчетаАкцизаПриВвозеИзЕАЭС = ?(НачислениеКосвенныхНалоговНаЕНСРегламентнымДокументом,
			ПланыСчетов.Хозрасчетный.АкцизТаможенныйСоюзКУплате,
			ПланыСчетов.Хозрасчетный.Акцизы);
		
		// Дт 19.06 Кт 68.43
		Проводка = Движения.Хозрасчетный.Добавить();
		Проводка.Период      = СтрокаРеквизитов.Период;
		Проводка.Организация = СтрокаРеквизитов.Организация;
		Проводка.Содержание  = "Начислен акциз при ввозе товаров из ЕАЭС";
		Проводка.СчетДт      = СтрокаТаблицы.СчетАкциза;
		Проводка.СчетКт      = СчетУчетаАкцизаПриВвозеИзЕАЭС;
		БухгалтерскийУчет.УстановитьСубконто(
			Проводка.СчетКт, Проводка.СубконтоКт, "ВидыПлатежейВГосБюджет", Перечисления.ВидыПлатежейВГосБюджет.Налог);
		БухгалтерскийУчет.УстановитьСубконто(
			Проводка.СчетКт, Проводка.СубконтоКт, "Контрагенты", СтрокаРеквизитов.Контрагент);
		БухгалтерскийУчет.УстановитьСубконто(
			Проводка.СчетКт, Проводка.СубконтоКт, "Договоры", СтрокаРеквизитов.ДоговорКонтрагента);
		БухгалтерскийУчет.УстановитьСубконто(
			Проводка.СчетКт, Проводка.СубконтоКт, "СФПолученные", СтрокаРеквизитов.Регистратор);
		Если ВедетсяУчетПоПодразделениям Тогда
			БухгалтерскийУчет.УстановитьСубконто(
				Проводка.СчетКт, Проводка.СубконтоКт, "РегистрацияВНалоговомОргане", СтрокаТаблицы.СубконтоАкцизы);
		КонецЕсли;
		Проводка.Сумма = СтрокаТаблицы.СуммаАкциза;
		
		// Дт 68.43 Кт 68.90
		Если (НачислениеКосвенныхНалоговНаЕНСРегламентнымДокументом И СтрокаТаблицы.ПрименяетсяДОПП)
		 Или Не ЕдиныйНалоговыйСчет.ЭтоПростойУчет(ГрафикПереноса[СрокУплаты], СтрокаРеквизитов.Организация)
		 Или СтрокаТаблицы.МаркируемаяПродукция = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		УчетНДСПереопределяемый.НачислитьАкцизНаЕНППриВвозеТоваровИзЕАЭС(СтрокаРеквизитов, СтрокаТаблицы, НачислениеНалоговНаЕНС);
		
	КонецЦикла;
	
	СформироватьДвиженияВключениеАкцизаВСтоимость(Движения, ЕстьПодразделениеВТаблице, ЕстьПодразделениеВШапке, ПартионныйУчет, СтрокаРеквизитов, ТаблицаАкцизов);
	
	ЕдиныйНалоговыйСчет.СформироватьДвиженияНачислениеНалоговНаЕНС(НачислениеНалоговНаЕНС, СтрокаРеквизитов, Движения);
	
	Движения.Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьДвиженияВключениеАкцизаВСтоимость(Движения, ЕстьПодразделениеВТаблице, ЕстьПодразделениеВШапке, ПартионныйУчет, СтрокаРеквизитов, ТаблицаАкцизов)
	
	Для Каждого СтрокаТаблицы Из ТаблицаАкцизов Цикл
		
		Подразделение = Неопределено;
		Если ЕстьПодразделениеВТаблице Тогда
			Подразделение = СтрокаТаблицы.Подразделение;
		ИначеЕсли ЕстьПодразделениеВШапке Тогда
			Подразделение = СтрокаРеквизитов.Подразделение;
		КонецЕсли;
		
		// Проводка Дт Счет учета (41.х или 10.х) Кт 19.06
		Проводка             = Движения.Хозрасчетный.Добавить();
		Проводка.Период      = СтрокаРеквизитов.Период;
		Проводка.Организация = СтрокаРеквизитов.Организация;
		Проводка.Содержание  = "Включение суммы акциза в стоимость";
		Проводка.СчетДт      = СтрокаТаблицы.СчетУчета;
		СвойстваСчета        = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетУчета);
		Для Ном = 1 По СвойстваСчета.КоличествоСубконто Цикл
			Если СвойстваСчета["ВидСубконто" + Ном] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура Тогда
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт,
					Ном, СтрокаТаблицы.Номенклатура);
			ИначеЕсли СвойстваСчета["ВидСубконто" + Ном] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады Тогда
				Если БухгалтерскийУчет.ВедетсяСуммовойУчетПоСкладам(СтрокаТаблицы.СчетУчета) Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт,
						Ном, СтрокаТаблицы.Склад);
				КонецЕсли;
			ИначеЕсли СвойстваСчета["ВидСубконто" + Ном] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Партии Тогда
				Если ПартионныйУчет Тогда
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт,
						Ном, СтрокаТаблицы.Партия);
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		Если СвойстваСчета.УчетПоПодразделениям Тогда
			Проводка.ПодразделениеДт = Подразделение;
		КонецЕсли;
		Проводка.СчетКт = СтрокаТаблицы.СчетАкциза;
		Проводка.Сумма  = СтрокаТаблицы.СуммаАкциза;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НайтиСоздатьКодыПодакцизныхТоваров(ВидТовара, Обновление = Ложь, Перезаписать = Ложь)
	
	Макет = Справочники.КодыВидовПодакцизныхТоваров.ПолучитьМакет("КлассификаторКодов");
	ОбластьПоВидуТовара = Макет.Области.Найти(СтрЗаменить(ВидТовара, " ", ""));
	Если ОбластьПоВидуТовара <> Неопределено Тогда
		ОбластьПоВидуТовара = Макет.ПолучитьОбласть(СтрЗаменить(ВидТовара, " ", ""));
		Если Не Обновление Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КодыВидовПодакцизныхТоваров.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КодыВидовПодакцизныхТоваров КАК КодыВидовПодакцизныхТоваров
			|ГДЕ
			|	КодыВидовПодакцизныхТоваров.ВидТовара = &ВидТовара
			|	И КодыВидовПодакцизныхТоваров.ПометкаУдаления = ЛОЖЬ";
			Запрос.УстановитьПараметр("ВидТовара", ВидТовара);
			Результат = Запрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		КолвоСтрок = ОбластьПоВидуТовара.ВысотаТаблицы;
		Для Стр = 1 По КолВоСтрок Цикл
			КодВида = ОбластьПоВидуТовара.Область(Стр, 1);
			ВидПодакцизногоТовара = Справочники.КодыВидовПодакцизныхТоваров.НайтиПоКоду(КодВида.Текст);
			Если ВидПодакцизногоТовара = Неопределено Или ВидПодакцизногоТовара = Справочники.КодыВидовПодакцизныхТоваров.ПустаяСсылка() Тогда
				НовыйВид = Справочники.КодыВидовПодакцизныхТоваров.СоздатьЭлемент();
				НовыйВид.Код                = КодВида.Текст;
				НовыйВид.Наименование       = ОбластьПоВидуТовара.Область(Стр, 3).Текст;
				НовыйВид.НаименованиеПолное = ОбластьПоВидуТовара.Область(Стр, 2).Текст;
				НовыйВид.ВидТовара          = ВидТовара;
				Если ОбластьПоВидуТовара.Область(Стр, 4).Текст <> "" Тогда
					НовыйВид.ДействуетС         = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОбластьПоВидуТовара.Область(Стр, 4).Текст, ЧастиДаты.Дата);
				КонецЕсли;
				Если ОбластьПоВидуТовара.Область(Стр, 5).Текст <> "" Тогда
					НовыйВид.ДействуетПо        = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОбластьПоВидуТовара.Область(Стр, 5).Текст, ЧастиДаты.Дата);
				КонецЕсли;
				НовыйВид.Записать();
			ИначеЕсли Перезаписать Тогда
				ПодакцизныйТовар = ВидПодакцизногоТовара.ПолучитьОбъект();
				ПодакцизныйТовар.Код                = КодВида.Текст;
				ПодакцизныйТовар.Наименование       = ОбластьПоВидуТовара.Область(Стр, 3).Текст;
				ПодакцизныйТовар.НаименованиеПолное = ОбластьПоВидуТовара.Область(Стр, 2).Текст;
				ПодакцизныйТовар.ВидТовара          = ВидТовара;
				Если ОбластьПоВидуТовара.Область(Стр, 4).Текст <> "" Тогда
					ПодакцизныйТовар.ДействуетС         = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОбластьПоВидуТовара.Область(Стр, 4).Текст, ЧастиДаты.Дата);
				КонецЕсли;
				Если ОбластьПоВидуТовара.Область(Стр, 5).Текст <> "" Тогда
					ПодакцизныйТовар.ДействуетПо        = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОбластьПоВидуТовара.Область(Стр, 5).Текст, ЧастиДаты.Дата);
				КонецЕсли;

				ПодакцизныйТовар.Записать();

			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура НайтиСоздатьЕдиницыИзмерения(ВидТовара)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	КлассификаторЕдиницИзмерения.Код КАК Код
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыВидовПодакцизныхТоваров.Код КАК Код
	|ИЗ
	|	Справочник.КодыВидовПодакцизныхТоваров КАК КодыВидовПодакцизныхТоваров";
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаЕдиницИзмерения = Результат[0].Выгрузить();
	ТаблицаКодовТоваров = Результат[1].Выгрузить();
	ДанныеКлассификатора = РегистрыСведений.СтавкиАкцизаПоставляемый.ПолучитьМакет("ПредопределенныеЗначения").ПолучитьТекст();
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ДанныеКлассификатора);
		ДанныеКлассификатора = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		Для Каждого Элемент Из ДанныеКлассификатора.classifierData Цикл
			КодТовара = Элемент.Код;
			КодЕдИзм  = Элемент.ЕдиницаИзмерения;
			Если Не ЗначениеЗаполнено(КодТовара) Тогда
				Продолжить;
			КонецЕсли;
			КодПодакцизногоТовара = ТаблицаКодовТоваров.Найти(КодТовара, "Код");
			Если КодПодакцизногоТовара = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(КодЕдИзм) Тогда
				ЕдиницаИзмерения = ТаблицаЕдиницИзмерения.Найти(КодЕдИзм, "Код");
				Если ЕдиницаИзмерения = Неопределено Тогда
					ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду(КодЕдИзм);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
	Исключение
		ВызватьИсключение;
		ЗаписьЖурналаРегистрации(
		"Ошибка при загрузке единиц измерения из макета классификатора ставок акциза",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.РегистрыСведений.СтавкиАкцизаПоставляемый,
		,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		Возврат;	
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьРегламентированныйОтчетАкцизыАлкоголь(ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт
	
	Если ИДРедакцииОтчета = "ФормаОтчета2025Кв1" Тогда
		
		ЗаполнитьРазделАкцизовРегламентированныйОтчетАкцизыАлкоголь(ПараметрыОтчета, Контейнер);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРазделАкцизовРегламентированныйОтчетАкцизыАлкоголь(ПараметрыОтчета, Контейнер) Экспорт
	
	ПараметрыЗаполнения = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтчета);
	ПараметрыЗаполнения.Вставить("ЗнакиДробнойЧасти", 5); 
	
	Раздел2 = Контейнер.Раздел2;
	СтрокиРаздел2 = Раздел2.Строки[0];
	СтраницаРаздел2 = СтрокиРаздел2.Данные;
	ОчиститьСтроку(СтраницаРаздел2);
	СтрокиНачислений = СтрокиРаздел2.ДанныеМногострочныхЧастей.П00021М1.Строки;
	СтрокиРеализации = СтрокиРаздел2.ДанныеМногострочныхЧастей.П00022М1.Строки;
	СтрокиВычетов = СтрокиРаздел2.ДанныеМногострочныхЧастей.П00023М1.Строки;
	СтрокиУплаты = СтрокиРаздел2.ДанныеМногострочныхЧастей.П00024М1.Строки;
	СтрокиУточнений = СтрокиРаздел2.ДанныеМногострочныхЧастей.П00241М1.Строки;
	СтрокиИтогов = СтрокиРаздел2.ДанныеМногострочныхЧастей.П00025М1.Строки;
	Пока СтрокиНачислений.Количество() > 1 Цикл
		СтрокиНачислений.Удалить(1);
	КонецЦикла;
	Пока СтрокиРеализации.Количество() > 1 Цикл
		СтрокиРеализации.Удалить(1);
	КонецЦикла;
	Пока СтрокиВычетов.Количество() > 1 Цикл
		СтрокиВычетов.Удалить(1);
	КонецЦикла;
	Пока СтрокиУплаты.Количество() > 1 Цикл
		СтрокиУплаты.Удалить(1);
	КонецЦикла;
	Пока СтрокиУточнений.Количество() > 1 Цикл
		СтрокиУточнений.Удалить(1);
	КонецЦикла;
	Пока СтрокиИтогов.Количество() > 1 Цикл
		СтрокиИтогов.Удалить(1);
	КонецЦикла;
	СтраницаРаздел2Операция21 = СтрокиНачислений[0].Данные;
	ОчиститьСтроку(СтраницаРаздел2Операция21);
	
	СтраницаРаздел2Операция24 = СтрокиУплаты[0].Данные;
	ОчиститьСтроку(СтраницаРаздел2Операция24);
	ПерваяСтраница = Истина;
	Пока Раздел2.Строки.Количество() > 1 Цикл
		Раздел2.Строки.Удалить(1);
	КонецЦикла;
	ОчиститьСтроку(Раздел2.Строки[0].Данные);
	ТекущийКБК = Неопределено;
	ТекущийВидТовара = Неопределено;
	ДанныеОтчета = ДанныеРегОтчетов(ПараметрыЗаполнения, Перечисления.ВидыДекларацийПоПодакцизнымТоварам.ДекларацияАкцизыАлко);
	
	Для Каждого СтрокаДанных Из ДанныеОтчета.ДанныеПоказателей Цикл
		Если ПерваяСтраница 
			Или ТекущийКБК <> СтрокаДанных.КБК 
			Или (Не ЗначениеЗаполнено(СтрокаДанных.КБК) И ТекущийВидТовара <> СтрокаДанных.КодВидаПодакцизногоТовара) Тогда
			СтруктураНовойТаблицы = Новый Структура();
			СтруктураДанныхМногострочныхЧастей = Новый Структура();
			Для Каждого Показатель Из СтраницаРаздел2 Цикл
				СтруктураНовойТаблицы.Вставить(Показатель.Ключ,
				ОбщегоНазначенияБПКлиентСервер.ПустоеЗначениеТипа(ТипЗнч(Показатель.Значение)));
			КонецЦикла;
			Для Каждого Показатель Из СтраницаРаздел2Операция21 Цикл
				Если Показатель.Значение = Неопределено Тогда
					СтруктураДанныхМногострочныхЧастей.Вставить(Показатель.Ключ, Неопределено);
				Иначе
					СтруктураДанныхМногострочныхЧастей.Вставить(Показатель.Ключ, 
					ОбщегоНазначенияБПКлиентСервер.ПустоеЗначениеТипа(ТипЗнч(Показатель.Значение)));
				КонецЕсли;
			КонецЦикла;
			Для Каждого Показатель Из СтраницаРаздел2Операция24 Цикл
				Если Показатель.Значение = Неопределено Тогда
					СтруктураДанныхМногострочныхЧастей.Вставить(Показатель.Ключ, Неопределено);
				Иначе
					СтруктураДанныхМногострочныхЧастей.Вставить(Показатель.Ключ, 
					ОбщегоНазначенияБПКлиентСервер.ПустоеЗначениеТипа(ТипЗнч(Показатель.Значение)));
				КонецЕсли;
			КонецЦикла;
			Если ПерваяСтраница Тогда
				НоваяСтраницаРаздела2 = Раздел2.Строки[0];
			Иначе
				НоваяСтраницаРаздела2 = Раздел2.Строки.Добавить();
			КонецЕсли;
			НоваяСтраницаРаздела2.Данные = СтруктураНовойТаблицы;
			НоваяСтраницаРаздела2.ДанныеМногострочныхЧастей = Новый Структура(
			"П00021М1, П00022М1, П00023М1, П00024М1, П00241М1, П00025М1",
			ДеревоЗначенийРегОтчет(), ДеревоЗначенийРегОтчет(),
			ДеревоЗначенийРегОтчет(), ДеревоЗначенийРегОтчет(),
			ДеревоЗначенийРегОтчет(), ДеревоЗначенийРегОтчет());
			
			СтрокиРаздел2 = НоваяСтраницаРаздела2;
			СтраницаРаздел2 = СтрокиРаздел2.Данные;
			ТекущийКБК = СтрокаДанных.КБК;
			ПерваяСтраница = Ложь;
			СтрокаНачисления = 
			НоваяСтраницаРаздела2.ДанныеМногострочныхЧастей.П00021М1.Строки.Добавить();
			СтрокаУплаты = 
			НоваяСтраницаРаздела2.ДанныеМногострочныхЧастей.П00024М1.Строки.Добавить();
			
			СтрокаНачисления.Данные = Новый Структура(СтруктураДанныхМногострочныхЧастей);
			СтрокаНачисления.ДанныеМногострочныхЧастей = Новый Структура;
			СтрокаУплаты.Данные = Новый Структура(СтруктураДанныхМногострочныхЧастей);
			СтрокаУплаты.ДанныеМногострочныхЧастей = Новый Структура;
		Иначе
			СтрокаНачисления = 
			СтрокиРаздел2.ДанныеМногострочныхЧастей.П00021М1.Строки.Добавить();
			СтрокаНачисления.Данные = Новый Структура(СтруктураДанныхМногострочныхЧастей);
			СтрокаНачисления.ДанныеМногострочныхЧастей = Новый Структура;
		КонецЕсли;
		ЗаполнитьРаздел2РегОтчетаАкцизыАлко(Раздел2, СтраницаРаздел2, СтрокаНачисления, СтрокаУплаты, СтрокаДанных);
	КонецЦикла;
	ПоместитьВоВременноеХранилище(Контейнер, ПараметрыОтчета.АдресВоВременномХранилище);
КонецПроцедуры

Процедура ЗаполнитьРазделАкцизовРегламентированныйОтчетКосвенныеНалогиФорма2026Кв2(ПараметрыОтчета, Контейнер) Экспорт
	
	ПараметрыЗаполнения = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтчета);
	ПараметрыЗаполнения.Вставить("ЗнакиДробнойЧасти", 5);
	
	Раздел3 = Контейнер.Раздел3;
	СтрокиРаздел3 = Раздел3.Строки[0];
	ДанныеРаздела = СтрокиРаздел3.Данные;
	ОчиститьСтроку(ДанныеРаздела);
	СтруктураНовойТаблицы = Новый Структура();
	Для Каждого Показатель Из ДанныеРаздела Цикл
		СтруктураНовойТаблицы.Вставить(Показатель.Ключ,
		ОбщегоНазначенияБПКлиентСервер.ПустоеЗначениеТипа(ТипЗнч(Показатель.Значение)));
	КонецЦикла;
	Пока Раздел3.Строки.Количество() > 1 Цикл
		Раздел3.Строки.Удалить(1);
	КонецЦикла;
	ТекущийКБК = Неопределено;
	ТекущийВидТовара = Неопределено;
	ДанныеОтчета = ДанныеРегОтчетов(ПараметрыЗаполнения, Перечисления.ВидыДекларацийПоПодакцизнымТоварам.ДекларацияКосвенныеНалогиТС);
	ДанныеОтчета.ДанныеПоказателей.Сортировать("КБК, КодВидаПодакцизногоТовара");
	СтрокаРаздел3 = Раздел3.Строки[0];
	ГруппыПоКБК = СтрокаРаздел3.ДанныеМногострочныхЧастей.П00003М1.Строки;
	
	Если ДанныеОтчета.ДанныеПоказателей.Количество() = 0 Тогда
		Пока ГруппыПоКБК.Количество() > 1 Цикл
			ГруппыПоКБК.Удалить(1);
		КонецЦикла;
		ОчиститьСтроку(ГруппыПоКБК[0].Данные);
		Пока ГруппыПоКБК[0].ДанныеМногострочныхЧастей.П00003М2.Строки.Количество() > 1 Цикл
			ГруппыПоКБК[0].ДанныеМногострочныхЧастей.П00003М2.Строки.Удалить(1);
		КонецЦикла;
		ОчиститьСтроку(ГруппыПоКБК[0].ДанныеМногострочныхЧастей.П00003М2.Строки[0].Данные);
		СтрокиП00003М3 = ГруппыПоКБК[0].ДанныеМногострочныхЧастей.П00003М2.Строки[0].ДанныеМногострочныхЧастей.П00003М3.Строки;
		Пока СтрокиП00003М3.Количество() > 1 Цикл
			СтрокиП00003М3.Удалить(1);
		КонецЦикла;
		Если СтрокиП00003М3.Количество() = 1 Тогда
			ОчиститьСтроку(СтрокиП00003М3[0].Данные);
		КонецЕсли;
		ПоместитьВоВременноеХранилище(Контейнер, ПараметрыОтчета.АдресВоВременномХранилище);
		Возврат;
	КонецЕсли;
	
	Пока ГруппыПоКБК.Количество() > 1 Цикл
		ГруппыПоКБК.Удалить(1);
	КонецЦикла;
	
	ОчиститьСтроку(ГруппыПоКБК[0].Данные);
	
	Пока ГруппыПоКБК[0].ДанныеМногострочныхЧастей.П00003М2.Строки.Количество() > 0 Цикл
		ГруппыПоКБК[0].ДанныеМногострочныхЧастей.П00003М2.Строки.Удалить(0);
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из ДанныеОтчета.ДанныеПоказателей Цикл
		Если ТекущийКБК <> СтрокаДанных.КБК
			Или (Не ЗначениеЗаполнено(СтрокаДанных.КБК)
			И ТекущийВидТовара <> СтрокаДанных.КодВидаПодакцизногоТовара) Тогда
			Если ТекущийКБК = Неопределено Тогда
				ГруппаПоКБК = ГруппыПоКБК[0];
			Иначе
				ГруппаПоКБК = ГруппыПоКБК.Добавить();
				ГруппаПоКБК.Данные = Новый Структура();
				ГруппаПоКБК.ДанныеМногострочныхЧастей =
				Новый Структура("П00003М2", ДеревоЗначенийРегОтчет());
			КонецЕсли;
			ГруппаПоКБК.Данные.Вставить("П00003М1", СтрокаДанных.КБК);
			ТекущийКБК = СтрокаДанных.КБК;
		Иначе
			ГруппаПоКБК = СтрокаРаздел3.ДанныеМногострочныхЧастей.П00003М1.Строки[
			СтрокаРаздел3.ДанныеМногострочныхЧастей.П00003М1.Строки.Количество()-1];
		КонецЕсли; 
		СтрокаПоСтране = ГруппаПоКБК.ДанныеМногострочныхЧастей.П00003М2.Строки.Добавить();
		СтрокаПоСтране.Данные = Новый Структура();
		СтрокаПоСтране.ДанныеМногострочныхЧастей = Новый Структура(
		"П00003М3", ДеревоЗначенийРегОтчет()); 
		СтрокаТовара = СтрокаПоСтране.ДанныеМногострочныхЧастей.П00003М3.Строки.Добавить();
		СтрокаТовара.Данные = Новый Структура();
		СтрокаТовара.ДанныеМногострочныхЧастей = Новый Структура();
		ЗаполнитьРаздел3РегОтчетаКосвенныеНалогиФорма2026Кв2(ДанныеРаздела, ГруппаПоКБК, СтрокаПоСтране, СтрокаТовара, СтрокаДанных);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Контейнер, ПараметрыОтчета.АдресВоВременномХранилище);
КонецПроцедуры

Процедура ЗаполнитьРаздел2РегОтчетаАкцизыАлко(Раздел2, СтраницаРаздел2, СтрокаНачисления, СтрокаУплаты, СтрокаДанныеПоказателей) 
	
	Показатели = ПоказателиАкцизыАлко(СтрокаДанныеПоказателей);
	СтраницаРаздел2.П000020001003 = СтрокаДанныеПоказателей.КодВидаПодакцизногоТовара;
	СтраницаРаздел2.П000020002003 = СтрокаДанныеПоказателей.КБК;
	СтрокаНачисления.Данные.Вставить("П00021М100001", Показатели.П00021М100001);
	Если Показатели.П00021М100001 = "10001" Тогда
		СтрокаНачисления.Данные.Вставить("П00021М100002", Показатели.П00021М100002);
	КонецЕсли;
	СтрокаНачисления.Данные.Вставить("П00021М100003", Показатели.П00021М100003);
	СтрокаНачисления.Данные.Вставить("П00021М100004", Показатели.П00021М100004);
	СтрокаУплаты.Данные.Вставить("П00024М100001", Показатели.П00024М100001);
	ЗначениеПоказателя = Неопределено;
	Если СтрокаУплаты.Данные.Свойство("П00024М100002", ЗначениеПоказателя)
		И ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
		СтрокаУплаты.Данные.Вставить("П00024М100002", ЗначениеПоказателя);
	Иначе
		СтрокаУплаты.Данные.Вставить("П00024М100002", 0);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРаздел3РегОтчетаКосвенныеНалогиФорма2026Кв2(ДанныеРаздела, ГруппаПоКБК, СтрокаПоСтране, СтрокаТовара, СтрокаДанныеПоказателей) 
	
	Показатели = ПоказателиКосвенныеНалогиФорма2026Кв2(СтрокаДанныеПоказателей);
	ДанныеРаздела.Вставить("П000030001003", Показатели.П000030001003);
	ГруппаПоКБК.Данные.Вставить("П00003М102000", Показатели.П00003М102000);
	ГруппаПоКБК.Данные.Вставить("П00003М103100", Показатели.П00003М103100);
	СтрокаПоСтране.Данные.Вставить("П00003М204000", Показатели.П00003М204000);
	СтрокаТовара.Данные.Вставить("П00003М300001", Показатели.П00003М300001);
	СтрокаТовара.Данные.Вставить("П00003М300002", Показатели.П00003М300002);
	СтрокаТовара.Данные.Вставить("П00003М300003", Показатели.П00003М300003);
	СтрокаТовара.Данные.Вставить("П00003М300004", Показатели.П00003М300004);
	СтрокаТовара.Данные.Вставить("П00003М305000", Показатели.П00003М305000);

КонецПроцедуры

Процедура ОчиститьСтроку(Строка)
	Для Каждого Показатель Из Строка Цикл
		Если Показатель.Значение = Неопределено Тогда
			Строка[Показатель.Ключ] = Неопределено;
			Продолжить;
		КонецЕсли;
		
		Строка[Показатель.Ключ] = ОбщегоНазначенияБПКлиентСервер.ПустоеЗначениеТипа(ТипЗнч(Показатель.Значение));
	КонецЦикла;	
КонецПроцедуры

Функция ПоказателиАкцизыАлко(СтрокаДанных) Экспорт
	Показатели = Новый Структура;
		Показатели.Вставить("П00021М100001", "10001");
		Показатели.Вставить("П00021М100002", "4");
		Показатели.Вставить("П00021М100003", "0");
		Показатели.Вставить("П00021М100004", СтрокаДанных.СуммаАкциза);
		Показатели.Вставить("П00024М100001", "40001");
	Возврат Показатели;
КонецФункции

Функция ПоказателиКосвенныеНалогиФорма2026Кв2(СтрокаДанных) Экспорт
	
	Показатели = Новый Структура;
	Показатели.Вставить("П000030001003", СтрокаДанных.КодПоОКТМО);
	Показатели.Вставить("П00003М102000", СтрокаДанных.КБК);
	Показатели.Вставить("П00003М103100", СтрокаДанных.СуммаОбеспечительногоПлатежа);
	Показатели.Вставить("П00003М204000", СтрокаДанных.СтранаРегистрации);
	Показатели.Вставить("П00003М300001", СтрокаДанных.КодВидаПодакцизногоТовара);
	Показатели.Вставить("П00003М300002", СтрокаДанных.ЕдиницаИзмеренияТНВЭД);
	
	Если НужноЗаполнитьГрафы345(СтрокаДанных.КодВидаПодакцизногоТовара) Тогда 
		Если СтрокаДанных.КБК = "18210402060011000110" Тогда
			Показатели.Вставить("П00003М300003", СтрокаДанных.КоэффициентПересчета);
		Иначе
			Показатели.Вставить("П00003М300003", СтрокаДанных.ПроцентСпиртаВПродукции);
		КонецЕсли;
		
		Если СтрокаДанных.КодВидаПодакцизногоТовара = "290" ИЛИ
			СтрокаДанных.КодВидаПодакцизногоТовара = "299" Тогда
			КоличествоПоТНВЭД = СтрокаДанных.КоличествоПоТНВЭД;
			
			Если СтрокаДанных.ЕдиницаИзмеренияТНВЭД = "831"
				И ЗначениеЗаполнено(СтрокаДанных.ПроцентСпиртаВПродукции)
				И СтрокаДанных.ПроцентСпиртаВПродукции <> 0 Тогда
				КоличествоПоТНВЭД = КоличествоПоТНВЭД / (СтрокаДанных.ПроцентСпиртаВПродукции / 100);
			КонецЕсли;
			
			Показатели.Вставить("П00003М300004", КоличествоПоТНВЭД);
		Иначе
			Показатели.Вставить("П00003М300004", СтрокаДанных.Количество);
		КонецЕсли;
	Иначе
		Показатели.Вставить("П00003М300003", "0");
		Показатели.Вставить("П00003М300004", "0");
	КонецЕсли;
	Показатели.Вставить("П00003М305000", СтрокаДанных.СуммаАкциза);
	
	Возврат Показатели; 
	
КонецФункции

Функция ДанныеРегОтчетов(ПараметрыОтчета, ВидДекларации)

	Организация = ПараметрыОтчета.Организация;
	ДатаНачала = НачалоМесяца(ПараметрыОтчета.мДатаНачалаПериодаОтчета);
	ДатаКонца = КонецМесяца(ПараметрыОтчета.мДатаКонцаПериодаОтчета);    
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.КоличествоПоТНВЭД) КАК КоличествоПоТНВЭД,
	|	МАКСИМУМ(Товары.КодТНВЭД.ЕдиницаИзмерения.Код) КАК ЕдиницаИзмеренияТНВЭД,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Товары.Ссылка.Контрагент.СтранаРегистрации.УчастникЕАЭС
	|				ТОГДА Товары.Ссылка.Контрагент.СтранаРегистрации.Код
	|			ИНАЧЕ """"
	|		КОНЕЦ) КАК СтранаРегистрации
	|ПОМЕСТИТЬ ТоварыЗаявления
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка,
	|	Товары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Акцизы.Номенклатура КАК Номенклатура,
	|	СУММА(Акцизы.Количество) КАК Количество,
	|	СУММА(Акцизы.СуммаАкциза) КАК СуммаАкциза,
	|	Акцизы.Номенклатура.КодВидаПодакцизногоТовара.Код КАК КодВидаПодакцизногоТовара,
	|	Акцизы.Номенклатура.ПроцентСпиртаВПродукции КАК ПроцентСпиртаВПродукции,
	|	Акцизы.Организация.РегистрацияВНалоговомОргане.КодПоОКТМО КАК КодПоОКТМО,
	|	ВЫБОР
	|		КОГДА Акцизы.Номенклатура.ЕдиницаИзмеренияДляРасчетаАкциза.Код = ""214""
	|			ТОГДА Акцизы.Номенклатура.КоэффициентПересчета / 0.75
	|		ИНАЧЕ Акцизы.Номенклатура.КоэффициентПересчета
	|	КОНЕЦ КАК КоэффициентПересчета,
	|	ТоварыЗаявления.ЕдиницаИзмеренияТНВЭД КАК ЕдиницаИзмеренияТНВЭД,
	|	ТоварыЗаявления.СтранаРегистрации КАК СтранаРегистрации,
	|	ТоварыЗаявления.КоличествоПоТНВЭД КАК КоличествоПоТНВЭД
	|ИЗ
	|	РегистрСведений.ОперацииСПодакцизнымиТоварами КАК Акцизы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыЗаявления КАК ТоварыЗаявления
	|		ПО Акцизы.Регистратор = ТоварыЗаявления.Ссылка
	|			И Акцизы.Номенклатура = ТоварыЗаявления.Номенклатура
	|ГДЕ
	|	Акцизы.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И Акцизы.Организация = &Организация
	|	И Акцизы.ВидДекларации = &ВидДекларации
	|
	|СГРУППИРОВАТЬ ПО
	|	Акцизы.Номенклатура,
	|	Акцизы.Номенклатура.КодВидаПодакцизногоТовара.Код,
	|	Акцизы.Номенклатура.ПроцентСпиртаВПродукции,
	|	Акцизы.Организация.РегистрацияВНалоговомОргане.КодПоОКТМО,
	|	ТоварыЗаявления.ЕдиницаИзмеренияТНВЭД,
	|	ТоварыЗаявления.СтранаРегистрации,
	|	ТоварыЗаявления.КоличествоПоТНВЭД,
	|	ВЫБОР
	|		КОГДА Акцизы.Номенклатура.ЕдиницаИзмеренияДляРасчетаАкциза.Код = ""214""
	|			ТОГДА Акцизы.Номенклатура.КоэффициентПересчета / 0.75
	|		ИНАЧЕ Акцизы.Номенклатура.КоэффициентПересчета
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДатаКонца));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидДекларации", ВидДекларации);
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗапросДОПП = Новый Запрос;
	ЗапросДОПП.Текст =
	"ВЫБРАТЬ
	|	КосвенныеНалогиСведенияИзДОПП.КБК КАК КБК,
	|	СУММА(КосвенныеНалогиСведенияИзДОПП.СуммаНалогаАкциза) КАК СуммаНалогаАкциза
	|ИЗ
	|	РегистрСведений.КосвенныеНалогиСведенияИзДОПП КАК КосвенныеНалогиСведенияИзДОПП
	|ГДЕ
	|	КосвенныеНалогиСведенияИзДОПП.Организация = &Организация
	|	И КосвенныеНалогиСведенияИзДОПП.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	КосвенныеНалогиСведенияИзДОПП.КБК";
	
	ЗапросДОПП.УстановитьПараметр("Организация", Организация);
	ЗапросДОПП.УстановитьПараметр("НачалоПериода", ДатаНачала);
	ЗапросДОПП.УстановитьПараметр("КонецПериода", КонецДня(ДатаКонца));
	
	РезультатДОПП = ЗапросДОПП.Выполнить().Выгрузить();
	
	Результат.Колонки.Добавить("СуммаОбеспечительногоПлатежа");
	СоответствиеПоКБК = Новый Соответствие;
	
	Для Каждого СтрокаДОПП Из РезультатДОПП Цикл
		СоответствиеПоКБК.Вставить(
		СтрокаДОПП.КБК,
		СтрокаДОПП.СуммаНалогаАкциза);
	КонецЦикла;
	
	Результат.Колонки.Добавить("КБК");
	
	Для Каждого Строка Из Результат Цикл
		Строка.КБК = КБККосвенныеНалогиПоВидуТовара(
		Строка.КодВидаПодакцизногоТовара);
	КонецЦикла;
	Для Каждого Строка Из Результат Цикл
		Если СоответствиеПоКБК.Получить(Строка.КБК) <> Неопределено Тогда
			Строка.СуммаОбеспечительногоПлатежа =
			СоответствиеПоКБК.Получить(Строка.КБК);
		Иначе
			Строка.СуммаОбеспечительногоПлатежа = 0;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеАкцизы = Новый Структура;
	ДанныеАкцизы.Вставить("ДанныеПоказателей", Результат);
	
	Возврат ДанныеАкцизы;
	
КонецФункции

Функция ДеревоЗначенийРегОтчет()
	
	НовоеДеревоЗначений = Новый ДеревоЗначений();
	НовоеДеревоЗначений.Колонки.Добавить("Данные");
	НовоеДеревоЗначений.Колонки.Добавить("ДанныеМногострочныхЧастей");
	
	Возврат НовоеДеревоЗначений;
	
КонецФункции

Функция НужноЗаполнитьГрафы345(КодВида) Экспорт
	
	СоответствиеКодов = Новый Соответствие;
	СоответствиеКодов.Вставить("290", Истина);
	СоответствиеКодов.Вставить("299", Истина);
	СоответствиеКодов.Вставить("520", Истина);
	СоответствиеКодов.Вставить("531", Истина);
	СоответствиеКодов.Вставить("532", Истина);
	СоответствиеКодов.Вставить("533", Истина);
	СоответствиеКодов.Вставить("534", Истина);
	СоответствиеКодов.Вставить("535", Истина);
	СоответствиеКодов.Вставить("536", Истина);
	
	Возврат СоответствиеКодов.Получить(КодВида) <> Неопределено;
	
КонецФункции

Функция КБКАкцизыАлкогольПоВидуТовара(КодВида) Экспорт
	
	СоответствиеКБК = Новый Соответствие;
	
	СоответствиеКБК.Вставить("111", "18210302011011000110");
	СоответствиеКБК.Вставить("121", "18210302012011000110");
	СоответствиеКБК.Вставить("166", "18210302013011000110");
	
	СоответствиеКБК.Вставить("175", "18210302500011000110");
	
	СоответствиеКБК.Вставить("225", "18210302111011000110");
	СоответствиеКБК.Вставить("231", "18210302130011000110");
	СоответствиеКБК.Вставить("232", "18210302120011000110");
	
	СоответствиеКБК.Вставить("253", "18210302021011000110");
	СоответствиеКБК.Вставить("254", "18210302022011000110");
	
	СоответствиеКБК.Вставить("274", "18210302090011000110");
	СоответствиеКБК.Вставить("275", "18210302091011000110");
	
	СоответствиеКБК.Вставить("276", "18210302090011000110");
	СоответствиеКБК.Вставить("277", "18210302091011000110");
	
	СоответствиеКБК.Вставить("290", "18210302020011000110");
	СоответствиеКБК.Вставить("298", "18210302480011000110");
	
	СоответствиеКБК.Вставить("310", "18210302100011000110");
	СоответствиеКБК.Вставить("320", "18210302100011000110");
	СоответствиеКБК.Вставить("330", "18210302100011000110");
	
	КБК = СоответствиеКБК.Получить(КодВида);
	Если КБК = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат КБК;
КонецФункции

Функция КБККосвенныеНалогиПоВидуТовара(КодВида) Экспорт
	
	СоответствиеКБК = Новый Соответствие;
	
	СоответствиеКБК.Вставить("111", "18210402011011000110");
	СоответствиеКБК.Вставить("140", "18210402011011000110");
	СоответствиеКБК.Вставить("160", "18210402011011000110");
	
	СоответствиеКБК.Вставить("166", "18210402012011000110");
	
	СоответствиеКБК.Вставить("121", "18210402013011000110");
	СоответствиеКБК.Вставить("150", "18210402013011000110");
	СоответствиеКБК.Вставить("170", "18210402013011000110");
	
	СоответствиеКБК.Вставить("175", "18210402220011000110");
	
	СоответствиеКБК.Вставить("224", "18210402110011000110");
	
	СоответствиеКБК.Вставить("232", "18210402120011000110");
	
	СоответствиеКБК.Вставить("251", "18210402090011000110");
	
	СоответствиеКБК.Вставить("253", "18210402021011000110");
	СоответствиеКБК.Вставить("255", "18210402021011000110");
	СоответствиеКБК.Вставить("256", "18210402021011000110");
	
	СоответствиеКБК.Вставить("290", "18210402020011000110");
	
	СоответствиеКБК.Вставить("298", "18210402210011000110");
	
	СоответствиеКБК.Вставить("310", "18210402100011000110");
	СоответствиеКБК.Вставить("320", "18210402100011000110");
	СоответствиеКБК.Вставить("330", "18210402100011000110");
	
	СоответствиеКБК.Вставить("474", "18210402230011000110");
	
	СоответствиеКБК.Вставить("475", "18210402240011000110");
	
	СоответствиеКБК.Вставить("510", "18210402060011000110");
	СоответствиеКБК.Вставить("520", "18210402060011000110");
	СоответствиеКБК.Вставить("531", "18210402060011000110");
	СоответствиеКБК.Вставить("532", "18210402060011000110");
	СоответствиеКБК.Вставить("533", "18210402060011000110");
	СоответствиеКБК.Вставить("534", "18210402060011000110");
	СоответствиеКБК.Вставить("535", "18210402060011000110");
	СоответствиеКБК.Вставить("536", "18210402060011000110");
	
	СоответствиеКБК.Вставить("630", "18210402070011000110");
	
	СоответствиеКБК.Вставить("640", "18210402080011000110");
	
	СоответствиеКБК.Вставить("650", "18210402140011000110");
	
	СоответствиеКБК.Вставить("665", "18210402040011000110");
	СоответствиеКБК.Вставить("676", "18210402040011000110");
	
	СоответствиеКБК.Вставить("677", "18210402170011000110");

	КБК = СоответствиеКБК.Получить(КодВида);
	Если КБК = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат КБК;
КонецФункции

Функция КодыВидаПодакцизныхТоваровРаздел3() Экспорт
	
	ОтчетОбъект = РегламентированнаяОтчетностьВызовСервера.ОтчетОбъект(
	"РегламентированныйОтчетКосвенныеНалогиТамСоюз");
	Макет = ОтчетОбъект.ПолучитьМакет("СпискиВыбора2026Кв2");
	
	Область = Макет.Области.Найти("КодыВидаПТ_Раздел3");
	
	Коды = Новый Массив;
	
	Для НомерСтроки = Область.Верх По Область.Низ Цикл
		Код = СокрП(Макет.Область(НомерСтроки, 1).Текст);
		Если Не ПустаяСтрока(Код) Тогда
			Коды.Добавить(Код);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Коды;
	
КонецФункции

#КонецОбласти

#Область ПрочиеСлужебныеПроцедурыИФункции

Процедура ЗаписатьИнформациюВЖурналРегистрации(
	СообщениеОбОшибке,
	Ошибка = Истина,
	ОбъектМетаданных = Неопределено) Экспорт
	
	УровеньЖР = ?(Ошибка,
	УровеньЖурналаРегистрации.Ошибка,
	УровеньЖурналаРегистрации.Информация);
	
	ЗаписьЖурналаРегистрации(
	ИмяСобытияЖурналаРегистрации(),
	УровеньЖР,
	ОбъектМетаданных,
	,
	Лев(СообщениеОбОшибке, 5120));	
КонецПроцедуры

Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Акцизы'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти