&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПравоРедактирования 	= CW_ПраваДоступа.ПравоДоступно("РедактированиеОбъектовСлежения");
	ЭтаФорма.ТолькоПросмотр = НЕ ПравоРедактирования;
	
	Если Параметры.Свойство("ДатаПроверки") Тогда
		ДатаПроверки = Параметры.ДатаПроверки;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаПроверки) Тогда
		ДатаПроверки = ТекущаяДата();
	КонецЕсли;
	
	УстановитьОтборДинамическогоСписка();

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры     

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Элементы.Список.Обновить();
	
КонецПроцедуры 

&НаКлиенте
Процедура ВариантОтбораПриИзменении(Элемент)
	УстановитьОтборДинамическогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроверкиПриИзменении(Элемент)
	УстановитьОтборДинамическогоСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСписка()
	
	ДатаСреза = ?(ЗначениеЗаполнено(ДатаПроверки), ДатаПроверки, ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("ДатаСреза", КонецДня(ДатаСреза));
	
	Список.Отбор.Элементы.Очистить();
	
	//Актуальные(0), Не актуальные(1), Все(2)
	Если ВариантОтбора = 2 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВариантОтбора = 0 Тогда
		
		ГруппаИ = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаИ.ТипГруппы		= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ГруппаИ.Использование 	= Истина;
		
		НовыйЭлементОтбора = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НачалоСлежения");
		НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		НовыйЭлементОтбора.ПравоеЗначение 	= ДатаПроверки;
		НовыйЭлементОтбора.Использование	= Истина;
		
		ГруппаИЛИ = ГруппаИ.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаИЛИ.ТипГруппы		= ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
		ГруппаИЛИ.Использование = Истина;
		
		НовыйЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОкончаниеСлежения");
		НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		НовыйЭлементОтбора.ПравоеЗначение 	= ДатаПроверки;
		НовыйЭлементОтбора.Использование 	= Истина;
		
		НовыйЭлементОтбора = ГруппаИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОкончаниеСлежения");
		НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение 	= Дата(1,1,1);
		НовыйЭлементОтбора.Использование 	= Истина;
		
	КонецЕсли;
	
	Если ВариантОтбора = 1 Тогда
		
		НовыйЭлементОтбора =  Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОкончаниеСлежения");
		НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Меньше;
		НовыйЭлементОтбора.ПравоеЗначение 	= ДатаПроверки;
		НовыйЭлементОтбора.Использование 	= Истина;
		
		НовыйЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ОкончаниеСлежения");
		НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.НеРавно;
		НовыйЭлементОтбора.ПравоеЗначение 	= Дата(1,1,1);
		НовыйЭлементОтбора.Использование 	= Истина;
	
	КонецЕсли;

КонецПроцедуры



//Внешние подклчюаемые команды
&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры
//Внешние подклчюаемые команды

        