
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ПроверитьВозможностьВыполненияКоманды(ПараметрКоманды);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	ПолучитьСтруктуруПараметраКоманды(ПараметрКоманды, СтруктураПараметров);
	
	СтруктураПараметров.Вставить("ВнешнийВызов"			, Истина);
	
	ОткрытьФорму("Отчет.CW_РасходыЗаПериод.Форма",СтруктураПараметров,ПараметрыВыполненияКоманды);

КонецПроцедуры

&наКлиенте
Функция ПроверитьВозможностьВыполненияКоманды(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Грузоперевозки") 
		ИЛИ  ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Заказы") 
		ИЛИ  ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")
		Тогда
		Возврат Ложь
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


&НаСервере
Процедура ПолучитьСтруктуруПараметраКоманды(ПараметрКоманды, СтруктураПараметров)
	
	СтруктураОтбора = Новый Структура;
	мГруппировки 	= Новый Структура;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		//Простая устанвока параметров
		ДатаПервичногоДокумента = ?(ПараметрКоманды.ПредъявленАкт, ПараметрКоманды.ДатаАкта, ПараметрКоманды.ДатаСчета);
		
		НачалоПериода = Мин(ПараметрКоманды.Дата, ДатаПервичногоДокумента);
		КонецПериода  = Макс(ПараметрКоманды.Дата, ДатаПервичногоДокумента);
		
		ВариантФормирования = ?(ПараметрКоманды.ПредъявленАкт, 0, 1);
		
		мДокументы = Новый Массив;
		мДокументы.Добавить(ПараметрКоманды);
		
		мГруппировки.Вставить("Документ"		, "Документ");
		мГруппировки.Вставить("Номенклатура"	, "Номенклатура");
		мГруппировки.Вставить("Грузоперевозка"	, "Грузоперевозка");
		
		СтруктураОтбора.Вставить("Документ"			, мДокументы);
		
	Иначе
		Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			
			мГрузоперевозки = новый Массив;
			мГрузоперевозки.Добавить(ПараметрКоманды);
			
			ЗапросДокументы = новый Запрос;
			ЗапросДокументы.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			ЗапросДокументы.Текст = "ВЫБРАТЬ
			                        |	CW_РасходыПоГрузоперевозкамОбороты.ДокументРасходов КАК ДокументРасходов
			                        |ПОМЕСТИТЬ ВТ_ДокументыРасходов
			                        |ИЗ
			                        |	РегистрНакопления.CW_РасходыПоГрузоперевозкам.Обороты(, , Период, Грузоперевозка В (&мГрузоперевозки)) КАК CW_РасходыПоГрузоперевозкамОбороты";
			
			ЗапросДокументы.УстановитьПараметр("мГрузоперевозки", мГрузоперевозки);
			
			ЗапросДокументы.Выполнить();
		
		ИначеЕсли  ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.CW_Заказы") Тогда
			
			Запрос = новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	CW_Грузоперевозки.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
			               |ГДЕ
			               |	CW_Грузоперевозки.Заказ = &Заказ";
			
			Запрос.УстановитьПараметр("Заказ", ПараметрКоманды);
			
			мГрузоперевозки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			ЗапросДокументы = новый Запрос;
			ЗапросДокументы.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			ЗапросДокументы.Текст = "ВЫБРАТЬ
			                        |	CW_РасходыПоГрузоперевозкамОбороты.ДокументРасходов КАК ДокументРасходов
			                        |ПОМЕСТИТЬ ВТ_ДокументыРасходов
			                        |ИЗ
			                        |	РегистрНакопления.CW_РасходыПоГрузоперевозкам.Обороты(, , Период, Грузоперевозка В (&мГрузоперевозки)) КАК CW_РасходыПоГрузоперевозкамОбороты";
			
			ЗапросДокументы.УстановитьПараметр("мГрузоперевозки", мГрузоперевозки);
			
			ЗапросДокументы.Выполнить();
		
		КонецЕсли;
		
		ЗапросДокументы.Текст = "ВЫБРАТЬ
		                        |	МИНИМУМ(ВТ_ДокументыРасходов.ДокументРасходов.Дата) КАК МинДата,
		                        |	МАКСИМУМ(ВТ_ДокументыРасходов.ДокументРасходов.Дата) КАК МаксДата,
		                        |	МИНИМУМ(ВЫБОР
		                        |			КОГДА ВТ_ДокументыРасходов.ДокументРасходов.ПредъявленАкт
		                        |				ТОГДА ВТ_ДокументыРасходов.ДокументРасходов.ДатаАкта
		                        |			ИНАЧЕ ВТ_ДокументыРасходов.ДокументРасходов.ДатаСчета
		                        |		КОНЕЦ) КАК МинДатаАктаСчета,
		                        |	МАКСИМУМ(ВЫБОР
		                        |			КОГДА ВТ_ДокументыРасходов.ДокументРасходов.ПредъявленАкт
		                        |				ТОГДА ВТ_ДокументыРасходов.ДокументРасходов.ДатаАкта
		                        |			ИНАЧЕ ВТ_ДокументыРасходов.ДокументРасходов.ДатаСчета
		                        |		КОНЕЦ) КАК МаксДатаАктаСчета,
		                        |	МАКСИМУМ(ВТ_ДокументыРасходов.ДокументРасходов.ПредъявленАкт) КАК ПредъявленАкт,
		                        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДокументыРасходов.ДокументРасходов.ПредъявленАкт) КАК ПредъявленАктРазличные
		                        |ПОМЕСТИТЬ ВТ_Даты
		                        |ИЗ
		                        |	ВТ_ДокументыРасходов КАК ВТ_ДокументыРасходов
		                        |;
		                        |
		                        |////////////////////////////////////////////////////////////////////////////////
		                        |ВЫБРАТЬ
		                        |	ЕСТЬNULL(ВТ_Даты.МинДата, НАЧАЛОПЕРИОДА(&ДатаПериода, МЕСЯЦ)) КАК МинДата,
		                        |	ЕСТЬNULL(ВТ_Даты.МаксДата, КОНЕЦПЕРИОДА(&ДатаПериода, МЕСЯЦ)) КАК МаксДата,
		                        |	ЕСТЬNULL(ВТ_Даты.МинДатаАктаСчета, НАЧАЛОПЕРИОДА(&ДатаПериода, МЕСЯЦ)) КАК МинДатаАктаСчета,
		                        |	ЕСТЬNULL(ВТ_Даты.МаксДатаАктаСчета, КОНЕЦПЕРИОДА(&ДатаПериода, МЕСЯЦ)) КАК МаксДатаАктаСчета,
		                        |	ЕСТЬNULL(ВТ_Даты.ПредъявленАкт, ЛОЖЬ) КАК ПредъявленАкт,
		                        |	ЕСТЬNULL(ВТ_Даты.ПредъявленАктРазличные,0) КАК ПредъявленАктРазличные
		                        |ИЗ
		                        |	ВТ_Даты КАК ВТ_Даты";
		
		ЗапросДокументы.УстановитьПараметр("ДатаПериода", ТекущаяДата()); 
	
		ЗапросДокументы.УстановитьПараметр("мГрузоперевозки", мГрузоперевозки);
		
		РезультатЗапроса = ЗапросДокументы.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			НачалоПериода 			= НачалоМесяца(ТекущаяДата());
			КонецПериода 			= КонецМесяца(ТекущаяДата());
			ВариантФормирования 	= 0;
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			НачалоПериода 		= Мин(Выборка.МинДата				, Выборка.МинДатаАктаСчета);
			КонецПериода  		= Макс(Выборка.МаксДата				, Выборка.МаксДатаАктаСчета);
			ПредъявленАкт 		= ?(Выборка.ПредъявленАкт=1			, Выборка.ПредъявленАкт 		, ложь);
			ВариантФормирования = ?(ПредъявленАкт, 0, 1);
		КонецЕсли;
		
		мГруппировки.Вставить("Грузоперевозка"	, "Грузоперевозка");
		мГруппировки.Вставить("Документ"		, "Документ");
		мГруппировки.Вставить("Номенклатура"	, "Номенклатура");
		
		СтруктураОтбора.Вставить("Грузоперевозка"	, мГрузоперевозки);
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачалоПериода"		, НачалоДня(НачалоПериода));
	СтруктураПараметров.Вставить("КонецПериода"			, КонецДня(КонецПериода));
	СтруктураПараметров.Вставить("ВариантФормирования"	, ВариантФормирования);
	СтруктураПараметров.Вставить("Группировки"			, мГруппировки);
	СтруктураПараметров.Вставить("Отбор"				, СтруктураОтбора);
	

КонецПроцедуры
