&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	_ВосстановитьСтандартныеНастройки();
		
	_ВосстановитьСеансовуюНастройку(); 
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) Тогда
		НачалоПериода = НачалоМесяца(ТекущаяДата());
		КонецПериода  = КонецМесяца(ТекущаяДата());
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура _ВосстановитьСтандартныеНастройки()
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчеты.CW_ВознаграждениеПоГрузоперевозкам.ПолучитьМакет("Схема").НастройкиПоУмолчанию);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	ВариантМодифицирован = Ложь;	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть = Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка    = Ложь;
	Иначе
		Если Элементы.ГруппаНастройки.Видимость Тогда
			Элементы.ГруппаНастройки.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка    = Ложь;
		Иначе
			Элементы.ГруппаНастройки.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка    = Истина;
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПериода",ЭтотОбъект); 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод;
	Диалог.Период.ДатаНачала = НачалоПериода;
	Диалог.Период.ДатаОкончания = КонецПериода;
	Диалог.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Показать(ПОВ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериода(ОтветПериод, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ОтветПериод <> Неопределено) Тогда
		НачалоПериода = ОтветПериод.ДатаНачала;
		КонецПериода  = ОтветПериод.ДатаОкончания;
		//Период = ОтветПериод;
	КонецЕсли;
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("НачалоПериода", НачалоПериода);
			СеансоваяНастройка.Свойство("КонецПериода", КонецПериода);
			СеансоваяНастройка.Свойство("БазаРуб", БазаРуб);
			СеансоваяНастройка.Свойство("СуммаРуб", СуммаРуб);
			СеансоваяНастройка.Свойство("НДСРуб", НДСРуб);
			СеансоваяНастройка.Свойство("ВсегоРуб", ВсегоРуб);
			СеансоваяНастройка.Свойство("НДСВал", НДСВал);
			СеансоваяНастройка.Свойство("ВсегоВал", ВсегоВал);
			Группировки.Загрузить(СеансоваяНастройка.Группировки);
			// Отбор
			НастройкиКД = "";
			СеансоваяНастройка.Свойство("Отбор", НастройкиКД);
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			Для Каждого СтрОтбор из НастройкиКД.Отбор.Элементы Цикл
				НовОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовОтбор, СтрОтбор);
			КонецЦикла;	
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("НачалоПериода", НачалоПериода);
	СтруктураНастройки.Вставить("КонецПериода", КонецПериода);
	СтруктураНастройки.Вставить("БазаРуб", БазаРуб);
	СтруктураНастройки.Вставить("СуммаРуб", СуммаРуб);
	СтруктураНастройки.Вставить("НДСРуб", НДСРуб);
	СтруктураНастройки.Вставить("ВсегоРуб", ВсегоРуб);
	СтруктураНастройки.Вставить("НДСВал", НДСВал);
	СтруктураНастройки.Вставить("ВсегоВал", ВсегоВал);
	СтруктураНастройки.Вставить("Группировки", Группировки.Выгрузить());
	СтруктураНастройки.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ГруппировкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГруппировки",ЭтотОбъект); 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СхемаКомпоновкиДанных", ПолучитьURLСхемы());
	ПараметрыФормы.Вставить("Режим"          , "Группировка");
	ПараметрыФормы.Вставить("ИсключенныеПоля", ПолучитьЗапрещенныеПоля("Группировка"));
	ПараметрыФормы.Вставить("ТекущаяСтрока"  , Неопределено);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораДоступногоПоля", ПараметрыФормы,Элемент,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГруппировки(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Если (Ответ <> КодВозвратаДиалога.Отмена) Тогда
			
			Нстр = Группировки.Добавить();
			Ответ.Свойство("Поле", Нстр.ИмяПоля);
			Ответ.Свойство("Заголовок", Нстр.Представление);
			Нстр.Сортировка = ПредопределенноеЗначение("Перечисление.CW_НаправлениеСортировки.ПоВозрастанию");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
		
	Если Режим = "Группировка" Тогда		
		Для Каждого Стр Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если Стр.Папка ИЛИ Стр.Таблица ИЛИ (Найти(Стр.Поле, "удалить") <> 0) Тогда
				СписокПолей.Добавить(Строка(Стр.Поле));
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Сформировать(Команда)
		
	Если НЕ БазаРуб И НЕ СуммаРуб И НЕ НДСРуб И НЕ ВсегоРуб И НЕ НДСВал И НЕ ВсегоВал Тогда
		_УФК.ВывестиПредупреждение("Не отмечено ни одного показателя!");
		Возврат;		
	КонецЕсли;
	
	Если Группировки.Количество() = 0 Тогда
		_УФК.ВывестиПредупреждение("Не выбрано ни одной группировки!");
		Возврат;				
	КонецЕсли;	
	
	_Настройка(Истина);
	СформироватьОтчет();
	ОбработатьОтчет();
		
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
		
	// записываем настройки во временное хранилище
	Отчет.АдресНастроек = _ПолучитьАдресНастроек();
	ЭтаФорма.СкомпоноватьРезультат();
	
	// --- 
	_СохранитьСеансовуюНастройку();
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресНастроек()
	
	Настройки = _сф.ст_Создать("НачалоПериода,КонецПериода,БазаРуб,СуммаРуб,НДСРуб,ВсегоРуб,НДСВал,ВсегоВал,Группировки");
	Настройки.НачалоПериода = НачалоПериода;
	Настройки.КонецПериода = КонецПериода;
	Настройки.БазаРуб = БазаРуб;
	Настройки.СуммаРуб = СуммаРуб;
	Настройки.НДСРуб = НДСРуб;
	Настройки.ВсегоРуб = ВсегоРуб;
	Настройки.НДСВал = НДСВал;
	Настройки.ВсегоВал = ВсегоВал;
	Настройки.Группировки = Группировки.Выгрузить();
	
	Возврат(ПоместитьВоВременноеХранилище(Настройки, ЭтаФорма.УникальныйИдентификатор));
	
КонецФункции

&НаСервере
Процедура ОбработатьОтчет()
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "0:00:00", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "23:59:59", "");
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сальдо на начало периода", "Сальдо на " + Формат(НачалоПериода,"ДФ=dd.MM.yy"), ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сальдо на конец периода", "Сальдо на " + Формат(КонецПериода,"ДФ=dd.MM.yy"), ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "База, Руб.", "База, Руб.", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Всего, Вал.", "Всего, Вал.", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Всего, Руб.", "Всего, Руб.", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "НДС, Вал.", "НДС, Вал.", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "НДС, Руб.", "НДС, Руб.", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Сумма, Руб.", "Сумма, Руб.", ГоризонтальноеПоложение.Центр);
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(Результат, "Итого", "ИТОГО:");	
	
	Результат.УдалитьОбласть(Результат.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.УдалитьОбласть(Результат.Область("R2"), ТипСмещенияТабличногоДокумента.ПоГоризонтали); 
	Результат.ФиксацияСверху = Результат.ФиксацияСверху - 2;
	
	Результат.АвтоМасштаб = Истина;
	
КонецПроцедуры	

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	
	СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
	
	ДоступныеДействия = Новый Массив();
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
	
	// Осуществим выбор действия расшифровки пользователем
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораДействияРасшифровки",ЭтотОбъект, Новый Структура("Расшифровка",Расшифровка)); 
	ОбработкаРасшифровки.ПоказатьВыборДействия(ПОВ,Расшифровка, ДоступныеДействия, , Истина);
   	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ВыполненноеДействие <> Неопределено) Тогда
		
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
            ПоказатьЗначение(,ПараметрВыполненногоДействия);    
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать Тогда 
            НовыеНастройки = ПрименитьНастройкиСКД(ДополнительныеПараметры.Расшифровка, ПараметрВыполненногоДействия);
		КонецЕсли;
		
		// --- 
		
		Если (НовыеНастройки <> Неопределено) Тогда
			
			// Пользователь выбрал действие, для которого нужно менять настройки
			Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать ИЛИ 
				
				ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить Тогда
				Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НовыеНастройки);
				Отчет.АдресНастроек = _ПолучитьАдресНастроек();
				ЭтаФорма.СкомпоноватьРезультат();
				ОбработатьОтчет();
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьURLСхемы()
	
	ОсновнаяСхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").СхемаКомпоновкиДанных;
    URLСхемы = ПоместитьВоВременноеХранилище(ОсновнаяСхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
    Возврат (URLСхемы);
	
КонецФункции

&НаСервере
Функция ПрименитьНастройкиСКД(Расшифровка, ПараметрВыполненногоДействия)
    
    ОбработкаРасшифровки     = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьURLСхемы()));
    Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,ПараметрВыполненногоДействия);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("НачалоПериода", НачалоПериода);
	Настройки.ДополнительныеСвойства.Вставить("КонецПериода", КонецПериода);
	Настройки.ДополнительныеСвойства.Вставить("БазаРуб", БазаРуб);
	Настройки.ДополнительныеСвойства.Вставить("СуммаРуб", СуммаРуб);
	Настройки.ДополнительныеСвойства.Вставить("НДСРуб", НДСРуб);
	Настройки.ДополнительныеСвойства.Вставить("ВсегоРуб", ВсегоРуб);
	Настройки.ДополнительныеСвойства.Вставить("НДСВал", НДСВал);
	Настройки.ДополнительныеСвойства.Вставить("ВсегоВал", ВсегоВал);
	//Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки.Выгрузить());
	Настройки.ДополнительныеСвойства.Вставить("Группировки", Группировки); // ДанныеФормыКоллекция
	Настройки.ДополнительныеСвойства.Вставить("Отбор", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
		
КонецПроцедуры