
//&НаКлиенте
//&ИзменениеИКонтроль("ПриОткрытии")
//Процедура саб_ПриОткрытии(Отказ)
//    #Вставка
//	ЭтоПервыйЗапуск = Ложь;
//	#КонецВставки
//	//Первый запуск программы
//	Если ЭтоПервыйЗапуск Тогда 

//		Если ЭтоПервыйЗапуск Тогда 
//			Отказ = Истина;
//			ОткрытьФорму("ОбщаяФорма.CW_ПервыйЗапуск"); 
//			ЭтаФорма.Закрыть();
//		КонецЕсли; 
//		//Первый запуск программы

//	ИначеЕсли ТребуетсяОбновление Тогда
//		CW_ОбновлениеКонфигурацииКлиент.ВыполнитьОбновлениеКонфигурации();	

//	Иначе        

//		Элементы.СтраницыОсновногоРаздела.ТекущаяСтраница = Элементы.СтраницаРабочийСтол; 

//	КонецЕсли;

//	//CW_БухгалтерияЭкспедитораКлиент.ПриОткрытии(ЭтаФорма, Отказ);

//КонецПроцедуры

//&НаСервере
//&ИзменениеИКонтроль("ПриСозданииНаСервере")
//Процедура саб_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь,Истина);

//	CW_РегистрацияПрограммыКлиентСервер.УстановитьСтатусНаРабочемСтоле(ЭтаФорма);

//	РежимОтладкиВключен = CW_Настройки.ПолучитьНастройкуПользователя(,"РежимОтладкиВключен");

//	CW_БухгалтерияЭкспедитораСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

//	Элементы.ЗаголовокРабочегоСтола.Видимость = (НЕ ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение);

//	УстановитьПраваДоступаНаСервере();
//	_УправлениеЭлементамиФормы();

//	ОбновитьСписокВнешнихОтчетовИОбработок();

//	ГруппаПользователя 			= CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
//	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь, Истина);
//	БлокироватьРаботу 			= НЕ ЭтоПолноправныйПользователь и Не ЗначениеЗаполнено(ГруппаПользователя);

//	УстанавилваемыеПараметры = Новый Структура("CW_ГруппаПользователя",ГруппаПользователя); 
//	УстановитьПараметрыФункциональныхОпцийФормы(УстанавилваемыеПараметры);

//	ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();

//	//Подсистема.ЛичныйКабинет    
//	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитора.CW_ЛичныйКабинетКлиента") Тогда   
//		Модуль_CW_ЛичныйКабинетКлиентаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_ЛичныйКабинетКлиентаСервер");
//		Модуль_CW_ЛичныйКабинетКлиентаСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
//	КонецЕсли;
//	//Подсистема.ЛичныйКабинет   

//	//Подсистема.CW_РеестрыНДС0 
//	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда   
//		Модуль_CW_РеестрыНДС0Сервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_РеестрыНДС0Сервер");
//		Модуль_CW_РеестрыНДС0Сервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
//		Модуль_CW_РеестрыНДС0Сервер.УстановитьПараметрСеансаРеестрыНДС0(Не ИспользуетсяСервисРеестрНДС);
//	КонецЕсли;
//	//Подсистема.CW_РеестрыНДС0   

//	//Подсистема.CW_ДоходыНерезидентов 
//	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_ДоходыНерезидентов") Тогда   
//		Модуль_CW_ДоходыНерезидентовСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_ДоходыНерезидентовСервер");
//		Модуль_CW_ДоходыНерезидентовСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
//	КонецЕсли;
//	//Подсистема.CW_ДоходыНерезидентов    

//	ЭтаФорма.Заголовок = ПолучитьЗаголовокФормыНаСервере();

//	//Подсистема ДополнительныеРеквизиты    
//	CW_ДополнительныеРеквизитыСлужебный.УстановитьПрименениеДополнительныхРеквизитов();  
//	//Конец Подсистема ДополнительныеРеквизиты   

//	// по заявке  AFR-233641
//	Элементы.Группа13.Доступность = РольДоступна("ПолныеПрава");
//	Элементы.Группа11.Доступность = РольДоступна("ПолныеПрава");
//	// по заявке  AFR-233641   
//	
//	#Удаление
//	НовыйСеанс = НЕ ПараметрыСеанса.CW_РабочийСтолЗапущен;
//	#КонецУдаления
//	#Вставка
//	НовыйСеанс = Истина;
//	#КонецВставки
//	ПараметрыСеанса.CW_РабочийСтолЗапущен = Истина;

//КонецПроцедуры
