//Устарела с версии 8.3.14.7
Функция detailedget(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);

	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Запрос);
	
	ИмяПользователя			= XMLЗначение(Тип("Строка"), 								СтруктураJSON.UserName); 
	Профиль					= XMLЗначение(Тип("СправочникСсылка.CW_ВебПрофили"), 		СтруктураJSON.uidprofile); 
	Грузоперевозка			= XMLЗначение(Тип("СправочникСсылка.CW_Грузоперевозки"), 	СтруктураJSON.uid); 
	ДоступныПечатныеФормы 	= XMLЗначение(Тип("Булево"), 								СтруктураJSON.PrinfForm); 
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда 
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
		Возврат Ответ;
	Конецесли;
	
	СоставКомплекта 		= Профиль.ОсновнойПрофиль.КомплектПечатныхФорм.СоставКомплекта;
	ДанныеПользователя 		= CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(ИмяПользователя);  
	
	ВыгружатьФайлы 			= ДанныеПользователя.ВыгружатьФайлы И Профиль.ВыгружатьФайлы;
	ВыгружатьДокументы 		= ДоступныПечатныеФормы И ДанныеПользователя.ВыгружатьПечатныеФормы И Профиль.ОсновнойПрофиль.ВыводитьФинансовыеДокументы; 
	
	МассивПеревозок = Новый Массив;
	Если ЗначениеЗаполнено(Грузоперевозка) Тогда
		МассивПеревозок.Добавить(Грузоперевозка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Грузоперевозка.Заказ) Тогда
		МассивПеревозок.Добавить(Грузоперевозка.Заказ);
	КонецЕсли; 
	
	МассивФайлов = новый Массив;
	МассивПечатныхФорм = новый Массив;

	Если МассивПеревозок.Количество()>0 Тогда
		
		Если ВыгружатьФайлы Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 	"ВЫБРАТЬ
			|	CW_ОбъектыАрхива.Объект КАК Объект,
			|	CW_ОбъектыАрхива.Ссылка КАК Ссылка,
			|	CW_ОбъектыАрхива.Наименование КАК Наименование,
			|	CW_ОбъектыАрхива.Расширение КАК Расширение,
			|	CW_ОбъектыАрхива.ВОблаке КАК ВОблаке,
			|	CW_ОбъектыАрхива.ИмяФайла КАК ИмяФайла,
			|	CW_ОбъектыАрхива.ТипДокумента КАК ТипДокумента
			|ИЗ
			|	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
			|ГДЕ
			|	CW_ОбъектыАрхива.Объект В(&Объекты)
			|	//УсловиеПоТипамДокументов";
			
			Если Профиль.ТипыФайлов.Количество()>0 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеПоТипамДокументов","И CW_ОбъектыАрхива.ТипДокумента В (&ТипыДокументов)");
				Запрос.УстановитьПараметр("ТипыДокументов", Профиль.ТипыФайлов.ВыгрузитьКолонку("Тип"));
			КонецЕсли;
			Запрос.УстановитьПараметр("Объекты", МассивПеревозок);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ПредставлениеТипаДокумента = "";
				Если Профиль.ВыводитьТипФайла Тогда
					ПредставлениеТипаДокумента = CW_ПереводыСервер.ПолучитьПеревод(Выборка.ТипДокумента,, ДанныеПользователя.Язык);
				КонецЕсли;
				
				СтруктураФайла = новый Структура;
				СтруктураФайла.Вставить("name",			XMLСтрока(Выборка.Наименование));
				СтруктураФайла.Вставить("extension",	XMLСтрока(Выборка.Расширение));
				СтруктураФайла.Вставить("uid",			XMLСтрока(Выборка.Ссылка));  
				СтруктураФайла.Вставить("documenttype",	XMLСтрока(ПредставлениеТипаДокумента));
				СтруктураФайла.Вставить("cloud", 		?(Выборка.ВОблаке,XMLСтрока(Выборка.ИмяФайла),"")); 
				
				МассивФайлов.Добавить(СтруктураФайла);
			КонецЦикла;
			
		КонецЕсли;  
		
		Если ВыгружатьДокументы Тогда  
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов КАК ДокументДоходов
			|ИЗ
			|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
			|ГДЕ
			|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка В(&Грузоперевозки)";
			
			Запрос.УстановитьПараметр("Грузоперевозки", МассивПеревозок);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл 
				Если Не ЗначениеЗаполнено(Выборка.ДокументДоходов) Тогда
					Продолжить;
				КонецЕсли;
				
				мОбъектыПечати = Новый Массив;
				мОбъектыПечати.Добавить(Выборка.ДокументДоходов);
				
				СтруктураВозврата = CW_Печать.ПолучитьПараметрыФормыПечати(мОбъектыПечати,  Новый УникальныйИдентификатор, Истина);
				Если _УФКС.ВыполненоУспешно(СтруктураВозврата) Тогда
					
					ПакетДокументов = ПолучитьИзВременногоХранилища(СтруктураВозврата.ПФ.АдресПакета);
					
					Для Каждого Документ Из ПакетДокументов.Элементы Цикл 
						Для Каждого ПечатнаяФорма Из Документ.Элементы Цикл   
							
							Если Не CW_ЛичныйКабинетКлиентаСервер.НужноПечатьФорму(Выборка.ДокументДоходов, ПечатнаяФорма, СоставКомплекта) тогда
								Продолжить;
							КонецЕсли;
							
							ПотокВпамяти = новый ПотокВПамяти;
							
							Запись = Новый ЗаписьXML;
							Запись.ОткрытьПоток(ПотокВпамяти);
							
							Сериализатор 	= Новый СериализаторXDTO(ФабрикаXDTO);
							Сериализатор.ЗаписатьXML(Запись, ПечатнаяФорма.ПФ);   
							
							Запись.Закрыть(); 
							
							ДвоичныеДанные  = ПотокВпамяти.ЗакрытьИПолучитьДвоичныеДанные();
							СодержимоеФайла = Base64Строка(ДвоичныеДанные);
							
							СтруктураПФ = новый Структура;
							СтруктураПФ.Вставить("uid", 	XMLСтрока(Документ.Ссылка));
							СтруктураПФ.Вставить("name",	XMLСтрока(ПечатнаяФорма.Имя));
							СтруктураПФ.Вставить("data",  	XMLСтрока(СодержимоеФайла));
							
							МассивПечатныхФорм.Добавить(СтруктураПФ);	
						КонецЦикла;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЕсли;

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("archive", 	МассивФайлов);
	СтруктураJSON.Вставить("print", 	МассивПечатныхФорм); 

	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);   
	СтрокаJSON  = CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ
	
КонецФункции
//--Устарела с версии 8.3.14.7

Функция testconnectionget(Запрос) 
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	Возврат Ответ; 
	
КонецФункции

//Начальная инициализация профиля
Функция initialdataget(Запрос)  
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Запрос); 
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	   
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//Пользователь
       
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", ДанныеПользователя.Пользователь);

	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CW_ПользователиВебПрофилей.ОсновнойПрофиль КАК ОсновнойПрофиль,
	|	CW_ПользователиВебПрофилей.ОсновнойПрофиль.ДоступенРазделПеревозки КАК ДоступенРазделПеревозки,
	|	CW_ПользователиВебПрофилей.ОсновнойПрофиль.ДоступенРазделЗаявки КАК ДоступенРазделЗаявки,
	|	CW_ПользователиВебПрофилей.ОсновнойПрофиль.ВыводитьФинансовыеДокументы КАК ДоступенРазделДокументы,
	|	CW_ПользователиВебПрофилей.ОсновнойПрофиль.ДоступенРазделОтчеты КАК ДоступенРазделОтчеты,
	|	CW_ПользователиВебПрофилей.ОсновнойПрофиль.ВыводитьЗадолженность КАК ВыводитьЗадолженность,
	|	CW_ПользователиВебПрофилей.ОсновнойПрофиль.УведомлятьОЗадолженности КАК УведомлятьОЗадолженности,
	|	CW_ПользователиВебПрофилей.ОсновнойПрофиль.ИспользуемыйВариантОтчета КАК ВидВариантовОтчета,
	|	CW_ПользователиВебПрофилей.Раздел КАК Раздел
	|ПОМЕСТИТЬ ВТПрофилиПоРазделам
	|ИЗ
	|	РегистрСведений.CW_ПользователиВебПрофилей КАК CW_ПользователиВебПрофилей
	|ГДЕ
	|	CW_ПользователиВебПрофилей.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПрофилиПоРазделам.ОсновнойПрофиль КАК ОсновнойПрофиль,
	|	ВТПрофилиПоРазделам.ДоступенРазделПеревозки КАК ДоступенРазделПеревозки,
	|	ВТПрофилиПоРазделам.ДоступенРазделЗаявки КАК ДоступенРазделЗаявки,
	|	ВТПрофилиПоРазделам.ДоступенРазделДокументы КАК ДоступенРазделДокументы,
	|	ВТПрофилиПоРазделам.ДоступенРазделОтчеты КАК ДоступенРазделОтчеты,
	|	ВТПрофилиПоРазделам.ВыводитьЗадолженность КАК ВыводитьЗадолженность,
	|	ВТПрофилиПоРазделам.УведомлятьОЗадолженности КАК УведомлятьОЗадолженности,
	|	ВТПрофилиПоРазделам.ВидВариантовОтчета КАК ВидВариантовОтчета
	|ПОМЕСТИТЬ ВТ_ОсновныеПрофили
	|ИЗ
	|	ВТПрофилиПоРазделам КАК ВТПрофилиПоРазделам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПрофилиПоРазделам.ОсновнойПрофиль,
	|	ВТПрофилиПоРазделам.УведомлятьОЗадолженности,
	|	ВТПрофилиПоРазделам.ДоступенРазделОтчеты,
	|	ВТПрофилиПоРазделам.ДоступенРазделЗаявки,
	|	ВТПрофилиПоРазделам.ВыводитьЗадолженность,
	|	ВТПрофилиПоРазделам.ДоступенРазделДокументы,
	|	ВТПрофилиПоРазделам.ДоступенРазделПеревозки,
	|	ВТПрофилиПоРазделам.ВидВариантовОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеПрофили.ОсновнойПрофиль КАК ОсновнойПрофиль,
	|	ВТ_ОсновныеПрофили.ДоступенРазделПеревозки КАК ДоступенРазделПеревозки,
	|	ВТ_ОсновныеПрофили.ДоступенРазделЗаявки КАК ДоступенРазделЗаявки,
	|	ВТ_ОсновныеПрофили.ДоступенРазделДокументы КАК ДоступенРазделДокументы,
	|	ВТ_ОсновныеПрофили.ДоступенРазделОтчеты КАК ДоступенРазделОтчеты,
	|	ВТ_ОсновныеПрофили.УведомлятьОЗадолженности КАК УведомлятьОЗадолженности,
	|	ВТ_ОсновныеПрофили.ВыводитьЗадолженность КАК ВыводитьЗадолженность,
	|	ВТ_ОсновныеПрофили.ВидВариантовОтчета КАК ВидВариантовОтчета,
	|	ВТ_ОсновныеПрофили.ОсновнойПрофиль.ДоступныеВариантыОтчета.(
	|		НомерСтроки КАК НомерСтроки,
	|		ВариантОтчета.КлючВарианта КАК КлючВарианта,
	|		ВариантОтчета.Наименование КАК Наименование
	|	) КАК ДоступныеВариантыОтчета
	|ИЗ
	|	ВТ_ОсновныеПрофили КАК ВТ_ОсновныеПрофили
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПрофилиПоРазделам.Раздел КАК Раздел,
	|	ВТПрофилиПоРазделам.ОсновнойПрофиль КАК ОсновнойПрофиль
	|ИЗ
	|	ВТПрофилиПоРазделам КАК ВТПрофилиПоРазделам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПрофилиПоРазделам.ОсновнойПрофиль,
	|	ВТПрофилиПоРазделам.Раздел";  
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатЗапросаПрофили	= ПакетРезультатовЗапроса[2];
	ВыборкаОсновнойПрофиль 	= РезультатЗапросаПрофили.Выбрать();

	РезультатЗапросаРазделы	= ПакетРезультатовЗапроса[3];
	ТаблицаРазделы 	= РезультатЗапросаРазделы.Выгрузить();
	
	МассивПрофилей = Новый Массив;
	Пока ВыборкаОсновнойПрофиль.Следующий() Цикл 
		
		Отбор = Новый Структура;
		Отбор.Вставить("ОсновнойПрофиль", 	ВыборкаОсновнойПрофиль.ОсновнойПрофиль); 
		
		Отбор.Вставить("Раздел",	"ЗАЯВКИ"); 
		мЗаявки = ТаблицаРазделы.НайтиСтроки(Отбор);
		ДоступенРазделЗаявки 	= ВыборкаОсновнойПрофиль.ДоступенРазделЗаявки и мЗаявки.Количество() > 0;
		
		Отбор.Вставить("Раздел", 	"ГРУЗОПЕРЕВОЗКИ"); 
		мПеревозки = ТаблицаРазделы.НайтиСтроки(Отбор);
		ДоступенРазделПеревозки = ВыборкаОсновнойПрофиль.ДоступенРазделПеревозки и мПеревозки.Количество() > 0;
		
		ДоступенРазделДокументы = ВыборкаОсновнойПрофиль.ДоступенРазделДокументы И ДанныеПользователя.ВыгружатьПечатныеФормы;
		ДоступенРазделОтчеты 	= ВыборкаОсновнойПрофиль.ДоступенРазделОтчеты И ДанныеПользователя.ВыгружатьПечатныеФормы;

		НаименованиеПрофиля = Нстр("ru='"+ВыборкаОсновнойПрофиль.ОсновнойПрофиль.ПредставлениеRU+"'; en='"+ВыборкаОсновнойПрофиль.ОсновнойПрофиль.ПредставлениеEN+"'", СокрЛП(ДанныеПользователя.Язык));
		
		ДанныеОсновногоПрофиля = Новый Структура;  
		ДанныеОсновногоПрофиля.Вставить("id", 				XMLСтрока(ВыборкаОсновнойПрофиль.ОсновнойПрофиль));
		ДанныеОсновногоПрофиля.Вставить("name", 			XMLСтрока(НаименованиеПрофиля));
		ДанныеОсновногоПрофиля.Вставить("trucking", 		XMLСтрока(ДоступенРазделПеревозки));
		ДанныеОсновногоПрофиля.Вставить("request", 			XMLСтрока(ДоступенРазделЗаявки));
		ДанныеОсновногоПрофиля.Вставить("finance",  		XMLСтрока(ДоступенРазделДокументы));
		ДанныеОсновногоПрофиля.Вставить("reports",  		XMLСтрока(ДоступенРазделОтчеты));
		ДанныеОсновногоПрофиля.Вставить("reportarrears",  	XMLСтрока(ВыборкаОсновнойПрофиль.УведомлятьОЗадолженности));
		
		МассивВариантовОтчетов = Новый Массив;
		Если ДоступенРазделОтчеты и ВыборкаОсновнойПрофиль.ВыводитьЗадолженность Тогда
			
			Если ВыборкаОсновнойПрофиль.ВидВариантовОтчета = 1 Тогда
				
				ДоступныеВариантыОтчета = ВыборкаОсновнойПрофиль.ДоступныеВариантыОтчета.Выбрать();
				Пока ДоступныеВариантыОтчета.Следующий() Цикл
					
					СтруктураВарианта = Новый Структура;
					СтруктураВарианта.Вставить("key",  XMLСтрока(ДоступныеВариантыОтчета.КлючВарианта)); 
					СтруктураВарианта.Вставить("name", XMLСтрока(ДоступныеВариантыОтчета.Наименование)); 
					
					МассивВариантовОтчетов.Добавить(СтруктураВарианта);
					
				КонецЦикла; 
				
			ИначеЕсли ВыборкаОсновнойПрофиль.ВидВариантовОтчета = 0 Тогда   
				
				СтруктураВарианта = Новый Структура;
				СтруктураВарианта.Вставить("key",  XMLСтрока("")); 
				СтруктураВарианта.Вставить("name", XMLСтрока("Оперативная задолженность покупателей")); 
				
				МассивВариантовОтчетов.Добавить(СтруктураВарианта);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеОсновногоПрофиля.Вставить("reportoptions", МассивВариантовОтчетов);
	
		МассивПрофилей.Добавить(ДанныеОсновногоПрофиля);
	КонецЦикла;
	
	ТаблицаНовостей 	= Справочники.CW_НовостиКомпании.ПолучитьАктуальныеНовости(ДанныеПользователя.Пользователь, ДанныеПользователя.Язык);     
	newstab 			= CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ТаблицаНовостей);   
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("news",			newstab);	
	СтруктураJSON.Вставить("profiles",		МассивПрофилей);	
	
	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	СтрокаJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ;

КонецФункции

Функция moduleversionget(Запрос) 
	
	ВерсияМодуля = CW_ВерсииПодсистемСерверПовтИсп.ПолучитьВерсиюОсновнойПодсистемы();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("moduleversion",	ВерсияМодуля);	

	СтрокаJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ;
	
КонецФункции
//--Начальная инициализация профиля


//Раздел "Новости"
Функция newstextget(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);                 
	
	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Запрос);  
	
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);	 
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);	       
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	
	НовостиСсылка = XMLЗначение(Тип("СправочникСсылка.CW_НовостиКомпании"), СтруктураJSON.id);
	Если ЗначениеЗаполнено(НовостиСсылка) Тогда 
		ЯзыкНовости				= НСтр("ru='ru'; en='en'", ДанныеПользователя.Язык);
		СтруктураСодержания		= НовостиСсылка.ХранилищеСодержания.Получить();
		ФорматированныйДокумент = СтруктураСодержания[ЯзыкНовости]; 
	Иначе  
		ТекстНовости = НСтр("ru='Запрашиваемая новость не найдена!'; en='The requested news was not found!'", ДанныеПользователя.Язык);
		ФорматированнаяСтрока = Новый ФорматированнаяСтрока(ТекстНовости);
		
		ФорматированныйДокумент = новый ФорматированныйДокумент;
		ФорматированныйДокумент.УстановитьФорматированнуюСтроку(ФорматированнаяСтрока);
	КонецЕсли;       
	              
	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	newstext  = CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ФорматированныйДокумент); 

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("newstext", newstext);

	СтрокаJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);

	Возврат Ответ;
	
КонецФункции

Функция newsget(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);

	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Запрос);
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);	 
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);	       
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//---Пользователь
	
	ТаблицаНовостей = Справочники.CW_НовостиКомпании.ПолучитьАктуальныеНовости(ДанныеПользователя.Пользователь, ДанныеПользователя.Язык);     
   	newstab			= CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ТаблицаНовостей);   

	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	Ответ.УстановитьТелоИзСтроки(newstab);
	
	Возврат Ответ;

КонецФункции
//--Раздел "Новости" 


//Раздел "Перевозки"
Функция truckingget(Запрос) 
	
	УстановитьПривилегированныйРежим(Истина);  
	
	ЗапрашиватьТипФайла 	= ПолучитьФункциональнуюОпцию("CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив");
	
	СтрокаJSON 		= Запрос.ПолучитьТелоКакСтроку();
	СтруктураJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтрокаJSON);   

	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//--Пользователь
	
	//Мастер-профиль
	masterprofileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.masterprofile); 
	master 			= Справочники.CW_ВебПрофили.ПолучитьСсылку(masterprofileid);  
 	Если ЗначениеЗаполнено(master) Тогда
		Попытка
			masterПрофильОбъект = master.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если masterПрофильОбъект = Неопределено Тогда
			master = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(master) Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Не удалось идентифицировать основной профиль'; en='The main profile could not be identified'", СокрЛП(ДанныеПользователя.Язык));
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;
	//--Мастер-профиль     
	
	//Профиль
	idprofile	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.profile); 
	profile		= Справочники.CW_ВебПрофилиПеревозок.ПолучитьСсылку(idprofile);  
	Если ЗначениеЗаполнено(idprofile) Тогда
		Попытка
			ПрофильОбъект = profile.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если ПрофильОбъект = Неопределено Тогда
			profile = ПредопределенноеЗначение("Справочник.CW_ВебПрофилиЗаявок.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	//--Профиль
	
	//Доступные пользователю профили 
	ТаблицаДоступныхПрофилей = ПолучитьТаблицуДоступныхПрофилей(ДанныеПользователя, master, "ГРУЗОПЕРЕВОЗКИ", profile, ПредопределенноеЗначение("Справочник.CW_ВебПрофилиПеревозок.ПустаяСсылка"));
	Если ТаблицаДоступныхПрофилей.Количество() = 0 Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки("Нет доступных профилей");
		Возврат Ответ;
	КонецЕсли;
	//Доступные пользователю профили  
	
	СтруктураПрофиля 		= profile.ШаблонПрофиля.СтруктураПрофиля.Выгрузить();
	ОписаниеТиповВсеСсылки 	= ОбщегоНазначения.ОписаниеТипаВсеСсылки();
	
	//Описание колонок 
	ВременнаяТаблица = Новый ТаблицаЗначений; 
	ВременнаяТаблица.Колонки.Добавить("id", Новый ОписаниеТипов("Строка")); 
	
	Если profile.ВыгружатьФайлы Тогда
		ВременнаяТаблица.Колонки.Добавить("ЕстьФайлы", Новый ОписаниеТипов("Булево")); 
	КонецЕсли;
	Если master.ВыводитьФинансовыеДокументы Тогда
		ВременнаяТаблица.Колонки.Добавить("ЕстьДокументы", Новый ОписаниеТипов("Булево")); 
	КонецЕсли;
	
	columnparameters = Новый Соответствие;
	Для Каждого СтрокаСтруктуры из СтруктураПрофиля Цикл
		
		ИндексСтроки    = СтруктураПрофиля.Индекс(СтрокаСтруктуры); 
	
		ЗаголовокПоля   = Нстр("ru='"+СтрокаСтруктуры.ЗаголовокRU+"'; en='"+СтрокаСтруктуры.ЗаголовокEN+"'", СокрЛП(ДанныеПользователя.Язык));
		
		Формат = "";
		Если СтрокаСтруктуры.ДоступенФормат Тогда
			Формат = Строка(СтрокаСтруктуры.Формат);
		КонецЕсли;  
		
		ОписаниеТипа 	= СтрокаСтруктуры.ХранилищеТипаЗначения.Получить();
		ПустоеЗначение 	= ОписаниеТипа.ПривестиЗначение(Неопределено);
		ЭтоСсылка 		= ОписаниеТиповВсеСсылки.СодержитТип(ТипЗнч(ПустоеЗначение)); 
		Если ЭтоСсылка Тогда
			ОписаниеТипа = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(255)); 
		КонецЕсли; 
		
		Если ТипЗнч(ПустоеЗначение) = Тип("Дата")
			И СтрНайти(Формат, "ДП=") = 0 Тогда   
			мФормат = СтрРазделить(Формат, "; ");  
			мФормат.Добавить("ДП=' '");
			
			Формат = СтрСоединить(мФормат, "; ");
		КонецЕсли;         
		
		ОписаниеКолонки = Новый Структура;
		ОписаниеКолонки.Вставить("name", 			XMLСтрока(ЗаголовокПоля));
		ОписаниеКолонки.Вставить("type", 			CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ОписаниеТипа));
		ОписаниеКолонки.Вставить("format", 			XMLСтрока(Формат));
		ОписаниеКолонки.Вставить("userselection", 	XMLСтрока(СтрокаСтруктуры.БыстрыйОтбор));
		ОписаниеКолонки.Вставить("fixed", 			XMLСтрока(СтрокаСтруктуры.Фиксация));
		ОписаниеКолонки.Вставить("fieldorder", 		XMLСтрока(ИндексСтроки));  
		
		columnparameters.Вставить(XMLСтрока(СтрокаСтруктуры.ИмяПоля), ОписаниеКолонки); 
		
		ВременнаяТаблица.Колонки.Добавить(СтрокаСтруктуры.ИмяПоля, ОписаниеТипа, ЗаголовокПоля);
	КонецЦикла;
	//Описание колонок  "ДП="
	
	//Таблица грузоперевозок 
	СкрытьПолеСсылка = Ложь;  
  	status 			 = XMLЗначение(Тип("Число"),		СтруктураJSON.status);     
	ТаблицаПеревозок = CW_ЛичныйКабинетКлиентаСервер.ПолучитьТаблицуПеревозок(master, profile, profile.ШаблонПрофиля, status, СокрЛП(ДанныеПользователя.Язык), СкрытьПолеСсылка);
	Для Каждого СтрокаТаблицы из ТаблицаПеревозок Цикл
		 НоваяСтрока = ВременнаяТаблица.Добавить(); 
		 ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		 НоваяСтрока.id = XMLСтрока(СтрокаТаблицы.Ссылка);
	КонецЦикла;
	
	table = CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ВременнаяТаблица);   
	//Таблица грузоперевозок 
	
	//Доступные профили                        
	ДоступныеПрофили = Новый Соответствие;
	Для Каждого СтрокаДоступныхПрофилей из ТаблицаДоступныхПрофилей Цикл   
		
		НаименованиеПрофиля = Нстр("ru='"+СтрокаДоступныхПрофилей.ПредставлениеRU+"'; en='"+СтрокаДоступныхПрофилей.ПредставлениеEN+"'", СокрЛП(ДанныеПользователя.Язык));
		ВыгружатьФайлы 		= СтрокаДоступныхПрофилей.ВыгружатьФайлы и ДанныеПользователя.ВыгружатьФайлы;
		
		ПараметрыПрофиля = новый Структура;
		ПараметрыПрофиля.Вставить("name", 			XMLСтрока(НаименованиеПрофиля));
		ПараметрыПрофиля.Вставить("main", 			XMLСтрока(СтрокаДоступныхПрофилей.Основной));
		ПараметрыПрофиля.Вставить("viewfiles",		XMLСтрока(ВыгружатьФайлы));
		ПараметрыПрофиля.Вставить("viewdocs",		XMLСтрока(ДанныеПользователя.ВыгружатьПечатныеФормы));
		ПараметрыПрофиля.Вставить("attachfiles",	XMLСтрока(СтрокаДоступныхПрофилей.РазрешеноПрикреплятьФайлы));
		
		ПараметрыПрофиля.Вставить("create",			XMLСтрока(СтрокаДоступныхПрофилей.ДоступноСозданиеЗавок));  
		ПараметрыПрофиля.Вставить("hidelink", 		XMLСтрока(СкрытьПолеСсылка));
		
		//Шаблоны заявок        
		МассивШаблонов = Новый Массив;      
		
		
		ШаблоныПрофиля = СтрокаДоступныхПрофилей.ОсновнойПрофиль.ШаблоныЗаявок.ВыгрузитьКолонку("Шаблон");
		
		Для Каждого Шаблон из ШаблоныПрофиля Цикл
			
			НаименованиеШаблона = Нстр("ru='"+Шаблон.ПредставлениеRU+"'; en='"+Шаблон.ПредставлениеEN+"'", СокрЛП(ДанныеПользователя.Язык));
			
			ДанныеШаблона = Новый Структура;
			ДанныеШаблона.Вставить("id", XMLСтрока(Шаблон.Ссылка));
			ДанныеШаблона.Вставить("name", XMLСтрока(НаименованиеШаблона));
			
			МассивШаблонов.Добавить(ДанныеШаблона);	
			
		КонецЦикла;   

		ПараметрыПрофиля.Вставить("creationtemplates",	МассивШаблонов);   
		//Шаблроны заявок
	
		//Типы файлов
		ДоступныеТипыФайлов = СтрокаДоступныхПрофилей.ВебПрофиль.ТипыФайлов.Выгрузить().ВыгрузитьКолонку("Тип");	
		МассивТиповФайлов = новый Массив;   
		Если ЗапрашиватьТипФайла Тогда
			ЗаполнитьМассивТиповФайлов(ДоступныеТипыФайлов, МассивТиповФайлов, ДанныеПользователя.Язык);
		КонецЕсли;
		ПараметрыПрофиля.Вставить("filestype",		МассивТиповФайлов);   
		//Типы файлов     
		
		ДоступныеПрофили.Вставить(XMLСтрока(СтрокаДоступныхПрофилей.ВебПрофиль), ПараметрыПрофиля);
	КонецЦикла;  
	//Доступные профили      
	
	МаксимальныйРазмер = Константы.CW_ЛичныйКабинетОграничениеРазмераФайла.Получить();
	
	СтруктураJSON = Новый Соответствие;    
	СтруктураJSON.Вставить("table", 			table);  
	СтруктураJSON.Вставить("profiles", 			ДоступныеПрофили);
	СтруктураJSON.Вставить("currentprofile", 	XMLСтрока(profile));
	СтруктураJSON.Вставить("columnparameters", 	columnparameters);	
	СтруктураJSON.Вставить("maximumsize", 		XMLСтрока(МаксимальныйРазмер));   

	СтрокаJSON = CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);	
	
	Возврат Ответ;
	
КонецФункции
//--Раздел "Перевозки"


//Раздел "Заявки"
Функция requestsget(Запрос)

	УстановитьПривилегированныйРежим(Истина);  
	
	ЗапрашиватьТипФайла 	= ПолучитьФункциональнуюОпцию("CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив");
	
	СтрокаJSON 		= Запрос.ПолучитьТелоКакСтроку();
	СтруктураJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтрокаJSON);  
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	   
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//Пользователь

	//Мастер-профиль
	masterprofileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.masterprofile); 
	master			= Справочники.CW_ВебПрофили.ПолучитьСсылку(masterprofileid);  
 	Если ЗначениеЗаполнено(master) Тогда
		Попытка
			masterПрофильОбъект = master.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если masterПрофильОбъект = Неопределено Тогда
			master = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(master) Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Не удалось идентифицировать основной профиль'; en='The main profile could not be identified'", СокрЛП(ДанныеПользователя.Язык));
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;
	//Мастер-профиль
	
	//веб-профиль
	profileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.profile);  
	profile 	= Справочники.CW_ВебПрофили.ПолучитьСсылку(profileid);  
	Если ЗначениеЗаполнено(profileid) Тогда
		Попытка
			ПрофильОбъект = profile.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если ПрофильОбъект = Неопределено Тогда
			profile = ПредопределенноеЗначение("Справочник.CW_ВебПрофилиЗаявок.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
  	//веб-профиль

	//Доступные пользователю профили
	ТаблицаДоступныхПрофилей = ПолучитьТаблицуДоступныхПрофилей(ДанныеПользователя, master, "ЗАЯВКИ", profile, ПредопределенноеЗначение("Справочник.CW_ВебПрофилиЗаявок.ПустаяСсылка"));
	Если profile.Пустая()  Тогда  
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки("Не удалось определить профиль");
		Возврат Ответ;
	КонецЕсли;  
	//Доступные пользователю профили
	
	status = XMLЗначение(Тип("Число"), СтруктураJSON.status);     
	
	СтруктураПрофиля 		= profile.ШаблонПрофиля.СтруктураПрофиля.Выгрузить();
	ОписаниеТиповВсеСсылки 	= ОбщегоНазначения.ОписаниеТипаВсеСсылки();
	
	//Описание колонок 
	ВременнаяТаблица = Новый ТаблицаЗначений; 
	ВременнаяТаблица.Колонки.Добавить("id", Новый ОписаниеТипов("Строка")); 
	
	Если profile.ВыгружатьФайлы Тогда
		ВременнаяТаблица.Колонки.Добавить("ЕстьФайлы", Новый ОписаниеТипов("Булево")); 
	КонецЕсли;
	
	columnparameters = Новый Соответствие;
	Для Каждого СтрокаСтруктуры из СтруктураПрофиля Цикл
		
		ИндексСтроки    = СтруктураПрофиля.Индекс(СтрокаСтруктуры); 
	
		ЗаголовокПоля   = Нстр("ru='"+СтрокаСтруктуры.ЗаголовокRU+"'; en='"+СтрокаСтруктуры.ЗаголовокEN+"'", СокрЛП(ДанныеПользователя.Язык));
		
		Формат = "";
		Если СтрокаСтруктуры.ДоступенФормат Тогда
			Формат = Строка(СтрокаСтруктуры.Формат);
		КонецЕсли;  
		
		ОписаниеТипа 	= СтрокаСтруктуры.ХранилищеТипаЗначения.Получить();
		ПустоеЗначение 	= ОписаниеТипа.ПривестиЗначение(Неопределено);
		ЭтоСсылка 		= ОписаниеТиповВсеСсылки.СодержитТип(ТипЗнч(ПустоеЗначение)); 
		Если ЭтоСсылка Тогда
			ОписаниеТипа = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(255)); 
		КонецЕсли;     

		Если ТипЗнч(ПустоеЗначение) = Тип("Дата")
			И СтрНайти(Формат, "ДП=") = 0 Тогда   
			мФормат = СтрРазделить(Формат, "; ");  
			мФормат.Добавить("ДП=' '");
			
			Формат = СтрСоединить(мФормат, "; ");
		КонецЕсли;         
		
		ОписаниеКолонки = Новый Структура;
		ОписаниеКолонки.Вставить("name", 			XMLСтрока(ЗаголовокПоля));
		ОписаниеКолонки.Вставить("type", 			CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ОписаниеТипа));
		ОписаниеКолонки.Вставить("format", 			XMLСтрока(Формат));
		ОписаниеКолонки.Вставить("userselection", 	XMLСтрока(СтрокаСтруктуры.БыстрыйОтбор));
		ОписаниеКолонки.Вставить("fixed", 			XMLСтрока(СтрокаСтруктуры.Фиксация));
		ОписаниеКолонки.Вставить("fieldorder", 		XMLСтрока(ИндексСтроки));  
		
		columnparameters.Вставить(XMLСтрока(СтрокаСтруктуры.ИмяПоля), ОписаниеКолонки); 
		
		ВременнаяТаблица.Колонки.Добавить(СтрокаСтруктуры.ИмяПоля, ОписаниеТипа, ЗаголовокПоля);
	КонецЦикла;
	//Описание колонок  
	
	//Таблица заявок 
	СкрытьПолеСсылка = Ложь;
	ТаблицаЗаявок	 = CW_ЛичныйКабинетКлиентаСервер.ПолучитьТаблицуЗаявок(profile, profile.ШаблонПрофиля, status, СокрЛП(ДанныеПользователя.Язык), СкрытьПолеСсылка);
	Для Каждого СтрокаТаблицы из ТаблицаЗаявок Цикл
		 НоваяСтрока = ВременнаяТаблица.Добавить(); 
		 ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		 НоваяСтрока.id = XMLСтрока(СтрокаТаблицы.Ссылка);
	КонецЦикла;
	
	table = CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ВременнаяТаблица);   
  	//Таблица заявок 
	
	//Доступные профили                        
	ДоступныеПрофили = Новый Соответствие;
	Для Каждого СтрокаДоступныхПрофилей из ТаблицаДоступныхПрофилей Цикл   
		
		НаименованиеПрофиля = Нстр("ru='"+СтрокаДоступныхПрофилей.ПредставлениеRU+"'; en='"+СтрокаДоступныхПрофилей.ПредставлениеEN+"'", СокрЛП(ДанныеПользователя.Язык));
		ВыгружатьФайлы 		= СтрокаДоступныхПрофилей.ВыгружатьФайлы и ДанныеПользователя.ВыгружатьФайлы;
		
		ПараметрыПрофиля = новый Структура;
		ПараметрыПрофиля.Вставить("name", 			XMLСтрока(НаименованиеПрофиля));
		ПараметрыПрофиля.Вставить("main", 			XMLСтрока(СтрокаДоступныхПрофилей.Основной));
		ПараметрыПрофиля.Вставить("viewfiles",		XMLСтрока(ВыгружатьФайлы));
		ПараметрыПрофиля.Вставить("viewdocs",		XMLСтрока(Ложь));
		ПараметрыПрофиля.Вставить("attachfiles",	XMLСтрока(СтрокаДоступныхПрофилей.РазрешеноПрикреплятьФайлы));
		
		ПараметрыПрофиля.Вставить("create",			XMLСтрока(СтрокаДоступныхПрофилей.ДоступноСозданиеЗавок));  
		ПараметрыПрофиля.Вставить("hidelink", 		XMLСтрока(СкрытьПолеСсылка));
		
		//Шаблоны заявок        
		МассивШаблонов = Новый Массив;      
		
		ШаблоныПрофиля = master.ШаблоныЗаявок.ВыгрузитьКолонку("Шаблон");
		
		Для Каждого Шаблон из ШаблоныПрофиля Цикл
			
			НаименованиеШаблона = Нстр("ru='"+Шаблон.ПредставлениеRU+"'; en='"+Шаблон.ПредставлениеEN+"'", СокрЛП(ДанныеПользователя.Язык));
			
			ДанныеШаблона = Новый Структура;
			ДанныеШаблона.Вставить("id", XMLСтрока(Шаблон.Ссылка));
			ДанныеШаблона.Вставить("name", XMLСтрока(НаименованиеШаблона));
			
			МассивШаблонов.Добавить(ДанныеШаблона);	
			
		КонецЦикла;   

		ПараметрыПрофиля.Вставить("creationtemplates",	МассивШаблонов);   
		//Шаблроны заявок
	
		//Типы файлов
		ДоступныеТипыФайлов = СтрокаДоступныхПрофилей.ВебПрофиль.ТипыФайлов.Выгрузить().ВыгрузитьКолонку("Тип");	
		МассивТиповФайлов = новый Массив;   
		Если ЗапрашиватьТипФайла Тогда
			ЗаполнитьМассивТиповФайлов(ДоступныеТипыФайлов, МассивТиповФайлов, ДанныеПользователя.Язык);
		КонецЕсли;
		ПараметрыПрофиля.Вставить("filestype", МассивТиповФайлов);   
		//Типы файлов     
		
		ДоступныеПрофили.Вставить(XMLСтрока(СтрокаДоступныхПрофилей.ВебПрофиль), ПараметрыПрофиля);
	КонецЦикла;  
	//Доступные профили      
	
	МаксимальныйРазмер 	= Константы.CW_ЛичныйКабинетОграничениеРазмераФайла.Получить();
	
	СтруктураJSON = Новый Соответствие;    
	СтруктураJSON.Вставить("table", 			table);  
	СтруктураJSON.Вставить("profiles", 			ДоступныеПрофили);
	СтруктураJSON.Вставить("currentprofile", 	XMLСтрока(profile));
	СтруктураJSON.Вставить("columnparameters", 	columnparameters);	
	СтруктураJSON.Вставить("maximumsize", 		XMLСтрока(МаксимальныйРазмер));   
	
	СтрокаJSON = CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);	
	
	Возврат Ответ;
	
КонецФункции

Функция newrequestget(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);  
	
	СтрокаJSON 		= Запрос.ПолучитьТелоКакСтроку();
	СтруктураJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтрокаJSON); 
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	   
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//Пользователь

	//Мастер-профиль
	masterprofileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.masterprofile); 
	master			= Справочники.CW_ВебПрофили.ПолучитьСсылку(masterprofileid);  
 	Если ЗначениеЗаполнено(master) Тогда
		Попытка
			masterПрофильОбъект = master.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если masterПрофильОбъект = Неопределено Тогда
			master = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(master) Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Не удалось идентифицировать основной профиль'; en='The main profile could not be identified'", СокрЛП(ДанныеПользователя.Язык));
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;
	//Мастер-профиль
	
	//веб-профиль
	profileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.profile);  
	profile 	= Справочники.CW_ВебПрофили.ПолучитьСсылку(profileid);  
	Если ЗначениеЗаполнено(profileid) Тогда
		Попытка
			ПрофильОбъект = profile.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если ПрофильОбъект = Неопределено Тогда
			profile = ПредопределенноеЗначение("Справочник.CW_ВебПрофилиЗаявок.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
  	//веб-профиль

	//Доступные пользователю профили
	ТаблицаДоступныхПрофилей = ПолучитьТаблицуДоступныхПрофилей(ДанныеПользователя, master, "ЗАЯВКИ", profile, ПредопределенноеЗначение("Справочник.CW_ВебПрофилиЗаявок.ПустаяСсылка"));
	Если profile.Пустая()  Тогда  
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки("Не удалось определить профиль");
		Возврат Ответ;
	КонецЕсли;  
	//Доступные пользователю профили
	
	//веб-шаблон
	templateid	= XMLЗначение(Тип("УникальныйИдентификатор"), 	СтруктураJSON.template);  
	template 	= Справочники.CW_ВебШаблоныЗаявок.ПолучитьСсылку(templateid);  
	Если ЗначениеЗаполнено(template) Тогда
		Попытка
			ПрофильОбъект = template.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если ПрофильОбъект = Неопределено Тогда
			template = ПредопределенноеЗначение("Справочник.CW_ВебШаблоныЗаявок.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	

	Если Не ЗначениеЗаполнено(template) Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки("Шаблон заявки не найден!");
		Возврат Ответ;
	Конецесли; 
	
	Если master.ШаблоныЗаявок.Найти(template, "Шаблон") = Неопределено Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки("Выбранный шаблон не соответствует профилю");
		Возврат Ответ;
	КонецЕсли;
	//веб-шаблон 
	
	Если Не ПустаяСтрока(СтруктураJSON.copyreference) Тогда 
		КопируемаяЗаявка = Справочники.CW_Заявки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураJSON.copyreference));
		Попытка
			КопируемаяЗаявкаОбъект = КопируемаяЗаявка.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если КопируемаяЗаявкаОбъект = Неопределено Тогда
			КопируемаяЗаявка = Неопределено;   
		КонецЕсли;  
	КонецЕсли;
	
	СтруктураШаблона = Справочники.CW_ВебШаблоныЗаявок.ПолучитьСтруктуруШаблонаЗаявки(template, ДанныеПользователя.Язык, КопируемаяЗаявка);  
	
	МакетJSON = "";
	Если template.ТипМакетаНовойЗаявки = 1 Тогда 
		XMLМакет 	= template.ХранилищеМакета.Получить();
		МакетJSON 	= CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(XMLМакет);
	КонецЕсли;       

	СтруктураШаблона.Вставить("mxl", МакетJSON);   

	СтрокаJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураШаблона);

	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);	
	
	Возврат Ответ;  
	
КонецФункции

Функция сreaterequestpost(Запрос)   
	
	УстановитьПривилегированныйРежим(Истина);  
	
	СтрокаJSON 		= Запрос.ПолучитьТелоКакСтроку();
	СтруктураJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтрокаJSON);   
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);	 
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);	       
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//--Пользователь 
	
	//Мастер-профиль 
	masterprofileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.masterprofile); 
	master 			= Справочники.CW_ВебПрофили.ПолучитьСсылку(masterprofileid);  
	Если ЗначениеЗаполнено(master) Тогда
		Попытка
			masterПрофильОбъект = master.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если masterПрофильОбъект = Неопределено Тогда
			master = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(master) Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Не удалось идентифицировать основной профиль'; en='The main profile could not be identified'", СокрЛП(ДанныеПользователя.Язык));
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;
	//--Мастер-профиль 
	
 	//Профиль
	profileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.profile); 
	profile		= Справочники.CW_ВебПрофили.ПолучитьСсылку(profileid);  
	Если ЗначениеЗаполнено(profileid) Тогда
		Попытка
			ПрофильОбъект = profile.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если ПрофильОбъект = Неопределено Тогда
			profile = ПредопределенноеЗначение("Справочник.CW_ВебПрофилиЗаявок.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	//--Профиль  
	
	//Доступные пользователю профили 
	ТаблицаДоступныхПрофилей = ПолучитьТаблицуДоступныхПрофилей(ДанныеПользователя, master, "ЗАЯВКИ", profile, ПредопределенноеЗначение("Справочник.CW_ВебПрофилиЗаявок.ПустаяСсылка"));
	Если ТаблицаДоступныхПрофилей.Количество() = 0 Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки("Нет доступных профилей");
		Возврат Ответ;
	КонецЕсли;
	//--Доступные пользователю профили
	
	//веб-шаблон
	templateid	= XMLЗначение(Тип("УникальныйИдентификатор"), 	СтруктураJSON.template);  
	template 	= Справочники.CW_ВебШаблоныЗаявок.ПолучитьСсылку(templateid);  
	Если ЗначениеЗаполнено(template) Тогда
		Попытка
			ПрофильОбъект = template.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если ПрофильОбъект = Неопределено Тогда
			template = ПредопределенноеЗначение("Справочник.CW_ВебШаблоныЗаявок.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	

	Если Не ЗначениеЗаполнено(template) Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки("Шаблон заявки не найден!");
		Возврат Ответ;
	Конецесли; 
	
	Если master.ШаблоныЗаявок.Найти(template, "Шаблон") = Неопределено Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки("Выбранный шаблон не соответствует профилю");
		Возврат Ответ;
	КонецЕсли;
	//веб-шаблон  
	
	СтрокаШаблона	= master.ШаблоныЗаявок.Найти(template,"Шаблон");
	СоставЗаявки 	= template.СоставЗаявки.Выгрузить();

	Соответствие = Новый Соответствие;  
	Соответствие.Вставить("Реквизиты", Новый Соответствие);
	Соответствие.Вставить("Параметры", Новый Соответствие);
	
	ОписаниеТипаВсеСсылки = ОбщегоНазначения.ОписаниеТипаВсеСсылки();
	
	Для Каждого КлючЗначение из СтруктураJSON.requisites Цикл
		НайденнаяСтрока =  СоставЗаявки.Найти(КлючЗначение.Ключ, "ИмяОбластиМакета");
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;    
		
		ОписаниеТипов 		= НайденнаяСтрока.ХранилищеТипаЗначения.Получить();
		ПустоеЗначение 		= ОписаниеТипов.ПривестиЗначение(Неопределено);
		ПриведенноеЗначение = ПривестиЗначениеJSON(КлючЗначение.Значение, ОписаниеТипаВсеСсылки, ТипЗнч(ПустоеЗначение)); 
		
		Если ТипЗнч(НайденнаяСтрока.ПараметрЗаявки) = Тип("Строка") Тогда
			//Реквизит Заявки                                                                    
			Соответствие["Реквизиты"].Вставить(НайденнаяСтрока.ПараметрЗаявки, ПриведенноеЗначение);
		Иначе  
			Соответствие["Параметры"].Вставить(НайденнаяСтрока.ПараметрЗаявки, ПриведенноеЗначение);
		КонецЕсли;
		
	КонецЦикла;  
	
	//Создание заявки
	НоваяЗаявка = Справочники.CW_Заявки.СоздатьЭлемент();  
	НоваяЗаявка.ТипОбращения = template.ТипОбращения;
	НоваяЗаявка.ТипПеревозки = template.ТипПеревозки;
	НоваяЗаявка.МенеджерПродаж = template.МенеджерПродаж;

	Для Каждого КлючЗначение из Соответствие["Реквизиты"] Цикл
		НоваяЗаявка[КлючЗначение.Ключ]= КлючЗначение.Значение;                                           
	КонецЦикла;  
	
	Если Не ЗначениеЗаполнено(НоваяЗаявка.ДатаОбращения) Тогда
		НоваяЗаявка.ДатаОбращения = ТекущаяДата();
	КонецЕсли;        
	
	Если ЗначениеЗаполнено(СтрокаШаблона.Контрагент) Тогда
		НоваяЗаявка.Контрагент = СтрокаШаблона.Контрагент;	
	КонецЕсли;
	
	НоваяЗаявка.ГруппыПараметровЗаявки.Загрузить(НоваяЗаявка.ТипПеревозки.ГруппыПараметровЗаявки.Выгрузить());
	
	// переносим параметры из типа   
	МассивПараметровПоТипу = Новый Массив;
	ТаблицаПараметров = НоваяЗаявка.ТипПеревозки.ПараметрыЗаявки.Выгрузить();
	Для Каждого СтрокаПараметров Из ТаблицаПараметров Цикл
		
		НайденнаяСтрока = НоваяЗаявка.ПараметрыЗаявки.Найти(СтрокаПараметров.Параметр, "Параметр");	
		Если НайденнаяСтрока = Неопределено Тогда
			НоваяСтрока = НоваяЗаявка.ПараметрыЗаявки.Добавить();
			НоваяСтрока.Параметр 				= СтрокаПараметров.Параметр;
			НоваяСтрока.ИдентификаторВладельца 	= СтрокаПараметров.ИдентификаторВладельца;
			
			ЗначениеПараметра =	Соответствие["Параметры"].Получить(СтрокаПараметров.Параметр);
			НоваяСтрока.Значение = ЗначениеПараметра;
			Если СтрокаПараметров.Параметр.ЭтоКонтрольнаяДата Тогда
				НоваяСтрока.ЗначениеПлан = ЗначениеПараметра;	
			КонецЕсли;
           МассивПараметровПоТипу.Добавить(СтрокаПараметров.Параметр);
		КонецЕсли;
	КонецЦикла;   
	
	Для Каждого КлючЗначение из  Соответствие["Параметры"] Цикл
		Если МассивПараметровПоТипу.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;   
		
		НоваяСтрока = НоваяЗаявка.ПараметрыЗаявки.Добавить();
		НоваяСтрока.Параметр	= КлючЗначение.Ключ;
		НоваяСтрока.Значение 	= КлючЗначение.Значение;   
		
		Если КлючЗначение.Ключ.ЭтоКонтрольнаяДата Тогда
			НоваяСтрока.ЗначениеПлан = КлючЗначение.Значение;	
		КонецЕсли;
	КонецЦикла;   
	
	НоваяЗаявка.УстановитьНовыйКод();
	НоваяЗаявка.Наименование = "Заявка №"+НоваяЗаявка.Код+" от "+Формат(НоваяЗаявка.ДатаОбращения,"ДФ=dd.MM.yyyy");   
	НоваяЗаявка.Комментарий  = СокрЛП(?(ПустаяСтрока(НоваяЗаявка.Комментарий), "", НоваяЗаявка.Комментарий + Символы.ПС) + "Создано из ЛКК, пользователь "+СтруктураJSON.username+", Дата: "+СокрЛП(ТекущаяДата()));	

	НоваяЗаявка.ОбменДанными.Загрузка = истина;
	НоваяЗаявка.Записать();  
	
	КомментарийФайлов = "Загружено из ЛКК пользователем "+СокрЛП(СтруктураJSON.username);
	
	//Прикрепляем файлы
	Для Каждого ДанныеФайла из СтруктураJSON.files Цикл
		Расширение 		= XMLЗначение(Тип("Строка"), ДанныеФайла.extension);
		ИмяФайла 		= XMLЗначение(Тип("Строка"), ДанныеФайла.name);
		
		Если НЕ ПустаяСтрока(ДанныеФайла.typefile) Тогда
			ТипДокумента 	= XMLЗначение(Тип("СправочникСсылка.CW_ТипыДокументовФайловогоАрхива"), ДанныеФайла.typefile);
		КонецЕсли;
		
		МассивДвоичныхДанных = Новый Массив;
		Для Каждого ЧастьФайла Из ДанныеФайла.parts Цикл
			ДвоичныеДанные = Base64Значение(ЧастьФайла);
			МассивДвоичныхДанных.Добавить(ДвоичныеДанные);
		КонецЦикла;
		
		ПолныеДвоичныеДанные = СоединитьДвоичныеДанные(МассивДвоичныхДанных);   
		
		ПомещенныйФайл = Новый ОписаниеПередаваемогоФайла;
		ПомещенныйФайл.Имя 		= ИмяФайла;
		ПомещенныйФайл.Хранение = ПоместитьВоВременноеХранилище(ПолныеДвоичныеДанные, Новый УникальныйИдентификатор);
		
		ПомещенныеФайлы = Новый Массив;
		ПомещенныеФайлы.Добавить(ПомещенныйФайл);
		
		_УФС.ПрикрепитьФайлы(НоваяЗаявка.Ссылка, ПомещенныеФайлы, ТипДокумента, КомментарийФайлов);
		
	КонецЦикла; 
	//---Прикрепляем файлы

	
	//Запись данных в регистр
	НаборЗаписей = РегистрыСведений.CW_ХарактеристикиЗаявок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(НоваяЗаявка.Ссылка);
	
	//Дополняем данные хранилища значений
	Для Каждого СтрокаПараметров из НоваяЗаявка.ПараметрыЗаявки Цикл
		
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаПараметров,,"ХранилищеДанных");
		
		СтрокаНабора.Порядок = СтрокаПараметров.НомерСтроки;
		СтрокаНабора.Заявка  = НоваяЗаявка.Ссылка;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	//Запись данных в регитр
	
	//Расчет логистического статуса
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НоваяЗаявка.Ссылка);
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	//Расчет логистического статуса
	
	Если ЗначениеЗаполнено(СтрокаШаблона.АдресУведомлений) Тогда
		УведомитьОСозданииНовойЗаявки(НоваяЗаявка.Ссылка, СтрокаШаблона.АдресУведомлений, СтрокаШаблона.ШаблонПисьма);
	КонецЕсли;
	
	Возврат CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);  
	
КонецФункции 
//--Раздел "Заявки"  


//Раздел "Документы"
Функция documentsget(Запрос) 
	
	УстановитьПривилегированныйРежим(Истина);  
	
	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Запрос);
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	   
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//--Пользователь

	//Мастер-профиль
	masterprofileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.masterprofile); 
	master			= Справочники.CW_ВебПрофили.ПолучитьСсылку(masterprofileid);  
 	Если ЗначениеЗаполнено(master) Тогда
		Попытка
			masterПрофильОбъект = master.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если masterПрофильОбъект = Неопределено Тогда
			master = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(master) Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Не удалось идентифицировать основной профиль'; en='The main profile could not be identified'", СокрЛП(ДанныеПользователя.Язык));
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;
	//--Мастер-профиль
	
	startdate 	= XMLЗначение(Тип("Дата"), СтруктураJSON.startdate); 
	enddate		= XMLЗначение(Тип("Дата"), СтруктураJSON.enddate);  
	
	ПараметрыКомплекта 	= CW_ЛичныйКабинетКлиентаСервер.ПолучитьПараметрыКомплекта(master.КомплектПечатныхФорм);
	ВсеДокументы  		= CW_ЛичныйКабинетКлиентаСервер.ПолучитьТаблицуДокументов(master, startdate, enddate, ПараметрыКомплекта); 
	
	СтруктураДокументы = Новый Структура;
	
	Если ПараметрыКомплекта.УказанаПечатнаяФормаСчета Тогда
		ТаблицаСчетов = ПолучитьТаблицуСчетов(ВсеДокументы, ДанныеПользователя.Язык);
		СтруктураДокументы.Вставить("invoce", 	CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ТаблицаСчетов));
	Конецесли;
	Если ПараметрыКомплекта.УказанаПечатнаяФормаРеализации Тогда
		ТаблицаРеализаций = ПолучитьТаблицуРеализаций(ВсеДокументы, ДанныеПользователя.Язык);
		СтруктураДокументы.Вставить("act", 		CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ТаблицаРеализаций));
	Конецесли;
	Если ПараметрыКомплекта.УказанаПечатнаяФормаОтчетаЭкспедитора Тогда
		ТаблицаОтчетЭкспедитора	= ПолучитьТаблицуОтчетЭкспедитора(ВсеДокументы, ДанныеПользователя.Язык);
		СтруктураДокументы.Вставить("report",	CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ТаблицаОтчетЭкспедитора));
	Конецесли;
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("ShowInvoices", 	XMLСтрока(ПараметрыКомплекта.УказанаПечатнаяФормаСчета));
	СтруктураJSON.Вставить("ShowActs", 	 	XMLСтрока(ПараметрыКомплекта.УказанаПечатнаяФормаРеализации));
	СтруктураJSON.Вставить("ShowReports",	XMLСтрока(ПараметрыКомплекта.УказанаПечатнаяФормаОтчетаЭкспедитора)); 
	СтруктураJSON.Вставить("documents",		СтруктураДокументы);

	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);   
	СтрокаJSON  = CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ;
	
КонецФункции 
//--Раздел "Документы"


//Раздел "Отчеты"
Функция checkdebtget(Запрос)  
	
	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Запрос);
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	   
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//Пользователь

	//Мастер-профиль
	masterprofileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.masterprofile); 
	master			= Справочники.CW_ВебПрофили.ПолучитьСсылку(masterprofileid);  
 	Если ЗначениеЗаполнено(master) Тогда
		Попытка
			masterПрофильОбъект = master.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если masterПрофильОбъект = Неопределено Тогда
			master = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(master) Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Не удалось идентифицировать основной профиль'; en='The main profile could not be identified'", СокрЛП(ДанныеПользователя.Язык));
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;
	//Мастер-профиль
	
	Результат = CW_ЛичныйКабинетКлиентаСервер.ПроверитьЗадолженность(master, ДанныеПользователя.Язык);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(Результат.КодСостояния);  
	Ответ.УстановитьТелоИзСтроки(Результат.ТекстОповещения);  
	
	Возврат Ответ;
	
КонецФункции

Функция debtget(Запрос)

	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Запрос);
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	   
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//Пользователь

	//Мастер-профиль
	masterprofileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.masterprofile); 
	master			= Справочники.CW_ВебПрофили.ПолучитьСсылку(masterprofileid);  
 	Если ЗначениеЗаполнено(master) Тогда
		Попытка
			masterПрофильОбъект = master.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если masterПрофильОбъект = Неопределено Тогда
			master = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(master) Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Не удалось идентифицировать основной профиль'; en='The main profile could not be identified'", СокрЛП(ДанныеПользователя.Язык));
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;
	//Мастер-профиль

	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);	 
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	
	
	ДанныеОтчета = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеОтчетаПоЗадолженности(master, СтруктураJSON.optionkey); 

	РасшифровкаJSON	= CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ДанныеОтчета.Расшифровка);
	РезультатJSON	= CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ДанныеОтчета.Результат);

	СтруктураJSON = Новый Структура;   
	СтруктураJSON.Вставить("tabdebt", 		РезультатJSON);
	СтруктураJSON.Вставить("detalisdata", 	РасшифровкаJSON);

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);   
	
	СтрокаJSON  = CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ;

КонецФункции
//--Раздел "Отчеты"


//Работа с файлами
Функция filelistget(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);

	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Запрос); 
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	   
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//Пользователь  
	
	//Профиль
	profileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.profile);  
	Если СтруктураJSON.section = "ЗАЯВКИ" Тогда
		profile 	  = Справочники.CW_ВебПрофилиЗаявок.ПолучитьСсылку(profileid);  
		ПустойПрофиль = ПредопределенноеЗначение("Справочник.CW_ВебПрофилиЗаявок.ПустаяСсылка");   
		ОбъектАрхива  = XMLЗначение(Тип("СправочникСсылка.CW_Заявки"), СтруктураJSON.id); 
	ИначеЕсли СтруктураJSON.section = "ГРУЗОПЕРЕВОЗКИ" Тогда
		profile 	  = Справочники.CW_ВебПрофилиПеревозок.ПолучитьСсылку(profileid);  
		ПустойПрофиль = ПредопределенноеЗначение("Справочник.CW_ВебПрофилиПеревозок.ПустаяСсылка");   
		ОбъектАрхива  = XMLЗначение(Тип("СправочникСсылка.CW_Грузоперевозки"), СтруктураJSON.id); 
	Иначе
		ТекстТела = НСтр("ru='Не удалось определить раздел данных'; en='The data section could not be identified'", СтруктураJSON.language);
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(profile) Тогда
		Попытка
			ПрофильОбъект = profile.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если ПрофильОбъект = Неопределено Тогда
			profile = ПустойПрофиль;   
		КонецЕсли;  
	КонецЕсли;
	//--Профиль
	
	МассивФайлов 		= Новый Массив; 
	Если ДанныеПользователя.ВыгружатьФайлы И profile.ВыгружатьФайлы Тогда
		ЗаполнитьМассивФайлов(ДанныеПользователя, profile, ОбъектАрхива, МассивФайлов);
		Если ТипЗнч(ОбъектАрхива) = Тип("СправочникСсылка.CW_Грузоперевозки") 
			И ЗначениеЗаполнено(ОбъектАрхива.Заказ) Тогда
			ЗаполнитьМассивФайлов(ДанныеПользователя, profile, ОбъектАрхива.Заказ, МассивФайлов); 
		КонецЕсли;
	КонецЕсли; 
	
	ДоступныеТипыФайлов = profile.ТипыФайлов.Выгрузить().ВыгрузитьКолонку("Тип");	
	МассивТиповФайлов 		= Новый Массив;  
	ЗапрашиватьТипФайла = ПолучитьФункциональнуюОпцию("CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив");
	Если ЗапрашиватьТипФайла Тогда     
		ЗаполнитьМассивТиповФайлов(ДоступныеТипыФайлов, МассивТиповФайлов, ДанныеПользователя.Язык); 
	КонецЕсли;
	
	МаксимальныйРазмер = Константы.CW_ЛичныйКабинетОграничениеРазмераФайла.Получить();

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("files", 		МассивФайлов);
	СтруктураJSON.Вставить("filestype", 	МассивТиповФайлов);   
	СтруктураJSON.Вставить("maximumsize", 	XMLСтрока(МаксимальныйРазмер));   
	
	СтрокаJSON = CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);	
	
	Возврат Ответ;  
	
КонецФункции

Функция fileget(Запрос)   
	
	УстановитьПривилегированныйРежим(Истина);  
	
	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Запрос);
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	   
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//Пользователь  
	
	//Объект архива
	fileid 	= XMLЗначение(Тип("УникальныйИдентификатор"), СтруктураJSON.file); 
	file	= Справочники.CW_ОбъектыАрхива.ПолучитьСсылку(fileid);  
	Если ЗначениеЗаполнено(file) Тогда
		Попытка
			fileОбъект = file.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если fileОбъект = Неопределено Тогда
			Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(404); 
			Ответ.УстановитьТелоИзСтроки("Файл не найден");	
			Возврат Ответ;
		КонецЕсли;  
	КонецЕсли;	
	//--Объект архива
	
	ДвоичныеДанные = CW_РаботаСФайламиСервер.ДвоичныеДанныеФайла(file);
	Если ДвоичныеДанные = Неопределено Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(404); 
		Ответ.УстановитьТелоИзСтроки("Файл не доступен");	
		Возврат Ответ;
	КонецЕсли;
	
	ДвоичныеДанныеJSON	= CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ДвоичныеДанные);
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("uid",   		XMLСтрока(file.Объект));
	СтруктураJSON.Вставить("extension",   	XMLСтрока(file.Расширение));
	СтруктураJSON.Вставить("name",  		XMLСтрока(file.Наименование)); 
	СтруктураJSON.Вставить("binary", 		ДвоичныеДанныеJSON); 

	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);   
	СтрокаJSON  = CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ;
	
КонецФункции

Функция attachfilepost(Запрос)    
	
	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Запрос);  
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	   
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//Пользователь

	МассивВладельцев = Новый Массив;
	Для Каждого ИдентификаторОбъекта из СтруктураJSON.shipments Цикл   
		Если СтруктураJSON.section = "ЗАЯВКИ" Тогда
			ОбъектАрхива = XMLЗначение(Тип("СправочникСсылка.CW_Заявки"), ИдентификаторОбъекта);  
		Иначе
			ОбъектАрхива = XMLЗначение(Тип("СправочникСсылка.CW_Грузоперевозки"), ИдентификаторОбъекта);  
		КонецЕсли;
		МассивВладельцев.Добавить(ОбъектАрхива);
	КонецЦикла; 

	КомментарийФайлов = "Загружено из ЛКК пользователем "+СокрЛП(СтруктураJSON.username);
	
	Для Каждого ДанныеФайла из СтруктураJSON.files Цикл
		Расширение 		= XMLЗначение(Тип("Строка"), ДанныеФайла.extension);
		ИмяФайла 		= XMLЗначение(Тип("Строка"), ДанныеФайла.name);
		
		Если НЕ ПустаяСтрока(ДанныеФайла.typefile) Тогда
			ТипДокумента 	= XMLЗначение(Тип("СправочникСсылка.CW_ТипыДокументовФайловогоАрхива"), ДанныеФайла.typefile);
		КонецЕсли;
		
		МассивДвоичныхДанных = Новый Массив;
		Для Каждого ЧастьФайла Из ДанныеФайла.parts Цикл
			ДвоичныеДанные = Base64Значение(ЧастьФайла);
			МассивДвоичныхДанных.Добавить(ДвоичныеДанные);
		КонецЦикла;
		
		ПолныеДвоичныеДанные = СоединитьДвоичныеДанные(МассивДвоичныхДанных);   
		
		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("Хранение", 		ПоместитьВоВременноеХранилище(ПолныеДвоичныеДанные, Новый УникальныйИдентификатор));
		ДанныеФайла.Вставить("Имя",				ИмяФайла);
		ДанныеФайла.Вставить("Расширение",		Расширение);
		ДанныеФайла.Вставить("Комментарий",		КомментарийФайлов);
		
		ПомещенныеФайлы = Новый Массив;
		ПомещенныеФайлы.Добавить(ДанныеФайла);
		
		CW_РаботаСФайламиСервер.ПрикрепитьФайлы(ПомещенныеФайлы, МассивВладельцев, ТипДокумента);
		
	КонецЦикла;  
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);
	Возврат Ответ;   
	
КонецФункции

Функция printfileget(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);

	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Запрос);
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	   
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//--Пользователь

	//Мастер-профиль
	masterprofileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.masterprofile); 
	master			= Справочники.CW_ВебПрофили.ПолучитьСсылку(masterprofileid);  
 	Если ЗначениеЗаполнено(master) Тогда
		Попытка
			masterПрофильОбъект = master.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если masterПрофильОбъект = Неопределено Тогда
			master = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(master) Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Не удалось идентифицировать основной профиль'; en='The main profile could not be identified'", СокрЛП(ДанныеПользователя.Язык));
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;
	//--Мастер-профиль
	
	docid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.docid); 
	type 	= XMLЗначение(Тип("ПеречислениеСсылка.CW_ВидыДокументовКомплекта"),	СтруктураJSON.type);  
	
	Если type = ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.ОтчетЭкспедитора") Тогда
		Документ = Документы.CW_ОтчетЭкспедитора.ПолучитьСсылку(docid);  
	Иначе
		Документ = Документы.CW_ДоходыПоГрузоперевозке.ПолучитьСсылку(docid);  
	КонецЕсли;   
	
	Попытка
		ДокументОбъект = Документ.ПолучитьОбъект();
	Исключение
	КонецПопытки;
	Если ДокументОбъект = Неопределено Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(404);
		Возврат Ответ;	
	КонецЕсли;   
	
	//Инициализация печатных форм
	мПодключаемыеобъекты = Новый Массив;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидДокументаКомплекта", type);  
	
	КомплектПечатныхФорм = master.КомплектПечатныхФорм; 
	мСтроки = КомплектПечатныхФорм.СоставКомплекта.НайтиСтроки(Отбор); 
	
	Для Каждого СтрокаПечатныхФорм из мСтроки Цикл 
		Если Не СтрокаПечатныхФорм.ПодключаемыйОбъект.НеИспользуется Тогда
			мПодключаемыеобъекты.Добавить(СтрокаПечатныхФорм.ПодключаемыйОбъект);
		КонецЕсли;
	КонецЦикла;
	
	Если мПодключаемыеобъекты.Количество() = 0 Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(404);
		ТекстТела = НСтр("ru='Для профиля не указаны доступные печатные формы'; en='The available printing forms are not specified for the profile'", СокрЛП(ДанныеПользователя.Язык));
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;                              
	Конецесли;
	//--Инициализация печатных форм
	
	
	мОбъектыПечати = Новый Массив;
	мОбъектыПечати.Добавить(Документ);  
	
	МассивПечатныхФорм = Новый Массив;
	
	СтруктураВозврата = CW_Печать.ПолучитьПараметрыФормыПечати(мОбъектыПечати,  Новый УникальныйИдентификатор, Истина);
	Если _УФКС.ВыполненоУспешно(СтруктураВозврата) Тогда
		
		ПакетДокументов = ПолучитьИзВременногоХранилища(СтруктураВозврата.ПФ.АдресПакета);
		Для Каждого Документ Из ПакетДокументов.Элементы Цикл 
			Для Каждого ПечатнаяФорма Из Документ.Элементы Цикл  
				НавигационнаяСсылка = ПечатнаяФорма.НавигационнаяСсылка;
				ПодключаемыйОбъект = ПолучитьСсылкуИзНавигационной(НавигационнаяСсылка); 
				Если мПодключаемыеобъекты.Найти(ПодключаемыйОбъект) <> Неопределено Тогда
					МассивПечатныхФорм.Добавить(ПечатнаяФорма);	
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;  
	
	СоответствиеИмениФайла = Новый Соответствие;
	СоответствиеИмениФайла.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.Счет"), 				Нстр("ru='Счет';en='Invoice'", СокрЛП(ДанныеПользователя.Язык)));
	СоответствиеИмениФайла.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.Реализация"), 		Нстр("ru='Акт';en='Act'", СокрЛП(ДанныеПользователя.Язык)));
	СоответствиеИмениФайла.Вставить(ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.ОтчетЭкспедитора"), 	Нстр("ru='Отчет экспедитора';en='Report'", СокрЛП(ДанныеПользователя.Язык)));
	
	ИмяФайлаДокументов = СоответствиеИмениФайла.Получить(type);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("PDF");
	
	Пакет = Новый ПакетОтображаемыхДокументов;
	Для каждого ПечатнаяФорма Из МассивПечатныхФорм Цикл
		ЭлементПакета = Пакет.Состав.Добавить();
		ЭлементПакета.Данные 		= ПоместитьВоВременноеХранилище(ПечатнаяФорма.ПФ, Новый УникальныйИдентификатор);
		ЭлементПакета.Наименование 	= ПечатнаяФорма.Имя;
	КонецЦикла;
	
	Пакет.Записать(ИмяВременногоФайла, ТипФайлаПакетаОтображаемыхДокументов.PDF);
	
	ДвоичныеДанные 	= Новый ДвоичныеДанные(ИмяВременногоФайла); 
	УдалитьФайлы(ИмяВременногоФайла);
	
	ДвоичныеДанныеJSON	= CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ДвоичныеДанные);
	
	СтруктураJSON = новый Структура;
	СтруктураJSON.Вставить("name",		XMLСтрока(ИмяФайлаДокументов));
	СтруктураJSON.Вставить("extension",	XMLСтрока(".pdf"));   
	СтруктураJSON.Вставить("binary", 	ДвоичныеДанныеJSON); 
	
	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);   
	
	СтрокаJSON  = CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ;
	
КонецФункции
 //Работа с файлами

//Получение данных для формы объекта
Функция printtemplateget(Запрос)  
	
	УстановитьПривилегированныйРежим(Истина);  
	
	СтрокаJSON 		= Запрос.ПолучитьТелоКакСтроку();
	СтруктураJSON 	= CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтрокаJSON);  
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		ТекстТела = НСтр("ru='Ошибка авторизации пользователя'; en='User authorization error'", СтруктураJSON.language);
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		ТекстТела = НСтр("ru='Пользователь %1 не найден'; en='User %1 not found'", СтруктураJSON.language);
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;   
	//---Пользователь
	
	//Мастер-профиль
	masterprofileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.masterprofile); 
	master 			= Справочники.CW_ВебПрофили.ПолучитьСсылку(masterprofileid);  
	Если ЗначениеЗаполнено(master) Тогда
		Попытка
			masterПрофильОбъект = master.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если masterПрофильОбъект = Неопределено Тогда
			master = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(master) Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = НСтр("ru='Не удалось идентифицировать основной профиль'; en='The main profile could not be identified'", СокрЛП(ДанныеПользователя.Язык));
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;
	//--Мастер-профиль     

    //Профиль
	profileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.profile);  
	Если СтруктураJSON.section = "ЗАЯВКИ" Тогда
		profile 	  = Справочники.CW_ВебПрофилиЗаявок.ПолучитьСсылку(profileid);  
		ПустойПрофиль = ПредопределенноеЗначение("Справочник.CW_ВебПрофилиЗаявок.ПустаяСсылка");   
		ОбъектАрхива  = XMLЗначение(Тип("СправочникСсылка.CW_Заявки"), СтруктураJSON.id); 
	ИначеЕсли СтруктураJSON.section = "ГРУЗОПЕРЕВОЗКИ" Тогда
		profile 	  = Справочники.CW_ВебПрофилиПеревозок.ПолучитьСсылку(profileid);  
		ПустойПрофиль = ПредопределенноеЗначение("Справочник.CW_ВебПрофилиПеревозок.ПустаяСсылка");   
		ОбъектАрхива  = XMLЗначение(Тип("СправочникСсылка.CW_Грузоперевозки"), СтруктураJSON.id); 
	Иначе
		ТекстТела = НСтр("ru='Не удалось определить раздел данных'; en='The data section could not be identified'", СтруктураJSON.language);
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(profile) Тогда
		Попытка
			ПрофильОбъект = profile.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если ПрофильОбъект = Неопределено Тогда
			profile = ПустойПрофиль;   
		КонецЕсли;  
	КонецЕсли;
    //--Профиль
	
	//Доступные пользователю профили
	ТаблицаДоступныхПрофилей = ПолучитьТаблицуДоступныхПрофилей(ДанныеПользователя, master, СтруктураJSON.section, profile, ПустойПрофиль);
	Если ТаблицаДоступныхПрофилей.Количество() = 0 Тогда
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);	
		Ответ.УстановитьТелоИзСтроки("Нет доступных профилей");
		Возврат Ответ;
	КонецЕсли;
	//--Доступные пользователю профили   
	
	МассивФайлов 		= Новый Массив; 
	viewfiles			= XMLЗначение(Тип("Булево"), СтруктураJSON.viewfiles);  
	Если viewfiles И ЗначениеЗаполнено(ОбъектАрхива) Тогда  
		ЗаполнитьМассивФайлов(ДанныеПользователя, profile, ОбъектАрхива, МассивФайлов); 
		Если ТипЗнч(ОбъектАрхива) = Тип("СправочникСсылка.CW_Грузоперевозки") 
			И ЗначениеЗаполнено(ОбъектАрхива.Заказ) Тогда
			ЗаполнитьМассивФайлов(ДанныеПользователя, profile, ОбъектАрхива.Заказ, МассивФайлов); 
		КонецЕсли;
	КонецЕсли;
	
	ДоступныеТипыФайлов = profile.ТипыФайлов.Выгрузить().ВыгрузитьКолонку("Тип");	
	МассивТиповФайлов 		= Новый Массив;  
	ЗапрашиватьТипФайла = ПолучитьФункциональнуюОпцию("CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив");
	Если ЗапрашиватьТипФайла Тогда     
		ЗаполнитьМассивТиповФайлов(ДоступныеТипыФайлов, МассивТиповФайлов, ДанныеПользователя.Язык); 
	КонецЕсли;
	
	МассивДокументов 	= Новый Массив; 
	viewdocs			= XMLЗначение(Тип("Булево"), СтруктураJSON.viewdocs);  
	Если viewdocs И ЗначениеЗаполнено(ОбъектАрхива) Тогда  
		ЗаполнитьМассивДокументов(master, profile, ОбъектАрхива, МассивДокументов);  
	КонецЕсли;      

	printtemplate 		= Справочники.CW_ВебШаблоныПрофилей.ПолучитьСтруктуруПечатнойФормы(profile.ШаблонПрофиля, СокрЛП(ДанныеПользователя.Язык));
	МаксимальныйРазмер  = Константы.CW_ЛичныйКабинетОграничениеРазмераФайла.Получить();
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("printtemplate",	printtemplate);    
	СтруктураJSON.Вставить("files", 		МассивФайлов);
	СтруктураJSON.Вставить("docs", 			МассивДокументов);
	СтруктураJSON.Вставить("filestype", 	МассивТиповФайлов);   
	СтруктураJSON.Вставить("maximumsize", 	XMLСтрока(МаксимальныйРазмер));   
	
	СтрокаJSON = CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);

	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);	
	
	Возврат Ответ;

КонецФункции  
//Получение данных для формы объекта 

//API
Функция apiprofilesget(Запрос) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаJSON 	  = Запрос.ПолучитьТелоКакСтроку();
	СтруктураJSON =	CW_ОбщийМодульЛичныйКабинетСервер.СериализацияJSON_XDTO(СтрокаJSON);
	
	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		ТекстТела 	= "Authorization error";
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 	  = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела = "User "+СтруктураJSON.username+" not found";
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//--Пользователь
	
	
	//Доступные пользователю профили    
	КодЯзыка = СокрЛП(ДанныеПользователя.Язык);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПользователиВебПрофилей.ОсновнойПрофиль КАК ОсновнойПрофиль,
	               |	CW_ПользователиВебПрофилей.ВебПрофиль КАК ВебПрофиль
	               |ИЗ
	               |	РегистрСведений.CW_ПользователиВебПрофилей КАК CW_ПользователиВебПрофилей
	               |ГДЕ
	               |	CW_ПользователиВебПрофилей.Раздел = &Раздел
	               |	И CW_ПользователиВебПрофилей.Пользователь = &Пользователь
	               |	И CW_ПользователиВебПрофилей.ВебПрофиль.Активный = ИСТИНА
	               |ИТОГИ ПО
	               |	ОсновнойПрофиль"; 
	
	Запрос.УстановитьПараметр("Раздел", 			"ГРУЗОПЕРЕВОЗКИ");
	Запрос.УстановитьПараметр("Пользователь", 		ДанныеПользователя.Пользователь); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДеревоПрофилей = Новый ДеревоЗначений;
	ДеревоПрофилей.Колонки.Добавить("id", 	Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)), 	"id");
	ДеревоПрофилей.Колонки.Добавить("name", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(255)), 	"name");
	
	ВыборкаОсновнойПрофиль = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОсновнойПрофиль.Следующий() Цикл 
		
		ОсновнойПрофильПредставление = НСтр("ru='"+СокрЛП(ВыборкаОсновнойПрофиль.ОсновнойПрофиль.ПредставлениеRU)+"';
											|en='"+СокрЛП(ВыборкаОсновнойПрофиль.ОсновнойПрофиль.ПредставлениеEN)+"'", КодЯзыка);
		
		СтрокаОсновнойПрофиль = ДеревоПрофилей.Строки.Добавить();
		СтрокаОсновнойПрофиль.id 	= XMLСтрока(ВыборкаОсновнойПрофиль.ОсновнойПрофиль); 
		СтрокаОсновнойПрофиль.name 	= XMLСтрока(ОсновнойПрофильПредставление); 
		
		ВыборкаПрофиль = ВыборкаОсновнойПрофиль.Выбрать();
		Пока ВыборкаПрофиль.Следующий() Цикл    
			
			ВебПрофильПредставление = НСтр("ru='"+СокрЛП(ВыборкаПрофиль.ВебПрофиль.ПредставлениеRU)+"';
										   |en='"+СокрЛП(ВыборкаПрофиль.ВебПрофиль.ПредставлениеEN)+"'", КодЯзыка);
			
			СтрокаПрофиль = СтрокаОсновнойПрофиль.Строки.Добавить();
			СтрокаПрофиль.id	= XMLСтрока(ВыборкаПрофиль.ВебПрофиль); 
			СтрокаПрофиль.name 	= XMLСтрока(ВебПрофильПредставление); 
		КонецЦикла;
		
	КонецЦикла;
	
	ДеревоJSON = CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ДеревоПрофилей);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);	
	Ответ.УстановитьТелоИзСтроки(ДеревоJSON);	
	
	Возврат Ответ;

КонецФункции

Функция apitruckingget(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);  
	
	ЗапрашиватьТипФайла 	= ПолучитьФункциональнуюОпцию("CW_ЗапрашиватьТипФайлаПриДобавленииВАрхив");
	
	СтрокаJSON 		= Запрос.ПолучитьТелоКакСтроку();
	СтруктураJSON 	= CW_ОбщийМодульЛичныйКабинетСервер.СериализацияJSON_XDTO(СтрокаJSON);

	//Пользователь
	Если ПустаяСтрока(СтруктураJSON.username) Тогда  
		Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела 	= "Authorization error";
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;	
	
	ДанныеПользователя = CW_ЛичныйКабинетКлиентаСервер.ПолучитьДанныеПользователя(СтруктураJSON.username);
	Если ДанныеПользователя = Неопределено Тогда
		Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела 	= "User "+СтруктураJSON.username+" not found";
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;        
	//--Пользователь
	
	//Мастер-профиль
	masterprofileid	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.masterprofile); 
	master 			= Справочники.CW_ВебПрофили.ПолучитьСсылку(masterprofileid);  
 	Если ЗначениеЗаполнено(master) Тогда
		Попытка
			masterПрофильОбъект = master.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если masterПрофильОбъект = Неопределено Тогда
			master = ПредопределенноеЗначение("Справочник.CW_ВебПрофили.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(master) Тогда
		Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела 	= "The main profile could not be identified";
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;
	//--Мастер-профиль     
	
	//Профиль
	idprofile	= XMLЗначение(Тип("УникальныйИдентификатор"),	СтруктураJSON.profile); 
	profile		= Справочники.CW_ВебПрофилиПеревозок.ПолучитьСсылку(idprofile);  
	Если ЗначениеЗаполнено(idprofile) Тогда
		Попытка
			ПрофильОбъект = profile.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		Если ПрофильОбъект = Неопределено Тогда
			profile = ПредопределенноеЗначение("Справочник.CW_ВебПрофилиЗаявок.ПустаяСсылка");   
		КонецЕсли;  
	КонецЕсли;	
	//--Профиль
	
	//Доступные пользователю профили 
	ТаблицаДоступныхПрофилей = ПолучитьТаблицуДоступныхПрофилей(ДанныеПользователя, master, "ГРУЗОПЕРЕВОЗКИ", profile, ПредопределенноеЗначение("Справочник.CW_ВебПрофилиПеревозок.ПустаяСсылка"));
	Если ТаблицаДоступныхПрофилей.Количество() = 0 Тогда
		Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.Ответ(408);
		ТекстТела 	= "The profile could not be identified";
		Ответ.УстановитьТелоИзСтроки(ТекстТела);
		Возврат Ответ;
	КонецЕсли;
	//Доступные пользователю профили     
	
	СкрытьПолеСсылка = Ложь;
	status	= XMLЗначение(Тип("Число"),		СтруктураJSON.status);     
	ТаблицаПеревозок = CW_ЛичныйКабинетКлиентаСервер.ПолучитьТаблицуПеревозок(master, profile, profile.ШаблонПрофиля, status, СокрЛП(ДанныеПользователя.Язык), СкрытьПолеСсылка);
	
	ВремТаблица = Новый ТаблицаЗначений;
	Для Каждого Колонка из ТаблицаПеревозок.Колонки Цикл 
		
		Если Колонка.ТипЗначения.СодержитТип(Тип("Дата")) Тогда
			ТипКолонки = Новый ОписаниеТипов("Дата");  
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			ТипКолонки = Новый ОписаниеТипов("Число");  
		ИначеЕсли Колонка.ТипЗначения.СодержитТип(Тип("Булево")) Тогда
			ТипКолонки = Новый ОписаниеТипов("Булево");  
		Иначе
			ТипКолонки = Новый ОписаниеТипов("Строка");  
		КонецЕсли;
		
		ВремТаблица.Колонки.Добавить(Колонка.Имя, ТипКолонки, Колонка.Заголовок);
	КонецЦикла; 
	
	Для Каждого СтрокаТаблицы из ТаблицаПеревозок Цикл
		НоваяСтрока = ВремТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;
	
	tableJSON = CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ВремТаблица);   
	
  	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.Ответ(200);	
	Ответ.УстановитьТелоИзСтроки(tableJSON);	
	
	Возврат Ответ;

КонецФункции
//API



//Служебные
Функция ПолучитьТаблицуСчетов(Знач ВсеДокументы, Знач Язык)
	
	ТаблицаСчетов = Новый ТаблицаЗначений;
	ТаблицаСчетов.Колонки.Добавить("ИдентификаторДокумента",		новый ОписаниеТипов("УникальныйИдентификатор"));  
	ТаблицаСчетов.Колонки.Добавить("ИдентификаторВидаДокумента",	новый ОписаниеТипов("Строка"));  
	ТаблицаСчетов.Колонки.Добавить("ДанныеКартинки",				новый ОписаниеТипов("Булево"));  
	ТаблицаСчетов.Колонки.Добавить("Гиперссылка",					новый ОписаниеТипов("Строка"));  

	ТаблицаСчетов.Колонки.Добавить("Дата",			новый ОписаниеТипов("Дата"));
	ТаблицаСчетов.Колонки.Добавить("Номер",			новый ОписаниеТипов("Строка"));  
 	ТаблицаСчетов.Колонки.Добавить("Корректировка",	новый ОписаниеТипов("Булево"));  
	ТаблицаСчетов.Колонки.Добавить("Организация",	новый ОписаниеТипов("Строка"));  
	ТаблицаСчетов.Колонки.Добавить("Контрагент",	новый ОписаниеТипов("Строка"));  
	ТаблицаСчетов.Колонки.Добавить("Сумма",			новый ОписаниеТипов("Число"));  
	ТаблицаСчетов.Колонки.Добавить("Валюта",		новый ОписаниеТипов("Строка"));  

	Отбор = Новый Структура;
	Отбор.Вставить("ВидДокумента", ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.Счет")); 
	
	мСтроки = ВсеДокументы.НайтиСтроки(Отбор); 
	Для Каждого СтрокаТаблицы из мСтроки Цикл   
		ПараметрыНомера = Новый Структура;
		ПараметрыНомера.Вставить("Организация", СтрокаТаблицы.Организация);
		ПараметрыНомера.Вставить("Номер", 		СтрокаТаблицы.Документ.НомерСчета);
		ПараметрыНомера.Вставить("Дата", 		СтрокаТаблицы.Документ.ДатаСчета);
		
		НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(ПараметрыНомера);	   
		
		НоваяСтрока = ТаблицаСчетов.Добавить();
		НоваяСтрока.ИдентификаторДокумента 		= СтрокаТаблицы.Документ.УникальныйИдентификатор();
		НоваяСтрока.ИдентификаторВидаДокумента 	= XMLСтрока(СтрокаТаблицы.ВидДокумента); 
		НоваяСтрока.ДанныеКартинки 				= Истина; 
		НоваяСтрока.Гиперссылка 				= Нстр("ru='Скачать'; en='Download'", СокрЛП(Язык)); 
		
		НоваяСтрока.Дата			= СтрокаТаблицы.Документ.ДатаСчета;
		НоваяСтрока.Номер			= НомерДокумента;   
		НоваяСтрока.Корректировка	= СтрокаТаблицы.Документ.Корректировка;
		НоваяСтрока.Организация 	= CW_ПереводыСервер.ПолучитьПеревод(СтрокаТаблицы.Организация,, Язык);
		НоваяСтрока.Контрагент 		= CW_ПереводыСервер.ПолучитьПеревод(СтрокаТаблицы.Контрагент,, Язык);
		НоваяСтрока.Сумма			= СтрокаТаблицы.Сумма; 
		НоваяСтрока.Валюта			= СокрЛП(СтрокаТаблицы.Валюта.Наименование);
	КонецЦикла; 
	
	Возврат ТаблицаСчетов; 
	
КонецФункции

Функция ПолучитьТаблицуРеализаций(Знач ВсеДокументы, Знач Язык)
	
	ТаблицаРеализаций = Новый ТаблицаЗначений;
	ТаблицаРеализаций.Колонки.Добавить("ИдентификаторДокумента",		новый ОписаниеТипов("УникальныйИдентификатор"));  
	ТаблицаРеализаций.Колонки.Добавить("ИдентификаторВидаДокумента",	новый ОписаниеТипов("Строка"));  
	ТаблицаРеализаций.Колонки.Добавить("ДанныеКартинки",				новый ОписаниеТипов("Булево"));  
	ТаблицаРеализаций.Колонки.Добавить("Гиперссылка",					новый ОписаниеТипов("Строка"));  

	ТаблицаРеализаций.Колонки.Добавить("Дата",	новый ОписаниеТипов("Дата"));
	ТаблицаРеализаций.Колонки.Добавить("Номер",	новый ОписаниеТипов("Строка")); 
	
 	ТаблицаРеализаций.Колонки.Добавить("ЕстьСФ",	новый ОписаниеТипов("Булево"));  
	ТаблицаРеализаций.Колонки.Добавить("ДатаСФ",	новый ОписаниеТипов("Дата"));
	ТаблицаРеализаций.Колонки.Добавить("НомерСФ",	новый ОписаниеТипов("Строка")); 
	
 	ТаблицаРеализаций.Колонки.Добавить("Корректировка",	новый ОписаниеТипов("Булево"));  
	ТаблицаРеализаций.Колонки.Добавить("Организация",	новый ОписаниеТипов("Строка"));  
	ТаблицаРеализаций.Колонки.Добавить("Контрагент",	новый ОписаниеТипов("Строка"));  
	ТаблицаРеализаций.Колонки.Добавить("Сумма",			новый ОписаниеТипов("Число"));  
	ТаблицаРеализаций.Колонки.Добавить("Валюта",		новый ОписаниеТипов("Строка"));  

	Отбор = Новый Структура;
	Отбор.Вставить("ВидДокумента", ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.Реализация")); 
	
	мСтроки = ВсеДокументы.НайтиСтроки(Отбор); 
	Для Каждого СтрокаТаблицы из мСтроки Цикл   
		
		ПараметрыНомера = Новый Структура;
		ПараметрыНомера.Вставить("Организация", СтрокаТаблицы.Организация);
		ПараметрыНомера.Вставить("Номер", 		СтрокаТаблицы.Документ.НомерАкта);
		ПараметрыНомера.Вставить("Дата", 		СтрокаТаблицы.Документ.ДатаАкта);
		НомерАкта = CW_Документы.ПолучитьНомерНаПечать(ПараметрыНомера);	   
		
		ПараметрыНомера = Новый Структура;
		ПараметрыНомера.Вставить("Организация", СтрокаТаблицы.Организация);
		ПараметрыНомера.Вставить("Номер", 		СтрокаТаблицы.Документ.НомерСчетаФактуры);
		ПараметрыНомера.Вставить("Дата", 		СтрокаТаблицы.Документ.ДатаСчетаФактуры);
		НомерСчетаФактуры = CW_Документы.ПолучитьНомерНаПечать(ПараметрыНомера);	   
		
		НоваяСтрока = ТаблицаРеализаций.Добавить();
		НоваяСтрока.ИдентификаторДокумента 		= СтрокаТаблицы.Документ.УникальныйИдентификатор();
		НоваяСтрока.ИдентификаторВидаДокумента 	= XMLСтрока(СтрокаТаблицы.ВидДокумента); 
		НоваяСтрока.ДанныеКартинки 				= Истина; 
		НоваяСтрока.Гиперссылка 				= Нстр("ru='Скачать'; en='Download'", СокрЛП(Язык)); 

		НоваяСтрока.Дата 						= СтрокаТаблицы.Документ.ДатаАкта;   
		НоваяСтрока.Номер 						= НомерАкта;        
		НоваяСтрока.ЕстьСФ 						= СтрокаТаблицы.Документ.ФормируетсяСчетФактура;
		НоваяСтрока.ДатаСФ 						= СтрокаТаблицы.Документ.ДатаСчетаФактуры;
		НоваяСтрока.НомерСФ 					= НомерСчетаФактуры;        
		НоваяСтрока.Корректировка 				= СтрокаТаблицы.Документ.Корректировка;
		НоваяСтрока.Организация 				= CW_ПереводыСервер.ПолучитьПеревод(СтрокаТаблицы.Организация,, Язык);
		НоваяСтрока.Контрагент 					= CW_ПереводыСервер.ПолучитьПеревод(СтрокаТаблицы.Контрагент,, Язык);
		НоваяСтрока.Сумма 						= СтрокаТаблицы.Сумма; 
		НоваяСтрока.Валюта 						= СокрЛП(СтрокаТаблицы.Валюта.Наименование);
	КонецЦикла; 
	
	Возврат ТаблицаРеализаций; 
	
КонецФункции

Функция ПолучитьТаблицуОтчетЭкспедитора(Знач ВсеДокументы, Знач Язык)
	
	ТаблицаОтчетЭкспедитора = Новый ТаблицаЗначений;
	ТаблицаОтчетЭкспедитора.Колонки.Добавить("ИдентификаторДокумента",		новый ОписаниеТипов("УникальныйИдентификатор"));  
	ТаблицаОтчетЭкспедитора.Колонки.Добавить("ИдентификаторВидаДокумента",	новый ОписаниеТипов("Строка"));  
	ТаблицаОтчетЭкспедитора.Колонки.Добавить("ДанныеКартинки",				новый ОписаниеТипов("Булево"));  
	ТаблицаОтчетЭкспедитора.Колонки.Добавить("Гиперссылка",					новый ОписаниеТипов("Строка"));  

	ТаблицаОтчетЭкспедитора.Колонки.Добавить("Дата",			новый ОписаниеТипов("Дата"));
	ТаблицаОтчетЭкспедитора.Колонки.Добавить("Номер",			новый ОписаниеТипов("Строка"));  
	ТаблицаОтчетЭкспедитора.Колонки.Добавить("Организация",		новый ОписаниеТипов("Строка"));  
	ТаблицаОтчетЭкспедитора.Колонки.Добавить("Контрагент",		новый ОписаниеТипов("Строка"));  
	ТаблицаОтчетЭкспедитора.Колонки.Добавить("Сумма",			новый ОписаниеТипов("Число"));  
	ТаблицаОтчетЭкспедитора.Колонки.Добавить("Валюта",			новый ОписаниеТипов("Строка"));  

	Отбор = Новый Структура;
	Отбор.Вставить("ВидДокумента", ПредопределенноеЗначение("Перечисление.CW_ВидыДокументовКомплекта.ОтчетЭкспедитора")); 
	
	мСтроки = ВсеДокументы.НайтиСтроки(Отбор); 
	Для Каждого СтрокаТаблицы из мСтроки Цикл   
		ПараметрыНомера = Новый Структура;
		ПараметрыНомера.Вставить("Организация", СтрокаТаблицы.Организация);
		ПараметрыНомера.Вставить("Номер", 		СтрокаТаблицы.Документ.Номер);
		ПараметрыНомера.Вставить("Дата", 		СтрокаТаблицы.Документ.Дата);
		
		НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(ПараметрыНомера);	   
		
		НоваяСтрока = ТаблицаОтчетЭкспедитора.Добавить();
		НоваяСтрока.ИдентификаторДокумента 		= СтрокаТаблицы.Документ.УникальныйИдентификатор();
		НоваяСтрока.ИдентификаторВидаДокумента 	= XMLСтрока(СтрокаТаблицы.ВидДокумента); 
		НоваяСтрока.ДанныеКартинки 				= Истина; 
		НоваяСтрока.Гиперссылка 				= Нстр("ru='Скачать'; en='Download'", СокрЛП(Язык)); 

		НоваяСтрока.Дата 						= СтрокаТаблицы.Документ.Дата;
		НоваяСтрока.Номер 						= НомерДокумента;   
		НоваяСтрока.Организация 				= CW_ПереводыСервер.ПолучитьПеревод(СтрокаТаблицы.Организация,, Язык);
		НоваяСтрока.Контрагент 					= CW_ПереводыСервер.ПолучитьПеревод(СтрокаТаблицы.Контрагент,, Язык);
		НоваяСтрока.Сумма 						= СтрокаТаблицы.Сумма; 
		НоваяСтрока.Валюта 						= СокрЛП(СтрокаТаблицы.Валюта.Наименование);
	КонецЦикла; 
	
	Возврат ТаблицаОтчетЭкспедитора; 
	
КонецФункции

Процедура УведомитьОСозданииНовойЗаявки(НоваяЗаявка, АдресУведомлений, ШаблонПисьма = Неопределено)  
	
	УчетнаяЗаписьЭлектроннойПочты = Константы.CW_ЛичныйКабинетУчетнаяЗаписьДляОтправкиУведомлений.Получить();
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьЭлектроннойПочты) Тогда
		Возврат;
	КонецЕсли;   
	
	НастройкиПользователя 		= CW_Настройки.ПолучитьНастройкиПользователя();
	
	СтруктураПисьма 			= _ЭП.СтруктураПисьма();
	СтруктураПисьма.Отправитель = УчетнаяЗаписьЭлектроннойПочты;

	_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели, АдресУведомлений);
	
	Если ШаблонПисьма <> Неопределено Тогда
		СтруктураПисьма.Тема = ЗаменитьМакросыПисьма(НоваяЗаявка, ШаблонПисьма, "Тема", НастройкиПользователя);
		
		Тело = ЗаменитьМакросыПисьма(НоваяЗаявка, ШаблонПисьма, "ТелоHTML", НастройкиПользователя);  
		_ЭП.ДобавитьТекст(СтруктураПисьма, Тело);
		
		Для каждого СтрВложения Из ШаблонПисьма.Вложения Цикл
			Картинка = СтрВложения.ДанныеФайла.Получить();
			_ЭП.ДобавитьВложение(СтруктураПисьма,СтрВложения.Имя,"Адрес", Картинка, СтрВложения.Имя);
		КонецЦикла;  
		
		_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели,				ШаблонПисьма.Кому);
		_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели_Копии,		ШаблонПисьма.Копия);
		_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели_СкрытыеКопии,ШаблонПисьма.СкрытаяКопия);

	Иначе
		
		СтруктураПисьма.Тема = "Создана заявка "+ СокрЛП(НоваяЗаявка); 
		
		Тело = 	"Новая заявка "	+ СокрЛП(НоваяЗаявка) +	" от " + Формат(НоваяЗаявка.ДатаОбращения,"ДФ=dd.MM.yyyy")+ "
				|Клиент: "		+ СокрЛП(НоваяЗаявка.Контрагент) +	"            
				|Груз: "		+ СокрЛП(НоваяЗаявка.Груз) +	"   
				|Количество перевозок: "+ СокрЛП(НоваяЗаявка.КоличествоПеревозок);  
		
		_ЭП.ДобавитьТекст(СтруктураПисьма, Тело);
		
	КонецЕсли; 
	
	Если НастройкиПользователя.СкрытаяКопияСебе Тогда
		_ЭП.ДобавитьПолучателейИзСтроки(СтруктураПисьма.Получатели_СкрытыеКопии, УчетнаяЗаписьЭлектроннойПочты.ПочтовыйАдрес);
	КонецЕсли;
	
	Ответ = _ЭП.ОтправитьПисьмо(СтруктураПисьма);
	Если Ответ.Код = 0  Тогда  
		
		ФорматированныйДокумент = Новый ФорматированныйДокумент;
		ФорматированныйДокумент.УстановитьHTML(Тело, Новый Структура);
		
		СтруктураСобытия = Справочники.CW_События.ПоучитьСтруктуруСобытия();
		СтруктураСобытия.ДатаСобытия 	= НоваяЗаявка.ДатаОбращения;
		СтруктураСобытия.Владелец 		= НоваяЗаявка.Контрагент;    
		СтруктураСобытия.ТипСобытия 	= НоваяЗаявка.ТипОбращения;
  		СтруктураСобытия.ОбъектСобытия 	= НоваяЗаявка.Ссылка;
 		СтруктураСобытия.Сообщение 		= ФорматированныйДокумент;
		
		Справочники.CW_События.СоздатьСобытие(СтруктураСобытия,Истина,Истина);
		
	Иначе
		ЗаписьЖурналаРегистрации("Уведомление о новых завках", УровеньЖурналаРегистрации.Предупреждение, НоваяЗаявка,, Ответ.ОписаниеОшибки);   
		
	КонецЕсли;
	
КонецПроцедуры   

Функция ЗаменитьМакросыПисьма(Знач Источник, Знач Шаблон, Знач РеквизитТекста, НастройкиПользователя) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Если ЗначениеЗаполнено(НастройкиПользователя.Пользователь.ФизическоеЛицо) Тогда
		//подучим данные физического лица
		ДанныеФизическогоЛица = ФизическиеЛицаЗарплатаКадры.ДанныеФизическогоЛицаДляРегламентированнойОтчетности(НастройкиПользователя.Пользователь.ФизическоеЛицо,,ТекущаяДата()); // ВызовБП
	Иначе
		//Физ. лицо в пользователе не заполнено, разберем стоку ФИО, 
		мДанныеФизическогоЛица = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НастройкиПользователя.ФИО," ");
		
		ДанныеФизическогоЛица = Новый Структура("Фамилия,Имя,Отчество",Неопределено,Неопределено,Неопределено);
		
		Если мДанныеФизическогоЛица.Количество()>0 Тогда
			ДанныеФизическогоЛица.Фамилия = мДанныеФизическогоЛица[0];	
		КонецЕсли;
		Если мДанныеФизическогоЛица.Количество()>1 Тогда
			ДанныеФизическогоЛица.Имя = мДанныеФизическогоЛица[1];	
		КонецЕсли;
		Если мДанныеФизическогоЛица.Количество()>2 Тогда
			ДанныеФизическогоЛица.Отчество = мДанныеФизическогоЛица[2];	
		КонецЕсли;
	КонецЕсли;

	ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(тип("СправочникСсылка.CW_ВебШаблоныЗаявок"));
	ОписаниеМакросов	= Справочники.CW_ШаблоныСтандартныхПисем.ПолучитьОписаниеМакросов(ИдентификаторОбъектаМетаданных, СтруктураПараметров); 
	мМакросы 			= ПолучитьМакросыПисьма(Шаблон, Шаблон[РеквизитТекста]);
	Текст				= Шаблон[РеквизитТекста]; 
	
	Для Каждого Макрос из мМакросы Цикл
		Формула = ОписаниеМакросов.Получить(Макрос);
		
		Попытка
			ЗначениеФункции = Вычислить(Формула);
		Исключение
			ЗначениеФункции = "";
		КонецПопытки;
				 
		Если Строка(ТипЗнч(ЗначениеФункции)) = Строка(Тип("Дата")) Тогда
			ЗначениеФункции = Формат(ЗначениеФункции, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		Текст = СтрЗаменить(Текст, Макрос, ЗначениеФункции); 
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

Функция ПолучитьМакросыПисьма(Шаблон, ТекстШаблона)
	
	Результат = Новый Массив;
	
	ДеревоМакросов = Справочники.CW_ШаблоныСтандартныхПисем.ПолучитьСписокДоступныхМакросов(Шаблон.ОбъектШаблона);
	
	ОтборСтрок = Новый Структура("ЭтоГруппа", Ложь);
	НайденныеСтроки = ДеревоМакросов.Строки.НайтиСтроки(ОтборСтрок, Истина);
	
	Для Каждого СтрокаДерева из НайденныеСтроки Цикл
		Если СтрНайти(ТекстШаблона, СтрокаДерева.Значение) > 0 Тогда
			Результат.Добавить(СтрокаДерева.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПривестиЗначениеJSON(Знач Знчаение, Знач ОписаниеТипаВсеСсылки, Знач Тип)
	
	Типы = Новый Массив;
	ОписаниеТипов = Новый ОписаниеТипов(Типы);
	ПриведенноеЗначение = ОписаниеТипов.ПривестиЗначение(Неопределено);
	
	Если ЗначениеЗаполнено(Знчаение) Тогда
		Если ОписаниеТипаВсеСсылки.СодержитТип(Тип) Тогда
			Если Не ПустаяСтрока(Знчаение) Тогда
				ПолноеИмя = Метаданные.НайтиПоТипу(Тип).ПолноеИмя();
				Менеджер  = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);   
				ПриведенноеЗначение = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Знчаение));   
			КонецЕсли;
		Иначе 
			ПриведенноеЗначение = XMLЗначение(Тип, Знчаение);  
		КонецЕсли;  
	КонецЕсли;  
	
	Возврат ПриведенноеЗначение;
	
КонецФункции

Функция ПолучитьСсылкуИзНавигационной(НавигационнаяСсылка)
    
    ПерваяТочка = Найти(НавигационнаяСсылка, "e1cib/data/");
    ВтораяТочка = Найти(НавигационнаяСсылка, "?ref=");
    
    ПредставлениеТипа   = Сред(НавигационнаяСсылка, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
    ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
    ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(НавигационнаяСсылка, ВтораяТочка + 5));
	
	Возврат ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
	
КонецФункции 

Функция ПолучитьТаблицуДоступныхПрофилей(Знач ДанныеПользователя, Знач master, Знач Раздел, profile, Знач ПустаяСсылка)
	
	ТаблицаДоступныхПрофилей	= CW_ЛичныйКабинетКлиентаСервер.ПолучитьПрофилиПользователя(ДанныеПользователя, master, Раздел);
	Если ЗначениеЗаполнено(profile) Тогда
		СтрокаДоступныхПрофилей = ТаблицаДоступныхПрофилей.Найти(profile, "ВебПрофиль"); 
		Если СтрокаДоступныхПрофилей = Неопределено Тогда       
			//профиль отсутствует в списке доступных
			profile = ПустаяСсылка;
		КонецЕсли;
	КонецЕсли;
	
	Если ТаблицаДоступныхПрофилей.Количество() > 0 Тогда
		Если profile.Пустая()  Тогда  
			НайденнаяСтрока = ТаблицаДоступныхПрофилей.Найти(Истина, "Основной");
			Если НайденнаяСтрока = Неопределено Тогда
				НайденнаяСтрока = ТаблицаДоступныхПрофилей[0]; 
			Конецесли;
			profile = НайденнаяСтрока.ВебПрофиль; 
		КонецЕсли;                                              
	КонецЕсли;
	
	Возврат ТаблицаДоступныхПрофилей;

КонецФункции

Процедура ЗаполнитьМассивФайлов(Знач ДанныеПользователя, Знач Профиль,  Знач ОбъектАрхива,  МассивФайлов)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыАрхива.Ссылка КАК Ссылка,
	               |	CW_ОбъектыАрхива.ИмяФайла КАК ИмяФайла,
	               |	CW_ОбъектыАрхива.ТипДокумента КАК ТипДокумента
	               |ИЗ
	               |	Справочник.CW_ОбъектыАрхива КАК CW_ОбъектыАрхива
	               |ГДЕ
	               |	CW_ОбъектыАрхива.Объект = &ОбъектАрхива
	               |	И CW_ОбъектыАрхива.ТипДокумента В(&ДоступныеТипыФайлов)";   
	
	ДоступныеТипыФайлов = Профиль.ТипыФайлов.Выгрузить().ВыгрузитьКолонку("Тип");	
	
	Запрос.УстановитьПараметр("ОбъектАрхива", 			ОбъектАрхива);
	Запрос.УстановитьПараметр("ДоступныеТипыФайлов",	ДоступныеТипыФайлов); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл    
		
		НаименованиеТипа = "";
		Если Профиль.ВыводитьТипФайла Тогда
			НаименованиеRU = СокрЛП(Выборка.ТипДокумента);
			Если ДанныеПользователя.Язык <> ПредопределенноеЗначение("Справочник.CW_Языки.ru") тогда
				НаименованиеEN = CW_ПереводыСервер.ПолучитьПеревод(Выборка.ТипДокумента,, ДанныеПользователя.Язык); 
			КонецЕсли;  
			НаименованиеТипа =  Нстр("ru='"+НаименованиеRU+"'; en='"+НаименованиеEN+"'");
		КонецЕсли;
		
		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("id", 		XMLСтрока(Выборка.Ссылка));
		ДанныеФайла.Вставить("name", 	XMLСтрока(Выборка.ИмяФайла));
		ДанныеФайла.Вставить("type", 	XMLСтрока(НаименованиеТипа));  
		МассивФайлов.Добавить(ДанныеФайла); 
		
	КонецЦикла;  
	
КонецПроцедуры  

Процедура ЗаполнитьМассивДокументов(ОсновнойПрофиль, Профиль, Грузоперевозка, МассивДокументов) 

	СоставКомплекта = ОсновнойПрофиль.КомплектПечатныхФорм.СоставКомплекта;

	Запрос = Новый Запрос;    
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозка); 
	
	Запрос.Текст = "ВЫБРАТЬ 
	|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов КАК ДокументДоходов,
	|	CW_ДоходыПоГрузоперевозкам.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ДанныеРегистра
	|ИЗ
	|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
	|ГДЕ
	|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка = &Грузоперевозки
	|	И CW_ДоходыПоГрузоперевозкам.ДокументДоходов <> ЗНАЧЕНИЕ(Документ.CW_ДоходыПоГрузоперевозке.ПустаяСсылка)";
	
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ 
	|	МИНИМУМ(ВТ_ДанныеРегистра.Период) КАК НачалоПериода,
	|	МАКСИМУМ(ВТ_ДанныеРегистра.Период) КАК КонецПериода
	|ИЗ
	|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра";
	
	РезультатПериды = Запрос.Выполнить(); 
	
	мДоступныеДокументы = Новый Массив;
	
	ВыборкаПериоды = РезультатПериды.Выбрать();
	Если ВыборкаПериоды.Следующий() Тогда      
		ПараметрыКомплекта 	= CW_ЛичныйКабинетКлиентаСервер.ПолучитьПараметрыКомплекта(ОсновнойПрофиль.КомплектПечатныхФорм);
		ВсеДокументы 		= CW_ЛичныйКабинетКлиентаСервер.ПолучитьТаблицуДокументов(ОсновнойПрофиль, ВыборкаПериоды.НачалоПериода, ВыборкаПериоды.КонецПериода, ПараметрыКомплекта); 
		
		мДоступныеДокументы = ВсеДокументы.ВыгрузитьКолонку("Документ"); 	
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ДанныеРегистра.ДокументДоходов КАК ДокументДоходов
	|ИЗ
	|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра";
	
	РезультатДокументы = Запрос.Выполнить();
	
	Выборка = РезультатДокументы.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Если мДоступныеДокументы.Найти(Выборка.ДокументДоходов)= Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		мОбъектыПечати = Новый Массив;
		мОбъектыПечати.Добавить(Выборка.ДокументДоходов);
		
		СтруктураВозврата = CW_Печать.ПолучитьПараметрыФормыПечати(мОбъектыПечати,  Новый УникальныйИдентификатор, Истина);
		Если _УФКС.ВыполненоУспешно(СтруктураВозврата) Тогда
			
			ПакетДокументов = ПолучитьИзВременногоХранилища(СтруктураВозврата.ПФ.АдресПакета);
			
			Для Каждого Документ Из ПакетДокументов.Элементы Цикл 
				Для Каждого ПечатнаяФорма Из Документ.Элементы Цикл   
					Если Не CW_ЛичныйКабинетКлиентаСервер.НужноПечатьФорму(Выборка.ДокументДоходов, ПечатнаяФорма, СоставКомплекта) тогда
						Продолжить;
					КонецЕсли;  
					
					ПотокВпамяти = Новый ПотокВПамяти; 
					ПечатнаяФорма.ПФ.Записать(ПотокВпамяти, ТипФайлаТабличногоДокумента.PDF);
					
					ДвоичныеДанные 		= ПотокВпамяти.ЗакрытьИПолучитьДвоичныеДанные();
					ДвоичныеДанныеJSON 	= CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ДвоичныеДанные);
					
					ДанныеФайла = новый Структура;
					ДанныеФайла.Вставить("id", 		XMLСтрока(Документ.Ссылка));
					ДанныеФайла.Вставить("name",	XMLСтрока(ПечатнаяФорма.Имя));
					ДанныеФайла.Вставить("binary",  ДвоичныеДанныеJSON);
					
					МассивДокументов.Добавить(ДанныеФайла);	
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;   
	
КонецПроцедуры

Процедура ЗаполнитьМассивТиповФайлов(Знач ДоступныеТипыФайлов, МассивТиповФайлов, Язык) Экспорт
	
	Для Каждого ТипФайла из ДоступныеТипыФайлов Цикл   
		
		Если Язык = ПредопределенноеЗначение("Справочник.CW_Языки.ПустаяСсылка") Тогда
			Язык = ПредопределенноеЗначение("Справочник.CW_Языки.ru");
		КонецЕсли;  
		
		НаименованиеRU = СокрЛП(ТипФайла);
		Если Язык <> ПредопределенноеЗначение("Справочник.CW_Языки.ru") тогда
			НаименованиеEN = CW_ПереводыСервер.ПолучитьПеревод(ТипФайла,, Язык); 
		КонецЕсли;   
		
		НаименованиеТипа =  Нстр("ru='"+НаименованиеRU+"'; en='"+НаименованиеEN+"'");
		
		ДанныеТипаФайла = Новый Структура;
		ДанныеТипаФайла.Вставить("id", 		XMLСтрока(ТипФайла));
		ДанныеТипаФайла.Вставить("name", 	XMLСтрока(НаименованиеТипа));  
		
		МассивТиповФайлов.Добавить(ДанныеТипаФайла);    
		
	КонецЦикла;

КонецПроцедуры 
//Служебные
