&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

//Подсистема.НумерацияДоговоровИПриложений
&НаКлиенте
Процедура CW_ШаблонНомераДоговораСПокупателемНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьШаблонНомера", ЭтотОбъект, Элемент); 
	СтркутраПараметров = Новый Структура("ШаблонНомера,ИмяКонстанты,ДлинаЧисловйЧасти", НаборКонстант.CW_ШаблонНомераДоговораСПокупателем, "CW_ХранилищеНастройкиПрефиксаДоговора",НаборКонстант.CW_ДлинаЧисловойЧастиНомераДоговора);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонаПрефикса",СтркутраПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура CW_ШаблонНомераПриложенияКДоговоруСПокупателемНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьШаблонНомера", ЭтотОбъект, Элемент); 
	СтркутраПараметров = Новый Структура("ШаблонНомера,ИмяКонстанты,ДлинаЧисловйЧасти", НаборКонстант.CW_ШаблонНомераПриложенияКДоговоруСПокупателем,"CW_ХранилищеНастройкиПрефиксаПриложения",НаборКонстант.CW_ДлинаЧисловойЧастиНомераПриложения);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонаПрефикса",СтркутраПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&Наклиенте
Процедура УстановитьШаблонНомера(Результат, Элемент) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработатьИзменениеШаблона(Элемент.Имя, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеШаблона(ИмяЭлемента, КонстантаЗначение)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
		
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		НаборКонстант[КонстантаИмя] = КонстантаЗначение;
		КонстантаМенеджер = Константы[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//Подсистема.НумерацияДоговоровИПриложений




#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ПриИзмененииРеквизитаФормы(Элемент)
	
	ПриИзмененииРеквизитаНаКлиенте(Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура CW_АвтоматическаяНумерацияДоговоровСПокупателямиПриИзменении(Элемент)
	
	НаборКонстант.CW_АвтоматическаяНумерацияДоговоровСПокупателями =  CW_АвтоматическаяНумерацияДоговоровСПокупателями = 1;
	ИзмененныеКонстанты = АвтоматическаяНумерацияДоговоровСПокупателямиПриИзмененииНаСервере();
	
	ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты);

КонецПроцедуры

&НаКлиенте
Процедура CW_ИспользуетсяВнешнийНумераторДоговоровПриИзменении(Элемент)
	
	НаборКонстант.CW_ИспользуетсяВнешнийНумераторДоговоров =  CW_ИспользуетсяВнешнийНумераторДоговоров = 1;
	ИзмененныеКонстанты = ИспользуетсяВнешнийНумераторДоговоровПриИзменениНаСервере();
	
	ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты);
	
КонецПроцедуры

&НаКлиенте
Процедура CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателямиПриИзменении(Элемент)
	
	НаборКонстант.CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями =  CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями = 1;
	ИзмененныеКонстанты = АвтоматическаяНумерацияПриложенийКДоговорамСПокупателямиПриИзмененииНаСервере();
	
	ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты);
	
КонецПроцедуры

&НаКлиенте
Процедура CW_ИспользуетсяВнешнийНумераторПриложенийПриИзменении(Элемент)
	
	НаборКонстант.CW_ИспользуетсяВнешнийНумераторПриложений =  CW_ИспользуетсяВнешнийНумераторПриложений = 1;
	ИзмененныеКонстанты = ИспользуетсяВнешнийНумераторПриложенийПриИзменениНаСервере();
	
	ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиЗаписиЗначений

&НаСервере
Функция ИспользуетсяВнешнийНумераторПриложенийПриИзменениНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуетсяВнешнийНумераторПриложений");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	НаборКонстант.CW_НумераторДоговоров = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_НумераторПриложений");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ШаблонНомераДоговораСПокупателем = "";
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ШаблонНомераПриложенияКДоговоруСПокупателем");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ДлинаЧисловойЧастиНомераДоговора = 0;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ДлинаЧисловойЧастиНомераПриложения");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	ОбновитьПовторноИспользуемыеЗначения();
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция АвтоматическаяНумерацияПриложенийКДоговорамСПокупателямиПриИзмененииНаСервере()

	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_НумераторДоговоров = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_НумераторПриложений");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ШаблонНомераДоговораСПокупателем = "";
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ШаблонНомераПриложенияКДоговоруСПокупателем");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ДлинаЧисловойЧастиНомераДоговора = 0;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ДлинаЧисловойЧастиНомераПриложения");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ИспользуетсяВнешнийНумераторПриложений = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуетсяВнешнийНумераторПриложений");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	ОбновитьПовторноИспользуемыеЗначения();
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	
	Возврат ИзмененныеКонстанты;

КонецФункции


&НаСервере
Функция ИспользуетсяВнешнийНумераторДоговоровПриИзменениНаСервере()
	
	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуетсяВнешнийНумераторДоговоров");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	НаборКонстант.CW_НумераторДоговоров = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_НумераторДоговоров");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ШаблонНомераДоговораСПокупателем = "";
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ШаблонНомераДоговораСПокупателем");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ДлинаЧисловойЧастиНомераДоговора = 0;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ДлинаЧисловойЧастиНомераДоговора");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	ОбновитьПовторноИспользуемыеЗначения();
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	
	Возврат ИзмененныеКонстанты;
	
КонецФункции

&НаСервере
Функция  АвтоматическаяНумерацияДоговоровСПокупателямиПриИзмененииНаСервере()

	ИзмененныеКонстанты = Новый Массив;
	
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_АвтоматическаяНумерацияДоговоровСПокупателями");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ИспользуетсяВнешнийНумераторДоговоров = Ложь;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ИспользуетсяВнешнийНумераторДоговоров");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_НумераторДоговоров = Неопределено;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_НумераторДоговоров");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ШаблонНомераДоговораСПокупателем = "";
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ШаблонНомераДоговораСПокупателем");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);
	
	НаборКонстант.CW_ДлинаЧисловойЧастиНомераДоговора = 0;
	КонстантаИмя = СохранитьЗначениеРеквизита("НаборКонстант.CW_ДлинаЧисловойЧастиНомераДоговора");
	ИзмененныеКонстанты.Добавить(КонстантаИмя);

	ОбновитьПовторноИспользуемыеЗначения();
	
	УстановитьЗначенияРеквизитовФормы(ЭтаФорма);
	
	Возврат ИзмененныеКонстанты;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьЗначенияРеквизитовФормы(Форма)

	Форма.CW_АвтоматическаяНумерацияДоговоровСПокупателями 	= Константы.CW_АвтоматическаяНумерацияДоговоровСПокупателями.Получить();
	
	Форма.CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями 	= Константы.CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями.Получить();
	Форма.CW_ИспользуетсяВнешнийНумераторПриложений	 					= Константы.CW_ИспользуетсяВнешнийНумераторПриложений.Получить();
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.CW_ИспользуетсяВнешнийНумераторДоговоров.Видимость = Форма.CW_АвтоматическаяНумерацияДоговоровСПокупателями = 1;	
	
	Элементы.ГруппаВстроенныйНумераторДоговоров.Видимость 	= Форма.CW_ИспользуетсяВнешнийНумераторДоговоров = 0
															И Форма.CW_АвтоматическаяНумерацияДоговоровСПокупателями = 1;
	Элементы.ГруппаВнешнийНумераторДоговоров.Видимость		= Форма.CW_ИспользуетсяВнешнийНумераторДоговоров = 1
															И Форма.CW_АвтоматическаяНумерацияДоговоровСПокупателями = 1;
	
	Элементы.CW_ИспользуетсяВнешнийНумераторПриложений.Видимость 	= Форма.CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями = 1;		
	Элементы.ГруппаПредупреждениеНумерацииприложений.Видимость   	= Форма.CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями = 1 
																	И Форма.CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями = 1;
	Элементы.ГруппаВстроенныйНумераторПриложений.Видимость 			= Форма.CW_ИспользуетсяВнешнийНумераторПриложений = 0 
																	И Форма.CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями = 1;
	Элементы.ГруппаВнешнийНумераторПриложений.Видимость				= Форма.CW_ИспользуетсяВнешнийНумераторПриложений = 1 
																	И Форма.CW_АвтоматическаяНумерацияПриложенийКДоговорамСПокупателями = 1;
																	
	Элементы.УстановитьНачальныйНомер.Видимость 					= Форма.CW_АвтоматическаяНумерацияДоговоровСПокупателями = 1;		
																	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(Элемент, ОбновлятьИнтерфейс = Истина)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	КонецЕсли;
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеРеквизитаНаФорме(ИзмененныеКонстанты)
	
	УправлениеФормой(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 0.1, Истина);
	ОбновитьИнтерфейс = Истина;
	
	Для Каждого КонстантаИмя ИЗ ИзмененныеКонстанты Цикл
		Если КонстантаИмя <> "" Тогда
			Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьНачальныйНомер(Команда)
	
	ОткрытьФорму("РегистрСведений.CW_НумерацияДоговоров.ФормаСписка");
	
	
КонецПроцедуры

#КонецОБласти
